{"title": "12 Monkeys", "film_link": "/Movie Scripts/12 Monkeys Script.html", "script_link": "/scripts/12-Monkeys.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>12 Monkeys Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"12 Monkeys Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.25 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David Peoples\" title=\"Scripts by David Peoples\">David Peoples</a><br/>  <a href=\"/writer.php?w=Janet Peoples\" title=\"Scripts by Janet Peoples\">Janet Peoples</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : June 1994<br/>\n<br/>\n<a href=\"/scripts/12-Monkeys.html\">Read \"12 Monkeys\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>Twelve Monkeys</title>\n\n<pre>\n<b>\t\t\t\tTWELVE MONKEYS\n</b><b>\t    \n</b>\t\t          An original screenplay by\n\n\t\t\t\tDavid Peoples\n<b>  \t\t\t\t     &amp;\n</b>\t\t\t\tJanet Peoples\n\n\t\t\t\t Inspired by\n<b>\t    \n</b>\t\t\tLA JETEE, a Chris Marker Film\n\n\n\n\n\n\tProduction Draft\n\tJune 27, 1994\n\n\n\n\n\n\n\n\n<b>\tFADE IN:\n</b>\n<b>\tINT.  CONCOURSE/AIRPORT TERMINAL - BAY\n</b>\n\tCLOSE ON A FACE.  A nine year old boy, YOUNG COLE, his eyes wide\n\twith wonder. watching something intently.  We HEAR the sounds of\n\tthe P.A. SYSTEM droning Flight Information mingled with the\n\tsounds of urgent SHOUTS, running FEET, EXCLAMATIONS.\n\n\tYOUNG COLE'S POV:  twenty yards away, a BLONDE MAN is sprawled on\n\tthe floor, blood oozing from his gaudy Hawaiian shirt.\n\n\tA BRUNETTE in a tight dress, her face obscured from YOUNG COLE'S\n\tview, rushes to the injured man, kneels beside him, ministering\n\tto his wound.\n\n\tANGLE ON YOUNG COLE, flanked by his PARENTS, their faces out of\n\tview, as they steer him away.\n\n\t\t\t\tFATHER'S VOICE (o.s.)\n\t\tCome on, Son --this is no place for us.\n\n\tYOUNG COLE resists momentarily, mesmerized by the drama.\n\n\tYOUNG COLE'S POV:  intermittently visible through a confusion of\n\tFIGURES rushing through the foreground, the BLONDE MAN reaching\n\tup and touching the cheek of the kneeling BRUNETTE in a gesture\n\tof enormous tenderness, a gesture of farewell, while the P.A.\n\tSYSTEM continues its monotonous monotone...\n\n<b>\t\t\t\tP.A. SYSTEM\n</b>\t\tFlight 784 for San Francisco is now\n\t\tready for boarding at inmate number\n\t\t66578, Greely.\n\n<b>\tINT.  PRISON DORMITORY/FUTURE - ETERNAL NIGHT\n</b>\n<b>\t\t\t\tPRISON P.A. SYSTEM\n</b>\t\t--number 5429, Garcia -- number 87645, Cole...\n\n\tCOLE, late thirties, dark hair, comes awake in a bunk cage, one\n\tof many stacked four high along both sides of a long dim\n\tcorridor.  He blinks in the near dark, shaken, disoriented.\n\n\tThen, as he \"recovers\" from his very vivid dream, WE GET OUR\n<b>\tFIRST LOOK AT HIS ENVIRONMENT...A WINDOWLESS UNDERGROUND WORLD OF\n</b><b>\tETERNAL NIGHT SOMETIME IN THE FUTURE...AN ALMOST COLORLESS\n</b><b>\t\"REALITY\" OF BLURRED EDGES AND ECHOEY SOUNDS, MUCH MORE\n</b><b>\t\"DREAMLIKE\" THAN HIS DREAM.\n</b>\n\tFlashlights glare. In the half-light, COLE sees spooky figures,\n\tGUARDS, moving among the locked bunk/cages.\n\n\tCOLE turns and whispers to the occupant of the next cage, JOSE...\n\n<b>\t\t\t\tCOLE\n</b>\t\tSsssst!  Jose, what's going on?\n\n\tJOSE's face is almost lost in shadow.  What there is of it is\n\tyouthful.  He's just a scared Puerto Rican kid!\n\n<b>\t\t\t\tJOSE\n</b>\t\t\"Volunteers\" again.\n\n\tJOSE immediately rolls over and feigns sleep as SCARFACE, a\n\tmenacing guard with a jagged scar running down his cheek, looms\n\tclose to COLE's cage and unlocks it.\n\n<b>\t\t\t\tSCARFACE\n</b>\t\t\"Volunteer duty\".\n\n    The PRISONERS in the other cages watch silently with narrowed eyes.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI didn't volunteer.\n\n<b>\t\t\t\tSCARFACE\n</b>\t\tYou causing trouble again?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(controls his temper)\n\t\tNo trouble.\n\n<b>\tINT.  EQUIPMENT ROOM - ETERNAL NIGHT\n</b>\n\tCOLE's alone, struggling to get into what looks like a space suit\n\tin a room where suits hang like ghosts with blank eyes.\n\n<b>\t\t\tTITLES BEGIN SUPERED OVER THE SCENE\n</b>\n\tCOLE has the torso of the suit on now and is trying to close it.\n\n\t\t\t\tOFFSCREEN VOICE (o.s.)\n\t\tAll openings must be closed.\n\n\tCOLE looks for the source of the voice, a tiny grate in the wall.\n\n\t\t\t\tOFFSCREEN VOICE (o.s.)\n\t\tIf the integrity of the suit is compromised\n\t\tin any way, if the fabric is torn or a zipper\n\t\tnot closed, readmittance will be denied.\n\n<b>\tINT.  SEALED CHAMBER - MINUTES LATER (ETERNAL NIGHT)\n</b>\n\tCOLE, wearing the \"space suit\" and a helmet with a plastic visor,\n\tsteps into a tiny chamber, a kind of air lock.  The heavy door\n\tclangs shut behind him.  He's alone.  COLE'S breath comes quicker\n\tnow as he sucks oxygen from the air tanks on his back.\n\n\tOn the opposite wall is another door with a huge wheel lock.\n\tCOLE turns the heavy wheel, opens the door, steps through It\n\n<b>\tINT.  ELEVATOR - SECONDS LATER (ETERNAL NIGHT)\n</b>\n\tCOLE'S in an ascending elevator that groans and creaks.  He looks\n\tdown at a crudely drawn map he holds in his gloved hand.\n\n\tThe map shows a series of tunnels and ladders.\n\n<b>\tINT.  SEWER PIPE - MINUTES LATER (NIGHT)\n</b>\n\tCOLE pans a flashlight, probing the filthy sewer he's wading through\n\n\tRATS flee the blade of light, scurry across islands of rusting junk.\n\n\tThe flashlight beam settles on a ladder mounted in the wall.\n\n\tReaching the rusted ladder, COLE starts to climb awkwardly.\n\n<b>\tEXT.  CITY STREET/FUTURE - MOMENTS LATER (NIGHT)\n</b>\n\tA SCRAPING NOISE as a heavy man-hole cover is pushed up and moved\n\taside.  COLE'S helmeted head emerges from below.\n\n\tCOLE'S POV THROUGH HIS PLASTIC-VISORED HELMET:  a city in\n\tmoonlight!  A surreal image of abandoned buildings.  No people\n\tanywhere.  The only sounds are the WIND and COLE'S BREATHING.\n\n<b>\tEXT.  ANOTHER CITY STREET - MINUTES LATER (NIGHT)\n</b>\n\tCOLE'S light reveals abandoned vine-covered automobiles.\n<b>\t\n</b>\tMoving to the nearest car, COLE searches in the vines for\n\tsomething.  Finds it.  An insect.\n\n\tCOLE takes the bug in his gloved hand.  As he clumsily inserts it\n\tinto a collection tube, something makes him turn.\n\n\tThere's something across the street in the dark.  Something alive.\n\n\tCOLE points his flashlight and reveals...a BEAR!  Startled by the\n\tlight, the animal blinks, then stands on its rear legs and ROARS.\n\n\tANGLE ON COLE, staring wide-eyed.\n<b>\t\n</b>\tThen, the BEAR sinks down onto all fours and, trying to avoid the\n\tflashlight, it pads quickly down the street.\n\n<b>\tINT.  SUBTERRANEAN PARKING GARAGE - NIGHT\n</b>\n\tUsing the flashlight to see, COLE reaches down to the cracked\n\tfloor and gets another specimen.  DOGSHIT!\n\n\tThe only sound is COLE'S labored BREATHING.\n\n\tThen, a different SOUND.  GRRRR!  A dog.  More GRRRRS.  More\n\tdogs.  Then, a YIP.  Then, VICIOUS GROWLS.  It's a DOGFIGHT!\n\n<b>\tEXT.  STREET - NIGHT (FIRST LIGHT)\n</b>\n\tA giant OWL, perched on an overhead traffic light, raises its wings\n\tand lifts off...rising higher and higher into the brightening sky.\n\n\tBelow, on the street, COLE trudges along, passing deserted\n\tbuildings, windows broken, rusted signs dangling.\n\n<b>\tINT.  DEPARTMENT STORE - NIGHT (FIRST LIGHT)\n</b>\n\tCOLE'S light reveals a spider web just inside the store.  A large\n\tSPIDER tries to hide from the light.\n\n\tCOLE reaches carefully into the web and plucks the spider and\n\tputs it into one of his specimen tubes.\n\n\tThen, he shines his light all around the once elegant store.  There's\n\tnothing but aisle after aisle of moldering consumer goods.\n\n<b>\tEXT.  DEPARTMENT STORE - DAWN\n</b>\n\tAs COLE comes out of the store, the first rays of the sun hit the\n\tbuilding.  COLE stops, squints into the light through his visor.\n\n\tCOLE'S POV:  spray-painted on the wall a long time ago is a stenciled\n\tlogo of twelve monkeys holding hands in a circle.  Over it is\n\twritten, \"WE DID IT!\"\n\n\tCOLE looks up.\n\n\tCOLE'S POV:  high up on a building across the street, a LION\n\tpatrols a ledge, pauses, looks out majestically over his world.\n\n<b>\t\t\tTTTLES END\n</b>\n<b>\tINT.  FIRST UNDERGROUND DECONTAMINATION CHAMBER - ETERNAL NIGHT\n</b>\n\tROARING WATER, powerful torrents gushing from nozzles in the\n\twall, pummel the still-suited COLE.\n\n<b>\tINT.  SECOND UNDERGROUND DECONTAMINATION CHAMBER - ETERNAL NIGHT\n</b>\n\tStark naked and shivering, COLE is being scrubbed with brushes on\n\tlong poles (like the ones used to wash cars) wielded by two HULKING\n\tFIGURES in bulky decontamination suits, their personas lost in their\n\twindowed masks.  It's a grim scene in a grim cement room with damp,\n\tdripping walls.  From an unseen source comes an AMPLIFIED VOICE,\n\n\t\t\t\tAMPLIFIED VOICE (o.s.)\n\t\tRaise your arms above your head.\n\n\tCOLE lifts his arms and the FIGURES start scrubbing his armpits.\n\n<b>\tINT.  TINY CHAMBER - SHORTLY (ETERNAL NIGHT)\n</b>\n\tStill naked, COLE is seated on a stool while a MASKED TECHNICIAN\n\tin a less elaborate, less bulky decontamination outfit draws\n\tblood from COLE'S arm with an old-fashioned hypodermic needle.\n\n\tCOLE glances toward a single, nearly opaque \"window\" of thick\n\tplastic in the rusty iron wall.  VAGUE FIGURES seem to lurk\n\tbehind the translucent aperture, studying him.\n\n\tThe TECHNICIAN slips the blood sample through a slot in the wall.\n\n<b>\tINT.  ENGINEERING OFFICE/FUTURE WORLD - ETERNAL NIGHT\n</b>\n\tUshered in by two guards, TINY and SCARFACE, COLE looks around.\n\n\tCOLE'S POV:  wails hidden by old headlines, articles, maps, charts...\n\ta blackboard covered with elaborate, sophisticated formulae...surfaces\n\theaped with cracked monitors, gerry-rigged computers held together with\n\tstring, lasers lost in tangles of cable, ancient tube amplifiers, a\n\tdilapidated cardboard reconstruction of a city, stacks of moldering\n\tbooks and tattered computer printouts...and, seated at a long conference\n\ttable, staring at COLE, six SCIENTISTS:  an ASTROPHYSICIST, ENGINEER,\n\tBOTANIST, MICROBIOLOGIST, ZOOLOGIST, and a GEOLOGIST.  They represent\n\ta \"modern\" science where brilliant new ideas interface with crude,\n\toutdated, patched-together technologies.\n\n<b>\t\t\t\tTINY\n</b>\t\tJames Cole.  Cleared from quarantine.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tThank you.  You two wait outside.\n\n<b>\t\t\t\tSCARFACE\n</b>\t\tHe's got a history, Doctor.  Violence.\n\n\tCOLE'S eyes return to the walls.\n\n\tHeadlines:  \"CLOCK TICKING!  NO CURE YET!\"\n\n<b>\t\t\t\tSCARFACE\n</b>\t\tAnti-social six -- doing 25 to life.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tI don't think he's going to hurt us.  You're\n\t\tnot going to hurt us, are you Mr. Cole?\n\n\tCOLE'S head turns quickly to the ENGINEER.\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, sir.\n\n\tThe GUARDS exchange a look, shrug, exit, closing the door.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tWhy don't you sit down, Mr. Cole.\n\n\tCOLE goes to the empty chair at the conference table, sits down.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWe want you to tell us about last\n\t\tnight.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI went to the surface and I collected\n\t\tspecimens like I was told.\n\n\tThe SCIENTISTS don't say anything.  They just study him carefully.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(worried)\n\t\tI mashed the spider, didn't I?\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tWe'll get to the spider later, Mr.\n\t\tCole.  Right now, we want to know\n\t\teverything that you saw.\n\n<b>\tINT.  ENGINEERING OFFICE - AN HOUR LATER (ETERNAL NIGHT)\n</b>\n\tCOLE, starting to look very tired now, stands at the blackboard\n\tsketching a detailed map of exactly where he was last night.\n\n<b>\t\t\t\tASTPOPHYSICIST\n</b>\t\tWhere you collected sample #4, what\n\t\tstreet was that?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh...\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tIt's important to observe everything.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI think it was...I'm sure it was 2nd Street.\n\n\tAs the SCIENTISTS start to whisper animatedly among themselves,\n\tCOLE'S eyes drift across the newspaper clippings taped to the\n\twall.  One headline screams, \"VIRUS MUTATING!\"  Another features\n\ta photo of an OLD MAN (DR. MASON, who we'll see again later on)\n\tand the words, SCIENTIST SAYS, \"IT'S TOO LATE FOR CURE\".\n\n\t\t\t\tASTROPHYSICIST'S VOICE (o.s.)\n\t\tClose your eyes, Cole.\n\n\tStartled, COLE closes his eyes obediently.\n\n\tBLACKNESS.  Like COLE, WE SEE NOTHING.  But we HEAR their VOICES.\n\n\t\t\t\tENGINEER'S VOICE (o.s.)\n\t\tTell us in detail what you've seen in\n\t\tthis room.\n\n\t\t\t\tCOLE'S VOICE (o.s.)\n\t\tUh, in this room?  Uh...\n\n\t\t\t\tMICROBIOLOGIST'S VOICE (o.s.)\n\t\tHow many of us are there?\n\n\t\t\t\tCOLE'S VOICE (o.s.)\n\t\tSix...seven, if you count me.\n\n\t\t\t\tASTROPHYSICIST'S VOICE (o.s.)\n\t\tTell us about the pictures on the wall...\n\n\t\t\t\tCOLE'S VOICE (o.s.)\n\t\tUh, you mean the newspapers?\n\n\t\t\t\tA MONTAGE OF OVERLAPPING VOICES (o.s.)\n\t\tTell us about the newspapers.  Can you\n\t\thear my voice?  What do I look like?\n\t\tWhat does he look like, the man who\n\t\tjust spoke?  How old were you when you\n\t\tleft the surface?\n\n\tThe VOICES blur into a cacophony and FADE INTO the droning P.A.\n\tSYSTEM at the airport.\n\n<b>\tINT.  CONCOURSE/AIRPORT - DAY\n</b>\n\tTHE DREAM AGAIN!  But at an earlier moment.  YOUNG COLE, flanked\n\tby his PARENTS, whose faces are out of view, is watching a PLANE\n\tland through one of the big glass windows that lines the concourse\n\tleading to the departure gates.\n\n\t\t\t\tP.A. SYSTEM (o.s.)\n\t\tFlight 784 now boarding at gate...\n\n\tSuddenly, a SHOUT, followed by raised VOICES, interrupts the\n\tmonotonous airport routine.  As YOUNG COLE and his PARENTS turn\n\tto see what's going on, a man we'll call MR. PONYTAIL, his face\n\taverted, hurries past them, bumping YOUNG COLE with a Chicago\n\tHulls Sports Duffle Bag.\n\n<b>\t\t\t\tMR. PONYTAIL\n</b><b>\t\tWATCH IT!\n</b>\n\tYOUNG COLE sees little more than the gaudy pants, the duffle, and\n\tthe man's ponytail flopping as he rushes towards the gates.\n\n\tJust then, a WOMAN'S VOICE cries out, \"NOOOOOOOOO!\"\n\n\tYOUNG COLE turns back toward the Security Check Point just as\n\tTRAVELERS scatter madly, some diving to the floor, others\n\trunning.  A TERRIFIED TRAVELER, hitting the floor close by, looks\n\tup at YOUNG COLE with panicky eyes, and asks....\n<b>\t\n</b><b>\t\t\t\tTERRIFIED TRAVELER\n</b>\t\tJust exactly why did you volunteer?\n\n<b>\tINT.  ENGINEERING OFFICE/FUTURE WORLD - (ETERNAL NIGHT)\n</b>\n\tCOLE comes abruptly awake.  Seated now, he's facing the SCIENTISTS.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWake up, Cole.\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, I didn't hear the...\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\t\t(tapping a pencil on the table)\n\t\tI asked you, why did you volunteer?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWell, the guard woke me up.  He told me\n\t\tI volunteered.\n\n\tThe SCIENTISTS react, whispering urgently among themselves.\n\n\tCOLE starts to nod off again, then comes awake with a start as\n\tthe ENGINEER speaks to him.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tWe appreciate you volunteering.  You're\n\t\ta very good observer, Cole.\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, thank you.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tYou'll get a reduction in sentence.\n\n\tCOLE keeps his face impassive.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tTo be determined by the proper authorities.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tYou don't want to jeopardize that reduction,\n\t\tdo you, Cole?  Have it taken away?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, sir!\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWe have a very advanced program, something\n\t\tvery different, requires very skilled people.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tAn opportunity to reduce your sentence\n\t\tconsiderably...\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tAnd possibly play an important role in\n\t\treturning the human race to the surface\n\t\tof the earth.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tWe want tough minded people.  Strong\n\t\tmentally.  We've had some...misfortunes\n\t\twith \"unstable\" types.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tFor a man in your position...an opportunity.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tNot to volunteer could be a real mistake.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\t\t(tapping his pencil again)\n\t\tDefinitely a mistake!\n\n\tCOLE gives away nothing.  He's in a box here.  He has no choices.\n\tHe stares at the tapping pencil.\n\n<b>\tINT.  ART GALLERY - NIGHT\n</b>\n\tA strikingly \"real\" world of bright colors.  Extravagant paintings\n\tadorn the walls.  A POET, tiny and ruddy faced, squints over his\n\tglasses as he reads in a booming voice to an AUDIENCE of thirty\n\tseated on folding chairs.\n\n<b>\t\t\t\tPOET\n</b>\t\tStill among the myriad microwaves, the\n\t\tinfra-red messages, the gigabytes of ones\n\t\tand zeroes, we find words, infinitesimally\n\t\tsmall, byte-sized now, tinier even than\n\t\tscience lurking in some vague electricity\n\t\twhere, if we listen we can hear the solitary\n\t\tvoice of that poet telling us,\n\t\t\"We are no other than a moving row\n\t\tOf Magic shadow-shapes that come and go\n\t\tRound with the Sun-illumined Lantern hold\n\t\tIn Midnight by the Master of the show.\"\n\n\tAs the POET reads, we STUDY the audience, mostly YUPPIE CULTURE\n\tJUNKIES or BOHEMIANS.  Among them, a light-haired woman of twenty-\n\teight, soberly dressed, wearing glasses.  She's KATHRYN RAILLY.  And\n\tit's her beeper that suddenly BEEPS.  BEEP!  BEEP!\n\n\t\t\t\tPOET'S VOICE (o.s.)\n\t\t\"The Moving Finger writes; and, having writ,\n\t\tMoves on:  nor all your Piety nor Wit\n\t\tShall lure it back to cancel half a Line,\n\t\tNor all your Tears wash out a Word of it.\"\n\n\tBEEP!  BEEP!  Scowling at the outrageous interruption, the POET\n\tlooks up from the text just as RAILLY, tumbling, shuts off the\n\tbeeper and rises, embarrassed.  As she makes her way to an exit,\n\tthe glaring POET continues...\n\n<b>\t\t\t\tPOET\n</b>\t\t\"Yesterday This Day's Madness did prepare;\n\t\tTomorrow's Silence, Triumph or Despair:\n\t\tDrink!  for you know not whence you came, nor why:\n\t\tDrink!  for you know not why you go, nor where.\"\n\n<b>\tINT.  CORRIDOR/POLICE STATION - NIGHT\n</b>\n\tDETECTIVE FRANKI leads RAILLY past crowded holding cells.\n\n<b>\t\t\t\tFRANKI\n</b>\t\t-- so they get there and they ask the guy\n\t\treal nice for some kind of i.d., and he gets\n\t\tagitated, starts screaming about viruses.\n\t\tTotally irrational, totally disoriented,\n\t\tdoesn't know where he is, what day it is,\n\t\talla that stuff.  All they got was his\n\t\tname.  They figure he's stoned out of\n\t\this mind, it's some kinda psychotic\n\t\tepisode, so they're gonna bring him...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHe's been tested for drugs?\n\n<b>\t\t\t\tFRANKI\n</b>\t\tNegative for drugs.  But he took on\n\t\tfive cops like he was dusted to the\n\t\teyeballs.  No drugs.  You believe that?\n\n\tFRANKI pauses, indicating a tiny observation window of thick meshed\n\tglass in an otherwise solid door, and RAILLY looks through it.\n\n\tRAILLY'S POV THROUGH THE WINDOW:  a MAN, his back to her, in\n\tstrait-jacket and prison denims, examining the wall of the padded\n\tcell with the distorted intensity of a \"mental case\".\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou have him in restraints.\n\n<b>\t\t\t\tFRANKI\n</b>\t\tWere you listening?  We got two officers in\n\t\tthe hospital.  Yeah, he's in restraints, plus\n\t\tthe medic gave him enough stellazine to kill\n\t\ta horse.  Look at him!  Still on his feet.\n\n\tRAILLY'S POV THROUGH THE WINDOW:  the MAN in the cell turns, looks\n\tright at her.  In spite of the cuts and welts, it's clearly COLE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThat would explain the bruises, I\n\t\tguess.  The struggle.\n\n<b>\t\t\t\tFRANKI\n</b>\t\tYou want to go in?  Examine him?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYes, please.  You said he gave a name...\n\n<b>\t\t\t\tFRANKI\n</b>\t\t\t(unlocking the door)\n\t\tJames Cole.  That's everything we got.  None\n\t\tof the James Coles on the computer match him.\n\t\tNo license, no prints, no warrants.  Nothing.\n\t\tYou want me to go in with you?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(entering)\n\t\tNo, thank you.\n\n<b>\t\t\t\tFRANKI\n</b>\t\tI'll be right here...just in case.\n\n<b>\tINT.  ISOLATION CELL\n</b>\n\tCOLE stares at RAILLY.  The environment is intensely real...vivid\n\tcolors...each sound, however slight, very distinct, almost loud...\n\tand yet she appears to him almost like a vision.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tMr. Cole?  My name is Doctor Railly.\n\t\tI'm a psychiatrist.  I work for the\n\t\tCounty -- I don't work for the police.\n\t\tMy only concern is your well being --\n\t\tdo you understand that?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI need to go now.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI'm going to be completely honest.  I'm\n\t\tnot going to lie to you.  I can't make\n\t\tthe police let you go...but I do want\n\t\tto help you.  And I want you to trust\n\t\tme.  Can you do that, James?  May I\n\t\tcall you \"James\"?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\"James\"!  Nobody ever calls me that.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(frowns, studies him)\n\t\tHave you been a patient at County?\n\t\tHave I seen you someplace?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, not possible.  Listen, I have to\n\t\tget out of here.  I'm supposed to be\n\t\tgetting information.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat kind of information?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt won't help you.  You can't do anything\n\t\tabout it.  You can't change anything.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tChange what?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI need to go.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tDo you know why you're here, James.\n\n<b>\t\t\t\tCOLE\n</b>\t\tBecause I'm a good observer.  Because I\n\t\thave a tough mind.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI see.  You don't remember assaulting a\n\t\tpolice officer...several officers?\n\n<b>\t\t\t\tCOLE\n</b>\t\tThey wanted identification.  I don't have\n\t\tany identification.  I wasn't trying to\n\t\thurt them.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou don't have a driver's license,\n\t\tJames?  Or a Social Security card?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo.\n<b>\t\n</b><b>\t\t\t\tRAILLY\n</b>\t\tWhy not?  Most people have some ID.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou wouldn't understand.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou've been in an institution, haven't\n\t\tyou, James?  A hospital?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI have to go.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tA jail?  Prison?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUnderground.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHiding?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI love this air.  This is wonderful air.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat's wonderful about the air, James?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt's so clean.  No germs.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou're afraid of germs?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI have to go.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhy do you think there aren't any germs\n\t\tin the air, James?\n\n<b>\t\t\t\tCOLE\n</b>\t\tThis is April, right?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJuly.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(sudden panic)\n\t\tJuly?!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tDo you know what year it is?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat year is it?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat year do you think it is?\n\n<b>\t\t\t\tCOLE\n</b><b>\t\t1995?\n</b>\n<b>\t\t\t\tRAILLY\n</b>\t\tYou think it's July of 1995?  That's\n\t\tthe future, James.  Do you think you're\n\t\tliving in the future?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(slightly confused)\n\t\tNo, 1995 is the past.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t1995 is the future, James.  This is 1989.\n\n\tCOLE looks stunned.\n\n<b>\tINT.  POLICE STATION CORRIDOR - MORNING\n</b>\n\tCOLE, bound tightly by the strait-jacket, heavy manacles on his\n\tankles, is being escorted down the corridor by two surly POLICEMEN.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhere are you taking me?\n\n<b>\t\t\t\tPOLICEMAN #1\n</b>\t\tSouth of France, buddy.  Fancy hotel.\n\t\tYou're gonna love it.\n\n<b>\t\t\t\tCOLE\n</b>\t\tSouth of France?!  I don't want to go\n\t\tto the South of France.  I want to make\n\t\ta telephone call.\n\n\tPOLICEMAN #2 smirks as he unlocks a heavy steel door.\n\n<b>\t\t\t\tPOLICEMAN #2\n</b>\t\tZip it, scumbag -- you fooled the shrink\n\t\twith your act, but you don't fool us.\n\n\tThen, POLICEMAN #2 swings the steel door open and sunlight\n\toverwhelms COLE, blinding him in a dazzling fury of white light.\n\n<b>\tEXT.  CITY STREET/MINI-VAN - DAY\n</b>\n\tA Mini-van, the kind of vehicle used to transport a half dozen\n\tprisoners, crawls through a busy street.  The Police Department\n\tlogo is prominent on the side of the van beneath barred windows.\n\n<b>\tINT. COUNTY HOSPITAL/SHOWERS - AN HOUR LATER (MORNING)\n</b>\n\tFierce spray recalls the decontamination in the future.  COLE\n\tstands stark naked under the shower while two muscular attendants,\n\tPALMER and BILLINGS, supervise.\n\n\tAs PALMER shuts off the water, BILLINGS hands COLE a towel and\n\tstarts inspecting his scalp...\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tLemme see your head, Jimbo, see if you\n\t\tgot any creepy crawlies.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI need to make a telephone call.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\t\t(pulling Cole's head)\n\t\tGotta work that out with a doctor, Jimbo.\n\t\tCan't make no calls 'til the doctor says.\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt's very important.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tWhat chew gotta do, Jimbo, is take it\n\t\teasy, relax into things.  We all gonna\n\t\tget along fine if you just relax.\n\n\tCOLE gets the hint of menace in the message and submits to the\n\tlice inspection, only his eyes revealing his frustration.\n\n<b>\tINT.  HOSPITAL/DAYROOM - HALF AN HOUR LATER (DAY)\n</b>\n\tCOLE stands in the doorway, stunned by his first sight of the\n\tlarge room.  His eyes go to the heavily-grilled windows where\n\tlight pours in from outside.  Then, to the TV, where a CARTOON\n\tCOMMERCIAL makes raucous noises.\n\n\tPATIENTS, in K-Mart street clothes or ratty robes, stare gloomily\n\tat the TV, or play cards, pace, or just stare blankly.\n\n\tBILLINGS is at COLE'S side, beckoning to a patient, JEFFREY MASON,\n\ta twenty year old white youth dressed in khakis and a plaid shirt.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tJeffrey.  Yo!  Jeffrey.  This here is James.\n\t\tWhyncha show James around?  Tell him the TV\n\t\trules, show him the games an' stuff, okay?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(with a sly look)\n\t\tHow much you gonna pay me?  Huh?  I'd\n\t\tbe doing your job.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tFive thousand dollars, my man.  That\n\t\tenough?  I'll wire it to your account\n\t\tas usual, okay?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tOkay, Billings.  Five thousand.  That's\n\t\tenough.  Five thousand dollars.  I'll\n\t\tgive him the Deluxe Mental Hospital Tour.\n\n\tAs BILLINGS walks away chuckling, JEFFREY turns to COLE.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tKid around, kid around.  It makes them feel\n\t\tgood, we're all pals.  We're prisoners, they're\n\t\tthe guards, but it's all in good fun, you see?\n\n\tCOLE nods and JEFFREY indicates card tables where PATIENTS are\n\tplaying cards, checkers, chess, or working on jig saw puzzles.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tHere's the games.  Games vegitize you.\n\t\tIf you play the games, you're\n\t\tvoluntarily taking a tranquilizer.\n\n\tCOLE sees a partially completed puzzle of the well-known painting,\n\tTHE PEACEABLE KINGDOM, depicting a serene world of animals in harmony.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhat'd they give you?  Thorazine?  How\n\t\tmuch?  Learn your drugs -- know your doses.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI need to make a telephone call.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tA telephone call?  That's communication\n\t\twith the outside world!  Doctor's\n\t\tdiscretion.  Hey, if alla these nuts\n\t\tcould just make phone calls, it could\n\t\tspread.  Insanity oozing through telephone\n\t\tcables, oozing into the ears of all those\n\t\tpoor sane people, infecting them!  Whackos\n\t\teverywhere!  A plague of madness.\n\t\t\t(suddenly sly and confidential)\n\t\tIn fact, very few of us here are actually\n\t\tmentally ill.  I'm not saying you're\n\t\tnot mentally ill, for all I know you're\n\t\tcrazy as a loon.  But that's not why\n\t\tyou're here.  Why you're here is because\n\t\tof the system, because of the economy.\n\t\t\t(indicating the TV)\n\t\tThere's the TV.  It's all right there.\n\t\tCommercials.  We are not productive\n\t\tanymore, they don't need us to make\n\t\tthings anymore, it's all automated.  What\n\t\tare we for then?  We're consumers.  Okay,\n\t\tbuy a lot of stuff, you're a good citizen.\n\t\tBut if you don't buy a lot of stuff, you\n\t\tknow what?  You're mentally ill! That's\n\t\ta fact!  If you don't buy things...toilet\n\t\tpaper, new cars, computerized blenders,\n\t\telectrically operated sexual devices...\n\t\t\t(getting hysterical)\n<b>\t\tSCREWDRIVERS WITH MINIATURE BUILT-IN\n</b><b>\t\tRADAR DEVICES, STEREO SYSTEMS WITH\n</b><b>\t\tBRAIN IMPLANTED HEADPHONES, VOICE-\n</b><b>\t\tACTIVATED COMPUTERS, AND...\n</b>\n\tA woman orderly, TERRY, turns from the feeble PATIENT she's helping.\n\n<b>\t\t\t\tTERRY\n</b>\t\tTake it easy, Jeffrey.  Be calm.\n\n\tAbruptly, JEFFREY stifles his hysteria, takes a deep breath and\n\tcontinues, completely calm now.  But COLE isn't listening.  He's\n\tmesmerized by the TV.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tSo if you want to watch a particular\n\t\tprogram, say \"All My Children\" or\n\t\tsomething, you go to the Charge Nurse\n\t\tand tell her what day and time the show\n\t\tyou want to see is on.  But you have to\n\t\ttell her before the show is scheduled\n\t\tto be on.  There was this one guy who\n\t\twas always requesting shows that had already\n\t\tplayed.  He couldn't quite grasp the\n\t\tidea that the Charge Nurse couldn't\n\t\tjust make it be yesterday for him, turn\n\t\tback time ha ha.  What a fruitcake!!\n\n\tThis last thought actually penetrates COLE'S focus on the TV and\n\the turns to JEFFREY who's picking up speed again.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tSeriously, more and more people are\n\t\tbeing defined now as mentally ill.  Why?\n\t\tBecause they're not consuming on their\n\t\town.  But as patients, they becone\n\t\tconsumers of mental health care.  And\n\t\tthis gives the so-called sane people work!\n\t\t\t(hysteria again)\n<b>\t\tWHOOO!  SHOCK THERAPY!  GROUP THERAPY!\n</b><b>\t\tHALLUCINATIONS!  THERAPEUTIC DRUGS!\n</b><b>\t\tIGGIDY DIGGIDY DIG!  PERFECT!  THE\n</b><b>\t\tSYSTEM IN HARMONY LIKE A BIG MACHINE...\n</b>\n<b>\t\t\t\tTERRY\n</b>\t\tOkay, that's it, Jeffrey, you're gonna\n\t\tget a shot.  I warned you...\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(calming himself, smiling)\n\t\tRight!  Right!  Carried away, heh heh.\n\t\tI got \"carried away\".  Explaining the\n\t\tworkings of...the institution.\n\n\tJust then, TJ WASHINGTON, a somber-looking African American in a\n\tbathrobe, taps COLE on the shoulder.\n\n<b>\t\t\t\tTJ WASHINGTON\n</b>\t\tI don't really come from outer space.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tThis is TJ Washington, Jim -- he\n\t\tdoesn't really come from outer space.\n\n<b>\t\t\t\tTJ WASHINGTON\n</b>\t\tDon't mock me, my friend.\n\t\t\t(to Cole)\n\t\tIt's a condition of \"mental divergence\".\n\t\tI find myself on another planet, Ogo,\n\t\tpart of an intellectual elite, preparing\n\t\tto subjugate barbarian hordes on Pluto.\n\t\tBut even though it's a totally convincing\n\t\treality in every way...I can feel, breathe,\n\t\thear...nevertheless, Ogo is actually a\n\t\tconstruct of my psyche.  I am mentally\n\t\tdivergent in that I am escaping certain\n\t\tunnamed realities that plague my life\n\t\there.  When I stop going there, I will\n\t\tbe well.  Are you also divergent, friend?\n\n\tThe P.A. SYSTEM interrupts, startling COLE.\n\n\t\t\t\tP.A. SYSTEM (v.o.)\n\t\tJames Cole.  Report to Staff.  James Cole!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tStaff!  Whoo!  Time for Staff.  Now the\n\t\tgeniuses cure you.  Hallelujah!\n\n<b>\tINT.  PSYCH WARD CONFERENCE ROOM - MINUTES LATER (DAY)\n</b>\n\tCOLE is agitated, speaking forcefully.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThis is a place for crazy people!  I'm\n\t\tnot crazy!\n\n\tRAILLY, four other PSYCHIATRIC RESIDENTS, including RAILLY'S best\n\tfriend, MARILOU MARTIN, and their chief, DR. OWEN FLETCHER, sit\n\taround a beat-up conference table, watching COLE, who sits facing\n\tthe doctors, with BILLINGS looming behind him.  (Some of the DOCTORS\n\tbear a strong resemblance to the SCIENTISTS OF THE FUTURE.)\n\n<b>\t\t\t\tRESIDENT #1\n</b>\t\tWe don't use that term...\"crazy\", Mr. Cole.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWell, you've got some real nuts in here!\n\t\tListen to me, all of you -- I have to\n\t\ttell you something that's going to be\n\t\tdifficult for you to understand, but...\n\n<b>\t\t\t\tDR. RAILLY\n</b>\t\tJames...please.  These are all doctors\n\t\there and we want to help you.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tMr. Cole -- last night you told Dr.\n\t\tRailly you thought it was...\n\t\t\t(checking a file)\n\t\t1995. ... How about right now?  Do you\n\t\tknow what year it is right now?\n\n<b>\t\t\t\tCOLE\n</b>\t\t1989.  Look, I'm not confused.  There's been\n\t\ta mistake, I've been sent to the wrong place.\n\n\tSuddenly, COLE reaches out and BILLINGS lunges forward, but COLE\n\tis just grabbing a pad and pencil.\n\n<b>\t\t\t\tCOLE\n</b>\t\tHey, I'm not going to hurt anybody.\n\n\tFLETCHER restrains BILLINGS with a hand signal.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(drawing)\n\t\tDo any of you know anything about the\n\t\tArmy of the Twelve Monkeys?  They paint\n\t\tthis, stencil it, on buildings, all\n\t\tover the place.\n\n\tCOLE waves a sketch of the dancing monkey logo we saw earlier.\n\n<b>\t\t\t\tDR. CASEY\n</b>\t\tMr. Cole...\n\n<b>\t\t\t\tCOLE\n</b>\t\tRight.  I guess you wouldn't, this is\n\t\t1989, they're probably not active yet.\n\t\tThat makes sense!  Okay.  Listen to me,\n\t\tthree billion people died in 1995.\n\t\tThree billion, got that?  Almost\n\t\tthe whole population.  Of the world!\n\t\tOnly about one percent survived.\n\n\tDOCTORS exchange knowing looks.  This is an old story, apparently.\n\n<b>\t\t\t\tRESIDENT #2\n</b>\t\tAre you going to save us, Mr. Cole?\n\n<b>\t\t\t\tCOLE\n</b>\t\tSave you?  How can I save you?  It\n\t\talready happened!  I can't save you.  I'm\n\t\tsimply trying to get some information for\n\t\tpeople in the present so that someday...\n\t\t\t(sees their eyes)\n\t\tYou don't believe me.  You think I'm\n\t\tcrazy.  But I'm not crazy.  I'm a convict,\n\t\tsure, I have a quick temper, but I'm as\n\t\tsane as anyone in this room.  I...\n\n\tCOLE stops, sees DR. FLETCHER tapping his pencil.  COLE'S seen\n\tthat tapping before -- in the future!  It disorients him.\n\n<b>\t\t\t\tDR. RAILLY\n</b>\t\tCan you tell us the name of the prison\n\t\tyou've come from?\n\n\tCOLE doesn't answer.  He's staring at the tapping pencil.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tDoes this bother you, Mr. Cole?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(recovering, new tack)\n\t\tNo!  Look, I don't belong here!  What I\n\t\tneed to do is make a telephone call to\n\t\tstraighten everything out.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tWho would you call, Mr. Cole, who would\n\t\tstraighten everything out?\n\n<b>\t\t\t\tCOLE\n</b>\t\tScientists.  I'm supposed to report in\n\t\tto them.  They'll want to know they\n\t\tsent me to the wrong time.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tSo you could talk to these scientists\n\t\tand they do what?  Send you to the future?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, no.  I can't talk to them.  It's called,\n\t\t\"voice mail\".  I'm supposed to leave messages.\n\t\tThey monitor it from the present.\n\n<b>\t\t\t\tRESIDENT #2\n</b>\t\t\"From the present.\"  We're not in the\n\t\tpresent now, Mr. Cole?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, no.  This is the past.  This has\n\t\talready happened.  Listen...\n\n<b>\t\t\t\tRESIDENT #3\n</b>\t\tMr. Cole, you belong in 1995 -- that's\n\t\tthe present, is that it?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, 1995 is the past, too.  Look...\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tThese scientists, Mr. Cole?  Are they\n\t\tdoctors like ourselves?\n\n\tTwo of the residents exchange quick knowing looks.\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo!  I mean yes, but... Look, I've been given\n\t\ta lot of drugs but I'm still perfectly lucid.\n\t\tYou have to let me use the phone.  One call!\n\n\tCOLE looks desperately toward RAILLY, pleading eyes meeting hers.\n\n<b>\tINT.  LOW RENT APARTMENT - DAY\n</b>\n\tFour little KIDS SCREAM and SQUABBLE while the phone CHIRPS\n\tinsistently in the tiny, cluttered apartment and a harried MOTHER\n\tlunges for the phone, answers sharply...\n\n<b>\t\t\t\tMOTHER\n</b>\t\tYes?\n\t\t\t(listens, frowns, then)\n\t\tWhaaaaat?  \"Voice mail\"!  I don't know\n\t\twhat you're talkin' about. ... Is this\n\t\ta joke?  I don't know any scientists.\n\t\tJames who?  Never heard of you!\n\n\tThe MOTHER slams down the phone.\n\n<b>\tINT.  RAILLY'S OFFICE/COUNTY HOSPITAL - DAY\n</b>\n\tA dismayed COLE still has the receiver in his hand.  Sympathetically,\n\tRAILLY takes it from him.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt wasn't who you expected?\n\n\tCOLE is clearly agitated, starts to pace, upset.  Nuts?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt was some lady.  She didn't know anything.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tPerhaps it was a wrong number...\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo.  That's the reason they chose me --\n\t\tI remember things.\n\n\tRAILLY frowns, studying the distracted man with intense interest.\n\tIt's clear COLE is becoming a special patient and RAILLY'S cool,\n\tdetached demeanor is giving way ever so slightly.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, where did you grow up?  Was it\n\t\taround here?  Around Baltimore?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(lost in thought)\n\t\tWhat?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI have the...strangest feeling I've met\n\t\tyou before...a long time ago, perhaps.\n\t\tWere you ever...?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWait!  This is only 1989!  I'm supposed\n\t\tto be leaving messages in 1995.  It's\n\t\tnot the right number yet.  That's the\n\t\tproblem.  Damn!  How can I contact them?\n\n\tRAILLY recovers her distance, her poise, as she takes a bottle,\n\tpours out some tablets, and holds them out to COLE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, take these.\n\t\t\t(watching him step back)\n\t\tPlease -- I helped you like I said I\n\t\twould.  Now I want you to trust me.\n\n<b>\tINT.  AIRPORT CONCOURSE - DAY (THE DREAM)\n</b>\n\tMR. PONYTAIL races past the startled YOUNG COLE.\n\n<b>\t\t\t\tMR. PONYTAIL\n</b><b>\t\tWATCH IT!\n</b>\n\tWas it JEFFREY wearing gaudy pants and a ponytail?  It was\n\tdefinitely JEFFREY'S VOICE.\n\n\tTRAVELERS dive for cover as a WOMAN'S VOICE cries out...\n\n<b>\t\t\t\tWOMAN'S VOICE\n</b><b>\t\tNOOOOOOOOOO!\n</b>\n\tThe TERRIFIED TRAVELER looks up at YOUNG COLE, makes eye contact, but\n\tdoesn't speak.  The TERRIFIED TRAVELER looks a lot like DR. FLETCHER!\n\n\tJust then, YOUNG COLE is distracted by a running figure.  It's\n\tthe BLONDE MAN in the Hawaiian shirt, but he's not injured.  He's\n\tsprinting toward the gates, glancing back over his shoulder, his\n\tmoustache slightly askew!\n\n\tA sharp CRACK of a GUNSHOT rings out!  Then, DAZZLING LIGHT.\n\tEverything goes white!\n\n<b>\tINT.  DORMITORY (PSYCH WARD)/COUNTY HOSPITAL - NIGHT\n</b>\n\tCOLE'S eyes blink awake, blinded by a flashlight.\n\n\tHe's lying in one of thirty beds in a darkened ward.  Disoriented.\n\tWhich world is this?  The room is full of BREATHING, SNORING,\n\toccasional MOANS.  He can barely discern the shadowy figures of\n\tan ORDERLY and a NURSE, making their rounds, checking each bed.\n\n\tHis eyes adjusting to the darkness, COLE watches them exit.\n\n\tHe turns and sees a patch of moonlight coming in a barred window.\n\n\tWith a quick glance at the sleeping PATIENTS, he slips out of\n\tbed, makes his way stealthily to the window, peers out.\n\n\tCOLE'S POV:  the moon, glowing in the sky, illuminating a single\n\ttree.  Under the tree, in silhouette, a COUPLE embraces, kisses.\n\n\tANGLE ON COLE, looking out the window, absorbed.\n\n\t\t\t\tVOICE (o.s.)\n\t\tIt won't work. You can't open it.\n\n\tAlarmed, COLE turns, sees JEFFREY in the next bed.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou think you can remove the grill but\n\t\tyou can't.  It's welded.\n\n\tCOLE checks the grill anyway.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tSee?  I toldja.  And all the doors are\n\t\tlocked, too.  They're protecting the\n\t\tpeople on the outside from us.  But the\n\t\tpeople outside are as crazy as us.\n\n\tCOLE has become preoccupied with a small SPIDER creeping along\n\tthe window sill.  He's staring at it when he's distracted by a\n\tsudden SOUND.  Grabbing the SPIDER, COLE scrambles back into bed\n\tjust as the door opens and an ORDERLY probes the dark room with\n\tthe blade of his flashlight.\n\n\tANGLE ON COLE, in bed, feigning sleep.\n\n\tThe flashlight clicks off and COLE hears the door close.\n\n\tFor a long moment the ward is silent except for BREATHING,\n\tSNORES, occasional MOANS.  Then, COLE hears JEFFREY'S hoarse\n\twhisper, picking up right where he left off.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou know what \"crazy\" is?  \"crazy\" is\n\t\t\"majority rules\".  Take germs for example.\n\n\tAlthough COLE is preoccupied with the SPIDER struggling to get\n\tout of his fist, he can't help reacting to the word, \"germs\"!\n\n<b>\t\t\t\tCOLE\n</b>\t\tGerms?!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tIn the 18th century there was no such\n\t\tthing!  Nobody'd ever imagined such a\n\t\tthing -- no sane person anyway.  Along\n\t\tcomes this doctor...Semmelweiss, I\n\t\tthink.  He tries to convince people...\n\t\tother doctors mostly...that there are\n\t\tthese teeny tiny invisible \"bad things\"\n\t\tcalled germs that get into your body and\n\t\tmake you...sick!  He's trying to get\n\t\tdoctors to wash their hands.  What is\n\t\tthis guy...crazy?  Teeny tiny invisible\n\t\twhaddayou call 'em?...\"germs\"!\n\n\tAs JEFFREY warms to his subject, getting excited, COLE tries to\n\tfigure out where to put the SPIDER.\n\n\t\t\t\tJEFFREY (cont.)\n\t\tSo cut to the 20th century!  Last week\n\t\tin fact, right before I got dragged\n\t\tinto this hellhole.  I order a burger\n\t\tin this fast food joint.  The waiter\n\t\tdrops it on the floor.  He picks it up,\n\t\twipes it off, hands it to me...like it\n\t\twas all okay.\n\n\tNo alternative.  COLE pops the SPIDER in his mouth and swallows\n\tit as JEFFREY prattles on...\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\"What about the germs?\"  I say.  He\n\t\tgoes, \"I don't believe in germs.  Germs\n\t\tare just a plot they made up so they\n\t\tcan sell you disinfectants and soap!\"\n\t\tNow, he's crazy, right?  Hey, you\n\t\tbelieve in germs, don't you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI'm not crazy.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tOf course not, I never thought you were.\n\t\tYou want to escape, right?  That's very\n\t\tsane.  I can help you.  You want me to,\n\t\tdon't you?  Get you out?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIf you know how to escape, why don't you...?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhy don't I escape, that's what you\n\t\twere going to ask me, right?  'Cause\n\t\tI'd be crazy to escape!  I'm all taken\n\t\tcare of, see?  I've sent out word.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat's that mean?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tI've managed to contact certain underlings,\n\t\tevil spirits, secretaries of secretaries, and\n\t\tassorted minions, who will contact my father.\n\t\tWhen he learns I'm in this kind of place,\n\t\the'll have them transfer me to one of those\n\t\tclassy joints where they treat you...properly.\n<b>\t\tLIKE A GUEST!  LIKE A PERSON!  SHEETS!\n</b><b>\t\tTOWELS!  LIKE A BIG HOTEL WITH GREAT DRUGS\n</b><b>\t\tFOR THE NUT CASE LUNATIC MANIAC DEVILS...\n</b>\n\tPATIENTS are waking up as the NURSE and two ORDERLIES burst into the\n\tdorm and head straight for JEFFREY who's struggling to calm himself.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tSorry.  Really sorry.  Got a little\n\t\tagitated.  The thought of escaping\n\t\tcrossed my mind and suddenly...suddenly\n\t\tI felt LIKE BENDING THE FUCKING BARS\n<b>\t\tBACK, RIPPING OFF THE GODDAMN WINDOW\n</b><b>\t\tFRAMES AND...EATING THEM, YES, EATING\n</b><b>\t\tTHEM, AND LEAPING, LEAPING...\n</b>\n\tCOLE watches the ORDERLIES grab JEFFREY and haul him away.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou dumb assholes!  I'm a mental patient!\n\t\tI'm supposed to act out.  Wait til you\n\t\tmorons find out who I am.  My father's\n\t\tgonna be really upset.  AND WHEN MY\n<b>\t\tFATHER GETS UPSET, THE GROUND SHAKES!\n</b><b>\t\tMY FATHER IS GOD!  I WORSHIP MY FATHER.\n</b>\n<b>\tINT.  WARD DAYROOM - MORNING\n</b>\n\tANGLE ON TV SCREEN/A VIDEO IMAGE OF A LAB MONKEY, convulsing\n\tpathetically, a victim of shocks from the numerous wires attached\n\tto his tiny, restrained body.\n\n\tANGLE ON COLE, sitting, writing intensely in a magazine with\n\tcrayon, surrounded by dull-eyed PATIENTS in pajamas and ratty\n\trobes, staring at the shuddering LAB MONKEY on the TV screen.\n\n\t\t\t\tJEFFREY'S VOICE (o.s.)\n\t\tTorture!  Experiments!  We're all\n\t\tmonkeys\n\n\tCOLE locks up, startled, as JEFFREY, one eye bruised black, takes\n\tthe seat next to him.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThey hurt you!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tNot as bad as what they're doing to\n\t\tkitty.\n\n\tANGLE ON TV, showing a laboratory CAT turning in mad circles,\n\teating its own tail, while a NEWS REPORTER narrates.\n\n\t\t\t\tTV NEWS REPORTER (v.o.)\n\t\tThese video tapes were obtained by\n\t\tanimal rights activists who worked\n\t\tunderground as laboratory assistants\n\t\tfor several months.  Authorities say\n\t\tthere is little they can do until...\n\n\tThe video footage now shows LAB WORKERS watching the results of\n\ttheir experiments passively.\n\n\tANGLE ON COLE, reacting angrily.\n\n<b>\t\t\t\tCOLE\n</b>\t\tLook at those assholes, they're asking\n\t\tfor it!  Maybe people deserved to be\n\t\twiped out!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(startled, turning)\n\t\tWiping cut the human race!  That's a\n\t\tgreat idea!  But it's more of a long\n\t\tterm thing -- right now we have to\n\t\tfocus on more immediate goals.\n\t\t\t(sudden whisper)\n\t\tI didn't say a word about \"you know\n\t\twhat\".\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat are you talking about???\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou know -- your plan.\n\n\tAs COLE stares, befuddled, JEFFREY sees COLE'S magazine.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhat're you writing?  You a reporter?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(shielding the magazine)\n\t\tIt's private.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tA lawsuit?  You going to sue them?\n\n\tJust then BILLINGS looms over COLE, extending a cup full of pills.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tYo, James -- time to take your meds.\n\n<b>\tINT.  DAY ROOM/HOSPITAL - THIRTY MINUTES LATER (MORNING)\n</b>\n\tANGLE ON THE TV, a commercial playing:  a beautiful couple romps\n\tin the surf in slow motion while an eager NARRATOR encourages...\n\n\t\t\t\tNARRATOR (v.o.)\n\t\tTake a chance.  Live the moment.  Sunshine.\n\t\tGorgeous beaches.  The Florida Keys!\n\n\tANGLE ON COLE, very drugged, seated in front of the TV along with\n\tother drugged PATIENTS, staring at the screen.\n\n\tANGLE ON THE TV, showing a picture of the Marx Brothers.\n\n\t\t\t\tTV AWNOUNCER (v.o.)\n\t\tWe'll return to the Marx Brothers in\n\t\t\"Monkey Business\" following these\n\t\tmessages.\n\n\t\t\t\tJEFFREY'S VOICE (o.s.)\n\t\tMonkey Business!  Monk Key Business.\n\n\tCOLE sees JEFFREY sliding into the next chair and smirking.\n<b>\t\n</b><b>\t\t\t\tJEFFREY\n</b>\t\tGet it?  Monk - Key.  Monk!\n\t\t\t(big grin)\n\t\tKey!\n\n\tJEFFREY flashes his palm open for one quick moment.  A KEY!\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(groggy)\n\t\tWhat....???\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWooooo, they really dosed you, bro.\n\t\tMajor load!  Listen up -- try and get\n\t\tit together.  Focus!  Focus!  The plan!\n\t\tRemember?  I did my part.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat...???\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tNot, \"what\", babe!  When!\n\n\t\t\"When???\"\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(pressing the key into Cole's hand)\n\t\tNow!\n\n\t\t\t\tVOICE/TV (o.s.)\n\t\tLet us guide you to the stocks and\n\t\tbonds that will enhance your portfolio.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(leaping to his feet)\n<b>\t\tYES -- NOW!  BUY NOW!  STOCKS AND BONDS!\n</b><b>\t\tNO MORE MONKEY BUSINESS -- BUY NOW.\n</b>\n\tANGLE ON TV, almost mimicking JEFFREY with an ad...a BULL and a\n\tBEAR and a computer screen showing stock prices fluctuating.\n\n\t\t\t\tVOICE/TV (v.o.)\n\t\tA portfolio tailored to your specific\n\t\tneeds and the needs of your loved ones...\n\n\tANGLE ON COLE, dumbfounded, watching JEFFREY dance crazily.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tYES, YES.  ENHANCE YOUR PORTFOLIO NOW!\n</b>\n\tANGLE ON BILLINGS, across the ward, reacting to JEFFREY, lets go\n\tof the OLD MAN he's helping as another orderly, TERRY, presses a\n\tbeeper, calling for help.\n\n\tANGLE ON COLE, flabbergasted, as JEFFREY cavorts around the room.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tBUY!  SELL!  SEIZE THE OPPORTUNITY!\n</b>\n\tANGLE ON A HAND, inserting the last piece into the PEACEABLE\n\tKINGDOM JIGSAW PUZZLE.  Just then, JEFFREY'S HAND sweeps the\n\tpuzzle off the table, scattering it into a thousand pieces.\n\n\tANGLE ON JEFFREY, dancing away while the PATIENT who just\n\tcompleted the puzzle stares, very upset.\n\n\tOther PATIENTS are getting agitated, too, as JEFFREY avoids a\n\tlunge by BILLINGS and dances off, using PATIENTS as a shield.\n\n<b>\t\t\t\tHEAVY WOMAN PATIENT\n</b><b>\t\tI'M GETTING DIZZY.  MAKE HIM STOP!\n</b>\n<b>\t\t\t\tSKINNY MAN PATIENT\n</b><b>\t\tHERE THEY COME!  THEY'RE COMING!\n</b>\n<b>\t\t\t\tOLD MAN PATIENT\n</b><b>\t\tFIVE HUNDRED DOLLARS!  I GOT FIVE\n</b><b>\t\tHUNDRED DOLLARS!  I'M INSURED!\n</b>\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tOPPORTUNITY!  DEFINITELY!  A WINDOW OF\n</b><b>\t\tOPPORTUNITY!  OPENING NOW!  NOW'S THE TIME\n</b><b>\t\tFOR ALL GOOD MEN TO SEIZE THE MOMENT!  YES!\n</b><b>\t\tYES!  MASTERCARD!  VISA!  THE KEY TO HAPPINESS!\n</b>\n\tANGLE ON COLE, realizing through the haze of drugs that JEFFREY\n\tis sending a message to him.  COLE looks at the ward door.\n\n\tCOLE'S POV:  the WARD DOOR opens and two husky ORDERLIES enter.\n\tOne locks the door with a key, one of many on a key ring attached\n\tto his belt, as the other ORDERLY rushes to join the pursuit.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tSEIZE THE MOMENT!  GET RICH!  NOW'S THE\n</b><b>\t\tTIME!  GO FOR IT!\n</b>\n<b>\t\t\t\tBILLINGS\n</b>\t\t\t(missing a tackle)\n\t\tGod damn you, Jeffrey, quit playing the fool.\n\n\tANGLE ON COLE, hesitating.  He locks at the door...blurring in\n\tand out of focus.  He looks down at the key in his hand.\n\n\tANGLE ON JEFFREY, being grabbed by the ORDERLIES.  JEFFREY\n\tresists wildly as they struggle to overpower him.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tLAST CHANCE!  LAST CHANCE!  HEY -- OW!\n</b>\n\tANGLE ON COLE, moving to the door.  He reaches it and tries to\n\tinsert the key in the lock.\n\n\tANGLE ON LOCK, as the key keeps missing the hole.\n\n\tANGLE ON COLE, glancing nervously over his shoulder.\n\n\tCOLE'S POV:  ORDERLIES swarm over JEFFREY, don't notice COLE.\n\n\tANGLE ON COLE, managing to insert the key.  It won't turn.\n\n\tA PATIENT, close at hand, startles COLE, speaking into his ear.\n\n<b>\t\t\t\tPATIENT\n</b>\t\tPlace to go would be...Florida.  The\n\t\tkeys are lovely this tine of year.\n\n\tCOLE, unnerved, desperate tries the key again.  It turns.\n\n<b>\t\t\t\tPATIENT\n</b>\t\tBe careful.  J. Edgar Hoover isn't really dead.\n\n\tCOLE pauses, stares, not understanding.  Then, he opens the door.\n\n<b>\tINT.  CORRIDOR/COUNTY HOSPITAL\n</b>\n\tStepping through the door, COLE finds himself in an ante-room\n\tfacing several elevators.\n\n\tA uniformed SECURITY MAN sitting at a near-by desk doesn't even\n\tlock up from the magazine he's reading.\n\n\tBarely daring to breathe, COLE steps toward the elevators so his\n\tback is to the SECURITY MAN.  But he doesn't know how to control\n\tthis elevator.  What should he do?\n\n\t\t\t\tSECURITY MAN'S VOICE (o.s.)\n\t\tTwo's not working today.  Use one.\n\n\tCOLE freezes, sneaks a glance over his shoulder.\n\n\tCOLE'S POV:  the SECURITY MAN continues his reading.  He's a big\n\tguy with reading glasses perched on his nose.  He looks exactly\n\tlike the MENACING GUARD IN THE FUTURE...SCARFACE!\n\n\tANGLE ON COLE, stunned!\n\n\tJust then, an elevator door slides open.  The elevator's empty.\n\n\tCOLE steps into it.\n\n<b>\tINT.  ELEVATOR/COUNTY HOSPITAL\n</b>\n\tThe door closes, isolating COLE in the elevator.\n\n\tCOLE finds the down button, is about to push it when the elevator\n\tsprings to life.  The numbers on the indicator over the door\n\tstart to rise.  7...8...9.\n\n\tThen, the elevator stops and the door opens.\n\n\tTwo DOCTORS and an AIDE stand in front of the door, waiting.\n\n\tCOLE hesitates.\n\n\tThey look at him.  They seem to expect him to exit.\n\n\tAvoiding eye contact, COLE exits the elevator.\n\n\tAs they enter the elevator, the DOCTORS look back at COLE and frown.\n\n<b>\tINT.  RAILLY'S OFFICE - MORNING\n</b>\n\tRAILLY has just arrived for work.  She's slipping on her white\n\tdoctor's coat when...\n\n\tDR. CASEY, one of the other residents, sticks his head in the\n\tdoor waving a crayoned message on a page torn from a magazine.\n\n<b>\t\t\t\tDR. CASEY\n</b>\t\tThis was in my box, but I have a slight\n\t\tsuspicion it wasn't meant for me.\n\n\tCASEY enters the room, reading the scrawled words dramatically.\n\n<b>\t\t\t\tDR. CASEY\n</b>\t\t\"You are the most beautiful woman I have\n\t\tever seen.  You live in a beautiful\n\t\tworld.  But you don't know it.  You have\n\t\tfreedom, sunshine, air you can breathe.\"\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(smiling)\n\t\tCole.  James Cole -- right?\n\n\tShe reaches for the note but CASEY moves it out of her grasp.\n\n<b>\t\t\t\tDR. CASEY\n</b>\t\t\"I would do anything to stay here, but\n\t\tI must leave.  Please, help me.\"\n\n<b>\t\t\t\tRAILLY\n</b>\t\tPoor man...\n\n\tCASEY is handing her the note when another resident, DR. GOODINS,\n\tsticks his head in the door.  He's upset.\n\n<b>\t\t\t\tDR. GOODINS\n</b>\t\tHey, Kathryn, James Cole is one of\n\t\tyours, right?\n\n\tRAILLY and CASEY stare at him.\n\n<b>\t\t\t\tDR. GOODINS\n</b>\t\tHe got out.  Took off.  Last seen, he\n\t\twas up on nine.\n\n<b>    INT.  X-RAY DEPARTMENT/BASEMENT - DAY\n</b>\n    A PATIENT is being swallowed by a large tube, a CAT SCANNER,\n    while a DOCTOR in a white coat speaks reassuringly.\n\n<b>\t\t\t\tDOCTOR\n</b>\t\tJust relax -- don't fight it.  We have\n\t\tto know exactly what's there so we can...\n\n\tThe DOCTOR stops, astonished, as the door bursts open.\n\n\tIt's COLE!  He stares at the PATIENT and the Cat Scanner.\n\n\tThe PATIENT lifts his head up and stares at COLE.\n\n<b>\t\t\t\tDOCTOR\n</b>\t\tEh, excuse me.  Can I help you?\n\n\tCOLE turns and rushes back out the door.\n\n<b>\tINT.  CORRIDOR/COUNTY HOSPITAL\n</b>\n\tCOLE steps into the corridor, turns to his right, freezes.\n\n\tA POSSE of SECURITY GUARDS is headed in his direction.\n\n\tCOLE turns to his left.\n\n\tFour ORDERLIES are coming that way.\n\n\tCOLE'S trapped.  A beat.  He attacks the nearest man.  BILLINGS.\n\n<b>\tINT.  TECH ROOM/PSYCH WARD - SHORTLY (DAY)\n</b>\n\tRAILLY prepares a hypo, turns to COLE who is strapped tightly on\n\ta gurney with BILLINGS and an RN standing on either side, tense\n\tfor more trouble.  One of BILLINGS' eyes is starting to swell shut.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt's just a shot to calm you.\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo more drugs.  Please...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI have to do this, James.  You're very\n\t\tconfused.\n\n\tRAILLY pushes the needle into COLE'S skin.\n\n<b>\tINT.  CONFERENCE ROOM/PSYCH WARD - LATER (DAY)\n</b>\n\tDR. FLETCHER faces RAILLY across the conference table.  DR.\n\tCASEY, DR. GOODINS, DR. MARILOU MARTIN are also there.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tDon't be defensive, Kathryn, this isn't\n\t\tan inquisition.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI didn't think I was being defensive.\n\t\tI was just...\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tHe should have been in restraints.  It\n\t\twas bad judgment on your part, plain\n\t\tand simple.  why not just cop to it?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOkay, it was bad judgment.  But I have\n\t\tthe strangest feeling about him -- I've\n\t\tseen him somewhere and...\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\t\t(impatient, not interested)\n\t\tTwo policemen were already in the\n\t\thospital and now we have an orderly\n\t\twith a broken arm and a Security\n\t\tOfficer with a fractured skull.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI said it was bad judgment!  What else\n\t\tdo you want me to say?\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tYou see what I mean?  You're being defensive.\n\t\t\t(to Dr. Casey)\n\t\tIsn't she being defensive, Bob?\n\n\tBut just then, BILLINGS sticks his head in the door.\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tUh, Dr. Fletcher -- we got another...\n\t\tsituation.\n\n<b>\tINT.  CORRIDOR/PSYCH WARD - MOMENTS LATER (DAY)\n</b>\n\tDR. FLETCHER looks into an empty padded cell as RAILLY, MARTIN,\n\tGOODIN, BILLINGS, PALMER and the NURSE crowd behind him.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tHe was in full restraints?  And the\n\t\tdoor was locked?\n\n<b>\t\t\t\tBILLINGS\n</b>\t\tYes, sir.  Did it myself.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tAnd he was fully sedated?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHe was fully sedated!\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tThen are you trying to tell me that a\n\t\tfully sedated, fully restrained patient\n\t\tsomehow slipped out that vent, replaced\n\t\tthe grill behind him and that he's wriggling\n\t\tthrough the ventilation system right now?\n\n\tDR. FLETCHER indicates an impossibly tiny vent high in the wall.\n\n<b>\tINT.  CONCOURSE/AIRPORT - DAY (THE DREAM)\n</b>\n\tSeen through the glass windows, a 747 takes off, climbing into\n\tthe sky as the airport P.A. System drones...\n\n<b>\t\t\t\tP.A. SYSTEM\n</b>\t\tFlight 784 to San Francisco now\n\t\tboarding at Gate 38...\n\n\tYOUNG COLE, watching the 747, whirls at the SOUND of a COMMOTION.\n\n\tMR. PONYTAIL bumps him.\n\n\tThe BLONDE MAN sprints past.  The WOMAN'S VOICE calls out!\n\n<b>\t\t\t\tWOMAN'S VOICE\n</b><b>\t\tNOOOOOOOOOO!\n</b>\n\tTRAVELERS dive for cover briefly revealing the mysterious BRUNETTE\n\trunning after the BLONDE MAN!  But this time, YOUNG COLE catches\n\tjust a glimpse of her face.  She looks a little like RAILLY except\n\tfor the dark hair, the make-up. and the flashy earrings.  She\n\tcalls out, her VOICE blending weirdly with the P.A. SYSTEM...\n\n<b>\t\t\t\tBRUNETTE/P. A. SYSTEM\n</b>\t\tThe Freedom For Animals Headquarters\n\t\tnow boarding on Second Avenue.  The\n\t\tArmy of the Twelve Monkeys...\n\n\t\t\t\tENGINEER'S VOICE (o.s.)\n\t\tCole, you moron -- wake up!\n\n<b>\tINT.  ENGINEERING OFFICE - ETERNAL NIGHT OF THE FUTURE\n</b>\n\tAs COLE blinks awake, the digitized monotone of the P.A. SYSTEM\n\tcontinues to drone in an unearthly VOICE...\n\n<b>\t\t\t\tUNEARTHLY VOICE/P.A. SYSTEM\n</b>\t\t-- they're the ones who are going to do it...\n\n\tCOLE'S eyes seek the source of the sound and find it on the table\n\tin front of the panel of disapproving SCIENTISTS facing him.  It's\n\ta beat-up old tape recorder.\n\n<b>\t\t\t\tUNEARTHLY VOICE/TAPE RECORDER\n</b>\t\tI can't do anything more.  The Police\n\t\tare after me.\n\n\tThe tape ends, runs off the reel, flap...flap...flap...\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWell?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, what?\n\n<b>\t\t\t\tENGINEER\n</b>\t\tHe's drugged out of his mind!  He's\n\t\tcompletely zoned out.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tCole, did you or did you not record\n\t\tthat message?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, that message...me?\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tIt's a digital reconstruction of a\n\t\tmessage, Cole, from a weak signal on our\n\t\tcontact number.  Did you make that call?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(angrily)\n\t\tI couldn't call!  You sent me to the\n\t\twrong year!  It was 1989.\n\n<b>\t\t\t\tSCIENTISTS\n</b><b>\t\t1989!\n</b>\n\tThe SCIENTISTS react, exchanging looks, whispers.  Then,\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tYou're certain of that?\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\t\t(before Cole can answer)\n\t\tWhat did you do with your time, Cole?\n\t\tDid you waste it on drugs?  Women?\n\n<b>\t\t\t\tCOLE\n</b>\t\tThey forced me to take drugs.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tForced you!  Why would someone force\n\t\tyou to take drugs?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI got into trouble.  I got arrested.\n\t\tBut I still got you a specimen -- a\n\t\tspider -- but I didn't have anyplace to\n\t\tput it, so I ate it.  It was the wrong\n\t\tyear anyway, so I guess it doesn't matter.\n\n\tThe SCIENTISTS stare incredulously, then turn, exchange knowing\n\tlooks, huddle, start whispering to one another.\n\n\tStruggling to stay awake COLE sees, blurrily, the MICROBIOLOGIST\n\tstaring at COLE intently.  For one moment, the face belongs to\n<b>\tDR. FLETCHER!\n</b>\n\tCOLE blinks hard...and the MICROBIOLOGIST has his own face, again.\n\n\tCOLE'S head slumps forward now...and everything goes dark.\n\n\t\t\t\tGEOLOGIST'S VOICE (o.s.)\n\t\tCole!\n\n<b>\tINT.  ENGINEERING OFFICE - ETERNAL NIGHT OF THE FUTURE\n</b>\n\tCOLE comes awake with a start.  The room is dark now, except...\n\n\ta slide is being projected on a torn screen.  It's a picture of a\n\tstenciled graffiti...the logo of The Army of the 12 Monkeys.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tWhat about it, Cole?\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tDid you see it?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, no, sir.  I...\n\n\tAnother slide CLICKS into place.  Youthful PROTESTERS, their\n\tplacards featuring slogans and images of Animal Atrocities,\n\tconfront POLICE in riot gear.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWhat about these people?  Did you see\n\t\tany of these people?\n\n\tZooming in, panning, the SCIENTISTS emphasize the FACES of the\n\tPROTESTERS.  The FACES are unfamiliar to COLE (though WE will\n\trecognize some of them later on).\n\n\t\t\t\tCOLE (o.s.)\n\t\tUh, no, sir, I...wait!\n\n\tThe image pans back to a much enlarged blurry FACE among the\n\tPROTESTERS.  In spite of the poor image, the expression of rage\n\tis clear, and it seems to resemble a somewhat older JEFFREY MASON.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tHim?  You saw that man?\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, I think so.  In the mental hospital.\n\n<b>\t\t\t\tMICRO3IOLOGIST\n</b>\t\t\t(switching on the light)\n\t\tYou were in a mental institution?!\n\n\tThe SCIENTISTS MUTTER disapprovingly among themselves.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tYou were sent to make very important\n\t\tobservations!\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tYou could have made a real contribution.\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tHelped to reclaim the planet...\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tAs well as reducing your sentence.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tThe question is, Cole -- \"Do you want\n\t\tanother chance?\"\n\n\tCOLE stares at them, trying to figure out what they mean.\n\n<b>\tINT.  CONCOURSE/AIRPORT - DAY (THE DREAM)\n</b>\n\tThe BRUNETTE runs up the concourse, her back to YOUNG COLE, as\n\tfrightened PASSENGERS duck for cover, SHOUTING!\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tHey!  Who's that?\n\n<b>\tINT.  CELL - ETERNAL NIGHT\n</b>\n\tCOLE opens his eyes.  Where is he?  Silence as he examines the\n\ttiny cell.  Bare cement walls.  High ceiling.  Same color and\n\tsize as the isolation room at the county hospital.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tHey, Bob...what's your name?\n\n\tCOLE looks around frantically.  Up, down.  Where is the VOICE\n\tcoming from?  Maybe from that tiny vent high in the wall...\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhere are you?\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tYou can talk!  Wah'dja do, Bobby boy?\n\t\tVolunteer?\n\n<b>\t\t\t\tCOLE\n</b>\t\tMy name's not \"Bob\".\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tNot a prob, Bob.  Where'd they send you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhere are you?\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tAnother cell. ...  Maybe.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat do you mean, \"maybe\"?  What's that\n\t\tsupposed to mean?\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tMaybe.  Means \"maybe\" I'm in the next cell,\n\t\tanother \"volunteer\" like you -- or \"maybe\"\n\t\tI'm in the Central Office spying on you\n\t\tfor all those science bozos.  Or, hey, \"maybe\"\n\t\tI'm not even here.  \"Maybe\" I'm just in\n\t\tyour head.  No way to confirm anything.\n\t\tHa Ha.  Where'd they send you?\n\n\tCOLE doesn't answer.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tNot talking, huh, Bob?  That's okay\n\t\tI can handle that.\n\n<b>\t\t\t\tCOLE\n</b><b>\t\t1989.\n</b>\n\t\t\t\tRASPY VOICE (o.s.)\n\t\t89!  How was it?  Good drugs?  Lotsa\n\t\tpussy?  Hey, Bob, you do the job?  D'ju\n\t\tfind out the \"big info\"?...Army of the\n\t\tTwelve Monkeys...where the virus was\n\t\tprior to mutation?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt was supposed to be 1995.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tScience isn't an exact science with\n\t\tthese clowns.  You're lucky you didn't\n\t\tend up in ancient Egypt!\n\n<b>\tINT.  LAB - ETERNAL NIGHT OF THE FUTURE\n</b>\n\tCOLE is strapped on a gurney.  SCIENTISTS hover near-by,\n\twhispering.  The walls of the gloomy chamber are damp, sweating.\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tNo mistakes this time, Cole.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tStay alert.  Keep your eyes open.\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tGood thinking about that spider, Cole.\n\t\tTry and do something like that again.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tJust relax now -- don't fight it.  We\n\t\thave to know exactly what's there so we\n\t\tcan fix it.\n\n\tThe gurney is being wheeled into a crudely welded steel tube...\n\treminiscent of the cat scanner in County Hospital.\n\n\tCOLE'S POV:  a last glimpse of anxious FACES, then the chamber\n\tdoor is CLANGED shut.\n\n<b>\tEVERYTHING IS BLACK.  A HUM BUILDS.  THE BLACKNESS VIBRATES, THE\n</b><b>\tHUM REACHES A DEAFENING LEVEL, THEN DIMUENDOS.  WE BEGIN TO HEAR\n</b><b>\tBURSTS OF MACHINE GUN FIRE, VOICES SHOUTING IN FRENCH, A SUDDEN\n</b><b>\tHUGE EXPLOSION!  THEN...\n</b>\n<b>\tEXT.  TRENCH/FRANCE - DAY\n</b>\n\tDRIZZLING RAIN.  And SCREAMS.  COLE'S in a deep trench, naked,\n\teyes wide with terror. What's going on? Where is he?  SOLDIERS\n\tin gas masks push urgently past him rushing toward their injured\n\tCOMRADES who've been ripped apart by the shell that just hit\n\tfifteen yards away.  Muffled VOICES shout through gas masks...\n\tin FRENCH.  COLE doesn't know it, but this is World War I!\n\tSuddenly, a SERGEANT confronts him, shouting in French.\n\n<b>\t\t\t\tSERGEANT\n</b>\t\t\t(FRENCH, subtitled)\n\t\tWhere's your mask?!  And your clothes...\n\t\tand your weapon, you idiot?!\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat?  What??\n\n\tCOLE looks around desperately.  A horribly WOUNDED MAN is being\n\tstretchered past them in the narrow trench.  Machine guns chatter\n\tclose at hand.  AAK AAK AAK.  A grenade EXPLODES.  Reacting to the\n\tforeign word, the SERGEANT jams his bayonet into COLE'S ribs...\n\n<b>\t\t\t\tSERGEANT\n</b>\t\t\t(FRENCH, subtitled)\n\t\tCaptain!  A Kraut!  We got a Kraut!\n\n<b>\t\t\t\tCOLE\n</b>\t\tI don't understand.  Where am I?\n\n\tThe CAPTAIN hurries over, snapping at COLE in German.\n\n<b>\t\t\t\tCAPTAIN\n</b>\t\t\t(GERMAN, subtitled)\n\t\tHow'd you get here, soldier?  What's\n\t\tyour rank?  Where are your clothes?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI...don't understand.\n\n<b>\t\t\t\tCAPTAIN\n</b>\t\t\t(frowning, GERMAN, subtitled)\n\t\tGerman!  Speak German!  What are you\n\t\tdoing here?\n\n\t\t\t\tVOICE (o.s.)\n\t\t\t(pleading in English)\n\t\tI gotta find 'em.  I gotta find 'em.\n\t\tPlease, you gotta help me!\n\n\tCOLE turns, sees...\n\n\tIt's his friend, JOSE, the Puerto Rican kid from the next cell in\n\tthe \"underground\" time.  He's being carried past COLE now on a\n\tstretcher, blood all over his torso, horribly wounded.\n\n<b>\t\t\t\tCOLE\n</b><b>\t\tJOSE!\n</b>\n<b>\t\t\t\tJOSE\n</b>\t\tCole!  Oh, God, Cole, where are we?\n\n\tJOSE reaches out to COLE just as a PHOTOGRAPHER takes a FLASH\n\tPICTURE of the kid being carried off on the stretcher.  SUDDENLY,\n\tSHOTS RING OUT.  COLE goes down.  Hit in the leg!\n\n\tSOLDIERS in gas masks rush past him like giant insects.\n\n\tLooking to his left, COLE sees the CAPTAIN lying beside him, dead\n\tfrom a chest wound, his gas mask half off.\n\n\tCOLE is reaching for the mask when...\n\n<b>\tA SHELL HITS CLOSE BY WITH AN ENORMOUS EXPLOSION.\n</b>\n<b>\tEXT.  COLLEGE CAMPUS - NIGHT\n</b>\n\tStunningly quiet.  We are on a placid campus looking at the\n\tdignified architecture of Breitrose Hall.  MOVING IN we FOCUS ON\n\ta large poster advertising \"The Alexander Lectures, Spring 1995\".\n\tWE SKIM the listings (Jon Else on The Nuclear Agony, Dr. Andrew\n\tMiksztal on Biological Ethics, etc.) until we SETTLE ON...\n\n<b>\t\t\t\tDR. KATHRYN RAILLY\n</b><b>\t\t\tMADNESS AND APOCALYPTIC VISIONS\n</b><b>\t\t\t\t\tMAY 17\n</b>\n<b>\tINT.  AUDITORIUM/BREITROSE HALL - NIGHT\n</b>\n\tA large screen dominates the auditorium stage.  On the screen is\n\ta slide of an engraving from the Middle Ages showing a MADMAN in\n\tapparent agony, his mouth shaped to a scream, as he is restrained\n\tby PEASANTS.  The projector ZOOMS slowly in on the agonized FACE\n\tof this MADMAN as we HEAR RAILLY'S VOICE lecturing.\n\n\t\t\t\tRAILLY'S VOICE (o.s.)\n\t\tAccording to the accounts of local\n\t\tofficials at that time, this gentleman,\n\t\tjudged to be about forty years of age,\n\t\tappeared suddenly in the village of Wyle\n\t\tnear Stonehenge in the West of England in\n\t\tApril of 1162.  Using unfamiliar words and\n\t\tspeaking in a strange accent, the man made\n\t\tdire prognostications about a pestilence\n\t\twhich he predicted would wipe out humanity\n\t\tin approximately 8OO years.  Deranged and\n\t\thysterical, the man raped a young woman of the\n\t\tvillage, was taken into custody, but then\n\t\tmysteriously escaped and was not heard of again.\n\n\tWE DISCOVER RAILLY, six years older now, standing at a lectern\n\tin a pool of light.  She's dwarfed by the giant screen where the\n\tengraving is replaced by a series of slides of woodcuts showing\n\tscenes of pestilence in the Middle Ages as she lectures to an\n\taudience of mostly SCHOLARLY TYPES.\n\n\t\t\t\t\tRAILLY (cont.)\n\t\tIn 1841, Mackay wrote, \"During seasons\n\t\tof great pestilence, men have often\n\t\tbelieved the prophecies of crazed\n\t\tfanatics, that the end of the world was\n\t\tcome.\"  Obviously, this plague/doomsday\n\t\tscenario is considerably more compelling\n\t\twhen reality supports it in some form,\n\t\twhether it's the Bubonic Plague, smallpox,\n\t\tor AIDS.  In addition to these \"natural\"\n\t\tcontagions, there are now technological\n\t\thorrors as well:  besides radiation,\n\t\tconsider our lurking fear of germ\n\t\twarfare and its close approximation,\n\t\tchemical warfare, which first reared\n\t\tits ugly head in the deadly mustard\n\t\tgas attacks during the First World War.\n\n\tON THE SCREEN, a SERIES of SLIDES show images of WORLD WAR I\n\tSOLDIERS in gas masks, in death throes, etc..\n\n\t\t\t\tRAILLY'S VOICE (cont. o.s.)\n\t\tDuring such an attack in the French\n\t\ttrenches in October, 1917, we have an\n\t\taccount of this soldier...\n\n\tON THE SCREEN, a slide of an old deteriorated photograph shows\n\tJOSE, the Puerto Rican kid, strapped to a stretcher, being carried\n\tby SOLDIERS through the trenches during an attack.  JOSE appears\n\tto be ranting madly as the projector ZOOMS CLOSER on his face until\n\tthe image approximates Munch's famous painting.\n\n\t\t\t\tRAILLY'S VOICE (cant. o.s.)\n\t\t-- who, during an assault, was wounded\n\t\tby shrapnel and hospitalized behind the\n\t\tlines where Doctors discovered he had\n\t\tlost all comprehension of French but\n\t\tspoke English fluently, albeit in a\n\t\tregional dialect they didn't recognize.\n\t\tThe man, although physically unaffected\n\t\tby the gas, was hysterical.  He claimed\n\t\the had come from the future, that he was\n\t\tlooking for a pure germ that would\n\t\tultimately wipe mankind off the face of\n\t\tthe earth in the year... 1995!\n\n\tThe AUDIENCE gives a nervous CHUCKLE.\n\n\tON THE SCREEN, a different old photograph of JOSE.  This time\n\the's in a military hospital, gaunt, haunted, very ill.\n\n\t\t\t\tRAILLY'S VOICE (cont. o.s.)\n\t\tAlthough seriously injured, the young\n\t\tsoldier disappeared from the hospital\n\t\tbefore more data could be gathered.  No\n\t\tdoubt, he was trying to carry on his\n\t\tmission to warn others, substituting\n\t\tfor the agony of war...a self-inflicted\n\t\tagony we call the \"Cassandra Complex\".\n\n\tAs RAILLY continues, we SCAN the AUDIENCE and DISCOVER MARILOU MARTIN,\n\tRAILLY'S friend, and MARILOU'S HUSBAND, WAYNE CHANG, both listening\n\tattentively.  Further away, another MAN listens intently.  A MAN with\n\tshoulder-length carrot-colored hair.  His name is DR. PETERS.\n\n\t\t\t\tRAILLY (cont.)\n\t\tCassandra, in Greek legend you will recall,\n\t\twas condemned to know the future but to be\n\t\tdisbelieved when she foretold it.  Hence,\n\t\tthe agony of foreknowledge combined with\n\t\timpotence to do anything about it.\n\n<b>\tINT.  RECEPTION ROOM - AN HOUR LATER (NIGHT)\n</b>\n\tA stack of new books.  THE DOOMSDAY SYNDROME, Apocalyptic\n\tVisions of the Mentally Ill by Dr. Kathryn Railly\n\n\tSurrounded by enthusiastic members of the audience, RAILLY is\n\tseated at the table signing books but DR. PETERS has her ear.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tI think, Dr. Railly, you have given\n\t\tyour alarmists a bad name.  Surely\n\t\tthere is very real and very convincing\n\t\tdata that the planet cannot survive the\n\t\texcesses of the human race:  proliferation\n\t\tof atomic devices, uncontrolled breeding\n\t\thabits, the rape of the environment, the\n\t\tpollution of land, sea, and air.  In this\n\t\tcontext, isn't it obvious that \"Chicken\n\t\tLittle\" represents the sane vision and\n\t\tthat Homo Sapiens' motto, \"Let's go\n\t\tshopping!\" is the cry of the true lunatic?\n\n\tDR. PETERS smiles self-importantly at RAILLY as an elderly\n\tdisheveled PROFESSOR elbows in front of him.\n<b> \n</b><b>\t\t\t\tDISHEVELED PROFESSOR\n</b>\t\tDoctor Railly -- please!  I wonder if\n\t\tyou're aware of my own studies which\n\t\tindicate that certain cycles of the\n\t\tmoon actually impact on the incidence\n\t\tof apocalyptic predictions as observed\n\t\tin urban emergency rooms and...\n\n\tAs the PROFESSOR babbles, MARILOU MARTIN and her husband, WAYNE\n\tCHANG, appear and whisper...\n\n<b>\t\t\t\tMARILOU\n</b>\t\tYou were great.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou're leaving?\n\n<b>\t\t\t\tMARILOU\n</b>\t\tThe reservation's at nine thirty --\n\t\tit's getting late.\n\n<b>\t\t\t\tDISHEVELED PROFESSOR\n</b>\t\tDoctor Railly -- please -- this is very\n\t\timportant!\n\n<b>\t\t\t\tWAYNE CHANG\n</b>\t\t\t(checking the professor)\n\t\tYou sure you're gonna be all right?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(smiles, checks her watch)\n\t\tI'll be there in twenty minutes.\n\n<b>\t\t\t\tDISHEVELED PROFESSOR\n</b>\t\tDr. Railly, I simply cannot understand\n\t\tyour exclusion of the moon in relation\n\t\tto apocalyptic dementia...\n\n<b>\tEXT.  PARKING LOT/BREITROSE HALL - NIGHT\n</b>\n\tA full moon.\n\n\tCOLLEAGUES in a VOLVO pull out of the parking lot, calling,\n\t\"Congratulations\" to RAILLY.\n\n\tShe waves back as she hurries to her black ACURA, one of the last\n\tcars left in the lot.\n\n\tThe outside lights of Breitrose Hall go off.\n\n\tRAILLY seems to be alone in the lot as she fishes keys from her\n\tpurse, unlocks her car door, starts to open it when...\n\n\tSuddenly, she's grabbed from behind in a choke-hold by a large\n\tshadowy MAN looming out of the darkness behind her.\n\n<b>\t\t\t\tMAN'S VOICE\n</b>\t\tGet in!\n\n\tUnable to scream, she writhes and kicks as he forces her into the\n\tfront seat.\n\n<b>\t\t\t\tMAN'S VOICE\n</b>\t\tI've got a gun.\n\n\tRAILLY freezes, terrified, as he opens the rear door and\n\tscrambles in behind her.\n\n<b>\tINT.  ACURA/PARKING LOT\n</b>\n\tFighting to suppress the quaver in her voice, RAILLY says...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou can have my purse.  I have a lot of\n\t\tcash and credit...\n\n\t\t\t\tMAN'S VOICE (o.s.)\n\t\tStart the car.\n\n\tGlancing in the rear view mirror, RAILLY sees penetrating eyes\n\tpeering out of the shadows, no other features.\n\n\tHalf-turning in the seat, she holds out the keys to him.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHere!  You can have the keys.  You can...\n\n\tHe grabs her hair and yanks her head back hard, speaking fiercely\n\tinto her ear, his face last in shadow.\n\n<b>\t\t\t\tMAN\n</b><b>\t\tSTART THE CAR!  NOW!\n</b>\n<b>\tEXT.  ACURA/PARKING LOT\n</b>\n\tThe engine STARTS, the Acura backs up, then heads for the exit.\n\n<b>\tINT.  ACURA\n</b>\n\tSteering fearfully, RAILLY hears him speak more calmly now.\n\n\t\t\t\tMAN'S VOICE (o.s.)\n\t\tI don't want to hurt you.  But I will.\n\t\tI've hurt people before when...when I\n\t\thad no choice.  Turn left.\n\n\tAs she makes the turn, RAILLY glances in the rear view mirror,\n\tsees him unfolding a tattered map.  His face is lost in darkness\n\tbut she glimpses ragged, torn clothing as he tries to read the\n\tmap by the intermittent glow of passing street lights.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhere... where are we going'\n\n<b>\t\t\t\tMAN\n</b>\t\tI need you to drive me to Philadelphia.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(startled, horrified)\n\t\tBut that's... that's more than 200 miles!\n\n<b>\t\t\t\tMAN\n</b>\t\tThat's why I can't walk there.  Turn\n\t\there... I think...\n\n\tRAILLY obeys.  She glances in the mirror again, hesitates, then\n\tboldly switches on the dome light, holding her breath fearfully\n\tfor his reaction.\n\n\tHe grunts appreciatively.  Relieved, she looks in the mirror\n\tagain, trying to get a better look at him, but now his features\n\tare concealed by the map.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIf you make me go with you, it's\n\t\tkidnapping.  That's a serious crime.\n\t\tIf you let me go, you could just take\n\t\tthe car and...\n\n<b>\t\t\t\tMAN\n</b>\t\tI don't know how to drive!  We went\n\t\tunderground when I was nine, I told you\n\t\tthat.  When you come to the corner,\n\t\tturn right.\n\n\tStartled, RAILLY whirls, looks right at him.\n\n\tHe's lowered the map.  It's COLE!  Haggard, unshaven, dirty.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tCole!  James Cole!  You escaped from a\n\t\tlocked room six years ago.\n\n<b>\t\t\t\tCOLE\n</b>\t\t1989.  Six years for you.  There's the\n\t\tsign!  Right here!\n\n\tCOLE is indicating a freeway entrance.\n\n\tRAILLY turns the wheel sharply.\n\n<b>\tEXT.  FREEWAY - NIGHT\n</b>\n\tThe Acura veers up the ramp and onto the freeway.\n\n<b>\tINT.  ACURA/FREEWAY - NIGHT\n</b>\n\tRAILLY glances in the mirror, sees COLE settling back wearily\n\tagainst the seat.  She says carefully...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI can't believe this is a coincidence,\n\t\tMr. Cole.  Have you been...following me?\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou told me you'd help me.  I know this\n\t\tisn't what you meant, but...I was desperate...\n\t\tno money...bum leg... sleeping on the streets.\n\t\tI probably smell bad.  Sorry about that.\n\t\tBut then I saw your book in a store window\n\t\twith a notice about your lecture.\n\t\t\t(sudden pride)\n\t\tI can read, remember?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYes, I remember.\n\t\t\t(a beat, then)\n\t\tWhy do you want to go to Philadelphia?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt's the next step.  I checked out the\n\t\tBaltimore information, it was nothing.\n\t\tIt's Philadelphia, that's where they\n\t\tare, the ones who killed everyone.\n\t\t\t(pointing suddenly, eagerly)\n\t\tZs that a radio?  Does it play music?\n\n\tRAILLY turns on the radio and immediately WE HEAR the SOUND of SURF\n\tand the CRIES of gulls, background to an oozing baritone COMMERCIAL.\n\n\t\t\t\tCOMMERCIAL/RADIO (o.s.)\n\t\tThis is a personal message to you.\n\n\tCOLE sits up, alert, listening intently.\n\n\t\t\t\tCOMMERCIAL/RADIO (cont. o.s.)\n\t\tAre you at the end of your rope?  Are\n\t\tyou dying to get away?\n\n\tCOLE'S eyes narrow, concentrating on this personal message.\n\n\t\t\t\tCOMMERCAIL/RADIO (cont. o.s.}\n\t\tThe Florida Keys are waiting for you.\n\n\tCOLE frowns as the SOUND of breaking SURF and crying GULLS fills\n\tthe car.  It's confusing!  He blurts out...\n\n<b>\t\t\t\tCOLE\n</b>\t\tI've never seen the ocean!\n\n\tObserving his confusion in the mirror, RAILLY assumes her\n\tprofessional tone.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt's an advertisement, Mr. Cole.  You\n\t\tdo understand that, don't you?  It's\n\t\tnot really a special message to you.\n\n\tCOLE frowns.  He did think it was for him, but she's probably right.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou used to call me \"James\".\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou'd prefer that? ... James...you\n\t\tdon't really have a gun, do you.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(cynical laugh)\n\t\tEverybody's got a gun.  In this city...\n\n\tHe breaks off reacting to the RADIO MUSIC!  FATS DOMINO singing\n\t\"BLUEBERRY HILL\"!  COLE grins, mouth agape, eyes wide like a kid's.\n\n<b>\t\t\t\tCOLE\n</b>\t\tCan you...can you make it louder?  I\n\t\tlove hearing twentieth century music!\n\t\tHearing music and breathing air!\n\n\tAs RAILLY cranks up the volume, she watches the mirror\n\tincredulously, sees him stick his head out the window into the\n\twind, mouth open, \"eating\" the air hungrily.\n\n<b>\tEXT.  FREEWAY/ACURA - NIGHT\n</b>\n\t\"BLUEBERRY HILL\" BLARES as the Acura, COLE'S head out the rear\n\twindow, zips past a sign at 65 mph.\n\n\tThe sign says, \"PHILADELPHIA 233 MILES.\"\n\n<b>\tINT.  ACURA/FREEWAY - NIGHT\n</b>\n\tRAILLY glances in the mirror at the nut in the rear seat with his\n\thead out the window.  what can she do?  Just then, while she's\n\ttrying to figure something out, an ANNOUNCER'S VOICE breaks in...\n\n\t\t\t\tANNOUNCER/RADIO (o.s.)\n\t\tThis just in from Fresno, California:\n\t\temergency crews are converging on a\n\t\tcornfield where playmates of nine year\n\t\told Ricky Neuman say they saw him\n\t\tdisappear right before their eyes.\n\n\tCOLE pulls his head back inside with a frown, troubled now.\n\n\t\t\t\tANNOUNCER/RADIO (cont. o.s.)\n\t\tYoung Neuman apparently stepped into an\n\t\tabandoned well shaft and is lodged somewhere\n\t\tin the narrow 150 foot pipe, possibly alive,\n\t\tpossibly seriously injured.  Playmates claim\n\t\tthey heard him cry out faintly but since then\n\t\tthere has been no contact with...\n\n<b>\t\t\t\tCOLE\n</b>\t\t\"Never cry wolf!\"\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat?\n\n<b>\t\t\t\tCOLE\n</b>\t\tMy father told me that.  \"Never cry\n\t\twolf.\"  Then people won't believe you\n\t\tif...something really happens.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\"If something really happens\"...like\n\t\twhat, James?\n\n<b>\t\t\t\tCOLE\n</b>\t\tSomething bad.  Is that all the music?\n\t\tI don't want to hear this stuff...\n\n\tRAILLY glances at him as she scans stations.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tDid something terrible happen to you when\n\t\tyou were a child?  Something so bad...?\n\n<b>\t\t\t\tCOLE\n</b>\t\tOhhhh, that one!  Can we hear that one?\n\n\tIt's IVORY JOE HUNTER singing, \"SINCE I MET YOU, BABY\".\n\n\t\t\t\tIVORY JOE/RADIO (o.s.)\n\t\t\"Since I met you, baby,\n\t\tMy whole life has changed...\n\n\tEcstatic, COLE sticks his head out the window again.\n\n<b>\tEXT.  ACURA/FREEWAY\n</b>\n\tCOLE'S POV:  the heavens, glittering with a million stars and a\n\tlover's moon as IVORY JOE croons the achingly romantic lyrics...\n\n\t\t\t\tIVORY JOE/RADIO (cont. o.s.)\n\t\t\"-- cause since I met you, baby.\n\t\tAll I need is you...\"\n\n\tANGLE ON COLE, wind in his hair, eyes shining, gulping air blissfully.\n\n<b>\tINT.  RAILLY'S APARTMENT - MORNING\n</b>\n\tTwo POLICE OFFICERS and an anxious MARILOU MARTIN listen to an\n\tanswering machine's message while a hungry CAT cries plaintively.\n\n<b>\t\t\t\tANSWERING MACHINE\n</b>\t\tDr. Railly -- this is Palmer from Psych\n\t\tAdmitting.  There was a guy here this\n\t\tafternoon looking for you.  He seemed\n\t\tvery agitated.  We tried to keep him, but\n\t\the refused 'n I kept thinking, I know\n\t\tthis guy.  Then, just a few minutes ago,\n\t\tit came to me.  It's Cole!  James Cole.\n\t\tRemember him?  The paranoid who pulled\n\t\tthe Houdini back in '89.  Well, he's\n\t\tback and he's...cuckoo...and he's looking\n\t\tfor you.  I thought you oughta know.\n\n\tThe machine switches off.  The POLICE OFFICERS exchange a look.\n\n<b>\t\t\t\tMARILOU MARTIN\n</b>\t\tIt's just as I told you -- my husband\n\t\tand I had gone ahead -- she never\n\t\tshowed.  That's totally unlike her!\n\n<b>\t\t\t\tOFFICER TWO\n</b>\t\t\t(pulls out his notebook)\n\t\tDo you happen to know the make of her car?\n\n<b>\t\t\t\tMARILOU MARTIN\n</b>\t\tUm...Acura...'92 Acura. ... Also, that\n\t\tcat's starving!  She would never neglect\n\t\ther cat!\n\n<b>\tEXT.  MOTEL - MORNING\n</b>\n\tThe ACURA is parked outside room 46 of the HIGHWAYS &amp; BYWAYS\n\tMOTEL, which has definitely seen better days.\n\n<b>\tINT.  MOTEL ROOM 46\n</b>\n\tThe TV is on.  A commercial is just starting.  A catfood jingle.\n\n\tThe sound of HEAVY BREATHING.\n\n\tANGLE ON COLE, sweating, BREATHING HEAVILY, sprawled on one side\n\tof the double bed, sound asleep.\n\n<b>\tINT.  CONCOURSE/AIRPORT - DAY (THE DREAM)\n</b>\n\tGUNSHOT!  YOUNG COLE glimpses the BLONDE MAN staggering, wounded.\n\n\tThe mysterious BRUNETTE races past him toward the BLONDE MAN, and\n\tYOUNG COLE again glimpses the resemblance to RAILLY, in spite of\n\tthe dark hair, the make-up, the flashy earrings.\n\n\tClose at hand, YOUNG COLE'S FATHER, his face still out of view, says,\n\n\t\t\t\tFATHER'S VOICE (o.s.)\n\t\tSon, it's important for your cat to\n\t\thave the nourishment necessary for\n\t\thealthy bones and a rich coat.\n\n<b>\tINT.  MOTEL ROOM 46\n</b>\n\tCOLE comes awake with a start.  He stares, disoriented, at the\n\tCATFOOD COMMERCIAL on the TV.\n\n\t\t\t\tRAILLY'S VOICE (o.s.)\n\t\tPlease untie me.  I'm very uncomfortable.\n\n\tCOLE turns to RAILLY, beside him on the bed, frightened and\n\thelpless, her jacket arranged to restrain her like a strait-jacket.\n\n\tCOLE'S instinct is to free her at once, but he controls his\n\timpulse.  He looks away, gets up, and, wincing, limps to the\n\tdresser, stepping around empty fast-food cartons.  He pulls a\n\trazor and shaving soap from a paper bag, then goes into the\n\tbathroom, leaving the door open, and starts to shave.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou were in my dream just now.  Your hair\n\t\twas different, but I'm sure it was you.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWe dream about what's important in our lives.\n\t\tAnd I seem to have become pretty important\n\t\tin yours.  What was the dream about?\n\n<b>\t\t\t\tCOLE\n</b>\t\tAbout an airport...before everything\n\t\thappened.  It's the same dream I always\n\t\thave -- the only one.  I'm a little kid\n\t\tin it.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAnd I was in it?  What did I do?\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou were very upset.  You're always\n\t\tvery upset in the dream, but I never\n\t\tknew it was you before.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt wasn't me before, James.  It's\n\t\tbecome me now because of...what's\n\t\thappening.  Please untie me.\n\n\tFinished shaving, COLE re-enters the bedroom, toweling his face.\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, I think it was always you.  It's\n\t\tvery strange.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou're flushed.  And you were moaning.\n\t\tI think you're running a fever.  What\n\t\tare you doing?\n\n\tCOLE is rummaging through RAILLY'S wallet, pulling out money.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI'll be back in a minute.\n\n\tHe heads for the door.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNo!  Don't leave me here like this!\n\n\tToo late!  He shuts the door behind him, leaving her alone.\n\n\tANGLE ON THE TV SCREEN, where an ANCHORMAN sits at a News Set.\n\n<b>\t\t\t\tTV ANCHORMAN\n</b>\t\tAnd in Fresno, California...crews\n\t\tcontinue to attempt to rescue nine year\n\t\told Ricky Neuman.\n\n\tANGLE ON RAILLY, twisting and struggling on the bed, trying to\n\tget loose, tears welling in her eyes.\n\n\t\t\t\tTV ANCHORMAN (cont. o.s.)\n\t\tThe boy was playing ball with four\n\t\tother children when he literally\n\t\tdisappeared off the face of the earth.\n\n<b>\tEXT.  MOTEL CORRIDOR - MORNING\n</b>\n\tCOLE puzzles over a junk food vending machine, inserts coins tentatively.\n\n<b>\tINT.  MOTEL ROOM\n</b>\n\tANGLE ON TV, the picture of RAILLY filling the screen.\n\n\n<b>\t----------------------- PAGE 52 MISSING -----------------------\n</b>\n\n<b>\t\t\t\tCOLE\n</b>\t\tMy notes.  Observations.  Clues.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tClues?  What kind of clues?\n\n<b>\t\t\t\tCOLE\n</b>\t\tA secret army.  The Army of The Twelve\n\t\tMonkeys.  I've told you about them.\n\t\tThey spread the virus.  That's why we\n\t\thave to get to Philadelphia.  I have to\n\t\tfind them -- it's my assignment.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat will you do...when you find\n\t\tthis...secret army?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI just have to locate the virus in its\n\t\toriginal form before it mutates.  So\n\t\tscientists can come back and study it\n\t\tand find a cure.  So that those of us\n\t\twho survived can go back to the surface\n\t\tof the earth.\n\n\tRAILLY maintains a professional deadpan, says nothing as they pass\n\ta pickup truck with a MOTHER, FATHER, and five KIDS in the back.\n\n\tCOLE stares at the KIDS, a sad look in his eyes.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou won't think I'm crazy next month.\n\t\tPeople are going to start dying.  At\n\t\tfirst the papers will say it's some\n\t\tweird fever, some virus.  Then they'll\n\t\tbegin to catch on.  They'll get it.\n\n\t\t\t\tRADIO NEWSCASTER (o.s.)\n\t\tWe interrupt this program with a\n\t\tspecial bulletin...\n\n\tRAILLY and COLE both react to the radio, suddenly alert.\n\n\t\t\t\tRADIO NEWSCASTER (o.s.)\n\t\tThis report just in from Fresno,\n\t\tCalifornia.  Naval sonar specialists\n\t\twho were flown to the site...\n\n<b>\t\t\t\tCOLE\n</b>\t\tI thought it was about us.  I thought\n\t\tmaybe they'd found us and arrested me\n\t\tor something.\n\n\tRAILLY stares at COLE.\n\n<b>\t\t\t\tCOLE\n</b>\t\tJust a joke.\n\n\t\t\t\tRADIO NEWSCASTER (o.s.)\n\t\t-- an hour ago have been unable to\n\t\tdetermine the location of the boy in the\n\t\t150 foot shaft...but a TV sound man who\n\t\tlowered an ultra-sensitive microphone into\n\t\tthe narrow tube claims he heard breathing\n\t\tsounds coming from approximately seventy\n\t\tfeet down...\n\n\tCOLE reaches over and changes stations.  MUSIC again.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tDoes that disturb you, James?  Thinking\n\t\tabout that little boy in the well?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhen I was a kid I identified with that\n\t\tkid, down there alone in that pipe...a\n\t\thundred feet down -- doesn't know if\n\t\tthey're going to save him.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat do you mean -- when you were a kid?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNevermind.  It's not real -- it's a\n\t\thoax.  A prank.  He's hiding in a barn.\n\t\tHey, turn left here.  Left!\n\n\tCOLE quickly checks the map as RAILLY stares, then turns left.\n\n<b>\tEXT.  SKID ROW STREET/PHILADELPHIA - DAY\n</b>\n\tAn elderly EVANGELIST with long stringy hair, wearing a tattered\n\tbathrobe, stands on a Skid Row corner WAVING a worn Bible as he\n\trants at disinterested DERELICTS, WINOS, and BAG LADIES.\n\n<b>\t\t\t\tEVANGELIST\n</b>\t\t\"And the wild beasts of the islands\n\t\tshall cry in their desolate houses and\n\t\tdragons in their pleasant palaces:  and\n\t\ther time is near to come, and her days\n\t\tshall not be prolonged.\"\n\n\tANGLE ON RAILLY'S ACURA, crawling down the street, RAILLY driving,\n\tCOLE, beside her, staring out the window.\n\n<b>\tINT.  ACURA/SKID ROW STREET\n</b>\n\tCOLE is scrutinizing the crumbling walls, boarded-up store\n\tfronts, tattered posters, decaying signs, miserable \"RESIDENTS\".\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhere I come from we think of this as Eden.\n\t\tIf we could just see the sun, eat sun-grown\n\t\tfood.  Eden!  Look at them!  They donut\n\t\tknow what they have.  They don't see the\n\t\tsky.  They don't feel the air!\n\n\tCOLE'S POV:  a BMW speeds toward them, passes, its radio BLARING!\n\n\t\t\t\tCOLE (o.s.)\n\t\tAnd the ones who aren't hungry are so smug\n\t\tthey haven't a clue.  WAIT!  STOP!\n\n<b>\tEXT.  ACURA/SKID ROW\n</b>\n\tOn foot now, COLE pulls an astonished RAILLY to a wall covered with\n\tgraffiti, a hopeless tangle of symbols, words, and crude pictures.\n\n\tClueless, RAILLY stares at the wall, then at COLE.\n\n\tCOLE touches a bit of red-stenciled graffiti hidden under gang\n\tinsignias.  We can just see TWELVE MONKEYS holding hands in a circle.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe Twelve Monkeys!!!  They're here.\n\t\t\t(looks around)\n\t\tSomewhere.  Come on!\n\n\tHe pulls her along the sidewalk.  No question, he's insane.\n\n\tAt the next alley entrance, COLE stops abruptly.  Then, still\n\tkeeping a firm grip on RAILLY'S arm, he starts ripping down newly\n\ttacked-up posters announcing a Rap concert.\n\n\tRAILLY stares at him, then turns and is looking all around when,\n\tsuddenly, COLE pulls her up tight and threatens...\n\n<b>\t\t\t\tCOLE\n</b>\t\tLook, I'm warning you.  You do anything,\n\t\tI'm going to go crazy -- hurt people!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI'm not going to \"do\" anything, I\n\t\tpromise.  But you need help, James.\n\t\tNone of this is what you think it is.\n\n\tANGLE ON COLE, not listening, staring triumphantly!  He's found\n\tanother partially obscured stencil of THE TWELVE MONKEYS!\n\n\tBut just then, a raspy VOICE startles COLE.\n\n\t\t\t\tRASPY VOICE (o.s)\n\t\tYou can't hide from them, Bob.\n\n\tCOLE whirls, sees a derelict, LOUIE, leering at him, speaking in a\n\tvoice eerily like the RASPY VOICE from the next cell in the future.\n\n<b>\t\t\t\tLOUIE\n</b>\t\tNo, sir, Old Bob -- don't even try.\n\t\t\t(conspiratorially)\n\t\tThey hear everything.  They got that\n\t\ttracking device on you.  They can find\n\t\tyou anywhere.  Anytime.  Ha Ha!\n\n\tRAILLY looks from LOUIS to COLE, sees COLE'S stunned reaction.\n\n<b>\t\t\t\tLOUIE\n</b>\t\t\t(touches his back jaw)\n\t\tIn the tooth, Bob!  Right?\n\t\t\t(sudden triumphant grin)\n\t\tBut I fooled 'em, old buddy!\n\n\tHe opens his mouth wide.  NO TEETH'\n\n\tCOLE grabs RAILLY and pulls her into the alley and down it.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThey're keeping an eye on me.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWho's keeping an eye on you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe man...with the voice.  I recognized\n\t\thim.  He's from the present.  He...\n\n\tCOLE breaks off, freezes as he sees...\n\n\tthere on a brick wall is a stencil of the DANCING MONKEYS\n\n\tAnd further on, another red stencil!\n\n<b>\tEXT.  VACANT LOT - MOMENTS LATER (DAY)\n</b>\n\tCRACKHEADS huddle against a building, sucking their pipes,\n\toblivious to COLE pulling RAILLY past.\n\n\tCOLE scans the walls for messages in the confusion of graffiti.\n\n\tRAILLY is considering her surroundings dubiously when, suddenly,\n\tCOLE pulls her toward the mouth of a dark and forbidding alley.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, no -- we shouldn't be here!\n\n\tCOLE ignores her, yanking her after him into the alley.\n\n<b>\tINT.  DARK ALLEY - DAY\n</b>\n\tTwo TOM CATS face off, arching their backs and HISSING menacingly.\n\n\tCOLE avoids them as he pulls RAILLY into the gloom.\n\n\tANGLE ON RAILLY, seeing something alarming twenty yards ahead!\n\n\tRAILLY'S POV:  TWO THUGS, standing over a MAN, kicking him.\n\n\tRAILLY tries to stop, but COLE, intent on the wall messages,\n\tdoesn't notice the THUGS.\n\n\tThe TWO THUGS turn and spot COLE and RAILLY moving toward them.\n\n\tThese creeps have mean eyes, predator faces.\n\n\tRAILLY digs her heels in, forcing COLE to stop.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!  We have to go back.  Those men...\n\n\tToo late.  While COLE turns and stares at her, uncomprehending,\n\tthe TWO THUGS are approaching.\n\n<b>\t\t\t\tFIRST THUG\n</b>\t\tHey, buddy.\n\n\tStartled, COLE turns to face them.\n\n\tThe SECOND THUG lunges for RAILLY'S purse, yanks it from her.\n\n\tCOLE reaches to grab it back, but...WHACK!  The FIRST THUG smacks\n\tCOLE hard across the face with something metallic.\n\n\tBloody-faced, dazed, COLE doesn't even have a chance to clear his\n\thead as the FIRST THUG shoves the hard object against COLE'S\n\tcheek.  It's a cheap thirty-eight pistol.\n\n\tRAILLY turns to run, gets two steps before the SECOND THUG knocks\n\ther roughly to the ground.\n\n<b>\t\t\t\tSECOND THUG\n</b>\t\tStick around, bitch.\n\n\tLooming over her, the SECOND THUG starts to unzip his fly.\n\tRAILLY looks over to COLE, SEES...\n\n\tCOLE dropping to his knees, groveling at the FIRST THUG'S feet.\n\n<b>\t\t\t\tCOLE\n</b>\t\tPlease!  Please don't hurt me!\n\n\tThe FIRST THUG steps close, kicks COLE contemptuously, cocks his\n\tfoot for a second kick when...\n\n\tCOLE uncoils, lunging, rising, his strong arms around the bigger\n\tman's calves, lifting him mightily, high off the ground.\n\n\tThe gun FIRES wildly as COLE staggers forward with the FIRST THUG\n\tin his arms and smashes the man into the brick wail behind him.\n\tThe FIRST THUG goes down in a heap, dropping the pistol.\n\n\tZipping his fly hastily, the SECOND THUG turns to deal with COLE\n\tbut COLE attacks him....rocking him again and again with savage\n\tblows that come one after another with lightning speed.  The SECOND\n\tTHUG staggers back, bloody and dazed as RAILLY watches, amazed.\n\n\tTurning back to the FIRST THUG, COLE sees the MAN reaching for\n\tthe dropped pistol.\n\n\tCOLE kicks him viciously in the jaw.  The FIRST THUG'S head whips\n\tback.  SNAP!  He collapses against the brick wall.\n\n\tCOLE turns back to see the SECOND THUG retreating down the alley\n\tas fast as he can stagger.\n\n\tRAILLY stares up at COLE.  He looks very dangerous.  He glances\n\tin her direction as he pockets the pistol.\n\n<b>\t\t\t\tCOLE\n</b>\t\tAre you hurt?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tUh, no.  Yes.  I mean, just some scrapes...\n\n\tAs RAILLY gets to her feet, she sees COLE bend over the\n\tmotionless THUG and quickly go through his pockets.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIs he...alive?\n\n\tCOLE ignores the question as he pockets the man's wallet and a\n\thandful of bullets, then turns and snaps at RAILLY.\n\n<b>\t\t\t\tCOLE\n</b>\t\tCome an.  We're running out of time.\n\t\tYou can't help him.\n\n\tAs COLE yanks her roughly away, she looks back, sees the FIRST\n\tTHUG'S sightless eyes, wide open...staring blankly.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOh, Jesus, James!  You killed him!\n\n<b>\t\t\t\tCOLE\n</b>\t\tI did him a favor.  Now come on.\n\n\tCOLE, pulling her again, sees more \"12 MONKEYS\" on the wall.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou didn't have a gun before, did you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI've got one now.\n\n<b>\tEXT.  SECOND AVE - DAY\n</b>\n\tThe EVANGELIST, spotting COLE and RAILLY hurrying past him,\n\tpoints urgently at COLE.\n\n<b>\t\t\t\tEVANGELIST\n</b>\t\tYou!  You!  You're one of us, aren't you?\n\n\tBut COLE has stopped and is staring at...\n\n\tA STOREFRONT OFFICE...its windows covered with posters.  The sign\n\tover the office says, FREEDOM FOR ANIMALS ASSOCIATION.\n\n<b>\tINT.  FAA STORE - MOMENTS LATER (DAY)\n</b>\n\tEarnest young activists, FALE, deathly pale, BEN, long haired,\n\tand TEDDY, muscular, are gathered around a counter collating\n\tleaflets that demand an END TO SPECIEISM.  Behind them, a large\n\tposter proclaims, \"ANIMALS HAVE SOULS, TOO\".  Just then, there's\n\ta tremendous CLAP OF THUNDER as the ACTIVISTS look up and see\n\tCOLE and RAILLY enter.\n\n\tCOLE looks startled.  It sounds like torrential RAIN POURING in\n\there.  Maintaining a tight grip on RAILLY'S wrist, he looks\n\taround frantically for an explanation for the tropical downpour.\n\n\tBookshelves line two walls.  The front window is blanked cut with\n\tposters of Animal Rights demonstrations, newspaper clippings,\n\tphotos of animal atrocities.  The fourth wall features the\n\tcounter where the three ACTIVISTS face COLE as a JUNGLE BIRD\n\tSCREAMS in the DOWNPOUR.\n\n<b>\t\t\t\tFALE\n</b>\t\tUh, can we help you?\n\n\tCOLE looks confused as the RAIN abates and an ELEPHANT trumpets\n\tan urgent warning.\n\n<b>\t\t\t\tFALE\n</b>\t\tExcuse me.  You looking for something\n\t\tin particular?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt's all right, James -- it's just a tape.\n\n\tCOLE'S eyes follow her look.  It's a tape recorder underneath a\n\tsign advertising, \"THE TRUE MUSIC OF THE WORLD\".\n\n<b>\t\t\t\tCOLE\n</b>\t\tI, uh, I'm looking for the, ah, the\n\t\tArmy of the Twelve Monkeys.\n\n\tFALE glances at BEN and TEDDY.  \"We have a problem!\" the look says.\n\tMONKEYS start CHATTERING on the tape as TEDDY comes around the\n\tcounter, bigger than COLE, physically imposing, menacing.\n\n<b>\t\t\t\tTEDDY\n</b>\t\tWe don't know anything about any \"Army\n\t\tof the Twelve Monkeys\", so why don't\n\t\tyou and your friend disappear, okay?\n\n\tCOLE backs away, a firm grip on RAILLY, as a LION ROARS.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI just need some information...\n\n<b>\t\t\t\tTEDDY\n</b>\t\tDidn't you hear me?  We're not...\n\n\tTEDDY breaks off mid-sentence...freezes.\n\n\tCOLE is pointing a pistol at them.  A TIGER SNARLS.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, no -- don't hurt them.\n\t\t\t(to the activists)\n\t\tPlease, I'm a psychiatrist -- just do\n\t\twhatever he tells you to do.  He's...\n\t\tupset -- disturbed.  Please -- he's\n\t\tdangerous -- just cooperate.\n\n\tMONKEYS CHATTER wildly as TEDDY backs up.\n\n<b>\t\t\t\tFALE\n</b>\t\tWhat do you want -- money?  We only\n\t\thave a few bucks.\n\n\tCOLE is suddenly very much in charge and self-confident again.  A\n\tBABOON HOWLS with laughter.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI told you what I want.\n\t\t\t(snaps at Railly)\n\t\tLock the door!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, why don't we...?\n\n<b>\t\t\t\tCOLE\n</b>\t\tLock it now!\n\n\tRAILLY hurries to the door to lock it as BEN says to FALE,\n\n<b>\t\t\t\tBEN\n</b>\t\tI told you that fuckhead Mason would\n\t\tget us into something like this.\n\n<b>\t\t\t\tFALE\n</b>\t\tShut up!\n\n<b>\t\t\t\tCOLE\n</b>\t\tMason???\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJeffrey Mason?\n\n<b>\t\t\t\tBEN\n</b>\t\tYeah, tucking, crazy Jeffrey Mason.\n\n<b>\tINT.  FAA STORE BASEMENT - TWENTY MINUTES LATER (DAY)\n</b>\n\tThe three ACTIVISTS are tied tightly together in the middle of\n\tthe floor in this dimly-lit, windowless basement.  They're very\n\tfrightened, eager to cooperate.\n\n<b>\t\t\t\tFALE\n</b>\t\tThen, Jeffrey becomes like this...big\n\t\tstar -- the media latch on to him\n\t\tbecause he's picketing his own father,\n\t\ta \"famous Nobel Prize winning virologist\".\n\t\tYou musta seen all that on TV.\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, I don't watch TV.\n\n\tCOLE, the gun next to him, rummages through boxes of papers while\n\tRAILLY watches helplessly.  Suddenly, COLE finds something he\n\tthinks he's seen before.  He holds it up.\n\n<b>\t\t\t\tCOLE\n</b>\t\tIs this him -- Dr. Mason?\n\n\tIt's a photograph of DR. MALCOLM MASON, being escorted by a\n\tphalanx of riot cops through a mob of raging activists.\n\n<b>\t\t\t\tFALE\n</b>\t\tThat's him.\n\n<b>\t\t\t\tBEN\n</b>\t\t\t(very frightened)\n\t\tWhat are you going to do with us?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(stares at the photo, then)\n\t\tTell me more about Jeffrey.\n\n<b>\t\t\t\tFALE\n</b>\t\t\t(a helpless shrug to his cohorts)\n\t\tJeffrey started getting bored with the\n\t\tshit we do...picketing, leafleting,\n\t\tletter-writing stuff.  He said we were,\n\t\t\"ineffectual liberal jerkoffs\".  He\n\t\twanted to do guerrilla \"actions\" to\n\t\t\"educate\" the public.\n\n\tCOLE holds up a clipping showing horrified SENATORS standing on\n\ttheir desks as RATTLESNAKES slither along the Senate Floor.\n\n<b>\t\t\t\tFALE\n</b>\t\tYeah, that's when he let a hundred\n\t\tsnakes loose in the Senate.\n\n<b>\t\t\t\tTEDDY\n</b>\t\tBut we weren't into that kind of stuff.\n\t\tIt's counter productive, we told him.\n\n<b>\t\t\t\tFALE\n</b>\t\tSo he and eleven others split off and\n\t\tbecame this underground...\"army\"\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe Army of The Twelve Monkeys.\n\n<b>\t\t\t\tBEN\n</b>\t\tThey started planning a \"Human Hunt\".\n\n<b>\t\t\t\tTEDDY\n</b>\t\tThey bought stun guns and nets and bear\n\t\ttraps.  They were gonna go to Wall\n\t\tStreet and trap lawyers and bankers...\n\n<b>\t\t\t\tBEN\n</b>\t\tBut they didn't do it.  They didn't do\n\t\tany of it.\n\n<b>\t\t\t\tTEDDY\n</b>\t\tYeah, just like always, Mr. Big Shot\n\t\tsold his friends out!\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat's that mean?\n\n<b>\t\t\t\tFALE\n</b>\t\tHe goes on TV, gives a news conference,\n\t\ttells the whole world he just realized\n\t\this daddy's experiments are vital for\n\t\thumanity and that the use of animals is\n\t\tabsolutely necessary and that he, Jeffrey\n\t\tMason, from now on, is going to personally\n\t\tsupervise the labs to make sure all the\n\t\tlittle animals aren't going to suffer.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(holding up a rolodex)\n\t\tWhat's this?\n\n<b>\tEXT.  FREEWAY - AFTERNOON\n</b>\n\tIn the crawling traffic, WE FIND a battered FORD covered with\n\tbumper stickers and painted slogans.  \"I BRAKE FOR ANIMALS\"...\n<b>\t\"FREE THE ANIMALS\"...\"WOULD YOU LET A MINK WEAR YOUR SKIN?\"\n</b>\n\t\t\t\tRAILLY (v.o.)\n\t\tYou can't just barge in on a famous\n\t\tscientist.  They'll have security guards,\n\t\tgates, alarm systems.  It's insane, James.\n\n<b>\tINT.  MOVING FORD/FREEWAY\n</b>\n\tA ROLODEX CARD with an address on \"Outerbridge Road\" for \"Jeffrey\n\tMason c/o Dr. Malcolm Mason\" rests on a map spread across COLE'S\n\tlap.  COLE is in the passenger seat, RAILLY'S at the wheel,\n\tmaneuvering in heavy traffic.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIf those young men don't get loose,\n\t\tthey could die in that basement.\n\n\tCOLE glances out the window, indicates the PEOPLE in passing\n\tcars...COMMUTERS, FAMILIES, TRUCKERS.\n\n<b>\t\t\t\tCOLE\n</b>\t\tAll I see are dead people.  Everywhere.\n\t\tWhat's three more?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(a beat, carefully, a new tack)\n\t\tYou know Dr. Mason's son, Jeffrey\n\t\tMason, don't you, James?  You met him\n\t\tin the County Hospital six years ago.\n\n\tCOLE is studying the map again.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe guy was a total fruitcake.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAnd he told you then his father was a\n\t\tfamous virologist.\n\n\tCOLE is absorbed in the map, his finger tracing \"Outerbridge Road\".\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo -- he said his father was \"God\"!\n\n<b>\tEXT./INT.  FORD/COUNTRY HIGHWAY - LATER (DAY)\n</b>\n\tThe RADIO BLARES a country song as the Ford zips along an open\n\thighway.  COLE has his head out the window, sucking air, loving\n\tthe music, but his bliss is feverish now -- he's not well.  As\n\tthe SONG ends, he pulls his head inside.  An ANNOUNCER'S VOICE\n\tintones over the RADIO...\n\n\t\t\t\tRADIO ANNOUNCER (o.s.)\n\t\tThis just in:  police are widening\n\t\ttheir search for Dr. Kathryn Railly,\n\t\tprominent psychiatrist and author.\n\t\tAuthorities confirm that Dr. Railly has\n\t\tbeen abducted by escaped mental patient,\n\t\tJames Cole. The two are believed to be\n\t\ttraveling in Railly's 1992 black Acura,\n\t\tlicense plate H-E-A-D-D-R.\n\n\tRAILLY glances at him, sees he's in pain.  She feels so badly for\n\thim.  She wants to help him.  She says, tenderly...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThis can't go on, James.  You're not\n\t\twell.  You're burning with fever.\n\n\tCOLE, refusing to succumb, instead, leans over to check the gas gauge.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWe need gas.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI thought you didn't know how to drive.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI said I was too young to drive.  I\n\t\tdidn't say I was stupid.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat's the matter with your leg?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI got shot.  Look -- there's a gas\n\t\tstation up ahead.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tShot!  Who shot you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt was some kind of...war.  Never mind,\n\t\tyou wouldn't believe me.  Turn off here.\n\n<b>\tINT.  PARKED FORD/GAS STATION - MINUTES LATER (AFTERNOON)\n</b>\n\tThe GAS STATION ATTENDANT checks the oil while COLE and RAILLY\n\tremain in the car.  She's pulling a gas card from her wallet.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou were going to run out off gas on\n\t\tpurpose, weren't you?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNo.  I want you to turn yourself in, James --\n\t\tIt'll go much better for you if you do\n\t\t-- but I'm not going to trick you.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(sees the credit card)\n\t\tThat has your name on it.  Give him cash.\n\n\tRAILLY puts the card back into her wallet and pulls out cash as\n\tthe GAS STATION ATTENDANT slams the hood down.\n\n\tRAILLY starts opening the door.  Alarmed, COLE tries to stop her.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhere are you going?\n\n\tShe looks him in the eye, then indicates the tiny Convenience\n\tStore appended to the Gas Station.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou can come with me.  I have to get\n\t\tsome things.  Scissors, bandages, some\n\t\talcohol or whiskey. ... I have to look\n\t\tat your leg, James.  I'm a doctor.\n\n\tCOLE looks helpless, hesitant.  She's in charge...for the moment.\n\n<b>\tEXT.  CLEARING/WOODS - AN HOUR LATER (AFTERNOON)\n</b>\n\tThe sun dazzles through the canopy of leaves.  We HEAR the CAR\n\tRADIO but not the engine.\n\n\t\t\t\tRADIO ANNOUNCER (v.o.)\n\t\tMeanwhile in Fresno, where mining\n\t\tengineers continue their desperate\n\t\tattempt to sink a shaft parallel to the\n\t\tant in which nine year old...\n\n\tCOLE, in his underwear, leans back on a large rock beside the\n\tFord, his pants hanging on the car's open door.  He's staring up\n\tat the sun and the sky.  RAILLY finishes bandaging his thigh.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou shouldn't put your weight on it.\n\t\tYou need stitches and antibiotics.\n\t\tLucky for you it was near the surface.\n\n\tRAILLY wraps the bullet in some gauze and sticks it in her pocket\n\twhile COLE continues staring up at the sky.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI love seeing the sun.\n\n\tA beat.  COLE tries to stand up.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWait -- let me help you.\n\n\tRAILLY puts an arm around him and helps him to his feet.  A beat.\n\tThey're very close.  They don't move.  RAILLY looks like she can\n\tbarely breathe.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(leans closer, shuts his eyes)\n\t\tYou smell so good.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(trying to concentrate)\n\t\tYou have to give yourself up, you know.\n\n\tA beat.  The spell is broken.  He reaches for his pants, then\n\tturns back to her, suddenly grim.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI have to do something now.  Something\n\t\tI don't want to do.  I'm so sorry.\n\n\tRAILLY reacts, sudden fear in her eyes.  He looms over her.  He's\n\tcold now, steeled.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI have a mission.  It's important.\n\n\tRAILLY steps back...horrified, realizing she's going to die.\n\n<b>\tEXT.  MASON MANSION - NIGHT\n</b>\n\tA SECRET SERVICE AGENT ambles vigilantly among the rows of luxury\n\tcars parked beside the brightly-lit rural mansion.  Encountering\n\tanother AGENT, he pauses.\n\n<b>\t\t\t\tFIRST AGENT\n</b>\t\tThey find him?\n\n<b>\t\t\t\tSECOND AGENT\n</b>\t\tWho??\n\n<b>\t\t\t\tFIRST AGENT\n</b>\t\tThat kid.  The one in the pipe.\n\n<b>\t\t\t\tSECOND AGENT\n</b>\t\tYou believe this?  They're dropping a monkey\n\t\tdown there with a miniature infra-red camera\n\t\tstrapped on him and a roast beef sandwich\n\t\twrapped in tinfoil.\n\n<b>\t\t\t\tFIRST AGENT\n</b>\t\tYou're making that up!\n\n\tANGLE UNDER A PARKED MERCEDES, where COLE is hiding, listening to\n\tthe receding VOICES of the AGENTS.\n\n\t\t\t\tSECOND AGENT (o.s.)\n\t\tI shit you not. ... Man, life is weird!\n\t\tA monkey and a sandwich.  Wonder who\n\t\tthought that one up.\n\n\t\t\t\tFIRST AGENT (o.s.)\n\t\tProbly give the sonafabitch a Nobel\n\t\tPrize!\n\n\tQuickly, COLE rolls to the next car and under it.  He doesn't\n\tsee...the pistol fell out of his pocket, under the Mercedes.\n\n<b>\tINT.  MASON MANSION/DINING ROOM - NIGHT\n</b>\n\tA formal dinner for forty.  Desert has been served.  DR. MALCOLM\n\tMASON rises to the enthusiastic applause of the GUESTS.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tWould that I could enjoy this opulent\n\t\tdinner and this excellent and\n\t\tstimulating company for itself, with no\n\t\tsense of purpose.  But alas, I am\n\t\t\"burdened\" with the sense that with all\n\t\tthis excess of public attention and\n\t\tthis cacophony of praise, there comes\n\t\tgreat responsibility.  Indeed, I\n\t\tpractically feel a soapbox growing\n\t\tunder my feet whenever I stand for more\n\t\tthan a few seconds.\n\n\tWhile GUESTS laugh at DR. MASON'S last remark, SECRET SERVICE\n\tAGENT #3 enters the room, scowling, looking for someone.\n\n\t\t\t\tDR. MASON (o.s.)\n\t\tThe dangers of science are a time worn\n\t\tthreat, from Prometheus stealing fire\n\t\tfrom the Gods to the Cold War era of\n\t\tthe Dr. Strangelove Terror.\n\n\tAGENT #3 spots who he's looking for.  JEFFREY MASON!\n\n\t\t\t\tDR. MASON (cont.)\n\t\tBut never before, not even at Los Alamos\n\t\twhen the scientists made bets on whether\n\t\ttheir first atomic bomb test would wipe out\n\t\tNew Mexico, has science given us so much\n\t\treason to fear the power we have at hand.\n\n\tANGLE ON JEFFREY, as AGENT #3 whispers in his ear.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhat are you talking about?  What\n\t\tfriend?  I'm not expecting anyone.\n\n\tANGLE ON DR. MASON, reacting with irritation to the disturbance.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tCurrent genetic engineering as well as\n\t\tmy own work with viruses has presented\n\t\tus with powers as terrifying as any...\n\n\tANGLE ON JEFFREY, following the AGENT out of the dining room,\n\tgrumbling loudly enough to disturb his father's audience.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tThis is ridiculous.  My father is\n\t\tmaking a major address.\n\n<b>\tINT.  HALLWAY/MASON MANSION\n</b>\n\tThe conversation continues as JEFFREY and AGENT #3 enter the hall.\n\n<b>\t\t\t\tAGENT #3\n</b>\t\tNormally if we caught a guy sneaking\n\t\taround like this with no I.D., we'd\n\t\tbust his ass, excuse the French, but\n\t\tthis one said he knows you...\n\t\t\t(smirk, smirk)\n\t\t-- and, since you seem to have had\n\t\tsome...uh...unusual...uh...\"associates\",\n\t\twe certainly didn't want to arrest one\n\t\tof your, uh, closest...pals.\n\n<b>\tINT.  LIBRARY/MASON MANSION\n</b>\n\tCOLE, smudged with dirt and car grease, sitting in the shadows in\n\ta wingback chair, looks up as JEFFREY and AGENT #3 enter the\n\troom.  A FOURTH AGENT looms beside the wingback chair.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(dismissing Cole casually)\n\t\tNever saw him before in my life.  Go\n\t\tahead and shoot him or torture him or\n\t\twhatever it is you do.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(rising)\n\t\tYou do know me.  You helped me once.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(turning to leave)\n\t\tThat would be totally out of character.\n\t\tHelping people is against my principles.\n\t\t\t(to the Agents)\n\t\tSee, he definitely doesn't know me.  Now,\n\t\tI'm going to go back and listen to my\n\t\tfather's very eloquent discourse on the\n\t\tperils of science WHILE YOU TORTURE THIS\n<b>\t\tINTRUDER TO DEATH.\n</b>\n<b>\t\t\t\tCOLE\n</b>\t\tI'm here about some monkeys.\n\n\tHalfway out the door, JEFFREY freezes.  A beat.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tExcuse me -- what did you say?\n\n<b>\t\t\t\tCOLE\n</b>\t\tMonkeys.  Twelve of them.\n\n\tJEFFREY frowns, turns, considers COLE.  Then, suddenly, JEFFREY\n\trushes to COLE and embraces him.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tArnold...Arnold.\n\n\tCOLE is astonished.  The AGENTS are, too.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(stepping back)\n\t\tMy God, Arnie, what's happened to you?\n\t\tYou look like shit\n\n<b>\t\t\t\tAGENT #3\n</b>\t\t\t(dubious)\n\t\tYou know this man?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tOf course I know him.  What do you\n\t\tthink -- I act like this to strangers?\n\t\tListen -- you fellas are terrific.  I\n\t\tthought you were pulling a number on\n\t\tme.  What a terrible thing if you'd\n\t\tthrown old Arnie out.  I owe you guys\n\t\tthe big apologia!  Mea culpa, fellas.\n\t\t\t(turning to Cole)\n\t\tChrist, Arnie, it's black tie!  I mean,\n\t\tI said, \"drop by,\" but, like, this is\n\t\tDad's big \"do\"...vips, senators, secret\n\t\tservice, and...and everything.\n\n\tJEFFREY throws an arm around COLE'S shoulder and starts leading\n\thim toward the door as the two AGENTS exchange narrow-eyed looks.\n\n<b>\t\t\t\tAGENT #4\n</b>\t\t\"Arnie?\"\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tArnold Pettibone.  Old Arnie Pettibone.\n\t\tUsed to be my best friend.  Still is.\n\t\tWhat've you lost, Arnie -- forty pounds?\n\t\tNo wonder I didn't know you. You hungry?\n\t\tLots of dead cow, dead lamb, dead pig.\n\t\tReal killer feast we're putting on tonight.\n\n\tThe AGENTS watch JEFFREY lead the limping, disheveled COLE out.\n\n<b>\t\t\t\tAGENT #4\n</b>\t\tThese people -- all of 'em -- are true\n\t\tweirdoes!\n\n<b>\t\t\t\tAGENT #3\n</b>\t\t\t(moving to the phone)\n\t\tI'm gonna call in a description of this\n\t\t\"Pettibone\" character.  You go keep an\n\t\teye on him.  Make sure he doesn't do\n\t\tone of the guests with a fork.\n\n<b>\tINT.  HALLWAY/MASON MANSION\n</b>\n\tGUESTS pouring from the dining room into the hall meet JEFFREY\n\tand a very disconcerted COLE.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tHey, nice ta see ya.  Lookin' good!  Hi,\n\t\tthere.  Yes, it has been a long time.\n\n\tIn the b.g., too far away to hear them, AGENT #4 trails JEFFREY and\n\tCOLE as they maneuver through the GUESTS toward the grand staircase.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(whispers to Cole)\n\t\tCounty Hospital, right?  1989.  The\n\t\t\"Immaculate Escape\" -- am I right?\n\t\t\t(smiling to guests)\n\t\tWhy, thank you -- you look wonderful, too.\n\n<b>\t\t\t\tCOLE\n</b>\t\tListen to me -- I can't do anything\n\t\tabout what you're going to do. I can't\n\t\tchange anything.  I can't stop you.  I\n\t\tjust want some information...\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWe need to talk.  Come on.  Upstairs.\n\t\t\t(to a guest)\n\t\tI am a new person!  I'm completely\n\t\tadjusted.  Witness the tux.  It's Armani.\n\t\t\t(whispers to Cole)\n\t\tWho chattered?  Goines?  Weller?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI just need to have access to the pure\n\t\tvirus, that's all!  For the future!\n\n\tJEFFREY studies COLE.  COLE doesn't just talk crazy.  He looks crazy!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tCome on, follow me.  You don't lock so good.\n\n\tJEFFREY starts guiding COLE up the grand staircase as COLE, glancing\n\tback, spots AGENT #3 and AGENT #4, both keeping an eye on him now.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI don't have time to go upstairs.  The\n\t\tpolice are looking for me.  I need to\n\t\tknow where it is and exactly what it is.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(brightening suddenly)\n\t\tI get it!  This is your old plan, right?\n\n<b>\t\t\t\tCOLE\n</b>\t\tPlan?  What are you talking about?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tRemember?  We were in the dayroom,\n\t\twatching TV, and you were all upset\n\t\tabout the...desecration of the planet.\n\t\tAnd you said to me, \"Wouldn't it be\n\t\tgreat if there was a germ or a virus\n\t\tthat could wipe out mankind and leave\n\t\tthe plants and animals just as they\n\t\tare?\"  You do remember that, don't you?\n\n<b>\t\t\t\tCOLE\n</b>\t\tBulishit!  You're fucking with my head!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tAnd that's when I told you my father was\n\t\tthis famous virologist and you said, \"Hey,\n\t\the could make a germ and we could steal it!\"\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(grabbing Jeffrey)\n\t\tListen, you dumb fuck!  The thing mutates\n\t\tWe live underground!  The world belongs\n\t\tto the fucking dogs and cats.  We're\n\t\tlike moles or worms.  All we want to do\n\t\tis study the original...\n\n<b>\t\t\t\tAGENT #4'S VOICE\n</b>\t\tOkay -- take it easy.  We know who you\n\t\tare, Mr. Cole.\n\n\tCOLE feels a firm grip on his shoulder, turns and sees AGERT #4\n\n<b>\t\t\t\tAGENT #4\n</b>\t\tLet's go somewhere and talk this thing\n\t\tover. Okay? Just come with me...\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou're right!  Absolutely right.  Me's\n\t\ta nut case, totally deranged.  Delusional!\n\t\tParanoid.  HIS PROCESSOR'S ALL FUCKED\n<b>\t\tUP, HIS INFORMATION TRAY IS JAMMED.\n</b>\n\tAGENT #4 is wishing JEFFREY would chill out even as the THIRD\n\tAGENT is climbing up the staircase to help.\n\n\tCOLE is like a trapped animal. He's being led down the staircase\n\tnow with JEFFREY, right on his heels, yelling so EVERYONE can hear.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tYOU KNOW WHAT IT IS, THE \"ARMY OF THE\n</b><b>\t\tTWELVE MONKEYS\"?  IT'S A COLLECTION OF\n</b><b>\t\tNATURE KOOKS WHO RUN A STORE DOWNTOWN.\n</b><b>\t\tSPACE-CASE DO-GOODERS SAVING RAIN\n</b><b>\t\tFORESTS. I HAVE NOTHING TO DO WITH\n</b><b>\t\tTHOSE BOZOS ANYMORE. I QUIT BEING THE\n</b><b>\t\tRICH KID FALL GUY FOR A BUNCH OF\n</b><b>\t\tINEFFECTUAL BANANAS. SO MUCH FOR YOUR\n</b><b>\t\tGRAND PLOT!\n</b>\n\tCOLE stares back at JEFFREY as both AGENTS hustle COLE down the\n\tstairs.  It sounds true!  JEFFREY'S so confident.\n\n<b>\t\t\t\tAGENT #3\n</b>\t\tTake it easy, Mr. Mason, we've got him.\n\t\tEverything's...\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tMY FATHER HAS BEEN WARNING PEOPLE ABOUT\n</b><b>\t\tTHE DANGERS OF EXPERIMENTATION WITH\n</b><b>\t\tVIRUSES AND DNA FOR YEARS. YOU'VE\n</b><b>\t\t\"PROCESSED\" THAT INFORMATION THROUGH\n</b><b>\t\tYOUR ADDLED PARANOID INFRA-STRUCTURE AND\n</b><b>\t\tLO AND BEHOLD, I'M FRANKENSTEIN AND THE\n</b><b>\t\t\"ARMY OF THE TWELVE MONKEYS\" BECOMES\n</b><b>\t\tSOME SORT OF SINISTER REVOLUTIONARY\n</b><b>\t\tCABAL. THIS MAN IS TOTALLY BATSHIT! YOU\n</b><b>\t\tKNOW WHERE HE THINKS HE COMES FROM???\n</b>\n\tSuddenly, COLE, catching the AGENTS by surprise, wrenches free,\n\tshoves them aside, and stumbles down the rest of the staircase.\n\n<b>\tINT.  FOYER/MASON MANSION\n</b>\n\tCOLE heads for the front door, but there's an AGENT there!  COLE\n\tturns and limps madly toward the dining room, pushing his way\n\tthrough the crowd of amazed GUESTS.\n\n<b>\tINT.  DINING ROOM/MASON MANSION\n</b>\n\tSERVANTS, clearing the table, look up astonished as two AGENTS\n\tburst into the room.\n\n<b>\t\t\t\tAGENT #4\n</b>\t\tDid a man just come through here...limping?\n\n<b>\tINT.  KITCHEN/MASON MANSION\n</b>\n\tCOOKS stare, amazed, as two OTHER AGENTS burst into the kitchen\n\tand look about urgently.\n\n<b>\tINT.  DEN/MASON MANSION\n</b>\n\tA large projection TV is on and a knot of GUESTS is gathered in\n\tfront of it...watching the spooky VIDEO IMAGES.\n\n\t\t\t\tTV REPORTER (v.o.)\n\t\tThese pictures we are seeing are coming\n\t\tto us live from deep inside the pipe.\n\t\tYou can just make out the metal wall\n\t\tbehind those roots and I guess those\n\t\tmust be spider webs.\n\n\tMRS. McCANN, a guest, watching the TV, expresses concern...\n\n\t\t\t\tMRS. McCANN\n\t\tWell, if you ask me, I think that monkey\n\t\tis going to eat the sandwich himself.\n\n\tJust then, two AGENTS burst into the den.\n\n\tThe GUESTS turn from the TV, startled, stare open-mouthed, but\n\tthe AGENTS have spotted an open window and are hurrying to it.\n\n\tAGENTS POV OUT THE WINDOW:  the rows of expensive parked CARS.\n\n\tON THE TV SCREEN, RAILLY'S photograph appears.\n\n\t\t\t\tTV ANCHOR (v.o.)\n\t\tThis just in:  Police say that the body of\n\t\ta woman found strangled in the Knutson state\n\t\tPark could be kidnap victim, Dr. Kathryn Railly.\n\n\tAs the AGENTS run out of the room, a photo of RAILLY'S abandoned\n\tAcura comes up on the TV screen.\n\n\t\t\t\tTV ANCHOR (v.o.)\n\t\tEarlier in the day, police located\n\t\tRailly's abandoned car not far from a\n\t\tbuilding where three animal rights\n\t\tactivists were found bound and gagged...\n\n<b>\tEXT.  MASON MANSION - MINUTES LATER (NIGHT)\n</b>\n\tPistols drawn, AGENTS move cautiously among the rows of parked\n\tluxury cars, checking inside and under the vehicles.\n\n\t\t\t\tAN AGENT'S VOICE (o.s.)\n<b>\t\tCOME ON OUT, MR COLE -- WE'RE NOT GOING\n</b><b>\t\tTO HURT YOU.\n</b>\n<b>\tINT.  PARKED GREEN JAGUAR\n</b>\n\tCOLE, scrunched down on the floor next to the driver's seat,\n\tspots the key dangling from the ignition, then lifts his head\n\tslightly to study the shift mechanism, trying to figure it out.\n\n<b>\tEXT.  PARKED CARS/MASON MANSION\n</b>\n\tAGENTS continue to move cautiously among the parked cars.\n\n<b>\tINT.  PARKED GREEN JAGUAR\n</b>\n\tCOLE eases himself into the driver's seat, tentatively slides the\n\tshift into \"Drive\", then turns the key.  Nothing happens.\n\n\tPanic.  COLE studies the shift again.\n\n<b>\tEXT.  PARKED CARS/MANSION\n</b>\n\tAGENT #5 approaches the row where the Jaguar is parked.\n\n<b>\tINT.  PARKED GREEN JAGUAR\n</b>\n\tCOLE slides the shift from D (Drive) to N (Neutral).  He twists\n\tthe key again.  The engine ROARS...SEVEN THOUSAND RPM!\n\n<b>\tEXT.  LAWN/MANSION\n</b>\n\tAGENT #5 whirls at the sound.\n\n\tSMASH.  The JAGUAR clips the Mercedes parked in front of it and\n\taccelerates right at him!\n\n\tAGENT #5 dives aside just as the speeding JAGUAR whizzes past\n\thim, slams into a parked Cadillac, bounces off, grinds between\n\ttwo other parked vehicles with a fierce scream of tearing metal.\n\n<b>\tINT.  MOVING JAGUAR\n</b>\n\tCaught between two cars, COLE can only lean on the gas pedal.\n\n\tThe JAGUAR comes free with a great SCCCREEEEECH...\n\n\tCOLE sees the driveway ahead in the moonlight.  Steering madly,\n\the plows through shrubs and gardens heading for the driveway.\n\n<b>\tEXT.  MASON MANSION - NIGHT\n</b>\n\tLights off, veering wildly, the JAGUAR reaches the driveway.\n\n\tAGENTS are leaping into cars and a HELICOPTER is coming to life,\n\tits rotors whipping around.\n\n<b>\tINT.  SPEEDING JAGUAR/OUTERHRIDGE ?OAD - NIGHT\n</b>\n\tCOLE turns onto the road, careening crazily from one side to the\n\tother, unable to see ahead with no headlights.\n\n<b>\t\t\t\tCOLE\n</b><b>\t\tLIGHTS!  LIGHTS!\n</b>\n\tHe starts hitting switches.  The wipers come on, the RADIO BLARES.\n\n\t\t\t\tRADIO REPORTER'S VOICE/RADIO (o.s.)\n\t\t---when they pulled the monkey out, it\n\t\twas still clutching the tinfoil wrapped\n\t\tsandwich.\n\n\tRounding a bend, an ONCOMING CAR heads straight at COLE.\n\n\tCOLE yanks the wheel as the OTHER CAR, horn BLARING, just misses him.\n\n\tRecovering, COLE loses the road, speeds crazily along the shoulder.\n\n<b>\tINT.  FLYING HELICOPTER - NIGHT\n</b>\n\tThe PILOT, an agent, steers the chopper while the CO-PILOT pans a\n\tspotlight over the two lane road beneath them.\n\n\tJust then, the PILOT sees headlights below.\n\n<b>\t\t\t\tPILOT\n</b>\t\tThere!  He's showing lights.\n\n<b>\tINT.  SPEEDING JAGUAR - NIGHT\n</b>\n\tCOLE can see the road now in his headlights as the windshield\n\twipers scrape frantically and the RADIO BLARES...\n\n\t\t\t\tRADIO REPORTER'S VOICE/RADIO (o.s.)\n\t\tWe don't know what to think.  They\n\t\tdidn't locate him and they don't know\n\t\thow much longer he can last, that's\n\t\tassuming the boy is still alive.\n\n\tA spotlight hits the car and COLE hears the sound of the\n\tHELICOPTER as it lowers over him!\n\n<b>\tEXT.  OUTERBRIDGE ROAD\n</b>\n\tThe HELICOPTER maneuvers over the speeding JAGUAR.\n\n<b>\tINT.  SPEEDING JAGUAR\n</b>\n\tCOLE can see the underbelly of the HELICOPTER a few feet above\n\this front windshield.\n\n\tDesperate, he yanks the wheel hard, veering off the road.\n\n\tCOLE'S POV THROUGH THE WINDSHIELD:  dense woods ahead.\n\n<b>\tEXT.  HELICOPTER/WOODS\n</b>\n\tThe chopper pulls up sharply, avoiding the trees, then levels out.\n\n<b>\tINT.  HELICOPTER\n</b>\n\tThe PILOT skims the top of the trees while the CO-PILOT rakes the\n\tforest below with his spotlight.\n\n<b>\t\t\t\tPILOT\n</b>\t\tGoddamnit!  Where is he?\n\n\tThe CO-PILOT gets a brief glimpse of headlights through the leaves.\n\n<b>\t\t\t\tCO-PILOT\n</b>\t\tThere!  Over there.\n\n<b>\t\t\t\tPILOT\n</b>\t\tWhere?\n<b>\t\t\t\tCO-PILOT\n</b>\t\tEight o'clock!  He was right there.\n\n\tThe headlights are gone.  Nothing but darkness below.\n\n<b>\t\t\t\tPILOT\n</b>\t\tHe musta turned his lights of if.\n\n<b>\t\t\t\tCO-PILOT\n</b>\t\tCouldn't drive down there without\n\t\tlights.  We just can't see 'em.\n\n<b>\t\t\t\tPILOT\n</b>\t\tMaybe he's not driving!\n\n<b>\tEXT.  WOODS - LATER (NIGHT)\n</b>\n\tA weather forecast BLARES from the radio of the steaming Jaguar,\n\tcrumpled into a tree, the driver's door open.\n\n\tA POLICE OFFICER, pistol drawn, approaches the car cautiously, as\n\tOTHER OFFICERS and AGENTS stay behind trees, weapons ready.\n\n\tThe POLICE OFFICER lunges forward, pointing his weapon into the\n\tJaguar.  He inspects the car, then turns and calls out...\n<b> \n</b><b>\t\t\t\tPOLICE OFFICER\n</b>\t\tHe's not in here.\n\n<b>\tEXT.  WOODS/CLEARING - NIGHT\n</b>\n\tLimping, bleeding from various cuts, COLE CRASHES through\n\tunderbrush as he follows a stream through the woods.\n\n\tSuddenly, he sees what he's looking for.\n\n\tThe FORD...barely visible in the moonlight, parked in the trees\n\tbeside the stream.  The car looks empty.\n\n<b>\tINT.  TRUNK/FORD\n</b>\n\tTotal blackness!  The sound of keys in the lock.\n\n\tThen, the trunk swings open and COLE stands in the moonlight,\n\tlooking down\n\n\tRAILLY is in the trunk, tears of rage and frustration in her eyes.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou bastard!  You total bastard!\n\n<b>\tEXT.  FORD\n</b>\n\tCOLE backs away, as RAILLY scrambles out of the trunk, swinging.\n\n\tHe slips, falls, and she starts kicking him as she rants hysterically.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI could have died in there.  If something\n\t\thad happened to you I would have died.\n\n\tCOLE is lying on the ground, looking up, his lip caked with blood.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI...I...I'm really sorry.\n\n\tNoticing his cuts and torn clothes, she stops kicking him.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat have you done?  Did you...kill someone?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(getting to his feet)\n\t\tNo!  I...don't think so.  I stole a car\n\t\tand they chased me.  I hit a tree.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tSee -- you can drive after all!\n\n<b>\t\t\t\tCOLE\n</b>\t\tYeah, sort of, I guess.  I...I'm sorry\n\t\tI locked you up.  I thought...I thought...\n\t\tI think maybe I am crazy!\n\n\tShe looks at him.  Breakthrough?  Very calm now, the doctor.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat made you think that?\n\n<b>\t\t\t\tCOLE\n</b>\t\tJeffrey Mason said it was my idea about\n\t\tthe virus.  And suddenly, I wasn't\n\t\tsure.  We talked when I was in the\n\t\tinstitution, and it was all...fuzzy.\n\t\tThe drugs and stuff.\n\t\t\t(horrified)\n\t\tYou think maybe I'm the one who wiped\n\t\tout the human race?  It was my idea?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNobody is going to wipe out the human\n\t\trace.  Not you or Jeffrey or anybody\n\t\telse.  You've created something in your\n\t\tmind, James -- a substitute reality.\n\t\tIn order to avoid something you don't\n\t\twant to face.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI'm...\"mentally divergent\".  I would\n\t\tlove to believe that.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt can be dealt with, but only if you\n\t\twant to.  I can help you.\n\n\tCOLE reacts to the sound of VOICES in the woods, dogs BARKING.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI need help all right.  They're coming\n\t\tafter me.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tFirst, it's important that you\n\t\tsurrender to them instead of them\n\t\tcatching you running.  Okay?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(brightening)\n\t\tIt would be great if I'm crazy.  If I'm\n\t\twrong about everything...the world will be\n\t\tokay.  I'll never have to live underground.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tGive me the gun.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe gun! ... I lost it\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou're sure?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(showing her)\n\t\tNo gun!\n\t\t\t(looking up)\n\t\tStars!  Air!  I can live here.  Breathe!\n\n\tRAILLY starts around to the front of the car.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI'm going to attract their attention,\n\t\tlet them know where we are, okay?\n\n\tRAILLY gets in the driver's seat...and starts to HONK the horn.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(calling out)\n\t\tThey'll tell you to put your hands on top\n\t\tof your head.  Do what they tell you.  You're\n\t\tgoing to get better, James -- I know it!\n\n\tANGLE ON COLE, spotting something on the ground.  An insect!  He\n\treaches down to grab it, but, instead, grins, grabs some grass,\n\tstands, and starts rubbing it happily all over his face.  The\n\tHORN BLARES as COLE looks up at the sky.\n\n\tANGLE ON THE NIGHT SKY, the moon full, the sky rich with stars.\n\n\tANGLE ON COLE, tears of joy running down his face.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI love this world!\n\n\tANGLE ON RAILLY, in the driver's seat, hearing near-by SHOUTS\n\tfrom the woods.  The police are almost here.  She gets out of the\n\tcar, starts around toward COLE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tRemember, I'm going to help you.  I'll\n\t\tstay with you.  I won't let them...\n\n\tShe breaks off mid-sentence...stares, stunned!\n\n\tCOLE is gone.  Disappeared.\n\n<b>\tINT.  POLICE STATION OFFICE - MORNING\n</b>\n\tRAILLY is being \"debriefed\" by POLICE OFFICERS and FBI AGENTS.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThen I said something to him about\n\t\tcooperating and he said he would do\n\t\tthat, so I got in the car and started\n\t\thonking the horn.  When I got out, he\n\t\twas gone.\n\n<b>\t\t\t\tLIEUTENANT HALPERIN\n</b>\t\tYou lucked out.  For a while we thought\n\t\tyou were a body they found down state...\n\t\tmutilated.\n\n\tA COP enters, hands a photo to LIEUTENANT HALPERIN who studies it.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHe wouldn't do something like that -- he...\n\n<b>\t\t\t\tLIEUTENANT RALPERIN\n</b>\t\t\t(interrupts, hands her the photo)\n\t\tThis the man he attacked?\n\n\tRAILLY looks at the photo, an 8 x 10 of the FIRST THUG, slumped\n\tagainst the alley wall, obviously dead.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI'd like to be clear about this.  That\n\t\tman and the other one were...\"severely\"\n\t\tbeating us.  James Cole didn't start\n\t\tit.  In fact -- he saved me!\n\n<b>\t\t\t\tLIEUTENANT RALPERIN\n</b>\t\tFunny thing, Doctor, maybe you can\n\t\texplain it to me, you being a psychiatrist\n\t\t-- why do kidnap victims almost always\n\t\ttry to tell us about the guys who grabbed\n\t\t'em and try to make us understand how\n\t\tkind these bastards really were?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(as if reciting)\n\t\tIt's a normal reaction to a life-\n\t\tthreatening situation.\n\t\t\t(suddenly animated)\n\t\tHe's sick.  He thinks he comes from the\n\t\tfuture.  He's been living in a carefully\n\t\tconstructed fantasy world and that world\n\t\tis starting to disintegrate.  He needs\n\t\thelp!\n\n<b>\tINT.  AIRPORT CONCOURSE/THE DREAM\n</b>\n\tYOUNG COLE stares, eyes wide.\n\n\tHe sees the BRUNETTE, cradling the head of the BLONDE MAN as he\n\tsprawls on the concourse...\n\n<b>\t\t\t\tASTROPHYSICIST'S VOICE (O.S.)\n</b>\t\tWake up! Wake up!\n\n<b>\t\t\t\tGEOLOGIST'S VOICE (O.S.)\n</b>\t\tI think we gave him too much.\n\n<b>\t\t\t\tMICROBIOLOGIST'S VOICE (O.S.)\n</b><b>\t\tWAKE UP, PRISONER!\n</b>\n<b>\tINT.  SCIENTISTS' CHAMBER - ETERNAL NIGHT\n</b>\n\tCOLE blinks awake. All he can see are blurry faces hovering over\n\thim, hammering him with questions.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tCome on, Cole, cooperate!\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tSpit it out... you went to the home of\n\t\ta famous virologist...\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(weakly)\n\t\tYou...don't...exist!  You're in\n\t\tmy mind...\n\n<b>\t\t\t\tSCIENTISTS (IN RAPID SUCCESSION)\n</b>\t\tWhat?  What's that?  What did he say?  His\n\t\tbrain's fried.  Give him another shot!\n<b>\t\tSPEAK UP, COLE.  WHAT DID YOU DO NEXT?\n</b>\n<b>\tINT.  RAILLY'S APARTMENT - EVENING\n</b>\n\tThe TV shows film of RAILLY leaving the police station.\n\n\t\t\t\tTV REPORTER (v.o.)\n\t\tThe kidnap victim seemed exhausted but\n\t\tapparently unharmed by her 30 hour ordeal\n\t\tas she left the police station in\n\t\tPhiladelphia this morning.  So far she\n\t\thas refused to make a public statement.\n\n\tRAILLY'S friends, MARILOU and WAYNE, are watching the TV.\n\n\tA door opens and KATHRYN RAILLY, wearing a robe, comes out of her\n\tbedroom.  She still looks exhausted   Followed by her cat, she\n\tenters the kitchen area and turns on the kettle as WAYNE hastily\n\tturns down the TV.\n\n<b>\t\t\t\tWAYNE\n</b>\t\tSorry.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNo -- I'm in a state of hyper-\n\t\talertness.  I can't sleep.\n\n<b>\t\t\t\tMARILOU\n</b>\t\tDid you take the sedative?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI hate those things.  They mess my head\n\t\tup.\n\n\tThe old mug shot of COLE appears on the screen and RAILLY remotes\n\tthe volume up.\n\n\t\t\t\tTV REPORTER (v.o.)\n\t\tAlong with the kidnapping of the Baltimore\n\t\twoman, James Cole is now also wanted in\n\t\tconnection with the brutal slaying of\n\t\tRodney Wiggins, an ex-convict from...\n\n\tRAILLY goes to the window, pushes aside the drape, and sees...\n\n\tHER POV:  ACROSS THE STREET...A COP keeps watch.\n\n\t\t\t\tRAILLY (o.s.)\n\t\tDo they really expect him to come here?\n\n\tRAILLY returns to the kitchen area where MARILOU is getting the\n\ttea things out.\n\n\t\t\t\tTV REPORTER on air\n\t\tAnd in Fresno, California...\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(glances sadly toward the TV)\n\t\tHe's dead, isn't he -- that little boy?\n\n<b>\t\t\t\tWAYNE\n</b>\t\tHe's fine.  It was just a \"prank\" he\n\t\tand his friends pulled.\n\n<b>\tCLOSE ON RAILLY'S FACE... SHOCKED.\n</b>\n\tANGLE ON THE TV SCREEN, showing footage of a sheepish nine year\n\told boy being led out of a barn by the police.  The cops look grim.\n\n\t\t\t\tTV REPORTER (v.o.)\n\t\tAuthorities have so far been noncommittal\n\t\tabout whether they will try to file\n\t\tcharges against the families of the\n\t\tchildren involved in the hoax.\n\n\tRAILLY stares at the TV, stunned.\n\n<b>\tINT.  \"HOSPITAL\" ROOM - ETERNAL NIGHT\n</b>\n\tVOICES!  SINGING!  COLE blinks awake, looks around, confused, then\n\tstares in disbelief....\n\n\tCrowded around COLE'S bed, the SCIENTISTS are concluding a\n\tragged, out of tune, rendition of \"BLUEBERRY HILL.\"\n\n<b>\t\t\t\tSCIENTISTS\n</b>\t\t---found my thrills on Blueberry Hill...\n\n\tSeeing he's awake, SCIENTISTS break off the song and applaud.\n\n<b>\t\t\t\tSCIENTISTS\n</b>\t\tWell done, James!  Well done!  Nice\n\t\tgoing!  Congratulations!  Good for you!\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tDuring your \"interview,\" while you\n\t\twere...\"under the influence,\" you told\n\t\tus you liked music!\n\n\tCOLE, confused, looks around, sees he's in a one-bed windowless\n\troom adorned with cheap reproductions of 19th and 20th century\n\tlandscapes.\n\n\tThe BOTANIST responds to COLE'S obvious disbelief with a\n\tfriendly smile and the others join in rapid fire, overlapping.\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tThis isn't the prison, James.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tThis is a hospital.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tBut just until you recover your,\n\t\tuh,... equilibrium.\n\n<b>\t\t\t\tENGINEER\n</b>\t\tYou're still a little... disoriented.\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tStress!  Time travel!\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tYou stood up very well, considering...\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tSuperior work!  Superior!\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tYou connected the Army of the 12\n\t\tMonkeys to a world famous virologist\n\t\tand his son...\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tOthers will take over now...\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tWe'll be back on the surface in a\n\t\tmatter of months....\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tWe'll retake the planet.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWe're very close!  Because of you!\n\n<b>\t\t\t\tENGINEER\n</b>\t\t\t(unrolling a document)\n\t\tThis is it, James...what you've been\n\t\tworking for.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tA full pardon!\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tYou'll be out of here in no time.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWomen will want to get to know you...\n\n<b>\t\t\t\tCOLE\n</b><b>\t\tI DON'T WANT YOUR \"WOMEN,\" YOU\n</b><b>\t\tBRAINLESS TWIT! I WANT TO BE WELL!\n</b>\n\tUnseen until now, two guards, TINY and SCARFACE, suddenly break\n\tthrough the ring of SCIENTISTS, push COLE down, and tighten the\n\tloose restraints, already in place, but unnoticed before.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\t\t(sympathetically)\n\t\tOf course you want to be well, James.\n\t\tAnd you will be...soon.\n\n\tCOLE bursts into hysterical laughter.\n\n<b>\t\t\t\tCOLE\n</b><b>\t\tYOU DON'T EXIST, YOU SILLY BOZOS!\n</b><b>\t\tYOU'RE NOT REAL! HA HA HA! PEOPLE DON'T\n</b><b>\t\tTRAVEL IN TIME! YOU AREN'T HERE.\n</b><b>\t\tMADE YOU UP!  YOU CAN'T TRICK ME!\n</b><b>\t\tYOU'RE IN MY MIND! I'M INSANE AND\n</b><b>\t\tYOU'RE MY INSANITY!\n</b>\n<b>\tINT.  PSYCHIATRIST'S OFFICE - DAY\n</b>\n\tCLOSE ON KATHRYN RAILLY, insisting fiercely to someone,\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHe not only used the word \"prank\" -- he\n\t\tsaid the boy was hiding in a barn.\n\n\tRAILLY's talking to her former boss, DR. OWEN FLETCHER, psychiatrist\n\tsitting across from her in his office, tapping his pen.\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tHe kidnapped you, Kathryn.  You saw him\n\t\tmurder someone.  You knew there was a real\n\t\tpossibility he would kill you, too.  You\n\t\twere under tremendous emotional stress.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tFor God sakes, Owen, listen to me -- he\n\t\tknew about the boy in Fresno and he says\n\t\tthree billion people are going to die!\n\n<b>\t\t\t\tDR. FLETCHER\n</b>\t\tKathryn, you know he can't possibly\n\t\tknow that.  You're a rational person.\n\t\tYou're a trained psychiatrist.  You\n\t\tknow the difference between what's real\n\t\tand what's not.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAnd what we believe is what's accepted as\n\t\t\"truth\" now, isn't it, Owen?  Psychiatry --\n\t\tit's the latest religion.  And we're the\n\t\tpriests -- we decide what's right and what's\n\t\twrong --we decide who's crazy and who isn't. ...\n\t\tI'm in trouble, Owen.  I'm losing my faith.\n\n<b>\tINT. \"HOSPITAL\" CELL - ETERNAL NIGHT\n</b>\n\tAlone in his \"hospital\" room, COLE struggles without success to\n\tfree himself from his restraints.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tYou sure fucked up, Bob!\n\n\tStartled, COLE freezes, then ignores the RASPY VOICE and\n\tcontinues his feverish struggle.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tBut I can understand you don't want\n\t\tyour mistakes pointed out to you. I can\n\t\trelate to that, old Bob.\n\n\tCOLE looks around in spite of himself.  Nothing to see but the\n\twalls and the landscape paintings.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tHey, I know what you're thinking.  You're\n\t\tthinking I don't exist except in your\n\t\thead.  I can see that point of view.  But\n\t\tyou could still talk to me, couldn't you?\n\t\tCarry on a decent conversation?\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(blurting)\n\t\tI saw you! In 1995!  In the real world!\n\t\tYou were a bum!  You pulled out your teeth.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tWhy would I pull out my teeth, Bob?\n\t\tThey don't like that.  That's a no-no.\n\t\tAnd when did you say you saw me?\n\t\tIn...1872?\n\n<b>\t\t\t\tCOLE\n</b><b>\t\tFUCK YOU!\n</b>\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tYelling won't get you what you want.  You\n\t\thave to be smart to get what you want.\n\n<b>\t\t\t\tCOLE\n</b>\t\tOh, yeah?  What do I want?\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tYou don't know what you want?  Sure you\n\t\tdo, Bob.  You know what you want.\n\n\tCOLE, agitated, rocks back and forth.  Then...\n\n<b>\t\t\t\tCOLE\n</b>\t\tTell me.  Tell me what I want.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tTo see the sky -- and the ocean -- to\n\t\tbe topside -- breathe the air -- to be\n\t\twith her. ... Isn't that right?  Isn't\n\t\tthat what you want?\n\n\tCompletely shaken, COLE hesitates for a long moment.  When he\n\tspeaks, it comes out of him like air...a whisper.\n\n<b>\t\t\t\tCOLE\n</b>\t\tMore...than...anything.\n\n<b>\tINT.  RAILLY'S BEDROOM - MORNING\n</b>\n\tRAILLY'S in bed, asleep, having a very bad dream.  Suddenly, the\n\tbedside phone RINGS.  Her eyes snap open.  A beat to orient\n\therself.  RING.  She reaches for the phone.\n\n<b>\tINTERCUT LIEUTENANT HALPERIN'S OFFICE/RAILLY'S BEDROOM\n</b>\n\tCLOSE ON HALPERIN, at his desk, talking into the phone.\n\n<b>\t\t\t\tLIEUTENANT HALPERIN\n</b>\t\tDr. Railly?  Jim Halperin, Philly P.D..\n\t\tSorry to call so early but...\n\n\tCLOSE ON RAILLY, eager, concerned. into the phone,\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou found him?  Is he all right?\n\n\tCLOSE ON HALPEPIN, noting her reaction with raised eyebrows\n\tgiving an \"I told you so\" look to the BLACK PLAINCLOTHES cop\n\tacross his desk, then continuing into the phone,\n\n<b>\t\t\t\tLIEUTENANT HALPERIN\n</b>\t\tAu contraire, Doctor.  No sign of your\n\t\tgood friend, the kidnapper.  However,\n\t\tthe plot thickens.  I have a ballistic\n\t\treport on my desk that says the bullet\n\t\tyou claim you removed from Mr. Cole's\n\t\tthigh is an antique...and all indications\n\t\tare it was fired...sometime prior to 1920.\n\n\tANGLE ON RAILLY, reacting, stunned.\n\n\tANGLE ON HALPERIN, continuing soberly now,\n\n<b>\t\t\t\tLIEUTENANT RALPERIN\n</b>\t\tSo what I was thinking was, maybe if I\n\t\tsent a detective down there to talk\n\t\twith you, you could maybe revise or\n\t\tamplify on the circumstances....\n\t\tHello?  Hello?  Dr. Railly?\n\n\tHALPERIN considers the dead phone, glances at the COP again.\n\n<b>\tINT.  RAILLY'S BEDROOM/STUDY\n</b>\n\tHer hand still on the receiver, RAILLY looks shocked.  Then, she\n\thurries into her study and starts frantically pulling neatly\n\tarranged piles of papers and books from a bookcase until she\n\tfinds a copy of her book.  She leafs through it hurriedly,\n\tlocates the picture of the Puerto Rican KID (JOSE) in WWI.\n\n\tPeering closely, she tries to see everything in the picture.\n\tThen, she turns and reaches for a research folder of old\n\tphotographs and rummages through it until she finds...!!!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNo!\n\n\tIt's an uncropped shot of JOSE being carried on the stretcher in\n\tthe trenches.  And there in the corner with no helmet, no gas\n\tmask, and just a bit of bare shoulder showing...it's COLE!!!\n\n<b>\tINT.  SCIENTISTS' CHAMBER - ETERNAL NIGHT\n</b>\n\tClean shaven, clear eyed, COLE sits before the frowning SCIENTISTS.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tThe food, the sky, the certain, uh,\n\t\tsexual temptations -- you haven't\n\t\tbecome \"addicted\" have you, Cole?  To\n\t\tthat \"dying\" world'\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, sir!  I just want to do my part.\n\t\tTo get us back on top...in charge of\n\t\tthe planet.  And I have the experience,\n\t\tI know who the people are...\n\n<b>\t\t\t\tBIOLOGIST\n</b>\t\tHe really is the most qualified...\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tBut all that...\"behavior\"...\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\t\t(to Cole, a little hurt)\n\t\tYou said we weren't \"real,\" Cole...\n\n<b>\t\t\t\tCOLE\n</b>\t\tWell, sir, I don't think the human mind\n\t\twas built to exist in two different...\n\t\twhatever you call it...\"dimensions.\"\n\t\tIt's stressful, you said it yourselves,\n\t\tit gets you confused.  You don't know\n\t\twhat's real and what's not.\n\n<b>\t\t\t\tMICROBIOLOGIST\n</b>\t\tBut you know what's real now?\n\n<b>\t\t\t\tCOLE\n</b>\t\tYes, sir.\n\n\tThe SCIENTISTS start to confer openly among themselves\n\n<b>\t\t\t\tGEOLOGIST\n</b>\t\tHe'd have to bone up, catch up to our\n\t\tresearch, the latest clues...\n\n<b>\t\t\t\tZOOLOGIST\n</b>\t\tHe's proved to be a quick study...\n\n\tThe ASTROPHYSICIST fixes COLE with a sharp, penetrating look.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tYou can't trick us, you know.  It\n\t\twouldn't work.\n\n<b>\t\t\t\tBIOLOGIST\n</b>\t\tAnd why would you want to?  It'll be\n\t\tdangerously close to the end.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI understand.  There'd be no point.\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tWe're going to think about it, Cole.\n\t\tAmong ourselves.  We'll get back to you.\n\n<b>\tINT.  DR. MASON'S OFFICE - DAY\n</b>\n\tStanding in front of a wall of glass in his office, overlooking a\n\thi-tech lab below where WORKERS in white \"space suits\" work\n\tmethodically, DR. MASON speaks angrily into a phone.  His male\n\tASSISTANT, whose features we don't see, stops writing a formula\n\ton a blackboard and listens.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tYou have reason to believe that my son\n\t\tmay be planning to do what?!!!\n\n<b>\tINT.  RAILLY'S APARTMENT/STUDY\n</b>\n\tRAILLY, trying to stay calm, is talking to Dr. Mason on the phone.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tPlease, I know it sounds insane but...\n\n<b>\tINT.  DR. MASON'S OFFICE\n</b>\n\tDr. Mason on the phone.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\t\t(into the phone)\n\t\tI'm afraid this doesn't seem very\n\t\tprofessional to me, in fact it's\n\t\tdistressingly unprofessional for some-\n\t\tone who treated my son briefly (if\n\t\tindeed you actually are who you say you\n\t\tare) to take a sudden unsolicited interest\n\t\tin his mental health six years later,\n\t\tand to telephone a parent to express\n\t\topinions that would be inappropriate...\n\t\t\t(breaks off, listens, then)\n\t\tI don't know anything about \"Monkey\n\t\tarmies\", Doctor.  Nothing whatsoever.\n\t\tIf my son ever was involved in...\n\t\t\t(listens, then,)\n\t\tIt would be doubly inappropriate to\n\t\tdiscuss matters of security with you,\n\t\tDr. Railly, but if it will put you at\n\t\tease, neither my son nor any other\n\t\tunauthorized person has access to any\n\t\tpotentially dangerous organisms in this\n\t\tlaboratory.  Thank you for your concern.\n\n\tDR. MASON hangs up angrily and glares.\n\n\t\t\t\tDR. MASON'S ASSISTANT (o.s.)\n\t\tDr. \"Kathryn\" Railly????\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tThe psychiatrist who was kidnapped by\n\t\tthat man who broke into my house.  She\n\t\tseems to have been suddenly struck by\n\t\tthe most preposterous notion about Jeffrey.\n\n\t\t\t\tDR. MASON'S ASSISTANT (o.s.)\n\t\tI attended a lecture once...Apocalyptic\n\t\tvisions.\n\n\tWe see Dr. Mason's ASSISTANT now.  It's DR. PETERS, the red-\n\thaired man who insisted to Dr. Railly you didn't have to be\n\tinsane to think the world was coming to an end.\n\n\t\t\t\tDR. PETERS (cont.)\n\t\tHas she succumbed to her own\n\t\ttheoretical...\"disease\"?\n\n\tBut DR. MASON is lost in thought, not listening.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tGiven the nature of our work, we can't ever\n\t\tbe careful enough.  I think we should review\n\t\tour security procedures, perhaps upgrade them.\n\n<b>\tINT.  SCIENTISTS' CHAMBER - ETERNAL NIGHT\n</b>\n\tCOLE is facing the BOTANIST who's using a pointer to indicate\n\tvarious fading photos and newspaper clippings tacked on the wall.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tLet's consider again our current\n\t\tinformation -- if the symptoms were\n\t\tfirst detected in Philadelphia on June\n\t\t28, 1995, that makes us know that...?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt was released in Philadelphia,\n\t\tprobably on June 14, 1995.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tAnd it appeared sequentially after that\n\t\tin...?\n\n\tWith a quick glance at the panel of SCIENTISTS staring at him\n\tfrom behind the long table, COLE replies like a good pupil,\n\n<b>\t\t\t\tCOLE\n</b>\t\tSan Francisco, New Orleans, Rio de\n\t\tJaneiro, Rome, Kinshasa, Karachi,\n\t\tBangkok, then Peking.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tMeaning...???\n\n<b>\t\t\t\tCOLE\n</b>\t\tThat the virus was taken from Philadelphia\n\t\tto San Francisco, then to New Orleans,\n\t\tRio de Janeiro, Rome, Kinshasa, Karachi,\n\t\tBangkok, then Peking.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tAnd your only goal is...???\n\n<b>\t\t\t\tCOLE\n</b>\t\tTo find out where the virus is so a\n\t\tqualified scientist can travel back into\n\t\tthe past and study the original virus.\n\n<b>\t\t\t\tBOTANIST\n</b>\t\tSo that...???\n\n<b>\t\t\t\tCOLE\n</b>\t\tUh, so that a vaccine can be developed\n\t\tthat will, uh, allow mankind to reclaim\n\t\tthe surface of the earth.\n\n\tCOLE glances nervously at the suspicious SCIENTISTS as the\n\tBOTANIST switches on a slide projector and projects...\n\n\ta magazine photo of wall graffiti:  \"ATTENTION!!!  POLICE ARE\n<b>\tWATCHING!  IS THERE A VIRUS?  IS THIS THE SOURCE?  3 BILLION DIE?\"\n</b>\n\t\t\t\tBOTANIST (o.s.)\n\t\tThis is from a magazine printed in late\n\t\tSeptember, 1995.  The writer speculated\n\t\tthat this graffiti might be related to\n\t\tthe epidemic that by that time had\n\t\talready killed thirty million people\n\t\tworld-wide and was getting worse.  He\n\t\tsays, certain people, unnamed, were\n\t\tquestioned, but what came of that is not\n\t\tknown.  But it is a clue you should pursue.\n\n\tCOLE stares at the picture.\n\n<b>\tEXT.  FAA STOREFRONT - DAY\n</b>\n\tLOUD BANGING!  The storefront window, completely covered with\n\tposters, quivers violently.  Images of MONKEYS covered with\n\telectrodes, BABY SEALS being viciously clubbed, DOGS jammed into\n\ttiny cages quiver as somebody beats on the window.  It's RAILLY.\n\n<b>\t\t\t\tRAILLY\n</b><b>\t\tIS ANYBODY IN THERE?  HELLO?  IS\n</b><b>\t\tSOMEONE IN THERE?  IF YOU'RE IN THERE,\n</b><b>\t\tI NEED TO TALK TO YOU.\n</b>\n<b>\tINT.  FAA STORE\n</b>\n\tJEFFREY, BEN, TEDDY, and two of JEFFREY'S youthful cohorts, SANDY\n\tand KWESKIN, wait motionless beside a heap of cardboard cartons\n\tas FALE peeks out the front window through a slit between posters.\n\n<b>\t\t\t\tFALE\n</b>\t\tIt's the kidnap woman -- the one who\n\t\twas with the guy who tied us up.\n\n<b>\t\t\t\tBEN\n</b>\t\tWhat's she doing?\n\n<b>\t\t\t\tFALE\n</b>\t\tShe's drawing attention to us, that's\n\t\twhat she's doing. ... I don't know what\n\t\tyou're up to this time, Mason, but\n\t\tyou're gonna get us in deep shit!\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhine, whine, whine.  What about walkie\n\t\ttalkies?  We used to have walkie talkies.\n\n<b>\tEXT.  FAA STOREFRONT\n</b>\n\tFrom littered doorways, DERELICTS sneak peeks at RAILLY as she,\n\tseemingly mad, shakes the doorknob, then hammers on the door.\n\n<b>\t\t\t\tRAILLY\n</b><b>\t\tI SAW YOU!  I SAW SOMEONE MOVING.  I\n</b><b>\t\tKNOW YOU'RE IN THERE!\n</b>\n\t\t\t\tRASPY VOICE (o.s)\n\t\tSecret experiments!\n\n\tRAILLY whirls, sees LOUIE, the raspy-voiced toothless derelict.\n\n<b>\t\t\t\tLOUIE\n</b>\t\tThat's what they do -- secret weird stuff!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou!  I know you!\n\n\tBut LOUIE is studying the pictures of the tortured animals now.\n\n<b>\t\t\t\tLOUIE\n</b>\t\tNot just on them.  Do 'em on people,\n\t\ttoo -- down at the shelters.  Feed 'em\n\t\tchemicals 'n take pictures of 'em.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHave you seen James Cole?  The man...?\n\n<b>\t\t\t\tLOUIE\n</b>\t\tThey're watchin' you.  Takin' pictures.\n\n\tRAILLY follows his look.\n\n\tANGLE ON AN OLD CHEVY, parked across the street, the PLAINCLOTHES\n\tCOP slouched at the wheel, pretending to read a newspaper.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThe police.  I know.  Listen, I need to\n\t\ttalk to James, but he has to be careful\n\t\thow he contacts me.  He mustn't get\n\t\tcaught.  Do you understand me?\n\n<b>\t\t\t\tLOUIS\n</b>\t\tUh, yeah, sure.  Uh...who's James?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHe was with me, he spoke to you.\n\t\tSeveral weeks ago.  He said you were\n\t\tfrom the future...watching him.\n\n\tLOUIS gives her a look that says, \"I'm outta here!\"\n\n\tBut just then, RAILLY spots two TEZNAGE PUNKS surreptitiously\n\t\"tagging\" their way along the street with cans of spray paint.\n\n\tRAILLY stares at the PUNKS.\n\n<b>\tINT.  FAA STORE\n</b>\n\tFALE watches JEFFREY go over a check list while KWESKIN, SANDY,\n\tand TEDDY organize materials, and BEN peeks out the small opening\n\tbetween posters at the front window.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou get the bolt cutters?\n\n<b>\t\t\t\tKWESKIN\n</b>\t\tOne dozen.  They're in the van.\n\n<b>\t\t\t\tFALE\n</b>\t\tOne dozen bolt cutters!  Whadda you\n\t\tgonna do with one dozen bolt cutters?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(grins)\n\t\tYou really want to know?\n\n<b>\t\t\t\tFALE\n</b>\t\tNo!  Absolutely not. Don't tell me anything.\n\n<b>\t\t\t\tBEN\n</b>\t\tHey!  Do you know what she's doing?\n\n\tEverybody freezes, looking toward 3EN, who's peeking outside.\n\n\tThen, except for JEFFREY, they all crowd around BEN to get a look.\n\n\tPOV THROUGH SLIT:  a glimpse of RAILLY, spray painting the front\n\tof the store!\n\n<b>\t\t\t\tTEDDY\n</b>\t\tWhat's it say?\n\n<b>\t\t\t\tBEN\n</b>\t\tI can't see it.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\t\t(erupting)\n<b>\t\tWHY DON'T WE FORGET MY GODDAMN\n</b><b>\t\tPSYCHIATRIST AND DEAL WITH THE TASK AT\n</b><b>\t\tHAND.  THIS IS IMPORTANT.\n</b>\n<b>\t\t\t\tFALE\n</b>\t\t\t(spinning around)\n\t\tYour psychiatrist?  Did you just say,\n\t\t\"your psychiatrist\"?\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tEx-psychiatrist!  Now, what about\n\t\tflashlights?  How many flashlights...?\n\n<b>\t\t\t\tFALE\n</b>\t\tThat woman is...was...your...\n\t\tpsychiatrist?  And now she's spray-\n\t\tpainting our building?\n\n<b>\tEXT.  FAA STOREFRONT/SECOND AVENUE\n</b>\n\tANGLE ON SLACK PLAINCLOTHES COP, across the street in the CHEVY,\n\tamazed, watching RAILLY spray painting.  He shakes his head wearily.\n\n\tANGLZ ON STREET TYPES, inching closer, watching RAILLY with\n\tamazement, too.  They include...\n\n\tan IRISH DRUNK, white haired, red-faced, bloated...\n\n\ta NATIVE AMERICAN with tormented eyes and a mangled ear...\n\n\tan AFRICAN AMERICAN with one eye...\n\n\tthe TEENAGED PUNKS...\n\n\ta WHITE MAN, shabbily dressed, joining the knot of ONLOOKERS,\n\treacting at the sight of RAILLY.  It's COLE!  He pushes toward her.\n\n<b>\t\t\t\tCOLE\n</b>\t\tKathryn!\n\n\tRAILLY stops spraying, whips around at the sound of his VOICE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!\n\n\tWith a quick glance toward the PLAINCLOTHES COP, RAILLY takes\n\turgent charge of the situation.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!  That's a policeman.  Pretend\n\t\tyou don't know me.  If he sees you...\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(turning, looking)\n\t\tNo, I want to turn myself in.  Where is he?\n\t\t\t(placing his hands on his head)\n\t\tDon't worry -- it's all okay now.  I'm\n\t\tnot crazy any more!  I mean, I am\n\t\tcrazy, mentally divergent, actually,\n\t\tbut I know it now and I want you to\n\t\thelp me.  I want to get well...\n\n\tANGLE on RAILLY, desperately pulling COLE'S hands off his head as\n\tshe tries to block the COP'S view of COLE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames -- put your hands down and listen\n\t\tto me.  Things have changed!\n\n\tANGLE ON THE PLAINCLOTHES COP, checking the mug shot of COLE on\n\this clipboard, then reaching for his radio mike.\n\n\tANGLE ON RAILLY, reacting to the COP speaking into his mike:  she\n\ttosses the spray paint can aside, grabs COLE and tries to pull\n\thim along...but COLE isn't moving.  He's staring at the front of\n\tthe FAA Store with disbelief!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, come on!  We have to get out of here!\n\n\tCOLE looks from the wall to the can rolling on the sidewalk,\n\tthen back to the wall where RAILLY has sprayed the huge words:\n\n<b>\t\t\tATTENTION!!!  POLICE ARE WATCHING!\n</b><b>\t\t\tIS THERE A VIRUS?  IS THIS THE\n</b><b>\t\t\tSOURCE?  THREE BILLION DIE?\n</b>\n\tIt's the graffiti COLE saw in the future, in the picture!\n\n<b>\t\t\t\tCOLE\n</b>\t\tI've seen that...before.\n\n\tBut RAILLY'S total attention is on their dilemma.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, trust me.  We're in terrible\n\t\ttrouble.  We have to run.\n\n\tVery confused, COLE lets her drag him along the sidewalk, past\n\tONLOOKERS.  She looks crazier than he does.\n\n\tANGLE ON THE CHEVY, making a sudden, urgent u-turn, almost\n\tcolliding with a passing car.  BRAKES SQUEAL and a HORN BLARES.\n\n<b>\tINT.  FAA STORE - DAY\n</b>\n\tANGLE ON BEN, peeking out, reacting to the drama.\n\n<b>\t\t\t\tBEN\n</b>\t\tWow, a guy in a Chevy is chasing her\n\t\tand some other guy I can't see.\n\n<b>\t\t\t\tFALE\n</b>\t\tHey, no problem, it's probably just\n\t\tanother kidnapping featuring Jeffrey's\n\t\tshrink, pardon me, make that ex-shrink.\n\t\t\t(indicating Jeffrey to the others)\n\t\tThis is your leader, a certifiable lunatic\n\t\twho told his former psychiatrist all his\n\t\tplans for God knows what whacko irresponsible\n\t\tschemes, and now who knows what she's\n\t\tpainted out there on our wall?\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tWHO CARES WHAT PSYCHIATRISTS WRITE ON\n</b><b>\t\tWALLS?\n</b>\t\t\t(moves to Fale, jabs him with a finger)\n\t\tYou think I told her about the Army of\n\t\tthe 12 Monkeys?  Impossible!  Know why,\n\t\tyou pathetically ineffectual and\n\t\tpusillanimous \"pretend-friend-to-\n\t\tanimals\"?!  I'll tell you why:  because\n\t\twhen I had anything to do with her six\n\t\tyears ago, there was no such thing -- I\n\t\thadn't even thought of it yet!\n\n<b>\t\t\t\tFALE\n</b>\t\t\t(triumphant)\n\t\tThen how come she knows what's going on?\n\n\tJEFFREY abruptly switches from rage to good humor, adopting a\n\tsupercilious smile and a patronizing tone.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tHere's my theory on that.  While I was\n\t\tinstitutionalized, my brain was studied\n\t\texhaustively in the guise of mental health.\n\t\tI was interrogated, x-rayed, studied\n\t\tthoroughly.  Then, everything about me\n\t\twas entered into a computer where they\n\t\tcreated a model of my mind.\n\n\tThey all stare, mesmerized, at the strutting JEFFREY.  Is he\n\tserious?  Is he crazy?  Doesn't matter -- he's charismatic.\n\n\t\t\t\tJEFFREY (cont.)\n\t\tThen, using the computer model, they\n\t\tgenerated every thought I could possibly\n\t\thave in the next, say ten years, which\n\t\tthey then filtered through a probability\n\t\tmatrix to determine everything I was\n\t\tgoing to do in that period.  So you\n\t\tsee, she knew I was going to lead the\n\t\tArmy of the Twelve Monkeys into the\n\t\tpages of history before it ever even\n\t\toccurred to me.  She knows everything\n\t\tI'm ever going to do before I know it\n\t\tmyself.  How about that?\n\n\tJEFFREY smiles smugly into FALE'S flabbergasted face.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tNow I have to get going -- do my part.\n\t\tYou guys check all this stuff out and\n\t\tload up the van.  Make sure you have\n\t\teverything.  I'm outta here.\n\n\tJEFFREY exits.  The others stare at the door.\n\n<b>\t\t\t\tFALE\n</b>\t\tHe's seriously crazy -- you know that.\n\n<b>\tEXT.  SKID ROW ALLEY - DAY\n</b>\n\tAn overflowing dumpster squats near the mouth of an alley.\n\n\tThe unmarked CHEVY crawls slowly past the alley, the PLAINCLOTHES\n\tCOP'S eyes searching everywhere.\n\n\tTrash stirs in the dumpster and RAILLY'S eyes peer up out of the\n\ttorn cardboard boxes, rotting food, and styrofoam litter.\n\n\tHER POV:  the POLICE CAR passes from view.\n\n\tANGLE ON RAILLY, emerging from the refuse, hissing,\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!  Come on.\n\n\tA confused COLE emerges from the opposite end of the dumpster,\n\tbits of lettuce in his hair.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI don't understand what we're doing.\n<b>\t\n</b><b>\t\t\t\tRAILLY\n</b>\t\t\t(climbing out of the dumpster)\n\t\tWe're avoiding the police until I\n\t\tcan....talk to you.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(climbing out after her)\n\t\tYou mean, treat me?  Cure me?  Kathryn,\n\t\tthose words on the wall -- I've seen\n\t\tthem before...  I...I...dreamed them.\n\n\tBut she's not listening.  She's peeking out the alley entrance.\n\n\tRAILLY'S POV:  across the street is a run-down skid row hotel,\n<b>\tTHE GLOBE, ROOMS WEEKLY, DAILY.\n</b>\n<b>\tINT.  GLOBE HOTEL/LOBBY - MINUTES LATER\n</b>\n\tThe DESK CLERK, an old alkie who hates trouble but finds it often,\n\tstares across the counter suspiciously at RAILLY and COLE.\n\n<b>\t\t\t\tDESK CLERK\n</b>\t\tTwenty five bucks an hour.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAn hour?!\n\n<b>\t\t\t\tDESK CLERK\n</b>\t\tYou want quarter hours, go someplace else.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(catches on, pulls out her last bills)\n\t\tHere's ninety eight.  For the night.  Deal?\n\n\tThe DESK CLERK squints warily at this turn of events.  Then, he\n\tturns, gets a key, turns back and hands it to her.\n\n<b>\t\t\t\tDESK CLERK\n</b>\t\tForty four.  Fourth floor, turn right.\n\t\tElevator's busted.\n\n\tRAILLY turns, COLE follows, and they walk quickly to the stairs\n\tpassing the stares of gloomy RESIDENTS sitting on torn sofas\n\tchairs in front of an old TV with hideous color.\n\n\tANGLE ON THE DESK CLERK, watching RAILLY and COLE climb\n\tstairs.  As they disappear from view, he picks up the phone,\n\tpunches a number, speaks into the phone.\n\n<b>\t\t\t\tDESK CLERK\n</b>\t\tTommy?  This is Charlie at the Globe.\n\t\tYou know if Wallace has a new girl?\n\t\tSort of a rookie type?  Blonde?\n\n<b>\tINT.  GLOBE HOTEL ROOM 44 - MINUTES LATER (DAY)\n</b>\n\tCOLE sits on the lumpy bed in the dingy room, watching RAILLY\n\tpace back and forth like a mad woman.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOkay...you were standing there looking\n\t\tat the moon...you were eating grass...\n\t\tthen what?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI thought I was in...prison again.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJust like that?  You were in prison?\n\n<b>\t\t\t\tCOLE\n</b>\t\tNo, not really.  It's...it's in my\n\t\tmind.  Like you said.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou disappeared!  One minute you were\n\t\tthere, the next minute you were gone.\n\t\tDid you run through the woods?\n\n<b>\t\t\t\tCOLE\n</b>\t\tI don't know -- I don't remember.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThe boy in the well.  How did you know\n\t\tthat was just a hoax?\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt was?  I didn't...know.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, you said he was hiding in the barn...\n\n<b>\t\t\t\tCOLE\n</b>\t\tI think I saw a TV show like that when\n\t\tI was a kid.  Where a boy...\n\n<b>\t\t\t\tRAILLY\n</b><b>\t\tIT WASN'T A TV SHOW!  IT WAS REAL!\n</b>\n\tCOLE looks at her.  She's really upset.\n\n<b>\t\t\t\tCOLE\n</b>\t\tWell, maybe that kid saw the same TV\n\t\tshow and copied it.  Listen, you were\n\t\tright, it's all in my head.  I'm mentally\n\t\till, I imagine all that stuff.  I know\n\t\tthey're not real, I can trick them, make\n\t\tthem do what I want.  I just worked on\n\t\tthem in my head and I got back here.  I\n\t\tcan get better.  I can stay here.\n\n\tRAILLY pulls a photo from her purse, shows it to COLE.\n\n\tIt's the uncropped picture from her book, the photo of JOSE in\n\tWWI with a fuzzy image of COLE on the edge of the frame,\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat does this mean to you?\n\n<b>\t\t\t\tCOLE\n</b>\t\t...I had a dream about...something\n\t\tlike that.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou had a bullet from World War One in\n\t\tyour leg, James!  How did it get there?\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou said I had delusions -- that I\n\t\tcreated a world -- you said you could\n\t\texplain everything...\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWell, I can't. ... I mean...I'm trying\n\t\tto.  I can't believe that everything we\n\t\tdo or say has already happened, that we\n\t\tcan't change what's going to happen,\n\t\tthat I'm one of the three billion\n\t\tpeople who are going to die...soon.\n\n\tCOLE stands, moves close to her.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI want to be here.  In this time.  With\n\t\tyou.  I want to become...become a whole\n\t\tperson.  I want this to be the present.\n\t\tI want the future to be unknown.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(sudden hopeful idea!)\n\t\tJames...do you remember...six years\n\t\tago...you had a phone number!  You\n\t\ttried to call and...\n\n\tWHAM!  The door flies open, kicked violently, the flimsy lock not\n\tholding.  A menacing figure stands in the doorway.  WALLACE.  A\n\twiry biker-type with jail house tattoos and mean eyes.\n\n\tCOLE and RAILLY are too stunned to say anything as WALLACE looks\n\tthem over coldly, insolently, then advances on RAILLY.\n\n<b>\t\t\t\tWALLACE\n</b>\t\tThis is my territory, bitch!\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(confused, turns to Railly)\n\t\tIs this real -- or is this one of my\n\t\tdelusions?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThis is definitely real:\n\t\t\t(to Wallace)\n\t\tExcuse me, I think we have a little\n\t\tmisunderstanding here...\n\n\tWALLACE smashes RAILLY in the face.  She flies back against the\n\twall and onto the floor as WALLACE spins around to COLE who is\n\tstepping toward him, but WALLACE is now holding a knife\n\n<b>\t\t\t\tWALLACE\n</b>\t\tWhat're you -- some kind of tough guy?\n\t\tYou wanna be a hero?  You gonna try and\n\t\tmess with me?  Come on...\n\n\tA beat.  COLE puts his hands up placatingly as he backs around\n\tWALLACE and moves to RAILLY, whose eye is already swelling.\n\n<b>\t\t\t\tWALLACE\n</b>\t\tNow that's a smart boy.  But you,\n\t\thoney, you think you can go 'round\n\t\tme and peddle your fancy ass in this\n\t\tpart of town, you bet your life we got\n\t\twhat I would call a major goddamn\n\t\tmisunderstandin'.\n\n\tRAILLY reaches a hand up to COLE for assistance, but, he grabs\n\ther purse instead, swings it around, SMASHES WALLACE in the face\n\twith it, then grabs the pimp's arm and SNAPS it like it was a\n\ttwig!  The knife clatters to the floor as WALLACE yelps in pain\n\tand COLE slams him to the floor, straddles his chest, retrieves\n\tthe near-by knife, and presses it sharply against WALLACE'S neck.\n\n<b>\t\t\t\tRAILLY\n</b><b>\t\tJAMES -- DON'T!\n</b>\n\tCOLE hesitates.\n\n<b>\t\t\t\tWALLACE\n</b>\t\t\t(eyes bulging)\n\t\tYou...heard...her.  Don't do it, man.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(gets up, looks around)\n\t\tPut him in the closet, ... But get his\n\t\tmoney first.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(amazed)\n\t\tYou want me to rob him?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI...I...We need cash, James.\n\n\tA shadow.  RAILLY turns toward the door and glimpses a FACE\n\tdisappearing, then hears SHOUTS from the hallway...\n\n\t\t\t\tSHOUTS (o.s.)\n\t\tThey're killing him!  Call the cops.\n\n\tBeing very careful not to move his neck, WALLACE reaches into his\n\tpocket and produces a thick roll of bills, which RAILLY grabs.\n\n<b>\t\t\t\tWALLACE\n</b>\t\tYou two are crazy.  I got friends.  You\n\t\tput me in a closet, they're gonna be\n\t\treally pissed.\n\n\tCOLE moves off Wallace and, keeping the knife close, yanks him to\nhis teeth while RAILLY hurries to the window and looks out.\n\n\tHER POV:  A fire escape leads down into an alley.\n\n\tRAILLY turns just in time to see COLE shove WALLACE into the\n\tbathroom, follow him in, slam the door behind them, and LOCK it.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames, no!\n\n<b>\tINT.  BATHROOM\n</b>\n\t\t\t\tRAILLY'S VOICE (from the other room)\n\t\t\t(rattling the door knob)\n\t\tJames, what are you doing?\n\n\tWALLACE cowers back against the shower stall.\n\n<b>\t\t\t\tWALLACE\n</b>\t\tI have friends, man -- if you cut me...\n\n\tWALLACE breaks off, bug-eyed, reacting to something we don't see!\n\n<b>\t\t\t\tWALLACE\n</b>\t\tWhat...the...fuck..are you doing???\n\n<b>\tINT.  GLOBE MOTEL ROOM 44\n</b>\n\tRAILLY is pounding on the bathroom door now as, suddenly, it\n\topens and COLE steps out, the knife in his right hand, dripping\n\twith blood.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOh, my God, James.  Did you kill him?\n\n\tCOLE shakes his head \"no\" as blood oozes from his mouth.\n\n<b>\t\t\t\tCOLE\n</b>\t\tJust...just in case.  In case I'm not\n\t\tcrazy...\n\t\t\t(holds up two bloody molars)\n\t\tThat's how they find us.  By our teeth.\n\t\t\t(a beat, eye contact)\n\t\tI don't want them to find me.  Ever.  I\n\t\tdon't want to go back.\n\n\tRAILLY's astonishment turns to emotion as it dawns on her the\n\tchoice he's made.  Given up the future (if it exists, and it's\n\tlooking like it does)!  Risking his life to be with her!  For\n\tthis brief time!  She's overwhelmed, lips trembling, tears\n\twelling in her eyes.  But just then, the SOUNDS of SHOUTS and\n\tfeet THUNDERING up the stairs snap her back to reality.\n\n<b>\tINT.  STAIRWELL/GLOBE HOTEL\n</b>\n\tCOPS' boots THUNDER up the stairwell.\n\n<b>\tINT.  ROOM 44/GLOBE HOTEL\n</b>\n\tIn between nervous glances toward the door, RAILLY supervises as\n\tCOLE obediently blocks the bathroom door with the bureau.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tPush it tight!\n\n\t\t\t\tWALLACE'S VOICE (from the bathroom)\n<b>\t\tNO PROBLEM!  I'LL JUST STAY IN HERE!\n</b><b>\t\tDON'T WORRY ABOUT ME.\n</b>\n<b>\tINT.  4TH FLOOR HALLWAY/GLOBE HOTEL\n</b>\n\tPOLICE OFFICERS, led by the PLAINCLOTHES COP, make a cautious\n\tentrance onto the 4th floor, guns drawn.\n\n\tSeedy HOTEL RESIDENTS point to Room 44, then cower back into\n\ttheir doorways.\n\n<b>\tEXT.  GLOBE HOTEL FIRE ESCAPE/ALLEY - DAY\n</b>\n\tCOLE and RAILLY clatter down the fire-escape, COLE in the lead.\n\tThey come to the end of the metal stairway.  It's a long distance\n\tto the ground.  COLE jumps down, turns, reaches up to her.\n\n\tShe lets herself down to him.  Their eyes meet.  He holds her in\n\this arms for a moment.  Then, reluctantly, he puts her down.\n\tThey start running down the alley.\n\n<b>\tINT.  GLOBE HOTEL FOURTH FLOOR - DAY\n</b>\n\tThe PLAINCLOTHES COP has his pistol out, his back to the wall\n\talongside the open doorway to Room 44.  The UNIFORMED OFFICERS\n\tare backing him up, weapons drawn.\n\n<b>\t\t\t\tPLAINCLOTHES COP\n</b><b>\t\tPOLICE!  THROW YOUR WEAPONS OUT AND\n</b><b>\t\tCOME OUTTA THERE!\n</b>\n\tNo response.\n\n<b>\tINT.  GLOBE HOTEL ROOM 44\n</b>\n\tThe PLAINCLOTHES COP charges into the room in a crouch, pistol\n\textended in both hands.  He pans the gun around the empty room.\n\n\tHIS POV:  the open window...the blood on the floor.\n\n\t\t\t\tWALLACE'S VOICE (from the bathroom)\n<b>\t\tHEY!  ZAT THE POLICE!  I'M AN INNOCENT\n</b><b>\t\tVICTIM IN HERE!  I WAS ATTACKED BY A\n</b><b>\t\tCOKED-UP WHORE AND A CRAZY DENTIST!\n</b>\n<b>\tEXT.  BUS STOP/DOWNTOWN - LATE AFTERNOON\n</b>\n\tA city bus disgorges a stream of PASSENGERS at a stop in the\n\ttoney downtown shopping district.  Among them, RAILLY looks\n\tfurtively left and right, COLE on her heels.  She's hidden her\n\tbruised eye behind sun glasses; he's holding a bloody\n\thandkerchief to his mouth.\n\n\tAs he steps to the sidewalk, COLE is overwhelmed by the bustling\n\tcity, the tall downtown buildings.  His eyes go up.\n\n\tCOLE'S POV:  a building, towering toward the sky.  A building\n\twith a ledge.  The same ledge the lion prowled in the future!!!\n\n\tANGLE ON COLE, shaken, as RAILLY ushers him into the recessed\n\tentrance to a store.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWait here.  I'm going to try that phone\n\t\tnumber.  Let's hope it's nothing!\n\n\tDazed by his experience and the flow of SHOPPERS, COLE watches\n\ther hurry to a pay phone twenty yards away, his view of her made\n\tintermittent by PEDESTRIANS streaming past him, their FACES\n\tlooming frighteningly close.\n\n\tA BUSINESSMAN jostles COLE, forcing him back against the display\n\twindow.  Turning, he faces the angry jaws of a BEAR only inches away\n\n\tRecovering from a jolt of terror, COLE realizes the BEAR is a life-size\n\ttoy in the display window.  Relieved, he looks back at RAILLY.\n\n\tCOLE'S POV:  RAILLY, well out of earshot, speaking earnestly into\n\tthe phone.\n\n\tANGLE ON COLE, startled, as a BUSINESSMAN, mistaking him for a\n\tpanhandler, shoves a dollar into his hand.  Confused, COLE stares\n\tat the dollar, then turns to say something to the retreating\n\tBUSINESSMAN, but just then he sees RAILLY rushing toward him,\n\teyes sparkling with happiness, LAUGHING, ebullient.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!  James!  It's okay.  We're\n\t\tinsane!  We're crazy!\n\n\tCOLE doesn't know how to respond, but a PASSERBY gives them a look.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt's a Carpet Cleaning Company...\n\n<b>\t\t\t\tCOLE\n</b>\t\tA Carpet Cleaning Company?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(laughing)\n\t\tNo superiors!  No scientists.  No\n\t\tpeople from the future.  It's just a\n\t\tCarpet Cleaning Company.  They have\n\t\tvoice mail -- you leave a message\n\t\ttelling them when you want your carpet\n\t\tcleaned.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou... you left them a message?\n<b>\t\n</b><b>\t\t\t\tRAILLY\n</b>\t\t\t(impishly)\n\t\tI couldn't resist.  I was so relieved.\n\t\tWait'll they hear this nutty woman\n\t\ttelling them...they better watch out\n\t\tfor the Army of the Twelve Monkeys...\n\n\tLooking at her laughing face, COLE is struck with horror as he\n\trealizes the truth!  He starts to recite...\n\n<b>\t\t\t\tCOLE\n</b>\t\t\"The Army of the Twelve Monkeys --\n\t\tthey're the ones who are going to do\n\t\tit.  I can't do anything more.  The\n\t\tpolice are watching me.\"\n\n\tNow she's stunned.  She glances back and sees the phone booth\n\ttwenty yards away.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou... you couldn't have heard me.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThey got your message, Kathryn.  They\n\t\tplayed it for me.  It was a bad\n\t\trecording...distorted.  I didn't\n\t\trecognize your voice.\n\n\tRAILLY'S eyes fill with horror as she grasps the meaning.\n\n\tANGLE ON A UNIFORMED COP, staring out the window of a POLICE\n\tCRUISER as it inches along in the bumper to bumper traffic.\n\tNoticing something, he reaches for his radio.\n\n\tANGLE ON RAILLY, spotting the CRUISER, grabbing COLE, pulling him\n\tinto the CROWD.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tCome on.\n\n<b>\tINT.  DEPARTMENT STORE/MEN'S DEPARTMENT - 6:00 PM\n</b>\n\tRAILLY, whose sun glasses don't really hide her bruised eye, adds\n\ta man's Hawaiian shirt to the pile of other men's things heaped\n\ton a counter in front of a very suspicious CLERK.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAnd this.\n\t\t\t(turning)\n\t\tAnything else?\n\n\tBut COLE'S not here.  He's a short distance away...staring.\n\n\tCOLE'S POV:  aisle after aisle of eager shoppers and a bounty of\n\tbrand new consumer goods.\n\n\tANGLE ON COLE, remembering another department store, dark and\n\tfull of moldering merchandise.\n\n\tANGLE ON RAILLY, turning again to the CLERK.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tI guess that's it.\n\n<b>\t\t\t\tCLERK\n</b>\t\tShall I put this on your account, Ma'am?\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(producing Wallace's roll of bills)\n\t\tNo -- I'll pay cash.\n\n\tThe CLERK stares at the huge roll of bills!\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat floor are the wigs on, please?\n\n<b>\tEXT.  PEST CONTROL VAN - NIGHT\n</b>\n\tSurrounded by stripped and abandoned vehicles, the VAN, with a\n\tPEST CONTROL logo on its side, is parked on a trash-littered\n\tstreet beside the massive pillars of a towering freeway.\n\n<b>\tINT.  PARKED PEST CONTROL VAN\n</b>\n\tThe VAN is packed with SIX ACTIVISTS, SANDY and KWESKIN among\n\tthem, all wearing black.  Some of them have climbing gear, tool\n\tbelts, all sorts of paraphernalia.  KWESKIN is telling his story.\n\n<b>\t\t\t\tKWESKIN\n</b>\t\tSo then he goes into this incredible riff\n\t\tabout how his shrink, like, replicated\n\t\this brain while he was in the nut house.\n\t\tTurned it into a computer.\n\n<b>\t\t\t\tWELLER\n</b>\t\tAnd Fale believed it?\n\n<b>\t\t\t\tKWESKIN\n</b>\t\tOh, you know Fale!  He's like, \"If you\n\t\tguys get nailed -- and I'm sure you will --\n\t\tI never saw you before in nay life!\"\n\n\tLAUGHTER from all of them.  Then, there's a sharp, rhythmic\n\tseries of RAPS on the side door, a signal.\n\n\tPOPE quickly slides the door open.  It's JEFFREY...grinning.\n\n\tThree other activists, GOINES, ICHIOKA, and BRUHNS, stagger out of\n\tthe darkness behind JEFFREY, lugging a huge, squirming GARBAGE BAG.\n\n\tThe van occupants react with murmurs of \"Awwwwwright\" and \"Far\n\tout\", then they help maneuver the writhing bag into the van.\n\n\tThen, JEFFREY and the other three scramble in, too.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tLet's do it!\n\n<b>\tEXT.  VAN/FREEWAY\n</b>\n\tThe PEST CONTROL VAN lumbers up a ramp and onto the freeway.\n\n<b>\tINT.  PEST CONTROL VAN/MOVING\n</b>\n\tThe GARBAGE BAG squirms and grunts as JEFFREY holds a map under a\n\tflashlight and goes over \"the plan\" with the other ACTIVISTS.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tOkay, that's Stage One.  In Stage Two,\n\t\tMonkey Four is over here...\n\n\tA loud GROAN from the bag distracts the others.\n\n<b>\t\t\t\tGOINES\n</b>\t\tWhat's the harm in opening the bag?\n\t\tHis eyes are taped.\n\n<b>\t\t\t\tSANDY\n</b>\t\tYeah, it's cruel leaving him like that.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tAh, but cruelty is his specialty.\n\n<b>\t\t\t\tICHIOKA\n</b>\t\tSo why should we be like him?\n\n\tShrugging cheerfully, JEFFREY tears open the garbage bag revealing\n\tDR. MASON, trussed up, duct tape covering his eyes and mouth.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWant the full effect?\n\n\tGrinning wickedly, JEFFREY rips the tape from his father's mouth.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tJeffrey?  I know it's you, Jeffrey.  I\n\t\trecognize your voice.\n\n\tJEFFREY puts his finger to his lips, silencing everyone.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tJEFFREY???  ... Very well.  You're out\n\t\tof your mind, Jeffrey.  I know all\n\t\tabout your insane plan.  That woman --\n\t\tyour psychiatrist -- she told me.\n\n\tJEFFREY raises his eyebrows.  This he hadn't expected.\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tI didn't believe her -- it seemed too crazy\n\t\teven for you.  But, just in case, I took steps\n\t\tto make sure you couldn't do it.  I took myself\n\t\tout of the loop!  I don't have the code any\n\t\tmore.  I don't have access to the virus.  So,\n\t\tgo ahead -- torture me, but you can't extract\n\t\tanything of use to yourself.\n\n\tThe ACTIVISTS are all exchanging puzzled looks.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhat...virus?\n\n<b>\t\t\t\tDR. MASON\n</b>\t\t\t(spins his head toward Jeffrey)\n\t\tShe knew about it, Jeffrey.  She knew\n\t\tyou were going to try this.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tWhat virus are we talking about, Dad?\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tYou're insane, Jeffrey.\n\n<b>\t\t\t\tJEFFREY\n</b>\t\tYou \"develop\" viruses and you're calling\n\t\tme insane?  Typical.  What does this\n\t\tvirus attack?  Don't tell me, you sick\n\t\tfuck, it doesn't matter.\n\t\t\t(to the others)\n\t\tHave I ever \"developed\" a virus?  Do I\n\t\tput helpless animals in cages and measure\n\t\ttheir reactions to electrical stimuli?\n\t\tDo I inject radioactive substances into\n\t\tliving creatures and examine their\n\t\tbowel movements?  Wow!  And I'm crazy!\n\n<b>\t\t\t\tDR. MASON\n</b>\t\tPlease tell me, Jeffrey, what exactly\n\t\tare you going to do?  I don't have to\n\t\ttell you I'm afraid.\n\n<b>\t\t\t\tJEFFREY\n</b><b>\t\tTHIS IS A FUCKING EXPERIMENT!  YOU'RE\n</b><b>\t\tOUR HELPLESS LITTLE TEST ANIMAL, DADDY.\n</b><b>\t\tGOT THAT?  NOW -- WHAT FUCKING VIRUS\n</b><b>\t\tHAVE YOU COME UP WITH, YOU DEMENTED\n</b><b>\t\tFUCKING MANIAC?\n</b>\n<b>\tINT.  MOVIE SCREEN/THEATER - NIGHT\n</b>\n\tSpooky BERNARD HERRMAN MUSIC, giant redwoods looming skyward.\n\tIt's DAYTIME in Muir Woods.  SCOTTY (JAMES STEWART) AND MADELINE\n\t(KIM NOVAK) walk toward a display of a cross cut section of a\n\tredwood tree.  We're watching Hitchcock's VERTIGO.\n\n\t\t\t\tSCOTTY (up on the screen)\n\t\tHere's a cross section of one of the\n\t\told trees that's been cut down.\n\n\tThey look at the lines of the tree marked with cards that say,\n<b>\t\"BIRTH OF CHRIST\", \"DISCOVERY OF AMERICA\", \"MAGNA CARTA SIGNED\",\n</b>\t\"1066 - BATTLE OF HASTINGS\", and \"1930 TREE CUT DOWN\".\n\n\tANGLE ON THE THEATER AUDIENCE, empty seats dimly visible in the\n\tflickering light, a few shadowy MOVIEGOERS scattered here and there.\n\n\tANGLE ON THE SCREEN, MADELINE pointing, saying with profound melancholy.\n\n\t\t\t\tMADELINE (up on the screen)\n\t\tSomewhere in here I was born.  And here\n\t\t-- I die.  There's only a moment for\n\t\tyou.  You don't notice.\n\n\tANGLE ON THE AUDIENCE, a shadowy COUPLE near the back of the\n\ttheater.  WE CAN'T REALLY SEE THEM, but we recognize their VOICES\n\n<b>\t\t\t\tRAILLY\n</b>\t\tHere, let me help you.\n\n\tThe theater is briefly illuminated by a very bright scene on the\n\tscreen, revealing enough of COLE and RAILLY for us to see she's\n\tdoing something to his upper lip while he tries to watch the movie.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI think I've seen this movie before.\n\t\tWhen I was a kid.  It was on TV.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(fussing with his upper lip)\n\t\tShh -- don't talk.  Hold still.\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(moving his head to see the film)\n\t\tI have seen it, but I don't remember\n\t\tthis part.  Funny, it's like what's\n\t\thappening to us, like the past.  The\n\t\tmovie never changes -- it can't change\n\t\t-- but everytime you see it, it seems\n\t\tto be different because you're different\n\t\t-- you notice different things.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIf we can't change anything...because\n\t\tit's already happened, then we ought to\n\t\tat least smell the flowers.\n\n<b>\t\t\t\tCOLE\n</b>\t\tFlowers!  What flowers?\n\n\tFrom the darkness, a MOVIE PATRON makes a SSSSHHHHH shound.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(whispering)\n\t\tIt's an expression.  Here...\n\n\tShe's pulling something from a shopping bag at her feet, placing\n\tit on COLE'S head, adjusting it...\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhy are we doing this?\n\n<b>\t\t\t\tRAILLY\n</b>\t\tSo we can stick our heads out the\n\t\twindow and feel the wind and listen to\n\t\tthe music.  So we can appreciate what\n\t\twe have while we have it.  Forgive me,\n\t\tpsychiatrists don't cry.\n\n\tThere are tears in her eyes.  They discomfit COLE.\n\n<b>\t\t\t\tCOLE\n</b>\t\tBut maybe I'm wrong.  Maybe you're\n\t\twrong.  Maybe we're both crazy.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIn a few weeks, it will have started or\n\t\tit won't.  If there are still baseball\n\t\tgames and traffic jams, armed robberies\n\t\tand boring TV shows -- we'll be so\n\t\thappy, we'll be glad to turn ourselves\n\t\tin to the police.\n\n<b>\t\t\t\tSHADOWY MOVIEGOER\n</b><b>\t\tSHHHHHHH    \n</b>\n<b>\t\t\t\tCOLE\n</b>\t\t\t(whispers)\n\t\tWhere can we hide for a few weeks?\n\n\tANGLE ON THE SCREEN, where SCOTTY and MADELINE are in the foreground,\n\tthe OCEAN behind them.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tYou said you'd never seen the ocean...\n\n<b>\tEXT.  GORILLA'S PEN/ZOO - NIGHT\n</b>\n\tCLOSE ON A GORILLA, by moonlight, angry, a true nightmare vision.\n\n\tURGENT WHISPERS off screen, RUSTLING SOUNDS.  Then, METAL ON METAL.\n\tOnly now are we aware that the GORILLA is in an outdoor zoo pen\n\twith phony rocks.  Stalking back and forth.  Huge.  Upset.\n\n\tCLANK.  CLANK.  METAL ON METAL.  GRUNTS of effort, then, DR.\n\tMASON'S VOICE, plaintive, frightened.\n\n\t\t\t\tDR. MASON'S VOICE (o.s.)\n\t\tWhat are you doing to me?  Where are\n\t\twe?  Jeffrey, please...\n\n\t\t\t\tSANDY'S VOICE (o.s.)\n\t\tFor God's sake, put the tape back on\n\t\this mouth!\n\n\tThe GORILLA bellows angrily, beating his chest.\n\n\t\t\t\tJEFFREY'S VOICE (o.s.)\n\t\tForget the tape.  The monkey's louder than\n\t\the is.  You gonna tape the monkey's mouth?\n\n<b>\tEXT.  PANTHERS' PEN/ZOO - NIGHT\n</b>\n\tUnder the full moon, PANTHERS pace back and forth, back and\n\tforth, uttering ominous guttural SNARLS.\n\n<b>\tEXT.  LION'S PEN/ZOO\n</b>\n\tThe KING OF BEASTS gives a deep, fierce ROAR.  From the darkness,\n\tunseen ELEPHANTS TRUMPET their response.\n\n<b>\tEXT.  AVIARIES/ZOO\n</b>\n\tA PANDEMONIUM of WINGS RUSTLING, the sharp metallic CLINKING of\n\tmetal on metal, the MUTTER of HUMAN VOICES, then a cacophonous\n\tCRESCENDO of frenzied SCREECHING as PARROTS, COCKATOOS and other\n\tEXOTIC BIRDS careen madly in their cages.\n\n<b>\tINT.  MOVIE THEATER AUDITORIUM\n</b>\n\tCLOSE ON COLE, dozing fitfully, as the SOUNDS of SCREAMING BIRDS\n\tcontinue.  Suddenly, he comes awake with a start...sees the movie\n\tfilling his field of vision.\n\n\tHIS POV:  the MOVIE SCREEN.  TIPPI HEDRIN, overwhelmed by\n\tscreeching BIRDS in an attic in Hitchcock's THE BIRDS.\n\n\tANGLE ON COLE, orienting himself, looking around.  Empty seats on\n\tboth sides of him.  He's alone.  He panics.\n\n<b>\t\t\t\tCOLE\n</b>\t\tKathryn?!\n\n<b>\tINT.  THEATER LOBBY\n</b>\n\tA lobby poster boasts \"Classics 24 Hours A Day\" and \"Hitchcock\n\tFestival\".  PANNING OFF the poster, passing a SNORING USHER, dead\n\tto the world in an old velvet chair, WE DISCOVER a BRUNETTE in a\n\ttight dress, just hanging up the lobby pay phone.  Turning, she\n\treveals heavy make-up, gaudy costume jewelry, and sun glasses.\n\tShe's the BRUNETTE in COLE'S DREAM!  Crossing the lobby toward\n\tthe auditorium, it's a pleasure to watch her nice body undulate\n\tin the tight dress.\n\n\tJust then, the auditorium doors burst open and a BLONDE MAN in a\n\tHawaiian shirt appears, the man from COLE'S DREAM, except this\n\tman's moustache is fixed firmly on his upper lip.  The BLONDE MAN\n\tstops, stunned at the sight of the BRUNETTE.\n\n<b>\t\t\t\tBRUNETTE\n</b>\t\tWe're booked on a 9:30 flight to Key West.\n\n\tThe Brunette is RAILLY, no longer the frazzled professional,\n\trevealed now by her disguise as a sexy babe.  The Blonde Man is\n\tCOLE!  He's confused.\n\n<b>\t\t\t\tCOLE\n</b>\t\tYou were in my dream just now.  I\n\t\tdidn't recognize you.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWell, you look pretty different, too.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI mean in my dream -- I didn't realize\n\t\tit was you.  Then...I woke up and I...I\n\t\tthought you were gone.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(studies him seriously)\n\t\tI remember you...like this.  I feel\n\t\tI've known you before.  I feel I've\n\t\talways known you.\n\n\tTheir eyes lock.  Suddenly, she backs up, gently maneuvering him\n\twith her, past the sleeping USHER, to and through an unlocked,\n\tunmarked door, then closing it behind them.\n\n<b>\tINT.  STORAGE ROOM/MOVIE THEATER\n</b>\n\tRAILLY and COLE are in a dimly lit cluttered storage room.  She\n\tkisses him hungrily amid the brooms, plastic trash barrels, other\n\tjanitorial items.  COLE responds to her passion as they move\n\tdeeper into the room, its walls covered with old movie posters.\n\tTearing at each other's clothes, they collapse on a rolled\n\ttheater curtain among stacks of ancient theater seats.\n\n<b>\tEXT.  SUBURBS - DAWN\n</b>\n\tThe red rim of the rising sun is just becoming visible beyond the\n\tsilhouetted roofs of an upper middle-class suburban neighborhood.\n\tThe early light is so vague that when a huge SIBERIAN TIGER pads\n\tacross a neatly-trimmed lawn, he's more a shadowy vision than\n\treality.  Did we really see him at all?\n\n<b>\tEXT.  CONSTRUCTION SITE - DAWN\n</b>\n\tThe rising sun flares behind the towering silhouette of an unfinished\n\tbuilding, deserted in the early morning light.  High up, a MONKEY\n\this head around a girder.\n\n\tFour stories below, other MONKEYS are climbing.\n\n<b>\tEXT.  SHOPPING MALL - DAWN\n</b>\n\tDeserted in the first light of dawn, the stores face each other\n\tacross a broad promenade with blank staring windows.\n\n\tNothing happens.  For a long moment.  Then, an AFRICAN BULL\n\tELEPHANT appears, turning the corner, lumbering toward us along\n\tthe promenade, raising his trunk to TRUMPET triumphantly to the\n\tother ELEPHANTS trotting into view behind him.\n\n<b>\tINT.  TAXICAB/CITY STREETS - EARLY MORNING\n</b>\n\tA fiftyish WOMAN CABBIE with white hair and a Southern twang is\n\tat the wheel of the cab.\n\n\t\t\t\tWOMAN CABBlE\n\t\tWhat time's your flight, friends?\n\n\tIn the back seat, COLE, in the blonde wig and moustache, looks to\n\this companion, the sexy babe in sun glasses and heavy make-up, RAILLY.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tNine thirty\n\n<b>\t\t\t\tWOMAN CABBIE\n</b>\t\tMight be tight.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(startled, checks her watch)\n\t\tTight?  My watch says 7:30.\n\n<b>\t\t\t\tWOMAN CABBIE\n</b>\t\tOn your normal mornin', okay, plenty a\n\t\ttime, but today, gotta take inta account\n\t\tyour Army-of-the-Twelve-Monkeys factor.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tWhat?  What did you say?\n\n<b>\t\t\t\tWOMAN CABBIE\n</b>\t\tTwelve Monkeys, honey.  Guess you folks\n\t\tdidn't turn on your radio this morning.\n\n\tCOLE and RAILLY exchange a quick look.\n\n<b>\t\t\t\tWOMAN CABBIE\n</b>\t\tBunch a weirdoes let all the animals outta\n\t\tthe zoo last night.  Then they locked up\n\t\tthis big shot scientist in one of the cages.\n\t\tScientist's own kid was one a the ones did it!\n\n\tRAILLY and COLE stare at the cabbie, stunned.\n\n\t\t\t\tWOMAN CABBlE\n\t\tNow they got animals all over the\n\t\tplace.  Buncha zebras shut down the\n\t\tthruway 'bout an hour ago and some\n\t\tkinda thing called an \"e-mu\" it's got\n\t\ttraffic blocked for miles over on 22.\n\n\tFlabbergasted, RAILLY'S eyes suddenly fill with hope.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThat's what they were up to!  Freeing\n\t\tanimals!\n\n<b>\t\t\t\tCOLE\n</b>\t\tOn the walls -- they meant the animals\n\t\twhen they said, \"We did it.\"\n\n<b>\t\t\t\tWOMAN CABBIE\n</b>\t\tYou can hear it on the radio all the\n\t\tstations...\n\n\tAs the WOMAN CAEBIE switches on the RADIO, RA:LLY points and COLE\n\tfollows her look.\n\n\tCOLE'S POV:  two CHEETAHS, sleek and magnificent against the\n\tcityscape, streaking past the cab at ninety mph!\n\n\t\t\t\tANNOUNCER/RADIO (o.s.)\n\t\tIn the meantime, numerous animal rights\n\t\tactivists have joined the chorus\n\t\tcondemning what they're calling the\n\t\t\"loose canon\" activities of Jeffrey\n\t\tMason and his Army of the Twelve\n\t\tMonkeys.\n\t\t\t\tRIGHTS ACTIVIST/RADIO (o.s.)\n\t\tCan these fools seriously believe that\n\t\treleasing a captive animal into an\n\t\turban environment is being compassionate\n\t\tto the animal?  It's mindlessly cruel,\n\t\talmost as indefensible as holding the\n\t\tanimal in captivity in the first place.\n\n\tRAILLY and COLE are watching FLAMINGOS cross the sky against a\n\tbackdrop of skyscrapers in silhouette.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tMaybe it's going to be okay.\n\n<b>\tINT.  TICKET COUNTER/AIRPORT TERMINAL - MORNING\n</b>\n\tCLOSY ON copies of the mug shot of COLE and a photo of RAILLY\n\twhile the airport P.A. SYSTEM DRONES in the b.g..\n\n\tREVEAL a DETECTIVE, giving the flyers to the uniformed SUPERVISOR\n\tat one end of the ticket counter.\n\n<b>\t\t\t\tDETECTIVE\n</b>\t\tTell your people if they spot either\n\t\tone of them, not to try and apprehend\n\t\tthen.  They should notify us and...\n\n\tANGLE ON RAILLY AND COLE, thirty yards away, entering the terminal.\n\n<b>\t\t\t\tP.A. SYSTEM\n</b>\t\t-- Flight 531 for Chicago is now ready\n\t\tfor boarding at Gate Seventeen.\n\n\tANGLE ON COLE, reacting to the P.A., stopping, seeing the\n\tbustling airport lobby.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI know this place! ... This is my dream.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tAirports all look the same.  Maybe\n\t\tit's...\n\t\t\t(turning, reacting)\n\t\tJames!  Your moustache!  It's slipping.\n\n\tBut COLE isn't listening.  He's looking around, mesmerized.\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt's not just my dream.  I was actually\n\t\there!  I remember now.  My parents\n\t\tbrought me to meet my uncle.  About a\n\t\tweek or two before...before...before\n\t\teverybody started dying.\n\n\tRAILLY glances around nervously.\n\n\tRAILLY'S POV:  two UNIFORMED POLICEMEN, strolling through the\n\tlobby, their eyes scanning the faces of TRAVELERS.\n\n\tANGLE ON RAILLY, pulling a small tube from her purse.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tThey may be looking for us, James.\n\t\t\t(placing the tube in his hand)\n\t\tUse this.  You can fix it in the Men's Room.\n<b>  \n</b><b>\t\t\t\tCOLE\n</b>\t\t\t(confounded)\n\t\tI was here...as a kid.  I think you\n\t\twere here, too.  But you...looked just\n\t\tlike you look now.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(getting desperate)\n\t\tJames, if we're identified, they're\n\t\tgoing to send us someplace...but not to\n\t\tKey West!\n\n<b>\t\t\t\tCOLE\n</b>\t\t\t(snaps out of it, hand to moustache)\n\t\tRight!  You're right.  I have to fix this.\n\n<b>\t\t\t\tRAILLY\n</b>\t\t\t(indicating a sign)\n\t\tI'll get the tickets and meet you... in\n\t\tthe Gift Shop.\n\n\tCOLE follows her look, nods, then heads for the Men's Room as\n\tRAILLY, in sun glasses, gaudy outfit, high heels, starts clip\n\tclopping toward the ticket counter, her ass attracting admiring\n\tglances.\n\n<b>\tINT.  TELEPHONES/LOBBY - DAY\n</b>\n\tBUSINESS TRAVELERS huddle over pay phones, talking earnestly, as\n\tCOLE walks past on his way to the Men's Room.\n\n\tSeeing an unoccupied phone, COLE hesitates, considers it.  Coming\n\tto a decision, he reaches into his pocket, pulls out some change.\n\n<b>\tINT.  TZCKET COUNTER/TERMINAL\n</b>\n\tCLOSE ON the flyer of COLE and RAILLY taped under the counter,\n\thidden from the customers, but in clear view of the TICKET AGENT\n\twho has just finished serving a PORTLY GENTLEMAN.  The GENTLEMAN\n\twalks away.\n\n\tANGLE ON RAILLY, stepping up to the counter, smiling, looking\n\tnothing like the Railly on the flyer.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJudy Simmons.  I have reservations for\n\t\tKey West.\n\n<b>\tINT.  PAY PHONES/TERMINAL\n</b>\n\tCOLE is speaking into the phone very low, very private, very intense.\n\n<b>\t\t\t\tCOLE\n</b>\t\tListen, I don't know whether you're\n\t\tthere or not.  Maybe you just clean\n\t\tcarpets.  If you do, you're lucky --\n\t\tyou're gonna live a long, happy life.\n\t\tBut if you other guys exist and you're\n\t\tpicking this up -- forget about the\n\t\tArmy of The Twelve Monkeys -- they\n\t\tdidn't do it.  It was a mistake'\n\t\tSomeone else did it.  The Army of The\n\t\tTwelve Monkeys are just dumb kids\n\t\tplaying revolutionaries.  It was\n\t\tsomeone else!\n\n\tCOLE looks around nervously, catches a BUSINESSMAN at the next\n\tphone looking away quickly.  COLE touches his loose moustache as\n\the averts his face and speaks into the phone in an urgent whisper.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI've done my job.  I did what you wanted.\n\t\tGood luck.  I'm not coming back!\n\n\tCOLE hangs up the phone, looks around, catches a few stares.\n\tAverting his face, he heads for the Men's Room.\n\n<b>\tINT.  TICKET COUNTER - DAY\n</b>\n\tThe TICKET AGENT is counting out a stack of bills.\n\n<b>\t\t\t\tTICKET AGENT\n</b>\t\tDon't see a lot of this... cash.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tIt's...a long story.\n\n<b>\t\t\t\tTICKET AGENT\n</b>\t\t\t(smiles, hands over the tickets)\n\t\tThey'll begin boarding in about twenty\n\t\tminutes.  Have a nice flight, Mrs. Simmons.\n\n\tTurning to go, RAILLY fumbles the tickets while trying to put\n\tthem in her purse and they flutter to the floor.  As she kneels\n\tto retrieve them, WE SEE the long line of waiting TRAVELERS from\n\tthe waist down.  WE SEE a familiar Chicago Bulls Sports Bag\n\tresting on the floor beside sneakers and gaudy baggy pants.\n\twe've seen this outfit before...in COLE'S dream...on MR. PONYTAIL!\n\n<b>\tINT.  MEN'S ROOM/AIRPORT - DAY\n</b>\n\tThe P.A. DRONES as CCLE, head down, lingers at a sink, washing\n\tand rewashing his hands while another TRAVELER finishes drying\n\this hands, gives COLE a quizzical look, then leaves.\n\n\tQuickly, COLE glances around, checks the seemingly empty Men's\n\tRoom, then takes the tube of adhesive from his pocket, puts some\n\tgoop under the loose edge of his moustache and presses it firmly\n\tagainst his face as he leans close to the mirror.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tGot yourself a prob, Bob?\n\n\tCOLE whirls, looks for the source of the VOICE.  Nothing!  Until\n\the spots shoes peeking from dropped trousers indicating an\n\toccupied stall.  It must be him!\n\n<b>\t\t\t\tCOLE\n</b>\t\tLeave me alone!  I made a report.  I\n\t\tdidn't have to do that.\n\n\t\t\t\tRASPY VOICE (o.s.)\n\t\tPoint of fact -- you don't belong here.\n\t\tIt's not permitted to let you stay.\n\n\tA toilet FLUSHES in the \"occupied\" stall.  COLE'S answer is loud\n\tand defiant.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThis is the present.  This is not the past.\n\t\tThis is not the future.  This is right now!\n\n\tA PLUMP BUSINESSMAN emerges from the \"occupied\" stall, gives COLE\n\ta wary look and a wide berth as he heads for a sink.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI'm staying here! You got that?  You\n\t\tcan't stop me!\n\n<b>\t\t\t\tPLUMP MAN\n</b>\t\t\t(high pitched voice)\n\t\tAnything you say, chief.  It's none of\n\t\tmy business.\n\n\tCOLE looks dismayed.  This guy couldn't be \"THE VOICE\"!  And there\n\tare no feet showing under the other stalls.  Did he imagine it?\n\n<b>\tINT.  TICKET COUNTER - DAY\n</b>\n\tThe Chicago Bulls bag!  It's on the counter in front of the\n\tTICKET AGENT who's reviewing a stack of tickets in awe...\n\n<b>\t\t\t\tTICKET AGENT\n</b>\t\tWoooo-eeee.  San Francisco, New\n\t\tOrleans, Rio de Janeiro, Rome,\n\t\tKinshasa, Karachi, Bangkok, Peking!\n\t\tThat's some trip you're taking, sir,\n\t\tAll in one week!\n\n\t\t\t\tMR. PONYTAIL (o.s.)\n\t\tBusiness.\n\n<b>\t\t\t\tTICKET AGENT\n</b>\t\t\t(handing over the tickets)\n\t\tHave a good one, sir.\n\n<b>\tINT.  TERMINAL LOBBY\n</b>\n\tCOLE emerges from the Men's Room, shaken, paranoid.  He glances\n\taround nervously.  Then, keeping his head down, he starts walking\n\ttoward the Gift Shop.  Before he gets more than a few steps,\n\tsomeone suddenly grabs his shoulder from behind.\n\n\t\t\t\tFAMILIAR VOICE (o.s.)\n\t\tYou gotta be crazy, man!\n\n\tCOLE whirls, finds himself facing a Puerto Rican youth in an L.A.\n\tRaiders jacket, a sideways baseball cap, and mirrored sun glasses\n\n<b>\t\t\t\tCOLE\n</b>\t\tJo...Jose????\n\n<b>\t\t\t\tJOSE\n</b>\t\tPulling out the tooth, man, that was\n\t\tnuts!  Here, take this.\n\n\tJOSE tries to slip COLE a 9mm pistol.  Astonished, COLE resists!\n\n<b>\t\t\t\tCOLE\n</b>\t\tWhat?  What for?  Are you crazy?\n\n\tFrustrated, JOSE conceals the gun but keeps a grip on COLE'S arm.\n\n<b>\t\t\t\tJOSE\n</b>\t\tMe?  Are you kiddin?  You're the one!\n\t\tYou were a hero, man.  They gave you a\n\t\tpardon!  And whadda you do?  You come\n\t\tback and fuck with your teeth!  Wow!\n\n<b>\t\t\t\tCOLE\n</b>\t\tHow did you find me?\n\n<b>\t\t\t\tJOSE\n</b>\t\tThe phone call, man.  The phone call.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThe call I just made?  Five minutes ago?\n\n<b>\t\t\t\tJOSE\n</b>\t\tHey, five minutes ago, thirty years ago!\n\t\tYes, that phone call.  I been in training\n\t\tfor this a couple a months now -- ever\n\t\tsince I got back from that... \"weird\"\n\t\twar we were in.  You remember that?\n\t\t\t(pressing the pistol on Cole)\n\t\tHere, take it, man!  You could still be\n\t\ta hero if you'd cooperate!\n\n<b>\tINT.  GIFT SHOP/TERMINAL - DAY\n</b>\n\tRAILLY takes a travel book on Key West from a rack, considers it,\n\tincludes it with several magazines she's holding.  She doesn't\n\tnotice MR. PONYTAZL enter the Gift Shop behind her!\n\n\tThe P.A. System DRONES flight info as RAILLY checks her watch and\n\tfrowns.  It's getting late and where's Cole?  She turns, heads\n\tfor the cash register to make her purchases.\n\n\tMR. PONYTAIL, seen from behind, is at the cash register already.\n\tHe sets a newspaper on the counter and searches for change.\n\n\tThe paper features a banner headline...\"ANIMALS SET FREE\" and a\n\tsub head...\"PROMINENT SCIENTIST FOUND LOCKED IN GORILLA CAGE\"\n\tover a photo of DR. MASON being released from the cage and\n\tanother photo of a GORILLA perched atop a parked car.\n\n\tStepping in line behind MR. PONYTAIL, RAILLY checks her watch\n\tagain. Then, MR. PONYTAIL, having paid, turns to go and RAILLY\n\tlooks up and sees his face. though it is not visible to us.\n\n\tStartled, RAILLY frowns.  Does she know this man?\n\n\tMR. PONYTAIL pauses for a moment, considering the babe in the\n\tshades, gaudy earrings, the tight skirt, and high heels.\n\n\tRAILLY doesn't recognize the man, but we do!  He's DR. MASON'S\n\tASSISTANT, DR. PETERS...the man who attended RAILLY's lecture!\n\n\tSmiling, DR. PETERS steps around RAILLY and exits the Gift Shop.\n\n\tStill puzzled, RAILLY puts her purchases on the counter and the\n\tCLERK starts ringing them up as a DELIVERY MAN comes in and drops\n\ta bundle of newspapers at her feet.\n\n\tRAILLY'S POV:  the front page shows a photo of three frightened\n\tGIRAFFES in freeway gridlock under a headline proclaiming, \"TERRORISTS\n\tCREATE CHAOS\".  Further down are two more photos...DR. MASON in the\n\tgorilla cage and a file photo of DR. MASON in his lab.\n\n\tCLOSE ON THE SHOT OF DR. MASON in his lab.  There's someone else\n\tin the picture.  It's a man wearing a lab coat and a PONYTAIL!\n\n\tANGLE ON RAILLY, reacting, suddenly remembering!\n\n<b>\tMEMORY FLASHBACK!  INT.  RECEPTION ROOM/BREITROSE HALL - NIGHT\n</b>\n\tRAILLY looks up from the book she's signing and sees DR. PETERS.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tIsn't it obvious that \"Chicken Little\"\n\t\trepresents the sane vision and that\n\t\tHomo Sapiens' motto, \"Let's go shopping!\"\n\t\tis the cry of the true lunatic?\n\n<b>\tINT.  GIFT SHOP - DAY\n</b>\n\tRAILLY, stunned, stares in the direction PETERS/PONYTAIL went.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOh, my God!\n\n<b>\t\t\t\tP.A  SYSTEM\n</b>\t\t-- flight 764 for San Francisco is now\n\t\tready for boarding at Gate 36.\n\n<b>\tINT.  LOBBY - DAY\n</b>\n\tIn the confusion of TRAVELERS streaming in different directions,\n\tCOLE hurries toward the Gift Shop while JOSE struggles to keep up.\n\n<b>\t\t\t\tJOSE\n</b>\t\tComa on, Cole, don't be an asshole.\n\t\t\t(then, blurting it out)\n\t\tLook, I got orders, man!  You know what\n\t\tI'm sposed to do if you don't go along?\n\t\tI'm sposed to shoot the lady!  You got\n\t\tthat?  They said, \"If Cole don't obey\n\t\tthis time, Garcia, you gotta shoot his\n\t\tgirlfriend!\"\n\n\tCOLE stops in his tracks, blown away, too stunned to speak.\n\n<b>\t\t\t\tJOSE\n</b>\t\tI got no choice, man.  These are my\n\t\torders.  Just take it, okay?\n\n\tCOLE accepts the gun this time, resigned now.  They've got him.\n\n<b>\t\t\t\tCOLE\n</b>\t\tThis part isn't about the virus, is it?\n\n<b>\t\t\t\tJOSE\n</b>\t\tHey, man...\n\n<b>\t\t\t\tCOLE\n</b>\t\tIt's about obeying, about doing what\n\t\tyou're told.\n\n<b>\t\t\t\tJOSE\n</b>\t\tThey gave you a pardon, man.  Whatdaya\n\t\twant?\n\n<b>\t\t\t\tCOLE\n</b>\t\tWho am I supposed to shoot?\n\n\tJust then, RAILLY rushes up to COLE, not even noticing JOSE.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tJames!  Thank God!  I thought you'd\n\t\tdisappeared.  Listen, I think I know\n\t\twho it is!  I saw him!  It's Dr. Mason's\n\t\tassistant.  An apocalypse nut!  The next\n\t\tflight to San Francisco leaves from Gate 38.\n\t\tIf he's there, it has to be him.\n\n\tJOSE, having heard this, steps back into the crowd as RAILLY\n\tgrabs COLE and pulls him toward the Security Check Points.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI love you, Kathryn.  Remember that.\n\n\tShe doesn't hear him or see the look of doom in his eyes.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tMaybe we can stop him.  Maybe we can\n\t\tactually do something.\n\n<b>\tINT.  SECURITY CHECK POINT/TERMINAL - DAY\n</b>\n\tA young boy of nine passes through the magnetic arch grinning.\n\tYOUNG COLE!  Exactly as he appears in the dream!\n\n\tHe joins his PARENTS, who are only visible from their chests\n\tdown, and they continue along the concourse.  WE LINGER and\n\tDISCOVER two DETECTIVES watching TRAVELERS as they pass through\n\tthe magnetic arch and retrieve their bags from the X-ray machine,\n\tcomparing their faces to photos of COLE and RAILLY.\n\n\tANGLE ON A SECURITY OFFICER, watching the x-ray monitor.\n\n\tANGLE ON THE MONITOR, showing the X-RAY IMAGE of a sports bag moving\n\talong the conveyer belt.  The bag contains some strange objects.\n\n\tANGLE ON THE SECURITY OFFICER, reacting.\n\n<b>\t\t\t\tSECURITY OFFICER\n</b>\t\tExcuse me, sir.  Would you mind letting me\n\t\thave a look at the contents of your bag?\n\n\tANGLE ON DR. PETERS, coming through the magnetic arch, reacting.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tMe?  Oh, yes, of course.  My samples.\n\t\tI have the appropriate papers.\n\n<b>\tINT.  END OF LINE/SECURITY CHECK POINT\n</b>\n\tRAILLY AND COLE arrive at the very long suddenly stalled line of\n\tTRAVELERS waiting to pass through security.\n\n<b>\t\t\t\tRAILLY\n</b>\t\tOh, God, we don't have time for this.\n\n\tANGLE ON THE SECURITY CHECK POINT, where DR. PETERS unpacks his\n\tBulls bag, pulls out six metal cylinders along with a change of\n\tclothes and a Walkman.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tBiological samples.  I have the\n\t\tpaperwork right here.\n\n\tDR. PETERS produces a sheaf of official papers while the SECURITY\n\tOFFICER examines one of the tubes, turning it over in his hands.\n\n<b>\t\t\t\tSECURITY OFFICER\n</b>\t\tI'm going to have to ask you to open\n\t\tthis, sir.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tOpen it?\n\t\t\t(blinks stupidly, then)\n\t\tOf course.\n\n\tDR. PETERS takes the metal cylinder and starts opening it.\n\n\tThere's a SOUND of VOICES RAISED behind them.  DR. PETERS pays no\n\tattention, but the SECURITY OFFICER turns toward the NOISE.\n\n\tSECURITY OFFICER'S POV:  RAILLY, trying to explain something to a\n<b>\tSECOND SECURITY OFFICER.\n</b>\n\tANGLE ON THE TWO DETECTIVES, nearby, showing interest in the\n\tcommotion.\n\n\tANGLE ON DR. PETERS, oblivious to the fuss, pulling a closed\n\tglass tube out of the metal cylinder.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tHere!  You see?  Biological!  Check the\n\t\tpapers -- it's all proper.  I have a\n\t\tpermit.\n\n<b>\t\t\t\tSECURITY OFFICER\n</b>\t\tIt's empty!\n\n\tIndeed, it looks like a sealed clear glass tube with nothing in it.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tWell, yes, to be sure, it looks empty!\n\t\tBut I assure you, it's not.\n\n\tANGLE ON RAILLY, at the end of the line, arguing with the SECOND\n<b>\tSECURITY OFFICER.\n</b>\n<b>\t\t\t\tRAILLY\n</b>\t\tPlease listen to me -- this is very urgent!\n\n<b>\t\t\t\tSECOND SECURITY OFFICER\n</b>\t\tYou'll have to get in line, ma'am.\n\n<b>\t\t\t\tTRAVELER\n</b>\t\tWe're all in a hurry, lady.  What's so\n\t\tspecial about you?\n\n\tANGLE ON DR. PETERS, producing the glass tubes from the other\n\tmetal cylinders as the SECURITY OFFICER examines the papers.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tYou see!  Also invisible to the naked eye.\n\n\tA beat.  OR. PETERS grins suddenly, opens one of the glass tubes,\n\tand waves it under the SECURITY OFFICER'S nose!\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tIt doesn't even have an odor.\n\n\tThe SECURITY OFFICER glances up, sees what DR. PETERS is doing,\n\tand smiles as he hands the papers back to the scientist.\n\n<b>\t\t\t\tSECURITY OFFICER\n</b>\t\tThat's not necessary, sir.  Here you\n\t\tgo.  Thanks for your cooperation.  Have\n\t\ta good flight.\n\n\tHastily, DR. PETERS snatches up all the tubes and cylinders and\n\tshoves them back into his gym bag.\n\n\tANGLE ON RAILLY, raging as the SECOND SECURITY OFFICER jabs her\n\twith his finger.\n\n<b>\t\t\t\tSECOND SECURITY OFFICER\n</b>\t\tWho are you calling a \"moron\"?\n\n<b>\t\t\t\tCOLE\n</b>\t\tGet your hands off her!\n\n\tThe SECOND SECURITY OFFICER stiffens for trouble.\n\n\tANGLE ON THE DETECTIVES, watching the fuss, ready to get\n\tinvolved.  Suddenly, the FIRST DETECTIVE frowns.\n\n\tFIRST DETECTIVE9S POV:  COLE'S moustache is slipping.  COLE\n\tsenses it, reaches up to touch it, catches the DETECTIVE'S look.\n\tFor half a second their eyes meet, then COLE looks away.\n\n\tANGLE ON DR. PETERS, hurrying away.\n\n\t\t\t\tSECURITY OFFICER'S VOICE (o.s.}\n<b>\t\tHOLD IT!  JUST A MOMENT.\n</b>\n\tDR. PETERS freezes, turns, ashen.\n\n\tThe SECURITY OFFICER is retrieving a pair of jockey shorts from\n\tthe floor beside the search table.  He waves them at DR. PETERS.\n\n\tDR. PETERS hurries back for his underpants.\n\n\tANGLE ON COLE, trying to keep his head turned away as he\n\tconfronts the SECURITY OFFICER.\n\n<b>\t\t\t\tCOLE\n</b>\t\tI said, get your hands off her.  She's\n\t\tnot a criminal.  She's a doctor...a\n\t\tpsychiatrist.\n\n\tRAILLY looks alarmed at that.\n\n\tANGLE ON THE DETECTIVES, coming this way.  The FIRST DETECTIVE\n\thas the photos in his hand.\n\n\tANGLE OW DR. PETERS, bagging his jockey shorts, then starting\n\thastily down the windowed concourse toward the gates.\n\n\tANGLE ON RAZZLY, suddenly spotting DR. PETERS!\n\n<b>\t\t\t\tRAILLY\n</b><b>\t\tTHERE HE IS!  HE'S CARRYING A DEADLY\n</b><b>\t\tVIRUS!  STOP HIM!\n</b>\n\tANGLE ON COLE, following RAILLY'S look, seeing MR. PONYTAIL, THE\n<b>\tMAN FROM HIS DREAM!\n</b>\n\tANGLE ON DR. PETERS, frightened, glancing back, walking faster.\n\n\t\t\t\tRAILLY (o.s.)\n<b>\t\tPLEASE, SOMEBODY -- STOP HIM!\n</b>\n\tANGLE ON DETECTIVES, reaching RAILLY and COLE.\n\n<b>\t\t\t\tFIRST DETECTIVE\n</b>\t\t\t(raising his badge)\n\t\tPolice Officers.  Would you step over\n\t\there, please.\n\n\tANGLE ON COLE, spotting something behind the DETECTIVES!\n\n\tCOLE'S POV:  SCARFACE, dressed like a \"businessman\"!  He gives\n\tCOLE a cold look.\n\n\tA beat.  COLE lunges at the SECOND DETECTIVE, knocking him off\n\tbalance, then sprints toward the magnetic arch and through it.\n\n\tThe ALARM goes off!!!!\n\n\tThe FIRST SECURITY OFFICER tries to stop COLE, but COLE knocks\n\thim aside like a rag doll.\n\n\tANGLE ON DR. PETERS, fifty yards up the concourse, glancing back.\n\n\tANGLE ON COLE, pulling his pistol.\n\n<b>\tANGLE ON THE SECOND SECURITY OFFICER.\n</b>\n<b>\t\t\t\tFIRST SECURITY OFFICER\n</b><b>\t\tHE'S GOT A GUN!\n</b>\n\tANGLE ON THE FIRST DETECTIVE, raising his pistol at COLE.\n\n<b>\t\t\t\tFIRST DETECTIVE\n</b><b>\t\t\tSTOP OR I'LL SHOOT!\n</b><b>\t\n</b>\tANGLE ON COLE, gun in hand, sprinting along the concourse toward\n\tDR. PETERS as frightened TRAVELERS SCREAM and dive for cover.\n\n\tANGLE ON YOUNG COLE, standing at a concourse window, watching a\n\tplane land, flanked by his parents whose faces we don't see.\n\n<b>\tIT'S SUDDENLY AS IF THE DREAM IS HAPPENING IN REAL LIFE!!!  THE\n</b><b>\tSAME MOKENTS INTERSPERSED WITH \"NEW\" MOMENTS FROM THE POV OF\n</b>\tYOUNG COLE who, hearing the commotion, turns just as DR. PETERS\n\thurries by.  DR. PETERS bumps into YOUNG COLE and reacts by\n\tpulling his Bulls bag close to his body and calling...\n\n<b>\t\t\t\tDR. PETERS\n</b><b>\t\tWATCH IT!\n</b>\n\tANGLE ON YOUNG COLE, wide eyed, watching...\n\n\tYOUNG COLE'S POV:  a BLONDE MAN. dashing up the concourse, his\n\tmoustache slipping over his lip, a pistol in his hand.\n\n\tYOUNG COLE'S POV:  the FIRST DETECTIVE aims, looking for a clear\n\tshot in the crowded passageway.\n\n\tYOUNG COLE'S POV:  a BRUNETTE in flashy clothes, gaudy earrings,\n\thigh heels, and sun glasses SCREAMS...\n\n<b>\t\t\t\tBRUNETTE (RAILLY)\n</b><b>\t\tN0OOOOO0O!!!!!!\n</b>\n\tYOUNG COLE'S POV:  the FIRST DETECTIVE, firing!  CRACK!\n\n\tYOUNG COLE'S POV:  the BLONDE MAN, shuddering, staggering, falling.\n\n\tANGLE ON YOUNG COLE, stunned, as his PARENTS try to shield him.\n\n\t\t\t\tMOTHER'S VOICE (o.s.)\n\t\tMy God!  They shot that man!\n\n\tMesmerized, YOUNG COLE watches the BRUNETTE rush to the BLONDE\n\tMAN, kneel beside him, minister to his bloody wound.\n\n\tYOUNG COLE'S POV:  the BLONDE MAN, fatalistically reaching up\n\tand tenderly touching the BRUNETTE'S cheek, touching her tears.\n<b>\t(WE'VE SEEN THIS EXACT IMAGE IN COLE'S DREAM, A POWERFUL MOMENT,\n</b><b>\tUNFOLDING UNNATURALLY SLOWLY, OPENING LIKE A FLOWER.)\n</b>\n\tANGLE ON YOUNG COLE, not able to hear their words, but he can see\n\temotion as the BLONDE MAN tries to tell the sobbing BRUNETTE something.\n\n\tYOUNG COLE'S POV:  PARAMEDICS, breaking the spell, pushing the\n\tBRUNETTE aside as they crouch beside the BLONDE MAN.\n\n\t\t\t\tFATHER'S VOICE (o.s.)\n\t\tCome along, son, this is no place for us.\n\n\tANGLE ON YOUNG COLE, as his FATHER'S ARM drapes over his shoulder,\n\tsteering him.  YOUNG COLE turns to look back as he's led away.\n\n\tYOUNG COLE'S POV:  the PARAMEDICS, exchanging glances, shrugging\n\thelplessly.  It's too late.  The BLONDE MAN is dead.\n\n\tYOUNG COLE sees the BRUNETTE, her face streaked with tears,\n\tsuddenly turn and look around, scanning the crowd, searching for\n\tsomething.  POLICE OFFICERS approach her, say something to her.\n\tEven as she responds, her eyes continue to scan the concourse.\n\n\tANGLE ON YOUNG COLE, being hurried toward the lobby by his PARENTS\n\t(whose faces remain out of view).  He can't help sneaking another\n\tlook back.\n\n\tYOUNG COLE'S POV:  POLICE, handcuffing a distracted, unresisting\n\tRAILLY.  Even now, she continues to look around almost frantically.\n\n\tSuddenly, her gaze falls on YOUNG COLE and she reacts...she's\n\tfound what she's looking for!\n\n\tANGLE ON YOUNG COLE, reacting to the intensity of her look.\n\n\tANGLE ON RAILLY, her eyes speaking to the boy across the crowded\n\tconcourse.\n\n\tANGLE ON YOUNG COLE, overwhelmed by the look.\n\n\t\t\t\tFATHER'S VOICE (o.s.)\n\t\tHurry up, son.\n\n\tWith a last lingering look toward the mysterious BRUNETTE, YOUNG\n\tCOLE turns away, tears welling in his eyes.  WE MOVE IN...CLOSE...\n\tCLOSE...CLOSER...on his eyes.  WE WANT TO KNOW WHAT THE TEAR MEANS,\n<b>\tBUT THERE IS NO WAY TO TELL.  WE DON'T KNOW WHAT HE IS THINKING,\n</b><b>\tBUT WE KNOW VERY WELL WHAT HE WILL REMEMBER!\n</b>\n\t\t\t\tMOTHER'S VOICE (o.s.)\n\t\tPretend it was just a bad dream, Jimmy.\n\n<b>\tINT.  747 CABIN - DAY\n</b>\n\tDR. PETERS closes the door to the overhead luggage rack\n\tcontaining his Chicago Bulls bag and takes his seat.  Next to\n\thim, a FELLOW TRAVELER, unseen, says...\n\n\t\t\t\tFELLOW TRAVELER'S VOICE (o.s.)\n\t\tIt's obscene, all the violence, all the\n\t\tlunacy.  Shootings even at airports now.\n\t\tYou might say...we're the next endangered\n\t\tspecies...human beings!\n\n\tCLOSE ON DR. PETERS, smiling affably, turning to his neighbor.\n\n<b>\t\t\t\tDR. PETERS\n</b>\t\tI think you're right. sir.  I think\n\t\tyou've hit the nail on the head.\n\n\tDR. PETERS' POV:  the FELLOW TRAVELER, a silver haired gentleman\n\tin a business suit, offering his hand congenially.  DR. PETERS\n\tdoesn't know who this man is, but we do.  It's the ASTROPHYSICIST!\n\n<b>\t\t\t\tASTROPHYSICIST\n</b>\t\tJones is my name.  I'm in insurance.\n\n<b>\tEXT.   PARKING LOT/AIRPORT\n</b>\n\tAs YOUNG COLE'S PARENTS (seen only as sleeves and torsos) usher\n\tYOUNG COLE into their station wagon, the boy hesitates, looks\n\tback, watches a 747 climb into the sky.\n\n<b>\t\t\t\t\t\t\tFADE OUT:\n</b>\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>12 Monkeys</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David Peoples\" title=\"Scripts by David Peoples\">David Peoples</a>  <a href=\"/writer.php?w=Janet Peoples\" title=\"Scripts by Janet Peoples\">Janet Peoples</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/12 Monkeys Script.html#comments\" title=\"12 Monkeys comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:57:02.666035"}