{"title": "12 Years a Slave", "film_link": "/Movie Scripts/12 Years a Slave Script.html", "script_link": "/scripts/12-Years-a-Slave.html", "info_raw": "\n\n12 Years a Slave Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Ridley\nGenres  Drama\nMovie Release Date : November 2013\nSubmitted by: XXyTurtle\n\nRead \"12 Years a Slave\" Script\n\n\n", "script": "\n\r\n\r\n\r\n                             12 YEARS A SLAVE\r\n\r\n\r\n\r\n\r\n                               Written by\r\n\r\n                              John Ridley\r\n\r\n\r\n\r\n\r\n                              CARD: 1841\r\n\r\n                               FADE IN:\r\n\r\n                         \r\n\r\n          1 INT. TOWNHOUSE/STUDY - DAY 1\r\n\r\n\r\n           -EARLY APRIL, 1841-\r\n           We are close on a PAIR OF BLACK HANDS as they open A\r\n\r\n           FINELY WRAPPED PACKET OF VIOLIN STRINGS.\r\n\r\n           WE CUT TO the hands stringing a VIOLIN. It's not a high\r\n           end piece, but it is quite nice.\r\n\r\n           WE CUT TO a wide shot of the study. Sitting in a chair\r\n           with violin in hand is SOLOMON NORTHUP; a man in his late\r\n           twenties. Everything about Solomon, his mien and manner,\r\n           is distinguished. But he, too, seems a hardy individual.\r\n           Someone who has known manual labor in his time.\r\n\r\n           Solomon begins to lightly play his violin, as if testing\r\n           the strings, their tuning. Satisfied, Solomon begins to\r\n           play vigorously. As he does, we make a HARD CUT TO:\r\n\r\n                         \r\n\r\n\r\n           INT. HOUSE/LIVING ROOM - EVENING\r\n\r\n           We come in on a lively affair. A dinner party is being\r\n           thrown within the confines of a fairly stately house. In\r\n           attendance are EIGHT COUPLES. All are WHITE and all are\r\n           FAIRLY YOUNG, in their early twenties. The men and women\r\n           are dressed in very fine attire. We should get the sense\r\n           that for the most part they are people of means.\r\n\r\n           The furniture has been set aside in the living room. At\r\n           the moment the couples are engaged in the dancing of a\r\n           REEL.\r\n\r\n           The music they are dancing to is being played by Solomon,\r\n           having cut directly from the tune he was previously\r\n           playing. He plays with a light determination, and in no\r\n           way seems possessed with empty servitude.\r\n\r\n           Solomon concludes the reel, and the dancers break into\r\n           enthusiastic applause, which is followed by personal\r\n           thanks and congratulations from all. It should be clear\r\n           that despite their respective races there is much\r\n           admiration and appreciation for Solomon's abilities.\r\n\r\n                         \r\n\r\n\r\n           INT. NORTHUP HOUSE/BEDROOM - MORNING\r\n\r\n           It is a Saturday morning. Clad in her finest attire is\r\n           ANNE; Solomon's wife, a few years younger than he. We\r\n           see also the Northup children: MARGARET who is eight, and\r\n           ALONZO who is five. They are handsome, and well groomed\r\n           kids. Anne straightens up the children. She finishes,\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          2.\r\n\r\n                         3 CONTINUED: 3\r\n           she rises up and stands behind them, almost as if\r\n           preparing to pose for a portrait.\r\n           They all wait a moment, then Solomon enters the foyer.\r\n           He stands and looks admiringly at his family. ADMIRINGLY\r\n           stressed. It isn't that he doesn't have love for them,\r\n           he does as well. But in the moment, he truly admires his\r\n           greatest accomplishment: a family that is healthy and\r\n           well and provided for. He goes to his children, and\r\n           hands each a coin, then goes to Anne. Gives her a kiss\r\n           on the cheek. The children giggle at the sight.\r\n\r\n                         \r\n\r\n\r\n           EXT. STREET - DAY\r\n\r\n           Solomon and his family are out walking along the streets\r\n           and groves of Saratoga.\r\n\r\n           The streets are well populated this morning with many\r\n           people out strolling. Most are WHITE, but there are\r\n           BLACKS as well. They are FREED BLACKS who mingle fairly\r\n           easily - though not always completely - with the whites.\r\n           We see, too, a few BLACK SLAVES who travel with their\r\n           WHITE MASTERS. These pairings are largely from the south\r\n           and - despite the fact the blacks are slaves - they are\r\n           not physically downtrodden, not field hands. They are\r\n           well dressed and \"leading apparently an easy life\" -\r\n           comparatively speaking - as they trail their masters.\r\n\r\n           As they walk, Solomon and his family arrive to an\r\n           intersection well-worn and muddied from horse and cart\r\n           traffic. Solomon and his children easily jump across the\r\n           muck. Anne stands at the lip of the puddle, calls for\r\n           Solomon to help her across.\r\n\r\n                          ANNE\r\n           Solomon...\r\n           Solomon, turning back to his wife with a broad smile\r\n           waving her forward:\r\n\r\n                          SOLOMON\r\n           Come, Anne. Jump.\r\n\r\n           The children, now smiling as well, egg their mother on.\r\n\r\n                          ALONZO MARGARET\r\n           Jump. You can make it. I've done it. You can make\r\n           it.\r\n\r\n                         \r\n\r\n                          ANNE\r\n           I will not ruin my dress. Catch\r\n           me!\r\n\r\n           Solomon moves close, holds out his arms. Yet, there's\r\n           still just a bit of mischievousness in his eyes. Anne\r\n           gives her husband a lightly stern look to which Solomon\r\n           replies.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          3.\r\n\r\n\r\n                          SOLOMON\r\n           I will catch you, Anne.\r\n\r\n                          (BEAT)\r\n           I will.\r\n           Again, lightly stern:\r\n\r\n                          ANNE\r\n           You will.\r\n\r\n           And with that Anne takes the leap. Solomon catches her,\r\n           swings her around grandly and sets her down lightly to\r\n           the delighted applause of the children. That done,\r\n           Solomon takes Anne's hand and leads her on.\r\n\r\n           As Solomon and his family make their way, among the\r\n           slaves on the street, we see one in particular; JASPER.\r\n           As he trails his MASTER he can't help but note Solomon\r\n           and his family as they enter A STORE. His intrigue of\r\n           this most handsome and harmonious group should be\r\n           obvious.\r\n\r\n           With his Master occupied, Jasper moves slyly toward the\r\n           STORE. Frozen on the spot, Jasper looks on admiringly.\r\n           Suddenly a voice barks out-\r\n\r\n           A VOICE (O.S.)\r\n           Jasper! Come on!\r\n\r\n                         \r\n\r\n           INT. STORE - LATER\r\n\r\n           We are inside the store of MR. CEPHAS PARKER; a white man\r\n           and a supplier of general goods. Solomon greets him\r\n\r\n                          WITH:\r\n\r\n                          SOLOMON\r\n           Mr. Parker.\r\n\r\n                          PARKER\r\n           Mr. Northup. Mrs. Northup.\r\n\r\n           With money in hand the Northup children move quickly\r\n           about the store looking for items to purchase.\r\n\r\n                         \r\n\r\n                          CONTINUED:\r\n\r\n\r\n           Anne looks over some silks and fabrics. Parker suggests\r\n\r\n                          TO SOLOMON:\r\n\r\n                          PARKER (CONT'D)\r\n           A new cravat, Solomon? Pure silk\r\n           by way of the French.\r\n\r\n                          SOLOMON\r\n           We are in need of a fresh carry\r\n           all for the Mrs's travels.\r\n\r\n                          PARKER\r\n           A year's passed? Off to Sandy\r\n           Hill?\r\n\r\n                          ANNE\r\n           I am.\r\n           Using a long pole, Mr. Parker fetches down a CARRY ALL\r\n           from an upper shelf.\r\n\r\n                          PARKER\r\n           Something to suit your style, but\r\n           sturdy enough for the forty miles\r\n           round trip.\r\n           Handing the Bag to Anne, she is immediately taken by it.\r\n\r\n                          ANNE\r\n           It's beautiful.\r\n\r\n                          SOLOMON\r\n\r\n                          (CAUTIOUSLY)\r\n           At what price?\r\n\r\n                          ANNE\r\n           We will take it. Children, come\r\n           see what your father has just\r\n           purchased for me.\r\n           As the children run over - chattering excitedly about the\r\n           new gift - they RUN PAST JASPER who has quietly entered\r\n           the store.\r\n           At the checkout counter sits a portrait of WILLIAM HENRY\r\n           HARRISON, the edges draped in black crepe. Before the\r\n           book sits a LEDGER. Mr. Parker asks of Solomon:\r\n\r\n                          PARKER\r\n           If you would sign our condolence\r\n           book. My hope is to find a way to\r\n           forward it to the Widow Harrison.\r\n           Sad days for the nation.\r\n\r\n                          SOLOMON\r\n           Yes, certainly. Poor Mrs. Harris\r\n           and her children. I hope brighter\r\n           times ahead.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          4A.\r\n\r\n                         5 CONTINUED: (2) 5\r\n           Jasper looks scared, timid. It's as though he'd like to\r\n           engage, but is unsure of as to how. Noting Jasper, Parker\r\n\r\n                          SAYS:\r\n\r\n                          PARKER\r\n           A moment, sir, and you will be\r\n           assisted.\r\n\r\n                          SOLOMON\r\n           If we could discuss the price...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          5.\r\n\r\n                         5 CONTINUED: (3) 5\r\n\r\n                          PARKER\r\n           Forgive me, Mrs. Northup. A\r\n           customer waits. Welcome, sir.\r\n           To Jasper, with good nature:\r\n\r\n                          SOLOMON\r\n           Shop well, but mind your wallet.\r\n\r\n                          PARKER\r\n           Ignore the gentleman's nonsense.\r\n           Now, may I interest you in a new\r\n           cravat? Pure silk by way of the--\r\n           Before Parker can finish, the door opens. It's Jasper's\r\n           Master, FITZGERALD. He's stern, clearly displeased.\r\n\r\n                          FITZGERALD\r\n           Jasper!\r\n\r\n                          (TO PARKER)\r\n           My regrets for the intrusion.\r\n\r\n                          SOLOMON\r\n           No intrusion.\r\n           Fitzgerald looks to Solomon. It is a cold glare as\r\n           though he wasn't speaking to, and has no interest in a\r\n           response from a black man. Looking back to Parker:\r\n\r\n                          FITZGERALD\r\n           Good day, sir.\r\n\r\n                         \r\n\r\n                         6 6\r\n\r\n           INT. NORTHUP HOUSE/DINING ROOM - EVENING\r\n\r\n           Anne, busy in the kitchen, puts the final touches to the\r\n           meal, which is just about to begin. Solomon, in the\r\n           meanwhile, sits at the head of the table reading from a\r\n           NEWSPAPER. He reads to his children solemn news of the\r\n           funeral arrangements for the recently deceased President\r\n           Harrison.\r\n\r\n                          SOLOMON\r\n           \"Thus has passed away from earth\r\n           our late President.\"\r\n           Solomon starts from the top of the article.\r\n\r\n                          SOLOMON (CONT'D)\r\n           \"During the morning, from sunrise,\r\n           the heavy bells had been pealing\r\n           forth their slow and solemn toll\r\n           while the minute guns announced\r\n           that soon the grave would receive\r\n           its trust. Our city as well as\r\n           our entire nation has been called\r\n           to weep over the fall of a great\r\n           and good man. One who was by the\r\n           wishes of a large majority of our\r\n\r\n                          (MORE) (CONTINUED)\r\n\r\n          5A.\r\n\r\n                         6 CONTINUED: 6\r\n\r\n                          SOLOMON (CONT'D)\r\n           people raised to fill the highest\r\n           place of trust within their gift.\r\n           William Henry Harrison.\"\r\n           A long moment of quiet, the family continuing to eat.\r\n           Then, from Margaret:\r\n\r\n                          MARGARET\r\n           Will you read it again?\r\n\r\n                          ANNE\r\n           Not just now, darling.\r\n           Anne enters the dining room and places a large chicken at\r\n           the center of the table. As she takes a seat, all heads\r\n           are bowed.\r\n\r\n                          MARGARET\r\n           For food that stays our hunger,\r\n           For rest that brings us ease,\r\n           For homes where memories linger,\r\n           We give our thanks for these.\r\n\r\n                          ALL\r\n           Amen.\r\n\r\n                          SOLOMON\r\n           Margaret, that was wonderful.\r\n\r\n                          MARGARET\r\n           Thank you, Papa.\r\n\r\n                          SOLOMON\r\n           Alonzo, do you have something to\r\n           say?\r\n\r\n                          ALONZO\r\n           Yes, I helped Momma make this.\r\n\r\n                          ANNE\r\n           Yes, and you were such a good\r\n           help. Especially making the gravy.\r\n\r\n                          MARGARET\r\n           Papa, I would very much like to\r\n           learn how to play the violin.\r\n           Could you teach me?\r\n\r\n                          ALONZO\r\n           Me too!\r\n\r\n                          MARGARET\r\n           Yes, but I asked Papa first.\r\n\r\n                          SOLOMON\r\n           Both of you, calm down. We will\r\n           have our first lesson after this\r\n           wonderful dinner. And on that\r\n           note, let's start eating.\r\n\r\n                          (CONTINUED)\r\n\r\n          5B.\r\n\r\n                         6 CONTINUED: (2) 6\r\n           The family all tuck in to their meal. The scene is one of\r\n           warmth and happiness.\r\n\r\n          6.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          7 INT. NORTHUP HOUSE - NIGHT 7\r\n\r\n           Solomon and Anne have fun and difficulty putting the\r\n           unruly children to bed. They are tucked in, and each\r\n           given a kiss good night. As Margaret lays down to sleep,\r\n           Anne blows out the candle darkening the room.\r\n           Silhouetted in the doorway, Solomon takes Anne in his\r\n           arms, holds her tightly as they both luxuriate in the\r\n           simple, beautiful gift that is their children.\r\n\r\n                         \r\n\r\n                         7A 7A \r\n\r\n           INT. NORTHUP HOUSE - NIGHT\r\n\r\n           Now alone together, we see Anne and Solomon wrapped in\r\n           each other's arms. Beyond being physically close,\r\n           emotionally close, they are just so very comfortable with\r\n           one another. They are the very representation of a\r\n           couple who are made for each other.\r\n\r\n                          \r\n           They look at each other for a prolonged time.\r\n\r\n                          SOLOMON \r\n\r\n                          (COMICALLY FORLORN) \r\n           Three weeks. Two days. \r\n\r\n                          ANNE \r\n           It is the custom. I wonder what \r\n           you'll do without me? \r\n\r\n                          SOLOMON \r\n           I won't stay idle. \r\n           SOLOMON's eyes lower. \r\n\r\n                          ANNE \r\n           Darling, it's good money. \r\n\r\n                          SOLOMON \r\n           If only I didn't have to share \r\n           your cooking with other people. \r\n           ANNE holds his gaze. \r\n\r\n                          ANNE \r\n           You don't. \r\n           They kiss. \r\n\r\n                         \r\n\r\n                         8 OMIT 8\r\n\r\n          7.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          9 EXT. NORTHUP HOUSE - MORNING 9\r\n\r\n           We are just outside the Northup house. A CARRIAGE waits\r\n           with a DRIVER. Anne and the children are dressed for\r\n           travel - Anne sporting HER NEW CARRY ALL. The Driver\r\n           loads bags into the carriage.\r\n           For her parting gift, Anne gives her husband a kiss.\r\n\r\n                          SOLOMON\r\n           Travel safely.\r\n\r\n                          ANNE\r\n           Stay safely.\r\n           Anne and the children loaded up, the Driver chides the\r\n           horse and the carriage heads off. Solomon waves a hearty\r\n           good bye to his wife and children.\r\n\r\n                         \r\n\r\n                         10 10\r\n\r\n           EXT. PARK - DAY\r\n\r\n           Solomon is now out for a stroll. He passes two men - two\r\n           in particular - who stand outside conversing with MR.\r\n           MOON himself: MERRILL BROWN and ABRAM HAMILTON. Brown\r\n           is about 40, with a countenance indicating shrewdness and\r\n           intelligence. Hamilton is closer to 25, a man of fair\r\n           complexion and light eyes. Both are finely, if perhaps a\r\n           bit garishly, dressed. Hamilton, as Solomon describes\r\n           him, slightly effeminate.\r\n           Moon, spotting Solomon:\r\n\r\n           MR. MOON\r\n           Call the Devil's name... There he\r\n           is now. Mr. Northup...! I have\r\n           two gentlemen who should make your\r\n           acquaintance. Messrs. Brown and\r\n           Hamilton.\r\n\r\n                          BROWN\r\n           Sir.\r\n\r\n           MR. MOON\r\n           Mr. Northup, these two gentlemen\r\n           were inquiring about distinguished\r\n           individuals, and I was just this\r\n           very moment telling them that\r\n           Solomon Northup is an expert\r\n           player on the violin.\r\n\r\n                          HAMILTON\r\n           He was indeed.\r\n\r\n                          SOLOMON\r\n           Mr. Moon is being overly gracious.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           8.\r\n\r\n                         10 CONTINUED: 10\r\n\r\n                          BROWN\r\n           Taking into consideration his\r\n           graciousness and your modesty, may\r\n           we trouble you for a moment of\r\n           your time to converse, sir?\r\n\r\n                         \r\n\r\n                         11 11\r\n\r\n           EXT. PARK/PAVILION - LATER\r\n\r\n           We make a jump to a green space. Solomon, Brown and\r\n           Hamilton are sitting at a bench.\r\n\r\n                          SOLOMON\r\n           A circus?\r\n\r\n                          HAMILTON\r\n           That is our usual employee. The\r\n           company currently in the city of\r\n           Washington.\r\n\r\n                          BROWN\r\n           Circus too constricting a word to\r\n           describe the talented and merry\r\n           band with which we travel. It is\r\n           a spectacle unlike most have ever\r\n           witnessed. Creatures from the\r\n           darkest Africa as yet unseen by\r\n           civilized man. Acrobats from the\r\n           Orient able to contort themselves\r\n           in the most confounding manners.\r\n\r\n                          HAMILTON\r\n           And I myself in aide of Mr. Brown;\r\n           an internationally renowned\r\n           practitioner in the art of\r\n           prestidigitation.\r\n\r\n                          BROWN\r\n           We are on our way thither to\r\n           rejoin the company having left for\r\n           a short time to make a small\r\n           profit from our own exhibitions.\r\n\r\n                          HAMILTON\r\n           The reason for our inquiry with\r\n           Mr. Moon...\r\n\r\n                          BROWN\r\n           Yes. We had just a devil of a\r\n           time in procuring music for our\r\n\r\n                          (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           9.\r\n\r\n                         11 CONTINUED: 11\r\n\r\n                          BROWN (CONT'D)\r\n           entertainments. Men of true\r\n           talent seemingly in short supply.\r\n\r\n                          SOLOMON\r\n           Thank you sir...\r\n\r\n                          BROWN\r\n           If we could persuade you to\r\n           accompany us as far as New York...\r\n           We would give you one dollar for\r\n           each day's service and three\r\n           dollars for every night played at\r\n           our performances. In addition we\r\n           would provide sufficient pay for\r\n           the expenses of your return from\r\n           New York here to Saratoga.\r\n\r\n                          SOLOMON\r\n           You understand this is all very\r\n           sudden.\r\n\r\n                          HAMILTON\r\n           Consider it an opportunity to see\r\n\r\n                          THE COUNTRY--\r\n\r\n                          SOLOMON\r\n           It's intriguing...\r\n\r\n                          HAMILTON\r\n           If there is any way in which you\r\n           would give consideration to the\r\n           offer...\r\n           Solomon gives the whole deal one last consideration.\r\n\r\n                          SOLOMON\r\n           The payment offered is enticement\r\n           enough, as is my desire to visit\r\n           the metropolis.\r\n\r\n                          HAMILTON\r\n           We are delighted, sir. So\r\n           delighted. Though we would add\r\n           that our travel plans--\r\n\r\n                          BROWN\r\n           We would like to depart with\r\n           haste.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          10.\r\n\r\n                         11 CONTINUED: (2) 11\r\n\r\n                          SOLOMON\r\n           As luck would have it, my wife and\r\n           children are traveling. I will\r\n           write her of our plans.\r\n\r\n                          BROWN\r\n           Excellent! I would beg you\r\n           collect yourself, then we may\r\n           proceed.\r\n\r\n                         \r\n\r\n                         12 12\r\n\r\n           INT. NORTHUP HOUSE/BEDROOM - LATER\r\n\r\n           Back in his house, we see Solomon packing: putting some\r\n           clothes in a travel case, and collecting his violin as\r\n           well.\r\n\r\n                         \r\n\r\n          13 INT. NORTHUP HOUSE/STUDY - LATER 13\r\n\r\n           Solomon sits down to write a letter; pen poised over\r\n           paper with already a few lines written. But Solomon\r\n           thinks better of it. WITH LITTLE THOUGHT HE TEARS THE\r\n\r\n           PAPER AND SETS IT ASIDE. WE SHOULD GET THE SENSE THAT\r\n\r\n           THE ABSOLUTE VALUE OF BEING ABLE TO COMMUNICATE BY LETTER\r\n\r\n           IS LOST ON SOLOMON. THIS FACT WILL HAVE GREAT WEIGHT IN\r\n\r\n           THE NEAR FUTURE.\r\n\r\n                         \r\n\r\n                         14 14\r\n\r\n           EXT. SOLOMON'S HOUSE/INT. COVERED CARRIAGE - LATER\r\n\r\n           Solomon enters the buggy, carpet bag in hand. Brown and\r\n           Hamilton are waiting. They ride in a covered carriage\r\n           led by a pair of \"noble\" horses.\r\n\r\n                          HAMILTON\r\n           No letter to post?\r\n\r\n                          SOLOMON\r\n           No need. My return will coincide\r\n           with my family's.\r\n\r\n                          BROWN\r\n           We're off then.\r\n\r\n                         \r\n\r\n                         15 15\r\n\r\n           INT. PUB - EVENING\r\n\r\n\r\n           -MID TO LATE APRIL, 1841-\r\n           We find ourselves in a roadside pub. It serves the\r\n           purpose of drinking and diversion, and little more. As\r\n           Solomon plays his violin, Brown and Hamilton perform a\r\n           decent, paired magic routine before a SPARSE AUDIENCE NOT\r\n\r\n           OF \"SELECT CHARACTER.\"\r\n\r\n          11.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          16 INT. PUB - LATER 16\r\n\r\n           After the show, the pub now fairly empty, Solomon,\r\n           Hamilton and Brown sit down to eat. Hamilton and Brown\r\n           drink, but again Solomon abstains. Though Solomon\r\n           remains cool, Hamilton and Brown put up a great show of\r\n           being disappointed as Hamilton counts out what little\r\n           money was collected.\r\n\r\n                          HAMILTON\r\n           Not an additional tip from a one\r\n           of them. They expect to be\r\n           entertained for nothing.\r\n\r\n                          BROWN\r\n           And not satisfied a bit despite\r\n           giving them more than what they\r\n           paid for.\r\n\r\n                          SOLOMON\r\n           It's the national mood. There's\r\n           too much grief to make room for\r\n           frivolity.\r\n\r\n                          HAMILTON\r\n           My sincerest apologies, Solomon.\r\n           You were promised opportunity, and\r\n           you were given none.\r\n\r\n                          BROWN\r\n           The opportunity is with the\r\n           circus. A two man show poorly\r\n           promoted, what were we to expect?\r\n           But the circus bills itself.\r\n\r\n                          HAMILTON\r\n           True.\r\n\r\n                          BROWN\r\n           I have told you of the circus with\r\n           which we are connected. Creatures\r\n           from the darkest of Africa.\r\n           Acrobats from the Orient who--\r\n\r\n                          SOLOMON\r\n           You have described it, yes.\r\n\r\n                          BROWN\r\n           Yes. We need to return\r\n           immediately to Washington.\r\n           Solomon...I believe us familiar\r\n           enough now, but forgive me if I am\r\n           bold...would you consider making\r\n           the trip with us?\r\n           Solomon gives a bit of a laugh at the idea.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          12.\r\n\r\n                         16 CONTINUED: 16\r\n\r\n                          HAMILTON\r\n           Entertaining at pubs and inns has\r\n           it's place, but a man of your\r\n           skills deserves better.\r\n\r\n                          BROWN\r\n           Hear, hear.\r\n\r\n                          HAMILTON\r\n           And more importantly you would\r\n           build your own name and following.\r\n           The circus tends to attract those\r\n           with the highest of reputations.\r\n           An introduction here and there\r\n           could amount to a lifetime of\r\n           reward. Now would be the time.\r\n           With your family away, an\r\n           opportunity presents itself.\r\n\r\n                          BROWN\r\n           Said as fellow artists as well as\r\n           businessmen. Well worth the\r\n           effort at least.\r\n\r\n                          SOLOMON\r\n           You present a flattering\r\n           representation. As my family will\r\n           be traveling back shortly, perhaps\r\n           I might commit only to one trial\r\n           engagement.\r\n\r\n                         \r\n\r\n                          HAMILTON\r\n           Oh, very good, sir. Very good. I\r\n           cannot recall being so excited.\r\n\r\n                          BROWN\r\n           There is a practical concern. If\r\n           you are to continue on with us you\r\n           should obtain your free papers.\r\n\r\n                          SOLOMON\r\n           Not necessary.\r\n\r\n                          BROWN\r\n           Here in New York, no. But we will\r\n           be entering slave states and as a\r\n           matter of precaution... It's to\r\n           all our benefit we should not have\r\n           to come to account for your well\r\n           being.\r\n\r\n                          HAMILTON\r\n           Six shillings worth of effort\r\n           could well save much trouble\r\n           later.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          12A.\r\n\r\n                         16 CONTINUED: (2) 16\r\n\r\n                          BROWN\r\n           We'll go to the Customs House in\r\n           the morning, then travel on. Good\r\n           business all around.\r\n\r\n          13.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         17 OMIT 17\r\n\r\n                         \r\n\r\n          18 EXT. WASHINGTON - DAY 18\r\n\r\n           The city is a swarm of people. At the moment the populace\r\n           is displaying both sorrow and anticipation. Sorrow for\r\n           the loss of the President. Many are dressed in black,\r\n           and black crepe hangs nearly everywhere. Black armbands\r\n           are frequently seen, and the occasional American Flag\r\n           hung at half mast. As well, there are portraits of\r\n           Harrison at varying locations.\r\n           Having arrived in Washington, Solomon, Hamilton and Brown\r\n\r\n           RIDE ONWARD IN THEIR CARRIAGE.\r\n\r\n                         \r\n\r\n                         19 19\r\n\r\n           INT. GADSBY HOTEL/DINNING ROOM - EVENING\r\n\r\n           A decent though crowded, boisterous and smoke-filled\r\n           joint. Very lively. Solomon, Hamilton and Brown are\r\n           among several parties drinking in the hotel's bar. As\r\n           with seemingly everywhere in the city black crepes\r\n           accessorize the background. Brown counts out $43.00 IN\r\n           COIN on the tabletop. Solomon is astonished by the\r\n           amount.\r\n\r\n                          BROWN\r\n           Forty-three dollars. All to you.\r\n\r\n                          SOLOMON\r\n           That...it's far more than my wages\r\n           amount to.\r\n\r\n                          BROWN\r\n           Consider the remainder an advance\r\n           from the circus. I cannot tell\r\n           you...I honestly wish you had seen\r\n           the expression of our director\r\n           when I described your abilities.\r\n           He was fairly overcome with\r\n           excitement.\r\n\r\n                          HAMILTON\r\n           You should have invited him to sup\r\n           with us.\r\n\r\n                          BROWN\r\n           I did. I did, but so many\r\n           preparations before the company is\r\n           to depart.\r\n\r\n                          SOLOMON\r\n\r\n                          GENTLEMEN--\r\n\r\n                          BROWN\r\n           Tomorrow we shall prepare for our\r\n           Washington debut. But tonight, our\r\n           thoughts are with the great man\r\n\r\n                          (MORE) (CONTINUED)\r\n\r\n          13A.\r\n\r\n                         19 CONTINUED: 19\r\n\r\n                          BROWN (CONT'D)\r\n           for whom this city prepared solemn\r\n           memorial. He has passed from the\r\n           praise of men to receive the\r\n           plaudit of his heavenly father. A\r\n           fine man has passed. Let us\r\n           remember him with a drink.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          14.\r\n\r\n                         19 CONTINUED: (2) 19\r\n           Both Hamilton and Brown hold up their tankards to drink.\r\n           Solomon, a bit reluctantly, does the same.\r\n\r\n                          HAMILTON\r\n           Cheers.\r\n\r\n                          BROWN\r\n           Another. Our departed President\r\n           deserves all the salutation we can\r\n           imbibe.\r\n           Hamilton and Brown drink again, and Solomon does as well.\r\n\r\n                         \r\n\r\n                         20 20\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n                         21 OMIT 21\r\n\r\n                         \r\n\r\n          22 EXT. ALLEY - LATER 22\r\n\r\n           WE MAKE A HARD CUT to Solomon outside of the Pub, in an\r\n           alley, with Brown and Hamilton in silhouette, back-lit by\r\n           the street lights. He is violently ill, hunched over and\r\n           retching horribly.\r\n\r\n                          HAMILTON\r\n           That's all right Solomon. No\r\n           shame in it. No shame at all.\r\n\r\n          15.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          A23 INT. GADSBY HOTEL - STAIRCASE A23\r\n\r\n           Hamilton and Brown help Solomon to lumber up the spiral\r\n           staircase, passing the occasional bemused guest.\r\n\r\n                         \r\n\r\n          23 INT. GADSBY HOTEL/SOLOMON'S ROOM - NIGHT 23\r\n\r\n           Hamilton is placing a spittoon near Solomon's bed, where\r\n           a prone and reeling Solomon lays. Hamilton sits on the\r\n           bed. As he strokes Solomon's sweaty face, Hamilton\r\n           speaks sweetly.\r\n\r\n                          HAMILTON\r\n           I'm afraid that Brown and I\r\n           haven't brought you much luck.\r\n           But rough waters bring smooth\r\n           sailing. Eventually they do.\r\n\r\n                          SOLOMON\r\n           ....So...so sorry...\r\n\r\n                          HAMILTON\r\n           Shhh. We won't hear it. We\r\n           won't.\r\n\r\n                          BROWN\r\n           Let him sleep.\r\n\r\n                          HAMILTON\r\n           Hmm. A good night's sleep. And\r\n           tomorrow...tomorrow you will feel\r\n           as well and refreshed as though\r\n           the earth were new again.\r\n           Hamilton lingers a bit too long and a bit too close to\r\n           Solomon for Brown's taste. With more than a bit of\r\n\r\n                          SIGNIFICATION:\r\n\r\n                          BROWN\r\n           Hamilton! Nothing more we can do\r\n           for him.\r\n\r\n                          HAMILTON\r\n           Such is the pity.\r\n           Displaying an odd sort of disappointment, Hamilton slinks\r\n           away from the bed. He crosses to, and BLOWS OUT A\r\n           CANDLE. The room goes dark with a blackness more than\r\n           night. Brown and Hamilton exit. Solomon lays in the\r\n           dark and moans. His sounds becoming MORE AND MORE\r\n\r\n           DISTRESSED.\r\n\r\n                         \r\n\r\n                         24 24\r\n\r\n           INT. BURCH'S DUNGEON - DAWN\r\n\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          16.\r\n\r\n                         24 CONTINUED: 24\r\n           Solomon stirs, then slowly awakes to his new\r\n           circumstances. He finds himself in a nearly lightless\r\n           room about twelve feet square with walls of solid\r\n           masonry. There is a thick and well-locked door, a small\r\n           window covered with iron bars and a shutter. The only\r\n           furniture is a wood stool and an old fashioned, dirty box\r\n           stove. As Solomon rises he sees that his HANDS are\r\n           CUFFED - the chain running to a bolt in the ground - and\r\n           his LEGS IN IRONS. At first Solomon is incredulous. But\r\n           that emotion is replaced first by fury and then panic.\r\n           He begins to pull on the chains, fight against them. He\r\n           does so with increasing desperation. Solomon flails\r\n           about, the sounds of the steel chains whipping and\r\n           beating against the masonry. He grunts and screams\r\n           without regard as the cuffs and irons bite into his\r\n           flesh, but he cannot pull himself free.\r\n           After several minutes of intense effort, Solomon tires,\r\n           slows, then finally he collapses. And in this collapsed\r\n           state he remains.\r\n\r\n                         \r\n\r\n                         25 25\r\n\r\n           INT. BURCH'S DUNGEON - MORNING\r\n\r\n           Solomon again awakens. He hears sounds beyond the\r\n           door...footsteps. Eventually the door opens. Enter\r\n           JAMES BURCH - who runs the slave pen - and EBENEZER\r\n           RADBURN who works as a turnkey and overseer.\r\n           As the door opens, this is the first light to seep into\r\n           the otherwise near-black room. The shine is painful to\r\n           Solomon's eyes. With no salutation whatsoever, Burch\r\n\r\n                          ASKS:\r\n\r\n                          BURCH\r\n           Well, my boy, how yah feel now?\r\n           Solomon rises up as best he can. With all the resolve he\r\n           can put together he states what he considers to be fact:\r\n\r\n                          SOLOMON\r\n           I am Solomon Northup. I am a free\r\n           man; a resident of Saratoga, New\r\n           York. The residence also of my\r\n           wife and children who are equally\r\n           free. I have papers. You have no\r\n           right whatsoever to detain me--\r\n\r\n                          BURCH\r\n           Yah not any--\r\n\r\n                          SOLOMON\r\n           And I promise you - I promise -\r\n           upon my liberation I will have\r\n           satisfaction for this wrong.\r\n\r\n                          BURCH\r\n           Resolve this. Produce your\r\n           papers.\r\n\r\n                          (CONTINUED)\r\n\r\n          17.\r\n\r\n                         25 CONTINUED: 25\r\n           With confidence Solomon goes to the pocket of his\r\n           trousers. He searches one, then the other, but they are\r\n           empty. He feels quickly about himself, but clearly his\r\n           papers have been lifted. Solomon's confidence shifts,\r\n           but to resolve rather than fear. Papers or none, he will\r\n           not be easily cowed. Still, Burch asserts:\r\n\r\n                          BURCH (CONT'D)\r\n           Yah no free man. And yah ain't\r\n           from Saratoga. Yah from Georgia.\r\n           A moment. Not a word spoken among the trio, but Solomon\r\n           and Burch do some serious eye fucking, neither man\r\n           yielding. Burch says again:\r\n\r\n                          BURCH (CONT'D)\r\n           Yah ain't a free man. Yah nuthin'\r\n           but a Georgia runaway.\r\n           Burch waits for Solomon to acquiesce. Solomon does not\r\n           in any way. Both men exchange a long and daring stare.\r\n           The two are clearly at an intellectual stand off. Burch,\r\n           leans to Radburn, SAYS SOMETHING WHICH WE CANNOT\r\n\r\n           DISTINGUISH.\r\n           Radburn walks off-camera and returns with a pair of\r\n           \"instruments:\" a PADDLE - the flattened portion, which is\r\n           about the size in circumference of two open hands, and\r\n           bored with a small auger in numerous places. He also\r\n           carries a WHIP. A cat-o-nine tails; a large rope of many\r\n           strands. The strands unraveled and a knot tied at the\r\n           extremity of each. Burch says again:\r\n\r\n                          BURCH (CONT'D)\r\n           Yah a runaway nigger from Georgia.\r\n           Solomon stands with a quiet stoicism. He will say\r\n           nothing of the kind.\r\n           As that is the case, Solomon is seized by both men. He is\r\n           pulled over the bench, face downward, shirt still on his\r\n           back. Radburn then STEPS ON HIS CHAINS, holding Solomon\r\n           down in a bent position.\r\n           With no preamble, Burch begins to beat Solomon about the\r\n           back with the paddle. Burch strikes him wordlessly - no\r\n           taunting, no sneering. Solomon screaming against each\r\n           blow. His back immediately SWELLING WITH WELTS AND\r\n\r\n           BRUISES.\r\n           This beating continues on and on and on until quite\r\n           literally Burch WEARS HIMSELF OUT with the effort.\r\n           Dripping in sweat and panting:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          18.\r\n\r\n                         25 CONTINUED: (2) 25\r\n\r\n                          BURCH (CONT'D)\r\n           Yah still insist yah a free man?\r\n\r\n                          SOLOMON\r\n           ...I...I insist...\r\n           Burch regrets hearing this. Not from sympathy, but\r\n           rather because he's nearly too tired to go back to\r\n           beating Solomon. Yet, as if returning to work, Burch\r\n           returns to pummeling Solomon. Burch punctuates the blows\r\n\r\n                          WITH:\r\n\r\n                          BURCH\r\n           Yah a slave. Yah a Georgia slave!\r\n           Burch continues to strike, and strike... This time until\r\n           the paddle SNAPS IN HALF. Burch then GRABS THE WHIP.\r\n           Hardly missing a stroke, he whips Solomon relentlessly,\r\n           the flails cutting into Solomon's back. Again, Burch's\r\n           arm tires before Solomon \"breaks.\"\r\n\r\n                          BURCH (CONT'D)\r\n           Are yah slave?\r\n\r\n                          SOLOMON\r\n           ...No...\r\n           Burch goes back to whipping and whipping, and whipping...\r\n\r\n           SOLOMON'S BACK IS NOW TORN OPEN WITH LACERATIONS AND\r\n           OOZING WITH BLOOD. Finally Burch can whip no more. He\r\n           pours sweat and sucks air, leaving himself just enough\r\n           energy to take up his instruments and EXIT. Radburn\r\n           lingers for a moment. He takes the irons off Solomon's\r\n           legs. Opens the window some. As he makes these\r\n           gestures, in a patronizing and confidential manner, one\r\n           wrought with poor sincerity::\r\n\r\n                          RADBURN\r\n           I seen a good many of the black\r\n           kind just where yah're. Sick.\r\n           Make me sick. Often times the\r\n           situation was resolved, and I\r\n           think; what was all the beatin'\r\n           and abuse for? Things end as they\r\n           should, and the violence was for\r\n           naught. So why cause trouble when\r\n           they ain't no cause for it? Be of\r\n           a cooperative nature, and things\r\n           don't need be particularly\r\n           unpleasant.\r\n\r\n                          (BEAT)\r\n           Or, yah can carry on like yah\r\n           been, and I fear yah won't live to\r\n           see Sunday next.\r\n           With that thought, Radburn exits. Solomon rests. But to\r\n           rest seems like giving in to defeat. He begins pulling\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          19.\r\n\r\n                         25 CONTINUED: (3) 25\r\n           on his chains. But for all his struggling, the chain\r\n           loosens none. Solomon calls out:\r\n\r\n                          SOLOMON\r\n           Help me! Someone help me!\r\n           If anyone at all hears him, they do not respond. Solomon\r\n           continues his plaintive cry for assistance.\r\n\r\n                         \r\n\r\n                         26 26\r\n\r\n           EXT. BURCH'S DUNGEON - CONTINUOUS\r\n\r\n           Beginning with a TIGHT SHOT on the shuttered, barred\r\n           window of Burch's dungeon - Solomon's cries barely eking\r\n           beyond the space - THE CAMERA PULLS BACK from the\r\n           building, onto the city until clearly visible is the\r\n           Nation's capital. It's icon's of freedom - the WHITE\r\n           HOUSE, the CAPITOL BUILDING - fairly mocking Solomon's\r\n           captivity. Simultaneously, barren at the early hour and\r\n           cluttered with litter and the remains of previous day's\r\n           procession, the city is a bleak and forboding sight.\r\n\r\n                         \r\n\r\n                         27 27\r\n\r\n           INT. BURCH'S DUNGEON - DAY\r\n\r\n           IT IS DAY NOW. The door to the yard is thrown open. The\r\n           harsh white light floods all over Solomon.\r\n\r\n                         \r\n\r\n                         28 OMITTED 28\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          20.\r\n\r\n                         28 CONTINUED: 28\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n          29 MOVED TO SC. A32 29\r\n\r\n          21.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          30 EXT. BURCH'S DUNGEON/YARD - DAY 30\r\n\r\n           It is a yard just beyond Burch's. The yard is hemmed in\r\n           by a brick wall. In the yard are two men, and a boy.\r\n           The oldest is CLEMENS RAY a man of about 25 years of age.\r\n           He is well educated. JOHN WILLIAMS is about 20 years\r\n           old. He is born and bred a slave, is lacking in\r\n           education, and overwhelmed with fear of the situation.\r\n           Finally there is a child about 10 years of age who\r\n           answers to the name of Randall.\r\n           Solomon, Clemens Ray, John and Randall ALL STAND NAKED.\r\n           Though they try to cover their privates a bit, they are\r\n           all aware of the uselessness of modesty. Radburn is\r\n           present. He has before him A COUPLE OF BUCKETS OF COLD\r\n           WATER. He throws water on the naked men.\r\n\r\n                          RADBURN\r\n           Go on. Warsh up.\r\n           The men, soaking in humility as well as water, begin to\r\n           scrub with A SINGLE BAR OF HARSH SOAP passed among them.\r\n\r\n                          RADBURN (CONT'D)\r\n           The boy, too. Get him clean.\r\n           Solomon takes some soap and rubs it over Randall.\r\n\r\n                          RADBURN (CONT'D)\r\n           Scrub now. Git 'em clean.\r\n           Solomon scrubs harder. Randall - clearly cold and\r\n           uncomfortable - appeals to Solomon.\r\n\r\n                          RANDALL\r\n           Do you know when my Mama will\r\n           come?\r\n\r\n                          RADBURN\r\n           Hush him up!\r\n           Seeing Solomon has no answer for him, Randall begins to\r\n           cry.\r\n\r\n                          RANDALL\r\n           Mama ..! Mama! Is she going to\r\n           come?\r\n           Doing all he can to spare the child from a certain\r\n\r\n                          BEATING:\r\n\r\n                          SOLOMON\r\n           Quiet, please.\r\n           Randall is becoming nearly inconsolable.\r\n\r\n                          RANDALL\r\n           Mama!\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          21A.\r\n\r\n                         30 CONTINUED: 30\r\n\r\n                         \r\n\r\n                         \r\n           Saying anything to keep the boy quiet:\r\n\r\n                          SOLOMON\r\n           Your mother will come, I swear she\r\n           will, but you must be silent.\r\n           Please. Be silent!\r\n           On the seeming strength of Solomon's promise, Randall\r\n           goes silent. Solomon looks to Radburn, who just throws\r\n           water on the soapy men.\r\n\r\n          22.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         31 OMITTED 31\r\n\r\n                         \r\n\r\n          A32 INT. BURCH'S DUNGEON - EVENING A32\r\n\r\n           Radburn brings food in to Solomon; a shriveled piece of\r\n           meat and some water. Just barely enough to sustain\r\n           Solomon. Radburn also has a SHIRT.\r\n\r\n                          RADBURN\r\n           That old thing of yours is just\r\n           rags and tatters. Need something\r\n           proper to wear.\r\n           Solomon doesn't move for the clothing.\r\n\r\n                          RADBURN (CONT'D)\r\n           Go'won. Put it on.\r\n           With slow defiance, Solomon does as instructed. He\r\n           removes what remains of his old shirt - the one he was\r\n           wearing when first kidnapped - and puts on the one\r\n           Radburn brought him. The shirt's ill-fitting and dirty.\r\n           Despite that, Radburn says:\r\n\r\n                          RADBURN (CONT'D)\r\n           There. Tha's fine. Tha's fine.\r\n           Got no gratitude?\r\n\r\n                          SOLOMON\r\n           ...Thank you...\r\n\r\n                          RADBURN\r\n           Yah keep bein' proper, yah'll see\r\n           how things work out.\r\n           Radburn starts to take the old shirt.\r\n\r\n                          SOLOMON\r\n           No! It was from my wife.\r\n\r\n                          RADBURN\r\n           Rags and tatters. Rags and\r\n           tatters.\r\n           Taking the shirt, the \"rags and tatters\" as he calls\r\n           them, Radburn exits, locking the door behind him.\r\n           Solomon sits with the plate of food before him. He\r\n           pushes the plate away rather than eat.\r\n\r\n                         \r\n\r\n                         32 32\r\n\r\n           EXT. BURCH'S DUNGEON/YARD - DAY\r\n\r\n           Sitting together out in the yard are Clemens Ray, John\r\n           and Solomon. Over time they have drawn trustworthy\r\n           enough to speak with one another. At the moment Solomon\r\n           is still trying to apply reason to the situation.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          22A.\r\n\r\n                         32 CONTINUED: 32\r\n           Randall wanders about in the background. As usual, he\r\n           calls out for his \"Mama.\" By now, however, his calls\r\n           should feel like little more than background noise.\r\n\r\n                          SOLOMON\r\n           This can't stand. It is a crime.\r\n           I believe now someone lay in wait\r\n           for me. My drink was altered...\r\n           We are free men. They have...they\r\n           have no right to hold us.\r\n           Solomon waits for a response from the others. They give\r\n           none.\r\n\r\n                          SOLOMON (CONT'D)\r\n           We need a sympathetic ear. If we\r\n           have an opportunity to explain our\r\n\r\n                          SITUATION--\r\n\r\n                          CLEMENS\r\n           Who in your estimation is that\r\n           sympathetic ear?\r\n\r\n                          SOLOMON\r\n           The two men I journeyed with. I'm\r\n           certain they're making inquires at\r\n           this very moment.\r\n\r\n                          CLEMENS\r\n           I would be just as certain they\r\n           are counting the money paid for\r\n           delivering you to this place.\r\n\r\n                          SOLOMON\r\n           They were not kidnappers. They\r\n           were artists. Fellow performers.\r\n\r\n                          CLEMENS\r\n           You know that? You know for\r\n           certain who they were?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          23.\r\n\r\n                         32 CONTINUED: (2) 32\r\n           The fact is, Solomon can't say for certain.\r\n\r\n                          CLEMENS (CONT'D)\r\n           How I reckon the situation:\r\n           whatever past we had...well,\r\n           that's done now. The reality to\r\n           come is us being transported\r\n           southward. New Orleans if I were\r\n           to venture. After we arrive,\r\n           we'll be put to market. Beyond\r\n           that... Well, once in a slave\r\n           state I suppose there's only one\r\n           outcome.\r\n\r\n                          JOHN\r\n           No.\r\n\r\n                          CLEMENS\r\n           I don't say that to give you empty\r\n           agitation, John...\r\n\r\n                          JOHN\r\n           For y'all. For y'all they ain't\r\n           nothin' but that! But John was'n\r\n           kidnapped. John bein' hold as\r\n           debt, tha's all. Massa pay his\r\n           debt, and John be redeemed--\r\n\r\n                          CLEMENS\r\n           Boy, our masters will not come for\r\n           us.\r\n           John is nearly beside himself with panic.\r\n\r\n                          JOHN\r\n           Now John's...John's sorry for\r\n           y'all, but tha's how it be. Where\r\n           y'all goin', yah goin' witout\r\n           John. Massa take care of me.\r\n           Massa take care.\r\n\r\n                          RANDALL\r\n           Mama!\r\n           All three men turn and look. At the moment Randall\r\n           doesn't call out emptily. At the door to the yard is\r\n           Burch along with two women. One in her late twenties;\r\n           ELIZA. She is \"arrayed in silk, with rings upon her\r\n           fingers, and golden ornaments suspended from her ears.\"\r\n           Though a slave, Eliza was a mistress and has - to this\r\n           point - lived well. This is reflected in her airs and\r\n           her speech. The other is a little girl, light in skin\r\n           color, of about seven or eight. This is EMILY, Randall's\r\n           half sister.\r\n           As she enters the yard Eliza squeals with high delight,\r\n           then breaks into tears of both sorrow and joy. Clearly\r\n           this is mother and child being reunited.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          24.\r\n\r\n                         32 CONTINUED: (3) 32\r\n           As Burch locks the yard door, Eliza clutches Randall.\r\n           She is overcome with emotion.\r\n\r\n                          ELIZA\r\n           My darling. My sweet, sweet baby.\r\n\r\n                         \r\n\r\n                         33 33\r\n\r\n           INT. BURCH'S DUNGEON - EVENING\r\n\r\n           Later in the evening. Solomon now shares his space with\r\n           Eliza and her children. As the children rest, Eliza\r\n           drops into a lament as if pleading her case to Solomon\r\n           who lends a sympathetic ear.\r\n\r\n                         \r\n\r\n                         \r\n           Both slyly, and with a bit of aggrandizement:\r\n\r\n                          ELIZA\r\n           When I say I had my master's\r\n           favor, you understand. Above even\r\n           his own wife, I had it. Do you\r\n           know that he built a house for me?\r\n           Built it on the sole condition\r\n           that I reside there with him. The\r\n           added promise in time I would be\r\n           emancipated. And for nine years\r\n           he blessed me with every comfort\r\n           and luxury in life.\r\n           Displaying the finery she still wears:\r\n\r\n                          ELIZA (CONT'D)\r\n           Silks and jewels and even servants\r\n           to wait upon us. Such was our\r\n           life, and the life of this\r\n           beautiful girl I bore for him.\r\n           But Master Berry's daughter...she\r\n           always looked at me with an unkind\r\n           nature. She hated Emily no matter\r\n           she and Emily were flesh of flesh.\r\n           As Master Berry's health failed,\r\n           she gained power in the household.\r\n           Eventually, I was brought to the\r\n           city on the false pretense of our\r\n           free papers being executed. If I\r\n           had known what waited; to be sent\r\n           south? I swear I would not have\r\n           come here alive.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          25.\r\n\r\n                         33 CONTINUED: 33\r\n           Eliza turns to her children:\r\n\r\n                          ELIZA (CONT'D)\r\n           My poor, poor babies.\r\n\r\n                         \r\n\r\n          34 INT. BURCH'S DUNGEON - NIGHT 34\r\n\r\n           It's the deep of night, all are sleeping. A KEY TURNS IN\r\n           THE LOCK AND THE DOOR OPENS. Burch enters with Radburn\r\n           beside him. Both carry LANTERNS with them. Hardly\r\n           giving Solomon and Eliza a moment to rouse themselves,\r\n\r\n                          BURCH DEMANDS:\r\n\r\n                          BURCH\r\n           Come on. Get yer blankets. Get\r\n           up.\r\n           Sensing that things will not end well:\r\n\r\n                          ELIZA\r\n           No, please don't...\r\n\r\n                          BURCH\r\n           I don't want to hear yer talk.\r\n           Get in the yard.\r\n\r\n                          ELIZA\r\n           Please...\r\n\r\n                          RADBURN\r\n           Ain't no need for all that.\r\n           Putting hand to Randall's head.\r\n\r\n                          RADBURN (CONT'D)\r\n           Jus takin' a li'l trip, tha's all.\r\n           Don't want to frighten the\r\n           chil'ren none over a li'l boat\r\n           ride, do yah?\r\n           Eliza gives a shake of her head to the negative.\r\n\r\n                          RADBURN (CONT'D)\r\n           Alright then. Git yerselves up.\r\n\r\n                         \r\n\r\n                         35 35\r\n\r\n           EXT. BURCH'S DUNGEON/YARD - NIGHT\r\n\r\n           We now have Solomon, Clemens, John, Eliza and the\r\n           children. They are being cuffed together. As John is\r\n           cuffed, he pulls back. Scared. He beings in\r\n\r\n                          DESPERATION:\r\n\r\n                          JOHN\r\n           John's massa gunna pay his debt.\r\n           John's massa gunna come for him.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          26-28.\r\n\r\n                         35 CONTINUED: 35\r\n           Not wanting to hear any of this talk, Burch strikes John\r\n           several times in the head with a sap-like instrument.\r\n           Weakened, but again:\r\n\r\n                          JOHN (CONT'D)\r\n           John's massa gunna--\r\n           Burch again strikes John until he's quiet. Curiously,\r\n           Emily and Randall don't even flinch. Why would they?\r\n           They are quite used to seeing this kind of violence.\r\n\r\n                          BURCH\r\n           Not a word out of none a yah. Not\r\n           a word.\r\n           Burch and Radburn begin driving the shackled slaves from\r\n           the yard.\r\n\r\n                         \r\n\r\n                         A36 A36\r\n\r\n           EXT. BURCH'S DUNGEON/INT. WAGON/FLAT BED - LATER\r\n\r\n           The slaves are lead to a flat bed of the horse and\r\n           carriage. They are made to lay down side-by-side. We stay\r\n           with them as some sort of cloth is flung over them,\r\n           obscuring and blacking out their view.\r\n           At that moment, the screen is BLACKENED and we hear the\r\n           sound of the cart moving in haste.\r\n\r\n                         \r\n\r\n                         36 36\r\n\r\n           EXT. WASHINGTON, D.C. DOCK - NIGHT\r\n\r\n           Led by Burch, the group of slaves arrive to a dock. They\r\n           are taken quickly up a gangplank and onto the steamboat\r\n           ORLEANS as the CAPTAIN, CREW and a MULATTO WOMAN WATCH,\r\n           but do not interfere.\r\n\r\n                         \r\n\r\n                         37 37\r\n\r\n           INT. ORLEANS/HOLD - CONTINUOUS\r\n\r\n           The slaves are hustled down one at a time into a dark,\r\n           dank hold among barrels and boxes of freight...and RATS.\r\n           Burch comes around and \"checks\" the chains; makes sure\r\n           they are all secure and locked.\r\n           Satisfied, he heads up out of the hold. Radburn follows.\r\n           Alone in the dark in the hold, John cries, as does Eliza.\r\n           Solomon stares down Burch for as long as he can, as if\r\n           wishing bad things. As if wanting to exact some measure\r\n           of revenge. But the greater insult is that Burch and\r\n           Radburn, engaged in conversation, take no notice of\r\n           Solomon whatsoever. He is that insignificant to them.\r\n           That fact, that reality, makes Solomon boil with a rage\r\n           he cannot express in words.\r\n\r\n                         \r\n\r\n                         38 38\r\n\r\n                          OMIT\r\n\r\n          26-28A.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          38A INT. STEAMBOAT - NIGHT 38A \r\n\r\n           We are now in the engine room of the steamboat, pistons \r\n           pumping, black oily cogs turning, the power and the \r\n           rhythm are both aggressive and hypnotic. A shovel comes \r\n           into view, feeding the furnace. \r\n\r\n                         \r\n\r\n          38B EXT. SEA - DUSK/DAWN 38B \r\n\r\n           The steamboat is en route between Washington and Norfolk. \r\n           We tilt up from the violent water foam to the powering \r\n           paddles of the boat. \r\n\r\n                         \r\n\r\n          39 MOVED TO 43A 39 \r\n\r\n          29.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         40 OMIT 40 \r\n\r\n                         \r\n\r\n                         41 OMIT 41\r\n\r\n                         \r\n\r\n                         42 OMIT 42\r\n\r\n                         \r\n\r\n          43 INT. ORLEANS/HOLD - LATER - NIGHT 43 \r\n\r\n           Down in the hold the slaves eat, pray. The MULATTO WOMAN\r\n           moves among them, catching ELIZA's eye.\r\n\r\n                          MULATTO WOMAN\r\n           Cheer up and don't be so cast\r\n           down.\r\n\r\n                          \r\n           Clemens Ray and Solomon watch as the Mulatto Woman\r\n           returns to top deck, the trapdoor locked firmly behind \r\n           her. Clemens Ray turns to Solomon with a deadpan stern \r\n           expression. \r\n\r\n                          CLEMENS RAY \r\n           If you want to survive, do and say \r\n           as little as possible. Tell no \r\n           one who you really are and tell no \r\n           one that you can read and write. \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           30.\r\n\r\n                         43 CONTINUED: 43\r\n           Clemens Ray turns away from Solomon, eyes lost into the \r\n           distance. \r\n\r\n           CLEMENS RAY (CONT'D) \r\n\r\n                          (SLOWLY) \r\n           Unless you want to be a dead \r\n           nigger. \r\n           Solomon's face is one of a confused despair. \r\n\r\n                         \r\n\r\n          43A EXT. NORFOLK/PORT - DAY 43A \r\n\r\n           We see a flat overhead view of the port of Norfolk. \r\n           Sardines are laid out to dry in rows, glittering in the \r\n           day's sun as if like silver pennies. A chain of slaves \r\n           enter the frame and are led one by one on to the docked \r\n           vessel. \r\n           MORE SLAVES - about 15 in all, of various genders and \r\n           ages - are brought on board. Chief among them is ROBERT \r\n           who fights viciously with his captors. \"With all haste\" \r\n           is shoved down into the hold. \r\n           Having taken their cargo as far as they care or need to, \r\n           Burch and Radburn depart. They do so without a word \r\n           spoken to Solomon or the others. \r\n           With this new and sizable batch of slaves on board, the \r\n           crew again CASTS OFF, and the Orleans makes its way \r\n           again. \r\n\r\n                         \r\n\r\n          44 INT. ORLEANS/GALLEY 44\r\n\r\n           Solomon is back cleaning in the galley. As he cleans, he\r\n           again watches Robert prep food. Robert's skill with a\r\n           knife is not lost on Solomon.\r\n\r\n                         \r\n\r\n          45 INT. HOLD - LATER - DAY 45 \r\n\r\n           The hold is packed tighter now. \r\n           Muzzle covering his face, Robert is shackled with his \r\n           hands tied behind his back. Solomon and Clemens Ray look \r\n           on. \r\n           A sailor descends the staircase and takes off Robert's \r\n           muzzle, shooting him a forbidding look. He leaves. \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           31.\r\n\r\n                         45 CONTINUED: 45\r\n\r\n                          CUT TO: \r\n           Solomon, Clemens Ray and Robert, now in mid-conversation. \r\n\r\n                          ROBERT \r\n           I say we fight. \r\n           Robert delivers this in a hushed voice. \r\n\r\n                          SOLOMON \r\n           The crew is fairly small. If it \r\n           were well planned, I believe \r\n           they could be strong armed. \r\n\r\n                          CLEMENS RAY \r\n           Three can't stand against a whole \r\n           crew. The rest here are niggers, \r\n           born and bred slaves. Niggers \r\n           ain't got the stomach for a fight, \r\n           not a damn one. \r\n\r\n                          ROBERT \r\n           All I know, we get where we \r\n           travelling we'll wish we'd died \r\n           trying. \r\n\r\n                          CLEMENS RAY \r\n           Survival is not about certain \r\n           death, it is about keeping your \r\n           head down. \r\n           Solomon looks at Clemens Ray, agitated -- his voice now \r\n           raised above the previous whispers. Grits his teeth. \r\n\r\n                          SOLOMON \r\n           Days ago I was with my family, in \r\n           my home. Now you tell me all is \r\n           lost. \"Tell no one who I really \r\n           am\" if I want to survive. I don't \r\n           want to survive, I want to live. \r\n\r\n                         \r\n\r\n                         46 OMIT 46 \r\n\r\n                         \r\n\r\n                         47 OMIT 47 \r\n\r\n                         \r\n\r\n          47A EXT. SEA - DAY 47A \r\n\r\n           The steamboat paddles pound the water, filling the whole \r\n           frame. The vessel ploughs on south. \r\n\r\n          32.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         48 OMIT 48 \r\n\r\n                         \r\n\r\n          48A INT. HOLD - NIGHT 48A \r\n\r\n           The slaves are asleep. \r\n           A Sailor descends the ladder approaching Eliza. He bends \r\n           down and attempts to wake the daughter by caressing her \r\n           face. \r\n           Solomon rouses, and looks across to witness the scene. \r\n           From his vantage point, we see Eliza stand to interrupt \r\n           the Sailor. The Sailor looks at Eliza, Eliza looks back \r\n           at him. Knowingly she leads him off into a corner of the \r\n           hold. \r\n           As she does so, Eliza passes Robert who jumps up to stand \r\n           between Eliza and the Sailor. Stretching out a firm hand \r\n           to the sailor's shoulder, Robert's look says \"No you \r\n           don't.\" \r\n           Clemens Ray is awake now, watching. \r\n           There is an odd moment of stillness between the Sailor \r\n           and Robert, an impasse. \r\n           We focus on the Sailor's face. Slowly, a greasy smile \r\n           erupts upon it. Back now to Robert's face, a look of \r\n           incomprehension. \r\n           Robert looks down. We follow his gaze to the knife that \r\n           has already been jabbed unseen between Robert's ribs. \r\n           The sailor withdraws the bloody blade. \r\n           A wide shot of the two men. Robert collapses to the \r\n           floor like a sack of potatoes. \r\n           Clemens Ray and Solomon react. Complete horror. \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         49 OMIT 49 \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         50 OMIT 50 \r\n\r\n          33.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          51 EXT. ORLEANS/DECK - DAY 51 \r\n\r\n           We are back up on the deck of the ship. SOLOMON AND \r\n           CLEMENS RAY dump ROBERT's body over the side of the ship. \r\n           Solomon watches as the body churns for a moment in the\r\n           wake of the vessel... then sinks beneath the water. \r\n           Clemens Ray, with no sentimentality:\r\n\r\n                          CLEMENS RAY \r\n           Better off. Better than us. \r\n\r\n                         \r\n\r\n          51A EXT. NEW ORLEANS HARBOUR - DAY 51A \r\n\r\n           Solomon's POV from the back of the steamship of Robert's \r\n           corpse slipping gracefully into the water. \r\n\r\n                         \r\n\r\n          52 EXT. NEW ORLEANS/PORT - DAY 52\r\n\r\n\r\n           -MID MAY, 1841-\r\n           A white male, fairly smart, with broad shoulders, stands\r\n\r\n                          AND BELLOWS-\r\n\r\n                          RAY\r\n           Clemens...! Clemens Ray!\r\n           We are in the port of New Orleans, one of the busiest in\r\n           the young nation.\r\n           On the dock itself there is a bustle of activity as goods\r\n           are loaded and unloaded from a various ships. It's a bit\r\n           of controlled chaos as a VARIETY OF LANGUAGES are spoken\r\n           and shouted while slaves are shuttled from the Orleans to\r\n           a holding pen. Solomon, and all the slaves are\r\n           overwhelmed by all that is happening around them.\r\n           Two men - among many - are awaiting the arrival of the\r\n           Orleans. They are JONUS RAY - Clemens Ray's master - and\r\n           DAVIS who is the solicitor of Mr. Ray. They both look\r\n           like they mean business. The moment the gangplank is\r\n           laid, Ray yells for Clemens.\r\n           Clemens, seeing his master, is nearly crazy with delight.\r\n           He is, uncharacteristically beside himself. Ironically,\r\n           his master now represents \"freedom.\"\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          34.\r\n\r\n                         52 CONTINUED: 52\r\n\r\n                          CLEMENS\r\n           ...My master... Master Ray, sir!\r\n           Master Ray!\r\n           Clemens pulls on his chain. As he does so, Several other\r\n           slaves collapse in his effort to reach his master, like\r\n           dominos.\r\n\r\n                          RAY\r\n           Who is in charge of this vessel?\r\n\r\n                          CAPTAIN\r\n           I am the Captain.\r\n\r\n                          RAY\r\n           I am Mr. Jonus Ray. My solicitor\r\n           has documentation verifying that\r\n           the Negro named Clemens Ray is my\r\n           property.\r\n           As he reads PAPERS handed to him by Davis:\r\n\r\n                          CAPTAIN\r\n           I know nothing of--\r\n\r\n                          RAY\r\n           You are ordered by court to return\r\n           that property immediately, or face\r\n           charges of thievery.\r\n\r\n                          CAPTAIN\r\n           My duty is to transport goods. I\r\n           am not responsible for their\r\n           origin.\r\n\r\n                          RAY\r\n           Remove these contraptions!\r\n           To his mate:\r\n\r\n                          CAPTAIN\r\n           Free him!\r\n           Biddee does as ordered. Once free, Clemens hugs and sobs\r\n           over his master as would a lost and then found child.\r\n\r\n                          RAY\r\n           It's all well, now, Clemens. You\r\n           will return home with me.\r\n           (to the Captain)\r\n           Consider this notice and warning.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          35.\r\n\r\n                         52 CONTINUED: (2) 52\r\n           Ray, Davis and Clemens head away. Solomon seems both\r\n           desperate and hopeful of some aid from Clemens and Ray.\r\n           But there is none forthcoming. Ray and Clemens continue\r\n           on - Clemens not so much as even looking back in\r\n           Solomon's direction. Solomon stands and watches as they\r\n           fade into the environs and are gone from sight.\r\n\r\n                         \r\n\r\n                         53 53\r\n\r\n           EXT. NEW ORLEANS/PORT - LATER\r\n\r\n           Hours later. The slaves sit off on one side of the dock,\r\n           baking in the sun, awaiting their fate.\r\n           THEOPHILUS FREEMAN - a tall, thin-faced man with light\r\n           complexion and a little bent - moves along the deck\r\n           calling out names from a list. The slaves STAND as they\r\n           are called.\r\n\r\n                          FREEMAN\r\n           Oren. John. Lethe. Eliza.\r\n           Randall. Emily. Platt... Platt!\r\n           Solomon does not respond. Freeman looks around. He\r\n           spots Solomon.\r\n\r\n                          FREEMAN (CONT'D)\r\n           Captain, who shipped that nigger?\r\n\r\n                          CAPTAIN\r\n           Burch.\r\n           Freeman steps to Solomon. He gives him a looking over.\r\n\r\n                          FREEMAN\r\n           Stand up.\r\n           Solomon does as told.\r\n\r\n                          FREEMAN (CONT'D)\r\n           You fit the description given.\r\n           Why didn't you answer when called?\r\n\r\n                          SOLOMON\r\n           My name is not Platt. My name is--\r\n           Freeman strikes Solomon hard across the face.\r\n\r\n                          FREEMAN\r\n           Your name is Platt, and I will\r\n           teach you your name so that you\r\n           don't forget.\r\n           (to the Captain)\r\n           Shackle my niggers. Get them to\r\n           my cart.\r\n\r\n          36.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          54 I/E. CART - LATER 54\r\n           Solomon is carted off along with the rest of \"Burch's\r\n           stock:\" Eliza and her children, John and Solomon.\r\n           As they move off from the port in a make-shift cart, it\r\n           opens up to the frenzic, busy port.\r\n           For the first time Solomon sees true and severe slavery.\r\n           These are not visiting servants, such as Jasper was back\r\n           in Saratoga. These are humans held in strict bondage -\r\n           herded like cattle, chained together as if in a \"chain\r\n           gang.\" Slaves are evident not merely by the color of\r\n           their skin. The residue and accessories of slavery are\r\n           everywhere. Blacks almost universally display scars -\r\n\r\n           THICK AND HEAVY DEAD TISSUE FROM LACERATIONS LEFT\r\n           UNTREATED - brands, and are often missing limbs. Blacks\r\n           are held in all types of shackles, from simple chains to\r\n           elaborate bindings, to neck collars that are spiked.\r\n           Some are muzzled or forced to wear bits. One slave is\r\n           attacked by a dog and the slave owner. The dog pulls and\r\n           tears at the slave's clothes. THESE IMAGES SHOULD BE A\r\n\r\n           CONSTANT AND CONTINUAL CANVAS TO THE PIECE. EVER\r\n\r\n           PRESENT, BUT NOT REALLY COMMENTED ON AS THEY ARE THE\r\n           NORM. They should be a reminder that not only are people\r\n           being oppressed, but that there is an entire system of\r\n           oppression in place.\r\n\r\n                         \r\n\r\n                         55 55\r\n\r\n           EXT. FREEMAN'S SLAVE PEN - LATER\r\n\r\n           \"Burch's stock:\" arrive at Freeman's slave pen. They are\r\n           led in by Freeman and his house slave CAPE - a mulatto.\r\n           The yard is enclosed by plank, standing upright, with\r\n           ends sharpened instead of brick walls as with Burch's.\r\n           Including Burch's group there are about 30 SLAVES in the\r\n           pen.\r\n           Solomon and the others look around and see nothing but\r\n           downtrodden and despondent faces. Three men sit next to\r\n           each other with muzzles and quietly stare back at this\r\n           new batch of arrivals. One attempts to speak, but all\r\n           that comes out is a muffled, unintelligible sound.\r\n\r\n                         \r\n\r\n                         56 56\r\n\r\n           EXT. FREEMAN'S SLAVE PEN - LATER\r\n\r\n           The slaves are in various states of undress, men and\r\n           women alike. They clean themselves, scrubbing with soap\r\n           and water. Women wash their hair. Men shave, skin is\r\n           oiled. Freeman walks among them, inspecting them as they\r\n           primp themselves.\r\n\r\n                         \r\n\r\n                         57 57\r\n\r\n           INT. FREEMAN'S SLAVE PEN - LATER\r\n\r\n           The slaves are given new clothes by Cape. The men are\r\n           given hat, coat, shirt, pants and shoes. The women\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          37.\r\n\r\n                         57 CONTINUED: 57\r\n           frocks of calico and handkerchiefs to bind about their\r\n           heads.\r\n\r\n                         \r\n\r\n          58 INT. FREEMAN'S/GREAT ROOM - LATER 58\r\n\r\n           It's an odd, ironic scene. The slaves are in a large and\r\n           fairly ornate room within Freeman's house. CAPE PLAYS A\r\n           PAINFUL TUNE ON A FIDDLE - background music - as Freeman\r\n           tries to line up A SMALL GROUP OF THE SLAVES, he becomes\r\n           less patient, jittery and nervous, knowing that his\r\n           livelihood is at stake, he wants his slaves to make a\r\n           good impression. Sometimes his patience gets the better\r\n           of him, and his hands move freely in direction of the\r\n           slaves.\r\n           The business has the air of an etiquette class, though\r\n           what Freeman is trying to do is coach the slaves into\r\n           being more \"sellable.\" He works with them in groups of\r\n           five or so.\r\n\r\n                          FREEMAN\r\n           Tallest to smallest, understand?\r\n           Are you taller than her? Then\r\n           you'd go before her. Do it.\r\n           Move.\r\n           (to the group)\r\n           Keep your heads up. A sense of\r\n           direction; that's how you look\r\n           smart. None of those saucer eyes.\r\n           Rid yourself of that smile. Look\r\n           like a goddamn grinnin' monkey.\r\n           Put the least thought in your\r\n           head. C'mon, now. Think of\r\n           somethin'.\r\n           Weary of Cape's playing, Solomon moves to Cape. He asks:\r\n\r\n                          SOLOMON\r\n           Can you play a reel?\r\n\r\n                          CAPE\r\n\r\n                          (DISMISSIVE)\r\n           Nah. I don't know no reel.\r\n\r\n                          SOLOMON\r\n           If I may...?\r\n           Cape looks to Freeman:\r\n\r\n                          FREEMAN\r\n           He sick of your caterwaulin'. Let\r\n           him play, boy. Let's see what he\r\n           can do.\r\n           Cape reluctantly hands the fiddle over to Solomon.\r\n           Solomon tunes it a bit, then begins to play. His fingers\r\n           stiff at first, he takes a moment to warm up. But as he\r\n           warms up he is, despite the circumstances, masterful.\r\n\r\n                          (CONTINUED)\r\n\r\n          38.\r\n\r\n                         58 CONTINUED: 58\r\n           THE SLAVES ALL CLAP ALONG. SOME DANCE ALONG. All admire\r\n           his work. Freeman chief among them.\r\n\r\n                          FREEMAN (CONT'D)\r\n           Keep on. Keep on.\r\n           Solomon continues to play.\r\n\r\n                          FREEMAN (CONT'D)\r\n           A damn sight better than you,\r\n           Cape. A damn sight better.\r\n           Cape looks bitter as Solomon plays on.\r\n\r\n                         \r\n\r\n                         59 59\r\n\r\n           INT. FREEMAN'S/GREAT ROOM - DAY\r\n\r\n           We come in on an odd sort of sight; A JUMBLE OF ACTIVITY.\r\n           CUSTOMERS have come to see Freeman's lot - the room all\r\n           gussied up with flowers. Freeman moves among them,\r\n           displaying them as a rancher would prize chattel.\r\n           Freeman makes the slaves hold their heads up - \"look\r\n           smart\" as he previously admonished them. They are made\r\n           to walk briskly back and forth while customers feel their\r\n           hands and arms and bodies, turn them about and ask what\r\n           skills they possess. The Customers routinely make the\r\n           slaves open their mouths and show their teeth.\r\n           At times a MALE or FEMALE SLAVE are taken off to the\r\n           side, stripped and inspected more minutely.\r\n           One of them, John, is stripped and inspected.\r\n           Cape, as he's done previously, plays his fiddle.\r\n           A buyer - WILLIAM FORD; a man of middle age, and an\r\n           attractive nature in his tone of voice - consults a list\r\n           he's drawn up and asks of Freeman:\r\n\r\n                          FORD\r\n           What is the price for the ones\r\n           Platt and Eliza?\r\n\r\n                          FREEMAN\r\n           A thousand for Platt; he is a\r\n           nigger of talent. Seven hundred\r\n           for Eliza. My fairest price.\r\n\r\n                          FORD\r\n           You will accept a note?\r\n\r\n                          FREEMAN\r\n           As always, from you, Mr. Ford.\r\n           Eliza is beside herself as it seems she is about to be\r\n           separated from her family. She begs of Ford:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          39.\r\n\r\n                         59 CONTINUED: 59\r\n\r\n                          ELIZA\r\n           Please, sir... Please don't\r\n           divide my family. Don't take me\r\n           unless you take my children as\r\n           well.\r\n\r\n                          FREEMAN\r\n           Eliza, quiet!\r\n\r\n                          ELIZA\r\n           You will have the most faithful\r\n           slave in me, sir. The most\r\n           faithful slave that has ever\r\n           lived, but I beg that you do not\r\n           separate us.\r\n           A BUYER interrupts the skirmish and approaches Freeman\r\n           and delivers coolly, eyeing Randall-\r\n\r\n                          BUYER\r\n           Your price for the child?\r\n\r\n                          FREEMAN\r\n           You see how fit the boy is. Like\r\n           ripe fruit. He will grow into a\r\n           fine beast.\r\n           Randall is made to run, and jump by FREEMAN - exhibiting\r\n           his activity and his condition.\r\n\r\n                          FREEMAN (CONT'D)\r\n           Six hundred, and that's fair and\r\n           final.\r\n\r\n                          BUYER\r\n           Done.\r\n           He reaches into his waistcoat and retrieves his wallet,\r\n           counting out six hundred dollars, placing them into the\r\n           already extended hand of Freeman.\r\n           Ford sees the distress and panic in Eliza; it visibly\r\n           touches him. He now tries to buy EMILY to console her.\r\n\r\n                          FORD\r\n           How much for the little girl? You\r\n           have no need for her. One so\r\n           young will bring you no profit.\r\n\r\n                          FREEMAN\r\n           I will not sell the girl. There's\r\n           heaps 'n piles of money to be made\r\n           off her. She is a beauty. One of\r\n           the regular bloods. None of your\r\n           thick-lipped, bullet headed,\r\n           cotton picking niggers.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          39A.\r\n\r\n                         59 CONTINUED: (2) 59\r\n\r\n                          FORD\r\n           Her child, man. For God's sake,\r\n           are you not sentimental in the\r\n           least?\r\n\r\n                          FREEMAN\r\n           My sentimentality stretches the\r\n           length of a coin. Do you want the\r\n           lot, Mr. Ford, or do you pass on\r\n           them all?\r\n\r\n                          FORD\r\n           I will take the ones Platt and\r\n           Eliza.\r\n           Eliza grips her children tight.\r\n\r\n                          ELIZA\r\n           I will not go without my children.\r\n           You will not take them from me.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          40.\r\n\r\n                         59 CONTINUED: (3) 59\r\n           As if to prove her wrong, Freeman puts a foot to Eliza\r\n           and harshly kicks her away from Emily.\r\n\r\n                          ELIZA (CONT'D)\r\n           Please, don't. No!\r\n           Freeman, to Cape:\r\n\r\n                          FREEMAN\r\n           Take her out of here.\r\n           Cape DROPS HIS FIDDLE, begins to pull Eliza away toward\r\n           the door of the room, but her screaming and pleading do\r\n           not abate. IT IS CLEARLY UNSETTLING TO THE OTHER BUYERS.\r\n\r\n                          FREEMAN (CONT'D)\r\n           Keep her quiet.\r\n           Cape tries to muzzle her with his hand, but Eliza\r\n           continues to scream for her children as Emily does for\r\n           her mother.\r\n\r\n                          EMILY\r\n           Mama... Mama!\r\n\r\n                          FREEMAN\r\n\r\n                          (TO SOLOMON)\r\n           Play something! Get the fiddle\r\n           and play.\r\n           As ordered, Solomon takes up Cape's fiddle and begins to\r\n           play lightly.\r\n\r\n                          FREEMAN (CONT'D)\r\n           Play!\r\n           Solomon plays harder and more loudly. Still, it is\r\n           barely enough to drown out Eliza's cries. Freeman gets\r\n           the other slaves to clap along with Solomon's playing.\r\n           Emily frees herself and runs back, crying but endeavoring\r\n           to be strong-\r\n\r\n                          EMILY\r\n           Don't cry, Mama. I will be a good\r\n           girl. Don't cry. I will keep my\r\n           head up and I will look smart. I\r\n           will always look smart.\r\n\r\n                          FREEMAN\r\n           Make merry, all of you! Goddamn\r\n           it, Cape! Keep her quiet or it's\r\n           your damned hide I will take it\r\n           out of!\r\n           Cape pulls a rag, stuffs it in Eliza's mouth. Clamping\r\n           both hands over her mouth, he hauls Eliza from the room\r\n           by the head. IT IS AN UGLY, UGLY SCENE.\r\n\r\n          40A.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          60 EXT. FORD PLANTATION - LATER 60\r\n\r\n           Driven in a horse drawn wagon by Ford are Solomon and\r\n           Eliza. Eliza is sullen to say the least. With the loss\r\n           of her two children she has dropped into a depression she\r\n           will not be able to pull out of.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          41.\r\n\r\n                         60 CONTINUED: 60\r\n           They arrive to the FORD PLANTATION. The main house of\r\n           the plantation - the GREAT HOUSE as they are commonly\r\n           called - is sizable. Two stories high with a piazza in\r\n           front. In the rear are also a log kitchen, poultry\r\n           house, corncribs and several slave cabins. The\r\n           plantation is described as \"a green spot in the\r\n           wilderness.\"\r\n           With the arrival of Master Ford there is a flurry of\r\n           activity - the \"excitement\" of a new delivery. MR.\r\n           CHAPIN, a white overseer, instructs a slave named SAM.\r\n\r\n                          CHAPIN\r\n           Sam, call to the Mistress.\r\n\r\n                          SAM\r\n           Mistress! Mistress, they arrivn'.\r\n           MISTRESS FORD EXITS the house - along with her attending\r\n           slave, RACHEL, who is a cook AS WELL AS SAM'S WIFE - and\r\n           travels to her husband, kisses him, then laughingly\r\n\r\n                          INQUIRES:\r\n\r\n           MRS. FORD\r\n           Did you bring all those niggers?\r\n           Two of them? You got two?\r\n\r\n                          FORD\r\n           Make me something to eat, dear.\r\n           The day has taken it from me.\r\n\r\n           MRS. FORD\r\n           Let me get a look at them...\r\n\r\n                          FORD\r\n           Mr. Chapin--\r\n\r\n           MRS. FORD\r\n\r\n                          (RE: ELIZA)\r\n           This one's cryin'. Why is this\r\n           one cryin'?\r\n\r\n                          FORD\r\n           Separated from her children.\r\n\r\n           MRS. FORD\r\n           Oh, dear.\r\n\r\n                          FORD\r\n           It couldn't be helped.\r\n\r\n           MRS. FORD\r\n           Poor, poor woman.\r\n\r\n                          FORD\r\n           Mr. Chapin, tomorrow you will take\r\n           these two up to the mill and start\r\n           them workin'. For now make them\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          42.\r\n\r\n                         60 CONTINUED: (2) 60\r\n\r\n                          FORD (CONT'D)\r\n           adequate; fix them a meal, and\r\n           have them rest themselves.\r\n\r\n                          CHAPIN\r\n           Yes, sir.\r\n           (to the slaves:)\r\n           C'mon, now. C'mon. Don't dawdle.\r\n\r\n           MRS. FORD\r\n\r\n                          (TO ELIZA:)\r\n           Something to eat and some rest;\r\n           your children will soon enough be\r\n           forgotten.\r\n\r\n                         \r\n\r\n          A61A A61A \r\n\r\n           EXT. FORD'S WORK AREA - DAY\r\n\r\n           John Tibeats, stands before the slaves. Chapin hovers to \r\n           one side. \r\n\r\n                          TIBEATS \r\n           My name is John Tibeats, William \r\n           Ford's chief carpenter. You will \r\n           refer to me as Master. \r\n           Tibeats nods in Chapin's direction: \r\n\r\n                          TIBEATS (CONT'D) \r\n           Mister Chapin is the overseer on \r\n           this plantation. He is \r\n           responsible for all of Ford's \r\n           property. You too will refer to \r\n           him as Master. \r\n           This plantation covers many \r\n           hundreds of acres, and you will \r\n           traverse the Texas road between \r\n           the forest site and the sawmill in \r\n           double time. Any clever nigger on \r\n           that path that gets a little \r\n           lightfooted, I will remind him \r\n           that on one side men and \r\n           bloodhounds patrol the border and \r\n           on the other the bayou provides a \r\n           hard living, with alligators and \r\n           little to eat or drink that won't \r\n           kill you. No slave has escaped \r\n           here with his life. You're here \r\n           to work niggers, so let's \r\n           commence. \r\n           Tibeats begins to sing the song \"Run Nigger, Run\" \r\n           mockingly. \r\n           We cut to Solomon chopping logs and into the montage of \r\n           the slaves doing manual labor and arriving back to the \r\n           sawmill. \r\n           Lyrics for \"Run Nigger, Run\" \r\n\r\n                          (CONTINUED)\r\n\r\n          42A.\r\n\r\n          A61A CONTINUED: A61A\r\n           Oh run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Nigger run nigger flew \r\n           Nigger tore his shirt in two \r\n           Run run the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Nigger run, run so fast \r\n           Stoved his head in a hornets nest \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Nigger run through the field \r\n           Black slick coal and barley heel \r\n           Run nigger run the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Some folks say a nigger won't steal \r\n           I caught three in my corn field \r\n           One has a bushel? And one has a peck \r\n           One had a rope and it was hung around his neck \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Oh nigger run and nigger flew \r\n           Why in the devil can't a white man chew \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n           Hey Mr. Pattyroller don't catch me \r\n           Catch that nigger behind that tree \r\n           Run nigger run well the pattyroller will get you? \r\n           Run nigger run well you better get away \r\n           Nigger run, run so fast \r\n           Stoved his head in a hornets nest \r\n           Run nigger run well the pattyroller will get you \r\n           Run nigger run well you better get away \r\n\r\n                         \r\n\r\n          61 EXT. WOODS - DAY 61\r\n\r\n\r\n           -END OF MAY THROUGH EARLY JUNE, 1841-\r\n           We are in a wooded area. There is A GANG OF SLAVES\r\n           chopping trees into timber. It is hard, laborious work\r\n           made no more easy by the sweltering heat. Solomon is\r\n           among them as well as Sam.\r\n\r\n                         \r\n\r\n                         62 62\r\n\r\n           EXT. WOODS - LATER\r\n\r\n           The slaves now load the timber onto a horse drawn wagon.\r\n           Again, hard work done under the ever present sun.\r\n\r\n          42B.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          63 EXT. ROAD - LATER 63\r\n\r\n           As Sam drives the wagon, the other slaves trudge along\r\n           side by foot. We should get the sense the travel is long\r\n           and tedious.\r\n\r\n                         \r\n\r\n          64 EXT. FORD'S WORK AREA - LATER 64\r\n\r\n           It is a sizable work area on the edge of Indian Creek.\r\n           There is much work being done, the slaves primarily\r\n           employed in piling the timber and chopping it into\r\n           lumber. As before, there is little doubt about the\r\n           rigors of the job at hand.\r\n           Working as a carpenter at the work area is JOHN TIBEATS.\r\n           There are also various CUSTOMERS who move about placing\r\n           orders.\r\n\r\n                         \r\n\r\n                         65 65\r\n\r\n           EXT. FORD PLANTATION - DAY\r\n\r\n\r\n           -EARLY TO MID JUNE, 1841-\r\n           It's Sunday morning. All of Ford's slaves are dressed\r\n           with their \"finest\" clothes - brightly colored and as\r\n           free as possible of defect. The slaves are gathered on\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          43.\r\n\r\n                         65 CONTINUED: 65\r\n           the lawn just beyond the piazza. Mistress Ford is\r\n           present as well. As the slaves listen, Ford reads to\r\n           them Scripture. His tone is of a man trying to preach by\r\n           way of compassion.\r\n\r\n                          FORD\r\n           \"But as touching the resurrection\r\n           of the dead, have ye not read that\r\n           which was spoken unto you by God,\r\n           saying, I am the God of Abraham,\r\n           and the God of Isaac, and the God\r\n           of Jacob. God is not the God of\r\n           the dead, but of the living. And\r\n           when the multitude heard this,\r\n           they were astonished at his\r\n           doctrine. Then one of them, which\r\n           was a lawyer, asked him a\r\n           question, tempting him, and\r\n           saying, Master, which is the\r\n           great commandment in the law?\r\n           Jesus said unto him, Thou shalt\r\n           love the Lord thy God with all thy\r\n           heart, and with all thy soul, and\r\n           with all thy mind. This is the\r\n           first and great commandment. And\r\n           the second is like unto it, thou\r\n           shalt love thy neighbor as\r\n           thyself. On these two\r\n           commandments hang all the law and\r\n           the prophets.\"\r\n           Despite the lightness with which Ford speaks and the hope\r\n           in his words, ELIZA SITS OFF TO THE SIDE - SELF-SECLUDED\r\n\r\n           A BIT - WEEPING GENTLY.\r\n           We should be able to see in Mistress Ford's eyes that\r\n           Eliza's constant crying is unsettling.\r\n\r\n                         \r\n\r\n                         66 66\r\n\r\n                          OMITTED\r\n\r\n                         \r\n\r\n                         67 OMIT 67\r\n\r\n                         \r\n\r\n                         68 OMITTED 68\r\n\r\n          44.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         69 OMIT 69\r\n\r\n                         \r\n\r\n          70 EXT. FORD'S WORK AREA - DAY 70\r\n\r\n\r\n           -MID JUNE, 1841-\r\n           The slaves have broken for lunch. They snack on smoked\r\n           meat and drink water from gourds. As they lunch Solomon\r\n           reads from Sam's Bible to the other slaves.\r\n\r\n                          SOLOMON\r\n           But he that is greatest among you,\r\n           let him be as the younger; and he\r\n           that is chief, as he that doth\r\n           serve. For whether is greater, he\r\n           that sitteth at meat, or he that\r\n           serveth? Is not he that sitteth\r\n           at meat? But I am among you as he\r\n           that serveth.\r\n           A white customer - WINSLOW - irate at the sight and sound\r\n           of slaves reading Scripture, crosses over. He grabs the\r\n           Bible.\r\n\r\n                          WINSLOW\r\n           From where did you thieve this?\r\n\r\n                          SAM\r\n           Suh, the book is my property.\r\n           The White Customer has no interest in Sam's answer. With\r\n           flailing hands he STARTS BEATING ON SAM. Solomon tries\r\n           to stop him. That only makes the situation worse,\r\n           Solomon now the target of the man's ire.\r\n\r\n                          WINSLOW\r\n           Take your hands from me!\r\n           Ford comes running over.\r\n\r\n                          FORD\r\n           What is the commotion?\r\n\r\n                          WINSLOW\r\n           Your niggers are either brazen or\r\n           rebellious. This one was readin'\r\n           Scripture, and this one claims it\r\n           to be his.\r\n\r\n                          FORD\r\n           It is. A gift from his Mistress.\r\n\r\n                          WINSLOW\r\n           You condone this?\r\n\r\n                          FORD\r\n           I encourage it. As a Christian I\r\n           can do no less.\r\n\r\n                          (CONTINUED)\r\n\r\n          45.\r\n\r\n                         70 CONTINUED: 70\r\n\r\n                          WINSLOW\r\n           You can do no worse, Ford. A\r\n           slave that reads is dangerous.\r\n           Winslow moves off. He yells back at Ford:\r\n\r\n                          WINSLOW (CONT'D)\r\n           And the man who would allow a\r\n           slave to read is unfit to own\r\n           niggers!\r\n           Handing the Bible back to Sam, very matter of factly:\r\n\r\n                          FORD\r\n           Pay him no mind. The word of God\r\n           applies to all. In that you may\r\n           take comfort.\r\n\r\n                         \r\n\r\n                         71 71\r\n\r\n                          OMITTED\r\n\r\n                         \r\n\r\n          72 EXT. ROAD - DAY 72\r\n\r\n           Sam is at the reigns of the wagon carrying the timber to\r\n           Ford's WORK AREA. Slaves trudge alongside, same as it\r\n           ever was. Only...it's not quite the same. Sam brings\r\n           the wagon to a halt. He, and the slaves look up the road\r\n           ahead of them.\r\n           Standing in the middle of the road is a group of\r\n           CHICKASAWS INDIANS. They are in their \"usual\" dress of\r\n           buckskin breeches and calico hunting shirts of fantastic\r\n           colors, buttoned from belt to chin. They have with them\r\n           DOGS and HORSES. They carry with them the carcass of a\r\n           deer.\r\n           The two groups stare at each other for a long moment.\r\n\r\n                         \r\n\r\n                         73 73\r\n\r\n           EXT. FIELD - DUSK/END OF DAY\r\n\r\n           The groups of slaves and Chickasaws are now intermingled.\r\n           They \"break bread\" - actually they work on the carcass of\r\n           the deer which is now roasting over a large fire. As\r\n           well the group share a smoke on a pipe.\r\n           One of the Chickasaws is playing a tune on an \"INDIAN\r\n           FIDDLE.\" The Chickasaws perform a customary dance;\r\n           trotting after each other, and giving utterance to a\r\n           guttural, sing-song noise.\r\n           The slaves enjoy the respite from work, Solomon\r\n           particularly taken by the music...if not entirely\r\n           enthralled by it.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          46.\r\n\r\n                         73 CONTINUED: 73\r\n           After a bit, Solomon rights himself and heads from the\r\n           group.\r\n\r\n                         \r\n\r\n          74 EXT. RIVER BANK - CONTINUOUS 74\r\n\r\n           Solomon arrives to some tall grass at the edge of the\r\n           river. Lowering his trousers, SOLOMON SQUATS TO\r\n           DEFECATE. As he does, he stares out toward the flowing\r\n           waters of Indian Creek. After a few moments, as though a\r\n           thought far greater than relieving himself has come to\r\n           him, Solomon stands and replaces his pants.\r\n           Oddly, Solomon stares out at the water as though he were\r\n           a man possessed.\r\n\r\n                         \r\n\r\n                         75 75\r\n\r\n           EXT. FORD'S WORK AREA - DAY\r\n\r\n           Just beyond the WORK AREA Solomon speaks with Ford as\r\n           Tibeats listens. Solomon is drawing in the dirt, making\r\n           rough diagrams for Ford as he explains himself.\r\n\r\n                          SOLOMON\r\n           The creek is plenty deep enough to\r\n           sail, even with a boat full of\r\n           load. The distance from the WORK\r\n           AREA to the point on the latter\r\n           bayou is several miles by water\r\n           fewer than land. It occurs to me\r\n           that the expense of the\r\n           transportation would be materially\r\n\r\n                          DIMINISHED--\r\n\r\n                          TIBEATS\r\n           \"Materially diminished?\"\r\n\r\n                          SOLOMON\r\n           If we use the waterway.\r\n\r\n                          TIBEATS\r\n           It's a scheme. Plenty of\r\n           engineers have schemed similarly.\r\n           The passes are too tight.\r\n\r\n                          SOLOMON\r\n           I reckon them at more than twelve\r\n           feet at their most narrow. Wide\r\n           enough for a tub to traverse. A\r\n           team of niggers can clear it out.\r\n\r\n                          TIBEATS\r\n           And you know what of transport and\r\n           terra formin'?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          47.\r\n\r\n                         75 CONTINUED: 75\r\n\r\n                          SOLOMON\r\n           I labored repairing the Champlain\r\n           canal, on the section over which\r\n           William Van Nortwick was\r\n           superintendent. With my earnings\r\n           I hired several efficient hands to\r\n           assist me, and I entered into\r\n           contracts for the transportation\r\n           of large rafts of timber from Lake\r\n           Champlain to Troy.\r\n\r\n                          FORD\r\n\r\n                          (TO TIBEATS)\r\n           I'll admit to being impressed even\r\n           if you won't.\r\n\r\n                          (TO SOLOMON)\r\n           Collect a gang, see what good you\r\n           can do.\r\n\r\n                         \r\n\r\n                         76 76\r\n\r\n           EXT. CREEK - DAY\r\n\r\n\r\n           -END OF JUNE, 1841-\r\n           WE HAVE A SERIES OF SCENES in which we see Solomon and a\r\n           TEAM OF BLACKS working on the creek: CHOPPING TREES\r\n           ALONG THE BANKS, widening out the shore... It's all just\r\n           a trial for now. The work is diligent, but it is basic\r\n           to this point. Still, under Solomon's direction, the\r\n           slaves go at it like they've got something to prove. And\r\n           rightly they do.\r\n           Solomon also works on a narrow raft of twelve cribs with\r\n           which he will transport the timber.\r\n           Once this is constructed, HE PERSONALLY \"SAILS\" THEM UP\r\n\r\n           THE CREEK WITH A TEST LOAD.\r\n\r\n                         \r\n\r\n                         77 77\r\n\r\n           EXT. FORD'S WORK AREA - LATER\r\n\r\n           Ford and a group of slaves wait along the river banks\r\n           just beyond the WORK AREA. All are expectant in their\r\n           manner. A long moment passes with no sign of Solomon.\r\n           Then, from up river, we see Solomon's raft of lumber\r\n           winding its way. SLAVES CHEER, and Ford literally\r\n           applauds the effort. Tibeats looks pissed. He has just\r\n           been shown up after all.\r\n\r\n                         \r\n\r\n                         78 78\r\n\r\n           EXT. FORD PLANTATION/GREAT HOUSE - DAY\r\n\r\n           As we come into the scene, Ford is presenting Solomon\r\n           with a fiddle. Not as grand as the one he previously\r\n           owned in New York, but a fine instrument none the less.\r\n           It is a gift of thanks for his hard work. Solomon's\r\n           gratitude is easily expressed.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          48.\r\n\r\n                         78 CONTINUED: 78\r\n\r\n                          SOLOMON\r\n           My great thanks, Master Ford.\r\n\r\n                          FORD\r\n           My thanks to you, and it is the\r\n           least of it. My hope is that it\r\n           brings us both much joy over the\r\n           years.\r\n           Following the statement, Solomon's not sure how to react.\r\n           He remains grateful, but the thought of \"over the years\"\r\n           is just a reminder of the altered state in which he now\r\n           finds himself.\r\n\r\n                         \r\n\r\n                         79 79\r\n\r\n           EXT. FORD PLANATION/SLAVE SHACK - EVENING\r\n\r\n\r\n           -END OF JULY, 1841-\r\n           The slaves eat. All tired from a days work they conduct\r\n           themselves in silence. All except for Eliza who,\r\n           SLIPPING INTO PERMANENT DEPRESSION, as always weeps. The\r\n           sound of her sobbing edging him up - particularly after\r\n           Master Ford's \"over the years\" observation. Solomon\r\n\r\n                          FINALLY SNAPS:\r\n\r\n                          SOLOMON\r\n           Eliza. Eliza, stop!\r\n           Solomon goes to her, grabs Eliza. She does not stop. As\r\n           if to force the misery from her, Solomon SHAKES ELIZA\r\n\r\n           VIOLENTLY.\r\n\r\n                          SOLOMON (CONT'D)\r\n           Stop it! Stop!\r\n\r\n                          ELIZA\r\n           It's all I have to keeps my loss\r\n           present.\r\n\r\n                          SOLOMON\r\n           You let yourself be overcome by\r\n           sorrow. You will drown in it.\r\n\r\n                          ELIZA\r\n           Have you stopped crying for your\r\n           children? You make no sounds, but\r\n           will you ever let them go in your\r\n           heart?\r\n\r\n                          SOLOMON\r\n           ...They are as my flesh...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          49.\r\n\r\n                         79 CONTINUED: 79\r\n\r\n                          ELIZA\r\n           Then who is distressed? Do I\r\n           upset the Mistress and the Master?\r\n           Do you care less for my loss than\r\n           their well being?\r\n\r\n                          SOLOMON\r\n           Master Ford is a decent man.\r\n\r\n                          ELIZA\r\n           He is a slaver.\r\n\r\n                          SOLOMON\r\n           Under the circumstances--\r\n\r\n                          ELIZA\r\n           Under the circumstances he is a\r\n           slaver! Christian only in his\r\n           proclamations. Separated me from\r\n           my precious babies for lack of a\r\n           few dollars. But you truckle at\r\n\r\n                          HIS BOOT--\r\n\r\n                          SOLOMON\r\n           No...\r\n\r\n                          ELIZA\r\n           You luxuriate in his favor.\r\n\r\n                          SOLOMON\r\n           I survive. I will not fall into\r\n           despair. Woeful and crushed;\r\n           melancholy is the yolk I see most.\r\n           I will offer up my talents to\r\n           Master Ford. I will keep myself\r\n           hearty until freedom is opportune.\r\n\r\n                          ELIZA\r\n           Ford is your opportunity. Do you\r\n           think he does not know that you\r\n           are more than you suggest? But he\r\n           does nothing for you. Nothing.\r\n           You are no better than prized\r\n           livestock. Call for him. Call,\r\n           tell him of your previous\r\n           circumstances and see what it\r\n           earns you...Solomon.\r\n           Eliza uses Solomon's name quite pointedly as if to\r\n           underscore his true self. Solomon get her meaning. Yet\r\n           he says nothing. Again, pointedly:\r\n\r\n                          ELIZA (CONT'D)\r\n           So, you've settled into your role\r\n           as Platt, then?\r\n\r\n                          SOLOMON\r\n\r\n                          (DEFENSIVE)\r\n           My back is thick with scars from\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          50.\r\n\r\n                         79 CONTINUED: (2) 79\r\n\r\n                          SOLOMON (CONT'D)\r\n           protesting my freedom. Do not\r\n\r\n                          ACCUSE ME--\r\n\r\n                          ELIZA\r\n           I accuse you of nothing. I cannot\r\n           accuse. I too have done so many,\r\n           many dishonorable things to\r\n           survive. And for all of them I\r\n           have ended up here... No better\r\n           than if I had stood up for myself.\r\n           Father, Lord and Savior forgive\r\n           me... Forgive me. Oh, Solomon,\r\n           let me weep for my children.\r\n\r\n           FORD (V.O.)\r\n           At the same time came the\r\n           disciples unto Jesus, saying, Who\r\n           is the greatest in the kingdom of\r\n           heaven?\r\n\r\n                         \r\n\r\n                         80 80\r\n\r\n           EXT. FORD PLANTATION - MORNING\r\n\r\n\r\n           -AUGUST, 1841-\r\n           It's Sunday. The slaves are again gathered in the rose\r\n           garden near the front of the house to hear the word of\r\n           the Lord as read by Master Ford.\r\n\r\n                          FORD\r\n           And Jesus called a little child\r\n           unto him, and set him in the midst\r\n           of them, And said, Verily I say\r\n           unto you, Except ye be converted,\r\n           and become as little children, ye\r\n           shall not enter into the kingdom\r\n           of heaven.\r\n           The phrase seems to trigger Eliza's tears. She begins to\r\n           sob uncontrollably.\r\n           Mrs. Ford turns to Rachel in a hushed whisper-\r\n\r\n           MRS. FORD\r\n           I cannot have that kind of\r\n           depression about.\r\n           Solomon, pretending not to have heard, slowly turns to\r\n           Eliza with worry.\r\n           Ford continues to preach over Eliza's keening.\r\n\r\n                          FORD\r\n           But whoso shall offend one of\r\n           these little ones which believe in\r\n           me, it were better for him that a\r\n           millstone were hanged about his\r\n           neck, and that he were drowned in\r\n           the depth of the sea. Woe unto\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          50A.\r\n\r\n                         80 CONTINUED: 80\r\n\r\n                          FORD (CONT'D)\r\n           the world because of offences!\r\n           For it must needs be that offences\r\n           come; but woe to that man by whom\r\n           the offence cometh!\r\n\r\n                          BLACK\r\n\r\n          51.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          81 EXT. FORD PLANTATION - DAY 81\r\n\r\n\r\n           -JANUARY, 1842-\r\n           Seasons have passed. It is winter now, and very grey out\r\n           along the bayou. Ford and Tibeats - who we have seen\r\n           working around the WORK AREA - stand with Solomon,\r\n           Tibeats giving Solomon an inspection. Ford carries much\r\n           lament.\r\n\r\n                          TIBEATS\r\n           Raise yer shirt.\r\n           Solomon does as instructed. Tibeats looks at Solomon's\r\n           back, at the scars from lashings he bears.\r\n\r\n                          TIBEATS (CONT'D)\r\n           Troublesome.\r\n\r\n                          FORD\r\n           He's a good carpenter and quick-\r\n           witted.\r\n\r\n                          TIBEATS\r\n           I am familiar with his cleverness.\r\n\r\n                          FORD\r\n           You won't find a nigger more\r\n           humble.\r\n\r\n                          TIBEATS\r\n           Ain't found a nigger yet I cain't\r\n           humble.\r\n           Tibeats heads off. Solomon, highly curious over the\r\n           preceding.\r\n\r\n                          SOLOMON\r\n           Sir, have I done something wrong?\r\n\r\n                          FORD\r\n           Not your concern, Platt. I say\r\n           with much...shame I have compiled\r\n           debts. I have long preached\r\n           austerity, but find myself\r\n           hypocritical in that regard.\r\n           You'll be in the ownership of Mr.\r\n           Tibeats. You are his now. Serve\r\n           him as you'd serve me.\r\n\r\n                          SOLOMON\r\n           Sir.\r\n\r\n                          FORD\r\n           And your faithfulness will not be\r\n           forgotten.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          52.\r\n\r\n                         81 CONTINUED: 81\r\n\r\n                          SOLOMON\r\n           Yes, sir.\r\n\r\n                          FORD\r\n           Pride and want have been my sin.\r\n           Loss of you is but one of my\r\n           punishments.\r\n\r\n                         \r\n\r\n                         82 82\r\n\r\n           EXT. FORD PLANATION - DAY\r\n\r\n\r\n           -END OF JANUARY, 1842- [OVER ONE DAY]\r\n           We see Solomon working as a carpenter, helping to erect a\r\n           Weaving House that stands off to the side of the\r\n           plantation's Great House.\r\n           At the moment Solomon is nailing on siding. Tibeats\r\n           arrives and is immediately dissatisfied with the work.\r\n\r\n                          TIBEATS\r\n           Make them boards flush.\r\n\r\n                          SOLOMON\r\n           They are, sir.\r\n\r\n                          TIBEATS\r\n           They is no such thing.\r\n           Solomon runs his hands over the boards.\r\n\r\n                          SOLOMON\r\n           As smooth to the touch as a\r\n           yearling's coat.\r\n\r\n                          TIBEATS\r\n           Callin' me a liar, boy?\r\n\r\n                          SOLOMON\r\n           Only a matter of perspective, sir.\r\n           From where you stand you may see\r\n           differently. But the hands are\r\n           not mistaken. I ask only that you\r\n           employ all your senses before\r\n           rendering judgement.\r\n           What's Tibeats to do when faced with fact? All he can do\r\n           is spew invectives.\r\n\r\n                          TIBEATS\r\n           You are a brute. You are a dog,\r\n           and no better for followin'\r\n           instruction.\r\n\r\n                          SOLOMON\r\n           I'll do as ordered, sir.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          53.\r\n\r\n                         82 CONTINUED: 82\r\n\r\n                          TIBEATS\r\n           Then you'll be up at daybreak.\r\n           You will procure a keg of nails\r\n           from Chapin and commence puttin'\r\n           on clapboards.\r\n           Tibeats wheels away. Solomon goes back to his work.\r\n           After a few moments Solomon notices a bit of commotion in\r\n           the drive of the great house. It involves an\r\n           inconsolable Eliza who is being herded by Sam onto a cart\r\n           DRIVEN BY A WHITE MAN. Mistress Ford and Rachel watch.\r\n           Solomon can only watch as the last connection to his days\r\n           as a free man is driven away to a location unknown.\r\n\r\n                         \r\n\r\n                         83 83\r\n\r\n           EXT. WEAVING HOUSE - MORNING\r\n\r\n           It is day break. As ordered, Solomon is up and working.\r\n           Chapin is rolling a keg of nails off a handcart for\r\n           Solomon.\r\n\r\n                          CHAPIN\r\n           If Tibeats prefers a different\r\n           size, I will endeavor to furnish\r\n           them, but you may use those until\r\n           further directed.\r\n\r\n                          SOLOMON\r\n           Yes, sir.\r\n\r\n                         \r\n\r\n                         84 84\r\n\r\n           EXT. WEAVING HOUSE - LATER\r\n\r\n           As the day gets on to mid-morning, the sun already baking\r\n           in the sky, Tibeats makes his way over to Solomon. Even\r\n           before arriving to Solomon his mien is one of\r\n           belligerence; out of sorts and something less than sober.\r\n\r\n                          TIBEATS\r\n           I thought I told yah ta commence\r\n           ta puttin' on clapboards this\r\n           morn'.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          54.\r\n\r\n                         84 CONTINUED: 84\r\n\r\n                          SOLOMON\r\n           Yes, master. I am about it. I\r\n           have begun on the other side of\r\n           the house.\r\n           Tibeats walks around to look over Solomon's work. He is\r\n           picayune, as if purposefully looking for fault.\r\n\r\n                          TIBEATS\r\n           Didn't I tell yah last night to\r\n           get a keg of nails of Chapin?\r\n\r\n                          SOLOMON\r\n           And so I did; and Chapin said he\r\n           would get another size for you, if\r\n           you wanted them when he came back\r\n           from the field.\r\n           Tibeats walks to the keg and kicks it. Moving toward\r\n           Solomon \"with a great passion:\"\r\n\r\n                          TIBEATS\r\n           Goddamn yah! I thought yah knowed\r\n           somethin'!\r\n           Solomon, perhaps inspired by his moment with Eliza, is in\r\n           no mood for Tibeats.\r\n\r\n                          SOLOMON\r\n           I did as instructed. If there's\r\n           something wrong, then its wrong\r\n           with your instructions.\r\n\r\n                          TIBEATS\r\n           Yah black bastard! Yah goddman\r\n           black bastard!\r\n           In an inconsolable rage, Tibeats runs off to the piazza\r\n           to fetch a whip.\r\n           Solomon looks around. He is alone other than Rachel and\r\n           Mistress Ford who, shocked by that which she witnesses,\r\n           runs out to the field to fetch Chapin. Solomon's\r\n           instinct is to run, but he stands his ground as Tibeats\r\n           marches back whip in hand.\r\n\r\n                          TIBEATS (CONT'D)\r\n           Strip yer clothes!\r\n           Solomon does no such thing.\r\n\r\n                          TIBEATS (CONT'D)\r\n           Strip!\r\n\r\n                          SOLOMON\r\n           I will not.\r\n           With \"concentrated vengeance,\" Tibeats springs for\r\n           Solomon, seizing him by the throat with one hand and\r\n\r\n                          (CONTINUED)\r\n\r\n          55.\r\n\r\n                         84 CONTINUED: (2) 84\r\n           raising the whip with the other. Before he can strike\r\n           the blow, however, Solomon catches Tibeats by the collar\r\n           of his coat and pulls him in close. Reaching down,\r\n           Solomon grabs Tibeats by the ankle and pushes him back\r\n           with the other hand. Tibeats tumbles to the ground. A\r\n           violent struggle takes place as Solomon puts a foot to\r\n           Tibeats throat, and then in a frenzy of madness snatches\r\n           the whip from Tibeats and begins to strike him with the\r\n           handle again and again and again.\r\n\r\n                          TIBEATS\r\n           Yew will not live ta see another\r\n           day, nigger! This is yer last, I\r\n           swear it!\r\n           Solomon ignores the threats, continues to beat Tibeats.\r\n           Blow after blow falling fast and heavy on Tibeats's\r\n           wriggling form. The stiff stock of the whip wraps around\r\n           Tibeats's cringing body until Solomon's arm aches.\r\n           Tibeats's cries of vengeance turn to yelps for help and\r\n           then pleas for mercy:\r\n\r\n                          TIBEATS (CONT'D)\r\n           Murder! It's murder! Lord, God,\r\n           help me. God be merciful!\r\n           And then suddenly, Tibeats shrieks-\r\n\r\n                          TIBEATS (CONT'D)\r\n           Papa I'm sorry!\r\n           Chapin comes RIDING IN FROM THE FIELD fast and hard.\r\n           Solomon strikes Tibeats a blow or two more, then delivers\r\n           a well-directed kick that sends Tibeats rolling over the\r\n           ground.\r\n\r\n                          CHAPIN\r\n           What is the matter?\r\n           Tibeats struggles up and tries to present an air of\r\n           dignity and control while he keeps a demonic eye on\r\n\r\n                          SOLOMON:\r\n\r\n                          SOLOMON\r\n           Master Tibeats wants to whip me\r\n           for using the nails you gave me.\r\n\r\n                          CHAPIN\r\n           What's the matter with the nails?\r\n           With a mix of shame, anger and embarrassment, Tibeats\r\n           says, as if being exposed-\r\n\r\n                          TIBEATS\r\n           They're...they're too large.\r\n\r\n                          CHAPIN\r\n           I am overseer here. I told Platt\r\n           to use them, and\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          56.\r\n\r\n                         84 CONTINUED: (3) 84\r\n\r\n                          CHAPIN (CONT'D)\r\n           I shall furnish such nails as I\r\n           please. Do you understand that,\r\n           Mr. Tibeats?\r\n           Tibeats answer is in the grinding of his teeth and the\r\n           shaking of his fist.\r\n\r\n                          TIBEATS\r\n           This ain't done by half. I will\r\n           have flesh, and I will have all of\r\n           it.\r\n           Tibeats moves off toward, and then INTO THE HOUSE.\r\n           Chapin follows. A long moment, Solomon stands alone. He\r\n           looks around, not sure what to do; to stay or to flee.\r\n           Anxiety mounts on his features.\r\n           A moment more, and Tibeats EXITS the house. He saddles\r\n           his horse and rides off to beat the devil. Or, worse, to\r\n           fetch him.\r\n           Chapin comes running back out of the house. He is\r\n           visibly excited, and when he speaks he is quite earnest.\r\n           Though he tries to project reasoned emotions he gives off\r\n           an air of impending trouble.\r\n\r\n                          CHAPIN\r\n           Do not stir. Do not attempt to\r\n           leave the plantation on any\r\n           account whatever. But if you run\r\n           there is no protecting you.\r\n\r\n                          SOLOMON\r\n\r\n                          SIR--\r\n\r\n                          CHAPIN\r\n           If you run, Platt, there is no\r\n           protecting you. Rachel...!\r\n           Chapin runs off to join Rachel. The two converse at a\r\n           distance from Solomon, then they head off for the log\r\n           kitchen.\r\n           Solomon is now very much alone, and he waits for what is\r\n           to come. AND WE WAIT WITH HIM. And we wait, and we\r\n           continue to wait... Moment by moment, the dread of the\r\n           unexpected mounts.\r\n           Solomon's eyes begin to well. He has beaten a white man,\r\n           and he knows that death awaits him.\r\n\r\n           A SLIGHT PRAYER TO THE HEAVENS BEGINS TO FORM IN HIS\r\n           THROAT, but he is too choked up to fully speak it.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          57.\r\n\r\n                         84 CONTINUED: (4) 84\r\n           Chapin has now returned to the piazza. He stands and\r\n           watches, but does not move to Solomon.\r\n           Solomon waits, and waits...\r\n           WE HEAR THE SOUND OF DISTANT HOOFS which grow louder and\r\n           louder in the manner of rolling thunder. It's Tibeats.\r\n           He returns with two accomplices; RAMSAY and COOK. They\r\n           carry with them large whips and a coil of rope.\r\n\r\n                          TIBEATS\r\n           Tha's the one. Tha's him.\r\n           Dismounting, they move with menace that is tinged with\r\n           perverse pleasure and wordless malevolence. Solomon\r\n           tries to fight back, but he is strong armed and tied by\r\n           TIBEATS - his wrists, and then ankles bound in the same\r\n           manner. In the meantime the other two have slipped a\r\n           cord within Solomon's elbows, running it across his back\r\n           and tying it firmly. Solomon is then dragged toward a\r\n           peach tree. A lynching is in store. The naked horror of\r\n           it intensely palpable.\r\n           Solomon looks toward the piazza, but Chapin is now gone.\r\n           Tears of fear flow down Solomon's cheeks. He is on the\r\n           verge of panic; a man heading toward his own execution,\r\n           he begins to struggle and fight.\r\n           A rope goes around Solomon's neck, then is tossed over\r\n           the branch of the tree. The trio begin to hoist Solomon.\r\n           He gasps and gags as spittle flies from his mouth and the\r\n           life is choked from him.\r\n           With suddenness, Chapin comes from the house brandishing\r\n           a pistol in each hand - Colt Paterson .36 caliber\r\n           \"Holster\" pistols with 9\" barrels. Chapin moves with\r\n           determination toward the lynch mob. He is sharp and\r\n           matter of fact. With the guns in hand, he really doesn't\r\n           need to be much more demonstrative.\r\n\r\n                          CHAPIN\r\n           Gentlemen... Whoever moves that\r\n           nigger another foot from where he\r\n           stands is a dead man. I am\r\n           overseer of this plantation seven\r\n           years, and in the absence of\r\n           William Ford, my duty is to\r\n           protect his interests. Ford holds\r\n           a mortgage on Platt of four\r\n           hundred dollars. If you hang him,\r\n           he loses his debt. Until that is\r\n           canceled you have no claim to his\r\n           life.\r\n           Directing his attention to Ramsay and Cook:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          58.\r\n\r\n                         84 CONTINUED: (5) 84\r\n\r\n                          CHAPIN (CONT'D)\r\n           As for you two, if you have any\r\n           regard for your own safety...I\r\n           say, begone!\r\n           Ramsay and Cook don't need to be told twice. The pistols\r\n           Chapin's gripping make the situation real clear. Without\r\n           further word, they mount their horses and ride away.\r\n           Tibeats remains, and his anger with him.\r\n\r\n                          TIBEATS\r\n           Yah got no cause. Platt is mine,\r\n           and mine ta do with as I please.\r\n           Yah touch my property, I will 'ave\r\n           yah strung up as well.\r\n           Tibeats mounts up and departs. There is a surreal moment\r\n           as Chapin's not sure what to do about Solomon. He\r\n           chooses to do nothing. Solomon is left dangling by the\r\n           neck from the tree as Chapin calls to Sam in the\r\n\r\n                          DISTANCE:\r\n\r\n                          CHAPIN\r\n           Sam! Get the mule. You must ride\r\n           to Master Ford. Tell him to come\r\n           here at once without a single\r\n           moment's delay. Tell him they are\r\n           trying to murder Platt. Hurry,\r\n           boy. Bring him back if you must\r\n           kill the mule to do so!\r\n\r\n                          SAM\r\n           Yes, suh!\r\n           Sam mounts up and rides off, the mule demonstrating much\r\n           speed.\r\n\r\n                         \r\n\r\n                         85 85\r\n\r\n           EXT. FORD PLANATION - LATER\r\n\r\n           HOURS HAVE PASSED. The sun is now at its apex. The sight\r\n           and smell of the red rose bush is more than vivid as\r\n           Solomon remains tied and dangling exactly where he was\r\n           left. The scene is both tranquil and horrific. Life on\r\n           the plantation continues. The OTHER SLAVES work in the\r\n           field. CHILDREN make their way playfully in the yard.\r\n           It should all underscore the fact that a black, hanging\r\n           even partially from a tree, is nothing unusual in this\r\n           time and space.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          59.\r\n\r\n                         85 CONTINUED: 85\r\n           Chapin walks back and forth with the pistols in his\r\n           hands. Clearly he fears Tibeats returning with more and\r\n           better assistance. And yet, he does nothing to alleviate\r\n           Solomon's suffering. He heeds Tibeats words, and as\r\n           though caught up in the middle of nothing more than a\r\n           property dispute, he offers no further aid.\r\n           Solomon's head lolls to one side. He looks toward the\r\n           sun. The bright light flares off the leaves and branches\r\n           of the tree from which Solomon hangs. The glare in\r\n           Solomon's eyes offering him more pain than solace, but he\r\n           cannot help but look upward. As he does, his eyes\r\n           flutter between life and lifelessness...\r\n\r\n                         \r\n\r\n                         86 86\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n          87 EXT. FORD PLANATION - LATER 87\r\n\r\n           Solomon continues to hang. By now he is drenched in\r\n           sweat, and nearly delirious with dehydration. His lips\r\n           dry and parched. He may not die from hanging, but he may\r\n           very well expire before the day is over.\r\n           Eventually Rachel comes over - timidly, and as though she\r\n           were acting contrary to orders - and offers a drink of\r\n           water from a tin cup, pouring it in Solomon's mouth for\r\n           him. She then takes a small hand towel and dabs at the\r\n           water which clings to his lips. Rachel then retreats,\r\n           and leaves Solomon to hang.\r\n\r\n                         \r\n\r\n                         88 88\r\n\r\n           EXT. FORD PLANATION - EVENING\r\n\r\n           The sun is just now arching for the horizon. Solomon\r\n           remains, as though his torture will not end. Ford,\r\n           trailed by Sam, finally comes riding up. He dismounts,\r\n           and moves swiftly over to Solomon. With great heartache:\r\n\r\n                          FORD\r\n           Platt... My poor Platt.\r\n           Ford produces a blade and cuts Solomon loose. Solomon\r\n           attempts to carry himself, but he cannot. He falls to\r\n           the ground and passes out.\r\n\r\n                         \r\n\r\n                         89 89\r\n\r\n           INT. FORD PLANATION/GREAT HOUSE - NIGHT\r\n\r\n           As we come into the scene, Solomon lays on a blanket on\r\n           the floor. Eventually, his eyes flutter, then open. He\r\n           is in the foyer of the Ford house. As he gets his\r\n           bearings, he looks around the interior. THE SPACE IS\r\n           HANDSOME, AND WELL DECORATED. It is sharp contrast to\r\n           the bleak surroundings, shacks and dungeons Solomon has\r\n           largely been accustom to during his time of slavery. It\r\n           will be the \"first and last time such a sumptuous resting\r\n           place was granted\" during his twelve years of bondage.\r\n\r\n                          (CONTINUED)\r\n\r\n          60.\r\n\r\n                         89 CONTINUED: 89\r\n           Solomon doesn't have much chance to luxuriate in his\r\n           surroundings. He hears a DOG BARKING just outside, and\r\n           is unnerved. Has Tibeats returned to finish what he\r\n           started?\r\n           From a study, Master Ford appears with a gun in hand. He\r\n           goes to the door, opens it and looks outside. He can see\r\n           nothing. Satisfied, Ford crosses back over to Solomon.\r\n           He is frank with Solomon regarding the situation.\r\n\r\n                          FORD\r\n           I believe Tibeats is skulkin'\r\n           about the premises somewhere. He\r\n           wants you dead, and he will\r\n           attempt to have you so. It's no\r\n           longer safe for you here. And I\r\n           don't believe you will remain\r\n           passive if Tibeats attacks. I\r\n           have transferred my debt to Edwin\r\n           Epps. He will take charge of you.\r\n\r\n                          SOLOMON\r\n           (desperate, urgent)\r\n           Master Ford, you must know; I am\r\n           not a slave.\r\n\r\n                          FORD\r\n           I cannot hear that.\r\n\r\n                          SOLOMON\r\n           Before I came to you I was a\r\n           freeman.\r\n\r\n                          FORD\r\n           I am trying to save your life!\r\n           And...I have a debt to be mindful\r\n           of. That, now, is to Edwin Epps.\r\n           He is a hard man. Prides himself\r\n           on being a \"nigger breaker.\" But\r\n           truthfully I could find no others\r\n           who would have you. You've made a\r\n           reputation of yourself. Whatever\r\n           your circumstances, you are an\r\n           exceptional nigger, Platt. I fear\r\n           no good will come of it.\r\n\r\n                         \r\n\r\n                         90 90\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/BACK PORCH - DAY\r\n\r\n\r\n           -END OF JANUARY, 1842-\r\n           From the back porch, we come into the scene on EDWIN\r\n           EPPS; a repulsive and coarse man. His language gives\r\n           speedy and unequivocal evidence that he has never enjoyed\r\n           the advantages of an education.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          61.\r\n\r\n                         90 CONTINUED: 90\r\n           Epps reads the Bible to his slaves, eight of them\r\n           altogether. ABRAM; a tall, older slave of about sixty\r\n           years. WILEY, who is forty eight. PHEBE, who is married\r\n           to Wiley. BOB and HENRY who are Phebe's children, EDWARD\r\n           and PATSEY. Patsey is young, just 23 years old...though\r\n           in the era, 23 not as young as in the present day. She\r\n           is the offspring of a \"Guinea nigger,\" brought over to\r\n           Cuba in a slave ship. She nearly brims with unconversant\r\n           sexuality.\r\n           MISTRESS EPPS, Epps's wife, is also present. She sits\r\n           with, holds quite lovingly, some SLAVE CHILDREN. WITH\r\n           THEM SHE IS VERY \"MOTHERLY.\" We also see Epps's overseer\r\n           TREACH. Treach constantly sports a LOADED PISTOL.\r\n           Though Epps reads the word of the Lord, he lacks the tone\r\n           of compassion with which Ford read.\r\n\r\n                          EPPS\r\n           \"And that servant which knew his\r\n           Lord's will...WHICH KNEW HIS\r\n           LORD'S WILL and prepared not\r\n           himself...PREPARED NOT HIMSELF,\r\n           neither did according to his will,\r\n           shall be beaten with many\r\n           stripes...\" D'ye hear that?\r\n           \"Stripes.\" That nigger that don't\r\n           take care, that don't obey his\r\n           lord - that's his master - d'ye\r\n           see? - that 'ere nigger shall be\r\n           beaten with many stripes. Now,\r\n           \"many\" signifies a great many.\r\n           Forty, a hundred, a hundred and\r\n           fifty lashes... That's Scripter!\r\n\r\n                         \r\n\r\n                         91 91\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/FIELD - DAY\r\n\r\n\r\n           -AUGUST, 1842-\r\n\r\n           WE START THE SCENE WITH A PAIR OF BLACK HANDS\r\n           picking cotton ferociously. As we move out, we identify\r\n           PATSEY, a 23 year old striking black woman. The camera\r\n           moves out again to a wider shot. This reveals several\r\n           lines of slaves picking cotton, with Patsey way out in\r\n           the lead. \r\n           We cut to another pair of black hands. This time,\r\n           revealing SOLOMON, clumsy and unskilled hands, picking\r\n           cotton. A lash bears down on him.\r\n           It is August, \"cotton picking\" season.\r\n           We are looking out over a cotton field in full bloom. It\r\n           presents a visual purity, like an immaculate expanse of\r\n           light, new-fallen snow. The cotton grows from five to\r\n           seven feet high, each stalk having a great many branches\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          62.\r\n\r\n                         91 CONTINUED: 91\r\n           shooting out in all directions and lapping each other\r\n           above the water furrow.\r\n           There is a slave to each side of the row. They have a\r\n           sack around their necks that hangs to the ground, the\r\n           mouth of the sack about breast high. Baskets are placed\r\n           at the end of the furrows. Slaves dump their sacks of\r\n           cotton in the baskets, then pick until their sacks are\r\n           again filled.\r\n\r\n                          EDWARDS\r\n           Pick that cotton. Move along now.\r\n\r\n           THE SOUNDTRACK TO THE SCENE IS NOTHING MORE THAN THE\r\n\r\n           RUSTLE OF LABOR, THE MALE CICADAS BUGS \"TYMBALS\" IN THE\r\n           HEAT and a SPIRITUAL SUNG BY THE SLAVES.\r\n           Despite the heat, there is no stopping for water. The\r\n           slaves are \"driven\" by Edward, who is himself \"driven\" by\r\n           Treach.\r\n\r\n                          TREACH\r\n           C'mon. Drive dem niggers.\r\n           Edward moves among the slaves, applying the whip to them\r\n           without regard.\r\n\r\n                          EDWARD\r\n           Pick dat cotton. Move along now,\r\n           hear?\r\n\r\n                         \r\n\r\n                         92 92\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/GIN HOUSE - EVENING\r\n\r\n           The day's work is done. The slaves are now assembled in\r\n           the gin house with their baskets of cotton which are\r\n           being weighed by Treach. There is anxiety among the\r\n           slave, the reason for which soon becomes apparent.\r\n\r\n                          TREACH\r\n           Two hundred forty pounds for Bob.\r\n\r\n                          EPPS\r\n           What yah got for James?\r\n\r\n                          TREACH\r\n           Two hundred ninety five pounds.\r\n\r\n                          EPPS\r\n           Tha's real good, boy. Tha's real\r\n           good.\r\n\r\n                          TREACH\r\n           One hundred eighty two pounds for\r\n           Platt.\r\n           Epps does not look happy. Treach says again:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          63.\r\n\r\n                         92 CONTINUED: 92\r\n\r\n                          TREACH (CONT'D)\r\n           One hundred eighty two.\r\n\r\n                          EPPS\r\n           How much can even an average\r\n           nigger pick a day?\r\n\r\n                          TREACH\r\n           Two hundred pounds.\r\n\r\n                          EPPS\r\n           This nigger ain't even average.\r\n           Epps pulls Solomon aside.\r\n\r\n                          TREACH\r\n           Five hundred twelve pounds for\r\n           Patsey.\r\n\r\n                          EPPS\r\n           Five hundred twelve. Yah men folk\r\n           got no shame lettin' Patsey out\r\n           pick yah? The day ain't yet come\r\n           she swung lower than five hundred\r\n           pounds. Queen of the fields, she\r\n           is.\r\n\r\n                          TREACH\r\n           Two hundred six pou--\r\n\r\n                          EPPS\r\n           I ain't done, Treach. Ain't I\r\n           owed a minute to luxuriate on the\r\n           work Patsey done?\r\n\r\n                          TREACH\r\n           ...Sir...\r\n\r\n                          EPPS\r\n           Damned Queen. Born and bred to\r\n           the field. A nigger among\r\n           niggers, and God give 'er to me.\r\n           A lesson in the rewards of\r\n           righteous livin'. All be\r\n           observant ta that. All!\r\n\r\n                          (BEAT)\r\n           Now, Treach. Now speak.\r\n\r\n                          TREACH\r\n           One hundred thirty eight pounds\r\n           for Phebe.\r\n\r\n                          EPPS\r\n           Hit one forty five yesterday.\r\n           Pull her out.\r\n\r\n                          TREACH\r\n           Two hundred six pounds for Wiley.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          64.\r\n\r\n                         92 CONTINUED: (2) 92\r\n\r\n                          EPPS\r\n           How much he pick yesterday?\r\n\r\n                          TREACH\r\n           Two hundred twenty nine pounds.\r\n           Wiley is pulled from the line, huddled with Solomon.\r\n\r\n                         \r\n\r\n                         93 93\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/YARD - EVENING\r\n\r\n           In the distance, a flogging is going on. Solomon, Phebe,\r\n           and Wiley are stripped, placed in a stockade and now\r\n           being given a perfunctory whipping delivered by ANOTHER\r\n\r\n           IDENTIFIED SLAVE.\r\n\r\n                         \r\n\r\n                         94 94\r\n\r\n           EXT. MASTER EPPS'S PLANTATION - EVENING\r\n\r\n           Evening, but the day is not yet done. Slaves attend\r\n           their various evening chores; feeding livestock, doing\r\n           laundry, cooking food. There is no respite from a\r\n           slave's charge.\r\n\r\n                         \r\n\r\n                         95 95\r\n\r\n           INT. MASTER EPPS'S PLANTATION/SLAVE SHACK - NIGHT\r\n\r\n           A fire is kindled in the cabin. The slaves finally fix\r\n           their own dinner of corn meal. Corn is ground in a small\r\n           hand mill. The corn meal is mixed with a little water,\r\n           placed in the fire and baked. When it is \"done brown\"\r\n           the ashes are scraped off. Bacon is fried. As the\r\n           slaves eat, Abram goes on in great length and with much\r\n           emotion about General Jackson.\r\n\r\n                          UNCLE ABRAM\r\n           Hold my words: General Jackson\r\n           will forever be immortalized. His\r\n           bravery will be handed down to the\r\n           last posterity. If ever there be\r\n           a stain upon \"raw militia,\" he\r\n           done wiped away on the eight of\r\n           January. I say da result a that\r\n           day's battle is of 'mo importance\r\n           to our grand nation than any\r\n           occurrence 'fo or since. Great\r\n           man. Great man in deed. We all\r\n           need pray to Heavenly Father da\r\n           General reign over us always.\r\n\r\n                         \r\n\r\n                         96 96\r\n\r\n           INT. MASTER EPPS'S PLANTATION/SLAVE SHACK - NIGHT\r\n\r\n           The slaves are sleeping. There is a loud commotion.\r\n           Epps enters, drunkenly, forcing the slaves awake.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          65.\r\n\r\n                         96 CONTINUED: 96\r\n\r\n                          EPPS\r\n           Get up! Get up, we dance tonight!\r\n           We will not waste the evenin' with\r\n           yer laziness. Get up.\r\n\r\n                         \r\n\r\n                         97 97\r\n\r\n           INT. MASTER EPPS'S PLANTATION/MAIN HOUSE - NIGHT\r\n\r\n           Despite the lateness of the hour, the slaves are up and\r\n           now fully dressed. They take up position in the middle\r\n           of the floor. They wait, poised like actors. Solomon\r\n           strikes up a tune; Henry joins in with a pan flute and\r\n           the slaves dance. They do so very wearily. The whole of\r\n           it certainly more torture than pleasure.\r\n           Epps, whip in hand:\r\n\r\n                          EPPS\r\n           Where's yah merriment? Move yer\r\n           feet.\r\n           As the slaves twirl about Epps keeps an attentive eye on\r\n           Patsey. It should be quite clear that his primary\r\n           motivation for holding dances is so that he may view\r\n           Patsey twirl about the floor.\r\n           This fact is not lost on Mistress Epps. A few moments of\r\n           Epps's lust on display is all that the Mistress can bear.\r\n           Jealousy mounting, she snatches up a CARAFE. With all\r\n           her might she throws it at Patsey. It hits Patsey square\r\n           in the face. TOO THICK TO SHATTER, IT LEAVES HER BLOODY\r\n           AND WRITHING ON THE FLOOR. The dancing, the music stop.\r\n           The slaves, however, react as though it is not the first\r\n           time they've seen as much from the Mistress.\r\n           Mistress Epps, screaming like a hellion:\r\n\r\n                          MISTRESS EPPS\r\n           Sell her!\r\n\r\n                          EPPS\r\n           C'mon, now. Wha's this?\r\n\r\n                          MISTRESS EPPS\r\n           You will sell the negress!\r\n\r\n                          EPPS\r\n           You're talkin' foolish. Sell\r\n           little Pats? She pick with more\r\n           vigor than any other nigger!\r\n           Choose another ta go.\r\n\r\n                          MISTRESS EPPS\r\n           No other. Sell her!\r\n\r\n                          EPPS\r\n           I will not!\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           66.\r\n\r\n                         97 CONTINUED: 97\r\n\r\n                          MISTRESS EPPS\r\n           You will remove that black bitch\r\n           from this property, 'er I'll take\r\n           myself back to Cheneyville.\r\n\r\n                          EPPS\r\n           Back to that hog's trough where I\r\n           found you? Oh, the idleness of\r\n           that yarn washes over me. Do not\r\n           set yourself up against Patsey, my\r\n           dear. That's a wager on which you\r\n           will not profit. Calm yerself.\r\n           And settle for my affection,\r\n           'cause my affection you got. Or,\r\n           go. 'Cause I will rid myself of\r\n           yah well before I do away with\r\n           her!\r\n           Mistress Epps stands irate, lost in fury and unable to\r\n           even think of what to do. Eventually, optionless, she\r\n           storms away.\r\n           For a few beats there is only the sound of Patsey\r\n           sobbing.\r\n\r\n                          EPPS (CONT'D)\r\n           That damned woman! I won't have\r\n           my mood spoiled. I will not.\r\n           Dance!\r\n           Epps sends the whip in Solomon's direction. Solomon\r\n           responds by playing.\r\n           Treach literally drags the prone Patsey from the floor,\r\n           blood still spilling from her face. The slaves, as\r\n           ordered, return to dancing.\r\n\r\n                         \r\n\r\n                         98 98\r\n\r\n           EXT. MASTER EPPS'S PLANTATION - MORNING\r\n\r\n\r\n           -AUGUST, 1843-\r\n           The sun has only just risen above the horizon. FROM THE\r\n           GREAT HOUSE THE HORN IS BLOWN signaling the start of\r\n           another day.\r\n\r\n                         \r\n\r\n                         99 99\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/FIELD - DAY\r\n\r\n           Slaves are in the field picking cotton. They accompany\r\n           their work with a SPIRITUAL.\r\n\r\n                         \r\n\r\n          100 EXT. MASTER EPPS'S PLANTATION/GREAT HOUSE - LATER 100\r\n\r\n           As the slaves make their way in from the field, the\r\n           Mistress calls to Solomon. SHE HAS A PIECE OF PAPER IN\r\n\r\n           HAND.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           67.\r\n\r\n                         100 CONTINUED: 100\r\n\r\n                          MISTRESS EPPS\r\n           Platt...\r\n\r\n                          SOLOMON\r\n           Yes, Mistress.\r\n\r\n                          MISTRESS EPPS\r\n           Can you find your way to\r\n           Bartholomew's?\r\n\r\n                          SOLOMON\r\n           I can, ma'am.\r\n           Handing Solomon a sheet of paper.\r\n\r\n                          MISTRESS EPPS\r\n           This is a list of goods and\r\n           sundries. You will take it to be\r\n           filled and return immediately.\r\n           Tell Bartholomew to add it to our\r\n           debt.\r\n\r\n                          SOLOMON\r\n           I will, Mistress.\r\n           Solomon looks at the list. In a careless moment, Solomon\r\n           reads quietly from it. He catches himself, but not\r\n           before the Mistress notes his action. With high\r\n\r\n                          INQUISITIVENESS:\r\n\r\n                          MISTRESS EPPS\r\n           Where yah from, Platt?\r\n\r\n                          SOLOMON\r\n           I have told you.\r\n\r\n                          MISTRESS EPPS\r\n           Tell me again.\r\n\r\n                          SOLOMON\r\n           Washington.\r\n\r\n                          MISTRESS EPPS\r\n           Who were yah Master?\r\n\r\n                          SOLOMON\r\n           Master name of Freeman.\r\n\r\n                          MISTRESS EPPS\r\n           Was he a learned man?\r\n\r\n                          SOLOMON\r\n           I suppose so.\r\n\r\n                          MISTRESS EPPS\r\n           He learn yah ta read?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          68.\r\n\r\n                         100 CONTINUED: (2) 100\r\n\r\n                          SOLOMON\r\n           A word here or there, but I have\r\n           no understanding of the written\r\n           text.\r\n\r\n                          MISTRESS EPPS\r\n           Don't trouble yer self with it.\r\n           Same as the rest, Master bought\r\n           yah to work. Tha's all. And any\r\n           more'll earn yah a hun'red lashes.\r\n           Having delivered her cool advice, Mistress heads back\r\n           into the house.\r\n\r\n                         \r\n\r\n                         A101 A101 \r\n\r\n           EXT. ROAD - DAY\r\n\r\n           Solomon walks along a well-worn path, shopping bag draped \r\n           over one shoulder. We see his feet. As the walk slowly \r\n           gathers pace, Solomon suddenly turns left into dense \r\n           foliage. His tread is now a full blown sprint, trees \r\n           flash past as Solomon attacks his way through the woods. \r\n           The sound of branches cracking underneath. His feet, \r\n           heartbeat and breath almost deafening. He is desperate. \r\n           The violence of his advance abruptly stops, there is \r\n           silence. We see in a clearance a posse of patrollers, \r\n           preparing for a lynching of two young men. Solomon's \r\n           eyes meet theirs. The two men look back at Solomon with \r\n           a look of fear as one of the patrollers checks the noose \r\n           around their neck. Suddenly the bloodhounds start \r\n           barking and the patrollers turn in the direction of \r\n           Solomon. Solomon's whole body shakes with anticipation. \r\n\r\n                          PATROLLER \r\n\r\n                          (AGGRESSIVELY) \r\n           Boy, where are you going? \r\n\r\n                          SOLOMON \r\n           (almost tripping over \r\n\r\n                          HIS WORDS) \r\n           To the store, Sir, to \r\n           Bartholomew's. I was sent there \r\n           by Mistress Epps. \r\n           The patroller reaches out for Solomon's free pass around \r\n           his neck, yanking him forward. He looks at it. \r\n\r\n                          PATROLLER \r\n           Get there and get there quick. \r\n           The patroller kicks Solomon hard, sending him on his way. \r\n           Solomon walks on, looking one more time at the two young \r\n           men; again there is a moment of connection. \r\n           Solomon turns. The two men are hoisted up, kicking and \r\n           spitting, behind his shoulder. \r\n           Solomon finds himself back on the trail walking towards \r\n           Bartholomew's, his face now full of shock and \r\n\r\n                          (CONTINUED)\r\n\r\n           68A.\r\n\r\n          A101 CONTINUED: A101\r\n           trepidation. He walks, fighting to calm himself down. \r\n           We move behind him as he continues his journey, a lonely \r\n           figure. \r\n\r\n                         \r\n\r\n          101 INT. BARTHOLOMEW'S - LATER 101\r\n\r\n           A general store in the township of Holmesville. Solomon\r\n           stands at the counter as BARTHOLOMEW fills Mistress\r\n           Epps's order. Among the items set before Solomon is a\r\n\r\n           QUANTITY OF FOOLSCAP.\r\n           The items are collected for Solomon and placed in a sack.\r\n           Solomon giving little thought to them other than getting\r\n           them back to the mistress.\r\n           As he turns, he glimpses the regalia of slave restraints,\r\n           of all different guises; chains, muzzles for sale.\r\n\r\n                         \r\n\r\n                         102 102\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/GREAT HOUSE - LATER\r\n\r\n           Solomon returns and delivers the items to the Mistress.\r\n\r\n                          MISTRESS EPPS\r\n           Any trouble?\r\n\r\n                          SOLOMON\r\n           No, ma'am. No trouble.\r\n\r\n                         \r\n\r\n                         103 103\r\n\r\n           OMIT - MOVED TO A105\r\n\r\n                         \r\n\r\n          104 EXT. SHAW'S HOUSE - DAY 104\r\n\r\n\r\n           -JULY, 1844-\r\n           Sitting on the Grand house's Piazza, Patsey is having tea\r\n           with MISTRESS HARRIET SHAW, WHO IS A BLACK WOMAN. Though\r\n           once a slave, she is now comparatively refined though not\r\n           wholly so. The table where they sit is adorned with\r\n           white linens, and they are attended by a HOUSE NIGGER.\r\n           It makes for a tranquil surreal scene.\r\n\r\n           MASTER SHAW, A WHITE MAN, IS ON THE LAWN GROOMING A\r\n\r\n           HORSE.\r\n\r\n          69.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          A105 EXT. ROAD - DAY A105\r\n\r\n           Solomon is running flat out along the road. Running as\r\n           though his life depended on getting to his destination in\r\n           beyond a timely manner.\r\n\r\n                         \r\n\r\n          B105 EXT. SHAW'S HOUSE - DAY B105\r\n\r\n           Still running, slick with sweat, Solomon comes upon the\r\n\r\n           SHAW HOUSE.\r\n           As Solomon arrives:\r\n\r\n                          MASTER SHAW\r\n           Platt Epps, good Sunday morning.\r\n\r\n                          SOLOMON\r\n           Good morning, Master Shaw. I've\r\n           been sent by Master to retrieve\r\n           Patsey. May I approach?\r\n\r\n                          MASTER SHAW\r\n           You may.\r\n           Solomon makes his way over to the piazza.\r\n\r\n                          SOLOMON\r\n           Excuse me, Mistress Shaw.\r\n\r\n                          MISTRESS SHAW\r\n           Nigger Platt.\r\n\r\n                          SOLOMON\r\n           My apologies. Patsey, Master\r\n           wishes you to return.\r\n\r\n                          PATSEY\r\n           Sabbath day. I's free ta roam.\r\n\r\n                          SOLOMON\r\n           Understood. But the Master sent\r\n           me running to fetch you, and said\r\n           no time should be wasted.\r\n\r\n                          MISTRESS SHAW\r\n           Drink tea?\r\n\r\n                          SOLOMON\r\n           Thank you, Mistress, but I don't\r\n           dare.\r\n\r\n                          MISTRESS SHAW\r\n           Would you knowed Massa Epps's\r\n           consternation ta be any lessened\r\n           wit your timely return? Sit. Sit\r\n           and drink the tea that offered.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          70.\r\n\r\n          B105 CONTINUED: B105\r\n           Solomon knows better, but he sits and the Mistress has\r\n           tea poured for him.\r\n\r\n           MISTRESS SHAW (CONT'D)\r\n           What'n was Epps's concern?\r\n\r\n                          SOLOMON\r\n           ...I'd rather not say...\r\n\r\n                          MISTRESS SHAW\r\n           L'il gossip on the Sabbath be\r\n           fine. All things in moderation.\r\n           Solomon is not sure what to say. He struggles to be as\r\n           diplomatic as possible.\r\n\r\n                          SOLOMON\r\n           As you are aware, Master Epps can\r\n           be a man of a hard countenance.\r\n           There are times when it is\r\n           impossible to account for his\r\n           logic. You know he has ill\r\n           feelings toward your husband.\r\n\r\n                          MISTRESS SHAW\r\n           He do.\r\n\r\n                          SOLOMON\r\n           Master Epps has somehow come to\r\n           believe, as incorrectly as it may\r\n           be, that Master Shaw is... That\r\n           he is something of a lothario and\r\n           an unprincipled man. A misguided\r\n           belief born out of their mutual\r\n           competition as planters, no doubt.\r\n\r\n                          MISTRESS SHAW\r\n           No doubt...if not born outta truth\r\n           itself.\r\n           The Mistress waves to Shaw. Shaw, unsuspecting of the\r\n           conversation, waves back.\r\n\r\n                          SOLOMON\r\n           I'm certain Patsey's well being is\r\n           Master Epps's only concern.\r\n\r\n                          MISTRESS SHAW\r\n           Nothin' Epps desire come outta\r\n           concern.\r\n\r\n                          SOLOMON\r\n           I meant no disrespect.\r\n\r\n                          MISTRESS SHAW\r\n           He ain't heard you.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          71.\r\n\r\n          B105 CONTINUED: (2) B105\r\n\r\n                          SOLOMON\r\n           I meant no disrespect to you,\r\n           Mistress.\r\n\r\n                          MISTRESS SHAW\r\n           Ha! You worry for me? Got no\r\n           cause to worry for my\r\n           sensibilities. I ain't felt the\r\n           end of a lash in 'mo years than I\r\n           cain recall. Ain't worked a\r\n           field, neither. Where one time I\r\n           served, now I got others servin'\r\n           me. The cost to my current\r\n           existence be Massa Shaw\r\n           broadcasting his affections, 'n me\r\n           enjoyin' his pantomime of\r\n           fidelity. If that what keep me\r\n           from the cotton pickin' niggers,\r\n           that what it be. A small and\r\n           reasonable price to be paid 'fo\r\n           sure.\r\n           Looking toward Patsey, speaking with great empathy:\r\n\r\n           MISTRESS SHAW (CONT'D)\r\n           I knowed what it like to be the\r\n           object of Massa's predilections\r\n           and peculiarities. And I knowed\r\n           they can get expressed with\r\n           kindness or wit violence. A lusty\r\n           visit in the night, or a\r\n           visitation from the whip. And wit\r\n           my experience, if'n I can give\r\n           comfort, then comfort I give. And\r\n           you take comfort, Patsey; the Good\r\n           Lord will manage Epps. In His own\r\n           time the Good Lord will manage dem\r\n           all. Yes, Lordy, there's a day\r\n           comin' that will burn as an oven.\r\n           It comin' as sure as the Lord is\r\n           just. When His will be done...the\r\n           curse on the Pharos is a poor\r\n           example of all that wait 'fo the\r\n           plantation class.\r\n           Mistress Shaw turns her head to the side, catching a\r\n           slave's attention. As she does so, the slave, a YOUNG\r\n           WOMAN, commences to pour tea.\r\n           As if to punctuate her thought, the Mistress takes a sip\r\n           of her tea.\r\n\r\n                         \r\n\r\n                         105 105\r\n\r\n           EXT. EPPS'S PLANTATION - LATER\r\n\r\n           Solomon and Patsey are returning from Shaw's. Waiting on\r\n           the porch of the Great House, a drunk Epps beckons for\r\n           Patsey, his lewd intentions obvious.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           72.\r\n\r\n                         105 CONTINUED: 105\r\n\r\n                          EPPS\r\n           Pats...! Patsey!\r\n\r\n                          SOLOMON\r\n           Do not look in his direction.\r\n           Continue on.\r\n           Epps does not care to be ignored. He lifts himself and\r\n           moves toward the pair in a rage.\r\n\r\n                          EPPS\r\n           Patsey...!\r\n           Solomon moves between Epps and Patsey, cutting Epps off\r\n           as Patsey continues on. Playing up his \"ignorance\" of\r\n\r\n                          THE SITUATION:\r\n\r\n                          SOLOMON\r\n           Found her, Master, and brought her\r\n           back just as instructed.\r\n\r\n                          EPPS\r\n           What'd you jus now tell her?\r\n           What'd you say to Pats?\r\n\r\n                          SOLOMON\r\n           No words were spoken. None of\r\n           consequence.\r\n\r\n                          EPPS\r\n           Lie! Damned liar! Saw you\r\n           talkin' with 'er. Tell me!\r\n\r\n                          SOLOMON\r\n           I cannot speak of what did not\r\n           occur.\r\n           Epps grabs Solomon.\r\n\r\n                          EPPS\r\n           I'll cut your black throat.\r\n           Solomon pulls away from Epps, RIPPING HIS SHIRT IN THE\r\n           PROCESS. Epps gives chase. Solomon begins to run around\r\n           the large pig sty, easily keeping his distance. Epps,\r\n           however is undeterred. He moves after Solomon as\r\n           speedily as he can, which isn't very speedily at all.\r\n           And quickly he tires. Epps is forced to bend over and\r\n           suck air. Solomon maintains his distance, barely\r\n           breathing hard. His breath returned to him, Epps starts\r\n           up the chase again. Solomon runs on out of reach.\r\n           Shortly, Epps again stops, gets his breath... And now in\r\n           what should be quite comical, Epps again runs after\r\n           Solomon. Again, Epps's vigor leaves him before he can\r\n           even get close to the slave.\r\n           Dropping down to the dirt, in a show of regret and piety:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          73.\r\n\r\n                         105 CONTINUED: (2) 105\r\n\r\n                          EPPS (CONT'D)\r\n           Platt... Platt, liquor filled me.\r\n           I admit that it did, and I done\r\n           over reacted. It's the Lord's\r\n           day. Ain't nothin' Christian in\r\n           us carryin' on like this. Help me\r\n           ta my feet, and let us both pray\r\n           to the Lord for forgiveness.\r\n           Epps extends a hand to Solomon. Cautiously, Solomon\r\n           moves close, but not too close. As Solomon draws within\r\n           striking distance, Epps lunges for him. He chases\r\n           Solomon on until he is again out of breath and once more\r\n           drops down. And again offering a treaty:\r\n\r\n                          EPPS (CONT'D)\r\n           I'm all done in, Platt. I have\r\n           met my limitations, and I ain't\r\n           equal to 'em. I concede to yah,\r\n           but in the name of valor, help yer\r\n           master to his feet.\r\n           Solomon cautiously moves closer to help. Again he is\r\n           attacked by Epps - this time by knife. Sort of. Epps is\r\n           too drunk and tired to fully open the folding blade - and\r\n           chased far around the field by Epps. ALL OF THE\r\n\r\n           PRECEDING SHOULD BE MORE FUNNY THAN SHOCKING. A CHANGE\r\n\r\n           OF PACE FROM THE OTHERWISE NECESSARY BLEAKNESS OF SLAVE\r\n\r\n           LIFE.\r\n           Mistress Epps comes running from the house to the pair.\r\n\r\n                          MISTRESS EPPS\r\n           What? Wha's the fuss?\r\n\r\n                          SOLOMON\r\n           A misunderstanding is all. It\r\n           began when I was sent to retrieve\r\n           Patsey from where she'd taken\r\n           sabbatical at Master Shaw's. Upon\r\n           returning, Master Epps believed\r\n           Patsey and me to be in\r\n           conversation when we were not. I\r\n           tried to explain, but it lead to\r\n           all this.\r\n\r\n                          MISTRESS EPPS\r\n           What is it? Ya cain't remain the\r\n           Sabbath without her under your\r\n           eye? Ya are a no-account bastard.\r\n\r\n                          EPPS\r\n           Hold a moment...\r\n\r\n                          MISTRESS EPPS\r\n           A filthy, godless heathen. My bed\r\n           is too holy for yah ta share.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           74.\r\n\r\n                         105 CONTINUED: (3) 105\r\n\r\n                          EPPS\r\n           Wha's...wha's he been tellin' yah?\r\n\r\n                          MISTRESS EPPS\r\n           Of yer misbegotten ways.\r\n\r\n                          EPPS\r\n           And he would know what of\r\n           anythin'? I ain't even spoken\r\n           with him today. Platt, yah lyin'\r\n           nigger, have I? Have I?\r\n           Discretion being the better part and all, Solomon remains\r\n           silent.\r\n\r\n                          EPPS (CONT'D)\r\n           There; there's all the truth he\r\n           got. Damned nigger. Damn yah.\r\n           Epps pushes his way past the Mistress.\r\n\r\n                         \r\n\r\n                         106 106\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/FIELD - DAY\r\n\r\n\r\n           -AUGUST, 1844-\r\n           With the sun yet again high in the sky the slaves are\r\n           working the field picking cotton. As before THEY SING A\r\n           SPIRITUAL, the only thing that distracts them from the\r\n           tedium at hand.\r\n           But there is no distracting from the heat. We see Henry\r\n           begin to falter before it... And eventually collapse\r\n           right in the dirt. Though the other slaves take note,\r\n           none move to help him. None dare.\r\n           From Treach rather matter of factly:\r\n\r\n                          TREACH\r\n           Get him water.\r\n           Edward runs to fetch a gourd. He carries it to Henry,\r\n\r\n           DUMPS THE WATER ON HIM, BUT DOES NOT ACTUALLY GIVE HENRY\r\n\r\n           ANYTHING TO DRINK.\r\n           Roused, Henry rights himself.\r\n\r\n                          EDWARD\r\n           Go'won. Git up.\r\n           Unsteadily, Henry lifts himself and goes back to picking\r\n           cotton. He joins in again with the spiritual, as if the\r\n           song is all that can keep him going.\r\n\r\n                         \r\n\r\n                         107 107\r\n\r\n           INT. MASTER EPPS'S PLANTATION/SLAVE SHACKS - NIGHT\r\n\r\n\r\n           -OCTOBER, 1844-\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           75.\r\n\r\n                         107 CONTINUED: 107\r\n           The slaves are asleep. Epps arrives, again without\r\n           knocking, with his whip in hand. The slaves stir. Uncle\r\n\r\n                          ABRAM ASKS:\r\n\r\n                          UNCLE ABRAM\r\n           We dance tonight, massa?\r\n           Epps remains quietly focused on Patsey. And it's clear\r\n           from her apprehensive expression just what it is he's\r\n           come looking for. This time there is no escaping it. As\r\n           if to acknowledge the badness to come, Phebe lightly\r\n           cries.\r\n\r\n                         \r\n\r\n                         108 108\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/SMOKE HOUSE - NIGHT\r\n\r\n           On top of a wood pile, in the back of the smoke house -\r\n           Epps shoves Patsey. He stops, stands as if gathering his\r\n           manhood, then he's all over Patsey. He is rough and\r\n           clumsy. It looks like something between an awkward rape\r\n           and a virgin attempting his first sexual encounter.\r\n           Patsey does not respond in any way other than to\r\n           continually turn her head from Epps, but otherwise remain\r\n           as still as possible. If there is such a thing, she is\r\n           vicious with her passive aggressiveness.\r\n           Epps's frustration mounts until - as the Mistress Shaw\r\n           had cautioned - he crosses the line from passion to\r\n           violence. He begins slapping Patsey to get a response\r\n           from her. When that fails, he punches her which only\r\n           leads to him taking up his whip and lashing Patsey\r\n           MERCILESSLY. Still, she gives him nothing. Beaten,\r\n           Patsey sits in the dirt among the cotton, Epps deep\r\n           breathing above her. The desire for sex now having left\r\n           him.\r\n           Epps heads from the field. Patsey is left where she is.\r\n\r\n                         \r\n\r\n                         109 109\r\n\r\n           INT. BARTHOLOMEW'S - DAY\r\n\r\n\r\n           -NOVEMBER, 1844-\r\n           As before, Solomon waits as Bartholomew fills Mistress\r\n           Epps order. Among the items set before Solomon is\r\n           another quantity of foolscap.\r\n\r\n                         \r\n\r\n                         110 110\r\n\r\n           EXT. ROAD - DAY\r\n\r\n           Solomon is making his way back to the Epps plantation.\r\n           He carries with him a sack filled with the goods from the\r\n           store. As he walks, SOLOMON LOOKS AROUND CASUALLY. When\r\n           he is certain he is alone, he sets down the sack, opens\r\n           it and appropriates A SINGLE SHEET OF THE PAPER which he\r\n           folds and places in his pocket. That done, he cinches up\r\n           the sack and continues on his way.\r\n\r\n          76.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         111 OMIT 111\r\n\r\n                         \r\n\r\n          112 INT. EPPS'S PLANTATION/SLAVE SHACK - DAY 112\r\n\r\n           Solomon takes the slip of paper and hides it within his\r\n           fiddle. Perhaps the safest place he can think of. He\r\n           acts as though he's hiding away found gold. In reality\r\n           it's more than that. For Solomon the paper is a first\r\n           step toward freedom.\r\n\r\n                         \r\n\r\n                         113 113\r\n\r\n           INT. MASTER EPPS'S PLANTATION/MAIN HOUSE - NIGHT\r\n\r\n\r\n           -DECEMBER, 1844-\r\n           It's another night of Epps's forced revelry. Coming in\r\n           quick from the previous scene, we go from Solomon holding\r\n           his fiddle, to playing it as the slaves are again made to\r\n           dance.\r\n           Mistress Epps brings out a tray of freshly baked\r\n           pastries. She sets them down on a table.\r\n\r\n                          MISTRESS EPPS\r\n           A moment from the dancing. Come\r\n           sample what I baked for y'all.\r\n           The slaves, thankful for the rest as much as the food,\r\n           file toward the tray reciting a chorus of \"Thank you,\r\n           Mistress.\" As Patsey moves toward the pastries:\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           There'll be none for you, Patsey.\r\n           Patsey merely turns away. Her non responsiveness,\r\n           however, serves only to incite the Mistress. Screaming:\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           Yah see that? Did yah see the\r\n           look of insolence she give me?\r\n\r\n                          EPPS\r\n           Seen nothin' but her turn away.\r\n\r\n                          MISTRESS EPPS\r\n           Are you blind or ignorant? It was\r\n           hot, hateful scorn. It filled\r\n           that black face. Yah tell me yah\r\n           did'n see it, then yah choose not\r\n           to look, or yah sayin' I lie.\r\n\r\n                          EPPS\r\n           Whatever it was, it passed.\r\n\r\n                          MISTRESS EPPS\r\n           Is that how yah are with the\r\n           niggers? Let every ill thought\r\n           fester inside 'em. Look at 'em.\r\n\r\n                          (MORE) (CONTINUED)\r\n\r\n          77.\r\n\r\n                         113 CONTINUED: 113\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           They foul with it; foul with their\r\n           hate. You let it be, it'll come\r\n           back to us in the dark a night.\r\n           Yah want that? Yah want them\r\n           black animals to leave us gut like\r\n           pigs in our own sleep?\r\n           Epps isn't sure how to respond to the inchoate berating.\r\n           It's an invitation for the Mistress to continue.\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           You are manless. A damned eunuch\r\n           if ever there was. And if yah\r\n           won't stand for me, I'd pray you'd\r\n           at least be a credit to yer own\r\n           kind and beat every foul thought\r\n           from 'em.\r\n           Epps does nothing. The Mistress lets her anger loose.\r\n           She moves quickly to Patsey, DRIVES HER NAILS INTO THE\r\n\r\n           PATSEY'S FACE AND DRAWS THEM DOWN ACROSS HER FEATURES.\r\n\r\n           FIVE DEEP AND BLOODY GASHES ARE LEFT IN PATSEY'S SKIN,\r\n           the moment marked with appropriate screams. Patsey\r\n           collapses on the floor, covering her bleeding face.\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           Beat it from 'em!\r\n           Thoroughly cuckolded by the Mistress's actions, Epps\r\n           takes his whip and pulls Patsey out of the house. His\r\n           intentions are plain.\r\n           All the slaves remain silent. The Mistress, however,\r\n           displaying high satisfaction, entreats the others:\r\n\r\n           MISTRESS EPPS (CONT'D)\r\n           Eat. Fill yourselves. ...And\r\n           then we dance.\r\n           The slaves eat, but without a hint of levity.\r\n\r\n                         \r\n\r\n                         114 114\r\n\r\n           INT. MASTER EPPS'S PLANTATION/SLAVE SHACK - NIGHT\r\n\r\n           We come up on the slaves who lay sleeping. All except\r\n           for Patsey. She rises from her bedding, goes to a corner\r\n           of the cabin and removes something from a secretive\r\n           location. She then moves over to Platt.\r\n\r\n                          PATSEY\r\n           Platt... Platt, you awake?\r\n\r\n                          SOLOMON\r\n           I am.\r\n\r\n                          PATSEY\r\n           I have a request; an act of\r\n           kindness.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           78.\r\n\r\n                         114 CONTINUED: 114\r\n           Patsey displays what she took from hiding. It is a\r\n\r\n           LADY'S FINGER RING.\r\n\r\n                          PATSEY (CONT'D)\r\n           I secreted it from the Mistress.\r\n\r\n                          SOLOMON\r\n           Return it!\r\n\r\n                          PATSEY\r\n           It yours, Platt.\r\n\r\n                          SOLOMON\r\n           For what cause?\r\n\r\n                          PATSEY\r\n           All I ask: end my life. Take my\r\n           body to the margin of the swamp--\r\n           Solomon looks at Patsey as though she were insane.\r\n\r\n                          SOLOMON\r\n           No.\r\n\r\n                          PATSEY\r\n           Take me by the throat. Hold me\r\n           low in the water until I's still\r\n           'n without life. Bury me in a\r\n           lonely place of dyin'.\r\n\r\n                          SOLOMON\r\n           No! I will do no such thing.\r\n           The...the gory detail with which\r\n\r\n                          YOU SPEAK--\r\n\r\n                          PATSEY\r\n           I thought on it long and hard.\r\n\r\n                          SOLOMON\r\n           It is melancholia, nothing more.\r\n           How does such despair even come to\r\n           you?\r\n\r\n                          PATSEY\r\n           How can you not know? I got no\r\n           comfort in this life. If I cain't\r\n           buy mercy from yah, I'll beg it.\r\n\r\n                          SOLOMON\r\n           There are others. Beg them.\r\n\r\n                          PATSEY\r\n           I'm begging you!\r\n\r\n                          SOLOMON\r\n           Why? Why would you consign me to\r\n           damnation with such an un-Godly\r\n           request?\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          79.\r\n\r\n                         114 CONTINUED: (2) 114\r\n\r\n                          PATSEY\r\n           There is God here! God is\r\n           merciful, and He forgive merciful\r\n           acts. Won't be no hell for you.\r\n           Do it. Do what I ain't got the\r\n           strength ta do myself.\r\n           Solomon says nothing. Clearly he's not about to do the\r\n           deed. With nothing else to do, knowing she is damned\r\n           with every breath she draws, Patsey crawls back to her\r\n           spot on the floor and lays herself down.\r\n\r\n                          BLACK\r\n\r\n                         \r\n\r\n                         115 115\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/FIELD - DAY\r\n\r\n\r\n           -JULY, 1846-\r\n           Hard times on the planation. Where previously the field\r\n           in bloom was a carpet of white, it is now patchy and\r\n           under grown.\r\n           The slaves move through the field picking not cotton, but\r\n           rather COTTON WORMS from the plants. The cotton worms\r\n           have dined on the cotton and nearly destroyed the crop.\r\n           We see the cotton worms in extreme close-up, moving among\r\n           and destroying the cotton crop.\r\n           Epps is beside himself as he looks out over his ruined\r\n           field.\r\n\r\n                          EPPS\r\n           It is a plague.\r\n\r\n           TREACH (O.S.)\r\n           Cotton worm.\r\n\r\n                          EPPS\r\n           A plague! It's damn Biblical.\r\n           Two season God done sent a plague\r\n           to smite me. I am near ruination.\r\n           Why, Treach? What I done that God\r\n           hate me so? Do I not preach His\r\n           word?\r\n\r\n           TREACH (O.S.)\r\n           The whole Bayou sufferin'.\r\n\r\n                          EPPS\r\n           I don't care nothin' fer the damn\r\n           Bayou. I'm sufferin'.\r\n           Epps looks among his slaves at work, his enmity growing.\r\n\r\n                          EPPS (CONT'D)\r\n           It's that Godless lot. They\r\n           brought this on me. I bring 'em\r\n\r\n                          (MORE) (CONTINUED)\r\n\r\n           80.\r\n\r\n                         115 CONTINUED: 115\r\n\r\n                          EPPS (CONT'D)\r\n           God's word, and heathens they are,\r\n           they brung me God's scorn.\r\n           Crazed, Epps runs into the field, taking himself from\r\n           slave to slave delivering a whipping to all he can lay\r\n           his hands on.\r\n\r\n                          EPPS (CONT'D)\r\n           Damn you! Damn you all! Damn\r\n           you!\r\n\r\n                         \r\n\r\n                         116 116\r\n\r\n                          RE-OMIT\r\n\r\n                         \r\n\r\n          117 EXT. JUDGE TURNER'S PLANTATION - EVENING 117\r\n\r\n\r\n           -OCTOBER, 1846-\r\n           Henry, Bob, Uncle Abram and Solomon sit in the back of a\r\n           cart. SOLOMON HAS HIS FIDDLE WITH HIM. Epps has\r\n           delivered the men to JUDGE TURNER, a distinguished man\r\n           and extensive planter whose large estate is situated on\r\n           Bayou Salle within a few miles of the gulf. Epps and\r\n           Turner stand off to one side engaged in bargaining as\r\n           Henry, Bob, Uncle Abram and Solomon wait and watch.\r\n           One of the slaves whisper under their breath.\r\n\r\n                          EPPS' SLAVE\r\n           I hear cutting cane is twice as\r\n           hard as picking cotton.\r\n\r\n                          BOB\r\n           But at least we'll be away from\r\n           Master Epps.\r\n\r\n                          UNCLE ABRAM\r\n           Boy, you two have no sense.\r\n           Epps returns to his slaves and gives a parting\r\n           salutation.\r\n\r\n                          EPPS\r\n           Yer Judge Turner's for the season.\r\n           More if need be, until my crop\r\n           return. Yah'll bring no\r\n           disrespect to me, and yah'll bring\r\n           no biblical plagues to him. Be\r\n           decent, ere mark my words, I will\r\n           deliver an ungodly whippin'.\r\n\r\n                         \r\n\r\n                         118 118\r\n\r\n           INT. SLAVE SHACK - NIGHT\r\n\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           81.\r\n\r\n                         118 CONTINUED: 118\r\n           Slaves are crammed into the shack - LITERALLY ON TOP OF\r\n           EACH OTHER - as they try to sleep. Some lay, some sit\r\n           up. Packed in like cattle, there is barely room to move\r\n           let alone draw a deep, clean breath. There is a real\r\n           risk of suffocating in the mass. Some cough and wheeze.\r\n\r\n           A CHILD CRIES...\r\n           Among them is Solomon who must believe at this point that\r\n           his life has reached its very lowest point. The odds of\r\n           survival are slight, let alone the chance of actually\r\n           ever returning to his family. This clearly weighs on him\r\n           as he struggles to find anything like comfortable space\r\n           in the pen.\r\n\r\n                         \r\n\r\n                         119 119\r\n\r\n           EXT. CANE FIELDS - DAY\r\n\r\n           An OVERSEER is explaining to the new slaves - SOLOMON\r\n           AMONG THEM - how to cultivate cane. WITH A KNIFE IN HAND\r\n           he demonstrates the process:\r\n\r\n                          OVERSEER\r\n           Draw the cane from the rick, cut\r\n           the top and flags from the stalk,\r\n           understand? Leave only that part\r\n           which is sound and healthy. Cast\r\n           off the rest...\r\n\r\n                         \r\n\r\n                         120 120\r\n\r\n           EXT. CANE FIELDS - DAY\r\n\r\n\r\n           -NOVEMBER, 1846-\r\n           ABOUT THIRTY SLAVES are working the field. They are\r\n           divided into THREE GANGS. The first which draw the cane,\r\n           the next lay the cane in the drill, the last then hoe the\r\n           rows after.\r\n           Solomon is among a gang that draws and cuts, and he moves\r\n           with speed and skill. Certainly more so than he\r\n           displayed picking cotton.\r\n           Standing with his overseer, Judge Turner watches.\r\n\r\n                         \r\n\r\n                         121 121\r\n\r\n           INT. SLAVE SHACK - NIGHT\r\n\r\n           Again, the slaves have been herded into the shack and\r\n           pressed together.\r\n           As he tries to rest - sleep is nearly impossible -\r\n           Solomon finds himself face to face with a woman, ANNA.\r\n           She is awake. For a few beats she avoids eye contact\r\n           with Solomon. She seems, like Solomon, to be\r\n           unaccustomed to her surroundings and horribly frightened\r\n           by them. Eventually her eyes meet Solomon's. She makes\r\n           no sound, but great apprehension spills from her eyes.\r\n           Whatever's next, whatever horror awaits, she can barely\r\n           stand to face. Fear, proximity... They drive her hand\r\n\r\n                          (CONTINUED)\r\n\r\n          81A.\r\n\r\n                         121 CONTINUED: 121\r\n           to Solomon's. After a moment of seemingly reacquainting\r\n           herself with genuine human contact, the woman TAKES\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          82.\r\n\r\n                         121 CONTINUED: (2) 121\r\n           SOLOMON'S HAND AND PRESSES IT TO HER BREAST. Solomon\r\n           tries to jerk his hand away, but ANNA HOLDS IT IN PLACE.\r\n           Manipulating Solomon's hand, she begins to massage her\r\n           breast. Solomon takes no real pleasure in the act -\r\n           really, neither does Anna. THERE SHOULD BE A TRUE SENSE\r\n\r\n           ANNA IS JUST SO VERY, VERY DESPERATE FOR HUMAN CONTACT,\r\n\r\n           FOR THE NEED TO FEEL ALIVE AND LIKE A PERSON RATHER THAN\r\n\r\n           AN ANIMAL THAT EMOTIONALLY SHE IS WILLING TO ENGAGE\r\n\r\n           SOLOMON.\r\n           The need quickly compounds. Anna presses her lips to\r\n           Solomon's. Eventually, SHE DIRECTS HIS HAND BENEATH HER\r\n           DRESS AND BETWEEN HER LEGS. Solomon, with slightly more\r\n           compassion than a guy making union wages, BEGINS TO\r\n           MANIPULATE ANNA WITH HIS HAND. The act remains more\r\n           perfunctory than passionate.\r\n           We can see Anna moving toward climax and eventual\r\n           release. But more - or substantially less - than joyous\r\n           sex, it is really just a drug-like inoculation against\r\n           reality. But the feeling quickly fades. All that\r\n           remains, as with most chance encounters, is regret.\r\n           And there is shame, too. This is put on display as Anna\r\n           turns away from Solomon. As quickly as it began, it is\r\n           as though the act had not happened at all.\r\n\r\n                         \r\n\r\n                         122 122\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n          123 EXT. JUDGE TURNER'S PLANTATION/GREAT HOUSE - EVENING 123\r\n\r\n           Solomon waits outside the house on the porch. A house\r\n           servant - ZACHARY - approaches and admonishes Solomon.\r\n\r\n                          ZACHARY\r\n           Off the porch. Get off.\r\n           Like a dog shooed away, Solomon steps down.\r\n           Eventually Judge Turner exits the house and crosses to\r\n           Solomon.\r\n\r\n                          SOLOMON\r\n           ...Sir...\r\n\r\n                          JUDGE TURNER\r\n           Platt is it? Have you cultivated\r\n           cane previously?\r\n\r\n                          SOLOMON\r\n           No, sir, I have not.\r\n\r\n                          JUDGE TURNER\r\n           You take to it quite naturally.\r\n           Are you educated?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          83.\r\n\r\n                         123 CONTINUED: 123\r\n\r\n                          SOLOMON\r\n           Niggers are hired to work, not to\r\n           read and write.\r\n           Turner gives that a bit of consideration as he gives\r\n           Solomon a wary looking over.\r\n\r\n                         \r\n\r\n                          JUDGE TURNER\r\n           You play the fiddle?\r\n\r\n                          SOLOMON\r\n           I do.\r\n\r\n                          JUDGE TURNER\r\n           Willard Yarney, a planter up the\r\n           bayou, celebrates his anniversary\r\n           in a three week's time. I will\r\n           hold out your name to him. What\r\n           you earn is yours to keep.\r\n\r\n                          SOLOMON\r\n           Sir.\r\n\r\n                          JUDGE TURNER\r\n           Mind yourself, Platt.\r\n\r\n                          SOLOMON\r\n\r\n                          \r\n           Yes, sir.\r\n\r\n                         \r\n\r\n          124 EXT. TURNER PLANTATION - LATER (MOVED FROM 124) 124 \r\n\r\n           Work over, the slaves congregate to eat.\r\n           As Solomon eats, he takes note of the JUICE FROM SOME\r\n\r\n           BERRIES ON HIS PLATE.\r\n\r\n                         \r\n\r\n          125 EXT. TURNER'S PLANTATION - EVENING (MOVED FROM 125) 125 \r\n\r\n           Solomon plays with a piece of cane, fashions it into some\r\n           kind of writing tool, testing it in the mud. He then\r\n           brushes over the dirt with his hand.\r\n\r\n          84.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          126 EXT. TURNER PLANTATION - NIGHT (MOVED FROM 126) 126 \r\n\r\n           Secreted away out near the edge of the bayou and sitting\r\n           by a small fire, Solomon takes the slip of paper from his\r\n           fiddle. It is yellowed, showing age, but still usable.\r\n           Dipping the piece of cane - a quill - into the crushed\r\n           berries, Solomon attempts to write a bit on the paper.\r\n           The berry juice, too free-flowing, is unusable as ink.\r\n           Solomon returns the paper to the fiddle. He has some\r\n           scraps of food with him, which he snacks on.\r\n\r\n                         \r\n\r\n                         A127 A127 \r\n\r\n                          OMITTED\r\n\r\n                         \r\n\r\n          A127A INT. SLAVE SHACK - DAY A127A \r\n\r\n           We see a sharp object scratching onto a surface. The \r\n           tool moves on to form another mark. The sound is \r\n           repetitive and almost unbearable. As we move out, we see \r\n           the names Anne, Margaret, Alonzo. They are engraved onto \r\n           the violin, in the hidden area where Solomon would rest \r\n           his chin. \r\n           Solomon looks at it for a moment, moving his fingertips \r\n           across the engraving. His face full of loss. \r\n           Sadly, he lifts his instrument under his chin and leaning \r\n           his head to the side as if to play. \r\n\r\n                         \r\n\r\n          127 INT. YARNEY'S HOUSE - EVENING 127\r\n\r\n           A party has commenced at the noble home of one MR.\r\n           YARNEY. A group of REVELERS have gathered and are on the\r\n           dance floor, in fancy dress. Their faces are covered with\r\n           a variation of decorative masks. The party is a feast of\r\n           celebration. As entertainment, SOLOMON ACCOMPANIES A\r\n           GROUP OF MUSICIANS, no more than three. And as he does\r\n           so, they all play with jovial liveliness. Clearly a good\r\n           time is being had by all.\r\n\r\n                         \r\n\r\n                         128 128\r\n\r\n           EXT. ROAD - NIGHT\r\n\r\n           His playing done for the evening, Solomon is returning to\r\n           Judge Turner's on foot. There is only the moonlight with\r\n           which to light the way. As he walks, Solomon eats from a\r\n           HEARTY CHUCK OF BREAD. Obviously part of his haul from\r\n           the evening. Solomon again hears noises coming from the\r\n           brush just up ahead of him. Solomon tears off some of\r\n           the bread, kneels and holds it out before him.\r\n\r\n                          SOLOMON\r\n           C'mere. C'mon, boy.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          85.\r\n\r\n                         128 CONTINUED: 128\r\n           This time, there is no dog. Instead, from the dark and\r\n           the brush step TWO BLACK MEN. Solomon stands. He looks\r\n           the men over - their clothes tatters and they themselves\r\n           covered in dirt. It becomes quite clear they are not\r\n           just slaves. A fact confirmed when they step menacingly\r\n           toward Solomon, ONE WITH A SHIV IN HAND.\r\n           At first it seems they want Solomon's food or money.\r\n           Worse, THEY GO FOR HIS FIDDLE.\r\n           Solomon has but a moment to brace himself before he is\r\n           attacked, TAKING A CUT TO THE ARM. Solomon fights back,\r\n           PICKING UP A PINE KNOT and striking his attacker over the\r\n           head. That takes the fight out of him, and both men\r\n           retreat back the way they came leaving Solomon be.\r\n\r\n                         \r\n\r\n                         A129 A129\r\n\r\n           EXT. TURNER PLANTATION - NIGHT\r\n\r\n           Outside of the slave shacks Solomon's wound tended by\r\n           Uncle Abram. As he works on it:\r\n\r\n                          UNCLE ABRAM\r\n           Runaways I would expect. The\r\n           Bayou full with 'em. They nothin'\r\n           'mo dangerous than a nigger in\r\n           flight.\r\n\r\n                          SOLOMON\r\n           They acted out of desperation.\r\n\r\n                          UNCLE ABRAM\r\n           Act outta lunacy. Heads fulla\r\n           stories 'bout life up north. Yah\r\n           ever been north, Platt?\r\n\r\n                          SOLOMON\r\n           ...No...\r\n\r\n                          UNCLE ABRAM\r\n           And never should yah be. I hope\r\n           that yah never bear witness the\r\n           sorry condition of the northern\r\n           black. Got neither no purpose,\r\n           nor direction. They jus...they\r\n           jus fall about the streets in\r\n           search of sustenance of both body\r\n           and spirit.\r\n\r\n                          SOLOMON\r\n           You know this to be so?\r\n\r\n                          UNCLE ABRAM\r\n           Two of my massas tolt me.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          86.\r\n\r\n          A129 CONTINUED: A129\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         129 OMIT 129\r\n\r\n                         \r\n\r\n          130 EXT. TURNER PLANTATION - NIGHT 130\r\n\r\n\r\n           -FEBRUARY/MARCH, 1847-\r\n           Alone out on the edge of the Bayou, Solomon is playing a\r\n           low air on his violin WHILE SNACKING ON SCRAPS OF BACON.\r\n           As he plays, something appears in the distance. From the\r\n           edge of the bayou, coming forth like an apparition arisen\r\n           from the earth, is CELESTE. She is a young woman of\r\n           about 19 years of age and far whiter than most blacks.\r\n\r\n           \"IT REQUIRED CLOSE INSPECTION TO DISTINGUISH IN HER\r\n           FEATURE THE SLIGHTEST TRACE OF AFRICAN BLOOD.\" Beyond\r\n           that, she is pale and haggard, but still lovely.\r\n           Dressed in a white gown, she emerges from the water.\r\n           Draped on her dress, her period. A line in her skirt.\r\n           It's very visible, but not shocking. A ribbon of red in\r\n           her dress.\r\n           Celeste moves to Solomon without fear or hesitation. As\r\n           Solomon, startled, takes her in, Celeste says quite\r\n\r\n                          PLAINLY:\r\n\r\n                          CELESTE\r\n           I am hungry. Give me food.\r\n\r\n                          SOLOMON\r\n           Who are you?\r\n\r\n                          CELESTE\r\n           I'm hungry.\r\n           Solomon gives Celeste some of his food. Celeste,\r\n           famished, devours it.\r\n\r\n                          SOLOMON\r\n           What is your name?\r\n\r\n                          CELESTE\r\n           My name is Celeste.\r\n\r\n                          SOLOMON\r\n           What are your circumstances?\r\n\r\n                          CELESTE\r\n           I belong ta Massa Carey, and 'ave\r\n           been two days among da palmettoes.\r\n           Celeste is sick and cain't work,\r\n           and would rather die in the swamp\r\n\r\n                          (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           87.\r\n\r\n                         130 CONTINUED: 130\r\n\r\n                          CELESTE (CONT'D)\r\n           than be whipped to death by the\r\n           overseer. So I took myself away.\r\n           Massa's dogs won't follow me. The\r\n           patrollers 'ave tried to set dem\r\n           on me. But dey a secret between\r\n           dem and Celeste, and dey won't\r\n           mind the devilish orders of the\r\n           overseer.\r\n           Celeste lifts her head from the food on which she gnaws.\r\n\r\n                          CELESTE (CONT'D)\r\n           Do you believe me?\r\n\r\n                          SOLOMON\r\n           Yes.\r\n\r\n                          CELESTE\r\n           Why?\r\n\r\n                          SOLOMON\r\n           There are some whose tracks the\r\n           hounds will refuse to follow.\r\n\r\n                          CELESTE\r\n           Give me more food. I'm starvin'.\r\n\r\n                          SOLOMON\r\n           This is all my allowance for the\r\n\r\n                          REST OF--\r\n\r\n                          CELESTE\r\n           Give it to me.\r\n           Almost as if compelled, Solomon does as ordered. As she\r\n           eats, Celeste aggrandizes herself:\r\n\r\n                          CELESTE (CONT'D)\r\n           Most slaves escape at night. The\r\n           overseers are alert for such\r\n           chicanes. But Celeste tricked dem\r\n           'n alight in the middle of the day\r\n           wit the sun up at its highest.\r\n           The place of my concealment now\r\n           deep in the swamp, not half a mile\r\n           from Massa's plantation, and a\r\n           world apart. A world a tall\r\n           trees whose long arms make fo' a\r\n           canopy so dense dey keep away even\r\n           the beams of the sun. It twilight\r\n           always in Celeste's world, even in\r\n           the brightest day. I will live\r\n           there, and I will live freely.\r\n           The overseers are a cowardly lot.\r\n           Dey will not go where their dogs\r\n           show fear and where it always be\r\n           night. Others will join me in the\r\n           twilight, and we ain't gunna be\r\n           slaves no 'mo forever.\r\n\r\n                          (CONTINUED)\r\n\r\n          88.\r\n\r\n                         130 CONTINUED: (2) 130\r\n           Solomon isn't sure what to say. Before he can say\r\n\r\n                          ANYTHING:\r\n\r\n                          CELESTE (CONT'D)\r\n           Celeste will come to you again in\r\n           the night. You will have food for\r\n           her.\r\n           Celeste departs the way she came; as though she were a\r\n           vision.\r\n\r\n                         \r\n\r\n                         131 131\r\n\r\n           INT. JUDGE TURNER'S PLANTATION/FOOD STORAGE - NIGHT\r\n\r\n           Solomon stealthfully makes his way into the storage shed.\r\n           Dried and smoked meats are hung, and milled corn is\r\n           about. Taking out a handkerchief, Solomon begins to load\r\n           it with food. Not too much. Not so much his thievery\r\n           will be readily noticed, but he does avail himself.\r\n\r\n                         \r\n\r\n                         132 132\r\n\r\n           EXT. TURNER PLANTATION - NIGHT\r\n\r\n           Solomon plays his violin, but plays it with an anxious\r\n           nature as he waits.\r\n           Then, as before, a figure appears in the distance. It is\r\n           Celeste coming out of the night. She makes her way\r\n           directly to Solomon. With no greeting, she says:\r\n\r\n                          CELESTE\r\n           I am hungry.\r\n           Solomon gives Celeste the handkerchief he's filled. She\r\n           opens it, and begins to devour the food. As she eats:\r\n\r\n                          CELESTE (CONT'D)\r\n           I was rude, and didn't even ask yo\r\n           name.\r\n\r\n                          SOLOMON\r\n           Platt.\r\n\r\n                          (BEAT)\r\n           Solomon. Solomon is my true and\r\n           free name.\r\n\r\n                          CELESTE\r\n           Was you free?\r\n\r\n                          SOLOMON\r\n           I was. I am.\r\n           Solomon exposes his wrist, displays his tattoo as he\r\n\r\n                          ANNOUNCES:\r\n\r\n                          SOLOMON (CONT'D)\r\n           I remain free in my heart.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           89.\r\n\r\n                         132 CONTINUED: 132\r\n           Giving a laugh as though it's the silliest thing she's\r\n\r\n                          HEARD:\r\n\r\n                          CELESTE\r\n           Free heart means nothin if'n yo\r\n           body gunna die a slave.\r\n\r\n                          SOLOMON\r\n           I will not.\r\n\r\n                          CELESTE\r\n           How? Celeste knows you ain't\r\n           gunna run. Celeste knows it ain't\r\n           your nature.\r\n\r\n                          SOLOMON\r\n           I have a plan. I have a letter.\r\n\r\n                          CELESTE\r\n           A letter? How'll yah mail da\r\n           letter? Who yah trust to post it?\r\n           A nigger that can read and write\r\n           is a nigger that'll hang.\r\n           There is a pause. Solomon can't answer this question. It\r\n           is the glaring hole in his plan.\r\n           Having finished eating:\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          90.\r\n\r\n                         132 CONTINUED: (2) 132\r\n\r\n                          CELESTE (CONT'D)\r\n           Celeste will come again in de\r\n           night. You will bring her 'mo\r\n           food.\r\n\r\n                          SOLOMON\r\n           I risk discovery to take more.\r\n\r\n                          CELESTE\r\n           You will bring Celeste 'mo food.\r\n           And with that Celeste again moves back into the darkness.\r\n\r\n                         \r\n\r\n                         133 133\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n                         134 OMIT 134\r\n\r\n                         \r\n\r\n          135 EXT. TURNER PLANTATION - EVENING 135\r\n\r\n           Solomon is picking at the bark off a WHITE MAPLE.\r\n\r\n                         \r\n\r\n          136 EXT. TURNER PLANTATION - EVENING 136\r\n\r\n           In a tin cup, over a fire, Solomon boils the white maple\r\n           bark in just a bit of water.\r\n\r\n                         \r\n\r\n          137 INT. JUDGE TURNER'S PLANTATION/SLAVES CABIN - NIGHT 137\r\n\r\n           As others sleep, by the light of dying coals, Solomon\r\n           uses the quill to test the boiled bark. The liquid holds\r\n           as a form of ink. It is no?t ideal, but it is legible on\r\n           the page. Armed with this, Solomon writes his letter.\r\n\r\n                         \r\n\r\n                         138 138\r\n\r\n           EXT. TURNER PLANTATION - NIGHT\r\n\r\n           Solomon sits with Celeste. He relates his news to her.\r\n\r\n                          SOLOMON\r\n           I have my letter.\r\n\r\n                          CELESTE\r\n           Yah has your freedom then?\r\n\r\n                          SOLOMON\r\n           All that remains is to contrive\r\n           measures by which the letter can\r\n           safely be deposited in the post\r\n           office.\r\n           When Celeste speaks she is quite melancholy.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           91.\r\n\r\n                         138 CONTINUED: 138\r\n\r\n                          CELESTE\r\n           I have resolved to return to my\r\n           Massa.\r\n           Solomon gives an unnerved look. This is not good news.\r\n\r\n                          SOLOMON\r\n           Is it more food you need?\r\n\r\n                          CELESTE\r\n           I live in fear.\r\n\r\n                          SOLOMON\r\n           None will come after you in the\r\n           swamps.\r\n\r\n                          CELESTE\r\n           It ain't the patrollers I scared\r\n           of... At all seasons the howling\r\n           of wild animals can be heard at\r\n           night along the border of the\r\n           swamps. At first their calls were\r\n           welcomin'. Dey too was free, 'n I\r\n           thought dey greeted me like a\r\n           sistah. Lately, dey cries have\r\n           turned horrifyin'. They mean to\r\n           kill Celeste.\r\n\r\n                          SOLOMON\r\n           The solitude plays tricks. It's\r\n           your impression, nothing more. If\r\n           you go back to your master you\r\n           could face the same.\r\n\r\n                          CELESTE\r\n           My freedom been nothin' but a\r\n           daydream. So was Celeste's\r\n           thoughts of slaves conjoinin' in\r\n           the bayou.\r\n\r\n                          SOLOMON\r\n           Better the loneliness. You have\r\n           been free most of the summer.\r\n           Return now and your master will\r\n           make example of you.\r\n\r\n                          CELESTE\r\n           It is lonely dwellin' waiting for\r\n           others who won't never come.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          92.\r\n\r\n                         138 CONTINUED: (2) 138\r\n\r\n                          SOLOMON\r\n           Go north. Make your way by\r\n           night...\r\n\r\n                          CELESTE\r\n           It'll only be worse if'n Celeste\r\n           don't go back of her own will.\r\n\r\n                          SOLOMON\r\n           You won't be caught. The dogs\r\n           won't track you. You are...you\r\n           are unique. Celeste...\r\n\r\n                          CELESTE\r\n           You got alternatives, Solomon.\r\n\r\n                          SOLOMON\r\n           To return is to die!\r\n\r\n                          CELESTE\r\n           Celeste got no one to write a\r\n           letter to.\r\n           As if to punctuate her resolve, without a word more\r\n           Celeste departs toward the swamp. Solomon starts on into\r\n           the swamp after her.\r\n\r\n                          SOLOMON\r\n           Celeste... Celeste!\r\n           Solomon continues after Celeste, wading deeper into the\r\n           dark night and murky waters.\r\n\r\n                          SOLOMON (CONT'D)\r\n           Celeste, I will guide you north!\r\n           Wait, and I will take you.\r\n           Celeste is too nimble. She outpaces Solomon, continues\r\n           on and disappears into the night.\r\n\r\n                          SOLOMON (CONT'D)\r\n           Let me take you! Let me go with\r\n           you!\r\n           Solomon runs on, then splashes to a stop. He stumbles\r\n           around disoriented, calling into the blackness:\r\n\r\n                          SOLOMON (CONT'D)\r\n           Celeste...\r\n           Nothing. No answer. Not a human one. There are sounds\r\n           and echoes - some in the distance, some perhaps moving\r\n           closer - which, moment by moment, become more and more\r\n           frightening. Soon, Solomon realizes he is in quite\r\n           literally over his head; the water first chest deep, then\r\n           neck deep. With no way to orient himself, no means to\r\n           guide him in the dark, Solomon's reserve begins to\r\n           crumble. He thrashes in the water trying to find his way\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          93.\r\n\r\n                         138 CONTINUED: (3) 138\r\n           back to shore. No longer trying to save Celeste, Solomon\r\n           calls to her - desperately - for assistance.\r\n\r\n                          SOLOMON (CONT'D)\r\n           Celeste! Come to me, Celeste!\r\n           In that moment Solomon is quite certain he is nearly\r\n           done; that he will not find land, nor aid and that this\r\n           is his final moment. His panic should be that tangible.\r\n           It is either force of will, or survival instinct...or\r\n           maybe just pure luck that carries Solomon on until he\r\n           reaches first muddy ground, then firm footing. Hauling\r\n           himself onto the swamps edge, Solomon finally collapses\r\n           in a drenched, worn heap. His life spared, but Celeste\r\n           never to be seen again.\r\n\r\n                          BLACK\r\n\r\n                         \r\n\r\n                         139 139\r\n\r\n           EXT. EPPS'S PLANTATION - DAY\r\n\r\n\r\n           -MAY/JUNE, 1847-\r\n           We come up now outside of Master Epps's plantation. Epps\r\n           stands in the drive. He's in surprisingly good spirits\r\n           as Solomon, Uncle Abram, Henry and Bob trudge their way\r\n           wearily toward Epps and his other slaves who are\r\n           gathered.\r\n           The cotton field is in full bloom, the crop fully\r\n           returned.\r\n\r\n                          EPPS\r\n           A joyous day. A joyous day. Dark\r\n           times is behind us. Clean livin'\r\n           'n prayer done lifted the plague.\r\n           Indicating to the cotton:\r\n\r\n                          EPPS (CONT'D)\r\n           As thick 'n white as New England\r\n           snow. 'N now my niggers is\r\n           returned to me.\r\n\r\n                          (TO SOLOMON)\r\n           Heard Judge Turner gave you favor.\r\n           Oh, did you beguile him, Platt,\r\n           with your slick nigger ways?\r\n           Well, yah won't stand idle, boy.\r\n           Not on my land. Much work to do.\r\n           Days of old long since, eh?\r\n           Joyous! Joyous indeed!\r\n           Throughout Epps's welcome, Solomon's focus is on Patsey\r\n           who is lined up with the other slaves. SHE IS NOW MORE\r\n           HAGGARD THAN WHEN WE LAST SAW HER. Her face and arms\r\n           display many new scars. It's clear that in the\r\n           intervening years she has quite literally been a whipping\r\n           boy for Epps and the Mistress.\r\n\r\n          94.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          140 EXT. EPPS'S PLANTATION/COTTON FIELD - DAY 140\r\n\r\n\r\n           -JULY, 1847-\r\n           The slaves are out working on the field. White hands\r\n           appear, picking cotton: ARMSBY. He is wholly unskilled at\r\n           picking cotton, and he puts little effort into the job.\r\n           As we meet him he seems a decent sort if a little short\r\n           on self-motivation. In anachronistic terminology, he'd\r\n           be called a \"slacker.\" He joins in with the slaves,\r\n           singing a spiritual.\r\n\r\n                         \r\n\r\n                         141 141\r\n\r\n           INT. MASTER EPPS'S PLANTATION/GIN HOUSE - EVENING\r\n\r\n           As Epps said, it is days of long since. The slaves are\r\n           back to having their cotton weighed in the Gin House\r\n\r\n                          EPPS\r\n           Wiley...?\r\n\r\n                          TREACH\r\n           Two hundred sixty pounds.\r\n\r\n                          EPPS\r\n           Bob?\r\n\r\n                          TREACH\r\n           Three hundred forty pounds for\r\n           Bob.\r\n\r\n                          EPPS\r\n           Patsey?\r\n\r\n                          TREACH\r\n           Five hundred twenty pounds.\r\n\r\n                          EPPS\r\n           Tha's a girl. Don't never let me\r\n           down. Platt?\r\n\r\n                          TREACH\r\n           One hundred sixty pounds.\r\n           Before Treach is even done announcing the weight, Epps\r\n           has pulled Solomon aside to where Uncle Abram already\r\n           awaits his fate.\r\n\r\n                          EPPS\r\n           Armsby?\r\n\r\n                          TREACH\r\n           Sixty four pounds.\r\n           Epps speaks to Armsby sternly, but nothing of the manner\r\n           in which he would address the slaves.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           95.\r\n\r\n                         141 CONTINUED: 141\r\n\r\n                          EPPS\r\n           A good days labor would average\r\n           two hundred pounds.\r\n\r\n                          ARMSBY\r\n           Yes, sir.\r\n\r\n                          EPPS\r\n           I'm sure in time y'll develope as\r\n           a picker, but it takes effort,\r\n           boy. Put some damn effort into\r\n           it.\r\n\r\n                          ARMSBY\r\n           Yes, sir.\r\n           To Treach, regarding Solomon and Abram:\r\n\r\n                          EPPS\r\n           Take 'em out. Get to whippin'.\r\n           No force is needed. The slaves understand the situation.\r\n           They follow Treach out of the Gin house.\r\n\r\n                         \r\n\r\n                         142 142\r\n\r\n           EXT. EPPS'S PLANTATION/SLAVE SHACK - NIGHT\r\n\r\n           We come in after the punishment has been dealt. Patsey\r\n           tends to Uncle Abram's back as Armsby applies liniments\r\n           to Solomon's. As he does, Armsby muses:\r\n\r\n                          ARMSBY\r\n           It's a tragedy. How does such\r\n           come to pass? Working a field and\r\n           picking cotton like a lowly hand.\r\n           I'm of a damn sight better\r\n           station. And my desires never\r\n           lacked for a grandiose component,\r\n           though I will admit they have at\r\n           times been short on ingenuity.\r\n           But only at times. I've worked as\r\n           an overseer, you know.\r\n\r\n                          SOLOMON\r\n           I did not, sir.\r\n\r\n                          ARMSBY\r\n           Not \"sir.\" Just Armsby. Not owed\r\n           more than any other in the field.\r\n           I worked plantations from\r\n           Virginia, down into Alabama. I\r\n           could manage easy a hundred slaves\r\n           and have done so. But to toil in\r\n           the field? Never thought that\r\n           would come to pass. Never. But\r\n           times are desperate. Where once I\r\n           had said \"no\" to Epps and his\r\n           merger offerings, I returned cap\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          96.\r\n\r\n                         142 CONTINUED: 142\r\n\r\n                          ARMSBY (CONT'D)\r\n           in hand. ...Look at what I've\r\n           become.\r\n\r\n                          SOLOMON\r\n           How did you arrive at such a\r\n           place, if I may ask?\r\n\r\n                          ARMSBY\r\n           Ask. It's just conversation.\r\n           From a pocket Armsby produces a flask.\r\n\r\n                          ARMSBY (CONT'D)\r\n           I became a little too dependant on\r\n           the whisky, a little too\r\n           undependable on the job. Before\r\n           you say I'm just a sorry drunkard,\r\n           let me state my case: As reliable\r\n           employment as overseeing is, it's\r\n           no easy chore on the spirit. I\r\n           say no man of conscious can take\r\n           the lash to another human day in,\r\n           and day out without shredding at\r\n           his own self. Takes him to a\r\n           place where he either makes\r\n           excuses within his mind to be\r\n           unaffected... Or finds some way\r\n           to trample his guilty sensations.\r\n           Well, I trampled.\r\n           Armsby takes a drink.\r\n\r\n                          ARMSBY (CONT'D)\r\n           And with frequency.\r\n\r\n                          SOLOMON\r\n           Where is your place of birth?\r\n\r\n                          ARMSBY\r\n           Maryland. Have you traveled\r\n           there?\r\n\r\n                          SOLOMON\r\n           ...I cannot say that I have.\r\n\r\n                          ARMSBY\r\n           Fine country. More seasonal than\r\n           the bayou. A deal less humid.\r\n\r\n                          SOLOMON\r\n           Why did you leave it?\r\n\r\n                          ARMSBY\r\n           To make my fortune, of course. I\r\n           gave in to tales of wealth and\r\n           prosperity that were the lore of\r\n           the southern states: all that's\r\n           needed being a patch of land and a\r\n           few good growing seasons. Cotton,\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          97.\r\n\r\n                         142 CONTINUED: (2) 142\r\n\r\n                          ARMSBY (CONT'D)\r\n           or tobacco. And then locating a\r\n           proper bank in which to store your\r\n           riches. But such profitable\r\n           outcomes are reserved for the\r\n           plantation masters. It's the lot\r\n           of the rest of us to serve. So I\r\n           settled on being an overseer, and\r\n           failed as well at that. In the\r\n           meantime my dreams gave way to\r\n           reality. Now, I want nothing more\r\n           than to earn a decent wage.\r\n\r\n                          (BEAT)\r\n           And get myself home.\r\n           Armsby takes another drink and leans back.\r\n\r\n                         \r\n\r\n                         143 143\r\n\r\n           INT. MASTER EPPS'S PLANTATION/SLAVE SHACKS - MORNING\r\n\r\n\r\n           -AUGUST, 1847-\r\n           We again hear the sound of the HORN BLOWING signaling the\r\n           start of the work day for the slave.\r\n\r\n                         \r\n\r\n          144 EXT. MASTER EPPS'S PLANTATION/FIELD - DAY 144\r\n\r\n           With the sun yet again high in the sky the slaves are\r\n           working the field picking cotton. As before they sing a\r\n           spiritual, the only thing that distracts them from the\r\n           tedium at hand.\r\n           But there is no distracting from the heat. We see Uncle\r\n           Abram begin to falter and finally drop down to the\r\n           ground.\r\n           Treach calls to Edward:\r\n\r\n                          TREACH\r\n           Get him water.\r\n           Edward runs to fetch water which he carries to Abram and\r\n\r\n           DUMPS ON HIM...BUT ABRAM DOES NOT RISE. DOES NOT MOVE.\r\n           At this point, the sounds of the singing from the others\r\n           tapers off as they realize Abram isn't getting up.\r\n\r\n                         \r\n\r\n                         145 145\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/SLAVE CEMETERY - LATER\r\n\r\n           We are beyond the main of the plantation, the cotton\r\n           field in the background. We are at the slaves' cemetery,\r\n           a mixture of crude crosses and unsettled ground.\r\n           Solomon, Bob and Henry, now much visually older than when\r\n           we first saw them, are digging a grave in the dirt. The\r\n           uncovered body of Abram lays near. Having dug down an\r\n           appropriate distance, the three men take the body and,\r\n           very unceremoniously, place it into the ground. Holding\r\n\r\n                          (CONTINUED)\r\n\r\n          98.\r\n\r\n                         145 CONTINUED: 145\r\n           the shovel in his hands, and resting it by his feet, Bob\r\n           tilts his head down and closes his eyes. The others do\r\n           the same. Almost stutteringly, not really knowing what to\r\n\r\n                          SAY--\r\n\r\n                          BOB\r\n           I just want to say something about\r\n           Uncle Abram. He was a good man and\r\n           he always looked out for us since\r\n           we were little. God Bless him. God\r\n           love him. And God keep him.\r\n           That done, they begin to cover it with dirt. It is all\r\n           the more of a funeral that Abram will receive.\r\n\r\n                         \r\n\r\n                         146 146\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n                         147 OMIT 147\r\n\r\n                         \r\n\r\n          A148 EXT. MASTER EPPS'S PLANTATION/SLAVE CEMETERY - LATER A148\r\n\r\n           A female voice appears out of the blackness and begins to\r\n           sing solo, \"Went down to the river Jordan.\" A response of\r\n           \"Oh Yeah\" quickly follows. Again the singer continues,\r\n           \"where John baptized three.\"\r\n           The same faces we have seen on Epps' plantation, but now\r\n           filled with rapture, appear. It's as if the voices have\r\n           created a new form of awakening and presence. It seems to\r\n           transcend and translate in a strange way, joy. A joy\r\n           which has un-yet been seen on screen. A joy which has\r\n           been hidden, but a joy which is undoubtedly there. It's\r\n           captivating, infectious.\r\n           This should be a moving part of the film, which stirs the\r\n           audience and, for a moment, relieves them of the\r\n           seemingly chastising environment.\r\n           The singer continues, \"Well some say John was a Baptist,\r\n           some say John was a Jew, but I say John was a preacher,\r\n           because the Bible says so too, preach on Johnny.\" And\r\n           with that, the rest of the congregation chant \"I believe.\r\n           Oh, I believe.\"\r\n\r\n                         \r\n\r\n                         148 148\r\n\r\n           INT. EPPS'S PLANTATION/WOODS - NIGHT\r\n\r\n           Solomon goes to RETRIEVE THE SMALL PACKAGE FROM UNDER A\r\n           ROCK AT THE BASE OF A TREE. Solomon returns the letter to\r\n           hiding. He takes the money with him and cautiously moves\r\n           from the area.\r\n\r\n                         \r\n\r\n                         149 149\r\n\r\n                          OMIT\r\n\r\n          99.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          150 INT. EPPS'S PLANTATION/ARMSBY'S SHACK - LATER 150\r\n\r\n           The door opens. Solomon enters. Armsby is surprised to\r\n           see him. So much so, he isn't sure what greeting to\r\n           give. Solomon gives a blunt introduction. Re: the\r\n\r\n                          COINS:\r\n\r\n                          SOLOMON\r\n           The proceeds of my fiddling\r\n           performances. A few picayunes,\r\n           but all I have in the world. I\r\n           promise them to you if you will do\r\n           me the favor I require. But I beg\r\n           you not to expose me if you cannot\r\n           grant the request.\r\n\r\n                          ARMSBY\r\n           What do you ask?\r\n\r\n                          SOLOMON\r\n           First, your word, sir.\r\n\r\n                          ARMSBY\r\n           On my honor.\r\n\r\n                          SOLOMON\r\n           It is a simple enough request. I\r\n           ask only that you deposit a letter\r\n           in the Marksville post office.\r\n           And that you keep the action an\r\n           inviolable secret forever. The\r\n           details of the letter are of no\r\n           consequence. Even at that, there\r\n           would be an imposition of much\r\n           pain and suffering were it known I\r\n           was the author. A patron is what\r\n           I require, sir.\r\n\r\n                          ARMSBY\r\n           Where's the letter now?\r\n\r\n                          SOLOMON\r\n           ...It is not yet written. I will\r\n           have it in a day. Two at most, my\r\n           skill with composition as poor as\r\n           it is.\r\n           Armsby considers the request.\r\n\r\n                          ARMSBY\r\n           I will do it. And will accept\r\n           whatever payment is offered.\r\n           Solomon hesitates. In the moment, he's not so sure he\r\n           can wholly give himself over to trust.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          100.\r\n\r\n                         150 CONTINUED: 150\r\n\r\n                          ARMSBY (CONT'D)\r\n           To assist you, I put my own self\r\n           at risk. I will do so, but fair\r\n           compensation is all I ask.\r\n           Solomon hands over the money.\r\n\r\n                          ARMSBY (CONT'D)\r\n           Draw up your letter. We will meet\r\n           again. In two days?\r\n\r\n                          SOLOMON\r\n           In two days. ...Thank you.\r\n           Solomon exits.\r\n\r\n                         \r\n\r\n                         151 151\r\n\r\n           EXT. EPPS'S PLANTATION/COTTON FIELD - DAY\r\n\r\n           Solomon and the slaves pick cotton. Armsby is\r\n           conspicuously NOT laboring in the field. As Solomon\r\n           works he is watched by Epps. Watched more than he\r\n           normally is. For a moment it seems it might just be a\r\n           matter of perspective; Solomon's unease over his actions.\r\n           But soon Epps is joined by Armsby. The two men stand and\r\n           talk, their looks locked toward Solomon.\r\n           Whatever it is that is occurring between them continues\r\n           for a long, long moment. But Epps makes no move toward\r\n           Solomon. Solomon continues with his work.\r\n\r\n                         \r\n\r\n                         152 152\r\n\r\n           INT. EPPS'S PLANTATION/SLAVE SHACK - NIGHT\r\n\r\n           The slaves are at rest. Gripping his whip Epps enters,\r\n           without so much as a knock at the door. For a moment\r\n           there's curiosity; is he there for a dance, for\r\n           Patsey...?\r\n           Looking right to Solomon:\r\n\r\n                          EPPS\r\n           Get up.\r\n           Solomon does. Epps heads back out into the dark. He\r\n           says nothing, but his directive is clear: Follow me.\r\n\r\n                         \r\n\r\n          153 EXT. MASTER EPPS'S PLANTATION/SLAVE SHACK - CONTINUOUS 153\r\n\r\n           Solomon comes out into the dark. Nearly hidden in the\r\n           shadows is a bitter Epps. Despite the lack of light,\r\n           Epps's malevolence is quite clear. His whip attached to\r\n           his hip. As he speaks, he stokes himself with swigs from\r\n           a FLASK.\r\n           Epps puts his arm around Solomon, as if consoling a\r\n           friend, and guides him into the woods.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          100A.\r\n\r\n                         153 CONTINUED: 153\r\n\r\n                          EPPS\r\n           Well, boy. I understand I've got\r\n           a larned nigger that writes\r\n\r\n                          (MORE)\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          101.\r\n\r\n                         153 CONTINUED: (2) 153\r\n\r\n                          EPPS (CONT'D)\r\n           letters and tries to get white\r\n           fellows to mail 'em.\r\n           Solomon, hardly missing a beat, plays this off.\r\n\r\n                          EPPS (CONT'D)\r\n           Well, Armsby tol' me today the\r\n           devil was among my niggers. That\r\n           I had one that needed close\r\n           watchin' or he would run away.\r\n           When I axed him why, he said you\r\n           come over to him and waked him up\r\n           in the middle of the night and\r\n           wanted him to carry a letter to\r\n           Marksville. What have yah got to\r\n           say to that?\r\n\r\n                          SOLOMON\r\n           All I have to say, master, is all\r\n           that need be said. There is no\r\n           truth in it.\r\n\r\n                          EPPS\r\n           You say.\r\n\r\n                          SOLOMON\r\n           How could I write a letter without\r\n           ink or paper? There is nobody I\r\n           want to write to 'cause I hain't\r\n           got no friends living as I know\r\n           of. That Armsby is a lying\r\n           drunken fellow. You know this,\r\n           just as you know that I am\r\n           constant in truth. Now, master, I\r\n           can see what that Armsby is after,\r\n           plain enough. Didn't he want you\r\n           to hire him for an overseer?\r\n           A beat.\r\n\r\n                          SOLOMON (CONT'D)\r\n           That's it. He wants to make you\r\n           believe we're all going to run\r\n           away and then he thinks you'll\r\n           hire an overseer to watch us. He\r\n           believes you are soft soap. He's\r\n           given to such talk. I believe\r\n           he's just made this story out of\r\n           whole cloth, 'cause he wants to\r\n           get a situation. It's all a lie,\r\n           master, you may depend on't. It's\r\n           all a lie.\r\n           For a tense moment we are unsure which way Epps'll go.\r\n           Increasingly it become apparent that, shallow minded and\r\n           equally soused, Solomon has been able to fold Epps's\r\n           thoughts. In a low curse that clearly states his ill\r\n           intentions.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          102.\r\n\r\n                         153 CONTINUED: (3) 153\r\n           Revealed is a pocket knife, which all through the\r\n           conversation, unknown to us the audience, was pushed up\r\n           against Solomon's stomach. As Epps speaks, he closes it\r\n           and taps it on Solomon's shoulder.\r\n\r\n                          EPPS\r\n           I'm damned. I'll be god... Were\r\n           he not free and white, Platt.\r\n           Were he not free and white.\r\n           Epps heads off. Solomon is left to exhale a deep breath.\r\n\r\n                         \r\n\r\n                         154 154\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/WOODS - NIGHT\r\n\r\n           Having found a lonely spot, Solomon has struck a SMALL\r\n           FIRE. He has in his hand his letter. With no ceremony,\r\n           he casts the letter upon the flames and watches it burn.\r\n           And with it, at this time, seems all chance of him ever\r\n           being free. He stands and looks at it as if forever, as\r\n           ashes descend into the night sky.\r\n\r\n           FADE TO BLACK.\r\n\r\n                         \r\n\r\n                         A155 A155\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/GREAT HOUSE - DAY\r\n\r\n\r\n           -MARCH, 1852-\r\n           The slaves are now employed working on an extension to\r\n           the Great House. The slaves work under the direction of\r\n           MR. SAMUEL BASS, a between forty and fifty years old, of\r\n           light complexion and light hair. He is cool and self-\r\n           possessed, fond of argument, but always speaking with\r\n           extreme deliberation as well as a Canadian accent.\r\n\r\n                         \r\n\r\n                         B155 B155\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/GREAT HOUSE - DAY\r\n\r\n           As the slaves continue to work, there is a conversation\r\n           going on between Epps and Bass. Bass much skilled in the\r\n           art of sophistry, while Epps's arguments are fueled\r\n           mostly by emotion alone. Though at first Epps does\r\n           little more than joke his way around the facts.\r\n           Solomon, working still, can't help but overhear as Epps\r\n           offers Bass a drink, which Bass waves away.\r\n\r\n                          EPPS\r\n           Take it. You look unsettled.\r\n\r\n                          BASS\r\n           I'm well.\r\n\r\n                          EPPS\r\n           No shame in taking respite from\r\n           the heat; drink, shade. It's\r\n           ungodly for travelers. Hearty, or\r\n           otherwise.\r\n\r\n                          (CONTINUED)\r\n\r\n          102A.\r\n\r\n          B155 CONTINUED: B155\r\n           Bass gives a laugh.\r\n\r\n                          EPPS (CONT'D)\r\n           I meant no joke.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          103.\r\n\r\n          B155 CONTINUED: (2) B155\r\n\r\n                          BASS\r\n           Your humor is inadvertent.\r\n           Sensing perhaps Bass's laughter might be at his expense,\r\n           Epps presses.\r\n\r\n                          EPPS\r\n           Then share what's funny. Or what\r\n           ills you.\r\n\r\n                          BASS\r\n           I'm here to complete the work at\r\n           hand. As requested, and as paid.\r\n\r\n                          EPPS\r\n           Something rubs you wrongly.\r\n           Before I take further offense, I\r\n           offer you the opportunity to speak\r\n           on it.\r\n\r\n                          BASS\r\n           You ask plainly, I will tell you\r\n           plainly. What I find amusing: You\r\n           worry about my well being in the\r\n           heat but, quite frankly, the\r\n           condition of your laborers--\r\n\r\n                          EPPS\r\n           \"The condition of my...\" What in\r\n           the hell are you--\r\n\r\n                          BASS\r\n           It is horrid. It's all wrong.\r\n           All wrong, sir.\r\n\r\n                          EPPS\r\n           They ain't hired help. They're my\r\n           slaves.\r\n\r\n                          BASS\r\n           You say that with pride.\r\n\r\n                          EPPS\r\n           I say it as fact.\r\n\r\n                          BASS\r\n           If the conversation concerns what\r\n           is factual and what is not;\r\n           there's no justice nor\r\n           righteousness in slavery. I\r\n           wouldn't own a slave if I was rich\r\n           as Croesus, which I am not, as is\r\n           perfectly well understood. More\r\n           particularly among my creditors.\r\n           There's another humbug: the credit\r\n           system. Humbug, sir. No credit,\r\n           no debt. Credit leads a man into\r\n           temptation. Cash down is the only\r\n           thing that will deliver him from\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          104.\r\n\r\n          B155 CONTINUED: (3) B155\r\n\r\n                          BASS (CONT'D)\r\n           evil. But this question of\r\n           slavery; what right have you to\r\n           your niggers when you come down to\r\n           the point?\r\n\r\n                          EPPS\r\n           What right? I bought 'em. I paid\r\n           for 'em.\r\n\r\n                          BASS\r\n           Of course you did. The law says\r\n           you have the right to hold a\r\n           nigger, but begging the law's\r\n           pardon...it lies. Is everything\r\n           right because the law allows it?\r\n           Suppose they'd pass a law taking\r\n           away your liberty and making you a\r\n           slave?\r\n\r\n                          EPPS\r\n           Ha!\r\n\r\n                          BASS\r\n           Suppose.\r\n\r\n                          EPPS\r\n           That ain't a supposable case.\r\n\r\n                          BASS\r\n           Because the law states that your\r\n           liberties are undeniable? Because\r\n           society deems it so? Laws change.\r\n           Social systems crumble. Universal\r\n           truths are constant. It is a\r\n           fact, it is a plain fact that what\r\n           is true and right is true and\r\n           right for all. White and black\r\n           alike.\r\n\r\n                          EPPS\r\n           Whoa, whoa, whoa. Yah compare me\r\n           to a nigger, Bass? Yah might as\r\n           well ask what the difference is\r\n           between a white man and a baboon.\r\n           Now, I seen one of them critters\r\n           in Orleans that knowed just as\r\n           much as any nigger I got. Yah'd\r\n           call them fellers citizens, I\r\n           s'pose?\r\n\r\n                          BASS\r\n           Look here; you can't laugh me down\r\n           in that way. These niggers are\r\n           human beings. If they are allowed\r\n           to scale no higher than brute\r\n           animals, you and men like you will\r\n           have to answer for it. There's an\r\n\r\n                          ILL--\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          105.\r\n\r\n          B155 CONTINUED: (4) B155\r\n\r\n                          EPPS\r\n           Ahhh!\r\n\r\n                          BASS\r\n           A fearful ill, resting on this\r\n\r\n                          NATION--\r\n\r\n                          EPPS\r\n           You betray yourself a foreigner!\r\n\r\n                          BASS\r\n           That will not go unpunished\r\n           forever. There will be a\r\n           reckoning yet.\r\n\r\n                          EPPS\r\n           You like to hear yourself talk,\r\n           Bass, better than any man I know\r\n           of. Yah'd argue that black was\r\n           white, or white black if anybody\r\n           would contradict you. A fine\r\n           supposition if yah lived among\r\n           Yankees in New England. But yah\r\n           don't.\r\n\r\n                          (POINTED)\r\n           You most assuredly do not.\r\n\r\n                         \r\n\r\n                         155 155\r\n\r\n           EXT. MASTER EPPS'S PLANTATION - DAY\r\n\r\n           It's the Sabbath. The slaves are left to themselves to\r\n           do their own chores. At the moment the female slaves are\r\n           washing their clothes in large cauldrons, slapping their\r\n           clothes against washing boards and hanging them up to dry\r\n           near to their living quarters behind the plantation. It\r\n           is a sight of ritual. Missing from the field of labor is\r\n           Patsey, for whom Epps hollers.\r\n\r\n                          EPPS\r\n           Patsey... Patsey!\r\n           A drunk Epps asks of the slaves:\r\n\r\n                          EPPS (CONT'D)\r\n           Where is she? Where is Patsey?\r\n           No one answers.\r\n\r\n                          EPPS (CONT'D)\r\n           Talk, Damn you!\r\n\r\n                          PHEBE\r\n           We know nothin' of her, Massa.\r\n\r\n                          EPPS\r\n           The hell you don't! You know\r\n           where she is! She run off, ain't\r\n           she? She's escaped, and you\r\n           miserable black dogs stand like\r\n\r\n                          (MORE)\r\n\r\n                          (CONTINUED)\r\n\r\n          106.\r\n\r\n                         155 CONTINUED: 155\r\n\r\n                          EPPS (CONT'D)\r\n           the deef and dumb. Speak! Speak!\r\n           Not a word spoken.\r\n\r\n                          EPPS (CONT'D)\r\n           My best cotton picking nigger! My\r\n           best.\r\n           A beat.\r\n\r\n                          EPPS (CONT'D)\r\n           I'd give yah all up for her.\r\n           Where she gone?\r\n           The slaves say nothing. There is nothing for them to\r\n           say. They don't know where she is. Eventually Epps\r\n           drops into true sorrow.\r\n\r\n                          EPPS (CONT'D)\r\n           She gone... My Pats gone.\r\n\r\n                         \r\n\r\n                         156 156\r\n\r\n           EXT. EPPS'S PLANTATION - LATER\r\n\r\n           Epps sits on the piazza looking quite forlorn. He looks\r\n           up only to see PATSEY RETURNING TO THE PLANTATION. Epps\r\n           steps up to greet her, with anger rather than relief.\r\n           As they hear his angry voice, the slaves step around from\r\n           where they are hanging their laundry to dry. Treach is\r\n           near as well.\r\n\r\n                          EPPS\r\n           Run off. Run off, did you?\r\n\r\n                          PATSEY\r\n\r\n                          MASSA EPPS--\r\n\r\n                          EPPS\r\n           You miserable wench! Where you\r\n           been?\r\n\r\n                          PATSEY\r\n           I been nowhere.\r\n\r\n                          EPPS\r\n           Lies to your misdeeds!\r\n\r\n                          PATSEY\r\n           The Sabbath day, Massa. I took me\r\n           a walk to commune wit da Lord.\r\n\r\n                          EPPS\r\n           Bring the Lord into yer\r\n           deceptions? Yah Godless...\r\n           Shaw's. Comin' from Shaw's\r\n           plantation weren't yah?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          106A.\r\n\r\n                         156 CONTINUED: 156\r\n\r\n                          PATSEY\r\n           ...No...\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          107.\r\n\r\n                         156 CONTINUED: (2) 156\r\n\r\n                          EPPS\r\n           Yah took yerself ta pleasure Shaw.\r\n           Yah gave baser passion to that\r\n           unblushin' libertine!\r\n           Solomon tries to intervene:\r\n\r\n                          SOLOMON\r\n\r\n                          MASTER EPPS--\r\n\r\n                          EPPS\r\n           Now yah speak? Now that yah want\r\n           to add to 'er lies yah find yer\r\n           tongue.\r\n           Epps goes to strike Solomon, but Patsey pulls his arm\r\n           back.\r\n\r\n                          PATSEY\r\n           Do not strike him. I went to\r\n           Massa Shaw's plantation!\r\n\r\n                          EPPS\r\n           Yah admit it.\r\n\r\n                          PATSEY\r\n           Freely. And you know why.\r\n           Patsey takes soap from the pocket of her dress.\r\n\r\n                          PATSEY (CONT'D)\r\n           I got this from Mistress Shaw.\r\n           Mistress Epps won't even grant me\r\n           no soap ta clean with. Stink so\r\n           much I make myself gag. Five\r\n           hundred pounds 'a cotton day in,\r\n           day out. More than any man here.\r\n           And 'fo that I will be clean; that\r\n           all I ax. Dis here what I went to\r\n           Shaw's 'fo.\r\n\r\n                          EPPS\r\n           You lie...\r\n\r\n                          PATSEY\r\n           The Lord knows that's all.\r\n\r\n                          EPPS\r\n           You lie!\r\n\r\n                          PATSEY\r\n           And you blind wit yer own\r\n           covetousness. I don't lie, Massa.\r\n           If you kill me, I'll stick ta\r\n           that.\r\n\r\n                          EPPS\r\n           I'll learn you to go to Shaw's.\r\n           Treach, go get some line.\r\n\r\n                          (CONTINUED)\r\n\r\n          108.\r\n\r\n                         156 CONTINUED: (3) 156\r\n           Treach runs quickly to the tool shed. In short order he\r\n           returns with the rope in hand.\r\n\r\n                          EPPS (CONT'D)\r\n           Strip her. Strike her bare 'n\r\n           lash her to the post.\r\n           Mistress Epps has now come from the Great House. She\r\n           gazes on the scene with an air of heartless satisfaction.\r\n           Now tied to the post, Epps stands behind Patsey with his\r\n           whip.\r\n\r\n                          EPPS (CONT'D)\r\n           Yah done this to yerself, Pats!\r\n           Epps hoists the whip to strike, holds it high...but no\r\n           matter his rage, Epps cannot bring himself to deliver the\r\n           blow. He looks to Mistress Epps who now stands gloating\r\n           and spurring him on.\r\n\r\n                          MISTRESS EPPS\r\n           Do it! Strike the life from her.\r\n           Epps again hoists the whip. It trembles in his hand\r\n           ahead of the act... But he does not have it in him to\r\n           deliver such a beating. Turning to Solomon, thrusting\r\n           the whip at him:\r\n\r\n                          EPPS\r\n           Beat her.\r\n           Solomon doesn't move. Epps shoves the whip into his\r\n           hand.\r\n\r\n                          EPPS (CONT'D)\r\n           Give her the whip. Give it all to\r\n           her!\r\n           Patsey, begging to Solomon:\r\n\r\n                          PATSEY\r\n           I'd rather it you, Platt.\r\n\r\n                          EPPS\r\n           Strike her, or yah'll get the\r\n           same!\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          109.\r\n\r\n                         156 CONTINUED: (4) 156\r\n           Solomon takes a step back. He unfurls the whip... He\r\n           begins to whip Patsey. Lash after lash, Patsey squirms\r\n           before it. Epps eyes fill with tears, he is nearly too\r\n           distraught to watch.\r\n           But the Mistress... She is not satisfied with Solomon's\r\n           half-hearted effort.\r\n\r\n                          MISTRESS EPPS\r\n           He pantomimes. There ain't barely\r\n           a welt on her. That's what your\r\n           niggers make of yah; a fool fer\r\n           the takin'.\r\n           Epps's grief is replaced by fury. EPPS GRABS THE PISTOL\r\n           FROM TREACH'S HOLSTER and draws down on the slaves.\r\n\r\n                          EPPS\r\n           Yah will strike her. Yah will\r\n           strike her until her flesh is rent\r\n           and meat and blood flow equal, or\r\n           I will kill every nigger in my\r\n           sight!\r\n           Solomon can't strike a blow, even if it means his life.\r\n           But from the ground, from Patsey:\r\n\r\n                          PATSEY\r\n           Do it, Platt. Don't stop until I\r\n           am dead.\r\n           What else can he do? Solomon begins to whip, to truly\r\n           whip Patsey. Her back welts, then tears... Patsey\r\n           screams in agony. Solomon strikes again and again...\r\n           After a full thirty lashes Solomon looks to Epps, who is\r\n           not satisfied.\r\n\r\n                          EPPS\r\n           Until I say no more! I ain't said\r\n           nothing!\r\n           Solomon strikes another ten to fifteen times. By now, as\r\n           promised, Patsey's back has been reduced to LITTLE MORE\r\n\r\n           THAN TORN MEAT AND BLOOD.\r\n           Finally, Solomon holds low the whip. He can and will do\r\n           no more.\r\n\r\n                          EPPS (CONT'D)\r\n           Strike her! Strike her!\r\n           Solomon will not. Epps takes up the whip and whips\r\n           Patsey with \"ten fold\" greater force than he had. The\r\n           painfully loud and angry curses of Epps load the air.\r\n           Patsey by now is terribly lacerated, literally flayed.\r\n           The lash wet with blood which flowed down her sides and\r\n           dropped upon the ground. At length Patsey ceases\r\n           struggling. Her head sinks listlessly on the ground.\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          110.\r\n\r\n                         156 CONTINUED: (5) 156\r\n           Her screams and supplications gradually decrease and die\r\n           away into a low moan. It would seem that she was dying.\r\n           Solomon, screaming at Epps:\r\n\r\n                          SOLOMON\r\n           Thou devil! Sooner or later,\r\n           somewhere in the course of eternal\r\n           justice thou shalt answer for this\r\n           sin!\r\n           Though Epps fronts rage, there should be underlying\r\n           anguish for what he has done to his beloved Pats.\r\n\r\n                          EPPS\r\n           No sin! There is no sin! A man\r\n           does how he pleases with his\r\n           property. At the moment, Platt, I\r\n           am of great pleasure. You be\r\n           goddamn careful I don't come to\r\n           wantin' to lightenin' my mood no\r\n           further.\r\n           By contrast to this horror, the field of cotton smiles in\r\n           the warm sunlight. The birds chirp merrily amidst the\r\n           foliage of the tress. Peace and happiness seems to reign\r\n           everywhere.\r\n           Everywhere else.\r\n           Epps leaves Patsey to herself. He says not a word to the\r\n           Mistress as he passes. The Mistress herself heads back\r\n           into the house.\r\n           Solomon unties Patsey, lifts her and takes her to the\r\n           cabin.\r\n\r\n                         \r\n\r\n                         157 157\r\n\r\n           INT. CABIN - LATER\r\n\r\n           Patsey is laid on some boards where she remains for a\r\n           long time with eyes closed and groaning in agony. Phebe\r\n           applies melted tallow to her wounds, and all try to\r\n           assist and console her.\r\n           In time Patsey opens her eyes. She looks to Solomon.\r\n           She does not say a word. She just looks at him...and\r\n           then her eyes close again.\r\n\r\n                         \r\n\r\n                         158 158\r\n\r\n           MOVED TO A155\r\n\r\n                         \r\n\r\n          159 MOVED TO B155 159\r\n\r\n          111.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          160 INT. MASTER EPPS'S PLANTATION/GREAT HOUSE/ADDITION - 160\r\n\r\n\r\n                          EVENING\r\n\r\n           -APRIL, 1852-\r\n           Solomon and Bass are working together alone on the\r\n           extension. From the amount of work that's been done on\r\n           it, it should be obvious that days have now passed.\r\n           Solomon makes a cautious approach to Bass. As casually\r\n           as he can he inquires:\r\n\r\n                          SOLOMON\r\n           Master Bass, I want to ask you\r\n           what part of the country you came\r\n           from?\r\n\r\n                          BASS\r\n           No part of this land. I was born\r\n           in Canada. Now guess where that\r\n           is.\r\n\r\n                          SOLOMON\r\n           Oh, I know where Canada is. I\r\n           have been there myself.\r\n\r\n                          BASS\r\n           Have you?\r\n\r\n                          SOLOMON\r\n           Montreal and Kingston and\r\n           Queenston and a great many places.\r\n           And I have been in York state,\r\n           too. Buffalo and Rochester and\r\n           Albany, and can tell you the names\r\n           of the villages on the Erie canal\r\n           and the Champlain canal.\r\n           Bass gives Solomon a long and curious stare.\r\n\r\n                          BASS\r\n           Well traveled for a slave. How\r\n           came you here?\r\n\r\n                          SOLOMON\r\n           Master Bass, if justice had been\r\n           done I never would have been here.\r\n\r\n                          BASS\r\n           How's this? Tell me all about it.\r\n\r\n                          SOLOMON\r\n           I am afraid to tell you, though I\r\n           don't believe you would tell\r\n           Master Epps if I should.\r\n\r\n                          BASS\r\n           Every word you speak is a profound\r\n           secret.\r\n\r\n                          (CONTINUED)\r\n\r\n          112-115.\r\n\r\n                         160 CONTINUED: 160\r\n           Solomon holds a moment. Hasn't he heard the same promise\r\n           before? Prior to Solomon stating his case, WE FADE TO:\r\n\r\n                         \r\n\r\n          161 INT. MASTER EPPS'S PLANTATION / ADDITION - DAY 161\r\n\r\n           Hours have passed. Bass reflects on the story that Epps\r\n           has told in the intervening.\r\n\r\n                          BASS\r\n           How many years all told?\r\n\r\n                          SOLOMON\r\n           Just nearly...just passed eleven.\r\n\r\n                          BASS\r\n           Your story is...it is amazing, and\r\n           in no good way.\r\n\r\n                          SOLOMON\r\n           Do you believe, sir, in justice as\r\n           you have said?\r\n\r\n                          BASS\r\n           I do.\r\n\r\n                          SOLOMON\r\n           That slavery is an evil that\r\n           should befall none?\r\n\r\n                          BASS\r\n           I believe so.\r\n\r\n                          SOLOMON\r\n           If you truly do, I would ask...I\r\n           would beg that you write my\r\n           friends in the north, acquainting\r\n           them with my situation and\r\n           beseeching them to forward free\r\n           papers, or take such steps as they\r\n           might consider proper to secure my\r\n           release.\r\n           Bass looks at Solomon, holding his gaze for more than a\r\n           prolonged beat.\r\n\r\n                          SOLOMON (CONT'D)\r\n           My daughter Margaret is possibly\r\n           now 19 and my son Alonzo, 16. I\r\n           miss them so. It would be an\r\n           unspeakable happiness to clasp my\r\n           wife and my family again.\r\n           Bass hands Solomon an end of a long plank of wood and\r\n           looks over his shoulder, as if to camouflage the\r\n           conversation by work. They both lift it toward the\r\n           floorboards. Finally Bass speaks.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n           116.\r\n\r\n                         161 CONTINUED: 161\r\n\r\n                          BASS\r\n           I have always forgone\r\n           relationships and family. I did\r\n           once have a sweetheart who I loved\r\n           deeply.\r\n           Bass points to a measuring tool, which Solomon\r\n           immediately hands over.\r\n\r\n                          BASS (CONT'D)\r\n           But that was a long, long time\r\n           ago. I've been traveling this\r\n           country for the best part of\r\n           twenty years. My freedom is\r\n           everything. The fact that I can\r\n           walk out of here tomorrow gives me\r\n           most pleasure. I see the aching in\r\n           your eyes, the pain of not being\r\n           attached to your loved ones. My\r\n           life doesn't mean much to anyone,\r\n           but it seems your life means a lot\r\n           to a lot of people. What you have\r\n           just said to me scares me, and I\r\n           must say, sir, I am afraid. Not\r\n           just for you, but for me.\r\n           They continue working, fixing the floorboards in unison.\r\n           Solomon, slightly confused.\r\n\r\n                          BASS (CONT'D)\r\n           I will write your letter sir, for\r\n           if I could bring freedom to you,\r\n           it will be more than a pleasure.\r\n           It will be a duty. Now, would you\r\n           be so kind as to pass me those\r\n           nails, sir.\r\n           We pull back to reveal the two men dwarfed by the\r\n           unfinished structure. They continue to work, as if the\r\n           conversation had never occurred.\r\n\r\n                         \r\n\r\n                         162 162\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n                         163 OMIT 163\r\n\r\n                         \r\n\r\n                         164 OMIT 164\r\n\r\n                         \r\n\r\n          A165 EXT. SWAMP TBD A165\r\n\r\n           Solomon walks a path he has walked a thousand times or\r\n           more on his way back from Bartholomew's - sack familiarly\r\n           slung over his right shoulder. Drearily he walks. His\r\n           eyes acknowledge something we yet cannot see to his left.\r\n           Almost simultaneously, his eyes retract back to the path\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          116A.\r\n\r\n          A165 CONTINUED: A165\r\n           towards Epps'. As he passes out of shot, the evidence of\r\n           what he was looking at is revealed.\r\n           FEET hang at the top right hand corner of the frame. A\r\n           woman, who has been lynched.\r\n\r\n                         \r\n\r\n                         165 165\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/ADDITION - DAY\r\n\r\n\r\n           -SEPTEMBER, 1852-\r\n\r\n                          SLOW DISSOLVE\r\n           To a now virtually complete, half-painted white gazebo.\r\n           Slaves continue to work on it. As they do so, Bass peels\r\n           away from the structure to have an overview. He beckons\r\n           Solomon toward him, out of earshot from the slaves who\r\n           are continuing to work on the gazebo. As Solomon\r\n           approaches, Bass shouts-\r\n\r\n                          BASS\r\n           And bring those markers!\r\n           Solomon gathers a clutch of markers in his hands and\r\n           approaches Bass.\r\n\r\n                          BASS (CONT'D)\r\n           No letter yet.\r\n\r\n                          SOLOMON\r\n           You are certain?\r\n           Bass takes a marker from Solomon and slides it into the\r\n           earth.\r\n\r\n                          BASS\r\n           I have inquired thoroughly. More\r\n           than is safe for either of us.\r\n           Bass takes another and pokes it into the ground,\r\n           improvising a pathway towards the gazebo.\r\n\r\n                          BASS (CONT'D)\r\n           Solomon...I have a job or two on\r\n           hand which will be completed\r\n           shortly... The work here has\r\n           grown sparse.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          117.\r\n\r\n                         165 CONTINUED: 165\r\n           Bass doesn't need to spell things out for Solomon.\r\n           Solomon's understanding of the finality of the situation\r\n           should be very clear.\r\n\r\n                          BASS (CONT'D)\r\n           You must know, wherever I am I\r\n           will press your cause.\r\n\r\n                          SOLOMON\r\n           Five months. On top of these\r\n           years. No cause remains.\r\n\r\n                          BASS\r\n           If there is any chance...\r\n\r\n                          SOLOMON\r\n           Mr. Bass...\r\n\r\n                          BASS\r\n           I will continue to write your\r\n\r\n                          PEOPLE--\r\n\r\n                          SOLOMON\r\n           Go home knowing you have tried.\r\n           The weight of defeat should hang very heavily with both\r\n           men. Nothing more to do, nothing more to say BASS TAKES\r\n\r\n           SOLOMON'S HAND, GRIPS IT FIRMLY, BUT LOW AND\r\n           SURREPTITIOUSLY knowing full well he cannot be seen\r\n           making contact with a slave. But in the strength of\r\n           their collective grip, in the emotion in which they hold\r\n           each other's eyes, we should be able to easily see how\r\n           greatly Bass wanted to be able to help Solomon. Equally,\r\n           we can see the depth of regard Solomon has for Bass. The\r\n           moment is made all the more powerful by the fact neither\r\n           man can openly speak his regret or thanks. A moment\r\n           longer, and then Bass releases his grip and makes his\r\n           way marching toward the gazebo, pointing instructions.\r\n           Solomon is left, markers in hand, alone.\r\n\r\n                         \r\n\r\n                         166 166\r\n\r\n                          OMIT\r\n\r\n                         \r\n\r\n                         167 OMIT 167\r\n\r\n          118.\r\n\r\n                         \r\n\r\n                         \r\n\r\n          A168 EXT. ROAD BY EPPS' PLANTATION - EVENING A168\r\n\r\n           Solomon sits on a secluded part of the road, fiddle in\r\n           hand. He stares across the expanse. His eyes fixed on\r\n           something that is a million miles away.\r\n           Slowly Solomon tunes his fiddle, turning the tuning peg\r\n           tighter and tighter. As the strings are taut, the sound\r\n           is almost unbearable as Solomon tightens bit by bit, as\r\n           if bones are being cracked one by one. Just beyond the\r\n           breaking point of sound, there is a snap.\r\n           He then repeats the action.\r\n           Solomon holds the neck of the violin. Sliding his thumb\r\n           and forefinger down the neck, he methodically cracks it\r\n           at the base. He carefully snaps the neck and removes it\r\n           from the body, then snaps it in two, placing it on the\r\n           ground.\r\n           He then starts on the body. Heaving it on the ground, it\r\n           falls apart. Methodically he breaks the violin into small\r\n           bits - silencing the instrument with a hushed display of\r\n           violence, rather than aggressive. Seems almost to be, in\r\n           an odd way, respectful.\r\n\r\n                         \r\n\r\n                         168 168\r\n\r\n           EXT. MASTER EPPS'S PLANTATION/FIELD - DAY\r\n\r\n\r\n           -FEBRUARY, 1853-\r\n           The Slaves are sewing the heavily plowed field, making\r\n           their way in the trying soil. Solomon, too focused to\r\n           note the arrival of two men by carriage: Parker and the\r\n\r\n           SHERIFF.\r\n           While the Sheriff makes his way to the field, Parker\r\n           remains with the carriage. The Sheriff calls:\r\n\r\n                          SHERIFF\r\n           Platt...? Where is the boy called\r\n           Platt?\r\n\r\n                          SOLOMON\r\n           ...Sir...\r\n           The Sheriff crosses to him.\r\n\r\n                          SHERIFF\r\n           Your name is Platt, is it?\r\n\r\n                          SOLOMON\r\n           Yes, sir.\r\n           Pointing off to the distance.\r\n\r\n                          SHERIFF\r\n           Do you know that man?\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          118A.\r\n\r\n                         168 CONTINUED: 168\r\n           Solomon looks toward the carriage. He has to shield his\r\n           eyes from the sun. Recognition is slow coming to him.\r\n           But when it does, it hits him as a rush.\r\n\r\n                          SOLOMON\r\n           Mr. Parker...?\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          119.\r\n\r\n                         168 CONTINUED: (2) 168\r\n           Solomon starts for Parker, but he is pulled back by the\r\n           Sheriff who is keen to determine Solomon's true identity.\r\n\r\n                          SHERIFF\r\n           Say again?\r\n\r\n                          SOLOMON\r\n           Mr. Parker?\r\n           As he does, Epps makes his way over.\r\n\r\n                          SHERIFF\r\n           That man received a letter\r\n           compiling many accusations. You\r\n           look me in the eye and on your\r\n           life answer me truthfully: have\r\n           you any other name than Platt?\r\n\r\n                          SOLOMON\r\n           Solomon Northup is my name.\r\n\r\n                          EPPS\r\n           Sheriff...\r\n\r\n                          SHERIFF\r\n           Have you a family?\r\n\r\n                          EPPS\r\n           What's all this?\r\n\r\n                          SHERIFF\r\n           It's official business.\r\n\r\n                          EPPS\r\n           My nigger, my business.\r\n\r\n                          SHERIFF\r\n           Your business waits.\r\n\r\n                          (TO SOLOMON)\r\n           Tell me of your family.\r\n\r\n                          SOLOMON\r\n           I have a wife and two children.\r\n\r\n                          SHERIFF\r\n           What were your children's names?\r\n\r\n                          SOLOMON\r\n           Margaret and Alonzo.\r\n\r\n                          SHERIFF\r\n           And your wife's name before her\r\n           marriage?\r\n\r\n                          SOLOMON\r\n           Anne Hampton. I am who I say.\r\n           Solomon pushes past the sheriff. As Solomon moves toward\r\n           Parker, his pace quickens with each step until his\r\n\r\n                          (CONTINUED)\r\n\r\n          119A.\r\n\r\n                         168 CONTINUED: (3) 168\r\n           personal velocity has him nearly at a dead run. The two\r\n           old friends make contact with each other, wrap each other\r\n           in a long and emotional embrace. It if finally broken by\r\n           Epps, who has moved over with the Sheriff.\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          120.\r\n\r\n                         168 CONTINUED: (4) 168\r\n\r\n                          EPPS\r\n           Nah... You will unhand 'em.\r\n           Platt is my nigger!\r\n\r\n                          PARKER\r\n           He is Solomon Northup.\r\n\r\n                          EPPS\r\n           You say...\r\n\r\n                          PARKER\r\n           He belongs to no man.\r\n\r\n                          EPPS\r\n           You say! You come here,\r\n           unfamiliar to me, and make claims.\r\n\r\n                          SHERIFF\r\n           Not claims. I have no doubts.\r\n           This is Solomon Northup, a\r\n           resident of Saratoga Springs, NY.\r\n\r\n                          EPPS\r\n           To hell with that! My nigger, and\r\n           I'll fight you for 'em!\r\n\r\n                          PARKER\r\n           As is your right. As it will be\r\n           my pleasure to bankrupt you in the\r\n           courts. Your decision.\r\n           By this time, the slaves in the plantation have overcome\r\n           their fear of penalty, and left their work and gathered\r\n           in the yard as witnesses. They stand behind the cabin,\r\n           out of sight of Epps.\r\n           Mistress Epps also bears witness, standing on the veranda\r\n           next to her house slave. Her face is of a strange mixed\r\n           emotion.\r\n           Epps looks to Solomon. Solomon icily, stoically holds\r\n           his ground. He makes it quite clear in his countenance\r\n           that nobody owns him. Sheriff, hand on his gun, is there\r\n           to back Solomon up. Epps, with no other recourse than to\r\n\r\n                          BACK DOWN:\r\n\r\n                          EPPS\r\n           You think this is the last you'll\r\n           see of me, boy? It ain't.\r\n\r\n                          (TO PARKER)\r\n           Whatever paper you hold about his\r\n           freedom, it don't mean naught. He\r\n           is my nigger - and I will have my\r\n           day in court, sir. As God as my\r\n           witness, I will have my day in\r\n           court. Take 'em!\r\n           Epps calls to Bob-\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          120A.\r\n\r\n                         168 CONTINUED: (5) 168\r\n\r\n                          EPPS (CONT'D)\r\n           Saddle my horse! And bring her up\r\n           here.\r\n           Epps walks back into the plantation.\r\n           The trio starts for the carriage. Solomon is pulled back\r\n           by the call of Patsey's voice:\r\n\r\n                          PATSEY\r\n           Platt...\r\n           Disregarding Parker, Solomon crosses over to Patsey.\r\n           Under the circumstances, neither really knows how to\r\n           engage. Finally, suddenly, Patsey throws her arms around\r\n           Solomon and they embrace.\r\n           Epps, now mounted on his horse, witness the encounter.\r\n           Kicking the stirrups hard into the sides of the horse, he\r\n           rides off furiously.\r\n           Calling from the carriage, mindful of Epps:\r\n\r\n                          PARKER\r\n           Solomon...if we know what's wise,\r\n           we should depart.\r\n           A moment longer Solomon and Patsey hold each other. They\r\n           separate, Solomon heading back to the carriage. He and\r\n           Parker alight. The Sheriff chides the horses and they\r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          121.\r\n\r\n                         168 CONTINUED: (6) 168\r\n           start up. As they move on, Patsey sinks down to the\r\n           ground, where she remains in a weary and half-reclining\r\n           state, the other slaves around her.\r\n           WE STAY WITH Solomon as he travels further and further\r\n           from the slaves - who are diminished by distance.\r\n           Solomon waves a hand to them, but the carriage rounds a\r\n           bend and a thicket of trees hides them from his eyes\r\n           forever more.\r\n\r\n                          BLACK\r\n\r\n                         \r\n\r\n                         A169 A169\r\n\r\n           EXT. NORTHUP HOUSE - DAY\r\n\r\n\r\n           -MARCH, 1853-\r\n           We now see Solomon in front of a door. A door we have\r\n           seen before at the very beginning of our story. Solomon,\r\n           aged significantly since then, stands nervously,\r\n           swallowing, and adjusting his attire. He breaths in and\r\n           holds his breath. He blows out and closes his eyes. A\r\n           tear falls from his cheek, but this is not the way he\r\n           wants his family to see him. He gathers himself, and\r\n           looks to his right. There stands Mr. Parker. He places\r\n           his hand on Solomon's shoulder. He says gently-\r\n\r\n                          PARKER\r\n           Are you ready?\r\n           Solomon swallows and nods.\r\n\r\n                         \r\n\r\n                         169 169\r\n\r\n           INT. NORTHUP HOUSE - LATER\r\n\r\n           THE DOOR TO THE ROOM OPENS. Mr. Parker enters, Solomon\r\n           behind. We first see Anne, in her finest attire; the\r\n           Northup children: Alonzo, who is now seventeen and\r\n           Margaret who is now twenty - SHE CARRIES WITH HER A\r\n           BUNDLE. Also present is MARGARET'S HUSBAND. The family\r\n           waits patiently, dutifully...but anxiously.\r\n           Anne rises to greet him, but holds back. All around, the\r\n           body language of the family is stiff and awkward. They\r\n           are, after all - after twelve years - little more than\r\n           familiar strangers.\r\n\r\n                          SOLOMON\r\n           I apologize for my appearance. I\r\n           have had a difficult time of\r\n           things these past many years.\r\n           Solomon looks among his family; trying to recall them as\r\n           much as they look to see familiarity within him. To his\r\n\r\n                          CHILDREN:\r\n\r\n                          SOLOMON (CONT'D)\r\n           Alonzo... Margaret, yes? You do\r\n           not recognize me, do you? Do\r\n\r\n                          (MORE) (CONTINUED)\r\n\r\n          122.\r\n\r\n                         169 CONTINUED: 169\r\n\r\n                          SOLOMON (CONT'D)\r\n           you...do you even remember the\r\n           last time we saw each other? I\r\n           put you on a carriage with your\r\n           mother...\r\n           Margaret, tearing, hugs her father. Solomon almost\r\n           breaks, but he keeps himself together. Looking to the\r\n\r\n                          UNKNOWN MAN:\r\n\r\n                          SOLOMON (CONT'D)\r\n           And who is this?\r\n\r\n                          MARGARET\r\n           He is my husband.\r\n\r\n                          SOLOMON\r\n           Husband?\r\n\r\n                          MARGARET'S HUSBAND\r\n           It is very good to meet you, sir.\r\n\r\n                          SOLOMON\r\n           We have much acquainting to do.\r\n           Margaret rises, she presents her bundle to her father.\r\n\r\n                          MARGARET\r\n           And this is your grandson.\r\n           Solomon Northup Staunton.\r\n\r\n                          SOLOMON\r\n           ...Solomon...\r\n           The fact his grandson carries his name, is overwhelming.\r\n           Solomon breaks down. Emotionally, physically... But\r\n           ANNE IS THERE TO CATCH HIM. As she holds him, Solomon\r\n           says to Anne with all his heart:\r\n\r\n                          SOLOMON (CONT'D)\r\n           Forgive me.\r\n\r\n                          ANNE\r\n           There is nothing to forgive.\r\n           The pair, joined now by the whole family, hold on to each\r\n           other for life...and one would think for all the rest of\r\n           their lives.\r\n\r\n                          FADE TO:\r\n\r\n                          BLACK\r\n\r\n                          CARD:\r\n           Upon gaining his freedom, Solomon Northup located and\r\n           attempted to seek legal justice against the men who\r\n           kidnapped him. The case was tried in Washington, DC\r\n           where blacks were prohibited by law from testifying\r\n\r\n                         \r\n\r\n                          (CONTINUED)\r\n\r\n          123.\r\n\r\n                         169 CONTINUED: (2) 169\r\n           against whites. The charges against the kidnappers were\r\n           eventually dismissed.\r\n           Northup spent the rest of his life working as an\r\n           abolitionist, and with the Underground Railroad.\r\n           Solomon Northup most likely died between 1863 and 1875.\r\n           The exact date, place, and circumstances of his death\r\n           remain unknown.\r\n\r\n           - END -\r\n\r\n\n\n\n\n12 Years a Slave\nWriters :   John Ridley\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:18:04.824920"}