{"title": "25th Hour", "film_link": "/Movie Scripts/25th Hour Script.html", "script_link": "/scripts/25th-Hour.html", "info_raw": "\n\n25th Hour Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Benioff\nGenres  Crime  Drama\nScript Date : April 2001\n\nRead \"25th Hour\" Script\n\n\n", "script": "\r\n\r\nTHE 25th HOUR\n\n\n\n     by\n\n\n\nDavid Benioff\n\n\n\n\n\n\n\n\n\n\n\n\n\n                               4/30/01\n\n\n                INDUSTRY ENTERTAINMENT\n\n\n\n\n\n     EXT . WES T SIDE HIGHWAY -- NIGHT\n\n\n\n\no    A blac k dog sleeps on the shoulder of the highway, head\n     between his paws , curled up next to the barricad e that\n     separates the north and southbound lanes .\n\n\n\n     Traffic rumbles past him: yellow cabs , blu e polic e cruisers ,\n     white limousines with tinted glass and Jersey plates .\n\n\n\n     We hea r the squeal of brakes. A black *65 Ford Mustang, min t\n     condition, pulls onto the shoulder, ten yard s past the dog ,\n     and back s up . Th e dog raises its head.\n\n\n\n    Two me n step out of the car.          The driver , MONT Y BROGAN, mid -\n    twenties , is pale-skinned in          the flickering light . A small\n    silver crucifix hangs from a           silver chain around his neck ;\n    his fingers are adorned with           silver rings .\n\n\n\n    The passenger , KOSTYA NOVOTNY, a hulking ma n in his late\n    thirties , blow s his nose in his handkerchief.\n    It's a cold night . Monty wears a camel's hai r overcoat,\n    Kostya an old blue Soviet Navy coat .\n\n                           MONTY\n\n                 He's alive.\n\n                            KOSTYA\n\n                      (Ukrainian accent)\n                 This dog, how do you call it?\n\n                            MONTY\n\n                 Pit bull . Must have lost somebody some\n                 money .\n    The dog stares at them and they stare at the dog .\n\n                             KOSTYA\n\n                 What d o w e do , Monty, w e watch hi m rot ?\n\n    ·· ' .·····- · ' ? -. : · ·- ·' MONTY : . ·' ·· '' ' ' ;:; '' '\n\n\n     :         ·                          \"·                          \"· -\n\n\n                                                                       ·     ·\n\n                   I was thinking of shooting him .\n\n\n\n\n                           KOSTYA\n\n                 Shooting him? Ar e you sick in the head ?\n\n\n\n    The dog continues to stare at them impassively, his face lit\n    by the passing headlights. The pavement by hi s paws is\n    littered with broken glass, twisted scraps of metal , black\n    rubber from blow n tires.\n\n\n\n\n\n\n\n\n\n                                                                                     o\n\n                                                                       (CONTINUED)\n\n\n\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                      MONTY\n\n            They just left him here to die. They\n            threw him out the window and kept\n            driving.\n A ship's horn sounds from the Hudson.\n\n                     KOSTYA\n\n           Come, my friend, it is cold. Come, people\n           wait for us.\n\n                     MONTY\n\n           They're used to waiting.\nMonty squats near the dog and inspects him. From this angle\nit is clear that the pit bull has been badly abused. One ear\nhas been chewed to mince; his hide is scored with cigarette\nburns; flies crawl in his bloodied fur.\n\n                     MONTY (CONT'D)\n\n           I think maybe his hip --\nThe dog pounces, jaws snapping,; lunging for Monty's face.\nMonty stumbles backwards. The dog, too badly injured to\ncontinue the attack, remains in his crouch, growling.\nMonty sits on the pavement, shaking his head.\n\n                     MONTY (CONT'D)\n\n          Christ.\n               (beat)\n          He's got some bite left.\n\n                    KOSTYA\n\n          I think he does not want to play with\n          you. Come, you want police to pull over?\n          You want police looking through your car?\n\n                    MONTY\n\n          Look what they did to him. Used him for a\n          fucking ashtray.\nMonty stands and dusts his palms on the seat of his pants.\n\n                    MONTY (CONT'D)\n\n          Let's get him in the trunk.\n\n                    KOSTYA\n\n          What?\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                    3.\n\n\n CONTINUED :    (2 )\n\n\n\n\n\n\n\n\n                         MONTY\n\n               There's a vet emergency room on the East\n               Side. I like this guy.\n\n                         KOSTYA\n\n               You like him? He tries to bite your face\n               off. Look at him, he is meat. You want\n               some dog, I buy you.nice puppy tomorrow.\nMonty is not listening. He walks back to his car, opens the\ntrunk, pulls out a soiled green army blanket.\nKostya holds up his hands: stop.\n\n                      KOSTYA    (CONT'D)\n\n           Wait one minute,    please. Please stop one\n           minute? I do not    go near pit bull. Monty?\n           I do not go near    pit bull.\nMonty, carrying the army blanket, walks back toward the dog.\n\n                     MONTY\n\n           This is a good dog. I can see it in his\n           eyes. He's a tough little bastard.\n\n                     KOSTYA\n\n           Sometimes I think you are very stupid\n           man.\nThe dog has slumped back to the pavement. His breath, comes in.\nshorts rasps and wheezes. But he never takes his eyes off the\ntwo men.\n\n                     MONTY\n\n           We wait much longer, he'll be dead.\n\n                     KOSTYA\n\n           One minute ago you want to shoot him.\n\n                     MONTY\n\n           That was a mercy thing. But he's not\n           ready to go yet.\n\n                     KOSTYA\n\n           Yes? He told you this?\nMonty slowly circles behind the dog, holding the blanket the\nway a matador wields his cape.\n\n                       MONTY\n\n          Distrac t him.\n\n                                                                         U\n\n\n                                                     (CONTINUED )\n\n\n\n\n\n CONTINUED: (3)\n\n\n\n\n\n\n\n Kostya stares at his friend in disbelief. He looks down. A\n crumpled soda can lies by his feet. He kicks the can.\n The dog's head pivots to follow the aluminum flash.\n Monty hurls the blanket over the dog and spring forward,\n wrapping his arms around the dog's midsection. The dog\n growls, bites the wool, tries to break the blanket's neck.\n Monty lurches toward the Mustang, struggling to retain his\n bearhug while the pit bull slithers in his grasp. As they\n stumble closer to the car the dog releases the blanket and\n snaps at Monty's throat.\nMonty hurls the dog into the trunk and slams the lid. He\nreturns to the driver's seat.\nKostya watches him in silence, stares at the sky for a few\nseconds, finally gets back in the car. The dog thrashes in\nthe trunk.\n\nINT. MUSTANG\n\nBoth men sit in silence as Monty revs the engine. Blood is\nbeginning to leak from a bite on the right side of Monty's\nneck.\n\n                      KOSTYA\n\n            What goes on in your little head?\nMonty grins. He has no idea that he's bleeding.\n\n                      MONTY\n\n            I got him, didn't I? Surprised you how\n      .--   quick I was, huh?\nMonty checks for traffic and pulls back onto the highway.\n\n                      KOSTYA\n\n            Yes, you are so quick.\nHe points at the wound on Monty's neck, which has begun to\nflow faster.\n\n                      KOSTYA (CONT'D)\n\n            Meanwhile, you are bleeding.\n\n                      MONTY\n\n            That's the dog's blood.\n\n                       KOSTYA\n\n            Oh? Because you have hole in your neck\n            and blood is coining out.\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                                                       5.\n\n\n           CONTINUED :                                                   ,,,..-. .\n\n\n\n\n\n\n\n\"(/\"~^)     Mont y lift s hi s han d to hi s nec k and feel s th e blood .\n\n                                  MONT Y\n\n                       They'l l stitc h i t u p a t th e vet's .\n\n                                   KOSTY A\n\n                       Rul e numbe r one : don' t gra b half-dea d pi t\n                       bulls . W e hav e peopl e waitin g fo r us ,\n                       peopl e wit h money , and you g o playin g\n                       cowboy -- no , dogboy -- i n middl e o f\n                       highway .\n           Mont y laughs , hi s han d presse d t o th e sid e o f hi s neck , bloo d\n           leakin g betwee n hi s fingers .\n\n                                     KOSTY A (CONT'D)\n\n                       Yes , h a ha . You'r e ba d luck . Yo u brin g\n                       ba d luc k o n me . Alway s everythin g tha t\n                       ca n g o wrong , goe s wrong . I t i s no t jus t\n                       yo u an d m e whe n w e g o out , no , no , i t i s\n                       you , me , an d Miste r Doyle o f Doyle' s law .\n           Mont y frowns .\n\n                                  MONT Y\n\n fly                   Doyle' s law ? Yo u mea n Murphy' s law .\n\n                                 KOSTY A\n\n                      Who' s Murphy ?\n\n                                  MONT Y\n\n                      Who' s Doyle ? Murphy' s law : whateve r ca n\n                      g o wrong , wil l g o wrong .\n\n                                    KOSTY A\n\n                      Yes . Him .\n\n           EXT . EAST RIVE R ESPLANAD E -- DAWN                                         \\\n\n           TITL E CARD : Four Years Later\n           Mont y sits o n a par k benc h overlookin g th e Eas t River . H e\n           stub s out hi s cigarette , pull s anothe r fro m hi s pack , light s\n           it .\n          Th e blac k pi t bull , no w health y and well-fed , squat s b y\n          Monty' s side . I t i s winter : th e dog's war m breat h rise s a s\n          whit e vapor .\n          .Two tough-lookin g YOUN G ME N wal k by , wearin g hoode d\n           sweatshirts belo w thei r dow n parkas , on e o f the m leadin g hi s\ni}        spike-collare d rottweiler .           .                                          /\n\n\n\n\n                                                                        (CONTINUED )\n\n\n\n\n\n                 ·-                    ·        -·      -        ··\"\"·-   ·            ·-\"-          6.\n\n\n             CONTINUED:\n\n\n\n\n\n\n\n o           DOYLE (for the nameless pit bull has become Doyle) growls.\n             Monty tugs on his leash and Doyle grunts and quiets down.\n\n\n\n\n                                      YOUNG MAN 1\n\n                            What up, Monty.\n\n\n\n             Monty nods but doesn't say anything. He's studying the view.\n             He stares at the green river, the steel bridges , the red\n             tugboats, the stone lighthouse of Roosevelt Island.\n\n\n\n             Doyle barks and Monty turns. SIMON, a bone-thin ma n in his\n             early thirties, approaches them. He wears rubber boots that\n             rise to his knees and a dirty yellow down parka .\n\n\n\n\n                                      SIMON\n\n                            Easy, Doyle, easy, buddy. What's up\n                            there, Monty?\n             Monty turns back to the river. Doyle barks again.\n\n                                     SIMON (CONT'D)\n\n                           You want to tell the dog to relax? Hey\n                           there, Doyle. Good dog.\n\n\n\n\n\n\n     0),^    Doyle has extended the leash as far as Monty will allow. He\n     ~7     sniffs suspiciously at Simon.\n\n                                     SIMON (CONT'D)\n\n                           I don't think your dog likes me .\n\n                                     MONTY\n\n                           Go away, Simon.\n\n                                      SIMON\n\n                           I'm hungry here. Woke up an hour ago and\n                           I was hungry.\n\n            .- ··' \" ·· · ··. , ···· \\ ·: '·MONTY/ ' \" ' ·- V ; :· · /'.I. · .- · ' \"' . .',.· ' ·\n\n\n             ,·             '      ·                      .               -   ·      ·       .\n\n                          Nothing I can do about that. Go up to On e\n                          Hundred and Tenth.\n\n\n\n\n                                    SIMON\n\n                          One Hundred and Tenth? Come on, I'm good.\n\n\n\n            He reaches into his pocket and brings out a wad of five\n            dollar bills held together by a rubber band.\n\n\n\n\n                                     MONTY\n\n                               (angry)\n~,                        Put that away.\n\n\n\n^V- ^       Doyle snarls. Simon repockets the money.\n\n\n\n\n\n\n\n                                                                                      (CONTINUED)\n\n\n\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n\n                       SIMON\n\n            Okay, okay. I'm just saying, I'm not\n            looking for a mercy pop.\n\n                     /\n\n\n                       MONTY\n\n            I'm over, man.\n Simon points at a line of scabs that run along his throat.\n\n                     SIMON\n\n           Cut myself shaving this morning -- four\n           times. Can't keep my hands steady. Come\n           on, Monty, help me out. I can't go to\n           Harlem. Look at me--- they'll eat me alive\n           up there.\nMonty finally stands and walks toward the man, closer and\ncloser until their faces are inches apart.\n\n                     MONTY\n\n           You need to leave me alone, friend. I\n           told you, I'm out of business.\nDoyle sniffs Simon's boots, then raises his head, snout\nclimbing the man's leg. Simon dances a half-step, trying to\nkeep away from the pit bull without provoking him.\n\n            ·\n\n\n                     SIMON\n\n          You worried about me narking you out? You\n          know who I am.\n\n                     MONTY\n\n           You're not listening to me. I got\n           touched. Game over.\nSimon blinks, tries to JLaugh, looks behind him,,,looks down at\nDoyle, rubs his nose with the back of his hand.\n\n                    SIMON\n\n          Five years I've been coming to you. All\n          right, all right, I'm leaving. There's no\n          need to be nasty.\nMonty and Doyle watch the man go; they begin walking in the\nopposite direction. They pass the concrete chessboards, the\nsandboxes, and pause for a moment by a basketball court.\nSix TEENS play -- with little skill -- one last game before\nschool. Monty shakes his head disdainfully, watching one\nplayer dribble at the top of the key.\n\n                    MONTY\n\n          You got no left.\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n CONTINUED: (3)\n\n\n\n\n\n\n\n The player drives right and misses an open lay-up. Monty\n spits and continues walking, Doyle leading the way.\n\n EXT. CAMPBELL-SAWYER HIGH SCHOOL -- LATER\n\nMonty looks up at the old private school, tucked away on a\nleafy street on the Upper East Side.\nTwo TENTH GRADE GIRLS look at Monty as they pass by. People\nare always looking at Monty.\nBoth girls take long final drags on their cigarettes before\ncrushing them out and entering the school.\n\nINT. CAMPBELL-SAWYER HIGH SCHOOL\n\nMonty walks down a corridor of the school building, Doyle\npadding along beside him. STUDENTS, hurrying to their\nclasses, stare at the dog and then at Monty.\nThe bells ring and within moments the corridor is empty.\nMonty stops before a row of framed photographs. He examines\none photograph and smiles.\n\nINSERT PHOTOGRAPH\n\nThe Campbell-Sawyer basketball team. The players stand in a\nsemi-circle with their coaches. We move in closer on one face\nin particular: Monty, when he was sixteen, free and easy.\nWe move closer still and the black-and-white face begins to\nblur.\n\n                          ADMINISTRATOR (O.S.)\n\n,,..   .... Excus.e-.me-,- sir, can I help_ you?\n\n          .                                          ··\n\n\n                                                      -       --\n\nMonty, lost in a reverie, looks up. The ADMINISTRATOR, a\ntall, harried-looking woman in her mid-fifties, squints at\nhim through her glasses.\n\n                       MONTY\n\n           What?\n\n                     ADMINISTRATOR\n\n           Can I help you with something?\n\n                     MONTY\n\n               (smiling)\n           No, I don't think so.\n\n                     ADMINISTRATOR\n\n           There are no dogs allowed on school\n           grounds.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n      CONTINUED:\n\n\n\n\n\n\n\nf~\\                         MONTY                                         -^\nU               Okay. ..                                                 'J\\\n                      (pointing at the picture)\n                 I used to go here.\n\n                            ADMINISTRATOR\n\n                 I really have to ask you to remove the\n                 dog.\n\n                           MONTY\n\n                     (still looking at picture)\n                Look at what a little punk I was.\n      The administrator bends forward and squints at the photo.\n\n                          ADMINISTRATOR\n\n                I guess you weren't, the center.\n\n                           MONTY\n\n               , Ha ha. Starting point guard. Started on\n                varsity from my first game, freshman\n                year. I still hold the all-time assist\n                record.\n\n                          ADMINISTRATOR\n\n                Mm, no, Marvin Ray broke the record last                  ^V\n                year.                                                    mm^\n      Monty stares at her. She shrugs.\n\n                          ADMINISTRATOR (CONT'D)\n\n                I coach the girl's team.\n      Monty turns back to the photo.\n\n                            MONTY\n\n             ·- we* Weire undefeated that\" year.\n\n                           ADMINISTRATOR\n\n                Really?\n\n                          MONTY\n\n                Until I got kicked off the team. After\n                that, they fell apart. Do you know where\n                Jakob Elinsky is?\n\n                          ADMINISTRATOR\n\n                Probably in his classroom. Room 301.\n\n                           MONTY\n\n               Thanks.\n\n\n\n\n\n\n\n                                                           (CONTINUED)\n\n\n\n\n\n                                                                           10\n\n\n      CONTINUED: (2)\n\n\n\n\n\n\n\no     He leads Doyle away, but stops after a few feet and turns\n      back.\n\n                                   MONTY (CONT'D)\n\n                         Marvin Ray?\n\n                                  .ADMINISTRATOR\n\n                         Mm hm.\n\n                                   MONTY\n\n                         You're sure?\n\n                                   ADMINISTRATOR\n\n                         I was there when he broke the record.\n     Monty nods and continues on his way. The administrator\n     watches man and dog walk down the long corridor.\n\n     INT. CAMPBELL-SAWYER CLASSROOM\n\n     JAKOB ELINSKY stands at the blackboard, facing three rows of\n     uninspired teenage faces. He wears a tweed jacket that seems\n     a few sizes too large, with chalk stains on the sleeves.\n     Jakob is the same age as Monty but he seems younger. There is\n     something adolescent in his slouch, in the way he chews his\n     lip.\n    One of his students, MARY D'ANNUNZIO (17), stands at her\n    desk, reading from a poetry textbook. Her eyes drown in pools\n    of painted shadow, her hair is dyed black, tattooed roses\n    garland her wrist.\n\n                                MARY\n\n    -«=·-------···: .·    (reading)      - ··     --    ···\n\n                                                          ·    ·· -\n\n\n                                                                ·\n\n                     \"Let us roll all our strength and all\n                     Our sweetness up into one ball,\n                     And tear pur pleasures with rough strife,\n                     Through the iron gates of life.\"\n    Jakob watches her. We don't know the Campbell-Sawyer dress\n    code, but we can guess that she's violating it . We can also\n    guess that Jakob is watching her a little too avidly.\n    Her pierced navel is visible below her Donnas tee-shirt.\n\n                                MARY (CONT'D)\n\n                          (reading)\n                     \"Thus, though we cannot make our sun\n                     Stand still, yet we will make him run.\"\n    Mary shrugs and sits down.\n\n\n\n\n                                                                 (CONTINUED)\n\n\n\n\n\n                                                               11.\n\n\nCONTINUED:\n\n\n\n\n\n\n\n\n                     JAKOB\n\n           Good, good, excellent reading. Urn, okay,\n           so. What do people think? What' s going on\n           here?\n\n\n\nNobody says anything. Jakob nods .\n\n\n\n\n                         JAKOB (CONT'D)\n\n           Okay.\n\n\n\nLUKE , a sullen-looking student with a shaved head and a\nfailed goatee, raises his hand.\n\n                         JAKOB (CONT'D)\n\n           Luke?\n\n                     LUKE\n\n           Can I go to the bathroom?\n\n                      JAKOB\n\n           No . You went twenty minutes ago .\n\n                     LUKE\n\n           I have a bladder infection.\n\n                     JAKOB\n\n           The poem. The poem, folks. Hello?\n\n                      MARY\n\n           It's not real deep or anything. The guy\n           wants to get laid and he's telling her to\n           give it up .\nA few of the students titter half-heartedly.\n\n\n\nA knock on the door releases Jakob from his hell . He goes to\nanswer it and then \"stops/ startled.                      ~\"~\nIt's the type ofdoo r popular in school buildings> with a\nwire-reinforced glass panel at head height , allowing you to\nlook into the classroom without disturbing anyone.\n\n\n\nDoyle, tongue dangling from his mouth , stares back at Jakob\nthrough the panel .\n\n                    MARY (CONT'D)\n\n          I didn't know your mother was coming\n          today, Luke .\n\n                     LUKE\n\n\n\n\n\n\n\n                                                                     o\n          Eat me .\n\n\n\nJakob opens the door .\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                          12\n\n\n CONTINUED : (2)\n\n\n\n\n\n\n\n Mont y stands there, holding up Doyle. Doyle scramble s out of\n hi s arms and jumps on Jakob , nearly knocking th e teache r\n down , getting his dirty paw s all over Jakob's jacket .\n\n                       MONT Y\n\n             Easy, Doyle.\n Doyle immediately calms down , squatting by Jakob' s feet and\n staring up at the teacher .\n\n                        JAKOB\n\n            Hey -- uh , what' s going on?\n Jakob seems awkward around Monty , nervous .\n\n                       MONT Y\n\n                 (looking at Doyle)\n            Look at him . He loves you.\n Jakob looks at Doyle, wh o wag s the stump of hi s tail .\n\n                      MONT Y (CONT'D)\n\n            He really love s you . So what are you\n            doing?\nJakob turns to look at hi s class , who all stare at Mont y and\nthe dog. For the first time today, they're quiet .\n\n                        JAKOB\n\n                 (to Monty )\n            Teaching m y class , I guess.\n\n                        MONT Y\n\n           Cool .\n                 ffco class)         \"      ···\n\n                                              \"   ------,,...--.-.,··:.\n\n          Hey, class .\nA few students shyly wave .\n\n                       MONT Y (CONT'D)\n\n                 (to Jakob)\n           Sorry to interrupt . .Listen, change of\n           plans . They'r e throwing me a goodbye\n           part y downtown . Yo u and Frank get\n           together somewher e and I'll com e pic k yo u\n           up .\nJakob is a little flustere d by this encounter , acutel y awar e\nthat his class is watching .\n\n                      JAKO B\n\n          Okay.\n\n\n\n\n                                                          (CONTINUED )\n\n\n\n\n\n                                                                                                                                                                                             13\n\n\n                 CONTINUED:       (3 )\n\n\n\n\n\n\n\n{   \\            Monty lean s close r t o Jakob .\n\n                                                                          MONTY\n\n                                   (whispering)\n                              I think the one with the bell y button' s\n                              checking me out.\n             Jakob turns and sees Mary staring at them. He quickly turns\n             back to Monty , wh o is smiling at Mary. Jako b grab s the door\n             knob.\n\n                                     JAKOB\n\n                           Okay, so I'll see you later?\n            Monty nods .\n\n                                      MONTY\n\n                           Tel l Frank we'll meet up after midnight .\n            He leads Doyle away and Jakob closes the door , the n turns to\n            look at his silent class. The bell rings and all the students\n            grab their bags .                                              ,\n\n            INT. TEACHERS ' LOUNG E -- LATER\n\n            Jakob, alon e in the room, sits on a sofa, his hea d in his                                                                                                                                                        \\\n            hands. He looks up when he hears a knock on the door.                                                                                                                                                           xl\"y\n            Mary D'Annunzio peek s in.\n\n                                      MARY\n\n                           Yo u have a minute?\n            Jakob sits up straighter and smiles.\n\n                                      JAKOB\n\n                           Sure . Come in.\n\n        /   '·    '···        ·   '   ,       -   ·   /   .   -   .   ·   M   A   R   Y   .   ,   ·   ·,·······   ·   ;·;·.   ··:'·   .   -   ·   .   A   ,         -   ·.   ·   ·   ·   ·    ·   ;   -   ;   ·   .-.   .    '\n\n\n                                          :\n\n\n\n\n\n\n\n\n\n\n\n\n\n                           I thought no students were allowed in the\n                           teachers ' lounge.\n\n                                      JAKOB\n\n                           I won' t tell on you.\n            Mary walks into the room, looking around suspiciously. Jakob\n            points at a chair .\n\n                                     JAKOB (CONT'D)\n\n                          Tak e a seat.\n            Mary sits .                                                                                                                                                                                                 (        )\n\n\n\n\n                                                                                                                                                              (CONTINUED)\n\n\n\n\n\n    - -· -   ··             -              .   ·   -       -   1\n\n\n                                                               4\n\n\nCONTINUED:\n\n\n\n\n\n\n\n\n                   JAKOB (CONT'D)\n\n         So what's up?\n\n                   MARY\n\n         Who was that guy who came to class?\n\n                    JAKOB\n\n         Monty? An old friend of mine. He went\n         here, too.\n\n                   MARY\n\n         He doesn't look like you.\n\n                    JAKOB\n\n         Actually, I have many friends who don't\n         look like me.\n\n                   MARY\n\n         No, I mean, he doesn't look like someone\n         you'd be friends with.\n\n                     JAKOB\n\n         We grew up together.\n              (beat)\n         So what can I do for you?\n\n                  MARY\n\n        I want to know why I got a B+ on my\n        story.\n\n                  JAKOB\n\n        Okay, first of all --\n\n                  MARY\n\n        Nobody else in this class can write. You\n        know it, too. Don't start --\n\n                  JAKOB\n\n        Don't worry about everyone else.\n\n                  MARY\n\n       Vince Miskella writes a story about his\n       grandmother dying and you give him an A?\n       What is that, a charity A? Everyone's\n       always writing about their grandmother\n       dying. You know why? Not because it's so\n       traumatic. Because it's a guaranteed A.\n       And you're all sentimental, like, \"Oh,\n       Vince, that was very powerful, very\n       moving.\" No it wasn't. You didn't care, I\n       didn't care, nobody cared. That's what\n       grandmothers do, they die.\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                               15.\n\n\n CONTINUED : (2)\n\n\n\n\n\n\n\n Mary has worked herself into a lather and Jakob watches her\n admiringly.\n\n\n\n\n                     JAKOB\n\n           What did your mother say when you go t\n           that?\n\n\n\nMary stares at him, not comprehending.\n\n\n\n\n                     MARY\n\n           What? When I got what?\n\n\n\n\n                      JAKOB\n\n                (pointing at her wrist)\n           The tattoo.\n\n                     MARY\n\n           She said, \"Where'd you get the mone y for\n           that. \"\n\n                       JAKOB\n\n           Oh . And?\n\n                    MARY\n\n          And what did I say or where did I get the\n          money?\n\n                      JAKOB\n\n           Well , what did you say, I guess .\n\n                     MARY\n\n           I said he did it for free.\n\n                     JAKOB\n\n          Oh . Did he?\n\n                     MARY\n\n          No . Why do you care so much?\n\n                     JAKOB\n\n          Just curious. __\n\n\n\n\n                    MARY\n\n          So you're not going to change the grade?\n\n\n\n\n                     JAKOB\n\n          No , I'm not changing the grade. I'd be\n          happy to discuss --\nMary yanks her bookbag off the floor and straps it on her\nshoulder.\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n              '                   ·                ~'T      ' \"'   16,\n\n\n CONTINUED: (3)\n\n\n\n\n\n\n\n\n                      MARY\n\n            Great. That was a big waste of time.\n\n                     JAKOB\n\n           Look, instead of worrying about the grade\n           so much, let's talk about the actual---\n\n                      MARY\n\n                (muttering)\n           Forget it.\n She stomps out of the lounge, her black combat boots clomping\n on the corridor's linoleum floor.\nJakob shakes his head and looks up at the clock. 9:15. He\nreaches for the phone sitting on the coffee table.\n\nINT. SHREVE ZIMMER INVESTMENT BANK -- SAME TIME\n\nFRANK SLATTERY, also in his mid-twenties, stares at the row\nof clocks on the far wall. Below each clock is a sign: Tokyo,\nHong Kong, Frankfurt, London. The clock marked New York reads\n\n9:15.\n\nThe trading floor is one giant room: rows of TRADERS seated\nbefore their computers, jabbering into their telephone\nheadsets. No women -- the place is loud and aggressive.\nSlattery is built like a former college wrestler: thick-\nnecked, broken-nosed, muscular, his hair retreating from his\nforehead, his eyes undercast with dark crescents.\nOne of his phones rings. He answers.\n\n               ----SEATTER Y          -   ·-   -\n\n          Frank Slattery.\nHe listens for one second.\n\n                    SLATTERY (CONT'D)\n\n          Can't talk right now. Employment number's\n          coming out.\n\nINT. TEACHERS' LOUNGE - CONTINUOUS\n\n\n                    JAKOB\n\n          All right. Just wanted to let you know\n          that Monty --\n\nINT. SHREVE ZIMMER - CONTINUOUS\n\n\n                     SLATTERY\n\n          I'll call you later.\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                               17\n\n\nCONTINUED:                                        -,^-.- ..... ,\n\n\n                                                             .·\n\n\n\n\n\n\n\nHe hangs up the phone and returns his gaze to the computer\nscreens in front of him. Clearly he's waiting for something\nand clearly he's anxious.\n\n                    LICHTER (O.S.)\n\n          Coming out with us later on?\nSlattery looks up at his boss, ARI LICHTER, early forties, a\nplump, genial man.\n\n                    SLATTERY\n\n          Nah, I'm meeting some friends tonight.\n\n                      LICHTER\n\n          Big date?\nThe subject clearly makes Slattery uncomfortable.\n\n                    SLATTERY\n\n          More of a going-away party.\n\n                    LICHTER\n\n          Listen, the other thing, you're still\n          holding onto all those contracts?\n\n    .                SLATTERY\n\n          Why, you're nervous?\n\n                    LICHTER\n\n          I don't like it. The claims numbers have\n          dropped three weeks straight.\n\n                     SLATTERY\n\n          And everybody's thinking, if claims have\n          dropped, employment must be up.\n\n                    LICHTER\n\n         Everybody's thinking that because it's\n         pretty much always true.\n\n                    SLATTERY\n\n         Not this time.\n\n                      LICHTER\n\n         Frank--\n\n                   SLATTERY\n\n         I've got a theory.\n\n                   LICHTER\n\n         Oh good, you've got a theory. Look,\n         you're in awfully deep. You've got sixty\n         million of the bank's money in there--\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                                    18\n\n\n     CONTINUED : (2)\n\n\n\n\n\n\n\ne                        SLATTERY\n               A hundred million.\n\n\n\n    The news startles Lichter.\n\n\n\n\n                          LICHTER\n\n               A hundred million? Jesus, Frank.\n\n\n\n\n                         SLATTERY\n\n               They authorized me to a hundred million.\n\n\n\n    Other traders sitting nearby have begun watching this\n    exchange, and Lichter is careful to keep his voice down.\n\n                        LICHTER\n\n              A week ago. They raised your limit a week\n              ago, and you're already maxing out.\n\n                         SLATTERY\n\n              I'm telling you, we're in for a low\n              number. One-forty, maybe one-thirty-five.\n\n\n\n\n                         LICHTER\n\n              Cut your stake in half,    all right? You've\n              been doing a great job,    everyone knows\n              that, but I'm still you   r boss and I'm\n              telling you: sell those    contracts.\n    Lichter grips Slattery's shoulder for a moment and then walks\n    toward his office (a real office, with walls and a door) ,\n    exchanging hellos with other traders on the floor.\n    PHELAN, fresh from college, walks down the row, handing fax\n    sheets to all the traders. He hands a sheet to Slattery, wh o\n    looks-at--it briefly before crumpling it .         ........\n\n                                                              .\n\n\n\n\n\n                         PHELAN\n\n              Sollie's looking for a high number. Tw o\n              hundred and eighty thousand's their call .\n\n                        SLATTERY\n\n              Fuck Sollie.\n\n\n\n\n                        PHELAN\n\n              Fuck Salomon Brothers?\n\n\n\n\n                       SLATTERY\n\n             They're hedging their bets . They want\n             everyone on their side of the fence.\n\n\n\n\n                       PHELAN\n\n             What's the big deal with the employment\n             number, anyway?\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                                                 19.\n\n\n         CONTINUED : (3)                                     ...,.,\n\n\n                                                                  .\n\n\n\n\n\n\n\n         Slattery doesn't want to discuss this right now .\n\n                               SLATTERY\n\n                   More jobs means fewer people looking for\n                   work, right? Which means it's harder to\n                   find the right people for a job, which\n                   means you got to raise wages to get them,\n                   which mean s inflation goes up -- you\n                   following?\n\n                               PHELAN\n\n                       (not following)\n                   Yeah.\n\n\n\n        Slatter y frowns.\n\n\n\n\n                             SLATTERY\n\n                   You're wearing a striped shirt with a\n                   striped tie .\n        Phelan looks down at his tie .\n\n                             PHELAN\n\n                   Yeah? Is that bad ?\n                            SLATTERY                                                   \"x\n,L#bi             You look like a xuoAiiiig optical -LJ.JHJOJ.LJII.\n                           xxiv c a fuckin j u^t.J.^ax illusion .                      **\n\n\n\n                  Go away.\n        Phelan walks away, nervously adjusting his tie .\n        MARCUSE peeks over the partition in front of Slattery. With\n        his slicked-back hair , red suspenders, and obnoxious smirk,\n        Marcuse looks like a ma n who owns the Gordon Gekk o action\n        figure.\n\n                          - MARGUSE-                                  ...·-..-\n\n                  Better hop to , sonny boy.\n        Slattery says nothing, just stabs angrily at hi s keyboard.\n\n                            MARCUSE (CONT'D)\n\n                  I don't see you pickin g up the phone .\n                  Didn't Lichter just tell you to sell?\n                  Sounds like your allowance got cut off .\n        Slattery, nostrils flared, pretends to ignore the taunts .\n\n                            MARCUSE (CONT'D)\n\n                  You're not going to disobey a direct\n                  order, are you?\n\n\n\n\n\n\n\n\n\n\n                                                                  (CONTINUED)\n\n\n\n\n\n                               --                                        20\n\n\n CONTINUED : (4)\n\n\n\n\n\n\n\n Slattery rolls back in his wheeled office chair and stares at\n Marcuse.\n\n\n\n\n                        SLATTERY\n\n            I don't come into your bedroom and tell\n            yo u how to fuck your wife, do I?\n\n\n\n Marcuse grins . He calls to another trader down the floor.\n\n\n\n\n                      MARCUSE\n\n           Hey , Schultz, what are we looking at for\n           the employment number?.\n\n\n\n\n                      SCHULTZ\n\n                (yelling from his desk)\n           Two-fifty, two-seventy, somewhere in\n           there .\n Marcuse sits down again, disappearing behind the partition.\n Slattery glowers at his desk. He picks up his phon e and holds\n the receiver to his ear, never dialing a number.\nLichter calls to Slattery from his office door.\n\n                     LICHTER\n\n           Slattery! We're good?\nSlattery nods and gives a thumbs up. As soon as Lichter\nreturns to his office, Slattery hangs up the phone .\nMarcuse sticks his head above the partition again.\n\n                    MARCUSE\n\n          Good thing you got rid of those\n          contracts.-Looks like a huge numbe r o n -- ,«--·-.·----««».\n          the way.\nThe trading floor suddenly -- and eerily-^ goes quiet.\nEveryone's attention is fixed on the television monitors\nhanging from th e ceilings. The monitors ar e muted; closed\ncaptioning files along the bottoms of the screens.\n\n\n\nEach monitor is tuned to the same station, a financial\nnetwork broadcasting the employment number's release. A\nREPORTER wearing a bowtie reads the statistics.\n\n\n\nSlattery bows hi s head. He holds his hands in his lap and\ncloses his eyes . For a long while the room is very quiet.\n\n\n\nThen a commotion of shouts and groans riles the floor.\nEveryone is hollering at the same time, and we can only make\nout a few phrases .\n\n\n\n\n\n\n\n                                                          (CONTINUED)\n\n\n\n\n\n                                                               21.\n\n\n CONTINUED: (5)\n\n\n\n\n\n\n\n\n                     TRADER 1 (O.S.)\n\n           Stop out of that! Stop out!\n\n                     TRADER 2 (O.S.)\n\n           We're going for a ride!\nSlattery looks up at the nearest monitor. A white number is\nemblazoned on a blue background: 138,112. Every monitor in\nthe room flashes the same number.\nSlattery stares at his computer screen. There it is again,\ndisplayed prominently in the largest window: 138, 112.\nSlattery raises his eyebrows. He juggles the crumpled fax\nsheet a few times and then tosses it over the partition,\nwhere Marcuse is sitting.\n\n                     MARCUSE (O.S.)\n\n           Fuck you, Slattery.\nSlattery grins and leans back in his chair, hands behind his\nhead.\n\nEXT. MONTY'S BUILDING -- LATE AFTERNOON\n\nA four-story walk-up on a quiet street in Yorkville.\nNATURELLE ROSARIO sits on the stoop steps, reading a book.\nNaturelle, in her early twenties, has the lean body of a\nrunner. It's cold outside but she doesn't seem to mind. When\nshe sees Monty coming she closes the book and stands.\n\n                    NATURELLE\n\n          How long have you guys been walking? I\n          woke up at seven and you were already\n          gone.                             _           _\nMonty, digging in his pocket for his keys, kisses her for an\nanswer. Naturelle closes her eyes and tries to embrace him\nbut Monty abruptly ends the kiss and climbs the stairs.\nDoyle wags the stump of his tail.\n\n                     NATURELLE (CONT'D)\n\n          How you doing, Mr. Doyle?\nShe bends down to scratch him behind his mangled ear.\n\n                    MONTY\n\n          Why you waiting down here?\n\n     ,            ' NATURELLE\n\n          I had my book. It was a beautiful day.\n\n                                                   (CONTINUED)\n\n\n\n\n\n                            ·'\"··· ··\"\"·· \" ' : '2\n\n\n                                 ·· \"             2\n\n\n      CONTINUED:\n\n\n\n\n\n\n\nc     Monty smiles.\n\n                          MONTY\n\n                Of course it was a beautiful day.\n      He holds the door open for her and Doyle.\n\n      INT. MONTY'S APARTMENT\n\n     Monty closes the apartment door behind Naturelle and Doyle,\n     then locks it. There are five locks and a heavy steel\n     deadbolt.\n     Despite the ominous security, it's a nice one-bedroom\n     apartment, with hardwood floors and tall windows facing the\n     brownstones across the street.\n     Black-and-white photographs line the walls: shots of the\n     Manhattan skyline, of Bensonhurst, of Doyle. The largest\n     photo, hanging above the sofa, is of Brogan's Bar.\n     Doyle curls up next to the radiator and quickly falls asleep.\n     Monty sits on the sofa and flicks on the television with the\n     remote.\n\n                         WEATHERMAN\n\n               The first major storm of winter is\n               heading our way --\n     Monty turns off the television. He stares at the dead screen.\n     Naturelle comes out of the kitchen carrying a jar of honey\n     and a spoon.\n     She hands the jar to Monty, who opens it for her. She sits\n    · beside him and begins eating\" the honey, watching him. He sees\n     her watching.\n\n                          MONTY\n\n               What?\n\n                         NATURELLE\n\n               What are you thinking about?\n\n                         MONTY\n\n               What am I thinking about?\n    He leans forward and unclips a hand-tooled leather holster\n    from the back of his belt. A \"B\" for Brogan is tooled into\n    the leather, stylized like the old Brooklyn Dodgers' logo.\n    A .40 caliber automatic, squat and black, rests in the\n    holster. Monty drops the holster onto the coffee table and\n    runs his fingers over the B. Naturelle stares at the gun.\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                              23\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                      MONTY (CONT'D)\n\n           I'm thinking I want to be like that girl\n           from the X-Men, the one who can walk\n           through walls.\n He's still tracing the holster's \"B \" with his fingertips.\n\n                     MONTY (CONT'D)\n\n           And if I can't do that, if I can't figure\n           out how to walk through walls, I'm\n           thinking one shot through the roof of the\n           mouth, boom, problem solved.\nNaturelle hits him on the shoulder.\n\n                     NATURELLE\n\n           Don't joke about that.\n\n                     MONTY\n\n           You think I'm joking?\n\n                     NATURELLE\n\n           So what are we doing tonight? Before you\n           shoot yourself.\nMonty reclines, arms spread wide and resting on the sofa's\nback cushions.\n\n                    MONTY\n\n          Uncle Blue's throwing me a party at\n          Velvet.\n\n                    NATURELLE\n\n          I thought it was over with him.\n\n                    ...MONTY. --                -     .--\n\n          Almost.\nHe watches her eat another spoonful of raw honey.\n\n                    MONTY (CONT'D)\n\n          That's a nasty habit you have.\nShe leans forward and kisses him on the lips.\n\n                    NATURELLE\n\n          Come take a bath with me.\n\n                    MONTY\n\n          Not right now.\nShe caresses his jaw but Monty is distant, his mind                   J\nelsewhere.                                                         ^--^\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                                   24.\n\n\n     CONTINUED: (2)\n\n\n\n\no    She sets the honey jar on the table and walks out of the\n     living room. Monty listens to her in the bathroom, drawing\n     the bathwater.\n     He listens to the sound of running water.\n\n                                                            CUT TO:\n\n\n     INT. MONTY'S BATHROOM -- SIX MONTHS AGO\n\n    Naturelle sits on Monty's lap in the narrow bathtub. He's\n    massaging her shoulders. Music plays from a radio on the\n    windowsill.\n    She is laughing at something he just said. He leans closer\n    and kisses the back of her neck, behind her ears. She\n    stretches back, lifting one leg out of the bath.\n    He runs his hand down her thigh and then stops, looking at\n    the Puerto Rican flag tattooed on her ankle. She follows his\n    gaze to the tattoo and then groans.\n\n                        NATURELLE\n\n              Not this again.\n\n                        MONTY\n\n              You were born in America, you lived in\n              America your whole life, you've been to\n              Puerto Rico twice, for vacation. What is\n              that? I should get an Irish flag tattooed\n              on my ass cause my grandparents are from\n              there?\n\n                        NATURELLE\n\n              You,don!t have room on your ass for an\n              Irish flag.\n    Monty dips his hands into the warm water, reaches below her,\n    grabs her butt. Naturelle shrieks and Monty laughs.\n\n                        MONTY\n\n              Between you and me the kids will be just\n              right.\n    Loud pounding on the apartment door startles them. They stare\n    at each other. Doyle barks from the other room.\n    Naturelle gets out of the tub, pulls on a bathrobe, and goes\n    to answer the door. Monty waits, listening. He knows who it\n    is. He stares out the bathroom's open window.\n\n\n\n\n                                                                   25.\n\n\n\n\n\n\n\n\n\n\n\nC)    INT. MONTY'S LIVING ROOM -- STILL IN FLASHBACK\n\n     Monty, wearing sweatpants and no shirt, walks into the living\n     room. Four D.E.A. AGENTS, all wearing D.E.A. windbreakers and\n     shoulder holsters, wait for him.\n     Doyle, ears back, growls at the agents. Monty scratches\n     Doyle's head and the dog relaxes a bit.\n     Naturelle, panicked, stares at Monty. She's still holding the\n     apartment door open.\n\n                           MONTY\n\n                Close the door, baby.\n     She closes the door.\n\n                         AGENT BRZOWSKI\n\n               Montgomery Brogan?\n\n                            MONTY\n\n               Yeah.\n     Brzowski flips open a badge and hands a paper to Monty, who\n     looks it over.\n\n                         AGENT BRZOWSKI                                    ^^\n\n               I'm Agent Brzowksi with the Drug\n               Enforcement Agency. We've got a warrant\n               to search your apartment.\n     Brzowksi walks over to the sofa and sits down. The other\n     three agents stroll around the apartment. One looks out the\n     window; one starts flipping through a magazine on the coffee\n     table; one stares at a photograph on the wall.\n\n                         AGENT CUNNINGHAM\n\n               You take this picture?\n\n                         MONTY\n\n               Yeah.\n\n                         AGENT CUNNINGHAM\n\n               Nice picture.\n     When one of the agents steps too close to Doyle, the dog\n     growls and the agent jumps back.\n\n                         MONTY\n\n               Easy, Doyle.\n\n                         AGENT BRZOWSKI                                    I)\n\n               I don't see any tags on that dog.                         ^\"^^\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                              26,\n\n\n                          · ---· -\n\n\n                               ·\n\n\n     CONTINUED :\n\n\n\n\n\n\n\no                            MONTY\n                   He's inside. He doesn't have to wear\n                   tags.\n\n\n\n\n                         AGENT BRZOWSKI\n\n               He better stay calm or I'll have the\n               pound come get him. I've seen too many\n               men bit by these little bastards .\n    Monty whistles and Doyle stands and walks over to him. Monty\n    crouches, one hand stroking Doyle's thick neck.\n\n\n\n    Naturelle, uncomfortable wearing only the bathrobe, begins\n    heading back to the bedroom.\n\n                          AGENT BRZOWSKI (CONT'D)\n\n               Ms . Rosario? That's your name , right? I\n               need you to stay right here, ma'am.\n\n\n\n    He winks at her.\n\n                         AGENT BRZOWSKI (CONT'D)\n\n               Can't have you sneaking around.\n    Naturelle leans against the wall, looking for a sign from\n    Monty, who gives her none.\n    The agents don't seem to be searching very hard.\n\n                            AGENT BRZOWSKI (CONT'D)\n\n               Hm.\n    He stares down at the sofa he's sitting on .\n\n                         AGENT BRZOWSKI (CONT-?D)\n\n               This sofa is not very comfortable.\n    Monty stares at the agent for a second and then exhales. He\n    turns and looks carefully at Naturelle.\n\n\n\n\n                         AGENT CUNNINGHAM\n\n              Maybe it's your posture. Posture's very\n              important.\n\n\n\n\n                         AGENT BRZOWSKI\n\n              No , it's this sofa. It's very\n              uncomfortable. It's lumpy.\n\n                        MONTY\n\n              Get it over with.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                           (CONTINUED)\n\n\n\n\n\n                                                                      27\n\n\n         CONTINUED: (2)\n\n\n\n\n\n\n\nyj                           AGENT BRZOWSKI\n                   I just don't understand. It looks like\n                   such a nice sofa. How much did you pay\n                   for this sofa, Ms . Rosario?\n         Brzowksi stands and looks down at the cushion. Monty is still\n         staring at Naturelle, who meets his eye for a second and then\n         quickly turns away.\n\n                             AGENT BRZOWSKI (CONT'D)\n\n                   Maybe it's the padding?\n\n                             AGENT CUNNINGHAM\n\n                   Could be the padding.\n         Brzowski picks up the center cushion, turns it in his hands,\n         and unzips it.\n\n                             AGENT BRZOWSKI\n\n                   Probably the padding.\n        He pulls out handfuls of white fiber filling and lets them\n        drift to the floor. Monty and Naturelle watch.\n\n   ,                          AGENT BRZOWSKI (CONT'D)\n\nrsS*f              Yeah, there's something lumpy in here,\n v-v              Mr. Brogan. It's a good thing I found\n                    this, you know. It'll make your sofa much\n                   more comfortable to sit on.\n        The other agents laugh. Brzowski pulls out a package the size\n        of a bottle of wine from the cushion, a bundle of plastic\n        wrap and masking tape.\n        Brzowski raises his eyebrows in mock shock while the other\n        agents poh and. cluck*        -- --,      --· -~ -- ---\n\n                                                              -\n\n\n                            AGENT BRZOWSKI (CONT'D)\n\n                  Mr. Brogan, I do believe you're fucked.\n\n        END FLASHBACK\n\n\n        INT. MONTY'S LIVING ROOM\n\n        Monty sits on the sofa, running his hand over the sofa\n        cushion. Outside it's dark and Monty hasn't turned on the\n        lights.\n\n                             NATURELLE (O.S.)\n\n                  Baby?\nV_/     Monty looks up. Naturelle stands in the bathroom's doorway,\n        wearing a bathrobe.\n\n                                                            (CONTINUED)\n\n\n\n\n\n                                                              28\n\n\n CONTINUED :\n\n\n\n\n For a moment they watch each other in silence. Then he\n stands, grabs the holster off the table, and clips it to the\n back of his belt.\n\n\n\n\n                      NATURELLE (CONT'D)\n\n            Where you going?\n\n\n\n\n                      MONTY\n\n            I got to meet my dad for dinner. I'll\n            call you in a couple hours.\nHe kisses her quickly and turns to go, but then stops and\nlooks at her.\n\n                      MONTY (CONT'D)\n\n            Could you wear the silver dress tonight?\n\n\n\n\n                      NATURELLE\n\n            You want me to?\n\n\n\nHe nods.\n\n                      MONTY\n\n            I want to remember you in that dress .\nHe walks out of the apartment, leaving Naturelle alone in the\ndark living room.\n\nEXT. MONTY'S BUILDING\n\nKostya sits on the top step of the stoop, sipping from a\nsilver flask. A female JOGGER runs past and Kostya calls\nafter her.\n\n                           KOSTYA\n\n        ···· Hello ,--teeauti-f-uA~ woman!\n\n           -\n\nShe doesn't look in his direction. He takes another swig from\nhis flask.\nA young MOTHER pushes a baby stroller past the stoop.\n\n\n\n\n                     KOSTYA (CONT'D)\n\n           Hello, beautiful mother! Hello, little\n           baby!\nThe mother doesn't look at him, but the two-year old GIRL,\nfascinated, stares at him.\n\n\n\n\n                      KOSTYA (CONT'D)\n\n                (calling after mother)\n           You look like Julia Roberts. They tell\n           you this, yes? Come back! I make you a\n           new baby. I make you a boy!\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                              29\n\n\nCONTINUED:\n\n\n\n\n\n\n\nMonty opens the front door. He stares down at Kostya.\n\n                     MONTY\n\n           What are you doing here?\n\n                     KOSTYA\n\n           So many beautiful women, this\n           neighborhood. I like very much.\nKostya stands and grips Monty's arm.\n\n                     KOSTYA (CONT'D)\n\n           You are okay?\n\n                      MONTY\n\n           I'm having the time of my life.\n\n                     KOSTYA\n\n           Uncle Blue wants me talking with you. He\n           wants you coming to Velvet tonight.\n\n                     MONTY\n\n           Yeah, three other people already told me .\n           He's really dying to say goodbye, huh?\nKostya releases Monty's arm and nods sadly.\n\n                       KOSTYA\n\n           It seems.\n\n                    MONTY\n\n          What does he want?\n\n                    KOSTYA\n\n          I don't know.\n\n· --·--              MONTY : \"-\" \" ·\"\"\"\"\n\n\n                                ~       ·\n\n          You came all the way up here to tell me\n          this? You heard of telephones?\n\n                    KOSTYA\n\n          Yes, I heard, but you don't return my\n          calls. And Uncle wants to make sure.\n\n                    MONTY\n\n          I'll be there. I'm bringing Naturelle and\n          some friends.\n\n                    KOSTYA\n\n          You bring her? Why?\n\n                    MONTY                                          \"V\n\n          Why wouldn't I ?                                         v^\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                                30\n\n\n CONTINUED : (2)\n\n\n\n\n\n\n\n Kostya shrugs.\n\n\n\n\n                      KOSTYA\n\n            We have this conversation one time,\n            remember? You get angry.\n\n                      MONTY\n\n           Oh , Jesus. She didn't dime me out, man .\n\n\n\n\n                        KOSTYA\n\n           No?\n\n\n\n\n                     MONTY\n\n           Why would she?\n\n\n\n Kostya shrugs again.\n\n                     KOSTYA\n\n           Maybe her aunt is illegal alien.\n\n                     MONTY\n\n           What if she is?\n\n                     KOSTYA\n\n           Maybe the Federals threaten her.\nMonty shakes his head and walks down the stairs.\n\n                     MONTY\n\n  .        You're insane. She wouldn't do that.\n\n                    KOSTYA\n\n          No? Did you ask her?\nMonty--stares--up--at- Kostya for a few seconds before-walking --\naway.\nKostya stands at the top of the stoop. He feels something and\nraises his palms to the air. The snow has begun to fall.\n\n\n\nHe looks up into the sky. Something catches his eye -- in one\nof the fourth floor windows, Naturelle is staring down at\nhim.\nKostya watches her. She lets the curtain close. Kostya takes\nanother slug from his flask.\n\n\n\n\nINT. SUBWAY STATION\n\n\n\n\nMonty waits for the 6 train. Two BOYS (12), wearing winter\nparkas and knit caps, crouch near the edge of the platform,\npointing down at the tracks and laughing.\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                              31\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                     MONTY\n\n           What's down there?\n The boys point and Monty looks. We follow his gaze. We can't\n see anything at first, but then, as if our eyes were\n adjusting to the dark, we begin to pick out movement.\nA gang of large RATS crawls through the tracks, nosing\nthrough balled-up paper bags, candy wrappers and orange\npeels.\n\n                      BOY 1\n\n           These ones, they eat rat poison like\n           chocolate.\nThe biggest rat of all sniffs around the base of an upright\nwax-paper coffee cup that sits just outside the third rail.\nMonty reaches into the pocket of his camel's hair coat and\npulls out a handful of change.\n\n                    MONTY\n\n          Watch this.\nHe selects a quarter and -- with a free throw motion as smooth\nas Hersey Hawkins's-- tosses it into the empty cup, a ten-\nfoot shot.\nThe big rat, startled, hustles into the alcove below the lip\nof the platform. The boys, impressed, whistle.\n\n                     MONTY (CONT'D)\n\n          Here --\nHe offers his palmful of change.\n\n                    MONTY (CONT'D)\n\n          Take a shot at it.\nThe boys look at each other for a moment before each takes a\ncoin. They stare up at Monty. He nods at them.\n\n                    MONTY (CONT'D)\n\n          Let's see what you got.\nBoy 1 takes careful aim at the coffee cup. His shot is way\noff target, though -- it pings off the tile on the far side of\nthe tunnel.\n\n                    MONTY (CONT'D)\n\n          Your release is too high. Look --\nHe mimics the boy's shooting motion.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                   32\n\n\n      CONTINUED : (2)\n\n\n\n\n\n\n\no\n\n^^                        MONTY (CONT'D)\n\n                See? You're letting go way up here, so\n                it's floating on you. It's like -- you\n                play basketball?\n\n                          BOY 1\n\n                No.\n\n                            MONTY\n\n                Baseball?\n\n                            BOY 1\n\n                No .\n\n                          MONTY\n\n                No? What do you play?\n\n                            BOY 1\n\n                Soccer.\n\n                           MONTY\n\n                     (disgusted)\n                Soccer? All right, forget it.\n                     (turning to the other boy)\n                Your turn, little man .\n     Boy 2 toes the edge of the yellow danger line and practices\n     his motion . When he finally releases the coin, it flashes\n     through the air and drops neatly into the cup.\n\n                            MONTY (CONT'D)\n\n                Thataboy!\n     He raises his fist and the boy taps knuckles, grinning\n\n\n\n\n                         BOY 1\n\n               You see that! You see that! Charlie got\n               mad skills!\n     Charlie says nothing, just grins and hops around on one foot.\n\n\n\n\n                         MONTY\n\n               Make a wish.\n\n\n\n\n                         CHARLIE\n\n               I get a wish?\n\n                           MONTY               '\n\n               Hell , yes . A shot like that deserves a\n               wish.\n\n\n\n     Monty and Charlie stare at the coffee cup and concentrate.\n\n\n\n\n                                                                      33\n\n\n\n\n\n\n\n\n\n\n\n INT . 6 TRAI N\n\n Mont y rest s wit h hi s eye s close d a s th e trai n shudder s\n throug h th e tunnels .\n\n                        TRE Y (O.S.)\n\n             Monty ? Mont y Brogan ?\nMont y open s hi s eyes . TRE Y POWEL L (27) stand s abov e him ,\nholdin g th e ba r an d smilin g dow n a t Monty . A blonde , blandl y\nhandsom e man , Tre y look s lik e h e migh t hav e rowe d fo r Yale' s\ncrew . H e wear s a well-cu t navy-blu e suit . Hi s wife , NANC Y\n(26) , stand s besid e him -- equall y blonde , equall y bland .\n\n                       MONT Y\n\n                 (not recognizin g them )\n            Hey.. .\n\n                       TRE Y\n\n            Tre y Powell ! Fro m Campbell-Sawyer !\n\n                        MONT Y\n\n                 (trying fo r enthusiasm )\n            Oh , Trey . Hey . Ho w yo u been ?\n\n                         TRE Y                                                 \\\n\n            Excellent , excellent . Well , Goldman' s go t                 w*^jf\n            m e locke d awa y twent y hour s a day , bu t\n            othe r tha n that.. . I'm sorry , Nancy , thi s\n            i s Mont y Brogan . Bes t basketbal l playe r\n            eve r t o pla y fo r Campbell-Sawyer .\nMont y stand s an d shake s he r hand .\n\n                         MONT Y\n\n            Nic e t o mee t you . Here , tak e m y seat .\n\n                        NANC Y\n\n            No , no , please --\n\n                        MONT Y\n\n           Thi s i s m y stop . I go t t o catc h th e B\n           train .\n                                          j\nTrey claps Monty on the shoulder.\n\n                     TREY\n\n           Too bad, I wanted to catch up.\n\n                     MONTY\n\n           Yeah, well I'm sure I'll see you soon --\n\n                                                                           \\J\n\n\n                                                            (CONTINUED)\n\n\n\n\n\n                               \"-   .,*..--- ~-                34\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                      TREY\n\n            Tenth reunion. It's coining up! I'm the\n            alumni rep for our class, actually. We'll\n            see you there, I hope? June fifteenth?\n The train has pulled into the station and Monty moves toward\n the doors.\n\n                     MONTY\n\n           Yeah, I hope so, definitely. Good seeing\n           you.\n Monty makes his escape and Trey watches him go.\n\n                     NANCY\n\n           He went to Campbell-Sawyer?\n\n                     TREY\n\n           Mm. Well, he was a scholarship kid. It\n           didn't take, though. They threw him out\n           junior year.\nThrough the subway car windows, they watch Monty jogging up\nthe stairs.\n\n                       NANCY\n\n           For what?\n\n                     TREY\n\n          Selling drugs.\n               (beat)\n          You can take the kid out of Bensonhurst,\n          but you can't take the Bensonhurst out of\n          the kid.\n\nEXT. BROGAN'S BAR -- NIGHT\n\nThe snow is falling faster. We watch the flakes spin through\na yellow cone of streetlight.\nWe see the bar from the street.. The name \"Brogan's Bar &\nGrill\" is written in gold script on the storefront window.\nFrom the outside it looks like any other Bensonhurst bar,\nneon beer signs hanging in the window.\n\nINT. BROGAN'S BAR\n\nOn the inside, though, it's clear that attention has been\npaid to every detail. Everything is right: the zinc bartop,\nthe brass foot-rail, the antique mirrors behind the liquor.\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                                35,\n\n\n CONTINUED :             -        ···--\n\n\n\n\n\n\n A BARTENDER wipes down the bartop with a rag and a spray-\n bottle . Two CUSTOMERS sit on stools and watc h the basketball\n game on television.\n Mont y sits at a corner table with his father, JAME S BROGAN ,\n fifty. Each ma n has a pint of Guinness. The olde r Broga n was\n clearly a fine-looking ma n in his day, but the year s hav e\n bee n hard on him.\n Monty points at the Tiffany-glass sconces on the wall .\n\n                         MONT Y\n\n               Where'd you find those?\n\n                      MR . BROGAN\n\n           Estate sale in Sheepshead Bay. Old lady\n           dies and her kids sell everything five\n           days later. The china -- she probably\n           thought her great-grandkids would be\n           eating off those plates.\n\n                     MONT Y\n\n           Maybe they didn't need any more plates .\n\n                     MR . BROGAN\n\n               (wistfully)\n           It was beautiful china.\nMonty leans back in his chair and surveys the place . No t that\nhe hasn't seen the bar a thousand times -- he' s havin g a hard\ntime looking directly at his father.\nRUTH (60), a waitress with a face like a crumpled pape r bag,\narrives with the food: pork chops for the elder Brogan , a\nsteak for Monty.\n\n                     MONT Y\n\n           Thanks, Ruth .\n\n                     RUTH\n\n           Anytime, sweetie .\nShe rests her hand on Monty's shoulder for a moment .\n\n                    RUTH (CONT'D)\n\n          I'll send you cookies every month . Peanut                   I\n          butter, right? Your favorite.\nMonty smiles and nods . Ruth exchanges glances wit h Mr . Brogan\nbefore departing. Mr . Brogan breaks a bread roll an d butters\nit . He stares at the buttered bread and leaves it on his\nplate .                                                               \\j\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                               36,\n\n\n  CONTINUED : (2)\n\n\n\n\n\n\n\n\n                      MR. BROGAN\n\n            So I talked to Sal --\n\n\n\n\n                       MONTY\n\n            Ah , come on, Dad.\n\n\n\n\n                      MR. BROGAN\n\n            See if he can help with anything.\n\n\n\n\n                      MONTY\n\n            Sal? The guy's been out of the picture\n            for twenty years.\n\n                      MR. BROGAN\n\n            He might know some people in there .\n\n                      MONTY\n\n            The guy's three hundred years old. He\n            sits around playing gin rummy all day.\n            What's he going to do for me?\n\n                      MR. BROGAN\n\n            He still knows people.\n\n                       MONTY\n\n           Dad, would you please? I'll be all right.\n           Just, please, don't get involved in this .\n                (beat)\n           Okay?\n\n                     MR. BROGAN\n\n           You're still going to be a young man when\n           you get out.\n\n\n\n- Monty lets his fork drop and wipes his mouth with his napkin.\n\n                      MR. BROGAN (CONT'D)\n\n           I know you don't think so. But listen to\n           me . You keep your head down in there.\n           Don't start any trouble.\n\n                     MONTY\n\n           Jesus. Enough.\n\n\n\n Both men stare at the uneaten food on their plates .\n\n\n\n\n                     MR. BROGAN\n\n           This should never have happened.\n\n\n\n Monty raps the tabletop with his knuckles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                               37 .\n\n\n CONTINUED: (3)                                            \"-·-\n\n\n\n\n\n\n\n\n                     MONTY\n\n           Dad? I fucked up. Okay? What else can I\n           tell you? I fucked up.\n\nINT. BROGAN'S BATHROOM -- LATER\n\nMonty stands in the cramped bathroom, staring into the\nmirror. Someone has scrawled \"Fuck you\" in magic marker on\nthe wall above the mirror.\n\n                                                          CUT TO:\n\n\nINT. DEA DIVISION OFFICE, INTERROGATION ROOM ~ MORNING\n\nMonty stares into the mirror covering one wall of the room.\n\nINT. OBSERVATION ROOM -- CONTINUOUS\n\nTwo agents stare back at him through the one-way glass.\n\nINT. DEA DIVISION OFFICE, INTERROGATION ROOM -- CONTINUOUS\n\nMonty.sits at the table and waits. Agent Brzowksi walks in,\nfollowed by Agent Cunningham. Brzowski leaves the door ajar\nfor a moment.\nMonty looks through the door and sees Naturelle leaving\nanother room, escorted by two agents. She makes eye contact\nwith Monty. Brzowski shuts the door. He smiles at Monty.\n\n                    AGENT BRZOWSKI\n\n          Good looking girl you got there.\nMonty glares at him. Brzowski pretends to sh,iver.\n\n\n\n          Ooh, that's a scary look. Yikes. You see\n          the look he gave me?\nCunningham laughs. Both agents take seats at the table.\n\n                    AGENT BRZOWSKI (CONT'D)\n\n          Naturelle Rosario. What a name. You see\n          the body on that girl?\nCunningham laughs again.\n\n                    MONTY\n\n          You fucking touch her --\n\n                   AGENT BRZOWSKI\n\n         No, no, you've got it all wrong. She\n         fucking touched you.\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                             38\n\n\nCONTINUED :\n\n\n\n\n\n\n\nMonty is silent for a few seconds. When he does speak, his\ntone is very quiet and deliberate -- he is trying to restrain\nhis temper.\n\n                    MONTY\n\n          You're lying to me .\n\n\n\n\n                     AGENT BRZOWSKI\n\n          Am I? That's sweet, you really trust her .\n          All I know is, she's walking away. We\n          just signed her release. Bye bye ,\n          Naturelle.\n\n\n\n\n                    AGENT CUNNINGHAM\n\n          She's probably having a big party\n          tonight.\n\n                    AGENT BRZOWSKI\n\n          Sure, why not? Big celebration. She's got\n          that whole big apartment to herself now.\n\n                    AGENT CUNNINGHAM\n\n          She's a smart girl. You on the other\n          hand...\n\n                    AGENT BRZOWSKI\n\n          You're supposed to be smart. Got yourself\n          a scholarship to a fancy private school,\n          huh? Not bad for a kid from Bensonhurst.\n\n\n\n\n                   AGENT CUNNINGHAM\n\n         And then you get yourself thrown out for\n         dealing. Pretty dumb, buddy.\n\n\n\n\n        \"~ --   --'--AGENT\" BRZOWSKI\n\n         You know what happens to pretty boys like\n         you in prison?\n\n                    AGENT CUNNINGHAM\n\n         Oh , they are gonna love you.\n\n\n\n\n                   AGENT BRZOWSKI\n\n         But it's not too late, Brogan   . First\n         felony offense, we can offer    you a nice\n         deal. You just gotta be smart   . So why\n         don't you tell us about your    friend Uncle\n         Blue.\n\n\n\n\n                    MONTY\n\n              (to Cunningham)\n         Can I ask you a question?\n\n\n\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                                    39.\n\n\n      CONTINUED: (2)                          ..   , , ._..,._...\n\n\n\n\n\n\n\n\n                           AGENT CUNNINGHAM\n\n                 Sure.\n      Cunningham and Brzowski lean forward, eager to hear Monty\n      name the names.\n\n                           MONTY\n\n                 When you've got your dick up his ass, is\n                 he still talking all the time?\n      Cunningham and Brzowski sit back.\n\n                           MONTY (CONT'D)\n\n                Cause it seems to me he never shuts up,\n                and I'm just wondering, is that annoying,\n                you're fucking the guy up the ass and he\n                never shuts up?\n\n                                                             CUT TO:\n\n\n      INT. BROGAN'S BATHROOM\n\n      Monty still stares at the mirror. He wets his thumb and tries\n      to rub out the magic marker \"Fuck you\". Someone knocks on the\n      door. Monty rubs harder. It's not coming out.\nVZ7   Another knock.\n\n                          MONTY\n\n                Yeah, all right.\n\n      INT. BROGAN'S BAR\n\n      Monty returns to the table, sits, drinks some Guinness. ,\n\n                           MONTY\n\n                Let me aBk you \"a question.\n\n                          MR. BROGAN\n\n                Okay.\n\n                          MONTY\n\n                What do you think of Naturelle?\n\n                           MR. BROGAN\n\n                She's a good girl. Your mother would have\n                liked her.\n\n                         MONTY\n\n               Do you trust her?\n\n\n\n\n                                                                          Q\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                    ..... .       40\n\n\n      CONTINUED:\n\n\n\n\n\n\n\n\n                          MR. BROGAN\n\n                Do I trust her? Why do J have to trust\n                her?\n\n                          MONTY\n\n                Do you think I can trust her?\n\n                         MR. BROGAN\n\n               Where you going with this?\n\n                           MONTY\n\n               I've been hearing weird things.\n                    (beat)\n               Some people are saying she dimed me out\n\n                          MR. BROGAN\n\n                    (incredulous)\n               Why would she do that?\n\n                         MONTY\n\n               I don't know. Maybe the Feds got to her\n               somehow. Blackmailed her.\n\n                         MR. BROGAN\n\n               The girl loves you/ Monty. I can't\n               believe she would betray you.\n\n                         MONTY\n\n               Everything's gotten so strange, Dad. I\n               wake up some mornings and it takes me a\n               minute to remember who I am, you know?\n               Where I'm going.\n     Mr. Brogan looks down at his plate and nods.\n\n                         MONTY (CONT'D)\n\n              Most of the people I'm with, I look at\n              them and I think, these are my friends?\n                   (beat)\n              The only ones I trust these days are you\n              and the guys I grew up with -- Frank,\n              Jake.\n\n                        MR. BROGAN\n\n              I miss those boys.\n\n                        MONTY\n\n              And Naturelle... Jesus. I can't get it\n              out of my head.\n\n\n\nvL                      MR. BROGAN\n              It doesn't really matter now, does it?\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                    41\n\n\n      CONTINUED : (2)\n\n\n\n\n·(    Monty stares at his father, blue eyes unblinking.\n\n                          MONTY\n\n                It matters to me .\n     Monty checks his watch.\n\n                          MONTY (CONT'D)\n\n                I should get going.\n\n                          MR. BROGAN\n\n                Okay. I'll see you in the morning.\n     Mr . Brogan removes his wallet from the inside pocket of his\n     jacket.\n\n                          MONTY\n\n                The morning? What for? I'm taking a bus\n                up there.\n\n                         MR. BROGAN\n\n               Forget the bus. I'll drive you. It'll\n               take half as long.\n     Monty frowns, backing his chair away from the table.\n\n                         MONTY\n\n               No thanks. I'd rather say goodbye here.\n     Mr . Brogan pulls a small photograph from his wallet and hands\n     it to his son.\n\n                         MR. BROGAN\n\n               Take this. They'll let you keep it.\n     Monty holds the picture carefully.                                  ._., ._\n\n                                                                            _ =!\n\n\n     INSERT PHOTO\n\n     James Brogan, twenty years younger, his arm around his\n     beautiful wife. The six-year-old Montgomery Brogan stands in\n     front of them, wearing yellow pajamas and a red plastic\n     fireman's helmet, staring at the floor.\n\n                        MR. BROGAN (CONT'D)\n\n              When you were a little kid you used to\n              sleep in that fireman's helmet. Your\n              mother --\n\n                        MONTY\n\n                  (still looking at photo)                                 ..-?·-.\n              Don't, Dad. Not now.                                       L'·')\n\n\n\n\n                                                          (CONTINUED )\n\n\n\n\n\n     CONTINUED: (3)\n\n\n\n\n\n\n\n\n\n\n>    Monty carefully inserts the photo into his own wallet , kisses\n     his father's forehead, and walks away.\n\n\n\n     James Brogan stares at the empty chair where Monty had sat.\n\n\n\n\n     INT. ELEUTHERIA GREEK RESTAURANT -- NIGHT\n\n\n\n\n     UNCLE BLUE, SENKA VALGHOBEK, and VICTOR GEDNY sit on the\n     private balcony that overlooks the restaurant's mai n room.\n\n\n\n     The place is furnished in classic Outer Borough Greek\n     fashion: whitewashed walls , clay-tiled floors, poster s of the\n     Parthenon at dawn and Santorini at sunset.\n\n\n\n    Uncle Blue owns the place . He's a fierce-looking ma n with a\n    thick black beard, powerful hands, and no tolerance for\n    incompetence. It's hard to determine his age -- anywhere from\n    forty to sixty.\n    Valghobek, his lieutenant, looks at first glance like an\n    overweight suburban dad. But on closer inspection there is\n    something absolutely mirthless in his smile, a meannes s\n    around his eyes. He's in his late forties.\n    Gedny, mid-thirties, Uncle Blue's lawyer, wears a shiny suit,\n    a gold bracelet, and a deep , artificial-looking tan .\n    Gedny busily eats his shrimp and feta while the other two\n    watch him. Gedny gestures toward the windows.\n\n                        GEDNY\n\n              Starting to snow.\n\n                         UNCLE BLUE\n\n              You met with Brogan this morning.            ··-\n    Uncle Blue's accent, like his age, is difficult to pi n down.\n    He could be Afghani or Iranian or Turkish.\n\n\n\n\n                        GEDNY\n\n              I did, yeah.\n\n\n\n    Gedny reaches for his wine , takes a sip.\n\n\n\n\n                         UNCLE BLUE\n\n              And?\n\n\n\n\n                          GEDNY\n\n              He' s no t lovin g lif e righ t now,\n              obviously . I don' t know. He' s har d t o\n              read .\n\n\n\n\n\n\n\n\n\n\n                                                            (CONTINUED)\n\n\n\n\n\n                                                                                           43 .\n\n\n             CONTINUED :\n\n\n\n\n\n\n\n\n(        )                              UNCL E BLU E\n\n                           I kno w h e is . I don' t lik e that .\n\n                                       GEDN Y\n\n                           Listen , on e hundre d percen t certain , th e\n                           ki d didn' t flip . The y woul d no t b e\n                           sendin g hi m t o Otisvill e i f h e flipped .\n             Uncl e Blu e an d Valghobe k exchang e glances . It' s clea r the y\n             don' t hav e muc h respec t fo r th e lawyer .\n\n                                    UNCL E BLU E\n\n                         We'r e talkin g abou t huma n behavior , Mr .\n                         Gedny . Nothin g i s on e hundre d percen t\n                         certain .\n\n                                    VALGHOBE K\n\n                         Don' t assum e they'r e idiots .\n\n                                       GEDN Y\n\n                         That' s jus t it . They'r e no t idiots . N o\n                         wa y i n hel l th e kid' s stil l walkin g\n                         aroun d ou t her e i f h e flippe d Federal .\n                         Secon d h e goe s he' s gone, right ? I f he' s\n                         thei r sta r witness , they' d hav e\nj-J§i                    disappeare d him .\n             Gedn y fork s anothe r shrim p an d eat s it .\n\n                                      GEDN Y (CONT'D )\n\n                               (mout h full )\n                         He' s kep t hi s mout h shut .\n\n                                           VALGHOBE K\n\n                         S o far .\n\n    :'              -              ~ \" GEDN Y                         \"\"~\"\n\n                        He' s a smar t kid . H e know s what' s goo d\n                        fo r him .\n\n                                    UNCL E BLU E\n\n                        He' s soft . H e won' t las t lon g i n there .\n\n                                           GEDN Y\n\n                        He'l    l     hav e to . Fe d mandatory , tha t mean s\n                        on e    da    y of f pe r mont h o f goo d behavior .\n                        Eve n     i   f he' s a fuckin g choirboy , he' s i n\n                        ther    e     seve n years .\n\n                                    UNCL E BLU E\n\n                              (to Valghobek )\n                        He' s comin g tonight ?                                                   r,,'J\n\n\n\n\n                                                                                 (CONTINUED)\n\n\n\n\ni                                                                 44\n\n4    CONTINUED:     (2)\n\n\n\n\n\n\n\n     Valghobek nods.\n\n\n\n\n                         GEDNY\n\n               Where to? Throwing him a goodbye party at\n               VelVet?\n\n                          UNCLE BLUE\n\n               You won't be there, Mr . Gedny.\n\n\n\n\n                         GEDNY\n\n               What do I have to do to rate one of those\n               VelVet parties? Aside from getting locked\n               up for seven years.\n\n                         UNCLE BLUE\n\n               Win more trials.\n    Gedny laughs but quickly notices that Uncle Blue and\n    Valghobek are not amused.\n\n                         GEDNY\n\n              Listen, they found six hundred     and fifty\n              g's in your boy's sofa cushion.     They got\n              every white junkie on the East     Side\n              saying Brogan's the sell. Game     over.\n\n\n\n    Uncle Blue and Valghobek say nothing. Gedny licks his lips\n\n                         GEDNY (CONT'D)\n\n              It's U.S . Code. There's nothing to argue.\n              Who do I argue with, the fucking grid?\n              It's seventy-eight to ninety-seven\n              months, automatic. I kept him out of\n              stepback* kep_t him in the world for a few\n              extra months --\n\n                         UNCLE BLUE\n\n              The judge kept him out of stepback. Why?\n              If he's not talking with the Federals,\n              how come he's still on the street?\n\n\n\n    Gedny shrugs.\n\n                        GEDNY\n\n             It's pretty common for non-violent\n             offenders. He's a white boy with no\n             record and his father put up his bar as\n             the bail bond. They're not worried about\n             him jumping.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                  45\n\n\n CONTINUED: (3)\n\n\n\n\n\n\n\n\n                       UNCLE BLUE\n\n            They know more than you think. If\n            Brogan's telling the truth, he was\n            touched. The DEA went straight to his\n            sofa. They knew exactly where it was.\n\n                      GEDNY\n\n            Someone dimed him out. You know who?\n Uncle Blue and Valghobek watch the lawyer, impassive and\n silent.\n\n                     GEDNY (CONT'D)\n\n           None of my business.\n\n                      UNCLE BLUE\n\n           Correct.\n\n EXT. MULBERRY STREET -- NIGHT\n\nMonty walks down the snow-covered street, hands in the\npockets of his camel's hair coat. He watches everything\nintently: the passersby, the cars swerving through the slush,\nthe stores and restaurants.\n\nEXT. CLOTHING BOUTIQUE\n\nHe stops in front of a fashionable shop. Beyond the plate\nglass window, bald mannequins wear the latest styles.\n\n                                                           CUT TO:\n\n\nEXT. CLOTHING BOUTIQUE -- FLASHBACK (TWO YEARS EARLIER)\n\nMonty and Naturelle, hand in hand, stare through the window\nat the elegantly attirejl manneguins_» ,,The shop appears to be\nclosed for the night.\n\n                    NATURELLE\n\n          This is my favorite store.\n\n            '       MONTY\n\n          I know. Let's go in.\n\n                    NATURELLE\n\n          It's closed.\n\n                    MONTY\n\n          Not for you it's not.\nHe raps on the window. A SALES CLERK (25) walks over to the\nwindow, peers out and sees Monty. He goes to the door,\nunlocks it, holds it open for Naturelle and Monty.\n\n\n\n\n                                                   .   (CONTINUED)\n\n\n\n\n\n                                                                             46\n\n\n               CONTINUED:\n\n\n\n\n\n\n\n               Naturelle stares at Monty, who smiles and beckons for her to\n               enter. She raises her eyebrows and goes in. Monty nods to the\n               clerk as he enters the store.\n\n                                   MONTY (CONT'D)\n\n                         How you doing?\n\n                                    CLERK\n\n                         Pretty good, Monty, how you been?\n\n               INT. CLOTHING BOUTIQUE\n\n               Naturelle and Monty have the shop to themselves. She walks\n               around, inspecting the blouses, the pants, the jackets and\n               handbags. Monty watches hex.\n\n                                   NATURELLE\n\n                         Everything here is so expensive.\n\n                                   MONTY\n\n                         Don't worry about that. It's your\n                         birthday.\n              The clerk emerges from the back room.\n/\"'.'Jaillt\n[]^m                               CLERK\n vs\"\n \"~                     We got some of the new stuff in from\n                         Italy this morning. You want to take a\n                         look?\n\n              INT. BACK ROOM\n\n              The new clothes are still wrapped in plastic. Naturelle pokes\n              around, touching the fabrics, examining the cuts. The clerk\n              touches her arm*    -           -            -    ---    -\n\n                                  CLERK\n\n                        Here, check out this dress. It's the best\n                        thing they've made in years.\n              He tears the plastic wrap off a dress hanging in the corner\n              of thp rnrmu--It really is a gorgeous dress,--sleek and silver,--\n              looking almost liquid under the fluorescent lights.\n              Naturelle holds the hanger to her chest and looks at herself\n              in a full-length mirror leaning against one wall. She turns\n              to Monty and smiles.\n\n                                                                      CUT TO:\n\n\n\n\n\n                                                              47\n\n\n\n\n\n\n\n\n\n\n\n EXT. CLOTHING BOUTIQUE WINDOW -- NIGHT\n\n Monty, still remembering, stares through the window. His\n reflection stares back at him.\n\n INT. SLATTERY'S APARTMENT -- NIGHT\n\n Slattery opens the door and Jakob hurries in, his Yankees hat\n (which he wears for the rest of the night) and coat dusted\n with snow.\n\n                     SLATTERY\n\n           It's really coming down, huh?\nSlattery lives in a Young Man with Money without Woman\nApartment. The television set in the living room is so large\nthat the weatherman startles Jakob.\nThe living room itself is bigger than many Manhattan\napartments, but it's empty except for the television, an old\nsofa, a coffee table, a Persian rug (still rolled) under the\nwindows, and a shiny red electric guitar in the corner.\nSlattery returns to the sofa, bottle of beer in hand, while\nJakob remains standing, brushing the snow from his coat.\n\n                    JAKOB                                              ^\n\n              (indicating guitar)\n          You taking lessons?\n\n                     SLATTERY\n\n          You think I have time for guitar lessons?\n          It's nice though, huh?\n\n                    JAKOB\n\n          Yeah, it's nice.\n\n                     SLATTERY\n\n          I like that color red. Have you checked\n          out the TV yet? Big, right?\n\n                      JAKOB   =\n\n          Very big.\nOn television, the weatherman blabs on about the coming\nstorm.\n\n                    WEATHERMAN\n\n         ...for the New York metropolitan area,\n         and I'll tell you what, Carol, it could\n         be a doozy. Expect anywhere from six to                   -\n         ten inches of snow.                                           \\\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                              --.-........ -\n\n\n                                         .                     48\n\n\n CONTINUED :\n\n\n\n\n\n\n\n\n                     JAKOB\n\n           Do you think real human beings use the\n           word \"doozy\"?\n\n                     SLATTERY\n\n           Ten inches of snow!\n\n                     JAKOB\n\n           Maybe we'll have a snow day tomorrow.\n\n                      SLATTERY\n\n           We should go skiing this weekend. I\n           bought some racing skis. Six hundred\n           bucks.for a pair of fucking skis .\n\n                     JAKOB\n\n           I don't know how to ski.\n\n                      SLATTERY\n\n          Well so what. Neither do I. But ten\n          inches!\n               (beat)                                               !\n          You gonna stand all night? You'r e making                 !\n          me nervous.\nJakob sits beside Slattery and stares unhappily at the huge\ntelevision. When the screen goes blank befor e a commercial,         \\\nhe sees his own face reflected in the glass .                       j|\n\n                      JAKOB                                         ·!\n\n          Frank?\n\n                      SLATTERY\n\n          Yeah?\n\n                    JAKOB\n\n          Are you ready for this?\nSlattery changes channels.\n\n                      SLATTERY\n\n          For what?\n\n                    JAKOB\n\n          For tonight.\n\n                    SLATTERY\n\n          What's there to be ready for?\n\n                   JAKOB\n\n         What do we say to him? He's goin g to be\n         living in a cell for seven years .\n\n                    (MORE)\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                                49 .\n\n\n CONTINUED : <2)\n\n\n                     JAKOB (CONT'D)\n\n           It's like visiting a friend in the                       -\n           hospital with cancer . What do we say?\n\n\n\n\n                     SLATTERY\n\n           We don't say anything. We get him drunk\n           and go wherever he wants to go .\n\n                     JAKOB\n\n           I don't even know wh y he invited me .\n\n\n\n\n                     SLATTERY\n\n           What are you talking about?\n\n\n\n\n                     JAKOB\n\n           We hardly ever see each other these days .\n           You and I are his friends from the past .\n\n\n\n\n                     SLATTERY\n\n           His friends from the present haven't done\n           him much good.\nThey're quiet for a time, staring at the huge television.\n\n                     JAKOB\n\n           I can't believe he'l l be gone for seven\n           years. Someone turns him in and boom,\n           goodbye.\n\n                    SLATTERY\n\n          It's the best thing that ever happened to\n          him.\nThe comment startles Jakob.\n\n                    JAKOB\n\n          What does that mean ?\n\n\n\n\n                     SLATTERY\n\n          It means if he didn't get arrested, he\n          wouldn't be alive in seven years . They'd\n          find him under the Manhattan Bridge with\n          two bullets in hi s head.\nJakob thinks about this for a second before picking up a\nframed photograph from the coffee table.\n\n\n\n\nINSERT PICTURE\n\n\n\n\nSlattery, Jakob and Monty at age sixteen, mugging for the\ncamera.\n\n\n\n\n                    JAKOB                                                   .\n\n          God, we were little punks, huh?                               {       J\n\n\n\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n          ·       ·                            -   ·\"\"··              50,\n\n\n                          ··\n\n\n                          \"\"                                     ·-\n\n\n CONTINUED : (3)\n\n\n\n\n\n\n\n Slattery grunts. Jakob continues to stare at the photograph .\n\n\n\n\n                                                                CU T TO:\n\n\n\n\n\n INT.   CAMPBELL-SAWYER CAFETERIA -- FLASHBACK\n\n\n\n\nThe three boys, age sixteen, sit at a table with their trays\nof food. They wear the school uniform: blazers with the\nCampbell-Sawyer crest, loosely knotted ties.\n\n\n\nYoung Slattery picks up a strand of limp spaghetti from his\nplate .\n\n                        YOUNG SLATTERY\n\n              Watch this.\n\n\n\nHe sticks one end up one nostril while his friends stare at\nhim.\nSlattery snorts and then blows his nose. Monty and Jakob back\naway in disgust. Slattery sticks a finger into his other\nnostril and pulls down the end of the spaghetti strand.\nOne end of the spaghetti strand now dangles from each\nnostril. He pulls on each end, a little this way, a little\nthat way.\n\n                        YOUNG SLATTERY (CONT'D)\n\n              It's called brain flossing.\n\n                        YOUNG MONTY\n\n              This is why you're still a virgin.\n\n                        YOUNG SLATTERY\n\n              I'm not a virgin.\nTwo classmates, TREY and MASON, come over to their table .\nBoth are blonde, WASPy, and lazily elegant.\n\n\n\n\n                        TREY\n\n              That's attractive, Slattery.\n\n\n\n\n                        MASON\n\n              Very classy. Here they are , the three\n              Lords of the Outer Boroughs.\n\n\n\nSlattery glares at them, the spaghetti still dangling from\nhis nose .\n\n                          YOUNG SLATTERY\n\n              Fuck you.\n\n\n\n\n\n\n\n\n\n\n                                                           (CONTINUED)\n\n\n\n\n\n                                                             51\n\n\n CONTINUED:                                         >\n\n\n\n\n\n\n\n\n                       TRE Y\n\n           Ooh, good comeback. Come on, we expect\n           our scholarship boys to be a little\n           quicker than that.\n\n                      YOUNG SLATTERY\n\n                (clenching his fists)\n           You want to see how quick I am?\n\n                     MASON\n\n           All right, all right, take it easy. What\n           are you boys up to this weekend?\n\n                     YOUNG JAKOB\n\n           We've got that Paradise Lost paper due\n           Monday.\nTrey rolls his eyes.\n\n                    TREY\n\n          Monty, you coming to my party?\n\n                    YOUNG MONTY\n\n          I don't know, maybe.\n\n\n\n          It's gonna be a rager.\n\n                    YOUNG SLATTERY\n\n          A Park Avenue rager? You're gonna sit\n          around drinking tea?\nSlattery drinks from his milk carton, letting his pinkie\nfinger dangle in imitation of an aristocrat drinking tea\n\n                    TREY            ,,.    ...\n\n          Smoking tea, more like. I'm buying half\n          an ounce in the Meadow later on.\nMason mimics smoking a J.\n\n                    MASON\n\n          Two hundred bucks, going up in smoke.\n\n                    YOUNG MONTY\n\n\n 1\n\n          Two hundred bucks for half an ounce?\n\n                    TREY\n\n          Why, how much does it cost you?\nMonty shrugs\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n   -··-··                -              ·           --             - -52.\n\n\n  CONTINUED : (2)\n\n\n\n\n\n\n\n\n                        YOUNG MONTY\n\n              I could get it for seventy.\n\n\n\n  Trey pull s out his calfskin wallet and selects a crisp\n  hundred dollar bill . He hands it to Monty.\n\n                       TREY\n\n             You get it, you can keep the change.\n\n\n\n Trey and Mason amble away. Monty snaps the bill between hi s\n fingers. Jakob looks at Monty skeptically.\n\n                       YOUNG JAKOB\n\n             Since when are you the big player?\n\n                        YOUN   G MONTY\n\n                  (gesturing    at Trey and Mason)\n             They were born     with money, right? Okay,\n             fair enough. I     was born with sway.\n\n                       YOUNG JAKOB\n\n             What's sway?\n Monty leans toward the next table over, where four GEEKISH\n STUDENTS are poring over their textbooks.\n\n                      YOUNG MONTY\n\n            Hey, Julian. How's that math homework\n            treating you?\n JULIAN, a pale, pudgy boy with an odd resemblance to Alfred\n Hitchcock, grins at Monty and shrugs. He's clearly flattered\n by Monty's attention; his three friends stare at Monty.\n\n-- -- -       --·      JULIAN       \"\n\n            Piece of cake. Want to borrow it?\n\n                      YOUNG MONTY\n\n            Just to make sure you didn't screw it up .\n\n\n\nJulian laughs and hands Monty a sheet of graph paper covered\nwith geometric proofs .\n\n\n\n\n                       JULIAN\n\n            Try no t to copy my name this time.\n\n\n\n\n                      YOUNG MONTY\n\n            Ha ha .\n\n\n\nMonty smiles at Jakob and flutters the graph paper .\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                           (CONTINUED)\n\n\n\n\n\n                                                                             53 .\n\n\n        CONTINUED : (3 )                                  «.->..      - -^\n\n\n\n\n\n\n\n(Ifl                           YOUNG MONTY (CONT'D)\n ^~y              Sway.\n\nK\n\n                       (beat)\n                  Hey, Frank, you eating that? Cause I'm\n                  still hungry.\n       He grabs for the spaghetti strand dangling from Slattery's\n       nose. Slattery defends himself with a butter knife.\n\n                                                                        CUT TO:\n\n\n       INT. SLATTERY'S APARTMENT\n\n       Jakob returns the photograph to the coffee table.\n\n                            JAKOB\n\n                  Lords of the Outer Boroughs. Remember\n                  that?\n       Slattery stands and stretches. He looks tired.\n\n                             SLATTERY\n\n                  You want to help me with this rug? It's\n                  been sitting here for a month.\n\n                            JAKOB\n\n                  Where do you want it?\n\n                               SLATTERY\n\n                  Over here.\n       They carry the rolled rug to the center of the room and tear\n       off the plastic wrap.\n\n                           JAKOB\n\n                 What's he planning to do with Doyle?\n\n                            SLATTERY\n\n                 Doyle? I don't know. Give him to\n                 Naturelle?\n       Slattery balls up the plastic wrap and tosses it into the\n       corner. They begin unrolling the rug.\n\n                           JAKOB\n\n                 They should at least let him take his dog\n                 with him. Maybe it wouldn't be so lonely.\n       Slattery cocks an eyebrow and stares at Jakob.\n\n                           SLATTERY\n\n                 You can't take your dog to prison with\n                 you.\n\n\n\n\n                                                                   (CONTINUED)\n\n\n\n\n\n CONTINUED :\n\n\n\n\n\n\n\n\n                         JAKOB\n\n               I'm just saying it would be nice if you\n               could.\n\n\n\nThey look down at the unrolled rug.\n\n\n\n\n                     SLATTERY\n\n           That looks pretty good^\n\n                     JAKOB\n\n           Monty's tough. I think he'll be okay.\n\n\n\nSlattery starts shaking his head and Jakob hurriedly\ncontinues.\n\n                     JAKOB (CONT'D)\n\n           If it was me , I'd never last a day. But\n           Monty's different.\n\n                      SLATTERY\n\n                (dismissively)\n           You don't get it. Here, let's move it\n           closer to the sofa.\nThey lift the rug and shift it a few feet.\n\n                     JAKOB\n\n           So explain it to me .\n\n                     SLATTERY\n\n           You want the simple version? People wh o\n           look like Monty don't do wel l in prison .\n\n\n\n\n                     JAKOB\n\n          You're talking about... It can't be as\n          bad as people say. I mean, it's a Federal\n          prison. I'm sure they're pretty careful --\n\n\n\nSlattery starts to laugh.\n\n                     SLATTERY\n\n          Man , you talk exactly like a guy who\n          never left school.\n\n\n\nJakob has no comeback for this . He simmers.\n\n\n\n\n                     SLATTERY (CONT'D)\n\n          Monty's got three choices, and none of\n          them are good. One , he can run. Get on a\n          train going to wherever and hope they\n          never catch up to him.\n\n\n\n\n\n\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                               55.\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n\n                     JAKOB\n\n           He won't do that. His dad's bar --\n\n                      SLATTERY\n\n           I'm not saying what he will do, I'm\n           saying what his choices are. Number two --\n Slattery makes a gun with his thumb and index finger and\n points it at his temple. Jakob's eyes go wide.\n\n                     JAKOB\n\n           Kill himself? Not a chance. No way.\n           What's the third choice?\n\n                     SLATTERY\n\n           The third choice?\nSlattery thinks about it for a minute.\n\n                     SLATTERY (CONT'D)\n\n           The third choice is he goes to prison.\n\n                      JAKOB\n\n           That's what's going to happen. He'll go\n           and he'll make it through.\n\n                    SLATTERY\n\n          Maybe. But no matter what, it's bye-bye\n          Monty.\n\n                    JAKOB\n\n          What does that mean?\nSlattery raises his thumb.\n\n                    SLATTERY\n\n          If he runs, he's gone. And he won't be\n          coming home.\nHe raises his index finger.\n\n                    SLATTERY (CONT'D)\n\n          If he pulls the trigger, he's gone.\n          They'll keep the casket closed.\nHe raises his middle finger.\n\n                     SLATTERY (COM\" D)\n\n          If they lock him away, he's gone. You'll\n          never see him again.\n\n\n\n\n                                                                     Q\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                                   56.\n\n\n     CONTINUED: (3)\n\n\n\n\no                         JAKOB\n                I'll see him again. I'll visit him up\n                there and I'll see him when he gets out.\n\n                          SLATTERY\n\n               I wouldn't bet on it. You think you're\n               still gonna be friends? You think you'll\n               kick back with a couple beers and\n               reminisce? Forget it, Jake. It's over\n               after tonight.\n\n     INT. MONTY'S KITCHEN -- NIGHT\n\n     Naturelle, wearing the sleek, shimmering silver dress, enters\n     the kitchen. She's looking for something.\n     She finds her keys by the cutting board, and then stops for a\n     moment, looking at the carving knife atop the clean cutting\n     board.\n\n                                                               CUT TO:\n\n\n     INT. MONTY'S KITCHEN --ON E YEAR EARLIER\n\n    Naturelle, wearing shorts and a t-shirt, slices onions while\n    music plays on the stereo. We hear the apartment door open\n    and close, and then Monty comes into the kitchen.\n    Naturelle continues slicing onions. Monty walks over to her\n    and embraces her from behind. He kisses her neck, her ears.\n\n                         NATURELLE\n\n               You have a good day?\n\n                        \"· MONTY                           \"   \"\n\n              Mm hm.\n\n                        NATURELLE\n\n              Do anything special?\n\n                           MONTY\n\n              Nope.\n\n                        NATURELLE\n\n              Anyone call for me when I was out?\n\n                          MONTY\n\n              Nah.\n\n                          NATURELLE\n\n              Nobody?\n    Monty begins to get worried.\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                               57\n\n\n·CONTINUED:                     -   '\n\n\n\n\n\n\n\n\n                       MONTY\n\n           Urn. .. I don't --\nNaturelle wheels around and Monty has to jump back to avoid\ngetting gutted by the carving knife.\n\n                     NATURELLE\n\n           Like, for example, my mother didn't call?\n\n                     MONTY\n\n           Oh, shit. Shit, I'm sorry. I completely--\nNaturelle stabs the air to emphasize her point.\n\n                    NATURELLE\n\n          This is the third time this month,\n          Montgomery. What's your problem, you're\n          illiterate? You can't write down a\n          message on a piece of paper?\n\n                     MONTY\n\n           I meant to.y I just --\n\n                    NATURELLE\n\n          You meant to? You meant to?\n\n                    MONTY\n\n          Could you put the knife away?\n\n                    NATURELLE\n\n          I'll put the knife away. You want me to\n          put the knife away?\n\n                    MONTY\n\n              (smiling)\n          Okay --                                          ^\n\n                    NATURELLE\n\n          This is funny?\nMonty steps back and Naturelle advances on him with the\nknife. She's kidding, basically, but it's hard to tell.\n\n                    NATURELLE (CONT'D)\n\n          You think this is funny? I'll carve your\n          heart out, you shit.\nMonty laughs. Doyle has walked into the kitchen and now\nstands behind Monty, staring up curiously at the two humans.\n                    MONTY                                           x\n          You're gonna carve my heart out?                 ·        i)\n\n\n\n\n                                                  · (CONTINUED)\n\n\n\n\n\n                                                                  58\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n Naturelle waves the knife at him and Monty takes another step\n backward, trips over Doyle, and lands hard on his back . He\n begins to laugh hysterically.\n\n\n\n\n                      NATURELLE\n\n            Keep laughing.\n\n\n\n She kicks him in the ribs, not very hard, and Mont y howl s\n with laughter. Doyle, a little confused, licks Monty' s face.\n\n                     NATURELLE (CONT'D)\n\n           Yeah, keep laughing, you fuck. I'll carve\n           your heart out and feed it to Doyle.\nShe continues kicking while Monty laughs and Doyle,\nmystified, begins to bark, and finally Naturelle starts\nlaughing too.\nMonty grabs her wrist and pulls her down on top of him . She\ndrops the knife to the side and bites Monty, hard, oh the\nlips.\n\n                                                             CUT TO :\n\n\n\n\n\nINT. MONTY'S KITCHEN -- PRESENT\n\nNaturelle, in her silver dress, stares at the carving knife.\nDoyle pads in behind her, panting. Naturelle turns and looks\ndown at his blunt, expectant face.\n\n                     NATURELLE\n\n           You ready for this?\n\nINT. VELVET NIGHTCLUB -- MANAGER'S OFFICE -- NIGHT\n\nLUIS VOLANDES has decorated his office walls with signed\nphotographs of various low-rung celebrities.\nVolahdes, a potbellied ma n in his late thirties, wit h a mane\nof curly black hair , sits behind his desk, listening to\nKostya, who shadowboxes, ringed fists flashing.\n\n\n\n\n                      VOLANDES\n\n          You move prett y wel l fo r a fa t man. S o\n          tel l m e abou t thi s part y tonight .\n\n\n\nKostya throw s a left-right-lef t combination .\n\n\n\n\n                      KOSTYA\n\n          Uncl e Blu e want s th e VIP room.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                                         59\n\n\nCONTINUED :      ·· - - ·            ..,.-.,.\n\n\n                                            ,   ·...-··. ..-..--\n\n\n                                                       .        ·   ..\n\n\n                                                                     .\n\n\n\n\n\n\n\n\n                      VOLANDES\n\n           Al l right, that's what he wants . It's his\n           place. If someone had asked, I'd have\n           said do this party some other night .\n           Tonight's gonna be insane. This DJ we've\n           got playing, he's like Jesus these days .\n           Every high school kid in the five\n           boroughs is gonna be at my door .\n\n\n\nKostya frowns at the smaller man .\n\n                    KOSTYA\n\n          Monty goes to prison tomorrow. You wan t\n          we have party tomorrow night?\n\n\n\n\n                     VOLANDES\n\n               (holding up his hands)\n          Hey, I like Monty. He's a good kid. Okay,\n          any special requests for this party?\n\n\n\nVolandes taps the side of his nose. Kostya shakes his head\n\n                    KOSTYA\n\n          None of that. For his last night , we get\n          him a girl.\n\n                    VOLANDES\n\n          What does he like?\n\n\n\nKostya smiles.\n\n                    KOSTYA\n\n          Monty? He likes everything. Get him a\n          pretty girl. And don't be cheap.\nThe office door opens. Uncle Blue and Valghobek walk in.\nVolandes quickly stands.\n\n                    VOLANDES\n\n          Hey. I didn't -- we weren't expecting you.\n\n\n\n\n                     UNCLE BLUE\n\n               (to Kostya)\n          What time is Monty coining tonight?\n\n\n\n\n                     KOSTYA\n\n          One , two, who knows? Monty will be late\n          for his own funeral.\n\n                     UNCLE BLUE\n\n              (grim)\n         No , he won't. Bring him here at three.\n\n\n\n\n\n\n\n                                                           (CONTINUED)\n\n\n\n\n\n     -   '             -   -····\"- -        ·               ·\"   -    --   ···---   60\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n\n                           KOSTYA\n\n               Sure.\n\n                         UNCLE BLUE\n\n               You hear me? Three o'clock.\n\n                          VOLANDES\n\n               You want m e to, uh --\n\n                         UNCLE BLUE\n\n              From midnight on, I want you somewhere\n              else. Nobody comes down here, you got\n              that?\n\n INT. BUG BAR -- NIGHT\n\n Slatter.y. and Jakob sit on bar stools. Slattery sips from a\n glass of whiskey; Jakob nurses a bottle of beer.\n The Bug Bar gets its name from the exotic insects in glass\n jars behind the bar. A television above the bar shows the\n entertainment news.\nA VETERAN in an army jacket practices trick shots on the pool\ntable, JODY, the young, zaftig bartender, runs a rag over the\nbartop.\n\n                         JODY\n\n              How you doing, Frank? You want another\n              one?\n\n                           SLATTERY\n\n             Thanks.\n- She pours-his-bourbon-.         *,,»·-=«,.-.,,.-.··--^.                                --   __\n\n                        JODY\n\n             How about you, honey?\n\n                        JAKOB\n\n             No , I'm fine.\nJody walks away. Slattery and Jakob examine her tush.\n\n                        JAKOB (CONT'D)                                                             ;\n\n             One of the guys at school, this biology                                               i\n             teacher, Terry -- did you ever meet Terry?                                            j\n\n                         SLATTERY                                                                  |\n\n                   (still watching tush)\n             No.\n\n\n\n\n\n\n\n                                                                     (CONTINUED)\n\n\n\n\n\n                                        .                              61\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                        JAKOB                                                 {-\n\n           Anyway, h e reall y like s thi s girl .   In a\n           sor t of--\n\n\n\n\n                      SLATTERY\n\n           A girl ? What d o you mean , a student ?\n\n\n\n\n                       JAKOB\n\n           A student, yeah. A junior. What's weird\n           is, I mean this girl is sixteen. Maybe\n           seventeen, I don't know. She's not really\n           pretty -- not in the usual way, but she's --\n           I don't know, she's got something.\n\n                        SLATTERY\n\n           Uh-huh.\n\n                     JAKOB\n\n          I told him -- I told Terry he ought to\n          just forget about it, put her out of his\n          mind, but he's -- he's kind of obsessing.\n          It's a little scary, the way he talks\n          about it. He's like, ^Five years from\n          now, she'll be almost out of college. And\n          I'll be thirty-one. Nothing wrong with\n          that.'                                                             r~\\\nSlattery sips from his whiskey. He still hasn't looked at\nJakob.\n\n                    SLATTERY\n\n          You haven't fucked her yet, have you?\nJakob's eyes go wide.\n\n\n\n\n                                           _\n\n           See, wait a second. If you were listening\n           to me you'd know I was talking about\n          Terry. The biology teacher? Terry?\nSlattery turns and appraises Jakob.\n\n                    SLATTERY\n\n          You haven't fucked her, right?\nJakob starts to protest and Slattery raises his eyebrows.\n\n                     JAKOB\n\n          No.\n\n                    SLATTERY\n\n          Good. That would be a mistake.                                    fv \\\n\n\n\n\n                                                            (CONTINUED )\n\n\n\n\n\n                                                               62 .\n\n\n CONTINUED : (2)\n\n\n\n\n\n\n\n Jakob angrily picks at the label of his beer bottle.\n\n\n\n\n                     JAKOB\n\n           I'm not a pervert or anything.\n\n\n\n Slattery drains his whiskey. He tries to catch Jody's eye ,\n but she's staring at someone who just walked into the bar .\n\n\n\nSlattery and Jakob see Monty in the mirror. For a momen t\nneither of them moves .\nThen both of them force cheerful expressions onto their\nfaces. They rise and each embraces Monty in turn.\n\n                     MONTY\n\n           You been here long?\n\n                     JAKOB\n\n           Oh, we got here early.\n\n                     MONTY\n\n           Uncle Blue's throwing me a party at\n           VelVet. We ought to head over there.\n\n                     JAKOB\n\n           Whose Uncle is he?\n\n                     MONTY\n\n           Huh? Nah, it's a nickname. His real\n           name's like Ankaybusim or something, but\n           no one can pronounce it .\nMonty surveys the sawdust-covered floor, the country rtiusic-\npiay-ing--j-u-keboxy--the-glass jars of bugs_,_.. _.\n\n                                                 _            .\n\n\n                    MONTY (CONT'D)\n\n          What is this place?\n\n                    JAKOB\n\n          Frank wants to be a redneck. He comes\n          here and whistles Dixie while he's\n          peeing.\n\n\n\nJody lines up three shot-glasses of whiskey.\n\n\n\n\n                    JODY\n\n          It's nasty outside. You fellas gotta warm\n          up before you head out .\n\n                    SLATTERY\n\n          Thanks, Jody.\n\n\n\nJody smiles at Monty.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                         63\n\n\n CONTINUED : (3)                                              --~~ ~ .\n\n\n\n\n\n\n\n\n                      JODY\n\n           Y'all ought to come by on Sunday for th e\n           Super Bowl . We're setting up a big\n           screen. I have a second cousin playing\n           for the Packers .\n\n\n\n Slattery rubs the calluses on his palm and Jakob stares at\n the floor. Jody laughs at their morose reaction.\n\n\n\n\n                      JODY (CONT'D)\n\n           You don't have to come! I was just\n           saying.\nMonty raises his glass and Slattery and Jakob grab their\nglasses and raise them too .\n\n                     MONTY\n\n           Fuck Sunday.\nHe drinks. Slattery and Jakob hesitate and then follow suit .\n\n\n\n\nEXT . VELVET -- NIGHT\n\nMonty steps out of a taxi, followed by Slattery and Jakob . A\nroiling MOB occupies half the block, crowding in front of the\nentrance to the dance club .\nMost are teenagers. They clot together in groups of fours and\nfives, smoking cigarettes and stomping their feet to keep\nwarm. Almost none are dressed for the snow.\n\n                    MONTY\n\n          The whole city came out to say goodbye .\n\n                        SLATTERY\n\n         «Jto-u'^ve»jgot a lot of yojxng _f an.s. I- think-                       --\n           we're the oldest ones here.\n\n                    MONTY\n\n          Wait a second.\n\n\n\nMonty slips through the maz e of boys and girls . The kids look\nat him as he walks by .\n\n\n\nMonty makes his way to the velvet ropes . KHARI GREENE , a\npillar of a ma n wearing the exact same camel's hair coat as\nMonty, stands by the door, checking names off a clipboard.\n\n\n\nTwo pale scars run in parallel lines down Khari's left cheek.\n\n\n\n\n                     MONTY (CONT'D)\n\n          Nice coat , you bastard.                                            (   ;\n\n\n\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                     64 .\n\n\n\n\n\nCONTINUED:\n\n\n\n\n\n\n\nKhar i look s u p from hi s clipboar d and smiles . H e offer s hi s\nhand and the y shake .\n\n                       KHARI\n\n             It's the man . The man has arrived.\n             Wearing my coat.\n\n                       MONTY\n\n             I gotta tell you, buddy, it looks better\n             on me .\nKhari skeptically fingers the sleeve of Monty's coat .\n\n                     KHAR     I\n\n           Yeah, well, I      hope you got some seven-\n           year mothballs      for that coat.\nMonty hesitates and then      laughs. Khari puts his arm around\nMonty's shoulders.\n\n                       KHARI (CONT'D)\n\n             You doing all right?\n\n                      MONTY\n\n           Just trying not to think, you know?\n                (gesturing at the crowd)\n           What's with all the kids?\n\n                         KHARI\n\n             The legendary DJ Dusk is spinning wax\n             tonight. My homeboy from Hollis. Boy's\n             seventeen years old. Seventeen! But damn ,\n             he gets the girlies moving. Don't worry\n             about -the -crowds ·? They- -got-.thgL-.YIP setjup\n\n                                  -\n\n             for y'all.\n\n                       MONTY\n\n             I've got my people waiting. You want me\n             to bring them through here?\n\n                     KHARI\n\n           Take ^em to the avenue entrance. I'll get\n           the door opened.\n\n                     MONTY\n\n           Thanks, man .\n\n                      KHARI\n\n           You got it . When you going in?\n\n\n\n\n                     MONTY\n\n           Bus leaves at nine a.m.\n\n\n\n\n \n\n\n\n\n                                                                           65 .\n\n                                      v\n\n CONTINUED : (2)       \"~    \"'   *           ,-,,,·.,,,,,,, =·\n\n\n                                                            ,,-\n\n\n\n\n\n\n\n\n                        KHAR I\n\n             Otisvill e right?\n Monty nods .\n\n                         KHAR I (CONT'D)\n\n             Uncl e go t an y peopl e i n there ?\n\n                        MONT Y\n\n             N o one wort h knowing .\n\n                         KHAR I\n\n             Th e Federals , the y ru n a nic e place . Lo t\n             nice r tha n Sta^e .\n\n                        MONT Y\n\n             I'm a luck y kid.\n\n                           KHAR I\n\n             Luc k o f th e Irish , right ?\n\n                          MONT Y\n\n             Luc k o f th e Irish .\nKhar i grip s Monty ' s shoulder .\n\n                         KHAR I                                                    ^\n\n             Liste n up . Don't los e you r tempe r unti l\n             it' s tim e t o los e you r temper . Yo u hear ?\n\n                        MONT Y\n\n            Al l right . I'll se e yo u aroun d th e way .\nThe y shak e hand s an d Mont y signal s fo r Slatter y an d Jako b t o\nfollo w him . Mont y slide s throug h th e crowd ; Slatter y bull s\nthrough * lik-& a--f-ullback blockin g for--his speedier--teammate .\nJako b walk s wit h a hig h degre e o f self-consciousness ,\nnervousl y dodgin g aroun d th e variou s obstacles . H e passe s on e\nstone d gir l wh o stand s wit h he r hea d back , catchin g\nsnowflake s i n he r mouth .\n\n                       MAR Y\n\n            Hey ! Elinsky ! Mr . Elinsky ! Hey !\nJako b freezes . He r han d catche s hi s sleev e an d h e i s force d\nt o tur n around , force d t o star e int o th e unnaturall y brigh t\neye s o f Mar y D'Annunzio .\nSh e wear s dar k deni m jeans , a fak e raccoo n fu r coat , an d n o\nhat . He r we t blac k hai r snake s acros s he r forehea d an d neck .           ^\nBlac k trail s o f ey e shado w stai n he r cheeks .                              ()\n\n\n\n\n                                                                  (CONTINUED)\n\n\n\n\n\n                           ··\n\n\n                            ·      ·                     --    66\n\n\nCONTINUED :     (3 )\n\n\n\n\n\n\n\n\n                        MARY    (CONT'D )\n\n              Ha! It' s Elinsky!\n\n\n\n\n                        JAKOB\n\n              Oh .\n\n\n\n\n                        MARY\n\n              What are you doing here? God, I didn't\n              know you ever left the school! I thought\n              you had a bed down in the boiler room or\n              something.\n\n                    JAKOB\n\n          Mary D'Annunzio.\n\n                       MARY\n\n          Mary W B+ \" D'Annunzio, that's me.\nShe sees the look on his face and quickly continues.\n\n                    MARY (CONT'D)\n\n          I'm kidding. It's not a big deal.\n\n                    JAKOB\n\n          I've got to go. I'm here with friends.\n\n                    MARY\n\n          The guy who came to class today, right?\n          He knows people, huh? What do you think,\n          could he get us in?\n\n                    JAKOB\n\n          Uh, I don't --\n\n                     MARY~\n\n          They're not letting anyone in right now.\n          They say it's too crowded already.\n               (increasingly hyper)\n          I have to get in there. I have to! You're\n          a fan of Dusk?\n\n                       JAKOB\n\n          Sure.\n\n                   MARY\n\n         He's the absolute truth, right? He is so\n         truth. I can't believe you're into Dusk!\n         No offense, I mean, but I thought you\n         were more into flutes or --\n\n                   JAKOB\n\n         I think Dusk is very good. But I like his\n         earlier stuff better.\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                             67\n\n\n CONTINUED: (4)\n\n\n\n\n\n\n\n\n                      MARY\n\n            His earlier stuff?\n\n                      MONTY (O.S.)\n\n            Jake, what are you doing?\nMonty has circled back and now motions for Jakob to hurry.\n\n                      MONTY (CONT'D)\n\n            I've got someone holding the door for us .\n\n                      MARY\n\n            Hey! You're the guy with the dog.\nMonty recognizes her from the classroom.\n\n                      MONTY\n\n            It's past your bedtime, isn't it?\nMary clutches Jakob's arm and rests her head on his chest.\n\n                       MARY\n\n            I'm with Jake. We're lovers.\nJakob closes his eyes. Monty grins.\n\n  ·                    MONT Y\n\n           Is tha t right? I didn' t realiz e you tw o\n           wer e lovers . Well , com e on , plent y o f\n           roo m inside .\n\n                      MAR Y\n\n           Wait.. . I've got thre e friend s wit h me .\n\n                        MONT Y\n\n           Girls ? .._. ,, _._:\n\n                      .           _...._,,.   .   _\n\n\n                       MAR Y\n\n           No .\n\n                       MONT Y\n\n           Ar e yo u retarded?\nHe turn s and lead s the m around th e corner .\n  i\n\n\n\n\n                     MARY\n\n           Better one than none, I guess.\nJakob disengages himself from Mary. She beams at him. They\nfollow Monty to the side door and disappear inside.\n\n\n\n                                                                  o\n\n\n\n\n                                                                                     68\n\n\n\n\n\n\n\n\n\n\n\nINT. VELVET -- MOMENTS LATER\n\nMonty walks up the back staircase (marked Club Employees\nOnly). Mary follows him. Jakob's in the rear. He still looks\nstunned.\n\n                    MARY\n\n              (to Monty)\n          So how do you know Jake?\n\n                    MONTY\n\n          We went to school together.\n\n                    MARY\n\n          You went to Campbell-Sawyer? You don't\n          seem the type.\n\n                    MONTY\n\n          They didn't think so, either.\n\n                    MARY\n\n          I hate that place. Elinsk -- Jake's okay,\n          but mostly --\n\n                    JAKOB\n\n          Look, Monty, she's seventeen. We can't\n          take her in here.\n\n                    MONTY\n\n          Why not? We're already in.\n\n                    MARY\n\n          I've got ID.\n\n           ·\"-\n\n             '    \" ' MOlfTY\n\n                   \"\"\n\n          What did you say your name was? Mary\n         ^P^AgOjtinO?^;'..:;../:.,ni;.,:,s.r.. .;.:··,·.,:,.;>'.,.; ·:,:-·,;. .. :..;-,' .,\n\n                                                                               . .·\n\n\n\n\n          D'Annunzio.\n\n                    MONTY\n\n          What do you think of Mr . Elinsky?\n\n                    MARY\n\n          He's all right. He acts like a little old\n          man sometimes.\n\n                    JAKOB\n\n          Now listen --\n\n\n\n\n\n\n\n\n\n\n                                                                        (CONTINUED)\n\n\n\n\n\n                                                                                           ·\n\n\n                                                                            69.\n\n\n         CONTINUED :                                          -'\"       '   '        -     \\\n\n\n                                                                                ;\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                  MONT Y                                                  j\\\n                       That's true, he does. I think tonight                             \";\n                       should be a big night for Mr. Elinsky. I\n                       think we should make sure Mr. Elinsky has\n                       fun for once.\n        Monty pushes open the door at the stop of the staircase. The\n        noise rushes in, overwhelmingly loud, the bass vibrating in\n        our bones.\n        Mary opens her mouth and speaks, but we might not be able to\n        hear it over the music.\n\n                                MARY\n\n                   Truth.\n\n        INT. VELVET VIP ROOM -- MOMENTS LATER\n\n        Monty leads Jakob and Mary into the VIP room. Naturelle is\n        already there, speaking with Slattery.\n        The walls of the VIP room are covered with crushed red\n        velvet. The couches are upholstered in red velvet, the small\n        bar in the corner is draped with red velvet, the carpet is\n        red faux velvet.\n----^   DJ Dusk's music pours from speakers bolted into the corners.\ns\n        His beats are impossible to sit still for, incorporating\n        elements of bossa nova, techno, hip hop, and jazz.\n        Slattery has a hard time keeping his eyes off Naturelle. His\n        gaze tends to slide her way, and his desire for her is\n        apparent to everyone.\n        Naturelle smiles when she sees Monty and goes to him. She\n        looks beautiful in-the silver dr.ess_...-_Sh .hugs him. Monty\n                                                    e\n        stands awkwardly in her embrace.\n        When she realizes he's not returning the hug, she quickly\n        releases him. He's watching her carefully. She sees Jakob and\n        smiles at him.\n\n                               NATURELLE\n\n                  Hey, Jake.\n        She hugs Jakob. Mary has not stopped dancing since first\n        hearing Dusk's mix.\n\n                            NATURELLE (CONT'D)\n\n                      (looking at Mary)\n                  Is this your friend?                                              ·- .\n\n[^J           ·           ·                                                           KJ\n\n\n\n\n\n                                                              (CONTINUED)\n\n\n\n\n\n                                  .-·-· · · \" '70-;\n\n\n                                      ···\n\n\n     CONTINUED :\n\n\n\n\n\n\n\no                         JAKOB\n               No . . .\n\n\n\n\n                         MARY\n\n               I'm his lover, Mary.\n\n\n\n     Naturelle arches one eyebrow.\n\n\n\n\n                         NATURELLE\n\n               Okay. I'm Naturelle.\n\n\n\n\n                         MARY\n\n               I've seen pictures of this room. The\n               Smashing Pumpkins were in here.\n\n\n\n    She turns and examines Monty more closely.\n\n                         MARY (CONT'D)\n\n               Who are you? Are. you somebody famous?\n\n                         MONTY\n\n               Do us a favor, D'Annunzio. Don't talk too\n               much .\n    Mary grins, tears off her fake fur coat, and hides it\n    underneath a sofa. She wears a white tank-top with Tweety\n    Bird emblazoned on the front. Tweety Bird looks scared.\n\n\n\n    DAPHNE, a young waitress in a green dress , comes over with a\n    tray of champagne flutes. Naturelle kisses Daphne on the\n    cheek and the two women exchange greetings. Everyone takes a\n    glass.\n\n                         MONTY (CONT'D)\n\n      ·-\"\"    '    (raising his glass~)\n              Champagne for my real friends, real pain\n              for my sham friends.\n    Everyone takes a sip except for Mary, who guzzles hers in one\n    giant gulp, then belches and wipes her mouth with the back of\n    her hand. Jakob stares at her, horrified.\n\n                        MARY\n\n              Anyone want to go dance?\n\n\n\n    Naturelle glances at Monty.\n\n\n\n\n                        MONTY\n\n              Do what you want to do .\n\n\n\n    Jakob and Slattery hear the coldness in Monty's voice and are\n    surprised by it .\n\n\n\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                                     71\n\n\n CONTINUED: (2)                          ~ \"\"\"           , ^TM \n\n\n\n\n\n\n Mary grabs Naturelle's hand and leads her out the door.\n\n                        SLATTERY\n\n                  (to Daphne)\n             You have any whiskey?\n\n                       DAPHNE\n\n             What kind do you want? I'll call down for\n             some.\n\n                      SLATTERY\n\n            Nah, don't bother, I'll get it.\n He nods at Monty and Jakob.\n\n                       SLATTERY (CONT'D)\n\n            Back in a minute.\n Daphne sets a champagne bottle in an ice bucket on the table,\n then retreats to the small bar in the corner of the room.\n Monty sits on the red velvet sofa and Jakob lies down next to\n him, covering his eyes with his arm.\n\n                      JAKOB\n\n            I can't believe you brought my student in\n            here.\n\n                      MONTY\n\n            She's cute, buddy. She talks too much but\n            she's cute.\n\n                           JAKOB\n\n                You're going to get me fired. Do you\n                realize that? She'll tell her friends,\n--'···=-=· --- and they'll -t-e-1-1-the-i-r friends --\n\n          \"                                --\n\n\n                      MONTY\n\n            So what, so you ran into her at a dance\n            club. You haven't done anything wrong,\n            have you? Not yet.\n\n                     JAKOB\n\n           Not yet? What does that mean?\n\n                     MONTY\n\n           You want this girl, don't you?\n\n                     JAKOB\n\n           Shit, Monty, she's seventeen! She's my\n\n\n\n                                                                          o\n           student. I can't touch her.\n\n\n\n\n\n\n\n                                                         {CONTINUED)\n\n\n\n\n\nI\n\n\n     CONTINUED : (3)\n\n\n\n\n\n\n\n\n                            MONT Y\n\n                 I would . She' s go t tha t look . I lik e\n                 littl e girl s wit h tattoos .\n     Jako b groan s an d rub s hi s han d ove r hi s face .\n\n                             MONT Y (CONT'D)\n\n                 It' s goo d seein g you , man . I gues s we'v e\n                 kin d o f gon e ou r separat e ways .\n     Jako b sit s up .\n\n                               JAKO B\n\n                 Yeah .\n\n                             MONT Y\n\n                 It' s to o bad . You'r e smarte r tha n th e\n                 peopl e I kno w thes e days .\n    Mont y pour s mor e champagn e for Jako b an d himself , the n raise s\n    hi s glass .\n\n                            MONT Y (CONT'D)\n\n                Mak e m e a toast .\n    Jako b i s startle d b y th e request .\n\n                              JAKO B\n\n                Yo u wan t m e t o mak e a toast ?\n\n                            MONT Y\n\n                Yeah . Com e on , I won' t b e seein g yo u fo r\n                a while . Sa y somethin g nice .\n    Jako b stare s a t th e tin y bubble s risin g infills glass .\n\n                              JAKO B\n\n                Urn. . .\n\n                            MONT Y\n\n                Al l right . Here' s t o Doyle .\n\n                              JAKO B\n\n                T o Doyle .\n    The y touc h glasse s an d drink .\n\n                            MONT Y\n\n                He' s you r do g now .\n\n                              JAKO B\n\n               What ?\n\n\n\n\n \n\n\n\n\n                                                            73.\n\n\nCONTINUED: (4)\n\n\n\n\n\n\n\n\n                     MONTY\n\n           He needs a home. And he loves you.\n\n                    JAKOB\n\n          Yeah, but... I don't know. You've seen\n          the size of my apartment.\n\n                    MONTY\n\n          Poor Doyle, he'll live in a small\n          apartment. Hey, he's a tough dog. He'll\n          survive.\n\n                    JAKOB\n\n          What about Nat?\n\n                    MONTY\n\n          She's moving in with her mom. Woman hates\n          him. And Doyle hates Frank. And my Dad's\n          allergic.\n\n                    JAKOB\n\n          The thing is --\nMonty takes another sip and then holds the champagne flute up\nto the light.\n\n                    MONTY\n\n          Cristal. They went all out for me , huh?\n          I'm lucky to work for such caring people.\n\n                    JAKOB\n\n          One more glass of this and I'm officially\n          drunk.\n\n                    MONTY\n\n          Listen, this is important to me.. Doyle is\n          important to me . You understand that?\n\n\n\n\n                   JAKOB\n\n         Yeah, of course.\n\n                    MONTY\n\n         Doyle's the toughest guy I know. He was\n         lying there off the highway when I found\n         him, waiting to die. He knew he was going\n         to die. And he didn't make a sound. The\n         best thing I ever did, my whole life, was\n         rescue that black little son-of-a-bitch.\n         Every day he's had since then is because\n         of me . Every time he runs through the\n         park, that's me . Every bone he chews --\n         because of me . I saved him.\n\n                    (MORE)\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n                                  ~           ~                74 .\n\n\n                                                  ·\n\n\n                                                  '\n\n\n CONTINUED : (5)\n\n\n                        MONTY (CONT'D)                                ,|\n\n            And it's different from what you'd\n            expect, right? I saved him but I'm the\n            one that's grateful. Because I see him\n            running around, I hear him barking, and\n            there he is, the best thing I ever did,\n            in the flesh.\n                 (beat)\n           I'm not going to let the pound have him.\n           Doyle's the ugliest fucking dog in the\n           five boroughs. Who's gonna adopt him? And\n           I'm telling you now, I will not let a vet\n           stick a needle in him and end him. I\n           saved his life, right? I'm responsible\n           for him. I didn't go through all that\n           just so some vet can put hi m to sleep. If\n           it comes to that, I'll do it myself. I'll\n           put a bullet in his ear tonight. So I'm\n           asking you, Jake -- for me , as a favor for\n           me , and it's a big favor but I'm asking\n           you -- will you take him? Will you take\n           him home with you?\nJakob is quiet, rubbing his palms over the red velvet sofa\ncushions.\n\n                    JAKOB\n\n          You know what? It would be an honor.\n\n                    MONTY\n\n          I was hoping you'd say that. I really\n          was.\n\n                     JAKOB\n\n          After that speech, Jesus Christ, how\n          could I refuse?\nSlattery returns with a glass of whiskey. He sits next to his\nfriends and sighs.\n\n                    SLATTERY\n\n          There's some talent here tonight.\n\n\n\nMonty raps Slattery's knee.\n\n                    MONTY\n\n          What do you think, Jake's girl's looking\n          pretty good, huh?\n\n                    SLATTERY\n\n          Who, the little one? Who is she?\n\n\n\n\n                    JAKOB\n\n          She's my student. MY STUDENT.\n\n\n\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                               75\n\n\nCONTINUED': (6)\n\n\n\n\n\n\n\nThe lights go off. The room is completely dark.\n\n\n\nWhen the lights come on again, a few seconds later, Monty is\ncrouching in front of the sofa, his .40 caliber automatic in\nhis hand .\n\n\n\nKostya stands just inside the doorway of the room, hands on\nthe light switch.\n\n\n\n\n                     KOSTYA\n\n           The party begins without me ?\n\n                     MONTY\n\n           I should have shot you, you fat Russian\n           fuck.\nKostya ambles over to the sofa, wagging his finger.\n\n                    KOSTYA\n\n          Ukrainian. Fat Ukrainian fuck.\n\n\n\nHe bea r hugs Monty and kisses both his cheeks .\n\n                     KOSTYA (CONT'D)\n\n          Montgomery, my friend! You have been here\n          long? An d you open champagne without me ?\n          Frank, hello Frank!\n\n                    SLATTERY\n\n          Hey, Konstantine. How are you?\n\n                     KOSTYA\n\n          Kostya, please, Kostya. I am good, yes . I\n          will be better when our friend comes back\n          to us .\n               (to Jakob)     --   -\n          Hello! It is Jason, yes?\n\n                     JAKOB\n\n          Jakob.\n\n\n\n\n                    KOSTYA\n\n              (to Monty)\n         The champagne is good?\n              (elbowing Slattery and winking)\n         I have nice girl for you, Monty . Very\n         nice.\n\n                    MONTY\n\n         I'm really not in the mood for that .\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\nLl   ····- -     -·    \"                        ·            -                · 76,\n\n               CONTINUED : (7)\n\n\n\n\n\n\n\n\n                                      KOSTYA\n\n                           Ah , when you see her, you will be in\n                           mood. I pick her out special for you.\n\n\n\n\n                                     MONTY\n\n                           The last girl you picked out special had\n                           three teeth.\n\n                                      KOSTYA\n\n                                (laughing loudly)\n                           Funny you should say that.\n           Everyone waits for the rest. When it becomes obvious that\n           Kostya will not provide the rest --\n\n                                     MONTY\n\n                           Why is it funny I should say that?\n\n                                     KOSTYA\n\n                           It was funny, what you said.\n           Monty looks at Slattery for a second.\n\n                                     MONTY\n\n                           Wait, when you say, \"Funny you should say\n                           that,\" it's like saying, \"That reminds me\n                           of this other funny story.\"\n\n                                       KOSTYA\n\n                           No , no , I am saying what you say was\n                           funny. \"Funny you should say that. \" You\n                           see? It was funny, the thing you said.\n\n\n\n           Nobody speaks for a moment.\n\n                                     KOSTYA (CONT'D)\n\n                           Come, you want to meet her?\n\n                                  MONTY\n\n                        I don't think so. Naturelle's dancing\n                        downstairs.\n\n                                  KOSTYA\n\n                        So we go quick, we go right now. You must\n                        see this girl.\n\n                                  MONTY\n\n                        You have someone nice for my friends?\n\n\n\n\n                                    SLATTERY\n\n\n                       « * . ·_\n\n\n                           _£T _ __\n\n                       Not for me . Thanks.\n\n\n\n\n\n\n\n\n\n\n                                                                      (CONTINUED)\n\n\n\n\n\n                                                                77\n\n\n CONTINUED: (8)                  ~          \"\"\n\n\n\n\n\n\n\n\n                        JAKOB\n\n            Yeah, I'm --\n Monty puts his hand on Slattery's arm.\n\n                      MONTY\n\n            Come down there with me . I need to talk\n            to you.\n\n                       SLATTERY\n\n            That's not my style, Monty. I really --\n\n                       MONTY\n\n            No, that's cool. I just want to ask you\n            something.\n\n                      JAKOB\n\n            Do you want me to stay here?\n\n                      MONTY\n\n            You've got to stay here. Who's gonna look\n            after Mary D'Agostino when she gets back?\n\n                      JAKOB\n\n            Should I tell Nat you're downstairs                          -x\n            having sex with a prostitute?                            \\, ,. J\n\n                        KOSTY A\n\n                 (horrified )\n            No , don' t tel l he r that !\nMont y grin s an d punche s Jakob' s arm .\n\n                     MONT Y\n\n           Tell her whatever you want. But don't\n           take off. We'll go back to my place after\n           the party and get Doyle.\nMonty, Slattery and Kostya leave the room. Jakob sits alone,\nrubbing his arm.\n\nINT. CATWALK -- MOMENTS LATER\n\nThe three men stand on a glass-enclosed catwalk overlooking\nthe dance floor. The place is so crowded and dark that the                     ]\ndancers look like one strange beast, thrashing and swaying to                  j\nthe beat.                                                                      ]\nDJ DUSK, the teen prodigy from Queens, mans his turntables                     I\nfrom a riser above the dance floor. He stands in the eye of a\nspotlight, deftly flipping needles onto spinning records.             /   \\i\n\n\n\n\n\n\n\n                                                      (CONTINUED)\n\n                                                                               ii\n\n\n\n\n               ·-\"\"\n\n\n                  ·   ··   ·   -«--»-- -         . --,,-..- - _\n\n\n                                                 .         .      ,,   78\n\n\n\n\n\n CONTINUED:\n\n\n\n\n\n\n\n The music is loud, even behind the glass, but not loud enough\n to overwhelm conversation.\n\n                      MONTY\n\n                (to Kostya)\n           Where we going, the White Room?\n\n                     KOSTYA\n\n           Yes, White Room.\n\n                     MONTY\n\n           I'll meet you down there. I need to talk\n           with Frank about something.\n Kostya leans closer to Monty and speaks quietly.\n\n                     KOSTYA\n\n           After the girl, Uncle Blue wants word\n           with you. Okay?\nMonty nods. Kostya grins and slaps Monty's shoulder.\n\n                     KOSTYA (CONT'D)\n\n           She is waiting!\nKostya walks down the staircase that leads from the catwalk\nto the dance floor and disappears into the crowd. For a while\nneither Monty nor Slattery speaks.              ·\nThen Slattery looks at Monty and notices his eyes are closed.\n\n                    SLATTERY\n\n          You all right?\nMonty opens his eyes\".           ~         \"'\"\n\n                    MONTY\n\n          They knock out your teeth the first\n          night. You know why? So you can give them\n          head all night long and they don't have\n          to worry about biting.\n\n                    SLATTERY\n\n          Come on. None of that's gonna happen.\n\n                    MONTY\n\n          How the fuck do you know it's not gonna\n          happen?\nTwo broad-shouldered HOODLUMS in expensive suits saunter down\nthe catwalk. They stop to embrace Monty.\n\n\n\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                                 79\n\n\nCONTINUED : (2)       _,\n\n\n\n\n\n\n\n\n                    HOODLUM 1                                                '^\n\n          My ace deuce.                                                      _>\n\n                    MONTY\n\n          Hey, fellas.\n\n\n\n\n                    HOODLUM 2\n\n          Bid's tomorrow, huh?\n\n\n\n\n                      MONTY\n\n          Yeah.\n\n\n\n\n                     HOODLUM 2\n\n          Nothing but a catnap. Be good, brother.\n\n\n\nThe hoods nod at Slattery and walk away. Monty presses his\nforehead against the window.\n\n                     MONTY\n\n          Believe me , Frank, I've studied this.\n          I've looked at the options. Seven years,\n          man . Seven years .\n\n                    SLATTERY\n\n         Thirty-four is still young. You and me ,\n         we'll start something up . A bar , maybe .                        /x\n         Two Irish kids from Brooklyn, how could                          fcr--]\n         we not have a bar? Green beer for St .\n         Paddy's Day, free hot dogs for Monday\n         Night Football. Think about it . Old\n         fashioned jukebox sitting in the corner --\n\n                   MONTY\n\n         I hate green bee r on St . Paddy's Day.\n\n                    SLATTERY\n\n         Yeah : Well, m e t o o . \"        \"\"\"\"\"\"\"*-\"\"\"\"--\"·          -\n\n                   MONTY\n\n         But it's a nice thought, man . I don't see\n         it happening, bu t it's a nice thought.\n\n\n\n\n                   SLATTERY\n\n         Have I ever broken a promise to you? Have\n         I ever once in my life broken a promise\n         to you? Have I ever said I would be\n         somewhere and not shown up?\n\n                    MONTY\n\n        No .\n\n\n\n\n\n\n\n                                                                          C\n\n\n                                                       (CONTINUED)\n\n\n\n\n\n             · ····- ··'·- - -- - \" 80\n\n\n              -\"-                     -\n\n\n      CONTINUED : (3)\n\n\n\n\n\n\n\no                          SLATTERY\n                When you get out, I will be there. You\n                hear me? I will be there.\n\n\n\n     Monty finally turns and looks at Slattery.\n\n                            MONTY\n\n                But you won't be there tomorrow.\n                     (beat)\n                Cute little white boy like me , how long\n                am I gonna last?\n                     (beat)\n                I need a favor from you.\n\n                           SLATTERY\n\n               Anything.\n\n                          MONTY\n\n               Not here . Stick around, okay? We'll go\n               uptown in a couple hours.\n     Monty points to the dancers below. We can see Mar y dancing\n     wildly on a platform.\n\n                         MONTY (CONT'D)\n\n               Our friend Jake has picked himself a\n               winner.\n\n    INT. VELVET VIP ROOM -- LATER\n\n\n\n\n    The room is beginning to crowd with Monty's friends and\n    acquaintances. Jakob sits alone on the sofa, sipping\n    champagne. He clearly recognizes no one .\n    The men speak loudly, holding their- champagne flutes in\n    ringed fists. Lean women stand in clusters, heads bowed\n    together. We hear snippets of banter in four different\n    languages.\n\n\n\n    Jakob dips his head against the sofa's velvet armrest. He's\n    clearly exhausted. He begins slipping into sleep.\n\n\n\n    Mary walks into the room. The men standing nearby turn to\n    look at her, then whisper to each other and laugh. Mary sees\n    Jakob curled up on the sofa and dances over to him.\n\n\n\n    She pulls off his Yankees cap and puts it on her own head,\n    where it sits, crookedly. She climbs on top of him, her knees\n    straddling his chest, and bends close to whisper in his ear.\n\n\n\n\n                        MARY\n\n              Jakey... Jakey...\n\n\n\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                    81\n\n\n      CONTINUED,:\n\n\n\n\n\n\n\n\n\n\nO     She runs her fingernail down his side. Jakob, half-sleeping,\n      smiles and caresses her hand. Then his eyes pop open. He\n      jerks upright and Mary slides off him.\n\n                          JAKOB\n\n                Whoa, what are you doing? What are you\n                doing?\n      Mary, now standing and slightly swaying, laughs.\n\n                          MARY\n\n                Don't panic. Nobody here gives a shit.\n\n                          JAKOB\n\n                I give a shit. Do you know what happens\n                if somebody sees me -- us -- like that?\n      Mary sits on the far side of the sofa, knees primly clasped\n      together, exaggerating the role of good girl.\n\n                           MARY\n\n                Beg your pardon, Mr. Elinsky.\n\n                          JAKOB\n\n                Are you drunk?\n                          MARY              ·                            '·'mm\n                Uh huh. And I had some E before.\n\n                          JAKOB\n\n                Jesus.\n    : He tries to rub the sleep out of his eyes.\n\n                         JAKOB (CONT'D)\n\n               We call it X in this country.\n\n                         MARY\n\n               Naturelle's cool as shit. She knows\n               everyone who works here. I love that\n               name, right? Naturelle? One hundred\n               percent Naturelle! All Naturelle flavors!\n     Jakob cannot help stealing a peek at Mary's chest. Tweety\n     Bird stares back, alarmed.\n\n                         MARY (CONT'D)\n\n               So what's up with her boyfriend? Monty?\n               It's like he owns this place.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                          (CONTINUED)\n\n\n\n\n\n                                       '      ·\n\n\n                                  ''\n\n\n                                  \"\"                        '\n\n\n                                                            ·   82\n\n\n CONTINUED : (2)\n\n\n\n\n\n\n\n\n                     JAKOB\n\n           Listen, Mary, do you think it would be\n           possible to avoid talking about this at\n           school? This whole night?\n\n\n\n\n                     MARY\n\n           You think it would be possible to give me\n           an A for the term?\nJakob's mouth falls open.\n\n\n\n\n                     JAKOB\n\n           Tell me you're joking.\n\n                     MARY\n\n          I'm joking. That's what I love about you,\n          Elinsky.\n\n\n\nJakob says nothing for a moment, but he can't resist.\n\n                     JAKOB\n\n          What?\n\n                    MARY\n\n          Huh?\n\n\n\nMary is watching three women dancing in the middle of the\nroom, their purses flung down on the floor between them.\n\n                    JAKOB\n\n          What's what you love about me ?\nMary turns to look at him again, but it's clear she's not\nreally following the conversation.\n\n                    JAKOB (CONT'D)\n\n          Never mind.\n\n                   MARY\n\n         Hello? Elinsky? Do you think I'm weird?\n\n\n\n\n                   JAKOB\n\n         No. I don't think you're weird.\n\n\n\n\n                   MARY\n\n         You're coming to see Hamlet next week,\n         right?\n\n                   JAKOB\n\n         Of course. You're Ophelia?\n\n\n\n\n                   MARY\n\n         Fuck Ophelia. Laertes.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                               83\n\n\nCONTINUED : (3)\n\n\n\n\n\n\n\n\n                                                                    (·\n\n\n                      JAKOB                          ·\n\n           Laertes?\n\n                    MARY\n\n          You want to see my death scene?\n\n\n\nShe springs up from the sofa and takes three steps back, then\nbegins staggering toward Jakob, hands folded over her gut,\ncovering her invisible sword wound.\n\n\n\n\n                     MARY (CONT'D)\n\n          Exchange forgiveness with me , noble\n          Hamlet: Min e and my father's death come\n          not upon thee , nor thine on me !\nShe collapses onto the red sofa and lies there, quivering for\na moment before going still.\n\n\n\nA group of men smoking cigars in the corner claps loudly.\nJakob stares down at the prone Mary. He cannot hel p noticing\nthe stretch of pale skin between the dark denim of her\nwaistband and the white cotton of her tank top.\n\n\n\nMary sits up and brushes some stray hairs under the Yankees\ncap.              '\n\n                    MARY (CONT'D)\n\n          It's bettex with the fake blood .                          j\n\n                                                                     \\\n\n\n                     JAKOB\n\n          No , it was very good.\n\n                     MARY\n\n          Ms . Taylor says I'm the best dier she's\n          ever haoL^ Did you see Romeo and Juliet\n          last year? I was Mercutio. That was the\n          greatest death of all time.\n\n                   JAKOB\n\n         I was there .\n\n\n\n\n                   MARY\n\n         You know wha t I really want to be ? A\n         stuntwoman. Except I'm afraid of heights .\n         You think they'd hire a stuntwoman who\n         was afraid of heights?\n\n\n\n\n                    JAKOB\n\n         Ar e you allowed to stay out this late? On\n         a school night?\n\n\n\n\n\n\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n CONTINUED : (4)\n\n\n\n\n\n\n\n\n                      MARY\n\n            You think my mother gives a shit? Anyway/\n            did you see all the snow outside? It's a\n            snow day for sure.\n\n                      JAKOB\n\n            I need to go to sleep.\n\n\n\n Mary lies back on the sofa and kicks her feet in the air. She\n begins a bicycling motion, her hands behind her head.\n\n                     MARY\n\n           Can't sleep yet. He's turning it on .\n\n\n\nJakob looks at her slender pale ankles. He covers his eyes .\nMary rolls off the sofa.\n\n                     MARY (CONT'D)\n\n           Is there a bathroom in here?\nJakob points .\n\n                      JAKOB\n\n           Over there, I think.\nMary winks at him and makes her way across the room. En route\nshe grabs a champagne flute off Daphne's platter and chugs\nit. She replaces the glass and slips into the bathroom.\nJakob watches her go. He watches the bathroom door close\nbehind her. He stands, a bit unsteadily. He's been drinking\nall night . He weaves his way to the bathroom door .\nHe waits . Eventually Mary opens the door. She looks up at\nJakob, he r \"eyes as wide as Tweety Bird's .\n\n                    MARY\n\n          You need to pee?\n\n                     JAKOB\n\n          No .\n\n\n\nHe presses forward, backing her up , and closes the door\nbehind him.\n\nINT. VI P BATHROOM -- CONTINUOUS\n\n\n\n\nThe bathroom is blue-walled and lit by a single blue bulb .\n\n\n\n\n                     MARY      ;\n\n          Hi?\n\n\n\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                            85\n\n\n CONTINUED :\n\n\n\n\n\n\n\n He r teeth glow in the blu e light. Jakob grabs he r by the\n shoulder s and kisses her hard on the mouth . His hand s begi n\n t o mov e down from her shoulders --\n --an d then, abruptly, Jakob pulls back . H e stares a t Mary ,\n wh o stares at the floor. She looks stunned, the Yankees cap\n sitting crookedly on her head.\n Jakob stumbles backward. He tries to say something bu t can't\n get the words out .\nHe turns and rams through the bathroom door .\n\nINT . VELVE T VI P ROOM -- CONTINUOUS\n\nHe shoves past cigar smokers and dancing women . He runs from\nthe VI P room.\nThe partiers watch him go and then turn to look at the\nbathroom, a drop of blue in the overwhelming redness of the\nVIP room.\nMar y stands in the blue light, still looking at the floor .\n\nINT. WHITE ROOM -- LATER\n\nThe Whit e Room got its name for obvious reasons . Everythin g\nis white : the shag carpet, the walls , the overstuffed\nfurniture.\nMonty sits on a large whit e bea n bag in a corner of the room.\nHe holds a champagne bottle in one hand, and takes occasional\nsips .\nMARGUERITE, a beautiful prostitute in her early twenties ,\nkneels in front of. Monfcy,.__he_r...bands, .on ...his_Jfchighs... _...\n\n                                                                      ; _\n\nMonty passes her the bottle and she takes a long draught ,\nnever taking her eyes of f him. She hands back th e bottl e and\nunzips his fly, taking he r time wit h everything.\nMonty leans back and closes his eyes . We watch hi m like this\nfor a few seconds, and then we\n\n                                                                  CU T TO :\n\n\nEXT . CARL SCHURZ PARK PLAYGROUND -- AFTERNOON\n\nSpringtime. Monty sits on a park bench. This is several years\nago , and he looks younger, less exhausted.\n\n\n\n\n\n\n\n\n\n\n                                                             (CONTINUED)\n\n\n\n\n\n                                                                 86,\n\n\n CONTINUED :\n\n\n\n\n\n\n\n He is watching two high school girls on the swings. One\n blonde -- LINDSAY JAMISON -- and one brunette -- a younger\n Naturelle .\n Both girls wear the uniform of their private school: white\n blouses embroidered with the school's initials and green\n plaid skirts over black tights.\n Both girls are smoking. But while Lindsay keeps the cigarette\n clenched in one hand as she swings higher, Naturelle\n continues taking reckless drags., the crook of her elbow\n holding the chain lightly as she soars skyward.\n Monty stands and approaches the swings. The girls pretend not\n to notice him.\n\n                      MONTY\n\n           Hey!\nThe girls keep swinging.\n\n                     MONTY (CONT'D)\n\n           Could I bum a smoke?\n\n                      NATURELLE\n\n           What?\n\n                      MONTY\n\n          A smoke.\n\n                    NATURELLE\n\n          This is my last one .\nLindsay brakes with her feet and stares at Monty .\n\n                     LINDSAY\n\n          I've met you before, haven't I?\nMonty nods slowly. It's obvious he doesn't recognize her , but\nhe doesn't want to be rude.\n\n                    MONTY\n\n          Yeah, you look familiar.\nNaturelle has stopped swinging now. Lindsay jumps off he r\nswing.\n\n                      LINDSAY\n\n          I know wh o you are . Come on , Nat , we've\n          got practice.\n\n                    MONTY\n\n          You know wh o I am? Who am I?\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                               87\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n Lindsay picks up her bookbag and strides quickly away,\n looking back once or twice to see if Naturelle is following.\n Naturelle is not following.\n\n                     MONTY (CONT'D)\n\n           So you're Natalie?\n\n                        NATURELLE\n\n           Naturelle.\n\n                     MONTY\n\n           Really? Naturelle. I like that.\n           Naturelle. So what's your friend's\n           problem?\n\n                     NATURELLE\n\n           You're the one that got thrown out of\n           Campbell-Sawyer, right?\n\n                     MONTY\n\n           Yeah, well, lots of people got thrown out\n           of Campbell-Sawyer. How come you didn't\n           follow Blondie to practice?\n\n                     NATURELLE\n\n           I want to finish my cigarette.\nHe smiles and sits on the swing next to her. He tries\nswinging a little.\n\n                     MONTY\n\n           I never really got the hang of these\n           things.\n\n             - ·-- \" \" NATURELLE  -          --       --\n\n           It's all in the legs.\nShe starts swinging again and he watches her, her long black\nhair falling beneath her, her legs straight and then bent,\nstraight and then bent.\n\n                                                        CUT TO:\n\n\n\n\n\nINT. WHITE ROOM\n\nMonty's eyes are still closed. Now he opens them. His hands\nare in Marguerite's hair, but now they drop by his side.\nFinally he taps Marguerite on the shoulders. She backs away\nfrom him, looking up at his face for a moment before blinking\nand licking her lips.\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                88 .\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                        MONTY\n\n              It's my fault. You're very beautiful.\n He hands her the bottle again and she takes a long sip.\n\n\n\n\n                      MARGUERITE\n\n                (Colombian accent)\n           You are very handsome. Are you an actor ?\n\n\n\n Monty zips his fly.\n\n                     MONTY\n\n           Yeah. I'm a star.\n\n\n\n\n INT. CLUB ROOM -- LATER\n\nThe club room is decorated to look like the library of an\nEnglish country manor : dark wood paneling, bookshelves\nstacked with leather-bound books, flickering sconce lights.\nSlattery sits on a stool at the bar, rolling a glass of\nwhiskey between his palms. His eyes are red, from crying or\nexhaustion or both.\n\n\n\nNaturelle walks into the room and spots Slattery. She goes\nover to him and squeezes the back of his neck before sitting\non the neighboring stool. He sits up straight and smiles.\n\n                    NATURELLE\n\n          Why are you all alone?\n\n                     SLATTERY\n\n          I couldn't sit in that goddamn red room\n          anymore. I don't know anyone in there .\n          These are Monty's friends?--\n\n                     NATURELLE\n\n          I guess so . They're around a lot, anywayv\nSlattery drains his whiskey. He signals for another and the\nbartender pours it . He's clearly getting drunk, though\nSlattery is a man who can handle his liquor. He checks his\nwatch.\n\n                    SLATTERY\n\n         I'm supposed to be at work in a couple\n         hours. Christ, I can't even imagine\n         working today. You just gave me the flu,\n         okay? I'm calling in sick.\n\n\n\n\n                   NATURELLE\n\n         I wish Monty could call in sick. Have you\n         seen him around?\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                                 89\n\n\n  CONTINUED:\n\n\n\n\n\n\n\n\n                      SLATTERY\n\n            He's probably saying goodbye to everyone.\n\n                      NATURELLE\n\n            Can you do me a favor?\n\n                      SLATTERY\n\n            What's that?\n Slattery catches himself looking at Naturelle's cleavage and\n looks away.\n\n                     NATURELLE\n\n           Keep an eye on Monty tonight, would you?\n           Try to stick with him.\n\n                     SLATTERY\n\n           What's wrong?\n\n                     NATURELLE\n\n           He's just acting really strange. You\n           don't think he's acting strange?\n\n                     SLATTERY\n\n           He's going to prison in a few hours, Nat.\n           How do you want him to act?\n\n                     NATURELLE\n\n           I want him to act like he's scared.\n\n                     SLATTERY\n\n           He is scared.\n\n                    NATURELLE\n\n          I don't want him to hurt himself. Will\n          you watch him for me?   ..-TO«.,,,,,..«--.\nSlattery nods. For a while they are quiet.\n\n                    NATURELLE (CONT'D)\n\n          I don't think he wants me here.\n\n                    SLATTERY\n\n          That's not true. He's just --\n\n                    NATURELLE\n\n          You see the way he looks at me these\n          days. It's like he doesn't trust me .\n\n                    SLATTERY\n\n          Why wouldn't he trust you?\nNaturelle is quiet for a moment.\n\n\n\n\n                                                       (CONTINUED)\n\n\n\n\n\n                    -     -                               --   -90\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n\n                      NATURELLE\n\n           I'm going uptown. When you see him, tell\n           him I'm waiting for him back home, okay?\n She stands and smooths out the wrinkles in her silver dress .\n Again, Slattery has to turn away from the sight of her .\n\n                      SLATTERY\n\n           This is all so stupid. It's so stupid.\n           He's got so much going on, he's so smart,\n           and what does he do? He throws it al l\n           away. An d here I am, his friend -- I mean ,\n           right? I'm his oldest friend?\n\n                     NATURELLE\n\n           He loves you, Frank. You know that.\n\n                       SLATTERY\n\n           His oldest friend, and what do I do to\n           stop it? Nothing, never a word. When he\n           started selling pot to kids in Campbell -\n           Sawyer, did I say anything? When\n          everyone's talking about buying from\n          Monty, the whole school, and I knew they\n          were going to nail him, knew it, did I\n          say a word? The last ten years I watc h\n          him get deeper and deeper, and these\n          friends of his, these fucks you wouldn't\n          want petting your dog, did I say,\n          \"Careful now, Monty, better get out of\n          this. \" No . Nothing, not a word. His bes t\n          friend. Goddamn, Naturelle, I'm his bes t\n          friend and I just sat there and watched\n          him ruin his life. And you did, too . Both\n          of-us.,., all -of us , we just sat there and\n          let him .\nNaturelle runs a fingernail down her forearm an d inspects the\nfaint white trail .\n\n                     NATURELLE\n\n          Keep an eye on him, okay?\n\n\n\nSlattery watches her walk away. A moment later Jakob hurries\nin, sweating and frantic.\n\n                    JAKOB\n\n         I've been looking all over for you. Can\n         we get out of here?\n\n\n\n\n                   SLATTERY\n\n         We've got to wait for Monty. What's the\n         matter?\n\n\n\n\n                                                     (CONTINUED)\n\n\n\n\n\n                                                               91 .\n\n\n CONTINUED : (3)\n\n\n\n\n\n\n\n\n                     JAKOB\n\n           I kissed her.\n\n\n\n\n                         SLATTERY\n\n           Who?\n\n\n\n\n                      JAKOB\n\n           Mary D'Annunzio. I kissed her .\n\n\n\nSlattery grins .\n\n                        SLATTERY\n\n           Yeah?\n\n                       JAKOB\n\n           I kissed my student. My seventeen year\n           old high school student.\n                (beat)\n           They'll fire me .\n\n                        SLATTERY\n\n          Jake.\n\n                        JAKOB\n\n          Yeah?\nSlattery hands him the glass of whiskey.\n\n                    SLATTERY\n\n          Have a drink.\n\n\n\n\nINT. BASEMENT HALLWAY -- LATER\n\nMonty and Kostya walk slowly down the corridor that leads to\nthe manager's office.\n\n             - -··  KOSTYA\n\n          So? You like her?\n\n                    MONTY\n\n          She's very nice.\n\n\n\n\n                   KOSTYA\n\n         Does she have three teeth? Eh ? No , I\n         think she has many teeth. I think you\n         like her.\n\n                   MONTY\n\n         I said so, didn't I?\n\n\n\n\n                       KOSTYA\n\n\n\n\n                                                                      o\n         Very nice .\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                           ·        '\"              92 ,\n\n\n       CONTINUED:\n\n\n\n\n0·^ They stop outside the office and knock on the steel-plated\n       door. MUSTAFAYEV, a balding man smoking a cigarette, opens\n       the door and closes it behind him. He nods.\n       Monty and Kostya pull out their guns and hand them to him.\n       Checking the safeties, he shoves the guns under his belt and,\n       cigarette clenched between his teeth, carefully pats both men\n       down.\n       When Mustafayev finishes searching them he raps on the door\n       and it opens again. He gestures, and Monty and Kostya enter.\n\n       INT. VELVET MANAGER'S OFFICE -- CONTINUOUS\n\n       Mustafayev follows them inside, hands their guns to one of\n       the ZAKHAROV twins, and goes back outside, closing the door.\n       The twins are Russian redheads who speak very little English.\n       Their faces are blunted and pitiless.\n      Uncle Blue sits behind Volandes' desk, reading the paper.\n      Valghobek sits on a corner of the desk.\n      The twin with the guns places them carefully in front of\n\"     Uncle Blue, then returns to stand by his brother, both of\n      them standing behind Monty and Kostya.\n      DJ Dusk's music can barely be heard down here, the thump of\n      bass and drum sounding like distant bombshells.\n      Uncle Blue folds his paper neatly and sets it aside.\n\n                          UNCLE BLUE\n\n                Montgomery. How is the party?\n\n                          MONTY\n\n                It's all right. Thanks for setting it up.\n\n                           UNCLE BLUE\n\n                The first time I went to prison I was\n                fourteen years old, a skinny little boy.\n                Very afraid. By the time I came out I had\n                my beard. I was a grown man. I went back\n                to my hometown, I found my mother, I\n                kissed her. And she screamed.\n                     (smiling)\n                She did not recognize me . I have been in\n                three different prisons, Montgomery, in\n                three different countries. You know what\n                I learned?\n     Monty shakes his head and waits.\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                  93.\n\n\n     CONTINUED:\n\n\n\n\n\n\n\no                        UNCLE BLUE (COM\" D)\n               I learned that prison is not a good place\n               to be .\n\n                         KOSTYA\n\n                   (laughing)\n               I knew that before I went.\n\n                        VALGHOBEK\n\n              Nobody's talking to you. Keep your mouth\n              shut.\n\n                        UNCLE BLUE\n\n              Seven years is a long time. Some men\n              would do anything to avoid seven years in\n              prison.\n    Monty waits.\n\n                        VALGHOBEK\n\n              Your father's a hardworking man . Where's\n              his bar? In Bay Ridge? 86th Street and\n              6th Avenue, am I right?\n\n                        MONTY\n\n              Yes .\n\n                         VALGHOBEK\n\n              At least he has a short commute. He can\n              practically walk to work. Where does he\n              live, 17th Avenue? And what was the cross-\n              street? 81st? 8002 17th Avenue. Is that\n              right? The first floor. That must be\n              noisy, living on the first floor. But he\n              doesn't walk to work, does he? He drives.\n            -A 1987 Honda. Should-I tell you how many\n              miles he has on the car?\n    Monty stares at the floor.\n\n                        UNCLE BLUE\n\n             Your father, I like your father. A hard-\n             working man. He has had bad luck, some\n             very bad luck. Everyone in the\n             neighborhood loved your mother. You\n             remember her, Senka?\n\n                       VALGHOBEK\n\n             Sure. She was a beautiful woman. A real\n             sweetheart.\n\n\n\n\n                                                                        Q\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                    ·   ·      \"   ·            ·       ·\n\n\n                           \"··- ·\n\n\n                    -·'·                                                    94.\n\n\n                                                       ·\n\n\n                                                       ·            ·\n\n\n                                                                    '\n\n\n      CONTINUED: (2)\n\n\n\n\n\n\n\n\n                              UNCLE BLUE\n\n                   I want to help your father. I could use a\n                   man like that, a hard-working man, a man\n                   I could trust. I could take care of your\n                   father. Do you understand what I mean,\n                   Montgomery?\n\n                          MONTY\n\n                You don't need to do this. I never said a\n                word to anyone. You don't need to bring\n                him into it.\n                                                           i\n\n                          UNCLE BLUE\n\n                I asked you a question, Montgomery.\n\n                          MONTY\n\n                I understand exactly what you mean.\n\n                         UNCLE BLUE\n\n               I have a good job for your father. We'll\n               help him with the money he owes.\n     Uncle Blue turns Monty's gun in his hands. He checks the\n     slide's action. He ejects the magazine, peers at the top\n     cartridge, slaps the magazine back into the pistol's butt,\n\n                         UNCLE BLUE (CONT'D)\n\n               Good weapon. Accurate?\n     Monty nods.\n\n                         UNCLE BLUE (CONT'D)\n\n               Polymer frame, very good, easy to clean.\n               And reliable? No jams?\n     Monty shakes his head. He turns around for a moment. The\n     Zakharov twins are staring at him. Monty turns back. Uncle\n     Blue smiles.\n\n                        UNCLE BLUE (CONT'D)\n\n              Have you ever fired it? At someone, I\n              mean.\n\n                              MONTY\n\n              No.\n\n                          UNCLE BLUE\n\n              No. Good. It is a toy for you. Not toy,\n              prop. A prop for you. Like an actor. Am I\n              wrong? With the gun you feel more...\n\n\n\n\n\n\n\n                                                               (CONTINUED)\n\n\n\n\n\n                                                                 95.\n\n\nCONTINUED: (3)                    \"     \"~\"~\n\n\n\n\n\n\n\nMonty turns again. The Zakharov twins have their automatics\nout. Monty, getting desperate, turns back to Uncle Blue.\n\n                    MONTY\n\n          I never said a word to anyone. They came\n          after me to get to you. I know it, you\n          know it. They don't care about me . But I\n          never said a word.\nUncle Blue makes a gesture and the Zakharovs, frighteningly\nfast, spring forward, slamming Kostya to the floor and\nholding their pistols to his skull.\n\n                     UNCLE BLUE\n\n          I believe you, Montgomery. When you get\n          there, figure out who is who. Find a man\n          nobody is protecting, a man without\n          people. And beat him until his eyes\n          bleed.\nMonty stares at Kostya, who whimpers on the ground, blood\ndripping from his nose.\n\n                     UNCLE BLUE (CONT'D)\n\n          Let them think you are a little bit\n          crazy, but respectful, too, respectful of\n          the right men.\n\n                     KOSTYA\n\n          Monty --\nOne of the Zakharovs kicks Kostya in the ribs.\n\n                     UNCLE BLUE\n\n         You're a good-looking boy,     it won't be\n         easy for--you. But remember,    I was=-           -   ----\n         fourteen when I first went.     And I\n         survived.\n              (beat)\n         We do what we have to do to    survive.\n\n                   KOSTYA\n\n         Monty... please, Monty...\n\n                   UNCLE BLUE\n\n         So now we have this other problem.\n\n                   VALGHOBEK\n\n         How many people knew you kept the stuff\n         inside your sofa cushion? Eh? Your\n         girlfriend, Kostya, who else?                                 ^i\n\n\n\n\n\n\n\n                                                      (CONTINUED)\n\n\n\n\n\n                                                                   96\n\n\n CONTINUED :     (4 )\n\n\n\n\n\n\n\n\n                         MONTY\n\n\n               I--\n\n\n                         UNCLE BLUE\n\n               Kostya dimed you outr little brother. He\n               made a call and stole seven years from\n               your life.\n\n                      VALGHOBEK\n\n            They put the clamps on him, and instead\n            of being a man about it, taking the time\n            himself, he sold you out.\nUncle Blue hands Valghobek Monty's pistol. Valghobek walks\nover to Monty and offers it to him.\n\n                      MONTY\n\n            I don't want it.\n\n                      UNCLE BLUE\n\n            It's yours. You know how to use it?\nValghobek holds the pistol by the barrel, a small smile on\nhis face, until Monty grabs it from him.\n\n                     MONTY\n\n           I know how to use it.\n\n                     UNCLE BLUE\n\n           Good. This man does not deserve to live.\n           He betrayed you, he betrayed me. He stole\n           from you. He stole seven years from you.\n           End him.\n\"One of the ZakTiaTo^^'Ewins!rag'rins at Monty and taps\" \"theback of\nKostya's skull with his pistol's muzzle.\n\n                     ZAKHAROV\n\n           Right here. Boom!\nThe Zakharovs back away and Monty crouches down beside his\nformer friend. Kostya struggles to turn his head, to make eye\ncontact with Monty.                                                     !\n                        KOSTY A                                         j\n          Monty--                                                       |\n                                                                        i\n\n                    MONTY                                               |\n\n          Don't talk.                                                   !\n\n                    KOSTYA                                              |\n\n          No, no, wait, Monty, wait, please listen.\n          I had no choice. I--\n\n                                                                         I\n\n                                                       (CONTINUED )     f\n\n\n\n\n                                                                      97.\n\n\n        CONTINUED: (5)\n\n\n\n\n\n\n\n        Monty flicks off the safety and presses the muzzle against\n        Kostya's skull.\n        Everyone in the room is quiet, watching.\n        The only sound is DJ Dusk's mix, an accelerating industrial\n        heartbeat.\n\n                             VALGHOBEK\n\n                  Do it.\n        Kostya weeps, softly, his big body shuddering.\n        Uncle Blue, face impassive behind his heavy beard, watches\n        carefully.\n\n                            ZAKHAROV\n\n                  He is cockroach. Kill him.\n        Monty's face is very close to Kostya's.\n\n                             MONTY\n\n                       (quietly)\n                  You were my friend.\nf=*5                        KOSTYA\n^                 Monty --\n       Monty closes his eyes.\n       When he opens his eyes, he flicks the safety back on. He\n       stands.\n       He tosses the gun to Uncle Blue, who catches it and frowns.\n\n                       _   MONTY,\n\n                 It doesn't matter to me . Not a goddamn\n                 thing matters to me , except this: if you\n                 hurt my father, I'll kill you both.\n       The Zakharov twins grab Monty and hold him. Monty doesn't\n       struggle; he and Uncle Blue stare at each other.\n       Uncle Blue drums the desktop with his fingers. Everyone\n       waits. A glass of water on the table trembles from the\n       distant bass.\n       Finally Uncle Blue nods at Valghobek, who opens the office\n       door. The twins release Monty. Everyone (except for Kostya,\n       who is face down on the floor) watches him.\n\n\n\n                                                                            o\nV'     Monty walks out of the room, never looking back.\n\n\n\n\n                                                                 98\n\n\n\n\n\n\n\n\n\n\n\n EXT. 14TH STREET -- LATER\n\n Monty trudges down the sidewalk, followed by Slattery and\n Jakob. The snow continues to fall, and lies thickly drifted\n on the crookedly-parked cars, on the parking meters, on the\n spears of the church gate they pass.\n They reach the Union Square subway station and walk down the\n stairs, disappearing from our view.\n\n CLOSE ON FOOTPRINTS IN THE SNOW\n\n We slowly follow their path backward. In the yellow shine of\n the streetlights the footprints fill with snow, until finally\n (the camera still moving backward) they disappear.\n\n INT. UNION SQUARE SUBWAY STATION\n\n Monty, Frank, and Jakob sit with their backs against the\n\"\"'corrugated shutters of a closed newspaper stand.\n An OLD MAN,    wearing   a garbage bag with a hole cut out for his\n head, leans    against   a blue I-beam that helps support the\n ceiling. He    holds a   small radio to his ear; we can hear\n fragments of    Puerto   Rican Jibaro music.\nJakob chews on his fingernails. He cranes his neck to look\ndown the subway tunnel -- still no train in sight. He looks at\nMonty.\n\n                     JAKOB\n\n           What time is it?\nBut Monty is jnot present, he is elsewhere, lost in whatever\nfeveFie occuples\"\"his mind. Slattery's eyes are clo~sed;-he-\nseems to be sleeping.\n\n                          JAKOB {CONT'D)\n\n          Monty?\nMonty looks up, dazed.\n\n                          MONTY\n\n          What?\n\n                    JAKOB\n\n          Do you know what time it is?\nAnother long pause.\n\n                    MONTY\n\n          It's getting late.\n\n\n\n\n\n\n\n                                                       (CONTINUED)\n\n\n\n\n\n                                                              99\n\n\n CONTINUED:                              .   -     - -*.«.-., ,..-,\n\n\n                                                             -.\n\n\n\n\n\n\n\n The lights of the train come around the bend in the tunnel.\n\n INT. 4 TRAIN -- LATER\n\n The three men sit side by side as the train shudders through\n the darkness. Slattery seems to be sleeping again. Jakob\n stares at his reflected face in the far window.\n Monty pulls out his wallet and finds the photograph that his\n father gave him earlier in the night.\n\n INSERT PHOTO\n\n Monty in his fireman's helmet, standing before his parents.\n\n EXT. MONTY'S BUILDING -- NIGHT\n\n Monty, Slattery and Jakob wade through the snow to the stoop\n steps.\n\n INT. MONTY'S BUILDING\n\nThey climb the narrow staircase, their footfalls echoing off\nthe tiled walls.\n\nINT. MONTY'S APARTMENT                                                ,-~^\n\nThey enter the apartment. Doyle is excited to see them; he             -\npants and spins in little circles, sniffing at their boots.\nJakob and Slattery fall onto the sofa and lie there like\ncorpses.\nMonty opens the bedroom door, steps inside, and closes it\nbehind him.\n\nINT- MONTY'S BEDROOM\n\nNaturelle sleeps on her side, facing the window. Monty kneels\nbeside her and takes her hand. Her eyes open. She smiles for\na second and then quickly sits up.\n\n                    NATURELLE\n\n          What time is it?\nBoth of them turn to look at the digital clock on the\nnightstand.\n\n                    MONTY\n\n          I've got an hour left. Listen --\nNaturelle waits as Monty stares down at the bed.                      ^J\n\n\n\n\n\n\n\n                                                   (CONTINUED)\n\n\n\n\n\n                                                                  IOO,\n\n\n   CONTINUED:             ,\n\n\n\n\n\n\n\n\n                          MONTY (CONT'D)\n\n                I was wrong. About you, about --\n   She runs her hand through his hair.\n\n                         NATURELLE\n\n               It doesn't matter right now.\n\n                           MONTY\n\n               It matters to me.\n                    (beat)\n               I don't want you to hate me.\n\n                         NATURELLE\n\n               How could I ever hate you?\n\n                         MONTY\n\n               Jesus, Nat, I blew it. I really blew it.\n  He stands.\n\n                          NATURELLE\n\n               Stay with me, baby. We have another hour.\n\n                         MONTY\n\n               There's one last thing I gotta do.\n  Naturelle doesn't like the sound of this remark. She leans\n  forward and takes his wrist.\n\n                       NATURELLE\n\n             Hey. Don't go anywhere. Stay here with\n             me.\n\n- -·······\n\n\n         -        - ·--MONTY-     ··     '    ~     -·    ··       -\n\n             Just one last thing.\n He kisses her again, a last fierce kiss, and heads for the\n door.\n\n INT. MONTY'S LIVING ROOM\n\n Monty grabs the leash off the back of the apartment door and\n clips it to Doyle's collar.\n\n                       MONTY\n\n             Let me take one more walk with Doyle.\n Slattery and Jakob nod. Both are exhausted.\n\nEXT. EAST END AVENUE ~ LATER\n\nThe snow has finally stopped falling.\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                               101\n\n\n CONTINUED:\n\n\n\n\n\n\n\n The parked cars lining the avenue look like scoops of vanilla\n ice cream, glistening below the streetlights. The awnings of\n the buildings, fringed with icicles, creak beneath the weight\n of the snow.\n Doyle, off his leash, charges down the middle of the avenue,\n carving a trail through the foot-deep powder, a drop of ink\n rolling down a blank page.\nMonty follows behind, twirling circles with the leash.\nSlattery and Jakob bring up the rear, slogging through the\nsnow like weary soldiers.\nThe only vehicle on the road is a snow plow half a mile\nsouth, its yellow lights flashing.\n\nEXT. CARL SCHURZ PARK\n\nThey cross into the park, past the fenced-in gingko trees,\nclimbing the stairs that lead to the esplanade.\nDoyle spies a squirrel and chases after it, but the squirrel\nis quicker, makes it to a red maple and scrambles up the\ntrunk to safety.\nDoyle squats at the foot of the tree, staring sadly up                 ^\\\nthrough the branches.                                                11W7\n\nEXT. EAST RIVER ESPLANADE\n\nAcross the river is Queens, and Queens before sunrise is\nbeautiful: red antennae lights winking to warn pilots; the\nPepsi sign glowing in neon script over the bottling plant;\nwhite clouds rising from the smokestacks like genies.\nBehind Queens the sky is beginning to brighten.       -   --\nJakob brushes snow off the iron balustrade, leans against it\nand stares into the river. A string of yellow lights quivers\nbeneath the waters, reflections from the Queensboro Bridge.\nA red tugboat chugs south.\n\n                    MONTY\n\n          It would be good to work a tugboat. Be\n          out on the river all day.\nHe turns to face Jakob.\n\n                    MONTY (CONT'D)\n\n          So what do you think? You ready for Mr.\n          Doyle?\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                           ;\n\n\n                   ·           ·'· ·   · ' --   ··\n\n\n                                 -                                102,\n\n\n                                         ··\n\n\n     CONTINUED:\n\n\n\n\n\n\n\n     Jakob looks at Doyle, who is rolling on his back in the snow,\n     kicking his feet in the air like a puppy.\n\n                         JAKOB\n\n               He likes the snow.\n     Monty whistles for Doyle and the dog jumps to his feet and\n     runs over, wagging the stump of his tail, his muzzle dusted\n     with snow.\n\n                         MONTY\n\n               I need a favor, Frank.\n\n                           SLATTERY\n\n               Anything.\n    Monty refastens the leash onto the dog's collar and ties the\n    cord around a baluster, knotting it twice, checking to make\n    sure it's secure.\n\n                          MONTY\n\n               I'm not going in there like this. The\n               minute they get a look at me, I'm gone.\n    Monty straightens up and looks directly into Slattery's eyes.\n\n-\n\n\n                        MONTY (CONT'D)\n\n              Make me ugly.\n    Slattery looks dumbfounded. He turns to glance at Jakob, who\n    is equally confused.\n    Monty clears the snow off the nearest bench, unbuttons his\n    camel's hair coat, and lays it down.\n\n                        MONTY (CONT'D)\n\n              You just said you'd do anything. So this\n              is what I need.\n\n                         SLATTERY\n\n              I can't do that. What are you thinking, I\n              give you a black eye and people won't\n              fuck with you? It won't change anything.\n    Monty steps closer.\n\n                        MONTY\n\n              You think I deserve it, don't you?\n    Slattery holds his hands up and backs away.\n\n                        SLATTERY\n\n              I can't hit you.\n\n\n\n\n                                                         (CONTINUED)\n\n\n\n\n\n                                                                      103,\n\n\n          CONTINUED : (2)\n\n\n\n\n\n\n\n\n                              MONTY\n\n                    I think you can. I think you want to, a\n                    little bit. I think you've wanted to for\n                    years.\n\n                               SLATTERY\n\n                    I'm not doing it.\n         Monty steps closer again.\n\n                              MONTY\n\n                    You want to. Come on, Frank, you're\n                    afraid?\n\n                                 SLATTERY\n\n                    Listen --\n\n                              MONTY\n\n                   What are you afraid of, Frank? That I'll\n                   hit back? You're afraid I'll hit back?\n                   That would be embarrassing, huh, big\n                   tough guy like you getting his ass\n                   kicked?\n\n                               JAKOB\n\n                   Come on, this is crazy.\n                         on, t\ni.JSh             Come\n        Monty points at Jakob.\n\n                             MONTY\n\n                   Who the fuck is talking to you?\n\n                             SLATTERY\n\n                   Forget it. Come on, forget all this.\n                   Let's get some breakfast.\n\n                            MONTY\n\n                  This works out pretty well for you,\n                  doesn't it? You're gonna take good care\n                  of Naturelle while I'm gone?\n\n                                SLATTERY\n\n                  What?\n\n                             MONTY\n\n                  You think I don't see you staring at her\n                  all the time? You've wanted to fuck her\n                  for years.\n        He shoves Slattery hard. Slattery's eyes narrow for a moment,\n        but he shakes his head.\n\n\n\n\n\n\n\n                                                             (CONTINUED)\n\n\n\n\n\n                     -·--                                       104\n\n\n CONTINUED : (3)\n\n\n\n\n\n\n\n\n                     SLATTERY\n\n           All right. Al l right.\n\n\n\n He turns stiffly and walks away.\n\n\n\n\n '                    JAKOB\n\n           Come on. Come on , Monty, what are you\n           doing? Tell him you're kidding.\n Monty pivots and punches Jakob hard on the cheek, the crack\n of gloved knuckle on bone echoing on the empty esplanade.\n Jakob falls back against the balustrade, clutching his face.\n\n                     JAKOB (CONT'D)\n\n           Monty I\n\n\n\nMonty steps closer and punches Jakob again, this time in the\ngut, and Jakob sinks to his knees, gasping. He covers his\nface with his hands, to protect himself.\nSlattery tackles Monty, pinning him to the ground.\nFor a moment everything is still. Doyle, leashed to the\nbaluster, whines, unsure if his master is playing or\nfighting.\nJakob, stunned by the violence, watches. Slattery stares at\nMonty and Monty stares back . All :of them in the snow, their\nbreath coiling and rising into the sky.\nFinally Slattery looks away, looks past the East River , past\nQueens. He clenches his eyes shut. When he opens them, we see\nthe first tears forming.\nSlattery grabs Monty's throat with his left hand and punches\nhim in the face with his right, again and again and again.\nDoyle howls. He tries to jump on Slattery bu t the leash keeps\nyanking him back. He strains forward, fangs bared , bu t his\nmaster is three feet too far.\n\n\n\nJakob touches his cheek and examines his fingers: no blood.\n\n\n\nDoyle, barking madly, keeps jumping for Slattery, keeps being\nyanked back by the leash.\n\n\n\nJakob grabs hold of the balustrade and pulls himsel f to his\nfeet.\n\n                    JAKOB (CONT'D)\n\n          Frank... Frank!\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                               105,\n\n\n CONTINUED : (4)\n\n\n\n\n\n\n\n The bloo d puddles by Monty's head, melting through the snow\n and steaming in the air. Slattery, lost in hi s anger , his\n frustration, continues swinging.\n\n\n\n Jakob stumbles over to Slattery and pushes him.\n\n\n\n\n                        JAKOB (CONT'D)\n\n            Stop!\n\n\n\n Slattery looks up , his face wet with tears , a webbin g of\n saliva between his lips .\n\n                      JAKOB (CONT'D)\n\n            Okay. Enough.\n\n\n\n Jakob grabs the bi g man under the armpits and help s hi m rise .\n Slattery looks down at Monty, who is not moving .\n\n                        SLATTERY\n\n           Oh Jesus .\nJakob crouches and turns Monty onto his stomach . Monty\ncoughs, a thick ribbon of blood falling from hi s mouth .\nJakob scoops up a handful of snow and begins gentl y pressing\nit to Monty's brutalized face.\nDoyle continues to bark, the collar digging into his throat\nas he struggles to reach his master.\nSlattery watches , speechless, his bloodied hand s by his side.\nFinally Monty shakes his head clear of the snow and begins\ncrawling forward.\n\n\n\n\n\n\n           Hold still for a minute. Hold still .\nWhen Monty tries to stand his legs collapse beneat h him.\nJakob wraps his arms around him before he falls an d lowers\nhim to the snow.\n\n\n\n\n                    JAKOB (CONT'D)\n\n          Don't try to move yet.\n\n\n\nMonty pushes himsel f off the ground again and thi s time\nmanages to keep hi s balance, though he sways lik e a drunk.\n\n\n\n\n                      MONTY\n\n               (slurring)\n          It's okay .\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n                                                              106,\n\n\n CONTINUED : <5)\n\n\n\n\n\n\n\n Blood leaks from his nose, from his mouth, from a deep gash\n bisecting one eyebrow. The entire left side of his face is\n bright red, already swelling.\n\n\n\n Slattery looks at him and moans , sits down heavily in the\n snow, his chin tucked against his chest, his right hand,\n slick with blood, covering his face.\n\n\n\n\n                        SLATTERY\n\n           Oh Jesus.\n\n\n\n\n                      JAKOB\n\n           Hospital.. We need to take you to the\n           hospital.\n\n                       MONTY\n\n           No .\nHe staggers toward them. Doyle is mewling now, stomping his\npaws, confused. Monty bends down unsteadily and scratches\nbehind the dog's ear.\n\n                     MONTY (CONT'D)\n\n               (to Doyle)\n           Be a good boy.\nHe walks over to Slattery, wh o sits in the snow, sobbing.\nMonty leans over and kisses his forehead.\n\n\n\n\n                       MONTY (CONT'D)\n\n          I'm sorry.\nSlattery rocks back and forth, hands over his face, his\nforehead marked with blood.\nMonty turns to Jakob and touches his shoulder.\n\n                    MONTY (CONT'D)\n\n          I'm sorry, Jake.\n\n\n\nJakob is stunned by what's happened in the last few minutes .\nHe has no idea what to say.\n\n\n\n\n                       JAKOB\n\n          Okay.\n\n\n\n\n                    MONTY\n\n          Take care of my dog.\n\n\n\nHe grabs his coat from the park bench and walks away from\nthem.\n\n\n\n\n                                                             107\n\n\n\n\n\n\n\n\n\n\n\n EXT. MONTY' S BUILDING -- DAWN                                     (\n\n Naturelle, in her down parka, sits on the stoop steps. She\n sees him when he's a block away, and we see him from that\n distance, limping through the snow.\n Naturelle stands and breathes in deeply. She starts walking\n toward him but stops after a few steps. She can see his face\n now.\nHis eyes are so badly swollen that he doesn't notice her\nuntil he's almost upon her. When he does see her he smiles,\nand Naturelle has to look away for a moment.\nHe tries to say something but chokes, leans over, hands on\nhis knees, and spits up blood.\nNaturelle takes him by the hand and leads him up the steps.\n\nINT. MONTY'S LIVING ROOM\n\nHe sits on the sofa while Naturelle dabs at his face with a\nwet washcloth. A bowl of soapy water sits beside her on the\ncoffee table.\nWhen she wrings the washcloth above the bowl, drops of blood       ,\"***S\n\n                                                                    /   >\n\nfall into the water and bloom.                                      W-- /\n\n                    MONTY\n\n          I don't want you to visit.\nHis voice is rough and slurred, his split lip impeding his\ndiction.\nShe opens a bottle of rubbing alcohol, wets a cotton ball,\npresses the cottpn lightly against the gash in his forehead.       --\nHe shudders, his fingers gripping the edges of the sofa\ncushions.\n\n                    MONTY (CONT'D)\n\n          I don't want you to see me up there.\nNaturelle struggles mightily to keep herself together. She\ncontinues cleaning his wounds.\n\n                     MONTY (CONT'D)\n\n         Why'd you stay with me?\n              (beat)\n         You should have left a long time ago.\n\n\n\n\n\n\n\n\n\n\n                                                  (CONTINUED)\n\n\n\n\n\n                                                              108.\n\n\n CONTINUED:\n\n\n\n\n\n\n\n\n                       NATURELLE\n\n                 (shaking her head)\n            You idiot.\n A knock on the door. Naturelle goes to answer it. We hear\n voices that sound very distant. Monty peers through his\n swollen eyelids at the man walking toward him.\n\n                                                          CUT TO:\n\n\n MONTY'S POV\n\n The blurred figure of a man stands before him. The room is\n sunlight and shadows, all edges washed away;\n The man's face is a pale oval that bends and splits when he\n speaks.\n\n                     MR. BROGAN\n\n           Who did this to you?\n\n                                                          CUT TO:\n\nMonty sitting on the sofa, staring up at his father.\n\n                     MR. BROGAN (CONT'D)\n\n           Who did this to you, Monty?\n\n                    MONTY\n\n          What time is it?\n\n                     MR. BROGAN\n\n          I'm bringing you to the hospital. We can\n          tell--\n\n                    MONTY\n\n          No. I need to go.\nHe pushes himself upright. Naturelle comes in from the\nkitchen and hands him a glass of water. He takes it and\ndrinks.\n\n                     NATURELLE\n\n          You have to go to the hospital, baby.\n\n                    MONTY\n\n          No.\nMonty goes to his bedroom.\n\n\n\n\n        INT. MONTY'S BEDROOM -- CONTINUOUS\n\n\\v_y    He pulls an already packed suitcase from beneath the bed. He\n  ~\"    grabs the string of silver rosary beads from the bedside\n        table.\n        He stares at the unmade bed for a few seconds before leaving.\n\n        INT. MONTY'S LIVING ROOM -- CONTINUOUS\n\n        He sets his suitcase by the front door.\n\n                            MONTY\n\n                  I'll say goodbye here.\n        He approaches his father but Mr. Brogan shakes his head.\n\n                             MR. BROGAN\n\n                  How you planning on getting to the Port\n                  Authority?\n\n                            MONTY\n\n                  Subway.\n\n                              MR. BROGAN\n\n                  You won't make it. Trains are barely\n                  running right now. I'll drive you to\n                  Otisville.\n                       (beat)\n                  Jesus, look what they did to you.\n\n                            MONTY\n\n                  I'll take a taxi.\n\n                           NATURELLE\n\n                 You won't be able to get one. Let him\n                 take you to the hospital.\n\n                           MR. BROGAN\n\n                 You don't trust my driving? I got chains\n                 on the tires and everything.\n\n                           MONTY\n\n                 I don't want it like this. Let me walk\n                 away, Dad. It's easier that way.\n\n                           MR. BROGAN\n\n                 What's easy about it? Easier? My God, you\n                 don't understand, do you? You don't have\n                 any idea.\n       He touches Monty's shoulder.\n\n\n\n\n\n\n\n                                                            (CONTINUED)\n\n\n\n\n\n                                                             110,\n\n\n CONTINUED :\n\n\n\n\n\n\n\n\n                      MR. BROGAN (CONT'D)\n\n            Let me drive you there. I need to see\n            where it is anyway, for visits. Okay,\n            buddy? Help me out .\n\n\n\nMonty blinks and then nods .\n\n\n\n\n                      MONTY\n\n            No hospitals.\n\n\n\nMr . Brogan kisses Naturelle on the cheek and she embraces the\nolder man . When she lets go he walks to the front door, pick s\nup the suitcase, and leaves the apartment.\nMonty stands still, looking at Naturelle.\n\n                     NATURELLE\n\n           Wait a second.\nShe goes to the kitchen and Monty rocks back and forth on his\nbootheels. When she returns she holds a plastic ba g filled\nwith ice cubes.\nShe makes him hold the bag against the side of his face. They\ndon't move for a moment, her hand on top of his hand, the ba g\nof ice pressed to his jaw.\n\n                     MONTY\n\n           I want you to be happy.\n\n\n\nShe nods but says nothing, biting her lip, tears beginning to\nroll down her face.\n\n                    MONTY (CONT'D)\n\n          Will you d© that for me ?\n\n\n\nShe nods again.\n\n                      MONTY (CONT'D)\n\n          Okay?\n\n\n\nShe grabs him and holds him very hard, clutching him, sobbing\ninto his neck.\n\n                    MONTY (CONT'D)\n\n          I'm sorry for everything.\n\n\n\n\n                     NATURELLE\n\n          No . . .\n\n\n\n\n                     MONTY\n\n          Fo r everything .\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n    CONTINUED: (2)\n\n\n\n\n\n\n\n    He kisses her again and releases her, walks out the apartment\n    door and closes it behind him.\n\n    INT. HALLWAY\n\n    Monty unknots the plastic bag and dumps the ice down the\n    stairwell. The cubes glitter and disappear before clattering\n    on the linoleum three floors below.\n\n    EXT. MONTY'S BUILDING\n\n    Mr. Brogan's car is double-parked. The roof of the old Honda\n    is crowned with snow but the windshield and rear window have\n    been swept clean.\n\n    INT. MR. BROGAN'S HONDA\n\n    Mr. Brogan opens the passenger door and Monty eases carefully\n    into the seat, then leans over to unlock the driver's door.\nAfter Mr. Brogan starts the engine, they wait for a moment\nfor the windows to defrost.\n\n                        MR. BROGAN\n\n              FDR is closed. I figured we'd go up\n              First, take the Triborough, catch 87 up\n              to Route 17, and then 211 takes us right\n              into Otisville. Easy drive, except for\n              the snow.\nMonty says nothing, and Mr. Brogan studies his savaged face.\n\n                          MR. BROGAN (CONT'D)\n\n              Jesus, look what they did to you. I'll\n              tell you what, Monty, you're gonna be\n              okay. It looks bad now, I know it, but\n              when all the swelling goes down it's\n-          · - gonna be okayr     ~ ~\"    ··-·-· ······-·\n\n                                                -       --   .   -·--··\n\n                   (beat)\n             They sure gave you a licking, though. How\n             many were there?\n\n                       MONTY\n\n             I don't know, Dad. A bunch of them.\n\n                       MR. BROGAN\n\n             Well, give it a month and you'll be\n             better looking than ever.\nA fire truck rolls slowly past, chains on its massive tires.\nMonty and his father sit in silence, letting the engine warm.\n\n\n\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                                  112.\n\n\n  CONTINUED:\n\n\n\n\n\n\n\n\n                        MONTY\n\n             You were right, Dad. It wasn't Naturelle.\n Mr. Brogan shifts into drive.\n\n                      MR. BROGAN\n\n            Of course it wasn't Naturelle.\n\n EXT. EAST RIVER ESPLANADE -- DAWN\n\n Slattery sits on a park bench overlooking the river. It's the\n same bench Monty sat on the day before. Slattery is alone on\n the snow-covered esplanade.\n His knuckles are covered with dried blood. His forehead is\n marked with blood.\n He watches the sun rise over Queens.\n\n EXT. EAST END AVENUE -- DAWN\n\n Jakob and Doyle walk south along the western edge of Carl\n Schurz Park. A SKIER, an attractive young woman in her mid-\n twenties, schusses toward them on cross-country skis.\n She smiles at Jakob as she passes.\n\n                       SKIER\n\n           Cool dog.\n\n                       JAKOB\n\n           Thanks.\nHe turns and watches her glide down the hill toward 86th\nStreet. He looks down: at Doyle. Doyle looks-iap- at ~hifff. TM   -\n\n                       JAKOB (CONT'D)\n\n           Cool dog.\nJakob shakes his head and smiles, and they continue walking\nsouth.\n\nINT. MR. BROGAN'S HONDA -- MORNING\n\nThey drive up First Avenue. Monty looks out the window and\nwatches the city roll by. It's his last look for a long time,\nand he wants to remember everything.\nA WOMAN wearing a man's overcoat sprinkles salt in front of a\nshuttered butcher shop. Two YOUNG BOYS drag their sleds\nbehind them, huffing and puffing with exaggerated fatigue.\n\n\n\n\n\n\n\n\n\n\n                                                        (CONTINUED)\n\n\n\n\n\n                                                                113.\n\n\n CONTINUED:\n\n\n\n\n\n\n\n A NEWSPAPER VENDOR sits on a blue milk crate, sipping coffee\n from a paper cup, while his CURLY-HAIRED SON snaps icicles\n from the kiosk's eaves.\n A POLICE OFFICER, hands on his hips, stares under the opened\n hood of his cruiser, while his PARTNER leans against the\n driver's-side door and laughs into his walkie-talkie.\nAt a red light, Monty looks up at the city bus idling noisily\nalongside them. A LITTLE BOY in the backseat waves. Monty\nwaves back.\nThe boy points at his window: letters have been finger-drawn\non the frosted glass. T-O-M.\nMonty smiles as well as he can and draws his own name on his\nown frosted window: M-O-N-\nBefore he can cross the T the bus pulls away.\nThey drive north.\n\n                    MONTY\n\n          I always thought I'd make you proud of\n          me .\nM r . Brogan turns to look at Monty and then turns back to the\nroad.\n\n                      MONTY (CONT'D)\n\n           I pictured it, you know? I pictured you\n           sitting at the bar with all your friends,\n           poker night, and you'd say, \"Did I tell\n           you what my boy's been up to?\" And your\n           friends would be like, \"Goddamnit,\n         _ Brogan,,_all you ever talk about-is your     ,,...      _, __,, _\n           boy.\"\n\n                    MR. BROGAN\n\n          Give me the word and I'll take a left\n          turn.\n\n                    MONTY\n\n          Left turn to where?\n\n                    MR. BROGAN .\n\n          Wherever you want. Take the GW Bridge and\n          go west.\nMonty stares at his father.\n\n\n\n                                                                         o\n\n                                                   (CONTINUED)\n\n\n\n\n\n CONTINUED: (2)\n\n\n\n\n\n\n\n\n                     MR. BROGAN (CONT'D)\n\n           Get you stitched up somewhere and keep\n           going. Find a nice little town --\n\n                     MONTY\n\n           Dad.\n\n                      MR. BROGAN\n\n           I'm saying if you want. If that's what\n           you want, I'll do it.\nMonty closes his eyes. We hear the tire chains rattling on\nthe snow. We hear the old engine wheezing.\nCLOSE on Monty's ravaged face, on his eyelids.\nMr. Brogan keeps talking and New York City melts away.\n\n                     MR. BROGAN (COM\" D)\n\n           We'll drive and keep driving.\n\n                                                         CUT TO:\n\n\nEXT. INTERSTATE HIGHWAY -- DAY\n\nAs Mr. Brogan speaks, we watch the car driving west. The\nvoice-over tracks with the images on the screen.\n\n                    MR. BROGAN (V.O.)\n\n          Head out to the middle of nowhere.\n\n                                                         CUT TO:\n\n\nEXT. DESERT HIGHWAY -- DAY\n\nThe car speeds along a desert highway now, past the pitchfork\ncacti and towering mesas.\n\n                                                        CUT TO:\n\n\nEXT. MAIN STREET -- DAY\n\nThe car drives slowly down the main street of a one stoplight\ntown.\n\n                    MR. BROGAN (V.O.)\n\n          Find a nice little town.\n\n                                                        CUT TO:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                              115\n\n\n CONTINUED:\n\n\n\n\n\n\n\n Mr. Brogan parks in front of a small bar with an old-\n fashioned BAR sign in front. Mr. Brogan and Monty (his face\n unmarred) step out of the car.\n\n                                                        CUT TO:\n\n\n INT. TOWN BAR -- DAY\n\n Mr. Brogan and Monty are sitting at a corner table. Mr .\n Brogan raises his glass of whiskey to Monty and both men\n drink.\n\n                     MR. BROGAN (V.O.)\n\n           Find a bar, and I'll buy us drinks. I\n           haven't had a drink in nineteen years,\n           but I'll have one with you. And then I'll\n           leave.\n\n                                                        CUT TO:\n\nMonty stands at the window of the bar, watching Mr. Brogan\ndrive away.\n\n                    MR. BROGAN (V.O.) (CONT'D)\n\n          I'll tell you don't ever write me, don't\n          ever come visit. I'll tell you I believe\n          in God's Kingdom and I believe I'll be\n          with you again, and your mother. But not\n          in this lifetime.\nMonty approaches the BARTENDER, a powerfully-built older man\n(60). Monty speaks and the bartender listens carefully, but\nwe don't hear the dialogue.\n\n                     MR. BROGAN (V.O.) (CONT'D)\n\n          You get a job somewhere, a job that pays\n          cash, a boss who doesn't ask questions,\n          and you make a new life, and you never\n          come back.\n\n                                                       CUT TO:\n\n\nINT. TOWN BAR -- NIGHT\n\nMonty works behind the bar on a crowded night. The bar\nPATRONS, a blue-collar rural crowd, are rowdy drinkers, but\nMonty works efficiently, quickly filling their orders.\n\n                                                       CUT TO:\n\n\n\n\n\n                                                              116,\n\n\n\n\n\n\n\n\n\n\n\n  INT. HEAD SHOP -- NIGHT\n\n Monty, in the backroom of a seedy head shop, sits for a\n photograph in front of a black drop.\n\n                      MR. BROGAN (V.O.)\n\n            You find the right people and you get\n            yourself papers, a driver's license.\n\n EXT. TOWN BAR -- DAY\n\n Monty sits on the steps in back of the bar, looking out past\n the gravel lot toward the distant mountains.\n\n                      MR. BROGAN (V.O.)\n\n           And then you wait. People get caught when\n           they come home. But you're never coming\n           home.\n\n EXT. BUS STATION -- DAY\n\n Monty, a few years older, waits as a Greyhound bus pulls into\n the station.\n\n                     MR. BROGAN (V.O.)\n\n           And maybe -- and this is dangerous-- but\n           maybe after a couple years you send word\n           to Naturelle.\nNaturelle steps off the Greyhound bus. She sees Monty. They\nstare at each other, twenty feet apart.\nFinally he goes to her, threading through the other\ntravellers, the other waiting families. He takes her in his\narms.\n\nINT. APARTMENT -- NIGHT\n\nIn the cramped apartment above the bar where Monty works,\nMonty and Naturelle sit together, on a sofa, watching a small\ntelevision. Naturelle is pregnant.\nThe ball is about to drop in Times Square.\n\n                    MR. BROGAN (V.O.)\n\n          You forget about New York. You can't come\n          back. You can't call, you can't write.\n\nINT. SMALL HOUSE -- NIGHT\n\nMonty, much older now, stands in front of his family, his\ngrown CHILDREN and the little GRANDCHILDREN. Naturelle,\nequally aged, sits with one of the little girls on her lap.\n\n\n\n\n                                                    (CONTINUED)\n\n\n\n\n\n                                                            117\n\n\nCONTINUED:\n\n\n\n\n\n\n\n\n                     MR. BROGAN (V.O.)\n\n          And maybe one day, years from now, long\n          after I'm dead and gone, you gather your\n          whole family together and you tell them\n          the truth. Who you are and where you came\n          from.\nAs Monty speaks his children exchange glances. They can't\nreally believe what they're hearing, but they know their\nfather is telling the truth.\n\n                    MR. BROGAN (V.O.) (CONT'D)\n\n          You tell them the whole thing. And then\n          you ask them if they know how lucky they\n          are to be there.\nMonty looks at his family. He is awed by their existence, by\nthe life he has created. He looks at Naturelle, still\nbeautiful in old age, and she smiles back at him.\n\n                    OLD MONTY\n\n          It all came so close to never happening.\n\nINT. MR. BROGAN'S HONDA -- MORNING\n\nThe sun shines through the windshield. Monty sleeps, his\nbattered head resting against the window below his frost-\nspelt name: M-O-N-T-Y.\n\n                     OLD MONTY (V.O.)\n\n          This life came so close to never\n          happening.\n\n\n\n\n\n\n\n\n\n25th Hour\nWriters :   David Benioff\nGenres :   Crime  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:18:12.676084"}