{"title": "A Most Violent Year", "film_link": "/Movie Scripts/A Most Violent Year Script.html", "script_link": "/scripts/A-Most-Violent-Year.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>A Most Violent Year Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/A-Most-Violent-Year.jpg\" title=\"A Most Violent Year Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=J.C. Chandor\" title=\"Scripts by J.C. Chandor\">J.C. Chandor</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Movie Release Date</b> : January 2015<br/>\n<b>Submitted by</b>: XXyTurtle<br/>\n<br/>\n<a href=\"/scripts/A-Most-Violent-Year.html\">Read \"A Most Violent Year\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n\r\n<b>                                 A MOST VIOLENT YEAR\r\n</b>\r\n\r\n\r\n\r\n                                      Written by\r\n\r\n                                     J.C. Chandor\r\n\r\n\r\n\r\n           This film is set in New York City, 1981:\r\n                         \r\n                         \r\n          Murders: 2,228\r\n                         \r\n          Forcible Rape: 5,405\r\n                         \r\n          Violent Crime: 180,235\r\n                         \r\n          Aggravated Assault: 60,329\r\n                         \r\n          Property: 1,029,749\r\n                         \r\n          Vehicle Theft: 133,041\r\n                         \r\n          Robbery: 112,273                         \r\n                         \r\n          Burglary: 360,925\r\n                         \r\n          Larceny-Theft: 535,783\r\n                         \r\n          Crime Index: 1,209,984\r\n\r\n                         \r\n                         \r\n          1981 was the most violent year in NYC history as recorded by overall\r\n          Crime Index in relation to population.\r\n<b>                          2\r\n</b>                         \r\n                         \r\n<b>          JANUARY 31, 1981\r\n</b>          Over black we hear the opening of a garage door. The light\r\n          spills in and we see.\r\n                         \r\n                         \r\n<b>          EXT. UPPER MIDDLE CLASS RESIDENTIAL HOUSE, QUEENS NYC -\r\n</b><b>                         SUNRISE\r\n</b>                         \r\n          Open on ABEL MORALES. It is early morning and still almost\r\n          dark out. He has a rugged yet prosperously-handsome face and\r\n          is in his mid-thirties. He is struggling to get started with\r\n          his morning jog.\r\n                         \r\n                         \r\n<b>          EXT. SHIP GRAVEYARD, STATEN ISLAND NYC - DAY\r\n</b>                         \r\n          It is early morning. A large bulk fuel oil transport truck\r\n          sits idling next to a decrepit old dock. The dock sticks into\r\n          a backwater section of New York harbor that is filled with\r\n          the decaying remains of half-sunken abandoned barges and tug\r\n          boats.\r\n                         \r\n          JULIAN, the young driver of the truck sits and nervously\r\n          scans the horizon. Eventually a large fuel barge appears in\r\n          the distance being pushed by a tug boat. The barge is steered\r\n          past the skeletons of the other sunken ships and makes its\r\n          way to the dock in front of the tanker truck.\r\n                         \r\n          JULIAN gets out of his truck and readies a large connecting\r\n          hose. He looks around nervously. JULIAN steps across the\r\n          broken boards of the dock and struggles to get the hose to\r\n          the barge. He hands it to the BARGE OPERATOR with a nod of\r\n          the head and no words.\r\n                         \r\n          They connect the hose and start a large generator as it\r\n          begins to pump fuel into the truck. They both scan the\r\n          horizon again as the sun begins to come up.\r\n                         \r\n                         \r\n<b>          EXT. MORE INDUSTRIAL QUEENS NEIGHBORHOOD- SAME TIME\r\n</b>                         \r\n          ABEL is still jogging as the light begins to increase. It is\r\n          freezing out. He is a very serious guy. He is not happy that\r\n          he is out of shape. Finally he stops and bends over to catch\r\n          his breath. We have run with him from the nicer part of the\r\n          neighborhood to a rougher section. As he catches his breath\r\n          he stands up and looks around. He is unsure of his feelings.\r\n<b>                          3\r\n</b>                         \r\n                         \r\n<b>          INT. ANNA'S DRESSING AREA\r\n</b>          The camera slowly moves in as ANNA sits in a slip at her make\r\n          up table putting on her face for the day ahead. She looks\r\n          into the mirror as if she is putting on a coat of armor.\r\n                         \r\n                         \r\n<b>          INT. DRIVER'S CAB OF A BULK OIL TRANSPORT TRUCK - DAY\r\n</b>                         \r\n          STANDARD HEATING OIL, \"We set the Standard\" is written in\r\n          logo form on the side of the tank.\r\n                         \r\n          The truck idles in traffic waiting to pay the toll to cross\r\n          the Verrazano bridge that spans the mouth of New York harbor.\r\n                         \r\n          JULIAN, the young driver from the dock, cautiously looks\r\n          around as the traffic inches along. He finally approaches the\r\n          toll booth and pays.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Good morning.\r\n                         \r\n          JULIAN speaks English with a well-sanded accent. Is it\r\n          Central American or Mexican? The female collector gives him a\r\n          smile.\r\n          He heads through the booth, but there is still traffic on the\r\n          other side as the lanes merge together. Just as the traffic\r\n          is about to pick up he looks in his rearview mirror and we\r\n          see TWO GUYS come walking through the traffic and towards the\r\n          cab. Before we know it they are climbing up the cab steps.\r\n                         \r\n          The GUY on the driver's side, LOUIS SERVIDIO, is small and\r\n          very slight but he moves with great speed and strength. He\r\n          shatters the glass side window with his elbow. Unlocks the\r\n          door just as his partner, THUG #2, does the same thing on the\r\n          passenger side, but he is holding a gun. They are not wearing\r\n          masks. It's very brazen.\r\n                         \r\n          Before THUG #2 even asks JULIAN to get out of the cab LOUIS\r\n          SERVIDIO crushes him in the jaw with three swift punches then\r\n          pulls him out of the cab and down onto the roadway.\r\n                         \r\n          LOUIS SERVIDIO pulls the door shut and they drive away with\r\n          the truck leaving JULIAN sitting in the middle of the road\r\n          staring, as blood starts to flow from his jaw.\r\n                         \r\n                         \r\n<b>          INT. PARKING YARD OF STANDARD HEATING OIL- SAME TIME\r\n</b>                         \r\n          Two almost-matching late model Mercedes pull up to a chain-\r\n          link gate with a small sign that says \"STANDARD HEATING OIL:\r\n          WE SET THE STANDARD\". The DISPATCHER opens the gate.\r\n<b>                          4\r\n</b>                         \r\n                         \r\n          They both pull into reserved parking spaces next to each\r\n          other. ABEL is dressed in a very tasteful custom made suit.\r\n          ABEL's wife ANNA was driving the car behind him. She is a\r\n          beautiful, tall, blonde woman dressed to the nines but with a\r\n          streak in her eye that this is all business. You would not\r\n          want to cross this woman.\r\n                         \r\n<b>                          ABEL\r\n</b>           Ready?\r\n<b>                          ANNA\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           You look very nice.\r\n                         \r\n<b>                          ANNA\r\n</b>           Thank you.\r\n                         \r\n<b>                          ABEL\r\n</b>           You sure?\r\n                         \r\n<b>                          ANNA\r\n</b>           Yes.\r\n                         \r\n          ABEL walks around and opens his trunk. He takes out two large\r\n          empty briefcases.\r\n                         \r\n          He carries the briefcases as they both walk over to a large,\r\n          unmarked, armored van that is idling in the middle of the\r\n          parking lot. Two ARMED GUARDS get out of the van. One is\r\n          holding a clipboard. He walks up to ANNA and ABEL. He hands\r\n          them the clipboard. They look at each other one last time and\r\n          then both sign the document.\r\n                         \r\n          The other GUARD opens up the back of the truck. ABEL hands\r\n          him the briefcases and the guard begins to fill them with\r\n          cash. Lots of cash. ABEL and ANNA stand at the open back of\r\n          the van and just watch. Finally he finishes and hands the now-\r\n          heavy cases to ABEL.\r\n                         \r\n          ABEL picks up the two cases and walks a bit away from the\r\n          truck. He turns to ANNA.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           Don't do anything stupid.\r\n                         \r\n<b>                          ABEL\r\n</b>           We don't have any more money so\r\n           what else could I do.\r\n                         \r\n          She gives a small smile. He looks at his watch. They kiss.\r\n<b>                          5\r\n</b>                         \r\n                         \r\n          ABEL turns and begins walking with the cases. He gives a nod\r\n          to the DISPATCHER, who we now see, is in a small gatehouse,\r\n          and he begins to open the front gate.\r\n                         \r\n                         \r\n<b>          EXT. STREET OUTSIDE THE FRONT GATE- SAME TIME\r\n</b>                         \r\n          ABEL walks out through the gate and down the abandoned\r\n          industrial street about 25 yards, then looks to his right. He\r\n          looks down at the cases in his hands, turns, and stands\r\n          looking into the neighboring site.\r\n                         \r\n                         \r\n<b>          EXT. MASSIVE OIL TANK FARM: BROOKLYN NY WATERFRONT - DAY\r\n</b>                         \r\n          ABEL comes walking across the parking lot and sees ANDREW\r\n          WALSH standing in the middle of the dusty parking lot. ANDREW\r\n          is their longtime LAWYER/RIGHT-HAND MAN and is in his mid\r\n          fifties. He is smart but tired. The oversized briefcase in\r\n          his left hand seems to have permanently tilted his posture\r\n          that direction. The large oil-holding tanks loom above them.\r\n          The place is rusting and could use some work.\r\n                         \r\n          As they wait, the setting has the look and choreography of an\r\n          illegal transaction about to go down.\r\n<b>                          ANDREW WALSH\r\n</b>           So how are we this morning?\r\n                         \r\n<b>                          ABEL\r\n</b>           (gives a smile and nod)\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Well I woke up feeling very good\r\n           about this.\r\n                         \r\n<b>                          ABEL\r\n</b>           Really?\r\n                         \r\n          They both take a look at their watches.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You've been telling me not to do\r\n           this for a year.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Well we are going all in... so now\r\n           I love it.\r\n                         \r\n          Gives him another slight smile. They stand around in awkward\r\n          silence. Finally a late-model Ford Ltd. station wagon pulls\r\n          into the lot.\r\n<b>                          6\r\n</b>                         \r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           Here we go.\r\n          And a group of FIVE HASIDIC JEWS gets out. There are two guys\r\n          in their twenties, two in their fifties, and one in his mid-\r\n          to-late seventies. They all shake each other's hands then\r\n          stand around for a beat.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           Should we head inside?\r\n                         \r\n<b>          INT. SMALL TEMPORARY OFFICE TRAILER - DAY\r\n</b>                         \r\n          The group is now jammed around a folding table inside the\r\n          trailer. ABEL and his lawyer sit at one end facing the rest\r\n          of them. Finally, the senior member of the group, JOSEPH\r\n          MENDELSOHN, eyes up ABEL and leans forward. His accent is\r\n          strong yet you can understand every word.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           So why is it you want this land?\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm sorry?\r\n<b>                          JOSEPH\r\n</b>           It has been difficult for you to\r\n           get me here, no? Over a year?\r\n                         \r\n<b>                          ABEL\r\n</b>           Almost two.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           There are many like it around? And\r\n           thanks to all these tests you paid\r\n           for, we now know it is as much of a\r\n           mess below the ground as it is\r\n           above. My people have looked at\r\n           your books, I know this is a lot of\r\n           money for you, so why have you kept\r\n           on us so... just for this ugly and\r\n           polluted little piece of the earth.\r\n                         \r\n<b>                          ABEL\r\n</b>           I have been looking over my fence\r\n           at this property for a very long\r\n           time.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           So it is just proximity?\r\n<b>                          7\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           No... I imagine I want it for the\r\n           same reason you did.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           And what's that?\r\n                         \r\n<b>                          ABEL\r\n</b>           To grow.\r\n<b>                          JOSEPH\r\n</b>           Well, I am in the garment business\r\n           so I appreciate that sentiment. But\r\n           I inherited this land from my\r\n           uncle. Sadly he had no children of\r\n           his own. He was the one that let\r\n           them build these tanks here. So\r\n           this place can do little for me...\r\n           in fact thanks to all those tests\r\n           you've done it may be a liability.\r\n           As you know I offered to lease the\r\n           site to you at a fair price, but\r\n           you were not interested?\r\n                         \r\n<b>                          ABEL\r\n</b>           No.\r\n<b>                          JOSEPH\r\n</b>           Why not?\r\n                         \r\n<b>                          ABEL\r\n</b>           I like to own the things I use.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           I can see that.\r\n                         \r\n          Long pause.\r\n                         \r\n<b>                          ABEL\r\n</b>           So.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Yes. This contract here, your\r\n           lawyers have fully reviewed it?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Of course.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           And you have brought the money?\r\n           (ABEL nodes yes)\r\n           So you realize you have only thirty\r\n           days to close this transaction?\r\n<b>                          (MORE)\r\n</b><b>                          8\r\n</b>                         \r\n<b>                          JOSEPH (CONT'D)\r\n</b>           No extensions, no... contingencies\r\n           whatsoever.\r\n<b>                          ABEL\r\n</b>           I understand.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           I want you to know this up front. I\r\n           am a very fair man but I believe in\r\n           honoring contracts. You will\r\n           fulfill your end of this contract\r\n           and the property is yours. If you\r\n           can't we will keep your money and\r\n           will sell it to your competitor who\r\n           has been chasing us almost as badly\r\n           as you have. I like you, but know\r\n           that the only reason I am choosing\r\n           you is because of the favorable\r\n           terms of this contract. So this is\r\n           business... and when you sign\r\n           this....\r\n                         \r\n<b>                          ABEL\r\n</b>           I understand.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Well then, let's see this money,\r\n           and then I will sign these papers.\r\n                         \r\n          ABEL turns to ANDREW and gives a slight nod. ANDREW pulls the\r\n          black briefcase onto the table and opens it. It has seven\r\n          hundred thousand dollars in cash in it. He slides it over to\r\n          their side. The old man signs the contract and they shake\r\n          hands.\r\n                         \r\n                         \r\n<b>          EXT. MASSIVE OIL TANK FARM PARKING LOT - DAY\r\n</b>                         \r\n          ABEL stands next to ANDREW's car.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Congratulations.\r\n                         \r\n<b>                          ABEL\r\n</b>           It's not ours yet.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Well, it was a hell of a job just\r\n           getting them to this point. It's a\r\n           good day for us. Take a walk\r\n           around. Enjoy it for a second.\r\n                         \r\n          ANDREW gets in his car and drives away. ABEL looks around and\r\n          decides to go for a little walk.\r\n<b>                          9\r\n</b>                         \r\n                         \r\n          He heads out towards the tanks and walks among them. They\r\n          tower seven stories above him. As he walks, he is cut off\r\n          like a maze from any other visual input. (Similar to being\r\n          inside a Richard Serra sculpture) Finally he emerges into\r\n          some light and as ABEL looks up the camera reveals his view.\r\n          It's midtown Manhattan in all its glory, just across the East\r\n          River from the site. He stares at the city and we see the\r\n          true depths of his ambition lock on his face. He looks to his\r\n          watch.\r\n                         \r\n<b>          INT. 1981 MERCEDES 500 SEC\r\n</b>                         \r\n          ABEL drives away from New York City. We see it behind his\r\n          head.\r\n                         \r\n                         \r\n<b>          INT. CAR ON MERRITT PARKWAY\r\n</b>                         \r\n          The terrain turns to upscale country.\r\n                         \r\n                         \r\n<b>          EXT. COUNTRY HOUSE - DAY\r\n</b>                         \r\n          ABEL's car drives into a long driveway through the woods.\r\n          Then an architect-designed, 80's modern house, still under\r\n          construction, appears. He pulls up in front.\r\n                         \r\n          He gets out of the car and stands there looking at the large\r\n          house. He walks into the house and we see more clearly that\r\n          it is nearing completion. It is empty.\r\n                         \r\n                         \r\n<b>          INT. 80'S MODERN HOUSE - DAY\r\n</b>                         \r\n          ABEL walks over to the massive floor-to-ceiling windows and\r\n          stands looking over the large pond that sits down the hill\r\n          from the house. As he stares out his CONTRACTOR comes quietly\r\n          walking in behind him.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           Hello?\r\n                         \r\n<b>                          ABEL\r\n</b>           There he is.\r\n                         \r\n          He walks up behind him and they both look out in silence for\r\n          a beat.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You have done a beautiful job here.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           Thank you.\r\n<b>                          10\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I mean it. You and your men should\r\n           be very proud.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           We are.\r\n                         \r\n<b>                          ABEL\r\n</b>           Most people don't have anything\r\n           beautiful like this to show for\r\n           their day's work. You are a lucky\r\n           man.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           I am.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well I thank you... my family will\r\n           be very happy here.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           I hope so.\r\n                         \r\n<b>                          ABEL\r\n</b>           Now I think I owe you some money.\r\n<b>                          CONTRACTOR\r\n</b>           That may be true.\r\n                         \r\n<b>                          ABEL\r\n</b>           It is.\r\n                         \r\n          ABEL reaches into his jacket pocket and takes out a thick\r\n          envelope of cash. As he does we see a transformation of his\r\n          personality from pleasant philosopher to a direct voice of\r\n          unquestioned authority.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           This is the seventeen outstanding.\r\n           But we are arriving here in four\r\n           days. It must be done.\r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well, I'll let you go.\r\n                         \r\n          He says this as he leads him to the door.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           And the tile in the master bath...\r\n<b>                          11\r\n</b>                         \r\n                         \r\n<b>                          CONTRACTOR\r\n</b>           It's being replaced, as I mentioned\r\n           to your wife, that was an error on\r\n           our part. Congratulations on your\r\n           home.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you.\r\n                         \r\n<b>          EXT. TOP OF HILL ON OTHER SIDE OF POND LOOKING BACK AT HIS\r\n</b><b>          HOUSE. - DAY\r\n</b>                         \r\n          ABEL stands, surrounded by massive trees in the thick forest,\r\n          looking across the ridge back at his house. He is a little\r\n          out of breath after climbing the hill but he looks strangely\r\n          comfortable even though he is standing in the woods in a\r\n          suit, tie, and dress shoes. He takes a nice cigar out of his\r\n          pocket, lights it and has a real moment of joy. He looks up\r\n          to the tops of the trees, then back at the new house. He\r\n          exhales a long deep breath. Then we hear a large truck come\r\n          rumbling in the driveway. He hears it. His face shows that he\r\n          knows the sound immediately.\r\n                         \r\n                         \r\n<b>          EXT. HOUSE DRIVEWAY - DAY\r\n</b>          ABEL comes out of the woods and sees a smaller heating oil\r\n          delivery truck (with the same Standard Heating Oil logo)\r\n          parked in the driveway. His face shows it probably isn't\r\n          great news.\r\n                         \r\n                         \r\n<b>          INT. HOSPITAL EMERGENCY ROOM - DAY\r\n</b>                         \r\n          ABEL comes down a hallway and then turns through a curtain\r\n          into a treatment area. Sitting on the table is the young\r\n          driver of the truck, JULIAN.\r\n                         \r\n          He has a contraption on his head that is holding his jaw shut\r\n          in place. His eye is black. ABEL goes over and gives him a\r\n          tight hug. But then he ever so slightly checks himself and\r\n          places him back down on the table.\r\n                         \r\n          ABEL looks up and sees ANNA, standing in the corner. She is\r\n          all business. They stare at each other.\r\n                         \r\n<b>                          ANNA\r\n</b>           They broke his jaw.\r\n                         \r\n<b>                          ABEL\r\n</b>           Have they found the truck?\r\n<b>                          12\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Yes.\r\n<b>                          ABEL\r\n</b>           Are you alright?\r\n                         \r\n<b>                          JULIAN\r\n</b><b>                          (NODS YES)\r\n</b>                         \r\n<b>                          ABEL\r\n</b>           Have the police been here yet?\r\n                         \r\n<b>                          ANNA\r\n</b>           He was left in the middle of the\r\n           highway without a truck, they\r\n           brought him in.\r\n                         \r\n<b>                          ABEL\r\n</b>           Can you speak?\r\n                         \r\n          ANNA'S temper is rising.\r\n                         \r\n<b>                          ANNA\r\n</b>           Not for a couple days... Can I\r\n           speak with you outside?\r\n          ANNA heads out into the hallway. ABEL looks around a beat\r\n          then follows.\r\n                         \r\n                         \r\n<b>          EXT. HOSPITAL HALLWAY -SAME TIME\r\n</b>                         \r\n          ANNA is waiting in the hallway.\r\n                         \r\n<b>                          ANNA\r\n</b>           Did they sign the contract?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ANNA\r\n</b>           And took the deposit?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ANNA\r\n</b>           So it's a go?\r\n                         \r\n<b>                          ABEL\r\n</b>           (he gives a nice nod yes)\r\n                         \r\n<b>                          ANNA\r\n</b>           Congratulations.\r\n<b>                          13\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           To you as well.\r\n<b>                          ANNA\r\n</b>           We have thirty days?\r\n                         \r\n          He nods ever so slightly yes, and she gives him a knowing\r\n          smile back of equal measure. We are beginning to see that\r\n          they actually work quite well together.\r\n<b>                          ABEL\r\n</b>           These fucking guys. This poor kid\r\n           has been working his ass off.\r\n                         \r\n<b>                          ANNA\r\n</b>           Do you want me to speak to my\r\n           Brother about this?\r\n                         \r\n<b>                          ABEL\r\n</b>           No...don't talk to him or your\r\n           father.\r\n                         \r\n<b>                          ANNA\r\n</b>           This can't continue.\r\n                         \r\n<b>                          ABEL\r\n</b>           It won't.\r\n                         \r\n<b>                          ANNA\r\n</b>           It will if we don't do something.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm meeting with the D.A. in the\r\n           morning.\r\n                         \r\n<b>                          ANNA\r\n</b>           Oh, fuck the D.A. He's more\r\n           interested in coming after us than\r\n           helping us.\r\n                         \r\n          ABEL looks around in disapproval. She thinks this through and\r\n          then looks in at JULIAN.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           It's not fair to them. You're at\r\n           war here.\r\n                         \r\n<b>                          ABEL\r\n</b>           No we are not.\r\n                         \r\n<b>                          ANNA\r\n</b>           Really... because they are.\r\n<b>                          14\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Well I'm not.\r\n          They look each other over. She then finally leans in and\r\n          gives him a caring kiss, she walks off.\r\n                         \r\n<b>                          ANNA\r\n</b>           And you're going out to check on\r\n           the new house?\r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n          He watches her walk away then looks back into the hospital\r\n          room. He enters.\r\n                         \r\n                         \r\n<b>          INT. HOSPITAL EMERGENCY ROOM - DAY\r\n</b>                         \r\n          ABEL walks into the room and looks at JULIAN. He looks up and\r\n          ABEL has trouble putting it to words.\r\n                         \r\n<b>                          ABEL\r\n</b>           I have to get going.\r\n                         \r\n          JULIAN gives a nod.\r\n<b>                          ABEL (CONT'D)\r\n</b>           Can we get you anything?\r\n                         \r\n          Nods no.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           We'll pick you up when they let you\r\n           out of here.\r\n                         \r\n          They look at each other.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           These men are cowards. Too weak to\r\n           make a living... or even fight with\r\n           their own hands, and too stupid to\r\n           think up anything else to do.\r\n                         \r\n          Finally he turns and leaves.\r\n                         \r\n                         \r\n<b>          EXT. ABANDONED RACETRACK PARKING LOT - QUEENS NY - DAY\r\n</b>                         \r\n          ABEL drives up to the drop off scene. There is the large bulk\r\n          transport truck and one lone police car just sitting in the\r\n          middle of the parking lot.\r\n<b>                          15\r\n</b>                         \r\n                         \r\n          ABEL gets out, walks up, and stops to stare at the truck. A\r\n          young beat cop is sitting on the hood of his car waiting.\r\n<b>                          ABEL\r\n</b>           May I take it?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           Excuse me?\r\n                         \r\n<b>                          ABEL\r\n</b>           May I take it now?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           Is it yours?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          BEAT COP\r\n</b>           Well, I'm sorry about that. Once\r\n           the owner or an owner's\r\n           representative files the claim form\r\n           in Corona she's yours... again.\r\n                         \r\n<b>                          ABEL\r\n</b>           So you guys have done what you\r\n           needed to?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           And what was that?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           I'm sorry?\r\n                         \r\n<b>                          ABEL\r\n</b>           You just said you've done what you\r\n           needed to... so what was it that\r\n           you've done?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           (looks back dumbfounded)\r\n                         \r\n<b>                          ABEL\r\n</b>           Did you fingerprint or anything?\r\n                         \r\n<b>                          BEAT COP\r\n</b>           No need, these guys always wear\r\n           gloves.\r\n                         \r\n<b>                          ABEL\r\n</b>           So you've done nothing.\r\n<b>                          16\r\n</b>                         \r\n                         \r\n<b>                          BEAT COP\r\n</b>           I'm not exactly sure, I just got\r\n           here at four. My shift is actually\r\n           up.\r\n                         \r\n<b>                          ABEL\r\n</b>           So who's coming?\r\n                         \r\n          They stare at each other, then the truck. ABEL then climbs up\r\n          and we see he knows his way around the truck. He goes up top\r\n          and opens and looks into a valve, the tank is empty.\r\n                         \r\n<b>                          BEAT COP\r\n</b>           Sorry.\r\n                         \r\n          The cop gets in his car and prepares to drive away.\r\n                         \r\n<b>           BEAT COP (CONT'D)\r\n</b>           Why did they want it?\r\n                         \r\n<b>                          ABEL\r\n</b>           They stole the $6,000 of fuel that\r\n           was in it.\r\n                         \r\n          The cop leaves. ABEL is left standing on top of the truck in\r\n          the parking lot alone with his battered truck. He looks down\r\n          at the open loading valve and begins to come up with an idea.\r\n          The sun is setting.\r\n                         \r\n                         \r\n<b>          EXT. STANDARD HEATING TRUCK YARD - DAY\r\n</b>                         \r\n          A sign on the inside of the gate reads. \"It's not safety\r\n          first... It's safety always\". The motor on the gate starts in\r\n          and it opens. In drives ABEL'S car.\r\n                         \r\n                         \r\n<b>          INT. ANNA'S OFFICE STANDARD HEATING OIL - DAY\r\n</b>                         \r\n          ANNA is working away on an adding machine in her office. She\r\n          is listening to the radio that sits behind her on the desk.\r\n          We can see that she is in her comfort zone.\r\n                         \r\n                         \r\n                         \r\n<b>          INT. BROOKLYN ASSISTANT DISTRICT ATTORNEY'S OFFICE - DAY\r\n</b>                         \r\n          The ASSISTANT D.A. is sitting behind his desk as DEPUTY LANGE\r\n          stands off to the side. He is only in his early thirties but\r\n          with confidence and ego to spare. They know each other.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Andrew.\r\n<b>                          17\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Lawrence. Thank you for seeing us\r\n           on such short notice.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Of course. And Mr. Morales. Please\r\n           sit. I didn't realize you were\r\n           coming as well.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Yes...\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           So what can I do for you?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           We need your help.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           In what way?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Our trucks. They are being robbed.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           (he looks over at DEPUTY\r\n<b>                          LANGE)\r\n</b>                         \r\n<b>                          ANDREW WALSH\r\n</b>           We have a serious security issue.\r\n                         \r\n<b>                          DEPUTY LANGE\r\n</b>           There have been a series of\r\n           hijackings of bulk-fuel delivery\r\n           vehicles.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Yes.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Our drivers are being put in\r\n           danger.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Mr. Walsh, as I know you know, this\r\n           office has been investigating your\r\n           entire industry.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Of course.\r\n                         \r\n          There is an awkward pause as LAWRENCE decides how he should\r\n          continue.\r\n<b>                          18\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           And as much as I'd like to be able\r\n           to help you, you know this is a\r\n           police issue. It's not what we do\r\n           here.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I understand. But this is turning\r\n           into an urgent and pressing matter\r\n           for us.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           Urgent?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Yes.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'm not sure what you mean. There\r\n           were more murders and rapes in this\r\n           city last year then there ever have\r\n           been, so if you have come to tell\r\n           me that we have a urgent security\r\n           issue here, trust me I'm aware.\r\n                         \r\n          ABEL cuts in. He can't help himself.\r\n<b>                          ABEL\r\n</b>           My people are at risk just driving\r\n           around in this city, just trying to\r\n           do their jobs. And I... I have done\r\n           everything you have asked of me.\r\n           It's been two years since you first\r\n           started investigating my company\r\n           and I have spent thousands of\r\n           dollars hiring lawyers for this and\r\n           that to provide you with every\r\n           piece of information your office\r\n           has requested. And I expect that\r\n           you have been asking the same from\r\n           my competitors. So with all this\r\n           information that you have gained...\r\n           We are just asking if you have any\r\n           idea who has been doing this to us?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I don't.\r\n                         \r\n          This sits unanswered.\r\n<b>                          19\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           I understand your frustration. And\r\n           although everyone else seems to\r\n           have given up and left this city\r\n           for dead, I haven't. And as you\r\n           know we have been investigating\r\n           industry-wide corruption in your\r\n           business that seems to have been\r\n           going on for years. And the simple\r\n           fact is that the only person who\r\n           could do anything with 8000 gallons\r\n           of heating oil in a matter of\r\n           minutes after stealing a truck is\r\n           someone from within that industry.\r\n           And almost certainly someone with\r\n           local storage capacity. So you're\r\n           right. That means you all are\r\n           stealing from each other. Which is,\r\n           as far as I can tell, just a\r\n           refreshing new take on what you've\r\n           been doing to your customers and\r\n           fellow taxpayers for the last\r\n           fifteen years.\r\n                         \r\n          This sits in the room for a long beat.\r\n<b>                          ABEL\r\n</b>           First, please know that we respect\r\n           the work you are doing to try to\r\n           help our business and the city. But\r\n           also know I have never taken\r\n           anything I haven't earned from\r\n           anyone so when you say you've...\r\n                         \r\n          He pulls himself back.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           We are on the same side here.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Well yes and no. See, all that I\r\n           can do is to try and put people\r\n           away in the simplest and most\r\n           economical way possible with the\r\n           limited resources at my disposal.\r\n           It doesn't really matter to us who\r\n           it is or how we do it as long as\r\n           it's progress.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well, it makes a difference to me.\r\n<b>                          20\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I know it does. This city is a very\r\n           difficult place to do business\r\n           right now.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n          This more conciliatory tone makes LAWRENCE think through his\r\n          next reply for a long beat.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           You know... Mr. Morales you seem\r\n           like a decent man, and because of\r\n           that I'm really not comfortable\r\n           just sitting here with you\r\n           pretending that the elephant\r\n           perched on the corner of my desk\r\n           isn't there.\r\n                         \r\n          LAWRENCE looks over at DEPUTY LANGE whose body language says\r\n          `don't go down this road'. But he does.\r\n                         \r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           I can't go into specifics at this\r\n           moment but we believe that you and\r\n           your company have broken the law\r\n           and that we have enough evidence to\r\n           prove that. So next week, Monday\r\n           actually, we will be bringing a\r\n           case against you.\r\n                         \r\n          This drops like a bomb. ABEL and LAWRENCE stare at each\r\n          other. Then ABEL glances to the corner of the desk. We see\r\n          that a large draft copy of the case is actually sitting\r\n          there. ABEL looks back up.\r\n                         \r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           I'm sorry to do this in person.\r\n           It's awkward, obviously, but I\r\n           didn't want to have this happen on\r\n           Monday not having said something\r\n           here in person today, out of\r\n           respect.\r\n                         \r\n<b>                          ABEL\r\n</b>           I understand.\r\n                         \r\n          ABEL stands up to leave and ANDREW is still a little stunned\r\n          but stands.\r\n<b>                          21\r\n</b>                         \r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You have your job to do. But know\r\n           that you are wrong and that we will\r\n           take advantage of every opportunity\r\n           to prove that.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'm sure you will.\r\n                         \r\n          They turn to leave. And LAWRENCE has one more thought.\r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           One more thing... Have you been\r\n           doing anything different in your\r\n           business over the last year?\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm sorry?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'm just looking here through these\r\n           reports. It looks like out of the\r\n           nineteen registered heating oil\r\n           companies in the city your trucks\r\n           have been getting hit three to one.\r\n<b>                          ABEL\r\n</b>           Yes?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           So are you maybe doing something to\r\n           bring this on yourself?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Like what?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Like enter a new market?\r\n                         \r\n<b>                          ABEL\r\n</b>           I am always trying to expand my\r\n           business.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Of course. But I think you\r\n           understand what I'm saying... there\r\n           are always some markets that are\r\n           more difficult than others to\r\n           enter.\r\n                         \r\n<b>                          ABEL\r\n</b>           Every new market is a difficult\r\n           market.\r\n<b>                          (MORE)\r\n</b><b>                          22\r\n</b>                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           But my driver was assaulted and my\r\n           truck and oil were stolen in broad\r\n           daylight in front of fifteen toll\r\n           collectors and six police officers\r\n           yesterday. And yet no one saw\r\n           anything. That is a problem... no?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I have a lot of problems coming\r\n           across my desk every day Mr.\r\n           Morales.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm sure you do.\r\n                         \r\n                         \r\n<b>          INT. HALLWAY OF BROOKLYN D.A. COURT BUILDING - DAY\r\n</b>                         \r\n          ABEL walks out in front of ANDREW.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Abel. Abel.\r\n                         \r\n          He stops and turns.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           (his words escape him)\r\n                         \r\n<b>                          ABEL\r\n</b>           Exactly.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           No... let's not overreact. We don't\r\n           even know what they are bringing\r\n           against us. It could be total\r\n           bullshit, and they are just trying\r\n           to use us along the way. This isn't\r\n           anything yet.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n                         \r\n<b>          INT. ANNA'S OFFICE STANDARD HEATING OIL - DAY\r\n</b>                         \r\n          ANNA is working away on an adding machine in her office. She\r\n          is listening to the radio that sits behind her on the desk.\r\n          We can see that she is in her comfort zone. ABEL enters.\r\n                         \r\n<b>                          ANNA\r\n</b>           How'd it go?\r\n<b>                          23\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           The DA... He said he's going to\r\n           bring down charges on us next week.\r\n                         \r\n<b>                          ANNA\r\n</b>           For what?\r\n                         \r\n<b>                          ABEL\r\n</b>           We don't know yet.\r\n<b>                          ANNA\r\n</b>           Who else?\r\n                         \r\n<b>                          ABEL\r\n</b>           Right now they are just saying us.\r\n                         \r\n          Beat.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Where are we exposed?\r\n                         \r\n<b>                          ANNA\r\n</b>           We follow standard industry\r\n           practice on every front.\r\n                         \r\n<b>                          ABEL\r\n</b>           Anna?\r\n                         \r\n<b>                          ANNA\r\n</b>           I need to know what they are saying\r\n           we did.\r\n                         \r\n          Beat.\r\n                         \r\n<b>                          ABEL\r\n</b>           Okay.\r\n                         \r\n                         \r\n<b>          INT. HOSPITAL LONG HALLWAY - DAY\r\n</b>                         \r\n          ABEL walks down the long hallway and enters a room.\r\n                         \r\n                         \r\n<b>          INT. HOSPITAL ROOM - DAY\r\n</b>                         \r\n          JULIAN is sitting on the edge of the bed, waiting. His jaw is\r\n          in bandages, and there are crutches sitting next to him, but\r\n          he looks much better than the previous day. They look at each\r\n          other intensely but say nothing.\r\n<b>                          24\r\n</b>                         \r\n                         \r\n<b>          INT. SHIT-HOLE TENEMENT STAIRWELL - DAY\r\n</b>          ABEL is helping JULIAN up the stairs. They struggle together.\r\n          Finally they get to the top floor and stand outside apartment\r\n          number . JULIAN stops, not really wanting to open the door in\r\n          front of his boss.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm very sorry this happened. Do\r\n           you need anything else?\r\n           (JULIAN nods no)\r\n           If you do, you call the office...\r\n           Okay then.\r\n                         \r\n          He turns to leave and walks back to the stairs.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Abel?\r\n                         \r\n          ABEL turns and looks at him.\r\n                         \r\n<b>                          JULIAN (CONT'D)\r\n</b>           Do you think I am ready to move\r\n           into sales?\r\n                         \r\n          ABEL thinks this through.\r\n<b>                          ABEL\r\n</b>           I don't.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I... I'm not sure I will be able...\r\n                         \r\n<b>                          ABEL\r\n</b>           You will.\r\n                         \r\n          JULIAN changes the subject.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Did you get the truck back?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes. They took the load.\r\n                         \r\n<b>                          JULIAN\r\n</b>           This is the sixth one?\r\n                         \r\n<b>                          ABEL\r\n</b>           Seventh... you get some rest.\r\n<b>                          25\r\n</b>                         \r\n                         \r\n<b>          EXT. BUILDING BY ABEL'S CAR - DAY\r\n</b>          ABEL comes out of the building and walks towards his car\r\n          where a group of TOUGH-LOOKING KIDS in their early twenties\r\n          are sitting, looking to see who is going to come and claim\r\n          the brand new car. He walks right though them without being\r\n          overly aggressive but without a hint of being intimidated. He\r\n          gets in and drives away.\r\n                         \r\n<b>          INT. BROOKLYN BARBERSHOP - NIGHT\r\n</b>                         \r\n          ABEL is sitting in the barber chair getting a trim. Through\r\n          the window we see ARNOLD KLINE, a competitor of ABEL'S\r\n          walking by. They see each other. ARNOLD KLINE comes into the\r\n          shop followed by a BODYGUARD. He sits down next to ABEL. This\r\n          conversation happens with them both looking at each other in\r\n          the mirror.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Well, look who it is.\r\n                         \r\n<b>                          ABEL\r\n</b>           Arnold.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Just a touch off the side Jimmy.\r\n           Not all of us are as lucky as Mr.\r\n           Morales here in terms of keeping\r\n           our hair.\r\n                         \r\n<b>                          BARBER JIMMY\r\n</b>           You're a good looking man.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           I know I am. So I hear\r\n           congratulations are in order?\r\n                         \r\n<b>                          ABEL\r\n</b>           What's that?\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           You got yourself in contract over\r\n           there.\r\n                         \r\n<b>                          ABEL\r\n</b>           We are working on it.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Thirty day close I hear, you better\r\n           be.\r\n                         \r\n<b>                          ABEL\r\n</b>           We are, thanks for your concern.\r\n<b>                          26\r\n</b>                         \r\n                         \r\n          BARBER JIMMY finishes ABEL, and he stands up to leave. ABEL\r\n          has his back to KLINE as he pays.\r\n<b>                          ARNOLD KLINE\r\n</b>           I saw a couple of your trucks over\r\n           in Rego Park the other day.\r\n                         \r\n          This brings ABEL around to look at him square.\r\n                         \r\n<b>                          ABEL\r\n</b>           Really? When was that?\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           A couple times.\r\n                         \r\n<b>                          ABEL\r\n</b>           It's possible.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Is it?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           That's a tough market.\r\n<b>                          ABEL\r\n</b>           It is.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           My father struggled for years\r\n           before he broke in there.\r\n                         \r\n<b>                          ABEL\r\n</b>           Any new market is a tough one. I'll\r\n           see you.\r\n                         \r\n          ABEL walks out of the shop and looks around. It is now dark\r\n          outside.\r\n                         \r\n                         \r\n<b>          EXT. COUNTRY ROAD - NEXT MORNING\r\n</b>                         \r\n          ABEL is jogging again but this time he is deep in the woods.\r\n          He runs along the road. We then hear a car coming from behind\r\n          him. The car noise then turns into more of a truck noise. He\r\n          stops and turns around as we see a large truck coming towards\r\n          him.\r\n                         \r\n          He gets himself over to the side of the road. We have a\r\n          slight fear it might hit him. But as it passes we see it's a\r\n          large moving truck. There's a second one following right\r\n          behind it.\r\n<b>                          27\r\n</b>                         \r\n                         \r\n          As the trucks pass it registers on ABEL's face. He cuts into\r\n          a path in the woods.\r\n                         \r\n<b>          EXT. DRIVEWAY\r\n</b>                         \r\n          ABEL walks up to his house, and we see the moving trucks\r\n          preparing to unload. ANNA gets out of her car with the kids,\r\n          and they run around and check out the house as ANNA directs\r\n          the movers.\r\n          ABEL comes up and stands next to her. They smile a protected\r\n          smile at their new home. ABEL gives her a kiss.\r\n                         \r\n                         \r\n<b>          INT. DINING ROOM OF NEW HOUSE - NIGHT\r\n</b>                         \r\n          The whole family sits around the table in candlelight. They\r\n          are eating takeout, but with a mismatch of formal and\r\n          everyday tableware that has been unpacked. There are boxes\r\n          all around them.\r\n                         \r\n<b>                          ANNA\r\n</b>           I know it has been a long road, and\r\n           that not all of you wanted to do\r\n           this, but thank you. For me...\r\n<b>                          ABEL\r\n</b>           A toast.\r\n                         \r\n          All six raise a glass.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           A toast to our new home. It's as\r\n           beautiful as my wife and daughters\r\n           and as strong as me...(kids laugh)\r\n           May we be happy, prosperous and\r\n           safe here. Cheers.\r\n                         \r\n                         \r\n<b>          INT. GYMNASIUM GIRLS YOUTH SOCCER GAME - NEXT MORNING\r\n</b>                         \r\n          ABEL is standing watching the game as he waits for his coffee\r\n          to come out of the snack bar. Over his shoulder we hear...\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           So you made the move?\r\n                         \r\n          ABEL turns and sees PETER FORENTE standing there. He's in his\r\n          mid-forties, very well-dressed, and handsomely bald.\r\n                         \r\n<b>                          ABEL\r\n</b>           Peter... it's official as of\r\n           yesterday.\r\n<b>                          28\r\n</b>                         \r\n                         \r\n<b>                          COUNTER PERSON\r\n</b>           Sir.\r\n          ABEL picks up his coffee, and they both walk back over to the\r\n          sideline together. Although they are standing a bit off to\r\n          the side from everyone else.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           So I heard about your rig getting\r\n           picked off again.\r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           We should probably get together to\r\n           discuss this and go over some of\r\n           the preventative measures that\r\n           we've been taking. We haven't had\r\n           an incident since November. It\r\n           doesn't do any of us any good to\r\n           have this kind of attention brought\r\n           to us.\r\n                         \r\n          They both stare out at the court for beat.\r\n<b>           PETER FORENTE (CONT'D)\r\n</b>           So I think I may have seen one of\r\n           your new trucks the other day.\r\n                         \r\n          They look at each other.\r\n                         \r\n<b>           PETER FORENTE (CONT'D)\r\n</b>           Out near here, at the Miller Road\r\n           diner?\r\n                         \r\n<b>                          ABEL\r\n</b>           That's possible.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           The driver looked like a member of\r\n           the Hitler Youth. I haven't seen a\r\n           teamster that blond and blue-eyed\r\n           since I was a kid.\r\n                         \r\n<b>                          ABEL\r\n</b>           He's from Ohio. Played football. I\r\n           like my drivers to fit in with the\r\n           neighborhood...\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           That's new territory for you, no?\r\n                         \r\n          This brings them both back in to look at each other.\r\n<b>                          29\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Just picked up a few new accounts\r\n           over there. Weekend houses of some\r\n           old clients from in the city.\r\n                         \r\n          PETER gives a bit of a stronger look. Then finally turns back\r\n          towards the field.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Which one is yours?\r\n<b>                          ABEL\r\n</b>           Right there.\r\n                         \r\n          They look out.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           She's beautiful.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Welcome to the neighborhood. You\r\n           should be proud.\r\n<b>                          ABEL\r\n</b>           Proud?\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Yes.\r\n                         \r\n                         \r\n<b>          INT. GARAGE OF THE NEW HOUSE - DAY\r\n</b>                         \r\n          The garage is filled with boxes. ABEL stands in the middle of\r\n          a few that are partially unpacked. He has set up an old radio\r\n          in the corner of the garage, and it is playing a New York\r\n          Giants football game. ABEL takes an object out of one of the\r\n          boxes and looks at it with significance.\r\n                         \r\n          Coming from the main house we hear the doorbell ring. ABEL'S\r\n          oldest daughter, ANNIE, comes to the door of the garage.\r\n                         \r\n<b>                          ANNIE\r\n</b>           Dad. Mr. Walsh is here.\r\n                         \r\n          ABEL looks around behind ANNIE to see ANDREW standing there.\r\n          He waves him into the garage. The boxes are stacked almost\r\n          to the ceiling around them.\r\n<b>                          30\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'm sorry for the dramatic drop in\r\n           but your phone doesn't seem to be\r\n           working.\r\n                         \r\n<b>                          ABEL\r\n</b>           It's not set up yet... So I am\r\n           guessing this isn't good news here\r\n           on a Sunday night.\r\n<b>                          ANDREW WALSH\r\n</b>           No... It looks like they are coming\r\n           after us.\r\n                         \r\n<b>                          ABEL\r\n</b>           That describes many people at this\r\n           point.\r\n                         \r\n          Slight smile.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           The D.A.\r\n                         \r\n<b>                          ABEL\r\n</b>           How bad?\r\n<b>                          ANDREW WALSH\r\n</b>           I still haven't seen it yet. But my\r\n           guy in his office just gave me a\r\n           heads up an hour ago. It's not\r\n           good.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where are we exposed?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'm not sure, a couple places\r\n           probably.\r\n                         \r\n<b>                          ABEL\r\n</b>           A couple places?\r\n                         \r\n          This hits ABEL. He thinks for a beat than goes over to the\r\n          door to the house and calls for his wife.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Anna... Anna!\r\n                         \r\n          They wait. She enters, she is a bit surprised to see ANDREW\r\n          in her garage.\r\n                         \r\n<b>                          ANNA\r\n</b>           Andrew.\r\n<b>                          31\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Anna... sorry you've got no phone.\r\n<b>                          ABEL\r\n</b>           As of tomorrow I'll have my new\r\n           radio hooked up though so you\r\n           should be able to reach me wherever\r\n           I am...\r\n                         \r\n          He is making light of the situation, but as she looks at\r\n          their faces she knows there is a problem.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           The D.A. is going to bring down\r\n           charges on us tomorrow.\r\n                         \r\n<b>                          ANNA\r\n</b>           For what?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           We don't know yet.\r\n                         \r\n<b>                          ANNA\r\n</b>           Who else?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Right now they are just saying us.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where are we exposed?\r\n                         \r\n          ABEL looks at his wife. She looks at ANDREW.\r\n                         \r\n<b>                          ANNA\r\n</b>           We follow standard industry\r\n           practice on every front.\r\n                         \r\n          They all give each other a long look, as this means they have\r\n          been bending the rules in several places, as do all their\r\n          competitors.\r\n                         \r\n<b>                          ABEL\r\n</b>           What does that mean?\r\n                         \r\n<b>                          ANNA\r\n</b>           You know what that means.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           It means we may have some\r\n           accounting exposure where we have\r\n           pushed things a little too far.\r\n                         \r\n<b>                          ABEL\r\n</b>           How far?\r\n<b>                          32\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           You always told us to push until we\r\n           couldn't push any further. Well, we\r\n           may have hit that line. So we will\r\n           handle it and move on.\r\n                         \r\n<b>                          ABEL\r\n</b>           Anna?\r\n                         \r\n          ABEL shoots her a stinging worried glance.\r\n<b>                          ANNA\r\n</b>           I need to know what they are saying\r\n           we did.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Let's not get ahead of ourselves\r\n           here. You have always followed\r\n           standard industry practices. We\r\n           aren't even sure what this is yet.\r\n           I just wanted to make sure you had\r\n           all the information I do. This is a\r\n           badge of honor, it means we are big\r\n           enough to give a shit about now.\r\n           Don't worry.\r\n          That sits for a beat.\r\n                         \r\n<b>                          ABEL\r\n</b>           Okay.\r\n                         \r\n<b>                          ANNA\r\n</b>           Thank you for coming by Andrew.\r\n                         \r\n          ABEL reaches into his pocket and takes out a remote for the\r\n          automatic garage door opener. As it opens you can see the\r\n          pride in his face as this remote is a fairly high-tech new\r\n          item. They all sit and watch as it opens the whole way then\r\n          stops in silence.\r\n                         \r\n          ANDREW is now standing outside in the driveway.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Very impressive.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you.\r\n                         \r\n<b>                          ANNA\r\n</b>           It only cost him a year of the\r\n           kid's tuition.\r\n<b>                          33\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           And one more thing. I got a call\r\n           from the union... O'Leary.\r\n                         \r\n          This grabs both their attention.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           They've been getting word back from\r\n           our drivers.\r\n<b>                          ANNA\r\n</b>           What word?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           There is real concern about their\r\n           safety.\r\n                         \r\n<b>                          ABEL\r\n</b>           Who?\r\n                         \r\n<b>                          ANNA\r\n</b>           All of them.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           The drivers are feeling\r\n           unprotected.\r\n<b>                          ANNA\r\n</b>           Because they are.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I just think you should talk to\r\n           them about it. Before it grows into\r\n           something.\r\n                         \r\n<b>                          ABEL\r\n</b>           Okay.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Good night.\r\n                         \r\n                         \r\n<b>          INT. ABEL AND ANNA'S BEDROOM - NIGHT\r\n</b>                         \r\n          ABEL is lying in bed, awake. ANNA is as well. He is staring\r\n          at the ceiling. Their dog is lying at the foot of the bed\r\n          asleep as well. Eventually the dog wakes up and looks out\r\n          towards the doorway. He growls ever so lightly. Then he\r\n          stops, listens, and starts growling a little more.\r\n                         \r\n          ANNA looks up ever so slightly.\r\n                         \r\n<b>                          ANNA\r\n</b>           What's he doing?\r\n<b>                          34\r\n</b>                         \r\n                         \r\n          ABEL is now standing up to go look.\r\n<b>                          ABEL\r\n</b>           Quiet... don't worry. It's nothing.\r\n                         \r\n          ANNA tries to go back to sleep.\r\n                         \r\n                         \r\n<b>          INT. HALLWAYS/KID'S ROOMS - NIGHT\r\n</b>          ABEL walks out of the bedroom and slowly heads down the hall\r\n          to his kids' rooms. He looks in each room and the CHILD is\r\n          sleeping soundly with nothing out of place.\r\n                         \r\n                         \r\n<b>          INT. KIDS' ROOMS/HALLWAY- SAME TIME\r\n</b>                         \r\n          As he comes out of the last bedroom back into the hallway he\r\n          sees his dog standing at the top of the stairs looking down\r\n          over the balcony into the living room. The dog is starting to\r\n          quietly growl once again.\r\n                         \r\n          ABEL'S face goes from total comfort that his kids are safe to\r\n          total paranoia. He slowly walks down the hall. He stops off\r\n          in his bedroom closet and grabs a mid-size baseball bat/billy\r\n          club. Now he is heading down the stairs with the club trying\r\n          not to freak himself out.\r\n                         \r\n                         \r\n<b>          INT. OPEN LIVING ROOM/ENTRY HALL/FRONT DOOR - NIGHT\r\n</b>                         \r\n          ABEL walks down the stairs and the dog just stands at the\r\n          top, still growling every now and then. ABEL comes into the\r\n          living room and everything seems perfectly normal. He then\r\n          relaxes and turns towards the dog.\r\n                         \r\n<b>                          ABEL\r\n</b>           Quiet. It's nothing. Come down\r\n           here.\r\n                         \r\n          He snaps his fingers and calls the dog. The dog finally comes\r\n          down the stairs.\r\n                         \r\n          ABEL now heads towards the kitchen in a relaxed state, but\r\n          then the dog starts growling again and looking out the\r\n          windows next to the front door. ABEL comes over, he opens the\r\n          front door but the dog refuses to go out.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Go. Oh come on. Go.\r\n                         \r\n          ABEL thinks he hears something. He clicks on the lights and\r\n          pulls his bat back up into position. He heads outside.\r\n<b>                          35\r\n</b>                         \r\n                         \r\n<b>          EXT. FRONT DOOR TO ABEL'S HOUSE - NIGHT\r\n</b>          ABEL comes to the end of the front walk and there is nothing.\r\n          The dog has now followed him outside and is slowly heading\r\n          over to a area where a small exterior hallway leads to a side\r\n          entrance. It is dark. The dog starts barking and going crazy.\r\n          ABEL slowly heads over to the covered passageway.\r\n                         \r\n          All hell now breaks lose. A BURGLAR, in all black, comes\r\n          blasting out of the shadows. The dog tries to bite him as he\r\n          goes by. ABEL swings his club and hits BURGLAR square on the\r\n          shoulder but he keeps coming. He knocks ABEL over and runs\r\n          towards the driveway. ABEL is up and chasing after him faster\r\n          than we expect.\r\n                         \r\n                         \r\n<b>          EXT. BASE OF THE RAVINE DEEP IN WOODS- CONTINUOUS\r\n</b>                         \r\n          There is a pretty good moon out so we can see them running\r\n          full throttle through the very thick woods. ABEL is keeping\r\n          up with him and in fact may be gaining on him.\r\n                         \r\n          ABEL is still in his pajamas. He has a rage that has been\r\n          building up inside him for a good two weeks that is now\r\n          pouring out of him in the energy to chase this guy down.\r\n          They come to the top of a small ravine which ABEL seems to\r\n          know from his runs through the woods and ABEL takes a bit of\r\n          an easier/quicker path down.\r\n                         \r\n                         \r\n<b>          EXT. WOODS BEHIND ABEL'S HOUSE - CONTINUOUS\r\n</b>                         \r\n          ABEL now cuts him off at an angle and swings the bat at his\r\n          legs. BURGLAR trips and goes flying. ABEL falls as he swings\r\n          at him. They both sit on the ground for a beat. ABEL is\r\n          exhausted. They stare at each other.\r\n                         \r\n          A brief look of panic comes across BURGLAR's face. Then he is\r\n          up again and running off into the woods.\r\n                         \r\n          ABEL gets himself up and chases after him.\r\n                         \r\n                         \r\n<b>          EXT. ROAD NEXT TO THE WOODS - NIGHT\r\n</b>                         \r\n          ABEL comes out of the woods into the middle of the road, and\r\n          in the distance we see BURGLAR run up to a waiting van with\r\n          its lights and engine on. The guy gets into the passenger\r\n          side of the van, and it peels out.\r\n                         \r\n          ABEL is left standing in the middle of the road, barely able\r\n          to breathe and holding the bat.\r\n<b>                          36\r\n</b>                         \r\n                         \r\n<b>          EXT. ABEL FRONT DOOR - NIGHT\r\n</b>          ABEL comes walking back towards his front door. ANNA is\r\n          standing with all the lights on and with the dog sitting next\r\n          to her. She looks at him in shock.\r\n                         \r\n<b>                          ANNA\r\n</b>           Where were you?\r\n                         \r\n<b>                          ABEL\r\n</b>           (looking to the dog)\r\n           A lot of help you were.\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel?\r\n                         \r\n          They both look down at his bare feet. He has been in some\r\n          kind of shock and hasn't even noticed that his bare feet are\r\n          cut up to pieces from running in the woods through the ice.\r\n          His feet are bleeding all over the walkway.\r\n                         \r\n                         \r\n<b>          INT. POWDER ROOM OF ABEL AND ANNA'S HOUSE - NIGHT\r\n</b>                         \r\n          ANNA is in warrior mode. Any panic in her voice has\r\n          disappeared, and she is speaking with a calm yet deadly\r\n          seriousness. She is cleaning the cuts on his feet and putting\r\n          bandages on them as they talk.\r\n                         \r\n<b>                          ANNA\r\n</b>           Who was it?\r\n                         \r\n<b>                          ABEL\r\n</b>           What do you mean, how am I supposed\r\n           to know who it was?\r\n                         \r\n          She gives him a look.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I don't know.\r\n                         \r\n          She gives him another look.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I think it was just some punk,\r\n           looking to rip us off.\r\n                         \r\n<b>                          ANNA\r\n</b>           If you...\r\n                         \r\n<b>                          ABEL\r\n</b>           Ouch! If they had wanted to send a\r\n           message he could have... and he\r\n           didn't.\r\n<b>                          37\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Seems like a message was sent loud\r\n           and clear.\r\n                         \r\n<b>                          ABEL\r\n</b>           Please. Don't get going on this. We\r\n           are a big new house. He probably\r\n           wanted the TV. He didn't have a\r\n           gun, he had nothing. The alarm will\r\n           be in on Monday. It was some kid.\r\n           They aren't coming back.\r\n                         \r\n          She looks at him with considerable concern.\r\n                         \r\n          He leans in and starts kissing her. She holds still at first\r\n          then gives in.\r\n                         \r\n                         \r\n<b>          INT. TRAINING ROOM AT STANDARD HEATING OIL - NEXT MORNING\r\n</b>                         \r\n          ABEL is in a suit but is kneeling and almost lying on his\r\n          back showing three SALES RECRUITS what they should be looking\r\n          for. Another INSTRUCTOR looks on. We see ABEL in his element.\r\n          He is a salesman.\r\n                         \r\n<b>                          ABEL\r\n</b>           What you are looking for here is\r\n           the opening to the burn chamber.\r\n           Now at this point you have not\r\n           tipped your hat in anyway. From the\r\n           minute you walked in the house you\r\n           should have been working to create\r\n           an impression of total\r\n           impartiality. But now...\r\n                         \r\n          He reaches over and opens the small door. A fire is burning\r\n          inside. On cue the instructor hands ABEL a crisp clean white\r\n          handkerchief.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           When this door opens you begin to\r\n           close. It must always be spotless.\r\n           If they see you have ever done this\r\n           before it is over.\r\n                         \r\n          He takes it and reaches up into a small exhaust chimney.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Now, you do this and only this...\r\n           You look down at the cloth and\r\n           don't say a word... You just keep\r\n           staring at the cloth and then you\r\n           slowly just start shaking your\r\n           head. Very very slowly and small.\r\n<b>                          (MORE)\r\n</b><b>                          38\r\n</b>                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Don't look up at them. Just at the\r\n           cloth.\r\n          Then ABEL makes a small clicking noise.\r\n                         \r\n<b>                          INSTRUCTOR\r\n</b>           Do you hear that noise... that's\r\n           the noise.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           What noise?\r\n                         \r\n<b>                          ABEL\r\n</b>           It means you are close... Then\r\n           after sitting in silence way longer\r\n           than is comfortable, you turn. And\r\n           say \"I'd love to run a few numbers\r\n           for you. Is there somewhere more\r\n           comfortable we could sit.\" They\r\n           will almost always take you to the\r\n           dining room table and will offer\r\n           you something. And whatever it is\r\n           you always take the fancy option.\r\n                         \r\n<b>                          INSTRUCTOR\r\n</b>           Can I get you a coffee or tea?\r\n<b>                          ABEL\r\n</b>           A tea please.\r\n                         \r\n<b>                          INSTRUCTOR\r\n</b>           We have some homemade lemonade or a\r\n           soda.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'd love a lemonade, thank you.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Why?\r\n                         \r\n<b>                          ABEL\r\n</b>           Because, we are never going to be\r\n           the cheapest option, so we have to\r\n           be the best. And they want... no,\r\n           need... to feel that you want the\r\n           best too. That's why our trucks are\r\n           the newest or cleanest, and our\r\n           drivers are approachable.\r\n                         \r\n          Just then the woman who works behind the front desk (STANDARD\r\n          FRONT DESK) comes to the door.\r\n                         \r\n<b>           STANDARD FRONT DESK\r\n</b>           They need you.\r\n<b>                          39\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I gotta go, but the final point I\r\n           will make is the hardest one. Once\r\n           you have done the math and shown\r\n           them what we can save them over the\r\n           long haul through proper\r\n           maintenance, you need them to sign.\r\n           And the problem is by hiring you\r\n           that means they are firing someone\r\n           else. And that's never easy. So to\r\n           get them over the line you need to\r\n           close them. So when you show them\r\n           the number look up at them both...\r\n           and just stare at them...\r\n                         \r\n          ABEL begins staring at the recruits. He continues to stare.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You stare longer than you should.\r\n           Because this is not a joke. You\r\n           will only keep this job if you\r\n           close. And that's not funny to you.\r\n           And I am only interested in this\r\n           company growing, and when it isn't\r\n           I don't think it's funny at all.\r\n           These people work very hard for\r\n           their money and these other guys\r\n           are ripping them off, treating them\r\n           poorly, because they don't know...\r\n           so when you look them in the eye\r\n           you have to believe that we are\r\n           better, and we are, but you will\r\n           never do anything as hard as\r\n           staring a person straight in the\r\n           eye and telling the truth.\r\n                         \r\n          ABEL then does exactly that to them. And he holds it for a\r\n          long beat.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Well... it was great to meet you.\r\n           Welcome and I wish you luck.\r\n                         \r\n          ABEL walks out of the room and straight into.\r\n                         \r\n                         \r\n<b>          INT. LARGE STAFF MEETING ROOM - DAY\r\n</b>                         \r\n          There is a great high/low nature to the way ABEL runs the\r\n          company. While he wears great suits and his trucks are\r\n          impeccable, he does not waste money. So this room where the\r\n          drivers have company meetings is very basic.\r\n<b>                          40\r\n</b>                         \r\n                         \r\n          The room is filled with all of the drivers. There is a bit\r\n          of a nervous energy in the room. It quiets as ABEL comes in.\r\n          He stands aside.\r\n                         \r\n<b>           STANDARD FRONT DESK\r\n</b>           Trucks 16 through 23 you should be\r\n           ready to go...\r\n                         \r\n          As STANDARD FRONT DESK sees ABEL standing behind her, she\r\n          stops. ABEL walks forward a few steps.\r\n<b>                          ABEL\r\n</b>           Good morning. First off, I picked\r\n           up Julian yesterday and he is back\r\n           home and doing much better. And I\r\n           just wanted to make sure you are\r\n           all aware that we are doing\r\n           everything we can to deal with this\r\n           situation. We are working with law\r\n           enforcement, and they seem to be\r\n           closing in on these guys. But,\r\n           sadly these are the times we are\r\n           living in and we must rise above\r\n           them. So, on that front we have\r\n           these.\r\n          He puts one of the new radios on the dais. ANDREW comes into\r\n          the room behind ABEL and stands.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           These will be in every truck by the\r\n           end of the week. Much to my wife's\r\n           concern I spent some serious coin\r\n           and we now have our own closed\r\n           channel that shouldn't have any\r\n           blackout areas. You will always be\r\n           in contact with us.\r\n           (a hand goes up in the\r\n<b>                          BACK)\r\n</b>           Yes, Eddy.\r\n                         \r\n<b>           SENIOR DRIVER EDDY\r\n</b>           I have heard that the union is\r\n           considering recommending other more\r\n           active options for us to consider.\r\n           Do you know about this?\r\n                         \r\n          ABEL looks to ANDREW.\r\n                         \r\n<b>                          ABEL\r\n</b>           We have been in constant contact\r\n           with the union and they aren't\r\n           considering any new course of\r\n           action at this time.\r\n<b>                          41\r\n</b>                         \r\n                         \r\n<b>           SENIOR DRIVER EDDY\r\n</b>           So this radio is what we got?\r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n                         \r\n<b>          EXT. ABEL AND ANNA'S HOUSE - DAY\r\n</b>                         \r\n          ANNA is walking back from the mailbox looking through the\r\n          day's mail. As she approaches the house she looks up and sees\r\n          the two younger daughters, ELIZABETH (6 years old) and\r\n          CATHERINE (4 years old), playing in front of the house.\r\n          CATHERINE comes out from under a bush near the side door with\r\n          something in her hand.\r\n                         \r\n          ANNA looks back down at the mail. As she gets closer to the\r\n          house we see a look of concern come across her face. The look\r\n          then turns to one of complete horror but as she gets closer\r\n          to CATHERINE she tries to control her emotions.\r\n                         \r\n<b>                          ANNA\r\n</b>           Catherine... Catherine. Katie!\r\n                         \r\n          She drops the mail. And goes right up to her daughter.\r\n<b>                          CATHERINE\r\n</b>           Mommy.\r\n                         \r\n          As ANNA comes up to CATHERINE we now see that the little girl\r\n          is holding a large very real looking handgun in her little\r\n          hands. ANNA is besides herself.\r\n                         \r\n<b>                          ANNA\r\n</b>           Where did you get this? Catherine\r\n           where did you find this?\r\n                         \r\n<b>                          CATHERINE\r\n</b>           Right here.\r\n                         \r\n          The little girl points over towards the bushes near the side\r\n          door where LOUIS SERVIDIO was hiding and got hit the night\r\n          before.\r\n                         \r\n<b>                          ANNA\r\n</b>           Show me.\r\n                         \r\n          The little girl walks over to bushes and kneels down.\r\n                         \r\n<b>                          CATHERINE\r\n</b>           It was just sitting right here.\r\n                         \r\n          ANNA turns to the middle daughter, ELIZABETH.\r\n<b>                          42\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Did you see this?\r\n<b>                          ELIZABETH\r\n</b>           Yeah, she went under there to get\r\n           that ball and came out with it.\r\n                         \r\n<b>                          ANNA\r\n</b>           Maria!\r\n          ANNA yells towards in the house.\r\n                         \r\n<b>                          ELIZABETH\r\n</b>           What is it?\r\n                         \r\n          ANNA walks towards the front door to retrieve the NANNY\r\n<b>          MARIA.\r\n</b>                         \r\n<b>                          ANNA\r\n</b>           Maria!\r\n                         \r\n<b>                          ELIZABETH\r\n</b>           Mom, is it real?\r\n                         \r\n                         \r\n<b>          INT. ABEL'S OFFICE STANDARD HEATING OIL - DAY\r\n</b>          ABEL is sitting down at his desk. ANNA comes to the door. She\r\n          gets his attention and then walks right up to the desk. She\r\n          puts the handgun down right in front of him.\r\n                         \r\n<b>                          ABEL\r\n</b>           What is that?\r\n                         \r\n<b>                          ANNA\r\n</b>           A gun... It's a gun Abel.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where did you get it?\r\n                         \r\n<b>                          ANNA\r\n</b>           Your youngest daughter found it in\r\n           the bushes outside our front door.\r\n           She was playing with it.\r\n                         \r\n          ABEL is totally speechless.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           It's loaded... with the safety off.\r\n                         \r\n          This sits like a bomb in the room.\r\n<b>                          43\r\n</b>                         \r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           Those weren't kids looking to rip\r\n           off our TV Abel, that was a fucking\r\n           goon with a loaded gun looking in\r\n           our windows! What the hell is going\r\n           on here?\r\n                         \r\n<b>                          ABEL\r\n</b>           Let me see that. I'll take care of\r\n           this.\r\n<b>                          ANNA\r\n</b>           Damn right we will. Who is this?\r\n                         \r\n<b>                          ABEL\r\n</b>           I don't know, but I will take care\r\n           of it.\r\n                         \r\n<b>                          ANNA\r\n</b>           What does that mean you will take\r\n           care of it. This isn't a brick\r\n           through our car window or some\r\n           other cute little warning that I've\r\n           put up with in the past. This is\r\n           your daughter playing with a loaded\r\n           gun!\r\n          He turns back quickly. And stares at her.\r\n                         \r\n<b>                          ABEL\r\n</b><b>                          (YELLS)\r\n</b>           I know what it is!\r\n                         \r\n          He slowly walks back across the room and picks up the gun.\r\n          His hand shows a shake ever so slightly as he touches it.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Let me deal with this.\r\n                         \r\n<b>                          ANNA\r\n</b>           You better. Because you won't like\r\n           what's going to happen once I start\r\n           getting involved.\r\n                         \r\n          This causes him to stop in his tracks. He turns very\r\n          seriously.\r\n                         \r\n<b>                          ABEL\r\n</b>           You are not to tell your father\r\n           about this.\r\n                         \r\n          She looks back at him with a tinge of a smile.\r\n<b>                          44\r\n</b>                         \r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Do you hear me.\r\n          ANNA'S look changes and she understands.\r\n                         \r\n<b>                          ANNA\r\n</b>           ...I won't.\r\n                         \r\n          ANDREW comes to the door and knocks.\r\n<b>                          ANDREW WALSH\r\n</b>           Can I talk with you both?\r\n                         \r\n<b>                          ANNA\r\n</b>           I found a gun outside our front\r\n           door. Somebody left it there last\r\n           night.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Who?\r\n                         \r\n<b>                          ABEL\r\n</b>           I don't know.\r\n                         \r\n          ANNA looks over to ANDREW letting him know her disgust.\r\n<b>                          ANDREW WALSH\r\n</b>           Well...\r\n                         \r\n          He looks around then closes the door behind him and gets\r\n          their attention.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           It's not good... It's bad\r\n                         \r\n          He takes out a folder containing the formal indictment and\r\n          hands it to ABEL.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           It's a fourteen count indictment.\r\n           Most of it is crap. Piggyback\r\n           issues. But...\r\n                         \r\n          As ANDREW keeps talking, trucks go rumbling by behind them.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           The first three counts are where we\r\n           start to have real issues. They\r\n           know what's going on in this\r\n           industry. They say we are rigging\r\n           scales and under-reporting income.\r\n           We don't know what they have or how\r\n           they got it. But no matter how they\r\n           got it, it's a problem.\r\n<b>                          45\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           That truck just went out filthy.\r\n          ABEL looks out the window as a truck leaves the yard.\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel!\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           We are going to owe them some\r\n           money.\r\n                         \r\n          This brings him back.\r\n                         \r\n                         \r\n                         \r\n<b>                          ABEL\r\n</b>           How much?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           That depends on a bunch of factors.\r\n           But that's an accounting question.\r\n                         \r\n          They both look to ANNA\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           And there is one other thing. The\r\n           bank...\r\n                         \r\n          This hits ABEL.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           We need to sit down with them\r\n           immediately. I set a dinner. We\r\n           need you both there to lay\r\n           everything out and be totally up-\r\n           front. This shouldn't be a problem.\r\n           Lord knows they've given money to\r\n           bigger crooks than us. But I don't\r\n           want us hiding anything from them.\r\n                         \r\n          ABEL does not like this joke.\r\n                         \r\n<b>                          ABEL\r\n</b>           You need to get home and start\r\n           going through our set of books. How\r\n           far back are they going?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Seems like all the way back to when\r\n           you bought out Anna's father.\r\n                         \r\n<b>                          ANNA\r\n</b>           I'll get into it.\r\n<b>                          46\r\n</b>                         \r\n                         \r\n          He looks out the window and sees a Cadillac pull in..\r\n<b>                          ABEL\r\n</b>           What is O'Leary doing here?.\r\n                         \r\n          Abel looks to ANDREW.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           He's been wanting to talk to you\r\n           for days.\r\n<b>                          ABEL\r\n</b>           (under his breath)\r\n           Jesus.\r\n                         \r\n          ABEL gets up to go out. As ANDREW shuffles to leave ANNA\r\n<b>                         STOPS HIM:\r\n</b>                         \r\n<b>                          ANNA\r\n</b>           Andrew can I talk to you for a\r\n           minute.\r\n                         \r\n          ABEL leaves and they stay.\r\n                         \r\n                         \r\n<b>          EXT. STANDARD HEATING OIL YARD - DAY\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           How are you Bill?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I'm ok. Can't say I'm used to\r\n           making house calls like this\r\n           anymore though.\r\n                         \r\n<b>                          ABEL\r\n</b>           I would have come to see you.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           That's alright. You've got bigger\r\n           things to worry about. (Long pause)\r\n           So, I can't have this situation\r\n           with your guys continuing.\r\n                         \r\n<b>                          ABEL\r\n</b>           My guys.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Your drivers.\r\n<b>                          47\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Good. I would love you to help on\r\n           this. Because I can't have it going\r\n           on any longer either.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           So let them protect themselves,\r\n           that would stop all this very\r\n           quickly.\r\n<b>                          ABEL\r\n</b>           I respectfully disagree.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           They are picking on your men\r\n           because they are just sitting\r\n           there... weak.\r\n                         \r\n<b>                          ABEL\r\n</b>           They are taking shots at me because\r\n           I am growing, expanding, getting\r\n           stronger not weaker.\r\n                         \r\n          This frustrates Bill because he knows ABEL is right. He tries\r\n          a new tack.\r\n<b>                          BILL O'LEARY\r\n</b>           It's quite simple for me: I can't\r\n           have my drivers getting hit like\r\n           this. It looks like I can't protect\r\n           them.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well, it appears that you can't.\r\n                         \r\n          This is a little too sharp for the head of the NYC teamster's\r\n          taste.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I can. And will. Because of all my\r\n           job descriptions that is the one I\r\n           consider most sacred.\r\n                         \r\n<b>                          ABEL\r\n</b>           I agree. But these are truck\r\n           drivers, not soldiers, this will\r\n           lead to chaos.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           It will stop immediately.\r\n                         \r\n<b>                          ABEL\r\n</b>           No, it won't.\r\n<b>                          48\r\n</b>                         \r\n                         \r\n          He resets, again.\r\n<b>                          BILL O'LEARY\r\n</b>           You seem to be under pressure from\r\n           many sides right now... which I\r\n           understand. Trust me I understand.\r\n           So let me think this through. But\r\n           whatever decision I make on this,\r\n           it stands. Those men show up every\r\n           morning for you because I tell them\r\n           to. It's important for you to\r\n           realize that these are very\r\n           dangerous times, and we need to\r\n           adapt. It's not like when we were\r\n           driving.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Sometimes the weak man is the\r\n           stronger man if he has the right\r\n           tools.\r\n                         \r\n<b>                          ABEL\r\n</b>           It may seem that way... but if you\r\n           are weak eventually it will show...\r\n           it always does. And if you want\r\n           this to all be behind us, help me\r\n           find out who is doing this. You\r\n           know a lot of people, and that\r\n           would be the most help to me.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           It's not always as simple as it\r\n           appears.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm sure that's true.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           It is... well, I got to get going.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you for coming Bill.\r\n                         \r\n                         \r\n<b>          EXT. GATE AT STANDARD HEATING OIL - DAY\r\n</b>                         \r\n          O'LEARY walks over to ANDREW as he is getting in his car.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           How did that go?\r\n<b>                          49\r\n</b>                         \r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Not well.\r\n<b>                          ANDREW WALSH\r\n</b>           He feels very strongly about this.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I can see that.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I don't think he fully understands\r\n           it.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           What's to understand?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           It's illegal.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           It's not illegal if I say it isn't.\r\n           My responsibility is to provide\r\n           safe and timely passage of goods\r\n           and products into and around this\r\n           city. And because of this situation\r\n           it is appearing to those whose\r\n           opinions I care about that I can't\r\n           do my job. That can not and will\r\n           not continue.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I understand.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           So talk to him. You need to protect\r\n           yourself. This is very serious.\r\n           Just know that.\r\n                         \r\n          ANDREW thinks this through.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           How would this work?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           What does that mean?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I guess I'm not even sure exactly\r\n           what you are suggesting.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Are you kidding me with this?\r\n<b>                          50\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           No.\r\n<b>                          BILL O'LEARY\r\n</b>           Every driver in your fleet gets a\r\n           handgun.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           And a permit?\r\n          O'LEARY nods yes.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           When?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           By Friday.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Are the permits legit?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           That depends what they do with it.\r\n           If they kill their wife with them,\r\n           then no. Then that is a very fake\r\n           permit, and I'll walk away very\r\n           quickly. But they just need to show\r\n           that they are defending themselves,\r\n           and this will stop.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Who is it?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I don't fucking know...\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'll talk to him.\r\n                         \r\n                         \r\n<b>          INT. MORALES' GARAGE - DAY\r\n</b>                         \r\n          ANNA is struggling through the boxes in the garage. She moves\r\n          some things and then finds what she is looking for. A pile of\r\n          about nine matching file boxes that are all labeled the same.\r\n          It is their off the books bookkeeping.\r\n                         \r\n                         \r\n<b>          INT. STUDY/LIBRARY OF THE NEW HOUSE - DAY\r\n</b>                         \r\n          The library is filled with custom made bookshelves that are\r\n          still waiting to be filled. There is a large desk sitting in\r\n          the corner that hasn't been fully unpacked yet.\r\n<b>                          51\r\n</b>                         \r\n                         \r\n          ANNA comes in struggling carrying the file boxes from the\r\n          garage, she piles them on the desk.\r\n          She looks around her feet at the pile, it's literally the\r\n          skeletons from her closet. She resets, walks over to the\r\n          window to look out over her new beautiful home. Then she\r\n          turns back at the pile of boxes that hold their past and\r\n          their future.\r\n                         \r\n<b>          EXT. LONG SUBURBAN DRIVEWAY - DAY\r\n</b>                         \r\n          A Standard Oil DRIVER steers his truck down the driveway. As\r\n          he approaches the end he sees a massive bulk oil truck of one\r\n          of their competitors parked blocking the exit of the\r\n          driveway. He stops his truck and gets out warily. He looks\r\n          around. No one is in the cab of the truck. But he sees a\r\n          small note taped to the window. It reads: \"Engine trouble,\r\n          back later... Fuck you.\"\r\n                         \r\n                         \r\n<b>          INT. STUDY/LIBRARY OF THE NEW HOUSE\r\n</b>                         \r\n          The phone starts ringing. ANNA gets up from her work and\r\n          answers it. We stay on her as she gets the news.\r\n<b>                          ANNA\r\n</b>           He's not here.\r\n                         \r\n          Her face fills with building anger as she hears.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           Okay. I will.\r\n                         \r\n          ANNA hangs up the phone and walks over to the window and\r\n          looks out and over at the other main wing of her new\r\n          beautiful home. Then she turns back and looks at the pile of\r\n          boxes that hold their past and their future.\r\n                         \r\n                         \r\n<b>          EXT. GATE AT STANDARD HEATING OIL\r\n</b>                         \r\n          O'LEARY walks over to ANDREW as he is getting in his car.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           How did that go?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Not well.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           He feels very strongly about this.\r\n<b>                          52\r\n</b>                         \r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I can see that.\r\n<b>                          ANDREW WALSH\r\n</b>           I don't think he fully understands\r\n           it.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           What's to understand?\r\n<b>                          ANDREW WALSH\r\n</b>           It's illegal.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           It's not illegal if I say it isn't.\r\n                         \r\n          This takes ANDREW back a step.\r\n                         \r\n<b>           BILL O'LEARY (CONT'D)\r\n</b>           My responsibility is to provide\r\n           safe and timely passage of goods\r\n           and products into and around this\r\n           city. And because of this situation\r\n           it is appearing to those whose\r\n           opinions I am concerned with, that\r\n           I can't do that right now. That can\r\n           not and will not continue.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I understand.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           So talk to him. You need to protect\r\n           yourself. As a company.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I will try to talk with him.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           This is very serious. Just know\r\n           that.\r\n                         \r\n          ANDREW WALSH thinks this through.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           How would this work?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           What does that mean?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I guess I'm not even sure exactly\r\n           what you are suggesting.\r\n<b>                          53\r\n</b>                         \r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Are you kidding me with this?\r\n<b>                          ANDREW WALSH\r\n</b>           No.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Every driver in your fleet gets a\r\n           handgun.\r\n<b>                          ANDREW WALSH\r\n</b>           And a permit?\r\n                         \r\n          O'LEARY nods yes.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           When?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           By Friday.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Are the permits legit?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           That depends what they do with it.\r\n           If they kill their wife with them,\r\n           then no. Then that is a very fake\r\n           permit, and I'll walk away very\r\n           quickly. But they just need to show\r\n           that they are defending themselves,\r\n           and this will stop.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Who is it?\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           I don't fucking know...\r\n                         \r\n                         \r\n<b>          INT. ABEL'S OFFICE - LATER\r\n</b>                         \r\n          ANDREW comes to the door. ABEL is staring out the window but\r\n          looks up as ANDREW sits down.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           They just got another truck.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Who was driving?\r\n<b>                          54\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Leo.\r\n<b>                          ANDREW WALSH\r\n</b>           Is he alright?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           The drivers' security aside... this\r\n           shit is starting to have a very\r\n           significant financial effect on us\r\n           here. It can't continue.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           How was your talk? (nothing)\r\n           I spoke with him after. He's going\r\n           to keep going `til he gets the\r\n           answer he's looking for.\r\n                         \r\n<b>                          ABEL\r\n</b>           I said I wouldn't do it.\r\n          They sit for a long beat.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'm not sure we are in a position\r\n           to say that.\r\n                         \r\n<b>                          ABEL\r\n</b>           What's that?\r\n                         \r\n          ANDREW looks around. He's getting paranoid.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Do you want to go for a walk?\r\n                         \r\n<b>                          ABEL\r\n</b>           Are you really serious with this,\r\n           this is what it's come to, walking\r\n           around outside like fucking\r\n           gangsters?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I am and it is.\r\n<b>                          55\r\n</b>                         \r\n                         \r\n<b>          EXT. STANDARD HEATING OIL TRUCK - DAY\r\n</b>          Throughout this conversation ABEL is walking over to a\r\n          section of the yard where WORKERS are loading some sort of\r\n          additive chemical to the fuel trucks.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           It is looking like we must do this.\r\n                         \r\n<b>                          ABEL\r\n</b>           I must?\r\n                         \r\n          This gets a little personal.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           They will shut you down.\r\n                         \r\n<b>                          ABEL\r\n</b>           These men, they work for me. These\r\n           trucks they drive, the customers\r\n           they serve. They are here because\r\n           we built this.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           That's true, until its not. And the\r\n           last person in the world right now\r\n           that we need working against us is\r\n           the president of the fucking\r\n           teamsters. This company is out of\r\n           business in a month if he gets\r\n           these guys to walk. We are running\r\n           out of cash.\r\n                         \r\n<b>                          ABEL\r\n</b>           What are you even talking about\r\n           here?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           The union provides a handgun and a\r\n           permit to every one of the drivers.\r\n           And they think this whole thing is\r\n           over in a week.\r\n                         \r\n<b>                          ABEL\r\n</b>           These men are fucking truck\r\n           drivers. This is insane. You know\r\n           who is gonna get it in the end\r\n           here, me. This comes back to me.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           It does either way.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm not doing it.\r\n<b>                          56\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Would you put everything at risk to\r\n           stand by that.\r\n                         \r\n          ABEL thinks this through.\r\n                         \r\n<b>                          ABEL\r\n</b>           It will be the end of everything I\r\n           have worked for. If one of these\r\n           guys shoots somebody it's me they\r\n           will bring down for it...I'll talk\r\n           to him... And we need to close this\r\n           deal. We can't stay like this any\r\n           longer. We must close on that\r\n           property... We are so weak right\r\n           now.\r\n                         \r\n          They are now standing on top of one of the trucks tanks as a\r\n          worker pours the additive into the tank. The container says\r\n          \"GREEN DYE #7\" on it. ABEL looks down as it flows in.\r\n                         \r\n          He stands up and looks out across the fence at the container\r\n          property.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Why do you want this so badly?\r\n<b>                          ABEL\r\n</b>           Because I have my entire savings at\r\n           risk with this deposit. It is\r\n           everything.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           That's not what I mean. Why did you\r\n           want it so badly in the first\r\n           place? It was a risk... always.\r\n                         \r\n          ABEL thinks this through.\r\n                         \r\n<b>                          ABEL\r\n</b>           I don't know.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           You don't know? Have you ever\r\n           thought about it?\r\n                         \r\n<b>                          ABEL\r\n</b>           I've thought about it every day for\r\n           the last five years. This place was\r\n           sitting over that fence mocking....\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I didn't mean have you ever thought\r\n           about that place...\r\n<b>                          (MORE)\r\n</b><b>                          57\r\n</b>                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           I mean have you ever thought why\r\n           you want it so badly?\r\n<b>                          ABEL\r\n</b>           I don't know what you mean.\r\n                         \r\n          ABEL looks to him in a sincere way wanting him to answer but\r\n          ANDREW just waits. Finally.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I know what you are asking and\r\n           no... I never ask myself why I do\r\n           this. It just feels right...\r\n           wanting to be bigger feels better.\r\n           It feels right.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           That's very simple.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes...\r\n                         \r\n          With this he gives him a deadly serious look.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           ...It is.\r\n<b>                          ANDREW WALSH\r\n</b>           You take these risks...\r\n                         \r\n<b>                          ABEL\r\n</b>           Only when necessary.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           We have to get going, we need them\r\n           to show up.\r\n                         \r\n                         \r\n<b>          INT. WHITE TABLECLOTH RESTAURANT - NIGHT\r\n</b>                         \r\n          ANNA leads the boys to the table, and we see a whole new side\r\n          to her. She is going to get this done. As they approach the\r\n          table we see two BANKERS stand to greet them. The Bank\r\n          President, ARTHUR LEWIS, and Bank VP IAN THOMPSON.\r\n                         \r\n<b>                          ANNA\r\n</b>           Arthur.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Anna, you look amazing as always.\r\n                         \r\n<b>                          ANNA\r\n</b>           Thank you.\r\n<b>                          58\r\n</b>                         \r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Gentlemen. Do you know Ian\r\n           Thompson? One of our new VP's.\r\n                         \r\n<b>                          ANNA\r\n</b>           Ian.\r\n                         \r\n          They all shake hands and sit. The WAITER comes over.\r\n                         \r\n<b>                          WAITER\r\n</b>           So what can I get you to drink?\r\n                         \r\n<b>                          ABEL\r\n</b>           A lot.\r\n                         \r\n          Awkward laughter.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           A wine list please.\r\n                         \r\n<b>                          WAITER\r\n</b>           I'll be right back.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           So how are you?\r\n<b>                          ABEL\r\n</b>           We've been better... but we are\r\n           good.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Yes I heard about that... if you\r\n           stay in business long enough it's\r\n           bound to happen eventually.\r\n                         \r\n<b>                          ANNA\r\n</b>           Well that's exactly right. And we\r\n           wanted to sit down with you tonight\r\n           to make sure we were being totally\r\n           up-front with everything that is\r\n           going on and make sure that you\r\n           understand the nature of the\r\n           complaints and are comfortable that\r\n           it is not going to affect our\r\n           business in an adverse way.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Did you have a chance to look over\r\n           the outline that I sent over?\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Yes, we did.\r\n<b>                          59\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Hopefully it made clear that even\r\n           in a worst case situation we will\r\n           pay off any and all fines and be\r\n           able to move forward with very\r\n           comfortable capital on hand.\r\n                         \r\n          ABEL jumps in taking some offense.\r\n                         \r\n<b>                          ABEL\r\n</b>           But you should know Arthur that\r\n           this man has been digging through\r\n           our industry for over two years\r\n           looking for anything he can find.\r\n           And as you know probably better\r\n           than anyone, having worked with\r\n           some of our competitors the thought\r\n           that he would have singled us out\r\n           is ridiculous. It reeks of\r\n           everything that is wrong with this\r\n           city right now. We run a fair and\r\n           clean business and follow every\r\n           standard industry practice and I\r\n           will fight `til my last day to\r\n           prove that...\r\n          This silences the table for a long beat.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           But... but...\r\n                         \r\n          ABEL holds up his finger and points at ARTHUR across the\r\n          table to make his point.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           ...Don't think for a moment that I\r\n           am going to allow this mess to\r\n           interfere with our plan to grow. We\r\n           need to know you are standing by\r\n           us.\r\n                         \r\n<b>           BANK VP IAN THOMPSON\r\n</b>           Yes, what is it with this piece of\r\n           property that you find so integral\r\n           or that can't be put off `til after\r\n           this legal matter is dealt with?\r\n                         \r\n          ABEL is a little taken aback by this comment. It goes against\r\n          everything that comes naturally to him as a person. ANNA and\r\n          ANDREW know this and are concerned he might go off.\r\n                         \r\n          ABEL thinks it through.\r\n<b>                          60\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           That's a very good question. This\r\n           property gives us many things...\r\n           firstly direct access to the river.\r\n           So I can bring in fuel directly\r\n           from any provider in the world\r\n           straight to my tanks, then it has\r\n           over 10 million gallons of storage\r\n           capacity, so I can buy in the\r\n           summers when my price is low and\r\n           sell to my customers and most\r\n           importantly some of my competitors\r\n           when the price is high. I won't\r\n           just drive trucks anymore... I will\r\n           control my fate... but the real\r\n           answer to your question...\r\n                         \r\n          Now ABEL stares right at IAN THOMPSON.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           ... is that when it feels scary to\r\n           jump Ian... that is exactly when\r\n           you must jump... or you risk ending\r\n           up staying in the same place your\r\n           whole life... and that I can't do.\r\n          IAN THOMPSON awkwardly laughs a bit as ABEL just stays deadly\r\n          serious staring right at him. Finally.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           We've always been there with you\r\n           and know that we will continue to\r\n           be.\r\n                         \r\n                         \r\n<b>          INT. ABEL'S CAR - NIGHT\r\n</b>                         \r\n          ABEL is driving, and ANNA sits in silence looking out the\r\n          passenger window. They are heading along the main backwoods\r\n          road to their house.\r\n                         \r\n<b>                          ANNA\r\n</b>           Well, that went about as well as\r\n           could be expected.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes. Arthur is a good man.\r\n                         \r\n<b>                          ANNA\r\n</b>           Do you think they will close?\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course.\r\n<b>                          61\r\n</b>                         \r\n                         \r\n          Just as he says this a deer comes running out in front of\r\n          them. ABEL tries to slam on the brakes but isn't able to stop\r\n          in time. The car hits the deer and it careens over the\r\n          windshield and on to the road behind the car.\r\n                         \r\n          He continues to slam on the brakes and comes to a complete\r\n          stop.\r\n                         \r\n          They both catch their breath and look around to make sure\r\n          they are both okay. Then they look back at the deer. It is\r\n          laying on the road but is still breathing.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Are you okay?\r\n                         \r\n<b>                          ANNA\r\n</b>           Yes... you need to go put it out of\r\n           its misery.\r\n                         \r\n<b>                          ABEL\r\n</b>           Jesus.\r\n                         \r\n<b>                          ANNA\r\n</b>           I mean it. We can't just leave it\r\n           here.\r\n                         \r\n<b>          EXT. BACKWOODS ROAD - NIGHT\r\n</b>                         \r\n          ABEL gets out of the car and looks at his smashed hood. He\r\n          then walks back and approaches the animal. It is laying on\r\n          the side of the road.\r\n                         \r\n          He comes right up to it and stares into its eyes. It stares\r\n          back at him. ABEL walks back to the car.\r\n                         \r\n<b>                          ANNA\r\n</b>           Is it dead?\r\n                         \r\n<b>                          ABEL\r\n</b>           No.\r\n                         \r\n<b>                          ANNA\r\n</b>           Well you need...\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n          He reaches down to open the trunk.\r\n                         \r\n<b>                          ANNA\r\n</b>           What are you doing?\r\n<b>                          62\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Getting the tire iron!\r\n          This whole situation has stressed them out and they are on\r\n          edge.\r\n                         \r\n          ABEL goes to the trunk and gets out the large wrench. He\r\n          walks back over to the deer. He bends down next to it and\r\n          stares into its eye again. ABEL is thinking back on\r\n          something, or many things.\r\n          He makes a small starting movement like he is going to hit it\r\n          over the head but he stops himself. He can't quite do it.\r\n          Then he sits with the animal a beat longer.\r\n                         \r\n          We come in very close to ABEL and see his hand is struggling\r\n          to deliver the blow. Just as he grips the tire iron\r\n          waiting... BANG! BANG!\r\n                         \r\n          Two very loud GUNSHOTS go off from right over his shoulder.\r\n          He ducks for cover then slowly turns behind him. ANNA stands\r\n          there holding a small-yet-powerful Saturday Night Special-\r\n          style handgun. Smoke is still rising from the end of the\r\n          pistol. The deer is dead.\r\n                         \r\n          He looks at her dumbfounded... where did she get this gun?\r\n          She gives him a look. Then turns and walks back to the car.\r\n          He stays and struggles to get the deer out of the road.\r\n                         \r\n                         \r\n<b>          INT. ABEL'S DAMAGED CAR - NIGHT\r\n</b>                         \r\n          ANNA is sitting in the car waiting. We hear ABEL'S footsteps\r\n          as he approaches the open driver's side door. He gets in\r\n          without saying a word. We stay with them as they drive on in\r\n          silence.\r\n                         \r\n                         \r\n<b>          INT. MORALES HOUSE, FRONT HALLWAY - NIGHT\r\n</b>                         \r\n          The door opens and ABEL walks in. ANNA is already in the\r\n          house talking with NANNY MARIA who's been baby-sitting.\r\n                         \r\n<b>                          ANNA\r\n</b>           Hello Maria, sorry we are a bit\r\n           late. They were fine?\r\n                         \r\n<b>                          NANNY MARIA\r\n</b>           Oh yes. All is good.\r\n                         \r\n<b>                          ANNA\r\n</b>           Great, thank you. We'll see you in\r\n           the morning then.\r\n<b>                          63\r\n</b>                         \r\n                         \r\n<b>                          NANNY MARIA\r\n</b>           Okay.\r\n          NANNY MARIA comes around the corner and passes ABEL who is\r\n          just standing in the living room. He only gives her a nod.\r\n          ANNA is standing on the other side of the room just waiting\r\n          in silence as well. NANNY MARIA goes over to the closet and\r\n          gets her coat out and puts it on. The tension is building\r\n          like a kettle. Finally NANNY MARIA gets herself together and\r\n          walks out and as the door shuts they come immediately at each\r\n          other.\r\n                         \r\n<b>                          ANNA\r\n</b>           What?\r\n                         \r\n<b>                          ABEL\r\n</b>           What?\r\n                         \r\n<b>                          ANNA\r\n</b>           Yes... what?\r\n                         \r\n<b>                          ABEL\r\n</b>           Are you kidding?\r\n                         \r\n<b>                          ANNA\r\n</b>           No.\r\n<b>                          ABEL\r\n</b>           Okay then... what is this gun?\r\n                         \r\n<b>                          ANNA\r\n</b>           I told you I wasn't going to just\r\n           continue to stand around and let\r\n           these people come and get me and my\r\n           children. So unlike you who seems\r\n           to be totally comfortable just\r\n           standing around like some...\r\n           fucking pussy... I did something\r\n           about it.\r\n                         \r\n          ABEL is slightly stammering at this point, not quite sure\r\n          what to do. They are still standing on opposite sides of the\r\n          room from each other. He just waits... finally.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where did you get it?\r\n                         \r\n<b>                          ANNA\r\n</b>           You know where I got it.\r\n                         \r\n<b>                          ABEL\r\n</b>           Do you have a permit?\r\n<b>                          64\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Not yet.\r\n          This sets him off. He comes walking across the room at her as\r\n          if he might hit her. He gets closer and closer.\r\n                         \r\n<b>                          ABEL\r\n</b>           You must be a bigger fucking idiot\r\n           than I even thought. You are trying\r\n           to protect your children? Protect\r\n           them? Do you have any idea what\r\n           happens if you get caught using\r\n           that thing?\r\n                         \r\n          He is now standing right over her.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You dress yourself up in these\r\n           fancy clothes, and look at you here\r\n           in your mansion. I've given you\r\n           everything you could possibly want\r\n           but you still can't stop thinking\r\n           like the Brooklyn corner-store\r\n           gangster's daughter that you are.\r\n                         \r\n<b>                          ANNA\r\n</b>           You've given me? You? Are you\r\n           delusional? Do you even understand\r\n           how ridiculous that makes you\r\n           sound?\r\n                         \r\n          They are really going at it now. He tries to grab her purse,\r\n          which she still has over her shoulder. They struggle for it.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where is this thing? Let me see it.\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel.\r\n                         \r\n<b>                          ABEL\r\n</b>           Let me see it. Is this going to\r\n           make you safe?\r\n                         \r\n          With that he uses brute force, probably hurting her arm, but\r\n          she doesn't let on. He takes the purse from her. He opens it\r\n          and takes out the small gun.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           You know who uses guns like this?\r\n<b>                          (HE SCREAMS)\r\n</b>           Whores!\r\n<b>                          65\r\n</b>                         \r\n                         \r\n          With that, she SLAPS him across the face. They just stare at\r\n          each other for a very long time.\r\n<b>                          ABEL (CONT'D)\r\n</b>           It's a trap... and you are walking\r\n           right into it... You need to get\r\n           that thing out of our house.\r\n                         \r\n<b>                          ANNA\r\n</b>           You need to protect us.\r\n<b>                          ABEL\r\n</b>           That is what I'm doing.\r\n                         \r\n          He walks out the front door.\r\n                         \r\n                         \r\n<b>          INT. MAIN LIVING/DINING ROOM OF MORALES HOUSE - NEXT DAY\r\n</b>                         \r\n          There are twelve SEVEN-YEAR-OLDS sitting around the dining\r\n          room table yelling \"Happy Birthday\" to one of the Morales\r\n          daughters as she blows out the candles. A large GROUP of the\r\n          PARENTS surround the table.\r\n                         \r\n<b>                          GROUP\r\n</b>           Happy Birthday!\r\n          Just as ELIZABETH blows out the candles the doorbell rings.\r\n          NANNY MARIA heads to the front door. The camera stays with\r\n          the party. NANNY MARIA comes back into the room and standing\r\n          behind her, we see a POLICE OFFICER holding some kind of\r\n          clipboard.\r\n                         \r\n          ABEL walks over quickly trying not to create a scene. He\r\n          leads the POLICE OFFICER back over to the front door. The\r\n          PARENTS certainly notice and start stirring.\r\n                         \r\n                         \r\n<b>          EXT. FRONT STEPS - DAY\r\n</b>                         \r\n          ABEL leads the OFFICER outside, and as he looks up he sees\r\n          that his driveway is packed with four police cars, some\r\n          unmarked and there are about five OFFICERS waiting to come\r\n          into the house.\r\n                         \r\n<b>                          ABEL\r\n</b>           I understand. But as you can see\r\n           this is a terrible time for us. I\r\n           am having my daughter's birthday\r\n           party.\r\n                         \r\n          ABEL is trying to remain calm and not lose his temper.\r\n<b>                          66\r\n</b>                         \r\n                         \r\n<b>                          POLICE OFFICER\r\n</b>           I understand and I apologize, I do.\r\n           But this is a warrant and we need\r\n           to gain complete access to the\r\n           property.\r\n                         \r\n          They stare at each other just as ANNA comes to the door. She\r\n          sees the scene in her driveway.\r\n                         \r\n<b>                          ANNA\r\n</b>           What is this?\r\n                         \r\n<b>                          POLICE OFFICER\r\n</b>           Let me go check something.\r\n                         \r\n<b>                          ANNA\r\n</b>           Are they serious?\r\n                         \r\n          ABEL is seething and can only manage a slight nod.\r\n                         \r\n          As they look across the driveway they see the OFFICER talking\r\n          to someone. The officer shifts out of the way and they see he\r\n          is talking to ASSISTANT D.A. LAWRENCE.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm going to kill this guy.\r\n<b>                          ANNA\r\n</b>           Abel.\r\n                         \r\n          ANNA is trying to get his attention quietly.\r\n                         \r\n<b>                          ABEL\r\n</b>           Abel.\r\n                         \r\n          He turns and they look at each other. She signals towards the\r\n          library and they share a knowing, concerned glance.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Give me five minutes.\r\n                         \r\n          She nods and heads down the path towards the police and\r\n          LAWRENCE. Abel heads back in the doorway.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Maria. Keep the kids playing for a\r\n           few minutes.\r\n                         \r\n          ANNA walks up to the LAWRENCE.\r\n                         \r\n<b>                          ANNA\r\n</b>           Mr. Lawrence is it?\r\n<b>                          67\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Yes.\r\n<b>                          ANNA\r\n</b>           Anna Morales.\r\n                         \r\n          She reaches out her hand to shake his with a smile.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           May I speak with you for a minute.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           (thinks, then)\r\n           Yeah.\r\n                         \r\n          They walk away from the others down the driveway a stretch.\r\n                         \r\n<b>                          ANNA\r\n</b>           I understand you and your men have\r\n           a job to do here. But we are in the\r\n           middle of a seven-year-old's\r\n           birthday party.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I understand, and I'm sorry. But we\r\n           are coming in.\r\n          She turns a little on him.\r\n                         \r\n<b>                          ANNA\r\n</b>           That's not a problem, as we have\r\n           nothing to hide from you. It's just\r\n           that, we recently moved to this\r\n           area, and there are twenty guests\r\n           in our house... please... can you\r\n           give me five minutes so we can ask\r\n           everyone to leave calmly before you\r\n           come into my home?\r\n                         \r\n          He thinks this through.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           You can get them out of the house.\r\n                         \r\n<b>                          ANNA\r\n</b>           Thank you.\r\n                         \r\n                         \r\n<b>          INT./EXT. HALLWAY OUTSIDE STUDY/DECK\r\n</b>                         \r\n          ABEL comes down the hall carrying file boxes and brings them\r\n          out onto the deck. ANNA comes out onto the deck as he is\r\n          looking over the edge.\r\n<b>                          68\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Where are you going?\r\n<b>                          ABEL\r\n</b>           Bring the last few out.\r\n                         \r\n<b>                          ANNA\r\n</b>           You've got three minutes.\r\n                         \r\n<b>                          ABEL\r\n</b>           What's going on out there.\r\n                         \r\n<b>                          ANNA\r\n</b>           Our guests are leaving.\r\n                         \r\n          ABEL tries to speak but can only shake his head. Finally he\r\n          jumps over the edge and she starts handing boxes down to him.\r\n          He then stops again.\r\n                         \r\n<b>                          ABEL\r\n</b>           Do we even need to be doing this?\r\n           What exactly are we hiding here?\r\n                         \r\n          She thinks this through.\r\n                         \r\n<b>                          ANNA\r\n</b>           I don't want them going through all\r\n           this before I've had a chance to.\r\n                         \r\n                         \r\n<b>          EXT. GROUND BELOW DECK\r\n</b>                         \r\n          The camera is now on the ground level with ABEL.\r\n                         \r\n<b>                          ABEL\r\n</b>           Is that the last one. Get back out\r\n           there.\r\n                         \r\n          ABEL looks around for a place to stash them.\r\n                         \r\n                         \r\n<b>          EXT. WOODS - DAY\r\n</b>                         \r\n          ABEL exhales then takes three of the boxes and sneaks off\r\n          into the woods. We follow him as he struggles. Finally he\r\n          gets to a small clearing and starts to stack them.\r\n                         \r\n                         \r\n<b>          EXT. FRONT LAWN - DAY\r\n</b>                         \r\n          ANNA is standing out front trying to hand out goody bags and\r\n          to maintain pleasantries with the parents as they leave.\r\n<b>                          69\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           Thank you for coming. Here you go.\r\n           Bye, Rebecca. Thanks. I'm sorry.\r\n           Bye.\r\n                         \r\n          When the last one goes she looks up at the ASST. DA to give\r\n          him the all-clear. But as she does she gives him a look that\r\n          could kill. The police file into the house in front of her.\r\n                         \r\n<b>          EXT. UNDERNEATH THE DECK - DAY\r\n</b>                         \r\n          ABEL has placed the load of file boxes underneath the deck\r\n          and is putting the last one in place. He sits down on the\r\n          pile and looks out into the woods in sadness.\r\n                         \r\n                         \r\n<b>          INT. MAIN LIVING/DINING ROOM OF MORALES HOUSE\r\n</b>                         \r\n          ANNA is looking around the house as the cops search through\r\n          everything. She seems oddly calm. She decides that they are\r\n          being respectful and heads out into the driveway.\r\n                         \r\n                         \r\n<b>          EXT. DRIVEWAY\r\n</b>          ANNA walks outside and stands, waiting. LAWRENCE comes out of\r\n          the house and stands near her. They wait.\r\n                         \r\n<b>                          ANNA\r\n</b>           This is probably one that you are\r\n           going to regret.\r\n                         \r\n          LAWRENCE looks at her trying to figure her out.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Excuse me?\r\n                         \r\n<b>                          ANNA\r\n</b>           My husband is a very honorable man.\r\n           Coming on a Saturday? It's very\r\n           aggressive.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           This is standard.\r\n                         \r\n<b>                          ANNA\r\n</b>           Really? I know you think you are\r\n           just doing your job. But we are not\r\n           what you think we are. And you have\r\n           embarrassed him in front of his\r\n           family and friends.\r\n                         \r\n          She gives him a long, almost scary look.\r\n<b>                          70\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I think I know your father.\r\n<b>                          ANNA\r\n</b>           Good for you. My husband is not my\r\n           father. Not even close. So if I\r\n           were you I would start treating us\r\n           with a little more respect or he'll\r\n           make it our only mission to ruin\r\n           you. This was very disrespectful...\r\n           and you are not going to find a\r\n           fucking thing.\r\n                         \r\n          With that she walks back towards the house as the POLICE\r\n          start filing out.\r\n                         \r\n                         \r\n<b>          INT. ABEL'S OFFICE - MORNING\r\n</b>                         \r\n          ABEL is sitting at his desk looking out the window as the\r\n          trucks come and go. As he looks across the lot he sees JULIAN\r\n          coming walking across towards the locker room. A smile\r\n          crosses ABEL'S face.\r\n                         \r\n                         \r\n<b>          INT. STANDARD HEATING OIL HALLWAY - CONTINUOUS\r\n</b>          As ABEL comes out into the hallway SALES STUDENT ALEX is\r\n          walking by his door. ABEL stops to check in.\r\n                         \r\n<b>                          ABEL\r\n</b>           Hey, how are you?\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Good. A bit nervous. I'm heading\r\n           out on my first calls alone today.\r\n                         \r\n<b>                          ABEL\r\n</b>           You'll do great. Remember... When\r\n           you get them there. Hold the eye\r\n           contact longer than you would\r\n           like... but you watch what happens.\r\n                         \r\n          He gives him a big smile and a pat on the back and sends him\r\n          on his way.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Good luck.\r\n                         \r\n                         \r\n<b>          INT. DRIVER LOCKER ROOM- DAY\r\n</b>                         \r\n          ABEL comes into the room and JULIAN is getting ready.\r\n<b>                          71\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           It is good to see you back here.\r\n           You look good.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Thank you.\r\n                         \r\n          JULIAN is very quiet and timid. He is missing a spark.\r\n                         \r\n<b>                          ABEL\r\n</b>           Are you ready to get back to work?\r\n                         \r\n<b>                          JULIAN\r\n</b>           I think so.\r\n                         \r\n<b>                          ABEL\r\n</b>           You are.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Thank you.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where are you heading?\r\n                         \r\n<b>                          JULIAN\r\n</b>           Bulk delivery to Chase.\r\n<b>                          ABEL\r\n</b>           Manhattan. That's a cakewalk.\r\n                         \r\n          JULIAN does not agree. ABEL can no longer ignore his young\r\n          protege's concern.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I feel very vulnerable.\r\n                         \r\n          ABEL jumps on this.\r\n                         \r\n<b>                          ABEL\r\n</b>           Good... Because you are. We all\r\n           are. Someone came to my house a\r\n           couple nights ago to rob me...\r\n                         \r\n          A large truck rumbles by and they wait for silence to return.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I tried to chase them away... but\r\n           really there's nothing I can do. I\r\n           am vulnerable. We all are. They can\r\n           come back tonight. But to succeed\r\n           and be great you must keep going\r\n           back. And I know what all these\r\n           guys want to be doing. But it\r\n           doesn't make you any safer.\r\n<b>                          (MORE)\r\n</b><b>                          72\r\n</b>                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           And then they will come after me\r\n           with everything they have... So\r\n           this is what we do. And the times\r\n           will get better and safer. They\r\n           will. So go. You are strong just by\r\n           going. Stronger in fact.\r\n                         \r\n          JULIAN looks down at the ground, shuffles a foot, then climbs\r\n          into the waiting truck.\r\n                         \r\n<b>          EXT. FRONT PORCH SMALL OF HOUSE IN OZONE PARK - DAY\r\n</b>                         \r\n          SALES STUDENT ALEX gets out of his car and walks up to the\r\n          front door. He is nervous. He builds the courage and finally\r\n          rings the doorbell. He waits.\r\n                         \r\n          The door opens and a nice lady in her 40's comes to the door.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Hi Mrs. Rose. I'm Alex with\r\n           Standard Heating Oil, we had an\r\n           appointment.\r\n                         \r\n<b>           MRS. ROSE\r\n</b>           Of course, come in.\r\n                         \r\n<b>          INT. CAB OF LARGE BULK OIL TRUCK - DAY\r\n</b>                         \r\n          JULIAN is back behind the wheel and trying to convince\r\n          himself that all is well. He is making a difficult right turn\r\n          to get onto the 59th Street Bridge.\r\n                         \r\n                         \r\n<b>          INT. OZONE PARK HOUSE BASEMENT - DAY\r\n</b>                         \r\n          SALES STUDENT ALEX is now leaning down on the ground next to\r\n          the furnace doing the exact same procedure that ABEL did in\r\n          the training session.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Now as I mentioned on the phone\r\n           this is a 17 point inspection that\r\n           will help us to decipher if our\r\n           maintenance plan will improve your\r\n           efficiency.\r\n                         \r\n          Just then he brings out the white cloth and wipes the inside\r\n          of the exhaust. And he then does the pause and the look just\r\n          as he was taught. He holds the look for a very long beat. We\r\n          hear a door opening upstairs and then feet walking across the\r\n          floor.\r\n<b>                          73\r\n</b>                         \r\n                         \r\n<b>           MRS. ROSE\r\n</b>           Oh good, it's my husband.\r\n<b>           SALES STUDENT ALEX\r\n</b>           Great.\r\n                         \r\n                         \r\n<b>          INT. TRUCK CAB, 59TH STREET BRIDGE - DAY\r\n</b>                         \r\n          JULIAN is up on the bridge moving slowly along with the\r\n          traffic. He is getting paranoid. Looking in his rearview\r\n          mirror. Looking around. But there is nothing. No one.\r\n                         \r\n                         \r\n<b>          INT. OZONE PARK HOUSE BASEMENT - DAY\r\n</b>                         \r\n          The SALES KID is still on his knees next to the furnace as\r\n          feet come into frame coming down the basement steps. Slowly\r\n          the HUSBAND comes into frame.\r\n                         \r\n<b>           MRS. ROSE\r\n</b>           Here he is.\r\n                         \r\n          The SALES KID stands up to shake his hand.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Mr. Rose, I am Alex with Standard\r\n           Heating Oil.\r\n                         \r\n<b>                          HUSBAND\r\n</b>           Hey.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           I was just showing your wife the\r\n           results of my inspection. Should we\r\n           head upstairs to run through some\r\n           numbers?\r\n                         \r\n<b>                          HUSBAND\r\n</b>           Sure. I just had one question about\r\n           our exhaust chimney. Would you be\r\n           willing to take a look.\r\n                         \r\n<b>           SALES STUDENT ALEX\r\n</b>           Of course.\r\n                         \r\n<b>                          HUSBAND\r\n</b>           It's just outside on the other side\r\n           of this wall here.\r\n                         \r\n<b>           MRS. ROSE\r\n</b>           I'm going to head up. Can I get you\r\n           something to drink? Coffee... tea?\r\n<b>                          74\r\n</b>                         \r\n                         \r\n          The KID gives himself an ever-so-tiny smile.\r\n<b>           SALES STUDENT ALEX\r\n</b>           Tea would be great.\r\n                         \r\n          The man walks over to a back basement door and opens it. He\r\n          ushers the SALES KID through.\r\n                         \r\n<b>                          HUSBAND\r\n</b>           Please.\r\n                         \r\n<b>          I/E. DOORWAY OZONE PARK BASEMENT - DAY\r\n</b>                         \r\n          As the SALES KID goes through the door a massive fist of\r\n          SOMEONE who has been waiting on the other side of the door\r\n          comes swinging into frame and pounds the side of our KID'S\r\n          head. Knocking him out instantly.\r\n                         \r\n                         \r\n<b>          INT. TRUCK CAB, 59TH STREET BRIDGE RAMP - DAY\r\n</b>                         \r\n          JULIAN is close to getting off the bridge and is starting to\r\n          feel better. Just as the traffic in front of him starts to\r\n          clear up, out of the corner of his eye he sees something.\r\n          In his side-view mirror he sees LOUIS SERVIDIO getting out of\r\n          a random car behind him. His heart starts racing. He looks\r\n          over in the other mirror and there is THUG #2 walking up.\r\n          Again.\r\n                         \r\n          JULIAN thinks for a second then reaches for the CB RADIO.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Cathy! They are coming again. Over.\r\n           Help. Help. On Bridge.\r\n                         \r\n          He then fumbles the CB and it drops to the floor of the cab.\r\n          He looks up into the mirrors again and sees that they are\r\n          still coming for him.\r\n                         \r\n          The camera now comes in tight on his face and he pauses for a\r\n          long second, and he then makes his decision. He reaches under\r\n          his seat and takes out a handgun. He doesn't really seem to\r\n          know what he is doing with it.\r\n                         \r\n          But he opens the door of the truck and gets out. He aims the\r\n          gun at LOUIS SERVIDIO walking towards him. LOUIS SERVIDIO\r\n          sees him and is very surprised and stops.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Whoa, whoa, whoa! Take it easy\r\n           there.\r\n<b>                          75\r\n</b>                         \r\n                         \r\n          He glances over at THUG #2.\r\n<b>                          JULIAN\r\n</b>           Get the fuck away from me!\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Okay, man.\r\n                         \r\n          People in the cars behind the truck are starting to honk.\r\n          Then LOUIS SERVIDIO gives a nod signal to THUG #2 who is on\r\n          the other side of the truck, and JULIAN'S gun fires by\r\n          mistake. It totally misses THUG #2. He jumps out of the way\r\n          and is hiding behind the wheel.\r\n                         \r\n<b>           LOUIS SERVIDIO (CONT'D)\r\n</b>           Watch it now, man. You're going to\r\n           hurt someone.\r\n                         \r\n          JULIAN is now in a total state of panic. He is hiding back in\r\n          front of the truck. The three men are basically doing a slow-\r\n          motion, very stressful hide-and-seek around the truck. The\r\n          two THUGS now have their guns out.\r\n                         \r\n          The honking has now reached a total insane level as traffic\r\n          is backing up.\r\n          Then THUG #2 makes one last play to take the truck. He tries\r\n          to climb into the cab and JULIAN goes into a rage. He quickly\r\n          fires three shots, missing THUG #2 with each one, but that\r\n          forces LOUIS SERVIDIO to shoot two shots of his own at JULIAN\r\n          to protect THUG #2. They miss as well, but one hits the main\r\n          section of the tank and a small but steady stream of heating\r\n          oil starts pouring out onto the roadway.\r\n                         \r\n          Just then we hear sirens starting to come closer in the\r\n          background. This adds a new element.\r\n                         \r\n<b>           LOUIS SERVIDIO (CONT'D)\r\n</b>           Where are you?\r\n                         \r\n<b>                          THUG #2\r\n</b>           Over here.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Where is he?\r\n                         \r\n<b>                          THUG #2\r\n</b>           Over here.\r\n                         \r\n          JULIAN is just trying to decide what to do next. The sirens\r\n          are now getting much closer.\r\n<b>                          76\r\n</b>                         \r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Get the car!\r\n          THUG #2 takes off. This now leaves JULIAN and LOUIS SERVIDIO\r\n          all alone with the police coming. As JULIAN is hiding, trying\r\n          to figure out what to do next, LOUIS SERVIDIO goes running by\r\n          him. As he does:\r\n                         \r\n<b>           LOUIS SERVIDIO (CONT'D)\r\n</b>           Run for it!\r\n          JULIAN thinks for a second and then runs.\r\n                         \r\n                         \r\n<b>          EXT. 59TH STREET BRIDGE - DAY\r\n</b>                         \r\n          JULIAN runs all along the bridge and then sees LOUIS SERVIDIO\r\n          run through a small door into the body of one of the four\r\n          massive stone anchor structures that hold up the bridge.\r\n                         \r\n                         \r\n<b>          INT. THE 59TH STREET BRIDGE, SUPPORT COLUMN - DAY\r\n</b>                         \r\n          Once he is inside, there's another set of stairs. He locks\r\n          the door behind him and starts racing down the stairs. As he\r\n          heads down he hears someone just in front of him.\r\n          He stops and looks down the center column of the stairs and\r\n          looking up at him about three flights away is LOUIS SERVIDIO.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Oh, there he is. Had to be the hero\r\n           eh?\r\n                         \r\n<b>                          JULIAN\r\n</b>           Fuck you.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Couldn't just let us take the\r\n           truck.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Fuck you!\r\n                         \r\n          JULIAN is screaming in a fit of panic at this point.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Hey man relax... calm down. Did\r\n           they see you come in here?\r\n                         \r\n          JULIAN can't stop breathing very heavy at this point.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I don't think so.\r\n<b>                          77\r\n</b>                         \r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Did they or not?\r\n          He thinks.\r\n                         \r\n<b>                          JULIAN\r\n</b>           No.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Alright, there's a door down here\r\n           about four more flights. Don't go\r\n           out there, that's the street. Go\r\n           down about two more flights after\r\n           that and you'll come out below the\r\n           bridge. They won't be there.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Fuck you!\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           You're welcome.\r\n                         \r\n          Then LOUIS SERVIDIO's head disappears and we can hear his\r\n          feet flying down the steps again.\r\n                         \r\n          JULIAN thinks for a beat, then he starts off down the stairs\r\n          again as well. The camera stays right where it was as JULIAN\r\n          heads down out of sight. We just hear the sounds of his feet\r\n          getting lower and lower.\r\n                         \r\n                         \r\n<b>          INT. BRIDGE GROUND FLOOR - DAY\r\n</b>                         \r\n          JULIAN comes to the first door and looks at it. We can hear\r\n          sirens in the distance on the other side of the door. He\r\n          keeps going.\r\n                         \r\n          Down two more flights, just as he said, there is another\r\n          doorway. JULIAN walks up to that door very carefully. He\r\n          listens on the other side but doesn't hear anything but his\r\n          own breath.\r\n                         \r\n                         \r\n<b>          INT. STAIR LANDING LOWEST LEVEL - DAY\r\n</b>                         \r\n          Then we hear the door back up top fly open. JULIAN then\r\n          quietly opens the door in front of him and right in front of\r\n          his face is a woman in full jogging clothes running by him.\r\n          He looks around, and after a second to get himself\r\n          orientated, we see he's on a riverfront esplanade where there\r\n          are many people jogging and walking, enjoying the evening.\r\n<b>                          78\r\n</b>                         \r\n                         \r\n          JULIAN looks at his hand and realizes he is still holding the\r\n          gun out in the open. He puts it away and then looks up at the\r\n          bridge that is hovering above him.\r\n                         \r\n          He knows he left his life as he knew it up on that bridge.\r\n                         \r\n<b>           FADE TO BLACK.\r\n</b>                         \r\n          Over the black we begin to hear the rumble of a very large\r\n          truck. It gets louder and louder.\r\n                         \r\n<b>          INT. OF A VERY LARGE EMPTY DUMPSTER - DAY\r\n</b>                         \r\n          We now see that SALES STUDENT ALEX is inside a massive, empty\r\n          construction dumpster. And as he looks around, we realize it\r\n          is on the back of a truck that is currently driving pretty\r\n          fast. With each bump that the truck goes over the noise\r\n          inside the dumpster is deafening. As the KID comes to his\r\n          senses he tries to stand up. As he does, we see that the\r\n          sides of the dumpster are at least eight feet tall and the\r\n          interior is very slick without anything to grab or stand on.\r\n          He is trapped.\r\n                         \r\n          Just then the truck goes over another huge bump and comes to\r\n          a stop. It idles for a minute then begins backing up. It\r\n          stops. A warning, beeping alarm is heard, and finally one end\r\n          of the dumpster begins rising. As it gets higher and higher\r\n          our KID tries to hold himself back, but he begins to slide\r\n          towards the low end. As he does he sees that the end that he\r\n          is heading towards is on a hinge and it is starting to swing\r\n          open. Finally the thing is at such an angle that he can't\r\n          hold on any longer and he slides towards the opening.\r\n                         \r\n          As he falls out he/we see that he's being dumped over the\r\n          edge of a cliff of some sort. He falls probably 10-12 feet,\r\n          into a pile of garbage. As he gathers himself and tries to\r\n          stand, we see he is standing in a massive landfill. He looks\r\n          around as the truck pulls away. He's left totally alone.\r\n                         \r\n                         \r\n<b>          INT. TENNIS COURT OF SUBURBAN MANSION - DAY\r\n</b>                         \r\n          ABEL is led by a MAID into an indoor tennis court. The house\r\n          is massive and designed like an English Country Estate.\r\n                         \r\n          As ABEL walks up we see PETER FORENTE on the court playing\r\n          against an automatic tennis ball machine. He is in full\r\n          tennis whites as he hammers the balls back at the machine.\r\n                         \r\n          ABEL approaches the court and watches for a beat.\r\n<b>                          79\r\n</b>                         \r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           It's a pretty cool machine, isn't\r\n           it?\r\n                         \r\n          ABEL nods.\r\n                         \r\n<b>           PETER FORENTE (CONT'D)\r\n</b>           I was paying a guy five bucks an\r\n           hour to do this with me last year.\r\n<b>                          ABEL\r\n</b>           Peter.\r\n                         \r\n          This causes PETER to look up and see the serious look on\r\n          ABEL's face. He hits one last shot and walks a little closer\r\n          to ABEL. The machine is still hitting balls behind PETER.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           I need to speak with you.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           I see that.\r\n          PETER walks over to the machine and unplugs it. He points\r\n          over towards the chairs courtside. He and ABEL sit down.\r\n                         \r\n<b>                          ABEL\r\n</b>           This has gotten out of control...\r\n           There was a guy with a gun at my\r\n           house.\r\n                         \r\n          ABEL lets this sit for a minute, and he is intently reading\r\n          PETER's face. He hopes not, but he is judging to see if PETER\r\n          had anything to do with all these attacks. PETER just looks\r\n          back at him with a very strong poker face.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           My wife and children were home at\r\n           the time.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Is everyone okay?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes. I managed to chase him off.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Well, I'm sorry, that must have\r\n           been scary... what can I do.\r\n<b>                          80\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I need to know who is doing this.\r\n<b>                          PETER FORENTE\r\n</b>           Abel...\r\n                         \r\n<b>                          ABEL\r\n</b>           It's one thing to come after my\r\n           trucks and drivers... and to steal\r\n           from me... but this... it's\r\n           different.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           Have you ever dealt with anything\r\n           like this?\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Have you met my father?\r\n                         \r\n          They both smile. His father is an old-school gangster.\r\n                         \r\n<b>           PETER FORENTE (CONT'D)\r\n</b>           A bunch of thugs invaded our home\r\n           when I was a baby... My mother was\r\n           there with us... My brother\r\n           remembers it. Nothing happened.\r\n           They were trying to scare my\r\n           father. They ended up just leaving\r\n           and we never found out who it was.\r\n           But after that we moved to a\r\n           fortress just like this. And those\r\n           guys who let you in. They are here\r\n           to shoot anyone who isn't invited.\r\n                         \r\n<b>                          ABEL\r\n</b>           I refuse to live my life that way.\r\n           I won't do it... I am going to ask\r\n           for a meeting.\r\n                         \r\n          They both look out and think it through a bit.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Who?\r\n                         \r\n<b>                          ABEL\r\n</b>           Anyone with more than 20k of\r\n           storage. Can I count on you being\r\n           there?\r\n                         \r\n          PETER looks away for a long beat.\r\n<b>                          81\r\n</b>                         \r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Yes... When are you closing on the\r\n           terminal?\r\n                         \r\n<b>                          ABEL\r\n</b>           Monday.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Congratulations.\r\n<b>                          ABEL\r\n</b>           Hold that... it's not done yet...\r\n           you may be hearing from me.\r\n           (Trailed by an awkward laugh.)\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Well, good luck.\r\n                         \r\n          ABEL stands up ready to go.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you for seeing me. I want\r\n           more than this...\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           I know you do. My father is in\r\n           jail... as you know. And I have\r\n           always wanted to conduct myself\r\n           differently than he did.\r\n                         \r\n<b>                          ABEL\r\n</b>           And you have.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Almost exclusively, yes. But I know\r\n           why he did what he did. Because at\r\n           the time it's easier.\r\n                         \r\n<b>                          ABEL\r\n</b>           But it's not.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Yes it is. You are a good man. I\r\n           will see what I can find out. This\r\n           isn't good for any of us.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you.\r\n<b>                          82\r\n</b>                         \r\n                         \r\n<b>          EXT. PETER FORENTE'S DRIVEWAY - DAY\r\n</b>          ABEL is walking across the beautifully-manicured driveway,\r\n          and as he gets nearer to his car he starts to hear the mayhem\r\n          that is coming from the CB radio in the front seat. As he\r\n          gets closer he gets more and more details.\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Where is the truck now?\r\n<b>           RESPONDING DRIVER V.O.\r\n</b>           It's still on the bridge.\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Is it still leaking oil?\r\n                         \r\n<b>           RESPONDING DRIVER V.O.\r\n</b>           No. They have stopped the leak.\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Did it reach the river?\r\n                         \r\n<b>           RESPONDING DRIVER V.O.\r\n</b>           Some did.\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           How many shots were fired?\r\n                         \r\n          ABEL now slams open the door and gets into the driver side\r\n          and picks up the microphone.\r\n                         \r\n<b>                          ABEL\r\n</b>           Joanne it's me. What are you\r\n           talking about... what shots?\r\n                         \r\n          The camera now comes around to the outside of the car looking\r\n          back at ABEL through the windshield. The mansion is looming\r\n          in the background. We see ABEL'S face react as he hears the\r\n          news of the incident on the bridge. The camera pulls back as\r\n          ABEL'S face goes totally cold.\r\n                         \r\n                         \r\n<b>          INT. COURT ROOM - DAY\r\n</b>                         \r\n          ABEL walks into an almost empty courtroom. LAWRENCE is\r\n          packing up his things at the front of the room. They catch\r\n          each others eye. ABEL makes his way forward as everyone else\r\n          leaves. They look at each other for a beat.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I heard.\r\n<b>                          83\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I need to make sure you know that\r\n           we had nothing to do with this.\r\n           It's not the way I do business. In\r\n           fact I have been warning my men\r\n           against doing this sort of thing.\r\n           It is terrible for me.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           It's not good... for either of us.\r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           In my job we use whatever leverage\r\n           we can gain, as I'm sure you do in\r\n           your business. It's an ongoing\r\n           investigation, and it will be just\r\n           one piece of many. So while I\r\n           appreciate you coming here... I\r\n           have nothing I can tell you.\r\n                         \r\n          LAWRENCE looks around the room thinking while ABEL says\r\n          nothing, just waiting.\r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           What a fucking mess this place\r\n           is... Do you know where he is?\r\n                         \r\n<b>                          ABEL\r\n</b>           No... but I'll find him.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           You should. And when you do, bring\r\n           him to us. A situation like this,\r\n           happening in such a dangerous and\r\n           public way, within an industry I'm\r\n           charged with cleaning up. It's very\r\n           bad for me... professionally\r\n           speaking.\r\n                         \r\n          They look at each other one last time. ABEL gets the message.\r\n                         \r\n                         \r\n<b>          EXT. SMALL QUIET SIDE STREET, QUEENS - DAY\r\n</b>                         \r\n          SALES STUDENT ALEX is walking down the street looking\r\n          terrible. His clothes are ruined by garbage, and he is\r\n          scared. As he approaches his car his face drops.\r\n                         \r\n          The car has a two-by-four slammed through the shattered\r\n          windshield.\r\n<b>                          84\r\n</b>                         \r\n                         \r\n          He stops dead in his tracks and then carefully looks around\r\n          and scans the street looking for anything. It is eerily\r\n          empty.\r\n                         \r\n                         \r\n<b>          EXT. OUTER GATE, STANDARD HEATING OIL YARD - DAY\r\n</b>                         \r\n          ABEL pulls up in his car and the gate starts to open. As it\r\n          does we see ARTHUR LEWIS standing waiting next to his car.\r\n          ABEL pulls in next to him and gets out. There is an\r\n          overriding, almost unsettling calm to this conversation.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Abel.\r\n                         \r\n<b>                          ABEL\r\n</b>           Arthur.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I wanted to come and talk to you in\r\n           person... We aren't going to be\r\n           able to show up for you on Monday.\r\n           We can't do the loan.\r\n                         \r\n<b>                          ABEL\r\n</b><b>           I...\r\n</b><b>                          ARTHUR LEWIS\r\n</b>           I wanted to let you know as soon as\r\n           possible so that you could try to\r\n           put something else together.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you for coming... This is not\r\n           right.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I know.\r\n                         \r\n<b>                          ABEL\r\n</b>           What can I do?\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Nothing... The loan review\r\n           committee met this afternoon and\r\n           won't meet again for two weeks.\r\n                         \r\n<b>                          ABEL\r\n</b>           And you are aware of the position\r\n           this is putting me in?\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I am.\r\n<b>                          85\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I paid off my first loan to you\r\n           eleven years ago.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I know.\r\n                         \r\n<b>                          ABEL\r\n</b>           Do you remember the term on that\r\n           loan?\r\n<b>                          ARTHUR LEWIS\r\n</b>           I don't.\r\n                         \r\n<b>                          ABEL\r\n</b>           I had seven years to pay you back.\r\n                         \r\n          They both nod knowing what's coming next.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Do you know how long it took me to\r\n           pay you off?\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           Seven months?\r\n<b>                          ABEL\r\n</b>           Six and a half.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ABEL\r\n</b>           I put 40 percent down as a deposit\r\n           on this. It's all we had.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           You now have three separate serious\r\n           pending legal cases against you.\r\n           One with sixteen counts of\r\n           misconduct ranging from fraud to\r\n           tax evasion. And then in the middle\r\n           of our meeting today I get a report\r\n           saying you had armed your entire\r\n           fleet of drivers which led to a\r\n           shoot-out on the 59th Street\r\n           Bridge.\r\n                         \r\n<b>                          ABEL\r\n</b>           None of it is true.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           That may be.\r\n<b>                          86\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           May?\r\n          They look at each other.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           It doesn't matter.\r\n                         \r\n<b>                          ABEL\r\n</b>           It does matter, that you know we\r\n           didn't do this.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I do... I do. But it doesn't\r\n           matter, I can't do anything. I'm\r\n           sorry.\r\n                         \r\n          ABEL's demeanor shifts.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'll find it.\r\n                         \r\n<b>                          ARTHUR LEWIS\r\n</b>           I know you will.\r\n                         \r\n          The banker gets into his car and backs out. The gate opens\r\n          and he drives out. Just as it is about to close it starts\r\n          opening again. SALES STUDENT ALEX drives in with his car\r\n          trashed. He pulls up and gets out of the car looking at ABEL.\r\n          He knows what has happened and is crushed. Neither of them\r\n          say a word, finally ABEL gives the kid a cautious but\r\n          meaningful hug around the shoulder and leads him inside.\r\n                         \r\n                         \r\n<b>          INT. ABEL AND ANNA'S LIVING ROOM - THAT NIGHT\r\n</b>                         \r\n          ABEL walks into the room and ANNA is sitting at the large\r\n          dining table smoking a cigarette inside. She has been crying.\r\n                         \r\n<b>                          ANNA\r\n</b>           It's horrible.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ANNA\r\n</b>           Where is he?\r\n                         \r\n<b>                          ABEL\r\n</b>           We're looking for him.\r\n                         \r\n<b>                          ANNA\r\n</b>           And they haven't gotten the other\r\n           guys?\r\n<b>                          87\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Of course not.\r\n<b>                          ANNA\r\n</b>           Are you okay?\r\n                         \r\n<b>                          ABEL\r\n</b>           No... I'm not... They're out.\r\n                         \r\n          This gets her attention.\r\n<b>                          ANNA\r\n</b>           Who?\r\n                         \r\n<b>                          ABEL\r\n</b>           The bank.\r\n                         \r\n          With that ABEL walks out of the room and heads up the stairs\r\n          to his bedroom. When he's halfway up the stairs she stops\r\n          him.\r\n                         \r\n<b>                          ANNA\r\n</b>           So what does that mean?\r\n                         \r\n<b>                          ABEL\r\n</b>           It means we need to find the money\r\n           somewhere else.\r\n                         \r\n<b>                          ANNA\r\n</b>           We have two days!\r\n                         \r\n<b>                          ABEL\r\n</b>           I'll figure it out.\r\n                         \r\n                         \r\n<b>          INT. ANNA'S CAR, WESTCHESTER SCENIC HIGHWAY - DAY\r\n</b>                         \r\n          ABEL is driving ANNA'S car towards the city. ANNA is in the\r\n          passenger seat and the three DAUGHTERS are in the back. ANNA\r\n          and ABEL do not look any better. In fact there is now a tinge\r\n          of anger mixed into the sadness.\r\n                         \r\n          The DAUGHTERS are arguing about who's taking up too much room\r\n          in the back seat.\r\n                         \r\n<b>                          DAUGHTERS\r\n</b>           Move.\r\n                         \r\n<b>                          ANNA\r\n</b>           Quiet.\r\n                         \r\n<b>                          DAUGHTERS\r\n</b>           You move.\r\n<b>                          88\r\n</b>                         \r\n                         \r\n          ANNA turns and snaps at them a bit.\r\n<b>                          ANNA\r\n</b>           Stop. I've told you guys not to\r\n           push it this morning, this is not\r\n           the morning to be doing this... but\r\n           since the second you all woke up.\r\n           It's this, it's that. Just stop.\r\n           The world does not revolve around\r\n           you!\r\n          This shuts them up for a beat. ABEL is seething. But then\r\n          ELIZABETH (middle) nudges ANNIE (oldest) so she gives\r\n          CATHERINE (youngest) a good hit. ANNA sees it and freaks.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           That's it Annie we've told you...\r\n                         \r\n          Before ANNA can get the full sentence out ABEL suddenly pulls\r\n          the car off the side of the highway into the grass. Everyone\r\n          in the car is taken aback. The road is a smaller scenic\r\n          highway not some eight lane affair but this whole sequence\r\n          still plays out with the menacing roar of the cars going by\r\n          right next to them.\r\n                         \r\n<b>          EXT. HIGHWAY - DAY\r\n</b>                         \r\n          ABEL gets out of the car and slams the door. He walks around\r\n          the back of the car as the cars fly by them on the highway.\r\n          He goes around to his oldest daughter's door and pulls ANNIE\r\n          from the car. They stand behind the car and go at it with the\r\n          traffic flying by. ABEL is louder than he has been in the\r\n          entire film. He is losing it from all the pressure but his\r\n          daughter bears the brunt.\r\n                         \r\n<b>                          ABEL\r\n</b>           You are thirteen years old. What\r\n           are you doing? Your mother asks you\r\n           an hour ago to help her get out of\r\n           the house smoothly and you are\r\n           acting like an...\r\n                         \r\n<b>                          ANNIE\r\n</b>           Oh fuck you!\r\n                         \r\n<b>                          ABEL\r\n</b>           What? What? What are you talking\r\n           about?\r\n                         \r\n          ABEL is looking around for someone to help him and witness\r\n          this. He then switches, he has had enough and gets right up\r\n          in her face.\r\n<b>                          89\r\n</b>                         \r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I'm not sure who the hell you think\r\n           you are, but you don't talk to me\r\n           that way... You are in serious\r\n           danger of becoming a rich little\r\n           spoiled brat and I can tell you\r\n           from experience there is nothing\r\n           worse in the world than a rich\r\n           little girl who thinks the whole\r\n           world revolves around her.\r\n          ANNIE is yelling back over the traffic.\r\n                         \r\n<b>                          ANNIE\r\n</b>           The world revolves around me? Me!\r\n           What about her? And what about you?\r\n           You're both so totally obsessed\r\n           with your stupid business. You\r\n           walk around like you are saving the\r\n           world but what are you doing...\r\n           nothing!\r\n                         \r\n          This stings. He now changes his tone to a quiet low roar. But\r\n          he can't keep quiet and by the end of the line he is yelling\r\n          again.\r\n<b>                          ABEL\r\n</b>           First off I don't walk around like\r\n           I am saving anything. I chose this\r\n           business because I looked at the\r\n           world and said `What's the last\r\n           bill people stop paying every month\r\n           when they are low on cash?' `Cause\r\n           that's a business I want to be in.\r\n           `Cause failure wasn't much of an\r\n           option for me. I lived in\r\n           reality... not whatever this world\r\n           is you are living in. And we help\r\n           people stay warm... which isn't all\r\n           that bad.\r\n           (now he is yelling again)\r\n           Maybe you've got grander ambitions\r\n           but for now this is how you eat,\r\n           sleep, and get all dressed up... So\r\n           you better shape the fuck up and\r\n           NEVER speak to me like this again!\r\n                         \r\n<b>                          ANNA\r\n</b>           Stop!!\r\n                         \r\n          They both look over and ANNA is standing there. A calmness\r\n          suddenly falls down on all of them.\r\n<b>                          90\r\n</b>                         \r\n                         \r\n<b>          INT. ANNA'S CAR ON HIGHWAY - DAY\r\n</b>          All five of them are sitting in the car, sadness prevails.\r\n                         \r\n                         \r\n<b>          INT. ANNA MORALES' LIBRARY - NIGHT\r\n</b>                         \r\n          The camera moves slowly across a dark hallway. We hear the\r\n          sounds of a manual adding machine grinding away. As we come\r\n          through the doorway we see ANNA MORALES sitting at her desk\r\n          in a pool of light from the desk lamp. She is deep in it\r\n          crunching numbers. Finally ABEL walks into the doorway, he\r\n          looks exhausted.\r\n                         \r\n<b>                          ABEL\r\n</b>           Hey.\r\n                         \r\n          She looks up with a small but sweet smile.\r\n                         \r\n<b>                          ANNA\r\n</b>           Hi.\r\n                         \r\n<b>                          ABEL\r\n</b>           How's it coming?\r\n                         \r\n<b>                          ANNA\r\n</b>           I've made it to 1975.\r\n                         \r\n<b>                          ABEL\r\n</b>           That was a good year.\r\n                         \r\n          ANNA gives a slight look that the numbers may not totally\r\n          support that claim.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Well it was for me...how is it?\r\n                         \r\n<b>                          ANNA\r\n</b>           I'm not sure yet... but it's not as\r\n           bad as they are saying it is...\r\n           Turns out I kinda knew what I was\r\n           doing.\r\n                         \r\n          They give each other a slight smile.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           How'd you do?\r\n                         \r\n<b>                          ABEL\r\n</b>           I got us a three more days... and\r\n           one piece... from Saul. But we're\r\n           still about a million short.\r\n                         \r\n          They look at each other with concern.\r\n<b>                          91\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           You're going to see your little\r\n           brother?\r\n                         \r\n<b>                          ABEL\r\n</b>           First thing.\r\n                         \r\n<b>                          ANNA\r\n</b>           And Peter?\r\n<b>                          ABEL\r\n</b>           Probably.\r\n                         \r\n          As they look at each other ABEL\r\n                         \r\n<b>                          ANNA\r\n</b>           This is all worth it.\r\n                         \r\n          He pauses just long enough to think.\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course.\r\n                         \r\n          A sense of caring and resolve comes over them. At least now\r\n          they know what needs to be done.\r\n<b>                          ABEL (CONT'D)\r\n</b>           You should get to bed.\r\n                         \r\n<b>                          ANNA\r\n</b>           I'll be up.\r\n                         \r\n<b>                          ABEL\r\n</b>           I love you.\r\n                         \r\n<b>                          ANNA\r\n</b>           I love you too.\r\n                         \r\n          ABEL turns to go upstairs as ANNA starts in again with the\r\n          machine.\r\n                         \r\n                         \r\n<b>          INT. HALLWAY, OUTSIDE OF JULIAN'S APARTMENT - DAY\r\n</b>                         \r\n          ANDREW stands in the hallway about to knock, but he waits for\r\n          a beat. He knocks.\r\n                         \r\n          The door opens to a young woman, presumably JULIAN'S wife,\r\n<b>          LUISA.\r\n</b>                         \r\n<b>                          ANDREW WALSH\r\n</b>           Is Julian here?\r\n<b>                          92\r\n</b>                         \r\n                         \r\n<b>                          LUISA\r\n</b>           No.\r\n<b>                          ANDREW WALSH\r\n</b>           Abel would like to speak with him.\r\n           To help him.\r\n                         \r\n<b>                          LUISA\r\n</b>           I will tell him.\r\n          JULIAN steps into the frame from behind her.\r\n                         \r\n                         \r\n<b>          EXT./INT. LARGE LATE-MODEL AMERICAN CAR, PARKED - DAY\r\n</b>                         \r\n          A DRIVER is sitting in the driver's seat. ANDREW walks up and\r\n          gets in the front seat. JULIAN gets into the back and looks\r\n          over at ABEL who is sitting next to him. They drive off and\r\n          nobody says a word for a very, very long time.\r\n                         \r\n                         \r\n<b>          EXT. EMPTY PARKING LOT - DAY\r\n</b>                         \r\n          The car finally pulls into a large empty parking lot. For a\r\n          couple beats JULIAN has a look on his face that he may be\r\n          getting rubbed out.\r\n          Then off in the distance we see two cop cars. The car pulls\r\n          up to them and stops. ABEL and the DRIVER get out of the car\r\n          without a word, but ANDREW stays and turns around and now\r\n          gives him a total debrief.\r\n                         \r\n<b>                          JULIAN\r\n</b>           He's turning me in?\r\n                         \r\n          ANDREW looks at him without much remorse.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Of course we are turning you in.\r\n           You have put everything that man\r\n           has worked for for the last 20\r\n           years at risk. If it was up to me\r\n           we would be dealing with this in a\r\n           very different way.\r\n                         \r\n<b>                          JULIAN\r\n</b>           But I know things...\r\n                         \r\n          This causes ANDREW to turn quickly back to him with as sharp\r\n          a look as he has.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Really?\r\n<b>                          93\r\n</b>                         \r\n                         \r\n<b>                          JULIAN\r\n</b>           Yes.\r\n<b>                          ANDREW WALSH\r\n</b>           And what things do you know?\r\n                         \r\n          JULIAN looks back at him.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           I strongly suggest you think that\r\n           through before you answer it.\r\n           Because even if you did, what does\r\n           it do for you? Nothing. There is\r\n           nothing there for you to gain.\r\n           Nothing.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I am too.\r\n                         \r\n          ANDREW now changes his tone.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           They say they have you firing four\r\n           shots, is that right?\r\n                         \r\n<b>                          JULIAN\r\n</b>           I don't know.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Where's the gun?\r\n                         \r\n          JULIAN stutters for a moment, then.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I threw it in the river.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Good. Your background check with us\r\n           says you have never been arrested,\r\n           is that true?\r\n                         \r\n<b>                          JULIAN\r\n</b>           Why is this putting everything at\r\n           risk?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Have you ever been arrested?\r\n                         \r\n<b>                          JULIAN\r\n</b>           No.\r\n<b>                          94\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Because no bank will touch us right\r\n           now. So we can't close on the new\r\n           property. And he's going to lose\r\n           everything on his deposit.\r\n                         \r\n          This sits heavily on JULIAN. ANDREW hands him a card.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           This is a lawyer who will meet you\r\n           when they bring you to the station.\r\n           You no longer work for us. You've\r\n           been fired. But Abel wants to pay\r\n           for the lawyer. So... this guy\r\n           should be able to help you. Good\r\n           luck.\r\n                         \r\n          With that JULIAN gets out of the car. ABEL is standing there.\r\n          They meet.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n<b>                          JULIAN\r\n</b>           I was scared.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Aren't you scared?\r\n                         \r\n<b>                          ABEL\r\n</b>           Sometimes.\r\n                         \r\n<b>                          JULIAN\r\n</b>           What do you do?\r\n                         \r\n          ABEL thinks this through long and hard.\r\n                         \r\n<b>                          ABEL\r\n</b>           I have always been much more scared\r\n           of failure than anything else.\r\n                         \r\n<b>                          JULIAN\r\n</b><b>           I...\r\n</b>                         \r\n<b>                          ABEL\r\n</b>           It wasn't always like this.\r\n<b>                          95\r\n</b>                         \r\n                         \r\n<b>                          JULIAN\r\n</b>           Are you ruined?\r\n<b>                          ABEL\r\n</b>           Not today... but by the end of the\r\n           week... maybe.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I'm sorry.\r\n<b>                          ABEL\r\n</b>           Good...\r\n                         \r\n<b>                          JULIAN\r\n</b>           No... I am not strong.\r\n                         \r\n<b>                          ABEL\r\n</b>           That does not have to be true.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Trust me... I am not... I'm sorry.\r\n                         \r\n          With that JULIAN walks across the parking lot towards the\r\n          POLICE to turn himself in. ANDREW walks up behind ABEL and\r\n          stands there looking.\r\n<b>                          ANDREW WALSH\r\n</b>           I'm late. I will meet you at four.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm gonna try to get us a little\r\n           more time.\r\n                         \r\n          The three COPS are standing waiting as JULIAN walks towards\r\n          them. ABEL turns around, facing the camera, and closes his\r\n          eyes in sadness.\r\n                         \r\n          With ABEL in the foreground we see JULIAN make it halfway to\r\n          the COPS, then he stops.\r\n                         \r\n<b>                          COP 1\r\n</b>           Hey.\r\n                         \r\n          ABEL'S face tells us he knows what is coming.\r\n                         \r\n          JULIAN sets off running. Before the COPS can get close to him\r\n          he is off. ABEL turns and sees what is happening. He does not\r\n          follow chase. His head just drops.\r\n<b>                          96\r\n</b>                         \r\n                         \r\n<b>          EXT. VARIOUS 1980'S URBAN DECAY LANDSCAPES\r\n</b>          We are now with JULIAN again, running. But as this chase\r\n          continues we see his face turn from fear, to desperation, to\r\n          a creeping sense of evil. He does not know how it has come to\r\n          this, but as he jumps down from fences and runs across\r\n          deserted lots we see that his weakness is turning.\r\n                         \r\n          As he runs through some of the most bombed-out, destroyed\r\n          sections of Queens, he just never stops. With each step his\r\n          fear turns to... anger.\r\n                         \r\n                         \r\n<b>          EXT. BLOWN-OUT BUILDING\r\n</b>                         \r\n          He stops, collapses, and hides behind a blown-out building\r\n          wall just as a COP CAR drives by. He starts to almost cry,\r\n          but then it again becomes something else. His survival\r\n          instinct is taking over and we are not sure what will become\r\n          of it. Anger.\r\n                         \r\n                         \r\n<b>          INT. OLDEST HASIDIC BUSINESSMAN'S LIVING ROOM - DAY\r\n</b>                         \r\n          ABEL sits across from the oldest Hasidic member of the\r\n          family, JOSEPH, from the first scene.\r\n<b>                          ABEL\r\n</b>           Thank you for seeing me.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Of course.\r\n                         \r\n<b>                          ABEL\r\n</b>           I need more time.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Of course you do.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know our agreement doesn't allow\r\n           for that. But... I need more time.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Why?\r\n                         \r\n          This takes ABEL back a bit.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you for asking. Many, many\r\n           reasons.\r\n<b>                          97\r\n</b>                         \r\n                         \r\n<b>                          JOSEPH\r\n</b>           It's a difficult time to do\r\n           business.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes... it is.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           I'll give you three more days. Then\r\n           it's over.\r\n<b>                          ABEL\r\n</b>           Thank you.\r\n                         \r\n                         \r\n<b>          INT. ASSISTANT DA'S OFFICE - DAY\r\n</b>                         \r\n          ANDREW sits across from LAWRENCE and DEPUTY LANGE. They wait\r\n          while LAWRENCE writes something down on a pad in front of\r\n          him. He finishes.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           So. I should start by thanking you\r\n           for your assistance in... in\r\n           attempting to bring in your driver?\r\n<b>                          ANDREW WALSH\r\n</b>           We didn't think he'd react that\r\n           way.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Yes... Well, the officers there\r\n           didn't set it up very well on their\r\n           end either.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'm sorry.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           We are looking for him.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           So are we... it's very sad. He was\r\n           very close to Abel.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I understand. Well... Ms. Lange.\r\n                         \r\n<b>                          DEPUTY LANGE\r\n</b>           It has been brought to our\r\n           attention that it might be\r\n           beneficial on your end to resolve\r\n           this issue in a time sensitive way.\r\n<b>                          98\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Possibly.\r\n<b>                          DEPUTY LANGE\r\n</b>           So we have prepared an offer for\r\n           you to review.\r\n                         \r\n          They slide the offer across the table. ANDREW opens it and\r\n          gives it a once over.\r\n<b>                          ANDREW WALSH\r\n</b>           I'll show this to them. He'll never\r\n           go for it, but it's a start.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           This could get a lot worse for you\r\n           all.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I know... I will present it to him.\r\n                         \r\n          ANDREW gets up and prepares to leave. LAWRENCE stands with\r\n          him and walks him out into the hallway.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           Thank you.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           And Andrew, one other thing.\r\n                         \r\n          He turns. They are now alone in the hallway.\r\n                         \r\n                         \r\n<b>          INT. IMPOSSIBLY LONG HALLWAY - DAY\r\n</b>                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I need this to stop.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           You need what to stop?\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           This fucking bullshit with the open\r\n           warfare. I won't put up with it.\r\n           It's starting to be a real problem.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Starting to be? No shit.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Not for you... but for me.\r\n                         \r\n          This lingers for a beat as the meaning sinks in.\r\n<b>                          99\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           I need the driver.\r\n<b>                          ANDREW WALSH\r\n</b>           I understand. The kid went out and\r\n           got his own gun. This was not us.\r\n           No matter what you think of him,\r\n           Abel doesn't work this way.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I really could give a fuck, but you\r\n           need to get your man to talk to\r\n           these people, give in, stop doing\r\n           whatever you are doing to bring\r\n           this shit on you. It needs to stop.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           He wants to talk to them. We've\r\n           been trying to set up a meeting.\r\n           O'Leary hasn't been able to get it\r\n           done.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'll talk to him.\r\n                         \r\n          ANDREW gives him a look.\r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           He's an old friend... and get that\r\n           kid back in here. I'm up in it a\r\n           little bit here and I need\r\n           something.\r\n                         \r\n          LAWRENCE turns and walks back into his office. ANDREW walks\r\n          down the hallway all alone then stops. He reaches into his\r\n          briefcase and takes out the offer. He looks it over again.\r\n          Then he looks towards the ground and almost looks like he\r\n          might cry. There is a distinct sense of responsibility for\r\n          the situation that ABEL finds himself in that is starting to\r\n          bring ANDREW to the edge.\r\n                         \r\n                         \r\n<b>          EXT. CEMETERY - DAY\r\n</b>                         \r\n          ABEL is waiting standing next to his car. ANDREW comes\r\n          driving into the lot next to him and gets out.\r\n                         \r\n<b>                          ABEL\r\n</b>           I talked to the Hasid, I got us\r\n           three days.\r\n                         \r\n          ANDREW nods.\r\n<b>                          100\r\n</b>                         \r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Is that enough?\r\n<b>                          ABEL\r\n</b>           I don't know.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Well here it is. It's just a first\r\n           pass.\r\n          He hands him the plea deal from the DA. ABEL looks it over\r\n          but shows almost no emotion. Then.\r\n                         \r\n<b>                          ABEL\r\n</b>           Felons can't vote.\r\n                         \r\n          This takes ANDREW back.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I'm sorry?\r\n                         \r\n<b>                          ABEL\r\n</b>           This plea has me...\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I know. It's just a first offer.\r\n<b>                          ABEL\r\n</b>           I would never take this.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I know.\r\n                         \r\n          ABEL looks off and resets.\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           He's going to get us the meeting.\r\n                         \r\n<b>                          ABEL\r\n</b>           Who?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Lawrence, he's tight with O'Leary.\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course he is.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Does Julian have anything?\r\n                         \r\n          ABEL gives him a look?\r\n                         \r\n<b>           ANDREW WALSH (CONT'D)\r\n</b>           Anything on us?\r\n<b>                          101\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           All the drivers could have us on\r\n           scales. Why?\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           If we are cutting deals, we can't\r\n           have anything new come up at the\r\n           last minute.\r\n                         \r\n<b>                          ABEL\r\n</b>           He would never do that.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           We need to find him... Lawrence\r\n           needs him.\r\n                         \r\n                         \r\n<b>          INT. JULIAN'S APARTMENT - DAY\r\n</b>                         \r\n          ABEL stands outside the door for a very long beat then\r\n          finally knocks.\r\n                         \r\n          JULIAN'S wife, LUISA, opens the door. She gestures him in.\r\n                         \r\n          He enters the apartment and looks around. She gestures for\r\n          him to sit. He chooses a seat right across from her. He\r\n          stares at her for a beat. Then for the first time we hear him\r\n          speak Spanish. (This whole conversation is in Spanish)\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you for letting me in.\r\n                         \r\n<b>                          LUISA\r\n</b>           Of course.\r\n                         \r\n          ABEL moves his chair closer. It's meant to be, and is a bit\r\n          threatening.\r\n                         \r\n<b>                          ABEL\r\n</b>           Have you seen Julian?\r\n                         \r\n<b>                          LUISA\r\n</b>           No.\r\n                         \r\n          ABEL questions her with a look.\r\n                         \r\n<b>                          ABEL\r\n</b>           We need to find him.\r\n                         \r\n<b>                          LUISA\r\n</b>           I know.\r\n                         \r\n<b>                          ABEL\r\n</b>           I am worried about him.\r\n<b>                          102\r\n</b>                         \r\n                         \r\n<b>                          LUISA\r\n</b>           So am I.\r\n<b>                          ABEL\r\n</b>           You know we were going to support\r\n           him. I do not know why he ran.\r\n                         \r\n<b>                          LUISA\r\n</b>           He was scared.\r\n          ABEL shakes his head.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n<b>                          LUISA\r\n</b>           He has always wanted to make you\r\n           proud. You know that right?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes. Well this time that hasn't\r\n           worked out.\r\n                         \r\n<b>                          LUISA\r\n</b>           No... How did you do it?\r\n<b>                          ABEL\r\n</b>           Do what?\r\n                         \r\n<b>                          LUISA\r\n</b>           This.\r\n                         \r\n          She motions towards his suit.\r\n                         \r\n<b>                          LUISA (CONT'D)\r\n</b>           Success... that's all he wanted.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know. It makes me very sad,\r\n           because he is a very talented young\r\n           man. But there are some decisions\r\n           that you cannot come back from. I\r\n           need to know where he is. And I\r\n           need him to turn himself in. His\r\n           actions are hurting me and my\r\n           business. And I refuse to let other\r\n           people's weaknesses hurt me. I\r\n           don't know how it has come to this,\r\n           but it has. If he does the right\r\n           thing I will help to take care of\r\n           his responsibilities. You and your\r\n           family. When you see him. Tell him\r\n           this. Please.\r\n<b>                          103\r\n</b>                         \r\n                         \r\n<b>                          LUISA\r\n</b>           I will.\r\n          ABEL gets up and starts looking around the apartment a bit.\r\n          He walks over to a small cabinet.\r\n                         \r\n<b>                          ABEL\r\n</b>           Does he have any money?\r\n                         \r\n<b>                          LUISA\r\n</b>           I'm sorry?\r\n                         \r\n<b>                          ABEL\r\n</b>           Money? Has he taken money out of\r\n           your bank account?\r\n                         \r\n<b>                          LUISA\r\n</b>           I don't know?\r\n                         \r\n<b>                          ABEL\r\n</b>           You need to start looking into\r\n           these things. It is very important\r\n           that we find him safely.\r\n                         \r\n          And with that JULIAN comes smashing out of the tiny cabinet\r\n          where he was hiding and knocks over ABEL. JULIAN runs to the\r\n          front door with ABEL chasing him.\r\n                         \r\n          He starts flying down the stairs at top panic speed. ABEL\r\n          follows him down half the flight and realizes it is useless.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b><b>                          (IN ENGLISH)\r\n</b>           Stop! Stop running away! Andrew!\r\n           He's coming your way!\r\n                         \r\n          This is screamed at the top of his lungs but JULIAN never\r\n          stops. We just hear his footsteps going down.\r\n                         \r\n                         \r\n<b>          INT. BOTTOM/TOP OF JULIAN'S STAIRWELL - DAY\r\n</b>                         \r\n          ANDREW comes up the first few steps and we see him waiting\r\n          for JULIAN.\r\n                         \r\n          ABEL then looks back up the half flight of stairs and sees\r\n          LUISA standing there in the hall. He walks back up to her in\r\n          an aggressive way. We fear for her. He gets right up in her\r\n          face but does not touch her.\r\n                         \r\n<b>                          ABEL\r\n</b>           (in Spanish again)\r\n           I understand why you lied, but it\r\n           is not smart.\r\n<b>                          (MORE)\r\n</b><b>                          104\r\n</b>                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           There are other people looking for\r\n           him. I am as good an option as he\r\n           has. Know this.\r\n                         \r\n          And with that he heads down the stairs.\r\n                         \r\n                         \r\n<b>          EXT. BACK OF JULIAN'S APARTMENT/PARK STAIRS - DAY\r\n</b>                         \r\n          JULIAN is running out the back of the building and down a\r\n          huge exterior staircase that is in a small park. He is about\r\n          half way down when ANDREW gets to the top. ANDREW screams.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Fuck You! You better run!\r\n                         \r\n                         \r\n<b>          INT. A SLIGHTLY RUNDOWN CONFERENCE ROOM - DAY\r\n</b>                         \r\n          ABEL sits across a table from an OLD MAN in his late-70's who\r\n          seems to have early-onset dementia and a WOMAN in her early-\r\n          20's, LORRAINE LEFKOWITZ who's overweight, but confident. The\r\n          old man, SAUL LEFKOWITZ, just sits there through the scene.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you both for agreeing to meet\r\n           with me.\r\n                         \r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           Of course.\r\n                         \r\n<b>                          ABEL\r\n</b>           I think we have met before but I\r\n           didn't realize you were Saul's\r\n           Granddaughter.\r\n                         \r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           I am.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm sorry to ask but how old are\r\n           you?\r\n                         \r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           I'm 23.\r\n                         \r\n<b>                          ABEL\r\n</b>           Oh.\r\n                         \r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           My Grandfather didn't trust any of\r\n           his children to run the business.\r\n<b>                          105\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           I know that you tried to buy the\r\n           company from my Grandfather several\r\n           times.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n<b>                          LORRAINE LEFKOWITZ\r\n</b>           His goal was to stay healthy long\r\n           enough to be able to give the\r\n           company to me. Which he thankfully\r\n           did.\r\n                         \r\n          They both give a slight smile.\r\n                         \r\n<b>           LORRAINE LEFKOWITZ (CONT'D)\r\n</b>           So, while I appreciate your visit\r\n           we are still not for sale.\r\n                         \r\n<b>                          ABEL\r\n</b>           I understand. And I hope that your\r\n           Grandfather was able to communicate\r\n           to you how much I have always\r\n           respected him. And it was only out\r\n           of respect for the business he had\r\n           built, and because I knew of his\r\n           reservations and feelings about\r\n           your uncles and your father that I\r\n           made those offers.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           I understand.\r\n                         \r\n<b>                          ABEL\r\n</b>           But, I am not here to offer to buy\r\n           your company.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           Oh.\r\n                         \r\n<b>                          ABEL\r\n</b>           As I'm sure you will soon learn\r\n           some years are good... others not\r\n           so. I am in contract with a\r\n           significant hard deposit at risk to\r\n           purchase the old Bayfront terminal.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           I see.\r\n<b>                          106\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           And due to circumstances beyond my\r\n           control my bank has left me at the\r\n           altar.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ABEL\r\n</b>           So, I am here, hat in hand, looking\r\n           for a loan. I certainly expect the\r\n           terms to be in your favor as I\r\n           could not be at a weaker place.\r\n           But, if your Grandfather trusted\r\n           you with his company, I would be\r\n           willing to trust you as my lien\r\n           holder.\r\n                         \r\n          They all stare at each other. Then the old man shifts in his\r\n          chair.\r\n                         \r\n<b>                          SAUL LEFKOWITZ\r\n</b>           How much?\r\n                         \r\n<b>                          ABEL\r\n</b>           I need $500,000.\r\n          SAUL and his GRANDDAUGHTER look at each other. They say\r\n          nothing but clearly know each other well.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           Would you give us a minute.\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course.\r\n                         \r\n                         \r\n<b>          INT. WAITING AREA, OUTSIDE THE CONFERENCE ROOM - DAY\r\n</b>                         \r\n          ABEL sits in a simple chair outside the conference room\r\n          looking around at an office that is similar to his. A phone\r\n          on the receptionist's desk rings. She picks it up.\r\n                         \r\n<b>                          LEFKOWITZ RECEPTIONIST\r\n</b>           You can go back in.\r\n                         \r\n                         \r\n<b>          INT. SLIGHTLY RUNDOWN CONFERENCE ROOM - DAY\r\n</b>                         \r\n          ABEL sits down.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           We can offer you the 500k at 20\r\n           percent for a year.\r\n<b>                          (MORE)\r\n</b><b>                          107\r\n</b>                         \r\n<b>           LORAINE LEFKOWITZ (CONT'D)\r\n</b>           And we would need a five-year\r\n           straight wholesale holding\r\n           agreement for 250,000 gallons a\r\n           year at your new facility.\r\n                         \r\n          This hits ABEL hard.\r\n                         \r\n<b>                          ABEL\r\n</b>           Okay. Thank you.\r\n          They shake hands and then he hugs the old man good bye.\r\n                         \r\n<b>                          LORAINE LEFKOWITZ\r\n</b>           So, I guess we will see you\r\n           tonight?\r\n                         \r\n<b>                          ABEL\r\n</b>           Tonight? Oh yes, of course.\r\n                         \r\n                         \r\n<b>          INT. LONG ISLAND ITALIAN RESTAURANT - NIGHT\r\n</b>                         \r\n          A HOSTESS leads ABEL and ANDREW through the whole main dining\r\n          room and through a side kitchen.\r\n                         \r\n<b>          INT. ITALIAN RESTAURANT - PRIVATE DINING ROOM - NIGHT\r\n</b>                         \r\n          Finally they come through a door and into a small back\r\n          private dining room where fifteen of their COMPETITORS, a\r\n          couple of whom we have already met (Including LORRAINE and\r\n          SAUL LEFKOWITZ, and ARNOLD KLINE), are sitting around the\r\n          table meeting and waiting for them to arrive. The whole room\r\n          looks up at them.\r\n                         \r\n          O'LEARY is at the head of the table at the far end of the\r\n          room. He stands up to greet them and then so does the rest of\r\n          the room.\r\n                         \r\n<b>                          BILL O'LEARY\r\n</b>           Abel. Please sit.\r\n                         \r\n          Finally everyone settles and the room falls quiet.\r\n                         \r\n<b>           BILL O'LEARY (CONT'D)\r\n</b>           Abel.\r\n                         \r\n          Now the room is silent as it waits and waits for him to\r\n          speak.\r\n                         \r\n<b>                          ABEL\r\n</b>           Stop...\r\n<b>                          108\r\n</b>                         \r\n                         \r\n          ABEL is deadly serious. He just lets this sit and looks\r\n          around the room at each person. They all seem to be waiting\r\n          for him to continue. But he doesn't. He just lets this sit.\r\n          Finally PETER FORENTE, who is across from ABEL, shifts in his\r\n          seat and leans forward.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Um... Abel... we had a chance to\r\n           meet for a little bit before you\r\n           got here and... of course everyone\r\n           in this room is fully capable of\r\n           lying to their own mothers on their\r\n           deathbeds, but... the conclusion we\r\n           have come to... I should say we are\r\n           fairly convinced after a very frank\r\n           conversation... that these guys who\r\n           are doing this... that they don't\r\n           actually work for anyone in this\r\n           room. As you know there are many\r\n           other smaller providers in the area\r\n           that might be responsible who are\r\n           not here tonight.\r\n                         \r\n          This sits in the room for a long beat. Everyone then shifts\r\n          back their attention to ABEL waiting for his response.\r\n          Finally.\r\n<b>                          ABEL\r\n</b>           Peter... thank you... That may be\r\n           true.\r\n                         \r\n          He stops and thinks about how to continue.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           But over the last six months\r\n           110,000 gallons of fuel has been\r\n           stolen from my family and I. Now\r\n           the reason we asked Bill to get you\r\n           all here is because the people in\r\n           this room are the only people\r\n           within two hundred miles of here\r\n           who have the ability to purchase\r\n           and store that kind of quantity.\r\n           So... no matter what bullshit you\r\n           have been telling each other one of\r\n           you... or two... or three... has\r\n           been allowing this to happen by\r\n           buying this from these cowards or\r\n           worse yet hiring these guys just to\r\n           do it. And profiting from it. So\r\n           what I am saying is... Stop! Now.\r\n           Have some pride in what you do and\r\n           stop.\r\n<b>                          109\r\n</b>                         \r\n                         \r\n<b>          INT. ANNA MORALES' LIBRARY - NIGHT\r\n</b>          The camera moves slowly across a dark hallway. We hear the\r\n          sounds of a manual adding machine grinding away. As we come\r\n          through the doorway we see ANNA MORALES sitting at her desk\r\n          in a pool of light from the desk lamp. She is deep in it\r\n          crunching numbers. Finally ABEL walks into the doorway, he\r\n          looks exhausted.\r\n                         \r\n<b>                          ABEL\r\n</b>           Hey.\r\n                         \r\n          She looks up with a small but sweet smile.\r\n                         \r\n<b>                          ANNA\r\n</b>           Hi.\r\n                         \r\n<b>                          ABEL\r\n</b>           How's it coming?\r\n                         \r\n<b>                          ANNA\r\n</b>           I've made it to 1975.\r\n                         \r\n<b>                          ABEL\r\n</b>           That was a good year.\r\n          ANNA gives a slight look that the numbers may not totally\r\n          support that claim.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Well it was for me...how is it?\r\n                         \r\n<b>                          ANNA\r\n</b>           I'm not sure yet... but it's not as\r\n           bad as they are saying it is... I\r\n           guess I knew what I was doing.\r\n                         \r\n          They give each other a slight smile.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           How'd you do?\r\n                         \r\n<b>                          ABEL\r\n</b>           I got us a three more days... and\r\n           one piece... from Saul. But we're\r\n           still about a million short.\r\n                         \r\n          Concern and exhaustion creep onto Abel's face.\r\n                         \r\n<b>                          ANNA\r\n</b>           You're going to see your little\r\n           brother?\r\n<b>                          110\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           First thing.\r\n<b>                          ANNA\r\n</b>           And Peter?\r\n                         \r\n<b>                          ABEL\r\n</b>           Probably.\r\n                         \r\n          Abel is now sitting down on the chair.\r\n<b>                          ABEL (CONT'D)\r\n</b>           How are the girls? I feel like I\r\n           haven't seen them in days.\r\n                         \r\n<b>                          ANNA\r\n</b>           They're fine.\r\n                         \r\n          ANNA gets up from her desk and comes over to him.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           This is all worth it.\r\n                         \r\n          He pauses just long enough to think.\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course.\r\n                         \r\n<b>                          ANNA\r\n</b>           Look at us...it is.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know.\r\n                         \r\n          A sense of caring and resolve comes over them. At least now\r\n          they know what needs to be done.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           We should get to bed.\r\n                         \r\n<b>                          ANNA\r\n</b>           I'll be up.\r\n                         \r\n<b>                          ABEL\r\n</b>           I love you.\r\n                         \r\n<b>                          ANNA\r\n</b>           I love you too.\r\n                         \r\n          ABEL turns to go upstairs as ANNA starts in again with the\r\n          machine.\r\n<b>                          111\r\n</b>                         \r\n                         \r\n<b>          INT. ABEL'S CAR - DRIVING - DAY\r\n</b>          ABEL is driving towards the office and is listening to the\r\n          idle chatter on the radio between the dispatcher and the\r\n          drivers who are out. They are underneath the Brooklyn Queens\r\n          Expressway in stop and go traffic.\r\n                         \r\n          Suddenly a panic stricken VOICE blasts through on the radio.\r\n                         \r\n<b>           SENIOR DRIVER EDDY V.O.\r\n</b>           Motherfuckers!\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Who's that?\r\n                         \r\n<b>           SENIOR DRIVER EDDY V.O.\r\n</b>           It's 17. Two guys are coming at me.\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Where are you?\r\n                         \r\n          We now hear the driver yell at the TWO GUYS coming at him.\r\n                         \r\n<b>           SENIOR DRIVER EDDY V.O.\r\n</b>           Fuck you!\r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Where are you!\r\n                         \r\n<b>           SENIOR DRIVER EDDY V.O.\r\n</b>           Hall Street and Flushing Ave. I'm\r\n           out of...\r\n                         \r\n<b>           RADIO DISPATCHER V.O.\r\n</b>           Eddy? Eddy?\r\n                         \r\n          ABEL looks up at the street where they are and realizes this\r\n          is going down right down the street from them. He's had\r\n          enough.\r\n                         \r\n          He pulls across the intersection and heads down a street. He\r\n          comes to the next intersection and right in front of him the\r\n          truck comes flying by.\r\n                         \r\n          He looks to his right and sees EDDY standing at the side of\r\n          the road. But he wants to end this. So he pulls out and\r\n          starts following the truck leaving EDDY behind.\r\n                         \r\n          ABEL follows the truck for several blocks through the\r\n          industrial neighborhood. He is tempted to pull up alongside\r\n          of it to see who is driving but doesn't. He continues to\r\n          follow him.\r\n<b>                          112\r\n</b>                         \r\n                         \r\n          They get to a light and the truck makes a right hand turn\r\n          and, as they are turning, LOUIS SERVIDIO who is sitting in\r\n          the passenger seat looks behind him and sees that ABEL is\r\n          following him. It now turns into a high speed chase as the\r\n          driver steps on it.\r\n                         \r\n          They race down a ramp into a railyard. ABEL chases the truck\r\n          as it crosses the tracks and heads towards an abandoned\r\n          tunnel. The truck races into the tunnel and ABEL follows. The\r\n          truck is throwing up a dust storm and ABEL has a difficult\r\n          time seeing where he is going but he keeps up.\r\n                         \r\n          The roadway is very bumpy and both the truck and ABEL'S car\r\n          are thrown around and the truck almost hits the sides of the\r\n          tunnel.\r\n                         \r\n          The light at the end of the tunnel starts to appear through\r\n          the dust but we can't see the truck. As ABEL comes into the\r\n          light he has to SLAM on his brakes because the TRUCK has\r\n          flipped over in front of him.\r\n                         \r\n          As he gets out of his car he sees LOUIS SERVIDIO jumping down\r\n          from the overturned cab and run off into the train yard. ABEL\r\n          looks at the crushed cab of the truck and sees the DRIVER has\r\n          been killed. There is a gun sitting on the dash of the truck\r\n          and ABEL looks and thinks. He then picks up the gun and\r\n          chases after LOUIS SERVIDIO.\r\n                         \r\n          In the distance he sees LOUIS SERVIDIO leave the yard and\r\n          head up into an elevated subway station.\r\n                         \r\n                         \r\n<b>          EXT. SUBWAY STATION - DAY\r\n</b>                         \r\n          ABEL runs up the stairs of the station and hops onto a\r\n          leaving train just as the doors shut. ABEL looks around.\r\n          There are three people in his car. It is covered in graffiti.\r\n          He starts making his way down to the end of the train where\r\n          the guy is.\r\n                         \r\n          He looks into the last car and sees LOUIS SERVIDIO and just\r\n          bull rushes him to the ground. He starts beating on him very,\r\n          very badly with the pistol. All the rage comes out of him. He\r\n          then aims the gun at LOUIS SERVIDIO.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           Please. Please.\r\n                         \r\n          They stare at each other.\r\n                         \r\n<b>                          ABEL\r\n</b>           Your friend is dead... who do you\r\n           work for.\r\n<b>                          113\r\n</b>                         \r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           You know I could never tell you\r\n           that.\r\n                         \r\n<b>                          ABEL\r\n</b>           Stop... just stop.\r\n                         \r\n<b>                          LOUIS SERVIDIO\r\n</b>           This was it anyway. Okay... Okay.\r\n          ABEL looks right through him and then finally lowers the gun\r\n          and releases his hands from around his jacket and he gets up\r\n          and looks back at ABEL.\r\n                         \r\n<b>           LOUIS SERVIDIO (CONT'D)\r\n</b>           Thank you.\r\n                         \r\n          LOUIS SERVIDIO then runs out of the car as the door opens.\r\n          ABEL sits up and slows his breathing down. Finally he looks\r\n          around the trashed car and sees that a woman has been in the\r\n          car with them the whole time and she is just staring at him.\r\n                         \r\n                         \r\n<b>          INT. BROOKLYN BARBERSHOP - DAY\r\n</b>                         \r\n          ABEL walks into the shop and is a little put back together\r\n          but is worse for the wear. ARNOLD KLINE is sitting in one of\r\n          the chairs waiting. He turns to ABEL.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Hey.\r\n                         \r\n<b>                          ABEL\r\n</b>           Jimmy, can you give me a minute?\r\n                         \r\n          Jimmy looks around then walks into the back.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Abel, that was well said.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           What can I do for you?\r\n                         \r\n<b>                          ABEL\r\n</b>           I've just come to collect that\r\n           check you owe me.\r\n                         \r\n          This takes him back a step.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           What check is that?\r\n<b>                          114\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           The one for $213,000.\r\n<b>                          ARNOLD KLINE\r\n</b>           I'm sorry?\r\n                         \r\n<b>                          ABEL\r\n</b>           That's how much has been taken from\r\n           me over the last six months.\r\n<b>                          ARNOLD KLINE\r\n</b>           I had nothing to do with that.\r\n                         \r\n<b>                          ABEL\r\n</b>           Your Far Rockaway facility bought a\r\n           load of fuel last week off one of\r\n           my stolen trucks.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           That's not possible.\r\n                         \r\n<b>                          ABEL\r\n</b>           I was standing on top of one of my\r\n           hi-jacked trucks a couple weeks ago\r\n           thinking about the cowards who did\r\n           this when I remembered I had bought\r\n           the load of fuel off a friend's\r\n           tanker straight from Texas. As I'm\r\n           sure you know Texas #4 is marked.\r\n           But that was just one load, so\r\n           every truck that has left my lot\r\n           for the last two weeks has been\r\n           marked with dye that I've put in...\r\n           And luckily four more of my trucks\r\n           got jacked since.... My guess is\r\n           there are at least 4600 gallons of\r\n           marked fuel in your small tank\r\n           right now.\r\n                         \r\n          No answer. Finally.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           How much?\r\n                         \r\n<b>                          ABEL\r\n</b>           I said...213,000.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           I'll need a day.\r\n                         \r\n<b>                          ABEL\r\n</b>           Okay.\r\n                         \r\n          ABEL gets ready to leave.\r\n<b>                          115\r\n</b>                         \r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           I've just been buying this stuff\r\n           off these guys, it was only a\r\n           couple loads, I don't know who they\r\n           are. I would never do that.\r\n                         \r\n<b>                          ABEL\r\n</b>           My goal was to have you out of\r\n           business by the end of next year.\r\n           And if you're this fucking\r\n           desperate it doesn't seem like it\r\n           will even take that long.\r\n                         \r\n          He walks away.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           Abel, I wasn't the only person\r\n           buying this shit.\r\n                         \r\n          He turns.\r\n                         \r\n<b>                          ABEL\r\n</b>           I don't care.\r\n                         \r\n<b>                          ARNOLD KLINE\r\n</b>           It may ruin me.\r\n<b>                          ABEL\r\n</b>           When you find out who else it was\r\n           you can get them to pay you back\r\n           the difference. Kinda makes you\r\n           miss having your father around? But\r\n           I need the whole lot tomorrow or\r\n           the feds will be at your doorstep\r\n           by noon.\r\n                         \r\n          He leaves.\r\n                         \r\n                         \r\n<b>          EXT. UNIVERSITY ATHLETIC FIELD - DAY\r\n</b>                         \r\n          ABEL is sitting on a bleacher totally alone watching a prep\r\n          school football practice. We stay with him as he sits quietly\r\n          just watching.\r\n                         \r\n          Eventually his 21-YEAR-OLD YOUNGER BROTHER, ELIAS, comes\r\n          walking off the field over to him. PLAYERS start leaving the\r\n          field.\r\n                         \r\n<b>                          ABEL\r\n</b>           You look good out there.\r\n                         \r\n<b>                          ELIAS\r\n</b>           I didn't know you were coming.\r\n<b>                          116\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I didn't either... I didn't mean to\r\n           take you away.\r\n                         \r\n<b>                          ELIAS\r\n</b>           We're done.\r\n                         \r\n          He sits down next to him. They both look out for a long, long\r\n          beat.\r\n<b>                          ELIAS (CONT'D)\r\n</b>           Thanks for coming.\r\n                         \r\n<b>                          ABEL\r\n</b>           Of course. You've grown.\r\n                         \r\n<b>                          ELIAS\r\n</b>           You saw me a month ago.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know... but you have.\r\n                         \r\n          ABEL looks across as a small group of GIRLS FIELD HOCKEY\r\n          PLAYERS walk across the field in front of them. They watch\r\n          them pass and walk away.\r\n<b>                          ABEL (CONT'D)\r\n</b>           The girls at this place... they are\r\n           so beautiful?\r\n                         \r\n          He looks over with a wry smile.\r\n                         \r\n<b>                          ELIAS\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           I don't know how you get anything\r\n           done around here.\r\n                         \r\n<b>                          ELIAS\r\n</b>           I don't.\r\n                         \r\n          Slight smile at each other.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm in a bit of a rough patch.\r\n                         \r\n<b>                          ELIAS\r\n</b>           Yes...\r\n                         \r\n<b>                          ABEL\r\n</b>           It happens.\r\n<b>                          117\r\n</b>                         \r\n                         \r\n<b>                          ELIAS\r\n</b>           I know.\r\n<b>                          ABEL\r\n</b>           Good...\r\n                         \r\n          ABEL stands and looks around for a good bit. Then thinks\r\n          about sitting down again.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           That will be your burden...\r\n                         \r\n<b>                          ELIAS\r\n</b>           What will?\r\n                         \r\n<b>                          ABEL\r\n</b>           Not having had one.\r\n                         \r\n          Then he sits.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I need your signature on this.\r\n                         \r\n          ELIAS looks over.\r\n                         \r\n<b>                          ELIAS\r\n</b>           What is it?\r\n                         \r\n<b>                          ABEL\r\n</b>           I need to take out a short term\r\n           mortgage on our apartment building.\r\n                         \r\n<b>                          ELIAS\r\n</b>           That thing isn't worth more than\r\n           150 grand though?\r\n                         \r\n<b>                          ABEL\r\n</b><b>           210.\r\n</b>                         \r\n<b>                          ELIAS\r\n</b>           Since when do you need to be taking\r\n           out sucker mortgages for 200 grand?\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm up against it a bit. It will be\r\n           fine.\r\n                         \r\n          They look at each other for a long beat. And then he signs\r\n          it.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Thank you... It's good to see your\r\n           face.\r\n<b>                          118\r\n</b>                         \r\n                         \r\n<b>                          ELIAS\r\n</b>           I love you.\r\n<b>                          ABEL\r\n</b>           I love you too.\r\n                         \r\n          They hug and then ELIAS walks off. ABEL sits back down and\r\n          just watches him walk away.\r\n                         \r\n<b>          INT. FORENTE TENNIS COURT - NIGHT\r\n</b>                         \r\n          ABEL walks into the darkened tennis court and looks around.\r\n          We aren't sure what he is there for. On the other side of the\r\n          court a light is on in a attached lounge. PETER comes into\r\n          the light.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Well here he is. The caped\r\n           crusader.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Come over. Are you alright?\r\n<b>                          ABEL\r\n</b>           I am.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Did they catch any of them? Sit.\r\n                         \r\n                         \r\n<b>          INT. TENNIS COURT LOUNGE - CONTINUOUS\r\n</b>                         \r\n<b>                          ABEL\r\n</b>           The one guy didn't make it out of\r\n           the crash, and the other guy\r\n           disappeared.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           That was very well said last night.\r\n                         \r\n<b>                          ABEL\r\n</b>           Thank you. And thanks for seeing\r\n           me.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Of course. So what is it?\r\n                         \r\n<b>                          ABEL\r\n</b>           I need a loan.\r\n<b>                          119\r\n</b>                         \r\n                         \r\n          PETER'S face scrunches up like he tasted a lemon and he turns\r\n          away for a beat. Then comes back.\r\n<b>                          PETER FORENTE\r\n</b>           You don't want to do that.\r\n                         \r\n<b>                          ABEL\r\n</b>           No shit... but I'm here.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           What are we talking about here.\r\n                         \r\n<b>                          ABEL\r\n</b>           Six hundred thousand.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Jesus. Abel, that's a problem.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes... but if I don't get it...\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           What's my collateral?\r\n                         \r\n<b>                          ABEL\r\n</b>           The terminal.\r\n<b>                          PETER FORENTE\r\n</b>           Yeah me and how many other people\r\n           will be coming after it. No way.\r\n                         \r\n<b>                          ABEL\r\n</b>           You'll get your money.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Abel, you know I respect everything\r\n           you've done. Because of it we\r\n           haven't come down on you the way I\r\n           should have for coming into my\r\n           service area and poaching my\r\n           customers. You're good at what you\r\n           do, probably better than us, and I\r\n           accept that. But this would be\r\n           different. I don't want you to be\r\n           in this position. We are not nice\r\n           people to borrow three quarters of\r\n           million dollars from.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know that.\r\n                         \r\n<b>                          PETER FORENTE\r\n</b>           Let's sleep on this. Both of us.\r\n<b>                          120\r\n</b>                         \r\n                         \r\n<b>          INT. ABEL AND ANNA'S LIVING ROOM - NIGHT\r\n</b>          ABEL comes in as ANNA is sitting at the table smoking. He\r\n          walks over and sits down at the table with her.\r\n                         \r\n          She gives him a great sly smile.\r\n                         \r\n<b>                          ANNA\r\n</b>           What a day.\r\n<b>                          ABEL\r\n</b>           Yeah.\r\n                         \r\n<b>                          ANNA\r\n</b>           Are you okay?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          ANNA\r\n</b>           Car chases?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yeah.\r\n                         \r\n<b>                          ANNA\r\n</b>           Who knew?\r\n                         \r\n          She gives him a loving look.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           How was your brother?\r\n                         \r\n<b>                          ABEL\r\n</b>           He seemed good... But the girls up\r\n           at that place are...\r\n                         \r\n<b>                          ANNA\r\n</b>           Stop.\r\n                         \r\n<b>                          ABEL\r\n</b>           I can tell you the girls didn't\r\n           look like that where I went to\r\n           school...\r\n                         \r\n<b>                          ANNA\r\n</b>           Enough.\r\n                         \r\n          After a brief light moment the cloud comes back over him.\r\n                         \r\n<b>                          ABEL\r\n</b>           How are we here?\r\n<b>                          121\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           It was a lot of things all at once.\r\n<b>                          ABEL\r\n</b>           Yeah.\r\n                         \r\n<b>                          ANNA\r\n</b>           How did it go?\r\n                         \r\n<b>                          ABEL\r\n</b>           We can probably pull it off. Three\r\n           different parties... it'll be a\r\n           mess... and the terms... Peter\r\n           suddenly showed me his true colors.\r\n                         \r\n          He lets out a brutal sigh.\r\n                         \r\n<b>                          ANNA\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ABEL\r\n</b>           I spent my whole life trying not to\r\n           become a gangster...\r\n                         \r\n<b>                          ANNA\r\n</b>           I know.\r\n<b>                          ABEL\r\n</b>           ...And now... on the biggest deal\r\n           in my career they will all control\r\n           me.\r\n                         \r\n          He sits there for a long beat and then she comes and hands\r\n          him a piece of paper with a series of numbers on it. He looks\r\n          up at her.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           What is this?\r\n                         \r\n<b>                          ANNA\r\n</b>           It's a bank account.\r\n                         \r\n          ABEL just waits for more but gets nothing.\r\n                         \r\n<b>                          ABEL\r\n</b>           Whose?\r\n                         \r\n<b>                          ANNA\r\n</b>           Ours.\r\n                         \r\n<b>                          ABEL\r\n</b>           How much is in it?\r\n<b>                          122\r\n</b>                         \r\n                         \r\n<b>                          ANNA\r\n</b>           A lot.\r\n<b>                          ABEL\r\n</b>           What does that mean?\r\n                         \r\n<b>                          ANNA\r\n</b>           It will help. You could replace\r\n           Peter's money and get him out of\r\n           the deal.\r\n<b>                          ABEL\r\n</b>           Where did it come from?\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel.\r\n                         \r\n<b>                          ABEL\r\n</b>           Where did it come from?\r\n                         \r\n          She stops and thinks, then:\r\n                         \r\n<b>                          ANNA\r\n</b>           Since 1971 I have been skimming\r\n           money out of the company. Some\r\n           years a little... others a lot. In\r\n           the beginning it was just in case\r\n           times got tough but then it was\r\n           because you were taking all these\r\n           chances... I didn't know what else\r\n           to do... I couldn't risk having us\r\n           be left with nothing.\r\n                         \r\n          This knocks him back.\r\n                         \r\n<b>                          ANNA (CONT'D)\r\n</b>           I'm sorry.\r\n                         \r\n<b>                          ABEL\r\n</b>           What do you expect me to do with\r\n           this?\r\n                         \r\n<b>                          ANNA\r\n</b>           Use it.... Abel...\r\n                         \r\n<b>                          ABEL\r\n</b>           Is it clean?\r\n                         \r\n<b>                          ANNA\r\n</b>           What does that mean?\r\n                         \r\n          He thinks that through.\r\n<b>                          123\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           It means if you walked into the\r\n           office of the people who have been\r\n           trying to put us in jail right now\r\n           and slapped a check from that\r\n           account down on their desk would it\r\n           push me further into hell or help\r\n           to get me out?\r\n                         \r\n<b>                          ANNA\r\n</b>           It's as clean as every other dollar\r\n           we've ever made.\r\n                         \r\n<b>                          ABEL\r\n</b>           That's a fucking bullshit answer.\r\n                         \r\n<b>                          ANNA\r\n</b>           I can clear it on the books.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well it sounds like you should take\r\n           this money and keep it right where\r\n           it is... because I'm going to\r\n           pretend that we never had this\r\n           conversation. And you can use that\r\n           when they drag me off to jail!\r\n          With that he tries to get passed her and head upstairs. She\r\n          follows and is standing looking up at him.\r\n                         \r\n<b>                          ANNA\r\n</b>           So what's your plan here?\r\n                         \r\n          He turns to her and squares off.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'll get it done. And it won't be\r\n           as a cheat.\r\n                         \r\n<b>                          ANNA\r\n</b>           (Yelling, but controlled enough to\r\n           not wake the kids.)\r\n           Oh you are too much. You've been\r\n           walking around your whole life like\r\n           this all happened because of your\r\n           hard work, good luck, and charm.\r\n           Mr. Fucking American Dream. Well\r\n           this is America... but it's not a\r\n           dream, and that wasn't good luck\r\n           helping you out all those years...\r\n           IT WAS ME! Doing the things you\r\n           didn't want to know about...\r\n<b>                          124\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           You stole from me!\r\n          This stops her in her tracks. And eventually a little smile\r\n          comes across her face. She comes way down and almost delivers\r\n          this line in a whisper.\r\n                         \r\n<b>                          ANNA\r\n</b>           Oh... You have always been very\r\n           good about not letting your ego get\r\n           in the way of business. Don't start\r\n           now just because it's me.\r\n                         \r\n          With that ABEL turns up the stairs and heads to bed.\r\n                         \r\n                         \r\n<b>          INT. MASTER BATHROOM - MORNING\r\n</b>                         \r\n          ABEL is getting ready for the day shaving. He looks\r\n          exhausted. ANNA comes into the room. She stands at the\r\n          entryway just looking at him for a very long beat.\r\n                         \r\n<b>                          ABEL\r\n</b>           We'll use the money... your money.\r\n           It's the smart play.\r\n<b>                          ANNA\r\n</b>           It's our money.\r\n                         \r\n<b>                          ABEL\r\n</b>           I know...\r\n                         \r\n<b>           FADE TO BLACK.\r\n</b>                         \r\n          Before we see anything, we hear the sound of a pen writing on\r\n          paper.\r\n                         \r\n                         \r\n<b>          INT. THE TEMPORARY OFFICE TRAILER - DAY\r\n</b>                         \r\n          ABEL and ANDREW are sitting around the folding table opposite\r\n          the HASIDS. ABEL signs the document and then picks it up and\r\n          heads outside.\r\n                         \r\n                         \r\n<b>          EXT. TEMPORARY TRAILER - DAY\r\n</b>                         \r\n          ABEL comes out and we see ANNA standing outside the trailer\r\n          in the cold because these guys don't do business with women.\r\n          He hands her the document. Under her breath:\r\n                         \r\n<b>                          ANNA\r\n</b>           These fucking guys...what's this\r\n           additional $11,000?\r\n<b>                          125\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I guess there is still some fuel in\r\n           two of the tanks... they gave us a\r\n           fair price on it.\r\n                         \r\n          With that they both smile, she signs it and then gives him a\r\n          kiss.\r\n                         \r\n                         \r\n<b>          INT. TEMPORARY TRAILER - DAY\r\n</b>          ABEL comes back in and hands the docs to JOSEPH, the oldest\r\n          Hasid, who signs them.\r\n                         \r\n<b>                          JOSEPH\r\n</b>           Mazel Tov.\r\n                         \r\n                         \r\n<b>          EXT. TRAILER/TANK FARM - DAY\r\n</b>                         \r\n          ABEL walks across the lot with joy although it seems masked\r\n          by a sadness. He looks around as ANDREW and ANNA come up next\r\n          to him.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Congratulations.\r\n<b>                          ABEL\r\n</b>           To you too. Did you know...about\r\n           the money?\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel.\r\n                         \r\n          ANDREW looks him right in the eye.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Yes.\r\n                         \r\n<b>                          ABEL\r\n</b>           You should have told me.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           I know. I'm sorry.\r\n                         \r\n<b>                          ANNA\r\n</b>           Abel...congratulations. Now cheer\r\n           up. And can someone give me a tour\r\n           of this place we just paid two\r\n           million bucks for?\r\n                         \r\n          ABEL, ANDREW, and ANNA walk towards the tanks looking around.\r\n          They come around the corner to THE VIEW.\r\n<b>                          126\r\n</b>                         \r\n                         \r\n<b>          EXT. BEHIND THE TANKS, WITH A VIEW OF THE CITY - DAY\r\n</b>          They all look out.\r\n                         \r\n<b>                          ANNA\r\n</b>           What a hell-hole this city is.\r\n                         \r\n<b>                          ABEL\r\n</b>           No.\r\n<b>                          ANDREW WALSH\r\n</b>           I don't know why but I guess I\r\n           never realized we even had this\r\n           view from back here.\r\n                         \r\n          That line sits for a long beat.\r\n                         \r\n<b>                          ABEL\r\n</b>           I did.\r\n                         \r\n          Then they hear someone behind them. They turn. It's JULIAN.\r\n          He is standing holding a gun. They stare for a long beat.\r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           I thought you said you threw that\r\n           into the river?\r\n<b>                          JULIAN\r\n</b>           I didn't.\r\n                         \r\n<b>                          ABEL\r\n</b>           I see that.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I have nowhere to go.\r\n                         \r\n<b>                          ABEL\r\n</b>           Nowhere easy.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Fuck you. I have nothing. And\r\n           somehow you've ended up with\r\n           everything you wanted.\r\n                         \r\n          ABEL looks at the gun in his hand.\r\n                         \r\n<b>                          ABEL\r\n</b>           It wasn't meant to be.\r\n                         \r\n<b>                          JULIAN\r\n</b>           What is that supposed to mean?\r\n<b>                          127\r\n</b>                         \r\n                         \r\n<b>                          ABEL\r\n</b>           I know what you wanted. But you\r\n           need to forget that. You are\r\n           looking backward. Only look\r\n           forward, that is what you can\r\n           control.\r\n                         \r\n<b>                          JULIAN\r\n</b>           I'm sorry. You gave me a very good\r\n           chance. Right?\r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Probably a better chance than I\r\n           deserved.\r\n                         \r\n<b>                          ABEL\r\n</b>           No.\r\n                         \r\n<b>                          JULIAN\r\n</b>           Please take care of my family.\r\n                         \r\n<b>                          ABEL\r\n</b>           Julian.\r\n<b>                          JULIAN\r\n</b>           Please...\r\n                         \r\n          ABEL looks at him trying to read where this poor kid is at.\r\n                         \r\n<b>                          ABEL\r\n</b>           I will.\r\n                         \r\n          With that JULIAN takes the gun and puts it in his mouth and\r\n          pulls the trigger.\r\n                         \r\n          The gun goes off and the red blood sprays on the white side\r\n          of the fuel tank that is behind him.\r\n                         \r\n          ABEL and the rest are left totally in shock. They are beside\r\n          themselves. But out of the corner of his eye ABEL notices\r\n          that the bullet has also pierced through the tank and amid\r\n          the red spray a flow of black heating oil is pouring out\r\n          through the bullet hole onto the ground.\r\n                         \r\n          ABEL steps around JULIAN'S body and goes over to the hole. He\r\n          picks up an old rag from the ground and stuffs it into the\r\n          hole plugging the flow of oil.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           What... what should we do?\r\n<b>                          128\r\n</b>                         \r\n                         \r\n          ABEL turns and looks back at him.\r\n<b>                          ABEL\r\n</b>           We call the police.\r\n                         \r\n<b>                          ANDREW WALSH\r\n</b>           Really?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes!\r\n          With that he walks off behind the tanks.\r\n                         \r\n                         \r\n<b>          EXT. PARKING LOT, NEXT TO THE TANK FARM SITE - DAY\r\n</b>                         \r\n          There are now POLICE VEHICLES everywhere. ABEL is standing\r\n          off alone. The DA gets out of a car all alone and walks over\r\n          to ABEL.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'm very sorry. Did you know him\r\n           well?\r\n                         \r\n<b>                          ABEL\r\n</b>           I did.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           He must have been under a hell of a\r\n           lot of pressure.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yeah. For a while I thought he\r\n           was... it's just...\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I'm sorry.\r\n                         \r\n          They look out across the city.\r\n                         \r\n<b>                          ABEL\r\n</b>           You really do have to be lucky.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Yes... so you are chasing down\r\n           hijackers now?\r\n                         \r\n<b>                          ABEL\r\n</b>           I was right there... I couldn't\r\n           help myself.\r\n                         \r\n          LAWRENCE nods approval.\r\n<b>                          129\r\n</b>                         \r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           Have you found the driver?\r\n<b>           A.D.A. LAWRENCE\r\n</b>           No.\r\n                         \r\n<b>                          ABEL\r\n</b>           You'll find him.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Probably not.\r\n                         \r\n<b>                          ABEL\r\n</b>           Well, thank you for coming. I\r\n           wanted to make sure this was\r\n           handled correctly.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Of course.\r\n                         \r\n<b>                          ABEL\r\n</b>           I'm not sure how I got here.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           Yeah.\r\n<b>                          ABEL\r\n</b>           So... I should tell you that I\r\n           won't be able to take that deal you\r\n           offered. There is no way I would\r\n           ever accept a felony charge for\r\n           anything we've done.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I know.\r\n                         \r\n<b>                          ABEL\r\n</b>           I am not a felon.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           That's probably true.\r\n                         \r\n<b>                          ABEL\r\n</b>           But I also can't have you digging\r\n           around my life and keeping this\r\n           hanging around my neck for the next\r\n           ten years. I love fighting a good\r\n           battle but this... it's very bad\r\n           for my business.\r\n                         \r\n          This gets Lawrence's attention.\r\n<b>                          130\r\n</b>                         \r\n                         \r\n<b>                          ABEL (CONT'D)\r\n</b>           So, we need to come to some sort of\r\n           conclusion.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           We can probably do that.\r\n                         \r\n<b>                          ABEL\r\n</b>           Good.\r\n          They both look out for a beat.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I hear you closed on this terminal\r\n           today?\r\n                         \r\n<b>                          ABEL\r\n</b>           It looks that way.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I didn't realize that you had that\r\n           in the works.\r\n                         \r\n<b>                          ABEL\r\n</b>           For a very long time.\r\n<b>           A.D.A. LAWRENCE\r\n</b>           That will put you in quite a\r\n           powerful position.\r\n                         \r\n<b>                          ABEL\r\n</b>           Within my business it has that\r\n           potential.\r\n                         \r\n          LAWRENCE shifts his tone ever so slightly.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           If you get this place up and\r\n           running again it will have\r\n           significant influence...\r\n           politically speaking.\r\n                         \r\n          ABEL picks up on the word POLITICALLY and stares down\r\n<b>          LAWRENCE.\r\n</b>                         \r\n<b>           A.D.A. LAWRENCE (CONT'D)\r\n</b>           We all have our ambitions.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n          LAWRENCE gives a slight smile and then pauses.\r\n<b>                          131\r\n</b>                         \r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           And sometimes we need help to get\r\n           there... You've come a very long\r\n           way.\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes, I have.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           In a very short time.\r\n<b>                          ABEL\r\n</b>           It doesn't feel that way... But\r\n           please know that I have always\r\n           chosen the path that was the most\r\n           right.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           The most right?\r\n                         \r\n<b>                          ABEL\r\n</b>           Yes.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           That one makes my head hurt a\r\n           little.\r\n<b>                          ABEL\r\n</b>           The result is never in question for\r\n           me. Just what path do I take to get\r\n           there. And I have never questioned\r\n           my path. There is always one that\r\n           is most right. And that is what\r\n           this is.\r\n                         \r\n<b>           A.D.A. LAWRENCE\r\n</b>           I hope so.\r\n                         \r\n          They look at each other and then out over the city.\r\n                         \r\n                         \r\n                         \r\n<b>                          THE END\r\n</b><b>                          \r\n</b>\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/A-Most-Violent-Year.jpg\"/>\n</td><td><h1>A Most Violent Year</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=J.C. Chandor\" title=\"Scripts by J.C. Chandor\">J.C. Chandor</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/A Most Violent Year Script.html#comments\" title=\"A Most Violent Year comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:57:48.088201"}