{"title": "A Serious Man", "film_link": "/Movie Scripts/A Serious Man Script.html", "script_link": "/scripts/A-Serious-Man.html", "info_raw": "\n\nA Serious Man Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Joel Coen  Ethan Coen\nGenres  Comedy\nScript Date : June 2007\nMovie Release Date : October 2009\n\nRead \"A Serious Man\" Script\n\n\n", "script": "\n\n\n                                   A SERIOUS MAN\n\n\n\n                                     Written by\n\n                               Joel Coen & Ethan Coen\n\n\n                                                            June 4th, 2007\n\n\n          \n\n          \n          White letters on a black screen:\n          Receive with simplicity everything that happens to you.\n\n          -RASHI\n\n          \n\n          FADE IN:\n\n          AGAINST BLACK: SNOWFLAKES\n\n          \n          The flakes drift lazily down toward us. Our angle looks straight\n          up.\n          Now an angle looking steeply down: the snow falls not quite dead\n          away to collect on a\n          foreground chimneypot and on the little shtetl street that lies\n          maplike below us.\n          It is night, and quiet, and the street is deserted except for\n          one man who walks away from\n          us, his valenki squeaking in the fresh snow. He carries bundled\n          branches on one shoulder\n          and has a hatchet tucked into his belt.\n\n          \n          We cut down to street level. The man walks toward us, bearded,\n          and bundled against the\n          cold. Smiling, he mutters in Yiddish-the dialogue subtitled.\n\n          \n\n          MAN\n          What a marvel... what a marvel...\n\n          \n\n          HOUSE INTERIOR\n          As its door opens and the man enters.\n\n          \n\n          MAN\n          Dora!\n\n          \n\n          VOICE\n          Yes...\n\n          \n          The man crosses to the stove with his bundle of wood. The voice\n          continues:\n\n          \n\n          \n\n          \n\n          \n\n          2\n          . Can you help me with the ice?\n          The man dumps the wood into a box by the stove as his wife enters\n          with an ice pick.\n          . I expected you hours ago.\n\n          MAN\n          You can't imagine what just happened. I was coming back\n          on the Lublin road when the wheel came off the cart\n          thank heavens it was the way back and I'd already sold the\n          geese!\n\n          \n\n          WIFE\n          How much?\n\n          \n\n          MAN\n          Fifteen groshen, but that's not the story. I was struggling to\n          set the cart upright when a droshky approaches from the\n          direction of Lvov. How lucky, you think, that someone is\n          out this late.\n\n          \n\n          WIFE\n          Yes, very remarkable.\n\n          \n\n          MAN\n          But that's the least of it! He stops to help me; we talk of\n          this, we talk of that-it turns out this is someone you know!\n          Traitle Groshkover!\n\n          \n          His wife stares at him as he beams.\n          He takes the stare as a sign that she can't place the name.\n          . You know, REB GROSHKOVER! Pesel Bunim's uncle!\n          The chacham from Lodz, who studied under the Zohar reb\n          in Krakow!\n\n          \n          Still she stares. Then, quietly:\n\n          \n\n          WIFE\n          God has cursed us.\n\n          \n\n          MAN\n          What?\n\n          \n\n          WIFE\n          Traitle Groshkover has been dead for three years.\n\n          \n          Laughter erupts from the man but, as his wife continues to stare\n          at him, he strangles on it.\n          Quiet.\n          Wind whistles under the eaves.\n\n          \n          The man says quietly:\n\n          \n\n          MAN\n          Why do you say such a thing! I saw the man! I talked to him!\n\n          \n\n          WIFE\n          You talked to a dybbuk. Traitle Groshkover died of typhus\n          in Pesel Bunim's house. Pesel told me-she sat shiva for\n          him.\n\n          \n          They stare at each through a silence broken only by the sound\n          of the quickening wind.\n          A rap at the door.\n          Neither immediately responds.\n          Finally, to her husband:\n\n          \n          Who is it?\n\n          \n\n          MAN\n          For some soup, to warm himself.\n          The wind moans. He helped me, Dora!\n\n          \n\n          THE DOOR\n          We are looking in from the outside as it unlatches and creaks\n          in, opened by the husband\n          in the foreground, who has arranged his face into a strained\n          look of greeting. In the\n          background the wife stares, hollow-eyed.\n\n          \n\n          MAN\n          REB GROSHKOVER! You are welcome here!\n          Reverse on REB GROSHKOVER: a short, merry-looking fellow with\n          a bifurcated beard and a\n          silk hat and spectacles. He gives a little squeal of delight.\n\n          \n\n          REB GROSHKOVER\n          You are too kind, Velvel! Too kind!\n\n          \n          He steps into the house and sees the wife staring at him.\n          And you must be Dora! So much I have heard of you!\n          Yes, your cheeks are pink and your legs are stout! What a\n          wife you have!\n\n          \n          The husband chuckles nervously.\n\n          \n\n          MAN\n          Yes! A ray of sun, a ray of sun! Sit!\n\n          \n\n          WIFE\n          My husband said he offered you soup.\n\n          \n\n          REB GROSHKOVER\n          Yes, but I couldn't possibly eat this late, or I'd have\n          nightmares. No, no: no soup for me!\n\n          \n\n          WIFE\n          I knew it.\n\n          \n          REB GROSHKOVER laughs.\n\n          REB GROSHKOVER\n          I see! You think I'm fat enough already!\n\n          \n          He settles, chuckling, into his chair, but Dora remains sober:\n\n          \n\n          WIFE\n          No. A dybbuk doesn't eat.\n\n          \n\n          \n\n          \n\n          \n\n          5\n          REB GROSHKOVER stares at her, shocked.\n          The wife returns the stare.\n          The husband looks from wife to REB GROSHKOVER, apprehensive.\n          A heavy silence.\n          REB GROSHKOVER bursts into pealing laughter.\n\n          \n\n          REB GROSHKOVER\n          What a wife you have!\n\n          \n          He wipes away tears of merriment; the husband relaxes, even begins\n          to smile.\n\n          \n\n          MAN\n          I assure you, REB GROSHKOVER, it's nothing personal; she\n          heard a story you had died, three years ago, at Pesel\n          Bunim's house. This is why she think you are a dybbuk; I,\n          of course, do not believe in such things. I am a rational\n          man.\n\n          \n          REB GROSHKOVER is still chuckling.\n\n          \n\n          REB GROSHKOVER\n          Oh my. Oh my yes. What nonsense. And even if there\n          were spirits, certainly...\n          He thumps his chest.\n          I am not one of them!\n\n          \n\n          WIFE\n          Pesel always worried. Your corpse was left unattended for\n          many minutes when Pesel's father broke shiva and left the\n          room-it must have been then that the Evil One-\n          She breaks off to spit at the mention of the Evil One.\n          -took you!\n\n          \n          REB GROSHKOVER is terribly amused:\n\n          \n\n          \n\n          \n\n          \n\n          6\n\n          REB GROSHKOVER\n          \"My corpse!\" Honestly! What a wife you have!\n\n          \n\n          WIFE\n          Oh yes? Look, husband...\n\n          \n          She steps forward to the Reb, who looks enquiringly up at her.\n          They were preparing the body. Pesel's father shaved\n          one check...\n\n          \n          As his eyes roll down to look at her hand, she draws it across\n          his smooth right cheek.\n          Then he left the room. He came back, and shaved the\n          other...\n\n          \n          She reaches across to the other cheek, REB GROSHKOVER's eyes\n          following her hand-\n          You were already gone!\n\n          \n          -and drags her hand across. A bristly sound.\n\n          \n          REB GROSHKOVER laughs.\n\n          \n\n          REB GROSHKOVER\n          I shaved hastily this morning and missed a bit-by you this\n          makes me a dybbuk?\n\n          \n          He appeals to the husband:\n          It's true, I was sick with typhus when I stayed with\n          Peselle, but I recovered, as you can plainly see, and now\n          I-hugh!\n\n          \n          The wife steps back.\n          REB GROSHKOVER looks slowly down at his own chest in which the\n          wife has just planted an\n          ice pick.\n          REB GROSHKOVER stares at the ice pick.\n          The wife stares.\n\n          \n\n          \n\n          \n\n          \n\n          7\n          The husband stares.\n          Suddenly, REB GROSHKOVER bursts out laughing:\n          What a wife you have!\n          The husband can manage only a shocked whisper:\n\n          \n\n          MAN\n          Woman, what have you done?\n\n          \n          REB GROSHKOVER again looks down at his chest, which again moves\n          him to laughter. He\n          shakes his head.\n\n          \n\n          REB GROSHKOVER\n          Why would she do such a thing?\n\n          \n          He looks up.\n          I ask you, Velvel, as a rational man: which of us is\n          possessed?\n\n          \n\n          WIFE\n          What do you say now about spirits? He is unharmed!\n\n          \n\n          REB GROSHKOVER\n          On the contrary! I don't feel at all well.\n\n          \n          And indeed, blood has begun to soak through his vest.\n          He chuckles with less energy.\n          One does a mitzvah and this is the thanks one gets?\n\n          \n\n          \n\n          MAN\n          Dora! Woe, woe! How can such a thing be!\n\n          \n\n          REB GROSHKOVER\n          Perhaps I will have some soup. I am feeling weak...\n\n          \n          He rises to his feet but totters.\n          Or perhaps I should go...\n\n          \n\n          \n\n          \n\n          \n\n          8\n          He smiles weakly at Dora..\n          One knows when one isn't wanted.\n          He walks unsteadily to the door, opens it with some effort, and\n          staggers out into the\n          moaning wind and snow to be swallowed by the night.\n          The wife and husband stare at the door banging in the wind.\n\n          FINALLY:\n\n          \n\n          MAN\n          Dear wife. We are ruined. Tomorrow they will discover\n          the body. All is lost.\n\n          \n\n          WIFE\n          Nonsense, Velvel...\n          She walks to the door...\n          Blessed is the Lord. Good riddance to evil and shuts it against\n          the wind.\n\n          BLACK\n          A drumbeat thumps in the black.\n          Music blares: the Jefferson Airplane. Grace Slick's voice enters:\n          When the truth is found to be lies\n          And all the hope inside you dies\n          Don't you want somebody to love. . .\n\n          \n          An image fades in slowly, but even up full it is dim: some kind\n          of round, dull white shape\n          with a small black pinhole center. This white half-globe is a\n          plug set in a flesh-toned\n          field. The flesh tone glows translucently, backlit. We are drifting\n          toward the white plug\n          and, as we do so, the music grows louder still.\n\n          \n\n          AN EARPIECE\n\n          \n\n          \n\n          \n\n          \n\n          9\n          A pull back-a reverse on the preceding push in-from the cheap\n          white plastic earpiece\n          of a transistor radio. The Jefferson Airplane continues over\n          the cut but becomes\n          extremely compressed. The pull back reveals that the earpiece\n          is lodged in someone's\n          ear and trails a white cord.\n\n          \n          We drift down the cord to find the radio at its other end. As\n          we do so we hear, live in the\n          room, many voices speaking a foreign language in unison. A classroom,\n          apparently.\n          The radio is on a desktop but hidden from in front by the book\n          held open before it. The\n          book is written in non-Roman characters.\n          We are in Hebrew school.\n\n          \n          The boy who is listening to the transistor radio-DANNY Gopnik-sits\n          at a hinge-topped\n          desk in a cinderblock classroom whose rows of desks are occupied\n          by other boys and\n          girls of about twelve years of age. It is dusk and the room is\n          flourescent-lit.\n          At the front of the room a gray-haired man in a worn suit and\n          tie addresses the class.\n          DANNY straightens one leg so that he may dig into a pocket. With\n          an eye on the TEACHER to\n          make sure he isn't being watched, he eases something out:\n          A twenty-dollar bill.\n\n          \n\n          TEACHER\n          Mee yodayah? Reuven? Rifkah? Mah zeh \"anakim\"?\n          Efsheh mashooach ba-avodah?\n\n          \n\n          A BLINDING LIGHT\n          At the cut to the light the Jefferson Airplane music jumps up\n          full. The light resolves into\n          a multi-flared image of a blinking eye.\n          Reverse: the inside of a human ear. Fleshy whorls finely veined,\n          a cavity receding to\n          dark.\n          Objective on the DOCTOR's office: the DOCTOR is peering through\n          a lightscope into the ear of\n          an early-middle-aged man, LARRY Gopnik.\n          The Jefferson Airplane music continues.\n\n          \n\n          \n\n          \n\n          \n\n          10\n\n          DOCTOR\n          Uh-huh.\n\n          HEBREW SCHOOL\n          Close on Hebrew characters being scribbled onto the blackboard\n          as the TEACHER talks.\n          The TEACHER, talking.\n          A bored child, staring off.\n          His point-of-view: a blacktopped parking lot with a few orange\n          school busses, beyond it a\n          marshy field, and distant suburban bungalows.\n          Close on another child staring at something through drooping\n          eyelids.\n          His point-of-view: very close on the face of a classroom clock.\n          We hear its electrical\n          hum. Its red sweep-second hand crawls around the dial very, very\n          slowly.\n          DANNY Gopnik hisses:\n\n          DANNY\n          Fagle!.. .\n          The TEACHER drones on, writing on the blackboard. DANNY's eyes\n          flit from the TEACHER to\n          the student sitting kitty-corner in front of him-a husky youth\n          with shaggy hair. He\n          hasn't heard the prompt.\n          . Fagle!\n          The TEACHER turns from the blackboard and DANNY leans back, eyes\n          front, folding the\n          twenty up small behind his book.\n\n          TEACHER\n          Ahnee rotzeh lalechet habait hakisai. Mee yodayah?\n          Misaviv tamid anachnoo tamid...\n          The clock-watching child, eyelids sinking, is beginning to drool\n          out of one side of his\n          mouth.\n\n          DOCTOR'S OFFICE\n\n          \n\n          \n\n          \n\n          \n\n          11\n          The light again flaring the lens.\n          Reverse: looking into a pupil.\n          Objective: the DOCTOR looking through his scope into LARRY's\n          eye.\n\n          DOCTOR\n          Mm-hmm.\n\n          HEBREW SCHOOL\n          A bored child is excavating a bugger from his nose.\n          The TEACHER turns back to the chalkboard to circle something.\n\n          DANNY\n          Fagle!\n\n          TEACHER\n          Hamrah oomoh-\n          He interrupts himself briefly to make a couple of phlegm-hawking\n          sounds. He resumes:\n          . Hamrah oomoh meshiach oomshel zal?\n\n          DOCTOR'S OFFICE\n          The DOCTOR palpates LARRY's midriff, digging his fingers into\n          the hairy, baggy flesh.\n          DOCTOR's Voice\n          Uh-huh. We'll do some routine X-rays.\n\n          HEBREW SCHOOL\n          A young girl holds a hank of her bangs in front of her face,\n          separating out individual hairs\n          to examine them for split ends.\n\n          TEACHER\n          Ahnoo ahnoo mah? Mah? Talmidim? D'vorah?\n\n          \n\n          \n\n          \n\n          \n\n          12\n\n          D'VORAH\n          Ahnee to yodayah.\n          The TEACHER begins to pace the desk aisles, looking back and\n          forth among the students.\n\n          TEACHER\n          Mee yodayah?\n          The bugger-seeker, having succesfully withdrawn a bugger, carefully\n          drapes it over the\n          sharp end of his pencil, to what end we cannot know.\n          DANNY, apprehensively eyeing the TEACHER, slides the twenty into\n          the transistor radio's\n          cover-sleeve.\n\n          X-RAY CONE\n          A huge white rubberized cone, pointed directly at us.\n          We hear a rush of static and the DOCTOR's voice filtered through\n          a talk-back:\n          DOCTOR's Voice\n          Hold still.\n          Wider: LARRY is in his shorts lying on his back on an examining\n          table covered by a sheet\n          of tissue paper. The X-ray cone is pointed at the middle of his\n          body.\n          There is a brief sci-fi-like machine hum. It clicks off.\n\n          HEBREW SCHOOL\n          The clock-watching student's head is making descending bobs toward\n          his chest.\n\n          TEACHER\n          Nefsheh shelach hamilamid-eh?!\n          The TEACHER's circuit of the classroom has taken him around behind\n          DANNY. DANNY's\n          book lies face-down on the desk, covering the radio, but the\n          white cord snakes out from\n          under it up to his ear.\n          The TEACHER yanks at the cord.\n\n          \n\n          \n\n          \n\n          \n\n          13\n          The cord pops out of its jack and the Jefferson Airplane blares\n          tinnily from beneath the\n          book of torah stories.\n          The TEACHER lifts the book to expose the jangling radio.\n          Outraged, the TEACHER projects above the music:\n          . Mah zeh? ! Mah zeh? !\n          Some of the students are singing along; a couple beat rhythm\n          on their desks.\n          . Shechet, talmidim! Anachnoo lo cam zeh b'bait sefer!\n          Shechet bivakasha!\n          Three other students join in a chorus:\n\n          \n\n          STUDENTS\n          Shechet! Shechet bivakasha!\n          The nodding student's head droops ever lower.\n          Other students join in the chant:\n\n          SHECHET! SHECHET! SHECHET BIVAKASHA!\n\n          \n          The nodding student's chin finally reaches, and settles on, his\n          chest, and he gives a long\n          snorfling inhale of sleep.\n\n          \n\n          DOCTOR'S OFFICE\n          LARRY, now fully clothed, is seated across from the DOCTOR.\n          The DOCTOR is looking at his file. He absently taps a cigarette\n          out of a pack and lights up.\n          He nods as he smokes, looking at the file.\n\n          \n\n          DOCTOR\n          Well, I-sorry.\n          He holds the pack toward LARRY.\n\n          \n\n          \n\n          \n\n          \n\n          14\n\n          LARRY\n          No thanks.\n\n          DOCTOR\n          Well, you're in good health. How're Judith and the kids?\n\n          LARRY\n          Good. Everyone's good. You know.\n          The DOCTOR takes a long suck.\n\n          DOCTOR\n          Good. Daniel must be-what? About to be bar mitzvah?\n\n          LARRY\n          Two weeks.\n\n          DOCTOR\n          Well, mazel tov. They grow up fast, don't they?\n\n          TINTED PHOTO PORTRAIT\n          The portrait, old, in an ornate gilt frame, is of a middle-aged\n          rabbi with a small neat\n          mustache and round spectacles. He wears a tallis hood-style and\n          a phylactery box is\n          strapped to his forehead. A plaque set into the frame identifies\n          the man as Rabbi Minda.\n          Wider shows that the portrait hangs in the Hebrew school principal's\n          office, a white\n          cinderblock room. It is quiet. The only sound is a deep electrical\n          hum.\n          Just visible behind the principal's desk, upon which is a low\n          stack of books and a name\n          plate identifying the occupant as MAR TURCHIK, is the top of\n          a man's head-an old\n          man, with a few whispy white hairs where his yarmulka is not.\n          DANNY, seated opposite, pushes up from his slouch to better see\n          across the desk.\n          We boom up to show more of the principal. He is short. He wears\n          a white shirt and\n          hoist-up pants that come to just below his armpits. He has thick\n          eyeglasses. He fiddles\n          with the transistor radio, muttering:\n\n          PRINCIPAL\n          Hmm... eh... nu?\n\n          \n\n          \n\n          \n\n          \n\n          15\n          He experiments with different dials on the radio.\n          DANNY nervously watches.\n\n          DANNY\n          You put the-\n          The old man holds up one hand.\n\n          PRINCIPAL\n          In ivrit. (In Hebrew)\n\n          DANNY\n          Um...\n          The old man looks down at the little earpiece pinched between\n          two fingers. He examines\n          it as a superstitious native might a Coca-Cola bottle.\n          The source of the electrical hum: a wall clock whose red sweep-second\n          hand crawls\n          around the dial very, very slowly.\n          The Reb continues to squint at the earpiece.\n          DANNY sighs. He encourages:\n\n          DANNY\n          Yeah, you-\n          The principal's tone is harder:\n\n          PRINCIPAL\n          In ivrit!\n          This time his cold look holds until he is sure that the admonishment\n          has registered.\n          He looks back down at the earpiece.\n          We hear the door open. The principal ignores it.\n          An old woman walks slowly in with a teacup chattering on a saucer.\n          She has thick\n          eyeglasses. She wears thick flesh-colored support hose. She takes\n          slow, short steps\n          toward the desk. The principal is studying the radio.\n\n          \n\n          \n\n          \n\n          \n\n          16\n\n          PRINCIPAL\n          Mneh...\n          The old woman continues to take slow short steps toward him.\n          The tableau looks like a\n          performance-art piece.\n          She reaches the desk and sets the teacup down. She summons a\n          couple of phlegm-\n          hawking rasps and turns to go.\n          She takes slow short steps toward the door.\n          The principal raises the earpiece experimentally toward his ear.\n           Close on his hairy, wrinkled ear as his trembling fingers bring\n          in the earpiece. The\n          i f ngers push and wobble and tamp the earpiece into place, hesitate,\n          and then do some\n          more pushing and wobbling and tamping.\n          The principal keeps DANNY fixed with a stare as his hand hesitantly\n          drops from his ear,\n          ready to reach back up should the earpiece loosen.\n          .mneh...\n          Satisfied that neither the student nor the earpiece are about\n          to make any sudden moves, he\n          looks down at the radio. He turns a dial.\n          Faintly and tinnily from the earpiece we hear the compressed\n          jangle of rock music. The\n          rabbi stares blankly, listening.\n          DANNY slumps, looking warily at the rabbi.\n          The rabbi continues to stare down at the radio. The compressed\n          rock music jangles on.\n          The rabbi is expressionless, mouth slightly open, listening.\n          Tableau: anxious student, earplugged spiritual leader.\n          Muffled, from the outer office, the hawking of phlegm.\n\n          CLASSROOM\n          We are behind a man who writes equations on a chalkboard, shoulder\n          at work and hand\n          quickly waggling. Periodically he glances back, giving us a fleeting\n          look at his face: it is\n\n          \n\n          \n\n          \n\n          \n\n          17\n          LARRY Gopnik.\n\n          LARRY\n          You following this?... Okay?.. So... Heh-heh... This\n          part is exciting...\n          Students follow along, bored.\n          LARRY continues to write.\n          . So, okay. So. So if that's that, then we can do this,\n          right? Is that right? Isn't that right? And that's\n          Schrodinger's paradox, right? Is the cat dead or is the cat\n          not dead? Okay?\n\n          BLEGEN HALL\n          LARRY is entering the physics department office. The department's\n          secretary wheels her\n          castored chair away from her typing.\n\n          SECRETARY\n          Messages, Professor Gopnik.\n          He takes the three phone messages.\n\n          LARRY\n          Thank you, Natalie. Oh-CLIVE. Come in.\n          A Korean graduate student who was been waiting on a straightbacked\n          chair rises.\n\n          LARRY'S OFFICE\n          He is flipping through the messages. Absently:\n\n          LARRY\n          So, uh, what can I do for you?\n          The messages:\n          WHILE YOU WERE OUT Dick Dutton\n          OF Columbia Record Club\n\n          \n\n          \n\n          \n\n          \n\n          18\n\n          CALLED.\n          REGARDING: \"Please call.\"\n          WHILE YOU WERE OUT Sy Ableman\n\n          CALLED.\n          REGARDING \"Let's talk.\"\n          WHILE YOU WERE OUT CLIVE Park\n\n          CALLED.\n          REGARDING: \"Unjust test results.\"\n          He crumples the last one.\n\n          CLIVE\n          Uh, Dr. Gopnik, I believe the results of Physics Mid-Term\n          were unjust.\n\n          LARRY\n          Uh-huh, how so?\n\n          CLIVE\n          I received an unsatisfactory grade. In fact: F, the failing\n          grade.\n\n          LARRY\n          Uh, yes. You failed the mid-term. That's accurate.\n\n          CLIVE\n          Yes, but this is not just. I was unaware to be examined on\n          the mathematics.\n\n          LARRY\n          Well-you can't do physics without mathematics, really,\n          can you.\n\n          CLIVE\n          If I receive failing grade I lose my scholarship, and feel\n          shame. I understand the physics. I understand the dead cat.\n\n          LARRY\n\n          (SURPRISED)\n          You understand the dead cat?\n\n          \n\n          \n\n          \n\n          \n\n          19\n          CLIVE nods gravely.\n          But... you... you can't really understand the physics\n          without understanding the math. The math tells how it\n          really works. That's the real thing; the stories I give you in\n          class are just illustrative; they're like, fables, say, to help\n          give you a picture. An imperfect model. I mean-even I\n          don't understand the dead cat. The math is how it really\n          works.\n          CLIVE shakes his head, dubious.\n\n          CLIVE\n          Very difficult... very difficult...\n\n          LARRY\n          Well, I... I'm sorry, but I... what do you propose?\n\n          CLIVE\n          Passing grade.\n\n          LARRY\n          No no, I-\n\n          CLIVE\n          Or perhaps I can take the mid-term again. Now I know it\n          covers mathematics.\n\n          LARRY\n          Well, the other students wouldn't like that, would they. If\n          one student gets to retake the test til he gets a grade he\n          likes.\n          CLIVE impassively considers this.\n\n          CLIVE\n          Secret test.\n          LARRY wraps a hand wearily over his eyes.\n\n          LARRY\n          . No, I'm afraid-\n\n          \n\n          \n\n          \n\n          \n\n          20\n\n          CLIVE\n          Hush-hush.\n\n          LARRY\n          No, that's just not workable. I'm afraid we'll just have to\n          bite the bullet on this thing, CLIVE, and-\n\n          CLIVE\n          Very troubling.\n          He rises.\n          . very troubling...\n          He goes to the door, shaking his head, as LARRY looks on in surprise.\n          He leaves.\n          LARRY stares at the open door. The secretary outside, her back\n          to us, types on.\n          LARRY. looks stupidly around his own office, shakes his head.\n          He picks up the phone message from Sy Ableman-\"Let's talk\"-and\n          dials. As he dials\n          his other hand wanders over the papers on the desktop.\n          There is a plain white envelope on the desk. LARRY picks it up\n          as the phone rings through.\n          A ring is clipped short and a warm basso-baritone rumbles through\n          the line:\n          Phone Voice\n          Sy Ableman.\n\n          LARRY\n          Hello, Sy, LARRY Gopnik.\n\n          SY\n\n          (MOURNFUL)\n          LARRY. How are you, my friend.\n          LARRY picks idly at the envelope.\n\n          LARRY\n          Good, how've you been, Sy?\n\n          \n\n          \n\n          \n\n          \n\n          21\n          Inside the envelope: a thick sheaf of one-hundred-dollar bills.\n\n          SY\n          Oh fine. Shall we talk LARRY.\n          LARRY reacts to the money.\n\n          LARRY\n          (into phone)\n          What?! Oh! Sorry! I, uh-call back!\n          He slams down the phone.\n\n          . CLIVE!\n          He rushes out the door, through the secretarial area, and into\n          the hallway, and looks up\n          toward the elevators.\n          Empty.\n          He looks at the stuffed envelope he still holds.\n          He goes back to the departmental office. The secretary sits typing.\n          She glances at him\n          and, as she goes back to her typing:\n\n          SECRETARY\n          Sy Ableman just called. Said he got disconnected.\n\n          BATHROOM DOOR\n          A hand enters to knock.\n          Man's Voice\n          Out in a minute!\n          SARAH, the sixteen-year-old girl who has just knocked, rolls\n          her eyes.\n\n          SARAH\n          I gotta wash my hair! I'm going out tonight!\n\n          VOICE\n          Out in a minute!\n\n          \n\n          \n\n          \n\n          \n\n          22\n\n          SARAH\n          Jesus Christ!\n          She stomps down the hall.\n\n          KITCHEN\n          Judith, a woman of early middle age, is at the stove. SARAH enters.\n\n          SARAH\n          W is Uncle Arthur always in the bathroom?\n\n          JUDITH\n          He has to drain his sebacious cyst. You know that. Will\n          you set the table?\n\n          SARAH\n          Why can't he do it in the basement? Or go out in the\n          garage!\n\n          BUS\n          We are raking the exterior of an orange school bus as it rattles\n          along. Hebrew characters\n          on the side identify it-to some, anyway.\n\n          INSIDE\n          We are locked down on DANNY as the bus rattles like an old crate,\n          squeaking, grinding\n          gears, belching exhaust. DANNY and the children around him vibrate\n          and pitch about but,\n          from their lack of reaction, seem used to it.\n          They raise their voices to be heard over the engine noise and\n          the various stress noises in\n          the chassis and a transistor radio somewhere that plays Jefferson\n          Airplane.\n\n          DANNY\n          I had twenty bucks in it too. Inside the case.\n\n          \n\n          \n\n          \n\n          \n\n          23\n          Mark Sallerson\n          Twenty bucks! How come.\n\n          DANNY\n          I bought a lid from Mike Fagle. Couple weeks ago. I still\n          owed him twenty.\n          Mark Sallerson\n          He already gave you the pot?\n\n          DANNY\n          Yeah but a couple weeks ago my funding got cut off. Fagle\n          said he'd pound the crap out of me if I didn't pay up.\n          Howard Altar\n          What funding got cut off? Where do you get your money?\n          Another boy, with thick glasses, is Ronnie Nudell.\n          Ronnie Nudell\n          What happened?\n          Mark Sallerson\n          Rabbi Turchik took his radio. Had money in it.\n          Ronnie Nudell\n          That fucker!\n\n          DANNY\n          Yeah. I think he said he was confiscating it.\n          Ronnie Nudell\n          He's a fucker! Where do you get your money?\n          Mark Sallerson\n          Mike Fagle's gonna kick his ass. Last week he pounded\n          the crap out of Seth Seddlemeyer.\n\n          \n\n          \n\n          \n\n          \n\n          24\n          Ronnie Nudell\n          He's a fucker!\n          Mark Sallerson\n          Fagle? Or Seth Seddlemeyer?\n          Ronnie Nudell\n          They're both f ickers!\n\n          BATHROOM DOOR\n          A hand enters to knock.\n          Uncle Arthur's Voice\n          Out in a minute!\n\n          SARAH\n          Are you still in there?!\n          Uncle Arthur\n          I, uh.. . Just a minute!\n\n          SARAH\n          I've gotta wash my hair! I'm going out tonight, to the hole!\n          Uncle Arthur\n          Okay!\n\n          OUTSIDE\n          LARRY pulls into the driveway and gets out of the car. The purr\n          of a lawn mower. He\n          looks.\n          His point-of-view: Gar Brandt, the next-door neighbor, is mowing\n          his lawn. He has a\n          buzz cut and is wearing a white T-shirt.\n          Another noise competes with the lawn mower: rattling, squeaking,\n          gear-grinding. The\n          orange school bus with Hebrew lettering pulls up across the street.\n          Its door opens with a\n          pneumatic hiss to discharge a passenger.\n\n          \n\n          \n\n          \n\n          \n\n          25\n\n          DINNER TABLE\n          LARRY sits in. His wife and two children are already seated.\n          There is one empty place.\n          LARRY projects:\n\n          LARRY\n          Arthur!\n          A muffled voice:\n\n          ARTHUR\n          Yeah!\n\n          LARRY\n          Dinner!\n\n          ARTHUR\n          Okay! Out in a minute!\n\n          LARRY\n          We should wait.\n\n          SARAH\n          Are you kidding!\n          They start eating.\n\n          LARRY\n          Mr. Brandt keeps mowing part of our lawn.\n\n          JUDY\n          Does that matter?\n\n          LARRY\n          What?\n\n          JUDY\n          Is it important?\n          LARRY shrugs.\n\n          LARRY\n          It's just odd.\n\n          \n\n          \n\n          \n\n          \n\n          26\n\n          JUDY\n          Any news on your tenure?\n\n          LARRY\n          I think they'll give me tenure.\n\n          JUDY\n          You think.\n\n          LARRY\n\n          (EQUABLY)\n          Well, I don't know. These things aren't, you know.. .\n\n          JUDY\n          No, I don't know. Which is why I ask.\n\n          LARRY\n\n          WELL-\n\n          SARAH\n          Mom, how long is Uncle Arthur staying with us?\n\n          JUDY\n          Ask your father.\n\n          BACK YARD\n          Twilight.\n          LARRY is stepping onto a hose as he unwheels it from the drum\n          of a traveling sprinkler,\n          laying out an are to cover the back yard. Intermittent thwacks\n          from next door:\n          Gar Brandt and his son, who also has a buzz cut and a white T-shirt,\n          throw a baseball\n          back and forth. Gar Brandt throws hard. The ball pops in the\n          boy's mitt.\n\n          MITCH\n          Ow.\n          LARRY walks over to the boundary defined by the fresh mowing.\n          He sights down it.\n          Gar Brandt looks over his shoulder at LARRY, looking. Gar Brandt\n          is expressionless. He\n\n          \n\n          \n\n          \n\n          \n\n          27\n          goes back to throwing.\n\n          MITCH\n          Ow.\n\n          INSIDE\n          Evening. Lights on. LARRY sits at the kitchen table, a briefcase\n          open on the chair next to\n          him. Blue books-examination booklets-are spread on the table\n          in front of him. He\n          reads, occasionally making marginal scribbles, grading.\n          From off, faint and dulled by intervening walls, rock music:\n          somewhere in the house\n          DANNY is listening to the Jefferson Airplane.\n          The clink of teaspoon against china as LARRY stirs his tea. He\n          looks up at a noise: JUDY\n          enters.\n\n          JUDY\n          Honey.\n\n          LARRY\n\n          (ABSENT)\n          Honey.\n\n          JUDY\n          Did you talk to Sy?\n          Still absent, without looking up:\n\n          LARRY\n          Sy?-Sy Ableman!-That's right, he called, but I-\n\n          JUDY\n          You didn't talk to him.\n\n          LARRY\n          No, I-\n\n          JUDY\n          You know the problems you and I have been having.\n          Sympathetic, but still absent:\n\n          \n\n          \n\n          \n\n          \n\n          28\n\n          LARRY\n          Mm.\n\n          JUDY\n          Well, Sy and I have become very close.\n          This brings LARRY's head up. He focuses on JUDY, puzzled. She\n          elaborates:\n          In.short: I think it's time to start talking about a divorce.\n          LARRY stares at her. A long beat.\n          At length, trying to digest:\n\n          LARRY\n          . Sy Ableman!\n\n          JUDY\n          This is not about Sy.\n\n          LARRY\n          You mentioned Sy!\n\n          JUDY\n          Don't twist my words. We-\n\n          LARRY\n          A divorce-what have I done! I haven't done anything-\n          What have I done!\n\n          JUDY\n          LARRY, don't be a child. You haven't \"done\" anything. I\n          haven't \"done\" anything.\n\n          LARRY\n          Yes! Yes! We haven't done anything! And I-I'm\n          probably about to get tenure!\n\n          JUDY\n          Nevertheless, there have been problems. As you know.\n\n          LARRY\n\n          \n\n          \n\n          \n\n          \n\n          29\n\n          WELL-\n\n          JUDY\n          And things have changed. And then-Sy Ableman. Sy has\n          come into my life. And now-\n\n          LARRY\n          Come into your-what does that mean?! You, you, you,\n          you barely know him!\n\n          JUDY\n          We've known the Ablemans for fifteen years.\n\n          LARRY\n          Yes, but you you said we hadn't done anything!\n          JUDY suddenly is stony:\n\n          JUDY\n          I haven't done anything. This is not some flashy fling.\n          This is not about woopsy-doopsy.\n          LARRY stares at her.\n\n          LARRY\n          Sy Ableman!\n          From down the hall, a knock on a door. A muffled voice:\n\n          ARTHUR\n          Out in a minute!\n\n          JUDY\n          Look, I didn't know any other way of breaking it to you.\n          Except to tell you. And treat you like an adult. Is that so\n          wrong?\n          LARRY does not seem to be listening. His eyes roam the room as\n          he thinks.\n\n          LARRY\n          Where do I sleep?\n          JUDY narrows her eyes.\n\n          \n\n          \n\n          \n\n          \n\n          30\n\n          JUDY\n          What?\n\n          LARRY\n          Arthur's on the couch!\n\n          JUDY\n          Look. Sy feels that we should-\n\n          LARRY\n          Esther is barely cold!\n\n          JUDY\n          Esther died three years ago. And it was a loveless\n          marriage. Sy wants a Gett.\n          This derails the conversation. LARRY stares, trying to pick up\n          the thread.\n\n          LARRY\n          . A what?\n\n          JUDY\n          A ritual divorce. He says it's very important. Without a\n          Gett I'm an Aguna.\n\n          LARRY\n          A what? What are you talking about?\n          She turns to go, shaking her head, peeved:\n\n          JUDY\n          You always act so surprised.\n          As she leaves:\n          I have begged you to see the Rabbi.\n\n          FADE IN\n          LARRY has fallen asleep at the kitchen table, face-down in a\n          pile of blue books. Cold blue\n          light sweeps across him and he looks up.\n\n          \n\n          \n\n          \n\n          \n\n          31\n          A short, balding middle-aged man in flannel pyjamas and an old\n          flannel dressing gown\n          stands in front of the open refrigerator holding an open jar\n          of orange juice. He tips the jar\n          back to drink, his free hand holding a balled-up towel to the\n          back of his neck\n          LARRY stares at him.\n\n          FADE OUT\n\n          BLEGEN HALL\n          LARRY enters the departmental office. His eyes are red-rimmed\n          and dark-bagged. He has\n          beard stubble.\n          The department's secretary wheels her castored chair away from\n          her typing.\n\n          SECRETARY\n          Messages, Professor Gopnik.\n          He takes the two phone messages.\n\n          HIS OFFICE\n          LARRY looks at the messages:\n          WHILE YOU WERE OUT Dick Dutton\n          OF Columbia Record Club\n\n          CALLED.\n          REGARDING: \"2Â°d attempt. Please call.\"\n          WHILE YOU WERE OUT Sy Ableman\n\n          CALLED.\n          REGARDING \"Let's have a good talk.\"\n          A knock brings his look up.\n\n          LARRY\n          Yes-thanks for coming, CLIVE.\n          CLIVE Park enters the office.\n\n          \n\n          \n\n          \n\n          \n\n          32\n          . Have a seat.\n          LARRY uses a key to open the top left desk drawer. He takes out\n          the envelope.\n          We had, I think, a good talk, the other day, but you left\n          something that-\n\n          CLIVE\n          I didn't leave it.\n\n          LARRY\n          Well--you don't even know what I was going to say.\n\n          CLIVE\n          I didn't leave anything. I'm not missing anything. I know\n          where everything is.\n          LARRY looks at him, trying to formulate a thought.\n\n          LARRY\n          Well... then, CLIVE, where did this come from?\n          He waves the envelope.\n          . This is here, isn't it?\n          CLIVE looks at it gravely.\n\n          CLIVE\n          Yes, sir. That is there.\n\n          LARRY\n          This is not nothing, this is something.\n\n          CLIVE\n          Yes sir. That is something.\n          A beat.\n          . What is it.\n\n          LARRY\n          You know what it is! You know what it is! I believe. And\n\n          \n\n          \n\n          \n\n          \n\n          33\n          you know I can't keep it, CLIVE.\n\n          CLIVE\n          Of course, sir.\n\n          LARRY\n          I'll have to pass it on to Professor Finkle, along with my\n          suspicions about where it came from. Actions have\n          consequences.\n\n          CLIVE\n          Yes. Often.\n\n          LARRY\n          Always! Actions always have consequences!\n          He pounds the desk for emphasis.\n          In this office, actions have consequences!\n\n          CLIVE\n          Yes sir.\n\n          LARRY\n          Not just physics. Morally.\n\n          CLIVE\n          Yes.\n\n          LARRY\n          And we both know about your actions.\n\n          CLIVE\n          No sir. I know about my actions.\n\n          LARRY\n          I can interpret, CLIVE. I know what you meant me to\n          understand.\n\n          CLIVE\n          Meer sir my sir.\n          LARRY cocks his head.\n\n          \n\n          \n\n          \n\n          \n\n          34\n\n          LARRY\n          . Meer sir my sir?\n\n          CLIVE\n          (careful enunciation)\n          Mere... surmise. Sir.\n          He gravely shakes his head.\n          . Very uncertain.\n\n          CLOSE ON A TONE ARM\n          A hand lays it onto a slowly spinning vinyl record.\n          Through scratches and pops, a solo tenor starts a mournful Hebrew\n          chant.\n          Close on the sleeve:\n          Rabbi Youssele Rosenblatt Chants Your Haftorah Portion\n\n          VOLUME 12\n          Rabbi Youssele wears a caftan and a felt hat and has sad eyes.\n          They peer out from the\n          dark beard that covers most of the rest of his face like owl's\n          eyes peering out of the\n          woods.\n          Wider, on DANNY, in his bedroom, evening. He lifts the tone arm\n          on the portable\n          turntable.\n          He chants the passage.\n          He drops the tone arm at the same place; Rabbi Youssele chants\n          the passage again.\n          DANNY listens, eyes narrowed. He lifts the tone arm and chants\n          the passage again.\n          He replays the passage again; before he can lift the tone arm\n          to echo it his door bursts\n          open. Rabbi Youssele continues to chant.\n\n          \n\n          \n\n          \n\n          \n\n          35\n\n          SARAH\n          You little brat fucker! You snuck twenty bucks out of my\n          drawer!\n\n          DANNY\n          Studying torah! Asshole!\n\n          SARAH\n          You little brat! I'm telling Dad!\n\n          DANNY\n          Oh yeah? You gonna tell him you've been sneaking it out\n          of his wallet?\n\n          SARAH\n          All right, you know what I'm gonna do? You little brat? If\n          you don't give it back?\n          We hear the thunk of the front door opening. DANNY stands, calling:\n\n          DANNY\n          Dad?\n\n          FOYER\n          LARRY is entering with his briefcase. As he stows it in the foyer\n          closet DANNY's voice\n          continues, off:\n\n          DANNY\n          Dad, you gotta fix the aerial.\n          Judith emerges from the kitchen.\n\n          JUDITH\n          Hello LARRY, have you thought about a lawyer?\n\n          LARRY\n          Honey, please!\n          DANNY emerges from the hall.\n\n          DANNY\n\n          \n\n          \n\n          \n\n          \n\n          36\n          We're not getting channel four at all.\n\n          LARRY\n          (to Judith)\n          Can we discuss it later?\n\n          DANNY\n          I can't get F Troop.\n\n          JUDITH\n          LARRY, the children know. Do you think this is some secret?\n          Do you think this is something we're going to keep quiet?\n          SARAH enters.\n\n          SARAH\n          Dad, Uncle Arthur is in the bathroom again! And I=m\n          going to the hole at eight!\n          She hits DANNY on the back of the head.\n\n          DANNY\n          Stop it!\n\n          LARRY\n          SARAH! What's going on!\n\n          DANNY\n          She keeps doing that!\n\n          LATER\n          LARRY sits in a reclining chair in the living room, head back,\n          listening to Sidor Belarsky on\n          the hi-fi. On top of the music is a hissing-sucking sound. There\n          is also the sound of a\n          pencil busily scratching paper.\n          We cut to its source: Uncle Arthur sits scribbling into a spiral\n          notebook, his free hand\n          holding the end of a length of surgical tubing against the back\n          of his neck. The tube leads\n          to a water-pik-like appliance on an end table next to him-the\n          source of the sucking\n          sound.\n          After a long beat of listening to the music, LARRY speaks into\n          space:\n\n          \n\n          \n\n          \n\n          \n\n          37\n\n          LARRY\n          Arthur?\n          Uncle Arthur does not look up from his scribbling.\n          Uncle Arthur\n          Yes.\n          LARRY continues to stare at the ceiling.\n\n          LARRY\n          What're you doing?\n          Still without looking up:\n          Uncle Arthur\n          Working on the Mentaculus.\n          Long beat. Music. Scribbling.\n\n          LARRY\n          Any luck, um, looking for an apartment?\n          More scribbling.\n          Uncle Arthur\n          No.\n          The doorbell chimes.\n\n          FRONT DOOR\n          LARRY enters, glances through the front door's head-height window,\n          and-freezes, one\n          hand arrested on the way to the doorknob.\n          His point-of-view: framed by the window, yellowly lit by the\n          stoop light, a human head.\n          A middle-aged man, a few years older than LARRY. A fleshy face\n          with droopy hangdog\n          features, a five-o'clock shadow, and sad Harold Bloom eyes.\n          LARRY opens the door.\n\n          \n\n          \n\n          \n\n          \n\n          38\n\n          LARRY\n          Sy.\n          Sy, entering, thrusts out a hand. His voice vibrates with a warm,\n          sad empathy:\n\n          SY\n          Good to see you, LARRY.\n          He is a heavy-set man wearing a short-sleeved shirt that his\n          belly tents out in front of\n          him. In his left hand he holds a bottle of wine.\n\n          LARRY\n\n          (TIGHTLY)\n          I'll get Judith.\n\n          SY\n          No, actually LARRY, I'm here to see you, if I might.\n          He shakes his head.\n          . Such a thing. Such a thing.\n\n          LARRY\n          Shall we go in the...\n          He is leading him into the kitchen but Sy, oblivious to surroundings,\n          plows on with the\n          conversation, arresting both men in the narrow space between\n          kitchen sink and stove, and\n          invading LARRY's space.\n\n          SY\n          You know, LARRY-how we handle ourselves, in this\n          situation-it's so impawtant.\n\n          LARRY\n          Uh-huh.\n\n          SY\n          Absolutely. Judith told me that she broke the news to you.\n          She said you were very adult.\n\n          LARRY\n          Did she.\n\n          \n\n          \n\n          \n\n          \n\n          39\n\n          SY\n          Absolutely. The respect she has for you.\n\n          LARRY\n          Yes?\n\n          SY\n          Absolutely. But the children, LARRY. The children.\n          He shakes his head.\n          . The most impawtant.\n\n          LARRY\n          Well, I guess...\n\n          SY\n          Of coss. And Judith says they're handling it so well. A\n          tribute to you. Do you drink wine? Because this is an\n          incredible bottle. This is not Mogen David. This is a wine,\n          LARRY. A bawdeaux.\n\n          LARRY\n          You know, Sy-\n\n          SY\n          Open it-let it breathe. Ten minutes. Letting it breathe, so\n          impawtant.\n\n          LARRY\n          Thanks, Sy, but I'm not-\n\n          SY\n          I insist! No reason for discumfit. I'll be uncumftable if\n          you don't take it. These are signs and tokens, LARRY.\n\n          LARRY\n          I'm just-I'm not ungrateful, I'm, I just don't know a lot\n          about wine and, given our respective, you know-\n          He is startled when Sy abruptly hugs him.\n\n          SY\n\n          \n\n          \n\n          \n\n          \n\n          40\n          S' okay.\n          He finishes the hug off with a couple of thumps on the back.\n          S'okay. Wuhgonnabe fine.\n\n          SKEWED ANGLE ON PARKING LOT\n          We are dutch on a slit of a view through a cracked-open frosted\n          window: the Hebrew\n          school parking lot.\n          The last couple of busses filled with students are rolling out\n          of the lot. It is late\n          afternoon.\n          A reverse shows DANNY in a stall, standing on a closed toilet,\n          angling his head to peer out\n          the bathroom window opened at the top.\n          The bathroom outside the stall: Ronnie Nudell leans against a\n          sink waiting, sucking a\n          long draw from a joint.\n          DANNY emerges from the stall. Ronnie Nudell offers the joint.\n          Ronnie Nudell\n          Want some of this fucker?\n\n          HALLWAY\n          The bathroom door cracks open in the foreground. DANNY peeks\n          out.\n          His point-of-view: the empty hallway ending in a T with another\n          hallway. A janitor\n          crosses, pushing a broom down the far hallway. He disappears.\n          His echoing footsteps\n          recede.\n          DANNY and Ronny emerge from the bathroom.\n\n          RABBI MINDA\n          The photo-portrait on the wall of Mar Turchik's office lit by\n          late-day sun.\n          We hear a scraping sound.\n\n          \n\n          \n\n          \n\n          \n\n          41\n          Wider: Ronnie Nudell looks over DANNY's shoulder as DANNY, hunched\n          at Mar Turchik's\n          desk, fishes the end of a bent hanger into the keyhole on the\n          top left drawer. After a beat,\n          the hanger turns.\n          They open the drawer. In it: squirt guns, marbles set to rolling\n          by the opening of the\n          drawer, a comic book, a Playboy magazine, a slingshot, a small\n          bundle of firecrackers.\n          Hands rifle the gewgaws: no radio.\n          Ronnie Nudell\n          Fuck.\n\n          SANCTUARY\n          We are behind the two boys who sit side by side on the last pew,\n          staring at the front of\n          the empty sanctuary. Its stained glass windows further weaken\n          the late-afternoon light.\n          In deference to the location, the boys wear yarmulkas.\n          A long hold on their still backs.\n          At length, some movement in DANNY's back, his head dips, and\n          we hear him sucking on\n          the joint. He holds it, exhales, and passes it wordlessly to\n          Ronnie Nudell.\n\n          SUBURBAN STREET\n          We are pulling DANNY as he walks along the street, eyes red-rimmed,\n          still wearing his\n          yarmulka. It is dusk.\n          After a few beats of walking, the front door of a house just\n          behind DANNY opens. A\n          husky, shaggy-haired youth emerges on the run.\n          The sound has alerted DANNY. Seeing Mike Fagle, he too begins\n          to run. He reaches up\n          and grabs his yarmulka and clutches it in one of his pumping\n          fists.\n          Pursued and pursuer both run wordlessly, panting, feet pounding.\n          Mike Fagle is closing. But DANNY is already cutting across the\n          Brandt's front yard,\n          approaching his own. He plunges into the house and slams the\n          door.\n          Mike Fagle draws up, panting, gazing hungrily at the house.\n\n          \n\n          \n\n          \n\n          \n\n          42\n          Lights are on inside. The house is a warm yellow citadel in the\n          dusk.\n          After a beat we hear, faint and dulled, the Jefferson Airplane.\n          Mike Fagle slinks away.\n\n          PUFFY WHITE CLOUDS\n          A shockingly blue sky with picture-perfect clouds hanging in\n          it.\n          After a beat the top of an aluminum extension ladder swings in\n          from the bottom of the\n          frame and comes toward us.\n          We cut to a side angle as the ladder clunk against a roof.\n          It starts vibrating to the rhythmic clung of someone climbing.\n          Hands enter. LARRY's head enters.\n          He climbs onto the roof.\n          He takes a couple steps away from the edge and stands tentatively,\n          making sure of his\n          balance. He looks around.\n          His point-of-view towards the front. An unfamiliarly high perspective\n          on the street and\n          the neighboring houses, almost maplike. Very peaceful. Wind rhythmically,\n          gently\n          waves the trees.\n          LARRY gingerly walks up to the aerial at the peak of the roof.\n          We are hearing a rhythmic\n          popping noise.\n          LARRY reaches the peak and straddles it. He looks down at the\n          back yard.\n\n          MITCH\n          Ow.\n          Foreshortened Gar Brandt and Mitch are playing catch in their\n          back yard. With each toss\n          the ball pops, alternately in father's mitt and son's.\n          Precariously balanced, LARRY reaches out for the aerial. He tentatively\n          touches it. He\n          grasps it. He twists the aerial.\n\n          \n\n          \n\n          \n\n          \n\n          43\n          Something strange: as it rotates the aerial creaks-a high whine\n          as pure as the hum\n          sounded from the rim of a wineglass.\n\n          MITCH\n          Ow.\n          Faintly, under the wineglass sound, and clouded by static, a\n          high, ringing tenor sings in\n          an unfamiliar modality. Cantorial music.\n          LARRY drops his hand. Inertia keeps the aerial rotating slowly\n          til it dies, the sound drifting\n          away into the sybillant shushing of trees.\n          LARRY reaches out again to turn the aerial. The same crystal\n          hum... cantorial singing...\n          and now, layering in, the theme from F Troop.\n          Music. Crystal hum. Wind.\n\n          MITCH\n          Ow.\n          LARRY's look travels: his point-of-view pans slowly off the steep\n          angle of father and son\n          playing catch, travels across his own backyard, and brings in\n          the white fence that\n          encloses the patio of the neighbor on the other side.\n          Gar (off)\n          Good toss, Mitch.\n          On the enclosed patio a woman reclines on a lawn chaise of nylon\n          bands woven over an\n          aluminum frame. She is on her back, eyes closed against the sun.\n          She is naked.\n          Mitch (off)\n          Ow.\n          LARRY reacts to the naked woman: startled at first, he moves\n          to hide behind the peak of the\n          roof. But as he realizes that the sun keeps the woman's eyes\n          closed he relaxes, continu-\n          ing to stare.\n          She is attractive. Not young, not old: LARRY's age. Peaceful.\n          After a still beat one of her hands gropes blindly to the side.\n          It finds an ashtray on the\n          table next to her and takes from it a pluming cigarette. The\n          woman takes a puff and\n          replaces it.\n\n          \n\n          \n\n          \n\n          \n\n          44\n          Mitch (off)\n          Ow.\n          F Troop. Cantorial singing.\n          Blue sky and white puffy clouds.\n          The sound of a pencil scratching against paper.\n\n          NOTEBOOK\n          A pencil scratches equations into a lamplit spiral notebook.\n          Sidor Belarsky comes in at the cut. So does the spluttering suck-sound\n          of Uncle Arthur's\n          evacuator.\n          Wider on Uncle Arthur, in his pyjamas, propped up on the narrow\n          fold-out sofa, writing\n          with one hand as he holds the evacuator hose to his neck with\n          the other.\n          Squeezed into the living room next to the fold-out sofa is a\n          camp cot of plaid-patterned\n          nylon stretched over an aluminum frame. On the camp cot is LARRY,\n          lying half-in, half-\n          out of a rumpled sleeping bag. He stares at the ceiling, a damp\n          washcloth pressed against\n          his forehead. His face is flaming red.\n          Arthur speaks absently as he scribbles:\n\n          ARTHUR\n          Will you read this? Tell me what you think?\n          LARRY continues to stare at the ceiling.\n\n          LARRY\n          Okay.\n          Uncle Arthur glances up from the notebook, focuses on LARRY.\n\n          ARTHUR\n          Boy. You should've worn a hat.\n\n          LATER\n\n          \n\n          \n\n          \n\n          \n\n          45\n          The lights are out. Very quiet. Uncle Arthur lightly snores.\n          LARRY still stares at the ceiling. He shifts his weight. The\n          aluminum frame of the cot\n          squeaks. He shifts again. Another creak.\n          LARRY fishes his watch from the jumble of clothes on the floor:\n          4:50.\n\n          KITCHEN\n          LARRY, in his underwear, spoons ground coffee into the percolator.\n          Uncle Arthur snores\n          softly on in the other room.\n          From outside, a dull thunk.\n          LARRY pulls back a curtain.\n          Next door, Gar Brandt is going down the walk, wearing camouflage\n          togs and camo billed\n          cap, a rifle bag slung over his shoulder. He is carrying an ice\n          chest, its contents clicking\n          and sloshing.\n          The boy Mitch, also wearing camo clothes and cap and also with\n          a rifle bag, has just\n          closed the front door. He now lets the screen door swing shut\n          behind him and follows his\n          father down the walk to the car in the driveway.\n          The twitter of early morning birds. Gar's voice, though not projected,\n          stands out in the\n          pre-dawn quiet:\n\n          GAR\n          Let's see some hustle, Mitch.\n\n          CLOSE ON THE NOTEBOOK\n          Its top sheet, densely covered by equations, has a heading:\n          The Mentaculus\n          Compiled by Arthur Gopnik\n          After a beat LARRY's hand enters to turn the page. The second\n          page is also densely\n          covered with equations.\n\n          \n\n          \n\n          \n\n          \n\n          46\n\n          VOICE\n\n          LARRY?\n          This brings LARRY's look up from the Mentaculus. We are in LARRY's\n          office. Standing in\n          the office doorway is Arlen Finkle.\n\n          LARRY\n          Hi Arlen.\n          Arlen Finkle\n          LARRY, I feel that, as head of the tenure committee I should\n          tell you this, though it should be no cause for concern. You\n          should not be at all worried.\n          LARRY waits for more. Arlen seems to need a prompt.\n\n          LARRY\n          Okay.\n          Arlen Finkle\n          I feel I should mention it even though we won't give this\n          any weight at all in considering whether to grant you\n          tenure, so, I repeat no cause for concern.\n\n          LARRY\n          Okay, Arlen. Give what any weight?\n          Arlen Finkle\n          We have received some letters, uh... denigrating you, and,\n          well, urging that we not grant you tenure.\n\n          LARRY\n          From who?\n          Arlen Finkle\n          They're anonymous. And so of course we dismiss them\n          completely.\n\n          LARRY\n          Well... well... what do they say?\n          Arlen Finkle\n          They make allegations, not even allegations, assertions, but\n\n          \n\n          \n\n          \n\n          \n\n          47\n          I'm not really... while we give them no credence, LARRY,\n          I'm not supposed to deal in any specifics about the\n          committee's deliberations.\n\n          LARRY\n          But... I think you're saying, these won't play any part in\n          your deliberations.\n          Arlen Finkle\n          None at all.\n\n          LARRY\n          Um, so what are they...\n          Arlen Finkle\n          Moral turpitude. You could say.\n\n          LARRY\n          Uh-huh. Can I ask, are they, are they-idiomatic?\n          Arlen Finkle\n          I, uh...\n\n          LARRY\n          The reason I ask, I have a Korean student, South Korean,\n          disgruntled South Korean, and I meant to talk to you about\n          this, actually, he-\n          Arlen Finkle\n          No. No, the letters are competently-even eloquently\n          written. A native English-speaker. No question about\n          that.\n\n          LARRY\n          Uh-huh.\n          Arlen Finkle\n          But I reiterate this, LARRY: no cause for concern. I only\n          speak because I would have felt odd concealing it.\n\n          LARRY\n          Yes, okay, thank you Arlen.\n\n          \n\n          \n\n          \n\n          \n\n          48\n          Arlen Finkle\n          Best to Judith.\n          LARRY answers with a wan smile. He looks down at the Mentaculus.\n\n          HEBREW SCHOOL EXTERIOR\n          Day. Somewhere inside the school a bell rings. Its doors swing\n          open and children\n          emerge.\n          Our angle is down a line of school busses, each with the the\n          same stenciled Hebrew\n          lettering, waiting to ferry the children home.\n          We are tracking toward the busses to steepen the rake. As children\n          sort themselves out\n          and climb into their respective vehicles, the track brings the\n          nearest bus into the fore-\n          ground. It noisily idles with its signature squeaks and stress\n          sounds, its low coughing\n          engine ominously rumbling. Children start climbing on.\n\n          MINUTES LATER\n          Inside the bus, now moving. Engine noise bangs in louder and\n          air roars in through open\n          windows.\n          We are on the driver, a sallow man in a short-sleeved white shirt\n          with earlocks and a\n          yarmulke. He pitches about, stoically wrestling with the wheel\n          and gear shift as the\n          vehicle bucks.\n          The pitching children. Somewhere, Jefferson Airplane plays.\n\n          DANNY\n          I gotta get my radio back.\n          Ronnie Nudell\n          Maybe the fucker lodged it up his fucking asshole.\n\n          DANNY\n          I gotta get it back. Or Mike Fagle's gonna pound the crap\n          out of me.\n          Ronnie Nudell\n\n          \n\n          \n\n          \n\n          \n\n          49\n          Way up his asshole.\n\n          DANNY\n          And I'll still have to get my sister the money back or she's\n          gonna break four of my records. Twenty bucks, four\n          records.\n          Howard Altar\n          How do you buy all those records. Where do you get your\n          funds.\n\n          CLOSE ON LARRY\n          Standing in his yard. His eyes are darkly pouched. He is staring\n          at something, it seems\n          in distress. We hear a fluttering sound.\n          His point-of-view: stakes are set out in the Brandts' yard. Red\n          ribbon connecting them\n          outlines a projection from the side of the house. The loose ends\n          of the ribbon flutter in\n          the breeze.\n          Engine noise brings LARRY's look around. A car is arriving.\n          It is the Brandts' car, oddly burdened. As it pulls into their\n          driveway we see that there is\n          a four-point stag strapped to the hood, its head lolling over\n          the grille.\n          Gar and Mitch get out of the car in their hunting fatigues. Blood\n          is smeared on Gar's\n          shirt.\n\n          GAR\n          Go scrub up, Mitch.\n\n          LARRY\n          Uh, good afternoon.\n          This brings Gar's look around. Apparently he is unused to talking\n          with his neighbor.\n          There is a short beat before his response.\n\n          GAR\n          Afternoon.\n          In the background of his angle is the dead buck, staring off\n          through sightless eyes.\n\n          \n\n          \n\n          \n\n          \n\n          50\n\n          LARRY\n\n          (LAMELY)\n          . Been hunting?\n\n          GAR\n          Yep.\n\n          LARRY\n          Is that a, uh...\n          He is indicating the staked area. Gar looks around at it, looks\n          back at LARRY.\n\n          GAR\n          Gonna be a den.\n\n          LARRY\n          Uh-huh, that's great. Uh, Mr. Brandt-\n          Gar barks at Mitch, who has lingered to listen to the grown-ups:\n\n          GAR\n          I said scrub up, Mitch!\n          The child quickly goes. LARRY frowns.\n\n          LARRY\n          Isn't this a school day?\n\n          GAR\n          Took him out of school today. So he could hunt with his\n          dad.\n\n          LARRY\n          Oh!\n          He nods.\n          . That's.. . nice.\n          Gar stares at him with button eyes. Small talk is not his thing.\n          LARRY clears his throat.\n\n          \n\n          \n\n          \n\n          \n\n          51\n          . Um, Mr. Brandt, that's just about at the property line,\n          there. I don't think we're supposed to get within, what, ten\n\n          FEET\n\n          GAR\n          Property line's the poplar.\n\n          LARRY\n          . the. ?\n\n          GAR\n          Poplar!\n\n          LARRY\n          . Well.. . even if it is, you're just about over it\n\n          GAR\n          Measure.\n          We hear two pairs of pounding footsteps coming up the street.\n\n          LARRY\n          I don't have to measure, you can tell it's...\n\n          GAR\n          Line's the poplar.\n          He indicates.\n          . It's all angles.\n          Gar Brandt turns and goes.\n          LARRY turns, reacting to the pounding footsteps. One of the two\n          pairs belongs to DANNY\n          who arrives, slowing to a walk, panting, a bookbag over his shoulder.\n          A half-block back the pursuing boy also stops running. Husky,\n          shaggy-haired, he\n          watches, scowling, as DANNY goes up the walk to his house.\n          LARRY addresses DANNY's retreating back:\n\n          \n\n          \n\n          \n\n          \n\n          52\n\n          LARRY\n          What's going on?\n\n          DANNY\n          Nothing.\n\n          IN THE HOUSE\n          As LARRY enters.\n          Judith (ofj)\n\n          LARRY?\n\n          LARRY\n\n          (PROJECTING)\n          Yeah?\n          Judith (ofj)\n          Did you go to Sieglestein Schlutz?\n          No, I-not yet.\n\n          LARRY.\n          Appointment Monday.\n          The thud of a car door outside.\n          SARAH heads for the front door, pulling on a jacket. LARRY is\n          surprised.\n          . Where are you going?\n\n          SARAH\n          I'm going to the hole.\n\n          LARRY\n          At five o'clock?\n          He looks out the front-door window. Four girls of SARAH's age\n          are coming up the walk\n\n          \n\n          \n\n          \n\n          \n\n          53\n          from the car. All have dark hair and big noses.\n\n          SARAH\n          We're stopping at Laurie Kipperstein's house so I can wash\n          my hair.\n          LARRY pulls open the door just as the doorbell rings. From the\n          four dark girls:\n\n          VOICES\n          Hi, Mr. Gopnik.\n\n          LARRY\n          You can't wash it here?\n          From somewhere in the house, Jefferson Airplane starts.\n          As she brushes past LARRY:\n\n          SARAH\n          Uncle Arthur's in the bathroom.\n\n          VOICE\n          Out in a minute!\n          Judith enters.\n\n          JUDITH\n          Are you ready?\n\n          LARRY\n          Huh?\n\n          JUDITH\n          We're meeting Sy at Embers.\n\n          LARRY\n          I am?\n\n          JUDITH\n          Both of us. I told you.\n\n          EMBERS\n\n          \n\n          \n\n          \n\n          \n\n          54\n          LARRY has his arms pinned at his sides by hugging Sy Ableman.\n\n          SY\n          LARRY. How are you.\n\n          LARRY\n          Sy.\n\n          SY\n          Hello Judith.\n\n          JUDITH\n          Hello Sy.\n          Once Sy releases LARRY, all seat themselves at Sy's booth, Judith\n          next to Sy, LARRY\n          facing.\n\n          SY\n          Thank you for coming, LARRY. It's so impawtant that we be\n          able to discuss these things.\n\n          LARRY\n          I'm happy to come to Embers, Sy, but, I'm thinking, really,\n          maybe it's best to leave these discussions to the lawyers.\n\n          SY\n          Of coss! Legal matters, let the lawyers discuss! Don't mix\n          apples and oranges!\n\n          JUDITH\n          I've beamed you to see the lawyer.\n\n          LARRY\n          (teeth grit)\n          I told you, I'm going Monday.\n\n          SY\n          Monday is timely! This isn't-please!-Embers isn't the\n          forum for legalities, you are so right!\n\n          JUDITH\n          Hmph.\n\n          \n\n          \n\n          \n\n          \n\n          55\n\n          SY\n          No, Judith and I thought merely we should discuss the\n          practicalities, the living arrangements, a situation that will\n          conduce to the comfit of all the parties. This is an issue\n          where no one is at odds.\n          LARRY isn't sure where this is leading:\n\n          LARRY\n          . Living arrangements.\n\n          SY\n          Absolutely. I think we all agree, the children not being\n          contaminated by the tension-the most impawtant.\n\n          JUDITH\n          We shouldn't put the kids in the middle of this, LARRY.\n\n          LARRY\n          The kids aren't-\n\n          JUDITH\n          I'm saying \"we.\" I'm not pointing fingers.\n\n          SY\n          No one is playing the \"blame game,\" LARRY.\n\n          LARRY\n          I didn't say anyone was!\n\n          JUDITH\n          Well let's not play He said, She said, either.\n\n          LARRY\n          I wasn't! I. ---\n\n          SY\n          Aw right, well let's just step back, and defuse the situation,\n\n          LARRY.\n          LARRY glares at Sy.\n\n          \n\n          \n\n          \n\n          \n\n          56\n          Sy smiles at him, sadly. He reaches over and rests a hand on\n          LARRY's hand.\n          . I find, sometimes, if I count to ten.\n          A beat.\n          One... two... three... faw... Or silently.\n          Long beat.\n\n          JUDITH\n          Really, to keep things on an even keel, especially now,\n          leading up to DANNY's bar mitzvah-\n\n          SY\n          A child's bar mitzvah, LARRY!\n\n          JUDITH\n          Sy and I think it's best if you move out of the house.\n\n          LARRY\n          . Move out?!\n\n          SY\n          It makes eminent sense.\n\n          JUDITH\n          Things can't continue as they-\n\n          LARRY\n          Move out! Where would I go?!\n\n          SY\n          Well, for instance, the Jolly Roger is quite livable. Not\n          expensive, and the rooms are eminently livable.\n\n          JUDITH\n          This would allow you to visit the kids.\n\n          SY\n          There's convenience in its fava. There's a pool-\n\n          LARRY\n\n          \n\n          \n\n          \n\n          \n\n          57\n          Wouldn't it make more sense for you to move in with Sy?\n          Judith and Sy gape at him, shocked.\n          After a long beat:\n\n          JUDITH\n\n          LARRY!\n\n          SY\n          LARRY, you're jesting!\n\n          JUDITH\n          LARRY, there is much to accomplish before that can happen.\n          Sy is sadly shaking his head.\n\n          SY\n          LARRY, LARRY, LARRY. I think, really, the Jolly Roger is the\n          appropriate coss of action.\n          He shrugs.\n          It has a pool.\n\n          IN BLACK AND WHITE: A BRAIN\n          It sits in a large fishbowl filled with clear fluid.\n          The brain, alive, pulses. Leads connect it to various pieces\n          of gear outside the fishbowl.\n          Brain and appurtenances sit on a dais of sorts dressed out with\n          bunting.\n          Oddly, the picture is scored with cantorial singing.\n          The brain seems to be giving orders to people who wear imperfectly\n          form-fitting 1950's\n          uniforms of the future. After receiving their instructions the\n          minions of the brain\n          kowtow before it and leave. They are succeeded by two leather-helmeted\n          thugs, big and\n          heavy though lacking muscle definition, who escort a resisting\n          handsome man before the\n          brain. The handsome man, hands tied behind his back, gazes defiantly\n          up at the brain\n          which in some fashion addresses him.\n          We hear blows and voices over the cantorial music:\n\n          \n\n          \n\n          \n\n          \n\n          58\n\n          DANNY\n          Stop it!\n\n          SARAH\n          Creep fucker!\n\n          DANNY\n          Stop it! I'm getting it! I'm gonna get it!\n          Wider shows that the brain is on television, which DANNY has\n          muted while he plays the\n          Cantor Youssele Rosenblatt record and drills his torah portion.\n          He and SARAH are in a\n          stand-off, hands tensed to either deliver or ward off blows.\n\n          SARAH\n          Brat!\n          LARRY enters.\n\n          LARRY\n          What's going on?\n\n          SARAH\n\n          (LEAVING)\n          Nothing.\n          She closes the door behind her.\n\n          LARRY\n          What was that?\n\n          DANNY\n          Nothing.\n\n          LARRY\n          How's the haftorah coming? Can you maybe use the hi-fi?\n\n          DANNY\n          What?\n          We hear the doorbell off. LARRY indicates the portable record\n          player.\n\n          LARRY\n\n          \n\n          \n\n          \n\n          \n\n          59\n          Can I borrow this? I'm taking some stuff. To, you know,\n          the Jolly Rodger.\n\n          DANNY\n          Sure Dad.\n          On TV, the handsome man shouts defiance at the brain.\n          From off, SARAH projects:\n\n          SARAH\n          Dad. Chinese guy.\n\n          ASIAN MAN\n          A middle-aged Korean man, well groomed. He wears a nicely cut\n          suit and a jeweled tie-\n          pin.\n\n          MAN\n          Culcha clash.\n          He bangs his two knuckles together, illustrating.\n          . Culcha clash.\n          He faces LARRY in the driveway. LARRY's car is half-loaded with\n          open boxes that are\n          haphazardly stuffed with clothing and effects.\n          LARRY is leaning against the hood, arms folded, gazing at the\n          man, unimpressed. A long\n          beat.\n          Finally he bestirs himself.\n\n          LARRY\n          With all respect, Mr. Park, I don't think it's that.\n          Mr. Park\n          Yes.\n\n          \n\n          \n\n          \n\n          \n\n          60\n\n          LARRY\n          No. It would be a culture clash if it were the custom in\n          your land to bribe people for grades.\n          Mr. Park\n          Yes.\n\n          LARRY\n          So-you're saying it is the custom?\n          Mr. Park\n          No. This is defamation. Grounds for lawsuit.\n\n          LARRY\n          You-let me get this straight-you're threatening to sue\n          me for defaming your son?\n          Mr. Park\n          Yes.\n\n          LARRY\n          But it would-\n          Gar Brandt\n          Is this man bothering you.\n          Gar Brandt stands on the strip of lawn separating the two neighbors.\n          He is giving Mr.\n          Park a hard stare.\n\n          LARRY\n          Is he bothering me? No. We're fine. Thank you, Mr.\n          Brandt.\n          Gar Brandt, not entirely convinced, withdraws, glaring at the\n          Korean.\n          LARRY turns back to Mr. Park.\n          . I, uh. . See, if it were defamation there would have to\n          be someone I was defaming him to, or I... All right, I...\n          let's keep it simple. I could pretend the money never\n          appeared. That's not defaming anyone.\n\n          \n\n          \n\n          \n\n          \n\n          BL\n          Mr. Park\n          Yes. And passing grade.\n\n          LARRY\n          Passing grade.\n          Mr. Park\n          Yes.\n\n          LARRY\n          Or you'll sue me.\n          Mr. Park\n          For taking money.\n\n          LARRY\n          So.. . he did leave the money.\n          Mr. Park\n          This is defamation.\n          LARRY stares at him.\n\n          LARRY\n          Look. It doesn't make sense. Either he left the money or\n          he didn't\n          Mr. Park\n          Please. Accept mystery.\n\n          LARRY\n          You can't have it both ways! If\n          Mr. Park\n          Why not.\n          LARRY stares.\n          We hear Sidor Belarsky music.\n\n          RECORD PLAYER\n\n          \n\n          \n\n          \n\n          \n\n          62\n          Sidor Belarsky's singing crosses the cut. The tone arm of DANNY's\n          portable record\n          player rides on a spinning LP.\n          Wider shows LARRY grading bluebooks at a small formica table\n          crowded into a corner of\n          his motel room. It is a depressingly generic budget motel room\n          of the mid-sixties with\n          cheaply paneled walls, thin carpet, formica night tables, plastic\n          lamps, and twin beds\n          with stained nubby bedspreads.\n          The phone rings.\n\n          LARRY\n          Hello...\n          He brightens.\n          . Fine, Mimi, how are you?... Uh-huh... No, it's not\n          that bad... It's not that bad... There's a pool...\n          Arthur emerges from an alcove in the dim depth of the room that\n          has a dressing-room\n          mirror and apparently connects to the bathroom. He has a hand\n          towel pressed to the\n          back of his neck.\n          . Oh sure, that sounds great. . . Oh, great, then I'll bring\n\n          DANNY...\n\n          LAKE NOKOMIS\n          The beach: families are crowded onto the small beach of a freshwater\n          lake, children\n          cavorting, adults lounging, much sun, few umbrellas. Red floats\n          connected by red nylon\n          rope define a swimming area; beyond it people dive from an anchored\n          raft.\n          Splashing and children's laughter slap off the surface of the\n          lake.\n\n          WOODS\n          Above the lake. The beach noise has some distance. It also has\n          a faintly bizarre canyon\n          echo. There is a present, sybillant shushing of breeze in the\n          trees.\n          It is dark here with intense hot spots where sun sifts through\n          the leaf cover. We are close\n          on DANNY, who sits very still, leaning back against a tree trunk.\n\n          \n\n          \n\n          \n\n          \n\n          63\n          After a very long beat he slowly exhales, a small amount of smoke\n          feathering out with his\n          breath.\n\n          VOICE\n          Gimme that fucker.\n          DANNY passes the joint to Ronnie Nudell, who sits opposite.\n\n          PICNIC AREA\n          On a woodless rise above the lake. Each of the separate picnic\n          areas consist of a redwood\n          table and benches placed next to a firepit.\n          Here in the sun both LARRY and Mel Nudell, a man slightly older\n          than LARRY, glisten with\n          sweat. Mel, in the background, bounces a bag of charcoal briquettes\n          to spill some into\n          the firepit. LARRY sits at the table in the foreground with Mimi\n          Nudell who alone seems\n          unaffected by the heat-or by anything else in the physical environment.\n          Her pale,\n          gravely composed Giacometti face is shaded by a large-brimmed\n          hat.\n\n          LARRY\n          No. Almost a year and a half since Touche Ross let him\n          go. He's very good with numbers. I think his, his social\n          skills have held him back.\n\n          MIMI\n          Such a sweet man though.\n\n          LARRY\n          Arthur has a good heart. And he never complains, unlike\n          me. Sometimes I don't give him enough credit.\n\n          MIMI\n          He tried to tell me about this thing he's working on, this,\n          um...\n\n          LARRY\n          The Mentaculus? He says it's a, uh. a probability map.\n          Of the universe. He asked if I could help him publish it.\n          Um, it was a little hard for me to evaluate.\n\n          \n\n          \n\n          \n\n          \n\n          64\n          A beat.\n\n          MIMI\n          Does he go out socially at all?\n\n          LARRY\n          He tries. He's been going to the singles mixers at Hillel\n          House.-Well, I should talk, I'm not doing any better.\n\n          MIMI\n          How is Judith?\n\n          LARRY\n          Fine. She's fine. I'm the odd man out.\n          Mimi smiles.\n\n          MIMI\n          Sometimes these things just aren't meant to be. And it can\n          take a while before you feel what was always there, for\n          better or worse.\n\n          LARRY\n          I never felt it! It was a bolt from the blue! What does that\n          mean! Everything that I thought was one way turns out to\n          be another!\n\n          MIMI\n          Then-it's an opportunity to learn how things really are.\n          LARRY broods. Mimi softens.\n          . I'm sorry-I don't mean to sound glib. It's not always\n          easy, deciphering what God is trying to tell you.\n\n          LARRY\n          I'll say.\n\n          MIMI\n          But it's not something you have to figure out all by your-\n          self. We're Jews, we have that well of tradition to draw on,\n          to help us understand. When we're puzzled we have all the\n\n          \n\n          \n\n          \n\n          \n\n          65\n          stories that have been handed down from people who had\n          the same problems.\n\n          LARRY\n          I guess.\n\n          MIMI\n          Have you talked to Rabbi Nachtner?\n          Silence.\n          Arthur is climbing the hill from the lake, dripping wet. He projects:\n\n          ARTHUR\n          Boy! The air out here is magnificent!\n          Mimi, looking at LARRY, responds to his dark silence:\n\n          MIMI\n          Why not see him?\n          Mel Nudell has finished spreading and lighting the coals. He\n          now comes and sits next to\n          Mimi, draping an arm over her shoulder. She strokes his hand,\n          still looking at LARRY.\n\n          LARRY\n          What's the rabbi gonna tell me?\n\n          MIMI\n          If I knew I'd be the rabbi.\n          He looks at her glumly. She laughs.\n          . Life is beautiful, LARRY. Nobody's sick. Nobody died.\n          You just need help remembering how to enjoy it.\n          She rests her head against Mel's shoulder.\n          . Where are the kids?\n\n          MEL\n          Woods. Exploring.\n          Uncle Arthur approaches, swim trunks plastered to his thighs,\n          hair dripping, one hand\n\n          \n\n          \n\n          \n\n          \n\n          66\n          pressing his towel to the back of his neck.\n\n          ARTHUR\n          If somebody could bottle this air they'd make a million\n          bucks!\n          A white title comes up:\n          The First Rabbi\n\n          SYNAGOGUE OFFICE ANTEROOM\n          Day. LARRY sits waiting. A door opens and he rises.\n\n          LARRY\n          Oh-Rabbi Scott.\n          Rabbi Scott Ginzler is the junior rabbi, a man in his twenties.\n          Rabbi Scott\n          Hello LARRY.\n\n          LARRY\n          I thought I was going to see Rabbi Nachtner.\n          Rabbi Scott\n          He was called away on an etz monim: Ruth Brynn's mother\n          is in the hospital and she isn't doing well. Rabbi Nachtner\n          asked me to cover for him-come on in.\n\n          RABBI SCOTT'S OFFICE\n          A few minutes later. LARRY sits tensely hunched forward facing\n          Rabbi Scott.\n\n          LARRY\n          And she wants a Gett.\n          A long silence. The hum of ventilation.\n          At length:\n\n          \n\n          \n\n          \n\n          \n\n          67\n          Rabbi Scott\n          A what?\n\n          LARRY\n          She wants a-\n          Rabbi Scott\n          Oh, a Gett. Uh-huh, sure.\n\n          LARRY\n          I feel like the carpet's been yanked out from under me. I\n          don't know which end is up. I'm not even sure how to\n          react; I'm too confused.\n          Rabbi Scott\n          What reasons did she give? For the rupture?\n\n          LARRY\n          She didn't give-reasons. Just that, oh, you know, things\n          haven't been going well.\n          Rabbi Scott\n          And is that true?\n\n          LARRY\n          I guess. I don't know. She's usually right about these\n          things.\n          Rabbi Scott\n          Mm-hm.\n\n          LARRY\n          I feel so... addled.\n          Rabbi Scott\n          Yes, I can see.\n\n          LARRY\n          I was hoping that... Rabbi Nachtner...\n          Rabbi Scott\n          That he would... yes?\n\n          \n\n          \n\n          \n\n          \n\n          68\n\n          LARRY\n          Well, with the benefit of his life experience... no\n\n          OFFENSE-\n          Rabbi Scott chuckles.\n          Rabbi Scott\n          No, of course not. I am the junior rabbi. And it's true, the\n          point-of-view of somebody who's older and perhaps had\n          similar problems might be more valid. And you should see\n          the senior rabbi as well, by all means. Or even Minda if\n          you can get in, he's quite busy. But maybe-can I share\n          something with you? Because I too have had the feeling of\n          losing track of Hashem, which is the problem here. I too\n          have forgotten how to see Him in the world. And when\n          that happens you think, well, if I can't see Him, He isn't\n          there any more, He's gone. But that's not the case. You\n          just need to remember how to see Him. Am I right?\n          He rises and goes to the window.\n          I mean, the parking lot here. Not much to see.\n          It is a different angle on the same parking lot we saw from the\n          Hebrew school window.\n          But if you imagine yourself a visitor, somebody who\n          isn't familiar with these... autos and such... somebody\n          still with a capacity for wonder... Someone with a fresh...\n          perspective. That's what it is, LARRY.\n\n          LARRY\n          Um...\n          Rabbi Scott\n          Because with the right perspective you can see Hashem,\n          you know, reaching into the world. He is in the world, not\n          just in shul. It souunds to me like you're looking at the\n          world, looking at your wife, through tired eyes. It sounds\n          like she's become a sort of... thing... a problem... a\n          thing...\n\n          LARRY\n          Well, she's, she's seeing Sy Ableman.\n\n          \n\n          \n\n          \n\n          \n\n          69\n          Rabbi Scott\n          Oh.\n\n          LARRY\n          She's, they're planning, that's why they want the Gett.\n          Rabbi Scott\n          Oh. I'm sorry.\n\n          LARRY\n          It was his idea.\n          Rabbi Scott\n          Well, they do need a Gett to remarry in the faith. But this\n          is life. For you too. You can't cut yourself off from the\n          mystical or you'll be-you'll remain-completely lost.\n          You have to see these things as expressions of God's will.\n          You don't have to like it, of course.\n\n          LARRY\n          The boss isn't always right, but he's always the boss.\n          Rabbi Scott\n          Ha-ha-ha! That's right, things aren't so bad. Look at the\n          parking lot, LARRY.\n          Rabbi Scott gazes out, marveling.\n          . Just look at that parking lot.\n\n          EXTERIOR: GOPNIK HOUSE\n          Our low angle looks across the lawn toward the front of the house.\n          Someone's pounding\n          footsteps approach and his feet enter just off the lens and he\n          quickly recedes, cropping in\n          as he races up to the house: DANNY.\n          A beat later pursuing feet enter, slowing-for DANNY is already\n          mounting the front\n          stoop. DANNY's pursuer does not go deep enough to crop in but\n          we might gather from\n          the size eleven sneakers and the cuffed jeans that it is hulking\n          Mike Fagle.\n\n          \n\n          \n\n          \n\n          \n\n          70\n\n          GOPNIK KITCHEN\n          We hear the front door being flung open and slammed shut, and\n          in the background foyer\n          DANNY appears, panting heavily. He gives one glance back toward\n          the front door and\n          then looks at his mother and sister eating soup in the foreground.\n          His sister has a towel\n          wrapped turbanlike around her head. She holds it with one hand\n          to keep it from tipping\n          off when she tilts her head down for the soup.\n\n          DANNY\n          (still panting)\n          We eating already?\n\n          SARAH\n          I'm going to the hole.\n          DANNY enters the kitchen and sits at the setting across from\n          his sister. He picks up his\n          spoon.\n          Some movement in SARAH's body; DANNY recoils from a kick.\n\n          DANNY\n          Ow! Cut it out!\n\n          JUDITH\n          What's going on?\n          The siblings slurp soup, neither answering.\n          After a couple slurps:\n          . Isn't Dad eating?\n\n          JUDITH\n          He's at the Jolly Roger.\n\n          DANNY\n          Oh yeah.\n          More eating.\n\n          FADE OUT\n\n          \n\n          \n\n          \n\n          \n\n          71\n\n          SIEGLESTEIN, SCHLUTZ\n          In a small windowless conference room lined by bookshelves filled\n          with law reference\n          books, LARRY rises to greet Don Milgram, entering.\n\n          LARRY\n          Don.\n\n          DON\n          How are you, LARRY, Jesus, I am so sorry to be seeing you\n          under these circumstances.\n\n          LARRY\n          Oh, well...\n\n          DON\n          I always thought you and JUDY were rock solid. This is so\n          terrible, LARRY. This is devastating.\n\n          LARRY\n          Well, the way I look at it, it's an opportunity for me to\n          really sit down and figure things out, and, and, look at the\n          world afresh instead of just, you know, settling for the\n          routine, tired old way of looking at things.\n          Don Milgram stares at him.\n\n          DON\n          . Really?\n\n          LARRY\n\n          (DEFLATING)\n          I don't know. Maybe not.\n\n          DON\n          Well, legally, I have to warn you, it's never easy for the\n          husband. Unless, of course, there's some question of the\n          wife having violated the marriage contract.\n\n          LARRY\n          Oh no, nothing like that. She's planning to marry Sy\n          Ableman, but they-\n\n          \n\n          \n\n          \n\n          \n\n          72\n\n          DON\n          Sy Ableman!\n\n          LARRY\n          Yes, but they-\n\n          DON\n          Esther is barely cold!\n\n          LARRY\n          She passed three years ago.\n\n          DON\n          Well, okay, still-this changes the complexion, LARRY! Sy\n          Ableman!\n\n          LARRY\n          Not in the sense that... there hasn't been hanky-panky. To\n          my knowledge.\n\n          DON\n          Oh.\n\n          LARRY\n          No. I'm fairly certain this is not an issue. And in fact they,\n          uh, Judith wants a Gett.\n          Beat. Don stares blankly at LARRY.\n          LARRY clears his throat.\n          A ritual divorce.\n\n          DON\n          Oh.\n\n          LARRY\n          So that they can remarry in the faith-\n\n          DON\n          Uh-huh, sure, not really a legal matter. Okay. Well. My\n          goodness. How are the children taking it?\n\n          \n\n          \n\n          \n\n          \n\n          73\n\n          LARRY\n          Oh, they're very...\n          He gropes.\n          . resilient.\n\n          DON\n          Good. Well. On the other thing, the neighbor's property\n          line, I've asked Solomon Schlutz to take a look. There's\n          very little having to do with real estate that'll get by Sol.\n\n          LARRY\n          Okay. Good. How do you-I guess I'm a little worried,\n          how do you, I have money pressures and-\n\n          DON\n          Our fee structure? We bill by the hour. Dave Sieglestein\n          and Solomon Schlutz bill at a hundred and ten, the associ-\n          ates, me for instance, bill at\n          A secretary sticks her head in.\n\n          SECRETARY\n          A call for Mr. Gopnik. DANNY. At home.\n\n          LARRY\n\n          DANNY? !\n\n          DON\n          You can take it here.\n\n          SECRETARY\n          Oh-eight-oh-nine.\n          LARRY punches a button on a row of four on the conference-room\n          telephone.\n\n          LARRY\n\n          DANNY? !\n\n          VOICE\n          Dad?\n\n          \n\n          \n\n          \n\n          \n\n          74\n\n          LARRY\n          Are you all right? Are you all-is everything-\n\n          VOICE\n          F Troop is fuzzy.\n\n          LARRY\n          . What?\n\n          VOICE\n          F Troop is still fuzzy.\n          LARRY stares.\n\n          DON\n          Everything okay?\n\n          DAWN AT THE JOLLY ROGER\n          Wide on the motel room, dimly lit by weak sun starting to seep\n          in around the curtain.\n          LARRY sleeps in one of the twin beds; Uncle Arthur snores in\n          the other.\n          Uncle Arthur's breath snags and tangles on a snorfling inhale\n          and it wakes him, gagging.\n          He blinks, sits up, swings his legs out, gazes blearily around\n          the room.\n          He rises stiffly and heads for the bathroom.\n          LARRY stirs. The sound of Uncle Arthur urinating. LARRY looks\n          blearily around.\n          LARRY stiffly rises. He takes the two steps across the room to\n          the formica desk on which\n          are spread papers for his class. As we hear the sucking sound\n          of the neck evacuator in\n          the bathroom, LARRY sweeps papers together and mechanically stuffs\n          his briefcase.\n\n          CAR\n          LARRY is driving, hollow-eyed, to work.\n          After a long beat of staring, the ka-ching of a bicycle bell.\n\n          \n\n          \n\n          \n\n          \n\n          75\n          LARRY's eyes widen and his head swivels, tracking as he overtakes\n          and passes:\n          The bicyclist. A young Asian man wearing a white traffic-mask.\n          LARRY looks at him in the rear-view.\n\n          LARRY\n\n          CLIVE!\n          He starts frantically pumping down his window, shouting:\n          . CLIVE! You gonna send your mother next?! You little\n          bastard! I wanna see you! I wanna-\n          Crash.\n          He has rear-ended someone.\n          A blaring horn, a quick second crash: wrenching steel and spattering\n          glass.\n          He has been rear-ended in turn.\n          The ka-ching of the bicycle. CLIVE Park cycles past without looking.\n\n          BLEGEN HALL\n          LARRY enters the outer office, hugging his paper-stuffed briefcase\n          to his chest.\n          The secretary is just crooking the phone into her shoulder.\n\n          SECRETARY\n          Oh-Professor Gopnik. It's Dick Dutton again.\n\n          LARRY\n\n          (BLANK)\n          Dick Dutton.\n\n          LARRY'S OFFICE\n          He sits in and picks up the phone.\n\n          \n\n          \n\n          \n\n          \n\n          76\n\n          LARRY\n          Hello?\n\n          VOICE\n          Hello, Mr. Gopnik, this is Dick Dutton from the Columbia\n          Record Club. I'm calling because it is now, what, four\n          months and we have yet to receive your first payment.\n\n          LARRY\n          I-there's some mistake. I'm not a member of the\n          Columbian Record Club.\n\n          VOICE\n          Sir, you are Lawrence Gopnik of 1425 Flag Avenue South?\n\n          LARRY\n          No, I live at the Jolly Roger.\n\n          VOICE\n          Excuse me?\n\n          LARRY\n          No, I-well, yes, okay.\n\n          VOICE\n          Yes you are Lawrence Gopnik?\n\n          LARRY\n          Okay.\n\n          VOICE\n          Okay means...\n\n          LARRY\n          Okay, yes, Lawrence Gopnik, yes.\n\n          VOICE\n          Okay, well, you received your twelve introductory albums\n          and you have been receiving the monthly main selection for\n          four months now-\n\n          LARRY\n          \"The monthly main selection?\" Is that a record? I didn't\n\n          \n\n          \n\n          \n\n          \n\n          77\n          ask for any records.\n\n          VOICE\n          To receive the monthly main selection you do nothing.\n\n          YOU-\n\n          LARRY\n          That's right! I haven't done anything!\n\n          VOICE\n          Yes, that's why you receive the monthly main selection.\n          The last\n\n          LARRY\n          But I-\n\n          VOICE\n          The last one was Santana Abraxis. You-\n\n          LARRY\n          I didn't ask for Santana Abraxis!\n\n          VOICE\n          You request the main selection at the retail price by doing\n          nothing. It is automatically mailed to you. Plus shipping\n          and handling. You're about to-\n\n          LARRY\n          I can't afford a new record every month! I haven't asked\n\n          FOR-\n\n          VOICE\n          You're about to get Cosmo's Factory, sir. The June main\n          selection. And you haven't-\n\n          LARRY\n          Look, something is very wrong! I don't want Santana\n          Abraxis! I've just been in a terrible auto accident!\n          Beat.\n\n          VOICE\n          I'm sorry sir.\n\n          \n\n          \n\n          \n\n          \n\n          78\n\n          LARRY\n          Well-thank you. But I-\n\n          VOICE\n          Are you okay?\n\n          LARRY\n          Yes. Yes, no one was hurt.\n\n          VOICE\n          Okay. Good. Well, you had fourteen days to listen to\n          Santana Abraxis and return it if you weren't completely\n          satisfied. You did nothing. And now you-\n\n          LARRY\n          I didn't ask for Santana Abraxis! I didn't listen to Santana\n          Abraxis! I didn't do anything!\n          The secretary is sticking her head in.\n\n          SECRETARY\n          Sir.\n\n          VOICE\n          Sir. Please. We can't make you listen to the record. We-\n\n          SECRETARY\n          Professor Gopnik, your son. He said it's urgent.\n\n          LARRY\n          Okay, look, I have to call you back, this is, this is I'm\n          sorry.\n          He irritably punches a button on the bottom row of four.\n\n          DANNY?\n\n          DANNY\n          Dad!\n\n          LARRY\n          Did you join the Columbia Record Club?!\n\n          \n\n          \n\n          \n\n          \n\n          79\n          Silence.\n\n          . DANNY?\n\n          DANNY\n          Um...\n\n          LARRY\n          DANNY, this is completely unacceptable. I can't afford to-\n\n          DANNY\n          Okay Dad, but you gotta come home.\n\n          LARRY\n          Is it F Troop?\n\n          DANNY\n          Huh? No no. Mom's real upset.\n\n          GOPNIK HOUSE\n          LARRY enters. We can hear weeping, semi-hysterical, from somewhere\n          in the house.\n          SARAH's Voice\n          .Dad?\n\n          LARRY\n          Yes?\n          She enters.\n\n          SARAH\n          Does this mean I can't go to the hole tonight?\n\n          LARRY\n          Does what mean-what happened?\n\n          SARAH\n          Sy Ableman died in a car crash.\n          DANNY's Voice\n\n          \n\n          \n\n          \n\n          \n\n          80\n          Hey Dad!\n\n          LARRY\n          What?!\n          DANNY enters.\n\n          DANNY\n          So are you coming back home? Can you fix the aerial?\n          The weeping, off, grows louder and more hysterical.\n\n          LARRY\n          What?!\n\n          DANNY\n          It's still, you know...\n          Loud wailing.\n\n          BLACK\n          After a beat in black, a white title:\n          The Second Rabbi\n          The title fades.\n\n          RABBI'S OFFICE\n          We are close on LARRY. He sits hunched forward, hands clasped\n          in front of him, staring at\n          the floor, sadly shaking his head.\n          After a long beat:\n\n          LARRY\n          It seems like she's asking an awful lot. But then-I don't\n          know. Somebody has to pay for Sy's funeral.\n          Rabbi Nachtner, sitting opposite, nods.\n          Rabbi Nachtner\n\n          \n\n          \n\n          \n\n          \n\n          81\n          Uh-huh.\n\n          LARRY\n          His own estate is in probate. But why does it have to be\n          me? Or is it wrong to complain? JUDY says it is. But I'm\n          so strapped for cash right now-paying for the Jolly Roger,\n          and I wrecked the car, and DANNY's bar mitzvah... I...\n          Rabbi Nachtner\n          Something like this-there's never a good time.\n\n          LARRY\n          I don't know where it all leaves me. Sy's death. Obviously\n          it's not going to go back like it was.\n          Rabbi Nachtner\n          Mm. Would you even want that, LARRY?\n\n          LARRY\n          No, I-well yeah! Sometimes! Or-I don't know; I guess\n          the honest answer is I don't know. What was my life\n          before? Not what I thought it was. What does it all mean?\n          What is Hashem trying to tell me, making me pay for Sy\n          Ableman's funeral?\n          Rabbi Nachtner\n          Mm.\n\n          LARRY\n          And-did I tell you I had a car accident the same time Sy\n          had his? The same instant, for all I know. Is Hashem\n          telling me that Sy Ableman is me, or we are all one or\n          something?\n          Rabbi Nachtner\n          How does God speak to us: it's a good question. You\n          know Lee Sussman?\n\n          LARRY\n          DOCTOR Sussman? I think I-yeah.\n          Rabbi Nachtner\n          Did he ever tell you about the goy's teeth?\n\n          \n\n          \n\n          \n\n          \n\n          82\n\n          LARRY\n          No... I-What goy?\n          Rabbi Nachtner\n          So Lee is at work one day; you know he has the orthodontic\n          practice there at Texa-Tonka.\n\n          LARRY\n          Uh-huh.\n          Rabbi Nachtner\n          Right next to the Gold Eagle Cleaners.\n          We cut to:\n\n          SIGN FOR THE GOLD EAGLE CLEANERS\n          It dominates a small suburban strip mall.\n          Rabbi Nachtner continues in voice-over as we cut to a smoked\n          glass door that identifies\n          Leon Sussman, DDS.\n          Rabbi Nachtner\n          He's making a plaster mold-it's for corrective bridge\n          work-in the mouth of one of his patients...\n          A close shot of a man's mouth biting down on two horse-shoe shaped\n          troughs-an upper\n          and a lower-that overflow an oozing white goo.\n          . Russell Kraus. He's a delivery dispatcher for the Star\n          and Tribune with chronic mandicular deterioration.\n          The grinding guitar solo from Jefferson Airplane's \"Bear Melt\"\n          scores the narrative.\n          The patient opens his mouth as a hand enters to grab the upper\n          tray.\n          The reverse shows Dr. Sussman, a balding middle-aged man, dressed\n          in the the high-\n          collared white smock of an oral surgeon. He carries the mold\n          over to a drying table.\n          Kraus is twisted over the side of the chair spitting into the\n          water-swirled spit-sink.\n          . Well, the mold dries and Lee is examining it one day\n\n          \n\n          \n\n          \n\n          \n\n          83\n          before fabricating an appliance...\n          Another day: Dr. Sussman is sitting at his desk examining the\n          lower mold. He notices\n          something unusual.\n          . He notices something unusual.\n          Sussman reaches up for the loupe attached to his eyeglasses.\n          There seems to be something engraved on the inside of the\n          patient's lower incisors...\n          He flips down the loupe. His eyes are hugely magnified as he\n          stares.\n          Sure enough, it's writing.\n          Sussman squints.\n          His point-of-view: Tiny incised Hebrew letters:\n          smlï¿½nn\n\n          BACK TO RABBI NACHTNER\n          He confirms with a nod.\n          Rabbi Nachtner\n          This in a goy's mouth, LARRY.\n\n          BACK TO LEON SUSSMAN\n          The Rabbi's narrative continues.\n          Rabbi Nachtner\n          Tet resh nun lamed nun shin tsayin. What is that-tiranu\n          linoshets? \"Help me\"? Is that what it says? Or is it a\n          name? It's not Kraus's name.\n          Sussman flips the loupe away and looks off, haunted. He rises.\n          He checks the mold, just to be sure. Oh, it's there all\n\n          \n\n          \n\n          \n\n          \n\n          84\n          right...\n          A dental mirror is dipped into the horse-shoe-shaped hardened\n          paste of the mold. It pans\n          tiny letters that stand out in relief, right-side around in the\n          mirror:\n          yw .rin\n          Sussman leans back, thinking.\n          He calls the goy back on the pretense of needing additional\n          measurements for the appliance...\n          Close on Kraus grinning as he shakes Sussman's hand in the reception\n          area. Sussman\n          gestures to invite Kraus back to the examination room.\n          Sussman chats, affecting nonchalance.\n          In the examination room, leaning over Kraus in the chair, the\n          dentist is indeed chatting\n          with seeming casualness.\n          Notice any other problems with your teeth? Anything\n          peculiar, et cetera?\n          Sussman takes a dental mirror.\n          No. No. No. Visited any other dentist recently?\n          He looks in Kraus' mouth with the mirror:\n          Ym nn\n          Sussman frowns.\n          There it is. \"Help me\"?\n          He leans back.\n          Sussman goes home. Can Sussman eat? No.\n          Sussman sits at the kitchen table, untouched food in front of\n          him. His wife chats volubly\n          while Sussman stares into space.\n          Can Sussman sleep? No.\n\n          \n\n          \n\n          \n\n          \n\n          85\n          Sussman is in bed, pyjamas buttoned to the neck, staring at the\n          ceiling.\n          What does it mean? Is it a message for him, for Sussman?\n          And if so, from whom? Does Sussman know? Sussman\n          doesn't know.\n          Back in the dental office Sussman pulls boxes containing other\n          molds off the shelf.\n          Sussman looks at the molds of his other patients, goy and\n          Jew alike, seeking other messages. He finds none. He\n          looks in his own mouth...\n          Close on Sussman in front of a mirror straining to see the reflection\n          of a reflection of the\n          dental mirror he holds in his own mouth.\n          . Nothing. His wife's mouth...\n          Sussman's wife lies asleep on her back, her mouth open, snoring\n          softly. Sussman, in\n          pyjamas but with his glasses on and loupe in place, lies over\n          her in bed, supporting\n          himself with one arm thrown across her body. He leans awkwardly\n          in, carefully\n          lowering a dental mirror into his wife's open mouth.\n          . Nothing. It is a singular event. A mystery.\n          The Jefferson Airplane guitar solo is heating up.\n          But Sussman is an educated man. Not the world's greatest\n          sage, maybe, no Rabbi Minda, but he knows a thing or two\n          from the Zohar and the Caballah. He knows every Hebrew\n          letter has its numeric equivalent.\n          Sussman, still in his pyjamas is sitting at the kitchen table\n          scribbling on a tablet of lined\n          paper.\n          Close on the paper: the Hebrew letters have been transcribed\n          into their numeric\n\n          EQUIVALENTS:\n\n          496-2428\n          Nachtner continues in voice-over:\n\n          \n\n          \n\n          \n\n          \n\n          86\n          Seven digits-a phone number maybe?\n          Sussman reaches for the phone. He hesitates a moment, then dials.\n          . Sussman dials. It rings.\n\n          AN ELEVATED CUBICLE\n          In a grocery store. A man in short sleeves reaches for the phone.\n          Rabbi Nachtner\n          It's a Red Owl grocery store in Bloomington. Hello? Do\n          you know a goy named Kraus? Russel Kraus?\n          The store manager is shaking his head.\n          Where have I called? The Red Owl. In Bloomington.\n          Thanks so much.\n          The manager, puzzled, hangs up.\n          Sussman thinks, am I supposed to go to the Red Owl, to\n          receive a further sign? He goes...\n          In the parking lot of the Red Owl Sussman, wearing a short-brimmed\n          fedora, emerges\n          from his car. It is an unremarkable grocery store in a suburban\n          mall.\n          It's a Red Owl.\n          Inside Sussman, in his fedora, gazes around.\n          Groceries. What have you.\n          A service alley behind the store: dumpsters, wind-blown garbage,\n          Sussman looking.\n          On the wall behind the store, a stain...\n          There is an old, rather nondescript stain of some liquid splatted\n          against the back wall and\n          long since dribbled away.\n          . Could be a nun sofit... Or maybe not...\n          The parking lot again: Sussman gets back in his car.\n\n          \n\n          \n\n          \n\n          \n\n          87\n          Sussman goes home. What does it mean? He has to find\n          out, if he's ever to sleep again.\n          Sussman again, in pyjamas buttoned to the neck, lies in his bed\n          staring at the ceiling.\n          He goes to see the Rabbi, Nachtner. He comes in and sits\n          right where you're sitting now.\n          Sussman is indeed sitting across from Rabbi Nachtner, just where\n          we've seen LARRY\n          sitting.\n          What does it mean, Rabbi? Is it a sign from Hashem?\n          \"Help me.\" I, Sussman, should be doing something to help\n          this goy? Doing what? The teeth don't say. I should know\n          without asking? Or maybe I'm supposed to help people\n          generally-lead a more righteous life? Is the answer in\n          cabalah? In torah? Or is there even a question? Tell me,\n          Rabbi-what can such a sign mean?\n          Nachtner-not the narrating Nachtner but the Nachtner in the scene-nods\n          and\n          considers.\n\n          LARRY\n          Staring at the Rabbi. He waits a good beat.\n          He prompts:\n\n          LARRY\n          So what did you tell him?\n          The Rabbi seems surprised by the question.\n          Rabbi Nachtner\n          Sussman?\n\n          LARRY\n          Yes!\n          Rabbi Nachtner\n          Is it. . relevant?\n\n          \n\n          \n\n          \n\n          \n\n          88\n\n          LARRY\n          Well-isn't that why you're telling me?\n          Rabbi Nachtner\n          Mm. Okay. Nachtner says, look.. .\n          We are back in the scene, narrated by voice-over, of the Rabbi\n          silently advising the\n          fretful Sussman.\n          . The teeth, we don't know. A sign from Hashem, don't\n          know. Helping others, couldn't hurt.\n          LARRY's voice-over question plays over Sussman asking the same\n          thing:\n          LARRY (of])\n          But is that what it meant?-tet resh nun lamed nun shin\n          isayin, was it \"Help me\"? or a number? Or was it\n          Rabbi Nachtner (off)\n          We can't know everything.\n          Sussman stares blankly at the Rabbi.\n          A beat.\n          LARRY (of])\n          It sounds like you don't know Mthing!\n\n          THE RABBI\n          Smiling equably at LARRY. He reacts to the ejaculation with a\n          shrug.\n          LARRY scowls.\n\n          LARRY\n          Why even tell me the story?\n          Rabbi Nachtner\n\n          (AMUSED)\n          First I should tell you, then I shouldn't.\n\n          \n\n          \n\n          \n\n          \n\n          89\n          LARRY, exasporated, changes tack:\n\n          LARRY\n          What happened to Sussman?\n\n          SUSSMAN\n          In his office. Working on different patients as the Rabbi resumes\n          his voice-over.\n          Rabbi Nachtner\n          What would happen? Not much. He went back to work.\n          For a while he checked every patient's teeth for new\n          messages; didn't see any; in time, he found he'd stopped\n          checking.\n          Sussman, at home, chats with his wife over dinner.\n          . These questions that are bothering you, LARRY-maybe\n          they're like a toothache. We feel them for a while, then\n          they go away.\n          Sussman lies in bed sleeping, smiling, an arm thrown across his\n          wife.\n\n          LARRY\n          Dissatisfied.\n\n          LARRY\n          I don't want it to just go away! I want an answer!\n          Rabbi Nachtner\n          The answer! Sure! We all want the answer! But Hashem\n          doesn't owe us the answer, LARRY. Hashem doesn't owe us\n          anything. The obligation runs the other way.\n\n          LARRY\n          Why does he make us feel the questions if he's not gonna\n          give us any answers?\n          Rabbi Nachtner smiles at LARRY for a beat.\n\n          \n\n          \n\n          \n\n          \n\n          90\n          Rabbi Nachtner\n          He hasn't told me.\n          LARRY rubs his face, frustrated.\n          A last question occurs to him:\n\n          LARRY\n          And what happened to the goy?\n          Rabbi Nachtner's forebearing smile fades into puzzlement.\n          Rabbi Nachtner\n          The goy? Who cares?\n\n          EXTERIOR: THE SYNAGOGUE\n          The modern synagogue grafted onto a patch of prairie.\n          An echoing voice rings out:\n\n          VOICE\n          Sy Ableman was a serious man!\n\n          RABBI NACHTNER\n          In close-up he gazes around, weighing the effect of the words\n          just delivered.\n          After a long beat during which he seeks to establish eye contact\n          with as much of his\n          audience as possible:\n          Rabbi Nachtner\n          . Sy Ableman was a man devoted to his community...\n          Wider shows Rabbi Nachtner up on the bema. He and the congregation\n          face each other\n          across a casket down at floor level.\n          . to torah study...\n          LARRY sits among the congregants, his gaze fixed on a point off.\n\n          \n\n          \n\n          \n\n          \n\n          91\n          . to his beloved wife Esther until, three years ago, she\n          passed.. .\n          LARRY's point-of-view: JUDY is visible from 3 behind. She sits\n          a few rows ahead looking\n          grimly up at the rabbi.\n          . and to his duty, as he saw it. Where does such a man\n          go? A tzadik-who knows, maybe even a lamid vovnik-a\n          man beloved by all, a man who despised the frivolous?\n          Could such a serious man... simply... disappear?\n          The words echo.\n          Again the rabbi gazes around, as if awaiting answer.\n\n          THEN:\n          . We speak of L'olam ha-ba, the World to Come. Not\n          heaven. Not what the gentiles think of as afterlife.\n          \"L'olam ha-ba.\" What is L'olam ha-ba? Where is L'olam\n          ha-ba? Well: it is not a geoaraphic place, certainly.\n          Like-Canada.\n          Murmured chuckles from the congregation.\n          Nor is it the eretz zavat chalav ood'vash-the land flowing\n          with milk and honey, for we are not promised a personal\n          reward, a gold star, a first-class VIP lounge where we get\n          milk and cookies to eternity!\n          More chuckles.\n          L'olam ha-ba... is in the bosom of Abraham. L'olam ba-\n          ba is in the soul of this community which nurtured Sy\n          Ableman and to which Sy Ableman now returns. That's\n          right, he returns. Because he still inspires us Ableman\n          returns. Because his memory instructs us Ableman\n          returns. Because his thoughts illuminate our days and ways\n          Sy Ableman returns. The frivolous man may vanish\n          without a ripple but Sy Ableman? Sy Ableman was a\n          serious man...\n\n          \n\n          \n\n          \n\n          \n\n          92\n          A sob echoes through the sanctuary.\n          LARRY looks at Judith, who stifles further sobs with a handkerchief.\n          . As you know, the mourner's kaddish does not mention\n          the dead. It praises Hashem; it praises what abides. And\n          Sy Ableman, whose spirit will continue to assist us in\n          tikkun olam, is with us even now, a serious man who would\n          say as we now say Yiskadal v'yiskadash sh'may rabah...\n          The congregation begins to chant along but it and Judith's weeping\n          are cut off by:\n\n          A HAND RAPPING AT A DOOR\n          The front door to the Gopnik home.\n          LARRY, still in his suit from shul and wearing a yarmulka, opens\n          the door. He recoils in\n          surprise edged with fear.\n          Reverse: two uniformed policemen.\n\n          COP 1\n          Arthur Gopnik?\n          LARRY is momentarily dumb. Inside the house we can see a corner\n          of a card table set up in\n          the living room with food laid out on it. SARAH sits with her\n          back to us, head wrapped by\n          a towel-turban. Arthur, on the far side of the table, his balding\n          head domed by a yarmul-\n          ka, half-leans out so that he may sneak looks toward the men\n          at the door without totally\n          revealing himself. From somewhere down the hall come Judith's\n          muffled sobs.\n          . Are you Arthur Gopnik?\n\n          LARRY\n          I'm... Laurence Gopnik.\n          Cop I\n          Do you go by the name Arthur Gopnik?\n\n          LARRY\n          No.\n\n          \n\n          \n\n          \n\n          \n\n          93\n\n          COP 1\n          Is that Arthur Gopnik?\n          Arthur ducks away.\n          From inside the living room:\n          DANNY (off)\n          Dad? What's going on?\n\n          LARRY\n          Can you tell me what's going on. We're sitting shiva here.\n\n          COP 1\n          You're what.\n\n          LARRY\n          A religious observance. We're... bereaved.\n          The cop standing behind gazes in over his partner's shoulder.\n\n          COP 2\n          Who died?\n\n          LARRY\n          My wife's um... it's a long story.\n\n          COP 1\n          Look. Tell Gopnik-you know, Arthur Gopnik-he's\n          breaking the law. We're not arresting him now but next\n          time we will. Gambling is against the law in this state.\n          That's just the way it is. All right. Go back to your...\n\n          COP 2\n          Sorry, sir.\n\n          LIVING ROOM\n          A minute later. The family-except for Judith, whose weeping continues\n          off-sits\n          around the card table. A long beat.\n          At length:\n\n          \n\n          \n\n          \n\n          \n\n          94\n\n          DANNY\n          Dad, we get Channel 4 now but not Channel 7.\n\n          LARRY\n          Arthur, how could you do that to this family. On Sy's...\n          on Sy's-\n\n          ARTHUR\n          It's a victimless crime.\n\n          LARRY\n          That doesn't make it right! And you-\n\n          DANNY\n          He won a lot of money, Dad! The Mentaculus really\n          works!\n          LARRY's gaze swings onto his son.\n\n          LARRY\n          You knew about it?!\n\n          DANNY\n          Well, um...\n\n          ARTHUR\n          They must have finked me out. They knew I could just\n          keep on winning, so a couple weeks ago they blackballed\n          me, and now they've-\n\n          LARRY\n          What did you do with the money you won?\n          Silence. Arthur sneaks a look at DANNY.\n          LARRY looks back and forth between them.\n          . What's going on?\n          Arthur shrugs.\n\n          ARTHUR\n\n          \n\n          \n\n          \n\n          \n\n          95\n          I didn't want it. DANNY said he could use it\n\n          SARAH\n          Unfair!\n\n          LARRY\n          What have you been-\n\n          ARTHUR\n          What's unfair is these guys saying I can't play in their card\n          game!\n\n          SARAH\n          Why give him the money?! You know what he spends it\n          on?\n\n          LARRY\n          (knowing nod)\n          I know about the records.\n\n          SARAH\n          Records?! You think he buys records from Mike Fagle?\n          Movement in DANNY's body; SARAH recoils from a kick.\n          . Ow! Little brat!\n\n          LARRY\n          Hey! What's going on!\n\n          DANNY\n          At least I'm not saving up for a nose job!\n\n          LARRY\n          What?!\n\n          SARAH\n          Brat!\n\n          LARRY\n          Nobody in this house is getting a nose job! You got that?!\n\n          \n\n          \n\n          \n\n          \n\n          96\n\n          DANNY\n          Ali!\n          Struck by a thought he leaps up and bolts from the room.\n\n          LARRY\n          DANNY! You weren't excused! We're still talking!\n\n          SARAH\n          What a brat.\n\n          LARRY\n          What was this card game, Arthur?\n\n          ARTHUR\n          Some goys run a private game.\n          We hear the TV go on down the hall and the theme from F Troop.\n          I think they're Italians.\n\n          LARRY\n          DANNY, what's going on!\n          He rises.\n\n          BEDROOM\n          LARRY enters to look down at DANNY's back. Beyond him F Troop\n          flickers on the TV.\n\n          LARRY\n          DANNY! We're sitting Shiva!\n\n          DON MILGRAM'S OFFICE\n          LARRY, sitting across from Don, has his head buried in his arms\n          on the desktop.\n\n          DON\n          She's retained Barney Silver at Tuchman, Marsh. This is a,\n          uh--this is an aggressive firm, LARRY.\n\n          \n\n          \n\n          \n\n          \n\n          97\n\n          LARRY\n\n          (MUFFLED)\n          Uh-huh.\n\n          DON\n          These are not pleasant people. Judith is free of course to\n          retain whoever she... I take it you don't talk to her?\n          LARRY raises his head, squinting against the light.\n\n          LARRY\n          It's hard. I think she emptied our bank account. I tried to\n          ask her about it, very civilly.\n\n          DON\n          Mm.\n\n          LARRY\n          She, uh...\n\n          DON\n          Yeah, yeah you better open an account in your name only,\n          put your paychecks in there from here on out. Til we know\n          where we stand.\n\n          LARRY\n          Can I?\n\n          DON\n          Oh, absolutely!\n\n          LARRY\n          That's not, um, dishonest?\n\n          DON\n          Oh, absolutely! You, uh-\n\n          LARRY\n          I hate to say this, but I think she's also been sneaking cash\n          out of my wallet.\n\n          DON\n          Ouch. Well, yes, this is definitely, um, adversarial. The\n\n          \n\n          \n\n          \n\n          \n\n          98\n          first thing we-are you all right?\n          LARRY is wincing as he rubs a forearm under his shirtsleeve.\n\n          LARRY\n          Just a sunburn. I've been spending a lot of time on the\n          roof. For... perspective.\n          He trails off and his head drops back down onto his arms. Don\n          gives him an appraising\n          look.\n\n          DON\n          . Have you seen the Rabbi?\n\n          LARRY\n          (muffled again)\n          Talked to Nachtner.\n\n          DON\n          You should talk to Minda.\n\n          LARRY\n           They told me Minda doesn't do pastoral work any more.\n          Just.. . ceremonial.\n\n          DON\n          Mm. Congratulates the bar mitzvah boy every week, so\n          forth?\n          LARRY nods miserably.\n          . That's too bad. A very wise man, Minda.\n          LARRY raises his head.\n\n          LARRY\n          Getting old.\n\n          DON\n          Very old.\n\n          LARRY\n          No, me.\n\n          \n\n          \n\n          \n\n          \n\n          99\n\n          DON\n          LARRY, you're fine. It's a bump in the road. Was Nachtner\n          helpful at all?\n          LARRY gives a helpless shrug.\n          Don rolls his eyes.\n          . What-did he tell you about the goy's teeth?\n          A knock on the door. Don projects:\n          Yeah?\n          The door cracks open. A pipe edges in, followed by a peeking\n          face: Solomon Schlutz.\n          . Oh, good! Sol, come on in.\n          Solomon Schlutz is a large man in shirtsleeves and suspenders.\n          He has the smooth\n          impassive face of a sphynx with a pipe clenched in its teeth.\n          He glides into the room, a sheaf of files tucked under one arm.\n          . Sol has been looking into the property-line issues.. .\n          Solomon Schlutz seats himself at the conference table and starts\n          sorting and arranging\n          the files into three piles.\n          . It seems that you do have a real problem with the\n          original survey. But Sol seems to think there's some kind\n          of nifty way for us to-well, I haven't heard it myself, I'll\n          let Sol map it out.\n          Solomon Schlutz continues to arrange the files, his eye occasionally\n          lingering on a\n          specific page. When at length he is finished he carefully justifies\n          the edges of the closest\n          pile, takes the pipe out of his mouth, gives LARRY a smile that\n          seems to take some effort,\n          and then taps the pipe in a large glass ashtray.\n          He looks up again at LARRY, this time shocked. His stunned look\n          on LARRY holds for a\n          long beat.\n          LARRY returns a bewildered look.\n\n          \n\n          \n\n          \n\n          \n\n          100\n          Solomon Schlutz, staring at LARRY as if he were some sort of\n          monster, emits one barking\n\n          SYLLABLE:\n          Solomon Schlutz\n          Gah!\n          His stare holds. He reddens.\n\n          DON\n          .Sol?\n          Solomon Schlutz's face now passes from the red end of the spectrum\n          to the purple.\n          Solomon Schlutz\n          Nnnnff!\n          The pipe clatters out of his hand. The hand grabs at his own\n          shirt front.\n          . Glufffl...\n          Now his head pitches back. His backflung weight and twisting\n          body send his chair\n          tipping over, one hand still clutching at his chest while the\n          other frantically waves. He\n          disappears behind the conference table and lands with a floor-shaking\n          thump. His\n          writhing and gurgling remain audible.\n\n          DON\n          Sol! Sol!\n          Don Milgram has risen to look down at his fallen colleague; now\n          he flings open the\n          conference room door and bellows into the office:\n          An ambulance! Quick! Somebody call an ambulance! A\n\n          DOCTOR!\n          A secretary looks in and screams.\n          Solomon Schlutz\n          Garf!... Nnlogl...\n\n          BLEGEN HALL\n\n          \n\n          \n\n          \n\n          \n\n          101\n          LARRY walks into the outer office clutching his briefcase, eyes\n          wide, shell-shocked. The\n          secretary is at her typewriter but holding the phone, one hand\n          covering its mouthpiece.\n\n          SECRETARY\n          Dick Dutton. Columbia Record Club.\n\n          LARRY\n          Call back.\n\n          HIS OFFICE\n          LARRY sits in heavily behind his desk.\n          A beat.\n          He opens the top left desk drawer. He withdraws the bulging white\n          envelope and opens\n          its flap.\n          He runs a finger over the wad of bills.\n\n          VOICE\n\n          LARRY?\n          He looks up, startled.\n          Arlen Finkle stands in the doorway.\n          . As you know, the tenure committee meets-are you all\n          right?\n          LARRY sits frozen with the white envelope in his hands.\n\n          LARRY\n          I'm... fine.\n          Arlen Finkle\n          I'm sorry. I know you've hit a rough patch.\n\n          LARRY\n          Thank you. I'm fine.\n          He puts the envelope in the desk drawer and closes it.\n\n          \n\n          \n\n          \n\n          \n\n          102\n          Arlen Finkle\n          Uh-huh. Well. As you know, the tenure committee meets\n          next Wednesday to make its final determinations. If\n\n          THERE'S-\n\n          LARRY\n          Arlen, I am not an evil man!\n          Arlen looks at him, shocked.\n          Arlen Finkle\n          LARRY! Of course not!\n\n          LARRY\n          I am not-\n          Arlen Finkle\n          We don't make moral judgments!\n\n          LARRY\n          I went to the Aster Art once. I saw Swedish Reverie.\n          Arlen Finkle\n          It's okay, LARRY, we don't need to know! The Tenure\n\n          COMMITTEE-\n\n          LARRY\n          It wasn't even erotic! Although it was, in a way.\n          Arlen Finkle\n          It's all right, LARRY. Believe me.\n          LARRY calms somewhat.\n\n          LARRY\n          . Okay.\n          Arlen Finkle\n          Okay. Okay. We, uh, we decide on Wednesday, so if\n          there's anything you want to submit in support of your\n          tenure application, we should have it by then. That's all.\n\n          LARRY\n\n          \n\n          \n\n          \n\n          \n\n          103\n          Submit. What. What do you-\n          Arlen Finkle\n          Well. Anything. Published work. Anything else you've\n          done outside of the institution. Any work that we might not\n          be aware of.\n\n          LARRY\n          I haven't done anything.\n          Arlen Finkle\n          Uh-huh.\n\n          LARRY\n          I haven't published.\n          Arlen Finkle\n          Uh-huh.\n\n          LARRY\n          Are you still getting those letters?\n          Arlen Finkle\n          Uh-huh.\n\n          LARRY\n          Those anonymous-\n          Arlen Finkle\n          Yes, I know. Yes.\n          A beat. LARRY nods.\n\n          LARRY\n          Okay. Okay. Wednesday.\n          Arlen Finkle\n          Okay. Don't worry. Doing nothing is not bad. Ipso facto.\n\n          LARRY\n          Sure.\n\n          \n\n          \n\n          \n\n          \n\n          104\n\n          CLASSROOM\n          We are close over LARRY's shoulder as he scribbles symbols onto\n          the chalkboard.\n\n          LARRY\n          . and that means... so that... from which we derive...\n          His glances back toward the class show that he is wearier, baggier-eyed,\n          more haggard\n          than ever. There is also something odd about his posture.\n          He writes smaller and smaller so as to finish before hitting\n          the right edge of the\n          chalkboard.\n          . and also.. which lets us... and...\n          Wider as he finishes and straightens up, revealing that he has\n          been stooping to write\n          across the very bottom of the board.\n          The equation covers every inch of the classroom-wide three-paneled\n          chalkboard. LARRY\n          is an off balance figure at the right edge of frame.\n          Reverse on the class: staring.\n          Okay?\n          LARRY claps chalk dust from his hands.\n          . The Uncertainty Principle. It proves we can't ever\n          really know... what's going on.\n          A bell sounds. The students start to shake off their stupor and\n          rise. LARRY projects over\n          the wallah:\n          . So it shouldn't bother you. Not being able to figure\n          anything out. Although you will be responsible for this on\n          the mid-term.\n          The thinning crowd gradually reveals one person still seated:\n          Sy Ableman.\n          He wears a prayer shawl and yarmulka.\n\n          \n\n          \n\n          \n\n          \n\n          105\n          LARRY does not seem surprised to see him.\n          . Did you follow that?\n          Sy Ableman\n          Of coss. Except that I know what's going on. How do you\n          explain.\n\n          LARRY\n          Well, it might be that, in, you know, in L'olam ha-bah-\n          Sy Ableman\n          Excuse me. Not the issue. In this world, LARRY.\n          He nods at the chalkboard.\n          . I'll concede that it's subtle. It's clevva. But at the end\n          of the day, is it convincing?\n\n          LARRY\n          Well-yes it's convincing. It's a proof. It's mathematics.\n          Sy Ableman\n          Excuse me, LARRY. Mathematics. Is the art of the possible.\n          LARRY's brow furrows.\n\n          LARRY\n          I don't think so. The art of the possible, that's... I can't\n          remember... something else...\n          Sy Ableman\n          I'm a serious man, LARRY.\n\n          LARRY\n          I know that. So if I've got it wrong, what do I-\n          Sy Ableman holds up one hand to silence him.\n          Sy Ableman\n          So simple, LARRY. See Minda.\n\n          \n\n          \n\n          \n\n          \n\n          106\n\n          LARRY\n          I know, I want to see Minda! I want to see Minda! They\n          told me that oonh!\n          Without our having seen him rise or cross the room Sy Ableman\n          has body-slammed\n          LARRY into the chalkboard. Now he grabs LARRY by the hair and\n          whips his head against\n          the equation. As he slams LARRY's head, again and again, the\n          chalkboard chatters and the\n          fringes on Sy's tallis dance.\n          Sy Ableman\n          See Minda! See Minda! I fucked your wife, LARRY! I\n          seriously fucked her! That's what's going on! See Minda!\n\n          LARRY\n          Very close on his eyes as they open. His head is on a pillow.\n          Dull early light. A hissing\n          sound.\n          LARRY looks blearily over.\n          On the vanity table just outside the motel bathroom door sits\n          Uncle Arthur's cyst\n          evacuator. Its waggling hose snakes into the cracked bathroom\n          door as the machine\n          hisses.\n\n          MEZUZA\n          On a doorpost.\n          A hand enters to knock. A long beat. The person knocking gives\n          up and his footsteps\n          start to go away just as the door opens to reveal an attractive\n          woman the sunbathing\n          neighbor, now wearing plaid shorts and a buttoned white blouse.\n          Her point-of-view: LARRY, frozen halfway down the stoop, head\n          turned back up toward\n          the door.\n\n          WOMAN\n          Mr. Gopnik.\n\n          \n\n          \n\n          \n\n          \n\n          107\n\n          LARRY\n          Oh. Hello, Mrs. Samsky. I knocked, and then thought you\n          weren't here. I, uh...\n          Mrs. Samsky's voice is soft and breathy:\n          Mrs. Samsky\n          It just took me a second to get to the door. I was out back.\n          LARRY stands nodding.\n          He seems to need prompting. Mrs. Samsky does:\n          . Can I help you? Wanna come in?\n\n          LARRY\n          No, I-\n          One hand on the door, she steps back.\n          Mrs. Samsky\n          It's cooler.\n\n          LARRY\n          Oh. Okay. I just wanted to let you know...\n          He is entering.\n\n          INSIDE\n          After the outside glare the house does indeed seem cooler. LARRY\n          looks around the living\n          room, dim but neat. Wavering light sifts through closed vertical\n          blinds which drift and\n          click over floor-vented air-conditioning.\n          Mrs. Samsky closes the door, shutting out all sound from outside.\n\n          LARRY\n          I've noticed that Mr. Samsky isn't around, and I-\n          Mrs. Samsky\n          He travels.\n\n          \n\n          \n\n          \n\n          \n\n          108\n\n          LARRY\n          Uh-huh. Yeah, I never seem to see him, so I thought I\n          should let you know, since you're somewhat new here, if\n          you ever have, whatever, chores that you'd, um, or just help\n          with something-I've decided to help others-you know,\n          in a neighborly way...\n          She gazes at him with the least hint of a smile and waits for\n          the speech to dribble away to\n          silence. In the ensuing beat, quiet except for the clicking of\n          the blinds, she is perfectly\n          still. Finally, only her mouth moves:\n          Mrs. Samsky\n          How thoughtful.\n          LARRY shrugs off the compliment.\n\n          LARRY\n          Oh it's nothing. It's just good to know your neighbors.\n          And to help. Help others. Although I don't care much for\n          my neighbors on the other side, I must say.\n          Mrs. Samsky lets another smiling silence pass before responding.\n          Mrs. Samsky\n          . Goys, aren't they?\n\n          LARRY\n          Mm. Very much so. Maybe it's not fair to judge; I have to\n          admit I-\n          Mrs. Samsky\n          Won't you sit down?\n\n          LARRY\n          Oh! Um. Okay. Thank you.\n          Mrs. Samsky\n          Iced tea? I have some.\n          She is already turning to the kitchen.\n\n          \n\n          \n\n          \n\n          \n\n          109\n\n          LARRY\n          Okay.. .\n          He watches her and reacts to:\n          The backs of her thighs. The flesh retains the broad cross-hatch\n          of her lawn chair.\n          She disappears into the kitchen, but calls out:\n          Mrs. Samsky\n          I don't see you around much, either.\n\n          LARRY\n          Yes. Actually I haven't been home a lot recently, I, uh, my\n          wife and I are, uh, well, she's got me staying at the Jolly\n          Roger, the little motel there on-\n          Mrs. Samsky is reentering with two tall glasses of iced tea beaded\n          with moisture. The\n          click of the ice cubes joins the clicking of the blinds.\n          Mrs. Samsky\n          You're in the doghouse, huh?\n          She hands him a glass as she sits on the couch next to him, not\n          invasively close, one bare\n          leg folded onto the couch, the other draped over it.\n\n          LARRY\n          Yeah, that's an understatement I guess, I -thank you-I,\n\n          UH-\n          Mrs. Samsky\n          Do you take advantage of the new freedoms?\n          LARRY stares at her. Mrs. Samsky gazes back. Her look displays\n          equanimity; his, not.\n\n          FINALLY:\n\n          LARRY\n          . What do you mean.\n          Her look holds for one more beat and then she swivels and opens\n          the drawer of an end\n          table.\n\n          \n\n          \n\n          \n\n          \n\n          110\n          She turns back with a joint.\n          Mrs. Samsky\n          It's something I do. For recreation.\n          She lights it.\n\n          LARRY\n          That's... Marijuana?\n          Mrs. Samsky\n          Mm-hmm.\n          She hands the joint over.\n          . You'll find you'll need the iced tea.\n          LARRY handles the bitty cigarette with trepidation.\n\n          LARRY\n          Is it. . well.. . okay...\n\n          THE VERTICAL BLINDS\n          Some minutes later. They drift and click in the air blown from\n          the floor vents.\n          LARRY stares at them.\n          After a long beat:\n\n          LARRY\n          Maybe Rabbi Scott was right.\n          Mrs. Samsky\n          Who's Rabbi Scott?\n\n          LARRY\n          The junior rabbi.\n          Mrs. Samsky\n          The junior rabbi.\n\n          \n\n          \n\n          \n\n          \n\n          111\n          Another long beat. Neither person feels compelled to speak as\n          the blinds click.\n          The joint makes another trip back and forth.\n\n          THEN:\n          . What did he say?\n\n          LARRY\n          He spoke of.. perception. All my problems are just...\n          just a... a mere..\n          He trails off, listening.\n          . Is that a siren?\n          Mrs. Samsky\n          No. Some people get a little paranoid when they... Holy\n          cow... That is a siren.\n\n          OUTSIDE\n          The Samsky's door opens and LARRY stumbles out. He stares.\n          The police car has stopped in front of his own house next door,\n          lights still flashing. Two\n          cops are going up the walk with Uncle Arthur between them in\n          handcuffs.\n          LARRY, stunned, walks woodenly toward his house.\n\n          LARRY\n          Hey!\n          Neither the cops nor Uncle Arthur has heard. They have rung the\n          doorbell and now\n          disappear inside.\n          LARRY projects louder-\n\n          . HEY!\n          -and starts to sprint. Mrs. Samsky has emerged from her house\n          behind.\n          LARRY takes the stoop steps two at a time. His door stands open\n          and the theme from F\n\n          \n\n          \n\n          \n\n          \n\n          112\n          Troop issues from within.\n          Just inside the two policeman stand with their backs to us and\n          handcuffed Uncle Arthur\n          in between. The three men face DANNY, who addresses them, projecting\n          over the music\n          from the TV.\n\n          DANNY\n          Sort of. He sleeps on the couch.\n\n          LARRY\n          This is crazy!\n          This brings the cops' look around. Uncle Arthur also turns, shamefaced,\n          to LARRY.\n\n          COP\n          Does this man live here?\n\n          ARTHUR\n          I didn't know what to tell them! They asked for my\n          address.. .\n\n          LARRY\n          It's just mathematics! You can't arrest a man for\n          mathematics!\n\n          ARTHUR\n          I didn't know whether to say I lived here or at the Jolly\n          Roger.\n\n          COP\n          You know this man?\n\n          ARTHUR\n          I figured this would sound more... I don't know...\n          Mrs. Samsky appears behind LARRY on the stoop.\n\n          DANNY\n          Dad, why is Uncle Arthur in handcuffs?\n\n          LARRY\n          It's all a mistake. I mean, not a mistake, a, a-\n\n          \n\n          \n\n          \n\n          \n\n          113\n\n          ARTHUR\n          Hello, Mrs. Samsky.\n\n          LARRY\n          -a miscarriage-\n\n          COP\n          Does this man live here?\n\n          DANNY\n          He sleeps on the couch.\n\n          LARRY\n          Look! What did he do!\n\n          ARTHUR\n          Nothing! I didn't do anything!\n\n          DANNY\n          It folds out. Dad sleeps on a cot.\n\n          LARRY\n          You can't just-\n\n          COP\n          Sir, we picked this man up at the North Dakota.\n          LARRY is brought up short.\n\n          LARRY\n          The North Dakota!\n\n          ARTHUR\n          But I didn't do anything!\n\n          DANNY\n          Dad, what's the North Dakota?\n\n          COP\n          Solicitation. Sodomy. Very serious.\n\n          \n\n          \n\n          \n\n          \n\n          114\n\n          LARRY\n          . The North Dakota!\n          We hold on LARRY's shocked reaction as we hear DANNY, off:\n\n          DANNY\n          What's Sodomy, Dad?\n\n          DON MILGRAM\n          He wears a black armband. He sits thinking, bouncing steepled\n          fingers against his nose.\n\n          FINALLY:\n\n          DON\n          What does Arthur say?\n\n          LARRY\n          He says he didn't do anything.\n\n          DON\n          Uh-huh.\n\n          LARRY\n          He says. . . he just went in for a drink.\n\n          DON\n          Uh-huh.\n          Long beat.\n          . Does Arthur drink?\n\n          LARRY\n          No.\n\n          DON\n          Uls-huh.\n\n          LARRY\n          . He says he was confused.\n\n          \n\n          \n\n          \n\n          \n\n          115\n\n          DON\n          Uh-huh. Uh-huh. Well. The North Dakota. Well. You'll\n          need a criminal attorney.\n\n          LARRY\n          Okay. Who's-\n\n          DON\n          Ron Meshbesher.\n\n          LARRY\n          Is he good?\n\n          DON\n          Ron is very good.\n          LARRY's gaze wanders. He becomes wistful.\n\n          LARRY\n          I don't understand. He goes to mixers at the Hillel House.\n\n          DON\n          Mm.\n          A beat.\n          . I would call Ron Meshbesher.\n\n          LARRY\n          Is he expensive?\n\n          DON\n          Ron is not cheap.\n          Don focuses on LARRY. Cheerful change of subject:\n          . DANNY's bar mitzvah is... ?\n\n          LARRY\n          This week.\n\n          \n\n          \n\n          \n\n          \n\n          116\n\n          DON\n          This shabbas! Great!\n          He nods.\n          . It'll be okay. Try to relax, LARRY. Try to relax.\n\n          MRS. SAMSKY'S BEDROOM\n          LARRY is making strenuous love to Mrs. Samsky.\n          Mrs. Samsky\n          So good... so good...\n          She rolls on top of LARRY to straddle him and, still humping,\n          she lights a mentholated\n          cigarette. LARRY moans.\n\n          LARRY\n          Oh my God, Mrs. Samsky...\n          Beyond her head LARRY can see the low cottage-cheese ceiling\n          of the bedroom. Outside\n          we can hear Gar Brandt mowing the lawn.\n          Suddenly we hear muffled laughter and the front door opening.\n          LARRY panics. He hisses:\n          . Who is it?\n          Footsteps are approaching along the hall. Mrs. Samsky doesn't\n          react; she looks calmly\n          down at LARRY even as the bedroom door opens behind her and CLIVE\n          Park walks in\n          wearing a traffic mask. LARRY is mortified:\n          CLIVE, please! Wait outside!\n          Mrs. Samsky blows smoke into LARRY's eyes. The screen goes black.\n          Close on LARRY as he opens his eyes. A shadow falls across his\n          face.\n          His point-of-view: a wooden plank is just being slid into place\n          over his head. The bang\n          of hammer on nailhead. In the black:\n\n          \n\n          \n\n          \n\n          \n\n          117\n          Sy Ableman's Voice\n          Nailing it down is so impawtant.\n          We hear the chanting of Kaddish and the sound of dirt hitting\n          the top of the coffin. It\n          drums a steady rhythm. Grace Slick's voice enters: \"Somebody\n          to Love.\" In a break in\n          the vocals right before the chorus:\n          Mrs. Samsky's Voice\n          It's something we do. For recreation.\n          On the chorus downbeat, a crescent moon pops into the black.\n          Gar Brandt traverses the\n          sky, pushing his lawn mower. A cow flies the opposite way. Stars\n          twinkle. Sy Able-\n          man walks across the sky dressed like a shtetl elder, a bindlestick\n          over one shoulder.\n          LARRY bolts upright in bed.\n          Sudden quiet.\n          Uncle Arthur is snoring in the tatty motel room's other bed.\n          A title burns in:\n\n          MINDA\n\n          LARRY\n          He stands looking down in low shot. Above him is cheap Johnson-Armstrong\n          dropped\n          ceiling.\n\n          LARRY\n          Please. I need help. I've already talked to the other rabbis.\n          Please.\n          Reverse shows an elderly eastern European woman seated behind\n          a desk, looking up at\n\n          LARRY.\n          . I won't take much of his time. I need help. I need\n          Minda. It's not about DANNY's bar mitzvah. My boy\n          DANNY. This coming shabbas. Very joyous event. That's\n          all fine. It's, it's more about myself, I've... I've had quite\n          a bit of tsuris lately. Marital problems. Professional. You\n          name it. This is not a frivolous request. This is a serious-\n          I'm a serious-I'm, uh, I've tried to be a serious man. You\n\n          \n\n          \n\n          \n\n          \n\n          118\n          know, tried to do right, be a member of the community,\n          raise the, raise the, DANNY, SARAH, they both go to school,\n          Hebrew school, a good breakfast. Well, DANNY goes to\n          Hebrew school, SARAH doesn't have time, she mostly...\n          washes her hair. Apparently there are several steps\n          involved. But you don't have to tell Minda that. Just tell\n          him I need help. Please. I need help.\n          He lapses into silence, staring at the secretary.\n          She stares inscrutably back.\n          After a moment she rises, goes to the door behind her, opens\n          it, shuffles into the dimness\n          of an inner office.\n          LARRY cranes to see past her. Her own body and the dimness interfere\n          with a good view\n          of the figure hunched behind the desk. The man is old and bent.\n          His desktop is empty.\n          Murmured voices in Hebrew.\n          A clock ticks in the outer office. LARRY looks around, waiting.\n          Mysterious Judaica adorns the outer office.\n          The old woman is shuffling back. She closes the door on the motionless\n          rabbi and sits\n          down, heavily, behind her own desk.\n\n          SECRETARY\n          The rabbi is busy.\n\n          LARRY\n          He didn't look busy!\n          As she starts shuffling papers:\n\n          SECRETARY\n          He's thinking.\n\n          NIGHT\n          Sidor Belarsky comes in at the cut.\n\n          \n\n          \n\n          \n\n          \n\n          119\n          We are booming down on LARRY, asleep in bed.\n          We hear weeping, soft, suppressed.\n          LARRY stirs. He opens his eyes.\n          After a groggy beat he reacts to the weeping. He looks over.\n\n          LARRY\n          Arthur... ? Arthur?\n          Arthur is a dim mound on the next bed. His weeping continues.\n          For no reason LARRY continues to keep his voice to a whisper:\n          . Arthur. What's wrong?\n          No answer.\n          . Arthur. It'll be okay. Arthur. We'll get Ron\n          Meshbesher. It'll be okay-\n\n          ARTHUR\n\n          AAAHHHH!\n          Shockingy loud, the scream is hard to interpret.\n          Arthur flings off his bedclothes. He leaps from the bed and runs\n          to the door. In boxer\n          shorts and undershirt he flings the door open and runs out of\n          the room.\n\n          LARRY\n          Arthur!\n          LARRY leaps from his bed, also in his underwear.\n          He goes to the door but pauses, peering cautiously outside. Satisfied\n          that the courtyard is\n          deserted, he plunges into it.\n\n          COURTYARD\n          The courtyard/parking lot is hardlit by ghastly mercury vapor\n          lights. The pool,\n          surrounded by chain-link fence, has been drained. Its white concrete\n          interior is cracked\n\n          \n\n          \n\n          \n\n          \n\n          120\n          and weedy.\n          Uncle Arthur is hunched weeping in a corner of the pool enclosure.\n\n          LARRY\n\n          (HISSING)\n          Arthur!\n          He opens the creaking gate and scurries over to Arthur.\n          . You've got to pull yourself together!\n          Arthur is suddenly angry. His voice bounces off the concrete:\n\n          ARTHUR\n          It's all shit, LARRY! It's all shit!\n\n          LARRY\n          Arthur. Don't use that word.\n\n          ARTHUR\n          It's all fucking shit!\n\n          LARRY\n          Arthur! Come on!\n\n          ARTHUR\n          Look at everything Hashem has given you! And what do I\n          get! I get fucking shit!\n\n          LARRY\n          Arthur. What do I have. I live at the Jolly Roger.\n\n          ARTHUR\n          You've got a family. You've got a job. Hashem hasn't\n          given me bupkes.\n\n          LARRY\n          It's not fair to blame Hashem, Arthur. Please. Sometimes\n          -please calm down-sometimes you have to help your-\n          self.\n\n          ARTHUR\n\n          \n\n          \n\n          \n\n          \n\n          121\n          Don't blame me! You fucker!\n\n          LARRY\n          Arthur. Please.\n\n          ARTHUR\n          Hashem hasn't given me shit. Now I can't even play cards.\n          He starts weeping again.\n          LARRY looks around.\n\n          LARRY\n          Arthur. This isn't the right forum. Please. Not by the\n          pool.\n          Arthur weeps.\n          Arthur... It's okay... It's okay...\n\n          MORNING\n          LARRY and Arthur are driving. We are looking at the two of them\n          square through a\n          windshield in which towering conifers stream by in reflection.\n          It seems to be a glorious\n          day.\n\n          LARRY\n          Is this it?\n          Both men peer out.\n\n          ARTHUR\n          I think so... yeah... there...\n          He indicates the road ahead.\n\n          A SIGNPOST\n          The old-fashioned kind with wooden fingers pointing the different\n          directions.\n          One points toward CANADA.\n\n          \n\n          \n\n          \n\n          \n\n          122\n          We tip off the sign as LARRY's car passes and recedes. There\n          is a canoe strapped to its\n          roof.\n\n          BOUNDARY WATERS\n          Beautiful, wooded, remote.\n          The car is parked at water's edge, having backed down a lane\n          of two tracks worn\n          through the undergrowth. LARRY and Arthur are lowering the canoe\n          into water.\n\n          LARRY\n          Okay.. .\n          He straightens. Arthur straightens. LARRY hugs him.\n          .Look...\n          They separate and LARRY pulls a white envelope from his pocket\n          and gives it to Arthur.\n          . This'll help you get back on your feet.\n          Arthur looks into the envelope.\n\n          ARTHUR\n          Oh my God. Where did you get this?\n\n          LARRY\n          Doesn't matter. When you-\n\n          ARTHUR\n          This is a lot of money!\n\n          LARRY\n          It should get you started.\n\n          ARTHUR\n          This is a lot of money! Are you sure you don't need it?\n\n          LARRY\n          Arthur, I'm fine. Come on, get in. When you're settled...\n\n          \n\n          \n\n          \n\n          \n\n          123\n          Arthur climbs into the canoe.\n          . let me know how to get in touch.\n          He helps push the boat off. Arthur is twisted around, looking\n          back. As he drifts off:\n\n          ARTHUR\n          Are you sure this is okay?\n\n          LARRY\n          It's fine. It's fine...\n          LARRY waves.\n          Arthur waves bravely back, then turns to pick up the oars. A\n          couple of strokes and he\n          turns back again with a last thought. He calls:\n\n          ARTHUR\n          LARRY. I'm sorry. What I said last night.\n\n          LARRY\n          I know. It's okay.\n          A lingering look from Arthur, and then he turns back to row.\n          A gunshot.\n          Blood spurts from the back of Uncle Arthur's neck.\n          He slumps forward, dead.\n\n          VOICE\n          Good shot!\n          LARRY looks wildly around. He sees:\n          Gar Brandt and Mitch in their camo fatigues, hard to pick out\n          in the foliage. They are\n          looking off toward the canoe, Mitch just lowering his rifle.\n          Gar Brandt's look swings around, into the lens. He points at\n          us:\n          There's another Jew, son.\n\n          \n\n          \n\n          \n\n          \n\n          124\n          Mitch swings his rifle toward us.\n          He fires.\n\n          LARRY\n          Gasping awake in the motel room.\n          He looks around.\n          It is dawn.\n          Arthur sits on the edge of his bed in his underwear, staring\n          off into space, slackjawed,\n          vacant-eyed, drained.\n          LARRY gazes around the room, waiting for things to fall into\n          place.\n          Finally, blearily:\n\n          LARRY\n          Were we... out at the pool last night?\n          Arthur, still staring off, responds in a flat, empty voice:\n\n          ARTHUR\n          Yes. I'm sorry.\n          LARRY blinks sleep away.\n          After a beat:\n\n          LARRY\n          It's shabbas.\n          Another beat.\n          Arthur heaves a deep sigh.\n\n          ARTHUR\n          I'll go drain my cyst.\n\n          \n\n          \n\n          \n\n          \n\n          125\n\n          RESTROOM\n          Day. A two-urinal, two-stall men's room of old tile and yellowed\n          fixtures.\n          We are low. One of the stall doors is closed. Under it we see\n          the dress shoes and dress\n          pants of two young men standing inside.\n          We hear a long sucking inhale.\n          Ronnie Nudell's Voice\n          Gimme that fucker.\n          A loudly projected echoing male voice:\n\n          VOICE\n          Ya'amod hab'rayshit.\n\n          SANCTUARY\n          DANNY, seated in the second pew next to his parents and sister\n          and Uncle Arthur, rises\n          and shuffles along the row to the aisle. His eyes are wide and\n          red-rimmed.\n          The prelapped voice was his call to the torah. All eyes in the\n          congregation, which fills\n          the large sanctuary, are on him.\n          In great echoing silence he walks to the steps on the right side\n          of the bema and climbs.\n          The right-side lectern is surrounded by a gaggle of old Jewish\n          men. They busy\n          themselves with the preparation of the pair of scrolls on the\n          lectern, rolling them,\n          pausing, rolling some more, muttering prayers, kissing the scrolls\n          by means of their\n          tsitsim. They pay DANNY no attention.\n          DANNY takes his place centered behind the lectern. His chin comes\n          up to the bottom of\n          the reading platform.\n          Men continue to mutter prayers around him. A pair of hands appear\n          on his shoulders\n          from behind. DANNY looks down at the strange hands. They pull\n          him back.\n          A foot drags a small riser out from under the lectern.\n          Hands push DANNY up onto the riser.\n\n          \n\n          \n\n          \n\n          \n\n          126\n          Booming up on the torah scrolls, still being busily rolled.\n          Beyond it, a sea of faces.\n          The yad-a molded tin pointer-is thrust into DANNY's hand. The\n          non-pointing end has\n          a red silken tassel.\n          DANNY looks at the bouncing tassel. He looks at the little pointing\n          finger which is the\n          business end of the yad.\n          Men mutter around him, each a different prayer. They dip and\n          doven.\n          DANNY watches himself point the yad down at the scroll.\n          The scroll is a dense swarm of Hebrew letters. DANNY squints.\n          One voice separates from the murmurs around him. It chants, insistently,\n          in a sotto-voce\n\n          FALSETTO:\n\n          VOICE\n          Nefesh echad sheichayim, yitzeh gamor shel effashot...\n          DANNY is still staring at the end of the yad against the parchment\n          scroll.\n          Someone's hand enters and moves the yad to a different place\n          in the text.\n          The voice repeats:\n          . Nefesh echad sheichayim, yitzeh gamor shel effashot...\n          DANNY looks up from the scrolls.\n          In the congregation Ronnie Nudell sits hunched-shouldered and\n          squished between his\n          parents. He returns DANNY's red-rimmed slack-jawed stare.\n          The insistent voice:\n          . Nefesh echad shelchayim, yitzeh gamor shel effashot...\n          DANNY looks over.\n          From the surrounding scrum the prompter nods at him. He looks\n          somewhat like Cantor\n          Youssele Rosenblatt.\n\n          \n\n          \n\n          \n\n          \n\n          127\n          . Nefesh echad shelchayim, yitzeh gamor shel effashot.. .\n          DANNY looks back down at the scroll. A hand enters to tap a pointing\n          finger where the\n          yad points.\n          . Nefesh echad shelchayim, yitzeh gamor shel effa-\n          DANNY suddenly erupts:\n\n          DANNY\n          Nefesh echad shelchayim, yitzeh gamor shel effashot. .\n\n          PROMPTER\n          Mm-hm.\n          DANNY continues to boom out the torah portion. He moves the yad\n          along the line of\n          letters.\n          In the congregation, LARRY and Judith watch. We hear DANNY chanting\n          fluently and\n          LARRY squeezes the hand Judith has laced through his arm.\n          Juith whispers:\n\n          JUDITH\n          I'm sorry that... things have been so hard for us...\n\n          LARRY\n          It's okay.\n\n          JUDITH\n          Sy had so much respect for you, LARRY.\n          He pats her hand.\n          A beat.\n          . He wrote letters to the tenure committee.\n\n          LATER\n          The congregation is loudly singing V'Zos Hatorah. A tallised\n          man of late middle age\n\n          \n\n          \n\n          \n\n          \n\n          128\n          hoists the open scroll from the lectern and raises it high, turning\n          his back on the\n          congregation so that all may see it.\n          DANNY has been ensconced in a highbacked chair upstage on the\n          bema.\n          His point-of-view of the man holding the torah is close and steeply\n          raked. The man is\n          sweating. The heavy scrolls vibrate slightly from his effort\n          to keep them aloft. As the\n          congregation continues to sing he mutters under his breath:\n\n          MAN\n          Jesus Christ.. .\n\n          LATER\n          DANNY stands behind the left lectern facing Rabbi Nachtner who\n          holds a small kiddush\n          cup out to him.\n          Although Rabbi Nachtner seems to be addressing DANNY, he is projecting\n          loudly.\n\n          NACHTNER\n          . taking your place as a member of our tribe. You will\n          go and see Rabbi Minda after the service. You will cele-\n          brate in a reception downstairs in Schanfield Hall. And\n          then you will be a member of B'Nai Abraham and of the\n          Nation of Israel. DANNY Gopnik, the Sisterhood makes a\n          gift to you of this kiddush cup so that you will remember\n          this blessed day on the next shabbas and the next, and on\n          every shabbas of a long and fruitful life, and, until that\n          wonderful day when you stand under the chupa, we say.. .\n\n          CONGREGATION\n          Amen.\n          DANNY, still red-eyed, tries to focus.\n          His point-of-view shows the kiddush cup large in the foreground,\n          extended toward him\n          by the Rabbi beaming above.\n          His own hand rises into frame to grasp the kiddush cup.\n          The congregation starts Adon Olam.\n\n          \n\n          \n\n          \n\n          \n\n          129\n\n          A DOOR\n          Creaking open. The cut has snapped off the robust Adon Olam,\n          leaving sepulchral quiet.\n          DANNY, clutching his kiddush cup, hesitantly enters the dim study.\n          Minda's elderly\n          eastern European gatekeeper closes the door behind him.\n          Minda is an old man staring at him from behind a bare desktop.\n          His look, eyes\n          magnified by thick glasses, is impossible to read.\n          DANNY creeps to the chair facing the desk. He gingerly sits on\n          the squeaking leather\n          upholstery, self-conscious under Minda's stare.\n          Minda breathes regularly through his mouth. It is the only sound\n          in the room.\n          A long beat. The two sit face to face.\n          Minda smacks his lips a couple of times, preparing to speak.\n          Another beat.\n\n          FINALLY:\n\n          MINDA\n          When the truth is found. To be lies.\n          He pauses. He clears his throat.\n          At length:\n          . And all the hope. Within you dies.\n          Another beat. DANNY waits. Minda stares.\n          He smacks his lips again.\n          . Then what?\n          DANNY doesn't answer. It is unclear whether the question was\n          directed at him.\n          Quiet.\n\n          \n\n          \n\n          \n\n          \n\n          130\n          Minda clears his throat with a loud and thorough hawking.\n          The hawking abates. Minda sniffs.\n          . Grace Slick. Marty Balin. Paul Kanta. Jorma...\n          somethin. These are the membas of the Airplane.\n          He nods a couple of times.\n          . Interesting.\n          He reaches up and slowly opens his desk drawer. He takes something\n          out. He lays it on\n          the bare desk and pushes it partway across.\n          . Here.\n          It is DANNY's radio.\n          . Be a good boy.\n\n          LARRY'S OFFICE\n          LARRY is at his desk sorting through mail.\n          Arlen Finkle (off\n          DANNY was magnificent.\n          LARRY looks up: Arlen is leaning in his accustomed spot in the\n          office doorway.\n\n          LARRY\n          Oh. Thank you, Arlen.\n          Arlen Finkle\n          Mazel tov. It was wonderful.\n\n          LARRY\n          Yes it was. Thank you.\n          Arlen Finkle\n          Such a time of nachas, LARRY. He's your youngest. You\n          have to savor it.\n\n          \n\n          \n\n          \n\n          \n\n          131\n\n          LARRY\n          I do. I will.\n          Arlen Finkle\n          See you at the staff caf.\n\n          LARRY\n          Yes.\n          Arlen shoves off to go, but hesitates.\n          Arlen Finkle\n          I just... I shouldn't tell you. I'm not telling you officially.\n          The tenure candidates aren't notified til Monday.\n\n          LARRY\n          . Yes?\n          Arlen nods.\n          Arlen Finkle\n          You'll be very pleased.\n          LARRY stares at him.\n\n          LARRY\n          Thank you, Arlen.\n          Over his back as he goes:\n          Arlen Finkle\n          I didn't say anything. Mazel tov.\n\n          HEBREW SCHOOL CORRIDOR\n          Distant thunder at the cut.\n          We are tracking behind Minda's female Caliban as she walks down\n          the hall, stooped and\n          shuffling. She holds a stack of papers in one hand.\n\n          LARRY'S OFFICE\n\n          \n\n          \n\n          \n\n          \n\n          132\n          Mail in front of him.\n          He opens an envelope from RONALD MESHBESHER, ESQ.\n          In it are two pieces of paper. Topmost is a letter headed RETAINER\n          AGREEMENT.\n          Underneath is an invoice. The amount: $3,000.\n          Arriving rain begins to patter at the window.\n\n          HEBREW SCHOOL CLASS\n          The TEACHER, Mar King, leads the class in drill.\n          DANNY has a book tilted towards him on his desktop. It hides\n          his radio.\n          The door opens and the elderly woman shuffles to Mar King's desk.\n          She hands him a\n          paper from off her stack of copies.\n          Mar King puts on reading glasses and inspects it. As he reads\n          thunder crashes, closer.\n\n          LARRY'S OFFICE\n          He fingers the invoice.\n          Close on a printed detail: PAYABLE: and, typed underneath: Upon\n          Receipt.\n          Wind is whipping rain hard against the window.\n\n          HEBREW SCHOOL CLASS\n          Mar King taps on the desktop for attention.\n          Mar King\n          Chaverim, there's a tornado warning from the weather\n          service. Rabbi Minda has decided to move us over to the\n          basement of the shul.\n          Hubbub in the classrooom.\n\n          \n\n          \n\n          \n\n          \n\n          133\n          . Shechet. Shechet. We're gonna form two lines. This is\n          orderly. Hakol b'seder.\n\n          LARRY'S OFFICE\n          He is staring down at his desktop.\n          Thunder.\n          He reaches up and scratches his nose as he stares at his desk.\n          On the desk: a ledger sheet with a list of students' names. Next\n          to each name, a grade.\n          LARRY drums his fingers.\n          He picks up a pencil.\n          He goes down to PARK, CLIVE. Next to it is an F.\n          He waggles the pencil, eraser-end thumping the sheet.\n          He erases the F. He enters a C.\n          The pencil leaves frame. We hold for a beat on the new grade.\n          The hand reenters. It puts a minus sign after the C.\n          The hand withdraws.\n          LARRY closes the file. Just as he does so:\n          The phone jangles, very harsh.\n          LARRY looks at it, frozen.\n          He lets it ring a couple times.\n          He reaches for it. He slowly picks it up.\n\n          \n\n          \n\n          \n\n          \n\n          134\n\n          LARRY\n          . Hello?\n\n          VOICE\n\n          LARRY?\n\n          LARRY\n          . Yes?\n\n          VOICE\n          Hi, Len Shapiro.\n\n          LARRY\n          Oh. Hello Dr. Shapiro.\n          Dr. Shapiro\n          Listen, mazel tov on DANNY.\n\n          LARRY\n          Yes, thank you.\n          Dr. Shapiro\n          Listen, could you come in to discuss these X-ray results?\n          LARRY sits frozen, phone to his ear.\n          . Hello?\n\n          LARRY\n          Yes?\n          Dr. Shapiro\n          LARRY, could you come in and discuss these X-ray results?\n          Remember the X-rays we took?\n\n          LARRY\n          . We can't discuss them on the phone?\n          Thunder. Pattering rain.\n\n          \n\n          \n\n          \n\n          \n\n          135\n          Dr. Shapiro\n          I think we'd be more comfortable in person. Can you come\n          in?\n          A beat.\n\n          LARRY\n          When?\n          Dr. Shapiro\n          Now. Now is good. I've cleared some time now.\n\n          TALMUD TORAH PARKING LOT\n          The students mill about. It is overcast dark, and extremely windy.\n          Someone is fumbling with keys at the shul.\n          DANNY still has his radio with the earpiece in.\n          Everyone's clothing flaps.\n          Ronnie Nudell shouts above the wind:\n          Ronnie Nudell\n          That fucking flag is gonna rip right off the flagpole!\n\n          CAR\n          We are looking through a windshield lashed by rain at LARRY,\n          driving. His hands are\n          clenched tight on the wheel. Wipers pump to keep up with the\n          rain. The cars behind\n          have their lights on. It has gotten quite dark.\n          Passing streetlights rhythmically sweep LARRY's face, their light\n          stippled and bent by the\n          rain on the windows.\n\n          TALMUD TORAH PARKING LOT\n          DANNY is looking across the lot in which orange school busses\n          are parked. His head bobs\n          in time to the music. His hair whips in the wind. A building\n          roar, very deep.\n\n          \n\n          \n\n          \n\n          \n\n          136\n          We hear, very compressed, the beginning of \"Somebody to Love.\"\n          DANNY sees a shaggy-haired youth among the milling students.\n\n          DANNY\n          Hey! Fagle!\n          From behind DANNY, over his shoulder: we see a funnel cloud in\n          the middle distance.\n          A growing rumble. The tornado is approaching.\n          At the first downbeat of its chorus the Jefferson Airplane song\n          bumps up full.\n\n          We cut to black, and credits.\n\n\n\n                                    THE END\n\n\n\n\n\n\n\nA Serious Man\nWriters :   Joel Coen  Ethan Coen\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:18:41.162429"}