{"title": "Above the Law", "film_link": "/Movie Scripts/Above the Law Script.html", "script_link": "/scripts/Above-the-Law.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Above the Law Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Above the Law Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Steven Pressfield\" title=\"Scripts by Steven Pressfield\">Steven Pressfield</a><br/>  <a href=\"/writer.php?w=Ronald Shusett\" title=\"Scripts by Ronald Shusett\">Ronald Shusett</a><br/>  <a href=\"/writer.php?w=Andrew Davis\" title=\"Scripts by Andrew Davis\">Andrew Davis</a><br/>  <a href=\"/writer.php?w=Steven Seagal\" title=\"Scripts by Steven Seagal\">Steven Seagal</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/><br/>\n<b>Script Date</b> : April 1987<br/>\n<br/>\n<a href=\"/scripts/Above-the-Law.html\">Read \"Above the Law\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>                                        Rev. 04/29/87 (Blue)\n\n\n\n\n<b>                      ABOVE THE LAW\n</b>\n\n\n\n                      Screenplay by\n\n           STEVEN PRESSFIELD and RONALD SHUSETT\n\n                     and ANDREW DAVIS\n\n\n                            Story by\n\n              ANDREW DAVIS and STEVEN SEAGAL\n\n\n\n\n<b>                                        FINAL DRAFT\n</b>\n                                        March 27, 1987\n<b>WARNER BROS. INC.                       © 1987\n</b>4000 Warner Boulevard                   WARNER BROS. INC.\nBurbank, California 91522               All Rights Reserved\n<b>\n</b><b>                          ABOVE THE LAW\n</b>\n<b>    FADE IN:\n</b><b>1   TITLES SEQUENCE - MONTAGE WITH SCORE\n</b>\n    PHOTOGRAPHIC STILLS show us NICOLA TOSCANI as a city boy in\n    various growing-up SHOTS, circa 1950's -- with street chums\n    wearing a Wyatt Earp T-shirt, in a communion suit. Then:\n    in his first qi, a youngster studying the martial arts; he\n    grows, we see news clippings of him winning trophies, his\n    name on contest posters, SHOTS of him in action. Then:\n    Japan. Nico now in his teens, studying with real masters,\n    being dumped on his butt, posing smiling beside Japanese\n    martial artists, then himself as an instructor. Now: a\n    few military uniforms enter the picture, we see security\n    clearance documents with Nico's picture and name on them.\n    Then Nico near draft age with an American friend NELSON\n    FOX on some kind of training base. TITLES END.\n\n<b>                                              DISSOLVE TO:\n</b><b>2   EXT. JUNGLE - DAY\n</b>    Blowing through the roof of a dense jungle straight AT\n    CAMERA, HELICOPTER ROTORS RISE to a DEAFENING PITCH.\n    SUPER:  Viet - Cambodian Border, 1972. Jungle foliage\n    whips in the fierce downdraft as --\n<b>3   \"HUEY\" GUNSHIP\n</b>    with US Army markings becomes discernible. The chopper\n    lowers toward a crude landing zone hacked out of the\n    wilderness. We GLIMPSE Cambodian troops and several\n    machine gun positions around the LZ.\n<b>4   EXT. JUNGLE - TWO ARMED AMERICANS - DAY\n</b>    watch from the edge of the landing zone. We recognize Nico\n    and Fox, now in their twenties, dressed in the nonmilitary\n    jungle attire that usually marks a CIA \"spook.\"\n\n<b>5   HELICOPTER\n</b>    touches down. THREE OLDER AMERICANS -- rough-looking, in\n    their mid-thirties, all carrying some kind of medical bags\n    -- disembark into the HOWLING ROTOR BLAST. They hit the\n    ground nimbly, as if they've done it many times before.\n\n<b>6   LEADER OF THREE\n</b>\n    wears a khaki cowboy hat and packs a pearl-handled .45.\n<b>7   NICO AND FOX\n</b>\n    don't know whether to react with laughter or uneasiness.\n<b>\n</b><b>                                                             2.\n</b>\n<b>                                FOX\n</b>                  You ever see chemical interrogation\n                  before?\n\n     Nico's eyes stay on the approaching \"cowboy,\" KURT ZAGON,\n     for whom he plainly feels an instant animosity.\n<b>                                NICO\n</b>                  These assholes are agency?\n\n<b>8    NICO'S POV\n</b>     FOLLOWS the medical bag in the cowboy's hand.\n\n<b>9    BACK TO FOX AND NICO\n</b><b>                                FOX\n</b>                  We're all C.I.A. But these guys are\n                  from a page that ain't on the map.\n<b>10   EXT. JUNGLE - LATE AFTERNOON\n</b>     Nico in the point,   leading Fox and the three CIT (Chemical\n     Interrogation Team)   men down an unmarked, twisting trail.\n     We see from Nico's   gait that he is athletic, a born leader\n     and totally at home   in the jungle.\n<b>11   TRAIL - LATE AFTERNOON\n</b>     snakes along a ridge line, high enough to give us a view and\n     let us know these guys are way out in the boonies.\n<b>                                ZAGON\n</b>                  How long till we're across the border?\n<b>                                NICO\n</b>                  We've been over for the past hour.\n     The group continues along the ridge.\n\n<b>                                                   CUT TO:\n</b><b>12   EXT. JUNGLE - NIGHT\n</b>\n     The sky glows from nearby bomb attacks.\n<b>13   NICO\n</b>\n     listening hard -- and even sniffing the air -- glances back\n     at Zagon, who stands impatiently, drawing on a cigarette.\n<b>                                ZAGON\n</b>                  What are you looking at, hotshot?\n\n<b>                                NICO\n</b>                         (indicates cigarette\n                          glow)\n                  Why don't you light a bonfire?\n<b>\n</b><b>                                                         3.\n</b>\n     Irritably, Zagon ditches his smoke.\n<b>                             ZAGON\n</b>               Just drive the taxi, ace.\n\n     As the party moves out, Fox flashes Nico a look as if to say,\n     \"Don't fuck with these guys.\"\n\n<b>14   EXT. CAMBODIAN BASE CAMP - NIGHT\n</b>\n     A pocket-fortified position. Armed Cambodian lookouts,\n     several hooches, radio equipment. Nico leads the party in\n     through the perimeter. Zagon eyes the layout like he's seen\n     100 of them. Fox indicates a hooch.\n<b>                             FOX\n</b>                      (to Zagon)\n               They're in there.\n\n     The three CIT men start for the hooch. Nico casts a concerned\n     glance around at the base camp troops, looking sloppy as hell.\n<b>                             NICO\n</b>               I don't trust these yo-yo's.\n<b>15   FULL SHOT - BASE CAMP\n</b>     We see Nico moving like a shadow from one defensive position\n     to another, checking the perimeter. We can vaguely hear him\n     ROUSTING the Cambodian lookouts, speaking in dialect.\n\n<b>16   DEFENSIVE POSITION - NICO\n</b>     hears a SOUND, looks back toward the hooch.\n<b>17   NICO'S POV - HOOCH\n</b>     Two Asian prisoners, stripped to the waist, babbling in-\n     coherently, are dragged out the back by a pair of Cambodian\n     guards and hustled off into the darkness. VOICES can be\n     heard inside the hooch. A single lantern glowing inside\n     gives the hut a creepy, frightening aspect.\n\n<b>18   BACK TO NICO\n</b>     He's extremely uneasy about what's about to happen inside the\n     hooch.\n\n<b>19   INT. HOOCH - CLOSE ON RICKETY CARD TABLE - NIGHT\n</b>     on which are spread a terrifying array of syringes, drug vials\n     and surgical instruments. Zagon's hand picks up a hypodermic,\n     squirt-tests it.\n<b>\n</b><b>                                                          4.\n</b>\n<b>20   TWO ASIAN PRISONERS\n</b>     are on their knees, shirtless, handcuffed with heavy nylon\n     tape to a stake driven into the ground in the center of the\n     hooch. One of the subordinate CIT men moves in, grabs the\n     first prisoner by the shoulders. Zagon injects the first\n     prisoner. Instantly the man begins shivering, convulsing.\n     Zagon watches with professional satisfaction.\n\n<b>                               ZAGON\n</b>                 That's the nice thing about modern\n                 technology. You don't have to wait\n                 for results.\n\n     He moves close to the first prisoner.\n<b>                               ZAGON\n</b>                        (to first prisoner)\n                 Where is it, Charley? You got six tons\n                 of our shit --\n     The prisoner tries to speak, but he's in such torment all\n     that comes out is a blood-curdling wail --\n<b>21   EXT. BAST CAMP - NICO\n</b>\n     hears this horrifying cry.   He starts swiftly toward the\n     hooch --\n<b>22   INT. HOOCH - INTERPRETER\n</b>\n     has moved as close to Zagon and the first prisoner as a fight\n     referee to two boxers. The prisoner is convulsing wildly.\n     Zagon grabs him fiercely by the hair.\n<b>                               ZAGON\n</b>                 Don't you die on me, fucker --\n<b>                               FOX\n</b>                        (from the side)\n                 What the hell's wrong?\n<b>                               ZAGON\n</b>                        (throws the prisoner\n                         down)\n                 This pussy can't hold his liquor.\n\n     The first prisoner is plainly in a death spasm.\n\n<b>23   NICO\n</b>     enters at this point. He takes in the scene quickly, moves\n     to a spot beside the entrance. Zagon doesn't look at Nico,\n     but it's plain he is aware of Nico's presence. It is as if\n     he wants to prove something to this muscular kid -- and prove\n     it to the others, too.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                         5.\n\n<b>24   FIRST PRISONER\n</b>     dies in agony on the ground.\n\n<b>25   SECOND PRISONER\n</b>     watches with eyes like flint. He is in his mid-forties,\n     scarred, missing several fingers. Probably a colonel or\n     higher, he looks like he's been fighting these round-eyes\n     since the French in the 50's. He is plainly one tough\n     customer. The second prisoner meets Zagon's eyes, as if\n     daring him to use the drugs on him, too. Zagon eyes the\n     prisoner with barely contained hatred. The prisoner doesn't\n     back down an inch.\n<b>                             ZAGON\n</b>                      (to second prisoner)\n               So my little doctor bag doesn't                      *\n               scare you, eh? Well I don't need                     *\n               it to open your yap.                                 *\n     Zagon reaches to a scabbard on his Western belt, pulls out a\n     fearsome serrated blade -- a cross between a bowie knife and\n     a scalpel. He steps toward the prisoner, displaying the\n     blade in the lantern light.\n\n<b>26   NICO\n</b>     watches impassively.\n<b>                             ZAGON (O.S.)\n</b>                      (to prisoner)\n               Where's our load, you sack of slime?\n               What did you do with my shit? --\n<b>27   ZAGON\n</b>     punches  the prisoner full in the face, holding the knife\n     handle  in his fist to double the force of the blow and to\n     terrify  him with the proximity of the blade. The prisoner\n     crashes  sideways, face bloody --\n<b>                             ZAGON\n</b>               I'm gonna teach you good. I'm gonna\n               teach you never to fuck with my\n               opium --\n\n<b>28   FOX AND TWO CIT MEN\n</b>\n     seem to know exactly what this is about.\n<b>29   NICO\n</b>\n     didn't know, but the new kid on the block is catching on fast.\n     Nico has difficulty containing his emotion. Zagon stands\n     over the prisoner, as if daring him to get back up.\n<b>\n</b><b>                                                    6.\n</b>\nThe prisoner gets back to his knees, bloody eyes meeting\nZagon's with defiance --\n\n<b>                       ZAGON\n</b>                (to prisoner)\n         You're a hard nigger, aren't you, boy?\n         You took it from the Chinks... you took\n         it from the French. You'll be fucked\n         if some Yankee peckerwood's gonna start\n         your gums flapping --\nNico watches Zagon move the knife blade closer to the\nprisoner.\n\n<b>                       ZAGON\n</b>         -- Well, you're gonna chirp for me,\n         tough guy. You're gonna sing like a\n         choir --\n\nNico takes a step toward Zagon.\n<b>                       NICO\n</b>         What the fuck does this have to do\n         with military intelligence?\n<b>                       ZAGON\n</b>         Your orders are 'assist and observe'\n         cherry --\nZagon turns to face Nico --\n\n<b>                       FOX\n</b>                (to Nico)\n         Back off, partner --\nZagon turns from Nico. He moves close to the second prisoner,\nclose as a lover, displaying the blade in the lamplight.\n<b>                       ZAGON\n</b>                (to second prisoner)\n         I'm gonna start carving at your ankles.\n         We'll throw your feet in that box right\n         over there. Then I'm gonna take off\n         your arms --\nOne of the CIT men yanks the prisoner's leg forward, clamping\nit to the ground with his hands. The prisoner still hasn't\nflinched. He seems as locked into this dance of death as\nZagon.\n<b>                         NICO\n</b>                  (can't take\n                   much more)\n         Fox --\n<b>                       FOX\n</b>         Shut up, Nico.\n<b>\n</b><b>                                                         7.\n</b>\n<b>                             ZAGON\n</b>               You can disappear as easy as this\n               slope, kid --\n\n     Zagon starts for the prisoner. Here comes the blade.\n     Suddenly -- Nico grabs Zagon's shoulder. Zagon spins with\n     terrifying quickness, cocking the blade to slash at Nico.\n     Before Zagon's blow even starts, Nico slams him with a\n     ferocious elbow shot right under the jaw. Zagon literally\n     comes off the ground, Nico's blow is so terrific. Zagon drops\n     in an unconscious heap. In a flash the two other CIT men\n     move to jump Nico. Smash! The second CIT man is swallowing\n     his teeth. Fox leaps in the way of the third, shoves Nico\n     out of the hooch --\n<b>30   EXT. HOOCH - NIGHT\n</b>\n     Fox wrestles Nico away from the hooch --\n\n<b>                             FOX\n</b>               Are you crazy?!!\n                      (as Nico jerks free)\n               What the fuck's the matter with you?!!!\n     Nico is shaking with rage and fear. He takes several steps\n     away from the hooch, then draws up abruptly. Nico pulls his\n     .45 from his holster, pops the safety, starts back for the\n     hooch --\n<b>                            FOX\n</b>               Nico!\n<b>                             NICO\n</b>               I don't cap him now, he's gonna do me\n               later.\n\n     The last CIT man appears, gun drawn, in the hooch doorway.\n     Fox grabs Nico, hauls him back again --\n\n<b>                             FOX\n</b>               I'll cover this. Get back to the\n<b>               L.Z. --\n</b>                      (as Nico resists)\n               -- I'll fix it! Get out! Get the\n               fuck outa here!\n     The CIT man calls out to the Cambodian troops, in dialect,\n     pointing at Nico. The soldiers start toward Nico, as if to\n     seize him. Fox, too, starts yelling to the troops in dialect,\n     apparently countermanding the orders of the CIT men. The\n     troops, confused, hold up for a moment.\n\n<b>                             FOX\n</b>                      (to Nico)\n               I'll call for a chopper... get outa\n               here!\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                        8.\n\n     Nico gives a last look, turns and takes off down the jungle\n     trail. Fox seems abandoned. The DISTANT BOMBING CONTINUES.\n     Nico disappears into the darkness.\n\n<b>                                                FADE TO BLACK.\n</b><b>     FADE IN ON:\n</b>\n<b>31   CHURCH STEEPLE - DAY\n</b>\n     TILT DOWN to reveal St. Elizabeth's, a huge parish church in\n     an Italian/Latino neighborhood in Chicago. The church looks\n     festive, we see a few formally-dressed people hurrying in,\n     then a squad car pulls up. The cops run upstairs as if\n     they're late --\n<b>32   INT. ST. MARY'S - DAY\n</b>\n     A baptism in progress. Nico -- 15 years older than when we\n     last saw him, is standing beside SARA, his lovely wife        *\n     -- watching a 60-ish priest, FATHER GENARRO, finish the\n     final ritual on Nico's infant son Julian. The priest\n     straightens the baby's baptismal garment, tugging the cloth\n     around the little fellow's crotch. Smiles from friends and\n     relatives clustered proudly around. Several cops, some in\n     uniform are amongst them. Nico grabs his son from Genarro\n     with a theatrical protective motion, tugs up the little boy's\n     garment, kisses him smack on the bare butt. Laughter from\n     all as Nico holds the lad high and proud. He puts his arm\n     around Sara.                                                  *\n\n<b>33   EXT. NICO'S HOUSE - BACK YARD - DAY\n</b>     Huge trays of Italian delicacies are carried out into the\n     sunlight by several \"old country\"-type women. Wine is\n     poured from generous carafes. Friends and relatives are\n     everywhere, laughing and enjoying themselves; apparently\n     the party has come here straight from the church. Presents\n     for the new baby are being opened by Nico's wife, Sara,        *\n     and Nico's mother, ROSA.\n<b>                             SARA                                   *\n</b>               Mama, look at this -- all done by hand.\n\n     Sara lifts a cute baby outfit.                                 *\n<b>                             ROSA\n</b>               Nico had one just like this.   Thank\n               you, Cora.\n     Cora, an aunt, proudly smiles.\n\n<b>34   NICO\n</b>\n     Holding the baby. Realizes that his little son has pooped\n     in his pants. He turns for help to Sara.                       *\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                           9.\n\n<b>                                NICO\n</b>                  I think we got a little problem here.\n\n<b>                                SARA                                  *\n</b>                         (winking at the women)\n                  I carried him for the last nine months,\n                  you take him for the next diaper.\n\n     Assorted uncles and aunts watch with amusement as Nico tries\n     awkwardly to deal with the problem.\n<b>                                NICO\n</b>                         (to all)\n                  That's what you get for not marrying a\n                  Sicilian.\n     Sara lets Nico struggle a moment, then takes over.               *\n\n<b>                             SARA                                     *\n</b>               My brave husband. He's not afraid of\n               thieves and muggers, but he's terrified\n               when his son poops in his pants.\n     Toscani relatives look on with approval at the happy couple\n     and their baby.\n\n<b>35   ANOTHER PART OF BACK YARD\n</b>     Three Chicago cops, LUKICH and HENDERSON in plain clothes\n     and LIEUTENANT STROZAH in uniform wolf some Italian goodies\n     while eying the group of celebrating relatives.\n<b>                                LUKICH\n</b>                         (indicates Nico\n                          across the patio)\n                  Toscani holds the record... for havin'\n                  more relatives under federal indictment\n                  than any other cop in Chicago.\n\n<b>36   TWO OF NICO'S UNCLES\n</b>     BRANCA and LUIGI, who   look like they have been on the other\n     side of a cop's work,   are in turn eying Lukich and Henderson\n     -- plus a cluster of   other cops in civvies hovering around\n     the buffet table like   vultures.\n<b>                                BRANCA\n</b>                  Look at these stiff dicks. A free meal\n                  and they come out like flies.\n<b>37   STREET OUTSIDE NICO'S HOUSE - DAY\n</b>\n     An unmarked police car pulls up. DOLORES JACKSON (\"Jax\"),\n     another undercover cop, tall, black, and elegant, enters\n     the driveway leading to Nico's back yard --\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                         10.\n\n<b>38   BACK YARD\n</b>     Jackson enters. She's impeccably dressed and radiates\n     intelligence. She's greeted warmly by Lukich, Henderson,\n     Strozah, and a couple of other cops.\n<b>                               STROZAH\n</b>                 I didn't do nothing, Counselor.    I'm\n                 clean.\n\n<b>                               JACKSON\n</b>                 Eight more days, Lieutenant. You\n                 better start preparing your defense.\n\n<b>                               HENDERSON\n</b>                 Baby, I'm gonna put you on retainer.\n\n<b>                               LUKICH\n</b>                 You passed the bar? I make it a\n                 point never to pass the bar.\n     Jackson sees Nico and Sara across the yard, waves and          *\n     starts toward them --\n<b>39   BACK TO BRANCA AND LUIGI\n</b>\n     Luigi indicates Jackson as she crosses the patio.\n<b>                                 LUIGI\n</b>                 Now this cop.    She can bust me any\n                 day.\n<b>40   NICK, SARA AND ROSA (NICO'S MOTHER)                            *\n</b>     Jackson comes up, makes a theatrical appreciation of Nico's\n     stylish attire, kisses Sara and greets Nico's mom warmly.      *\n     She starts oohing and ahhing over the baby.\n<b>41   VARIOUS SHOTS\n</b>\n     Young kids playing on the lawn, more guests arriving, Father\n     Genarro dancing with an elderly matron. We see that Nico's\n     friends are an electric mix. Cops, art-y types, people of\n     varied ages and professions.\n<b>42   BACK TO JACKSON\n</b>\n     Holding the baby.\n\n<b>                               JACKSON\n</b>                 Look at this little bundle.    What a\n                 cupcake!\n\n<b>                               NICO\n</b>                 You give up being the D.A. and hurry\n                 up and find the right fella, Jax.\n                 You might have time for one of these\n                 yourself.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                        10A.\n\n<b>                            SARA                                    *\n</b>              Nico, will you let the woman\n              catch her breath?\n\n<b>43   JAPANESE WOMAN (DR. WATANABE)                                  *\n</b>     moves in shyly on the fringe of the cluster. While Jackson\n     and Sara continue their \"mom\" talk, Nico edges off toward      *\n     Watanabe, shaking her hand with real pleasure.                 *\n\n<b>                             NICO\n</b>              Watanabe!   Say hey, Doc.\n\n     They begin jabbering in Japanese.\n     We will meet Watanabe again later. She's a brainy-looking      *\n     woman -- reserved, a bit mysterious -- who talks quietly and   *\n     intensely in Japanese with Nico like they're old friends who\n     go back a long way.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                        11.      *\n\n<b>44   EXT. TOSCANI FRONT PORCH - LATER\n</b>     Branca, Luigi and several other Toscani patriarchs smoke\n     cigars and sip beer in a cluster. Nico holds Julian.\n\n<b>                            BRANCA\n</b>              You're a father now. Are you gonna\n              take me up on my offer?\n\n<b>                            NICO\n</b>              I'm happy, Branca.    I like what I do.\n     Branca glances seriously to the other uncles, then, with a\n     smile, pats Nico's cheek.\n<b>                            BRANCA\n</b>              Look at this face! Six-foot-four,\n              pretty as the statue of David. And\n              he's a cop!\n     Branca laughs. From a distance, Watanabe watches, missing\n     nothing. Across the porch, Lukich and several other cops\n     observe and try to listen.\n<b>                            BRANCA\n</b>              This face should be sticking up from\n              a white shirt. It should be a banker,\n              a businessman, someone who earns a\n              decent living for his family!\n<b>                             NICO\n</b>              We're happy.\n<b>                            LUIGI\n</b>              Nickels and dimes. Your wife's a\n              woman with class. What did she run\n              -- a ballet school...?\n<b>                            NICO\n</b>              An art gallery.\n<b>                            BRANCA\n</b>              Same thing. She wants a husband who\n              carries a briefcase, not a shoulder\n              holster.\n     Jackson watches Nico trying to keep his good humor. This\n     is serious stuff, despite the light tone. Branca's eyes\n     meet Nico's.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                        12.\n\n<b>                             BRANCA\n</b>               You wanted to get shot, you got shot.\n               You wanted to get knifed, you got\n               knifed. You've had your fun. Basta!\n               Enough!\n<b>                             UNCLE GUISEPPE\n</b>               Let your family help you, Nico.\n\n<b>                             NICO\n</b>                      (lightly)\n               Uncle Gio, that kind of help I don't\n               need. I'd rather get shot by someone\n               I don't know.\n     Jackson and Lukich crack up. The others follow.   For the\n     moment, the tension is dispelled.\n\n<b>45   INT. NICO'S HOUSE - UPSTAIRS - DAY\n</b>     Nico comes out of the bedroom, adjusting his shoulder\n     holster, tugging his jacket over it. He sees his mother\n     standing near the head of the stairs, just outside\n     another bedroom door. Concern on her face.\n<b>                             NICO\n</b>               What are you doing in here, Mama?\n               Go join the party...\n     Nico comes down the hall, tucking in his shirt -- stops\n     to give his mother a squeeze. O.S. from the bedroom:\n     the sound of QUIET SOBBING. Nico glances in.\n<b>46   INT. NURSERY - DAY                                           *\n</b>     Sara and another woman sit on the bed, comforting a 60-ish   *\n     grandmother Zingaro, who is crying. Nico comes in. He\n     kneels before MRS. ZINGARO, concerned.\n\n<b>                             NICO\n</b>               Mrs. Z.\n                      (tries to be light)\n               Is this a way to act on the day of\n               my son's baptism?\n     The poor woman can't meet Nico's eyes.\n\n<b>                              SARA                                *\n</b>               It's Lucy.   She's gone again.\n     Nico glances from Sara to Rosa.                              *\n\n     Mrs. Zingaro shakes her head, choked with pain. Nico\n     holds her, looking over her shoulder toward Sara.            *\n<b>                             NICO\n</b>               It's that kid from the bar on Damen?\n               The one with the drugs?\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                          13.\n\n     Sara doesn't know. Nico does.     He comforts Mrs. Zingaro   *\n     another moment, then stands.\n\n<b>                             NICO\n</b>               Listen to me, Mrs. Z. Are you\n               listening?\n                      (as the woman nods\n                       miserably)\n               I have to go to work now. But\n               I'll come by tonight. You'll be\n               at the bakery?\n<b>                               MRS. ZINGARO\n</b>               Si, Nico.\n<b>                             NICO\n</b>               We'll talk, okay? We'll find a\n               way to take care of this.\n\n     Nico kisses Mrs. Z. He takes Sara's hand in goodbye,         *\n     starts for the door.\n<b>47   EXT. NICO'S HOUSE - DAY\n</b>     Festivities still in progress. Nico passes through,\n     nodding, thanking people for coming, taking farewells.\n     Jackson waits for him, glancing at her watch.\n<b>48   INT. UNMARKED CAR - MOVING\n</b>     Nico is driving.   Jackson checks in on the radio.\n<b>                             JACKSON\n</b>                      (into mike)\n               Unit Ten Tango X-ray.    We're up\n               and clear.\n<b>49   EXT. VARIOUS STREETS - UNMARKED CAR\n</b>\n     moves into the central city.\n<b>50   POV THROUGH CAR WINDOWS - STREETS - MOVING\n</b>\n     Bad-looking hombres on stoops, street corners.\n<b>                             NICO (O.S.)\n</b>               I promised the Lieutenant, I'm\n               gonna take care of you. Broken\n               windows and lost kittens for your\n               last week.\n     WIDEN SHOT to include Nico and Jackson.\n\n<b>                             JACKSON\n</b>               And then you're gonna come visit\n               me in a nice, clean, air conditioned\n               office --\n<b>\n</b>     ABOVE THE LAW - Rev. 4/29/87                          14.\n\n<b>51   EXT. STREET - BUCKSHOT'S LIQUORS - DAY                        *\n</b>     The unmarked car pulls up outside a liquor store and bar.\n\n<b>52   INT. UNMARKED CAR\n</b>     as it parks. Jackson gives Nico a look:     \"What are we\n     stopping at this dive for\"?\n\n<b>                             NICO\n</b>               I gotta take a quick leak. Stay\n               put.\n\n     He gets out of the car, starts for the bar.\n<b>53   INT. BUCKSHOT'S LIQUORS - DAY                                 *\n</b>\n     Dim, smoke-choked, dangerous characters at the bar.    Nico\n     enters.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                            15.\n\n     His silk shirt and sport coat clash with the druggy, working-\n     class attire of the bar's denizens. Hard faces check him out\n     subtly, ignore him. Nico approaches the bartender, shows a\n     photograph. The bartender (BAD DUDE) shakes his head.\n\n<b>                            BAD DUDE                                 *\n</b>              Why the fuck don't you assholes                        *\n              leave me alone?                                        *\n\n     He continues mouthing off to Nico. Nico moves to one stool,     *\n     then another; the same exchange is repeated.\n<b>54   FAVOR ONE PARTICULARLY TOUGH CUSTOMER                           *\n</b>\n     A hulking bruiser with an earring.   He watches as --\n<b>55   NICO\n</b>\n     approaches him. Three ARMY JACKETS look up sullenly.\n     Beefy arms, tattoos, greasy mustaches.\n<b>                              NICO\n</b>              Gentlemen.\n     One Jacket treats him like he doesn't exist, and begins\n     to pick his nose.\n<b>                            FIRST ARMY JACKET\n</b>                     (to others)\n              I thought this was a kosher bar.\n              They didn't allow no pork in here.\n     The two others snicker, then so does the rest of the bar.\n     Nico holds out a photo of a young girl (Lucy).\n<b>                            NICO\n</b>              You seen this girl?\n<b>                            SECOND ARMY JACKET\n</b>              I seen the top of her head.\n<b>                              NICO\n</b>              That's witty.\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                        15A.\n\nNico takes a step away, as if moving on to the next\nstool. From behind the bar, the bartender swings a          *\nsawed-off baseball bat into view. Other bodies move         *\nominously toward Nico. Suddenly he spins and, in a move     *\nalmost too quick to see, he kicks the entire stool right\nout of its floor socket. Beer bottles fly, bodies crash.\nNico slams the First Jacket in the face so hard it looks\nlike his nose has exploded. Blood sprays onto Nico's silk\nshirt. He hauls the Second Jacket upright, nails him with\na shot that crushes three ribs. A savage elbow blasts the\nthird, head over heels, out over the bar and careening\ninto the sink. In three seconds 600 pounds of fat has\nbeen put in cold storage. The rest of the bar is on its\nfeet. Four huge men confront Nico. Now five. Six.\nSeven. Nico's jacket and shirt are ripped, blood spat-\ntered; his eyes are like an animal's, daring the men --\n\n<b>                         NICO\n</b>          Come on.   Show me something.\nNo one moves.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                           16.      *\n\n<b>                               NICO\n</b>                I get it.   It's a gay bar.   Is\n                that it?\n\n      The men, led by the Bad Dude, are shifting to surround\n      Nico. But no one attacks. Nico has Lucy's photo in his\n      hand. He jams it in one man's face, then another's, slap-\n      ping each one violently, spitting, raging for them to attack.\n\n<b>                              NICO\n</b>                You seen the top of her head, huh?\n                Like I seen your mother's --\n                       (to another guy)\n                Or was it yours?\n                       (to a third)\n                Or yours?\n                       (slaps him fero-\n                        ciously)\n                I couldn't tell, it looked like\n                her ass --\n      Nico rages like a beast.\n<b>                             NICO\n</b>               Come on, motherfuckers.    Do it.\n               Do it! One man --\n      Nico lunges for the Bad Dude, grabs him like he's about\n      to tear his face off --\n<b>                             BAD DUDE\n</b>               Upstairs!\n                      (in terror)\n               She's upstairs! 4-D!\n      Nico drags the Dude from behind the bar.     Holding him,\n      Nico turns, glowering, to all.\n<b>                             NICO\n</b>               You cocksuckers are brave enough\n               with 14-year-old girls.\n<b>55A   INT. FLOPHOUSE HALLWAY\n</b>\n      Nico throws Bad Dude down the hallway in front of him.\n<b>56    INT. FOURTH-FLOOR APARTMENT - DAY\n</b>\n      The door bursts in from a jackhammer kick. Nico stands\n      in the hallway. Bad Dude stands next to him; hurt,\n      shaking.\n\n<b>                              NICO\n</b>                       (to Bad Dude)\n                Get outta here.\n      We look in the apartment.\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                         16A.\n\n<b>REVERSE - NICO'S POV                                           *\n</b>A young PIMP -- quite  handsome in a boyish way -- stares up\nin panic from a grimy  mattress on the floor. Little LUCY\nis in bra and panties,  strung out, 14 and beautiful.\nSyringes and free-base  paraphernalia are on a table.\n<b>NICO IN DOORWAY                                                *\n</b>\n<b>                        NICO\n</b>                 (to Pimp)\n          This ain't your day, kid.\n\nNico comes in, eyes taking in everything.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                          17.\n\n<b>                              PIMP\n</b>               Wait, man.   It ain't like it\n               looks --\n\n     Nico grabs the Pimp by the scruff of the neck, lifting him\n     bodily. Lucy starts wailing in horror. Nico smashes the\n     Pimp's face down into a mirror with white powder on the\n     table --\n\n<b>                             NICO\n</b>               That's two years.\n     He jerks the Pimp back, rips open a drawer.    More pills\n     and glacene bags.\n<b>                             NICO\n</b>               That's four.\n                      (twisting the   Pimp's\n                       neck toward   Lucy)\n               She'll get you eight   more. And\n               I'm just warming up   --\n     Lucy is crying hysterically. Nico flings the Pimp, face          *\n     bloody, toward the open door.                                    *\n<b>                             PIMP\n</b>                      (to Nico, indicat-\n                       ing drugs)\n               Take it, baby. It's all yours --\n<b>                             NICO\n</b>               Get your clothes on, Lucy.\n<b>                             PIMP\n</b>               There's money. Three grand in the\n               mattress...\n                      (begging)\n               ... I can get ya more --\n\n<b>                                                  QUICK CUTAWAY TO:\n</b><b>57   EXT. STREET OUTSIDE - JACKSON\n</b>\n     Three young STUDS have ambled to the window of her parked\n     car.\n<b>                             STUD\n</b>               Hey, sister, what it be?\n\n     With infinite boredom, Jackson lifts her badge -- and\n     gun. The Studs shuffle away.\n\n<b>58   INT. HALLWAY - DAY\n</b>\n     Other tenants stare from doorways as Nico drags the Pimp         *\n     to the top of the flight of stairs, threatening to throw         *\n     him down.                                                        *\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                        17A.\n\n<b>                       NICO                                *\n</b>         Don't you fuckin' move.                           *\n\nNico steps back into the apartment, hauls out Lucy in      *\na dressing gown.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                        18.\n\n<b>59   TOP OF LANDING                                             *\n</b>     The Pimp is dazed, bloody. Nico comes down with Lucy,\n     hauls the Pimp to his feet --\n\n<b>                             LUCY\n</b>               Let him alone! He's beautiful!\n\n<b>                             NICO\n</b>               Not when I get through with him.\n     Nico lifts the Pimp by the throat, pins him to the wall.\n\n<b>                             PIMP\n</b>               No, man, wait! I'll give you\n               something! Something big!\n\n<b>                               LUCY\n</b>               Please, Nico!    Don't!\n<b>                             PIMP\n</b>               It's huge! I swear it! A\n               shipment... coming in next\n               Tuesday --\n<b>                             NICO\n</b>               Shipment, my ass.\n<b>                             PIMP\n</b>               This is square! On my mother's\n               soul! You can't send me up --\n     Nico glances to Lucy. Half of him wants to tear the\n     Pimp apart, the other half doesn't want to make the poor\n     girl's life any more tragic. Besides, he's a good cop\n     -- and maybe this \"shipment\" is on the level.\n<b>                             PIMP\n</b>               I heard it from a hooker friend\n               of mine. She's banging some big\n               coke lawyer, he told her. I swear\n               to Jesus!\n\n     Nico relents -- a little.\n<b>                               NICO\n</b>               What lawyer?\n\n<b>                             PIMP\n</b>               I don't know.\n                      (sees Nico doesn't\n                       believe him)\n               That platinum chola... Carla\n               DeCarlo... she knows.\n     Nico tightens his grip on the Pimp's throat.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                          19.   *\n\n<b>                             PIMP\n</b>               She got popped this afternoon.\n               She's downtown. Red dress, lizard\n               shoes --\n\n<b>60   EXT. STREET OUTSIDE BAR - DAY\n</b>     Jackson looks up from the car to see Nico -- wild-haired,\n     shirt ripped and bloody -- emerging from the adjacent\n     apartment stoop, leading young Lucy, who's tear-streaked,\n     wearing a torn dressing gown. Instantly, Jackson is out\n     of the car, moving to Lucy.\n\n<b>                             JACKSON\n</b>               It's okay, girl. Mama Jax is\n               here.\n\n     She wraps an arm around Lucy, helps her toward the car.\n\n<b>                             JACKSON\n</b>                      (to Nico)\n               That was some leak you took.\n     From the door of the bar, several bloodied heads peek.\n<b>                             JACKSON\n</b>               Broken windows and lost pussy cats,\n               huh.\n     Jackson checks out her battered partner.\n\n<b>                             JACKSON\n</b>               You're one crazy bastard, Toscani.\n     Nico opens the rear door, helps Jackson ease Lucy in.\n\n<b>                             NICO\n</b>               We'll get her some clothes and a\n               bath. I'm not bringing her home\n               to her grandmother like this.\n<b>                                                  DISSOLVE TO:\n</b>\n<b>61   OMITTED\n</b><b>&amp;\n</b><b>62\n</b>\n<b>63   EXT. ZINGARO BAKERY - DAY\n</b>\n     From the front seat of Nico's car emerges a tearful Lucy,\n     in fresh clothes and looking miserably contrite. Nico\n     walks her inside.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                         20.       *\n\n     The Zingaro family is busy preparing for the night's baking.\n     Grandpa and Grandma Zingaro leave their work and receive\n     their waif-like granddaughter. With eyes watering they\n     thank Nico. They disappear upstairs with Lucy. Jackson,\n     standing in the doorway, has seen all this.\n<b>64   INT. UNMARKED CAR - MOVING - DAY\n</b>\n     Nico at the wheel has just pulled away from the bakery.\n     Jackson, in the passenger seat, studies her partner for a\n     few moments, shaking her head at the contradictions in this\n     man. Educated, classy, an elegant dresser -- yet underneath\n     an out-and-out wild man.\n\n<b>                             JACKSON\n</b>               I don't get you, Toscani.\n                      (beat)\n               What the hell are you doing being a\n               shitheel cop? With your background?\n     For a long moment Nico says nothing.   Then, quietly, look-\n     ing straight ahead:\n<b>                             NICO\n</b>               When I was overseas, I saw some\n               things. Things that eat your guts\n               out. Things that stay in front of\n               your eyes like they were burned in\n               and branded.\n     He turns to Jackson.\n<b>                             NICO\n</b>               You can walk away from them, Jax.\n               You can quit, but you know it's\n               still going on. You try something\n               anyway --\n                      (smiles a moment)\n               -- I know I'm not going to change\n               the world. I can't stop the tonnage\n               coming in, I can't fight the boys\n               behind the desks pushing their\n               buttons --\n\n<b>     ANGLE INCLUDING MEAN STREETS OUTSIDE\n</b><b>                             NICO\n</b>               But maybe here, huh?\n                      (indicates street)\n               Maybe in my own city, my own\n               neighborhood, on my own block --\n               maybe here I can do something.\n\n     He turns a corner.\n<b>                             NICO\n</b>               That's why I'm a shitheel cop.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                         20A.     *\n\n<b>64A   INT. POLICE STATION - DAY\n</b>      Behind the desk, a few detectives man the phones.   A Latin\n      attorney, ABANDANO, is at the counter.\n\n<b>                             COP (O.S.)\n</b>               You can see your client. As soon\n               as she's through eating her dinner.\n\n<b>65    INT. POLICE LOCKUP - \"CAGE\" AND HALLWAY - EVENING\n</b>      Hookers, female addicts, etc. in the downtown \"cage.\"\n      Nico has the girl in the red dress and lizard shoes\n      (CARLA DECARLO) out in the hallway adjacent to the lock-\n      up. Nico is Mr. Charm, offering her a heart-shaped box\n      of chocolates.\n\n<b>                             NICO\n</b>               Carla... Carla -- I just want the\n               name of your boyfriend --\n<b>                             CARLA\n</b>               I got 200 boyfriends.\n      The hooker, Carla DeCarlo, slaps the box away, cursing in\n      Spanish.\n<b>\n</b><b>                                                             21.\n</b>\n<b>                             CARLA\n</b>               Pinchi cabron, cabeza colon!\n\n     Some of the chocolates tumble onto the lockup floor, the\n     detainees snap them up, start munching. The girl con-\n     tinues to spit curses at Nico, gesturing with her hands\n     with Latin flamboyance. Nico grabs her by the elbow, as\n     a jailer opens the lockup door. More curses are being\n     flung at Nico from various females in the cage. Nico\n     heaves Carla in among them. Carla flops down on a bench\n     next to a tall black hooker. MOVE IN ON the black hooker.\n     It's Nico's partner, Jackson, dolled up like a street-\n     walker, playing her undercover role to the hilt.\n\n<b>                             JACKSON\n</b>                      (to Nico)\n               Why can't you sons-a-bitches ever\n               treat someone with a little\n               respect?\n<b>                             NICO\n</b>                      (walking away)\n               Take it easy, sister.\n<b>                             JACKSON\n</b>               I ain't your goddamn sister.   We\n               ain't got the same mother,\n               motherfucka.\n     Carla fires one final parting salvo of obscenities, then\n     sags back among the women. Carla starts to cry. Jackson\n     comforts her; Carla responds, lets herself be comforted.\n<b>                                                   CUT TO:\n</b><b>66   EXT. DOWNTOWN - FINANCIAL DISTRICT - DAY\n</b>     Jackson, back in her normal daytime wear, exits a\n     building. She gets into Nico's car.\n\n<b>67   INT. CAR - DAY\n</b>     Jackson checks her makeup in the rearview mirror. Nico\n     sits behind the wheel. The two are on some kind of\n     stakeout.\n<b>                             JACKSON\n</b>               The lawyer's name is Abandano.\n               He's on the third floor. I got a\n               look at him. I couldn't get how\n               he's connected, but according to\n               Carla, he's a lousy lay.\n\n<b>                             NICO\n</b>               Maybe we can bust him for that.\n     Jackson spots something, gestures subtly out window --\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                           22.\n\n<b>68   EXT. DOWNTOWN BUILDING - DAY\n</b>     A short, slick-looking Latin man in a business suit emerges\n     from the building.\n\n<b>                             JACKSON\n</b>               That's our stud.\n\n     Nico and Jackson leave their car and follow him on foot.\n\n<b>69   EXT. FINANCIAL DISTRICT - BANK - DAY\n</b>     ABANDANO meets a striking-looking middle-aged woman in front\n     of a stately financial institution. They go in. Jackson\n     remains out on the street, while Nico follows the couple in.\n<b>70   LATER\n</b>\n     Jackson has been waiting, sipping some coffee. Nico\n     emerges from the bank, signaling to his partner to follow\n     him. Abandano and the woman exit from the bank's revol-\n     ving doors and immediately jump into a cab. Nico and\n     Jackson look at each other and step in front of another\n     cab. Nico opens the cab door, flips his badge open, then\n     asks the occupant to leave. Jackson gets in the front\n     seat next to the protesting cabbie.\n<b>71   EXT. FEDERAL BUILDING - DAY\n</b>     Abandano and the woman are crossing the plaza as Nico and\n     Jackson run up the block. Near the entrance to the Federal     *\n     Building, a small but vocal group of protestors are            *\n     gathered, carrying signs and chanting slogans. The frus-       *\n     trated cabbie watches them in the background.\n<b>72   PLAZA\n</b>     Jackson and Nico watch Abandano and the woman pass the        *\n     crowd of demonstrators and enter the building. Jackson acts *\n     indifferent, almost frustrated; Nico keenly senses something.\n<b>                                                  CUT TO:\n</b>\n<b>73   INT. EXPENSIVE RESTAURANT (\"BOGOTA\") - DAY                     *\n</b>     The main dining room. No customers, just busboys readying\n     tables for the evening's business. We notice one of the        *\n     busboys is the \"pimp\" Nico found with Lucy.                    *\n\n<b>74   BOOTH NEAR BACK HALLWAY\n</b>     The owner's table. Stacks of dining checks, a cashbox\n     and calculator, full ashtrays, wine glasses. BAUTISTA\n     SALVANO, a heavyset, swarthy Venezuelan dressed in a tux\n     with the collar open, glowers across the table at a mus-\n     cular, scar-faced Latin busboy -- the kind who looks like\n     he does more for his boss than clean up the tables. The\n     busboy (NARDO) is nervous, apologetic --\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                          23.\n\n<b>                            SALVANO\n</b>                     (pissed off)\n              -- I brought you in for your\n              muscles, Nardo, not your mouth.\n\n<b>                            NARDO\n</b>                     (scared)\n              I'm sorry, boss.\n\n<b>                            SALVANO\n</b>              Your English is getting good...\n              You're showing it off. Showing it\n              off on the street --\n\n<b>                              NARDO\n</b>              I keep quiet.    I never talk no\n              more --\n\n     Salvano glowers at Nardo like he's about to punch him.\n     Instead he reaches over, playfully chokes the busboy --\n     then releases him, as if all is forgiven.\n<b>                            SALVANO\n</b>              Make yourself useful.\n                     (indicates empty\n                      wine bottle on\n                      table)\n              Get downstairs, bring me one of\n              these.\n                     (as Nardo stands,\n                      starts for back\n                      hallway)\n              Then get back to work.\n<b>75   INT. RESTAURANT BASEMENT STOREROOM - LATE AFTERNOON\n</b>\n     Nardo enters at the top of the stairs, radiating relief.\n     He trots down into the empty basement, toward a floor-to-\n     ceiling wine rack.\n\n<b>                            NARDO\n</b>                     (to himself)\n              I thought I was dead, man.\n                     (whistles with\n                      relief)\n              I thought I was fucking dead.\n\n     He crosses to the wine rack. It's dark, hard to see.\n     He searches for the bottle. Suddenly: a METALLIC sound\n     behind him. Nardo turns -- CHI CHI TESTAMENTE, a wiry,\n     pock-faced Latino, stands in the shadows (it is clear he\n     has been waiting there, hiding) -- holding a small\n     silencer automatic.\n\n<b>                            CHI CHI\n</b>              You were right, cabron.                            *\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                           24.\n\n     One SHOT between the eyes and Nardo CRASHES backward into\n     the WINE RACK, eyes wide with shock and bewilderment. Chi\n     Chi SHOOTS him AGAIN; Nardo drops like a stone. Coolly,\n     professionally, Chi Chi pumps FOUR more SHOTS into the\n     prone busboy's head. Chi Chi ejects the clip into his\n     palm, unscrews the silencer, holsters the gun. Salvano\n     appears at the top of the stairs. Two busboys are behind\n     him. One of them is the young pimp. The busboys hurry        *\n     down, the pimp -- scared shitless but playing it macho-cool. *\n     Salvano comes down the stairs. Chi Chi stands over his work.\n<b>                             SALVANO\n</b>                      (to busboys)\n               Clean up this mess.\n<b>                            CHI CHI                                  *\n</b>              Who knows who else is talking --                       *\n\n<b>                            SALVANO                                  *\n</b>              He was a young fool.                                   *\n<b>76   BACK IN UPSTAIRS DINING ROOM\n</b>     Salvano and Chi Chi emerge from the basement steps and\n     walk toward their booth.\n\n<b>                            CHI CHI\n</b>              We're crazy waiting for this\n              bullshit 'shipment.' Let me waste\n              the other fucker now.\n\n     Salvano puts a hand on Chi Chi's shoulder.\n<b>                            SALVANO\n</b>              Be patient. This will be done\n              the way it was planned.\n<b>                                                  CUT TO:\n</b>\n<b>77   EXT. BODY AND FENDER SHOP - NIGHT\n</b>     Rusting cyclone fences surround   a mud-lot repair yard in a\n     dingy industrial section. Young    Lation and black workers\n     finish up for the night; through   the dirty, security-barred\n     office window we can see Chi Chi   talking on the phone. The\n     lawyer, Abandano, is also there.\n\n<b>78   EXT. ALLEY - REAR OF SHOP - NIGHT\n</b>\n     Nico finishes connecting a small transmitter which has\n     been hastily wired to the entering phone line.\n\n<b>79   INT. UNMARKED CAR - NIGHT\n</b>\n     Nico and Jackson in the shadows down the street from the\n     body shop. Nico wears earphones, a small tape recorder\n     on the seat beside him. Jackson does not look happy.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                          25.\n\n<b>                             JACKSON\n</b>               Toscani, you're going to have me\n               doing time.\n\n<b>                             NICO\n</b>               Lighten up, Jax. No one's\n               bringing this into court.\n\n<b>                             JACKSON\n</b>               Except against us.\n<b>                             NICO\n</b>               I don't give a shit how we do it.\n               I just wanna get there.\n     Jackson gives Nico a dirty look, but stifles her protest.\n\n<b>                             JACKSON\n</b>               I thought you said you were\n               gonna protect me. Cover my butt.\n               Be my guardian angel --\n     Nico hears something through the earphones.    Gestures for\n     silence --\n<b>80   ANGLE THROUGH OFFICE WINDOW\n</b>     Chi Chi listens with increased intensity to something on the\n     phone. He starts writing it down --\n<b>81   BACK TO NICO\n</b>     In unmarked car.   He's writing it down too.\n<b>                             NICO\n</b>               I got the shipment.                                  *\n<b>                               JACKSON\n</b>               What?    What's he saying?\n\n<b>                             NICO\n</b>                      (scribbling furiously)\n               '... Engine block has cleared\n               customs. Serial number VA-748.\n               Pick up Tuesday, 3 May as\n               authorized.'\n\n<b>82   EXT. BODY SHOP - NIGHT\n</b>\n     Chi Chi emerges from the office, tucking a scrap\n     of paper into his pocket. Abandano follows. They get\n     into a late-model Lincoln which pulls out onto the street.     *\n\n<b>83   EXT. STREET - NIGHT\n</b>     Nico and Jackson's car follows at a discreet distance.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                           26.\n\n<b>                             NICO (V.O.)\n</b>               Unit Ten Tango X-ray. I need a\n               vehicle registration I.D.\n\n<b>                             POLICE RADIO (V.O.)\n</b>               Go ahead, please.\n<b>                               NICO (V.O.)\n</b>               '86 Lincoln.    Illinois 354 Dog '67.                *\n\n<b>84   INT. UNMARKED CAR - MOVING - NIGHT\n</b>     Jackson picks up Nico's pad to take down the response.\n     After a moment:\n<b>                             POLICE RADIO (V.O.)\n</b>               Vehicle registration follows.\n               Leaseholder: Ramon Testamente,\n               registered alien. Nation of\n               origin: Venezuela. Do you wish\n               criminal record search?\n<b>                              NICO\n</b>                       (into mike)\n               I want to know when he wipes his                     *\n               behind.                                              *\n<b>85   SERIES OF SHOTS\n</b>     As Nico and Jackson tail the Lincoln out of the industrial\n     zone into a fancier, non-Latin neighborhood. On the sidewalks\n     we glimpse theatergoers, fashionable white couples out on the\n     town.\n<b>86   LINCOLN\n</b>\n     Pulls up to a valet park outside a ton-y restaurant.    A\n     sign says: \"BOGOTA.\"                                           *\n\n<b>87   INT. UNMARKED CAR - MOVING\n</b>     Nico and Jackson exchange a glance.\n\n<b>                               JACKSON\n</b>               Salvano?\n<b>                               NICO\n</b>               Jackpot.\n\n<b>88   EXT. RESTAURANT - NIGHT\n</b>     Chi Chi and Abandano get out of their car, a valet takes it,\n     Chi Chi enters the restaurant.\n\n<b>89   INT. SALVANO'S RESTAURANT - NIGHT\n</b>     Nico and Jackson enter the main dining room, which we\n     recognize from the scene with Nardo the busboy.\n<b>\n</b><b>                                                          27.\n</b>\n     The place is packed with fashionable people of all races.\n     A band plays salsa; couples dance. Nico and Jackson pass\n     easily as a hip \"uptown\" couple. A pretty Latin HOSTESS\n     approaches them.\n\n<b>                             HOSTESS\n</b>               Two for dinner?\n\n<b>                             NICO\n</b>               Two for drinks.\n     They elbow up to the packed bar, standing.   Nico squints\n     toward the rear dining room.\n\n<b>90   NICO'S POV - DOWN BAR\n</b>     Looking past numerous patrons, we see Chi Chi whisper\n     something to a waiter and take a seat at a rear table\n     (the same \"owner's table\" where Salvano sat before.)\n     The waiter hurries off into a back hallway.\n<b>91   NICO AND JACKSON - AT BAR\n</b>     Jackson moves to the salsa beat.   A BARMAID approaches.\n<b>                             JACKSON\n</b>               Gimme something stiff.   I need it.\n<b>                              BARMAID\n</b>               Who doesn't?\n\n     Nico's eyes never leave Chi Chi.\n<b>92   REAR DINING ROOM\n</b>     From the back hallway Salvano emerges -- in his tux,\n     looking prosperous. He sits down beside Chi Chi and\n     Abandano. A waitress brings two drinks. After a few\n     words, Chi Chi removes the scrap of paper from his pocket,\n     hands it to Salvano.\n<b>                             NICO (O.S.)\n</b>               You'll have your engine block\n               next Tuesday, boss.\n<b>93   BACK TO NICO AND JACKSON\n</b>\n     As the Barmaid brings their drinks. Jackson sees her\n     peaceful week to retirement flying out the window.\n<b>                             JACKSON\n</b>               Why couldn't it be a week from\n               Tuesday? I could read about it\n               in the paper.\n     Nico grabs her waist, pulls her onto the dance floor, and\n     does a playful twirl.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                           28.\n\n<b>                              NICO\n</b>                Cheer up, partner.   I'm gonna\n                make you famous.\n\n<b>94    EXT. WHOLESALE MEAT AREA - DAY                               *\n</b>      Track spurs, greasy streets, parked fork lifts.\n\n<b>94A   EXT. ROOF - DAY                                              *\n</b>\n      Lieutenant Strozah surveys the street traffic.               *\n<b>95    NICO, JACKSON AND LUKICH\n</b>\n      The two men, dressed as meat processors in hard hats and\n      bloody white coats, rake cattle guts under the eave of a\n      packing plant. Jackson, dressed like a USDA Inspector and    *\n      carrying a clipboard, inspects a few hanging carcasses.\n\n<b>                              JACKSON\n</b>                You missed a few spots, boys.\n<b>                              LUKICH\n</b>                I'm takin' it home t'a make\n                kilbasa, boss.\n\n      Luke casts an impatient glance across the street to a lot\n      with four parked meat trucks. We glimpse two \"truckers\"\n      keeping low in the shadows of one cab. Down the block a\n      seemingly empty pickup truck is parked in an alley.\n\n<b>                              LUKICH\n</b>                This ain't a bust -- it's a\n                convention.\n<b>                              NICO\n</b>                Don't you like company, Luke?\n                       (sarcastic)\n                We got all the scouts here --\n                Drug Enforcement Agency, the\n                Alcohol, Tobacco and Firearms --\n<b>                              WALKIE-TALKIE (V.O.)\n</b>                Keep this channel clear, Toscani.\n      We realize Nico, Jackson and Lukich are wired, with mikes\n      out of sight under their coats. Nico glances to the pick-\n      up, near to which three men can be spotted in the alley.\n      Apparently one of them is the walkie-talkie voice.\n<b>                              NICO\n</b>                       (into mike)\n                This is our channel, dickhead.\n                And our collar.\n<b>                              ANOTHER WALKIE-TALKIE (V.O.)\n</b>                That's enough, all of you! Keep\n                this channel clear.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87   28A.\n\n<b>96   ANGLE ON MEAT PLANT - DAY\n</b>     Nothing happening.\n<b>\n</b>     ABOVE THE LAW - Rev. 4/17/87                          29.\n\n<b>97   ANOTHER ANGLE\n</b>     Dead as hell.\n\n<b>98   NICO, LUKICH AND JACKSON\n</b>     Bored, pissed off, tired.   Suddenly:\n\n<b>99   BATTERED VAN WITH TWO MEN\n</b>\n     emerges from a corner, two blocks down.    It starts slowly\n     this way.\n\n<b>                             1ST WALKIE-TALKIE (V.O.)\n</b>               All right. Everyone get their\n               heads outa their ass.\n\n     The meat truck men duck down out of sight, the pickup men\n     back into the shadows. Nico and Lukich keep raking cow\n     guts. The van passes slowly, checking out the area.\n<b>                             JACKSON\n</b>                      (sarcastic)\n               '... And so I quit the police\n               department... got myself a steady\n               job -- '\n     The van accelerates slightly, turns a corner, vanishes.\n     Silence.\n<b>                             LUKICH                                *\n</b>               They spotted me. I'm too good-\n               looking to be a meat slopper.                       *\n<b>                             1ST WALKIE-TALKIE (V.O.)\n</b>               Will you hot dogs shut up?\n     The van returns.   On a cross street.   Heading behind the\n     packing plant.\n\n<b>                             NICO                                  *\n</b>                      (to Lukich)                                  *\n               You're too ugly.\n\n     Now a second car appears. The Lincoln. Behind it is an\n     ancient station wagon. Both vehicles take a different\n     cross street, but both heading behind the packing plant.\n\n<b>                             NICO\n</b>                      (into hidden mike)\n               Here we go, boys and girls --\n                      (to Jackson)\n               You stay put.                                       *\n\n     As soon as the two vehicles pass out of sight, Nico and\n     Lukich ditch their rakes, dart into the packing plant.\n     The meat truck men START their TRUCK.\n<b>\n</b><b>                                                            30.\n</b>\n      The pickup men board their vehicle -- Jackson follows Nico\n      and Luke -- but at a safe distance.\n\n<b>100   INT. PACKING PLANT - DAY\n</b>\n      Nico and Lukich sprint in a crouch past the blood runoffs,\n      meat cutting tables --\n\n<b>101   NICO'S POV - RUNNING\n</b>\n      THROUGH the windows at the rear of the plant, we see the\n      station wagon and the van, pulling up swiftly beside one\n      another, men getting out --\n\n<b>102   INT. PLANT\n</b>      Nico and Lukich draw their guns, running full-tilt.\n\n<b>                                 NICO\n</b>                          (into hidden miki)\n                   It's going down now. Move!\n<b>103   EXT. REAR OF PACKING PLANT - DAY\n</b>      The station wagon men heave their rear door open, the\n      van men start to open their side door. The Lincoln is\n      stopped at a distance. Suddenly --\n<b>104   NICO AND LUKICH\n</b>      burst from the rear door of the packing plant, guns drawn.\n<b>                                 LUKICH\n</b>                   Police!\n<b>105   QUICK CUTS - VAN AND STATION WAGON MEN\n</b>      grab for their weapons --\n\n<b>106   COPS IN MEAT TRUCK AND PICKUP\n</b>      come highballing around both sides of the packing plant --\n\n<b>107   VAN AND STATION WAGON MEN\n</b>      OPEN FIRE. There is confusion and mayhem; it's not clear\n      who's a cop and who's a criminal.\n\n<b>108   NICO AND LUKICH\n</b>      dive for cover, RETURNING FIRE. The DEA men in one truck\n      also OPEN UP. One of the van men is hit between the eyes.\n      MACHINE GUN FIRE rakes the DEA truck; it spins out of\n      control; flips. Lukich SHOOTS the machine-gunner.\n<b>                                  LUKICH\n</b>                           (shouts; points)\n                   Nico!   The Lincoln!\n<b>\n</b><b>                                                             31.\n</b>\n<b>109   LINCOLN\n</b>      starts to PEEL OUT. We glimpse Chi Chi in the driver's\n      seat, Salvano on the passenger side.\n\n<b>110   NICO\n</b>      steps in front of the accelerating Lincoln, raises his .45.\n\n<b>111   INT. LINCOLN - DAY\n</b>      Salvano and Chi Chi dive below the dash and continue\n      forward. Salvano, in the passenger seat, raises his GUN;\n      FIRES blindly -- trying to hit Nico.\n<b>112   EXT. LINCOLN - DAY\n</b>\n      Nico UNLOADS his .45 into the windshield and the firewall.\n      The Lincoln keeps coming down the narrow alley.\n<b>113   NICO\n</b>      brazenly steps up onto the hood and dives, grabbing onto\n      the roof.\n<b>114   INT. LINCOLN - DAY\n</b>      Salvano can't believe it. He screams something in\n      Spanish. He FIRES again, this time through the roof.\n<b>115   EXT. LINCOLN - ROOF - DAY\n</b>      Bullet holes appear.    Nico narrowly misses being hit.\n<b>116   ANOTHER ANGLE - LINCOLN\n</b>\n      Nico reaches over the side of the car and SMASHES the pas-\n      senger WINDOW with his fist.\n\n<b>117   CLOSEUP - NICO'S HAND\n</b>      Salvano's face is bashed.     Nico's huge hand grabs Salvano's\n      throat; he won't let go.\n\n<b>118   CLOSEUP - NICO\n</b>      He hangs on with one hand.\n\n<b>119   CLOSEUP - SALVANO\n</b>      Nico's fingers now    dig into Salvano's larynx; he may never\n      talk again. He's     gagging. Salvano now points the gun at\n      Chi Chi. Chi Chi     makes the decision to stop the car in\n      order to save his    boss.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                            32.\n\n<b>120   NICO\n</b>      leaps off the roof pulling Salvano past the broken glass,\n      out of the window.\n\n<b>121   SEVERAL POLICE VEHICLES                                        *\n</b>      SCREECH into the lot. Officers pour out, guns drawn,\n      surrounding the Lincoln and the other vehicles. Jackson\n      joins them, weapon in hand.\n<b>122   NICO\n</b>\n      drags Salvano by the neck across the lot to the van,\n      slamming the drug dealer up against the van's side.\n      Lukich, Jackson and Strozah are there, with the DEA cops,      *\n      all covering the other men.\n\n<b>                               NICO\n</b>                        (to Salvano)\n                 How many kilos you got in there,\n                 Skivuzo?\n      Salvano couldn't answer if he wanted to. The other cops\n      look at Nico with awe. Lukich whips the van door open,\n      yanks a tarp off the cargo.\n<b>123   INT. VAN\n</b>      The engine block sits in a wooden shipping frame, wrapped\n      with industrial plastic. Nico climbs into the van, rips\n      the plastic sheeting off, grabs the wood slats of the\n      shipping frame, tears them off. In the background,\n      ambulances are arriving to care for the wounded cops\n      and criminals.\n\n<b>124   CLOSEUP - ENGINE BLOCK\n</b>      From the cylinder heads emerges a full load, not of drugs,\n      but of plastique tubes labeled U.S. ARMY C-4 HIGH EXPLOSIVE.\n<b>125   LUKICH, JACKSON AND OTHER COPS\n</b>\n      react with surprise and shock.\n<b>126   NICO\n</b>\n      rips open one of tubes and smells it.\n\n<b>127   CLOSE - NICO\n</b>      Confused; frustrated.\n\n<b>                               NICO\n</b>                 What kinda fuckin' high is this?\n<b>                                                    CUT TO:\n</b><b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         33.\n\n<b>128   INT. FBI OFFICE - NIGHT\n</b>      OPENING ON SALVANO, in a chair, looking bruised and swollen,\n      and wearing an expression of fuming indignation.\n\n<b>                              SALVANO\n</b>                -- I'll tell you what this cop is.\n                He's a fucking menace!\n\n<b>129   TWO FBI AGENTS (NEELEY AND HALLORAN)                           *\n</b>      face Salvano, Chi Chi and the lawyer Abandano (apparently\n      representing Salvano and Chi Chi). Neeley is on the phone.     *\n      Pictures of Reagan and Meese are prominent on the wall.\n<b>                              SALVANO\n</b>                You see what he did to me?!\n\n<b>                              AGENT HALLORAN\n</b>                Your problem is being handled right\n                now, Mr. Salv --\n<b>                              SALVANO\n</b>                Yeah? Well, it shoulda been\n                handled twelve hours ago. I don't\n                know who's running this outfit, but\n                somebody better get his goddamn wires\n                straight!\n<b>                              AGENT NEELEY                           *\n</b>                       (into phone)\n                -- yes, sir... yes, sir, I understand --\n<b>                              SALVANO\n</b>                That maniac should be wearing a\n                number, not a badge.\n      Salvano knows what the call is about. He straightens the\n      tie beneath his bruised neck, assuming the attitude of a\n      respectable citizen who has been unjustly wronged.\n<b>                              AGENT NEELEY                           *\n</b>                       (into phone)\n                -- count on it, sir. Right.\n                You'll have our full cooperation.\n      Neeley hangs up. Glances dubiously to Halloran. Then turns     *\n      grimly to Salvano, Chi Chi and the lawyer Abandano.\n\n<b>                              AGENT NEELEY                           *\n</b>                You're free to go.\n\n<b>130   OMITTED\n</b>\n<b>131   INT. FEDERAL BUILDING - LOBBY - NIGHT                          *\n</b>      The hoods and their lawyer smugly walk past a cleaning\n      woman.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         33A.\n\n<b>132   INT. PRECINCT CAPTAIN'S OFFICE - MORNING\n</b>      OPENING ON Agent Neeley's face. Composed, clean-cut, but      *\n      intense, wearing a light-colored business suit. PAN TO\n      Agent Halloran -- the same upright, clean-shaven bureau look.\n      The two men are seated to one side of LIEUTENANT FRED STROZAH.\n<b>133   NICO, JACKSON, LUKICH AND DEA AND ATF MEN\n</b>\n      sit and stand in various postures in front of the Lieutenant's\n      desk.\n<b>                              LIEUTENANT STROZAH\n</b>                       (to Nico, DEA &amp; AIF)\n                -- This is no reflection on the\n                work you officers have done. I\n                feel, and the whole department\n                feels, extremely proud of your\n                initiative and gallantry.\n      That \"spare me the horseshit\" look on Nico's face. He's\n      fuming. Strozah sees Nico's bitter expression. It's on\n      the others' faces too.\n<b>                                LIEUTENANT STROZAH\n</b>                As all of you   are well aware,\n                possession of   these explosives\n                is a federal   offense and under\n                jurisdiction   of the F.B.I.\n      Nico's eyes meet Lieutenant Strozah's. There's respect\n      between the two, but it's plainly under a helluva strain.\n<b>                              NICO\n</b>                Sir. With all respect to our\n                brothers in the Bureau --\n                       (biting sarcasm;\n                        turns to Neeley)                            *\n                -- That's no answer. It's no\n                answer to why one of the biggest\n                dealers in the city is out on the\n                street now, free as a bird!\n\n      Agent Neeley stiffens.                                        *\n<b>                              LIEUTENANT STROZAH\n</b>                Keep it in your pants, Nico.\n                These men have a job to do, just\n                like us.\n      Nico stifles his outrage. The other cops exchange glances\n      -- upset and angry. Agent Neeley clears his throat.          *\n\n<b>                              AGENT NEELEY                          *\n</b>                Lieutenant, I think these officers\n                are entitled to a fuller\n                explanation.\n<b>                              (MORE)\n</b><b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           34.\n\n<b>                              AGENT NEELEY (CONT'D)\n</b>                They've risked their lives. I\n                understand one man is in the\n                hospital.\n\n      He speaks to the officers.\n<b>                              AGENT NEELEY                            *\n</b>                What I'm about to say doesn't\n                leave this room. Is that clear?\n      Assent from everyone.\n\n<b>                              AGENT NEELEY                            *\n</b>                Mr. Salvano has been working for\n                some time in cooperation with\n                certain federal agencies.\n\n<b>134   CLOSE - NICO'S FACE\n</b>      Stunned and furious at this royal fuck-up.\n<b>                              AGENT NEELEY (O.S.)                     *\n</b>                I'm not at liberty to divulge\n                the nature of Mr. Salvano's\n                involvement -- I just learned of\n                its existence myself a few hours\n                ago. But one thing I can tell you --\n<b>135   BACK TO AGENT NEELEY                                            *\n</b>\n<b>                              AGENT NEELEY                            *\n</b>                Mr. Salvano's role is crucial to\n                an extremely sensitive ongoing\n                investigation. Any further\n                surveillance, harassment, or\n                unauthorized operations against\n                this individual are forbidden.\n                I must order you gentlemen --\n                       (looking straight at\n                        Nico)\n                -- with all respect for your work\n                and your courage, to stand down.\n\n      Lukich shakes his head; Nico is devastated.     Jackson takes\n      it all in.\n\n<b>                                                   CUT TO:\n</b>\n<b>136   INT. POLICE SQUAD ROOM - MORNING\n</b>      OPENING CLOSE ON a desk drawer being opened. Aside from\n      rounds of ammo, notes and an aging eggplant parmigiana\n      sandwich, there are half a dozen hand-labeled audio-\n      cassettes and a small collection of miniaturized bugging\n      devices. Jackson and Lukich watch Nico take out the\n      notes, hand them to Lieutenant Strozah.\n<b>\n</b>ABOVE THE LAW - Rev. 4/29/87                         35.\n\n<b>                       LIEUTENANT STROZAH\n</b>         The tapes too.\n\n<b>                       NICO\n</b>                (mocking)\n         That's my Lawrence Welk\n         collection!\n\n<b>                       LIEUTENANT STROZAH\n</b>         I want everything you got on this\n         one.\nReluctantly, Nico hands over the tapes.   The Lieutenant eyes\nthe bugs and wires.\n<b>                       LIEUTENANT STROZAH\n</b>         I know you don't give a shit\n         about yourself, Toscani.\n                (a glance to Jax)\n         But you're gonna put Jackson's\n         ass in a sling, too, with these\n         illegal wires.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                         35A.    *\n\n<b>136A   OTHER SIDE OF SQUAD ROOM\n</b>       Agent Halloran edges up to Jackson, who's grabbing coffee\n       on the far side of the squad room, and watching from there\n       as Nico gives Strozah more of a hard time.\n<b>                              AGENT HALLORAN\n</b>                What's the story on your partner,\n                Jackson? Did he learn this style\n                or was he born with a brick up his\n                ass?\n       Jackson checks Halloran out. He's black too and, despite\n       herself, there's a certain rapport.\n<b>                              JACKSON\n</b>                He has ethics. Unlike certain\n                others on this case.\n\n       Halloran watches the illegal bugs and tapes come out of\n       Nico's drawer.\n<b>                              AGENT HALLORAN\n</b>                His 'ethics' are gonna cost him\n                his badge and his gun.\n\n       This \"white\" talk gives Jackson a pain.   She slips into\n       her jive mode.\n<b>                              JACKSON\n</b>                You don't wanna catch him without\n                no gun.\n       Halloran's look asks why not?\n<b>                              JACKSON\n</b>                'Cause what he do with his hands...\n                make bullet holes look pretty.\n\n       Across the room, Nico turns over the tapes.\n<b>                              AGENT HALLORAN\n</b>                He bad?\n\n<b>                              JACKSON\n</b>                Bad bad.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          36.\n\n<b>137   INT. PRECINCT HOUSE - STAIRWAY - DAY\n</b>      Nico and Jackson come down the stairs. Jackson has had\n      ample excitement for her last week on the force.\n\n<b>                              JACKSON\n</b>                Is that enough? Can we do\n                something normal now -- like\n                eat lunch?\n\n<b>                              NICO\n</b>                Anything you say, Jax.   How\n                about Salvano's?\n\n<b>                              JACKSON\n</b>                Let it be, Nico.\n\n<b>138   EXT. PRECINCT HOUSE - DAY\n</b>\n      Nico and Jackson's car pulls out into traffic.\n<b>139   INT. UNMARKED CAR - PARKED (ALLEY BEHIND SALVANO'S)\n</b>      Jackson and Nico are eating some fast good.   Nico reaches\n      to his jacket pocket; takes out a cassette.\n\n<b>                              JACKSON\n</b>                What... you kept his tape, too?\n      Nico already has it in the PLAYER. We hear FRAGMENTS\n      of the telephone tap from the body shop in Spanish and\n      English. Jackson looks frustrated. Nico listens care-\n      fully to what appears to be the taped PHONE CONVERSATION.\n<b>                              NICO\n</b>                Poetry, ain't it?\n<b>140   EXT. REAR SALVANO'S RESTAURANT - DAY (POV FROM CAR)\n</b>\n      The pimp (busboy) comes out and dumps a load of garbage.\n<b>141   INT. UNMARKED CAR - DAY\n</b>\n      Nico and Jackson case the restaurant from down the alley.\n<b>142   EXT. REAR SALVANO'S - NICO'S POV - DAY\n</b>\n      From the restaurant door, Salvano and Chi Chi emerge.\n      They get into a black Cadillac and pull out.                 *\n<b>                              NICO (O.S.)\n</b>                And now for some dessert.\n\n<b>143   SERIES OF SHOTS\n</b>      As Nico's car tails Salvano's through various streets.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                          37.\n\n<b>144    EXT. OAK STREET\n</b>       Salvano comes out of a fancy flower shop with a bimbo on\n       his arm. He kisses her goodbye and puts her in a cab.\n\n<b>                               NICO (O.S.)\n</b>                 And that must be Mrs. Sal. So nice\n                 to see married couples still in love.\n\n<b>144A   NICO AND JACKSON\n</b>       are hidden, waiting.\n\n<b>144B   CHI CHI\n</b>       emerges from a dry cleaner's with a suit on a hanger.         *\n\n<b>145    EXT. ST. ELIZABETH'S PARISH CHURCH - DAY\n</b>\n       Salvano's Caddy   pulls up outside the same church where we   *\n       saw Nico's son   get baptized. Salvano and Chi Chi get out,\n       look both ways   up and down the street. Salvano, holding     *\n       flowers, makes   eye contact with a car down the block.       *\n<b>146    EXT. STREET UP BLOCK FROM CHURCH - DAY\n</b>\n       Nico's car backs out of sight around the corner.\n<b>147    SIDEWALK IN FRONT OF CHURCH\n</b>       Salvano and Chi Chi, seeing nothing, enter the church.\n<b>148    INT. CHURCH - DAY\n</b>       A smattering of older women and men praying. Salvano and\n       Chi Chi stop at the head of the aisle, genuflect to the\n       altar, move in, take seats toward the front.\n<b>149    BACK OF CHURCH\n</b>\n       Nico and Jackson slip in the front door, glide silently\n       into the shadows at the rear of the church.\n\n<b>                               JACKSON\n</b>                 This is your mother's church,\n                 isn't it?\n\n<b>                               NICO\n</b>                 Yeah. But I bet she's never seen\n                 these boys in the choir.\n<b>150    NICO'S POV\n</b>\n       Salvano's head is bowed, but Chi Chi is looking around\n       quite carefully. Nico and Jackson fade into the shadows\n       behind the huge pillars.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        37A.\n\n<b>151   SALVANO AND CHI CHI\n</b>      After a few moments, the pair rises. They cross them-\n      selves, start out for the front door. As they walk, they\n      continue to look for something.\n<b>152   INT. CHURCH - DAY                                           *\n</b>\n      Nico and Jackson emerge into a courtyard which reveals a\n      day care center and a rectory. They head toward the front\n      of the building. Jackson, planning on picking up their\n      tail on Salvano, is stoped by Nico. He wants to stay and\n      look around.\n<b>\n</b><b>                                                          38.\n</b>\n<b>                             FATHER GENARRO (O.S.)\n</b>               Nicola! That can't be you in\n               church without the family!\n\n      Nico turns to see Father Genarro, perspiring in a baggy\n      sweatshirt, a handball glove on his hand. The courtyard\n      alongside the church is marked off as an athletic area.\n\n<b>                             NICO\n</b>               Father Genarro.\n      The priest seizes Nico's hand warmly, smiles at Jackson.\n\n<b>                             FATHER GENARRO\n</b>               This must be your partner in\n               crime.\n                      (shakes her hand)\n               I'm Father Genarro. I saw you at\n               the baptismal party.\n                      (with a wink to Nico)\n               What a partner.\n<b>                             JACKSON\n</b>               Dolores Jackson\n                      (smiling, but\n                       impatient)\n               Nico, we gotta go --\n<b>                             FATHER GENARRO\n</b>               No, please --\n                      (more serious now)\n               It's good you stopped by. I have\n               to show you something. Please.\n      The priest begins leading Nico and Jackson. Jackson keeps\n      glancing back out the alley to see Salvano's car slowly\n      driving by.\n<b>153   INT. CHURCH BASEMENT - DAY\n</b>\n      This is an old building. The dark corridors resemble an\n      underground bunker. Old trophies and furniture are stored\n      along the walls. The two cops and the priest walk.\n      Another priest emerges from a door, nods, passes. Nico\n      and Jackson glance in through the door as they walk.\n      They reach a door with a broken handle. It looks like a\n      break-in has taken place.\n\n<b>                             FATHER GENARRO\n</b>               The rats are getting bigger.\n<b>                             NICO\n</b>               When did this happen?\n\n<b>                             FATHER GENARRO\n</b>               Two nights ago. I didn't call\n               the police.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                        39.         *\n\n      Father Genarro knocks on the door, pauses, then knocks\n      again. The door opens. A twelve-year-old who looks like\n      he's from Central America stands in the doorway.\n\n<b>                              FATHER GENARRO\n</b>                       (in Spanish)\n                It's all right, son. These are\n                friends.\n\n      The boy steps back and we MOVE INTO --\n<b>154   INT. CHURCH SANCTUARY - DAY\n</b>\n      A largish room, no exposed windows, everything boarded up.\n      Newly-constructed makeshift toilet and shower in one corner,\n      various cots. A number of LATIN REFUGEES -- families mostly\n      -- react shyly as Father Genarro introduces Nico and Jackson.\n      Sister Bonifacia is there, and a youthful priest, FATHER\n      TOMASSINO. We will see both of them again.\n<b>                              FATHER GENARRO\n</b>                       (referring to the cops)\n                These are friends.\n                       (to Nico)\n                This is Father Tomassino.\n\n<b>                             FATHER TOMASSINO\n</b>               How do you do?\n      Nico shakes the young priest's hand. There is a moment\n      between them as Nico meets Tomassino's eyes, liking what\n      he sees. The refugees are relieved, however, when Father\n      Genarro, Nico and Jackson take their leave.\n<b>155   NICO, JACKSON AND FATHER GENARRO\n</b>\n      continue down the hall.\n<b>                             JACKSON\n</b>               I didn't know this church was a\n               sanctuary, Father.\n<b>                            FATHER GENARRO\n</b>               Yes. But, perhaps not such a\n               safe one.\n<b>                             NICO\n</b>               How long have they been here?\n\n<b>                             FATHER GENARRO\n</b>               Too long. At least the kids can\n               go to our school.\n\n<b>                             NICO\n</b>               Who did it, Father?\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                 39A.\n\n<b>                       FATHER GENARRO\n</b>         Kids, maybe.\n                (significantly)\n         Maybe worse. It's not the first\n         time.\n<b>                       JACKSON\n</b>         We can have a car check by, every\n         hour.\n\n<b>                         FATHER GENARRO\n</b>         No... please.    Police frighten\n         these people.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          40.\n\n<b>156   INT. CHURCH - MAIN AISLE - DAY                              *\n</b>      The three are outside, taking their leave. A big smile\n      and a hand on Father Genarro's shoulder. The priest is\n      greatly relieved.\n<b>                             NICO\n</b>               Really, I don't mind coming by.\n\n<b>                             FATHER GENARRO\n</b>               Tell me, Nico... When was your\n               last confession?\n\n<b>                             NICO\n</b>               I'm a married man, Father.   I've\n               got no sins to confess.\n\n<b>                             FATHER GENARRO\n</b>               You're a police officer, you have\n               many sins to confess.\n<b>                             JACKSON\n</b>               Amen.\n      Nico and Jackson start off.\n\n<b>                              FATHER GENARRO\n</b>                       (calls after Nico)\n               You come back Sunday. I feel\n               better when I see Nicola in\n               church.\n                       (calls louder)\n               You don't show, I'm phoning your\n               mother!\n<b>                                                   DISSOLVE TO:\n</b><b>157   SAME CHURCH - POV FROM WINDOW - EARLY MORNING (SUNDAY)\n</b>\n      HIGH ANGLE FROM ACROSS the street: neighborhood people\n      dressed in their Sunday best fill the sidewalk, filing in\n      for Mass. We hear an ORGAN from inside the church.\n\n<b>158   VARIOUS ANGLES - CONGREGATION\n</b>      An Italian neighborhood becoming more Hispanic. As the\n      churchgoers file in, we see families -- women, kids,\n      babies.\n\n<b>159   NICO, SARA, ROSA AND JULIAN                                 *\n</b>      are among the crowd, exchanging pleasantries with friends\n      and neighbors -- in English, Italian and Spanish.\n\n<b>160   INT. CHURCH - SIDE AISLE\n</b>      Sara, holding Julian, slips into a pew. As Nico and Rosa    *\n      follow, Father Genarro passes, heading for the front.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                             41.\n\n<b>                               ROSA\n</b>                 Father Genarro! I have you to thank\n                 for getting my son back into church!\n\n<b>                               FATHER GENARRO\n</b>                 It's amazing what shame can\n                 accomplish.\n\n      Father Genarro smiles and continues on toward the pulpit.\n\n<b>                                          QUICK DISSOLVE TO:\n</b><b>161   VARIOUS SHOTS\n</b>\n<b>      A)   THE CHOIR\n</b>           building to the finish of a hymn.\n\n<b>      B)   NICO'S WIFE (SARA)                                        *\n</b>           also singing, balancing baby Julian and a hymnbook.\n<b>      C)   NICO AND HIS MOTHER ROSA\n</b>           sing with full gusto.\n\n<b>      D)   THE CHOIR MASTER\n</b>           makes the sign to be seated.\n<b>      E)   CONGREGATION\n</b>           sits. We notice a   young, intellectual-looking man\n           (Alan Singletary)  wearing wire-rim glasses, sitting in\n           the front row. We   will see his face again later. He\n           looks out of place  and glances around, surprised as...\n<b>      F)   FATHER GENARRO\n</b>\n           moves into the pulpit, opens his Bible.\n<b>                               FATHER GENARRO\n</b>                 In nomine patris, filius et\n                 spiritu sancti... (etc)\n<b>162   SARA AND JULIAN                                                *\n</b>\n      The little one starts to CRY; she comforts him. Nico\n      reaches over to try to help. The BABY continues FUSSING.\n      Nico looks toward the priest and the front of the church.\n      He notices a woman in a black shawl rise from the front\n      of the church and turn, heading down one of the side\n      aisles.\n\n<b>                               SARA                                  *\n</b>                        (examines Julian's\n                         diaper)\n                 Way to go, Julian -- perfect timing.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           42.\n\n      She cynically smiles at Nico. Nico sees the woman in\n      black pass toward the exit of the church.\n\n<b>163   CLOSEUP - WOMAN\n</b>\n      It is the same woman Nico and Jackson were following with\n      Abandano, the lawyer!\n\n<b>164   CLOSEUP - LARGE SHOPPING BAG\n</b>\n      The woman has left it in front of the votive candles\n      directly before the priest's pulpit.\n\n<b>165   CLOSEUP - NICO\n</b>      His head spins from the shopping bag to the doorway --\n\n<b>166   NICO'S POV - DOORWAY\n</b>\n      The woman is hastily sneaking out.\n<b>167   BACK TO NICO\n</b>      Instantly he pushes his family to the floor, covering\n      them with his body.\n\n<b>168   CLOSEUP - NICO - SECOND LATER\n</b>      BOOM!!!    A POWERFUL EXPLOSION erupts between the priest\n      and his   congregation. Fragments of plaster, wood, and\n      marble   come blasting past Nico and his family! Churchgoers\n      in the   first rows are blown off their feet by the shock\n      wave of   the blast. Pews overturn, smoke everywhere --\n<b>169   CHOIR\n</b>\n      is shrieking hysterically. Stone and plaster dust rain\n      down on them from the ceiling.\n\n<b>170   CONGREGATION\n</b>      is in total pandemonium.   Screams, cries, panic --\n\n<b>171   PULPIT\n</b>      has been blown to oblivion. Where Father Genarro had\n      been standing is now nothing but smoke and rubble.\n\n<b>172   NICO\n</b>      Prone, covering Sara and the baby, groping frantically         *\n      to protect his mother as well.\n\n<b>                               SARA                                  *\n</b>                        (clutching baby)\n                 We're okay! We're okay!\n\n      Nico checks them and his mother swiftly.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           43.\n\n<b>                              ROSA\n</b>                       (in Italian)\n                Help the others! Help them, Nico!\n\n<b>                                                 CUT TO:\n</b><b>173   STATUE OF JESUS\n</b>\n      Splattered with real blood.\n\n<b>                                                 CUT BACK TO:\n</b><b>174   ANGLE ON CONGREGATION\n</b>\n      Everyone is down, reeling from the concussion, dust and\n      smoke. Nico rises alone from this scene.\n\n<b>                              NICO\n</b>                       (forcefully)\n                Help each other move outside.   Be\n                calm.\n<b>175   EXT. SIDE OF CHURCH - MORNING\n</b>      From a doorway and a shattered window smoke pours forth.\n      We hear SCREAMS from inside.\n<b>176   INT. CHURCH\n</b>      Nico on his feet, plainly the leader in this moment of\n      terror. Worshippers, shattered and bleeding, pour past\n      him toward the door. Nico grabs a stout-looking church-\n      goer.\n<b>                              NICO\n</b>                Call 911. Tell 'em to send\n                everything they got!\n                       (turns to his wife)\n                Sara, get the baby and Mama                        *\n                outside.\n      Nico starts for the altar where the damage is worst.\n\n<b>177   EXT. FRONT OF CHURCH - MORNING\n</b>      The congregation streams out in terror-stricken disarray.\n      We see Nico's family -- they're all right.\n\n<b>178   NICO\n</b>      appears from the church, carrying a young choir girl. He\n      hands the child over to two older women, races back into\n      the church.\n\n<b>179   LONG SHOT - STREET OUTSIDE CHURCH\n</b>      The first paramedic van comes speeding around the corner,\n      SIREN BLARING. Police cars appear right behind --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            44.\n\n<b>180   INT. CHURCH\n</b>      Nico appears through the backlit smoke and kneels over\n      the bloodied body of Father Genarro. He desperately tries\n      to maintain the priest's life.\n<b>                                                    CUT TO:\n</b>\n<b>181   INT. HOSPITAL/ICU WARD - AFTERNOON\n</b>\n      The aftermath of the blast. Doctors and nurses have the\n      scene more of less under control, but there's still plenty\n      of pain and misery.\n\n<b>182   INT. HOSPITAL ROOM - AFTERNOON\n</b>      Nico stands, his back to the wall -- a scary, blank look\n      on his face. A doctor and several nurses are pulling the\n      plugs on the terribly mutilated body of Father Genarro.\n      A nun is crying; a fellow priest is blessing the Father.\n<b>183   JACKSON\n</b>      arrives.   Nico talks to her, aside.\n<b>                               NICO\n</b>                 I want a list of everyone that's\n                 been treated here today. Everyone.\n<b>                                JACKSON\n</b>                 Right.\n<b>                               NICO\n</b>                 Then find those sanctuary people,\n                 the ones we saw in the church\n                 basement --\n      As Jackson makes notes.\n\n<b>                               NICO\n</b>                 Find out where they're from, why\n                 anyone would want to harm them.\n\n      Jackson flips her notepad shut, ready to go.\n<b>                               JACKSON\n</b>                 Where are you gonna be?\n\n<b>                               NICO\n</b>                 Just stay near a radio.   I'll find\n                 you.\n\n<b>184   INT. HOSPITAL CORRIDOR - NICO'S MOTHER (ROSA) - AFTERNOON\n</b>\n      Sits on a bench with a bandage over one eye. Sara             *\n      and Julian are sleeping beside her. Nico kneels beside\n      his mother, deeply concerned. Nico takes his mother's\n      arm, helps her to her feet.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        45.\n\n      Sara wakes and picks up Julian. Mama knows Father Genarro     *\n      has died. She begins sobbing softly. Other members of\n      the congregation are in the hallway, mourning. Nico, with\n      his family, takes several steps toward the exit. Suddenly,\n      Nico stops. He sees Agent Neeley entering (the FBI man who    *\n      ordered him off the case) accompanied by Lieutenant Strozah   *\n      and two uniformed officers.\n\n<b>                              NICO\n</b>                Sara... go down to the car; I'll                    *\n                be with you in a minute.\n      He hails Neeley.                                              *\n\n<b>                              NICO\n</b>                I need to talk to you.\n                       (a glance to Strozah\n                        and others)\n                ... Alone.\n      Neeley nods. Nico leads him off the corridor, through a       *\n      fire exit door --\n<b>185   STAIRWELL LANDING\n</b>      The door closes behind them. Nico and the FBI man are\n      alone on the stairway landing.\n<b>                              AGENT NEELEY                          *\n</b>                       (impatient)\n                What the hell is it, Toscani?\n      Without warning, Nico grabs Neeley by both lapels, slams      *\n      him furiously into the wall!\n<b>                               NICO\n</b>                You.   That's what the hell it is!\n<b>                              AGENT NEELEY                          *\n</b>                Get your goddam hands off me!\n      Neeley tries to shake free; Nico won't let him.               *\n\n<b>                              NICO\n</b>                You let Salvano walk.\n<b>                              AGENT NEELEY                          *\n</b>                Salvano?! Are you crazy?\n                       (rips himself free)\n                What does he have to do with this?\n<b>                              NICO\n</b>                That was no cherry bomb in there.\n                That was C-fucking-4!\n                       (struggles to master\n                        his rage)\n                I've used that shit.\n<b>                              (MORE)\n</b><b>\n</b>ABOVE THE LAW - Rev. 4/29/87                        46.\n\n<b>                       NICO (CONT'D)\n</b>         I know what it smells like, I know\n         what it blows like --\n\nNeeley glares at Nico.                                    *\n<b>                       AGENT NEELEY                       *\n</b>         Salvano never came near that C-4.\n         It's in federal holding now!\n         Besides, why would he blow up a\n         church?\n<b>                       NICO\n</b>         I tailed Salvano. Two days ago.\n         Him and one of his apes were in\n         that church -- and they weren't\n         taking communion. I saw some broad\n         saw who was with his lawyer plant\n         the bomb. Now I want some goddamn\n         answers.\n<b>                       AGENT NEELEY                       *\n</b>         You tailed him? After I ordered\n         you off?\n<b>                         NICO\n</b>         Where is he?    Where's Salvano?\n<b>                       AGENT NEELEY                       *\n</b>         My orders were release him.    Not\n         babysit him.\nNeeley brushes Nico's fingermarks off his lapels.         *\n<b>                       AGENT NEELEY                       *\n</b>         You think you're rough stuff,\n         Toscani -- martial arts hero, chop\n         suey crap. Well I'll tell you\n         something: you're not bullet-\n         proof. You're not even a good\n         cop.\n                (composes himself;\n                 reclaims his dignity)\n         You sneak around, playing your\n         street dick games. But all you\n         come up with is conjecture, wild\n         coincidence and bullshit.\n\n<b>                       NICO\n</b>         I want the agent who signed for\n         the explosives.\n\n<b>                       AGENT NEELEY                       *\n</b>         I'll do my job. You do yours.\n<b>                       NICO\n</b>         Bank on it, pal.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                           47.\n\n      Nico stalks off.   The door slams.\n<b>                                                  CUT TO:\n</b>\n<b>186   MONTAGE WITH SCORE\n</b><b>      A)   EXT. \"BOGOTA\" (SALVANO'S RESTAURANT) - LATE AFTERNOON      *\n</b>\n           Nico's unmarked car whips in front.   Nico storms toward\n           the front door of the restaurant.\n<b>      B)   INT. RESTAURANT - LATE AFTERNOON                           *\n</b>\n           Nico storms through toward the restaurant rear. The\n           employees are getting ready for the evening crowd. He\n           flashes his badge, checks the kitchen, Salvano's\n           office.   The man is gone.\n\n<b>      C)   INT. MORGUE - LATE AFTERNOON\n</b>           Jackson has her list from the hospital.    A coroner and\n           his assitant show her a body on a slab.    The body is\n           that of Alan Singletary, the man we saw   in the front     *\n           row of the church. Jackson takes notes.     The dead man   *\n           is definitely not the ethnic type you'd   expect in St.\n           Mary's congregation.\n<b>      D)   EXT. BODY AND FENDER SHOP - LATE AFTERNOON\n</b>           The same place where Nico and Jackson wire-tapped Chi\n           Chi. Nico interrogates the shop boss, several workers.\n           All shake their head, gesture emphatically. Salvano\n           not here.\n<b>      E)   CUT BACK TO MORGUE - JACKSON\n</b>\n           takes Polaroids of the dead man's I.D. and personal\n           effects.\n\n<b>187   CLOSEUP OF DEAD MAN'S EFFECTS\n</b>      as Jackson's flash pops. We see clearly a U.S. Senate\n      staff ID, a U.S. Senate office building parking pass and\n      an Illinois driver's license with address.\n<b>188   EXT. AFFLUENT BROWNSTONE - LATE AFTERNOON\n</b>\n      Nico comes storming out. A Maid and a bodyguard follow\n      after him screaming. The door slams. We see it is\n      missing a panel.\n<b>                              MAID\n</b>                You gonna be in real trouble,\n                mister, when El Senor Salvano\n                find out about dis.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            48.\n\n<b>189   EXT. ST. ELIZABETH'S CHURCH - LATE AFTERNOON\n</b>      Jackson at the blast scene. Police tapes rope the area\n      off while a TV news crew photographs the damage. Jackson       *\n      talks with neighborhood people, asking questions.\n<b>190   EXT. BICEK'S BAR - LATE AFTERNOON\n</b>\n      Nico in the alley, grilling several tough guys we saw be-\n      fore when he raided this bar. The answers are all zero;\n      Nico's disgusted, worn out, frustrated. He starts out\n      the alley -- At the edge of the street, a battered van pulls\n      in. A jacketed LATINO MAN leans against it, an unlit ciga-\n      rette in his mouth. As Nico approaches, turning toward\n      his car --\n<b>                                 FIRST LATINO\n</b>                          (polite, casual)\n                   'Cuse me, sir. Can I bum a light?\n      Nico slows, eyeing the   guy dubiously. As he reaches to\n      his jacket -- The side   door of the van flashes open. A\n      .38 is leveled straight   at Nico's head. Instantly three\n      other Latino hoods leap   to the sidewalk.\n<b>                                 FIRST LATINO\n</b>                          (machete under jacket)\n                   Don't even think about it,\n                   motherfucker.\n      Machete Man (First Latino) snatches Nico's gun from its\n      shoulder holster. Two hoods shove Nico back into the\n      alley. Nico checks out his assailants quickly. Four of\n      them. Machete, CROWBAR, BALL BAT, GUN.\n<b>                                 MACHETE MAN (FIRST LATINO)\n</b>                   You come to our streets... fuck\n                   with our people. Now our people\n                   gonna fuck with you.\n\n      The five advance on Nico.\n<b>                                 PIPE MAN\n</b>                   We ain't gonna shoot you, man.\n                   We gonna beat you to death. You\n                   gonna learn what it means to 'get\n                   down.'\n\n<b>191   QUICK CUTS\n</b>      A)   Nico is  trapped. The hoods advancing. Nico has a\n           moment  of stillness, as if all senses are clicking\n           out of  normal gear and into some hyper-combat readi-\n           ness.   Then:\n<b>\n</b><b>                                                           49.\n</b>\n      B)   Gun and Machete Man are side by side. As Machete Man\n           starts to move, Nico spins in beside him, seizes his\n           wrist, twists it violently, wrenching the machete away,\n           keeping Machete Man between him and Gun Man so Gun\n           Man can't shoot. In a flash, Nico swings the machete,\n           slicing over the top of Machete Man, half-severing\n           the wrist of Gun Man. Gun Man falls, clutching his\n           wrist in agony; the gun skitters away beneath a chain\n           link fence, out of reach. Nico flips Machete Man\n           (who has Nico's gun in his pocket) sending him crash-\n           ing, half-unconscious.\n      C)   Instantly, Pipe Man aims a home run shot at Nico's\n           head. Nico uses the machete, matches the angle of\n           the oncoming blow, slides under and, in the same arc,\n           blocks the blow and turns it into a strike, slashing\n           Pipe Man's tendons behind the knee. Pipe Man goes\n           down on one knee, writhing, hamstrung, crying out in\n           pain.\n      D)   Now Ball Bat attacks. Nico intercepts the blow,\n           flips Bat Man ass over teakettle, sending him sail-\n           ing -- feet first -- through the side window of the\n           van. Bat Man CRASHES THROUGH the GLASS, hung up with\n           just his head and shoulders dangling free.\n\n      E)   Nico is spread out, feet wide, in a crouch. Crowbar\n           Man sees his chance. He is the fiercest of the four,\n           and the savviest fighter. He throws three consecu-\n           tive vicious blows at Nico's head; Nico drops to one\n           knee, dodges the blows, then intercepts the third,\n           machete in hand, matches the arc of interception and\n           whips the blade up -- straight into the crotch of\n           Crowbar Man. Crowbar Man can't believe it. He re-\n           mains frozen a moment, staring at Nico, then down at\n           his own groin.\n      F)   Machete Man, the first to be flipped, struggles des-\n           perately to regain his senses. He tries to get\n           Nico's gun from his own pocket, but Nico bats it a-\n           way. Machete Man scrambles to his feet, in terror,\n           bolts.\n\n      G)   Nico snatches his gun from the sidewalk, glances to\n           Bat Man who is still half-dangling from the van\n           window. Nico gives Bat Man one parting punch to the\n           head, then tears off after Machete Man --\n\n<b>192   EXT. STREET - DAY\n</b>      Shrieks from passersby as Machete Man hurtles past,\n      straight into the street. A car nearly hits him, he\n      vaults its hood. Here comes Nico, in hot pursuit. He\n      too leaps the car, whose owner is staring, cursing --\n<b>193   ANGLE DOWN BLOCK\n</b>\n      An all-out foot face.\n<b>\n</b><b>                                                             50.\n</b>\n      Machete Man is a speedster; he hurdles a row of trash cans.\n      TWO YOUNG GIRLS, on a stoop, whistle as he passes.\n\n<b>                             FIRST GIRL\n</b>                Fly, baby!\n<b>194   NICO\n</b>\n      tears after this human cannonball.   Amazingly, he's\n      gaining --\n<b>195   INT. BODEGA - DAY\n</b>\n      Machete Man highballs off the sidewalk, straight into a\n      Mom and Pop groceria. Customers scatter in shock as the\n      hood blasts past them, out the back door. Here comes\n      Nico. Patrons curse in Spanish as he barrels past --\n\n<b>196   EXT. YARD BEHIND BODEGA - DAY\n</b>      Machete Man bolts from the bodega into a small patio with\n      tables and chairs. He leaps the fence into the next yard,\n      which belongs to a funeral home. He hurdles the headstone\n      inventory, clambers up the fence on the far side --\n<b>197   BACK TO NICCO\n</b>      pursuing along the same route.\n<b>198   MACHETE MAN\n</b>\n      claws his way to the top of the fence and onto a frame-\n      work of two-by-fours which form an arbor-like canopy a-\n      bove the third back yard. Plastic sheeting is tacked\n      between the beams. Machete Man glances back at Nico,\n      starts out -- tightrope-style -- across the two-by-fours.\n      Nico reaches the fence behind the hood, starts also onto\n      the two-by-fours. We hear FEMALE SCREAMS from below as\n      the rickety structure starts to wobble precariously.\n      Machete Man reaches the far side. A fire escape is ad-\n      jacent; he grabs for it, starts up. Nico catches him by\n      the ankle. The two crash together back onto the two-by-\n      fours, which give way, sending them plunging into --\n\n<b>199   BACKYARD OF FLOWER SHOP - DAY\n</b>      Four young Oriental women, potting plants, react with\n      terror as the two bodies CRASH through. Machete Man\n      scrambles away from Nico but is trapped in the corner\n      next to the rear shop door. The flower girls can't move\n      either; Nico and the hood are too near the door. The\n      girls retreat to the far corner, squealing in fright.\n\n<b>                              MACHETE MAN\n</b>                       (to Nico, in terror)\n                No, hermano. Please --\n<b>\n</b><b>                                                      51.\n</b>\nNico starts menacingly toward the hood, breathing hard\nfrom the chase.\n\n<b>                           NICO\n</b>             Who put up the money?\n<b>                            MACHETE MAN\n</b>             What money?\n\nNico grabs him by the hair.\n<b>                           NICO\n</b>             You didn't come after me for a\n             piece of ass.\n                    (twists the youth's\n                     neck)\n             Who paid you?\n\n<b>                             MACHETE MAN\n</b>             I told ya!    No one!\nNico slams him with a fierce shot to the ribs. The hood\ndoubles over, gasping. The flower girls shriek even\nlouder. Nico turns to the girls with a ferocious glare.\n<b>                           NICO\n</b>                    (shouting)\n             Shut up!\nThe girls instantly go silent in terror. Nico turns back\nto Machete Man, spins him violently face-down, jacking\nthe punk's right arm straight out behind him. We see\nthat Nico can break his elbow with one blow.\n<b>                          NICO\n</b>                   Give it to me!\nNico raises his fist to strike.\n\n<b>                           MACHETE MAN\n</b>             Jimmy Constanza!\nNico shoves the hood into the ground, tearing the hood's\nwallet from his trouser pocket. Nico rips the wallet a-\npart, seizes the kid's identification and holds it up. He\ngrabs the punk by the hair with his free hand. Machete\nMan is staring up in terror, wondering what this means.\n\n<b>                           NICO\n</b>             If you're lying to me, I'll come\n             and kill you right in your own\n             fucking kitchen.\n\nNico dumps him on the ground and walks away.    Instantly\nMachete Man changes his tune.\n<b>                            MACHETE MAN\n</b>             Salvano!   Bautista Salvano!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            52.\n\n      Nico walks back, his foot smashes into the punk's face.\n      He hits the ground with a thud.\n\n<b>                               NICO\n</b>                 Gracias, muchacho.\n      Nico walks away.\n\n<b>200   MONTAGE WITH SCORE\n</b>\n<b>      A)   INT. NICO'S HOUSE - KITCHEN - NIGHT\n</b>           Nico at the kitchen table spread with notepads, old add-\n           ress books, 3X5 cards. He's on the phone, impatient,\n           apparently getting nowhere. He slams the phone down.\n<b>      B)   INT. LIVING ROOM - EVENING\n</b>\n           Nico paces, phone cradled to ear, talking urgently.\n           CLICK: he's been hung up on; he looks at the receiver\n           in frustration and disgust.\n<b>      C)   CLOSE - CORKBOARD ON KITCHEN WALL\n</b>           Nico's hands pushpin a 3X5 card into the wall.\n\n<b>      D)   INSERT - 3X5 CARD\n</b>           We read: \"FBI / Agent Smith / 11:53 / B.S. / Covering\n           for who?\"\n\n<b>      E)   KITCHEN - NIGHT\n</b>           Nico back at the table, listening to the wiretap\n           tape, transcribing it.\n\n<b>      F)   ANOTHER ANGLE - KITCHEN - NIGHT (LATER)\n</b>           Nico holds Julian, goes over notes.\n\n<b>      G)   CLOSE - YELLOW LEGAL PAD\n</b>           The page is headed: \"FATHER GENARRO.\" Below in\n           doodle formation, are a series of boxes, each one\n           containing a phrase. We read: \"Father G had some-\n           thing on Salvano?\" \"Church break-in?\" \"Drug infor-\n           mation?\" \"Father G connected to FBI?\" Irritably,\n           Nico's pencil crosses everything out.\n\n<b>201   SARA                                                            *\n</b>      Appears in a nightgown at the kitchen doorway.   She looks\n      frail, frightened. MUSIC ENDS.\n\n<b>                               SARA                                   *\n</b>                        (softly)\n                 I can't sleep. Will you come and\n                 hold me?\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         53.        *\n\n<b>                              NICO\n</b>                Of course I will. I've been waiting\n                to hear from Jax. She was supposed\n                to get back to me by now.\n\n<b>202   INT. NICO'S BEDROOM - LATE NIGHT\n</b>      Nico comes in with his arms around Sara. She stops\n      near the bed, holds him tight. They look to little\n      Julian sleeping in the crib nearby.\n<b>                              SARA\n</b>                Thank God you couldn't find your\n                shoes. We would of have been\n                sitting in the front row.\n                       (beat)\n                Alright, I know the rules -- I\n                don't ask you don't tell. But\n                could've died today and I deserve\n                to know.\n                       (beat)\n                Why did we go to church this\n                morning?\n<b>                              NICO\n</b>                I'm willing to break   the rules;\n                I'm willing to tell   you whatever\n                I know. But I need    some time.\n                Could you just give   me some time?\n      Nico leans to kiss her, but is cut off by the HARSH RING\n      of a PHONE. Sara starts at the sound. She and Nico\n      glance at each other --\n<b>                              SARA\n</b>                I'll bet that's her.\n      Nico picks up the phone.\n\n<b>                              NICO\n</b>                       (into phone)\n                This better be good, Jax.\n\n<b>                              MAN (V.O.)\n</b>                       (filtered)\n                It's bad, Nico.\n\n      Nico glances to Sara. The voice on the   phone is not\n      Jackson. Nico is chilled. He glances    to Sara, finger to\n      his lips. He points to his bare wrist   as if wanting to know\n      the exact time. Sara, not sure what's   going on, mouths:\n      \"Two-fifteen.\"\n\n<b>                              NICO\n</b>                       (into phone)\n                Long time, Nelson.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         54.\n\n<b>203   EXT. STREET - PHONE BOOTH - LATE NIGHT\n</b>      We recognize Fox, Nico's buddy  from SE Asia whom we met\n      in the opening sequence.  Fox,  too, of course, looks 15\n      years older. He wears a  suit  and seems quite prosperous.\n      We are unable to identify from  where Fox calls.\n<b>                              FOX\n</b>                You should know not to use a name\n                on an open line.\n                       (beat)\n                I'm gonna talk for fifteen\n                seconds, then I'm getting off.\n                You're in trouble, Nico.\n<b>204   BACK TO NICO'S BEDROOM - LATE NIGHT\n</b>\n<b>                              FOX (V.O.)\n</b>                       (filtered)\n                Serious, serious trouble. Take\n                your wife and family and get them\n                someplace safe now.\n<b>205   BACK TO STREET - PHONE BOOTH - LATE NIGHT\n</b><b>                              FOX\n</b>                You hear me? Now. I'm risking my\n                ass by telling you this. Good\n                luck, kid.\n<b>206   BACK TO NICO'S BEDROOM - LATE NIGHT\n</b>      The PHONE CLICKS DEAD. Nico tries to keep a casual ex-\n      pression. Sara sees through it -- she knows he's shaken.     *\n<b>                              SARA                                 *\n</b>                       (grim)\n                That was Fox, wasn't it?\n\n      Nico doesn't answer.\n<b>                              SARA                                 *\n</b>                       (very concerned)\n                Why is the C.I.A. calling you at\n                two in the morning?\n<b>                              NICO\n</b>                It's okay, sweetheart --\n                       (crosses to her, puts\n                        his arms around her)\n                -- You know what a crazy bastard\n                Fox is. He gets drunk and forgets\n                he's halfway around the world. He\n                calls me.\n      Nico gives her a squeeze and a smile.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        55.\n\n<b>                              NICO\n</b>                He just wanted to make sure we got\n                his Christmas card.\n\n<b>207   INT. BEDROOM - LATER\n</b>      Sara is sleeping next to Nico. Julian next to her. A         *\n      LOUD POUNDING comes O.S. from the front door. Nico jumps\n      out of bed. His gun appears in his hand, as if from nowhere,\n      he steps quickly to the front window, looks out --\n<b>208   NICO'S POV - STREET BELOW\n</b>\n      Two unmarked cars pull in.\n<b>209   BACK TO NICO\n</b>\n      He moves swiftly to the rear window and spots another un-      *\n      marked car.                                                    *\n<b>210   INT. DOWNSTAIRS - FRONT DOOR\n</b>      Nico enters the vestibule in his pajama bottoms with his gun\n      in his hand.\n<b>                              VOICE THROUGH DOOR (O.S.)\n</b>                F.B.I., Toscani. Open up.\n      Nico pulls aside a curtained glass panel; he recognizes\n      two uniformed police officers, plus Neeley and Halloran,       *\n      the FBI agents who authorized the release of Salvano. He\n      lowers his gun, opens the door. The cops surge in.\n<b>                               NICO\n</b>                        (to one of cops)\n                It's a little early for breakfast,\n                O'Hara.\n<b>                              O'HARA\n</b>                Sorry, Nico.\n                       (displays warrant)\n                You're under arrest.\n\n<b>                              AGENT NEELEY                           *\n</b>                       (reaches for Nico's\n                        gun)\n                I'll take this, thank you.\n\n      Before Neeley can get his hand on the gun, Nico, without       *\n      pausing, hands it over to another agent.\n<b>                              NICO\n</b>                No, you won't. I'm gonna give it\n                to you.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         56.\n\n<b>211   INT. NICO'S BEDROOM - NIGHT\n</b>      JULIAN BAWLS fearfully; Sara holds him, trembling. Nico         *\n      is hurriedly getting dressed. A cop and the FBI agents\n      stand at the door.\n<b>                              SARA                                    *\n</b>                       (to cops; distraught)\n                This is ridiculous -- there's\n                no need for this!\n<b>                              NICO\n</b>                It's all right, darling.\n\n      Two agents enter the room carrying Nico's confiscated\n      papers and tapes and begin rummaging through dressers,\n      jewelry boxes and closets. Rosa crosses swiftly to calm\n      Sara.                                                           *\n\n<b>                              ROSA\n</b>                       (to cops)\n                Who do you think you are --\n                coming in here like this,\n                treating my son like a criminal?\n<b>                              SARA                                    *\n</b>                Why are you terrifying us?\n                There's an infant here!\n      Nico pulls on a jacket. He looks like he could kill.    He\n      restrains himself for his family's sake.\n<b>                              AGENT HALLORAN\n</b>                       (to cops)\n                Check that coat.\n\n      The cops cross to frisk Nico.   Sara, still holding the baby,   *\n      starts slapping at them.\n\n<b>                              SARA                                    *\n</b>                Get your hands off him!\n      Rosa grabs Sara --                                              *\n\n<b>                              NICO\n</b>                       (to Sara,                                      *\n                        allowing himself\n                        to be frisked)\n                It's all a mistake, Sara -- It's                      *\n                gonna be all right.\n      The cops steer Nico toward the door.\n\n<b>                              SARA                                    *\n</b>                       (calls after them)\n                The Police Association's got lawyers\n                for this, you bastards!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            57.\n\n      Sara grabs for the phone; Nico is manhandled out the            *\n      door --\n\n<b>212   EXT. NICO'S HOUSE - LATE NIGHT\n</b>\n      The neighbors are now on their porches.   Nico is led to a\n      waiting unmarked car.\n\n<b>                                                  CUT TO:\n</b>\n<b>213   INT. POLICE HEADQUARTERS - LATE NIGHT\n</b>      Bad Dude, the bartender we remember from Nico's first\n      visit to the Polish bar, finishes signing a deposition.\n      A cop takes the paper. Bad Dude stands, glances half-\n      fearfully, half-defiantly to Nico, who is led down a hall-\n      way flanked by two uniformed officers. Agent Halloran\n      opens the door for Bad Dude, who exits.\n\n<b>214   INT. INTERROGATION ROOM - LATE NIGHT\n</b>      Neeley, Halloran, Lieutenant Strozah and Deputy Superinten-     *\n      dent JACK CROWDER. Halloran indicates a stack of                *\n      depositions, tapes and notes on the table before Nico.\n<b>                             AGENT HALLORAN\n</b>               Illegal wiretaps. Unauthorized\n               surveillance.\n<b>                             NICO\n</b>               When were you born, asshole?\n<b>                             AGENT NEELEY                             *\n</b>               Associating with known felons.\n               Disobeying direct orders --\n\n<b>                             NICO\n</b>               Where's Jackson?\n\n<b>                             CROWDER                                  *\n</b>               She's outa this.\n<b>                             AGENT HALLORAN\n</b>               You're the rotten apple in this\n               barrel, Toscani. We don't have\n               to look any farther than you and\n               your 'family.'\n\n      Nico comes out of his chair, going for Halloran.      Strozah\n      tries to block him, but it's useless.\n<b>                             LIEUTENANT STROZAH                       *\n</b>               Nico! You damn fool! You wanna\n               go to prison?!\n      Nico stops. He's speechless with rage.    His finger points\n      toward Halloran like a loaded gun.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           58.\n\n<b>                             CROWDER                               *\n</b>                      (indicates more\n                       depositions)\n               Unlawful entry. Illegal search\n               and seizure --\n<b>                             NICO\n</b>                      (spits on papers)\n               You'll never build a frame on this\n               chickenshit.\n<b>                             AGENT NEELEY                          *\n</b>                      (angrily)\n               You were ordered to back off on\n               Salvano. But you had too big a\n               hard-on for that, didn't you--\n\n      Nico contains his fury. He steps away from Strozah, with\n      a gesture that says \"I won't hurt you.\"\n<b>                              NICO\n</b>                       (to Strozah)\n               Fred.   You can't be in on this.\n      Nico faces his lieutenant -- a look that calls on long       *\n      years of comradeship and loyalty. Strozah is torn. He's\n      a good man, over his head in a situation he doesn't com-\n      pletely understand.\n<b>                             LIEUTENANT STROZAH                    *\n</b>               You're officially suspended, Toscani.\n               I want your tin... and your iron.\n      Neeley leans past Nico; drops Nico's gun (with an evidence   *\n      tag on it) onto the table. Nico looks to Strozah, who\n      averts his eyes. Nico flips his badge onto the table.\n<b>                             NICO\n</b>               You holding me?\n\n<b>                             AGENT NEELEY                          *\n</b>               You can walk for now. But don't\n               walk far.\n\n<b>                                                   CUT TO:\n</b><b>215   EXT. PHONE BOOTH ON DOWNTOWN STREET - DAWN\n</b>\n      We are outside of a cop breakfast hangout. Several police\n      cars are parked in the lot. Nico is on the phone.\n<b>                             NICO\n</b>               Sara, I'm okay. I love you.                         *\n\n<b>                                                   CUT TO:         *\n</b><b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                           58A.\n\n<b>215A   INT. NICO'S KITCHEN                                           *\n</b>       Sara on the phone.                                            *\n\n<b>                               SARA                                  *\n</b>                 Where are you? Why aren't you                       *\n                 coming home?                                        *\n\n<b>                                                    CUT TO:          *\n</b>\n<b>215B   EXT. PHONE BOOTH                                              *\n</b><b>                               NICO\n</b>                 I'll be home later. Lukich will                     *\n                 be there. Tell mama not to worry.\n       Jackson and Lukich are waiting by Nico's car.    They see\n       Nico emerge from the phone booth.\n\n<b>                                                    CUT TO:\n</b><b>216    EXT. STREET - NICO, JACKSON AND LUKICH - DAWN\n</b>       A mood of urgency.\n<b>                               JACKSON\n</b>                 -- I found the sanctuary people.\n<b>                               (MORE)\n</b><b>\n</b>ABOVE THE LAW - Rev. 4/17/87                        59.\n\n<b>                        JACKSON (CONT'D)\n</b>          They're refugees from El Salvador,\n          Guatemala, Chile. They won't talk                  *\n          to me, they're terrified of cops.\n\nJackson has an armload of notes, including photocopies of\nnews clippings.\n\n<b>                        JACKSON\n</b>          Ready for this? One of the people\n          killed at the church was definitely\n          not a congregation member.\n\nShe shows Nico and Lukich the Polaroids we saw her take in\nthe morgue.\n<b>                        JACKSON\n</b>          Alan Singletary. He's an aide to\n          Senator Harrison.\nNico is electrified.\n<b>                        JACKSON\n</b>          That's right. Harrison. Foreign\n          relations committee. The guy who's\n          been crawling all over the Central\n          American drug connections.\n<b>                        NICO\n</b>                 (impressed)\n          You're gonna make a helluva D.A.,\n          Jax.\n<b>                         LUKICH\n</b>          God help us.\n\n<b>                        JACKSON\n</b>                 (savors the com-\n                  pliment)\n          I've been at the Tribune all night,\n          wearing out their Xerox machine.\n          Harrison's staff has been\n          compiling some kind of white\n          paper. He's due to release it\n          next week.\nNico's mind races.\n\n<b>                        NICO\n</b>          That's how Fox knew.\n<b>                         JACKSON\n</b>          What?\n\nNico turns to Lukich, dead earnest.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           60.\n\n<b>                              NICO\n</b>                Luke. I  want you to go to my\n                house.  Call Branca... my mother\n                has the number. Get my family\n                ready to move out.\n<b>                              LUKICH\n</b>                You got it, buddy.\n\n<b>                              NICO\n</b>                Stay with 'em. We'll be there.\n<b>                              LUKICH\n</b>                What's going on, Nico?   What\n                happened?\n<b>                              NICO\n</b>                I got a call last night. An old\n                agency friend. He told me my\n                family was in danger.\n      Jax and Lukich can't put all the pieces together yet.    But\n      if it's drugs-CIA-Senate, it's got to be heavy.\n<b>                              LUKICH\n</b>                You got a weapon?\n      Lukich knows he doesn't. He glances up and down the\n      street, makes sure no one's watching -- then cracks the\n      driver's door of his car. There's a bulge in the map\n      pocket. Nico  pulls out a Sig Saur .45.\n<b>                               LUKICH\n</b>                Try this on.\n      Jackson watches Luke slip Nico a clip.                         *\n<b>                                                   CUT TO:\n</b>\n<b>217   INT. DAY CARE CENTER (BEHIND CHURCH) - MORNING\n</b>      OPENING CLOSE ON the faces of the sanctuary refugees.\n      They are faces that have known fear and tragedy. The kind\n      of faces we see on newsreels after villages have been\n      burned and family members murdered. The refugees have\n      been moved from church basement to a back room in the day\n      care center. Nico kneels, facing them. Jackson in the\n      background. A nun (SISTER BONIFACIA) and a priest (whom\n      we saw in Genarro's hospital room) watch over the people.\n      Nico is frustrated; he can't crack the refugees' fear.\n<b>                              NICO\n</b>                       (to nun)\n                Sister... you know me. Tell them\n                there's no need for fear.\n<b>\n</b><b>                                                        61.\n</b>\n<b>                        SISTER BONIFACIA\n</b>          There is rubble all over the yard,\n          Nicola.\n\n<b>(THE REST OF THE SCENE MAY BE IN ENGLISH, OR SPANISH WITH\n</b><b>SUBTITLES, AT THE DIRECTOR'S DISCRETION.)\n</b><b>                        NICO\n</b>                 (to refugees)\n          I was there... in the church.\n          They tried to kill my family, too.\nSeveral of the refugees look like they want to speak, but\nthey are terrified.\n<b>                        NICO\n</b>          I know there was a man here, from\n          an American senator's office. Who\n          was he going to speak to?\nThe refugees become increasingly anxious.\n<b>                        NICO\n</b>                 (to one woman)\n          Was it you, senora?\n                 (to a man)\n          Was it you?\nMore silence.    Glances among the people.   Finally:\n<b>                          REFUGEE WOMAN\n</b>          The priest.\nThe others shrink.   The Woman glances to them.\n<b>                          NICO\n</b>          Who?\n                 (gently)\n          Father Genarro?\n\n<b>                        REFUGEE WOMAN\n</b>          The other one.\n\nNico looks to the American priest standing there.\n<b>                       REFUGEE WOMAN\n</b>          No. The young one. From Costa\n          Rica.\n\nSister Bonifacia sighs.\n<b>                        SISTER BONIFACIA\n</b>          Father Tomassino.\n\nJackson has her pad out, taking notes. Bonifacia knows\ntoo much has already been revealed; she must speak.\n<b>\n</b><b>                                                               62.\n</b>\n<b>                              SISTER BONIFACIA\n</b>                He came alone... two weeks ago.\n                He had papers. Papers to give to\n                the senator.\n\n      Nico tries to contain his excitement; not scare anyone by\n      losing his calm.\n\n<b>                              NICO\n</b>                But the bomb... The bomb was\n                planted to destroy the pulpit.\n<b>                              SISTER BONIFACIA\n</b>                Father Tomassino was going to\n                give the Mass that day.\n                       (shaken)\n                Father Genarro talked him out of\n                it.\n\n      The refugees' faces confirm this.\n<b>                              NICO\n</b>                       (understands)\n                It was Father Tomassino they were\n                trying to kill.\n\n      Bonifacia starts softly to cry.    Nico puts his hand on her\n      shoulder, comforting her.\n<b>                              NICO\n</b>                Where is Tomassino?   Where is he\n                now?\n      The nun shakes her head.   Nico looks to the refugees.\n      They don't know, either.\n\n<b>                              REFUGEE MAN\n</b>                He run, mister. He go --\n\n      He gestures: \"who knows where?\"\n<b>                              NICO\n</b>                If you know where he is, you've\n                got to tell me. I want to help\n                him. I can help him.\n      The refugees lower their eyes. Bonifacia continues her\n      soft weeping. Nico glances to Jackson; her look says\n      \"Enough, let's leave these poor people alone.\" Nico\n      stands, touches Bonifacia one more time on the shoulder --\n<b>218   EXT. CHURCH DAY CARE BUILDING - DAY\n</b>\n      Nico and Jackson come out.   Nico has made a decision.\n<b>                              NICO\n</b>                You're outa this, Jax.    Go home.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                             63.\n\n<b>                                 JACKSON\n</b>                          (displays her notes)\n                   You see this list? Well, I'm not\n                   done.\n\n      Nico admires his partner's guts, but he's worried.\n<b>                              JACKSON\n</b>                I'm not a rookie, Toscani. Now,\n                go home. Get your family out of\n                here.\n      Nico agrees.    The pair starts to split.\n\n<b>                                 NICO\n</b>                          (calls after\n                           Jackson)\n                   Just paperwork, you understand?\n\n<b>                                                     CUT TO:\n</b><b>219   INT. NICO'S CAR - MOVING - MORNING\n</b>      Nico drives, a jumble of emotions on his face.      Urgency\n      fear, exhaustion. He's deep in thought --\n\n<b>220   EXT. INTERSECTION - MORNING\n</b>      Nico's car pulls up at a stop light. He looks around\n      without really seeing. An old lady pulls a shopping cart       *\n      while a crossing guard takes some kids across the street.      *\n<b>221   ANOTHER CAR\n</b>      ROARS up out of nowhere, without two men inside, SCREECH-\n      ING to a stop head-on to Nico's door. Its doors spring\n      open --\n<b>222   NICO\n</b>\n      dives toward his own passenger door --\n<b>223   SECOND CAR - TWO MORE ARMED MEN\n</b>\n      leap out, OPEN FIRE with pistols and automatic weapons.\n<b>224   QUICK CUTS\n</b>\n      Nico's car riddled with a furious FUSILLADE.      WINDOWS\n      BLOW OUT; the driver's door is shredded --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          64.\n\n<b>225   NICO - ON FLOORBOARD\n</b>      crawling frantically; shoving the passenger door open as\n      a FIRESTORM of lead and FLYING GLASS BLAZES all around\n      him.\n<b>226   FOUR MEN\n</b>\n      FIRING point blank (6 to ten feet) into Nico's car.   The\n      men are cool, professional.\n<b>227   NICO\n</b>\n      spills from the passenger door onto the ground, scrambles\n      like mad under his own car toward one of the attackers' cars.\n<b>228   PEDESTRIANS AROUND INTERSECTION\n</b>\n      scream and scatter in terror.\n<b>229   FOUR MEN\n</b>      FIRING as shells spew from the ejection ports of their\n      weapons.\n<b>230   NICO'S CAR\n</b>      being chewed to pieces --\n<b>231   NICO - UNDER MEN'S CAR                                          *\n</b>\n      crawling at full speed from the car's front to its back.\n      On the ground, alongside the car, spent CARTRIDGE CASES\n      RAIN like hailstones.\n<b>232   FOUR MEN\n</b>      As their magazines empty. The last shells spring free,\n      GUN BARRELS SIZZLE, blue smoke fills the air. The leader\n      waves two men forward to check their kill. At that\n      instant:\n<b>233   NICO\n</b>\n      springs to his feet behind the men, the Sig Saur .45            *\n      clutched in both hands. (He has crawled under both cars\n      to envelop his attackers.)\n\n<b>                                 NICO\n</b>                   Over here, you sons-a-bitches!\n      Nico's rage is superhuman. The men stare in conster-\n      nation. One of the men has a fresh magazine half into\n      his weapon --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        65.\n\n<b>                              NICO\n</b>                       (eyes like an\n                        animal)\n                Try it. Be my guest.\n\n      The man lets the magazine clatter to the street. The\n      others raise their hands. It takes all Nico's strength\n      to keep from wasting all four of them on the spot. His\n      gaze swings wildly around the intersection. He spots a\n      corner grocery store. A phone inside.\n<b>                              NICO\n</b>                       (gestures with gun)\n                Over there! Move it! -- Now!!\n      The men are scared shitless. They put their hands in\n      back of their heads; trot jelly-legged --\n\n<b>234   INT. CORNER GROCERY STORE - DAY\n</b>      A Pakistani counter clerk takes one look at the mob enter-\n      ing his store and bolts for the rear. A customer exits\n      as Nico herds his captives in.\n<b>                             NICO\n</b>               Hands on the counter!\n      Three men do it; the fourth is slow.\n<b>                             NICO\n</b>               Don't tempt me, ASSHOLE --\n      The fourth obeys. Nico moves to the pay phone on the\n      wall, covering the men with his .45. He grabs the re-         *\n      ceiver in his free hand; tries to dial. Adrenaline makes\n      his hand shake; the dials spin wrong -- One of the men\n      sees Nico's dilemma. To hit 911, Nico has to take his\n      eye momentarily off his captives. As Nico turns again\n      to the dial -- A free-standing sales display hurtles\n      toward him, crashing into his gun hand. One of the men\n      has lunged into the display; now he dives atop Nico a\n      second later. The whole human pile crashes, thundering\n      into a glass freezer. Somehow Nico gets to his feet.\n      One of the men grabs Nico's gun; Nico swings one of the\n      freezer doors -- Wham! -- smack into the man's face. The\n      GLASS SHATTERS; the man drops like a rock. Now it's\n      three against one -- prime odds for Nico. He wades into\n      his attackers. A coffee stand goes flying. A body sails\n      into a makeup display. One fool is lucky enough to land\n      a blow that bloodies Nico's nose; he pays with a shattered\n      forearm and a head-first heave into an ice cream locker --\n\n<b>235   POV FROM OUTSIDE STORE\n</b>\n      It looks like a tornado has hit the interior. Magazine\n      RACKS CRASH, mayo jars fly through the air, the ICE\n      MACHINE seems to EXPLODE as a man's back careens into it --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            66.\n\n<b>236   STREET CORNER UP BLOCK\n</b>      Two police cars heave into view, SIRENS WAILING --\n\n<b>237   FRONT DOORS OF STORE\n</b>      Nico takes the last man, lifts him up, and drives him like\n      a battering ram straight through the glass.\n\n<b>238   NICO\n</b>      Wild-eyed and bloody, sees the cop cars whipping into the\n      corner. He spins to see his .45 on the floor -- too far\n      away to race for. He bolts down a gangway.\n<b>                                                    CUT TO:\n</b>\n<b>239   INT. NICO'S HOUSE - DAY\n</b>\n      The PHONE RINGS next to Lukich. Sara starts towards              *\n      it. Lukich stops her with a look; he picks up the phone.\n<b>                               LUKICH\n</b>                        (into phone)\n                Yeah?\n\n<b>240   INTERCUT NICO ON STREET - PHONE BOOTH - DAY\n</b><b>                              NICO\n</b>                       (into phone)\n                Get their stuff into the car now.\n                Do it in the alley, not the\n                driveway. I'll be there in five\n                minutes.\n<b>                                                    CUT TO:\n</b><b>241   TWO MORE POLICE CARS\n</b>\n      SQUEALING around a corner, entering the block where Nico\n      is.\n<b>242   NICO - ON SIDEWALK\n</b>\n      Lets them pass, keeping low.      He sprints across the street\n      and down the alley.\n\n<b>243   OMITTED\n</b><b>&amp;\n</b><b>244\n</b><b>                                                    CUT TO:\n</b>\n<b>245   INT. NICO'S BEDROOM - DAY\n</b>\n      Sara grabs a handful of dresses from the closet and angrily      *\n      throws them into an open suitcase on the bed. Nico watches,\n      hoping to ride the storm.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          67.\n\n<b>                             SARA                                    *\n</b>               Your job and your family in one day,\n               Nico. You're batting a thousand.\n\n<b>                             NICO\n</b>                      (softly)\n               Sara...                                               *\n\n      Sara is at the dresser, pulling open drawers, dumping her      *\n      clothes haphazardly into the suitcase. She stops suddenly.\n      She pulls out a handgun and ammo from her panty drawer. She\n      starts to weep. Nico steps up behind her, puts his arms\n      around her.\n\n<b>                             NICO\n</b>               You'll be safe with Uncle Branca.\n               It's gotta be this way... I'm sorry.\n\n      He turns her around to face him.\n<b>                             NICO\n</b>               Don't you think I'd rather be with\n               you?\n      He holds her passionately.    Rosa coughs loudly in the doorway.\n\n<b>                             SARA                                    *\n</b>                      (no longer angry)\n               -- Mama... you got your medicine?\n               Don't forget the baby's sweater --\n\n<b>                             ROSA\n</b>               I know about babies.\n      We glimpse other relatives in the hallway; Nico hands them\n      a pair of suitcases; they hurry off --\n<b>                             SARA                                    *\n</b>                      (of Nico's bloodied\n                       shirt)\n               You sure you're all right?\n<b>                             NICO\n</b>               I am if you are.\n<b>                             SARA                                    *\n</b>                      (trying to lighten up)\n               Don't worry --\n                      (touches him)\n               We needed a vacation, anyway.\n      Sara takes her suitcase, hurries out --                        *\n\n<b>246   EXT. ALLEY BEHIND NICO'S HOUSE - DAY\n</b>      Branca's sedan is half-loaded; Branca adds a few more bags.\n      Lukich's car is parked behind it.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          67A.\n\n<b>                              NICO\n</b>                       (crossing yard with\n                        Sara)                                      *\n                I'll give you five minutes start.    We\n                have to do it this way.\n      They get their suitcases into the sedan. Mama and the baby\n      are already aboard. Sara gets into the passenger seat.       *\n      Lukich comes around from the front, glancing around like a\n      lookout.\n<b>                               NICO\n</b>                Where's Jax?\n\n<b>                              LUKICH\n</b>                She thinks there may be documents at\n                some guy's apartment.\n\n      Nico starts toward the rear basement door.    Lukich falls\n      in with him.\n<b>247   INT. BASEMENT - DAY\n</b>      Nico and Lukich enter, start down the steps.\n<b>                              NICO\n</b>                They killed the wrong priest.\n      Lukich doesn't understand.\n<b>                              NICO\n</b>                There was a second priest... from\n                Costa Rica... hiding at the church.\n                He was the one they meant to kill.\n      Nico starts to remove a large piece of ducting from the\n      basement heater.\n<b>                              LUKICH\n</b>                And you know where to find him?\n<b>                               NICO\n</b>                No.\n\n      The hole in the foundation holds several shotguns and a\n      couple of pistols, some passports and some cash.\n\n<b>                              LUKICH\n</b>                You're gonna need help.\n      Nico grabs the pistols, starts to strap them on.\n\n<b>                              NICO\n</b>                Just stay with my family\n      Nico replaces the piece of foundation, starts back up the\n      steps.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                             68.\n\n<b>                               LUKICH\n</b>                 What are you gonna do?\n\n<b>                               NICO\n</b>                 You don't want to know.\n<b>248    EXT. ALLEY BEHIND NICO'S HOUSE\n</b>\n       Branca STARTS the SEDAN. Sara looks back, pained.              *\n       Rosa, Lukich and Julian are also in the car. Nico grabs\n       another hand-carried case from the basement, hurries into\n       Lukich's car.\n\n<b>249    NICO'S POV - LOOKING DOWN DRIVEWAY\n</b>       Two police cars pull up to the front of the house.\n\n<b>250    HIGH ANGLE SHOT - ALLEY BEHIND HOUSE\n</b>\n       Lukich's car continues off.\n<b>                                                   CUT TO:\n</b><b>250A   EXT. SUBURBAN HOUSE - DAY\n</b>       We see Uncle Branca's car and Lukich's car out front.\n<b>251    INT. SAFE HOUSE - DAY\n</b>       Branca leads Nico, Sara, Rosa, Julian and Lukich down a        *\n       corridor. Two older Italian women open a door leading to a\n       basement rec room.\n<b>                               BRANCA\n</b>                 My sister's cousin's place. You're\n                 safe -- not even I can find this joint.\n       The family enters the back room.    They take in their\n       sanctuary.\n\n<b>                                                   CUT TO:\n</b><b>252    EXT. PARKING LOT - DAY\n</b>\n       Agent Neeley hurries across the lot toward his car. He gets    *\n       in, STARTS the ENGINE. As he puts the car in gear --\n\n<b>253    BARREL OF .45 AUTOMATIC\n</b>\n       nestles behind his right ear.\n<b>                               NICO\n</b>                        (rising from rear seat)\n                 Don't forget your seat belt.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        69.\n\n<b>254   INT. FEDERAL WAREHOUSE - DAY\n</b>      Nico walks casually beside Agent Neeley, holding his gun out   *\n      of sight in his pocket. They proceed down a corridor. Be-\n      hind them we glimpse a security checkpoint, manned by two\n      uniformed guards, through which they apparently have already\n      passed.\n\n<b>255   ANGLE - CORRIDOR\n</b>\n      The two walk past floor-to-ceiling warehouse shelves, packed\n      with labeled boxes, film cans, etc. which are visible\n      through a heavy wire-mesh screen.\n\n<b>                              AGENT NEELEY                           *\n</b>                Congratulations, Toscani. You just\n                made number four on the most wanted\n                list.\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87              69A.\n\n<b>                       NICO\n</b>         Keep walking --\n                (another nudge)\n         -- I'm bucking for number one.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                        70.\n\n<b>256   ADMINISTRATIVE WINDOW\n</b>      A pot-bellied, Naval-retired-type CLERK looks up from his\n      desk as Nico and Neeley come up to the counter. We see a      *\n      sign: \"EVIDENCE HOLDING DEPOT -- You MUST Have Your Requi-\n      sition Number!!!\" The Clerk stands, chomping a cigar, wad-\n      dles to the counter. We see his arms covered with tattoos.\n\n<b>                              CLERK\n</b>                What can I do for you, lads?\n      Neeley presents his ID.                                       *\n\n<b>                              AGENT NEELEY                          *\n</b>                There was a quantity of C-4 explosive\n                brought in four days ago --\n\n<b>                              CLERK\n</b>                Hell, that's gone.\n<b>                                NICO\n</b>                When?\n<b>                              CLERK\n</b>                Right away, pardner. They scooped\n                that stuff outa here before we even got\n                it tagged.\n<b>                                NICO\n</b>                Who?    Who took it?\n\n<b>                                CLERK\n</b>                         (casual)\n<b>                C.I.A.\n</b>      Nico reacts, nudges Neeley once more.                         *\n<b>                              AGENT NEELEY                          *\n</b>                       (to Clerk)\n                We'd like to see the paperwork.\n      The Clerk has an accordion file right under the counter.\n      He indicates a sign-in book.\n\n<b>                             CLERK\n</b>               You gotta sign.\n\n      Neeley signs the book. The Clerk starts leafing through his   *\n      files, searching for the release form.\n<b>                             CLERK\n</b>               Yeah... I remember that guy. Flew in\n               special from Langley. Bomb tech.\n               Real nice fella --\n                      (finds the form,\n                       lifts it from\n                       file)\n               -- Here it is. Fox. Nelson Fox.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           71.\n\n<b>257   NICO\n</b>      snatches the release form.     Stares at the signature, stunned.\n\n<b>258   EXT. LAKEFRONT - DESERTED SECTION - DAY\n</b>      Neeley's car parked in the boondocks along the lake.               *\n\n<b>                               FEMALE (V.O.)\n</b>                        (from car radio)\n                 -- Here it is, sir. Coming in from\n                 Langley now --\n\n<b>259   INT. CAR\n</b>      Neeley holds the radio mike, as if about to say something.         *\n      Nico shoves his gun against the guy's temple.\n\n<b>                               FEMALE (V.O.)\n</b>                        (from car radio)\n                 -- That agent has been with the Central\n                 American desk, uh, since '84 --\n<b>                               AGENT NEELEY                              *\n</b>                        (into mike)\n                 Thank you. That's what I wanted.\n      Nico takes the mike, clicks it back into its cradle.     Neeley    *\n      freezes, unsure what Nico's going to do with him.\n<b>                               NICO\n</b>                        (motions with gun)\n                 Dump your shoes. Ditch your I.D. on\n                 the floor.\n      Nico watches the FBI man obey.\n<b>                               NICO\n</b>                 So you think I'm a lousy cop, huh,\n                 Neeley? Maybe I am. But I haven't got                   *\n                 my face buried up Washington's ass.\n<b>                               AGENT NEELEY                              *\n</b>                 Nobody buys me, Toscani.\n<b>                               NICO\n</b>                 Yeah? Then somebody pulled the plug\n                 on your brain, pal. You didn't come\n                 up with the second priest, did you?\n                 Or Harrison's dead aide.\n                        (as Neeley fumbles with                          *\n                         his laces)\n                 Hurry up!\n                        (as Neeley obeys)                                *\n                 You heard the radio. The Agency's\n                 pushing buttons and bodies are dropping\n                 like flies. You assholes are missing\n                 half the case!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         72.\n\n      Despite his animosity toward Nico, Neeley is beginning to     *\n      realize this cop is onto something.\n\n<b>                                 AGENT NEELEY                       *\n</b>                Listen.     Toscani --\n      Nico grabs Neeley's shoes, heaves them into the back seat.    *\n      He shoves the agent out the door, swings himself behind the\n      wheel.\n\n<b>                              NICO\n</b>                Watch your step.\n\n<b>260   EXT. DESERTED LAKEFRONT - DAY\n</b>      Nico drives off, leaving the FBI man miles from nowhere.\n\n<b>                                                 CUT TO:\n</b>\n<b>261   MONTAGE\n</b>      with SCORE and V.O.\n<b>      A)   INT. POLICE HEADQUARTERS - DAY\n</b>           From out of an elevator and down a busy corridor march\n           the brass, Deputy Superintendent Crowder included.       *\n           Lieutenant Strozah lags slightly behind. They enter      *\n           an auditorium where a large contingent of press,\n           cameras ready, wait.\n\n<b>      B)   INT. CONDO COMPLEX - HALLWAY - DAY\n</b>           Jackson outside an apartment door in a Yuppie-esque\n           condo complex. She looks both ways to be safe, then\n           slides a credit card behind the lock. The door opens.\n<b>      C)   EXT. CONVENTION CENTER - DAY\n</b>\n           Nico parks Neeley's car in a huge packed lot. A towering *\n           marquee sign reads: \"COMPUTER EXPO '87.\" Nico starts on\n           foot toward the convention center entrance.\n\n<b>      D)   INT. CONDO APARTMENT - DAY\n</b>           Jackson enters, looking guilty as hell. She picks up\n           a framed photo from a piano: the dead Senator's aide\n           posed smiling beside a distinguished-looking man\n           (Senator Harrison) in front of the capitol building.\n           Jackson sets the photo down, starts rummaging through\n           desk drawers.\n\n<b>      E)   INT. POLICE HEADQUARTERS - DAY\n</b>\n<b>                              CROWDER                               *\n</b>                The officer is alleged to be involved in\n                illicit drug trafficking, racketeering\n                and kidnapping --\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                          73.       *\n\n<b>F)   INT. CONVENTION CENTER\n</b>     Nico, in the crush of convention-goers, pauses before a\n     booth promoting a TV manufacturer. The latest model TV's\n     are set up in a sales display, with visitors gawking at\n     the pictures of the church bombing aftermath.\n<b>                         NEWSWOMAN (V.O.)\n</b>                  (on TV's)\n           Police sources also speculate that\n           Toscani may be connected to the suspect\n           in the bombing of St. Elizabeth's\n           parish church --\n\n     A police composite rendering of the woman who placed the\n     bomb at the church is shown on the television.\n\n<b>                         NEWSWOMAN (V.O.)\n</b>                  (on TV's)\n           -- the suspect is likely to be armed\n           and considered to be extremely\n           dangerous --\n     Nico's police ID photo appears on the news.   He blends\n     back into the crowd.\n\n<b>                         NEWSWOMAN (V.O.)\n</b>           In other news, Senator Ernest\n           Harrison's presidential bid has...\n     Nico moves swiftly through the convention center floor\n     (which is packed for thousands of square feet with sales\n     booths, each manned by technicians and pitchmen, all\n     displaying the latest in high-tech data processing\n     equipment, telecommunications, etc.)\n\n<b>G)   INT. CONDO APARTMENT - DAY\n</b>     Jax stuffs a wad of offical papers -- including appoint-\n     ment books, notes and tapes -- into her briefcase. At\n     the apartment door, she looks both ways, then emerges,\n     starts away down the hallway.\n\n<b>H)   INT. CONVENTION CENTER - COMPUTER BOOTH - DAY\n</b>     Nico in the crowd in front of the booth of a Japanese\n     computer manufacturer. Dr. Watanabe (Nico's friend whom\n     we remember from the baptism/picnic scene) is the chief\n     engineer at the booth, showing off some high-tech\n     equipment to several brainy looking executives.\n     Watanabe glances up, spots Nico. Nico makes a subtle\n     sign to indicate he must speak to Watanabe. Watanabe\n     crosses at once to Nico.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           73A.\n\n<b>                               WATANABE\n</b>                 So good to see you again, sir!\n                        (shakes Nico's hand)\n                 Come back near closing... five-\n                 thirty... we'll place your order\n                 then.\n          Nico nods, fades like a shadow into the throng.     MUSIC\n<b>          DOWN, SEQUENCE ENDS --\n</b>\n<b>                                                    DISSOLVE TO:\n</b><b>262   INT. CONVENTION CENTER - NIGHT\n</b>\n      All customers gone, lights being turned off. Janitors\n      sweep up, the last booth people shut down for the night.\n\n<b>      WATANABE\n</b>\n      emerges with Nico from behind a booth divider, leads her        *\n      old friend at a brisk pace across the deserted floor.\n<b>                               NICO\n</b>                 Listen, Wat... you know I wouldn't\n                 call in a favor --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                        74.        *\n\n<b>                              WATANABE\n</b>                Of course not. Just because you\n                kept a few 'friendly' tribesmen\n                from cutting my heart out and serving\n                it up as Pad Thai?\n      With a wink, Watanabe escorts Nico into a back area off the\n      floor. Carpeted office dividers set off a small area,\n      packed with super sophisticated computer equipment.\n\n      Watanabe \"boots up\" a terminal, sits down with relish.\n<b>                              WATANABE\n</b>                The last six years I've been risking\n                nothing but money. It's a kick to\n                risk my ass again.\n\n      Nico eyes the equipment and Watanabe, impressed.\n\n<b>                              NICO\n</b>                The old Spook.\n<b>                                                CUT AWAY TO:\n</b><b>263   OMITTED\n</b><b>&amp;\n</b><b>264\n</b><b>265   INT. JACKSON'S APARTMENT - NIGHT\n</b>      Jackson has the Senator's aide's papers spread before her,\n      cataloging them with interest. The PHONE RINGS. Jackson\n      picks it up.\n<b>                              JACKSON\n</b>                       (into phone)\n                Jackson.\n      Whoever the voice is (which we can't hear), it makes Jackson\n      forget the documents.\n<b>                              JACKSON\n</b>                       (into phone)\n                -- Yes... yes, of course, sister, I\n                know who you are.\n                       (listens)\n                -- where... where are you?\n\n<b>                                                CUT BACK TO:\n</b><b>266   INT. WATANABE'S COMPUTER AREA - NIGHT\n</b>\n      Watanabe working two computers simultaneously, with the\n      gusto of a rock keyboard player.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                          75.         *\n\n<b>                              WATANABE\n</b>                -- No way to access Covert Ops\n                directly. But Ornstein's at\n                Princeton, he's got a database\n                bigger than Langley --\n                       (works keyboard\n                        lovingly)\n                If I can't crack that turkey's\n                code, it's time to hang up my\n                rock and roll shoes --\n      Nico watches Watanabe work.\n\n<b>                               WATANABE\n</b>                -- ah, here! Here's a little trap\n                door. Let's see if we can wriggle up\n                into --\n                        (watches the screen\n                         with anticipation)\n                Personnel files! Operative dossiers.\n                Will that do?\n<b>                                NICO\n</b>                It's a start.\n      Nico sits down beside Watanabe.\n<b>                                                   DISSOLVE TO:\n</b><b>267   FULL ASHTRAY\n</b>      Watanabe stubs out a cigarette. Empty coffee cups all\n      around. Nico paces, reading a hard-copy printout.\n<b>                              NICO\n</b>                Fox has had a helluva career.\n                       (reads down page)\n                '69 to '76, Cambodia, Laos. Operation\n                Phoenix. Operation Green Mountain.\n                Operaton Northstar. This is all Vang\n                Pao, it's all heroin --\n<b>                              WATANABE\n</b>                You friend has found his metier.\n\n      Nico circles the \"operations\" on the page, hands it to\n      Watanabe.\n\n<b>                              NICO\n</b>                Run personnel retrievals on all these\n                operations. I want the names of every\n                company man who was on them.\n\n<b>                                                   QUICK DISSOLVE TO:\n</b>\n<b>268   CLOSE - COMPUTER SCREEN\n</b>      A list of about thirty names -- mostly civilian, but some\n      with military rank attached.\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                      75A.\n\n<b>                       NICO (O.S.)\n</b>         Altshuler. Cosgrove. I know half\n         these guys --\n                (thinking)\n         Okay... now run me an update. Where\n         are these fuckers now?\n<b>                                         QUICK DISSOLVE TO:\n</b><b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           76.\n\n<b>269   NICO - LATER\n</b>      Pouring a fresh coffee, studying the screen with Watanabe.\n\n<b>                              WATANABE\n</b>                       (finger tracks down\n                        screen)\n                Central American desk. Central\n                American desk. Central --\n\n<b>                              NICO\n</b>                Thirty names from secret drug\n                operations... and two-thirds of 'em\n                are in Central America.\n                       (beat)\n                All right. Run these two names:\n                Bautista Salvano and Ramon 'Chi Chi'\n                Testamente.\n\n<b>                              WATANABE\n</b>                Those street dealers you were talking\n                about? They're not gonna be in here.\n      Nico gives her a look.    Watanabe starts punching keys.     *\n<b>270   CLOSE - COMPUTER SCREEN\n</b>      Official biographies of Salvano and Chi Chi come up.\n<b>                              WATANABE (O.S.)\n</b>                Well, kiss my ass.\n                       (reads)\n                Both former Somoza secret police.\n                       (whistles, impressed)\n                Recruited by agency, 1975. Trained\n                Fort Benning, counter insurgency...\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                          76A.\n\n<b>                              NICO (O.S.)\n</b>                Where's Fox's printout?\n                       (finds it, reads)\n                1976... Fort Benning. He recruited\n                these pricks!\n<b>                                                   DISSOLVE TO:\n</b>\n<b>270A   EXT. CONVENTION HALL - NIGHT                                   *\n</b>\n       It's even later. The last of    the janitorial crew is         *\n       finishing up the huge floor.    A few display lights remain    *\n       on, otherwise it's dark. Nico    stands above, observing,      *\n       contemplating the information   he has received.               *\n<b>271    INT. WATANABE'S COMPUTER AREA                                  *\n</b>\n       Watanabe crapped out in a chair; Nico looking weary, pacing,   *\n       wracking his brain.\n<b>                              WATANABE\n</b>                There's nothing left, Nico.     We've\n                wrung these files dry.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           77.\n\n<b>                               NICO\n</b>                        (muttering to\n                         himself; thinking)\n                Fox is here, in Chicago... or was\n                here...\n                        (has an idea)\n                ... Listen. Can this thing tap into\n                airlines? Reservations records --\n\n<b>                              WATANABE\n</b>                I can get you the ball scores, too.\n<b>                                                   DISSOLVE TO:\n</b>\n<b>272   NICO\n</b>      As he finishes viewing the screen, stands.\n\n<b>                                NICO\n</b>                Five agents   from Central American desk.\n                All trained   assassins. All arrived in\n                Chicago in   the last week -- and none\n                of them has   left.\n      Nico grabs his coat, gulps a last swallow of coffee --\n\n<b>                              NICO\n</b>                Thanks, Wat. You finally may have\n                done some good for your country.\n<b>                              WATANABE\n</b>                Where are you going?\n<b>                              NICO\n</b>                To find a priest.\n\n<b>                                                   CUT TO:\n</b><b>273   EXT. CONVENTION CENTER - NIGHT\n</b>\n      Jackson's unmarked car whips into the curb. Aboard:          *\n      Jackson and Lukich. Nico steps from the shadows, ducks\n      into the back seat. The car takes off.\n\n<b>274   INT. UNMARKED CAR - MOVING - NIGHT\n</b><b>                              NICO\n</b>                How did ya find him?\n\n<b>                              JACKSON\n</b>                The nun phoned me. She said two men\n                had been sneaking around the church.\n                She sounded scared --\n\n      Nico checks his .45.    Two spare clips.\n<b>\n</b><b>                                                            78.\n</b>\n<b>                              JACKSON\n</b>                There's more. I got the papers\n                from that senator's aide's apartment.\n                Everything Harrison's been working on.\n                It's all at my place.\n<b>                                                CUT TO:\n</b>\n<b>275   ELEVATED SUBWAY TRAIN - NIGHT\n</b>\n      BOOMS PAST CAMERA, only a few feet away from a row of\n      tenement apartment buildings. As TRAIN sound RECEDES,\n      CAMERA MOVES IN ON one building. We hear LOUD UPBEAT\n      ROCK AND ROLL coming from a third-floor apartment --\n<b>276   EXT. TENEMENT - POV FROM CAR ON STREET - NIGHT\n</b>\n<b>                              VOICE (O.S.)\n</b>                       (from within car)\n                Once you're inside, you'll signal us.\n<b>277   INT. CAR - CLOSEUP ON TREMBLING WOMAN (SAME STREET)\n</b>      It is the Middle-aged Woman who left the bomb, seen in Father\n      Genarro's church. A police sketch of her was seen on tele-\n      vision. She is looking up at the third-floor window, getting\n      instructions. She turns around occasionally to see who's\n      talking to her.\n<b>                              SALVANO (O.S.)\n</b>                Don't be scared. Your life depends on\n                this.\n<b>278   CLOSE ON DRIVER\n</b>      It is one of Salvano's goons we've seen before.    He is\n      checking his gun.\n<b>279   INT. TENEMENT HALLWAY - NIGHT\n</b>\n      The Woman walks slowly down the hall. She carries a small\n      donation can. She knocks on a door. We hear FOOTSTEPS from\n      within the apartment. The door opens. It's Bonifacia, the\n      nun from the church (though now in civvies). The Middle-Aged\n      Woman with the donation can raises it as if asking for a\n      contribution. Bonificia looks flustered, impatient. She\n      really doesn't want to leave the door open.\n\n<b>                              MIDDLE-AGED WOMAN\n</b>                Exusame, por favor. Tiene dinero\n                para...\n\n<b>280   FROM NOWHERE\n</b>\n      Three of Salvano's armed goons appear on both sides of the\n      doorway. They push both women violently into the apartment.\n<b>\n</b><b>                                                           79.\n</b>\n<b>281   CLOSEUP - GOON\n</b>      He steps quickly, surely into the apartment.\n\n<b>282   CLOSEUP - BEDROOM DOOR\n</b>      It flies open.   The goon points his gun AT the CAMERA.\n\n<b>283   GUNMEN'S POV\n</b>\n      Father Tomassino, the Costa Rican priest, stands at the\n      window, he has been trying to open it. He turns. He knows\n      he can't escape.\n\n<b>284   EXT. APARTMENT - POV FROM SALVANO'S CAR\n</b>      The light in the apartment window blinks twice.\n\n<b>285   EXT. TENEMENT - STREET - NIGHT\n</b>      From two cars emerge the shapes of several men.\n<b>286   EXT. CHICAGO STREET - NIGHT\n</b>      Jackson's car -- with Jackson, Nico and Lukich aboard --\n      swings around a corner into a traffic jam. The HORN BLARES.\n<b>287   INT. TENEMENT APARTMENT - THIRD FLOOR - NIGHT\n</b>      A STEREO SPEAKER BLASTS MUSIC from the front room. CAMERA\n      PANS ACROSS Bonifacia's bedroom dresser. We see mementos\n      of her life and a photo of herself with Father Genarro with\n      a group of children. CAMERA CONTINUES TO PAN PAST Bonifacia's\n      bed, PAST Bonifacia's body! CAMERA CONTINUES DOWN TO the\n      floor, where lies the lady who planted the bomb. They both\n      appear dead.\n<b>288   CLOSE - FATHER TOMASSINO\n</b>\n      He is in a chair, his wrists strapped to the chair arms.    He\n      is sweating, fearful but clinging to his courage.\n<b>289   ANOTHER ANGLE\n</b>\n      Behind Father Tomassino, we see Salvano, Chi Chi and two\n      other goons, armed with pistols. Salvano moves toward the\n      priest, sets a small TV table down beside him. The priest\n      glances toward it --\n\n<b>290   PRIEST'S POV - TV TABLE\n</b>      Atop its rickety surface:   a fearsome array of syringes and\n      drug vials.\n\n<b>291   BACK TO FATHER TOMASSINO\n</b>      He glances up from the hypodermics --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                           80.\n\n<b>292   PRIEST'S POV\n</b>      INTO FRAME moves Kurt Zagon! We see clearly the 15 years of   *\n      aging since SE Asia. His face is even scarier than when he\n      performed similar atrocities in those days. Zagon prepares\n      a syringe, tests it, shooting a clear liquid skyward.\n<b>                              ZAGON\n</b>                You'll be in heaven in a few minutes,\n                padre. But first I'm going to put\n                you through hell.\n<b>293   EXT. CHICAGO STREET - NIGHT\n</b>\n      Nico, Lukich and Jackson are speeding through the infamous\n      Southside. We want to scream at them to get there already.\n\n<b>294   BACK TO APARTMENT\n</b>\n      Salvano holds the priest's arm steady, Zagon moves in with\n      the needle.\n<b>                              ZAGON\n</b>                You came here to talk to the                        *\n                Senator's aide, didn't you?                         *\n\n<b>                               FATHER TOMASSINO\n</b>                I tried.   But you killed him first.                *\n<b>                              ZAGON\n</b>                Who told you about our plans?                       *\n<b>                              FATHER TOMASSINO\n</b>                This is from confession. I tell no\n                one.\n\n<b>                              ZAGON\n</b>                You wouldn't lie to me, Father?   It's\n                a sin.\n\n      Father Tomassino says nothing, he begins to cry.\n<b>                              ZAGON\n</b>                       (almost with kindness)\n                If you spoke to anyone, tell me now --\n                       (indicates hypo)\n                -- and I won't have to use this.\n\n<b>295   EXT. TENEMENT - NIGHT\n</b>      The unmarked police car pulls up, across the street.\n\n<b>296   INT. CAR - NIGHT\n</b>\n      Nico, Jackson, and Lukich gaze at the building.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                          80A.\n\n<b>296A   POV FROM CAR                                                   *\n</b>       In the shadows by the corner, a hulking Latino man loiters.    *\n\n<b>                               JACKSON (O.S.)                         *\n</b>                 That's an eyeball if I ever saw one.                 *\n<b>296B   BACK TO CAR                                                    *\n</b>\n       Nico starts to open the car door.   Jackson moves to join him. *\n<b>                               NICO\n</b>                 You're our backup. If we come out\n                 running, then you can shoot.\n       Nico's eyes meet his partner's. It's plain he'll break her\n       leg if he has to, to keep her safe by the car. Jackson\n       accepts this reluctantly.\n<b>\n</b><b>                                                             81.\n</b>\n<b>297   EXT. TENEMENT - NIGHT\n</b>      Nico and Lukich exit the vehicle. Nico indicates an adjacent\n      building; he and Lukich start for it.\n\n<b>298   INT. APARTMENT\n</b>      Father Tomassino is beginning to come under the influence of\n      Zagon's chemicals. In spite of this the priest's spirit to\n      resist is astounding...\n<b>                              ZAGON\n</b>                Speak to me, Father -- who did you tell?\n\n<b>                              FATHER TOMASSINO\n</b>                I know what you are. I know what\n                beasts you are.\n\n<b>299   EXT. ADJACENT BUILDING - ROOF OF TENEMENT\n</b>      Nico and Lukich emerge from the roof door, guns drawn. The\n      roof is empty. Antennas, skylights, clotheslines. The pair\n      creep soundlessly onto the next roof. They cross toward the\n      roof door like infantrymen, moving one at a time from cover\n      to cover, covering each other. They reach the door that\n      leads down into the building. Nico checks the far side of\n      the enclosure, nods to Lukich. Lukich cracks the roof door\n      open --\n<b>300   STAIRWELL FROM ROOF - NICO AND LUKICH\n</b>\n      Nico and Lukich creep down the stairs from the roof.    Nico\n      opens the door leading to the top (third) floor.\n<b>301   INT. APARTMENT\n</b>\n      The drugs have taken hold. The priest's brain is an open\n      memory bank for Zagon to probe.\n\n<b>                              ZAGON\n</b>                I want to know who you told.\n<b>                              FATHER TOMASSINO\n</b>                       (barely coherent)\n                I told them... you make the ninos...\n                see... castrating their fathers --\n                raping... mutilating their mothers\n                ... And...\n                       (breaks down crying)\n                ... and sometimes... to the ninos...\n<b>302   NICO'S POV - HALLWAY\n</b>\n      As he slowly pushes the door open.   The hallway is empty.\n<b>303   INT. HALLWAY\n</b>\n      Nico and Lukich pad in.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                           82.\n\n      Quickly Lukich checks the stairs leading down. Nico crosses\n      silently past the first apartment door, checks the far end of\n      the hallway. Nico comes back toward the apartment door.\n      Lukich approaches from the opposite side. They take up\n      positions flanking the door, guns drawn. The LOUD MUSIC\n      CONTINUES from inside.\n<b>304   INSIDE APARTMENT\n</b>\n      Salvano and Chi Chi look on, revulsed. Whatever is happening\n      to Father Tomassino is enough to make even cruel men ill.\n<b>                                 ZAGON (O.S.)\n</b>                   -- Tell me the truth, Father --\n      The priest's eyes roll grotesquely; he convulses, sweat\n      beading on his forehead. He looks like a man in the agonies\n      of some narcotic hell.\n\n<b>                                 ZAGON\n</b>                          (close to priest)\n                   -- Can we kill him? If you told anyone,\n                   about our plans to kill the senator,\n                   we cannot do it.\n<b>                                  FATHER TOMASSINO\n</b>                   Nadie.   Nadie. Nadie.                             *\n<b>305   NICO AND LUKICH IN HALLWAY\n</b>      O.S. we hear another ELEVATED TRAIN APPROACHING outside.\n      Nico kicks the apartment door in! He and Lukich burst in,\n      guns clutched two-handed.\n<b>306   QUICK CUTS\n</b>\n      The first goon reacts, raises his pistol. Lukich SHOOTS him.\n      Nico NAILS the second goon, just as Chi Chi aims his sawed-\n      off pistol-grip shotgun at Nico. Nico has a split second to\n      dive behind a heavy upholstered chair. Chi Chi's DOUBLE-\n      BARREL BLAST blows the chair into powder. Almost instan-\n      taneously Nico sees the priest -- just as Zagon slashes the\n      priest's throat! Salvano SHOOTS Lukich point blank, in the\n      shoulder, sending Lukich's gun sailing. Nico, FIRING, grabs\n      Lukich, dives out the door with him --\n<b>307   HALLWAY\n</b>\n      Zagon and Salvano OPEN FIRE from the apartment full-tilt.\n      BULLETS RIP through the WALL, BLASTING WOOD and PLASTER\n      everywhere. Nico shoves Lukich toward the stairwell --\n\n<b>                                 NICO\n</b>                   Go!   Go!\n      -- Simultaneously FIRING back through the kicked-in door,\n      EMPTYING his GUN.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                         83.\n\n<b>                              ZAGON\n</b>                       (in Spanish, from\n                        apartment)\n                Get him! Finish him!\n\n      Nico is slamming a fresh clip in, Lukich is stumbling away\n      toward the stairwell. Salvano and Chi Chi appear in the\n      apartment doorway. Chi Chi levels his fierce \"hogleg\" at\n      Nico's head. At that instant -- A broadside of BULLETS slam\n      into the wall around Chi Chi. It's Jackson -- on the stairs!\n      Chi Chi is hit, but spins, FIRES. His shotgun blast catches\n      Jackson square in the chest, blowing her back like a doll,\n      down the stairwell, out of sight. Nico reacts with agony,     *\n      twists on the floor, SHOOTS Chi Chi in the face. Nico pulls\n      the trigger as fast as he can, sending a HAIL of FIRE through\n      the doorway, through the walls. Salvano clutches his hench-\n      man, using his dead body as a shield; Nico's BULLETS blow Chi\n      Chi apart. Zagon FIRES back, hits Nico in the side by the\n      ribs! Nico tries to fire back; he's empty!\n<b>                              ZAGON\n</b>                Now!\n      Nico bolts for the stairwell to the roof, clawing for a new\n      clip as he goes. Salvano and Zagon burst into the hallway,\n      SHOOTING at Nico.\n<b>308   INTERCUT - ELEVATED TRAIN\n</b>      THUNDERING along the tracks adjacent to the building.\n\n<b>309   EXT. ROOF - NIGHT\n</b>      Nico highballs from the stairwell as the tarpaper roof erupts\n      all around him with GUNFIRE from the floor below! He dives\n      sideways, rolling to avoid the fire -- He recovers his\n      footing in time to see Salvano and Zagon burst onto the roof\n      from the stairwell. Nico's BULLETS miss them; they separate,\n      taking cover behind two walls at the roof's margins. Nico\n      is trapped -- in the open.\n<b>310   ZAGON AND SALVANO\n</b>\n      pop back out, aiming at Nico --\n<b>311   NICO\n</b>\n      leaps off the roof!\n\n<b>312   ANGLE - ELEVATED TRAIN - MOVING\n</b>      Nico lands on the roof of the speeding \"el\" train, his\n      momentum nearly carrying him off the far side --\n\n<b>313   NICO - ATOP TRAIN\n</b>      catches a railing, claws at it.   BULLETS rip into the train\n      roof all around him --\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                          84.\n\n<b>314    ATOP TENEMENT ROOF - SALVANO AND ZAGON\n</b>       FIRE for all they're worth at Nico's receding form.\n\n<b>315    ATOP TRAIN - NICO\n</b>       crawls to the space between cars, lowers himself down.      He\n       clings to the swaying chains.\n\n<b>315A   INT. TRAIN CAR\n</b>       Nico staggers through the almost empty car and collapses on\n       a bench.\n\n<b>316    AROUND CORNER - TWO POLICE CARS\n</b>       hurtle INTO VIEW under the El, SIRENS BLARING.                   *\n\n<b>317    BACK ON TENEMENT ROOF\n</b>       Zagon and Salvano scramble away.\n<b>318    OMITTED\n</b><b>                                                 CUT TO:\n</b>\n<b>319    EXT. EL STATION - STAIRWAY TO STREET - NIGHT\n</b>       A cleaner, more upscale neighborhood. Nico labors down the\n       steps, clutching his jacket to his ribs. Several affluent\n       people look at him oddly, he ignores them, keeps going -- He\n       makes his way up the street, weakening, to a tasteful brown-\n       stone. Nico climbs the steps in pain --\n<b>                                                 QUICK DISSOLVE TO:\n</b>\n<b>320    INT. JACKSON'S APARTMENT - BATHROOM - NIGHT\n</b>       Nico over the sink, shirt off, WATER RUNNING -- applying a\n       makeshift bandage to his bloody ribs. We see Jackson's make-\n       up stuff along the counter, feminine robes hanging on the\n       door, law books around a reading stand. Nico is in real\n       pain, exhausted, weakening --\n\n<b>321    LIVING ROOM - NIGHT\n</b>       Nico at Jackson's desk, its surface spread with the notes\n       and papers she got from Senator Harrison's aide's place. We\n       glimpse them: photos of Central American atrocities, dead\n       bodies, etc. He tries to study them, quickly, but his\n       attention shifts --\n\n       Nico glances around the apartment: more law books, Jackson's\n       degree on the wall, her rowing machine on the floor, several\n       framed photos beside him on her desk. Nico turns several\n       toward him.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                          85.\n\n<b>322    INSERT - FRAMED PHOTOS\n</b>       Jackson with her sisters and their kids, Jackson in law\n       class, Jackson and Nico posing, smiling, at the police shoot-\n       ing range --\n<b>323    BACK TO NICO\n</b>\n       He starts to cry.\n\n<b>                                  NICO\n</b>                           (to Jackson's photo)\n                    -- Had to be a hero... another fucking\n                    hero. I'm sorry Jax.\n       He reaches for a small calendar, looks at it.\n\n<b>324    CLOSEUP - CALENDAR\n</b>\n       Nico circles \"meet with Father Tomassino.\" Nico circles\n       another date, \"Senator delivers foreign policy position\n       paper/Committee for Democratic Policy fund raiser.\"             *\n<b>325    OMITTED\n</b><b>&amp;\n</b><b>326\n</b><b>327    BACK TO NICO\n</b>       Nico scoops up the aide's papers, stands, wobbly --\n\n<b>                               NICO\n</b>                 -- Senator... --\n                        (of papers, with scorn)\n                 -- dumb fuck... think they're gonna\n                 let you put 'em outta business --\n<b>327A   INT. EMERGENCY ROOM CORRIDOR - NIGHT\n</b>\n       Several cops frantically clear the way to the emergency room.\n       A gurney is wheeled down the corridor. Lukich, a shoulder\n       bandaged, walks beside the gurney, holding the hand of Jackson.\n\n<b>327B   CLOSEUP ON\n</b>       a bloody flak jacket rests upon the gurney.\n\n<b>327C   CLOSEUP - JACKSON\n</b>\n       She's been sedated. She has buckshot wounds on her neck and\n       shoulder, but she is alive.\n\n<b>                                  JACKSON\n</b>                           (to Lukich)\n                    You call Nico's goddamn Uncle and\n                    find out if he's heard anything.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                        85A.       *\n\n<b>                               LUKICH\n</b>                        (wounded himself)\n                 You just shutup and take it easy,\n                 pal.\n\n<b>328    INT. TAXI - NIGHT\n</b>       CLOSEUP of Nico riding through the wet streets.\n\n<b>328A   INT. EMERGENCY ROOM\n</b>       Lukich is on the phone. His shirt is off and he's being\n       bandaged. In the background Jackson is also being cared\n       for.\n<b>                               LUKICH\n</b>                        (on phone)\n                 We don't know what happened to him,\n                 Branca. Ya, she's gonna be alright.\n<b>328B   INT. BRANCA'S SAFE HOUSE - NIGHT\n</b>       Branca, a bodyguard next to him, grimly puts down the phone.\n       He looks devastated.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         86.\n\n<b>329   EXT. DRIVEWAY - BRANCA'S SAFE HOUSE - NIGHT\n</b>      From the darkness, Nico appears, barely making it up the\n      driveway. We hear the sound of the CAB DRIVE OFF.\n\n<b>330   EXT. BRANCA'S SAFE HOUSE - NIGHT\n</b>      Branca and a bodyguard come forward, grabbing Nico as Nico\n      almost collapses.\n\n<b>                                BRANCA\n</b>                Jesus Christ!\n\n<b>                              NICO\n</b>                The motherfuckas got Jackson.\n<b>                              BRANCA\n</b>                Lukich called. She's not dead.\n                She's gonna make it. She was\n                wearing a vest.\n      Nico can't believe it. In spite of it all, life comes to\n      him. A little smile...\n<b>                              NICO\n</b>                That broad didn't trust me.\n<b>                                                 CUT TO:\n</b><b>331   EXT. BRANCA'S SAFE HOUSE - POV FROM WINDOW - NIGHT\n</b>\n      We glimpse several armed bodyguards in concealed positions.\n      A late-model Cadillac pulls up. A man carrying a doctor's\n      bag gets out and is escorted to the side door.\n<b>332   INT. BRANCA'S SAFE HOUSE - NIGHT\n</b>      Rosa has pulled back the curtain from the second-floor bed-\n      room window. She witnesses the arrival of the doctor. On\n      the bed behind her sleep Sara and Julian. A bodyguard          *\n      stands outside the bedroom door.\n<b>333   INT. BASEMENT FAMILY ROOM - NIGHT\n</b>\n      The doctor tends Nico. Bloody bandages and antiseptic\n      bottles litter a coffee table. Two guards stand by. Branca\n      is showing Nico an 8-by-11 photograph.\n\n<b>                              BRANCA\n</b>                It was picked up with your mail this\n                afternoon.\n\n<b>334   INSERT - PHOTOGRAPH\n</b>\n      A shot of Nico's family taken from a parked car, in front of\n      the church, the morning of the bombing.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          87.\n\n<b>335   BACK TO NICO AND BRANCA\n</b>      Nico's grim expression shows he knows just what this means.\n\n<b>                              BRANCA\n</b>                Don't worry, they're booked on an early\n                plane. They'll be out of the country\n                tomorrow.\n\n      Nico winces as the doctor finishes applying a bandage.      In\n      the background we hear a COMMOTION.\n<b>336   INT. BASEMENT STAIRWAY - NIGHT\n</b>\n      A bodyguard tries to fend off the physical and verbal assault\n      from Sara and Rosa. Sara carries Julian.                      *\n\n<b>337   INT. BASEMENT FAMILY ROOM - NIGHT\n</b>\n      Sara rushes to Nico's side.    Nico reaches for her, but         *\n      the pain stabs him.\n<b>                              SARA                                     *\n</b>                Oh my God, Nico!                                       *\n      Rosa starts forward, her face in agony at the sight of her\n      wounded son.\n<b>                               BRANCA\n</b>                He's fine.   The boy has ribs of steel!\n\n<b>                              ROSA\n</b>                       (touching Nico's brow)\n                Enough of your humor.\n      Sara clings to Nico's arm, tears in her eyes. Rosa               *\n      crosses herself. Sara begins to weep. The doctor finishes.       *\n      There's a long awkward moment. Then:\n\n<b>                              BRANCA\n</b>                       (to doctor and\n                        bodyguards)\n                Leave them. Leave them alone.\n\n<b>                                                  QUICK DISSOLVE TO:\n</b><b>338   INT. FAMILY ROOM - LATER\n</b>\n      Rosa sits in a chair. Nico on the couch, holding Julian.\n      Sara faces him. Tears have stained her cheeks, but she           *\n      is in control of her emotions now.                               *\n\n<b>                              SARA\n</b>                -- You've got to do it, Nico.    You\n                know you have to.\n      Whatever Sara is proposing, Nico is dead set against it.\n<b>\n</b>ABOVE THE LAW - Rev. 4/29/87                         88.      *\n\n<b>                        ROSA\n</b>          Listen to her, Nicola.\n                 (dead serious)\n          Whatever you think of him, Federico\n          is family. He is our family.\nNico makes no response.   Instead, he lifts Julian, nuzzles\nhim tenderly.\n\n<b>                        NICO\n</b>          Ever notice how clean babies smell?\n          Like nothing in the world has touched\n          them yet.\n\nSara glances to Rosa. Rosa knows what she wants. Dis-\ncreetly Rosa rises, exits. Sara and Nico are alone.\n\n<b>                        SARA\n</b>          If you won't go to him, I will.\n<b>                        NICO\n</b>                 (in pain)\n          Don't push me like this --\nHer eyes meet his -- loving, but desperate.\n\n<b>                        SARA\n</b>          Branca can put us on a plane -- but\n          where can we fly to? Tibet? The moon?\n          There's nowhere they can't find us.\n\n<b>                        NICO\n</b>          You don't know what the hell you're\n          talking about.\n<b>                        SARA\n</b>          I'm talking about everything I've\n          learned from you in the past five\n          years.\n\nNico is in agony.\n<b>                        NICO\n</b>          You know I can't go to him.\nSara takes both his hands in hers.\n\n<b>                        SARA\n</b>          Do you know why I love you? Do\n          you know what it is about you\n          that I've always loved?\n                 (as Nico fights his\n                  own emotion)\n          Pride. It's what you have inside.\n          You don't live the way other people\n          live. You trust what you see as\n          right and won't let anyone or anything\n          make you stray from it.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           88A.      *\n\n      MOVE IN PAST Sara TO Nico's face.\n<b>                              SARA (O.S.)\n</b>                But now that pride may kill all\n                of us.\n                       (beat)\n                You've got to swallow that pride,\n                Nico. Choke on it if you have to.\n                Lay it aside.\n\n<b>339   ANOTHER ANGLE - NICO AND SARA\n</b>      Close together, with their baby between them. Sara\n      buries her face against her husband's chest. Nico's arm\n      goes around her. He holds her tight.\n<b>                                                   CUT TO:\n</b>\n<b>340   CLOSE - NICO - AGAINST WALL - DAY\n</b>      He wears a suit and tie, a hat.   All business.\n<b>                              MAN (O.S.)\n</b>                Is this the attorney?\n<b>                              ANOTHER MAN (O.S.)\n</b>                You can come now, Mr. Carlucci.\n      O.S. we hear a METALLIC sound BEGIN, VERY CLOSE -- PULL\n<b>      BACK TO:\n</b>\n<b>341   ANOTHER ANGLE\n</b>      To reveal bars which slide electrically to the side.    A\n      prison door opens, letting him through.\n\n<b>342   ANGLE - PRISON CORRIDOR - DAY\n</b>      Nico, escorted by a prison guard, walks down a long, blank\n      hallway.\n<b>                                                   CUT TO:\n</b>\n<b>343   NICO\n</b>      Waiting in a barren reception room.   Several benches, tables;\n      heavy steel mesh over windows --\n\n<b>344   NICO'S POV - ACROSS ROOM\n</b>      A steel door opens on the far side. Out steps a small\n      Italian man in his seventies, wearing the faded denim of\n      an inmate.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                         88B-90.\n\n<b>345   INT. PRISON CORRIDOR - LONG SHOT - DAY                          *\n</b>      Nico and the small man (FREDERICO LARUSSO) walk together down *\n      a long corridor, speaking occasionally, the tension thick     *\n      between them. Behind them, a discreet fifteen paces, walk     *\n      two armed prison officials.\n<b>346   CLOSER - LARUSSO AND NICO\n</b>\n      The old man never looks directly at Nico, yet we sense keenly\n      that he is taking the younger man's measure.\n<b>                              FREDERICO LARUSSO\n</b>                I am only an old man. An old man\n                with a cancer.\n      The two are like an old and a young lion, appraising each\n      other -- using all five senses and more.\n\n<b>                              NICO\n</b>                I don't have much time, Uncle.    So\n                I must speak plainly.\n      Larusso listens.   Nico waits for a beat.   Then:\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                          91.\n\n<b>                              NICO\n</b>                       (this is very painful\n                        for him)\n                -- For as long as I've been old enough\n                to think, I've hated you and hated\n                everything you stood for.\n      Larusso takes this in without a flicker.\n\n<b>                              NICO\n</b>                I was so sure that you and I were on\n                opposite sides of the fence... and\n                that you and your people were\n                destroying this country --\n      Nico pauses, glances away across the grounds.\n\n<b>                              NICO\n</b>                -- The most painful realization of my\n                life was that the people I worked for\n                and you are not far apart.\n                       (meets Larusso's eyes)\n                -- And there's not much difference\n                between what you are and what I was.\n      Larusso studies Nico a long moment.    Then takes Nico's elbow. *\n<b>                                                                      *\n</b><b>347   OMITTED                                                         *\n</b><b>348   NICO AND LARUSSO\n</b>\n      continue across the grounds.\n<b>                                 FREDERICO LARUSSO\n</b>                I will be    candid with you. I knew,\n                probably    before you did, that you\n                would be    coming to me. I knew what\n                you would    ask... and I had every\n                intention    of refusing you.\n\n      He glances to Nico.\n<b>                              FREDERICO LARUSSO\n</b>                But it is a form of wisdom to know\n                when to cease relying only upon\n                yourself.\n\n      He keeps walking.\n\n<b>                              FREDERICO LARUSSO\n</b>                You know, of course, that this Senator\n                Harrison will never live to make his\n                speech tomorrow.\n                       (as Nico acknowledges)\n                You know, too, that as long as this\n                man... this torturer --\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                             92.\n\n<b>                                 NICO\n</b>                   Kurt Zagon.\n\n<b>                                  FREDERICO LARUSSO\n</b>                   -- As long as this Zagon lives, nothing\n                   I can do will guarantee your family's\n                   safety.\n                           (beat)\n                   'Ecce non uomine, ecce bestie.' You\n                   know Dante?\n                           (translates)\n                   'These are not men, these are animals.'\n\n      Larusso stops, takes a small note pad from his pocket.         He\n      quickly scribbles a few lines.\n<b>                                 FREDERICO LARUSSO\n</b>                   Memorize this address.\n\n      He holds the paper for Nico to see.\n<b>                                 FREDERICO LARUSSO\n</b>                   Have you got it in your mind?\n      Nico nods.    Larusso tears the paper into tiny shreds.             *\n\n<b>349   INT. ADMIN BUILDING - RECEPTION ROOM - DAY\n</b>      The old man takes his leave of Nico with a warm, if formal\n      handshake. The guards stand by, waiting.\n\n<b>                                 FREDERICO LARUSSO\n</b>                   Thank you, Mr. Carlucci. I trust you\n                   will give my love to my niece, Rosa.\n<b>                                 NICO\n</b>                   I will do that, Mr. Larusso.\n                          (sincerely)\n                   I hope you will be well.\n\n<b>350   LARUSSO\n</b>      nods: \"Bene.\" Then: without a word he turns and exits\n      back through the steel door.\n<b>                                                     CUT TO:\n</b>\n<b>351   INT. O'HARE AIRPORT - BOARDING GATE - DAY\n</b>\n      Passengers file aboard a flight to Toronto. Hugs, goodbyes.\n      Rosa, carrying the baby, is among the crowd moving toward\n      the boarding door. Leaving with them are two of Branca's\n      men. We PICK OUT Branca and two of his bodyguards near the\n      fringes, looking inobtrusive but definitely on guard.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           92A/93.\n\n<b>352   CORNER NEAR BRANCA\n</b>      Hidden by a bank of phones, Sara clings to Nico, holding      *\n      him as tight as she can. When she releases him, we can't\n      hear what she says, but it seems like, \"Be careful, please be\n      careful.\" Nico glances to Branca, who motions subtly to\n      hurry.\n\n      He squeezes Sara's hand, she joins the crowd swelling            *\n      toward the boarding door --\n<b>                                                   CUT TO:\n</b>\n<b>353   EXT. O'HARE - RUNWAY - DAY (STOCK)                               *\n</b>      An Air Canada PLANE BLASTS skyward.\n\n<b>354   NICO AND BRANCA\n</b>\n      watch from an open corner of a parking lot. As the plane\n      begins its bank to gain altitude, Branca turns to Nico.\n      The two bodybuards keep a discreet watch nearby.\n<b>                              BRANCA\n</b>                You got the architect's drawings?\n                Wiring, floor plans --\n      Nico indicates a briefcase he is carrying.\n<b>                              NICO\n</b>                It's all here.\n      Nico turns to his uncle.    Regards him with affection.\n<b>                              BRANCA\n</b>                I could help you from here on.\n<b>                              NICO\n</b>                It's not your business.\n\n      Nico embraces his uncle by both shoulders.\n<b>                              NICO\n</b>                Grazie, tio caro.\n      Branca pats Nico's cheek.\n\n<b>                              BRANCA\n</b>                Take care of yourself, Nicola.\n<b>                                                   CUT TO:\n</b>\n<b>355   SERIES OF SHOTS\n</b>\n      SEVERAL SHOTS of high-rise cityscapes at night.\n<b>                                                   DISSOLVE TO:\n</b><b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                        94.\n\n<b>356    OMITTED                                                       *\n</b>thru                                                                 *\n<b>360                                                                  *\n</b>\n<b>361    TELESCOPE POV - CHICAGO SKYLINE - NIGHT\n</b>       CAMERA PANS TO the apartment complex across the plaza.\n       FOCUS ON one suite on the topmost floor. Curtains are drawn\n       on all windows, but through one crack we glimpse a man\n       pacing. The man wears a white shirt and a shoulder holster.\n<b>362    RAISE TELESCOPE POV\n</b>\n       TO the roof of the apartment complex. We see a heli-pad.\n       Two more men, also in suits -- smoking, talking.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                             95.\n\n<b>363   LOWER TELESCOPE POV\n</b>      BACK TO the apartment suite. Now another man crosses before\n      the gap in the curtains. Wearing a cowboy hat: Zagon!\n      He's laughing, pouring himself a drink at the wet bar --\n<b>364   EXT. ROOFTOP SKYSCRAPER - NIGHT                                *\n</b>\n      Nico, looking through a high-tech night telescope. His         *\n      briefcase is by his feet, open. Several architect's            *\n      drawings, floor plans visible.\n<b>365   NICO\n</b>\n      lifts his eye from the scope, jots a note on a pocket pad.     *\n<b>                                 VOICE (O.S.)\n</b>                   Not even you can hit him at this range,\n                   Nico.\n      O.S. behind Nico: the unmistakable sound of a .45 SAFETY\n      being CLICKED OFF. Nico freezes, his back to the voice. He\n      raises his hands.\n<b>                                 NICO\n</b>                   That wasn't the plan, Nelson.\n<b>366   NELSON FOX\n</b>      covers Nico from behind with a silencer-fitted .45. He\n      glances to the briefcase and building plans, on the floor.\n<b>                                 FOX\n</b>                   Close range, huh? Never work. Place\n                   is rigged, scanned every 35 seconds.\n\n<b>                                 NICO\n</b>                          (back still turned)\n                   I was thinking of a mine on the roof.\n                   Remote-triggered, when the chopper\n                   comes in.\n<b>                                 FOX\n</b>                   Roof's wired too.   Sensors every\n                   fifteen feet.\n      Fox's finger rests ready on the trigger.\n\n<b>                                 FOX\n</b>                   You can turn now.   Slowly.   Slooowly...\n      Nico turns. We see Fox clearly now. His boyish features\n      have weathered since his \"spook\" days in Vietnam. There is\n      grey in his hair now: he wears an expensive suit and is\n      alone.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                         96.\n\n<b>                               FOX\n</b>                 I figured you'd do your recon from this\n                 building.\n\n       Nico regards his old mate across the gun barrel.\n<b>                               NICO\n</b>                 You're looking fit, Nelson.\n\n<b>                               FOX\n</b>                 Getting a bit of a tire.\n<b>                               NICO\n</b>                        (indicates Fox's suit)\n                 Your own tailor?\n<b>                               FOX\n</b>                 Hong Kong.\n\n<b>                               NICO\n</b>                 You've gone a long way.\n       Fox motions for Nico to dump his gun; Nico complies, dropping\n       it gently into the briefcase. Nico takes half a step toward\n       Fox. Fox shakes his head in warning.\n\n<b>                               FOX\n</b>                 Uh uh.  Uhhh-uh...\n                        (motions Nico back)\n                 I know what you can do when you get too\n                 close to a man.\n<b>367    CLOSEUP - NICO                                                  *\n</b><b>                               NICO                                    *\n</b>                 I don't believe you, Fox.                             *\n<b>367A   INT. BUILDING CORRIDOR - NIGHT                                  *\n</b>\n       Nico walks, hands behind his head. Fox is catty-corner be-    *\n       hind him, carrying the briefcase, .45 leveled at Nico's back. *\n<b>                               FOX\n</b>                 -- What's so hard to believe. I\n                 want to help you, you dumb guinea!\n<b>                               NICO\n</b>                 Fox the fixer.\n\n<b>                               FOX\n</b>                 If I wanted to cap you, I'd have saved\n                 myself this chit-chat. Make big points\n                 for me to bring in your scalp. I'd be\n                 White House material.\n<b>                               NICO\n</b>                 Is that what Zagon is?    One of your\n                 basement boys?\n<b>\n</b>ABOVE THE LAW - Rev. 4/17/87                96A.\n\n<b>                       FOX\n</b>         Zagon's a rancher. 4000 acres in\n         Costa Rica. Beautiful place.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                         97.        *\n\n<b>                               NICO\n</b>                 Bought with what -- opium from Cambodia?\n\n<b>                               FOX\n</b>                 And a ton a week of coke from other\n                 places.\n<b>                               NICO\n</b>                 Which he funnels here through Salvano.\n                 With the Company getting its cut.\n<b>                                 FOX\n</b>                 Legal tender.\n\n<b>                               NICO\n</b>                 Still dodging appropriations\n                 committees, eh, Nelson?\n\n<b>                               FOX\n</b>                 That's my job, Nico.\n       They arrive at an elevator.\n<b>                               FOX\n</b>                 Keep your nose in the corner. When\n                 we get out, stay five paces ahead of\n                 me. Cross down to the garage.\n<b>367B   INT. LOWER CORRIDOR\n</b>       Nico and Fox emerge from the elevator. Nico lowers his hands\n       from behind his head. Fox keeps his gun out of sight as he\n       and Nico step past.\n<b>368    ELEVATOR BANK - NIGHT\n</b>\n       Fox maintains a slight distance behind Nico as they cross to-\n       ward some escalators under a sign: \"TO PARKING LEVEL 8.\"\n\n<b>                               NICO\n</b>                 The Senator couldn't be bought, could\n                 he? He was gonna blow the lid off, so\n                 you cleared Zagon to frost him --\n\n<b>                                 FOX\n</b>                 Keep walking.\n\n<b>369    INT. PARKING STRUCTURE\n</b>\n       They reach a corner and turn.\n<b>\n</b><b>                                          97A.\n</b>\n<b>              NICO\n</b>But the priest found out somehow and\nran here. You couldn't do the Senator's\nnumber 'till you knew if the priest had\ntalked. So Zagon flew in with his\nlittle medical bag. Only by then I was\nin on it -- and you thought I might\nrecognize his handiwork.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                        98.\n\n<b>370   PARKING GARAGE - VALET STATION                              *\n</b>      Several guests and diners wait by the cashier's booth for\n      their cars to be fetched. Valets hustle with tickets. Fox\n      and Nico come off the escalator.\n<b>                             FOX\n</b>               If your name was Joe Smith I never\n               would have caught it. But how many\n               Nicola Toscani's are there?\n<b>                             NICO\n</b>               You got it off the arrest sheet.\n\n      Fox hands his ticket to the cashier, motions Nico to the\n      side, away from the guests, still keeping his distance --\n      should Nico try to make a move.\n\n<b>                             FOX\n</b>               I tried to warn you, old buddy. I knew\n               you had wiretaps. and I knew you\n               wouldn't let 'em go.\n<b>                             NICO\n</b>               Only I was too dumb to crack it. I was\n               so busy trying to figure a code, I\n               didn't even recognize Zagon's voice.\n      It's all crystal clear to Nico now.\n<b>                             NICO\n</b>               So we kill our own senators now.\n<b>                              FOX\n</b>               Why not?   The Romans did.\n\n      A Cadillac pulls up; the valet hops out, two particularly\n      florid, well-fed guests get in, tipping the valet.\n\n<b>                             NICO\n</b>                      (to Fox, watching the\n                       guests)\n               Are we the Romans?\n\n<b>                             FOX\n</b>               We're an empire too.\n\n      Fox doesn't like the look Nico gives him.\n\n<b>                             FOX\n</b>               Would you rather spoon borscht and\n               quote Lenin?\n                      (losing patience)\n               I'm trying to save you, asshole! I got\n               a spot for you. Thailand, deep under,\n               no names, no numbers --\n<b>\n</b><b>                                                     99.\n</b>\n<b>                       NICO\n</b>         Doing what -- processing heroin?\n\n<b>                       FOX\n</b>         You 'consult.' You 'assist.' You send\n         checks to your family. Zagon won't\n         touch you, you'll be on the team --\n\n<b>                       NICO\n</b>         Fuck you.\n<b>                       FOX\n</b>         In five years you're out, with a fat\n         Swiss account and a GS-15 pension.\nNico stares at his old friend with contempt. He sees the\ngun under Fox's coat, but he's too tired and too disgusted\nto care --\n\n<b>                       NICO\n</b>         You know, Fox, right now in Israel\n         they're trying some 80-year-old camp\n         guard for war crimes. And all around\n         our country there are guys on Death\n         Row for killing one person, two people.\n         And probably they all deserve it --\nHe takes a step toward Fox.   Fox's hand tightens on his gun.\n<b>                       NICO\n</b>                (emotion rising)\n         -- but you and I know a couple guys\n         personally who are responsible for the\n         murder of at least what... 60,000 non-\n         military personnel.\n                (ticks off the beats)\n         Viet. Lao. Thai. Cambodian.\n         Librarians, teachers, doctors... women,\n         children... and that's just a sliver of\n         it.\nFox tries to maintain a hard face.   But his own guilty\nconscience is working --\n\n<b>                       NICO\n</b>                (presses closer)\n         We've wiped out entire fucking\n         countries. And not one agent --\n\n<b>                       FOX\n</b>                (moves gun into Nico's\n                 view)\n         Stop right there!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                           100.\n\n<b>                                NICO\n</b>                         (doesn't stop)\n                  -- not one C.I.A. agent has ever been\n                  tried or convicted, much less accused\n                  of any crimes.\n                         (closer still)\n                  You motherfuckers think you're above\n                  the law --\n                         (right in Fox's face)\n                  Well, you ain't above mine.\n      Nico holds himself, trembling with intensity. At that\n      moment -- O.S. from the garage entrance ramp: the SQUEAL\n      of APPROACHING TIRES. Nico and Fox turn to see --\n<b>*NOTE* 4-17-87. THE FOLLOWING SEQUENCE (SCENES 371 - 401) WILL BE\n</b><b>       MODIFIED TO CONFORM TO LOCATION. DO NOT BUILD OR PURCHASE\n</b><b>       WITHOUT CHECKING WITH STUNT COORDINATOR AND ASSISTANT\n</b><b>       DIRECTORS. STORYBOARDS AND NEW PAGES WILL BE AVAILABLE NEXT\n</b><b>       WEEK.\n</b><b>371   A BIG CAR                                                      *\n</b>      SCREECHES to a halt in front of them. Five men dismount        *\n      swiftly. Salvano, Bad Dude, and two agent types from the       *\n      tenement... and Zagon!                                         *\n      Zagon and his men are forty feet from Nico and Fox, playing\n      it cool so as not to alarm any innocent bystanders, but the\n      bulk under their jackets is unmistakably guns.\n\n<b>                                  NICO\n</b>                  Well... well.    What a team we have\n                  here.\n<b>                                ZAGON\n</b>                         (calls, friendly)\n                  We've been looking for you, Nelson.    I\n                  see you've found our friend.\n\n      Fox looks shaky, unnerved: Nico's words have hit too close\n      to home. Now Nico backs away a step, ready for anything.\n      One of Zagon's agents holds their car's rear door open.        *\n\n<b>                                NICO\n</b>                  Thanks for the help, Fox.\n\n<b>                                FOX\n</b>                  I didn't bring him, Nico.    I swear it!\n<b>                                ZAGON\n</b>                  Have you two been sharing fond memories?\n                  Reminiscing about the good old days?\n\n      Zagon waves Nico and Fox toward his car. Zagon and             *\n      Salvano start forward. Fox glances, torn, to Nico, who\n      has backed away another half-step. Will Nico attack?\n      Run for it?\n<b>\n</b><b>                                                    100A.\n</b>\n<b>                       FOX\n</b>         Stay still!\n                (to Nico)\n         Don't fucking move!!\n\nFox pulls his .45 from concealment, covering Nico. An\nEVENING-GOWNED WOMAN, waiting with her husband for their\ncar, hears Fox's shout, sees his gun.\n<b>\n</b><b>                                                          101.\n</b>\n<b>                              EVENING GOWN WOMAN\n</b>                       (grabs her husband's arm)\n                Jack --\n\n      The husband sees. So do the other guests. Salvano sees\n      their alarm; he swings his jacket open, revealing a snub\n      machine gun. Someone SCREAMS --\n\n<b>                              ZAGON\n</b>                Bring in our friend, Nelson.\n      Salvano's muzzle covers Fox and Nico --\n\n<b>                              ZAGON\n</b>                Be a good boy --\n<b>372   FOX\n</b>\n      His moment of truth.\n<b>                               FOX\n</b>                Dive, Nico!!\n      He FIRES -- at Salvano! In the same instant, Salvano pulls\n      his own trigger! Salvano's MACHINE GUN BURST cuts Fox down,\n      a milli-second before Fox's .45 SLUG BLOWS Salvano off his\n      feet! Pandemonium. Fox, dying, slings his .45 to Nico, who\n      snatches it from the ground just as a HAIL of MACHINE GUN\n      FIRE THUNDERS around him. Nico dives headlong behind a\n      concrete column, which is instantly chewed to shreds by\n      GUNFIRE. Zagon FIRES his MAC-10 on full automatic. A\n      second agent hurries forward to outflank Nico. Nico pops\n      from behind the column, DRILLS the agent broadside behind\n      the ear, blowing the whole side of his head off! Guests and\n      valets are shrieking in terror, hitting the deck in\n      clusters, clawing and scrambling over each other for safety.\n<b>                               ZAGON\n</b>                        (to first agent,\n                         advancing)\n                Move!\n      Nico springs from cover, FIRING, trying to bolt down the\n      garage ramp, toward the lower levels. His path puts the\n      first agent directly in Zagon's line of fire. Zagon doesn't\n      hesitate; he OPENS UP on Nico, cutting down his own man --\n      Salvano has gotten to his feet, wounded, but still handling\n      his gun. He  joins Zagon, rushing forward --\n\n<b>373   RAMP TO LOWER LEVELS\n</b>      A valet rounds a corner, unsuspecting, bringing up a car.\n      Nico is on him like a cat, tearing the poor boy from behind\n      the wheel, leaping in --\n<b>\n</b>       ABOVE THE LAW - Rev. 4/17/87                          102.\n\n<b>374    ZAGON AND SALVANO\n</b>       tear around the corner at the top of the ramp.    Both OPEN\n       FIRE as --\n\n<b>375    NICO - IN CAR\n</b>       highballs straight toward them!\n\n<b>376    SALVANO\n</b>       hold the trigger down, FULL AUTOMATIC --\n\n<b>377    NICO'S CAR (MOVING)\n</b>       Nico drops below the dash, driving blind. The WINDSHIELD is\n       BLOWN APART, both FRONT TIRES EXPLODE, the RADIATOR BLASTS\n<b>       STEAM --\n</b>\n<b>378    ZAGON\n</b>       Reloading as Salvano FIRES.\n<b>379    NICO'S CAR\n</b>       pinwheels out of control, its nose facing away from Salvano\n       and Zagon. The car BRAKES FURIOUSLY --\n<b>380    NICO\n</b>       hits reverse, looking back over the seat --\n<b>381    NICO'S POV - THROUGH REAR CAR WINDOW\n</b>       He sees Salvano, his clip empty now, hurrying to wrestle a\n       fresh magazine in --\n<b>382    ANGLE - NICO'S CAR AND SALVANO\n</b>\n       Nico floors it in reverse, slamming into Salvano, lifting\n       him off his feet, smashing him with the car into a metal      *\n       grate wall.                                                   *\n\n<b>383    SALVANO\n</b>       A horrible death.\n\n<b>383A   EXT. PARKING STRUCTURE - NIGHT                                *\n</b>\n       From the eighth floor the metal grate of the parking struc-   *\n       ture blows out onto the street below, followed by Salvano's   *\n       body.                                                         *\n\n<b>384    NICO - BEHIND THE WHEEL\n</b>       BURNING RUBBER FURIOUSLY, away from the wall --\n<b>\n</b><b>                                                          102A.\n</b>\n<b>385   ZAGON\n</b>      Reloaded, turning his gun toward Nico, when --\n\n<b>386   TWO UNIFORMED HOTEL SECURITY GUARDS\n</b>      hurtle around the corner from the escalators, guns drawn.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                          103.\n\n<b>                                FIRST SECURITY GUARD\n</b>                         (shouts to Zagon)\n                  You there --\n\n      Zagon spins, rips both guards with a FIERCE BURST!    The\n      Guards drop. Zagon turns to --\n<b>387   NICO - OUT OF CAR\n</b>\n      on his feet, charging straight at Zagon. Nico grabs him,\n      slams Zagon with incredible force into a concrete column.\n      Zagon's gun goes flying, but miraculously he spins away.\n      Nico dives for him, gets his neck in a grip that is certain\n      to snap it in half a second. But --\n<b>388   ZAGON'S KNIFE\n</b>\n      appears in the torturer's hand.    It slashes Nico, right a-\n      cross his already wounded ribs!    Nico cries in agony --\n<b>389   ZAGON\n</b>      scampers free. Nico gets to his feet, bleeding. Nico is\n      between Zagon and Zagon's machine gun on the ground. Zagon\n      bolts for his car. Nico dives for the gun --                      *\n\n<b>390   CAR                                                               *\n</b>      Zagon floors it into a SCORCHING 360, BLASTS up the exit\n      ramp, out of Nico's line of fire --\n\n<b>391   NICO\n</b>      leaps   into the other, half-destroyed car. Its two front\n      tires   are flat, windshield blown out, RADIATOR POURING STEAM.\n      Nico   does the only thing he can do: puts the pedal to the\n      metal   in reverse, BLASTS across the ramp divider, takes off\n      after   Zagon in reverse --\n\n<b>392   ON RAMP - ZAGON'S CAR                                             *\n</b>      Another car is coming down.    Zagon sideswipes it into a wall,\n      keeps going --\n\n<b>393   ON RAMP - NICO'S WRECKED CAR\n</b>      Rear TIRES CHURNING smoke, FRONT FLATS SCRAPING on their\n      rims... he pours on the speed --\n\n<b>394   TOP OF RAMP - HOTEL ACCESS DRIVE\n</b>      Zagon's car whips out into the night-time commotion.\n      Pedestrians, POLICE SIRENS O.S. Zagon looks behind him --\n\n<b>395   NICO'S CAR - TOP OF RAMP\n</b>      hurtles into view in reverse!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            104.\n\n<b>396   ZAGON'S CAR                                                      *\n</b>      is trapped   by the traffic. Zagon looks around wildly, then\n      floors the   accelerator. Zagon's car bucks straight up the      *\n      pedestrian   steps, onto the plaza! Strollers scream and\n      scatter as   it fishtails wildly, careening toward the           *\n      huge stone   fountain --\n\n<b>397   NICO'S WRECKED CAR\n</b>\n      Follows, pouring smoke, in reverse! Nico cuts Zagon off,\n      CRASHES into Zagon's car broadside, sending it skittering        *\n      sideways into the fountain retaining wall --\n\n<b>398   ZAGON\n</b>      leaps free, sprints toward the hotel alley.     Nico takes off\n      after him on foot --\n\n<b>399   EXT. ALLEY - REAR OF HOTEL - NIGHT\n</b>      Zagon races down the darkest of alleys, rounds a corner --\n<b>400   NICO\n</b>      hurtles after him, gaining.     Nico whips around the alley\n      corner, straight into:\n<b>401   FOUR ARMED AGENTS\n</b>      waiting beside a plain grey TV remote van. Nico skitters         *\n      to a stop as a shotgun, an M-16 and two pistols cover him.\n      Shotgun Agent raises his weapon to fire --\n<b>                                  ZAGON\n</b>                   No!   I want him! I want him alive!\n<b>402   EXT. MIDLAND HOTEL - NIGHT                                       *\n</b>\n      A banner reads:     WELCOME COMMITTEE FOR DEMOCRATIC POLICY      *\n<b>403   EXT. ANOTHER ALLEY - BEHIND MIDLAND HOTEL - NIGHT                *\n</b>\n      A car pulls up. Nico, his wrists tied, is dragged into the\n      basement of the hotel. Zagon follows.\n<b>                                                    CUT TO:\n</b>\n<b>404   INT. BASEMENT ROOM - NIGHT\n</b>      Sweating, windowless concrete. Overhead pipes. Churning\n      machinery. As the CAMERA REVEALS this airtight dungeon --\n\n<b>                                 PISTOL AGENT (O.S.)\n</b>                   -- this is bullshit, Zagon. We got\n                   work to do.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                        105.\n\n<b>                             ZAGON (O.S.)\n</b>               All work and no play makes Jack a dull\n               boy.\n\n<b>405   NICO\n</b>      in a metal chair, wrists taped in front of him. One agent\n      stands behind him, clasping a thin cable noose wrapped\n      tight around Nico's throat. Shotgun agent holds his\n      weapon on him, its twin muzzles inches from Nico's skull.\n<b>406   ZAGON\n</b>\n      finishes washing his hands in an industrial-type sink. He\n      is cleaned up, wearing a fresh shirt, his hair combed.\n      When he dries his hands, he looks like a surgeon preparing\n      to operate.\n\n<b>                             ZAGON\n</b>               We've got an hour before the\n               honorable senator.\n                      (hands towel to\n                       pistol agent)\n               You've got to learn to take time,\n               smell the roses.\n\n      Zagon turns to Nico.\n<b>                             NICO\n</b>               How are you gonna do him, Zagon?\n               In a motorcade? Or passing\n               through a hotel kitchen?\n      The Noose agent jerks his cable tight, making Nico gag and\n      choke. Zagon motions to slacken off. He stops at a\n      small table before Nico -- unrolls a well-worn felt pouch.\n      Zagon watches Nico's reaction as the tools of the inter-\n      rogator's trade come into view -- drug vials, syringes,\n      scalpels, surgical tools.\n\n<b>                             ZAGON\n</b>               I've used these little beauties\n               many times to extract information --\n                      (lifts a needle to\n                       the light)\n               -- This'll be the first time I've\n               ever used them... just for fun.\n\n      Zagon sets the syringe down, slips on a heavy, weighted\n      glove.\n<b>                             ZAGON\n</b>                      (to agents)\n               Take his arms.\n      Pistol agent and Bad Dude move in, one on each side,         *\n      seizing Nico's forearms. Shotgun agent holds his weapon\n      tight to Nico's head.\n<b>\n</b><b>                                                          106.\n</b>\n      Zagon punches Nico square in the face, so hard the chair\n      reels backward, spinning out from under Nico --\n\n<b>                              ZAGON\n</b>               Hold him up!\n      Pistol agent and Bad Dude lift Nico. Zagon slams him\n      again. Again. Nico's cheekbone is broken; blood drains\n      from his nose. Zagon aims a two-handed blow; backhands\n      Nico, crushing the other side of his face! Zagon backs\n      off, chest heaving. Pistol agent and Bad Dude plop Nico\n      back in the chair, gagging, choked by the noose. Nico\n      looks like the Viet prisoner -- the one we saw in the\n      opening sequence. Like the prisoner, Nico takes his\n      beating -- still conscious, still meeting Zagon's eyes\n      with defiance.\n\n<b>                             ZAGON\n</b>               This is where you came in, Toscani.\n               Only, now it's where you're gonna\n               check out.\n      He takes off his glove, grabs the syringe. Pistol agent\n      and Bad Dude clamp Nico's right arm down tight. Zagon\n      injects Nico.\n\n<b>407   NICO\n</b>      reacts instantly to the hypo -- cursing, sputtering under\n      the choking noose. He twists wildly trying to free him-\n      self, but the agents' powerful arms hold him.\n<b>                             ZAGON\n</b>               That's it. Fight it, cherry.\n               Fight it, so it speeds faster on\n               its way --\n      Nico struggles more violently.\n\n<b>                             ZAGON\n</b>               Fight it. Till the vessels burst\n               in your brain. Till the arteries\n               rupture in your heart --\n\n      Slowly, the struggle goes out of Nico. His muscles go\n      limp; he slumps -- drooling, babbling incoherently.\n\n<b>                             ZAGON\n</b>               That's my boy. That's what I was\n               waiting for --\n      Zagon produces his famous knife. He motions Pistol agent\n      and Bad Dude to release Nico's arms. Noose agent slackens\n      his grip on the choke cable. Zagon moves in closer,\n      gloating, cooing --\n<b>\n</b><b>                                                          107.\n</b>\n<b>                              ZAGON\n</b>                A fool learns from his own\n                mistakes. But a wise man learns\n                from the mistakes of others --\n                       (moves closer, blade\n                        in hand)\n                You should have killed me when\n                you had the chance, Toscani --\n\n      The blade moves to Nico's throat. Suddenly: Nico springs\n      to life (catching Noose man by surprise and jerking the\n      cable from his grip) -- grabbing Zagon with his taped\n      hands by the throat, lifting him bodily, slamming him\n      ferociously into the wall! Zagon drops to the floor,\n      half-conscious. Nico spins instantly to find: the Shot-\n      gun agent right behind him, raising his weapon to Nico's\n      face, about to pull the trigger. Nico sidesteps, grabbing\n      the man's wrist. The SHOTGUN GOES OFF, missing Nico by\n      inches, blasting a huge chunk out of the concrete wall.\n      The Noose agent draws his weapon from his shoulder\n      holster. Nico snaps the Shotgun agent's wrist, flipping\n      him through the air, simultaneously grabbing the weapon,\n      spinning behind the Noose agent, then using the shotgun\n      barrel like a club to smash the back of his head in!\n      Another swing wipes out Pistol agent. Bad Dude, now with\n      a clear shot, aims his M-16. Nico blows him away with a\n      double-barreled SHOTGUN BLAST. In a flash, Nico has spun\n      to Zagon's surgical tool table, lifted a rzor-sharp\n      scalpel and slashed the tape, freeing his hands. He\n      yanks the choke cable off his neck --\n\n<b>408   ZAGON - AGAINST WALL\n</b>      On his feet again. He reaches swiftly to the floor,\n      snatches up his famous knife. Nico confronts him -- face\n      battered, bloody -- shaking, battling internal spasms.\n<b>                              ZAGON\n</b>                Can you feel the chemicals,\n                cherry? You can't fight 'em much\n                longer --\n<b>                              NICO\n</b>                Long enough to finish you.\n      Sweating, half-spitting, Zagon slashes at Nico like an\n      animal -- Nico traps the knife, and enters, smashes Zagon\n      in the face with one lightning blow. We see Zagon's nose\n      and face completely cave in. Nico comes under Zagon's\n      elbow, the arm that still holds the knife clamping it in\n      a vise-like grip and bending it backwards, slowly, against\n      the joint -- which now starts to rip in half. Zagon is\n      screaming and cursing, writhing in agony -- The drugs\n      have hit Nico full force now. He's weakening, his eyes\n      are starting to roll. Zagon tries one last surge of\n      strength to save himself; it almost seems he'll wriggle\n      free when: the elbow JOINT SNAPS in half with a sicken-\n      ing sound.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                             108.\n\n       As the joint hangs, dangling grotesquely, Nico reaches up\n       around Zagon's neck, still holding the dangling limb with\n       one arm. He begins to now do to Zagon's neck what he did\n       to his arm. We hear a terminal CRACK. Zagon's body\n       crumples to the floor. Nico, in delirium, staggers\n       toward the door --\n<b>409    INT. HOTEL LOBBY - REAR STAIRWELL - NIGHT\n</b>\n       A woman at a pay phone.    She turns, drops the receiver\n       in shock as --\n<b>410    NICO\n</b>\n       bursts, delirious, from the stairwell door!\n<b>411    MAIN LOBBY - FRONT ENTRANCE\n</b>\n       A commotion as Lukich, Agent Neeley and Jackson, arm in a       *\n       sling, race in from their car.\n<b>412    MAIN LOBBY - REAR - NICO\n</b>       weaves wildly forward. He drops to his knees.     Guests\n       react in astonishment and horror.\n\n<b>412A   JACKSON\n</b>       is the first to spot Nico.    She runs up to him as he\n       collapses.\n\n<b>412B   NICO\n</b>       looks at Jackson.\n<b>413    LUKICH AND NEELEY                                               *\n</b>       reach Nico and Jackson.\n\n<b>                               LUKICH\n</b>                        (shouting for\n                         anyone)\n                 Is there a hotel doctor?    Call 911!\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                          108A.   *\n\n<b>414   NICO\n</b>      passes out in Jackson's arms. Behind them we see a banner,\n      announcing Senator Harrison's address. From the ballroom we\n      hear CHEERS and APPLAUSE. A fiery address is being finished\n      inside. The senator is now leaving.\n<b>415   FULL SHOT - LOBBY\n</b>\n      Total confusion. Guests staring everywhere. From a side\n      office, a man with a medical bag comes running. The senator\n      sees the group around Nico.\n\n<b>                                                FADE OUT.\n</b><b>      FADE IN ON:\n</b>\n<b>416   EXT. NICO'S HOUSE - DAY\n</b>\n      Press vans outside; a crush of cars, reporters, neighbors.\n      Newsmen are trying to gain access to the house, held back\n      by several cops and some of Nico's more strapping\n      relatives.\n<b>\n</b>       ABOVE THE LAW - Rev. 4/29/87                              109.\n\n<b>417    BUICK STATION WAGON\n</b>       escorted by two police motorcycles, pulls in. The press\n       surrounds it as Lukich, Neeley, Lieutenant Strozah and           *\n       Jackson, her arm in a sling, disembark from the car.\n<b>417A   SECOND CAR\n</b>\n       pulls up. Neeley walks over and opens the door as a court        *\n       stenographer, carrying her transcription machine case, steps\n       out -- followed by a federal judge, CLAYTON ALSPAUGH and\n<b>       SENATOR ERNEST HARRISON.\n</b>\n<b>418    REPORTERS\n</b>       shove mikes and cameras at the senator and the judge, shouting\n       questions. Lukich, Neeley and Strozah clear a path for them. *\n\n<b>419    ANGLE FROM INSIDE HOUSE - THROUGH FRONT WINDOW\n</b>       Harrison and Alspaugh fend off the questions, cross the path\n       and mount the steps to the house.\n<b>                                  T.V. REPORTER (O.S.)\n</b>                           (in front of house)\n                    -- Senator Harrison has today\n                    issued a statement calling for the\n                    appointment of a special prosecutor --\n<b>                                                       CUT TO:\n</b>\n<b>420    INT. NICO'S HOUSE - DAY\n</b>       Nico, propped up on the couch, looking like hell, but de-\n       finitely conscious and in full command of his faculties.\n       Sara, Jackson, and Rosa beside him.                              *\n<b>421    TV\n</b>\n       A network ANCHOR delivers the headline news.\n<b>                                  ANCHOR (V.O.)\n</b>                    Earlier this week, the Harrison\n                    Commission delivered its report\n                    on the growing C.I.A. scandal to\n                    Congress...\n\n       The image changes to SENATOR HARRISON behind a battery of\n       microphones, sitting at a senate hearing-type table, with a\n       plaque reading \"SEN. ERNEST HARRISON\" before him.\n<b>                                  SENATOR HARRISON (V.O.)\n</b>                           (on TV)\n                    -- officially-sanctioned deceit,\n                    murder and corruption, will\n                    continue until these men are\n                    brought to justice.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/17/87                        109A.\n\n<b>422   NICO                                                        *\n</b>      looks up as the real Senator Harrison, Judge Alspaugh and   *\n      the others enter the room. TV SOUND DOWN. Harrison stops\n      before Nico, taking a moment to look with respect and ad-\n      miration at the man propped up on the pillows.\n<b>\n</b>      ABOVE THE LAW - Rev. 4/29/87                            110.\n\n<b>                                SENATOR HARRISON\n</b>                  Detective Toscani. I wanted to personally\n                  thank you. You are making it possible for\n                  a sliver of truth to finally come out.\n\n      He holds out his hand.    Nico takes it.   The senator gestures\n      to Judge Alspauch.\n\n<b>                                SENATOR HARRISON\n</b>                  And this is Clayton Alspaugh of the\n                  fifth circuit court.\n<b>                                NICO\n</b>                  Your Honor.\n      The Judge nods to his stenographer, who swiftly sets up\n      her equipment, takes a seat. Rosa makes a face at Branca,\n      who rises, clearing a seat for the Judge. Sara moves              *\n      in tight beside Nico.\n<b>                                JUDGE ALSPAUGH\n</b>                  Are you sure you're feeling well\n                  enough?\n      Nico glances to Sara, to the supporting faces around              *\n      him. Lukich. Neeley. Strozah. Jackson. The others.                *\n<b>                                NICO\n</b>                         (to Alspaugh)\n                  If you're ready to listen, I'm\n                  ready to talk.\n<b>423   CLOSE - STENOGRAPHER'S HANDS\n</b>      As the Judge's VOICE begins OVER, \"slating\" the depo-\n      sitions, the stenographer's fingers start moving.\n<b>      PULL BACK TO:\n</b><b>424   ANGLE FROM OUTSIDE ROOM\n</b>\n      The full scene. Nico telling his story.      Responsible\n      officials recording it --\n\n<b>425   EXT. YARD OUTSIDE NICO'S HOUSE - DAY\n</b>      The press corps, vans, neighbors -- CLOSING CREDITS BEGIN.\n\n<b>426   LONG PULLBACK\n</b>\n      to the street, the houses, and finally: the neighborhood.\n      Nico's neighborhood, to which the truth has finally come\n      home. CLOSING CREDITS CONTINUE OVER.\n\n<b>      FADE OUT.\n</b>\n\n<b>                                 THE END\n</b><b>\n</b><b> THIS SCRIPT WAS PREPARED\n</b><b>   BY WARNER BROS. INC.\n</b><b>SCRIPT PROCESSING DEPARTMENT\n</b><b>      (818) 954-4632\n</b><b>\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Above the Law</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Steven Pressfield\" title=\"Scripts by Steven Pressfield\">Steven Pressfield</a>  <a href=\"/writer.php?w=Ronald Shusett\" title=\"Scripts by Ronald Shusett\">Ronald Shusett</a>  <a href=\"/writer.php?w=Andrew Davis\" title=\"Scripts by Andrew Davis\">Andrew Davis</a>  <a href=\"/writer.php?w=Steven Seagal\" title=\"Scripts by Steven Seagal\">Steven Seagal</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Above the Law Script.html#comments\" title=\"Above the Law comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:57:51.640955"}