{"title": "Abyss, The", "film_link": "/Movie Scripts/Abyss, The Script.html", "script_link": "/scripts/Abyss,-The.html", "info_raw": "\n\nAbyss, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.25 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  James Cameron\nGenres  Action  Adventure  Sci-Fi  Thriller\nScript Date : August 1988\n\nRead \"Abyss, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nThe Abyss - by James Cameron \n\n\n\n\n\n                                  THE ABYSS\n\n                            AN ORIGINAL SCREENPLAY\n                                      BY\n                                JAMES CAMERON\n\n\n\n                               August 2, 1988\n                             Director's Revision\n\n\n------------------------------------------------------------------------------\n\n\n                                  THE ABYSS\n\nOMITTED                                                                 1\n\nOMITTED                                                                 2\n\nTITLE: THE ABYSS -- ON BLACK, DISSOLVING TO COBALT BLUE\n\nEXT. OCEAN/UNDERWATER -- DAY                                            3\n\nBlue, deep and featureless, the twilight of five hundred feet down.\nPROPELLER SOUND.  Materializing out of the blue limbo is the enormous but\nsleek form of an Ohio-class SSBN ballistic missile submarine.\n\nINT. U.S.S. MONTANA -- DAY                                              4\n\nIn the attack center, darkened to womb-red, the crew's faces shine with sweat\nin the glow of their instruments.  The SKIPPER and his EXEC crowd around\nBARNES, the sonarman.\n\n                                CAPTAIN\n                Sixty knots?  No way, Barnes... the reds don't\n                have anything that fast.\n\n                                BARNES\n                Checked it twice, skipper.  It's a real unique\n                signature.  No cavitation, no reactor noise...\n                doesn't even sound like screws.\n\nHe puts the signal onto a speaker and everyone in the attack room listens to\nthe intruder's acoustic signature, a strange THRUMMING.  The captain studies\nthe electronic position board, a graphic representation of the contours of\nthe steep-walled canyon, a symbol for the Montana, and converging with it, an\namorphous trace, representing the bogey.\n\n                                CAPTAIN\n                What the hell is it?\n\n                                EXEC\n                I'll tell you what it's not, it's not one of\n                ours.\n\n                                BARNES\n                Sir!  Contact changing heading to two-one-four,\n                diving.  Speed eighty knots!  Eighty knots!\n\n                                EXEC\n                Eighty knots...\n\n                                BARNES\n                Still diving, depth nine hundred feet.  Port\n                clearance to cliff wall, one hundred fifty feet.\n\n                                FRANK\n                           (simultaneously)\n                Still diving, depth nine hundred feet.  Port\n                clearance to cliff wall, one hundred fifty feet.\n\nTension builds in the attack room as the Montana surges to intercept the\nintruder.  The exec tensely watches the vector-graphic readout for the side-\nscan sonar array.  The sub is running uncomfortably close to the cliff walls.\n\n                                EXEC\n                          (low, to Captain)\n                It's getting tight in here.\n\n                                CAPTAIN\n                We can still give him a haircut.  Helm, come\n                right to oh six niner, down five degrees.\n\n                                HELMSMAN\n                Coming right to oh six niner, sir.  Down five\n                degrees.\n\n                                NAVIGATOR\n                Port side clearance one hundred twenty feet\n                narrowing to seventy-five.  Sir, we have a\n                proximity warning light.\n\n                                EXEC\n                That's too damn close!  We've gotta back off.\n\n                                BARNES\n                Range to contact, two hundred.  Contact junked to\n                bearing two six oh and accelerated to... one\n                hundred thirty knots, sir!\n\n                                EXEC\n                         (really freaked now)\n                Nothing goes one thirty!\n\nSuddenly the control room lights dim almost to blackness.\n\nEXT. U.S.S. MONTANA                                                     5\n\nWe see only the effect, not the source, as a large diffuse light passes\nrapidly under the sub's hull.  Moments later a shockwave, like an underwater\nsonic boom, impacts the sub, slamming it sideways.\n\nINT. U.S.S. MONTANA                                                     6\n\nThe bride crew are knocked off their feet, as the ship is buffeted.\n\n                                EXEC\n                Turbulence!  We're in its wake!\n\nSIRENS.  Everyone shouting at once.  The power flickers low.\n\n                                CAPTAIN\n                Helm, all stop!  Full right rudder!\n\n                                HELMSMAN\n                All stop.  Full right rudder.  Hydraulic failure.\n                Planes are not responding, sir!\n\nPower returns in time for the sonarman to get a glimpse at the side-scan\ndisplay... AS THE SHEER CLIFF WALL LOOM BEFORE THEM.\n\n                                HELMSMAN\n                Hydraulics restored, sir.\n\nEXT. U.S.S. MONTANA                                                     7\n\nThe cliff wall materializes out of the blue limbo off the port bow with\nnightmarish slow-motion.  The sub slams into it with horrific force, scraping\nalong and bouncing off.  One tail stabilizer is sheared off and the big screw\nprangs the wall with an earsplitting K-K-KWANG!\n\nINT. PORT TO TORPEDO ROOM                                               8\n\nWith the outer tube-doors torn off, seawater slams in, busting the inner\nhatches.  Two-foot thick columns of water, like fire-hoses of the gods,\nblast into the room.  Everything vanishes instantly in white spray.\n\nINT. CONTROL RM/ATTACK CENTER                                           9\n\nEveryone is hurled off his feet.  The planesman flights to recover control of\nthe yoke.\n\n                                CAPTAIN\n                Collision alarm!  Collision alarm!  Lighten\n                her up, Charlie!\n\n                                NAVIGATOR\n                The torpedo room is flooded, sir!\n\n                                CAPTAIN\n                Blow all tanks!  Blow everything!\n\n                                HELMSMAN\n                Passing twelve hundred feet...\n\n                                EXEC\n                Blowing main tanks!\n\n                                HELMSMAN\n                Twelve hundred fifty feet...\n\nEXT. MONTANA                                                            10\n\nThe great sub is being hauled down by the mass of its flooded bow section,\nits flanks rushing past us like a freight train headed for Hell.\n\nINT. MONTANA CONTROL ROOM                                               11\n\nThe command crew fights futility for control, everyone shouting and terrified.\n\n                                EXEC\n                Main forward tanks ruptured!\n\n                                HELMSMAN\n                Passing thirteen hundred feet...\n\n                                EXEC\n                Too deep to pump auxiliaries!\n\n                                CAPTAIN\n                All back full!  All back full!\n\n                                HELMSMAN\n                Answering all back full.  Passing thirteen hundred\n                fifty feet... fourteen hundred... fourteen\n                fifty...\n\nThe Captain locks eyes with the Exec amid the din...\n\n                                CAPTAIN\n                We're losing her.  Launch the buoy!\n\nThe Exec opens the door to a small box and punches a button.  A red light\ncomes on.  The Captains takes a deep breath.\n\nEXT. MONTANA                                                            12\n\nA tiny transmitter is ejected from the sub's hell and begins its long ascent\nto the surface.  A second later the sub slams down like a piledriver onto a\nledge, tearing open its pressure hull.\n\nINT. MONTANA                                                            13\n\nVARIOUS QUICK CUTS, just flashes and impressions, as...\nSeawater blasts down the corridors --\nExplodes across the control room, hurling men like dolls --\nFloods the cavernous missile bay in seconds --\nBursts through hatches into the reactor room --\nBlasts men OUT OF FRAME in a micro-second.\n\nEXT. OCEAN/UNDERWATER                                                   14\n\nIn the cobalt twilight we see the Montana slide down the sea cliff, its hull\nSCREECHING like the death agonies of some marine dinosaur.  Descending in an\navalanche of silt, it finally disappears into the blackness below... a\nblackness which continues almost straight down, 20,000 feet to the bottom of\nthe Cayman Trough.  The abyss.\n\nEXT. OCEAN SURFACE -- DAY                                               15\n\nAbove, in the world, the Caribbean rolling gray under a stormy sky.  The\nMontana's emergency buoy pops to the surface, transmitting.\n\n                                                                CUT TO:\n\nEXT. OCEAN/20 MILES AWAY -- DAY                                         16\n\nLONG LENS SHOT: three massive Navy Sea King helicopters thundering straight\nat us, FILLING FRAME.\n\nREVERSE, as they barrel OVER CAMERA toward a lone civilian ship... an ugly\nbut very sophisticated deep-sea drilling support ship, the BENTHIC EXPLORER.\nIt is a twin-hulled monstrosity with a central opening in its deck, around\nwhich crouch enormous cranes, winches and other arcane equipment.\n\nThe first Sea King settles onto the helipad, disgorging a contingent of Naval\nofficers, technicians, and a squad of armed seamen.  A pantomime in the\nrotorwash, we see the Benthic Petroleum \"company man\" KIRKHILL greeting\nCOMMODORE DEMARCO, the on-scene commander.\n\nINT. BENTHIC EXPLORER/BRIDGE -- DAY                                     17\n\nThe bridge is state-of-the-art, with computers and sophisticated navigation\nand communications gear, looking like mission control with its bank of video\nmonitors.  The Drilling Operations Supervisor, LELAND MCBRIDE, and BENDIX,\nthe crew chief, watch the invaders swarming the deck below.\n\n                                MCBRIDE\n                Does not look good at all.\n\nTIGHT ON VIDEO SCREEN (MINUTES LATER) showing divers working in total\nblackness around some sort of installation on the bottom of the ocean.  They\nmove through the harsh floodlights in dreamlike slow motion, looking like\nspace-suited figures with their helmets and umbilical hoses.\n\n                                DEMARCO (V.O.)\n                No light from the surface.  How deep are they?\n\n                                MCBRIDE (V.O.)\n                Seventeen hundred feet.\n\nWIDER, showing the Navy contingent crowding the control room.  DeMarco is\nhardcore military, brusque and efficient.  Kirkhill is a small man with\npinched features, wearing a shirt and tie, which on a drill ship means\ncompany man and/or dickhead.\n\n                                DEMARCO\n                I need them to go to over two thousand.\n\n                                KIRKHILL\n                They can do it.\n                              (to McBride)\n                Get Brigman on the line.\n\n                                                                CUT TO:\n\nEXT. UNDERWATER -- DAY (TOTAL DARKNESS)                                 18\n\n1700 FEET BELOW.  A submersible oil-drilling platform, DEEPCORE II, an island\nof light in the vast blackness.  Its main framework connects two \"tri-\nmodules\" consisting of three cylinders each.  These contain living and work\nareas in a pressurized environment.  An umbilical cable, thick as a man's\nthigh, runs up from the oil rig into the darkness, to the Benthic Explorer\nat the surface.  In a bubble-like dome port window we see the rig foreman, or\n\"toolpusher,\" BUD BRIGMAN.  He's talking (via headset) with two divers\nworking outside... 'CATFISH' DE VRIES, AND LEW 'BIRD-DOG' FINLER.\n\n                                BUD\n                Hey, you guys are milking that job.\n\n                                CATFISH\n                           (Kentucky drawl)\n                That's cause we love freezin' our butts off out\n                here sooo much, boss.\n\nOMITTED                                                                 19\n\nINT. DRILL ROOM                                                         20\n\nBud turns from the window and crosses the drill floor.  The working heart of\nthe rig.  THUNDEROUS MECHANICAL ROAR.  The drill crew, in hardhats and mud-\nplastered overalls, tend the massive spinning turn-table in the center of the\nchamber.  The semi-automated system requires only five men to operate.  The\nothers are LUPTON MCWHIRTER, DWIGHT PERRY, JAMMER WILLIS, and TOMMY RAY\nDIETZ.  Bud hears his names called above the din by Jammer, a massive\nroughneck/diver who stands a good head taller than the rest.\n\n                                JAMMER\n                               (yelling)\n                Bud!  Hippy's on the bitch-box.  It's a call\n                from topside.  That new company man.\n\n                                BUD\n                Kirkhill?  That guy doesn't know his butt from\n                a rathole.  Hey, Perry!\n\nOne of the roustabouts, a wiry Texan, turns to him.\n\n                                BUD\n                Do me a favor and square away the mud hose and\n                those cable slings.  This place is starting to\n                look like my apartment.\n\nPerry chuckles and sets to the task cheerfully.  Bud EXITS, ducking his head\nthrough a low watertight hatch.\n\nINT. CORRIDOR/TOOLPUSHER'S OFFICE                                       21\n\nBud tromps down the narrow corridor, his work boots gonging on steel.\n\n                                P.A. (HIPPY'S VOICE)\n                BUD, PICK UP THE TOPSIDE LINE URGENT.\n\n                                BUD\n                I'm coming.  Keep your pantyhose on.\n\nHe enters his office, a tiny cubicle with stacks of paperwork, dust-\ngathering tech manuals and waterstained Penthouse fold-outs.  He picks up the\nphone... punches down a line.\n\n                                BUD\n                Brigman here.  Kirkhill?  What's going on?\n                              (pause)\n                I am calm.  I'm a calm person.  Is there some\n                reason why I shouldn't be calm?\n\nHOLD ON Bud's expression, darkening, as he listens.\n\nINT. CORRIDOR/CONTROL MODULE                                            22\n\nThe control module is a long narrow cabin like the inside of a Winnebago,\npacked with instrumentation.  At the end is a small bay with multiple\nviewports.  Outside, at a 'Christmas tree' pipe installation, a lone diver\ncan be seen welding.  He is accompanied by a large submersible, FLATBED, and\nby a Remotely Operated Vehicle, or ROV, call LITTLE GEEK.  Little Geek is an\nunderwater robot which operated on the end of a cable-like control TETHER.\nIt has a single video 'eye' in front, by which the operator pilots the little\nmachine.  The rig's ROV pilots is ALLEN 'HIPPY' CARNES, who stands by the\nwindow twiddling his joysticks and drinking coffee.  His pet white rat,\nBEANY, crawls contentedly around his shoulders.  The door BANGS OPEN.\n\nHippy jumps, slops his coffee.  Bud strides in.  Not calm.\n\n                                BUD\n                Son of a bitch.\n\nHe kicks a chair out of the way and slams his palm down on a switch marked\nDIVER RECALL.  A SIREN, blasting through the water from a big hydrophone\nloudspeaker.\n\n                                BUD\n                All divers.  Drop what you're doing.  Everybody\n                out of the pool.\n\nEXT. DEEPCORE/CHRISTMAS TREE                                            A22\n\nFlatbed's pilot, LISA 'ONE NIGHT' STANDING, can be clearly seen behind a\nbubble canopy.  She is a no-nonsense lady who holds her own in the mostly\nmale environment by being one of the best submersible drivers in the\nbusiness.  She controls a hydraulic manipulator arm, assisting the diver,\nARLISS 'SONNY' DAWSON, in his work.  Little Geek hovers around them like a\ntiny helicopter.  One Night moves the Flatbed arm to Sonny and hands him the\npipe.\n\n                                ONE NIGHT\n                Here you go, hon'.\n\n                                SONNY\n                Just in time, sugar.\n\nThey react to Bud's recall, looking toward him up in the control module.\n\n                                ONE NIGHT\n                Dammit, we just got out here.\n\n                                SONNY\n                There was a time when I would have asked why.\n\nOne Night makes a grab for his butt with the manipulator claw, which he\nnarrowly avoids.\n\n                                                                CUT TO:\n\nEXT. DEEPCORE/UNDER SUB-BAY                                             23\n\nFlatbed moves underneath the rig, a few feet above the seafloor, with Sonny\nriding on its top deck.  It passes under a lit opening and rises toward the\nsurface of the water in the chamber above.  Little Geek follows like an\nobedient dog.\n\nINT. SUB-BAY/MOONPOOL                                                   24\n\nThe opening is called the moonpool, and Deepcore's submersibles are launched\nthrough it.  From inside the sub-bay it looks just like a swimming pool.\nFlatbed surfaces, nearly filling it.  The chamber also contains CAB ONE, a\nsimilar submersible.  Jammer, Perry, and some of the other drill-room boys\nare helping the divers out of the water.  The water at this depth is only\nabout six degrees above freezing, and these folks are cold and prune-\nfingered.  Finler pulls off his demand-helmet, revealing a round, boyish\nface.\n\n                                FINLER\n                What's goin' on?  How come we got recalled?\n\n                                SONNY\n                Hell is I know.\n\nOne Night jumps 'ashore' from Flatbed's broad deck and joins them.  Catfish\nis unzipping his bulky dry-suit.\n\n                                CATFISH\n                Just follow standard procedure, will ya...\n                flog the dog till somebody tells us what's\n                happening.\n\n                                JAMMER\n                Hey, Catfish, I'll sell you my October Penthouse\n                for twenty bucks.\n\n                                ONE NIGHT\n                Save you money, darlin'... the pages are all\n                stuck together by now.\n\nBud enters, approaching the group.\n\n                                JAMMER\n                What's goin' on, Boss?\n\n                                BUD\n                Folks, I've just been told to shut down the hole\n                and prepare to move the rig.\n\n                                SONNY\n                She-hit.\n\n                                BUD\n                We're being asked to cooperate in a matter of\n                national security.  Now you know exactly as much\n                as I do.  So just get your gear off and get up to\n                control.  There's some kind of briefing in ten\n                minutes.\n\n                                                                CUT TO:\n\nINT. DEEPCORE/COMMAND MODULE                                            25\n\nThe whole rig crew is somehow jammed into the room for the video briefing.\nDeMarco is on the main monitor, with his aides and Kirkhill visible b.g.\n\n                                DEMARCO\n                At 09:22 local time this morning, an American\n                nuclear submarine, the USS Montana, with 156 men\n                aboard, went down 22 miles from here.  There has\n                been no contact with the sub since then.  The\n                cause of the incident is not known.\n\nPAN AROUND the reactions of the various drill crew members... shocked,\nhushed, curious.\n\n                                DEMARCO\n                Your company has authorized the Navy's use of\n                this facility for a rescue operation.  The code\n                name is Operation Salvor.\n\n                                ONE NIGHT\n                You want us to search for the sub?\n\n                                DEMARCO\n                No.  We know where it is.  But she's in 2000 feet\n                of water and we can't reach her.  We need divers\n                to enter the sub and search for survivors, if\n                any.\n\nBud's scowl has been deepening since DeMarco started to talk.\n\n                                BUD\n                Don't you guys have your own stuff for this type\n                of thing?\n\n                                DEMARCO\n                By the time we get our rescue submersible here\n                the storm front will be right on us.  But you\n                can get your rig in under the storm and be on-\n                site in fifteen hours.  That makes you our best\n                option right now.\n\nHippy, born suspicious and recently graduated to paranoid, leans forward...\n\n                                HIPPY\n                Why should we risk our butts on a job like this?\n\n                                KIRKHILL\n                I have been authorized to offer you all special-\n                duty bonuses equivalent to three times normal\n                dive pay.\n\n                                CATFISH\n                Hell, for triple time I'd crawl through razor\n                blades and shower off with lime juice.\n\n                                FINLER\n                I'm here to tell ya', you could set me on fire\n                and call me names.\n\n                                BUD\n                Look, I don't know what kind of a deal you guys\n                worked out with the company, but my people are\n                not qualified for this... they're oil workers.\n\n                                DEMARCO\n                A four-man SEAL team will transfer down to you\n                to supervise the operation.\n\n                                BUD\n                You can send down whoever you like, but I'm the\n                toolpusher on this rig, and when it comes to the\n                safety of these people, there's me... then\n                there's God.  Understand?  If things get dicey,\n                I'm pulling the plug.\n\n                                KIRKHILL\n                I think we're all on the same wavelength,\n                Brigman.  Now let's get the wellhead uncoupled,\n                shall we?\n\n                                                                CUT TO:\n\nINT. DEEPCORE/COMMAND MODULE AND CORRIDOR                               26\n\nBud stands beside the hatchway as the others file out toward their tasks.\nThey comment gravely as they pass...\n\n                                JAMMER\n                When Lindsey finds out about this, it's not\n                gonna be a pretty sight.\n\n                                ONE NIGHT\n                They're going to have to shoot her with a\n                tranquilizer gun.\n\n                                                                CUT TO:\n\nEXT. OCEAN -- DAY                                                       27\n\nA single Navy Sea King churns through the rain under massive thunderheads.\nThe sea below is whipped by the storm.\n\nINT./EXT. SEA KING                                                      28\n\nPANNING ALONG BOOTED FEET, four pairs of black military size twelves line\nup, onto... a pair of Charles Jourdans fives under shapely ankles.\n\nWIDER, revealing the four-man team of Navy SEALs.  And a slender woman in\nher early thirties.  She's attractive, if a bit hardened, dressed\nconservatively in a skirt and jacket.  Meet LINDSEY.  Project Engineer for\nDeepcore.  She's a pain in the ass, but you'll like her.  Eventually.\nShe's holding on grimly, sitting crammed in with the SEALs and a bunch of\ngear, getting tossed around by the storm.  The SEALs are dressed alike in\nblack fatigues.  They are muscular, finely-tuned and extremely dangerous\nspecial-forces types.  The leader of the SEAL team, LIEUTENANT COFFEY, makes\nhis way forward to the cockpit.\n\nThe pilot is white-knuckling his stick, trying to hold the great beast of a\nhelicopter in position.  Through the windshield, the deck of the Benthic\nExplorer can be seen below, pitching in a violent sea.\n\n                                PILOT\n                No way I'm putting her down.  I shouldn't even\n                be flying in this shit.\n\n                                COFFEY\n                                (cool)\n                Just hold it over the deck.\n\nCoffey goes back to the crew deck, moving easily in the bucking craft.  He\nnods to the others SEALs, MONK, WILHITE, and SCHOENICK.  In the open side\ndoor, Wilhite clips a 100 foot nylon rope to the airframe and throws out the\ncoil.  One by one the shoulder the gear-bags, grab the rope, and step out.\nLindsey stands swaying in the chopper door, watching the SEALs fast-roping\nto the deck.  One, two, three.  Coffey looks at her.\n\n                                COFFEY\n                You want to be on that ship, there's only one\n                way it's going to happen.\n\nHe's sure she won't go for it.  It's his certainty that gets her.  She sets\nher jaw.  Opening her purse she takes out a small plastic bag, puts her\nshoes and purse in the bag, and grips the bag in her teeth.  Then grabs\nthe rope and slides down.\n\nEXT. BENTHIC EXPLORER/HELIPAD                                           29\n\nSwinging wildly in the wind like a human pendulum, Lindsey fast-ropes forty\nfeet to the deck.  She steps away an instant before Coffey hits behind her.\nLindsey crosses the rainswept deck with athletic strides.  Her nylons are\nruined.  An air-crewman in the chopper lowers two additional equipment cases\nusing the rescue sling.  The SEALs catch them as they swing radically across\nthe deck.  They Navy chopper banks and seems to scurry away before the\nmounting storm.\n\n                                                                CUT TO:\n\nEXT. OCEAN BOTTOM                                                       30\n\nBLACKNESS.  Then shafts of light become visible, above a ridge of rock.\nFlatbed appears, trailing two heavy two cables.  Behind it, the mass of\nDeepcore emerges from the darkness, its forward lighting array blazing.\nFlatbed is towing it like a tug, aided by Deepcore's own mighty stern\nthrusters.\n\nINT. DEEPCORE/CONTROL MODULE                                            31\n\nBud, his feet propped up, uses joystick controls to 'fly' Deepcore,\nmaneuvering against currents and around seafloor obstacles.  He is guided\nby the side-scan sonar display, with Hippy assisting in the sonar shack.\nThrough the front viewport, Flatbed can be seen out ahead.\n\nMcBride appears on the bridge monitor, holding a sheet of weather-fax.\n\n                                MCBRIDE (on screen)\n                Well, it's official, sportsfans.  They're calling\n                it Hurricane Frederick, and it's going to be\n                making our lives real interesting in a few hours.\n\nINT. EXPLORER BRIDGE -- DAY                                             32\n\nBud responds via video.\n\n                                BUD\n                Fred, huh?  I don't know.  Hurricanes should be\n                named after women.\n\nMcBride looks up as the bridge door opens.  Lindsey enters in a blast of wind,\nwet as a wharf rat and twice as pissed off.  Maybe Bud is right.\n\n                                                                CUT TO:\n\nINT. DEEPCORE/CONTROL MODULE                                            33\n\nBud is surprised to see Lindsey's face appear on the monitor screen.\n\n                                LINDSEY\n                I can't believe you let them do this!\n\n                                BUD\n                     (unpreturbed, almost cheerful)\n                Hi, Lins.  I thought you were in Houston.\n\n                                LINDSEY\n                I was, but I managed to bum a ride on the last\n                flight out here.  Only here isn't where I left\n                it, is it, Bud?\n\n                                BUD\n                Wasn't up to me.\n\n                                LINDSEY\n                We were that close to proving a submersible\n                drilling platform could work.  We had over seven\n                thousand feet of hole down for Chrissake.  I\n                can't believe you let them grab my rig!\n\n                                BUD\n                Your rig?\n\n                                LINDSEY\n                My rig.  I designed the damn thing.\n\n                                BUD\n                Yup, a Benthic Petroleum paid for it.  So as long\n                as they're hold the pink slip, I go where they\n                tell me.\n\n                                LINDSEY\n                You wimp.  I had a lot riding on this.  They\n                bought you... more like least rented you cheap--\n\n                                BUD\n                I'm switching off now.\n\n                                LINDSEY\n                Virgil, you wiener!  You never could stand up\n                to fight.  You--\n\nBud hits the switch and the screen goes dead.\n\n                                BUD\n                Bye.\n\nHippy looks over him, trying very hard not to crack up.\n\n                                HIPPY\n                Virgil?\n\n                                BUD\n                God, I hate that bitch.\n\n                                HIPPY\n                Yeah, well you never should have married her then.\n\nBud nods fatalistically.\n\n                                                                CUT TO:\n\nEXT. EXPLORER DECK/LAUNCH WELL                                          34\n\nTen foot waves crash through the launch-well, sending up geysers of spray.\nNext to the launch-well, crewman have attached a lifting cable to CAB THREE,\neighteen feet of ugly yellow submersible.  It slams violently in its steel\ncradle as the drill-ship rolls.  Coffey and Schoenick hand the gear bags in\nto Wilhite and Monk though the hatch under the rear of the submersible.\n\nLindsey approaches, wearing a borrowed roustabout's coverall.\n\nShe looks down at the larger of the two equipment cases brought by the SEALs,\nlying on the deck.  Stenciled on it are the words: F.B.S./DEEP SUIT/MARK IV.\nCoffey and Schoenick push past her to pick it up.\n\n                                LINDSEY\n                Let's go, gentlemen!  We either launch now or\n                we don't launch.\n\nCoffey looks up in surprise as she nimbly climbs the side of Cab Three and\ngrabs the lifting shackle, circling her raised hand to signal the crane man.\n\n                                LINDSEY\n                Take her up, Byron!\n\nCab Three, with Lindsey riding its back, is pulled up out its cradle and\nstarts to swing violently as Explorer pitches.  The submersible is then\nswung out to the center of the launch well.  It sways and gyrates above the\nfurious water below.  Lindsey drops into the upper hatch.\n\nINT. EXPLORER BRIDGE/D.O.C.                                             35\n\nKirkhill leans suddenly over the console to look out the window.\n\n                                KIRKHILL\n                What the hell is she doing out there?  Son of a\n                bitch...\n                           (into microphone)\n                Lindsey... get out of Cab Three.  Bates is taking\n                her down.\n\nINT. CAB THREE                                                          36\n\nLindsey pulls her headset as she dogs down the inside locking levers of the\nhatch.\n\n                                LINDSEY\n                Bates is sick.  Besides I've got more hours in\n                this thing than he does.\n                              (to Coffey)\n                A little change of plan.\n\nThe little sub is swinging like a pendulum on the cable, and the SEALs,\njammed in with their equipment in the tiny space, are getting slammed into\nthe walls.  Lindsey is calmly flipping switches as she talks.\n\n                                COFFEY\n                Lady, we better fish or cut bait.\n\n                                LINDSEY\n                Just hold your water, okay?\n                             (to Kirkhill)\n                So Kirkhill, we gonna do this or we gonna talk\n                about it?\n\nINT. EXPLORER BRIDGE/D.O.C.                                             37\n\nThe plug is pulled on DeMarco's patience.\n\n                                DEMARCO\n                I don't care who drives the damn thing.  Just get\n                my team in the water.\n\n                                KIRKHILL\n                Alright, alright.  Christ Almighty!\n\nHe gestured dismissively to McBride.\n\n                                MCBRIDE\n                Cab Three, you are clear to launch.\n\nINT./EXT. CAB THREE                                                     38\n\nLindsey reaches up a grabs a red lever.\n\n                                LINDSEY\n                Roger.\n                              (to Coffey)\n                There's only one way it's going to happen...\n\nShe pulls the lever hard.  CLUNK-CLANG!  The shackle-release drops the sub.\nIt freefalls ten feet to the water with an enormous splash and keeps right\non going after Lindsey floods the trim tanks.  Coffey et al have been slammed\nhard.\n\n                                LINDSEY\n                Touchdown.  The crowd goes wild.  Explorer...\n                Cab Three.  We are styling.\n\n                                MCBRIDE (filtered)\n                Roger, Cab Three.\n\nLindsey cuts on the floodlights and maneuvers the descending submersible so\nthat the umbilical cable is a few feet ahead on her front port.  Moving up\nthrough her lights, it will guide her down to the rig.  Cab Three free-falls\ninto increasing darkness.  Soon it is a candle below us in the indigo.\n\nEXT./INT. FLATBED                                                       39\n\nOne Night is driving the tug one-handed, pouring coffee from a thermos and\nrocking out to the great truck-driving song \"Willing\" on the beat-box she's\ngot propped up on the sonar rig.  Fighting white-line fever in the best\ntradition.\n\nINT. CONTROL MODULE                                                     40\n\nBud and Hippy come in for a rousing chorus.\n\n                                BUD/HIPPY\n              ... I've been driving every kinda rig that's\n                ever been maaaaade...\n\nEXT. DEEPCORE                                                           41\n\nLit up like a proud Peterbilt, the rig crossed the trackless wastes.  We\nhear them singing, carried OVER.\n\nEXT. OCEAN DEPTHS/CAB THREE                                             42\n\nIn total blackness, the submersible descends along the rigorous line of the\numbilical cable.  Two hundred feet below it, the lights of Deepcore resolve\nout of the darkness.  Now we can see the rig crawling over the ocean bottom\nlike some monster lawnmower.\n\n                                LINDSEY (V.O.)\n                Deepcore, Deepcore... this is Cab Three on\n                final approach.\n\n                                HIPPY (V.O.)\n                Gotcha, Cab Three.  Who is that?  That You,\n                Lindsey?\n\nINT. DEEPCORE/CONTROL MODULE                                            43\n\nBud stop singing and snaps around at the mention of her name.\n\n                                LINDSEY (V.O.)\n                None other.\n\nBud's expression is nothing less than stricken.\n\n                                BUD\n                Oh no... you gotta be kidding me.\n\nEXT./CAB THREE/DEEP CORE                                                44\n\nLindsey executes a 180 degree turn and cruises over the control module, back\nthrough the A-frame toward the docking hatch.  The flange of Cab Three's\nlockout hatch settles over the pressure collar on the rig's back.  There is\na CLUNK as it mates up.\n\nINT. DEEPCORE/COMPRESSION CHAMBER/GAS CONTROL STATION                   45\n\nLindsey drops down from the hatch into the small cylindrical pressure chamber.\nThe SEALs drop down behind her, passing their gear through hand-over-hand.\nThe chamber is spartan, with steel benches, a folding card table, breathing\nmasks, and medical supplies.  Catfish greets them through the tiny porthole\nat one end.\n\n                                CATFISH\n                Howdy, y'all.  Hey, Lindsey!  I'll be damned!\n                You shouldn't be down here sweet thing, ya'll\n                might run ya stockings.\n\n                                LINDSEY\n                Couldn't stay away.  You running mixture for us?\n                Good.  Couldn't ask for better.\n\n                                CATFISH\n                Okay, here we go.  Start equalizing, y'all.\n\nHISSSS of inrushing compressed gas.  The pressure in the chamber rises.  The\nbreathing mixture is composed of helium, oxygen and nitrogen.  Catfish\nmonitors it carefully from a station outside the chamber, watching the\ngauges with a practiced eye.  Lindsey and the SEALs all grab their noses\nand start making funny faces... popping their ears with the familiar diver's\n'equalization' technique.  They continue as:\n\n                                LINDSEY\n                Get comfortable.  The bad news is we got six\n                hours in this can, blowing down.  The worse news\n                is it's gonna take us three weeks to decompress\n                back to the surface later.\n\n                                COFFEY\n                We've been fully briefed, Mrs. Brigman.\n\n                                LINDSEY\n                Don't call me that, okay... I hate that.  Alright,\n                from now on we watch each other closely for\n                signs of HPNS...\n\n                                MONK\n                           (as if by rote)\n                High-Pressure Nervous Syndrome.  Muscle tremors,\n                usually in the hands first.  Nausea, increased\n                excitability, disorientation.\n\n                                LINDSEY\n                Very good.  About one person in twenty just can't\n                handle it.  They go buggo.  They're no way to\n                predict who's susceptible, so stay alert.\n\n                                COFFEY\n                Look, we've all made chamber runs to this depth.\n                We're checked out.\n\n                                LINDSEY\n                Oh... chamber runs.  Uh huh, that's good.\n                          (Coffey turn away)\n                Well, hey... you guys know any songs?\n\nThey ignore her.  Start going over some diagrams of the Montana's interior.\nIt's going to be a long six hours.\n\nINT. GAS CONTROL STATION -- HOURS LATER                                 46\n\nCatfish checks his watch, then reaches over and adjusts a value on the tri-\nmix manifold, watching the gauges.  Satisfied, he leans over to the pressure\nwindow in the door, checking out the SEALs.  Hippy has come down from the\ncontrol deck for an advanced look are the interlopers.  Jammer is in a chair,\nreading a Louis L'Amour paperback.\n\n                                CATFISH\n                Those guys ain't so tough.  I fought plenty of\n                guys tougher'n them.\n\n                                HIPPY\n                Now we get to hear about how he used to be a\n                contender.\n\nCatfish hold up one calloused fist up in front of Hippy's face.\n\n                                CATFISH\n                You see this?  They used to call this the Hammer.\n\n                                JAMMER\n                Hippy wasn't born then.\n\nINT. PRESSURE CHAMBER                                                   47\n\nIt looks like the end of a long bus trip.  Everyone silent... leafing\nthrough beat-to-hell magazines or just staring.  Lindsey has her feet propped\nup on the smaller of the SEALs' two equipment cases.  She casually toes open\none of the latches, then the other.  Glances at Coffey.  He's reading.  She\nbegins to lift the lid with her toe.  Gets a GLIMPSE INSIDE, of packing foam,\nand what looks like a SMALL BLACK METAL BOX.  Then... WHAM!  Coffey's foot\ncomes down on the lid, slamming it shut.  Startled, she looks up into his\ncool gaze.\n\n                                COFFEY\n                Curiosity killed the cat.\n\n                                                                CUT TO:\n\nINT. GAS CONTROL STATION/CHAMBER DOOR -- LATER                          48\n\nTIGHT ON CATFISH'S hands... closing values... spinning the wheel on the\nchamber hatch.  CUT WIDER as it cracks open with a virgin's sigh and swings\naside.\n\n                                CATFISH\n                Y'all'er done to a turn and ready to serve.\n                Everybody okay?\n\nThe SEALs nod peremptorily and shoulder their gear.  Lindsey exists first,\nfollowed by Monk, Wilhite, and Schoenick.  Coffey bends to relatch the small\nequipment case.  He is alone for one moment in the chamber.  He raises his\nhand and stares at it.  The fingertips are trembling the slightest bit.  He\nclenches them into a fist and walks out.\n\nINT. CORRIDOR                                                           49\n\nAs Lindsey emerges into the main corridor of the rig, she bumps into a large,\ndark mass.\n\n                                LINDSEY\n                Hey, was there a wall here before?  I don't\n                remember a wall here.  Oh, Jammer!  Hi.\n\nThe 'wall' grins down to her.\n\n                                JAMMER\n                Howdy, there, little lady.\n\nCoffey emerges behind them and, ignoring Lindsey, faces Jammer.\n\n                                COFFEY\n                              (to Jammer)\n                Show us the dive prep area.  We need to check\n                out your gear.\n\nJammer scowls, turns and leads the SEALs in the sub-bay.  Catfish and Lindsey\nexchange a look.\n\n                                LINDSEY\n                Those guys are about a much fun as a tax audit.\n\n                                                                CUT TO:\n\nINT. COMMAND MODULE                                                     50\n\nTIGHT ON HIPPY, bathed in the light of the sonar display.  He is making\nkissing sounds at Beany, who has his inquisitive nose right up to Hippy's\nlips.\n\n                                LINDSEY\n                Hippy, you're going to give that rat a disease.\n\nWIDER, as Hippy and Bud to see Lindsey leaning in the doorway.  She and Bud\nsize each other up.  He opts for a jovial approach, his eyes wary.\n\n                                BUD\n                Well, well.  Mrs. Brigman.\n\n                                LINDSEY\n                Not for long.\n\nLindsey crossed past him, her eyes scanning the banks of equipment, almost\nunconsciously checking, checking... getting the pulse of her big iron baby.\n\n                                BUD\n                You never did like being called that, did you?\n\n                                LINDSEY\n                Not even when it meant something.\n                     (looking through the front port)\n                Is that One Night up in Flatbed?\n\n                                BUD\n                Who else?\n\nLindsey leans past Bud to the gooseneck mike on the console.\n\n                                LINSEY\n                Hi, One Night, it's Lindsey.\n\nINT. FLATBED                                                            51\n\nOne Night mimes a puking motion, finger down her throat.  Then she replies\nwith sickening sweetness...\n\n                                ONE NIGHT\n                Oh, hi, Lindsey.\n\nINT. COMMAND MODULE                                                     52\n\nLindsey fives the sonar shack the once-over.  She tweaks some knobs.\n\n                                BUD\n                I can't believe you were dumb enough to come\n                down.  Now you're stuck here for the storm...\n                dumb, hot-rod... dumb.\n\n                                LINDSEY\n                Look, I didn't come down here to fight.\n\nShe crosses past Bud and exits into the corridor.  Bud bolts out of the chair\nto follow her and Hippy scrambles in to take over.\n\nINT. CORRIDOR/LADDER-WELL/LEVEL ONE LANDING                             53\n\nBud catches up with Lindsey in the corridor, and through the following keeps\npace with here as she make here inspection.\n\n                                BUD\n                Then why'd you come down?\n\nShe stops abruptly to look at a leaky pipe.  He almost slams into her.  She\nmoves on, climbing down the ladder to the lower level.\n\n                                LINDSEY\n                You need me.  Nobody knows the systems on this\n                rig better than I do.  What is something was\n                to go wrong after the Explorer clears off?  What\n                would have you done?\n\n                                BUD\n                Wow, you're right!  Us poor dumb ol' boys might've\n                had to think for ourselves.  Coulda been a\n                disaster.\n\nOn the lower level landing, Lindsey opens a hatch into one of the machine\nrooms.  ROAR OF PUMPS AND COMPRESSORS.\n\nINT. MACHINE ROOM                                                       54\n\nLindsey enters and moves expertly through the dark labyrinth of pipes and\nroaring machinery.  Her eyes rove constantly over fittings, gauges, circuit\npanels.\n\n                                BUD\n                             (yelling)\n                You wanna know what I think?\n\n                                LINDSEY\n                Not particularly.  Jeez, look where this is set!\n                Morons.\n\nShe scowls at a pressure gauge and turn a valve minutely.\n\n                                BUD\n                I think you were worried about me.\n\n                                LINDSEY\n                That must be it.\n\nLindsey's on the move again, and Bud scrambles through the pipes to keep up.\n\n                                BUD\n                No, I think you were.  Come on, admit it.\n\n                                LINDSEY\n                I was worried about the rig.  I've got over four\n                years invested in this project.\n\n                                BUD\n                Oh, yeah, right... and you only had three years\n                with me.\n\nShe looks up at him.\n\n                                LINDSEY\n                You've got to have priorities.\n\n                                                                CUT TO:\n\nINT. BUD'S ROOM                                                         55\n\nDarkness.  The door opens and Bud snaps on the light.\n\n                                BUD\n                My bunk's the only one I can guarantee won't be\n                occupied.  You can grab a couple hours before\n                we get there.\n\nLindsey slips past him into his tiny state-room, the only private bunk on the\nrig.  Rank had its privileges.  His hand on the door is just level with her\neyes.  She notices his wedding ring, a massive band of pure titanium\n(something your fiancee might have picked out if she had a degree from\nM.I.T.).\n\n                                LINDSEY\n                What are you still wearing that for?\n\n                                BUD\n                I don't know.  Divorce ain't final.  Forgot to\n                take it off.\n\nBud stays in the doorway.  Lindsey takes a heaps of Bud's cloths off the\nnarrow bunk.  Start unconsciously straightening the room.\n\n                                LINDSEY\n                I haven't worn mine in months.\n\n                                BUD\n                Yeah, what's-his-name wouldn't like it.  The\n                Suit.\n\n                                LINDSEY\n                Do you always have to call him that?  The Suit?\n                It makes you sound like such a hick.  His name\n                is Michael.\n\nLindsey takes off her borrowed tennies and socks.\n\nBud eyes her, sounding too causal.\n\n                                BUD\n                So what about \"Michael\" then... Mr. Brooks\n                Brothers... Mr. BMW.  You still seeing him?\n\n                                LINDSEY\n                No, I haven't seen him in a few weeks.\n\n                                BUD\n                What happened?\n\n                                LINDSEY\n                Bud, why are you doing this?  It's not part of\n                you life any more.\n\n                                BUD\n                I'll tell you what happened... you woke up one\n                day and realized the guy never made you laugh.\n\n                                LINDSEY\n                You're right, Bud.  It was just that simple.\n                Aren't you clever?  You should get your own\n                show... Ask Dr. Bud, advice to the lovelorn\n                from three hundred fathoms.\n\nShe closes the watertight door, forcing him out.  Locks it.  She turns and\nthrows her shoe hard against the far wall.\n\n                                LINDSEY\n                AAAARRRGGH!\n\nShe flops down on the bed, sitting... staring at the wall.  Her armor is\ngone.  She looks small and vulnerable.  A long beat.  She reaches over to the\ntiny sink.  Amid the clutter is a bottle of Bud's aftershave.  She unscrews\nit and takes a sniff.  Catches herself.  Tosses it.\n\n                                LINDSEY\n                Shit.\n\nINT. QUARTERS/HEAD                                                      56\n\nBud barges into the tiny head and puts some soap on his ring finger.  He pulls\nthe ring off roughly and throws it into the toilet.  He reaches forward to\nflush.  Can't do it.  Now really pissed off at himself, he reaches into the\ntoilet bowl, wrist deep in the chemical-blue water, and salvages the ring.\nHe puts it on and washes his hands.  The right hand stays faintly blue no\nmatter how hard he scrubs.\n\n                                BUD\n                Shit.\n\n                                                                CUT TO:\n\nEXT. DEEPCORE                                                           57\n\nThe platform is stopped, hovering in place.  Like a great spacecraft setting\ndown on a barren planet, the rig settles into the bottom ooze.  Flatbed\nreleases its tow lines and heads back to its berth inside.\n\n                                                                CUT TO:\n\nINT. SUB-BAY                                                            58\n\nCLOSE ON A PHOTOGRAPH, actually a computer-composited down-looking scan from\na towed LIDAR (laser imaging sonar) rig.  It shows a faint, blurry outline of\nthe Montana lying on her side on a ledge part-way down the canyon wall.  There\nis no detail.  A finger points to a flat ledge nearby.  An \"X\" has been put\non with a grease pencil.\n\n                                COFFEY (V.O.)\n                This is us.  We're just on the edge of the Cayman\n                Trough.  The Montana is here, on its side, 300\n                meters away and 70 meters below us.  We think she\n                slid down the wall, and lodged against this\n                outcropping.\n\nCUT WIDE, showing the rig crew gathered around a worktable in the sub-bay.\nThe divers, Bud, Catfish, Sonny, Finler, Jammer, and the four SEALs have\ntheir dry-suits on.  The pre-dive briefing.  Lindsey, One Night, and Hippy\nwill crew the submersibles.  Wilhite is going around clipping DOSIMETER\nBADGES on everybody.\n\n                                SONNY\n                This tells us how much radiation we get?\n\n                                HIPPY\n                Hey, whoah... I can't handle no radiation, man.\n                Forget it!  Include me out.\n\n                                CATFISH\n                Hippy, you pussy.\n\n                                HIPPY\n                What good's the money if your dick drops off in\n                six months?\n\n                                COFFEY\n                We'll take reading as we go.  If the reactor's\n                breached or the warheads have released\n                radioactive debris, we'll back away.  Simple.\n\n                                BUD\n                Okay... Hippy's not going... McWhirter, you\n                can run Little Geek.\n\nBud pats the top of a small ROV, sitting next to its larger brother, Big\nGeek.\n\n                                HIPPY\n                No way!  No way!  He can't fly an ROV worth\n                shit.  I'll go.  Shit!\n\n                                COFFEY\n                               (to all)\n                On the dive, you will do absolutely nothing\n                without direct orders from me, and you will\n                follow my instructions without discussion.  Is\n                this clear?  Alright, I want everyone finished\n                prep and ready to get wet in fifteen minutes.\n\nThe rig crew disperses, picking up helmets and diving gear.  Some are studying\nthe diagrams of the Montana's interior layout.  Bud takes Coffey aside as\nthe others prepare.\n\n                                BUD\n                Look, it's three AM.  These guys are running on\n                bad coffee and four hours sleep.  You better\n                start cutting them some slack.\n\n                                COFFEY\n                I can't afford slack, Brigman.\n\n                                BUD\n                Hey, you come on my rig, you don't talk to me,\n                you start ordering my guys around.  It won't\n                work.  You gotta know how to handle these\n                people... we have a certain way of doing things\n                here.\n\n                                COFFEY\n                I'm not interested in your way of doing things.\n                Just get your team ready to dive.\n\nEnd of discussion.  Coffey is walking away.  Burning, Bud crosses to his gear\nlocker.  Picks up his helmet.  Finler is suiting out next to him.\n\n                                FINLER\n                Hey, you know your hand is blue?\n\n                                BUD\n                Shut up and get your gear on.\n\nNEARBY, Monk comes over to pick his helmet up off the worktable.  Hippy\npoints to the heavy equipment case that says F.B.S. DEEP SUIT/MARK IV.\n\n                                HIPPY\n                I've been meaning to ask you what this thing is.\n\nMink opens the case and shows them an unfamiliar diving suit, what looks like\na space helmet, and a large backpack.\n\n                                MONK\n                Fluid breathing system.  We just got them.  We\n                use it if we need to go really deep.\n\n                                HIPPY\n                How deep?\n\n                                MONK\n                Deep.\n                     (shrugs)\n                It's classified... you know.  Anyway, you\n                breathe liquid, so you can't be compressed.\n                Pressure doesn't get to you.\n\nCatfish is grappling with the concept.\n\n                                CATFISH\n                You're saying you get liquid in your lungs?\n\n                                MONK\n                Oxygenated fluorocarbon emulsion.\n\nMonk take a clear plastic box full of O-rings off the shelf and dumps them\nout.  He opens a valve on the backpack and allows some of the fluid inside\nit to drain into the box.  Then he take Beany by the tail off Hippy's\nshoulder.\n\n                                HIPPY\n                Hey!\n\n                                MONK\n                Check this out.\n\nHe drops Beany in the box and, before Hippy can protest, closes the lid.\nBeany is forced under the surface.  He struggled for a second, and bubbles\ncome out of his mouth.  Then he casually swims around in there, completely\nsubmerged... breathing liquid.  Catfish and the others stare into the box,\namazed.\n\n                                MONK\n                See?  He's diggin' it.\n\nMonk takes Beany out and hold him by the tail for a few seconds to drain his\nlungs.  Then hands him back to Hippy.  The rat is annoyed, but otherwise\nalright.\n\n                                CATFISH\n                This is no bullshit hands down the goddamnedest\n                thing I ever saw.\n\n                                                                CUT TO:\n\nEXT. DEEPCORE/DROPOFF                                                   59\n\nThree sets of moving lights move outward from Deepcore.  Cab One and Three,\nwith Lindsey and Hippy at the controls respectively, and One Night in the\nFlatbed.  Lindsey is in the lead.  She approaches the cliff-like drop-off\nand starts to descend.\n\n                                LINDSEY\n                Com-check, everybody.  Flatbed, you on line?\n\n                                ONE NIGHT\n                Ten-four, Lindsey, read you loud and clear.\n\n                                LINDSEY\n                Cab Three?\n\n                                HIPPY\n                Cab Three, check.  Right behind you.\n\n                                LINDSEY (V.O.)\n                What's you depth, Cab Three?\n\n                                HIPPY\n                1840... 50... 60... 70...\n\n                                LINDSEY\n                Going over the wall.  Coming to bearing 065.\n                Everybody stay tight and in sight.\n\n                                ONE NIGHT\n                Starting out descent.  Divers, how're you doing?\n\nEXT. FLATBED                                                            60\n\nEight divers ride the back of Flatbed like itinerant workers on the way to\nthe fields.  Bud and his civilian crew, Catfish, Finler, and Jammer... sit\nacross from the SEALs.  They are in their gear and breathing from umbilical\nhooked in Flatbed's low-pressure manifold.\n\n                                BUD\n                Okay so far.\n\n                                JAMMER\n                How deep's the drop-off here?\n\n                                CATFISH\n                This here's the bottomless pit, baby.  Two and\n                a half miles straight down.\n\n                                COFFEY\n                Knock off the chatter.  Cab One, you getting\n                anything?\n\nINT./EXT. CAB ONE                                                       61\n\nLindsey consults her array of instruments.\n\n                                COFFEY\n                Cab One, do you see it yet?\n\n                                LINDSEY\n                The magnetometer is pegged.  Side-scan is showing\n                a big return, but I don't see anything yet.  Are\n                you sure you got the depth right on this?\n\n                                BUD (V.O., filtered)\n                You should be almost to it, ace.\n\nShe turns the submersible and...\n\nThe spotlight flares back from the great brass screw of the Montana.  It\ndwarfs Cab One, FILLING FRAME.\n\n                                LINDSEY\n                Uh, yeah, roger that... uh, found it.\n\nEXT. MONTANA/SUBMERSIBLES                                               62\n\nCab One maneuvers along the flank of the enormous sub, while Flatbed and Cab\nThree move above it.  Wilhite take readings with a hand-held neutron counter.\n\n                                COFFEY\n                Cab One, radiation readings?\n\n                                LINDSEY\n                Neutron counter's not showing very much.\n\n                                COFFEY\n                Wilhite, anything?\n\n                                WILHITE\n                Negative.  Nominal.\n\n                                COFFEY\n                Just continue forward along the hull.\n\n                                LINDSEY\n                Copy that, continuing forward.  You just want\n                me to get shots of everything, right?\n\n                                COFFEY\n                Roger, document as much as you can, but keep\n                moving.  We're on a tight timeline.\n\n                                LINDSEY\n                Copy that.\n\nThe great black hull of the Montana recedes into the darkness beyond the\npuny beams of their lights.  It seems bigger than the Titanic and just as\neerie in its final resting place.  On it side, the sub's top deck becomes a\nwall along which the tiny submersibles are moving.  Ahead, in the lights, is\na white painted circle.\n\n                                COFFEY\n                That's the midship hatch.  You see it, Cab Three?\n\n                                HIPPY\n                Roger, I see it.\n\n                                BUD\n                Just get around so your lights are on the hatch.\n\n                                HIPPY\n                Check.  Then I just hang with these guys, right?\n\n                                COFFEY\n                Right.\n\n                                ONE NIGHT\n                How do you want me?\n\n                                COFFEY\n                Just hold above it.  Alright, A team.\n\nWilhite, Schoenick, and Monk unhook their short whip-umbilicals from the\ncentral manifold and roll off the side of Flatbed.  They maneuver down toward\nthe sub's hatch.  Hippy guides Cab Three in closer to the hatch area.\n\nINT. CAB THREE                                                          63\n\nHippy turns to Perry back in the lockout chamber, ready to launch Little Geek.\nThe ROV has a handheld neutron-counter gripped in its manipulator arm.\n\n                                MONK (V.O.)\n                Stand by on the ROV.\n\n                                HIPPY\n                Perry, stand by on the ROV.\n                           (to Little Geek)\n                Sorry about this, little buddy.  Better you than\n                me, know what I mean?\n\nHippy nods and Perry drops Little Geek through the hatch into the water and\nfeed out a length of tether.  Hippy picks up the control box and watches the\nvideo screen, guiding the ROV toward the Montana's hatch.\n\nEXT. MONTANA HATCH AREA                                                 64\n\nThe three SEALs have unlatched the deck cover and revealed the hatch.  They\nopen the out hatch and Monk swims down into to narrow escape trunk.  He bangs\non the inner hatch with a wrench, listening carefully with his helmet pressed\nagainst it.\n\n                                MONK\n                It's flooded.  Alright, I'm opening her up.\n\nStraining hard in the confined space, he get the lower hatch open, then swims\nbacks out immediately.  He gestures to Hippy, via Little Geek's vision, and\nHippy flies the ROV into the hatch.\n\nEXT./INT. CAB ONE/MISSLE DECK                                           65\n\nMeanwhile Cab One and Flatbed have proceeded forward along the hull.  Beyond\nLindsey's front port, the great hatches of the Trident missile tubes roll\ntoward us in procession.  Several of the hatch covers have been forced\npartway open by the warping of the hull.\n\n                                COFFEY (V.O.)\n                Radiation is nominal.  The warheads must still\n                be intact.\n\n                                LINDSEY\n                How many are there?\n\n                                COFFEY (V.O.)\n                24 Trident missiles.  Eight MIRVs per missile.\n\n                                LINDSEY\n                That's 192 warheads... And how powerful are\n                they?\n\n                                SCHOENICK\n                Your MIRV is a tactical nuke, 50 kilotons\n                nominal yield.  Say times time Hiroshima.\n\n                                LINDSEY (V.O.)\n                Jesus Christ... this is World War Three in a\n                can.\n\n                                COFFEY (V.O.)\n                Let's knock off the chatter, please.\n\nINT. CAB THREE                                                          66\n\nTIGHT ON VIDEO SCREEN -- LITTLE GEEK'S CAMERA.  Passing through a hatch, into\na large grotto filled with pipes and machinery.  The engine room.\n\n                                MONK (V.O.)\n                Getting a reading?\n\n                                HIPPY\n                It's twitching but it's below the line you said\n                was safe.\n\nEXT. MONTANA MIDSHIP HATCH                                              67\n\nMonk moves into the opening.\n\n                                MONK\n                Alright.  Let's get in there.\n\nWilhite and Schoenick follow him through the escape trunk, into the dark\ncorridor beyond.\n\nEXT. MONTANA/BOW SECTION                                                68\n\nOut of the darkness ahead emerges the trailing edge of the sail, big as a\nfive-story building.  Far below her, Flatbed moves along the edge of the\nledge which supports the vast sub.  Its lights, and Lindsey's strobes, reveal\nthe tremendous damage to the forward section as they pass the sail.  The torn\nand twisted hull looms above Flatbed as it sets down.\n\nCoffey indicated an enormous rent where the bow section is almost torn away\nfrom the rest of the hull.\n\n                                COFFEY\n                We'll go in through that large breach.\n\n                                BUD\n                Let's go, guys.\n\nBud's team leaves Flatbed, swimming forward.  The opening is a black mouth in\ntheir lights.  Coffey moves inside.  Bud attaches one end of an orange nylon\nline to a piece of pipe and moves into the wreck behind him.\n\n                                BUD\n                Take it slow, stay on the line, and stay in\n                sight.  Watch for hatches that could close on\n                you, or any loose equipment that could fall.\n\nJammer, Catfish, Finler, and Sonny follow him inside.\n\nINT. MONTANA/FORWARD BERTHING SECTION                                   69\n\nThey find themselves in the forward berthing compartment with its rows of\nbunks.  The room is twisted and disheveled, with bedding hanging from the\nbunks like the lolling tongues of dead dogs.  Papers float in gentle\neddying currents, letters, pages from paperback novels, photos of girlfriends.\nBud pays out the line and follows Coffey forward.  As they pass sealed doors,\nCoffey pounds with a tool, listening.  All flooded.\n\nINT. ENGINE ROOM                                                        70\n\nMonk leads his team along a corridor, following Little Geek's tether.  Through\na hatch into the engine room.  Their lights play over flooded machinery.\n\nINT. COMPANIONWAY/CONTROL ROOM AND ATTACK CENTER                        71\n\nFrom the berthing Coffey's team swims up a companionway towards the attack\ncenter.  He pulls at a buckled watertight door.\n\n                                COFFEY\n                It's jammed.  Give me a hand.\n\nJammer and Bud squeeze in around Coffey.  Together they wrench the door open\non its squealing hinges.  It give way suddenly, flying open.  The suction\npulls SOMETHING THROUGH.  It slams Bud's shoulder.  He turns.  A FACE...\nRIGHT IN FRONT OF HIM!  He jerks back, gasping.\n\nFace to face with Barnes, the sonarman.  The ensign seems unmarked, merely\ndismayed at his own mortality, judging from his wide eyes and mouth.  Coffey\nreaches past Bud and pushes the ensign's body out of the way.\n\n                                COFFEY\n                Alright, let's keep moving.  We knew we were\n                going to see this.\n\nThey enter the control room.  Their lights play over the high-tech wreckage.\nFloating debris and bodies make shifting shadows on the walls as they swirl\nin the currents.  A languid, weightless waltz.  They move through the carnage.\nTheir lights pick out tableaux... the planesman still strapped in his chair,\nsomeone jammed into the ceiling pipes, hanging down.  Dead faces, pale in the\nlights.  Still.  We see only glimpses.\n\nCoffey locates the captain's body and rolls it over.  Removes the missile\narming key which hangs on a chain around the dead man's neck.  Moves on. All\nbusiness.  Bud turns back to his guys.  Checking them.  He notices Jammer is\nbreathing so rapidly he's fogging his helmet.  Catfish, Finler, and Sonny\naren't much better.  A wave a panic seems imminent.\n\n                                BUD\n                How you guys doing?\n\n                                SONNY\n                I'm alright, I'm dealing.\n\n                                CATFISH\n                Triple time sounds like a lotta money, Bud.  It\n                ain't.  I'm sorry...\n\n                                BUD\n                We're here now.  Let's get her done.\n\nWe see Bud working, calming them, talking them through it.  He's sweating\nrivers in his helmet, not looking too steady.  His projection of calm to the\nothers is his own salvation.\n\nCoffey pauses in the doorway to the communications room.\n\n                                COFFEY\n                This part I do alone.  Brigman, take you men and\n                continue aft.  Split up into two teams of two.\n                Let's get moving... we head back in fourteen\n                minutes.\n\nBud leads his team into a narrow corridor.\n\nINT. CORRIDOR/ROOMS                                                     72\n\nThey search the rooms along the corridor with their lights until they come to\na vertical hatch, open.  a pit of darkness below.\n\n                                BUD\n                Okay, Cat, Lew, Sonny.  You guys stay on this\n                deck.  Hook you line onto mine.  Any problem,\n                you tug my line.  Two pulls.  Jammer, you're\n                with me.\n\nBud drops down through the hatch to the level below, followed by Jammer, who\nbarely fits through.  Catfish hooks his safety line onto Bud's with a\ncarabiner and move along the corridor with the others.\n\nEXT./INT. CAB ONE                                                       73\n\nLindsey circles the hull, documenting, photographing.  Her strobes sear the\ndarkness, give glimpses of the dead leviathan's form as her tiny submersible\ncircles it like a bee.\n\nINT. COMMUNICATIONS CENTER                                              74\n\nWorking from a plastic card, Coffey spins the dial on the wall safe and opens\nit.  He removes several plastic binders... the code books.  He also grabs\nhandfuls of classified documents and orders, and a set of missile arming keys,\nall which he places in a pouch at his waist.\n\nINT. CORRIDOR                                                           75\n\nBud leads Jammer through a long, claustrophobically narrow corridor, tapping\non the walls and hatches periodically.  After he taps, he waits a few\nmoments.  There are no answering taps.  They open doors and shine their lights\ninto the rooms.  The are bodies, but they seem anonymous.  Crumpled shapes\nin khaki or blue.  They undog and open a hatch.  Beyond it is the largest\nchamber of the sub, the...\n\nINT. MISSLE COMPARTMENT                                                 76\n\nThe missile compartment is the large gallery a hundred and twenty feet long\nand forty feet high, with two rows of vertical launch tubes, 24 in all.  The\nchamber is divided into three levels by a floor of open steel grillwork.\n\n                                JAMMER\n                Where are we?\n\n                                BUD\n                Missile compartment.  Those are the launch tubes.\n\nThey sweep their lights around the chamber.  Jammer turns... his beam\nilluminating a body just beyond the door.  A coveralled seaman turning\nslowly in the eddying current.  Small albino crabs crawl slowly over the\nman's face.  One scuttles out of his gaping mouth.\n\n                                JAMMER\n                Lord Almighty.\n\n                                BUD\n                Hey, you okay?\n\nBud goes to him.  Gets up close to his face.  Sees that he's not.  That he's\nhyperventilating.  Fighting nausea.  Bud grabs him by the shoulders.\n\n                                BUD\n                Deep and slow, big guy.  Deep and slow.  Just\n                breathe easy.\n\n                                JAMMER\n                I... they're all dead, Bud.  They're all dead.\n                I thought... some of them... you know...\n\n                                BUD\n                I'm taking you back out.\n\n                                JAMMER\n                No!  I'm okay now.  I just don't... I can't go\n                any further in.\n\nBud sees that the big diver's breathing has stabilized.  He looks at his\nwatch.  Checker Jammer's pressure gauges.\n\n                                BUD\n                Okay, Jammer.  No problem.  You stay right here.\n                I have to go there to the end... you'll see my\n                lights.  We'll stay in voice contact.  Just hold\n                onto the rope.  Five more minutes.  Okay?\n\n                                JAMMER\n                Yeah, okay.  Okay.\n\nHe moves off through the center aisle of the gallery swimming between the huge\ncylinders.  He pays out the lifeline as he goes.\n\nINT. COM-ROOM                                                           77\n\nCoffey is working rapidly and efficiently, moving from one rack of electronics\ngear to the next, setting thermite grenades at vital points.  As the thermite\nignites, it generates an intense arc-bright light and tremendous heat.  The\ncircuit chasses melt.  Coffey works calmly in the infernal glare.\n\nINT. MISSLE COMPARTMENT                                                 78\n\nBed negotiates his way through the tangle of wreckage near the far end of the\nmissile compartment.  He goes down a stairwell to the lower level.  A HUNDRED\nFEET AWAY, Jammer loses sight of Bud's dive-lights.  He starts to get\nnervous.  Suddenly his own lights begin to DIM, flickering lower and lower.\nThey become little orange candles, the filament barely glowing.  The darkness\ncloses in.\n\n                                JAMMER\n                Bud?  BUD?!  You readin' me?  BUD?!!\n\nBUD, at the same moment, is fiddling with the connector cables on his helmet\nlights, which are dimming and flickering.  He hears nothing from his helmet\ntransceiver.\n\nJAMMER, smacks the side of his helmet.  Shakes the transceiver on his belt.\nNothing... just static.  Then even the static dies.  Panic time.\n\nHe grabs the safety line and pulls twice.  Hard.  It is snagged on a sharp\nmetal edge ten feet from him.  He pulls twice more, harder, hauling the\nthing.  The line severs.  Jammer stared at the frayed and floating toward\nhim.  His eyes bug.  He looks all around in the darkness.  Can't see Bud.\nCan't decide what to do.  We can see hysteria revving up inside him like a\nflywheel.\n\nThen he becomes aware of a faint radiance flickering over the walls.  It is a\ncold and ethereal light, unlike the warm-white of their dive lights.\n\nIt grows brighter.  He turns slowly toward it.\n\nThe glow is moving beneath the steel grill of the deck, sending shafts of\ncold light flickering upward hypnotically, coming toward him.\n\n                                JAMMER\n                Bud?  Is that you?\n\nC.U. JAMMER, shielding his eyes, staring into the radiant source.\n\nGuess what, Jammer?  It's not Bud.  In the brightest center of the glow,\nSOMETHING is moving, a figure casting strange inhuman shadow across the walls.\nJammer blinks against the glare, his face registering total, outright\nastonishment melting into terror.\n\nThe glare pulses subtly, hypnotically.  The shifting shadow falls across\nJammer.  He finally snaps out of his fixity...\n\nScreaming and gulping air he spins away and starts clawing hand over hand\nthrough the treacherous wreckage.\n\nHis harness catches on a twisted pipe.\n\nHe struggles, totally out of control... the big man reduced to a blind panic.\n\nJammer heaves forward with all his adrenalized strength.\n\nHe tears free of the entangling debris.  Launches like a torpedo... slamming\nhis backpack full force into the top sill of the hatchway.  His tri-mix\nregulator takes the full brunt of the impact.\n\nON BUD, swimming furiously back toward Jammer's position.  The strange\nradiance is gone.  His dive light flare back to full brightness.\n\n                                BUD\n                Jammer?  Answer me, buddy,  JAMMER?!\n\nHe reaches Jammer only to find him thrashing violently in place.  A seizure.\nBud grapples with him.\n\n                                BUD\n                Hang on, big guy.  Hand on!\n\nCatfish, Sonny, and Finler arrive from the corridor a moment later.  They\nleap into the fray.\n\n                                BUD\n                He's convulsing!\n\n                                CATFISH\n                It's his mixture!  Too much oxygen!\n\nThen they're all yelling at once, grappling with the big man, struggling with\nthe valves on his breathing gear.\n\n                                FINLER\n                Crank it down, man!  We're gonna losing him...\n\n                                BUD\n                SHIT, it's stuck... goddamnit!\n\n                                SONNY\n                You got it?!  You got it?\n\n                                BUD\n                Yeah, yeah... yeah.  It's turning.\n\nJammer's convulsion ends.  He goes limp.\n\n                                BUD\n                We gotta get him out of here.  Come on!\n                           (to Jammer)\n                Hang on, buddy.\n\nThey drag Jammer's slack form into the corridor, hauling their way rapidly\nback along the lifeline.\n\nINT./EXT. CAB ONE & MONTANA SAIL                                        79\n\nLindsey is approaching the monolith of the sail, maneuvering to clear the\nhorizontal diving plane.  Then her lights go dim and her thrusters loose\npower.\n\nSuddenly a bright corona breaks around the bulk of the sail and SOMETHING\nappears right in front of her, a glowing object moving like a bat out of\nhell right at her!  It is slightly smaller than submersible and we only get\na glimpse.  What we think we see in the diffuse glow is a translucent ovoid,\nopen at the front with a spinning vortex of light inside... like some\nhallucinatory jet engine.  And it's hauling ass.\n\nLindsey jinks left.  The object jogs right.  She fights the control as her\nsub slews around, slamming broadside into the sail.  K-BAM!  Her power comes\nback up.  Righting Can One, she spins to look through the aft viewport in\ntime to see the object racing away in a broad arc.  It pulls a high-G turn\nand dives straight down.\n\nWe see the object zip behind Flatbed.  One Night can't see it.  The thing\nspirals down into the darkness like a hit-and-run drunk, diving along the\nwall into the abyss until it is lost to view.\n\nHOLD ON Lindsey excited, amazed... dazed.  Her hands are shaking.  Suddenly\nBud's voice blares out over the open frequency.\n\n                                BUD (V.O.)\n                CAB ONE!  CAB ONE!  Meet me at Flatbed!  This\n                is a diver emergency!!  Do you copy?  Lindsey?!\n\nShe has a hard time focusing on what he's saying.  Finally...\n\n                                LINDSEY\n                Copy you, Bud.  On my way.\n\n                                                                CUT TO:\n\nINT. DEEPCORE INFIRMARY -- AN HOUR LATER                                80\n\nJammer is unconscious on a folding cot set up in the tiny cubicle of the\ninfirmary.  Monk, who is cross-trained as a medic as well as a demolitions\nman, has hung an IV of something.  Bud and the SEAL are in the room, the\nothers hovering outside.\n\n                                BUD\n                Whattya think?\n\n                                MONK\n                I'm a medic, which is mostly about patching\n                holes.  This type of thing... there's not much\n                I can do.  The coma could last hours or days.\n\nBud, torn by guilt, gazes at the big man lying pathetically on the cot.\n\n                                                                CUT TO:\n\nINT. CONSOLE MODULE                                                     81\n\nThe SEALs, minus Monk, are all gathered inside, debriefing with DeMarco via\nclosed-circuit video.\n\n                                DEMARCO (video)\n                Did any of you see it?\n\n                                COFFEY\n                Negative.  But there was definitely a Russian\n                bogey.  The Brigman woman saw it.\n\n                                DEMARCO\n                CINCLANTFLT's gonna go apeshit.  Two Russian\n                attack subs, a Tango and Victor, have been tracked\n                within fifty miles of here... and now we don't\n                know what the hell they are.  Okay, I don't have\n                any choice.  I'm confirming you to go to Phase\n                Two.\n\nWilhite and Schoenick glance uneasily at each other.\n\nCoffey is silent.  He is vibrating with tension... his fists clenched to\nprevent the shaking.  He is wrestling with the moment, knowing it is, in a\nway, a point of no return.\n\n                                DEMARCO\n                Is there any problem?\n\n                                COFFEY\n                Yes... I mean no.  Negative, sir.\n\nCoffey takes a deep breath.  Lets it out.  Phase Two is clearly a big deal.\n\n                                                                CUT TO:\n\nINT. MAINTENANCE ROOM B/DARKROOM                                         82\n\nThe maintenance room doubles as a camera workstation.  An adjoining head serves\nas darkroom.  Lindsey is glumly reassembling Cab One's camera housings.\n\n                                BUD\n                Did you get anything on the cameras.  Video or\n                anything?\n\n                                LINDSEY\n                No.  Look, forget it.  I don't want to talk\n                about it.\n\n                                BUD\n                Fine.  Be that way.\n\n                                LINDSEY\n                I don't know what I saw.  Okay?  Coffey wants to\n                call it a Russian submersible, fine.  It's a\n                Russian submersible.  No problem.\n\n                                BUD\n                But you think it's something else.  What?  One\n                of ours?\n\n                                LINDSEY\n                No.\n\n                                BUD\n                Whose then?  Lindsey?  Talk to me...\n\nLindsey is wrestling with a feeling which is somehow also certain knowledge.\n\n                                LINDSEY\n                Jammer saw something in there, something that\n                scared the hell out him--\n\n                                BUD\n                His mixture got screwed up.  He panicked and\n                pranged his regulator.\n\n                                LINDSEY\n                But what did he see that made him panic?\n\n                                BUD\n                What do you think he saw?\n\n                                LINDSEY\n                I don't know.  I DON'T KNOW!\n\nHippy comes pounding up, sticks his head in, gesturing animatedly.\n\n                                HIPPY\n                Hey, you guys... hurry up, check this out!\n                They're announcing it.\n\nThey follow him into the corridor, trotting down to the mess hall.\n\nINT. MESS HALL                                                          83\n\nGeneral melee as they rush in, everybody focused on the TV.\n\n                                CATFISH\n                Quiet!  Quiet!\n\n                                HIPPY\n                Turn it up, bozo.\n\n                                ANCHORMAN\n              ... the Kremlin continues to deny Russian\n                involvement in the sinking of the Trident sub\n                USS Montana.  The Navy has not released the names\n                of the 156 crewmembers, who are all presumed\n                dead at this time.  Civilian employees of a\n                Benthic Petroleum offshore drilling rig--\n\n                                HIPPY\n                Hey that's us!\n\n                                CATFISH\n                SSSSHHH!\n\n                                ANCHORMAN\n                --are apparently participating in the recovery\n                operation but we have little information about\n                their involvement.  On the scene now is--\n\n                                FINLER\n                BOOOOH!  We want names!\n\n                                SONNY\n                Hey, hey!  There's the Explorer.\n\nA LONG LENSE VIDEO SHOT of the Benthic Explorer and the other vessels in a\nstormy sea CUTS TO a shot of BILL TYLER, the on-scene reporter, in rain\ngear, clutching his microphone.  He is on the deck of a Navy support ship,\nbeing used as a staging area from the press, well away from the center of the\noperation.\n\n                                TYLER\n                --there is a tremendous amount of activity.\n                With Cuba only 80 miles away, the massive buildup\n                of US ships and aircraft in the area has drawn\n                official protest from Havana and Moscow and has\n                led to a redirection of Soviet warships into the\n                Caribbean theater.\n\n                                ANCHORMAN\n                How would you describe the mood there?\n\n                                TYLER\n                The mood is one of suspicion, even confrontation.\n                A number of Russian and Cuban trawlers,\n                undoubtedly surveillance vessels, have been\n                circling within a few miles throughout the day,\n                and Soviet aircraft have repeatedly been warned\n                away from the area...\n\n                                HIPPY\n                This sucks.\n\nINT. CORRIDOR/SUB BAY                                                   84\n\nBud, Lindsey, and Hippy walking along the corridor, Hippy in a black mood of\nincipient paranoia.\n\n                                BUD\n                What's the matter with you?\n\n                                HIPPY\n                Now we're right in the middle of this big-time\n                international incident.  Like the Cuban Missile\n                Crisis or something.\n\n                                LINDSEY\n                Figured that out for yourself, did you?\n\n                                HIPPY\n                We got Russian subs creeping around.  Shit!\n                Something goes wrong they could say anything\n                happened down here, man.  Give our folks medals,\n                know what I mean?\n\n                                BUD\n                Hippy, just relax.  You're making the women\n                nervous.\n\n                                LINDSEY\n                Cute, Virgil.\n\n                                HIPPY\n                No, I mean it.  Those SEALs aren't telling us\n                diddly.  Something's going on.\n\n                                BUD\n                Hippy, you think everything's a conspiracy.\n\n                                HIPPY\n                Everything is.\n\nOne Night is pounding down the corridor from the sub bay.\n\n                                ONE NIGHT\n                Hurry up!  Coffey's splitting with Flatbed! He\n                got me to show him the controls, then his guys\n                suited up and they're rolling.\n\nBud breaks into a run, passing her.\n\n                                BUD\n                Goddamnit!  D'you tell him we need it right now?\n\n                                ONE NIGHT\n                I told him we had to get the umbilical unhooked\n                ASAP.\n\nINT. SUB BAY                                                            85\n\nBud clears the door in time to see an empty moonpool, roiling with turbulence.\nHe runs to the edge and looks down.  Flatbed is a vague shape moving off.\n\n                                BUD\n                Unbelievable.\n\n                                                                CUT TO:\n\nEXT. EXPLORER BRIDGE -- DAY                                             86\n\nThe sky is charcoal, the sea is a mountain range of gray slopes.  Waves\nthunder over the foredeck, whipped by eighty-know winds.  Men in life\njackets scurry like insects.  Off the port bow, the ASW destroyer ALBANY\nvanishes and reappears among waves sixty feet tall.  McBride scream orders\nthat can't be heard to the crewmen on deck.  He staggers back along the bridge\nrailing.\n\nINT./EXT. BENTHIC EXPLORER BRIDGE -- DAY                                87\n\nMcBride steps into the quiet of the control room.  He turns on De Marco.\n\n                                MCBRIDE\n                We're trying to get unhooked and get out of\n                here... and your boys go sightseeing!\n\n                                DEMARCO\n                They'll be back in two hours.\n\n                                MCBRIDE\n                Two hours?!  We're gonna be getting the shit\n                kicked out of us by our friend Fred in two hours!\n\nDe Marco's expression is infuriatingly calm... icy.  McBride looks at his\nwatch and swears under his breath.\n\n                                                                CUT TO:\n\nEXT. USS MONTANA WRECK SITE                                             88\n\nFor a second time the black hull of the ballistic missile sub is illuminated\nby diver's lights.  Tiny figures, the divers move like moths around a distant\nstreetlight.  Wilhite, Monk and Schoenick are clustered around an open missile\nhatch.  Using a large lift bag, they are removing the frangible fiberglass,\nor 'diaphragm'.  Coffey pilots Flatbed with increasing deftness, deploying\nthe big arm to aid in the work.\n\nDOWN ANGLE as the diaphragm lifts away... revealing the blunt nose of the\nTRIDENT C-4 MISSLE.  Like looking down the barrel of a gun at the bullet\naimed right at you.\n\n                                                                CUT TO:\n\nINT. DEEPCORE/MESS HALL                                                 89\n\nTIGHT ON VIDEO SCREEN:  A HELICOPTER SHOT of a warship burning, rolling\nponderously as it sinks in stormy seas.\n\n                                NEWS ANCHOR (V.O.)\n                Little is known at this hour about the events\n                leading up to the collision.  The US Navy guided\n                missile  cruiser Appleton apparently struck the\n                Soviet 'Udaloy' class destroyer in low visibility\n                conditions...\n\nVARIOUS CUTS of men in life jackets among huge waves... Rescue helicopters\nhovering.  Shaky camera work.  Wind blasting.  INTERCUT WITH REACTIONS of the\nrig crew watching.\n\n                                NEWS ANCHOR (V.O.)\n                In violent seas little hope remains for over a\n                hundred Russian crewmen still missing after the\n                sinking an hour ago.\n\nSHOT OF AMERICAN CRUISER, burning, listing to one side in heavy seas.\nReplaced by SHOT OF NETWORK ANCHORMAN.\n\n                                NEWS ANCHOR\n                Soviet military spokesmen have claimed that\n                the collision constituted an unprovoked attack.\n                This was denied--\n\nIt continues.  Bud looks at Lindsey.  She turns to him, expression grim.\n\n                                LINDSEY\n                Bud, this is big time.\n\n                                                                CUT TO:\n\nEXT. MONTANA WRECKSITE                                                  90\n\nThe divers are working head-first in the missile's launch tube.  Monk reads\nfrom a plasticized card, directing the other two step by step.  The arcane\nlitany is punctuated by the hissing rasp of their breathing.\n\n                                WILHITE (filtered)\n                Separation sequencer disconnected.  Next?\n\n                                MONK (filtered)\n                Remove explosive bolts one through six in\n                counterclock-wise sequence.\n\n                                SCHOENICK (filtered)\n                Check... removing bolt one.\n\nINT. DEEPCORE                                                           91\n\nON THE RIG CREW, watching.  Bathed in the light of the video screen.\n\n                                NEWSCASTER (V.O.)\n              ... just learned that Soviet negotiators have\n                walked out of the strategic arms limitation\n                summit in protest over the incident this morning.\n\nBud switches the channel.\n\n                                ANOTHER NEWSCASTER\n              ... US and NATO military forces have been put on\n                full alert worldwide this morning in the wake\n                of...\n\n                                BUD\n                It's on every channel.\n\nBud switches again.  Reception is getting worse as the storm affect the\nsatellite down-link to Explorer.  THE SCREEN shows a reporter on a city\nstreet, stopping people at random.  Their answers are edited together:\n\n                                YOUNG WOMAN\n                You just feel so hopeless.  You can see it coming,\n                but what can you do?  What can anyone do?\n\n                                CONSTRUCTION WORKER\n                Hey, they don't want war any more than we do.\n                You think about it, you say... hey, they love\n                their kids too.  So why are we doing this?\n\nHe is replaced by a self-righteous, middle-aged woman.\n\n                                WOMAN\n                If the Russians sank that submarine, they deserve\n                what they got and a lot more, if you ask me,\n                and you did.  I think we've been pussyfooting\n                around with them long enough.\n\nEXT. USS MONTANA                                                        92\n\nIt is now clear what the SEALs are doing.  Using large lift bags and Flatbed's\nbig arm, they have pulled one of the Trident C-4 missiles partway out of its\nlaunch tube, and have partially disassembled the nose-shroud, exposing\nseveral of the MIRV warheads within.\n\nMoving very carefully, Wilhite and Schoenick ease one of the individual MIRVs\nout of its bracket.  Hanging under a lift-bag in a jerry-rigged harness, the\nthree-foot long warhead is move gently by the divers to the back of Flatbed.\n\nINT. DEEPCORE/VIDEO SCREEN                                              93\n\nAnother man in the street interview, tortured by static.\n\n                                MAN\n                Scared?  I'm scared ____-less.  But if it happens\n                it happens, nothing I can do about it.  Right?\n                So why think about it?\n\n                                                                CUT TO:\n\nINT. SUB-BAY                                                            94\n\nFlatbed surfaces in boiling foam.  The rig crew are all waiting.  Like a\ncrack pit-crew Bud's people leap onto Flatbed while its deck is still awash\nand start to work on to Navy divers, unsealing their helmets and uncoupling\ntheir umbilicals.  Hippy and Bud start to untie a cylindrical object wrapped\nin one of the SEAL's gear bags.  Coffey emerges from the hatch.\n\n                                COFFEY\n                Don't touch that.  Just step away.  Now!\n\n                                HIPPY\n                Excusez moi.\n\n                                BUD\n                Coffey, we're a little pressed for time.\n\n                                COFFEY\n                Monk, Schoenick... secure the package.\n\nThe two SEALs unlash the object in the black bag.  Bud an Lindsey exchange a\nglance.  He glares at Coffey as they pass each other.  One Night nimbly\nclimbs the hatch-tower and drops in.  Bud swings the heavy hatch up,\nbalancing it, and grins down at One Night.\n\n                                BUD\n                This ain't no drill, slick.  Make me proud.\n\n                                ONE NIGHT\n                Piece of cake, baby.\n\nHe swings the hatch closed with a CLANG.\n\n                                                                CUT TO:\n\nEXT. DEEPCORE                                                           95\n\nThe big A-frame, massive as a railroad bridge, to which the umbilical from\nthe Explorer is attached.  Flatbed rises INTO FRAME arcing around the\ncoupling mechanism F.G.  One Night deploys the big hydraulic arm.\n\nIt unfold from Flay bed like a huge steel spider leg, its claw-like 'gripper'\nopening.\n\nINT./EXT. BENTHIC EXPLORER BRIDGE -- DAY                                96\n\nAn ALARM sounds stridently on the dynamic-positioning console.\n\n                                BENDIX\n                We're losing number two thruster.  Bearing's\n                going.\n\nINT. THRUSTER ROOM TWO                                                  97\n\nDeep in one of the catamaran hulls, the positioning thruster motor is\nSCREAMING like a steel banshee above its usual roar.  It EXPLODES with smoke\nand shrapnel.  A roaring fire erupts.  Crewmen run shouting in the smoke.\n\nINT. EXPLORER BRIDGE                                                    98\n\nNow a KLAXON is going off as the ship begins to slew in the high winds.\n\n                                BENDIX\n                It's not holding.  We're swinging out of\n                position!\n\nEXT. EXPLORER'S DECK/LAUNCH WELL                                        99\n\nAs the ship slews, the umbilical is drawn off vertical.  It goes tight as a\nbowstring.  Pulled to the edge of the launch well, it rips down the side\nwith a godawful screech, tearing loose ladders and floats.\n\nEXT. DEEPCORE/A-FRAME                                                   100\n\nFlatbed's manipulator has gripped the de-coupling mechanism when the cable\nsuddenly pulls taut.  The sub is jerked sideways, its grip dislodged.  We\nsee One Night get tossed around inside.\n\nINT. DEEPCORE                                                           101\n\nLindsey is in the corridor with a cup of tea when the whole rig BOOMS LIKE A\nGONG and lurches sideways.  She's wearing her tea when Bud tears through a\ndoorway and goes pounding past her.  The intercom blares...\n\n                                HIPPY (intercom)\n                Bud to control!  Emergency!  Bud to Control!\n\nBud claws his way up the ladder to level two.  The rig BOOMS and shudders\nas...\n\nEXT. DEEPCORE                                                           102\n\nThe rig begins to move. The enormous skid breaks loose.  Start to slide,\nplowing furrows in the bottom.  One Night junks the controls, pivoting her\nsubmersible as the A-frame looms toward her.\n\nINT. DEEPCORE/CONTROL MODULE                                            103\n\nBud runs in, past Hippy, and grabs the mike.\n\n                                BUD\n                Topside, topside... pay out some slack, we're\n                getting dragged!\n\nEXT. EXPLORER DECK                                                      104\n\nThe winch man staggers along the railing, blasted by 80-knot winds.  He\nsprints for the base of the enormous crane which supports the umbilical\nwinch.  A wave blasts him into the bulkhead.  He half-crawls to the ladder\ngoing up to the winch-house.  As he climbs the winch's heave-compensator\nslides up and down, FILLING FRAME behind him.\n\nIt is bottoming-out with a sound like a piledriver, overloaded by the strain\non the cable.  It chooses that moment to fail.  GRINDING CRASH OF METAL.\n\nINT./EXT. DEEPCORE CONTROL MODULE                                       105\n\nLindsey has joined Bud, looking out the front viewport.\n\n                                LINDSEY\n                We're heading right for the drop off!\n\nEXT. EXPLORER DECK                                                      106\n\nThe deck is ripped upward as the entire 40-ton crane is pulled over by the\nweight of Deepcore.  It topples in the launch well with a roar of tortured\nsteel that rivals the storm.  An EXPLOSION OF WATER.  UNDERWATER, the crane\ntumbles between the twin hulls.  Trailing a vortex of foam and debris, it\nroars down on us, FILLING FRAME WITH BLACKNESS.\n\nINT. EXPLORER BRIDGE                                                    107\n\nMcBride stares in shock at the churning cauldron of the launch well.  Grabs\nthe underwater telephone.\n\n                                MCBRIDE\n                Bud!  We've lost the crane!\n\n                                BUD (V.O.)\n                What?  Say again.\n\n                                MCBRIDE\n                THE CRANE!  WE'VE LOST THE CRANE.  IT'S ON ITS\n                WAY TO YOU!!\n\nINT. DEEPCORE/CONTROL MODULE                                            108\n\nEveryone is stunned by what is happening.  Lindsey fires up the sonar.\n\n                                LINDSEY\n                Got it!  It's dropping straight to us.\n\nShe puts the signal over the speakers and the room fills with eerie PINGING.\nBud shouts over the intercom.\n\n                                BUD\n                Rig for impact!  Seal all exterior hatches.\n                Move it!  Let's go!\n\nVARIOUS ANGLES, QUICK CUTS, as everyone runs to comply:\n\nThe rig crew pounding down the narrow corridors.  Diving through low\nhatchways.  Hatches are closed and the wheels spun down.  Hippy puts into a\nZIP-LOK BAG and seals it.\n\nEXT. DEEPCORE                                                           109\n\nThe umbilical drops down in slack loops out of the blackness above, draping\nitself over the habitat in large coils.  One Night pilots her submersible\nfeverishly among the falling loops.  She banks and twists.  A length of heavy\numbilical slams onto her neck, tipping the sub.\n\nShe manages to get out from under it a keep going.\n\nINT. CONTROL MODULE                                                     110\n\nThrough the front viewport they can see the coils of cable piling up in front\nof the rig.  The hull booms with impacts as the massive stuff hits.\n\nEveryone hold their breath as the sonar return-pings get closer... and\ncloser.  And closer...\n\nAn ENORMOUS SHAPE plunged into the floodlight in front of the rig.\n\nK-WHAM!!  The 40-ton crane hits like a flatiron thirty feet in front of them.\nA clean miss.  Much WHOOPING AND CHEERING.  Then...\n\nThe crane topples slowly over the back.  It rolls down the slope of the drop-\noff, gathering speed.  Then tumbles over the cliff into the abyssal canyon.\nThe coiled umbilical starts to pay out after it like rope after a harpoon.\nAnd they're still attached.\n\n                                LINDSEY\n                Oh shit.\n\nAn agonizing few seconds.  Then... the cable pulls taut.\n\nK-BOOM!!  The rig is slammed by the shock.  Everyone is knocked off his feet,\ninto walls and equipment.\n\nEXT. DEEPCORE                                                           111\n\nThe rig begins to slide.  It tilts over the embankment and grinds down the\nslope of the drop-off in a cloud of silt.  The cable pulling it inexorably\ntoward the cliff.  The framework twists and slams into rocks.  SCREECHING\nAND GROANING of tortured steel.\n\nINT. DEEPCORE/CORRIDOR/LADDERWELL/MAIN CORRIDOR                         112\n\nAll hell has broken loose.  SIRENS, SCREAMING, a KLAXON HOOTING moronically.\nBud sprints from Control, bouncing off the corridor walls as the rig\nlurches and tilts.  The lights go out.  Emergency light come on.  He trips\nand falls, scrambles up, running on.\n\nIN THE LADDERWELL of trimodule C, Lindsey runs toward the machine rooms.\nK-BOOM!  A searing bright EXPLOSION in the electrical room.  Flames roar\nthrough the doorway.  She dashed to a seawater hose hanging nearby and starts\nto unroll it.  She sees Coffey and Schoenick in maintenance, lashing down\nthe mystery package.\n\n                                LINDSEY\n                Hey!  Get on this hose, you turkeys!\n\nINT. TRIMODULE C/COMPRESSOR ROOM                                        113\n\nMonk is working in a spray of seawater, turning valves to stop the flow of\nruptured pipes.  Behind him, a wall of flame blossoms through the door from\nthe electrical room, driving the back with the heat.  A reservoir-tanks\nbreaks loose from one of the compressor assemblies.  In rolls at him,\ncrushing his legs against machinery.  The fire roars into the room.\n\nINT. SUB BAY                                                            114\n\nHippy runs in.  The place is going nuts.  Water floods from the moonpool as\nthe rig tilts.  Wilhite is dancing across the deck, leaping over compressed-\ngas cylinders which are rolling around loose.  Cab One jumps clear off its\ncradle and slides SCREECHING across the deck.  Wilhite, running before the\n12-tom juggernaut, had no place to go.  The SEAL dives into the churning\nmoonpool.  Cab One slams into the end wall, then spins and rolls toward\nHippy.\n\nHe starts to run.  Drop something.  Looks back.\n\nBeany, in his zip-loc bag, is lying in the path of the slide submersible.\nHippy runs back.  Scoops up the baggie.  Cab One FILLS FRAME behind him.\nHe makes it through the door an instant before the thing hits behind him,\nbuckling the steel doorframe.\n\nWilhite is clawing up the sheep skirting of the moonpool.  He gets his fingers\nover the top.  Pulls himself up...\n\nA steel helium tank slams against his fingers, crushing them, and he falls\nback.  More tanks bounce over the lip of the pool, hammering Wilhite down\ninto the foaming water.\n\nHe doesn't surface.\n\nEXT. DEEPCORE                                                           115\n\nThe rig is sliding to the edge of the cliff.  Beyond it... the bottomless\npit of the Cayman Trough.  It slams, crushing and twisting, into a rock\noutcropping and stops, hanging over the precipice.\n\nINT. TRIMODULE A/QUARTERS                                                116\n\nPerry is trapped as the trimodule floods with stunning swiftness.  He makes\nit through an emergency hatch between floors but can't get it closed.  The\ninrushing tide blasts it open.  He scramble upward to the next hatch.  Spins\nthe wheel.  No time.  He is slammed against the ceiling by the force of the\nwater.\n\nOMITTED                                                                 A116\n\nINT. DRILL ROOM                                                         B116\n\nLew Finler, Tommy Ray Dietz, and Lupton McWhirter fight their way toward the\ndoor as the drill room floods rapidly.  Ahead, the big automated watertight\ndoor is closing like a motorized bank-vault.  They reach it just as it is\nclosing, but can't prevail against the strength of the motors.  FROM THE FAR\nSIDE, we can see them screaming soundlessly at the tiny pressure window in\nthe door.  We can hear the dull THUNK of their pounding.\n\nINT. TRIMODULE C/LADDERWELL AND COMPRESSOR ROOM                         117\n\nCoffey and Schoenick, in emergency breathing masks, are fighting the fire with\na seawater hose and fire extinguishers.  Smoke and steam choke the dark\nchambers.\n\nNearby, Lindsey grabs Hippy's arm as he is running past and drags him into the\nblazing compressor room.  Hands him her seawater hose.  Wide-eyes, he starts\nblasting everything in sight with water.\n\n                                LINDSEY\n                No! Hold it on me!\n\nShe rushed into the teeth of the fire as Hippy blasts her with a spray of\nwater, following her into the intense heat.  She grabs Monk, who is\nsemiconscious, and drags him out of the blazing room... Hippy dancing back\nwith the hose, tripping, blasting her in the face.\n\nBut it works.  They get Monk clear.\n\nINT. DRILL ROOM CORRIDOR                                                118\n\nBud comes pounding down the flooding corridor in time to see the water in the\ndrill room swirl above the pressure window, obscuring the faces of the\ntrapped men.  He claws futility at the door.  The motors and the fail-safe\nlatching mechanism are on the opposite side.  Through the pressure window he\nwatches helplessly as they drown.  We don't see what he sees, but we know\nwhat he sees.  Suddenly the bulkhead next to him gives way and a freezing\ntorrent thunders in.  Bud is blown off his feet a hurled along the corridor.\n\nHe scramble up somehow, splashing waist deep toward the opposite end of the\ncorridor where another of the hydraulic doors is closing inexorably.  He's\nnot going to make it.  He reaches it a moment too late to squeeze through.\nGrabs the edge of the door and desperately tries to stop it from closing with\nthe strength of this arms.  It doesn't work.  The steel door closes on the\nfingers of his left hand, pinning them in the doorframe.\n\nBut something amazing happens.  His wedding ring lodges between the door and\nframe, preventing his fingers from being crushed and the door from\nsealing and locking.\n\nIt resists tons of pressure, denting but not collapsing.\n\nThe freezing sea pours in until only his head is clear.\n\n                                BUD\n                Heeyy!!  HHHEEEYYY!!\n\nON THE OTHER SIDE OF THE DOOR, Catfish and Sonny come pounding up.  They see\nhis face at the tiny window and his hand jammed in the door.  Sonny wedges\na crowbar in the narrow opening and starts to pry.  Catfish whips open his\njackknife and slashes the hydraulic hoses on the door actuator.  He is\nsprayed with red hydraulic fluid, machine blood.\n\nTogether they force open the door.  Bud is blown through in a torture of\nwater.  Sonny is thrown back into some pipes.  Breaks his arm.\n\nTogether they somehow heave the door shut manually, cutting off the flow.\nCatfish hammers the fail-safe latch home with the crowbar.\n\nBud lies gasping and shivering... staring at the tiny band of metal that\nsaved him.\n\n                                                                DISSOLVE TO:\n\nEXT. DEEPCORE/ONE HOUR LATER                                            A118\n\nLOOKING DOWN THE WALL of the canyon as Big Geek moves beneath us, tilting up\nto show Deepcore perched at the very edge of the abyss.  The rig is twisted\nand dented, covered with loops of umbilical, trimodule-A a mass of wreckage.\nThe ROV passes across the front of the control module.  Through the front\nport, two figures can be seen in the light of a single emergency lamp.\n\n                                SONNY (V.O. static)\n                Mayday, mayday.  This is Deepcore Two calling\n                Benthic Explorer.  Do you read, over?\n\nINT. CONTROL MODULE                                                     B118\n\nSonny flips some switches on the UQC acoustic transceiver.  Tries again.\n\n                                SONNY\n                Benthic Explorer, Benthic Explorer.  Do you read,\n                over?  This is Deepcore--\n\n                                BUD\n                Forget it, Sonny.  They're gone.\n\nINT. TRIMODULE C                                                        119\n\nBud walks down the corridor from control, slowly... as if carrying a great\nweight.  The air is still thick with smoke.  The power off... everything\nlit by emergency lights.  Makeshift quarters have been set up in the mess\nhall, with blankets laid out on the tables, and with folding cots in the\nstorage room across the hall.  Jammer is still unconscious.  Coffey and\nSchoenick bring Monk in on a stretcher, and set him up on a table.  He is\nconscious but dazed with painkillers, his led splinted.\n\n                                BUD\n                Did you find Wilhite?\n\n                                COFFEY\n                No.\n\nHe and Bud lock eyes.  Bud bites back on his recriminations, but his gaze\nblames Coffey.  He turns away.\n\n                                COFFEY\n                Brigman.\n                              (Bud turns)\n                I was under orders.  I had no choice.\n\nCoffey's manner is subdued, contrite.  A marked contrast to his previous\nbrusque arrogance.  He's wrestling with his own loss, a sever blow to the\ntight brotherhood of a SEAL unit.  Bud's anger is not dispelled.  But he\ncan't address it now.  He moves on.\n\nPAST THE INFIRMARY, where Sonny Dawson is rigging a sling over his own broken\narm.  He cries out in pain, cursing at himself.  LOOKING DOWN THE CENTRAL WELL\nas Bud crosses.  Down through the grill decking we can see the bottom level\nof the module is flooded.  Catfish is down there welding, sending shivering\nreflections through the chamber.\n\nINT. MACHINE ROOM                                                       120\n\nLindsey is working, up to her knees in water.  She is covered with grease,\ntools scattered around.  Bud puts his hand on her shoulder.  She looks up,\nblows some hair out of her eyes.\n\n                                BUD\n                What's the scoop, ace?\n\n                                LINDSEY\n                I can get power to this module and sub-bay if\n                I remote these busses.  I've gotta get past the\n                mains, which are a total melt-down.\n\nRather than trigger anger and invective, the disaster seems to have affected\nher in a different way.  She's accepted the situation, now that's it's done,\nand is immersing herself in technical tasks, which are for her therapeutic.\n\n                                BUD\n                Need some help?\n\n                                LINDSEY\n                Thanks.  No, I can handle it.  Bud... there\n                won't be enough to run the heaters.  In a couple\n                hours this place is going to be as cold as a\n                meat locker.\n\n                                BUD\n                What about O-2?\n\n                                LINDSEY\n                Brace yourself.  We've got about 12 hours worth\n                if we close off the sections we're not using.\n\n                                BUD\n                The storm's gonna last longer than 12 hours.\n\n                                LINDSEY\n                I can extend that.  There's some storage tanks\n                outboard on the wrecked module.  I'll have to go\n                outside to tie onto them.\n\nShe goes back to her task, working efficiently with a socket wrench.\n\n                                BUD\n                Hey, Lins...\n                          (she looks up)\n                I'm glad your here.\n\n                                LINDSEY\n                Yeah?  Well I'm not.\n\nOMITTED                                                                 121\n\nOMITTED                                                                 122\n\nThe sub bay is still a mess.  Dark.  A few battery-operated lamps.  Flatbed\nis back, floating in the moonpool.\n\nOne Night and Hippy are in deep concentration, piloting the two ROVs in a\ndamage survey of the rig.  Bud comes up behind them, check her screen first.\nBIG GEEK'S MONITOR shows a view of the aft section of the rig.  The drilling\nderrick had collapsed across Cab Three, totaling it.  A girder is jammed\nthrough its acrylic front dome.\n\n                                ONE NIGHT\n                Right through the brainpan.  Deader'n dogshit,\n                boss.\n\n                                BUD\n                            (to Hippy)\n                Where're you?\n\n                                HIPPY\n                Quarters.  Level two.\n\nINT. TRIMODULE A/QUARTERS                                               A123\n\nLittle Geek rises up through the open central hatch, pivoting in a circle to\nscan the flooded interior.\n\nINT. SUB BAY/R.O.V. STATION                                             B123\n\nTIGHT ON VIDEO SCREEN, LITTLE GEEK'S POV.  The interior of the structure is a\nshambles.  The lights of the little robot fall upon a figure... Perry.\nLying on the deck, almost looking like he's asleep.\n\n                                HIPPY\n                That's Perry.\n\n                                BUD\n                    (lets his breath out slowly)\n                That's it then.  Finler, McWhirter, Dietz, and\n                Perry.  Jesus.\n\n                                HIPPY\n                       (gestured at the screen)\n                Do we just leave him there?\n\n                                BUD\n                Yeah, for now.  Our first priority's to get\n                something to breathe.\n\n                                                                CUT TO:\n\nEXT. DEEPCORE                                                           124\n\nCatfish and Lindsey, in suits and helmets, drop down from the glare of the\nmoonpool onto the dark sea floor under the rig.  Walking, they pull their\numbilicals behind them and head out through the twisted wreckage.  Little\nGeek follows along like a dog at their heels.  They settle beside a valve\nassembly at the base of the wrecked module.\n\n                                LINDSEY\n                Cat, you tie onto this manifold.  There's some\n                tanks on the other side; I'm gonna go check\n                them out.\n\n                                CATFISH\n                You watch yourself.\n\nHe begins to attach one end of a coiled-up high-pressure hose to a manifold.\nShe takes the other end of the hose and moves off into the darkness.  Little\nGeek goes with her faithfully.\n\nINT. SUB BAY                                                            125\n\nCab One is hanging from the overhead crane while One Nigh works to repair it.\nBud is nearby, tending hose for the divers and handing her tools.  Talking\nwhile they work.  Hippy is across the moonpool running Little Geek.\n\n                                ONE NIGHT\n                Gimme a three-eighths socket on a long extension.\n                           (he hands it to her)\n                So there you were--\n\n                                BUD\n                There we were, side by side, on the same ship,\n                for two months.  I'm tool-pusher and we're\n                testing this automated derrick of hers.  So, we\n                get back on the beach and... we're living\n                together.\n\n                                ONE NIGHT\n                Doesn't mean you had to marry her.\n\n                                BUD\n                We were due to go back out on the same ship.\n                Six months of tests.  If you were married you\n                got a state-room.  Otherwise it was bunks.\n\n                                ONE NIGHT\n                Okay, good reason.  Then what?\n\n                                BUD\n                It was alright for a while, you know.  But then\n                she got promoted to project engineer on this\n                thing, couple years ago.\n\n                                ONE NIGHT\n                She went front-office on you.  Tighten that for\n                me, right there.  That's it.\n\n                                BUD\n                Well, you know Lindsey, too damn aggressive--\n                Son of a--!!\n\nHe's jammed his fingers with a wrench torquing down a bolt.  Whips his hand\nout.\n\n                                BUD\n                She didn't leave me... she just left me behind.\n\nShe puts her arm around his shoulders, somehow managing to be fraternal,\nmaternal and suggestive all at the same time.\n\n                                ONE NIGHT\n                Bud, let me tell you something.  She ain't half\n                as smart as she thinks she is.\n\nShe smiles and pretends to kink Lindsey's air-hose.\n\nACROSS THE CHAMBER, Hippy scowls as Little Geek's screen starts to go haywire\nwith interference.\n\n                                HIPPY\n                Hey, Lindsey, you reading me?  Over.\n\nOMITTED                                                                 126\n\nEXT. DEEPCORE/TRIMODULE A                                               127\n\nCatfish is working on one side of the wrecked module while Lindsey is on the\nother, out of sight.  She is standing on the bottom at the base of the\nwreckage, checking valves on a rack of oxygen bottles amongst the wreckage.\nRight at the edge of the canyon wall.  Behind her is a sheer drop to\nnothingness\n\n                                LINDSEY\n                Yeah, Hippy, I read you.  What's the matter?\n\nThe reply is GARBLED by a wash of static.  Then, for no apparent reason,\nLindsey's helmet light begins to dim out.  Little Geek's lights fade.  His\nmotors whine to a stop.\n\nON CATFISH, as his lights drop to candleglows.\n\nINT. SUB BAY                                                            A127\n\nThe emergency lights are dimming, like a brownout.  Bud grabs the diver\nintercom mike.\n\n                                BUD\n                Lins, how're you doing?  Lindsey?\n\nEXT. TRIMODULE A                                                        128\n\nON LINDSEY, as she fiddles with her lights and transceiver pack.\n\n                                LINDSEY\n                Catfish... I got a problem here.  You there?\n                Catfish?\n\nBehind her, SOMETHING rises from the depths.\n\nIt is the little vehicle she almost collided with at the Montana wreck.\n\nIt comes right up behind her.  She doesn't know it's there.  It hovers\nsideways like a hummingbird, as if curious, trying to get a better look.  She\nbecomes aware of the pulsing glow on the ground around her.  She turns\nslowly.  We see her react as the glowing, pulsing apparition is reflected in\nher faceplate.\n\nA more powerful glow washes up onto her from below.\n\nHer eyes go down.  She gasps, absolutely stunned...\n\nAbove the edge of the wall, AN ENORMOUS SHAPE RISES SILENTLY OUT OF THE\nDEPTHS.  Over sixty feet across.  It looks like a blown glass manta ray, its\ntransparent outer hull housing interior structures of great delicacy and\ncomplexity, pulsing with a blue-violet glow.\n\nLindsey stand before it, unable to move.  Absolutely rapt.\n\nCaptivated by its ethereal beauty.  It begins to turn, majestically, one\nrounded wing passing only a few feet above her.  She reaches up.  Touches it\nas it passes over her.\n\nLindsey is without fear, completely mesmerized.\n\nThe thing completes its turn and dives gracefully down along the wall.  She\nis gently lifted by a backwash of turbulent water.\n\nAbout that time, Lindsey remembers she has a still camera, a little Nikonos.\n\nShe fumbles to set focus and exposure with her bulky gloves as the beautiful\nmachine glides into the depths.  Gets all set for a shot and...\n\nWOOSH!  The little 'scoutschip' whizzes past her from behind, startling her.\nShe completely misses the shot of the 'manta ship'.  She pivots, trying to\nget a shot of the little one as it zig-zags down along the wall, fast as a\nmeteor.  CLICK.  She get a shot a second before it disappears.\n\nFrom around the flank of the rig module, Catfish appears.  Their com-sets\ncome backs to life, along with their lights.\n\n                                LINDSEY\n                You better not say you missed that.\n\n                                CATFISH\n                Missed what?\n\n                                                                CUT TO:\n\nINT. DEEPCORE/MESS HALL                                                 129\n\nTIGHT ON SLIDE STRIP.  Lindsey's fingertip in for scale.  The shot is black\nwith a little squiggle of light in the center.  Pathetic.\n\n                                BUD\n                Nice shot, Lins.\n\n                                SONNY\n                What is that?  You drop your dive light?\n\nWIDER, SHOWING THE GROUP huddled around Lindsey who has her freshly-processed\nslide roll laid out on the pinball machine, using it as a light table.\n\n                                LINDSEY\n                Come on, you guys... look, this is the little\n                one right here.  You can see how it's kind of\n                zigging around.\n\n                                BUD\n                If you say so.  It could be anything.\n\n                                LINDSEY\n                I'm telling you what is there.  You're just not\n                hearing.  The impulses somehow aren't getting\n                from you ears to your brainpan.  There's something\n                down there.  Something not... us.\n\nShe looks around.  Sees a lot of skepticism in the eyes around her.\n\n                                CATFISH\n                Y'all could be more specific.\n\n                                LINDSEY\n                Not us.  Not human.  Get it?  Something non-\n                human, but intelligent...\n\n                                HIPPY\n                You mean like Coffey?\n\nLindsey is reddening.  Despite her conviction, this is really hard.\n\n                                LINDSEY\n                A non-terrestrial intelligence.\n\n                                HIPPY\n                Non-Terrestrial Intelligence.  NTIs.  Yeah, I\n                like that better then UFOs.  Although that\n                works too... Underwater Flying Objects.\n\nHippy is not really mocking her.  He's actually into it.  But it has that\neffect.  Catfish is eyeing Lindsey like he's never seen her before.\n\n                                CATFISH\n                Are we talkin' little space friend here?\n\n                                HIPPY\n                Right on!  Hot rods of the Gods.  Right, Lins?\n                Hey, no really!  It could be NTIs.  The CIA has\n                known about them for years.  They abduct people\n                all the time.  There was this woman I knew in\n                Albuquerque who--\n\n                                LINDSEY\n                Hippy, do me a favor... stay off my side.\n\nBud takes her firmly by the arm.  Heads her out into the corridor.\n\n                                BUD\n                Lindsey, will you step into my office for a\n                minute...\n\nINT. CORRIDOR/LADDER WELL                                               130\n\nHe propels her along the corridor, away from the mess hall doorway.  They\nface each other in the narrow space.\n\n                                BUD\n                Jesus, Lindsey--\n\n                                LINDSEY\n                Bud, something really important is happening\n                here.\n\n                                BUD\n                Look.  I'm just trying to hold this situation\n                together.  I can't allow you to cause this kind\n                of hysteria--\n\n                                LINDSEY\n                Who's hysterical?  Nobody's hysterical!\n\nThey're talking across each other, not connecting.  Bud weary and frustrated.\nLindsey is cranked up with the afterglow of her encounter.\n\n                                BUD\n                All I'm saying is when you're hanging on by your\n                fingernails, you don't go waving you arms around.\n\n                                LINDSEY\n                I saw something!  I'm not going to go back there\n                and say I didn't see it when I did.  I'm sorry.\n\n                                BUD\n                God, you are the most stubborn woman I ever knew.\n\n                                LINDSEY\n                I need you to believe me, Bud.  Look at me.  Do\n                I seem stressed out?  Any of the symptoms of\n                pressure sickness, any tremors, slurred speech?\n\n                                BUD\n                No.\n\n                                LINDSEY\n                Bud, this is me, Lindsey.  Okay?  You know me\n                better than anybody in the world.  Now watch my\n                lips... I saw these things.  I touched one of\n                them.  And it wasn't some clunky steel can like\n                we would build... it glided.  It was the most\n                beautiful thing I've ever seen.\n\nBud is stilled by her intensity.  She moves close to him.  Eyes alive and\nluminous.\n\n                                LINDSEY\n                It was a machine, but it seems almost alive.\n                Like a... dance of light.  Bud, you have to\n                trust me... please.  I don't think they mean us\n                harm.  I don't know how I know that, it's just a\n                feeling.\n\n                                BUD\n                How can I go on a feeling?  You think Coffey's\n                going to go on you 'feeling'?\n\n                                LINDSEY\n                We all see what we want to see... Coffey looks\n                and he sees Russians, he sees hate and fear.\n                Bud, you have to look with better eyes than\n                that.\n\nBud has been taking this all in.  His eyes tracking her face.  He closes his\neyes, taking a deep breath.  It's so hard for him to do this, but...\n\n                                BUD\n                I can't, Lindsey.  I'm sorry.  How can I?\n\n                                                                CUT TO:\n\nINT. MESS HALL -- LATER                                                 131\n\nCoffey has Bud, Lindsey and several of the rig crew gathered for a little\nsummit.  Lindsey is withdrawn, sitting far from the others, a self-imposed\nexile.  They're all wearing warm clothes and hugging themselves.  Their\nbreath shows in the air.\n\n                                COFFEY\n                I want 'round-the-clock manning of the sonar\n                shack and the exterior cameras.  We need early\n                warning if the Soviet craft try another incursion.\n\n                                LINDSEY\n                          (rolling her eyes)\n                Gimme a break!  Coffey, these things live three\n                and a half miles down on the bottom of an abyssal\n                trench!  Trust me... they're not speaking\n                Russian.\n\nCoffey looks at her for a moment, then goes on as if she hadn't spoke.\n\n                                COFFEY\n                            (to One Night)\n                Why haven't you finished repairs on the\n                hydrophone transmitter yet?\n\n                                ONE NIGHT\n                I was having my nails done.\n\nCoffey is sweating, despite the chill.  Keeps his hands clenched in fists so\nthey won't see how bad the tremors have gotten.\n\n                                COFFEY\n                Get something straight.  You people are under my\n                authority--\n\n                                CATFISH\n                Look, podner... we don't work for you, we don't\n                take orders from you, and we don't much like you.\n                In addition to which your momma dresses you\n                funny.\n\nCoffey's eyes are straight razors.  He slashes them from face to face.  You\ncan see him tightening up like a clockspring, losing control of the situation\nin front of his own men.  Bud defuses it.\n\n                                BUD\n                'Fish'?\n\n                                CATFISH\n                Yuh?\n\n                                BUD\n                Take the first watch in sonar.  Hippy, you\n                handle the exterior surveillance.  One Night, see\n                if you can get that transmitter working for me,\n                okay?\n\n                                ONE NIGHT\n                Gimme a couple of hours.\n\nHOLD ON COFFEY as everyone leaves.  Winding tighter.\n\n                                                                CUT TO:\n\nINT. MAINTENANCE ROOM B -- LATER                                        132\n\nCoffey and Schoenick are bending over the warhead.  They have a small port\nremoved and are attaching waterproof leads from an ELECTRONIC DETONATOR.  The\nblack box Lindsey glimpsed earlier.  As the two SEALs work like surgeons, we\nsee past Coffey's shoulder to a hemispherical window behind him, which looks\nout into the perpetual blackness.  Something appears... a goofy shark face.\n\nBig Geek rises silently in front of the port.  It moves a little, trying to\nget a peek over Coffey's shoulder.\n\nINT. CONTROL MODULE/ROV SHACK                                           133\n\nHippy is twiddling his joysticks, watching the screen like a ferret.\n\n                                HIPPY\n                Come on... move to the left... just a little\n                more... come on, A.J. Squared Away... that's\n                it--\n\nON THE SCREEN, Geek's POV.  Coffey is blocking Hippy's view of whatever it is\nthey're working on.  Abruptly, be moves.  The warhead is lying there in plain\nsight, detonator wires hooked up.  Hippy's eyes bug out.  He knows exactly\nwhat it is.\n\n                                HIPPY\n                Pretty radical, guys.  Pretty radical.\n\nHe hurries to the VCR and puts it into RECORD.\n\nINT. CONTROL MODULE/ROV SHACK -- MINUTES LATER                          134\n\nVideo image of the SEALs working.  It FREEZES on a clear view of the warhead.\n\n                                HIPPY (V.O.)\n                Say hello to MIRV.\n\nBud has his face right up to screen.  He frowns, skeptical.\n\n                                HIPPY\n                Come on, man.  What else could it be?\n\n                                BUD\n                Why bring it here?\n\n                                HIPPY\n                It's gotta be, like, an emergency plan to keep\n                it away from the Russians... Hotwire one of the\n                nukes with some kinda detonator, put it back in\n                the sub, and fry the whole thing, slicker'n snot.\n                Oh, uh... hi, Lins.\n\nBud whips around.  Lindsey, standing quietly in the doorway.  It's apparent\nfrom expression she's been watching them for some time.  She looks ready to\nkill somebody.  Then she's gone.\n\nINT. CORRIDOR                                                           135\n\nBud catches up to her in the corridor, trying to put the brakes on her.\n\n                                LINDSEY\n                Look, goddamnit, if you won't do something about\n                it, I will.\n\n                                BUD\n                Lindsey!  Wait a second--\n\nShe reaches the watertight door to Maintenance Room B.  It's locked.  Before\nBud can stop her she grabs a fire-extinguisher off the wall and pounds on\nthe steel door like a big gong.  BOOM!  BOOM!  BOOM!\n\nNeedless to say, it opens.  She pushes past Schoenick, see the bomb lying\nthere naked.\n\n                                LINDSEY\n                You've got some huevos bringing this...\n                thing... into my rig!  With everything that's\n                been going on up in the world, you bring a\n                nuclear weapon in here?  Does this strike anyone\n                as particularly psychotic, or is it just me?\n\n                                COFFEY\n                You don't need to know the details of this\n                mission... you're better off if you don't.\n\n                                LINDSEY\n                You're right... I don't.  I just need to know\n                that this thing is out of here!  You hear me,\n                Roger Ramjet?\n\n                                COFFEY\n                Mrs. Brigman, you're becoming a serious impediment\n                to this mission.  I believe the stress is\n                affecting you.\n                            (to Schoenick)\n                Escort her to quarters and have Monk prepare a\n                tranquilizer.\n\nSchoenick takes her arm in a tight grip.\n\n                                LINDSEY\n                Bullshit, you can't do that.  Oww... goddamnit!\n\nLindsey goes bananas, trying to get Schoenick's big hands off her arms.  Bud\nslams his hand down on the intercom button.\n\n                                BUD\n                Emergency!  Maintenance room B.  Emergency!\n\nHe pulls the fire alarm for good measure and spins on Coffey... warning him\nwith a look that is not to be messed with.  Coffey is braced back against the\nworktable... an odd stance, with one arm behind his back.  Suddenly there's\na crowd outside the door as Catfish, Hippy, One Night, and Sonny come running\nup.  Confrontation time.\n\nSirens going.  About a million volts of electricity in the air.  Bud braces\nSchoenick.\n\n                                BUD\n                Let her go.  Do it... right now.\n\nHe does.  Lindsey jerks away.  Rubs her arms.\n\n                                LINDSEY\n                You dumb jarhead motherf--\n\n                                BUD\n                Chill out, Lindsey!!\n\n                                CATFISH\n                What's the problem?\n\nEveryone is frozen in place.  Bud a Coffey... snake and mongoose, glaring.\nBud pulls Lindsey back into the corridor.\n\n                                BUD\n                Nothing.  We were just leaving.\n                              (to her)\n                Weren't we?\n\nANGLE FROM BEHIND COFFEY, as Bud's group moves out of sight up the corridor.\nHands behind his back.  In his hand, cocked, finger on the trigger, is the\n.45.  He turns and sets it on the table, steadying himself as if in the wind.\nhe seems to sag.  When he looks at Schoenick, his eyes are wounds.  A hunted\nanimal.  Voice shaky.\n\n                                COFFEY\n                They can't be trusted.  They're turning against\n                us.  We may have to take... steps.\n\nINT. CORRIDOR                                                           136\n\nLindsey, Bud, Hippy.  Bud slows, letting them trail behind the others.\n\n                                BUD\n                Lins, stay away from that guy.  I mean it.\n\n                                HIPPY\n                Yeah.  The dude's in bad shape... you see his\n                hands?\n\n                                LINDSEY\n                He's got the shakes?\n\n                                BUD\n                Look, the guy's operating on his own, cut off\n                from chain of command.  He's exhibiting symptoms\n                of pressure-induced psychosis.  And he's got a\n                nuclear weapon.  So, as a personal favor to me...\n                will you put your tongue in neutral for a while?\n\n                                HIPPY\n                Man, I give this a sphincter-factor of about\n                nine point five.\n\nINT. MAINTENANCE ROOM B                                                 137\n\nCoffey goes to the dome port.  Looks past his shrunken and twisted reflection\ninto the void.  Eternal night.\n\nANGLE FROM OUTSIDE.  Coffey's face in the window.  Stuck to the acrylic\nbubble beside him is one of those Garfields, suction cups on its paws.  Coffey\nstares out.  Behind his eyes, his brain is like that cat, just hanging on,\nspreadeagle and screaming.\n\n                                                                CUT TO:\n\nINT. SUB-BAY/DIVE-PREP AREA                                             138\n\nUnder a single worklight, a couple of conspirators.  Lindsey and Hippy hunch\nover Big Geek.  The ROV grins maniacally with goofy shark teeth.\n\n                                LINDSEY\n                Look, you can just punch into his little chip\n                where you want him to go, and he goes, right?\n\n                                HIPPY\n                Well, yeah, but the tether off it ain't gonna\n                be fancy.  When he gets down there he'll just\n                sit, like a dumb-shit.  Unless something wanders\n                through view of the camera, you'll get nada.\n\n                                LINDSEY\n                Let's go for it.  We could get lucky.\n\nINT. CONTROL MODULE                                                      139\n\nONE SURVEILLANCE MONITOR.  Lindsey and Hippy next to Big Geek.  Their voices\nare tinny but intelligible.\n\n                                HIPPY (V.O.)\n                I don't know.  I really oughta talk to Bud about\n                this.\n\nE.C.U. COFFEY.  Watching them in the dark.  Alone.\n\n                                LINDSEY (V.O.)\n                No.  Just you and me.  We get some proof, then\n                tell them.  Hippy, look... if was can prove to\n                Coffey it's not Russians, maybe he'll ease off\n                the button a little.\n\n                                HIPPY (V.O.)\n                I gotta tell you, that guy scares me a lot more\n                than whatever's down there.  A.J. Squared Away\n                goddamn jarhead robot.  Okay, gimme a couple\n                hours on this.\n\nCoffey watches, his jaw clenched.\n\nINT. QUARTERS/MESS HALL                                                 140\n\nThe lights are down.  Those who can are grabbing some sleep.  Snoring comes\nfrom one of the bunkrooms as Lindsey passes.  In the mess hall, Catfish and\nBud are crashed out on the tables, wrapped in blankets.  The cold has gotten\nintense.  Water drips.  The walls sweat with condensation.  Lindsey can see\nher breath as she makes coffee.  She carries a cup over to Monk, who is a\nface in a pile of blankets.  A hand comes out, takes the coffee.\n\n                                MONK\n                Thanks.\n\nLindsey sips hers, staring.  Her thoughts are far away... in the bottomless\npit.  She is leaning up against the table where Bud is sleeping.  His soft\nsnoring downshifts into a loud rasp.  Lindsey touches him gently on the\nshoulder.\n\n                                LINDSEY\n                Virgil, turn on your side.\n\nBud grunts and turns without waking, an automatic response.  The snoring\nstops.  It is a quiet, intimate moment, a reminder of the mileage these two\nhave logged together.\n\n                                                                CUT TO:\n\nINT. SONAR SHACK                                                        141\n\nSonny has made himself comfortable in front of the screens.  Too comfortable.\nHe's asleep, chin on his chest.  On the main passive-sonar screen, an almost\nimperceptibly faint trace appears.  A HUM, which is by now familiar, becomes\naudible.  Sonny shifts in his seat.  Doesn't wake.\n\nINT. SUB BAY                                                            142\n\nHippy puts his tools away, finished with the modifications to Big Geek.\n\n                                HIPPY\n                All set, big guy.  Hey, I told you to wipe that\n                grin off your face.\n\nHe yawns as he shambles across the chamber to the corridor door.  Switches off\nthe lights.  Goes out.\n\nQuiet lapping of water in the moonpool.  A beat.  Then...\n\nA cold luminosity suffuses the water beneath the moonpool opening, sending\nshadows shifting across the top of the chamber.  The surface begins to\npulsate.\n\nSuddenly, the water itself rises, forming itself into a shifting, shimmering\npseudopod as big around as a man's body.  The transparent form pulses... an\namoebic mass shivering in the air.\n\nIt stretches, becoming a more refined form.  Like a blindly probing glass\npython, it elongates and weaves across the room.  It extends and extends,\nstretching out from the moonpool, a shimmering tentacle.  The 'head' or tip,\na featureless liquid bulb, seems somehow to be scanning as it moves forward,\nas if it can see where it's going.\n\nINT. CORRIDOR                                                           143\n\nHippy trudges along the dark corridor.  He reaches the men's head and goes in.\nAs the door closes, the tip of the liquid pseudopod extends into the corridor\nB.G.  It 'looks' left and right.  Then extends the length of the corridor,\nholding itself a couple feet off the floor like a weightless snake.\n\nINT. TRIMODULE B/LADDERWELL/BUNKROOM/MESS HALL                          144\n\nLOOKING DOWN three levels through the central ladderwell between the\ncylinders.  The pseudopod enters and undulates upward.\n\nFROM INSIDE THE MAKESHIFT BUNKROOM, we see its tip extend inside.\n\nSonny and One Night are snoring, oblivious.  Jammer is still unconscious.  The\npseudopod, taking its time, checks them out and then moves on.\n\nIN THE MESS HALL, it's dark and quiet.  Lindsey has even fallen asleep in her\nchair, her head buried in her arms on the table.  The shimmering tentacle\nenters the room in total silence.  It sways gracefully in to air, searching.\nIt undulates across the room, hanging about five feet in the air, surveying\neverything.  It moves past Lindsey.  Sensing something, she lifts her head,\nturning... sees the apparition next to her.\n\nHer eyes go wide.  Amazement, but not fear.  The tentacle is moving on, still\nsearching.  Lindsey shakes Bud awake, clapping her hand over his mouth.\n\nBud blinks twice, then freezes.  When she lowers her hand his mouth is hanging\nopen like a total goon.\n\nBud chucks his pillow are Catfish, on the next table.\n\nCatfish cracks one eye open.  Turns away.  Turns right back... both eyes open\nnow.  Sensing movement, the thing turn back toward them.  It seems to\nrecognize Lindsey.  It doubles back on itself in a loop and comes right up to\nher.  She holds her ground, fascinated.\n\nThe bulbous tip forms suddenly into a human face... her face.  It is water,\nstill clear and undulating... but definitely Lindsey.  She gasps in surprise.\nThe liquid-Lindsey gasps soundlessly... a perfect mimic of her expression.\nLindsey laughs involuntarily.  It laughs... without sound.  Lindsey makes a\nface, sticking out her tongue... testing it.\n\nThe liquid-Lindsey does the same.  Bud has just had the rug jerked out from\nunder his sense of what is possible and what isn't, but he's taking it pretty\nwill, considering.\n\n                                BUD\n                            (whispering)\n                I think it likes you.\n\n                                LINDSEY\n                It's trying to communicate.\n\nHer liquid face suddenly transforms into a likeness of Bud's.\n\nShe reaches out her hand slowly.  Gingerly, her fingers touch the surface.\nRipples extend outward from the contact, across Bud's features.\n\nHer fingertips break effortlessly through the surface, just like she's\ndipping her hand into a bowl of water, except sideways.  She draws her wet\nfingers out and studies them, amazed.  Touches one fingertip to her tongue.\n\n                                LINDSEY\n                Seawater.\n\nThe pseudopod pulls back from her.  It loops in the air dramatically, full\ncircle... and ties itself into a knot.  As the knot tightens down, it melts\nback into the body.  The 'disappearing knot' trick.\n\nLindsey laughs, grinning with the open wonder and delight of a child at a\nmagic show.  She is transported.\n\n                                LINDSEY\n                Show off.\n\nShe looks at Bud.  He grins broadly.  He's with her now.\n\nThe stunned group watches as the thing moves on across the room.  Out to the\ncorridor\n\nINT. SUB-BAY                                                            145\n\nCoffey and Schoenick enter the back way, through the dive-prep area.  They see\nthe pseudopod arching from the moonpool big as a treetrunk.  Coffey's mind is\nblown.  We can smell the insulation burning.  He just stares.\n\nINT. CORRIDOR/MAINTENANCE ROOM B                                        146\n\nThe water tentacle enters and moves toward the hot-wired warhead.  It studies\nthe device for a few seconds.  Bud and Lindsey enter through a side door, in\ntime to see the tentacle divide into four tendrils which wrap around the\nwarhead.  They begin to lift it off its cart.\n\nINT. SUB BAY                                                            147\n\nCoffey finally jump-starts his brain.  In a flash of insight, he runs to the\nbig sliding door through which the pseudopod stretches into the corridor.  He\nand Schoenick heave on the door.  Like a guillotine blade it slices\neffortlessly through it.\n\nVARIOUS ANGLES -- CORRIDORS, MESS HALL, LADDERWELL, MAINTENANCE... as the\nbody of the pseudopod collapses, splashing on the floor.  It reverts to\nnothing more than a long puddle of simple seawater.  As the tendrils dissolve,\nthe warhead slams back down onto the cart, unharmed.  ON COFFEY'S SIDE ON THE\nDOOR, however, the \"stump\" rears back like a cobra.  It withdraws rapidly into\nthe moonpool.  The glow fades away.\n\nINT. SONAR SHACK                                                        148\n\nSonny wakes up with a start as the HUM revs up into a LOUD WHINE and then\nfades away.  He scrambles to track it.  Too late.\n\nINT. CORRIDOR                                                           149\n\nHippy emerges from the can and looks down, puzzled, at the puddle running the\nlength of the corridor.  He missed the whole thing.\n\nINT. MESS HALL                                                          150\n\nLight on.  Everybody there.  Lindsey is really strutting, high on life, now\nthat she's been proven right.\n\n                                LINDSEY\n                Okay, raise your hand if you think that was a\n                Russian water-tentacle.  Lieutenant?  No?  Well,\n                a breakthrough.\n\nCoffey is looking out from under his eyebrows like Nicholson in \"The Shining\".\nBud give her a warning look.  Don't poke at the rattler.\n\n                                BUD\n                You done impressing yourself, ace?\n\n                                ONE NIGHT\n                No way that could just be seawater.\n\n                                LINDSEY\n                They must've learned how to control water... I\n                mean at a molecular level.  They can plasticize\n                it, polymerize it... whatever.  Put it under\n                intelligent control.\n\n                                BUD\n                Maybe their whole technology is based on that.\n                Controlling water.\n\nCoffey is hunched over, elbows on his knees.  His hands are out of sight.  His\narm is moving in a slow rhythm.  We can't see what he's doing.\n\n                                HIPPY\n                That thing was probably their version of Big\n                Geek... like an ROV.\n\n                                CATFISH\n                Just checking is out, huh?  How come?\n\nANGLE UNDER THE TABLE, showing what Coffey is doing.  He has his K-BAR KNIFE\ngripped white-knuckle in one hand.  He is drawing it slowly and repeatedly\nacross the skin of the other forearm.  Neat chevrons of blood from wrist to\nelbow.\n\nC.U. COFFEY -- He doesn't flinch.  His eyes are hard and bright as diamond\ndrills.  No one notices.  He's keeping the edge.\n\n                                LINDSEY\n                They're curious, maybe.  We could be the first\n                people they've seen up close.\n\n                                SONNY\n                Hope they don't judge the whole race offa us.\n\n                                CATFISH\n                Maybe I oughta shave.\n\nCoffey stands abruptly, snags Schoenick with his eyes, and leaves, walking\nthrough the group as if they were smoke.  This cold behavior brings the mood\ndown a notch.\n\nINT. CORRIDOR/MAINTENANCE ROOM B                                        151\n\nOutside the mess hall, Coffey pauses, listening to the conversation resume.\nBright speculation, a few jokes.  Coffey is visible shaking.  Breathing hard.\nPupils dilated.  Schoenick looks at him with concern.\n\n                                COFFEY\n                It went straight for the warhead.  And they\n                think it's cute.\n\n                                SCHOENICK\n                You need to get some sleep.\n\nCoffey walks away without hearing him.  Schoenick catches up.\n\nINT. MAINTENANCE                                                        152\n\nThe door opens in the dark room.  Coffey enters, moving with purpose.  He\npulls his gear bag out from under the work table.  Unzips it.  Pulls out a\nshort-barreled CAR-15 assault rifle.\n\n                                COFFEY\n                We have no way of warning the surface.  Do you\n                know what that means?\n\nSchoenick doesn't know.  He hopes Coffey knows.  Because he's a fearless man\nwho's discovering what it is to be afraid.  Coffey inserts the magazine with\na CLACK!  Snaps the bolt.  Tosses the rifle to Schoenick.\n\n                                COFFEY\n                It means... whatever happens is up to us.\n\n                                                                CUT TO:\n\nINT. CORRIDOR/MAINTENANCE -- LATER                                      153\n\nHippy passes the maintenance room.  Looks in.  The warhead and its cart are\nmissing.  He looks around.  Heads toward the sub-bay.\n\nINT. MESS HALL                                                          154\n\nThe discussion, still in progress.\n\n                                ONE NIGHT\n                You think they're from down there originally?\n                Or from... you know.\n\nShe jerks her thumb toward the ceiling.\n\n                                LINDSEY\n                I think they're from 'you know'.  Some place\n                that has similar conditions... cold, intense\n                pressure.  No light.\n\n                                CATFISH\n                Happy as hogs in a waller down there, prob'ly.\n\nINT. CORRIDOR/SUB BAY                                                   155\n\nHippy freezes in the corridor as he hears a loud ratcheting sound echoing from\nthe sub-bay.  He edges forward slowly, trying to keep his feet silent on the\nsteel floor.  Slides up along the wall next to the door.  Inches his eye\naround the doorframe.  Across the room. Schoenick is working with a chainfall,\nlowering Big Geek onto the MIRV warhead, which is still on its cart.  He\nbegins to attach them together with a sling of tie-down straps.\n\nHippy lets his breath out slowly.  His expression is Holy Shit.\n\nHe slides back along the corridor wall, silently.  Away from the door.  Then\nturn turns quickly to go... WHAM!  Coffey slams him up against the wall!\n.45 pressed to Hippy's temple.  Hippy gulping air as Coffey ears back the\nhammer.\n\n                                COFFEY\n                Sniff something did you, rat boy?\n\nINT. MESS HALL                                                          156\n\nThe meeting is breaking up as the door CLANGS open and Hippy is thrusted\ninside.  His hands are taped behind his back and he stumbles onto his face.\nCoffey steps through smoothly, straight-arming the .45.  Schoenick flanks him\nwith the assault rifle aimed at the group.\n\n                                COFFEY\n                FREEZE!  Don't move.  That's it.\n                              (to Monk)\n                Here, hold this a second.  We're going to phase\n                three.\n\nHe hands his gun to Monk, with the assumption of absolute loyalty from a team\nmember.  Monk's eyes move between Coffey and the pistol.  We can't tell what\nhe's thinking.  Coffey grabs Hippy and shoves him onto a chair.\n\n                                HIPPY\n                They're using Big Geek to take the bomb to the\n                NTIs!  We set it up to go right to them.\n\nLindsey looks stricken.  Her plan is betraying them all.\n\n                                LINDSEY\n                Oh my God...  Oh no...\n                        (steps toward Coffey)\n                Please, you can't.  Coffey, think about what\n                you're doing... for God's sake--\n\nCoffey lets her approach him, his eyes glittering.\n\nWithout warning he grabs her by the hair and hurls her against the Coke\nmachine, pinning her there with one hand.  Bud leaps forward.\n\n                                SCHOENICK\n                GET BACK!\n\nBud freezes.  The rifle's muzzle is aimed for a heart-shot.\n\nCoffey moves up close to Lindsey.\n\n                                COFFEY\n                This is something I've wanted to do since I\n                first met you.\n\nHis hand reaches down, OUT OF FRAME.  We hear something RIP.  His hand comes\nback up... holding a piece of gaffer's tape.\n\nHe slaps it over her mouth.  Then pushes her down into a chair.\n\nHippy looks at Monk and Schoenick.\n\n                                HIPPY\n                You boss is having a full-on meltdown.  Guy's\n                fixing to pull the pin on fifty kilotons and\n                we're all ringside!\n\n                                MONK\n                What's the timer set for?\n\n                                SCHOENICK\n                Three hours.\n\n                                COFFEY\n                Shut up!  Don't talk!\n\n                                MONK\n                We can't get to minimum-safe-distance in three\n                hours.  The shockwave will kill us.  It'll crush\n                this rig like a semi driving over a beer can.\n\n                                COFFEY\n                Shut up!  SHUT UP!  What's the matter with you?!\n\nEverybody is twitching a hyper.  Schoenick is white-knuckling his assault\nrifle... looking from Monk to Coffey to the group.\n\n                                COFFEY\n                Just stay calm.  The situation is under control.\n\nCoffey backs out quickly with Schoenick.\n\nINT. CORRIDOR                                                           157\n\nCoffey dogs down the watertight door and wedges a piece of steel pipe into\nthe mechanism so it can't be opened.\n\n                                COFFEY\n                Stay here.\n\nSchoenick take a position in front of the door.  Coffey turns and runs through\nthe corridor like demons are chasing him.\n\nINT. MESS HALL                                                          158\n\nTheir only hope is to sway Schoenick.  But the SEAL's fear is making him the\nperfect machine, totally dependent on external orders.  And his orders are\nclear.  They can see him through the tiny window in the door.  Lindsey rips\nthe tape painfully off her mouth.\n\n                                LINDSEY\n                Schoenick... your Lieutenant is about to make\n                a real bad career move...\n\n                                HIPPY\n                That guy's crazier'n a shithouse rat!\n\n                                BUD\n                We have to stop him!  Schoenick!!\n\nThey pound on the door.  Schoenick turns and hangs his cap over the tiny\nwindow.\n\nINT. SUB BAY                                                            159\n\nUsing the chainfall, Coffey maneuvers the completed Geek/MIRV package over\nthe back of Flatbed, obviously preparing to use the submersible to take it\nout and launch it.\n\nINT. MESS HALL                                                          160\n\nLindsey is up next to the door, with Bud.\n\n                                LINDSEY\n              ... he's about to declare war on an alien species,\n                Schoenick, just when they're trying to make\n                contact with us.\n                                (to Bud)\n                I think I'm reaching him.\n\nThere is a CLUNK-CLATTER and the door unlatches.\n\n                                LINDSEY\n                See?\n\nThe door opens.  Jammer is standing there.  Schoenick is in a heap against\nthe far wall, moaning.  Jammer hands the rifle to Hippy as he walks in.  Hippy\nturns to cover the other SEAL.  Monk puts his hands up, passively.\n\n                                MONK\n                I'm the least of your problems.\n\nBud appraises Jammer, who seems a little weak and dazed but basically okay.\n\n                                BUD\n                Thanks.  How you feeling, big guy?\n\n                                JAMMER\n                Figured I was dead, there, when I seen that\n                angel comin' toward me.\n\nThey all look at him for a second.  What?\n\n                                BUD\n                Uh, okay, right.  You can tell us about it\n                later.  Let's go.\n\n                                                                CUT TO:\n\nINT. TRIMODULE C/LADDERWELL                                             161\n\nBud drops down the ladder, INTO FRAME, followed by the others.  He tries the\ndoor into the main corridor.  The wheel won't turn.  The others get on it.\nWon't budge.\n\n                                BUD\n                He's jammed the mechanism.\n\n                                LINDSEY\n                Now what?\n\nThey're locked in trimodule-C.  No other doors give access to the sub-bay\ncorridor.  Bud's mind is racing.  He drops down the ladder to Level One, into\nabout two feet of water.  He reaches down and open the emergency lockout\nhatch.  Takes off his boots.\n\n                                BUD\n                Okay, I'm gonna free-swim to hatch six... get\n                inside, get the door open from the other side.\n\n                                LINDSEY\n                Bud, that water's only a couple degrees above\n                freezing.\n\n                                BUD\n                Then I guess you better wish me luck, huh?\n\nCatfish is pulling his boots off as well.\n\n                                CATFISH\n                Wish us luck.\n                       (hands his wallet to Hippy)\n                'Case I don't die.  Okay, Bud... let's go,\n                podner, I ain't got all day.\n\nBud clasps him on the shoulder and starts hyperventilating.  He drops into\nthe water.\n\nEXT. DEEPCORE/TRIMODULE C                                               162\n\nBed shoots down through the hatch.  The cold hits him list a fist, becoming\ninstantly paralyzing.  He starts kicking in powerful strokes through the dark\nwater, maneuvering around tangles of umbilical cable twisted tubular steel.\nCatfish is behind him, swimming like hell.  They reach hatch six.  Together\nthey spin the wheel and heave upward, opening it.\n\nINT.  TRIMODULE D/LEVEL ONE                                             163\n\nBud surges up into the lock.  Catfish jams into the tiny airspace with him.\nThey try the upper hatch.  Jammed.  They're both panting with the exertion\nand intense cold.\n\n                                BUD\n                Hafta... go on to... the moonpool.  Only way.\n\n                                CATFISH\n                I can't... make it... podner.\n\nBud looks at Catfish, shivering and heaving, wide-eyed.\n\n                                BUD\n                Okay, Cat.  You head back.\n\nBud hyperventilates rapidly and pikes over diving back out through the hatch.\n\nEXT. DEEPCORE                                                           164\n\nBud is stroking rapidly through the tangle of pipes and conduit.  He sees the\nlit rectangle of the moonpool far ahead.\n\nINT. SUB BAY                                                            165\n\nIn the moonpool, Bud surface with an explosive gasp beside the full of\nFlatbed.  His wracked breathing is masked by the WHINE of HYDRAULICS as Coffey\nuses the external controls to extend Flatbed's big hydraulic arm, locking\nthe Geek/MIRV in its gripper.\n\nBud strokes to a point where Coffey can't see him and heaves up out of the\nwater onto the deck of the pool.  He lies gasping behind Cab One's cradle.\nHis limbs are wooden and unresponsive from the cold.  His fingers are\ncompletely numb.  He hugs himself, putting his hands under his armpits.\nScans the situation.  He can't get to the door, which is across the room,\nwithout Coffey seeing him.\n\nINT. CONTROL MODULE                                                     166\n\nLindsey watching the whole thing going down, ON THE SCREEN, a high angle of\nthe sub bay... Bud moving up on Coffey.\n\n                                HIPPY\n                He can't get to the door... I think he's going\n                to try and take him himself.\n\n                                LINDSEY\n                He couldn't be that dumb.  The guy's a trained\n                killer.  Bud's idea of a fight is arm-wrestling\n                One Night over laundry duty.\n\nON THE SCREEN, Bud picks up a piece of pipe.  Hefts it.  Moves forward,\ncrouched... stalking.  Lindsey yells at the screen in frustration.\n\n                                LINDSEY\n                BUUUUUD!!\n\nINT. SUB BAY                                                            167\n\nBud chucks a tool across the chamber, creating a clattering distraction, then\nwades in with the pipe in a vicious swing to the back of Coffey's knees,\ntaking him down.  Coffey spins even as he falls, catching Bud in a scissor\nkick that topples him.\n\nGrappling, they fall together into the freezing water.\n\nCoffey is momentarily stunned by the cold, giving Bud time to haul himself\nout, hoping to make it to the door.\n\nCoffey launches from the water and grabs him legs.\n\nHe pulls himself up as Bud kick out.  Claws his way viciously over Bud's\nbody until he has him pinned to the deck.  Then he pulls out the .45.\n\nPut it unceremoniously to Bud's forehead.\n\nINT. CONTROL MODULE                                                     168\n\n                                LINDSEY\n                NOOO!!\n\nINT. SUB BAY                                                            169\n\nCoffey pulls the trigger... CLICK.  Bud flinches, then opens his eyes,\nstaring cross-eyed at the muzzle of the .45.  Coffey cocks it and tries\nagain.  CLICK.  Nothing.  Really pissed off beyond description, Bud hurls\nthe commando off him with a powerful heave, sending him clattering against\na rack of equipment.  They face off, panting.\n\nINT. CONTROL MODULE                                                     170\n\nThe rig crew turns from the screen at the sound of Monk's voice.\n\n                                MONK\n                I tool the liberty of removing this before I\n                gave it back to him.\n\nMonk pulls his hand out from under his blanket and holds up the magazine from\nthe .45.\n\nINT. SUB WAY                                                            171\n\nEven so Bud is getting his ass kicked.  Coffey's really trying to put him out\nof business.  It's mostly duck and dodges on Bud's part.  Throw a few things.\nWhen Coffey connects, Bud goes down hard.  Give him credit, though.  He\nmanages to scramble back up.\n\nThe fight wrecks the room, scattering tools and gear.\n\nCompressed air cylinders roll dangerously around the floor.\n\nCoffey slips on one and Buds get in a couple of good licks.\n\nSlams the SEAL's head in an equipment locker door.\n\nBut the Navy man is just too massive.  Bud is hammered back into a wall.\nCoffey has his fist cocked back for the coup de grace.  Spins around at the\nsound of a VOICE.\n\n                                CATFISH\n                Hey!\n\nCatfish is right behind him.  Dripping wet.  A trail of water goes back to\nthe moonpool a few feet away.\n\nCRACK!  Catfish's 'Hammer' punch comes in so hard and so fast, Coffey is\nknocked right on his ass.  He doesn't get up.  Just sort of flops around.\n\nCatfish helps Bud to his feet.  They advance on Coffey, who crab-scuttles\nsideways, his eyes rabid.\n\nHe picks up a helium tank and hurls it at them.  As they duck he sprints to\nFlatbed and drops through the hatch and slams it down.\n\n                                BUD\n                           (to Catfish)\n                Get the door!\n\nBud leaps across the water to land on Flatbed.  The hatch is already sealed.\nHe grapples with Geek/MIRV, trying to free it from the steel claw.\n\nINT. FLATBED                                                            172\n\nCoffey crawls along the access tunnel to the pilot's compartment.  He claws\nhis way into the control seat and starts rapidly flipping switches.\n\nINT. CORRIDOR                                                           173\n\nCatfish pounds down the corridor like he's never run before, his beer gut\ndoing a rumba.  He reaches the door, tears out the piece of pipe and spins\nthe wheel.  Hippy pushes it open so fast it hits Catfish in the stomach.\nHippy tears past him, running with the assault rifle.  John Wayne.\n\nINT. SUB-BAY                                                            174\n\nFlatbed is submerging, with only the hatch tower still above the water.  Bud\nis being dragged down, still trying to free the ROV.  He gives up when he\nsees Hippy run in, waving the assault rifle around like a 130-pound Rambo.\n\nBud climbs the hatch tower and leaps to the deck of the moonpool.\n\nHippy clumsily raises the unfamiliar rifle at Coffey, visible inside his\nviewing bubble beneath the swirling water.  Coffey looks up, stares at the\ngun... doesn't seem to care.\n\n                                CATFISH\n                SHOOT!\n\nHippy's squeezing the trigger and nothing's happening.  Flatbed's hatch tower\ngoes under.\n\n                                CATFISH\n                Safety's on!  On the side... the lever!  Up,\n                push it up!\n\nHippy fumble with the selective-fire lever, BLAM-BLAM-BLAM!  He put three\nquick rounds into the ceiling.\n\n                                HIPPY\n                SHIT!\n\n                                CATFISH\n                Give me that!!\n\nHe grabs it out of Hippy's hands and aims it at the sub.  He racks the water\nwith a long burst.  BENEATH THE SURFACE, the rounds nip nasty contrails\nthrough the water.  They barely scar the front port.\n\n                                LINDSEY\n                Forget that... go for Big Geek!\n\nCatfish rakes the descending sub with more bursts, trying to hit the\nshimmering shape of the ROV on its back.  UNDERWATER we see the rounds\narcing wild, a few hitting the ROV but causing little damage.\n\nCoffey complete his descent to just above the seafloor.  ABOVE, Catfish\nempties the weapon.\n\n                                BUD\n                Gimme a hand!\n\nThey all turn.  Bud is fumbling into his wetsuit like a madman.  The others\nrush over to help him.\n\n                                BUD\n                Get the rest of my gear.  Grab that hat there...\n                let's go guys!  Come on, come on!\n\nCatfish slams a backpack onto Bud's shoulders, grappling with the straps and\nhose connections.  Hippy and Sonny (with one hand) are clipping, zipping and\nbuckling all over him.  This is a world-record suit-up time.  Bud pulls the\nrubber neck-dam of the helmet's lower ring down over his face.\n\n                                BUD\n                Helmet... helmet!  Work fast.\n\nEXT. DEEPCORE UNDERSTRUCTURE                                            175\n\nBeneath the habitat, Coffey is maneuvering Flatbed through the twisted pipe\nand debris left by Deepcore's slide to the edge.  Bloodied, his fatigues\nripped half-off, he looks like a feral animal.  His eyes burn with the\ndetermination of his mission.\n\nINT. SUB BAY                                                            176\n\nJammer expertly works the crane controls, moving Cab One out over the\nmoonpool from its drydock cradle.  Lindsey and One Night are scrambling like\nmonkeys over the port side crash bars of the swinging sub, clambering up to\nthe hatch tower.\n\n                                ONE NIGHT\n                I'll unhook.\n                           (Lindsey hesitates)\n                GO!  You're better in these than I am.\n\nLindsey recognizes this for what it is... a sign of respect, a\nreconciliation.  She nods and drops through the hatch.\n\nEXT. DEEPCORE                                                           177\n\nCoffey passes under the twisted wreckage of the big automated derrick and makes\na tight turn beneath the drill-floor module.  Flatbed scrapes through between\ntwisted conduit, metal screeching on metal.\n\nINT. SUB BAY                                                            178\n\nBud has his 'hat' locked down and his air cut on.  He take two quick strides\nto the edge of the pool and just drops in.\n\nEXT. DEEPCORE                                                           179\n\nBud rockets DOWN INTO FRAME in a column of bubbles.  He looks around.  Through\nthe lattice of conduit under the rig he can see Flatbed moving forward from\nits exit point under the stern.  Bud see a shortcut under the platform.\n\nHe kicks along a lattice a pipes, heaving himself along in frantic hand-over-\nhand stokes.  He reaches for Flatbed's stern as it passes.\n\nMisses the last hand-hold... but just manages to seize a tie-down trailing\nbehind it.  He is jerked along behind the sub.\n\nBud holds on with both hands as he is buffeted in the wake of the powerful\nthrusters.  Flatbed gathers speed, moving out toward the edge of the abyssal\nwall.  The current slams him, spinning him like a fishing lure.  He pulls\nhimself forward slowly until he can grip the stern rail of Flatbed's platform.\n\nLOW ANGLE, look up the wall.  Flatbed appears over the edge and stops.\nHovering.\n\nON THE BACK OF FLATBED.  Bud has the break he needs.  He scrambles up onto the\ndeck and opens and equipment locker.  Nothing in it but one of the yellow\nnylon safety lines.  The big arm begins to unfold, lifting Geek/ROV.\n\nINT./EXT. FLATBED                                                       180\n\nCoffey works intently.  His eyes are the cool ice of lethal madness in a\nface streaked with blood.  He brings the ROV into view with the boom arm.\n\nGEEK/ROV had a passenger.  Brigman.  The diver is holding Geek's skid with\none hand, doing something with the other.  He turns to look at Coffey.\n\nEXT. FLATBED/DEEPCORE                                                   181\n\nCoffey releases the ROV with the gripper and makes a grab at Bud with the\nsteel claw.  Bud dives.  The gripper hits his helmet a glancing blow.  Bud\nkicks away rapidly, letting nylon rope pay out.  We see he has managed to tie\none end to Geek's skids.  Coffey hits the button to activate the ROV, sending\nan acoustic pulse to Geek's transponder.  The little robot, pregnant with its\nload of death, turns nimbly around and dives out and down toward the void.\n\nCoffey pivots his bid machine toward Bud.  Bud strokes rapidly to a large\njumble of wreckage.  He loops the rope around a twisted pipe.  Big Geek is\nhauling ass away from him.  The line snap taut an instant later.  The ROV\nstrains, like a Rottweiler on a leash... trying to go.  The rope is slipping\nas Bud fights to make a knot.\n\nFlatbed slews around, thrusters whining.  As it banks, it hurls up clouds of\nsediment from the escarpment face.\n\nThrough the front panel we see Coffey jerking on the controls.\n\nThe big arm extends menacingly.  The smaller from manipulators open.  An\nenormous predatory instinct, its lights blaring.\n\nThe big machine roars forward.  Straight at Bud.\n\nBud gets his knot partly done.  See Flatbed looming.\n\nGlare-lit in its lights, Bud grabs a handlehold and pulls himself downward as\nCoffey closes the last few feet.\n\nOne manipulator slams into his backpack, tumbling him, and the sub's underside\nrakes across his legs as it passes over.  Flatbed crushes into the tangle of\npipework.  K-CRUUUNCH!!\n\nINT. FLATBED                                                            182\n\nCoffey is slammed hard over the controls, up into the front dome port.  He\ngets back in the seat.  Strains to free his machine.\n\nEXT. DEEPCORE/BIG GEEK/FLATBED                                          183\n\nBud swims clear, diving down at an angle along the wall, hoping to stay in\nCoffey's blind area.  Flatbed backs out of the wreckage in a cloud of debris.\nIt pivots toward Bud.  Moves after him.\n\nNearby, the ROV is whining mindlessly, trying to please.  Trying to GO.\nDETAIL OF ROPE attached to wreckage, as Bud's knot begins to slip.  The nylon\nline starts to play through the knot slowly.\n\nBUD has gotten himself into a bad position.  Along the bare rock face of the\ncliff wall he is naked, nailed in the spotlights like a rabbit in front of a\ntruck.  Coffey puts the hammer down, thrust levers all the way forward.\nFlatbed surges forward, multi-limbed and demonic.  There's no cover, side to\nside, up or down.\n\nCoffey has him head in his lights.  Suddenly a bright glare blasts in,\nblinding Coffey.  He looks up to see Cab One rushing down upon him, full\nthrottle.\n\nAt the last moment LIndsey slams the thrusters full-lock and the submersible\nslews sideways, slamming its heavy skidplate into Flatbed's cab.  Coffey is\nsmashed sideways by the shock.  He fights to control his vehicle.  Lindsey\nlooks up to see Coffey's sub gun it up over the wall, out of sight.  She\ncruises up over Bud.\n\n                                LINDSEY (V.O.)\n                Get in!\n\nBud gets the lockout hatch open and clambers up into Cab One's belly.\n\nINT./EXT. CAB ONE                                                       184\n\nBud flops over the lip of the hatch and slams it shut.  He ditches his helmet.\nLindsey raises her vehicle warily above the wall.  Through the front port\nthere is not sign of Coffey.\n\n                                LINDSEY\n                You owe me one, Virgil.\n\n                                BUD\n                Can we negotiate later?  There's Big Geek.\n\nHe points.  Through the front port, they can see the ROV still straining at\nits leash.  Lindsey dives toward it, simultaneously working the controls to\nopen her own small manipulator claws.\n\nEXT. DEEPCORE/WALL, ETC.                                                185\n\nThe last few feet of the rope slip through the knot.\n\nBig Geek happily surges forward.  It dives gracefully down into the void,\ntrailing the yellow rope like a kite tail.\n\nONE CAB ONE, Bud and Lindsey through the front port.\n\n                                BUD\n                Go after it!  We gotta catch it!\n\nFLATBED DROPS INTO FRAME BEHIND THEM, dwarfing little Cab One.  They are\nslammed viciously as Coffey's submersible hammers into them.  She hits full\nthrottle.  Coffey floors it after Lindsey, ramming her from behind with his\nmore powerful vehicle.  With difficulty Lindsey maintains trim.\n\nShe arcs back toward the rig.  Flatbed slams her again, for the side.  She\nfights for control.\n\nINT./EXT. CAB ONE                                                       186\n\nBud is tossed around, ricocheting off the walls.  Lindsey flies with her\njaw set.  Fighting hard for control.  The A-frame of the rig looms before her.\nShe shoots through at full throttle.\n\nEXT. DEEPCORE AND OCEAN TERRAIN                                         187\n\nNow the fight is really on.  The two subs are dodging between the cylindrical\nmodules at full throttle, slamming into each other and the steel pressure\nhulls.\n\nCoffey sideswipes the smaller sub, jamming it sideways.  It screeches along\nthe flank of one of the trimodules.\n\nThey head out over empty terrain in a flat-out speed run.\n\nLindsey is jinking and dodging as Flatbed, roars along behind her, tearing\nup the bottom with its powerful backwash.  Lindsey carves hard around a rock\npinnacle, finding herself running parallel to the edge of the abyssal canyon.\nCoffey is ramming, hammering from behind, then from side to side.\n\nLindsey snarls.  He's pissing her off.  He shouldn't do that.\n\nAhead, out of the blackness, another outcropping.\n\nLindsey rises, cuts right.\n\nSmashes down into Coffey's craft.  Timing it just right.  He skids catch in\nthe rocks.\n\nFlatbed slews violently, nosing down.  Crushing into the rocky bottom.\nPressing the advantage, Lindsey hammers into Flatbed from behind.\n\nIt smashes full force into a second spire, spinning out of control.\n\nTangles together, the subs slide down an embankment toward the edge of the\nwall.  With her one remaining thruster she jerks clear of Flatbed and grounds\nher crippled sub.  Flatbed tumbles over the edge.\n\nANGLE DOWN THE WALL as it falls, trailing a cloud of sediment like a comet's\ntail, down into the unfathomable blackness below.\n\nINT. FLATBED                                                            188\n\nInside the machine, Coffey is fighting for control.\n\nHe has no buoyancy or motors and the craft continues its mad plunge.  As the\npressure intensifies the hull begins to groan, and steel fitting scream with\nthe enormous load.\n\nA tiny silver fracture shoots partway across the front bubble.  Grows.\nCoffey gives up fighting.  Just stares, wide eyed, at his death.  A damned\nsoul dropping into the bottomless pit.\n\nThe fracture line arcs rapidly across the dome port.\n\nSuddenly, a scythe-like curtain of seawater, under tons of pressure, slashes\ninto him.  A moment later the bubble implodes, and Coffey disappears in a\nbloody froth of churning water, air and glass shards.\n\nEXT. CANYON WALL                                                        189\n\nFlatbed looks like a toy, tumbling away down the wall.\n\nSoon its lights vanish.\n\nINT. CAB ONE                                                            190\n\nThey're both going to have a lot of bruises...\n\nLindsey is surveying the damage.  Water is spraying down on them like a\nshower, and lights are flickering.\n\n                                LINDSEY\n                You did okay, back there.  I was fairly\n                impressed.\n\n                                BUD\n                Not good enough.  We still gotta catch Big Geek.\n\n                                LINDSEY\n                Not in this thing.\n\nLindsey is flipping switches.  Nothing works.\n\n                                BUD\n                You totaled it, huh?\n\n                                LINDSEY\n                Yeah.  So sue me.\n\nBud looks down.  There's already about a foot of water sloshing around the\nfloor at their feet.\n\n                                BUD\n                It's flooding like a son of the bitch.\n\n                                LINDSEY\n                You noticed.\n\nShe picks up and hand-mike of the underwater telephone.\n\n                                LINDSEY\n                Deepcore, Deepcore, this is Cab One, over.\n\nShe waits.  No response.\n\n                                BUD\n                Try again.\n\n                                LINDSEY\n                Deepcore, this is Cab One.  We need assistance,\n                over.  Deepcore, this--\n\nWith a SEARING CRACKLE or arc-light, a power panel shorts out and everything\ngoes black.\n\n                                LINDSEY\n                Well, that's that.\n\n                                BUD\n                Wonderful.\n                          (looking around)\n                There's some light from somewhere...\n\nA faint illumination, dimmer than moonlight, washes in through the front port.\nLindsey scrunches up against the acrylic and scans the darkness.\n\n                                LINDSEY\n                Over there.  It's the rig.\n\nA glow, beyond a rock promontory... like the lights of a town just over the\nhill in the desert.\n\n                                BUD\n                Good hundred yards, I'd say.\n\n                                LINDSEY\n                They'll come out after us.\n\n                                BUD\n                Yeah, but it's gonna take them a while to find\n                us.  We better get this flooding stopped.\n\nHe picks up his helmet and clicks on the light.  Using the thing like a bulky\nflashlight.  The water is really pouring in, spraying them like a shower...\nalmost two feet deep already.\n\n                                LINDSEY\n                You see where it's coming in?\n\n                                BUD\n                Somewhere behind this panel.  Hold this.\n\nShe takes the light and he tries to reach the burst weld, which is blocked by\na steel switch panel and a bunch of conduit.\n\n                                BUD\n                Can't get to it.  Have to pull this panel off.\n                You go any tools?\n\n                                LINDSEY\n                I don't know, look around.\n\nBud scans the cramped interior, feels around under the water.  It's past his\nknees.\n\n                                BUD\n                Nothing.  Son of a bitch.  All I need's a goddamn\n                crescent wrench.\n\nHe grabs the panel in both hands and starts torquing on it, trying to wrench\nit off the wall.  Heaves on it repeatedly.  Finally stops, panting.  He's\nbreathing hard now, and it's not just effort.\n\n                                BUD\n                Son of a bitch!\n\n                                LINDSEY\n                Calm down, Bud.\n\nA nervous edge in her voice now.  Bud's turning all around, looking around\nfor anything, trying to think fast.  Water up to their waists.  The sea\nclosing in.\n\n                                BUD\n                Okay... okay.  We gotta get you out of here.\n\n                                LINDSEY\n                How?\n\n                                BUD\n                I don't know how!\n\n                                LINDSEY\n                We've only got one suit.\n\n                                BUD\n                I know!  I know!  But we better come up with\n                something.\n\n                                LINDSEY\n                Aaargh!!  I'm freezing!\n\nShe climbs up on the pilots seat, scrunching right up against the ceiling,\nkeeping as much of herself as possible out of the frigid water.  She's\nshaking all over with the cold, and getting drenched from above by water\npouring in.\n\n                                LINDSEY\n                Okay, look, you swim to the rig and come back\n                with another suit.\n\n                                BUD\n                Seven, eight minute swim each way... not enough\n                time.  Look at this...\n                       (the rate of flooding)\n                Time I get back you'll be--\n\nThat stops the conversation for a second.  About two feet of airspace left.\nBud can't believe what this is coming down to.  They both stare at each other\nfor a long moment.\n\nHe makes a decision.  Starts pulling off his backpack.\n\n                                BUD\n                Alright, put this on.\n\n                                LINDSEY\n                What, you growing gills all of a sudden?  You\n                got it on, keep it on.\n\n                                BUD\n                Don't argue, goddamnit, just--\n\n                                LINDSEY\n                No way!  Forget it.  Not an option.\n\nBud has his pack off uncoupling it.  She keeps fighting his hands, stopping\nhim, hooking it back up.  The desperation of the situation fuel the struggle.\n\n                                BUD\n                Lindsey, just put the thing on and shut up--\n\n                                LINDSEY\n                NO!!  Now be logical, Bud, you're--\n\n                                BUD\n                FUCK LOGIC!!\n\nThey're both right up against the ceiling, water up to their chests.\nLindsey's lips are blue and trembling from the cold.\n\n                                LINDSEY\n                Listen... will you listen to me for a second!?\n                You're for the suit on and you're a better\n                swimmer than me.  Right?  So I got a plan...\n\n                                BUD\n                What's the plan?\n\n                                LINDSEY\n                I drown, you tow me back to the rig--\n\n                                BUD\n                WHAT KIND OF PLAN IS THAT!??\n\nLindsey's gut-scared... shaking violently, her eyes wide.  But she's keeping\nit together.  Thinking it out.  Bud see the bottomless pit opening to take her\nand he can barely think.\n\n                                LINDSEY\n                Look, this water is only a couple degrees above\n                freezing.  I drown.  I go into deep hypothermia...\n                my blood like icewater.  I can maybe be revived\n                after ten, fifteen minutes.  You got all the\n                stuff to do it on the rig.\n\nBud stops moving and looks into her face, inches from him.  The water is up\nto their necks.  He knows that, as always, infuriatingly, Lindsey is right.\n\n                                BUD\n                It is insane.\n\n                                LINDSEY\n                It's the only way, Bud.  Now trust me.\n\nShe takes a deep breath.  Before her nerve fails she busies her hands on his\nsuit, rehooking everything.\n\n                                BUD\n                Jesus, I don't believe this is happening.\n\nShe raise his helmet.  Water up to their chins.  They lock eyes, inches\napart.  He can feel her breath on his face... maybe for the last time.\n\n                                BUD\n                Oh God, Lins... I--\n\n                                LINDSEY\n                Tell me later.\n\nHe grabs her head in both hands and pulls her mouth to his.  They lock\ntogether in a fierce kiss, fueled by passion and terror... the naked\nrealization of love hanging over the abyss of death.\n\nShe breaks away at the last possible second and quickly pulls his helmet\nover his head.  Seats is down over the neck ring.  Lock the bail-out handle,\nsealing it.  Even with her head press up into the highest point of the\nceiling, Lindsey's mouth is barely above water.  She give a scared little\nlaugh.\n\n                                LINDSEY\n                This is maybe not such a great plan, is it?\n\nShe is half-paralyzed with the cold, shaking pathetically.  Puts her face to\nthe glass of his helmet.  Seconds to go.\n\n                                LINDSEY\n                Hold me.  Hold me, Bud... I'm so scared...\n\nHe can't hear her, but he read her lips.  They clutch each other desperately.\nThe embrace last while the water rises over her mouth and nose.  She starts\nto choke.  Her hands grip his shoulders like claws.  She bucks and thrashes.\nBud holds her, and a scream tears loose from him, a pure agony of the soul.\n\n                                BUD\n                NOOOOO!!!\n\nThe freezing seawater races into her lungs.  Her finger go slack, and her\nhands float lifelessly.\n\nBud stares, transfixed, as the last tiny bubble trickles out of Lindsey's open\nmouth.  He kicks himself into gear, fingers frenzied as he spins the wheel of\nthe lockout hatch.\n\n                                                                CUT TO:\n\nINT. DEEPCORE/COMMAND MODULE                                            191\n\nTIGHT ON VIDEO SCREEN, one of the outside cameras.  A ghostly figure swims out\nof the darkness, towing something.\n\n                                ONE NIGHT\n                It's Bud.  Oh my God... that's Lindsey!\n\n                                BUD (V.O./faint)\n                Deepcore, Deepcore, do you read?\n\n                                HIPPY\n                Read you, Bud.  We're here.\n\nEXT. DEEPCORE                                                           192\n\nBud swims with long, powerful kicks, towing Lindsey.  Her arms and legs float\nas gracefully as seaweed waving in a gentle current.  Bud's voice comes in\nshort rasps, breathing hard, but icy with control.\n\n                                BUD\n                Go to the infirmary... get the cart .. oxygen...\n                de-fib kit... adrenaline in a... ten cc\n                syringe... and some... heating blankets.\n                You got all that?\n\n                                HIPPY (V.O.)\n                Got it. Over.\n\n                                BUD\n                Meet me in the moonpool.  Move fast.\n\nINT. INFIRMARY                                                          193\n\nThe door crashes open and Jammer thunders in.  He picks up the CPR cart, meant\nto roll on wheels, and carries it out past Hippy, Catfish, and One Night, who\nare crowding in to get the rest of the equipment.  They ransack the place in\nabout ten seconds, grabbing everything they might need and half of everything\nelse.\n\nEXT. DEEPCORE/UNDER THE MOONPOOL                                        194\n\nBud moves up toward the rectangle of light, towing Lindsey to the diving\nplatform.  Through the surface we can see the others arrive at the edge,\nlooking down.\n\nINT. SUB-BAY                                                            195\n\nHippy and Catfish are setting up the cart and the oxygen kit, dropping things,\nmaking mistakes.  One Night is teaching herself how to fill a syringe from a\nbottle of adrenaline.\n\n                                SONNY\n                Here he comes!\n\nJammer and Sonny leap into the freezing water, waist deep on the submerged\ndiving platform.  Bud bursts to the surface.  Together they haul Lindsey\nacross the platform, out of the water, and onto the deck.  Her skin is blue-\nwhite, her chest still.\n\nBud rips his helmet off in a near-frenzy, like a man possessed, a man with a\nmission.  The others are galvanized by his energy even though they all see\nLindsey as dead, a corpse... cold and inert.  Water flows from her mouth and\nnose and her lips are blue, her limbs completely limp.  Hippy peels back one\neyelid, to find the pupil fixed and dilated.\n\nBut when Bud shouts for them to move, they move.\n\n                                BUD\n                Turn her over!\n\nThey flip his wife's body over.  He straddles her, pushing down with both\nhands in the middle of her back.  Seawater gushes from her slack lips.  He\ndoes it again until the flow stops, then flips her onto her back.\n\n                                BUD\n                Come on, hurry!  Gimme the de-fib...\n\nOne Night and Catfish are fumbling with the emergency cart equipment.  They've\nall been trained in CPR and use of the gear but that was years ago, and is a\nfriend they're working on.  They're all thumbs.  Catfish drops the electrodes,\npicks them up quickly, hands them to Bud...\n\n                                CATFISH\n                Here, here, here... no, you got to have bare\n                skin, or it won't...\n\nBud rips into her clothing, opening her jumpsuit, literally tearing away her\nT-shirt, revealing her bare chest... bony and still.\n\n                                BUD\n                Jesus.  Gimme those, come on.  Catfish, move it,\n                man!  Come on... come on!\n\nHe slaps the things into Lindsey's bare skin, one on the sternum and one on\nthe side of the rib cage.\n\n                                BUD\n                Is that it?  Is this right?\n\n                                HIPPY\n                Yeah!  I mean, I don't know... it looks right.\n\n                                BUD\n                All right.  Do it!\n\nOne Night hits the switch and Lindsey's body convulses.  It is a pure muscle\nreflex, and when it is over, there is not a hint of life.  Hippy pushes him\nback and puts a black rubber oxygen mask over her mouth.  He opens the valve\non the cylinder and starts pumping the squeeze bag.  They start packing\nelectronic blankets around her to fight the intense hypothermia\n\n                                BUD\n                Do it again, One Night.  Zap her again!\n\nThe current hits Lindsey again and her back arches.  Bud doesn't wait for a\nresult... he's in his own reality now, driven.  He's doing it all at once,\nsomehow, in a senseless frenzy... pumping on her chest with his hands,\nsqueezing the oxygen bag, placing the electrodes.\n\n                                BUD\n                Aw.  Christ... come on, baby.  Again!  Do it\n                again!\n\nLindsey's back arches.  Her body relaxes, inert.\n\n                                BUD\n                Come on, One Night... what are you waiting for?\n\nA hush seems to have fallen over the group.  They know instinctively that it's\nover.  But Bud can't accept it.  He looks at them, beseechingly, like they\nare somehow intentionally holding out on him.  One Night starts to cry,\nquietly.\n\n                                CATFISH\n                                (gently)\n                Bud, it's over, man.  It's over.\n\nThere is a beat of silence.  Bud stares down into Lindsey's half-open,\nmotionless eyes.\n\nTIGHT ON LINDSEY'S EYES, moving in until the pupil FILLS FRAME, a black void.\n\nREVERSE, HER POV.  SILENCE.  A distant, distorted image, we see Bud, One\nNight, Jammer, Hippy, Catfish, staring down.  It is like the circular top of\na dark well, their faces shimmering as if through the surface of water.  It is\nas if we are in a well, descending, looking up at a circle of faces growing\nsmaller as we drop away... smaller and smaller, receding until it becomes\na point of light in the void, like the fading bright dot at the center of a\nturned-off TV.\n\nTIGHT ON BUD, rigid, staring.  Catfish puts his hand gently on Bud's shoulder.\nSuddenly Bud tears Catfish's hand away and sets upon Lindsey like a madman,\nrenewing his efforts in spades... totally manic.\n\n                                BUD\n                No!  NO!  She's not... her heart is strong,\n                she wants to live... can't you see that?  Come\n                on, Lins.  Come on, baby!  Zap her again!  Do\n                it... DO IT!\n\nThey do.  And Bud works, feverishly.  He lock his lips over hers and starts\nmouth-to-mouth.  It is frantic, passionate... the kiss of life.\n\n                                BUD\n                Come on, breath!  Goddamn it, you bitch, you\n                never backed down from anything in life... now\n                fight!\n\nHe slaps her face, hard.  Her head lolls.  He smacks her the other way.\n\n                                BUD\n                Fight, Goddamnit!\n\nLINDSEY's POV, from the bottom of the great well.  The circles of faces and\nlight rockets toward us in the blackness, as we soar upward from the pit.  We\nsee Bud yelling, but his voice is distant, windlike.\n\n                                BUD\n                FIGHT!!\n\nTIGHT ON LINDSEY, still.  Then something incredible happens.  Something they\nwill never forget as long as they live.  Lindsey coughs once, weakly, and her\nhands clench in a spasm.\n\nBud see it and his expression becomes beatific.\n\n                                BUD\n                Come on, Lins.  You can do it... fight your\n                way back, baby...\n\nThe others look on in wonder as Bud wills this woman back.\n\nShe starts to cough, weakly at first... then more violently as she draws air\ninto her lungs.  Bud crouches over her, rubbing her limbs... trying to re-\nestablish circulation.  It is like a difficult birth.  Lindsey comes hacking\nand howling back into the world, wet and naked and fighting for breath.\n\nBud puts the oxygen mask over her face and she draws breath after agonized\nbreath.  He pushes her wet hair back from her face with his trembling hands,\nand watches her breathe.  Color is returning to her skin as she lies there,\ngasping weakly.\n\nONE THE GROUP... Catfish, Hippy, One Night, Jammer, the others... they're\nall grinning, crying, beaming... gazing at the miracle of her rebirth.\n\nON BUD... tears are streaming down his face.\n\n                                BUD\n                   (a whisper, fierce and harsh)\n                You did it, ace.\n\n                                                                DISSOLVE TO:\n\nINT. DEEPCORE/QUARTERS -- LATER                                         196\n\nTIGHT ON LINDSEY, sleeping peacefully.  WIDER shows Bud hovering over her,\nattentive.  They are alone in Bud's tiny cubicle.  Perhaps twenty minutes\nhave passed.  She is completely swaddles in blankets, except for her face,\nand looks like a waif.\n\nLindsey's eyes flutter and open.  The first thing she sees is Bud, bending\nover her.  He can't help himself.  The tears break again and roll down his\ncheeks.  She seems terribly fragile, but bright and aware.  She smiles,\nfaintly... touches his cheek.\n\n                                LINDSEY\n                Hey... big boys don't cry, remember?\n\n                                BUD\n                Hi, lady.\n\n                                LINDSEY\n                Hi, tough guy.  I guess it worked, huh?\n\n                                BUD\n                'Course is worked.  You're never wrong, are you?\n                How d'you feel.\n\n                                LINDSEY\n                I've been better.  Next time it's your turn,\n                okay?\n\nBud's expression turn inexplicably grim.\n\n                                BUD\n                Well, you got that right.\n\n                                                                CUT TO:\n\nINT. SUB-BAY                                                            197\n\nTIGHT ON BUD'S EYES, as Monk's fingers insert acrylic scleral lenses under his\neyelids so he can see in the fluid helmet.\n\nWIDER reveals Bud is wearing the SEALs' deep suit.  Everybody is grouped\naround, buckling and zipping.  He is hyperventilating with an oxygen mask,\npart of the procedure for transitioning from air to fluid breathing.  Monk,\non his stretcher, is presiding.  The resident expert.  Lindsey is wrapped in a\nblanket, still looking wan and frail.  She doesn't have the strength to resist\nBud's will, but she's trying.\n\n                                LINDSEY\n                No, Bud, no... not you.\n\n                                BUD\n                Who then?\n\nShe looks around at the others.  Sees their eyes.  The fear.  Has her answer.\nHe lowers the helmet over his head.  Catfish clamps it down.  We see what's\ndriving him... his sense of responsibility for these people, for not being\nable to prevent this situation.\n\nHe touches her cheek, one last time.  She sees his fingers are trembling.\nThen he puts on the gloves.  Catifsh is strapping a KEYPAD UNIT onto Bud's\nforearm.  Lindsey wants to scream... to stop this madness.\n\n                                BUD (muffled)\n                So I'll hear you, but I can't talk?\n\n                                MONK\n                The fluid prevents your larynx from making\n                sound.  It'll feel a little strange.\n\n                                BUD (muffled)\n                Warning you now, folks, I'm a lousy typist.\n                              (a beat)\n                The moment of truth, huh?\n\nHis breathing is shallow and tense.  He looks at Lindsey.  The eyes of a\ncondemned man.  She squeezes his hand.  He takes a deep breath.\n\n                                BUD\n                Okay.  Let's rock and roll.\n\nMonk gently cracks a valve on the suit's feed line.  The breathing fluid (3M\nfluorocarbon emulsion FX-80) swirls into the helmet.  Bud reflexively raises\nhis chin.  The liquid fills toward his mouth.\n\n                                MONK\n                Relax now, Bud.  Just keep breathing as it\n                fills... don't fight it.  Take it in.  Just let\n                yourself take it in.\n\nSuddenly, there's nothing in there to breathe but liquid.  His eyes go wide,\ninstant panic.  He starts to thrash.  Chest heaving.\n\n                                MONK\n                Hold him.  Hold him.  This is normal... it'll\n                pass in a second.  You're gonna be okay.  We all\n                breathe liquid for nine months, Bud.  Your body\n                will remember.\n\nLindsey grabs Bud's shoulders, steadying him.  He finds her eyes, the look\ncalming him.  He's passed into a realm from which she has already returned.\nHis spasms subside.  He begins to \"breathe\" normally.  He gets a goofy look\nof wonder on his face, not really believing what he's experiencing.  He is\nalive, alert and quite completely drowned inside the FBS helmet.  He grins.\nGives a big thumbs up.  Lindsey picks up a microphone.\n\n                                LINDSEY\n                Can you hear me okay?\n                          (another thumbs up)\n                Try your keypad.\n\nBud taps out a brief message.  FEELS WEIRD - YOU SHOULD TRY THIS prints out\non their portable monitor.\n\n                                LINDSEY\n                I already have, moron.\n\nThey help Bud to the edge of the dive platform.  Jammer and Hippy lower Little\nGeek into the water and Bud grabs onto it.  Hippy yells right up next to his\nhelmet.\n\n                                HIPPY\n                I redid Little Geek's chip the same as Big Geek!\n                He should take you right to it.  All you gotta\n                do is hang on!\n\nLindsey crouches at the edge to watch Bud submerge.\n\nHe looks up at her as he drops away.\n\nIn a few seconds, she can't see him.  Her chin quivers, minutely.\n\nEXT. DEEPCORE/THE WALL                                                  198\n\nFROM FAR BELOW, Deepcore is a faint tiara of lights, above in the blackness.\nA single moving light appears above, at the edge of the cliff, and starts\ndown.  It grows large, resolving into Bud, free-falling down the wall.\n\nHe gathers speed as Little Geek's vertical thruster drives them down.\n\nBud looks down.  Between his feet he can see a short way down the wall in the\nglow of his single light, and beyond that an unfathomable blackness.  The wall\nunrolls upwards out of the darkness like a convoluted gray drapery.  He looks\nup.  The lights of Deepcore are gone.  He feels  more alone than he has ever\nfelt.  He types out:  CANT SEE YOU\n\n                                LINDSEY (V.O.)\n                We're right here with you, Bud.  Your depth is\n                3800 feet.  You're doing fine.\n\nBud comes upon the twisted wreckage of the crane, hanging against the wall\nlike a forty-ton yo-yo at the end of the umbilical.\n\nINT. COMMAND MODULE                                                     199\n\nEveryone is grouped around the monitor screen, watching Bud's telemetry.  Bud\ntypes out: GOOD DEAL ON SLIGHTLY USED CRANE.  They watch the depth meter\ncounting down.\n\n                                MONK\n                4800 feet.  It's official.\n\n                                LINDSEY\n                Bud, according to Monk here, you just set a record\n                for the deepest suit dive.  Bet you didn't think\n                you'd be doing this when you got up this morning.\n\nThe screen print out:  CALL GUINESS.  They laugh.  So far so good.  Seconds\nlater...\n\n                                HIPPY\n                One mile down and still grinnin'.\n\nEXT. THE WALL                                                           200\n\nWIDE SHOT.  Bud is a tiny spider dropping down the wall in a pathetic little\npool of light.  The wall is sterile brown-gray, devoid of life at this depth.\nLOOKING DOWN, as the light shrinks to a star and vanishes in the blackness\nyawning below.\n\nINT. COMMAND MODULE                                                     201\n\nLindsey has the microphone gripped tightly, and the lightness in her voice is\na bit brittle.\n\n                                LINDSEY\n                8500 feet, Bud.  Everything okay?\n\n                                MONK\n                Ask him a pressure effects.  Tremors, vision\n                problems, euphoria.\n\n                                LINDSEY\n                Ensign Monk want to know how you feel.\n\nON THE SCREEN, printing out: COLD.\n\n                                LINDSEY\n                Big baby.\n\nThen:  HANDS SHAKING.  HHARD TO TYPE.\n\n                                MONK\n                It's starting.  It hits the nervous system\n                first.\n\n                                ONE NIGHT\n                Keep talking, Lindsey.  Just let him hear your\n                voice.  It doesn't matter what about.\n\n                                LINDSEY\n                Don't forget Bud, you're being graded on spelling\n                as well as sentence structure, so concentrate,\n                okay?\n                              (long pause)\n                Bud, I... uh, there's some things I want to say.\n                It's hard for me.  I'm not of those softy, gooey-\n                center-type people.  It's not easy, you know,\n                being a cast-iron bitch.  It takes discipline\n                and years of training.  A lot of people don't\n                appreciate that.\n\nLindsey has somehow tuned out the others in the room.  In her mind she is\nwith Bud, out in the darkness.\n\n                                LINDSEY\n                But is wasn't all bad.  I know that.  You\n                remember that bike trip... we rode the Honda\n                up through Oregon?  It took me a week to get my\n                hair untangled, but I've never been happier.  It\n                was the most... free... I've ever felt.  I'm\n                sorry I can't tell you these things to your face.\n\nEXT. THE WALL                                                           202\n\nBud is visibly trembling, gritting his teeth... holding on as the vise-grip\nof pressure takes him.\n\n                                LINDSEY (V.O./filtered)\n                It's pitiful.  I have to wait until you're\n                freezing in the dark and there's ten thousand\n                feet of water between us.  I guess I'm babbling.\n                I'm sorry.\n\nBud struggles with his keyboard.\n\nINT. COMMAND MODULE                                                     203\n\nON THE SCREEN:  YOU ALWAYS DID TALK TOO MUCH\n\nSomehow's she's smiling and on the verge of tears at the same time.\n\n                                HIPPY\n                Two miles down and still grinnin'  Comin' up on\n                the big ten thou'.\n\n                                ONE NIGHT\n                Bottom's still a mile and a half down.\n\nEXT. THE ABYSS                                                          204\n\nBLAM!  Bud jerks as his dive light implodes.  He still has Geek's floodlights.\nHe falls on.\n\nINT. CONTROL MODULE                                                     205\n\n                                HIPPY\n                12000 feet.  Jesus, I don't believe he's doing\n                this.\n\n                                LINDSEY\n                Shut up, Hippy.  Bud, how you doing?\n\nHe types: SE LUMINUS THINNGS\n\nEveryone snaps suddenly alert.\n\n                                HIPPY\n                Uh, oh...\n\n                                LINDSEY\n                What kind of luminous things, Bud?\n\n                                CATFISH\n                Maybe it's... you know... them.\n\nThe screen prints out:  ITS OK. SQUID. GLOWING SQUID.\n\nEXT. THE ABYSS                                                          206\n\nBud is in an enormous school of bioluminescent squid, graceful, attenuated\ncreatures less than a foot long.  Thousands of then glide in ghostly arcs\naround him, filling the black void as far as the eye can see.  He stares at\nthem in wonder.  Reaches out and touches one, catches it, lets it go.  Are\nthey really here?  He can no longer be sure of his own perceptions.\n\nINT. CONTROL MODULE                                                     207\n\nAnother message from Bud:  THINK THEYR REAL.\n\n                                MONK\n                He's losing it.  Talk to him.  Keep him with us.\n\n                                LINDSEY\n                Bud, it's the pressure.  Try to concentrate.\n                Concentrate on my voice.  Just listen to my voice.\n\nEXT. THE ABYSS                                                          208\n\nBud emerges from the school of squid.  As he falls, they form a luminous plane\nof swirling colors above him.  He stares upwards, transfixed.  BUD'S POV, the\nghostly blizzard of luminescence above him.  A spectral form takes shape in\nthe patternless glow... resolving into Lindsey's face, a hundred feet wide.\nGazing down at him, her expression sad.  Her image receded away from him into\nthe darkness above as he falls.\n\nDOWN ANGLE ON BUD, reaching up in anguish.\n\nINT. CONTROL MODULE                                                     209\n\nLindsey watches as Bud haltingly types out:  YOUR GOING AWAY\n\n                                LINDSEY\n                I'm not going away, Bud.  I'm right here, right\n                here with you.  This is Lindsey, Bud.  I'm right\n                here.\n\n                                ONE NIGHT\n                Signal's fading.\n\n                                HIPPY\n                We're losing juice... kill everything we don't\n                need.  Catfish, knock out those lights.\n\nEveryone hustles to comply.  The room is plunged into darkness, the faces of\nthe group lit only by the ghostly CRT screen.\n\n                                ONE NIGHT\n                Run it through the digital processor, cook it as\n                much as you can.\n\n                                CATFISH\n                Seventeen thousand feet.  Good Christ Almighty,\n                this is insane.\n\nEXT. THE ABYSS                                                          210\n\nBud is shaking violently, as if with palsy.  His eyes keep rolling back, and\nhe's having a hard time staying conscious.  He tries to type a message and he\ncan't.  The tons of pressure per square inch are short-circuiting his nervous\nsystem.  Suddenly K-BAM!  Little Geek's pressure hull implodes.  Its lights\ngo out.  BLACKNESS.\n\nINT. CONTROL MODULE                                                     211\n\n                                ONE NIGHT\n                Little Geek just folded.\n\n                                HIPPY\n                Bye, little buddy.\n\n                                MONK\n                He can still make it.\n\n                                LINDSEY\n                I know how alone you feel... alone in all that\n                cold blackness... but I'm there in the dark\n                with you, Bud you're not alone...\n\nLindsey seems not to be in the room, but to be with him, seeing what he sees.\nShe is oblivious to the others.\n\nEXT. THE ABYSS                                                          212\n\nBlackness.  Then a bright light appears... he's lit a MAGNESIUM FLARE.\n\nIt's fierce, flickering glare lights his plunge.  Bud discards the stalwart\nlittle ROV and free-falls like a skydiver without a chute.  Out of control, he\nhits a ledge and rolls off.  Tumbles forward in a cloud of debris.  He hits\nanother outcropping, limp as a rag doll.  Rocks and sand rain down with him\nas he continues his descent.\n\nBud us quivering, teeth locked in a titanic rigor.\n\nHe pulls his arms and legs slowly into a fetal position.\n\nIn the plunge toward death he has gone he has gone full circle, returned to\nthe womb in which we all breathe the water of life before we know the world of\nair and light.  Still, there is Lindsey's voice, faintly in his helmet.\n\n                                LINDSEY (V.O.)\n                You remember that time, you were pretty drunk,\n                you probably don't remember... the power went\n                out at the old apartment, the one on Orange\n                Street... and we were staring at that one little\n                candle, and I said something really dumb like\n                that candle is me, like every one of us is out\n                there alone in the dark in this life...\n\nINT. CONTROL MODULE                                                     213\n\nTIGHT ON LINDSEY as she grips the microphone.  Her voice has become a hoarse\nwhisper.  Her eyes are intense, focused on a point far beyond the walls of the\nroom.\n\n                                LINDSEY\n              ... and you lit another candle and put it beside\n                mine and said \"that's me\"... and we stared at\n                the two candles, and then we... well, if you\n                remember any of it, I'm sure you remember the\n                next part.  Bud, there are two candles in the\n                dark.  I'm with you.  I'll always be with you.\n\nEXT. THE ABYSS                                                          214\n\nA tiny flickering light moves down along a vast black wall.  Bud falls on in\ndream-like solitude, a candle in the dark.\n\nINT. CONTROL MODULE                                                     215\n\nCatfish gently takes the microphone from Lindsey's hands and leans close.\n\n                                CATFISH\n                How you doin', podner?  Still with us, come-back?\n                Talk to us, Buddy boy.\n\nThey watch the screen, expectantly.\n\nNothing.  Hippy and One Night start checking the equipment.  Lindsey tried\nunsuccessfully to keep the terror our of here voice.\n\n                                LINDSEY\n                Bud?  You hangin' in there?  Talk to me, Bud.\n                Are you okay?\n\nThere is an agonizing pause, then the letters appear slowly:  SHAKING STOPED.\nFEEL BETER.  SOM LITE BELOW.\n\n                                LINDSEY\n                What kind of light?\n\nLIGHT EVYWHER.  BEAWTIFULLL\n\n                                MONK\n                He's hallucinating badly.\n\nEXT. THE ABYSS                                                          216\n\nBud is no longer in pain.  His expression is rapt.\n\nLOOKING DOWN, past his to a ghostly landscape.  His last flare sputters out,\nbut there is light.  Bioluminescent algae carpet the walls of the canyon\nbelow him.  And he's right... it is beautiful.\n\nThe water is so clear we can see down 500 feet past Bud's tiny, silhouetted\nfigure, to a vast landscape faintly revealed in spectral pastels.  Barren as\nthe moon but exquisite, serene.  Changeless.  A place unseen by human eyes.\nLike a firefly below, the lights of Big Geek are visible.  Bud descends toward\nthe ROV, which has grounded on a narrow shelf.  Below the shelf, the wall\nslopes out, suggesting we are near the bottom of the canyon but can't see it.\n\nONE BIG GEEK/MIRV, sitting there like a dumbshit.  Bud's feet thump into the\nsediment next to it, stirring it luminous particles.  Touchdown... three and\nhalf miles of water over his head.  Bud leans over the warhead in a swarm of\nfireflies.\n\nINT. CONTROL MODULE                                                     217\n\nAT GEEK prints out.  Monk takes the headset gently from Lindsey.\n\n                                MONK\n                Okay, Bud, we'll go step by step.  Take the\n                cover plate off the firing box.\n\nA long pause.  Then... PLATE OFF\n\n                                MONK\n                All right, Bud, you have to cut the ground wire,\n                not the lead wire...\n\nEXT. ABYSSAL LEDGE                                                      218\n\nBud is peering into the detonator unit.  How bad is he?  We can't tell.\n\n                                MONK (V.O.)\n                It's the blue wire with the white stripe, not...\n                I repeat... NOT the black wire with the yellow\n                stripe.\n\nBud is staring.  Blinking.  The two wire look big as sewer pipes, and they're\nmiles away... way down there where his hands are.\n\nThe only light he has left is a CYALUME STICK.  He pulls out the little\nplastic tube.  Breaks and shakes.  It starts to glow, a tiny wand of green\nlight.  He fumbles with his tool pouch, takes out a pair of side-cutters.\nCUTING NNOW he types to them.  He reaches into the detonator.\n\nDETAIL, THE WIRES... in the green Cyalume glow, the look identical.  The\ncutters go over on wire.  A long beat.  They withdraw, then go over the other\nwire...\n\nHe cuts--\n\nINT. CONTROL MODULE                                                     219\n\nEveryone is frozen.  Waiting.  It's very quiet.\n\n                                LINDSEY\n                Would we see the flash?\n\n                                MONK\n                Through three miles of water?   I don't know.\n\nThey're holding their breaths.  Then... STILL HERE\n\nA cheer goes up.  Rebel yells.\n\n                                CATFISH\n                Quiet, quiet!  Save you air, goddamnit.\n\n                                MONK\n                Bud, give me a reading off you liquid oxygen\n                gauge.\n\nTEN MINUTES WORTH ID SAY.  Lindsey does white.\n\n                                HIPPY\n                It took him over an hour to get down there--\n\nIt's hopeless.  Lindsey grabs the headset from Monk.\n\n                                LINDSEY\n                Drop you weights and start back now!  The gauge\n                could be wrong...\n\nEXT. ABYSSAL LEDGE                                                      220\n\nBud is one his knees beside the dead warhead.  His expression is enigmatic.\nHe looks around slowly at the luminous canyon.  Starts to type.\n\nINT. CONTROL MODULE                                                     221\n\nThe message comes in:  NO.  THINK ILL STAY A WHILE.  BEAUTIFUL HERE.  WORTH\nADMISSION\n\n                                LINDSEY\n                No!  You can make it!  You hear me?  Drop your\n                weights... you... can breathe shallow... you...\n                it could be wrong--\n\nLindsey's voice has twisted into a sob.  She begins to weep, quietly.\n\n                                LINDSEY\n                Oh God, Virgil, please...\n\nDONT CRY BABY\n\nA pause.  Then the words...\n\nWE KNEW THIS WAS A ONE WAY TICKET WHEN I PUT THIS THING ON.  BUT YOU KNOW I\nHAD TO COME.\n\nLindsey sobs at the mike.  The others look away.  The signal is weakening.\nOne Night boosts it and the screen clears briefly.\n\nLOVE YOU WIFE.\n\nShe stares at the printout.\n\n                                LINDSEY\n                Love you.\n\nThere is no reply.\n\n                                                                CUT TO:\n\nEXT. THE ABYSS                                                          222\n\nA tiny figure lies slumped beside the inert ROV, an Indian dying with his\nhorse in the desert.\n\nBud's eyelids close.  His chest barely moving.\n\nA strange illumination bathes his face and his eyes open.  He blinks.  Weakly,\nhe raises his head, facing the source of the radiance.\n\nBUD'S POV... A glowing figure hovers before him, like a vision.  It seems to\nbe an angel.  Seen closer, as it drifts toward him, we see that it is an\nextraterrestrial being, bioluminescent like some deep-sea fish.  Its body\nand limbs are transparent, and it resembles a figure made of blown glass.  A\ndelicate mantle or veil billows out around its like a corona, which pulsates\ngently, propelling the being with the hypnotic grace of a Spanish dancer.  The\nhead is refined and strangely anthropomorphic, with large eyes that convey a\ncold, dispassionate wisdom.\n\nIt is stunningly beautiful.\n\nThe creature settles toward him.  Unafraid, Bud extends his hand.\n\nIts slender, blown-glass digits grasp his bulky glove.  It pulls him up from\nthe benthic ooze and they glide together down the slope, deeper into the\nabyss.\n\nAt the limits of visibility we see faint, glowing forms moving below.  They\nresolve into NTI ships.  Tiny ovoids, like the little scoutship that Lindsey\nnearly collided with at the Montana wreck.  The larger manta-ships.  And\nothers, strangely configured, moving in the darkness below like luminous fish.\n\nSuddenly the darkness explodes with light.  A vast, reticulated pattern of\nbrightly glowing lines, like some enormous circuit diagram, appears below\nthem, covering the floor of the abyssal trench.  It sweeps outward from the\ncenter, as if the light were surging through channels.  The NTIs are revealing\ntheir home to Bud.  The ships move among the spires like air traffic over a\nmajor city.\n\nEXT. N.T.I. STRUCTURE                                                   223\n\nBud and the creature descend until, between the lines of light, we see a dark\nsurface of inhuman design.  The shape extends beyond the limits of visibility.\nTowers hundreds of feet high stretch upward from the curving surface.  It\ndwarfs their figures as the descend toward it, approaching an opening that soon\nyawns like a vast mouth.\n\nThey are picking up speed, swept along by a powerful current, into the mouth-\nlike opening.\n\nINT. N.T.I. STRUCTURE                                                   224\n\nBud stares around in awe as smooth, pearlescent walls blur past him.  It is a\ncurving three-dimensional maze of tunnels, like a vast circulatory system,\nwhere controlled currents of water become freeways in three-dimensional\nspace.  Tunnels divide, narrow, and reenter main-routes hundreds of feet\nacross, as the pair race through in a dizzying blur.\n\nINT. FINAL CHAMBER                                                      225\n\nEntering a smaller chamber they settle to the floor, and the NTI moves back a\nfew feet.\n\nA shimmering plane or surface appears like a vertical curtain bisecting the\nchamber.  The seawater divides, like the Red Sea, into two rippling walls.\nThey move apart.  Leaving Bud standing in a short, shimmering hallway.\n\nWeakly, he uncouples his helmet and pulls it free.  Drops to his knees.\nDoubles over as spasms wrack him.  Breathing fluid explodes from his lungs.\nHe lies gasping and coughing on the floor, dragging in deep breaths of what\nhe can only hope is air.  It is.\n\nBud slowly recovers, sitting up.  His head is clearing.  This really is\nhappening.  Beyond the shimmering, vertical surface of the water he sees the\nNTI being joined by others, move or less identical, until a group of seven\nis gathered watching him.\n\n                                BUD\n                Howdy, Uuuh... how you guys doin'?\n\nHis voice echoes metallically in the strange chamber.  Soft laps of water\nfrom the 'walls'.\n\nIn the air a pattern of glowing lines appears, a series of what appears to be\ncircuit diagrams.  Bud staggers back from this strange 'screen' hanging in\nmid-air.  The image is about twenty feet across.\n\nThere is a rolling jumble of static and interference which resolves into...\nthe face of Dan Rather, doing the evening news.  STATIC, then another\nnewscast.  And another.  Fragments of the same story.  The world on the brink\nof war.\n\n                                BUD\n                You watch out TV?  That what you're trying to\n                say?  That you know what's been going on up\n                there?\n\nThe NTIs are impassive.  Static... then another newscast.\n\nThis time, we're allowed to focus on the story.  An on-the-scene interview\noutside a high-tech seismology lab.  There is an air of hysteria about the\nscene... technicians running across the background of the shot, people\nshouting, the reporter jamming his mike at the harried-looking scientist.\n\n                                REPORTER\n              ... a Caltech scientist who is among those\n                reporting an unprecedented disturbance in the\n                world's oceans.  Dr. Breg, can you give us a\n                clearer explanation then we're getting?\n\nBerg is edgy and distracted.  People keeps handing him pieces of paper,\ncomputer hardcopy.  The biggest thing in his life is happening...\n\n                                BERG\n                They're acoustic shockwaves, like tsunamis, but\n                with no seismological source.  The waves are\n                propagating toward the shorelines of every\n                continent--\n\nAn assistant runs up, face shiny with fear, beckoning.  We see that Berg is\nrunning scared.  The impossible bringing the greatest terror to the rational\nmind.\n\n                                BERG\n                Yeah.  I'll be right there... I have to go.\n                Look, we don't know what it is!  Okay?  Not the\n                slightest goddamn idea!\n\nThe image dissolves into static, fades out.  Bud turns to the NTIs.\n\n                                BUD\n                You're doing it!  Right?  That's what you're\n                telling me.  Yeah, you can control water...\n                that's your technology.  But why?\n\nStatic again, then a brilliant flash.  Grainy stock film of a hydrogen bomb\ntest in the Pacific.\n\nThe film repeats, and then again, faster, and again until is merges into an\nunbroken white glare.  Bud gets the message.\n\n                                BUD\n                Hey, you don't know they're really gonna do it.\n                Where do you get off passing judgment on us,\n                when you can't be sure?  How do you know?\n\nThe screen exploded into a staccato series of searing images, stark moments\nfrom recent history...\n\nUS soldiers fighting in Vietnam, street warfare in Beirut, a car bomb in\nBelfast, a suspect shot in the head in the streets of Saigon, burned and\nbleeding children, grainy footage of corpses bulldozed into mass graves at\nAuschwitz, Wermacht soldiers marching in goose-step review, a 13-year-old\ncontra with an AK-47...  Just glimpses, strobing... a few frames of each.\nBut enough.  The images continue.\n\nHOLD ON BUD, as the lights flicker on his face, the ongoing indictment of\nhumanity.\n\n                                                                CUT TO:\n\nEXT. OCEAN FRONT WALK, SANTA MONICA, CALIFORNIA -- DAY                  226\n\nA video news crew leaps from a Jet Ranger helicopter in a parking area and\nruns to set up near the railing, facing the ocean.  Pandemonium reigns around\nthem, people running, driving, evacuating inland.\n\nOn the horizon, out to sea, a dark line has appeared.\n\nIt grows in height as it comes closer, a wall of water stretching across the\nhorizon, already hundreds of feet high and growing.\n\nEXT. NEW YORK -- DAY                                                    227\n\nLONG LENSE SHOT, looking seaward past the Statue of Liberty, out past the\nVerazzano Narrows.  Stacked up by perspective, the distant wave is a wall of\nwater impossibly high, still miles out.\n\nEXT. NAVAL BASE, KAMCHATKA PENINSULA, U.S.S.R. -- NIGHT                 228\n\nThe scene repeats on the eastern coast of the Kamchatka Penninsula in Russia,\nwhere a full moon shimmers along the crest of a vast wave.\n\nSIRENS wail as Russian sailors run from the docks of Petropavlovsk Naval Base.\nSome stand rooted as the black glacier of water, a thousand feet high and\ngrowing, thunders toward them in nightmarish slow motion.\n\nEXT. OCEAN FRONT, SANTA MONICA -- DAY                                   229\n\nThe minicam crew reporter is speaking rapidly, faltering with emotion, his\nvoice cracking like the famous broadcast from the scene of the Hindenburg\ndisaster.\n\n                                REPORTER\n                The horizon has gone dark... the crowd is starting\n                to run... some are just staring, unable to\n                move... the wave... the wave is... it's...\n                I don't know... maybe a thousand feet high\n                already... getting bigger as I'm watching...\n                still miles out... oh my God, Jesus... I can\n                hear it...\n\nA roar fills the air, a thunder which drowns out the people's screams, even\nthe rotors of the news chopper as the camera teams scrambles aboard.  They\nleave the announcer standing transfixed, his face blank, eyes tracking upward\nand upward as the ground begins to shake.\n\nEXT. NEW YORK -- DAY                                                    230\n\nThe Statue of Liberty looks like a souvenir figurine at the afternoon sun is\nblocked out by the cresting tsunami, an escarpment of water 2500 feet tall.\n\nEXT. SAN FRANSISCO -- DAY                                               231\n\nLONG LENS SHOT -- The Golden Gate Bridge and the hills of the city, the\nbuildings downtown.  Beyond, FILLING FRAME is the wall of sea green which\ndefies our comprehension.  The image shakes with the THUNDER.\n\nEXT. MALIBU -- DAY                                                      232\n\nA diehard surfer looks over his shoulder as the mountain of water which\ntranscends his worst nightmare.  He lies paralyzed on his board.\n\nEXT. MIAMI -- DAY                                                       233\n\nDowntown Miami crouches in terror at the feet of the shimmering monolith.\n\nIn a penthouse office suite, an executive watches the wave towering above him,\nblocking out the sun, a line of raging foam appearing as it arches over,\nabout to break upon the teeming city.\n\nAnd then...\n\nThe wave slows as it crests...\n\nAnd stops.\n\nIT SIMPLY STOPS.\n\n2600 feet high and motionless except for a shimmering undulation of its\nsurface in the bright sun.  There is quiet, a faint wind and calling of\nconfused gulls.  Various reactions, as the thunder fades and people recover,\nonly to stand awed before the vast, inexplicable manifestation.  A news\nhelicopter passes in front of it like a dragonfly.\n\nEXT. MALIBU                                                             234\n\nThe surfer just blinks, starting.\n\nEXT. NEW YORK -- DAY                                                    235\n\nOn the East Coast it's the same, as the World Trade Centers are dwarfed by a\nshimmering blue wall which stands... waiting.\n\nEXT. PETROPAVLOVSK NAVAL BASE, U.S.S.R. -- NIGHT                        236\n\nRussian seamen, lining the harbor breakwall at Petropavlovsk Naval Base on the\nKamchatka Peninsula, stare upward at the monolith of water, undulating in the\nmoonlight.  It seems poised to crash down, inflicting inconceivable\ndevastation... but it doesn't.\n\nEXT. OCEAN FRONT WALK, SANTA MONICA                                     237\n\nWhen all have seen...\n\nThe wave soundlessly subsides, slowly slipping back and down until the surface\nof the sea is normal again.\n\nVIDEO SHOT, HANDHELD, of a crowd of people watching the sea.  Moving from\nface to face.  Various reactions as people respond to what they can only\nunderstand as a miracle.  The faces... awed, stunned, tear-streaked...\nlaughing.  The cameraman is just walking.  Some people turn to him and smile,\nor laugh, or whoop.\n\nA woman is collapsed on a bench, crying.\n\nA man is on his knees, shaking.\n\nTotal strangers hug each other.\n\nA black guy, tears pouring down his face, turns to the camera with a beautific\ngrin.\n\n                                GUY\n                Somebody just laid it down to us, man.  Things\n                ain't never gonna be the same!\n\nPULL BACK to reveal that we are in the...\n\nINT. FINAL CHAMBER                                                      238\n\nBud sits, shaken, watching the screen, as people react to their deliverance.\nHe turns to the NTIs.\n\n                                BUD\n                Why?  You could've done it.  Why didn't you?\n\nThe screen darkens.  Then letters appears on it, slowly printing out, as if\nsomeone was clumsily typing them.\n\nWE KNEW THIS WAS...\n\nAnd we've seen this before so we know the rest...\n\nWE KNEW THIS WAS A ONE WAY TICKET WHEN I PUT THIS THING ON.  BUT YOU KNOW I\nHAD TO COME.\n\nA pause, then:\n\nLOVE YOU WIFE\n\nThe last message expands to fill the entire screen.\n\nBud stares at the screen, at his message of self-sacrifice, then at the\naliens.  They bow their heads, just for a moment.  A sign of respect.\n\nCLOSE ON BUD as he begins to realize what has happened.\n\n                                                                CUT TO:\n\nINT. DEEPCORE/CONTROL MODULE                                            239\n\nLindsey is slumped in a chair, just staring.  Withdrawn.\n\nThe others are conserving oxygen and heat, huddling in the dark.\n\nThe air is looking pretty thick.  The speaker of the hydrophone transceiver\ncrackles to life.\n\n                                MCBRIDE (V.O.)\n                Deepcore, do you read?  This is Benthic Explorer,\n                over.\n\n                                CATFISH\n                Hell yes, we read!  Good of you to join us.  How's\n                that storm doin'?\n\n                                MCBRIDE\n                Well, it's strange... it just kind've blew\n                itself out all of the sudden.  We're up here in\n                a flat sea with no wind.  But then a lot of weird\n                things've been happening.\n\n                                CATFISH\n                Well, hell, son.  You better get us a line down\n                here, we're in moderately poor shape.\n\nLATER, Hippy, Catfish, and Monk are conferring B.G. on how to get a new\numbilical hooked on.  One Night is talking to McBride on the hydrophone.\n\n                                MCBRIDE\n                They figure is was over a half mile high.\n\n                                ONE NIGHT\n                I wish I could have seen it--\n\nShe glances down at the telemetry screen, seeing movement.\n\n                                ONE NIGHT\n                Hey.  Hey!  HEY!!  Look... it's Bud.\n\n                                MONK\n                That's impossible.\n\nLindsey bolts to the screen.  Stares at the message printing out.\n\nA huge grin wraps around her face.\n\n                                LINDSEY\n                No it's not.\n\n                                MCBRIDE (V.O.)\n                What's it say?\n\nLindsey take the mike and sits before the screen.  During the message, her\nvoice will go through an emotional spectrum from confusion to wonder, to a\nchildlike joy.\n\nINTERCUT BETWEEN DEEPCORE AND EXPLORER BRIDGE DURING THE FOLLOWING:\n\n                                LINDSEY\n                It says...\n                \"VIRGIL BRIGMAN BACK ON THE AIR/HAVE SOME NEW\n                FRIENDS DOWN HERE/I GUESS THEYVE BEEN HERE AWHILE/\n                THEYVE LEFT US ALONE BUT IT BOTHERS THEM TO SEE\n                US HURTING EACH OTHER/GETTING OUT OF HAND LATELY\"\n\nLindsey grins as she reads the next part...\n\n                                LINSEY\n                \"THEY SENT A MESSAGE/HOPE YOU GOT IT\"\n\n                                CATFISH\n                I'd say that's a big 10-4, jack.\n\n                                LINDSEY\n                \"THEY WANT US TO GROW UP A BIT AND PUT AWAY\n                CHILDISH THINGS/OF COURSE ITS JUST A SUGGESTION.\"\n\nINT. BENTHIC EXPLORER BRIDGE -- DAY                                     240\n\nBeyond the windows the ocean is calm.  The sky steel-gray put placid.  McBride\nturns to Commodore DeMarco and the Navy contingent, his eyebrows cocked.\n\n                                MCBRIDE\n                Looks like you boys might by out of business.\n\n                                BENDIX\n                Something's going on down there.  I'm getting\n                some big readings....\n\nBendix is hunched over the sonar, and we can see the screens lit up like a\nWurlitzer.\n\nINT. DEEPCORE                                                           241\n\nIn Deepcore the crew becomes aware of a strange subsonic rumbling.  The sonar\nis going crazy.  One Night puts the headphones of her passive sonar rig up to\nher ear, then jerks it away.\n\n                                ONE NIGHT\n                Whew!  Whatever this is, it's major.\n\nThe rumbling increases and a glow diffuses the water.\n\nThe glow intensifies until a blinding shaft of light blasts through the\nviewport, bathing the whole interior in a cold white radiance.\n\nA last message appears on the screen:\n\nKEEP YOU PANTYHOSE ON/YOURE GONNA LOVE THIS\n\nThe radiance intensifies.  Everyone covers their eyes.  It flares to\nWHITE-OUT.\n\n                                                                CUT TO:\n\nINT./EXT. EXPLORER BRIDGE -- DAY                                        242\n\nBendix and the bridge crew are going nuts.  All their instruments are pegged.\n\n                                BENDIX\n                Active is pinging back something big... it's\n                enormous!  Coming up right under us.\n\n                                DEMARCO\n                Where?\n\n                                BENDIX\n                Where?  EVERYWHERE!!\n                         (looks out the window)\n                Over there!  Port bow.\n\nEXT. BENTHIC EXPLORER AND OCEAN                                         243\n\nA depression appears in the surface of the sea a hundred yards off, not\nswirling down like a whirlpool, just dimpling down.\n\nIt gets wider.  Deeper.  Rapidly becomes a yawning pit.\n\nThe ocean is OPENING.\n\nNow the surface is churned by turbulence.  Slow massive roils of tremendous\npower boil up from the depths.\n\nMcBride leads a mass exodus onto the deck to see better.\n\nThe open becomes a roaring maw a hundred yards across.\n\nThe ships are like toys on the shimmering rim of the maelstrom.\n\nSOMETHING RISES IN THE CENTER OF THE OPENING.  A massive spire.  Smoothly\ncurving and iridescent.  Off the starboard beam, a quarter mile away, another\nspire rises.  Tons of seawater fall from its sides with a THUNDEROUS ROAR, the\nenergy of Niagara.\n\nOff the port bow... another spire.\n\nAnd another, beyond the destroyer Albany, dwarfing it.\n\nSix towers... plus one larger, in the center.  Rising.\n\nOne the Explorer's deck, a shadow engulfs them as the nearest spire blocks out\nthe sun.  The air, the sea, the deck... all vibrate with the THUNDER OF\nCREATION.\n\nAnd now for the payoff shot:  WE'RE HIGH, LOOKING DOWN.  THE SPIRES FORM A\nPERFECT RING A MILE ACROSS.  A VAST DARK FORM, LIKE A GREAT SHADOW, RISES FROM\nTHE DEPTHS BENEATH THE SHIPS.  THE SPIRES ARE CONNECTED.  IT IS ALL ONE.\n\nTHE NTI ARK.\n\nIt surfaces with slow majesty, gently beaching all the ships on its broad\nback.  We recognize it as the structure into which Bud was led by the angelic\nbeing, which we assumed was a city.  The Explorer rocks gently on its flat\nhull, clunking massively to one side as it settles.\n\nThe bridge crew watch millions of tons of seawater streaming off the back of\nthe vast, slightly curved hull.  The missile cruiser rocks back and forth\nnearby, high and dry... its prop whining futility.\n\nON EXPLORER'S DECK, McBride, Bendix, DeMarco, the rest of the Navy\ncontingent... they're all standing there open-mouthed, in a dream-like daze.\nTouched by the hand of God.\n\n                                BENDIX\n                Look...\n\nWHAT THEY SEE -- Fifty yards away, between them and the Albany, sits Deepcore\nTwo.  It looks like a particularly ugly and unwanted toy, sitting on the\nglistening plain of the NTI Ark's hull.\n\nCLOSER, ON TRIMODULE C, as the hatch at the bottom opens.\n\nCatfish's feet appear, bicycling.  He swings down to the pearlescent 'deck'.\nStands there blinking in the sunlight, mole-like.  Jammer plonks down behind\nhim.  He turns, lifts Lindsey down.  Hippy, Sonny, and the rest, emerge into\nthe light of the sun.  A deliverance from the blackest night they will ever\nknow.\n\n                                LINDSEY\n                We should be dead.  We didn't decompress.\n\n                                CATFISH\n                Out blood oughta be fizzin' like a warm, shook-\n                up Coke.\n\n                                HIPPY\n                They must've done something to us.\n\nLindsey has tears streaming down her cheeks... for the sun, for life, for\ntheir deliverance and the larger one she knows has happened, an epiphany for\nthe whole human race.\n\n                                LINDSEY\n                Oh, yes.  I think you could say that.\n\nShe blinks.  Seeing something not far away.  She gives a little laugh, or\nsomething between laughing and crying.\n\nREVERSE, as Bud walks up the curving incline of one of the mouth-like\nenterances to the NTI structure.  His suit is casually unzipped and the FBS\nhelmet dangles from one hand jauntily.\n\nShe starts toward him.  Breaks into a run.  Then stops a few feet from him.\nWatching him come to her.\n\nHis smile, his eyes illuminating her.\n\nHe stops and she touches him, lightly.  Is this real?\n\nThe look at each other, wonderingly a moment.\n\nThen laugh.  She sniffs loudly.\n\n                                LINDSEY\n                Hello, Brigman.\n\n                                BUD\n                Hello, Mrs. Brigman.\n\nTheir lips meet.\n\n                                                                CUT TO BLACK\n\n\n\n\n\n\n\nAbyss, The\nWriters :   James Cameron\nGenres :   Action  Adventure  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:18:44.328305"}