{"title": "Aladdin", "film_link": "/Movie Scripts/Aladdin Script.html", "script_link": "/scripts/Aladdin.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Aladdin Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Aladdin Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.24 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Roger Allers\" title=\"Scripts by Roger Allers\">Roger Allers</a><br/>  <a href=\"/writer.php?w=Ron Clements\" title=\"Scripts by Ron Clements\">Ron Clements</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a><br/>  <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a><br/>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<b>Script Date</b> :  1992<br/>\n<br/>\n<a href=\"/scripts/Aladdin.html\">Read \"Aladdin\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>ALADDIN:  THE COMPLETE SCRIPT\n<b>COMPILED BY BEN SCRIPPS &lt;34RQNPQ@CMUVM.CSV.CMICH.EDU&gt;\n</b>(Portions Copyright (c) 1992 The Walt Disney Company\n\nPEDDLER:    Oh I come from a land\n    From a faraway place\n    Where the caravan camels roam\n    Where they cut off your ear /Where it's flat and immense\n    If they don't like your face /And the heat is intense\n    It's barbaric, but hey--it's home!\n    When the wind's at your back\n    And the sun's from the west\n    And the sand in the glass is right\n    Come on down,\n    Stop on by\n    Hop a carpet and fly\n    To another Arabian night!\n\n    Arabian nights\n    Like Arabian days\n    More often than not\n    Are hotter than hot\n    In a lot of good ways\n\n    Arabian nights\n    'Neath Arabian moons\n    A fool off his guard\n    Could fall and fall hard\n    Out there on the dunes.\n\n    Ah, Salaam and good evening to you worthy friend.\n    Please, please, come closer--(Camera zooms in hitting\n    peddler in face) Too close, a little too close.  (Camera\n    zooms back out to CU)There.Welcome to Agrabah.  City of\n    mystery, of enchantment, and the finest merchandise this\n    side of the river Jordan, on sale today, come on down!\n    Heh, heh.  Look at this! Yes!  Combination hookah and\n    coffee maker--also makes Julienne fries.  Will not break\n    (taps it on table), will not--(it falls apart)--it\n    broke.  Ooohhh!  Look at this! Pulls out Tupperware) I\n    have never seen one of these intact before.  This is the\n    famous Dead Sea Tupperware. Listen.  (Pries it open,\n    makes raspberry sound.)  Ah, still good. (Camera begins\n    to pan to right.  PEDDLER hurries to catch it.)  Wait,\n    don't go!  (Stop pan.)I can see that you're only\n    interested in the exceptionally rare.  I think then, you\n    would be most rewarded to consider...this.  (PEDDLER\n    pulls the MAGIC LAMP out from his sleeve.) Do not be\n    fooled by its commonplace appearance.  Like so many\n    things, it is not what is outside, but what is inside\n    that counts.  (Another pan, this one slower to left.\n    Again, PEDDLER rushes to catch up.)  This is no ordinary\n    lamp!  It once changed the course of a young man's life.\n    A young man who liked this lamp was more than what he\n    seemed.  A diamond in the rough.  Perhaps you would like\n    to hear the tale?  (PEDDLER pours shiny sand from the\n    lamp into his hand.)  It begins on a dark night (PEDDLER\n    throws sand into the sky, where it forms a starry\n    nightscape.) , where a dark man waits, with a dark\n    purpose.\n\n(Camera tilts down to find JAFAR sitting on his horse and IAGO\n    on his shoulder.  GAZEEM comes riding up to the pair.)\n\nJAFAR:  You...are late.\nGAZEEM:A thousand apologies, O patient one.\nJAFAR:  You have it, then?\nGAZEEM:I had to slit a few throats to get it.  (Pulls out\n        half of the medallion.  JAFAR reaches out for it,\n        but GAZEEM yanks it back.)  Ah, ah, ahhh!  The treasure!\n        (IAGO squawks as he flies by and grabs the medallion.)  Ouch!\nJAFAR:  Trust me, my pungent friend.  You'll get what's\n        coming to you.\nIAGO:   What's coming to you!  Awk!\n\n(JAFAR pulls out the second half of the medallion.  He connects\n    them, and the insect medallion begins to glow.  Finally, it\n    flies out of JAFAR's hand, scaring the horses, and is off\n    towards the dunes.)\n\nJAFAR:  Quickly, follow the trail!\n\n(All ride off, following the glowing speck of light, until\n    it reaches a large dune.  It separates into two and the\n    halves plunge into the dune.  All that remains are two glowing\n    points of light on the dune.  But then the dune begins to rise\n     up, transforming into a giant lion's head, with the glowing\n    points serving as the eyes.)\n\nJAFAR:  At last, after all my years of searching,  the cave\n        of wonders!\nIAGO:       Awk!  Cave of wonders!\nGAZEEM: By Allah!\nJAFAR:  Now, remember!  Bring me the lamp.  The rest of the\n        treasure is yours, but the lamp is mine!\n\n(GAZEEM starts to approach the lion's mouth, which forms the\n    entrance to the cave.  He chuckles as he goes.)\n\nIAGO:   Awk, the lamp!  Awk,  the lamp!  (Now that IAGO and\n    JAFAR are alone, IAGO opens up in normal English.)\n    Jeez, where'd ya dig this bozo up?\n\n(JAFAR puts his finger to his lips and shushes him.  GAZEEM reaches\n    the cave, but is blown away by the roar of the cave's speaking.)\n\nCAVE:       Who disturbs my slumber?\nGAZEEM: It is I, Gazeem, a humble thief.\nCAVE:       Know this.  Only one may enter here.  One whose\n        worth lies far within.  A diamond in the rough.\n\n(GAZEEM turns to JAFAR with a questioning look.)\n\nJAFAR:  What are you waiting for?  Go on!\n\n(GAZEEM hesitates, then moves one foot inside the cave.  With\n    great apprehension, he plants his foot down.  Nothing happens.\n      Relieved, he begins his trek again.  Then another roar comes.\n     He turns back, but the lion's mouth slams shut and the dune\n    collapses back to normal.  All that are left are JAFAR, IAGO,\n     and the two separated halves of the medallion.)\n\nCAVE:       Seek thee out, the diamond in the rough.\n\n(IAGO unburied himself from the sand, coughing as he does so.)\n\nIAGO:       I can't believe it.  I just don't believe it. We're\n        never gonna get a hold of that stupid lamp!  Just\n        forget it.  Look at this.  Look at this.  I'm so\n        ticked off that I'm molting!  (He flies up to\n        JAFAR's shoulder.)\nJAFAR:  Patience, Iago.  Patience.  Gazeem was obviously\n        less than worthy.\nIAGO:       (Extremely sarcastically) Oh, there's a big\n        surprise.  That's an incred--I think I'm gonna have\n        a heart attack and die from not surprise!  What're\n        we gonna do?  We got a big problem here,a big prob-\n        (JAFAR pinches his beak shut.)\nJAFAR:  Yes, we do.  Only one may enter.  I must find this\n        one, this...diamond in the rough.\n\n(Cut to a rooftop, where ALADDIN rushes up to the edge, carrying\n    a loaf of bread.  He almost drops it over the edge.)\n\nGUARD:  Stop, thief!  I'll have your hands for a trophy,\n        street rat!\nALADDIN:    (Looks back, then down, then at the bread.)  All\n        this for a loaf of bread?\n\n(He jumps off, landing on two ropes strung between buildings, with\n    drying clothes on them.  He skies down them, collecting bits\n    and pieces of clothing on him as he goes.  Finally, he's\n    nearing the end of the rope, at a window, when a woman reaches\n     out and slams the shutters closed.  ALADDIN slams into the\n    shutters and falls to the street, his fall being broken by\n    numerous awnings and the pile of clothes around him.  He pulls\n     off the top layer of clothes and is about to enjoy his bread\n    when...)\n\nGUARD 1:    There he is!\nGUARD 2:    You won't get away so easy!\nALADDIN:    You think that was easy?\n\n(He looks at three women, laughing at him.)\n\nGUARD 1:    You two, over that way, and you, with me.  We'll\n        find him.\n\n(ALADDIN pulls a sheet over him and wraps himself as a disguise.\n    He rushes over to the women.)\n\nALADDIN:    Morning, ladies.\nWOMAN 1:    Getting into trouble a little early today, aren't\n        we Aladdin?\nALADDIN:    Trouble?  No way.  You're only in trouble if you\n        get caught--\n\n(A hand grabs ALADDIN's shoulder and yanks him back.  It's the\n    first GUARD.  ALADDIN's disguise falls off.)\n\nALADDIN:    I'm in trouble!\nGUARD:  ...and this time--(A screeching sound from ABU,\n        then the guard's turban is pulled down over his\n        eyes.  ABU dances on the GUARD's head, laughing.)\nALADDIN:    Perfect timing, Abu!\nABU:        Hello!\nALADDIN:    Come on, let's get outta here!\n        Gotta keep...one jump ahead of the breadline\n        One swing ahead of the sword\n        I steal only what I can't afford\n        That's everything!\n\n(ALADDIN battles a GUARD wielding a sword.  He dodges a couple of\n    swings, then pulls down the GUARD's pants.  ABU raspberries the\n    GUARD, then dodges an attack.  The GUARD swings at ALADDIN,\n    but destroys a barrel of fish.  As ALADDIN runs off, the GUARD\n     pulls a fish over his lower body as a pair of pants.)\n\n        One jump ahead of the lawmen\n        That's all, and that's no joke\n        These guys don't appreciate I'm broke!\n\n(ALADDIN and ABU scamper up a pile of barrels, then kick one down\n    on top of another GUARD.)\n\nGUARDS: (one at a time) Riffraff! Street rat!\n        Scoundrel! Take that!\nALADDIN:    Just a little snack, guys!\n\n(ALADDIN scampers to the top of a platform. The GUARDS shake the\n    platform back and fro trying to knock him off.)\n\nGUARDS: Rip him open, take it back guys!\nALADDIN:    I can take a hint, gotta face the facts\n        You're my only friend, Abu!\nWOMEN:  Who?!?\n\n(ALADDIN jumps off the platform to certain death, only to grab ABU's\n    hands like an acrobat.  The pair swing into a harem.)\n\n        Oh, it's sad Aladdin's hit the bottom\n        He's become a one-man rise in crime\n\n(ABU finds a plate full of fruit and stuffs his mouth full like a\n    chipmunk.)\n\nWOMAN:  I'd blame parents, except he hasn't got 'em!\nALADDIN:    Gotta eat to live, gotta steal to eat\n        Tell you all about it when I got the time!\n\n(ALADDIN and ABU exit.  Cut to MUSCLEMAN flexing to a crowd.  The\n    GUARDS rush past.  Cut to ALADDIN and ABU behind the MUSCLEMAN,\n     matching his moves, until they make a mistake and are discovered.)\n\n        One jump ahead of the slowpokes\n        One skip ahead of my doom\n        Next time gonna use a nom de plume.\n        One jump ahead of the hitmen\n        One hit ahead of the flock\n        I think I'll take a stroll around the block.\n\n(A chase sequence, in which ALADDIN and ABU, pursued by the GUARDS,\n    race through a flock of sheep, hurdle a MAN sleeping on a bed of\n    nails {of course one extremely large GUARD lands on him}.  ABU\n     disguises himself with jewels until a SHOPKEEPER discovers him.\n\nCROWD:  Stop, thief! Vandal!\n        Outrage! Scandal!\nALADDIN:    Let's not be too hasty\n\n(ALADDIN is surrounded by GUARDS in front of a door. The door opens\n    and a large, ugly LADY comes out.)\n\nLADY:   Still I think he's rather tasty\n\n(ALADDIN tumbles away, then puts his arm around a GUARD, acting\n    like they're all chums.)\n\nALADDIN:    Gotta eat to live, gotta steal to eat\n        Otherwise we'd get along!\n<b>GUARDS: WRONG!\n</b>\n(They all jump into a pile and fight.  When they stop, ALADDIN and\n    ABU are gone.  They are sneaking away in barrels.  They run\n    across a flaming pit, followed by GUARDS who hop up and down,\n    screaming in pain as they cross the rocks.  ALADDIN and ABU\n    pass a SWORD SWALLOWER, then ABU goes back, pulls the sword\n    out of the SWALLOWER's mouth.  ABU advances on the guards,\n    who retreat in fear.)\n\nGUARD 1:    He's got a sword!\nGUARD 2:    You idiot--we've ALL got swords!!\n\n(ABU sets the sword down gently, then runs.  ALADDIN and ABU are\n    once again surrounded, with GUARDS coming from left and right.\n      He jumps up and climbs a robe trick being done on the street,\n     as the GUARDS all crash into each other.)\n\nALADDIN:    One jump ahead of the hoofbeats!\nCROWD:  Vandal!\nALADDIN:    One hop ahead of the hump!\nCROWD:  Street rat!\nALADDIN:    One trick ahead of disaster\nCROWD:  Scoundrel!\nALADDIN:    They're quick--but I'm much faster\nCROWD:  Take that!\n\n(The GUARDS chase ALADDIN up a staircase into a room.  He grabs a\n     carpet and jumps out the window)\n\nALADDIN:    Here goes, better throw my hand in\n        Wish me happy landin'\n        All I gotta do is jump!\n\n(The GUARDS follow him out the window, but they go straight down to\n     the street, and land in a pile with the sign \"Crazy Hakim's\n    Discount Fertilizer.\"  ALADDIN uses the carpet as a parachute\n    to land safely and out of danger. ALADDIN and ABU high-five each\n    other.)\n\nALADDIN:    And now, esteemed effendi, we feast!  All right!\n\n(ALADDIN breaks the bread in two and gives half to ABU, who begins\n    to eat.  But ALADDIN looks over and sees two young children\n    rummaging through the garbage for food.  The GIRL sees him, then\n    drops her find and tries to hide.  ALADDIN looks at them, then\n    the bread, then at ABU.)\n\nABU:        Uh-oh!\n\n(ABU takes a big bite of his food, but ALADDIN gets up and walks\n    over to the children.  The GIRL pulls her brother back.)\n\nALADDIN:    Here, go on--take it.\n\n(The children giggle with delight.  ABU tries to swallow his bite,\n    then looks guilty. He walks over to the children and offers his\n     bread to them.  In delight, they pet him on the head.)\n\nABU:        Ah, don't.  Huh?\n\n(ABU sees ALADDIN walking into the daylight, where there is a parade\n    going on.ALADDIN peers over the shoulders of people.  He sees\n    PRINCE ACHMED riding on a horse.)\n\nBYSTANDER 1:    On his way to the palace, I suppose.\nBYSTANDER 2:    Another suitor for the princess.\n\n(ALADDIN is startled as the two children come running out from the\n    alley. The BOY runs out in front of the PRINCE's horse,\n    startling it.)\n\nPRINCE: Out of my way, you filthy brat!\n\n(The PRINCE brings up his whip to attack the children, but ALADDIN\n    jumps in front of them and catches the whip.)\n\nALADDIN:    Hey, if I were as rich as you, I could afford some manners\nPRINCE: Oh--I teach you some manners!\n\n(The PRINCE kicks ALADDIN into a mud puddle. The crowd laugh at him.)\n\nALADDIN:    Look at that, Abu.  It's not every day you see a\n        horse with two rear ends!\n\n(The PRINCE stops and turns back to ALADDIN.)\n\nPRINCE: You are a worthless street rat.  You were born a\n        street rat, you'll die a street rat, and only\n        your fleas will mourn you.\n\n(ALADDIN rushes the PRINCE, but the doors to the castle slam shut\n    in his face.)\n\nALADDIN:    I'm not worthless.  And I don't have fleas.  Come\n        on, Abu.  Let's go home.\n\n(ALADDIN makes the climb to his home with the view, then tucks in\n    ABU for the night.)\n\nALADDIN:    Riffraff, street rat.\n        I don't buy that.\n        If only they'd look closer\n        Would they see a poor boy?  No siree.\n        They'd find out, there's so much more to me.\n\n(He pulls back a curtain to reveal the beautiful palace.)\n\n        Someday, Abu, things are gonna change.  We'll be\n        rich, live in a palace, and never have any problems\n        at all.\n\n(Dissolve to same shot during day.  Cut to int. of SULTAN's chamber.\n     The door bursts open, and PRINCE ACHMED storms in, missing the\n    rear end of his pants.)\n\nPRINCE: I've never been so insulted!\n\nSULTAN: Oh, Prince Achmed.  You're not leaving so soon, are\n        you?\n\nPRINCE: Good luck marrying her off!\n\nSULTAN: Oh, Jasmine!  Jasmine!  Jasmine!  (The SULTAN goes\n        off into the garden looking for his daughter.  He\n        finds her, but is interrupted by RAJAH, JASMINE's\n        pet tiger, who blocks him off.  RAJAH has a piece\n        of the PRINCE's undershorts in his mouth.The SULTAN\n        grabs the cloth and yanks it out of RAJAH's mouth.)\n        Confound it, Rajah!  So, this is why Prince Achmed\n        stormed out!\nJASMINE:    Oh, father.  Rajah was just playing with him,\n        weren't you Rajah.  (RAJAH comes over and allows\n        JASMINE to pet and hug him.)  You were just playing\n        with that overdressed, self-absorbed Prince Achmed,\n        weren't you?  (She cuddles with RAJAH, enjoying the\n        moment, until she looks up at her angry father. )\n        Ahem.\nSULTAN: Dearest, you've got to stop rejecting every suitor\n        that comes to call.  The law says you...\nBOTH:       ...must be married to a prince.\n\n(They walk over to a dove cage.)\n\nSULTAN: By your next birthday.\nJASMINE:    The law is wrong.\nSULTAN: You've only got three more days!\nJASMINE:    Father,  I hate being forced into this.  (She takes\n        a dove out of the cage and pets it.) If I do marry,\n        I want it to be for love.\nSULTAN: Jasmine, it's not only this law.  (She hands him\n        the dove, and he puts it back in the cage.) I'm not\n        going to be around forever, and I just want to make\n        sure you're taken care of, provided for.\nJASMINE:    Try to understand.  I've never done a thing on my\n        own. (She swirls her finger in the water of the\n        pond, petting the fish.)I've never had any real\n        friends. (RAJAH looks up at her and growls.)\n        Except you, Rajah.  (Satisfied, he goes back to\n        sleep.)  I've never even been outside the palace\n        walls.\nSULTAN: But Jasmine, you're a princess.\nJASMINE:    Then maybe I don't want to be a princess.  (She\n        splashes the water.)\nSULTAN: Oooohhh!  Allah forbid you should have any\n        daughters!\n\n(RAJAH looks up and thinks for a second.  JASMINE goes to the dove\n    cage and yanks open the door.  The birds fly off into freedom.\n      She watches them go.  Cut to int. of SULTAN's chambers.)\n\nSULTAN: I don't know where she gets it from.  Her mother\n        wasn't nearly so picky.  (A shadow falls over him.\n        He looks up startled and sees JAFAR.)  Ooh, oh.\n        Ah, Jafar--my most trusted advisor.  I am in\n        desperate need of your wisdom.\nJAFAR:  My life is but to serve you, my lord.  (He bows.)\nSULTAN: It's this suitor business.  Jasmine refuses to\n        choose a husband.  I'm at my wit's-end.\nIAGO:   (In the parrot voice) Awk!  Wit's-end.\nSULTAN: Oh, ha ha.  Have a cracker, pretty polly!  (He\n        pulls a cracker out from his pocket.  IAGO looks\n        terrified.  Then the SULTAN stuffs it in IAGO's\n        mouth.  IAGO grimaces as he tries to eat it.  JAFAR\n        and the SULTAN both laugh.)\nJAFAR:  Your majesty certainly has a way with dumb animals.\n        (IAGO glares at him.)  Now then, perhaps I can\n        divine a solution to this thorny problem.\nSULTAN: If anyone can help, it's you.\nJAFAR:  Ah, but it would require the use of the mystic blue\n        diamond.\nSULTAN: Uh, my ring?  But it's been in the family for\n        years.\nJAFAR:  It is necessary to find the princess a suitor.\n        (JAFAR says the word 'princess' with the accent on\n        the second syllable, \"cess.\"  He turns his staff\n        with a cobra head towards the SULTAN.  The eyes of\n        the staff begin to glow. The room darkens, JAFAR's\n        voice slows down and deepens.  The SULTAN's eyes\n        get a hypnotized look.)  Don't worry.  Everything\n        will be fine.\nSULTAN: Everything...will be...fine.\nJAFAR:  The diamond.\nSULTAN: Here, Jafar. Whatever you need will be fine.\n\n(The SULTAN removes his ring and hands it to JAFAR. The room returns\n    to normal as JAFAR pulls back the staff.)\n\nJAFAR:  You are most gracious, my liege.  Now run along and\n        play with your little toys.\nSULTAN: (Still hypnotized)  Yes...that'll be...pretty good.\n\n(JAFAR and IAGO exit.  We follow them. When they're out of the room,\n    the parrot spits out the cracker.)\n\nIAGO:       I can't take it anymore!  If I gotta choke down on\n        one more of those moldy, disgusting crackers...bam!\n        Whack!\n\n(JAFAR pulls a rope, which reveals a hidden entrance to his chambers.)\n\nJAFAR:  Calm yourself, Iago.\nIAGO:       Then I'd grab him around the head.  Whack! Whack!\nJAFAR:  (Speaking over IAGO.)  Soon, I will be sultan, not\n        that addlepated twit.\nIAGO:       And then I stuff the crackers down his throat!  Ha\n        ha!\n\n(The pair pass through a door and slam it shut.  Diss. to ext. gardens\n    at night.  A shadowy figure walks through.  We see it is JASMINE\n    in disguise.  She reaches the palace wall, then begins to climb it.\n      She is tugged from behind by RAJAH.)\n\nJASMINE:    Oh, I'm sorry, Rajah.  But I can't stay here and\n        have my life lived for me.  I'll miss you.(She\n        begins to climb again, and is helped up by RAJAH,\n        who begins to whine and whimper.)  Good bye!\n\n(She disappears over the wall. Cut to daytime on the street  ALADDIN\n    and ABU are up to their capers again.  They are on top of the\n    awning of a fruit stand.)\n\nALADDIN:        Okay, Abu.  Go!\n\n(ABU dips over the edge and looks at the PROPRIETOR.)\n\nPROPRIETOR: (To passing crowd)  Try this, your taste buds\n            will dance and sing. (ABU grabs a melon and\n            hangs there, distracting his attention.)  Hey,\n            get your paws off that.\nABU:            Blah blah blah!\nPROPRIETOR: Why, you!  Get away from here, you filthy ape!\n\n(He grabs the melon away from ABU.  But in the foreground, ALADDIN\n    dips down and snatches another melon from the stand.)\n\nABU:            Bye bye!\n\n(He zings back up.  The PROPRIETOR takes the melon to the front,\n    where he places it on top of a stack.  He looks confused, like\n    he has just done this.)\n\nALADDIN:    Nice goin' Abu.  Breakfast is served.\n\n(ALADDIN and ABU on the roof break open the melon and eat.  We see J\n    ASMINE walking through the street.)\n\nSHOPKEEPER 1:   Pretty lady, buy a pot.  No finer pot in brass\n            or silver.\nSHOPKEEPER 2:   Sugar dates, sugar dates and figs!  Sugar\n            dates and pistachios!\nSHOPKEEPER 3:   Would the lady like a necklace.  A pretty\n            necklace for a pretty lady.\n\n(She is charmed by the action, but is startled by a fish thrust\n    into her face.)\n\nSHOPKEEPER 4:   Fresh fish!  We catch 'em, you buy 'em!\nJASMINE:    I don't think so.  (She backs away, but bumps into\n        a fire eater, who is startled into swallowing his\n        fire.)  Oh, excuse me.  (He gulps, then belches\n        fire from his mouth.  JASMINE is disgusted.  He is\n        pleased and taps his stomach.  ALADDIN sees her,\n        and a strange look comes over his face.)  I'm\n        really very sorry.\nALADDIN:    (He's obviously deeply in love with her.)  Wow!\n\n(She pulls the hood of her cloak over her head.  ABU sees him and\n    jumps up on his shoulder, waving his hand in front of ALADDIN's\n    face.)\n\nABU:        Uh oh.  Hello?  Hello?\n\n(JASMINE stops at the fruit stand and sees a young homeless child\n    reaching for a piece of fruit.  She picks one up and gives it to\n    him.)\n\nJASMINE:        Oh, you must be hungry.  Here you go.  (The\n            boy runs off.)\nPROPRIETOR: You'd better be able to pay for that.\nJASMINE:        (Mystified) Pay?\nPROPRIETOR: No one steals from my cart!\nJASMINE:        Oh, I'm sorry sir.  I don't have any money.\nPROPRIETOR: Thief!\nJASMINE:        Please, if you let me go to the palace, I can\n            get some from the Sultan.\nPROPRIETOR: Do you know what the penalty is for stealing?\n\n(He takes her hand and pins it down on the table, intending to\n    chop it off.)\n\nJASMINE:        No, no please!\n\n(The sword drops, but his hand is stopped by ALADDIN's.)\n\nALADDIN:        Thank you kind sir.  I'm so glad you've found\n            her. I've been looking all over for you.\nJASMINE:        (whispering) What are you doing?\nALADDIN:        (whispering back) Just play along.\nPROPRIETOR: You know this girl?\nJASMINE:        Sadly, yes.  She is my sister.  She's a little\n            crazy.  (He circles his finger around his ear.\n            She is shocked.  The PROPRIETOR grabs him by\n            the vest.)\nPROPRIETOR: She said she knows the Sultan!\nALADDIN:        She thinks the monkey is the Sultan.\n\n(ABU is picking a pocket.  He hears this, then straightens up.\n    JASMINE, playing along, kneels and bows to ABU.)\n\nJASMINE:        Oh, wise Sultan.  How may I serve you?\nABU:            Well, blah blah blah blah.\nALADDIN:        Tragic, isn't it?  (He leans forward, picking\n            up another apple from the cart with his\n            foot.) But, no harm done.  (Walks over to\n            Jasmine.)  Now come along sis. Time to see the\n            doctor.\nJASMINE:        (To a camel standing nearby) Oh, hello doctor.\n            How are you?\nALADDIN:        No, no, no. Not that one. (To ABU, whose\n            pockets are bulging.) Come on, Sultan.\n\n(ABU bows to the crowd and everything he's stolen from the cart falls\n    out.)\n\nPROPRIETOR: Huh?  What is it?  (ABU picks up what he can\n            carry, and the trio run off.) Come back here,\n            you little thieves!\n\n(Cut to int. of JAFAR's lab.  IAGO is running on a gear in a bizarre\n    contraption.  At the top of the contraption is a storm brewing.)\n\nIAGO:       (huffing and puffing)  With all due respect, your\n        rottenness, couldn't we just wait for a real storm?\nJAFAR:  Save your breath, Iago.  Faster!  (He places the\n        SULTAN's ring in the contraption.)\nIAGO:       Yes, o mighty evil one.\n\n(IAGO runs faster.  A lightning bolt streaks through the ring, passing\n    into an hourglass below.  The sands begin to swirl.)\n\nJAFAR:  Ah, sands of time--reveal to me the one who can\n        enter the cave.  (The sand in top forms the Cave of\n        Wonders.  It falls through into a storm, but it\n        shows ALADDIN climbing up a ladder, followed by\n        JASMINE who is covered in her cloak.) Yes, yes!\n        There he is.  My diamond in the rough!\nIAGO:       That's him?!?!   That's the clown we've been\n        waitin' for? (IAGO loses his footing and is sucked\n        into the gears.)\nJAFAR:  Let's have the guards extend him an invitation to\n        the palace, shall we?\n\n(IAGO goes flying past and slams into the wall upside down.)\n\nIAGO:   Swell.\n\n(JAFAR laughs hideously, and the camera zooms in on the sandstorm with\n    ALADDIN in it.  Finally, we dissolve into the real ALADDIN climbing\n    to the top of the ladder, followed by JASMINE.)\n\nALADDIN:    Almost there.\n\n(JASMINE climbs over the top, but trips and falls into ALADDIN's arms.\n    She stands up.)\n\nJASMINE:    I want to thank you for stopping that man.\nALADDIN:    Uh, forget it.  (He grabs a pole.)  So, uh, this is\n        your first time in the marketplace, huh?\n\n(ALADDIN pole vaults to the next building, leaving JASMINE behind.)\n\nJASMINE:    Is it that obvious?\nALADDIN:    Well, you do kinda stand out.  (He stares at her,\n        still in love.  She returns the look.  But he\n        realizes what he is doing, and returns to normal.)\n        I mean, uh, you don't seem to know how dangerous\n        Agrabah can be. (He lays a plank between the\n        buildings for her to walk over, but as he is leaned\n        down, she vaults over his head.  He looks back in\n        surprise.  She tosses the pole to him.  Both\n        ALADDIN's and ABU's eyes bulge.)\nJASMINE:    I'm a fast learner.\nALADDIN:    Right.  C'mon, this way.  (They go inside the roof\n        of a building, dodging planks and beams as they\n        go.)  Whoa.  Watch your head there.  Be careful.\nJASMINE:    Is this where you live?\nALADDIN:    Yep.  Just me and Abu.  Come and go as we please.\nJASMINE:    Fabulous.\nALADDIN:    Well, it's not much, (he pulls back the curtain and\n        exposes the palace) but it's got a great view.\n        Palace looks pretty amazing, huh?\nJASMINE:    Oh, it's wonderful.\nALADDIN:    I wonder what it would be like to live there, to\n        have servants and valets...\nJASMINE:    Oh, sure.   People who tell you where to go and how\n        to dress.\nALADDIN:    It's better than here.  Always scraping for food\n        and ducking the guards.\nJASMINE:    You're not free to make your own choices.\nALADDIN:    Sometimes you feel so--\nJASMINE:    You're just--\nBOTH:       (in unison) --trapped.\n\n(They look at each other, realizing that they're perfect for one\n    another.  But ALADDIN then realizes where he is, and breaks the\n    look.  He takesthe apple out of ABU's hand and rolls it down his\n    arm into the hand of JASMINE.)\n\nALADDIN:    So, where're you from?\nJASMINE:    What does it matter?  I ran away, and I am not\n        going back.\nALADDIN:    Really?  (He takes a bite from the apple in his\n        hand, then hands it to ABU, who has a disgusted\n        look on his face.)\nABU:        Why you!\n\n(ALADDIN walks over and sits next to JASMINE.)\n\nJASMINE:    My father's forcing me to get married.\nALADDIN:    That's--that's awful.  (ABU appears from behind the\n        princess and tries to steal the apple.) Abu!\n\n(ABU races up to a higher point, chattering and cursing as he goes.)\n\nJASMINE:    What?\nALADDIN:    Abu says that--uh--that's not fair.\nABU:        What?\nJASMINE:    Oh did he?\nALADDIN:    Yeah, of course.\nJASMINE:    And does Abu have anything else to say?\nALADDIN:    Well, uh, he wishes there was something he could do\n        to help.\nABU:        Oh, boy!\nJASMINE:    Hmm, tell him that's very sweet.\n\n(ALADDIN and JASMINE have been getting closer and closer, until\n    ALADDIN leans in to kiss her.  He is interrupted, however,\n    by the GUARDS, who have found them.)\n\nGUARD:  Here you are!\nALADDIN and JASMINE:    They've found me!  (To each other) They're\n                after you?\nJASMINE:    My father must have sent them--\nALADDIN:    Do you trust me?\nJASMINE:    What?\nALADDIN:    Do you trust me? (He extends his hand)\nJASMINE:    Yes. (She takes it.)\nALADDIN:    Then jump!\n\n(They both jump off the roof, fall and land in a pile of salt.  They\n    try to get away, but the exit is blocked by a GUARD.)\n\nGUARD:  We just keep running into each other, don't we,\n        street rat?\n\n(Again, the GUARD's turban is pulled down by ABU, but more guards are\n    here and block the exit.  The first GUARD pulls ABU off his head and\n     throws him in a vase.  Three other GUARDS grab ALADDIN.)\n\nGUARD:  It's the dungeon for you, boy.\nALADDIN:    Hey, get off of me!\nJASMINE:    Let go of him.\nGUARD:  (Not realizing she is the princess) Look what we\n        have here, men--a street mouse.  (He throws her\n        down.)\nJASMINE:    (standing up and pulling off the hood of her cloak)\n        Unhand him, by order of the princess.\n\n(The GUARDS suddenly stop and bow, forcing ALADDIN to bow as well.)\n\nGUARD:  Princess Jasmine.\nALADDIN:    The princess?\nABU:        (peeking out from the vase) The princess?\nGUARD:  What are you doing outside the palace?  And with\n        this street rat?\nJASMINE:    That's not your concern.  Do as I command.  Release\n        him!\nGUARD:  Well, I would, princess, but my orders come from\n        Jafar.  You'll have to take it up with him.\n\n(The GUARDS drag ALADDIN out, bowing as they go.)\n\nJASMINE:    (getting a very pissed-off look) Believe me, I\n        will.\n\n(Cut to int. of palace, JAFAR emerging from his secret chambers.  He\n    slides the door shut carefully, but the princess comes storming\n    in before he is finished.  He slams it shut, pinning IAGO inside\n    the door frame.)\n\nJASMINE:    Jafar?\nJAFAR:  Oh, uh, princess.\nIAGO:       Awk! Jafar, I'm stuck!\nJAFAR:  How may I be of service to you? (He spreads out his\n        cape, hiding the door.)\nJASMINE:    The guards just took a boy from the market, on your\n        orders.\nJAFAR:  Your father's charged me with keeping peace in\n        Agrabah.  The boy was a criminal.\nJASMINE:    What was the crime?\nIAGO:       I can't breathe, Jafar!\nJAFAR:  Why, kidnapping the princess, of course.\nIAGO:       If you could just--(JAFAR kicks him back inside the\n        door and it slams shut)--wow, that hurt!\nJASMINE:    He didn't kidnap me! I ran away!\nJAFAR:  (Walking away as if shocked) Oh, dear!  Oh, why\n        frightfully upsetting.  Had I but known.\nJASMINE:    What do you mean?\nJAFAR:  Sadly, the boy's sentence has already been carried\n        out.\nJASMINE:    What sentence?\nJAFAR:  (with a sinister tone)  Death.  (JASMINE gasps.)\n        By beheading.\nJASMINE:    No!  (She collapses to the floor.)\nJAFAR:  I am exceedingly sorry, princess.\nJASMINE:    How could you?  (She runs from the room crying.)\n\n(IAGO finally makes it out through the door.  He flies up and lands on\n    JAFAR's shoulder, coughing.)\n\nIAGO:       So, how did  it go?\nJAFAR:  I think she took it rather well.  (They both get a\n        sinister smile on their faces.)\n\n(Diss. to JASMINE at night, crying at the edge of the fountain.  RAJAH\n    comes over to comfort her.  She pets him.)\n\nJASMINE:    It's all my fault, Rajah.  I didn't even know his\n        name.\n\n(Cut to int. of dungeon.  Rats scurry by, and we descend until we see\n    ALADDIN chained to the wall.)\n\nALADDIN:    (to himself) She was the princess.  I don't believe\n        it.  I must have sounded so stupid to her.\nABU:        (from a distance) Yoo-hoo!  Aladdin? Hello!\n\n(ABU appears at the window at the top of the dungeon.)\n\nALADDIN:    Abu!  Down here!  Hey, c'mon--help me outta these.\n\n(ABU stops, then begins chattering wildly, dropping to the ground.  He\n     wraps a cloth around his head and makes his eyes big in an\n     imitation of the princess.)\n\nALADDIN:    Hey, she was in trouble.  Ah, she was worth it.\n\n(ABU jumps up on ALADDIN's shoulders and pulls a small set of tools\n    out of his pocket, then frees ALADDIN.)\n\nABU:        Yeah, yeah, yeah.\nALADDIN:    Don't worry, Abu.  I'll never see her again.  I'm a\n        street rat, remember, and there's a law. She's\n        gotta marry a prince, she deserves it.\n\n(ABU finally frees ALADDIN's hands.)\n\nABU:        Ta da!\nALADDIN:    (Rubbing his wrists) I'm a--I'm a fool\nOLD MAN:    You're only a fool if you give up, boy.\n\n(We see an OLD MAN sitting in the corner that neither ALADDIN nor ABU\n    have seen before.)\n\nALADDIN:    Who are you?\nOLD MAN:    A lowly prisoner, like yourself.  But together,\n        perhaps we can be more.\nALADDIN:    I'm listening.\nOLD MAN:    There is a cave, boy.  A cave of wonders.  Filled\n        with treasures beyond your wildest dreams.\n        Treasure enough to impress even your princess, I'd\n        wager.\n\n(Listeners will note that the OLD MAN pronounced the word\n    'princess' as \"prin-CESS\" rather than the standard pronunciation\n     of \"PRIN-cess.\"   The OLD MAN turns his back, and IAGO sticks\n    his head out of JAFAR's \"old man\" disguise.)\n\nIAGO:       Jafar, can ya hurry it up?  I'm dyin' in here!\nALADDIN:    But the law says that only a prince can marry--\nOLD MAN:    You've heard of the golden rule, haven't you boy?\n        Whoever has the gold makes the rules.(He grins,\n        showing a hideously bad mouth.)\nALADDIN:    So why would you share all of this wonderful\n        treasure with me?\nOLD MAN:    I need a young man with strong legs and a strong\n        back to go in after it.\nALADDIN:    Ah, one problem.  It's out there, we're in here?\n\n(The OLD MAN walks to a wall and pushes open a hidden exit.)\n\nOLD MAN:    Mmm, mmm, mmm.,  Things aren't always what they\n        seem.  So, do we have a deal?\n\n(ALADDIN looks at ABU, who shrugs his shoulders.)\n\nABU:        Oh, hmm.\n\n(Cut to desert scene.  We see ALADDIN leading a horse with the\n    OLD MAN and ABU on it.  Diss. to cave of wonders.)\n\nCAVE:       Who disturbs my slumber?\nALADDIN:    It is I, Aladdin.\nCAVE:       Proceed.  Touch nothing but the lamp.\n\n(The cave opens up with a roar, and a staircase appears in front of\n<b>    ALADDIN. )\n</b>\nOLD MAN:    Remember, boy--first fetch me the lamp, and then\n        you shall have your reward.\nALADDIN:    C'mon, Abu.  (to ABU hiding under the shoulder of\n        his vest.)\n\n(ALADDIN begins to descend the staircase.  He reaches the bottom\n    and enters a golden chamber filled with treasure.)\n\nALADDIN:    Would ya look at that!\nABU:        Uh oh!\nALADDIN:    Just a handful of this stuff would make me richer\n        than the sultan!\n\n(ABU peeks out, sees the treasure, then bolts for it.)\n\nALADDIN:    Abu!\n\n(ABU stops in mid run, hovering over a rug on the floor.)\n\nALADDIN:    Don't...touch...anything!  We gotta find that lamp.\n\n(They begin to make their way through the room when the CARPET rises\n    off the floor and begins following them.  ABU gets the feeling\n    they're being followed.)\n\nABU:        Huh?\n\n(He turns, and the CARPET lies flat on the floor.  He continues, and\n    the CARPET begins to follow again.  Again, ABU turns back, but the\n     CARPET is rolled up and leaning against a pile of treasure. ABU\n     runs to ALADDIN and tugs his pant leg.)\n\nABU:        Aladdin!  Aladdin!\nALADDIN:    Abu, will ya knock it off?\n\n(Again the CARPET follows, but this time, when ABU turns, the carpet\n    jumps to the other side.  It reaches down with a tassel and pulls\n    ABU's tail.  When ABU jumps around, CARPET again goes to the other\n     side.  This time, ABU lands in a karate stance.  CARPET reaches\n    down and plucks ABU's hat off, then puts it on himself.  ABU sits\n    thinking for a second, until CARPET waves a tassel in front of his\n     face.  ABU and CARPET both jump scared, and run away.  ABU tackles\n     ALADDIN and turns his head to look at the CARPET.)\n\nALADDIN:    Abu, what are you--crazy?\n\n(The CARPET peeks out from behind a pile of treasure.)\n\nALADDIN:    A magic carpet!  C'mon.  C'mon out.  I'm not gonna\n        hurt you.\n\n(The CARPET slowly comes out, shyly, then picks up ABU's hat and dusts\n    it off.  It flies over to ALADDIN and hands the hat to ABU next to\n     him.  ABU screeches, and jumps onto ALADDIN's shoulder.)\n\nALADDIN:    Take it easy, Abu.  He's not gonna bite.\n\n(The CARPET again picks up ABU's hat and hands it to him.  ABU shakes\n    his fist and screeches at it.  CARPET begins to walk away, \"sadly.\")\n\nALADDIN:    Hey, wait a minute.  Don't go.  Maybe you can help\n        us.  (CARPET looks back, excited. It then flies\n        over and wraps around the pair.)  Hey, whoa!  You\n        see, we're trying to find this lamp.  (CARPET\n        motions for them to follow it.)  I think he knows\n        where it is.\n\n(They pass through a long cave, until they emerge in a giant\n    underground cavern.  In the centre of the room is a tall pillar,\n     with a staircase going up to it.  It is surrounded by water\n     with unevenly placed stones forming a bridge.  At the top of\n    the pillar is a beam of light.  ALADDIN begins to cross the bridge.)\n\nALADDIN:    Wait here!\nABU:        Oh.  Huh?\n\n(ABU sees a shrine with a golden monkey.  The outstretched paws hold a\n    giant ruby.  ABU is hypnotically drawn to it.   ALADDIN climbs the\n     stairs quickly.  CARPET sees ABU and grabs his tail trying in vain\n     to hold him back.  ALADDIN finally reaches the MAGIC LAMP.)\n\nALADDIN:    This is it?  This is what we came all the way down\n        here to--  (He looks down and sees ABU break free\n        of CARPET's hold and lunge toward the jewel.)  Abu-\n<b>        NO!\n</b>\n(ABU grabs the jewel.  There is a rumbling and the room begins to\n    shake.)\n\nCAVE VOICE: Infidels!\nABU:            Uh oh!\nCAVE VOICE: You have touched the forbidden treasure.  (ABU\n               places the jewel back into the paw, but the jewel\n                and the shrine melt into lava.) Now you\n                will never again see the light of day!\n\n(ALADDIN races down the steps, but they flatten into a ramp, and he\n    skies down until he flies into the air.  The water has turned into\n     lava.  He is falling toward it, when all of a sudden CARPET appears\n    and catches him.   ABU is standing on one of the rocks of the\n    bridge. He looks left and right and sees rocks exploding into lava.\n    Then CARPET races over and ALADDIN grabs him, just as the last rock\n     is exploding.)\n\nALADDIN:    Whoa!  Carpet, let's move!\n\n(Together, they race back through the caves dodging walls and falling\n    debris.  ABU grabs ALADDIN's head and covers his eyes.)\n\nALADDIN:    Abu, this is no time to panic!  (He pulls ABU off\n        his head and sees they are flying into a wall.)\n        Start panicking.\n\n(CARPET goes into a dive, then through another cave.  Finally, they\n    emerge through the internal entrance.  Outside, the cave begins to\n     growl and close.  CARPET and company are almost to the top when a\n    boulder drops on carpet, sending it to the floor.  ALADDIN  grabs\n    onto the rock wall and holds on.  He sees the OLD MAN at the top,\n    within reach.)\n\nALADDIN:    Help me out!\nOLD MAN:    Throw me the lamp!\nALADDIN:    I can't hold on.  Give me your hand.\nOLD MAN:    First give me the lamp!\n\n(ALADDIN reaches in and pulls out the MAGIC LAMP.  He hands it up, a\n    nd the OLD MAN raises it above his head.)\n\nOLD MAN:    Ha ha ha ha!  Yes!  At last!  Ha ha ha ha!\n\n(ALADDIN has climbed out with the assistance of ABU.  But the OLD\n     MAN kicks aside ABU and grabs ALADDIN's wrist.)\n\nALADDIN:    What are you doing?\nOLD MAN:    Giving you your reward.  (JAFAR returns to his\n        normal voice.) Your eternal reward.\n\n(He pulls out a crooked dagger and is about to stab ALADDIN, when\n    ABU bites him on the wrist.  He screams, but lets go of ALADDIN,\n     who falls into the cave.  OLD MAN throws ABU into the cave as\n     well.  They fall.  CARPET sees this, but is pinned under a\n     boulder.  It struggles to break free, then does.  It races\n     up and catches ALADDIN, but he has already hit the wall several\n    times, and is unconscious.  On the surface, the cave roars one\n    final time, then sinks back into the sand.  JAFAR pulls off\n     his disguise.)\n\nJAFAR:  Heh heh heh! It's mine.  It's all mine! I (He can't\n        find it in his pocket)--- where is it?  No. NO!!\n\n(Kiss fade to JASMINE's bedroom.  She is sitting on her bed, next\n    to RAJAH who looks sad. The SULTAN walks in.)\n\nSULTAN: Jasmine?  Oh, dearest.  What's wrong?\nJASMINE:    Jafar...has...done something... terrible.  (She\n        looks as if she's been crying.)\nSULTAN: There, there, there, my child--we'll set it right.\n        Now, tell me everything.\n\n(Cut to int. of cave.  ALADDIN lies unconscious on the CARPET.\n    ABU tries to wake him.)\n\nABU:        Oh, oh. Aladdin?  Wake up.  Aladdin.\n\n(CARPET rises up, lifting ALADDIN up.  He awakes slowly.)\n\nALADDIN:    Oh, my head. (He looks at the entrance sealed in.)\n        We're trapped.  (Angry, shaking his fists at the\n        entrance) That two faced son-of-a-jackal!  (Calmer)\n        Whoever he was, he's long gone with that lamp.\nABU:        Aha!\n\n(ABU pulls out the MAGIC LAMP.)\n\nALADDIN:    Why, you hairy little thief!  Looks like such a\n        beat-up, worthless piece of junk.  Hey, I think\n        there's something written here, but it's hard to\n        make out.\n\n(He rubs the LAMP.  Suddenly smoke comes out of the hole, the\n    LAMP begins to shake and glow, but ALADDIN holds onto the\n    LAMP, and our wonderful friend, the GENIE comes out.)\n\nGENIE:  Aaaaahhhhh!  OY!  Ten-thousand years will give ya\n        such a crick in the neck!  (He hangs ALADDIN on a\n        nearby rock.  Then he pulls his head off and spins\n        it around, yelling as he does so.  CARPET pulls a\n        ALADDIN down.)  Whoa!  Does it feel good to be\n        outta there! (GENIE uses the lamp end of himself as\n        a microphone.) Nice to be back, ladies and\n        gentlemen.  Hi, where ya from? (Sticks the mic in\n        ALADDIN's face.)  What's your name?\nALADDIN:    Uh, Al--uh--Aladdin.\nGENIE:  (Says his name as if he's discovered something\n        major) Aladdin! (A neon sign lights up with\n        ALADDIN's name on it, circled by chase lights.  The\n        sign changes to reflect the GENIE's upcoming line.)\n        Hello, Aladdin.  Nice to have you on the show.  Can\n        we call you 'Al?' Or maybe just 'Din?'  Or how\n        bout 'Laddi?'  (GENIE disappears, then a dog\n        wrapped in plaid jumps in.) Sounds like 'Here, boy!\n        C'mon, Laddi!'\nALADDIN:    (Shaking his head) I must have hit my head harder\n        than I thought.\nGENIE:  (Still a dog) Do you smoke?  Mind if I do? (Dog\n        poofs into smoke, then back to the GENIE.  ABU\n        screeches wildly.)  Oh, sorry Cheetah--hope I\n        didn't singe the fur!  Hey, Rugman!  Haven't seen\n        you in a few millennia!  Slap me some tassel!  Yo!\n        Yeah! (CARPET flies over and high fives the GENIE.\n        GENIE looks at ALADDIN.)  Say, you're a lot smaller\n        than my last master. (Lifts his beer-gut.)  Either\n        that or I'm gettin' bigger.  Look at me from the\n        side--do I look different to you?\nALADDIN:    Wait a minute!  I'm--your master?\nGENIE:  (Slaps a diploma in ALADDIN's hand and a\n        mortarboard on his head.)  That's right!  He can\n        be taught!! What would you wish of me, (as Arnold\n        Schwarzenegger)  the ever impressive,(inside a\n        cube) the long contained, (as a ventriloquist with\n        a dummy) often imitated, (tosses the dummy aside)\n        but never duplicated--\n\n(He multiplies into multiple GENIES who surround him.)\n\nDUP. GENIES:    Duplicated, duplicated,  duplicated,\n            duplicated,  duplicated,  duplicated,\n            duplicated, duplicated, duplicated.\nGENIE:  (Says it like a ring announcer at a boxing match.)\n        Genie!  Of!  The Lamp!  (Goes into Ed\n        Sullivan)  Right here direct from the lamp, right\n        here for your enjoyment wish fulfillment.\n        Thank youuuuu!\nALADDIN:    Whoa!  Wish fulfillment?\nGENIE:  Three wishes to be exact.  And ix-nay on the\n        wishing for more wishes.  (Turns into a slot\n        machine, arm pulls down and three GENIEs appear in\n        the windows.)  That's it--three.  (Three GENIE\n        caballeros come out of the slot.)  Uno, dos, tres.\n        (Changes into b/w Groucho Marx.)  No\n        substitutions, exchanges or refunds.  (The duck\n        drops with the secret word \"Refunds.'\nALADDIN:    (To ABU) Now I know I'm dreaming.\nGENIE:  (Music for \"Friend Like Me\" begins) Master, I don't\n        think you quite realize what you've got here! So\n        why don't you just ruminate, whilst I illuminate\n        the possibilities.  (GENIE lights up like a\n        fluorescent light)\n\n    Well Ali Baba had them forty thieves\n    Scheherazadie had a thousand tales\n    But master you in luck 'cause up your sleeve\n    You got a brand of magic never fails!\n\n(GENIE produces 40 thieves who surround ALADDIN with swords.\n    GENIE appears in his vest, then sticks his arms out and boxes\n    the thieves into submission.)\n\n    You got some power in your corner now\n    Some heavy ammunition in your camp\n    You got some punch, pizzazz, yahoo and how\n    See all you gotta do is rub that lamp\n    And I'll say\n\n(Boxing ring appears, ALADDIN in the corner, being massaged\n    by GENIE.  Then GENIE turns into a pile of fireworks and\n    explodes.  Then GENIE appears inside lamp and grabs ALADDIN's\n     hand and rubs lamp with it.)\n\n    Mister Aladdin sir\n    What will your pleasure be?\n    Let me take your order, jot it down\n    You ain't never had a friend like me\n    No no no!\n\n(GENIE produces a table and chairs, then writes down things on a\n    note pad, like a waiter. )\n\n    Life is your restaurant\n    And I'm your maitre' d!\n    C'mon whisper what it is you want\n    You ain't never had a friend like me.\n\n(GENIE appears as a plate of chicken, then returns to normal,\n    but enlarges his ear to listen to ALADDIN.  Finally, he explodes\n     into four duplicate GENIEs.)\n\n    Yes sir, we pride ourselves on service\n    You're the boss, the king, the shah!\n    Say what you wish, it's yours!  True dish\n    How about a little more Baklava?\n\n(The GENIEs give him a shave, haircut and manicure, then ALADDIN\n    appears in a comfy chair (eh?)  surrounded by the treasure\n    and being fanned by women.  The GENIE appears and fills the\n    screen with baklava.)\n\n    Try some of column 'A'\n    Try all of column 'B'\n    I'm in the mood to help you dude\n    You ain't never had a friend like me\n\n(ALADDIN rises up on a column of food with a giant A on top,\n    then jumps to another column with a B on top.  He falls off\n    and is caught by a cushion held by GENIE.  He opens his mouth,\n    and his tongue turns into a staircase.  A miniature GENIE\n     dressed like a magician comes out.)\n\n(The mini GENIE does a little dance with the GENIE's two giant\n    hands.  At the end, they surround the mini GENIE and squish\n    him into nothing.)\n\n    Can your friends do this?\n    Do your friends do that?\n    Do your friends pull this out their little hat\n    Can your friends go poof!\n    Well looky here\n    Can your friends go Abracadabra, let 'er rip\n    And then make the sucker disappear?\n\n(The GENIE pulls off his head, duplicates it, then juggles them.\n    He tosses them to ALADDIN, who juggles with one hand and spins\n    one of the heads on his fingertip like a basketball.  He tosses\n     the heads back onto the GENIE, who proceeds to try and pull\n     himself out of a hat at his base.  He spirals around and around\n     until he turns into a white rabbit.  The rabbit transforms into\n    a purple dragon (very reminiscent of Figment from EPCOT Center).\n     The dragon breathes fire, which turns into three HAREM GIRLS,\n    who dance around ALADDIN.  Just as he begins to enjoy them,\n     they disappear.)\n\n    So don't you sit there slack jawed, buggy eyed\n    I'm here to answer all your midday prayers\n    You got me bona fide, certified\n    You got a genie for a charg? d'affairs!\n    I got a powerful urge to help you out\n    So what you wish I really want to know\n    You got a wish that's three miles long, no doubt\n    So all you gotta do is rub like so, and oh!\n\n\n(GENIE imitates what he is calling ALADDIN, then turns into a\n    certificate which rolls up and surrounds ALADDIN.  GENIE pulls\n     a list {written in Arabic} out of ALADDIN's ear, which he uses\n    to rub his behind like drying off after a shower.)\n\n    Mister Aladdin, sir, have a wish or two or three\n    I'm on the job, you big nabob\n    You ain't never had a friend, never had a friend\n    You ain't never had a friend, never had a friend\n    You ain't never...had a... friend... like...me!\n    You ain't never had a friend like me!\n\n(The dancing HAREM GIRLS reappear, and ALADDIN leans in to kiss one.\n     She turns into the GENIE, who zaps four dancing elephants into\n    existence.  To the other direction, he zaps in four dancing camels,\n     and a grand finale dancing number ensues.  ABU grabs as much gold\n     as he can, but the GENIE wraps everything up in a cyclone and\n    zaps it away until they're all back in the cave.  GENIE has a\n    neon \"APPLAUSE\" sign on his back. ABU turns his hat over and\n    sees that is is empty.)\n\nGENIE:  So what'll it be, master?\nALADDIN:    You're gonna grant me any three wishes I want?\nGENIE:  (As William F. Buckley) Ah, almost.  There are a\n        few provisos, a couple of quid pro quos\nALADDIN:    Like?\nGENIE:  Ah, rule number one: I can't kill anybody.  (He\n        slices his head off with his finger.)  So don't\n        ask.  Rule two: I can't make anyone fall in love\n        with anyone else.  (Head turns into a big pair of\n        lips which kiss ALADDIN.)  You little punim, there.\n        (Lies flat, then gets up and transforms into a\n        zombie.) Rule three: I can't bring people back from\n        the dead.  It's not a pretty picture, (He grabs\n        ALADDIN and shakes him) I don't like doing it!  (He\n        poofs back to normal.)  Other than that, you got\n        it!\nALADDIN:    (Looks at ABU as if plotting) Ah, provisos?  You\n        mean limitations?  On wishes? (To ABU) Some all\n        powerful genie--can't even bring people back from\n        the dead. I don't know, Abu--he probably can't even\n        get us out of this cave.  Looks like we're gonna\n        have to find a way out of here--\n\n(They start to leave, but a big blue foot stomps down in front of\n    them.)\n\nGENIE:  Excuse me?  Are you lookin' at\n        me?  Did you rub my lamp? Did you wake me up, did\n        you bring me here?  And all of a sudden, you're\n        walkin' out on me?  (Gets madder and madder) I\n        don't think so, not right now.  You're gettin' your\n        wishes, so siddown!  (They all get on CARPET.\n        GENIE takes the form of a stewardess, with lots of\n        arms pointing out the exits.)  In case of\n        emergency, the exits are here, here, here,\n        here,here, here, here, here, here, here, here,\n        here, anywhere!  Keep your hands and arms inside\n        the carpet.  Weeee'rrrrrreee...outta here!\n\n(The CARPET and passengers fly out of the sand in the desert and off\n    into the distance.  Cut to int. of SULTAN's chamber. JAFAR is\n    there with IAGO, JASMINE and the SULTAN.)\n\nSULTAN: Jafar, this is an outrage.  If it weren't for all\n        your years of loyal service... . From now on,\n        you are to discuss sentencing of prisoners with me,\n        before they are beheaded.\nJAFAR:  I assure you, your highness, it won't happen again.\nSULTAN: Jasmine, Jafar, now let's put this whole messy\n        business behind us.  Please?\nJAFAR:  My most abject and humblest apologies to you as\n        well, princess.  (He takes her hand to kiss it, but\n        she yanks it away.)\nJASMINE:    At least some good will come of my being forced to\n        marry.  When I am queen, I will have the\n        power to get rid of you.\nSULTAN: That's nice.  All settled, then.  Now, Jasmine,\n        getting back to this suitor business, (he\n        looks and sees Jasmine walking out) Jasmine?\n        Jasmine!  (He runs after her.)\nJAFAR:  If only I had gotten that lamp!\nIAGO:       (As JASMINE) I will have the power to get rid of\n        you!  D'oh!  To think--we gotta keep kissing\n        up to that chump, and his chump daughter for the\n        rest of our lives...\nJAFAR:  No, Iago.  Only until she finds a chump husband.\n        Then she'll have us banished--or beheaded!\nBOTH:       Eeewww!\nIAGO:       (Has an idea) Oh!  Wait a minute!  Wait a minute!\n        Jafar?  What if you were the chump husband?\nJAFAR:  (He looks at IAGO in insult)  What?\nIAGO:       Okay, you marry the princess,all right? Then, uh,\n        you become sultan!\nJAFAR:  Oh!Marry the shrew?  I become sultan.  The idea has\n        merit!\nIAGO:       Yes, merit! Yes!  And then we drop papa-in-law and\n        the little woman off a cliff!  (Dive bombs into the\n        floor)  Kersplat!\nJAFAR:  Iago, I love the way your foul little mind works!\n\n(Both laugh as we cut to an oasis in the desert, where CARPET is\n    coming in for a landing.)\n\nGENIE:  (Still as stewardess) Thank you for choosing Magic\n        Carpet for all your travel needs.  Don't stand\n        until the rug has come to a complete stop.  (As\n        ALADDIN and ABU get off down the stairway formed by\n        CARPET) Thank you.  Good bye, good bye!  Thank you!\n        Good bye!  (Back to normal)  Well, now.  How about\n        that, Mr.  doubting mustafa?\nALADDIN:    Oh, you sure showed me.  Now about my three wishes-\nGENIE:  Dost mine ears deceive me?  Three? You are down by\n        ONE, boy!\nALADDIN:    Ah, no--I never actually wished to get out of the\n        cave.  You did that on your own.\n\n(GENIE thinks for a second, then his jaw drops.  He turns into a\n    sheep.)\n\nGENIE:  Well, don't I feel just sheepish?  All right, you\n        baaaaad boy,  but no more freebies.\nALADDIN:    Fair deal.  So, three wishes.  I want them to be\n        good.  (To GENIE) What would you wish for?\n\n(GENIE is hanging like a hammock between two trees.)\n\nGENIE:  Me?  No one's ever asked me that before. Well, in\n        my case, ah, forget it.\nALADDIN:    What?  No, tell me.\nGENIE:  Freedom.\nALADDIN:    You're a prisoner?\nGENIE:  It's all part-and-parcel, the whole genie gig.\n        (Grows gigantic, voice echoes) Phenomenal cosmic\n        powers!  (Shrinks down, cramped in MAGIC LAMP.)\n        Itty bitty living space\nALADDIN:    Genie, that's terrible.\nGENIE:  (Comes out of the LAMP) But, oh--to be free.  Not\n        have to go \"Poof! What do you need? Poof! What do\n        you need? Poof! What do you need?\"  To be my own\n        master, such a thing would be greater than all the\n        magic and all the treasures in all  the world! But\n        what am I talking about, here?  Let's get real\n        here.  It's not gonna happen.  Genie, wake up and\n        smell the hummus\nALADDIN:    Why not?\nGENIE:  The only way I get outta this is if my master\n        wishes me out.  So you can guess how often that's\n        happened.\nALADDIN:    I'll do it. I'll set you free.\nGENIE:  (Head turns into Pinocchio's with a long nose) Uh\n        huh, right.  Whoop!\nALADDIN:    No, really, I promise.  (He pushes the nose back in\n        and GENIE's head returns to normal.) After make my\n        first two wishes, I'll use my third wish to set you\n        free.   (He holds out his hand)\nGENIE:  Well, here's hopin'.  (Shakes ALADDIN's hand.)\n        O.K.   Let's make some magic!  (Turns into a\n        magician.)  So how 'bout it.  What is it you want\n        most?\nALADDIN:    Well, there's this girl--\nGENIE:  Eehhh! (Like a buzzer, and GENIE's chest shows a\n        heart with a cross through it.)  Wrong!  I can't\n        make anybody fall in love, remember?\nALADDIN:    Oh, but Genie.  She's smart and fun and...\nGENIE:  Pretty?\nALADDIN:    Beautiful.  She's got these eyes that just...and\n        this hair, wow...and her smile.\nGENIE:  (Sitting in a Parisian cafe with ABU and CARPET.)\n        Ami.  C'est l'amour.\nALADDIN:    But she's the princess.  To even have a chance, I'd\n        have to be a--hey, can you make me a prince?\nGENIE:  Let's see here.  (Has a \"Royal Cookbook\".) Uh,\n        chicken a'la king? (Pulls out a chicken with a\n        crown on its head)  Nope.  Alaskan king crab?\n        (Yanks out his finger, and we see SEBASTIAN the crab from\n        \"The Little Mermaid\"  clamped on.)  Ow, I\n        hate it when they do that.  Caesar's salad? (A\n        dagger comes out and tries to stab him.) Et tu,\n        Brute?  Ah, to make a prince.  (Looks slyly at\n        ALADDIN.)  Now is that an official wish?  Say the\n        words!\nALADDIN:    Genie, I wish for you to make me a prince!\nGENIE:  All right!  Woof woof woof woof! (Takes on square\n        shoulders and looks like Arsenio Hall. Then becomes\n        a tailor/fashion designer.)  First, that fez and\n        vest combo is much too third century. These\n        patches--what are we trying to say--beggar?  No!\n        Let's work with me here. (He takes ALADDIN's\n        measurements, snaps his fingers and ALADDIN is\n        outfitted in his prince costume.)  I like it, muy\n        macho!  Now, still needs something.  What does it\n        say to me?  It says mode of transportation.  Excuse\n        me, monkey boy!  Aqui, over here!  (ABU tries to\n        cover himself with CARPET, but GENIE zaps him and\n        he flies over.)\nABU:        Uh oh!\nGENIE:  Here he comes, (ALADDIN and GENIE are on a game\n        show set, where ALADDIN stands behind a podium with\n        \"AL\" on it.)  And what better way to make your\n        grand entrance on the streets of Agrabah, than\n        riding your very own brand new camel!  Watch out,\n        it spits!  (A door bearing the GENIE's head on it\n        opens, where ABU is transformed into a camel.  He\n        spits out the side of his mouth on cue.  But the\n        GENIE's not sure.)  Mmm, not enough.  (He snaps his\n        fingers and ABU turns into a fancy white horse.)\n        Still not enough.  Let's see.  What do you need?\n        (The GENIE snaps his fingers repeatedly, turning\n        ABU into:  a duck, an ostrich, a turtle, and a '57\n        Cadillac, with license plate \"ABU 1.\"   (That one's\n        a guess, I don't know cars, but judging by the tail\n        fins, 'nuff said.)  Finally, he's returned to\n        normal.)  Yes!!  Esalalumbo,  shimin dumbo!  Whoa!!\n        (And on the keyword of the spell, Dumbo, ABU turns\n        into an elephant.  CARPET struggles to get out from\n        under ABU's size 46 feet.)  Talk about your trunk\n        space, check this action out!\n\n(ABU sees his reflection in a pool of water, then jumps into a tree.\n     The tree naturally bends right back down to the ground, where ABU\n     hangs on and looks at ALADDIN upside down.)\n\nALADDIN:    Abu, you look good.\nGENIE:  He's got the outfit, he's got the elephant, but\n        we're not through yet.  Hang on to your turban,\n        kid, cause we're gonna make you a star!\n\n(We zoom out slowly with the oasis in the distance, as fireworks\n    begin to explode outward.  Cut to a CU of a pile of toys.\n    (Look for the BEAST here.)  We tilt up and see the SULTAN\n    balancing them.  He carefully balances the last piece on top,\n     then sits back and sighs.  JAFAR storms in, though, and the\n    pile collapses.)\n\nJAFAR:  Sire, I have found a solution to the problem with\n        your daughter.\nIAGO:   Awk!  The problem with your daughter!\nSULTAN: Oh, really?\nJAFAR:  (Unrolling a scroll) Right here.  \"If the princess\n        has not chosen a husband by the appointed time,\n        then the sultan shall choose for her.\"\nSULTAN: But Jasmine hated all those suitors!  (He tries to\n        stuff a cracker into IAGO's mouth.  IAGO backs\n        away.  The SULTAN absentmindedly pulls the cracker\n        back.)  How could I choose someone she hates?\n        (IAGO is relieved, but the SULTAN quickly stuffs a\n        cracker in his mouth.)\nJAFAR:  Not to worry, my liege.  There is more.  If, in the\n        event a suitable prince cannot be found, a princess\n        must then be wed to...hmm...interesting.\nSULTAN: What?  Who?\nJAFAR:  The royal vizier!  Why, that would be...me!\nSULTAN: Why, I thought the law says that only a prince can\n        marry a princess, I'm quite sure.\nJAFAR:  Desperate times call for desperate measures, my\n        lord.  (He pulls out the staff and hypnotizes the\n        SULTAN with it.)\nSULTAN: Yes...desperate measures...\nJAFAR:  You will order the princess to marry me.\nSULTAN: I...will order...the princess...to...(the spell\n        breaks momentarily)...but you're so old!\nJAFAR:  (Holds the staff closer) The princess will marry\n        me!\nSULTAN: The princess will marry...(the spell is again\n        broken, this time by the trumpet fanfare of \"Prince\n        Ali\".)  What? What is that?  That music!  Ha ha ha.\n        Jafar., you must come and see this!\n\n(We see an advancing parade, led by what appears to be the GENIE in\n    human form as a MAJOR.)\n\nMARCHERS:   Make way for Prince Ali!\nSWORDSMEN: Say hey!  It's Prince Ali!\nMAJOR:  Hey, clear the way in the old bazaar,\n    Hey you, let us through, it's a bright new star,\n    Now come, be the first on your block to meet his eye!\n    Make way, here he comes,\n    Ring bells, bang the drums.\n    You're gonna love this guy\n\n(The MAJOR mingles amongst different crowd members.)\n\n    Prince Ali, fabulous he, Ali Ababwa!\n    Genuflect, show some respect\n    Down on one knee\n\n(ABU the elephant marches through town, with ALADDIN (ALI) on his back.)\n\n    Now try your best to stay calm\n    Brush up your Sunday Salaam\n    And come and meet his spectacular coterie.\n\n(IAGO is dancing to the music until JAFAR glares at him.  The\n    MAJOR \"wheelbarrows\" six men up onto ABU's trunk.  They stand\n    on each other's shoulders as ALI shakes hands.)\n\n    Prince Ali, mighty is he, Ali Ababwa!\n    Strong as ten regular men, definitely\n    He faced the galloping hordes\n    A hundred bad guys with swords\n    Who sent those goons to their lords, why Prince Ali!\n\n(The pile collapses on ALI, but a GENIE (tm) brand lightning bolt\n    zaps the pile and he ends up holding them all up in an acrobatic\n     wheel formation.  The GENIE turns into an old man, then a child\n    and speaks the last two lines to the crowd.)\n\nCHORUS OF MEN:(Carrying the camels) He's got seventy-five golden camels!\n\n(In pops a typical parade commentator)\n\nHARRY:  Don't they look lovely, June?\n\nCHORUS OF WOMEN:    (On a float)  Purple peacocks, he's got fifty-three!\n\n(In comes another commentator.)\n\nJUNE:   Fabulous, Harry, I love the feathers!\n\nGENIE:  (GENIE is off screen, a giant balloon gorilla proceeds down\n            the parade)\n    When it comes to exotic type mammals\n    Has he got a zoo, I'm telling you\n    It's a world class menagerie!\n\n(GENIE pops in as a leopard, then a goat, and speaks the last two\n    lines to the two children from earlier.  We cut to a balcony,\n    where three HAREM GIRLS are joined by the HAREM GENIE.)\n\n<b>    GENIE:\n</b>        GIRLS: (in couterpoint)\n    Prince Ali, Handsome is he, Ali Ababwa\n        There's no question this Ali's alluring\n    That physique, how can I speak\n        Never ordinary, never boring\n    Weak at the knee\n        Everything about the man just plain impresses\n    Well, get on out in that square\n        He's a wonder, he's a whiz, a wonder\n    Adjust your veil and prepare\n        He's about to pull my heart asunder\n    To gawk and grovel and stare at Prince Ali!\n        And I absolutely love the way he dresses!\n\n(JASMINE has been watching from the balcony of the palace.  She\n    humphs it off, then leaves.)\n\nCHORUS: He's got ninety-five white Persian monkeys!\n    (He's got the monkeys, let's see the monkeys!)\n    And to view them, he charges no fee!\n    (He's generous, so generous)\n    He's got slaves, he's got servants and flunkies!\n    (Proud to work for him)\n    They bow to his whim, love serving him\n    They're just lousy with loyalty to Ali!  Prince Ali!\n\n(ALADDIN throws gold coins out to the people, who rush over to\n    collect them.  ABU and the parade march up the steps of the\n    palace and inside.  The SULTAN runs back inside to the door\n    to the throne room, but JAFAR stands in front of the door.\n    Suddenly, it bursts open, with ABU leading the way, and crushing\n     JAFAR and IAGO behind the door.)\n\nGENIE:  Prince Ali!\n    Amorous he!  Ali Ababwa\n    Heard your princess was a sight lovely to see!\n    And that,good people, is why\n    He got dolled up and dropped by\n    With sixty elephants, llamas galore\n    With his bears and lions\n    A brass band and more\n    With his forty fakirs, his cooks, his bakers\n    His birds that warble on key\n    Make way for Prince Ali!\n\n(More and more fanfare build up until ALADDIN flies off ABU's back\n    on MAGIC CARPET and flies down to the SULTAN.  JAFAR slams the\n     door shut.)\n\nSULTAN: (Clapping) Splendid, absolutely marvelous.\nALADDIN:    (Takes on a deeper voice.)  Ahem.  Your majesty, I have\n            journeyed from afar to seek your daughter's hand.\nSULTAN: Prince Ali Ababwa!  Of course.  I'm delighted to\n        meet you.  (He rushes over and shakes ALI's hand.)\n        This is my royal vizier, Jafar.  He's delighted\n        too.\nJAFAR:  (Extremely dryly) Ecstatic.  I'm afraid, Prince\n        Abooboo--\nALADDIN:    --Ababwa!\nJAFAR:  Whatever.  You cannot just parade in here uninvited\n        and expect to--\nSULTAN: ...by Allah, this is quite a remarkable device.\n        (He tugs at the tassels, and they tug his\n        moustache.)  I don't suppose I might...\nALADDIN:    Why certainly, your majesty.  Allow me.\n\n(He helps the SULTAN up onto the CARPET, and he plops down.\n    JAFAR pins the CARPET down on the floor with the staff.)\n\nJAFAR:  Sire, I must advise against this--\nSULTAN: --Oh, button up, Jafar.  Learn to have a little fun.\n\n(He kicks away the staff and CARPET and SULTAN fly away.  IAGO, who\n    was standing on the head of the staff, falls down, repeatedly\n     bopping the staff with his beak as he descends.  SULTAN and\n    CARPET fly high into the ceiling, then begin a dive-bomb attack,\n     flying under ABU, scaring him.  The flight continues in the\n    background, while JAFAR and ALI talk in the foreground.)\n\nJAFAR:  Just where did you say you were from?\nALADDIN:    Oh, much farther than you've traveled, I'm sure.\n        (He smiles.  JAFAR does not.)\nJAFAR:  Try me.  (IAGO lands on the staff.)\nSULTAN: Look out, Polly!\n\n(They all duck in time as the CARPET whizzes centimetres over their\n    heads.  CARPET returns and the SULTAN chases IAGO around the room.)\n\nIAGO:       Hey, watch it. Watch it with the dumb rug!\n\n(The CARPET zooms underneath IAGO, who sighs, wipes his brow, and\n    crashes into a pillar.  He crashes to the floor, and his head\n    is circled by miniature SULTANS on CARPETS, saying \"Have a cracker,\n    have a cracker.  The real SULTAN begins his final approach.)\n\nSULTAN: Out of the way, I'm coming in to land.  Jafar,\n        watch this!  (He lands.)\nJAFAR:  Spectacular, your highness.\nSULTAN: Ooh, lovely.  Yes, I do seem to have a knack for\n        it.  (CARPET walks over to ABU dizzily, then\n        collapses.  ABU catches it.)  This is a very\n        impressive youth. And a prince as well.   (Whispers\n        to JAFAR) If we're lucky, you won't have to marry\n        Jasmine after all.\nJAFAR:  I don't trust him, sire.\nSULTAN: Nonsense.  One thing I pride myself on Jafar, I'm\n        an excellent judge of character.\nIAGO:   Oh, excellent judge, yeah, sure...not!!!\n\n(JASMINE walks in quietly.)\n\nSULTAN: Jasmine will like this one!\nALADDIN:    And I'm pretty sure I'll like Princess Jasmine!\nJAFAR:  Your highness, no.  I must intercede on Jasmine's\n        behalf.  (JASMINE hears this and gets mad.) This\n        boy is no different than the others.  What makes\n        him think he is worthy of the princess?\nALADDIN:    Your majesty, I am Prince Ali Ababwa! (He pricks\n        JAFAR's goatee, which springs out in all\n        directions.)  Just let her meet me.  I will win\n        your daughter!\nJASMINE:    How dare you!  (They all look at her surprised.)\n        All of you, standing around deciding my future?  I\n        am not a prize to be won!  (She storms out.)\nSULTAN: Oh, dear.  Don't worry, Prince Ali.  Just give\n        Jasmine time to cool down.  (They exit.)\nJAFAR:  I think it's time to say good bye to Prince\n        Abooboo.\n\n(Diss to JASMINE on her balcony at night.  We tilt down and find\n    ALADDIN and company in the courtyard.)\n\nALADDIN:    What am I going to do?  Jasmine won't even let me\n        talk to her.  I should have known I couldn't pull\n        off this stupid prince wish.  (ABU struggles with\n        his elephant paws to open a banana.  He squishes\n        it, and the banana squirts into his eye.  He then\n        tosses the banana peel into a heaping pile of the\n        same.)\nGENIE:  (to carpet, playing chess) So move!  (CARPET does,\n        knocking a black piece off the board.)  Hey.\n        That's a good move.  (As Rodney Dangerfield) I\n        can't believe it--I'm losing to a rug.\nALADDIN:    Genie, I need help.\nGENIE:  (as Jack Nicholson) All right, sparky, here's the\n        deal.  You wanna court the little lady, you gotta\n        be a straight shooter, do ya follow me?\nALADDIN:    What?\nGENIE:  (Back to normal, wearing a mortarboard. He points\n        out his words on a blackboard)  Tell her\n        the...TRUTH!!!\nALADDIN:    No way!  If Jasmine found out I was really some\n        crummy street rat, she'd laugh at me. (He\n        puts on his turban, which lights up as the GENIE.)\nGENIE:  A woman appreciates a man who can make her laugh!\n        (ALADDIN pulls the chain turning off the light.\n        GENIE comes out holding the real turban.)  Al, all\n        joking aside, you really oughtta be yourself.\nALADDIN:    Hey, that's the last thing I want to  be.  Okay,\n        I'm gonna go see her.  I gotta be smooth, cool,\n        confident.  How do I look?\nGENIE:  (Sadly) Like a prince.\n\n(ALADDIN flies up to the balcony on CARPET.  JASMINE is on her bed,\n    sighing.  RAJAH is by her side.)\n\nALADDIN:    (From a distance) Princess Jasmine?\n\n(RAJAH looks up and growls.)\n\nJASMINE:    Who's there?\nALADDIN:    It's me--Prince Ali.  Ahem--(Then he jumps to his\n        deep voice) Prince Ali Ababwa.\nJASMINE:    I do not want to see you.\nALADDIN:    No, no, please princess.  Give me a chance. (RAJAH\n        growls and advances on him.)\nJAFAR:  Just leave me alone.\nALADDIN:    Down kitty!\n\n(Over the edge of the balcony, CARPET is watching with GENIE below.)\n\nGENIE:  How's our beau doing?\n\n(CARPET cuts his neck with his finger.)\n\nALADDIN:    Good kitty, take off.  Down kitty. (He takes off\n        his turban to brush RAJAH away.)\nJASMINE:    (She looks at him thinking she has seen him\n        before.)  Wait, wait.  Do I know you?\nALADDIN:    (Quickly replaces his turban) Uh, no, no.\nJASMINE:    You remind me of someone I met in  the marketplace.\nALADDIN:    The marketplace?  (A bee buzzes around his head.)\n        I have servants that go to the marketplace for me.\n        Why I even have servants who go to the marketplace\n        for my servants, so it couldn't have been me you\n        met.\nJASMINE:    (She looks disappointed.)  No, I guess not.\nBEE:        (It's the GENIE) Enough about you, Casanova.  Talk\n        about her! She's smart,  fun, the hair, the eyes.\n        Anything--pick a feature!\nALADDIN:    Um, Princess Jasmine?  You're very...\nBEE:        Wonderful, glorious, magnificent, punctual!\nALADDIN:    Punctual!\nJASMINE:    Punctual?\nBEE:        Sorry.\nALADDIN:    Beautiful.\nBEE:        Nice recovery.\nJASMINE:    Hmm.  I'm rich too, you know.\nALADDIN:    Yeah!\nJASMINE:    The daughter of a sultan\nALADDIN:    I know.\nJASMINE:    A fine prize for any  prince to marry.\nALADDIN:    Uh, right.  Right.  A prince like me.\nBEE:        (Buzzing in his ear) Warning! Warning!\nJASMINE:    Right, a prince like you.  And every other stuffed  shirt,\n             swaggering, peacock I've met!\nBEE:        (Rear end on fire, wearing goggles and crashing) Mayday!\n              Mayday!\nJASMINE:    Just go jump off a balcony! (She turns and walks away)\nALADDIN:    What?\nBEE:        Stop her! Stop her! Do you want me to sting her?\nALADDIN:    (Swats at bee) Buzz off!\nBEE:        Okay, fine.  But remember--bee yourself! (BEE buzzes into\n             his turban)\nALADDIN:    Yeah, right!\nJASMINE:    What!?!\nALADDIN:    Uh, you're right.  You aren't just some prize to be\n        won.  (He looks disappointed.)  You should be free\n        to make your own choice.  (JASMINE and RAJAH look\n        at each other in confusion.)  I'll go now. (He\n        steps up on the ledge and drops off.)\nJASMINE:    No!\nALADDIN:    (Pokes his head up from over the edge) What?  What?\nJASMINE:    (Now she's amazed) How--how are you doing that?\n        (She looks over the edge and sees the CARPET.)\nALADDIN:    It's a magic carpet.\nJASMINE:    It's lovely.  (CARPET takes JASMINE's hand with a\n        tassel.)\nALADDIN:    You, uh, you don't want to go for a ride, do you?\n        We could get out of the palace, see the world.\nJASMINE:    Is it safe?\nALADDIN:    Sure.  Do you trust me?\nJASMINE:    (She looks at him at the saying of that all-\n        important line) What?\nALADDIN:    (Extends his hand the same as before) Do you trust\n        me?\nJASMINE:    (Gets a sly grin on her face) Yes.\n\n(She takes his hand and gets up on CARPET.  It zooms into the sky,\n    knocking them both into sitting positions.  The music of \"A Whole\n     New World\" swells.  JASMINE looks back and sees RAJAH looking\n    up at her questioningly.  She gasps as they fly over the palace\n     wall and into the sky.)\n\nALADDIN:    I can show you the world\n    Shining, shimmering, splendid.\n    Tell me princess, now when did you last\n    Let your heart decide?\n\n(CARPET zooms down through the town, stopping slightly to pick a\n    flower.  It gives the flower to ALADDIN, who gives it to JASMINE.\n      She smiles.)\n\n    I can open your eyes\n    Take you wonder by wonder\n    Over, sideways, and under\n    On a magic carpet ride\n\n\n(CARPET does as ALADDIN sings, then zooms into the clouds.)\n\n    A whole new world!\n    A new fantastic point of view\n    No one to tell us no\n    Or where to go\n    Or say we're only dreaming\n\n(JASMINE looks back and watches Agrabah disappear from sight.  CARPET\n    flies in and out of the clouds.)\n\nJASMINE:    A whole new world\n    A dazzling place I never knew\n    But when I'm way up here\n    It's crystal clear\n    That now I'm in a whole new world with you!\n\nALADDIN:    Now I'm in a whole new world with you!\n\n(They each catch a small cloud as CARPET continues the flight.  It\n    then circles a pillar of clouds, giving a swirly look to it.)\n\nJASMINE:    Unbelievable sights\n    Indescribable feeling\n    Soaring, tumbling, freewheeling\n    Through an endless diamond sky\n\n(They join a flock of birds in the sky.  One of them looks terrified\n    and squawks.  CARPET does somersaults and flips, at times putting\n    ALADDIN and JASMINE in free-fall, but catching them.  They then\n    zoom above the clouds where a starry night awaits them.)\n\nJASMINE:    A whole new world!\nALADDIN:    Don't you dare close your eyes\nJASMINE:    An hundred thousand things to see\nALADDIN:    Hold your breath--it gets better!\nJASMINE:    I'm like a shooting star,\n    I've come so far\n    I can't go back to where I used to be!\n\n(They zoom down over a river, apparently the Nile, for beyond the\n     ship's sails are the Great Pyramids.  They wave at a worker\n     sculpting the complete nose of the Sphinx.  He smiles, but\n    chisels too much and breaks off the front section of the nose.)\n\nALADDIN:    A whole new world!\nJASMINE:    Every turn a surprise\nALADDIN:    With new horizons to pursue\nJASMINE:    Every moment, red-letter\n\n(They fly alongside wild horses running.  JASMINE pets one of them.)\n\nBOTH:   I'll chase them anywhere\n    There's time to spare\n    Let me share this whole new world with you\n\n    A whole new world\n    That's where we'll be\n\n(They fly through Greece, where ALADDIN grabs an apple from a\n    tree and rolls it down his arm to JASMINE, who is now sure\n    she is dealing with ALADDIN, not PRINCE ALI.)\n\nALADDIN:    A thrilling chase\nJASMINE:    A wondrous place\nBOTH:       For you and me!\n\n(CARPET hovers along over a lake, and we see the reflection of\n    the moon in the lake.  Fireworks burst and we see the couple\n    at a Chinese New Year celebration, sitting on a rooftop.)\n\nJASMINE:    It's all so magical.\nALADDIN:    Yeah.\nJASMINE:    (She looks at him and decides to burst the bubble)\n        It's a shame Abu had to miss this.\nALADDIN:    Nah.  He hates fireworks.  (CARPET looks up\n        realizing what is happening.)  He doesn't really\n        like flying either. (And now ALADDIN realizes it)\n        That is...oh no!\nJASMINE:    (She pulls off his turban) You are the boy from the\n        market!  I knew it.  Why did you lie to me?\nALADDIN:    Jasmine, I'm sorry.\nJASMINE:    Did you think I was stupid?\nALADDIN:    No!\nJASMINE:    That I wouldn't figure it out?\nALADDIN:    No.  I mean, I hoped you wouldn't.  No, that's not\n        what I meant.\nJASMINE:    Who are you?  Tell me the truth!\nALADDIN:    The truth? (He looks at CARPET who wave him on,\n        giving up hope.)  The truth...the truth is...I\n        sometimes dress as a commoner to escape the\n        pressures of palace life.  (CARPET slumps down in\n        defeat.)  But I really am a prince! (The feather on\n         his turban falls down over his eyes.)\nJASMINE:    Why didn't you just tell me?\nALADDIN:    Well, you know, um...royalty going out into the\n        city in disguise, it sounds a little strange,\n        don't you think?\nJASMINE:    Not that strange.\n\n(She flicks up the feather and cuddles with him.  CARPET puts a\n    tassel under his \"chin\" and looks mystified.  Dissolve to ext.\n    of palace balcony, where ALADDIN and JASMINE return.  CARPET\n    forms a set of steps and she descends.  ALADDIN then descends\n     just below the balcony.)\n\nJASMINE:    Good night, my handsome prince.\nALADDIN:    Sleep well, princess.\n\n(They slowly lean forward to kiss, but CARPET bumps him up and they\n    kiss sooner than expected.  She walks away slowly then turns and\n    looks at him. Finally she enters her room through the curtain.)\n\nALADDIN:    Yes!  (He falls back onto the CARPET, who descends\n        to the ground.) For the first time in my life,\n        things are starting to go right.\n\n(He looks up at JASMINE's balcony, and four sets of hands grab him.)\n\nALADDIN:    Hey!  What?  (A gag is tied around his mouth.\n        Muffled words) Abu!  Abu!  (We see the elephant\n        hanging from a net tied in a tree.)\nGUARD:  Hold him!\n\n(Shackles are placed on his feet and his hands.  Another GUARD ties\n    CARPET in a knot around a tree.)\n\nJAFAR:  I'm afraid you've worn out your welcome, Prince\n        Abooboo.  (Walks away.)  Make sure he's\n        never found.\n\n(A GUARD hits him in the head, and he falls unconscious.  Cut to a\n    cliff, where GUARDS laugh as ALADDIN's body drops into the water.\n      He is conscious now, but his feet are tied to a rock.  The rock\n     hits the sea bottom, then the turban lands and the lamp tumbles\n    out.  He sees this and struggles to rub the lamp.  However, he\n    loses consciousness and falls to the floor.  The lamp, unsettled\n    by his movement, rolls down and rubs against his hands. It shakes,\n    and GENIE emerges with a bath brush, rubber duckie, and shower cap)\n\nGENIE:  Never fails.  Get in the bath and there's a rub at\n        the lamp.  (Squeaks the duck)  Hello.  (Sees\n        unconscious ALADDIN) Al?  Al!  Kid, snap out of it!\n        You can't cheat on this one!  I can't help you\n        unless you make a wish.  You have to say  \"Genie I\n        want you to save my life.\"  Got it?  Okay.  C'mon\n        Aladdin!!  (He grabs ALADDIN by the shoulders and\n        shakes him.  His head goes up, then falls.)  I'll\n        take that as a yes.  (Head turns into a siren.)\n        Wooga!  Wooga!  (Turns into a submarine.)  Up\n        scope!  (He babbles in something that sounds like\n        German.  On the surface, a giant water spout\n        emerges, and lands on top of the cliff.  ALADDIN\n        reawakes and coughs the water out of his lungs.)\n        Don't you scare me like that!\nALADDIN:    Genie, I--uh, I-uh...(He can't think of how to say\n        it, so they just hug each other.)  Thanks, Genie.\nGENIE:  Oh, Al.  I'm gettin' kind of fond of you, kid.  Not\n        that I want to pick out curtains or anything.\n\n(Cut to JASMINE in her room, humming \"A Whole New World\" and brushing\n   her hair.  The SULTAN appears in one of the double doors,hypnotized.)\n\nSULTAN: Jasmine!\nJASMINE:    Oh, father--I just had the most wonderful time.\n        I'm so happy.\nSULTAN: (Still monotone from the hypnosis) You should be,\n        Jasmine. I have chosen a husband for you.\nJASMINE:    What?\nSULTAN: (The other door opens and reveals JAFAR.)  You will\n        wed Jafar.\n\n(JASMINE gasps at the sight of him.)\n\nJAFAR:  You're speechless, I see.  A fine quality in a\n        wife.\nJASMINE:    I will never marry you.  (She goes to the SULTAN)\n        Father, I choose Prince Ali!\nJAFAR:  Prince Ali left!\n\n(A quick pan finds ALADDIN standing in the doorway to the balcony.)\n\nALADDIN:    Better check your crystal ball  again, Jafar!\nJASMINE:    Prince Ali!\n\n(JAFAR gasps at the sight of ALADDIN.)\n\nIAGO:       How in the he--(back to parrot-ese)--uh, awk!\nALADDIN:    Tell them the truth, Jafar!  You tried to have me\n        killed.\nJAFAR:  What?  (He goes to the SULTAN)  Ridiculous\n        nonsense, your highness.  He is obviously lying.\n        (He brings the staff close to the SULTAN's face.)\nSULTAN: Obviously...lying.\n\n(ALADDIN sees the staff with its glowing eyes.)\n\nJASMINE:    Father, what's wrong with you?\nALADDIN:    I know!\n\n(ALADDIN grabs the staff and smashes it on the floor. JAFAR flinches\n    and the spell is broken for good.)\n\nSULTAN: Oh, oh, oh my!\nALADDIN:    Your highness, Jafar's been controlling you with\n        this!  (He advances the staff)\nSULTAN: What?  Jafar?  You, you traitor!\n\n(The trio advances on JAFAR.)\n\nJAFAR:  Your majesty, all of this can be explained.\nSULTAN: Guards! Guards!\nIAGO:       Well, that's it--we're dead, forget about it.  Just\n        dig a grave for both of us.  We're dead.\n\n(But JAFAR sees the lamp in ALADDIN's pocket.  He makes a move, but\n    is grabbed by guards.)\n\nSULTAN: Arrest Jafar at once.\nJAFAR:  This is not done yet, boy!\n\n(JAFAR pulls a vial from his pocket.  ALADDIN sees this and rushes\n    him, but JAFAR throws the vial to the floor.  A large red cloud\n    appears.  When it is gone, so is JAFAR.)\n\nSULTAN: Find him, search everywhere!\nALADDIN:    Jasmine, are you all right?\nJASMINE:    Yes.\n\n(They lean in to kiss, but the SULTAN barges between them.)\n\nSULTAN: Jafar, my most trusted counselor, plotting against\n        me all this time.  Just horrible.  How will I ever-\n        (He stops in mid sentence and looks at the pair.)\n        Can it be true?  My daughter has finally chosen a\n        suitor? (She nods) Ha ha!  Praise Allah!  You\n        brilliant boy, I could kiss you!   I won't--I'll\n        leave that to my--.  You two will be wed at once!\n        Yes, yes.  And you'll be happy and prosperous, and\n        then my boy, you will be sultan!\nALADDIN:    Sultan?\nSULTAN: Yes, a fine upstanding youth like yourself, a\n        person of your unimpeachable moral character is\n        exactly what this kingdom needs!  (ALADDIN looks\n        concerned at this.)\n\n(Cut to int. of JAFAR's chambers.  JAFAR and IAGO enter.)\n\nIAGO:       We gotta get outta here!  We gotta get--  I gotta\n        start packing, your highness.  Only essentials.\n        (IAGO starts throwing things out of his cage.\n        JAFAR smiles broadly.)  Travel light! Bring the\n        guns, the weapons, the knives (Stops and takes out\n        a picture of himself    and JAFAR) and how about\n        this picture?  I don't know--I think I'm making a\n        weird face in it. (JAFAR starts to laugh wildly.)\n        Oh, boy--he's gone nuts.  He's cracked.  (IAGO\n        flies down to him and knocks on his head.)  Jafar?\n        Jafar?  Get a grip, Jafar! (JAFAR grabs him around\n        the neck) Good grip!\nJAFAR:  Prince Ali is nothing more than that ragged urchin\n        Aladdin.  He has the lamp, Iago.\nIAGO:       Why that miserable--\nJAFAR:  But you are going to relieve him of it!\nIAGO:       Me?\n\n(Cut to ext. of palace.  ALADDIN is looking at the gardens.)\n\nALADDIN:    Sultan?  They want me to be sultan?\n\n(GENIE comes out of lamp)\n\nGENIE:  Huzzah!  Hail the conquering hero!  (Turns into a\n        one-man band.  He sees ALADDIN walk away with his\n        head hung.  He stops, scratches his head, comes up\n        with an idea, then zooms over to ALADDIN.  He holds\n        up his hands like a director scoping a picture and\n        we look through them.)  Aladdin, you've just won\n        the heart of the princess.  What are you gonna do\n        next?  (ALADDIN looks at him, then walks away in\n        sadness to the bed, where he falls on it and sighs.\n        GENIE again is confused, then goes to him and pulls\n        out a script labeled \"Aladdin.\" Whispering: )\n        Psst, your line is \"I'm going to free the genie.\"\n        Anytime.\nALADDIN:    Genie...I can't.\nGENIE:  Sure you can.  You just go \"Genie, I wish you\n        free.\"  (He grabs ALADDIN's head and uses\n        him as a mock ventriloquist's dummy.  ALADDIN pulls away.)\nALADDIN:    I'm serious.  Look, I'm sorry--I really am. But\n        they want to make me sultan--no!, They want to make\n        Prince Ali sultan.  Without you, I'm just Aladdin.\nGENIE:  Al, you won!\nALADDIN:    Because of you!  The only reason anyone thinks I'm\n        anything is because of you.  What if they find out\n        I'm not really a prince?  (Quietly)  What if\n        Jasmine finds out?  I'll lose her.  Genie, I can't\n        keep this up on my own.  I can't wish you free.\nGENIE:  (Sarcastically) Hey, I understand.  After all,\n        you've lied to everyone else.  Hey, I was beginning\n        to feel left out.  Now, if you'll excuse me,\n        master. (He says the last word in disgust, then\n        poofs back into the lamp.)\n\n(ABU and CARPET are watching from the window.)\n\nABU:        Ohhh.\nALADDIN:    Genie, I'm really sorry. (A tongue comes out of the\n        spout and raspberries him.)   Well, fine. (He slams\n        a pillow on top of the LAMP.)  Then just stay in\n        there!  (He looks at ABU and CARPET.)  What are you\n        guys looking at? (They both leave.) Look, I--I'm\n        sorry.  Wait, Abu-- wait--I'm sorry, I didn't--\n        wait, c'mon.  (He sighs.)  What am I doing?\n        Genie's right--I gotta tell Jasmine the truth.\nJASMINE:    (From a distance)  Ali, oh Ali--will you come here?\nALADDIN:    (Putting on his turban) Well, here goes.  (He walks\n        into the garden.)  Jasmine?  Where are you?\n\n(We see IAGO wearing a beak and standing on stilts next to a FLAMINGO\n    in the pond.  He is imitating JASMINE's voice.)\n\nIAGO:       Ahem--In the menagerie, hurry.\nALADDIN:    I'm coming.\n\n(We see ALADDIN hurry past, not noticing the birds.  IAGO laughs,\n    then turns back and looks into the face of a FLAMINGO, who is\n    panting.)\n\nFLAMINGO:   D'uh!\nIAGO:       Ya got a problem, pinky?  (He sweeps the bird's\n        feet out from under it. IAGO runs into the palace\n        and finds the lamp under the pillow.)  Boy, Jafar's\n        gonna be happy to see you!  (Stretches his face\n        like JAFAR's and imitates it.)  Good work, Iago!\n        (Normal) Ah, go on.  (JAFAR) No, really--on a scale\n        of one to ten, you are an eleven! (Normal) Ah,\n        Jafar--you're too kind.  I'm embarrassed, I'm\n        blushing.  (He flies away with the lamp.)\n\n(Cut to the palace entrance.  The SULTAN is standing on top, making\n    an announcement to the people.)\n\nSULTAN: People of Agrabah, My daughter has finally chosen a\n        suitor!\n\n(Cut to behind the curtain, where JASMINE is peeking.  ALADDIN\n    appears at the bottom of the stairs.)\n\nALADDIN:    Jasmine?\nJASMINE:    Ali, where have you been?\nALADDIN:    There's something I've got to tell you.\nJASMINE:    The whole kingdom has turned out for father's\n        announcement!\nALADDIN:    No! But Jasmine, listen to me, please!\nJASMINE:    Good luck!  (She pushes him out onto the platform\n        with the SULTAN, where he overlooks the entire\n        crowd.)\nSULTAN: ...Ali Ababwa!\nALADDIN:    Oh, boy!\n\n(Far above, IAGO and JAFAR watch through a window.)\n\nIAGO:   Look at them, cheering that little pipsqueak.\nJAFAR:  Let them cheer.\n\n (He lifts the lamp and rubs it.  GENIE comes out.)\n\nGENIE:  You know Al, I'm getting (turns and sees JAFAR)\n        reallyyyyyy--I don't think you're him.  (He\n        descends and consults a playbill.)  Tonight, the\n        role of Al will be played by a tall, dark and\n        sinister ugly man.\nJAFAR:  I am your master now.  (He throws GENIE to the\n        ground and puts his foot on GENIE's face.)\nGENIE:  I was afraid of that.\nJAFAR:  Genie, grant me my first wish.  I wish to rule on\n        high, as sultan!!!\n\n(Cut to ext where dark clouds circle the castle.  The castle shakes.\n    The roof rips off and the SULTAN and ALADDIN duck.)\n\nALADDIN:    Whoa!\nSULTAN: Bless my soul.  What is this?  What is going on?\n\n(His turban lifts off his head.  When he grabs it, his whole body\n    flies up, then is stripped of all his clothing except his boxer\n     shorts.  The clothing reappears on JAFAR.)\n\nJAFAR:  Heh heh heh!\nSULTAN: Jafar, you vile betrayer.\nIAGO:       That's Sultan Vile Betrayer to you.\nALADDIN:    Oh, yeah?  Well, we'll just see about that!  (Pulls\n        off his own turban, but finds it empty)  The lamp!\nJAFAR:  Finders-keepers, Abooboo.\n\n(They both look up and see a gigantic GENIE lift the palace into\n    the clouds..  ALADDIN whistles and CARPET flies up to greet him.\n      They fly up near the GENIE's head.)\n\nALADDIN:    Genie!  No!\nGENIE:  Sorry, kid--I got a new master now.  (He places the\n        palace on top of a mountain.)\nSULTAN: Jafar, I order you to stop!\nJAFAR:  There's a new order now--my order!  Finally, you\n        will bow to me!\n\n(The SULTAN bows, but JASMINE does not.)\n\nJAFAR:  We'll never bow to you!\nIAGO:       Why am I not surprised?\nJAFAR:  If you will not bow before a sultan, then you will\n        cower before a sorcerer!  (To GENIE)  Genie, my\n        second wish--I wish to be the most powerful\n        sorcerer in the world!\n\n(GENIE extends his finger.  ALADDIN tries to stop him, but he cannot,\n    and another GENIE (tm) brand lightning bolt  strikes JAFAR,\n     returning him to his normal look.)\n\nIAGO:       Ladies and gentlemen, a warm Agrabah welcome for\n        Sorcerer Jafar!\nJAFAR:  Now where were we?  Ah, yes--abject humiliation!\n        (He zaps JASMINE and the SULTAN with his staff, and\n        they both bow to him. RAJAH comes running at him.\n        He zaps RAJAH, and the tiger turns into a kitty-\n        cat.)  Down, boy!  Oh, princess--(lifts her chin\n        with his staff)--there's someone I'm dying to\n        introduce you to.\nALADDIN:    (off-camera) Jafar!  Get your hands off her!\n\n(JAFAR zaps ALADDIN.  CARPET flies away.)\n\nJAFAR:  Prince Ali\n    Yes, it is he,\n    But not as you know him.\n    Read my lips and come to grips\n    With reality\n\n(JAFAR brings the two of them closer in the air.)\n\n    Yes, meet a blast from your past\n    Whose lies were too good to last\n    Say hello to your precious Prince Ali!\n\n(JAFAR zaps ALI back to ALADDIN.)\n\nIAGO:       Or should we say Aladdin?\nALADDIN:    Jasmine, I tried to tell you.\n\nJAFAR:  So Ali turns out to be merely Aladdin\n    Just a con, need I go on?\n    Take it from me\n    His personality flaws\n    Give me adequate cause\n    To send him packing on a one-way trip\n    So his prospects take a terminal dip\n    His assets frozen, the venue chosen\n    Is the ends of the earth, whoopee!\n    So long,\nIAGO:       Good bye, see ya!\nJAFAR:  Ex-Prince Ali!\n\n(JAFAR has zapped ABU back to normal.  He sends the two of them into\n    a tall pillar, then launches it like a rocket, but not before\n    CARPET can get in.  F2B, then we see a snowy wasteland, where\n    the pillar crashes and rolls.  It finally comes to a stop.\n    ALADDIN emerges, obviously very cold.)\n\nALADDIN:    Abu?  Abu!  (He looks back at a shivering pile of\n        snow.)  Oh, this is all my fault--I should have\n        freed the genie when I had the chance.  (He digs\n        out ABU and cradles him inside his vest.)  Abu!\n        Are you okay?  I'm sorry, Abu--I made a mess of\n        everything, somehow.  I gotta go back and set\n        things right.  (He starts to walk through the snow,\n        and he eventuallysteps on a frozen CARPET.)\n        Carpet!  (He looks up and sees CARPET is pinned by\n        the pillar.  He tugs to try and free CARPET.  He\n        can't do it, so he begins to remove snow from the\n        base of the pillar.)   Abu, start digging!  That's\n        it!  (Finally, enough snow has been removed, and\n        the pillar begins to roll.  ALADDIN runs away,\n        looks back, then slides into place.  The pillar\n        rolls over him, and when it is gone, ALADDIN and\n        ABU are left sitting in the patch of snow made by\n        the window of the pillar.)  Yeah!  All right!  (He\n        looks up at his turban, made out of scared ABU.\n        CARPET shakes off the snow and rushes over to pick\n        them up.)  Now, back to Agrabah!  Let's go!\n\n(We cut back to ext. long shot of Agrabah, shrouded in red clouds.\n    Cut to int. and slow zoom of throne room. IAGO has the SULTAN\n    tied up like a marionette, and JASMINE is chained next to the\n    throne.)\n\nIAGO:       Puppet ruler want a cracker? Here's your cracker.\n        Shove 'em all right down your throat.  Here, have\n        lots!\n\n(JAFAR pulls the chain, and JASMINE walks up to him holding an apple.)\n\nJAFAR:  Leave him alone!\n\n(IAGO stops for a second, then continues.)\n\nJAFAR:  It pains me to see you reduced to this, Jasmine.\n        (He takes a bite out of the apple she is holding.)\n        A beautiful desert bloom such as yourself should be\n        on the arm of the most powerful man in the world.\n        (He waves his finger and a crown appears.) What do\n        you say, my dear?  Why,  with you as my queen...\n\n(She picks up a glass of wine and throws it in his face.)\n\nJASMINE:    Never!\nJAFAR:  I'll teach you some respect! (She falls back as he\n        raises his hand to slap her.  Then he stops.)  No.\n        Genie, I have decided to make my final wish.  I\n        wish for Princess Jasmine to fall desperately in\n        love with me.\n\n(We see ALADDIN race back into town.)\n\nGENIE:  (Again as Buckley) Ah, master-- there are a few\n        addendas, some quid pro quo-\nJAFAR:  Don't talk back to me, you stupid blue lout!  You\n        will do what I order you to do, slave!\n\n(JASMINE looks up and sees ALADDIN in the window, motioning her to\n    play along.)\n\nJASMINE:    (She stands and puts the crown on her head.)\n        Jafar!  I never realized how incredibly\n        handsome you are.\n\n(The GENIE's jaw drops.)\n\nJAFAR:  That's better.  (He pulls the GENIE's jaw up like a\n        shade.)  Now, pussycat, tell me more\n        about...myself.\nJASMINE:    You're tall, well dressed...\n\n(JAFAR walks over to her.  ALADDIN jumps down with ABU and GENIE\n    sees them.)\n\nGENIE:  Al!  Al, little buddy!\nALADDIN:    Shh!\nGENIE:  (Literally zips his mouth shut, then unzips it.)\n        Al, I can't help you--I work for senor psychopath,\n        now.  (His head turns into JAFAR's, then back.)\nALADDIN:    Hey--I'm a street rat, remember? (He rezips GENIE's\n        mouth.)  I'll improvise.\n\n(He slides down a pile of coins and hides close to JAFAR and JASMINE.\n    JAFAR's back is to ALADDIN.)\n\nJAFAR:  Go on.\nJASMINE:    And your beard...is so...twisted!  (She has her\n        arms around him.  She pretends to twist with her\n        finger, but she is actually motioning for ALADDIN\n        to come over.  He makes his move.  IAGO sees him.)\n\nIAGO:       Jaf--mmmmmm! (ABU grabs him and covers his mouth.)\nJAFAR:  And the street rat?\nJASMINE:    What street rat?\n\n(They are about to kiss when IAGO manages to knock over a bowl.  JAFAR\n    turns to look, but JASMINE grabs him back and kisses him.  ALADDIN\n     looks disgusted.  IAGO and ABU both look disgusted.)\n\nABU:        Yuck!\nJAFAR:  That was--(he sees ALADDIN's reflection in her\n        crown.) You!!  How many times do I have\n        to kill you, boy?\n\n (He zaps ALADDIN.  JASMINE rushes him, and he throws her to the\n    ground.  ALADDIN rushes and grabs the staff.)\n\nALADDIN:    Get the lamp!\n\n(JASMINE runs to it.  JAFAR, however, shakes off ALADDIN, then\n    zaps her into an hourglass.)\n\nJAFAR:  Ah, ah, ah, princess--Your time is up!\n\n(Sand begins to fall from the top onto her.)\n\nALADDIN:    Jasmine!\nIAGO:       Oh, nice shot, Jaf-- (he is knocked out by ABU.)\n\n(ABU rushes for the lamp.)\n\nJAFAR:  Don't toy with me!  (He's zapped into a toy monkey.\nALADDIN:    Abu!\n\n\n(CARPET rushes in.)\n\nJAFAR:  Things are unraveling fast, now boy. (CARPET is\n        zapped and unravels.  ALADDIN again rushes for the\n        lamp.)  Get the point?  (His path is blocked by\n        large swords sticking in the floor.  JAFAR grabs\n        the lamp and laughs hideously. ALADDIN pulls a\n        sword out of the floor.) I'm just getting warmed\n        up!  (He breathes a ring of fire around ALADDIN.)\nALADDIN:    Are you afraid to fight me yourself, you cowardly\n        snake?\nJAFAR:  A snake, am I?  Perhaps you'd like to see how\n        snake-like I can be!  (He smiles broadly, and we\n        see a snake's tongue come out from behind his\n        teeth.  He then turns into a giant cobra, and the\n        ring of fire around ALADDIN becomes part of the\n        snake encircling ALADDIN.  The snake JAFAR makes\n        moves on ALADDIN, and on the third try, ALADDIN\n        swings the sword and hits JAFAR.  Cut to GENIE\n        cheerleaders wearing 'A' sweaters.)\n\nGENIE:  Rickem, rockem, rackem, rake--stick that sword into\n        that snake!\nJAFAR:  You stay out of thissss!\n\n(GENIE waving a tiny pennant with a 'J' on it.)\n\nGENIE:  (Weakly) Jafar, Jafar, he's our man--if he can't do it,\n<b>        GREAT!\n</b>\n(ALADDIN uses the distraction to make a break for the hourglass where\n    JASMINE is trapped.  However, JAFAR sees this and blocks the path.\n     ALADDIN is thrown away, and he loses his sword.)\n\nJASMINE:    Aladdin!\n\n(ALADDIN jumps on a large gem and slides across the floor, grabbing\n    the sword on his way.  He turns a corner, but the pursuing snake\n    cannot, and the front half of JAFAR crashes through a wall and\n    hangs outside the palace.  ALADDIN jumps up on the snake's back\n     and stabs it.  JAFAR screams in agony.  ALADDIN again tries to\n     free the princess.)\n\nALADDIN:    Hang on, Jasmine!\n\n(He is about to hit the glass with his sword when JAFAR grabs him.)\n\nJAFAR:  (laughs hideously)  You little fool!  You thought\n        you could defeat the most powerful being on earth!\nIAGO:       (with GENIE coming up behind him) Squeeze him,\n        Jafar--Squeeze him like a--awk! (GENIE elbows him\n        out of the way)\nJAFAR:  Without the genie, boy, you're nothing!\nALADDIN:    (Has an idea)  The genie!  The genie!  The genie\n        has more power than you'll ever have!\nJAFAR:  What!!\nALADDIN:    He gave you your power, he can take it away!\nGENIE:  Al, what are you doing?  Why are you bringing me\n        into this?\nALADDIN:    Face it, Jafar--you're still just second best!\nJAFAR:  You're right!  His power does exceed my own!  But\n        not for long!\n\n(JAFAR circles around the GENIE.)\n\nGENIE:  The boy is crazy.  He's a little punch drunk.  One\n        too many hits with the snake  (His hand\n        turns into a snake and he hits his head with it.)\nJAFAR:  Slave, I make my third wish!  I wish to be an all\n        powerful genie!\nGENIE:  (Reluctantly) All right, your wish is my command.\n        Way to go, Al.\n\n(GENIE zaps JAFAR with the last GENIE (tm) brand lightning bolt.\n    JAFAR's snake form dissipates and he turns into a genie.  We\n     see JASMINE's raised hand disappear under the sand.  ALADDIN\n    runs over and finally smashes the glass.  Sand and princess\n     pour out.)\n\nJAFAR:  Yes!  Yes!  The power! The absolute power!\nJASMINE:    (to ALADDIN) What have you done?\nALADDIN:    Trust me!\n\n(A black lamp appears at JAFAR's base.  JAFAR is busy conjuring.)\n\nJAFAR:  The universe is mine to command, to control!\nALADDIN:    Not so fast, Jafar!  Aren't you forgetting something?\n    (JAFAR looks down questioningly) You wanted to be a genie, you\n    got it!  And everything that goes with it!\n\n(Shackles appear on JAFAR's wrists.)\n\nJAFAR:  No!  No!\nIAGO:       I'm gettin' out of here!  Come on, you're the\n        genie, I don't want--\n\n(IAGO tries to fly away, but is sucked in with JAFAR.)\n\nALADDIN:    Phenomenal cosmic powers!  Itty bitty living space.\nGENIE:  Al, you little genius, you!\n\n(ABU turns back to normal, the CARPET re-ravels, JASMINE, the SULTAN\n    and RAJAH are standing together.  RAJAH jumps up into the arms of\n     the SULTAN, then they are all transformed.  The SULTAN is crushed\n     because of the weight of the new RAJAH.  The palace reappears\n     where it used to be in the city.  ALADDIN is left holding the\n    new lamp.)\n\nJAFAR:  (Both from inside the lamp.)  Get your blasted beak\n        out of my face!\nIAGO:       Oh, shut up, you moron!\nJAFAR:  Don't tell me to shut up!\nGENIE:  Allow me.  (He takes the lamp and goes to the\n        balcony.  He is now wearing a baseball cap.  He\n        winds up as if to throw the lamp, but opens his\n        palm flat and flicks it out into the desert\n        with his finger.) Ten- thousand years in a cave of\n        wonders ought to chill him out!\n\n(JAFAR and IAGO continue to argue as they fade out.  JASMINE walks\n    over to ALADDIN.  They hold hands, but both look sad.)\n\nALADDIN:    Jasmine, I'm sorry I lied to you about being a\n        prince.\nJASMINE:    I know why you did.\nALADDIN:    Well, I guess...this... is goodbye?  (GENIE pokes\n        his head around the corner shocked at what he is\n        hearing.)\nJASMINE:    Oh, that stupid law.  This isn't fair--I love you.\nGENIE:  (Wipes away a tear)  Al, no problem. You've still\n        got one wish left.  Just say the word and you're a\n        prince again.\nALADDIN:    But Genie, what about your freedom?\nGENIE:  Hey, it's only an eternity of servitude.  This is\n        love.  (He leans down next to her.)  Al, you're\n        not gonna find another girl like her in a million\n        years.  Believe me, I know.  I've looked.\nALADDIN:    Jasmine, I do love you, but I've got to stop\n        pretending to be something I'm not.\nJASMINE:    I understand.\n\n(They take one final look into each other's eyes, then ALADDIN turns\n    to the GENIE.)\n\nALADDIN:    Genie, I wish for your freedom.\nGENIE:  One bona fide prince pedigree coming up.  I--what?\nALADDIN:    (He holds the lamp up to GENIE.)  Genie, you're\n        free!\n\n(A transformation scene ensues, in which the shackles fall off\n    GENIE's wrist and the lamp falls uselessly to the ground.\n     GENIE picks it up and looks at it.)\n\nGENIE:  (He can't believe it.)  Heh, heh!  I'm free. I'm\n        free.  (He hands the lamp to ALADDIN.)  Quick,\n        quick, wish for something outrageous.  Say  \"I want\n        the Nile.\"   Wish for the Nile.  Try that!\nALADDIN:    I wish for the Nile.\nGENIE:  No way!!  (Laughs hysterically.  He bounces around\n        the balcony like a pinball.)  Oh does that feel\n        good!  I'm free!  I'm free at last!  I'm hittin'\n        the road.  I'm off to see the world!  I--\n\n(He is packing a suitcase, but looks down and sees ALADDIN looking\n    very sad.)\n\nALADDIN:    Genie, I'm--I'm gonna miss you.\nGENIE:  Me too, Al.  No matter what anybody says, you'll\n        always be a prince to me.\n\n(They hug.  The SULTAN steps forward.)\n\nSULTAN: That's right.  You've certainly proven your worth\n        as far as I'm concerned. It's that law that's the\n        problem.\nJASMINE:    Father?\nSULTAN: Well, am I sultan or am I sultan?  From this day\n        forth, the princess shall marry whomever she deems\n        worthy.\nJASMINE:    (She smiles widely and runs into ALADDIN's arms.)\n        Him!  I choose...I choose you, Aladdin.\nALADDIN:    Ha, ha.  Call me Al.\n\n(They are about to kiss when giant blue hands pull everybody together.\n    GENIE is decked out in a Hawaiian shirt with golf clubs and a Goofy\n     hat.)\n\nGENIE:  Oh, all of ya. Come over here.  Big group hug!\n        Mind if I kiss the monkey?  (He kisses ABU.)  Ooh,\n        hairball!  Well, I can't do any more damage around\n        this popsicle stand.  I'm outta here!  Bye, bye,\n        you two crazy lovebirds.  Hey, Rugman: ciao!  I'm\n        history!   No, I'm mythology!  No, I don't care\n        what I am--I'm free!\n\n(The GENIE flies up into the blue sky leaving a trail of sparkles\n    behind him.  They cut (a jump cut to make matters worse)\n     to fireworks exploding over a nightscape. We tilt down and see\n     ALADDIN and JASMINE flying on CARPET.)\n\nALADDIN:    A whole new world\nJASMINE:        A whole new life\nBOTH:   (with off-camera chorus)    For you and me!\nMEN'S CHORUS:   A whole new world!\n\n(They fly off into the moonlight, and after they have disappeared,\n    the moon turns and reveals the GENIE's laughing face.  Suddenly\n    the film is grabbed \"off the projector\", the GENIE lifts it up\n     and looks at the audience.)\n\nGENIE:  Made ya look!\n\n(Drops the film back to normal, with the normal moon.  Fade to black.\n    The end.)\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Aladdin</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Roger Allers\" title=\"Scripts by Roger Allers\">Roger Allers</a>  <a href=\"/writer.php?w=Ron Clements\" title=\"Scripts by Ron Clements\">Ron Clements</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Animation\" title=\"Animation Scripts\">Animation</a>  <a href=\"/genre/Family\" title=\"Family Scripts\">Family</a>  <a href=\"/genre/Musical\" title=\"Musical Scripts\">Musical</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Aladdin Script.html#comments\" title=\"Aladdin comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:58:07.026270"}