{"title": "Alien Nation", "film_link": "/Movie Scripts/Alien Nation Script.html", "script_link": "/scripts/Alien-Nation.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Alien Nation Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Alien Nation Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Rockne O'Bannon\" title=\"Scripts by Rockne O'Bannon\">Rockne O'Bannon</a><br/>  <a href=\"/writer.php?w=James Cameron\" title=\"Scripts by James Cameron\">James Cameron</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/>\n<b>Script Date</b> : October 1987<br/>\n<br/>\n<a href=\"/scripts/Alien-Nation.html\">Read \"Alien Nation\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>Alien Nation - by Rochne O'Bannon Rewrite by James Cameron</title>\n\n<pre>\n<b>\t\t    ALIEN NATION\n</b>\n\n\t\tOriginal Screenplay\n\n\t\t\t    by\n\n\t\t Rockne S. O'Bannon\n\n\n\t\t\t Rewrite\n\n\t\t\t    by\n\n\t\t   James Cameron\n\n\n\t\t    October 1987\n\n\n\n<b>FADE IN:\n</b>\n<b>EXT.  MOJAVE DESERT - DAY (TELEVISION IMAGE)\n</b>\nA LONG LENS SHOT of a far distant metallic object hovering\njust above the ground -- maybe two or three miles away.\nThe heat waves and the light refraction off the desert-\nscape make the object undulate rhythmically, keeping its\ntrue shape and appearance indistinct.\n\nThe VIDEO CAMERA recording this scene zooms back, then\npans over -- revealing a semicircle of US Army vehicles\nand personnel.  Army Engineers with their tripod-mounted\nscopes and binoculars are shoulder to shoulder with the\narmed infantry.  Everyone stares off at the same point on\nthe horizon.  Waiting.\n\nThe VIDEO CAMERA movements are HANDHELD, unsteady, as it\nmoves through the line of Army personnel to reveal a\nsecond, less organized semicircle of observers fifty yards\nbehind the Army.  LOCALS from nearby towns perch in truck\nbeds and on car roofs, Budweiser and Fritos at hand, eyes\nglued to the distant object.\n\nThe VIDEO CAMERA image climbs up onto the roof of a parked\nlocal TV van, finds the object again in the distance,\nzooms in, and waits, like everyone else.\n\nAbruptly the VIDEO IMAGE contracts, becoming a box\nCHROMAKEYED behind CNN reporter DUNCAN CRAIS.\n\n<b>\t\t\tCRAIS\n</b>\tThat was the scene in California's\n\tMojave Desert three years ago today\n\t-- the historic first view of the\n\tNewcomer ship upon its dramatic\n\tarrival.  As with the assassination\n\tof John Kennedy, who among us does\n\tnot remember exactly where he was\n\tthat October nineteenth morning,\n\twhen news first broke: that people\n\thave landed... from another star.\n\nWe PULL BACK from a large television set to reveal...\n\n\n<b>INT.  A CROWDED BAR - LOS ANGELES - NIGHT\n</b>\nThe Hollowpoint Lounge -- a cop bar.\n\nThe off-duty uniformed and plainclothes cops are mostly\nignoring the TV, except for two detectives, FEDORCHUK and\nALTEREZ, who are waiting for the ball scores.\n\n<b>\t\t\tFEDORCHUK\n</b>\tI remember where I was -- pissing\n\toff my balcony at the neighbor's\n\tdog!\n\nOthers laugh.\n\n<b>\t\t\tALTEREZ\n</b>\t\t   (yells at Crais on TV)\n\tGet to the goddamn ball scores!\n\nON THE TV SCREEN, an on-location interview with a CAL-TECH\nPROFESSOR comes up.  Her name and title appear across the\nbottom of the screen.\n\n<b>\t\t\tCAL-TECH PROFESSOR\n</b>\tFrom the time mankind first gazed up\n\tat the stars there had been\n\tspeculation about a visit by people\n\tfrom \"out there.\"  How ironic that\n\twhen that first contact was made,\n\tthe two hundred and sixty thousand\n\toccupants aboard the craft were as\n\tsurprised as we were about their\n\tarrival.  That they awakened from\n\tfrozen hibernation to find their\n\tmalfunctioning autopilot had landed\n\tthem here by mistake.\n\nThe CNN reporter, Duncan Crais, appears again.\n\n<b>\t\t\tCRAIS\n</b>\tThese \"Newcomers,\" we soon learned,\n\twere a genetically-engineered race,\n\tadapted for hard labor in almost any\n\tenvironmental condition.  In effect,\n\ttheir ship was a slave ship...\n\twashed ashore on Earth with no way\n\tto get back to where they came\n\tfrom...\n\nA dishwasher tray filled with beer glasses CUTS ACROSS\nFRAME, and we PAN WITH IT as it is slammed down on the\ncountertop.\n\nNow an interview with a FRESNO HOUSEWIFE standing outside\na supermarket comes on the TV SCREEN.\n\n<b>\t\t\tFRESNO HOUSEWIFE\n</b>\tWhen the Newcomers were first let\n\tout of the ship, they were\n\tquarantined in a camp not ten miles\n\tfrom the town here.  You can imagine\n\thow the people around here felt\n\tabout that.  But once they were\n\treleases from the camp and we got a\n\tchance to know them, we saw what\n\tnice, quiet people they really are...\n\n<b>WIDER\n</b>\nrevealing a MASSIVE ALIEN FIGURE in a filthy white\nbusboy's uniform.  His back is to us as he picks up two\ntrays from the counter.  The bartender is dwarfed by this\nNewcomer, but works around him without apparent concern.\nFedorchuk addresses the alien busboy.\n\n<b>\t\t\tFEDORCHUK\n</b>\tHey, Henry, how you doin' tonight?\n\tWorkin' hard?\n\nThe Newcomer turns -- his face is humanoid, but\ndisturbingly alien.\n\n<b>\t\t\tFEDORCHUK\n</b>\tYou got your green card, buddy?  You\n\tdidn't leave home without it?\n\nThe cops at the bar crack up.  Henry looks at Fedorchuk --\nhis eyes carrying no malice... or pain.  He merely blinks.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT./ EXT.  SLUG-MOBILE - STREET - NIGHT\n</b>\nAn explosion of color and movement as OPENING TITLES PLAY\nvery quickly.  We're TRAVELING the streets in a n.d.\nsedan, getting MOVING GLIMPSES of the aliens living among\nus now:\n\n-- A coffee shop where aliens eat at some window tables.\n\n-- A Newcomer leaving a night school with an armload of\nbooks.\n\n-- A city park where a number of alien families have\ngathered to play some arcane alien game.\n\n<b>\t\t\tSYKES\n</b>\tJeez... they call that gang-bang a\n\tgame...?\n\n-- A billboard for Pepsi featuring an alien.\n\n-- The sedan has pulled to a stop at a red light.\nSuddenly a hand thumps against the glass next to Sykes'\nhead... and alien hand.  Sykes jumps.  It's a NEWCOMER\nDERELICT standing there, weaving, mumbling in his own\nlanguage.  In one filthy hand holds a quart carton of\nmilk.  We know immediately what he wants.  Sykes rolls\ndown the window.\n\n<b>\t\t\tSYKES\n</b>\tTake a hike.\n\nSykes gets a whiff of the derelict's breath as the light\nchanges and the sedan pulls away, leaving him in the\nstreet.  Sykes grimaces at the smell.\n\n<b>\t\t\tSYKES\n</b>\tWhy's it have to be sour milk that\n\tthese guys get wasted on?  What the\n\thell's wrong with Jack Daniels, or\n\tThunderbird for chrissakes?\n\t\t   (beat; disgusted)\n\tSlagtown.  Shit...\n\n-- Aliens hanging around outside their homes.\n\n-- Alien hookers plying their trade.\n\n<b>\t\t\tSYKES\n</b>\tHope their plumbing's the same.\n\n<b>\t\t\tTUGGLE\n</b>\tIt is.\n\t\t   (and Sykes gives him\n\t\t    a look)\n\n-- A Newcomer lowrider pulls up beside the slug-mobile.\n\n-- An alien couple exit a theater playing \"Terminator\n<b>III\".\n</b>\n-- An alien wig shop.\n\n<b>ANGLE\n</b>\nTITLES END, and we start to PULL BACK into the slug-mobile\nand HEAR:\n\n<b>\t\t\tTUGGLE (O.S.)\n</b>\tSo you gonna go, or you not gonna\n\tgo?\n\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nThe dashboard is littered with fast-food detritus and two\ncoffees in styrofoam cups making fog circles on the\nwindshield.  A hand picks up one of the coffees and we\nFOLLOW IT to a face, a forty-year-old cop face that's seen\nsome wear and tear -- behind the wheel is MATT SYKES.\nBeside him is his partner of nine years, BILL TUGGLE.\nTuggle expertly munches on a slice of pizza as he talks.\n\n<b>\t\t\tSYKES\n</b>\tHow can I go?\n\n<b>\t\t\tTUGGLE\n</b>\tPut on your wash-and-wear suit and\n\tyour clip-on tie, have your landlady\n\ttie your shoes for you, and show up\n\tat the church.  Simple.\n\t\t   (beat)\n\tMe and Carol are going.\n\n<b>\t\t\tSYKES\n</b>\tWhat?\n\n<b>\t\t\tTUGGLE\n</b>\tHey, look -- we've known Kristin\n\tsince... since she was conceived in\n\tthat cabin up in Big Bear.\n\tRemember?  You and Edie banged the\n\twall so hard, me and Carol were\n\tpicking plaster out of our hair for\n\ta week...\n\n<b>\t\t\tSYKES\n</b>\tGoddammit, Tug -- I want to see\n\tKristin get married, okay?  But--\n\n<b>\t\t\tTUGGLE\n</b>\tBut you're bummed because your ex\n\tand her new husband are paying for\n\tthe whole thing.\n\n<b>\t\t\tSYKES\n</b>\tShit, if Kristin had to get married\n\twhere I could afford it, we'd be\n\tholding the reception at Buddy's\n\tBurgers.\n\nSykes stares out the window, wallowing in his pissed-off\nmood.  Then he spots something that twinges his street-cop\nradar.\n\n<b>\t\t\tSYKES\n</b>\tUh-oh... Check it out.\n\nTHROUGH THE WINDOW Tuggle sees what Sykes sees: two ALIENS\nin long coats moving down the sidewalk, entering a mom-\nand-pop mini-mart on the corner.  One of them wears dark\nglasses and a red bandana (KIPLING): the other has on a\nblack vinyl raincoat.\n\n<b>\t\t\tSYKES\n</b>\tDoes that look at all suspicious to\n\tyou?\n\n<b>\t\t\tTUGGLE\n</b>\tWhatever gave you that idea?\n\n\n<b>EXT.  STREET - NIGHT\n</b>\nSykes continues up a quarter of a block, pulls to the curb\namong other parked cars.\n\n\n<b>INT.  SEDAN - NIGHT\n</b>\nSykes is already pulling his gun.  Tuggle quickly reaches\nfor the radio in the glovebox.\n\n<b>\t\t\tTUGGLE\n</b>\tThis is one-Henry-seven, we've got a\n\tpossible two-eleven in progress at\n\tPorter's Mini-Mart, corner of Court\n\tand Alvarado.  Requesting backup.\n\nImpulsive Sykes is already opening his door and climbing\nout.\n\n<b>\t\t\tSYKES\n</b>\tLet's do it, partner.\n\nTuggle drops the radio mike and follows Sykes as the Radio\nDispatcher confirms the call.\n\n\n<b>EXT.  STREET - NIGHT\n</b>\nThe two cops, guns in hand, move along the row of parked\ncars across the street from the mini-mart.  Through the\nstore window they see the old alien PROPRIETOR behind the\ncounter.  His eyes go wide as Kipling whips back his coat\nand yanks out a short combat pump-shotgun and aims it\nright at him.  The Raincoat alien pulls an identical gun\nand covers the door.\n\nSykes and Tuggle react to the firepower inside.\n\n<b>\t\t\tSYKES\n</b>\tYou got your vest?\n\n<b>\t\t\tTUGGLE\n</b>\tOf course.  Right in the trunk of\n\tthe car.\n\n<b>\t\t\tSYKES\n</b>\tYeah, that's comforting.  Mine, too.\n\nThrough the store window the robbery continues in\npantomime.  Kipling gestures viciously with the shotgun,\nyelling orders in the alien language.  The Proprietor is\nquickly filling a paper bag with cash from the register.\nThe PROPRIETOR'S WIFE, a middle-aged alien woman, stands\nin the doorway from the back, frozen in fear.  The\nRaincoat alien dances from foot to foot, antsy, wired.\n\nSykes and Tuggle crouch at the car directly across the\nstreet from the store entrance.\n\n<b>\t\t\tTUGGLE\n</b>\tWatch the driver.  I'm going for a\n\tbetter angle on the door.\n\n<b>\t\t\tSYKES\n</b>\tI got him.  Don't get pinned.\n\nTuggle leaves the cover provided by the car, runs cater-\ncorner across the intersection.\n\nThrough the store window Sykes sees Kipling grab the bag\nof cash, shove it in his coat pocket.  Bills fall out, but\nhe doesn't care.  Then, without warning, Kipling whips up\nthe twelve gauge and blows a hole in the Proprietor's\nchest!  The Proprietor slams back against the shelves,\nslides to the floor.  Kipling leans over the counter and\nFIRES another round into the Proprietor.\n\n<b>\t\t\tSYKES\n</b>\t\t   (under his breath)\n\tAw, shit.\n\nTuggle is almost across the street when he hears the\nshots.\n\nThe human DRIVER of the getaway car (parked at the curb a\nfew doors down from the mini-mart) glances up, spots\nTuggle.  He leans on the HORN, reaches for a machine\npistol on the seat next to him.\n\n\n<b>INT.  MINI-MART - NIGHT\n</b>\nKipling and Raincoat alien react to the horn honk.  They\nspot Tuggle through the store window and open fire --\n<b>BLASTING THROUGH THE GLASS.\n</b>\nA civilian car enters the intersection.  The engine is hit\nby shotgun fire, and the car skids to a stop in the\nintersection, steam rising from the radiator.\n\n\n<b>EXT.  STREET - NIGHT\n</b>\nTuggle dives behind a lamp post.\n\nThe Driver is out of the car now, brings up the machine\npistol to fire at Tuggle.  Sykes sees this and opens fire\nat the Driver.  The Driver turns and fires at Sykes.\nSykes ducks down, and the car he's hiding behind is\nsprayed with bullets.\n\nA forty-foot moving van pulls down the street between\nSykes and the Driver.  Once the truck is past, Sykes is\nstanding behind the bullet-riddled car, gun ready.  He\nrapid-fires -- creaming the human Driver.\n\nTuggle is pinned down behind the thin lamp post by the\nshotgun fire from Kipling and Raincoat alien.\n\n<b>\t\t\tSYKES\n</b>\tGet outta there!\n\n<b>\t\t\tTUGGLE\n</b>\tI can't!  Do you mind!\n\n<b>\t\t\tSYKES\n</b>\tI'll cover you!  Get outta there!!\n\nSykes rises and runs across the street toward the getaway\ncar, firing toward the store as he goes.\n\nKipling and Raincoat dodge behind cover.\n\nTuggle seizes the opportunity, jumps from behind the lamp\npost and runs to the stalled civilian car.  He slides\nacross the hood and drops behind the car for cover.\nTuggle slowly pokes his head up to peer through the car\nwindow.  His gaze is met by the face of the OLD MAN driver\nwho is still inside the car.\n\n<b>\t\t\tOLD MAN\n</b>\tCan I get out now?\n\n<b>\t\t\tTUGGLE\n</b>\tMove it!\n\nSykes doesn't have a clear firing line on the aliens in\nthe store.  As he considers his next move--\n\nTuggle fires at the two aliens.  They return fire and he\nslides down to safety behind the car.  Or so he thinks.\nGlass rains down on him as the car windows are cremated by\nthe shotgun blasts.  He flinches as another blast hits the\ncar.  He looks over.  There's a big exit hole in the\nfender beside him.  THE SHOT WENT RIGHT THROUGH THE CAR.\nAnother exit hole is BLASTED, inches from his shoulder.\n\nPanicked, he scrambles along the side of the car -- BLASTS\nand exit holes following him until he reaches the front of\nthe car.  He has nowhere left to go and--\n\n-- a BLAST comes through the car and catches him squarely\nin the chest throwing him back onto the street.\n\nSykes' head jerks around -- in time to see his partner of\nnine years blown away.\n\nKipling keeps firing in Tuggle's direction until his\nshotgun CLICKS empty.\n\n\n<b>INT.  MINI-MART - NIGHT\n</b>\nKipling grabs Raincoat and throws him toward the back exit\nof the store.  The shotgun falls from Raincoat's hands.\nThe two of them run out the back.\n\n\n<b>EXT.  STREET - NIGHT\n</b>\nSykes runs to Tuggle's spread-eagled body.  One glance is\nenough.  Nobody ever looked deader.\n\n<b>\t\t\tSYKES\n</b>\tAw shit, Tug, Jesus!  Goddamn it!\n\nHe stares, shocked and incredulous.  He can't find a way\nto think or feel about this.  Then we see him going crazy\nright before our eyes, the rage revving.  He takes off\ntoward the store as SIRENS are HEARD rapidly approaching\nin background.\n\n\n<b>INT.  MINI-MART - NIGHT\n</b>\nSykes moves through like a locomotive skidding on broken\nglass, bangs through the exit.\n\n\n<b>EXT.  ALLEY - NIGHT\n</b>\nSykes catches sight of the two aliens just as they round\nthe corner at the far end of the alley.  He takes off,\nquickly cranking up to full speed.\n\n\n<b>EXT.  BACK STREET - NIGHT\n</b>\nSykes rounds the corner.  Doesn't see them anymore.  He\nslows... moves along this street with some caution.  Lots\nof shadows, lots of hiding places.  Sykes HEARS a NOISE,\nlooks up... just in time to see Raincoat on a high, huge\nbillboard.  He cuts loose with the shotgun.  Sykes dives.\nHuge chunks of the crate he dives behind fly off into the\nnight.  Sykes, on his belly, scrambles deeper among the\ncrates.\n\nRaincoat's shotgun CLICKS empty now.  He drops it, swings\ndown off the fire escape, runs off.\n\nSykes is up again in a flash, pounding after him.\n\n\n<b>EXT.  TUNNEL STREET - NIGHT\n</b>\nSykes rounds this second corner, races down the street.\nThe only route they could've taken is through a tunnel up\nahead.  Sykes approaches the tunnel, all senses wide open.\n\n\n<b>INT.  TUNNEL - NIGHT\n</b>\nThe murkiness of the tunnel engulfs him as he moves\nthrough the mouth.  He tries to control his breathing so\nhe can hear.  The only SOUND is his own shoes scuffing\nalong the asphalt.\n\nThen he HEARS -- another set of FOOTSTEPS.  Rapid\nfootsteps, coming toward him, ECHOING.  He can't tell from\nwhich direction!  He spins, just as a LARGE SHAPE lunges\nfor him with an alien CRY.\n\nIt's the wired Raincoat alien.  Sykes gets his gun up just\nin time and FIRES -- once, twice, three times.  Raincoat\nalien is knocked backwards to the wet asphalt by the\nblasts.  Sykes approaches the body slowly.  With an\ninhuman ROAR, the alien snaps forward, lunging at Sykes\nwith outstretched arms.  Sykes jumps back, startled, and\nFIRES twice more at the pale figure.  Raincoat goes down\nand stays down.\n\nSykes relaxes for the briefest moment.  Then he HEARS\nit... a distinctive CLICKING SOUND, metal on metal.  Sykes\nlooks up and -- Kipling drops down on him from directly\nabove!  Sykes goes down in a heap.  He's managed to hold\nonto the gun and as Kipling comes for him, he swings the\ngun hand around.  Kipling sees it, lashes out, slamming\nthe gun from Sykes' hand.  Sykes tries to get to his feet,\nbut the alien grabs him and flings him down the tunnel.\n\nA SIREN is HEARD approaching in background.\n\nKipling moves in to deliver the coup de grace.  As he\ndraws near, Sykes HEARS that distinctive CLICKING SOUND\nagain.\n\n<b>SYKES' P.O.V.\n</b>\nThough his vision is BLURRED, Sykes still gets a good look\nat an exotic silver bracelet on the alien's wrist.  The\nstrands of this bracelet are what make the CLINKING NOISE.\n\n<b>ANGLE\n</b>\nThe alien rears back, and as he does, the approaching\nSIREN suddenly WAILS louder as a backup patrol car swings\nonto the street heading this way.  Kipling sees this and\nleaves Sykes, running off down the dark tunnel.\n\n<b>ON SYKES\n</b>\ndazed, struggling to rise.  WE HEAR running FOOTSTEPS\napproaching.  Sykes turns, his eyes wild and unfocused.\n\n<b>SYKES' P.O.V.\n</b>\nAn OUT-OF-FOCUS ALIEN FACE looming over him.\n\n<b>ANGLE\n</b>\nSykes whips around in a roundhouse swing with all his\nweight on it, pistoning his fist straight into the alien\nface.  The alien, caught by surprise and off balance,\nsprawls backward OUT OF FRAME.  Sykes is grabbed by a\nhuman uniformed cop, as he tries to swing again.\n\n<b>\t\t\tHUMAN COP\n</b>\tWhoa, whoa... hold it.  Take it easy.\n\t\t   (to alien on the\n\t\t    ground)\n\tYou okay?\n\nSykes stops struggling, and his eyes focus.  He looks at\nthe alien he just decked, sprawled on his ass ten feet\naway.  The alien is a uniformed cop... his name is JETSON.\n\n<b>\t\t\tJETSON\n</b>\tI am all right.\n\nHe gets up.  A trickle of purple blood runs from his nose.\n\n<b>\t\t\tHUMAN COP\n</b>\tI better call in.\n\nHe moves off.  Jetson moves toward Sykes and the Raincoat\nalien's body.  Sykes tenses, thinking Jetson might\nretaliate in some way.  But Jetson simply steps past him\nto kneel beside the dead alien.  He checks for a pulse on\nthe underside of the dead alien's upper arm.  Nothing.\nSykes is holding his punching hand in obvious pain.  He\nstruggles to rise.  Jetson gets an arm around him to help\nhim up.\n\n<b>\t\t\tJETSON\n</b>\tYour hand will require attention.\n\nSykes roughly jerks himself free of Jetson's grip.\n\n<b>\t\t\tSYKES\n</b>\tGet the hell away from me!  I don't\n\tneed your goddamn help.\n\nHe almost loses his balance and has to steady himself\nagainst the tunnel wall.  Sykes leans there, the picture\nof impotent rage and frustration.  Jetson looks at him,\nwith that slight inquisitive expression aliens exhibit\nwhen trying to understand human nature.\n\n\n<b>EXT.  MINI-MART - NIGHT\n</b>\nOPEN on Tuggle's body, as the body bag is zipped up over\nhis face, and the litter is lifted into the back of the\nCoroner's wagon.\n\nWIDEN to reveal Sykes, standing nearby, watching.  The\nWagon pulls out, and Sykes turns, moving past all the LAPD\nblack-and-whites and forensics wagons, and COPS (two of\nthem aliens) and DETECTIVES, and RUBBERNECKERS (some\nalien).  He moves into:\n\n\n<b>INT.  MINI-MART - NIGHT\n</b>\nThe CRIME SCENE TEAM is checking for prints, digging slugs\nout of the wall, photographing everything.  Several\nUNIFORMED COPS mill around.  Sykes moves aimlessly around\nthe room like a stranger at a party.\n\nThe Proprietor's Wife stands near the body in a strange\nrigid posture, a thin, mournful KEENING SOUND coming from\nher lips.  A harried female uniformed cop is trying to get\nher away from the body, but can't get her to budge.\n\nMINKLER, a ballistics guy, is tagging the pump-shotgun the\nRaincoat alien dropped here.  NATUZZI, a mean-looking\nveteran uniform cop is with him.\n\n<b>\t\t\tNATUZZI\n</b>\tLooks like a standard combat pump-\n\taction.\n\n<b>\t\t\tMINKLER\n</b>\tIt is.\n\n<b>\t\t\tNATUZZI\n</b>\tSo what punched holes clear through\n\tthat car out there?\n\nMinkler pulls an evidence baggie from his work box.\nInside are four unfired twelve gauge shells.\n\n<b>\t\t\tMINKLER\n</b>\tBRI Sabot slugs.  These puppies are\n\tnasty.  Two plastic sabots fall away\n\tin flight leaving a fifty-caliber\n\tslug going two thousand feet per\n\tsecond.  Tug might as well've been\n\thiding behind a rosebush.\n\nMinkler senses somebody has just stepped up beside him.\nHe looks.  It's Sykes.\n\n<b>\t\t\tNATUZZI\n</b>\tPretty heavy artillery for knocking\n\tover a liquor store.\n\nA new voice enters the conversation.\n\n<b>\t\t\tJETSON (O.S.)\n</b>\tAn identical round was used in the\n\tshooting of a Newcomer named\n\tHubley, two days ago.\n\nSykes turns -- surprised, and not especially pleased to\nsee the voice is Jetson's.\n\n<b>\t\t\tMINKLER\n</b>\tYeah?  So why the extra fire power?\n\n<b>\t\t\tJETSON\n</b>\tPerhaps because even the larger\n\tcaliber handguns aren't always\n\teffective against my people.\n\n<b>\t\t\tSYKES\n</b>\t\t   (mulls this, then)\n\tYou saying there's some connection\n\tto this other homicide?\n\nBefore Jetson can say, the female cop who was talking to\nthe Proprietor's Wife steps up.\n\n<b>\t\t\tFEMALE COP\n</b>\tHey, give me a hand with this woman,\n\twill ya Jetson?  We've got to get\n\ther to Division for her statement\n\tand she won't budge.\n\n<b>\t\t\tJETSON\n</b>\t\t   (to Sykes)\n\tExcuse me.\n\nAnd he moves off with his partner.  Sykes calls after him,\nbut Jetson is already approaching the woman and doesn't\nturn.\n\n<b>\t\t\tSYKES\n</b>\tSo, you think there's a connection,\n\tor what?  Hey!\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  SYKES' APARTMENT BUILDING - NIGHT\n</b>\nThe slug-mobile pulls up.  A drained Sykes moves up the\nwalk to his front door.\n\n\n<b>INT.  SYKES' APARTMENT - NIGHT\n</b>\nSykes enters his apartment, an untidy bachelor place\ndecorated with negative taste.  It's obviously the maid's\ndecade off.\n\nBy rote, he hits the rewind switch on the answering\nmachine on his way into the kitchen.  The tape rewinds.\nHe opens the fridge.  Not much here.  Left-over take-out\npizza carton.  Left-over take-out Chinese food cartons.\nLeft-over take-out burger wrappers. \n\nThe answering machine message begins -- he glances over\nhis shoulder as he HEARS his daughter's VOICE.  During the\nfollowing, he reaches the fridge.  Brings out a milk\ncarton that's in his way, sets it on the counter.  Reaches\nin again and this time brings out a bottle of Stoly.  Then\nsearches for a semi-clean glass.\n\n<b>\t\t\tKRISTIN'S VOICE\n</b>\t\t   (bouncy, bride-to-be\n\t\t    happy)\n\tHi, Daddy, it's me.  I'm over at\n\tDanny's parents' house... talking\n\tabout Sunday.  I thought maybe you'd\n\tbe home by now.  Anyway, uh, nothing\n\treally.  I just wanted to call and\n\tsay I love you.  I love you, Daddy.\n\t\t   (she giggles)\n\tUh-oh, I shouldn't'a done that.\n\tKnowing you, you'll probably pull\n\tthis tape out of your machine and\n\tsave it -- in that drawer where you\n\tkeep every card I ever gave you, and\n\tall of my old baby teeth... gross!\n\tAnyway, Daddy, don't save this tape\n\t-- but I do love you, and I'll talk\n\tto you before Sunday.\n\t\t   (beat)\n\tOh, Tug and Carol came by and met\n\tDanny last week.\n\t\t   (Sykes stiffens)\n\tDanny thought Tug was the greatest\n\t-- but, then, who doesn't?  Anyway,\n\tlove you, talk to you soon.  'Bye.\n\nThe machine BEEPS and HISSES.  Sykes take the glass and\nthe bottle of vodka, crosses back toward the living room,\nswitching off the answering machine as he goes.\n\nThen he stops, turns back, takes the message tape out of\nthe machine and tosses it into a drawer.\n\n<b>\t\t\t\t    FADE TO:\n</b>\n<b>INT.  DETECTIVE SQUAD ROOM - DAY\n</b>\nSykes enters, stirring a jumbo coffee.  He's slept about\nfour hours, and his face looks like he went a few with\nHagler.  He crosses straight to Fedorchuk's desk.\n\n<b>\t\t\tSYKES\n</b>\tSo what've you got on Tuggle's\n\tkillers?\n\n<b>\t\t\tFEDORCHUK\n</b>\tJesus, Sykes -- it's been less than\n\tten hours.  Me and Alterez are on\n\tit, okay?\n\n<b>\t\t\tSYKES\n</b>\tYou don't have squat.\n\n<b>\t\t\tFEDORCHUK\n</b>\tYou ever try to make a case in\n\tSlagtown?  The list of Newcomer\n\tinformants is about as long as the\n\tlist of Mexican war heroes...\n\n<b>\t\t\tALTEREZ\n</b>\tUp yours.\n\n<b>\t\t\tFEDORCHUK\n</b>\t... Nobody talks to nobody down\n\tthere.  Half of them don't speak\n\tEnglish and the other half only when\n\tit suits them.  It's gonna take some\n\ttime.\n\n<b>\t\t\tSYKES\n</b>\tYeah, I know it's gonna take time.\n\tLike until the Ice Capades opens in\n\tHell, with you two on it.\n\nAcross the room, the Captain's door BANGS open and CAPTAIN\nWARNER pounds out, his deep voice booming through the\nsquad room.\n\n<b>\t\t\tWARNER\n</b>\tNobody wanders off!  I got an\n\tannouncement.  Get your asses back\n\tin here.\n\nTwo detectives on their way out, stop, and head back into\nthe room.  Everybody gathers around, curious, as Warner\nstands holding a sheet of paper.\n\n<b>\t\t\tWARNER\n</b>\tI'll make this short.  This is a\n\tdirective from Chief Evaner, who is\n\tacting on orders from the Mayor, who\n\tis under mandate from the Federal\n\tBureau of Newcomer Relations.  As of\n\tnine o'clock this morning, one\n\tNewcomer uniform officer has been\n\tpromoted to the rank of Detective,\n\tthird grade.\n\nThe detectives GROAN... some angrier ones grumble, \"This\nis bullshit!\", etc.\n\n<b>\t\t\tWARNER\n</b>\tAnd we've got him, gentleman.\n\t\t   (more groans)\n\tVolunteers for duty with the new\n\tdetective should see me in my\n\toffice... otherwise I will choose a\n\tvolunteer myself.  That is all.\n\nHe turns and heads back to his office in the wake of\ncontinued grumbling from the detectives.  Sykes, standing\nto one side, absently watches Warner return to his glass-\nwalled office.  Waiting inside are a balding man and an\nalien in a grey suit.  Sykes reacts.  The alien in the\nsuit is Jetson.\n\nThe grumbling continues around him as Sykes considers\nsomething.\n\n<b>\t\t\tFEDORCHUK\n</b>\tUnbelievable bullshit.\n\n<b>\t\t\tALTEREZ\n</b>\tHow long has this Slag been on the\n\tforce?  A year, max -- right?\n\n<b>\t\t\tDETECTIVE\n</b>\tI don't know about the rest of you,\n\tbut I sure as hell ain't gonna sit\n\tstill for this.  I'm calling the\n\tunion, pronto.\n\nOthers grumble.  \"Yeah!\".  Meanwhile, Sykes has decided\nsomething.  He heads toward Warner's office.  Fedorchuk\nsees this.\n\n<b>\t\t\tFEDORCHUK\n</b>\tWhere the hell is he going?\n\n\n<b>INT.  WARNER'S OFFICE - DAY\n</b>\nSykes KNOCKS and enters.\n\n<b>\t\t\tWARNER\n</b>\tYeah, Sykes?\n\n<b>\t\t\tSYKES\n</b>\tCaptain.  I'd like to volunteer for\n\tduty with the new detective.\n\nWarner is surprised.  He never expected Sykes.\n\n<b>\t\t\tWARNER\n</b>\t... All right.  Detective Sergeant\n\tSykes, this is Detective... Jetson.\n\n<b>\t\t\tJETSON\n</b>\tWe have met.\n\nWarner looks up, clocking this.  He looks at Sykes,\nstarting to smell something fishy.\n\nThe balding man, GOLDRUP, rises to shake their hands.\n\n<b>\t\t\tGOLDRUP\n</b>\tVictor Goldrup, Mayor's office.\n\tCongratulations, gentlemen.\n\nWarner is starting to suspect what Sykes is up to.\n\n<b>\t\t\tWARNER\n</b>\t\t   (to Sykes)\n\tYou are to have nothing to do with\n\tthe investigation into Bill Tuggle's\n\tdeath.  You know that.  Leave that\n\tfor Fedorchuk.\n\n<b>\t\t\tSYKES\n</b>\t\t   (nodding)\n\tDepartmental policy.\n\n<b>\t\t\tWARNER\n</b>\t\t   (to Jetson)\n\tYou?\n\n<b>\t\t\tJETSON\n</b>\tYes, sir.\n\n<b>\t\t\tWARNER\n</b>\tGood.\n\n<b>\t\t\tSYKES\n</b>\tThere's another case I'd like to\n\ttake.  A homicide -- a Newcomer\n\tnamed Hubley.\n\nJetson looks over at Sykes, knows he's up to something.\nSykes avoids his look.\n\n<b>\t\t\tWARNER\n</b>\tGranger and Pitts are already on it.\n\n<b>\t\t\tSYKES\n</b>\tGranger and Pitts have one hell of a\n\tcaseload... and I would have thought\n\twith Jetson here being the first\n\tNewcomer plainclothes, and Hubley's\n\tbody being found over in the\n\tNewcomer community...\n\n<b>\t\t\tWARNER\n</b>\tDon't tell me what to think.\n\n<b>\t\t\tGOLDRUP\n</b>\tHe's got a point.  That's the sort\n\tof thing we should be doing with\n\tthis early advancement program...\n\nLong-suffering Warner looks up at Goldrup, then finally\nsighs with resignation.  Sykes grins.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  STAIRWELL - FIRST FLOOR HALLWAY - DAY\n</b>\nThe steel door BANGS open and Sykes and Jetson exit.  Next\nto Sykes' slept-in look, Jetson in his grey suit looks\nlike a Jehovah's Witness canvasser.  They move past all\nthe black-and-whites pulling out on p.m. watch during:\n\n<b>\t\t\tSYKES\n</b>\t... and we work my hours.  I'll do\n\tthe driving, you do the paperwork.\n\tYou gotta learn it so you might as\n\twell do it all.\n\n<b>\t\t\tJETSON\n</b>\t\t   (after a moment)\n\tSergeant... I'd like to thank you\n\tfor what you're doing.\n\n<b>\t\t\tSYKES\n</b>\tWhat's that?\n\t\t   (then realizing)\n\tLook, Jetson.  Get this straight in\n\tyour head.  We're not pals, we're\n\tnot married, and we ain't gonna take\n\tlong moonlight walks together...\n\tWe're just partners.  And don't call\n\tme Sergeant.  Call me Sykes... or\n\tMatt if you have to.\n\n<b>\t\t\tJETSON\n</b>\tI am George.\n\nSykes nods absently, and they walk on... four and a half\nsteps to be exact.  Then it hits Sykes.  He seizes up\ncold.\n\n<b>\t\t\tSYKES\n</b>\tWait a minute.  George?  George\n\tJetson?\n\nJetson nods... he's used to this.\nSykes cracks up.\n\n<b>\t\t\tSYKES\n</b>\t\t   (between laughs)\n\tMan, somebody really hung one on\n\tyou!  I've heard some good ones for\n\tyou guys... Humphrey Bogart, Harley\n\tDavidson.  I guess the people at\n\timmigration got a little punchy\n\tafter a while, coming up with names\n\tfor a quarter of a million of you.\n\tYou weren't at the back of the line,\n\twere you, George?\n\n<b>\t\t\tJETSON\n</b>\tMy true name is Ss'tangya\n\tT'ssorentsa'.\n\n<b>\t\t\tSYKES\n</b>\tGesundheit.  You don't mind if I\n\tstick to George, do you?\n\n\n<b>EXT.  POLICE STATION PARKING AREA - DAY\n</b>\nThey approach Sykes' ugly sedan, the slug-mobile.\n\n<b>\t\t\tSYKES\n</b>\tAnyway, what's it matter to you if\n\twe think it's funny, right?  Whatta\n\tyou care?\n\n<b>\t\t\tJETSON\n</b>\tThat is exactly so.\n\t\t   (completely deadpan)\n\tIt is like your name... Sykes.  I'm\n\tsure it doesn't bother you at all\n\tthat it sounds like \"ss'ai k'ss\",\n\ttwo words in my language which mean\n\t\"excrement\" and \"cranium\".\n\nSykes looks at him, perplexed.\n\n<b>\t\t\tJETSON\n</b>\t\"Shit... head\".\n\nJetson gets in and slams the door, leaving Sykes standing\nthere, the smirk dropping from his face.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SLUG-MOBILE - DAY\n</b>\nThey're cruising along in downtown traffic.  Sykes drives.\nJetson is somewhat cramped in the passenger seat.\n\n<b>\t\t\tSYKES\n</b>\tLet's talk Hubley.\n\n<b>\t\t\tJETSON\n</b>\t\t   (refers to a folder\n\t\t    he holds)\n\tHis body was discovered three days\n\tago, in an alley off of Central\n\tAvenue, near downtown.\n\n<b>\t\t\tSYKES\n</b>\tWith two BRI Sabot slugs in the\n\tchest.\n\n<b>\t\t\tJETSON\n</b>\t\t   (gently correcting\n\t\t    him)\n\tThrough the chest.  Rupturing both\n\tthe primary and secondary hearts.\n\n<b>\t\t\tSYKES\n</b>\t\t   (out the window)\n\tNice signal, dickwad!\n\nJetson is momentarily thrown by this outburst from Sykes.\nThen...\n\n<b>\t\t\tJETSON\n</b>\tHe was employed at the Northwest\n\tPetroleum Refinery in Torrance.  He\n\twas manager of the Methane Facility.\n\tHe was also a principle partner in a\n\treal estate venture to develop low-\n\tcost housing for Newcomers.\n\nSykes grimaces at the mention of \"Newcomer housing\".\n\n<b>\t\t\tSYKES\n</b>\tTerrific.  A real pillar of the\n\tcommunity.\n\t\t   (beat)\n\tWas Hubley missing anything when\n\tthey found him?  Was he ripped off?\n\n<b>\t\t\tJETSON\n</b>\t\t   (checks file)\n\tThere was no wallet... but he was\n\tstill wearing a watch and two rings.\n\n<b>\t\t\tSYKES\n</b>\tThe guys at the mini-mart last night\n\tmade a half-assed stab at the money\n\tin the till -- but I don't think\n\tthat's what they were there for.  I\n\tthink we got us a couple'a\n\texecutions on our hands, George...\n\n<b>\t\t\tJETSON\n</b>\tThe murder at the mini-mart is not\n\tour case.  The Captain said--\n\nSykes looks over at Jetson, pissed.\n\n<b>\t\t\tSYKES\n</b>\tLook, you want to fit in here,\n\tright?  You want to learn how to get\n\talong?\n\n<b>\t\t\tJETSON\n</b>\tYes.\n\n<b>\t\t\tSYKES\n</b>\tWell, there's a thing about\n\tpartners, about being somebody's\n\tpartner.  You do for each other.\n\tAnd other people's rules don't mean\n\tshit.  It's the rules set up between\n\tthe two of you, that's all that\n\tcounts.  Understand?\n\t\t   (Jetson nods)\n\tOkay.  Well, my friend and partner\n\twas shot last night and I'm after\n\tthe shitbag that did it.  As my\n\tpartner, I'm asking you to respect\n\tme and help me find him.\n\nJetson considers this several moments, then--\n\n<b>\t\t\tJETSON\n</b>\tAnd as my partner, I ask you to\n\trespect me and my desire not to\n\tbreak with procedure.\n\nSykes stares at him, exasperated.  Without warning, he\nslams the car to a stop right in the middle of heavy\ntraffic, puts it in \"Park.\" Jetson, who is already a\nlittle too close to the dashboard, bangs up against it.\nHORNS instantly go crazy behind them.\n\n<b>\t\t\tJETSON\n</b>\tWhat is wrong?\n\n<b>\t\t\tSYKES\n</b>\t\t   (very calm)\n\tNothing's wrong.  I just want to get\n\tsomething straight.  You agree that\n\tthere's a good chance these two\n\tshootings are somehow related,\n\tright?\n\nYELLING joins the HORNS outside.  Jetson is visibly\nunsettled by the chaos.\n\n<b>\t\t\tJETSON\n</b>\tWell... yes, quite possibly.\n\n<b>\t\t\tSYKES\n</b>\tPossibly.  Good.  Well, would you be\n\twilling to accept the theory,\n\tGeorge, that... possibly... by\n\texamining the evidence from one case\n\twe might shed some small ray of\n\tlight on the other?  Does that sound\n\tunreasonable to you?\n\n<b>\t\t\tJETSON\n</b>\tYes... no, it is not unreasonable.\n\tAlthough I--\n\n<b>\t\t\tSYKES\n</b>\tGreat.\n\t\t   (a relieved sigh)\n\tWell, I'm sure glad that's settled,\n\taren't you?\n\nAnd with that he puts the car in gear and pulls rapidly\nout.\n\n<b>\t\t\tSYKES\n</b>\tI think we're really starting to\n\tclick now, George -- hmmm?\n\nJetson doesn't know what to think -- he just holds on.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  HALLWAY - L.A. COUNTY MORGUE - DAY\n</b>\nWINTER, a deputy Medical Examiner (human), is leading\nSykes and Jetson along the hall.  He reads on the fly from\na case file in his hand.\n\n<b>\t\t\tWINTER\n</b>\tYou know I've been over all this\n\twith Fedorchuk and Alterez this\n\tmorning...\n\n<b>\t\t\tSYKES\n</b>\tCome on.  You got nothin' better to\n\tdo, cushy county job like yours.\n\n\n<b>INT.  AUTOPSY ROOM - DAY\n</b>\nThey enter briskly through a swinging door.  They move\namong the tables (some occupied, some not) during:\n\n<b>\t\t\tWINTER\n</b>\tYeah, right.  Don't push your luck.\n\tAnyway, according to the sheet, the\n\tguy you nailed outside by the car--\n\n<b>\t\t\tSYKES\n</b>\tThe human?\n\n<b>\t\t\tWINTER\n</b>\tYeah... he was one Martin Helder.\n\tWhite male, twenty-seven.  Let's\n\tsee... wrap sheet shows one armed\n\trobbery conviction, a couple for\n\tsale of a controlled substance.\n\tOh yeah, and he was wired on coke\n\twhen you stopped his clock.\n\nThey have reached a table holding a covered body.  Winter\nunceremoniously throws back the cover.  There lies the\npale naked body of the Raincoat alien.\n\n<b>\t\t\tJETSON\n</b>\tHave you identified this one?\n\n<b>\t\t\tWINTER\n</b>\tSo far he's a John Doe.  Or a Sam\n\tSlag, if you like.\n\nJetson smiles slightly out of politeness.\n\n<b>\t\t\tWINTER\n</b>\tNo I.D. on him and -- well, you\n\tknow, no fingerprints -- so it could\n\tbe tough.  Your buddies this morning\n\twent through the mug book but\n\tcouldn't make a facial match.\n\n<b>\t\t\tSYKES\n</b>\tFedorchuk couldn't find his ass with\n\this hands in his back pockets.\n\nJetson nonchalantly looks over the alien body while Winter\nand Sykes continue talking off to one side.\n\n<b>\t\t\tWINTER\n</b>\t\t   (referring to\n\t\t    Raincoat alien)\n\tYou took this gut out, too, didn't\n\tyou?\n\n<b>\t\t\tSYKES\n</b>\tYeah.\n\n<b>\t\t\tWINTER\n</b>\tLucky for you, you got him in both\n\tof his... well, what we loosely\n\trefer to as... hearts.\n\n<b>\t\t\tSYKES\n</b>\tLucky nothing.  I had to empty my\n\tdamn gun into him.\n\n<b>\t\t\tWINTER\n</b>\tThat's the way these people are.\n\tYou don't hit both pumps you just\n\tpiss them off.\n\nDuring this, Jetson has turned the dead alien's hand over\n-- sees something that brings a frown of curiosity to his\nface.  He leans closer, examining the palm carefully.\nThen he peels back the alien's upper lip.\n\nJetson frowns anew, with concern this time.  He looks\naround, spots a Newcomer lab assistant nearby -- BENTNER.\nJetson motions him over.  Jetson begins questioning him\nusing the alien language.  Sykes and Winter nearby, remain\noblivious.\n\n<b>\t\t\tWINTER\n</b>\tOh, here's an extra headshot if you\n\tneed one.\n\t\t   (hands Sykes a\n\t\t    polariod of dead\n\t\t    alien's face)\n\tWe're just about to start cutting\n\tin.  You're welcome to stick around\n\tif you want.  It's really\n\tfascinating stuff.\n\n<b>\t\t\tSYKES\n</b>\tYeah, I'll bet.\n\nSykes looks over, now noticing Jetson and Bentner in\nearnest conversation.  He only catches snatches of the\nalien language.  Bentner appears very unsettled by what\nJetson is telling him.  In response to Jetson's final\nstatement, Bentner nods -- as if agreeing to do something\nJetson has requested.  Sykes goes over to Jetson.\n\n<b>\t\t\tSYKES\n</b>\tWhat's this?  What's going on?\n\n<b>\t\t\tJETSON\n</b>\tNothing.\n\n<b>\t\t\tSYKES\n</b>\t\t   (really suspicious\n\t\t    now)\n\tNothing?\n\n<b>\t\t\tJETSON\n</b>\t\t   (looking away)\n\tShouldn't we examine their personal\n\teffects?\n\nJetson moves off, leaving Sykes there wondering.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  PROPERTY ROOM - COUNTY MORGUE - DAY\n</b>\nTwo large plastic packets are dumped of their contents\nonto a formica counter.  Sykes looks through the dead\nalien's effects while Jetson goes through the human's.\nORTIZ, the college girl working the property counter, sits\nnearby doing homework.\n\nJetson holds up a little foil packet with a puzzled frown.\n\n<b>\t\t\tJETSON\n</b>\tWhat is this?\n\n<b>\t\t\tSYKES\n</b>\t\t   (looks, then)\n\tA rubber.  A condom.  You know...\n\tConey Island whitefish?\n\t\t   (Jetson doesn't know\n\t\t    what one is)\n\tMen, human men, put them on their,\n\tuh -- penises -- to protect against\n\thaving babies.\n\t\t   (Jetson still doesn't\n\t\t    get it; Sykes turns\n\t\t    to Ortiz)\n\tYou need this for anything?\n\n<b>\t\t\tORTIZ\n</b>\tNope, got my own.  Anything you guys\n\tdon't use gets stuffed away in\n\tstorage.\n\nSykes tears open the packet, unrolls the condom, dangles\nit before Jetson.\n\n<b>\t\t\tSYKES\n</b>\tGet the picture?\n\n<b>\t\t\tJETSON\n</b>\t\t   (frowning)\n\tAnd that fits?\n\n<b>\t\t\tSYKES\n</b>\tWell... Yeah, it's rubber.  It\n\tstretches.\n\n<b>\t\t\tJETSON\n</b>\tAnd still it fits?\n\nSykes looks at Jetson's serious expression.  He tosses the\ncondom and packet back into the counter and continues\nsearching.  A beat, then he can't stop himself -- he\nsteals a glance at Jetson's crotch.\n\nStill searching, Sykes picks up one of the dead alien's\nwell-worn heavy work boots.  He grimaces... the sides and\nsoles are painted with a viscous black substance.  He very\ntentatively sniffs it... and is grateful that it's not\nwhat he thought it might be.\n\n<b>\t\t\tSYKES\n</b>\tWhat is this stuff?\n\nSykes gets some on his hands, doesn't know where to wipe\nit.  Jetson glances over.\n\n<b>\t\t\tJETSON\n</b>\tIt is a resin.\n\nSykes looks at him... surprised that he knows.\n\n<b>\t\t\tJETSON\n</b>\t\t   (continuing)\n\tNewcomers working near methane\n\tgasses at oil refineries must paint\n\tit on their boots to protect against\n\tsparks.\n\n<b>\t\t\tSYKES\n</b>\tHow the hell do you know that?\n\n<b>\t\t\tJETSON\n</b>\tA large number of my people were\n\thired by refineries because the\n\tmethane fumes are not harmful to us.\n\tMy spouse's brother is one.\n\n<b>\t\t\tSYKES\n</b>\tSo the Slag they're cutting into\n\tupstairs worked at a refinery just\n\tlike Hubley worked at a refinery.\n\t\t   (beat)\n\tI'd say that \"possible\" connection\n\tbetween the two cases just got a\n\thell of a lot more possible.\n\t\t   (beat)\n\tOkay, next step -- I gotta go talk\n\tto the wife of the Slag store owner\n\tblown away last night.\n\n<b>\t\t\tJETSON\n</b>\tI believe I should interview the\n\twidow alone.\n\n<b>\t\t\tSYKES\n</b>\tWhy the hell--?!\n\t\t   (realizes it's\n\t\t    because of his lack\n\t\t    of \"bedside manner\")\n\tGreat, fine.  You talk to the wife.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT./ EXT.  MINI-MART - LATE AFTERNOON\n</b>\nThe shattered windows have been covered with plywood.\nThrough the open doorway we see Jetson talking to the\nProprietor's Wife.  She studies a photo Jetson shows her,\nnods her head, speaking rapidly in the alien language.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  REFINERY - LATE AFTERNOON\n</b>\nSykes drives along beside the mammoth, steaming network of\nbuildings and pipes that make up the refinery.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  REFINERY - LATE AFTERNOON\n</b>\nThrough the loud and smoky refinery we see Sykes walking\nwith the newly promoted Methane Section manager, O'NEAL,\nin tie and shirtsleeves.  The workmen around them are both\nhuman and Newcomer.\n\n<b>\t\t\tO'NEAL\n</b>\t\t   (yelling over the\n\t\t    roar)\n\tMr. Hubley was an all right guy --\n\tand a damn good manager.  The men\n\tliked him.  I'm really gonna have to\n\tscramble to fill his shoes.\n\n<b>\t\t\tSYKES\n</b>\tWell, one of the men didn't like him\n\tso much...\n\nThey stop and Sykes hands O'Neal the polariod photo of\nRaincoat alien.  They have stopped near the heavy\nrefrigeration-type door leading to the \"METHANE SECTION\".\n\nNewcomer workers move in and out through the door during:\n\n<b>\t\t\tO'NEAL\n</b>\t\t   (looking at photo)\n\tYou think this is the guy who did\n\tit?\n\n<b>\t\t\tSYKES\n</b>\tWe think he could'a been involved,\n\tyeah.  You know him?\n\n<b>\t\t\tO'NEAL\n</b>\tTo be honest, it's hard to say.  I\n\thate to admit it but -- they all\n\tstill kinda look alike to me.\n\n<b>\t\t\tSYKES\n</b>\t\t   (impatient)\n\tWho else can I ask around here?\n\n<b>\t\t\tO'NEAL\n</b>\t\t   (looking at photo\n\t\t    again)\n\tWait.  You know who it looks like?\n\tYeah.  Anderson.  Uh... James\n\tAnderson.  He isn't in today.  He\n\ttook the afternoon off.\n\n<b>\t\t\tSYKES\n</b>\tI think you're gonna find he's taken\n\tthe rest of his life off.\n\nO'Neal reacts.  Sykes notices the door to the Methane\nSection.\n\n<b>\t\t\tSYKES\n</b>\tThat where Anderson worked?\n\n<b>\t\t\tO'NEAL\n</b>\tYes it is.\n\t\t   (some alien workers\n\t\t    come through the\n\t\t    door)\n\tThirty-five percent pure Methane gas\n\tin there.  I don't know how these\n\tfellas do it.\n\nSykes watches two more alien workers pass back through the\ndoor.  O'Neal watches Sykes' expression for signs of\nsuspicion.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>HIGH ANGLE SHOT - SYKES AND O'NEAL\n</b>\nWe see Sykes hand O'Neal a card, then move off.  O'Neal\nwatches him briefly, then crosses to some steps and starts\nup this way.\nWe PAN with him as he enters a door here on the second\nlevel.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  METHANE SECTION CONTROL ROOM - LATE AFTERNOON\n</b>\nO'Neal enters, moves to a telephone, begins to dial.\nBeyond is a glass wall overlooking the Methane Section.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>ANGLE - BELOW\n</b>\nCAMERA TRACKS through the Methane Section... past the\nalien workers in lab whites... past all the arcane\nequipment and chemical procedures... ending in an EXTREME\nCLOSE UP of a small cylindrical dispenser as it fills\nslowly with a pale blue, viscous liquid.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT./ EXT.  SLUG-MOBILE - JETSON'S STREET - DUSK\n</b>\nWe're SHOOTING THROUGH the slug-mobile window as Sykes\npulls up in front of Jetson's modest but immaculately\nmaintained home on the outskirts of Slagtown.  Jetson's\nWIFE, an attractive alien woman, stands watering the lawn\nwith a garden hose.  Jetson's son, age six, rides his\nbicycle along the walkway.  Jetson, dressed in his suit\nfor work, crouches near the walkway, playing with his son.\n\nSykes pulls the car toward the curb, rolls his eyes.\n\n<b>\t\t\tSYKES\n</b>\tJesus.  Welcome back Ozzie and\n\tHarriet...\n\nHe HONKS the horn.  Jetson looks up, then moves to his\nwife and kisses her goodbye.  Moves to his son, kisses him\non the top of his head.\n\nSykes watches all this... and as he does, slowly his\nderisive expression softens.  As corny as this tableau may\nbe, there's something very appealing about the innocence\nof it... even to an unrepentant cynic like Sykes.\n\nJetson starts to climb into the car, and we--\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  RESTROOM - BILTMORE HOTEL - NIGHT\n</b>\nCLOSE on an alien hand as it removes one of the drug\ndispensers from a tuxedo pocket.  As the hand brings the\ndispenser toward the face, we immediately recognize the\nexotic silver bracelet worn by Kipling the night before.\nIt makes that distinctive CLINKING NOISE.  We PAN with the\nhand to reveal Kipling's face... sans bandana and\nsunglasses now.  He wears a black tuxedo.  He lets a small\ndab of the blue gel curl from the dispenser onto his\ntongue.  He swallows... and reacts as the rush from the\ndrug hits him.\n\nThe door to the men's room bangs open and a MIDDLE AGED\nPOLITICO enters, obviously drunk.\n\nKipling quickly pockets the dispenser, moves past the\nPolitico to the exit...\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nSykes drives, heading for the Biltmore Hotel.\n\n<b>\t\t\tJETSON\n</b>\tMrs. Porter is not taking her\n\thusband's death well.\n\n<b>\t\t\tSYKES\n</b>\t\t   (impatient)\n\tDid you learn anything?\n\n<b>\t\t\tJETSON\n</b>\tA week ago two men came to see her\n\thusband.  After they left, he was\n\tvery frightened.  She identified one\n\tof the men from a photo I showed\n\ther.  It was Hubley.\n\n<b>\t\t\tSYKES\n</b>\tAw-right.  What about the other guy?\n\n<b>\t\t\tJETSON\n</b>\tShe didn't know him.  But she said\n\ther son might.\n\n<b>\t\t\tSYKES\n</b>\tDid you talk to him?\n\n<b>\t\t\tJETSON\n</b>\tHe has not been home since that day.\n\tBut she told me where to find him.\n\nSykes nods.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  MAIN BALLROOM - BILTMORE HOTEL - NIGHT\n</b>\nThe men are in tuxedos, the women in evening gowns.  Only\ntwo of three Newcomers faces present.  Kipling threads his\nway among the tables as the MAYOR, at the speaker's\nplatform, addresses the assembly.\n\n<b>\t\t\tMAYOR\n</b>\t... Our guest speaker tonight has\n\tdone so much in his community and\n\tfor his community in such a short\n\tperiod of time.  And I must say, as\n\tthe founder of the first Newcomer\n\towned and operated corporation in\n\tSouthern California, he certainly\n\thas come quite far in the last few\n\tyears.  Granted, not as far as he\n\tcame in the years before reaching\n\tLos Angeles.\n\nThere is laughter from the VIPs.  Kipling slides into a\nseat at one of the front tables.  He leans over and\nwhispers something into the ear of the person seated to\nhis right.  We see this CLOSE UP, and don't see who he is\nwhispering to yet.  Whoever it is, nods.\n\n<b>\t\t\tMAYOR\n</b>\t\t   (continuing)\n\tAs Mayor of this city, it gives me\n\tgreat pleasure to introduce someone\n\twho has so readily made our city\n\this home... and all of us who live\n\there, his friends.  Ladies and\n\tgentlemen, William Harcourt.\n\nThe VIPs applaud as the spotlight sweeps over to a front\ntable.  At first it hits Kipling, then it adjusts to\ncapture WILLIAM HARCOURT, seated to Kipling's right.\nHarcourt is an exemplar of the successful Newcomer\nentrepreneur... handsome, charming, with cool blue eyes\nthat glint with his piercing intellect.  He rises, smiling\nwarmly, steps past his striking ALIEN DATE seated to his\nright, to make his way to the podium.  He shields his eyes\nsomewhat from the bright spotlight.\n\nOnce behind the podium, he slips his notes from a breast\npocket as the applause ebbs.\n\n<b>\t\t\tHARCOURT\n</b>\tThank you all for that very warm\n\treception.\n\t\t   (pauses, smiles)\n\tI'm particularly grateful because I\n\tactually had the gall to write that\n\tin my notes: \"Thank you all for that\n\tvery warm reception\".  Imagine how\n\tembarrassed I would've been if it\n\thadn't have been such a warm\n\treception.\n\nThe VIPs laugh.  He's won them over instantly with his\ncharm and candor.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  BILTMORE HOTEL - FOYER - NIGHT\n</b>\nSykes, followed by a reluctant Jetson, bears down on\nHarcourt, who is exiting the hotel with his Date, and\nKipling.  We see Kipling recognize Sykes from their fight\ntwo nights before... but because Kipling looks so\ndifferent, Sykes doesn't recognize him outright.  Still,\nduring this, Sykes senses something, though he's not sure\nwhat.\n\n<b>\t\t\tSYKES\n</b>\tWilliam Harcourt?\n\n<b>\t\t\tHARCOURT\n</b>\tYes...\n\n<b>\t\t\tSYKES\n</b>\tI'm Sergeant Sykes, and this is\n\tDetective Jetson, Los Angeles Police\n\tDepartment.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (nodding greeting)\n\tSergeant... Detective.  I wasn't\n\taware there were any Newcomers at\n\tthe rank of Detective yet.\n\n<b>\t\t\tJETSON\n</b>\tI am the first.\n\n<b>\t\t\tHARCOURT\n</b>\tCongratulations.  This is my\n\tadministrative assistant, Rudyard\n\tKipling.\n\n<b>\t\t\tSYKES\n</b>\t\t   (throw away)\n\tRudyard Kipling?  No shit?\n\t\t   (to Harcourt)\n\tListen, we just need a minute of\n\tyour time...\n\n<b>\t\t\tJETSON\n</b>\tWe'd like to ask you about a\n\tbusiness associate of your, Warren\n\tHubley.\n\n<b>\t\t\tHARCOURT\n</b>\tYes, I heard about poor Warren.\n\tTragic.\n\n<b>\t\t\tSYKES\n</b>\tYou were partners with him on some\n\tSlag -- uh, Newcomer real estate\n\tthing.\n\n<b>\t\t\tHARCOURT\n</b>\tThat's right.  He and I, along with\n\tseven or eight others.  Listen,\n\tgentlemen, I will be happy to assist\n\tyou in any way I can --\n\tunfortunately, at the moment, I'm\n\toverdue at another function.\n\nSuddenly there's a voice from O.S.:\n\n<b>\t\t\tMAYOR (O.S.)\n</b>\tWilliam...\n\nHarcourt turns as the Mayor and his WIFE step up.\n\n<b>\t\t\tHARCOURT\n</b>\tMr. Mayor...\n\n<b>\t\t\tMAYOR\n</b>\tWilliam, I was wondering if you\n\twouldn't rather ride with Luisa and\n\tme.  Two limousines trying to make\n\tit across town in all this traffic,\n\twe're bound to be later than we\n\talready are.\n\n<b>\t\t\tHARCOURT\n</b>\tExcellent idea.  Ray, I wonder if\n\tyou know two of your police\n\tofficers... Detective Jetson and\n\tSykes.\n\n<b>\t\t\tMAYOR\n</b>\t\t   (shaking their hands,\n\t\t    dismissively)\n\tA pleasure.\n\t\t   (to Harcourt)\n\tWe really should be going.\n\nThe wind is knocked from Sykes' sails by the presence of\nthe Mayor with a very impatient expression.  Harcourt\nsmiles.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (continuing)\n\tPlease feel free to call my office\n\tMonday morning for an appointment.\n\t\t   (to Jetson)\n\tCongratulations again on your\n\tpromotion, Detective.  Remember...\n\tyou're out there setting an example\n\tin our community.  I'll be keeping\n\tan eye on you.\n\nHarcourt is smiling as he says this last, but his eyes are\npenetrating... telegraphing a subliminal warning.\nHarcourt and entourage move off... leaving Sykes steaming.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  BILTMORE HOTEL - HARCOURT AND KIPLING - NIGHT\n</b>\nWalking behind the others.  They speak in very low voices;\nHarcourt continuing to nod and smile to other passing VIPs\nduring:\n\n<b>\t\t\tKIPLING\n</b>\tThat cop, the human, he was the one\n\twho killed Anderson and the driver.\n\n<b>\t\t\tHARCOURT\n</b>\tThis is becoming a serious breach of\n\tsecurity.\n\n<b>\t\t\tKIPLING\n</b>\tHe didn't recognize me.\n\n<b>\t\t\tHARCOURT\n</b>\tIt is his new partner that I'm\n\tworried about.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  POLICE FIRING RANGE - FRONT DESK - NIGHT\n</b>\nMAFFET, the stocky retired cop behind the counter, hands\nJetson a bag of reloads and some silhouette targets.\nSykes nods to Jetson, motioning him toward the firing\nline.\n\n<b>\t\t\tSYKES\n</b>\tGo on ahead.  I'll be right in.\n\t\t   (to Maffet, low)\n\tWhat'd you dig up for me?\n\nMaffet slides open a drawer, takes out a paper bag\ncontaining a massive pistol with an enormous bore.  By\nhis manner this deal is definitely not kosher.  Sykes\nhefts the weapon.\n\n<b>\t\t\tMAFFET\n</b>\tYou said you wanted the biggest\n\tthing I could find... Well, this is\n\tit.\n\n<b>\t\t\tSYKES\n</b>\tWhat is it?\n\n<b>\t\t\tMAFFET\n</b>\tCasull .454 Magnum.  You're talking\n\ttwice the impact energy of .44\n\tMagnum hot loads.\n\n<b>\t\t\tSYKES\n</b>\t\t   (flips open cylinder)\n\tOnly holds five.\n\n<b>\t\t\tMAFFET\n</b>\tYeah, the shells are too big for six\n\tin an cylinder.  Hell, Matt, you\n\tdon't need but one.\n\n<b>\t\t\tSYKES\n</b>\t\t   (sighting)\n\tNo... two.\n\n\n<b>EXT.  SHOOTING RANGE - FIRING LINE - NIGHT\n</b>\nJetson, looking bizarre in his ear-protectors, is taking\ncareful aim with his .38 as Sykes walks up.  Jetson slips\nthe protectors down.\n\n<b>\t\t\tSYKES\n</b>\tWell, let's see what you got,\n\tCochise.  Gimme six, rapid fire.\n\nJetson, a little nervous at this command performance,\nturns, sets, and FIRES at the silhouette target.  It's a\nlarge, sloppy grouping.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tHow long you been shooting?  That's\n\tpitiful.  Whattya gonna do if\n\tsomebody draws down on you, wave\n\tyour scores on the written exam at\n\t'em?\n\nSykes starts loading the thumb-sized bullets into the\nCasull.\n\n<b>\t\t\tJETSON\n</b>\tWhy did you do it?\n\n<b>\t\t\tSYKES\n</b>\tWhy'd I do what?\n\n<b>\t\t\tJETSON\n</b>\tAgree to work with me?  You don't\n\tlike me... you don't like any of us.\n\tYou have nothing but contempt for\n\tus.  And yet you become an outcast\n\tfrom your club of detectives by\n\tmaking me your partner...\n\n<b>\t\t\tSYKES\n</b>\tMy partner is dead!  Because one of\n\tyou bastards killed him -- then\n\tdisappeared into a rathole down in\n\tSlagtown, where he's home and dry,\n\t'cause nobody sees nothing, nobody\n\tsays nothing...\n\nSykes grabs a bullet-proof vest from nearby, slaps it onto\nthe hanging target form.  He hits the switch, running the\ntarget down to the end of the lane.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tBut he didn't figure on you, George.\n\tYou're going to get me through that\n\twall of silence.  You're going to\n\tmake them talk to me.  You're going\n\tto help me find that Slag son-of-a-\n\tbitch.  Comprendo?  And if Fedorchuk\n\tand the boys in the bullpen don't\n\tlike it, screw them... and if the\n\tCaptain doesn't like it, screw\n\thim... and if all the Slags down in\n\tSlagtown don't like it... well screw\n\tthem too!\n\nSykes raises the Casull, fires.  KA-BOOM!!!  The shell\nrockets clean through the bullet-proof vest on the target\nform.  The recoil slams Sykes back, jerks his arm up.  KA-\nBOOM!!!  again, and another hole is drilled through the\nvest.  Other shooters look over.  Sykes sets the gun\ndown... sees his hand is bleeding.  Jetson absorbs all\nthis, as we--\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  \"X\" BAR - NIGHT\n</b>\nA violet neon \"X\" FILLS FRAME, flashing hypnotically.\nIt's a bar catering to rough-trade Newcomer clientele.\nSeveral ALIEN MEN, brute laborer-types, lounge around out\nfront.  They glare with antagonism as Sykes and Jetson\nclimb out of their car.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Jetson)\n\tOkay, just stay back and do what I\n\tdo.  Watch and learn, watch and\n\tlearn...\n\n\n<b>INT.  \"X\" BAR - NIGHT\n</b>\nSykes and Jetson walk into the almost total blackness of\nthis all-Newcomer place.\n\nA few near-infrared indigo lamps dot the blackness.\n\n<b>\t\t\tSYKES\n</b>\tI can't see dick in here.\n\nWe can dimly make out booths along one wall, some tables,\nand the bar.  There are maybe twenty figures seated or\nstanding in the darkness.  The room falls silent in a wave\nas Sykes' presence becomes noticed.\n\nSykes saunters forward, commanding the space with his\nunhurried movements.\n\n<b>\t\t\tSYKES\n</b>\t\t   (calling into the\n\t\t    dark silence)\n\tWhich one'a you Slags is Porter?\n\n<b>\t\t\tVOICE\n</b>\t\t   (from the back of\n\t\t    the bar)\n\tWho wants to know?\n\nSykes squints into the darkness, then--\n\n<b>\t\t\tSYKES\n</b>\t\t   (aside to Jetson)\n\tWho said that?\n\n<b>\t\t\tJETSON\n</b>\t\t   (tilts his head to\n\t\t    indicate)\n\tAt the end of the bar.\n\nSykes nods, starts in that direction.\n\n<b>\t\t\tSYKES\n</b>\tMy name is Sykes.  I'm--\n\n<b>\t\t\tALIEN VOICE\n</b>\tSs'ai k'ss?\n\nThe whole place roars with LAUGHTER.  Too late Sykes\nremembers what his name sounds like to them.  He continues\ndown the bar and a figure in one of the booths sticks his\nleg out and trips Sykes with his size 16 work boot.  Sykes\nstumbles, then recovers and pivots on the offender.  Hoots\nand derisive LAUGHTER.  He sees only shadows.\n\n<b>\t\t\tOFFENDER\n</b>\t\t   (merely a voice in\n\t\t    the dark)\n\tCareful, ss'loka', you might hurt\n\tyourself.\n\nMore laughter.  Sykes gives the darkness where the\noffender sits a hard stare, then turns and shoulders his\nway to the end of the bar.  Jetson follows.  Sykes stops\nbehind a big Newcomer in greasy work clothes.\n\n<b>ANGLE\n</b>\nThe punk Newcomer in the next seat is keeping his head\ndown, trying to be inconspicuous.\n\nHe glances over at the two cops... his expression shifting\nto recognition as he spots Jetson.\n\n<b>BACK TO SCENE\n</b>\nSykes speaks to the Big Newcomer's back.\n\n<b>\t\t\tSYKES\n</b>\tYou Porter?\n\nThe Big Newcomer continues to sip his mug of sour milk.\nDoesn't turn.  Sykes grabs him by the shoulder and turns\nhim around.  The alien grabs Sykes' hand off, rising to\nhis full height.  He and Sykes lock eyes.  Meanwhile.  the\npunk Newcomer (PORTER) has started to slip away unnoticed.\nJetson spots him, reaches out with one arm, and grabs him\nby the jacket.\n\n<b>\t\t\tJETSON\n</b>\tNo, Matthew.  I believe this is the\n\tone you want.\n\nHe pulls Porter back into play.  Now Jetson sees Porter's\nface... and he, too, reacts with recognition.\n\nSykes gives Jetson a sour look, releases the Big Newcomer,\nand turns his malice on the punk Newcomer.\n\n<b>\t\t\tSYKES\n</b>\tYour name wouldn't happen to be\n\tPorter, would it?\n\n<b>\t\t\tJETSON\n</b>\tUh, Matthew...\n\n<b>\t\t\tSYKES\n</b>\t\t   (over his shoulder\n\t\t    to Jetson)\n\tBack off, George.\n\n<b>\t\t\tJETSON\n</b>\tBut I-- (know this man).\n\n<b>\t\t\tSYKES\n</b>\tI'll handle it.\n\nJetson backs off, letting him handle it.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Porter)\n\tJesus, are the questions too tough\n\tfor you already?  Let's try again--\n\t\t   (slowly)\n\tIs your name Porter?\n\n<b>\t\t\tPORTER\n</b>\tSs'kya'ta'.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Jetson)\n\tWhat's that?\n\n<b>\t\t\tJETSON\n</b>\tScrew you.\n\n<b>\t\t\tSYKES\n</b>\t\t   (back to Porter)\n\tScrew me?  That can't be right.\n\n<b>\t\t\tPORTER\n</b>\tSs'kya ta' ss'loka'.  Ss'trokya'\n\tss'lato na'!\n\n<b>\t\t\tJETSON\n</b>\t\t   (to Sykes, low)\n\tYou don't want to know.\n\n<b>\t\t\tSYKES\n</b>\tTell me.\n\n<b>\t\t\tJETSON\n</b>\tYour mother mates out of season.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Porter)\n\tThat's very colorful.  But see --\n\tnow I've got a problem.  I don't\n\tseem to be getting much cooperation\n\tfrom you, Porter.  So I guess we're\n\tgonna have to take this little\n\tsession down to my office, ya\n\tknow?\n\nAnd instantly Sykes whips out this flashlight, snaps on\nthe beam, and arcs it into the faces of the aliens around\nhim.  Jetson gets a blast of it, too.  The aliens are\nmomentarily blinded.\n\nSykes has Porter pinned to the bar, the flashlight in his\nface, as he starts to handcuff him.  But Porter gets a\nhand free and crushes the head of the flashlight.\nDarkness falls... along with Sykes' expression of\nsatisfaction.\n\nPorter hurls Sykes back, slamming him into a table.  The\ncrowd HOOTS and CHEERS.  Sykes finds his way to his feet.\n\n<b>\t\t\tJETSON\n</b>\tMatthew, you don't have to-- (do this).\n\n<b>\t\t\tSYKES\n</b>\tStay back!  I'm okay.\n\nHe charges Porter, brandishing the flashlight like a club.\nThe two of them battle, then Sykes sees his opportunity\nand brings his knee up viciously into the alien's groin.\nPorter doubles over in feigned agony, then slowly rises\nagain -- smiling.\n\n<b>\t\t\tPORTER\n</b>\tDon't they teach you anything about\n\tus in cop school, little ss'loka'?\n\nPorter grabs Sykes by the shirt front, is about to deliver\na crushing blow, when another arm cuts into FRAME, locking\nwith Porter's, blocking the punch.  It is Jetson.\n\n<b>\t\t\tJETSON\n</b>\tEnough.\n\n<b>\t\t\tPORTER\n</b>\t\t   (eyeing Jetson)\n\tSs'tangya T'ssorentsa'.  You're a\n\tcop.\n\t\t   (with some contempt)\n\tIt fits you.\n\nJetson says something to him in the alien language.\nPorter gives him a hard stare, then moves toward the back\nexit.  Sykes stumbles over to Jetson.\n\n<b>\t\t\tSYKES\n</b>\tYou know that guy?\n\n<b>\t\t\tJETSON\n</b>\t\t   (nods)\n\tFrom quarantine, when my people\n\tfirst arrived here.  He and I were\n\thoused together.\n\n<b>\t\t\tSYKES\n</b>\tHow could a straight-arrow like you\n\tever pick a roommate like him?\n\n<b>\t\t\tJETSON\n</b>\tIn the camps, we were lodged four to\n\ta room.  The selection process was\n\tentirely random.  We did not get to\n\tstay with our friends... or\n\tfamilies...\n\nAnd he moves toward the back exit.  Sykes watches him go.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  \"X\" BAR - NIGHT\n</b>\nPorter leans against an alley wall.  He speaks English\nlearned on the streets.\n\n<b>\t\t\tJETSON\n</b>\tYou don't know what your father and\n\tthese two men were arguing about?\n\n<b>\t\t\tPORTER\n</b>\tI told you -- I was in the back of\n\tthe store.  I just heard voices,\n\tmuffled like.\n\n<b>\t\t\tSYKES\n</b>\tOne of the two men was Hubley,\n\tright?  What about the other one?\n\tDid you know him?\n\n<b>\t\t\tPORTER\n</b>\tYeah... I seen him around.  High-\n\troller dude named Strader.  Joshua\n\tStrader.  Runs a club on the west\n\tside.  Encounters.\n\n<b>\t\t\tSYKES\n</b>\tYeah, I heard of it.\n\n<b>\t\t\tPORTER\n</b>\tThat's all I know.  You want\n\tanything more, you ask somebody\n\telse.\n\nHe pushes away from the wall, heads for the door to the\nbar.\n\n<b>\t\t\tJETSON\n</b>\tI am sorry about your father.\n\nPorter throws him a look over his shoulder, then\ndisappears through the door.  Sykes and Jetson start down\nthe alley.\n\n<b>\t\t\tJETSON\n</b>\tIf I may make a suggestion... We\n\thave different weak spots than you\n\tdo.  Next time, a blow to the nerve\n\tplexus under the arm, here, will\n\tproduce the effect I think you were\n\tlooking for.\n\n<b>\t\t\tSYKES\n</b>\tYeah, sure.  I knew that...\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  BURGER STAND - NIGHT\n</b>\nThe wall-mounted menu is in English and the Alien\nLanguage.  The SERVERS are teen aged humans and aliens.\n\nSykes and Jetson stand at the counter awaiting their\norder.\n\n<b>\t\t\tKID\n</b>\t\t   (serving them)\n\tSix forty-two.\n\nThey both put money on the counter.  The kid goes to put\nthe order together.  Sykes looks at the alien characters\non the menu.\n\n<b>\t\t\tSYKES\n</b>\tI don't think I could ever learn to\n\tread that shit.\n\t\t   (beat)\n\tHow long did it take you to learn\n\tEnglish?\n\n<b>\t\t\tJETSON\n</b>\tThree months.\n\t\t   (off Sykes' look)\n\tWe learn quickly.  We adapt.  It is\n\tour strength... what we were bred\n\tfor, to adapt to hostile\n\tenvironments.\n\nThe Serving Kid puts their bags on the counter.\n\n<b>\t\t\tJETSON\n</b>\t\t   (continuing)\n\tThank you.\n\nThey take the bags and walk off, digging the food out of\nthe bags as they talk:\n\n<b>\t\t\tSYKES\n</b>\tMy neighbor's kid has a Newcomer\n\tgirl in his class.  She's six years\n\told and in seventh grade already...\n\nThey climb into the car.\n\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nJetson doesn't respond... some things are better left\nunaddressed.  Meanwhile, Sykes has unwrapped his food and\nrecoils in disgust.\n\n<b>\t\t\tSYKES\n</b>\tOh, God.  I think I got yours\n\there...\n\nHe holds up two strips of raw meat with patches of animal\nfur still on them.  Jetson meanwhile is grimacing at the\ndripping cheeseburger he's just unwrapped.  They quickly\ntrade.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tWhich one is that?  Raw what?\n\n<b>\t\t\tJETSON\n</b>\t\t   (eating a strip)\n\tThis is mole.  It's good.\n\n<b>\t\t\tSYKES\n</b>\tI'll bet.\n\t\t   (winces, watching him\n\t\t    chew)\n\tWould it really put you out if they\n\ttossed that on the grill for a\n\tminute or two?\n\n<b>\t\t\tJETSON\n</b>\tOur bodies do not assimilate the\n\tnutrients if the food has been\n\tcooked.\n\nJetson looks over at him, smiling.\n\n<b>\t\t\tSYKES\n</b>\tOh, that's real attractive.  You got\n\tfur in your teeth, George.  Come on,\n\tman, we're gonna be talking to\n\tpeople... jeez.\n\nSykes looks at his burger, his appetite gone, shoves it\nback into the sack and tosses it into the back seat.\n\n\n<b>INT./ EXT.  SLUG-MOBILE - NIGHT\n</b>\nAs Sykes pulls onto the street.\n\n<b>\t\t\tSYKES\n</b>\tSo what was that other word for\n\tHuman... Slow ka?\n\n<b>\t\t\tJETSON\n</b>\tSs'loka'.  It means literally \"small\n\tbut intelligent creature\".\n\t\t   (Sykes looks over,\n\t\t    doesn't know if he\n\t\t    likes this)\n\tIt loses much in the translation.\n\n<b>\t\t\tSYKES\n</b>\tAnd what was that one about my\n\tmother?  That was a good one.\n\n<b>\t\t\tJETSON\n</b>\tSs'trokya ss'lato 'na'.\n\n<b>\t\t\tSYKES\n</b>\tYeah, that's it.  Say it slow.\n\nJetson pronounces the words and Sykes follows along\nhaltingly.  After several tries, he can say it passably\nwell.\n\n\n<b>INT.  ENCOUNTERS - NIGHT\n</b>\nAn upscale, mostly yuppie-human dance club.  The\nantithesis of the \"X\" bar.  A human HOSTESS in a slit\ndress has just finished seating Sykes and Jetson at a\ntable.  She moves off.  The two cops look up at the stage.\n\n<b>REVERSE ANGLE\n</b>\nrevealing the exotic alien dancer named CASSANDRA.  She\nmoves with a feline blend of strength and grace.  Framing\nher face is a silvery nylon wig that she tosses like a\nmane as she undulates to the MUSIC.\n\nSykes watches with fascination.  The MUSIC ends and\nCassandra steps down from the stage, to be replaced by a\nhuman DANCER as the next SONG cranks up.  Sykes and Jetson\nquickly intercept her as she heads backstage.\n\n<b>\t\t\tJETSON\n</b>\tYou are Cassandra?\n\n<b>\t\t\tCASSANDRA\n</b>\tThat's right.\n\n<b>\t\t\tJETSON\n</b>\tWe are with the Police Department.\n\tThis is Sergeant Sykes, and I am--\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (laughing)\n\tSs'ai k'ss?  Perfect.\n\n<b>\t\t\tSYKES\n</b>\tWe're looking for your boss --\n\tStrader.\n\nShe eyes the two of them warily, then moves backstage,\nassuming they will follow.\n\n\n<b>INT.  BACKSTAGE - NIGHT\n</b>\nShe moves along the narrow corridor.\n\n<b>\t\t\tCASSANDRA\n</b>\tHe's not here.  Why ask me?\n\n<b>\t\t\tJETSON\n</b>\tThe young woman at the front said\n\tyou might know where he is.\n\n<b>\t\t\tCASSANDRA\n</b>\tShe did, did she?  Well, she was\n\twrong.  Excuse me, I have to change.\n\n<b>\t\t\tSYKES\n</b>\tNo problem.\n\nShe moves through a door.  Sykes follows closely so does\nJetson.\n\n\n<b>INT.  ENCOUNTERS - DRESSING ROOM - NIGHT\n</b>\nCassandra grabs some clothes and goes into a stall.\n\n<b>\t\t\tSYKES\n</b>\tLook, we're not here doing an\n\tinterview for the school paper.\n\tThis is a homicide investigation...\n\tand if you don't stop jerkin' us\n\taround, I'm ready to start playin'\n\thardball.\n\nJetson has waited politely half-in half-out of the room.\nSykes rapidly motions to him to \"go look around\".  Jetson\nmimes back, \"Huh?\"\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (slipping out of her\n\t\t    dance costume)\n\tOooh.  Hardball.  That sounds\n\tinteresting.  Are you going to\n\tstrike me?  You could tie me up and\n\tthen do whatever you want with me...\n\tI've got my own ropes.\n\n<b>\t\t\tSYKES\n</b>\t\t   (still miming to\n\t\t    Jetson)\n\tDoes that cost extra or you throw\n\tthem in?\n\n<b>\t\t\tCASSANDRA\n</b>\tYou've got me all wrong.  I don't\n\tcharge money for something that I\n\tmyself find pleasurable...\n\nFinally Jetson gets what Sykes is trying to tell him.  He\nsays in the uncertain, stagy voice of a bad liar:\n\n<b>\t\t\tJETSON\n</b>\tI am going out to the car.  I will\n\tmeet you there.\n\nSykes rolls his eyes as Jetson exits into the corridor.\nCassandra emerges from the stall, wearing a long, stylish,\nlow-cut dress.\n\n<b>\t\t\tCASSANDRA\n</b>\tLook, I don't know where Mr.\n\tStrader might be.  He comes and he\n\tgoes.\n\n<b>\t\t\tSYKES\n</b>\t\t   (starting to feel a\n\t\t    little uncomfortable)\n\tThe girl out front mentioned\n\tStrader's assistant, somebody named\n\tWatson.  Maybe he knows.\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (tensing slightly)\n\tTodd?  Todd doesn't know either.\n\nShe is very close to Sykes now.  She fingers the lapel of\nhis jacket.\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (continuing)\n\tI know... Why don't you hang around\n\tfor a while, let me entertain you?\n\tIt's Matt, right?  Now tell me the\n\ttruth, have you ever... made it...\n\twith one of us?\n\n<b>\t\t\tSYKES\n</b>\tNot unless I got real drunk and\n\tnobody told me about it later.\n\n<b>\t\t\tCASSANDRA\n</b>\tA virgin.  I find that very\n\tarousing...\n\n\n<b>INT.  SECOND FLOOR CORRIDOR - NIGHT\n</b>\nMUSIC drifts up from downstairs.  Jetson moves along the\ncorridor, scoping things out.  He tries a door.  Locked.\nTries another one.  Open.  He eases it wider, then enters\nthe darkened office.\n\n\n<b>INT.  OFFICE - SECOND FLOOR - NIGHT\n</b>\nJetson moves into the office.  Looks around.  Makes his\nway to the cluttered desk top.  Pushes things around...\nall the usual stuff.  He starts to turn away, then his eye\ncatches something sticking out from behind a row of ledger\nbooks.  He reaches for it.  A small dispenser -- of the\nkind we saw being filled at the refinery.  Jetson studies\nit, his suspicions growing.  Opening it, he finds only the\nbarest trace of a viscous substance.\n\nHe smells it... not enough to tell for certain what it is.\nBut enough that he is very concerned about what it could\nbe.\n\n\n<b>INT.  CASSANDRA'S DRESSING ROOM - NIGHT\n</b>\nCassandra is practically melting herself into Sykes now.\nShe takes his hand and guides his fingertips over her\nfacial ridges.  She shudders with pleasure.  Sykes begins\nto perspire.\n\n<b>\t\t\tSYKES\n</b>\tThere's lots of things I haven't\n\tdone, but his ain't high on the\n\tlist.  Don't take it personally.\n\n<b>\t\t\tCASSANDRA\n</b>\tI think you're just a little scared\n\tnow, about what you might find once\n\tthe lights go out.  A little\n\tscared... and a lot curious.  Maybe\n\tmore than you want to admit.  But\n\tdoesn't that turn you on, that\n\tcuriosity and fear, swirling\n\ttogether?\n\t\t   (coos)\n\tThink of it as broadening your\n\thorizons.\n\n<b>\t\t\tSYKES\n</b>\tI like my horizons narrow.\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (pressing herself\n\t\t    into him)\n\tYour voice is saying no, but your\n\tbody is saying yes.\n\nHe quickly disengages from her.\n\n<b>\t\t\tSYKES\n</b>\tMy voice, body, and everything else\n\tis saying I'll be back in two hours\n\tfor Strader, and he better damn well\n\tbe here.\n\nHe shoves a business card at her, then retreats through\nthe door.\n\n\n<b>INT.  CORRIDOR - NIGHT\n</b>\nSykes closes the door and lets out his breath.\n\n\n<b>INT.  CASSANDRA'S DRESSING ROOM - NIGHT\n</b>\nCassandra's expression instantly turns to worry and she\nquickly crosses to a phone and punches the intercom\nbutton.\n\n\n<b>INT.  OFFICE - SECOND FLOOR - NIGHT\n</b>\nJetson, looking through a desk drawer, hears the intercom\nBUZZ in the next room.  Through the wall--\n\n<b>\t\t\tWATSON (O.S.)\n</b>\t\t   (tentatively)\n\tYes...?\n\n<b>\t\t\tCASSANDRA (O.S.)\n</b>\t\t   (over the intercom,\n\t\t    breathless)\n\tTodd, it's me.  The police were just\n\there... looking for Strader.  And\n\tasking about you.\n\nJetson moves toward the door to the adjoining office,\ndrawing his gun.  The floor squeaks beneath his feet.  He\nlooks down, then continues toward the door.\n\n\n<b>INT.  OFFICE - SECOND FLOOR - NIGHT\n</b>\nJetson eases open the door.  It's the manager's private\noffice.  Jetson sees the phone receiver resting on the\ndesk, the desk lamp on, a lit cigarette in an ashtray --\nbut no one behind the desk.  Jetson eases through the door\nand--\n\n-- a chair crashes down on him from behind the door!\nJetson goes down, his gun skittering out of his hand.\n\n\n<b>INT.  PRIVATE OFFICE - NIGHT\n</b>\nJetson and his assailant battle in the well-appointed\noffice.\n\n\n<b>INT.  OFFICE - SECOND FLOOR CORRIDOR - NIGHT\n</b>\nSykes hears the fight through the private office door.\nHe throws the door open.\n\n\n<b>INT.  PRIVATE OFFICE - NIGHT\n</b>\nSykes stands in the doorway, the Casull straight-armed at\nJetson's assailant.\n\n<b>\t\t\tSYKES\n</b>\tFreeze!  Now!\n\nThe assailant does.  He looks at Sykes, scared, breathing\nhard.  He's a Newcomer in a snappy Armani suit.  This is\nTODD WATSON.  Jetson, on the floor, starts to rise.\n\nSuddenly somebody flies at Sykes from the side, knocking\nhim sideways down the corridor.  It's Cassandra.  Watson\nseizes the moment and shoves the off-balance Jetson into\nsome furniture and dives for the door.\n\n\n<b>INT.  SECOND FLOOR CORRIDOR - NIGHT\n</b>\nWatson runs down the corridor, ducking onto a fire escape.\nMeanwhile Sykes wrestles with Cassandra.  She's as strong\nas he is, but he has the edge in experience.\n\nJetson, disheveled, appears in the private office doorway,\nready to chase Watson, but not knowing which way he went.\n\n<b>\t\t\tSYKES\n</b>\t\t   (struggling with\n\t\t    Cassandra)\n\tFire escape!  End of the hall!\n\nJetson nods, takes off down the corridor.  Sykes manges to\nget one handcuff on Cassandra's wrist, the other cuff\naround a pipe sticking out of the wall.  She SCREECHES at\nhim in the alien language as he collects the Casull and\ncharges down the corridor.\n\n\n<b>EXT.  FIRE ESCAPE - OUTSIDE ENCOUNTERS - NIGHT\n</b>\nJetson pounds down the fire escape.  Below him, he sees\nWatson reach the ground and take off running for the\nparking area.\n\nJetson reaches the ground and gives chase.\n\n\n<b>EXT.  ENCOUNTERS PARKING LOT - NIGHT\n</b>\nWatson zig-zags through the parked cars, Jetson cutting\ndown other rows trying to make up the distance between\nthem.\n\n\n<b>EXT.  FIRE ESCAPE - OUTSIDE ENCOUNTERS - NIGHT\n</b>\nSykes bangs down the fire escape, leaping the last fifteen\nfeet to the ground.\n\n\n<b>EXT.  ENCOUNTERS PARKING LOT - NIGHT\n</b>\nWatson reaches his Alfa Romeo, yanks open the door, fires\nit up.  Jetson slides up, ten feet behind the car, pulls\nhis gun, aims.\n\nThe white reverse-lights flash on.  Jetson stands there,\ngun aimed -- but he hesitates to shoot.  In that split\nsecond hesitation, Watson floors it... Jetson jumping to\navoid being hit.\n\n\n<b>INT.  ALFA ROMEO - NIGHT\n</b>\nWatson throws the car into Drive, looks up, and sees Sykes\nstanding right in front of the car.  He hits the gas.\nSykes has no choice then to leap onto the hood of the car.\nWatson, with Sykes' face on the other side of the glass,\npanics and--\n\n\n<b>EXT.  ENCOUNTERS PARKING LOT - NIGHT\n</b>\n-- plows the Alfa into some parked cars.\n\nSykes is up in a flash -- yanks Watson out of the car.\n\nWatson rears back to swing at Sykes, when Sykes swings his\narms around in two wide arcs, his fists landing two direct\nhits in the nerve centers under Watson's arms.  Watson\nfolds over with a \"ooowwph\" sound and drops to his knees.\n\n<b>\t\t\tSYKES\n</b>\t\t   (breathing hard)\n\tI'll be damned.  It worked.\n\t\t   (sees Jetson run up)\n\tHow'd you like that, huh?  Whammo!\n\tBoth barrels.  Dropped him like a\n\tbag of cement.\n\nJetson picks up Watson's fallen wallet.  He looks at the\n<b>I.D.\n</b>\n<b>\t\t\tSYKES\n</b>\tWho is he?\n\n<b>\t\t\tJETSON\n</b>\tTodd Watson.  The assistant manager.\n\nWatson is still doubled over, just trying to draw one\nagonized breath.\n\n<b>\t\t\tWATSON\n</b>\tI don't believe this.  Look at my\n\tsuit.  Look at what you made me do\n\tto my car.\n\n<b>\t\t\tSYKES\n</b>\t\t   (laughing)\n\tYour girlfriend put up a better\n\tfight than you did, pal.\n\n<b>\t\t\tJETSON\n</b>\tWe are looking for your employer,\n\tJoshua Strader.\n\n<b>\t\t\tWATSON\n</b>\tHe's out of town.\n\n<b>\t\t\tJETSON\n</b>\tWhy did you run?\n\n<b>\t\t\tWATSON\n</b>\tBecause you two were chasing me.\n\n<b>\t\t\tSYKES\n</b>\tWe were chasing you because you ran,\n\tyou dumb son-of-a-bitch.\n\n<b>\t\t\tJETSON\n</b>\tWhen will Strader return?\n\n<b>\t\t\tWATSON\n</b>\tWho knows.  He's the boss -- he\n\tdoesn't have to check in with me.\n\n<b>\t\t\tSYKES\n</b>\t\t   (wearily)\n\tWatson... this is my partner here's\n\tfirst coupla days, and he wants to\n\tmake a good impression.  Me, though,\n\tthe way I feel -- this could be my\n\tlast day, know what I mean?  And I'm\n\tready to rain on you like a cow\n\tpissin' on a flat rock.\n\n<b>\t\t\tWATSON\n</b>\tLook -- Mr. Strader hasn't been\n\taround for a coupla days.  He didn't\n\ttell me where he was going or when\n\the'd be back.  I swear it.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Jetson)\n\tWhat do you think?\n\n<b>\t\t\tJETSON\n</b>\tI believe he is probably lying.\n\n<b>\t\t\tSYKES\n</b>\tThrough his ass.\n\t\t   (to Watson)\n\tNext time you see him, tell him to\n\tcall me... unless you want us to\n\tkeep coming back on you like a bad\n\tcase of herpes.\n\nSykes shoves a business card in Watson's breast pocket.\nThey walk away and Watson slumps against his car.\n\n<b>ANGLE - MOVING WITH SYKES AND JETSON\n</b>\nas they walk wearily to the slug-mobile.\n\n<b>\t\t\tSYKES\n</b>\tGeorge, you can handle the women\n\tfrom now on, you mind?\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  ENCOUNTERS PARKING LOT - NIGHT\n</b>\nWatson is alone, surveying the damage to his Alfa, when he\nhears footsteps.  He turns with a \"What now?\" expression\nand -- a shotgun butt is slammed into his forehead.  He\ngoes down.  Kipling stands over him, flanked by FOUR HUMAN\nTHUGS.  One of these is QUINT, senior human in Harcourt's\nemploy.\n\n<b>\t\t\tQUINT\n</b>\t\t   (to other Thugs)\n\tOkay, scrape him up.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  ZUMA BEACH APPROACH _ NIGHT\n</b>\nHarcourt's private limo glides down the narrow access\nroad, passing a lookout car attended by two alien Thugs.\nThe limo moves down to the beach, parking near an n.d.\nvan.\n\nHarcourt exits the limo, walks onto the sand to the back\nof the van.  Here he finds Kipling and Quint and the three\nhuman Thugs.\n\nThey have Watson chained to the van's rear bumper, facing\nthe sea, and have been working him over with a tire iron.\nHe's bruised and bloody, but still conscious.\n\n<b>\t\t\tHARCOURT\n</b>\tAny progress?\n\n<b>\t\t\tQUINT\n</b>\tMy arm's gettin' tired and so far,\n\tzip.\n\n<b>\t\t\tKIPLING\n</b>\tHe is ss'verdlatya ss'alo to\n\tStrader.\n\n<b>\t\t\tQUINT\n</b>\tWhat's that mean?\n\n<b>\t\t\tKIPLING\n</b>\tDuty-bonded.  His allegiance to\n\tStrader is above pain or life.\n\n<b>\t\t\tQUINT\n</b>\tYou tellin' me this guy would die\n\tbefore he'd screw his boss and work\n\tfor us?  Nobody's that dumb.\n\n<b>\t\t\tKIPLING\n</b>\tIt is something you couldn't\n\tcomprehend, Quint.\n\nHarcourt approaches Watson, kneels beside him, careful to\nkeep the knee of his designer pants out of the sand.\n\n<b>\t\t\tHARCOURT\n</b>\tI understand you have been resisting\n\tmy offer Mr. Watson.  Your sense of\n\tduty to Mr. Strader is noble, but --\n\tno longer an issue, I'm afraid...\n\nHarcourt signals and the two Thugs drag an alien body from\nthe back if the van: a middle-aged alien, Strader, shot\ntwice through the front of his silk suit.  Watson's eyes\nwiden in fear.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (continuing)\n\tI will not make this offer again.  I\n\twant you to work for me, to manage\n\tthe nightclub as Strader's successor.\n\tIf you do, you will know a wealth\n\tand comfort our people never dared\n\timagine...\n\nWatson stares at Harcourt, scared but defiant.\n\n<b>\t\t\tWATSON\n</b>\tSss'k'a ta'!\n\nHarcourt studies Watson a moment, perhaps even admiring\nhis resolve.  Then--\n\n<b>\t\t\tHARCOURT\n</b>\tIt is such a pity to die for an\n\toutmoded value.\n\t\t   (rising)\n\tMr. Quint, I believe it's time for\n\tour friend's swimming lesson.\n\nWatson freaks out, howling and lashing against the chains.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (to Watson)\n\tIt's important to learn new skills.\n\tEssential to your growth as a\n\tperson.\n\nQuint and the Thugs free Watson from the bumper.  He bucks\nand lunges as they drag him toward the surf.  Quint\naddresses one of the Thugs, a new guy.\n\n<b>\t\t\tQUINT\n</b>\tYou never seen this before, have\n\tyou, Billy?  oh, man, you ain't\n\tgonna believe it... seawater is like\n\tbattery acid to these guys... I\n\tdon't know what it is, some kinds\n\tchemical reaction.  Whatta you think\n\tit is, Watson?  Whoa, hold him.\n\t\t   (a wave breaks\n\t\t    outside, the foam\n\t\t    rolls in)\n\tWhat I love about the surf is you\n\tcan never tell how far up it's going\n\tto come until it... whoops, got a\n\tlittle wet there.\n\nThe wave just sloshes over Watson's lower legs.  He\nscreams.  Flailing, one of his hands dips below the\nsurface of the water.  He howls and yanks out his hand.\nWe see the alien hand dripping seawater... then a thousand\ndroplets of purple alien blood begin to bead all over the\nhand.  The Thugs get Watson swinging.\n\n<b>\t\t\tQUINT\n</b>\tLast call, sucker.  One... two...\n<b>\tTHREE!\n</b>\nWatson is flung into the surf.\n\n<b>ANGLE\n</b>\nHarcourt and Kipling have walked down almost to the\nwaterline.  We HEAR Watson's GURGLES and SCREAMS... then\nnothing.  Kipling is very nervous this close to the water.\nHarcourt seems unperturbed.\n\n<b>\t\t\tKIPLING\n</b>\tWhen we picked him up, he was\n\ttalking to those two cops -- the two\n\twho came to question you about\n\tHubley.\n\n<b>\t\t\tHARCOURT\n</b>\tThis is getting out of hand.  I want\n\tyou to deal with it.  Immediately.\n\nA wave rushes up the sand.  Kipling quickly steps back.\nHarcourt stands firm, staring it down, and the foam stops\nsix inches from his dress shoes.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (continuing)\n\tWe must learn to embrace the things\n\twe fear... and from that grow\n\tstrong.\n\nA moment, then he turns and starts back toward the limo.\nHe motions to Strader's body and the surf.  The Thugs grab\nthe body and heave it into the waves.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SYKES' APARTMENT - NIGHT\n</b>\nJetson is talking rapidly in the alien language on the\nkitchen wall phone.  Sykes, foreground, takes the bottle\nof vodka from the refrigerator, throws some ice in a\nglass, pours himself a shot.  As Jetson is talking, he\nspots the carton of milk that Sykes inadvertently left out\nof the refrigerator two nights ago.\n\nHe sniffs it... his eyebrows do an involuntary movement.\nHe finishes with his wife and hangs up.  He watches Sykes\ntake a long pull on the vodka.\n\n<b>\t\t\tJETSON\n</b>\t\t   (holds up milk\n\t\t    carton)\n\tWould you mind?\n\nSykes shrugs, tosses him a glass.  Jetson pours the semi-\nlumpy milk and takes a big swallow.  Sykes grimaces.\nThen--\n\n<b>\t\t\tSYKES\n</b>\t\t   (indicates phone)\n\tSo, she keeps you on a pretty short\n\tleash, does she?\n\n<b>\t\t\tJETSON\n</b>\tMy wife?  She worries about me.\n\nSykes leans against the counter, getting comfortable, his\nvoice more weary then bitter.\n\n<b>\t\t\tSYKES\n</b>\tYeah... I know the routine.\n\n<b>\t\t\tJETSON\n</b>\tYou are married?\n\n<b>\t\t\tSYKES\n</b>\tWas.  Divorced.\n\n<b>\t\t\tJETSON\n</b>\tWe mate for life.  Divorce... is a\n\tstrange concept to us.\n\n<b>\t\t\tSYKES\n</b>\tIt's like having an eleventh finger\n\tremoved.  It hurts like hell, but\n\tyou never really needed the damn\n\tthing in the first place.\n\nJetson nods -- even though he doesn't really understand\nthis.  They drink... Jetson gazes around.\n\n<b>\t\t\tJETSON\n</b>\tYour home is quite disordered.  I\n\tthought perhaps you had been\n\tburglarized when I walked in.\n\n<b>\t\t\tSYKES\n</b>\t\t   (growling)\n\tI appreciate your honesty, George.\n\nHe smacks his glass against Jetson's.  They drink.\n\n\n<b>INT.  SYKES' APARTMENT - LATER\n</b>\nSykes has his wallet out... showing Jetson a dog-eared\nphoto.\n\n<b>\t\t\tSYKES\n</b>\tIgnore the bitch on the left, that's\n\tEdie.  I call her Edi Amin... This\n\tis Kristin, my daughter.  It's kinda\n\tan old picture... she's twenty now.\n\tGetting married, in fact... on\n\tSunday.\n\nJetson sitting across the table from Sykes, looks at the\nproffered photo.  They're both a little drunk now.\n\n<b>\t\t\tJETSON\n</b>\tHuman children can be very\n\tbeautiful.\n\t\t   (then)\n\tGetting married?  Congratulations.\n\tYou will be taking Sunday off,\n\tthen...\n\n<b>\t\t\tSYKES\n</b>\t\t   (uneasy)\n\tMaybe not... I don't know.  I'm not\n\tsure I'm gonna go.\n\t\t   (mumbles)\n\tShe doesn't need her burn-out of a\n\tfather there...\n\nJetson looks at him.  Sees something he never thought\npossible in Sykes.  Vulnerability.  Trying to break the\nmelancholy mood, Jetson reaches for his wallet.\n\n<b>\t\t\tJETSON\n</b>\t\t   (upbeat)\n\tI must show you...\n\t\t   (flips open wallet,\n\t\t    shows four crisp\n\t\t    photos of his wife)\n\tAnd this is Richard.  My son.  He's\n\tfour years old.  We named him after\n\tthe former President, Richard Nixon.\n\nSykes looks at all the photos sprawled out on the table...\nand has to laugh.  He looks up at Jetson's sincere face.\nHe may be starting to like this guy.\n\n<b>\t\t\tSYKES\n</b>\tYou open to a piece of advice?  Tell\n\tpeople you named him after Richard\n\tBurton, the actor.  Just take my\n\tword for it.\n\nAnd he clacks his glass against Jetson's sitting on the\ntable, and--\n\n\n<b>INT.  SYKES' APARTMENT - LATER\n</b>\nThey are quite a bit drunker.  Jetson has doffed his\njacket and tie, leans in, listening intently to Sykes.\n\n<b>\t\t\tSYKES\n</b>\t... and so, and so the doctor says,\n\t\"If this is the thermometer, then\n\twhere'd I leave the pen?\"\n\t\t   (laughs raucously,\n\t\t    Jetson doesn't\n\t\t    react)\n\tYou're not... you don't think that's\n\tfunny?  George, work with me, I\n\talways get a laugh with that one.\n\tLook, if the doctor's got the\n\tthermometer in his hand, then\n\twhere's his pen gotta be?\n\n<b>\t\t\tJETSON\n</b>\t\t   (straight-faced)\n\tIn the other man's rectum.\n\n<b>\t\t\tSYKES\n</b>\t\t   (laughing)\n\tSticking out of his ass... yeah!\n\tSee, that's what makes it a joke.\n\tThere's like a surprise, and your\n\tmind fills in the funny picture.\n\tHere's this guy with a pen stuck in\n\this ass and he thinks it's a\n\tthermometer.\n\t\t   (Jetson just blinks)\n\tNada, huh?\n\nJetson shrugs apologetically.  Sykes pours them each\nanother round.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tYour health...\n\n<b>\t\t\tJETSON\n</b>\tTa ss'trakyona'...\n\nThey CLACK glasses, and--\n\n\n<b>INT.  SYKES' APARTMENT - LATER STILL\n</b>\nThe party has moves into the living room floor, around the\ncoffee table.  It's a quieter moment.\n\n<b>\t\t\tJETSON\n</b>\tThere is so much our two peoples\n\tdon't understand about each other.\n\n<b>\t\t\tSYKES\n</b>\tNo shit, Holmes.  You're only from\n\tanother goddamn planet, for\n\tchrissakes.\n\n<b>\t\t\tJETSON\n</b>\tYou humans are very curious to us.\n\tYou invite us to live among you, in\n\tan atmosphere of equality we've\n\tnever known before.  You lay before\n\tus a beautiful green world, full of\n\tfreedoms and opportunities... You\n\tgive us ownership of our lives for\n\tthe first time... and you ask no\n\tmore of us than you do of\n\tyourselves: to live by the rules...\n\trules that aren't made to keep one\n\tpeople subordinate to another, but\n\trules that exist to preserve\n\tequality.  You aspire to very high\n\tideals here.\n\nSykes is watching Jetson, mesmerized.  The guy's never\nsaid this much at one time before.\n\nIf he wasn't drunk, Jetson would never let himself open up\nto a human like this.\n\n<b>\t\t\tJETSON\n</b>\t\t   (continuing)\n\tI hope you can understand how\n\tspecial your world is... how unique\n\ta people you humans are.  So it us\n\tall the more painful and confusing\n\tto us that so few of you seem\n\tcapable of living up the the ideals\n\tyou set for yourselves.\n\n<b>\t\t\tSYKES\n</b>\tDon't count on me, George.  I never\n\thad any ideals.\n\nJetson smiles a little.  He knows that's bullshit.\n\n<b>\t\t\tJETSON\n</b>\tWe don't understand the hatred, the\n\tcontempt.  But we must bear it... we\n\tmust not react in anger... because\n\tour situation here is still fragile.\n\tThe separationists would see us\n\treturned to the quarantine camps.\n\tThe fundamentalists say we have no\n\tmore human rights than dogs or cats.\n\tBut the prejudice we face here is so\n\tinsignificant compared to the pain\n\tthat we've known before.  And that\n\tis why we are so grateful.\n\nSykes studies him a long time through heavy-lidded eyes.\nFinally--\n\n<b>\t\t\tSYKES\n</b>\tYeah, well... except I did hear you\n\teat your dead.\n\nJetson looks at him a long beat, then--\n\n<b>\t\t\tJETSON\n</b>\t\t   (deadpan)\n\tOnly on Fridays.\n\nSykes stares at him for about five seconds and then\nexplodes with laughter.\n\n<b>\t\t\tSYKES\n</b>\tYou son-of-a-bitch.  You're okay.\n\nJetson stands unsteadily, and announces:\n\n<b>\t\t\tJETSON\n</b>\tI'm going home.\n\n<b>\t\t\tSYKES\n</b>\tYeah, go home.  Get some sleep.  You\n\tdo sleep, don't you?\n\nJetson, going out the front door, just waves over his\nshoulder without turning around.  He's gone.\n\n<b>\t\t\tSYKES\n</b>\tWhat a wildman...\n\nSykes, stands there wobbling, then he collapses backward\nonto the sofa, unconscious.  And we MATCH DISSOLVE TO--\n\n\n<b>INT.  SYKES' APARTMENT - DAWN\n</b>\nThe first hues of dawn stream through the window.  Sykes\nremains passed out on the sofa where we left him.\n\n\n<b>EXT.  STREET - FRONT OF SYKES' BUILDING - DAWN\n</b>\nThe slug-mobile parked at the curb.  Silence, then the\nRUMBLE of a heavy truck... and a tow truck turns onto this\nstreet at the corner.\n\nThe tow truck glides to the curb in front of the slug-\nmobile.  The driver stays inside as his passenger alights\ncarrying a tool kit and a paper bag.  The human is Quint.\n\nQuint uses a slim-jim to open the slug-mobile door, then\nslides behind the wheel.\n\n\n<b>INT.  SLUG-MOBILE - DAWN\n</b>\nQuint slides the contents from the paper bag.  It is a\npacket of C-4 plastic explosives, with a primer cap, and\ntwo lead wires with their ends bared.  Quint bends down,\nstarts to work under the dash.  As his head disappears\nfrom FRAME, suddenly another head appears above the\nseats... George Jetson sitting up groggily in the back\nseat.  A blanket slips off his head and shoulders.  He\nsits there blinking, rubbing his eyes, feeling lousy.\n\nUnder the dash, Quint starts to whistle as he works.\nMistake.\n\nJetson, with a puzzled expression, leans forward and sees\nthis guy in the front seat.  Before he can jump-start his\nbrain, Quint sits up, sees him, and hammers him in the\nface with his fist.  Jetson is knocked back, holding his\nface.  That was the last thing he needed.\n\n\n<b>EXT.  STREET - FRONT OF SYKES' BUILDING - DAWN\n</b>\nMeanwhile Quint is shouting and bailing out of the car.\nHe runs and leaps into the already moving tow truck.\n\nIt is sliding around the corner out of sight just as\nJetson stumbles out of the car.  He whips out his gun from\nthe unfamiliar shoulder rig and it flies out of his hand.\nJetson sags against the side of the car, mumbles an alien\nphrase, clearly the equivalent of \"Fuck it...\".\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SYKES' APARTMENT - DAY\n</b>\nSykes is in the fetal position on the couch where we left\nhim.  Someone is POUNDING on the door.  He regains\nconsciousness reluctantly.\n\n<b>\t\t\tSYKES\n</b>\tThis better be good news or money.\n\nHe shambles to the door and gets it open, admitting\nJetson.  Jetson holds the C-4 charge in a handkerchief\nwith one hand and gives it to Sykes.\n\n<b>\t\t\tJETSON\n</b>\tHold this.\n\t\t   (lurching to the\n\t\t    sink)\n\tI feel very terrible.\n\nSykes registers what he's holding.  He moves to Jetson,\nwho is running his head under the tap.\n\n<b>\t\t\tSYKES\n</b>\tWhere'd you get this?!!\n\n<b>\t\t\tJETSON\n</b>\tA man, a human, was wiring it to\n\tyour car.  I didn't get a good look\n\tat him.\n\t\t   (then, registering\n\t\t    that it's day;\n\t\t    panicked)\n\tI must call my wife...\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  PRECINCT FIRST FLOOR HALLWAY - DAY\n</b>\nJetson is starting to take on Sykes' looks, his clothing\nrumpled and a day old.  Sykes has showered and changed so\nhe's not suffering as much by comparison.  They approach\nSykes' desk.\n\n<b>\t\t\tJETSON\n</b>\tShe's going to divorce me.\n\n<b>\t\t\tSYKES\n</b>\tGeorge, she's not gonna divorce you.\n\tYou mate for life, remember?\n\n<b>\t\t\tJETSON\n</b>\tShe's very progressive.  I'm certain\n\tshe's considering it.\n\n<b>ANGLE - A UNIFORMED SECRETARY\n</b>\ndistributing phone slips nearby notices Sykes.\n\n<b>\t\t\tSECRETARY\n</b>\tYou guys are looking for somebody\n\tnamed Strader, right?\n\n<b>\t\t\tSYKES\n</b>\tYeah.\n\n<b>\t\t\tSECRETARY\n</b>\tFedorchuk and Alterez just phoned\n\tin.  They found him.\n\t\t   (Sykes and Jetson\n\t\t    react)\n\tOr at least what's left of him,\n\twashed up on the beach at Zuma.\n\nSykes and Jetson react again.\n\n<b>\t\t\tSECRETARY\n</b>\t\t   (continuing; handing\n\t\t    over  the message\n\t\t    slip)\n\tThey're still there if you wanna\n\tcatch them.\n\nShe moves off.\n\n<b>\t\t\tSYKES\n</b>\tWell, let's roll, George.\n\n<b>\t\t\tJETSON\n</b>\t\t   (with a stricken\n\t\t    expression)\n\tTo the... to the beach?\n\n<b>\t\t\tSYKES\n</b>\tCome on, let's go, dude.  Surf's up!\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  PACIFIC COAST HIGHWAY - ZUMA BEACH - DUSK\n</b>\nCRANE SHOT, nice and WIDE, showing the slug-mobile turning\noff P.C.H. onto a gravel road which curves down the the\nbeach.  The following is V.O. as the car approaches the\nwater.\n\n<b>\t\t\tJETSON (V.O.)\n</b>\tStop the car.\n\n<b>\t\t\tSYKES (V.O.)\n</b>\tWhy?\n\n<b>\t\t\tJETSON (V.O.)\n</b>\tPlease, I must get out here.\n\n<b>\t\t\tSYKES (V.O.)\n</b>\tCome on, you won't have to get near\n\tthe water.\n\n<b>\t\t\tJETSON (V.O.)\n</b>\tStop the car!\n\nWe see the car pull to a stop in a cloud of dust.\n\n\n<b>INT.  SLUG-MOBILE - DUSK\n</b>\n<b>\t\t\tSYKES\n</b>\tAll right, okay.  Keep your\n\tpantyhose on.  Jeez, when in doubt,\n\tfreak out, for chrissake.\n\nSykes sees that his partner is covered with a sudden sheen\nof sweat, his hands shaking.  Sykes softens.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tIt's all right, George.  It's cool.\n\tJust wait here, all right?  I'll be\n\tback in a coupla minutes.\n\n<b>\t\t\tJETSON\n</b>\tThank you.\n\nHe climbs out and Sykes drives down to the beach... toward\na cluster of vehicles: a Sheriff's black-and-white, a\ncoroner's wagon, and Fedorchuk's unmarked sedan.\n\n\n<b>EXT.  BEACH - DUSK\n</b>\nA quick glimpse of a pile of dark yuck in the shape of a\nperson, black and skeletal beneath the remains of a silk\nsuit.  Wound around the corpse are streamers of kelp and\nother high tide detritus.\n\n<b>ANGLE ON SYKES, FEDORCHUK, AND ALTEREZ\n</b>\nlooking down at the body.  A CORONER'S TECHNICIAN is doing\na closer inspection.\n\n<b>\t\t\tFEDORCHUK\n</b>\tFound his wallet in his jacket\n\tpocket.  Joshua Strader, big as\n\tlife.\n\n<b>\t\t\tCORONER'S TECH\n</b>\tJesus, what a mess.  It's gonna be a\n\tbear to make a positive\n\tdetermination, but it looks to me\n\tlike he was shot before being tossed\n\tin the drink.  At least twice--\n\t\t   (indicates where\n\t\t    hearts  would've\n\t\t    been on the body)\n\t-- here, and here.\n\nSykes absorbs this.  He rises along with Fedorchuk and\nAlterez.\n\n<b>\t\t\tSYKES\n</b>\tHow're you two doing on Tuggle's\n\tkiller?\n\n<b>\t\t\tALTEREZ\n</b>\tThe store owner's son is in a street\n\tgang, so now we're thinking maybe\n\tit's gang related.\n\n<b>\t\t\tSYKES\n</b>\tYeah, that's real good.  You guys\n\tfollow up on that for a coupla\n\tmonths.\n\nFedorchuk looks up at Jetson standing on the bluff above.\n\n<b>\t\t\tFEDORCHUK\n</b>\tLook at your dildo partner.  He's\n\ttoo scared to even come down to the\n\tsand.\n\t\t   (calls up to Jetson,\n\t\t    even though he's too\n\t\t    far away to hear)\n\tYou're not gonna get wet standing\n\there, moron!\n\n<b>\t\t\tSYKES\n</b>\tI'd like to see you next to a sea of\n\thydrochloric acid, Fedorchuk... see\n\thow much surfin' you'd do.\n\nAlterez shoots a polaroid of the body.  Sykes grabs it as\nit emerges from the camera and walks back toward the car.\nFedorchuk flips him the bird.  As Sykes rounds the car, he\nsees that someone has drawn on the door in yellow liquid\nchalk marker a big star with \"E.T. P.D.\" printed inside\nit.  Sykes looks around.  Fedorchuk and the others stand\ntogether chuckling, conspicuously not looking in his\ndirection.\n\n<b>\t\t\tSYKES\n</b>\tCute.\n\n\n<b>EXT.  BEACH ROAD - DUSK\n</b>\nSykes has stopped to pick Jetson up.\n\nHe's wiping the \"E.T. P.D.\"  from the door as Jetson\napproaches from the edge of the bluff.  Fedorchuk pulls up\nalongside in his n.d. sedan.  He calls off to Jetson, who\nis still twenty yards away.\n\n<b>\t\t\tFEDORCHUK\n</b>\tWell, if it isn't Detective Jetson.\n\tForget you hip waders, big guy?\n\n<b>\t\t\tSYKES\n</b>\tLay off, asshole.\n\n<b>\t\t\tFEDORCHUK\n</b>\tI may be an asshole, but at least\n\tI'm a real detective, not some outer\n\tshit space thing.\n\nSykes, his face neutral, which we should by now know to be\nhighly dangerous, saunters to Fedorchuk's car and leans\nagainst it.\n\n<b>\t\t\tSYKES\n</b>\tYeah?  you're a real honest-to-god\n\tdetective...?\n\nSykes grabs the back of Fedorchuk's head and slams it into\nthe steering wheel, BAM-HONK!, and in doing so, has hurt\nhis hand again (the hand he hit Jetson with).\n\nHe shakes that hand while lunging in and grabbing\nFedorchuk's car keys with the other.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tThen detect these!\n\nFedorchuk, holding his bloody nose, watches as his car\nkeys sail out in an arc out over the bluff.  Jetson, just\nclimbing into the slug-mobile, witnesses the last of this\nscene without knowing how it began.\n\n\n<b>INT.  SLUG-MOBILE - DUSK\n</b>\nSykes gets in, slams the door.  His hand hurts as he grabs\nthe wheel.  He holds the wheel gingerly as he slams the\ncar into gear and hurls gravel up the road toward P.C.H.\nJetson looks over, curious.\n\n<b>\t\t\tJETSON\n</b>\tWhat was that about?\n\n<b>\t\t\tSYKES\n</b>\t\t   (embarrassed that he\n\t\t    defended Jetson)\n\tNothing.\n\nOn Jetson's confused expression, we--\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  BURGER STAND - NIGHT\n</b>\nA different burger stand.  Sykes and Jetson sit across\nfrom each other at one of the outdoor tables... Sykes with\nhis greasy burger, Jetson with his mole strips.  This time\nthey have no trouble eating in front of each other as they\ntalk.\n\n<b>\t\t\tSYKES\n</b>\t... So we've got three guys dead.\n\tAll Newcomers, all killed the same\n\tway -- execution style.\n\n<b>\t\t\tJETSON\n</b>\tWarren Hubley was in middle\n\tmanagement at a refinery... Joshua\n\tStrader operated a successful bar\n\tand nightclub...\n\n<b>\t\t\tSYKES\n</b>\t... and Porter ran a piece of shit\n\tmom-and-pop mini-mart.\n\t\t   (beat)\n\tSo what the hell's the connection?\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  PATHOLOGY LAB OFFICE - NIGHT\n</b>\nSykes and Jetson enter the cluttered lab office.  Winter\nis here eating take-out chicken at his cluttered desk.\n\n<b>\t\t\tSYKES\n</b>\tYou guys finished the postmortem on\n\tStrader yet?\n\n<b>\t\t\tWINTER\n</b>\t\t   (his mouth full)\n\tYou mean the Blob?  They're\n\tfinishing up now.\n\n<b>\t\t\tJETSON\n</b>\tIs Bentner here?  I must speak with\n\thim.\n\n<b>\t\t\tWINTER\n</b>\tHe went home early -- his kid was\n\tsick.\n\nJetson frowns.\n\n<b>\t\t\tWINTER\n</b>\t\t   (continuing)\n\tYeah, but he left something for you.\n\nHe wipes his greasy fingers on a napkin, then finds an\nenvelope on the desk and hands it to Jetson.  Jetson tears\nopen the sealed envelope.  The message inside is written\nin the alien language.\n\n<b>\t\t\tWINTER\n</b>\t\t   (continuing)\n\tDoes this have something to do with\n\tthe test he ran that he wouldn't\n\ttell me about?\n\n<b>CLOSE ON - JETSON\n</b>\nHis expression grows stricken as he reads the message.\n\n<b>BACK TO SCENE\n</b>\n<b>\t\t\tSYKES\n</b>\t\t   (getting very curious\n\t\t    and suspicious now)\n\tWhat kind of test?\n\n<b>\t\t\tWINTER\n</b>\tLooking for some foreign compound in\n\tthe blood of that alien you dropped\n\tthe other day.\n\n<b>\t\t\tSYKES\n</b>\tDid he find anything?\n\nWinter shrugs, indicates the message Jetson reads, as if\nto say, \"Maybe it says in there\".\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Jetson)\n\tWell?\n\nJetson refolds the paper and puts it in his pocket.\n\nHe is clearly disturbed by what he has read.  He looks at\nSykes a moment, then quickly breaks eye contact.\n\n<b>\t\t\tJETSON\n</b>\tIt is nothing.\n\nJetson quickly moves off.  Sykes hurries off after him.\n\n\n<b>INT.  HALLWAY - NIGHT\n</b>\nSykes hurries to catch up with the fast walking Jetson.\nThey eventually reach the elevators and Jetson jabs the\nbutton during:\n\n<b>\t\t\tSYKES\n</b>\tWhat's this nothing shit?  It wasn't\n\tnothing yesterday when you asked\n\tBentner to run that test and he\n\tlooked like he was about to shit\n\tpeach pits, and it's not nothing\n\tnow.  Don't lie to me, George,\n\tyou're bad at it.\n\n<b>\t\t\tJETSON\n</b>\t\t   (distant, closed)\n\tYou must leave me alone on this.\n\nThe elevator arrives, he steps in.  Sykes follows.\n\n\n<b>INT.  ELEVATOR - NIGHT\n</b>\nThey enter the empty elevator.  Jetson presses the button\nto descend.\n\n<b>\t\t\tSYKES\n</b>\tNo, see, I don't leave you alone...\n\tI'm your partner.  I don't work that\n\tway... Tug didn't work that way.\n\nJetson remains steadfast.  Sykes, about to explode, slams\nhis palm against the red Emergency Stop button and the\nelevator lurches to a halt between floors.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tNo secrets, goddammit!  You don't\n\thold back from me.  Whatever is\n\tgoing on, you're gonna tell me now!\n\n<b>\t\t\tJETSON\n</b>\t\t   (agonizing)\n\tNo.  I cannot involve you.  This is\n\tnot your concern.\n\n<b>\t\t\tSYKES\n</b>\tThe hell it isn't, when somebody\n\twires up enough C-4 explosive to my\n\tcar to turn me into pink mist!\n\t\t   (beat)\n\tThat Slag was on something, and not\n\tsour milk, either?  Am I right?\n\t\t   (he has backed Jetson\n\t\t    to the wall by sheer\n\t\t    force of will)\n\tTELL ME!  What is it?\n\n<b>\t\t\tJETSON\n</b>\t\t   (finally)\n\t... It is called ss'jabroka'.  To us\n\tit is a potent narcotic.\n\n<b>\t\t\tSYKES\n</b>\tHow potent?\n\n<b>\t\t\tJETSON\n</b>\tLike your cocaine, I suppose.  The\n\t\"high\" lasts several hours.  We\n\twould receive small amounts of it...\n\tas a reward for our labor.\n\n<b>\t\t\tSYKES\n</b>\tWe?  You've taken it?\n\n<b>\t\t\tJETSON\n</b>\tWe all did.\n\n<b>\t\t\tSYKES\n</b>\tWhere did he get it?  Was there any\n\tof it on the ship?\n\n<b>\t\t\tJETSON\n</b>\tNo... I am sure not.  That is why I\n\tam so concerned... someone must now\n\tbe producing it here.\n\t\t   (emphatically)\n\tBut none of my people know how to\n\tmake it.  The process was carefully\n\tguarded.\n\n<b>\t\t\tSYKES\n</b>\t\t   (as the enormity\n\t\t    sinks in)\n\tJesus, this is major.\n\t\t   (then)\n\tWhy didn't you tell me sooner?\n\tWhy'd you hold out on me?\n\n<b>\t\t\tJETSON\n</b>\tYour people don't know about this\n\tpart of out past.  And they can't\n\tknow -- It would threaten our entire\n\texistence here.\n\nThe voltage runs out of Sykes.  He seems to understand\nJetson's dilemma.\n\n<b>\t\t\tSYKES\n</b>\tGeorge... look me in the eye...\n\tGeorge, you don't ever lie to me\n\tagain.\n\n<b>\t\t\tJETSON\n</b>\tI must trust you, Matthew.  I cannot\n\tstop this without you.\n\nSykes stare at Jetson... absorbing the enormity of the\nearth-shattering secret this alien has asked him to keep.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  COUNTY MORGUE - NIGHT\n</b>\nSykes and Jetson move quickly to the slug-mobile.  Sykes\nreaches for the driver's door handle with his punching\nhand.  He winces in pain... the son-of-a-bitch still\nhurts.  He looks across at Jetson opening the passenger\ndoor.\n\n<b>\t\t\tSYKES\n</b>\tGeorge?  How about you drive...\n\nJetson looks over at him... gently reacting to this vote\nof confidence.  They walk quickly around to the opposite\ndoors, climb in.\n\n\n<b>INT.  CORRIDOR - BUREAU OF NEWCOMER AFFAIRS - NIGHT\n</b>\nSykes and Jetson move down this government-building\ncorridor.\n\n<b>\t\t\tSYKES\n</b>\tThere's gotta be some other\n\tconnection.\n\nThey enter a door marked BUREAU OF NEWCOMER AFFAIRS.\n\n\n<b>INT.  BUREAU OF NEWCOMER AFFAIRS - NIGHT\n</b>\nHIGH SHOT showing the maze of partitioned cubicles filling\nthis huge room.  It's all but deserted.  Sykes and Jetson\nare off to one side with a heavyset woman (human) COMPUTER\nOPERATOR, who they're shanghaied into helping them after\nhours.\n\n<b>CLOSER - AT COMPUTER OPERATOR'S DESK\n</b>\nShe sits at her computer terminal.  Sykes and Jetson stand\nbehind her as she types in commands and information.\n\nShe types: Hubley, Warren.  The computer screen flashes\npast various information, then settles on a screen full of\ninformation of HUBLEY, WARREN.\n\n<b>\t\t\tOPERATOR\n</b>\tHere's Hubley.\n\t\t   (scanning it)\n\tLeft Quarantine on November\n\tthirtieth, relocated first to\n\tRiverside, then moved to Los Angeles\n\tearly in February the following\n\tyear.  Field of expertise: chemical\n\tmanufacturing.  Looks like he passed\n\tup several other better paying jobs\n\twaiting for that one at the\n\trefinery.\n\n<b>\t\t\tSYKES\n</b>\tTry Joshua Strader, will ya,\n\tdarlin'?\n\n<b>\t\t\tOPERATOR\n</b>\tFor you, anything.\n\nThe Operator punches up STRADER, JOSHUA.  The screen fills\nwith information.\n\n<b>\t\t\tOPERATOR\n</b>\t\t   (continuing, reading\n\t\t    from screen)\n\tReleased on November twenty-ninth.\n\tCame immediately to L.A.  Ten weeks\n\tafter arriving he took over the\n\tabandoned club which is now\n\tEncounters.\n\n<b>\t\t\tJETSON\n</b>\t\t   (to Operator)\n\tNow the store owner, please.  Cecil\n\tPorter.\n\nShe types it in.\n\n<b>\t\t\tOPERATOR\n</b>\tReleased December one.  He and his\n\twife moved first to Modesto, then\n\tCoalinga, California -- wherever\n\tthat is -- settled in L.A. in\n\tApril.  Field of expertise:\n\torganic chemical engineering.  He\n\tand his wife have one child, a son.\n\n<b>\t\t\tSYKES\n</b>\tYeah -- we met him.  Wonderful\n\tboy... close personal friend of\n\tGeorge's here.\n\n<b>\t\t\tOPERATOR\n</b>\tI'm sorry, Matt.  Nothing here seems\n\tto be matching up...\n\nBut Sykes wasn't listening.  He's starting off... an idea\nforming.  He stands there a moment, considering it, his\nface looking like he's chewing something sour.  It's so\noff-the-wall it takes a moment for him to assimilate it.\nThen--\n\n<b>\t\t\tSYKES\n</b>\tHoly shit...\n\t\t   (to Jetson)\n\tLook what we're staring at: three\n\tNewcomers with nothing in common,\n\tright?  What if it's just one other\n\tguy who killed these three?\n\t\t   (Jetson looks at him\n\t\t    blankly)\n\tThree and one make four.  Four\n\tNewcomers... of totally different\n\tbackgrounds...\n\t\t   (Jetson still doesn't\n\t\t    get it)\n\tYou and the store owner's son --\n\tthat punker!\n\nSuddenly the realization hits Jetson, too.  He looks at\nSykes.\n\n<b>\t\t\tJETSON\n</b>\t... Quarantine.\n\nSykes spins to the Operator, excited.\n\n<b>\t\t\tSYKES\n</b>\tCan you dig up their Quarantine\n\trecords in this thing?\n\n<b>\t\t\tOPERATOR\n</b>\tSure.  Just a minute.\n\nShe moves up a screen to the top of Porter's information. \n\n<b>\t\t\tOPERATOR\n</b>\t\t   (to herself)\n\tPorter was in Lodge seven seven two.\n\nShe rapidly types in additional information.  The screen\nshifts as she jumps files.  Finally she gets a line that\nreads: ENTER LODGE NUMBER: She types: 7-7-2.\n\nSykes and Jetson lean in as the screen goes blank... then\ninformation flashes past as the computer searches... then,\nfinally: Occupants, Quarantine Lodge 772: HUBLEY,\n<b>WARREN......... STRADER, JOSHUA.........\n</b>\nSykes and Jetson react -- their hunch is coming true.\n\nOn the computer screen: .........PORTER, CECIL.........\n\nSykes and Jetson, their faces bathed in the green kick of\nthe screen, stare without blinking, waiting for that forth\nname.\n\nOn the computer screen: .........HARCOURT, WILLIAM.\n\n<b>CLOSE ON - SYKES AND JETSON\n</b>\nreacting to the name.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  ENCOUNTERS - NIGHT\n</b>\nCLOSE on a limousine door as it opens and a tall figure\nrises from the back seat.  We TILT UP to reveal William\nHarcourt.\n\nWe MOVE with him as he walks to the n.d. van (from the\nbeach scene) parked in front of the limousine.  Kipling is\njust sliding out of the passenger side of the cab.  Quint\nexits the driver door.  Kipling slides open the van's side\npanel, reaches in for--\n\n-- a large black suitcase.  He slides it out.  Harcourt\nnods.  He and Kipling start into the club, followed by\nQuint.\n\n\n<b>INT.  ENCOUNTERS - NIGHT\n</b>\nThe club is deserted tonight as Harcourt and entourage\nmove toward the back.\n\n\n<b>EXT.  SECOND FLOOR CORRIDOR - NIGHT\n</b>\nHarcourt and the others move up the stairs to the second\nfloor.  Cassandra, wearing a slinky dress, is at the top\nof the stairs waiting for them.  She's very uncomfortable\ndealing with Harcourt.  Kipling and Quint continue on\ntoward the office door.  Harcourt pauses with Cassandra.\nHe touches her neckline of her dress, letting his fingers\nlinger against her flesh.\n\n<b>\t\t\tHARCOURT\n</b>\tQuite lovely...\n\t\t   (best)\n\tWhat is your name again?\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (flinching\n\t\t    involuntarily at\n\t\t    his touch)\n\tCassandra.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (a chilling smile)\n\tI will have to remember that...\n\nHe continues down toward the office door.  Cassandra\nwatches him go.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SLUG-MOBILE - MOVING - NIGHT\n</b>\n<b>\t\t\tJETSON\n</b>\tThey had months in quarantine to\n\tdevelop the plan.  Porter, with his\n\tchemistry background, must have\n\tsomehow come up with the formula for\n\tthe drug.  Hubley manufactured it --\n\tat the refinery.  Strader, through\n\tthe nightclub, established a\n\tdistribution network.  And\n\tHarcourt--\n\n<b>\t\t\tSYKES\n</b>\tHarcourt was the brain who brought\n\tit all together.\n\n\n<b>EXT.  REFINERY - ESTABLISHING SHOT - NIGHT\n</b>\n\n<b>EXT.  REFINERY - NIGHT\n</b>\nThe slug-mobile skids to a stop at the loading dock\nentrance.  Sykes and Jetson climb out.  They hop up onto\nthe loading platform and move purposefully into the well-\nlit interior through the open door.\n\n\n<b>INT.  REFINERY - NIGHT\n</b>\nIt is Saturday night, the plant is barely operational --\nonly a few WORKERS around.  Sykes and Jetson move\npurposefully toward the back.\n\n<b>\t\t\tSYKES\n</b>\tOkay, George -- we gotta play this\n\treal smart.\n\n<b>\t\t\tJETSON\n</b>\tIf the drug is here, we must destroy\n\tit.\n\n<b>\t\t\tSYKES\n</b>\tNo, George -- you're missing the\n\tpoint.  The drug is evidence.  We\n\tneed to have the evidence, ya know?\n\nJetson doesn't reply -- he's focused beyond what Sykes is\nsaying.  Sykes spots O'Neal up ahead by the refrigeration\ndoor to the METHANE SECTION.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing)\n\tThat's the guy...\n\nO'Neal recognizes Sykes and doesn't wait around for the\nbig Newcomer bearing down on him.  He dodges quickly\nthrough the refrigeration door and swings it closed.\nJetson's hand hits the door an instant later, before it is\nlatched, and he pushes it open despite O'Neal's body\nweight against the other side.\n\n\n<b>INT.  METHANE ROOM - NIGHT\n</b>\nJetson grabs O'Neal by the collar and drags him deeper\ninto the deserted room.\n\n<b>\t\t\tO'NEAL\n</b>\tHey, what are you, crazy?!  You\n\tcan't come in here like this!  Hey!\n\nSykes reaches the doorway, stops and stares.\n\n<b>\t\t\tSYKES\n</b>\tSo much for playing it smart...\n\nO'Neal's feet are barely touching the ground as Jetson\nmoves along the row of drug-manufacturing equipment.\n\nFinally he reaches a stainless steel tub... he runs a long\nfinger along the inside, comes up with some residue of the\ndrug.  It glistens blue on his finger.  It holds him\nmesmerized for several moments... his expression that of a\nformer junkie beholding the stuff he used to covet so.\n\n<b>\t\t\tSYKES\n</b>\t\t   (tentatively\n\t\t    stepping closer)\n\tIs that it...?\n\nA beat, than Jetson explodes -- he sweeps a rack of\nequipment off the worktable, savagely wipes the drug from\nhis hand onto O'Neal's shirt-front as he slams and pins\nthe bug-eyed O'Neal to the wall.\n\n<b>\t\t\tSYKES\n</b>\tUh, George...\n\n<b>\t\t\tJETSON\n</b>\t\t   (in O'Neal's face)\n\tWhere is the drug?  Where have they\n\ttaken it?\n\n<b>\t\t\tO'NEAL\n</b>\t\t   (choking)\n\tWhat drug?  This is an oil refinery,\n\tyou...\n\n<b>\t\t\tJETSON\n</b>\t\t   (pushing harder)\n<b>\tWHERE?!\n</b>\n<b>\t\t\tO'NEAL\n</b>\t\t   (unable to breathe)\n\tYou... can't do... this!\n\n<b>\t\t\tSYKES\n</b>\tGeorge, uh... you're gonna break his\n\tlittle chest bones...\n\n<b>\t\t\tJETSON\n</b>\tStay out of this, Matthew.\n\t\t   (to O'Neal)\n\tTell me where the drug has been\n\ttaken or I will crush your lungs\n\tagainst this wall.\n\nO'Neal is experiencing real fear now.  Sykes has decided\nto back Jetson up, for better or worse.  He takes the\n\"good cop\" role.\n\n<b>\t\t\tSYKES\n</b>\tDon't piss him off, O'Neal.  When he\n\tgets like this, I can't control him.\n\tI've seen this before.  He got like\n\tthis once -- I saw him jerk a guy's\n\tspine out and show it to him.\n\tNothing I could do.  I hadda go\n\tthrow up.\n\n<b>\t\t\tO'NEAL\n</b>\t\t   (at length, with\n\t\t    great effort)\n\t... They took the stuff out, all of\n\tit -- this afternoon.\n\n<b>\t\t\tJETSON\n</b>\tHow much?\n\n<b>\t\t\tO'NEAL\n</b>\tAbout fifty kilos... of\n\tconcentrate... and some street\n\tgrade... in tubes.\n\nJetson reacts to this... then increases the pressure.\nO'Neal is really in bad trouble now.  Even Sykes takes a\nhalf-step forward -- thinking Jetson might actually crush\nthis man.\n\n<b>\t\t\tJETSON\n</b>\tWhere have they taken it?\n\n<b>\t\t\tO'NEAL\n</b>\tEncount... Encounters Club.\n\nFinally, Jetson eases off.  O'Neal slumps to the floor,\ngasping for air.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  REFINERY - NIGHT\n</b>\nThis time Jetson is the Juggernaut... his expression set\nand hard... as he strides to the car.  Sykes practically\nhas to run to keep up.\n\n<b>\t\t\tSYKES\n</b>\tGeorge, c'mon -- lighten up.  It's\n\ta beauty of a case.  Don't sweat it\n\t-- we got him by the short hairs.\n\tHe ain't gonna make any more of the\n\tshit.\n\n<b>\t\t\tJETSON\n</b>\tThe fifty kilos, Matthew.  I have to\n\tfind it.  I can't let it get out on\n\tthe street.\n\n<b>\t\t\tSYKES\n</b>\tWhy?  What's the big goddamn deal?\n\nJetson has reached the driver's door of the slug-mobile,\nyanks it open.\n\n<b>\t\t\tSYKES\n</b>\t\t   (continuing; as\n\t\t    Jetson starts the\n\t\t    car\n\tYou destroy that drug, you destroy\n\tthe case.  Don't blow the whole\n\tthing now by not following\n\tprocedure.\n\n<b>\t\t\tJETSON\n</b>\t\t   (through the open\n\t\t    driver's window)\n\tFuck procedure.\n\nAnd to Sykes' shock, he throws the car in gear and peels\nout.\n\n<b>\t\t\tSYKES\n</b>\tHey!!\n\nJetson accelerates toward the security gate.  The guard in\nthe shack starts yelling and runs out as the slug-mobile\nbashes through the barricade bar.\n\n<b>\t\t\tSYKES\n</b><b>\tGEORGE!  GODDAMMIT!!\n</b>\nSykes stands there like a moron -- with no partner, no\ncar.  A pickup truck carrying a Worker just getting off\nhis shift starts ambling past.  Sykes runs in front of it,\nwaving his badge.  The pickup skids to a stop.\n\n<b>\t\t\tSYKES\n</b>\tPolice.  Get out.  I need this\n\tthing.  Out, now!\n\nThe poor guy bails out and Sykes jumps in, jamming it into\ngear.  The truck has seen better days... it doesn't have\nmuch power to give as Sykes floors it toward the exit.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nAs Jetson races along the freeway, whipping past other\ntraffic.  He takes a hand off the wheel, reaches over and\npops open the glovebox.  He shoves some maps and garbage\naside, reaches deeper inside for something -- we don't see\nwhat.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  ENCOUNTERS - NIGHT\n</b>\nCassandra walks a trio of well-dressed DRUG DEALERS (two\nalien, one human) through the deserted club.\n\n\n<b>INT.  SECOND FLOOR CORRIDOR - NIGHT\n</b>\nShe leads them to the office door, opens it, then lets\nthem enter ahead of her.  A couple of them smile at her\nlasciviously as they brush past.  She is about to enter\nherself when an alien hand flashes in behind her, covering\nher mouth, pulling her backward away from the door.\n\nIt is Jetson.  He had been hiding behind some crates\nstacked here in the corridor.  He pins Cassandra\npowerfully to the wall, keeping one hand over her mouth.\nShe struggles until she sees who it is.\n\n<b>\t\t\tJETSON\n</b>\tI am here to take Harcourt.  Where\n\tis he?\n\nShe hesitates, then decides to cooperate, indicates with a\nnod toward the office door.\n\n<b>\t\t\tCASSANDRA\n</b>\tIn there.\n\n<b>\t\t\tJETSON\n</b>\t\t   (pulling his gun)\n\tShow me.\n\n\n<b>INT.  CONFERENCE ROOM - NIGHT\n</b>\nThe large suitcase rests on the expansive conference\ntable.  A manicured alien hand reaches in and slowly opens\nit.  Inside are fifty one-kilo glass tubes full of the\nviscous blue drug.  Also several of the small, individual\ndispensers.  It is Harcourt, standing behind the table in\na pool of light, who has opened the suitcase.  He is\nflanked by Kipling... with Quint elsewhere in the room.\nThe room is lit by track light, creating pools of light\nand dark.\n\nThe two alien Dealers' eyes widen at the sight of the\ndrug.  The human dealer doesn't know what it is.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (to alien dealers)\n\tIt's been a long time, hasn't it,\n\tgentlemen?\n\n<b>\t\t\tHUMAN DEALER\n</b>\tWhat is it?\n\n<b>\t\t\tHARCOURT\n</b>\tA sweet indulgence from out past...\n\tresurrected for our future.\n\nHarcourt sees the hungering expressions on the alien\nDealers' faces... smiles knowingly.  He slides one of the\ndispensers from the suitcase.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (continuing; to\n\t\t    alien  dealers)\n\tPlease feel free to sample the\n\tquality.  The experience will be\n\teverything you remember it to be...\n\nOne of the alien Dealers takes the dispenser, brings it to\nhis tongue.  The other alien dealer turns to Harcourt--\n\n<b>\t\t\tALIEN DEALER\n</b>\tWhere'd you get it?\n\n<b>\t\t\tHARCOURT\n</b>\tI arranged to spend some time with\n\tthree very resourceful men.  With a\n\tcertain amount of coaxing, one of\n\tthem was able to reconstitute the\n\tformula for me.\n\t\t   (beat)\n\tThey worked very well together.\n\tUnfortunately, they are no longer\n\twith us... but I was fortunate\n\tenough to reap the benefit of their\n\tendeavor.\n\nHe indicates the drug.  The first alien Dealer sways\ngently, enjoying the sensation.  The second alien Dealer\ntakes his hit... shudders as the first rush washes over\nhim.  The human Dealer is no fool... he grabs the\ndispenser.\n\n<b>\t\t\tHUMAN DEALER\n</b>\tLet me try some.\n\t\t   (he does,\n\t\t    immediately spits\n\t\t    it out)\n\tJesus!  Tastes like detergent!\n\n<b>\t\t\tHARCOURT\n</b>\tAnd that's all the effect it will\n\thave on you.  But when my fellow\n\tNewcomers learn they can obtain it\n\there, they will work very hard... to\n\tmake as much money as they can... to\n\tgive it to me.\n\nSuddenly, a voice from the shadows near the open door to\nthe other office:\n\n<b>\t\t\tVOICE\n</b>\tYou haven't told him all of it.\n\nHarcourt and the others react.  Quint leaps to his feet,\ncaught off guard.  Kipling reaches for his shoulder\nholster.  A silhouette beside the open door to the outer\noffice nudges Cassandra into the light of the room, then\nsteps out himself.  It is Jetson.\n\nQuint gets his gun out, is about to aim... when his eyes\ngo wide at the sight of something Jetson holds.\n\nIt is the plastic explosive charge that Quint was wiring\nto the slug-mobile.  The wires are connected and Jetson's\nfinger squeezes down hard on the detonation push-switch.\n\n<b>\t\t\tQUINT\n</b>\tHe's got the C-4 charge!\n\nJetson moves forward slowly, holding the bomb in front of\nhim.  He is sweating rivers.  The others quickly join him.\nHe nudges Cassandra ahead of himself, keeping her where he\ncan see her.\n\n<b>\t\t\tQUINT\n</b>\t\t   (continuing)\n\tJust take it real casual, buddy.\n\tKeep your finger on that button and\n\tdon't do nothing squirrely.\n\n<b>\t\t\tHARCOURT\n</b>\tIf you release that button, you not\n\tonly kill us, but yourself.\n\n<b>\t\t\tJETSON\n</b>\tTo get you and that--\n\t\t   (indicates drug in\n\t\t    suitcase)\n\t-- I would do it.\n\nHe says it with such straightforward eye contact, that\nHarcourt (and we) know he isn't bluffing.\n\n<b>\t\t\tJETSON\n</b>\tEveryone up against that wall.\n\tVery slowly.\n\t\t   (to Harcourt)\n\tExcept you.\n\nHarcourt remains behind the desk.  Cassandra stays where\nshe is, near Jetson.  The others move to the wall.\nKipling in particular is going nuts, letting this happen.\n\nJetson takes the \"sample\" dispenser from the table, tosses\nit into the suitcase, then closes the lid and locks it.\nAll the while keeping his eye on Harcourt and the others.\n\n<b>\t\t\tHARCOURT\n</b>\tOne small matter seems to have\n\tescaped your attention.  That--\n\t\t   (indicates suitcase)\n\t-- is not on any books as a\n\tcontrolled substance.  Legally it\n\tmight as well be fifty kilos of...\n\tgrape jelly.\n\n<b>\t\t\tJETSON\n</b>\tThe charge is murder... and\n\tconspiracy to commit murder.\n\tHubley, Porter, Strader... probably\n\tothers.\n\nThere's a flicker of concern behind Harcourt's icy blue\neyes.\n\nCassandra stares at Harcourt.\n\n<b>\t\t\tCASSANDRA\n</b>\tYou... you killed Strader?\n\nCassandra runs to Harcourt grabbing his jacket.\n\n<b>\t\t\tCASSANDRA\n</b>\tWhere's Todd?!  Did you do something\n\tto Todd?!\n\nHarcourt looks down at her, totally uninvolved.\n\n<b>\t\t\tHARCOURT\n</b>\tTodd?  Who is Todd.\n\t\t   (then remembers;\n\t\t    smiles)\n\tAh, poor Mr. Watson.\n\nCassandra's eyes go wide as the horror of what he said\nsinks in.  Jetson nudges Harcourt with the suitcase.  They\nstart out.  Cassandra, wild with rage, grabs Quint's .357\nand with a KEENING WAIL, brings it up toward Harcourt's\nface.\n\n<b>\t\t\tJETSON\n</b><b>\tNOOO!\n</b>\nJetson drops the suitcase as he lunges for the gun.  He\nmanages to knock it away just as she fires -- the bullet\ngoing into the wall behind Harcourt.  Striking like a\nmongoose, Kipling leaps forward, grabbing the two lead\nwires on the bomb in Jetson's hand and jerking them apart.\nJetson reacts an instant late... releasing the switch...\nand nothing happens.\n\n<b>\t\t\tKIPLING\n</b>\tI got it!\n\nKipling tackles Jetson and they both go crashing to the\nfloor.  Quint grabs the gun from Cassandra and hammers her\nwith it, hard.  She drops to her knees and Quint viciously\nhits her again.\n\nMeanwhile, Jetson struggles to regain his feet.  Kipling\nrears back and delivers a crushing blow under Jetson's arm\n-- to the nerve plexus.  Jetson instantly folds over\nforward and Kipling savagely brings up his knee into\nJetson's face, flipping him back.  Kipling slams him into\nthe wall face-first, pinning him there.\n\n<b>\t\t\tHARCOURT\n</b>\tKill them both.\n\n<b>\t\t\tKIPLING\n</b>\tHere?\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (raging)\n\tDo it!\n\nQuint brings the gun up, places the muzzle against the\nbase of Cassandra's skull, starts to squeeze the trigger.\nThere's a loud BLAM!  and Cassandra flinches... then looks\nup.\n\nQuint is blown backward away from her.\n\nSykes stand in the doorway from the private office, the\nCasull smoking in his hand.\n\nQuint hits the wall behind him -- only it's not a solid\nwall, but the huge window overlooking the club.  He\ncrashes through it.\n\n<b>ANGLE FROM DANCE FLOOR\n</b>\nas the wall of mirror explodes IN SLOW MOTION and Quint\ncartwheels to the floor in a shower of diamonds.\n\n<b>ANGLE - IN THE OFFICE\n</b>\nKipling shoves Jetson aside, draws his gun and fires at\nSykes.\n\nSykes dodges into the private office for cover.\n\nThe three Dealers dive behind any available furniture.\n\nHarcourt snatches up the suitcase and rushes to the door\nleading into the adjoining outer office.\n\nSykes swings around the edge of the private office door,\nstraight-arms the Casull into the office and fires.\nKipling fires back, crossing toward the outer office door,\ncovering Harcourt's back.  Sykes ducks back down.\n\nAn unsteady Jetson rises from the floor, sees Harcourt and\nKipling escaping, and takes off after them.\n\nSykes straight-arms the gun into the room again... sees\nJetson disappearing through the adjoining office door.  He\nmoves into the room as the three drug Dealers, arms up in\nsurrender, rise from behind the furniture.\n\n<b>\t\t\tALIEN DEALER\n</b>\tDon't shoot, man -- we're unarmed --\n\tlook!\n\nSykes looks at these harmless wimps... then at Cassandra.\n\n<b>\t\t\tSYKES\n</b>\tYou okay?\n\n<b>\t\t\tCASSANDRA\n</b>\t\t   (dazed, but all\n\t\t    right)\n\tYeah...\n\nAnd he charges out the adjoining office door.\n\n\n<b>EXT.  FIRE ESCAPE - ENCOUNTERS - NIGHT\n</b>\nHarcourt and Kipling bang down the metal stairs.  Jetson\nis ten feet above them.  Sykes flies out onto the fire\nescape, a few steps behind Jetson.  A POLICE CAR SIREN is\nHEARD arriving O.S.\n\n\n<b>EXT.  ALLEY - BEHIND ENCOUNTER - NIGHT\n</b>\nTwo UNIFORMED OFFICERS bound from their unit and run into\nthe back entrance of the club, leaving the unit running.\n\nTwo seconds later, Harcourt and Kipling leap down from the\nfire escape, find themselves near the unit.\n\n<b>\t\t\tHARCOURT\n</b>\tHere!\n\nHe throws the suitcase into the passenger side door, jumps\nin.  Kipling dives in behind the wheel, slams it into gear\nand floors it.\n\nJetson and Sykes hit the ground just as the unit peels\nout.  Sykes raises the Casull and fires at the fleeing\ncar.  One slug shatters a tail light, others pepper the\nrear of the trunk, but the car keeps going.\n\n<b>\t\t\tJETSON\n</b>\tThis way!\n\nHe indicates the slug-mobile parked nearby.  They race to\nit, jump in... Sykes driving.  He burns rubber as he pulls\nout.\n\nA second arriving police unit pulls into the alley,\nheading straight for the slug-mobile.  Sykes has to grate\nbetween the alley wall and the arriving police unit to get\npast.\n\n\n<b>EXT.  WEST SIDE STREET - NIGHT\n</b>\nHarcourt and Kipling in the first police unit come\nthundering down the street zig-zagging through traffic.\nThe slug-mobile is three-quarters of a block behind them.\n\n<b>INSIDE THE BLACK-AND-WHITE\n</b>\nHarcourt begins fumbling with the dash switches...\neventually hitting the right ones and the roof lights and\nSIREN blast on.\n\n\n<b>EXT.  WEST SIDE STREET - NIGHT\n</b>\nIt looks like a backwards chase, the slug-mobile chasing\nthe howling police car through traffic.\n\nJetson alertly eyes the approaching traffic -- calls it\nout to Sykes the way he was trained at the academy.\n\n<b>\t\t\tJETSON\n</b>\tSlow traffic on your right... you're\n\tclear at the left rear...\n\t\t   (Sykes changes lanes)\n\tCareful, red light ahead...\n\nWith Jetson's help, Sykes is able to dice through the\ncross-traffic without incident.\n\n\n<b>EXT.  WEST SIDE STREET - NIGHT\n</b>\nThe traffic ahead of the police car peels off in response\nto the approaching lights and SIREN.  Kipling dodges\naround the stopped traffic easily.\n\nThe same traffic that has pulled over for the police car\nnow starts easing back onto the street, cutting off the\nslug-mobile.\n\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nSykes' expression tells us he's slipped into the same\njuggernaut mode we saw during the foot chase in the alley.\n\n<b>\t\t\tJETSON\n</b>\tYellow light ahead turning red...\n\nBut Sykes doesn't slow -- instead he floors it.\n\n<b>\t\t\tJETSON\n</b>\t\t   (continuing; wide-\n\t\t    eyed)\n\tRed light!  Red light!\n\n\n<b>EXT.  WEST SIDE STREET - NIGHT\n</b>\nSykes peels around the merging traffic, cuts across the\nintersection, and continues the chase.  On the wrong side\nof the road, head-on into traffic.\n\nHeadlights peel off in front of them as they charge along\nthe wrong side.  They eventually catch up to the police\nunit, racing parallel to it, but with the divider between\nthem.\n\nSykes keeps one hand on the wheel and draws the Casull\nwith the other.  He brings it up and around right in front\nof Jetson's nose, pointing it through the passenger window\nat Kipling.\n\nAt that moment, Kipling glances over and reacts to the\nbore of this huge gun staring him in the kisser.\n\nJetson reacts to the gun in his face... then reacts to\nsomething else he sees beyond it.\n\n<b>\t\t\tJETSON\n</b>\tGreen light, Matthew.\n\t\t   (Sykes doesn't\n\t\t    respond)\n\tGreen light!\n\nNow Sykes looks.  The light at the intersection has just\nturned green -- and the rows of the cars that were waiting\nstart coming.  It's a wall of headlights coming right for\nthe slug-mobile.\n\n<b>\t\t\tSYKES\n</b>\tShit!\n\n<b>\t\t\tJETSON\n</b>\tSs-ai!\n\n\n<b>EXT.  WEST SIDE STREET - NIGHT\n</b>\nSykes locks up the brakes.  Kipling veers around a couple\nof cars and speeds away.\n\nBecause of the other traffic, Sykes has only one course of\naction.  He skids a left onto a side street.\n\n\n<b>EXT.  SIDE STREET - NIGHT\n</b>\nSykes burns rubber down this quieter street, squeals a\nright onto another street that parallels the street the\npolice unit is on.  At the first street available, he cuts\nback in behind the police unit.\n\n\n<b>EXT.  FIRST STREET OVERPASS - NIGHT\n</b>\nSykes' car tears along below the overpass -- with the\npolice unit directly above them!  An on-ramp approaches\nfor the slug-mobile and Sykes floors it.\n\n\n<b>INT.  BLACK-AND-WHITE - NIGHT\n</b>\nHarcourt turns in his seat just in time to see the slug-\nmobile airborne as it flies from the on-ramp, landing a\nfew feet behind the black-and-white's bumper.\n\n\n<b>EXT.  FIRST STREET OVERPASS - NIGHT\n</b>\nWith the slug-mobile now, the police unit hangs a right,\ncuts through a parking lot, and bounces onto--\n\n\n<b>EXT.  SECOND STREET AND TUNNEL - NIGHT\n</b>\nThe police unit hangs a u-turn into the Second Street\ntunnel.  It clips one of the civilian cars, causing a\npile-up of traffic behind the police unit.\n\nThe slug-mobile skids to a stop, blocked by the clog of\ntraffic in the tunnel.  Sykes is out of the drivers door\nin a flash, stand on the door frame, and yells--\n\n<b>\t\t\tSYKES\n</b>\tMove your goddamned cars!\n\nPeople climb out of their cars dazed and bewildered --\nignoring Sykes.  Sykes slides behind the wheel, bangs his\nbumper into the car in front of him, and pushes the car\nfar enough forward to get around.  He speeds off.\n\n\n<b>INT./ EXT.  BLACK-AND-WHITE - FREEWAY - NIGHT\n</b>\nKipling rockets up a freeway on-ramp.  Harcourt smiles\nwith satisfaction -- there's no sign of the slug-mobile\nbehind them.  Kipling eases off, blends into the flow of\ntraffic.\n\n\n<b>EXT.  FREEWAY - NIGHT\n</b>\nSykes slaloms the slug-mobile through the civilian\ntraffic like Mario Andretti lapping the pack at\nIndianapolis.\n\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nJetson spots the police unit in the right hand lane ahead.\n\n<b>\t\t\tJETSON\n</b>\tThere!\n\nSykes sees it.  Thinking fast, he eases off, using another\ncar as a blind.  He waits until the police unit is\nparallel to an off-ramp, then guns ahead and swings right,\ndirectly for the police unit.\n\nKipling looks over, reacts, just as the slug-mobile\nbroadsides the police unit.  Sykes forces the police unit\nup the off-ramp.\n\n\n<b>EXT.  INTERSECTION - NIGHT\n</b>\nDoor handle to door handle, the two cars slue to the\nright.  The police unit breaks out in front, but Sykes\nstays right on its ass.  They charge up onto--\n\n\n<b>EXT.  VINCENT THOMAS BRIDGE - NIGHT\n</b>\nThe police unit and slug-mobile -- bumper to bumper at 80\n<b>MPH.\n</b>\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nAs the cars scream along, Jetson cranes out the side\nwindow, looking in distress at the inky seawater flashing\npast below.\n\n\n<b>EXT.  VINCENT THOMAS BRIDGE - NIGHT\n</b>\nThey reach the far end of the bridge and skid wide onto--\n\n\n<b>EXT.  HENRY FORD BOULEVARD - NIGHT\n</b>\nA clear two lane straightaway near the ocean.  Sykes\npushes the slug-mobile to its limits, pulls alongside the\npolice unit.  The two cars trade blows at 90+ MPH.\nKipling manages to send Sykes onto the dirt shoulder,\nslowing him down.\n\n\n<b>INT.  BLACK-AND-WHITE - NIGHT\n</b>\nKipling watches the slug-mobile in the rearview mirror,\nthen looks back out the front to see the end of the road\ncoming up fast!  Harcourt bellows to Kipling, who slams on\nthe brakes.\n\n\n<b>EXT.  END OF BOULEVARD - NIGHT\n</b>\nThe police unit skids to a stop before hitting a chain\nlink fence where the road ends.  An abandoned drawbridge\nand the ocean are on the other side of the fence.\n\nWith nowhere else to go, Harcourt yells something at\nKipling and Kipling floors it back the way they came.\n\n\n<b>EXT.  HENRY FORD BOULEVARD - NIGHT\n</b>\nThe two cars are racing for a full head-on.  At the last\ninstant, Sykes wrenches the wheel, throws the slug-mobile\nsideways, passenger side first.  The police unit smashes\ninto the rear door and fender of the slug-mobile, both\ncars skidding madly to a stop.  A fire ignites under the\nhood of the police unit.\n\n\n<b>INT.  SLUG-MOBILE - NIGHT\n</b>\nSykes sits stunned behind the wheel.  Disoriented but\nconscious, he raises his head, looks over... sees Jetson\nout cold, his forehead gashed and bleeding.  Then he looks\nover and sees the fire growing under the police unit's\nhood which is crunched up against the rear of the slug-\nmobile -- near the gas tank.\n\n\n<b>EXT.  HENRY FORD BOULEVARD - NIGHT\n</b>\nSykes slides out of the driver's door, stumbles to\nJetson's door, wrenches it open, and drags the huge\nunconscious alien away from the cars.\n\nHe's still dragging Jetson away when he spots Harcourt\npulling himself through the smashed police unit window.\nBruised and bleeding, Harcourt reaches in for the\nsuitcase, then starts to run with it.\n\nWith Jetson a safe distance away from the cars, Sykes\nclambers to his feet, draws the Casull, and starts off\nafter Harcourt.\n\nHarcourt reaches the chain link fence leading to the\nclosed drawbridge.  He heaves the suitcase over, then\nstarts to climb.\n\nSykes lumbers past the burning police unit.  Kipling is\nstill behind the wheel, his head slumped forward.  Sykes\nis just past the cars when they explode -- sending hoods\nand door panels and glass flying in all directions.\nHarcourt, on the other side of the fence, grabs the\nsuitcase and limps off into the shadowy world of the\nabandoned drawbridge.\n\nSykes reaches the fence.  Instead of climbing, he simply\nblows the lock to hell with the Casull, and kicks open the\ngate.\n\n\n<b>EXT.  ABANDONED DRAWBRIDGE - NIGHT\n</b>\nThe end of the bridge is in the \"up\" position... a huge\nasphalt slab stabbing up into the night sky.  Harcourt\nruns along the pools of light and dark at the edge of the\nbridge, the black seawater drifting past beside him.  His\nfoot slips once and he almost goes over the side.\n\nSykes -- backlit by the burning cars, the big Casull a\nprominent part of the silhouette -- just keeps coming.\n\nHarcourt reaches the shadows at the end of the bridge --\nand has nowhere to go.  He is backed into a corner, with\nseawater on two side of him.  Harcourt pivots frantically,\nsees Sykes coming this way.  Harcourt is a trapped animal.\nHis chest heaves in panic.  Then his gaze falls on the\nsuitcase behind him... and slowly... finally... a look of\nresolve comes into his eye.\n\n<b>ON SYKES\n</b>\nHe eases cautiously toward the shadows where he knows\nHarcourt is.  There's some movement among the shadows, and\nSykes straight-arms the Casull, his finger white against\nthe trigger.\n\nPerspiration drips into Sykes' eye, but he doesn't blink.\nA long moment then--\n\n<b>ANGLE - THE SHADOWS\n</b>\nHarcourt emerges from the darkness.  His face is composed,\nthe superior glint is back in his eye.  His arms are held\naway from his sides at 30 degree angles, clearly in\nsurrender.\n\nSykes cat-steps forward slowly.  Harcourt stares at Sykes'\neyes, and the desire there that Harcourt will give him an\nexcuse.  Harcourt simply... smiles.\n\n<b>\t\t\tSYKES\n</b>\tMove a finger, Harcourt, and you're\n\thistory...\n\n<b>\t\t\tHARCOURT\n</b>\tNo, Sergeant -- not history...\n\t\t   (beat)\n\tEternity...\n\nAnd now Sykes sees it -- Harcourt has been holding one of\nthe one-kilo glass cylinders of the drug concealed behind\nhis arm.  He brings it up over his head, grins at Sykes,\nthen tilts back his head and cracks the cylinder open.\nThe blue gel pours into his mouth and down his chin.  His\nmouth fills.\n\nHe looks back at Sykes, making eye contact... his eyes\nmad, defiant.  And -- he swallows.  Long hold -- then the\nwallop of the overdose hits him... his face contorts in\nagony as he begins to convulse.  Sykes, wide-eyed, lowers\nthe Casull and watches as Harcourt drops to the ground and\ngoes into a massive violent seizure.  His limbs hammer\nagainst the deck... his back arches fiercely.  It is a\nbrutal, agonizing ten seconds.  Then, finally, his body\nbecomes still.\n\nSykes, stunned at what he's just witnessed slowly goes to\nhim and takes his pulse the way he saw Jetson do it.\n\n<b>HIGH ANGLE SHOT - THE ENTIRE AREA\n</b>\nSykes stands.  He notices the suitcase nearby, latches it,\nand hefts it.  He carries it with him back toward the\ninferno of the wrecked cars, the Casull hanging heavy and\ncold in his hand.\n\n<b>ANGLE FOLLOWING SYKES\n</b>\nHe approaches the burning cars, heading for Jetson.  As he\npasses the burning cars, we have a half-second to register\nthat the driver's door of the police unit is now open\nbefore--\n\n-- a dark figure hurtles at Sykes' back from O.S.!  Sykes\nis thrown forward.  The suitcase crashes to the ground,\nand the Casull goes skittering off.  Sykes looks up -- to\nbe met by the singed and bleeding nightmare visage of\nKipling!  Kipling reaches down for the suitcase then Sykes\nhears it -- the telltale CLINKING SOUND.  He looks -- and\nsees the exotic silver bracelet on Kipling's wrist.  It\nconnects for him; this is the bandana alien -- the one who\nkilled Bill Tuggle!\n\nKipling brings the suitcase above his head.  He is a half-\nsecond from hurling it down on Sykes' skull when -- a GUN\nROARS.  Kipling is thrown back by the chest wound.  Sykes\nlooks.\n\n<b>ANGLE\n</b>\nJetson, half sitting up, holds the smoking Casull.\n\nKipling recovers enough to come at Sykes again with the\nsuitcase again.  Jetson, shaking but determined, fires\nagain, and again, and again.\n\nKipling is driven backward by the fusillade, the suitcase\nstill over his head... until he is blasted at last and\nforever, suitcase and all, into the molten core of the\ninferno.\n\nSykes rises, makes his way to Jetson's side.  Jetson has\nlet the weight of the gun carry his hand to the ground.\nSykes kneels beside him, gently taking the gun from the\nalien's hand.  The two partners remain like this, bathed\nin the orange flickering glow of the fire.\n\n<b>HIGH WIDE SHOT\n</b>\nof the drawbridge, the debris, the carnage, and our two\ncops...\n\n<b>\t\t\t\t    DISSOLVE TO:\n</b>\n<b>EXT.  HENRY FORD BOULEVARD - NIGHT\n</b>\nThe police mop-up is winding down.  Cop cars, coroner's\nwagons, fire trucks.  We MOVE through it all to find Sykes\nand Jetson seated on the curb, away from the railing.\n\n<b>\t\t\tJETSON\n</b>\tWith Harcourt and Kipling dead, I\n\tassume you will be requesting\n\treassignment now.\n\n<b>\t\t\tSYKES\n</b>\t\t   (cool)\n\tIt'd be for your own good.  I think\n\tyou'd be better off with a partner\n\twho's a little more... by the book.\n\t\t   (smiles)\n\t... Still, I gotta tell you, George,\n\tfor a quiet guy, you're sure hell on\n\twheels once you get going.  I'd\n\tkinda hate to miss your next two\n\tdays as a detective.\n\nJetson smiles.  He glances up as they are bathed in red\nand blue light.  A patrol car has pulled up next to them.\nInside is Wiltey, a uniformed cop.\n\n<b>\t\t\tWILTEY\n</b>\tI'll give you guys a lift to the\n\tstation.  They're waiting to take\n\tyour statements on the shootings.\n\n<b>\t\t\tSYKES\n</b>\t\t   (to Jetson)\n\tLet's go, partner.\n\t\t   (then casually\n\t\t    correcting Wiltey\n\t\t    as he rises)\n\tAnd it's shooting.  Singular.\n\n<b>\t\t\tWILTEY\n</b>\tThey said two.\n\n<b>\t\t\tSYKES\n</b>\tNope.  I didn't shoot Harcourt... he\n\to.d.'d.\n\n<b>SHOCK CUT - JETSON\n</b>\nWe rapidly PUSH IN ON HIM as his head snaps around toward\nSykes.  His expression tells us his blood has just turned\nto ice.\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  CORONER'S WAGON - NIGHT\n</b>\nANGLE FORWARD, shooting from the rear of the wagon, toward\nthe DRIVER and ATTENDANT up front.\n\n<b>\t\t\tDRIVER\n</b>\tSo it's just me and her left in the\n\thot tub, right?\n\n<b>\t\t\tATTENDANT\n</b>\tYou and the blonde?\n\n<b>\t\t\tDRIVER\n</b>\tNo, man, the redhead.  The blonde's\n\tgone in the house with some other\n\tguy.  But a few minutes later she\n\tcomes back out, alone, when me and\n\tthe redhead are going at it fast and\n\tfurious in the tub, ya know... and\n\tshe sees us, and... she climbs right\n\tin with us...\n\n<b>\t\t\tATTENDANT\n</b>\tYou're full of shit!\n\n<b>\t\t\tDRIVER\n</b>\tI swear it!  If I'm lyin', I'm\n\tdyin'...\n\nAnd, without warning, A LARGE INHUMAN HAND FLIES UP IN\nF.G., having ripped through the sealed body bag just below\n<b>FRAME.\n</b>\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>INT.  SQUAD CAR - NIGHT\n</b>\nJetson is up front with Wiltey; Sykes sits in the back,\nthough he is on the edge of the seat, leaning forward\ntoward the front.  Jetson is intently, nervously scanning\nahead and to both sides.\n\n<b>\t\t\tJETSON\n</b>\tYou are certain this is the route\n\tthey would have taken?\n\n<b>\t\t\tWILTEY\n</b>\tI'm not positive -- but probably.\n\n<b>\t\t\tSYKES\n</b>\t\t   (warily)\n\tWhat's this about, George?  I know\n\tthat look.\n\n<b>\t\t\tJETSON\n</b>\t\t   (spots something out\n\t\t    a side window)\n\tThere!  Go back.  Down that side\n\tstreet.\n\nWiltey brakes, backs up, then turns into the side street.\n\n<b>ANGLE THROUGH WINDSHIELD\n</b>\nas they approach an eerie scene.  The coroner's wagon is\nstopped at an angle in the middle of the intersection,\nheadlights and roof lights cutting into the night, the\nback doors wide open.  A patrol car is also here, on the\nother side of the wagon.  There is no movement anywhere\nnear the two vehicles.\n\nWiltey pulls the car up, his eyes like saucers at the\neerie scene.  He reaches for the radio hand mike.  Jetson\nquickly covers it with a large hand.\n\n<b>\t\t\tJETSON\n</b>\tNo!\n\t\t   (both Sykes and\n\t\t    Wiltey look at him)\n\tWe must do this alone.\n\n<b>\t\t\tSYKES\n</b>\tDo what?!  George-- ?!\n\nJetson is already sliding out of the car.\n\n\n<b>EXT.  STREET NEAR DOCKS - NIGHT\n</b>\nJetson, Sykes, and Wiltey move warily forward, their guns\ndrawn.  They reach the van and Sykes takes Wiltey's\nflashlight, shines it through the open back doors.  The\ndoors are bent outward, smashed half off their hinges.\nOne of the body bags is ripped open, literally split from\nend to end.  The blue and red lightbar on the other patrol\ncar can be seen through the wagon's front windshield.\n\nJetson starts around the wagon toward the patrol car,\nSykes and Wiltey follow.  Lights all ablaze, it too is\nabandoned.  One door has been wrenched off its hinges and\nlays in the street, and the front windshield is smashed.\nOur three cops approach the car, then Wiltey spots\nsomething beyond the unit.\n\n<b>\t\t\tWILTEY\n</b>\tOh, God...\n\nSykes and Jetson look.\n\nThe bodies of the coroner wagon Driver and Attendant, as\nwell as the two OFFICERS from the patrol car, are crushed\nand beaten and stretched out on the asphalt.  Their arms\nare twisted as though by a mad force -- each pointing down\nthe street toward the dock warehouses ahead.  Wiltey\nstumbles away, backward.\n\n<b>\t\t\tWILTEY\n</b>\tI'm calling for back up, now.\n\n<b>\t\t\tJETSON\n</b>\tWiltey, no.\n\nBut Wiltey is going.  Jetson starts after him... but Sykes\ngrabs his arm, hard, and spins him.\n\n<b>\t\t\tSYKES\n</b>\tWhat is this?!\n\n<b>\t\t\tJETSON\n</b>\t\t   (low)\n\t... It's Harcourt.\n\n<b>\t\t\tSYKES\n</b>\tHarcourt is dead.\n\n<b>\t\t\tJETSON\n</b>\tNo he's not.  Not if he overdosed on\n\tthe drug.\n\t\t   (searches for the\n\t\t    words)\n\tMassive amounts trigger a... a\n\tchange.  Your body functions seize\n\tup, you appear to be dead, but it's\n\treally a state of incubation.  When\n\tyou emerge you're...\n\n<b>\t\t\tSYKES\n</b>\t\t   (looks at the four\n\t\t    bodies sprawled\n\t\t    before him)\n\tTell me about it...\n\n<b>\t\t\t\t    CUT TO:\n</b>\n<b>EXT.  STREET NEAR DOCKS - NIGHT\n</b>\nOne minute later.  OPEN CLOSE on a light shining into\nCAMERA, then WIDEN to reveal it is one of the door-mounted\nspotlights on Wiltey's patrol car.  Wiltey eases the car\ndown the center of the street.  Sykes and Jetson, guns\nready, walk slowly along on either side of the car... eyes\neverywhere.\n\n<b>MOVING POV\n</b>\nas they move past the shadowy dock warehouses... watching\nfor any signs of movement.\n\n<b>BACK TO SCENE\n</b>\nSykes and Jetson converse across the hood of the car as\nthey walk.  Their eyes everywhere.\n\n<b>\t\t\tSYKES\n</b>\tI never thought I'd say this, but --\n\tfor once in my life I think I'm\n\twilling to wait for back-up.\n\n<b>\t\t\tJETSON\n</b>\tWe can't let him get away.\n\n<b>\t\t\tSYKES\n</b>\tWhy the hell are you so dead set\n\tagainst back-up?\n\n<b>\t\t\tJETSON\n</b>\t\t   (a difficult\n\t\t    admission)\n\tBecause... because of what will\n\thappen if humans see what we are\n\tcapable of becoming.\n\n<b>\t\t\tSYKES\n</b>\tBut there's no more drug.\n\n<b>\t\t\tJETSON\n</b>\tYou understand that.  But how many\n\tothers will?\n\nSykes looks across at Jetson's troubled expression.\n\nJust then, Wiltey spots a flit of movement cutting across\nhis headlight beams fifty yards ahead.  Whatever it was,\nwas large and fast.  It darted into an open warehouse\ndoor.\n\n<b>\t\t\tWILTEY\n</b>\tThere he is!\n\nAnd Wiltey floors it.  Sykes and Jetson watch, unable to\nstop him.\n\n<b>\t\t\tJETSON\n</b>\tWiltey!\n\nHe and Sykes take off running.  Wiltey skids to the left,\nrockets in through the open warehouse door, out of sight.\nSykes and Jetson pour it on.  They hear a SCREECH OF\nBRAKES.  They reach the warehouse door and race through.\n\n\n<b>INT.  WAREHOUSE - NIGHT\n</b>\nLOW ANGLE, SHOOTING ACROSS the underside of Wiltey's\nstopped patrol car as Sykes' and Jetson's feet appear\naround the corner of the warehouse door.  The car is still\nrunning -- the exhaust pipe still RUMBLING and expelling\nfumes.  The feet slow... then cautiously start around the\ncar.  We PAN with them as they move around the side of the\ncar.  A dark liquid begins dripping in EXTREME F.G.  We\nMOVE UP, to a CLOSE UP of the car bumper.  The dark liquid\nis blood, dripping deep red on the shiny chrome.  We MOVE\nUP farther, and--\n\n-- there is Wiltey's severed head.  IN CLOSE UP, resting\non the hood of the patrol car.\n\nSykes and Jetson stop dead at the sight.  Wiltey's body\nlies in a heap on the floor near the car.  They both\nstare, then Sykes looks around the shadowy interior of the\nwarehouse, his expression saying: what the hell could have\ndone this so fast?\n\n<b>THEIR POV\n</b>\nThere are two paths to go.  Both dark and scary as hell.\nThe sound of a distant FOG HORN blends with the CREAKS and\nDRIPS of this waterfront building.\n\n<b>ANGLE - SYKES AND JETSON\n</b>\nJetson reaches into the patrol car and pulls the shotgun\nfrom the dash mount.  He checks the chamber as Sykes\nchecks the Casull.\n\nThey exchange a knowing look... then wordlessly, they\nsplit up.  Sykes takes the path to the left, Jetson to the\nright.\n\n<b>WITH JETSON\n</b>\nAs he moves into a dark area.  He slowly picks his way\nalong a long wall, having to step over all sorts of piled\ndebris, heading toward us.  We PAN slightly to the left to\nHOLD a door in CLOSE UP.  The door, already ajar, eases\nopen slightly wider.  Jetson hears this.  He reaches the\ndoor, sets himself, then spins and kicks the door open all\nthe way.  There's nothing inside... now.\n\nJetson looks up, sees movement in the distance.  It is\nSykes, quite far away, in another section of the\nwarehouse.  Sykes leaves Jetson's field of view.\n\n\n<b>INT.  WAREHOUSE - GUARD'S AREA - NIGHT\n</b>\nSykes walks around a corner -- freezes, and cocks his head\nas he hears VOICES -- followed, curiously, by LAUGHTER.\nHe eases forward, peers around a bend, and sees -- a table\nand a chair.  On the table is a mini-television, tuned to\nsome local late night talk show.  There's a thermos, a\nsteaming cup of coffee, and a Twinkie with a single bite\nout of it beside the TV.  The chair is empty, except for a\njacket slung across the back, the word SECURITY stitched\non the breast.  The guard is nowhere in sight.\n\nSykes moves toward the table, taking in this eerie sight.\nHe looks around, then continues on.\n\n\n<b>INT.  WAREHOUSE - APPROACHING STAIRS - NIGHT\n</b>\nJetson moves among the dark nooks and crannies, comes to a\nset of stairs leading to an upper floor.  The top of the\nstairs is pitch black.  Jetson adjusts his grip on the\nshotgun, slowly starts up the stairs.\n\n\n<b>INT.  WAREHOUSE - AT FISH NETS - NIGHT\n</b>\nSykes comes to rack upon rack of drying fish nets, hanging\nfrom the ceiling.  He has no alternate route -- he begins\npushing through them.\n\n<b>SYKES' POV - MOVING THROUGH FISH NETS\n</b>\nBecause of the dimness, he can't see much beyond each rack\nof nets immediately before him.  He keeps wading through\n-- it's like a house of mirrors, he can't tell now much\nfarther he has to go to get out of the nets, and the\ndeeper in he gets, the harder it would be to go back the\nway he came.  He pushes past one particular rack of nets\nand looming out of the darkness ahead of him is--\n\n-- a terrifying face!\n\n<b>ON SYKES\n</b>\nHe stumbles back, gets tangled in the nets, brings up the\nCasull, is about to fire when... he sees what the face is.\nIt's the maiden's figurehead from the bow of an old ship.\nThe wood is worm-eaten and decayed, creating a hideous\nvisage.  Sykes stands there a moment, trying to jump-start\nhis heart again.\n\n\n<b>INT.  SECOND FLOOR LANDING - NIGHT\n</b>\nJetson moves along the rickety planks.  He comes to a\ndoor.  He eases it open, enters.\n\n\n<b>INT.  SECOND FLOOR ROOM - NIGHT\n</b>\nJetson moves into the shadowy confines.  He hears an\nincessant drip from a sink faucet in the corner.  He moves\nto it.  Turns the spigot, stopping the drip.  Other drips\nare HEARD from a dozen other hidden recesses all around\nhim.  He glances up at the filthy mirror attached to the\nwall above the sink.  Suddenly he sees the movement of\nsomething behind him.  He spins with the shotgun.  A huge\nshadow moves along the wall.  He pivots the shotgun again\n-- toward the source of the shadow.\n\nIt's a length of black tarp, torn and flapping from the\nceiling.  Jetson lets out a deep breath.\n\n\n<b>INT.  STORAGE ROOM - NIGHT\n</b>\nANGLE down a short passageway to an intersecting hallway.\nA strand of something hangs in FRAME in OUT OF FOCUS F.G.\nIt makes an indistinct, rhythmic CLINKING SOUND.  Sykes\nmoves along the intersecting hallway.  The CLINKING SOUND\ncatches his attention.  He stops, listens, then starts\ndown the passageway, toward us.\n\nHe comes forward into the storage room, having to get very\nclose to the strand of something before he sees what it\nis.  It's a double strand of chain, CLINKING gently\nagainst itself.  Sykes reaches out, steadies the chain,\nsilencing it.  He considers.  It could've been a natural\noccurrence... or something could have brushed against it,\nsetting it in motion.  He tightens his grip on the Casull,\nbacking away from the chain.  He senses something behind\nhim and spins.  Nothing there.  He relaxes.  However--\n\nBehind him now, in SOFT FOCUS, we glimpse movement at the\nother end of the short passageway.  It is a figure, moving\nslowly forward down the passageway, back-lit by the\nhallway light behind it, its shadow filling the passageway\nas it approaches Sykes.  It stops, inside the room now,\ndirectly behind Sykes.  Close enough to reach out and\ntouch him.  It is an alien silhouette, but larger, more\npowerful.\n\nSuddenly, Sykes senses something is there.  He turns,\nslowly, and--\n\n<b>SHOCK CUT - HARCOURT\n</b>\nas he steps from the shadows -- just like he did the last\ntime Sykes saw him on the abandoned drawbridge.  Only this\ntime it is a horribly transformed Harcourt.  His eyes are\nred-rimmed and piggish.  His head is lumpen, his skin\nthick and hard.  His neck muscles are corded -- giving him\na kind of hellish cobra's cowl.  There is still\nintelligence behind the eyes -- but it is a feral\nintelligence now.\n\n<b>\t\t\tHARCOURT\n</b>\t\t   (his voice a guttural\n\t\t    rumble)\n\tLooking for me, Sergeant?\n\nSykes stumbles back several steps, wildly brings up the\nCasull, and fires.  The powerful Casull round catches\nHarcourt in the shoulder, jerking him back.\n\n\n<b>EXT.  WORK SHED AREA - NIGHT\n</b>\nJetson, in another area of the docks, hears the echoing\nblast of the Casull.  He gauges as best he can the\ndirection it came from and takes off running.\n\n\n<b>INT.  STORAGE ROOM - NIGHT\n</b>\nHarcourt recovers from the jolt of the bullet impact.  The\ncloth of his disheveled shirt is shredded and powder-\nburned, but the bullet couldn't pierce his plated skin.\nHarcourt smiles with grotesquely altered teeth, starts\ntoward Sykes.\n\nScared shitless, Sykes rapid-fires.  One of his shots\nmisses, shattering a crate beside Harcourt's head.  The\nremaining shots strike Harcourt full on.  Harcourt is\njerked by the impact of the bullets each time, SNARLING in\nanger -- but none of the hits stop him.  The Casull is\nempty and Harcourt keeps coming.\n\nSykes stumbles back, but Harcourt is on him in a flash.\nHarcourt grabs Sykes' arm holding the gun, yanks hard.  We\nHEAR the POP as the shoulder dislocates.  Sykes HOLLERS,\nand the gun jumps out of his hand.\n\n\n<b>INT.  WAREHOUSE - GUARD'S AREA - NIGHT\n</b>\nJetson races in, shotgun ready.  The last of Sykes' shots\nare still ECHOING.  Jetson looks around, frustrated,\nunable to tell exactly where they are coming from.  He\nsees the likely path and charges that way.\n\n\n<b>EXT.  DOCK - AT STAIRS - NIGHT\n</b>\nOn the CUT, Sykes' body is already tumbling down these\nrickety stairs attached to the side of the warehouse,\nhaving been thrown ruthlessly from above.  As Sykes' body\nsprawls on the dock, the massive figure of Harcourt\nappears at the top of the stairs.\n\nSykes, scraped and bruised, struggles to his feet.\nHarcourt moves down the stairs, then vaults over the\nrailing the last fifteen feet.  Harcourt lurches forward\nand, with a taloned grip on Sykes' shoulders, propels him\ndown the docks.\n\n\n<b>EXT.  STREET NEAR DOCKS - NIGHT\n</b>\nThe first two arriving black-and-whites skid to stops at\nthe coroner's wagon.  The Officers leap out, flagging\nother arriving units to continue on toward the warehouses.\n\n\n<b>EXT.  DOCKS - NIGHT\n</b>\nSykes is on his feet, but his knees buckle, and he almost\ncollapses again.  Harcourt comes at him.  Then Sykes sees\nit--\n\n-- a fishing boat chugging along past the end of one of\nthe jetties.  Sykes makes a break for it.\n\n\n<b>EXT.  WAREHOUSE - AT STAIRS - NIGHT\n</b>\nJetson charges out at the top of the rickety stairs,\nfrantically scanning for any sign of Sykes.  Then, in the\ndistance, he spots the two figures running along the jetty\n-- Sykes being chased by the re-formed Harcourt.  Jetson\ngives the water surrounding the docks an apprehensive\nlook, then gathers up his courage, and races down the\nstairs to help Sykes.\n\n\n<b>EXT.  JETTY - NIGHT\n</b>\nSykes lumbers along the narrow jetty.  The fishing boat is\nalready passing the end of the jetty.  Harcourt is fast\nbehind Sykes as he reaches the end of the jetty and vaults\noff toward the stern of the boat -- landing on the fishing\nnet piled on the rear deck.  He yells in pain as his ankle\ntwists under his weight.\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nSykes lies there, holding his arm, breathing hard,\nrelieved that he has escaped.\n\n\n<b>EXT.  JETTY - NIGHT\n</b>\nHarcourt can't reach the boat from the same jetty Sykes\ndid, so he jumps on a platform beside this jetty, then\nonto a second jetty.  And from here, he vaults across the\nseawater onto the boat.\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nSykes sees the phantom figure land on the boat near the\ncabin.  The fishing boat chugs up the channel toward the\nopen sea.\n\n\n<b>EXT.  DOCKS - NIGHT\n</b>\nJetson sees this and is shitting bricks.  Suddenly the\nstark BEAM of a police helicopter sun-gun stabs down from\nabove.  Jetson looks up to see the chopper coming in low,\nthe sun-gun washing over the docks.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nThe sun-gun hits Jetson standing on the dock, frantically\nwaving his badge at the 'copter, signaling it down.  The\nPilot starts to take it down.\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nSykes is on all fours, clawing his way up the fishing net\ntoward the back of the boat.  Harcourt gets one hand on\nhis leg.  Sykes jerks his leg away, and Harcourt's claws\ndig deep through Sykes' pants into his legs as he pulls\naway.  Sykes BELLOWS in pain.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson is barely in the seat as it lifts away from the\ndock.  He has to catch himself from falling out the open\ndoor.  Below, uniformed cops are now seen rushing out onto\nthe dock.\n\n<b>\t\t\tJETSON\n</b>\tOn that boat -- out there!\n\nJetson indicates the fishing boat headed toward the mouth\nof the channel.  The helicopter tilts forward and goes.\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nSykes manages to pull himself up into the dinghy hanging\nover the stern of the fishing boat.  He pushes to the back\nof the dinghy as Harcourt's savage visage appears at the\nbow.  Harcourt grins -- the predator with his prey\ntrapped.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson's face is bathed in sweat as he looks out at the\nchannel water racing past beneath.  They come up on the\nboat and the Pilot plays the sun-gun onto the deck,\nlooking for movement, finally pinning Sykes and Harcourt\nat the stern dinghy.\n\n\n<b>EXT.  BRIDGE OF FISHING BOAT - NIGHT\n</b>\nThe Captain reacts to the helicopter overhead, looks back\nat what the sun-gun spotlights.  He sees Harcourt standing\nat the bow of the dinghy, starting to clamber in.\n\n<b>\t\t\tCAPTAIN\n</b>\tHey!\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nHarcourt turns, sees the Captain on the bridge above him.\nHe reaches for a wood-handled gaff nearby.  He rears back\nwith it and lets it fly like a spear.\n\n\n<b>EXT.  BRIDGE OF FISHING BOAT - NIGHT\n</b>\nThe gaff impales the Captain, off-center in his chest.\nThe Captain, his face frozen in shock, is thrown back\nagainst the throttle.  The boat lunges forward as the\nengines REV loudly.\n\n\n<b>EXT.  FISHING BOAT - NIGHT\n</b>\nHarcourt is thrown into the dinghy with Sykes.  As\nHarcourt recovers, Sykes spots the release for the tie\nline on the dinghy.  He lunges forward, throwing the\nratchet.  The line plays out, and the dinghy slides\nbackward into water!\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson watches this happen.\n\n\n<b>EXT.  DINGHY - NIGHT\n</b>\nThe dinghy bangs along (at the end of the ten foot tie\nline) in the wake of the speeding fishing boat.\n\nHarcourt claws his way toward Sykes.  Water is already\nsplashing in over the stern transom... the dinghy is\nsinking.  Harcourt grabs Sykes' leg and pulls him toward\nhim.  Sykes holds on to the stern cleats with all his\nmight.  Harcourt yanks him free.  Sykes kicks wildly at\nthe ratchet release, trying to free the remainder of the\nline.  Harcourt is coming in for the kill when--\n\n-- Sykes' foot connects with the ratchet lever.  The rest\nof the tie line snakes through the ratchet, freeing the\ndinghy from the fishing boat!\n\nThe dinghy is rocking wildly, sinking fast.  A wave from\nthe fishing boat's wake splashes in over the side.  Some\nof it hits Harcourt -- he HOWLS and falls away.  Sykes\nsees this, tries to clamber over the side, but Harcourt is\non him again.  Sykes' body weight at the side of the\ndinghy coupled with the rocking motion cause more water to\nwash in over the transom.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson reacts to Sykes and Harcourt battling in the dinghy\nbelow.\n\n\n<b>EXT.  DINGHY - NIGHT\n</b>\nHarcourt, who is getting more and more wet, HOWLS in\nagony, thick blood beginning to bead wherever the water\ntouches.  Sykes is taking one hell of a beating.  Harcourt\nsweeps Sykes up in a bear hug, is about to crush his rib\ncage, when Sykes shifts his body weight, knocking Harcourt\noff balance.  Harcourt wobbles, fear on his face for the\nfirst time -- then he finally loses it, and the two of\nthem tumble overboard into the water, capsizing the\ndinghy.\n\n\n<b>EXT.  WATER - NIGHT\n</b>\nSykes breaks the surface, gasping for air, frantically\nclawing with his one good arm at the wedge of dinghy still\nabove the water.  Suddenly, behind him, Harcourt's\npartially melted form erupts from the water, lunges on top\nof Sykes, and drags him under.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson hangs in the open door, watching in horror, wanting\nto help, knowing he can't.\n\n\n<b>EXT.  WATER - NIGHT\n</b>\nSykes breaks the surface, Harcourt's misshapen lump of a\nbody unmoving but still on top of him.  Sykes shoves it\naway, struggling to stay afloat.  His head keeps dunking\nunder.  He's drowning.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nJetson screws up his courage and turns to the Pilot.\n\n<b>\t\t\tJETSON\n</b>\tTake it down!  Take it down!\n\n\n<b>EXT.  WATER AND HELICOPTER - NIGHT\n</b>\nThe helicopter moves down toward the turbulent water.\nJetson hangs in the doorway, watching Sykes' head dunking\nunder again.  The helicopter's skids are three feet above\nthe water.\n\n<b>\t\t\tJETSON\n</b>\t\t   (to Pilot)\n<b>\tALL THE WAY!\n</b>\n<b>\t\t\tPILOT\n</b><b>\tI CAN'T IT'LL DITCH!\n</b>\nSykes' outreached hand stretches up from the water, but\nthe skid is just too high.  Jetson has no alternative, and\nhe does the bravest thing he has ever done.  He moves out\nonto the narrow helicopter skid.  Hanging on, three feet\nabove the water, he reaches down for Sykes' up reaching\nhand.\n\nThe fingertips of the two hands waver mere inches from\neach other... Jetson stretches farther, farther... and the\ntwo hands meet!  Jetson winces from the pain of the\nseawater on Sykes' hand.  He starts pulling Sykes up.\nWhen--\n\n<b>HARCOURT'S HEAD BREAKS THE SURFACE A FOOT FROM SYKES'\n</b>FACE.  His eye sockets are empty and his skin is mostly\ngone.  The nearly skeletal body heaves blindly onto Sykes,\nbreaking his grip from Jetson's, and dragging him under\nagain.\n\nJetson is frantic.  He keeps waiting -- but this time\nSykes doesn't come up.  Jetson doesn't know what to do.\nFinally -- he leans down as far as he can, his face a foot\nfrom the water, SCREAMS to block the pain, and plunges his\nown arm below the surface!  He feels around, gets hold of\nsomething, and pulls.  It is Sykes' wrist.  He pulls hard,\nbringing the sputtering Sykes up out of the water.\n\n<b>\t\t\tJETSON\n</b>\t\t   (to Pilot)\n\tTake it up!\n\nThe Pilot does.  Sykes comes up out of the water.  His\nfeet are just clear of the surface when -- Harcourt's hand\nand arm rocket out of the water, grabbing Sykes' ankle.\nSykes looks down in horror.  The helicopter keeps moving\nup, and before Harcourt's body breaks the surface, the arm\ntears away from the torso at the shoulder.  Sykes wildly\nshakes the clinging severed arm from his ankle, and it\nfalls back into the water below.\n\nJetson continues pulling him up into the helicopter as it\nmoves off toward shore.\n\n\n<b>INT.  HELICOPTER - NIGHT\n</b>\nSykes plops on the floor, soaked, battered, holding his\nlimp arm.  Jetson is quickly whipping off his jacket,\nwrapping the dry part around his own arm, wincing in pain.\nThe Pilot stare down at the circle of water where they\njust pulled Sykes from.\n\n<b>\t\t\tPILOT\n</b>\tWhat the hell was that down there?\n\tIt was weird.\n\nJetson looks at Sykes, wondering if he will say.  Sykes\nlooks at Jetson a long moment, then--\n\n<b>\t\t\tSYKES\n</b>\tLooked like every other damn slag to\n\tme.  Just plain ugly.\n\nDespite the pain, Jetson smiles.\n\n<b>\t\t\t\t LONG DISSOLVE TO:\n</b>\n<b>INT.  CHURCH ANTEROOM - DAY\n</b>\nWe are CLOSE on Sykes, who is having a hell of a time,\ntrying to tie a tuxedo tie with one arm in a sling.  A\nPAIR OF ALIEN ARMS reach into FRAME to help him.  One of\nthe alien arms is also in a sling.\n\nANGLE WIDENS to reveal the alien is Jetson.  Both men wear\ntuxedos.\n\n<b>\t\t\tSYKES\n</b>\tHow do I look?\n\n<b>\t\t\tJETSON\n</b>\tYou look very good.\n\nThere's a knock at the door.  Sykes opens it.  There\nstands Sykes' daughter, KRISTIN, twenty years old, looking\nradiant in her wedding dress.  She is in a foyer, and\nbehind her is the interior of the church with all the\nassembled guests, including Mrs. Jetson &amp; son.\n\n<b>\t\t\tKRISTIN\n</b>\tReady, Daddy...?\n\nSykes' heart melts.  Before moving to the door:\n\n<b>\t\t\tSYKES\n</b>\tGeorge, uh... I want to apologize\n\tnow, in advance, for all the rotten\n\tthings I'll ever say or do to you\n\tover the years.\n\nSykes moves to join his daughter.  As he does:\n\n<b>\t\t\tJETSON\n</b>\tThat is all right, Matthew.  After\n\tall, you are only human.\n\nSykes, caught off guard, has to laugh.\n\n<b>\t\t\tSYKES\n</b>\t\t   (under his breath)\n\tWhat a wildman...\n\nSykes takes his daughter's arm and the two of them start\ndown the aisle.\n\n<b>\t\t\t\t    FADE OUT.\n</b>\n<b>\t\t\tTHE END\n</b>\n\n\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Alien Nation</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Rockne O'Bannon\" title=\"Scripts by Rockne O'Bannon\">Rockne O'Bannon</a>  <a href=\"/writer.php?w=James Cameron\" title=\"Scripts by James Cameron\">James Cameron</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Alien Nation Script.html#comments\" title=\"Alien Nation comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:58:11.038368"}