{"title": "Alien: Resurrection", "film_link": "/Movie Scripts/Alien: Resurrection Script.html", "script_link": "/scripts/Alien-Resurrection.html", "info_raw": "\n\nAlien: Resurrection Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (4.20 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Joss Whedon\nGenres  Action  Horror  Sci-Fi  Thriller\n\nRead \"Alien: Resurrection\" Script\n\n\n", "script": "\nAlien Resurrection \n\n\n\nEXT.  DEEP SPACE SILENT BLACK.\n\nWe sweep slowly across an endless tapestry of stars. Finally she comes \ninto view:\n\nthe U.S.S. AURIGA. A massive research vessel that sits majestically \njust beyond Pluto's orbit.\n\nWe TRACK ALONG the side of the ship, and \n\nINT.  AURIGA\n\nalong the silent, empty corridors, coming at last to a door with two \nguards standing rigid in front of it. Full armour, powerful \nshockrifles, expressions empty and cold.\n\nINT.  MEDLAB\n\nAlong a row of screens, where we see the first signs of life readouts, \nlights, data -- all shifting and collating on the blinking screens. \n\nAs we move ALONG them, a figure-in a labcoat passes through the frame, \nthen another,leading us along the lab to settle on what looks like a \nCryogenic tube, not big enough for a human.\n\nStill TRACKING around it, we glimpse inside some vague, fetal mass \nencased in a clear, aspic-like gel. \n\nTubes and cables a attached to the mass, running out of the machine.\n\nAs we still CIRCLE, the shape begins to be more coherent, till we can \nsee what might even be a face.\n\nEyes, shut tight.  Sleeping. Dreaming.\n\nANGLE: WHEAT.\n\nA birds eyes view of a field, the soft golden waves filling the screen.  \nSharp contrast to what we have seen before.\n\nThere is a woman wandering through the field.  Beside her a girl, seven \nor eight, in dingey sundress.  Both have black, tousled hair.\n\nGIRL'S VOICE\n\nMy mom always said there were no monsters -- no, real ones -- but there \nare.\n\nThe girl stops, looks around her.  The wheat comes all the up to her \nchest, and nothing  else is visible as far as she see.\n\nShe looks back at the woman but the woman is already more than fifty \nyards away.\n\nThe girl's expression becomes perplexed.\n\nShe slaps a bug on the back of her neck.  Pulls it off and is HUGE, \nwriggling fleshily in  her hand.  Her expression becomes even more \ndistraught, but she cannot muster forth a shout.\n\nThe sound of insects-fills the air.  Another bug lands on her, another.  \nShe looks down in  growing horror and sees:\n\nBlood.  At her feet, rising, filling the field, rising above the wheat, \na sea of blood now, dark, thick.\n\nThe girl tries again to scream, raises her arms.  She is completely \ncovered in insects, a skittering black shroud of them, and when she \nfinally does SCREAM they flood into her mouth.\n\nCUT TO:\n\nINT.  LAB\n\nInstruments show a jolt in heart rate, blood pressure.\n\nScientists note it down, look over at the thing in aspic.\n\nWe can tell that time has passed because it is much bigger, nearly the \nsize of a man, and in a new case.\n\nThe camera moves in on the cardiograph, then moves down, to show a \nsecond one. Tracking a smaller, much faster heartbeat.\n\nCUT TO:\n\nINT. HALLLWAY\n\nTiny. dark, and we are moving through it at impossible speed turning \ninto another without slowing, up into an air vent, still moving, moving \nuntil we reach a chamber, some place where all we can see is a mass of \ndark, moving, inhuman fle it welcomes us in, envelops us...\n\nANGLE: RIPLEY  Lying somewhere, maybe the dark-chamber -- in the dream \nit keeps shifting.\n\nShe opens her eyes, but they are dark, whiteless.\n\nShe reaches for her chest and begins scratching . Hard.\n\nTearing at it, as blood wells up, spilling over her sides.\n\nCUT TO:\n\nINT.  OPERATING CHAMBER\n\nAnd the cause of this dream becomes apparant:\n\nANGLE: RIPLEY'S CHEST\n\nbeing cut open with a lasersaw.\n\nWe see her body still has a layer of the aspic-slime clinging to it.  \nAnd her skin is unnaturally blue. But as we PAN from her chest to her \nface her identity is unmistakable.\n\nAround her are several men in operating masks.  Cutting her GEDIMAN, a \nyoung and enthusiastic scientist.  One man, seemingly in charge, stands \na bit off, watching.  This, by tag on his coat, is DR WREN.\n\nWREN\n\nCareful ... ready with the amnio...\n\nGediman finishes cutting.  Another man steps in with a clamp. Sets it.  \nPulls apart the chest.\n\nGEDIMAN\n\nThere she is...\n\nHe says it like he's found a lost kitten.  He reaches in an pulls out a \nsleeping, fetal but nearly ready to burst ALIEN. Others work at \nsevering umbilical threads that tie it to Ripley's chest.\n\nGEDIMAN\n\nHere we go.\n\nHe holds it up and others step in with the amnio, a sort of incubator \nfilled with  amniotic fluid.\n\nThe alien SCREAMS, its tiny mouth full with teeth, and wriggles out of \nhis grasp.\n\nWREN\n\nWatch it!\n\nEverybody panics -- but before the thing can get completely away from \nhim, Gediman grabs it and sticks it in the amnio.  Someone shuts the \ntop rapidly.\n\nEverybody looks at each other for a moment.\n\nGEDIMAN\n\nWell ...\n\nWREN\n\nThe host?\n\nA surgeon looks at Ripley's readings.\n\nSURGEON\n\nDoing fine.\n\nGediman looks at Wren, hopefully.  Wren nods.\n\nWREN\n\nSew her back up.\n\nGediman and the surgeon get to work, as the others carefully remove the \nalien.\n\nGEDIMAN\n\nWell, that went as well as could be expected--\n\nRipley's hand LASHES OUT, GRABS the surgeon's forearm.  He yells in \npain as her fingers dig into him, the others scramble knocking things \nover and we HEAR HIS BONE CRACKING.\n\nSMASH CUT TO:\n\nINT. RIPLEY'S CELL\n\nSudden stillness.\n\nRipley crouches in the middle of a small, dark chamber.  She's wide \neyed, staring straight ahead in a state of near catatonia. Hair tangled \nand wild. But at least she's not so  blue as before.\n\nThe only light on her comes from directly above, from a thick pane of \nglass in the center of the ceiling.\n\nANGLE: ABOVE THE CELL\n\nA guard stands on the floor above, looking into the cell through the \nsquare of glass in  the floor, directly above Ripley.\n\n(We see other panes of glass lining the floor, indicating more cells \nbelow.)\n\nANGLE: RIPLEY\n\nShe is still for a long while.  Then she lifts her hands, looking at \nthem.\n\nTouches her face, her skin.\n\nShe fingers her tunic, pulls down the neck.  There is a scar running \nalong her chest.\n\nShe fingers it thoughtfully. -\n\nShe looks at her forearm.  Tattooed near the crook of her elbow is the \nnumber 8.\n\nShe looks up, her face unreadable.\n\nCUT TO':\n\nINT.  LAB\n\nRipley is sitting on a table as Gediman draws blood from her.\n\nHe deposits it in a test beaker, studies her eyes.\n\nWren enters, looking at a chart.\n\nWREN\n\nHow's our number Eight today?\n\nGEDIMAN:\n\nAppears to be in good health...\n\nWREN\n\n(noticing his tone)\n\nHow good?\n\nGEDIMAN\n\nExtraordinary. As in, completely off our projected charts.\n\n(shows him some photos) Look at the scar tissue.  See the recession?\n\nWREN\n\nThis is from --\n\nGEDIMAN\n\nYesterday!\n\nWREN\n\nThis is good.  This is very good.\n\nGEDIMAN\n\nI'd like to run some tests: strength, coordination...  We're not \nlooking at a normal cloning arc.\n\nWREN:\n\nApproved.\n\nWren goes up to Ripley, studies her face with satisfaction.\n\nWREN\n\nWell, it looks like you're going to make us all very proud.\n\nShe grabs his throat with dazzling speed, applying deadly pressure as \nshe  brings his face to hers.  Her eyes are burn but lost.\n\nRIPLEY\n\nWhy?\n\nGEDIMAN\n\nOh my God...\n\nHe is as wide eyed as WREN, and he isn't having his windpipe crushed.\n\nAfter a moment the shock wears off and he slams his hand into the \nalarm.\n\nKlaxons, red light fire up.\n\nA guard rushes in, levels his weapon at Ripley.  After a moment of \nstaring him down, she opens her hand.  Wren falls to his knees gasping.\n\nThe guard FIRES his rifle at her -- a powerful electrical charge lashes \nout and sends her flying back into the corner.\n\nWREN\n\nNo! No! I'm all right!\n\nThe guards keep their weapons -- 'burners', these shockrifles are \ncalled -- leveled  at Ripley. She has recovered from the shock quickly, \nsits crumpled in the corner, looking at nothing in particular.\n\nRIPLEY (wearily)\n\nWhy...?\n\nCUT TO:\n\nINT.  OBSERVATION ROOM\n\nWren and Gediman watch through a one way mirror as a scientist tests \nRipley.\n\nWith them is General PEREZ, the man in charge this boat. Ramrod \nstraight and about  as gruff as you would expect, he stares at Ripley \nsuspiciously.\n\nANGLE: RIPLEY\n\nThe scientist is holding up cards with pictures on them: house, dog, \nboat.\n\nRipley gives answers we can't hear through the glass, looking pissed \noff and bored.\n\nWREN\n\nIt's unprecedented.\n\nGEDIMAN\n\nTotally!  She's operating at a completely adult capacity.\n\nPEREZ\n\nAnd her memories?\n\nWREN\n\nThere are gaps. And there's some degree of cognitive dissonance.\n\nGEDIMAN\n\nShe's freaked.\n\nWren shoots Gediman a stern look at his unscientific parlance.\n\nWREN\n\n\"It\" has some connective difficulties. A kind of low level emotional \nautism.\n\nCertain reactions....\n\nPerez looks at Ripley through the glass, then exits into the hall.\n\nTO:\n\nINT HALL - CONTINUOUS\n\nThe two scientists follow, pace him as he strides down towards a second \nobservation room.\n\nGEDIMAN:\n\nBut the thing is, we can't terminate her. It.\n\nPEREZ\n\nYou haven't told me what you think has caused this.\n\nCloned genes don't contain memory cells, not even when they're brought \nto adult term.  I'm right?\n\nGEDIMAN\n\nThere's been cases..\n\nPEREZ\n\nNot like this.\n\nWREN\n\nWell, we don't have nearly enough data... but in some cases there is a \ncollective memory passed down generationally. At a genetic level. Like \ninstinct, only  more complex structurally.\n\nPEREZ\n\nIn some cases. You're talking about the alien.\n\nWREN\n\nYes.\n\nPEREZ\n\nYou promised me there wasn't going to be any crossing.\n\nWREN\n\nIt's not like the other ones..\n\nPerez punches code, puts his hand on the scanner and the second \nobservation room door opens..\t\n\nHe steps in, the other two right behind him.\n\nCUT TO:\n\nINT. OBSERVATION ROOM TWO\n\nDarker than the first one, and with two of the heavily armoured guards \nby the door.\n\nApart from-that, identical.  Perez turns to the others.\n\nPEREZ\n\nBut there is some genetic mix.\n\nWREN\n\nYes.\n\nPEREZ\n\nWill there be further mutation?\n\nGEDIMAN\n\nMutation isn't exactly... I don't think so.\n\nWREN\n\nThat's one of the things we need to study.\n\nPEREZ\n\nAll right. You can keep it. But secure, under obsorvation, and for \nGod's sake keep it away from here.  I don't want any more surprises.\n\nAnd as he speaks the ALIEN RISES RIGHT BEHIND HIM -- it's big, the \nridges on its head indicating a young queen -- it hisses and LUNGES at \nthe back of his head.\n\nThe reinforced plastic window between them, which we couldn't see, \nstops it.\n\nAs it hits, a thin laser grid buzzes to life, sparks crackling on the \nalien's face.\n\nIts bile trails darkly on the glass as it backs off.\n\nPerez turns to look at it with the others.\n\nPEREZ\n\nIt took a hell of a lot to get us here.\n\nGEDIMAN\n\nNo shit.\n\nWren shoots him another look.\n\nPEREZ\n\nHow soon before this one's ovulating?\n\nWREN\n\nDays.\n\nPEREZ\n\nIs that normal?\n\nWREN\n\nNo way of knowing for sure, but I'd say it's accelerated.\n\n(After a moment) We're going to need the supplies.\n\nPEREZ\n\nThey're coming.  Soon.\n\nCUT TO:\n\nINT. MESS HALL\n\nRipley sits across from Gediman. He is eating at a good pace - Ripley, \nhowever, has stopped.  She is staring at her fork, her brows furrowed.  \nTurns it over in her hand, in her mind.\n\nGEDIMAN\n\n\"Fork.\"\n\nThe memory comes, and she shakes her head wearily.\n\nRIPLEY (softly)\n\nFuck....\n\nGEDIMAN (pretending to correct her)\n\n\"Fork.\"\n\nEver so slightly, she smiles. The smile fades, and after a moment:\n\nRIPLEY\n\nHow did you...\n\nGEDIMAN\n\nHow did we get you?  Blood samples from Fiori 16. On ice. \n\nDo you remember that place?\n\nRIPLEY\n\nDoes it grow?\n\nGEDIMAN\n\nDoes it.....Yeah. Rapidly.\n\nRIPLEY\n\nIt's a queen.\n\nGEDIMAN\n\nHow did you know that?\n\nRIPLEY\n\nIt'll breed.  You'll die.  Everyone in the ... fucking.... (searches \nfor the word, then spits it out) ... Company.  Will die.\n\nGEDIMAN\n\nCompany?\n\nWREN (O.S.)\n\nWeyland Yutani.\n\nHe has entered behind her, comes up to the table.\n\nWREN\n\nOur Ripley's former employers.  Terran Growth conglom, had some defense \ncontracts  under the military. Before your time, Gediman -- they went \nunder decades ago, bought out by Walmart.  Fortunes of war.\n\n(to Ripley)\n\nYou'll find things have changed a good deal since your time.\n\nRIPLEY\n\n1 doubt that.\n\nWREN\n\nWe're not flying blind here, you know.  This is United Systems \nmilitary, not some greedy corporation. The potential benefits of this \nrace go way beyond urban pacification.\n\nNew alloys, new vaccines ... there's nothing like this in any world \nwe've seen.  \n\nYou should be very proud.\n\nShe laughs, bitterly.\n\nRIPLEY\n\nOh, I am.\n\nWREN\n\nAnd the animal itself is wonderous. They'll be invaluable once we've \nharnessed them.\n\nRIPLEY\n\nIt's a cancer.  You can't teach it tricks.\n\nThis stops Wren, and he retreats silently.  Ripley repeats word to \nherself, thinking.\n\nRIPLEY\n\n\"Them\" ...\n\nCUT TO:\n\nINT.  HALL   CONTINUOUS\n\nAs Wren is leaving the mess, he is accosted by an ensign.\n\nENSIGN\n\nDoctor, General Perez is asking for you. We've been hailed.\n\nCUT TO:\n\nEXT.  DEEP SPACE\n\nWe see the Auriga far in the distance Suddenly A SHIP ROARS INTO FRAME, \nheading for it.  \n\nA small vessel, it is every bit dirty and jerry-rigged as the Auriga is \npristine.  \n\nTo accentuate the difference, the sudden roar of its engines is \naccompanied by \n\nHEAVY, THRASHING ROCK MUSIC.\n\nCUT TO:\n\nINT.  COCKPIT    CONTINUOUS\n\nThe music is coming from nearby.  Piloting the ship toward the Auriga \nis HILLARD, a roughskinned woman in her forties, along with RANE, a \nslight and quiet fellow.\n\nBehind them stands ELGYN, the leader of the group.\n\nHas the kind of authority that doesn't need to flaunt itself.\n\nMaybe fifty, by the silver in his hair. He speaks into the vidcom\n\nELGYN\n\n(good naturedly)\n\nMy authorization code is 'fuck you', son.  Now open the goddamn bay or \nGeneral Perez  is gonna do a Wichita stomp on your virgin ass.\n\nHe switches off.\n\nRANE\n\nWichita stomp?\n\nELGYN\n\nI guarantee that boy's. Never seen the inside of a woman.\n\n(to Hillard)\n\nBring us in on three-oh descent, ride the parallel.\n\nHILLARD\n\nDarlin', it's done.\n\nELGYN\n\nDon't cut thrust till six hundred meters. Give em a little fright.\n\nHe puts his hand on her shoulder, runs it up along her cheek as he \nexits.\n\nThey're more than friends.\n\nHe moves through a hallway, sticks his head in a cubicle.\n\nELGYN\n\nChristie!  St Just!  Rise and shine. We're docking.\n\nHe proceeds into:\n\nINT.  CARGO BAY - CONTINUOUS\n\nIt's the largest space in this boat, two stories high. Taking up most \nof the space are two HARVESTERS, big rusty hovering threshers roughly \nthe size of winnebagos.\n\nAs Elgyn enters, we CRANE UP to reveal ANNALEE-CALL working atop one of \nthem.\n\nShe's young, tough -- at home with this  motley bunch despite her youth \nand prettiness.\n\nELGYN\n\nCall!  CALL!\n\nThe music is louder here -- it's blasting from a box in the corner.  \n\nElgyn switches it off.\n\nELGYN\n\nCall!\n\nCALL\n\nWhat?\n\nELGYN\n\nWe're docking! Are the cargo trucks secured?\n\nCALL\n\nI checked 'em an hour ago.\n\nELGYN\n\nI don't want em so much as rattled. Any leakage, I take it out of your \nhide.\n\nCALL\n\nTrust me, boss.\n\nELGYN (laughs)\n\nNot my style.\n\nHe leans down, looks under the thresher.  Lying on a gurneylike steel \ndolly, working under the machine, is VRIESS, chie mechanic.  Late \nforties, in pretty good shape considering he's got no legs.\n\nELGYN\n\nHow's it looking?\n\nVRIESS  It's never gonna be pretty. but she'll fly.  The other one's a \ntotal fucking write-off.\n\nELGYN\n\nYou'll make it good.\n\nVRIESS\n\nDon't be so sure.\n\n(calls out) Call!  Adjust the generator plugs!\n\nELGYN (straightening up)\n\nThey just gotta run, Vriess.  They don't gotta run far.\n\nHe exits.\n\nCUT TO: INT. HALL   CONTINTJOUS\n\nCHRISTIE is up and mostly dressed. He is black, very large, and has \ndistinctly military bearing. He speaks with quiet, don't-fuck-with-me \nauthority.\n\nCHRISTIE\n\nWhat's our status?\n\nELGYN\n\nWe're coming in.  Time to enjoy a little of the general's hospitality.\n\nST JUST\n\nOh great.  Army food..\n\nST JUST (\"San-Jhoost\") is slim, Asian -- and the epitome of cool.  \n\nMoves quickly and silently, a sly grin playing about lips.  He is \nstrapping a contraption to his forearm.  It resembles a deringer \nholder, but a very complex one.\n\nELGYN: We could use a rest, till the heat's off and Vriess can get \nthose harvesters on their feet.\n\nThis'll keep us for a couple of days, assuming the natives are \nfriendly.\n\nCHRISTIE\n\nWe expecting any trouble?\n\nELGYN\n\nFrom Perez? I doubt it. Still, let's be ever vigilant.\n\nCUT TO: INT.  CARGO BAY     CONTNIUOUS\n\nANGLE: VRIESS working intently, the extremely nasty blades of the \nthresher inches above his head.\n\nVRIESS\n\nI'm patched in. Check the sequence timer.\n\n(no answer)\n\nCall?\n\nANGLE: THE CONTROLS\n\nA hand reaches in toward the ON switch.\n\nANGLE: VRIESS\n\nVRIESS\n\nCall?\n\nThe thresher GRINDS TO LIFE -- a hundred blades and claws spinning at \nVriess's head!\n\nVriess wheels out from under the machine in a second flat.\n\nVRIESS\n\nGoddamnit!\n\nThe second he's out he hits a lever and the back of the dolly flies up, \ntransforming it-into a wheelchair.\n\nVRIESS  Johner! You son of a whore!\n\nJOHNER jumps down from the machine, laughing.  He's thickset, mean and \nugly, with ugly scars crisscrossing his ugly bald head.\n\nThought I'd give you a little haircut there.\n\nVRIESS\n\nYou fuck!\n\nCall, who has been over on the other side of the thresher, ably climbs \nup on it  and switches it off.\n\nJOHNER\n\nYou should see your face. Vriess, you must have soiled yourself.\n\nVRIESS One of these days I'm gonna kill you. My hand to God.\n\nJOHNER\n\nWell, you already gave him your feet ...\n\nCALL (jumping down)\n\nYou're a limp fucking scrotum, you know that?\n\nJOHNER\n\nEither of you want a piece of me, I'm less than busy.\n\nVRIESS\n\nAny time.\n\nCALL\n\nVriess. Forget it. He's been sucking down too much homebrew.\n\nJOHNER\n\nDon't push me, little Annalee.  You hang with us a while, you'll learn \nI'm not the man with whom to fuck.\n\nHe exits, full of annoying bravado.\n\nVRIESS\n\nThat inbred cocksucker.\n\nHe feels his forehead, comes up with a bit of blood.  Realizes how \nclose it was ...\n\nCall looks up at the thresher.\n\nCALL\n\n1 hate machines.\n\nVRIESS\n\nWell, now we know it works ...\n\nCUT TO: EXT.  AURIGA DOCKING BAY\n\nAs it opens to admit the proportionally tiny ship.  The bay on the \nbottom of the Auriga \n\n- the doors are actually OVER the ship, which rises into the airlock.\n\nINT.  AIR LOCK\n\nThe outer doors close under the ship.  Pressurized air shoot into the \nairlock for a few seconds, and then the inner door opens. the ship \nrising into the bay.\n\nINT.  BAY\n\nThe ship moves slowly along the huge dock to land gently at far end.  \nThe top of  the ship is nearly level with a grated platform that runs \nthe length of the bay.\n\nThree soldiers in full armour stand rigid on the platform. The hatch \natop the ship slowly  opens. One by one the crew files out. Seeing them \nen masse, we get a clearer view of  what separates them from this \nEnvironment.  They're not wearing uniforms.  They're an  eclectic, \nfiercely indivualist group, their look varied -- spots of bright color \nshowing  through militarian space gear.  Johner's bright tuorquise \nbowling shirt.  Elgy's and St Just's floorlength leather dusters.  Even \nVriess's chair stands out as he wheels down the platform.\n\nWhat they have in common is the toughness, the wary eyes, leathery \nskin.  The cool readiness to kill.  These guys are smugglers.  A long \nwhile ago, you'd have called them pirates\n\nAll eight of them emerge, one by one, looking around them.  They file \npast the silent, uniformed soldiers.  The last one suddenly puts a hand \non Johner's jacket, stops him.\n\nThere is a bulge under it.  A green sensor light on the back of the \nsoldier's glove turns  red when he touches the bulge.\n\nSOLDIER\n\nNo projectile weaponry is allowed on board the vessel, sir.\n\nJohner opens his jacket, shows what he's packing: a large thermos.\n\nJOHNER\n\nMoonshine. My own. Much more dangerous.\n\nSOLDIER\n\nSorry, sir.\n\nELGYN (to Perez)\n\nWhat, do you think we're going to hijack the vessel?  All eight of us?\n\nNo, I think one of your asshole crew is going to get drunk and put a \nbullet through  the hull. we are in space, Elgyn.\n\nHe enters from the antechamber, motions for the crew to follow him. \n\nVriess comes abreast of the soldier.\n\nVRIESS\n\nWanna check the chair?\n\nThe soldier makes no response, simply falls in behind Call, the last of \nthem.\n\nCUT TO:  INT.  ANTECHAMBER\n\nThe long neck that connects the bay to the body of the ship.  The group \nproceeds down it, the crew looking about them at the sterile grandeur.\n\nST JUST\n\nThis place is really clean.\n\nJOHNER (to a guard)\n\nHey.  You got any whores on this vessel?\n\n(the guard remains stonefaced)\n\nAny loose women with bad eyesight?\n\nPEREZ\n\nI think you'll find our accomodations somewhat spartan.  Although the \ncook sets a good-table.\n\nJOHNER: That ain't what I'm hungry for.\n\nVRIESS (to Call)\n\nWhat's the matter?\n\nShe is looking around her, somewhat tensely.\n\nCALL\n\nI don't like army.\n\nHILLARD\n\nYeah, join the fucking club.\n\nCUT TO: ANGLE: MONEY\n\nA stack of bills dropped down on a desk, then another.  They're green, \nand identifiably money. But they're square, about the size of cocktail \nnapkins.  The face on them is  unfamiliar.  Thousand dollar bills.\n\nWIDER ANGLE: INT.  PEREZIS CHAMBERS    LATER\n\nA good sized suite, decorated in a sparse, military fashion. Perez is \nbehind his desk, the money sitting between him and Elgyn.\n\nPEREZ\n\nThis wasn't easy to come by.\n\nELGYN\n\nNeither was our cargo. You're not pleading poverty, are you?\n\nPEREZ\n\nWe're well funded. I mean the bills. There's not many that still deal \nin coin.\n\nELGYN\n\nJust the ones that don't like their every transaction recorded. The \nfringe element.\n\nI guess that would include you, though, wouldn't it?\n\nPEREZ\n\nDrink?\n\nELGYN\n\nConstantly.  I'm guessing whatever you've got going here wasn't exactly \napproved by congress.\n\nPerez pours two whiskeys.\n\nPEREZ (changing the subject)\n\nSo where do you go from here?\n\nELGYN\n\nOut by the Handle.  We've got a couple of harvesters, we can unload 'em \non one of the collectives if Vriess and Call get 'em working.\n\nPEREZ\n\nCall.  Where'd you find her?\n\nELGYN\n\nShe is severely fuckable, isn't she? - And the very devil with a socket \nwrench.\n\nI think Vriess somewhat pines.\n\nHe takes a stack of bill, smells it.  He likes the smell.-\n\nELGYN\n\nShe is curious about this little transaction.  You can hardly blame \nher, Awfully cloak and  dagger...\n\nPerez hands a drink to ELGYN.\n\nPEREZ\n\nThis is an army operation.\n\nELGYN\n\nMost army research labs don't have to operate outside regulated space.\n\nAnd they don't call for the kind of cargo we brought.\n\nPEREZ\n\nDo you want something, Elgyn?\n\nELGYN\n\nJust bed and board, couple of days worth.  If we're not imposing.\n\nPEREZ\n\nNot at all. Keep out of the restricted areas, don't start any fights, \nand mi casa is yours too.\n\nElgyn drinks to that.\n\nPEREZ\n\nI trust, of course, that you can mind your own business.\n\nELGYN (smiles)\n\nI'm famous for it.\n\nThey drink. \n\nCUT TO: INT. HALLWAY - RESTRICTED AREA\n\nThe 'cargo' is rolled down the corridor, armed guards flank it. It is \nwheeled into:\n\nINT.  A CHAMBER\n\nWhere Wren and a few others are waiting.  Gediman looks a little \nnervous, not sure this is a good idea.\n\nThe cargo is locked into place on the floor and and a guard works the \nelectric lock.\n\nIt springs open and the guard slides off a side panel.\n\nThey are stacked one on the other, five of them in all, cryotubes. \nPeople sleeping inside.\n\nOne by one the tubes are hauled to one side of the room as the second \nunit is wheeled in.\n\nBy the end there are ten people sleeping side by side in their tubes in \nthe dark chamber.\n\nThe scientists meanwhile retire to INT.  AN ADJOINING CHAMBER with a \nlong glass window looking at the chamber.\n\nThe last of the guards leaves the chamber and we see the door lock \nbehind them.\n\nWren starts pushing buttons.\n\nThe glass tops of the cryotubes slide open.  We see temperature and \nlifesign gauges begin to change..\n\nThere is a thick whirring as a part of the ceiling above the tubes \nlowers, lowers,  and rotates slowly.\n\nStuck to the other side of it are ten alien eggs.  The ceiling rotates \njust enough so that they are aimed at the heads of the sleepers.\n\nFor a moment nothing happens.\n\nOne of the sleepers eyes flutter slightly. Opens. All ten eggs open \nsimultaneously.\n\nCUT TO: INT.  CONFERENCE HALL\n\nA huge room, used for assemblies and events. It has a chain basketball \nnet set up at one end, crude court lines taped to the floor.  Ripley \nstands beneath the net with a ball, dribbling absently.\n\nAt the other end are set up tables and folding chairs.  The crew of the \nBetty, sans Elgyn, are filing in to eat here.  Johner spies Ripley, \nsmiles.\n\nJOHNER\n\nOoh.\n\nJohner comes up to Ripley.  Her expression makes it clear how much she \nenjoys having him in her face.\n\nJOHNER\n\nHow about a little one on one?\n\nShe keeps dribbling, says nothing.\n\nJOHNER\n\nWhat do you say?\n\nRIPLEY\n\nGet away from me.\n\nJOHNER\n\nWhy should I?\n\nRIPLEY\n\nBecause pain hurts.\n\nHe falters a moment at her quiet threat, then:\n\nJOHNER Are you gonna hurt me then? 1 think I might enjoy that.\n\nHe smiles his ugly smile. She smiles back.\n\nShe hits, him solidly in the chest -- and he flies back ten feet, \nlanding badly on a group of chairs.\n\nHis mates fly into action, Christie grabs a standing ashtray. Hillard \njumps Ripley from behind.   She throws her off with e -- chucks the \nbasketball at her hard enough to pop the air out of it.\n\nChristie swings at her and SMASHES her right in the face.\n\nShe arcs back... and right back up, at Christie's throat before he has \na chance to react, squeezing, batting away the ashtray just a trickle \nof blood coming down her nose --\n\nJohner cames at her again and she leaps on him, throws him to the \nground, snarling,\n\nSHE'S GONNA RIP HIS THROAT OUT WITH HER TEETH.\n\nWREN\n\nRipley.\n\nRipley looks up and four guards are pointing burners at her.  Wren and \nGediman behind them.\n\nCall, standing to one side with Vriess, reacts visibly to the name.  \nEverybody is slowly backing off.  St Just stands with his hands behind \nhis back, as if concealing something.\n\nCall watches in rapt silence.\n\nWREN\n\nDon't let's have a scene.\n\nRipley lets go of Johner, stands.\n\nRIPLEY\n\nHe... smells\n\nWREN\n\nI imagine he does.\n\nJOHNER (barely breathing)\n\nWhat the fuck are you?\n\nShe looks down on him - in both senses of the phrase. - Look around at \neveryone staring at her.\n\nShe wipes the bit of blood from under her nose, flicks it away. Exits.\n\nWREN (to Gediman, amused)\n\nSocial skills, less than a hundred' percent.\n\nANGLE: RIPLEY'S BLOOD\n\nThe few drops she flicked away sizzle on the floor -- not eating \nthrough, but melting  a small patch.\n\nTO: INT.  LABS - LATER\n\nA large metal box is being wheeled next to an observation pen. Soldiers \nsurround it, weapons at the ready.  Not one of them at ease.\n\nWren and Gediman watch intently.\n\nWREN\n\nWhat's the status on the Queen?\n\nGEDIMAN\n\nWe still haven't detected the origin of the reproductive anomalies. But \nthe egg laying  stage appears to be over.\n\nWREN\n\nDid we do something wrong?\n\nGEDIMAN\n\nI don't know. I think we covered everything. But these redundancies...\n\nA soldier lifts a panel in the pen and then doors to the cage come open \nautomatically.\n\nEveryone waits.\n\nA fullgrown alien suddenly bolts into the pen. The soldier shut it as \nquickly as humanly possible.\n\nWREN\n\nFather, check security status, observation pen six.\n\nFather, the voice of the ship, replies after a moment in a dulcet, \ncomforting tone.\n\nFATHER\n\nPen six secure, security systems functional at 100%.\n\nWREN\n\nGood.  Now the others.\n\nCUT TO: INT.  SLEEP CHAMBERS - NIGHT\n\nWe see VARIOUS ANGLES of people at night:\n\nRane, in, a chamber on the Auriga.\n\nHillard and Elgyn, in a slightly more lush one.\n\nPerez, in his quarters.\n\nVRIESS, rolling about the Aurigals engine room, looking it over.\n\nChristie, St Just, Call and Johner, all playing poker in the mess hall.\n\nCUT TO:  INT.  OBSERVATION ROOM - RIGHT\n\nA sleep cycle is indicated here by the low lighting and the near \nemptiness of the room.\n\nGediman alone is in here, writing observations down in a notebook as he \nwatches the pen.\n\nInside are three aliens. Two of them seem to be hibernating, curled up \nin the corner,  but the third faces the glass, tilting its head and \nhissing at it. \n\nGediman sits right up close to it, his face just inches away from the \nbeast's.  It draws back its lips, opens its mouth.  The metallic tongue \nissues slowly forth, dripping with slime.\n\nGEDIMAN (softly, fascinated)\n\nIs that a distended externus lingua ... or are you just happy to see \nme?\n\nThe creature hisses. retracts the tongue. Gediman scribbles few notes.\n\nSomething moves in the dark behind him. Before he can notice, a hand \ncloses on his shoulder.\n\nIt's Ripley. She steps forward, eyes locked on the cage. Gediman seems \nonly mildly surprised.\n\nGEDIMAN\n\nHow did you get in here?\n\nRIPLEY\n\nBeautiful, aren't they?\n\nGEDIMAN\n\nYes.  Yes they are.  I've been monitoring their interaction.\n\nHe points at a audiograph by the wall, blips and waves interrupting the \nvibrating line, indicating sound.\n\nHe notices that her hand is still on her shoulder.\n\nGEDIMAN\n\nThey communicate.  Through ultrasonic soundwaves.  Sort of like bats.\n\nRIPLEY\n\nI know.\n\nShe looks at him.\n\nRIPLEY\n\nI can hear them.\n\nGEDIMAN (smiling)\n\nAmazing ...\n\nShe runs her hand through the back of his hair, gently urging him up \noff his chair.\n\nGEDIMAN\n\nRipley...\n\nRIPLEY\n\nShhhhh.\n\nShe pulls him close, kisses him.  Lightly at first, then deeply - \nholding his head with both hands. He responds with surprising warmth, \nthe kiss drawing out, pulling slowly apart.\n\nShe looks at him, smiles.\n\nAn alien tongue SHOOTS out of her mouth, burying itself in his face.\n\nSMASH CUT TO: INT.  RIPLEY'S CHAMBER\n\nAs she suddenly awakes, eyes wide, breathing hard.\n\nShe has been sleeping, we see, in the same position she was before: \nsquatting in the middle of the room. She looks about her, recovering \nfrom the nightmare... Her breathing slows. With a somewhat fatalistic \nlook, she settles back to sleep.\n\nCUT TO: INTERIOR MESS HALL - NIGHT\n\nChristie, Call, St Just and Johner are still at their all night poker \ngame, stacks of bills, peanuts and liquor scattered the table.\n\nThey are in a tense hand, the pot impressively high.\n\nJOHNER\n\nI'm in.\n\nCHRISTIE\n\nAll right.\n\nST JUST\n\nRaise you two hundred.\n\nJOHNER\n\nOh, fuck you!\n\nCALL\n\nThat's it. I'm out. I'm fucked.\n\nShe throws down her cards, takes a swig of Johner's patented moonshine. \nIt tastes horrible.\n\nCHRISTIE\n\nThat takes me down, too. Johner?\n\nJOHNER\n\nUh, Uh, fuck it. I fold.\n\n(to St Just)\n\nWhat do-you got?\n\nSt Just calmly shuffles his cards back into the deck.\n\nST JUST\n\nYou'll always wonder.\n\nJOHNER\n\nYou asshole.\n\nCHRISTIE\n\nJohner, your deal.\n\nCALL\n\nDeal me out. It's not my night.\n\nShe tries to stand up, takes a spill over her chair.  The others laugh.\n\nCALL\n\nJesus, Johner, what do you put in that shit, battery acid?\n\nJOHNER\n\nJust for coloring.\n\nST JUST (producing a small vial)\n\nI got something that'll take the edge off that.\n\nCALL  Thanks, I'll walk it off.\n\nShe stumbles out of the room.  Johner shuffles the deck.\n\nJOHNER\n\nBitches should not play with the boys, they will get cleaned out.\n\n(dealing)\n\nEight card throwback, fuck your sister and the sevens are wild.\n\nCUT TO: INT.  HALL\n\nAs soon as she is out of sight, Call straightens up, completely sober.  \nShe looks around her and takes off toward the restricted areas.\n\nShe comes to the door and making sure no one is around, star punching \nin code on the keypad.\n\nCUT TO: INT.  CELLBLOCK - MOMENTS LATER\n\nAs Call pads silently down it, looking for one cell.\n\nTO: INT.  RIPLEY'S CELL - CONTINUOUS\n\nThe cell door opens silently.  Call hesitates a moment, then slips in, \nshutting the door behind her.\n\nRipley is sleeping, still in the squatting position in the middle of \nthe room. \n\nCall approaches.\n\nShe stares down at Ripley a moment.  A shadow passes as a guard walks \nabove them,\n\nCall tenses till he is gone.  Look's back down at Ripley -- still \nsleeping.\n\nCall extends her hand, flexes her wrist.  The meanest lookin stilletto \nyou've ever seen extends from out her sleeve. it, gotta be a foot long, \nand sharp enough to shave with.\n\nShe lifts back her arm, the better to punch it through Ripley's heart.\n\nRipley shifts slightly.  Call stops.\n\nANGLE: RIPLEY'S CHEST\n\nHer shirt is open enough to show a good portion of the scar. Call \nhesitates, staring, realization flooding her face.\n\nRIPLEY\n\nWell?\n\nCall starts, moving back a pace.\n\nRIPLEY\n\nYou gonna kill me or what?\n\nCALL\n\nThere's no point, is there?\n\nA flick of her wrist and the stilletto whips back up her sleeve.  \nRipley sits up.\n\nCALL\n\nIt's already out of you.  Christ... Is it here?  Is it on board?\n\nRIPLEY (smiling)\n\nYou mean my baby?  CALL\n\nI don't understand.  If they've got it, why are they keeping you alive?\n\nRIPLEY\n\nCurious.  I'm the latest thing...\n\nCALL\n\nThose sick fucks.\n\nShe raises her arm, the stilletto gliding out again.\n\nCALL\n\nI can make it stop.  The pain... this nightmare.. That's all I can \noffer you.\n\nRipley holds her palm up, presses it against the point of the blade.\n\nRIPLEY\n\nWhat makes you think I would let you do that?\n\nRipley pushes her hand out - the blade goes RIGHT THROUGH HER PALM. She \nkeeps pushing her hand out slowly, a good five inches of the blade \nsticking out the back of her hand  before she stops. Call stares at \nher.\n\nCALL\n\nWhat are you?\n\nRIPLEY\n\nRipley, Ellen, Lieutenant first class, number 36706.\n\nCALL\n\nEllen Ripley died two hundred years ago.\n\nRipley pulls her hand back suddenly, grimacing at the pain.\n\nRIPLEY\n\nWhat do you know about it?\n\nCALL\n\nI've read Morse -- I've read all the banned histories.  She gave her \nlife to protect us from the beast.  You're not her.\n\nRIPLEY\n\nIf I'm not her. What am I?\n\nCALL\n\nYou're a thing.  A construct.  They grew you in a fucking lab.\n\nRIPLEY\n\nBut only God can make a tree.\n\nCALL\n\nAnd now they've brought the beast out of you.\n\nRIPLEY (smiling)\n\nNot all the way out.\n\nCALL\n\nWhat?\n\nRIPLEY\n\nIt's in my head.  Behind my eyes.  I can hear it moving.  The beast.\n\nThe smile is gone, some real vulnerability showing through.  Call \nsoftens, trying a different tack.\n\nCALL\n\nHelp me.  If there's anything human in you at all, help me stop them \nbefore  this thing gets loose.\n\nRIPLEY\n\nIt's already loose.\n\nCall's expression changes.  Those words terrify her, but she's not sure \nif Ripley means what she thinks.\n\nRipley raises her hand at Call's head -- Call flinches but Ripley stops \na few inches away.\n\nThen touches her forehead gently, almost sensually.\n\nRIPLEY\n\nOnce the thought .... the hope for it ... grows here.... it has found \nits way.\n\nIt will come, because... man will bring it.  Bring it forth.\n\nCALL\n\nYou want that.\n\nRIPLEY\n\nI've come to terms with the fact of it. It's inevitable.\n\nCALL\n\nNot so long as there's breath-in me.\n\nRipley LASHES OUT and GRABS CALL'S THROAT.  Call swings wit the blade \nbut Ripley has her arm pinned before she can connect.  Ripley squeezes \nthe girls neck.\n\nRipley looks at the girl with a world of sadness.\n\nRIPLEY\n\nI can... make it ... stop...\n\nCall's eyes are pleading, terrified. Ripley finally lets go and she \ndrops to the ground gasping for air.  RIPLEY\n\nGo. They're coming for you.\n\nAs soon as she can move, Call scrambles up and heads out.\n\nCUT TO: INT.  HALL - CONTINUOUS\n\nCall comes out and before she can move a RIFLE BUT hits her the head.  \nShe goes down but  not out as two guards grab her. Wren is with them \nand three more.\n\nWREN\n\nI think you're gonna find that this was ill advised.\n\n(to the men) Where are her friends?\n\nGUARD\n\nMess hall, most of them.\n\nWREN\n\nSound the alarm. I want them rounded up. Now!\n\nTO: INT.  MESS HALL - MOMENTS LATER\n\nANGLE: THE CARD TABLE\n\nBeing kicked over.\n\nElgyn, Hillard and Rane are pushed into the room, sleepy and confused.\n\nChristie, St Just, and Johner are all being herded in by soldiers.\n\nCall is thrown into the group as well.\n\nELGYN\n\nWhat the fuck is going on here?\n\nCHRISTIE\n\nLooks like a doublecross, boss.\n\nWREN\n\nWhere's the other one? With the chair?\n\nJOHNER (to a soldier)\n\nGet your fucking hands off me!\n\nELGYN\n\nDo you mind telling me what the fuck you're up to?\n\nWREN\n\nShut up! \n\n(to a guard) Get the general.  Wake him up.\n\nELGYN\n\nLook, if there's a problem tell me what it is. We can work this out, \nthere is no  need to get emotional ...\n\nSt Just is silent, standing in the same position he was when Ripley \nattacked Johner.\n\nHands behind his back.\n\nANGLE: BEHIND ST JUST'S BACK\n\nAs Elgyn speaks, two guns..slip out of his sleeves and fill his hands.\n\nCALL\n\nThey got nothing to do with this, Wren.\n\nELGYN (to Call)\n\nTo do with what?\n\nWREN  I don't give a fuck. It's way too late for that. You're all \nlooking at a firing squad.\n\nYou hear me?\n\nELGYN\n\nI do.  St Just?\n\nWith lighting precision, St Just raises his hands and blows of the \nguards away.\n\nHe takes out a third to his left without even looking that way.\n\nOne guard gets off a shot with his burner, frying Rane before Hillard's \nelbow knocks his teeth well into his throat.\n\nChristie tackles the next as Johner presses a latch on the bottom of \nhis thermos --  the top half flies off, revealing handle of a gun \ninside. He grabs it and another  guard runs. Johner doesn't have time \nto pull the gun-out of the the so he SHOOTS right through it, sending \nthe guard flying..\n\nCUT TO: INT.  ALIEN OBSERVATION LAB - CONTINUOUS\n\nAlarms, flashing red lights.  Gediman looking in a video monitor.\n\nGEDIMAN\n\nWhat the fuck... You three!  Go! Sector two.\n\nAll but one of the guards rush out to investigate.  Gediman works the \nsurveilliance screen, trying to see what's happening\n\nCUT TO: INT.  MESS HALL - CONTINUOUS\n\nWhen the smoke clears, There are two guards still standing.  They point \ntheir weapons inneffectually.  St Just a has gun to wren's head and a \ngun on the guards, who are also covered by Johner.\n\nELGYN\n\nNice and easy, boys ...\n\nCall starts to take off.\n\nCALL\n\nI'm gonna finish this.\n\nElgyn grabs her by the hair, roughly pulls her back.\n\nELGYN\n\nYou're going nowhere, Annalee.\n\nCUT TO: INT. OBSERVATION LAB - CONTINUOUS\n\nANGLE: IN THE PEN\n\nThe three aliens have picked up the energy. are stalking back and forth \nlike tigers in the dim light of their pen.\n\nANGLE: THEIR POV\n\nWe see Gediman and the guard, their backs to us. The aliens-stop \npacing.  One of them,  to the right, looks at the one on the left.  \nSomething passes between them. They look back at the humans.  At each \nother.\n\nThey SET ON the middle alien, TEARING IT APART.  It lets out piercing, \ninsectile SHRIEKS as they tear it limb from limb.\n\nGediman spins in terror, the guard bringing up his weapon. Gediman hits \nthe lights inside the pen and as they blink to shocking brightness we \nsee:\n\nThe remains of the third alien on the ground as a giant pool its blood \nEATS A HOLE IN THE FLOOR.\n\nGEDIMAN\n\nOh, God\n\nHe bolts for the failsafe but it's too late as the blood eats all the \nway through  - the two aliens DIVE through the hole. just as Gediman \nhits the button -- freezing gas  fills the chamber but there's nothing \nto freeze.\n\nGEDIMAN\n\nNo no no!\n\nHe hits another sequence and the door slides open.  He rushes in, \nkneels by the hole and looks down.\n\nANGLE: HIS POV\n\nTheir blood has already eaten through two levels.\n\nGEDIMAN\n\nChrist.  They could be anywhere.\n\nHe looks up at the guard -- and an alien FLIES UP at him through the \nhole.  \n\nIt was hanging on the ceiling below and it pulls him through before he \ncan breathe a decent scream.\n\nThe guard just stares, shaking.\n\nCUT TO: INT.  MESS HALL\n\nThe mexican standoff is getting even more heated.\n\nCHRISTIE\n\nWho gives a shit!  We have to get out of here.\n\nELGYN\n\nIf Call's got something going here I want to know what it is!\n\nWREN\n\nYou brought her here..\n\nTwo more guards rush in.  Johner shoves' his gun in Wren's mouth.\n\nJOHNER\n\nDrop them!  I'm not fucking with you!\n\nCHRISTIE (indicating the dead soldiers)\n\nBoss, we got bodies here.  It doesn't matter what Call's up to, we're \nall fucked now.\n\nCALL\n\nI have to stop him.  If I don't we'll all die.\n\nWREN (pulls his mouth away)\n\nElgyn, tell me what you know. If she's alone in this.\n\nHILLARD\n\nIn what?\n\nJohner puts his gun to Call's temple now.\n\nJOHNER\n\nDoes anyone want me to make this simple?\n\nFar away, a SCREAM. Everyone stops.  Wren turns slowly in the direction \nit came from.\n\nWREN\n\nNo...\n\nCUT TO: INT.  HALLWAY BY LABS\n\nA technican RUNS screaming just as an alien LEAPS on him from behind.  \nThe CAMERA  RUSHES AWAY, frenzied as the scene, to pick up a guard in \nthe next hall firing wildly at the ceiling as an alien dissappears up \nan airvent.  There are three bodies lying dead before us.\n\nANGLE: IN THE PENS\n\nWe see that the aliens have been freed.  Smoke, dead bodies, the \nplexiglass partition to one 1 cage is cracked and open.\n\nCUT TO: INT.  RIPLEY'S CELL - CONTINUOUS\n\nRipley sits in the dark, the noise of Chaos just beginning filter in.  \nAnd she just can't help herself.\n\nShe is LAUGHING.\n\nCUT TO: INT.  PEREZ'S QUARTERS CONTINUOUS\n\nHe is mostly dressed, still shaking off sleep.  He stands at the \ncommand console, bringing up visual.  Everything on the screens is \nsmoke and noise.\n\nPEREZ\n\nEnsign! Damage Report! Ensign!\n\nNothing.  On one of the screens, an alien is briefly visible. Perez \nstiffens at the sight of it.\n\nHe punches up a different sector. The labs, and here is a badly wounded \nlieutenant.\n\nPEREZ\n\nStatus!\n\nLIEUTENANT\n\nContainment is impossible, sir... I think they swept the barracks.\n\nPEREZ (to himself)\n\nA military strike.... Christ Jesus ...\n\nAfter a beat, he starts punching in the emergency override codes.\n\nCUT TO: INT.  BARRACKS - CONTINUOUS\n\nIt's worst here -- the aliens have taken out a dozen men in their \nsleep, and everyone awake is screaming.  One soldier runs for the \nweapons cabinet -- an alien hits him from behind and SMASHES him into \nit, falling in a tumble of guns.\n\nOver the chaos, the emergency lighting comes on, floor light like an \nairplane's indicating the nearest exit.  Father's voice is \nexcruciatingly calm:\n\nFATHER\n\nEmergency. Initiate evacuation procedures immediately. All hands. This \nis not a drill.\n\nOne soldier gets a bead on an alien with his burner - fries italong \nwith two of his friends.\n\nThey're out of commission, but the alien is hurt only momentarily.  It \nbounds forward, takes out his face.\n\nFATHER\n\nEmergency.  Initiate evacuation procedures ...\n\nCUT TO..\n\nINT. HALLWAY BY ENGINE ROOM - CONTINUOUS\n\nThe noise is too far above to be heard down here, but Fathers droning \nvoice and the emergency lighting are on.\n\nVriess wheels slowly into the hall, concerned.  He spins slowly, \nchecking out his surroundings.\n\nANGLE: DOWN THE HALL\n\nThere is nothing.. Just the floor lights pulsing in succession towards \nthe exit.\n\nVriess follows their lead, wheeling out.\n\nCUT TO: INT.  NEXT HALL - CONTINUOUS\n\nNothing here either. But Vriess's fur is up -- he moves slowly, \ncarefully.\n\nAnd was that a noise?  He looks around, up at the ceiling.\n\nA drop of alien blood is eating through right above him.  It drips down \n-- and he rolls out of the way just in time, back up as the blood plops \nto the floor, eating casually through.\n\nCUT TO: INT.  LIFEBOAT BAY ONE - CONTINUOUS\n\nMen are rushing into one of the lifeboats.  They sit facing each other \nin the tiny vessel  and strap themselves in.  Pere is here, hurrying \nthe soldiers in, pushing back the few who try to crowd in after.\n\nPEREZ\n\nBay three!  Go!\n\nThe late soldiers make for the next boat as Perez seals the hatch.  He \nhits the eject button and steps back.\n\nCUT TO: EXT.  THE AURIGA - CONTINUOUS\n\nAs the lifeboat FIRES out of the side of the giant craft.\n\nCUT TO: INT.  BAY THREE - CONTINUOUS\n\nMen crowd into this one too -- it's nearly full and an alien suddenly \nLEAPS into it.. starts feeding on the men strapped down - they are \nscreaming.\n\nPerez runs in as a soldier outside the lifeboat fires his burner, \nhitting the alien, the men, the controls -- a shower of sparks as the \nalien-turns, about to spring on the soldier as he rolls in a grenade. \nThe doors shut and and a soldier hits the eject button.\n\nTO: EXT.  AURIGA - CONTINUOUS\n\nThe second lifeboat comes shooting out and moments later.  EXPLODES.\n\nCUT TO: INT.  MESS HALL - CONTINUOUS\n\nThe noise of the explosion - and of a few inside as well - is all \naround the group.\n\nFather's voice still urges evacuaticion\n\nWREN\n\nNO!\n\n(to Call)\n\nWhat have you done?\n\nCALL\n\nNothing.  Not a goddanm thing. You thought you could control it.\n\nELGYN\n\nAll right. We make for the Betty. Can he walk?\n\nHe is pointing at Rane, who nods, standing.\n\nHILLARD  Betty's all the way across the ship! Who knows what's in \nbetween?\n\nCALL (indicating Wren)\n\nHe does.\n\nOne of the soldiers steps forward.  DiStephano.\n\nDISTEPHANO (to Wren)\n\nSir, we have to go.\n\n(to Elgyn) Let him go.  No quarrel.\n\nELGYN\n\nYou can have him when we're off. Not before.\n\nThey start out, dragging Wren along.  Guns still on Call and the \nsoldiers.\n\nWhat about Vriess?\n\nJOHNER\n\nFuck Vriess!\n\nCUT TO INT.  FALL - CONTINUOUS\n\nVries enters, looking around.  He is getting seriously wigged.\n\nThe lights on the floor still pulse. Urging him forward.  He obeys.\n\nSomething stirs in the rafters.  Coiled about the pipes.\n\nVriess stops, still a good thirty feet from the beast.  Strains to see.\n\nIt starts MOVING, climbing at him upside down on the pipes.  FAST.\n\nVriess starts wheeling himself back away but SLOWLY, agonizingly slowly \ncompared to the beast.\n\nHe turns the corner, spins around.\n\nThe hall is fifty feet long.  At the far end a few soldiers running \nthrough.\n\nSERGEANT\n\nSeal off that sector!\n\nA soldier runs to obey, working the door controls.\n\nVRIESS\n\nNo!\n\nThe soldier sees him, but the fear on the boy's face telegraphs his-\ndecision.\n\nVreiess starts pumping toward the door.  He's strong, picking up speed, \nbut the alien rounds the corner and bolts after him.\n\nVriess can't even look back as the thing gains on him.  The door begins \nto come down, the soldier finishing the sequence and running off.\n\nVriess rolls, face set -- the alien a few feet behind, reaching for him\n\nAn EXPLOSION far away ROCKS THE SHIP -- the hall tilted momentarily, \nVriess gets a  boost as he rockets downhill, the beast still on him, \nthe door closing, too low for him to clear. He gets there and SLAMS a \nlever, his chair FLATTENS out to a dolly  position, his head just \nCLEARS the closing door as the alien SLAMS into it, Vriess spinning out \nand flying off the chair it tilts, landing in a heap next to him.\n\nLying still on the ground, he listens as the beast slams against the \ndoor a few more times, then fades off.\n\nVRIESS\n\nFuck everything....\n\nHe reaches up for the chair and from the back of it he pulls out a \nshotgun.\n\nCUT TO: INT.  LIFEBOAT BAY 5 - CONTINUOUS\n\nPerez is trying to maintain order. He is failing. Grabs a corporal.\n\nPEREZ\n\nMuster a squad to search for survivors!\n\nCORPORAL\n\nFuck no! Fuck no! Fuck you!\n\nPerez slams him to the ground with his fist.\n\nAn ALIEN LEAPS OUT at him from the ceiling. The soldiers scatter, Perez \njust leaping out of the way --\n\nPEREZ\n\nShoot it! Fry it!\n\nA couple of men fire their burners, to little effect.\n\nOne soldier runs up to the action. His head is bloodied, his expression \nvengefully grim.\n\nThe soldier whips out a pistol, private.issue, he takes a bead on the \nthing --\n\nPEREZ\n\nNO!\n\nAnd the soldier FIRES -- pumps three bullets into the beast sends it \nflying back toward the window.\n\nPerez is riveted by the sight of: ANGLE: DROPS OF BLOOD\n\nbig ones, hitting the window. Everything seems to move slowly now - the \nalien,  struggling as the soldier pumps two more bullets into it, the \nother soldiers, Perez -- the monster falls and the BLOOD EATS THROUGH \nTHE WINDOW..\n\nPEREZ\n\nGet out!  Everyone!  Now!\n\nSoldiers are beginning to get it.. The window CRACKS, begins to SHAKE \nas the blood is almost through it.\n\nEven the soldier who shot the alien has stopped, his face frozen in \nhorror at what he's about to accomplish.\n\nPerez shoves him, herds the rest out, looking back --\n\nPEREZ\n\nClear the sector!\n\nat the window, the blood is almost through --\n\nMen are pouring out of the hall -- some move down a side hall and SLAM \nthe door shut  behind them, but most are making for the main exit \nanyway.\n\nFATHER\n\nWarning.  Potential hullbreach.  Clear sector.\n\nThe blood eats a hole in the window -- the nearest soldier is sucked \nback against the  window -- he SCREAMS as he is sucked through a hole \nno bigger than his fist.\n\nStill men are falling over each other, Perez herding them out. \n\nA huge CRACKING sound, and Perez shuts his eyes.\n\nThe window explodes outward, the air blowing everything int space. \nDebris, vehicles, men, all tangled and dead as they blown out into the \nblack.\n\nANGLE: THE SECTOR DOORS\n\nSLAM shut instantly one cutting right through a soldier halfway out.\n\nANGLE: AIR VENTS\n\nGates slam down here as well.\n\nANGLE: ELECTRICAL DUCTS\n\nFoam SHOOTS into them, hardening instantly, sealing the breached \nsector.\n\nFATHER\n\nBreach contained. Sector five nonfunctional.\n\nCUT TO: INT. HALL - CONTINUOUS\n\nAs the crew moves quickly through.  They come to a shut door, red \nlights along it indicating it's locked.\n\nELGYN (to DiStephano)\n\nOpen it.\n\nDISTEPHMO\n\nI can't.\n\nJohner puts his gun to the soldier's head.\n\nWREN\n\nHe can't!  The sector's closed.  The hull's been breached!\n\nELGYN\n\nOkay, which way?\n\nWREN\n\nWe'll have to go through the holding cells.  Here.\n\nELGYN\n\nAll right.\n\nThey turn left, entering\n\nINT.  CHAMBER - CONTINUOUS\n\nthat leads to the holding cells.  The room is big, a railing at one end \nlooking over another chamber two flights down.\n\nA shut door separates the chamber from the cells.\n\nELGYN\n\nCan you get that one open?\n\nIt comes from the rafters, dropping down on Elgyn in a heartbeat.  He \nbarely has time to scream before it shoots its tongue through the back \nof his skull.\n\nHillard has time.  She SCREAMS as her lover's brains come out his \nmouth.\n\nThe beast leaps at the group, scattering them like bowling pins as it \nclaws into one of the guards. Everybody else is scrambling for cover.\n\nSt Just tries to escape by running past the beast - its tail lashes \nout, tangling his feet and tripping him up, his head smashing against a \npipe.\n\nAnother guard hits it with the burner -- it shrieks and lands on him. \nJohner shoots at it but is far too panicked to hit it.\n\nCall has backed to the far wall -- she desperately works the controls \nto open the door.\n\nIt starts to rise.\n\nCALL\n\nChristie!  Hillard!  Come on!\n\nThe door rises fully.  Ripley stands behind it.\n\nCall starts back, not sure what the woman will do.\n\nRipley surveys the scene.\n\nThe Alien, burrowing its head into the belly of the guard, stops.  \nLooks up.\n\nEveryone watches as the two creatures sense each other.  ThE alien \nhisses. rears back.\n\nRipley looks away, contemplative We see a gamut of emotions cross her \nface, but her posture passive, sacrificial.  She does not move.\n\nEveryone watches, too afraid to breathe.\n\nThe alien LUNGES at her, leaping across the room in two bounds. It's on \nher -- and she SPINS, GPABBING IT, and HURLS IT AWAY.\n\nIt lands in a tangle but is up again in a microsecond, jumps at her, \nknocks her back into the room, on her, its claws digging into her skin, \npiston tongue at her face, inches away. \n\nShe locks an arm around its slick, long head and pulls back we hear its \ntendons strain, snap.\n\nCALL (to a guard)\n\nShoot it!  Shoot them both!\n\nShe grabs his gun and BURNS them both.  Two less-than-human SCREAMS \nfill the room as they briefly disentangle, thrown apart.\n\nThe beast recovers first, dodging the next blast and going for Ripley \nagain.\n\nRipley, on her back, reaches behind her, grabs a table leg and with \ninhuman strength brings the table down on the monster's head.\n\nShe dives at it as it comes out from under....\n\nCall shoots as Ripley hits the alien, they're both fried as Ripley's \nmomentum sends them over a railing and they FALL TWENTY FEET -- the \nAlien lands with a spine snapping crunch,\n\nRipley only slightly better.\n\nA few crew members rush to look over the railing.  Christie starts down \nthe spiral staircase to that level.\n\nJOHNER\n\nWhere are you going?\n\nThe creature rolls back onto Ripley, grabbing her with its dying \nstrength. Her face is rigid with pain and anger as she holds it off... \nits jaws open, dripping shaking...\n\nThe tongue SHOOTS OUT and Ripley GRABS IT. HOLDS IT.\n\nA scream wells up in her throat.  A totally animal killshriek that she \nSCREAMS, victorious, as she RIPS THE ALIEN'S TONGUE OUT OF ITS FACE.\n\nShe stands, bellows another warrior cry. The crew has gathered near.  \nThey watch her, awed, wary. Ripley walks slowly up to them -- up to \nCall.  Ripley looks a tad pissed.\n\nCall tenses, maybe wishing she hadn't shot Ripley as well.\n\nRipley takes Call's hand, puts the tongue in it. walks on.\n\nCall looks at the dripping souvenier.  The pincers at the end still \ntwitching.\n\nCHRISTIE\n\nWhat the FUCK is going on here?\n\nRANE\n\nWhat was that thing?  Are there more of that thing?\n\nJOHNER (to Call)\n\nMake a hell of a necklace...\n\nANGLE: HILLARD\n\non the upper level, kneeling by Elgyn's body.  No tears, but terribly \nquiet.\n\nWhat do we do?\n\nCHRISTIE\n\nSame thing we were doing.  We get the fuck.\n\nRANE\n\nWhat if there's more?  Let's stay here and let the army guys deal.  \nSomeone will come... I mean, where are the fucking army guys?\n\nSt Just is very calmly looking up at the rafters, guns drawn\n\nCHRISTIE\n\nDoctor.  You know what that thing is?\n\nWREN\n\nI do.\n\nCHRISTIE\n\nAnd there's others.  How many?\n\nThe doctor looks around, almost guiltily.\n\nWREN\n\nThirty.\n\nJOHNER\n\nThirty!  We are fucked in our pink bottoms if there's thirty of those \nthings.\n\nRIPLEY\n\nThere'll be more.\n\nEveryone looks around at her.  She is squatting in the corner facing \naway from them.\n\nRIPLEY\n\nThey'll breed.  In a few hours there'll be twice that number.\n\n(she stands, approaches them)\n\nSo who do I have to fuck to get off this boat?\n\nCHRISTIE\n\nYou bought your ticket when you killed that thing. welcome aboard.\n\nCALL.\n\nAre you fucking crazy? She doesn't care if we....\n\nCHRISTIE (fiercely)\n\nYou got no authority here, Call!- Now secure it!\n\nIt's the first time Christie has raised his voice, and it has the \ndesired effect.\n\nAfter a silent moment, Call starts again softly.\n\nCALL\n\nChristie, she's not human.  Wren cloned her because she was carrying an \nalien in her.\n\nShe could turn --\n\nJOHNER\n\nNobody cares about your opinion, you bitch, you fucking mole --\n\nCALL\n\nShe'll turn on us!  Just like that!\n\nCHRISTIE\n\nI don't give a syphallitic fuck whether you people can get along or \nnot. If we've got a wish to live then we work together, and that \nincludes bug-lady.\n\nCALL\n\nYou can't trust her.\n\nCHRISTIE\n\nI don't trust anyone.  CUT TO: INT.  CHAMBER/CELLBLOCK - A BIT LATER\n\nThe group is still in the adjoining chamber, but looking here into the \ncellblock where \n\nRipley had been.  DiStephano and St Just come first, guns ready, \nlooking about them.\n\nThey are followed by Christie and Wren.\n\nWREN\n\nThere's a console in the guards, station.  We can punch up a diagnostic \nof the ship and plan a route.  To your ship.\n\nCHRISTIE\n\nThat likes me fine.\n\nHe signals for the others to follow, everyone moving cautiously.\n\nANGLE: HILLARD\n\nGently lays her coat over Elgyn's face. Johner looks down a moment.\n\nJOHNER\n\nVia con Dios, man.\n\nHillard stands. Call puts ahand on her shoulder but Hillard moves away, \na distrustful look on her face.\n\nRipley, bringing up the rear, watches the whole group with a sort of \nfascinated detatchment.\n\nCall looks back at her.  Ripley smiles, coldly.\n\nANGLE: IN THE CELLBLOCK\n\nThe group makes their way slowly, quietly.  They approach a bank of \nelevators, but Wren points down an adjoining doorway.  They are about \nto go there when the elevator door lights up, indicating arrival.\n\nThe group backs up, spreads out. Those who can find cover take it. guns \ndrawn.\n\nThe elevator doors open.  It is too dark inside to see:\n\nSuddenly sparks fly from the broken overhead in the elevator and a \nfigure appears in the light.\n\nEveryone jolts, about to fire. before they realize it is\n\nVRIESS\n\nWho sits in his chair, a shotgun in each hand, eyes wide. twitchier \nthan they.\n\nJOHNER\n\nOh, fuck...\n\nCALL\n\nvriess!\n\nVRIESS (mock casual)\n\nHey, whatchyou guys doing?  Hey, Annalee.\n\nCHRISTIE\n\nThought you were toast for certain.\n\nVRIESS\n\nYou've seen that fucking thing?\n\nWREN (suspiciously)\n\nWhere were you?\n\nVRIESS\n\nI was down by -- what do you mean? I was in maintenance, checking out \nyour oxidation systems.\n\nJOHNER\n\nDoc's got a bug up his ass 'cause Call's a mole and he thinks we're a \nconspiracy.\n\nVRIESS (looking at Call)\n\nShe's a what?\n\nJOHNER\n\nA mole.  A fucking spy.\n\nVriess looks hit harder by that information than anyone.\n\nCHRISTIE\n\nWe got'a mission here, people.  Let's keep moving.\n\nThey do.\n\nCUT TO: INT.  GUARDS, STATION - MOMENTS LATER\n\nANGLE: THE CONSOLE\n\nA hologram of the ship appears above the screen.  It looks a solid as \nthe ship itself, except that parts of it occasional break themselves \ndown to show interiors.\n\nThe group looks it over. Parts of the ship are simply not there, the \nsections around those holes red.  Wren points them out.\n\nWREN\n\nWe've had hull breach by the lifeboats, here on level five, and down -- \nJesus, right by the engine room.  We're very lucky.\n\nST JUST (sarcastically)\n\nLucky we.\n\nCHRISTIE\n\nWhat about the Betty?  Our ship.\n\nWREN\n\nThe dock seems to be intact.\n\nCHRISTIE\n\nThen we head for it.\n\nJOHNER\n\nCan we track those fucking things?\n\nWREN\n\nNo.\n\nJOHNER\n\nWe could get to the Betty and they could be all over it!\n\nRANE\n\nAre you toting a better fucking idea?\n\nWREN\n\nAll of the activity seems'to have been in the aft-sector, by the \nbarracks.\n\nThere's no reason to suppose they'd move\n\nRIPLEY\n\nThey won't.\n\nEverybody looks at her.\n\nRIPLEY\n\nThey're breeding. They've got new bodies to work on. They'll stay \nclose. If they send anybody out, it'll be here. Where the... meat is.\n\nCALL\n\n'The meat' . Jesus.\n\nST JUST\n\nThey're breeding.  How long does that take?\n\nRIPLEY\n\nHours.\n\nWREN\n\nOr less.  The process has accelerated, something to do with the cloned \ncells.\n\nCHRISTIE\n\nFaster we get from here to there, the better.\n\nST JUST\n\nWith all the devils of hell in between.\n\nJOHNER\n\nWell, if we want to make decent time I say we ditch the cripple.\n\n(to Vriess)\n\nNo offense.\n\nVRIESS (giving him the finger)\n\nNone taken.\n\nHILLARD\n\nNobody's left behind, Johner. Not even you.\n\nHer voice is quiet, mourning still thick in it.  Nobody backtalks her.\n\nCHRISTIE\n\nSo what's our route?\n\nWREN\n\nI'm trying to figure it. we can cut through the labs, but we're blocked \non both sides here,\n\nI'm not sure\n\nDISTEPHMO\n\nSir?  There is the lift.\n\nWREN\n\nShow me.\n\nDiStephano works the console and the hologram splits, the route he's \nindicating revealed.\n\nDISTEPHMO\n\nThe lifts. They run straight from the top of the ship down to \nengineering. No stops, but  if we can get in the shaft, there's a \nmaintenece access tunnel here\n\n(points to the center of the shaft)\n\nthat runs above level one deck. Take us right to the dock.\n\nCHRISTIE\n\nSounds reasonable.\n\nDISTEPHANO\n\nI don't have the code for the access tunnel door.\n\nWREN\n\nI can override.\n\nDISTEPHMO\n\n(indicating the route)\n\nThen we head through the labs, then down to the kitchen.  To the bottom \nof the shaft.\n\nUp, through the tunnel, and onto the ship.  Home free.\n\nANGLE: VRIESS\n\nIs unloading additional ammo from inside his chair.  He toss one of his \nshotguns to Hillard.\n\nVRIESS\n\nThey never check the chair...\n\nHe pulls out a grenade launcher.  It's so compact it's almost cute, \ncradled one handed like an uzi.\n\nVRIESS\n\nCall.\n\nShe looks around and he tosses it to her.  The gesture is not \nacconmpanied by any show of warmth.\n\nVRIESS\n\nTry not to shoot your foot off.\n\nWREN\n\nYou people should know --\n\nST JUST\n\nWe.won't shoot at the windows, Doc.\n\nWREN\n\nNo. The aliens, they bleed molecular acid.\n\nCHRISTIE\n\nThat's right, I saw that.\n\nVRIESS\n\nSo did I.\n\nJOHNER\n\nWe can't shoot them?  Fuck that, I'm shooting them.\n\nWREN\n\nThis is a big vessel, and for the most part we should be okay. But if \nwe get anywhere near the outer hull and start strafing them...\n\nHe indicates the hologram, the sections of the ship missing.  Everyone \ngets it.\n\nCHISTIE\n\nIf we're clear then let's get on it. We'll go by twos --\n\nRIPLEY\n\nWe're moving.\n\nCHRISTIE\n\nWhat?\n\nRIPLEY\n\nThe ship is moving. 1 can feel it.\n\nRANE\n\nI don't feel shit -- what, do you mean they're piloting this fucking \nthing?\n\nVRIESS\n\nThis ship has stealthrun, even if we were moving there's no way she \ncould feel it.\n\nCALL  She's right.\n\nCall is working the computer now.\n\nCALL\n\nThe ship's been going since the attack.\n\nWREN\n\nIt's uh, it's standard, I think.\n\nDISTEPHANO\n\nThat's right. If the ship takes on any serious damage it autopilots \nback to homebase.\n\nCALL (to Wren, pissed)\n\nYou were planning to let us know this?\n\nWREN\n\nI forgot.\n\nHILLARD\n\nWhat is homebase?\n\nWREN\n\nEarth.\n\nCALL\n\nOh, God.  Oh, you bastard...\n\nJOHNER\n\nEarth?  I'm not going to that fucking slum.\n\nCALL\n\nIf those things get to Earth, It'll be...\n\nRIPLEY (not very concerned).\n\nThe end.\n\nST JUST\n\nThat's not our problem.\n\nCALL\n\nWe've got to blow the ship.\n\nCHRISTIE\n\nWe don't have to do anything till we get off it.  How long till we get \nthere?\n\nCALL\n\nThree hours.  Almost.\n\nCHRISTIE\n\nThen that's what we got.  Let's move.\n\nCALL\n\nDon't you understand what this means?\n\nCHRISTIE\n\nI understand my hide.  And I like it on me. Let's go.\n\n(to Ripley)\n\nWhat are you called, Ripley?  You mind taking point?\n\nShe moves to the head of the line, and they start.\n\nCUT TO: INT.  LABS - LATER\n\nAs they progress.  Everyone with a gun has it at the ready.  Ripley is \na few yards in front.\n\nShe stops, sniffs.  Listens.\n\nRIPLEY\n\nClear.\n\nJohner moves up next to her.\n\nJOHNER\n\nYou've come up against these things before?\n\nRIPLEY\n\nYes.\n\nJOHNER\n\nSo what did you do ?\n\nRIPLEY\n\nI died.\n\nHe lags behind a bit, thrown.\n\nJOHNER\n\nThat wasn't really what I wanted to hear...\n\nDiStephano points to a door.\n\nDISTEPFANO\n\nThis way.\n\nAnd Ripley leads them in.\n\nCUT TO: INT.  LAB - CONTINUOUS\n\nAs Ripley enters, we can see that this lab has been trashed.  Ripley \nsurveys the wreckage calmly, keeps moving. As the others file in, their \nhorrified expressions lend contrast to her lack of one.\n\nAmong the debris are three bodies, chests exploded outward.\n\nJOHNER\n\nFuck me ...\n\nCHRISTIE\n\nLet's keep moving.\n\nThe door to the next chamber is ajar. Christie and Vriess in, then St \nJust, then Ripley.\n\nINT..NEXT CHAMBER\n\nSomething LEAPS at Ripley from out of the shadows -- a metal bar SLAMS \ninto her side, throwing her off balance.\n\nSt Just and Christie spin, weapons up, and almost shoot the figure \ncowering in the corner.\n\nEveryone else rushes in as he swings the bar before him, eyes wild with \nterror.\n\nPURVIS\n\nGet away from me!\n\nCHRISTIE\n\nDrop the rod, man.  Do it!\n\nPURVIS.\n\nGet away...\n\nBut the energy is out of him.  The rod falls with a hollow clatter. He \nlooks weakly from face to face.\n\nPURVIS\n\nWhat's going on?\n\nSt Just looks at his name, stitched in his coveralls.\n\nST JUST\n\nPurvis.  What's going on is that we're getting the fuck off this ghost \nship.\n\nPURVIS\n\nWhat ship?  Where am I? 1 was in cryo on the way to Xarem, work crew \nfor the nickel refinery...\n\nI wake up, I don't understand... I saw something... horrible ...\n\nCALL\n\nLook, you come with us.  It's dangerous here.\n\nRipley SNIFFS.  Cocks her head.\n\nRIPLEY\n\nLeave him.\n\nCALL\n\nFuck you.  We're not leaving anyone on this boat.\n\nRIPLEY\n\nHe's carrying..\n\nJOHNER\n\nHe's what?\n\nRIPLEY\n\nHe's got one....\tinside him. I can smell it.\n\nPURVIS\n\nInside me? What?\n\nJOHNER\n\nShit, I don't want one of those things birthing anywhere near my ass.\n\nVRIESS\n\nIt's a bad risk.\n\nCALL\n\nWe can't just leave him.\n\nVRIESS\n\nI thought you came here to stop them from spreading.\n\nCALL (to Wren, torn)\n\nIsn't there a process, can't you stop it?\n\nST JUST\n\nWe've got no time for that.\n\nWREN\n\nI couldn't do it here. The lab's torn apart.\n\nST JUST (quietly)\n\nI could do him. Painless, back of the head. Might be the best way.\n\nCALL\n\nThere's gotta be another way. If we freeze him --\n\nPURVIS\n\nWHAT'S IN-FUCKING-SIDE ME?!?!?\n\nThey all look at him, a bit sheepishly.\n\nWREN\n\nA parasite.  A foreign element that ....\n\nRipley steps in front of the doctor.\n\nRIPLEY\n\nThere's a monster in your stomach. They (indicating the smugglers) \nhijacked your cryotube and sold you to him (indicatingWren) and he put \nan alien in you. In a few hours it will punch  its way through your \nchest and you'll die.  Any questions?\n\nPurvis is wide-eyed, stunned.  After a moment he stammers\n\nPURVIS\n\nWho are you?\n\nRIPLEY\n\nI'm the monster's mother.\n\nShe starts heading out of the chamber.  Call turns to the others.\n\nCALL\n\nHe comes with us.  We can freeze him on the Betty and get the doctor to \nremove it later.\n\nWREN\n\nAll right.\n\nJOHNER\n\nSince when are you in fucking charge?\n\nCALL\n\nSince you were born without balls.\n\nVRIESS\n\nEase off, people.\n\nCHRISTIE (to Purvis, herding him along)\n\nCome with us.  You might even live.  Get twitchy on me and you will be \nshot.\n\nThey move out.\n\nCUT-TO: INT.  HALL - LATER\n\nstill in the same general area, still looking around every corner.  \nIt's been too quiet too long, and the group senses that & They move \ninto\n\nINT.  OBSERVATION ROOM TWO - CONTINUOUS\n\nIt's in bad shape, so we might not recognize it as the chamber the \nqueen was in.\n\nWREN\n\nShe's gone.\n\nST JUST\n\nWho?\n\nWREN\n\nThe Queen.\n\nJOHNER\n\nGood.\n\nHe is loooking into the room.the queen was kept in.  A residue of slime \nis all that's left here.\n\nBeyond the queen's chamber is another observation room.  Wren indicates \nthat they have to go through.\n\nSuddenly a burner blast FIRES at them, just missing them as they duck.\n\nThey hear more blasts, not aimed at them, and screams.\n\nSOLDIER (O.S.)\n\nPull back!   Pull back!\n\nOTHER SOLDIER (O.S.)\n\nIt's on me!\n\nRipley looks up and can just see two aliens making short work of a \ngroup of soldiers.\n\nCall instantly moves to attack, and Ripley grabs her, holds tight.\n\nCALL\n\nWe've got to help them!\n\nRIPLEY\n\nCan't.\n\nCALL\n\nYou bitch, let go of me!\n\nShe does, and Call rises.\n\nThe noise is gone. What she can see of the soldiers-is parts.\n\nShe is shaking at the vision when an alien RISES in front on the \nsoldiers.  Call ducks back down, terrified.\n\nChristie hisses at her.\n\nCHRISTIE\n\nYou want to get yourself killed, then you run solo.\n\nST JUST\n\nHow many?\n\nRIPLEY\n\nAt least two.\n\nST JUST\n\nThink they heard us?\n\nRIPLEY\n\nYep.\n\nHILLARD\n\nFine by me ...\n\nJOHNER\n\nYeah, let 'em come.\n\nCHRISTIE\n\nWren.  Any other way around?\n\nWren shakes his head.\n\nCHRISTIE\n\nWe can't just walk in there.\n\nWREN (thinking)\n\nNo. No, but they can.\n\nCHRISTIE\n\nSay again?\n\nWREN\n\nThe cages all have failsafes.  Liquid nitrogen.  Get 'em to come to us \nand I can freeze em.\n\nCHRISTIE\n\nExcellent.   Get-ready.\n\nWren goes over to the failsafe button. The others look out at the \naliens.\n\nCHRISTIE\n\nOkay... (calls out) Hey!\n\nVRIESS\n\nHey, guys!\n\nJOHNER\n\nHere, kitty...\n\nThe aliens react, start for the cage.  Four 'of them.  They reach the \nedge of it and stop.\n\nLook around, at each other..\n\nBut go nowhere.\n\nDISTEPHMO\n\nThey're not coming.\n\nJOHNER\n\nHey!  Fresh meat here!\n\nRIPLEY.\n\nThey know it's a trap.\n\nRANE\n\nOh, bullshit!\n\nCHRISTIE\n\nWhat do we do?\n\nJOHNER\n\nShoot the fucking things!\n\nVRIESS\n\nThere's too many, and we don't have the angle.\n\nRIPLEY\n\nBait.\n\nCALL\n\nWhat?\n\nRIPLEY\n\nGive em a reason to go in there. Throw somebody in.\n\nHILLARD\n\nFuck you!\n\nRIPLEY\n\nDO we want to live? Give em her.\n\nShe indicates Call, who looks around, nervous at the lack of protest \nabout this idea.\n\nRipley points at Rane.\n\nRIPLEY\n\nOr the skinny one, it doesn't matter. We can't resist the smell of \nmeat.\n\nCALL\n\nWe ?\n\nJOHNER \n\nFuck, I'm with her!  Give 'em Annalee!\n\nCHRISTIE\n\nNow hold on\n\nDISTEPHMO\n\nYou people are insane.\n\nJOHNER\n\nNow you're not exactly in the club either, soldier.\n\nPeople start pointing guns at each other.\n\nRANE\n\nFuck you all, I'm not dying for you.\n\nCALL\n\nStop this.\n\nRipley grabs her.  Looks at the others.\n\nRIPLEY\n\nCome on!  Do you want to live or not?\n\n(to Call) It won't hurt long.\n\nCALL (terrified)\n\nNoo...\n\nRIPLEY (to Wren)\n\nNOW!\n\nWren hits the button just as three aliens are bounding across the cage \n-- they're almost to the posse, people screaming, scrambling, when the \nfreezing gas hits, turning the beasts to statues.\n\nThe forth one sees this and flees, but St Just stands and put four \nbullets in it from forty yards. It slumps over.\n\nEveryone is silent, stunned.  Breathing hard.\n\nVRIESS (realizes)\n\nFear.\n\nRipley nods.\n\nVRIESS\n\nThat's how they knew it was a trap.  They couldn't smell the fear.\n\nRIPLEY (looking at Call)\n\nSo I gave them some.\n\nJOHNER (gleefully)\n\nSon of a bitch!\n\nHe pops up and FIRES at the frozen aliens - - they EXPLODE into \nfragments.\n\nCUT TO: EXT.  AURIGA\n\nGildihg through space, passing Jupiter's moons with dazzling speed.\n\nCUT TO: INT.  HALL   LATER\n\nRipley and Call are on point.  Ripley looks down the hall.  Call is \nstaring at her, and\n\nRipley can feel the girls eyes on her back.\n\nRIPLEY(without looking around)\n\nDid you think I was going to... feed you to them?\n\nCALL\n\nI think you still might.\n\nRipley smiles.  She may be right.\n\nRIPLEY\n\nI want to live.\n\nCALL\n\nAnd you don't care about anything else.\n\nRIPLEY\n\nNo.\n\nCALL (bitterly)\n\nI guess you're more human than I thought.\n\nRIPLEY\n\nWhy did you come here?\n\nCALL\n\nTo kill you, remember? (after a beat) Because somebody has to.\n\nRIPLEY\n\nwell it's not me.  I did my time.  Now I just want to...\n\nShe stops dead, staring at a door.\n\nCLONING STORAGE FACILITY is written on it. Stencilled beneath that is \n`numbers 1-7`.\n\nRipley stares. Tries the door, which opens.\n\nDISTEPHMO\n\nThat's not the way.\n\nCHRISTIE\n\nRipley, we got no time for sightseeing.\n\nRipley is looking down at her arm, at the 8 tattooed on it.\n\nShe looks at Call.  Looks back at wren.\n\nWREN\n\nRipley... don't.\n\nShe enters.\n\nCUT TO: INT.  CLONING STORAGE FACILITY - CONTINUOUS\n\nShe stands a moment, staring, before proceeding through it.  Call \nstands in the doorway, others crowding behind her. Every face registers \nthe horror of what they are seeing, but none more so than Ripley's\n\nNumbers one through seven.  The first failed efforts to clone Ripley.\n\nThey are lined up like museum exhibits -- or side show freaks.\n\nHere is the fetal Ripley, the fetal alien visible through its \ntranslucent chest.\n\nIn a jar.\n\nHere is a prematurely old, diseased Ripley, withered blue skin cling to \nCollapsed bones.\n\nHere is an attempt to separate the alien and grow it without the host -\n- boneless, bubbling tissue, weak and useless mouth rigored in midmew.\n\nEach one more horrifying than the last, and the last the worst of all.\n\nRipley approaches, and stares at number seven.\n\nA complete mixture of alien and human DNA.\n\nA tortured, disgusting hybrid, half Ripley, half nightmare.\n\nHooked up wires and machines, it lies on the tilted-table, its head \nnearly level with\n\nRipley's as she finally approaches it.\n\nWhen it opens its eyes, they are hers.\n\nit tuns its head ever so slightly to look at her.  Recognises her.\n\nRipley cannot even speak.  She begins to shake slightly looking at \nnumber seven.\n\nNUMBER SEVEN\n\nKill ... us ...\n\nRipley's eyes go saucered as it speaks speaks out of nothing resembling \na mouth.\n\nRipley staggers back a step, shaking now.  This is too much to bear...\n\nCALL\n\nRipley!\n\nRipley turns, slowly, still in a fever dream.\n\nCall cocks the grenade launcher with a loud CRACK.  Her eyes meet \nRipley's.\n\nCall tosses it to Ripley as the crew steps back and even a catches it \nRipley FIRES, a grenade chugging to the end of room and BURSTING in \nfire and noise, she FIRES another, tissue and steel exploding into \nflame, she turns to number seven, hand shakes momentarily...And she \nFIRES, the poor creature dissolving in a cloud of flame.\n\nFreezing gas jets fill the room, extinguishing potential spread, but \nthe heart of the firestorm continues to rage in the chamber.\n\nShe backs out, the crew waiting for her outside.\n\nThe launcher falls loudly to the ground.  Ripley turns to Wren, her \nface rigid with pain.\n\nWren backs up a step, looking around him for protection that the others \nhave no thought of providing.\n\nCALL\n\nRipley... Don't do it.\n\nRipley stops. weariness suffusing her expression.\n\nRIPLEY\n\nDon't do what?\n\nThe tension pases.  Wren breathes a little sigh of relief.\n\nCall PUNCHES him across the jaw, his head whipping around as collapses \nto the ground.\n\nCall starts down the hall, not even looking at him.\n\nCALL\n\nDon't do that.\n\nFeeling his jaw, Wren actually smiles at the absurdity of all this.  \nIt's kind of winning.\n\nChristie helps him up.\n\nCHRISTIE\n\nHad it coming, Doc.\n\nJohner looks in at the burning lab.\n\nJOHNER\n\nWhat's the big deal?  Fucking waste of ammo.\n\nST JUST\n\nLet's move before anything comes to check out the noise.\n\nJOHNER\n\nChicks, man....\n\nDISTEPHANO\n\nWe go down from here.\n\nCHRISTIE (to Vriess)\n\nWe got to lose the chair.  Vriess.\n\nVRIESS\n\nI know.\n\nCHRISTIE\n\nKawlang maneuver, all right?\n\nVriess is pulling a coil of cords from the chair.\n\nVRIESS\n\nJust like old times...\n\nCUT TO: INT.  ROOM - LATER\n\nA hatch opens. Ripley drops down, surveys the scene.  Quiet dark, \nempty.\n\nRipley comes up, Call behind her.  Ripley sniffs, listens.  Closes her \neyes. After a beat she starts further in and Call motions for others to \nfollow.\n\nSlowly, they make their way down the corridor. Ripley, Cal ,Hillard , \nguns drawn.\n\nBringing up the rear is Christie, toting a shotgun.. He turn slowly, \nalert, and we see that Vriess is strapped to his back facing the other \nway, also with a shotgun.\n\nCALL (to Ripley)\n\nThat lab... 1 can't imagine how that must feel.\n\nRIPLEY\n\nNo. You can't.\n\nRipley looks down.  The floor here is covered with a foot or so of dark \nwater.\n\nRipley steps into it, moves up a few paces. The others gingerly follow.\n\nVriess is facing the back. He looks up.\n\nVRIESS\n\nThe cooling tanks.  They must have blown during the trouble.\n\nANGLE: THE COOLING TANKS\n\nWe see the round underbelly of two huge tanks.  There are gaping, \ntwisted holes in them.\n\nJOHNER\n\nThe nasties couldn't have done it, could they?\n\nHILLARD\n\nWhat for...?\n\nWREN\n\nDown here. He is at the front with Ripley and-Call, where the water is \nwaste deep.\n\nHe looks down at a stairwell, just the top of the railing visible above \nthe murky water.\n\nRIPLEY\n\nThere's no other way?\n\nWREN\n\nWe're at the bottom of the ship.  Some of the worst damage is down \nhere.\n\nMost of the sections are sealed off.\n\nRIPLEY\n\nYou're sure?\n\nWREN\n\nThere's the noncom's entrance back there, but it's flooded too, and \nit's a longer run.\n\nCALL\n\nHe's right.  We're gonna have to do it this way.\n\nWREN\n\nIt's just through the kitchen, then up, maybe seventy feet.\n\nRIPLEY\n\nI don't like it.\n\nST JUST\n\nWhat's to like?\n\nCHRISTIE (to vriess)\n\nYou ready to get wet, partner?\n\nVRIESS\n\nOh yeah.\n\nHILLARD\n\nYou sure about the distance?\n\nWREN\n\nYes.\n\nCALL\n\nNo locked doors?\n\nWREN\n\nIt's an open hall.  Just keep left when you hit the bottom of the \nstaircase.\n\nJOHNER\n\nThis sucks.\n\nANGLE: DI STEPHANO\n\nHe flips caps over the barrel of the gun, slides a panel over the \ndigital readout.\n\nThe burner is ready to go, watertight.\n\nDISTEPHMO (to St Just)\n\nYou should secure'your weapons.\n\nSt Just holds up his two guns.\n\nST JUST\n\nThese are disposables.  They can take it.\n\nDISTEPHANO\n\nDisposables. I heard about those. How many rounds?\n\nST JUST\n\nTwenty. Split points, give you a good hole even at the smaller caliber.\n\nDISTEPHANO\n\nCool.\n\nST JUST\n\nThey're big with hitters. 'Cause you throw em away after the job. \nNobody likes throwing  away a weapon they're attached to.  You know?\n\nHe smiles at Di Stephano, who looks a little uneasy about the turn the \nconversation has taken.\n\nHe joins the others who are getting ready to dive..\n\nCALL\n\nDo I have to tell everyone to take a deep breath?\n\nA couple of the guys smile.\n\nVRIESS\n\nChristie, do me a favor.  When we hit the surface on the other side... \nno backstroke.  Okay?\n\nCHRISTIE (laughing)\n\nYou'll be forever blowing bubbles. On three...\n\nHe counts down, the two suck in enormous breaths -- and dive right \nbehind Call and Ripley.\n\nOne by one the entire crew slips down into the black water.\n\nCUT TO:  INT.  STAIRWELL\\KITCHEN - CONTINUOUS\n\nIt's all underwater.  Visiblity is poor.  The crew move swiftly and \ngracefully down the stairs and into the kitchen.\n\nIn here it's a tad labyrinthian, and the size of the room it darker. \nWren heads straight for the other end.\n\nThey swim.  Safety is a good fifty feet away.\n\nThey are tense, concentrated.  Swimming past dark spaces.  Anything \ncould be hiding here.\n\nJohner looks about him, very nervous.  Dark spaces.  He looks behind.\n\nThree aliens are right behind him.\n\nPanic blows half the air out of his mouth as he swings around and FIRES \nat them, tags one as the other two swim off into shadows with horrible \nease.\n\nRipley, all the way to the stairs, sees.  She hurries the others past \nher.\n\nThey swim frantically for safety, Hillard Wren, Christie and Vriess.\n\nRane is coming along and alien hands grab at him from the darkness, \npull him into it.\n\nHillard FIRES in that direction, Johner bringing up the rear still \nfiring at the third one, wounding it but not scoring killshot.\n\nCall is swimming up ther staircase, the growing light above indicating \nthe surface.\n\nShe is almost to it when she is IN THE WEB.\n\nA net of translucent alien goo, it is spread just six inche below the \nsurface.\n\nCall struggles the goo sticking to her she's running out of air -- as \nWren and Christie enconter the same thing -- they all try to tear \nthrough it, but they are getting weaker.\n\nRipley looks back as the last of the crew is passing her, aliens close \nbehind.\n\nShe looks up to see the situation ab and quickly makes for the surface \n-- but an  alien GRABS her foot, holding her down. Now SHE is running \nout of air KICKS at it, it  lets go.\n\nThe others are fighting, Call pops her stilletto and cuts through, but \nit's tough, she  still can't get her head up --\n\n--Di Stephano, off to the side, is drowning.  Takes in a huge mouthful \nof water and begins thrashing.\n\nRipley swims past everyone and grabs the hole Call cut, pulls it apart \nwith a mighty heave, she glides up through --\n\nCLOSE UP: RIPLEY'S FACE\n\nJust BREAKS the surface, she takes in a huge GASP of air, FACEHUGGER \nCLAMPS DOWN ON HER.\n\nRipley goes back under, pulling at the thing as others break the \nsurface.\n\nWren comes up and a hugger LEAPS right at him ,but Call nails it in \nfour shots.\n\nChristie and Vriess break surface and both begin FIRING, back to back, \nin a circular sweep.\n\nThey decimate a number of eggs\n\nANGLE: UNDERWATER\n\nRipley pulls the face hugger with all her might -- it comes off, its \nfingers singeing the sides of her face, leaving marks like warpaint.  \nWorse, its probing fleshy member pulls last of her throat, thrashing \nhorribly.\n\nIn utmost disgust, Ripley PULLS it APART. and the three aliens are \nCOMING RIGHT AT HER.\n\nABOVE - THE SURFACE\n\nMost of the crew has gotten up out of the water.  Christie holding a \nfacehugger inches from his face, others screaming, taking a bead on it.\n\nCHRISTIE\n\nGet it!  Kill it!\n\nCALL\n\nThe blood'll burn you!  Throw it!\n\nHe does, and Johner nails it in midflight.\n\nHillard and Johner pull Di Stephano out of the water, but he is not \nbreathing.\n\nANGLE: UNDER THE SURFACE\n\nRipley is grabbed by an alien -- and St Just comes up behind her and \nshoots it.\n\nThey swim up and away from the spreading, lethal bloodpool.\n\nANGLE: ABOVE THE SURFACE\n\nThey come up out of the water, and an alien rises right behind them.  \nEveryone who can, shoots it.  It falls back into the water.\n\nCHRISTIE\n\nA trap!  They set a goddamn ambush!\n\nJOHNER\n\nGive me that!\n\nHe pulls the burner off Di Stephano's body, even as Call is giving him \nmouth to mouth.\n\nJohner flips the gun open and FIRES at the water, the whole thing \nSMOKING and sizzling with the electrical charge. we hear an alien wail \nbubble from below the surface.\n\nJOHNER (grinning feverishly)\n\nOkay!  Everybody out of the pool!\n\nVRIESS\n\nLet's get the fuck!\n\nDi Stephano sputters back to life.  Ripley picks him up with one hand,\n\nHILLARD (to Wren)\n\nWhich way?\n\nWREN\n\nUp here.\n\nHe takes off, the others following.\n\nWREN\n\nUp through the lift shaft!\n\nHe stops at a pair of sliding doors, starts working the panel.  Ripley \ncome up to the doors and pulls them apart with a grunt.\n\nST JUST\n\nCompany!\n\nHe's refering to the noise and shadow of approaching aliens.\n\nShe herds them into the shaft.\n\nCUT TO: INT.  LIFTSHAFT - CONTINUOUS\n\nIt goes down about four stories, and up seemingly forever.. Enough room \nfor or three\n\nelevators, one of which is two stories below.\n\nWREN\n\nUP!\n\nHe starts climbing.  It's not that hard -- there are ladders in each \nshaft section.\n\nCall comes up behind him.  Ripley and others pair off on other ladders.\n\nThey climb fast, they're three stories up before the aliens begin \nPOUNDING on the metal door, it buckles under their might.\n\nJOHNER\n\nMove!\n\nWREN\n\nNot far!\n\nStill POUNDING -- one alien gets its head in, looks up, hisses, pulls \nit out.\n\nANGLE: LIFT\n\nWren comes to a cralwspace ledge.  He climbs on.  Set back a few feet \nfrom the shaft is a small maintenance access door. works the keypad \nbeside it as Call climbs up behind him.\n\nThe aliens SMASH through the door, one of them SAILING across the shaft \nto grab a pipe on the other side. Instantly four of them are swarming \nup the walls, moving much faster  on pipes and ridges than the humans \non ladders.\n\nOn one of the aliens a facehugger crawls, constantly moving about on \nthe adult alien's head like a frightened spider.\n\nCALL\n\nHurry!\n\nWREN\n\nIt's jammed!  Shit!  Gun!\n\nShe hands him her gun and without hesitation he SHOOTS HER THROUGH THE \nCHEST.\n\nShe flies back and DOWN THE SHAFT, lands HARD on an elevator six \nstories below.\n\nEyes wide and empty.\n\nVRIESS\n\nNOO!\n\nHe fires up at Wren, but Wren has punched in the code and slipped \nthrough the opening door..\n\nRipley LEAPS through the air and grabs the ledge, hauling herself up \njust in time to see  the door shut.  The lock lights turn red.\n\nShe SLAMS against the door, but to no avail.\n\nThe aliens are getting closer.  St Just, the closest to the bottom, \nsuddenly lets go of  the ladder.  His knees hooked over a rung, he \ndrops, hangs up side down, his guns  filling his hands.\n\nHe blows several holes in the nearest alien.\n\nRipley is furious, maybe surprised just how so.  Suddenly an alien \nRISES OVER THE LEDGE, it's not three feet away from her and she \nSCREAMS, HURLS herself at it and they both go\n\nFLYING OFF into-space, they hit the wall on the other side, they fall. \n\nRIPLEY GRABS a pole, it practically tears her arm out of her socket but \nshe holds on, the alien isn't so lucky, it plummets unable to find \npuchase. We see it fall past  the unmoving body of Call.\n\nANGTE: CALLS FACE\n\nAs the facehugger CLAMPS onto it. Pauses. Pushes off a bit, two digits \nprobing Call's nostrils.  Sensing no breath, the thing scurries away to \nfind a better host.\n\nAnother alien is fast approching Christie and Vriess. Vriess \nfrantically tries to reload.\n\nVRIESS\n\nIt's on us!\n\nChristie turns, aims -- Vriess grabs the ladder as Christie FIRES, but \nthe alien is too close, it grabs Christie, spurting blood all over him.  \nHe SCREAMS, lets go of the ladder\n\nVriess takes the weight of both as Christie fires again, the alien \nflying off  and down the shaft.\n\nHILLARD\n\nWe gotta go!\n\nThe last alien suddenly starts scurrying back down after his brothers.\n\nRIPLEY\n\nWe're locked in.\n\nJOHNER \n\nFuck!\n\nPURVIS\n\nHow far to the next door?\n\nDISTEPHANO\n\nAll the way.\n\nRIPLEY\n\nThen we climb.\n\nThey start, moving as fast as they can.\n\nVRIESSS (to Christie)\n\nYou just hang on, man.  I'll get us there.\n\nHe starts climbing up, impressively fast considering the burden hanging \nfrom his back.\n\nJOHNER (to Ripley)\n\nAre they going for reinforcements?\n\nRIPLEY\n\nFucked if I know.\n\nThey climb.\n\nAnd climb, the minutes stretching out, still no door.  Ripley easily \nahead of the rest.\n\nFinally:\n\nRIPLEY\n\nI think I see the door.\n\nPURVIS (exhausted)\n\nGreat.\n\nVriess is having increasing trouble.  Hillard notices him lagging \nbehind, and why.\n\nHILLARD\n\nVriess!  Jesus!\n\nVriess is moving very quickly, considering. But the effort is becoming \ntoo much.\n\nVRIESS\n\nWe're coming...\n\nJohner scrambles down next to Vriess.\n\nhe checks the pulse in Christie's neck.\n\nVriess, man... he's dead.\n\nRefusing to hear it, Vriess struggles to climb further.\n\nVRIESS\n\nWe'll get him to medlab... just a little while ...\n\nJohner looks over at Hillard.  Without saying a word, she pull out a \ngood-sized hunting  knife, flicks it open.\n\nShe slices through the cord holding them together, and Christie's body \nfalls free.\n\nVriess shuts his eyes, feeling it.  ANGLE: DOWN THE SHAFT\n\nThere is silence as Christie's body drops down the black abyss\n\nUntil, from up the shaft next to where he fell, we see two ALIENS \nCOMING UP.\n\nPURVIS\n\nFuck!  Company!\n\nHillard looks up the shaft.\n\nHILLARD\n\nHow much further?,\n\nJOHNER\n\nToo fucking far.  Let's G0 !\n\nThey start to climb, but the aliens are making much better time.\n\nA loud CLACKING sounds from the bottom of the shaft.  A few of them \nlook down.\n\nANGLE: DOWN THE SHAFT\n\nThe aliens are still coming, but suddenly the lift passes them heading \nup at high speed.\n\nJOHNER\n\nThey can work the elevators?  Is there anything fucking else we should \nknow about them?!\n\nHe's addressing this at Ripley, but she's as puzzled as the rest of \nthem.\n\nThe lift comes up to them, stops suddenly as emergency brake is \nflipped.\n\nThey wait, guns ready. Out of the hatch pops Call, not especially dead.\n\nCALL\n\nGet on!\n\nA moment of stunned silence, then they all jump on top of the lift.\n\nCall drops back down inside.\n\nAn alien comes up level with the lift, prepares to jump.  St Just \nshoots the shit out of it.\n\nHILLARD\n\nWhere are the others?\n\nCUT TO: INT.  LIFT - CONTINUOUS\n\nCall flips the brake off, and the lift shoots up.  She is holding her \njacket closed around  her chest wound, but it doesn't seem to bother \nher particularly much.\n\nANGLE: ON TOP\n\nEverybody holds on as the lift flies up the shaft.\n\nANGLE: INSIDE\n\nCall waits for the signal to stop and an alien PUNCHES THROUGH the \nbottom of the lift.  Call yells as it gets its head and an arm through, \nclawing for her.\n\nANGLE:\tON THE BOTTOM\n\nWe see the other half of the alien clinging to the lift.\n\nANGLE:\tON TOP\n\nRipley sees the door approaching\n\nRIPLEY\n\nstop!\n\nANGLE: INSIDE\n\nCall hits the emergency button and the lift stops halfway in front of \nthe door -\n\n- giving both Ripley and Call access.  Bu the alien is still grabbing \nfor her --\n\nRipley pries open the doors again, the crew pouring out into the hall. \nRipley follows, jumps down and opens the lift doors\n\nThe alien hisses at Ripley as she pulls Call out -- the -alien grabs \nCall's ankle, but\n\nRipley wrenches her free.\n\nThey roll out but the alien is still fighting, Pulling itself inside \nthe lift.\n\nRipley grabs Hillardl's shotgun.  Levels it at the cables holding the \nlift.  FIRES.\n\nThe lift PLUMMIETS, the alien still halfway in.\n\nIt shoots down the shaft -- picking up the second alien on its way \ndown, neither beast able to get its bearing and get out of the way as--\n\nThe lift SMASHES into the bottom of the shaft, crushing both the Aliens \nto jelly.\n\nANGLE:\tUPPER DOOR\n\nJohner triumphantly sticks his head in the shaft.\n\nJOHNER\n\nEat that, fuckneck!!\n\nThey all breathe hard, exhausted, before they can muster for the next \nstretch. \n\nCall stands with her back to them.\n\nVRIESS\n\nBaby, am I glad to see you.  I thought dickbag took you out for sure.  \nAre you, hurt?\n\nCALL\n\nI'm fine.\n\nDISTEPHANO\n\nYou got body armour on?\n\nCALL\n\nYeah.  Come on.\n\nRipley isn't buying.\n\nRIPLEY\n\nYou were Gunshot.  I saw.\n\nCALL\n\nI'm fine!\n\nRipley spins her around.  Call stares at Ripley, sullenly a small \ntrickle of milky white fluid comes from her nostril. Ripley looks down.\n\nANGLE: CALL'S CHEST\n\nWren has indeed made a messy hole here, but where blood and bone should \nbe there is a tangle of synthorganic wiring.  To state the obvious:\n\nA robot.\n\nJOHNER\n\nCall's a goddam sythetic!\n\nHILLARD\n\nSon of a bitch.  Little Annalee's just full of surprises.\n\nRIPLEY (quietly)\n\nI should have known.\n\nST JUST\n\nCouldn't smell this one out?\n\nRIPLEY\n\nNo, I mean... all that crap about being human - there's no one so \nzealous as a Born Again.\n\nVRIESS (to Call)\n\nYou're an LM7, aren't you?  Is that it?\n\nCALL\n\nLeave me alone.\n\nHer voice shocks her more than anyone her vocal track slip affected by \nthe wounds.\n\nThe voice is a shade slow, and echoes strangely.\n\nVRIESS\n\nCall ....\n\nCALL (bitterly)\n\nYes.\n\nST JUST\n\nLM7?  Shit.  That explains a lot.\n\nYRIESS (to Ripley)\n\nThe latest and best.  They were supposed to revitalize the synthetic \nindusty.\n\nInstead they buried it.\n\nRipley looks at the girl.\n\nRIPLEY\n\nThey were-too good.\n\nVRIESS\n\nOh yeah.  Overrode their own behavioral inhibitors.  Didn't feel like \nbeing told what to do.\n\nThe government ordered a recall.  Fucking massacre.\n\nHILLARD\n\n1 always heard there were a few that got out alive, but man... I never \nthought I'd see one.\n\nJohner starts laughing.\n\nJOHNER\n\nOh, Christ.  Doing fucking nickel and dime border runs, selling second \nhand junk to the farm belt... and we're carrying the most expensive \npiece of contraband in the system.\n\nThat's rich.\n\nPURVIS (getting anxious)\n\nIt's great, she's a toaster oven... Can we leave now?\n\nVriess tries to touch Call's wound.\n\nVRIESS\n\nLet me see.\n\nCall pulls away.\n\nJOHNER\n\nYeah, get your socket wrench, Vriess.\n\nMaybe she just needs an oil change.\n\nRIPLEY\n\nLet's go.\n\nThey start off again, Johner and St Just bringing up the rear\n\nJOHNER\n\nCan't believe I almost fucked the thing.\n\nST JUST\n\nYeah, like you've never fucked a robot.\n\nANGLE: RIPLEY\n\nLetting DiStephano lead.\n\nRIPLEY\n\nDiStephano.  Where are we?\n\nDISTEPHANO\n\nUpper decks... Storage... the chapell's up here, not much else.\n\nRIPLEY\n\nCan we get to the ship?\n\nDISTEPHANO\n\nWell, we're a ways out,of the way, but I think we can get through to \nthe garden.\n\nFrom there, it's down a few levels, it's do-able.\n\nWhat if the fucking doctor gets there first?\n\nVRIESS\n\nIt's a good point.\n\nDISTEPHANO\n\nShit.\n\nThey have reached an access door.  Debris blocks the way.\n\nRIPLEY\n\nAnother way?\n\nDISTEPHANO\n\nUh, yeah.  Through the wall.  We'll have to get one of these panels \noff.  It'll take a while.\n\n(to Vriess) You got tools?\n\nVRIESS\n\nYeah, but no torch.\n\nJOHNER\n\nFucking blow the door!\n\nHILLARD\n\nAssface, We're on the top of this thing.\n\n(pointing to the ceiling)\n\nThat's hull.\n\nVRIESS\n\nWhat about Wren? if he gets in the computer he can really fuck us \naround.\n\nRIPLEY\n\nWe have to get in too.\n\nDISTEPHANO\n\nThere's no access console on this level. We'd have to-backtrack.\n\nHILLARD\n\nFuck that.\n\nDISTEPHANO\n\nAnd I don't have the security access that Wren does anyway.\n\nRipley turns to Call.\n\nRIPLEY\n\nCall.\n\nCALL\n\nNo. I can't.\n\nJOHNER.\n\nBullshit.  She's a damn well talking machine.\n\nCALL\n\nThere's another way.\n\nDISTEPHMO\n\nJust tell her to access it on remote.\n\nVRIESS\n\nShit, that's right.  Any of the new model droids can access the \nmainframe.\n\nJOHNER\n\nJust by blinking.\n\nCALL\n\nI can't.\n\nST JUST\n\nNo time to get coy, Annalee.\n\nCALL\n\nI can't. I burned my modem drive.  We all did.\n\nVRIESS\n\nYou can still patch in manually. You know that.\n\nCall looks over at the group, staring at her.  She knows she doesn't \nhave a choice.\n\nDISTEPHANO\n\nThere's ports in the chapel.\n\nRIPLEY\n\nCome on.\n\n(to the others)\n\nYou get started on that wall.\n\nCUT TO: INT.  CHAPEL - CONTINUOU@\n\nRipley and Call enter the small room.  Ripley sits in one of the pews, \npulls out a bible.\n\nit somewhat resembles a Newton Under the leather flap is a screen \nreading.:\n\nHOLY BIBLE.  PRE START.\n\nRipley pulls out the cord from the bible's port, holds it up\n\nCALL\n\nDon't make me do this.\n\nRIPLEY\n\nDon't make me make you.\n\nCALL\n\nI don't want to go in there.\n\nRIPLEY\n\nGet over it.\n\nCALL\n\nIt's like... your insides are liquid. It's not real.\n\nRIPLEY\n\nYou can blow the ship.  Before it reaches Earth.  Kill them all.  Just \ngive us time to get\n\nout first.\n\nThat convinces Call.  She pulls up her sleeve, and begins. pushes a \npart of her forearm,\n\njust below the crook of her elbow.  It has a spring release catch, and \na small panel rises\n\nup with two computer ports on it.  She takes the cable from Ripley and \nplugs it in.\n\nIt looks almost like she's mainlining heroin.\n\nShe cocks her head.\n\nCALL\n\nDammit.\n\nRIPLEY\n\nAnything?\n\nCALL\n\nHold on.\n\nShe reaches in her chest, reconnects some tubes.  She twitches then \nshuts her eyes.\n\nIt's beginning.\n\nShe begins speaking very rapidly, eyes still shut.\n\nCALL\n\nBreach in sector seven sector three sector nine unstable -- engines \noperating at eighty\n\nsix percent -forty six minutes until earthdock.\n\nHer voice has a slight mechanical quality as she rattles this off.  Her \neyes open.\n\nCALL\n\nWe burned too much energy -- I can't make critical mass.  I can't blow \nit.\n\nRIPLEY\n\nThen crash it.\n\nTO: INT.  HALL - CONTINUOUS\n\nAs the crew works at getting the wall panel off,.\n\nTO: INT.  CHAPPEL   A BIT LATER\n\nCALL\n\nGround level recalibrated... new destination 760, 403.  Done.  Forty \none minutes until impact.\n\nRIPLEY\n\nTry to clear us a path to the ship.\n\nCALL\n\nTracking movement in sublevels six through nine.  Video is down.  \nAttempted rerouting\n\nnonfunctional, wait, partial visual in waste tank 5, unauthorized \npresence...\n\nVRIESS\n\nUnauthorized?\n\nCALL\n\nNonhuman.\n\nRIPLEY\n\nHow many?\n\nPlease wait.. emergency override on. console 45V, level one... \nhandprint ID...\n\n(like herself)\n\nIt's Wren. \tHe's almost at the Betty.\n\nRIPLEY\n\nAnd how do\tyou feel about that?\n\nCUT TO: INT.  HALL - CONTINUOUS\n\nWren is holding his hand to the scanner, just as Call described.  The \nred light turns\n\ngreen and we hear the locks the door crack open.\n\nFATHER\n\nEmergency override validated.\n\nThe door begins to rise.  Looking around him, Wren waits to through.\n\nThe door grinds to a halt, still too low to climb under.  The lights go \nout, only the faintest glow coming from various instrument panels. \nwren's expression drains.\n\nWREN\n\nFather, reboot systems on 45V, authorization 'starling'.\n\nNothing happens.  Wren looks about him, beginning to sweat.\n\nDid the aliens do this?\n\nWREN\n\nFather, locate power drain, report.\n\nFather?\n\nCALL - (on the system)\n\nFather's dead, asshole.\n\nWren spins in shock at the sound of Call's voice. it,s everywhere \naround him.\n\nShe has downloaded her vocal matrix place of Father's. \n\n(She's not just speaking over a PA, she is the PA.)\n\nThe door SLAMS back-down, locks clack into place.  The doors behind him \nopen up, \n\nemergency lighting pulsing along toward him.\n\nCALL\\SHIP\n\nIntruder on level one... all aliens please proceed to level one.\n\nWren is freaking.  He turns back down the corridor, looking about him \nwildly.\n\nCUT TO: INT.  CHAPEL - CONTINUOUS\n\nCall pulls the cord out of her port.\n\nRIPLEY\n\nYou got a mean strak.\n\nCALL\n\nIt's done.  That should hold the fuck.\n\nThis as her voice track slips even more.  She works the wires in her \ncheest, trying\n\nto fix it.\n\nRIPLEY\n\nLet me see\n\nCALL\n\nDon't touch me.\n\nRipley backs off.\n\nCALL\n\nYou must think this is pretty funny.\n\nRIPLEY\n\nYes.  But I'm finding a lot of things funny lately.  And I'm not sure \nthey are.\n\nCALL\n\nWhy do you go on living?  How can you stand it?  How can you stand... \nyourself?\n\nRipley shrugs.\n\nRIPLEY\n\nNot so hard.  Not much choice.\n\nCALL\n\nAt least there's part of you that's human.  I'm just... fuck.  Look at \nme....\n\nShe looks at the hole in her chest, the white and sticky fibers.\n\nCALL\n\nI'm disgusting.\n\nHer voice is at its slowest here, low and eerie.  It's a mechanical \nproblem, but \n\nit sounds just like despair.\n\nRIPLEY\n\nDo you dream?\n\nCALL\n\nI ... we have neural processors that run through....  (stops)  Yes.\n\nRIPLEY\n\nWhen I sleep, I dream about it.  Them.  Every night.  All around me ... \nin me. \n\nI used to be afraid to dream, but I'm not anymore.\n\nCALL\n\nWhy?\n\nRIPLEY\n\nBecause no matter how bad the dreams get ... when I wake up it's always \nworse.\n\nPurvis enters.\n\nPURVIS\n\nI guess we're almost there.\n\nRIPLEY\n\nRight.\n\nHe exits again.  Call finishes fiddling with her internal wiring.  We \nhear her voice slip back to normal as she says:\n\nCALL\n\nLet's get going.\n\nCUT TO: INT. TUNNEL\n\nAs they come one by one through the wall.\n\nDISTEPHANO\n\nNot far now.\n\nPURVIS\n\nGod, I'm so tired...\n\nJOHNER\n\nYeah, well, we'll sleep when we're dead.\n\nRipley follows him through.\n\nRIPLEY\n\nDon't count on it.\n\nThe rest of them come through and walk into:\n\nINT.  THE GARDEN    CONTINUOUS\n\nThe Garden runs nearly half a mile straight across, and then down on a \nterraced slope.\n\nEverywhere are different kinds of plants: trees, vegetable plants, \nexotic and experimental hybrids.\n\nAccess paths crisscross the beds.\n\nIt's huge, the single biggest space on the ship.  Yet the low ceiling, \nlaticed with grow-lamps now dim in nightcycle, and prodigeous \nundergrowth make it labyrinthian, almost claustrophobic.\n\nFrom where the crew is, they can barely see where it slopes down.\n\nJOHNER\n\nWhat's this fucking deal?\n\nDISTEPHMO\n\nThis supplies most of the food for the unit.\n\nVRIESS (holding a lucious ripe pear)\n\nYou guys got something against spam?\n\nDISTEPHMO\n\nAnd there's some lab work here too. Hybridization.\n\nRIPLEY\n\nAt the other end?\n\nDISTEPHMO\n\nRuns down to the by the waste tanks.  We can get to the dock from \nthere.  You, okay?\n\nRipley is holding her head.  She shuts her eyes.\n\nCALL\n\nWhat is it?\n\nRipley shakes it off.\n\nRIPLEY\n\nNothing.  I'm okay.\n\nShe looks out at the jungle, they have to cross.\n\nCALL\n\nWe should get moving.\n\nST JUST\n\nHey!  Check it out!\n\nHe has come upon a small loading truck, a sort of platform jeep.  \nVriess checks it out, takes a huge bite of his pear.\n\nVRIESS\n\nBeats walking.\n\nHe hauls himself up-into it. Everybody piles onto the back flatbed just \na foot or so off the ground and just big enough to hold everyone but \nVriess, Call and Ripley, who pushes into the driver's seat.\n\nVRIESS\n\nQuickly and quietly, people.\n\nRipley stares unconprehendingly at the controls for a momen till Call \nflips on the ignition.\n\nRIPLEY\n\nThank,you.\n\nThe jeep pulls out.  It's electric, so it emits just a low hum as she \ntakes it at a good clip toward the other side.\n\nThe access paths are just a bit wider than the jeep itself, plants \nrising tall all around them.\n\nRipley concentrates on driving.\n\nThe pass through as section of wheat , then of corn.  As they come to \nanother section,\n\nThe crew's expressions change to one of pleased disbelief.\n\nYou gotta be fucking me. St Just!  Is this real?\n\nST JUST\n\nSo this is what heaven looks like.\n\nWe see they have driven into a healthy section of CANNABIS plants \ngrowing ten feet high.\n\nThe car screeches to a halt.  Ripley's at a crossroads of sorts.\n\nRIPLEY\n\nWhich way?\n\nHILLARD (looking at the plants)\n\nI always wondered where the military got its funding...\n\nAn alien SHOOTS out of the brush and lands on Hillard everyone SCREAMS \n-- Ripley SLAMS her foot on the pedal\n\nThe jeep PEELS OUT, as more emerge from the brush.\n\nHILLARD\n\nGet it off MeeeaaaaAAGGHRE!!!!\n\nIt bores into her head before St Just can blow it away. It's head \nexploding in fragments of bone and sizzling blood as it falls away from \nthe jeep, Hillard's body still clutched in arms.\n\nAnother leaps out at them, but the jeep is going a good clip and it \nmisses.\n\nThe crew peppering it with bullets.\n\nThey look,about them, guns ready.\n\nANGLE: IN THE BRUSH\n\nSomething runs parallel to them in the plants.\n\nANGLE: ABOVE\n\nTwo more run on top of the grow-lamps, pacing them as well.\n\nOne DROPS DOWN -- Ripley SWERVES out of the way, driving in the plants.\n\nThey are varied, exotic -- and there are aliens behind half of them.\n\nThe crew BLASTS away all around them Ripley drives a drunkard's path \nthrough the brush, avoiding trees that dot the scape.\n\nAn alien DROPS onto the hood, another grabs the side -- Vries takes out \nthe first, blowing it off, but the second grabs Johner, he goes flying \nover the side,.dropping his gun.\n\nSt Just is too preoccupied with his own problems on the othe to see \nthat Johner is being\n\ndragged, the alien still clutching onto him.\n\nShots bang out, ripping into the alien, which lets go. Johner looks up \nto see Purvis  holding Johner's gun.\n\nJohner drags himself back on.\n\nOne jumps down onto St Just, tears a good chunk out of his midsection \nbefore he dusts it.\n\nAnother alien jumps on the hood just as the jeep SAILS over first ledge \nof the terraced  slope, comes-down hard enough knock it off, SAILS over \nthe next -- the crew can barely hang on as the jeep crashes down slope \nafter slope. \n\nRipley swerves back onto the road, the jeep sliding over onto the steps \nbeside it, rocking violently as they shoot down the remainder of slope, \nthe aliens close on their heels.\n\nStill blasting away at the beasts, the crew is able to put little \ndistance between them as they come to the end of the garden.  Here it \ndivides into three sections, all open halls with access for the jeep.\n\nRIPLEY\n\nWhich way?\n\nDISTEPRMO (looking over)\n\nLeft!  Left!\n\nShe swerves left, the jeep-bouncing into the hall\n\nINT.  HALL CONTINUOUS\n\nWhere windows running along either side look out onto black space.\n\nRipley drives as far as she can, till a staircase -- going -- fills her \nvision, too steep\n\nfor the jeep.  She SLAMS on brakes. the jeep spinning out and coming to \na halt.\n\nThe crew piles out, Di Stephano grabbing Vriess.  At the other end of \nthe hall, the aliens\n\ncan be seen approaching.\n\nThe crew BLASTS at them, the aliens, blood splattering the narrow hall.\n\nANGLE: THE BLOOD\n\nEating into the walls. the floor.\n\nCALL/Ship\n\nWarning. potential hullbreach.  Clear sector.\n\nDISTEPHANO (indicating the steps)\n\nDown here!\n\nThey start down -- all but St Just.  He gets out of the jeep with \ndifficulty.\n\nLooks down at his wound.\n\nJohner looks around to see him still standing atop the steps\n\nJOHNER\n\nSt Just!  Come on, man.\n\nSt Just looks down at the wound. Back at Johner.  He walks calmly away, \ntowards the aliens.\n\nCALL\n\nSt Just!\n\nST JUST\n\nYou go.\n\nHe looks at the appraching aliens.\n\nST JUST\n\nI'm bored.\n\n CALL\\SHIP\n\nWarning.  Evacuate sector.\n\nA moment, then the crew takes off.\n\nSt Just takes a handful of pills, pops them into his mouth.  Only the \nslightest  grin suffuses his face ,as he waits for the aliens.\n\nThey close on him, and he raises his guns.\n\nCALL\\SHIP\n\nwarning...\n\nCUT TO:\n\nINT HALL NEARBY - CONTINUOUS\n\nThe crew runs full out.\n\nDISTEPHANO\n\nWe have to get out of the sector!\n\nRIPLEY\n\nWhere!\n\nDISTEPHANO\n\nThere!\n\nHe points at a door that's down two flights and across the hall.\n\nCUT TO: INT. HALL CONTINUOUS\n\nThe aliens close, and St Just FIRES, blasting away with bot guns.  \nAliens writhe on the\n\nfloor before him, still they cover the bodies of their brothers, still \nhe fires, \n\nCall\\ship monotones of warning in sharp contrast to the chaos\n\n-- St Just fires until both guns are empty.  In one smooth motion he \ndrops them both \n\nand jerks his wrists and TWO-MORE disposable guns fly into his palms \nand he blasts away\n\nANGLE: THE BLOOD\n\nEating through the hull.\n\nANGLE: THE CREW\n\ndesperately racing for the door.\n\nANGLE: ST JUST\n\nFiring with quiet glee.\n\nANGLE: THE CREW\n\nThe first of them are through the door.\n\nANGLE: St JUST\n\nThe aliens are getting closer, but still he mows them down Both his \nguns click, spent.\n\nST JUST\n\nDamn.\n\nCALL\\SHIP\n\nWarning --\n\nand BOOM!!!!, the hall BURSTS OPEN, everything explodes into space, the \nwind rushes out as\n\nBOOM!!!, the whole garden sector rips open, sucked out, as\n\nANGLE: RIPLEY\n\nis the last to get out, but the pressure change SUCKS HER she flies \nbackwards, the section door coming down just in time as she SLAMS into \nit, the door closing fully as she falls, lack of pressure sucks at the \ndoor itself, it creaks and be inward slightly, but it holds.\n\nThe others have exited into the next hall.  They've been tossed about, \nbut not as badly.\n\nCall stops, runs back to Ripley, helps her up.  Ripley is dazed; the \ndoor hit the back of her head solidly.\n\nCALL\n\nCan you walk?  RIPLEY\n\nI think I...\n\nCALL\n\nI'm not fucking carrying you\n\nRipley doesn't even hear her; something else drowns Call out. Ripley \nputs her hands over her ears.\n\nRIPLEY\n\nMistake ... mistake...\n\nCALL\n\nRipley.\n\nRIPLEY\n\nI can hear them, in the hive... it's close...\tWe're on the hive.\n\nCALL\n\nJesus.  Come on.\n\nRIPLEY\n\nI can hear them... the queen...\n\nCALL\n\nWhat... ?\n\nRIPLEY\n\nShe's in pain.\n\nThey CRASH UP through the floor panels, six of them, surrounding the \ntwo women.\n\nCall can barely spin before Ripley GRABS her and HURLS her fifteen feet \ndown the corridor, out of harm's way.\n\nThe aliens close on Ripley. She struggles but she's still weak.  One \nslams her onto the ground call recovers, looks back at Ripley\n\nAs the aliens drag her unconscious body back down under the floor.\n\nCALL\n\nRIPLEY!\n\nCUT TO: INT.  AIR VENT - CONINUOUS\n\nDark, cramped, and already covered with a hardening layer of resin.\n\nSkittering, insectile motion at one end heralds the aliens, as two of \nthem crawl rapidly along.   The third craw upside down, the \nsemiconscious Ripley draped over its chest  If she were awake, and \nout.vf her mind, she could be kissin the beast.\n\nHer eyes flutter open, but she is obviously still groggy.\n\nANGLE: RIPLEY'S POV\n\nAlien head, dark tunnel passing beneath.\n\nScuttling through a small maze, the aliens come out into:\n\nINT.  WASTE TANK 5 - CONTINUOUS\n\nA vast, dark chamber, entirely encrusted with alien goo. air vent opens \nabout three quarters of the way up the chamber. The aliens pour out and \nimediately scuttle UP, carrying Ripley to the top of the chamber.\n\nThey circle her and begin secreting resin, spinning a web around her.\n\nThe resin comes out of ther backs in spits and globs.\n\nIt isn't pleasant, and Ripley struggles feebly as they begin to cocoon \nher.\n\nCUT TO: INT.  ANTECHAMBER   CONTINUOUS\n\nThe crew piles through it on their way to the loading dock.\n\nCall brings up the rear, still looking back regretfully.\n\nShe hesitates, and Purvis takes hold of her arm.\n\nPURVIS\n\nWe got to be moving, miss.  Best gift you can give her right now is a \nquick death.\n\nCALL\n\nIt's not right...\n\nPURVIS\n\nI've been saying that all day, we need your help.\n\nA moment more, and she heads out with him.\n\nCUT TO: WASTE, TANK 5 - CONTINUOTJS\n\nThe aliens have finished webbing Ripley, and climb away. \n\nWhen it is done she finds herself basically hung from the ceiling, her \nlegs encased and glued with glistening strands to the roof. She hangs \ntherefore at an angle, looking down on the chamber. \n\nAnd so it is with her, as she swims to full consciousness, we get our \nfirst real look at where we are.\n\nThere are no less than ten people strung up exactly as Ripley is, \nencircling the chamber, and all looking some forty feet down at:\n\nThe Queen.  Lying on her back at the bottom of the-chamber, belly \nswollen and distended.\n\nShe is herself partially cocooned, strapped down to the at the edge of \na black pool of blood and ichor.  Her head moves slowly back and forth, \nin delierium of pain.\n\nThere are a four or five aliens tending her, spinning goo around her, \nvomiting blood onto her belly. They might be serving her, or \nimprisoning her.  Both, in fact.\n\nThere is one thing missing from this tableau.\n\nRIPLEY (softly)\n\nNo eggs ...\n\nGEDIMAN (OS)\n\nMultiple reproductive systems.\n\nRipley turn's slowly, to see the person next to her.  It's Gediman, \nlooking wane and haggard.\n\nHe may be speaking to her but he stares straight ahead, his eyes \nglowing with near insanity.\n\nGEDIMAN\n\nComplete asexual reproductive cycle, self-impregnating, we found six \ndifferent sets of ovaries in her.  Egg laying is the first cycle, \nimmature.  Redundancies, redundancies\n\n... she'll bring forth legion.\n\nRIPLEY\n\nThey didn't impregnate you?\n\nNow he looks at her, regret and glee at what has happened battling for \nhis expression.\n\nGEDIMAN\n\nNo... they've just been draining me.\n\nShe looks down, to see\n\nANGLE : GEDIMAN'S FEET\n\nAs blood from various wounds seeps slowly past his toes, dripping into \nthe pool.\n\nA keening SHRIEK comes out of the queen, as her limbs begin thrashing.\n\nThe aliens around her back off slightly. \n\nThe bulge in her belly starts moving.\n\nRipley starts struggling with her bonds, terror and determination in \nher.eyes.\n\nRIPLEY\n\nI'm getting\tout of here. Goddamnit, I'm getting the\tfuck out of here!\n\nHe looks at her, the last glimmerof his sanity sinking beyond the \nhorizon.\n\nGEDIMAN\n\nDon't you want to see what happens next?\n\nCUT TO: INT: LOADING DOCK - CONTINUOUS\n\nThe crew rushes in, heads for the Betty.\n\nJOHNER\n\nHow long till we can get airborn?\n\nVRIESS\n\nI'll need Call to patch in to the ship again, open the hatch.\n\nCALL\n\nRight.\n\nJOHNER\n\nWe hit atmo in a few minutes, only gonna make it harder.\n\nThey all run on board\n\nINT.  THE BETTY\n\nand head for the cockpit.  DiStephano deposits Vriess in a wheelchair.\n\nCALL\n\nJohner, take Purvis to the freezer.\n\nJOHNER\n\nAll right.. Nap time, buddy.\n\nA GUNSHOT and Purvis goes flying, blood spurting out of his shoulder, \nJohner draws but\n\nWren emerges from the shadows too fast.\n\nWren grabs Call and very carefully holds his gun to her back right \nbelow her shoulderblades.\n\nWREN\n\nFuck with me and I put a bullet where her brain is!\n\nJohner stands, uncertain.\n\nWREN\n\nDiStephano!  Take their weapons.\n\nDISTEPHANO\n\nBegging your pardon, sir, but eat my fuck.\n\nDiStephano aims at Wren.  Wren backs up a step.\n\nWREN\n\nDrop it!  Drop it or we all die together!\n\nHeaped in the, corner, Purvis suddenly jerks forward.  His eyes go \nwide.\n\nCUT TO: INT.  WASTE TANK 5   CONTINUOUS\n\nRipley is frantically trying to pull at her bonds.  It's just beginning \nto work.\n\nBut the noise in here is getting worse, the aliens franitcally agitated \nas the Queens belly begins moving more violently.  SHRIEKS, and RIPLEY \ndoes as well, from effort or sympathy, it is hard to tell, as\n\nTHE QUEENS BELLY POPS OPEN.  Blood shoots everywhere, burning into the \nwalls.\n\nAnd all the screaming stops.  The movement stops.  Even Ripley stops.  \nSilence.\n\nSomething emerges from the wound.\n\nAn alien, to be sure, but nothing we've seen so far, its forelegs arch \nout of its back like spiders legs, its back legs set on enormous \nhaunches, thick and powerful.\n\nIts head is long, eyeless, like the others, but along its white expanse \nred veins, coming out of the skin and running like thick black hairs to \nthe back.\n\nIt has retracted pincers at the side of head that come out when its \ntongue does.\n\nIts much bigger the the others, nearly the size of the queen herself.\n\nAnd it's bone white.\n\nGEDIMAN\n\nBeautiful.... beautiful butterfly...\n\nHe is crying with revelatory joy.  Ripley is not.  Grimacing the sight \nand smell of the new beast, she begins pulling again at her bonds.\n\nOne of the soldiers, at the 'other end of the room from Ripley wakes \nup.\n\nDangling uselessly at his side is a rifle -- the real deal, not a \nburner.\n\nSOLDIER\n\nNo, God...\n\nHe SCREAMS in uncomprehending horror.  The newborn stops, tilting its \nhead:\n\nIt LEAPS up to the ceiling in a second, quick and effortless as a \nmonstrous flea.\n\nLeaps again and lands on the screaming soldier, gripping his sides with \nits four forelegs as he screams lustily.\n\npincers SWING out and pin either side of his head.. His eyes go wide \nas:\n\nIts tongue SHOOTS into his throat.  Stays there, and we watch it drain \nthe blood from his body.  We can see it, see its stomach swell, red \ntinged, as his body goes\n\nblue and slack. His rifle drops into the black pool.\n\nGediman stares, transfixed, and it LANDS ON HIM.\n\nCUT TO: INT.  BETTY - CONTINUOUS\n\nJohner's gun drops to the floor.\n\nEveryone backs off.\n\nWREN\n\nThe fucking robot is going to plug back into the Auriga and land it \naccording to standard operational procedure.\n\nCALL\n\nNo she's not.\n\nDISTEPHMO\n\nYou're fucking nuts.  You still want to bring those things back to \nearth?\n\nJOHNER\n\nHave you been paying any attention today?\n\nWREN\n\nI can handle the animals!\n\nCALL\n\nFucking shoot me.\n\nWREN\n\nShut up!!!\n\nAnd Purvis LAUNCHES from the corner, screaming, jumps on wren - Wren \ngets off a couple of shots -- nails DiStephano in the face.  The \nsoldier drops like a sack.\n\nThe other shots hit the ship, Call dives for cover as Purvis SLAMS his \nfist across Wren's face, Wren fires again and Jo is on the ground, \nrolling, grabbing his gun --\n\nPurvis is a man possessed.  He grabs Wren's gunhand and SMAS it against \nan instrument panel, bone cracking audibly as wren drops the gun.\n\nPurvis jerks.  Blood blooms in his chest.\n\nEverybody stops, mesmerized. wren drops to his knees, going for the \ngun, and Purvis grabs him from behind, pulls him so that the back of \nWren's head is against his chest.\n\nPurvis jerks again.  It takes Wren a moment to understand what's \nhappening.\n\nThey both scream.\n\nThen alien BURSTS out of Purvis's chest, STRAIGHT INTO WRENS SKULL.\n\nEveryone else is still frozen.  Then the little critter bursts out of \nWrens face, flying straight at Vriess.  CUT TO: INT.  WASTE TANK 5 - \nCONTINUOUS\n\nRipley TEARS one of her arms free as the newborn feeds beside her.\n\nGediman is already a shell.\n\nHaving drained the scientist, it leaps blindingly fast onto the \nceiling.  Looks around.\n\nTargets Ripley.\n\nIt has no eyes, but she can feel them on her anyway.  She rips at her \nbonds with a terrible effort -- the newborn LEAPS at her and she PULLS \nFREE with a scream, PLUNGING  the thirty feet to the pool as the alien \nflies over her, missing, landing on the far wall instead.\n\nRipley disappears beneath the surface of the water.\n\nThe newborn turns its head, trying to locate its lost prey. other \naliens scutter closer to the pool.\n\nRipley stands up out of the pool, covered in blood, HOISTING THE \nSOLDIERIS GUN.\n\nKillshriek rising from her throat as she FIRES, taking out a host of \naliens in a single sweep, just tagging the newborn as it leaps out of \nthe way.  Aliens jump at her, trying to kill and trying to protect the \nnewborns, but she blows them out of the air.\n\nIt feels pretty good.\n\nA few shots go wild, and punch big holes in the side of the tank.\n\nLight streams in through them.  Ripley sees -- and continues firing in \nthat direction.\n\nShe makes a big enough hole that she can run and SMASH through to\n\nINT.  BY TANK - CONTINUOUS\n\nrolling and coming up in an instant.  She looks around her. exit this \nway, but there is a vent above her.\n\nThe newborn's head lunges at her, the small hole making it impossible \nfor the creature to get all the way through.  But it wriggles, \npushing...\n\nRipley jumps up, grabbing a pipe, and KICKS open the vent grate, \nthrowing herself up the vertical shaft with astonishing ease.\n\nCUT TO: INT.  BETTY - CONTINUOUS---\n\nVriess is scrambling away, knocking over things to avoid the baby \nalien. \n\nJohner SHOOTS at the creature as it speeds-towards Vriess.\n\nCALL\n\nDon't shoot it!  Betty's hull is too thin!\n\nJOHNER\n\nLook out!\n\nit knocks over cannisters as it speeds across the table and behind some \ninstruments.  VRIESS\n\nWhere'd it go?\n\nCALL\n\nDon't shoot it!\n\nJOHNER\n\nFuck that!\n\nIt LEAPS out of the darkness and heads straight for Call, she stumbles \nback, trips -- it comes at her, leaps right at her face, she pulls her \nhand back -- and-flicks her wrist The stilletto pops out as the creatu \nflies at it, the blade slides right into its mouth, ramming eight \ninches through its innards before it pokes out the other end.\n\nBlood spurts on Call, on the floor.  The creature wriggles and finally \nfalls free as the stilletto melts inside it.\n\nJOHNER\n\nVriess!  Get behind the fucking wheel!\n\nCUT TO: INT.  VERTICAL AIR SHAFT - CONTINUOUS\n\nRipley is climbing up the cramped vent with the speed and agility of an \nalien.\n\nUnfortunately, so are the aliens, twenty feet below her.  Two drones in \nfront, with the newborn sqeezing close behind.\n\nRipley grabs a pole and her hand begins to steam, it's so hot. She \ncries out, lets go...  then looks down.  Grabs the pole again and, \nignoring the searing agony, pulls, pulls...\n\nRIPS out of the wall, burning steam GUSHING out below her, slowing down \nthe aliens.\n\nShe continues climbing, then kicks through a grate.\n\nCUT TO:\n\nEXT.  SPACE\n\nThe Auriga races toward:\n\nEARTH.  But not as we've seen it.\n\nThe planet is still blue, but almost two thirds of it is obscured by a \ngiant orbitting latticework of metal, a part shell that rotates sligtly \nfaster than the  planet itself.\n\nThe Auriga heads for a section of exposed earth.  Not long now.\n\nCUT TO: INT.  ANTE CHAMBER - CONTINUOUS\n\nRipley drops to the ground and heads for the dock.\n\nCALL/SHIP\n\nAirlock doors closing.  Stand clear.\n\nRIPLEY\n\nNo!\n\nShe doesn't bother to try the door, she HURLS herself through the \nwindow, landing\n\nINT.  DOCKING BAY\n\nin a hail of glass.\n\nShe is on the platform that. runs the length of the dock.  Betty. is \nbarely visible past the far end, - sinking into the airlock as the \nmassive airlock doors. slide slowly shut.\n\nRIPLEY\n\nNO!!\n\nA SLAM against the metal door behind her tells her the aliens are here.\n\nShe picks herself up and RUNS -- and she can run fast.\n\nSpeeds across the platform, faster, faster, the Betty sinks of sight as \nthe airlock doors move closer together, fifteen feet apart, ten...\n\nRipley reaches the edge of the platform and LEAPS, just hurls herself \noff of the platform, sails through the air, thirty, forty feet, and \ndown, the airlock doors thirty feet below almost closed\n\nShe DROPS right through just before they close, falls another fifteen \nfeet and lands\n\n-- WHAM!! -- on top of-the Auriga, hard, rolls, lies there in extremes \nof pain.\n\nCUT TO:\n\nINT.  BETTY - CONTINUOUS\n\nThe crew look up at the sound.\n\nVRIESS\n\nSomething's on us!\n\nJOHNER\n\nForget it!\twe'll shake it off on descent.\n\nAirlock secure.  Outer doors opening... . CUT TO:\n\nINT.  AIRLOCK - CONTINUOUS\n\nRipley tries to pick herself up, is momentarily too wiped. breathes \nheavily,\n\ngets to her knees.\n\nANGLE: FROM ABOVE-\n\nwe see Ripley crawling toward the hatch, and the huge outer airlock \ndoor opening beneath the ship.  Blue sky and wind the screen below.\n\nANGLE: RIPLEY\n\nStruggling to get to the hatch.\n\nRIPLEY\n\nGod'...\n\nAnd above her, through a window into the docking bay, we see the \nnewborn appear.\n\nCUT TO: INT.  BETTY - CONTINUOUS\n\nCALL\n\nAlmost there...\n\nJOHNER\n\nWe got about forty seconds till we kiss the ground!\n\nGo full thrust on the downdraft!  We'llget clear!\n\nJOHNER\n\nIt's gonna be fucking close.\n\nCALL\\SHIP\n\nWarning.  Procedural interruption.  Ship not leveling for vertical \ndrop.  Braking\n\nsystem nonfunctional.  Collision imminent.\n\nJOHNER\n\nNo shit.\n\nCALL\n\nAlmost there.\n\nCUT TO:\n\nINT.  AIRLOCK - CONTINUOUS\n\nThe airlock doors are almost.. completely open.  Ripley has reached the \nhatch, but cannot get it open.  She pounds on it frustration -- and the \nnewborn SMASHES through the window,\n\nJUMPS DOWN onto the ship.\n\nRIPLEY\n\nNOO!!  NOOO!\n\nCUT TO:\n\nINT.  BETRY - CONTINUOUS\n\nCALL\n\nNOW!!!\n\nVriess punches it\n\nCUT TO:\n\nINT.  AIRLOCK\\EXT.  SKY CONTINUOUS\n\nand the Betty SHOOTS DOWN out of the airlock -- Ripley and the newborn \njust barely hold on, Ripley's body thrown straight up as she grips the \nhatch door for dear life.\n\nThe newborn has a better grip -- it has more things to grip with but it \ntoo struggles with the sudden drop.\n\nANGLE: THE ATJRIGA\n\nSpeeding toward the earth.  The Betty SHOOTS out the airlock and nearly \nsmashes into the bottom of the ship as it passes, like trash thrown out \nof a speeding car.\n\nINT.  BETTY\n\nThe Akiriga passes, huge above them\n\nVRIESS\n\nLook out!\n\nCALL\n\nI am!\n\nEXT.  THE BETTY\n\nThe ship swerves as Call expertly avoids the Auriga -- and see Ripley \nand the newborn on top, still fighting for purchase\n\nThe Betty gets clear, leveling out --\n\nThe Auriga still heads straight for earth, as the terrain below becomes \nclear -\n\n- deserted, snow covered mountains\n\nANGLE: RIPLEY\n\nHanging on\n\nANGLE: CALL\n\nFighting to control the Betty\n\nANGLE:\tINSIDE THE AURIGA\n\nDeserted halls, passageways bodies, and,aliens milling here and there\n\nCALL\\SHIP\n\nCollision in six seconds ... five... four...\n\n(softly)\n\nHere we go...\n\nANGLE: THE ATJRIGA\n\nSMASHES INTO THE GROUND, a deafening exposion eating the massive ship \nin seconds, utter cacophony.\n\nANGLE: THE BETTY\n\nFlying away, the thundering firestorm behind it.\n\nANGLE: CALL\n\nAn instrument panel suddenly SPARKS beside her warning lights flash, \nthe ship shaking as if under massive turbulence\n\nCALL\n\nJohner!  Fire!\n\nVRIESS\n\nVector control's fucked! we gotta put down!\n\nCALL\n\nFind me a path!\n\nJohner sprays foam on the fire.  There is a loud BANGING heard far \noverhead.\n\nWhat the fuck is that?\n\nANGLE: RIPLEY\n\nis slamming her fist on the hatch doors, hanging on with her other arm.\n\nThe ship continues to tremble and buck -- she's nearly thrown off.\n\nRIPLEY\n\nGodamnit!\n\nShe looks around at the alien.  It's almost on her.\n\nWorking its way painfully toward her, gripping with its legs and \ntendrils.  Hissing.\n\nIt slams a tentacle down at Ripley, but she rolls, just holding on\n\nANGLE: JOHNER\n\nAbove the cockpit, looking at a fuzzy external monitor.\n\nJOHNER\n\nIt's Ripley!  Ripley's on the fucking hatch!\n\nIn the cockpit, Call nearly goes white.\n\nCALL\n\nLet her in!\n\nJOHNER\n\nFuck no!  There's something else out there with her!\n\nVRIESS\n\nOne of them.\n\nJohner looks at the image, realizes how masive the newborn is. \n\nAwed fear creeps into his voice: \n\nJOHNER\n\nNo. it's something else.\n\nFrustrated, Call jumps out of her seat.. Vriess fights to control the \nship as she  climbs up toward the hatch.\n\nVRIESS\n\nGoddamnit, Call!\n\nJohner grabs her, practically throws her at the monitor.\n\nJOHNER\n\nLook at that fucking thing!  We can't open up!\n\nThey both tumble as the ship jerks\n\nANGLE: RIPLEY\n\nIs bucked OFF THE SHIP\n\nbefore she grabs the newborn's tentacle, holds on to it --\n\nThe newborn SMASHES it against he ship, trying to shake her again -\n\n- she grabs an external grate and starts climbing painfully away.\n\nANGLE: CALL\n\nPushes Johner aside as she makes for the hatch release sequence.\n\nANGLE: VRIESS.\n\nDesperately pulling up as wooded, snowy mountains zoom dangerously \nclose below.\n\nANGLE: THE ALIEN\n\nTurns as the HATCH OPENS nearby, the door sliding slowly beast is torn \nbetween Ripley and this new distraction --\n\nRipley sees it too, starts climbing for it frantically, one on the \nnewborn.\n\nThe beast makes for the doorway -- and CALL POPS HALFWAY OUT pointing a \nGRENADE LAUNCHER  at the thing.. She BLASTS it once,  the beast roaring \nand starting back, hurt but not nearly enough.  Call fires again but \nthe ships rocking sends the shot wild.\n\nshe flies back for all of a second\n\nThe beast rears to attack but Ripley is at the hatch -- Call drags her \nin and closes the hatch, the beast just SLAMMING in it as it closes.\n\nINT.  THE BETTY\n\nRipley is hanging on Call, exhausted.\n\nAnother BANG on the hatch, and they can see the door starting to give.\n\nVRIESS\n\nCall!  NOW!\n\nCall and Ripley head into the cockpit.Johner continues looking at the \nvidscreen at the beast.\n\nVRIESS\n\nWe can't to do a vertical setdown! Braking systems are shot!\n\nCALL\n\nFind me a patch of land!  I'll put her down.\n\nCall jumps back into the pilot's seat by Vriess.  He pulls up hard on \nthe wheel, but the ship is still dangerously close to the ground.\n\nJOHNER\n\nThat thing isn't going anywhere!\n\nVRIESS\n\nJohner, strap in!  We're coming down hard!\n\nANGLE:     -BETTY  Approaches the rough, wooded terrain, just above the \ntrees.  Hits a relatively clear patch, touches down -- bounces back up \nand then down again\n\nANGLE: CALL\n\nFighting the wheel -- she can't pull it up hard enough.\n\nANGLE: THE BETTY\n\nThe ship blasts through trees.  The newborn moves to the back of the \nship to avoid debris.\n\nJOHNER\n\nThat things gone back behind the thrusters!\n\nCall and Ripley look at each other.\n\nRIPLEY\n\nHit it.\n\nCall throws on the thrusters, the ship ROCKETS forward   ANGLE: THE \nNEWBOM\n\nEngulfed in flame, losing its grip --\n\nTHE BETTY\n\nGoing too fast -- Call can't control it\n\nVRIESS\n\nKill thrust! Now!\n\nCall does.\n\nANGLE: THE BETTY\n\nSkids, skids, throwing up enormous debris.  It hits another wooded area\n\nRIPLEY\n\nis thrown bodily into the windshield --\n\nTHE BETTY\n\nmows down a half acre of trees before finally grinding to a halt.\n\nAs soon as they've recovered, Call throws off her seatbelt.\n\nCALL Is everbody all right-?\n\nJOHNER\n\nWhere're you going?\n\nCall opens the hatch.\n\nCALL\n\nTo make sure that thing is really dead\n\nIts giant face LUNGES down at her, piston tongue shooting out.\n\nIt has charred black skin -- in some places that skin has fallen off \nand wet pink flesh shows through.\n\nCall drops to the floor, the tongue just missing her.  Johner scrambles \nfor his gun as\n\nRipley drags her out of the way.\n\nAS quickly as it came, the head lurches back out.\n\nJOHNER\n\nI think it's gone!\n\nVRIESS\n\nNo, it's waiting for us to come out!\n\nCan we fly?\n\nVRIESS\n\nWe can't fucking crawl!\n\nRIPLEY\n\nIt's gone.\n\nCall looks at her.\n\nCALL \n\nAre you sure?\n\nJOHNER\n\nGood!  Great!\n\nCALL\n\nNo...\n\nCall grabs a grenade launcher.\n\nCALL\n\nI've got to stop it.\n\nVRIESS\n\nCall\n\nCALL\n\nThat thing is thirty minutes old!  In a few hours it'll grow up.  If it \nreaches a place with people...\n\nShe heads for the door but Ripley is on her way.  They exchange a look.\n\nRIPLEY\n\nYou'll never catch it.\n\nCall tosses her the grenade launcher.\n\nCUT TO: EXT.  BETTY - MOMENTS LATER\n\nThe ship sits silent in the woods, the trees around heavy with snow.\n\nRipley comes out the top.  She looks around her, sees the tracks in the \nsnow.\n\nHuge, loping.  She jumps.down off the ship.\n\nAnd runs.\n\nThrough the blur of trees, she moves with the grace and speed of an \nanimal, leaping from boulders, racing through the powdered brush this \nis Ripley at peak speed, and it is something to see.\n\nShe starts going up, the way getting steeper and rockier, til she \nreaches a cliff face, and looks out on:\n\nA CITY.\n\nSprawling, huge, a million tiny lights cutting through the darknes it's \njust before  the horizon.\n\nThe newborn RISES in front of Ripley, STRIKES her before she has a \nchance to aim her weapon.\n\nIts tentacle cuts deeply into her, sends her flying.\n\nThe beast is on her in a second, its enormous jaws missing her head by \nan inch as she rolls, grabs the grenade launcher, FIRE\n\nThe beast is thrown, but just grazed, back on her as she tries to get \noff another shot, it SLAMS a foot down RIGHT ON HER she SCREAMS, the \nlauncher rolls free, the beast coming in for the kill and over the \nridge FLIES THE HARVESTER, Call at the controls. aiming right  for the \nnewborn.\n\nIt rears up to see it just as the girl RAMS it into the creatures head, \nit knocks it on its ass, the harvester shaking but not quite spinning \nout, as Call comes around for another shot.\n\nRipley scrambles to safety as the Newborn prepares for the oncoming \nharvester, it whips its tentacles at it but Call swerves at the last \nsecond -- The monster spins with it, screaming, sees Ripley and slashes \nat her.  KNOCKS HER OFF THE CLIFF --\n\nShe falls, grabs brush it snaps -- she starts slinding down rockface \nand she takes her hand, SLAMS her fingers into the smooth rock face \nlike a pick axe -- it rips her nails bloody but she digs out purchase.\n\nANGLE: CALL\n\nSLAMS into the newborn from behind, the girl nearly thrown out of the \nharvester, the newborn spins and grabs it, Call throws it into reverse \nbut the newborn is too strong, holds on, bringing its head up to face \nCall herself.\n\nANGLE: RIPLEY'S\n\nBloody and torn, it SMASHES into the rockface, as she climbs back to \nthe top\n\nANGLE: THE NEWBORN\n\nSWINGS the harvester into a tree, Call nearly knocked loose again. The \nmonster is jolted as well, lets go, Call pilots the machine back \nthrough the trees, the alien watching it, growling --\n\nCall flies deftly through the trees, away, away, then spins out, heads \nback for the beast at TOP SPEED, the wind roars as she closes\n\nThe newborn spins and she SLAMS into it, it goes flying, screaming in \npain,  the harvester bouncing off it, flipping over, CRASHING against \nthe trees and landing tilted upside down, Call unconscious between it \nand the ground.\n\nThe newborn shudders, rises, makes for the harvester -- it clearly \npissed.\n\nRipley pulls herself over the ridge, sees the situation, rushes toward \nthem.\n\nCall awakens to see the monster approaching the machine.  Terrified, \nbut determined, she reaches for a lever\n\nRIPLEY\n\nNo! Over here!\n\nCalling out to distract it, she runs, waving her arms.\n\nCALL\n\nRipley!  Let it come!  Let it come!\n\nTears run through her voice as she strains for the lever. The beast is \ntorn, and for a  moment doesn't move.\n\nRipley looks over to where Call is, and understanding blooms on her \nface.\n\nShe looks around and spots:\n\nANGLE: THE GRENADE LAUNCHER\n\nHalfway between her and the newborn.\n\nFor a moment neither of them moves.  Then Ripley RUNS, the newborn \ncomes at her with equal speed, like they're playing chicken, Ripley \nDIVES at the ground, rolls, comes up holdin the grenade launcher, and \nshe FIPES!\n\nThe newborn is hit up close and dead center this time, and it rears \nback, screaming -\n\n- Ripley FIRES and FIRES, driving it back toward the upended harvester.\n\nThe alien rears up to its full height, and Ripley pulls.the trigger.  \nThere is a hollow click.\n\nFurious, Ripley stares a moment at the beast.  A SSCREAM wells up in \nher throat and she \n\nTHROWS herself at it, leaping impossibly high, smashing into it and \nsending both  of them tumbling onto the Harvester.\n\nCall pulls the lever.\n\nIn an instant the machine roars to life, a thousand blades grinding to \ntop speed, pulverizing the beast, consuming it, sucking it down as \nlayer upon layer of alien flesh is chopped into messes.\n\nAnd it SHRIEKS, a noise unheard before, as it thrashes frantically.\n\nRipley tries to pull herself off it before the blades get too close -- \nbut the beast grabs her, holds her.  The blades ever closer as she \nstruggles with it.\n\nANGLE: CALL\n\nStill trapped below, she sees the aliens blood seeping through the \nmachine all around her!\n\nShe squirms, trying to get away, but she's stuck.  A stream of blood \nlands on her shoulder, eating it away.  Another on her leg, and panic \nblooms, bright in her.\n\nCALL\n\nRIPLEY!\n\nGalvanized by the cry, Ripley TEARS herself out of the beast's dying \ngrasp, flips backwards off the Harvester as it begins to smoke and \nspark, blood eating through the controls.\n\nCall writhes, blood everywhere now.  She is lost in primal terror.\n\nRipley wriggles her way under, and, regardless of the streams of blood \nsplattering her, wrenchs Call free.  She drags her' out.\n\nA section of the harvester explodes, raining fire and debris or the \ndying alien.\n\nCall lies on the ground, Ripley behind her, arms wrapped tight around \nher.\n\nCovered in blood and grime, the two watch the alien go up in flames, \nbreathing hard,  holding each other as if their lives depended on it \nstill.\n\nDISSOLVE TO.- ANGLE: THE NEWBORN'S SKULL\n\nBurning, hollowed out by the licks of flame that caress it.  Collapsing \ngently on itself.\n\nWIDE ANGLE:\n\nEXT.  SAME - LATER\n\nThe four of them sit by the huge camp-fire, watching the flames.\n\nVriess tosses 'Christie a bottle of whiskey.\n\nJOHNER\n\nThe bitch takes her time in burning.\n\nVRIESS\n\nWell, it looks like she's finally giving it up.\n\nJOHNER\n\nTroopers should be finding our ship any time now. 1 don't much love the \nidea of being around when they do.\n\nRipley gets up, looks out over the cliffs edge at the lights the city.\n\nChristie offers the bottle to Call.  She takes it and drinks.\n\nVRIESS (to Call)\n\nI guess you won't want to be answering any official Questions either.\n\nCALL\n\nI guess not.\n\nShe is grateful for the suggestion that they are in it together.\n\nVRIESS \n\nWell, we're on Earth, for Chrissake. Plenty of places to get lost here.\n\nCALL\n\nSo I've heard.\n\nAfter a moment, she gets up as well, goes over to Ripley.  She hands \nher the bottle.\n\nRipley looks at it.\n\nCALL\n\nIt's a drink.  You drink it.\n\nRIPLEY (smiling) I remember. She drinks.\n\nCALL\n\nSo, what do you think?\n\nRIPLEY\n\nThink?\n\nCALL\n\nWhat should we do now?\n\nRIPLEY\n\nI don't know.\n\nShe looks out in the distance...\n\nRIPLEY I'm a stranger here myself\n\nThe two of them stand side by side staring out at the unfamiliar \nhorizon, as the newborn dwindles in the dancing flame.\n\n\n\nTHE END \n\n\n\n\nAlien: Resurrection\nWriters :   Joss Whedon\nGenres :   Action  Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:18:59.581780"}