{"title": "Alien vs. Predator", "film_link": "/Movie Scripts/Alien vs. Predator Script.html", "script_link": "/scripts/Alien-vs.-Predator.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Alien vs. Predator Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Alien vs. Predator Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/6-stars.gif\"/> (6.39 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Peter Briggs\" title=\"Scripts by Peter Briggs\">Peter Briggs</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/Alien-vs.-Predator.html\">Read \"Alien vs. Predator\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>Aliens vs. Predator\n\nDark Horse Prod. Presents\n\n<b>ALIENS\n</b>\nVs.\n\n<b>PREDATOR\n</b>\nScreenplay by Peter Briggs\n\n<b>EXT.  DEEP SPACE\n</b>\nWe OPEN on TOTAL BLACKNESS, a sea of stars spread across the infinite \ndepths of space.  As the TITLES ROLL, we notice that three of these \nspecks seem to be moving; one of them picking up acceleration and \nracing toward us.  Our perspective changes, and we catch a quick \nglimpse as it HURTLES past, and into the gravitational pull of a large \nbrownish planet.  Kicking up SPARKS of FRICTION as it hits atmosphere.  \nIt seems to be manmade.  Or at least artificial.\n\n<b>EXT.  PLANET SURFACE - DAY\n</b>\nThe planet is dead, barren.  Death Valley on a grand scale.  We watch \nthe object plummet through the wispy cloud-cover, emitting a few last \nburning embers before falling to ground way-off in the distance.  A \nBOOMING ECHO resonates across the dusty plains, before settling back \ninto an eerie silence.\n\n<b>EXT.  FISSURE CANYON - DAY\n</b>\nWe're looking into a deep gorge, dark and sinister.  A howling wind \nwhips dust into a sandstorm, reducing visibility to almost zero.  About \nseventy feet down there's a hole in the rock-face that just might be a \ncave entrance, and near is a peculiar SHIMMERING in the air.  We hear a \nmechanical BEEPING and the SHIMMERING disappears, replaced by FIVE \nhumanoid SHAPES clinging to the sheer rock - each well over seven feet \ntall.  They are PREDATORS, a race of intergalactic big-game hunters on \npermanent safari; their clothing and weaponry a bizarre mix of \naborigine and ultra-hi-tech.  In their hands are circular metal discs; \n'smart weapons' which cut into the stone and give them purchase.\n\n<b>PREDATOR-VISION.  \n</b>\nFrom their P.O.V., we see the fissure reduced to THERMAL HEAT SOURCES.  \nThe entrance registers as a black gaping void.\n\n<b>INT.  FISSURE NEST TUNNEL\n</b>\nThe five hunters climb inside the rim of the tunnel, out of the wind's \nbanshee wailing.  The lead PREDATOR reaches up to his headgear, pulling \nat the coupling pipes connecting it to a hidden breathing-apparatus.  \nHe removes the helmet, clips it to his rear utility pack, and takes a \ndeep breath of the air.  A curious speckled pattern runs across his \nwide forehead, marking him \ndifferent to the others; in addition, one of the fangs of his mandibles \nhas been sheared away.  We'll call him BROKEN TUSK, he's the leader of \nthe hunting party.  He reaches out a hand to caress the wall of the \ntunnel.\n\nSeveral feet in from the rim, it changes from rock to a textured \nbiomechanical surface; a swirling mass of disturbing shapes.  He \nhurries forward in response to the GURGLING-HISS of one of his team who \nhas found something.\n\nThe other PREDATOR holds a telescopic spear up for scrutiny.  Skewered \non the end is a shriveled FORM with eight spindly legs and a segmented \ntail; it's a FACEHUGGER, the first stage of the deadly ALIEN lifeform.  \nBROKEN TUSK HISSES a caution to his party; they respond by pulling \nspears and elaborately-shaped swords.  Several shoulder-mounted plasma \ncannons slide up to firing position, tracking with their owners' \nhelmets.  Thus armed, they move cautiously ahead...taking no chances.  \nOne helmeted PREDATOR pauses, scanning the area.\n\n<b>PREDATOR-VISION.  \n</b>\nHe switches through a variety of different views; infra-red, ultra-\nviolet, enhanced motion-tracking.  Nothing.\n\nHe's so pre-occupied with this task, he totally fails to notice the \nskeletal ALIEN loom up behind him, emerging from the biomechanical \ngrowth on the floor.  A barbed tail skewers the PREDATOR straight \nthrough the neck, splashing luminous blood across his chestplate.  A \ngargled DEATH-RATTLE issues from his throat, the band of PREDATORS \nspinning around in time to see him being dragged below the ground.  The \nband of extraterrestrial hunters have no time to come to his aid; they \nthemselves are set upon by a half-dozen ALIEN WARRIORS.  The carnage is \nswift and terrifying, a blur of motion.\n\nSteel blades and serrated biomechanical limbs scythe the air, alive \nwith the CRIES and HISSES of both adversaries.  One PREDATOR is pinned \nagainst the tunnel wall, his spear out of range.  The ALIEN claws away \nhis face mask, and he finds himself dodging the ALIEN's toothed tongue, \nextended toward him with pile-driver speed.  He reaches down, grasping \nthe 'smart-weapon' hanging from his belt and brings it up in an arc \nthat terminates at the ALIEN's grinning face.  Big mistake.  The two \nare in such close proximity that the ALIEN's acidic blood sprays across \nthe PREDATOR's head.  While their technology seems to be resistant to \nit, their bodies aren't:  the viscous yellow liquid begins burning into \nthe PREDATOR's skin.  He kicks the skeletal corpse away with a HIDEOUS \nPIERCING SCREAM, clawing at his seared face. \n\nIt all seems to be over as quickly as it began; there can be no \nquestion as to who were the victors.  The PREDATORS stand amidst a sea \nof biomechanical limbs strewn around like a charnel house.  As his \ncompanions begin to carefully decapitate the ALIEN skulls, BROKEN TUSK \nsteps over the corpses to examine his fallen comrades.  The first \nPREDATOR to be attacked was killed instantly; he crosses to the other.  \nWhat he finds causes him to react with\npity and disgust.  His fallen comrade is only just alive; mandibles \nclicking frailly, half his head burnt away.  BROKEN TUSK watches the \nailing PREDATOR slide a steel blade from it's sheath and offer it to \nhim.  He takes it, knowing what has to be done.  Rolling the knife \nquickly over the back of his hand - the sort of elaborate trick \nseasoned Green Berets perform - he plunges it downward into the fallen \nhunter.  This unpleasant task accomplished,\n\nBROKEN TUSK straightens up and activates his wrist-computer.  A dark \nshape blots out the light coming from the entrance; a small PREDATOR \nshuttlecraft, sleek and elegant.  It hovers in the air with little more \nthan a loud HUM, and extends a ramp.  The surviving PREDATORS leap \naboard, carrying their trophies with the reserved silence of men \nreturning from combat.\n\nOne more thing need to be done.  BROKEN TUSK bends down and flips a \nsequence of keys on the dead PREDATOR's wrist.  A countdown is \ndisplayed in some unknown character-set, accompanied by a HIGH PITCHED \nBEEPING.  He then turns and swiftly boards the craft which takes \nsmoothly to the air, it's undergear retracting.\n\n<b>EXT.  PLANET SURFACE - DAY\n</b>\nA white-hot fireball erupts out of the fissure, the result of the \nPREDATOR's suicide-destruct mechanism.  The shuttlecraft pulls quickly \naway, disappearing into the clouds.\n\n<b>EXT.  SPACE\n</b>\nA large spacecraft is suspended in orbit around the planet; the \nPREDATOR Mothership.  The shuttle heads swiftly towards it. \n\n\n<b>INT.  PREDATOR MOTHERSHIP - DOCKING BAY\n</b>\nAn airlock RUMBLES open and the PREDATORS file NOISILY into the \nMothership's docking bay.  An OLD PREDATOR crouched against a strut \ntakes time out from carving something into a block of wood to briefly \nlook up at them.  Like the PREDATORS themselves, the ship is a curious \nmixture of old and new.  An elaborate frieze written in alien script \nruns around the wall, with racks of sophisticated equipment recessed \ninto it.  Hatches lead off to various parts of the ship; we see BROKEN \nTUSK carry his ALIEN head off down one of them. \n\n<b>INT.  PREDATOR MOTHERSHIP - VIEWING GALLERY\n</b>\nThe gallery seems to be more mechanical than the rest of the ship.  \nBROKEN TUSK enters, pausing next to a kind of readout device:  a \ncylindrical tube containing a substance similar to mercury which \nconstantly changes it's mass into shapes and alien text.  He peers over \nthe protective railing. \n\nWHAT HE SEES is magnificent:  a captive QUEEN ALIEN, the nucleus of the \nALIEN society, fed by giant intravenous pipes.  Each of it's limbs is \ntethered by straining clamps preventing any movement.  To the rear, \nit's giant egg-sac glows and throbs, suspended by a jury-rigged sling.  \nA SCANNING MECHANISM hangs above the EGGS the QUEEN lays, seemingly \ndefying gravity.  As each EGG is scanned by a blue triangular beam - \nsimilar to a PREDATOR gun-sight - it becomes translucent, giving us a \nview of the pulsing FACEHUGGER inside.  This done, a manipulator are \ncarefully loads several eggs onto a pallet, which then sinks into a \nhatchway in the floor.  It's an assembly-line of almost frightening \nmechanical efficiency.\n\n<b>EXT.  SPACE\n</b>\nWe see a pod ejected from the Mothership, rocketing away from the \nplanet into deep space.  The inference is obvious; the PREDATORS are \nseeding worlds with ALIENS to hunt.\n\n<b>INT.  PREDATOR MOTHERSHIP - VIEWING GALLERY\n</b>\nThe blue beam slides across one of the eggs, and suddenly changes to \nred, BEEPING rapidly.  BROKEN TUSK sees the flowing display-tank alter \nfrom a rotating simulation of an ALIEN WARRIOR skull to a \nrepresentation of a QUEEN's head.  The manipulator arm swiftly grasps \nthe EGG in question and moves it over to a protrusion on the floor.  \nThe causes the QUEEN to go\nberserk, straining at her bonds and SHRIEKING ferociously.  She's \nobviously been through this before and knows what's about to happen.  \nThe protrusionsplits open, spilling out an intense white light:  an \nenergy-filled blast furnace.  The manipulator claw opens, the EGG drops \nin, and is no more.\n\n<b>INT.  PREDATOR MOTHERSHIP - LIVING QUARTERS\n</b>\nAn orange light plays across a wall of skulls, casting dark shadows \ninto long-empty orbs.  BROKEN TUSK sprawls lizard-like across a flat \nslab of rock in the center of the room, inspecting his formidable \narsenal of weaponry. Satisfied, he reaches out to run a finger across \nthe jaw of his ALIEN trophy in an almost-erotic gesture.  He regards it \nfor a long moment as if coming to a decision of some kind, before \nfinally getting to his feet. \n\n<b>INT.  PREDATOR MOTHERSHIP - VIEWING GALLERY\n</b>\nThe lights in the gallery are dimmer when BROKEN TUSK enters.  He \nwatches the cherry-red beam of the gliding SCANNING MECHANISM lock onto \none of the EGGS, then runs his hand in sequence over the control board.  \nThe manipulator arm swings over, seizing the egg and loading it onto a \nwaiting pallet. \n\nBROKEN TUSK points his finger at the QUEEN and makes a guttural \nCLICKING SOUND from deep in his throat.  The effect is not unlike that \nof a child firing an imaginary gun.  As if reading BROKEN TOOTH's \nthoughts, the QUEEN lifts her crested head upwards and emits a venomous \nHISS of contempt.\n\n<b>EXT.  SPACE\n</b>\nIn CENTER FRAME, the planet sits still and green, awash with nebulous \nclouds. A hulking METAL FORM ROLLS RIGHT-TO-LEFT across our view, \nsunlight glinting from it's surface.  It's a rectangular satellite-\nconstruction comprised of hundreds of communication dishes in a \nlatticework of steel tubing.  We hear FILTERED HUMAN VOICES O.S.  \nSubspace chatter.\n\n<b>EXT.  RYUSHI STATION - MIDDAY\n</b>\nImagine a world where every square mile is covered by a canopy of \ntreetop foliage, and you've just drawn yourself a picture of the planet \nRyushi.\n\nNestled amongst this lush rainforest is the Yutani-Templin \nCommunications Relay Station.  Several inverted-'U'-shaped suspension \ncranes painted bright yellow look down over a collection of \npreassembled buildings and roadways raised above the swamp on \nplatforms, much like a truncated oil-rig.  A navigation beacon flashes \nintermittently from a tall gantry tower above, while dominating the \nview is the sloping face of a communications array several storeyes \nhigh.  Off to one side of the platform is a gigantic many-wheeled \nhaulage vehicle.  A flock of bird-like creatures fly past.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nWe're in the dark womb of a split-level command center alive with \nclusters of video readouts, somewhat reminiscent of a futuristic air-\ntraffic control tower.  On the upper tier, a large circular holo-\ndisplay currently projects an image of the satellite we just saw.  Thin \ntrailers of paper flutter gently in the current coming from the air \nconditioning ducks, though beads of sweat still dot the foreheads of \nthe people manning the consoled here.  We move in on CASSIE DOLLANDER \nand ROB PARSONS, two monitoring technicians occupying a control bank.  \nCASSIE listens carefully to something on her headset. \n\n<b>CASSIE\n</b>Ah, negative on that request commercial freighter 'Nan-Shan'.  I've \nalready got an inbound on that approach pending a beacon-fix.  Hold on \nmy mark until I get back with some confirmation.  Rimward Traffic \nControl out.\n\nShe thumbs a button and leans over to PARSONS.\n\n<b>CASSIE (CONT'D)\n</b>How's it looking?\n\nPARSONS worriedly shakes his head.\n\n<b>PARSONS\n</b>That's the second time I ran it, and it still reads the same.\n\n<b>CASSIE\n</b>Better tell the boss.\n\nPARSONS pulls out a coin.\n\n<b>PARSONS\n</b>Toss you for it.\n\n<b>INT.  RYUSHI STATION - EXECUTIVE OFFICE\n</b>\nHIROKO NOGUCHI is sweating heavily, a black forelock of hair falling \nacross her Oriental features.  Her eyes flicker warily from side-to-\nside as she holds the smooth length of the sword before her, trying to \nassess from where the next attack will come.  She doesn't have to wait \nlong; two NINJA SWORDSMEN drop to the floor in front of her, striking \nwithout hesitation.\n\nShe expertly avoid the blows, parrying relentlessly.  A persistent TONE \nbegins to intrude O.S., like a telephone RINGING.  She tries to ignore \nit, but her concentration is clearly broken.  A THIRD SWORDSMAN appears \nfrom out of nowhere, his sword SWISHING towards her chest.  The blade \nplunges deep into her stomach, emerging from her back.  She glances \ndown in annoyed disbelief.\n\n<b>HIROKO\n</b>Fuck!  Holo off.\n\nThe SWORDSMEN immediately flicker and disappear.  She sheathes the \nsword with one precise movement and crosses the wooden paneled floor to \nher desk. Mopping her face with a towel, she thumbs a stud.  The \nRINGING TONE stops, the corporate logo on her flat-screen desk panel \nreplaced with a black girl's face.\n\n<b>HIROKO (CONT'D)\n</b>Noguchi.\n\nCASSIE  (O.S., onscreen)\nSomething just came up on Deep Space Tracking.\n\n<b>HIROKO\n</b>What kind of 'something'?\n\nCASSIE   (O.S., onscreen)\nEasier if you come down and look.\n\n<b>HIROKO\n</b>I'm on my way.\n\n<b>EXT.  RYUSHI STATION - MIDDAY\n</b>\nAn eight-wheeled articulated crawler rolls noisily through the rain, \nclimbing an access ramp leading from the swamp to the outpost's empty \nmain-street.  A group of rhinos - brown two-horned quadrupeds \nindigenous to Ryushi - restlessly stir in their corral at it's \napproach.  The crawler's pneumatics HISS gently as it comes to a halt, \nwhile somewhere off in the distance a dog BARKS.  \n\nDON KAMEN, a lean man in his forties. climbs down from the cab mounted \nfive feet above the ground and squints up at the main relay antenna. He \nadjusts the cowboy hat on his head against the drizzle and crosses the \nstreet towards one of the buildings, ignoring a Pepsi sign CREAKING in \nthe gentle breeze.  A glass-paneled door SWISHES automatically open \nbefore him. \n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nKAMEN steps into the command center, nodding familiarly to the DUTY \nPERSONNEL.  A long-haired labrador rushes up to KAMEN, wagging it's \ntail. Her name is BREWSTER.  She's the base mascot.  KAMEN reaches down \nand ruffles it's fur.  He climbs the few stairs to the monitoring tier, \npulling the French-plaited hair of ANNIE URIOSTE, an Italian systems-\nmechanic with her hands buried in a disassembled console.\n\n<b>URIOSTE\n</b>You didn't wipe your feet coming in.\n\n<b>KAMEN\n</b>Well, it's okay.  You didn't tell me it was monsoon season going out.\n\nPARSONS looks up at KAMEN and grins.\n\n<b>PARSONS\n</b>Hey, buenos dias, cowboy.  When d'you blow in?\n\nKAMEN places his hat on PARSONS' head and THUMPS it down.\n\n<b>KAMEN\n</b>Just got back.  Missed anything?\n\nURIOSTE   (snorts)\nYeah.  We're almost out of beer.\n\n<b>PARSONS\n</b>Ahh, don't pay any attention to Urioste. She's still pissed that \nNoguchi wouldn't let her go off on your hunting trip.\n\nKAMEN pours himself a cup of coffee from a BUBBLING percolator.\n\n<b>KAMEN\n</b>Wasn't my trip, I just did the driving. 'Sides, freezing my butt off \nout in the wet taking pot-shots at the local wildlife isn't my idea of \na good time, either.\n\nHe sips gingerly from the cup of scalding liquid.\n\n<b>PARSONS\n</b>Where'd you leave them?\n\n<b>KAMEN\n</b>Camped out by the navi-beacon out on Linson's Range.  They're making \ntheir own way back tomorrow.\n\n<b>CASSIE\n</b>MarsCo went belly-up on the Dow Jones.\n\n<b>KAMEN\n</b>Shit.  When?\n\n<b>CASSIE\n</b>Yesterday.  We got the Network feed from Gateway; it was the top story \non 'Sixty Seconds'.  Biggest market crash since twenty-four.\n\nKAMEN looks ill.\n\n<b>KAMEN\n</b>Fucking great.  I invested some money in them.\n\n<b>CASSIE\n</b>You win some, you loose some.\n\n<b>KAMEN\n</b>I lose 'em all, that's why I'm still out here on this rock.  Anything \nelse you wanna ruin my day with?\n\n<b>CASSIE\n</b>No, but I got something that might interest you.\n\nHIROKO enters, pulling on a leather jacket.\n\n<b>HIROKO\n</b>What've you got?\n\nKAMEN nods to her and receives a quick smile for his trouble.  They \nturn to watch the display clear, replaced with a computer simulation of \nthe neighboring solar system.\n\n<b>CASSIE\n</b>A pair of incomings.  They popped-up on the medium-range about thirteen \ntwenty-four local time.\n\n<b>PARSONS\n</b>We figured on it being a magnetic anomaly, but we ran a back-trace just \nto make sure.\n\n<b>CASSIE\n</b>Yeah.  Turns out they dropped straight out of hyperspace.\n\nThe simulation ZOOMS IN, revealing two unidentified objects heading \ntowards the planet in the center of the display.  Computer notations \naccompany them.\n\n<b>CASSIE (CONT'D)\n</b>Curious thing is, the mass detector says they're too small to carry a \ndeep-space drive.\n\n<b>HIROKO\n</b>Sounds like a couple of escape shuttles.\n\n<b>PARSONS\n</b>That's what we thought.\n\n<b>HIROKO\n</b>Have you got an updated Lloyds' Almanac to cross-reff them through?\n\n<b>PARSONS\n</b>Done it already.  Nothing matches.\n\n<b>CASSIE\n</b>And if you thought that was interesting, watch this...\n\nHIROKO watches the course of the two objects simultaneously change.\n\n<b>KAMEN\n</b>Jesus.\n\n<b>PARSONS\n</b>Yeah, exactly.  Those're pre-programmed course adjustments you're \nlooking at.\n\n<b>KAMEN\n</b>Tactical nukes, maybe?\n\nEverybody gives him a quick look, but nobody says anything.  It's \nobviously not an appealing thought.\n\n<b>HIROKO\n</b>Where're they headed?\n\n<b>CASSIE\n</b>We ran a trajectory simulation.  If they carry on along that path, it's \npossible they'll make intra-orbital insertion.\n\nThere's a great exhalation of breath, and everyone swaps significant \nglances. HIROKO seems worried.  She scratches her forehead.\n\n<b>HIROKO\n</b>I don't know what to make of this.  Get a copy of the telemetry relayed \nback to Antarctica Traffic Control.  Better alert the nearest RimCorp \nBase, too.\n\nPARSONS nods, suddenly serious.\n\n<b>PARSONS\n</b>Fort Powell.  What do we tell 'em?\n\n<b>HIROKO\n</b>Just give them the facts.  They can leap to their own conclusions.\n\n<b>EXT.  LINSON'S RANGE - SWAMP - AFTERNOON\n</b>\nDown here in the swamp, the trunks of magnificent trees terminate in \ngnarled roots and disappear into watery murk, much like a Louisiana \nbayou.  A group of attentive LEMUR-TYPE CREATURES suddenly bound for \ncover as a line of bullets THUDS into the wood nearby.  Seconds later, \na loud HUMMING NOISE intrudes O.S. and a pair of manta-ray-shaped \nhover-bikes with sleek lines and garnish decals SLAMS into FRAME \nsuspended two feet above the mire, their powerful turbines kicking-up a \nswirl of spray.  The two BIKERS skid to a halt and watch the CREATURES \nscatter.  ACKLAND and YORK - men who on Earth might be called \"good 'ol \nboys\" - are both riding one-handed; powerful hi-tech rifles gripped in \nthe other.\n\nYORK   (yelling)\nYou missed 'em, Ackland!\n\n<b>ACKLAND\n</b>Little fuckers move too fast.  Let's do a sweep and catch 'em on the \nother side.\n\nYORK nods his head, pulling his goggles down over his eyes.  The two \nbikes ROAR off in pursuit.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - AFTERNOON\n</b>\nUp on a mud-bank, at the base of a sturdy gantry tower with two \nblinking blue lights atop it, stands the camp.  It looks a little like \na Bedouin bivouac, but up-close we can see the techno-fitted details.  \nA hard-featured woman seated next to a solid-fuel burner sips from a \nmug, while her Vietnamese counterpart is manually loading large-caliber \nbullets into a belt-feed.  They \nwatch as ACKLAND and YORK roar past WHOOPING.  MINH scrambles out of \nthe way as a beer can lobbed by YORK CLATTERS to the ground near him. \n\n<b>MINH\n</b>Crazy idiots.\n\nBEAUVAIS cups her drink with both hands, assessing him.\n\n<b>BEAUVAIS\n</b>Ahhh, they're just letting off some steam; don't let 'em get to you.  \nAckland and York aren't such bad guys when you get to know 'em.  Just a \ncouple of weekend warriors...\n\nShe peers curiously at the clunky cartridges MINH's thumbing into the \nbelt feed.  On the ground next to him is a widebore weapon on an over-\nthe-shoulder guidance mechanism.\n\n<b>BEAUVAIS (CONT'D)\n</b>Nice howitzer you've got there.\n\n<b>MINH\n</b>Thanks.\n\n<b>BEAUVAIS\n</b>Good argument for gun-control.  What are you going after, rhino?\n\n<b>MINH\n</b>Nah.  I just wanna squeeze off a few rounds.  'Sides, they tagged the \nrhinos for the migration project, so they're protected.  They'll dock \nyou a month's pay for just mentioning it.\n\nHe peers into the belt and blows out some dirt.\n\n<b>MINH (CONT'D)\n</b>Sure wish there was something on this planet with a bit of fight in it, \nthough.\n\n<b>EXT.  DEEP SPACE\n</b>\nAgainst a sea of stars, a small metal shape HURTLES towards us, \nfollowed moments later by it's identical twin.\n\n<b>EXT.  RYUSHI STATION - BIG BERTHA - AFTERNOON\n</b>\nA strand of HIROKO's hair falls forward into her face, slick with rain.  \nShe brushes up at the miserable weather.  She and KAMEN are standing on \none of the twelve-feet-in-diameter wheels of the gargantuan haulage \nvehicle we saw outside the base earlier.  Up on the side of the cab is \npainted a Nordic Valkyrie with an impressive bustline, next to which is \nthe legend 'BIG BERTHA'.  Two mechanics, JAN GUTTIEREZ and KEVIN \nDILLER, watch KAMEN point something out to HIROKO from the vantage \npoint of KAMEN's crawler parked in the swamp nearby.\n\n<b>KAMEN\n</b>See that sheathing on the suspension? Eaten away.  Same thing with the \npumps on the base air purifiers.  The algae out here just isn't good on \nthese new plastics.\n\n<b>HIROKO\n</b>We haven't used Big Bertha since we relocated the generator module.  \nThat was four months ago.  I can't ask for them to keep bringing spares \nin on the shuttle, it's already costing too much as it is.\n\nKAMEN shrugs.\n\n<b>KAMEN\n</b>If you want these things kept in working condition, that's the only \nchoice you've got.\n\nDILLER leans in to murmur quietly to GUTTIEREZ.\n\n<b>DILLER\n</b>Maybe she wouldn't be so tetchy if she got laid every once-in-a-while.\n\n<b>GUTTIEREZ\n</b>You offering?\n\nA buzzer inside the crawler goes OFF.  DILLER gets up to answer.\n\n<b>DILLER\n</b>Nah.  Freeze my dick off.\n\nHIROKO shakes her head dubiously at KAMEN's comment.\n\n<b>HIROKO\n</b>I don't know.  I think we'll have to run it on a rota; one month down, \none month operational.\n\nDILLER leans out of the crawler's cab and calls across.\n\n<b>DILLER\n</b>Miss Noguchi!  You're wanted in admin.\n\n<b>HIROKO\n</b>Thanks.\n\nShe turns back to KAMEN.\n\n<b>HIROKO (CONT'D)\n</b>Let me sort this out and we'll go over the logistics in my office.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nHIROKO peers at the display with undisguised concern.  A sense of \nurgency buzzes around the room.\n\n<b>HIROKO (CONT'D)\n</b>When?\n\n<b>CASSIE\n</b>Seven minutes ago, the third course change in an hour.  Those incomings \nare going to skim past the communications platform just a little too \nclose for comfort.\n\n<b>HIROKO\n</b>Can we move it to a different orbit in time?\n\nPARSONS looks up from his board in harassment.\n\n<b>PARSONS\n</b>Already working on it.\n\n<b>HIROKO\n</b>Get off an all-bands emergency distress, and put it on a repeater.\n\nShe meets KAMEN's eyes.\n\n<b>HIROKO (CONT'D)\n</b>Looks like you were right.  Someone's lobbed a pair of smart-missiles \nat us.\n\nKAMEN shakes his head.\n\n<b>KAMEN\n</b>Relay station like us out in the middle of the boonies; why bother?  \nAll you're gonna do is punch a temporary hole in the traffic control \nnet.  That'd be small potatoes even for terrorists.\n\nPARSONS and CASSIE are all-business at the control board.\n\n<b>PARSONS\n</b>Can you patch me a temporary loop on DCMGS?\n\n<b>CASSIE\n</b>Okay, give me the numbers.\n\nShe flips a switch.  A nearby screen changes to display an orbital path \nsketched out in rectangular neon blocks.\n\n<b>EXT.  SPACE\n</b>\nA cluster of thruster rockets on one corner of the relay frame ignites, \nand the darkened bulk of the satellite begins to move.\n\n<b>EXT.  DEEP SPACE\n</b>\nThe two pods ROAR towards us at immense speed.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nThe two blips on the holo-board representing the pods make a marked \nalteration in their course.\n\n<b>PARSONS\n</b>They've changed their heading again.\n\n<b>HIROKO\n</b>Compensate!\n\n<b>PARSONS\n</b>Punch me in a solution for their delta-vee.\n\n<b>CASSIE\n</b>What do you need?\n\n<b>PARSONS\n</b>A three-second burn to port, on my mark.\n\n<b>CASSIE\n</b>It's on the board.\n\n<b>EXT.  SPACE\n</b>\nFramed against the green backdrop of Ryushi, the PREDATOR pods rocket \ntowards the communications platform.\n\n<b>CASSIE\n</b>Picking up velocity.\n\n<b>HIROKO\n</b>Match it!\n\nA bead of sweat trickles down PARSONS' temple.\n\n<b>PARSONS\n</b>Not gonna make it...\n\n<b>EXT.  DEEP SPACE\n</b>\nThe pod speeds THUNDEROUSLY into CAMERA, blotting out our view.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nOne of the two blips on the holo-display vanishes, and three-quarters \nof the monitors abruptly turn to static.  PARSONS curses.\n\n<b>PARSONS\n</b>Goddammit!\n\nHe pulls off his headset with weary resignation.\n\n<b>PARSONS (CONT'D)\n</b>We've lost the downlink.  It's gone.\n\n<b>EXT.  SPACE\n</b>\nThe mass of the satellite tumbles end-over-end.  A gaping rent is torn  \nthrough it; something sparks and flashes within.  The second pod \naccelerates off curving into the atmosphere.\n\n<b>EXT.  LINSON'S RANGE - RIVERBANK - DUSK\n</b>\nA SONIC THUNDERCRACK BOOMS overhead; YORK looks up in time to see an \nobject sear across the dusk sky.  He pulls his bike to a stationary \nhover.\n\n<b>YORK\n</b>Shit!  What's that?\n\nACKLAND has already dismounted as he watches the fireball hurtle to the \nground.  A BOOMING ECHO resonates across the forest, followed by a few \nplaintive SCREECHES from the planet's indigenous lifeforms, before \nsettling back into an eerie silence.\n\n<b>ACKLAND\n</b>Meteor, I guess.\n\nHe raises a set of compact field binoculars to his face.  THROUGH THEM \nhe sees a thin haze of smoke rising from the treetops.\n\n<b>ACKLAND\n</b>D'you feel any impact shock?\n\nYORK   (uncertain)\nNot really.\n\nHe lowers the binoculars and frowns.\n\n<b>ACKLAND\n</b>Me either.  I tell you, I used to be with a mining outfit on Callisto, \nand when something like that hits... believe me, you know about it.\n\n<b>YORK\n</b>Do you wanna head back and call it in?\n\nACKLAND   (hesitant)\nI dunno... I dunno.  Something about this feels funny.\n\nHe looks across at the plume of smoke snaking off into the sky.\n\n<b>ACKLAND (CONT'D)\n</b>That is the damndest impact I've ever saw...\n\n<b>EXT.  LINSON'S RANGE - IMPACT SIGHT - DUSK\n</b>\nThe earth around the crater-rim is charred and cracked; some of the \nsurrounding brush still aflame.  A SCORPION scuttles inquisitively to \nthe edge of the pit and stops, it's stinger twitching hesitantly.  We \nHEAR a LOW HUM, and the SOUND of METAL-ON-METAL.  Before the SCORPION \ncan decide what to do, it's fate is sealed.  A large METAL CLAW comes \ndown, crushing it in an instant.  A SECOND CLAW emerges, and a MACHINE \nheaves itself out of the hole, it's surface smoking with heat.  It \npauses for a BEAT like some giant tarantula seeking prey, them moves \npurposely outwards about twenty yards before halting.  A hatch on the \nunderside opens, and a complex delivery mechanism extends.  After a \nmoment there's a LOW CLUNK, and the mechanism retracts.  In it's place \nis an ALIEN EGG.  The MACHINE crawls off, vanishing into the long \nreeds.\n\n<b>EXT.  RYUSHI STATION - NIGHT\n</b>\nHIROKO sits on the front wheel of KAMEN's crawler, her knees pulled up \nto her chin, staring off into a thin mist that makes the night \nimpenetrable.  Behind and above, the lights of the cranes and the \ncommunications array strobe on-and-off.  Above the bar on the main \nstreet is a flicking neon sign erected after-the-fact, emblazoned with \nthe words \"TORCHY'S\".  The MUFFLED SOUNDS of MERRY-MAKING from within \nbecome momentarily louder, and HIROKO glances over to see it's \npressure-door CRASH back, disgorging several drunken people. KAMEN \nfollows them through.  He spots HIROKO and heads over.\n\n<b>KAMEN\n</b>Hey, boss.  Wondered where you'd gotten to.\n\n<b>HIROKO\n</b>I just... wanted to be put on my own for a while.  Clear my head.\n\n<b>KAMEN\n</b>Didn't feel like whoopin' it up with the rest of us blue collars, huh?\n\nShe shakes her head, and manages a smile.\n\n<b>HIROKO\n</b>I've got a lot of thinking to do.  'Sides, the room was getting too \ncrowded for me.\n\n<b>KAMEN\n</b>Not too much of the socializing type, then?\n\n<b>HIROKO\n</b>No, not really.  More sort of the  'claustrophobic' type.\n\nKAMEN LAUGHS.  HIROKO is straight-faced.\n\n<b>HIROKO (CONT'D)\n</b>I'm serious.  That's why I switched from orbiting to planetary \ninstallations.\n\n<b>KAMEN\n</b>Is that a fact.\n\n<b>HIROKO\n</b>Uh-huh.  Used to get it pretty bad.  I'd wake up in a cold sweat and \nwant to claw open a vacuum hatch.\n\n<b>KAMEN\n</b>How long you been out here for now, anyway?  Three months?\n\n<b>HIROKO\n</b>Four.\n\n<b>KAMEN\n</b>And before that?\n\n<b>HIROKO\n</b>Six month stint on Datus.\n\n<b>KAMEN\n</b>Only six?\n\n<b>HIROKO\n</b>What is this?  'Twenty Questions'?\n\n<b>KAMEN\n</b>Just curious.  There's a lot of talk goes around.\n\nHIROKO shrugs.  Thinks about it.\n\n<b>HIROKO\n</b>I don't know.  I guess I've just never found anywhere I really felt at \nhome.\n\nShe hugs her knees again, and suddenly looks a whole lot more at ease.  \nKAMEN spots a square glass balanced on one of the tire's wide treads.\n\n<b>KAMEN\n</b>What is that?\n\n<b>HIROKO\n</b>Real man' drink.\n\nShe offers the glass to him.  He takes it and sniff cautiously.\n\n<b>KAMEN\n</b>Seltzer?\n\n<b>HIROKO\n</b>Want some?\n\nKAMEN hands the glass back and raises his own bottle.\n\n<b>KAMEN\n</b>I'll stick with my own.\n\nHe sits with her and stares into the darkness.\n\n<b>HIROKO\n</b>Any luck raising Ackland's party?\n\n<b>KAMEN\n</b>Nothing.  With the satellite down, we can't transmit over the mountain \nrange. He's most likely sitting there wondering why he can't raise us.\n\n<b>HIROKO\n</b>First light, we'll take a chopper out there and tell them to head back.\n\n<b>KAMEN\n</b>'We'?  You wanna fly out there with me?\n\n<b>HIROKO\n</b>Sure.  Do me good to stretch my legs.\n\nHIROKO takes a sip of her drink, her brow furrowing.\n\n<b>HIROKO (CONT'D)\n</b>This whole thing's got me spooked.\n\nKAMEN hops off the wheel.\n\n<b>KAMEN\n</b>Don't worry about it.  If the Network goes by the book, like everyone \nfigures they will, a Marine gunboat from Powell'll drop-by for a look-\nsee in four-or-five days.  They can go poke around out there and find \nwhatever it was hit us.  All we've gotta do is sit tight.\n\n<b>HIROKO\n</b>Do you think Ackland'll sit tight?\n\n<b>KAMEN\n</b>There'd have to be a helluva good reason for him not to.\n\n<b>EXT.  SPACE\n</b>\nA peculiar blue scanning beam plays over the rotating mass of the \nincapacitated satellite, examining every section.  it comes to the rent \ntorn through it, and pauses.\n\nFROM THE SCANNER'S P.O.V., we see the structure of the satellite made \nup from a series of blue geodesic shapes.  The damage registers as a \ncold, black mass.\n\nThe beam switches off and the hovering PREDATOR shuttle turns smoothly \non it's axis, thrusting towards the planet. \n\n<b>EXT.  LINSON'S RANGE - IMPACT SITE - NIGHT\n</b>\nShafts of torch-light fan out above the thick foliage in the darkness.  \nYORK and ACKLAND wade through the chin-high reeds, cursing.\n\n<b>ACKLAND\n</b>Found anything?\n\nYORK looks down at his data-stick, a handheld torch with a multi-\npurpose readout screen.\n\n<b>YORK\n</b>Nada. No radiation... no movement... nothing.\n\n<b>ACKLAND\n</b>Well, just keep looking.  It's gotta be... whoa, Jesus!\n\nACKLAND falls toward onto something, and YORK comes running.\n\n<b>YORK\n</b>What is it?\n\nACKLAND steadies himself, and the two men shine their torches at the \nrhythmically-breathing SHAPE on the ground.\n\n<b>ACKLAND\n</b>It's a rhino.\n\n<b>YORK\n</b>Is it dead?\n\n<b>ACKLAND\n</b>No, it's still breathing.  Kinda clammy though.  Are you sure your \nstick's not broken.\n\nYORK looks at the data-stick again.\n\n<b>YORK\n</b>Yeah, it's fine.\n\n<b>ACKLAND\n</b>God, I hope that thing didn't bring down a virus.\n\n<b>YORK\n</b>I told you we... what's that?\n\nTheir torch beams PAN ACROSS a three-foot high ovular shape.\n\n<b>ACKLAND\n</b>Looks like a spore.  Fungus of some kind, maybe?\n\n<b>YORK\n</b>Bloody big if it is.  Top's open.\n\nACKLAND steps cautiously forward to shine his torch inside.\n\n<b>YORK (CONT'D)\n</b>Careful...\n\nThere's nothing inside.  ACKLAND looks disappointed.\n\n<b>ACKLAND\n</b>It's hollow.  Think our rhino must've ate something that didn't agree \nwith him.\n\nA heavy gust of air blows unexpectedly across the clearing with a \nBANSHEE HOWL, ruffling their hair.\n\n<b>YORK\n</b>Let's get back and call this in.\n\n<b>ACKLAND\n</b>Wait a minute.\n\nYORK reluctantly follows ACKLAND as he thrashes through the thinn ing \nfoliage, coming out at the rim of the impact crater.  It's beginning to \npartially collapse, water seeping in.  YORK runs his beam over \nsomething at the bottom of the shallow pit.\n\n<b>YORK\n</b>What is that... is that metal fragments?\n\nACKLAND's maybe getting a little nervous now.\n\n<b>ACKLAND\n</b>This is very fucking weird.\n\nHe sees the churned earth, and the muddy trail leading off into the \nbroken foliage.\n\n<b>ACKLAND (CONT'D)\n</b>It's like something came out of the crater and went that way...\n\nThere's a TINY CLICK, and ACKLAND looks over to see YORK taking the \nsafety off his rifle.  ACKLAND wordlessly unshoulders his too.  They \nstep around the crater and warily follow the ragged path to...\n\n<b>YORK\n</b>Another one?\n\nACKLAND prods this SECOND EGG with his gun.\n\n<b>ACKLAND\n</b>Yeah.  This's closed.\n\nThere's a CRACKLING NOISE, and the top of the EGG peels neatly open in \nfour sections.  The two men jump back in alarm, and YORK LAUGHS \nnervously. Something organic is pulsing inside.  ACKLAND cranes his \nneck forward for a better look...\n\nThere's an EXPLOSION of MOVEMENT.  A spindly shape with a long \nsegmented tail launches itself jack-in-a-box-style at ACKLAND.  It's a \nFACEHUGGER.  ACKLAND trips backwards, caught off-balance.  His finger \ninvoluntarily squeezes the trigger of his rifle as he falls.  A volley \nof shots describe and arc and  light up the night with a PERCUSSIVE \nBOOM, and we...\n\n<b>CUT TO\n</b>...A SHORT DISTANCE ACROSS THE CLEARING.  SOMETHING is watching them \nfrom the trees; something with a heat-vision P.O.V.  A PREDATOR.  We \nsee the flare of ACKLAND's gunshots, then SNAP IN to see the multi-\ncolored from of his body toppling over, trailing a purplish FACEHUGGER, \nbefore we... \n\n<b>CUT BACK TO\n</b>...One of ACKLAND's bullets taking a meaty chunk out of YORK's thigh as \nhe races forward to help his friend.  The HUGGER's tail is already \naround ACKLAND's throat, it's fingers scrabbling for purchase.  YORK \npulls at one set of digits, and manages to raise them for just an \ninstant.  What we see is horrific; the look of terror on ACKLAND's \nface, and the questing tendril on\nthe HUGGER's underside trying to force it's way between ACKLAND's lips.  \nIn a second, it's all over; the FACEHUGGER struggles free of YORK's \ngrasp, and clamps itself firmly on ACKLAND's face with a faint SUCKING \nSOUND.  YORK shivers, then uses his good leg to propel himself a few \nfeet away.  He watches the hapless Teamster go rigid, then stop moving \naltogether.\n\n<b>YORK\n</b>Oh, God; oh, shit; oh, God.\n\nThe FACEHUGGER's tail slithers tighter around ACKLAND's neck; and as \nYORK quickly retrieves his rifle, we...\n\n<b>CUT TO\n</b>A PREDATOR-VISION SHOT, watching the color-bloom of YORK dragging \nACKLAND's body away from the crater.  It CLOSES IN on the FACEHUGGER, \ngiving us a muted X-ray-type VIEW of circulatory fluid pumping around \nthe HUGGER and into ACKLAND.\n\nYORK's limping badly, a dark stain blossoming on his baggy fatigue \ntrousers. ACKLAND's not a small man, and the physical effort of hauling \nhim through the reeds makes him sweat profusely.  There's movement on \nthe ground, and YORK sees why; one of the LEMURS has fallen victim to \nanother FACEHUGGER, which dwarfs it's small furry body.  The HUGGER's \nfingers all ripple simultaneously as it strengthens it's hold; the \nmovement akin to somebody drumming their\nfingers on a table-top.\n\n<b>EXT.  LINSON'S RANGE - RIVER BANK - NIGHT\n</b>\nAs YORK hauls ACKLAND onto one of the bikes, he hears a TICKING SOUND \nfrom the trees, like an engine cooling on a warm summer's day.  YORK \nclutches his rifle and stares upward.  There seems to be a VAGUE \nSHIMMERING FORM in the bough of a tree.  Although it might be a trick \nof the light, he isn't sticking around to find out.  YORK guns the bike \nto life and ROARS off above the swamp.\n\n<b>EXT.  LINSON'S RANGE - IMPACT SITE - NIGHT\n</b>\n<b>PREDATOR-VISION.  \n</b>We're looking at the site in colours:  the cold blue of empty ALIEN \nEGGS, and the warm reds of just-breathing ANIMALS rendered inert the \nFACEHUGGER parasites.\n\nA group of PREDATORS appear in three-dimensional solidity, their \ncamouflage cloaks deactivated.  The LEAD PREDATOR SPLASHES across to \nthe exposed roots of a tree and kneels down to examine an ANIMAL CORPSE \ncurled up there.  Most of it has been madly mutilated by something \nerupting from inside it's body. The PREDATOR looks up and scans the \nswamp, ignoring the swarm of FLIES buzzing in the air.\n\n<b>PREDATOR-VISION.  \n</b>This time, an oscillating line appears to the left of our view, and a \nband sweeps quickly ACROSS the screen synchronous to us hearing \ndifferent levels of SOUND STATIC.  This abruptly stops as the \noscillating line begins to moves in peaks and valleys.  The PREDATOR is \npicking up radio\nwaves.  A HUMAN VOICE; albeit grossly-distorted.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - NIGHT\n</b>\nWe hear a RAPID BEEPING; movement-sensors set up on tripods to warn \nagainst intruding animals.  The sound brings BEAUVAIS out of her tent, \nbleary-eyed and fumbling with her pistol.  She's suddenly wide awake \nwhen she sees YORK's hover-bike, lit by the sensors' flashing red \nstrobe.  It skids to a halt against a mud-bank, sending up a spray of \nsilt.  YORK climbs off the bike and stumbles, then starts to unfasten \nthe straps holding ACKLAND's body.\n\n<b>BEAUVAIS\n</b>Jesus Christ!  What happened?\n\n<b>YORK\n</b>Give me a hand with Ack.\n\nShe races over to help YORK ease ACKLAND up.\n\n<b>BEAUVAIS\n</b>How bad is... oh my God.\n\nAs ACKLAND is turned over, BEAUVIAS gets her first look at a \nFACEHUGGER. She shies away, repulsed. \n\n<b>BEAUVAIS\n</b>What is that?\n\n<b>YORK\n</b>Don't... uuh... don't know.  Help me... uuh... help me get him inside.  \nShit!\n\nYORK grits his teeth, but the leg injury is too painful.  He slumps \nslowly to the floor.\n\nBEAUVAIS   (yelling)\nMinh!  Minh, get out here!\n\n<b>INT.  TENT - NIGHT\n</b>\nA portable neon light in the tent flickers, casting staccato bluish \nlight over ACKLAND and the FACEHUGGER.  MINH and BEAUVAIS stare at it \nin horrified fascination, while YORK pulls a tourniquet around his \nthigh.  He winces. \n\n<b>BEAUVAIS\n</b>Have you tried prising it off?\n\nYORK shakes his head.\n\n<b>YORK\n</b>I wanted to get him back here; get him back to base.\n\n<b>MINH\n</b>Forget it.  We lost the satellite link. It's dead.\n\nThere's a long pause while everyone considers the options.\n\n<b>BEAUVAIS\n</b>We've got no option.  We're gonna have to get it off.\n\n<b>MINH\n</b>Oh man...\n\n<b>YORK\n</b>Get real, Beauvais!  That thing might chew his fucking face off for all \nbe know!\n\nThe motion sensor outside begins BEEPING again.  MINH catches BEAUVAIS' \nhead-jerk.\n\n<b>BEAUVAIS\n</b>Minh...\n\n<b>MINH\n</b>Yep...\n\nMINH hefts his 'howitzer' and leaves the tent.  BEAUVAIS rounds on \nYORK, continuing.\n\n<b>BEAUVAIS\n</b>How do you know it's not already?\n\n<b>YORK\n</b>I don't, but I think we should just wait and let the Doc take a look...\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - NIGHT\n</b>\nMINH walks towards a line of flashing red strobes at the perimeter of \nthe camp, the barrel of his weapon pointing casually forward.  He \nstudies the surrounding darkness.  There's nothing out there.  He \nshakes his head in \ndisgust.\n\nMINH   (muttering)\nTake a goddamn wrench to those things...\n\nHe thumbs a stud on the top of the 'howitzer'.  There's a gentle WHINE, \nand the HISS of hydraulic cylinders as the harness mechanism lifts the \nweapon up. It darts quickly to-and-fro; a mechanical snake seeking a \ntarget.  We see MINH's hand in CLOSE UP.  In addition to the firing \ntrigger, there's also a thumb button.  He squeezes it...\n\nThe gun swings sharply around in a blinding movement, tracking \nsomething automatically.  There's a THUNDEROUS RUMBLE as it fires-off \nthree shots in rapid succession.  Something that was only yards from \nMINH APPEARS and is blown backwards to CRASH against a tree bole, a \nmass of luminous green liquid and motion.\n\nMINH (CONT'D)  (dumbstruck)\nGod.\n\nMINH watches the helmeted PREDATOR fall face down into the water with a \nSPLASH, then lie motionless.  YORK and BEAUVAIS are out of the tent in \nan instant.\n\n<b>PREDATOR-VISION. \n</b>Three humans; in motion and 'hot'.  The triangular mechanism of the \nPREDATOR's gun locks onto MINH.\n\nA BLAST of plasma-energy rips a gaping hole through MINH's body, \nspraying blood across YORK.  He topples dead to the ground, a look of \npained surprise on his face.  BEAUVAIS is there immediately, racing \nacross and scrabbling for the 'howitzer'.  She doesn't have time to \ntake the harness off - she just slides her finger through the trigger \nguard and starts squeezing off random shots.  The air shimmers as an \nunseen shape races at her.  There's a loud\n\nSWISH of sliding metal, and a telescopic spear appears out of thin air.  \nIt SLAMS through BEAUVAIS' body, lifting her off the ground and \nimpaling her against a tree.\n\nYORK watches in horror as BEAUVAIS' arms thrash around.  A moment later \nher struggles cease, and she'd dropped to the floor like a broken \nmarionette. There's a CRACKLING SOUND, and the hazy air around BEAUVAIS \ndisappears.  In it's place is a PREDATOR, a luminous green patch \ntrickling from a wound on it's arm.  It's head flicks around as it \nzeroes-in on YORK, the three red dots of the PREDATOR's cannon \nfollowing suit.  YORK's quick though, already up and running when the \nplasma bolt EXPLODES into the tree despite the pain in his leg.\n\nHis options are limited.  The hover-bike is nearby.  He sprints for \nthat and his luck holds...the key's still in the ignition.  He flips \nit.  The engine COUGHS and then dies.  YORK looks up.  The wounded \nPREDATOR bounds across the clearing at frightened speed.  YORK turns \nthe key again, but the PREDATOR's almost upon him.  The creature WHIPS \nan ornately-shaped lance from it's back and thrusts it...JUST AS THE \nENGINE ROARS TO LIFE AND THE HOVER-BIKE RISES FROM THE MUD!  The blade \nslices into the bike's body and jams there, while one of it's manta-\nwings SMACKS into the PREDATOR's jaw, sending it reeling backwards into \nthe swamp.\n\nYORK swivels the bike on it's axis as another plasma-bolt rips into the \nrear, melting away a sizable chunk of the bodywork.  He sees a PREDATOR \nhanding from a tree, and the SHIMMERING of two more PREDATORS in their \ncamouflage nearby.  He's not sticking around to argue though.  YORK \njams the throttle hard and the bike shoots off into the bayou as more \ncannon-blasts blossom around him.\n\nThe group of PREDATORS appear in the camp and cautiously survey the \narea. The LEAD PREDATOR - the one with the distinctive armor - crosses \nto the tent and opens the entry flap.\n\n<b>INT.  TENT - NIGHT\n</b>\n<b>PREDATOR-VISION. \n</b>The extraterrestrial hunter scrutinizes the pulsing FACEHUGGER on \nACKLAND for a long moment, but takes no further action.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - NIGHT\n</b>\nWe PAN SLOWLY ACROSS the deserted campsite.  There isn't a soul there, \nhuman or otherwise.  The wind whistles eerily through the tree-boughs. \n\n<b>EXT.  RAINFOREST AIRSPACE - DAWN\n</b>\nFirst light the next day, the sun rising on the horizon.  A 'chopper' - \nactually a twin-turbine heli-jet - flies in low above the veil of mist \nhanging over the treetops.\n\n<b>INT.  CHOPPER - DAWN\n</b>\nThe cockpit is small, a two-seater with room for cargo in the back.  \nKAMEN's in the pilot seat, and HIROKO's riding shotgun.  The controls \nmoving by themselves, on autopilot.  A REPETITIVE BEEPING causes KAMEN \nto look up from his magazine.\n\n<b>KAMEN'S P.O.V.\n</b>From out of the window of the 'chopper', we see the twin blue lights of \nthe navigation beacon blinking on-and-off above the trees.\n\nKAMEN nudges HIROKO awake.\n\n<b>KAMEN\n</b>Wake up.  We're at the beacon.\n\nHe switches the controls over to manual and takes the chopper down.  \nHIROKO rubs the sleep from her eyes.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - DAWN\n</b>\nTwin searchlights on the underside of the descending chopper sweep \nacross the clearing.  The encampment has been wrecked, much of is \nreduced to a twisted tangle of smoking debris.  All-terrain gear lowers \nfrom the chopper, as it makes a watery landing in the swamp.\n\n<b>INT.  CHOPPER - DAWN\n</b>\nKAMEN and HIROKO stare at the site in disbelief.  KAMEN hauls an \nautomatic pulse-rifle from the rear. \n\n<b>KAMEN\n</b>Looks like trouble.\n\nKAMEN reaches under the pilot's seat and pulls out a hand-pistol.  \nPasses it to her.\n\n<b>KAMEN (CONT'D)\n</b>Used one of these before?\n\nHIROKO coolly examines it.\n\n<b>HIROKO\n</b>Fabrique Nationale tactical autoloader. Uses twelve mill hollow 'O' \nrounds, with through the barrel smart laser-sighting. Sure, I can \nhandle this.\n\nHIROKO's show-boating and KAMEN knows it, but he still can't help being \na little bit impressed.\n\n<b>KAMEN\n</b>Okay.  Watch were you point it...\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - DAWN\n</b>\nThe two of them pick their way across mangled tripods and charred \ncanvas. Part of the bivouac has collapsed - one of the guide ropes has \nburned through.\n\nHIROKO   (quietly)\nSomebody picked an argument.\n\n<b>KAMEN\n</b>Yeah.  Somebody won.\n\n<b>HIROKO\n</b>Check out the tent.\n\nKAMEN nods and heads off that way, while HIROKO carefully inspects the \nwreckage dotted around the perimeter.\n\n<b>INT.  TENT - DAWN\n</b>\nKAMEN opens the tent flap and peers inside.  ACKLAND's on the cot, \nsweating heavily.  There is no sign of the FACEHUGGER.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - DAWN\n</b>\nAcross the clearing, HIROKO turns a piece of charred plating over in \nher hands before discarding it.\n\nHer foot slips on an object sunk into the soft mud.  It's MINH's \n'howitzer'. A dark slippery patch coats the metal.  She crouches down \nand rubs her fingers through it.  Blood.  KAMEN's VOICE intrudes, O.S.\n\n<b>KAMEN   (O.S.)\n</b>I've found Ackland!\n\n<b>HIROKO\n</b>Hold on...\n\nShe begins to cross the camp, and her foot catches on a taut length of \nrope. SOMETHING swings down from the trees, hitting her squarely in the \nface and knocking her off her feet.  HIROKO CRIES OUT in fear and \nsurprise, then freezes at what she sees.\n\nTwo bloodied bodies dangle head-first from the bough overhead; BEAUVAIS \nand MINH.  Each has been skinned and is beyond recognition.  KAMEN \nhears her exclamation and is out of the tent in an instant.  He stops \nin his tracks.\n\n<b>KAMEN\n</b>Jesus palomino...\n\n<b>EXT.  RYUSHI STATION - HELI-JET PAD - MORNING\n</b>\nIt's raining again at the base.  Under cover of an overhang, HIROKO \nwatches as ACKLAND is trundled away from the 'chopper' on a paramedic \ntrolley by GUTTIEREZ and DOC REVNA, an Indian woman in her late \nthirties.  As KAMEN slams the 'chopper's side door, we see that HIROKO \nhas left her leather jacket on the passenger seat.  KAMEN runs after \nREVNA clutching a clear plastic bag.\n\n<b>KAMEN\n</b>Wait a minute, Doc...\n\nHe hands the bag over to REVNA.  She peers at the contents curiously.  \nThe FACEHUGGER is inside, stiff and shriveled. \n\n<b>REVNA\n</b>Is this it?\n\n<b>KAMEN\n</b>Yeah.  Found it curled up in a corner of the tent.  Any idea?\n\nREVNA shakes her head.\n\n<b>REVNA\n</b>Never come across one of these before. Maybe the original survey team \ndid.  I'll run it through records and see what comes up.\n\nGUTTIEREZ checks that ACKLAND's body's secure on the trolley.  KAMEN \nraps him on the back to get his attention.\n\n<b>KAMEN\n</b>Hey, Jan.  See if you can get someone to check out the chopper.\n\n<b>GUTTIEREZ\n</b>What's the problem?\n\n<b>KAMEN\n</b>She was running a little sluggish on the way back.  Think the turbines \nmight be playing up.\n\n<b>GUTTIEREZ\n</b>Give me twenty minutes and I'll do it myself.\n\n<b>KAMEN\n</b>Appreciate that.\n\nREVNA interrupts.\n\n<b>REVNA\n</b>Where're the bodies?\n\n<b>HIROKO\n</b>Bagged and in the back.  They're not a pretty sight.\n\nACKLAND is wheeled into a freight elevator.  As KAMEN and HIROKO walk \naway across the rain-swept platform, a SHIMMERING FROM detaches itself \nfrom the rear of the chopper and lowers itself to the heli-jet pad. \n\n<b>PREDATOR-VISION.\n</b>A newly-arrived PREDATOR scans the towers and modules of the relay-\nstation with great interest.  An oscillating red line appears to the \nLEFT of the SHOT as the PREDATOR analyses HIROKO's voice-pattern.\n\nPREDATOR   (O.S., distorted)\nNot a pretty sight.  Not a pretty sight...\n\nHe reaches down to his wrist computer and activates it.\n\n<b>EXT.  LINSON'S RANGE - IMPACT SIGHT - DAY\n</b>\nUnder the cathedral-like light filtering through the trees above, a row \nof metal spikes have been driven into the earth.  Four are topped with \nstill-smoking ALIEN skulls.  Two and empty.\n\n<b>PREDATOR-VISION.  \n</b>A newly decapitated ALIEN head is turned around in another PREDATOR's \nhands in admiration.  This PREDATOR thrusts his trophy onto the next \nspike, then stares at the vacant one for a long moment.  His wrist \ncomputer BLEEPS for attention...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nWith nothing to do, most of the screens are out and the remaining \npersonnel bored.  PARSONS is reading a magazine with his feet up on the \nconsole, uninterested in HIROKO and KAMEN's conversation nearby. \n\n<b>HIROKO\n</b>I'm going to need you to co-sign the report.  Until we come up with \nsomething, this'll be treated as first degree murder.\n\n<b>KAMEN\n</b>Agreed.\n\n<b>HIROKO\n</b>When we get the link back, and I send this in, I.C.C.'ll throw a fit.\n\n<b>KAMEN\n</b>Ah, don't worry about I.C.C.  They're the least of your problems right \nnow.\n\n<b>HIROKO\n</b>What do you mean?\n\nURIOSTE walks up, very serious.  She interrupts.\n\n<b>URIOSTE\n</b>Sorry.  Can I have a word?\n\n<b>HIROKO\n</b>Sure.  What's up?\n\n<b>URIOSTE\n</b>Three-Pump failed a half-hour ago.  The algae must have clogged up an \nintake duct.\n\n<b>KAMEN\n</b>Think I spoke too soon...\n\n<b>HIROKO\n</b>Again?  How long before we start noticing the difference?\n\n<b>URIOSTE\n</b>I reckon it'll be another day before the smell gets unbearable.  \nBeauvais usually fixes it, but... ah...\n\nHIROKO knows what she means.  BEAUVAIS is dead.\n\n<b>HIROKO\n</b>Can you handle it?\n\n<b>URIOSTE\n</b>Sure, I can manage.  But I'm not going into the Pit on my own.\n\nHIROKO   (to Urioste)\nAlright, get somebody from the auto-shop.   (to Kamen)   Is that \nalright?\n\n<b>KAMEN\n</b>Yeah, no problem.  Ask Diller, he's good with his hands.\n\nURIOSTE exchanges a grin with CASSIE.\n\n<b>CASSIE\n</b>I'll go along with that.\n\nA SHRILL TRILLING from his console communicator makes PARSONS leap up \nto answer.\n\n<b>PARSONS\n</b>Parsons.   (long beat)   Yeah.  Hold on.\n\n<b>INT.  RYUSHI STATION - INFIRMARY\n</b>\nA CLOSE UP of an eye, bright blue and dilated.  DOC REVNA's shining a \nhand- held light into ACKLAND's face.  ACKLAND's regained \nconsciousness, but is far from happy.  He's sitting on the edge of a \ncot in the base Infirmary, an antiseptic room full of automated medical \nequipment.  The Autodoc is suspended from the ceiling nearby, a \ncircular cluster of sophisticated manipulator arms tipped with cutting \nblades and surgical paraphernalia.\n\n<b>ACKLAND\n</b>Hey, c'mon Doc, I feel fine.  Really.\n\nREVNA flicks off the probe.\n\n<b>REVNA\n</b>Headache?  Dehydration?\n\n<b>ACKLAND\n</b>The head's okay, but I could sink a six-pack.\n\n<b>REVNA\n</b>Forget that.  I want you off alcohol for at least seventy-two hours.  \nI've got some toxin build-up tests still to run.\n\nREVNA shakes her head and turns to KAMEN.\n\n<b>REVNA (CONT'D)\n</b>He's broken a fever that would kill a mule, but if he says he's alright \nI'm prepared to believe him.  He's all yours.\n\nHIROKO enters.  She watches from behind KAMEN.\n\n<b>KAMEN\n</b>What happened out there, Ack?\n\nACKLAND   (consternated)\nWhat do you mean, 'what happened'?  What am I doing back here?  Where's \nYork?\n\nHIROKO   (insistent)\nWhat's the last thing you can remember?\n\nACKLAND thinks hard.\n\n<b>ACKLAND\n</b>We... watched a meteor hit over Linson's.\n\nHIROKO and KAMEN exchange significant glances.\n\n<b>HIROKO\n</b>A meteor?\n\n<b>ACKLAND\n</b>Yeah, it impacted really off.  We went out to the crash-site... and... \nuh... that's... that's all.\n\n<b>KAMEN\n</b>Nothing else?\n\n<b>ACKLAND\n</b>No.\n\nKAMEN turns to REVNA.\n\n<b>KAMEN\n</b>Show him 'Fido'.\n\nREVNA pulls out a cylindrical glass stasis tube from a wall rack.  She \nhands it to ACKLAND.  He studies the dead FACEHUGGER floating inside \nwith morbid fascination.\n\n<b>REVNA\n</b>Ring any bells?\n\nACKLAND tries hard to think, but it's as if a wall's slammed down hard \non his mind.\n\n<b>ACKLAND\n</b>Not really, no.  Ugly little sonuvabitch. What is it?\n\n<b>KAMEN\n</b>We thought you might be able to tell us. I found it by your cot at the \ncamp.  You were out cold.\n\n<b>ACKLAND\n</b>What did York say?\n\n<b>HIROKO\n</b>York's vanished.\n\n<b>ACKLAND\n</b>Vanished?\n\n<b>HIROKO\n</b>Beauvais and Minh are dead, Ackland.  York's gone awol, unless you can \nhelp us go some way toward disproving our suspicion, he's the prime \nsuspect right now.\n\nThe news hits ACKLAND hard.  He falters and leans back, addressing \n<b>REVNA.\n</b>\n<b>ACKLAND\n</b>Can I... um... have some water?  Please?\n\n<b>REVNA\n</b>Sure.\n\nShe goes to fetch a cup.\n\n<b>INT.  RYUSHI STATION - COMMISSARY\n</b>\nIt's lunchtime, and the SOUND of machinery STEAMING food mixes with the \nCHATTER of the twenty-or-so personnel eating there.  HIROKO and KAMEN \nare deep in conversation across a table.\n\n<b>KAMEN\n</b>Do you believe him?\n\n<b>HIROKO\n</b>Ackland?  I don't know him well enough to say.  If we were back on \nEarth we could run him though an Aldhoven test and find out for sure.  \nThere's not much we can do out here.\n\nKAMEN stares hard at her.  That's not much of an answer, and HIROKO \nknows it. She capitulates.\n\n<b>HIROKO (CONT'D)\n</b>Alright then, For what it's worth... yes, I do.\n\nKAMEN digs appreciatively into a container of food with his fork.\n\n<b>KAMEN\n</b>You should try this seasoned stuff.  It's good.\n\nGUTTIEREZ approaches the table carrying something.\n\n<b>GUTTIEREZ\n</b>Got a present for you.\n\nHe hands HIROKO's leather jacket over to her.\n\n<b>HIROKO\n</b>Oh, I've been looking for this!  Where was it?\n\n<b>GUTTIEREZ\n</b>You left it in the chopper.  Oh, and before I forget, Don?  I ran that \ntest you wanted on the turbines.\n\n<b>KAMEN\n</b>And...?\n\n<b>GUTTIEREZ\n</b>And, nothing.  They checked out just fine.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - AFTERNOON\n</b>\nA metal rail surrounds the perimeter of the platform.  DILLER leans \nagainst it down by the access ramp, smoking a cigarette and idly \nblowing rings into the air.  BREWSTER pricks up her years and begins to \nquietly SNARL.  DILLER glances down at her curiously.\n\n<b>DILLER\n</b>What's the matter, girl?  You smell something?\n\nNow the rhino are restless too.  CASSIE walks across the concrete \nroadway to join them.\n\n<b>CASSIE\n</b>Rhinos look a little antsy,\n\nBREWSTER stops SNARLS and progresses onwards to full-fledged BARKING.\n\n<b>DILLER\n</b>Yeah.  Never seem 'em act like this before.\n\n<b>PREDATOR-VISION.  \n</b>CASSIE and DILLER are 'warm', but the rhinos are BREWSTER are 'hotter' \nstill.  Their VOICES and BREWSTER's BARKS are filtered to the point of \nunrecognizability, eerily distorted.\n\nCASSIE's the first to hear the SOUND.\n\n<b>CASSIE\n</b>Do you hear that?\n\nDILLER straightens up, looking out into the surrounding trees.  It's a \nFAINT HUM, getting LOUDER every second.\n\n<b>DILLER\n</b>Yeah...\n\nA hoverbike appears, trailing smoke from one of it's turbine intakes as \nit hurtles towards the base.  Halfway between the trees and the ramp, \nit clips a fallen log and spins end-over-end.  It's rider flies through \nthe air and hits the swamp face-first.  DILLER and CASSIE race down the \nramp with BREWSTER YELPING excitedly in the lead.\n\n<b>CASSIE\n</b>I don't believe it.\n\nDILLER splashes through the swamp and pulls the limp body out of the \nmire. It's YORK.  Blood has caked around his wounded leg.\n\n<b>DILLER\n</b>He looks in a bad way.  Help me get him up to Infirmary.\n\n<b>CASSIE\n</b>Wait a minute...\n\nSomething else has caught CASSIE's eye.  A \"something\" almost two \nmetres in length protruding from the rear of the wrecked hoverbike.  \nGrasping the haft firmly, she works it free.  CASSIE examines the \nPREDATOR spear, and slowly shakes her head.\n\n<b>CASSIE (CONT'D)\n</b>Holy Mary...\n\n<b>PREDATOR-VISION.\n</b>The concealed hunter watches as the colorised human curiously turns the \nweapon over in her hands.\n\n<b>INT.  RYUSHI STATION - INFIRMARY\n</b>\nREVNA sits at a desk and peers into a microscope.  Every so often she \nGRUNTS in satisfaction and types something into her computer terminal.  \nThe stasis tube containing the dead FACEHUGGER stands to one side of \nthe computer screen.  The Infirmary is very quiet, and only the gentle \nTHROB of the air-conditioning intrudes.  ACKLAND tosses uncomfortably \non his cot.  He finally sits up and massages his chest.\n\n<b>ACKLAND\n</b>Oh.  Oh God...\n\nREVNA lowers her pen and looks across.\n\n<b>REVNA\n</b>What is it?\n\n<b>ACKLAND\n</b>It's nothing, Doc.  Just a... touch of indigestion... something.\n\n<b>REVNA\n</b>Do you want a tablet?\n\nACKLAND winces in pain.  His breathing's getting heavy.  He nods.\n\n<b>ACKLAND\n</b>Uh-huh.\n\nREVNA gets up swiftly and crosses to an automated pharmacy.  ACKLAND's \nbeginning to COUGH now.\n\n<b>REVNA\n</b>That sounds nasty.  I'll give you a couple of Demazine.\n\nACKLAND nods again.  His COUGHING has deepened, and now he's banging \nhis chest with a balled fist.  REVNA hurries over with three red \ntablets and a disposable cup of water.  ACKLAND takes them gratefully \nand gulps them down. The effect is almost immediate; ACKLAND quietens \nand an appreciative smile comes to his pale lips.\n\n<b>REVNA (CONT'D)\n</b>Better?\n\n<b>ACKLAND\n</b>Yeah...\n\nBefore he has a chance to elaborate, ACKLAND COUGHS once more.  A thin \nspray of blood and saliva dots REVNA's white smock and speckles her \ncheek. ACKLAND's scrabbling fingers grab her lapels as he begins to \nhyperventilate. She pulls away, dragging him from the bed in the \nprocess.  He falls to the floor, his MOANS growing in volume.\n\n<b>REVNA\n</b>Hold on, it's alright.  I'm gonna give  you a shot...\n\nHer fingers tremble as she clumsily examines a tray of surgical \ninstruments. She finds a pneumatic spray-injector, fully charged with a \nvial of amber liquid attached.  ACKLAND SCREAMS and fall backwards onto \nthe floor, his hands clawing at the air.  REVNA fumbles with the \ninjector control and gives him a blast in his upper arm.  ACKLAND \nconvulses once then goes still, his eyes staring fixedly at the \nceiling.  The Infirmary is deathly quiet once again.\n\nWe hear a gentle CRACKING, like twigs being snapped.  REVNA watches in \nhorrified fascination as a pool of blood spreads swiftly outward across \nthe floor from below ACKLAND's corpse.  REVNA shudders as the body \nmoves a little, then is rolled over by something underneath it.\n\nWHAT SHE SEES.  ACKLAND's body slumps forward onto it's front, \nrevealing a gaping cavity in his back.  Bits of spine and ribcage are \njust visible.  A CHESTBURSTER - the second stage of the ALIEN lifeform \n- pulls itself clear and wipes red gunk from it's body with a pair of \nstill-underdeveloped arms.\n\nAround it's head is a distinctive nascent crest.  It kicks away from \nACKLAND with a powerful push from it's legs, quickly gaining balance.  \nAfter a moment appraising it's new environment, it stalks off behind a \ntable.  REVNA thinks quickly.  She leaps forward and THUMPS a large red \nstud next to the pressure-door, which promptly RUMBLES closed.\n\nThe room is bathed in pools of shadows.  Plenty of hiding space for the \ncreature.  REVNA hears breaking glass, making her start.  She \ncautiously edges over to the Autodoc and looks up into the forest of \nprobe-arms. \n\nThere's a wicked looking blade there, the kind used in major surgery.  \nREVNA reaches up and twists the base; it detaches easily.  Now she's \narmed. Stooped over, she begins to stalk the CHESTBURSTER...\n\nThere's a flurry of movement, and suddenly the hunter becomes the \nhunted. The CHESTBURSTER vaults from the table at her with a SHRILL \nSHRIEK, and REVNA blindly swings her make-shift knife in defense.  We \nhear a SIZZLE like frying bacon...\n\n<b>INT.  RYUSHI STATION - INFIRMARY CORRIDOR\n</b>\nHIROKO sprints down the corridor and reaches the Infirmary.  DILLER, \nCASSIE, and a few others are crowded around outside.  YORK lays \nunconscious on one of the medical trolleys next to the door, making \naccess difficult.  Above them, a hinged flap on the wall lies open \nrevealing a circular mechanism beneath.  BREWSTER scratches at the \nbulkhead and WHINES.  MUFFLED THUMPS come from within.\n\n<b>HIROKO\n</b>What happened?\n\n<b>DILLER\n</b>York just turned up outside.  We're trying to get him into Infirmary.\n\nHIROKO   (astonished)\nYork...\n\nHIROKO leans over to examine him, but a particularly loud CRASH from \nwithin the Infirmary distracts her.\n\n<b>HIROKO (CONT'D)\n</b>What's going on?\n\n<b>CASSIE\n</b>The door's sealed from inside.  Doc Revna's in there, and it sounds \nlike Ackland's going nuts.\n\n<b>HIROKO\n</b>Force the door.\n\n<b>DILLER\n</b>Can't.  It's pressure sealed.\n\nGUTTIEREZ races up and hands DILLER a wrench with a shaped tip.\n\n<b>GUTTIEREZ\n</b>Here...\n\n<b>DILLER\n</b>Thanks.\n\nHe inserts the end into the open flap and pulls hard, the physical \neffort showing on his face.  The door grinds open about eight inches... \n\nThe bloodied CHESTBURSTER forces itself through the narrow gap, HISSING \nvehemently.  Yellow fluid wells from a wound in it's crested skull, \ndissolving everything it comes into contact with.  The small group \ngathered around fall back in panic, jarring YORK's trolley and knocking \nHIROKO to the floor.  BREWSTER BARKS at the CHESTBURSTER, which tenses \nas if to leap.\nDILLER brings the wrench down, but the CHESTBURSTER evades his blow and \ntakes flight.  It strikes at HIROKO, who reflexively draws her head \nback and escapes with nothing more than a light scratch to the cheek.  \nThe ALIEN disappears down the corridor, leaving a trail of smeared \nblood and a series of acidic pits which melt the grillework flooring.  \nGUTTIEREZ bends down and\nhelps HIROKO to her feet.  Shocked, she MUTTERS something to herself in \nJAPANESE, and regains some of her composure.\n\n<b>HIROKO\n</b>Get after it, don't let it get away!\n\nDILLER stands there with the metal bar.  Does she think he's nuts?\n\n<b>HIROKO (CONT'D)\n</b>Go on!\n\nThis galvanises DILLER.  He races off in pursuit.\n\n<b>HIROKO (CONT'D)\n</b>Jan, give me a hand over here.\n\nHIROKO AND GUTTIEREZ try to force the door, but DILLER was right - it \nwon't budge.  HIROKO slips her arm through the gap and fumbles around \nblindly.  She must have hit the control knob, because the door slides \nback.  CASSIE looks inside.\n\n<b>CASSIE\n</b>Oh my God...\n\nShe turns away and retches.  HIROKO steps through and goes pale.  There \nare blood-smears over everything, and it's all GUTTIEREZ can do to stop \nBREWSTER from getting in there.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPARSONS' finger traces a path along a set of computer schematics \ndisplayed on a suspended glass screen.\n\n<b>PARSONS\n</b>It left a melted trail on the deck all the way down to here...\n\n<b>HIROKO\n</b>What is that?\n\n<b>DILLER\n</b>Secondary fluidic shunt for the sewage system.  I found the grating \nripped right off.  The little fucker was strong.\n\n<b>HIROKO\n</b>Where does that lead to?\n\n<b>PARSONS\n</b>Central Pumping.  All the waste gets  treated, broken-down, and flushed \nout into the swamp.  If it wanted a quick exit then it really lucked-\nout.\n\n<b>HIROKO\n</b>You've checked that end?\n\n<b>GUTTIEREZ\n</b>Not yet, no.\n\n<b>HIROKO\n</b>Do it.  I don't want that thing on my installation.  I want it caught \nand destroyed.\n\n<b>KAMEN\n</b>Cornering it shouldn't be a problem.  Each part of this station is \nbasically a self-sufficient deep-space transport module running off \nexternal couplers.  If we disconnect them and seal off every section, \nwe've got a ceiling of about thirty-six hours on internal power.  That \nshould give us ample time to find it.\n\n<b>HIROKO\n</b>Alright.  Pull some trackers and headsets out of stores, and I'll sign \na release for the weapons.  Cassie, organise a team roster and put it \non the board.\n\nCASSIE nods soberly.  HIROKO looks at everybody, and her words are \ncarefully chosen.\n\n<b>HIROKO (CONT'D)\n</b>I don't care how you kill this thing, just be careful not to get in \nit's way when it bleeds.  You all saw what happened to Doc Revna.\n\nThere are nods of agreement and general enthusiasm all round.\n\n<b>HIROKO (CONT'D)\n</b>Nobody wander off on their own until it's found.  Keep in pairs.  \nDiller, once the first team's done their sweep I want you to go down \nwith Annie to Three-Pump while she replaces it.\n\n<b>DILLER\n</b>Okay.\n\n<b>HIROKO\n</b>One final point.  Killing this sonuvabitch ought to be a reward in \nitself.  However, just to add a little incentive... I'm authorizing a \nhefty bonus in the next pay-packet for whoever does.\n\nThis seems to appeal to those assembled there.  There's a palpable buzz \nin the air.\n\n<b>HIROKO (CONT'D)\n</b>Alright, let's get to it.  New York rules apply.\n\n<b>INT.  RYUSHI STATION - EXECUTIVE OFFICE\n</b>\nYORK is recounting his story to KAMEN and HIROKO in a hushed voice.  \nSmall beads of sweat stand out on his forehead and his eyes are haunted \nby remembrance.  The man's a mess.\n\n<b>YORK\n</b>...I mean, these... these mothers were... were huge.  They look like \nbushmen, but they had all this hi-tech shit strapped all over 'em.  \nThey must've wasted Beauvais and Minh inside thirty seconds.  Minh got \noff a couple of shots from that cannon of his, but he might as well \nhave been using a B-B gun.  I don't know how the hell I made it out of \nthere alive.\n\nHe nods toward the PREDATOR spear in HIROKO's hands.\n\n<b>YORK (CONT'D)\n</b>The one I clipped with the hoverbike shoved that at me.  Whatever it's \nmade of, it went straight through a double-layer of honeycomb polyalloy \ncomposite like it was butter.\n\nYORK shakes his head in fear.\n\n<b>YORK (CONT'D)\n</b>I don't wanna ever come up against those things again.  Ever.\n\nKAMEN claps the man on the shoulder to reassure him.\n\n<b>KAMEN\n</b>Don't worry about it, Yorkie.  You're safe now.  Go get come rest.\n\nYORK nods.  He gets to his feet and leaves the room.  HIROKO waits \nuntil the door slides shut behind him.\n\n<b>HIROKO\n</b>So, what do you think?\n\n<b>KAMEN\n</b>What do I think?  I think if those Marines from Powell don't shift \ntheir butts getting here, we're gonna get caught up to our necks in the \nmiddle of something we shouldn't.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nIt's late, and the base's exterior lighting casts yellow pools of light \nacross the metal and concrete thoroughfares.  GUTTIEREZ and DE VRIES - \na tough-looking Afrikaan woman with a think accent - looks uneasily \nabout them. Another GROUP of PEOPLE with trackers and guns are \nsearching around in the BACKGROUND.  Nearby, the vertical yellow column \nof a suspension-crane gantry towers high above.\n\n<b>DE VRIES\n</b>C'mon, man.  One more sweep.\n\n<b>GUTTIEREZ\n</b>One more sweep... one more sweep.  I'm getting tired of one more \nfuckin' sweep. We're been lookin' for this thing for three days now, \nand found zip.\n\n<b>DE VRIES\n</b>Ah, quit griping.  Keeps you in shape doesn't it?\n\n<b>GUTTIEREZ\n</b>Hey!  I was in shape before we started doing this.\n\nDE VRIES pauses, listening to the sound from the surrounding forest.\n\n<b>DE VRIES\n</b>Listen to that...\n\nGUTTIEREZ cocks his head and listens.  He has no idea what she means.\n\n<b>GUTTIEREZ\n</b>Listen to what?\n\n<b>DE VRIES\n</b>That's what I mean.  This is the quietest I've ever heard it.  It's \nunnatural.\n\nGUTTIEREZ shivers in the wind as he looks out into the impenetrable \nblackness beyond the confines of the base.\n\n<b>GUTTIEREZ\n</b>De Vries?\n\n<b>DE VRIES\n</b>Yeah?\n\n<b>GUTTIEREZ\n</b>Next time you have a thought like that? Keep it to yourself.\n\nBREWSTER the dog stares in fascination at the rhinos through the \nmeshwork fence of their pens.  The animals move around in agitation.  \nNot at her, but at something else...\n\n<b>DE VRIES\n</b>Something spooking the rhinos?\n\n<b>GUTTIEREZ\n</b>I dunno.\n\n<b>EXT.  RYUSHI STATION - SWAMP LEVEL - DUSK\n</b>\n<b>PREDATOR-VISION. \n</b>The rhino's, the dog, and the two humans can be seen way above on the \nplatform's edge, bright red.\n\nIndistinct inside their camouflage cloaks, the small group of PREDATORS \nwade carefully through the water towards the base of the installation.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nDARKNESS.  DILLER and URIOSTE's VOICES heard O.S. in HUSHED TONES.  The \nscraping of METAL-ON-METAL.\n\n<b>DILLER\n</b>What is that...is that it?\n\n<b>URIOSTE\n</b>No.  I... think that's a regulator valve. Hold on.\n\nThere's more NOISE.\n\n<b>URIOSTE (CONT'D)\n</b>Ah, got it...!\n\nAbout a dozen fluorescent strips ringing the small circular chamber \nilluminate.  Three others flicker erratically, one of them remaining \nunlit. DILLER waves the tracker cautiously around and keeps his pulse-\nrifle level. He enters, followed by URIOSTE.  She's carrying a portable \n- but bulky - piece of machinery.\n\n<b>URIOSTE\n</b>Are you getting anything?\n\nDILLER   (sarcastic)\nYeah, eyestrain.  What's with the lights?\n\n<b>URIOSTE\n</b>They're always like that.  Head-Office are real cheap when it comes to \nspares.  Wave that thing in the corner...\n\nDILLER sweeps the tracker carefully around.  The small screen registers \nnothing.\n\n<b>DILLER\n</b>The room's clean.\n\n<b>URIOSTE\n</b>Great.\n\nURIOSTE pulls at a two-piece hexagonal grating set in the center of the \nfloor.  It's heavy and thick with grease, but she doesn't seem to mind. \nBelow it is what looks like a round metal plug.  Recessed into its \nsurface is a lever next to a central pressure valve, with handholds on \neither side.  She turns the lever.  There's a loud CLUNK, and a plume \nof steam JETS out of the valve.\n\n<b>URIOSTE (CONT'D)\n</b>Give me a hand with this.\n\nGRUNTING, the two of them pull the thick metal plug clear of the pit.  \nMurky water sloshes around below.  URIOSTE pulls a second lever, and \nhidden pumps make the water level drop rapidly.\n\n<b>URIOSTE (CONT'D)\n</b>Pass me over that tripod, will you?\n\nLeaning against the wall behind DILLER is a sturdy metal tripod topped \nwith a block-and-tackle arrangement.  A hook dangles below this, it's \nthick metal cabling going up through the block-and-tackle and \nconnecting to the drum of a small industrial winch attached securely to \nthe wall.  DILLER hands the tripod over to URIOSTE.  She splays the \nlegs apart and inserts their tips into matching holes around the open \npit.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nGUTTIEREZ and DE VRIES walk over to the rhino pen, BREWSTER pulling at \nher leash.  GUTTIEREZ frowns at what he sees.  All the rhinos are \nnervously huddled together in the far corner.\n\n<b>GUTTIEREZ\n</b>That's real peculiar behavior.\n\nDE VRIES fingers a rough metal edge.\n\n<b>DE VRIES\n</b>Hey, Guttierez?\n\n<b>GUTTIEREZ\n</b>What?\n\n<b>DE VRIES\n</b>Take a look at this.\n\nGUTTIEREZ moves over for a closer look.  There's a torn hole in the \nmeshwork, just big enough for a rhino to squeeze through.  Blood and \nfragments of skin coat the edge of the gap.\n\n<b>GUTTIEREZ\n</b>One of 'em must have escaped.\n\n<b>DE VRIES\n</b>That's impossible, man.  This fence is high-tensile.  The breaking \ntolerance'd stand up to the strain of a rhino, easy. I know, I put it \nup.\n\nGUTTIEREZ shines the flashlight along the deck.  A trail of smeared \nblood runs all the way to the perimeter.  The surrounding fence has \nbeen buckled and twisted.  They cross to it and look down at the swamp.  \nThe torch beam sparkles on the murky water far below.\n\n<b>GUTTIEREZ\n</b>There's no way a rhino'd survive that drop.\n\n<b>DE VRIES\n</b>Goldsmith's gonna be plenty pissed at losing one of her babies.\n\n<b>GUTTIEREZ\n</b>That's a fact.\n\nGUTTIEREZ' tracker starts to BLEEP.  He raises it excitedly.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Whoa, wait a minute...\n\n<b>DE VRIES\n</b>What?\n\n<b>GUTTIEREZ\n</b>Just got a reading...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nMost of the lights in Admin are off, and the room's deserted.  PARSONS \nis seated away from his usual station at a console topped by ten \nmonitor screens, each displaying a securi-cam picture.  He looks tired.  \nKAMEN comes up behind him carrying two mugs of coffee.\n\n<b>KAMEN\n</b>How's it going?\n\n<b>PARSONS\n</b>Yeah, 'Good Evening' to you, too.\n\nHe takes the coffee gratefully and sips at it.\n\n<b>PARSONS (CONT'D)\n</b>Today's party's finished their sweep, the relief team's out there now.  \nEverybody else is either asleep or running shift in the auto-shop.\n\n<b>KAMEN\n</b>You should hit the sack, too.\n\n<b>PARSONS\n</b>Nah, I'll stick it out for another hour or so.\n\n<b>KAMEN\n</b>What time's sundown?\n\n<b>PARSONS\n</b>'Bout five minutes.\n\n<b>KAMEN\n</b>Give me a yell is something happens.\n\n<b>PARSONS\n</b>You got it, cowboy.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nGUTTIEREZ sweeps the tracker slowly around, and BREWSTER begins to \ngently SNARL.  \nDE VRIES pulls on the dog's leash to quieten her.\n\n<b>GUTTIEREZ\n</b>It's up there somewhere...\n\nHe shoulders his rifle.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Come on.\n\nA metal ladder runs up the side of one of the base buildings.  \nGUTTIEREZ crosses to it and starts to climb the first few rungs.\n\n<b>DE VRIES\n</b>What?  Are you nuts?  Just the two of us?\n\n<b>GUTTIEREZ\n</b>I've seen this mother, De Vries.  We can bag it, no problem.\n\n<b>DE VRIES\n</b>Forget it, man.\n\n<b>GUTTIEREZ\n</b>C'mon De Vries.  Think of the bonus.\n\n<b>DE VRIES\n</b>Fuck the bonus.  I hate heights.  You wouldn't get me up there even if \nit wasn't night.\n\nGUTTIEREZ starts to climb the ladder.\n\n<b>DE VRIES\n</b>What the hell are you doing?\n\n<b>GUTTIEREZ\n</b>Hey, fair enough.  If you won't come, I'll handle it myself.\n\nDE VRIES runs her fingers through her hair in frustration.  Comes to a \ndecision counter to what she wants to do...\n\n<b>DE VRIES\n</b>Wait a minute!\n\nGUTTIEREZ stops climbing.\n\n<b>DE VRIES (CONT'D)\n</b>Alright, okay.  Look...\n\n<b>GUTTIEREZ\n</b>What?\n\n<b>DE VRIES\n</b>I'll come with you.\n\nBREWSTER BARKS.  She drags the dog over to a metal stanchion and ties \nthe leash around it.\n\n<b>DE VRIES (CONT'D)\n</b>But I'm going first...\n\n<b>GUTTIEREZ\n</b>Anything you say, Mammacitta.\n\nShe climbs around GUTTIEREZ and begins to ascend the ladder.  BREWSTER \nWHIMPERS and plaintively BARKS after them.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - DUSK\n</b>\nThe rooftop is dark, mysterious.  Pieces of retrofitted junk can be \nseen in silhouette, edged in light from way below.  DE VRIES and \nGUTTIEREZ carefully step over the threshold.  They speak in WHISPERS.\n\n<b>DE VRIES\n</b>Careful of that edging there...\n\n<b>GUTTIEREZ\n</b>Yeah, I got it.\n\nAlthough we have an outstanding VIEW of the night lights of the base up \nhere, the immediate gloom is impenetrable. \n\n<b>DE VRIES\n</b>Where's that flashlight?\n\nBy way of an answer, a powerful ray cuts a swathe through the air.  DE \nVRIES takes the torch from him and shines it on the ground.  Circular \nextractor fans rotate quietly in the gloom.\n\n<b>DE VRIES (CONT'D)\n</b>Still got him?\n\n<b>GUTTIEREZ\n</b>It's moving slow.  About... eleven metres. On the left.\n\nDE VRIES plays the flashlight across the rooftop.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Little bit further...\n\nThe beam comes to rest on a protruding piece of apparatus.  A short-\nrange antennae, about seven feet wide.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Yeah, yeah, yeah.  Right there, right behind the antennae.  I think \nwe're got it cornered...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nHIROKO bends down to inspect a small plastic grating fitted flush with \nthe roadway.  The broken grillework is melted outwards.  KAMEN and two \nother men - CALDWELL and THOMAS - stand behind.\n\n<b>THOMAS\n</b>The door to the food storage locker was smashed open.  It must have \ncome straight out of here.\n\nHIROKO yawns.\n\n<b>HIROKO\n</b>Alright.  Keep your eyes peeled.\n\nShe voices her concern to KAMEN.\n\n<b>HIROKO (CONT'D)\n</b>If it got out of the systems, it could be anywhere.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - DUSK\n</b>\nIt's very quiet, and we can hear the NERVOUS BREATHING of GUTTIEREZ and \nDE VRIES as they cautiously stalk forward.\n\n<b>GUTTIEREZ\n</b>Hold it, hold it...\n\n<b>DE VRIES\n</b>What's wrong?\n\n<b>GUTTIEREZ\n</b>I'm picking up another signal.\n\nDE VRIES looks around, unnerved.\n\n<b>DE VRIES\n</b>What?  Where?\n\n<b>GUTTIEREZ\n</b>Just behind us, over to the right.\n\nDE VRIES shines her beam over the surface of the yellow crane to their \nrear, shifting her attention to-and-fro from it and the antennae.\n\n<b>DE VRIES\n</b>Can't see a thing.  Are you sure?\n\n<b>GUTTIEREZ\n</b>Yeah, I...\n\nThe second blip on the small screen abruptly vanishes.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Wait.  Lost it.\n\n<b>DE VRIES\n</b>How?\n\n<b>GUTTIEREZ\n</b>I dunno.  Might be a glitch.\n\nFrom behind the metal disc there comes a SHUFFLING SOUND, followed by a \nMETALLIC THUNK.  This gets their attention.  The two of them halt in \ntheir tracks.\n\n<b>DE VRIES\n</b>Oh, man.  That's no glitch!\n\n<b>GUTTIEREZ\n</b>It's alright, it's cool...\n\n<b>DE VRIES\n</b>Is it still moving?\n\n<b>GUTTIEREZ\n</b>No, he's stopped; he's totally still. Just take it nice and easy, babe.  \nNice and easy...\n\nA small many-limbed SHAPE hurls itself from the confines of it's hiding \nplace with a FERAL SHRIEK.  DE VRIES YELPS in surprise, and looses off \na spray of bullets.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nHIROKO looks up, startled by the sound of GUNFIRE.  She sees the \nrooftop of one of the building modules lit by tracer fire.  BREWSTER's \ntethered nearby, BARKING furiously.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM - PUMP SHAFT\n</b>\nA think metal cable connected to her jacket harness suspends URIOSTE in \nthe gloom of the Pump Shaft.  In front of her is a machine-part we saw \nher carry earlier.  With the strap of a flashlight clenched in her \nmouth, she's just finishing up bolting the part to the larger piece of \nmachinery in an alcove, with simultaneously doing her best not to touch \nthe walls which are covered by a thin layer of gunge.\n\nThe REPORT of DE VRIES' weapon can be heard even down here, perhaps \nmore startling in the confined space.  URIOSTE jumps, dropping the \nflashlight into the water in the process.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nDILLER turns away from the winch and peers into and beyond the access \ntunnel leading outside.  URIOSTE's VOICE floats up out of the shaft. \n\nURIOSTE   (O.S., muffled)\nWhat was that?\n\nDILLER   (raising his voice)\nSomething outside...\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - DUSK\n</b>\nThe wind whips at GUTTIEREZ as he blinks away his shock.\n\n<b>GUTTIEREZ\n</b>Holy shit...\n\nDE VRIES keeps her torch beam on the moving shape.  It halts by the \nedge of the roof, and stares at them.\n\n<b>DE VRIES\n</b>Oh, nice going, man!  It was a lemur! A goddamn lemur!\n\nGUTTIEREZ' radio headset CRACKLES to life.\n\nHIROKO   (O.S., on headset)\nGuttierez, what the hell's going on up there?\n\n<b>GUTTIEREZ\n</b>Uh... sorry about that, boss.  Everything's fine.  False alarm, that's \nall.\n\nDE VRIES glances around the rooftop, annoyed.\n\n<b>DE VRIES\n</b>Hey, look; let's forget it.  There's nothing up here.\n\n<b>PREDATOR-VISION.  \n</b>DE VRIES in CLOSE-UP, glowing brightly.  Her VOICE replayed and \ndistorted.\n\n<b>PREDATOR   (O.S.)\n</b>Nothing up here.  Nothing up here.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM - PUMP SHAFT\n</b>\nURIOSTE's flashlight bobs up-and-down on the water below, still lit and \nwell out of reach.\n\nURIOSTE    (disgustedly)\nShit.\n\nDILLER   (O.S., muffled)\nWhat's the matter?\n\n<b>URIOSTE\n</b>I've dropped my torch into the water. Give me about... uh... a meter-\nand-a-half's worth of slack.\n\nDILLER   (O.S., muffled)\nOkay.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nDILLER crosses to the wall-mounted winch.  On the mechanism's side is a \nluminous digital counter giving the current cable depth in meters.  He \npulls a throw-switch, and the display slowly changes from \"8\" to \"9.5\" \nas the cable feeds out.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM - PUMP SHAFT\n</b>\nURIOSTE descends the dingy shaft, partially abseiling off the walls.  \nHer feet almost tread water.  She's down as far as she can go.\n\n<b>URIOSTE (CONT'D)\n</b>Whoa, whoa...\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nURIOSTE's VOICE echoes up out of the pit.\n\nURIOSTE (CONT'D)  (O.S., muffled)\nThat's enough.\n\nDILLER locks the winch-switch back into it's 'up' position.  The WHINE \nof the cable-feed stops immediately.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM - PUMP SHAFT\n</b>\nURIOSTE stretches out to the floating lamp, flexing her fingers.  \nIt's... just... about... in... reach...\n\nSix slender fingers EXPLODE from beneath the water's surface and clamp \nlike a vise around URIOSTE's wrist.  A sleek eyeless head follows, \ntrailing a body straight out of a charnel-house nightmare.  A SCREAM \nforms in her throat, rapidly cut-off as the ALIEN's other hand clamps \nfirmly over her mouth, jerking her downwards.\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nDILLER whirls in response to the CHOKED CRY from below.  He sees the \nwinch tripod above the shaft RATTLE, the cable going taut as an \nangler's line. The wall-mounted drum is yanked so hard the lever leaps \nfrom it's 'clamped' position, freely unspooling cable at a frightening \nrate.  The digital counter flickers rapidly; \n\"11...11.5...12...12.5...13...\"  DILLER watches the tripod's tubular \nlegs buckle and collapse under the tremendous strain.  He scrambles for \nthe winch-lever and only just manages to lock it firmly into place; the \nover-stressed cable vibrating with a LOW METALLIC TWANG as it hits the \nshaft's edge.  DILLER's moment of satisfaction is short-lived; the \ndeep-sunk bolts attaching the mechanism to the wall are pull outward by \nthe colossal force from below.  He leaps aside, avoiding the heavy \npiece of machinery as it HURTLES towards him.  Watches it disappear \nnoisily into the conduit.\n\n<b>DILLER\n</b>Annie!\n\nDILLER's quivering fingers grope for his flashlight.\n\n<b>DILLER (CONT'D)\n</b>Annie!\n\nHe feverishly reaches the shaft's edge and peers into the darkness.\n\nWHAT HE SEES.  The torchbeam picks out the biomechanical form of the \nALIEN emerging from the sewage and effortlessly climbing the shaft \nwalls towards him.  Recoiling in horror, he makes a run for the door.  \nHalf-way there he remembers his pulse-rifle and dives to the floor, \ngrasping it just as the ALIEN reaches the top.  DILLER fumbles with the \nsafety and give the creature a full BLAST on rock-and-roll, BLASTING it \nback into the pit.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - DUSK\n</b>\nGUTTIEREZ and DE VRIES hear the gunfire from below.\n\n<b>GUTTIEREZ\n</b>The hell was that?\n\n<b>PREDATOR-VISION.  \n</b>The PREDATOR's gaze SNAPS away from the two humans and down onto the \nplatform below.  He watches the infra-red shapes of other people \nrunning towards the source of the shots...\n\n<b>INT.  RYUSHI STATION - PUMP ROOM\n</b>\nDILLER's on his feet and shakily heading for the exit as ANOTHER \nALIEN's claws emerge from the exposed hole.  He races across the \nthreshold and SLAMS the thin inner door closed.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nIn a HAND-HELD SHOT we're running with HIROKO's group along the narrow \ncatwalk bridging the roadway to the Pump Room, KAMEN taking the lead.  \nDILLER sprints out of the building like a bat out of hell and collides \nwith him. \n\n<b>KAMEN\n</b>Kev, wha...?\n\nDILLER breaks free of the other man's grasp.  He looks as if he's about \nto say something, but never gets the chance.\n\nThere's a sound of TEARING METAL, and a HISSING seven-foot express \ntrain of teeth and biomechanical limbs ERUPTS from the shadows.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - DUSK\n</b>\n<b>PREDATOR-VISION.  \n</b>Gazing down at the platform, an unseen hunter watches the swift black \nSHAPE of the ALIEN in amongst the group of humans...\n\nFrom the corner of her eye, DE VRIES sees something moving nearby.  She \nviolently pulls GUTTIEREZ out of the path of the shimmering FORM that \nbarges past them, launching itself from the rooftop. \n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPARSONS sits bolt upright in his chair as the scene outside is relayed \nto his bank of screens by an exterior securi-cam. \n\n<b>PARSONS\n</b>Oh my God...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nWith superhuman strength, the ALIEN brutally back-hands DILLER, \nsplintering his skull and killing him instantly.  His body caromes into \nTHOMAS, knocking the man to the floor.  The ALIEN turns to KAMEN, it's \nquesting fingers closing around his throat and hauling him off the \nground.  The space on the catwalk it limited; there's so many people \nit's impossible to get a clean \nshot...\n\n<b>HIROKO\n</b>Move!  Get out of the way!\n\nHIROKO draws a bead on the ALIEN.  She flips off the safety on her \nrifle. It's the tiniest CLICK, but the ALIEN somehow senses danger.  \nIt's skeletal tail lashes out, sending both her and the weapon flying.  \nCALDWELL gets in for his shot, but the tail's there in a second.  It \nstrikes like a snake. Once.  Twice.  The stinger punctures CALDWELL's \nchest and throat.  Nobody could survive something like that...\n\nThe ALIEN flicks it's skull back around to KAMEN.  The man's head is \ninches away from it's eyeless face...a row of burnished metal teeth \nopen...the toothed inner tongue ready to strike...\n\nWHOOMPH.  Something lands heavily close-up, jarring the catwalk.  The \nALIEN drops KAMEN and WHIRLS.  A spear wielded by an INVISIBLE FORM \nappears out of nowhere and PIERCES the ALIEN's midriff, spraying acidic \nfluid.  The creature emits a OUTRAGED SHRIEK and flails around, it's \nubiquitous tail arcing toward the camouflaged assailant.  The STINGER \nmakes contact:  there's a SPUTTERING SOUND as the PREDATOR's cloaking \ndevice begins to flicker spasmodically, giving us peek-a-boo glimpses \nof it's natural form.  Electrical sparks dance around the PREDATOR's \nruin wrist-computer, luminous green blood welling from a wound in his \narm...\n\nFrom out of the Pump Room comes more NOISE, like metal being trashed in \na compactor.  HIROKO SCREAMS at KAMEN, who's COUGHING painfully next to \nthe door panel.\n\n<b>HIROKO\n</b>Get the door!\n\nKAMEN hastily slaps the 'close' button and both halves of the exterior \npressure bulkhead RUMBLE together.  A SECOND ALIEN appears from the \nshadows within and prises it's fingers into the dwindling gap, \nstruggling for purchase.  Despite the ALIEN's best efforts, the door \nmotors are too powerful and the opening seals with a satisfying solid \nCLUNK.  MUFFLED POUNDING comes from the other side.\n\nNearby, THOMAS has retrieved CALDWELL's weapon in the heat of the fight \nand is bringing it to bear on the PREDATOR.  At the last possible \nmoment HIROKO sees what he's about to do...\n\n<b>HIROKO\n</b>No!\n\nReflexively, she knocks the barrel away as THOMAS looses a volley of \nshots.\n\n<b>PREDATOR-VISION. \n</b>The PREDATOR's speech analyser plays back her vocal patterns as white-\nhot bullets sear the night.\n\n<b>PREDATOR\n</b>No!\n\n<b>PREDATOR-VISION.  \n</b>SNAPPING IN for a closer look at her.\n\n<b>PREDATOR (CONT'D)\n</b>No!\n\nOne of the ALIEN's hands clamps firmly onto the PREDATOR's mask and \nwrenches it off.  HIROKO stares at the PREDATOR's face in fascination.  \nFrom the distinctive features, we see that it's BROKEN TUSK.  The \nPREDATOR's good hand flashes down to his thigh, almost too quick to \nfollow.  In one rapid movement a circular 'smart-weapon' is brought up, \nslicing the front of the ALIEN skull away from it's head.  In a feat of \nstrength, the PREDATOR lifts his opponent's corpse on the end of the \nspear and hurls it over the catwalk railing...\n\nNot wasting a second, BROKEN TUSK performs an almost-vertical bound of \nsome twenty feet with astounding grace.  He grips a pipe running down \nthe side of one of the building modules, then clambers over the roof's \nedge and finally disappears from view.  BREWSTER continues to BARK \nfrenetically. \n\nHIROKO's headset has been knocked to the floor and a FRANTIC MUTED \nVOICE is coming from it.  She picks it up, and presses the 'transmit' \nswitch. \n\nHIROKO   (into headset)\nIt's alright, Rob...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPARSONS listens to HIROKO, suddenly wide awake.  The morning shifts are \nstarting to filter in, and it's obvious to them something's wrong...\n\nHIROKO (CONT'D)   (O.S., on speaker)\nEverything's under control.  Wait a second.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nTHOMAS is moving from DILLER to CALDWELL, checking them for signs of \nlife. HIROKO catches his eye.\n\n<b>HIROKO (CONT'D)\n</b>Well?\n\nTHOMAS shakes his head.  GUTTIEREZ and DE VRIES race across the \nplatform to join the stunned survivors of the skirmish.  GUTTIEREZ \nbends down by DILLER's body.  THOMAS lays a hand on GUTTIEREZ' arm.\n\n<b>THOMAS\n</b>Come on, man.  Leave it alone.\n\n<b>GUTTIEREZ\n</b>Oh, God.  Dear Lord Jesus...\n\n<b>DE VRIES\n</b>This is like a bad dream, man.  A bad fucking dream.\n\nHIROKO thinks quickly, and comes to a decision.  She speaks into her \nradio headset.\n\n<b>HIROKO\n</b>Rob?  I want you to evac everybody from the non-connective modules into \nadmin. That goes double for anybody...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nHIROKO (CONT'D)  (O.S., on speaker)\n...already out here.  We're going to lock every bulkhead and seal the \nbase.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nHIROKO turns her headset off and watches numerous rotating coloured \nlights dotted around the platform start to blink on-and-off.  KAMEN \nCOUGHS a few more times.\n\n<b>HIROKO\n</b>Are you okay?\n\nKAMEN rubs his throat.  He nods.\n\n<b>KAMEN\n</b>I'll survive.\n\nBREWSTER's BARKS cease, replaced instead with a TERRIFIED LOW WHINING.\n\n<b>DE VRIES\n</b>What's with the dog?\n\nGUTTIEREZ jogs over to BREWSTER.  Lowers his rifle to the ground and \nfumbles with the knot tying the dog to the pipe.\n\n<b>GUTTIEREZ\n</b>Hey; c'mon now, girl.  It's alright.  Let's just get this knot \nundone...\n\nA spray of plastic shards EXPLODES not three feet away from GUTTIEREZ.  \nThe rifle goes skittering away out of reach, and he scrambles away as \nan ALIEN half-pulls itself out of the sewer overflow, wet and \nglistening...\n\n<b>KAMEN\n</b>Jan!\n\nBREWSTER's a mass of fur, totally out of control.  When the ALIEN \nlashes out to grab the HOWLING animal, there's nothing GUTTIEREZ can \ndo.  BREWSTER's legs are the last thing we see, thrashing helplessly as \nshe's dragged down into the splinter-edged gap.\n\n<b>DE VRIES\n</b>Get out of there, man!\n\nTHOMAS grabs CALDWELL's rifle from the deck.  He races towards \nGUTTIEREZ, with \nDE VRIES close behind... \n\n<b>THOMAS\n</b>Catch this!\n\nFrom behind comes the SOUND of more rupturing plastic as biomechanoid \nlimbs struggle up out of newly-broken ducts.  THOMAS heaves the rifle \nover the heads of the emerging ALIENS.  Although GUTTIEREZ snags it \nawkwardly, he quickly turns the barrel on the relentless creatures.\n\n<b>GUTTIEREZ\n</b>Chew on this!\n\nDE VRIES races up to join them, SCREAMING as she fires.  KAMEN glances \ndown at this tracker's tiny screen.  It shows clusters of signals, lots \nof them.\n\nKAMEN   (hollering)\nThey're all around, they're in the drainage system!\n\nDE VRIES reacts swiftly, loosing a round of shots at the emerging \nALIENS. GUTTIEREZ yells across to KAMEN.\n\n<b>GUTTIEREZ\n</b>Get your ass out of here, boss!\n\nALIENS are appearing everywhere.  From the overflow ducts; over the \nplatform edges; along overhead cable supports.  Having taken on the \ngenetic characteristics of their hosts, many of them are non-humanoid.  \nAll of them are living nightmares.\n\n<b>HIROKO\n</b>Oh my God...\n\n<b>INT.  RYUSHI STATION - LIVING QUARTERS\n</b>\nCASSIE brushes her teeth in front of the wall-mounted mirror of her \ntiny bathroom-cubicle.  A raucous emergency klaxon GOES OFF in the \ncorridor outside.\n\n<b>CASSIE\n</b>Shit.\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - DUSK\n</b>\nTHOMAS, GUTTIEREZ, and DE VRIES are cut-off.  As they race swiftly down \nthe street, GUTTIEREZ tries hard to interpret his tracker's signals.  A \nparticularly loud BLEEP registers from a source immediately behind \nthem.  He glances over his shoulder and sees an ALIEN crawling down the \noutside of a module towards them.\n\n<b>GUTTIEREZ\n</b>De Vries!\n\nDE VRIES' head turns.  She sees the ALIEN and nails it with a rapid \nburst. It falls onto the concrete nearby, writhing in it's death \nthroes. \n\nThe group round the corner of a building.  Across the street from them \nis parked KAMEN's crawler.\n\n<b>GUTTIEREZ (CONT'D)\n</b>Inside, inside!\n\nThey scramble up into the cab.  GUTTIEREZ throws himself into the \ndriver's seat.  An ALIEN sprints at the crawler with bared teeth.  \nTHOMAS looses a shot, blasting it backward into a Pepsi sign.\n\n<b>THOMAS\n</b>Yo' momma, boneface!\n\nDE VRIES   (to Guttierez)\nC'mon, man; punch this cow!\n\nGUTTIEREZ fumbles at the ignition.  They keys are there.  He flips \nthem, and the engine GROWLS to life.\n\n<b>EXT.  RYUSHI STATION - CRANE CATWALK - DUSK\n</b>\n<b>PREDATOR-VISION.\n</b>From way up here, we've got an outstanding view of the humans running \nacross the platform...\n\nCrouching on a bright-yellow catwalk, BROKEN TUSK presses closed a \npanel on the small container balanced on his knee.  Inside it are rows \nof metal instruments with a pristine surgical quality about them.  \nBROKEN TUSK flexes his hand experimentally.  Satisfied, he clips the \nmedical kit onto his back before getting to his feet.\n\nStanding around him are several other PREDATORS.  All but one have \ntheir camouflage cloaks activated.  The SOUND of GUNFIRE way across the \nstation draws their attention...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nHIROKO and KAMEN bolt towards an external hatch, with KAMEN laying down \na field of covering fire on full-automatic.  The blaze of light from \nthe rifle's barrel abruptly stops.\n\n<b>HIROKO\n</b>What?\n\n<b>KAMEN\n</b>I'm out of ammo.  Get inside, get inside!\n\nHIROKO hears a HORRIBLE NOISE nearby.  A field of cows being \nslaughtered by machetes would sound like this.\n\n<b>HIROKO\n</b>They're in with the rhino!\n\n<b>EXT.  RYUSHI STATION - RHINO PEN - DUSK\n</b>\nAn ALIEN is SMASHED sideways into the one solid wall of the pen, \nbroadsided and instantly crushed by a ton of FRENZIED rhino.  It's \nyellow blood eats into the weighty quadruped, eliciting ANGUISHED \nBELLOWS of pain from the hapless creature.\n\nALIEN stingers slice through the air.  Rhinos try to bolt but are \nintercepted by inhumanly powerful forces.  It's wholesale carnage.\n\n<b>PREDATOR-VISION.\n</b>We're moving swiftly along the rooftops and surveying the melee below, \nlessening the distance with each second...\n\nSeveral indefinable FIGURES plunge into the fray, creating anarchy \nwithin the ALIENS' ranks.  The biomechanoids HISS with fury as the \nPREDATORS join battle against them...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nAn ALIEN hurls itself through the air and onto the speeding crawler's \nroof.\n\n<b>INT.  CRAWLER - DUSK\n</b>\nKER-CHUNK!  The cab's occupants react as the thin roof buckles \nslightly. Skeletal fingers SLICE through, RIPPING at the metal like a \ncan-opener.\n\n<b>DE VRIES\n</b>Jesus!\n\nTHOMAS raises his rifle and looses a fusillade of shots through the \nroof. One of them RICOCHETS off the interior, SHATTERING the \nwindscreen.  There's a THUMP from outside...\n\n<b>DE VRIES (CONT'D)\n</b>You got 'im!\n\nTheir triumph is short-lived.  Globules of yellow acid perforate the \nroof like Swiss cheese, dripping down on them.  GUTTIEREZ floors the \nbrakes.  The crawler swings through ninety degrees before SCREECHING to \na halt. \n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nCASSIE enters admin at a run.  Before, it was empty.  Now it's sheer \nchaos. She shoves her way through dozens of grim-faced people.  PARSONS \nis standing at a console, YELLING into his headset.\n\n<b>PARSONS\n</b>Seal everything now!\n\n<b>CASSIE\n</b>What's happening?\n\n<b>PARSONS\n</b>Cassie, thank Christ!  We're under attack.\n\n<b>CASSIE\n</b>We're what!?\n\nYork races in, SHOUTING above the clamor.\n\n<b>YORK\n</b>The son-of-bitches got into 'E' wing! They're ripping it apart!\n\n<b>PARSONS\n</b>Fuck!  Somebody get over there with some guns!  Now!\n\nCASSIE watches the scene unfolding on the banks of monitors.  PEOPLE \nmouthing unheard words into camera.  Bursts of STATIC.  Fleeting \nglimpses of nightmarish SHAPES darting across the picture...\n\n<b>CASSIE\n</b>How many of them are there?\n\n<b>PARSONS\n</b>Too many.\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - DUSK\n</b>\nGUTTIEREZ' group hurriedly exits the crawler.  A cloud of acrid smoke \nrapidly fills the cabin.\n\nDE VRIES   (coughing)\nMove it, man!\n\nThe dead ALIEN's corpse tumbles through the acid-eaten hole, falling \ninto the cab's rear seat and promptly burning through that as well. Not \nfar away across the platform, the massive doors to the auto-shop hanger \nare RUMBLING slowly closed...\n\nGUTTIEREZ   (shouting)\nHold the doors, hold the doors!\n\nThey don't hear him.  The doors seal with a BOOM of finality.\n\n<b>DE VRIES\n</b>Over there, on the right!\n\nTHOMAS sees the two ALIENS nimbly climbing the platform's edge.  He \nsqueezes off about five shots, managing to kill the FIRST ALIEN...\n\n<b>THOMAS\n</b>These bastards ain't so tough!\n\n<b>***************************\n</b>\n<b>***** PAGE 70 MISSING *****\n</b>\n<b>***************************\n</b>\nTHOMAS looks concernedly at GUTTIEREZ.\n\n<b>THOMAS\n</b>Is that thing working?\n\nGUTTIEREZ takes off the headset and scrutinises it closely.\n\n<b>GUTTIEREZ\n</b>Shit!  The casing's cracked!\n\nDE VRIES rips her headset off and urgently passes it to him.\n\n<b>DE VRIES\n</b>Use mine.  Channel twenty-six.\n\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nDespite their ferocity and weapons, it's clear that the small group of \nPREDATORS are being overrun by the ALIEN horde. \n\nBROKEN TUSK's shoulder cannon swivels automatically, blowing away \nanother attacker.  Hearing a distinctive SCREAM, he looks across the \nplatform.  One of the PREDATORS, it's camouflage cloak flickering \nintermittently, is trying to resist being dragged down into a duct.  \nThe two ALIENS in either side plunge their tail-stingers into the \nPREDATOR's body, making it CRY OUT in agony.\n\n<b>INT.  RYUSHI STATION - CORRIDORS\n</b>\nPumped up with adrenalin, KAMEN reaches an intersection and encounters \na harrowing tableau.  An ALIEN blocks his way on the other side of a \ncorridor bulkhead, holding a STRUGGLING MAN above the floor.  It's \npiston-like tongue shoots into the MAN's skull, spraying gore.\n\nThe ALIEN sees KAMEN, and it's mouth twists into a bloody SNARL.  Both \nKAMEN and the ALIEN lunge forward together, but KAMEN's got the edge by \na split-second.  He STRIKES a bright red switch and the overhead \npressure bulkhead SLAMS down and locks into place.  His breathing is \nheavy as he slowly backs away from the hatch...\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - DUSK\n</b>\nThe two ALIENS THOMAS killed must have been the scout party.  Others \nappear, more cautiously this time...\n\n<b>DE VRIES\n</b>Hurry up and figure that thing out, man!\n\nGUTTIEREZ is desperately trying to operate the tiny plastic \nmicroswitches on the headset with his fingernails.\n\n<b>GUTTIEREZ\n</b>What?\n\n<b>THOMAS\n</b>We've got company!\n\nTHOMAS brings his weapon to bear and pulls on the trigger.  He gets off \none shot, then nothing more happens.  He looks at the counter on the \nside.  It reads 'zero'.\n\n<b>THOMAS (CONT'D)\n</b>Shit, I'm dry!  You're up!\n\nDE VRIES raises her rifle.  She aims, and...\n\n<b>CLICK.\n</b>\n<b>DE VRIES\n</b>I'm jammed!\n\n<b>THOMAS\n</b>You're what?!\n\nShe works the manual slide.\n\n<b>DE VRIES\n</b>It's locked solid...\n\n<b>THOMAS\n</b>Quick, give me the clip!\n\nDE VRIES fumbles the ammunition clip from her rifle.  It falls from her \nhands onto a plastic overflow grate.  THOMAS leaps after it...about a \nsecond too late.  It slips through the narrow gap, gone for good.\n\n<b>THOMAS (CONT'D)\n</b>Oh, Lord!  Please, no!  Not now!\n\n<b>INT.  RYUSHI STATION - EXECUTIVE OFFICE\n</b>\nHIROKO enters her office at a run.  She crosses to an inset control box \non the far wall and presses a button.  Two exterior panels begin to \nslide closed behind the polycarbonate window.\n\nKERSMASH!  Fracture lines appear on the toughened plastic as it comes \nunder assault from the razor-edge tip of an ALIEN's tail.  In shock, \nHIROKO reflexively falls backwards onto the floor, scrambling away.  \nShe watches the creature precariously balancing on the this ledge \noutside, fighting against the closing shutters with simultaneously \nraining repeated blows on the window with it's tail.\n\nThe ALIEN leaps through the gap as the window gives way under the \nonslaught, showering splinters across the room.  The twin shutters \nsecure behind it, closing on the creatures tail in the process.  It \nHISSES in indignation and thrashes about.  Like a lizard, the segmented \ntail SNAPS in two.  The freed ALIEN staggers a little before gaining \nbalance, blood dripping from the laceration and penetrating the wooden \nfloorboards.  It sights HIROKO and hurls itself in her direction, an \nunstoppable killing machine...\n\n<b>HIROKO\n</b>Holo on!\n\nHer VOICE quavers so badly with fear and panic, it's a wonder the \ncomputer can recognize it.  FOUR NINJA SWORDSMEN promptly appear, \nforming a semi-circle between HIROKO and the ALIEN.  The ALIEN halts, \nconfused by this intrusion. It swipes at the pre-programmed holograms, \nbewildered by the lack of contact as it's claws pass through them.\n\nGaining on a few seconds of bought time, HIROKO flings herself towards \nthe PREDATOR spear lying forgotten nearby.  The ALIEN locks in on this \nsudden movement and charges through the holograms at her.  HIROKO \nGRUNTS, swinging the spear with her full strength...\n\nShe's no super-athlete, but the cutting edge's advanced metallurgy does \nthe job.  It slices half-way through the ALIEN's skull and sticks \nthere, spewing yellow fluid everywhere.  HIROKO beats a hasty retreat \nas the dying biomechanoid falls to the floor, fumbling at the lodged \nweapon...\n\n<b>INT.  RYUSHI STATION - CORRIDORS\n</b>\nHIROKO reels into the outside corridor.  She SHRIEKS as her shoulders \nare seized from behind...\n\n<b>KAMEN\n</b>Come on!\n\nHIROKO looks at KAMEN confusedly as he continues along the corridor.\n\n<b>HIROKO\n</b>That's the wrong way!\n\n<b>KAMEN\n</b>Detour.  Other way's blocked...\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - DUSK\n</b>\nBack outside, the ALIENS have sensed that something's amiss.  DE VRIES \nturns desperately to GUTTIEREZ.\n\n<b>DE VRIES\n</b>You got any slugs left?\n\nGUTTIEREZ looks down at the counter on his slung weapon.\n\n<b>GUTTIEREZ\n</b>Yeah.  Uh...\n\nDE VRIES rips the weapon off his shoulder.  GUTTIEREZ completes his \nsentence.\n\n<b>GUTTIEREZ (CONT'D)\n</b>...Seven.\n\nBLAM!  BLAM!  BLAM!  DE VRIES tries to make each shot count.  She \nsights an ALIEN crawling across the top of a group of cylindrical \nstorage containers. Draws a bead on the metal tank and fires...\n\nA molten ball EXPLODES outward, transforming the immediate vicinity \ninto a blazing inferno.  The ALIEN's body twists end-over-end, \nremaining immobile as it hits the deck.  A curtain of fire ripples \nacross the platform...\n\n<b>THOMAS\n</b>Yes!\n\nTheir victory is short-lived.  The other ALIENS crawl cautiously \nforward, flames licking their faces but leaving them unharmed.  We can \nclearly hear the HISSING of their internal jaws.\n\n<b>DE VRIES\n</b>Try again, man...\n\nThe headset in GUTTIEREZ' hand BLEEPS as it turns into the correct \nchannel. He YELLS into it...\n\n<b>GUTTIEREZ\n</b>Matt!  Open these damn doors right now, I'll ream your ass so bad these \nthings out here'll seem like the Easter Bunny in comparison!  Swear to \nGod!\n\nTHOMAS turns and hammers on the impenetrable plate metal.\n\n<b>THOMAS\n</b>Open the doors!  Open the goddamned fucking doors!\n\nBLAM!  BLAM!  BLAM!  CLICK.  GUTTIEREZ' bullets are gone.\n\n<b>DE VRIES\n</b>That's it!  We're dead!\n\nThe first of the ALIENS rushes at them.  This is the end.  DE VRIES \n<b>SCREAMS...\n</b>\nThere's a blinding flash, and most of the ALIEN's head vaporises.  \nGUTTIEREZ blinks is disbelief as hazy SHAPES comprised of refracted \nfire suddenly occupy the killing ground between the HUMAN and ALIEN \nantagonists.  Intense bursts of light illuminate the platform as hi-\ntech PREDATOR weaponry far in advance of the humans' sears the air...\n\nGUTTIEREZ turns at the SOUND of the huge metal doors GRINDING slowly \nopen. Just enough for them to get through.\n\n<b>GUTTIEREZ\n</b>Move!\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP\n</b>\nTHOMAS pushes DE VRIES through the opening, with GUTTIEREZ hurriedly \nfollowing.\n\nThe Auto-shop is a large spacious workshop with three bays lining one \nwall. The front of a crawler pokes from one of them, while in the \ncenter of the room another crawler is raised above a maintenance-pit on \na hydraulic platform.  A handful of GREASE MONKEYS stands around the \ndoorway, brandishing power-tools in lieu of firearms.  A blonde surfer-\ntype with long straggly\nhair rushes over to them.  This is MATT, their savior.\n\n<b>MATT\n</b>Close it up, close it up!\n\nGUTTIEREZ stares through the narrow opening as the doors seal back up.  \nIn the midst of the flames, the ALIENS are fighting a pitched battle \ntooth-and-nail with their unseen opponents.  It's like a scene out of \nHell.\n\n<b>INT.  RYUSHI STATION - CORRIDORS\n</b>\nClusters of rotating emergency lights wig-wag above HIROKO and KAMEN as \nthey flee through the maze of long corridors leading to the Command \nCenter.  KAMEN is falling behind as they approach a junction.\n\n<b>HIROKO\n</b>Hurry it up.\n\n<b>KAMEN\n</b>Don't wait for me!\n\nHIROKO and KAMEN race along the final corridor leading to the Command \nCenter. Halfway down, KAMEN turns in response to a JARRING SOUND from \nthe rear.  The metal grating making up the floor is SMASHED violently \nfrom beneath.\n\n<b>KAMEN\n</b>Run!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nThe PANDEMONIUM from the outside corridors gets the attention of YORK \nand everybody else in admin.  He crosses to the bulkhead doorframe, and \nwhat he sees makes his eyes bug.\n\n<b>YORK\n</b>Jesus Christ!\n\nHe SHOUTS back into the crowded room.\n\n<b>YORK (CONT'D)\n</b>They're inside, inside the corridor!\n\n<b>INT.  RYUSHI STATION - CORRIDOR\n</b>\nHIROKO and KAMEN try to outrun the tidal wave of twisted and broken \nsteel that emerges in their wake.  KAMEN YELLS with fright as an ALIEN \nclaw pinions his ankle.  He trashes about, clutching at anything to \nprevent himself being dragged beneath the floor.  CRYING OUT is pain as \nslivers of edged metal slice into his hands...\n\nHIROKO  (anguished)\nNo!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nYORK stands frozen at the bulkhead frame, staring down the corridor in \nhorror.  CASSIE races up and pushes him out of the way...\n\n<b>INT.  RYUSHI STATION - CORRIDOR\n</b>\nHIROKO looks furiously around.  Spying an emergency axe in it's wall \nhousing, she SMASHES the glass with her elbow, cutting herself in the \nprocess.  HIROKO hefts the heavy tool, swinging it down onto the \ndisappearing ALIEN's carapace with all her might...\n\n<b>HIROKO (CONT'D)\n</b>Bastard!\n\nThe blade bites deep, and yellow blood bursts from the threshing \nALIEN's wound.  Speckles of it dot KAMEN's leg, eating through the \nmaterial of his trousers and into the skin and muscle beneath.  He \nSCREAMS, a sound of pure intense pain...\n\nHIROKO hurls the axe aside.  She begins pulling KAMEN out of the hole \nas the caustic liquid seeps into the nearby electrical conduit.  \nThere's a SPARKING, followed by a FLASH and a SHEET OF FLAME.  CASSIE \nsteps through into the corridor, just as valves evenly-spaced along the \nlength of the tunnel open up, jetting white high-density foam under \nextreme pressure.  The hatch to the Command Center at the far end \nbegins to close...\n\n<b>HIROKO\n</b>Cassie...!\n\nCASSIE's head shoots around.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nYORK seizes a metal chair from behind a nearby console and wedges it \ninto the narrowing divide.  CASSIE squeezes through the gap and \nurgently HOLLERS to HIROKO...\n\n<b>CASSIE\n</b>It you don't... uh!... move your ass, you're gonna need a helluva diet \nto get through here!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nfrom CASSIE's P.O.V. we watch HIROKO supporting KAMEN and stumbling him \nalong.  Foam fills three-quarters of the corridor to their rear and is \nnearly up to their knees everywhere else.  The chair's frame CREAKS \nominously in protest...\n\n<b>YORK\n</b>Hurry up, we're losing it!\n\nCASSIE's eyes widen in terror...\n\n<b>CASSIE\n</b>Behind you!\n\nHIROKO turns to see the long, phallic head of an ALIEN emerge \nmomentarily from out of the foam.  Something yanks at KAMEN and he \ndisappears beneath the surface with an expression of pained surprise...\n\n<b>HIROKO\n</b>Kamen!\n\nHIROKO starts to thrash at the foam, but CASSIE reaches out and drags \nher away.\n\n<b>CASSIE\n</b>It's too late!\n\n<b>HIROKO\n</b>Nooooo!\n\nThe chair begins to buckle, collapsing in on itself...\n\n<b>YORK\n</b>It's going!\n\nWith a supreme effort, CASSIE yanks HIROKO through the gap.  YORK \nvaults clear as the chair SNAPS in two, leaving the bulkhead to THUNDER \nclosed. The two women collapse in a heap on the floor.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - DUSK\n</b>\nThe battle outside is going badly for the PREDATORS.  There's only \nthree of them left, and one is BROKEN TUSK.\n\nA projectile WHISTLES through the air towards an ALIEN, expanding in \nflight into a wire capture net.  Barbed tips on each corner bite into \nthe wall of a base module, trapping the enraged creature.  Small motors \nWHINE as the thin metal pulls inward, slicing into the ALIEN's body...\n<b> \n</b>The PREDATOR savors the scene for just a second...which is a second too \nlong. ALIENS are all over him, clawing and ripping at his body.  The \nshoulder-mounted plasma-cannon is unceremoniously yanked away and \nCLATTERS to the floor.\n\nThe PREDATOR goes down, groping for the self-destruct system on his \nwrist. He manages to stroke a fingernail across the activation bar, but \ngets no further.  An ALIEN pounces at him, it's tail descending.  The \nPREDATOR raises his arm in reflex, but the stinger SMASHES straight \nthrough the buries it in his face-plate, taking out the wrist-computer \nin the process.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nHIROKO stares at the closed bulkhead with an expression of dazed \ndisbelief.\n\n<b>PARSONS\n</b>Miss Noguchi?\n\nNo reaction.  He tries again.\n\n<b>PARSONS (CONT'D)\n</b>Miss Noguchi!\n\nHIROKO snaps out of it.  She crosses over to the bank of monitoring \nscreens.\n\n<b>HIROKO\n</b>What's the story?\n\nPARSONS runs through each of the screens.\n\n<b>PARSONS\n</b>Everything on this module is locked and sealed.  We've lost 'B', 'C', \nand 'E' wings, but 'E' was the only one we didn't manage to totally \nevacuate.\n\n<b>HIROKO\n</b>How many... how many people are missing?\n\n<b>CASSIE\n</b>Unconfirmed reports of eighteen or so far, but the numbers are all over \nthe place.\n\n<b>HIROKO\n</b>What's our weapons situation?\n\nDRISCOLL - a big guy with a beard - LAUGHS curtly.\n\n<b>DRISCOLL\n</b>Shit!  Our armory's a big blue box from the back shelf of stores.  We \ngot about two clips left for an autoloader, and that's it.\n\n<b>HIROKO\n</b>Auto-shop?\n\n<b>CASSIE\n</b>Auto-shop's sealed, but those boys are cut-off.\n\n<b>HIROKO\n</b>Has anybody talked to them?\n\n<b>CASSIE\n</b>Not yet.\n\n<b>HIROKO\n</b>Do it.\n\n<b>EXT.  RYUSHI STATION - ROOFTOPS - DUSK\n</b>\nBROKEN TUSK and the other PREDATOR scramble up onto the rooftop in a \nbid to escape their unstoppable opponents.  Back-to-back, they take up \nfighting positions.  A few seconds later, the first of the ALIENS \narrives.\n\nBoth the PREDATORS' shoulder cannons blaze, firing volley-after-volley. \nStill the ALIENS keep on coming, finally reaching the point where it's \nhand-to-hand...and nothing else.\n\nIt's a vicious, fast, and bloody on both sides.  BROKEN TUSK takes \nflight; his companion is not as lucky.  The other PREDATOR kicks an \nALIEN from him and over the roof's edge.  The ALIEN lashes out with \nlightning-fast reflexes, pulling the PREDATOR with it.  Both creatures \nhurtle downward and hit a nest of cabling stretched across from one of \nthe modules.  Caught like flies in a spider's web.  Both thrash about, \nsevering cables as they do.  Electrical sparks CRACKLE through the \nair...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nEverything electrical in the Command Center flickers momentarily, and \nthe bank of monitors turn to static.  There's an instant of silence \ncollective concerns amongst those gathered there.\n\n<b>DRISCOLL\n</b>What the hell...?\n\n<b>PARSONS\n</b>Don't panic, people.  We've just switched over to internals.\n\n<b>HIROKO\n</b>They knocked out the external feeds.\n\n<b>PARSONS\n</b>Looks like it.\n\n<b>CASSIE\n</b>Thirty six hours?\n\nPARSONS nods.\n\n<b>PARSONS\n</b>Give or take.\n\n<b>CASSIE\n</b>We're not gonna make it, are we?\n\n<b>HIROKO\n</b>Get the auto-shop on-line.\n\nPARSONS shakes his head.\n\n<b>PARSONS\n</b>Communications to auto-shop go through an F.O. link off the main trunk.  \nThat's down with the other feeds.\n\n<b>HIROKO\n</b>Well... try the headset.\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP\n</b>\nSpirits are low in the auto-shop.\n\n<b>MATT\n</b>I'm tellin' you, it's impossible.  Nothing can grow and reproduce this \nfast.\n\n<b>THOMAS\n</b>Yeah.  Right.  You wanna go outside and tell them that?\n\n<b>DE VRIES\n</b>What's keeping those fucking Marines, man? They should'a been here by \nnow!\n\nTHOMAS lashes out at an empty can, kicking it noisily across the floor.\n\n<b>THOMAS\n</b>Maybe they ain't coming.  Maybe they don't even know we've got \nproblems...\n\n<b>GUTTIEREZ\n</b>I don't wanna hear that kind of crap, Thomas.  They're coming.  Just a \nmatter of time, that's all...\n\nGUTTIEREZ' headset lies nearby.  PARSONS muted VOICE comes out of it.  \nOne of the GREASE MONKEY's snatches it up and listens.\n\n<b>GREASE MONKEY\n</b>Yo!  Guttierez!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\n<b>PARSONS\n</b>Through now.\n\n<b>HIROKO\n</b>Jan, it's Hiroko.  What sort of shape are you in down there?\n\nGUTTIEREZ   (O.S., on speaker)\nPretty damn good shape, considering.  You can tell Don Kamen from me \nhis people have got balls of steel.\n\n<b>HIROKO\n</b>Kamen didn't make it, Jan.\n\nThere's a pregnant PAUSE from the speakers.\n\n<b>HIROKO (CONT'D)\n</b>Jan?\n\nGUTTIEREZ   (O.S., on speakers)\nYeah.  I... we're still here.  We're all... uh... all sorry to hear \nthat.\n\n<b>HIROKO\n</b>Can you make it back?\n\nGUTTIEREZ   (O.S., on speakers)\nUh... I'd say that was a negative.  If we open the doors, those things \nare gonna swarm inside.  There's another problem, too.\n\n<b>HIROKO\n</b>What's that?\n\nGUTTIEREZ   (O.S., on speakers)\nDe Vries put a round through the storage tanks over by the west pier on \nthe way in here.  Right now, the stuff sprayin' out is just burnin' up, \nbut if we get a blow-back, a good part of the station could go with it.\n\n<b>CASSIE\n</b>Oh, man...\n\n<b>HIROKO\n</b>Alright, let's keep calm.  We've got to have an option of some sort... \nthere's got to be a way out of this.\n\n<b>YORK\n</b>Oh yeah?  Like what?\n\nYORK's kept quiet, but everyone turns to him now.  His tone is scathing \nand cuts to the marrow.\n\n<b>CASSIE\n</b>Well, what about those other things outside; those warriors?  Maybe we \ncan cut some kind of deal...\n\nYORK looks around at them in incredulous disbelief.\n\n<b>***************************\n</b>\n<b>***** PAGE 84 MISSING *****\n</b>\n<b>***************************\n</b>\n<b>INT.  RYUSHI STATION - AUTO-SHOP\n</b>\nMATT walks nervously around, holding the headset.  Everybody's eyes are \non him.\n\n<b>MATT\n</b>Well, it occurred to me that we could use the overhead crane to load \nthe admin module onto the back of Big Bertha.  That way we could put a \nbit of distance...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nMATT (CONT'D)   (O.S., on speakers)\n...Between us and the station.  Least 'till the guys from Fort Powell \narrive.\n\n<b>HIROKO\n</b>That sounds promising.  Can we operate the crane from here?\n\n<b>DRISCOLL\n</b>Nah.  It's got programmable facilities, but it was never rigged for \nremote operation.  Someone'd have to go up to the cab to get it up and \nrunning.\n\n<b>HIROKO\n</b>Which mean physically going outside.\n\nDRISCOLL looks around uneasily.\n\n<b>DRISCOLL\n</b>Yeah.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER - LOWER DECK\n</b>\nA small group of people, most of whom we saw in the Command Center, are \nclustered around a section of the poorly-lit maintenance corridor.  \nHIROKO's wearing a black hi-tech catsuit, a fetishist's dream.  Across \nher shoulder is a pistol in a slung bandolier holster.  She nods at a \npile of clothing in DRISCOLL's hands.\n\n<b>HIROKO\n</b>Is this the suit?\n\n<b>DRISCOLL\n</b>Uh-huh.\n\nShe takes it from him.  Slides her legs into the bottom half and pulls \nit up.  YORK watches with an expression of incredulity etched on his \nface.\n\n<b>YORK\n</b>This is fuckin' lunacy!  You're not gonna make it across the platform \non foot!\n\n<b>CASSIE\n</b>Shut up, York.\n\n<b>HIROKO\n</b>No, he's right.  Has anyone got a bike near here?\n\nA REDHEADED GIRL looks around hesitantly, then raises her voice.\n\n<b>REDHEADED GIRL\n</b>I have.\n\n<b>HIROKO\n</b>Let me have the keys.\n\nThe GIRL rummages in her pockets and throws the keys over.  HIROKO puts \nthem in a pocket on the suit's sleeve.\n\n<b>HIROKO (CONT'D)\n</b>Which one is it?\n\n<b>REDHEADED GIRL\n</b>Uh... the Hyundai racer.  Yellow and black stripes.\n\n<b>YORK\n</b>Oh, yeah.  Real inconspicuous...\n\n<b>HIROKO\n</b>Listen, I don't care if it's pink and purple polka-dots as long as it \ngets me there in one piece.  Somebody loan me a headset.\n\nCASSIE pulls off hers and hands it over.  DRISCOLL's watching HIROKO \nfasten up the suit.  He spots a mistake.\n\n<b>DRISCOLL\n</b>No, go back.  Second clasp from the bottom.\n\nHIROKO finds the offending clasp and locks it.\n\n<b>HIROKO\n</b>How much air-time have I got?\n\n<b>CASSIE\n</b>About thirty minutes.  Those are slimmed-down tanks, so no stopping to \nadmire the scenery.\n\n<b>HIROKO\n</b>Deal.\n\n<b>CASSIE\n</b>We've dumped the whole data-base from one of the cleaning remotes into \nthe helmet. It'll project the route through the sewer system onto the \ninside of the glass as you go.\n\n<b>DRISCOLL\n</b>Yeah, I stripped down a motion tracker and hardwired it through to the \nhelmet pick-ups, too.  That's also on the display.\n\n<b>HIROKO\n</b>Sounds great.\n\n<b>PARSONS\n</b>It's not all good news.  We had to take off the helmet lights.  You'll \nbe going in blind.\n\n<b>HIROKO\n</b>What?  Why?\n\n<b>DRISCOLL\n</b>We had to.  They were just too cumbersome for some of the conduits \nyou're gonna have to negotiate.  Besides, all the crap floating around \nreduces visibility to the extent where I doubt having helmet lights \nwould have make that much difference, anyway.  Maintenance lights down \nthere oughta be enough to do the trick.\n\n<b>HIROKO\n</b>How tight are these shafts?\n\nCASSIE and DRISCOLL exchange worried looks.\n\n<b>CASSIE\n</b>Tight.  We chose a route we felt would reduce the chance of you running \ninto any Aliens.\n\nHIROKO takes a deep breath.  Beads of perspiration dot her forehead.  \nPARSONS nods.\n\n<b>PARSONS\n</b>There's still time to back-out.\n\n<b>HIROKO\n</b>Forget it.  I wouldn't ask somebody to do something I wouldn't do \nmyself.  Where's the disk?\n\nPARSONS hands over a vinyl-wrapped packet.\n\n<b>PARSONS\n</b>Don't lose it.\n\nHIROKO slips it into a breast-pocket and secures the flap.\n\n<b>HIROKO\n</b>Don't worry.  I won't.\n\nDRISCOLL hands several metallic objects to HIROKO.\n\n<b>DRISCOLL\n</b>Here.  If you got to use 'em, make 'em count.\n\nThey're magazines for her gun.  She slots them into the bandolier.\n\n<b>HIROKO\n</b>Thanks.\n\n<b>PARSONS\n</b>Let's just run through it one more time so I know you've got it \nstraight.\n\n<b>HIROKO\n</b>Okay, I pull the access panel off of the console.  Insert the disk, and \npress the green enabling button...\n\nPARSONS   (interrupting)\nNo.  There's two of them.\n\nShe pulls on the zip and begins locking the harness clasps into place.\n\n<b>HIROKO\n</b>Sorry.  Two green enabling buttons...\n\n<b>PARSONS\n</b>Right.  When you've done that, don't waste any time getting out of \nthere.  Once that crane starts moving...well, it's bound to provoke \nsome kind of response.\n\nYORK hands over a sophisticated-looking power-tool.\n\n<b>YORK\n</b>You'll need this for the gratings. Trigger finger to operate, thumb \nbutton to switch over to the rivet gun.  The sensors'll choose blade or \nsocket heads automatically.\n\n<b>HIROKO\n</b>Right.   (long beat)   Okay, I'm set.\n\nYORK and DRISCOLL lower the massive dome-fronted helmet over HIROKO's \nhead. Auto-clasps lock into place as it brackets with the collar.  \nPARSONS clips the slimline air-tank to her back, and DRISCOLL makes the \nconnections. \n\n<b>PARSONS\n</b>Alright, let's open her up.  Carefully, now...\n\nCASSIE and the others hold their weapons and motion-trackers steadily \nat a fixed point on the ground.  Two ONLOOKERS bend down to the \npressure-hatch beneath the floor-grating.  It's identical to the one \nDILLER and URIOSTE removed earlier.  A plume of pressurised gas jets \ninto the air, and they pull the metal sealing-plug free.  CASSIE \nscrutinizes her tracker...\n\n<b>CASSIE\n</b>All clear...\n\nHIROKO reaches up to her helmet and presses a chunky button on one \nside.\n\nHIROKO's P.O.V.\nWe're looking through the transparent bowl of the helmet at the open \nshaft, braken water SLOSHING around it's rim.  Superimposed lines of \nglowing neon appear on the visor's surface, a precisely overlaid \nduplication of the scene in computer-graphic form.  A flatly-\nsynthesised male\n\nCOMPUTER VOICE comes over the helmet speakers, O.S.\n\nCOMPUTER VOICE   (O.S., on speakers)\nApproaching 'A' module lower level venturiduct DS Oh-four...\n\nHIROKO gets down on her hands and knees and crawls towards the opening.  \nShe stares at the murky water with mounting apprehension.  Tries to \nreassure herself.\n\n<b>HIROKO\n</b>Okay.  Okay.\n\nShe looks around at the impassive, staring faces.  Summoning up her \ncourage, she submerges the helmet...\n\n<b>HIROKO'S P.O.V.\n</b>The pale illumination of the lower level deck-lights gives way to \nabsolute nothingness; a stygian nightmare.  She SHUDDERS with horror \nand pulls her head free.\n\n<b>HIROKO (CONT'D)\n</b>Oh...!  Oh, God...\n\nShe WIPES frenetically at the slickly-coated visor, breathing heavily. \nWorried hands grab her.\n\n<b>CASSIE\n</b>Are you alright?\n\n<b>PARSONS\n</b>What?  What's wrong?  What is it?\n\nHIROKO's eyes dart around, speaking volumes.  She swallows hard and \ncalms down.\n\n<b>HIROKO\n</b>It's alright.  I'm okay.\n\nSteeling herself, she takes a deep breath and plunges headfirst into \nthe water once more...\n\nHIROKO's P.O.V.\nEverything goes to blackness again.  The head-up-display presents a \nview of the unseen tunnel in cheerful candy-apple hues.\n\nCOMPUTER VOICE   (O.S., on speakers)\nEntering venturi duct, en route to secondary overflow sump DS oh four \nslash eleven...\n\nYORK watches HIROKO's feet disappear into the shaft.\n\n<b>PARSONS\n</b>Seal it.\n\nThe heavy sealing-plug is dragged across the grating and positioned \nover the hole.  YORK shakes his head.\n\n<b>YORK\n</b>Suicide run, man.  Fuckin' suicide run.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - VENTURI DUCT\n</b>\nCASSIE wasn't kidding about the venturi-duct.  It's only about half-\nagain as wide as HIROKO.  The only illumination comes from the hazy \ncircle above.  As the plug reseals the hole, even that's gone.\n\nSomething flickers.  Two weak fluorescent tubes come on, lighting the \nmurk with a faint orange haze.\n\nCASSIE   (O.S. on speakers)\nAll the comforts of home.\n\n<b>HIROKO\n</b>Thanks, Cassie.\n\nCASSIE   (O.S., on speakers)\nDon't mention it.\n\nShe inches her way through the narrow space towards us, breathing \nheavily. The CLICKING of the motion-tracker in her helmet is \noverwhelming in the  silence...\n\n<b>EXT.  RYUSHI STATION - ANTENNA ARRAY - NIGHT\n</b>\nThe station's massive antenna array is being transformed.  Otherworldly \nshapes comprised of surreal creatures and protrusions are starting to \ncover it's surface.  ALIENS drop from dizzying heights, exuding streams \nof gelatinous gunk from the four 'exhaust' pipes on their backs.  \nThey're building a nest of staggering proportions.\n\nUnnoticed by the busy biomechanoids, faint sparks flicker from the \ncrane catwalk high above...\n\n<b>EXT.  RYUSHI STATION - CRANE CATWALK - NIGHT\n</b>\nBROKEN TUSK sits on the catwalk floor, a small shower of sparks \nlighting his face.  He's attempting to repair his broken wrist computer \nwith an intricate tool.  He removes it and presses a switch.  The \ndisplay glows briefly, then fades.  He inserts it again.  Electrical \nsparks CRACKLE across the computer's fascia, before burning out.  \nBROKEN TUSK throws the ruined machine away in disgust.\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP\n</b>\nFrom our P.O.V. high up near the roof of the auto-shop we see THOMAS \nsitting on the raised hydraulic platform.  He GRUNTS as he pulls a \nvalve on the crawler's underside.\n\nAcross the room, the second crawler RUMBLES out of the far bay.  One of \nthe GREASE MONKEYS walks slowly backwards, waving it on.\n\n<b>GREASE MONKEY\n</b>Okay.  Back.  Back.  Little bit more...\n\nHe steps into a pool of slippery residue and loses his footing.\n\n<b>GREASE MONKEY (CONT'D)\n</b>Whoa...shit!\n\nThe man crouches and runs a finger through the colorless goo on the \nfloor. Scowls first, then frowns.  It's sticky.\n\nOver near the doors, MATT exhales deeply on a cigarette.  DE VRIES is \nnearby, listening attentively as GUTTIEREZ gets a message on his \nhelmet.\n\n<b>GUTTIEREZ\n</b>She just set off!\n\nMATT claps his hands together - just once - to get everybody's \nattention.\n\n<b>MATT\n</b>Okay, people.  Let's hustle...\n\nThere's a SCREAM from behind.  They wheel around in time to see the \nGREASE MONKEY being tugged into the maintenance opening.  THOMAS yells \ndown from the platform.\n\n<b>THOMAS\n</b>They're comin' up through the pit!\n\nA box with two large buttons - one green, one red - dangles from the \nceiling on the end of a cable.  MATT forces down the red control, \nmaking the platform lower.  Several tons of machinery and crawler bring \nabout the demise of the ALIENS as they reach the lip of the opening, \nCRUSHING their chitinous limbs to smithereens.\n\nAn ALIEN rolls out of the pit in time, scrambling for the safety of the \nnearby shadows.  DE VRIES sights it.\n\n<b>DE VRIES\n</b>Over there!\n\nOne of the MEN has seen it.  His head snaps up to a mammoth engine-\nblock suspended from a winch high above.  He LEAPS for the release-\ncatch as the ALIEN passes underneath.  Pulls hard on the grip.  Chains \nRATTLE noisily as the block THUNDERS down.  The ALIEN begins to look \nup, just a second too late.  The heavy piece of machinery SMASHES into \nthe creature, flattening it instantly.\n\nUnseen by anybody, another ALIEN has escaped to the roof of the \nplatform-bound crawler.  It wraps it's long, bony fingers around the \nface of the MAN, stifling his CRIES and pulling him off the deck.  The \nLOUD CLATTERING of his chainsaw bouncing off the floor-grating gets \nTHOMAS' attention.\n\n<b>THOMAS\n</b>Mother-fucker!\n\nTHOMAS retrieves the fallen tool and jams the 'on' switch hard.  The \nALIEN's tongue shoots through the GREASE MONKEY's skull, showering \nTHOMAS with a faint speckling of blood.  The ALIEN discards the body \nand lunges at THOMAS, who counters bringing the chainsaw up.\n\nThe blade slices into the creature's throat, and up through it's head. \nTHOMAS draws out the chainsaw quickly.  Something happens to the PITCH \nof the blade, a peculiar sound...\n\nThe acid eats through the links of the chainsaw band.  Like a metallic \nsnake, it WHIPS off it's supporting frame.\n\nStraight at THOMAS.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - VENTURI DUCT\n</b>\nHIROKO elbows her way further through the cramped water-filled duct.  A \nwide grille directly in her path blocks further headway.\n\nHIROKO'S P.O.V.  Green neon flashes in her display, with accompanying \nnotations.\n\nCOMPUTER VOICE   (O.S., on speakers)\nProgress to secondary overflow sump DS oh-four slash eleven impeded.  \nGrating must be removed to facilitate entry...\n\nHIROKO   (into headset)\nOkay, I'm at the first access grate.\n\nCASSIE's VOICE is a little less clear now, with traces of STATIC \ndrifting in...\n\nCASSIE  (O.S., on speakers)\nCopy that.  Be careful, now.\n\n<b>HIROKO\n</b>You betcha.\n\nShe places the tip of her power-tool over the first of the grille's \nanchoring bolts.  The complex mechanism WHINES as it selects the \ncorrect wrench-tip for the job...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPARSONS races up to the GIRL manning the communication console.\n\n<b>PARSONS\n</b>What is it?\n\n<b>GIRL\n</b>Auto-shop.\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP- CRAWLER CABIN\n</b>\nTHOMAS is laid-out in the back seat of the crawler's cab, with DE VRIES \nand MATT trying to staunch the wounds from the chainsaw band's impact \nto his chest.  GUTTIEREZ speaks into his headset mike.\n\n<b>GUTTIEREZ\n</b>Rob?  We got problems.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - SUMP CHAMBER\n</b>\nTHUMP.  THUMP.  SLAM!  The grille in knocked out of it's housing and \nfloats lazily off into the water.  HIROKO passes through the newly-\ncreated hole.\n\n<b>HIROKO'S P.O.V.  \n</b>She finds herself in an upright cylindrical chamber, about five feet in \nheight.  Massive extractor fans churn dangerously where both the floor \nand ceiling ought to be.  Kicking up a swirl of particles.  Pale blue \nlight filters down from above.\n\nCOMPUTER VOICE   (O.S., on speakers)\nCaution!  Entering secondary overflow sump DS oh-four slash eleven.  \nGrating must be removed to facilitate entry to Central Reservoir...\n\nHIROKO   (annoyed)\nYeah, yeah, yeah...\n\nWith difficulty, she straddles the floor turbine.  A vortex of water \nswirls around her as she brings the power-tool up once more.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPARSONS listens attentively.  He CLICKS his fingers at CASSIE.\n\n<b>PARSONS\n</b>Where is she?\n\n<b>CASSIE\n</b>Comin' up the Central Reservoir.\n\n<b>PARSONS\n</b>Quick!  Run a trace on the culvert leading off the auto-shop \nmaintenance pit.\n\nCASSIE's all-business, immediately calling-up the base floor-plan files \non a monitor.\n\nPARSONS (CONT'D)  (into headset)\nIs Thomas gonna make it?\n\nGUTTIEREZ   (O.S., on speakers)\nUh...difficult to say.  I think...\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP\n</b>\nGUTTIEREZ looks on as MATT ties-off a bandage.\n\n<b>GUTTIEREZ (CONT'D)\n</b>...The chainsaw band might have punctured his lungs.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nCASSIE looks up, worriedly.\n\n<b>CASSIE\n</b>I found it...\n\n<b>PARSONS\n</b>And?\n\n<b>CASSIE\n</b>Drains right into the Central Reservoir.\n\n<b>PARSONS\n</b>Get her on-line.  Now!\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - SUMP CENTER\n</b>\nHIROKO's pulls her third bolt free.  It drifts slowly downward, \nslipping between the vanes of the floor turbine.\n\nA fragmented VOICE comes through on her headset, distorted beyond \nrecognition.  HIROKO's forehead knits together in concentration and \nannoyance.\n\n<b>HIROKO\n</b>What was that?  I don't copy.\n\nCLICK.  CLICK.  BEEP!  The routine sound of the motion tracker changes \nsuddenly.  HIROKO turns her attention from the task-in-hand to study \nthe tracker's helmet readout.  THREE NEBULOUS BLOBS have appeared from \noff-screen.  Heading straight for her position.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nCASSIE turns to PARSONS in frustration.\n\n<b>CASSIE\n</b>I can't reach her.  Too much signal break-up.\n\n<b>PARSONS\n</b>Keep trying!\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - SUMP CHAMBER\n</b>\nBEEP.  BEEP.  BEEP.  The signals pick-up speed the closer they get.  \nCASSIE's garbled VOICE isn't helping ease HIROKO's panic.  She looks \nwildly around the chamber.  The only way out the way she came in...\n\nCOMPUTER VOICE   (O.S., on speakers)\nAttention.  Removal of restraining bolts it necessary to facilitate \naccess to...\n\nHIROKO stabs the exterior helmet control.  The COMPUTER VOICE ceases, \nwhile the BEEPING from the tracker rises in both pitch and volume.  \nWhatever the signals are, they're almost on top of her...\n\nHIROKO turns to the narrow entry duct.  It's position makes it \nvirtually impossible to get back into.  She tries anyhow.\n\nBEEPBEEPBEEPBEEP!  A rush of displaced water flood into the chamber, \nflattening her against the wall.  DARK SHAPES THUNDER past the other \nside of the grille like express trains in the night...going away from \nHIROKO.  She twitches in fear and disbelief as the BLOBS on the monitor \nscreen recede and finally disappear.  The tracker's pitch returns to \nit's hollow CLICKING.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nBROKEN TUSK tries to be as unobtrusive as possible as he picks through \nthe aftermath of the battle down by the now-empty rhino pen.  He finds \nsomething. A PREDATOR face-mask, with a massive crack down one side.  \nHe turns it carefully over in his hands.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - CENTRAL RESERVOIR\n</b>\nHIROKO emerges from the water, a thin membrane of surface slime \nadhering to her helmet.  Blinded, she raises a gloved hand and wipes \nthe mucus away...\n\n<b>HIROKO'S P.O.V.  \n</b>She's inside the Central Reservoir, a long cylindrical concrete tunnel \nsome eighteen feet in diameter.  The water-level comes up about half-\nway.  What fills the remainder freezes her with revulsion...\n\nShe's found the main offshoot of the ALIENS' nest.  Glued into the \ncurved walls by a secretive resin as BODIES.  HUMANS, RHINOS, LEMURS.  \nOther ANIMALS.  Most are dead, their innards blown open.  The rest are \ncomatose, twitching occasionally.  Every square inch not containing \nbodies is filled with ALIEN EGGS.  It's like Hell for real.\n\nHIROKO reaches slowly up and reactivates her helmet readout. \n\nCOMPUTER VOICE   (O.S., on speakers)\n...Brrzzt.  Traversing Central Reservoir en route to platform venturi \ndust DS two-six.\n\nHIROKO's P.O.V.\nShe looks around and finds the exit point on the display. It's several \nfeet away.  Under the surface.  She wades swiftly through the water, \npassing beneath something that gives her cause to pause.  A large \nPULSATING BAG, about ten feet long and roughly ovular in shape.  It \nmight be translucent, but in this light it's hard to tell.\n\nHIROKO submerges.  Sure enough, there's the grille.  She raises the \npower-tool and starts extracting the bolts.  BZZZZ!  There's the first \none, no problem.  BZZZZ...BZZZZ!  The second and third are just as \neasy.  She goes for the fourth.  BZZZ...CHUNK.  Nothing happens.\n\n<b>HIROKO\n</b>Come on...\n\nShe bears down on the trigger again.  The motor's not running.  A tiny \ngreen LED flashes on the machine's side.  It's locked solid.  A \nmalfunction.\n\nCOMPUTER VOICE  (O.S., on speakers)\nAttention.  Removal of restraining bolts is necessary to facilitate \naccess to  venturi ducts.\n\nThere's only one recourse left to her.  She jams down the thumb \nbutton...\n\nKER-SLAM!  The force of the rivet-gun propels her backwards, her \ninternal suit-pressure making her rise to the surface.  She wipes the \nslime from her helmet yet again...\n\n...And finds herself staring at an ALIEN EGG, it's top cracking open in \nfour neat sections.  The FACEHUGGER leaps straight as her faceplate... \n\n...And misses, it's fingers failing to gain purchase on the slippery \ndome. HIROKO kicks away from the spindly creature as it orientates \nitself on the water's surface, it's powerful tail propelling itself \nback toward her.  It contracts on itself, preparing to leap.  HIROKO \nraises the power-tool,\nreflexively squeezing the trigger again and again.  Fat rivets RIP \nthrough the FACEHUGGER's body.  It writhes around on the water's \nsurface, a cloud ofyellow acid billowing outward from it.  HIROKO dives \ninto the water again. She rams the power-tool at the final bolt.\n\nBZZZZ!  It's out!  She levers-off the grille.  Forces herself into the \nconfined space beyond...\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - VENTURI DUCT\n</b>\nAnother poorly-lit shaft filled with murky water, though this one goes \nupwards on a diagonal slope.  HIROKO braces herself against the walls \nand begins to climb.\n\nCOMPUTER VOICE   (O.S., on speaker)\nTraversing venturi duct en route to platform surface.\n\nWHAM!  An ALIEN's head squeezes through the opening behind her.  It's \nclaw snakes in, groping blindly just inches from her feet.  She grits \nher teeth and puts more effort into her ascent.\n<b> \n</b>WALLPO!  It's hand closes around her leg, yanking her back.  She tries \nfrantically to gain purchase on anything.  She fails.  The ALIEN draws \nher nearer, it's other hand closing on the helmet's visor.  Fracture \nlines appear on the glass, followed by cracks.  Polluted water starts \nto flood in, while air-bubbles expand outward from the broken glass.\n\nHIROKO drives the power-tool at the ALIEN and mashes the trigger.  \nRivets penetrate the creature's endoskeleton, making it draw back.  A \nhaze of yellow blood spills out into the duct.  HIROKO pushes upward, \ncoughing.  She closes her fist around a lever above.  Pulls on it with \nall her might.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nInternal pressure forces the metallic plug out like a champagne cork.  \nIt hits the platform with a loud CLUNK.  HIROKO hauls herself from the \nshaft, trailing a cloud of smoke as the acid eats into her suit.  She \nthrows the helmet to the ground, SHATTERING the visor.  Yanks \ndesperately at the suit's release clamps, kicking the ruined garment \noff.\n\nAs promised, the yellow-and-black hoverbike is nearby.  HIROKO starts \ntowards it, then remembers the keys are in the sleeve pocket of the \nruined pressure-suit.  She drops to he knees and gingerly pokes through \nthe smoking pile of cloth.  Finds the flap, RIPS it open, and withdraws \nthe keys.\n\nSLAP!  A glistening wet claw emerges from the open hole.  HIROKO \nscrambles to her feet as the injured ALIEN pulls itself out.  She tears \nacross to the bike and rams the key into the ignition.  The turbines \nROAR to life, and it lifts smoothly into the air.  HIROKO pivots the \npowerful machine around, avoiding the creature's questing grasp.  \nLosing it's balance, the ALIEN SMASHES into the deck.\n\nHIROKO's guns the bike away, speeding along the platform.  The fire \nover by the auto-shop rages out of control, a column of black-and-\norange smoke rising into the air.\n<b> \n</b>A DARK FORM hurls itself at her from an overhead cable-support.  Yet \nanother ALIEN.  It lands awkwardly on the protruding front cowl of the \nhoverbike, gaining balance in an instant.\n<b> \n</b>HIROKO twists on her controls, trying to dislodge the creature by see-\nsawing the bike side-to-side.  The ALIEN's got a firm hold though, \ncrawling hand-over-hand towards her.  HIROKO releases her grip on both \nthrottles simultaneously.  Air-brakes cut in, and the bike SLAMS to a \nhalt.  The breath WHOOSHES out of HIROKO as her chest impacts with the \nsurrounding roll-bar. The ALIEN is even less fortunate; momentum hurls \nit back onto the concrete. HIROKO guns the engine again, and the \nleading-edge of the manta-shaped machine's aerofoil catches the rising \ncreature, neatly decapitating it. \n\n<b>EXT.  RYUSHI STATION - CRANE BASE - NIGHT\n</b>\nThe hoverbike GROWLS to a halt by the base of the crane.  HIROKO \ndismounts and draws her pistol.  Takes in the sheer height of the \nladder she's going to have to scale.  Thumbs her headset. \n\n<b>HIROKO\n</b>Okay, I make it to the crane.  You...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nEverybody in admin registers astonishment as her voice comes over the \nspeakers.\n\nHIROKO (CONT'D)  (O.S., on speakers)\n...Can all uncross your fingers.\n\nA WHOOP goes up.  Various hands are SLAPPED.\n\n<b>PARSONS\n</b>We copy, boss.  Nice going.\n\n<b>EXT.  RYUSHI STATION - CRANE LADDER - NIGHT\n</b>\nHIROKO's climbing the ladder.  She stops to catch her breath.\n\n<b>HIROKO\n</b>Yeah, well don't get too carried away; we're only halfway home.  \nTalk...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nHIROKO (CONT'D)   (O.S., on speakers)\n...To you shortly.  Noguchi out.\n\nPARSONS clicks his fingers to DRISCOLL.\n\n<b>PARSONS\n</b>Driscoll; you're up.\n\nDRISCOLL's moving even as PARSONS speaks.\n\n<b>DRISCOLL\n</b>I hear you...\n\n<b>EXT.  RHUSHI STATION - CRANE CATWALK - NIGHT\n</b>\nHIROKO reaches the top and sprints along the catwalk towards the \nControl Cab. She narrowly misses something metallic near the base of \nthe handrail.  If she'd taken the time to stop and look, she would have \nseen BROKEN TUSK's ruined wrist computer.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER - LADDER WELL\n</b>\nDRISCOLL flips open an access flap on one wall of the ladder-well.  \nPrinted on the inside is a set of instructions, with the following \nprinted boldly in red;\n\n<b>CAUTION!  EXPLOSIVE BOLTS - READ CAREFULLY!\n</b>\nHe traces his finger along a line of text.\n\n<b>INT.  RYUSHI STATION - CRANE CAB - NIGHT\n</b>\nHIROKO enters the cab at a run.  She flips a row of switches, and the \ncontrol board comes to life.\n\n<b>HIROKO\n</b>Access panel... access panel...\n\nShe finds it.  Gets her fingers in the groove and slides it out.  \nBeneath is a mini-disk drive with two buttons.\n\n<b>HIROKO (CONT'D)\n</b>Bingo.\n\nShe pulls the vinyl-wrapped packet from her catsuit pocket.  Carefully \nwithdraws the disk and slides it home.  Thumbs the first button, which \nglows an emerald green.\n\nThe board's flatscreen monitor lights up immediately.  HIROKO studies \nit for a moment, then presses her headset link.\n\n<b>HIROKO (CONT'D)\n</b>Okay, we're in business.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\n<b>PARSONS\n</b>Right.  Auto-shop, you all set?\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP - CRAWLER CAB\n</b>\nEverybody from Auto-shop is crammed into the two articulated vehicles. \nGUTTIEREZ sits in the driver's seat of the first crawler.  He glances \nout of the side window.  MATT gives him a 'thumbs-up' from the cab of \nthe second crawler.\n\nGUTTIEREZ   (into headset)\nSay the word, and you won't see our asses for dust.\n\n<b>INT.  RYUSHI STATION - CRANE CAB - NIGHT\n</b>\nHIROKO wipes a trickle of sweat from her forehead.  She poises her \nfinger over the second drive-button.\n\n<b>HIROKO\n</b>Alright.  Here we go...\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nEverybody in admin looks tense.\n\nHIROKO (CONT'D)   (O.S., on speakers)\nThree...\n\n<b>INT.  RYUSHI STATION - AUTO-SHOP - CRAWLER CAB\n</b>\nGUTTIEREZ leans forward.\n\nHIROKO (CONT'D)   (O.S., on headset)\nTwo...\n\n<b>INT.  RYUSHI STATION - CRANE CAB - NIGHT\n</b>\nHIROKO blinks as the sweat drains into her eyes.\n\n<b>HIROKO (CONT'D)\n</b>One...mark!\n\nShe stabs the drive switch.\n\n<b>EXT.  RYUSHI STATION - CRANE - NIGHT\n</b>\nSmoothly maintained engineering comes to life.  The enormous yellow \ncrane starts to move on it's track-rails.\n\n<b>INT.  RYUSHI STATION - CRANE CAB - NIGHT\n</b>\nThe control board monitor is suddenly awash with information and \nschematics...\n\n<b>HIROKO\n</b>Okay, I'm out of here!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\n<b>PARSONS\n</b>Blow those suckers, Driscoll!\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER - LADDER WELL\n</b>\nDRISCOLL raises a black device shaped like a cylinder with a handgrip \non the end.  Slots it into the mechanism beneath the flap and carefully \nturns it.  A tiny red LED comes on.\n\n<b>EXT.  RYUSHI STATION - COMMAND CENTER MODULE\n</b>\nComplex mechanical assemblies attach the module to it's supporting \npier-platforms.  There are a number of LOUD BANGS, similar to car \nengines misfiring.  Explosive bolts release the tethers.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER - LADDER WELL\n</b>\nDRISCOLL reports into his headset.\n\n<b>DRISCOLL\n</b>Bolts blown!\n\n<b>EXT.  RYUSHI STATION - CRANE CATWALK - NIGHT\n</b>\nHIROKO runs back across the catwalk.  She might have missed the \nPREDATOR's damaged computer before, but she doesn't this time.  Her \nfoot comes down on it and she slips.  The gun goes flying from her \nhand.  HIROKO watches in horror as it teeters on the catwalk's edge for \na moment...\n\n<b>HIROKO\n</b>No!\n\n...Then goes over.  She drops to all fours and peers over the side.  \nLuckily it's only fallen about four feet onto a dirty ledge.  She \nreaches out for it...\n\n<b>INT.  FIRST CRAWLER CAB\n</b>\nGUTTIEREZ pushes forward on the crawler's controls.  The head-up \ndisplay projected on the cab windscreen changes from 'NEUTRAL' to \n<b>'DRIVE'.\n</b>\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - NIGHT\n</b>\nThe two crawlers TEAR OUT of the auto-shop's opening doors, headlights \nblazing.\n\n<b>INT.  FIRST CRAWLER CAB - NIGHT\n</b>\nGUTTIEREZ braces himself as they speed on a collision course towards \nthe ditched crawler they left outside auto-shop earlier.\n\n<b>GUTTIEREZ\n</b>Shit!\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - NIGHT\n</b>\nKER-SMASM!  GUTTIEREZ' crawler rams the other vehicle off the roadway \nand through the platform safety barrier.  It balances precariously for \na second, until finally it's weight sends it plunging into the swamp in \na CACOPHONY of STRESSED METAL and CRUMBLING CONCRETE.\n\n<b>INT.  SECOND CRAWLER CAB - NIGHT\n</b>\n<b>MATT\n</b>Yee-haa!  Demolition derby, baby!\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - NIGHT\n</b>\nHolding the cracked mask to his face, BROKEN TUSK looks up at the \ngigantic crane moving against the night sky.\n\n<b>PREDATOR VISION.  \n</b>Although the helmet's nightsight is malfunctioning, it's still good \nenough to register the 'hot' infra-red shape of HIROKO on the catwalk.\n\nThe sound of the two crawlers hurtling across the platform gets BROKEN \nTUSK's attention.\n\n<b>EXT.  RYUSHI STATION - CRANE CATWALK - NIGHT\n</b>\nHIROKO gets a firm grasp on one of the railing rungs, anchoring \nherself. Stretches for the pistol with renewed determination.  She \nbrushes the barrel. Not good enough.  Tries again.  Success!  Her \nfingers curl around the weapon, and she tugs it upwards.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nThe two crawlers plunge into the curtain of flames spreading across the \nplatform.\n\n<b>INT.  FIRST CRAWLER CAB - NIGHT\n</b>\nDE VRIES YELLS at GUTTIEREZ over the ROAR of the flames.\n\n<b>DE VRIES\n</b>Hotter 'n hell out there!\n\n<b>EXT.  RYUSHI STATION - CRANE BASE - NIGHT\n</b>\nHIROKO leaps the last few rungs from the moving crane onto the \nplatform.  She dashes towards the hoverbike, some thirty feet away.  \nWith no time to loose, she slides her boots into the foot-supports, \nwhich automatically WHIRR closed.  Gropes for the ignition key...\n\nBefore she's even located it, the hoverbike moves.  SCRAPING across the \nconcrete.  ALIEN claws appear around the edge of one of the bike's \nmanta wings.  She's parked the bike over a drainage exit!\n\nHIROKO SPINS the key and guns the engine.  The white-hot downblast from \nthe turbine exhaust SPLASHES across the SCREECHING ALIENS.  The vehicle \ntilts and KICKS forward.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nThe two crawlers emerge from the conflagration, scorched and trailing \nfire. In the BACKGROUND, the crane-hoist centers over the admin module.\n\n<b>CATWALK P.O.V., \n</b>looking straight down.  Four lasers scan quickly around the module's \nedges.\n\n<b>INT.  RYUSHI STATION - CRANE CAB - NIGHT\n</b>\nA blinking message on the crane's monitor screen:\n<b>POSITIVE MATCH.  COMMENCE LIFTING OPERATION.\n</b>\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - NIGHT\n</b>\nThe sound of SHREDDING METAL makes HIROKO look down.  An ALIEN is \nhanging on the underside of the bike!  She twists the throttle, \nreducing acceleration and causing the vehicle to drop several inches.  \nSparks shower the ground from where the creature makes contact with the \nroadway.  The ALIEN's determination is astounding.  It's tail SLAMS up \nthrough the alloy 'wing', anchoring it.\n\nThe biomechanoid starts to pulls itself up, shifting the bike's center \nof gravity.  She fights the controls, but finds herself swerving.  One-\nhanded, she takes aim.  BLAM!  BLAM!  She misses the ALIEN, rupturing a \nfuel pipe instead.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nThe crane's clamping mechanism closes around the admin module, locking \ninto place.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nCLANG!  Everybody reacts as the SOUND penetrates through the walls and \nECHOES around admin.\n\n<b>PARSONS\n</b>Okay, people.  Hold on tight...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nThe crane hoists the module aloft, free of it's umbilicals.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nPencils, disposable cups, and anything else not bolted down all roll \nfrom table-tops.  Most are grabbed by their owners.\n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - NIGHT\n</b>\nHIROKO's bike veers blindly around the corner of a building, with \nHIROKO still SHOOTING.  She looks up and her eyes widen.  Ahead is the \nout-of-control blaze.  A tongue of flame licks out across the platform, \ndirectly in her path.\n\nHIROKO slides the gun quickly into her shoulder-holster and ducks for \ncover behind the bike's windshield.  The ALIEN's head twists around, \nand they plunge into the inferno...\n\nWHOOMPH!  The liquid from the breached pipe ignites, trailing a plume \nof yellow flame.  HIROKO jams down on the foot-release and wrenches the \nsteering bar hard to the right.  She leaps for safety as the burning \nbike with it's ALIEN passenger crashes through the station's safety-\nrail and plummets into the swamp.\n\n<b>EXT.  RYUSHI STATION - PLATFORM RAMP - NIGHT\n</b>\nThe two crawlers THUNDER down the ramp.  GUTTIEREZ' vehicle pulls into \na tight right turn, while MATT's continues on it's course.  The crane \nwith it's underslug module continues to RUMBLE slowly forward. \n\n<b>EXT.  RYUSHI STATION - PLATFORM FAR SIDE - NIGHT\n</b>\nHIROKO mechanically tries to get up from the concrete roadway.  Winces. \nSomething hurts.  She looks down at the back of her left hand.  The \nskin has been scraped away. \n\nA DISTANT NOISE, something else being broken.  HIROKO turns.  Through \nthe conflagration, ALIENS are advancing.\n\n<b>EXT.  RYUSHI STATION - BIG BERTHA - NIGHT\n</b>\nGUTTIEREZ' smoldering crawler pulls-up alongside Big Bertha's titanic \nwheels.\n\n<b>INT. FIRST CRAWLER - NIGHT\n</b>\nGUTTIEREZ turns his head to one of the guys in the rear. \n\n<b>GUTTIEREZ\n</b>Take the wheel, Roy!\n\n<b>EXT.  RYUSHI STATION - BIG BERTHA - NIGHT\n</b>\nGUTTIEREZ and DE VRIES exit the crawler in a big hurry.  The moment \nthey're clear, the vehicle starts up and is gone.  DE VRIES is alert, \nthe tip of her rifle probing their surroundings.\n\n<b>DE VRIES\n</b>C'mon, man!  Let's shag it!\n\nGUTTIEREZ begins climbing the tall ladder running up to the Bertha's \ncab.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nHIROKO's running along the platform, pistol clenched firmly in hand.  \nShe thumbs her headset.\n\n<b>HIROKO\n</b>Rob, it's Hiroko.  Come in.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nCASSIE answers, holding on to the edge of her console.\n\n<b>CASSIE\n</b>Hiroko, it's Cassie.  What's...\n\nHIROKO's VOICE interrupts.\n\nHIROKO   (O.S., on speakers)\nI've lost the bike and I'm cut-off.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nHIROKO spins around the corner, pointing her gun cop-stance.\n\n<b>HIROKO (CONT'D)\n</b>If I can get to the chopper, I'll meet you at the rendezvous.  Don't \nwait for me.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\n<b>CASSIE\n</b>But...\n\n<b>EXT. RYUSHI STATION - PLATFORM - NIGHT\n</b>\nThe heli-jet pad's just up ahead.  The relief on HIROKO's face is \nenormous.\n\n<b>HIROKO\n</b>No 'buts'.  Just do it.  Noguchi out.\n\n<b>INT.  BIG BERTHA - NIGHT\n</b>\nGUTTIEREZ and DE VRIES pile inside the surprisingly cramped driver's \ncab. There's a seat up-front, with another behind a small control \nfascia pointing out-back.  DE VRIES hands over her rifle and slides \ninto the rear.  She flicks on an overhead light.  Taped to one side is \na black-and-white magazine cut-out of a naked male body-builder.\n<b> \n</b><b>DE VRIES\n</b>Nice buns...\n\nShe gives the control board a cursory once-over.  GUTTIEREZ calls back \nfrom his vantage point at the doorway.\n\n<b>GUTTIEREZ\n</b>Can you handle it?\n\nDE VRIES powers-up the console.\n\n<b>DE VRIES\n</b>Piece of cake.\n\n<b>EXT.  RYUSHI STATION - HELI-JET PAD - NIGHT\n</b>\nHIROKO runs towards the waiting heli-jet.  The flicker of an \nandrenalin-fueled smile plays on her face...the disappears.\n\nLike a scorpion scuttling over a rock, the ALIEN climbs up on top of \nthe grounded machine.  It's head turn towards her.  HIROKO starts to \nraise her pistol... then stops.  Other ALIENS are descending the nearby \nnavigation tower... straight for her.\n\nHIROKO turns tail.  She races over to a ladder running up the side of a \nbuilding and begins to climb.\n\n<b>EXT.  RYUSHI STATION - BIG BERTHA - NIGHT\n</b>\nThe shadow of the crane and it's cargo falls over Big Bertha's rear \nflatbed. Flashing warning strobes illuminate the twin hydraulic arms \nwhich rise up to meet it.\n\n<b>INT.  BIG BERTHA - NIGHT\n</b>\nDE VRIES twists on the 'waldo' controls operating the manipulator \nhands. \n\n<b>EXT.  SWAMP - NIGHT\n</b>\nALIENS rise up out of the swamp below, and start to scale Bertha's \nballoon tires.\n\n<b>INT.  BIG BERTHA - NIGHT\n</b>\nGUTTIEREZ fires a barrage down at the oncoming creatures.  He HOLLERS \nback to DE VRIES.\n\n<b>GUTTIEREZ\n</b>Move it baby, or they're gonna be chewin' on my cojones!\n\n<b>DE VRIES\n</b>Couple more seconds!\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - NIGHT\n</b>\nHIROKO takes flight across the rooftops with the ALIENS in pursuit like \na pack of dogs.  She vaults extractor intakes and retrofitted junk with \nease. So do the ALIENS.\n\nShe cuts across a conduit overpass bridging two buildings across the \nmain street, trying not to lose her footing.  Just before reaching the \nother side, HIROKO slips and falls to her knees.  Her headset drops \nthirty feet onto the concrete roadway.  Her hand rests on something \nred.  It's the cover for the explosive bolts connecting the conduit to \nthe building.  She scrambles onto the rooftop and flips over the hatch.  \nGlances up.  The ALIENS are already starting across.  She pulls the \nprimer cylinder out by it's handle.  Jams it into the detonator, and \nturns...\n\nShe's practically on top of the bolts.  The EXPLOSION is DEAFENING.  \nWith the clamp on this side free, the conduit falls into the street \nwith a SCREECH of twisted metal.  One of the ALIENS is pulverized by \nthe falling debris, but the others survive.  All HIROKO's managed to do \nis buy herself some breathing space...\n\nShe races across the building's roof.  Reaches the other \nside...straight into a dead end.\n\n<b>EXT.  RYUSHI STATION - BIG BERTHA - NIGHT\n</b>\nThe admin module locks onto Bertha's manipulator arms with a satisfying \nCLUNK.  Autocouplers slot into place, and the crane releases it's load.\n\n<b>INT.  RYUSHI STATION - COMMAND CENTER\n</b>\nThe connecting jolt is even greater then before.  Several larger \nobjects CRASH to the deck.\n\n<b>INT.  BIG BERTHA - NIGHT\n</b>\n<b>DE VRIES\n</b>That's it!  We've got it!  Get us out of here.\n\nGUTTIEREZ looses one last volley at the ALIENS.  He pulls the cab door \nshut, and throws himself into the driver's seat.\n\n<b>GUTTIEREZ\n</b>C'mon sweetheart.  Do your stuff...\n\n<b>EXT.  SWAMP - NIGHT\n</b>\nBertha's wheels GRIND to life, spilling ALIENS and crushing them under \nit's treads...\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - NIGHT\n</b>\nHIROKO's P.O.V.  It's a straight drop thirty feet onto concrete, with \nno ladders or any other way down.  She looks desperately around for \nanother avenue of escape.\n\nThe leering face of an ALIEN comes up over the roof's edge.  HIROKO \nswings her pistol over and fires.  It falls away...only to be replaced \nseconds later by two others.\n\nHer gun goes dry.  Quick as a flash, she ejects the spent magazine.  \nShe slaps the spare in and continues firing.\n\n<b>INT.  BIG BERTHA - NIGHT\n</b>\nBig Bertha's heading away from the base into the surrounding trees. \nGUTTIEREZ grits his teeth as they plunge towards the high branches. \n\n<b>GUTTIEREZ\n</b>Get down!\n\nDE VRIES hits the floor.  The thick boughs impact with the cab, \nSHATTERING the safety glass.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - NIGHT\n</b>\nBANG!  BANG!  BANG!  BANG!  CLICK.  HIROKO's gun's empty.  She reaches \nfor another clip on her bandolier...then realises that was her last \none.\n\nThe encircling ALIENS HISS triumphantly and close in.  With no place to \ngo, and no means of defending herself, HIROKO's a goner.  The lead \nALIEN's lethal double-barrel teeth open.  It's almost on her.  HIROKO \n<b>CRIES OUT...\n</b>\nWHOOSH!  The ALIEN's face is severed in half.  A circular metal object \nblurs through the air and loops back on itself, almost faster then the \nhuman eye can follow.  A massive form SLAMS down in front of HIROKO, \npushing her out of the way.  She hits the deck hard and gasps.  BROKEN \nTUSK is standing before her.  He skillfully catches the frisbee-like \n'smart weapon', then\nthrows it again.\n\nHIROKO watches with awe as the PREDATOR joins battle against the \nALIENS. HISSING ALIEN jaws are silenced by BROKEN TUSK's formidable \nfighting  technique.  Questing limbs are BLASTED and HACKED away by \nadvanced PREDATOR weaponry.  Acidic blood flows freely.  The skirmish \nis surprisingly brief.\n\nBROKEN TUSK and HIROKO stare at one another.  BROKEN TUSK pulls a slung \nmetal rod from his shoulder.  Two barbed tips SCHNICK outwards, forming \na spear. The PREDATOR looks at her, and his lip curls.  It takes a \nsecond for HIROKO to realise he's offering it to her.  Bewildered, she \naccepts it, pulling herself up.\n\nA bright orange ball of flame mushrooms up behind, getting both of \ntheir attentions.  BROKEN TUSK regards her.  His mandibles CLICK-CLACK \nnervously... \n\n<b>HIROKO\n</b>Look.  Don't take this the wrong way, but when I imagined the cavalry \ncoming to my rescue... they never looked like you.\n\nThe PREDATOR turns away, seemingly uninterested.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - NIGHT\n</b>\nAnother gout of flame BELCHES out of the churning mass in the middle of \nthe station.\n\n<b>EXT.  RYUSHI STATION - ROOFTOP LEVEL - NIGHT\n</b>\nHIROKO turns her recovered headset over in her hands. \n\n<b>HIROKO (CONT'D)\n</b>Broken.  Useless!\n\nShe throws it aside.  BROKEN TUSK stands beside her, keeping guard.  \nAnother DETONATION goes off behind, even LOUDER.\n\n<b>HIROKO (CONT'D)\n</b>Jesus.  I.C.C.'re gonna have to close the book on this place.\n\nShe SLAPS BROKEN TUSK on the arm.\n\n<b>HIROKO (CONT'D)\n</b>Come on, Butch.  Let's go.\n\nShe begins to walk away.  BROKEN TUSK crosses to the safety barrier, \npeering over the side...\n\n<b>HIROKO (CONT'D)\n</b>Hey!  I said come on!\n\nThe PREDATOR turns a deaf ear to her.  He gauges the distance below, \nthen throws himself off the platform's edge.\n\n<b>HIROKO (CONT'D)\n</b>What...?\n\nShe races across to the rail and gazes downward.\n\n<b>HIROKO'S P.O.V.\n</b>The PREDATOR wades through the swamp towards something she cannot see.  \nHIROKO looks around the platform.  She's suddenly very alone.\n\n<b>HIROKO (CONT'D)\n</b>Shit!\n\nShe crosses to a maintenance ladder and begins to descend.\n\n<b>EXT.  RYUSHI STATION - SWAMP LEVEL - NIGHT\n</b>\nHIROKO SPLASHES through the swamp towards the PREDATOR.  BROKEN TUSK \nhas paused before a culvert nestled within the shadows of the platform \npiers, running directly out into the swamp.  Most of the drain is \nunderwater, with only about eight inches protruding from the water.  \nThe thick metal grille covering it is mangled and twisted.  Broken from \nwithin.\n\n<b>HIROKO (CONT'D)\n</b>You've got to be joking.  No way am I going back in there!\n\nNo joke.  BROKEN TUSK starts submerging to get across inside.\n\n<b>HIROKO (CONT'D)\n</b>Hey!\n\nBROKEN TUSK pauses for a moment.  He gives her a look, then disappears \ninto the blackness.  HIROKO looks around.  It's no fun being the last \nperson left alive here.\n\n<b>HIROKO (CONT'D)\n</b>Goddammit!\n\nShe takes several deep breaths, then reluctantly follows...\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - CULVERT\n</b>\nHIROKO emerges within an air pocket inside the drain.  She shivers.  \nIt's just as dirty and cramped as she remembers.  Several of the \nmaintenance lights down here are broken, and visibility is minimal. \n\nHIROKO (CONT'D)   (quietly)\nWha...?\n\nBROKEN TUSK whirls, and clamps a hand across her mouth.  She gets the \nmessage.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - CENTRAL RESERVOIR\n</b>\nThey exit the culvert through another smashed grate.  HIROKO finds \nherself back in the Central Reservoir again.  She wades through the \nwater behind BROKEN TUSK, holding the spear above her head.  The two of \nthem look very vulnerable in here.  They pass beneath the PULSATING SAC \nHIROKO saw earlier. It looks riper now, ready to burst.  An INSIDIOUS \nPULSING NOISE - like a heartbeat - gains in volume the further they \ntravel.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nThey come out in a chamber some forty feet in height and dominated by \nan enormous pump.  ALIEN gunk covers everything.\n\nHIROKO gasps.  High above it a QUEEN ALIEN, nesting on top of the vast \nmechanism.  It's EGG SAC drapes around the pump; spiraling down around \nit. She seems to be asleep.\n\nBROKEN TUSK ignores the QUEEN.  His eyes are searching the multitude of \nforms - human and otherwise - cocooned into the walls.  He finds what \nhe's looking for.  Up on one wall is another PREDATOR.  Dead.  It's \nstomach blown open.\n\nHIROKO holds her spear tightly.  FACEHUGGERS pulse malignantly, wrapped \naround several trapped victims.  A number of empty EGGS are scattered \nhere-and-there.\n\nBROKEN TUSK looks around.  No ALIENS.  He begins climbing the organic \nfresco, watching the QUEEN ALIEN carefully for signs of awareness.  The \nbellows-like SOUND of her BREATHING is overwhelming.  He reaches the \nentrapped PREDATOR. It's left arm is encased in a solidified mass of \nsecreted resin.  BROKEN TUSK raises his 'smart weapon' and activates \nit.\n\nThe SPLINTERING NOISE makes HIROKO wince.  She glances up at the QUEEN.  \nIt's breathing start to change, and it's head moves...\n\nBROKEN TUSK sees it too.  He hesitates for a moment.  The QUEEN \nsettles, and her breathing goes back to normal.  BROKEN TUSK resumes \nhis work, chipping off the final chunk of coating.  He sheathes the \n'smart weapon', and flips open the other PREDATOR's wrist device.  He \nwithdraws the small manipulator device we saw earlier, and goes to \nwork...\n\nDOWN BELOW, HIROKO's backing away.  She doesn't see the arm coated in \nslime that grasps at her hair.  She shudders, stifling a SCREAM.  Her \neyes are wide as she turns...\n\nIt's KAMEN.  He's been embedded into the biomechanical frieze.  When he \nspeaks, his voice is wracked with pain and suffering.\n\n<b>KAMEN\n</b>Hiroko...\n\nHIROKO fearfully says something beneath her breath in JAPANESE.\n\nUP ON THE WALL, BROKEN TUSK has finished his task.  He slides the tip \nof a claw across the self-destruct mechanism.  It's readout display \nilluminates with alien characters.  He activates a button, and the \nreadout begins to blink...\n\nBELOW, KAMEN is talking to a sickened HIROKO.\n\n<b>KAMEN (CONT'D)\n</b>They...they snapped my legs to fit... fit me in here.  I \ndon't...remember what happened next.\n\n<b>HIROKO\n</b>What can I do?\n\n<b>KAMEN\n</b>I can... feel it moving around inside me. You've got to kill me.\n\n<b>HIROKO\n</b>I... I can't!\n\n<b>KAMEN\n</b>You have to...\n\n<b>HIROKO\n</b>No!\n\nBROKEN TUSK appears as HIROKO's shoulder.  He raises his right arm.  \n<b>SCHNICK! \n</b>The wrist knives slice outwards.  Red blood SPATTERS HIROKO's pale \nface. BROKEN TUSK grabs her arm roughly and pulls her away.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - CENTRAL RESERVOIR\n</b>\nBROKEN TUSK pushes HIROKO through the reservoir.  An ALIEN EGG on a \nnearby wall PEELS OPEN.  Before the FACEHUGGER even has a chance to \nspring, BROKEN TUSK swings his wrist-blades in a wide arc, cutting \nthrough the EGG and it's writhing contents.\n\nThe two of them reach the deep end and have to wade.  HIROKO pushes \nherself along the biomechanical outcropping.  Ahead of them is the \nPULSING SAC. Before they're even passed beneath it, they hear \nSOMETHING.  A SOUND like water-filled balloons hitting wet concrete.\n<b> \n</b>The SAC ruptures, spattering thick gloopy matter.  A form comprised of  \nslender limbs emerges from within.  An IMMATURE QUEEN ALIEN.  Though \njust-born, it's reflexes are razor-sharp.  It lashes out at HIROKO and \nBROKEN TUSK.  HIROKO ducks, and the QUEEN's claws embed themselves in \nBROKEN TUSK's shoulder, destroying his automatic cannon.\n\n<b>EXT.  RYUSHI STATION - PLATFORM - PRE-DAWN\n</b>\nA VAST EXPLOSION rips through the base, broiling clouds of flame \nrolling across the platform and seeping into the drainage ducts. \n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nColumns of fire jet from fissures and openings inside the Pump Chamber, \nrippling across the adult QUEEN ALIEN and her hapless victims.  She \nbegins to SCREAM, flailing around atop her metal throne... \n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - CENTRAL RESERVOIR\n</b>\nThe adult QUEEN's SHRIEK echoes through the reservoir, accompanied by a \nball of fire that travels part of the way down.  The IMMATURE QUEEN \nturns her head in reply, answering with her own YOWL.\n\nBROKEN TUSK HISSES with hate, and brings his 'smart weapon' SLICING \ndown through her arm, severing it at the wrist.  HIROKO simultanesouly \nDRIVES her spear into the ALIEN's chest.  She grabs the injured \nPREDATOR and pulls him away from the thrashing creature.\n\n<b>HIROKO\n</b>Come on!  Come on!\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nThe alien numbers on the PREDATOR self-destruct readout inexorably \ncount down...\n\n<b>EXT.  RYUSHI STATION - PLATFORM - PRE-DAWN\n</b>\nThe metal plug HIROKO blew during her earlier escape still lies to one \nside of the duct HIROKO and BROKEN TUSK crawl hastily out of.  \nFireballs are erupting all around now, making their situation \nprecarious. \n\n<b>EXT.  RYUSHI STATION - CRANE CATWALK - PRE-DAWN\n</b>\nFrom a vantage point high above, we see HIROKO and BROKEN TUSK racing \nacross the platform towards the heli-jet pad. \n\n<b>EXT.  RYUSHI STATION - PLATFORM - PRE-DAWN\n</b>\nBROKEN TUSK stumbles and falls.  HIROKO bends down to help him up, but \nthe PREDATOR shoves her away.  He doesn't want her assistance.\n\n<b>HIROKO\n</b>If you don't move your ugly butt, we're gonna end up barbecued!  Come \non!\n\n<b>EXT.  RYUSHI STATION - HELI-JET PAD - PRE-DAWN\n</b><b> \n</b>HIROKO runs towards the waiting heli-jet, with the PREDATOR close \nbehind. The landing pad is made up of an intricate series of grilles \ndesigned to deflect downward exhaust gases.  HIROKO's feet CLATTER \nacross the metal...\n\nKER-SMASH!  The metal is SMASHED from beneath, right in front of her.  \nThe IMMATURE ALIEN QUEEN has made is out of the sewer system and has \ngot the jump on them.  HIROKO's forward momentum won't allow her to \nstop running...she's too close.  Almost at the last moment, she jumps.  \nclaws brush her trouser leg, but close on thin air.  She hits the deck \nand quickly closes the last few feet to the chopper.\n\nBROKEN TUSK stops.  ALIENS are appearing all over the pad and out of \nnearby drainage ducts.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO slips into the chopper's pilot seat.  She flips a bunch of \nswitches and the turbines RISE in VOLUME from a LOW WHINE to a DULL \n<b>ROAR. \n</b>\n<b>EXT.  RYUSHI STATION - HELI-JET PAD - PRE-DAWN\n</b>\nAn orange ball of flame mushrooms up behind BROKEN TUSK.  With the \nALIENS blocking his path, there's no refuge for him. Almost.  The \nNavigation Tower looms overhead, nearby.  BROKEN TUSK takes a \ncalculated risk and LEAPS for it.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nThe heli-jet flies pretty much like a standard helicopter.  HIROKO \npulls-back on the collective, and the turbines' pitch changes from a \nTHROATY GROWL to a HIGH-PITCHED WHINE.\n\n<b>EXT.  RYUSHI STATION - HELI-JET PAD - PRE-DAWN\n</b>\nThe heli-jet rises, a little unsteadily.  The wash from the turbines \nplays across the SHRIEKING ALIENS.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO'S P.O.V.  Through the canopy dome, we see BROKEN TUSK climbing \nthe Navigation Tower, with the ALIENS close behind.\n\n<b>HIROKO\n</b>Okay, Butch.  I can play cavalry, too...\n\n<b>EXT.  RYUSHI STATION - NAVIGATION TOWER - PRE-DAWN\n</b>\nBROKEN TUSK scales the ladder as quickly as he can.  As the top of the \ntower is a gallery catwalk surrounding the flashing beacon array.\n\nThe IMMATURE QUEEN, accompanied by a phalanx of warrior ALIENS, is \nalmost upon him.  The PREDATOR drives his wrist knives into the throat \nof a grasping ALIEN, which falls downward, writhing.  It CRASHES into \nthe QUEEN, who almost loses her grip on the skeletal metalwork.  She \nHISSES, lashing out at the creature.  Sends it hurtling to the ground.\n\n<b>EXT.  RYUSHI STATION - TOWER CATWALK - PRE-DAWN\n</b>\nBROKEN TUSK makes it to the top.  There's not much space on the catwalk \nto maneuver.  He looks around, then down.  This is his last stand. \nInstinctively, he reaches down to his wrist for the self-destruct \ncomputer. Of course, it's not there.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nThe third row of digits on the alien destruct mechanism disappear.  \nTime's running out...fast.\n\n<b>EXT.  RYUSHI STATION - TOWER CATWALK - PRE-DAWN\n</b>\nBROKEN TUSK SMASHES his foot hard into the face of an ALIEN.  A BLAST \nof displaced air hits him like a sledgehammer.  He turns...\n\nHIROKO's heli-jet hovers stationary just a few feet away from the \ntower, the door on the co-pilot's side flapping open.  She HOLLERS at \nthe PREDATOR over the ROAR of the engines.\n\n<b>HIROKO\n</b>C'mon!  Jump!\n\nBROKEN TUSK looks down.  It's a long drop...but it's the best option \navailable to him.  He jumps.\n\nTHWACK!  His hands grip the door frame.  The heli-jet wobbles slightly, \nit's center of gravity shifting.  BROKEN TUSK hauls himself up and \nthrough the door as...\n\n...KER-BLAM!  A massive explosion mushrooms up from the base as the \nstorage tanks below ignite.  The shock wave buffets the chopper against \nthe tower.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nBROKEN TUSK's P.O.V.\nThe grinning face of the young QUEEN gets suddenly closer as the heli-\njet is propelled towards the metal structure.\n\n<b>EXT.  RYUSHI STATION - NAVIGATION TOWER - PRE-DAWN\n</b>\nCRUNCH!  The chopper hits, knocking several ALIENS from their \nhandholds.  One of the QUEEN's arms SHOOTS OUT, wrapping itself around \nthe port engine mount.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO pushes on the stick.  The heli-jet pulls away...then tilts \nviolently to one side, engines desperately trying to compensate.\n\n<b>EXT.  RYUSHI STATION - PRE-DAWN\n</b>\nThe QUEEN is hanging from the beleaguered craft, it's weight drawing it \nslowly down.  In the BACKGROUND, the Navigation Tower begins to slowly \ncollapse.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO wrestles the overtaxed controls.\n\n<b>HIROKO\n</b>Shit!\n\nBROKEN TUSK turns towards her.\n\n<b>HIROKO (CONT'D)\n</b>In the back!  In the back!\n\nThe PREDATOR may not understand her words, but he can follow the \nfrantic jerking of her hand.  He twists around to look in the chopper's \nrear.\n\n<b>EXT.  RYUSHI STATION - PRE-DAWN\n</b>\nHIROKO pilots the heli-jet over the station's storage tanks.  The \nconflagration below has gotten completely out-of-hand.\n\n<b>EXT.  CHOPPER - PRE-DAWN\n</b>\nThe QUEEN is starting to struggle up, it's arms flailing for purchase.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nBROKEN TUSK pulls out a pulse-rifle from the rear.  He quickly takes \nstock of it.\n\n<b>HIROKO\n</b>Watch your shots!  If you hit the engine you'll blow us both to hell!\n\nBROKEN TUSK goes for the trigger.  His index finger won't slide into \nthe trigger guard...it's too big!  He takes the guard in both hands and \nexerts pressure.  SNAP.  Problem solved.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nBLEEP!  There's only one set of digits left on the destruct device's \ndisplay counter.\n\n<b>EXT.  CHOPPER - PRE-DAWN\n</b>\nA red dot of light runs across the QUEEN's head.  She must sense it \nsomehow. Her head comes round to bear...\n\nBROKEN TUSK's got the pulse-rifle trained right on her.\n\n<b>BROKEN TUSK\n</b>Chew...on...this...!\n\nBLAM!  A round open a nice, neat hole in the QUEEN's head.  She YOWLS.  \nBLAM! A second round does the job.  The QUEEN relinquishes her grip and \nfalls, SCREECHING all the way down into the raging inferno below.\n\n<b>INT.  RYUSHI STATION - SEWER SYSTEM - PUMP CHAMBER\n</b>\nThe last segment of the destruct mechanism's display disappears.  We \nhear a\n\n<b>HIGH-PITCHED TONE.\n</b>\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO throws the joystick forward.\n\n<b>EXT.  RYUSHI STATION - PRE-DAWN\n</b>\nThe heli-jet accelerates hell-for-leather away.  An incandescent BALL \nOF ENERGY expands outward, vaporising the station and most of the \nsurrounding bayou for about a mile's radius.\n\n<b>EXT.  LINSON'S RANGE - ENCAMPMENT - PRE-DAWN\n</b>\nBig Bertha's parked by the blinking blue beacon tower, site of the ill-\nfated hunting expedition.  About a dozen or so people are milling \naround, smoking cigarettes or talking.\n\nMATT and DE VRIES are leaning against the wheels of MATT's crawler.  \nThey feel the concussive shock-wave, and look upward.\n\nTheir P.O.V. \nAbove the treetops, a blinding white-light BLURS OUT the horizon...\n\n<b>MATT\n</b>Holy shit!\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nGauges and other instruments are going crazy as the heli-jet rides the \nturbulence out.\n\n<b>EXT.  CHOPPER - PRE-DAWN\n</b>\nA chunk of metal is propelled through the air and RIPS into the \nchopper's starboard engine.  There's a BURST of flame, then the \nextinguishers cut in.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nThe heli-jet's bucking like a bronco now, and they're losing height \nrapidly.\n\n<b>HIROKO\n</b>We've lost the starboard engine!  We're going down!  Hold on!\n\n<b>EXT.  CHOPPER - PRE-DAWN\n</b>\nThe chopper clips the tree boughs, and bounces.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO and BROKEN TUSK are hurled around the cockpit like rag dolls.  \nThe glass cracks with the impact.\n\n<b>HIROKO'S P.O.V.  \n</b>Leaves, twigs, and branches rush past as the heli-jet breaks through \nthe canopy of foliage.\n\n<b>EXT.  SWAMP - PRE-DAWN\n</b>\nThe heli-jet PLOUGHS into the swamp floor with a sickening CRUNCH, \nspraying mud all around.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nThe canopy implodes.  A hail of glass shards RIP through the cockpit, \nspraying across HIROKO and cutting her skin.  She SCREAMS.\n\n<b>EXT.  SWAMP - PRE-DAWN\n</b>\nThe chopper comes to rest in the swamp.  The SQUAWKING of the local \nWILDLIFE O.S. gradually dies down.\n\n<b>INT.  CHOPPER - PRE-DAWN\n</b>\nHIROKO moves her head, and GROANS.  There's a nasty gash across her \nforehead. She turns to BROKEN TUSK.  The door frame on his side is \nbuckled and twisted. Part of the metal has sheared off, it's sharp end \nimpaling him through the shoulder.  The PREDATOR coughs luminous green \nblood.\n\n<b>HIROKO\n</b>We've gotta get you out of here.\n\n<b>EXT.  SWAMP - DAWN\n</b>\nThe sun begins to rise as HIROKO exits the heli-jet and goes around to \nthe other side.  She manages to get the mangled door open.  BROKEN \nTUSK's wound looks even worse up-close.\n\n<b>HIROKO (CONT'D)\n</b>Hold on.  This is gonna hurt some.\n\nHIROKO gets her arm under BROKEN TUSK's shoulder.  The PREDATOR braces \nhimself, and starts to move.  The agony is excruciating; his mandibles \nopen and he lets out a LEONINE ROAR.\n\nHIROKO helps him out of the seat.  The PREDATOR gets unsteadily to his \nfeet. What happens next is totally unexpected.\n\nBROKEN TUSK's throat BURSTS, fountaining green blood.  Shocked, HIROKO \ngets out of the path of the PREDATOR's tumbling mass.  She looks up.\n\nThe ALIEN stowaway on the roof of the chopper retracts it's \nsledgehammer tongue, it's head following her movements.\n\nThe PREDATOR's 'smart' weapon has dropped to the floor and is laying \nblade-down in the mire.  HIROKO scoops up, activating it and scrambling \naway.  She gets to her feet and holds the HUMMING disc before her.\n\nThe ALIEN climbs warily down from the heli-jet, and the two opponents \nface each other like sumo wrestlers.  HIROKO assumes a defensive \nstance, holding the disc ready to strike.  The ALIEN hisses, it's tail \nstinger coming around. It leaps for her, and battle is joined.  The \nALIEN lashes out, but HIROKO counters by swinging the weapon time and \ntime again.  With each thrust, surgically thin wounds open up on the \nbiomechanoid's body.  One of the ALIEN's attacks sends her reeling to \nthe floor, it's stinger arching towards her.  She parries, slicing the \ntail in half and struggling to her feet.\n\nThe ALIEN strikes again.  HIROKO feints, then thrusts, lopping off one \nof it's hands.  The ALIEN HOWLS with pain, blinding lashing out at her \nand sending the 'smart' weapon flying from her grip.\n\nShe's lost, and the creature knows it.  It's lips curl into a SNARL.\n\nKER-POW!  KER-POW!  The ALIEN's head DETONATES, and it's skeletal body \nslumps forward to SPLASH into the swamp...revealing BROKEN TUSK \npointing the pulse\nrifle.\n\nThe dying PREDATOR GURGLES, his head drooping.  HIROKO stumbles across \nto him.  BROKEN TUSK's in a bad way, green gore is pulsing freely from \nit's throat.  It gazes up at HIROKO.\n\n<b>BROKEN TUSK\n</b>Not...a pretty...sight...\n\nAnd with that, the PREDATOR dies.\n\nHIROKO look around.  The sun is rising above the treetops, and the \nsetting is serene.  Somehow beautiful.\n\nThe speakers in the heli-jet cabin CRACKLE to life, jarring her.\n\nVOICE   (O.S., on speakers)\nRimward Tracking Station, this is the one thirty-second Rim Corp \nBattalion operating out of the cruiser Tartarus from Fort Powell.  \nPlease respond.  Over.\n\nThere's a sound O.S., like a THUNDERCLAP.  HIROKO surveys the horizon.\n\nHIROKO's P.O.V.  \nA pair of MARINE DROPSHIPS float above the distant rainforest, their \nweapons arms unfurled like exotic armed insects. Searchlights probe the \nground far below.\n\nA shadow falls over HIROKO, blocking out the sun.  A monstrous SHAPE \noccupies the air above, delineated only by a telltale vibration.  The \nPREDATOR shuttlecraft lowers it's cloaking device, extending landing \ngear and a ramp. It touches down in the bayou with scarcely a whisper.\n\nHIROKO watches the PREDATORS file slowly out.  BROKEN TUSK's body is \nborne aloft and carried back inside.  The LEAD PREDATOR turns to \nHIROKO.  He crosses to her.  HIROKO's face is reflected in the faceted \neyepieces of the PREDATOR's helmet.\n\nThe extraterrestrial hunter pulls out his telescopic spear.  KER-CHUNK!  \nThe tips lock into place.  The PREDATOR offers it to HIROKO.  She \naccepts, a little confused.\n\nThere's a long moment.  The PREDATOR is still standing there.  Waiting. \nHIROKO's eyes narrow.  Her mind is working furiously.  What do they \nwant?\n\nShe realises.  It suddenly becomes clear.  She smiles.\n\n<b>HIROKO\n</b>Yeah.  Why not.\n\nHIROKO glances back at the hovering DROPSHIPS, then walks around the \nwaiting PREDATOR and into the shuttlecraft without looking back.\n\nThe PREDATOR follows her.  The ramp SLAMS closed, as we...\n\n<b>CUT TO BLACK\n</b><b>THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Alien vs. Predator</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Peter Briggs\" title=\"Scripts by Peter Briggs\">Peter Briggs</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Alien vs. Predator Script.html#comments\" title=\"Alien vs. Predator comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:58:12.151552"}