{"title": "American Splendor", "film_link": "/Movie Scripts/American Splendor Script.html", "script_link": "/scripts/American-Splendor.html", "info_raw": "\n\nAmerican Splendor Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Robert Pulcini  Shari Springer Berman\nGenres  Comedy  Drama\nMovie Release Date : September 2003\n\nRead \"American Splendor\" Script\n\n\n", "script": "\n                                   \"AMERICAN SPLENDOR\"\n\n                                            by\n\n                         Robert Pulcini and Shari Springer Berman\n\n                                     PRODUCTION DRAFT\n\n                \n\n               FADE IN:\n\n               INT. HARVEY\u0092S BEDROOM - NIGHT\n\n               A BEDROOM MIRROR.\n\n               The room is dark. A perfectly square mirror hangs crooked on \n               a wall.\n\n               Suddenly, out of the darkness, the reflection of a man's \n               face comes into focus. He stares straight ahead, perhaps \n               studying his own unrecognizable reflection. It's quite clear \n               this is a portrait of sickness; the man's pallor is gray, \n               his eyes are confused. There is something most definitely \n               wrong.\n\n               Tentatively, the figure steps away from the mirror, leaving \n               the frame empty and dark.\n\n               ANGLE ON BED\n\n               Like a ghost, the naked man (Harvey) stands over his bed \n               staring down at his sleeping wife (Joyce). In the eerie light, \n               he's almost translucent.\n\n                                     HARVEY\n                              (faintly)\n                         Joyce... Joyce?\n\n               Joyce springs up, alarmed.\n\n                                     JOYCE\n                         What's wrong, Harvey? What are you \n                         doing up?\n\n               Harvey just stands there for a moment saying nothing.\n\n                                     JOYCE\n                         What is it?\n\n                                     HARVEY\n                              (delirious, out of \n                              breath)\n                         Tell me the truth. Am I some guy who \n                         writes about himself in a comic book? \n                         Or am I just -- am I just a character \n                         in that book?\n\n               Joyce rubs her eyes.\n\n                                     JOYCE\n                         Harvey...\n\n                                     HARVEY\n                         If I die, will 'dat character keep \n                         goin'? Or will he just fade away...\n\n               Joyce just stares at him, unsure how to answer. Suddenly \n               Harvey collapses.\n\n               Joyce leaps from the bed, nervous, hysterical. She gets down \n               on the floor and shakes him.\n\n                                     JOYCE\n                         Omigod, Harvey! Harvey, wake up!\n\n               CLOSE ON HARVEY'S FACE\n\n               His eyes remain closed, his expression far, far away.\n\n                                                             FADE TO BLACK:\n\n               EXT. CLEVELAND ROW HOUSE - FALL - 1956 - DAY\n\n               FADE UP ON:\n\n               A surreal kaleidoscope of black, white and red. Similar to \n               the mirror scene above, the colors slowly come into focus, \n               revealing the chiseled features of a familiar face. But this \n               time we see that it is not a real face, but rather a plastic \n               mask of the D.C. Comic hero -- SUPERMAN.\n\n               INTERTITLE: CLEVELAND OHIO, 1956\n\n               CLOSE ON SUPERMAN MASK\n\n               It glows eerily in the light of a porch lamp. A child's pupils \n               glare through the eye holes...\n\n               The camera pans from SUPERMAN to the masked face of another \n               caped-crusader: BATMAN. Batman turns toward his loyal sidekick \n               ROBIN, who clutches a plastic, trick-or-treat pumpkin.\n\n               Next, we find THE GREEN LANTERN as he reaches up to ring the \n               doorbell. The camera finally rests on the last boy: an unkempt \n               KID wearing no costume at all. Looking irritated and removed \n               from the rest of the group, the KID shoves his hands in the \n               pockets of his shearling coat.\n\n               He spits and rolls his eyes as a lady answers the door.\n\n               The brick home is as working class as it gets. The lady at \n               the door is a 1950's HOUSEWIFE.\n\n                                     BOYS\n                              (in unison)\n                         Trick or treat!!\n\n                                     HOUSEWIFE\n                         Well, look at this! All the \n                         superheroes on the porch! Ain't that \n                         cute.\n\n               The Lady drops a candy apple in each boy's container.\n\n                                     HOUSEWIFE\n                              (still yelling)\n                         We got Superman here, Batman, his \n                         sidekick ROBIN, ohh, The Green Lantern \n                         even...\n\n               She finally stops at the costumeless KID. He halfheartedly \n               holds up a ratty, stained pillowcase.\n\n                                     HOUSEWIFE\n                         And what about you young man?\n\n                                     KID\n                         What about what?\n\n               The other boys giggle. The kid flashes them a \"kick yer ass\" \n               look.\n\n                                     HOUSEWIFE\n                         Who are you supposed to be?\n\n               The kid shrugs.\n\n                                     KID\n                         I'm Harvey Pekar (pronounced \"Pee \n                         Car\").\n\n                                     HOUSEWIFE\n                         Harvey Pekar? That doesn't sound \n                         like a super hero to me...\n\n                                     BOYS\n                              (mumbling)\n                         Pecker, Pecker...\n\n                                     KID\n                         I ain't no super hero, lady. I'm \n                         just a kid from the neighborhood, \n                         alright?\n\n               The Housewife stares at him, confused.\n\n                                     KID\n                         Ahh, forget this...\n\n               Frustrated, the kid throws his pillowcase down. He trudges \n               off as the others watch in confusion.\n\n                                     KID\n                         Why is everybody so stoopid?\n\n               BEGIN NERVOUS JAZZ SCORE\n\n               WE FOLLOW the schlumpy kid (aka HARVEY PEKAR) as he sulks \n               down the street...\n\n                                                               DISSOLVE TO:\n\n               EXT. CLEVELAND ROW HOUSE - FALL - 1975 - DUSK\n\n               INTERTITLE: CLEVELAND OHIO, 1975\n\n               A grown-up version of HARVEY PEKAR (now mid-thirties) stomps \n               along the same Cleveland street. Unfortunately, 20 years \n               have made this rust belt neighborhood a bit rustier. The \n               \"GROWN UP HARVEY\" dons the same shearling coat, sports the \n               same disheveled hair, and wears the same curmudgeonly \n               expression.\n\n               CREDIT SEQUENCE - ANIMATED SEQUENCE INTERCUT HARVEY WALKING \n               WITH COMIC BOOK PANELS OF THE CARTOON HARVEY IN ACTION. This \n               is not your typical super-hero stuff.\n\n               Instead it features our man engaging in such daredevil feats \n               as:\n\n               INT. CITY BUS - FALL 1975 - DAY\n\n               --Riding the city bus.\n\n               INT. V.A. HOSPITAL - DAY\n\n               --Working as a file clerk at the Veteran's Hospital.\n\n               INT. HARVEY'S APARTMENT / KITCHEN - DAY\n\n               --Trying to wash dishes.\n\n               INT. SUPERMARKET - DAY\n\n               --Waiting on line at the supermarket.\n\n               EXT. GARAGE SALE - DAY\n\n               --Buying used records from a garage sale table.\n\n               INT. GREASY SPOON DINER - DAY\n\n               --Eating junk food at a greasy spoon.\n\n               INT. HARVEY'S APARTMENT - DAY\n\n               Harvey fixes a rip in his coat with Elmer's Glue.\n\n               (Note: Each \"Cartoon Harvey\" looks similar but unique... A \n               variation on a theme. This is because his cartoons are drawn \n               by different comic artists.)\n\n               Intermittently, bold cartoon credits flash across the screen: \n\n                        FROM OFF THE STREETS OF CLEVELAND COMES...\n\n               Followed by the explosive title:\n\n                                    AMERICAN SPLENDOR\n\n               The high-energy music and upbeat titles -- in direct contrast \n               to the sulking image of Harvey -- continue through the \n               remainder of the credits.\n\n               EXT. CLEVELAND STREET OVERLOOKING FACTORIES - DAY\n\n               We're now on HARVEY'S back as he continues his forlorn \n               journey. We move forward, past him, to peer over the hill at \n               the factories below.\n\n                                     REAL HARVEY (V.O.)\n                         Okay. We're throwing a lot at ya \n                         here, so lemme step in an' help ya \n                         catch up. This is the story about \n                         comic books, an' a guy who made a \n                         whole life outta them. You could \n                         even say comics saved his life. This \n                         guy here, he's our man, Harvey Pekar -- \n                         all grown up and goin' nowhere. \n                         Although he's a pretty scholarly \n                         cat, he never got much of a formal \n                         education. For the most part, he's \n                         lived in shit neighborhoods, held \n                         shit jobs, and is now knee deep into \n                         a second disastrous marriage. So if \n                         yer lookin' for romance or escapism \n                         or some fantasy figure to save the \n                         day, guess what? Ya got the wrong \n                         movie.\n\n               SUDDENLY EVERYTHING -- THE MUSIC, THE CREDITS, THE IMAGES -- \n               COMES TO A HALT.\n\n                                                                    CUT TO:\n\n               INT. SOUND STAGE - PRESENT - DAY\n\n               HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n               The REAL HARVEY PEKAR (not the actor who trudged through the \n               credits) sits behind a microphone, supplying the \"voice over\" \n               above. He clutches a movie script in his hand.\n\n               The frame is spare, with a few well-chosen items to indicate \n               that he's in a recording session.\n\n               Although he is significantly older than the man who portrays \n               him, the \"Real Harvey\" is every bit as much of a sad sack... \n               maybe even more. He is large and slightly threatening with \n               knitted brows and wild eyes. Yet there is something kind and \n               vulnerable about him -- a teddy bear who could kick your \n               ass. Off Camera, WE HEAR the voices of the male and female \n               directors (us -- BOB and SHARI) coaching the \"Real Harvey\" \n               through his voice over. Harvey's irritable and contrary, \n               saying that the whole Halloween incident never even happened.\n\n               \"But I don't care man. I'm just doing this for the dough.\" \n               We learn that Harvey is a reluctant participant in a film \n               being made about his life.\n\n               SUDDENLY, his third wife JOYCE BRABNER -- an intelligent \n               control freak obsessed with all things negative -- joins in \n               the conversation. Pushing back her huge glasses, she \n               reprimands Harvey like he is an infant: \"Harvey you are \n               talking too loud, Harvey you are being difficult.\" Harvey \n               just rolls his eyes. Joyce gets offended. It is clear they \n               have had this argument a million times. As Joyce storms off...\n\n               Harvey explains that his wife is trying to take over the \n               movie. He laments that she is his third wife, and he has no \n               luck with women. \"Man, chicks just don't dig me.\" That's why \n               he marries anyone who will have him. \"And I marry them fast \n               before they get to know the real me...\"\n\n               END HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n                                                                    CUT TO:\n\n               INT. EXAMINATION ROOM - WINTER - 1975 - DAY\n\n               INTERTITLE: 1975\n\n               HARVEY sits on a table in his T-shirt and underwear. A DOCTOR \n               unwraps a tongue depressor.\n\n               Harvey's voice is hoarse, raspy and barely audible. It sounds \n               like it hurts for him to talk. Yet, he can't stop ranting.\n\n                                     HARVEY\n                         Doc, you gotta help me. My old lady's \n                         dumping me 'cause I can't talk. She \n                         says I'm a social embarrassment. Now \n                         that she's got her PhD, she's some \n                         hot shit academic star an' I'm nuthin' \n                         but a file clerk with nothin' ta say \n                         an' no voice ta say it. But me bein' \n                         a file clerk was fine when I wrote \n                         the damn check for her tuition --\n\n                                     DOCTOR #1\n                         Harvey, stop talking please, and \n                         open wide.\n\n               He points the tongue depressor at Harvey's mouth but he just \n               keeps on going.\n\n                                     HARVEY\n                         I just don't get it... We were doin' \n                         okay for a while. Then we took that \n                         stupid belated honeymoon. I started \n                         losin' my voice on the plane. Can \n                         you believe that... On the plane, \n                         doc?\n\n                                     DOCTOR #1\n                         Bad timing, I guess. Now please say \n                         \"Ah,\" Mr. Pekar.\n\n                                     HARVEY\n                         \"Ahhh.\"\n                              (without missing a \n                              beat)\n                         \"Ahhh\" ruined the trip. I got crazy, \n                         started to worry my voice would never \n                         come back. I mean, my wife didn't \n                         know me so long before we got hitched. \n                         What if she totally forgets what I'm \n                         like? Man, it's torture --\n\n                                     DOCTOR #1\n                         Shhh...\n\n               The Doctor shines a penlight into Harvey's mouth and looks \n               around.\n\n                                     DOCTOR #1\n                         Uh-huh.\n\n               He raises an eyebrow. Harvey catches this. Hypochondria \n               overtakes him.\n\n                                     HARVEY\n                              (the penlight in his \n                              mouth)\n                         What? Is it bad, doc?\n\n               The Doctor removes the penlight.\n\n                                     DOCTOR #1\n                         It's not good.\n\n               Harvey jumps off the table.\n\n                                     HARVEY\n                         It's cancer? First I got marital \n                         problems and now yer tellin' me I \n                         got throat cancer? Omigod...\n\n                                     DOCTOR #1\n                         Harvey, calm down. It's not cancer. \n                         You have a nodule on your vocal \n                         chords. Probably from screaming and \n                         yelling too much. And if you don't \n                         stop talking and give it a rest, \n                         you're gonna lose your voice \n                         completely.\n\n               Relieved, Harvey calms down. He nods, agreeing to be good.\n\n                                     HARVEY\n                         Whew... Okay, okay. But fer how long?\n\n                                     DOCTOR #1\n                         A few months.\n\n                                     HARVEY\n                              (loudly)\n                         Months!!\n\n               Suddenly Harvey's voice cracks under his effort to raise it.\n\n               He sheepishly grabs his throat.\n\n                                     DOCTOR #1\n                         See? More of that and you'll do \n                         permanent damage. Now go home, keep \n                         your mouth shut, and hopefully we \n                         won't have to operate.\n\n               Operate? Harvey gets nervous again. The Doctor throws him \n               his clothing.\n\n                                                                    CUT TO:\n\n               EXT. CLEVELAND STREET - WINTER - 1975 - DAY\n\n               A silent sequence. A dejected HARVEY walks home alone along \n               an empty lot. Day-old dirty snow clings to the ground.\n\n               He wanders through a down-in-the-heels neighborhood, passing \n               run-down stores and ramshackle apartments.\n\n               EXT. BUS STOP - WINTER - 1975 - DAY\n\n               Harvey approaches TOBY -- a dumpy 20-something going on 60- \n               something in ridiculous, mismatched polyester clothing. He \n               is odd, awkward and talks with a monotone, robotic voice. In \n               short, he is a super dork.\n\n                                     TOBY\n                         Hi Harvey. You weren't in work today. \n                         Are you okay, Harvey?\n\n               Harvey barely looks up. He nods his head \"yes\" and keeps \n               walking.\n\n                                     TOBY\n                              (yelling after him)\n                         I'm heading downtown to the White \n                         Castle. Wanna come, Harvey?\n\n               Harvey leaves Toby behind and turns the corner.\n\n               EXT. DELI - WINTER - 1975 - DAY\n\n               Two WOMEN argue loudly over a payphone.\n\n                                     SPANISH WOMAN #1\n                              (in Spanish)\n                         I already told you, I'm waiting for \n                         a call!\n\n                                     SPANISH WOMAN #2\n                         Oh yeah? Since when is this your \n                         private office?!\n\n                                     SPANISH WOMAN #1\n                         Since you can kiss my ass.\n\n               Harvey stops in his tracks and stares at them, jealous of \n               their ability to speak.\n\n               CLOSE UP: SPANISH WOMAN #1's MOUTH\n\n                                     HARVEY\n                              (to himself)\n                         Look at 'em yakkin'. How do they do \n                         it?\n\n               Out of the corner of her eye, WOMAN #2 notices Harvey \n               eavesdropping.\n\n                                     WOMAN #2\n                              (yelling at Harvey)\n                         Ay, what are you looking at? Maricone!\n\n               Startled, Harvey moves on.\n\n               EXT. ACROSS FROM A PARK - WINTER - 1975 - DAY\n\n               He passes a group of KIDS playing in the snow. They scream, \n               yell and laugh with abandon.\n\n                                     HARVEY\n                              (shaking his head)\n                         They all make it seem so easy.\n\n               Then, BAM! Harvey is awakened from his reverie by a snowball. \n               The kids laugh loudly. He wipes away the snow and walks on.\n\n               A VOICE OVER interrupts the scene.\n\n                                     REAL HARVEY (V.O.)\n                         Here's our man walking home from the \n                         doctor's. He's got the weight of the \n                         world on him. And fer what, really? \n                         'Cause his throat's a little screwy? \n                         Man, people in India are starvin' to \n                         death every day. His problems are \n                         nothin'.\n\n                                                                    CUT TO:\n\n               EXT. BRIDGE OVER TRAIN TRACKS - DAY\n\n               Totally dejected, HARVEY crosses over train tracks on his \n               way home.\n\n                                     REAL HARVEY (V.O.)\n                         Still, he can't help feelin' paranoid, \n                         like some supernatural force is \n                         conspiring against him to rob him of \n                         his voice.\n\n               EXT. HARVEY'S APARTMENT - WINTER - 1975 - DAY\n\n               Harvey sulks up the steps of his brick low-rise apartment \n               building. He passes an ELDERLY NEIGHBOR coming down the walk \n               with her shopping cart. Harvey unlocks the door.\n\n                                     REAL HARVEY (V.O.)\n                         Maybe his old lady will go easy on \n                         him today, when she sees how upset \n                         he is.\n\n               INT. HARVEY'S LIVING ROOM - WINTER - 1975 - DAY\n\n               Harvey's second wife LANA -- a hippyish chic with long hair \n               and a bad attitude -- pulls books off a shelf and selectively \n               throws them onto the floor or packs them into a milk crate.\n\n               An overstuffed suitcase sits beside her. She's obviously \n               leaving him. HARVEY enters the room.\n\n                                     HARVEY\n                              (whispering)\n                         Ay... What is this?\n\n               Harvey's voice breaks up.\n\n                                     LANA\n                         Exactly what it looks like.\n\n                                     HARVEY\n                              (loud)\n                         Whattya mean!! You mean yer dumpin' \n                         me?! Fer what?\n                              (his voice really \n                              rips)\n                         Ah, shit!\n\n               That last yell did it. Harvey grabs throat in pain, torn \n               between his throat discomfort and trying to stop his wife \n               from leaving.\n\n                                     LANA\n                         Look, your plebeian lifestyle isn't \n                         working for me anymore. Cleveland's \n                         not working for me anymore. I gotta \n                         get out of here before I kill myself.\n\n                                     HARVEY\n                         But --\n\n               She gathers her bags and heads for the door. Harvey trails \n               her, trying to reason.\n\n               He opens his mouth, but nothing comes out.\n\n                                     HARVEY\n                              (mouthing, just a \n                              wheeze)\n                         Please! Wait, honey... Just listen \n                         to what I got to say...\n\n               She turns and stares at him. Harvey tries to say something.\n\n               But now nothing at all comes out of his mouth. Only wheezes \n               air.\n\n               He tries again. No sound at all.\n\n               Finally LANA gives up, turns back towards the door and leaves.\n\n               SLAM!!\n\n                                                                    CUT TO:\n\n               INT. V.A. HOSPITAL - 1975 - DAY\n\n               At his cubicle in the file room, Harvey fills a cart with \n               files. He's physically at work, but mentally in a daze.\n\n                                     REAL HARVEY (V.O.)\n                         Here's our man -- yeah alright, here's \n                         me -- or the guy playin' me, anyway, \n                         though he don't look nothin' like \n                         me, but whatever. So it's a few months \n                         later an' I'm workin' my flunky, \n                         file-clerk gig at the V.A. Hospital. \n                         My voice still ain't back yet. Things \n                         seem like they can't get any worse...\n\n               A nurse pops her head in. Harvey hands her a file.\n\n                                     NURSE\n                         Thank you, Harvey dear.\n\n               He doesn't hear her, still stewing about LANA. He shoves the \n               last files in the cart and pushes it away.\n\n                                     HARVEY\n                              (to himself)\n                         Plebeian... where the hell did she \n                         get that shit?\n\n                                                                    CUT TO:\n\n               INT. FILE ROOM -- A FEW MOMENTS LATER\n\n               We see rows and rows of endless files...\n\n               Still in a daze, Harvey removes the files from the cart and \n               puts them on the shelves.\n\n                                     MR. BOATS (O.S.)\n                         Avoid the reeking herd! Shun the \n                         polluted flock! Live like that stoic \n                         bird, The eagle of the rock!\n\n               Harvey turns around. Mr. Boats -- a portly, African-American \n               maintenance worker wearing a bow-tie -- steps into Harvey's \n               row. He has a tool box.\n\n                                     HARVEY\n                         Huh? Oh. Hiya, Mr. Boats.\n\n               Harvey resumes shelving.\n\n                                     BOATS\n                         You know what that means, son?\n\n                                     HARVEY\n                         Yeah. It's from an Elinor Hoyt Wylie \n                         poem. It means stay away from the \n                         crowds of common ordinary people an' \n                         do yer own thing.\n\n               Mr. Boats laughs.\n\n                                     BOATS\n                         Nope, it means don't compromise \n                         yourself for women. Ain't gonna do \n                         you no good! Get away from 'em as \n                         soon as you can!\n\n                                     HARVEY\n                         Well I ain't got no woman now. So \n                         I'm living like the stoic bird, man.\n\n                                     MR. BOATS\n                         The only way to live, son.\n\n               Somehow this doesn't make Harvey feel any better about his \n               life.\n\n               INT. HOSPITAL HALLWAY -- DAY\n\n               Harvey carries an armful of files. Mr. Boats still trails \n               him, lugging his tool box.\n\n               Suddenly, Mr. Boats points out a young African-American FILE \n               CLERK wearing a pair of big headphones on his afro. He moves \n               as if he's listening to music.\n\n                                     MR. BOATS\n                         Look at that fool over there. What's \n                         he wearing?\n\n                                     HARVEY\n                         Huh? That's an A.M.-F.M. radio he's \n                         listening to... They got 'em fixed \n                         up now like a pair of earmuffs.\n\n                                     MR. BOATS\n                              (inappropriately \n                              angered)\n                         MMPH! Isn't that somethin! People \n                         have gone crazy. They'll buy any \n                         kinda junk! Probably listening to \n                         that loud rock stuff. Junk, junk, \n                         it's all junk!\n\n                                     HARVEY\n                         Well, I don't know. Rock music's got \n                         some good qualities. I mean it ain't \n                         jazz or nothin'.\n\n               Mr. Boats looks at him like he's crazy.\n\n                                     MR. BOATS\n                         Say, when you gonna bring me in some \n                         good records? Some Nat \"King\" Cole \n                         with Strings...\n\n                                     HARVEY\n                         I don't got any of that, Mr. Boats...\n\n               Mr. Boats stops and yells down the hall at Harvey.\n\n                                     MR. BOATS\n                         Yeah, you got it... You're keepin' \n                         it at home, though! You won't turn \n                         loose the good stuff... You just \n                         sell the junk!\n\n               Harvey shakes his head as Mr. Boats finishes his diatribe.\n\n               Mr. Boats turns into a room.\n\n                                     MR. BOATS\n                              (singing)\n                         Mona Lisa, Mona Lisa. Men have named \n                         you.\n\n                                                                    CUT TO:\n\n               INT. SOUND STAGE - PRESENT - DAY\n\n               HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n               Harvey sits on outdoor furniture. A few props are featured \n               in the frame indicating a garage-sale-like setting (including \n               a record player). Directly in front of Harvey are boxes of \n               used records.\n\n               HARVEY shows us his prodigious record collection. Thousands \n               of LP's -- rare jazz, blues, fusion, klezmer, etc. -- are \n               piled in floor-to-ceiling bookcases.\n\n               He tells us about his love of jazz and how he started writing \n               jazz reviews and music articles. He finds the first record \n               that he reviewed and puts it on his turntable. As the music \n               plays...\n\n               Harvey talks about how he started buying and selling records.  \n               This leads into how he first met ROBERT CRUMB.\n\n                                                               DISSOLVE TO:\n\n               EXT. CLEVELAND GARAGE SALE - FALL - 1962 - DAY\n\n               INTERTITLE: 1962\n\n               HARVEY (a little more hair but the exact same style) and a \n               bunch of his BUDDIES sift through old records at a junk sale.\n\n                                     REAL HARVEY (V.O.)\n                         In the early sixties I was with some \n                         buddies at a junk sale looking for \n                         some choice sides when I met this \n                         shy, retiring cat from Philadelphia \n                         named Bob Crumb. You know the guy; \n                         Fritz the Cat, Mr. Natural an' all -- \n                         they made a movie about him, too.\n\n               One of Harvey's pals -- MARTY -- pulls a record out of a \n               box.\n\n                                     MARTY\n                         C'mon, Harv. You dig Jay McShann. \n                         You gonna buy that or what?\n\n               Harvey jumps up from his search to check out the LP.\n\n                                     HARVEY\n                         I don't know, Marty. It's got a \n                         lamination crack in it...\n                              (checking out the \n                              price)\n                         A quarter. Maybe I can get him down.\n\n                                     MARTY\n                         You are one cheap bastard Harvey.\n\n                                     HARVEY\n                         Yeah, I know I'm tight, man, but I \n                         live on a government wage.\n\n               A skinny guy with a big nose, glasses and a ratty trench \n               coat taps Harvey on the shoulder. He is soft-spoken, a bit \n               shy and very odd -- a young ROBERT CRUMB.\n\n                                     CRUMB\n                         You collect Jay McShann, man?\n\n                                     HARVEY\n                         Yeah, man. How 'bout you?\n\n                                     CRUMB\n                         Yeah but most of my records are back \n                         in Philly.\n\n               A greaser-type guy in a leather jacket, PAHLS, joins them.\n\n                                     PAHLS\n                         Harv, meet my buddy Bob Crumb. He \n                         just moved to town. He's an artist \n                         at American Greeting Card Company.\n\n                                     HARVEY\n                         That's cool.\n\n                                     PAHLS\n                         You should see his comics, Harv. \n                         They are outta sight.\n\n                                     HARVEY\n                              (interested)\n                         Yeah? I'm into comics myself.\n\n                                                               DISSOLVE TO:\n\n               INT. HARVEY'S LIVING ROOM - FALL - 1962 - DAY\n\n               A disheveled mess that gives new meaning to the term bachelor \n               pad. Records and books are strewn everywhere.\n\n                                     REAL HARVEY (V.O.)\n                         So Crumb showed me this comic book \n                         novel he was working on -- THE BIG \n                         YUM YUM BOOK. I'd never seen anything \n                         like it.\n\n               HARVEY marches back and forth holding Crumb's illustrated \n               comic novel. CRUMB sits on the floor nursing a beer and \n               sorting through vintage comic books. Harvey's bursting with \n               so much enthusiasm, it's almost aggressive.\n\n                                     HARVEY\n                         It's terrific, man! I really dig \n                         your work.\n\n               Crumb ignores Harvey's praise.\n\n                                     CRUMB\n                              (holding up a vintage \n                              comic)\n                         This PETER WHEAT book is by Walt \n                         Kelly... It's pretty rare.\n\n                                     HARVEY\n                         Yeah? Can I get good bread for it?\n\n                                     CRUMB\n                         Nah! Not yet.\n\n               Harvey flops down in an overstuffed chair. Stuffing flies \n               out. He sips his beer.\n\n                                     HARVEY\n                         Listen man, let's get back to your \n                         book. What are you gonna do with it?\n\n                                     CRUMB\n                              (looking up)\n                         I hadn't thought about it. It's just \n                         an exercise.\n\n               Harvey flips through the book.\n\n                                     HARVEY\n                         It's more than an exercise. It's \n                         breaking ground, man. There's some \n                         wild shit in here.\n\n               Crumb is immune to Harvey's enthusiasm.\n\n                                     CRUMB\n                         You're spitting on me, Harvey.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - FALL - 1962 - LATER\n\n               CRUMB lies on the couch sketching while HARVEY reads more of \n               THE YUM YUM BOOK. A scratchy jazz record plays.\n\n                                     REAL HARVEY (V.O.)\n                         Crumb and I hung out a lot back then. \n                         We had records and comics in common.\n\n               ANGLE ON CRUMB'S DRAWING\n\n               We see Crumb is actually sketching Harvey, slumped in a chair \n               reading a book. Crumb makes Harvey look like a smelly, sweaty \n               madman with ratty clothing.\n\n               Crumb holds the sketch of Harvey up to show him.\n\n                                     CRUMB\n                              (laughing)\n                         Check it out, man. Pretty scary.\n\n               Harvey glances up at his portrait, completely unselfconscious.\n\n                                     HARVEY\n                         Yeah, ya don't know the half of it.\n\n               Harvey goes back to reading. Crumb back to sketching.\n\n                                     REAL HARVEY (V.O.)\n                         Eventually people got hip to Crumb's \n                         art work and he started hangin' out \n                         with a Bohemian crowd. After a while, \n                         he got sick of greeting cards and \n                         moved away to San Francisco where he \n                         got the whole underground comic scene \n                         off the ground.\n\n               Crumb slowly evaporates from the room, leaving Harvey totally \n               alone.\n\n               ANGLE ON 45 RECORD SPINNING AND SPINNING\n\n                                     REAL HARVEY (V.O.)\n                         He'd come back ta Cleveland every \n                         few years, an' people'd treat him \n                         like a celebrity.\n\n               The record spins and spins...\n\n               END FLASHBACK\n\n                                                               DISSOLVE TO:\n\n               EXT. BUS STOP - 1975 - DAY\n\n               ANOTHER R. CRUMB DRAWING OF HARVEY (Now circa 1975)\n\n               On a sketch pad we see a deranged, tormented Harvey sitting \n               alone on a park bench. He pulls at his hair, and looks as \n               though he may murder the next person who walks by.\n\n               INTERTITLE: BACK TO 1975\n\n               As the pencil adds shading to Harvey's face, WE HEAR:\n\n                                     REAL HARVEY (V.O.)\n                         Once he came to visit when I was \n                         really feelin' bad. It was right \n                         around the time of my throat \n                         operation, an' right after my second \n                         wife left me. At first it was pretty \n                         weird. I mean, here my life was \n                         falling apart an' everything was \n                         going great for him. I was on my \n                         second divorce an' he was a big hit \n                         with the chicks. I was a nothin' \n                         file clerk and he was this famous \n                         cartoonist.\n\n               HARVEY and R. CRUMB sit on a park bench together by a bus \n               stop. A distraught Harvey whines while Crumb just sketches.\n\n               Harvey's voice is still raspy.\n\n                                     HARVEY\n                         I dunno, man. On the one hand most \n                         women gettin' graduate degrees \n                         wouldn't give a guy like me the time \n                         a' day. An' she married me an' \n                         everything, so I gotta give her some \n                         kinda credit. But then she got so \n                         mean to me in the end. An' it ain't \n                         like I tried t'keep her captive or \n                         anything like that, y'know?\n\n               Crumb may or may not be listening to Harvey. It's hard to \n               tell.\n\n                                     HARVEY\n                         An' then on top of it I lost my voice \n                         for three months. I still sound like \n                         shit, but before I had nothin'. Man, \n                         talk about hell. I started forgettin' \n                         what I sound like, y'know? So I \n                         started writin' stuff down -- stories \n                         an' things, my points a' view, ideas. \n                         I even published a couple jazz record \n                         reviews. I guess that ended up bein' \n                         a good thing.\n\n                                     CRUMB\n                         Uh-huh.\n\n                                     HARVEY\n                         But don't think I buy into this \n                         \"growth\" crap. Everybody talks about \n                         how bad experiences can cause ya \n                         t'grow, an' all that clichéd stuff. \n                         I've had enough bad experiences and \n                         growth to last me plenty.\n                              (a beat)\n                         Right now, I'd be glad to trade some \n                         growth for happiness.\n\n               For a moment, they both just sit there saying nothing to \n               each other, each man in his own private universe.\n\n               Finally Harvey looks over to Crumb.\n\n                                     HARVEY\n                         So how long are ya stayin' in \n                         Cleveland?\n\n               Crumb never looks up from his picture.\n\n                                     CRUMB\n                         I dunno, man. I gotta go visit this \n                         chick in New York. And I'm really \n                         busy with the comic book stuff. It's \n                         good bread and all man but I'm getting \n                         fed up with the whole scene.\n\n                                     HARVEY\n                         What are ya talkin' about? Yer makin' \n                         a good living doin' yer art? Sheesh. \n                         How many guys get that lucky in their \n                         life, huh?\n\n                                     CRUMB\n                         Yeah, I dunno.\n\n                                     HARVEY\n                         Ya know man, people are startin' to \n                         know the name \"Crumb.\" When you croak \n                         you're gonna leave something behind.\n\n                                     CRUMB\n                         Yeah, my ashes and some crappy \n                         doodles. It's not like I'm Blind \n                         Lemon Jefferson or Big Mama Thornton.\n\n                                     HARVEY\n                         C'mon, man. It sure beats workin' a \n                         gig like mine -- being a nobody flunky \n                         and sellin' records on the side for \n                         a buck.\n\n                                     CRUMB\n                         Yeah, well that's true...\n\n               Harvey nods in agreement, mulling this over. He's not at all \n               offended.\n\n                                                                    CUT TO:\n\n               INT. V.A. HOSPITAL - 1975 - DAY\n\n               CLOSE ON A FILE DRAWER MARKED: \"RECENTLY DECEASED.\"\n\n               A hand reaches into the frame and opens the drawer.\n\n               By rote, HARVEY fumbles with a large stack of \"expired \n               patient\" files. He places each into the appropriate \n               alphabetical \"deceased\" drawer.\n\n               Attempting to grab another batch, Harvey accidentally knocks \n               the entire pile onto the floor.\n\n                                     HARVEY\n                         Damn it!\n\n               He crouches down to survey the mess -- a collage of \"expired \n               lives\" laid out before his eyes.\n\n               We move past dozens of anonymous names -- William Anderson, \n               Louis Collins, Mark D'Amico, Tyrone Moore, Franklin Ray, \n               etc... Each file has a red \"Deceased\" stamp.\n\n               Depressed, HARVEY is transfixed by the files surrounding him \n               on the floor. Suddenly he stops and picks one up.\n\n               ANGLE ON FOLDER: It is marked, \"CHARLIE MARSHALL.\"\n\n               He opens the folder and reads the stats...\n\n               Born: 1920 in Cleveland Died: 1920 in Cleveland Occupation: \n               Clerk\n\n               ANGLE ON HARVEY: He swallows hard as he reads about Charlie's \n               small, invisible and now vanished life... He tosses the folder \n               back onto the pile.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1975 - MORNING\n\n               CLOSE ON: TWO STICK FIGURES IN AN EMPTY FRAME\n\n               HARVEY sits at a table with a pen in hand and a blank sheet \n               of paper in front of him. Nothing seems to come to him.\n\n               He flips through a pile of comic books -- everything from \n               D.C. Comic Super Heroes to underground works such as Crumb's \n               Mr. Natural and Zap Comix. No inspiration. Harvey throws \n               them down in frustration.\n\n                                     HARVEY\n                         I'm starvin'.\n\n                                                                    CUT TO:\n\n               INT. SUPERMARKET - 1975 - DAY\n\n               HARVEY pushes a cart through the cramped aisles of a crowded \n               supermarket. He pulls a few cans of Beef-A-Roni off the shelf \n               and heads off to pay. Reaching the check-out area, he \n               evaluates the situation.\n\n               ANGLE ON CHECK-OUT COUNTERS:\n\n               There are three lines to choose from. Two of the counters \n               have long waits. The third is much shorter but there is an \n               OLD JEWISH LADY next in line.\n\n               SUDDENLY, THE SCREEN SPLITS IN TWO:\n\n               The LEFT SIDE OF THE FRAME remains Harvey at the supermarket \n               deliberating over the check-out lines.\n\n               However, the RIGHT SIDE OF THE FRAME now contains a CRUMB \n               STYLE COMIC PANEL DEPICTING THE EXACT SAME SCENARIO. A BUBBLE \n               appears over CARTOON HARVEY'S head revealing his thoughts. \n               It reads: \"Pickin' the right check-out line is an art... \n               There's a lot of things you gotta consider.\"\n\n               ON THE LEFT SIDE OF THE FRAME... Harvey decides to get behind \n               the Old Lady.\n\n               MEANWHILE ON THE RIGHT HAND SIDE OF THE FRAME... Cartoon \n               Harvey stands behind the Old Lady.\n\n               A new BUBBLE reads: \"It may be the shortest line but I am \n               takin' a chance 'cause she's an Old Jewish Lady.\"\n\n               BACK TO THE LEFT SIDE OF THE FRAME... The CASHIER rings up \n               the Old Lady's purchases -- a few kitchen glasses.\n\n                                     OLD JEWISH LADY\n                              (Yiddish Accent)\n                         Listen, goily, dese glasses are six \n                         for $2.00 because I couldn't carry \n                         twelf... But I vanted twelf so today \n                         I'm buying six more... But you should \n                         only charge me $1.50 for dem... It's \n                         ok, you can esk de meneger.\n\n               Harvey rolls his eyes and stamps his foot impatiently. He \n               knows he's in trouble now.\n\n                                     CASHIER\n                              (yelling)\n                         Frank! I need a price check.\n\n               SUDDENLY, THE RIGHT SIDE OF THE SCREEN BECOMES FULLY \n               ANIMATED... Instead of still comic panels with balloons, the \n               Cartoon Harvey now rants directly into the camera.\n\n                                     CARTOON HARVEY\n                         Man, Old Jewish Ladies will argue \n                         forever with a cashier about anything. \n                         Get behind them in a line an' yer \n                         gonna wait forever!\n\n               The Human Harvey seems oblivious to his cartoon replica. He \n               impatiently leans on his cart, waiting and seething.\n\n                                     CARTOON HARVEY\n                         I mean, I'm a yid myself, an' the \n                         women in my family are like that... \n                         But I never got used to it... I may \n                         be cheap, but I got limits!\n\n               ON THE LEFT HAND SIDE OF THE SCREEN... The MANAGER finally \n               arrives. The Old Lady haggles with him, too.\n\n                                     OLD JEWISH LADY\n                         Please. Let me 'splain von more time.\n\n               MEANWHILE ON THE RIGHT HAND SIDE... The Cartoon Harvey turns \n               to address the Human Harvey, who actually looks him in the \n               eyes. It now seems Human Harvey can actually hear his cartoon \n               alter ego.\n\n                                     CARTOON HARVEY\n                         Wake up! You're whole life's gettin' \n                         eaten away by this kinda crap! What \n                         kind of existence is this? Is this \n                         all a workin' stiff like you can \n                         expect? Ya gonna suffer in silence \n                         fer the rest a' yer life?! Or ya \n                         gonna make a mark. Huh? Huh?\n\n               IN AN INSTANT, THE CARTOON HARVEY DISAPPEARS AND THE LIVE \n               ACTION SCENE TAKES OVER THE WHOLE FRAME.\n\n               Suddenly motivated by an odd notion, Harvey abandons his \n               grocery cart and runs out of the supermarket.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S KITCHEN -- NIGHT\n\n               Bursting with ideas, Harvey (wearing his undershirt and \n               boxers) starts story-boarding his first comic with stick \n               figures.\n\n                                                               DISSOLVE TO:\n\n               INT. HARVEY'S KITCHEN - 1975 - MORNING\n\n               A bleary-eyed HARVEY, still clad in an undershirt and boxers, \n               dozes off over a bowl of Corn Flakes. On the table next to \n               some spilled milk are a stack of papers covered with \n               scribbling. He clearly has been slaving over this work all \n               night.\n\n               ANGLE ON PAPERS:\n\n               At the top is a quickly scribbled title, \"Standing Behind \n               Old Jewish Ladies In Supermarket Lines.\" These are ad hoc \n               versions of a comic book. The pages are divided like a tick-\n               tack-toe board. Each square is filled with crude stick figure \n               drawings and lots of writing.\n\n               An alarm clock goes off. Harvey's eyes fly open.\n\n                                     HARVEY\n                         Shit. Work.\n\n               Harvey yawns, then notices the pile of papers. He peruses \n               them, proud of his work. He gets up and looks out the window.\n\n               I/E. HARVEY'S APARTMENT - HARVEY'S POV - 1975 - MORNING\n\n               It is yet another grey day in Cleveland. The neighborhood is \n               run-down. Garbage is strewn everywhere.\n\n               The following scene unfolds through the window:\n\n               Two UNSIGHTLY WORKERS lug an old, smelly mattress from a \n               garage towards the garbage cans on the curb. Their \n               conversation is distant, but entirely audible.\n\n                                     MATTRESS GUY #1\n                         So how smart is she?\n\n                                     MATTRESS GUY #2\n                         I dunno. I guess she's about average.\n\n                                     MATTRESS GUY #1\n                         Average? Hey, man. Average is dumb!\n\n               They drop the mattress in place. With the window framing \n               these guys, the scene FREEZES, looking just like a comic \n               book panel.\n\n               INT. HARVEY'S APARTMENT - DAY\n\n               Harvey turns around from the scene and ponders it. He moves \n               back towards his pile of stick-figure drawings.\n\n               CLOSE ON PAPER\n\n               Harvey scribbles the words \"AMERICAN SPLENDOR\" at the top of \n               the page.\n\n                                                                    CUT TO:\n\n               INT. CLEVELAND DINER - 1975 - DAY\n\n               The following scene is shot through the restaurant window.  \n               We see reflections of people walking by.\n\n               A tense HARVEY starts at CRUMB as he eats a burger and reads \n               Harvey's mock-ups. Harvey doesn't touch his burger deluxe \n               and nervously talks in his laryngitis-afflicted voice.\n\n                                     HARVEY\n                         See, ever since I read your stuff, \n                         man I've been thinking I could write \n                         comic book stories that were different \n                         from anything being done.\n\n                                     CRUMB\n                              (munching on a fry)\n                         Uh-huh.\n\n                                     HARVEY\n                         I'm thinkin', the guys who do animal \n                         comics and super-hero stuff are really \n                         limited 'cause they gotta try to \n                         appeal to kids. And underground comics \n                         like yours have been really subversive \n                         or opened things up politically. But \n                         there is still plenty more ta be \n                         done with 'em, too, y'know?\n\n                                     CRUMB\n                         Pass me the ketchup?\n\n                                     HARVEY\n                         I mean with pictures and words, it \n                         could be more of an art form. Like \n                         those French movies are. Or De Sica \n                         over in Italy, y'know?... So I tried \n                         writin' some things about real life. \n                         Stuff the everyman's gotta deal with.\n\n               Crumb finally looks up from Harvey's work.\n\n                                     CRUMB\n                         These are about you.\n\n                                     HARVEY\n                         Er, yeah...\n\n                                     CRUMB\n                         You turned yourself into a comic \n                         hero?\n\n                                     HARVEY\n                         Sorta, yeah. But no idealized shit. \n                         No phony bullshit. The real thing, \n                         y'know? Ordinary life is pretty \n                         complex stuff.\n\n               Crumb reads more. Harvey waits anxiously. Finally Crumb starts \n               to chuckle.\n\n                                     CRUMB\n                         These are really good, Harv.\n\n                                     HARVEY\n                              (insecure)\n                         Really? Ya think so?\n\n               Crumb shuffles through more.\n\n                                     CRUMB\n                         Yeah. This is great stuff, man. I \n                         dig it. Can I take them home and \n                         illustrate them?\n\n               Harvey is practically bursting.\n\n                                     HARVEY\n                         Wow!!\n\n               Harvey's voice breaks like a kid in puberty. He clears his \n               throat. And something miraculous happens...\n\n               When Harvey opens his mouth to speak his LARYNGITIS IS GONE!\n\n                                     HARVEY\n                         You'd do that for me, man? That'd be \n                         great! I can't draw a straight line!\n\n                                     CRUMB\n                         Hey, what's up with your voice, Harv? \n                         All of a sudden it sounds fine.\n\n                                     HARVEY\n                              (thrilled)\n                         I don't know, man! I guess you cured \n                         me!\n\n               INT. V.A. HOSPITAL - SNACK ROOM HALLWAY - DAY\n\n               HARVEY bounds towards the snack room where a group of hospital \n               workers and patients hang out. He bangs on the window to get \n               their attention. When they look up, Harvey waves a comic \n               book in the air.\n\n                                                               DISSOLVE TO:\n\n               INT. V.A. HOSPITAL - SNACK ROOM - DAY\n\n               A GLOSSY, FULL-COLOR COMIC BOOK FEATURING THE TWO MATTRESS \n               GUYS: Scrawled across the top in big red letters reads, \n               \"AMERICAN SPLENDOR. Vol. #1\" A man's finger points to the \n               words, \"All Stories by Harvey Pekar. Art by R. Crumb.\" The \n               comic book sits atop a table in the dreary snack room.\n\n               A crowd of HOSPITAL WORKERS, PATIENTS, DOCTORS, MAINTENANCE \n               WORKERS, etc. (under ten total) gather around a proud HARVEY \n               who shows off his work. For the first time, he seems almost \n               happy.\n\n                                     HARVEY\n                              (beaming)\n                         See that? All stories by yours truly.\n\n               A WWII VET PATIENT with a portable IV cranes to get a glimpse.\n\n                                     WW II VET PATIENT\n                         Hot off the presses, huh? We got a \n                         regular Hemingway here.\n\n                                     HARVEY\n                         No way, Jack, I don't go in for that \n                         macho crap.\n\n               DOCTOR #3 chimes in.\n\n                                     DOCTOR #3\n                         I didn't know you could draw, Pekar.\n\n                                     HARVEY\n                         Nah! I don't draw. I just write the \n                         stories. A buddy of mine and some of \n                         his friends do the art work.\n\n               TOBY, the supernerd from the bus stop, grabs the comic book \n               off the table and peruses it.\n\n                                     TOBY\n                         Harvey, am I in here? You promised I \n                         would be in here.\n\n                                     HARVEY\n                         Yeah! Yeah! You're in there, alright? \n                         Jeez, Toby.\n\n               SUDDENLY, MR. BOATS -- Harvey's philosophical co-worker -- \n               pushes his way thorough the crowd. He snatches the comic out \n               of Toby's hand.\n\n                                     MR. BOATS\n                         Let me see this.\n\n                                     TOBY\n                         Mr. Boats, it's not polite to grab \n                         things. Next time --\n\n                                     MR. BOATS\n                         Son, you done good. Ya know, I was \n                         up in Toronto a few weeks back an' I \n                         saw the Red Chinese Ballet...\n\n               As Mr. Boats talks, the crowd starts to disperse.\n\n                                     MR. BOATS\n                         Now that was beautiful. The way those \n                         people were dancing together. Those \n                         Chinese work hard. I tell ya, they \n                         work hard -- Where is everybody goin'?\n\n               Mr. Boats hands the comic book back to Harvey and turns on \n               his heels. Through the window he notices TWO VETS IN \n               WHEELCHAIRS moving down the hall.\n\n                                     MR. BOATS\n                         Where these sickly men rushin' off \n                         to? They ain't goin' nowhere for \n                         now. Maybe not for a long time. But \n                         damn if they ain't in a rush to get \n                         there.\n\n               Harvey stands there, his moment of glory passed. But it's \n               okay. He flips through his comic and smiles.\n\n                                                                    CUT TO:\n\n               EXT. STREET CORNER - ASSOC. OF POLISH WOMEN - 1975 - DAY\n\n               A motley group of GUYS hang out on a street corner in front \n               of the Association of Polish Women. HARVEY heads towards \n               them.\n\n                                     MARTY\n                         Hey look guys, here comes Captain \n                         America.\n\n               Harvey rolls his eyes.\n\n                                     PAHLS\n                              (yelling out)\n                         You gonna hang with the boys now \n                         that yer a comic book star?\n\n               Harvey turns red. He's embarrassed but part of him loves the \n               attention.\n\n                                     HARVEY\n                         Cut it out. Man, I ain't nothin' yet \n                         compared to Bob Crumb.\n\n                                     GUY #3\n                         Ah, listen to him. One lousy comic \n                         book and he wants to be Crumb.\n\n               The GUYS laugh.\n\n               ANGLE ON SILENT GUY\n\n               A SILENT GUY crouches by the wall, reading his CLEVELAND \n               BROWNS trading cards.\n\n                                     PAHLS\n                         Hey Harvey, if ya wanna make comics \n                         for adults, ya oughtta put some dirty \n                         stuff in it.\n\n                                     GUY #3\n                         Yeah, you can write about Marty's \n                         sex life.\n\n               Harvey hangs with the guys but he doesn't engage. He seems \n               to be observing them more than interacting with them.\n\n                                     GUY #3\n                         Right Marty? I heard ya went out \n                         with Bonnie yesterday.\n\n                                     PAHLS\n                         Yeah. Howdja do? Wudja git offa her?\n\n                                     MARTY\n                         Ah, lousy. All's I got wuz armaround.\n\n               The guys all stare at him for a moment. Then they crack up.\n\n                                                                    CUT TO:\n\n               INT. SOUND STAGE - PRESENT - DAY\n\n               HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n               CLOSE UP:\n\n               A COPY OF AMERICAN SPLENDOR #2: A FULL-COLOR CARTOON VERSION \n               OF THE ABOVE SCENE GRACES THE COVER.\n\n               A MARTY LOOK-ALIKE is bombarded with questions about his \n               date with Bonnie. He complains that all he got was \"arm-\n               around.\" The REAL HARVEY holds the above comic book in his \n               hand. The stage is set with a few items that indicate a comic \n               book store. HARVEY talks about a couple of \"American Splendor\" \n               issues and how they impacted his life -- recognition as a \n               writer, etc. He gives his philosophy about the comic book, \n               etc. A MONTAGE OF AMERICAN SPLENDOR COVERS (ISSUE #3, #4, \n               #5, #6, ETC.) THEY INDICATE A PASSAGE OF TIME...\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S CUBICLE - V.A. HOSPITAL - 1980'S - DAY\n\n               HARVEY sits alone in his cubicle. He doodles stick figures \n               on a pad -- some ideas for a new comic. His posture's \n               miserable. He rubs his temples like he's in anguish.\n\n                                     REAL HARVEY (V.O.)\n                         Here's our man eight comics later, a \n                         brand new decade, same old bullshit. \n                         Yeah sure, he gets lots of recognition \n                         for his writin' now. Sure his comics \n                         are praised by all the important \n                         media types tellin' people what to \n                         think. But so what?  It's not like \n                         he makes a livin' at it like Bob \n                         Crumb. He can't go an' quit his day \n                         job or nothin'.\n\n               JUMP CUT SEQUENCE\n\n               Several shots of Harvey just thinking, scratching his face \n               with a pencil, tapping his foot nervously.\n\n               Each shot is separated by a second or two of black (an homage \n               to Harvey's wordless panels). Finally, he goes back to \n               writing.\n\n                                     REAL HARVEY (V.O.)\n                         Who am I kiddin'. Truth is I'd be \n                         lost without my work routine.\n\n                                                              FLASH CUT TO:\n\n               INT. HARVEY'S BEDROOM - 1980'S - NIGHT\n\n               Alone in bed, Harvey wakes up in a cold sweat from a \n               nightmare. He looks horrified, short of breath.\n\n                                     HARVEY\n                              (calming himself down)\n                         I got a job... I got a job...\n\n                                                                   BACK TO:\n\n               INT. HARVEY'S CUBICLE - V.A. HOSPITAL - 1980'S - DAY\n\n               HARVEY scratches his head.\n\n               CLOSE UP ON HIS DOODLING\n\n               Harvey writes \"I got a job\" in a balloon over the stick \n               figure's head.\n\n                                     REAL HARVEY (V.O.)\n                         So -- to stave off desperation and \n                         feelings of uselessness -- I resigned \n                         myself to a menial existence. But \n                         hey, maybe the guy who's had a happy \n                         life feels worse just before he dies \n                         than th' guy who had a sad one. Or, \n                         maybe not. I dunno. Maybe I just \n                         needed a woman.\n\n               Toby comes in, decked out in plaid and stripes. He has an \n               empty messenger bag.\n\n                                     TOBY\n                         Hi, Harvey. Do you want these gourmet \n                         jelly beans? I gave up sweets for \n                         lent.\n\n               Harvey turns around. He seems down, depressed.\n\n                                     HARVEY\n                         Huh? Sure, I'll take 'em.\n\n               Toby watches Harvey eat a few.\n\n                                     HARVEY\n                         Hey, watermelon. That's pretty good.\n\n                                     TOBY\n                         I recommend the piña coladas. They \n                         are excellent and very authentic \n                         tasting.\n\n               Toby heads down a file row and proceeds to take a few off \n               the shelves, stuffing his bag. Harvey gets up and comes after \n               him.\n\n                                     HARVEY\n                         Hey Toby, can you eat lentils during \n                         lent?\n\n                                     TOBY\n                         Sure. I don't see why not. You can't \n                         eat meat on certain days, but lentils \n                         should be acceptable anytime.\n\n                                     HARVEY\n                         Ya think there's any connection \n                         between lentils and lent?\n\n                                     TOBY\n                         I don't think so but I'll ask Sister \n                         Mary Fred at church on Sunday.\n\n                                     HARVEY\n                         Sister Mary Fred, huh? Is she cute? \n                         Sounds kinda mannish but who am I to \n                         be picky.\n\n                                     TOBY\n                         Harvey, you're funny. She's a nun.\n\n                                     HARVEY\n                         So what? Maybe she became a nun \n                         because she couldn't get a guy.\n\n                                     TOBY\n                         Harvey, she became a nun because she \n                         had a higher calling.\n\n                                     HARVEY\n                         Higher calling. That is such a crock \n                         of shit. I don't know why you waste \n                         your time prayin' anyway.\n\n                                     TOBY\n                         Well, Harvey, I like the ritual. And \n                         I'm a very spiritual person. You \n                         know, you should try believing in \n                         something bigger than yourself. It \n                         might cheer you up.\n\n               Toby turns on his heels and walks off.\n\n                                     HARVEY\n                              (calling after him)\n                         What? Do I seem depressed, Toby?\n\n               Toby doesn't respond.\n\n               Harvey shrugs and digs deep into the jelly bean bag. He pulls \n               out a fistful.\n\n               CLOSE ON HARVEY'S HAND\n\n               Jellybeans in every imaginable color. Harvey fingers a few \n               and then picks a blue one.\n\n                                     BOB THE DIRECTOR (V.O.)\n                         Cut!\n\n                                                                    CUT TO:\n\n               INT. V.A. HOSPITAL \"SET\" - PRESENT - DAY\n\n               HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n               A few items from the previous scene are present on the sound \n               stage indicating that it's a set of AMERICAN SPLENDOR -- The \n               Movie.\n\n               THE ACTOR HARVEY stands alone, his hand filled with Jelly \n               beans.\n\n                                     BOB THE DIRECTOR\n                         Okay, that was great. The bakery \n                         scene is next...\n\n               ACTOR HARVEY steps out of the frame, revealing a craft service \n               table behind him. At the table, the REAL HARVEY and the REAL \n               TOBY load up on donuts. The two discuss the food on the set.\n\n               Ironically, the Real Toby is actually more extreme than the \n               Actor who plays him -- even more robotic, and completely \n               incapable of eye-contact.\n\n               The REAL TOBY discusses the finer points of nerdom and \n               evaluates the Actor's nerd quotient. The Real Harvey explains \n               to Actor Toby that nothing -- not even gourmet jelly beans -- \n               would have cheered him up at that point in his life.\n\n               He was too lonely and depressed.\n\n               END HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S BEDROOM - 1980'S - MORNING\n\n               Light pours through the curtained window.\n\n               Naked and disheveled, HARVEY tosses and turns in bed.\n\n                                     REAL HARVEY (V.O.)\n                         My loneliness was unbearable, man. \n                         Weekends were the worst. Sometimes \n                         in my sleep, I'd feel a body next to \n                         me like an amputee feels a phantom \n                         limb.\n\n               EXT. PEDESTRIAN BRIDGE -- DAY\n\n               Extreme wide shot: a city-street overpass spans across the \n               entire frame. The lone figure of Harvey sulks there in the \n               middle, watching traffic pass below.\n\n                                     REAL HARVEY (V.O.)\n                         Sure my comics were bringin' me \n                         notoriety, but my personal life was \n                         in shambles. I thought a little \n                         attention would make me feel better. \n                         It only made me feel worse.\n\n                                                                   CUT TO: \n\n               EXT. BAKERY SIDE STREET - SPRING - 1980'S - MORNING\n\n               It is a beautiful, sunny day. The trees are in bloom.\n\n               There's the first scent of spring in the air. Kids play in \n               the street. Music pours out of passing cars. Everyone seems \n               to have a smile on his or her face except HARVEY. He walks \n               on the shadowy side of the street.\n\n               EXT. BAKERY STREET - SPRING\n\n               Establishing shot of HARVEY trudging into the bakery.\n\n               INT. BAKERY - SPRING - 1980'S - MORNING\n\n               A couple of WOMEN order bread and cookies from TWO COUNTER \n               GIRLS.\n\n               HARVEY surveys the donuts.\n\n                                     COUNTER GIRL #1\n                              (yelling to Harvey)\n                         Next!\n\n                                     HARVEY\n                              (to the Counter Girl)\n                         Yeah! I'll have two crullers, a jelly \n                         donut with powdered sugar... And you \n                         got any \"day old bread\"?\n\n               A woman with attractive Irish looks brushes past Harvey on \n               her way to the door. This is ALICE QUINN, roughly Harvey's \n               age but there is a tired, weary look in her eyes.\n\n                                     ALICE\n                         Hey, you're Harvey Pekar.\n\n               Half in a daze, Harvey stares at the chick.\n\n                                     HARVEY\n                         Yeah...\n\n                                     ALICE\n                         Alice Quinn. From school.\n\n               Harvey studies her face. Suddenly, it clicks.\n\n                                     HARVEY\n                         Oh yeah. College. We had a couple \n                         lit classes together.\n\n               Harvey pays and receives his items. They step back towards \n               the door.\n\n                                     ALICE\n                         What happened to you? You just \n                         disappeared after one semester.\n\n               Harvey scratches his armpit.\n\n                                     HARVEY\n                         I know, man. I got good grades and \n                         all but there was this required math \n                         class. I can't do math, an' that \n                         required class hangin' over my head \n                         made me crazy. Eventually the pressure \n                         got to be too much.\n\n                                     ALICE\n                         Well, you're doing okay anyway. I \n                         heard all about your jazz reviews \n                         and your comics.\n\n               This perks Harvey up.\n\n                                     HARVEY\n                         Ya did?\n\n                                     ALICE\n                         Sure, you're famous. Meanwhile I got \n                         my degree but I'm just a plain old \n                         wife and mother.\n\n               Harvey stares at her wedding ring. His face drops.\n\n                                     HARVEY\n                         Yeah. I'm not doing as great as ya \n                         think. My second wife divorced me \n                         and I work at a dead end job as a \n                         file clerk. Sometimes I hang out \n                         with the guys on the corner but most \n                         of the time I just stay home by myself \n                         and read.\n\n               Alice laughs.\n\n                                     ALICE\n                         You're luckier than you think. My \n                         husband and kids make it impossible \n                         for me to cuddle up with a good book.\n\n                                                                    CUT TO:\n\n               EXT. BAKERY - SPRING - 1980'S - DAY\n\n               HARVEY and ALICE continue their conversation as they stroll \n               towards her car.\n\n                                     HARVEY\n                         I'm reading this book by Dreiser now -- \n                         JENNIE GERHARDT.\n\n                                     ALICE\n                         That's one of my favorites.\n\n                                     HARVEY\n                         I hope it don't end like so many a' \n                         those naturalist novels... With \n                         someone getting crushed ta earth by \n                         forces he can't control.\n\n               Alice smiles.\n\n                                     ALICE\n                         I think you'll be pleasantly \n                         surprised. It's certainly not a \n                         Hollywood happy ending, but it's \n                         pretty truthful. Which is rare these \n                         days...\n\n               This hits home with Harvey. He can't believe he's made such \n               a connection with this woman.\n\n               Alice stops in front of a beat-up station wagon.\n\n                                     ALICE\n                         This is me.\n\n                                     HARVEY\n                         Nice car. I don't have one yet.\n\n                                     ALICE\n                         Can I give ya a lift somewhere?\n\n                                     HARVEY\n                         Nah. It's a nice day. I'll just walk.\n\n               Harvey looks down, a little sad.\n\n                                     ALICE\n                         Well, we should have you over sometime \n                         for dinner.\n\n                                     HARVEY\n                         Sure, I'd be glad t'come. But if you \n                         really wanna do me a favor, introduce \n                         me to some a' your single girlfriends. \n                         I bet they're all smart like you. \n                         I'm no catch, though, so I'll take \n                         anything you can get me.\n\n               Alice pecks Harvey on the cheek.\n\n                                     ALICE\n                         I'll work on it.\n\n               She gets into the car.\n\n                                     ALICE\n                         Nice seeing ya Harvey.\n\n               Harvey watches as she drives off.\n\n                                     REAL HARVEY (V.O.)\n                         When I got home, I finished reading \n                         JENNIE GERHARDT. It was real good, \n                         way better than I expected. That \n                         Alice wuz right.\n\n               INT. HARVEY'S LIVING ROOM - SPRING - 1980'S - NIGHT\n\n               The room is moody, dark and lonely. The shadowy figure of \n               Harvey sits on the floor devouring JENNIE GERHARDT.\n\n                                     REAL HARVEY (V.O.)\n                         Sure Lester -- the main character -- \n                         croaks in the end, but at least he's \n                         old and dies a natural dignified \n                         death.\n\n               THE CAMERA TRAVELS AROUND THE ROOM TO FIND: Harvey again, \n               now silhouetted in the door frame, still clutching the book \n               and obsessed by his thoughts.\n\n                                     REAL HARVEY (V.O.)\n                         I was more alone that weekend than \n                         any. All I did was think about JENNIE \n                         GERHARDT an' Alice Quinn an' all the \n                         decades of people I have known.\n\n               THE CAMERA TRAVELS AGAIN TO FIND Harvey sitting on a chair \n               in the corner of his room. His head is bowed. His shoulders \n               slump over, as if he's struggling with something weighty.\n\n                                     REAL HARVEY (V.O.)\n                         The more I thought, the more I felt \n                         like cryin'; Life seemed so sweet \n                         an' so sad an' so hard t'let go of \n                         in the end.\n\n               THE CAMERA TRAVELS A FINAL TIME TO FIND: Harvey sprawled \n               across his couch. But he's not asleep; he's still obsessing. \n               The book lies on his chest like a lover.\n\n               CLOSE UP of Harvey's troubled face. Beneath the pain, we see \n               hope and determination.\n\n                                     REAL HARVEY (V.O.)\n                         But hey, man. Every day's a brand \n                         new deal, right? Just keep on workin' \n                         and sump'n's bound ta turn up.\n\n                                                                    CUT TO:\n\n               EXT. COSMIC COMICS STORE - DELAWARE - 1980'S - DAY\n\n               An urban comic book shop on a dicey but bohemian street. A \n               title over picture reads, \"MEANWHILE, IN DELAWARE.\"\n\n               INT. COSMIC COMICS STORE - 1980'S - DAY\n\n               JOYCE BRABNER, a depressive nudge with a perpetually peptic \n               expression frantically searches the store for something. Her \n               partner, a granola type named RAND, finishes unloading a \n               stack on the shelf.\n\n                                     JOYCE\n                         What happened to the new American \n                         Splendor?\n\n                                     RAND\n                         We sold 'em, babe.\n\n                                     JOYCE\n                         All of them?\n\n                                     RAND\n                         Yep.\n\n                                     JOYCE\n                              (accusatory)\n                         Damn it! I put one aside for myself, \n                         next to the register. I didn't even \n                         get a chance to read it.\n\n                                     RAND\n                         Whoa, sorry, Joyce. I didn't know \n                         you were such a Splendor fan. Next \n                         time take it home.\n\n               Joyce leans against the counter. She pushes up her glasses \n               and looks really upset.\n\n                                     JOYCE\n                         Maybe I'll call the publisher. But \n                         they take so damn long. Shit! Why \n                         does everything in my life have to \n                         be such a complicated disaster...\n\n               Joyce starts slamming things around the store. Finally Rand \n               grabs his stuff.\n\n                                     RAND\n                         Okay, I'm gonna hustle before the \n                         vibe in here gets any worse.\n\n               Rand leaves. Joyce barely notices, still brewing.\n\n                                                                    CUT TO:\n\n               INT. JOYCE'S BEDROOM - 1980'S - NIGHT\n\n               The mess in this room rivals Harvey's. A few cats add to the \n               clutter. Joyce lies on her disheveled bed and writes a letter.\n\n                                     JOYCE (V.O.)\n                         Greetings from the second smallest \n                         state in the union, an endless \n                         plastics and nylon plantation \n                         controlled by giant chemical \n                         corporations.\n\n                                                                    CUT TO:\n\n               EXT. HARVEY'S APARTMENT - VESTIBULE - 1980'S - DAY\n\n               HARVEY takes his mail out of the box. He finds an oddly \n               decorated envelope.\n\n                                     JOYCE (V.O.)\n                         To make matters more dismal, there \n                         are no decent comic book stores in \n                         my town, which is why my partner and \n                         I opened one ourselves.\n\n               INT. HARVEY'S BATHROOM - 1980'S - DAY\n\n               HARVEY finishes reading the letter sitting on the toilet. A \n               cat runs around him.\n\n                                     JOYCE (V.O.)\n                         Despite our steadily faltering \n                         business, my partner managed to sell \n                         the last copy of American Splendor \n                         #8 out from under me. I'm a big fan \n                         and I hate to wait for a new order. \n                         Is there any way I can get it from \n                         you direct? Sincerely, Joyce Brabner.\n\n               Harvey scratches his head. He mutters to himself.\n\n                                     HARVEY\n                         ...man, she's got good lookin' \n                         handwritin'...\n\n               INT. HARVEY'S BEDROOM - 1980'S - NIGHT\n\n               BEGIN MONTAGE -- HARVEY AND JOYCE COMMUNICATING\n\n               We see Harvey in his bed writing.\n\n                                     HARVEY\n                         Dear Joyce, Thanks for the letter. \n                         Whattya do besides sellin' comics?\n\n               THE SCREEN SPLITS TO ACCOMMODATE:\n\n               INT. DELAWARE PRISON CLASSROOM - 1980'S - DAY\n\n               We see Joyce standing in front of a GROUP OF PRISONERS.\n\n                                     JOYCE (V.O.)\n                         I'm a sometime activist and I teach \n                         writing to prisoners. I try to help \n                         them build an interior life and make \n                         art out of their monotonous, \n                         suffocating routine.\n\n               THE SCREEN GIVES WAY TO ANOTHER FRAME\n\n               INT. BUS - 1980'S - DAY\n\n               Harvey scribbles a letter while riding on the bus.\n\n                                     HARVEY (V.O.)\n                         Sounds familiar. So you married or \n                         what?\n\n               INT. JOYCE'S APARTMENT - 1980'S - DAY\n\n               Joyce empties her can of cat food in a plate and slides it \n               towards her kitty.\n\n                                     JOYCE (V.O.)\n                         I'm divorced, thank god.\n\n               INT. HARVEY'S BEDROOM - 1980'S - EVENING\n\n               Now we see Harvey (full screen) in bed in his underwear \n               talking on the PHONE. He's clipping his toe nails.\n\n                                     HARVEY\n                         Look, I think you an' I got a lot in \n                         common. How am I gonna get you to \n                         come visit me in Cleveland?\n\n                                     JOYCE (V.O.)\n                         Cleveland? You think that's a good \n                         idea?\n\n                                     HARVEY\n                         It's a great idea. You should meet \n                         me, 'cause I'm a great guy. Despite \n                         the way my comics read, I got a lot \n                         of redeeming characteristics.\n\n               CLIP! He clips off a big one.\n\n               THE SCREEN SPLITS TO REVEAL\n\n               INT. JOYCE'S APARTMENT - 1980'S - NIGHT\n\n               Joyce sits on her equally disheveled bed dunking a tea bag.\n\n               Her hair is wet from a shower.\n\n                                     JOYCE\n                         I don't know. Where would I stay?\n\n                                     HARVEY (V.O.)\n                         With me. Don't worry, I'm not gonna \n                         put no moves on you or anything.\n\n                                     JOYCE\n                         I'm not worried about that...\n                              (fumbling with a tea \n                              cup)\n                         Hold on, I just spilled chamomile \n                         tea all over my bathrobe.\n\n                                     HARVEY (V.O.)\n                         So what are ya worried about then?\n\n               Joyce sighs and lies down. A variety of AMERICAN SPLENDORS \n               are across her bed. Different interpretations of Harvey stare \n               up at her.\n\n                                     JOYCE\n                              (sipping)\n                         Well, the way all those different \n                         artists draw you, I don't quite know \n                         what to expect. I mean sometimes you \n                         look like a younger Brando, but then \n                         the way Crumb draws you -- like a \n                         hairy ape with all those stinky, \n                         wavy lines radiating off your body -- \n                         it's kind of scary.\n\n                                     HARVEY (V.O.)\n                         Those are motion lines. I'm an active \n                         guy. Anyway, just come out here an' \n                         I'll try to be anyone you want me ta \n                         be.\n\n               Joyce smiles for the first time.\n\n                                     JOYCE\n                         That's a dangerous offer. I'm a \n                         notorious reformer...\n\n                                                                    CUT TO:\n\n               INT. AIRPORT - ARRIVALS GATE - 1980'S - DAY\n\n               A nervous JOYCE walks off the plane into the arrivals area.\n\n               She scans the crowd of friends, family, lovers and limo \n               drivers waiting to meet the disembarking passengers. Where \n               is Harvey? What will he look like?\n\n               As Joyce surveys the unfamiliar faces, she imagines different \n               versions of an animated, illustrated Harvey among the people.\n\n               She double-takes as sees the R. CRUMB HARVEY -- hairy, scary, \n               smelly and picking his nose. Joyce rubs her eyes.\n\n               Next she sees the BRANDO HARVEY (Gary Dumm), but unfortunately \n               he disappears fast.\n\n               Disappointed, Joyce notices the realistic DREW FRIEDMAN HARVEY \n               walking towards her. She smiles as he dissolves into:\n\n                                     HARVEY (O.S.)\n                         Hey. Are you Joyce?\n\n               Joyce turns around. The flesh and blood HARVEY PEKAR stands \n               before her -- not quite as bad as the Crumb version, not \n               quite as good as the Dumm version, but still acceptable. She \n               sighs with relief.\n\n                                     JOYCE\n                         Hi, Harvey. We finally meet in person.\n\n               She politely offers her hand. Harvey shakes it, but he looks \n               overwhelmed, worried and pessimistic.\n\n                                     HARVEY\n                         Hiya. Look, before we get started \n                         with any of this, ya might as well \n                         know right off the bat. I had a \n                         vasectomy.\n\n               Joyce lets go of his hand. She stares at him in disbelief.\n\n                                                                    CUT TO:\n\n               INT. TGIF STYLE RESTAURANT - 1980'S - NIGHT\n\n               The most awkward date in history. Seated in an ultra-yuppie \n               restaurant filled with business lunchers, Harvey and Joyce \n               hide behind their menus. While everyone else looks slick and \n               successful, these two compete for the world's worst posture. \n\n                                     HARVEY\n                         What's wrong?\n\n                                     JOYCE\n                         Nothing.\n\n                                     HARVEY\n                         Somethin's wrong. Yer lookin' around \n                         everywhere.\n\n                                     JOYCE\n                         I guess I never imagined you eating \n                         in a place like this.\n\n                                     HARVEY\n                         Me? I never been here. I thought \n                         you'd like it. But obviously ya don't, \n                         do ya?\n\n                                     JOYCE\n                         It's fine. What difference does it \n                         make?\n\n               Harvey shakes his head, feeling more pessimistic.\n\n                                     HARVEY\n                         I dunno. None, I guess.\n                              (beat)\n                         They sure got a lot of meat on this \n                         menu.\n\n                                     JOYCE\n                         You're a vegetarian?\n\n                                     HARVEY\n                         Kinda. I mean ever since I got a pet \n                         cat, I couldn't eat animals anymore.\n\n               Joyce grabs a bread stick.\n\n                                     JOYCE\n                         Hmm. I support and identify with \n                         groups like PETA, but unfortunately \n                         I'm a self-diagnosed anemic. Also, I \n                         have all these food allergies to \n                         vegetables that give me serious \n                         intestinal distress. I guess I have \n                         a lot of borderline health disorders \n                         that limit me politically when it \n                         comes to eating.\n\n               Harvey just stares at her.\n\n                                     HARVEY\n                         Wow. Yer a sick woman, huh?\n\n                                     JOYCE\n                         Not yet. But I expect to be. Everyone \n                         in my family's got some kind of \n                         degenerative illness.\n\n               A cheery waitress bounces over.\n\n                                     WAITRESS\n                              (sing song)\n                         Good afternoon! I'm your server Cindy! \n                         What can I bring you two today?\n\n               They slowly look up at her.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - NIGHT\n\n               JOYCE and HARVEY enter the apartment. The place is a mess, \n               as usual.\n\n                                     HARVEY\n                         Look, I was gonna clean up, but why \n                         should I give you any false notions? \n                         The truth is I got a serious problem \n                         with cleanliness. I could wash a \n                         dish ten times and it'd still dirty. \n                         They even kicked me outta the Army \n                         'cause I couldn't learn ta make a \n                         bed.\n\n               Joyce puts down her bag.\n\n                                     JOYCE\n                         I've seen worse.\n\n               She slumps down on the sofa as if she's been here a million \n               times. She rubs her head. Harvey sits next to her.\n\n                                     JOYCE\n                         Harvey, go get me water and a few \n                         aspirin.\n\n               Harvey just bounces back up and obeys.\n\n                                     HARVEY\n                         What, ya got a headache?\n\n                                     JOYCE\n                         No, but I want to avoid one.\n\n               Harvey empties the aspirin bottle in his palm. For some \n               reason, he's feeling more comfortable.\n\n                                     HARVEY\n                         Well lemme tell ya Joyce, it sure is \n                         nice ta have company. I mean, despite \n                         all your problems, you seem like a \n                         great person. An' hey, sorry if my \n                         dating skills are kinda rusty, but \n                         I've just been through hell and back \n                         with women. I mean that last one \n                         turned out to be a real nasty bitch.\n\n               Harvey arrives back with the aspirin. He hands it to Joyce.\n\n                                     JOYCE\n                         I had a nice time with you, too.\n\n               Joyce swallows the pill. Harvey sits down next to her.\n\n                                     HARVEY\n                         Yeah? You had a nice time?\n\n                                     JOYCE\n                         Don't make people repeat themselves. \n                         It's annoying.\n\n                                     HARVEY\n                         Oh, sorry.\n\n               They're inches away from each other.\n\n                                     JOYCE\n                         C'mere...\n\n               She pulls him close. Harvey plants a kiss on her.\n\n               They slowly separate. Joyce's eyes are closed. She likes \n               him. He kisses her again. They start making out, moaning a \n               bit.\n\n               But before it gets heavy --\n\n                                     JOYCE\n                         Harvey?\n\n                                     HARVEY\n                         Yeah?\n\n               Joyce opens her eyes. She looks uneasy.\n\n                                     JOYCE\n                         Which door's the bathroom?\n\n               INT. HARVEY'S APARTMENT - BATHROOM DOOR - 1980'S - DAY\n\n               Harvey stands by the bathroom door, despondent. From inside \n               we hear the sounds of moaning and flushing.\n\n                                     HARVEY\n                         Hey, Joyce! What's wrong? What is \n                         it?\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S BATHROOM - DAY\n\n               FLUSH! Joyce is doubled over on the toilet. She's looking \n               green.\n\n                                     JOYCE\n                         Ugh! I don't know. I think that yuppie \n                         food did me in.\n\n                                                                   BACK TO:\n\n               INT. HARVEY'S APARTMENT - BATHROOM DOOR - DAY\n\n               OUTSIDE THE DOOR\n\n                                     HARVEY\n                         I feel terrible. Lemme at least do \n                         something for you.\n\n                                                                   BACK TO:\n\n               INT. HARVEY'S BATHROOM - DAY\n\n               Joyce gets to her feet and puts her glasses back on. She \n               picks up a can and sprays air freshener around the room.\n\n               Then she looks at the can and realizes it's WD-40.\n\n                                     HARVEY\n                         Can I make ya something? How about \n                         some chamomile tea?\n\n               Joyce puts the can down.\n\n                                     JOYCE\n                         Chamomile tea? What the hell's a guy \n                         like you doing with that? I thought \n                         you drink soda pop for breakfast.\n\n                                     HARVEY (O.S.)\n                         I dunno. I noticed you drank a lot \n                         of it when we started talkin' on the \n                         phone. So I stocked up on herbal \n                         teas for your visit.\n\n               Joyce turns her head to the door. She's truly surprised by \n               what Harvey's just said. And very moved. She smiles to \n               herself.\n\n                                                                   BACK TO:\n\n               INT. HARVEY'S APARTMENT - BATHROOM DOOR - DAY\n\n               Harvey stands there waiting.\n\n                                     HARVEY\n                         The girl at the Food Co-op picked me \n                         out all kinds of herbal stuff. One \n                         of 'ems good for stomachaches. Grandma \n                         Bear's Tummy Mint, I think. Are you \n                         still there?\n\n               Joyce slowly opens the door. She leans against the door frame \n               like she's just been through a war.\n\n               She takes off her glasses and cleans them off with her shirt.\n\n                                     JOYCE\n                         Harvey, we better skip this whole \n                         courtship thing and just get married.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S BEDROOM - 1980'S - DAY\n\n               Harvey and Joyce are in bed, lying in each other's arms.\n\n               They look quite contented.\n\n                                     HARVEY\n                         Man, am I glad I talked you into \n                         comin' up here. Any more time alone \n                         and I mighta lost it fer good.\n\n                                     JOYCE\n                         Me too.\n\n                                     HARVEY\n                         So you don't have any problems with \n                         movin' to Cleveland?\n\n                                     JOYCE\n                         Not really. I find most American \n                         cities depressing in the same way.\n\n                                     HARVEY\n                         An' yer okay with the vasectomy thing?\n\n               She shrugs.\n\n               EXT. PARKING LOT - V.A. HOSPITAL - 1980'S - DAY\n\n               HARVEY approaches the building. Instead of dragging his feet \n               like usual, he seems to be floating on a cloud. We haven't \n               seen Harvey this happy since... well, since never.\n\n               He stops by a junker car and peeks in the window, finding \n               TOBY eating lunch alone. He has an entire White Castle \n               smorgasbord spread across the front seat.\n\n               Harvey knocks on the window. Toby rolls it down.\n\n                                     HARVEY\n                         Ay Toby.\n\n                                     TOBY\n                              (mouth full)\n                         No you can't have any of my White \n                         Castle hamburgers so please don't \n                         even ask.\n\n                                     HARVEY\n                         Can I have a fry?\n\n               Harvey reaches for a handful of Toby's fries.\n\n                                     TOBY\n                         Okay, but just a couple, Harvey. I'm \n                         not going to eat dinner until very \n                         late and this has got to hold me \n                         over.\n\n               Harvey leans in, always amused by Toby. He steals another \n               fry.\n\n                                     HARVEY\n                              (munching)\n                         Whattya got, a church function?\n\n                                     TOBY\n                         No, I'm driving to Toledo to see a \n                         movie. Would you like to come?\n\n                                     HARVEY\n                         Nah. I gotta fly to Delaware tonight. \n                         I'm gettin' married.\n\n                                     TOBY\n                         Oh. Why Delaware?\n\n                                     HARVEY\n                         The chick I'm marryin' is from \n                         Wilmington. Plus, I gotta help her \n                         move her stuff here.\n                              (a beat)\n                         Why you drivin' ta Toledo to see a \n                         movie?\n\n                                     TOBY\n                         It's not playing at the Mapletown.\n                              (a beat)\n                         I didn't know you had a girlfriend, \n                         Harvey.\n\n                                     HARVEY\n                         Yeah. We met last week.\n\n               Harvey opens the car door and slides in with Toby.\n\n                                     HARVEY\n                         Toby, what movie could possibly be \n                         worth drivin' 260 miles round trip \n                         for?\n\n                                     TOBY\n                         It's a new film called \"Revenge of \n                         the Nerds.\" It's about a group of \n                         nerd college students who are being \n                         picked on all the time by the jocks, \n                         so they decide to take revenge. I \n                         already saw it once.\n\n                                     HARVEY\n                         Wow, ya really dig this movie.\n\n                                     TOBY\n                         I like it a lot, Harvey.\n\n                                     HARVEY\n                         What are these nerds like? How would \n                         you describe them?\n\n                                     TOBY\n                         Hmm... Nerds are smart but they look \n                         and act differently than other people. \n                         Like nerds might wear polyester button-\n                         down shirts and flood pants where \n                         their ankles and their socks are \n                         showing.\n\n               Toby spills some catsup on his polyester button-down shirt.\n\n               He stands up to get a napkin, revealing his flood pants.\n\n                                     HARVEY\n                         So what yer sayin' is you identify \n                         with those nerds?\n\n                                     TOBY\n                              (rubbing out the catsup)\n                         Yes, I consider myself a nerd. And \n                         this movie has uplifted me. There's \n                         this one scene where a nerd grabs \n                         the microphone during a pep rally \n                         and announces that he is a nerd and \n                         that he is proud of it and stands up \n                         for the rights of other nerds. Then, \n                         he asks the kids at the pep rally \n                         who think they are nerds to come \n                         forward... So nearly everyone in the \n                         place does. That's the way the movie \n                         ends.\n\n                                     HARVEY\n                         So the nerds won, huh?\n\n                                     TOBY\n                              (smiling)\n                         Yes.\n\n               Harvey grabs the rest of Toby's fries and opens the door to \n               leave.\n\n                                     HARVEY\n                         Wow. You got this movie an' I'm \n                         gettin' hitched. We both had a good \n                         month, huh?\n\n                                     TOBY\n                              (finishing his last \n                              burger)\n                         Right. Harvey, how long are you going \n                         to be in Delaware because I'd really \n                         like to see this movie with you?\n\n                                     HARVEY\n                         I'm only goin' for a week but then \n                         I'll have a wife, so I'll have to \n                         take her along. Is it a girl flick?\n\n                                     TOBY\n                         Depends on the girl. What kind of \n                         girl is your new bride? Is she a \n                         nerd?\n\n                                     HARVEY\n                         I don't know, man. Maybe. She's into \n                         herbal teas.\n\n               Toby watches Harvey saunter off. He returns to his last \n               hamburger.\n\n                                                                    CUT TO:\n\n               EXT. MOVIE THEATER - 1980'S - NIGHT\n\n               A brightly lit marquee reads, \"REVENGE OF THE NERDS.\" The \n               doors to the theater open and a crowd pours onto the street.\n\n               HARVEY, JOYCE and TOBY are among them. Toby proudly wears a \n               \"Genuine Nerd\" button on his striped shirt.\n\n                                     JOYCE\n                         I agree with Toby. I think it's a \n                         story of hope and tolerance.\n\n                                     TOBY\n                         Yes. It's about time that the people \n                         who get picked on get to be the \n                         heroes.\n\n               Harvey scrunches his face in disbelief.\n\n                                     HARVEY\n                         It's an entertaining flick an' I can \n                         see why you like it Toby, but those \n                         people on the screen ain't even \n                         supposed to be you! They're college \n                         students whose parents live in big \n                         houses in the suburbs. They're gonna \n                         get degrees, get good jobs and stop \n                         being nerds.\n\n               Joyce hits Harvey.\n\n                                     JOYCE\n                         Harvey, what did I say about loud \n                         talking? Use your inside voice.\n\n                                     HARVEY\n                              (whispering loudly)\n                         Look Toby, the guys in that movie \n                         are not 28-year-old file clerks who \n                         live with their grandmothers in an \n                         ethnic ghetto.\n\n                                     JOYCE\n                         That's enough, Harvey.\n\n                                     HARVEY\n                         They didn't get their computers like \n                         you did -- by trading in a bunch of \n                         box tops and $49.50 at the \n                         supermarket.\n\n               Joyce folds her arms in disapproval. Toby starts to laugh.\n\n                                     TOBY\n                         You're funny Harvey.\n\n               Harvey looks at him, disappointed. He shakes his head.\n\n                                     HARVEY\n                         Sure, Toby. Go to the movies and \n                         daydream, but \"Revenge of the Nerds\" \n                         ain't reality. It's just Hollywood \n                         bullshit.\n\n                                                                    CUT TO:\n\n               EXT. TOBY'S CAR -- A FEW MOMENTS LATER\n\n               ANGLE ON TOBY'S CAR (THROUGH WINDSHIELD)\n\n               Toby and Joyce continue to analyze the movie in the front \n               seat as Toby starts the ignition.\n\n                                                                    CUT TO:\n\n               INT. TOBY'S CAR\n\n               ANGLE ON HARVEY IN BACK SEAT\n\n               Slouched, grumpy and alone on the back seat, Harvey's still \n               annoyed by the movie.\n\n                                     REAL HARVEY (V.O.)\n                         Okay, maybe I was bein' so harsh on \n                         Toby onna count a' my own problems.\n\n                                     REAL HARVEY\n                         Y'see, I wasn't even married a month \n                         and my old lady was already showin' \n                         signs a' trouble. Granted, I tend ta \n                         get married fast 'cause I'll take \n                         any woman that'll have me, but this \n                         time I really met my match...\n\n                                                                    CUT TO:\n\n               INT. REHEARSAL STUDIO - PRESENT - DAY\n\n               HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n               A few items indicating film production are in the frame.\n\n               At a table in the foreground, BOB THE DIRECTOR discusses the \n               character of Joyce with the ACTRESS playing her. The actress \n               just nods as the director goes on.\n\n               We can see THE REAL JOYCE sitting with THE REAL HARVEY in \n               the distance.\n\n                                     DIRECTOR\n                         Okay, I think the thing with Joyce \n                         is that as manic as Harvey can be, \n                         she matches him with depression. In \n                         that way they complete each other. I \n                         mean, she's obviously a very smart \n                         woman, but she has a lot of trouble \n                         functioning in a world she can't \n                         control. And she's totally obsessed \n                         with all things negative; y'know, \n                         diseases, dysfuctions, etc.\n\n               THE REAL JOYCE and REAL HARVEY listen curiously -- sometimes \n               pleased, sometimes displeased -- as their personalities are \n               dissected and boiled down to a few phrases.\n\n               CLOSER SHOT OF REAL JOYCE AND HARVEY\n\n               The REAL JOYCE puts in her two cents about the actress playing \n               her. She rants about what it's like to be portrayed in a \n               movie, and having a character arc imposed on her life.\n\n               She moves into talking about her relationship with Harvey, \n               and the first years of their marriage -- how impossible it \n               was to live with him.\n\n               The REAL HARVEY just rolls his eyes.\n\n               END HIGH DEFINITION VIDEO DOCUMENTARY FOOTAGE\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               JOYCE is on a cleaning rampage. She rummages through piles \n               upon piles of records while HARVEY paces nervously.\n\n                                     JOYCE\n                         What about these 78's, Harvey? Can't \n                         you sell them to one of those \n                         collectors?\n\n                                     HARVEY\n                         Are ya kidding? No way, man. I ain't \n                         getting rid of my 78's.\n\n               Joyce throws down the records in frustration. Harvey runs \n               over to check if they're scratched.\n\n                                     JOYCE\n                              (angry)\n                         Forget it then. I give up! How can I \n                         make more storage space, if you won't \n                         get rid of anything?\n\n                                     HARVEY\n                         I'll get rid of stuff. Just not my \n                         good stuff.\n\n                                     JOYCE\n                         Everything's your good stuff. How am \n                         I supposed to live here, if there's \n                         no room for me?\n\n                                     HARVEY\n                         Aw come on, baby. I'll make room for \n                         ya. You just have to give me time. \n                         I'm not so good at these kind of \n                         things.\n\n                                     JOYCE\n                         That's because you're obsessive \n                         compulsive Harvey.\n\n               A DOOR BUZZER rings. Harvey slams it to unlock the front.\n\n                                     HARVEY\n                         C'mon. I don't wanna hear that \n                         psychobabble crap!\n\n                                     JOYCE\n                         I don't care if you wanna hear it or \n                         not. You're the poster child for the \n                         DSM III. I'll have you know that I \n                         come from a very dysfunctional family. \n                         I can spot personality disorders a \n                         mile away...\n\n               A KNOCK ON THE DOOR interrupts their argument. Joyce storms \n               away to answer it.\n\n               ANGLE ON THE DOOR:\n\n               Joyce opens it to face a smiling TOBY -- dressed as usual in \n               a loud polyester fashion don't. He talks in his strange \n               robotic voice and avoids all eye contact.\n\n                                     TOBY\n                         Hello Joyce. Is Harvey home?\n\n               Joyce turns to Harvey and points to Toby.\n\n                                     JOYCE\n                         Borderline autistic!\n\n               This scene shrinks into a square up in the corner. The next \n               few scenes (NEUROSIS MONTAGE) further divide up the full \n               screen like a comic book.\n\n               INT. CLEVELAND COMIC BOOK STORE - 1980'S - DAY\n\n               R. CRUMB leaps from behind an autograph table (where he's \n               signing comics) to hop on the back of ZAFTIG BABE, who offers \n               him a piggy-back ride.\n\n               Joyce turns to Harvey.\n\n                                     JOYCE\n                         Polymorphously Perverse.\n\n                                                                    CUT TO:\n\n               EXT. PARKING LOT - V.A. HOSPITAL - 1980'S - DAY\n\n               JOYCE picks up Harvey from work. HARVEY enters the car, waving \n               goodbye to the ranting MR. BOATS.\n\n               She points to Mr. Boats.\n\n                                     JOYCE\n                         Paranoid Personality Disorder.\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               THE TELEPHONE RINGS. A disheveled, tired-looking JOYCE flips \n               through a novel and lets the machine pick up.\n\n                                     ANSWERING MACHINE\n                         Please leave a message.\n                              (Beep)\n                          \n\n                                     HARVEY\n                              (into phone)\n                         Hey Joyce, it's me. You're not gonna \n                         believe this but some LA producer \n                         called an' he wants to do a play \n                         about my life. Call me!\n                              (Click)\n\n               Joyce flips the page.\n\n                                     JOYCE\n                              (to herself)\n                         Delusions of grandeur.\n\n               END NEUROSIS MONTAGE (return to full screen)\n\n                                                                    CUT TO:\n\n               INT. THEATER - 1980'S - EVENING\n\n               HARVEY and JOYCE sit in a packed theater watching a play.\n\n               Joyce looks exhausted.\n\n               ANGLE ON STAGE\n\n               A STAGE ACTOR HARVEY and a STAGE ACTOR JOYCE share a couch \n               on the sparse stage.\n\n                                     STAGE ACTOR HARVEY\n                         See, I think comics can be an art \n                         form. With pictures an' words, a guy \n                         can do pretty much anything!\n\n                                     STAGE ACTOR JOYCE\n                         That's true, Harvey. But I didn't \n                         come all the way from Delaware to \n                         talk about comics ...\n\n               The \"Stage Actor Joyce\" lunges over and plants a kiss on \n               him.\n\n               ANGLE ON HARVEY AND JOYCE IN AUDIENCE\n\n               Harvey digs it but Joyce looks disgusted.\n\n               BACK TO STAGE\n\n               We now see STAGE ACTOR HARVEY clutching a tea cup, as STAGE \n               ACTOR JOYCE kneels before a toilet bowl. Off to the side of \n               the stage, A SPOT LIGHT illuminates a GUITAR PLAYER, who \n               adds music to the scene.\n\n                                                                    CUT TO:\n\n               INT. AIRPORT - 1980'S - DAY\n\n               HARVEY and JOYCE walk through the terminal. Harvey brims \n               with energy but Joyce looks exhausted.\n\n                                     REAL HARVEY (V.O.)\n                         If ya think readin' comics about yer \n                         life seems strange, try watchin' a \n                         play about it. God only knows how \n                         I'll feel when I see this movie. But \n                         truth be told, the play wasn't half \n                         bad, and we got a free trip outta \n                         it. Things were goin' pretty good \n                         for a change. Variety called me \"The \n                         Blue Collar Mark Twain,\" and Doubleday \n                         was interested in publishing an \n                         anthology of \"American Splendor.\" \n\n                                                                    CUT TO:\n\n               INT. AIRPORT - BAGGAGE CLAIM - 1980'S - DAY\n\n               Harvey nervously taps his foot as he waits for the bags.\n\n               Joyce leans against the carousel staring at a YOUNG MOTHER \n               with a BABY in a Bjorn.\n\n                                     HARVEY\n                         I hate checkin' bags, man. It always \n                         takes forever.\n\n               He checks his watch. Joyce remains quiet and distant.\n\n                                     HARVEY\n                         Jesus, look at the time. The bus is \n                         gonna leave soon and there won't be \n                         another one for an hour. That means \n                         I gotta shell out an extra thirty \n                         bucks for a cab.\n\n               Harvey spots a bag that he thinks is his.\n\n                                     HARVEY\n                         Hey wait, there's our --\n                              (a well-dressed man \n                              grabs it)\n                         Figures. That lucky Yuppie's gonna \n                         get on the bus in time.\n\n               Suddenly, Joyce mumbles something to Harvey.\n\n                                     JOYCE\n                         Y'know Harvey, vasectomies are \n                         reversible.\n\n                                     HARVEY\n                              (ignoring her)\n                         Damn Yuppies get everything.\n\n                                     JOYCE\n                              (raising her voice)\n                         Are you listening to me? I said \n                         vasectomies are reversible.\n\n               Heads turn.\n\n                                     HARVEY\n                         What? Whattya talkin' about? I don't \n                         want kids. An' I came clean about my \n                         vasectomy the first time I set eyes \n                         on ya', right here in this airport.\n\n               More heads turn.\n\n                                     JOYCE\n                         I know but things have changed. I \n                         think we can be a family.\n\n                                     HARVEY\n                         Family?! What kinda family could we \n                         possibly be? I ain't no good with \n                         kids. I can barely take care of \n                         myself.\n\n                                     JOYCE\n                         I'll take care of the kid and you.\n\n                                     HARVEY\n                              (dead serious)\n                         No way Joyce. Forget it. I can't do \n                         it; I can't have no kids.\n\n               Joyce folds her arms... dejected, defeated. The audience of \n               eavesdroppers looks disappointed as well.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               If the place was a disaster before, believe it or not, it's \n               gotten worse. JOYCE seems to have given up on her \n               organizing... and everything else for that matter.\n\n               HARVEY hysterically searches through the mess for a record \n               album. Joyce just lies listlessly on an open futon on the \n               middle of the room; it looks as if she hasn't been up in \n               days.\n\n                                     HARVEY\n                         Where the hell is that Ornette Coleman \n                         album, Joyce? I got a review due \n                         tomorrow.\n\n               Joyce rolls over.\n\n                                     JOYCE\n                         I didn't touch it, Harvey. Would you \n                         let me sleep?\n\n                                     HARVEY\n                         But it's one o'clock! How late can a \n                         person sleep?\n\n               Joyce sits up. This time she means business.\n\n                                     JOYCE\n                         It happens to be Saturday you selfish \n                         sonofabitch! And don't you go telling \n                         me what to do. I'm the one who moved \n                         into your city, into your home, into \n                         your vasectomy and into your screwed-\n                         up life. The least you could do is \n                         allow me to live here my way.\n\n               She rolls over and covers her head with the pillow. Harvey \n               just stands there staring at her.\n\n                                                                    CUT TO:\n\n               INT. SUPERMARKET - 1980'S - DAY\n\n                                     REAL HARVEY (V.O.)\n                         I tried everything but nothin' could \n                         get this woman outta bed.\n\n               HARVEY peruses the aisles. He pulls box upon box of herbal \n               tea off the shelves.\n\n                                     REAL HARVEY (V.O.)\n                         I mean she wouldn't get a job, \n                         wouldn't go out, wouldn't make \n                         friends, nothin'.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               HARVEY throws boxes of herbal teas at JOYCE as she sprawls \n               listlessly on the futon. She just yawns and turns over on \n               her side.\n\n                                     REAL HARVEY (V.O.)\n                         Joyce diagnosed herself as \"clinically \n                         depressed.\" I don't know what the \n                         hell she was goin' through but it \n                         was sure takin' it's toll on me.\n\n               A frustrated Harvey tries once more to cheer her up.\n\n                                     HARVEY\n                              (upbeat)\n                         We can go out for dinner tonight. \n                         How 'bout catching a bite at Tommy's?\n\n                                     JOYCE\n                              (mumbling)\n                         I'm not hungry.\n\n               Harvey throws his hands in the air and walks off.\n\n                                     HARVEY\n                         I give up.\n\n               As he passes the answering machine, he notices it's blinking.\n\n                                     HARVEY\n                         Hey Joyce, we got a message here. \n                         Why didn't you pick up.\n\n               Joyce doesn't respond.\n\n                                     HARVEY\n                         Useless.\n\n               He presses the play button.\n\n               ANGLE ON ANSWERING MACHINE: A loud \"beep,\" then ...\n\n                                     MALE VOICE\n                         Hi, this is a message for Harvey \n                         Pekar. My name is Jonathan Greene \n                         and I'm a producer for LATE NIGHT \n                         WITH DAVID LETTERMAN. We'd like to \n                         talk to you about coming on the show \n                         to plug your comics. Please give me \n                         a call at 212-555-3333.\n\n                                     HARVEY (O.S.)\n                         What the hell?\n\n               Joyce sits up. Harvey's finger hits the \"Replay\" button.\n\n                                     MALE VOICE\n                         Hi, this is a message for Harvey --\n\n                                                                    CUT TO:\n\n               EXT. MANHATTAN SKYLINE - 1980'S - DAY\n\n               ESTABLISHING SHOT\n\n               The impressive skyline glistens in the spring sun.\n\n                                     REAL HARVEY (V.O.)\n                         Joyce finally got off the futon...\n\n                                                                    CUT TO:\n\n               EXT. WASHINGTON SQUARE PARK - NEW YORK - 1980'S - DAY\n\n               Armed with shopping bags from Bleecker Bob's Record Shop, \n               the Strand Book Store and Forbidden Planet Comic Book \n               Emporium, HARVEY and JOYCE eat lunch on a park bench. Harvey \n               chomps on a knish and watches oddball New Yorkers stroll by \n               as Joyce nibbles on her hot dog.\n\n                                                                    CUT TO:\n\n               INT. HOTEL HALLWAY -- DAY\n\n               CLOSE UP ON AN ICE BUCKET\n\n               Cut back to reveal Harvey, schlepping an ice bucket down a \n               hall in his underwear. A FEMALE BUSINESS TRAVELER passes and \n               stares at him. He enters a room with a \"DO NOT DISTURB\" sign.\n\n               INT. NEW YORK HOTEL ROOM - 1980'S - DAY\n\n               The PEKARS have already wreaked havoc on their luxury hotel \n               room. It looks like a tornado touched down on the New York \n               Hilton.\n\n               HARVEY tries on outfits for the big show. He pulls a wrinkled \n               T-shirt over his head and models it for JOYCE who is spread \n               out on the bed surrounded by piles of clothing, scissors and \n               sewing supplies. She glances up at Harvey's getup and shakes \n               her head no.\n\n                                     HARVEY\n                         Aw, c'mon. Who the hell cares?\n\n               Harvey tosses his shirt over to Joyce, who snatches it and \n               starts cutting it with a scissor.\n\n                                     HARVEY\n                         Hey, whattya doin?\n\n                                     JOYCE\n                         Merchandising.\n\n               She resumes her mysterious sewing project; she seems to be \n               making some kind of doll.\n\n                                                                    CUT TO:\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               Backstage, JOYCE watches LATE NIGHT WITH DAVID LETTERMAN on \n               a monitor as HARVEY awaits his turn to go on camera. He has \n               changed out of his wrinkled T-shirt into a slightly more \n               formal look -- a denim shirt and a ratty seersucker striped \n               jacket.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n               ANGLE ON MONITOR (NOTE: THIS IS ACTUAL STOCK FOOTAGE OF THE \n               SHOW)\n\n               A 1980's DAVID LETTERMAN wisecracks.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               Neither Joyce nor Harvey look particularly impressed with \n               the whole deal.\n\n                                     JOYCE\n                         People like this show?\n\n               Harvey paces.\n\n                                     HARVEY\n                         I'm gettin' hungry back here. They \n                         oughtta leave ya donuts or somethin'.\n\n               A nervous STAGE MANAGER wearing a headset peeks his head in.\n\n                                     STAGE MANAGER\n                         Dave's ready for you now, Mr. Pekar.\n\n                                     HARVEY\n                         Hey, you got anything ta eat? My \n                         stomach's growling.\n\n                                     STAGE MANAGER\n                              (checking his watch)\n                         There's no time to eat now.\n\n               Harvey glances at the monitor just as Letterman announces \n               his next guest.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n                                     LETTERMAN\n                         Okay. Our next guest works as a file \n                         clerk in a Cleveland hospital.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               The stage manager grabs Harvey by the arm. Joyce stops them.\n\n                                     JOYCE\n                         Wait a minute. Where's the doll?\n\n                                     HARVEY\n                         He's got it at the desk. Will you \n                         relax about that already?\n\n                                     STAGE MANAGER\n                         Guys, guys, we're in a hurry here.\n\n               The Stage Manager physically pushes Harvey out of the Green \n               Room. Joyce turns back to face the monitor.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n               ANGLE ON MONITOR\n\n               Letterman holds up a copy of a full-size glossy AMERICAN \n               SPLENDOR ANTHOLOGY.\n\n                                     LETTERMAN\n                         ...He also writes comic books which \n                         detail his day-to-day pains and \n                         pleasures, and this is an anthology \n                         of nine of those comics. It's entitled \n                         AMERICAN SPLENDOR... From off the \n                         streets of Cleveland, please say \n                         hello to Harvey Pekar.\n\n               THE HARVEY PEKAR WHO WALKS ONTO THE SET IS NOT THE ACTOR \n               PORTRAYING HIM BUT RATHER THE REAL HARVEY PEKAR (only about \n               15 years younger). THIS IS ACTUAL STOCK FOOTAGE FROM HARVEY'S \n               FIRST LETTERMAN APPEARANCE.\n\n               INT. GREEN ROOM - NBC STUDIOS - DAY\n\n               Joyce watches as Harvey shakes Letterman's hand and takes a \n               seat.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n               He smiles as the audience warmly greets him. It seems Harvey's \n               grooving on this attention. But as soon as the audience quiets \n               down, Harvey turns to his host and starts his offensive:\n\n                                     HARVEY\n                         I'm ready for those Cleveland jokes. \n                         Go ahead...\n\n               Taken off guard, Letterman laughs.\n\n                                     LETTERMAN\n                         Alright settle down Harvey. Settle \n                         down.\n                              (the Audience laughs)\n                         Now let's explain to folks who may \n                         not be familiar with your work what \n                         it is you do here, exactly. You have \n                         comic books about you in your daily \n                         life in Cleveland.\n\n                                     HARVEY\n                         That's right.\n\n                                     LETTERMAN\n                         And are they embellished at all or \n                         is it pretty much factual?\n\n                                     HARVEY\n                              (patronizing)\n                         No. It's all true, David. All true.\n\n                                     LETTERMAN\n                         And you also have a regular job in \n                         Cleveland working at a hospital.\n\n                                     HARVEY\n                         That's right. Aiding the sick, yes.\n\n                                     LETTERMAN\n                         Aiding the sick. Well that's certainly \n                         noble work.\n\n                                     HARVEY\n                         Thank you. Thank you.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               ANGLE ON JOYCE WATCHING\n\n                                     JOYCE\n                              (unimpressed)\n                         Such brilliant repartee...\n\n                                                                   BACK TO:\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n                                     LETTERMAN\n                         Now it seems to me Harvey that you \n                         have a very successful career here. \n                         This is being published by a major \n                         publishing company, Doubleday. Why \n                         do you maintain the day job?\n\n                                     HARVEY\n                              (defensive)\n                         To make a living!\n                              (big laughs)\n                         I don't make a living as a writer. \n                         I've been writing for many years, \n                         David. Maybe more years than you've \n                         been alive.\n\n               Now, Letterman cracks up.\n\n                                                                   BACK TO:\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               A LETTERMAN REGULAR (Tony Randall?) comes in with some food.\n\n               He stops by the monitor to watch a moment with Joyce.\n\n                                     HARVEY\n                         Yeah, I know that my youthful \n                         appearance belies, you know, my actual \n                         age. But, I've been around for a \n                         long time --\n\n                                     LETTERMAN REGULAR\n                              (to JOYCE)\n                         You know this guy?\n\n                                     JOYCE\n                         I'm beginning to wonder.\n\n               The Letterman Regular takes a seat as he watches the monitor.\n\n               He seems more intrigued than Joyce.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n                                     LETTERMAN\n                         But I have a feeling though, if you \n                         wanted to, you could probably get by \n                         on what you make selling your work. \n                         Because I know people are after you \n                         to write other things. You're \n                         publishing this anthology...\n\n               This hits a sore spot. Harvey goes from politely condescending \n               to cantankerous in one second flat!\n\n                                     HARVEY\n                         Who? What people? What people? What \n                         are you talking about? Where the \n                         hell do you get that stuff?\n\n               Letterman cracks up. The Audience laughs even harder.\n\n                                     HARVEY\n                         I'm no show biz phoney. I'm telling \n                         the truth. Come on, man.\n\n               The Audience can't believe this guy's holding his own with \n               Letterman.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               ANGLE ON LETTERMAN REGULAR\n\n                                     LETTERMAN REGULAR\n                              (to Joyce)\n                         At least he's keeping up with \n                         Letterman.\n\n                                     JOYCE\n                         Pandering is more like it.\n\n               Suddenly, Joyce walks over to the monitor and looks for the \n               channel. She hits a button, but it only changes the frame of \n               the show.\n\n                                     JOYCE\n                         Damnit.\n\n                                     LETTERMAN REGULAR\n                         Excuse me, but what are you doing?\n\n                                     JOYCE\n                         I'm trying to get some news. You \n                         know there's a big story about to \n                         break about the US selling arms to \n                         Iran and the Contras.\n\n                                     LETTERMAN REGULAR\n                         That's a monitor.\n\n                                     JOYCE\n                         Ugh. Just forget it.\n\n               Joyce gives up. She sinks back into her seat and pulls a \n               book from her bag. The Letterman Regular stares at her like \n               she's from Mars.\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n               ANGLE ON THE MONITOR\n\n                                     LETTERMAN\n                         Harvey, I know you've got a job. \n                         I've got a job. We're both very lucky. \n                         We both have jobs.\n\n                                     HARVEY\n                         Then what's the matter?\n\n               Once again laughs and a big round of applause. Letterman \n               pulls out Joyce's mysterious doll and props it up on the \n               table.\n\n                                     LETTERMAN\n                         We've gotta go. Harvey I like you. \n                         I'm on your side. I enjoy the comic \n                         books. And here, quickly tell us \n                         about the little doll here.\n\n                                     HARVEY\n                         My wife made it.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               BACK TO JOYCE.\n\n               She suddenly perks up.\n\n                                     JOYCE\n                         Finally something good.\n                              (to Letterman Regular)\n                         Watch this.\n\n               LETTERMAN SHOW - STOCK FOOTAGE CLOSE-UP OF THE DOLL\n\n               It is an absolutely horrific but oddly evocative \"Harvey Rag \n               Doll.\" His face is inspired by Crumb's drawings of Harvey \n               but even more extreme. His little T-shirt reads, \"American \n               Splendor.\" The Audience is in stitches.\n\n                                     LETTERMAN\n                         They're made out of your old clothing.\n\n                                     HARVEY\n                         That's right.\n\n                                     LETTERMAN\n                         And what do these go for?\n\n                                     HARVEY\n                         Thirty-four bucks.\n\n                                     LETTERMAN\n                              (shocked)\n                         Thirty-four dollars? Thirty-four \n                         dollars for this?\n\n                                     HARVEY\n                         What are ya cheap. You cheaper than \n                         me?\n\n                                     LETTERMAN\n                         Would you pay thirty-four dollars \n                         for that?\n\n                                     HARVEY\n                         No but I'm not asking it. My wife \n                         is.\n\n                                                                   BACK TO:\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               JOYCE stares at the monitor, expressionless. The STAGE MANAGER \n               sticks his head in.\n\n                                     STAGE MANAGER\n                         He's a natural.\n\n                                     LETTERMAN REGULAR\n                         He is. Good stuff.\n\n               The Stage Manager grabs the Regular.\n\n                                     STAGE MANAGER\n                         C'mon. Your turn.\n\n               A smiling HARVEY (the actor now) waltzes in straight from \n               his command performance.\n\n                                     HARVEY\n                         Whad'ya think?\n\n               Joyce taps her finger on Letterman's image on the monitor.\n\n                                     JOYCE\n                         Megalomaniac.\n\n                                                               DISSOLVE TO:\n\n               INT. NEW YORK HOTEL ROOM - 1980'S - DAY\n\n               HARVEY tries on a ripped T-shirt for Joyce who lies on the \n               bed.\n\n                                     REAL HARVEY (V.O.)\n                         It became clear pretty fast that I \n                         was invited on the show just for \n                         laughs. But what the hell did I care? \n                         Letterman was an okay guy. Let him \n                         take pot shots at me, s'long as I \n                         got paid an' got to plug my comics.\n\n                                                                    CUT TO:\n\n               LETTERMAN SHOW - STOCK FOOTAGE\n\n               MONTAGE: A series of actual HARVEY appearances on LATE NIGHT \n               WITH LETTERMAN.\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               JOYCE, whose different outfits reflect time passage, watches \n               each time from the GREEN ROOM. LETTERMAN SHOW - STOCK FOOTAGE \n               HARVEY, in a ratty T-shirt, spars with LETTERMAN.\n\n                                     LETTERMAN\n                         Harvey, you are the embodiment of \n                         the American dream...\n\n               The Audience laughs.\n\n                                     REAL HARVEY (V.O.)\n                         Funny thing is, somethin' about me \n                         and Letterman clicked for the viewers. \n                         He kept wantin' me back.\n\n               LETTERMAN SHOW - STOCK FOOTAGE - ANOTHER SHOW\n\n               LETTERMAN introduces his favorite guest.\n\n                                     LETTERMAN\n                         It is my pleasure to welcome back \n                         our next guest, the lovable Harvey \n                         Pekar!\n\n               HARVEY walks out with a box of donuts. He starts giving \n               Letterman an earful right off the bat.\n\n                                     REAL HARVEY (V.O.)\n                         Here was this slick, ambitious guy \n                         with millions, winnin' over the \n                         country by makin' light of everything. \n                         And then there was me... A messy \n                         loser with no dough who takes \n                         everything too seriously.\n\n                                     LETTERMAN\n                         Tell me Harvey, what do you do to \n                         get away from the pressure of being -- \n                         well, a file clerk?\n                              (laughter)\n\n                                     HARVEY\n                         Go ahead and laugh, folks. But he \n                         has more contempt for you than I do!\n\n                                                                    CUT TO:\n\n               INT. WHITE CASTLE - 1980'S - DAY\n\n               The burger joint has been transformed into a film set with \n               lights, cameras and lots of trendy MTV types.\n\n                                     REAL HARVEY (V.O.)\n                         An it wasn't just me gettin' all the \n                         attention. As a result of my \n                         appearances on Letterman, my buddy \n                         Toby Radloff landed a gig on MTV \n                         extolling the virtues of White Castle \n                         burgers...\n\n               OFF TO THE SIDE:\n\n               Two HOT BABES slave over TOBY as he gets his hair and make-\n               up done.\n\n               HARVEY wanders onto the set. He finally spots Toby in the \n               corner. As he heads over to say hello, Harvey bumps into the \n               MTV DIRECTOR -- a new wave fashion victim who looks like a \n               lost member of A FLOCK OF SEAGULLS.\n\n                                     MTV DIRECTOR\n                         Christ! Watch where you're going!\n\n                                     HARVEY\n                              (muttering)\n                         Fuckin' yuppie or whatever kinda \n                         freak you are.\n\n                                     REAL HARVEY (V.O.)\n                         That day on the set with those MTV \n                         jerks, I had an epiphany. It seemed \n                         that real, salt of the earth people \n                         like Toby an' me were bein' coopted \n                         by these huge corporations. We were \n                         gettin' held up and ridiculed as \n                         losers in the system.  What can I \n                         say, it was the 80's man.\n\n                                                                    CUT TO:\n\n               MTV PUBLIC SERVICE ANNOUNCEMENT\n\n               TOBY, dressed in dark sunglasses and a turtleneck, stands in \n               front of a White Castle. He delivers his lines in his \n               trademark robotic style. There's an MTV logo on the bottom \n               of the screen.\n\n                                     TOBY\n                         Hamburgers are a safer addiction \n                         than drugs. Say no to drugs. Say yes \n                         to White Castle!\n\n                                                                    CUT TO:\n\n               INT. CLEVELAND DINER - 1980'S - DAY\n\n               HARVEY and JOYCE eat breakfast together. Harvey reads a \n               Katherine Mansfield book as JOYCE reads a newspaper.\n\n                                     JOYCE\n                              (looking up from the \n                              paper)\n                         Harvey, I've been reading about these \n                         kids who grew up in war zones... \n                         Palestinians, Israelis, El \n                         Salvadorians, Cambodians... These \n                         kids are amazing and they're --\n\n               A YUPPIE in a jogging suit walks up to Harvey, interrupting \n               Joyce in mid-sentence.\n\n                                     YUPPIE\n                         Hey, you're that guy from the \n                         Letterman show, right?\n\n                                     HARVEY\n                              (smiling)\n                         Yeah, that's me.\n\n                                     YUPPIE\n                         That's so excellent. You and Stupid \n                         Pet Tricks are a riot.\n\n               Harvey's not smiling anymore. This guy's a jerk.\n\n                                     HARVEY\n                         Yeah? Then why dontcha buy one of my \n                         comics, man. That's the only reason \n                         I go on that dumb show anyway.\n\n                                     YUPPIE\n                         Right, sure. Later, Harvey Pekar!\n\n               The Yuppie rushes out.\n\n                                     HARVEY\n                         Asshole.\n\n                                     JOYCE\n                         Anyway, I want to do a political \n                         comic book about these kids. There's \n                         a conference in Jerusalem in a few \n                         weeks, and I can start by doing \n                         interviews there.\n\n                                     HARVEY\n                         Whoa whoa, wait a second. Jerusalem? \n                         I can barely drag you off the futon \n                         to go to the Letterman show.\n\n                                     JOYCE\n                         Y'know why? 'Cause I don't give a \n                         damn about the Letterman show. I \n                         want to work on something important \n                         to me. Something that matters.\n\n               Joyce hits a nerve.\n\n                                     HARVEY\n                              (furious)\n                         Hey! You know I only go on the show \n                         for the extra bread!\n\n               People start to look over.\n\n                                     JOYCE\n                         Harvey... you're yelling...\n\n                                     HARVEY\n                         Maybe if you got yer lazy ass up and \n                         got a job, I could work on something \n                         that matters, too, huh?!\n\n               Joyce doesn't dignify Harvey with an answer. She stares at \n               him, her eyes well with hurt.\n\n               He sighs, calming down. He looks around sheepishly.\n\n                                     HARVEY\n                         I'm sorry, baby. I -- I'm sorry...\n\n               He grabs her hand.\n\n                                                                    CUT TO:\n\n               EXT. HARVEY'S APARTMENT - 1980'S - DAY\n\n               Harvey and Joyce stroll across the lawn holding hands. They \n               move towards a waiting cab. Harvey carries his wife's bags.\n\n                                     REAL HARVEY (V.O.)\n                         I guess it was good ta finally see \n                         Joyce excited about somethin' of her \n                         own. Sure I was happy for her. But I \n                         was still upset for me.\n\n               They stop by the cab.\n\n                                     HARVEY\n                         This is crazy. Can't ya just do \n                         somethin' here in Cleveland?\n\n                                     JOYCE\n                         Harvey, you'll survive a few weeks \n                         alone.\n\n                                     HARVEY\n                         Alright... Be careful. I love you, \n                         baby.\n\n               They kiss. Harvey grudgingly puts her bags in the car. He \n               watches as the cab pulls away.\n\n                                     REAL HARVEY (V.O.)\n                         It was later that night when I first \n                         found the lump.\n\n               INT. HARVEY'S BEDROOM - 1980'S - NIGHT\n\n               Wearing only his shorts, Harvey lies alone in the communal \n               futon, flipping through a book. He reaches into his underwear \n               to scratch his nuts.\n\n               Suddenly he stops. He feels something odd...\n\n               For a moment he just freezes. His eyes register panic.\n\n                                     REAL HARVEY (V.O.)\n                         I was determined to put it outta my \n                         mind until Joyce got back. Easier \n                         said than done.\n\n                                                                    CUT TO:\n\n               INT. V.A. HOSPITAL - 1980'S - DAY\n\n               An enraged HARVEY fights with his co-worker MIGUEL.\n\n                                     HARVEY\n                         What do I care! Just gimme the chart \n                         already!\n\n                                     MIGUEL\n                         What is your problem today?!\n\n                                     HARVEY\n                         Look, Miguel! I just don't wanna \n                         keep comin' back here for it, okay?!\n\n                                     MIGUEL\n                         Harvey, that patient's due t'be \n                         admitted a week from now! Why do you \n                         always have to be picking fights \n                         with everybody?\n\n                                     HARVEY\n                              (yelling)\n                         How many times do we gotta go through \n                         the same bullshit. Just gimme the \n                         fuckin' chart!\n\n               Offended, Miguel storms off.\n\n                                     MIGUEL\n                         We'll see what the doctor says about \n                         this.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - NIGHT\n\n               Alone and slumped over his table, HARVEY draws comic ideas \n               with stick figures. Nothing's coming to him. He looks like \n               he's in anguish.\n\n               Frustrated, Harvey crumbles the idea and throws it on the \n               floor. He knocks over a chair.\n\n               INT. HARVEY'S BEDROOM - 1980'S - DAY\n\n               He tosses and turns in bed. No way he's sleeping.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               HARVEY is yelling into the telephone. It is a bad connection.\n\n                                     HARVEY\n                              (loudly into phone)\n                         Whadya mean? Another two weeks? Ya \n                         gotta come home some time! Hello? \n                         DAMNIT!\n\n                                                                    CUT TO:\n\n               INT. BACK STAGE - NBC STUDIOS - 1980'S - DAY\n\n               Without Joyce, a surly Harvey waits in the wings for his \n               introduction. He sneaks a peek as Letterman finishes up the \n               \"stupid pet tricks\" segment. We hear dogs barking and audience \n               laughter.\n\n                                     LETTERMAN REGULAR (O.S.)\n                         And there you have it, folks! Another \n                         enlightening episode of Stupid Pet \n                         Tricks!\n\n                                     REAL HARVEY (V.O.)\n                         I was startin' ta lose it. Between \n                         the lump, the loneliness -- I felt \n                         like everything wuz closin' in on \n                         me. And with Joyce over there savin' \n                         the world, I never felt more like a \n                         sell-out hack in my life.\n\n                                     LETTERMAN REGULAR (O.S.)\n                         Y'know ladies and gentlemen, when \n                         Thoreau wrote that most men lead \n                         lives of quiet depression, he \n                         obviously had not met our first guest, \n                         who happens to lead a life of whining \n                         desperation...\n\n               Harvey clenches his fists.\n\n                                     HARVEY\n                              (threatening)\n                         Okay, asshole. You'll pay for that \n                         one...\n\n               Harvey takes off his shirt. He pulls another t-shirt out of \n               the bag and changes ...\n\n                                     LETTERMAN REGULAR (O.S.)\n                         Ladies and gentlemen, please welcome \n                         back, Harvey Pekar.\n\n               Harvey's new t-shirt reads \"ON STRIKE AGAINST NBC.\" He takes \n               off for the stage, fists clenched, a soldier marching off to \n               war.\n\n                                                               DISSOLVE TO:\n\n               INT. GREEN ROOM - NBC STUDIOS - 1980'S - DAY\n\n               We're positioned behind the monitor, so we can only hear the \n               show. THE STAGE MANAGER AND TWO PRODUCTION ASSISTANTS \n               straighten up in the room.\n\n                                     HARVEY (O.S.)\n                         Hey, Dave! You wanna know what my \n                         politics are? I'm a strident leftist, \n                         Dave.\n\n                                     LETTERMAN (O.S.)\n                         I could have guessed half of that.\n\n                                     HARVEY (O.S.)\n                         You coulda guessed all of it, man! \n                         So why don't we talk about your parent \n                         company, G.E., huh? Let's talk about \n                         anti-trust violations and nuclear \n                         reactors!\n\n                                     STAGE MANAGER\n                         Joe, put more sodas in the fridge, \n                         there. And let's clean up the \n                         counters. That Pekar guy's a pig.\n\n               As the P.A.'s walk back and forth in front of the monitor, \n               we hear the Letterman / Pekar banter grow louder.\n\n               Suddenly PRODUCTION ASSISTANT #2 stops and checks out the \n               monitor.\n\n                                     PRODUCTION ASSISTANT #2\n                         Whoa... you guys. Check this out.\n\n               INT. TOBY'S LIVING ROOM - 1980'S - DAY\n\n               TOBY and his GRANDMOTHER watch HARVEY raise hell on Letterman. \n               Again, we can't see the screen.\n\n                                     HARVEY (O.S.)\n                         You're a cop-out, Letterman. You're \n                         nothin' but a shill for G.E.\n\n               Toby's grandmother passes him a plate of cookies.\n\n                                     LETTERMAN (O.S.)\n                         First of all, Harvey, what you are \n                         saying is not true. Second of all, \n                         this is not the place to say it. If \n                         you want to talk about this, go \n                         somewhere else, because you're not \n                         talking about it here!!\n\n                                                                    CUT TO:\n\n               INT. MR. BOAT'S KITCHEN - 1980'S - DAY\n\n               Dressed in a bathrobe, Mr. Boats eats a lonely, late-night \n               snack (cake and milk) at his kitchen table. A 12\" TV on the \n               table has Harvey and Dave on.\n\n                                     HARVEY (O.S.)\n                         Don't worry, Dave. I won't come back \n                         unless you beg me.\n\n                                     LETTERMAN (O.S.)\n                         You're not coming back at all.\n\n                                     HARVEY (O.S.)\n                         What do I care --\n\n                                     LETTERMAN (O.S.)\n                         Because we've given you many, many \n                         chances to talk about things that \n                         would be of general interest to people --\n\n                                     HARVEY (O.S.)\n                         So what?!\n\n               Mr. Boats shakes his head.\n\n               INT. TOWN CAR - 1980'S - DAY\n\n               We see Harvey alone, slumped in the back seat of a Town Car, \n               heading back towards his hotel. City lights pass over his \n               troubled face. We still hear the show, as if it's now in his \n               head.\n\n                                     LETTERMAN (V.O.)\n                         -- And also to promote your little \n                         Mickey Mouse magazine. Your little \n                         weekly reader! But you've blown every \n                         chance you've got. You're a dork, \n                         Harvey!\n\n                                     HARVEY (V.O.)\n                         Dave, you're fulla shit! You're fulla \n                         shit!!\n\n                                                               DISSOLVE TO:\n\n               INT. HARVEY'S APARTMENT - BEDROOM - 1980'S - NIGHT\n\n               CLOSE ON AN AMERICAN SPLENDOR COMIC\n\n               The cover depicts a snarling LETTERMAN yelling, \"YOU FUCKED \n               UP A GREAT THING!\" at a smirking, self-satisfied HARVEY.\n\n               JOYCE lies in bed reading the comic, chuckling. HARVEY cuddles \n               up against her.\n\n                                     JOYCE\n                         I guess you did it this time.\n\n                                     HARVEY\n                         Who cares. He wasn't helpin' my sales \n                         anyway.\n                              (moving closer)\n                         Baby, don't go away anymore. I just \n                         can't take bein' alone.\n\n               Joyce puts the magazine down.\n\n                                     JOYCE\n                         If you met those kids over there and \n                         saw what they go through, you wouldn't \n                         ask that of me.\n\n                                     HARVEY\n                         But if you go again I'm really gonna \n                         lose it.\n\n                                     JOYCE\n                         It's not open for discussion, Harvey. \n                         I need this in my life right now.\n\n               She cuddles up close to him.\n\n                                     JOYCE\n                         But I do appreciate the fact that \n                         you missed me so much. C'mere...\n\n               She starts to kiss him. He kisses her back. Her hands wander \n               down. Suddenly she feels something strange.\n\n                                     JOYCE\n                         Harvey, what is that?\n\n               Harvey looks at her and gulps.\n\n                                                                    CUT TO:\n\n               INT. HOSPITAL ROOM - 1980'S - DAY\n\n               HARVEY and JOYCE sit in the office holding hands, like two \n               terrified high school kids. A DOCTOR stands before them.\n\n               They just got bad news...\n\n                                     JOYCE\n                         I don't understand, does \"tumor\" \n                         mean the same thing as \"cancer\"?\n\n               The doctor gently nods.\n\n               Joyce covers her mouth. Harvey holds onto his head. He looks \n               positively dizzy. The doctor starts to talk, yet the words \n               don't seem to match his mouth. He looks dubbed. Strange \n               phrases just weave together, echo and bounce off the wall, \n               making no sense at all.\n\n               ...we know the growth is malignant. What we don't know is \n               how far it may have spread. Once we have the results of the \n               biopsy, we can make more informed decisions about treatment... \n               blah, blah, blah...\n\n               The whole office seems to spin.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - LATER\n\n               Joyce and Harvey sit on the stoop of their apartment house, \n               in a daze. The words keep echoing around them. Harvey holds \n               his head.\n\n                                     DOCTOR #2\n                         ...cat scan... diagnosis... MRI... \n                         cancer... cancer... cancer...\n\n                                     HARVEY\n                         How can I have cancer? I don't feel \n                         sick at all.\n\n                                     JOYCE\n                         That's a positive thing.\n\n                                     HARVEY\n                         My cousin Norman died of lymphoma. \n                         He was twenty-nine. He was a brilliant \n                         oncologist.\n\n                                     JOYCE\n                         Stop it! You're not going to die, \n                         Harvey. You're not.\n\n               Harvey turns to Joyce.\n\n                                     HARVEY\n                         What's going to happen to you, baby? \n                         Who's gonna take care of you if I'm \n                         not around?\n\n               Joyce stands up, determined.\n\n                                     JOYCE\n                         Harvey, look at me and focus. We are \n                         going to get through this. I \n                         understand illness. I know how to \n                         handle these things.\n\n                                     HARVEY\n                         But that's you. I'm not strong enough. \n                         I don't know how ta be positive. I \n                         can't do it. I can't.\n\n                                     JOYCE\n                         Yes, you can. And I'll tell you how. \n                         You'll make a comic book out of the \n                         whole thing. You'll document every \n                         little detail. And that way you'll \n                         remove yourself from the experience \n                         until it's over.\n\n               Despite Joyce's passionate pitch, Harvey shakes his head. \n\n                                     HARVEY\n                         I can't do that. I'm just not strong \n                         enough... I just wanna die.\n\n               Joyce folds her arm.\n\n                                     JOYCE\n                         Fine. I'll do it without you.\n\n               INT. HARVEY'S BEDROOM - 1980'S - DAY\n\n               HARVEY and JOYCE lay there quietly, both exhausted. Joyce \n               turns over so her back faces Harvey. He puts his arm around \n               her.\n\n               ANGLE ON JOYCE'S FACE \n\n               A tear drips down her cheek.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - DAY\n\n               Joyce is straightening up the apartment. The place actually \n               looks halfway decent.\n\n               THE DOORBELL RINGS\n\n               Joyce opens the door. A guy in his 30's named FRED -- Hells \n               Angels tough guy meets sensitive artist -- stands at the \n               door. He's accompanied by a seven-year-old girl, DANIELLE.\n\n                                     FRED\n                         Hey, I'm Fred. You called me about \n                         the comic book?\n\n                                     JOYCE\n                         Right -- the artist. Come on in.\n\n                                     FRED\n                         This is my daughter, Danielle. I had \n                         to bring her along. I hope you don't \n                         mind.\n\n               Joyce leans down and addresses the girl, who holds a toy \n               horse.\n\n                                     JOYCE\n                         Hi, Danielle. What's that you're \n                         holding?\n\n                                     DANIELLE\n                         A pony.\n\n               It's immediately obvious that Joyce is great with kids.\n\n                                     JOYCE\n                         A pony? What's his name?\n\n                                     DANIELLE\n                         She's a girl. Clarissa.\n\n                                     JOYCE\n                         Oh, I see. Well, I'm Joyce. Nice to \n                         meet both you and Clarissa.\n\n               They all walk towards the table which is covered with papers.\n\n                                     FRED\n                         I'm really sorry to hear about Harvey. \n                         Is he here?\n\n                                     JOYCE\n                         He's going to work until next week, \n                         when he starts the chemo. That's why \n                         I wanna get this project started \n                         now. Once he's stuck here, I know \n                         he'll take over.\n\n                                                                    CUT TO:\n\n               EXT. HARVEY'S APARTMENT - 1980'S - LATER\n\n               Miserable and in a daze, HARVEY walks up to his front door.\n\n               He looks like a man whose days are numbered. When he reaches \n               the door, he searches his pockets for keys.\n\n               ANGLE ON POCKET\n\n               Harvey's hand comes up empty.\n\n                                     HARVEY\n                         Shit!\n\n               Harvey tries the doorknob, but it's locked.\n\n               He steps back on the lawn and looks around. Could he have \n               dropped them? He retraces a few steps.\n\n                                     HARVEY\n                         Damnit!\n\n               Harvey yells up at the window.\n\n                                     HARVEY\n                         Joyce, open the door! I lost my keys \n                         again! Joyce!!\n\n               ANGLE ON FRONT DOOR\n\n               HARVEY'S ELDERLY NEIGHBOR struggles with her shopping cart \n               through the door.\n\n               Harvey pushes past her to get in.\n\n               INT. HARVEY'S APARTMENT VESTIBULE\n\n               Harvey knocks again. Nothing. Now he punches the door.\n\n                                     HARVEY\n                         Joyce!! Open the fucking door!!\n\n               Suddenly the door opens. Loud music pours out. But it's not \n               Joyce, it's FRED, the artist.\n\n                                     FRED\n                         Hey, Harvey.\n\n                                     HARVEY\n                         Fred?\n\n               Harvey just stares at him. Fred opens the door to reveal:\n\n               JOYCE and DANIELLE dancing together with the stereo blasting.  \n               They're having a ball.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - DAY\n\n               At the kitchen table, HARVEY looks over FRED'S sketches.\n\n               JOYCE and DANIELLE are now building a house of cards on the \n               living room floor.\n\n                                     FRED\n                         Here are some ideas we batted around.\n\n                                     HARVEY\n                         Sheesh. Joyce doesn't know what she's \n                         doing. There's too many words in \n                         these frames. When are ya comin' \n                         back?\n\n                                     FRED\n                         Uh, she said something about next \n                         Tuesday, which is fine with me. Only \n                         thing is, I might have the kid again. \n                         My ex-wife's supposed to take her, \n                         but I don't have much faith in her \n                         showing up. She is in worse shape \n                         than me these days.\n\n               Harvey looks away at Joyce and Danielle playing. They're \n               oblivious to the world.\n\n                                     HARVEY\n                         Next week my treatment begins. Do me \n                         a favor. Bring the kid with you.\n\n                                                                    CUT TO:\n\n               CLOSE UP: A PENCIL SKETCHING\n\n               FRED'S PENCIL completes a sketch of Joyce pushing Harvey in \n               a wheelchair. The word \"cancer\" appears everywhere, floating \n               all around the image.\n\n               COMIC ART / REAL LIFE MONTAGE\n\n               The following montage chronicles Harvey's illness by cutting \n               between comic art depicting key events and shots of HARVEY, \n               JOYCE and FRED creating the book.\n\n               The montage is set to the simultaneously dulcet and discordant \n               tone of Miles Davis' \"Blue in Green\" (or something similar).\n\n                                                                    CUT TO:\n\n               INT. HOSPITAL HALLWAY - 1980'S - DAY\n\n               Close on Harvey's face as he's getting pushed down the hall \n               in a wheelchair.\n\n                                                                    CUT TO:\n\n               M.R.I. COMIC PANEL\n\n               A panel of Harvey entering the M.R.I. machine.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - DAY\n\n               We see Harvey, Joyce and Fred sitting around a table. Joyce \n               fights to keep Harvey focused on the project.\n\n               BACK TO MORE COMIC PANELS:\n\n               1) An enraged Harvey throws things around the house.\n\n               2) Joyce on the bed crying, a cat licking her back.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S SHOWER - 1980'S - DAY\n\n               A balding Harvey depressed in the shower. He holds a clump \n               of hair in his hand.\n\n                                                                    CUT TO:\n\n               COMIC PANEL OF THE ABOVE SCENE\n\n               Harvey in the shower. The balloon above his head reveals his \n               inner turmoil over losing his hair and his face swelling.\n\n               MORE COMIC PANELS FOLLOW\n\n               Harvey in agony. Various positions of him in bed, on all \n               fours, covered with a case of shingles. \"I feel like I'm on \n               fire\" appears over his head.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S KITCHEN - 1980'S - DAY\n\n               Joyce and Fred go over some more comic art. Joyce carries \n               the idea over to Harvey (wearing a baseball cap), who can't \n               get out of the couch. He looks it over and nods. Danielle \n               brings Harvey a glass of water.\n\n                                                                    CUT TO:\n\n               MORE COMIC PANELS:\n\n               Harvey crawling up the steps. \"I'm so weak I can't make it,\" \n               he thinks...\n\n               Harvey and Joyce in a hospital waiting room. He's slumped \n               over, she has her hand on him.\n\n               A delirious Harvey surrounded by nurses and Joyce. \"She's \n               torturing me, she won't let me die, I wanna die...\"\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S BATHROOM - 1980'S - DAY\n\n               A balding Harvey lies on his bathroom floor. His cat walks \n               all over him.\n\n                                     HARVEY\n                         I wanna die... just let me die...\n\n                                                                    CUT TO:\n\n               MORE COMIC PANELS:\n\n               Joyce attempts to wake Harvey up. She curses at him. She \n               slaps him. \"Why are you doing this to me!\"\n\n               A drawing of Joyce, doubled over, crying. \"I can't take this \n               anymore...\"\n\n               THE MONTAGE ENDS WITH A SCENE IN HARVEY'S BEDROOM\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S BEDROOM - 1980'S - NIGHT\n\n               A repeat of the opening scene... Like a ghost, a naked HARVEY \n               stands over his bed staring down at a sleeping JOYCE.\n\n               In the eerie light, he's almost translucent.\n\n                                     HARVEY\n                              (faintly)\n                         Joyce... Joyce?\n\n               Joyce springs up, alarmed.\n\n                                     JOYCE\n                         What's wrong, Harvey? What are you \n                         doing up?\n\n               Harvey just stands there for a moment saying nothing.\n\n                                     JOYCE\n                         What is it?\n\n                                     HARVEY\n                              (delirious, out of \n                              breath)\n                         Tell me the truth. Am I some guy who \n                         writes about himself in a comic book? \n                         Or am I just -- just a character in \n                         that book?\n\n                                     JOYCE\n                         Harvey...\n\n                                     HARVEY\n                         When I die, will 'dat character keep \n                         goin'? Or will he just fade away.\n\n               Joyce just stares at him, unsure how to answer. Finally Harvey \n               collapses.\n\n               Joyce leaps from the bed, nervous, hysterical. She gets down \n               on the floor and shakes him.\n\n                                     JOYCE\n                         Omigod, Harvey! Harvey, wake up!\n\n               CLOSE ON HARVEY'S FACE\n\n               His eyes remain closed, his expression far, far away. The \n               sound of Joyce's voice fades until it seems like a distant \n               echo.\n\n               Then PANELS from Harvey's comics begin to float over his \n               head, his life literally passing before his eyes in comic \n               book form.\n\n               Slowly, the comic images and the unconscious Harvey evaporate, \n               giving way to:\n\n               GREEN SCREEN\n\n               A SURREAL DREAM SEQUENCE\n\n               We are now in a large, empty room similar to a blank comic \n               book panel.\n\n               A healthy, fully dressed Harvey appears in the corner of the \n               frame. He is very far away, barely recognizable. We slowly \n               dolly towards him as he delivers a formal soliloquy to the \n               camera:\n\n                                     HARVEY\n                         My name is Harvey Pekar. It's an \n                         unusual name -- Harvey Pekar...\n\n               As Harvey speaks, one-dimensional comic book images from his \n               life pass over the screen once again. This time in front of \n               him, behind him, everywhere. We dolly in towards him.\n\n                                     HARVEY\n                         1960 was the year I got my first \n                         apartment and my first telephone \n                         book. Imagine my surprise when I \n                         looked up my name and saw that, in \n                         addition to me, another Harvey Pekar \n                         was listed!\n\n               Images of Harvey's childhood float by, followed by his young \n               adult years.\n\n                                     HARVEY\n                         I was listed as Harvey L. Pekar... \n                         My middle name is Lawrence... He was \n                         listed as Harvey Pekar -- no middle \n                         initial... Therefore, his was a purer \n                         listing.\n\n               We see Harvey age in the images: he's hanging on the street \n               corner with friends, collecting records, hanging with Crumb.\n\n                                     HARVEY\n                         Then, in the seventies, I noticed \n                         that a third Harvey Pekar was listed \n                         in the phone book! This filled me \n                         with curiosity.\n\n                                     HARVEY\n                         How could there be three people with \n                         such an unusual name in the world, \n                         let alone in one city?!\n\n               Now, numerous images of Harvey's many years at the V.A. \n               Hospital float by: Harvey filing, Harvey arguing with his \n               boss, Harvey and Toby, etc.\n\n                                     HARVEY\n                         Then one day, a person I worked with \n                         expressed her sympathy to me \n                         concerning what she thought was the \n                         death of my father. She pointed out \n                         an obituary notice in the newspaper \n                         for a man named Harvey Pekar. One of \n                         his sons was named Harvey. These \n                         were the other Harvey Pekars.\n\n               The comic images fade out. Harvey is once again alone in the \n               empty room.\n\n                                     HARVEY\n                         Six months later, Harvey Pekar Jr. \n                         died. Although I'd met neither man, \n                         I was filled with sadness. \"What \n                         were they like,\" I thought. It seemed \n                         that our lives had been linked in \n                         some indefinable way.\n\n               We slowly move in on his face. Extremely close. As close as \n               the camera can get.\n\n                                     HARVEY\n                         But the story does not end there. \n                         For two years later another Harvey \n                         Pekar appeared in the directory. \n                         What kind of people are these? Where \n                         do they come from, what do they do? \n                         What's in a name?\n\n               END DREAM SEQUENCE\n\n               INT. HARVEY'S BEDROOM - 1980'S - DAY\n\n               BACK TO BEDROOM:\n\n               We are close on HARVEY'S face as he lays passed out and \n               delirious on the floor. Over this WE HEAR...\n\n                                     HARVEY\n                         Who is Harvey Pekar?\n\n               His face slowly fades to black.\n\n               A MOMENT OF BLACK, AND THEN...\n\n               INT. TOWER BOOKS - 1980'S - DAY\n\n               FADE IN:\n\n               CLOSE UP: A GLOSSY, FULL-COLOR, NOVEL-SIZED COMIC COVER.\n\n               Scrawled across the top in yellow and red it read, \"Our Cancer \n               Year.\" The drawing depicts Harvey doubled over on the front \n               lawn, groceries in the snow, with Joyce attempting to help \n               him up. A hand flips the book open and signs the inside leaf.\n\n               JOYCE and a healthy-looking HARVEY sit at a table signing \n               copies of their opus. About fifteen or so people mill about \n               with copies.\n\n                                     REAL HARVEY (V.O.)\n                         Here's our man a year later. Somehow \n                         I made it through the treatments, \n                         an' the doctors are optimistic. I \n                         guess Joyce was right about doin' \n                         the big comic book. We published the \n                         thing as a graphic novel -- our first \n                         collaboration -- and ended up with \n                         rave reviews. We even won the American \n                         Book Award. Go figure...\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S LIVING ROOM - 1980'S - DAY\n\n               The place is still a mess but somehow it has a better vibe \n               than it had before. This might be due to the presence of \n               DANIELLE. She sits crossed legged on the floor making jewelry \n               out of beads. JOYCE guides her.\n\n               HARVEY shuffles into the room. He watches for a moment as \n               Joyce and Danielle play.\n\n               ANGLE ON JOYCE: There is an awkward expression almost \n               resembling a smile on her face. He interrupts them.\n\n                                     HARVEY\n                         Hey Joyce.\n\n               Joyce looks up. Harvey looks like he's trying to hide \n               something.\n\n                                     JOYCE\n                         What is it Harvey?\n\n                                     HARVEY\n                         That was the doctor.\n\n               Joyce stops what she's doing and gulps. She hangs on Harvey's \n               every word.\n\n                                     HARVEY\n                         He said I'm all clear.\n\n               Tears well in Harvey's eyes. Joyce breathes a sigh of relief \n               and Danielle jumps up and runs over to Harvey. She hugs him.\n\n                                                                    CUT TO:\n\n               INT. CLEVELAND ICE RINK - 1980 - DAY\n\n               HARVEY sits in the bleachers, watching JOYCE teach DANIELLE \n               to ice skate.\n\n               Harvey's got a box of pizza next to him. He picks up a slice \n               and chomps on it. The cheese drips out of his mouth onto his \n               shirt.\n\n                                     REAL HARVEY (V.O.)\n                         The weirdest thing that came outta \n                         my illness was Danielle. With her \n                         real mother runnin' around who knows \n                         where, an' seein' how well her and \n                         Joyce got on, Fred decided she'd \n                         have a better life with us. I was \n                         scared at first but then I thought, \n                         what the hell. She's a good kid. So \n                         we ended up takin' her an' raising \n                         her as our own.\n\n                                                                    CUT TO:\n\n               INT. HARVEY'S APARTMENT - 1980'S - DAY\n\n               HARVEY and DANIELLE lie on the futon together. Harvey's comics \n               are strewn around the room everywhere. Danielle flips through \n               one.\n\n                                     HARVEY\n                         Ya keep readin' 'em backward.\n\n                                     DANIELLE\n                         I like reading them backward.\n                              (holding up a comic)\n                         Is that you?\n\n                                     HARVEY\n                         I keep tellin' ya, all of 'ems me, \n                         man.\n\n                                     DANIELLE\n                         You look like a monster.\n\n                                     HARVEY\n                         Yeah, well wait'll ya see what you're \n                         gonna look like.\n\n                                     DANIELLE\n                         Me??\n\n                                     HARVEY\n                         Sure. Yer part of the story too, \n                         now.\n\n                                     DANIELLE\n                         What story?\n\n                                     HARVEY\n                         The story of my life.\n\n               Danielle makes a face.\n\n                                     HARVEY\n                         Yeah, I know I'm not as interesting \n                         as The Little Mermaid and all that \n                         magical crap...\n\n                                     DANIELLE\n                         Maybe I want to write my own comic.\n\n                                     HARVEY\n                         Oh yeah? What about?\n\n                                     DANIELLE\n                         I don't know yet. But not about you. \n                         You have enough already.\n\n                                                                    CUT TO:\n\n               EXT. SCHOOL BUS STOP - FALL - PRESENT - DAY\n\n               HARVEY walks towards the bus stop to send DANIELLE to school.\n\n               He holds her hand.\n\n                                     HARVEY\n                         Ya know, you should write about things \n                         in your own life. Like school and... \n                         ponies... I don't know, girl stuff...\n\n                                     DANIELLE\n                              (to Harvey)\n                         Do you have to hold my hand?\n\n                                     HARVEY\n                              (wounded)\n                         What, are you embarrassed a' me? I \n                         know, I'm embarrassing. I felt the \n                         same way about my father.\n\n               Danielle looks up at Harvey like he's crazy.\n\n                                     DANIELLE\n                         No Harvey. You're just squeezing it \n                         too hard.\n                              (shaking her head)\n                         Joyce is right. You are obsessive \n                         compulsive.\n\n               Danielle drops his hand and rushes onto the bus with other \n               kids.\n\n               Harvey waves and watches as it pulls away.\n\n               He turns and walks by himself down the busy Cleveland street --\n\n               -- a familiar image from the opening. He's still hunched \n               over. He's still Harvey.\n\n                                     REAL HARVEY (V.O.)\n                         Yeah, so I guess comics brought me a \n                         lot. But don't think this is some \n                         sunny, happy ending. Every day is \n                         still a major struggle. Joyce an' I \n                         fight like crazy, an' she barely \n                         works. The kid's got A.D.D. and is a \n                         real handful. My expenses have gone \n                         up so much that I'm writin' freelance \n                         'round the clock, just to make my \n                         bills. My life is total chaos.\n\n                                                               DISSOLVE TO:\n\n               EXT. BUS STOP - FALL - PRESENT - DAY\n\n               DOCUMENTARY FOOTAGE -- SHOT ON FILM\n\n               NOW THE REAL HARVEY walks down the same busy Cleveland street \n               towards his job.\n\n                                     REAL HARVEY (V.O.)\n                         With a little luck, I'll get a window \n                         of good health between retirin' an \n                         dyin'. The golden years, right? Who \n                         knows. Between my pension and the \n                         chunk of change I got for this movie, \n                         I should be able to swing somethin'. \n                         Sure I'll lose the war eventually, \n                         but the goal is to win a few \n                         skirmishes along the way. Right?\n\n                                                                    CUT TO:\n\n               INT. V.A. HOSPITAL - PRESENT - DAY\n\n               DOCUMENTARY FOOTAGE -- SHOT ON FILM\n\n               THE REAL HARVEY slumps at the desk now, flipping through a \n               comic book.\n\n               ANGLE ON DOOR\n\n               THE REAL TOBY comes into the file room, carrying a cake with \n               sparklers. He's followed by a group of Harvey's REAL COWORKERS \n               and JOYCE and REAL DANIELLE.\n\n               Harvey moves the comic off his desk so Toby can put the cake \n               down.\n\n               ANGLE ON CAKE\n\n               The festive cake reads \"HAPPY RETIREMENT HARVEY.\" REAL JOYCE \n               cuts the cake and passes slices to the group.\n\n               ANOTHER WORKER pops a bottle of champagne.\n\n               CLOSE on a glass of champagne getting filled. The glass sits \n               next to the comic Harvey was reading.\n\n               CLOSE UP ON COMIC BOOK COVER\n\n               HARVEY'S new edition of AMERICAN SPLENDOR is subtitled, \"OUR \n               MOVIE YEAR.\" It features an illustration of HARVEY, JOYCE \n               and DANIELLE surrounded by cameras, lights and crew.\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\nAmerican Splendor\nWriters :   Robert Pulcini  Shari Springer Berman\nGenres :   Comedy  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:18.505440"}