{"title": "American Psycho", "film_link": "/Movie Scripts/American Psycho Script.html", "script_link": "/scripts/American-Psycho.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>American Psycho Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"American Psycho Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.88 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Matthew Markwalder\" title=\"Scripts by Matthew Markwalder\">Matthew Markwalder</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/American-Psycho.html\">Read \"American Psycho\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>AMERICAN PSYCHO by Mary Harron and Guinevere Turner</title>\n\n\n<pre>\n\n\n<b>\t\t\n</b><b>AMERICAN PSYCHO</b>\n\nby\nMary Harron and Guinevere Turner\n\nBased on the novel by Bret Easton Ellis \n\nFourth Draft \nNovember 1998\n\n\n<b>INT. PASTELS RESTAURANT- NIGHT \n</b>\nAn insanely expensive restaurant on the Upper East Side. \nThe decor is a mixture of chi-chi and rustic, with swagged \nsilk curtains, handwritten menus and pale pink tablecloths \ndecorated with arrangements of moss, twigs and hideous \nexotic flowers. The clientele is young, wealthy and \nconfident, dressed in the height of late-eighties style: \npouffy Lacroix dresses, slinky Alaïa, Armani power suits.\n\nCLOSE-UP on a WAITER reading out the specials.\n\n<b>WAITER \n</b>With goat cheese profiteroles and I also have an arugula \nCaesar salad. For entrées tonight I have a swordfish \nmeatloaf with onion marmalade, a rare-roasted partridge \nbreast in raspberry coulis with a sorrel timbale...\n\nHuge white porcelain plates descend on very pale pink linen \ntable cloths. Each of the entrees is a rectangle about four \ninches square and look exactly alike.\n\nCLOSE-UP on various diners as we hear fragments of \nconversation. \"Is that Charlie Sheen over there?\" \"Excuse \nme? I ordered cactus pear sorbet.\"\n\n<b>WAITER \n</b>And grilled free-range rabbit with herbed French fries. Our \npasta tonight is a squid ravioli in a lemon grass broth...\n\nCLOSE-UP on porcelain plates containing elaborate \nperpendicular desserts descending on another table.\n\nPATRICK BATEMAN, TIMOTHY PRICE, CRAIG MCDERMOTT and DAVID \nVAN PATTEN are at a table set for four. They are all wearing \nexpensively cut suits and suspenders and have slicked-back \nhair. Van Patten wears horn-rimmed glasses. \n\nThe camera moves in on Bateman as his narration begins:\n\n<b>BATEMAN (V.O.)\n</b>We're sitting in Pastels, this nouvelle Northern California \nplace on the Upper East Side.\n\nThe Waiter sets down plates containing tiny, elaborately \ndecorated starters. As he does so we hear Bateman's \ndescription of each of the men at the table.\n\n<b>BATEMAN (V.O.) \n</b>You'll notice that my friends and I all look and behave in \na remarkably similar fashion, but there are subtle differences \nbetween us. McDermott is the biggest asshole. Van \nPatten is the yes man. Price is the most wired. I'm the \nbest looking. We all have light tans. Right now I'm in a \nbad mood because this is not a good table, and Van Patten \nkeeps asking dumb, obvious questions about how to dress . \n\n<b>VAN PATTEN \n</b>What are the rules for a sweater vest?\n\nMcDERMOTT \nWhat do you mean?\n\n<b>PRICE \n</b>Yes. Clarify.\n\nMcDERMOTT \nWell, is it strictly informal-\n\n<b>BATEMAN \n</b>Or can it be worn with a suit?\n\nMcDERMOTT \n(Smiling) \nExactly\n\n<b>BATEMAN \n</b>With discreet pinstripes you should wear a subdued blue or \ncharcoal gray vest. A plaid suit would cal I for a bolder \nvest.\n\nMcDERMOTT \nBut avoid matching the vest's pattern with your socks or\ntie. Wearing argyle socks with an argyle vest will look \ntoo studied.\n\n<b>VAN PATTEN \n</b>You think so?\n\n<b>PRICE \n</b>You'll look like you consciously worked for the look.\n\n<b>VAN PATTEN \n</b>Good point. Excuse me, gentlemen.\n\nVan Patten leaves the table. As he does so, a busboy \ndiscreetly removes their largely untouched plates.\n\n<b>BATEMAN \n</b>Van Patten looks puffy. Has he stopped working out?\n\n<b>PRICE \n</b>It looks that way, doesn't it?\n\nMcDERMOTT \n(Staring at retreating waiter) \nDid he just take our plates away?\n\n<b>PRICE \n</b>He took them away because the portions are so small he \nprobably thought we were finished. God, I hate this place. \nThis is a chicks' restaurant. Why aren't we at Dorsia?\n\nMcDERMOTT \nBecause Bateman won't give the maitre d' head.\n(He guffaws)\n\nBateman throws a swizzle stick at him.\n\nMcDermott scans the room, settling on a handsome young man\nwith slicked-back hair and horn-rimmed glasses.\n\nMcDERMOTT \nIs that Reed Robinson over there?\n<b>PRICE \n</b>Are you freebasing or what? That's not Robinson.\n\nMcDERMOTT \nWho is it then?\n\n<b>PRICE \n</b>That's Paul Owen.\n\n<b>BATEMAN \n</b>That's not Paul Owen. Paul Owen's on the other side of the\nroom. Over there.\n\nHe points to another handsome young man with slicked-back \nhair and horn-rimmed glasses.\n\nMcDERMOTT \nWho is he with?\n\n<b>PRICE \n</b>(Distracted by the waitress's \ncleavage as she bends over to \nuncork a bottle of wine \u0096 the \nwaitress glares at him) \nSome weasel from Kicker Peabody.\n\nVan Patten returns.\n\n<b>VAN PATTEN \n</b>They don't have a good bathroom to do coke in.\n\nMcDERMOTT \nAre you sure that's Paul Owen over there?\n\n<b>PRICE \n</b>Yes. McDufus, I am.\n\nMcDERMOTT \nHe's handling the Fisher account.\n\n<b>PRICE \n</b>Lucky bastard.\n\nMcDERMOTT \nLucky Jew bastard.\n\n<b>BATEMAN \n</b>Oh Jesus, McDermott, what does that have to do with \nanything?\n\nMcDERMOTT \nListen. I've seen the bastard sitting in his office on the\nphone with CEOs, spinning a fucking menorah. The \nbastard brought a Hanukkah bush into the office last December.\n\n<b>BATEMAN \n</b>You spin a dreidel, McDermott, not a menorah. \nYou spin a dreidel.\n\nMcDERMOTT \nOh my God. Bateman, do you want me to fry you up\nsome fucking potato pancakes? Some latkes?\n\n<b>BATEMAN \n</b>No. Just cool it with the anti-Semitic remarks.\n\nMcDERMOTT \nOh I forgot. Bateman's dating someone from the \n<b>ACLU.\n</b>\nPrice leans over and pats Bateman on the back.\n\n<b>PRICE \n</b>The voice of reason. The boy next door. And speaking \nof reasonable...\n\nHe shows McDermott the bill for the meal.\n\nMcDERMOTT \nOnly $470.\n\n<b>VAN PATTEN \n</b>(Without irony) \nNot bad.\n\nThe others murmur agreement. Four platinum Amex cards slap\ndown on the table.\n\n<b>INT. LIMOUSINE - NIGHT \n</b>Bateman is pouring vintage champagne into flutes. Price is \nlighting up a cigar.\n\nMcDERMOTT \nLast week I picked up this Vassar chick-\n\n<b>VAN PATTEN \n</b>Oh God, I was there. I don't need to hear this \nstory again.\n\nMcDERMOTT \nBut I never told you what happened afterwards. So \nokay, I pick up this Vassar chick at Tunnel-hot number, big \ntits, great legs, this chick was a little hardbody-and so I \nbuy her a couple of champagne kirs and she's in the city on \nspring break and she's practically blowing me in the \nChandelier Room and so I take her back to my place-\n\n<b>BATEMAN \n</b>Whoa, wait. May I ask where Pamela is during all \nthis?\n\nMcDERMOTT \nOh fuck you. I want a blowjob, Bate-man. I want a chick \nwho's gonna let me-\n\n<b>VAN PATTEN \n</b>(Putting his hands over his ears) \nI don't want to hear this. He's going to say something \ndisgusting.\n\nMcDERMOTT \nYou prude. Listen, we're not gonna invest in a co-op \ntogether or jet down to Saint Bart's. I just want some \nchick whose face I can sit on for thirty, forty minutes.\n\nPrice throws a cigar at McDermott, who catches it.\n\nMcDERMOTT \nAnyway, so we're back at my place and listen to \nthis. She's had enough champagne by now to get a fucking \nrhino tipsy, and get this-\n\n<b>VAN PATTEN \n</b>She let you fuck her without a condom?\n\nMcDERMOTT \nThis is a Vassar girl. She's not from Queens. She \nwould only-are you ready? \n(Dramatic pause) \nShe would only give me a handjob, and get this...she kept \nher glove on.\n\nThe men sit in shocked, horrified silence.\n\nALL IN UNISON Never date a Vassar girl.\n\n<b>EXT. TUNNEL NIGHTCLUB - NIGHT\n</b>\nThe limo pulls up to the sidewalk outside the Tunnel. \nMcDermott holds the door open for a passing HOMELESS MAN, \nwho looks confused.\n\nMcDERMOTT \nI suppose he doesn't want the car. Price, ask \nhim if he takes American Express.\n\n<b>PRICE \n</b>(Offering card) \nYou take Amex, dude?\n\nThe man stumbles away. The club DOORMAN, seeing the limousine, \nunhooks the \nvelvet rope and welcomes them inside.\n\n<b>INT. LADIES ROOM, TUNNEL - NIGHT \n</b>\nBrilliant white light, a bemused elderly female attendant in a \nblack-and-white maid's uniform trying to give out paper towels. \nMUSIC thuds through an open doorway. Trashed-looking girls \nstare into mirrors repairing their eye make-up or sit on the \ncounter chatting to friends. There are almost as many men as \nwomen in the room. Couples stand in line, twitching as they \nwait to do coke. As soon as one bathroom door opens, a couple \nlurches out rubbing their noses while another couple rushes \npast them and slams the door.\n\n<b>PRICE \n</b>There's this theory out now that if you can catch the \nAIDS virus through having sex with someone who is infected, \nthen you can also catch anything-Alzheimer's, muscular \ndystrophy, hemophilia, leukemia, diabetes, dyslexia, for \nChrist's sake-you can get dyslexia from pussy-\n\n<b>BATEMAN \n</b>I'm not sure, guy, but I don't think dyslexia is a \nvirus.\n\n<b>PRICE \n</b>Oh, who knows? They don't know that. Prove it.\n\nPrice and Bateman finally get a stall and rush in. Price is \nsweating.\n\n<b>PRICE \n</b>I'm shaking. You open it.\n\nBateman opens a tiny packet of coke.\n\n<b>PRICE\n</b>Jeez. That's not a helluva lot, is it?\n\n<b>BATEMAN \n</b>Maybe it's just the light.\n\n<b>PRICE \n</b>Is he fucking selling it by the milligram? (He dips \nthe corner of his Amex card in the packet and takes a snort) \nOh my God...\n\n<b>BATEMAN \n</b>What?\n\n<b>PRICE \n</b>It's a fucking milligram of Sweet'n Low!\n\nBateman dips his Amex in the envelope and snorts.\n\n<b>BATEMAN \n</b>It's definitely weak but I have a feeling if we do \nenough of it we'll be okay.\n\n<b>PRICE \n</b>I want to get high off this; Bateman, not sprinkle it \non my fucking All-Bran.\n\nThe GUY IN STALL next door yells at them in an effeminate \nvoice:\n\n<b>GUY IN STALL \n</b>Could you keep it down, I'm trying to do drugs!\n\nPrice pounds his fist against the stall.\n\n<b>PRICE \n</b>(screaming) \n<b>SHUT UP!\n</b>\n<b>BATEMAN \n</b>Calm down. Let's do it anyway\n\n<b>PRICE \n</b>I guess you're right...\n(Raising his voice) \n<b>THAT IS, IF THE FAGGOT IN THE NEXT STALL THINKS IT'S OKAY!\n</b>\n<b>GUY IN STALL \n</b>Fuck you!\n\n<b>PRICE \n</b>(Trying to climb up against the aluminum divider) \nNo, FUCK YOU!! \n(He collapses, panting against the stall door) \nSorry, dude. Steroids...Okay, let's do it.\n\n<b>BATEMAN \n</b>That's the spirit.\n\nThey both dig their platinum Amex cards into the envelope \nof white powder, shoveling it up their noses, then sticking \ntheir fingers in to catch the residue and rubbing it into \ntheir gums.\n\n<b>INT. NIGHTCLUB - NIGHT \n</b>\nBateman saunters toward the bar as \"Pump Up the Volume\" \nplays in the background.\n\nBATEMAN (to BARGIRL) Two Stoli on the rocks.\n\nHe hands her two drink tickets.\n\n<b>BARGIRL \n</b>It's after eleven. Those aren't good anymore. It's \na cash bar. That'll be twenty-five dollars.\n\nBateman pulls out an expensive-looking wallet and hands her \na $50.\n\nShe turns her back and searches the cash register for \nchange.\n\nBATEMAN You are a fucking ugly bitch I want to stab to \ndeath and then play around with your blood.\n\nThe music muffles his voice. She turns around. He is \nsmiling at her. She gives him his change impassively.\n\n<b>INT. BATEMAN'S APARTMENT- MORNING \n</b>\nTableaux of Bateman's apartment in the early morning light. \nA huge white living room with floor-to-ceiling windows \nlooking out over Manhattan, decorated in expensive, minimalist \nhigh style: bleached oak floors, a huge white sofa, a large \nBaselitz painting (hung upside down) and much expensive \nelectronic equipment. The room is impeccably neat, and oddly \nimpersonal - as if it had sprung straight from the pages of \na design magazine.\n\n<b>BATEMAN (V.0.) \n</b>My name is Patrick Bateman. I am \ntwenty-six years old. I live in the American Garden \nBuildings on West Eighty-First Street, on the eleventh \nfloor Tom Cruise lives in the penthouse.\n\nBateman walks into his bathroom, urinates while trying to \nsee his reflection in a poster for Les Miserables above his \ntoilet.\n\n<b>BATEMAN \n</b>(V.0.) I believe in taking care of myself, in a \nbalanced diet, in a rigorous exercise routine. In the \nmorning, if my face is a little puffy, I'll put on an ice \npack while doing my stomach crunches. I can do a thousand \nnow.\n\nBateman ties a plastic ice pack around his face.\n\nBateman does his morning stretching exercises in the living \nroom wearing the ice pack.\n\n<b>CUT TO:\n</b>\nA mirror-lined bathroom. Bateman is luxuriating in the \nshower steam, scrubbing his body, admiring his muscles.\n\n<b>BATEMAN (V.O.) \n</b>After I remove the icepack, I use a deep \npore-cleanser lotion. In the shower, I use a \nwater-activated gel cleanser, then a honey-almond body \nscrub, and on the face an exfoliating gel scrub.\n\nBateman stands in front of a massive marble sink applying a \ngel facial masque.\n\n<b>BATEMAN (V.O.) \n</b>Then I apply an herb mint facial masque which \nI leave on for ten minutes while I prepare the rest of my \nroutine.\n\nBateman opens the door of a mirrored cabinet, which is \nstocked with immaculate rows of skin care products. He \nbegins selecting bottles jars and brushes, laying them in \nreadiness on the marble counter.\n\n<b>BATEMAN (V.O.)\n</b>I always use an after-shave lotion with little \nor no alcohol because alcohol dries your face out and makes \nyou look older. Then moisturizer, then an anti-aging eye \nbalm, followed by a final moisturizing \"protective\" lotion...\n\nBateman stares into the mirror. The masque has dried, \ngiving his face a strange distorted look as if it has been \nwrapped in plastic. He begins slowly peeling the gel masque \noff his face.\n\n<b>BATEMAN (V.O.) \n</b>There is an idea of a Patrick Bateman, some \nkind of abstraction, hut there is no real me, only an \nentity, something illusory, and though I can hide my cold \ngaze and you can shake my hand and feel flesh gripping you \nand maybe you can even sense our lifestyles are probably \ncomparable: I simply am not there.\n\n<b>INT. BATEMAN BEDROOM - MORNING \n</b>\nAnother huge white room, equally minimal: a futon, rumpled \nwhite sheets, a bedside lamp with a halogen bulb, and a large \nexpensive painting (Eric Fischl or David Salle) chosen by \nBateman's interior decorator.\n\nDressed in silk boxer shorts, Bateman stands in front of a \nhuge walk-in closet, filled with rows of expensive shirts, \nshoes and designer suits, organized according to color and \ntone.\n\n<b>BATEMAN (V.O.) \n</b>It is hard for me to make sense on any given \nlevel. My self is fabricated, an aberration. My personality \nis sketchy and unformed, my heartlessness goes deep and is \npersistent.\n\nFully dressed in Armani, Bateman stands in front of a \nfull-length mirror in the middle of his vast bedroom, \nadjusting his cuff-links.\n\n<b>BATEMAN (V.0.) \n</b>My conscience, my pity, my hopes disappeared \na long time ago, if they ever did exist.\n\nHe gives a last look at the mirror and likes what he sees. \nHe gives his reflection a smile.\n\n<b>INT. OFFICES OF PIERCE &amp; PIERCE - DAY \n</b>\nAs Bateman walks down the corridor, he passes another MAN who \nlooks just like him.\n\n<b>MAN \n</b>Morning, Hamilton. Nice tan.\n\nBateman walks past the desk of JEAN, his secretary, pulling \nhis Walkman from around his neck. Jean is attractive, \nwholesome, earnest. She smiles shyly. She loves him.\n\n<b>JEAN \n</b>Late?\n\n<b>BATEMAN \n</b>Aerobics class. Sorry. Any messages?\n\n<b>JEAN \n</b>Ricky Hendricks has to cancel today. He didn't say what \nhe was canceling or why.\n\n<b>BATEMAN \n</b>I occasionally box with Ricky at the Harvard Club. \nAnyone else?\n\n<b>JEAN \n</b>And...Spencer wants to meet you for a drink at Fluties Pier 17.\n\n<b>BATEMAN \n</b>When?\n\n<b>JEAN \n</b>After six.\n\n<b>BATEMAN \n</b>Negative. Cancel it.\n\nJean follows him into his office.\n\n<b>JEAN \n</b>Oh? And what should I say?\n\n<b>BATEMAN\n</b>Just...say...no.\n\n<b>JEAN \n</b>Just say no?\n\nJean stands at his desk, waiting for instructions.\n\n<b>BATEMAN \n</b>Okay, Jean. I need reservations for three at Camols \nat twelve-thirty, and if not there, try Crayons. All \nright?\n\n<b>JEAN \n</b>(Playfully) \nYes, sir.\n\nShe turns to leave.\n\n<b>BATEMAN \n</b>Oh wait. And I need reservations for two at Arcadia at eight \ntonight.\n\nJean turns around.\n\n<b>JEAN \n</b>Oh, something. . romantic?\n\n<b>BATEMAN \n</b>No, silly. Forget it. I'll make them. Thanks.\n\n<b>JEAN \n</b>I'll do it.\n\n<b>BATEMAN \n</b>No. No. Be a doll and just get me a Perrier, okay?\n\n<b>JEAN \n</b>You look nice today.\n\nJean exits. Bateman straightens some magazines in his \noffice, lifts a painting off the wall and puts it back at a \nslightly different angle. He fiddles with some pencils in a \nbeer stein. He puts on some MUSIC and flips through a \nSports Illustrated. He buzzes Jean. She comes in a moment \nlater with the Perrier and a file.\n\n<b>JEAN \n</b>Yes?\n\n<b>BATEMAN \n</b>Is that the Ransom file? Thanks. Don't wear that \noutfit again.\n\n<b>JEAN \n</b>Ummm...what? I didn't hear you.\n\n<b>BATEMAN \n</b>I said \"Do not wear that outfit again.\" Wear a \ndress. A skirt or something.\n\nJean stands there, then looks down at herself.\n\n<b>JEAN \n</b>(Smiling bravely) \nYou don't like this, I take it?\n\n<b>BATEMAN \n</b>Come on, you're prettier than that.\n\n<b>JEAN \n</b>(Sarcastically) \nThanks, Patrick.\n\nThe phone RINGS and Jean turns to leave.\n\n<b>BATEMAN \n</b>I'm not here. And high heels. I like high heels.\n\nAs Jean leaves, Bateman clicks on the TV set in one corner \nof the room and starts watching Jeopardy!\n\n<b>INT. TAXI - EVENING \n</b>\nEVELYN WILLIAMS, Patrick Bateman's \nfiancée, is making notes with a gold Cross pen and sipping \na bottle of mineral water. Evelyn is blonde, classically \nbeautiful, expensively educated, and utterly pleased with \nherself. She usually addresses Patrick as if he were a \nsmall child.\n\n<b>EVELYN \n</b>I'd want a zydeco band, Patrick. That's what I'd \nwant, a zydeco band. Or mariachi. Or reggae. Something \nethnic to shock Daddy Oh, I can't decide...And lots \nof chocolate truffles. Godiva. And oysters on the halfshell.\n\nCLOSE-UP on Bateman, who is wearing a Walkman and staring \nout the window.\n\n<b>BATEMAN (V.O.) \n</b>I'm trying to listen to the new George \nMichael tape but Evelyn-my supposed fiancée-keeps buzzing \nin my ear.\n\nEvelyn continues to make notes.\n\n<b>EVELYN \n</b>Marzipan. Pink tents. Hundreds, thousands of roses. \nPhotographers. Annie Leibovitz. We'll get Annie Leibovitz. \nAnd we'll hire someone to videotape. Patrick, we should do it.\n\n<b>BATEMAN \n</b>(Removing his Walkman) \nDo...what.\n\n<b>EVELYN \n</b>Get married. Have a wedding.\n\n<b>BATEMAN \n</b>Evelyn?\n\n<b>EVELYN \n</b>Yes, darling?\n\n<b>BATEMAN \n</b>Is your Evian spiked?\n\n<b>EVELYN \n</b>We should do it.\n\n<b>BATEMAN \n</b>No-I can't take the time off work.\n\n<b>EVELYN \n</b>Your father practically owns the company. You can do \nanything you like, silly.\n\n<b>BATEMAN \n</b>I don't want to talk about it.\n\n<b>EVELYN \n</b>Well, you hate that job anyway. Why don't you just \nquit? You don't have to work.\n\n<b>BATEMAN \n</b>Because I...want...to...fit...in.\n\nThe taxi bumps to a halt.\n\n<b>INT. ESPACE RESTAURANT- NIGHT \n</b>\nA cavernous garage, harshly spot-lit, decorated in \nself-conscious brutalist chic. Iron girders, walls of waxed \nplaster featuring exposed rusted pipes, a huge Schnabel \nsmashed-plate painting on one wall. The tables and chairs are \nmade of extremely uncomfortable \nbolted steel.\n\n<b>BATEMAN (V.O.) \n</b>I'm on the verge of tears by the time we arrive at Espace \nsince I'm positive we won't have a decent table, but we do, \nand relief washes over me in an awesome wave.\n\nTm Price and two downtown types, STASH and VANDEN, are \nalready seated. Vanden is about twenty, pretty and sullen, \nwith green streaks in her black hair. Stash is pale, with \nragged black hair and bad skin.\n\nThey are all trying to read large stainless steel menus \nthat look like minimalist art.\n\n<b>PRICE \n</b>The menu's in braille.\n\nHe gets up to greet them, giving Evelyn a suspiciously long \nkiss.\n\n<b>PRICE \n</b>I have to talk to you.\n\nHe drags her away, half giggling and protesting.\n\n<b>EVELYN \n</b>(Over her shoulder) \nPat, this is my cousin Vanden \nand her boyfriend Stash. He's an artist.\n\n<b>BATEMAN \n</b>(After smiling at his own reflection in the mirror and \nchecking his hair) \nHi. Pat Bateman.\n\nVanden takes his hand reluctantly, says nothing.\n\n<b>BATEMAN \n</b>Let me guess-you live in the East Village?\n\nPause.\n\n<b>STASH \n</b>SoHo.\n\nCOURTNEY RAWLINSON and LUIS CARRUTHERS arrive at the table. \nCourtney is blonde, classically beautiful and from \nprecisely the same social background as Evelyn, but she is \nconsiderably more fragile and neurotic. Luis is \nhalf-English, half-Argentinean, slightly overweight (a \nrarity in this crowd), puppyish and eager to please. He \nwears the same type of designer clothes as Price and \nBateman, but with foppish tendencies: velvet jackets, \nbow-ties, boldly patterned vests.\n\nThey exchange air kisses. As soon as Luis turns his back, \nBateman sneaks a kiss on Courtney's neck.\n\n<b>COURTNEY \n</b>(Whispering) \nStop it!\n\nStash and Vanden watch them in silence.\n\n<b>LATER:\n</b>\nPrice is whispering in Evelyn's ear. Everyone else is \nquietly eating, except Bateman, who is drinking and watching \nEvelyn and Price.\n\n<b>BATEMAN (V.O.)\n</b>I am fairly sure that Timothy and Evelyn \nare having an affair. Timothy is the only interesting\nperson I know. Courtney is almost perfect looking. She s \nusually operating on one or more psychiatric drugs. Tonight \nI believe it's Xanax. More disturbing than her drug use, \nthough, is the fact that she's engaged to Luis Carruthers, \nthe biggest dufus in the business.\n\nCourtney rouses herself from her drug haze.\n\n<b>COURTNEY\n</b>Tell me. Stash...do you think SoHo is \nbecoming to...commercial?\n\n<b>CARRUTHERS \n</b>Yes, I read that.\n\n<b>PRICE \n</b>Oh, who gives a rat's ass?\n\n<b>VANDEN \n</b>Hey. That affects us.\n\n<b>PRICE \n</b>(Wired on coke) \nOh ho ho. That affects us? What \nabout the massacres in Sri Lanka, honey? Doesn't that \naffect us, too? I mean don't you know anything about Sri \nLanka? About how the Sikhs are killing like tons of \nIsraelis there? Doesn't that affect us?\n\n<b>BATEMAN \n</b>Oh come on. Price. There are a lot more important \nproblems than Sri Lanka to worry about. Sure our foreign \npolicy is important, but there are more pressing problems \nat hand.\n\n<b>PRICE \n</b>Like what?\n\n<b>BATEMAN \n</b>Well, we have to end apartheid for one. And slow \ndown the nuclear arms race, stop terrorism and world \nhunger. But we can't ignore our social needs. either We \nhave to stop people from abusing the welfare system. We \nhave to provide food and shelter for the homeless and \noppose racial discrimination and promote civil rights while \nalso promoting equal rights for women but change the \nabortion laws to protect the right to life yet still \nsomehow maintain women's freedom of choice.\n\nThe table stares at Bateman uncomfortably.\n\n<b>BATEMAN \n</b>We also have to control the influx of illegal \nimmigrants. We have to encourage a return to traditional \nmoral values and curb graphic sex and violence on TV, in \nmovies, in pop music, everywhere. Most importantly we have \nto promote general social concern and less materialism in \nyoung people.\n\nPrice chokes on his drink. Everyone is silent and \nmystified.\n\n<b>CARRUTHERS \n</b>Patrick, how thought-provoking.\n\n<b>INT. EVELYN'S BEDROOM - LATER THE SAME EVENING \n</b>\nBateman and Evelyn are lying on her bed watching television.\n\n<b>BATEMAN \n</b>Why don t you just go for Price?\n\n<b>EVELYN \n</b>Oh God, Patrick. Why Price? Price?\n\n<b>BATEMAN \n</b>He's rich.\n\n<b>EVELYN \n</b>Everybody's rich.\n\n<b>BATEMAN \n</b>He's good-looking.\n\n<b>EVELYN \n</b>Everybody's good-looking, Patrick.\n\n<b>BATEMAN \n</b>He has a great body\n\n<b>EVELYN \n</b>Everybody has a great body now.\n\nBateman unbuttons his shirt and makes advances to get \nEvelyn to have sex with him. She ignores him, watching the \nHome Shopping Channel with the remote in her hand. Finally, \nhe straddles her, penis close to her face. She tries to \nlook around him at the TV, then takes notice.\n\n<b>EVELYN \n</b>What do you want to do with that, floss with it?\n\nBateman flops back down beside her and stares at the television.\n\n<b>EVELYN \n</b>Are you using minoxidil?\n\n<b>BATEMAN \n</b>No. I'm not. Why should I ?\n\n<b>EVELYN \n</b>Your hairline looks like it's receding.\n\n<b>BATEMAN \n</b>It's not.\n\n<b>EXT. STREET - LATER THAT NIGHT \n</b>\nIt is 3 a.m. Bateman is standing at an ATM, listening to the \ncomforting sound of fresh bills thudding out of the machine. \nBateman turns around and watches a solitary young woman walk \npast him. He collects his money, placing it carefully in his \nwallet, and then walks toward her, whistling. He catches up \nto her as she pauses at a red light.\n\n<b>BATEMAN \n</b>Hello.\n\nThe woman looks suspicious for a moment and then, seeing \nhis smile, smiles back.\n\n<b>INT. DRY CLEANERS - DAY \n</b>\nBateman, dressed in an Armani suit \nwith an unlit cigar between his teeth is standing in a dry \ncleaners, arguing with the Chinese woman behind the \ncounter.\n\n<b>BATEMAN \n</b>Listen, wait. You're not...shhh wait...\nyou're not giving me valid reasons.\n\nThe woman continues to speak to him in another language, \ngrabbing at the sleeve of the jacket.\n\n<b>BATEMAN \n</b>What are you trying to say to me?\n\nHer husband has taken Bateman's horribly bloodstained \nsheets out of the bag and is staring at them.\n\n<b>BATEMAN \n</b>Bleach-ee? Are you trying to say bleach-ee? \nBleach-ee. Oh my God.\n\nShe keeps pointing to the jacket and talking.\n\n<b>BATEMAN \n</b>(Talking over her) \nTwo things. One. You can't bleach a Soprani. Out of the question. \nTwo.\n(Louder) \nTwo. I can only get these sheets in Santa Fe. These are very \nexpensive sheets and I really need them clean.\n\nShe keeps talking and Bateman leans into her.\n\n<b>BATEMAN \n</b>If you don't shut your fucking mouth I will kill \nyou, are you understanding me?\n\nShe talks faster.\n\n<b>BATEMAN \n</b>Now listen-I have a very important lunch meeting \n(Checks Rolex) \nat Hubert's in thirty minutes, and I need those \n...no wait, twenty minutes. I have a lunch meeting at \nHubert's in twenty minutes with Ronald Harrison and I need \nthose sheets cleaned by this afternoon.\n\nShe keeps talking.\n\nBATEMAN Listen. I cannot understand you.\n\nBateman starts laughing, slaps his hand down on the \ncounter.\n\n<b>BATEMAN \n</b>This is crazy. You're a fool. I can't cope with \nthis.\n\nBateman is on the verge of tears.\n\n<b>BATEMAN \n</b>Stupid bitchee! Understand? Oh Christ!\n\nSomeone enters the store behind him. It's VICTORIA, \nlate-twenties, attractive but a little overweight, wearing a \ntailored business suit with white sneakers and sports socks.\n\n<b>VICTORIA \n</b>Patrick?\n\nShe takes off her sunglasses.\n\n<b>VICTORIA \n</b>Hi, Patrick. I thought that was you.\n\n<b>BATEMAN \n</b>Hello \n(Mumbles un incomprehensible name)\n\nAwkward pause.\n\n<b>BATEMAN \n</b>Well.\n\n<b>VICTORIA \n</b>Isn't it ridiculous? Coming all the way up here, \nbut you\nknow. They really are the best.\n\n<b>BATEMAN \n</b>Then why can't they get these stains out? I mean can you talk \nto these people or something? I'm not getting anywhere.\n\nVictoria moves toward the sheet that the old man is holding \nup. She\ntouches it and the woman behind the counter begins talking \nagain.\n\n<b>VICTORIA \n</b>Oh my, I see. What are those? Oh my.\n<b>BATEMAN \n</b>Um, well...it s cranberry juice. Cranapple.\n\nVICTORiA \n(Skeptically) Really?\n\n<b>BATEMAN \n</b>Well, I mean, um, it s really...Bosco. You \nknow, like...\nlike a Dove Bar. It's a Dove Bar...Hershey's Syrup?\n\n<b>VICTORIA \n</b>(As if sharing a secret joke) Oh yeah. Oh I get it. \nFun with chocolate.\n\n<b>BATEMAN \n</b>Listen, if you could talk to them \n(He yanks the sheet out of the man's hand) \nI would really appreciate it. I'm really late. I have a \nlunch appointment at Hubert's in fifteen minutes.\n\nBateman turns to leave.\n\n<b>VICTORIA \n</b>Hubert's? Oh really? It moved uptown, right?\n\n<b>BATEMAN \n</b>Yeah, well, oh boy, listen, I've got to go. Thank \nyou, uh...\nVictoria?\n\n<b>VICTORIA \n</b>Maybe we could have lunch one day next week? You \nknow, I'm downtown near Wall Street quite often.\n\n<b>BATEMAN \n</b>Oh, I don't know, Victoria. I'm at work all the \ntime.\n\n<b>VICTORIA \n</b>Well, what about, oh, you know, maybe a Saturday?\n\n<b>BATEMAN \n</b>(Checking his watch) \nNext Saturday?\n\n<b>VICTORIA \n</b>(Shrugging) \nYeah.\n\n<b>BATEMAN \n</b>Oh, can't, I'm afraid. Matinée of Les Miserables. \nListen, I've really got to go. I'll-Oh...Christ...I'll call \nyou.\n\n<b>VICTORIA \n</b>Okay. Do.\n\nBateman glares at the woman behind the counter and rushes \nout the door. Victoria stares after him as we hear the sound \nof the bell on the closing door.\n\n<b>INT. BATEMAN'S APARTMENT - DAY\n</b>\nBateman is sitting on the sofa watching a video, talking to \nCourtney on a portable phone. He's holding a video box in one \nhand, perusing the title: Inside Lydia's Ass. Offscreen we hear \nthe sounds of the porn movie as he talks.\n\n<b>BATEMAN \n</b>Listen, what are you doing tonight?\n\n<b>COURTNEY \n</b>What? Oh, I'm...busy.\n\n<b>BATEMAN \n</b>Listen, you're dating Luis, he's in Arizona. You're fucking me, \nand we haven't made plans. What could you possibly be up to \ntonight?\n\n<b>COURTNEY \n</b>Stop it. I'm...\n\n<b>BATEMAN \n</b>On a lot of lithium?\n\n<b>COURTNEY \n</b>Waiting for Luis to call me. He said he'd call \ntonight. Oh don't be difficult, Patrick.\n\n<b>BATEMAN \n</b>You should come have dinner with me.\n<b>COURTNEY \n</b>But-when?\n\n<b>BATEMAN \n</b>Am I confused or were we talking about tonight?\n\n<b>COURTNEY \n</b>Ummm . . yeah. Luis is calling me tonight. I \nneed to be\nhome for that.\n\n<b>BATEMAN \n</b>Pumpkin?\n\n<b>COURTNEY \n</b>Yes?\n\n<b>BATEMAN \n</b>Pumpkin you're dating an asshole.\n\n<b>COURTNEY \n</b>Uh huh.\n\n<b>BATEMAN \n</b>Pumpkin you're dating the biggest dickweed in New \nYork.\n\n<b>COURTNEY \n</b>I know. Stop it.\n\n<b>BATEMAN \n</b>Pumpkin, you're dating a tumbling, tumbling \ndickweed.\n\n<b>COURTNEY \n</b>Patrick don't call me pumpkin anymore, okay? I have to go.\n\n<b>BATEMAN \n</b>Courtney? Dinner?\n\n<b>COURTNEY \n</b>I can't.\n\n<b>BATEMAN \n</b>I'm thinking Dorsia.\n\n<b>COURTNEY \n</b>Dorsia's nice.\n\n<b>BATEMAN \n</b>Nice?\n\n<b>COURTNEY \n</b>You like it there, don't you?\n\n<b>BATEMAN \n</b>The question is do you like it, Courtney? And will \nyou blow off a fucking phone call from your sad excuse for a \nboyfriend to eat there tonight.\n\n<b>COURTNEY \n</b>Okay. Yeah. What time?\n\n<b>BATEMAN \n</b>Eight? \n\n<b>COURTNEY \n</b>Pick me up? \n\n<b>BATEMAN \n</b>Sounds like I'll have to. Don't fall asleep, okay? Wear \nsomething fabulous. Dorsia, remember?\n\nBateman hangs up, opens up the Zagat's guide and dials the \nnumber for Dorsia with trembling fingers. It's busy and so \nhe puts it on speakerphone, constant redial. He waits with \nhis head in his hands, sweating with anxiety, until there \nis finally an answer.\n\n<b>MAITRE D'\n</b>Dorsia. Please hold.\n\nHe is on hold for a long time, getting very tense.\n\n<b>MAITRE D'\n</b>Dorsia.\n\n<b>BATEMAN \n</b>(Both of his eyes are closed) \nUmm...yes...I know it's a little late but is it possible to \nreserve a table for two at eight or eight-thirty perhaps?\n\nLong pause. The Maitre D' starts giggling quietly and then \nmore loudly until the laughter is almost hysterical and he \nhangs up the phone.\n\n<b>INT. TAXI- NIGHT\n</b>\nBateman and Courtney are in the back of a cab. Courtney is\nheavily medicated.\n\n<b>COURTNEY \n</b>A facial at Elizabeth Arden, which was really \nrelaxing, then to the Pottery Bam where I bought this \nsilver muffin dish. \n(She starts to pass out)\n\n<b>BATEMAN \n</b>Is that Donald Trump's car?\n\n<b>COURTNEY \n</b>(Thickly) \nOh God, Patrick. Shut up.\n\n<b>BATEMAN \n</b>You know, Courtney, you should take some more \nlithium. Or have a Diet Coke. Some caffeine might get you \nout of this slump.\n\n<b>COURTNEY \n</b>I just want to have a child. Just...two...\nperfect...children...\n(Her voice trails as she descends back into a drug haze)\n\nThe cab draws up outside a restaurant. The awning reads \n\"Barcadia.\"\n\n<b>INT. BARCADIA - NIGHT \n</b>\nAn insanely expensive nouvelle Italian restaurant all \npolished natural brick, spotless white tablecloths, \nminimalist flower arrangements, discreet lighting.\n\nA waiter has come to take their drink orders.\n\n<b>BATEMAN\n</b>J&amp;B. Straight.\n\n<b>COURTNEY \n</b>Champagne on the rocks. Oh-could I have that with \na twist? She starts to sink back in her chair and Bateman \nleans over and pulls her back up.\n\n<b>COURTNEY \n</b>Are we here?\n\n<b>BATEMAN \n</b>Yes.\n\n<b>COURTNEY \n</b>This is Dorsia?\n\n<b>BATEMAN \n</b>(Examining a menu that says \"Barcadia\" in large script) \nYes, dear.\n\nCourtney almost falls asleep while looking at her menu, and \nstarts to slide off of her chair. Bateman grabs her by both \nshoulders and props her up.\n\n<b>BATEMAN \n</b>Courtney, you're going to have the peanut butter \nsoup with smoked duck and mashed squash. New York magazine \ncalled it a 'playful but mysterious little dish.\" You'll \nlove it. And then...the red snapper with violets and \npine nuts. I think that'll follow nicely. \n\n<b>COURTNEY \n</b>Mmmm...thanks, Patrick. \n\nShe falls asleep at the table.\n\n<b>INT. COURTNEY'S BEDROOM - NIGHT\n</b>Bateman and Courtney are in Courtney's bed. Bateman is on \ntop of her, reaching for a condom in the ashtray. He tears \nit open with his teeth, puts it on.\n\n<b>COURTNEY \n</b>(Dazed on lithium) \nI want you to fuck me.\n\nBateman gets on top of her, starts to fuck her.\n\n<b>COURTNEY \n</b>Luis is a despicable twit.\n\n<b>BATEMAN \n</b>Yes, Luis is a despicable twit. I hate him.\n\nHe keeps fucking her.\n\n<b>COURTNEY \n</b>No, you idiot. I said \"Is it a receptacle tip?\" \nNot, is Luis a despicable twit. Is it a receptacle tip? \nGet off me.\n\n<b>BATEMAN \n</b>Is it a what?\n\n<b>COURTNEY \n</b>Pull out.\n\n<b>BATEMAN \n</b>I'm ignoring you.\n\n<b>COURTNEY \n</b>(screaming) \nPull out, goddamnit!\n\n<b>BATEMAN \n</b>(Slowing down but not stopping)\nWhat do you want, Courtney?\n\nShe pushes him away from her.\n\n<b>BATEMAN \n</b>It's a plain end. I think.\n\n<b>COURTNEY \n</b>Turn the light on.\n\nShe tries to sit up.\n\n<b>BATEMAN \n</b>Oh Jesus. I'm going home.\n\n<b>COURTNEY \n</b>Patrick. Turn on the Light.\nHe turns on the light. \n\n<b>BATEMAN \n</b>It's a plain end, see? So? \n\n<b>COURTNEY \n</b>Take it off. \n\n<b>BATEMAN \n</b>Why? \n\n<b>COURTNEY \n</b>Because you have to leave half an inch at the tip \u0096 \n(She covers herself with her comforter) \nto catch the force of the ejaculate! \n<b>BATEMAN \n</b>I'm getting out of here. Where's your lithium?\n\nCourtney throws a pillow over her head and starts crying. \n\n<b>COURTNEY \n</b>(Screaming) \nDo you think you're turning me on by having unsafe sex?\n\nBateman pulls the pillow off her and slaps her face.\n\n<b>BATEMAN \n</b>Oh Christ, this really isn't worth it. And see, \nCourtney, it's there for what? Huh? Tell us. \n(He slaps her again lightly) \nWhy is it pulled down half an inch? \nSo it can catch the force of the ejaculate!\n\n<b>COURTNEY \n</b>(Choking crying) \nWell, it's not a turn-on for me. \nI have a promotion coming to me. I don't want to get AIDS.\n\nBateman grabs her head and makes her look at the condom.\n\n<b>BATEMAN \n</b>See? Happy? You dumb bitch? Are you happy, you dumb bitch?\n\n<b>COURTNEY \n</b>Oh God, just get it over with.\n\nHe fucks her quickly until he has a mediocre orgasm and \nfalls down next to her. They lie side by side with their \nbodies not touching, eyes open, staring at the \nceiling.\n\n<b>INT. CONFERENCE ROOM, PIERCE &amp; PIERCE - DAY\n</b>\nBateman and Luis Carruthers are seated at a long table in \nthe conference room at Pierce &amp; Pierce, which looks out onto \na spectacular view of Manhattan.\n\n<b>CARRUTHERS \n</b>Patrick, thanks so much for looking after Courtney.\nDorsia, how impressive! How on earth did you get a \nreservation there?\n\n<b>BATEMAN \n</b>Lucky, I guess.\n\n<b>CARRUTHERS \n</b>That's a wonderful jacket. Let me guess, \nValentino Couture?\n\n<b>BATEMAN \n</b>Uh huh.\n\n<b>CARRUTHERS \n</b>(Reaching out to touch it) \nIt looks so soft.\n\n<b>BATEMAN \n</b>(Catching Luis hand) \nYour compliment was sufficient Luis.\n\nCarruthers is distracted by a question from the colleague \non his left.Paul Owen enters, carrying the Wall St. Journal \nunder his arm. He is handsome, supremely confident and \nself-satisfied; he sees himself as a leader among men.\n\n<b>OWEN \n</b>(To Bateman) \nHello, Halberstam. Nice tie. How the hell are you?\n\n<b>BATEMAN \n</b>I've been great. And you?\n\nTheir conversation fades down as we hear Bateman's \nthoughts.\n\n<b>BATEMAN (V.O.) \n</b>Owen has mistaken me for this dickhead Marcus Halberstam. \nIt seems logical because Marcus also works at P&amp;P and in \nfact does the same exact thing I do and he also has a \npenchant for Valentino suits and Oliver Peoples glasses. \nMarcus and I even go to the same barber, although I have \na slightly better haircut.\n\nDuring this voiceover the CAMERA WANDERS over to MARCUS \nHALBERSTAM, who is conferring with a colleague in the \nopposite corner of the room. He bears a \nsuperficial resemblance to Bateman.\n\n<b>OWEN \n</b>How's the Ransom account going, Marcus?\n\n<b>BATEMAN \n</b>(Nervous) \nIt's...it's...all right.\n\n<b>OWEN \n</b>Really? That's interesting. \n(He stares at Bateman, smiling)\nNot great?\n\n<b>BATEMAN \n</b>Oh well, you know.\n\n<b>OWEN \n</b>And how's Cecilia? She's a great girl.\n\n<b>BATEMAN \n</b>Oh yes. I'm very lucky.\n\nMcDermott and Price enter.\n\nMcDERMOTT \nHey. Owen! Congratulations on the Fisher account.\n\n<b>OWEN \n</b>Thank you, Baxter.\n\n<b>PRICE \n</b>Listen, Paul. Squash?\n\n<b>OWEN \n</b>Call me. \n(Hands him a business card)\n\n<b>PRICE \n</b>How about Friday?\n\n<b>OWEN \n</b>No can do. Got a res at eight-thirty at Dorsia. Great sea \nurchin ceviche. There is a stunned silence as he walks away \nand sits in a corner of the room, ostentatiously studying papers.\n\nCLOSE-UP on Bateman's face, cold with hatred.\n\n<b>PRICE\n</b>(Whispering) \nJesus. Dorsia? On a Friday night? How'd he swing that?\n\nMcDERMOTT (Whispering) \nI think he's lying.\n\nBateman takes out his wallet and pulls out a card. \n\n<b>PRICE \n</b>(Suddenly enthused) \nWhat's that, a gram? \n\n<b>BATEMAN \n</b>New card. What do you think?\n\nMcDermott lifts it up and examines the lettering carefully. \n\nMcDERMOTT \nWhoa. Very nice. Take a look.\n\nHe hands it to Van Patten.\n\n<b>BATEMAN \n</b>Picked them up from the printers yesterday\n\n<b>VAN PATTEN \n</b>Good coloring.\n\n<b>BATEMAN \n</b>That's bone. And the lettering is something called \nSilian Rail.\n\nMcDERMOTT \n(Envious) \nSilian Rail?\n\n<b>VAN PATTEN \n</b>It is very cool, Bateman. But that's nothing.\n\nHe pulls a card out of his wallet and slaps it on the \ntable. \n\n<b>VAN PATTEN \n</b>Look at this.\n\nThey all lean forward to inspect it. \n\n<b>PRICE \n</b>That's really nice.\n\nBateman clenches his fists beneath the table, trying to \ncontrol his anxiety.\n\n<b>VAN PATTEN \n</b>Eggshell with Romalian type. \n(Turning to Bateman)\nWhat do you think?\n\n<b>BATEMAN \n</b>(Barely able to breath, his voice a croak) \nNice.\n\n<b>PRICE \n</b>(Holding the card up to the light) \nJesus. This is really super. How'd a nitwit like you get so \ntasteful?\n\nBateman stares at his own card and then enviously at \nMcDermott's. \n\n<b>BATEMAN (V.O.)\n</b>I can't believe that Price prefers McDermott's card to mine.\n\n<b>PRICE \n</b>But wait. You ain't seen nothin' yet. \n\nHe holds up his own card. \n\n<b>PRICE \n</b>Raised lettering, pale nimbus white...\n\n<b>BATEMAN \n</b>(Choking with anxiety) \nImpressive. Very nice. Let's see Paul Owen's card.\n\nPrice pulls a card from an inside coat pocket and holds it \nup for their inspection: \"PAUL OWEN, PIERCE &amp; PIERCE, \nMERGERS AND ACQUISITIONS.\" Bateman swallows, speechless. \nThe sound in the room dies down and all we hear is a faint \nheartbeat as Bateman stares at the magnificent card.\n\n<b>BATEMAN (V.O.) \n</b>Look at that subtle off-white coloring. The tasteful thickness \nof it. Oh my God, it even has a watermark...\n\nHis hand shaking, Bateman lifts up the card and stares at it \nuntil it fills the screen.\n\nHe lets it fall. The SOUND RETURNS TO NORMAL.\n\nCARRUTHERS Is something wrong? Patrick...you're sweating.\n\n<b>EXT. STREET- EVENING \n</b>\nThe financial district. The streets are eerily deserted.\n\nBateman stands at an ATM, enjoying the reassuring sound of \n$500 in fresh bills thudding from the machine. As he turns \nto leave, he notices someone across the street.\n\nA HOMELESS MAN is lying in a doorway on top of an open \ngrate, surrounded by bags of garbage and a shopping cart. A \ncardboard sign is attached to the front of the cart: I AM \nHOMELESS AND HUNGRY PLEASE HELP ME. A small, thin dog lies \nnext to him.\n\nHe is black, dressed in a stained, torn, lime-green \npolyester pants suit with jeans worn over the pants.\n\n<b>BATEMAN \n</b>(Offering his hand) Hello. Pat Bateman.\n\nThe Homeless Man stares at Bateman, struggling to sit up.\n\n<b>BATEMAN \n</b>You want some money?. Some...food?\n\nThe Homeless Man nods and starts to cry. Bateman reaches \ninto his pocket and pulls out a $I 0 bill, then changes his \nmind and holds out a $5 instead.\n\n<b>BATEMAN \n</b>Is this what you need?\n\nThe Homeless Man nods, looks away, wipes his nose.\n\n<b>HOMELESS MAN \n</b>I'm so hungry.\n\n<b>BATEMAN \n</b>It's cold out, too, isn't it?\n\n<b>HOMELESS MAN \n</b>I'm so hungry.\n\n<b>BATEMAN \n</b>(Holding the bill just out of the man's reach) \nWhy don't you get a job? If you're so hungry, why don't you \nget a job?\n\n<b>HOMELESS MAN \n</b>(Shivering and sobbing) \nI lost my job...\n\n<b>BATEMAN \n</b>Why? Were you drinking? Is that why you lost it? \nInsider trading? Just joking. No, really-were you drinking on \nthe job?\n\nHOMELESS MAN I was fired. I was laid off.\n\n<b>BATEMAN \n</b>Gee, uh, that's too bad.\n\n<b>HOMELESS MAN \n</b>I'm so hungry.\n\nThe dog starts to whimper.\n\n<b>BATEMAN \n</b>Why don't you get another one? Why don't , you get another job?\n\n<b>HOMELESS MAN \n</b>I'm not...\n\n<b>BATEMAN \n</b>You're not what? Qualified for anything else?\n\n<b>HOMELESS MAN \n</b>I'm hungry\n\n<b>BATEMAN \n</b>I know that, I know that. Jeez, you're like a broken record. \nI'm trying to help you.\n\n<b>HOMELESS MAN \n</b>I'm hungry.\n\n<b>BATEMAN \n</b>Listen, do you think it's fair to take money from people who \ndo have jobs? From people who do work?\n\n<b>HOMELESS MAN \n</b>What am I gonna do?\n\n<b>BATEMAN \n</b>Listen, what's your name?\n\n<b>HOMELESS MAN\n</b>Al.\n\n<b>BATEMAN \n</b>Speak up. Come on.\n\n<b>HOMELESS MAN\n</b>Al.\n\n<b>BATEMAN \n</b>Get a goddamn job, Al. You've got a negative attitude. \nThat's what's stopping you. You've got to get your act together. \nI'll help you.\n\n<b>HOMELESS MAN \n</b>You re so kind, mister. You're kind. You're a kind\nman. I can tell.\n\n<b>BATEMAN \n</b>(Petting the dog) \nShhhh...it's okay.\n\n<b>HOMELESS MAN \n</b>(Grabbing Bateman's wrist) \nPlease...I don know what to do. I'm so cold.\n\n<b>BATEMAN \n</b>(Stroking his face, whispering) \nDo ,you know how bad you smell? The stench, my God.\n\n<b>HOMELESS MAN \n</b>I can't...I can't find a shelter\n\n<b>BATEMAN \n</b>You reek. You reek of...shit. Do you know that? \n(Shouting)\nGoddammit, Al-look at me and stop crying like some kind of \nfaggot. Al...I'm sorry.\n\nBateman carefully puts the money back in his wallet.\n\n<b>BATEMAN \n</b>It's just that...I don't know I don't have anything in common \nwith you.\n\nHe opens his briefcase and pulls out a long thin knife with \na serrated edge. He pushes up the sleeve of his jacket to \nprotect it.\n\n<b>BATEMAN \n</b>Do you know what a fucking loser ,you are?\n\nHOMELESS MAN'S POV as Bateman lunges at him with the knife.\n\nEXTREME WIDE SHOT of the street. Bateman's shadowed figure\nis hunched over the Homeless Man, stabbing him in the stomach.\nThe dog barks wildly and Bateman stomps on it until it is \nsilent.\n\nLOW ANGLE shot of Bateman as he throws a quarter on the ground.\n\n<b>BATEMAN\n</b>There's a quarter. Go buy some gum.\n\nBateman walks calmly into the empty caverns of Wall Street. \nCars drift past, their headlights momentarily illuminating the \nbody left twitching on the ground.\n\n<b>INT. BEAUTY SALON - DAY \n</b>\nCLOSE-UP on Bateman's face and torso. His eyes are closed as a \nwoman's hands rub cream into his face.\n\n<b>FACIALIST \n</b>What beautiful skin you have, Mr Bateman. So \nfine, so smooth...\n\nHis eyes open to look up at the facialist and then he \ncloses them again.\n\n<b>BATEMAN (V.O.) \n</b>I have all the characteristics of a human being- flesh, blood, \nskin, hair-but not a single clear, identifiable emotion except \nfor greed ,und disgust. Something horrible is happening inside \nme and I don't know why.\n\n<b>CUT TO:\n</b>\nBateman sitting in a chair, looking down at the \nMANICURIST who is giving him a pedicure. She is cutting his \nnails with tiny sharp scissors. He stares at them longingly.\n\n<b>BATEMAN (V.O.) \n</b>My nightly bloodlust has overflowed into my days. I feel lethal, \non the verge of frenzy.\n\n<b>CUT TO:\n</b>\nBateman lying irradiated by ultraviolet light on a tanning \nbed, wearing goggles.\n\n<b>BATEMAN (V.O.) \n</b>I think my mask of sanity is about to slip.\n\n<b>INT. TEXARKANA RESTAURANT - NIGHT \n</b>\nAn insanely expensive nouvelle Tex-Mex restaurant, with an \nironic Southwestern decor: Santa Fe colors, Navajo blankets, \nnaive cowboy art, rawhide banquettes.\n\nBateman bursts in the door, late, and approaches the MAITRE D'.\n\n<b>BATEMAN \n</b>Marcus Halberstam. For two at eight?\n\n<b>MAITRE D'\n</b>Your friend has already been seated. Follow me, Mr. Halberstam.\n\nPaul Owen is seated at a table underneath an enormous pair of \nram's horns. He is arguing with the WAITER.\n\n<b>OWEN \n</b>No, I want to know. I came here for the cilantro \ncrawfish gumbo, which is after all the only excuse one \ncould have for being in this restaurant, which is by the \nway, almost completely empty. Am I to believe that all ten \npeople in this restaurant have eaten your entire supply of \ncilantro crawfish gumbo?\n\n<b>WAITER \n</b>I'm very sorry sir. There was a fire in the kitchen \nearlier today, and-\n\n<b>BATEMAN \n</b>J&amp;B, straight. And a Dixie beer.\n\n<b>WAITER \n</b>Would you like to hear-\n\n<b>OWEN \n</b>Double Absolut martini.\n\n<b>WAITER \n</b>Yes, sir. Would you like to hear the specials?\n\n<b>BATEMAN \n</b>Not if you want to keep your spleen.\n\nThe Waiter leaves.\n\n<b>OWEN \n</b>This is a real beehive of, uh, activity, Halberstam. \n\nThis place is hot, very hot.\n\n<b>BATEMAN \n</b>Listen, the mud soup and the charcoal arugula are outrageous \nhere.\n\n<b>OWEN \n</b>Yeah, well, you're late.\n\n<b>BATEMAN \n</b>Hey, I'm a child of divorce. Give me a break \n(Studying the menu; he's in a surprisingly good mood) \nHmmm, I see they've omitted the pork loin with lime jello.\n\n<b>OWEN \n</b>We should've gone to Dorsia. I could've gotten us a table.\n\n<b>BATEMAN \n</b>Nobody goes there anymore.\n\nThere is a long disgruntled silence.\n\n<b>BATEMAN \n</b>Is that Ivana Trump over there? (Laughs) Jeez \nPatrick I mean Marcus, what are you thinking? Why would Ivana \nbe at Texarkana?\n\nAnother pause.\n\n<b>BATEMAN \n</b>So, wasn't Rothschild originally handling the \nFisher account? How did you get it?\n\n<b>OWEN \n</b>I could tell you that, Halberstam, but then I'd have \nto kill you.\n\nHe guffaws. Bateman laughs politely.\n\n<b>LATER: \n</b>Paul Owen is very drunk. BATEMAN cold sober.\n\n<b>BATEMAN \n</b>I like to dissect girls. Did you know I'm utterly insane?\n\nOwen continues laughing and motions to the waiter for another \ndrink.\n\n<b>OWEN \n</b>Great tan, Marcus. Really impressive. Where do you tan?\n\nBATEMAN Salon.\n\n<b>OWEN \n</b>I've got a tanning bed at home. You should look into it.\n\nBateman nods, agitated.\n\n<b>OWEN \n</b>And Cecelia, how is she? Where is she tonight?\n\n<b>BATEMAN \n</b>Cecelia is, well...you know (Cecelia. I think \nshe's having dinner with...Evelyn Williams.\n\n<b>OWEN \n</b>Evelyn. Great ass. Goes out with that loser Patrick \nBateman. What a dork.\n\n<b>BATEMAN \n</b>Another Martini, Paul?\n\nOwen nods drunkenly.\n\n<b>LATER:\n</b>\nThe end of the meal. Owen is squeezing a lime onto the \ntable, missing his beer, incredibly drunk. The check is laid \ndown.\n\n<b>BATEMAN \n</b>(Talking to Owen like a child) \nPaul, give me your Amex card. Good boy.\nBateman slaps the card down, looks at the check.\n\n<b>BATEMAN \n</b>Two-hundred-and-fifty. Very reasonable. Let's leave \na big tip, shall we? My place hr a nightcap?\n\n<b>OWEN \n</b>No, man. I'm gonna bail.\n\n<b>BATEMAN \n</b>Come on, you dumb son of a bitch. \n(Helping him into his jacket) \nI've got a preview of the Barneys catalogue and a \nbottle of Absolut waiting for us.\n\n<b>INT. BATEMAN'S APARTMENT - NIGHT\n</b>The living room floor has been meticulously covered with \nnewspaper.\n\nOwen is slumped drunkenly in a white Eames chair, a glass \nin his hand. Bateman is looking through his CDs.\n\n<b>BATEMAN \n</b>You like Huey Lewis and the News?\n\n<b>OWEN \n</b>They're okay.\n<b>BATEMAN \n</b>Their early work was a little too New Wave for my \ntaste. But then Sports came out in 1983, I think they really \ncame into their own, commercially and artistically.\n\nBateman walks to his bathroom, taking a large ax out of the\nshower. He takes two Valium.\n\n<b>BATEMAN \n</b>(Said partly from the bathroom) \nThe whole album has a clear, crisp sound and a new sheen of \nconsummate professionalism that gives the songs a big boost.\nBateman comes back out and leans the ax against the wall. \nHe walks to the foyer and puts on a raincoat, watching Owen \nfrom behind ail the time.\n\n<b>BATEMAN \n</b>He's been compared to ELvis Costello but I think \nHuey has a more bitter, cynical sense of humor.\n\nOwen is absent-mindedly leafing through the Barneys \ncatalogue.\n\n<b>OWEN \n</b>Hey, Halberstam?\n\n<b>BATEMAN \n</b>Yes, Owen?\n\n<b>OWEN \n</b>Why are there copies of the Style section all over \nthe place? Do you have a dog? A chow or something?\n\n<b>BATEMAN \n</b>No, Owen.\n\n<b>OWEN \n</b>(Confused) \nIs that a raincoat?\n\n<b>BATEMAN \n</b>Yes, it is.\n\nBateman moves to the CD player. He takes a CD out of its \ncase and slides it in the machine.\n\n<b>BATEMAN \n</b>In 1987 Huey released this, Fore!, their most \naccomplished album. I think I heir undisputed masterpiece is \n\"HiP To Be Square,\" a song so catchy that most people probably \ndon't listen to the lyrics. But they should because it's not \njust about the pleasures of conformity and the importance of \ntrends. It's al~ a personal statement about the band itself.\n\nBateman puts on \"Hip To Be Square.\"\n\nBATEMAN crosses the room and picks up the ax.\n\nWe follow BATEMAN from behind as he walks up to Owen, the \nax raised over his head.\n\n<b>BATEMAN \n</b>Hey, Paul?\n\nAs Owen turns around, FROM OWEN'S POV we see Bateman swing \nthe ax toward his face.\n\nBlood sprays onto the white raincoat.\n\nFROM BEHIND OWEN, we see BATEMAN as he yanks the ax out.\n\nOwen drops to the floor. His body falls out of the frame. \nWe stay on his legs twitching mechanically.\n\nBlood pulses onto the newspaper-covered floor.\n\n<b>BATEMAN \n</b>(Raising the ax and screaming) \nTry getting a reservation at Dorsia now, you fucking \nstupid bastard!\n\nLOW ANGLE ON BATEMAN as he beats Owen with the back of the \nax.\n\nOFFSCREEN, the sound of the ax hitting Owen.\n\n<b>BATEMAN \n</b>(Panting) \nFucking bastard...\n\nBateman takes his raincoat off, still panting. He folds the \ncoat carefully in half, bloody side in, and drapes it neatly \nover the back of a chair.\n\nHe sits back on the white sofa and surveys the scene. He \nchecks his Rolex and lights a cigar.\n\nOFFSCREEN, Paul Owen's last faint sighs are heard.\n\n<b>INT. LOBBY - NIGHT \n</b>\nBATEMAN drags a large, blood-soaked sleeping bag through the lobby, \npast the bored doorman, who looks up from the Post for a moment.\n\n<b>EXT. STREET - NIGHT\n</b>\nBATEMAN is trying to hail a cab. Owen's body is at his \nfeet. Luis Carruthers and a Japanese girl walk up to him.\n\n<b>CARRUTHERS \n</b>Patrick? Is that you?\n\n<b>BATEMAN \n</b>No, Luis. It's not me. You're mistaken.\n\n<b>CARRUTHERS \n</b>This is Gwendolyn Ichiban. This is my very good \nfriend Patrick Bateman. Where are you going? We're going to \nNell's. Gwendolyn's father's buying it. \n(Looking down at the body) \nWhere did you get your overnight bag?\n\n<b>BATEMAN \n</b>Commes des Garcon.\n\nA cab stops. BATEMAN opens the door and manages to get \nOwen's body into the backseat.\n\nBateman gets into the cab.\n\n<b>CARRUTHERS \n</b>Call me please, Patrick.\n\n<b>BATEMAN \n</b>Jesus lives, Luis.\n\n<b>INT. BATEMAN'S HELL'S KITCHEN APARTMENT - NIGHT \n</b>\nA bare room, lit by one light bulb. The walls are blank \nexcept for a Les Miserables poster. There is one ratty chair.\n\nBateman pours lime over Paul Owen's body, which is lying in \na bathtub. He plays Huey Lewis, smokes a cigar, watches the \nbody dissolve.\n\n<b>INT. PAUL OWEN'S APARTMENT - NIGHT \n</b>\nBateman is letting himself into the apartment. It is very \nsimilar to Bateman's, but even more minimalist. The walls \nare white-pigmented concrete with a large minimalist painting \non the wall. One wall is covered in a trendy, large-scale \nscientific drawing above a long, black leather couch.\n\n<b>BATEMAN \n</b>Where to send the bastard? Dallas? Pans?\n\nHe throws some clothes into a suitcase, randomly grabbing \ntoiletries and shoving them in.\n\n<b>BATEMAN \n</b>Singapore? London. I'll send the asshole to London.\n\nHe puts some music on to help muffle his voice, then leans \nover the answering machine.\n\nHe does a passable imitation of Owen's speech.\n\n<b>BATEMAN \n</b>Hi, this is Paul. I've been called away to London \nfor a few days. Meredith, I'll call you when I get back. \nHasta la vista, baby.\n\n<b>INT. BATEMAN'S OFFICE - MORNING \n</b>\nBateman is sitting at his desk, with the latest copy of \nSports Illustrated in front of him and his Walkman playing \nKenny G. We hear the MUSIC until Jean enters and he takes \nthe Walkman off.\n\n<b>BATEMAN \n</b>(Faintly irritable) \nWhat is it?\n\n<b>JEAN \n</b>Patrick?\n\n<b>BATEMAN \n</b>(Condescendingly) \nYe-es, Je-an?\n\n<b>JEAN \n</b>Patrick, a Mr. Donald KIMBALL is here to see you.\n\n<b>BATEMAN \n</b>Who?\n\n<b>JEAN \n</b>Detective Donald KIMBALL?\n\nSilence. Bateman stares out the window, then down at the \ndrawing of a headless woman he's been doodling on the back \ncover of Sports Illustrated.\n\n<b>BATEMAN \n</b>Tell him I'm at lunch.\n\n<b>JEAN \n</b>(whispering) \nPatrick, I think he knows you're here. \nIt's only ten-thirty. \n\nSilence. \n\n<b>BATEMAN \n</b>Send him in, I guess. As she exits, he picks up the cordless \nphone and pretends to talk to someone at the other end.\n\n<b>BATEMAN \n</b>Now, John, you've got to wear clothes in proportion \nto your physique. There are definite do's and don'ts, good \nbuddy, of wearing a bold-striped shirt. A hold-striped shirt \ncalls for solid-colored or discreetly patterned suits and ties...\n\nThe door to the office opens and he waves in DETECTIVE DONALD \nKIMBALL. KIMBALL is surprisingly young - about Bateman's age - \nand good-looking, dressed in a crumpled linen Armani suit of \nthe type Bateman and his friends might wear.\n\nKimball sits down and crosses his legs with a \nself-assurance that makes Bateman so nervous he forgets to \ncarry on with his fake conversation. Kimball looks up at \nhim curiously, noticing the silence.\n\n<b>BATEMAN \n</b>(Realizing that Kimball is staring at him) \nRight. And yes...always tip the stylist fifteen percent.\n\nBateman shrugs at the detective, rolling his eyes in \nexasperation. \n\nKIMBALL nods understandingly.\n\n<b>BATEMAN \n</b>Listen, John, I've got to go. T Boone Pickens just \nwalked in...\n(He laughs inanely) \nJust joking...\n(Pause) \nNo don't tip the owner of the salon. Okay, John, \nright, got it. \n(He hangs up the phone and pushes the antenna in) \nSorry about that.\n\n<b>KIMBALL \n</b>No, I'm sorry. I should've made an appointment. \n(Gesturing toward the phone) \nWas that anything important?\n\n<b>BATEMAN \n</b>Oh that? Just mulling over business problems. \nExamining opportunities...Exchanging rumors...\nSpreading gossip.\n\nThey laugh politely.\n\n<b>KIMBALL \n</b>(Holding out his hand) \nHi. I'm Donald KIMBALL\n\n<b>BATEMAN \n</b>(Shaking firmly) \nHi. Pat Bateman. Nice to meet you.\n\n<b>KIMBALL \n</b>I'm sorry to barge in on you like this. but I was supposed \nto talk to Luis Carruthers and he wasn't in and...well, \nyou're here, so...I know how busy you guys can get.\n\nKIMBALL stares at the three open copies of Sports \nIllustrated and the Sony Walkman lying on Bateman's desk. \nBateman sees the look and sweeps the magazines \ninto the top drawer along with the Walkman, which is \nstill running.\n\n<b>BATEMAN \n</b>(Forcing himself to sound friendly and relaxed) \nSo, what's the topic of discussion?\n\n<b>KIMBALL \n</b>I've been hired by Meredith Powell to investigate \nthe disappearance of Paul Owen.\n\n<b>BATEMAN \n</b>You're not with the FBI or anything, are you?\n\n<b>KIMBALL \n</b>Nothing like that. I'm just a private investigator.\n\n<b>BATEMAN \n</b>Ah, I see...Yes. Paul's disappearance...Yes.\n\n<b>KIMBALL \n</b>So it's nothing that official. I just have some \nbasic questions. About Paul Owen. About yourself-\n\n<b>BATEMAN \n</b>Coffee?\n\n<b>KIMBALL \n</b>No. I'm okay.\n\n<b>BATEMAN \n</b>Perrier? San Pellegrino?\n\n<b>KIMBALL \n</b>No, I'm okay.\n\nKIMBALL takes out a small black notepad and the same gold \nCross pen that Bateman and his friends all use. Bateman buzzes \nJean.\n\n<b>JEAN (O.S.) \n</b>Patrick?\n\n<b>BATEMAN \n</b>Can you bring Mr...\n\n<b>KIMBALL \n</b><b>KIMBALL.\n</b>\n<b>BATEMAN \n</b>Mr. Kimball a bottle of San Pelle-\n\n<b>KIMBALL \n</b>Oh no, I'm okay.\n\n<b>BATEMAN \n</b>It's no problem\n\nBateman watches intently as KIMBALL writes something down \nin his notebook, then crosses something out. Jean enters \nand places the bottle of San Pellegrino and a Steuben etched \nglass on the table, shooting a concerned glance at Bateman. \nHe glares at her. KIMBALL smiles and nods at Jean as she leaves.\n\n<b>BATEMAN \n</b>Well, what's the topic of discussion?\n\n<b>KIMBALL \n</b>The disappearance of Paul Owen.\n\n<b>BATEMAN \n</b>Oh right. Well, I haven't heard anything about the \ndisappearance or anything...\n(Trying to laugh) \nNot on \"Page Six\" at least.\n\n<b>KIMBALL \n</b>I think his family wants this kept quiet.\n\n<b>BATEMAN \n</b>Understandable. \n(Staring at the untouched bottle of San Pellegrino) \nLime?\n\n<b>KIMBALL \n</b>No, really. I'm okay.\n\n<b>BATEMAN \n</b>You sure? I can always get you a lime.\n\nA pause.\n\n<b>KIMBALL\n</b>Just some preliminary questions that I need for my own \nfiles, okay?\n\n<b>BATEMAN \n</b>Shoot.\n\n<b>KIMBALL \n</b>How old are you?\n\n<b>BATEMAN \n</b>Twenty-six. I'll be twenty-seven in October.\n\n<b>KIMBALL \n</b>(Scribbling in his notebook) \nWhere did you go to school?\n\n<b>BATEMAN \n</b>Harvard. The Harvard Business School.\n\n<b>KIMBALL \n</b>Your address?\n\n<b>BATEMAN \n</b>Fifty-five West Eighty-First Street. The American\nGardens Building.\n\n<b>KIMBALL \n</b>(Looking up, impressed) \nNice. Very nice.\n\n<b>BATEMAN \n</b>(Flattered) \nThanks.\n\nA pause as KIMBALL studies his notebook. Bateman closes his\neyes, as if in pain.\n\n<b>KIMBALL \n</b>Pardon me, but are you okay?\n\n<b>BATEMAN \n</b>Who do you ask?\n\n<b>KIMBALL\n</b>You seem...nervous.\n\nBateman reaches into his desk drawer and brings out a \nbottle of aspirin.\n\n<b>BATEMAN \n</b>Nuprin?\n\nKIMBALL Uh...no, thanks.\n\nKimball takes out a pack of Marlboro's and lays it on the \ndesk.\n\n<b>BATEMAN \n</b>Bad habit.\n\n<b>KIMBALL \n</b>I know. I'm sorry.\n\nA pause, as Bateman stares at the cigarettes.\n\n<b>KIMBALL \n</b>Would you rather I not smoke?\n\n<b>BATEMAN \n</b>No, I guess it's okay.\n\n<b>KIMBALL \n</b>You sure?\n\n<b>BATEMAN \n</b>No problem. \n(Buzzing Jean)\n\n<b>JEAN (O.S.) \n</b>Yes, Patrick?\n\n<b>BATEMAN \n</b>Bring us an ashtray for Mr. KIMBALL, please.\nShe whisks in with a crystal ashtray as they sit in silence.\n\n<b>KIMBALL \n</b>What can you tell me about Paul Owen?\n\n<b>BATEMAN \n</b>Well...\n\nHe coughs, shakes two Nuprin into his hand and swallows \nthem dry.\n\n<b>KIMBALL \n</b>How well did you know him?\n\n<b>BATEMAN \n</b>I'm...at a loss. He was part of that whole...Yale thing, \nyou know.\n\n<b>KIMBALL \n</b>Yale thing?\n\nA pause.\n\n<b>BATEMAN \n</b>Yeah...Yale thing.\n\n<b>KIMBALL \n</b>What do you mean...Yale thing?\n\nA pause.\n\n<b>BATEMAN \n</b>Well, I think for one that he was probably a closet \nhomosexual. Who did a lot of cocaine...that Yale thing.\n\nA silence during which the sound of the air conditioner \nbecomes deafening.\n\n<b>KIMBALL \n</b>So...there's nothing you can tell me about Paul \nOwen?\n\n<b>BATEMAN \n</b>He led what I suppose was an orderly life. He...\nate a balanced diet.\n\n<b>KIMBALL \n</b>What kind of man was he? Besides...\n(He hesitates tries to smile) \nthe information you've just given.\n\n<b>BATEMAN \n</b>I hope I'm not being cross-examined here.\n\n<b>KIMBALL \n</b>Do you feel that way?\n\n<b>BATEMAN \n</b>No. Not really.\n\n<b>KIMBALL \n</b>(As he writes without looking up) \nWhere did Paul hang out?\n\n<b>BATEMAN \n</b>Hang...out?\n\n<b>KIMBALL \n</b>Yeah. You know...hang out.\n\n<b>BATEMAN \n</b>Let me think. The Newport. Harry's. Fluties. Endochine.\nNell's. Comell Club. The New York Yacht Club. The regular \nplaces.\n\n<b>KIMBALL \n</b>He had a yacht?\n\n<b>BATEMAN \n</b>No, he just hung out there.\n\n<b>KIMBALL \n</b>And where did he go to school?\n\nA slight pause.\n\n<b>BATEMAN \n</b>Don't you know this?\n\n<b>KIMBALL \n</b>I just wanted to know if you know.\n<b>BATEMAN \n</b>Before Yale? If I remember correctly, Saint Paul's...\nListen, I just...I just want to help.\n\n<b>KIMBALL \n</b>I understand.\n\nHe makes another note.\n\n<b>KIMBALL \n</b>Anything else you can tell me about Owen?\n\n<b>BATEMAN \n</b>We were both seven in 1969.\n\n<b>KIMBALL \n</b>(Smiles) \nSo was I.\n\n<b>BATEMAN \n</b>Do you have any witnesses or fingerprints?\n\n<b>KIMBALL \n</b>Well, there's a message on his answering machine saying he \nwent to London.\n\n<b>BATEMAN \n</b>Well, maybe he did, huh?\n\n<b>KIMBALL \n</b>His girlfriend doesn't think so.\n\n<b>BATEMAN \n</b>But...has anyone seen him in London?\n\n<b>KIMBALL \n</b>Actually, yes.\n\n<b>BATEMAN \n</b>Hmmm.\n\n<b>KIMBALL \n</b>Well, I've had a hard time getting an actual verification. \nA Stephen Hughes says he saw him at a restaurant there, but \nI checked it out and what happened is, he mistook a Hubert \nAinsworth for Paul, so...\n\n<b>BATEMAN \n</b>Oh.\n\n<b>KIMBALL \n</b>Was he involved at all , do you think, in occultism or Satan\nworship?\n\n<b>BATEMAN \n</b>What?\n\n<b>KIMBALL \n</b>I know it sounds like a lame question, but in New Jersey I \nknow this sounds like a lame question, but last month-I don't \nknow if you've heard about this, but a young stockbroker was \nrecently arrested and charged with murdering a young Chicano \ngirl and performing voodoo rituals with various body parts-\n\n<b>BATEMAN \n</b>Yikes! No. Paul wasn't into that. He followed a balanced \ndiet and-\n\n<b>KIMBALL \n</b>Yeah, I know, and was into that whole Yale thing.\n\nA pause - the longest so far.\n\n<b>BATEMAN \n</b>Have you consulted a psychic?\n\n<b>KIMBALL \n</b>No.\n\n<b>BATEMAN \n</b>Had his apartment been burglarized?\n\n<b>KIMBALL \n</b>No, it actually hadn't. Toiletries were missing. A \nsuit was gone. So was some luggage. That's it.\n\n<b>BATEMAN \n</b>I mean no one's dealing with the homicide squad yet \nor anything, right?\n\n<b>KIMBALL \n</b>No, not yet. As I said, we're not sure. But...\nbasically no one has seen or heard anything.\n\n<b>BATEMAN \n</b>That's so typical, isn't it?\n\n<b>KIMBALL \n</b>It's just strange. \n(He stares out the window, lost in thought) \nOne day someone's walking around, going to work, alive, \nand then...\n\n<b>BATEMAN \n</b>Nothing.\n\n<b>KIMBALL \n</b>People just...disappear.\n\n<b>BATEMAN \n</b>The earth just opens up and swallows people. \n(He checks his Rolex)\n\n<b>KIMBALL \n</b>Eerie. Really eerie.\n\nSilence.\n\n<b>BATEMAN \n</b>(Standing up) \nYou'll have to excuse me. I have a lunch meeting \nwith Cliff Huxtable at Four Seasons in twenty minutes.\n\n<b>KIMBALL \n</b>Isn't the Four Seasons a little far uptown? I \nmean aren't you going to be late?\n\n<b>BATEMAN \n</b>Uh, no. There's one...down here.\n\n<b>KIMBALL \n</b>Oh really? I didn't know that.\n\nBateman leads him to the door.\n\n<b>BATEMAN \n</b>Yes. It's very good.\n\nKIMBALL turns to face him.\n\n<b>KIMBALL \n</b>Listen, if anything occurs to you, any information \nat all...\n\n<b>BATEMAN \n</b>Absolutely, I'm 100% with you.\n\n<b>KIMBALL \n</b>Great, and thanks for your, uh, time, Mr. Bateman.\n\nBateman closes the door firmly on KIMBALL. He closes his \neyes and leans against the door, sweating.\n\n<b>INT. BATEMAN'S APARTMENT - AFTERNOON \n</b>\nA perfectly lit kitchen still-life - a bottle of Evian, \na white porcelain plate on which sits a sliced kiwi, some perfect \ngreen grapes, a few berries.\n\nOFFSCREEN, the SOUND OF SCREAMS AND A CHAINSAW can be heard \nfrom the living room.\n\nThe living room: Bateman is maniacally doing abdominal \ncrunches as the television plays a video of Texas Chainsaw \nMassacre. There is a pile of horror videos on his coffee table, \nnext to a copy of GQ.\n\n<b>LATER:\n</b>\nBateman is sitting in his armchair, phone book in hand, \njerking off. He is squealing into the phone and breathing.\n\n<b>BATEMAN \n</b>You like that, slut?\n\nThe person on the other end clearly hangs up.\n\nCLOSE-UP on his fingers dialing the phone.\n\n<b>BATEMAN \n</b>You want to know what I'm wearing? Sixty-dollar \nboxer shorts by Ralph Lauren, a hundred-and-fifty-dollar white \ncotton T-shirt by \nCommes des Garcons. \n(He snorts like a pig) \nMy Rolex cost-\n\nAnother hang-up. He dials again.\n\n<b>BATEMAN \n</b>(Whipering) \nI'm a corporate raider. I orchestrate hostile takeovers. What do \nyou think of that? \n(Makes disgusting sucking noises and grunts) \nHuh, bitch?\n\n<b>GIRL (O.S.)\n</b>Dad, is that you?\n\nBateman hangs up, frustrated.\n\n<b>EXT. STREET/INT. LIMOUSINE - NIGHT \n</b>\nBateman cruises around in the limo. It pulls up alongside \nCHRISTIE, a pretty blonde hooker in shorts and leather jacket. \nBateman opens his window to speak to her.\n\n<b>BATEMAN \n</b>I haven't seen you around here.\n\n<b>CHRISTIE \n</b>You just haven't been looking.\n\n<b>BATEMAN \n</b>Would you like to see my apartment?\n\nBateman flips on the light inside the limo. He's wearing a \ntuxedo.\n\n<b>CHRISTIE \n</b>(looking away to some dark corner) \nI'm not supposed to.\n\nBateman is holding out a $100 bill, which Christie now \nnotices, then takes.\n\n<b>BATEMAN \n</b>Do you want to come to my apartment or not?\n\n<b>CHRISTIE \n</b>I'm not supposed to. \n(She pockets the bill) \nBut I can make an exception.\n\n<b>BATEMAN \n</b>Do you take American Express?\n\nChristie is still looking out behind her.\n\n<b>BATEMAN \n</b>Do you take American Express?\n\nChristie looks at him like he's crazy.\n\n<b>BATEMAN \n</b>I'm joking. Come on, get in.\n\nAs they drive uptown, Bateman dials the cell-phone. He \nreads off a credit card number.\n\n<b>BATEMAN \n</b>I'd like a girl, early twenties, blonde, who does \ncouples. Couples. Fifty-five West Eighty-First, the \nAmerican Gardens Building. Apartment 7C. And I really \ncan't stress blonde enough. Blonde.\n\nHe hangs up.\n\nBATEMAN I'm Paul. My name is Paul 0wen, have you'got that? \nYou are Christie. You are to respond only to Christie. Is \nthat clear?\n\n<b>INT. BATEMAN'S APARTMENT - NIGHT \n</b>\nChristie is in the bathtub, Bateman is pouring in white \nmilky bath oil.\n\n<b>BATEMAN \n</b>That's a very fine Chardonnay you're drinking.\n\nLong pause, in which Christie is luxuriating in the tub and \nBateman is casually touching her breast.\n\n<b>BATEMAN \n</b>I want you to clean your vagina.\n\nChristie reaches for a washcloth.\n\n<b>BATEMAN \n</b>No. From behind. Get on your knees.\n\nChristie shrugs.\n\n<b>BATEMAN \n</b>I want to watch. You have a very nice body.\n\nThe doorman RINGS. Bateman answers.\n\n<b>BATEMAN \n</b>Thank you. Send her up. Christie, get out and dry \noff, choose a robe-not the Bijan and come and meet me and \nour guest in the living room for drinks.\n\nBateman answers the door.\n\n<b>BATEMAN \n</b>You've arrived! How lovely, let me take your coat. \nI'm Paul. How good of you to come.\n\nThe escort girl looks somewhat bewildered. Bateman takes \nher coat and inspects her body and face.\n\n<b>BATEMAN \n</b>Not quite blonde, are you? More dirty blonde. I'm \ngoing to call you Sabrina. I'm Paul Owen.\n\nBateman escorts her into the living room and brings her a \nglass of wine. Christie enters, sitting next to Sabrina on the \ncouch, and Bateman sits across from them. There is a \nlong silence.\n\n<b>BATEMAN \n</b>So, don't you want to know what I do?\n\nThe two girls look at each other with uncomfortable smiles. \nChristie shrugs.\n\n<b>CHRISTIE \n</b>No.\n\n<b>SABRINA \n</b>(Smiling) \nNo, not really.\n\nBateman is visibly irritated, recrosses his legs.\n\n<b>BATEMAN \n</b>Well, I work on Wall Street. At Pierce &amp; Pierce. \n(Long pause) \nHave you heard of it?\n\nAnother long pause. They shake their heads. Christie stands \nup and goes over to the CD collection.\n\n<b>CHRISTIE \n</b>You have a really nice place here...Paul. \nHow much did you pay for it?\n\n<b>BATEMAN \n</b>Actually, that's none of your business, Christie, \nhut I can assure you it certainly wasn't cheap.\n\nBateman leaves to refill his wine glass and Sabrina takes a \npack of cigarettes out of her purse.\nBateman returns, carrying a tray of chocolates.\n\n<b>BATEMAN \n</b>No, no smoking. Not in here.\n\nHe walks over to Christie.\n\n<b>BATEMAN \n</b>Varda truffle?\n\nChristie stares at the plate and shakes her head. Sabrina \ntakes one.\n\n<b>BATEMAN \n</b>I don't want you to get drunk, but that's a very \nfine Chardonnay you're not drinking.\n\nBateman goes over to his CDs and scans his vast collection. \nHe takes one out and examines it.\n\n<b>BATEMAN \n</b>Do you like Phil Collins? I've been a big Genesis \nfan ever since the release of their 1980 album, Duke. Before \nthat I really didn't understand any of their work. It was too \nartsy, too intellectual. It was on Duke where Phil Collins' \npresence became more apparent. He puts aside the CD and takes out \nanother one.\n\n<b>BATEMAN \n</b>I think \"Invisible Touch\" is the group's undisputed\nmasterpiece.\n\nHe puts on the song and gestures for them to follow him \ninto the bedroom.\n\n<b>BATEMAN \n</b>It's an epic meditation on intangibility, at the \nsame time it deepens and enriches the meaning of the preceding \nthree albums. Christie, take off the robe.\n\nBateman puts out a lace teddy. He motions to Christie to \nput it on.\n\n<b>BATEMAN \n</b>Listen to the brilliant ensemble playing of Banks, \nCollins and Rutherford. You can practically hear every nuance \nof every instrument. Sabrina, remove your dress.\n\nBateman starts to undress.\n\n<b>BATEMAN \n</b>In terms of lyrical craftsmanship and sheer \nsongwriting, this album hits a new peak of professionalism. \nSabrina, why don't you dance a little?\n\nSabrina dances awkwardly. Christie sits on the bed.\n\n<b>BATEMAN \n</b>Take the lyrics to \"Land of Confusion.\" In this \nsong, Phil Collins addresses the problem of abusive political \nauthority.\n\nBateman knots a silk scarf around Christie's neck - rather \nmenacingly - then helps her into some suede gloves. \n\n<b>BATEMAN \n</b>\"In Too Deep\" is the most moving pop song of the 1980s about \nmonogamy and commitment. The song is extremely uplifting. \nTheir lyrics are as positive and affirmative as anything \nI've heard in rock.\n\nHe turns on the video camera. \n\n<b>BATEMAN \n</b>Christie, get down on your knees, so Sabrina can see your \nasshole.\n\nBateman looks through the viewfinder.\n\n<b>BATEMAN \n</b>Phill Collins solo efforts seem to be more commercial and \ntherefore more satisfying in a narrower way, especially \nsongs like \"In the Air Tonight\" and \"Against \nAll Odds.\" Sabrina, don't just stare at it. Eat it. \n\nHe walks over to the sound system in his bedroom and slides in \nthe CD.\n\n<b>BATEMAN \n</b>But I also think that Phill Collins works better \nwithin the confines of the group than as a solo artist-and \nI stress the word artist. This is \"Sussudio,\" a great, \ngreat song, a personal favorite.\n\nSEX MONTAGE CUT TO \"Sussudio.\" We see this in WIDE SHOT, or \nthrough the LENS OF THE VIDEO CAMERA.\n\n<b>CUT TO: \n</b>\nBateman asleep in his bed with Christie and Sabrina \non either side of him. Sabrina accidentally touches his \nwrist. Bateman's eyes open.\n\n<b>BATEMAN \n</b>Don't touch the Rolex.\n\nBateman gets up from his bed and goes over to his armoire.\n\nHe opens the drawer in which are a nail gun, a coat hanger, \na rusty butter knife and a half-smoked cigar. He turns \naround to see Christie and Sabrina both starting to get up \nand get dressed. He takes the coat hanger.\n\n<b>BATEMAN \n</b>We're not through yet...\n\n<b>CUT TO:\n</b>\nBateman ushering them out the door impatiently. They \nare both sobbing, badly bruised and bleeding. Bateman has a \ndeep scratch on his hand and one on his shoulder. In the \nb.g. Phil Collins' \"In the Air Tonight\" is playing.\n\n<b>INT. YALE CLUB \u0096 DAY\n</b><b> \n</b>McDermott, Van Patten and Bateman are \nhaving drinks. Price walks by with a gorgeous girl and \ngives them the finger.\n\n<b>BATEMAN \n</b>What an asshole.\n\nMcDERMOTT \nWhy is Laurie Kennedy dating Price? He's a \nfucking drug addict. No self-control.\n\n<b>VAN PATTEN \n</b>But Laurie Kennedy is a total hardbody. What do \nyou think, Bateman?\n\n<b>BATEMAN \n</b>I know her. I knew her.\n\nMcDERMOTT \nWhy do you say it like that? Why does he say it \nlike that?\n\n<b>VAN PATTEN \n</b>Because he dated her.\n\n<b>BATEMAN \n</b>How did you guess?\n\n<b>VAN PATTEN \n</b>Girls dig Bateman. He's CQ. You're total CQ, \nBateman.\n\n<b>BATEMAN \n</b>Thanks, guy, but...she's got a lousy \npersonality.\n\nMcDERMOTT \nSo what? It's all looks. Laurie Kennedy is a \nbabe. Don't even pretend you were interested for any other \nreason.\n\n<b>VAN PATTEN \n</b>If they have a good personality, then something \nis very wrong.\n\nMcDERMOTT \nIf they have a good personality and they are not \ngreat looking-who fucking cares?\n\n<b>BATEMAN \n</b>Well, let's just say hypothetically, okay? What if \nthey have a good personality? \n(He smiles giving up) \nI know, I know-\n\n<b>ALL IN UNISON\n</b>There are no girls with good personalities! \n(They laugh and high-five each other)\n\n<b>VAN PATTEN \n</b>A good personality consists of a chick with a \nlittle hardbody who will satisfy all sexual demands without \nbeing too slutty about things and who will essentially keep \nher dumb fucking mouth \nshut.\n\nMcDERMOTT \nListen, the only girls with good personalities who are\nsmart or maybe funny or halfway intelligent or even \ntalented-though God knows what the fuck that means-are ugly \nchicks.\n\n<b>VAN PATTEN \n</b>Absolutely.\n\nMcDERMOTT \nAnd this is because they have to make up for how \nfucking unattractive they are.\n\nPause.\n\n<b>BATEMAN \n</b>Do you know what Ed Gein said about women?\n\n<b>VAN PATTEN \n</b>Ed Gein? Maitre d' at Canal Bar?\n\n<b>BATEMAN \n</b>No, serial killer, Wisconsin in the fifties. He was \nan interesting guy.\n\nMcDERMOTT \nSo what did Ed say?\n\n<b>BATEMAN \n</b>He said, \"When I see a pretty girl walking down the \nstreet I think two things. One part of me wants to take her \nout and talk to her and be real nice and sweet and treat \nher right.\"\n\nPauses, finishes his drink.\n\nMcDERMOTT \nWhat does the other part of him think?\n\n<b>BATEMAN \n</b>What her head would look like on a stick.\n\nMcDermott and Van Patten look at each other and then back \nat Bateman. Bateman starts to laugh, and the other two uneasily\njoin In.\n\nLuis Carruthers walks up to the table.\n\n<b>CARRUTHERS \n</b>(Shyly) \nHi, guys. I wanna get your opinion on something.\n\nMcDermott rolls his eyes at the rest of the table.\n\nMcDERMOTT If it's about the bow-tie you're wearing, you \nknow how we feel about it. Luis laughs good-naturedly.\n\n<b>CARRUTHERS \n</b>Yes, I do. No, it's my business card-I decided to \nget a new one too.\n\nHe pulls out something incredibly tasteful. Everyone \ncompliments Luis except Bateman. The SOUND DROPS and all we hear \nis the beating of his heart as he stares at the card enviously. \nLuis plucks it from his hand and walks away, pleased with \nhimself.\n\n<b>VAN PATTEN \n</b>Listen, what about dinner?\n\n<b>BATEMAN \n</b>(Suddenly angry) \nIs that all you ever have to contribute, Van Patten? \"What about \nfucking dinner?\" \n\nMcDERMOTT \nAh, cheer up, Bateman. \n(Slaps him on the back, massages his neck) \nWhat's the matter? No shiatsu this morning? \n\n<b>BATEMAN \n</b>(Watching Luis going into the men's room) \nKeep touching me like that and you'll draw back a stump.\n\nMcDERMOTT \nWhoa, hold on there, little buddy.\n\n<b>BATEMAN \n</b>Excuse me.\n\nHe gets up from the table. As Bateman walks away, Van \nPatten grabs a waiter.\n\n<b>VAN PATTEN \n</b>Is this tap water? I don't drink tap water Bring \nme an Evian or something, okay?\n\n<b>INT. MEN'S ROOM - DAY \n</b>\nBateman pulls on his gloves as he \nenters the men's room. Carruthers is standing in a stall with his \nback to Bateman. The sound of his urinating is heard until Bateman \napproaches, then abruptly stops. Slowly, Bateman brings his hands \nup over the collar of Carruthers' cashmere jacket, circling his \nneck until both thumbs and index fingers meet. All we can hear \nis the sound of Bateman's heavy breathing. Slowly he starts to \nsqueeze. Almost in slow motion, Carruthers turns around.\n\nCarruthers looks down at Bateman's wrists as if lost in \nthought. Then he lowers his head and kisses Bateman's \nwrist. He looks back at Bateman with a shy, love-struck \nexpression, then reaches up and tenderly touches the side \nof his face.\n\n<b>CARRUTHERS \n</b>God, Patrick. Why here?\n\nHe strokes Bateman's hair.\n\n<b>CARRUTHERS \n</b>I've seen you looking at me. I've noticed your hot body.\n\nCarruthers tries to kiss him on the lips but Bateman backs \naway. He drops his hands from Carruthers' neck. Carruthers \nimmediately takes them and places them back. Bateman drops \nthem again.\n\n<b>CARRUTHERS \n</b>Don't be shy.\n\nBateman takes a deep breath, closes his eyes and tries to lift \nhis hands again, but abandons the attempt.\n\n<b>CARRUTHERS \n</b>You don't know how long I've wanted it. Ever since that Christmas \nparty at Arizona 206. You know the one, you were wearing that \nred-striped paisley Armani tie.\n\nBateman looks down and sees that Carruthers' pants are \nstill unzipped. He moves past him out of the stall and \nstands by the sink and pretends to wash his hands until he \nrealizes he still has his gloves on. Carruthers comes up \nbehind him.\n\n<b>CARRUTHERS \n</b>I want you. I want you...too.\n\nBateman storms out of the men's room, bumping into a waiter \nand several customers and cursing. Noticing the maitre d' \nand another waiter conferring and looking at him strangely, \nBateman straightens up and smiles and waves cheerfully at \nthem. Carruthers walks up behind him.\n\n<b>BATEMAN \n</b>(Hissing) \nWhat...is...it?\n\n<b>CARRUTHERS \n</b>Where are you going?\n\n<b>BATEMAN \n</b>(Stumbling away from him) \nI've gotta...I've \ngotta...return some videotapes.\n\n<b>CARRUTHERS \n</b>Patrick?\n\n<b>BATEMAN \n</b>What?\n<b>CARRUTHERS \n</b>(Silently mouthing the words) \nI'll call you.\n\nBateman storms out of the restaurant.\n\n<b>INT. COURTNEY'S APARTMENT - NIGHT \n</b>\nBateman is lying on top of Courtney in her bed, after sex. \nStill panting, he rolls off her, onto his back. He feels \nsomething lumpy underneath him and pulls out a stuffed toy, \na black cat with blue jewel eyes. There is silence.\n\n<b>COURTNEY \n</b>Will you call me before Thanksgiving?\n\n<b>BATEMAN \n</b>Maybe.\n\nCourtney sighs and reaches for a bottle of pills on her \nnightstand, swallowing several. Bateman gets up and begins \nto dress, admiring himself in the mirror. Courtney watches \nthe TV at low volume.\n\n<b>COURTNEY \n</b>What are you doing tonight?\n\n<b>BATEMAN \n</b>Dinner at the River Cafe. Au Bar afterwards, maybe.\n\n<b>COURTNEY \n</b>That's nice.\n\n<b>BATEMAN \n</b>You and...Luis?\n\n<b>COURTNEY \n</b>(Lighting a cigarette) \nWe were supposed to have dinner at Tad and \nMaura's, but-you know how Luis is...\n\n<b>BATEMAN \n</b>I never knew you smoked.\n\n<b>COURTNEY \n</b>(Smiling sadly) \nYou never noticed.\n\nBateman is making final adjustments to his tie.\n\n<b>COURTNEY \n</b>Listen...Patrick. Can we talk?\n\n<b>BATEMAN \n</b>You look marvelous. There's nothing to say. You're \ngoing to marry Luis. Next week, no Less.\n\n<b>COURTNEY \n</b>(Sarcastically) \nIsn't that special? \n(A pause) \nPatrick?\n\n<b>BATEMAN \n</b>Yes, Courtney?\n\n<b>C0URTNEY \n</b>If I don't see you before Thanksgiving, have a nice one, okay?\n\n<b>BATEMAN \n</b>(Flatly) \nYou too.\n\nCourtney picks up the black cat and starts petting its \nhead. Bateman heads down the hallway to the front door.\n\n<b>COURTNEY \n</b>Patrick?\n\n<b>BATEMAN \n</b>Yes?\n\n<b>COURTNEY \n</b>Nothing.\n\n<b>INT. NIGHTCLUB - NIGHT \n</b>\nA big eighties nightclub with a mixed crowd: hip-hop \nkids, visitors from Jersey, downtown art people, yuppies.\n\nI Bateman makes his way through the crowd to the bar, and \ntries to attract the bartender's attention. He is wearing a \nsuit and his tie is loosened. Kimball approaches him.\n\n<b>KIMBALL \n</b>Mr. Bateman?\n\nBateman gasps and recovers.\n\n<b>BATEMAN \n</b>Detective Kendall...uh Campbell?\n<b>KIMBALL \n</b>Kimball. \n(Extending his hand) \nCall me Don.\n\n<b>BATEMAN \n</b>Don.\n\n<b>KIMBALL \n</b>So...you hang out here a lot?\n\n<b>BATEMAN \n</b>Uh, yes...I mean...whenever necessary. You \nknow.\n\nPause.\n\n<b>BATEMAN \n</b>How's the investigation going? Taken anyone \nin for \"formal questioning?\" (He makes quotation marks \nin the air and laughs a not-so-relaxed laugh)\n\n<b>KIMBALL \n</b>0h no. Informal conversations, mostly. What's that, Stoli?\n\n<b>BATEMAN \n</b>Yeah. No Finlandia, as usual. Fucking dump.\n\n<b>KIMBALL \n</b>(Looking at his glass) \nToo true. You know, Bateman-people tend to reveal so much \nmore about themselves when they're in a relaxed setting, \ndon't you think?\n\nBateman is nodding nervously, idiotically.\n\n<b>KIMBALL \n</b>Some people just can t help themselves. Another Stoli?\n\nBateman shakes his head.\n\n<b>KIMBALL \n</b>I mean they want to get caught.\n\n<b>BATEMAN \n</b>Dan, great to see you again. Like I said, you need \nanything at all, I'm your man. I don't envy your job. I mean \nOwen was a...complex man.\n\nBateman wanders away.\n\nHe looks back uneasily at KIMBALL, who is watching him from \nthe bar. A GUY WITH DREADLOCKS walks by.\n\n<b>BATEMAN \n</b>(Holding up his hand to high-five) Rasta Man!\n\nThe man stares at him.\n\n<b>BATEMAN \n</b>I mean-Mon. We be jammin'...\n\nThe man walks by, shaking his head.\n\nBateman wanders into the next room, which is filled with a \nmore familiar crowd: young men in designer suits, girls in \nblack designer dresses. Across the room he spots McDermott \nand Price sitting with three models, all wearing black \nmini-dresses. Price and McDermott are having a whispered \nargument.\n\n<b>PRICE \n</b>I have to talk to these girls? They're models.\n\nMcDERMOTT \nSomeone has to get the Bolivian marching powder. \nYou went last time. Stay here.\n\nMcDermott waves gaily to the girls and disappears.\nBateman looks at the models. DAISY and CARON are staring \ninto space, smoking. LIBBY is trying to work out how to \nunfold her napkin. Price signals to Bateman for help.\n\n<b>PRICE \n</b>(Clapping his hands together) \nLet's have a conversation. So...it was hot out today, no?\n\nSilence.\n\n<b>LIBBY \n</b>Where did Craig go?\n\n<b>PRICE \n</b>Well, Gorbachev is downstairs. McDermott is going to \nsign a peace treaty with him between the United States \nand Russia. McDermott's the one behind glasnost, you know.\n\n<b>LIBBY \n</b>Well...yeah. But he told me he was in mergers and acquisitions.\n\n<b>PRICE \n</b>You're not confused, are you?\n\n<b>LIBBY \n</b>No, not really.\n\n<b>CARON \n</b>Gorbachev's not downstairs.\n\n<b>DAISY \n</b>(Smiling) \nAre you Iying?\n\n<b>PRICE \n</b>Yes, Caron's right. Gorbachev's not downstairs. He's \nat Tunnel.\n\n<b>BATEMAN \n</b>(To Daisy) \nAsk me a question.\n\n<b>DAISY \n</b>So, what do you do?\n\n<b>BATEMAN \n</b>What do you think I do?\n\n<b>DAISY \n</b>A model? An actor?\n\n<b>BATEMAN \n</b>No. Flattering, but no.\n\n<b>DAISY \n</b>Well...\n\n<b>BATEMAN \n</b>I m into, well, murders and executions mostly.\n\nDAISY (Unfazed) \nDo you like it?\n\n<b>BATEMAN \n</b>Welt...it depends, why?\n\n<b>DAISY \n</b>Well, most guys I know who work in mergers and \nacquisitions don't really like it.\n\nSilence.\n\n<b>BATEMAN \n</b>So, where do you work out?\n\n<b>MUCH LATER IN THE EVENING: \n</b>\nThe club is half-empty now. Price is leaning over a \nbalcony, messed-up on drugs. Bateman comes up behind him \nin a menacing way that suggests he might push him over \nthe railing. Price turns around, wild-eyed, just as Bateman \nis reaching for him.\n\n<b>PRICE \n</b>(Shouting)\nI'm leaving. I'm getting out.\n\n<b>BATEMAN \n</b>Leaving what?\n\n<b>PRICE \n</b>This.\n\nBateman is confused, he thinks Price is referring to his \ndrink.\n\n<b>BATEMAN \n</b>Don't, I'll drink it.\n\n<b>PRICE \n</b>(Screaming) \nListen to me, Patrick. I'm leaving.\n\n<b>BATEMAN \n</b>Where to? Are you going to go get a gram?\n\n<b>PRICE \n</b>I'm leaving! I...am...leaving!\n\n<b>BATEMAN \n</b>Don't tell me...merchant banking?\n\n<b>PRICE \n</b>No, you dumb son of a bitch. I'm serious. I'm \ndisappearing.\n\n<b>BATEMAN \n</b>(laughing) \nWhere to? Morgan Stanley? Rehab? What?\n\nPrice looks away.\n\nMcDermott and Daisy walk up to them.\n\nMcDERMOTT \nHey-don't worry, be happy.\n\nPrice lifts his arms up as if greeting the crowd and is \nshouting something that can't be heard, then\n\n<b>PRICE \n</b>Goodbye! Fuckheads!\n\nHe climbs over the railing.\n\nDAISY What is he doing?\n\n<b>BATEMAN \n</b>Price! Come back!\n\nPrice leaps from the balcony. He disappears for a moment \nthen resurfaces and runs off into the crowd.\n\n<b>EXT. CLUB - NIGHT \n</b>Bateman and Daisy are waiting for a cab.\n\n<b>DAISY \n</b>My ex-boyfriend, Fiddler, who was in there, he plays \nin this band that just opened for U2-he couldn't understand \nwhat I was doing with a yuppie.\n\n<b>BATEMAN \n</b>Oh really?\n<b>DAISY \n</b>He said...\n(She laughs) \nHe said you gave him bad vibes.\n\n<b>BATEMAN \n</b>That's...that's too bad.\n\n<b>DAISY \n</b>You think I'm dumb, don't you?\n\n<b>BATEMAN \n</b>What?\n\n<b>DAISY \n</b>You think I'm dumb. You think all models are dumb.\n\n<b>BATEMAN \n</b>(insincerely) No. I really don't.\n\n<b>DAISY \n</b>That's okay. I don't mind. There's something sweet about you.\n\nShe takes his hand as they get into a cab.\n\n<b>INT. DAISY'S HALLWAY - LATER THAT NIGHT \n</b>\nBateman leaves Daisy's apartment carrying a suitcase. He pauses \nin the hallway and tucks some long blonde hair back inside the \ncase.\n\n<b>INT. BATEMAN'S OFFICE - LATE AFTERNOON \n</b>\nBateman sits at his desk wearing Wayfarers doing the New York \nTimes crossword puzzle at dusk.\n\nJean knocks gently on the half-open door and walks in with \na folder in her hand. Bateman ignores her.\n\n<b>JEAN \n</b>Doin' the crossword?\n\nBateman nods without looking up.\n\n<b>JEAN \n</b>Need help?\n\nBATEMAN doesn't respond. We see that every space on the \npuzzle has been filled in with the words MEAT or BONE. Jean \ndrops the folder on his desk and then walks out.\n\n<b>BATEMAN \n</b>Jean?\n\n<b>JEAN \n</b>(Re-enters office) \nYes, Patrick?\n\n<b>BATEMAN \n</b>Would you like to accompany me to dinner?\n\nHe erases one of the M's on the crossword puzzle.\n\n<b>BATEMAN \n</b>That is...if you're not doing anything.\n\n<b>JEAN \n</b>Oh no. I have no plans.\n\n<b>BATEMAN \n</b>(Lowering his Wayfarers) \nWell, isn't this a coincidence.\n\nA pause.\n\n<b>BATEMAN \n</b>Listen, where should we go?\n\nHe leans back and pulls a Zagat's from the desk drawer.\n\n<b>JEAN \n</b>Anywhere you want?\n\n<b>BATEMAN \n</b>Let's not think about what I want. How about \nanywhere you want.\n\n<b>JEAN \n</b>Oh Patrick, I can't make this decision.\n\n<b>BATEMAN \n</b>No, come on. Anywhere you want.\n\n<b>JEAN \n</b>Oh, I can't. \n(Sighs) \nI don't know.\n\n<b>BATEMAN \n</b>Come on. Where do you want to go? Anywhere you want.\nJust say it. I can get us in anywhere.\n\nA long pause.\n\n<b>JEAN \n</b>What about...Dorsia?\n\nBateman stops looking through the Zagat's guide and smiles \nat her.\n\n<b>BATEMAN \n</b>Soooo...Dorsia is where Jean wants to go...\n\n<b>JEAN \n</b>Oh, I don't know. No, we'll go anywhere you want.\n\n<b>BATEMAN \n</b>Dorsia is...fine.\n\nHe dials the number.\n\n<b>MAITRE D'\n</b>Dorsia, yes?\n\n<b>BATEMAN \n</b>Yes, can you take two tonight, oh, let's say at \nnine o'clock?\n\nHe checks his Rolex and winks at Jean.\n\n<b>MAITRE D'\n</b>We are totally booked.\n\n<b>BATEMAN \n</b>Oh really? That's great.\n\n<b>MAITRE D' \n</b>I said we are totally booked.\n\n<b>BATEMAN \n</b>Two at nine? Perfect.\n\n<b>MAITRE D' \n</b>There are no tables available tonight. The waiting list is \nalso totally booked.\n\n<b>BATEMAN \n</b>See you then.\n\nHe hangs up the phone. He walks over to the coat rack. He \nglances over at Jean, who is still standing in front of the \ndesk, confused.\n\n<b>BATEMAN \n</b>Yes? You're dressed...okay.\n\n<b>JEAN \n</b>You didn't give them a name.\n\n<b>BATEMAN \n</b>They know me.\n\nPause.\n\n<b>BATEMAN \n</b>Why don't you meet me at my house at seven o'clock \nfor drinks, okay?\n\nShe turns to leave.\n\n<b>BATEMAN \n</b>And Jean? You'll want to change before we go out.\n\n<b>INT. BATEMAN'S APARTMENT - EARLY EVENING \n</b>\nJean stands by the floor-to-ceiling windows, looking out.\n\n<b>JEAN \n</b>Patrick, it's so...elegant. What a wonderful view.\n\nBateman opens up the freezer where Daisy's head is cleady \nvisible.\n\n<b>BATEMAN \n</b>Jean? Sorbet?\n\n<b>JEAN \n</b>Thanks, Patrick. I'd love some.\n\nBateman walks in with a bottle of wine and a corkscrew in \nhis hand and hands her the sorbet.\n\nJean is eating the sorbet.\n\n<b>JEAN \n</b>Want a bite?\n\n<b>BATEMAN \n</b>I'm on a diet. But thank you.\n\n<b>JEAN \n</b>You don't need to lose any weight. You're kidding, right? \nYou look great. Very fit.\n\n<b>BATEMAN \n</b>(Weighing the corkscrew examining the point for sharpness) \nYou can always he thinner. Look...better.\n\n<b>JEAN \n</b>Well, maybe we shouldn't go out to dinner. I don't \nwant to ruin your willpower.\n\n<b>BATEMAN \n</b>No. It's all right. I'm not very good at controlling \nit anyway.\n\nSilence, as Bateman walks around his apartment, opens up \nhis knife drawer, looking at the knives.\n\n<b>BATEMAN \n</b>So listen, what do you really want to do with your \nlife?\n\nPause.\n\n<b>BATEMAN \n</b>And don't tell me you enjoy working with children, \nokay?\n\n<b>JEAN \n</b>Well, I'd like to travel. And maybe go back to school, \nbut I really don't know...I'm at a point in my life \nwhere there seems lo be a lot of possibilities, but I'm so...\nI don't know...unsure.\n\nBateman is touching a knife in the drawer, feeling the edge \nof the blade.\n\n<b>BATEMAN \n</b>Do you have a boyfriend?\n\n<b>JEAN \n</b>No, not really.\n\n<b>BATEMAN \n</b>Interesting.\n\n<b>JEAN \n</b>(Shyly) \nAre you seeing anyone? I mean, seriously?\n\n<b>BATEMAN \n</b>Maybe. I don't know Not really.\nBateman opens up a cupboard where there are a lot of very \nBateman opens a cupboard where there are a lot of neatly\nordered weapons - an ax, a rifle, a chain saw, duct tape, \ntwine and a nail gun.\n\n<b>BATEMAN \n</b>Jean, do you feel...fulfilled? I mean, in your life?\n\n<b>JEAN \n</b>Well, I guess I do. For a long time I was too focused \non my work, I think, but now I've really begun to think about \nchanging myself, you know, developing, and...growing.\n\n<b>BATEMAN \n</b>Growing. I'm glad you said that.\n\nBateman picks up the duct tape.\n\n<b>BATEMAN \n</b>Did you know that Ted Bundy's first dog, a collie, \nwas named Lassie? Had you heard this?\n\n<b>JEAN \n</b>Who's Ted Bundy?\n\n<b>BATEMAN \n</b>Forget it.\n\n<b>JEAN \n</b>What's that?\n\n<b>BATEMAN \n</b>Oh. Uh, tape. Duct tape. I...need it for...\ntaping something. Bateman goes back to the cupboard for the \nnail gun.\n\n<b>JEAN \n</b>Patrick, have you ever wanted to make someone happy?\n\nJean puts her spoon down on the table.\n\n<b>BATEMAN \n</b>(Looking up from loading nails into the gun) \nWhat...No! Put it in the carton.\n\n<b>JEAN \n</b>Sorry. \n(She puts the spoon in the carton)\n\n<b>BATEMAN \n</b>Jean? What?\n\n<b>JEAN \n</b>Make someone happy-have you ever wanted to?\n\nFrom behind, we follow Bateman as he walks across the room and\nstands behind the couch.\n\n<b>BATEMAN \n</b>I'm looking for...I guess you could say I just \nwant to have a meaningful relationship with someone special.\n\n<b>JEAN \n</b>Hmmmm. \n\nHe points the nail gun at the back of Jean's head.\nThe phone RINGS. Startled, Bateman hides the nail gun \nbehind his back. The answering machine picks up. As Bateman \nlistens he discreetly places the nail gun behind the couch. \nHe sits down opposite Jean, enjoying her discomfort as she \nlistens to the message.\n\n<b>EVELYN \n</b>Patrick I know you're there. Pick up the phone, you bad boy. \nWhat are you up to tonight? It's me. Don't try to hide. I hope \nyou're not out with some little number you picked up because \nyou're my Mr. Bateman. My boy next door. Anyway you never \ncalled me and you said you would and I'll leave a message for \nJean about this too to remind you but we're having dinner with \nMelania and Taylor-you know Melania, she went to Sweet Briar, \nauld Taylor, he went to Cornell-and we're meeting at the Cornell \nClub, so l'll call you tomorrow morning probably-bye, honey-oopps! \nYou hate that. Bye Mr. Big Time CEO Patrick. Bye. Bye.\n\nSilence. Jean is obviously embarrassed and upset.\n\n<b>JEAN \n</b>Was that...Evelyn?\n\nSilence.\n\n<b>JEAN \n</b>Are you still seeing her?\n\nSilence.\n\n<b>JEAN \n</b>I'm sorry, I have no right to ask that.\n\nSilence.\n\n<b>JEAN \n</b>Do you want me to go?\n\nA long pause.\n\n<b>BATEMAN \n</b>Yes. I don t think I can...control myself.\n\n<b>JEAN \n</b>I know I should go. I know I have a tendency to get \ninvolved with unavailable men, and...I mean, do you \nwant me to go?\n\nAnother long pause.\n\n<b>BATEMAN \n</b>If you stay, I think something bad will happen. I \nthink I might hurt you. \n(Almost hopefully) \nYou don't want to get hurt, do you?\n\n<b>JEAN \n</b>No. No, I guess not. I don't want to get bruised. \nYou're right, I should go.\n\nShe gets up to leave.\n\n<b>JEAN \n</b>And don't forget you have a breakfast meeting with \nFrederick Bennet and Charles Rust at '21.\n\n<b>BATEMAN \n</b>Thanks. It slipped my mind completely.\n\nHe sinks back on the sofa and shuts his eyes.\n\n<b>INT. BATEMAN'S OFFICE - DAY \n</b>\nBateman enters P&amp;P, walks up the corridor and pauses outside \nthe door to his office. He sees KIMBALL in conversation with \nJean, and Jean looking through her date book. He watches for \na moment, frozen with anxiety. He then bursts in, shutting \nthe door behind him.\n\n<b>BATEMAN \n</b>Kimball-I've been wanting to talk with you, Come \ninto my office. Jean, great jacket. Matsuda?\n\nJean looks flustered.\n\nKimball follows Bateman into his office.\n\n<b>KIMBALL \n</b>I actually came to see Timothy Price, but he's \ntaken a leave of absence.\n\n<b>BATEMAN \n</b>Yeah, gone into rehab. Shame. \n(Hopefully) \nIs he a suspect?\n\n<b>KIMBALL \n</b>Not really.\n\nA pause.\n\n<b>KIMBALL \n</b>Do you remember where you were on the night of \nPaul's disappearance? \n(He checks his notebook) \nWhich was on the twentieth of December?\n\n<b>BATEMAN \n</b>God...I guess...I was probably returning \nvideotapes.\n\nHe opens his desk drawer and pretends to search through his \ndiary.\n\n<b>BATEMAN \n</b>I had a date with a girl named Veronica.\n\n<b>KIMBALL \n</b>Wait. That's not what I've got.\n\n<b>BATEMAN \n</b>What?\n\n<b>KIMBALL \n</b>That's not the information I've received.\n\n<b>BATEMAN \n</b>Well...I...Wait...What information have \nyou received?\n\n<b>KIMBALL \n</b>Let's see...\n(He flips through his notebook) \nThat you were with-\n\n<b>BATEMAN \n</b>Well, I could he wrong.\n\n<b>KIMBALL \n</b>Well...When was the last time you were with Paul Owen?\n\n<b>BATEMAN \n</b>(Clearly nervous and under pressure) \nWe had...gone to a new musical called...Oh Africa, Brave Africa. It \nwas...a laugh riot...and that's about it. I think we had dinner \nat Orso's. No, Petaluma. No, Orso's. The...last time I \nphysically saw him was...at an automated teller. I can't \nremember which...just one that was near, um, Nell's.\n\nKimball is clearly giving up on Bateman for now. He opens \nhis briefcase to put away his notebook.\n\n<b>KIMBALL \n</b>Well, thank you, Mr. Bateman.\n\n<b>BATEMAN \n</b>Patrick, please. I hope I've been informative. Long \nday-a bit scattered.\n\n<b>KIMBALL \n</b>Listen, I'm a little spent for now but how about lunch \nin a week or so when I've sorted out all this information?\n\n<b>BATEMAN \n</b>Great, yes, I'd like that.\n\n<b>KIMBALL \n</b>And if you could try and pin down where you were \nthe night of Owen's disappearance, it would make my job a \nlot easier.\n\n<b>BATEMAN \n</b>Absolutely. I'm with you on that one.\n\nKimball is rifling through his briefcase. He pulls out a \nnew shrink wrapped CD and holds it up.\n\n<b>KIMBALL \n</b>Huey Lewis and the News. Great stuff. Heard it? I \njust bought it on my way here.\n\nBateman stares at the CD - stunned, terrified.\n\n<b>BATEMAN \n</b>Never. I mean...I don't really like...\nsingers.\n\n<b>KIMBALL \n</b>Not a big music fan, eh?\n\n<b>BATEMAN \n</b>No, I like music. Just-they're-Huey's too...\nblack sounding. For me.\n\n<b>KIMBALL \n</b>Well, to each his own. So-lunch, Thursday? I'll \ncall your secretary about reservations.\n\n<b>BATEMAN \n</b>I'll be there.\n\n<b>EXT. MEAT PACKING DISTRICT/INT. LIMOUSINE - NIGHT\n</b>\nThe same street corner where Bateman found Christie before. \nThe limo is kept idling as he talks to her through a \nhalf-opened window.\n\n<b>CHRISTIE \n</b>I'm not so sure about this. I had to go to Emergency after \nlast time...\n\n<b>BATEMAN \n</b>Oh this won't be anything like last time, I promise.\n\n<b>CHRISTIE \n</b>I don't think so.\n\nHe hands her a $500 bill.\n\n<b>BATEMAN \n</b>Just come in the limo and talk to me for a minute. \n\nThe driver's here, you'll be safe.\n\nChristie gets in hesitantly.\n\n<b>BATEMAN \n</b>Nothing like last time, promise.\n\n<b>CHRISTIE \n</b>Alright.\n\nHe pours her a shot of vodka and makes her drink it.\n\n<b>BATEMAN \n</b>(Chatting as if they were at a cocktail party) \nSo, you're looking great, how have you been?\n\n<b>CHRISTIE \n</b>(A little confused) \nWell, I actually might need a little surgery after last time.\n\n<b>BATEMAN \n</b>(Mock shock) \nReally?\n\n<b>CHRISTIE \n</b>My friend told me I should maybe even get a \nlawyer.\n\n<b>BATEMAN \n</b>Oh, lawyers are so complicated-don't do that. Here.\n\nHe writes her a check for $I ,000 to cash and hands it to \nher. She snatches the check out of his hand and gets \nquickly out of the limo, walking hurriedly down the street.\n\n<b>BATEMAN \n</b>Bitch.\n\nHe follows alongside her slowly in the limo, waving a huge \nwad of cash at her. She hesitates; he uses the money to \nlure her into the car. As she reluctantly gets into the \nlimo, she reaches for the money.\n\nHe snatches it away.\n\n<b>BATEMAN \n</b>Uh uh uh. Half now, half later.\n\nShe takes the money and puts it inside her shirt.\n\n<b>BATEMAN \n</b>Okay, your name is Christie. We're meeting a friend of mine, \nElizabeth. She'll be joining us in my new apartment shortly. \nYou'll like her. She's a very nice girl. Don't say anything \nabout yourself. Is that clear. Christie?\n\nChristie nods.\n\n<b>INT. PAUL OWEN'S APARTMENT - NIGHT \n</b>\nThe living room: ELIZABETH has kicked off her shoes and flopped \ndown on the couch underneath the Baselitz. Elizabeth is an \nattractive, dark-haired society girl who models occasionally. \nChristie is sitting on the couch opposite her, pretending to \nexamine a CD.\n\n<b>ELIZABETH \n</b>You look really familiar. Did you you go to Dalton?\n\nChristie shakes her head.\n\nThe kitchen: Bateman is grinding up tabs of Ecstasy and \nputting them in a bottle of wine. In the living room, Elizabeth \nis still staring at Christie as if she came from Mars.\n\n<b>ELIZABETH \n</b>I think I met you at Au Bar, didn't I ? With Spicey?\n\nChristie looks blank.\n\n<b>ELIZABETH \n</b>Well, maybe not with Spicey but it was definitely at Au Bar.\n\nChristie still blank.\n\n<b>ELIZABETH \n</b>You know, Au Bar?\n\nChristie shakes her head.\n\n<b>ELIZABETH \n</b>Anyway, Au Bar sucks now, it's terrible. I went to a birth\nday party there for Malcolm Forbes. Oh my God, please.\n\nBateman enters carrying the bottle of wine and two glasses.\nChristie, who seems frightened, sips her wine and stares at \nthe floor. There is an awkward silence.\n\n<b>CHRISTIE \n</b>This is nicer than your other apartment.\n\n<b>BATEMAN \n</b>(Offended that she prefers Owen's apartment) \nIt's not that nice.\n\nSilence.\n\n<b>CHRISTIE \n</b>Where did you two meet?\n\n<b>ELIZABETH \n</b>Oh God! I met him at, oh God, the Kentucky Derby in '86-no, \n'87, and...\n(Turning to Patrick) \nYou were hanging out with that bimbo Allison Poole. \n(Sarcastically) \nHot number.\n\n<b>BATEMAN \n</b>What do you mean, she was a hot number.\n\n<b>ELIZABETH \n</b>If you had an American Express card she'd give you a blowjob. \n(To Christie) \nListen, this girl worked in a tanning salon, need\nI say more?...What do you do?\n\nA long silence. Christie reddens and stares at the floor. \n\n<b>BATEMAN \n</b>She's my...cousin. \n\n<b>ELIZABETH \n</b>(Skeptically) \nUh huh? \n\n<b>BATEMAN\n</b>She's from...France.\n\nA pause. Elizabeth looks at Bateman dubiously. \n\n<b>ELIZABETH \n</b>Where's your phone? I've got to call Harley.\n\nBateman hands her a cordless phone. She dials, and stares \nAt Christie while she waits for someone to answer. \n\n<b>ELIZABETH \n</b>Where do you summer? Southampton?\n\nChristie looks at Bateman and then back at Elizabeth.\n\n<b>CHRISTIE \n</b>No.\n\n<b>ELIZABETH \n</b>(Listening to the receiver) \nOh God, it's his machine.\n\n<b>BATEMAN \n</b>Elizabeth, it's three in the morning.\n\n<b>ELIZABETH \n</b>He's a goddamn drug dealer! These are his peak hours.\n\n<b>BATEMAN \n</b>Don't tell him you're here.\n\n<b>ELIZABETH \n</b>Why would I?\n\nBateman has poured her another glass of wine. She downs the\nwhole glass, making a face.\n\n<b>ELIZABETH \n</b>This tastes weird. \n(She examines the label and shrugs)\nHarley? It's me. I need your services. Translate that anyway \nyou'd like. I'm at-\n\n<b>BATEMAN \n</b>(Whispering) \nYou're at Paul Owen s.\n\n<b>ELIZABETH \n</b>Who?\n\n<b>BATEMAN \n</b>(Whispering) \nPaul Owen.\n\n<b>ELIZABETH \n</b>I want the number, idiot. \n(She waves him away and continues into the reciever) \nAnyway, I'm at Paul Norman's and I'll try you later and if I \ndon't see you at Canal Bar tomorrow night I'm going to sic my \nhairdresser on you.\n\nShe hangs up.\n\n<b>ELIZABETH \n</b>Did you know that guy who disappeared? Didn't he work at Pierce \n&amp; Pierce, too? Was he a friend of yours?\n\n<b>BATEMAN \n</b>No.\n\n<b>ELIZABETH \n</b>Do you have any coke? Or Halcyon? I'd take a Halcyon.\n\nBateman sits next to Elizabeth on the couch and pours her \nanother glass of the drugged wine.\n\n<b>BATEMAN \n</b>Listen, I would just like to see...the two of you...get it on. \nWhat's wrong with that? It's totally disease-free.\n\n<b>ELIZABETH \n</b>(Laughing) \nPatrick, you re a lunatic.\n\n<b>BATEMAN \n</b>Come on. Don't you find Christie attractive?\n\n<b>ELIZABETH \n</b>Let's not get lewd. \n(Flirty) \nI'm in no mood to have a lewd conversation.\n\n<b>BATEMAN \n</b>Come on. I think it would be a turn-on.\n\n<b>ELIZABETH \n</b>(To Christie) \nDoes he do this all the time?\n\nChristie shrugs.\n\n<b>BATEMAN \n</b>Christie, you're not drinking your wine.\n\nChristie looks at her wine and gingerly takes a sip.\n\n<b>BATEMAN \n</b>(To Elizabeth) \nAre you telling me you've never gotten it on with a girl?\n\n<b>ELIZABETH \n</b>No! I'm not a lesbian. Why do you think I'd be into that?\n\n<b>BATEMAN \n</b>Well, you went to Sarah Lawrence for one thing.\n\n<b>ELIZABETH \n</b>Those are Sarah Lawrence guys, Patrick. You're making me \nfeel weird.\n\n<b>LATER:\n</b>\nElizabeth is now writhing around on the couch and making \nout with Christie. Bateman holds up a Whitney Houston CD, \nshowing them the picture of Whitney on the cover.\n\n<b>BATEMAN \n</b>Did you know that Whitney Houston's debut LP \ncalled simply Whitney Houston had four number-one singles \non it? Did you know that, Christie? Whitney's voice leaps \nacross so many boundaries and is so versatile-though she's \nmainly a jazz singer-that it's hard to take in the album \non a first listening.\n\n<b>ELIZABETH \n</b>You actually listen to Whitney Houston? You \nactually have a Whitney Houston CD? More than one?\n\nShe giggles, rolling off the sofa onto the floor.\n\n<b>BATEMAN \n</b>(Ignoring her) \nIt's hard to choose a favorite track \namong so many great ones, but \"The Greatest Love of All\" \nis one of the best, most powerful songs ever written about \nself-preservation and dignity. It's universal message \ncrosses all boundaries, and instills one with the hope \nthat it's not too late to better ourselves. to act kinder. \nSince, Elizabeth, it's impossible in the world we live in \nto empathize with others, we can always empathize with \nourselves.\n\nAs he speaks, he opens the case and carefully places the CD \nin the player, admiring its pristine silver surface, and \nwatches it slide into the machine.\n\n<b>BATEMAN \n</b>It's an important message, crucial, really, and it's \nbeautifully stated on the album.\n\n<b>INT. BEDROOM - LATER \n</b>\nAN OUT-OF-FOCUS HOME VIDEO SHOT of Elizabeth, Christie and \nBateman in the throes of sex, in the master bedroom.\n\nCUT BACK TO WIDE SHOT of the bedroom, partially blocked by \nthe video camera in the foreground. Their bodies are an \nincoherent tangle of arms and legs. The only sounds are \nmoans, heavy breathing and the slapping of flesh against \nflesh. CLOSE ON Christie's head and shoulders. Her eyes are \nshut as she grimly concentrates on giving a good professional \nperformance, turning her head every so often to check the \nprogress of her partners.\n\nOFFSCREEN WE HEAR Elizabeth panting in genuine pleasure, \nmoaning loudly. Her voice gets louder and louder and then \nshifts to actual pain.\n\nBateman rises up off the bed, suddenly appearing behind \nChristie. There is blood on his face.\n\nChristie turns her head and sees him. She screams and leaps \noff the bed, running out of the room. She slams the \nmirrored door behind her, and as it swings shut for a split \nsecond we see Elizabeth writhing in pain on the bed.\n\nWe follow Christie out of the room, panicking, screaming.\n\nChristie runs down a darkened hallway, frantically opening \ndoors, looking for an escape.\n\nShe hears the SOUND OF A CHAINSAW coming from the bedroom.\n\nShe opens a closet. The closet lights up as she opens the \ndoor and sees two dead, women hanging inside. She screams, \nthen claps a hand over her mouth. She stops and listens. THE \n<b>DISTANT SOUND OF THE CHAINSAW.\n</b>\nShe backs away slowly, into another dark room, lit only by \nthe light from a television set. Through the darkness she \nsees a head on the top of the TV and starts to whimper.\n\nShe runs toward the nearest door. Finding herself in the \nmain hallway, she begins to jog toward the front door, then \nruns.\n\nBateman appears from nowhere, holding the chainsaw, \nspattered with blood.\n\nChristie screams and changes direction. Bateman leaps at \nher, bellowing.\n\nThey run through the bedroom and into the bathroom. \nChristie trips over Elizabeth's body, which is half in the \nbathtub.\n\nBoth are slipping on the floor, which is slick with blood.\n\nChristie falls, tries to get up. Bateman grabs her leg. He \ntries to bite it.\n\nShe kicks him in the face and gets up, running toward the \nfront door.\n\nHe runs after her.\n\n<b>BATEMAN \n</b>Not the face, you bitch. Not the fucking face, you \npiece of bitch trash!\n\nChristie, screaming, makes it out the front door.\n\nBateman runs after her.\n\nShe runs down the hall screaming and banging on doors.\n\nShe moves to the elevator, pounding hysterically on the \nbuttons. She sees the stairwell and runs for it.\n\nBateman sees this and runs after her, revving the chainsaw.\n\nShe runs down the stairs, Bateman two flights behind her. \nHe stops, leans over the railing to look at her, then aims \nthe chainsaw at her and drops it.\n\nChristie SCREAMS OFFSCREEN, then is suddenly silent.\n\nFROM BATEMAN'S POV we see Christie's body sprawled facedown \nat the bottom of the stairwell. The chainsaw sticks out of \nher back like a sword.\n\n<b>INT. CRAYONS - EARLY EVENING \n</b>\nAn insanely expensive restaurant with a childhood motif: paper \ntablecloths and jars of crayons for drawing, lots of primary \ncolors, and a goldfish bowl on each table.\n\nBateman is at a table with Evelyn. They are both drawing on \nthe tablecloth. Bateman is drawing Christie with the \nchainsaw in her back.\n\n<b>EVELYN \n</b>I want a firm commitment.\n\n<b>BATEMAN \n</b>I think, Evelyn, that we've...lost touch.\n\nEvelyn waves to a couple across the room.\n\n<b>EVELYN \n</b>(Distracted) \nWhy? What's wrong?\n\n<b>BATEMAN \n</b>(Speaking very carefully, measuring each word) \nMy need to engage in homicidal behavior on a massive scale \ncannot be, um, corrected, but I have no other way to fulfill \nmy needs.\n\nThe woman across the room holds up her hand, displaying a\nnew bracelet. Evelyn smiles and nods approvingly.\n\n<b>BATEMAN \n</b>We need to talk.\n\n<b>EVELYN \n</b>Talk about what, Patrick? What is there to talk \nabout?\n\n<b>BATEMAN \n</b>It's over, Evelyn. It's all over\n\n<b>EVELYN \n</b>(Motioning to the waiter for water) \nTouchy, touchy. I'm sorry I brought the wedding up. Let's just \navoid the issue, alright? Now, are we having coffee?\n\n<b>BATEMAN \n</b>I'm fucking serious. It's fucking over. Us. This \nis no joke. I don't think we should see each other anymore.\n\n<b>EVELYN \n</b>But your friends are my friends. My friends are your \nfriends. I don't think it would work. \n(Reaching over to dab his face with a napkin) \nYou have a little something on your upper lip.\n\n<b>BATEMAN \n</b>(Brushing her hand away) \nI know that your friends are my friends. I've thought about \nthat. You can have them.\n\nEvelyn stares at him, suspicious and bewildered, a \nrealization dawning.\n\n<b>EVELYN \n</b>You're really serious, aren't you?\n\n<b>BATEMAN \n</b>Yes, I am.\n\n<b>EVELYN \n</b>But what about the past? Our past?\n\n<b>BATEMAN \n</b>We never really shared one.\n\n<b>EVELYN \n</b>You're inhuman.\n\n<b>BATEMAN \n</b>I'm...in touch with humanity. Evelyn, I'm sorry. \n(He pauses, as if searching for the right words) \nYou're just not terribly important to me.\n\nEvelyn begins to cry.\n\n<b>EVELYN \n</b>No, no, no.\n\n<b>BATEMAN \n</b>I know my behavior is...erratic sometimes.\n\nShe reaches desperately across the table and takes his \nhand. Bateman pulls his hand away.\n\n<b>EVELYN \n</b>(Sobbing) \nWhat do you want me to do, what is it you want?\n\nThe occupants of nearby tables begin to stare. Bateman is\nbecoming increasingly agitated and embarrassed.\n\n<b>BATEMAN \n</b>(Looking uncomfortably around the room) \nIf you really want to do something for me, you can stop making \nthis scene right now.\n\n<b>EVELYN \n</b>Oh God, I can't believe this.\n\n<b>BATEMAN \n</b>I'm leaving now. I've assessed the situation and I'm going.\n\nEvelyn makes an effort to compose herself. She blots the \ntears so they will not affect her make-up.\n\n<b>EVELYN \n</b>(Surprisingly calm) \nWhere are you going?\n\n<b>BATEMAN \n</b>I'm just leaving.\n\n<b>EVELYN \n</b>But where?\n\n<b>BATEMAN \n</b>I have to return some videotapes.\n\nHe rushes out of the room.\n\n<b>EXT. TRIBECA STREET - EVENING \n</b>\nBateman wanders into misty Tribeca streets, sees a stray cat.\n\n<b>BATEMAN \n</b>Here kitty, kitty.\n\nThe small mangy cat rubs against him. He picks it up and \nwalks toward an ATM, holding the cat. He puts his card in \nthe machine. The screen reads: FEED ME A STRAY CAT.\nBateman begins to attempt to shove the kitten into the \ndeposit slot with some difficulty. The kitten squeals. He \ntakes a gun from out of his pocket and points it at the \nkitten. He doesn't notice the woman waiting behind him.\n\n<b>WOMAN \n</b>Oh my God! Stop that! What are you doing?\n\nBateman wheels around and shoots her. She falls screaming \nto the floor.\n\nResponding to the gunshot, A POLICE CAR SIREN WAILS in the \ndistance. Bateman breaks into a run. The police car \nscreeches after him.\n\n<b>COP CAR (O.S.)\n</b><b>HALT STOP. PUT DOWN YOUR WEAPON.\n</b>\nBateman ducks down an alley.\n\n<b>EXT. ALLEY - NIGHT \n</b>\nA COP rushes toward him, seemingly from \nout of nowhere, and tackles him, trying to get the gun away \nfrom him.\n\nBateman manages to shoot the cop in the face while both of \nthem have their hands on the gun, then shoots him again. He \nreloads the gun. The sound of more COP CARS arriving.\n\nHe runs out of the alley.\n\n<b>EXT. STREET - NIGHT\n</b>\nAs he reaches the street, he finds A PHALANX OF POLICE CARS\napproaching.\n\n<b>COP CAR \n</b>Halt. Put down your weapon.\n\nThe cops leap out and fire a warning shot in the air. \nBateman shoots at them. The police return fire.\n\nBateman ducks down behind a parked car and continues\nshooting wildly. A bullet hits the gas tank of one of the \npolice cars. It catches fire and explodes. The flames light \nup the scene, illuminating the bodies of policemen both living \nand dead.\n\nNEW ANGLE: Bateman flees from the scene. The camera follows \nhim as he runs along a row of Porsches, trying to open each \none, setting off a cacophony of CAR ALARMS.\nTHE SOUND OF POLICE SIRENS draws near.\n\nNEW ANGLE: He runs, panting, until he ends up in front of a \ntail, brilliantly lit office building. As he approaches, \nthe lights in the building are going off floor by floor.\n\n<b>INT. OFFICE BUILDING - NIGHT \n</b>\nHe rushes into the lobby, running for the elevator.\n\n<b>NIGHT WATCHMAN \n</b>Burning the midnight oil, Mr. Smith? You \nforgot to sign in.\n\nBateman wheels around and shoots him. He runs toward the \nrevolving doors. As he swings around in the doors, he \nnotices a JANITOR who has witnessed the shooting. He \nrevolves back into the lobby and shoots the janitor.\n\n<b>NEW ANGLE: \n</b>\nHe runs out of the building and across the \nstreet to an identical office building, the one that houses \nPierce &amp; Pierce.\n\n<b>INT. PIERCE &amp; PIERCE LOBBY - NIGHT \n</b>\nBateman nods at the Pierce &amp; Pierce NIGHT WATCHMAN and signs \nin. He breathes a sigh of relief as the elevator doors close \nbehind him.\n\n<b>INT. BATEMAN'S OFFICE - NIGHT \n</b>\nBateman stands looking out \nthrough the floor-length windows at a panoramic night view \nof the city and the river.\n\nBelow him he sees a SWAT TEAM swarming over the roof of the \nopposite building. There are ambulances standing by, flares \neverywhere, distant sirens.\n\nSuddenly, THE SOUND OF A HELICOPTER draws near. Frightened, \nhe drops to the floor behind his desk.\n\nHelicopter searchlights scan the building, illuminating \nBateman's office for a few moments with a blaze of light.\n\nHe is crouched in one corner, half-sobbing, talking into \nthe phone, as the searchlight keeps circling.\n\n<b>BATEMAN \n</b>Harold, it's Bateman. Patrick Bateman. You're my \nlawyer so I think you should know-I've killed a lot of \npeople. Some escort girls, in an apartment uptown, some \nhomeless people, maybe five or ten, an NYU girl I met in \nCentral Park. I left her in a parking lot, near Dunkin' \nDonuts. I killed Bethany, my old girlfriend, with a nail \ngun. and a man, some old faggot with a dog. Last week I \nkilled another girl with a chainsaw-I had to, she almost \ngot away There was someone else there, maybe a model, I \ncan't remember but she's dead too. And Paul Owen. I killed \nPaul Owen with an ax, in the face. His body is dissolving \nin a bathtub in Hell's Kitchen. I don't want to leave anything \nout here...I guess I've killed 20 people, maybe 40-I have tapes \nof a lot of it. Some of the girls have seen the tapes, I even...\nwell, I ate some of their brains and I tried to cook a little. \nTonight I just, well, I had to kill a lot of people and I'm not \nsure I 'm going to get away with it this time-I mean I guess \nI'm a pretty sick guy. So-if you get hack tomorrow, I may show \nup at Harry's Bar, so, you know, keep your eyes open.\n\nBateman hangs up the phone. The helicopter searchlight \ncircles back, briefly illuminating the room. The camera rises \nup over Bateman huddled in the corner, staring blankly at the \nsky.\n\n<b>INT. SMITH AND WOLLENSKY RESTAURANT - DAY \n</b>\nKIMBALL and Bateman are sitting at a corner table.\n\n<b>KIMBALL \n</b>(Very surprised) \nNo hash browns? \n\n<b>BATEMAN \n</b>Not in the mood, I guess.\n\n<b>KIMBALL \n</b>But...everyone orders the hash browns here. I \nmean- it's-have you been here before?\n\n<b>BATEMAN \n</b>(Deliberately nonchalant) \nYes, of course. The hash browns are delicious. I'm just...not...\nordering them.\n\n<b>KIMBALL \n</b>(Looking at him like he's nuts) \nSuit yourself, I guess.\n\nPause.\n\n<b>KIMBALL \n</b>So, the night he disappeared? Any new thoughts on \nwhat you did?\n\n<b>BATEMAN \n</b>I'm not really sure. I had a shower...and some \nsorbet?\n\n<b>KIMBALL \n</b>I think maybe you've got your dates mixed up.\n\n<b>BATEMAN \n</b>But how? Where do you place Paul that night?\n\n<b>KIMBALL \n</b>According to his date book, and this was verified by his \nsecretary, he had dinner with...Marcus Halberstam.\n\n<b>BATEMAN \n</b>And?\n\n<b>KIMBALL \n</b>I've questioned him.\n\n<b>BATEMAN \n</b>Marcus?\n\n<b>KIMBALL \n</b>Yes. And he denies it. Though at first he couldn't \nbe sure.\n\n<b>BATEMAN \n</b>But Marcus denied it?\n\n<b>KIMBALL \n</b>Yes.\n\n<b>BATEMAN \n</b>Well, does Marcus have an alibi?\n\n<b>KIMBALL \n</b>Yes.\n\nA pause.\n\n<b>BATEMAN \n</b>He does? You're sure?\n\n<b>KIMBALL \n</b>(smiling)\nI checked it out. It's clean.\n\n<b>BATEMAN \n</b>Oh.\nKIMBALL Now where were you? \n(He laughs) \n\n<b>BATEMAN \n</b>(Laughing with him) \nWhere was Marcus? \n\n<b>KIMBALL \n</b>He wasn't with Paul \nOwen. \n\n<b>BATEMAN \n</b>So who was he with? \n\n<b>KIMBALL \n</b>He was at Atlantis with Craig McDermott, Frederick Dibble, \nHarry Newman, George Butner and \u0096 \n(He pauses, Then looks up) \n- you.\n\nA moment of stunned silence.\n\n<b>BATEMAN \n</b>Oh, right. Of course...We had wanted Paul Owen \nto come. But he said he had plans...I guess I had dinner \nwith Victoria...the following night. \n\n<b>KIMBALL \n</b>Personally I think the guy went a little nutso. Split town for \na while. Maybe he did go to London. Sightseeing. Drinking. \nWhatever. Anyway, I'm pretty sure he'll turn up sooner or \nlater. \n(A pause) \nI mean, to think that one of his friends \nkilled him, for no reason whatsoever would be too \nridiculous. Isn't that right, Patrick? \n\nMcDermott stops by the table. \n\nMcDERMOTT \nKIMBALL! How's the investigation? \nTalking to Bateman? Don't believe a word he says. \n(Laughs uproariously slapping him on the back) \nBateman, what's wrong with ,you? \n\nBateman looks at him in silence, \npanicking. \n\nMcDERMOTT \nYou can't eat at Smith and Wollensky \nwithout ordering the hash browns. Jesus, Bateman, you're a \nraving maniac. Been at Pierce &amp; Pierce too long. \n(He wanders off muttering) \nNo fucking hash browns...\n\n<b>INT. PAUL OWEN'S APARTMENT BUILDING - DAY\n</b>\nBateman walks into the lobby of Paul Owen's building. He \nhas a surgical mask in one hand.\n\n<b>DOORMAN \n</b>What can I do for you, sir?\n\n<b>BATEMAN \n</b><b>20B.\n</b>\n<b>DOORMAN \n</b>Of course. Mrs. Wolfe is up there right now.\n\n<b>BATEMAN \n</b>Mrs. Wolfe?\n\n<b>DOORMAN \n</b>The real estate agent? You do have an appointment,\ndon't you?\n\nBateman steps out of the elevator and walks cautiously down\nthe hallway. Owen's door is open. The apartment is freshly \npainted and has been immaculately redecorated in English \ncountry-house style: overstuffed sofas, lots of chintz. There \nare flowers everywhere, and a YOUNG YUPPIE COUPLE stands \nadmiring the place talkingto the realtor, MRS. WOLFE. Bateman \nwanders down the hallway, looking for familiar signs. He stops \nat the closet where we last saw two dead girls hanging. He \nopens the door and the light switches on, but it is empty. Mrs. \nWolfe approaches, smiling.\n\n<b>MRS. WOLFE \n</b>Are you my two o'clock?\n\n<b>BATEMAN \n</b>No.\n\nMrs. Wolfe eyes him strangely, then looks down at the \nsurgical mash clutched in his hand. Her expression changes.\n\n<b>MRS. WOLFE \n</b>Can I help you?\n\n<b>BATEMAN\n</b>I'm looking for...Paul Owen's...place.\n\nShe stares at him impassively.\n\n<b>BATEMAN \n</b>Doesn't he live here?\n\n<b>MRS. WOLFE \n</b>No, he doesn't.\n\n<b>BATEMAN \n</b>Are you sure?\n\n<b>MRS. WOLFE \n</b>You saw the ad in the Times?\n\n<b>BATEMAN \n</b>No. Yes. I mean yes, I did. In the Times. But...\ndoesn't Paul Owen still live here?\n\n<b>MRS. WOLFE \n</b>There was no ad in the Times.\n\nBateman is shaking as they continue to stare at each other.\n\n<b>MRS. WOLFE \n</b>I think you should go now.\n\n<b>BATEMAN \n</b>But I think...I want to know what happened \nhere.\n\n<b>MRS. WOLFE \n</b>Don't make any trouble. Please. I suggest you go.\n\nBateman backs away slowly.\n\n<b>MRS. WOLFE \n</b>Don't come back.\n\n<b>BATEMAN \n</b>I won't...don't worry.\n\nMrs. Wolfe glares at him as he walks down the hall, \nrattled, and gets into the elevator.\n\n<b>EXT. DEPARTMENT STORE - DAY \n</b>\nBateman enters the revolving \ndoor of an office building, panicking and breathing \nheavily. He is sweating, his hair is wild, and he looks \nderanged. He goes around the revolving door twice and comes \nout onto the street again, where he bumps smack into a GUY \njust like him.\n\n<b>GUY \n</b>Hey, Kinsley.\n\nBateman looks up at him wild-eyed.\n\n<b>GUY \n</b>See you at Fluties, okay?\n\nThe guy walks away, utterly unfazed. Bateman wanders down \nthe street, banging his briefcase against walls, garbage \ncans, etc.\n\n<b>EXT. MIDTOWN PHONE BOOTH - DAY \n</b>\nBateman searches his pockets \nfor pills. He finds three different pills and swallows \nthem. He's sweating, and takes his jacket off to wipe his \nface, dialing a number.\n\n<b>JEAN (O.S.) \n</b>Patrick Bateman's office.\n\n<b>BATEMAN \n</b>Jean? Hello? Jean?\n\n<b>JEAN (O.S.) \n</b>Patrick? Is that you?\n\n<b>BATEMAN \n</b>Hello? Jean, I need help!\n\n<b>JEAN (O.S.)\n</b>Where are you?\n\n<b>BATEMAN \n</b>Jean-I'm not-\n\n<b>JEAN (O.S.) \n</b>Craig McDermott called. He wants to meet you and \nDavid Van Patten and Tim Price at Harry's for drinks.\n\n<b>BATEMAN \n</b>Oh God, what did you say, you dumb bitch?\n\n<b>JEAN (O.S.) \n</b>Patrick? I can't hear you.\n\n<b>BATEMAN \n</b>What are I doing?\n\n<b>JEAN (O.S.) \n</b>Where are you? Patrick, what's wrong?\n\n<b>BATEMAN \n</b>I don't think I'm gonna make it, Jean.\n\nPause.\n\n<b>BATEMAN \n</b>...to the office this afternoon.\n\n<b>JEAN (O.S.) \n</b>Why?\n\n<b>BATEMAN \n</b>(Screaming) \nJust...say...no!\n\n<b>JEAN (O.S.) \n</b>What is it, Patrick? Are you alright?\n\n<b>BATEMAN \n</b>Stop sounding so Fucking sad! Jesus!\n\nHe hangs up. He throws the Walkman which is around his neck \ninto a nearby trash can, and wipes his face with his \njacket.\n\n<b>INT. BATEMAN'S OFFICE- SAME DAY \n</b>\nJean sits at Bateman's desk. She looks around, and then opens \nhis desk drawer and tentatively begins to search through it.\n\n<b>INT. HARRY'S BAR - EVENING \n</b>\nBateman comes into the bar, a little cleaned up from the \nprevious scene (he's smoothed his hair), but still panicking \nand disheveled. He spots his friends in a corner, sits down, \nstill breathing heavily.\n\nPrice is on his cell-phone, trying to get reservations.\n\nMcDERMOTT \nBateman, you're looking a little wild-eyed rough \nday at the office?\n\nThey all laugh.\n\nMcDERMOTT \nHey, look-Price is back. And he's drinking \nPerrier. He s a changed man. Except...he still can't \nget a reservation to save his life.\n\nBateman sits down silently.\n\nMcDERMOTT \nWhy don't you try I 50 Wooster? Just fucking call them.\n\n<b>BATEMAN \n</b>(On automatic) \nI'm not going anywhere unless we \nhave a reservation.\n\nVAN PATTEN Le Cirque, Flamingo East, Oyster Bar, come on, \nfaggots-just get a res.\n\n<b>PRICE \n</b>Keep your shirt on. Maybe lose the suspenders.\n\nBateman spots HAROLD CARNES at the bar, tenses. \n\n<b>BATEMAN \n</b>(He downs his drink) \nExcuse me, gentlemen. Right back.\nHe approaches Carnes cautiously. \n\n<b>CARNES \n</b>Face it-the Japanese will own most of this country by the \nend of the '90s.\n\nBateman approaches, trying to act casual.\n\n<b>BATEMAN \n</b>Shut up, Carnes, they will not.\n\nCarnes is surprised, turns around, looks vaguely confused.\n\n<b>BATEMAN \n</b>So, Harold, did you get my message?\n\nCarnes lights a cigarette, stalling. Then laughs.\n\n<b>CARNES \n</b>Jesus, Davis. Yes. That was hilarious. That was you, \nwasn't it?\n\n<b>BATEMAN \n</b>(Waving smoke out of his face) \nYes, naturally.\n\n<b>CARNES \n</b>Bateman killing Owen and the escort girls? Oh that s \nfabulous. That's rich...\n\nPause\n\n<b>CARNES \n</b>It was a pretty long message, wasn't it?\n\n<b>BATEMAN \n</b>What exactly do you mean?\n\n<b>CARNES \n</b>The message you left.\n\nCarnes is distracted, waving at people.\n\n<b>CARNES \n</b>By the way Davis, how is Cynthia? You're still \nseeing her, right?\n\n<b>BATEMAN \n</b>But wait, Harold, what do you mean?\n\nCarnes isn't really listening.\n\n<b>CARNES \n</b>Excuse me. Nothing. Good to see you. Is that Edward Towers?\n\nHe turns to go.\n\n<b>BATEMAN \n</b>Carnes? Wait.\n\n<b>CARNES \n</b>(Sighing) \nDavis. I'm not one to bad-mouth anyone, your joke was amusing. \nBut come on, man, you had one fatal flaw: Bateman's such a dork, \nsuch a boring, spineless lightweight, that I couldn't fully \nappreciate it. I wasn't fooled for a second. Now, if you'd said \nPrice, or McDermott...Otherwise, it was amusing. Now, let's \nhave lunch or dinner or something. Hilarious, Davis. A killer.\n\n<b>BATEMAN \n</b>What are you talking about? Bateman is what?\n\n<b>CARNES \n</b>Oh Christ. He can barely pick up an escort girl, let \nalone...what was it you said he did to her?\n\nCarnes looks around the club, raises his glass to a passing \ncouple. He laughs politely.\n\n<b>CARNES \n</b>Now, if you'll excuse me, I really must...\n\n<b>BATEMAN \n</b>(Desperate, shouting) \nWait. Stop. You don't seem to understand. You're not really \ncomprehending any of this. I killed him. I did it, Carnes. \nI'm Patrick Bateman. I chopped Owen's fucking head off. \nI tortured dozens of girls. The whole message I left on your \nmachine was true.\n\n<b>CARNES \n</b>Excuse me. I really must he going.\n\n<b>BATEMAN \n</b>No! Listen, don't you know who I am? I'm not Davis, I'm \nPatrick Bateman! I talk to you on the phone all the time! \nDon't you recognize me? You're my lawyer.\n\nCarnes stares at him in confusion and annoyance.\n\n<b>BATEMAN \n</b>Now, Carnes, listen to me. Listen very, very carefully. I killed \nPaul Owen and I liked it. I can't make myself any clearer\n\n<b>CARNES \n</b>But that's simply not possible. And I don't find \nthis funny anymore.\n\n<b>BATEMAN \n</b>It never was supposed to he! Why isn't it possible?\n\n<b>CARNES \n</b>(Eyeing Bateman worriedly)\nIt's just not.\n\n<b>BATEMAN \n</b>Why not, you stupid bastard?\n\nCarnes stares at him.\n\n<b>CARNES \n</b>Because I had dinner with Paul Owen twice in \nLondon...just ten days ago.\n\n<b>BATEMAN \n</b>No, you...didn't?\n\n<b>CARNES \n</b>Now, if you'll excuse me.\n\nBateman returns back to his friends' table, in a daze.\nThey are all looking at the television, where Ronald \nReagan is giving a speech about Iran Contra. They are \nhalfheartedly arguing about whether or not he's \nlying.\n\n<b>PRICE \n</b>How can he lie like that? How can he pull that shit?\n\n<b>VAN PATTEN \n</b>What shit? Now where do we have reservations at? \nI mean I'm not really hungry, but I would like to have \nreservations somewhere.\n\n<b>PRICE \n</b>(To Bateman) \nI don't believe it. He looks so...normal. He seems so...\nout of it. So...undangerous.\n\nMcDERMOTT \nHe is totally harmless you geek. Was totally harmless.\nJust like you are totally harmless. But he did do all that \nshit and you have failed lo get us into I 50, so, you know, \nwhat can I say?\n\n<b>PRICE \n</b>I just don't see how someone, anyone, can appear that \nway and yet be involved in such total shit. How can you be so \nfucking, I don't know, cool about it?\n\n<b>VAN PATTEN \n</b>Some guys are just born cool, I guess.\n\nBateman laughs at this. Price shoots him a look.\n\n<b>PRICE \n</b>And Bateman, what are YOU SO fucking zany about?\n\n<b>BATEMAN \n</b>I'm just a happy camper. Rockin' and a-rollin'.\n<b>VAN PATTEN \n</b>(To Price) Rehab's done wonders for you, pal. \nWorking for UNICEF now?\n\nMcDERMOTT \nDo you want another Perrier Timothy? Some seltzer water?\n\n<b>PRICE \n</b>Oh brother look-he presents himself as a harmless \nOld codger. But inside...\n\nPause.\n\n<b>PRICE \n</b>But inside...\n\nThe SOUNDS OF THE BAR FADE AWAY and we hear Bateman's thoughts:\n\n<b>BATEMAN (V.O.) \n</b>But inside doesn't matter...\n\n<b>THE SOUNDS OF THE BAR RETURN.\n</b>\nMcDERMOTT \n(Bored)\nInside? Yes, inside? Believe it or not, Price we're actually \nlistening to you.\n\n<b>PRICE \n</b>Bateman? Come on, what do you think? \n\nBateman looks up and smiles at Price. Then shrugs.\n\n<b>BATEMAN \n</b>Whatever.\n\nThe conversation breaks up as Van Patten takes out his phone. \n\n<b>VAN PATTEN \n</b>Whose moronic idea was it to drink dry beers? I need a Scotch.\n\nThe sounds of the bar fade down. The following voiceover runs \nover images of Bateman and his friends ordering drinks, talking \non portable phones, talking, laughing - combined with images of \nother very similar young men at other tables drinking, talking \non portable phones, talking, laughing,\n\n<b>BATEMAN (V.O.)\n</b>There are no more barriers to cross. All I have in common with \nthe uncontrollable and the insane, the vicious and the evil, \nall the mayhem I have caused and my utter indifference toward \nit, I have now surpassed...\n\n<b>INT. BATEMAN'S OFFICE - DAY\n</b>\nJean is alone in Bateman's office, looking through his diary. \nWe see the pages that she is looking at. They are filled with \ndoodles of mutilated women and their names...Jean looks lost \nand frightened, and begins to cry.\n\n<b>BATEMAN (V.O.)\n</b>My pain is constant and sharp and I do not hope for a better \nworld for anyone. I fact I want my pain to be inflicted on \nothers. I want no escape.\n\n<b>INT. HARRY'S BAR - EARLY EVENING \n</b>As the film ends the camera moves CLOSE on Bateman. He is \nleaning back in his leather armchair, drinking a double Scotch, \nhis eyes blank.\n\n<b>BATEMAN (V.O.)\n</b>But even after admitting this, there is no catharsis. I gain no \ndeeper knowledge about myself, no new knowledge can be extracted \nfrom my telling. There has been no reason for me to tell you any \nof this. This confession has meant nothing...\n\nThe camera moves up to a sign on the wall behind him: \n<b>\"THIS IS NOT AN EXIT.\"\n</b>\n<b>CREDITS ROLL\n</b>\n\n\n\n\n\n</pre>\n\n\n\n\n\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>American Psycho</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Matthew Markwalder\" title=\"Scripts by Matthew Markwalder\">Matthew Markwalder</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/American Psycho Script.html#comments\" title=\"American Psycho comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:58:35.299340"}