{"title": "American Beauty", "film_link": "/Movie Scripts/American Beauty Script.html", "script_link": "/scripts/American-Beauty.html", "info_raw": "\n\nAmerican Beauty Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.30 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Alan Ball\nGenres  Drama\n\nRead \"American Beauty\" Script\n\n\n", "script": "\nINT. FITTS HOUSE - RICKY'S BEDROOM - NIGHT\n\nOn VIDEO: JANE BURNHAM lays in bed, wearing a tank top. She's\nsixteen, with dark, intense eyes.\n\n                    JANE\n          I need a father who's a role model, not\n          some horny geek-boy who's gonna spray his\n          shorts whenever I bring a girlfriend home\n          from school.\n              (snorts)\n          What a lame-o. Somebody really should put\n          him out of his misery.\n\nHer mind wanders for a beat.\n\n                    RICKY (O.C.)\n          Want me to kill him for you?\n\nJane looks at us and sits up.\n\n                    JANE\n              (deadpan)\n          Yeah, would you?\n\n                                               FADE TO BLACK.\n\n                                                        FADE IN:\n\nEXT. ROBIN HOOD TRAIL - EARLY MORNING\n\nWe're FLYING above suburban America, DESCENDING SLOWLY toward\na tree-lined street.\n\n                    LESTER (V.O.)\n          My name is Lester Burnham. This is my\n          neighborhood. This is my street. This...\n          is my life. I'm forty-two years old. In\n          less than a year, I'll be dead.\n\nINT. BURNHAM HOUSE - MASTER BEDROOM - CONTINUOUS\n\nWe're looking down at a king-sized BED from OVERHEAD:\n\nLESTER BURNHAM lies sleeping amidst expensive bed linens,\nface down, wearing PAJAMAS. An irritating ALARM CLOCK RINGS.\nLester gropes blindly to shut it off.\n\n                    LESTER (V.O.)\n          Of course, I don't know that yet. He\n          rolls over, looks up at us and sighs. He\n          doesn't seem too thrilled at the prospect\n          of a new day.\n\n\n                                                   (CONTINUED)\n\n                                                              2.\nCONTINUED:\n\n\n                    LESTER (V.O.) (CONT'D)\n          And in a way, I'm dead already.\n\nHe sits up and puts on his slippers.\n\nINT. BURNHAM HOUSE - MASTER BATH - MOMENTS LATER\n\nLester thrusts his face directly into a steaming hot shower.\n\nANGLE from outside the shower: Lester's naked body is\nsilhouetted through the fogged-up glass door. It becomes\napparent he is masturbating.\n\n                     LESTER (V.O.)\n              (amused)\n          Look at me, jerking off in the shower.\n              (then)\n          This will be the high point of my day.\n          It's all downhill from here.\n\nEXT. BURNHAM HOUSE - MOMENTS LATER\n\nCLOSE on a single, dewy AMERICAN BEAUTY ROSE. A gloved hand\nwith CLIPPERS appears and SNIPS the flower off.\n\nCAROLYN BURNHAM tends her rose bushes in front of the Burnham\nhouse. A very well-put together woman of forty, she wears\ncolor-coordinated gardening togs and has lots of useful and\nexpensive tools.\n\nLester watches her through a WINDOW on the first floor,\npeeping out through the drapes.\n\n                    LESTER (V.O.)\n          That's my wife Carolyn. See the way the\n          handle on those pruning shears matches\n          her gardening clogs? That's not an\n          accident.\n\nEXT. JIMS' HOUSE - CONTINUOUS\n\nIn the fenced front yard of the house next door, a dog BARKS\nrepeatedly. A MAN in a conservative suit (JIM #1) chastises\nthe barking dog.\n\n                    JIM #1\n          Hush, Bitsy. You hush. What is wrong?\n\n                    LESTER (V.O.)\n          That's our next-door neighbor Jim.\n\nA second MAN in a conservative suit (JIM #2) comes out of the\nhouse.\n\n                                                    (CONTINUED)\n\n                                                              3.\nCONTINUED:\n\n\n                    LESTER (V.O.) (CONT'D)\n          And that's his lover, Jim.\n\n                    JIM #2\n              (re: barking dog)\n          What in the world is wrong with her? She\n          had a walk this morning.\n\n                    JIM #1\n          And a jerky treat.\n\n                    JIM #2\n          You spoil her.\n              (sternly)\n          Bitsy. No bark. Come inside. Now.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nLester watches all this from the window.\n\n                    CAROLYN\n          Good morning, Jim!\n\nJim #1 walks toward the fence to greet Carolyn.\n\n                    JIM #1\n          Morning, Carolyn.\n\n                    CAROLYN\n              (overly friendly)\n          I just love your tie! That color!\n\n                    JIM #1\n          I just love your roses. How do you get\n          them to flourish like this?\n\n                    CAROLYN\n          Well, I'll tell you. Egg shells and\n          Miracle Grow.\n\nJim #1 and Carolyn continue to chat, unaware that Lester is\nwatching them.\n\n                    LESTER (V.O.)\n          Man. I get exhausted just watching her.\n\nLester's POV: We can't hear what Jim and Carolyn are saying,\nbut she's overly animated, like a TV talk show host.\n\n                    LESTER (V.O.) (CONT'D)\n          She wasn't always like this. She used to\n          be happy. We used to be happy.\n\n                                                              4.\n\n\n\nINT. BURNHAM HOUSE - JANE'S ROOM - CONTINUOUS\n\nJANE is seated at her desk, working at her computer.\n\n                    LESTER (V.O.)\n          My daughter Jane. Only child.\n\nCLOSE on the COMPUTER MONITOR: A PERSONAL BANKING SOFTWARE\nwindow suddenly disappears to reveal another window: a\nPLASTIC SURGERY WEBSITE, featuring clinical \"before\" and\n\"after\" photos of surgically augmented breasts.\n\n                    LESTER (V.O.) (CONT'D)\n          Janie's a pretty typical teenager. Angry,\n          insecure, confused. I wish I could tell\n          her that's all going to pass...\n\nOutside, a CAR HORN BLARES. Jane stuffs items into her\nBACKPACK.\n\n                    LESTER (V.O.) (CONT'D)\n          But I don't want to lie to her.\n\nWe HEAR the CAR HORN again from outside. Jane studies herself\nin a mirror, then shifts to get a good profile of her\nbreasts.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nCarolyn stands next to a platinum-colored MERCEDES-BENZ\nML320, reaching in through the drivers' window to blow the\nHORN again.\n\nJane shuffles out of the house, her backpack slung over her\nshoulder.\n\n                    CAROLYN\n          Jane. Honey. Are you trying to look\n          unattractive?\n\n                    JANE\n          Yes.\n\n                     CAROLYN\n          Well, congratulations. You've succeeded\n          admirably.\n\nJane gets in the car. Lester hurries out the front door,\ncarrying a BRIEFCASE.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                             5.\nCONTINUED:\n\n\n                    CAROLYN (CONT'D)\n          Lester, could you make me a little later,\n          please? Because I'm not quite late\n          enough.\n\nLester's briefcase suddenly springs open and his papers spill\nall over the driveway. He drops to his knees to gather\neverything.\n\n                    JANE\n          Nice going, Dad.\n\nLester smiles sheepishly, trying to lighten the moment.\n\nHis POV: Carolyn looks down at us, contemptuous but also\nbored, as if she gave up expecting anything more long ago.\n\n                    LESTER (V.O.)\n          Both my wife and daughter think I'm this\n          gigantic loser, and... they're right.\n\nINT. MERCEDES-BENZ ML320 - A SHORT TIME LATER\n\nCarolyn is driving; Jane stares out the window. Lester is\nasleep in the back seat.\n\n                    LESTER (V.O.)\n          I have lost something. I'm not exactly\n          sure what it is, but I know I didn't\n          always feel this... sedated. But you know\n          what? It's never too late to get it back.\n\nINT. OFFICE BUILDING - DAY\n\nLester sits at his workstation, a BEIGE CUBICLE surrounded by\nIDENTICAL BEIGE CUBICLES. He's staring at a computer monitor\nand talking on a HEADSET PHONE. The beleaguered expression on\nhis face is at odds with the light, friendly tone of his\nvoice.\n\n                    LESTER\n          Hello, this is Lester Burnham from Media\n          Monthly magazine, I'm calling for Mr.\n          Tamblin, please?... Well, we're all under\n          a deadline here, uh, but you see, there\n          is some basic information about the\n          product launch that isn't even covered in\n          your press release and I... Yeah. Can I\n          ask you a question? Who is Tamblin? Does\n          he exist? 'Cause he doesn't ever seem to\n          come in... Yeah, okay, I'll leave my\n          number...\n\n\n                                                 (CONTINUED)\n\n                                                              6.\nCONTINUED:\n\n\nBRAD, a dapper man in his thirties, approaches and observes\nLester, who is unaware of his presence.\n\n                    LESTER (CONT'D)\n          It's 555 0199. Lester Burnham. Thank you!\n\nLester disconnects the call, obviously irritated.\n\n                    BRAD\n          Hey Les. You got a minute?\n\nLester turns around, smiling perfunctorily\n\n                    LESTER\n          For you, Brad? I've got five.\n\nINT. BRAD'S OFFICE - MOMENTS LATER\n\nBrad is seated behind his desk in his big corner office.\n\n                    BRAD\n          I'm sure you can understand our need to\n          cut corners around here.\n\nLester sits across from him, looking small and isolated.\n\n                    LESTER\n          Oh, sure. Times are tight, and you gotta\n          free up cash. Gotta spend money to make\n          money. Right?\n\n                    BRAD\n          Exactly. So...\n\nBrad stands, ready to usher Lester out.\n\n                    LESTER\n              (blurts)\n          Like the time when Mr. Flournoy used the\n          company MasterCard to pay for that\n          hooker, and then she used the card\n          numbers and stayed at the St. Regis for,\n          what was it, like, three months?\n\n                    BRAD\n              (startled)\n          That's unsubstantiated gossip.\n\n                    LESTER\n          That's fifty thousand dollars. That's\n          somebody's salary. That's somebody who's\n          gonna get fired because Craig has to pay\n          women to fuck him!\n\n                                                    (CONTINUED)\n\n                                                             7.\nCONTINUED:\n\n\n                    BRAD\n          Jesus. Calm down. Nobody's getting fired\n          yet. That's why we're having everyone\n          write out a job description, mapping out\n          in detail how they contribute. That way,\n          management can assess who's valuable and--\n\n                    LESTER\n          Who's expendable.\n\n                    BRAD\n          It's just business.\n\n                    LESTER\n              (angry)\n          I've been writing for this magazine for\n          fourteen years, Brad. You've been here\n          how long, a whole month?\n\n                    BRAD\n              (frank)\n          I'm one of the good guys, Les. I'm trying\n          to level with you. This is your one\n          chance to save your job.\n\nLester stares at him, powerless.\n\nEXT. BURNHAM HOUSE - LATE AFTERNOON\n\nA MOVING VAN is parked in front of the COLONIAL HOUSE next\ndoor to the Burnhams'. Movers carry furniture toward the\nhouse.\n\nThe Mercedes-Benz pulls into the Burnham driveway. Carolyn\ndrives, Lester is in the passenger seat.\n\n                    CAROLYN\n          --there is no decision, you just write\n          the damn thing!\n\n                    LESTER\n          You don't think it's weird and kinda\n          fascist?\n\n                    CAROLYN\n          Possibly. But you don't want to be\n          unemployed.\n\n                    LESTER\n          Oh, well, let's just all sell our souls\n          and work for Satan, because it's more\n          convenient that way.\n\n\n                                                    (CONTINUED)\n\n                                                              8.\nCONTINUED:\n\n\n                    CAROLYN\n          Could you be just a little bit more\n          dramatic, please, huh?\n\nAs they get out of the car, Carolyn scopes out the MOVERS\nnext door.\n\n                    CAROLYN (CONT'D)\n          So we've finally got new neighbors. You\n          know, if the Lomans had let me represent\n          them, instead of--\n              (heavy disdain)\n          --\"The Real Estate King,\" that house\n          would never have sat on the market for\n          six months.\n\nShe heads into the house, followed by Lester.\n\n                    LESTER\n          Well, they were still mad at you for\n          cutting down their sycamore.\n\n                    CAROLYN\n          Their sycamore? C'mon! A substantial\n          portion of the root structure was on our\n          property. You know that. How can you call\n          it their sycamore? I wouldn't have the\n          heart to just cut down something if it\n          wasn't partially mine, which of course it\n          was.\n\nINT. BURNHAM HOUSE - DINING ROOM - LATER THAT NIGHT\n\nWe HEAR EASY-LISTENING MUSIC.\n\nLester, Carolyn and Jane are eating dinner by CANDLELIGHT.\nRED ROSES are bunched in a vase at the center of the table.\nNobody makes eye contact, or even seems aware of anybody\nelse's presence, until...\n\n                    JANE\n          Mom, do we always have to listen to this\n          elevator music?\n\n                    CAROLYN\n              (considers)\n          No. No, we don't. As soon as you've\n          prepared a nutritious yet savory meal\n          that I'm about to eat, you can listen to\n          whatever you like.\n\nA long beat. Lester suddenly turns to Jane.\n\n\n                                                 (CONTINUED)\n\n                                                             9.\nCONTINUED:\n\n\n                    LESTER\n          So Janie, how was school?\n\n                    JANE\n              (suspicious)\n          It was okay.\n\n                       LESTER\n          Just okay?\n\n                    JANE\n          No, Dad. It was spec-tac-ular.\n\nA beat.\n\n                    LESTER\n          Well, you want to know how things went at\n          my job today?\n\nNow she looks at him as if he's lost his mind.\n\n                     LESTER (CONT'D)\n          They've hired this efficiency expert,\n          this really friendly guy named Brad, how\n          perfect is that? And he's basically there\n          to make it seem like they're justified in\n          firing somebody, because they couldn't\n          just come right out and say that, could\n          they? No, no, that would be too...\n          honest. And so they've asked us--\n              (off her look)\n          --you couldn't possibly care any less,\n          could you?\n\nCarolyn is watching this closely.\n\n                    JANE\n              (uncomfortable)\n          Well, what do you expect? You can't all\n          of a sudden be my best friend, just\n          because you had a bad day.\n\nShe gets up and heads toward the kitchen.\n\n                    JANE (CONT'D)\n          I mean, hello. You've barely even spoken\n          to me for months.\n\nShe's gone. Lester notices Carolyn looking at him critically.\n\n                    LESTER\n          Oh, what, you're mother-of-the-year? You\n          treat her like an employee.\n\n                                                    (CONTINUED)\n\n                                                            10.\nCONTINUED: (2)\n\n\n                    CAROLYN\n              (taken aback)\n          What?!\n\nLester is quiet, staring at his plate.\n\n                    CAROLYN (CONT'D)\n              (more authority)\n          What?\n\nLester gets up and starts after Jane, taking his plate with\nhim.\n\n                    LESTER\n          I'm going to get some ice cream.\n\nCarolyn watches him go, irritated.\n\nINT. BURNHAM HOUSE - CONTINUOUS\n\nJane stands at the sink, rinsing off her plate. Lester\nenters.\n\n                    LESTER\n          Honey, I'm sorry. I...\n\nJane turns and stares at him, waiting for him to finish.\n\n                    LESTER (CONT'D)\n          I'm sorry I haven't been more available,\n          I just... I'm...\n\nHe's looking to her for a little help here, but she's too\nuncomfortable with this sudden intimacy to give him any.\n\n                    LESTER (CONT'D)\n              (finally)\n          You know, you don't always have to wait\n          for me to come to you...\n\n                    JANE\n          Oh, great. So now it's my fault?\n\n                    LESTER\n          I didn't say that. It's nobody's fault.\n          Janie, what happened? You and I used to\n          be pals.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nOn VIDEO: We're looking through GREENHOUSE WINDOWS at Lester\nand Jane in the kitchen We can't hear what they're saying,\nbut it's obvious it's not going well.\n\n                                                    (CONTINUED)\n\n                                                             11.\nCONTINUED:\n\n\nJane puts her plate in the dishwasher and leaves. We FOLLOW\nHER out the door, then the camera JERKS back to Lester\ncalling after her.\n\nCLOSE on the face of   RICKY FITTS, illuminated by the screen\nof his DIGICAM as he   videotapes. Ricky is eighteen, but his\neyes are much older.   Beneath his Zen-like tranquility lurks\nsomething wounded...   and dangerous.\n\nHis POV, on VIDEO: Through the kitchen window, we see Lester\nat the sink, rinsing off his plate, muttering to himself. His\nhead suddenly jerks up and he looks at us, as if he realizes\nhe's being watched.\n\nINT. BURNHAM HOUSE - KITCHEN - CONTINUOUS\n\nLester's POV: We're looking out through the kitchen window at\nthe point where Ricky was just standing, but he's no longer\nthere.\n\nLester turns off the faucet, dries his hands, then tosses the\ntowel on the counter on his way out, where it lands next to a\nframed PHOTOGRAPH of Lester, Carolyn, and a much-younger\nJane, taken several years earlier at an amusement park.\n\nIt's startling how happy they look.\n\nEXT. SALE HOUSE - DAY\n\nCLOSE on a wooden SIGN that reads:\n\nOPEN HOUSE TODAY\n\nBURNHAM & ASSOCIATES REALTY\n\n555-0195 Carolyn Burnham\n\nThe sign is planted in front of a RUN-DOWN HOME in a   run-down\nneighborhood. The Mercedes is parked in front of the   house.\nCarolyn, wearing a smart business suit, is unloading   a box of\ncleaning supplies and a BOOMBOX from the back of the   Mercedes\nwhen something across the street catches her eye.\n\nHer POV: In front of a different house with much more curb\nappeal is another SIGN, featuring a picture of a handsome\nsilver-haired MAN. It reads:\n\nAnother One SOLD By Buddy Kane\n\nThe Real Estate King 555-0100\n\nCarolyn frowns and slams the back of the Mercedes shut.\n\n                                                            12.\n\n\n\nINT. SALE HOUSE - LIVING ROOM - MOMENTS LATER\n\nThe interior of this house is ugly, oppressive and tasteless.\nCarolyn opens the front door, breathes deeply and solemnly\nannounces:\n\n                    CAROLYN\n          I will sell this house today.\n\nShe neatly arranges her sales materials on a desk, then\nstrips down to her undergarments.\n\n                                                       MONTAGE:\n\nWe see Carolyn, working with fierce concentration as she:\n\nCleans glass doors that overlook the patio and pool;\n\nDoggedly scrubs countertops in the kitchen;\n\nPerches on a stepladder to dust a cheap-looking ceiling fan\nin the master bedroom;\n\nAnd vacuums a dirty carpet that will never be clean.\n\nThroughout all this, she keeps repeating to herself:\n\n                    CAROLYN (CONT'D)\n          I will sell this house today. I will sell\n          this house today. I will sell this house\n          today.\n\nINT. SALE HOUSE - BATHROOM - LATER\n\nCarolyn stands in front of the mirror, wearing her suit once\nmore, applying lipstick. She stares at her reflection\ncritically.\n\n                    CAROLYN\n          I will sell this house today.\n\nShe says this as if it were a threat, then notices a smudge\non the mirror and wipes it off.\n\nEXT. SALE HOUSE - FRONT YARD - LATER\n\nThe front door opens to reveal Carolyn, greeting us with the\nsmile she thinks could sell ice to an Eskimo.\n\n                    CAROLYN\n          Welcome. I'm Carolyn Burnham!\n\n                                                            13.\n\n\n\nINT. SALE HOUSE - FOYER - CONTINUOUS\n\nSmiling, Carolyn leads a man and woman into the living room.\nThey're thirtyish, and they've seen a lot of houses today.\n\n                    CAROLYN\n          This living room is very dramatic. Wait\n          'til you see the native stone fireplace!\n\nThe man and woman glance around the dark room, unimpressed.\n\n                    CAROLYN (CONT'D)\n          A simple cream would really lighten\n          things up. You could even put in a\n          skylight.\n\nThe woman wrinkles her face, skeptical.\n\n                    CAROLYN (CONT'D)\n          Well, why don't we go into the kitchen?\n\nINT. SALE HOUSE - KITCHEN - LATER\n\nCarolyn enters, followed by a different couple in their\nfifties.\n\n                    CAROLYN\n          It's a dream come true for any cook. Just\n          filled with positive energy. Huh?\n\nINT. SALE HOUSE - MASTER BEDROOM - LATER\n\nCarolyn stands with a different couple: African American,\nlate twenties. The woman is pregnant.\n\n                    CAROLYN\n          ...and you'll be surprised how much a\n          ceiling fan can cut down on your energy\n          costs.\n\nEXT. SALE HOUSE - BACK YARD - LATER\n\nCarolyn stands by the pool next to two fortyish WOMEN.\n\n                    CAROLYN\n          You know, you could have some really fun\n          backyard get-togethers out here.\n\n                    WOMAN #1\n          The ad said this pool was \"lagoon-like.\"\n          There's nothing \"lagoon-like\" about it.\n          Except for maybe the bugs.\n\n\n                                                    (CONTINUED)\n\n                                                            14.\nCONTINUED:\n\n\n                    WOMAN #2\n          There's not even any plants out here.\n\n                    CAROLYN\n              (re: shrub)\n          What do you call this? Is this not a\n          plant? If you have a problem with the\n          plants, I can always call my landscape\n          architect. Solved.\n\n                    WOMAN #2\n          I mean, I think \"lagoon,\" I think\n          waterfall, I think tropical. This is a\n          cement hole.\n\nA beat.\n\n                    CAROLYN\n          I have some tiki torches in the garage.\n\nINT. SALE HOUSE - SUN ROOM - LATER\n\nCarolyn enters, alone. She's furious. She locks the sliding\nglass door and starts to pull the vertical blinds shut, then\nstops. Standing very still, with the blinds casting shadows\nacross her face, she starts to cry: brief, staccato SOBS that\nseemingly escape against her will. Suddenly she SLAPS\nherself, hard.\n\n                    CAROLYN\n          Shut up. Stop it. You... Weak!\n\nBut the tears continue. She SLAPS herself again.\n\n                    CAROLYN (CONT'D)\n          Weak. Baby. Shut up. Shut up! Shut up!\n\nShe SLAPS herself repeatedly until she stops crying. She\nstands there, taking deep breaths until she has everything\nunder control, then pulls the blinds shut, once again all\nbusiness. She walks out calmly, leaving us alone in the dark,\nempty room.\n\nWe HEAR CHEERING and APPLAUSE.\n\nINT. HIGH SCHOOL GYMNASIUM - NIGHT\n\nWe're at a high-school BASKETBALL GAME. Teenage boys play a\nfast and furious game. One team wearing pale blue and white\nuniforms scores a basket. Perky cheerleaders jump up and down\nas the CROWD goes wild.\n\n\n\n                                                    (CONTINUED)\n\n                                                            15.\nCONTINUED:\n\n\nSeated in the bleachers, next to the high school BAND, is a\ngroup of about twenty TEENAGE GIRLS, dressed in pale blue and\nwhite uniforms. Among them, Jane sits next to ANGELA HAYES.\nAt sixteen, Angela is strikingly beautiful; with perfect even\nfeatures, blonde hair and a nubile young body, she's the\narchetypal American dream girl.\n\nJane stands and scans the bleachers.\n\n                    ANGELA\n          Who are you looking for?\n\n                    JANE\n          My parents are coming tonight. They're\n          trying to, you know, take an active\n          interest in me.\n\n                    ANGELA\n          Gross. I hate it when my mom does that.\n\n                    JANE\n          They're such assholes. Why can't they\n          just have their own lives?\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn drives. Lester is slumped in the passenger seat.\n\n                    LESTER\n          What makes you so sure she wants us to be\n          there? Did she ask us to come?\n\n                    CAROLYN\n          Of course not. She doesn't want us to\n          know how important this is to her. But\n          she's been practicing her steps for\n          weeks.\n\n                    LESTER\n          Well, I bet money she's going to resent\n          it. And I'm missing the James Bond\n          marathon on TNT.\n\n                    CAROLYN\n          Lester, this is important. I'm sensing a\n          real distance growing between you and\n          Jane.\n\n                    LESTER\n          Growing? She hates me.\n\n                    CAROLYN\n          She's just willful.\n\n                                                    (CONTINUED)\n\n                                                             16.\nCONTINUED:\n\n\n                    LESTER\n          She hates you too.\n\nCarolyn stares at him, unsure of how to respond.\n\nINT. HIGH SCHOOL GYMNASIUM - LATER\n\nThe uniformed girls now stand in formation on the gym floor.\n\n                    ANNOUNCER\n              (over P.A.)\n          And now, for your half-time\n          entertainment, Rockwell High's award-\n          winning Dancing Spartanettes!\n\nIn the crowded stands, Lester and Carolyn find seats.\n\n                    LESTER\n          We can leave right after this, right?\n\nThe HIGH SCHOOL BAND plays \"ON BROADWAY.\" On the gym floor,\nthe girls perform. They're well-rehearsed, but too young to\ncarry off the ambitious Vegas routine they're attempting.\n\nLester, watching from the stands, picks out his daughter.\n\nHis POV: Jane performs well, concentrating. Dancing awkwardly\nnext to her is Angela. Suddenly Angela looks right at us and\nsmiles... a lazy, insolent smile.\n\nLester leans forward in his seat.\n\nHis POV: We're focused on Angela now. Everything starts to\nSLOW DOWN... the MUSIC acquires an eerie ECHO...\n\nWe ZOOM slowly toward Lester as he watches, transfixed.\n\nHis POV: Angela's awkwardness gives way to a fluid grace, and\n\"ON BROADWAY\" FADES into dreamy, hypnotic MUSIC. The light on\nAngela grows stronger, and the other girls DISAPPEAR\nentirely.\n\nLester is suddenly alone in the stands, spellbound.\n\nHis POV: Angela looks directly at us now, dancing only for\nLester. Her movements take on a blatantly erotic edge as she\nstarts to unzip her uniform, teasing us with an expression\nthat's both innocent and knowing, then... she pulls her\nuniform OPEN and a profusion of RED ROSE PETALS spill\nforth... and we SMASH CUT TO:\n\n                                                            17.\n\n\n\nINT. HIGH SCHOOL GYMNASIUM - CONTINUOUS\n\nAngela, fully clothed, is once again surrounded by the other\ngirls. The HIGH SCHOOL BAND plays its last note, the Dancing\nSpartanettes strike their final pose, and the audience\nAPPLAUDS.\n\nCarolyn claps along with the rest of the audience. Lester\njust sits there, unable to take his eyes off Angela.\n\nEXT. HIGH SCHOOL GYMNASIUM - LATER\n\nThe game is long over. Jane and Angela come out of the gym.\n\n                    JANE\n          Oh shit, they're still here.\n\nHer POV: Lester and Carolyn stand at the edge of the parking\nlot.\n\n                    LESTER\n          Janie!\n\n                    CAROLYN\n          Hi! I really enjoyed that!\n\nShe crosses reluctantly toward her parents, followed by\nAngela.\n\n                    LESTER\n          Congratulations, honey, you were great.\n\n                    JANE\n          I didn't win anything.\n\n                    LESTER\n              (to Angela)\n          Hi, I'm Lester. Janie's dad.\n\n                    ANGELA\n          Oh. Hi.\n\nAn awkward beat.\n\n                    JANE\n          This is my friend, Angela Hayes.\n\n                    LESTER\n          Okay, good to meet you. You were also\n          good tonight. Very... precise.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            18.\nCONTINUED:\n\n\n                    ANGELA\n              (warming)\n          Thanks.\n\n                    CAROLYN\n              (to Angela)\n          Nice to meet you, Angela.\n              (to Jane)\n          Honey, I'm so proud of you. I watched you\n          very closely, and you didn't screw up\n          once.\n              (then, to Lester)\n          Okay, we have to go.\n\nShe starts toward the parking lot. Lester stays behind.\n\n                    LESTER\n          So, what are you girls doing now?\n\n                    JANE\n          Dad.\n\n                    ANGELA\n          We're going out for pizza.\n\n                    LESTER\n          Oh really, do you need a ride? We can\n          give you a ride. I have a car. You wanna\n          come with us?\n\n                    ANGELA\n          Thanks... but I have a car.\n\n                    LESTER\n          Oh, you have a car. Oh. That's great!\n          That's great, because Janie's thinking\n          about getting a car soon too, aren't you,\n          honey?\n\n                    JANE\n              (you freak)\n          Dad. Mom's waiting for you.\n\n                    LESTER\n          Well, it was very nice meeting you,\n          Angela. Any, uh, friend of Janie's is a\n          friend of mine.\n\nAngela smiles, aware of the power she has over him. He is\nmesmerized; grateful, even.\n\n                    LESTER (CONT'D)\n          Well... I'll be seeing you around then.\n\n                                                    (CONTINUED)\n\n                                                             19.\nCONTINUED: (2)\n\n\nLester waves awkwardly as he crosses off.\n\n                    JANE\n          Could he be any more pathetic?\n\n                    ANGELA\n          I think it's sweet. And I think he and\n          your mother have not had sex in a long\n          time.\n\nINT. BURNHAM HOUSE - MASTER BEDROOM - A FEW HOURS LATER\n\nCLOSE on a solitary red ROSE PETAL as it falls slowly through\nthe air.\n\nWe're looking down on Lester and Carolyn in bed. Even in\nsleep, Carolyn looks determined. Lester is awake and stares\nup at us.\n\n                    LESTER\n          It's the weirdest thing.\n\nThe ROSE PETAL drifts into view, landing on his pillow.\n\n                    LESTER (CONT'D)\n          I feel like I've been in a coma for about\n          twenty years, and I'm just now waking up.\n\nMore ROSE PETALS fall onto the bed, and he smiles up at...\n\nHis POV: Angela, naked, FLOATS above us as a deluge of ROSE\nPETALS falls around her. Her hair fans out around her head\nand GLOWS with a subtle, burnished light. She looks down at\nus with a smile that is all things...\n\nLester smiles back and LAUGHS, as ROSE PETALS cover his face.\n\n                    LESTER (CONT'D)\n          Spec-tac-ular.\n\nEXT. ROBIN HOOD TRAIL - CONTINUOUS\n\nA WHITE BMW 328si CONVERTIBLE is parked on the street outside\nthe Burnham's house. We HEAR girlish LAUGHTER from inside.\n\nINT. ANGELA'S BMW - CONTINUOUS\n\nAngela is behind the wheel, Jane in the passenger seat.\nThey're passing a JOINT back and forth.\n\n                    JANE\n          I'm sorry my dad was so weird tonight.\n\n\n                                                   (CONTINUED)\n\n                                                          20.\nCONTINUED:\n\n\n                    ANGELA\n          It's okay. I'm used to guys drooling over\n          me. It started when I was about twelve,\n          I'd go out to dinner with my parents.\n          Every Thursday night, Red Lobster. And\n          every guy there would stare at me when I\n          walked in. And I knew what they were\n          thinking. Just like I knew guys at school\n          thought about me when they jerked off.\n\n                     JANE\n          Vomit.\n\n                    ANGELA\n          No, I liked it. And I still like it. If\n          people I don't even know look at me and\n          want to fuck me, it means I really have a\n          shot at being a model. Which is great,\n          because there's nothing worse in life\n          than being ordinary.\n\nAn awkward beat. Jane stares at the floor.\n\n                    JANE\n          I really think it'll happen for you.\n\n                    ANGELA\n          Oh, I know. Because everything that was\n          meant to happen, does. Eventually.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nOn VIDEO: Jane gets out of the car, still LAUGHING, and waves\nas Angela pulls away. We ZOOM toward Jane as she walks up the\ndriveway. She turns suddenly, sensing our presence.\n\nHer POV: We're looking at the COLONIAL HOUSE next door where\nthe moving van was parked earlier. The front porch is\nshrouded in darkness... then a PORCH LIGHT abruptly reveals\nRicky. As usual, he's dressed conservatively. There is a\nBEEPER attached to his belt, and his DIGICAM dangles loosely\naround his neck.\n\nIrritated, Jane stares at him, hard.\n\n                     JANE\n          Asshole.\n\nHe looks back at her curiously, then raises his Digicam and\nstarts to videotape her.\n\nHis POV, on VIDEO: Jane, angry and self-conscious, turns and\nwalks quickly toward her house, flipping us off as she goes.\n\n                                                             21.\n\n\n\nINT. BURNHAM HOUSE - FOYER - CONTINUOUS\n\nJane enters, closes and locks the door. She quickly TURNS OFF\nTHE LIGHT that's been left on for her, then peeks through a\nwindow.\n\nHer POV: There's no sign of Ricky.\n\nJane turns back into the room, her heart racing... and\nsmiles.\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - THE NEXT MORNING\n\nCLOSE on an ADDRESS BOOK: A man's hand flips to the H page\nand then his finger stops at the name Angela Hayes.\n\nLester, dressed for work, goes through Jane's address book.\nWe HEAR the SHOWER running in the adjacent bathroom. He grabs\nJane's phone and dials, then stands with the receiver to his\near, nervous.\n\n                    ANGELA\n              (over phone line)\n          Hello? Hello?\n\nLester is frozen, unable to speak. Suddenly, the SHOWER is\nturned off in the next room. Lester hangs up and exits\nquickly. A moment, then the PHONE RINGS. Jane emerges from\nthe bathroom, a towel wrapped around her torso, drying her\nwet hair. She picks up the PHONE.\n\n                      JANE\n          Hello?\n\nINT. HAYES HOUSE - ANGELA'S BEDROOM - CONTINUOUS\n\nAngela is sprawled across her bed, on the phone.\n\n                    ANGELA\n          Why'd you call me?\n\n                                     INTERCUT WITH JANE IN HER\n                                                      BEDROOM:\n\n                      JANE\n          I didn't.\n\n                    ANGELA\n          Well, my phone just rang and I answered\n          it and somebody hung up and then I star\n          sixty-nined and it called you back.\n\n\n\n                                                    (CONTINUED)\n\n                                                             22.\nCONTINUED:\n\n\n                    JANE\n          I was in the shower.\n\nThen Jane notices her address book open to the H page.\n\n                       JANE (CONT'D)\n          Oh, gross.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nOn VIDEO: We're across from Jane's WINDOW, looking in. Jane\npicks up the address book, frowning. She speaks into the\nphone, but we can't hear her.\n\n                    WOMAN'S VOICE (O.C.)\n              (sing song)\n          Rick-y! Break-fast!\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nRicky stands at his window, videotaping. He lowers his\nDigicam, but his eyes remain locked on Jane across the way.\n\n                    RICKY\n          Be right there.\n\nINT. FITTS HOUSE - KITCHEN - MOMENTS LATER\n\nBARBARA FITTS stands at the stove, flipping bacon strips\nmechanically, her eyes focused elsewhere. At least ten years\nyounger than her husband, she's pretty in a June Cleaver-ish\nway. The Colonel sits at a dinette reading The Wall Street\nJournal. Ricky enters.\n\n                       RICKY\n          Mom.\n\nStartled, Barbara turns to him.\n\n                       BARBARA\n          Hello.\n\nAs she attempts to serve him bacon:\n\n                    RICKY\n          I don't eat bacon, remember?\n\n                    BARBARA\n              (unnerved)\n          I'm sorry, I must have forgotten.\n\nRicky serves himself scrambled eggs from another pan, then\njoins his father at the table.\n\n                                                  (CONTINUED)\n\n                                                            23.\nCONTINUED:\n\n\n                    RICKY\n          What's new in the world, Dad?\n\n                    COLONEL\n          This country is going straight to hell.\n\nA DOORBELL rings. The Colonel and Barbara look at each other,\nalarmed.\n\n                    COLONEL (CONT'D)\n          Are you expecting anyone?\n\n                     BARBARA\n          No.\n                (thinks)\n          No.\n\nThe Colonel heads toward the living room, a little puffed up.\n\nINT. FITTS HOUSE - FOYER - MOMENTS LATER\n\nThe Colonel opens the front door to reveal the two JIMS.\n\n                     JIM #1\n          Hi.\n\n                    JIM #2\n          Welcome to the neighborhood.\n\nJim #1 holds out a basket filled with flowers, vegetables and\na small white cardboard box tied with raffia.\n\n                    JIM #1\n          Just a little something from our garden.\n\n                     JIM #2\n          Except for the pasta, we got that at\n          Fallaci's.\n\n                    JIM #1\n          It's unbelievably fresh. You just drop it\n          in the water and it's done.\n\nThe Colonel stares at them, suspicious.\n\n                    JIM #1 (CONT'D)\n              (offers his hand)\n          Jim Olmeyer. Two doors down. Welcome to\n          the neighborhood.\n\n                    COLONEL\n              (shakes)\n          Colonel Frank Fitts, U.S. Marine Corps.\n\n                                                    (CONTINUED)\n\n                                                             24.\nCONTINUED:\n\n\n                     JIM #1\n          Nice to meet you. And this is my\n          partner...\n\n                    JIM #2\n              (offers his hand)\n          Jim Berkley, but people call me J.B.\n\n                    COLONEL\n          Let's cut to the chase, okay? What are\n          you guys selling?\n\n                    JIM #2\n              (after a beat)\n          Nothing. We just wanted to say hi to our\n          new neighbors--\n\n                    COLONEL\n          Yeah, yeah, yeah. But you said you're\n          partners. So what's your business?\n\nThe Jims look at each other, then back at the Colonel.\n\n                    JIM #1\n          Well, he's a tax attorney.\n\n                    JIM #2\n          And he's an anesthesiologist.\n\nThe Colonel looks at them, confused. Then it dawns on him.\n\nINT. COLONEL'S FORD EXPLORER - LATER\n\nThe Colonel drives, staring darkly at the road ahead. In the\npassenger seat, Ricky is using a CALCULATOR and jotting\nnumbers down in a NOTEBOOK.\n\n                     COLONEL\n          How come these faggots always have to rub\n          it in your face? How can they be so\n          shameless?\n\n                    RICKY\n          That's the whole thing, Dad. They don't\n          feel like it's anything to be ashamed of.\n\nThe Colonel looks at Ricky sharply.\n\n                    COLONEL\n          Well, it is.\n\nA beat, as Ricky continues his calculations, before he\nrealizes a response is expected from him. Then:\n\n                                                   (CONTINUED)\n\n                                                             25.\nCONTINUED:\n\n\n                    RICKY\n          Yeah, you're right.\n\nThe Colonel's eyes flash angrily.\n\n                    COLONEL\n          Don't placate me like I'm your mother,\n          boy.\n\nRicky sighs, then looks at his father.\n\n                    RICKY\n          Forgive me, sir, for speaking so bluntly,\n          but those fags make me want to puke my\n          fucking guts out.\n\nThe Colonel is taken aback but quickly covers.\n\n                    COLONEL\n          Me too, son. Me too.\n\nCase closed, Ricky goes back to his calculations.\n\nCLOSE on the pencil in his hands: He's totaling two columns\nof NUMBERS. Under the column \"Income\" he writes in swift,\nbold strokes: $24,950.00.\n\nEXT. HIGH SCHOOL CAMPUS - A SHORT TIME LATER\n\nJane and Angela are standing with two other TEENAGE GIRLS.\n\n                    ANGELA\n          I'm serious, he just pulled down his\n          pants and yanked it out. You know, like,\n          say hello to Mr. Happy.\n\nTEENAGE GIRL #1\n\nGross.\n\n                    ANGELA\n          It wasn't gross. It was kind of cool.\n\nTEENAGE GIRL #1\n\nSo, did you do it with him?\n\n                    ANGELA\n          Of course I did. He is a really well-\n          known photographer? He shoots for Elle on\n          like, a regular basis? It would have been\n          so majorly stupid of me to turn him down.\n\n                                                            26.\n\n\n\nTEENAGE GIRL #2\n\nYou are a total prostitute.\n\n                    ANGELA\n          Hey. That's how things really are. You\n          just don't know, because you're this\n          pampered little suburban chick.\n\nTEENAGE GIRL #2\n\nSo are you. You've only been in Seventeen once, and you\nlooked fat, so stop acting like you're goddamn Christy\nTurlington.\n\nThe two TEENAGE GIRLS move away from Jane and Angela.\n\n                     ANGELA\n              (calling off)\n          Cunt!\n              (then)\n          I am so sick of people taking their\n          insecurities out on me.\n\nThe Colonel's Ford Explorer pulls up, and Ricky gets out.\n\n                    JANE\n          Oh my God. That's the pervert who filmed\n          me last night.\n\n                    ANGELA\n          Him? Jane. No way. He's a total lunatic.\n\n                    JANE\n          You know him?\n\n                    ANGELA\n          Yeah. We were on the same lunch shift\n          when I was in ninth grade, and he would\n          always say the most random, weird things,\n          and then one day, he was just like, gone.\n          And then, Connie Cardullo told me he his\n          parents had to put him in a mental\n          institution.\n\n                    JANE\n          Why? What did he do?\n\n                    ANGELA\n          What do you mean?\n\n\n\n\n                                                   (CONTINUED)\n\n                                                             27.\nCONTINUED:\n\n\n                    JANE\n          Well, they can't put you away just for\n          saying weird things.\n\nAngela stares at Jane, then her mouth widens into a smile.\n\n                    ANGELA\n          You total slut. You've got a crush on\n          him.\n\n                    JANE\n          What? Please.\n\n                    ANGELA\n          You were defending him! You love him. You\n          want to have like, ten thousand of his\n          babies.\n\n                     JANE\n          Shut up.\n\nJane suddenly finds Ricky standing in front of her.\n\n                    RICKY\n          Hi. My name's Ricky. I just moved next\n          door to you.\n\n                    JANE\n          I know. I kinda remember this really\n          creepy incident when you were filming me\n          last night?\n\n                    RICKY\n          I didn't mean to scare you. I just think\n          you're interesting.\n\nAngela shoots a wide-eyed look at Jane, who ignores it.\n\n                    JANE\n          Thanks, but I really don't need to have\n          some psycho obsessing about me right now.\n\n                    RICKY\n          I'm not obsessing. I'm just curious.\n\nHe looks at her intently, his eyes searching hers. Jane is\nunnerved and has to look away. Ricky smiles and walks off.\n\n                    ANGELA\n          What a freak. And why does he dress like\n          a Bible salesman?\n\n\n\n                                                   (CONTINUED)\n\n                                                            28.\nCONTINUED: (2)\n\n\n                    JANE\n          He's like, so confident. That can't be\n          real.\n\n                    ANGELA\n          I don't believe him. I mean, he didn't\n          even like, look at me once.\n\nINT. FITTS HOUSE - DEN - THAT NIGHT\n\nCLOSE on a TV SCREEN: \"Hogan's Heroes\" on Nick at Nite.\n\nThe Colonel and Barbara are seated on a couch, watching\ntelevision. The Colonel is smiling, enjoying the show;\nBarbara just stares. The Colonel CHUCKLES at a joke and\nstartles her.\n\nWe HEAR a door opening elsewhere in the house, and Ricky\nenters.\n\n                    RICKY\n          Hey.\n\nHe sits on the couch, next to his father, and watches TV\nalong with them. The Colonel's smile fades.\n\n                    BARBARA\n              (out of the blue)\n          I'm sorry, what?\n\n                    RICKY\n          Mom. Nobody said anything.\n\n                    BARBARA\n          Oh. I'm sorry.\n\nThe three of them stare at the TV, like strangers in an\nairport.\n\nINT. HOTEL BALLROOM - NIGHT\n\nWe HEAR MUSIC under a room full of people all talking at\nonce, as Lester and Carolyn enter a hotel ballroom. We FOLLOW\nTHEM as they pass a SIGN that reads:\n\nGREATER ROCKWELL REALTOR RESOURCES GROUP\n\n                    CAROLYN\n          --everyone here is with their spouse or\n          their significant other. How would it\n          look if I showed up with no one?\n\n\n\n                                                    (CONTINUED)\n\n                                                             29.\nCONTINUED:\n\n\n                    LESTER\n          Well, you always end up ignoring me and\n          going off--\n\nInside the ballroom, well-dressed real estate professionals\nstand in clumps, chatting. Catering waiters serve hors\nd'eouvres.\n\n                    CAROLYN\n          Now listen to me. This is an important\n          business function. As you know, my\n          business is selling an image. And part of\n          my job is to live that image--\n\n                    LESTER\n          Just say whatever you want to say and\n          spare me the propaganda.\n\n                    CAROLYN\n              (spots someone)\n          Hi, Shirley!\n              (to Lester)\n          Listen, just do me a favor. Act happy\n          tonight?\n\n                    LESTER\n              (grins stupidly)\n          I am happy, honey.\n\nCarolyn's jaw tightens, then:\n\n                     CAROLYN\n              (spots someone)\n          Oh! Buddy!\n\nShe drags Lester toward a silver-haired MAN and his much\nyounger WIFE. We recognize the Man as BUDDY KANE, The Real\nEstate King.\n\n                    CAROLYN (CONT'D)\n              (shakes Buddy's hand)\n          Buddy! Buddy. Hi! Good to see you again.\n\n                    BUDDY\n          It's so good to see you too, Catherine.\n\n                     CAROLYN\n          Carolyn.\n\n                    BUDDY\n          Carolyn! Of course. How are you?\n\n\n\n                                                    (CONTINUED)\n\n                                                             30.\nCONTINUED: (2)\n\n\n                    CAROLYN\n          Very well, thank you.\n              (to his wife)\n          Hello, Christy.\n\n                     CHRISTY\n          Hello.\n\n                    CAROLYN\n          My husband, Lester--\n\n                    BUDDY\n              (shakes Lester's hand)\n          It's a pleasure.\n\n                    LESTER\n          Oh, we've met before, actually. This\n          thing last year. Or the Christmas thing\n          at the Sheraton.\n\n                     BUDDY\n          Oh, yes.\n\n                    LESTER\n          It's okay. I wouldn't remember me either.\n\nHe LAUGHS. A little too loudly. Carolyn quickly joins in.\n\n                    CAROLYN\n              (forced gaiety)\n          Honey. Don't be weird.\n\nShe smiles her most winning smile at him. He knows this\npersona well, only it's never pissed him off as much as it\ndoes right now.\n\n                    LESTER\n          All right, honey. I won't be weird.\n              (his face close to hers)\n          I'll be whatever you want me to be.\n\nAnd he kisses her--a soft, warm kiss that speaks unmistakably\nof sex--then turns to the others and grins.\n\n                    LESTER (CONT'D)\n          We have a very healthy relationship.\n\n                     BUDDY\n          I see.\n\nCarolyn's smile is frozen on her face.\n\n\n\n                                                    (CONTINUED)\n\n                                                            31.\nCONTINUED: (3)\n\n\n                    LESTER\n          Well. I don't know about you, but I need\n          a drink.\n\nHe crosses off. Carolyn, Buddy and Christy watch him go.\n\nINT. HOTEL BALLROOM - MOMENTS LATER\n\nLester stands at the bar. A bartender pours him a drink.\n\n                    LESTER\n          Whoa. Put a little more in there, cowboy.\n\nThe bartender complies. Lester takes his drink and turns to\nface the center of the room.\n\nHis POV: Carolyn is talking to Buddy and Christy. She's on:\nsmiling, animated, LAUGHING too loud at their jokes.\n\nLester shakes his head. Ricky approaches him, wearing a\nwaiter's uniform, carrying a tray of empty glasses.\n\n                    RICKY\n          Excuse me. Don't you live on Robin Hood\n          Trail? The house with the red door?\n\n                    LESTER\n              (suspicious)\n          Yeah.\n\n                    RICKY\n          I'm Ricky Fitts. I just moved into the\n          house next to you.\n\n                    LESTER\n          Oh. Hi, Ricky Fitts. I'm Lester Burnham.\n\n                    RICKY\n          Hi, Lester Burnham.\n\nA beat. Lester looks away, scans the crowd, then downs the\nrest of his drink in one gulp. Ricky just stands there,\nwatching him. Finally Lester turns back to Ricky: what does\nthis kid want?\n\n                    RICKY (CONT'D)\n          Do you party?\n\n                       LESTER\n          Excuse me?\n\n                    RICKY\n          Do you get high?\n\n                                                    (CONTINUED)\n\n                                                           32.\nCONTINUED:\n\n\nLester's surprised, but instantly intrigued.\n\nINT. HOTEL BALLROOM - MOMENTS LATER\n\nCarolyn and Buddy are deep in conversation. Christy has\nwandered off. Carolyn is nervous; Buddy seems amused.\n\n                    CAROLYN\n          You know, I probably wouldn't even tell\n          you this if I weren't a little tipsy,\n          but... I am in complete awe of you. I\n          mean, your firm is, hands down, the Rolls\n          Royce of local Real Estate firms, and\n          your personal sales record is, is, is\n          very intimidating. You know, I'd love to\n          sit down with you and just pick your\n          brain, if you'd ever be willing. I\n          suppose, technically, I'm the\n          \"competition,\" but... I mean, hey, I\n          don't flatter myself that I'm even in the\n          same league as you...\n\n                    BUDDY\n          I'd love to.\n\n                    CAROLYN\n              (shocked)\n          Really?\n\n                    BUDDY\n          Absolutely. Call my secretary and have\n          her schedule a lunch.\n\n                    CAROLYN\n          I'll do that. Thank you.\n\nThey look at each other for a beat, then look away. This\nsituation is loaded and they both know it.\n\nEXT. HOTEL - LATER\n\nRicky and Lester stand next to a dumpster behind the service\nentrance to the hotel, smoking a JOINT.\n\n                    LESTER\n          ...did you ever see that movie, where the\n          body's walking around holding its own\n          head? And then the head goes down on that\n          babe?\n\n                    RICKY\n          Re-Animator.\n\n\n                                                   (CONTINUED)\n\n                                                             33.\nCONTINUED:\n\n\nSuddenly, the service entrance opens, and a large CATERING\nBOSS in a cheap suit peers out at them. Ricky hides the\njoint.\n\n                    CATERING BOSS\n              (to Ricky)\n          Look. I'm not paying you to...\n              (eyes Lester, suspiciously)\n          ...do whatever it is you're doing out\n          here.\n\n                    RICKY\n          Fine. So don't pay me.\n\n                       CATERING BOSS\n          Excuse me?\n\n                    RICKY\n          I quit. So you don't have to pay me. Now,\n          leave me alone.\n\n                       CATERING BOSS\n          Asshole.\n\nHe goes back inside. Lester looks at Ricky, who shrugs.\n\n                     LESTER\n          I think you just became my personal hero.\n              (then)\n          Doesn't that make you nervous, just\n          quitting your job like that? Well, I\n          guess when you're all of, what? Sixteen?\n\n                     RICKY\n          Eighteen.\n              (then)\n          I just do these gigs as a cover. I have\n          other sources of income. But my dad\n          interferes less in my life when I pretend\n          to be an upstanding young citizen with a\n          respectable job.\n\n                       CAROLYN (O.C.)\n          Lester?\n\nCarolyn is standing in the open service entrance. Lester\nquickly hides the joint behind his back.\n\n                    CAROLYN (CONT'D)\n          What are you doing?\n\n\n\n\n                                                  (CONTINUED)\n\n                                                          34.\nCONTINUED: (2)\n\n\n                    LESTER\n          Honey, this is...\n              (laughs)\n          Ricky Fitts. This is Ricky Fitts.\n\n                    RICKY\n          I'm Ricky Fitts, I just moved in the\n          house next to you. I go to school with\n          your daughter.\n\n                    LESTER\n          With Jane? Really?\n\n                    RICKY\n          Yeah. Jane.\n\n                      CAROLYN\n          Hi.\n              (then, to Lester)\n          I'm ready to go. I'll meet you out front.\n\nAnd she goes back inside.\n\n                    LESTER\n          Uh-oh. I'm in trouble. Nice meeting you,\n          Ricky Fitts. Thanks for the, uh, thing.\n\n                      RICKY\n          Any time.\n\nLester goes inside.\n\n                    RICKY (CONT'D)\n              (calls after him)\n          Lester. If you want any more, you know\n          where I live.\n\nINT. BURNHAM HOUSE - FAMILY ROOM - LATER\n\nJane and Angela are watching MTV. We HEAR the back door open.\n\n                    JANE\n          Oh, shit. They're home. Quick, let's go\n          up to my room.\n\nJane switches off the TV.\n\n                    ANGELA\n          I should say hi to your dad.\n              (off Jane's look)\n          I don't want to be rude.\n\nShe starts toward the kitchen. Jane doesn't like this.\n\n                                                             35.\n\n\n\nINT. BURNHAM HOUSE - KITCHEN - CONTINUOUS\n\nLester enters and opens the refrigerator.\n\n                       ANGELA (O.C.)\n          Nice suit.\n\nHe turns, and is instantly transfixed by:\n\nHis POV: Angela leans against the counter, twirling her hair.\n\n                    ANGELA (CONT'D)\n          You're looking good, Mr. Burnham.\n\nShe starts toward him.\n\n                    ANGELA (CONT'D)\n          Last time I saw you, you looked kind of\n          wound up.\n              (spots something)\n          Ooh, is that root beer?\n\nShe reaches inside the refrigerator to grab a bottle. As she\ndoes, she moves to place her other hand casually on Lester's\nshoulder. He sees it coming. Everything SLOWS DOWN, and all\nsound FADES...\n\nEXTREME CLOSE UP on her hand as it briefly touches his\nshoulder in SLOW MOTION. We HEAR only the amplified BRUSH of\nher fingers against the fabric of his suit, and its\nunnatural, hollow ECHO...\n\nBACK IN REAL TIME: She grabs the root beer and smiles at him.\n\nCLOSE on Lester: his eyes narrow slightly, then:\n\nHe cups her face in his hands and kisses her. She seems\nshocked, but doesn't resist as he pulls her toward him    with\nsurprising strength. He breaks the kiss, looking at her    in\nawe, then he reaches up and touches his lips. His eyes    widen\nas he pulls a ROSE PETAL from his mouth right before we    SMASH\nCUT TO:\n\nINT. BURNHAM HOUSE - KITCHEN - CONTINUOUS\n\nAngela is back against the counter, drinking the root beer.\nLester stands by the refrigerator, gazing at her, still lost\nin fantasy.\n\n                    ANGELA\n          I love root beer, don't you?\n\n\n\n                                                    (CONTINUED)\n\n                                                          36.\nCONTINUED:\n\n\nJane watches from the doorway to the family room, feeling\nincredibly awkward in her own home. Carolyn enters from the\ndining room. Lester snaps out of it and grabs a root beer\nfrom the refrigerator.\n\n                    JANE\n          Mom, you remember Angela.\n\n                    CAROLYN\n              (her sales smile)\n          Yes, of course!\n\n                    JANE\n          I forgot to tell you, she's spending the\n          night. Is that okay?\n\n                     LESTER\n          Sure!\n\nHe takes a sip of his root beer, but it goes down the wrong\nway and he starts COUGHING violently.\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - LATER THAT NIGHT\n\nAngela lays on the bed, in bra and panties, reading a\nmagazine. Jane, in an oversized T shirt, plays a video game\non her computer.\n\n                    JANE\n          I'm sorry about my dad.\n\n                    ANGELA\n          Don't be. I think it's funny.\n\n                    JANE\n          Yeah, to you, he's just another guy who\n          wants to jump your bones. But to me...\n          he's just too embarrassing to live.\n\n                    ANGELA\n          Your mom's the one who's embarrassing.\n          What a phony.\n\nJane glances at Angela, irritated.\n\n                    ANGELA (CONT'D)\n          Your dad's actually kind of cute.\n\n                     JANE\n          Shut up.\n\n                                                             37.\n\n\n\nINT. BURNHAM HOUSE - HALLWAY - CONTINUOUS\n\nLester, still in his suit, stands outside Jane's room, his\near up against the door. He can't believe what he's hearing.\n\n                    ANGELA (O.C.)\n          He is. If he just worked out a little,\n          he'd be hot.\n\nINT. BURNHAM HOUSE - JANE'S ROOM - CONTINUOUS\n\n                     JANE\n          Shut up.\n\n                    ANGELA\n          Oh, come on. Like you've never sneaked a\n          peek at him in his underwear? I bet he's\n          got a big dick.\n\n                    JANE\n          You are so grossing me out right now.\n\n                    ANGELA\n              (really enjoying this)\n          If he built up his chest and arms, I\n          would totally fuck him.\n\nJane covers her ears and starts SINGING to drown her out.\n\nINT. BURNHAM HOUSE - HALLWAY - CONTINUOUS\n\nLester, still listening, looks like he's about to implode.\n\n                     ANGELA (O.C.)\n              (laughs)\n          I would! I would suck your dad's big fat\n          dick, and then I would fuck him 'til his\n          eyes rolled back in his head!\n              (then)\n          What was that noise? Jane.\n\nJane's SINGING stops.\n\n                    ANGELA (O.C.) (CONT'D)\n          I swear I heard something.\n\nPanicked, Lester scurries down the hall.\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - CONTINUOUS\n\n                    JANE\n          Yeah, it was the sound of you being a\n          huge disgusting pig.\n\n                                                   (CONTINUED)\n\n                                                           38.\nCONTINUED:\n\n\n                    ANGELA\n          I'm serious.\n\nWe HEAR the sharp TAP of a penny being thrown against glass.\n\n                    ANGELA (CONT'D)\n          See?\n\nAngela crosses to the window and looks out.\n\n                    ANGELA (CONT'D)\n              (spots something)\n          Oh my God. Jane.\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nWe see Angela standing at the window in her underwear,\nlooking down at us. Jane joins her and is immediately\nunnerved by:\n\nTheir POV: In the Burnham's DRIVEWAY, the word \"JANE\" is\nspelled out in FIRE.\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - CONTINUOUS\n\n                    ANGELA\n          It's that psycho next door. Jane, what if\n          he worships you? What if he's got a\n          shrine with pictures of you surrounded by\n          dead people's heads and stuff?\n\n                    JANE\n          Shit. I bet he's filming us right now.\n\n                    ANGELA\n              (intrigued)\n          Really?\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nOn VIDEO: We're across from Jane's window, looking in. Jane\ntries to shut the drapes, but Angela won't let her.\nIrritated, Jane retreats into the room. We ZOOM toward her,\neven as Angela poses in the window; we're clearly not\ninterested in Angela. The ZOOM continues, searching for Jane,\nwho has disappeared. Finally, we settle on the small make-up\nMIRROR where we see a REFLECTION of Jane, back at her\ncomputer. She's smiling. Then suddenly the DRAPES CLOSE and\nshe's gone.\n\n                                                             39.\n\n\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nRicky sits in darkness with his DIGICAM, videotaping. He\nlowers the camera and smiles... then something below catches\nhis attention. He leans out the window to get a better look\nat:\n\nEXT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nRicky's POV: Through a WINDOW on the side of the Burnham's\nGARAGE DOOR, we see Lester, still in his suit, digging\nthrough shelves against the back wall.\n\nINT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nLester digs through stuff stored on the shelves, searching\nfor something as if his very life depended on it.\n\n                    LESTER\n          Shit. Shit!\n\nHe yanks aside COLLEGE YEARBOOKS, a racquetball RACQUET,\nboxes of old HOT ROD MAGAZINES, an unopened remote-controlled\nMODEL JEEP KIT, stacks of old vinyl LPs... finally his face\nlights up when he finds:\n\nA pair of DUMBBELLS obviously unused for many years.\n\nLester rips off his jacket and tie and unbuttons his shirt.\nHe glances around, finding his REFLECTION in the WINDOW as he\npulls off his shirt, then the T-shirt underneath. He eyes\nhimself critically: Angela was right, he's not in bad shape.\nJust a few extra pounds around his middle that wouldn't be\nhard to shed. He kicks off his shoes and begins to step out\nof his pants.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nRicky holds his Digicam up and starts to videotape.\n\nEXT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nRicky's POV, on VIDEO: Through a WINDOW on the side of the\nBurnham's garage, we see Lester step out of his pants and\nbriefs. Then, naked except for his black socks, he grabs the\ndumbbells and starts lifting them, watching his reflection in\nthe window as he does.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nRicky stands at the window, videotaping.\n\n\n\n                                                  (CONTINUED)\n\n                                                          40.\nCONTINUED:\n\n\n                    RICKY\n          Welcome to America's Weirdest Home\n          Videos.\n\nSuddenly we HEAR someone trying to open a locked door.\n\n                    COLONEL (O.C.)\n          Ricky!\n\nMoving swiftly, Ricky pulls the drapes shut and switches on a\nlight. His room is a haven of high-tech. A state-of-the-art\nmultimedia COMPUTER crowds his desk, and high-end STEREO and\nVIDEO EQUIPMENT line the shelves, as well as HUNDREDS OF CDs.\nThere is easily twenty thousand dollars worth of equipment in\nthis room.\n\n                    RICKY\n          Coming, Dad.\n\n                    COLONEL (O.C.)\n          You know I don't like locked doors in my\n          house, boy.\n\nRicky opens the door. The Colonel stands outside, eyeing him.\n\n                    RICKY\n          I'm sorry, I must have locked it by\n          accident. So what's up?\n\nThe Colonel holds out a small PLASTIC CUP WITH A CAP.\n\n                    COLONEL\n          I need a urine sample.\n\n                    RICKY\n          Wow. It's been six months already. Can I\n          give it to you in the morning? I just\n          took a whiz.\n\n                    COLONEL\n          Yeah, I suppose.\n              (an awkward beat)\n          Well. Good night, son.\n\nHe disappears down the hall. Ricky smiles, shuts and locks\nhis door. He puts the plastic cup on the shelf, then crosses\nto a MINI REFRIGERATOR in the corner of his room and takes\nout a cup-sized TUPPERWARE CONTAINER from the freezer,\nalready filled with urine, albeit frozen, and places it on a\nsaucer to thaw overnight.\n\n                                                             41.\n\n\n\nINT BURNHAM HOUSE - MASTER BEDROOM - LATER THAT NIGHT\n\nCarolyn lies sleeping. Lester is awake, staring at the\nceiling. After a moment, he gets up, taking care not to\ndisturb Carolyn, and walks toward the bathroom.\n\nINT. BURNHAM HOUSE - MASTER BATH - CONTINUOUS\n\nLester enters and switches on the LIGHT. The room is filled\nwith STEAM. Lester looks around, confused, then focuses on:\n\nHis POV: Across from us, in a PEDESTAL BATHTUB, is Angela.\nShe smiles and beckons us, and we MOVE CLOSER. ROSE PETALS\nfloat on the surface of the water, obscuring her naked body.\n\n                    ANGELA\n          I've been waiting for you.\n\nLester kneels by the bathtub like a man in church.\n\n                    ANGELA (CONT'D)\n          You've been working out, haven't you? I\n          can tell.\n\nShe arches her back and looks up at him provocatively.\n\n                    ANGELA (CONT'D)\n          I was hoping you'd give me a bath... I'm\n          very, very dirty.\n\nLester gives her a hard look, then slowly slips his hand into\nthe water between her legs. Her eyes widen and she throws her\nhead back... and we SMASH CUT TO:\n\nINT. BURNHAM HOUSE - MASTER BEDROOM - CONTINUOUS\n\nCLOSE on Carolyn, her eyes wide, listening to the rhythmic\nBRUSH of Lester's hand as he masturbates under the covers.\n\nShe flips over and faces him.\n\n                    CAROLYN\n          What are you doing?\n\nA beat.\n\n                     LESTER\n          Nothing.\n\nCarolyn switches on the bedside LIGHT.\n\n                    CAROLYN\n          You were masturbating.\n\n                                                    (CONTINUED)\n\n                                                            42.\nCONTINUED:\n\n\n                       LESTER\n          I was not.\n\n                    CAROLYN\n          Yes, you were.\n\nHe turns to her, trying to look innocent, then gives up.\n\n                    LESTER\n          All right, so shoot me. I was whacking\n          off.\n\nCarolyn gets out of bed, repelled. Lester LAUGHS.\n\n                    LESTER (CONT'D)\n          That's right. I was choking the bishop.\n          Shaving the carrot. Saying hi to my\n          monster.\n\n                    CAROLYN\n          That's disgusting.\n\n                    LESTER\n          Well, excuse me, but I still have blood\n          pumping through my veins!\n\n                       CAROLYN\n          So do I!\n\n                    LESTER\n          Really? I'm the only one who seems to be\n          doing anything about it.\n\n                    CAROLYN\n          Lester. I refuse to live like this. This\n          is not a marriage.\n\n                    LESTER\n          This hasn't been a marriage for years.\n          But you were happy as long as I kept my\n          mouth shut. Well, guess what? I've\n          changed. And the new me whacks off when\n          he feels horny, because you're obviously\n          not going to help me out in that\n          department.\n\n                    CAROLYN\n          Oh. I see. You think you're the only one\n          who's sexually frustrated?\n\n                    LESTER\n          I'm not? Well then, come on, baby! I'm\n          ready.\n\n                                                    (CONTINUED)\n\n                                                          43.\nCONTINUED: (2)\n\n\n                    CAROLYN\n              (furious)\n          Do not mess with me, mister, or I will\n          divorce you so fast it'll make your head\n          spin!\n\n                    LESTER\n          On what grounds? I'm not a drunk, I don't\n          fuck other women, I don't mistreat you,\n          I've never hit you, or even tried to\n          touch you since you made it so abundantly\n          clear just how unnecessary you consider\n          me to be. But. I did support you while\n          you got your license. And some people\n          might think that entitles me to half of\n          what's yours.\n\nShe sinks into a chair, stunned. It's clear he knows where\nshe's most vulnerable. He sees this, and likes it; it feels\ngood to win for a change. He curls up under the covers\ncontentedly.\n\n                    LESTER (CONT'D)\n          Turn out the light when you come to bed,\n          okay?\n\nCLOSE on Lester, smiling.\n\nEXT. ROBIN HOOD TRAIL - EARLY MORNING\n\nWe're FLYING high above the neighborhood. Below us we see the\ntwo Jims, jogging. We APPROACH them steadily.\n\n                    LESTER\n          It's a great thing when you realize you\n          still have the ability to surprise\n          yourself. Makes you wonder what else you\n          can do that you've forgotten about.\n\nEXT. ROBIN HOOD TRAIL - CONTINUOUS\n\nWe're now at street level, FOLLOWING the two Jims.\n\n                    LESTER\n          Hey! You guys!\n\nStill running, the Jims turn back in perfect unison, as\nLester runs INTO FRAME, wearing a baggy sweatshirt and a pair\nof faded old sweatpants. The Jims slow down until he catches\nup, then the three men run together in the early morning\nlight.\n\n\n\n                                                 (CONTINUED)\n\n                                                            44.\nCONTINUED:\n\n\n                    JIM #2\n          Lester, I didn't know you ran.\n\n                    LESTER\n              (panting)\n          Well, I just started.\n\n                    JIM #1\n          Good for you.\n\n                    LESTER\n          I figured you guys might be able to give\n          me some pointers. I need to shape up.\n          Fast.\n\n                    JIM #1\n          Well, are you just looking to lose\n          weight, or do you want have increased\n          strength and flexibility as well?\n\n                    LESTER\n          I want to look good naked.\n\nEXT. FITTS HOUSE - A SHORT TIME LATER\n\nThe Colonel is washing his Ford Explorer, squatting to scrub\nthe bumper, when something Catches his eye:\n\nHis POV: Lester and the Jims jog down the street.\n\nThe Colonel stands, scowling, as Ricky comes out of the\nhouse, holding the URINE SAMPLE in front of him.\n\n                    COLONEL\n          What is this, the fucking gay pride\n          parade?\n\nLester breaks off from the two Jims and jogs up to Ricky and\nthe Colonel, out of breath. He grabs hold of his knees and\nbends over, panting.\n\n                    LESTER\n          Hey! Yo! Ricky!\n              (re: the Jims)\n          My entire life is passing before my eyes,\n          and those two have barely broken a sweat.\n\nHe LAUGHS, and extends his hand to the Colonel.\n\n                    LESTER (CONT'D)\n          Sorry, hi. Lester Burnham, I live next\n          door. We haven't met.\n\n\n                                                    (CONTINUED)\n\n                                                             45.\nCONTINUED:\n\n\n                    COLONEL\n              (shakes)\n          COLONEL Frank Fitts, U.S. Marine Corps.\n\n                    LESTER\n          Whoa. Welcome to the neighborhood, sir.\n\nHe salutes the Colonel good-naturedly, grinning. The Colonel\ndoesn't think it's funny. An awkward beat.\n\n                    LESTER (CONT'D)\n          So, Ricky, uh, I was thinking about the,\n          uh... I was gonna... the movie we talked\n          about...\n\n                    RICKY\n              (quickly)\n          Re-Animator.\n\n                    LESTER\n          Yeah!\n\n                    RICKY\n          You want to borrow it?\n              (before Lester can answer)\n          Okay, it's up in my room. Come on.\n\nHe heads into the house. Lester waves at the Colonel, then\nfollows him. The Colonel watches them go, his eyes dark.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - MOMENTS LATER\n\nRicky enters, followed by Lester.\n\n                    RICKY\n          Can you hold this for a sec?\n\n                    LESTER\n          Sure.\n\nHe gives the URINE SPECIMEN to Lester, then locks the door.\n\n                    RICKY\n          I don't think my dad would try to come in\n          when somebody else is here, but you never\n          know.\n\nRicky crosses to a bureau and opens a DRAWER. He takes\nclothing out and piles it on his bed.\n\n                    LESTER\n              (re: urine sample)\n          What is this?\n\n                                                    (CONTINUED)\n\n                                                            46.\nCONTINUED:\n\n\n                    RICKY\n          Urine. I have to take a drug test every\n          six months to make sure I'm clean.\n\n                    LESTER\n          Are you kidding? You just smoked with me\n          last night.\n\n                    RICKY\n          It's not mine. One of my clients is a\n          nurse in a pediatrician's office. I cut\n          her a deal, she keeps me in clean piss.\n\nLester picks up a CD case from a shelf and examines it.\n\n                    LESTER\n          You like Pink Floyd?\n\n                    RICKY\n          I like a lot of music.\n\n                    LESTER\n          Man, I haven't listened to this album in\n          years.\n\nHe shakes his head, then puts the CD case down. Ricky, having\nemptied the drawer, now removes a FALSE BOTTOM, revealing\nrows of MARIJUANA, tightly packed in ZIP-LOC BAGS.\n\n                    RICKY\n          How much do you want?\n\n                    LESTER\n          I don't know, it's been a while. How much\n          is an ounce?\n\n                    RICKY\n              (indicates bag)\n          Well, this is totally decent, and it's\n          three hundred.\n\n                    LESTER\n          Wow.\n\n                    RICKY\n              (indicates another bag)\n          But this shit is top of the line. It's\n          called G-13. Genetically engineered by\n          the U.S. Government. Extremely potent.\n          But a completely mellow high, no\n          paranoia.\n\n\n\n                                                    (CONTINUED)\n\n                                                      47.\nCONTINUED: (2)\n\n\n                    LESTER\n          Is that what we smoked last night?\n\n                    RICKY\n          This is all I ever smoke.\n\n                       LESTER\n          How much?\n\n                       RICKY\n          Two grand.\n\n                    LESTER\n          Jesus. Things have changed since 1973.\n\n                    RICKY\n          You don't have to pay now. I know you're\n          good for it.\n\nA beat.\n\n                       LESTER\n          Thanks.\n\n                    RICKY\n              (hands him a bag)\n          There's a card in there with my beeper\n          number, call me anytime day or night. And\n          I only accept cash.\n\n                    LESTER\n              (looks around room)\n          Well, now I know how you can afford all\n          this equipment. When I was your age, I\n          flipped burgers all summer just to be\n          able to buy an eight track.\n\n                    RICKY\n          That sucks.\n\n                    LESTER\n          No actually, it was great. All I did was\n          party and get laid.\n              (smiles)\n          I had my whole life ahead of me...\n\n                    RICKY\n          My dad thinks I pay for all this with\n          catering jobs.\n              (off Lester's look)\n          Never underestimate the power of denial.\n\nLester smiles. This kid's cool.\n\n                                                            48.\n\n\n\nEXT. BURNHAM HOUSE - LATER\n\nCarolyn, carrying a basket of fresh cut ROSES, passes by the\nGARAGE WINDOW. From inside the garage, we HEAR ROCK MUSIC.\n\nCarolyn stops and SNIFFS the air, frowning. She peers through\nthe window.\n\nHer POV: Lester, in a T-shirt and gym shorts, lies on a new\nWEIGHT BENCH, doing bench presses with shiny new BARBELLS.\n\nINT. GARAGE - CONTINUOUS\n\nROCK MUSIC blasts from a new BOOMBOX on the floor.\n\nThe garage is in the process of becoming Lester's sanctuary.\nAn ugly but comfortable 70's BOWL CHAIR has been pulled out\nand cleaned off, his old hot rod magazines strewn across it,\nand the remote-controlled MODEL JEEP KIT is spread across a\ncard table. The SHELVES that Lester tore through earlier have\nbeen dismantled, leaving a blank wall on which now hangs a\nDART BOARD.\n\nLester finishes his last rep, straining, then puts the\nweights in their rack and sits up. As he takes a drag off a\njoint, the GARAGE DOOR suddenly starts to open. Lester looks\nup, squinting at:\n\nHis POV: The door raises to reveal Carolyn, silhouetted\nagainst the bright sunlight outside, pointing a REMOTE at us.\n\n                    LESTER\n          Uh-oh, mom's mad.\n\n                    CAROLYN\n          What the hell do you think you're doing?\n\n                    LESTER\n          Bench presses. I'm going to wail on my\n          pecs, and then I'm going to do my back.\n\n                    CAROLYN\n          I see you're smoking pot now. I'm so\n          glad. I think using illegal psychotropic\n          substances is a very positive example to\n          set for our daughter.\n\n                    LESTER\n          You're one to talk, you bloodless, money-\n          grubbing freak.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                             49.\nCONTINUED:\n\n\n                    CAROLYN\n              (hostile)\n          Lester. You have such hostility in you!\n\n                    LESTER\n          Do you mind? I'm trying to work out here.\n              (then, suggestively)\n          Unless you want to spot me.\n\n                    CAROLYN\n          You will not get away with this. You can\n          be sure of that!\n\nAnd she's gone. Lester leans back on the bench and grabs the\nweights.\n\n                    LESTER\n              (as he lifts)\n          That's. What. You. Think.\n\nINT. BRAD'S OFFICE - DAY\n\nBrad is seated behind his desk, reading a document. Lester\nsits across from him, smiling.\n\n                    BRAD\n              (reads)\n          \"...my job consists of basically masking\n          my contempt for the assholes in charge,\n          and, at least once a day, retiring to the\n          men's room so I can jerk off, while I\n          fantasize about a life that doesn't so\n          closely resemble hell.\"\n              (looks up at Lester)\n          Well, you obviously have no interest in\n          saving yourself.\n\n                    LESTER\n              (laughs)\n          Brad, for fourteen years I've been a\n          whore for the advertising industry. The\n          only way I could save myself now is if I\n          start firebombing.\n\n                    BRAD\n          Whatever. Management wants you gone by\n          the end of the day.\n\n                    LESTER\n          Well, just what sort of severance package\n          is \"management\" prepared to offer me?\n                    (MORE)\n\n\n                                                    (CONTINUED)\n\n                                                      50.\nCONTINUED:\n                    LESTER (CONT'D)\n          Considering the information I have about\n          our editorial director buying pussy with\n          company money.\n\nA beat.\n\n                    LESTER (CONT'D)\n          Which I'm sure would interest the I.R.S.,\n          since it technically constitutes fraud.\n          And I'm sure that some of our advertisers\n          and rival publications might like to know\n          about it as well. Not to mention, Craig's\n          wife.\n\nBrad sighs.\n\n                    BRAD\n          What do you want?\n\n                    LESTER\n          One year's salary, with benefits.\n\n                    BRAD\n          That's not going to happen.\n\n                    LESTER\n          Well, what do you say I throw in a little\n          sexual harassment charge to boot?\n\nBrad LAUGHS.\n\n                    BRAD\n          Against who?\n\n                    LESTER\n          Against you.\n\nBrad stops laughing.\n\n                    LESTER (CONT'D)\n          Can you prove you didn't offer to save my\n          job if I'd let you blow me?\n\nBrad leans back in his chair, studying Lester.\n\n                    BRAD\n          Man. You are one twisted fuck.\n\n                    LESTER\n              (standing)\n          Nope. I'm just an ordinary guy with\n          nothing to lose.\n\n                                                          51.\n\n\n\nINT. OFFICE BUILDING - MOMENTS LATER\n\nExhilarated, Lester walks down a corridor, his belongings in\na box on his shoulder. He's happier than he's been in years.\n\n                     LESTER\n          Yeah!\n\nINT. RESTAURANT - LATER THAT DAY\n\nCarolyn sits at a table, lost in thought. There are two menus\non the table. After a moment, Buddy Kane, the Real Estate\nKing, joins her. Carolyn immediately becomes warm and\ngracious.\n\n                     BUDDY\n          Carolyn.\n\n                     CAROLYN\n          Buddy.\n\nCarolyn smiles, genuinely touched that he remembers her name.\n\n                    BUDDY\n          I'm so sorry I kept you waiting. Christy\n          left for New York this morning, and...\n          let's just say things were very hectic\n          around the house.\n\n                    CAROLYN\n          What's she doing in New York?\n\n                    BUDDY\n          She's moving there.\n              (off Carolyn's look)\n          Yes. We are splitting up.\n\n                    CAROLYN\n          Buddy. I'm so sorry.\n\n                    BUDDY\n              (bitterly)\n          Yes, according to her, I'm too focused on\n          my career. As if being driven to succeed\n          is some sort of character flaw. Well, she\n          certainly knew how to take advantage of\n          the lifestyle my success afforded her.\n          Oh. Wow.\n              (then, laughing)\n          Ah, it's for the best.\n\n\n\n\n                                                 (CONTINUED)\n\n                                                            52.\nCONTINUED:\n\n\n                    CAROLYN\n          When I saw you two at the party the other\n          night, you seemed perfectly happy.\n\n                    BUDDY\n          Well, call me crazy, but it is my\n          philosophy that in order to be\n          successful, one must project an image of\n          success, at all times.\n\nHe smiles, then opens his menu. Carolyn picks hers up\nmechanically, but continues to stare at him, enraptured, like\na fervent Christian who's just come face to face with Jesus.\n\nEXT. HIGH SCHOOL CAMPUS - LATER THAT DAY\n\nRicky stands with his DIGICAM, videotaping something on the\nground at his feet.\n\nOn VIDEO: A DEAD BIRD lays on the ground, decomposing.\n\n                    ANGELA (O.C.)\n          What are you doing?\n\nOn VIDEO: The camera JERKS up to discover Jane and Angela\nstaring at us.\n\n                    RICKY (O.C.)\n          I was filming this dead bird.\n\n                      ANGELA\n          Why?\n\n                    RICKY (O.C.)\n          Because it's beautiful.\n\nOn VIDEO: Angela looks at Jane, trying not to laugh.\n\n                    ANGELA\n          I think maybe you forgot your medication\n          today, mental boy.\n\nOn VIDEO: She falls out of frame as we ZOOM toward Jane.\n\n                      RICKY (O.C.)\n          Hi, Jane.\n\n                    JANE\n              (uncomfortable)\n          Look. I want you to stop filming me.\n\nRicky lowers the Digicam.\n\n\n                                                 (CONTINUED)\n\n                                                            53.\nCONTINUED:\n\n\n                    RICKY\n          Okay.\n\nHe looks at her, curious, his eyes searching hers. She\ndoesn't look away.\n\n                    ANGELA\n          Well, whatever.\n              (to Jane)\n          This is boring. Let's go.\n\n                    JANE\n              (to Ricky)\n          Do you need a ride?\n\n                    ANGELA\n              (to Jane)\n          Are you crazy? I don't want to end up\n          hacked to pieces in a dumpster somewhere.\n\n                    RICKY\n          It's okay. I'll walk. But thanks.\n\n                    ANGELA\n          Yeah, see? He doesn't want to go anyway.\n          C'mon, let's go.\n\nAngela starts off, but Jane doesn't follow. Ricky smiles at\nher. She almost smiles back, then:\n\n                    JANE\n              (calls off to Angela)\n          I think I'm going to walk, too.\n\nAngela stops and stares at her.\n\n                    ANGELA\n          What? Jane, that's like, almost a mile.\n\nEXT. TOP HAT MOTEL - LATER THAT DAY\n\nCarolyn's Mercedes is parked next to a JAGUAR CONVERTIBLE\nwith a VANITY LICENSE PLATE that reads \"R E KING.\"\n\nINT. TOP HAT MOTEL - CONTINUOUS\n\nCarolyn and Buddy are in the middle of sex.\n\n                    CAROLYN\n          Yes! Oh, God! I love it!\n\n                    BUDDY\n          You like getting nailed by the king?\n\n                                                    (CONTINUED)\n\n                                                             54.\nCONTINUED:\n\n\n                    CAROLYN\n          Oh yes! I love it! Fuck me, your majesty!\n\nEXT. STREET - LATER THAT DAY\n\nLester's TOYOTA CAMRY cruises through the streets. We hear\nLester SINGING along to \"AMERICAN WOMAN\" on the STEREO.\n\nINT. TOYOTA CAMRY - CONTINUOUS\n\nLester is driving, smoking a joint.\n\n                    LESTER\n          AMERICAN WOMAN, STAY AWAY FROM ME...\n          AMERICAN WOMAN, MAMA LET ME BE... DON'T\n          COME A HANGIN' AROUND MY DOOR... I DON'T\n          WANT TO SEE YOUR FACE NO MORE...\n\nEXT. MR. SMILEY'S - CONTINUOUS\n\nLester continues singing along to \"AMERICAN WOMAN,\" as the\nCamry pulls into the parking lot of a FAST FOOD RESTAURANT.\n\nLester pulls up to the drive-thru speaker box.\n\n                    DRIVE-THRU GIRL (O.C.)\n              (over speaker box)\n          Smile you're at Mr. Smiley's.\n\nLester turns down the volume on the stereo.\n\n                    LESTER\n          What?\n\n                    DRIVE-THRU GIRL (O.C.)\n          Would you like to try our new bacon and\n          egg fajita just a dollar twenty-nine for\n          a limited time only.\n\n                    LESTER\n          Uh... no. But thank you.\n              (reading menu)\n          I'll have a Big Barn Burger, Smiley\n          fries, and an orange soda.\n\n                    DRIVE-THRU GIRL (O.C.)\n          Please drive up to the window, thank you.\n\nHe pulls the car around to the WINDOW, where a teenage GIRL\nwearing a headset is waiting.\n\n\n\n\n                                                 (CONTINUED)\n\n                                                          55.\nCONTINUED:\n\n\n                    DRIVE-THRU GIRL (CONT'D)\n          Smile, you're at Mr. Smiley's, that'll be\n          four eighty-nine, please.\n\nLester pays her. As she hands him his food, he notices a SIGN\nin the corner of the window that reads:\n\nNOW TAKING APPLICATIONS\n\n                    COUNTER GIRL\n          Would you like some Smiley Sauce?\n\n                    LESTER\n          No. No, actually... I'd like to fill out\n          an application.\n\nShe stares at him, confused by his age and attire.\n\n                    COUNTER GIRL\n          There's not jobs for manager, it's just\n          for counter.\n\n                    LESTER\n          Good. I'm looking for the least possible\n          amount of responsibility.\n\nINT. MR. SMILEY'S - A SHORT TIME LATER\n\nLester sits at a booth with the MANAGER, a greasy kid wearing\na white short sleeve shirt and a tie covered with the Mr.\nSmiley's logo. He looks over Lester's application, baffled.\n\n                    MANAGER\n          I don't think you'd fit in here.\n\n                    LESTER\n          I have fast food experience.\n\n                    MANAGER\n          Yeah, like twenty years ago.\n\n                    LESTER\n          Well, I'm sure there have been amazing\n          technological advances in the industry,\n          but surely you have some sort of training\n          process. It seems unfair to presume I\n          won't be able to learn.\n\nThe Manager sighs and runs a hand through his greasy hair,\nwondering what he could possibly have done to deserve this.\n\n                                                           56.\n\n\n\nINT. TOP HAT MOTEL - LATER THAT DAY\n\nCarolyn and Buddy are in bed, post-sex.\n\n                    CAROLYN\n          That was exactly what I needed. The royal\n          treatment, so to speak.\n\nThey laugh.\n\n                    CAROLYN (CONT'D)\n          I was so stressed out.\n\n                    BUDDY\n          Know what I do when I feel like that?\n\n                    CAROLYN\n          What?\n\n                    BUDDY\n          I fire a gun.\n\nCarolyn sits up, eager to learn from the master.\n\n                    CAROLYN\n              (intrigued)\n          Really.\n\n                    BUDDY\n          Oh yeah, I go to this little firing range\n          downtown, and I just pop off a few\n          rounds.\n\n                    CAROLYN\n              (embarrassed)\n          I've never fired a gun before.\n\n                    BUDDY\n          Oh, you've gotta try it. Nothing makes\n          you feel more powerful.\n              (smiles seductively)\n          Well, almost nothing.\n\nCarolyn is quick to pick up her cue and kisses him, ready for\nanother round.\n\nEXT. SUBURBAN STREET - LATER THAT DAY\n\nRicky and Jane walk along without speaking. He seems\ncomfortable with the silence; she doesn't. After a beat:\n\n                    JANE\n          So how do you like your new house?\n\n                                                   (CONTINUED)\n\n                                                          57.\nCONTINUED:\n\n\n                       RICKY\n          I like it.\n\nA beat.\n\n                    JANE\n          The people who used to live there fed\n          these stray cats, so they were always\n          around, and it drove my mother nuts. And\n          then she cut down their tree.\n\nAn automobile FUNERAL PROCESSION appears and begins to pass\nthem slowly.\n\n                    RICKY\n          Have you ever known anybody who died?\n\n                       JANE\n          No.\n              (a beat)\n          Have you?\n\n                    RICKY\n          No, but I did see this homeless woman who\n          froze to death once. Just laying there on\n          the sidewalk. She looked really sad.\n\nThey watch the FUNERAL CARS pass.\n\n                    RICKY (CONT'D)\n          I got that homeless woman on video.\n\n                    JANE\n          Why would you film that?\n\n                    RICKY\n          Because it was amazing.\n\n                    JANE\n          What was amazing about it?\n\nA beat.\n\n                    RICKY\n          When you see something like that, it's\n          like God is looking right at you, just\n          for a second. And if you're careful, you\n          can look right back.\n\n                    JANE\n          And what do you see?\n\n\n\n                                                  (CONTINUED)\n\n                                                            58.\nCONTINUED: (2)\n\n\n                       RICKY\n          Beauty.\n\nINT. FITTS HOUSE - KITCHEN - MOMENTS LATER\n\nBarbara Fitts sits at the kitchen table, staring off into\nspace as if hypnotized. Behind her, Ricky enters, followed by\nJane.\n\n                     RICKY\n          Mom, I want you to meet somebody.\n               (no response)\n          Mom.\n\nBarbara's eyes flutter and she turns to him slowly.\n\n                       BARBARA\n                 (pleasant)\n          Yes?\n\n                    RICKY\n          I want you to meet somebody. This is\n          Jane.\n\n                       JANE\n          Hi.\n\n                    BARBARA\n          Oh, my. I apologize for the way things\n          look around here.\n\nJane glances around. The room is spotless.\n\nINT. FITTS HOUSE - THE COLONEL'S STUDY - MOMENTS LATER\n\nWe HEAR KEYS TURNING in the lock, then the door opens and\nRicky enters, holding a RING OF KEYS, followed by Jane.\n\n                    RICKY\n          This is where my dad hides out.\n\nGLASS CASES filled with GUNS line the walls.\n\n                    JANE\n          I take it he's got a thing for guns.\n\nRicky crosses to a built-in CABINET behind the desk.\n\n                    RICKY\n          You got to see this one thing...\n\nHe unlocks the cabinet and opens it, revealing shelves\nstacked with WAR MEMORABILIA.\n\n                                                   (CONTINUED)\n\n                                                            59.\nCONTINUED:\n\n\n                    RICKY (CONT'D)\n          My dad would kill me if he knew I was in\n          here.\n\n                    JANE\n          Did you steal his keys?\n\n                    RICKY\n          No. One of my clients is a locksmith. He\n          was short on cash one night, so I let him\n          pay me in trade.\n\nHe reaches into the cabinet and carefully removes an oval\nCHINA PLATTER, which he hands to Jane. She examines it.\n\n                    RICKY (CONT'D)\n          Turn it over.\n\nCLOSE on the bottom of the plate: A small SWASTIKA is\nimprinted in the center.\n\n                       JANE\n          Oh my God.\n\n                    RICKY\n          It's like official state china of the\n          Third Reich. There's a whole subculture\n          of people who collect this Nazi shit. But\n          my dad just has this one thing.\n\nHe puts the platter back into the cabinet and shuts the door,\nthen notices Jane looking at him oddly.\n\n                    RICKY (CONT'D)\n          What's wrong?\n\n                       JANE\n          Nothing.\n\n                    RICKY\n              (concerned)\n          No, you're scared of me.\n\n                    JANE\n          No I'm not.\n\nBut she is. Ricky studies her.\n\n                    RICKY\n          You want to see the most beautiful thing\n          I've ever filmed?\n\n                                                           60.\n\n\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - MOMENTS LATER\n\nOn VIDEO: We're in an empty parking lot on a cold, gray day.\nSomething is floating across from us... it's an empty,\nwrinkled, white PLASTIC BAG. We follow it as the wind carries\nit in a circle around us, sometimes whipping it about\nviolently, or, without warning, sending it soaring skyward,\nthen letting it float gracefully down to the ground...\n\nJane and Ricky sit on the bed, watching his WIDE-SCREEN TV.\n\n                    RICKY\n          It was one of those days when it's a\n          minute away from snowing. And there's\n          this electricity in the air, you can\n          almost hear it, right? And this bag was\n          just... dancing with me. Like a little\n          kid begging me to play with it. For\n          fifteen minutes. That's the day I\n          realized that there was this entire life\n          behind things, and this incredibly\n          benevolent force that wanted me to know\n          there was no reason to be afraid. Ever.\n\nA beat.\n\n                    RICKY (CONT'D)\n          Video's a poor excuse, I know. But it\n          helps me remember... I need to\n          remember...\n\nNow Jane is watching him.\n\n                    RICKY (CONT'D)\n              (distant)\n          Sometimes there's so much beauty in the\n          world I feel like I can't take it... and\n          my heart is going to cave in.\n\nAfter a moment, Jane takes his hand. Then she leans in and\nkisses him softly on the lips. His eyes scan hers, curious to\nsee how she reacts to this...\n\n                    JANE\n              (suddenly)\n          Oh my God. What time is it?\n\nINT. BURNHAM HOUSE - DINING ROOM - MOMENTS LATER\n\nLester sits at the table in sloppy clothes, eating his dinner\nvoraciously and drinking beer from a bottle. Across from him,\nCarolyn picks at her food, watching him with contempt. EASY-\nLISTENING MUSIC plays on the STEREO.\n\n                                                   (CONTINUED)\n\n                                                            61.\nCONTINUED:\n\n\nWe HEAR the back door SLAM, then Jane enters and quickly\ntakes her seat at the table.\n\n                    JANE\n          Sorry I'm late.\n\n                    CAROLYN\n              (overly cheerful)\n          No, no, that's quite all right, dear.\n          Your father and I were just discussing\n          his day at work.\n              (to Lester)\n          Why don't you tell our daughter about it,\n          honey?\n\nJane stares at both her parents, apprehensive. Lester looks\nat Carolyn darkly, then flashes a \"you-asked-for-it\" grin.\n\n                    LESTER\n          Janie, today I quit my job. And then I\n          told my boss to fuck himself, and then I\n          blackmailed him for almost sixty thousand\n          dollars. Pass the asparagus.\n\n                    CAROLYN\n          Your father seems to think this kind of\n          behavior is something to be proud of.\n\n                    LESTER\n          And your mother seems to prefer I go\n          through life like a fucking prisoner\n          while she keeps my dick in a mason jar\n          under the sink.\n\n                    CAROLYN\n              (ashen)\n          How dare you speak to me that way in\n          front of her? And I marvel that you can\n          be so contemptuous of me, on the same day\n          that you lose your job!\n\n                    LESTER\n          Lose it? I didn't lose it. It's not like,\n          \"Oops, where'd my job go?\" I quit.\n          Someone pass me the asparagus.\n\n                    CAROLYN\n          Oh! Oh! And I want to thank you for\n          putting me under the added pressure of\n          being the sole breadwinner now--\n\n                    LESTER\n          I already have a job.\n\n                                                    (CONTINUED)\n\n                                                            62.\nCONTINUED: (2)\n\n\n                    CAROLYN\n              (not stopping)\n          No, no, don't give a second thought as to\n          who's going to pay the mortgage. We'll\n          just leave it all up to Carolyn. You\n          mean, you're going to take care of\n          everything now, Carolyn? Yes. I don't\n          mind. I really don't. You mean,\n          everything? You don't mind having the\n          sole responsibility, your husband feels\n          he can just quit his job--\n\n                     LESTER\n              (overlapping)\n          Will someone pass me the fucking\n          asparagus?\n\n                    JANE\n              (rises)\n          Okay, I'm not going to be a part of this--\n\n                    LESTER\n              (means it)\n          Sit down.\n\nJane does so, surprised and intimidated by the power in his\nvoice. Lester gets up, crosses to the other side of the table\nto get a PLATE OF ASPARAGUS, then sits again as he serves\nhimself.\n\n                     LESTER (CONT'D)\n          I'm sick and tired of being treated    like\n          I don't exist. You two do whatever    you\n          want to do whenever you want to do    it and\n          I don't complain. All I want is the    same\n          courtesy--\n\n                    CAROLYN\n              (overlapping)\n          Oh, you don't complain? Oh, excuse me.\n          Excuse me. I must be psychotic then, if\n          you don't complain. What is this?! Am I\n          locked away in a padded cell somewhere,\n          hallucinating? That's the only\n          explanation I can think of--\n\nLester hurls the plate of asparagus against the wall with\nsuch force it SHATTERS, frightening Carolyn and Jane.\n\n                    LESTER\n              (casual)\n          Don't interrupt me, honey.\n\n\n                                                    (CONTINUED)\n\n                                                             63.\nCONTINUED: (3)\n\n\nHe goes back to eating his meal, as if nothing unusual has\nhappened. Carolyn sits in her chair, shivering with rage.\nJane just stares at the plate in front of her.\n\n                    LESTER (CONT'D)\n          Oh, and another thing. From now on, we're\n          going to alternate our dinner music.\n          Because frankly, and I don't think I'm\n          alone here, I'm really tired of this\n          Lawrence Welk shit.\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - THAT NIGHT\n\nJane is sitting on her bed. There is a KNOCK at the door.\n\n                      JANE\n          Go. Away.\n\n                    CAROLYN (O.C.)\n          Honey, please let me in.\n\nJane rolls her eyes, crosses to the door and lets Carolyn in.\n\n                    CAROLYN (CONT'D)\n          I wish that you hadn't witnessed that\n          awful scene tonight. But in a way, I'm\n          glad.\n\n                    JANE\n          Why, so I could see what freaks you and\n          Dad really are?\n\n                      CAROLYN\n          Me?\n\nShe stares at Jane, then starts to cry.\n\n                    JANE\n          Aw, Christ, Mom.\n\n                    CAROLYN\n              (tearful)\n          No, I'm glad because you're old enough\n          now to learn the most important lesson in\n          life: you cannot count on anyone except\n          yourself.\n              (sighs)\n          You cannot count on anyone except\n          yourself. It's sad, but true, and the\n          sooner you learn it, the better.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                          64.\nCONTINUED:\n\n\n                    JANE\n          Look, Mom, I really don't feel like\n          having a Kodak moment here, okay?\n\nCarolyn suddenly SLAPS Jane, hard.\n\n                    CAROLYN\n          You ungrateful little brat. Just look at\n          everything you have. When I was your age,\n          I lived in a duplex. We didn't even have\n          our own house.\n\nEmbarrassed, she quickly leaves. Jane looks in a mirror and\nrubs her cheek, then crosses to the window and looks out.\n\nEXT. FITTS HOUSE - CONTINUOUS\n\nJane's POV: We're across from Ricky's room, looking in. He\nstands at the window with his DIGICAM, videotaping us. On the\nWIDE-SCREEN TV behind him, we see Jane standing in her window\nas she looks across at him. She waves. Ricky just keeps\nvideotaping. A beat, then she starts to take off her shirt.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nWe're behind Ricky as he videotapes Jane in her window. She\nhas now removed her shirt. She stands there in her bra, then\nreaches behind her back to unhook the bra.\n\nOn VIDEO: We ZOOM toward her as she takes off her bra\nclumsily. She's obviously embarrassed, but she's gone this\nfar and there's no turning back. She stands there with her\nbreasts exposed, trying to look defiant, but she's achingly\nvulnerable...\n\nSuddenly, the door is thrown open and the Colonel enters,\nincensed. Startled, Ricky turns around. As soon as his eyes\nmeet his father's, he knows what's up.\n\n                    COLONEL\n          You little bastard--\n\nRicky scrambles to dodge his father, but the Colonel is too\nfast; he punches Ricky in the face, knocking him to the\nfloor.\n\n                    COLONEL (CONT'D)\n          How did you get in there?\n\nEXT. BURNHAM HOUSE - CONTINUOUS\n\nFrom her window, Jane watches, pulling the drapes in front of\nher.\n\n                                                             65.\n\n\n\nEXT. FITTS HOUSE - CONTINUOUS\n\nJane's POV: In the WINDOW across from us, the Colonel\nproceeds to give Ricky a serious beating, punching his face.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nRicky's lip is bleeding, but he maintains a steady gaze at\nhis father during this violence.\n\n                    COLONEL\n              (unnerved)\n          How!? How?! C'mon, get up! Fight back,\n          you little pussy!\n\n                    RICKY\n          No, sir. I won't fight you.\n\nThe Colonel grabs him by the collar.\n\n                    COLONEL\n          How did you get in there?\n\n                    RICKY\n          I picked the lock, sir.\n\n                    COLONEL\n          What were you looking for? Money? Are you\n          on dope again?\n\n                    RICKY\n          No, sir. I wanted to show my girlfriend\n          your Nazi plate.\n\nA beat.\n\n                    COLONEL\n          Girlfriend?\n\n                    RICKY\n          Yes, sir. She lives next door.\n\nThe Colonel glances toward the window.\n\nHis POV: In the WINDOW across from us, Jane peeks out from\nbehind the drape. She quickly pulls it shut.\n\n                    RICKY (CONT'D)\n          Her name's Jane.\n\nA beat. The Colonel is suddenly, deeply shamed.\n\n\n\n                                                    (CONTINUED)\n\n                                                            66.\nCONTINUED:\n\n\n                    COLONEL\n          This is for your own good, boy. You have\n          no respect for other people's things, for\n          authority, for...\n\n                    RICKY\n          Sir, I'm sorry.\n\n                    COLONEL\n          You can't just go around doing whatever\n          you feel like, you can't--there are rules\n          in life--\n\n                      RICKY\n          Yes, sir.\n\n                    COLONEL\n          You need structure, you need discipline--\n\n                     RICKY\n               (simultaneous)\n          Discipline. Yes, sir, thank you for\n          trying to teach me. Don't give up on me,\n          Dad.\n\nThe Colonel stands, still breathing heavily. Tenderness fills\nhis face, and he reaches out to touch Ricky's cheek.\n\n                    COLONEL\n          Oh, Ricky...\n\nBut something keeps him from doing it.\n\n                    COLONEL (CONT'D)\n          You stay out of there.\n\nHe leaves. Ricky gets up and goes to his bureau. He looks at\nhis reflection in the mirror, calmly takes a cloth and starts\nto wipe the blood from his face.\n\n                                               FADE TO BLACK.\n\nIn darkness, we HEAR repetitive GUNSHOTS.\n\n                                                        FADE IN:\n\nINT. INDOOR FIRING RANGE - ONE MONTH LATER\n\nCarolyn, wearing PROTECTIVE HEADGEAR, is holding a GLOCK 19\nAUTOMATIC REVOLVER with both hands, FIRING it directly at us.\n\nShe empties a round and stands there, exhilarated. An\nATTENDANT approaches with a new round of ammunition.\n\n                                                 (CONTINUED)\n\n                                                             67.\nCONTINUED:\n\n\n                    ATTENDANT\n              (loading gun)\n          I gotta say, Mrs. Burnham, when you first\n          came here I thought you would be\n          hopeless. But you're a natural.\n\n                    CAROLYN\n          Well, all I know is... I love shooting\n          this gun!\n\nAnd she starts FIRING again.\n\nINT. MERCEDES-BENZ ML320 - LATER\n\nBobby Darin sings \"DON'T RAIN ON MY    PARADE\" on the RADIO.\nCarolyn SINGS along as she drives.    Her face has lost its\nusual resolute determination; she's    actually enjoying herself\nspontaneously, and the lack of her    usual self-consciousness\nallows us to see just how beautiful    she is.\n\nANGLE ON the GLOCK 19 sitting on the passenger seat amidst\nsome CDs.\n\nCarolyn takes the gun and holds it at arm's length, admiring\nit as she continues to SING.\n\nEXT. ROBIN HOOD TRAIL - CONTINUOUS\n\nThe Mercedes turns onto Robin Hood Trail.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn's POV: We turn into the Burnham driveway. A 1970\nPONTIAC FIREBIRD with racing stripes blocks our access to the\ngarage.\n\nCLOSE on Carolyn: She doesn't like having things in her way.\n\nINT. BURNHAM HOUSE - FAMILY ROOM - MOMENTS LATER\n\nLester's REMOTE-CONTROLLED MODEL JEEP is zooming across the\nfloor of the family room, expertly maneuvering corners and\nnarrowly avoiding crashing.\n\nLester is sprawled on the couch in his underwear, drinking a\nBEER and controlling the car. His working out is beginning to\nproduce results. The room, too, seems changed: sloppier, more\nlived in.\n\nCarolyn enters through the kitchen, flushed and angry. She\njust stands there, staring at Lester. After a moment, he\nlooks up at her.\n\n\n                                                    (CONTINUED)\n\n                                                           68.\nCONTINUED:\n\n\n                    LESTER\n          What?\n\n                    CAROLYN\n          Ah, whose car is that out front?\n\n                    LESTER\n          Mine. 1970 Pontiac Firebird. The car I\n          always wanted and now I have it. I rule!\n\n                    CAROLYN\n          Where's the Camry?\n\n                    LESTER\n          I traded it in.\n\n                    CAROLYN\n          Shouldn't you have consulted me first?\n\n                     LESTER\n          Hmm, let me think... No. You never drove\n          it.\n              (then)\n          Have you done something different? You\n          look great.\n\n                    CAROLYN\n              (brusque)\n          Where's Jane?\n\n                     LESTER\n          Jane not home. We have the whole house to\n          ourselves.\n\nHe smiles at her playfully. She stares back, annoyed. It's\nthe same look she had at the beginning, when he dropped his\nbriefcase, but whatever power that look had is gone. Lester\njust LAUGHS.\n\n                    LESTER (CONT'D)\n          Christ, Carolyn. When did you become\n          so... joyless?\n\n                    CAROLYN\n              (taken aback)\n          Joyless?! I am not joyless! There happens\n          to be a lot about me that you don't know,\n          mister smarty man. There is plenty of joy\n          in my life.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                            69.\nCONTINUED: (2)\n\n\n                    LESTER\n              (leaning toward her)\n          Whatever happened to that girl who used\n          to fake seizures at frat parties when she\n          got bored? And who used to run up to the\n          roof of our first apartment building to\n          flash the traffic helicopters? Have you\n          totally forgotten about her? Because I\n          haven't.\n\nHis face is close to hers, and suddenly the atmosphere is\ncharged. She pulls back automatically, but it's clear she's\ndrawn to him. He smiles, and moves even closer, holding his\nbeer loosely balanced. Then, just before their lips meet...\n\n                    CAROLYN\n              (barely audible)\n          Lester. You're going to spill beer on the\n          couch.\n\nShe's immediately sorry she said it, but it's too late. His\nsmile fades, and the moment is gone.\n\n                    LESTER\n          So what? It's just a couch.\n\n                    CAROLYN\n          This is a four thousand dollar sofa\n          upholstered in Italian silk. This is not\n          \"just a couch.\"\n\n                    LESTER\n          It's just a couch!\n\nHe stands and gestures toward all the things in the room.\n\n                    LESTER (CONT'D)\n          This isn't life. This is just stuff. And\n          it's become more important to you than\n          living. Well, honey, that's just nuts.\n\nCarolyn stares at him, on the verge of tears, then turns and\nwalks out of the room before he can see her cry.\n\n                    LESTER (CONT'D)\n              (calls after her)\n          I'm only trying to help you.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - NIGHT\n\nOn VIDEO: Jane lays in Ricky's bed, wearing a tank top. She\nglances at us.\n\n\n                                                 (CONTINUED)\n\n                                                           70.\nCONTINUED:\n\n\n                      JANE\n              (shy)\n          Don't.\n\nWe're watching the WIDE-SCREEN TV in Ricky's room.\n\nA CORD leads from the TV to Ricky's DIGICAM. Ricky holds the\ncamera, sitting naked in a chair. It's been almost a month\nsince his father beat him up, and there are still slight\nSCARS on his face. He's aiming his camera at Jane.\n\n                      RICKY\n          Why?\n\n                    JANE\n              (re: image on TV)\n          It's weird, watching myself. I don't like\n          how I look.\n\n                    RICKY\n          I can't believe you don't know how\n          beautiful you are.\n\n                    JANE\n          I'm not going to sit here for that shit.\n\nShe gets out of bed, takes his Digicam and focuses it on him.\nWe see his image on the TV as she videotapes.\n\n                    JANE (CONT'D)\n          Ha. How does it feel now?\n\n                      RICKY\n          Fine.\n\n                    JANE\n          You don't feel naked?\n\n                    RICKY\n          I am naked.\n\n                    JANE\n          You know what I mean.\n\nJane ZOOMS in on his face, which remains placid.\n\n                    JANE (CONT'D)\n          Tell me about being in the hospital.\n\nRicky smiles.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          71.\nCONTINUED: (2)\n\n\n                     RICKY\n          When I was fifteen, my dad caught me\n          smoking dope. He totally freaked and\n          decided to send me to military school. I\n          told you his whole thing about structure\n          and discipline, right?\n              (laughs)\n          Well, of course, I got kicked out. Dad\n          and I had this huge fight, and he hit\n          me... and then the next day at school,\n          some kid made a crack about my haircut,\n          and... I just snapped. I wanted to kill\n          him. And I would have. Killed him. If\n          they hadn't pulled me off.\n              (then)\n          That's when my dad put me in the\n          hospital. Then they drugged me up and\n          left me in there for two years.\n\n                    JANE\n          Wow. You must really hate him.\n\n                    RICKY\n          He's not a bad man.\n\nHe grabs a half-smoked JOINT from an ashtray and lights it.\n\n                    JANE\n          Well... you better believe I'd hate my\n          father if he did something like that to\n          me.\n              (laughs)\n          Wait. I do hate my father.\n\n                    RICKY\n          Why?\n\nHe passes her the joint, then takes the Digicam and focuses\nit on her. We see her image on the TV as he videotapes.\n\n                    JANE\n          He's a total asshole and he's got this\n          crush on my friend Angela and it's\n          disgusting.\n\n                    RICKY\n          You'd rather he had the crush on you?\n\n                     JANE\n          Gross, no! But it'd be nice if I was\n          anywhere near as important to him as she\n          is.\n              (then)\n                     (MORE)\n                                                  (CONTINUED)\n\n                                                            72.\nCONTINUED: (3)\n                    JANE (CONT'D)\n          I know you think my dad's harmless, but\n          you're wrong. He's doing massive\n          psychological damage to me.\n\n                    RICKY\n          How?\n\nJane looks into the camera, a loopy, stoned grin on her face.\n\n                    JANE\n          Well, now, I too need structure. A little\n          fucking discipline.\n\nThey LAUGH. She lays back on the bed.\n\n                    JANE (CONT'D)\n          I'm serious, though. How could he not be\n          damaging me? I need a father who's a role\n          model, not some horny geek-boy who's\n          gonna spray his shorts whenever I bring a\n          girlfriend home from school.\n              (snorts)\n          What a lame-o. Somebody really should put\n          him out of his misery.\n\nHer mind wanders for a beat.\n\n                    RICKY\n          Want me to kill him for you?\n\nJane looks at him and sits up.\n\n                    JANE\n          Yeah, would you?\n\n                    RICKY\n              (smiles)\n          It'll cost you.\n\n                    JANE\n          Well, I've been baby-sitting since I was\n          about ten. I've got almost three thousand\n          dollars. 'Course, I was saving it up for\n          a boob job.\n\nShe stands and sticks out her breasts, then falls back on the\nbed, LAUGHING.\n\n                    JANE (CONT'D)\n          But my tits can wait, huh?\n\n                    RICKY\n          You know, that's not a very nice thing to\n          do, hiring somebody to kill your dad.\n\n                                                    (CONTINUED)\n\n                                                             73.\nCONTINUED: (4)\n\n\n                    JANE\n          Well, I guess I'm just not a very nice\n          girl, then, am I?\n\nShe smiles dreamily at him. He turns the Digicam off and the\nTV screen goes BLUE. He lowers the camera and looks at her\nintently.\n\n                    JANE (CONT'D)\n              (suddenly nervous)\n          You know I'm not serious, right?\n\n                       RICKY\n          Of course.\n\nHe puts the Digicam down and joins Jane on the bed. A long\nmoment where neither of them speaks. He caresses her hair,\ngazing into her eyes.\n\n                    RICKY (CONT'D)\n          Do you know how lucky we are to have\n          found each other?\n\n                                                 FADE TO BLACK.\n\n                                                      FADE IN:\n\nEXT. ROBIN HOOD TRAIL - EARLY MORNING\n\nWe're FLYING above Robin Hood Trail. We see the BURNHAM'S\nHOUSE below us as we APPROACH it steadily.\n\n                    LESTER\n          Remember those posters that said, \"Today\n          is the first day of the rest of your\n          life?\" Well, that's true of every day\n          except one.\n              (a beat)\n          The day you die.\n\nWe're almost on top of the Burnham house now, as Lester,\nwearing sweatpants and running shoes, bursts out of the front\ndoor and dashes up the driveway.\n\nEXT. ROBIN HOOD TRAIL - A SHORT TIME LATER\n\nWe're now at street level, as Lester runs toward us. He\ncarries a WALKMAN and wears EARPHONES, and we HEAR ROCK MUSIC\nas he runs. The endorphins have kicked in, and Lester grins,\nreveling in the sheer physical pleasure of his body.\n\n                                                            74.\n\n\n\nINT. BURNHAM HOUSE - KITCHEN - A SHORT TIME LATER\n\nThe blender GRINDS as Lester, still in his sweatpants, makes\nhimself a high-protein shake. He's in excellent shape; even\nhis posture has changed, and he moves with the confident,\neasy swagger of an athlete. Jane watches him blankly from the\nkitchen table.\n\nCarolyn enters. Lester leans against the counter, drinking\nhis shake directly from the blender pitcher, eyeing her. He's\ngot a newfound sexual energy that makes her uncomfortable,\nand he knows it. Carolyn quickly rinses off her coffee cup,\navoiding his eyes, and starts out.\n\n                    CAROLYN\n          Jane, hurry up. I've got a very important\n          appointment--\n\n                    JANE\n          Mom, is it okay if Angela sleeps over\n          tonight?\n\nJane looks at Lester to see how he reacts. He doesn't.\n\n                    CAROLYN\n          Well, of course, she's always welcome.\n              (on her way out)\n          You know, I thought maybe you two had a\n          fight. I haven't seen her around here in\n          a while.\n\nAnd she's gone. Jane continues staring at her father.\nFinally, he glances over at her.\n\n                    LESTER\n          What?\n\n                    JANE\n              (nervous)\n          I've been too embarrassed to bring her\n          over. Because of you, and the way that\n          you behave.\n\n                    LESTER\n          What are you talking about? I've barely\n          even spoken to her.\n\n                    JANE\n              (angry)\n          Dad! You stare at her all the time, like\n          you're drunk! It's disgusting!\n\n\n\n                                                    (CONTINUED)\n\n                                                             75.\nCONTINUED:\n\n\n                    LESTER\n              (angry himself)\n          You better watch yourself, Janie, or\n          you're going to turn into a real bitch,\n          just like your mother.\n\nJane is stunned. She quickly rises, trying to get out of the\nkitchen before she starts crying.\n\nANGLE on Lester, and the immediate regret in his eyes.\n\n                    LESTER (CONT'D)\n              (under his breath)\n          Fuck.\n\nINT. FITTS HOUSE - UPSTAIRS HALLWAY - CONTINUOUS\n\nWe're outside Ricky's room, MOVING slowly toward the open\ndoor, through which we can see Ricky, standing at his bureau\nmirror, combing his hair. The scars on his face are almost\ngone now.\n\nA REVERSE ANGLE reveals the Colonel standing outside the door\nlooking in, watching Ricky with great tenderness. Then Ricky\nlooks up at him, and the Colonel is suddenly self-conscious.\n\n                    COLONEL\n              (brusque)\n          You ready to go?\n\n                    RICKY\n          Oh, I don't need a ride. I'm going to go\n          in with Jane and her mom.\n\nEXT. FITTS HOUSE - FRONT PORCH - MOMENTS LATER\n\nRicky emerges from the house, followed by the Colonel, who\nwatches his son as he heads toward the Burnham house.\n\nHis POV: Carolyn waves from the Mercedes, flashing an\ninsincere smile. Jane leans forward from the passenger seat\nand glares at us. As Ricky starts to get in the car, Lester\nemerges from the house in his sweatpants.\n\n                    LESTER\n          Yo, Ricky. How's it going?\n\n                    RICKY\n          Pretty decent, Mr. Burnham.\n\nRicky pulls his door shut, but not before Lester mouths \"call\nme\" and Ricky gives a slight nod in acknowledgment.\n\n\n                                                    (CONTINUED)\n\n                                                             76.\nCONTINUED:\n\n\nCLOSE on the Colonel's face: he looks confused.\n\nAs the Mercedes backs out of the driveway, Lester glances\nover at him.\n\nLester's POV: The Colonel watches the car driving off, then\nlooks at us. His face tightens.\n\nLESTER studies him for a moment, then grins and salutes\nbefore going inside the house.\n\nCLOSE on the Colonel, deeply troubled.\n\nINT. FITTS HOUSE - RICKY'S ROOM - MOMENTS LATER\n\nThe door swings open silently and the Colonel enters. He\nstarts going through Ricky's bureau. He opens the DRAWER in\nwhich we know Ricky keeps his marijuana, but he doesn't\ndiscover its false bottom. He stands and looks around, his\neyes finally landing on:\n\nThe DIGICAM and a stack of CASSETTES on a shelf. The camera\nis still connected to the TV.\n\nThe Colonel turns on the TV, examines the Digicam and presses\n\"play.\" The TV's blank screen suddenly gives way to...\n\nOn VIDEO: Barbara Fitts sits at the kitchen table, staring\noff into space.\n\nThe Colonel watches, at first baffled, then impatient. He\ntakes the cassette out of the Digicam and inserts another. On\nthe TV screen we see...\n\nOn VIDEO: Through the Burnham's GARAGE WINDOW, we see Lester\nstep out of his pants and briefs. Then, naked except for his\nblack socks, he grabs the dumbbells and starts lifting them,\nwatching his reflection in the window as he does...\n\nThe Colonel sinks slowly onto Ricky's bed, mesmerized.\n\nINT. MR. SMILEY'S - LATER\n\nLester, wearing a Mr. Smiley's uniform, is happily flipping\nburgers on a grill.\n\n                    CO-WORKER\n          Hey Lester, I need that Super Smiley with\n          cheese, A.S.A.P.\n\n                    LESTER\n          You need more than that, my little\n          hombre.\n\n                                                  (CONTINUED)\n\n                                                            77.\nCONTINUED:\n\n\nLester looks up suddenly when he HEARS:\n\n                    CAROLYN (O.S.)\n              (over speakers)\n          What's good here?\n\n                    BUDDY (O.C.)\n              (over speakers)\n          Nothing.\n\n                     CAROLYN (O.C.)\n              (over speakers)\n          Then I guess we'll just have to be bad,\n          won't we?\n              (then)\n          I think I'll have a double Smiley\n          Sandwich and curly fries, and a vanilla\n          shake.\n\n                    BUDDY (O.C.)\n              (over speakers)\n          Make that two.\n\n                    COUNTER GIRL (O.C.)\n              (over speakers)\n          Please drive around thank you.\n\nLester's face darkens, then... he smiles. He puts his spatula\ndown.\n\nEXT. MR. SMILEY'S - CONTINUOUS\n\nThe Mercedes pulls around to the DRIVE-THRU WINDOW. Carolyn\ndrives; Buddy sits beside her.\n\n                    CAROLYN\n          I think we deserve a little junk food,\n          after the workout we had this morning.\n\n                    BUDDY\n              (nuzzles her neck)\n          I'm flattered.\n\nThey are too involved with each other to notice Lester\nwatching them from the drive-thru window.\n\n                    LESTER\n              (overly cheerful)\n          Smile! You're at Mr. Smiley's!\n\nCarolyn almost jumps out of her skin.\n\n\n\n                                                    (CONTINUED)\n\n                                                            78.\nCONTINUED:\n\n\nLester leans out of the drive-thru window, grinning at her,\nholding bags filled with fast food. The Counter Girl stands\nnext to him, staring blankly.\n\n                    LESTER    (CONT'D)\n          Would you like to    try our new beef and\n          cheese pot pie on    a stick, just a dollar\n          ninety-nine for a    limited time only?\n\nCarolyn struggles to appear nonchalant.\n\n                    CAROLYN\n              (re: Buddy)\n          We were just at a seminar.\n              (then, all business)\n          Buddy, this is my--\n\n                    LESTER\n          Her husband. We've met before, but\n          something tells me you're going to\n          remember me this time.\n\n                    COUNTER GIRL\n              (to Carolyn)\n          Whoa. You are so busted.\n\n                     CAROLYN\n               (flustered)\n          You know, this really doesn't concern\n          you.\n\n                    LESTER\n          Actually, Janeane is senior drive-thru\n          manager, so you kind of are on her turf.\n              (to Carolyn, quietly)\n          So. This makes sense.\n\n                    CAROLYN\n              (miserable)\n          Oh, Lester--\n\n                     LESTER\n          Honey, it's okay. I want you to be happy.\n              (then)\n          Would you like Smiley Sauce with that?\n\n                    CAROLYN\n          Lester, just stop it!\n\n                    LESTER\n          Uh-uh. You don't get to tell me what to\n          do. Ever again.\n\n\n                                                    (CONTINUED)\n\n                                                            79.\nCONTINUED: (2)\n\n\nCarolyn closes her eyes, defeated, then grabs the wheel,\nshifts gears and drives off.\n\nEXT. TOP HAT MOTEL - A SHORT TIME LATER\n\nThe sky is filled with ominous gray clouds. Wind whips\ngarbage across the parking lot as Carolyn's Mercedes pulls in\nnext to Buddy's Jaguar.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn grips the wheel tightly, staring straight ahead.\nBuddy looks at her unhappily.\n\n                    BUDDY\n          I'm sorry. I guess we should cool it for\n          a while. I'm facing a potentially very\n          expensive divorce.\n\n                    CAROLYN\n          Oh, no. I understand completely.\n              (sarcastic)\n          In order to be successful, one must\n          project an image of success. At all\n          times.\n\nShe regrets it the second it's out of her mouth, and turns to\nhim. He just looks at her sadly, then gets out of the car and\nshuts the door. She starts to CRY. As before, she SLAPS\nherself, hard.\n\n                    CAROLYN (CONT'D)\n          Stop it. Stop it!\n\nShe closes her eyes tight, trying to stop the tears, then\nsuddenly SCREAMS as loud as she can.\n\nEXT. TOP HAT MOTEL - CONTINUOUS\n\nBuddy's Jaguar speeds off, leaving the Mercedes alone in the\nparking lot. We can still HEAR Carolyn's muffled SCREAMING.\nThere is a sound of distant THUNDER.\n\nINT. BURNHAM HOUSE - GARAGE - THAT NIGHT\n\nIt's RAINING outside. We HEAR ROCK MUSIC as Lester pumps\niron. He puts the weights down and looks at his REFLECTION in\nthe window:\n\nHis POV: His arms are pumped. He smiles.\n\n\n\n\n                                                 (CONTINUED)\n\n                                                            80.\nCONTINUED:\n\n\nHe reaches under the bench and grabs a CIGAR BOX. Opening it,\nhe digs through MARIJUANA PARAPHERNALIA, only to pull out an\nempty ZIP-LOC BAG.\n\n                      LESTER\n          Shit.\n\nINT. FITTS HOUSE - KITCHEN - MOMENTS LATER\n\nRicky and the Colonel sit at the table, eating in silence.\nBarbara rinses off a pan at the sink, then stares at it as if\nshe can't quite remember what she meant to do with it. We\nsuddenly HEAR a BEEPING noise. Ricky pulls his BEEPER off his\nbelt and checks it.\n\n                    RICKY\n              (getting up)\n          I have to run next door. Jane left her\n          geometry book in my bag and she needs it\n          to do her homework.\n\nHe heads into the hall. The Colonel watches him go, uneasy.\n\nINT. ANGELA'S BMW - CONTINUOUS\n\nAngela drives, squinting through the windshield as the wipers\nmove back and forth.\n\n                    ANGELA\n          So you and psycho boy are fucking on\n          like, a regular basis now, right?\n\n                      JANE\n                (irritable)\n          No.\n\n                    ANGELA\n          Oh, come on. You can tell me. Does he\n          have a big dick?\n\n                    JANE\n          Look, I'm not gonna talk about his dick\n          with you, okay? It's not like that.\n\n                     ANGELA\n          Not like what? Doesn't he have one?\n              (then)\n          Why don't you want to talk about it? I\n          mean, I tell you every single detail\n          about every guy that I fuck.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                           81.\nCONTINUED:\n\n\n                    JANE\n          Yeah, and maybe you shouldn't, all right?\n          Maybe I don't really want to hear all\n          that.\n\n                    ANGELA\n          Oh, so now that you have a boyfriend,\n          you're like, above it?\n              (rolls her eyes)\n          We gotta get you a real man.\n\nINT. FITTS HOUSE - KITCHEN - CONTINUOUS\n\nThe Colonel rinses off his plate at the sink. Something\noutside catches his eye, and he cranes his neck to get a\nbetter look at...\n\nHis POV: Through the window over the sink, we can see into\nthe Burnham's GARAGE WINDOW. Our view is blurred by the RAIN,\nbut we see Lester, his upper body pumped and glistening in\nsweat as he counts out a wad of BILLS... and then Ricky walks\ninto view.\n\nThe Colonel's face tightens.\n\nHis POV: Lester drapes his arm around Ricky as he gives him\nthe money. We can only see Lester from the waist up, so he\nlooks naked.\n\nINT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nRicky, his hair wet from the rain, puts the cash in his\npocket. Lester's arm remains draped around his shoulder.\n\n                    RICKY\n              (grins)\n          You got any papers?\n\n                    LESTER\n          Yeah, in the cigar box, right over there.\n              (laughs)\n          You know, put up a fight, dude! You are\n          such a pushover. \"No I can't. Really.\n          Okay.\"\n\nAnd he slaps Ricky playfully on the chest. Ricky grins, then\nsquats down and reaches under the weight bench.\n\n                    RICKY\n          You should learn to roll a joint.\n\nLester sits in the bowl chair and leans back, his hands\nbehind his head, watching Ricky roll the joint.\n\n                                                            82.\n\n\n\nINT. FITTS HOUSE - KITCHEN - CONTINUOUS\n\nThe Colonel's POV: Lester leans back in his chair. We see\nonly Ricky's back and shoulders as he rolls the joint. After\na beat, Lester's jaw drops, then he throws his head back.\nFrom our perspective, it looks very much like Ricky is giving\nLester a blow job.\n\nThe Colonel watches, incredulous. Then we HEAR a CAR\nAPPROACHING, and the Colonel glances over at:\n\nHis POV: Angela's BMW pulls into the driveway, stopping\nbehind Lester's Firebird. As Angela and Jane get out and run\ntoward the house, our focus MOVES back to the GARAGE WINDOW.\nRicky stands, looking a little panicked. Lester pulls on his\nT-shirt, and both he and Ricky cross out of view.\n\nINT. BURNHAM HOUSE - KITCHEN - MOMENTS LATER\n\nLester leans nonchalantly against the counter. Jane and\nAngela enter. Jane frowns when she sees him.\n\n                    LESTER\n          Oh. Hi.\n\n                    JANE\n          Where's Mom?\n\n                    LESTER\n          Don't know.\n\n                    ANGELA\n          Hi, Mr. Burnham.\n\n                    LESTER\n          Hi.\n\nHe's trying to remain cool, and doing a pretty good job.\n\n                    ANGELA\n          Wow. Look at you. Have you been working\n          out?\n\n                    LESTER\n          Some.\n\nJane rolls her eyes and exits. Angela walks over to Lester.\n\n                    ANGELA\n          You can really tell. Look at those arms.\n\nShe places her hand on his arm flirtatiously, looks up at him\nand smiles, fully expecting to intimidate him by doing so.\n\n                                                    (CONTINUED)\n\n                                                             83.\nCONTINUED:\n\n\nBut something has changed, and he isn't intimidated at all.\nHe looks directly back at her, leans in and smiles slowly.\n\n                    LESTER\n          You like muscles?\n\nHis voice is low and intense. She moves away, suddenly\ninsecure.\n\n                    ANGELA\n          I--I should probably go see what Jane's\n          up to.\n\nAnd she heads out quickly. Lester watches her go, baffled.\n\nINT. FITTS HOUSE - RICKY'S ROOM - CONTINUOUS\n\nRicky enters, wet from the pouring rain, and crosses to his\nbureau, pulling the wad of CASH out of his pocket as he goes.\n\n                    COLONEL (O.C.)\n          Where'd you get that?\n\nRicky turns, startled.\n\nHis POV: The Colonel steps out of the shadows.\n\nRicky takes a step back.\n\n                    RICKY\n          From my job.\n\n                     COLONEL\n          Don't lie to me.\n              (beat)\n          I saw you with him.\n\n                    RICKY\n              (incredulous)\n          You were watching me?\n\n                    COLONEL\n          What did he make you do?\n\n                    RICKY\n              (laughs)\n          Dad, you don't really think... me and Mr.\n          Burnham?\n\n                     COLONEL\n              (furious)\n          Don't you laugh at me!\n              (then)\n                     (MORE)\n                                                    (CONTINUED)\n\n                                                            84.\nCONTINUED:\n                    COLONEL (CONT'D)\n          I will not sit back and watch my only son\n          become a cocksucker!\n\n                    RICKY\n          Jesus, what is with you--\n\nThe Colonel BACKHANDS Ricky so hard it sends the boy\nsprawling.\n\n                    COLONEL\n          I swear to God, I will throw you out of\n          this house and never look at you again.\n\n                    RICKY\n              (taken aback)\n          You mean that?\n\n                    COLONEL\n          Damn straight I do. I'd rather you were\n          dead than be a fucking faggot.\n\nA beat. Ricky suddenly smiles. He gets up.\n\n                    RICKY\n          You're right. I suck dick for money.\n\n                     COLONEL\n          Boy--\n\n                    RICKY\n          Two thousand dollars. I'm that good.\n\n                     COLONEL\n          Get out.\n\n                    RICKY\n          And you should see me fuck. I'm the best\n          piece of ass in three states.\n\n                    COLONEL\n              (explodes)\n          Get out!! I don't ever want to see you\n          again!!\n\nRicky eyes the Colonel. He's finally discovered a way to\nbreak free from his father, and he can't believe it was this\nsimple.\n\n                    RICKY\n          What a sad old man you are.\n\n                    COLONEL\n              (a whisper)\n          Get out.\n\n                                                    (CONTINUED)\n\n                                                             85.\nCONTINUED: (2)\n\n\nRicky grabs his backpack, turns and walks out the door,\nleaving the Colonel standing there, glassy-eyed and breathing\nheavily.\n\nINT. FITTS HOUSE - KITCHEN - MOMENTS LATER\n\nRicky enters to discover Barbara standing in the middle of\nthe room, clutching a dish, frightened. She's obviously heard\nhis argument with his father, and she looks into his eyes,\nsearching, aware that something eventful is taking place.\n\n                    RICKY\n          Mom, I'm leaving.\n\nA beat.\n\n                    BARBARA\n          Okay, wear a raincoat.\n\n                    RICKY\n              (hugs her)\n          I wish things would have been better for\n          you. Take care of Dad.\n\nHe kisses her cheek softly, then exits out the back door,\nleaving her standing alone, still clutching her dish.\n\nINT. FITTS HOUSE - RICKY'S BEDROOM - CONTINUOUS\n\nThe Colonel's POV: Below us, Ricky dashes through the rain to\nthe Burnham's front door and knocks. Lester opens it and lets\nhim in.\n\nEXT. FITTS HOUSE - CONTINUOUS\n\nThe Colonel looks coldly down at us from Ricky's bedroom\nwindow, and then he pulls the drapes shut.\n\nEXT. FREEWAY - CONTINUOUS\n\nThe MERCEDES-BENZ ML320 is parked in the breakdown lane, its\nHAZARD LIGHTS BLINKING. Cars ZOOM past in the rain.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn sits behind the wheel, listening to a MOTIVATIONAL\nTAPE on the STEREO.\n\n                    TAPE VOICE\n          --disinvesting problems of their power,\n          and removing their ability to make us\n          afraid. This is the secret to \"me-\n          centered\" living.\n                    (MORE)\n                                                    (CONTINUED)\n\n                                                            86.\nCONTINUED:\n                    TAPE VOICE (CONT'D)\n          Only by taking full responsibility for\n          your problems--and their solutions--will\n          you ever be able to break free from the\n          constant cycle of victimhood.\n\nCarolyn leans over and open the glove compartment. She takes\nout her GLOCK 19.\n\n                    TAPE VOICE (CONT'D)\n          Remember, you are only a victim if you\n          choose to be a victim...\n\nINT. BURNHAM HOUSE - JANE'S ROOM - CONTINUOUS\n\nAngela is sprawled across the bed. Jane stands across the\nroom from her.\n\n                    JANE\n          I don't think we could be friends\n          anymore.\n\n                    ANGELA\n          You are way too uptight about sex.\n\n                    JANE\n          Just don't fuck my dad, all right?\n          Please?\n\n                     ANGELA\n          Why not?\n\nThere is a KNOCK on the door. Jane sits up, alarmed.\n\n                    JANE\n              (angry)\n          Dad! Leave us alone!\n\n                     RICKY (O.C.)\n          It's me.\n\nJane jumps up and opens the door and lets him in.\n\n                    RICKY (CONT'D)\n              (to Jane)\n          If I had to leave tonight, would you come\n          with me?\n\n                     JANE\n          What?\n\n                    RICKY\n          If I had to go to New York. To live.\n          Tonight. Would you come with me?\n\n\n                                                    (CONTINUED)\n\n                                                          87.\nCONTINUED:\n\n\n                   JANE\n         Yes.\n\n                   ANGELA\n         You guys can't be serious.\n             (to Jane)\n         You're just a kid. And he's like, a\n         mental case. You'll end up living in a\n         box on the street.\n\n                   JANE\n         I'm no more a kid than you are!\n             ( to Ricky)\n         We can use my plastic surgery money.\n\n                   RICKY\n         We won't have to. I have over forty\n         thousand dollars. And I know people in\n         the city who can help us get set up.\n\n                   ANGELA\n         What, other drug dealers?\n\n                   RICKY\n         Yes.\n\n                   ANGELA\n         Jane, you'd be out of your mind to go\n         with him.\n\n                   JANE\n         Why do you even care?\n\n                   ANGELA\n         Because you're my friend!\n\n                   RICKY\n         She's not your friend. She's somebody you\n         use to feel better about yourself.\n\n                   ANGELA\n         Go fuck yourself, psycho!\n\n                   JANE\n         You shut up, bitch!\n\n                   ANGELA\n         Jane! He is a freak!\n\n\n\n\n                                                  (CONTINUED)\n\n                                                             88.\nCONTINUED: (2)\n\n\n                    JANE\n          Well, then so am I! And we'll always be\n          freaks and we'll never be like other\n          people. And you'll never be a freak\n          because you're just too perfect.\n\n                    ANGELA\n          Oh, yeah? Well, at least I'm not ugly.\n\n                    RICKY\n          Yes, you are. And you're boring. And\n          you're totally ordinary. And you know it.\n\nAngela stares at him, stunned, then starts toward the door.\n\n                    ANGELA\n          You two deserve each other.\n\nAnd she exits, SLAMMING the door behind her. Jane turns to\nRicky and he takes her in his arms.\n\nINT. BURNHAM HOUSE - UPSTAIRS HALLWAY - CONTINUOUS\n\nAngela sits on the stairs, shaken, crying.\n\nEXT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nWe're MOVING SLOWLY toward the Burnham's GARAGE WINDOW\nthrough the RAIN. Through the window, we see Lester, wearing\nonly his sweatpants, performing bench presses.\n\nINT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nThrough the window, we see the Colonel standing outside,\nwatching. We ZOOM slowly in on him as he watches, transfixed.\n\nEXT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nHis POV: Lester finishes his last rep, then racks the weights\nand sits up, sweaty and out of breath. He runs his free hand\nover his chest... and then he glances at us, suddenly aware\nhe's being watched.\n\nINT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nLester and the Colonel stare at each other through the\nwindow.\n\nEXT. BURNHAM HOUSE - GARAGE - MOMENTS LATER\n\nThe RAIN is coming down in sheets now, and there is a sharp\nCLAP of THUNDER. We're directly outside the GARAGE DOOR as it\nslowly lifts to reveal Lester smiling at us.\n\n                                                    (CONTINUED)\n\n                                                             89.\nCONTINUED:\n\n\n                    LESTER\n          Jesus, man. You're soaked.\n\nINT. BURNHAM HOUSE - GARAGE - CONTINUOUS\n\nLester pulls the Colonel inside. The Colonel moves stiffly\nand seems preoccupied, slightly disoriented.\n\n                    LESTER\n          You want me to get Ricky? He's in Jane's\n          room.\n\nThe Colonel just stands there, looking at Lester.\n\n                      LESTER (CONT'D)\n          You okay?\n\n                    COLONEL\n              (his voice thick)\n          Where's your wife?\n\n                    LESTER\n          Uh... I don't know. Probably out fucking\n          that dorky prince of real estate asshole.\n          And you know what? I don't care.\n\nThe Colonel moves closer towards him.\n\n                    COLONEL\n          Your wife is with another man and you\n          don't care?\n\n                    LESTER\n          Nope, our marriage is just for show. A\n          commercial, for how normal we are. When\n          we are anything but.\n\nHe grins... and so does the Colonel.\n\n                    LESTER (CONT'D)\n          You're shaking.\n\nHe places his hand on the Colonel's shoulder. The Colonel\ncloses his eyes.\n\n                    LESTER (CONT'D)\n          We really should get you out of these\n          clothes.\n\n                    COLONEL\n              (a whisper)\n          Yes...\n\n\n                                                    (CONTINUED)\n\n                                                            90.\nCONTINUED:\n\n\nHe opens his eyes and looks at Lester, his face filled with\nan anguished vulnerability we wouldn't have thought possible\nfrom him. His eyes are brimming with tears. Lester leans in,\nconcerned.\n\n                       LESTER\n          It's okay.\n\n                    COLONEL\n              (hoarse)\n\nI...\n\n                    LESTER\n              (softly)\n          Just tell me what you need.\n\nThe Colonel reaches up and places his hand on Lester's\ncheek... and then kisses him. Lester is momentarily stunned,\nand then he pushes the Colonel away. The Colonel's face\ncrumples in shame.\n\n                    LESTER (CONT'D)\n          Whoa, whoa, whoa. I'm sorry. You got the\n          wrong idea.\n\nThe Colonel stares at the floor, blinking, and then he turns\nand runs out the open garage door into the rainy night.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn is still listening to the same MOTIVATIONAL TAPE. She\nholds the GLOCK in her hand.\n\n                    TAPE VOICE\n          \"I refuse to be a victim.\" When this\n          becomes your mantra, constantly running\n          through your head--\n\nCarolyn switches the TAPE OFF and puts the gun in her purse.\n\n                    CAROLYN\n          I refuse to be a victim.\n\nEXT. FREEWAY - CONTINUOUS\n\nThe Mercedes pulls away from the shoulder.\n\nINT. BURNHAM HOUSE - KITCHEN - CONTINUOUS\n\nLester enters, opens the refrigerator and grabs a BEER.\nSuddenly we HEAR MUSIC coming from the other room. Lester\nopens his beer and starts toward the family room.\n\n                                                             91.\n\n\n\nINT. BURNHAM HOUSE - FAMILY ROOM - CONTINUOUS\n\nHis POV: AS we MOVE SLOWLY around a corner, Angela comes into\nview, standing at the STEREO, holding a CD case. She's been\ncrying; her face is puffy, and her hair mussed. She regards\nus apprehensively... then puts on a slightly defiant smile.\n\n                    ANGELA\n          I hope you don't mind if I play the\n          stereo.\n\nLester leans against the wall and takes a swig of his beer.\n\n                     LESTER\n          Not at all.\n              (then)\n          Bad night?\n\n                    ANGELA\n          Not really bad, just... strange.\n\n                    LESTER\n              (grins)\n          Believe me. It couldn't possibly be any\n          stranger than mine.\n\nShe smiles. They stand there in silence; the atmosphere is\ncharged.\n\n                    ANGELA\n          Jane and I had a fight.\n              (after a beat)\n          It was about you.\n\nShe's trying to be seductive as she says this, but she's\npretty bad at it. Lester raises his eyebrows.\n\n                    ANGELA (CONT'D)\n          She's mad at me because I said I think\n          you're sexy.\n\nLester grins. He is sexy.\n\n                    LESTER\n              (offering beer)\n          Do you want a sip?\n\nShe nods. Lester holds the bottle up to her mouth and she\ndrinks clumsily. He gently wipes her chin with the back of\nhis hand.\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            92.\nCONTINUED:\n\n\n                    LESTER (CONT'D)\n          So... are you going to tell me? What you\n          want?\n\n                    ANGELA\n          I don't know.\n\n                    LESTER\n          You don't know?\n\nHis face is very close to hers. She's unnerved--this is\nhappening too fast...\n\n                    ANGELA\n          What do you want?\n\n                    LESTER\n          Are you kidding? I want you. I've wanted\n          you since the first moment I saw you. You\n          are the most beautiful thing I have ever\n          seen.\n\nAngela takes a deep breath just before Lester leans in to\nkiss her cheek, her forehead, her eyelids, her neck...\n\n                    ANGELA\n          You don't think I'm ordinary?\n\n                    LESTER\n          You couldn't be ordinary if you tried.\n\n                     ANGELA\n          Thank you.\n              (far away)\n          I don't think there's anything worse than\n          being ordinary...\n\nAnd Lester kisses her on the lips.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCarolyn drives, her face resolute.\n\n                    CAROLYN\n          I refuse to be a victim. I refuse to be a\n          victim. I refuse to be a victim...\n              (angry)\n          Lester, I have something I have to say to\n          you...\n\n                                                           93.\n\n\n\nINT. BURNHAM HOUSE - FAMILY ROOM - MOMENTS LATER\n\nAngela lays back on the couch as Lester moves in over her. He\npulls her jeans off and gently brushes his fingers over her\nlegs, then moves up and caresses her face...\n\nINT. BURNHAM HOUSE - JANE'S ROOM - CONTINUOUS\n\nRicky and Jane, fully clothed, lie curled up on Jane's bed.\n\n                    JANE\n          Are you scared?\n\n                    RICKY\n          I don't get scared.\n\n                    JANE\n          My parents will try to find me.\n\n                    RICKY\n          Mine won't.\n\nINT. BURNHAM HOUSE - FAMILY ROOM - CONTINUOUS\n\nLester starts unbuttoning Angela's blouse. She seems\ndisconnected from what's happening. Lester pulls her blouse\nopen, exposing her breasts.\n\nLester looks down at her, grinning, unable to believe he's\nactually about to do what he's dreamed of so many times, and\nthen...\n\n                    ANGELA\n          This is my first time.\n\nLester LAUGHS.\n\n                    LESTER\n          You're kidding.\n\n                     ANGELA\n              (a whisper)\n          I'm sorry.\n\nA beat. Lester looks down at her, his grin fading.\n\nHis POV: Angela lies beneath us, embarrassed and vulnerable.\nThis is not the mythically carnal creature of Lester's\nfantasies; this is a nervous child.\n\n\n\n\n                                                   (CONTINUED)\n\n                                                          94.\nCONTINUED:\n\n\n                    ANGELA (CONT'D)\n          I still want to do it... I just thought I\n          should tell you... in case you wondered\n          why I wasn't... better.\n\nLester's face falls. There's no way he's going to go through\nwith this now.\n\n                     ANGELA (CONT'D)\n              (confused)\n          What's wrong? I thought you said I was\n          beautiful.\n\n                    LESTER\n              (tenderly)\n          You are beautiful.\n\nHe grabs a blanket from the back of the couch and drapes it\naround her shoulders, covering her nakedness.\n\n                    LESTER (CONT'D)\n          You are so beautiful... and I would be a\n          very lucky man...\n\nHe smiles and shakes his head. Humiliated, Angela starts to\ncry.\n\n                    ANGELA\n          I feel so stupid.\n\n                       LESTER\n          Don't.\n\nHe hugs her, letting her put her head on his shoulder,\nstroking her hair and rocking her gently.\n\n                       ANGELA\n          I'm sorry.\n\nLester takes her by the shoulders and looks at her, serious.\n\n                    LESTER\n          You have nothing to be sorry about.\n\nBut she keeps crying. Lester hugs her again. We HEAR a loud\nCLAP of THUNDER outside.\n\n                    LESTER (CONT'D)\n              (smiles)\n          It's okay. Everything's okay.\n\n                                                            95.\n\n\n\nEXT. ROBIN HOOD TRAIL - MOMENTS LATER\n\nThe Mercedes pulls onto Robin Hood Trail.\n\nINT. MERCEDES-BENZ ML320 - CONTINUOUS\n\nCLOSE on Carolyn's eyes, reflected in the REAR-VIEW MIRROR.\nShe turns her head to look out the window:\n\nHer POV: The RED DOOR of the Burnham house stands out, even\nin the pouring rain.\n\nINT. BURNHAM HOUSE - KITCHEN - MOMENTS LATER\n\nAngela, once again fully clothed, sits at the kitchen\ncounter. She's eating a turkey sandwich.\n\n                    ANGELA\n          Wow. I was starving.\n\nLester puts a jar of mayonnaise back in the refrigerator.\n\n                    LESTER\n          Do you want me to make you another one?\n\n                    ANGELA\n          No, no, no. I'm fine.\n\nHe turns to her and cocks an eyebrow.\n\n                    LESTER\n              (concerned)\n          You sure?\n\n                    ANGELA\n          I mean, I'm still a little weirded out,\n          but...\n              (sincerely)\n          ...I feel better. Thanks.\n\nA long beat, as Lester studies her, then:\n\n                    LESTER\n          How's Jane?\n\n                    ANGELA\n          What do you mean?\n\n                    LESTER\n          I mean, how's her life? Is she happy? Is\n          she miserable? I'd really like to know,\n          and she'd die before she'd ever tell me\n          about it.\n\n                                                    (CONTINUED)\n\n                                                            96.\nCONTINUED:\n\n\nAngela shifts uncomfortably.\n\n                    ANGELA\n          She's... she's really happy. She thinks\n          she's in love.\n\nAngela rolls her eyes at how silly this notion is.\n\n                    LESTER\n              (quietly)\n          Good for her.\n\nAn awkward beat.\n\n                    ANGELA\n          How are you?\n\n                     LESTER\n              (smiles, taken aback)\n          God, it's been a long time since anybody\n          asked me that.\n              (thinks about it)\n          I'm great.\n\nThey just sit there, smiling at each other, then:\n\n                    ANGELA\n              (suddenly)\n          I've gotta go to the bathroom.\n\nShe crosses off. Lester watches her go, then stands there\nwondering why he should suddenly feel so content.\n\n                     LESTER\n              (laughs)\n          I'm great.\n\nSomething at the edge of the counter catches his eye, and he\nreaches for...\n\nCLOSE on a framed PHOTOGRAPH as he picks it up: It's the\nphoto we saw earlier of him, Carolyn and Jane, taken several\nyears ago at an amusement park. It's startling how happy they\nlook.\n\nLester crosses to the kitchen table, where he sits and\nstudies the photo. He suddenly seems older, more mature...\nand then he smiles: the deep, satisfied smile of a man who\njust now understands the punch line of a joke he heard long\nago...\n\n\n\n\n                                                    (CONTINUED)\n\n                                                            97.\nCONTINUED: (2)\n\n\n                    LESTER (CONT'D)\n          Man oh man...\n              (softly)\n          Man oh man oh man...\n\nAfter a beat, the barrel of a GUN rises up behind his head,\naimed at the base of his skull.\n\nANGLE ON an arrangement of fresh-cut ROSES   in a vase on the\nopposite counter, deep crimson against the   WHITE TILE WALL.\nThen a GUNSHOT suddenly rings out, ECHOING   unnaturally.\nInstantly, the tile is sprayed with BLOOD,   the same deep\ncrimson as the roses.\n\nINT. BURNHAM HOUSE - FOYER - MOMENTS LATER\n\nRicky comes down the stairs, followed by Jane.\n\nINT. BURNHAM HOUSE - KITCHEN - MOMENTS LATER\n\nRicky opens the door from the dining room, then stops. Jane\nappears behind him.\n\n                       JANE\n          Oh God.\n\nTheir POV: A pool of blood is forming on the kitchen table.\n\nRicky comes into the kitchen and slowly approaches Lester's\nlifeless body, wide-eyed but not afraid. Jane follows him, in\nshock. Ricky kneels, gazing at Lester's unseen face... then\nhe smiles, ever so slightly.\n\nHis POV: Lester looks back at us; his eyes are lifeless, but\nhe's smiling the same slight smile.\n\n                       RICKY\n                 (an awed whisper)\n          Wow.\n\n                    LESTER (V.O.)\n          I had always heard your entire life\n          flashes in front of your eyes the second\n          before you die.\n\nEXT. SKY - DAY\n\nWe're FLYING across a white blanket of clouds.\n\n                    LESTER (V.O.)\n          First of all, that one second isn't a\n          second at all, it stretches on forever,\n          like an ocean of time...\n\n                                                           98.\n\n\n\nEXT. WOODS - NIGHT\n\nIn BLACK & WHITE: Eleven-year-old Lester looks up, pointing\nexcitedly at:\n\nHis POV: A DOT OF LIGHT falls across an unbelievably starry\nsky.\n\n                    LESTER (V.O.)\n          For me, it was lying on my back at Boy\n          Scout camp, watching falling stars...\n\nINT. BURNHAM HOUSE - JANE'S BEDROOM - NIGHT\n\nRicky and Jane lie curled up on Jane's bed, fully clothed. We\nHEAR a GUNSHOT from downstairs. They look at each other,\nalarmed.\n\nEXT. SUBURBAN STREET - DUSK\n\nIn BLACK & WHITE: Maple trees in autumn. Ghostly LEAVES\nFLUTTER slowly toward pavement.\n\n                    LESTER (V.O.)\n          And yellow leaves, from the maple trees,\n          that lined my street...\n\nINT. BURNHAM HOUSE - POWDER ROOM - NIGHT\n\nAngela stands in front of the mirror, fixing her make-up. We\nHEAR the GUNSHOT again. Angela turns, frightened.\n\nINT. SUBURBAN HOUSE - DAY\n\nIn BLACK & WHITE: CLOSE on an ancient woman's papery HANDS as\nthey button a cardigan sweater.\n\n                    LESTER (V.O.)\n          Or my grandmother's hands, and the way\n          her skin seemed like paper...\n\nEXT. BURNHAM HOUSE - NIGHT\n\nCarolyn walks slowly toward the RED DOOR, drenched to the\nbone, clutching her PURSE tightly. We HEAR the GUNSHOT again.\n\nEXT. SUBURB - DAY\n\nIn BLACK & WHITE: A 1970 PONTIAC FIREBIRD in the driveway of\na suburban home. The SUN'S REFLECTION in the windshield\nFLASHES BRILLIANTLY.\n\n\n\n                                                   (CONTINUED)\n\n                                                             99.\nCONTINUED:\n\n\n                    LESTER (V.O.)\n          And the first time I saw my cousin Tony's\n          brand new Firebird...\n\nINT. FITTS HOUSE - THE COLONEL'S STUDY - NIGHT\n\nThe Colonel enters, wet. He's wearing LATEX GLOVES. BLOOD\ncovers the front of his T-shirt. He paces in front of one of\nhis GUN CASES; the GLASS DOOR is open, and a gun is\nconspicuously missing from inside.\n\nINT. BURNHAM HOUSE - HALL - NIGHT\n\nIn BLACK & WHITE: Jane opens her bedroom door, staring at us.\n\n                    LESTER (V.O.)\n          And Janie...\n\nEXT. SUBURBAN HOUSE - DUSK\n\nIn BLACK & WHITE: A door opens to reveal 4-YEAR-OLD JANE,\ndressed for Halloween in a Princess costume, holding a lit\nSPARKLER aloft and smiling shyly at us.\n\n                    LESTER (V.O.)\n          And Janie...\n\nINT. BURNHAM HOUSE - MASTER BEDROOM - NIGHT\n\nCarolyn enters, terrified, still clutching her PURSE. She\nshuts the door and locks it, then takes the GLOCK 19 out of\nher purse. She opens the closet door and shoves the gun into\na HAMPER. Then, suddenly aware of Lester's scent, she grabs\nas many of his clothes as she can and pulls them to her,\nburying her face in them. She sinks to her knees, pulling\nseveral items of clothing down with her, and she begins to\ncry.\n\nEXT. AMUSEMENT PARK - NIGHT\n\n                                              IN BLACK & WHITE:\n\nA younger Carolyn sits across from us in one of those\nSPINNING-TEACUP RIDES, LAUGHING uncontrollably as she twists\nthe wheel in front of her, making us SPIN even faster.\n\n                    LESTER (V.O.)\n              (with love)\n          And... Carolyn.\n\n                                                           100.\n\n\n\nEXT. PARKING LOT - DAY\n\nOn VIDEO: We're watching the video Ricky showed Jane earlier,\nof the empty white PLASTIC BAG being blown about. The wind\ncarries it in a circle around us, sometimes whipping it about\nviolently, or, without warning, sending it soaring skyward,\nthen letting it float gracefully down to the ground...\n\n                    LESTER (V.O.)\n          I guess I could be pretty pissed off\n          about what happened to me... but it's\n          hard to stay mad, when there's so much\n          beauty in the world. Sometimes I feel\n          like I'm seeing it all at once, and it's\n          too much, my heart fills up like a\n          balloon that's about to burst...\n\nEXT. - ROBIN HOOD TRAIL - DAY\n\nWe're FLYING once again over Robin Hood Trail, ASCENDING\nSLOWLY.\n\n                    LESTER (V.O.)\n          ...and then I remember to relax, and stop\n          trying to hold on to it, and then it\n          flows through me like rain and I can't\n          feel anything but gratitude for every\n          single moment of my stupid little life...\n              (amused)\n          You have no idea what I'm talking about,\n          I'm sure. But don't worry...\n\n                                               FADE TO BLACK.\n\n                    LESTER (V.O.) (CONT'D)\n          You will someday.\n\n\n\n\n\nAmerican Beauty\nWriters :   Alan Ball\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:07.855657"}