{"title": "Anastasia", "film_link": "/Movie Scripts/Anastasia Script.html", "script_link": "/scripts/Anastasia.html", "info_raw": "\n\nAnastasia Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.88 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Susan Gauthier  Bruce Graham\nGenres  Family  Animation  Musical\nScript Date :  1997\n\nRead \"Anastasia\" Script\n\n\n", "script": "\nANASTASIA\n\nFADE IN:\n\non a well-worn PHOTOGRAPH ALBUM. An ELDERLY WOMAN'S\nHAND touched the album, caressing it lovingly for a\nmoment, as WE HEAR her voice.\n\n                       TATIANA (O.C.)\n          Once we lived in an enchanted\n          world. . . \n\nShe opend the ALBUM to reveal a BLACK AND WHITE\nPHOTOGRAPH of the PALACE AT ST. PETERSBERG on a\nbrilliant summer day.\n\n                       TATIANA (CONT)\n          A world of Tsars and Princesses\n          and elegant palaces. . . \n\nCAMERA MOVES CLOSER TO the picture. . . \n\n                       TATIANA (CONT)\n          and grand parties. . . \n\nThe PHOTO dissolves into REALITY in brilliant color as\nthe day turns into night and the summer cools into\nwinter. We see the palace at night, blanketed in a\nbeautiful, almost glowing, snow as hourse drawn carriages\npull up to the front door.\n\n                       TATIANA (CONT)\n          A beautiful, magical time. . . \n\nMOVE INTO THE PALACE\n\n                       TATIANA (CONT)\n          That would soon be gone\n          forever. . . \n\nINT.  PALACE AT ST. PETERSBERG - NIGHT\n\nElegant ROYALISTS mingle around the MAIN HALL as an\nORCHESTRA plays.\n\nAll eyes turn to the GLASS DOORS OF TWO ELEVADORS which\ndescend grandly on either side of a beautiful staircase.\nThrough the glass doors we see TATIANA, the Dowager\nEmpress, 60, imperious and bedecked with jewels, she is\nseemingly unapproachable. TSAR NICHOLAS and his SON are\nwith her. In the other elevador, ALEXANDRA and her\ndaughters - well,  all her daughters except. . . \n\nANASTASIA, eight years old and apparently late for the\nparty, rushes down the upstairs hallway followed by a\nSERVENT (SONYA) 16,  who is trying to catch up with\nAnastasia to tie a large ribbon in her long, dark hair.\n\n                       SONYA\n                  (whispering)\n          Princess Anastasia - you're\n          late and it's all my  fault!\n\n                       ANASTASIA\n          Don't worry, Sonya, no one'll\n          notice. . . \n\nJust then, Sonya lassoes the ribbon around her hair,\nstopping Anastasia with a \n\n                       ANASTASIA\n                  (loudly)\n          . . .  owwwwwwwww!\n\nAll eyes turn to Anastasia, who once she realizes that\nshe's the center of attention, flashes a mischievous\nsmile and descends the staircase in grand style. As the\nribbon falls out of her hair and down her back,\nAnastasia kicks it to Sonya without breaking stride.\n\nTatiana sees her and can't help but smile.\n\nThe music suddenly becomes  a FLOURISH OF TRUMPETS.\nSERVENTS open the elevador doors as the ROYAL FAMILY\nsteps out and begins a proccession through their\nsubjects. Tatiana holds out her arm to Anastasia as she\nmakes it to Tatiana's side just in time. Anastasia has\na beautiful but slightly impish face, dominated by\nlarge, blue, mischievous eyes. She an abundance of \nenergy and confidence for a girl her age.\n\n\"THE RULARS OF RUSSIA\"  (OPENING NUMBER)\n\n   The elegant guests sing their admiration as the\nbeautiful and happy Romanov family makes it's entrance\ninto the ball, they're \"the  pride of all Russia\".\nVladimir invites Sophie to dance and the entire\nglittering assembly assembly swings into a GLORIOUS SWEEPING \nWALTZ. Singing their certainty that the Romanovs will\nrule forever.\n\nDuring the above, the ball is in full swing. Beautiful\nCOUPLES swirls across the dance floor, including\nAnastasia dancing gracefully with her father.\n\nUnder a long buffet table, we see DMITRI, 11, darkly\nhandsome, dressed in ragged servant clothes, with a\nshock of dark hair which continuoually falls accross his\neyes as watches the guest enviously. Anastasia, still\nwaltzing with her father, sees him. SERVENTS cross the\nroom carrying a trays of BEAUTIFUL TROPICAL FRUIT. The\nguests \"Ew\" and \"ah\" at the sumptuous fruit. Anastasia\nsees Dmitri eyeing it hungrily and without missing a\ndance step, she grabs an orange off thr tray and tosses\nit to Dmitri. He catches it and smiles broadly at her.\n\nSuddenly, A HAND grabs Dmitri and pulls him out from\nunder the table. It's IVAR, the HEAD SERVENT, who pulls\nDmitri into an open wall panel.\n\n                       IVAR\n                  (angrily)\n          You're a servent! Never forget\n          your place!\n\n                       DMITIRI\n                  (defiant)\n          Someday my place will be out\n          there!\n\n                       IVAR\n          Never! You're a peasant,\n          Dmitri! Back in the kitchen\n\nRULARS OF RUSSIA (CONT.)\n\n   UNDERSCORE CONTINUES as Dmitri is dragged from his\nhiding place under the table and back to the kitchen.\nIt's like the Moscow circus back there, COMIC MUSICAL\nCONFUSION. The servants sing about their demanding\nemployers and mockingly imitate their behavior:  they\nimply that they have their own \"party\",  that change is\ncoming.\n\n   While back in the ballroom, the Royalists are\noblivious to the servants discontent and sing their\nsatisfaction with their own lives.\n\n   DRAMATIC UNDERSCORE CONTINUES though the following\nscenes.\n\nON TATIANA\n\nin a large throne-like chair. Tatiana is very serious\nand very regal. She slides over to make room for\nAnastasia who sits next to her.\n\n\n                       TATIANA\n          Why were you so late tonight \n\n                       ANASTASIA\n          I was showing Sonya\n          something . . .\n\n                       TATIANA\n          What were you showing her?\n\n                       ANASTASIA\n                  (sheepishly)\n          How to read.\n\n                       TATIANA\n          I thought you were told not to\n          tutor your servants anymore.\n\n                       ANASTASIA\n          I know, but I had to because . . .\n\nAnastasia looks up at Tatiana and sees her smile with\npride.  Anastasia knows she doesn't have to explain.\n\n                       ANASTASIA\n                  (cuddling)\n          Oh, Grandmama, why do you have\n          to go back to Paris?\n\n                       TATIANA\n          It's where I've made my home\n          but I do have something for\n          you . . .\n\nTatiana reaches from behind the chair and brings out a\nbeautiful MUSIC BOX.  Tatiana takes the key, a small\nsilver and enamel flower, on a silver neck chain and\nwinds it up. MUSIC BEGINS, she hands Anastasia the key.\n\nCLOSE UP\n\nthe key bearing the inscription \"Together in Paris\".\n\n                       ANASTASIA\n          \"Together in Paris\"! Oh, when\n          can we be \"together in Paris?!\n\n                       TATIANA\n          When you're older . . .\n\nAnastasia makes a disgruntled face. Tatiana laughs.\n\n\n                       TATIANA\n          Until then, whenever you hear\n          this song, think of me and know\n          that I'm waiting for you.\n\nTatiana puts the key around Anastasia's neck and they\nembrace. Then, suddenly . . .\n\nON THE GRAND CHANDELIER\n\nthe lights begin to fade in and out.\n\nGROUP SHOT\n\nas PEOPLE in the ballroom look around bewildered. Then,\na WHIRLWIND kicks up, sending everyone off the dance\nfloor, as the whirlwind becomes a TORNADO.\n\nSuddenly, an ALBINO BAT (BARTOK) with huge eyes, springs\nout of the funnel, screeching and swooping over the\ncrowd, causing everyone to duck and cover their heads in\nfear.\n\nThe tornada reaches it's peak and EXPLODES in smoke -\nleaving RASPUTIN standing alone in the middle of the\nfloor. He is of indeterminate age, towering over other\nmen in the room, his most striking feature are his eyes\n- which at this moment are burning a fiery red. He is\ndressed in a flowing black monk's robe with a satin rope\ntied around his waist. Connected to the rope is a\nglowing RELIQUARY, a mystical lantern.\n\nVARIOUS SHOTS\n\nof Nicholas, Alexandra, Sophie and Vladimir, Dmitri\npeeking out ofthe wallpanel, Tatiana and Anastasia,\nall of whom are frightened.\n\nNICHOLAS\n\nas he gathers his son and wife to his side\n\n                       NICHOLAS\n          Rasputin!  You're alive . . .\n\n                       RASPUTIN\n                  (advancing)\n          Despite being shot, poisoned\n          and thrown into an icy river . . .\n          YES!\n\n                       NICHOLAS\n                  (honestly)\n          I had nothing to do with it!\n\n                       RASPUTIN\n          You gave the orders!\n\n                       NICHOLAS\n          I did no such thing!\n\n                       RASPUTIN\n          After all I've done for your\n          family - YOU TRIED TO KILL\n          MEEEEEE ! ! !\n\nRasputin swings the reliquary, wrapping himself in smoke\nwhich seems to grow larger. Eerie moaning noises come\nfrom the reliquary. PEOPLE back awayin terror.\n\n                       RASPUTIN (CONT.)\n          The Romanov dynasty ends here!\n          You, your wife and children\n          will all die within the\n          fortnight!\n\n                       ANASTASIA\n          NO!\n\nAnastasia leaves Tatiana and rushes to stand in front of\nher father. Still holding her Music Box, Anastasia's\nshaking hands are the only thing that gives away her \nfear. Rasputin spins toward the voice.\n\n                       ANASTASIA\n          We're not afraid of you!\n\n                       RASPUTIN\n                  (furious)\n          You . . .  my little babushka . . .\n          you'll be so much fun to kill \n          that I'll save you for last!\n\nTwirling the reliquary again, the MOANS grow louder as\nBartok circles around his head. The smoke that emerges\nseems to have almosy a human shape to it.\n\n                       RASPUTIN\n          THIS IS THE END OF THE ROMANOV\n          LINE - FOREVER !!!!\n\nThe tornada of smoke begins again, whipping into a\nfrenzy and then EXPLODING.\n\nThe smoke clears and Rasputin is gone. As the lights\nreturn to normal the Romanov family all stand together,\nand try to look regal and in control once again.\n\n                       TATIANA (O.C.)\n          Some say Rasputin ad harnessed\n          all the dark powers of evil and \n          that it was his curse which \n          brought about the end . . .\n\n                                             DISSOLVE TO:\n\nthe ROMANOV FAMILY fades into a PORTRAIT OF THE FAMILY.\n\n                       TATIANA (O.C.)\n          I will never know for sure.\n          All I do know is that the\n          beauty of our world was soon\n          Gone . . .  Forever . . .\n\na lick of BRIGHT ORANGE FLAME creeps into view.\n\n\"RULERS OF RUSSIA\"  (VOCAL REPRISE)\n\n   HUGE, OMINOUS VOCALS reprise the onceglorious watlz\nof the Romanovs, heralding the end of their world and\nunderscoring the coming revolution.\n\nPULL BACK\n\nto see the PORTRAIT, a huge FRIEZE which covers an\nentire entire wall, singeing as the FLAME creeps up the nearby\ndrapery, tinting the room in a red glow.\n\nA SCREAMING MOB, some in uniform, some not, has crashed\ninto the palace and is heading up the stairs. A few in\nthe mob fire off orange RIFLE SHOTS.\n\nINT. ANASTASIA'S BEDROOM - NIGHT\n\nAnastasia BOLTS UP, hearing the shots. Her music box is\nnext to her on her nightstand.\n\nINT. HALLWAY - NIGHT\n\nMass confusion as the MOB is met by a few SERVANTS, who\ntry to stop them from advancing. More shots.\n\nON THE ROMANOV'S\n\nstill in nightclothes, are being rushed down the\nhallway. Tatiana is next to Anastasia as Anastasia\nstopsdead in her tracks.\n\n                       ANASTASIA\n          My music mox!\n\nAnastasia turns around and runs back down the hall.\nTatiana tries to stop her.\n\n                       TATIANA\n          Anastasia, no!\n\nIt's too late, Anastasia fights her way back into her\nroom, with Tatiana following her.\n\nFROM THE OTHER END OF THE HALLWAY\n\nwe see Dmitri watching amidst all the confusion.\n\nINT. ANASTASIA'S BEDROOM - NIGHT\n\nAnastasia grabs her music box as Tatiana rushes in.\n\n                       TATIANA\n          Hurry, child!\n\nLOUD RIFLE SHOTS are heard as Dmitri bursts into the\nroom, closing the door behind him.\n\n                       DMITRI\n          No - this way!\n\nDmitri runs to a wall panel and thows his weight\nagainst it. It opens, revealing a passage way.\n\n                       DMITRI (CONT.)\n          Go!  Run!!  Out the servant's\n          quarters!\n\nTatiana, enormously grateful, looks at Dmitri as he\nflips his hair out of his face unconsciously.\n\n                       DMITRI\n          Go!\n\nTatiana goes in as Dmitri shoves Anastasia toward the\npassageway, knocking the music box out of her hand.  She\nreaches for it, but hearing the mob voices growing\ncloser, he pushes her through the panel without it.\n\n                       DMITRI (CONT.)\n          Go!\n\nTatiana quickly follows Anastasia into the passageway\nand Dmitri closes the panel JUST AS the mob bursts in.\n\n                       DMITRI (CONT.)\n                  (lying to the mob)\n          No one's here! Let's try the\n          next room!\n\nThe MOB, accepts the word of a peasant boy and rushes\nout. Dmitri picks up the music box and looks sadly\ntoward the panel.\n\nEXT. TRAIN STATION - NIGHT\n\nWhich is under siege by ROYALISTS trying to board the\novercrowded train and the REVOLUTIONARIES who are trying\nto stop them.\n\nA TOURING CAR pulls up RIGHT ON THE TRACKS behind the\ncaboose as the train starts to pull away.\n\nTatiana and Anastasia climb out of the car and race for\nthe train, fighting their way through the frenzied and\nfrightened crowd. WE HEAR shouts of \"The Empress - let\nher through!\" which helps clear the way.\n\nAnastasia reaches the train first, then turns to see\nTatiana. trying to catch up.\n\n                       ANASTASIA\n          Hurry, Grandmama!\n\n                       TATIANA\n          Get on! Anastasia, get on!\n\nAnastasia refuses to board the train.\n\nUP AHEAD\n\nA MOB OF REVOLUTIONARIES block the tracks with a TRUCK\n\nON ANASTASIA\n\nwho pushes Tatiana up the stairs of the caboose. This\nputs Anastasia a few steps behind as the train speeds\nup. Tatiana is gripped by other passengers as she\nreaches out to Anastasia.\n\n                       TATIANA\n          Grab my hand!\n\nAnastasia reaches up and takes Tatiana's hand.\n\n                       ANASTASIA\n          Don't let go!\n\nCLOSE ON\n\nthe TWO HANDS. then suddenly. her small hand is pulled\nfrom Tatiana's grasp and falls out of the frame.\n\n                       TATIANA (O.C.)\n          ANASTASIA!\n\nON ANASTASIA\n\nwho has stumbled, hitting the ground hard.\n\nON TATIANA\n\nhorrified, screaming:\n\n                       TATIANA\n          ANASTASIA!\n\nTatiana rushes to jump off the train after her, but is\ncaught and held back by the ROYALIST PASSANGERS as the\ntrain CRASHES through the truck and picks up speed.\n\nTATIANA's POV:\n\nAnastasia rising from the ground, her hand outstretched.\nBut she is suddenly swallowed up by the mob.\n\n                                             SUPERIMPOSE:\n\nA BLACK AND WHITE PHOTOGRAPH\n\nof Anastasia, in a happier time, smiling.\n\nUNDERSCORE:  \"THE MUSIC BOX THEME\"\n\n                       TATIANA (O.C.)\n          I never saw her again. . . \n\nThe PHOTO ALBUM slowly closes. . .\n\nEND OPENING NUMBER\n                                             DISSOLVE TO:\n\nEXT. ORPHANAGE - DAY\n\nA gray and ugly, post-revolution building with a sign\nabove the door that identifies it:  \"Young Comrades\nWithout Parents\".\n\nINT. ORPHANAGE - DAY\n\nCHILDREN of all ages clean the cold, gray dormitory.\nTheir clothes are ragged and they look underfed.\n\nCLOSE ON\n\nANYA, 18, pretty despite the boy's hand-me-down clothes\nshe is forced to wear, is busy scrubbing the floor.\nUnlike the others, she is determined not to let her\nsurroundings get to her. She hums a tune.\n\nThe door suddenly SLAMS open and GREGOR, 8, and clearly\nterrified, comes running in followed by COMRADE\nPHLEGMENKOF - a huge woman carrying a switch.\n\n                       GREGOR\n          Anya! Anya!\n\nAll of the OTHER KIDS turn away, not wanting to get\ninvolved.  Anya focuses on Gregor, who  is shivering with\nfright and on the verge of tears as Phlegmenkof\napproaches, swinging the switch menacingly.\n\n                       PHLEGMENKOF\n          You can't get away from me\n          now . . .\n\nPhlegmenkof advances on Gregor.  Anya takes the scrub\nbrush and SHOVES it across the floor, right under\nPhlegmenkof's unsuspecting foot.  Phlegmenkof's feet fly\nout from under her and she SMASHES to the floor. Gregor\nhops over her huge body and runs to Anya for safety.\n\nSome of the OTHER KIDS glance over. A CHUBBY GIRL and a\nvery pretty LITTLE GIRL, look at Anya with greeat\nadmiration . . .  someof the OTHERS think she's crazy.\n\nPhlegmenkof rises, covered with soap bubbles , and spins\non Anya - who gives her a very innocent smile.\n\n                       PHLEGMENKOF (CONT.)\n          You! You did this!\n\nSome of the OTHER CHILDREN laugh as soap bubbles fly off\nthe enraged woman.  She spins on them, her back to Anya.\n\n                       PHLEGMENKOF (CONT.)\n          Brats!  There'll be no supper\n          for any of you!  Back to work!\n\nAnya, behind Phlegmenkof, mimics her outraged face and\nangry gestures perfectly - as the CHILDREN laugh harder.\n\nPhlegmenkof spins and almost catches Anya.  She advances\non Anya as Gregor hides behind her legs.\n\n                       ANYA\n          Don't touch him. \n\n                       PHLEGMENKOF\n                  (to Anya)\n          You ragged, skinny, little\n          nothing!  I have had just about\n          enough of you . . .\n\nPhlegmenkof raises her hand to slap Anya, who hold her\nground.  Suddenly, Phlegmenkof SNIFFS the air.\n\nON THE KIDS\n\nas the horrible smell reaches them too.  They all make\nfaces and hold their noses.\n\nON PHLEGMENKOF\n\nwho first sniffs under her raised arm, then realized the\ncause of the stench . . .\n\n                       PHLEGMENKOF (CONT.)\n          Comrade Serebreakov!\n\nShe tries to straighten herself out nervously - this\nmust be someone very important.\n\nCOMRADE SEREBREAKOV stands in the doorway, lecherously\neyeing the girls.  He is a huge, fleshly man with facial features which are reminiscent of a fish.\n\n                       PHLEGMENKOF  (CONT.)\n                  (flirting)\n          Comrade Serebreakov!  What a\n          lovely surprise! What brings\n          you here?\n\n                       SEREBREAKOV \n          I need. . . a worker.\n\nHis eye catches Anya. He looks her up and down, his\nbeady eyes showing a touch of lust for her.\n\n                       SEREBREAKOV (CONT.)\n          I will take her.\n\nHe leans close close to Anya.\n\n                       SEREBREAKOV (CONT.)\n          Tomorrow you begin your life's\n          work in my hearing factory.\n          You'll start by cutting off the\n          tails - but if I'm pleased with\n                       (MORE)\n\n                       SEREBREAKOV (CONT.)\n          you - you just may move up to\n          cutting off the heads.  How\n          does that sound?\n\n                       ANYA\n          About as bad as you smell!\n\nPhlegmenkof moves between them, pulling Serebreakov\naway.\n\n                       PHLEGMENKOF \n          No, no, Comrade - you don't\n          want her . . .\n\n                       SEREBREAKOV\n          I want her.\n\n                       PHLEGMENKOF\n          That's horrible, skinny thing?!\n          She's crazy - she has no memory\n          of anything before she came\n          here! She didn't even know her\n          name! That one is a rotten\n          troublemaker, willful. . .\n\n                       SEREBREAKOV\n          I'll break her will. . .\n                  (to Anya)\n          I shall come for you tomorrow\n          at dawn.\n                  (he touches her face as\n                   she pulls away)\n          You will enjoy serving under\n          me.\n\nSmiling in anticipation, he exit.\n\n                       PHLEGMENKOF\n          I couldn't break you - but he\n          can!\n\nAnd she turns to leave in a huff. Anya does one more\nimitation of her, making the CHILDREN laugh. But as\nAnya turns away from her audience, we see her facade\nfade and realize her terror of the future.\n\n\nINT.  ORPHANAGE - NIGHT\n\nThe CHILDREN huddle in their cots under tattered, thin\nblankets. Anya is fully dressed, illuminated by the\n\nlight of a FULL MOON, she ties a dull gray sheets together\nand anchors the \"rope\" to an ice cold radiator and\nthrows the other end out of the window.  She is about to\nclimb out when she looks at the sleeping children and\nsmiles sadly. She walks over to Gregor's bed and puts\none hand lovingly on his head and then reaches over and\ntakes the hand of a sleeping LITTLE GIRL, who opens her\neyes and smiles.\n\n                       GREGOR\n                  (loudly)\n          Anya?\n\nThe other childern wake up as Anya gently \"shushes\" him.\n\n                       GREGOR (CONT.)\n                  (quietly)\n          Are you running away?\n\n                       ANYA\n          No.  I'm running to.\n\n                       LITTLE GIRL\n          Running to? Running to what?\n\n                       ANYA\n          To find my home.\n\nA CHUBBY TWELVE YEAR OLD GIRL looks at Anya.\n\n                       CHUBBY GIRL\n          But you are home.\n\n                       ANYA\n          No. This isn't a home - it's \n          just a building. Home is where\n          you belong and none of us\n          belong here.\n\n                       GREGOR\n          Where is your home, Anya?\n\n                       ANYA\n          I'm not sure but look. . .\n\nAnya shows Gregor the key around her neck.\nCLOSE UP on the inscription:  \"Together in Paris\"\n\n                       ANYA\n          It says \"Together in Paris\". I\n          was wearing this when I came\n          here ten years ago - it's the\n          only way that I know . . .\n\n                       ANYA (CONT.)\n                  (beat)\n          . . .  that I must have been\n          someone someone loved.\n\n                       CHUBBY GIRL\n          Is your home in Paris?\n\n                       ANYA\n          It might be. I have to go and\n          find out.\n\nAnya smiles lovingly at the children.\n\n\"A SOMEPLACE AND A SOMEONE\"\n\n    (Anya's \"I want\" song).  Anya SINGS SOFTLY to the\nchildren about how all she has is the key around her\nneck to the \"someone and thesomeplace\" she was \"lost\nfrom long ago\".  She tells the children that she must go\nfind them again.\n\nUNDERSCORE continues.\n\n                       ANYA\n          I have to go now, before it\n          gets light.\n\n                       GREGOR\n                  (worried)\n          But what if we can't ever find\n          where we came from?!\n\n                       ANYA\n          Then you'll have to make your\n          own home. Lots of people do.\n\nAnya embraces the children and walks to the window.\n\n                       GREGOR\n                  (nervous, sad)\n          Anya! What if we can't find\n          anyone who loves us?!\n\n                       ANYA\n          Then come find me.\n\nGregor is relieved and cuddles into his bed as Anya\nsmiles lovingly and crawls out the window.\n\nEXT.  ORPHANAGE - NIGHT\n\nAnya begins to climb down the street, testing the knots.\nThe knotshold tight, but the old sheet RIPS in half,\nsending her PLUMMETING into a snow drift.  From the\ndepths of the snow we HEAR her voice.\n\n                       ANYA (O.C.)\n          I hope there's no snow in\n          Paris. . .\n\nEXT.  HILLSIDE - DAWN\n\nA glorious bright (and cold) dawn creeps over the\nhorizon. Anya stands at  edge of the hill, looking\ndown on the city of ST.PETERSBURG. The old gray\norphanage looms behind her. Anya \"borrows\" an old,\nbeat-up bicycle from the orphanage and rides down the\nhill.\n\nMusic picks up in energy and excitement as Anya zooms on\nher way bumping and bouncing downhill as the sunrises\nand St. Petersburg looms nearer.\n\n\"A SOMEONE AND A SOMEPLACE\" (CONT.)\n\n    Music becomes UPTEMPO, HOPEFUL, ACTIVE, ACTIVE. Anya SINGS -\n- full of hope, energy and excitement as she peddls her\nrickety bike toward the city. \"Her heart is on its way\"\nand nothing is going to stop her.\n\nAnya passes though the countryside toward the city. A\npeasant family waves to her as she goes by. A Gypsy\nTroupe performs tricks by the side of the road. A very\nfancy car zooms by.\n\n\"A SOMEONE AND A SOMEPLACE\" (CONT.)\n\n   Anya SINGS, imagining who she might be -- anyone from\na peasant to a princess! But it doesn't matter as long\nas she finds her real family.\n\nPeople stare at her as she rides into the edge of the\ncity. She is captivated by all the activity:  cars,\nbusses, stores, long lines of people, etc.\n\n\"A SOMEONE AND A SOMEPLACE\"  (CONT.)\n\n   Anya SINGS -- in this sea faces, there must be\nsomeone who has a clue to her identity.  She'll stop at\nnothing to find the someone who once loved her.  SOARING\nMUSICAL AND VOCAL CONCLUSION.\nEND MUSICAL NUMBER\n\nAnya does not see a cute little PUPPY (MEETOO) with a\nHUGE BONE in his mouth, being chased along the sidewalk\nby a pack of much larger, vicious DOGS until he bolts\nacross Anya's path forcing her to skid to a stop. She\nwatched him as he scoots into an alley, followed by the\nangry pack.\n\nOn reflex, Anya drops the bike and reuns into the alley\nafter him.\n\nEXT.  ALLEY - DAY\n\nMeetoo is trapped.  The PACK surrounds him, ready to\npounce when Anya LEAPS into the middle of the circle.\nThe PACK is startled, but begins to advance on both Anya\nand Meetoo.\n\nAnya doesn't know what to do. She crouches and then. . . \ngrowls back at them, making her eyes look as ferocious\nas possible. The PACK exchange a confused look; there's\na girl growling at them. Meetoo stands, suddenly brave,\nbehind her and growls along with her.\n\nSuddenly, Anya pounced toward the pack, growling louder.\nThe pack has definately had enough - some start to back\nout quizzically, others turn and run like hell.\n\nAnya turns to Meetoo, who looks up at her gratefully,\nwagging his tail. Anya picks up the bone and puts it\nback in his mouth.\n\n                       ANYA\n          I think you should be more\n          careful about who you invite to\n          dinner!\n\nMeetoo nods and lets out a little \"bark\" that sounds as\nif he were saying \"retu\".  Anya pats him and heads back\nto her bike.\n\nEXT.  ST. PETERSBURG STREET - DAY\n\nAnya rides down the street. She doesn't see Meetoo,\nrunning like a little maniac behind her.\n\nAnya approaches a STERN LOOKING BUILDING with a sign\nover the door: \"The People's Bureau of Bureaucracy\".\n\nShe leaps off her bike and heads up the stais. Meetoo,\nbreathing heavily from his run, follows and almost\nreaches her when the heavy door slams in his face.  He\nslumps against it, panting, his little paw-to chest.\n\nINT. BUREAU OF BUREAUCRACY - DAY\n\nAnya enters and STOPS when she sees. . . LINES and LINES\nof people which seem to go on forever.  She walks down\nthe side of one line, trying to figure out which one to\nstand in.\n\n                       ANYA\n          Could someone tell me. . .\n\n                       PEASANT 1\n          End of the line!\n\n                       ANYA\n          Which line?\n\n                       PEASANT 2\n          Any line.\n\n                       PEASANT 3\n          All lines are good lines.\n\n                       PEASANT 1, 2, & 3\n                  (in unison)\n          In our beloved Soviet Union!\n\nThey turn toward an armed Soviet Guard and smile\nsweetly, hoping he heard their flattery.  He did.\n\n                       GUARD\n          Very good. . . \n\nHe jots something down in his notebook.\n\nON ANYA\n\nas she gets closer to the window. She turns to the\nperson behind her.\n\n                       ANYA\n          Is this the right line to get\n          papers to travel?\n\n                       PEASANT 4\n          Travel? Travel to where?\n\n                       ANYA\n          To Paris. I have to get to\n          Paris\n\nPEASANT 5, in front of her, turns around.\n\n                       PEASANT 5\n          Paris?!  What do they have in\n          Paris that they don't have\n          here?\n\n                       PEASANT 6\n          Shorter lines?!\n\nPeasant 6 is immediately carted off by TWO ARMED GUARDS\nfor his blasphamy against the state.\n\n                       PEASANT 7\n                  (quietly)\n          Nobody leaves Soviet Russia.\n\nThe OTHER PEASANTS join in with variations of \"Nobody\nleaves Russia\" as Anya reaches the window and speaks to\nthe clerk.\n\n                       ANYA\n          Is this where I get traveling\n          papers?\n\n                       CLERK\n          It would be if we let you\n          travel which we  don't so it\n          isn't.\n                  (loudly, for all to\n                   hear)\n          Russia is the people's \n          paradise!\n\nAnd to further make his point, he slams shut his window,\nwhich immediately opens a crack as he whispers to Anya.\n\n                       CLERK (CONT.)\n          See Dmitri. He can help.\n\nHe shuts the window, only to open it again immediately.\n\n                       CLERK (CONT.)\n          But you didn't hear it from me.\n\nHe shuts the window.\n\n                       ANYA\n                  (doesn't get it)\n          I didn't\n\nHe opens it again.\n\n                       CLERK\n          No.\n\nThe clerk sticks out a sign:  \"Samovar Break - back in\nten minutes\" and slams the window shut.\n\nEXT.  BUREAU OF BUREAUCRACY\n\nAnya steps out of the building, still not seeing Meetoo\nand looks around at the hoards of people waiting in\nlines for everything:  bread, gas, clothes, etc.\n\n                       ANYA\n                  (to herself)\n          Dmitri? There must be a\n          million Dmitris. . . \n\nFOLLOW ANYA\n\nas she wades into the crowded street. Meetoo getting\ntangled in the legs of waiting Soviets.\n\nAnya stops suddenly. She sniffs the air.  Her eyes\nwiden as she recognizes the stench that is floating\nthrough the air.  She spins around and sees Serebreakov\nDIRECTLY ACROSS THE STREET.\n\nSerebreakov is on a mission to find Anya.  He turns in\nher direction just as a bus passes.  Anya is gone.\n\nWe now see Anya clinging to the side of the bus as it\ndrives down the street. Meetoo looks, his face dropping\n- he knows he'll never catch up to her now.  Then he\nsees the bus hit a huge pothole and Anya is knocked off\ninto the mud.  Happily, Meetoo trots off in her\ndirection.\n\nAnya approaches TWO PEASANTS who are waiting in line in\nfront of a cafe.\n\n                       PEASANT 9\n                  (to Peasant 10)\n          Which line is this?\n\n                       PEASANT 10\n          The line to get into the line.\n\n                       ANYA\n          Excuse me, do you know\n          Dmitri. . . \n\n                       PEASANT 9\n          I know nothing!\n\n                       PEASANT 10\n          Nothing!\n\n                       PEASANTS 9 & 10\n                  (whispering\n                   simultaneously)\n          Try the tavern/ library.\n\nThey begin to bicker back and forth in forced whispers\nas to wether Dmitri is at the tavern or the library.\nExasperated, Anya walks away.  They call after her.\n\n                       PEASANTS9& 10\n          But we didn't tell you!\n\nAnya rolls her eyes in frustration.  She doesn't see\nMeetoo at her feet.\n\n                       ANYA\n                  (To herself)\n          I wish they'd all stop telling\n          me they didn't tell me!\n\nMeetoo gives a \"retu\" of agreement. Anya looks down and\nsees him.\n\n                       ANYA (CONT.)\n          What are you doing. . .\n\nJust then, she catches another whiff of something foul\nin the air. Anya duck quickly into a doorway and loses\nMeetoo. Anya peeks out. A GARBAGE WAGON full of dead\nfish and rotten food passes Anya.  She sighs with relief,\nit wasn't Serebreakov - it just smelled like him.\n\nAnya steps out of the doorway and approaches a STREET\nARTIST sketching a LARGE PEASANT WOMAN as her TINY\nHUSBAND looks over his shoulder.\n\n                       TINY HUSBAND\n                  (To Artist)\n          Could you get rid of her\n          moustache?\n\n                       ANYA\n          Excuse me - I'm looking for a\n          man named Dmitri. . .\n\nThe Artist quickly scribbles and address on his pad and\nhands it to her without turning around.\n\n                       ARTIST\n          But I didn't write it.\n\nAnya looks down at the note\n\nCLOSE ON NOTE\n\n\"St. Petersburg Art Theatre - 99 Pushkin Street\"\n\n                                             DISSOLVE TO\nA SIGN\n\n\"Pushkin Street\"\n\nCAMERA PANS TO:\n\nEXT.  ST. PETERSBURG ART THEATRE - DAY\n\nWhere WE HEAR a cacophony of FEMALE VOICES as the camera\nmoves inside.\n\nINT.  ST. PETERSBURG ART THEATRE\n\nThe waiting room is filled with YOUNG WOMEN, of various\nshapes and sizes, holding reading aloud from a piece of\npaper. WE HEAR many variations of \"Oh, Grandmama! It's\nme, Anastasia. I've waited so long to see you\".\n\nINT.  STAGE\n\nAn ACTRESS stands in front of what looks to be an OLD\nWOMAN in a shawl who's back is to the \"audience\".\n\n                       ACTRESS 1\n                  (over the top)\n          Oh, Grandmama! It's me,\n          Anastasia! I've waited so\n          long to see you!\n\nThe Actress then LUMBERS over to the OLD WOMAN, with a\ngait like John Wayne.\n\nREVERSE ANGLE\n\nto see the \"Old Woman\" is Vladimir, with a shawl over\nhis head.  He looks older, of course, but with the same\ndapper mustache. He rolls his eyes.\n\n                       VLADIMIR\n                  (out to audience)\n          Dmitri!  I can not work with\n          her!\n                       (MORE)\n\n                       VLADIMIR (CONT.)\n                  (to Actress)\n          May I remind you that you are\n          supposed to be Princess - not a\n          lazy lumbering lout!\n\nIN THE SEATS\n\nis Dmitri. Now 20 and darkly handsome. His hair still\nfalling in his eyes as he flips it off his forehead.\n\n                       DMITRI\n          Vladimir, calm down!\n\nVladimir walks off the stage and toward Dmitri.\n\n                       VLADIMIR \n          This, my friend, as an exercise\n          in futility! We shall never\n          find a girl to play the\n          Princess Anastasia out of this\n          motley crew of commoners!\n\nVladimir dramatically throws one end of his shawl over\nhis shoulder.\n\n                       DMITRI\n          For a ten million rubles reward\n          we can look a little longer.\n          This is the big one. . .  and all\n          I need is the right girl.\n\n\"A SOMEONE AND A SOMEPLACE\"  (REPRISE\n\n   (Dmitri's \"I want\") Dmitri SINGS a reprise of Anya's\nsong, a COMIC VERSION, in which he expresses the hope\nthat he can find the right girl for his scam. Anyone\nfrom a peasant to a princess will do, as long as she can\nfool Tatiana. (NOTE:   We don't want to give Dmitri a\nwhole new song here or we'll be too song-heavy in Act I.\nBy giving him a short reprise of Anya's song, we can\neffectively align these two characters emotionally.)\n\nQUICK CUTS:\n\nof various aspirants:\n\n                       ACTRESS 2\n                  (heavy hasal)\n          Oh, Grandmama! It's me,\n          Anastasia. I've waited so long\n          to see you.\n\n                       DMITRI (O.C.)\n          Next!\n\n                       ACTRESS 3\n                  (stupid)\n          Oh. . .  Grandmama it's me.\n          Anastasia, I have waited so\n          long, too.\n                  (as a good-bye)\n          See you!\n\n                       DMITRI (O.C.)\n          Next!\n\nACTRESS 4 looks like a hooker and sounds like Mae West.\n\n                       ACTRESS 4\n          Oh. . . Grandmama. . .  It's me. . . \n\n                       DMITRI (O.C.)\n          Next!\n\nBACK TO DMITRI\n\n                       DMITRI \n          I wouldn't be on the outside\n          anymore.  The ten million\n          rubles would make me welcome\n          anywhere.  I'd really belong\n          somewhere - if I could just\n          find the right girl.\n\nBACK TO QUICK CUTS:\n\nA very round ACTRESS 5\n\n                       ACTRESS 5\n          Oh, Grandmama. . .\n\n                       DMITRI (O.C.)\n          Next!\n\n                       ACTRESS 6\n                  (very intense)\n          What's my modivation?\n\nON VLADIMIR\n\n                       VLADIMIR\n                  (calling out to seats)\n          Stanislavski!\n\nCUT TO STANISLAVSKI\n\nshrugs innocently.\n\n                       DMITRI (O.C.)\n          Next!\n\nACTRESS 7 is actually a man.\n\n                       ACTRESS 7\n          Oh. . .\n\nON DMITRI\n\nin a state of disbelief.\n\n                       DMITRI\n          I've gotta find the right girl!\n\nEND MUSICAL NUMBER\n\n                       DMITRI\n          Next.\n\nEXT.  ST. PETERSBURG ART THEATRE\n\nAnya rides up to front of the theatre and drops her\nbike.  She rushes the steps.\n\nINT.  THEATRE\n\nnow empty as Dmitri and Vladimir are gathering up their\nthings to leave.  Vladimir still wears the remnants of\nthe evening clothes that he worein the first scene.\n\n                       VLADIMIR\n          It's no use, Dmitri - we'll\n          never find the right girl!\n\n                       DMITRI\n          We will.  We have to.\n                  (trying to cheer him\n                   up)\n          Come on, Vlad - she's out\n          there.\n\nThey walk out the door.\n\nEXT.  ST. PETERSBURG ART THEATRE - CONTINUOUS\n\n                       DMITRI\n          She could be right under our\n          nose\n\nAnya is running up the stairs as Dmitri walks out and\nthey COLLIDE:  her forehead banging Dmitri literally\nunder his nose.  Dmitri grabs his upper lip in pain.\n\n                       DMITRI\n                  (over reacting)\n          Ouch!  That really hurt!\n          \n                       ANYA\n          I'm sorry. . .  I'm. . . \n\n                       DMITRI\nThat's quite a hard head you've\ngot there, boy.\n\nIn her old hand-me-down boys clothes andhat pulled low,\nshe could easily be mistaken for a boy.\n\n                       ANYA\n                  (breathless)\n          I'm looking for Dmitri.  I need\n          traveling papers - to Paris. I\n          heard Dmitri could help me.\n\nVladimir and Dmitri exchange a look. . .  wary. . .  Dmitri\nlooks around and motions to Vladimir to handle it while\nhe walks ahead nonchalantly.\n\n                       VLADIMIR\n          Who did you hear it from?\n\n                       ANYA\n          I heard it from everyone who\n          said I didn't hear it from\n          them!   Do you know Dmitri?\n\nDmitri keeps walking ahead followed by Vladimir. Anya\nis determined not to give up and keeps up with Vladimir\neven though she keeps getting bumped and pulled off\ntrack by people walking in the opposite direction.\n\n                       VLADIMIR\n                  (loudly, acting)\n          Providing travel papers is\n          illeagal!\n                  (then, quietly)\n          I know Dmitri well - perhaps I\n          can help you.  Providded you\n          have enough money to pay for\n          this service. . . \n\n                       ANYA\n          Well, I don't have any money . . .\n\n                       VLADIMIR\n          Good day!\n\nVladimir pats her on the head and walks away.\n\n                       ANYA\n          I have a bike!  Perhaps I could\n          sell it and. . . \n\nVladimir keeps walking, catching up to Dmitri.\n\nAnya runs back around to the front of the building where\nshe left her bike.  She stops suddenly when she realizes\nthat there is no bicycle there anymore - just Meetoo.\n\n                       ANYA (CONT.)\n          What are you doing here?  And\n          where's my bike?\n\nA POLICEMAN strolls by.\n\n                       ANYA (CONT.)\n          Officer!  My bike has been stolen!\n\n                       POLICEMAN\n          Nonsense.  There is no crime in\n          the Soviet Socialist Republic.\n\nAnd he keeps walking. Anya realizes that there is no\nhope in pursuing the policeman so she heads off to find\nVladimir - who has vanished down the street.  Meetoo\nstarts to follow her.\n\n                       ANYA\n          Sorry, boy, I have to go.\n\nMeetoo barks \"retu\" and starts after her.\n\n                       ANYA (CONT.)\n          No.  You can't come with me.\n          I'm leaving. . .\n\nMeetoo barks his \"retu\" and starts after her again.\n\n                       ANYA (CONT.)\n                  (laughing)\n          It sounds like you're saying\n          \"me too\".  Listen little guy, I\n          have money, no food. . .  and\n          no bicycle.  I'm the last\n          person you should be following!\n\nAnya pats him on the head and heads off in the direction\nof Vlad and Dmitri.  Meetoo, of course, follows her.\n\nFURTHER DOWN THE STREET\n\nAnya spots Vladimir and Dmitri turning the corner in the\ndistance.  Anya runs, trying to catch up with them.  She\nturns the corner and STOPS.\n\nANYA'S POV\n\nthe PALACE in the distance, only now it's run down,\nboarded up and partially burned.\n\nAnya is taken back.  She stares, fascinated by it -\nmoved by it .  As the sun sets behind the Palace, it's\nbathed in a beautiful golden light.\n\nINT.  PALACE BEDROOM - NIGHT\n\nCLOSE on a roaring fire, over which Vladimir has\nfasioned a roatating \"spit\" which is propelled by a\nVictrola.  Vladimir is carefully basting the only thing\non the spit:  a head of cabbage.\n\nDmitri is sitting by the window, staring at the MUSIC\nBOX that Anastasia dropped the night of the revolution.\n\n                       VLADIMIR\n          . . .  even if we find her, what\n          makes you think the\n          Empress will even see us?\n\nDmitri holds up the music box.\n\n                       DMITRI\n          She'll see us.\n\nEXT.  PALACE AT ST. PETERSBURG - NIGHT\n\nAnya approaches, tentative and glancing around.  She\ntries to open the door but it won't budge, so she moves\nto a boarded up window.  She looks through a crack in a\nboard.\n\nINT.  BALLROOM\n\nDark and eerie.  All of it's former glory destroyed.\nCAMERA RISES to a partially destroyed CHANDLIER ehere\nwe see BARTOK, the bat who was with Rasputin.\n\nHe hangs upside down next to a FEMALE BAT.  He clears\nhis throat - she doesn't respond.  Using his wings, he\ngives his \"hair: a quick grooming.\n\n                       BARTOK\n          You, uhh. . .  hang here often?\n                  (laughs nervously)\n          \"Hang\" get it?  I said \"hang\"\n          and we're both, you know, cause\n          we're bats. . .  and, uhhh. . .\n          what's your sign?\n\nNo reaction from FEMALE BAT.\n\nEXT.  PALACE\n\nAnya uses a stick to pry off some of the window boards.\nWe HEAR a crack.\n\nINT. PALACE BEDROOM\n\nSAME CRACK noises from downstairs just as Vladimir's\ncabbage falls from the spit into the fire.\n\n                       DMITRI\n                  (off noise)\n          What was that?\n\n                       VLADIMIR\n          That was your dinner!  I do\n          hope there is no cabbage in\n          Paris!\n\nINT.  BALLROOM\n\n                       BARTOK\n          Whatta' ya say we go somewhere\n          - maybe get a bug to eat.  Get\n          it?  A \"bug\" to eat, 'cause\n          we're. . .\n\nFEMALE BAT rolls her eyes in disgust and flaps away.\n\n                       BARTOK (CONT.)\n                  (one last try)\n          I'm a Gemini. . . \n\nHe hears the SOUND of boards being torn off the window.\n\nBARTOK'S HIGH ANGLE POV\n\nAnya climbs into the ballroom.\n\nINT.  SMALL ROOM\n\nMeetoo manages to wiggle in after her and follows Anya\nas she wanders around, spell bound by the faded glory of\nthe palace.\n\nINT. DINING ROOM\n\nAnya wanders into the partially destroyed room and bends\ndown to inspect half of a broken plate that's lying on\nthe floor. The instant she touches it, she pulls her\nhand away as if SHOCKED.  Recovering, she picks it up.\n\nCLOSE ON PLATE\n\npainted with decorative dancing Russian bears.\n\nAnya wanders out of the room and to the top of a HUGE\nSTAIRCASE which leads down to the once grand BALLROOM.\nShe stops at a large landing half way down the steps.\nMeetoo sees a large curtain hanging precariously on the\nside wall.  Being a puppy he can't resist leaping and\ngrabbing at it with his teeth.  Anya notices and runs\nher hand along a the carved butterflies in the worn\nbanister.\n\nON ANYA\n\nwho jumps, startled, as Meetoo pulls the curtain and it\nhits  the floor.\n\nINT.  PALACE BEDROOM\n\nDmitri and Vladimir look up from their burnt cabbage.\nThey heard it too.\n\nINT.  STAIRCASE (BALLROOM)\n\nAnya is relieved to see it is only Meetoo, who wags his\ntail happily with the curtain still in his mouth.\n\n                       ANYA\n          What are you do. . .\n\nAnya STOPS mid sentence, taken by what she sees.\n\nANYA'S POV\n\nBehind the curtain was the FRIEZE of the ROMANOV FAMILY.\nThe moonlight hits the portrait with a ghostly glow.\n\n\"ONCE UPON A DECEMBER\"  (THE MUSIC BOX THEME)\n\nAnya is mesmerized by the FRIEZE.  She looks around the\nBallroom. . . almost remembering something. . . \n\n                       ANYA\n                  (singing)\n          DANCING BEARS, PAINTED WINGS\n          THINGS I ALMOST REMEMBER.\n          AND A SONG SOMEONE SINGS\n          ONCE UPON A DECEMBER\n\nAs she sings the ballroom transform into it's once\nspledid glory.  Anya takes off her coat and at once her\nrags are transformed into a beautiful gown.  NICHOLAS\nsteps down from the FRIEZE and walks her down the stairs\ngracefully and begins a waltz with her.\n\n                       ANYA (CONT.)\n          SOMEONE HOLDS ME SAFE AND WARM \n          HORSES PRANCE\n          THROUGH A SILVER STORM\n          FIGURES DANCING GRACEFULLY\n          ACROSS MY MEMORY.\n\nMUSIC BUILDS.  A CHORUS of voices sing the melody as\nroyal ghosts appear as elegant and beautiful as in the\nopening scene. Then\n\n                       ANYA (CONT.)\n          SOMEONE HOLDS ME SAFE AND WARM \n          HORSES PRANCE\n          THROUGH A SILVER STORM\n          FIGURES DANCING GRACEFULLY\n          ACROSS MY MEMORY.\n\nMUSIC: FULL!\n\nDmitri and Vladimir appear at the top of the stairs.\n\nDMITRI & VLADIMIR'S POV\n\nsome ragged lunatic dancing with \"himself\".\n\n                       ANYA (CONT.)\n          FAR AWAY, LONG AGO\n          GLOWING DIM AS AN EMBER,\n          THINGS MY HEART USED TO KNOW\n          THINGS IT YEARNS TO REMEMBER\n\nAnya is released from Nicholas' embrace.  He kisses her\non the forehead and slowly backs away.  She follows\nNicholas, back up the stairs to the landing, where the\nsun has caused a \"dust\" mist.\n\nThen, magically, TATIANA appears through the mist, a\nloving beautiful vision from the past.\n\n                       ANYA (CONT.)\n          AND A SONG SOMEONE SINGS\n          ONCE UPON A DECEMBER.\n\n                       DMITRI (O.C.)\n                  (yelling)\n          Who are you?!\n\nEND NUMBER\n\nDmitri's voice causes the visage to disintegrate.  All\ngoes back to the way it was - dark and destroyed.\n\nAnya spins toward Dmitri, surprised and frightened.\n\nDMITRI'S POV\n\nAnya is caught in a ray of moonlight, directly in front\nof the image of Anastasia in the frieze.  The\nresemblance is striking.  Dmitri is taken aback, but\nVladimir is unaffected.\n\n                       VLADIMIR\n          You're trespassing, boy!\n\nAnya is dazed by what has just happened to her and can't\nquite refocus on reality.\n\n                       ANYA\n          I. . .  I. . .  spoke to you earlier\n          about traveling paper. . \n\nDmitri pokes Vladimir with his elbow but doesn't take\nhis eyes off Anya.\n\n                       DMITRI\n                  (whispering to Vlad)\n          It's her.\n\n                       VLADIMIR\n          He's her?\n\n                       DMITRI\n          Look!\n\nVladimir looks at Anya again and get it.\n\n                       ANYA\n          Are you Dmitri?  I didn't  mean\n          to trespass - I don't want to\n          do anything dishonest, but if\n          you could just help help me. . .\n\nVladimir and Dmitri walk down the stairs and up her\nstairs and begin to circle around her.\n\n                       VLADIMIR\n          Perhaps you heard of our\n          brilliant plan to find a girl\n          and. . . \n\nDmitri pokes him hard in the ribs and shakes his head.\n\n                       DMITRI\n                  (quietly to Vlad)\n          She doesn't want to do anything\n          \"dishonest\". . . \n\n                       VLADIMIR\n                  (gets it, whispers)\n          Ew. . .  the honest type.\n\nDmitri gives Vlad a \"let me handle this\" gestures.\n\n                       DMITRI\n                  (off frieze)\n          You look like her.  Like the\n          Princess Anastasia.  Has anyone\n          ever told you that before?\n\nAnya is coming back to her senses, doesn't like these\nmen circling her.\n\n                       ANYA\n                  (sarcastic)\n          Oh, yeah - in the orphanage\n          they constantly told me I\n          looked like a princess! Stop\n          that!\n\nDmitri stops circling and then begins to use everything\nthat Anya says - the perfect and charming con man that\nhe is - to get what he wants.\n\n                       DMITRI\n          People say Anastasia was the\n          only member of the Royal Family\n          to escape alive.  That makes \n          her an orphan too\n                       (MORE)\n\n                       DMITRI (CONT.)\n                  (beat)\n          What happened to your parents?\n\n                       ANYA\n          I don't know - I don't remember\n          anything that happened before\n          the revolution. . . \n\n                       DMITRI\n          You know, it's strange -\n          Anastasia's grandmother, the\n          Dowager Empress Tatiana has\n          been looking for Anastasia\n          since the revolution.  Why do\n          you think she wouldn't go to\n          her own grandmother?\n\n                       ANYA\n          I don't know.  I don't see what\n          this has to do with me.\n\n                       DMITRI\n          Perhaps it's because she has\n          amnesia too - can't remember. . .\n\n                       VLADIMIR\n          How much do you weigh?\n\nDmitri pokes him again.\n\n                       VLADIMIR (CONT.)\n                  (to Dmitri)\n          I was just wondering since we\n          already have the dress. . .  \n\n                       ANYA\n          Look, I came here to get papers\n          to travel to Paris and. . .\n\n                       DMITRI\n          Why do you want to go to Paris?\n\n                       ANYA\n                  (defiant)\n          I have my reasons.\n\n                       DMITRI\n          Anastasia's grandmother is in\n          Paris.  We're going to bring\n          Anastasia to her - in Paris.\n                       (MORE)\n\n                       DMITRI (CONT.)\n                  (beat)\n          And I think you are the\n          Princess Anastasia.\n\nAnya laughs.  Vlad mouths to Dmitri \"Do you think she's\nreally Anastasia?\"  Dmitri shakes his head no, of course\nnot, then continues with Anya.  Vlad smiles to himself\nand walks down the stairs - Dmitri's so good even he got\nconfused!\n\n                       DMITRI (CON'T)\n          You never thought of the\n          possibility?\n\n                       ANYA\n          Look - there isn't an orphan in\n          the world who doesn't dream\n          she's a princess but, come\n          on. . .  Look at me!\n\nDmitri spins spins around, dramatically pointing to\nAnastasia's image in the freeze.\n\n                       DMITRI\n          NO!  YOU LOOK AT HER!  LOOK AT\n          HER!\n                  (beat, then softly)\n          It could be you.\n\nUNDERSCORE:  \"THE MUSIC BOX THEME\"\n\nAnya fiddles with the key around her neck and looks down\nat the ballroom, remembering what just happened there -\ncould it have been a memory. . . \n\nDmitri tries to act casual as he turns and starts\nwalking down the stairs.\n\n                       DMITRI (CONT.)\n          You don't have anything to\n          lose.  If I am wrong - the\n          Empress will simply tell us you\n          aren't Anastasia and we'll be\n          on our way.  No harm done - an\n          honest mistake - but at least\n          you will be in Paris.\n\nAnya touches Anastasia's painted hand in the frieze.\n\n                       ANYA\n                  (singing in a whisper)\n          THINGS MY HEART USED TO KNOW\n          THINGS IT YEARNS TO REMEMBER. . .\n\nDmitri looks at Anya, her back toward him, as he raises\nhis arm to her.\n\n                       DMITRI\n          Find out the truth - come to\n          Paris with us.\n\nAnya expression registers her internal debate.  What is\nit's true. . .  It coudn't be. . .  but if. . .  Then,\n\n                       ANYA\n          All right.  I will go with you.\n\nMeetoo let's out his \"retu\".  Vladimir lets out a whoop\nof joy.  Dmitri smiles and bows to Anya..\n\n                       DMITRI\n          The Her Royal Highness Princess\n          Anastasia!\n\nON BARTOK\n\nhaving watched the whole thing - he sighs.\n\n                       BARTOK\n          Oy. . .  he's gonna be so mad. . . \n\nBartok flies out a broken window and into the night.\n\nEXT.  AERIAL VIEW OF ST. PETERSBURG - NIGHT\n\nBARTOK'S POV\n\nThe city lights fade and we move into the blackness of\nthe Russian forest.  Finally, in the distance, we see\nthe orange glow of a fire.\n\nEXT.  GYPSY CAMP - NIGHT\n\nBartok swoops along the wagons.  Everyone looks to be\nasleep.  Bartok keeps flying until he sees an OMINOUS\nLOOKING BLACK WAGON, the largest and most elaborate.\n\nBartok screws up his courage and flies into the open\nwindow of the BLACK WAGON\n\n                       ANYA\n                  (singing in a whisper)\n          THINGS MY HEART USED TO KNOW\n          THINGS IT YEARNS TO REMEMBER ...\n\nDmitri looks at Anya, her back toward him, as he raises\nhis arm to her.\n\n                       DMITRI\n          Find out the truth - come to\n          Paris with us.\n\nAnya expression registers her internal debate. What if\nit's true... It couldn't be... but if... Then,\n\n                       ANYA\n          All right. I will go with you.\n\nMeetoo lets out his \"retu\". Vladimir lets out a whoop of\njoy. Dmitri smiles and bows to Anya.\n\n                       DMITRI\n          The Her Royal Highness Princess\n          Anastasia!\n\nON BARTOK\n\nhaving watched the whole thing - he sighs.\n\n                       BARTOK\n          Oy. . .  he's gonna be so mad...\n\nBartok flies out a broken window and into the night.\n\nEXT.\tAERIAL VIEW OF ST. PETERSBURG - NIGHT\n\nBARTOK'S POV\n\nThe city lights fade and we move into the blackness of\nthe Russian forest. Finally, in the distance. we see\nthe orange glow of a fire.\n\nEXT.\tGYPSY CAMP - NIGHT\n\nBartok swoops along the wagons. Everyone looks to be asleep.\nBartok keeps flying until he sees an ONIOUS LOOKING BLACK\nWAGON, the largest and most elaborate.\n\nBartok screws up his courage and flies into the open\nwindow of the BLACK WAGON.\n\nINT.\tRASPUTIN'S WAGON\n\nA lone candle lights the dark wagon. A frightened Bartok,\nstays on the window sill.\n\n                       BARTOK\n          Ummm ... Father Gregori? It's,\n          uhh ... me. Bartok.\n                  (a sign of relief)\n          Phew! Not home ...\n\nRasputin's face suddenly ROARS into FRAME from the bed\nbelow, his eyes fiery red and his beard wild.\n\n                       RASPUTIN\n          What?\n\n                       BARTOK\n          Oh my God!\n                  (wing to chest)\n          Don't do that ... feel my heart.\n          Go ahead. I'm dying here ...\n\n                       RASPUTIN\n                  (smiling)\n          And what do you want, my little\n          rat-with-wings?\n\nRasputin rises and pours himself a glass of vodka.\n\n                       BARTOK\n          Name calling! That's mature.\n\nRasputin grabs him by the throat.\n\n                       RASPUTIN\n          I gave you that tongue and I\n          can rip it out!\n\n                       BARTOK\n                  (strangled)\n          No, I really like my tongue...\n          we're very attached.\n                  (rasputin releases him)\n          Oyyyy... Okay, now... promise\n          you won't get angry.\n\n                       RASPUTIN\n                  (sweetly)\n          Why would I ever be angry with\n          you, little friend?\n\n\n                       BARTOK\n          Yeah, right. Keep that thought\n          okay? So, I'm in town, stop by\n          the old palace. You get a better\n          class of bats there - no tattoos\n          or anything.\n\nRasputin rummages around for a full bottle of vodka,\ntossing the empties - which Bartok has to dodge.\n\n                       BARTOK (CONT.)\n          So, I'm cruisin' the rafters and...\n          what can I say, I struck out. I\n          thought chicks would like the fact\n          that I can talk, you know but,\n          I mean, the way things are going\n          I couldn't get invited to a plague.\n                  (a bottle smashes)\n          Someone's gotta clean that up...\n\n                       RASPUTIN\n          Get to the point sometime tonight..\n          I'm late for a wenching.\n\n                       BARTOK\n          Okay... you're not gonna like this\n          but, well, it looks like Anastasia\n          is ... still alive.\n\nHe tenses, waiting for Rasputin's explosion but Rasputin\njust laughs.\n\n                       RASPUTIN\n          Impossible. That rumor's been\n          around for years.\n\nBartok hovers face-to-face.\n\n                       BARTOK\n          Trust me, it's her!\n\n                       RASPUTIN\n                  (eyes narrowing)\n          How do you know?\n\n                       BARTOK\n          Rodent's intuition, how do I know?\n          She looks exactly like her.\n          Except she's taller,\n          which\tis natural ... Of course\n          my second cousin Treplev - he\n          never\tgrew. Looks like a\n          little pepper shaker. He was\n          so cute ...\n\nRasputin begins a slow growl that builds.\n\n                       BARTOK (CONT. )\n          Oyyy... I knew this was gonna\n          to upset him!\n\nRasputin howls in anger and smashes his glass against\nthe wall. He moves toward the CABINET, knocking over\nfurniture. Rasputin flings open the cabinet and we see\nthe RELIQUARY, glowing gently as if it were sleeping.\nBartok covers his eyes in fear. Even Rasputin seem a\nbit nervous in front of it.\n\n                       RASPUTIN\n                  (with reverence)\n          Source of my power. Owner of\n          my soul. I need your help.\n\nRasputin takes the RELIQUARY out of the cabinet and\nsets it on the table.\n\n                       BARTOK\n          Hey, she's just a kid. And she's\n          going to Paris outta sight,\n          outta mind, outta Russia.\n\n                       RASPUTIN\n          I cursed then all!\n\n                       BARTOK\n          My Aunt Bella, sweet woman not\n          the brightest bat in the world -\n          she used to hang right side up,\n          anyway she always said \"Curses\n          were made to be broken\". Course,\n          she said it in those irritating\n          little bat squeaks, so it wasn't\n          quite so profound...\n\nRasputin pulls out a set of RUSSIAN DOLLS (a small\npainted. hollow doll with a smaller doll inside it,\nand a smaller doll inside it, etc.) The first doll\nbears an eerie resemblance to Nicholas. Inside the\nsecond looks like Alexandra, all the way down to the\nANASTASIA doll.\n\n\"THE END OF THE LINE\" (PRODUCTION NUMBER)\n\nRasputin will have a DARK, MENACING, DELICIOUSLY\n\nSCARY NUMBER in whIch he SINGS of his obsession with\nkilling the Romanovs once and for all. Bartok will\ninterject comically throughouut. as Rasputin \t\nwill conjure up tLis minions from the iquary and sing\nabout Romanovs FINALE, he sends them off after Anya.\n\nSONG TO INCORPORATE THE FOLLOWING SENTIMENTS:\n\n                       RASPUTIN\n          The Romanovs tried to kill me and\n          I swore to destroy all of them!\n          If she lives, if she should have\n          a child someday, the Romanov Family\n          continues! And I won't lot that\n          happen! THIS IS THE END OF THE LINE!\n\nHe crushes the Anastasia doll in his massive hand.\n\n                       BARTOK\n          You know, this is really obsessive\n          behavior. There is this doctor this\n          doctor in Austria, Sigmund something\n          and he feels. . . \n\nBartok land on the table while be's talking and his\nwing accidently knocks the RELIQUARY on its side and\nit begins to roll.\n\n                       RASPUTIN\n          YOU IDIOT\n\nRasputin makes a sad leap, grabbing it seconds before it\nshatters on the floor.\tRasputin holds it up. The\nsmokey SPIRITS inside swirl around, moaning.\n\n                       RASPUTIN (CONT.)\n                  (to Reliquary)\n          Yesses - you'd all like to get\n          out, wouldn' t you? Sorry\n          just one at a time and only\n          when I call.\n\nRasputin spins an Bartok, who Us been slinki away, and\nslams a goblet over his.\n\nBARTOK'S POV\n\nFrom under the glass, Rasputin looks distorted and even\nmore horrifying.\n\n                       RASPUTIN\n                  (to Bartok)\n          Do you have any idea what would\n          happen if that broke?!\n\n                       BARTOK\n                  (voice under glass)\n          You'd lose your security deposit?\n\n                       RASPUTIN\n                  (waving reliquary)\n          Evil, powerful beings - I have\n          their power only if I contain\n          them, control them. If they\n          should all be released at\n          once... well ...\n\nRasputin smiles with his horrible yellow, decayed teeth,\nand lifts the glass an if to whisper in Bartok, a ear.\n\n                       RASPUTIN (CONT.)\n          YOU DON'T WANT TO BE AROUND\n          IF THAT HAPPENS!\n\nThe volume of Rasputin's voice rattles Bartok around the\ninside of the glass. Rasputin focuses on the RELIQUARY.\n\n                       RASPUTIN (CON'T.)\n                  (to reliquary)\n          Where is she? Where is\n          Princess Anastasia...\n\nInside the reliquary the awoke begins to mow Suddenly,\nthe smoke EXPLODES in a burst and forms into the smoke\nfrom a train engine. As the reliquary picture broadens,\nwe see a train and Anya, Dmitri and Vladimir all hurrying\nto catch it.\n\n                       RASPUTIN(CONT.)\n          She has friends. No matter...\n\nBartok looks desperate under glass. He trios to topple\nthe glass prism by jumping up but just cooks his head.\n\n                       BARTOK\n          Ohhh, that was dumb...\n\n                       BARTOK (CONT.)\n                  (calling to Rasputin)\n          Hello, I've get really terrible\n          claustrophobia. That's why I\n          could never live in a cave ...\n\nRasputin gives his attention only to the reliquary.\n\n                       RASPUTIN\n          Finish my prophecy...\n\nSmoke begins to pour out of the reliquary. asput almost\ngiddy with the thought of finishing ambition, laughs\nhysterically.\n\n                       BARTOK\n          Ew, I hate when he does this!\n\nAs Rasputin swirls his arms the smoke begins to form\ninto MINIONS. All look human at first, but then\nwe see MINION ONE, has the body of a human and a head of\na JACKAL, MINION TWO has the face of a woman and the\nclaws of a TIGER, and MINION- the most horrible\nof all - has a huge bear-like body with the head of a\nVULTURE. All wear long capes with hoods.\n\n                       RASPUTIN\n          She is not to get off that\n          train... alive!\n\nRasputin kicks open the wagon door and leaps outside.\nThe MINIONS, still filling out into forms, follow.\nOne of the wisps of smoke, like a tail, swishes by and\nknocks over Bartok's glass prism, freeing his.\n\nEXT. GYPSY CAMP - NIGHT\n\nRasputin releases his BLACK HORSES who stoup -and\nwhinny, men ing something bad, as two Minions float\non to them the other flies ahead of than.\n\n                       RASPUTIN\n          Go! I don't care what you do with the\n          others but finish the girl! KILLLLL HERRRRR!\n                  (sinister)\n          And have fun...\n\nThe Minions take off. Rasputin laughs wildy.\n\nEND MUSICAL NUMBER\n\nINT. TATIANA'S STUDY, PARIS - DAY\n\nCLOSE ON\n\nTATIANA'S HANDS covering her face. Slowly dropping her\nhands down to reveal an older, sad TATIANA.\n\n                       TATIANA\n          Take her away, Sophie.\n\nPULL BACK\n\nto reveal a YOUNG WOMAN standing in front of bar desk.\n\n                       TATIANA\n          Haven't anything better to do\n          than to break my heart.\n\nSophie ushers the now ashamed YOUNG WOMAN to the door.\nThe YOUNG WOMAN looks amazing like Anya except that her\nhair is long and her clothes are now. She walks with a\ncertain regal grace until she passes through the doorway -\nout of Tatiana's sight - and her posture \"question-marks\"\nand she lopes out.\n\n                       TATIANA (CONT.)\n                  (quietly)\n          No more. So more...\n\nSophie. heavier and larger bottomed than ten years earlier,\nspeaks quickly - without ev er breathing, in a high\npitched nervous chitter.\n\n                       SOPHIE\n                  (very rapidly)\n          Oh, oh... I must say. I thought\n          that one was bar - i'm just so\n          shocked that she wasn't real well,\n          she was real, I mean she was human,\n          of course. but not our real. I must\n          say, even my sisters were touched\n          by her yes - yes they were...\n\nXENIA and ESTELLE, as pinched and skinny as Sophie in\n\"full\", don't appear to ever have been \"touched\" by\nanything (or anyone).\n\n                       SOPHIE (CONT.)\n          ... moved to tears of joy! We won't\n          be f ooled next time, girls! I'm a\n          going to think of really hard questions...\n\n                       TATIANA\n                 (stopping Sophie with\n                  a raise of her hand)\n          No, Sophie. My heart can't take it\n          anymore! I will see no more girls\n          claiming to be Anastasia.\n\nTatiana walks sadly out of the room.\n\nEXT. TRAM STATION - MORNING\n\nAnya and Metoo doze near a fire along with the other\nPEASANTS waiting for the train. Dmitri looks over Vladimir's\nshoulder nervously watching his forging their travel papers.\n\n                       DMITRI\n          Hurry up with those papers.\n\n                       VLADIMIR\n          Would you have leaned over\n          Rembrant's shoulder and told\n          him to paint faster?\n\nVladimir looks at Dmitri's anxious face.\n\n                       VLADIMIR (CONT.)\n          You probably would.\n                  (hands his the papers)\n          They're still wet.\n\nA TRAIN WHISTLE SLOWS and Vlad Moves to Anya.\n\n                       VLADIMIR (CONT.)\n          Wake up, young lady, that's our train.\n\n                       DMITRI\n                  (correcting)\n          \"Wake up, your highness\" - we should\n          start getting used to saying it.\n\n                       VLADIMIR\n          What a world - a man who was in\n          my position in society is calling\n          a peasant 'Your Highness\".\n\nDmitri leans over and tugs Anya's hair lightly.\n\n                       DMITRI\n                  (to Anya)\n          Wake up!\n\nAnya's  eyes flash open and - totally on reflex - she belts\nDmitri in the nose. Ditri reels back,  lands on his butt -\nVladimir observes ruefully.\n\n                       VLADIMER\n          We have a lot of work to do...\n\nEXT. TRAIN PLATFORM - SECONDS LATER\n\nVladimir, using his ample belly, bumps people out of the\nway as they head for the train. Vlad climbs on just as\nit starts up, followed\tby Dmitri. Dmitri turns back and\nreaches out his hand to help Anya up. But she\nfreezes... just STANDS THERE, not running.\n\nANYA'S POV\n\n                       DMITRI\n          Come on!\n\nDmitri on the train, his band extended - just like\nTatiana's was. Although Anya can't quite remember,\nsomething about this terrifies bar. She snaps out\nof it when Meetoo nips her ankle.\n\nAnya looks down and sees the puppy, picks his up and\nruns for the train.\n\n                       DMITRI\n          Take my hand!\n\nAnya puts Meetoo into his hands and Jumps on without\ntouching his.\n\nINT. TRAIN COMPARTMENT\n\nThe compartment is JAMMED with travelers. Suitcases\nand packages balanced precariously. Dmitri sits down\nand carefully touches his painful noso.\n\n                       DMITRI\n          Do you always punch people first\n          thing in the morning?\n\n                       ANYA\n          Sorry - it's a reflex. Living\n          in an orphanage if someone bothers\n          you - you automatically come up\n          swinging.\n\n                       DMITRI\n          I wasn't bothering you. I was\n          trying to wake you up!\n\nOVER ANYA'S SHOULDER, out of the window. we see the\nTHREE MINIONS on horseback charging down a snow covered\nhill toward the train.\n\n                       ANYA\n          By pulling my hair?!\n\n                       DMITRI\n          I was all out of dynamite!\n\nDmitri touches his nose again. Anya opens the window\nand grabs some snow.\tWE SEE the minions racing wildly\nto catch up with the train. As the scene continues, we\nsee the minions,\tby one, getting close to the train\nand then disappear from\tview - only their riderless\nhorses ride away.\n\n                       ANYA\n                  (hands Dmitri the snow)\n          Put it on your nose. For heaven's\n          sake, you're making such a fuss!\n\nDmitri tries to act very manly as he puts the ice on his\nnose, but cringes with the cold. Anya smiles.\n\n                       ANYA\n                  (to herself)\n          Men are such babies...\n\nAn ELDERLY WOMAN loaded with packages cones into the\ncompartment. Anya immediately rises to help her.\n\n                       ANYA\n          Here, let me\n\nDmitri and Vlad both pull her back down.\n\n                       DMITRI\n          You're a princess...\n\n                       VLADIMIR\n          Royalty do not help people\n          with their luggage.\n\nAnya gives them both a look and helps the woman.\n\n                       VLADIMIR\n          Well, she certainly has a mind\n          of her own.\n\n                       DMITRI\n          Yes. And I hate that in a woman.\n\nVlad holds Meotoo, who is enthralled and plays with\nVladimir's drooping mustache, like a kitten with a string.\n\nThe COMPARTMENT DOOR swings open and an OMINOUS LOOKING\nGUARD strides in!\n\n                       GUARD\n          Papers!\n\nEveryone rustles for their papers. Dmitri confidently\npulls out their papers, done in beautiful BLACK ink.\nThen, he glances at the PERSON NEXT TO HIM and sees\nthat his papers are done in a bright RED ink. Dmitri\nlooks over at Vladimir - who has seen the mistake as well.\n\n                       VLADIMIR\n                  (sheepishly)\n          It's what I hate about this\n          government - everything in red!\n\nThe guard hand papers back to a soulful looking man\nwith a frozen beard.\n\n                       GUARD\n          Thank you, Comrade Zhivago.\n\n                       ZHIVAGO\n          Doctor Zhivago.\n\nGUARD approaches Vlad and Dmitri.\n\n                       VLADIMIR\n          What do we do now?\n\n                       DMITRI\n          Pray he's color-blind...\n\nDmitri flashes the Guard a charming smile as he hands\nover his papers. Vladimir is nervously playing with\nhis mustache until it stands out straight. Anya has\nno idea what's going on.\n\n                       GUARD\n          wait here.\n\nAs the Guard heads out of the compartment, Vlad turns\nto Dmitri and they exchange an \"oh, no\" look.\n\nINT. CORRIDOR, ANOTHER CAR\n\nThe MINIONS, hoods pulled low, push their way through\nthe PASSENGERS in search of Anastasia.\n\nINT. CORRIDOR\n\nDmitri spots the GUARD conferring with the GUARDS\nover the papers. Anya pokes bar head out.\n\n                       ANYA\n          I'm going to stretch my legs\n\n                       DMITRI\n          That's a good idea - a great\n          idea - stretch your legs\n                  (pointing the opposite\n                  direction of the\n                  guards)\n          ... stretch then that way.\n\nAnya looks at him like he's crazy and walks away.\n\n                       ANYA\n                  (to herself)\n          I must have hit him harder than\n          I thought...\n\nDmitri runs back in and grabs his SMALL BACKPACK. He\npulls Vlad, carrying Meetoo, out off the compartment\nAnya has a load on them as they follow.\n\nINT TRAIN COMPARTMENT - DAY\n\nThe GUARDS burst in, ready for an arrest. In the\nbackground, the hooded Minions pass. The Guards,\nseeing empty seats, head back out.\n\nINT. TRAIN CORRIDOR - ANOTHER CAR\n\nAnya looks out the window as the country side flies by\nand smiles.\t\n\nINT. CORRIDOR\n\nThe Guards spot three figures at the far end of the car.\n\n                       GUARD\n          That's them! Come on!\n\nThey run after who they think are the fugitives.\nThe Guard grabs a minion and spins him around.\n\nIt's MINION THREE, who comes face-to-beak with him\nand lets out a HORRENDOUS SCREECH, causing the other\nMinion to turn around. The Guards scream and reel backward,\npushing and shoving each other to got out of the way\n\nThe Minions proceed up the corridor, MINION TWO, spot\nAnya looking out the window. He grabs her. palling her\nviciously to the other Minions. She spins around - it\nisn't Anya - it's a SERIOUSLY UGLY WOMAN. The Minions\nnow scream and reel back in horror.\n\nINT. CORRIDOR - SIMULTANEOUS\n\nDmitri and Vladimir catch up to Anya and grab her in\neach arm, loading bar down the hall WE HEAR the MINIONS\nSCREAM from the next car.\n\nEXT. BETWEEN CARS\n\nAnya. Dmitri and Vlad step out on a platform and see\nthere is no place left to run. Only the engine is\nahead of them.\n\n                       DMITRI\n          Wait here!\n\nHe leaps up gracefully, grabbing the edge of the roof,\nand pull& himself up.\n\n                       ANYA\n                  (to Vlad)\n          Would you like to tell what we are...\n\nas Dmitri's head, upside down, appears from the roof.\n\n                       DMITRI\n          Come on up!\n\n                       ANYA\n          Why?\n\nVladimir picks Anya from up from tobehind and hoists\nher up to Dmitri. She hollers.\n\nEXT. TRAIN ROOF\n\nAnya is pulled up by Dmitri, with a force that knocks\nthem both over Anya on top. An awkward moment. Anya\nrolls off him as Dmitri tries to catch the breath she\nknocked out of him.\n\n                       ANYA\n          Just what do you think you're doing?!\n\n                       DMITRI\n          Trying... to... breathe...\n\nSuddenly, Meetoo appears, as if he were flying and\nlots out a little \"retu\". Vladimir has tossed his\nup and Dmitri catches his, band his to Anya, and\nreaches down to Vladimir.\n\nINT. CORRIDOR\n\nThough the window the Minions see Vladimir's legs\nas he's being lifted.\n\nINT. ROOF oF TRAIN\n\nDmitri struggles to got Vlad to the roof but he's\nlosing his grasp. Anya puts Meetoo down and reaches\nto help the dangling Vlad. Even Meetoo helps by\npulling an Vladimir's  scarf .\n\nEXT. PLATFORM\n\nMinion one grabs for Vladimir's legs, just as\nthey disappear.\n\nEXT. ROOF OF TRAIN\n\nDmitri and Anya let out a sigh of relief as Vlad in\nsafe, but it's short lived as they both SIMULTANEOUSLY\nlot out a yell.\n\nDMITRI & ANYA'S POV:\n\na TUNNEL rapidly approaching.\n\nThey hit the deck, Vlad on his back between Anya and\nDmitri.\tAnya and Dmitri exchange a quick look as the\ntunnel gets closer - Vladimir's stomach is sticking up\ntoo high to clear the tunnel. They reach up together\nand push down on his big belly, causing his eyes to\nbulge\n\nON THE SIDE OF THE TRAIN\n\nThe minions, now climbing up the side are plunged into\ntotal darkness.\n\nON THE ROOF\n\nlight hits as the train comes out of the tunnel.\nVlad lets out a gasp as they release his belly.\nJust then a Minion hand reaches up over the edge.\nDmitri assumes it's a Guard.\n\n                       DMITRI\n          The guards!\n                  (Anya gives his a lack)\n          I'll explain later.\n\nAnya and Vlad follow Dmitri toward the back of the train.\n\nON THE MINIONS\n\nnow on the roof, seeing their prey in short distance.\n\nON ANYA AND THE OTHERS\n\nrunning, without looking back. jumping from car to car,\npassing Meetoo like a football. Vladiair makes a huge\nrunning leap into the air...\n\nINT. TRAIN COMPARTMENT\n\nAs all PASSENGERS react to Vladimir's bulk hitting and\ndenting the coiling.\n\nEXT. ROOF OF TRAIN\n\nThe TRAIN WHISTLE erupts and Anya glances back to see\nher pursuers just as they are enveloped in the thick black\nsmoke of the engine. Behind them, Anya can another tunnel.\n\nTUNNEL\n\nThey drop down, this time Vlad in on his stomach. Anya\nand Dmitri realize his butt won't clear the tunnel.\nThey push it down.\n\nON THE MINIONS\n\nAn the smoke disappears, the Minions' eyes go wide when\nthey realize it's too late for them. The train roars the\ntunnel as the MINIONS SMASH &\"'not the sift of\n\nthe mountain in a COLORFUL BURST OF SMOKE from which\nthey were created.\n\nINT. RASPUTIN'S WAGON - PARALLEL TIME\n\nDISSOLVE TO\n\nEXT.\tROOF OF TRAIN - DAY\n\nRasputin stares at the scene in his reliquary, watching\nhis well laid plan *go up in smoke\", and lots out a\nsimmering growl.\n\nAnya is standing with her hands an her hips arguing\nwith Dmitri and Vladiair.\n\n                       ANYA\n          Forged papers! Now, what?!\n\n                       DMITRI\n          Now just get off the train.\n\n                       ANYA\n          HUH?!\n\nDmitri motions that they are going to Jump. Anya shakes\nher head slowly.\n\n                       ANYA\n          Noooo....\n\n                       VLADIMIR\n          She's quite right, Dmitri, a man\n          of my stature should not have to\n\nDmitri shoves him off the top of the train with Meetoo\nin his arm. Dmitri then puts out his hand to Anya.\n\n                       DMITRI\n          Come on, we'll jump together...\n          Take my hand.\n\nDmitri turns forward and sees the train is approaching\na HIGH RAILROAD BRIDGE over a rocky ravine. It's now\nor never.\n\n                       DMITRI\n          Come on!\n\n                       ANYA\n          No!\n\nWith his outstretched hand, Dmitri shoves her off the bar.\n\nEXT. COUNTRYSIDE - DAY\n\nVladimir has landed in a large pile of snow. He stands,\nrubbing his bottom.\n\n                       VLADIMIR\n          I think I have hurt my...\n\nMeetoo comes out of the pile of leaves, rubbing his\nbottom and answers Vladimir's with his \"retu\".\n\nA short distance away, Anya seems to be sitting on\ntop of a puddle - but she isn't wet. Suddenly, Dmitri\ngets up from underneath her, covered in snow. Anya\nisn't wet because she landed on Dmitri! She jumps up.\n\n                       DMITRI\n          You must enjoy causing me pain!\n\n                       ANYA\n          You shouldn't have pushed us!\n\nVladimir and Meetoo come over.\n\n                       VLADIMIR\n          Is everyone all right?\n\n                       ANYA\n          I'm fine.\n\n                       DMITRI\n          She's fine!\n                  (limping away)\n          I may never walk right again,\n          but she's fine...\n\nINT.\tRASPUTIN'S WAGON\n\nRasputin paces, still angry at the Minions. Bartok,\nnervous, fakes a yawn and stretches.\n\n                       BARTOK\nWell, I better got goin'. Got a busy day letting all\nthe blood rush to my head...\n\nRasputin pulls him back in, then speaks to his reliquary.\n\n                       RASPUTIN\n          She's too far away, isn't she?\n\nThe reliquary glows eyes. Rasputin places It back in it's cabinet.\n\n                       RASPUTIN (CONT.)\n          Yesss... our power is much stronger\n          when were near. We must get close\n          to her.\n\n                       BARTOK\n          Oy... not a road trip. I get\n          wagon sick, you know that.\n\nRasputin smacks him against the wall as he stomps out\nof the wagon. Bartok slides down the wall.\n\n                       BARTOK (CONT.)\n          You're absolutely right. Travel\n          broadens your horizons...\n\nAnd he hits the floor.\n\nEXT. GYPSY CAMP - MIGHT\n\nRasputin, on his obsessed mission, leaps on top of the\nwagon as Bartok, still dizzy, tries to catch up.\n\n                       RASPUTIN\n          We'll catch her and finish her!\n                  (he grabs the, reigns)\n          We ride this night!\n\nRasputin then looks down and sees that there are no horses\nharnessed he gave then to the begins a slow growl.\n\n                       BARTOK\n          Well,\twe wait this night!\n\nEXT.\tCOUNTRY - BREAK OF DAWN\n\nAnya is walking ahead with Vladiair as Dmitri follows\nhe's still muddy, wet and unhappy.\n\n                       VLADIMIR\n          No have a lot of work to do,\n          Anya! Come along, Meetoo!\n\nMeetoo is trying to catch fire flies in his mouth.\n\n                       VLADIMIR (CONT.)\n          We have to prepare you for an\n          audience with Sophie.\n\n                       ANYA\n          Who's Sophie?\n\n                       VLADIMIR\n               (lost in warm memories)\n          Ah ... the Lady Sophie... The\n          ravishing first cousin, once\n          removed, from the Empress. We\n          must convince Sophie that you\n          are the Princess before we'll\n          be granted a meeting with the\n          Empress ... your grandmother,\n          I mean.\n\nAnya stops dead in her tracks, this is the first she's\nheard of this.\n\n                       ANYA\n          What?!\n\nDmitri, not paying attention, slams into the back\nof Anya. Anya, not hurt, turns to Dmitri - who is\nrubbing his now sore shoulder.\n\n                       ANYA (CONT.)\n          You never said anything to me\n          about having to prove I'm a\n          Princess!\n\n                       DMITRI\n          You are the Princess.\n\n                       VLADIMIR\n          We're just going to refresh\n          your memory...\n\n                       ANYA\n          I don't have a memory and I'm\n          not a Princess!\n               (looks down at herself)\n          Even if I were - no one's ever\n          going to believe it. I'm not\n          exactly...\n\nAnya searches for the -word as she sits down next\nto a frozen pond.\n\n                       ANYA (CONT.)\n               (sadly to herself)\n          ... good enough...\n\t       (to others)\n          I can't go through with this!\n\nDmitri sits next to Anya and looks at her reflection\nin the ice.\n\n                       DMITRI\n          What do you see?\n\nANYA'S POV\n\nher smudged face and boy's clothes. Dmitri's hands\ncome into frame, wipe off her face with snow and\nthem pull her hair off her face. Anya does, truly,\nlook pretty.\n\n                       DMITRI(CONT.)\n          See? The Princess is under there ...\n\n                       VLADIMIR\n          Ah! Let us begin!\n\nA POSSIBLE VLADIMIR SONG\n\nVladimir would begin to sing here, telling Anya that she\nhas a lot to learn. The music would probably have a\nLIGHT, SOMEWHAT COMEDIC tone, and would be just a SHORT\nSECTION OF SINGING, which would then SEGUE TO UNDERSCORE\nfor the scenes of instruction which follow.\n\nWe see the three of them from behind, walking down a\nroad - Meetoo trots behind them, happily.\n\n                       VLADIMIR (CONT.)\n          You were born on the Adriatic sea at\n          the summer palace, where the parties\n          and the buffets were marvelous ....\n\nEXT. SLEIGH - DAY\n\nVladimir is putting icicles in Anya's hair to keep it\nup in a bun - she looks sweet, despite her boy's clothes.\nShe is reciting something to Dmitri.\n\n                       ANYA\n          ...and on my father's side,\n          there was [THIS SECTION IS NOT LEDGABLE] \n\nAnya thinks as Dmitri looks at a long sheet of\npaper, prompting her.\n\n                       DMITRI\n          Every Russian family has one..\n\n                       ANYA\n               (gets it)\n          Natasha! Natasha Feastavich!-\n          but we called her Nashie\n          Fooshie!\n\n                       VLADIMIR\n          Did I tell you that?\n\n                       ANYA\n          You must have.\n\nEXT. PIG CART - DAY\n\nAnya, Dmitri and Vladimir are sitting in the back of a\npig cart traveling down a country road. The pigs are very\ninterested as Anya is pointing to different pieces of hay\nwhich \"set\" her imaginary table.\n\n                       ANYA\n               (repeating)\n          ...fish fork, salad fork, meat fork and. . .\n               (can't remember, then\n                exasperated)\n          [THIS SECTION ALSO NOT LEDGABLE]\n\n                       DMITRI\n\t       (hinting)\n          It's the best fork of all\n\n                       ANYA\n          The dessert fork!\n\n                       VLADIMIR\n               (lost in a memory of\n                rich desserts)\n          Ah, yes ... I have always loved\n          that fork...\n\nDmitri and Anya exchange a look and then laugh,\nadding ad libs of \"we can tell\" and \"There's a\nfork you should have skipped\". This is the first\ntime Dmitri and Anya have laughed together -\nactually the first time he's ever seen her smile. \n\nEXT.\tPORT - DAY\n\nDmitri, who is sneaking around, pulling women's clothes\nout of a suitcase that clearly isn't theirs! He takes\nout a large, but pretty dress, a beautiful veil - and a\nhuge brassiere, which he quickly stuffs back in the\nsuitcase - somewhat frightened. He takes the dress and\nveil puts it in his backpack and joins Vladimir and Anya\nas they admire the ship.\n\n                       ANYA\n          What a beautiful ship!\n\n                       DMITRI\n          It used to be a private yacht\n          before the government took it over.\n\n                       VLADIMIR\n          Oh, yes it was the seagoing vessel\n          of elaborate elegance in entertaining...\n               (looks at Dmitri and Anya explaining)\n          A party boat. It once belonged to ...\n\nVladimir honestly can't remember, Anya thinks it's\nanother quiz.\n\n                       ANYA\n          Konstantin Petrovich of Moscow!\n\nDmitri and  Vladimir exchange a quizzical look. No\none told her that...\n\nMeetoo spots TWO UGLY PUG DOGS and a distinguished\nELDERLY DOWAGER. He runs happily to play with them.\nShe pulls her DOGS away from Meetoo.\n\n                       ELDERLY DOWAGER\n          No, no, boys! You don't know where\n          he's been!\n\nThey give him a disgusted look and walk away. Meetoo\nlooks a little hurt.\n\nINT. HALLWAY OF THE SHIP - NIGHT\n\nDmitri and Vladimir are standing by a closed door.\nAnya is on the other side.\n\n                       ANYA (0. C.)\n          No! I look ridiculous!\n\n                       VLADIMIR\n          Come out! I can do alterations.\n\n                       ANYA (O.C.)\n          You'll laugh.\n\n                       VLADIMIR\n          I shant!\n\n                       ANYA (O.C.)\n          Not you. Him.\n\n                       DMITRI\n          I won't laugh - I swear...\n\nThe door opens and Anya comes out in the blue dress\nDmitri stole which at least ten sizes too big for her.\nShe is still wearing her hair up and despite the size\nwhich actually gives her a \"Kate Moss\" waifish look\nwith her men's boots and baggy dress - the blue brings\nout her eyes. Dmitri sees her and BUSTS OUT LAUGHING.\n\n                       ANYA\n          You said you wouldn't laugh!\n\n                       DMITRI\n          It's not you - it's the dress!\n\nAnya storms back into the cabin and slam the door behind her.\n\nINT.\tCABIN - SIMULTANEOUS ACTION\n\nWhen Anya storms into the cabin, she catches a glimpse of\nherself in the mirror.\n\n                       ANYA\n               (to herself)\n          I'm never going to be..\n\nJust then, the slamming door catches the back of her dress,\npulling more than half of it into the door frame. She sees\nin the mirror that the now fitted dress shows a lovely\nwoman's figure. Pleased, she looks at herself.\n\n                       ANYA (CONT.)\n          Well! Maybe I am...\n\nEXT.\tCABIN DOOR - NIGHT\n\nVladimir and Dmitri wait outside the door. The door opens\nand Anya appears, having tied the veil around the waist\nof the dress, making it look fitted and beautiful. Dmitri\nand Vladimir are surprised as Anya walks past them with\nconfidence and throws them a look over her shoulder.\n\n\"REPRISE OF VLADIMIR'S SONG (OVER MONTAGE)\n\nThe tone of the song would now change - - the older,\nwiser person watching as two younger people are\nunwittingly falling in love. The tone can still be\nlight, as are the visuals here, but there would be\nan undercurrent of irony and romance. The song would\nend as Anya and Dmitri have their first, momentary\nembrace.\n\nMONTAGE: (MOS)\n\nON DECK: Anya, still in her boots, walks gracefully\ndown the deck in spite of the ship's rocking motion.\nDmitri and Vlad can't even stand due to the motion.\nAnya looks back and flashes them a smile.\n\nIN THEIR CABIN: Dmitri gets out of the bed he's\nbeen sharing with Vlad and walks over, past where\nAnya is sleeping peacefully, to close the port hole\nagainst a cold wind. He closes is and see's Anya -\nshe looks beautiful - he bends down to pull up her\ncovers and she SLUGS him.\n\nUNDER A TABLE: Meetoo is walking around sniffing\nfeet. Suddenly, he runs smack into the TWO UGLY\nPUG DOGS who growl at him. He runs away and finally\nsee's a woman's foot and a pair of pretty feminine\nshoes, with heels, that she has kicked off. Meetoo\ngrabs them in his mouth and runs.\n\nON DECK: The sea is calm, but Anya - wearing the heeled\nshoes for the first time - is teetering and wobbling\nlike mad. Dmitri and Vlad watch her with amusement.\nAnya turns to them.\n\nON DECK: Dmitri has stuffed his feet into the woman's\nshoes and is barely able to walk as Anya watches him\nwith great vindication.\n\nBALLROOM: Anya walks -into the ballroom, steady and\ngraceful in her new shoes, on Vladimir's arm and\ncompletes a perfect curtsy in front of Dmitri. Dmitri\napplauds and moves down to her as she stands and smacks\nhim with her head accidently.\n\nTHEIR CABIN: Vladimir is directing Anya as she waltzes\ngracefully in their swaying cabin. Dmitri enters and is\ndirected to join Anya. He does and they dance together,\nwith Anya clearly leading. The boat sways to the left\nand Anya is thrown closer into Dmitri's arms. Neither\nof them even try to readjust.\n\nEND MONTAGE\n\nSTILL IN THE SCENE\n\nVladimir walks over to Anya and nervously chatters (he\nknows he interrupted something) as he leads her away\nfrom Dmitri.\n\n                       VLADIMIR\n          You are a natural! I don't know\n          how you ever learned to dance\n          that well! That must have been\n          some high class orphanage ...\n\nEXT. SEA - NIGHT\n\nAs a storm begins to whip up, the wind starts to howl\nand the waves become more violent.\n\nREVERSE ANGLE\n\njust as a BOLT OF LIGHTNING STRIKES the water, we see\nRasputin's face.\n\nINT. CABIN - NIGHT\n\nThe storm is pitching the boat wildly. Vladimir is\nsleeping, snoring loudly. Meetoo, sound asleep, is\nsliding from side of the cabin to the other. Anya\nis looking out the small port hole at the violent\nsea when Dmitri, carrying his back pack, sits on the\nbed next to her.\n\n                       DMITRI\n          I wanted to show you something.\n\nDmitri takes out the music box and hands it to Anya.\nShe is immediately taken by it, something about it ...\n\n                       ANYA\n          It's so beautiful ... and sad.\n\n                       DMITRI\n          Sad?\n\n                       ANYA\n          Lost. it feels lost. This was hers?\n\n                       DMITRI\n          Yeah ... well, yours. You still\n          don't believe that you're the\n          Princess, do you?\n\n                       ANYA\n          I know I must have had something\n          to do with the palace - I've had\n          little flashes of things - but\n          being the Princess? It doesn't\n          matter as long as I find my home.\n\n                       DMITRI\n         Well, the only thing you've got\n         when you've got a home is a fear\n         of losing it! You're lucky you\n         don't remember the revolution --\n         I never had much, but what I did\n         have -- I lost.\n\n                       ANYA\n         I'm sorry.\n\n                       DMITRI\n              (false bravado)\n         Hey! It doesn't matter! You gotta\n         make your own way in the world!\n         Don't be sorry for me! I'm going\n         to get what I want don't you worry!\n\nDmitri goes back over to his bed. Anya sees through\nhim and knows how much it all did matter to him.\n\nEXT.\tSEA CLIFF - NIGHT\n\nThe wagon sits on the edge of a high cliff. Rasputin\nstands on the top of his wagon, staring at the sea\ndemonically. The jagged bolts of lightening and the\nicy silver rain make him look all the more menacing.\n\n                       RASPUTIN\n              (low, slow)\n         She's out there ...\n\nThe wind parts his beard and we see Bartok hanging\nupside down in it, trying to stay out of the storm.\n\n                       BARTOK\n         I'm getting a chest cold..\n\n                       RASPUTIN\n         Bartok... a question.\n\n                       BARTOK\n         I'm getting pneumonia. I have\n         a fever. Feel my forehead...\n\n                       RASPUTIN\n         What do you think is the most\n         humiliating way to die?\n\nRasputin's eyes light up as if he just thought of the\nanswer to his own question. Bartok is thrown out of his\nbeard when he makes a sudden turn and leaps off the\nwagon. Bartok follows.\n\n                       BARTOK\n         My cousin Mischa, nice fellow\n         had some dental problems - you\n         didn't want to watch him eat,\n         let's put it that way...\n\nRasputin steps in\n\nINT.\tWAGON - NIGHT\n\nAs Bartok continues, Rasputin moves to the\nreliquary's cabinet.\n\n                       BARTOK\n         ... anyway, a bunch of other\n         bats were hanging in the belfry -\n         I know, cliche, but there you have\n         it, and Mischa, not the brightest\n         bat in the world, decides to hang\n         in the bell. Which was fine\n         for awhile until it started ringing ...\n\t      (shivers)\n         Ewwww, what a mess ...\n\n                       RASPUTTN\n\t      (to reliquary)\n         Show her to me ...\n\n                       BARTOK\n         And it didn't help the tonal\n         quality of the bell, either.\n\nIMAGES, horrifying and frightening, begin to spin\ninto a small tornado. Rasputin throws open the door\nand the TORNADO bursts out streaking across the water.\n\nEXT.\tSEA CLIFF - NIGHT\n\nRasputin follows tornado to the cliff and watches\nas it disappears into the horizon of the water.\nLightning and thunder crash as he laughs maniacally.\n\nINT.\tCABIN - NIGHT\n\nwhich is swaying with the storm. PAN past Vladimir,\nsnoring, his now limp mustache flopping wildly and\npast Dmitri, sleeping restlessly. Move to Anya, who\nseems quite content.\n\nFrom under the door SMOKY IMAGES silently slither.\nThey float across the cabin and swirl around Anya.\n\nCLOSE ON:\n\nAnya's CLOSED EYES as the SMOKY IMAGES seem to enter\nher head. She smiles in her sleep and we are in ANYA'S\nDREAM. . .\n\nEXT.\tFOREST - DAY\n\nAnya, in a beautiful white dress, is walking peacefully\nthrough a sunny part of a lovely forest on a spring day.\nShe reaches down to pick some pretty flowers, then looks\nup as it seems to get dark... OMINOUS LOOKING CLOUDS cover\nthe sun. Anya reaches down for another flower when she\nHEARS A GROWL.\n\nAnya spins to see an ENORMOUS BEAR emerge from the trees.\n(All the animals in the dream sequence have a SLIGHT\nresemblance to Rasputin.) Anya is frozen with fear as MORE\nBEARS emerge and head straight for her. She tries to back\naway as the beautiful FLOWERS GROW LONG AND HORRIBLE THORNS\nand wrap around her ankles, impeding her escape.\n\nIt gets darker as the BEAR'S EYES, glowing yellow, multiply\nand move closer. Anya pulls free of the flowers and rushes\nto the safety of a large tree  She climbs the tree and\nescapesthe bears. Looking down, from her perch on a sturdy\nbranch, the ground seems miles away.\n\nSuddenly, the BRANCH JOLTS her and almost falling, she hold\n on to it tightly. But the branch TURNS IN TOWARD\n\nHER - no longer a tree branch, but A HUGE UGLY SNAKE with\nred eyes and huge fangs that come right for her!\n\nAnya leaps to another branch, which also turns into a snake.\nShe jolts backward and begins to fall ... toward a HUNDRED\nYELLOW EYES, FIFTY BLOOD RED MOUTHS AND THOUSANDS OF SHARP\nTEETH. As Anya falls, she lets out a SILENT SCREAM.\n\nA BURST OF SUNLIGHT\n\nas Anya lands in a field of soft GOLDEN WHEAT. Unharmed\nand very relieved, she stands and looks around at the\nbeautiful sunny wheat field.\n\nINT. CABIN\n\nReality. Anya's eyes are closed as she smiles in her\nsleep and sits up in bed. TINY WISPS of smoke still\nswirl around her head. As she gets out of bed, she\nunintentionally steps on Meetoo's tail, waking him.\nMeetoo watches as the sleeping Anya opens the cabin door\nand walks out.\n\nMeetoo rises to follow Anya but the ship pitches, sending\nhim sliding across the cabin floor.\n\nEXT. DECK - NIGHT\n\nAnya walks out on the deck, the ship pitching violently\nin the storm, as she smiles.\n\nIN HER DREAM\n\nAnya is walking through the wheat field to the edge of\na BLUFF. A few yards below the bluff, Anya sees a beautiful\nlittle pond where a FAMILY frolic's in the clear water;\nlaughing, splashing, swiming happily. Anya climbs over a\nlow flowering wall to look closer.\n\nPULL BACK\n\nREALITY: Anya has climbed over the railing of the deck\nand is looking into the black ocean... smiling.\n\nDISSOLVE TO:\n\nA SMOKY IMAGE OF THE SAME SCENE\n\nIt's RASPUTIN'S POV as he watches his plan unfold in the\nreliquary.\n\nINT. CABIN\n\nMeetoo finally rights himself from his slide across the\nfloor and begins to bark into Dmitri's ear.\n\nEXT. DECK\n\nAnya is waving happily at the dangerous water.\n\nIN HER DREAM\n\nAnya is waving to the FAMILY. They turn around toward\nher and she sees that it's the ROMONOV FAMILY, from\nthe frieze that she saw in the palace. She is delighted\nto see them as she feels a distance recollection of who\nthey are to her.\n\nINT. CABIN\n\nMeetoo jumps up and NIPS at Dmitri's hand. Dmitri leaps\nup with an \"owwww!\" and looks over at the excited Meetoo.\n\n                       DMITRI\n         If you have to go - wake her..\n\nDmitri looks over to Anya's bed - she isn't sits up and\nthrows his legs over the side\n\nEXT. DECK\n\nAnya is standing right on the edge of death...\n\nIN HER DREAM\n\nShe isn't there. He of his bed.\n\nthe FAMILY is waving to her. NICHOLAS waves for her to\njump into the clear pond and join them. Anya nods and\nmoves to jump in...\n\nEXT. DECK\n\nAnya gets ready to jump into the violent and icy black\nwaves. She takes one step out when... DMITRI GRABS HER\nSHOULDERS.\n\nAnya JOLTS awake from her dream. Confused at first,\nthen terrified to see what almost happened to her.\nisn't lifts her to the other side of the railing\nand looks at her.\n\n                       DMITRI\n         What were you doing?!\n\nAnya puts her hands to her mouth in shock, shaking\nand almost crying with fear, she throws her arms\naround Dmitri and holds him tightly.\n\nDmitri is surprised at first, but tightens his arms\naround her.\n\n                       DMITRI (CONT.)\n         It's okay now - I've got you.\n         You're safe...\n\nThey stand steady on the deck in a tight embrace,\ntheir feelings for each other are stronger than the storm.\n\nDISSOLVE TO:\n\nTHE SAME, as seen through the reliquary\n\nRasputin watches ... seething quietly, as Bartok peeks\nmeekly over his shoulder.\n\n                       BARTOK\n         Boy, don't you hate it when\n         that happens?\n\n                       RASPUTIN\n              (controlling)\n         She leads a charmed life, that\n         little one ... Someone is always\n         there to save her. In the palace\n         as a child, on the train and now\n         ... it's him.\n\nRasputin studies Dmitri in the reliquary - Dmitri and\nAnya still in a warm embrace.\n\n                       BARTOK\n         Nice looking fellow. I mean,\n         don't get me wrong - I'm not\n         attracted to him in the physical\n         sense, I just ...\n\nBut Rasputin's not interested, he stares into the\nreliquary and speaks directly to it.\n\n                       RASPUTIN\n         You are toying with me, aren't\n         you? You let me get so close...\n\nThe reliquary, as if in answer, seem to be chuckling.\nRasputin smiles and joins in with it.\n\n                       RASPUTIN (CONT.)\n         Bartok ... have you ever been to Paris?\n\n                       BARTOK\n         Me? No. Rich food - it kills me.\n         Ever try and fly after one of\n         those heavy sauces?\n\nRasputin returns the reliquary to its cabinet.\n\n                       RASPUTIN\n         We are going to Paris - and while\n         we're there, let's kill the young\n         man. He annoys me.\n\nEXT. BOAT DOCK (LA HAVRE) - DAY\n\nAs Anya walks down the plank her dress gets caught\non a nail. Dmitri is walking toward her as she yanks her\ndress free and accidentally punches him in the stomach.\nDmitri takes it like a man.\n\n                       ANYA\n         Oh! I'm sorry...\n\n                       DMITRI\n         It's okay. Didn't hurt..\n\nVlad has been watching as he walks down the plank\nwith Meetoo - they exchange an \"oh boy\" look, both\nnoticing that clearly something is different between\nAnya and Dmitri. Anya catches something out of the\ncorner of eye and turns quickly.\n\nCLOSE ON a sign: \"Paris 30 kilometers\"\n\nAnya walks away from Dmitri and over to the sign\nand looks at it longingly.\n\n                       ANYA\n              (to herself)\n         I'm almost there... I'm finally\n         going to know...\n\nAT THE OTHER END OF THE DOCK\n\nVladimir stares into his purse, depressed.\n\n                       DMITRI\n         How is our current financial status?\n\n                       VLADIMIR\n         If I used the word \"bleak\" I would\n         be optimistic.\n\nAs he says this the ELDERLY DOWAGER from the ship\npasses by with her TWO OBNOXIOUS PUG DOGS. Meetoo\ngrowls as Vlad and Dmitri get an idea.\n\n                      VLADIMIR (CONT.)\n         The \"Odessa Dunk\"?\n\n                      DMITRI\n         It worked in Odessa...\n\nVladimir picks up Meetoo and whispers instructions.\nMeetoo likes the plan.\n\nNEW ANGLE\n\nas Meetoo races past the PUGS. They ignore him, so he\nstops and makes a face, giving them a sloppy \"razzberry\",\nwhich piques them a little. Meetoo then bends over and\nwaves his furry little butt at them. Now the PUGS are\noffended and TAKE OFF after him, yapping all the way.\n\nMeetoo turns and scrambles with the Pugs in hot pursuit.\nAs they get closer, Meetoo SUDDENLY STOPS and the Pugs\ngo FLYING OFF they edge of the dock and into the water\nbelow. Meetoo looks over the edge and gives them a 'Boy,\nare you guys morons look as the ELDERLY DOWAGER runs\nup screaming.\n\n                       ELDERLY DOWAGER\n         Help! My little dogs! Chevalier! Maurice!\n         Hold on, darlings!\n\nDmitri comes running up, a little too gallant.\n\n                       DMITRI\n         I'll save them, Madame\n\nDmitri dives into the water as Vlad rushes up behind\nthe Elderly Dowager. Anya watches from a distance as\nDmitri climbs out of the water carrying the soaked\n(and pissed) Pugs.\n\n                       VLADIMIR\n         Such bravery! Why, that man should\n         be rewarded! Amply rewarded!\n\nMINUTES LATER\n\nDmitri hands Vlad a pile of FRANCS as Anya approaches.\n\n                       ANYA\n         That was really very kind of you.\n\nShe gives him a kiss on the cheek and walks away with\nMeetoo, who turns back and gives Dmitri a look. A\nlittle guilty, Dmitri turns to Vlad.\n\n                       VLADIMIR\n         I won't say a word...\n\nEXT.\tGRAND OPEN CAR - DAY\n\nTraveling is style! Vladimir is driving - badly - with\nMeetoo in the front seat. Meetoo covers his eyes. Dmitri\nand Anya are in the open back seat, enjoying the beautiful\nFrench countryside.\n\nDmitri looks over at Anya.\n\n                       DMITRI\n         Nervous?\n\n                       ANYA\n         Yes - If I can't convince Sophie,\n         I'll never be able to see Tatiana....\n\n                       DMITRI\n         You'll convince her. You have the\n         qualities of a princess you're\n         poised and strong... and beautiful\n         ... even if you forget a couple\n         dates of family names - she'll know.\n\nAnya smiles at Dmitri, knowing that all the confidence\nshe has is because of him. She takes his hand but\nlooks away.\n\nEXT. TATIANA'S PARIS HOUSE - DAY\n\nThey pull up in front of the beautiful white house.\nAnya is nervous as Vladimir walks up to the front door\nahead of Dmitri and Anya. Vladimir knocks. Sophie\nanswers the door.\n\nShe moves with grace and regal poise.\n\n                       VLADIMIR\n         May I present her Royal\n         Highness Princess Anastasia!\n\n                       SOPHIE\n         Oh good! We haven't seen an\n         Anastasia in several days!\n\nAnya looks to Dmitri, a little confused by that last\ncomment. Dmitri makes a little \"she's slightly crazy\"\nsignal.\n\nThey all leap to avoid her butt as she bustles into\nthe house.\n\nINT. DRAWING ROOM - DAY\n\nSophie, flanked by her sisters, sits at a table. Anya,\nlooking nervous but poised, sits across while Dmitri and\nVladimir hover nervously at the far end of the room.\n\nSophie's PAT CAT, TILLIE, attempts to cuddle up next to\nMeetoo, who wants nothing to do with her.\n\n                       SOPHIE\n         I'd just like to ask you a\n         few questions, dear...\n\nSophie opens a huge book that SLAMS open. Vlad and\nDmitri jump.\n\n                       ANYA\n         Of course.\n\n                       SOPHIE\n         Where were you born?\n\nSCENE CONTINUES MOS\n\nTIME LAPSE MONTAGE\n\nDmitri watches Anya answer questions gracefully and\nwithout hesitating. Anya smiles as her answers begin\nto surprise Sophie.\n\n                       DMITRI (V.0.)\n         The real Anastasia couldn't have\n         grown up to be lovelier.\n\n\nSophie and the sisters look tired. Sophie has her last\nquestion.\n\n                       SOPHIE\n              (almost giggling)\n         This is the hard one ... what rare\n         treat was served on the night of\n         the Three Hundredth Anniversary of\n         the Romanov Dynasty? The last ball\n         they ever had?\n\nDmitri and Vladimir exchange a nervous look. It's\nobvious they never briefed Anya on this one.\n\nAnya thinks a moment, then looks up, smiling, as\nshe remembers ...\n\n                       ANYA\n         Father had fresh tropical fruits\n         sent in. Oranges and pineapples\n         from the far east. I remember ...\n         I remember I threw an orange to a\n         young boy who was hiding under a\n         table...\n\nDmitri is shocked. He know this is Anastasia Romonov\nand he can't believe it.\n\n                       SOPHIE\n              (shocked)\n         Yes ... yes, it was fresh fruit.\n         Well, maybe not \"fresh\" Estelle\n         got one rather brown banana but ...\n\nCLOSE ON\n\nDmitri, as he stares at Anya as Sophie prattles on.\n\nMINUTES LATER\n\nAnya sits near the window, stroking Tillie ...\nmuch to the consternation of a jealous Meetoo.,\nShe looks out the window and sees Dmitri, deep\nin thought, wandering in the garden.\n\nOUT OF HER EARSHOT at the other end of the room,\nVladimir speaks to Sophie.\n\n                       VLADIMIR\n         Are you impressed with our Anastasia?\n\n                       SOPHIE\n         Oh, heavens - I must say, yes.\n\n                       VLADIMIR\n         Then, you'll take her to see\n         Tatiana?\n\n                       SOPHIE\n         Oh, heavens I must say... no, no\n         actually, I can't - Tatiana has\n         refused to see any more girls.\n\n                       VLADIMIR\n         Perhaps you could convince her?\n\n                       SOPHIE\n         Oh, heavens, no... but ...\n\t      (Vlad-leans closer as\n\t\tSophie shares a\n\t\tnaughty secret)\n         She is going to be at the\n         Ballet Russe tonight! That's\n         the Russian Ballet - Russe for\n         Russian, oh those crazy\n         French... they only go to see\n         which dancers will defect.\n\nShe rises heading towards Anya. Her butt knocks over\na vase, which Vladimir deftly catches.\n\n                       SOPHIE\n         Come my dear, we've much to\n         talk about.\n\nEXT. GARDEN\n\nVladimir has finished giving Dmitri the details.\nBoth are ecstatic.\n\n                       VLADIMIR\n         We did it! We did it, my boy! We're\n         going to see Tatiana at the ballet\n         tonight and we're going to be rich!\n         Rich!\n\n                       DMITRI\n         But it's not\tthe money, Vlad.\n\n                       VLADIMIR\n              (shocked)\n         Are you feeling all right?\n\n                       ANYA (CONT.)\n              (deeply grateful)\n         But you never doubted who I was,\n         did you, Dmitri? Not for a second ...\n\nAnya gratefully kisses Dmitri an the cheek and\nruns into the house. Vladimir, who's been watching,\nhas a warning.\n\n                       VLADIMIR\n         Life is funny, isn't it. You find\n         the right girl ... and then you\n         lose her.\n\n                       DMITRI\n         What do you mean?\n\n                       VLADIMIR\n         Dmitri ... You must understand that\n         once you take her to Tatiana... well,\n         it's over... nothing can happen between\n         you. She's a princess and you're a\n         commoner.\n\nDmitri understands this and is devastated. Vladimir pats\nhim on the back as he walks into the house.\n\nMUSIC BEGINS: BRIGHT, EXCITING, PARIS IN THE TWENTIES\n\nAnya and Dmitri, followed by Vlad and Sophie are walking\ndown the Champs Elysees. Meetoo trots along after them,\nhappily. They walk by AN ACCORDION PLAYER and a LADY FLOWER\nSELLER, who watch them and whisper to each other.\n\n                       ACCORDION PLAYER\n          Lovers!\n\n                       FLOWER SELLER\n          Ooh la la!\n\n\"PARIS HOLDS THE KEY TO YOUR HEART\" (PRODUCTION NUMBER)\n\nIn UPTEMPO \"PARIS IN THE TWENTIES style MUSIC, the people of\nParis ALL SING, welcoming Anya and Dmitri, Sophie and Vlad,\nto Paris!\n\nThe foursome explores the city and Anya has the\nhappiest day of her young life. On the streets they\nencounter the motley denizens of Paris, as well as\npeople with very familiar faces -- for anyone in the\naudience in the know, they'll see Josephine Baker,\nMaurice Chevalier, Rodin, Gertrude Stein, Freud,\nLindbergh - people who were in Paris in the twenties..\nFor those in the audience who don't recognize them,\nthey'll simply be unidentified fascinating \"types\" who SING.\n\nAs the joyous number progresses, we realize that Dmitri\nis feeling something else -- the impending loss of Anya\nto a world where she clearly is at home. He SINGS for a\nshort moment, knowing that he's about to lose her. Anya\nvisits a couturier and comes out with a big dress box\nfor her evening at the ballet. A BIG FINALE as they go\noff for the evening. Even Meetoo has found some female\npoodle companionship. But for one last beat, Dmitri's\nwistfulness cuts against joy.\n\nEND MUSICAL NUMBER\n\n\nEXT. PARIS SKYLINE - DUSK\n\nA glorious sunset over the city of lights ...\n\nPAN DOWN\n\nto the \"other side of the tracks, a run down area\nnext to the Seine River. Rasputin's wagon is\nparked on the edge.\n\nINT.\tRASPUTIN'S WAGON\n\nBartok freshens himself up in front of the mirror as he\n\n                       BARTOK\n                    (singing, a cappella)\n          PARSE HOLDS THE KEY TO MY HEART\n          FRENCH- BAT- CHICKS HANG OUT AT\n          MONTMARTRE\n          WE'LL EAT SOME IN-SECTS\n          THEN GO BACK AND HAVE --\n\n                       RASPUTIN (O.C.)\n                    (cutting him off)\n          Shut up!\n\nNEW ANGLE\n\nshowing Rasputin trying to concentrate on the reliquary.\n\n                       BARTOK\n          Sorry, it's just... you know I saw these\n          french postcards once and... ooh la la ...\n          well, I'm not sure about the \"ooh\", but\n          it's the \"la la\" I'm really lookin'\n          forward to...\n                    (Rasputin growls)\n          Right, I'm shutting up.\n\nRasputin leans closer to the reliquary, which now contains\nthe BRIGHTEST COLORS we've seen. The reliquary sits in\nit's cabinet.\n\n                       RASPUTIN\n          We're close to her, aren't we?\n\nThe reliquary BRIGHTENS even more, looking as if it could\nburst.\n\n                       RASPUTIN (CONT.)\n          Excited, eh? You look about to burst ...\n                    (teasing)\n          You'd like to burst, wouldn't you?\n\nThe lightsin the reliquary shake, as if to say \"yes\".\n\n                       RASPUTIN (CONT.)\n          No, no, no. We made a bargain.\n                    (petting it)\n          Someday you'll have me for all eternity.\n          Till then...\n                    (leaning closer)\n          I'm in charge.\n\nRasputin slams the cabinet shut, then turns to see Bartok\nin front of a mirror. He wears a smart BLACK BERET which\nis much too large on him.\n\n                       BARTOK\n          What do you think? Is it me?\n\nEXT. SMALL HOTEL - NIGHT\n\nSweet, small french hotel on a winding cobble stone street\nof the Left Bank.\n\nINT. SMALL HOTEL - NIGHT\n\nDmitri and Vladimir are both dressed in formal attire and\nlook extremely dapper. Vlad is delighted with himself,\nmodeling his finery, but Dmitri looks very sad.\n\n                       VLADIMIR\n          Compliments of Sophie. Her escort\n          has to look his best.\n\nThey turn as the door opens and Anya stands nervously,\nbut then strikes a regal pose. She looks magnificent ...\nradiant, which is not lost on Dmitri.\n\n                       ANYA\n          How do I look?\n\nBefore Vladimir can gush, Dmitri, forced to repress his\ntrue feelings, is a bit curt and rises.\n\n                       DMITRI\n\n          Fine.\tWe better go.\n\nAnya looks surprised by his tone, but follows.\n\nEXT.\tPARIS OPERA HOUSE - NIGHT\n\nAs the BEAUTIFUL PEOPLE OF PARIS pull up in carriages and\nautomobiles.\n\nINT.\tPARIS OPERA HOUSE\n\nAs Dmitri, Vladimir and Anya take their seats, all around\nthem people are whispering \"Who's that?\", \"What a beautiful\nwoman\", etc. The Ballet begins.\n\nANYA'S POV\n\nDancers in bright costumes leap across the stage.\n\nDmitri turns to Anya and gestures to the box seats to the\nleft. He hands her the opera glasses.\n\n                       DMITRI\n          Look. There is your grandmother...\n\nAnya gives Dmitri a very nervous look and takes the glasses,\naiming them toward Tatiana.\n\nANYA'S POV\n\nThe majestic Tatiana, flanked by Sophie and her sisters and\nbacked by several large GUARDS in uniform. \n\n                       ANYA\n          She's so beautiful! I do remember\n          her ... I remember her ...\n\nThe music continues as Anya looks at Tatiana.\n\nINTERMISSION\n\nThe lights come up and people around them begin to stand\nup, stretch, etc. Dmitri turns to Anya.\n\n                       DMITRI\n          Come on. It's time..\n\nINT. MEZZANINE -- MINUTES LATER\n\nThey approach Tatiana's private box.\n\nDMITRI Wait here for just a moment. I'll go in first and\nprepare her. It's bound to be a shock...\n\n                       ANYA\n          I'm so scared...\n\n                       DMITRI\n          Don't be\n\n                       ANYA\n\n          And grateful. To you.\n                    (reaching out to him)\n          If it weren't for you --\n\n                       DMITRI\n                    (upset, pulling away)\n          I know.\n\nDmitri opens the door into Tatiana's private box. Anya\nwaits nervously outside.\n\nINT.\tPRIVATE BOX\n\nDmitri walks up to the guards standing at the top of three\nsmall steps into the box seats.\n\n                       DMITRI\n          I need to speak with the\n          Dowager Empress ...\n\n[PAGE MISSING]\n\n                       TATIANA (CONT.)\n          How much pain will you inflict\n          on an old woman for money?!\n\n                       DMITRI\n          Please, if you'd just listen...\n\n                       TATIANA\n                    (to guards)\n          Remove him at once.\n\nThe guards physically force Dmitri out, in spite of his\nurgent pleas.\n\n                       DMITRI\n          Please! Empress! It's not what you ....\n\nDmitri is thrown out of the box and straight into Anya,\nwho stares at him with tears in her eyes. She then turns\nand runs away.\n\n                       DMITRI\n          Anya. . . please. . . \n\nINT. LOBBY\n\nAnya pushes her way through the CROWD with Dmitri in pursuit.\n\nEXT. OPERA HOUSE - NIGHT\n\nAnya bursts out of the doors followed by Dmitri\n\n                       DMITRI\n          Anya, wait!\n\n                       ANYA\n                    (spinning on him)\n          Tell me it isn't true?! Tell me\n          you didn't do this for the money!\n\n                       DMITRI\n          No! Well, yes, but\n\n                       ANYA\n          No! I thought you believed in\n          me! It was all a lie!\n\nEXT.\tPARIS OPERA\n\nDmitri runs out and stands by grand looking automobiles\nlined up in front. He scans the cars.\n\nDMITRI'S POV\n\nTatiana is walking toward her car. A very proper CHAUFFEUR\nholds the door for her.\n\nThe CHAUFFEUR helps Tatiana in, then is about to climb\ninto the front seat when Dmitri rushes up to him.\n\n                       DMITRI\n          Sir! Your rear tire is flat!\n\n                       CHAUFFEUR\n          it is?\n\nAs he gets out to look, Dmitri slides into the drivers\nseat and roars away. The stunned Chauffeur in his dust.\n\nINT. CAR\n\nTatiana is jolted by the fast motion of her car.\n\n                       TATIANA\n          Ulo! Slow down!\n\nDmitri turns from the front seat and looks at her.\n\n                       DMITRI\n          I'm not Ulo and I won't slow down.\n          But you will listen to me!\n\n                       TATIANA\n                    (recognizing Dmitri)\n          You! How dare you?! Stop this car\n          immediately!\n\nEXT.\tPARIS STREETS\n\nTatiana's car flying down small streets.\n\nINT.\tTATIANA'S  CAR\n\n                       TATIANA\n          Stop this car!\n\n\n\nThe car slams to. a stop in front of the SMALL HOTEL.\nDmitri leans into the back seat, face-to-face with her.\n\n                       DMITRI\n          Please don't be afraid! I'm sorry,\n          but there was no other way!\n\nTatiana is frightened, but still very stubborn. She looks\naway from him. Dmitri thrusts the music box into her hands.\n\n                       DMITRI (CONT.)\n          Look at this!\n\nTatiana looks down and is immediately taken aback.\n\n                       TATIANA\n          Anastasia's music box... She had this\n          all these years...\n                    (fighting the possibility)\n          You could have found it...\n\n                       DMITRI\n          What I foundyour was your granddaughter!\n\nTatiana turns away from him again.\n\n                       DMITRI (CONT.)\n          You were right - it was a lie.\n          My intention was to fool you\n                    (sadly)\n          I am a liar - but I found the\n          truth. Just see her! I swear\n          if you see her I'll disappear\n          forever\n\nDmitri points up to the open window of the hotel.\n\n                       DMITRI (CONT.)\n          Just look! Just look at her!\n\nTatiana finally looks out the window.\n\nTATIANA'S POV\n\nAnya holding Meetoo in front of the window.\n\nBACK TO TATIANA\n\nreacting to how much she looks like Anastasia.\n\nINT. SMALL HOTEL -- A MINUTE LATER\n\nAnya hears a KNOCK and assumes it is Dmitri.\n\n                       ANYA\n          Go away!\n\nThe door opens slowly. Anya spins, then softens when she\nsees Tatiana holding the MUSIC BOX.\n\n                       TATIANA\n          Who are you, child?\n\n                       ANYA\n                    (crying)\n          I don't know! I don't want to hurt you...\n\nTatiana holds out the music box.\n\n                       TATIANA\n          Do you remember this?\n\n                       ANYA\n          I remember something lost ...\n          I'm so confused! Oh, please,\n          just tell me if you recognize me!\n          Do you think I could have...\n          belonged to you ...\n\nTatiana notices Anya nervously playing with the key around\nher neck. Tatiana reacts when she sees the key.\n\n                       TATIANA\n          Oh! Where did you get that?!\n\nAnya sees her looking at the key around her neck.\n\n                       ANYA\n          I've always had it... I came here\n          because of this! Tell me if you recognize\n          it! Please! It's all I have...\n\nUNDERSCORE-\t\"THE MUSIC BOX THEME\"\n\nTatiana holds out her hands as Anya takes off the key\nand hands it to her.\n\n                       TATIANA\n                    (through tears)\n          It was hers ... my Anastasia's ...\n                    (then suddenly: angry,\n\t\t          defensive)\n          If this is part of your scheme!\n          If you found it or stole - I\n          don't care, I'll give you\n          whatever you want just TELL ME\n          THE TRUTH!\n\nAnya takes the music box and the key out of Tatiana's\nhand gently - remembering how it works. Anya puts in the\nkey and begins to wind it. Tatiana is surprised that Anya\nknows how it works - so is Anya!\n\n                       TATIANA (CONT.)\n                    (singing, a cappella)\n          PAR AWAY, LONG AGO GLOWING DEEP\n          AS AN EMBER\n\n                       ANYA\n                    (remembering)\n          THINGS MY HEAR USED TO KNOW\n          THINGS IT YEARS TO REMEMBER\n\nWe hear THE MUSIC BOX begin to play.\n\n                       BOTH\n          AND A SONG SOMEONE SINGS\n          ONCE UPON A DECEMBER...\n\nTheir cracking voices trail off as they look at each other\nand know that they are who they've been searching for -\nand the search is finally over.\n\nTatiana and Anya throw their arms around each other, both\ncrying, both overjoyed.\n\nTATIANA Anastasia! Anastasia! You've come home at last!\nYou've come home ...\n\nOUTSIDE THE WINDOW\n\nDmitri watches Anya and Tatiana's embrace. He smiles sadly,\nthen turns and walks down the dark street alone.\n\nEXT. ANYA'S WINDOW\n\nBartok slides his way out to the window ledge. Overcome with\nemotion, he is crying big bat tears.\n\n                       BARTOK\n          He is gonna yellllll.\n\nEXT. RASPUTIN'S WAGON - NIGHT\n\nHideous fat river rats, ferocious looking and scarred,\nstop and tremble nervously when\n\n                       RASPUTIN (O.C.)\n                    (booming louder than ever before)\n          SHE'LL FIND HER DEMISE IN THAT HAPPY HOME!\n\nBartok catapults across the frame, having been thrown out\nof the window so hard that when he hits the stone wall of\nthe river bank, the stones crack.\n\n                       BARTOK\n          I should have been a dentist ...\n\nINT. ANYA'S BEDROOM IN TATIANA'S HOUSE - NIGHT\n\nAnya snuggles down into the thick covers as Tatiana\nstrokes her hair gently.\n\n                       ANYA\n          ... and that Christmas dinner,\n          when Cook made that awful plum\n          pudding and we hid it in our\n          pockets so we wouldn't hurt her\n          feelings! I do remember so much\n          now, Grandmama, - but not everything.\n\n                       TATIANA\n          Don't worry about that now, child,\n          it will all come back to you now\n          that you're home...\n\nAnya closes her eyes as Tatiana continues to stroke her hair.\n\n                       TATIANA (CONT.)\n                    (quietly)\n          My poor child you're safe, now...\n          you're home ...\n\nAnya is asleep as Tatiana kisses her forehead, turns off\nthe light and walks to the door. She looks back on her\nsleeping granddaughter with enormous joy and gratitude.\nShe smiles to herself as she pulls the door closed \nbehind her, revealing RASPUTIN STANDING BEHIND THE DOOR.\nHis eyes glow like embers in the dark. Bartok is perched\non his shoulder.\n\n                       RASPUTIN\n          Yesss ... finally \"home\". And what\n          a charming ... girlish little home\n          it is.\n                    (gestures to CHERUBS\n                       in the wallpaper)\n          Look, Bartok, little angels, the\n          symbol of ... love. So sweet, so\n          harmless.\n\nRasputin takes the reliquary from around his waist and\nplaces it on the table.\n\n                       RASPUTIN (CONT.)\n          Let's go for a touch of irony, shall we?\n\nHe waves his hand and the smoke emerges, emanating toward\nthe walls.\n\nCLOSE ON\n\nsome CHERUBS as the smoke hits them. They begin to change,\ntaking on a lean and evil look. Their tiny arrows grow,\nbecoming lethal, as their eyes turn from soft brown to\nblood red. Slowly, they EMERGE from the wallpaper, their\nsmall wings growing into horrible pterodactyl membranous\npaired appendages.\n\nThey SWOOP into flight and begin to circle the room, faster\nand faster. Rasputin leans precariously over the sleeping\nAnya, chuckling.\n\n                       RASPUTIN (CONT.)\n          And there will be no blood on my hands ...\n\nRasputin backs away as the cherubs aim their JAGGED ARROWS\nat Anya.\n\nSuddenly, Meetoo leaps up from the bed, barking. Rasputin,\nstartled, jumps backward. Bartok falls off his shoulder and\non to the table, knocking into the reliquary - which is about\nto fall. \n\n                       RASPUTIN (CONT.)\n          Nooooooo!\n\nRasputin catches it. The SPELL is immediately broken and\neverything turns back to normal just as Anya wakes up. She\nsees Rasputin and lets out a SCREAM.\n\nRasputin advances on her, his hands outstretched as if to\nstrangle her when he hears footsteps and voices in the hallway.\n\nRasputin grabs the reliquary and LEAPS out the window, his\nmonk's robe billowing just as the door opens.\n\nTatiana rushes in and sees Bartok flying out the window.\n\n                       TATIANA\n          Anastasia! It was just a bat!\n          It's gone, dear...\n\n                       ANYA\n                    (shaken)\n          No, it wasn't a bat! I saw this\n          horrible man - I remember him,\n          I think...\n\n                       TATIANA\n                    (comforting)\n          No, no child... shush... it's\n          all right ...\n\nShe embraces Anya, who is still terrified and knows\nthat she saw what she saw.\n\nINT.\tTATIANA'S HOUSE - DAY\n\nAnya sits, looking a bit vacant as two overly French\njewelers, PIERRE & ANDRE, fit Anya for her ROYAL CROWN.\n\nTatiana sits across from Anya and can't help but notice\nthat Anya looks miserable as Sophie bustles about.\n\n                       SOPHIE\n          A grand ball for the Princess.\n          How very exciting. So much to do,\n          so little time...\n\n                       TATIANA\n                    (slightly annoyed)\n          Do it somewhere else, please. Quietly.\n\nThe slight is lost on Sophie who bustles out talking to herself.\n\n                       SOPHIE\n          Caterers ... invitations ... saber\n          dancers! We must have saber dancers!\n\n\"RULERS OF RUSSIA\" (COMIC REPRISE)\n\nSophie SINGS as COMIC REPRISE of 'RULERS OF RUSSIA\"\n\nPierre and Andre argue as they fit Anya for the crown.\n\n                       PIERRE\n          Her head it is ... how you say?\n\n                       ANDRE\n          Beeg. Zat is how you say it.\n          Beeg.\n\n                       PIERRE\n          And the crown she is ... how you say?\n\n                       ANDRE\n          Small! Zat is \"how you say\" it!\n          Don't be so French, Pierre wit the\n          \"how you say\" all za time - zat is\n          really annoying.\n\nAs they discuss this, Anya wanders away from them, the crown\nstill slightly askew on her head. Tatiana follows her.\n\n                       TATIANA\n          You are going to make a beautiful\n          princess.\n\nBut Anya simply nods. Tatiana turns her towards a FULL LENGTH\nMIRROR, then straightens the crown as they look at their\nreflections.\n\n                       TATIANA\n          Lovely...\n\t          (no reaction)\n          What troubles you, child?\n\nBut before Anya can answer, Vladimir leans into the room.\n\n                       VLADIMIR\n          Madame, your... eh... guest has\n          arrived.\n\n                       TATIANA\n                    (knowing)\n          Thank you, Vladimir.,\n\nTatiana leaves and Vladimir looks at Anya. Anya, angry\nat him, turns away.\n\n                       VLADIMIR\n          Anya... Anastasia... I'm sorry ...\n          We didn't mean to hurt you ...\n\nAnya still won't look at him.\n\nINT. TATIANA'S STUDY\n\nTatiana walks into her study and is happy to see Dmitri\nis standing there, looking nervous and very uncomfortable.\n\n                       TATIANA\n          I sent for you because I owe you a\n          debt of gratitude larger than I can\n          ever repay\n\n                       DMITRI\n          No. Empress, you --\n\n                       TATIANA\n          I want you to have the reward money -\n          you've earned it.\n\nHe leaps from his chair, exploding with emotion.\n\n                       DMITRI\n          Empress, no! I will not take the\n          money! I just came to tell you\n          I was sorry...\n\n                       TATIANA\n          Young\tman, I...\n\nDmitri flips his hair out of his eyes and Tatiana gets\na look of recognition across her face.\n\n                       DMITRI\n          ... and I'm going to keep my\n          promise to stay out of your\n          lives, forever.\n\nTatiana looks at him with great understanding and affection\nas she realizes,\n\n                       TATIANA\n          You are the boy ...\n\n                       DMITRI\n                    (uncomfortable)\n          I should go\n\n                       TATIANA\n          That last night in the palace...\n          one boy showed us kindness and courage.\n          You were the boy who saved our lives,\n          weren't you?\n                    (Dmitri doesn't answer)\n          Please, is there nothing I can do to\n          repay you?\n\n                       DMITRI\n          Promise me she'll have her home.\n\n                       TATIANA\n          She does.\n\n                       DMITRI\n          And tell me that she's happy.\n\n                       TATIANA\n\t  Oh, Dmitri.I wish that I could.\n\nDmitri comes down the steps, then stops when he sees Anya,\nwearing her CROWN.\n\nShe turns and sees him, stifling her first impulse, then\nputting on a show of supreme confidence.\n\n                       DMITRI\n          I'm glad you found what you\n          were looking for.\n\n                       ANYA\n          I'm glad you\tdid too.\n\nWith nothing left to say, he heads for the door.\n\n                       ANYA\n          Enjoy your fortune.\n\nDmitri spins, but restrains. He opens the door and\nAnya goes back into the Parlor. They both know that\nthey will never see each other again.\n\nINT.\tLITTLE HOTEL - DAY\n\nDmitri busily tosses his few possessions into his\nbackpack as Vladimir - in formal attire - waves an\nembossed INVITATION at him.\n\n                       VLADIMIR\n          But this invitation came\n          from the Empress herself!\n          It's the social event of\n          the decade! You can't turn\n          it down!\n\n                       DMITRI\n          Watch me.\n\nVladimir starts to protest. Dmitri grabs the invitation\nand tears it up, tossing the pieces into the air.\nVladimir sighs.\n\n                       VLADIMIR\n          So where will you go?\n\n                       DMITRI\n          She found her home.\n          Maybe it's time I found\n          one too!\n\nNEW POV\n\nfrom outside the window. WE DO NOT HEAR THEM, but we\nsee Vlad and Dmitri hug good-bye.\n\nPULL RACK\n\nto see it's RASPUTIN'S POV; as he stands on a LADDER\nOF SMOKE, looking into Dmitri's window. Rasputin watches\nVladimir leave as Dmitri finishes packing.\n\nINT.\tDMITRI'S ROOM\n\nAs the windows BURST OPEN and Rasputin swoops in. Dmitri\nbacks away, terrified as the ladder dissolves and smoke\nfills the room.\n\n                       RASPUTIN\n          So. You don't want to go to \n          the coronation, eh?\n\n                       DMITRI\n                    (recognizing him)\n          Rasputin!\n\n                       RASPUTIN\n          I know, I know ... you thought I\n          was dead. That's how the history\n          books will remember me - not as\n          the ruler of all of Russia,\n          which I SHOULD HAVE BEEN -\n          but as the guy who was never\n          dead when you expected him to be.\n          \nDmitri backs away as the smoke coils around him and\nRasputin advances.\n\n                       DMITRI\n          What do you want?!\n\n                       RASPUTIN\n          The same thing I wanted ten \n          years ago - all the Romonovs dead\n          I got the others, now I have\n          to finish up with that nuisance, \n          Anastasia...\n\n                       DMITRI\n          You're insane! You didn't\n          kill the Romonovs - it\n          was the...\n\n                       RASPUTIN\n          STOP IT! I DID SO KILL THEM!\n          And I'm going to kill Anastasia.\n\nDmitri lunges for him but the smoke coils around\nhim like rope, holding him back.\n\n                       RASPUTIN (CONT.)\n          Look at me...\n                    (Dmitri turns away)\n          Look at me!\n\nThe SMOKE forms into hands, forcing Dmitri's face\ntoward Rasputin's. Dmitri's eyes widen. Rasputin\nlocks on him with his eyes, glowing like red hot\ncoals, as he bears Dmitri in hypnotically.\n\n                       RASPUTIN (CONT.)\n          You are going to help me\n          kill her... You are going\n          to help me kill her...\n          her...\n\nON BARTOK\n\nwho looks away, obviously not enjoying this.\nAs WE HEAR Rasputin repeat \"You are going to\nhelp me\" a few more times.\n\nEXT.\tEIFFEL TOWER - NIGHT\n\nMagnificently, the Eiffel Tower illuminates all of\nParis when FLOOD LIGHTS come on and we see a LARGE\nPARTY has been set underneath it's black iron legs.\nWE HEM TRUMPETS as we\n\nMOVE IN CLOSER\n\nto see that a stage has been set up on the north side,\nthe \"Seine side\". of the Tower, with a large throne-like\nchair in the center. Beautiful PARTY GUESTS,  many we\nhad seen in the opening Ballroom scene, mingle around\nexcitedly. Behind the stage, a beautiful curtain separates\nthe party from\n\nINT. BEHIND THE CURTAIN\n\nthe Princess Anastasia, in crown and full coronation gown.\nAnastasia fidgets nervously, looking for the key around\nher neck, then remembering it isn't there anymore, as a\nMAJOR RUSSIAN DOMO addresses her and Tatiana.\n\n                       MAJOR DOMO\n          ... then as I say \"Her Serene Highness\n          Princess Anastasia\" you, your Highness,\n          should walk out on to the stage and\n          greet your ...\n\nTatiana sees that Anastasia isn't listening and dismisses\nthe Major Domo in mid sentence.\n\n                       TATIANA\n          I believe her highness understands \n          what she has to do.\n\nMajor Domo bows and leaves. Tatiana looks at Anastasia.\n\n                       TATIANA (CONT.)\n          Don't you, child?\n\n                       ANYA\n          Oh, yes, Grandmama -\n          I wait until I hear...\n\n                       TATIANA\n          No, not about the ceremony,\n          Anastasia - do you understand\n          the choice you must make.\n\nAnya turns to her in confusion.\n\n                       ANYA\n          There's no choice...\n\nAnya is cut off with a quick knock at the door,\nas Sophie and Vladimir enter, bowing to them both.\nVladimir has Meetoo, all dressed up in bows and\nribbons - and looking miserable - on a leash.\n\n                       VLADIMIR\n                    (to Tatiana)\n          Your \"guest\" is unable to attend.\n\nTatiana is troubled by this news. Anya starts\nlaughing when she sees Meetoo.\n\n                       ANYA\n          Oh, Meetoo! You look miserable!\n          Oh, Vlad - look at him!\n\n                       VLADIMIR\n                    (formally)\n          Yes, your highness.\n\n                       ANYA\n          Poor Meetoo!\n\n                       VLADIMIR\n                    (formally)\n          Yes, your highness.\n\n                       ANYA\n          Cut it out, Vlad! I'm not\n          angry with you anymore -\n          I know how much you needed\n          the money.\n\n                       TATIANA\n          But they didn't take the money -\n          either one of them. I offered it\n          to them, but they both refused.\n\nAnya is shocked, she takes a minute to process this as\n\n                       ANYA\n          Dmitri didn't want the money?\n\n                       TATIANA\n          No, he just wanted to know\n          you were happy.\n\n                       VLADIMIR\n                    (taking Sophie's hand)\n          Fortunately, I am to be married.\n                    (backing away)\n          With your highness, permission.\n\n                       ANYA\n          Vlad, stop acting this way! \n          You're my friend!\n\n                       VLADIMIR\n          No. From now on I am your\n          loyal subject ... your\n          highness. By your leave?\n\nTo Anya's dismay, Vlad and Sophie bow and back out of the room.\n\n                       ANYA\n          Why does everyone have to\n          act that way?\n\n                       TATIANA\n          You'll have to become used\n          to it, child, if you accept\n          the crown...\n\n                       ANYA\n          \"If\" I accept?! Of course\n          I'm going to accept! it's\n          what I always wanted!\n\n                       TATIANA\n          Is it? Is this what you want?\n\nTatiana gestures to the formality outside.\n\n                       ANYA\n          I wanted to come home,\n          Grandmama - and I did.\n          I came back to my home\n          with you.\n\n                       TATIANA\n          You can't go back to find your \n          home. Your home is in your heart,\n          in the future that you make for\n          yourself.\n\n                       ANYA\n          And this is my future. This is \n          who I am!\n\n                       TATIANA\n          This is who you were. Exactly \n          who you are is up to you.\n          \n                       ANYA\n          I don't know who I am!\n          I still don't know!\n\n                       TATIANA\n          Yes, you do. You do.\n\nTatiana kisses her on the forehead.\n\n                       TATIANA (CONT.)\n          And in your heart, you know what\n          is right for you.\n\nTatiana turns to leave.\n          \n\n                       ANYA\n          I've spent my whole\n          life waiting to find you ...\n\n                       TATIANA\n          And we have found each other\n          nothing will ever change that!\n          I am your family, dear child,\n          but I may not be your home.\n\nTatiana leaves. Anya is very torn. Anya jumps as\nthe TRUMPETS sound announcing her entrance.\n\nINT. BALLROOM - NIGHT\n\nThe COURTIERS gather, excited, as the Major Domo\nreadies to make his announcement.\n\nINT. ANTE ROOM (EIFFEL TOWER)\n\nAnya, thinking about what Tatiana has said, looks\nat herself in the mirror.\n\nANYA'S POV\n\nthe Princess Anastasia. But not Anya.\n\n                       MAJOR DOMO (O.C)\n                    (announcing)\n          Her Serene Highness, the Princess \n          Anastasia!\n\nPause.\tWE HEAR mummers from the crowd outside, various\n\"Where's Anastasia?\", then\n\n                       DMITRI (O.C.)\n          Anya!\n\nAnya spins around, looking for him. His voice seems\ndistant and ghostly,\n\n                       DMITRI (O.C.)\n          Anya ...\n\n\nAnya follows his voice out of the room and into the\nELEVATOR. The doors close.\n\nEXT. ELEVATOR\n\nas it rises gently to the very top of the Eiffel Tower\nnot on cables - but on long ropes of smoke.\n\nEXT.\tTOP OF EIFFEL TOWER\n\nRasputin, gleeful, sits perched on a girder, looking down\nat the party below.\n\n                       RASPUTIN\n          Look, Bartok. Most of them were\n          there the night I made this curse.\n          Now, they'll get to see it finished!\n                    (sighing, content)\n          Revenge is a dish best served... in\n          front of a larrrrrge audience!\n\nRasputin leans over the rail and looks down at the party.\n\n                       RASPUTIN (CONT.)\n          Do not despair. I'll make sure your \n          beloved princess drops in.      \n\nRasputin chuckles at his own \"wit\"\n\n                       BARTOK\n                    (depressed)\n          Ahh, very witty. There's this\n          English guy - Noel Coward -\n          I'll bet he's quaking ...\n\nON THE ELEVATOR\n\nAs the door open and Anya rushes out, looking around.\n\n                       ANYA\n          Dmitri?\n\nDmitri is standing - like a zombie - at the far end\nof the platform. Anya sees him.\n\n                       ANYA\n          Dmitri ... Grandmama told me.\n\nShe stops. She can tell that something isn't right\nwith Dmitri by the look in his eyes.\n\n                       ANYA\n          Dmitri, what's wrong?\n\nDmitri approaches her slowly, zombie-like, arms\noutstretched.\n\n                       RASPUTIN\n                    (from above)\n          Throw her off the edge! Do it!\n\nAnya looks up at the booming voice.\n\nANYA'S POV\n\nsees Rasputin.\n\nBACK TO ANYA: FLASHES, RAPID IMAGES:\n\nRASPUTIN from the last night at the palace\n\nYOUNG ANASTASIA - TERRIFIED\n\nORANGE flash of gunshots\n\nYOUNG DMITRI leading them out the wall panel, then the\nFace of the YOUNG DMITRI superimposes over the zombie who\nis coming toward her.\n\n                       ANYA\n          Dmitri ... Look at me!\n          It's Anya! It's ANYA!\n\nDmitri stops. His eyes glazed and frightening.\n\n                       ANYA\n          You saved my life in the\n          palace! You won't take\n          it now...\n\n                       RASPUTIN\n                    (from above)\n          FINISH HER!\n\nAnya holds her ground as Dmitri moves toward her,\nready to push her off the\nedge.\n\n                       ANYA\n          Dmitri. I know you would\n          never hurt me. You love me.\n\nAs Dmitri come close, she moves toward him and\nkisses him. He blinks and snaps out of it and is\nquite happy that Anya is kissing him.\n\n                       ANYA\n          Dmitri?\n\n                       DMITRI\n          Anya... where are we?\n\nWE HEAR a howl from above and suddenly Rasputin\njumps down. The reliquary tied to his waist, he's\nmore furious than we've ever seen him - his face\nliterally consumed with rage and hatred.\n\nAnya is terrified - but holds her ground as she did\nwhen she was a child.\n\n                       ANYA\n          I guess you aren't as\n          powerful as you thought!\n\nRasputin walks slowly toward Anya and Dmitri, burning with rage.\n\n                       RASPUTIN\n          I'll show you!\n\n                       DMITRI\n          Run, Anya -  go...\n\n                       ANYA\n          I'm not leaving you!\n\n                       RASPUTIN\n          Fighting for fair lady. How noble...\n\nDmitri pushes Anya away and charges the much larger\nRasputin, who knocks his aside with on swoop of big\nhuge arm.\n\n                       RASPUTIN (CONT.)\n          And how pathetic.\n\nRasputin turns to Anya climbing up a girder.\n\n                       RASPUTIN (CONT.)\n          That's only going to make you\n          fall farther.\n\nAnya turns suddenly and kicks Rasputin in the face,\nwhich has the same effect as kicking a brick wall.\nAnya is thrown off balance and falls. Rasputin pushes\nher with his foot and she slides across the floor to\nDmitri.\n\nAnya and Dmitri exchange a quick look as Rasputin,\nchuckling, advances on them. Anya reaches up and grabs\nRasputin's beard, pulling his face forward so that\nDmitri can give him a good roundhouse punch.\n\nThe blow does little but enrage Rasputin. He reaches\nout and with one huge hand, picks Anya like a rag doll\nand takes her to the ledge.\n\n                       DMITRI\n          Anya!\n\nDmitri throws himself against Rasputin several times\nonly to get batted away like a fly. Realizing this is\nfutile, Dmitri slips through the FLOOR GIRDERS and\nscurries towards the edge... BELOW TEM.\n\nDMITRI POV: Rasputin's large boots above him, heading\nfor the edge.\n\nABOVE\n\nRasputin reaches the edge, playful dangling the\nstruggling Anya over the side.\n\n                       RASPUTIN\n          My curse is now complete!\n          Good-bye, babushka!\n\nAnya looks over the ledge.\n\nANYA'S POV\n\nThe city below as she FALLS. Dmitri emerges from the\ngrid below and GRASS her, holding on to the back of\nher dress.\n\n                       DMITRI\n          Take my hand!\n                    (sees Rasputin approaching)\n          Hurry!\n\nShe manages to spin around, gripping his hand.\n\n                       ANYA\n          Don't let me go!\n\n                       DMITRI\n          I'll never let go!\n\nCLOSE\n\ntheir hands, gripping one another.\n\n                       RASPUTIN (O.C.)\n          What a touching sentiment...\n\nThey look up to see his right above them. Rasputin's\nboot SMASHES DOWN on Dmitri's hand, which grips the\ngirder.\n\nDmitri screams out\tin, but doesn't let go. He\nlooks down at Anya and pulls her up while Rasputin\nbegins to pry off Dmitri's fingers one at a time.\n\n                       RASPUTIN\n          This little piggy had a palace...\n          this little piggy had a throne...\n\nAnya swings to another beam and now has firm footing as\nRasputin continues.\n\n                       RASPUTIN (CONT.)\n          This little piggy missed the firing\n          squad..\n\nDmitri is literally holding on with two fingers.\n\n                       RASPUTIN (CONT.)\n          And this little piggy wanted a home...\n          And this little piggy went wee wee\n          wee all the way... down!\n\nAs Dmitri's last finger is preyed away, he falls but\nhis grasp on Anya's hand is firm and she pulls him\nonto where she is standing.\n\nRasputin leans over and bends toward them, three feet\nfrom Anya.\n\n                       RASPUTIN (CONT.)\n          DIE!\n\n\nThe reliquary is dangling. Anya reaches up to grab on to\nit but her aim is off and she HITS it. The reliquary flies\nand SMASHES against the side of the tower, shattering.\nRasputin realizes what has happened and scrambles away\nin terror.\n\n                       RASPUTIN (CONT.)\n          NOOOOOOOOO!\n\nON BARTOK\n\nwho covers his eyes.\n\nON ANYA AND DMITRI\n\nwho climb back up to the platform.\n\nLONG SHOT\n\nof the Eiffel Tower as the EVIL SPIRITS FROM THE\nRELIQUARY burst out. The SPIRITS take on all the forms\nwe've seen earlier: BEARS, MINIONS, SNAKES, and\ncombinations of all. They grow and swirl, with hideous\nMOANING noises.\n\nAnya and Dmitri huddle together, in disbelief.\n\nON RASPUTIN\n\nas the SPIRITS begin to swarm around him, a TORNADO of\nhorrid beings. Re screams as they pull him off the\nground.\n\nON ANYA AND DMITRI\n\nas the force of the tornado increases, they have to\nhold on to the girders and each other in order not to\nbe sucked in. Bartok is thrown against the side of the\ntower and slithers to the floor.\n\nON RASPUTIN\n\nsuspended over the Eiffel Tower in the maelstrom. He\nScreams wildly as the spirits encircle his, torment\nhim and EXPLODE - pieces fly and disintegrate in mid-air,\nin wild colors and smoke.\n\nON DMITRI AND ANYA\n\nwho hug each other in relief. They stand, looking out.\nThe smoke dissipates, showing them the city lights below.\n\nON BARTOK\n\nwho rises, patting his chest- He's about to let out\na Bartokism... but all the emerges are LITTLE BAT SQUEAKS.\nHe's surprised as first, then thrilled. The spell is\nbroken and he's just a bat again.\n\nDMITRI AND ANYA\n\nas he reaches down and picks up the crown that fell off\nher head in the fight. He hands it to her.\n\n                       DMITRI\n          Come on... I'll take you home.\n\nAnya looks lovingly at Dmitri and doesn't put the crown back on.\n\n                       ANYA\n          I am home.\n\n\"HONE IS WHERE YOU ARE\"\n\n(The Love Duet For Anya And Dmitri). A SIMPLE EMOTIONAL\nBALLAD for two people who realize at last that their hearts\nhave led then to each other, to \"home\". This will work within\nthe dramatic context of the film (sung by the characters) but\ncan also be re-recorded as a Pop single.\n\nThe song continues over various scenes:\n\nTHE EMPTY STAGE\n\nTatiana smiling, knowingly.\n\nSOPHIE & VLADIMIR\n\nsneaking a kiss in the middle of the party. Xenia and Estelle\nlook at each other with their stone faces.. . and smile.\n\nBARTOK\n\nHanging from the rafters of the Eiffel Tower, no sure what\nto do next - then a cute female bat flies up next to his and\n\"bats\" her eyes.\n\nANYA & DMITRI\n\nwalking over the River bridge with Meetoo following behind\nthem... a family - going home together.\n\nFADE OUT\n\nTHE END\n\n\n\n\n\nAnastasia\nWriters :   Susan Gauthier  Bruce Graham\nGenres :   Family  Animation  Musical\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:25.512147"}