{"title": "Angel Eyes", "film_link": "/Movie Scripts/Angel Eyes Script.html", "script_link": "/scripts/Angel-Eyes.html", "info_raw": "\n\nAngel Eyes Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gerald DiPego\nGenres  Drama  Romance\nScript Date : October 1999\n\nRead \"Angel Eyes\" Script\n\n\n", "script": "\nANGEL EYES\n        by\n\n   Gerald DiPego\n\n\n\n    October 1999\nSeventh Draft/Polish\n\n\n\n\nFOR EDUCATIONAL\n PURPOSES ONLY\n\nFADE IN:\n\nEXT. CITY STREETS (LOS ANGELES) - NIGHT\n\nCREDIT SEQUENCE.\n\nAs OPENING CREDITS play, we study the city's nighttime\npulse, ribbons of headlights moving and cross-connecting\nlike blood through the veins of a body --\nimpressionistic, even beautiful, but what we're hearing\nis soulful trumpet-based MUSIC, mellow and haunting, the\nmodern classic -- JAZZ sound of a Wynton Marsalis,\nputting a voice to our story. As CREDITS END, we...\n\n                                            DISSOLVE TO:\n\n\nPOV - EXT. FREEWAY - NIGHT\n\nNow the MUSIC is GONE, SOUNDS are MUFFLED and vision\nblurred. We get the impression of urgent movement. We\nhear BREATHING. There are VOICES, SHOUTS, even SCREAMS,\nbut MUFFLED, far away. Only the breathing is distinct.\nWe come to realize it is our breathing, and we are inside\nsomeone, looking out. The man whose POV this is is on\nthe edge of consciousness and not far from death. He\nlies on the pavement of a freeway at the site of an\naccident only minutes after impact.\n\nHis VISION goes IN and OUT of clarity. People are\nswarming around him and rushing by toward the carnage of\nwrecked vehicles. A SIREN BLOOMS in the distance and\napproaches haltingly. The man slips away, comes back\ntoward consciousness, slips again.\n\nThe crowd around the downed man parts to allow passage to\na police officer. It is a woman, Officer SHARON POGUE,\nLAPD. She kneels at the man's side, taking charge,\nspeaking, but we hear only SLIVERS of SOUND. He sees her\nface clearly now, close above him.\n\nSharon is   a dedicated professional and more. We see down\ninto her   to a place of real caring. She stares into our\neyes and   connects. We begin to hear her now -- and there\nare more   SIRENS converging in b.g.\n\n                          SHARON\n            Can you hear me?\n                   (shouting, off)\n            This one's conscious!\n\n                          VOICE (O.S.)\n            Paramedics on the way!\n\nWe are slipping away again. Sharon holds us with her\neyes, and she grips our hand.\n\n                                            (CONTINUED)\n\n                                                          2.\n\nCONTINUED:\n\n                           SHARON\n             Wait. Wait. Listen to me.    Can\n             you feel that?\n\nShe holds on tight.     We see that our hand, held in her\nown, is bloody.\n\n                           SHARON\n             That's my hand. Hold it.    Go on\n             -- as hard as you can.\n\nWe watch our hand gripping hers, and as we hold on, the\nsights and sounds around us grow more clear.\n\n                           SHARON\n             It's over, and I've got you, and\n             you're safe. You're safe now.\n             You got that? Don't let go.\n             Don't let me go.\n\nBut our eyes unlock from Sharon's and DRIFT TO a patch of\nnight sky. Her voice fades awawy. Our POV begins TO\nLIFT, MOVING TOWARD that sky, as the blue-black night\nbegins to turn white. We GO INTO that white light and...\n\n                                                 DISSOLVE TO:\n\n\nEXT. LOS ANGELES CITYSCAPE - DAY\n\nWe PICK OUT a police car from the traffic and FOLLOW.\nThe beat being patrolled is a mixed neighborhood with\nsome very rough edges.\n\n\nINT. POLICE CAR - DAY\n\nOfficer Sharon Pogue is driving the car. It is two years\nsince we saw her at the accident site. Her partner,\nROBBY LEWIS, sips coffee and keeps one eye on the CAD\nmonitor which lists all area police calls. She slows\nbehind a car that is crawling along, an old 60s car,\ndriven by a young man and woman who sit very close on the\nbench seat. The car's ENGINE is MISSING and smoking.\n\n                           SHARON\n             That car is older than they are.\n\n                           ROBBY\n             '67 Chevy Impala.\n\n                           SHARON\n             That's what I said.\n\n                                                 (CONTINUED)\n\n                                                       3.\n\nCONTINUED:\n\n                           ROBBY\n             Needs a servicing.\n\n                             SHARON\n             Don't we all.\n\nRobby nearly spits his coffee, laughing at what Sharon\nhas said and trying not to choke. Sharon smiles, shaking\nher head.\n\n                           SHARON\n             Get it together, officer.\n\nAs Robby smiles, Sharon looks ahead at the young couple\nwho each have an arm around the other. She is stroking\nhis neck. He is making gentle circles in her hair.\nSharon watches this, and for a moment her eyes reveal a\ndepth that may be loneliness, but she quickly pushes her\nthoughts away and hits the HORN, startling Robby and\nstartling the people ahead who now disengage and drive\non.\n\n                            ROBBY\n             Jesus, Pogo! Almost spilled my\n             coffee again! You didn't like his\n             hair, or what?\n\n                        SHARON\n          I love Elvis hair. They were\n          going two damn miles an hour.\n\nBut Robby's eyes have caught something on the monitor.\n\n                        ROBBY\n          Let's roll to this -- fight in\n          progress.\n\nAs Robby secures that coffee cup, Sharon hits the SIREN\nand speeds around the car in front of them.\n\n\nEXT. CITY STREET - DAY\n\nAt the same time, a few blocks away, an OLD, FRAIL MAN is\ncarrying two plastic grocery bags that are too heavy for\nhim.\n\nWalking behind this man is a younger man named CATCH\nLAMBERT, an attractive man with some scarring on his\nface. His eyes, deep down, are haunted by something, but\nthere is energy in his step. He is dressed in a relaxed\nand stylish manner, not expensive. He begins to pick up\nhis pace to catch up to the old man.\n\n                                             (CONTINUED)\n\n                                                     4.\n\nCONTINUED:\n\nPeople glance at Catch, nad he glances back in an open\nand unflinching way, ready for anything, a smile, a nod,\nor -- because these are some of L.A.'s mean streets -- a\nthreatening or taunting look. These he also meets\nopenly, without a trace of fear. The man has been\nthrough some kind of fire, and it has left him different\nfrom us. Outside the usual boundaries.\n\nCatch walks beside the Old Man, glancing at him.\nFinally, the man glances back, wondering and suspicious,\nbut Catch has a slight, disarming smile, open and honest.\n\n                           CATCH\n             Y'know... since we're both walking\n             the same way, I could take one of\n             those bags for you. That way, I\n             do some upper body work while I'm\n             walking along. Helps my back.\n             What d'you say?\n\nThe Old Man trudges on, proud and suspicious, too.\n\n                           CATCH\n             Right now your mind's making\n             pictures of me robbing your\n             groceires, but, y'know, nine times\n             out of ten, people do the right\n             thing.\n\nThe Old Man glances at him, still not convinced, but he\nsoon has to stop and rest. Catch stops, too. The old\nman looks at him, a bit embarrassed.\n\n                           OLD MAN\n             It's the dog food that makes it so\n             heavy.\n\nCatch nods, puts out his hand. The Old Man hesitates,\nthen decides and lifts a bag, and Catch takes it.\n\n                           CATCH\n             I guess it's worth it... for a\n             good dog.\n\nCatch isn't kidding. He has that honesty. The Old Man\nnods and starts trudging again. As they walk on\ntogether, Catch reaches for that second bag. The man\nrelents and lets him take it. They continue on, Catch\ncarrying the bags and every now and then lifting them a\nbit for his upper body work.\n\n                                                          5.\n\nEXT. VIDEO GAME ROOM - DAY\n\nThis is the call Sharon and Robby have sped to. It is a\nchaotic scene of cops breaking up a fight between eight\nboys, 16-20. A big KID, 18 or so, is being pulled off\nanother by Sharon and Robby. The Kid is wild and\nresisting and Sharon shows her toughness and\nprofessionalism and some anger, too, as she slams him\ninto a fence -- and Robby holds him while she cuffs the\nyoung man -- who is very mouthy, playing to his friends.\n\n                        KID\n          Look at this bitch.    Whoo!   Benny,\n          look at this!\n\nSharon and Robby are both very good at their jobs, taking\nthis Kid to their car while other cops contain the rest.\nA crowd watches -- mostly teens.\n\n                        KID\n                 (to Sharon)\n          You come in with me.    Hey, bitch.\n\nSome of his bystanders friends howl at that.\n\n                        KID\n          You're going to arrest me, you\n          come into the back seat with me.\n          Come on!\n\nHe resists a bit, but they're getting him into the car.\n\n                         KID\n          Come on.   We'll have a good time.\n\n\nINT. POLICE CAR - DAY (FEW MINUTES LATER)\n\nSharon's on the radio to dispatch as Robby drives and the\nKid keeps mouthing off.\n\n                        SHARON\n                 (to radio)\n          Three Adam Five -- show us 1019 to\n          the jail with one male prisoner.\n\n                        KID\n          Take off your uniform. Take off\n          my handcuffs, bitch, and come back\n          here. I want one touch.\n\n                        ROBBY\n          Give it a rest!\n\nSharon is stone-faced through this.\n\n                                                (CONTINUED)\n\n                                                           6.\n\nCONTINUED:\n\n                           KID\n             If you're going to put me away,\n             you gotta give me one sweet touch.\n\n\nINT. JAIL BOOKING AREA - DAY\n\nAs Robby and Sharon bring their suspect to the booking\ncounter, each holding one of his cuffed arms. The Kid is\nlooking at Sharon's hand on his arm.\n\n                           KID\n             That ain't the touch.   That ain't\n             the touch I want.\n\nThey get him to the counter.\n\n                           ROBBY\n             As I remove your cuffs, I want you\n             to put your hands here. Spread\n             your legs. More.\n\nAs they remove the cuffs, the Kid makes a sudden move\ntoward Sharon, reaching between her legs -- but she was\nnot only ready for this, but hoping for it -- and the\nstoniness of her face cracks into fierce anger as she\nmoves quickly and grabs the Kid by the hair, bringing his\nface into her upraised knee. He cries out and goes down\non his knees, hurting and bleeding. The jailer rushes\nover to help, but Robby grabs the Kid's wrists.\n\n                            ROBBY\n             That's it.   Back off, John, we got\n             it.\n\nRobby glances at Sharon -- a dark glance.\n\n\nEXT. POLICE JAIL PARKING LOT - DAY (LATER)\n\nas Robby and Sharon walk to their car. They are\ninterrupted by one of their lieutenants, SANDERMAN,\nwalking their way and stopping to stare at Sharon. She\nmeets his look.\n\n                           SANDERMAN\n             You trying to be a bad-ass, Pogue?\n\nShe is straightforward, not rebellious.\n\n                           SHARON\n             I just dealt with the situation.\n             The prisoner...\n\n                                                  (CONTINUED)\n\n                                                          7.\n\nCONTINUED:\n\n                            SANDERMAN\n             And you don't see a pattern here?\n                    (pause)\n             I want you to keep yourself way\n             inside the line instead of walking\n             on it. All right? Are you taking\n             notes?\n\nHe walks away, and Sharon and Robby walk on to their\ncar -- she is dark; he is glancing at her.\n\n                           ROBBY\n             You broke his nose.\n\n                              SHARON\n             He grabbed me.     End of story.\n\n                           ROBBY\n             And you were waiting for him. You\n             were hoping. You were making\n             long-range plans for his ass while\n             he was mouthing off in the car --\n             and you're supposed to be above\n             that shit.\n\n                           SHARON\n             If you think I crossed the line,\n             put it in the report.\n\n                           ROBBY\n             Pogo, stop the shit. What is it?\n             You pissed off at me, too?\n\nThey enter the car, Sharon behind the wheel.\n\n                        SHARON\n          Not you, Rob. You're a rare\n          unthreatened male cop with a good\n          marriage, and you like to eat\n          where I eat -- so everything's\n          code four.\n\nShe STARTS the CAR and starts to back out, and he reaches\nover and turns OFF the IGNITION. She stares hotly at\nhim -- but then, slowly, she softens, takes a deep\nbreath.\n\n                            ROBBY\n          Come over    for dinner tonight.\n          I'll call    Charlene. She'd like to\n          see you.     It's been awhile. We'll\n          talk about    it.\n\n                                                (CONTINUED)\n\n                                                          8.\n\nCONTINUED:\n\nShe STARTS the CAR again, more calm, starts to drive out\nof the lot.\n\n                           SHARON\n             Thanks. But  she'll invite\n             friends, try and fix me up. She's\n             always trying to fix me up so she\n             doesn't have to worry about you\n             and me.\n\n                           ROBBY\n             She doesn't worry about that.\n\n                           SHARON\n             They all worry about that.\n\nThey both smile wryly, driving on.\n\n                           SHARON\n             You don't need to fix me, Robby,\n             or fix me up. I don't want some\n             guy to heart and soul me and then\n             walk away 'cause he can't stand\n             the cop thing -- or worse: he\n             wants cop stories every night\n             'cause it turns him on, and he has\n             no idea who I am inside my head.\n             Anyway, I'm busy tonight.\n\n                           ROBBY\n             Got some action, huh?    Well,\n             that's promising.\n\n                            SHARON\n             Yeah.   Hot and heavy.\n\n                                              IMMEDIATE CUT TO:\n\n\nINT. SHARON'S APARTMENT - NIGHT\n\nShe is on the floor using an exercise rig, sliding into\ncrunches, pushing herself, sweating, alone. We BEGIN\nDRIFTING TO the rain-spattered window as night sounds\nfilter in, HORNS, SOMEONE SHOUTING, a CAR MOVING BY with\nTHUNDEROUS BASS MUSIC that pulses the very air and\nRATTLES the LOOSE GLASS of her window.\n\n\nEXT. NEIGHBORHOOD STREETS - NIGHT\n\nCatch Lambert is walking the wet streets, head down in\nthe rain. Far away we hear that car with a BASS-BLASTING\nRADIO.\n\n                                                 (CONTINUED)\n\n                                                       9.\n\nCONTINUED:\n\nIn the glow of a street lamp, Catch sees a bright-colored\nobject in the gutter. He picks it up out of the gurgling\nrain water. It is a small toy, a discarded superhero.\nHe puts it in his pocket, walks on.\n\nNow the car, the prowling, MUSIC-BLASTING, BASS-\nTHUNDERING CAR turns a corner and begins rollling along\nslowly -- beside Catch. He glances over, walking on.\nThere are four tough-looking MEN in the car, looking for\ntrouble. The MUSIC is DEAFENING. Catch glances again,\nwalks on. Their eyes follow him like gun barrels. He\nstops and walks out on the street, moving toward the car,\nshouting over the music.\n\n                          CATCH\n             Hey! You want to turn that volume\n             down? What's your point?\n\nThe men, incredulous, stop the car and snap OFF the MUSIC\nin order to make sure they're hearing right. They stare\ndeath at Catch.\n\n                           DRIVER (MAN)\n             What did you say?\n\n                           CATCH\n             What's the point of blasting your\n             music through the whole zip code?\n             Don't you realize there are kids\n             trying to sleep in these\n             apartments -- old people, sick\n             people?\n\nThey can hardly believe this.\n\n                           DRIVER\n             You better watch your mouth,\n             asshole.\n\nCatch meets the man's look with his own unflinching,\nhaunted eyes.\n\n                            CATCH\n             Why?   What're you gonna do?   Kill\n             me?\n\nCatch's look is not a macho challenge. It's something\nelse -- beyond that, a man somehow without limits. One\nof the riders in the backseat taps the Driver's shoulder.\n\n                            MAN #2\n             Guy's nuts.   Let's go.\n\nThe Driver, never breaking his death stare, snaps on the\nDEAFENING MUSIC and then slowly rolls on, still glaring\nat Catch. Catch stands in the rain, watching them go.\n\n                                                       10.\n\nINT. CATCH'S APARTMENT CORRIDOR - SAME NIGHT\n\nCatch is arriving home, soaking wet. He lives in a\nslightly-seedy three-story. As he walks down the\ncorridor toward his apaprtment, he passes a neighbor's\ndoor and notices a set of keys dangling from the lock.\nHe pauses -- and then knocks softly on the door.\n\nSomeone looks through the peephole and then opens the\ndoor -- a young single mother, friendly but with a little\ncaution, too. She recognizes Catch. Behind her is a\nlittle boy, (five). The woman's name is CANDACE. Her\nson is TOMMY.\n\n                         CANDACE\n          Hi.\n\n                         CATCH\n          Hi.   Your keys are in the...\n\nHe gestures, and she sees the keys and retrieves them,\nmore friendly now.\n\n                        CANDACE\n          Oh, thank you. Thanks a lot.\n          God. I was trying to carry Tommy\n          and all these bags. He was so\n          tired. Of course, as soon as I\n          put him down he had all this\n          energy...\n\nWhile she is talking, Catch is staring deeply at the boy,\nwho is shy. Catch almost speaks to the boy, wants to,\ngoes halfway to a smile -- but the sight of the kid stirs\nthat layer of darkness in Catch. He nods a good-bye to\nthe mother and is about to go. She thinks about this, as\nhe is turning, and pushes through her remaining caution\nto say...\n\n                        CANDACE\n          Y'know, we were just baking\n          nectarine bars because the peaches\n          weren't ripe. Ever had a\n          nectarine bar?\n\nHe smiles and seems to want to stay, but he is already\nretreating. His contact goes only so far -- and no\nfurther.\n\n                         CATCH\n          Sorry.   Gotta be going.\n\nAnd with one more glance at the boy, he walks to his\napartment, unlocks it and steps in.\n\n                                                      11.\n\nINT. CATCH'S APARTMENT - NIGHT\n\nHe walks into a bare living room -- no chairs, tables,\nlamps, nothing on the walls. He walks into a spotless,\nnever-used kitchen and flips on the light, opens a\ndrawer.\n\nIn the drawer is a collection of kids' toys, some found,\nsome purchased, mostly plastic figures. The action of\nopening the door has started some battery-operated\nanimals moving around in there. Now from his pocket he\ntakes the plastic superhero he just found and drops it in\nand closes the drawer.\n\nHe walks back into the living room. He sits on the\nfloor, leans back against the wall, his clothes still\nsoaked from the rain. He stares at his thoughts, looking\na bit numb -- and lost.\n\n\nEXT./INT. DRY CLEANERS SHOP - DAY\n\nSharon is just leaving with a clean uniform on a hanger\nin a plastic bag. It's a neighborhood place where\nalterations are done. As she is leaving, an older woman\nis just entering. This is MRS. VANDER, beaming at\nSharon, a real talker.\n\n                         MRS. VANDER\n          Sherry!\n\n                        SHARON\n          Hi, Mrs. Vander. You're looking\n          good.\n\n                        MRS. VANDER\n          Oh, you just wait. I splurged.\n\nShe is pulling a new blue dress out of a shopping bag.\n\n                        MRS. VANDER\n          It's for the church and the party.\n          It's just a little too long.\n\n                         SHARON\n          Looks great.\n\n                         MRS. VANDER\n          Y'know, I cried over the\n          invitation -- just imagine me in\n          church.\n                  (laughs)\n          It'll be so good to spend time\n          with you.\n\n                                             (CONTINUED)\n\n                                                           12.\n\nCONTINUED:\n\nSharon forces a smile -- but is mystified. Mrs. Vander\nis walking to the counter and pausing to say...\n\n                           MRS.   VANDER\n             You know Dan and I   renewed our\n             vows last year. I    bet that's\n             where your mom got   the idea.\n\n                           SHARON\n             Their vows?\n\n                           MRS. VANDER\n             Your mom and dad -- the\n             ceremony...\n\nMrs. Vander realizes what's going on and stammers on,\nsympathetic and embarrassed.\n\n                           MRS. VANDER\n             Oh, well... y'know, I just got\n             that invitation a few... just now,\n             so I'm sure you'll...\n\n                           SHARON\n             Oh, yeah. We've had... there's\n             been some problems with the mail\n             in our building, so... I'll\n             probably get it today.\n\nThey're both covering like mad, both realizing Sharon's\nbeen left out.\n\n                           SHARON\n             So, I guess I'll see you.\n\n                           MRS. VANDER\n          Sure, honey.     I'll see you there.\n\nSharon leaves -- Mrs. Vander staring after her, feeling\nbad. As Sharon walks away, we see her forced smile die,\nreplaced by an old pain and darkness.\n\n\nEXT. RESIDENTIAL STREET - DAY\n\nRobby and Sharon's unit pulls up at a house remodel with\na sign marked \"POGUE CONSTRUCTION.\" Sharon exits the car\nand walks onto the site, moves toward a man who is both\ncarpenter and supervisor on the job. This is her\nbrother, LARRY POGUE, 29. They are not comfortable with\neach other -- an old wound. He gives her a wary nod.\nShe's trying a little harder, being a bit more friendly.\nWe can sense the strain.\n\n                                                 (CONTINUED)\n\n                                                          13.\n\nCONTINUED:\n\n                           SHARON\n             I didn't see his truck, so...\n\n                              LARRY\n             He's not here.\n\n                              SHARON\n             How you doing?\n\nShe touches his shoulder as she says this, a friendly\ngesture, a reaching out. He doesn't respond, only\nshrugs.\n\n                              LARRY\n             I'm okay.\n\n                           SHARON\n             Kathy and the boy? Bet he's big\n             now.\n\n                              LARRY\n             Growin' fast.\n\n                           SHARON\n             Is he looking more like you now --\n             or did he get lucky?\n\nShe has broken through a bit and they both smile a brief,\nwry smile.\n\n                            LARRY\n             He's got Kathy's looks and brains\n             and my strong back. You should\n             feel his grip.\n                    (pause)\n             You just passing by?\n\nShe looks about.\n\n                           SHARON\n             Place is coming along nice. The\n             octagon window. Dad's signature.\n\nBut Larry's look stays on her, wondering what's on her\nmind.\n\n                           SHARON\n             Look, Larry, I shouldn't have to\n             hear it from Mrs. Vander -- about\n             what's happening.\n\nHe turns back to his work now as they speak,\nuncomfortable.\n\n                                                 (CONTINUED)\n\n                                                           14.\n\nCONTINUED:\n\n                           LARRY\n             What's happening?\n\n                           SHARON\n                    (hurt)\n             So you really weren't going to\n             tell me? Nobody was going to tell\n             me? Mom and Dad renewing their\n             vows, the church, the party. Mrs.\n             Vander is all excited. She bought\n             a new dress. It's blue.\n\n                           LARRY\n             We're workin' on Dad. We think\n             you should be there. We told him.\n\n                             SHARON\n             Mom told him?\n\n                           LARRY\n             We mentioned it.\n\n                           SHARON\n             He's holding out, hah?\n\n                           LARRY\n             You want to come?\n\n                           SHARON\n             It's my family. Jesus, Lar. It's\n             over ten years, and he won't let\n             go of it.\n\n                           LARRY\n             You two were always head to head.\n\n                        SHARON\n          For good reason. Remember?\n\n                        LARRY\n          Let's just leave it.\n\nShe stares, then...\n\n                        SHARON\n          You're still scared of him.\n\nPissed, he throws his hammer down on the plywood, turns\nto her.\n\n                                                 (CONTINUED)\n\n                                                           15.\n\nCONTINUED:\n\n                           LARRY\n             I don't think it's a good idea you\n             coming around here in uniform.\n             People see it, they think we're in\n             trouble here.\n\n                           SHARON\n             Nice seeing you, too.\n\nShe walks away.     He frowns, picks up his hammer, goes\nback to work.\n\n\nON STREET\n\nAs Sharon walks towards the car, she sees a van\napproaching and she holds up a hand to Robby and calls\nout...\n\n                           SHARON\n             Two more minutes.\n\nAnd she walks toward the oncoming van, which is parking\nnow.\n\n\nEXT. VAN - DAY\n\nThe van is driven by KATHY, Sharon's brother's wife.\nBeside her in a car seat is LARRY, JR., four years old.\nSharon comes to the rolled down window on the driver's\nside. She has a warm smile for Kathy and the child.\nKathy smiles, too.\n\n                         KATHY\n            Hi! Look -- it's your Auntie\n            Sharon.\n\n                          SHARON\n            Hey, Champ, my God, look how big.\n\nShe has a special affection for the boy -- who is\nsubdued, but he smiles a small one for his aunt. She\ntakes one of his hands and they shake in mock formality.\n\n                          LARRY JR.\n            Hi.\n\n                         SHARON\n            Ow! You hurt my hand with that\n            grip. Whew.\n\n                                                (CONTINUED)\n\n                                                         16.\n\nCONTINUED:\n\nShe shakes her fingers, and he smiles a bit more. Sharon\nreaches in and rubs his head in a mock knuckling move.\nHe laughs. She smooths his hair, affectionately.\n\n                           KATHY\n             We're bringing Larry his lunch.\n             Hey, it's good to see you. It's\n             been awhile. What?\n\nSharon is staring at Kathy's badly bruised ear.\n\n                           KATHY\n             Oh, I went boom into a low shelf\n             -- chasing after him of course.\n                    (nodding to the child)\n             How're you doing?\n\nSharon pulls her eyes off the bruise to meet Kathy's look\n-- and connect.\n\n                           SHARON\n             I'm semi-okay. I heard about\n             the... ceremony and the party.\n\n                             KATHY\n                     (embarrassed)\n             Oh. I hope you'll be there.\n                     (pause)\n             Really.\n\nSharon smiles a bit, appreciating the support.       She pats\nKathy's arm.\n\n                             SHARON\n             Take it easy.    You too, Champ.\n\nThe boy offers his little hand to shake again.\n\n                            SHARON\n             Oh, no. You're not breaking my\n             fingers again.\n\nThey smile and drive on and Sharon walks toward her car\nand Robby.\n\n\nEXT. CITY PARK - DAY (NEXT DAY)\n\nWe WATCH moms and kids and a basketball game in the park\nand PICK UP Catch walking by. Two pre-teens are playing\nbounce and catch with a rubber ball against a (tennis\npractice) wall, and one of them misses, and Catch makes a\nlunge and snags the ball. Instead of throwing it to one\nof the boys, he fires it at the wall.\n\n                                                (CONTINUED)\n\n                                                       17.\n\nCONTINUED:\n\nOne of the boys catches it, bounces it off the wall\ntoward Catch. Catch grabs it, and now he's part of this\nrapid-fire game -- and he's athletic and funny, too,\nplaying hard and mugging and making them smile until... a\nPOLICE CAR comes ROARING down the boulevard, slowing a\nbit to CHIRP its SIREN a few times -- clearing traffic.\nCatch glances up and sees...\n\n\nCATCH'S POV\n\nSharon is in the car beside Robby.\n\n\nON CATCH\n\nStunned by the sight of her -- and he doesn't know why.\nHe can't move, can't breathe, eyes fixed on her. The\nPOLICE CAR pulls around a truck and ROARS on -- and\nthat's when he is struck by a memory, a little like\nlightning. It comes as a quick --\n\n\nFLASHBACK - EXT. FREEWAY - ACCIDENT SITE    - CATCH'S POV\n\n-- The man near death. Sharon is bending close to him,\nthis all just a sliver of an image, and it jolts him.\n\n\nBACK TO SCENE (PRESENT)\n\nThe police car is now converging with other squads just\nhalf a block away. Catch throws the ball back to the\nboys and runs toward the police incident. The boys watch\nhim go, wondering.\n\n\nEXT. CLOSED STORE - DAY\n\nA police   car is parked askew near this closed store -- as\nnow Robby   and Sharon's UNIT ROARS to a STOP beside it.\nTwo cops   are calling and motioning to them, one holds a\nshotgun.    This is RAY JULIETTE.\n\n                           RAY\n             Break-in alarm. One suspect in --\n             nobody out. Take the back.\n\nAnd they are moving.\n\n\nEXT. BACK OF CLOSED STORE - DAY\n\nRobby and Sharon are hurrying around to the back as we\nhear more POLICE UNITS CONVERGING in front.\n\n                                                      18.\n\nANGLE - STREET\n\nAs Catch arrives on the scene and sees Sharon and Robby\nmoving around the building to the back. He is still\namazed at the sight of her. He decides to follow her,\nkeeping her in sight, driven.\n\n\nON SHARON, ROBBY\n\nThey are scouting through crates and weeds as a young man\nis flushed from cover at the back of the store and runs\nfrom them.\n\n                         ROBBY\n          Freeze!\n\nThe man runs on, and Sharon chases with Robby close\nbehind her. Sharon speaks to her shoulder radio mike as\nshe runs.\n\n                        SHARON\n                 (to radio)\n          Three-A-5, foot pursuit. Suspect\n          fleeing south on Pico Place, young\n          man, green jacket. No visible\n          weapon...\n                 (to Robby)\n          Robby!\n\n                        ROBBY\n          Right behind you!\n                 (to man)\n          Stop and lie down with your\n          arms... shit.\n\nThe man has jumped a fence.   Sharon follows.\n\n                         ROBBY\n          Careful!\n\n                         SHARON\n          I see him!\n\nShe goes over the fence, then Robby.\n\n\nEXT. PARKING LOT - DAY\n\nThe man runs and Sharon chases. Robby, not far behind\nglances off to the side, seeing Catch, still following.\n\n                        ROBBY\n          Citizen on your right!   Hey!\n\n                                            (CONTINUED)\n\n                                                     19.\n\nCONTINUED:\n\nBut Sharon is now closing on the fleeing man who turns\nsuddenly, pointing a handgun!\n\n                              ROBBY\n             Gun!\n\nAnd Sharon, wide-eyed, is already pulling her weapon, but\nnot in time. The man is aiming at her and about to fire\nwhen he is tackled by Catch.\n\nCatch and the man go sprawling, and the gun flies out of\nthe man's hand, and Sharon is on him in an instant,\npointing her gun at him...\n\n                             SHARON\n             Freeze!    Right there!\n\nCatch scrambles to his feet. Robby joins Sharon and puts\nhis knee in the man's back and cuffs him, then glances at\nCatch. So does Sharon. But Catch starts to hurry off.\n\n                              ROBBY\n             Hey!     Wait!\n\nTwo other cops (Ray Juliette and SANCHEZ) rush toward the\nsuspect on the ground.\n\n                              RAY\n             You got him?\n\n                              ROBBY\n             He was armed.\n\n                              RAY\n             Jesus.\n\n                           ROBBY\n             Citizen took him down.\n\n                              RAY\n             No shit!?\n\nSharon stares across the lot to where Catch has halted.\nMore cops are converging. Ray Juliette and Sanchez move\ntoward Catch, while a sergeant and others surround Sharon\nand the suspect. In between the crowd of cops, Catch and\nSharon glance at each other, during...\n\n\nON CATCH\n\nas the cops reach him.\n\n                                           (CONTINUED)\n\n                                                       20.\n\nCONTINUED:\n\n                           RAY\n             What happened here?\n\n                           CATCH\n             I... just saw it and... I saw the\n             gun, so...\n\n\nON SHARON\n\n                           ROBBY\n             You all right, Pogo?\n\nShe is shaken, speaks softly.\n\n                            SHARON\n             I was dead.   Y'know.\n\nShe glances toward Catch. (She doesn't recognize him\nfrom the accident.) Their eyes meet briefly, but then\ntheir attention is pulled to the others. Sharon speaks\nto her sergeant.\n\n                             SHARON\n             He had me.    I was dead.\n\n\nON CATCH\n\nHe is shaken, too.    Sanchez is taking notes as Ray checks\nhis I.D.\n\n                           CATCH\n             I was just walking by.      I live\n             near here.\n\nRay nods, handing the I.D. to Sanchez.\n\n                           SANCHEZ\n             Sergeant's going to want to talk\n             to you, Mr. Lambert. We'll need a\n             statement.\n\n                           RAY\n             Don't worry about it. That's just\n             procedure. Look -- we appreciate\n             what you did. No bullshit. Let\n             us buy you a drink tonight, all\n             right? You know where the Rib\n             House is?\n\nCatch glances at Sharon again, and he nods.\n\n                                                       21.\n\nEXT. UPSCALE RESIDENTIAL NEIGHBORHOOD - DAY (SAME DAY)\n\nCatch, a bit bruised and dirty from his tackle, is\ncarrying groceries up the walkway steps to a small, well-\nkept home. He is taking out a key as he walks to the\ncovered portico.\n\n\nINT. MRS. CHU'S HOME - DAY\n\nELANORA CHU, 60, is an attractive woman with warmth and\nintelligence in her eyes. She is in a wheelchair, at a\nwriting table where she carefully translates an English\ntext into Chinese characters.\n\nShe glances up as Catch opens the front door and heads\nfor the kitchen, speaking as he goes, not looking at her\nor into the living room at all.\n\n                        CATCH\n          I got you nectarines because the\n          peaches are hard as rocks.\n\n                        ELANORA\n          Your jacket's all dirty.\n\nShe rolls away from the table in her motorized chair --\nand as they speak across the house, she performs a\nritual...\n\n                        CATCH (O.S.)\n          I tackled a guy.\n\nElanora is moving about the living room, picking up\nframed photographs and turning them face down. We don't\nsee what -- or who -- is in these photos. She is turning\nthem all in a routine way, used to this.\n\n                        ELANORA\n          Why would you 'tackle' a guy?!\n\n                        CATCH (O.S.)\n          Why do you think?\n\n\nINT. KITCHEN - DAY\n\nCatch is at the cupboards, putting away groceries as\nElanora rolls into the kitchen, her CHAIR HUMMING.\n\n                        CATCH\n          He had the ball. He was going for\n          a touchdown.\n\n                        ELANORA\n          Can you be serious?\n\n                                             (CONTINUED)\n\n                                                        22.\n\nCONTINUED:\n\n                           CATCH\n                    (as he works)\n             What day is today?\n\n                            ELANORA\n             Wednesday.\n\n                            CATCH\n             No.\n\nThey are not smiling at their little jokes, but they have\nan ease with each other and the deep love of dear\nfriends. He doesn't pause in his work, but we can see\nsome nervousness in him as he says...\n\n                           CATCH\n             Met somebody today.\n\nMrs. Chu is now taking some of the groceries out of the\nbags to help.\n\n                           ELANORA\n             Oh? That's good. Ahh -- they had\n             the broccolini today. Thank you.\n\n                            CATCH\n             A woman.\n\nElanora is more interested and curious now, still helping\nwith the groceries and being casual.\n\n                           ELANORA\n             You didn't tackle her, too, did\n             you?\n\n                            CATCH\n             No.\n\n                            ELANORA\n             Good, Catch.\n\n                           CATCH\n             She's a police officer.\n\n                           ELANORA\n                    (stops; worried)\n             Are you in trouble?\n\nCatch goes on working, a depth in his eyes.\n\n                            CATCH\n             No.   No trouble.\n\n                                               (CONTINUED)\n\n                                                          23.\n\nCONTINUED:\n\nElanora watches him work and gladdens slightly.     We see\nher own depth of feeling.\n\n                           ELANORA\n             Well... that's a good thing.\n\nHe is still working, but his eyes are on his thoughts,\nhis struggle.\n\n                           CATCH\n             I saw her once a long time ago.\n\nElanora stares a moment.      This has meaning for her.\n\n                            ELANORA\n             Where?\n\nHe doesn't answer.      He's nervous about this.\n\n                           CATCH\n             She looks the same.\n\nNow she watches him as he moves to the refrigerator and\ncontinues his work in silence.\n\n\nINT. RIB HOUSE - THAT NIGHT\n\nIt's a noisy restaurant with a large bar area. We PAN TO\na booth of off-duty cops, out of uniform now, including\nRay, Sanchez, Sharon and a few more male officers.\nThey're all a bit high. Sharon shows the signs, too.\nThey are passing around a photo now as one COP looks at\nit and says...\n\n                            COP\n             Beautiful.\n\n... And Sanchez says proudly.\n\n                            SANCHEZ\n             Yeah. My wife's got him in\n             agility class.\n\n                            RAY\n             No shit.\n\nRay is handed the photo, and we see that they're talking\nabout Sanchez's dog, the name \"REX\" printed on the photo.\n\n                                               (CONTINUED)\n\n                                                         24.\n\nCONTINUED:\n\n                           RAY\n             'Rex.' Rex is good. I wonder who\n             the first person was to name a dog\n             'Fido,' and what the hell does it\n             mean?\n\n                           SHARON\n             I like how you're always asking\n             the big questions, Ray.\n\nThere is some laughter.     Ray is a smart-ass and a flirt.\n\n                           RAY\n             I got a big question for you, Pogo\n             -- but I can only ask it when\n             we're alone.\n\nShe moves some of the change on the table, sliding it\ntoward Ray.\n\n                           SHARON\n             Here -- use this -- call your wife\n             and ask her instead.\n\n                           SANCHEZ\n             I happen to know Ray's wife is\n             busy tonight.\n\nThey laugh and drink and Ray asks her...\n\n                           RAY\n             Why doesn't your partner ever come\n             out with us?\n\n                           SHARON\n             Robby's a family man.\n\n                           RAY\n             I'm a family man.\n\n                        SHARON\n          Yeah, but his family actually\n          likes him.\n\nMore laughter. Sharon's eyes do a quick roam of the bar.\nRay catches this.\n\n                        RAY\n          That Lambert -- I guess he's not\n          showing either.\n\nShe shrugs this off like it's not important and starts to\nslide out of the booth.\n\n                                               (CONTINUED)\n\n                                                          25.\n\nCONTINUED:\n\n                           RAY\n             Where are you going?\n\n                            SHARON\n             The head.   Do you mind?\n\n                           SANCHEZ\n             She's just gonna freshen up her\n             makeup.\n\n                           RAY\n             You're wearing makeup?\n\nShe leaves the booth with a wry frown.\n\n                           SHARON\n             That reminds me, Ray. You still\n             have that eye-liner you borrowed\n             from me?\n\nShe grins, leaving the laughter behind her.\n\n\nANGLE - DOOR\n\nCatch has entered the bar. He is watching Sharon leave\nthe booth and walk to the rest rooms. He looks back at\nthe raucous booth and hesitates. He sits at a small\ntable near the door.\n\n\nINT. BATHROOM - NIGHT\n\nSharon is drying her hands in the bar's bathroom, staring\ninto the mirror. No smile now. We see into her mind for\na second.\n\n\nFLASHBACK - MAN\n\nPointing the gun at her face today.\n\n\nBACK TO SHARON (PRESENT)\n\nin the mirror and see how shaken she still is.\n\n\nON CATCH\n\nA waitress is leaving his table, and he looks back at\nSharon's booth and sees that she still isn't there. He\nstarts to turn, and then freezes as he hears...\n\n                                                (CONTINUED)\n\n                                                         26.\n\nCONTINUED:\n\n                              SHARON (O.S.)\n             There you are.\n\nShe has stepped out of the bathroom and spotted him.      He\nis surprised, face to face now.\n\n                           SHARON\n             We thought you wouldn't show.    Why\n             you sitting here?\n\nHe shrugs.\n\n                           CATCH\n             I don't talk to a lot of people.\n             Would you...?\n\nHe half rises and gestures to the other chair. She\nglances back at her booth, then sits. She's nervous,\ntoo.\n\n                           SHARON\n             I didn't have a chance to thank\n             you. I'm Sharon Pogue.\n\nShe puts out her hand. He stares at that hand for just\nhalf a beat before taking it. They shake. The feel of\nher hand holding his evokes the memory of the accident,\nbut he covers this.\n\n                           SHARON\n             You look familiar.\n\n                           CATCH\n             I guess I live on the beat you\n             patrol.\n\nHer way to cover nervousness is to be blunt, even tough.\n\n                           SHARON\n             Why would you do that -- jump a\n             man with a gun?\n\n                           CATCH\n                    (shrugs)\n             He was going to shoot you.\n\n                           SHARON\n             He could've shot you. You have a\n             death wish? You a bungee jumper?\n\n                          CATCH\n             No. I didn't have time to think\n             about it.\n\n                                                (CONTINUED)\n\n                                                          27.\n\nCONTINUED:\n\n                           SHARON\n             What d'you think about it now?\n\n                           CATCH\n             I figure... it was worth the risk.\n\n                           SHARON\n             For someone you don't even know?\n\n                           CATCH\n             Yeah -- and for what you do. I\n             think cops are great. Out there,\n             trying to keep it safe. You know?\n             Tough job. Firemen are\n             everybody's heroes. Kids wave at\n             firemen. People should wave at\n             cops. Did you ever think about\n             how many people are walking around\n             this town because you saved them?\n\n                           SHARON\n             I never thought about it.\n\n                           CATCH\n             ... because you helped them or\n             because you arrested somebody who\n             would've hurt them or because you\n             just... did your job?\n\n                           SHARON\n             Now I'm walking around this town\n             because of you. Ever think about\n             that? Maybe you should be a cop.\n\n                        CATCH\n          I don't know... I look pretty dumb\n          in a hat...\n\nHe has made her smile.\n\n                        CATCH\n          ... and I don't drive and, like I\n          said, I don't talk to many people.\n          Am I talking too much? I am. You\n          go ahead.\n\n                         SHARON\n          Okay. What d'you do? You\n          employed around here? Oh, God.\n          Sorry. Every time I try to talk\n          to somebody, it comes out like an\n          interrogation.\n\n                                                (CONTINUED)\n\n                                                          28.\n\nCONTINUED:\n\n                           CATCH\n             Where do you want to be ten years\n             from now?\n\n                             SHARON\n             What?\n\n                           CATCH\n             Somebody taught that to me. Kind\n             of a shortcut. You ask somebody,\n             what are your plans for\n             tomorrow -- what're your dreams\n             for ten years from now. It's\n             supposed to get things started.\n\n                             SHARON\n             Does it work?\n\n                           CATCH\n             I never tried it.\n\n                             SHARON\n             Bullshit.\n\n                           CATCH\n             No. Really. I just remembered it\n             -- God is my witness.\n\n                             SHARON\n             Not in here.    It's mostly cops.\n\nNow she has made him smile, the first real smile we've\nseen from Catch. It's open and real and she is charmed\nby it.\n\n                           SHARON\n             You have a nice smile.\n\nShe's a bit self-conscious, saying that, and just as she\nsays it, the waitress arrives with shots and beers for\nboth of them. Sharon looks up, questioning, and the\nwaitress nods toward the booth. Catch and Sharon see the\ncops, staring, smiling, raising their glasses. There is\na hint of teasing in their grins. And now Sharon is more\nself-conscious, and a bit tough again, taking her drink\nand turning back to Catch.\n\n                           SHARON\n             So... what were we talking about?\n             Oh, yeah, you were giving me some\n             line about starting a\n             conversation.\n\n                                                 (CONTINUED)\n\n                                                           29.\n\nCONTINUED:\n\n                             CATCH\n             The shortcut.\n\n                             SHARON\n             Okay.    I'll play.\n\nThey clink glasses and drink.         Then...\n\n                           SHARON\n             Tomorrow I've got a night watch\n             shift. If the weather clears, in\n             the morning I'll go hiking. If it\n             rains, I'll go to the gym -- and\n             the laundromat. Ten years from\n             now... I want to be living in some\n             mountainous place.\n\n                              CATCH\n             Tibet?\n\n                           SHARON\n             Could be Tibet. Could be\n             Colorado. Your turn.\n\nBut now Ray Juliette is approaching the table.\n\n                           RAY\n             Hey, Pogo -- don't keep him all to\n             yourself. Come on over, Lambert,\n             join the group. We'll buy you\n             dinner, give you a medal for\n             saving Pogo's ass.\n\nSharon drains her shot and stands.\n\n                           SHARON\n             Actually, I'm kind of tired, Ray.\n             I'm taking off.\n\n                              CATCH\n             Oh.     I'll... walk you to your car.\n\nCatch stands and turns to Ray.\n\n                           CATCH\n             Thanks for the drink.\n\n                           RAY\n             Least we could do. We don't like\n             her very much -- but we don't want\n             to lose her.\n\nSharon frowns and waves to the booth of cops.        Ray smiles\nand shakes hands with Catch as a good-bye.\n\n                                                 (CONTINUED)\n\n                                                          30.\n\nCONTINUED:\n\n                           CATCH\n             Take care.\n\nAnd Catch and Sharon leave.\n\n\nEXT. BAR - NIGHT\n\nAs Catch and Sharon exit the building, walk toward her\ncar.\n\n                           SHARON\n             It's not a great neighborhood.\n             Maybe I should walk you to your\n             car.\n\n                           CATCH\n             I don't have a car.\n\nThey walk on, silent a moment.      This doesn't come easy\nfor her.\n\n                           SHARON\n             Want a ride home?\n\n                           CATCH\n             Oh, thanks, but... I like to walk.\n\n                           SHARON\n             It's starting to rain.   Don't be a\n             hero.\n\nHe hesitates, nervous about it, but then...\n\n                          CATCH\n             Yeah. If it's no trouble.\n             Thanks.\n\nThey walk to her car.\n\n                           SHARON\n             Okay... ten years from now, what\n             d'you want to be doing?\n\nThey walk side by side a moment.      He shrugs.   Then -- in\nhis open way...\n\n                          CATCH\n          I don't know.    This is pretty\n          good.\n\nShe glances at him, taking this in, then fumbles a bit\nwith her car keys, and he asks -- nervously again...\n\n                                                (CONTINUED)\n\n                                                        31.\n\nCONTINUED:\n\n                           CATCH\n             Can you drive okay?\n\nShe gets a little defensive.\n\n                        SHARON\n          I'm not drunk. You think I'm\n          drunk? I'm not. You'll know I'm\n          drunk when I'm throwing up, and I\n          never throw up, so don't worry\n          about it.\n\nHe nods, looks at her dead-on a moment.\n\n                        CATCH\n          The only time I worry is when\n          people tell me not to worry.\n\n                        SHARON\n          Get in the car, will you?\n\n\nINT. CAR - NIGHT\n\nAs they get in and she STARTS the ENGINE.\n\n                        CATCH\n          I'm on Lundy Street, just off\n          Pico.\n\nThey drive a while. She notices his anxiety.     He grips\nthe armrest when she speeds up.\n\n                        SHARON\n          I'm good at this.\n\n                        CATCH\n          Streets are wet.\n\n                        SHARON\n          Are you one of those people who\n          drive ten miles an hour in the\n          rain? I hate that.\n\n                           CATCH\n          I never drive.\n\nShe glances at him, and he notices her glance.\n\n                        CATCH\n          I'll be alright.\n\n                                              (CONTINUED)\n\n                                                           32.\n\nCONTINUED:\n\nHe's forcing himself to relax. He takes a deep breath,\nsitting back in his seat. He watches her as she drives.\nAfter a moment...\n\n                           CATCH\n             Y'know, I can picture you in\n             Colorado.\n\n                            SHARON\n             Oh yeah?   What am I doing there?\n\n                           CATCH\n             Driving around... pissed off.\n\nShe smiles in spite of herself, slows down.\n\n                           SHARON\n             I'm not pissed off at you.\n\n                           CATCH\n             Give me some time.\n\nNow she laughs. She drives, not to his building, but to\nher own street. She parks, takes a deep breath. This\nsounds a bit hard-bitten because she's using her\ntoughness to cover.\n\n                            SHARON\n             Those guys  in the bar are my\n             friends --  sort of. We work\n             together,  we tell jokes and we\n             bullshit,  but I can't say to\n             them...\n\nShe halts.\n\n                            CATCH\n             What?\n\nShe says this clipped and fast and even tougher:\n\n                       SHARON\n         Every time I close my eyes, I see\n         that goddamn gun pointing at me\n         and I don't know why I'm telling\n         you unless it's because you were\n         there and because I had three\n         drinks, but I'm not ready to go\n         inside and close my eyes and I\n         don't want to go to your place and\n         I don't want to keep driving\n         around, so what the hell do we do?\n\n                                                 (CONTINUED)\n\n                                                          33.\n\nCONTINUED:\n\n                           CATCH\n             Whew. I feel like we're boxing,\n             and you've got me on the ropes.\n                    (pause)\n             We'll do whatever you want.\n\n                            SHARON\n             What I want  is to know how you\n             happened to  be walking by that\n             parking lot  at that minute. What\n             if you hadn' t been there?\n\nFor a moment, she shows her fear.\n\n                           CATCH\n             I guess we were supposed to meet.\n\nThey stare a while, then she opens her door.\n\n                           SHARON\n             If you want -- you can come in for\n             a minute.\n\n\nINT. SHARON'S APARTMENT - NIGHT\n\nAs they walk in, she moves into the kitchen.\n\n                             SHARON\n             Want a drink?\n\n                             CATCH\n             No thanks.\n\nShe pours one for herself while he looks about. It's a\nstiff drink. Now that he's here, her I-don't-want-to-\nmake-a-fool-of-myself alarm is on. She flops on the\nsofa, watches him.\n\n                           SHARON\n             Sit down or something.\n\n                           CATCH\n             I'm circling awhile.\n\nHe's looking around at the clutter of her life -- the\nintimate details.\n\n                            SHARON\n             You're not supposed to look\n             around. I didn't have time to\n             straighten up.\n\n                                                 (CONTINUED)\n\n                                                           34.\n\nCONTINUED:\n\n                           CATCH\n             So... it's more real this way.\n\n                           SHARON\n             It's rude.\n\nHe turns to her.\n\n                           CATCH\n             Now that I'm in here, you seem mad\n             about it.\n\n                           SHARON\n             I'm not mad. You'll know when I'm\n             mad. I don't usually let somebody\n             in here, but here you are. That's\n             all. Let's talk about something\n             stupid.\n\n                           CATCH\n             You first.\n\nShe smiles in spite of herself.\n\n                           SHARON\n             Okay -- one thing I don't believe\n             is that 'supposed to' business.\n             We were 'supposed to' meet. That\n             sounds a little fringy to me, like\n             something you might hear on public\n             access TV. You believe that?\n\n                           CATCH\n             Some people say we each give off a\n             particular odor -- that can only\n             be detected by one other person's\n             brain.\n\n                           SHARON\n             So, we... smell each other?   Who\n             says that?\n\n                           CATCH\n             I have no idea.\n                    (as they smile)\n             I'm more in the destiny school,\n             we-met-in-another-life school. Do\n             you believe that? Do you think\n             when we die -- we come back in\n             another form?\n\n                                                 (CONTINUED)\n\n                                                          35.\n\nCONTINUED:\n\n                             SHARON\n             You mean like   a duck? No. I\n             think dead is   dead. I've been\n             thinking about   it all day -- and I\n             don't want to   think about it\n             anymore.\n\nHe looks at her, steps close to her, takes the drink out\nof her hand, puts it to his lips and drinks it all down.\nHe puts the glass on the table.\n\n                           SHARON\n             Why'd you do that?\n\n                            CATCH\n             See?   Now you're thinking about\n             me.\n\nShe gets a half smile, assessing him. Her look is\ndirect, and the attraction is there. He feels it, too,\nand he deflects it, nodding toward a large photomural of\nsnowcapped mountains.\n\n                             CATCH\n          Let me guess.       Colorado.\n\n                        SHARON\n          It's Austria, but I can't picture\n          myself in Austria. I'm not good\n          with languages, so I couldn't\n          qualify for the departments over\n          there.\n\nShe rises and goes to a desk and takes the holstered gun\noff her ankle. She takes the cuffs off her belt, the\nmace from her jacket, the shield from her shirt pocket,\nputs them all in a desk drawer. She takes off her jacket\nand throws it over a chair. Disarmed, she turns to him.\nHer look is all wanting and pushing away, almost fierce\nin her struggle. He sees this.\n\n                           SHARON\n             Thanks for... coming up here.\n\n                           CATCH\n             Does that mean I'm going?\n\n                             SHARON\n                      (flustered)\n             No.    You don't have to.    I...\n\n                              CATCH\n             You okay now?\n\n                                                 (CONTINUED)\n\n                                                     36.\n\nCONTINUED:\n\nHer eyes grow a bit hard, defensive.\n\n                             SHARON\n             Oh.    You're here as a medic.\n\n                           CATCH\n             Is this the mad part?\n\nShe smiles in spite of herself -- again. He has gotten\nto her. She wants to fall into this guy, but she's\npumping those brakes. They are standing close together.\n\n                           SHARON\n             Maybe going is a good idea.\n\n                           CATCH\n             Can I come back some time?\n\n                             SHARON\n             Why?\n\n                           CATCH\n                    (shrugs)\n             Must be the smell.\n\nThat makes her laugh, and her resistance falls away with\nher surprised laughter, and she puts her hands around the\nback of his neck. Her touch is electric to him. She is\ngoing in for a kiss, and he is retreating. They stare a\nmoment -- and then he suddenly takes her shoulders and\nlets loose his own longing. It is a hungry and\npassionate kiss, and in the very midst of it, he breaks\noff and pulls back, his darkness rushing at him. She is\nstaring, surprised, and he is looking a bit shaken,\ngetting the words out just above a whisper.\n\n                             CATCH\n             I better go.\n\nShe doesn't know what to say. The moment hangs. He\nleaves. Once he closes the door, the breath escapes her,\nand she shakes her head -- feeling like an idiot. She\nlost control. With a stranger.\n\n                             SHARON\n             Oh, God.\n\n\nEXT. STREET - NIGHT\n\nCatch leaving Sharon's building in a turmoil of emotions,\nstaring hard at his thoughts -- and he steps into the\npath of a car. The CAR SCREECHES to a stop, and the\nscream of those brakes and white light of the head lamps\nparalyze Catch, and he sees --\n\n                                                         37.\n\nFLASHBACK - SLIVER OF IMAGE\n\nHeadlights suddenly washing into a vehicle he is driving.\n\n\nBACK TO SCENE    (PRESENT)\n\nThis sliver of memory jolts HIM -- and then another one\ncomes.\n\n\nFLASHBACK - HEADLIGHTS\n\ncoming closer and the scream of brakes from his memory,\nand all of this is exploded --\n\n\nBACK TO SCENE    (PRESENT)\n\nby the angry DRIVER shouting at him.\n\n\n                        DRIVER\n          What the hell do you think you're\n          doing?!\n\nCatch is numb -- completely shut down there in the middle\nof the street. The Driver exits his car and comes toward\nhim, raging.\n\n                        DRIVER\n          Are you crazy?!\n\nCatch isn't even aware of him. The man gawks at this --\nand now Catch walks off. It is raining. The streets are\nwet.\n\n\nANGLE - RESIDENTIAL STREET - NIGHT\n\nAs Catch continues his walk, he is still a bit shaken --\nbut when he passes a parked car with the window half\nopen, rain getting in, he hesitates. He can't just walk\non. He looks about. He tests the lock. He opens the\ndoor, rolls up the window, closes the door, walks on.\n\nBut a MAN is just exiting a doorway to the street -- and\ncalls out...\n\n                           MAN\n          Hey!    Hey!   What did you do?\n\nCatch stops and turns in the rain.     The Man hurries\ntoward him, upset, angry.\n\n                                              (CONTINUED)\n\n                                                               38.\n\nCONTINUED:\n\n                              MAN\n             That's my car!     What the hell were\n             you doing?\n\n                             CATCH\n             Nothing.    I just...\n\nThe Man shoves him.\n\n                             MAN\n             I saw you!    What did you take out\n             of there?!\n\n                            CATCH\n             No, I rolled up the window.       It's\n             rain...\n\nThe Man gets in his face, shaky...\n\n                           MAN\n             You take my phone?!       Hah?!\n\nHe shoves Catch again, and Catch's desperate confusion\nexplodes in a surprising reaction, grabbing the Man's\njacket front in one hand and not punching him but quickly\nslap, slap, slapping him, saying...\n\n                              CATCH\n             Hey!   Hey!    Wake up!    Wake up!\n\nThe Man is now speechless, frozen, terrified, as Catch's\neyes hold him with a fierceness -- and a sadness.\n\n                              CATCH\n             I helped you.\n                    (pause)\n             I helped you.\n\nCatch lets him go, and immediately begins walking away,\nhunching into the rain, his expression dark and troubled.\nHe gets five steps away and turns. The Man steps back --\nbut Catch only says...\n\n                              CATCH\n             I'm sorry.\n\nAnd he walks on.        The Man watches him go.\n\n\nINT. CATCH'S APARTMENT BUILDING CORRIDOR - NEXT DAY\n\nCandace, Catch's neighbor, is waiting for the slow,\nRATTLING ELEVATOR with her son.\n\n                                                      (CONTINUED)\n\n                                                       39.\n\nCONTINUED:\n\nThe elevator door opens -- and there is Catch, seated on\na newly-bought wicker chair in the elevator with a small\ntable across his lap, other boxes nearby and a\nlong-stemmed rose in his hand, wrapped for giving.\n\n                             CATCH\n             Oh.   Sorry.\n\nHe rises and hurriedly gets his purchases off the\nelevator so the woman and little boy can enter.\n\n                             CANDACE\n             Shopping day?\n\nHe smiles at her, a bit less subdued than before as he\ngets his things into the hall -- and he manages a special\nlook for Tommy, a wink. He frees the elevator; they step\ninside. As the door starts to close, Catch's face\n\"follows\" the sliding door with a funny look for the boy.\nWe hear Tommy laugh as the door closes. Catch carries\nhis new possessions to his apartment.\n\n\nEXT. OLDER HOUSE - LATE DAY\n\nA well-kept older home, well-planted, pretty. A woman of\nnearly 60 is tending the flowers. She hears someone\napproaching the gate in the wooden fence. She looks up.\nSharon is at the gate, in uniform, on her dinner break.\nThe older woman is her MOTHER, Elaine Pogue. There is an\nold strain between them, a sadness -- and a nervousness\nin Elaine. She's a quiet woman. She smiles at her\ndaughter as Sharon comes through the gate. They hug\ntentatively, a lot of baggage here. Sharon turns to the\ngarden.\n\n                           SHARON\n             It's looking great, Mom.\n\n                           MOTHER\n                    (pleased)\n             Thanks, honey. It's the best year\n             ever for the impatiens. The very\n             best.\n\nThere is a beat of awkward silence.\n\n                             MOTHER\n             Let's go in.\n\n\nINT. POGUE HOME - DAY\n\nAs they enter.\n\n                                             (CONTINUED)\n\n                                                          40.\n\nCONTINUED:\n\nIt's a bit dark inside, older furniture, lots of keepsake\nclutter and photos. Sharon is restless in here -- bad\nmemories.\n\n                           SHARON\n             Looks the same. Still smells like\n             cigarettes. I thought he quit.\n\n                           MOTHER\n             He's down to six a day.\n\n                           SHARON\n             Your hair looks nice.\n\nHer Mother touches her hair, self-consciously. She can't\nhelp glancing at her daughter in all that gear --\nbullet-proof vest under her shirt, radio, cuffs -- and\nthat gun.\n\n                              MOTHER\n             Are you well?\n\nSharon steps close to the mantel. There is a photo of\nher there, graduating from the police academy, a\nprofessional, not a family shot. She is surprised.\n\n                           SHARON\n             I guess I'm well. Is this always\n             here?\n\n                            MOTHER\n             Yes.   It's always there.\n\n                           SHARON\n             Did Larry tell you I came by where\n             he's working? Is that why you\n             called me?\n\n                           MOTHER\n             I called because we want to invite\n             you to our renewal of vows. It's\n             three weeks from Saturday.\n\n                              SHARON\n             Who's 'we.'     You said 'we' want to\n             invite you.\n\n                              MOTHER\n             The family.\n\nSharon takes that in, still looking about.\n\n                                                 (CONTINUED)\n\n                                                          41.\n\nCONTINUED:\n\n                           SHARON\n             How come you're renewing your\n             vows?\n\n                           MOTHER\n             It's sort of... a fresh start.\n\n                            SHARON\n             Your idea?\n\n                           MOTHER\n             No. Both of us. It's a way of...\n             having the marriage blessed.\n\n                           SHARON\n             Wasn't it blessed before?\n\nHer Mother sighs, sad for all the trouble between them.\n\n                           MOTHER\n             Sherry... of course it was\n             blessed. You just...\n\n                           SHARON\n             I just what, Mom?\n\n                           MOTHER\n             You just think about the bad, and\n             you never remember the good. I\n             wish you remembered the good.\n\nSharon stares deeply at her.\n\n                           SHARON\n             Sorry.  I wish I did, too.\n                    (then, almost\n                     like a child)\n             Does he? Remember any good about\n             me?\n\n                           MOTHER\n             Of course. He doesn't hate you.\n             He just... still feels hurt.\n\n                             SHARON\n             Hurt?    I hurt him?\n\n                       MOTHER\n         Being arrested like that.\n         Somebody doesn't forget that.\n\n                      SHARON\n         Oh? How come you forgot what he\n         did?\n\n                                                 (CONTINUED)\n\n                                                        42.\n\nCONTINUED:\n\n                           MOTHER\n             It wasn't as bad -- you always\n             make it sound worse. And it\n             hasn't been that way for years.\n\n                        SHARON\n          I'm glad it hasn't been that way.\n          That means it worked, Mom. That\n          was the point. That's why I did\n          it. Christ. Why do I get\n          punished for it?\n\n                        MOTHER\n          Honey, nobody's punishing you.\n          We're inviting you. Will you\n          come?\n\n                        SHARON\n          Of course I'll come.\n\n                        MOTHER\n          We didn't think you'd want to.\n\n                          SHARON\n          Why not?\n\nNow her Mother shows a trace of fear.     She says gently...\n\n                        MOTHER\n          We don't want any trouble... on\n          that day. Please.\n\n                           SHARON\n             Mom, I'm your daughter. I don't\n             want any trouble -- ever. I'll\n             come to the ceremony. I won't\n             come to argue, and I won't come in\n             uniform.\n\nThey each get a small, sad smile.\n\n                           MOTHER\n             It's on the 23rd. Saint Monica's.\n\n                           SHARON\n             I'd like you to send me an\n             invitation. Mrs. Vander said it's\n             a beautiful invitation.\n\nHer Mother starts to leave the room.\n\n                              MOTHER\n             I'll show you.\n\n                                               (CONTINUED)\n\n                                                        43.\n\nCONTINUED:\n\n                           SHARON\n             Mom. I'd like to get one... in\n             the mail... from my family. Okay?\n\n                           MOTHER\n             Yes.\n\nSharon goes to the door, then stops and turns, letting\nher guard down all the way to say...\n\n                           SHARON\n             Tell Dad... thanks.\n\nAnd she leaves.\n\n\nEXT. SHARON'S APARTMENT - EVENING\n\nSharon is climbing the   outdoor staircase to her\napartment, tired after   her shift, drained a bit   by her\nvisit home. When she    reaches her door she sees   that a\nlong-stemmed rose has   been masking-taped to her   door.\nWritten on the masking   tape is: \"Catch Lambert\"    and a\nphone number.\n\nShe pauses, staring at this, gets a little grin.\n\n\nINT. SHARON'S BEDROOM - NIGHT (HOURS LATER)\n\nSharon is dressed for bed in a sleep shirt, lying on the\nbed, surrounded by old photos and a couple of photo\nalbums from her girlhood. In a vase on her bed table is\nCatch's rose.\n\nSharon is feeling blue, looking at her young self within\nthe family that has shut her out. She closes the book,\nangry at herself for nearly crying. She sits up and\ncatches sight of the rose and rummages in the drawer and\npulls out the tape with Catch's phone number on it.\n\nShe's very conflicted    about this. She puts the tape\ndown, but it sticks to    her fingers. She tears it off and\ntries to throw it onto    the table, but it hangsoff her\nthumb. She sighs and     steels herself and dialsthe\nnumber.\n\n\nINT. CATCH'S APARTMENT\n\nHe has bought a shelf unit that \"needs some assembly\" and\nhe's at work with a screwdriver, his new chair and table\nnearby, the phone on the floor. PHONE RINGS, and he\npicks it up.\n\n                                                          44.\n\nFULL SHOT\n\nAs we INTERCUT the call:\n\n                          SHARON\n            Do you have a machine?\n\n                           CATCH\n            What?\n\n                          SHARON\n            Do you have an answering machine?\n\n                           CATCH\n            Yes.\n\n                          SHARON\n            Will you hang up please, and I'll\n            call your machine.\n\n                           CATCH\n            Why?\n\nShe hangs up. He stares at the phone a moment,\nbewildered. He hangs up, and his PHONE RINGS. He lets\nit ring. His MACHINE comes on with no recording, only a\nBEEP.\n\n                          SHARON\n            Hi. Maybe we can... have\n            breakfast or something. I get up\n            early and run in Ballard Park.\n            There's a Denny's across from the\n            park. Like eight or so. If\n            you're there, you're there.\n\nShe hangs up, sighs a heavy one.\n\n                           SHARON\n            Oh, God.\n\nAnd she falls back on her bed.\n\n\nINT. DENNY'S - MORNING\n\nCatch walks in, glances at the clock. It's 7 A.M. He's\nnervous -- and excited. He takes a seat where he can\nwatch the park, the runners. He waits.\n\n\nINT. SHARON'S APARTMENT - MORNING\n\nShe has tossed and turned all night. She is awake,\nturning to look at her clock-radio. It is 7:14. She\nraises a hand over it.\n\n                                                (CONTINUED)\n\n                                                          45.\n\nCONTINUED:\n\nIt changes to   7:15 and the RADIO COMES ON.    She slams her\nhand down on   it, cutting it OFF. She lays    back and\nheaves a sigh   that becomes a moan, sits up   again and\npicks up the   phone, dials the number on the   tape.\n\n                        SHARON\n          Hi, don't pick up. Look, I didn't\n          sleep much and anyway this is a\n          bad idea. I was feeling funky\n          last night and I'm all right now\n          so let's just leave it where it's\n          at. Bye. Oh, thanks for the...\n          Bye.\n\nShe hangs up and lays back down and pounds her head into\nthe pillow and covers herself, even her head, with the\nsheet.\n\n\nINT. DENNY'S - MORNING\n\nCatch is waiting, watching out the window.      It's 8:05,\nuntil we...\n\n                                                DISSOLVE TO:\n\n\nINT. DENNY'S - MORNING\n\n... and now it's 8:38, and Catch is still waiting and\nwatching.\n\n\nINT. SHARON'S BEDROOM - MORNING\n\nShe is still in bed, under the sheet. Someone begins\nKNOCKING on her door and she sits up, bleary and\nfrustrated.\n\n                                SHARON\n             Damn it!\n\nShe stumbles out of the bedroom to her door.\n\n                                SHARON\n             What?!     Who?!\n\n                                CATCH (O.S.)\n             It's me.\n\n                                SHARON\n             Oh, Jesus.\n\n                                                (CONTINUED)\n\n                                                          46.\n\nCONTINUED:\n\nShe opens the door.    He wears a stern look.     She is not\napologetic.\n\n                           SHARON\n             I was just falling asleep.\n             Finally.\n\n                           CATCH\n             We made a date.\n\n                           SHARON\n             It wasn't a 'date.'\n\n                        CATCH\n          Okay, an 'appointment.'     I keep my\n          appointments.\n\nShe gives an exasperated moan and turns to stagger back\nto bed. He closes the door and follows.\n\n                          SHARON\n          I called you.    I called you at\n          seven.\n\n                        CATCH\n          I get up early. I walked there.\n          I waited there.\n\n                        SHARON\n          Check your messages.\n\nShe heads for the bed, passing a     mirror, looking at her\nrumpled self and groaning at the     sight.  She climbs into\nbed and snuggles there and puts     the sheet over her head.\nHe is entering the bedroom. He      carries a Denny's take-\nout bag.\n\n                           SHARON\n                    (under the sheet)\n             I need more sleep. Come back in a\n             month.\n\n                           CATCH\n             Come back? What makes you think\n             I'd come back here?\n\nThe lump under the sheet says...\n\n                           SHARON\n             Then why are you here?\n\n                                                (CONTINUED)\n\n                                                          47.\n\nCONTINUED:\n\n                           CATCH\n             I'm here to tell you that when you\n             tell someone you're going to be\n             somewhere then that someone\n             rearranges his life and you should\n             be more aware of that and a lot\n             more considerate instead of\n             just...\n\nShe has come out from under the sheet and is watching\nhim.\n\n                           SHARON\n             What's in the bag?\n\n                            CATCH\n             What?   None of your business.\n\n                           SHARON\n             Did you bring some coffee?\n\n                           CATCH\n             You think you deserve coffee?\n\n                           SHARON\n             What else did you bring?   Food?\n\n                           CATCH\n                    (opening the bag)\n             You definitely don't deserve food.\n             I've got coffee, sugar, sweetener,\n             non-dairy...\n\n                            SHARON\n             Just black.   Black. Thanks.\n\nShe sits up. He hands her the coffee.         She sips,\nrelishing the sip, then studies him.\n\n                           SHARON\n             So what kind of life did you\n             rearrange in order to get to\n             Denny's? You never said one word\n             about yourself last night. What\n             d'you do?\n\n                           CATCH\n             What's the difference?\n\n                           SHARON\n             What's the difference?! You're\n             standing in my bedroom. That's\n             the difference. Who are you?\n\n                                                (CONTINUED)\n\n                                                         48.\n\nCONTINUED:\n\n                           CATCH\n             Somebody who keeps appointments.\n\n                           SHARON\n             You're ducking. Don't duck.\n                    (then a thought)\n             Oh, shit -- you're married, right?\n\nConvinced -- she picks up one of the throw pillows from\nthe bed and tosses it at him.\n\n                           CATCH\n             I'm not.\n\n                           SHARON\n             I don't believe you.\n\n                           CATCH\n             You don't believe me?   Give me\n             back the coffee.\n\n                           SHARON\n             No.\n\n                           CATCH\n             Give me the coffee.\n\nShe hands him the coffee. He hits her with the pillow\nand hands her back the coffee. He has made her smile,\nbut she continues, half teasing now.\n\n                           SHARON\n             Oh, God. Oh, wait -- you're\n             involved in some criminal\n             activity, aren't you? Great --\n             That's all I need.\n\n                           CATCH\n             My name is Catch Lambert. I don't\n             work. I don't commit any crimes.\n             I like being with you. We can\n             start from here -- from now.\n\n                          SHARON\n             Bullshit. I'm... I let you in\n             here. I'm not going to be some\n             fool. I need the details.\n\n                           CATCH\n             And I need to start from here.\n\n                           SHARON\n             That's ridiculous. Why?\n\n                                                (CONTINUED)\n\n                                                        49.\n\nCONTINUED:\n\n                           CATCH\n             That's the way it is.\n\n                            SHARON\n             Oh.   Your rules.\n\n                            CATCH\n             My rules.\n\n                           SHARON\n             Jesus. Okay. Fine. I don't\n             really want to know you anyway.\n             Goodbye.\n\nHe is conflicted -- but he won't relent. He walks to the\ndoor. She stares, waiting. But he never turns around.\nHe walks out. She is mystified, exasperated. She hears\nher FRONT DOOR CLOSE. She puts the coffee on her bed\ntable -- and finds herself staring at that damn rose.\nShe suddenly gets up and begins to dress hurriedly --\nwith a plan.\n\n\nEXT. BOULEVARD - DAY\n\nSharon is driving, speeding a bit, getting to Catch's\nbuilding ahead of him.\n\n\nEXT. CATCH'S BUILDING - DAY\n\nHe approaches his apartment building, unlocks the front\ndoor, walks in the entrance area. Now we see, across the\nstreet, Sharon exit her car and follow him.\n\n\nEXT. BUILDING - DAY\n\nThe front door has locked automatically. Outside there\nis a panel of buzzers and apartment numbers. Sharon hits\nall the buttons. Somebody BUZZES her in.\n\n\nINT. LOBBY - DAY\n\nSharon enters, looks at the elevators. It's not moving.\nShe goes to the stairs, listens, hears him TRUDGING UP\nthe stairway. She follows silently.\n\n\nINT. HALLWAY - DAY\n\nAs Catch reaches his apartment door, unlocks it, opens it\nand walks in.\n\n                                                          50.\n\nINT. CATCH'S APARTMENT - DAY\n\nBefore he can close the DOOR behind him, it BANGS open\nwider, startling him -- and Sharon is in the doorway,\nstaring hard at him.\n\n                         SHARON\n                 (sarcastic)\n          Can I come in?\n\nShe walks in and closes the door and starts looking\naround as he says...\n\n                          CATCH\n          Yeah.   Sure.   Come in.\n\nDespite his recent \"decorating\" the apartment is still\nnearly empty. No books, magazines, photographs, no\nclutter of life. She glances into the equally sterile\nkitchen.\n\n                        SHARON\n          You live here? Nobody lives here.\n          This place is some kind of front,\n          a scam, a drop -- or what?\n\n                        CATCH\n          This is what you told me about --\n          right?\n\n                          SHARON\n          What?\n\n                        CATCH\n          Your interrogation.      Do I need a\n          lawyer?\n\nHe has made her look at herself, and take a breath.\n\n                        SHARON\n          I just don't want to be jerked\n          around.\n\n                          CATCH\n          I'm not.\n\n                        SHARON\n          Then tell me straight out.      Who\n          are you?\n\nHe is silent, and she starts to leave.     Moment of truth.\n\n                        CATCH\n          What is it you're looking for?\n\n                                                 (CONTINUED)\n\n                                                          51.\n\nCONTINUED:\n\n                             SHARON\n             Your life.    I don't want any\n             surprises.\n\n                          CATCH\n             This is it. I sleep here. I walk\n             around town. That's all of it.\n\n                           SHARON\n             That's all of it?\n\n                           CATCH\n             Yeah. Except for you -- the way I\n             feel about you.\n\n                             SHARON\n             Which is?\n\n                             CATCH\n             Surprising.    I thought it was\n             impossible.    I thought I was...\n\n                           SHARON\n             You thought you were what?       Gay?\n\n                            CATCH\n             Dead.   In a way.\n\n                           SHARON\n             I'm supposed to understand that?\n\n                           CATCH\n             No. Did you ever wonder what\n             'scratch' meant, when people say,\n             'we'll start from scratch'? This\n             is scratch. We can start from\n             here.\n\nShe looks at him, looks at his empty place, his non-life,\nand back at him again.\n\n                             SHARON\n             I don't know.    I just don't know.\n\nShe breaks off the stare and heads for the door.     He\nwatches her go.\n\n\n\nEXT. UPSCALE NEIGHBORHOOD - DAY (SAME DAY)\n\nAs Catch charges up the stairs to the wide porch of Mrs.\nChu's well-kept home, carrying a grocery bag, head full\nof his thoughts.\n\n                                                         52.\n\nINT. MRS. CHU'S HOME - DAY\n\nAs Catch enters. She is watching TV. He does glance\ninto the living room briefly to throw her a quick hello\nsmile, before moving to the kitchen. She SNAPS OFF the\nTV and begins turning the photos face down as she sends\nher voice to the kitchen.\n\n                        ELANORA\n          I remember that. That was a\n          smile.\n\n\nINT. KITCHEN - DAY\n\nHe is putting groceries away as she rolls into the room.\nHe doesn't look at her, tries to be casual, but his\nthoughts are bubbling out.\n\n                        CATCH\n          You know the cop -- the woman cop?\n          She... visited me.\n\nMrs. Chu registers surprise at this, but keeps it covered\nand casual.\n\n                         ELANORA\n          Oh?   Where did she sit?\n\n                        CATCH\n          I have a chair now.\n\n                        ELANORA\n          You're... seeing her?\n\nHe darkens a bit as he works.\n\n                        CATCH\n          She has a lot of questions.    She\n          wants to know everything.\n\n                        ELANORA\n          Of course she does. Everybody\n          does.\n\n                        CATCH\n          We could start from today.    What's\n          so wrong with that?\n\n                        ELANORA\n          Tell her.\n\nThe can in Catch's hand bangs on the cupboard, and he\nstops, suddenly uptight.\n\n                                               (CONTINUED)\n\n                                                        53.\n\nCONTINUED:\n\n                              CATCH\n             Tell her what?\n\nMrs. Chu comes closer.\n\n                           ELANORA\n             Tell her, Catch. Tell somebody.\n             It's been almost two years.\n\n                              CATCH\n                       (a warning)\n             Nora...\n\n                           ELANORA\n             Every time I tell somebody, it\n             gets a little bit easier. I'm not\n             saying it goes...\n\nHis next warning is tough and absolute.\n\n                              CATCH\n             Nora!\n\nShe is silenced. The moment hangs. She rolls her chair\nto him, takes a box of cookies out of his hand, opens the\nbox and eats one, defusing the moment.\n\n                              ELANORA\n             She nice?\n\nHe starts to work again.\n\n                              CATCH\n             She's tough.\n\n                              ELANORA\n             She pretty?\n\n                           CATCH\n             That doesn't matter.\n\n                            ELANORA\n                    (smiles)\n             She is pretty.\n\n                       CATCH\n         She's sort of pissed-off at me.\n\n                             ELANORA\n         Apologize.\n\n                             CATCH\n         For what?\n\n                                               (CONTINUED)\n\n                                                          54.\n\nCONTINUED:\n\n                           ELANORA\n             It doesn't matter. We like it\n             when men apologize.\n\nHe stares at her a while.\n\n                           CATCH\n             I'm sorry I yelled at you.\n\nShe smiles and hands him the box.\n\n                              ELANORA\n             Have a cookie.     See?\n\n\nINT. POLICE REPORT ROOM - NIGHT\n\nSharon is typing at the computer, dark and dogged in her\nwork.  Lieutenant Sanderman is watching her through the\nglass wall of the watch commander's office. He comes out\nof the office and moves to where Sharon is typing.\n\n                              SANDERMAN\n             Sharon...\n\n                           SHARON\n                    (typing)\n             Lieutenant...\n\nWe can see the   computer screen now. Sharon is searching\nfor any prior   record of \"Catch Lambert\" -- arrests,\nconvictions.    She has several \"Carl Lamberts\" on the\nscreen, even a   \"Casper,\" no Catch.\n\n                           SANDERMAN\n             Anything bothering you?\n\n                            SHARON\n             Why?   What'd I do?\n\n                           SANDERMAN\n             Nothing. I'm talking about your\n             general attitude lately.\n\nSharon stops typing.     She can find nothing.    She clears\nthe screen, sighs.\n\n                           SHARON\n             My attitude's fine. End of a long\n             day. I'm tired.\n\n                           SANDERMAN\n             Family matters getting to you?\n\n                                                 (CONTINUED)\n\n                                                       55.\n\nCONTINUED:\n\n                              SHARON\n             Family?!\n\n                           SANDERMAN\n             Your brother, Larry...\n\n                           SHARON\n             What about Larry?\n\n                           SANDERMAN\n             You know Nester -- on the Culver\n             City P.D.? He went out on a\n             violent domestic dispute\n             yesterday. A neighbor called it\n             in. It got a little ugly. No\n             arrest -- a warning.\n\nThis hits her hard.\n\n                              SHARON\n             Larry.     Oh Christ.\n\n                           SANDERMAN\n             Nester said it's not the first\n             time.\n\nSharon is quiet a while, taking it in, shaken by it.\n\n                           SHARON\n             Thanks for telling me.\n\n\nEXT. RESIDENTIAL STREET (CULVER CITY) - DAY (NEXT MORNING)\n\nSharon, not in uniform, is approaching Larry's house. It\nhas a small yard with kids' toys strewn about and a tire-\nswing. She walks up on the porch and RINGS the DOORBELL.\nShe hears VOICES inside, LARRY AND KATHY, a quick\nmurmuring, low-voice argument, can't make out the words.\nIn a moment, Larry opens the door.\n\n                           LARRY\n             Jesus, you're up early.\n\n                           SHARON\n             I wanted to catch you before you\n             went to work.\n\n                           LARRY\n             I thought you were on late shifts.\n\n                           SHARON\n             I don't sleep much. Can I come\n             in?\n\n                                                        56.\n\nINT. LARRY'S HOME - LIVING ROOM - DAY\n\nThe place is messy.    A TV can be heard -- CARTOONS.\n\n                          LARRY\n          What's up?\n\n                          SHARON\n          Where's Kath?\n\n                        LARRY\n          She's busy with Larry Jr. right\n          now.\n\nSharon nods, but then walks past him.\n\n\nINT. CHILD'S ROOM - DAY\n\nAs Sharon walks into this toy-strewn room. Larry Jr. is\nsitting on the floor, watching a small TV. Kathy is not\nwith him. Sharon kneels beside the boy a moment.\n\n                          SHARON\n          Hey, Champ.\n\nBut he stays focused on the TV, some darkness, some\nunsayable worry in his eyes. She picks up a toy car,\nspeaks softly.\n\n                        SHARON\n          Y'know, they call this one a woody\n          'cause it has wood on the sides.\n\n                          LARRY JR.\n          I know.\n\nNow he looks at her with sad and bottomless eyes. She is\nhurting for him. Larry is now in the doorway. Sharon\nkisses the child's head and walks out, passing her\nbrother.\n\n                        LARRY\n          Why'd you come by?\n\n                          SHARON\n          To see Kathy.\n\n\nINT. HALLWAY\n\nAs Sharon heads for the master bedroom, Larry takes her\narm.\n\n                        LARRY\n          She's not feeling good.\n\n                                             (CONTINUED)\n\n                                                         57.\n\nCONTINUED:\n\nSharon pulls away from her brother.\n\n                           SHARON\n             I'll just say hello.\n\n\nINT. BEDROOM - DAY\n\nSharon walks in. Kathy is sitting on the bed, her face\nbadly bruised. They stare. Kathy speaks quietly, her\neyes filling.\n\n                           KATHY\n             Don't make it worse.\n\n                              SHARON\n             It gets worse?\n\n                           KATHY\n             He's okay now. He's torn up about\n             it. Don't make him mad.\n\nSharon moves closer. She reaches out, touches Kathy with\na comforting touch as the woman turns her bruised face\naway.\n\n                            SHARON\n             When Larry and I were growing up,\n             our mother said that all the time.\n             'Don't make your father mad.'\n                    (pause)\n             Has he hit Larry Jr. yet?\n\n                           KATHY\n             He never would.\n\n                            SHARON\n             Oh.   Just you, huh?\n\nLarry is in the doorway now, angry.\n\n                           LARRY\n             What d'you think you're doing in\n             my house, Shar? In my home.\n\nShe walks out of the room and he follows her.\n\n\nINT. LIVING ROOM - DAY\n\nShe turns on him.\n\n                            SHARON\n             You see a pattern here, bro?\n\n                                                (CONTINUED)\n\n                                                         58.\n\nCONTINUED:\n\n                           LARRY\n             I lost my temper. Things got out\n             of hand. It won't...\n\n                           SHARON\n             People always say that: 'I've got\n             a temper.' Like it's an excuse.\n\n                        LARRY\n          I don't need a goddamn lecture.\n\nShe comes very close to him.\n\n                       SHARON\n         You want to hit someone?       Next\n         time your 'temper' flares      up, Lar,\n         and you just have to hit      somebody,\n         you go home and hit your      father.\n\n                       LARRY\n         You blame everything on him.\n\n                       SHARON\n         I'm blaming you, you fucking\n         coward.\n\nHe grabs her shirt hard.\n\n                        LARRY\n          You don't come in here...\n\nHe pushes her into the wall.\n\n                        LARRY\n          You don't come in here and call me\n          names.\n\n                         SHARON\n          What do you call a man who uses\n          his wife as a punching bag?\n                  (pause)\n          Coward.\n\nHe swings a slap at her. She blocks it and punches him\nhard in the face, and he crashes down on the floor.\nKathy comes running, calling out...\n\n                           KATHY\n             Don't hurt her, Lar...!\n\n                                                (CONTINUED)\n\n                                                       59.\n\nCONTINUED:\n\nKathy sees that it's Larry on his ass. The little boy\ncomes out of his room. There is a surprised moment.\nThen Kathy picks up the child and takes him back to his\nroom. Larry is sitting up, shaken, his nose bleeding.\nSharon goes close to him, rigid with fury.\n\n                           SHARON\n             I know how it feels, 'cause I\n             remember. I remember standing\n             between you and Dad and taking the\n             blows for you -- and for what?!\n             You turned out to be just like\n             him, you bastard.\n                    (pause)\n             And so did I.\n\nAnd she leaves the house and SLAMS the DOOR.\n\n\nINT. SHARON'S APARTMENT - NIGHT\n\nShe is just returning home after her shift, very tired,\ndrained. She absently turns ON the TV, the STEREO. She\nnotices a blinking light on her MESSAGE MACHINE and hits\nthe button.\n\n                           LARRY (V.O.)\n             I bet you feel real proud of\n             yourself, Shar, knocking me down\n             in front of my family. You know\n             what I've got in my hand? I've\n             got a Polaroid picture of my\n             busted-up face, and I'm thinking\n             of sending it to your department,\n             to your lieutenant. I'm going to\n             turn you in to the police, Shar,\n             and see how you like it.\n\nThe message ends.     She stands there a moment.\n\n                           SHARON\n                    (quietly)\n             Oh, God. Oh, shit.\n\nShe sits on the edge of a chair, worried, deep in her\nthoughts, hitting bottom -- the darkness engulfing her.\nIn a moment, she looks at her desk, walks there, opens a\ndrawer, pulls out that piece of tape with Catch's number\non it -- but it is all stuck to itself. She hesitates,\nthen starts to pick it apart when a KNOCK at the door\nmakes her jump. She wonders, then, somehow, she knows.\nShe walks to the door.\n\n                                              (CONTINUED)\n\n                                                           60.\n\nCONTINUED:\n\n                           SHARON\n             It's you, right?\n\nShe unlocks   and opens the door, stares at Catch, very\nvulnerable,   on the very edge, her pain and fear over\nLarry just   under the surface. Catch holds a box of\ncookies as   an offering.\n\n                            SHARON\n             Can you just shut up?    Just shut\n             up and listen.\n\n                           CATCH\n             I didn't say anything.\n\n                           SHARON\n             I don't want to talk. I don't\n             care if you have to play some game\n             and pretend you're a... 'angel of\n             mercy' or... whatever. I don't\n             care, but I don't want to hear\n             about it. All right? I don't\n             want to hear anything.\n\nShe steps back, allowing him in, and closes the door and\nturns to him.\n\n                           SHARON\n             It's a bad night.\n\nHe sees her pain and puts his arms around her, pushes\nthrough his fear and holds her -- and she lays her head\non his chest. He embraces her fully, and the effect on\nhim goes deep, to his core, where there is both pain and\nlonging, but he holds on to her, even rocks her a bit.\nShe sighs. In a moment...\n\n                           SHARON\n             This is good... but I'm too tired\n             to stand up anymore.\n\nHe walks her to the couch and has her sit, and then\nslowly, gently, he \"disarms\" her. He lifts her leg,\ntakes the ankle holster and gun off, puts it on the\ntable. He turns her, takes the cuffs off her belt from\nthe middle of her back. He reaches into her pants pocket\nand removes the Mace. From her shirt pocket he takes her\nI.D. shield. He has her lie down on the couch now, their\nfaces close, eyes locked. They linger...\n\n                           SHARON\n             You want to kiss me?\n\n                                                  (CONTINUED)\n\n                                                       61.\n\nCONTINUED:\n\nHe looks a little lost, but he nods, helpless. He comes\ntoward her lips -- finally -- but just before they touch,\nshe says, softly...\n\n                           SHARON\n             Kiss me someplace I've never been\n             kissed.\n\nHe's not sure what to do. He begins to look her over --\nas if hunting, and she gets a soft smile. He starts\nslowly toward her ear -- but she shakes her head. Her\nshirt is out of her belt and her midriff bare, and he\nstarts to move there, but checks her with a look. She\nshakes her head. He hunts. Her smile deepens a bit. He\ntakes her hand and turns it over, going for the soft\nflesh on the underside of her forearm, and she closes her\neyes. He kisses her there softly, and then again, and\nthen he lavishes kisses from her wrist to the underside\nof her elbow as she sighs with pleasure and draws up her\nknees in a kind of sensual glow that is leading them\nto... No. He stops. She looks at him, a deep look, soft\nvoice.\n\n                           SHARON\n             Why do you stop? You always stop.\n\nShe has a glimpse of his mystery, the old sorrow, the\ndeep pain. He hugs her drawn-up knees, closing his eyes\na moment. Then he sits on the couch, puts a pillow on\nhis lap and raises her slightly, lays her head on the\npillow. He strokes her hair, her scalp as she closes her\neyes and sighs, slowly moving toward sleep. Our TRUMPET\nMUSIC slides in here, lush and dreamy as we linger a\nwhile, and then --\n\n                                           SLOW DISSOLVE TO:\n\n\nINT. SHARON'S APARTMENT - MORNING\n\nJust after dawn. Catch has slept on the couch. He is\nbeginning to awaken now as the first light strikes the\nwindows. The dreamy TRUMPET FADES OUT. Catch's eyes\nclear, sleep replaced by thought, and he is suddenly\nshaken by --\n\n\nFLASHBACK - CATCH'S POV\n\n-- a sliver of memory. But in this one, he is driving.\nWe see his hands on the wheel. Then his POV looks to the\nside and we see an Asian-American woman seated beside\nhim, attractive, about his age. Her name is Annie. She\nis saying something to him. We don't hear the words.\nWhen the FLASHBACK ENDS --\n\n                                                        62.\n\nBACK TO SCENE (PRESENT)\n\nCatch sits up on the couch, jolted.   He gets another\nsudden --\n\n\nFLASHBACK - HEADLIGHTS\n\nglaring through his windshield, blinding him. He gasps,\nsitting there on the couch, but it's all over. He\nstands, rattled, and he moves toward Sharon's bedroom.\n\n\nINT. BEDROOM - MORNING\n\nSharon is peacefully asleep. He stands over her with\ntroubled eyes, but this slowly changes to a loving look.\nHe bends close to her face. He feels her breath on him.\nHe wants to lie down with her -- but he raises a hand and\nvery gently brushes her cheek. She stirs. He does it\nagain. She sighs a peaceful sigh, opens her eyes. He\nsmiles at her.\n\n                          CATCH\n          New day.\n\n\nEXT. BOULEVARD - DAY\n\nSharon is driving Catch home. They are now on a main\nboulevard of stores, office buildings. They stop at a\nlight. Both are surprised by a voice calling out from\nthe pedestrians crossing the street.\n\n                          PINDELLA (O.S.)\n          Catch?\n\nThey look up to see a well-dressed man pausing in the\nmiddle of the crosswalk to face their car. He is in his\nforties, tall, with grey-blond hair. This is RICHARD\nPINDELLA. He has a small smile and wave for Catch.\nSharon is curious, looking at Catch. Catch throws the\nman a dark look and then turns away, ignoring him,\nnervous, intense.\n\n                          PINDELLA\n          Catch?\n\n                        CATCH\n                 (to Sharon)\n          Drive, will you?\n\nPindella is moving toward the car, Sharon watching him,\nwondering.\n\n                                            (CONTINUED)\n\n                                                         63.\n\nCONTINUED:\n\n                             CATCH\n             Drive!\n\nThe light changes. Pindella hurries to the curb as the\ncars surge forward. Sharon drives slowly, checking the\nmirror to see Pindella stare after them -- then enter the\noffice building on the corner.\n\n                        CATCH\n          Will you get off this street?\n\nShe makes a turn, glancing at Catch.\n\n                             SHARON\n          What?       You owe him money?\n\nBut his dark look persists, and he doesn't answer.\nThen...\n\n                        CATCH\n          If you take a right and stop -- we\n          can walk from here. I'd rather\n          walk.\n\nHe is nervous, being in the car -- and glad to leave it\nwhen she pulls over. She watches this, wondering.\n\n\nEXT. NEIGHBORHOOD - DAY\n\nSharon exits the car and locks it, staring at Catch.\n\n                        SHARON\n          If you're in trouble...\n\n                             CATCH\n             I'm not.\n\n                           SHARON\n             If you're in trouble with him,\n             maybe I can help.\n\n                           CATCH\n             Forget about him. Somebody I used\n             to know. I don't want to know him\n             anymore. That's all. Forget\n             about it. Walk with me.\n\nShe hesitates,    then falls in   beside him as he walks on.\nThey walk along    in silence,   the neighborhood growing more\nseedy, tougher    as they go.    Catch is relaxing now, trying\nto push it all    away. Sharon    looks around her.\n\n                                                (CONTINUED)\n\n                                                           64.\n\nCONTINUED:\n\n                           SHARON\n             This is not a great place to walk.\n\n                           CATCH\n             I like it here. It's fine.\n\n                            SHARON\n             I work here.   It's not fine.\n\n                           CATCH\n             What's the problem?\n\n                           SHARON\n             Besides the shootings, break-ins,\n             rapes, cart thefts? We've got a\n             loose dog raiding garbage cans,\n             knocking 'em over. Can't catch\n             him. Got somebody blowing a\n             trumpet between midnight and\n             three. Can't find him.\n\nAs someone approaches them, Catch makes eye contact and\nsmiles a small, friendly smile-in-passing. He gets a\nbrief smile in return. He and Sharon amble on. He does\nit again.\n\n                           SHARON\n             You know everybody here?\n\nHe nods to another YOUNG MAN he's never met...\n\n                           CATCH\n             How's it goin'?\n\n                           YOUNG MAN\n             Goin' uphill, man.\n\nCatch and Sharon smile.\n\n                           CATCH\n                    (to Sharon)\n             You try it.\n\n                            SHARON\n             Try what?\n\n                          CATCH\n             Go ahead. We need this.\n             Everybody.\n\nShe has misgivings. A young woman is bustling along.\nSharon makes eye contact and presents a nervous smile and\na nod -- but the woman looks at her sternly and bustles\non.\n\n                                                 (CONTINUED)\n\n                                                             65.\n\nCONTINUED:\n\n                           SHARON\n             I feel like a jerk. I feel like a\n             smiley face.\n\nCatch smiles, Sharon frowns, but when an OLD MAN passes,\nshe gives a small smile. The Man lights up.\n\n                              OLD MAN\n             Mornin'.\n\nCatch looks at her. She tries to shrug it off, but can't\nquite hide her pleasure. Now Catch is pausing as a woman\nis walking her six-year-old daughter to their parked car.\n\nCatch makes eye contact with the girl and does a goofy\nwave that makes her smile. Sharon smiles, too. As the\ngirl's MOTHER is unlocking the car, the girl shyly looks\nback at Catch for more fun. He does that quick finger\ntrick -- trying to catch his own thumb, and the girl\ngiggles But the Mother is impatient.\n\n                              MOM\n             Go on.\n\nThe girl gets in. The Mother is about to close the door.\nShe frowns, mean-eyed.\n\n                              MOM\n             Move your arm!\n\nThe girl slides in further,         and the Mother slams the\ndoor. The girl follows her          mother with hurt eyes as she\nwalks around to the driver's         side. Catch has paused to\nwatch this, his eyes gentle         on the girl. The Mother is\nabout to enter the car when         she sees Catch staring.\n\n                           MOM\n             What are you staring at?\n\n                           CATCH\n             She feels bad 'cause you yelled at\n             her.\n\n                          MOM\n             What?! Who the hell do you think\n             you are?\n\nSharon is uncomfortable.       Catch persists, never flinching\nat the woman's anger.\n\n                        CATCH\n          She just needs you to smile at\n          her.\n\n                                                  (CONTINUED)\n\n                                                           66.\n\nCONTINUED:\n\n                           MOM\n             It's none of your business!\n\n                           CATCH\n             Why not smile at her?   What's it\n             cost?\n\n                           MOM\n             Who the hell are you to talk to\n             me?!\n\nCatch's anger is like flint in his eyes.         It surprises\nSharon. She's upset by this.\n\n                           CATCH\n             You're so damn impatient.\n\n                           WOMAN\n             Get away from me!\n\n                           CATCH\n             You're so busy being pissed off,\n             and time is going by.\n\n                           WOMAN\n             What?!\n\n                           CATCH\n             It's not her fault.\n\nThe Woman gets into the car and slams the door.\n\n                           WOMAN\n             I'm calling the police!\n\n                            CATCH\n             No.  I'm calling the police.\n                    (turns to Sharon)\n             Hey -- police.\n\nThe Woman speeds her car away.       Sharon gets in Catch's\nface.\n\n                           SHARON\n             Jesus Christ, Catch.\n\n                           CATCH\n             Maybe she'll think about it now.\n\n                                                  (CONTINUED)\n\n                                                          67.\n\nCONTINUED:\n\n                       SHARON\n         You had no right to do that. God!\n         You think you know everything?!\n         Who the hell are you, some expert\n         on raising kids?! The\n         neighborhood angel?! Jesus!\n\n                       CATCH\n         No. No, I just... some people are\n         walking around blind...\n\n                       SHARON\n         That's not your problem!\n\n                       CATCH\n         Don't tell me what my problem is!\n\n                       SHARON\n         Okay, fine -- you tell me what it\n         is!\n\n                       CATCH\n         Maybe it's not my problem. Maybe\n         it's your problem. Maybe you're\n         going around blind.\n\n                           SHARON\n             Blind to what?!\n\n                        CATCH\n          Blind to what's going on around\n          you. Blind to what people need.\n          We're supposed to take care of\n          each other. We're supposed to\n          keep each other safe. That's the\n          way it should be -- if you're not\n          going around blind, like that\n          woman...\n\n                           SHARON\n             Or like me, right? What about\n             you? How come you can see?\n\nThat stops him, the darkness rising.    He looks about,\ntrying to contain it.\n\n                        CATCH\n          I think I'll... walk the rest of\n          the way on my own.\n\n                           SHARON\n          Yeah.    Fine.\n\n                                              (CONTINUED)\n\n                                                         68.\n\nCONTINUED:\n\n                           CATCH\n             I'll call you later -- about the\n             hiking.\n\n                             SHARON\n             I'll be out.\n\nShe turns and walks away.      He is still angry, but sorry\nto see her go.\n\n                             CATCH\n             Shar... wait.    Hey!\n\nBut she   keeps walking, and he watches her walk away.\nThen he   walks on, upset, mad at himself, trying to pound\nthrough   it, walking quickly. He is passing an alley,\nwhen he   hears a CRASH. He looks in...\n\n\nEXT. ALLEY - DAY\n\nHe sees a large dog that has just knocked over a garbage\ncan. He and the dog stare. Catch walks into the alley,\napproaches the big dog, squats down to look the animal in\nthe eye, and begins petting it. The big mutt is now\nleaning into the petting, and Catch's eyes go deep -- and\nslowly find their way to a sad smile.\n\n\nEXT. CITY STREETS - DAY\n\nSharon and Robby    are patrolling in their unit. Robby is\ndriving. Sharon     is watching out the window with a deep-\neyed look, a bit    down because of her argument with Catch.\nShe is staring as    she rolls along.\n\n\nSHARON'S POV\n\nShe is watching the people on the street, NOTICING, for\nonce, just how isolated they are, each in a box, passing\nwithout connecting.\n\n\nON SHARON\n\nwatching.\n\n\nINT. CATCH'S APARTMENT - LATER THAT DAY\n\nWe've never seen the apartment flooded by sunlight like\nthis, all blinds open.\n\n                                                (CONTINUED)\n\n                                                        69.\n\nCONTINUED:\n\nWe START in the kitchen, staring at the drawer that is\nnow so loaded with toys, it won't shut. Some brightly-\npainted soldiers are sticking out of the drawer.\n\nIn the living room there are two chairs now, and more\nlamps and tables. Our PAN REVEALS that the dog from the\nalley is sitting in the living room, watching Catch --\nwhom we now see is hanging a picture on the wall -- a\nmountain scene. He holds the picture in one place, then\nmoves it to another, wondering. His fight with Sharon\nstill colors his mood, but he's working through it.\n\n                           CATCH\n             Do we go for... symmetry? Or...\n             more off-center. Japanese.\n\nHe glances at the dog as he moves the picture.\n\n                           CATCH\n             Are you into this? Bob?\n\nThe dog watches him.\n\n\nEXT. LARRY'S HOUSE - EVENING\n\nIt is early evening of the same day, and Sharon is just\noff shift, out of uniform in her own car, parking on\nLarry's street and walking to the door. She knocks --\nand takes a step back. Larry opens the door, already\nangry, his nose bandaged, eyes blackened a bit from the\nblow.\n\n                           LARRY\n             I don't want you around here.\n\n                           SHARON\n             Let's go talk in the yard.\n\nThey stare. She starts walking back into his darkening\nfront yard, looking over her shoulder. She walks to a\ntree where the tire swing hangs, waits there. He goes\nback inside, but leaves the door open. In a moment he\nreappears, coming outside, closing the door behind him.\n\n\nON SHARON AND LARRY\n\nAs they meet by the tire swing.    His eyes burn her, hate\nand pain.\n\n                           SHARON\n             You took a swing at me.\n\n                                               (CONTINUED)\n\n                                                          70.\n\nCONTINUED:\n\n                           LARRY\n             You asked for it -- calling me a\n             coward. You knew I'd swing. You\n             think I look bad now? Look at\n             this.\n\nHe has a Polaroid photo in his hand, holds it in front of\nher, dried blood and bad bruising on his face.\n\n                           LARRY\n             Nice, huh? Beautiful. The\n             cops'll love this, right?\n             Evidence. Don't you guys love\n             evidence?\n\nHe puts it in his pocket, and they stare a moment more.\n\n                           LARRY\n             You wanted me to swing.\n\nShe looks away.     She nods, speaks softly.\n\n                           SHARON\n             I'm sorry I hit you so hard.\n\n                           LARRY\n             But you're not sorry you hit me.\n\n                           SHARON\n             Jesus, Larry, what about Kathy's\n             face?!\n\n                        LARRY\n          That's not your business! Nobody\n          called you, right? She didn't ask\n          for you to come here. This is my\n          family. You don't get it, 'cause\n          you've got no family. Nobody. So\n          you try to run everybody else's\n          life. Jesus Christ -- get your\n          own life. That's the goddam\n          problem. Get your own goddamn\n          life.\n\nTheir stare holds, but she is giving way.\n\n                        SHARON\n          Okay. I'm sorry I came here.       I'm\n          sorry I hit you. Okay?\n\n                           LARRY\n          Okay what?\n\nThis is very hard for her.\n\n                                                (CONTINUED)\n\n                                                         71.\n\nCONTINUED:\n\n                           SHARON\n             Don't go to my department, all\n             right?\n\n                           LARRY\n             Why the hell not?\n\n                           SHARON\n             Larry...\n\n                           LARRY\n             Why not?!\n\n                           SHARON\n             Because the job's all I got.\n\n                        LARRY\n          That's what I said, right?    No\n          life.\n\nShe nods, her voice smaller, almost a whisper.\n\n                        SHARON\n          That's what you said.\n\nHe makes her wait, thinking it over.\n\n                        LARRY\n          And you won't come around here.\n          You won't call. Ever.\n\nIn a moment Sharon nods.\n\n                           LARRY\n             And I don't want you to come to\n             Mom and Dad's celebration...\n\nHer eyes snap to his, surprised.\n\n                           LARRY\n             Not the church. Not the party.\n             Stay away. I don't want you\n             around. I don't want to see you,\n             Shar.\n\nAfter another moment, she nods again -- and he snatches\nthe photo out of his shirt pocket and pushes it against\nher chest and walks away. The photo falls to the ground.\nLarry says without turning...\n\n                              LARRY\n             Go get a life.\n\n... and she snaps.\n\n                                                (CONTINUED)\n\n                                                          72.\n\nCONTINUED:\n\n                             SHARON\n             I got a life!\n\nThe words burst out of her, thick with tears, but she's\nnot crying. Larry stops and turns.\n\n                           SHARON\n             How the hell would you know about\n             my life?!\n\n                             LARRY\n             I know.\n\n                        SHARON\n          You know nothing about me, because\n          you don't want to know. The\n          family doesn't want to know me.\n          Well, too bad. Sharon's got a\n          life. Sharon's got a boyfriend.\n          Sharon's going hiking in the\n          morning with her boyfriend. She's\n          not sitting alone miserable like\n          you want. Too bad!\n\nShe reaches down, snatches the Polaroid photo off the\nground, walks to her car, enters and slams the door as\nhard as it is possible to slam it.\n\n\nEXT. SANTA MONICA MOUNTAINS - DAY\n\nMoving through the panorama are two small figures on a\nhiking trail, traveling uphill on a ridge.\n\n\nON SHARON, CATCH\n\nSharon is pounding along, barely out of breath. She\nstudies the beautiful view, and it helps her. It lifts\nher. Catch is falling behind, breathing heavily.\n\n                           CATCH\n             Hey. Hey!   Can you wait up a\n             minute?!\n\nShe waits.     He catches up.\n\n                           SHARON\n             I thought you walked all over the\n             city.\n\n                                                 (CONTINUED)\n\n                                                          73.\n\nCONTINUED:\n\n                           CATCH\n                    (gasping)\n             The city is flat. Okay? Can we\n             stop here? Can we examine the\n             view? Have a Milky Way? I've\n             burned every calorie I ever had.\n\nBut she walks on.\n\n                           SHARON\n             My favorite lunch spot is another\n             half mile.\n\n                            CATCH\n             Up?!\n\nShe smiles and walks on, and he follows, calling out.\n\n                           CATCH\n             I'm not one of those competitive\n             guys, you know!\n\n\nEXT. POND - DAY (BIT LATER)\n\nSharon is already unpacking their lunch as Catch trudges\nup and collapses near a stream-fed pond. She hands him a\nsandwich, but he shakes his head.\n\n                           CATCH\n             No thanks. I can't eat and have a\n             heart attack at the same time.\n\nShe smiles again and takes a bite and stares off, and\nsoon enough her dark thoughts come and cover her, and\nCatch notices.\n\n                           CATCH\n             As soon as you get happy, you get\n             sad.\n\n                            SHARON\n             I'm okay.   Everything's code four.\n\n                           CATCH\n             Everything's what?\n\n                           SHARON\n             Everything's fine.\n\n                           CATCH\n             Fine? This isn't fine. I know\n             fine. This is something else.\n             Something happened yesterday.\n\n                                                 (CONTINUED)\n\n                                                          74.\n\nCONTINUED:\n\n                            SHARON\n             Yesterday -- you mean you want to\n             hear about it?\n\n                           CATCH\n             Sure I do.\n\n                           SHARON\n             No kidding. Why? You never talk\n             about yesterday.\n\n                           CATCH\n             All my days are the same.\n\nHe keeps staring, waiting. She is chewing a sandwich,\nlooking at him. Finally, she begins -- with no emotion.\n\n                           SHARON\n             Yesterday. Okay. Yesterday we\n             rolled on a 415. Juliette and\n             Sanchez had these four guys\n             against a wall, but they were\n             H.D.B. and definitely unco-op. It\n             got pretty jumpy, but we got them\n             in the car with a couple of\n             bruises and Robby got a sprained\n             wrist, so I did the rest of the\n             shift with a rookie who lost it\n             over a D.B. in Sunset Park, old\n             woman who'd been dead maybe six,\n             seven days, and I usually do all\n             right but the smell got to me, and\n             I can still smell her. Then we\n             arrested a prostitute working out\n             of her home, and I carried her\n             little girl out to the social\n             worker, and the kid was holding on\n             real tight and making my shoulder\n             wet and I wanted to punch her\n             rock-head mother, and then shift\n             ended and I had a nice visit with\n             my brother Larry.\n\nHe is staring at her.     He takes her hands, holds them.\n\n                           CATCH\n                    (softly)\n             I'm sorry. That would make\n             anybody sad.\n\n                           SHARON\n             Sorry you asked?\n\n                                                 (CONTINUED)\n\n                                                          75.\n\nCONTINUED:\n\n                            CATCH\n             No.   No, you can always tell me.\n\nShe stares a moment, then speaks with an irony he doesn't\npick up on.\n\n                           SHARON\n             Well... I feel better now.    You\n             feel better?\n\n                            CATCH\n             I feel fine.   Great.\n\nHe takes off his T-shirt and begins stripping off his\nshorts, his underwear!\n\n                           SHARON\n             What are you doing?!\n\nShe is surprised, smiling, as he plunges into the pond,\nher darkness dissipating.\n\n                           SHARON\n             Catch! There's no swimming here!\n             And you can't be naked in a state\n             park!\n\nHe dives under and surfaces again.\n\n                           CATCH\n             Take the day off, Pogo!\n\n                           SHARON\n             What if a park ranger comes?!\n\nHe dives and surfaces once more.       We STAY CLOSE ON him.\n\n                           CATCH\n             Take your badge off for once.\n             Don't be such a damn Marine about\n             everything. Just...\n\nHe stops because she isn't there. He looks about. Then\nsuddenly he sees her, poised on a boulder right above\nhim, in her underwear about to dive! He yelps and gets\nout of her way, and she dives off the rock in classic,\nnear-professional form, a beautiful, sleek dive. She\nhits the water just right and surfaces, and they splash\nand swim and frolic and dunk each other in unabashed\nplay.\n\n                                                 (CONTINUED)\n\n                                                           76.\n\nCONTINUED:\n\nAt one point she jumps at him to dunk him, and he catches\nher. They are in chest-deep water and their faces are\nclose. They pause -- then she goes in for a kiss, but he\npulls his head back, avoiding that kiss and says...\n\n                           CATCH\n             Someplace I've never been kissed.\n\nShe smiles, staring, then slowly reaches her hands to his\nface, gently closes his eyes and is about to kiss him on\nthe closed lids, but she changes her mind and instead\nputs her lips tenderly on each of the small scars on his\nface. Then she moves away. He opens his eyes. She\nwalks to the shore, moves to her clothes and starts\ngetting dried and dressed, giving him a soft look.\n\nCatch comes to the shore    to dry himself, but as he\ndresses, Sharon glances    at his body -- and the scarring\non his chest and arms.     He is troubled about this,\navoiding her eyes. Then     he makes a decision.\n\n                            CATCH\n             They tell me I was in an accident.\n             Long time ago.\n\n                           SHARON\n             Looks like a bad one.\n\n                           CATCH\n             I don't remember it.    I...\n\nShe waits -- but he says no more. She continues        to\ndress, sliding her shorts over her wet underwear       -- but\nbefore she puts her shirt on, she turns her back       to take\noff her wet bra. He glances at her. She looks         over and\ncatches him glancing. They both smile softly,\nironically, as they finish dressing.\n\n                           SHARON\n             We should be thinking about lunch.\n             We have to pack up.\n\n                           CATCH\n             So soon?\n\n                            SHARON\n             Some of us have to work.\n                    (teasing)\n             You ever work?\n\n                          CATCH\n         Yeah.     I worked.\n\n                                                 (CONTINUED)\n\n                                                            77.\n\nCONTINUED:\n\n                            SHARON\n             Oh?   You remember that?   Working?\n\nShe smiles and walks off toward the food. He stares\nafter her, his smile fading into thoughtfulness, memory,\nas he dresses.\n\n\nEXT. COFFEE HOUSE - DAY\n\nCatch is standing outside, looking in through the large\nwindow, searching. His eyes settle on a man, and he\nstares. The man, about his age, is having coffee and\nreading the paper. Catch is staring deeply, mustering\nhis courage. He walks into the place.\n\n\nINT. COFFEE HOUSE - DAY\n\nCatch hesitates, then walks over and stands beside this\nman until he -- JACK MOLINA -- looks up. Jack beams with\nrecognition and surprise.\n\n                           JACK\n             Catch -- Jesus!\n\nCatch is held back, smiling a bit, but on thin ice here,\ndipping into his past.\n\n                          JACK\n             How are you? Sit down. Been\n             years. You been out of town?\n\n                        CATCH\n                 (sitting)\n          I've been around.\n\nJack's smile clouds as memory kicks in.\n\n                        JACK\n          Oh, man, I'm really sorry about\n          what happened. I never got a\n          chance to say...\n\nCatch, with a steady look, says...\n\n                        CATCH\n          We don't need to go there.\n\nJack nods a moment.\n\n                           JACK\n             Okay. All right. So... what\n             d'you want, a coffee?\n\n                                                   (CONTINUED)\n\n                                                         78.\n\nCONTINUED:\n\n                            CATCH\n             I want my old job back.\n                    (pause)\n             What d'you think?\n\n                           JACK\n             You been workin'?\n\n                           CATCH\n             No, but I'm up to speed.\n\n                           JACK\n                    (thinks)\n             Well, it's not good with Randal\n             anymore.\n\n                           CATCH\n             No?\n\n                           JACK\n             No, he's out of it, but Danny\n             Coley's got something going.\n             Wanna go see 'im?\n\nCatch stares, nods.\n\n                           CATCH\n             Finish your coffee.\n\n\nEXT. PARKING LOT - DAY (LATER SAME DAY)\n\nIn a seedy parking lot, tough part of town, Robby and\nSharon are arresting two teenage girls. One of them is\nleaning on the car as Sharon searches her. Robby stands\nback with the other (cuffed) girl. Robby is staring at\nSharon through this moment -- noting the difference in\nher, still very professional -- but softer. The girl is\nupset, near tears. Sharon is gentle in her search.\n\n                           SHARON\n             I have to check these jacket\n             pockets. What's your name --\n             Allison?\n\nThe girl nods, not trusting her voice.\n\n                           SHARON\n             I need to unsnap this, Allison.\n             I'm checking your waistband. You\n             got to Whitney School?\n\n                           ALLISON\n             St. Mark's.\n\n                                                (CONTINUED)\n\n                                                        79.\n\nCONTINUED:\n\nSharon is searching, Robby is noting all this, his eyes\nappreciating the difference.\n\n                           SHARON\n             Lift your arms higher. Got a good\n             basketball team at St. Mark's.\n             You play basketball?\n\n\nEXT. STREET - NIGHT (LATER THAT NIGHT)\n\nSharon and Robby are still on the job, their unit rolling\ndown a residential street of apartment buildings. A\nparked car is BLASTING MUSIC, and Robby halts beside it.\nSharon starts making dancing moves to the MUSIC, sitting\nthere beside Robby, and he stares at her as she grooves,\nkidding it. Then Robby HITS the HORN to get the driver's\nattention in the parked car. Robby makes a gesture to\nlower the volume, and the man SNAPS OFF his TAPE. Robby\nrolls on, glancing at Sharon. She wears a small smile,\nchecking their beat.\n\n                        ROBBY\n          What's going on, Pogo?    You're not\n          happy or anything?\n\n                        SHARON\n          Well, it's a mix, Robby. Life is\n          shit, but I'm dating this great\n          dead guy.\n\nShe smiles at Robby's look.\n\n                            SHARON\n             He says before I came along, he\n             thought he was dead. Sounds\n             better when he says it --\n                     (stops abruptly)\n             Listen.\n\n                           ROBBY\n             What?\n\n                           SHARON\n             Shhh.   Sh!\n\nRobby stops the unit, rolling the windows down.     They\nhear the FARAWAY SOUND of...\n\n                           SHARON\n             The trumpet player.\n\nRobby pulls over.\n\n                                               (CONTINUED)\n\n                                                        80.\n\nCONTINUED:\n\n                           ROBBY\n             This time we got his ass.\n\nThey exit the car and stand in the street, looking up,\nscanning the dark buildings -- but the sound is hard to\ntrack, a FAINT BALLAD on a skillful HORN.\n\n                             SHARON\n             Wow.\n\n                             ROBBY\n             Got 'im?\n\n                           SHARON\n             Look at that moon.\n\nThey stare at the full moon. In a moment, we hear the\nsound of ROARING CARS, their TIRES SCREECHING as they\nturn onto this street, one car speeding ahead to cut off\nthe other and force it to stop. The two male drivers are\nscreaming at each other. Robby shakes his head.\n\n                           ROBBY\n             Full moon, man. Hey!\n\nThey run toward the drivers who are exiting their cars to\nconfront each other. One big guy carries a baseball bat.\nRobby heads off one DRIVER while Sharon intercepts the\nBAT-MAN.\n\n                           DRIVER\n             This guy's crazy!\n\n                           BAT-MAN\n             This asshole side-swiped me!\n\n                           SHARON\n             Are you McGuire?\n\n                             BAT-MAN\n             What?!\n\n                             SHARON\n             Mark McGuire?\n\n                             BAT-MAN\n             No.\n\n                           SHARON\n             Then put that bat away.   Put it in\n             your trunk. Now.\n\nThe man hesitates, then moves toward his trunk.\n\n                                              (CONTINUED)\n\n                                                            81.\n\nCONTINUED:\n\n                           DRIVER\n             I never touched his car.\n\n                        BAT-MAN\n          You lying bastard!\n\nThe man charges, bat in hand, and Sharon makes a flying\ntackle, bringing him down hard on the street -- and we\nimmediately...\n\n                                                  CUT TO:\n\n\nINT. SHARON'S BEDROOM - NIGHT (LATER)\n\nas she lies on the bed, on her stomach, her top off, and\nCatch straddles her, massaging her back and shoulder\nwhich are sore from her tackle.\n\n                              SHARON\n          Ow.     Ow!\n\n                              CATCH\n         Sorry.\n\n                          SHARON\n         No.     That's good. Deeper.\n\n                       CATCH\n                (as he works)\n         How heavy was this guy?\n\n                              SHARON\n         Like a truck.\n\n                          CATCH\n         God.     Tractor-trailer?\n\n                              SHARON\n         Pickup.        Ow.   Ow! That's really\n         good.\n\nShe begins to moan as he digs out the pain. He is\nfighting against the erotic charge of this, trying to\nkeep it medicinal, but he's got his hands all over her\nnaked back, and she is moaning -- so he stops and takes a\nbreath.\n\n                           CATCH\n             I better... More oil.\n\nHe reaches to the bed table and puts oil on his hands,\nnoticing a card that stands open on the tabletop, a very\npretty invitation.\n\n                                                  (CONTINUED)\n\n                                                             82.\n\nCONTINUED:\n\n                           CATCH\n             This is pretty.\n\n                           SHARON\n             Don't get oil on it.\n\n                           CATCH\n             Renewal of vows -- that's great.\n             Is this your parents?\n\n                          SHARON\n             Yes. Just put it down.   I'm not\n             going.\n\n                           CATCH\n             Why not?\n\nShe doesn't answer. He puts it down, comes back to the\nslow rubbing of her shoulders, her neck. In a moment...\n\n                           SHARON\n             If I go, my brother'll hurt    me\n             with the department. I got     mad\n             and knocked him down. All     they\n             need is a complaint. Just     leave\n             it alone and keep rubbing.     Okay?\n\nShe moans in pleasure as he rubs, trying to push all\nother thoughts away.\n\n                           CATCH\n             So... he says you can't go?\n\n                           SHARON\n             Can't you rub without talking?\n                    (then)\n             It's been bad with my family a\n             long time, so the hell with it\n             anyway. If they don't want me\n             there, I don't want to be there.\n             All right?\n\n                           CATCH\n             All right.\n                    (then, as he works)\n             Bad how?\n\n                           SHARON\n             Oh, Jesus!\n\nBut we see her eyes turn inward toward the old pain and,\nfor once, she shares it.\n\n                                                    (CONTINUED)\n\n                                                          83.\n\nCONTINUED:\n\n                             SHARON\n             My father used to knock us around,\n             all of us. But I'm the one who\n             called the cops -- finally.\n                     (pause)\n             They say I turned against the\n             family.\n\nCatch works in silence a while, absorbing this, looking\nat Sharon with more tenderness than ever. In a moment...\n\n                           CATCH\n             But... they invited you.\n\n                           SHARON\n             You don't know anything about it.\n             So forget it.\n\n                           CATCH\n             Well... I know about family.\n\n                            SHARON\n             Oh, yeah?   What about it?\n\n                           CATCH\n             It's... a door you don't close.\n\n                           SHARON\n             I didn't close the door.\n\n                           CATCH\n             You're closing it now. Right?\n             Family invites you, you go.\n             Family shows up, you welcome them\n             in. That's family.\n\n                          SHARON\n             Oh, sure. What if they don't\n             deserve it?\n\n                           CATCH\n             Then you forgive.\n\n                           SHARON\n             You have all the answers.\n\n                           CATCH\n             No. I just... It seems like a\n             chance, doesn't it? A chance to\n             make things right. I'd take it.\n             Then you tried -- y'know? And\n             it's up to them.\n\n                                                 (CONTINUED)\n\n                                                       84.\n\nCONTINUED:\n\nSharon is considering his words, but she's also deep in\nher old pain, defensive, challenging.\n\n                           SHARON\n             You close with your family?\n\nThat hits him, but he keeps rubbing her, gentle now,\nlooking a little lost. He doesn't answer.\n\n                          SHARON\n          See?    So why should I listen to\n          you?\n\nBut as he works her back in silence, we see her facing\nher pain and thinking through it.\n\n\nINT. SHARON'S APARTMENT - NEXT MORNING\n\nJust after dawn. Catch is on the couch, stirring in his\nsleep, in the grip of an unsettling dream. We hear what\nhe hears: the VOICES of his wife, his son, murmurings.\nWe're not sure of the words, even laughter. Catch's eyes\nsnap open, jolted out of sleep, but the VOICES don't\nstop, and he suddenly sits up. The VOICES FADE as he\ncatches his breath, gulping air. He tries to calm down.\nIn a moment, he rises and moves to Sharon's bedroom.\n\n\nINT. BEDROOM - MORNING\n\nHe comes to the side of the bed and sees that she is\nasleep. He sits on the bed and studies her, his dark\nthoughts dissipating as he watches her sleep, his eyes\ngoing deep. In a moment he begins to raise a hand to\nbrush her cheek -- the way awakened her before -- but he\nstops before touching her. Instead, he brings his face\nclose to her and lightly kisses her.\n\nShe stirs. He kisses her again. She opens her eyes.\nThey stare at each other. She raises a limp hand and\ntouches his face. He begins to come close, slowly, for\nanother kiss. She welcomes it. They kiss on the mouth,\nvery tenderly. They kiss again -- deeper. They kiss\nagain, and she holds him, and he moves fully onto the\nbed, lying over her and supporting his weight on his\nelbows and kissing and kissing and letting go for once,\nhungry for her because she is in his heart now, and she\nis a salvation, and there is a moment when they both\npause and stare clear-eyed, acknowledging what they are\ndoing, and both of them abandon their fear and pain and\nbegin to smile, and they make love that way, smiling, as\nwe slowly...\n\n                                              DISSOLVE TO:\n\n                                                        85.\n\nINT. BLUES CLUB - NIGHT\n\nThe night of that same day finds us at this neighborhoody\nplace with a lot of down-to-earth atmosphere and not a\nlot of noise, like Harvell's in Santa Monica -- earthy\nblues and jazz from a small band in a darkish club, small\ndance floor. We PAN during this slow number and ARRIVE\nAT a few dancing couples, including Sharon and Catch who\nmostly just hold each other and sway. When their eyes\nmeet, there is a lot of deep pleasure there.\n\nThe music ends. The small crowd applauds. Couples head\nback to the tables, but the little band goes right into a\nmore up-tempo but still earthy blues. Sharon stops and\npulls Catch back onto the dance floor. He smiles and\nfollows.\n\nThis number has a driving beat, and, slowly, we watch\nSharon drop her inhibitions and become more and more   free\nout there, and Catch is smiling and wowed by her, and   she\nlaughs, wowing herself, and she keeps going, getting   wild\nand playful, and it's something to see. We LINGER ON    the\njoy and abandon. She's earned it. They go a little\ncrazy, happy crazy, and in a while we...\n\n                                              DISSOLVE TO:\n\n\nSAME - HOURS LATER\n\nThe blues club is emptying out. It's late. The band is\nfinishing what seems to be its last number, for the last\nof thinning crowd -- including a tired, happy Sharon and\nCatch who applaud the end of the number. Catch stares at\nher.\n\n                        CATCH\n          What's your favorite song?\n\nHe rises -- as if to go to the band with a request.     She\nsmiles, spent.\n\n                        SHARON\n          Catch, I'm beat. So are they.   I\n          think they're finished.\n\n                         CATCH\n          One more.   It's a surprise.\n\nShe watches as he leaves her, walks to the bandstand.     He\ntalks to the leader who is the PIANO PLAYER.\n\n\nSHARON'S POV\n\nFrom the instrument cases on the floor behind the piano,\nCatch picks up a trumpet case, opens it. Now Sharon's\ntired smile is changing to curiosity, wonder.\n\n                                                       86.\n\nON CATCH\n\nAs he puts the mouthpiece on the horn, nervous, but\nexcited, too, speaking to the Piano Player.\n\n                             CATCH\n            Thanks, Danny.\n\n                          DANNY (PIANO PLAYER)\n            Gonna be good having you back,\n            Catch.\n\nCatch comes to the edge of the bandstand, grinning a bit\nat Sharon, at his surprise for her, nervously fingering\nthe horn. He puts it to his lips.\n\n\nON SHARON\n\nMouth-open surprise -- and then smiling with the wonder -\n- and Catch begins to play, closing his eyes and\nrendering a ballad, like the haunting \"ANGEL EYES.\"\n\nSharon's smile slowly fades, replaced by a much deeper\nlook, not only because he is so good, but because he is\nshowing her his heart, his love and even his pain -- more\nthan he can show her any other way. We INTERCUT as he\nopens his eyes briefly, watching her, sending her the\nmusic, closing his eyes again to fall into the song -- as\nSharon's eyes fill at the beauty and sadness of it, and\nat this look inside her man. We LINGER. Then...\n\n                                             DISSOLVE TO:\n\n\nEXT. CLUB - NIGHT\n\nWe keep the sound of CATCH'S TRUMPET going as he and\nSharon exit the club and begin to stroll away, arms\naround each other. In a moment, he stops. He can't go\nanother step. He has to kiss her. He holds her face and\ncomes in for the kiss, and above the music we hear her\nsay softly.\n\n                          SHARON\n            Where I've never been kissed.\n\nHe stops and stares a moment, then takes her hand and\nwalks her out into the middle of the traffic-less\nboulevard and there, in the center of the street, kisses\nher, and she responds, and it is their finest, fullest\nmoment, lifting on the MUSIC, and it is ironic and\nprophetic that at its peak they are washed over by the\nrevolving light from a police car and a SIREN that CHIRPS\nonce as they break, staring.\n\n                                             (CONTINUED)\n\n                                                        87.\n\nCONTINUED:\n\n                           SHARON\n             Oh, God.\n\nWe WIDEN to see Ray and Sanchez in their police unit 20\nfeet away. Ray uses a small electronic bullhorn to\nsay...\n\n                           RAY\n             Are you in danger there?\n\n                           SHARON\n             Go away.\n\n                           RAY\n             I was talking to him, Pogo.\n\n                        CATCH\n          No thanks, Ray. Everything's code\n          four. Go away.\n\nSharon laughs aloud and walks (with Catch in hand) to the\npolice car, her joy overwhelming any embarrassment. She\ngestures behind them at the jazz club.\n\n                        SHARON\n          See that place? He's going to be\n          playing there every weekend.\n\nCatch notes the pride with which she says this.\n\n                        RAY\n                 (impressed; to Catch)\n          Oh, yeah? What d'you play?\n\n                        SHARON\n          It's music, Ray. You wouldn't\n          like it.\n\nShe waves and walks off with Catch, arms around each\nother. The cops watch them go.\n\n                                              DISSOLVE TO:\n\n\nINT. CATCH'S BEDROOM - DAY (NEXT MORNING)\n\nSharon is asleep, alone in the tousled bed.\n\n\nINT. LIVING ROOM - MORNING\n\nCatch is dressed, putting a leash on Bob, glancing into\nthe bedroom at Sharon.\n\n                                              (CONTINUED)\n\n                                                     88.\n\nCONTINUED:\n\nThere is love in his look, and then a passing question,\ntoo, a residue of fear now that their relationship has\nbegun in full -- but it all ends up in a soft smile for\nher as he walks Bob to the door. He hesitates at the\ndoor -- then walks into the kitchen and slides open that\ndrawer of toys, stares at them.\n\n\nINT. BEDROOM - MORNING (MINUTES LATER)\n\nSharon is waking, sleepy. She rises, finds a robe and\nslips it on, calling out softly for Catch.\n\n\nINT. LIVING ROOM - MORNING\n\nSharon sees that Catch and Bob are gone. She drifts to\nthe window, looks at the day, looks down at the street --\nand she sees them.\n\n\nSHARON'S POV\n\nShe sees Catch and Bob on their way into the park across\nthe street from the building.\n\n\nON SHARON\n\nShe smiles and moves into the bedroom to dress.\n\n\nEXT. CITY PARK - DAY (MINUTES LATER)\n\nCatch is walking Bob in the park, but is also checking\nfor someone, studying the playground. He begins walking\ntoward the swings.\n\n\nANGLE - SANDBOX\n\nTommy, Catch's neighbor, is playing in the sand with a\nmetal truck. Catch walks up to Tommy, carrying a bulging\nplastic bag -- but Tommy's attention is on Bob, and pets\nthe big, friendly dog.\n\n\nANGLE - CANDACE\n\nShe sits on a bench nearby, watching this, smiling a bit.\n\n                                                     89.\n\nON CATCH, TOMMY\n\nCatch kneels in the sand, beside the boy, and he spills\nout the contents of the bag -- action figures,\nsuperheroes, soldiers. Tommy goes wide-eyed at the\narray. Catch is pleased by the boy's reaction. Catch\nkeeps a layer of emotion covered here.\n\n                         CATCH\n           You like these?\n\n                         TOMMY\n           Yeah!\n\n                         CATCH\n           Well... They're for you. We can\n           pretend it's your birthday.\n\nTommy stares at him, then back at the toys in delight.\nCandace is walking toward them, and Catch turns to her.\n\n                         CATCH\n           I hope you don't mind.\n\n                         TOMMY\n           They're for me, Mom!\n\nHer look of surprise questions him.\n\n                        CATCH\n           Yeah. I've... kind of been saving\n           them up.\n\n                         CANDACE\n           For Tommy?\n\nHe nods. She kneels close to her boy, the toys, pleased\nbut not quite knowing what to say.\n\n                         CANDACE\n           Well, thank you. Thanks a lot.\n\nCatch nods, grins at Tommy who is already at play with\nthe figures.\n\n\nANGLE - SHARON\n\nShe has entered the park and witnessed this from a\ndistance. She is angling toward the playground.\n\n\nON CATCH\n\nHe watches Tommy at play with the figures, but it's\nalmost too much for him. He touches the boy and rises,\nsmiles and nods at Candace and begins to walk off.\n\n                                                           90.\n\nON SHARON\n\nShe hurries her steps to intersect with Catch.\n\n\nON CANDACE, TOMMY\n\n                          CANDACE\n            Wow, Tommy -- Look at them all.\n            Did you say thank you?\n\nNow Tommy looks up. Catch is moving away with Bob,\nwalking home. Tommy stands up, Candace calls out to stop\nCatch.\n\n                             CANDACE\n            Excuse me!\n\n\nON CATCH\n\nBut he is walking on, some of the emotion seeping\nthrough, not darkness, some old joy welling up. We see,\nin b.g., Tommy starts to run after him to say thanks. We\nnow have a convergence of Tommy, Sharon and Catch, who is\nmoving steadily toward the street, crossing a bike path\nnow. A BIKER is coming on. All in one moment Catch\nhears the WHIZZ of the BIKE, Tommy calling out \"Thank\nyou,\" and Candace shouting \"Be careful!\" And Catch goes\ncold inside and turns quickly and rushes onto the bike\npath, taking the collision with the bike so Tommy is sure\nto be safe. Catch and the biker fall hard. Sharon stops\n-- holding her breath. Tommy watches, wide-eyed, and\nCandace comes running.\n\nCatch is rising, a little sore and soiled.        The biker is\nangry.\n\n                          BIKER\n            Goddammit -- I saw the kid.\n            Jesus. I wasn't even close.\n\nBut Catch is walking     away with that frozen, numb look,\nall shut down by his     fear and his memory as Bob trots\nalong beside him and     the Biker comes after him and Tommy\nand Candace watch him     go and Sharon hurries her steps to\ncatch up. The Biker      reaches Catch first.\n\n                             BIKER\n            Wait a minute!     Hey!\n\nBut Catch won't turn to him, walking on -- and the man\ngets in front of him, raging.\n\n                                              (CONTINUED)\n\n                                                          91.\n\nCONTINUED:\n\n                           BIKER\n             Why the hell did you cause a\n             wreck?! I told you -- I saw the\n             kid, you idiot. I was...\n\nPain and darkness build in Catch's eyes until he says in\na quiet, choked voice, right into the Biker's face...\n\n                           CATCH\n             One more word, and your life will\n             change forever.\n\nThe man stops talking, looking at the dead certainty in\nCatch's eyes. He wants to say more, to save face, but\nCatch's look holds him like a fist. Sharon has stopped,\nfrozen, watching. The Biker turns away and walks back to\nhis downed bike as Catch moves on. Sharon can hardly\nbelieve all of this, following Catch again.\n\n\nON CATCH, SHARON\n\n                               SHARON\n             Catch!   Catch!\n\nIt takes a moment for her voice to penetrate, then he\nquickly turns and sees her approaching.\n\n                           SHARON\n             Are you all right? Your elbow's\n             bleeding. I...\n\nBut he is tight, nearly frozen, everything held in.\n\n                               SHARON\n             What's wrong?\n\nHe walks away from her, and this shakes her, and she\ncatches up again.\n\n                           SHARON\n             Where are you going? Catch --\n             you're scaring me. Please...\n\nBut he walks on, desperate, and she gets in his way,\nfaces him.\n\n                           SHARON\n             Please, Catch, don't... Can't you\n             talk to me?!\n\nHe turns and walks off, heading for the street.\n\n                                                 (CONTINUED)\n\n                                                               92.\n\nCONTINUED:\n\n                               SHARON\n             Please.   Wait.     I... Catch!\n\nHe has walked into traffic -- not completely unmindful of\nthe cars, but desperate to get away. She watches this,\nfrozen, as HORNS BLARE. He has to stop in the middle of\nthe street to wait a moment, and he stands there,\nstricken.\n\n\nON CATCH\n\nAs the traffic moves around him and the dog -- a HORN\nBLARES, BRAKES SCREECH, and he thrown into a storm of...\n\n\nFLASHBACKS\n\nThat come sharper and faster than before, bits and pieces\nof memory outside any order: He is driving, Annie smiles\nat him, headlights blind him, Annie screams, the little\nboy in Annie's arms grins at him, BRAKES SCREAM, Annie\nsays something to him, calmly, but he can't hear her, the\nheadlights blind him again and BRAKES SCREAM again, and:\n\n\nBACK TO SCENE (PRESENT)\n\nCatch stands there shaken and shut down.\n\n\nON SHARON\n\nWatching him, shocked and frightened for him. She sees\nthe traffic let up, and Catch crosses and walks toward\nhome. She watches him go.\n\n\nEXT. BUSY STREET - DAY (LATER)\n\nAs Robby and Sharon's police unit moves along with\ntraffic. In a moment they pull over and park beside an\noffice building. It is the same building the man entered\nshouting, \"Catch!\" Sharon watches the building's\nentrance. After a while...\n\n                           ROBBY\n             Are you going to tell me why we're\n             sitting outside this building\n             again?\n\n                          SHARON\n            Watching for somebody.       Tall guy.\n            40s. Grey-blond hair.\n\n                                                     (CONTINUED)\n\n                                                           93.\n\nCONTINUED:\n\n                           ROBBY\n             What's it about?\n\n                              SHARON\n             It's personal.\n\n                           ROBBY\n             Fine -- what am I supposed to do?\n\n                           SHARON\n          Chill.\n\nShe watches the building, studying the people who come\nand go.\n\n\nINT. CATCH'S APARTMENT - DAY\n\nCatch is at home, still shaken by what happened to him in\nthe park. He reaches for the PHONE, punches in a number.\nIt RINGS and Elanora Chu picks up. Catch is deep in his\npain.\n\n                           ELANORA (V.O.)\n          Hello?\n\n                           CATCH\n                    (softly)\n          Hi.\n\n                        ELANORA (V.O.)\n          Hi! How are you? Have you been\n          out in this great afternoon?\n          Brenda took me for a walk.\n\nShe senses the silence on the other end and quiets a bit.\n\n                        ELANORA (V.O.)\n          Anything wrong?\n\n                        CATCH\n          I've been... remembering.\n\nShe is quiet for a moment.\n\n                        ELANORA (V.O.)\n          Catch... This is good.\n\n                           CATCH\n          It's awful.\n\n                           ELANORA (V.O.)\n          No.     No, there's good to remember.\n\n                                                 (CONTINUED)\n\n                                                         94.\n\nCONTINUED:\n\nHe doesn't speak, shakes his head.\n\n                              ELANORA (V.O.)\n             Catch?\n\n                              CATCH\n             I'll call you.\n\nHe hangs up, staring at his thoughts.\n\n\nEXT. BUSY STREET - DAY\n\nSharon is still staking out the office building. Robby\nis fidgeting. She just keeps watching. When Robby\nbegins to speak, she puts up a hand to stop him, going\nvery still, staring out the window at the man who Catch\nwas afraid of, Richard Pindella. The man enters the\nbuilding. Sharon gets out of the car, intense...\n\n                           SHARON\n             Give me fifteen.\n\nAnd she hurries after the man.\n\n\nINT. OFFICE BUILDING - DAY\n\nAs Sharon enters, sees the man at the elevators. He gets\ninto an elevator, and she just misses him. She watches\nthe elevator indicator. It stops at two. She hurries up\nthe stairs.\n\n\nINT. CORRIDOR - DAY\n\nAs Sharon bangs into a hallway through the stairway door.\nShe looks one way, looks the other way down the long\nhall, and sees the man just entering a door. She walks\nto that door. It is marked \"private.\" She knocks and\nwalks in.\n\n\nINT. OFFICE - DAY\n\nShe enters a comfortable office, many shelves, books,\ncouch and chairs, big desk. She hears the man's voice\nfrom an anteroom. He's coming toward her.\n\n                           PINDELLA (O.S.)\n             Excuse me -- that's a private\n             entrance...\n\nHe sees her now, sees the uniform.\n\n                                               (CONTINUED)\n\n                                                           95.\n\nCONTINUED:\n\n                           PINDELLA\n             Oh... is there a problem?\n\nHe's calm, gentle in the eyes. She stares a moment,\ntrying to keep her emotions undercover.\n\n                             SHARON\n             I'm not sure.    Who am I speaking\n             to?\n\n                           PINDELLA\n             I'm Dr. Pindella.\n\nShe takes her time, afraid.\n\n                           SHARON\n             What kind of doctor?\n\n                             PINDELLA\n             What is this?\n\n                           SHARON\n             Do you know a Catch Lambert?\n\n                             PINDELLA\n             Oh.   Yes!   Is he in trouble?\n\n                           SHARON\n             I... need to talk to you.\n\nHe glances at his watch, worried for Catch.\n\n                           PINDELLA\n             Well, I have a patient in five\n             minutes. But I can...\n\n                             SHARON\n             Are you a...?\n\n                           PINDELLA\n             I'm a psychiatrist.\n\n                           SHARON\n             And Mr. Lambert...\n\n                           PINDELLA\n             My relationship with Mr. Lambert\n             is confidential.\n\nShe's dying inside -- but covering, lying, forcing her\nway into this.\n\n                                                  (CONTINUED)\n\n                                                          96.\n\nCONTINUED:\n\n                           SHARON\n             He's your patient. He's your\n             patient we... know all this. This\n             is police business. I'm officer\n             Sharon Pogue -- L.A.P.D.\n\n                           PINDELLA\n             Look... I want to help Mr. Lambert\n             but I can't tell you anything that\n             isn't public record.\n\n                           SHARON\n             In general. In general.   He's\n             your patient, and he...\n\n                           PINDELLA\n             He's not my patient. He walked\n             away from treatment. That was...\n             nearly a year ago.\n\n                           SHARON\n             Why did he walk away?\n\n                           PINDELLA\n             I can't discuss that, but if you\n             know how to reach him, I would\n             appreciate being able to talk to\n             him.\n\n                        SHARON\n                 (desperate)\n          You can help by just   telling me\n          what's in the public   record.\n          It'll take me half a   day to do a\n          search. Can you tell    me? Just...\n\nShe is unable to play this out as a \"cop,\" her emotions\ncoming through. Pindella sees this. She sits on the\nedge of a chair and takes a breath, speaks more softly.\n\n                        SHARON\n          Can you please tell me what's in\n          the record?\n\nHe stares a moment, sympathetic -- and realizing...\n\n                        PINDELLA\n          You were with him -- in the car.\n          Your uniform threw me. Are you\n          his friend?\n\nShe looks at him, nods.\n\n                                                (CONTINUED)\n\n                                                               97.\n\nCONTINUED:\n\n                              SHARON\n             More.\n\nHe takes that in, leans back on the desk.\n\n                           PINDELLA\n             I can tell you he was in an\n             accident, hospitalized, referred\n             to me as an outpatient...\n\n                              SHARON\n             What accident?\n\n                           PINDELLA\n             A bus... a city bus hit his\n             vehicle. That was a couple of\n             years ago. It was... an awful\n             thing. His family was in the van.\n             His wife and child. His wife's\n             parents...\n\n                           SHARON\n             A bus... and a van. Where?        On...\n             the freeway?\n\nSomething is pulling at her memory. Her vision turns\ninward, and she stops breathing for a moment --\nremembering. She was there. And here we get a...\n\n\nFLASHBACK - CARNAGE\n\nA glimpse of the carnage -- what she saw, first on the\nscene -- with Catch lying there. All the while Pindella\nis speaking.\n\n                           PINDELLA (V.O.)\n             I think so. Yes. Near Santa\n             Monica.  On the freeway. He was\n             severely injured but... thrown\n             clear.  The others were trapped in\n             the van.\n\n\nBACK TO SHARON (PRESENT)\n\nstill in shock, looks at Pindella again.\n\n                            SHARON\n             Survivors?   Only him?      I... don't\n             remember.\n\n                              PINDELLA\n             Remember?\n\n                                                      (CONTINUED)\n\n                                                          98.\n\nCONTINUED:\n\n                            SHARON\n                     (quietly)\n             Yes.   I was there. I was there.\n\nPindella stares, then...\n\n                           PINDELLA\n             His wife's mother survived, but...\n             she was paralyzed.\n\nShe takes a moment, absorbing this.\n\n                            PINDELLA\n             Elanora Chu.   She's still in town,\n             I believe.\n\n                           SHARON\n             Does he... still see her?\n\n                            PINDELLA\n             He used to. I don't know.\n                    (pause)\n             I'm glad to see... he has someone\n             else who cares about him. I know\n             he's running from this. He left\n             all his friends, his home, his\n             whole life.\n\n                           SHARON\n             He says... he doesn't remember the\n             accident.\n\n                           PINDELLA\n             He lost a lot of memory. I tried\n             to help him with that. He\n             resisted. Walked away.\n\nShe stares.\n\n                           SHARON\n             I think he remembers me.\n\nVery subdued now, she asks...\n\n                           SHARON\n             How does he live?\n\n                        PINDELLA\n          He received a large settlement\n          from the city, but he...barely\n          touches it. He was a professional\n          musician.\n\nShe stares at him and nods.\n\n                                                (CONTINUED)\n\n                                                          99.\n\nCONTINUED:\n\n                          SHARON\n             Trumpet.\n\nAs he says that, we hear our TRUMPET MUSIC begin -- a\nfast and furious MUTED TRUMPET, incredible RIFFS, and we\nuse this to carry us, as we...\n\n                                                DISSOLVE TO:\n\n\nINT. POLICE HEADQUARTERS - DAY\n\nSharon is in the report room, using the computer,\nhunting. We MOVE AROUND to see her and the screen. She\nis searching the police records to find the accident.\nThe CONTINUING TRUMPET RIFFS are the motor for this. She\nsuddenly stops as we FOCUS ON the name: \"LAMBERT.\" Then\nwe watch her as she punches up the data and she reads.\n\n                                                DISSOLVE TO:\n\n\nINT. SHARON'S APARTMENT - NIGHT\n\nWe MOVE THROUGH Sharon's nearly dark apartment, its\nstillness in strange contrast to the manic TRUMPET RIFFS.\nWe PAN to find her curled in a chair, staring deeply,\nsadly, drinking a drink. As we PAN, we DISCOVER she is\nlooking at that mural of the mountains and through this\nto her thoughts, and then she makes a decision and rises\nand goes to the phone, punches in a number.\n\n\nINT. CATCH'S BEDROOM - NIGHT\n\nHe is sitting on his bed, back against the headboard,\nsitting there fully dressed, shoes and all, knees up --\nas he plays his muted trumpet, hard and fast, playing the\nincredible riffs we've been hearing, playing in a driven\nway, keeping his demons away. When the RING of the PHONE\nbreaks through, he stops suddenly. He waits. His\nMACHINE CLICKS ON and BEEPS. We INTERCUT the call as\nSharon's voice comes on, subdued.\n\n                           SHARON\n             Catch, it's me. Can you pick up?\n\nBut he sits there, waiting, listening.\n\n                           SHARON\n             Why don't we... meet tomorrow?\n             I'll be in Westwood. Can you meet\n             me there? Westwood and Cole.\n             About two o'clock. Okay?\n\n                                                (CONTINUED)\n\n                                                           100.\n\nCONTINUED:\n\nHe sits there. He slowly puts the horn down. He reaches\nfor the phone now -- but she hangs up before he picks up\nthe call.\n\n                                                 CUT TO:\n\n\nEXT. WESTWOOD STREET - CORNER - NEXT DAY\n\nCatch waits on a busy street corner in Westwood Village\nnot far from Santa Monica. He is waiting, glancing over\nthe passing crowds for Sharon. He sees her. She is off\nduty, out of uniform. He watches her until she spots\nhim. She smiles a little, but there is a mix of fear and\nsadness in her smile. They walk to each other and stop\nand hug, but it is brief, and then she keeps walking\nslowly, and he walks beside her. There is a strain\nlingering between them.\n\n                           CATCH\n             Shar, I'm sorry about yesterday.\n             I...\n\n                            SHARON\n             That's okay.\n\n                           CATCH\n             It's hard to explain, but it's...\n             I'm okay now.\n\n                           SHARON\n             You don't have to explain.\n\nHe glances at her, wondering, walking along.\n\n                           CATCH\n             So... why'd we meet here?\n\n                           SHARON\n             So you're the trumpet player who\n             was waking people up -- on my\n             beat.\n\nThey walk along in silence a moment.\n\n                           CATCH\n             I used to practice late...\n             outside. On my roof.\n\n                           SHARON\n             On your roof? That's why we\n             couldn't find you.\n\n                                                 (CONTINUED)\n\n                                                          101.\n\nCONTINUED:\n\n                           CATCH\n             I didn't know it bothered anybody\n             until you mentioned it. You\n             arresting me?\n\nThey smile nervous smiles. She walks on, leading him\nsomewhere. He looks about, beginning to show some\nagitation, but covering it.\n\n                        CATCH\n          You going to tell me where we're\n          going?\n                 (as she doesn't\n                  answer)\n          That's okay. I mean... I'll go\n          anywhere with you, Shar. Jaws of\n          death. The mall on a Saturday.\n          Just about any...\n\nHe slows his steps, looking across the street and down\nhalf a block...\n\n\nHIS POV\n\nWe see an ivy-covered brick building there, with a sign\nthat is too far away for us to read.\n\n\nON CATCH AND SHARON\n\nHe looks quickly away from that building.       She sees his\ngrowing agitation.\n\n                        SHARON\n          You can trust me, you know.\n\nShe takes his hand.\n\n                        SHARON\n          I've got you now. I'm holding on\n          -- like before.\n\n                        CATCH\n          What d'you mean?\n\n                           SHARON\n             Like I held you before.   Like I\n             did -- at the accident.\n\nHe suddenly pulls his hand out of hers, shocked, and it\nshakes her.\n\n                                                 (CONTINUED)\n\n                                                          102.\n\nCONTINUED:\n\n                           SHARON\n             What makes it so... unspeakable,\n             Catch? What makes it like that?\n\nHe begins to shut down, to grow cold and numb and not\nhear this.\n\n                           SHARON\n             Is it because you were driving?\n\nHe turns away, closing his eyes.\n\n                           SHARON\n             I read the reports, and it wasn't\n             your fault. It wasn't. Is it\n             because you survived and they\n             didn't?\n\nShe puts her hand out for him again.\n\n                           SHARON\n             Catch. Please. Hold on, and\n             we'll go in there together...\n\nHe does not take her hand, so she takes his and walks a\nfew steps toward that building.\n\n                           SHARON\n             You can talk to them. You can say\n             goodbye or I love you or\n             whatever...\n\nHe pulls his hand away again, more violently, a layer of\nrage over his pain.\n\n                           CATCH\n             This is wrong! It's wrong!   Why\n             are you doing this?!\n\n                            SHARON\n             To help you.\n\n                           CATCH\n             I don't need your help! I don't\n             need this. We don't need this --\n             we're fine...\n\n                           SHARON\n             We're not. We're not fine, Catch.\n             Nothing is fine -- no matter how\n             much you pretend.\n\nIt is as if she's fighting for his life again -- and her\nown.\n\n                                                 (CONTINUED)\n\n                                                          103.\n\nCONTINUED:\n\n                           SHARON\n             You pretend that nothing happened.\n             You walk all over the city helping\n             people, but you're dying inside.\n\n                           CATCH\n             I'm not dying! I'm not\n             pretending! I don't remember! I\n             don't remember any of it. So\n             leave me alone! What good does it\n             do? It's gone! And I'm all right\n             this way! Why do you have to\n             change it? I'm all right.\n\nShe points at the building across the street.\n\n                           SHARON\n             Then walk in there.\n\nHe can't even look at the place.\n\n                           SHARON\n             Walk in there, and I'll walk in\n             with you. Walk in there and say\n             it's real -- what happened is\n             real. Your family died.\n\n                           CATCH\n             Don't talk about that!    Don't!\n\n                       SHARON\n                (breaking down)\n         All right -- you talk about it!\n         You tell me your family died and I\n         say yes, I know, I'm sorry, and\n         you say, I loved them... and I\n         say, what an awful thing to lose a\n         family...\n\n                       CATCH\n                (unravelling)\n         Damn you, Shar. Damn you -- why\n         won't you stop?!\n\n                           SHARON\n             So you can have a life!\n\n                       CATCH\n         I have a life! We could have a\n         life. We could get up and go to\n         work and come home to each other\n         and never, never talk about\n         before. We don't need to do that!\n         Why do we need to do that?!\n\n                                                (CONTINUED)\n\n                                                          104.\n\nCONTINUED:\n\n                           SHARON\n             Because it happened! Because it's\n             the truth! I'm sorry. I'm so\n             sorry it happened, but...\n\n                           CATCH\n             Nothing happened! If we say it,\n             then that's the truth, that can be\n             the truth. Say it. Nothing\n             happened. Say it, Shar.\n\n                           SHARON\n             Catch -- take my hand.    Please.\n\n                             CATCH\n             Say it!    I'm asking you to say it.\n\nHer tears come, and she shakes her head.\n\n                             SHARON\n             I can't.\n\n                             CATCH\n             Why not?\n\n                           SHARON\n             Because I want it too much. I\n             want everything with you. I want\n             all of you -- not just the part\n             that isn't hiding and running\n             away...\n\n                             CATCH\n             Why are   you pushing so hard? Why\n             does it   have to be your way? Why\n             does it   have to be your truth?\n             This is   who I am! This is the way\n             I am!\n\n                           SHARON\n             Not anymore. It doesn't have to\n             be this way anymore because you're\n             not alone -- because we're the\n             family now. We can be the\n             family...\n\n                           CATCH\n             You like to push people, don't\n             you? You just have to push and\n             shove and make it right for you --\n             for you. You push everybody,\n             Shar. You even pushed your family\n             away, didn't you?\n\n                                                 (CONTINUED)\n\n                                                            105.\n\nCONTINUED:\n\nHe has stung her. The tears are in her throat.         She has\nto take a moment, but she pushes through to say\nquietly...\n\n                           SHARON\n             I just... want to say...\n\n                           CATCH\n             You already said it.   You said it\n             all.\n\n                           SHARON\n             When you're ready, I'll be there\n             for you. I just want to say that.\n\nAnd she turns and walks away. He watches her go, angry,\nscared and sorry for what he said. He takes a few steps\nafter her, wanting to call out and to stop her. We see\nhim almost call to her. He is coming apart, watching\nher, needing her so much, but unable to call out.\n\nHe is shaky. He takes a glance at that building, then\naway. He stares after Sharon -- but she's out of sight\nnow. He steels himself, then looks across the street\nagain at that building.\n\nHe is desperately afraid. He stares at the building a\nlong while. He begins to cross the street. He makes\nfists to keep from shaking. He walks to the entrance.\n\n\nEXT. BUILDING - DAY\n\nThis is the \"Wellston Memorial Chapel and Mausoleum.\"\nThe sign is on one of the brick pillars. The iron gate\nis open. He can't walk in there. He just can't. He\nwalks away quickly, as if escaping.\n\n\nEXT. POLICE BUILDING PARKING LOT - NEXT DAY\n\nThe new shift    of cops is heading for its cars -- Sharon\nand Robby, Ray    and Sanchez, others. The mood is relaxed,\nteasing talk,    but Sharon is way down. She tries to push\nher mood away    and tough through it.\n\n                           RAY\n             Rib House after shift today?\n             4:30?\n\n                           ROBBY\n             I think I'll head home.\n\n                                                  (CONTINUED)\n\n                                                        106.\n\nCONTINUED:\n\n                            RAY\n             Pogo?   Bring your friend.\n\n                           SHARON\n             No, I think I'll turn vegetarian.\n\n                        RAY\n          Gotta have that meat to keep your\n          strength up.\n\n                        SHARON\n          How come it's not working for you?\n\nThere is a scattering of laughter -- almost by rote -- as\nSharon enters her car without even the hint of a smile.\nRobby notices. She just punches up the CAD monitor, all\nbusiness. Our TRUMPET MUSIC comes in, aching now, and\ntakes us into...\n\n\nINT. SHARON'S APARTMENT - NIGHT\n\nShe is exercising on the machine, sliding into her\ncrunches, fast and furious, but all the pain and sorrow\nis in her eyes, and in a moment she just stops. The\nTRUMPET MUSIC KEEPS GOING ON through this. She looks\nover at the phone.\n\n\nINT. CATCH'S APARTMENT - NIGHT\n\nWe PAN OVER Bob-the-Dog, watching something. We see a\nfew scattered sheets of music lying about, hearing\nRUSTLING, and we ARRIVE AT Catch, seated on the floor,\nshuffling through a stack of sheet music, driven, looking\nfor something. The PHONE RINGS. He ignores it. He is\nopening up each chart of music, shaking it out,\nsearching.\n\nSharon's voice comes on his machine, almost hollow with\nsorrow.\n\n                         SHARON (V.O.)\n          Catch.  Can you... pick up?\n                 (pause)\n          Will you call me?\n\nHe keeps searching, seeming to not even    listen. The\nMACHINE CLICKS OFF. He shakes the next     music chart and\nsomething falls out. He stares at this     piece of paper,\npicks it up, slowly turns it over. It     is a picture of\nhimself, a man blowing a horn, drawn in    crayon by a four\nor five-year-old. Catch stares at this     with a depth that\ngoes on forever, as the MUSIC ENDS.\n\n                                                       107.\n\nEXT. STREET - NEXT DAY\n\nSharon and Robby are rolling to a stop in a strip mall\nparking lot, exiting their car. No rush. She's still\nvery downbeat. As they walk from the car, he keeps\nglancing at her, concerned for her.\n\n                         ROBBY\n          Pogo...?\n\nShe puts up a hand to brush all the words away. She\ncan't talk about it. She pushes through it by doing the\nwork.\n\n                        SHARON\n          Which store is it?\n\n                        ROBBY\n          The little market there. They\n          came through a back window last\n          night. Mostly vandalism...\n\nThey walk on, but as Sharon reaches the sidewalk, a\nlittle child, three years old or so, toddles out the door\nof a shop. A SKATEBOARDER is rattling along, and Sharon\nmakes a grab for the child, taking his arm gently...\n\n                         SHARON\n          Whoa...\n\n... and pulling him to safety as the Skateboarder passes\nby shouting...\n\n                         SKATER\n          Sorry!\n\nAnd now the WORRIED MOTHER is emerging from the shop...\n\n                        WORRIED MOTHER\n          Oh, God, thank you. Billy!\n\nShe picks up her boy, walks back into the shop. Sharon\nstands there -- as it all blooms inside of her, rocks\nher, really, this little act, evoking Catch, who he is,\nwhat he said and what he means to her. Robby is a few\nsteps ahead, waiting for her, but she can't move yet,\nlooking around her now at the people walking among the\nshops and cafes. She picks one. She catches the eyes.\nShe gives a brief smile. The smile is answered, shyly,\nkindly, the person moves on.\n\n                         ROBBY\n          Pogo?\n\nShe doesn't move for a moment.    Then she turns to Robby.\n\n                                             (CONTINUED)\n\n                                                          108.\n\nCONTINUED:\n\n                           SHARON\n             There's something I have to do.    I\n             need an address and phone.\n\n                           ROBBY\n             What's the name?\n\n                            SHARON\n             Elanora Chu.\n\nRobby looks at her, then nods, giving her this.\n\n                            ROBBY\n             Let's do it.\n\nThey walk back to the car.\n\n\nEXT. UPSCALE RESIDENTIAL STREET - DAY\n\nWe see Sharon walking quickly from her police car to the\nfront of Mrs. Chu's home. Robby waits in the unit.\n\n\nEXT. CHU HOME - DAY\n\nSharon walks under that covered portico to the front\ndoor, but before she rings the bell, a voice startles her\na bit.\n\n                            ELANORA (O.S.)\n             Pogo?\n\nMrs. Chu emerges from the shadows of the portico, rolling\nher wheelchair toward Sharon. She has a smile for her --\nbut with some reserve.\n\n                           SHARON\n             I'm Sharon Pogue. I know all\n             about the...\n\n                            ELANORA\n             Elanora.\n\nSharon nods, very held back.        She gestures toward the\nwheelchair self-consciously.\n\n                           SHARON\n             I'm sorry for... what happened.     I\n             know about the accident.\n\n                           ELANORA\n                    (hopeful)\n             He told you?!\n\n                                                 (CONTINUED)\n\n                                                           109.\n\nCONTINUED:\n\n                          SHARON\n             No. I found out, and... I\n             remembered. I was there.\n\n                              ELANORA\n             Oh.   Yes.\n\nSharon stares a moment, begins with some of her tough\ncover in place, over her emotions.\n\n                           SHARON\n             I guess he comes here a lot -- to\n             talk to you.\n\n                           ELANORA\n             He shops for me. Twice a week.\n\n                           SHARON\n             Oh. And when he comes here -- he\n             never mentions the past, never\n             talks about the accident?\n\n                              ELANORA\n             No.\n\n                           SHARON\n             And you... let him do that?    All\n             this time? Why?\n\n                           ELANORA\n             It's what he needs.\n\n                           SHARON\n             Walking all over the city like...\n\n                              ELANORA\n             Like an angel.     Yes. Sweet man.\n\n                           SHARON\n             But... you let him get so lost.\n\nElanora is a bit defensive now.\n\n                           ELANORA\n             I let him find his own way through\n             it. Why did you come here,\n             Sharon?\n\n                           SHARON\n             Because... I want to know how to\n             help him.\n\n                           ELANORA\n             You are helping him.\n\n                                                  (CONTINUED)\n\n                                                         110.\n\nCONTINUED:\n\n                           SHARON\n             I don't think so.\n\n                              ELANORA\n             Why not?\n\n                           SHARON\n             He... he was paying me back, I\n             guess, for the accident, for\n             helping him. That's why he\n             felt... so close to me. But...\n\n                           ELANORA\n             Is that what you think?\n\n                           SHARON\n             But now he probably hates me.\n             I...\n\n                              ELANORA\n             What happened?\n\n                           SHARON\n             I took him to the cemetery, and...\n\n                              ELANORA\n             The cemetery!\n\nElanora's look darkens and she begins to shake her head\nin worry.\n\n                           SHARON\n             I thought it might help him...\n             come back, you know? But he\n             wouldn't even go in. He screamed\n             at me.\n\n                            ELANORA\n                    (upset)\n             What made you take him there?\n\n                           SHARON\n             For the truth...\n\n                           ELANORA\n             He knows the truth.\n\n                           SHARON\n             But he won't even say it, or...\n\n                                                (CONTINUED)\n\n                                                          111.\n\nCONTINUED:\n\n                           ELANORA\n             That's his way. That's his way\n             through all this. He made a wall\n             -- around that whole day, that\n             night -- other things, too. He\n             keeps them behind the wall -- his\n             little boy, my daughter. He can't\n             help it. The cemetery?! Do you\n             know how hard it is for me to go\n             to the cemetery? Can you imagine?\n\nSharon is shaken by this, realizing, crumbling a bit as\nMrs. Chu goes on.\n\n                           ELANORA\n             That's where it stares you in the\n             face -- the loss. And it's too\n             much sometimes.\n\nElanora takes a breath, acknowledging how upset she is.\n\n                           ELANORA\n             See? I'm still finding my way\n             through it. And Catch -- it\n             almost kills him to think about it\n             or say it or drive a car or see\n             the place where it happened or...\n             go by the cemetery.\n\n                           SHARON\n             I was trying to help him... come\n             back to some kind of life. I...\n\n                           ELANORA\n             But he was coming back. Do you\n             realize how much he changed in the\n             past weeks? His apartment, his\n             life, his music is coming back.\n             He fell in love! He even got a\n             job, Sharon -- for you. For the\n             two of you. Isn't that coming\n             back? Why do you have to rush?\n             Everybody has to rush these days.\n\nSharon, battered by the truth of this, is totally exposed\nnow, realizing, admitting.\n\n                           SHARON\n             I was scared. I push so hard...\n             when I'm scared.\n\n                           ELANORA\n             Scared of what?\n\n                                                 (CONTINUED)\n\n                                                           112.\n\nCONTINUED:\n\n                           SHARON\n             Losing him. So I did. I lost\n             him. He won't talk to me. I... I\n             didn't know what I was doing.\n\nElanora sighs, looking at her, and her anger drains away,\nstudying Sharon's misery.\n\n                           ELANORA\n             You were finding your way.    What\n             else can we do? You think    I'm\n             always sure what to say to   him,\n             what not to say? I do what    I\n             think is right and hope he   sees\n             the love in it.\n\nShe shakes her head at Sharon's tears, her warmth showing\nnow, liking this girl.\n\n                           ELANORA\n             Look at you -- so worried now, so\n             miserable. That's the love in it.\n\n                           SHARON\n             Did I... make it worse for him?\n\n                           ELANORA\n             I don't know. I really don't.\n             But I think he'll see the love in\n             what you did.\n\nSharon stares, without much hope. She puts out her hand\nto touch Elanora's, to say goodbye. Elanora takes her\nhand and holds on a moment, staring into the girl, with\nstrength. Sharon nods and walks off, dark and sad.\nElanora watches her go.\n\n\nINT. SHARON'S APARTMENT - DAY\n\nIt's the next day, and Sharon is preparing to go to her\nparents' renewal of vows. She is at the bottom -- with\nCatch gone from her life -- but she is doing her best to\ngo through with this.\n\nWe START ON a table, looking at the invitation and next\nto that is a wrapped gift. We hear Sharon moving about,\nsee her nervous, half-dressed, speaking to herself. In\nthe b.g. we hear our TRUMPET-BASED MUSIC. Very soulful.\n\n                           SHARON\n             I just came by to... wish you\n             well. To... congratulate you and\n             wish you well. Shit.\n\n                                                  (CONTINUED)\n\n                                                        113.\n\nCONTINUED:\n\nShe checks the mirror again, doesn't like the look,\nstarts undressing, comes back to the table with the gift\non it, wonders if she should add more decoration to the\nbox. She does, and as the trumpet plays on we --\n\n                                           CUT TO:\n\n\nSHARON\n\ndressed differently, re-wrapping the gift and then --\n\n                                           CUT TO:\n\n\nSHARON\n\ndressed differently, rewrapping it again and then --\n\n                                           CUT TO:\n\n\nSHARON\n\nsitting still in a chair, holding the gift on her lap,\nlooking at the clock, nervous, scared, sad.\n\n\nEXT. STREET - DAY (SAME DAY)\n\nCatch is walking down a commercial street -- no Bob-the-\ndog, no strolling gait. He is focused, deep-eyed, on a\nmission of some kind. Our MUSIC CONTINUES over this and\non into...\n\n\nEXT. STREET - DAY\n\nThe MUSIC CONTINUES over Sharon driving to the church,\nparking, taking a deep breath, exiting the car. There is\nno one else outside the church. The ceremony has already\nbegun. She's planned it that way. She enters the church\nas the MUSIC FADES OUT.\n\n\nINT. CHURCH - DAY\n\nAs Sharon comes in quietly. The church is not full, but\nperhaps 50 people sit in the front pews, watching the\nceremony at the altar: The priest, Mr. and Mrs. Pogue,\naltar boys. Sharon moves forward and slips into a pew a\nfew back from the altar. The slight disturbance of\npeople sliding over to let her in causes a few people to\nglance over.\n\n                                           (CONTINUED)\n\n                                                          114.\n\nCONTINUED:\n\nOne of them is Kathy. They trade a brief, nervous nod.\nThen Kathy whispers to her husband...\n\n                           KATHY\n             She came.\n\nWe see Larry grow tense and angry.\n\n                           KATHY\n             Don't say anything.   Think of your\n             parents.\n\nLarry doesn't look at Sharon. The little boy, looking\nfine in a tiny suit and tie, and being bored, leans to\nlook at his aunt.\n\nSharon and Larry, Jr. trade a look.     She winks, then\nsettles back in her pew, watches.\n\n\nON ALTAR\n\nWe get our first   look at Sharon's FATHER, Carl Pogue, 62.\nStanding beside   his wife, a rather big, stolid guy, taken\nwith the moment,   both he and his wife emotional over\nthis. He wears    a hearing aid. The priest is speaking.\n\n\nON SHARON\n\nwatching with a mix of feelings as the mass continues and\nthe vows are renewed, the priest reciting the rituals.\n\n\nEXT. STREET - DAY\n\nThe PRIEST'S VOICE from the church plays over this scene,\ninvoking the blessings, saying the prayers of the mass as\nwe watch Catch continuing his mission, slowing his steps\nnow and pausing at the entrance to the Welston Memorial\nChapel. He hesitates. We see the price he's paying and\nthe determination. He walks through the gate.\n\n\nEXT. CHAPEL GROUNDS - DAY\n\nHe walks into a courtyard of several small buildings in a\ngarden setting -- all red brick and ivy, fountains and\nflowers. He is fighting his way through this, moving\ncloser to one of the buildings. He is nearly alone on\nthe chapel grounds, and, as he reaches the sheltered wall\nof this building, he is alone.\n\n                                               (CONTINUED)\n\n                                                       115.\n\nCONTINUED:\n\nThis is a wall   of bronze vaults within the bricks, and on\neach vault is   a plaque -- a name. His breath shivers in\nhis body as he   struggles to lift his eyes. Slowly, his\ngaze comes to   rest on a name: \"LAMBERT.\"\n\nAs he stares, the PRIEST'S VOICE from Sharon's church\nFADES OUT, and we are left with silence. Catch is\nshaky,. He takes a step closer to the wall, to the name,\nto them -- and he tries to speak, but can't. He tries\nagain -- his voice intimate, just above a whisper at\nfirst.\n\n                            CATCH\n             Annie. Chet. I don't... want you\n             to think I forgot about you. It's\n             just that I... I couldn't find\n             you.\n                    (pause)\n             I woke up, and you were gone.\n             Everything was gone. It all\n             just... disappeared. In one\n             minute. I couldn't remember that\n             minute. I lost it. It took me so\n             long to find it. I think I found\n             it all now. I used a calculator.\n             I did. I figured it out. You\n             know... we get about 1400 minutes\n             a day and so I figured it out. I\n             was 33 years old and three months\n             and eight days, so it was... I've\n             got it here...\n\nHe fishes a piece of paper out of his pocket. His hand\nis shaking as he reads a number off the paper.\n\n                           CATCH\n             It was minute number 17 million\n             eight hundred ten thousand, two\n             hundred... or so.\n\nHe puts the paper away.\n\n                           CATCH\n             That's the one I lost. And...\n             when I lost that minute, I guess I\n             tried to lose it all, all the\n             memories -- because they hurt. I\n             tried, but... I couldn't do it.\n\nWe --\n\n                                                         116.\n\nFLASHBACK - INT. VAN\n\nto that minute and, for once, we go in order and     play out\neach piece of it. We see Catch driving the van,      his wife\nANNIE beside him. His son Chet is in back with      his\ngrandparents, Elanora and her husband. The boy      is a bit\nwhiny, pouty.\n\nWe INTERCUT the flashback WITH --\n\n\nCATCH\n\nat the grave, struggling through this.\n\n                          CATCH\n            Chet... you weren't feeling so\n            good, remember? It was your\n            birthday, and you ate too much.\n\nWe see   Annie and Catch both glance back toward Chet, and\nwe get   present sound in this FLASHBACK scene as Catch and\nAnnie   both say, \"What's the matter? Hm? Aww.\" And then\nAnnie   looks out the window and turns to Catch and -- we\nCUT TO   Catch at the grave, his eyes filling.\n\n                          CATCH\n            And, Annie, you said... you\n            said...\n\nIn the FLASHBACK we see Annie turn to him again, and this\ntime we hear her say, softly...\n\n                          ANNIE\n            Slow down in the rain, all right?\n\nWe GO TO Catch at the grave, fighting tears.\n\n                          CATCH\n            And I don't know if I slowed down.\n            I don't know. I hope I did,\n            but... I didn't always listen. I'm\n            sorry. I'm really sorry.\n\nBack in the FLASHBACK, we see Annie reach around as\nElanora hands Chet to her. Then we're BACK at the grave\nand INTERCUTTING so that we see Catch speaking through\nhis tears and we also see this tender moment played out\nin the van.\n\n                          CATCH\n            ... You put him on your lap, and\n            he looked at me, and I made a\n            face. Remember? I made you\n            smile, Chet.\n                          (MORE)\n\n                                                (CONTINUED)\n\n                                                           117.\n\nCONTINUED:\n\n                           CATCH (CONT'D)\n             And then we all smiled, and it was\n             a great minute. It was. I'm\n             really glad... I found that\n             minute. No matter what.\n\nCatch stares at the grave, in tears, as the rest of that\nminute now plays out, punishing him. It lasts only about\nthree seconds: a bus out of control, headlights suddenly\nglaring through the windshield, Catch turning the wheel,\nBRAKES SCREAMING, PEOPLE SCREAMING -- and then it's over.\nAnd Catch has been battered by the memory, and is\nweeping, but has not looked away. He is still staring at\nthe name of his family, and he is able to say, in a\nbroken voice...\n\n                           CATCH\n             I won't forget... anymore.     I love\n             you.\n\nHe steps forward and puts his hand on the plaque, rests\nit there. We STAY ON this, then in a moment, we...\n\n                                                 DISSOLVE TO:\n\n\nINT. CHURCH - DAY\n\nThe renewal of vows is over, and Sharon is standing in\nthe aisle, nervous and not sure what to do. Guests are\nup and milling about, many leaving the church. \"See you\nat the house.\" \"See you at the party.\" Etc. A\nPHOTOGRAPHER is setting a group shot at the front of the\nchurch. Mr. and Mrs. Pogue, Larry and Kathy and the\nlittle boy...\n\n                          PHOTOGRAPHER\n             All right. The whole family in\n             this one. Just...\n\nOut of the milling crowd comes Sharon, taking a breath\nand braving it, walking up there, speaking quietly.\n\n                           SHARON\n             Where do you want me?\n\nThe Photographer turns to her, wondering.\n\n                           SHARON\n             I'm the daughter.\n\n                            PHOTOGRAPHER\n             Oh!   Oh, well, how about...\n\n                                                 (CONTINUED)\n\n                                                            118.\n\nCONTINUED:\n\nWe see the family shift so that Larry and his family are\non one side of the parents. Sharon follows the\nPhotographer's gesture to stand at the other side, beside\nher Mother. Her Father has not looked at her. The photo\nis taken. Sharon now turns to her mom and dad. This is\ndifficult, the strain is thick in the air.\n\n                           SHARON\n             You both look so great.\n\n                           MOTHER\n                    (nervous)\n             You, too.\n\n                           SHARON\n             I just wanted to...\n\nThe Father speaks to her, his voice not hard, but flat,\nnot warm either. No smile.\n\n                           FATHER\n             You coming to the party?\n\n                             SHARON\n             Sure.\n\nHe nods, then turns to greet well-wishers. Sharon is\nleft alone by the drifting away of the family, but one\nold couple greets her, the older woman (Mrs. Vander)\nwearing her new blue dress, her HUSBAND beaming beside\nher.\n\n                             MRS. VANDER\n             Sherry!    Look how nice you look.\n\n                           HUSBAND\n             Big police officer now.\n\n                           SHARON\n             Not so big.\n                    (to Mrs. Vander)\n             Nice dress.\n\nSharon moves off toward a side exit, trying to catch up\nwith Larry and his family.\n\n\nEXT. SIDE OF CHURCH - DAY\n\nAs Larry and his family exit -- and Sharon comes out of\nthe church, calling ahead.\n\n                             SHARON\n             Larry...\n\n                                                  (CONTINUED)\n\n                                                          119.\n\nCONTINUED:\n\nHe starts to just walk on, ignoring her, but Kathy takes\nthe little boy and walks ahead, with a look at Larry, at\nSharon.\n\n\nON SHARON AND LARRY\n\nThey nod to a few passing guests. Then they're alone.\nHis nose is still bandaged, but less so, anger and\nbetrayal in his eyes.\n\n                           LARRY\n             How did you have the guts to walk\n             into a church after breaking your\n             word?\n\n                           SHARON\n             I have to be here. It's a chance\n             to make things right, and I'm\n             taking it.\n\n                           LARRY\n             Why even talk go me? You got what\n             you wanted. You laugh about it?\n             You tell your cop friends how\n             you...\n\n                        SHARON\n          You think I talk about it?!    You\n          think...\n\nShe stops herself, catching her rush toward the old\nanger. She goes calmer, deeper, even sad.\n\n                          SHARON\n          Here, Lar.\n\nShe hands him something. It is the Polaroid photo. He\nlooks at it, surprised. They lock eyes. She speaks\nsoftly.\n\n                        SHARON\n          I was invited. I'm here. I'm\n          going to the party. You do what\n          you want.\n\nAnd she walks off toward the parking lot.\n\n\nINT. POGUE HOME - DAY\n\nWe're in the midst of the party. We see Sharon drifting\na bit, a hello here and there. She feels out of place.\n\n                                                (CONTINUED)\n\n                                                         120.\n\nCONTINUED:\n\nThough the home and yard are thick with people, there is\nsome tension, especially in the core group -- all who\nknow about the estrangement of Sharon. Now and then a\nnervous glance from her mother is directed at Sharon, or\na hostile glance from Larry.\n\nSharon passes the videographer, who is pointing light,\ncamera and microphone at the Vanders -- having them put\ntheir good wishes on tape. She smiles, then looks over\nand sees her Father across the room. He is alone. She\nsteels herself and heads his way. He makes eye contact,\nthen averts his look. She is approaching him, about to\nspeak, when he walks up to some friends and starts joking\nwith them, leaving Sharon hurt, humiliated.\n\nHer mother has seen this and comes to her, speaking\nquietly, nervously.\n\n                           MOTHER\n             Don't make him talk about...\n             anything today.\n\n                           SHARON\n             Mom, I was going to fix his tie.\n             His tie is crooked.\n\nShe sighs, pushing through her hurt to say...\n\n                           SHARON\n             It was a nice ceremony.\n\n                           MOTHER\n                    (worried)\n             Yes. We're running out of\n             chicken, though. Nobody's eating\n             the ham.\n\n                           SHARON\n             It's a great party, Mom.   You look\n             happy.\n\nSome joy is allowed to surface in her Mother's face.\n\n                           SHARON\n             Thirty-five years and still in\n             love, huh?\n\nHer Mother's look clouds a little, nervous again.\n\n                           MOTHER\n             You think that's wrong, don't you?\n\n                           SHARON\n             Of course not...\n\n                                                (CONTINUED)\n\n                                                         121.\n\nCONTINUED:\n\n                           MOTHER\n             I always... I feel like\n             apologizing to you. But I love\n             him.\n\n                          SHARON\n             I know.\n\n                           MOTHER\n             And then I feel like apologizing\n             to him for loving you. I'm the\n             one in the middle. I'm the only\n             one in this family who knows how\n             to forgive anybody.\n\nAnd she walks away. Sharon's eyes follow her, surprised\nand thoughtful. She watches her Mother approach her\nFather and straighten his crooked tie. Then Kathy is\nmoving toward Sharon. Sharon turns to her and they both\nspeak quietly -- at the same time.\n\n                           BOTH\n             You look great.\n\nThen they smile sad smiles.       Kathy gestures to her face,\nthe faded bruise.\n\n                           KATHY\n             Tons of makeup. On Larry, too.\n\nThey smile wryly again.\n\n                           SHARON\n             Sorry about that, but... I\n             couldn't stand him doing that to\n             you. I took it on...\n\n                           KATHY\n             Don't worry. I'm not your mother.\n             If he tries it again, I'm gone.\n             I'm out of there, me and Larry\n             Junior. He knows that.\n\nThey stare, and Sharon gives her a hug, Kathy returns it.\n\n\nON LARRY\n\nWe see Larry, across the room, notice this hug. He keeps\nhis expression intact for the group he's in, but we see a\nflare of anger in his eyes.\n\n                                                          122.\n\nON SHARON\n\nmoving across the living room.\n\nShe sees Larry Jr. sitting alone and goes to him, sits\nbeside the child -- who looks sad.\n\n                          SHARON\n            What's up with you?\n\n                          LARRY JR.\n            They won't let me watch T.V.\n\n                         SHARON\n            Oh. Well... let's pretend this is\n            T.V. It's a show about a party.\n\nThey look about the room.\n\n                          SHARON\n                   (as if it's a secret)\n            That man... is really a super\n            hero.\n\n                            LARRY JR.\n            Is not.\n\n                          SHARON\n            Is too. And so is she. Look.\n            See? Red tights under her\n            dress... Oh-oh, that man gave her\n            a drink with something in it.\n\n                            LARRY JR.\n            With what?\n\n                          SHARON\n            With stuff to make her sleep.\n            He's a bad guy.\n\nThe woman sips her drink, and the boy smiles, getting\ninto it.\n\n                            LARRY\n            She drank it.\n\n                         SHARON\n            Watch. She'll fall down any\n            minute.\n\nThe boy is suddenly swooped up, lifted away by his\nfather. Larry puts the boy down near the door.\n\n                          LARRY\n            Hey, sport, you should go play\n            outside.\n\n                                                (CONTINUED)\n\n                                                       123.\n\nCONTINUED:\n\nHe turns to Sharon.\n\n                           LARRY\n             Stay away from my family.\n\nThen he turns to the crowd, smiling a smile without\nhumor, speaking loudly.\n\n                           LARRY\n             Hey, everybody, keep it down.\n             Somebody might call the police.\n\nThere is some nervous laughter, people watching them now.\nSharon is angry and embarrassed, keeping her voice low.\n\n                           SHARON\n             What're you doing?\n\n                           LARRY\n                    (to crowd)\n             Once the cops leave, we can really\n             party.\n\nThe crowd around them is all staring now -- as he turns\nback to Sharon.\n\n                           LARRY\n             Why don't you give everybody a\n             break -- and go home?\n\nIn the hushed tension that follows, a GLASS falls and\nSHATTERS, and more people quiet down and stare. Sharon\nlooks at her glaring brother, looks at her Mother\nnervously picking up the broken glass -- no support\nthere. Angry and shaken, she turns to the door.\n\nShe walks to the door, opens    it, starts to leave, starts\nto close the door behind her,    and she stops, take takes a\nbreath, battling hard against    the old patterns of hurt\nand anger. She looks at that     nearly-closed door. She\npushes it open and walks back    in.\n\nWe see a surprised and angry look from Larry, a worried\nlook from her Mother -- but Sharon is moving through the\ncrowd, searching until she sees her Father. She heads\ntoward him. He sees her and walks into the kitchen,\navoiding her. She follows him. We see Larry and his\nMother exchange an anxious look -- and then move toward\nthe kitchen.\n\nINT. KITCHEN - DAY\n\nSharon enters, waits, others are leaving the kitchen,\nleaving her alone with her dad, but he starts to follow\nthem.\n                                           (CONTINUED)\n\n                                                          124.\n\nCONTINUED:\n\n                           SHARON\n             Don't walk away. Okay?\n\nHe acts as if he just noticed her.\n\n                              FATHER\n             What?\n\nShe gestures toward his hearing aid.\n\n                              SHARON\n             Is it working?     Do you need to\n             check it?\n\nHe absently touches the device.\n\n                              FATHER\n             It's fine.\n\n                              SHARON\n             Dad...\n\nBut the kitchen door opens. We hear the party going on\nout there. Larry and Sharon's Mother enter, her Mother\nlooking at her husband and back to her daughter, very\nfrightened. Larry is raging in a near whisper.\n\n                           LARRY\n             What the hell are you doing?!\n\n                           MOTHER\n             Sharon, please.\n\n                           SHARON\n             Please? Please what?! Will you\n             stop protecting him? You were\n             always protecting him! Don't talk\n             to your father. Don't bother your\n             father!\n\nShe turns to her dad.\n\n                           SHARON\n             I'm going to bother you for one\n             minute, Dad. Okay? Can you\n             handle that?\n\nLarry advances on her.\n\n                           LARRY\n             Just get the hell out...\n\nAnd she turns on him in a fury that halts him.\n\n                                                 (CONTINUED)\n\n                                                          125.\n\nCONTINUED:\n\n                        SHARON\n          This isn't about you, Larry -- or\n          you, either, Mom. This is between\n          me and my father, so leave us\n          alone for one goddam minute!\n\nShe turns back to her father.\n\n                        SHARON\n          How about you, Dad. Do you want\n          me to leave?\n\n                           FATHER\n             Up to you.\n\n                           SHARON\n             Dad... I'm asking. Am I welcome\n             here?\n\n                           FATHER\n             Jesus -- you're here, aren't you?\n             What d'you want?\n\n                           SHARON\n             I want to know!\n                    (then, quieting)\n             Do you want me here? Do you love\n             me, Dad? I want to know.\n\nThe question's out, and she's totally exposed now -- and\nthe silence that follows breaks her heart. She nods\ntoward his hearing aid. Her voice is close to a whisper,\nthick with tears.\n\n                           SHARON\n             Do you... need to... check that\n             again?\n\n                              FATHER\n             I feel like...\n\nHe can't finish it.\n\n                            SHARON\n             What, Dad?   You feel like what?\n\n                           FATHER\n             I feel like I don't have a\n             daughter anymore.\n\nShe takes the blow and doesn't crumble, only her eyes\nshow the depth of the pain. She speaks quietly, softly.\n\n                                                 (CONTINUED)\n\n                                                           126.\n\nCONTINUED:\n\n                           SHARON\n             Well... you do. It's a shame\n             you're going to miss knowing her.\n             You're going to miss all that.\n\nAnd she leaves, brushing past Larry and her Mother.\n\n\nINT. LIVING ROOM - DAY\n\nSharon comes out of the kitchen, blinking   back tears.\nThe party goes on around her, oblivious.    She stops on\nher way to the door because she sees the   video crew\nmoving, hunting the next guest -- and she   makes a\ndecision and walks toward them, stops in   the light, faces\nthe camera.\n\n                           SHARON\n             I'm next.\n\nAs they roll tape, people turn, gather, watch.       Sharon\nspeaks over a torrent of emotions.\n\n                           SHARON\n                    (to camera)\n             Hi, Mom and Dad. Congratulations.\n\nWe see her family coming out of the kitchen and walking\ninto this, surprised, stopping still.\n\n                           SHARON\n             Y'know... being in this house\n             reminds me of something.  I was\n             about ten, I guess, and Larry and\n             I were playing aliens -- remember,\n             Lar? We're making a lot  of noise,\n             and Dad comes home from work tired\n             and pissed off...\n                                                 CUT TO:\n\nHER FATHER\n\nwatching this. Her Mother is near panic, Larry staring\nhard, Kathy wondering. INTERCUT their reactions\nduring...\n\n\nSHARON\n\n                           SHARON\n             We're yelling like mad, and Dad\n             bursts into the room and says,\n             what the hell are you doing? And\n             I'm scared. I'm really scared.\n                           (MORE)\n                                                 (CONTINUED)\n\n                                                       127.\n\nCONTINUED:\n\n                           SHARON (CONT'D)\n             And I say, we're playing alien\n             invasion, Dad, and he says, oh,\n             yeah, I'll show you a damn\n             invasion, and he picks me up,\n             picks me up off the floor and\n             throws me on the couch. I hit\n             that couch and bounce off, and he\n             grabs Larry and throws him on the\n             couch, and then... then he starts\n             making these monster sounds, and\n             he says, we came to earth to kick\n             ass, and I run at him and jump on\n             him and he tosses me on the couch\n             and then Larry, and we're laughing\n             so hard I almost wet myself, and\n             he keeps tossing us and growling\n             and beeping, and it was... it was\n             great. It was great, and I'm\n             never going to forget that.\n             Never. And I miss that. I miss\n             it. So I just... I wanted to tell\n             you tanks for that, Dad. Thanks.\n             That's all.\n                    (pause)\n             Bye.\n\nShe hands the microphone back and walks away as the\nsurprised looks, the deep looks of her Father, Mother,\nLarry and Kathy follow her. She walks to the front door\nand leaves.\n\n\nEXT. POGUE HOUSE - DAY\n\nSharon exits    and starts to walk away. She sees Larry Jr.\nlook up from    his play. He smiles at her. She returns\nthe smile --    it means a lot to her, and she walks on. As\nshe reaches    the gate, she notices something across the\nstreet that    halts her. She stops still, surprised and so\npleased.\n\n\nHER POV\n\nCatch is there, waiting near her car, watching her now.\n\n\nBACK TO SCENE - FULL SHOT\n\nas Sharon walks to him, so glad he's there, needing him\n-- but still not sure of what he's feeling about her,\nuntil she gets close and sees his eyes and the way he\nopens his arms -- and they embrace, and she holds on\ntight, eyes closed.\n                                           (CONTINUED)\n\n                                                         128.\n\nCONTINUED:\n\nThey break the embrace, still holding on, searching each\nother's eyes.\n\n                            CATCH\n             Sorry, Shar.   For what I said.\n\n                              SHARON\n             Me, too.\n\nIn a moment, he gestures toward the Pogue house.\n\n                              CATCH\n             Was it bad?\n\n                           SHARON\n             They don't like me in there.\n\n                           CATCH\n             Then they don't deserve you in\n             there.\n\nShe stares a moment more, still together.\n\n                           SHARON\n             That's a nice thing to say.\n\n                           CATCH\n             It's not a thing to say.   It's the\n             truth.\n\nShe can only look away, not wanting to cry.\n\n                           CATCH\n             Why do you try so hard not to cry?\n\nShe stares at him again. Her throat fills with tears,\nmouth is trembling a bit. She starts quietly, finally,\nwith nothing held back -- but this is not anger as much\nas mourning.\n\n                              SHARON\n             It's not fair.\n\nThe tears come, and she doesn't fight them, emptying the\nold, old wound, speaking through her weeping now. The\nfirst time we've seen her cry.\n\n                           SHARON\n             It's not fair. Things got better\n             for them because of what I did.\n             Things got better, and I'd still\n             do it. I'd do it all over again.\n             And it's not fair they shut me\n             out. It's not.\n\n                                                (CONTINUED)\n\n                                                               129.\n\nCONTINUED:\n\n                            CATCH\n             No.\n                           SHARON\n             It's not fair. I was     19, and I\n             didn't know what else    to do. I\n             didn't know how else    to stop it.\n             It's not fair I don't    have a\n             family anymore.\n\n                            CATCH\n             No.   It's not, Shar.    It's not.\n\nHe raises his hands to her face, places a palm gently on\neach cheek, and she covers his hands with her own and\ncloses her eyes. They remain that way awhile. In a\nmoment he lightly kisses her forehead. There is a depth\nto his words...\n                        CATCH\n          We're the family, Pogo.\n\nShe opens her eyes, staring deep into       his. He has said\nit all -- as it is and as it will be.        She smiles a bit\nthrough her tears and nods. He puts        an arm around her\nshoulder and holds her tight against       him as they walk to\nher car. She puts an arm around his        waist.\n\nThey reach the car, and she unlocks it, gets in behind\nthe wheel as Catch gets into the passenger seat.\n\n\nINT. CAR - DAY\n\nSharon just sits behind the wheel, still shaky from\ncrying. She puts the key in the ignition, but doesn't\nmove -- no longer sad, but drained now. He watches her.\nIn a moment, he gets out of the car.\n\n\nEXT. CAR - FULL SHOT\n\nCatch comes around to Sharon's window. She rolls the\nwindow down, concerned, wondering what he's doing. Is he\nleaving? But he reaches for her door and opens it and\nsays without a fuss...\n\n                           CATCH\n          I'll drive.\n\nShe stares a long moment,    realizing,    but also making no\nfuss about it as she gets    out of the    car, walks around\nand enters the passenger    side. They     close the car doors.\nCatch STARTS the CAR and    drives them    away. Drives them\nhome.\n                                                   FADE OUT.\n\n                            THE END\n\n\n\n\n\nAngel Eyes\nWriters :   Gerald DiPego\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:26.307386"}