{"title": "Arctic Blue", "film_link": "/Movie Scripts/Arctic Blue Script.html", "script_link": "/scripts/Arctic-Blue.html", "info_raw": "\n\nArctic Blue Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ross LaManna\nGenres  Action  Thriller\n\nRead \"Arctic Blue\" Script\n\n\n", "script": "\nARCTIC BLUE\nby Ross LaManna\n\nFADE IN:\n\n1\tEXT.  BOREAL FOREST - ALASKA - (AERIAL SHOT) - DAY\n\nFlying.  Not at the intangible height of a jet, but at\nspitting distance from the treetops.  We're in central\nAlaska, the Big Lonely, just north of the Arctic Circle.\n\nA thick forest follows the contours of mountain foothills\nlike a deep-pile carpet.  Up at treeline the forest thins to\ntundra, a grassy scruff turning red and yellow with the\ncoming of autumn.\n\nOn the horizon, the hills rise to meet the Endicott\nMountains, a great fortress wall of granite so sharp and\njagged that snow cannot stick to its face.  This is how all\nNorth America once looked -- raw, indomitable.\n\nThen, abruptly coming into the SCENE is a colossal etching\nacross the landscape too deliberate to be of natural origin.\nBisecting this country like a metallic ribbon -- or a scar,\ndepending on your point of view -- is the 800-mile-long\nTrans-Alaskan Pipeline.\n\nEven the immensity of the pipeline is rendered insignificant\nby the vastness of the land.  It goes on, and on, and on...\n\nDISSOLVE TO:\n\nA lone MAN walks along the Haul Road, a one-lane gravel\ntrail running parallel to the pipeline.  The weather turns\nsour -- rough wind and stinging snow cut across the man's\npath.\n\nDISSOLVE TO:\n\nThe man is ERIC DESMOND, twenty-four, clean-shaven,\ndetermined.  He's clearly out of place here, dressed in a\nbusiness suit and a light, camel-hair topcoat.\n\nEric is trying to follow some footprints in the snow -- a\npredator's tracks, those of a wolf or coyote.  But the\nfootprints ahead have faded, covered by the snow and wind.\n\nDISSOLVE TO:\n\nThe weather becomes more oppressive.  Heavy snow, gale winds\nand sub-zero temperatures make his progress tortuous.  Eric\nstrives stubbornly forward.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n1\tCONTINUED:\n\nDISSOLVE TO:\n\nEric has gathered some branches.  He tries to make a fire.\nMoisture from his breath has frozen in the upturned collar\nof his insufficient coat, and his skin is split raw from the\ncold.\n\nHis hands are too numb to hold the matches.  After several\nattempts at striking one, he slumps down next to the pile of\nwood, exhausted and frustrated.\n\nDISSOLVE TO:\n\nThe snow has covered the pile of branches.  Eric still sits\nnext to it, partially covered in snow himself.\n\nERIC\n\nHis face is a death mask: eyes half-open and dull, lips a\npurplish blue, bloodless skin crystallizing as it ices over.\nThe wind HOWLS around him.  The snow sticks to his eyelashes\nand hair without melting.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tEND DREAM\n\n2\tINT.  DARK BEDROOM - NIGHT\n\nEric bolts up in bed.  Next to him, ANNE MARIE GAUVIN sits\nup and hugs him.  All that can be seen of her in the dark is\na lovely silhouette and a cascade of dark hair.  After a\nmoment, Eric kisses her.  He shakes off the dream and lies\nback down.\n\n3\tEXT.  HAUL ROAD AND PIPELINE - CLOSE - DAY\n\nA metal sign, peppered with shotgun holes, is posted near a\npipeline support piling:\n\t\t\t\t\t\t\n\t\t\tPIPELINE UTILITY CORRIDOR\n\t\t\t\t  PRIVATE PROPERTY\n\t\t\t\t  NO   TRESPASSING\n\t\t\t\t  NO\t  HUNTING\n\t\t\t\t  NO\t TRAPPING\n\t\t\t\t  NO\t SHOOTING\n\nWIDER\n\nEric walks quietly past the sign, intent on something ahead\nof him.  Although still somewhat boyish in appearance, he's\nconfident and resolute in attitude.  His clothes have a\ndistinctly western feel: Lucchese boots, Levis 501's, Mahan\ncotton shirt.  His down parka is unzipped in the sunny,\nwindless, forty-degree afternoon.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n3\tCONTINUED:\n\nHe pauses, then brings to his shoulder a rifle with a\nfour-power scope mounted atop it.  He peers through the\nscope.\n\nHIS POV - THROUGH SCOPE\n\nHe puts the crosshairs on the shoulder flank of a big,\nivory-white timber wolf, fifty yards away.\n\nBACK TO SCENE\n\nAnne Marie stands beside Eric, a Nikon with a telephoto lens\nin her hand, holding her breath in anticipation.  She's\ntwenty-three, pretty, with soft features and piercing blue\neyes.  She wears Eddie Bauer woman's gear like she was born\nin it.\n\nEric expertly fixes his aim and slowly squeezes the trigger.\nBut instead of a loud retort, there is only the dull POP of\na CO2-powered dart gun.\n\nNEW ANGLE\n\nThe tranquilizer dart finds its mark in the wolf's fleshy\nshoulder.  The wolf takes off running, but almost\nimmediately slows, sits, then lies down.\n\nEric and Anne Marie hurry over to the wolf, who is breathing\ndeeply.  Eric kneels next to him and strokes his thick fur.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhat a beauty.\n\t\t\t(to Anne Marie)\n\t\t\tHand me the transmitter.\n\nAnne Marie passes to Eric a tiny, weatherproof homing device\nattached to a steel collar band.  Eric puts the collar\nloosely around the wolf's neck and crimps it in place, all\nthe while TALKING soothingly to the semi-conscious animal.\nAnne Marie smiles at Eric's tenderness and snaps some\nphotos.\n\nWith the collar in place and transmitter activated, Eric\nbacks away while the wolf tries to rouse itself from its\nnarcosis.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tHe's coming around fine.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tBe right back.  I left my\n\t\t\tcamcorder in the car.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n3\tCONTINUED:  (2)\n\nFOLLOW ANNE MARIE\n\nas she hurries back to their International Scout.  On the\ndoor of the Scout is a stylized logo of an oil derrick,\nunder which are the words:\n\t\t\t\t\t\t\n\t\t\tNORTHLAND PETROLEUM CORP.\n\nAnne Marie opens the hatchback and grabs a video camera.\n\nANGLE ON ERIC AND THE WOLF\n\nEric smiles as the wolf wobbles tentatively to his feet and\ntrots unsteadily away.  Near the treeline the wolf turns,\nglances back at Eric and then disappears into the forest.\n\nNEW ANGLE\n\nAnne Marie is taping the wolf's retreat.  Looking through\nthe viewfinder, she crosses a gully between a pipeline\npiling and a rock formation.  Eric turns toward her and a\nglint of light in the debris at her feet catches his eye.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tAnne Marie!  Stop!\n\nShe glances down.  Something metal is half-buried in the\ndead leaves and gravel.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tDon't move.\n\nEric runs over.  He pokes at the object with a stick.  With\na SNAP, a steel leg trap chomps the stick in half.  Anne\nMarie jumps back.  Eric brushes the dead leaves on the\nground behind her and she carefully backtracks out of the\ngully.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tGoddamn trappers!\n\nHe angrily rips the trap out of the ground, unearthing\nseveral others attached to one another by a long chain.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tTakes nerve, laying traplines on\n\t\t\trestricted land.\n\nEric slips the scope off the dart rifle and climbs up the\npipeline on foot pegs to the top of an anchoring poINT.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n3\tCONTINUED:  (3)\n\nUsing the scope as a telescope, he scans up and down the\nHaul Road.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tWhat are you doing?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHe still might be around.  I saw\n\t\t\tfresh tire tracks coming in.\n\nHIS POV - THROUGH SCOPE\n\nThe road and the pipeline stretch toward either horizon,\nnorth and south.  In the distance, a jeep is parked on the\nHaul Road.  Near it, a Man climbs down into another shallow\nravine.\n\nBACK TO SCENE\n\nEric hurries down the footpegs.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tMan and a jeep, about a mile and\n\t\t\ta half down.\n\nHe jumps into the Scout.  Anne Marie stuffs her cameras into\nthe hatchback.  As soon as she climbs in, Eric tears out.\n\n4\tINT.  SCOUT - (MOVING SHOT)\n\nIt races along the dusty gravel road at 60 MPH.\n\n5\tEXT.  HAUL ROAD\n\nStartled at the APPROACH of the Scout, the Trapper uproots\nhis traps and runs out of the ravine.  He WHISTLES and\nanother Trapper appears nearby.\n\n6\tINT.  TRAPPERS' JEEP\n\nThey pile into their dilapidated, all-terrain jeep.  It's\noddly well-equipped, however.  Bolted to the dashboard is an\nexpensive tape player and a beat-up radio beacon receiver\nwith a round locating screen.  They zoom off.\n\n7\tINT.  SCOUT - (MOVING SHOT)\n\nEric stomps on the gas.  The dust from the jeep obscures his\nview but he's gaining on them anyway.  Anne Marie hangs on\nand squints her eyes against the choking dust.\n\n\n\n8\tINT.  TRAPPERS' JEEP - (MOVING SHOT)\n\nThe driver is LEMALLE (35), a tall, ugly, rawboned Canadian.\nHis entire outfit is made of animal hide.  He has long red\nhair, and a reptilian face usually twisted into a sadistic\nsneer.  While driving, he scans along the pipeline.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tWhere the fuck did you drop\n\t\t\tCorbett off?\n\nIn the passenger seat, MITCHELL (38), chews tobacco and\nlooks grim.  He's a squat, flat-faced Okie, with curly\nmatted hair and tired grey eyes.  He's dressed in a brown\nlong coat and has a Colt .45 Peacemaker in a quick-draw\nholster strapped to his leg.  Despite his intimidating air,\nconfrontation is not his style.\n\nHe spots a figure up ahead, where the road crosses a muddy\ncreek.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tHe's over there.\n\n9\tEXT.  HAUL ROAD\n\nTurning sharply, the trappers' jeep splashes through the\ncreek bed without slowing.  Bouncing, it comes down hard\nagainst the axle-deep bank at the creek's high water mark.\nLeMalle tries to back out, but can't find traction in the\nmud.\n\nEric stops the Scout thirty yards behind them.\n\n10   INT.  SCOUT\n\nEric opens his door.  To Anne Marie:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tStay here.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tBe careful -- there're two of\n\t\t\tthem.\n\nEric reaches in the back seat and hands something to Anne\nMarie.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIf I unzip my parka, stick this\n\t\t\tout the window.\n\n11   EXT.  HAUL ROAD\n\nEric confidently approaches the jeep.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n11   CONTINUED:\n\nThen, a third trapper climbs from the creek.  He's got a\nline of traps slung around his neck and a world of\nexperience on his face.  He's BEN CORBETT, a life-long\nhuntsman, somewhere past forty, weathered beyond his years.\n\nHe has a feral nose, thick beard and dark, smart, hunter's\neyes.  He wears a hooded cotton sweat shirt, cotton\ncoveralls and vapor-barrier mountain boots.  On his belt is\na holster rig cradling a .44 magnum revolver.\n\nEric slows down.  He didn't expect to face anyone as\nformidable as Corbett.\n\n12   INT. / EXT. JEEP\n\nEmboldened by Corbett's presence, LeMalle reaches into the\nback seat and grabs his 6.5 by 55 Swedish military carbine.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to LeMalle)\n\t\t\tNo shooting.  Let's see who's so\n\t\t\tinterested in us.\n\nCorbett has an incongruously affable voice.  He throws his\ntraps into the jeep, then strides closer toward Eric.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(to Corbett)\n\t\t\tAin't worth it, Ben...\n\n13   EXT.  HAUL ROAD - CREEK CROSSING - LONG SHOT\n\nAs Corbett comes closer, Eric realizes this might not've\nbeen a great idea.  Corbett squints his eyes and sniffs the\nair, as if by this he can gauge his opponent's mettle.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou got two counts against you --\n\t\t\ttrapping out of season and\n\t\t\tpoaching on restricted land.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tCan't be much of a crime, if all\n\t\t\tthey got minding the area is a\n\t\t\tcocky kid.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI got your plate number, asshole.\n\t\t\tMaybe you feel like spending a\n\t\t\tfew months in jail.\n\nCorbett just smiles.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n13   CONTINUED:\n\nBut LeMalle, rankled, sticks the carbine out the jeep\nwindow.\n\nSeeing the rifle pointed at him, Eric freezes, then slowly\nunzips his parka.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tBen?  Sure you don't want me to\n\t\t\tdrop the fucker?\n\nCorbett doesn't answer.  Then, his eyes narrow and he looks\npast Eric at the Scout.\n\nCORBETT'S POV\n\nThe passenger in the Scout sticks what looks like another\nrifle out the window.\n\nBACK TO SCENE\n\nEric quickly glances over his shoulder to make sure Anne\nMarie's backing him up.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou leave and don't come back,\n\t\t\tthat's the end of it.\n\nAfter a long moment, Corbett smiles again, then turns away\nfrom Eric.  He motions LeMalle to the front of the jeep.\n\nFrustrated, LeMalle slams back the safety on the carbine and\nthrows it in the back seat.\n\nANGLE ON TRAPPERS\n\nMitchell climbs into the jeep and starts the engine.\nLeMalle and Corbett rock the jeep back and forth in the rut.\nWhile pushing, Corbett rips the sole of his boot on a sharp\npiece of granite.   He cusses and pushes harder.\n\n14   EXT.  HAUL ROAD - CREEK CROSSING\n\nEric walks back to the Scout.  He feels the trappers' eyes\non his back, but forces himself not to hurry.\n\nThe trappers free their vehicle.  Corbett gets in the\ndriver's seat, and they take off.\n\n15   INT.  SCOUT\n\nAnne Marie's hands are shaking as she pulls the plastic\ntranquilizer rifle back in the window.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n15   CONTINUED:\n\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(unnerved)\n\t\t\tGreat idea -- pointing a lousy\n\t\t\tdart gun at some nut with a\n\t\t\thigh-powered hunting rifle.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tBastards took off, though, didn't\n\t\t\tthey?\n\n16   EXT.  BOREAL FOREST - LATER THAT DAY\n\nThe trappers have left the flatlands of the Haul Road area.\nNow their jeep climbs a pathway over the rolling foothills.\n\n17   INT.  TRAPPERS' JEEP - (MOVING SHOT)\n\nCorbett broods while driving.  Mitchell looks out the\nwindow.  The silence makes LeMalle uncomfortable.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tAll this fuckin' land, and we're\n\t\t\tlocked out.  Makes me puke.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tJawing about it won't change it.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tThree hundred seventy-five\n\t\t\tmillion acres in this state.  I'm\n\t\t\treal tired of runnin' into\n\t\t\tpeople.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tThen don't look to your left.\n\n18   EXT.  SPORTSMEN'S CAMP\n\nA brand-new Land Rover is parked on an alluvial fan in a\nbend in a small river.  Scattered about is an assortment of\nexpensive camping gear, beer cans, spent shells and other\ngarbage.\n\nThree toy-macho, vacationing SPORTSMEN are guzzling beer and\nBLASTING fish in the shallow river with 12-gauge shotguns.\nThey look up and glower suspiciously as the jeep slows and\nstops.\n\n19   INT.  TRAPPERS' JEEP\n\nLeMalle grabs his carbine.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLeave it here.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n\n19   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tLet's keep going.  We're only an\n\t\t\thour from Devil's Cauldron.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(pats Mitchell's shoulder)\n\t\t\tRelax.  I just want to ask them\n\t\t\thow the hunting is.\n\n20   EXT.  SPORTSMEN'S CAMP\n\nCorbett gets out of the jeep.  He regards the Sportsmen,\ntheir shotguns and their mess with ill-concealed contempt.\n\nThe Sportsmen clutch their weapons and watch Corbett.  He\nwalks around the camp, spotting a rubber-lined rucksack\nstuffed with dead ermine.  After a long, tense moment,\nCorbett smiles.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLooks like you've had some luck.\n\t\t\tWhere's your guide?\n\t\t\t\t\t\n\t\t\t\t\tSPORTSMAN #1\n\t\t\tWe're on our own, if it's any of\n\t\t\tyour damn business.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(re ermine)\n\t\t\tYou did real good.\n\nHe crouches next to the dead animals and strokes the fur.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(to Corbett)\n\t\t\tNo swinging shit.  They're over\n\t\t\ttheir goddamned limit.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Sportsmen)\n\t\t\tMy friend is right.  Supposed to\n\t\t\thave a licensed guide when you're\n\t\t\ton this land, too.\n\t\t\t\t\t\n\t\t\t\t\tSPORTSMAN #1\n\t\t\tHey, we paid our fuckin' permit\n\t\t\tfees.\n\nLeMalle amuses himself by pissing in their campfire.  No one\nnotices that in the b.g., quiet Sportsman #3 unzips his\nparka, exposing a .45 Peacemaker in a belt holster.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n20   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tSPORTSMAN #2\n\t\t\tI were you, I'd drive right on\n\t\t\toutta here again.  Now.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(calmly)\n\t\t\tThis was my roaming land, 'til\n\t\t\tthe government took it over.\n\t\t\tOnly Innuit can hunt here now,\n\t\t\tand tourists, like you.\n\nCorbett swings the rucksack of carcasses onto the hood of\nthe Land Rover.  Pissed, Sportsmen #1 and #2 step closer to\nhim.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tAccording to tribal law, hunters\n\t\t\tpassing through the land of\n\t\t\tanother tribe can only take game\n\t\t\tto survive.  They can eat the\n\t\t\tmeat, but have to surrender the\n\t\t\thides.\n\nLeMalle pulls a hunting knife and holds up one of the\nermine.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tWant the meat?\n\t\t\t\t\t\n\t\t\t\t\tSPORTSMAN #1\n\n\t\t\tFuck you, dirtball.\n\nCorbett chuckles and Mitchell spits.\n\nWIDER\n\nLeMalle digs through the camping goodies in the back of the\nLand Rover, many still in their packages.  He helps himself\nto some sandwiches and a 12-pack of beer.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tI say shoot 'em, bury 'em with\n\t\t\ttheir shiny new car.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(to LeMalle)\n\t\t\tIf you're gonna take something,\n\t\t\ttake it and let's go.\n\nCorbett looks down to fasten the top of the rucksack.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n20   CONTINUED:  (2)\n\nNEW ANGLE\n\nSuddenly, Sportsman #3 reaches inside his parka and pulls\nthe pistol.  He swings it toward LeMalle.\n\nLeMalle looks up when he hears the HAMMER cock.\n\nThere is a deafeningly loud SHOT.\n\nSportsman #3 falls down dead at LeMalle's feet.\n\nOff to one side, Corbett holds a huge, smoking .44 magnum\nsix-shooter in his hand.\n\nShotgun in hand, Sportsman #1 gauges his chances of blasting\nCorbett.  Nil.  When Corbett turns to him, he lies the\nweapon down.  Sportsman #2 rushes to his friend.\n\nLooking bleak, Mitchell spits again.  Corbett crosses to\nLeMalle and knocks from his hands the things he wanted to\nsteal.  Chastised, LeMalle smolders.  After a moment:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Sportsmen)\n\t\t\tPut him in your truck.  Smell of\n\t\t\tblood will attract the bears.\n\t\t\t(to trappers)\n\t\t\tLet's go.\n\nAs Corbett walks to the jeep, he's too angry to notice that\nhe's stepped in a patch of mud under the Land Rover.\n\nNear the jeep, LeMalle stops and pulls them into a huddle.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\n\t\t\tI don't believe in leavin'\n\t\t\twitnesses behind, Ben.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tIt was self defense.  Leave it at\n\t\t\tthat.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tYou think those fucks will tell\n\t\t\tit that way?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(ending the argument)\n\t\t\tWe'll get a head start before\n\t\t\tthey go crying to the law.\n\nCorbett turns and FIRES two rounds from his .44 into the\nengine of the Land Rover.  The Sportsmen stare and sputter.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n20   CONTINUED:  (3)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; to Sportsmen)\n\t\t\tYou can pack out of here -- two,\n\t\t\tthree days' hike along this river\n\t\t\tat most.  Weather should hold\n\t\t\tthis early in the season.\n\nCorbett and Mitchell get in their jeep.\n\nLEMALLE\n\nisn't yet satisfied.  He walks back over to the Sportsmen,\nkneeling beside their fallen friend, and crouches right\nbeside them.  Intimidated, Sportsman #2 looks away, but\nLeMalle grabs his chin and turns his face back toward him.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tThink I'm pretty?  You better\n\t\t\tforget how we look, 'cause next\n\t\t\ttime they won't keep me from\n\t\t\tkilling you.  This land ain't\n\t\t\tquite civilized, you know...\n\nHe unsheathes his buck knife.  BELOW FRAME, he slices across\nthe forehead of the dead Sportsman, peels back his scalp and\ncuts it loose, Indian-style.  The Sportsmen are stunned and\nsickened.\n\nANGLE ON TRAPPERS' JEEP\n\nCorbett looks at Mitchell and wearily shakes his head.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tAt least he scalped the dead one.\n\n21   EXT.  DEVIL'S CAULDRON - DUSK\n\nDevil's Cauldron Hot Springs is a cluster of twenty tiny\ndwellings connected by an unpainted boardwalk.  The town\nsquats, ugly and temporary-looking, in a dirt clearing fifty\nmiles north of the Arctic Circle.  Thirty miles east of the\nPipeline, it's almost dead center of interior Alaska.\n\nAt the edge of town is a gravel airstrip.  Mixed with the\nprospector-era sod-roof cabins are a few prefabricated\nhouses.  The boon brought by men building the pipeline is\nlong gone.  Now only a few itinerant loggers, natives and\nbush dwellers remain to fight boredom, each other and the\ndepression of the oncoming winter.\n\nEnough steam escapes from the hot springs to perpetually\nblanket the valley with fog.  The spa is log-walled and\nhorseshoe- shaped, with partitioned baths inside.  Facing it\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n21   CONTINUED:\n\nare a mud-walled fire bath, a wooden steam bath called a\nMaqi, six one-room cabins for let, and an unused dance hall.\n\nLEO MEYERLING opens the tailgate of a Dodge truck with the\nNorthland Petroleum logo and \"District Supervisor\" on the\ndoor.  Meyerling is short and bald with a completely\ndisreputable face.  He staples a poster on a wall.  It has a\npicture of him on it, and:\n\t\t\t\t\t\t\n\t\t\t\tLEO MEYERLING\n\t\t\t\t\tfor\n\t\t\t\t  State Legislature\n\t\t\t VOTE FOR THE PEOPLE'S FRIEND!\n\n22   EXT.  KENAI'S GENERAL STORE\n\nCorbett and the other trappers drive past Meyerling and park\ntheir jeep as the sun disappears behind the foothills.\n\n23   INT.  KENAI'S GENERAL STORE\n\nA handwritten public notice next to a schedule of church\nmeetings reads: \"Live each day so you can look every damn\nman in the eye and tell him to go to hell.\"  There is a post\noffice in the corner with some combination boxes and a\nwicketless window.\n\nThe trappers come in.  Corbett sits in a chair and pulls his\nboots off.  One of his wool socks is wet.  He nods to the\nman sitting in the other chair, SAM WILDER.  Wilder is short\nand tough, with a full head of crewcut grey hair and\nweather- ravaged face that makes him look older than his\nsixty years.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHullo, Sam.  Slow day?\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(wary)\n\t\t\tBen...boys.  Yeah, real slow, and\n\t\t\tI'd like to keep it that way.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(conciliatory)\n\t\t\tJust passing through.\n\nA chubby Inupiat (interior Eskimo), wearing thick glasses,\nseveral heavy sweaters and battery-heated socks, fusses\nbehind the counter.  He's EARL KENAI, owner of the hot\nsprings spa and the general store.\n\nLeMalle chews on a handful of bear jerky.  Kenai stares at\nLeMalle until he begrudgingly pays for the jerky.  Corbett\npulls on some sneakers and hands his boots to Kenai.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n23   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; re boot)\n\t\t\tNeeds patching.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tTwenty-five dollar.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(smiles)\n\t\t\tSure have learned to worship the\n\t\t\twhite man's god.\n\nKenai nods agreeably and holds his hand out.  Corbett pays\nhim.  Meyerling comes in and posts some fliers on the\ncorkboard.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI hope I can count on you\n\t\t\tgentlemen to vote for The\n\t\t\tPeople's Friend this November.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tShare some of that oil company\n\t\t\tmoney in your pocket and you can.\n\nMeyerling smiles like a toad, then slaps another poster on\nthe wall.  LeMalle throws his knife and it STICKS in the\nposter between Meyerling's spread fingers.  Meyerling jumps\nback and the trappers laugh.  Meyerling looks to Wilder for\nsupport.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(to Meyerling)\n\t\t\tOne flier comes loose and I shoot\n\t\t\tyou for littering.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(exiting; grudgeless)\n\t\t\tHave your fun... just remember\n\t\t\tThe People's Friend come election\n\t\t\tday.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(shakes his head)\n\t\t\tOil Company candidate running on\n\t\t\tthat slogan makes about as much\n\t\t\tsense as a rat fucking a\n\t\t\tgrapefruit.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHard to work up an interest in\n\t\t\tpolitics, way we live.  You're\n\t\t\tthe first people we've seen in\n\t\t\ttwo weeks.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n23   CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(to Kenai)\n\t\t\tHow about a quart of Jack\n\t\t\tDaniel's?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tHow about it is right.  Back in\n\t\t\tthe primary this town was voted\n\t\t\tdry.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(to Corbett)\n\t\t\tAw, shit.  Let's go.  Leave a\n\t\t\tnote for Viking Bob, tell him to\n\t\t\tmeet us in Cache.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tRelax.  One more day without\n\t\t\tdrink won't kill you.  Right,\n\t\t\tSam?\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI'm living proof of that sad\n\t\t\tfact.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tCan we buy the Marshal some\n\t\t\tdinner?\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tNo, I better stay at my post.\n\n\t\t\tEven without the hootch riling\n\t\t\t'em up, you know how\n\t\t\tmean-spirited folks get when they\n\t\t\tsmell winter coming.\n\n24   EXT.  DEVIL'S CAULDRON VALLEY - LONG SHOT - NIGHT\n\nAn early STORM has blown in from the north, bringing\nwhipping winds and freezing rain.\n\n25   INT.  RENTAL CABIN\n\nCorbett peers out the tiny window, frowning.  LeMalle cleans\nhis carbine while eating beans and bacon.  Mitchell hunches\nover a table.  He's making a scrimshaw -- delicately\nengraving, using homemade tools, on a palm-sized piece of\nwhale bone.  He rubs his eyes and looks up at Corbett.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tSo much for the walking weather\n\t\t\tyou predicted.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n25   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHad no choice...\n\t\t\t(pointedly, at LeMalle)\n\t\t\t...Given the situation.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tI know.  Least you didn't shoot\n\t\t\tall of them.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tFuck you, Mitchell.  Woulda been\n\t\t\tmy ass if Ben didn't waste that\n\t\t\tprick.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(after a beat)\n\t\t\tMitchell, look, it don't take\n\t\t\tthree of us to wait for Viking\n\t\t\tBob.\n\nMitchell glances at LeMalle, then at Corbett.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tGo ahead.  Take the jeep.  I'll\n\t\t\tcome to Cache with Bob when he\n\t\t\tgets here.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tOkay by me.  You're the one likes\n\t\t\tthese hot springs so much.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLeave my traps.  We'll tag up,\n\t\t\tcouple days.\n\n26   EXT.  HAUL ROAD - \"THE TURTLE\" - DAY\n\nThe winds have died down.  The rain has turned to a light\nsnow.\n\nA mobile arctic dwelling sits on a rise next to the Haul\nRoad.  It's a double-unit weathertight cocoon of fiberglass\nand aluminum, pulled by a diesel rig on oversized tires.\nThe front module is 12 by 24, the rear 12 by 18.\n\nAn extended-cab pickup pulls up and Sam Wilder gets out.\nThe gravel-and-dirt Haul Road, paralleling the pipeline for\n400 miles, is closed to the public.  An arriving vehicle,\ntherefore, is news.  The front door of the dwelling opens.\nEric and Anne Marie come outside, delighted to see Wilder.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n26   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI was making my rounds, saw your\n\t\t\thangar wide open, plane getting\n\t\t\trained on, so I closed it up.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThanks.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(to Wilder)\n\t\t\tI bet you haven't had lunch.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(smiles)\n\t\t\tBet you're right.  But I didn't\n\t\t\tcome by to wangle a meal --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t-- We appreciate the company.\n\t\t\tAnne Marie's getting cabin fever\n\t\t\talready.\n\nAnne Marie shoots a look at Eric but doesn't disagree --\nthis is obviously an issue with them.  Wilder looks with\namusement at the mobile dwelling.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tWhat'd you say they call these\n\t\t\tspaceships?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tMobile Arctic Dwelling -- MAD.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI call it 'the Turtle,' as in\n\t\t\tcarrying your home on your back.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tBest thing is, Meyerling has to\n\t\t\tchase around to find us.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(laughs)\n\t\t\tThe little creep hates it that\n\t\t\tEric actually does what the\n\t\t\tcompany hired him to do.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tWatch it with Meyerling.  Man's\n\t\t\tas mean and corrupt as they get.\n\t\t\tCut his mother's throat if it'd\n\t\t\tget him a couple votes.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n26   CONTINUED:  (2)\n\nLooking past Wilder, Eric points out some smoke on the\nhorizon.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHey, Sam, look over there.  Black\n\t\t\tand white smoke.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tDamn.  Likely that's an SOS.\n\t\t\tHave to pass on that lunch.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe'll go with you.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n27   EXT.  SPORTSMEN'S CAMP - LATER THAT DAY\n\nEverything seems peaceful enough.  The SOS fire (made from\nburning green branches for white smoke and rubber for black\nsmoke) has burnt down to embers.\n\nEric, Anne Marie and Wilder pull up in Wilder's pickup.\n\nThe two Sportsmen sit in the front seat of the Land Rover,\nbut they don't react to the arrival of the rescuers.  In the\nback seat, a reflective camping blanket covers a large mass.\n\nSomething is amiss.  Eric shoots a look of trepidation at\nAnne Marie as they get out of the pickup.   Wilder pulls the\ndoor of the Land Rover open.\n\nA Sportsman slumps out onto the ground.  His eyes are open\nand his tongue pokes out between his lips.  His skin is\nblue-white. (He looks, in fact, much like Eric's nightmare.)\n\nStartled, Eric steps back.  Anne Marie gasps with horror.\nWilder unzips the Sportsman's light windbreaker and listens\nfor a heartbeat.  Nothing.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tStupid goddamn greenhorns!  Froze\n\t\t\tto death.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tIt's not even winter!\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tThey got wet in the rain.  Core\n\t\t\tbody temperature dropped, got\n\t\t\tdrowsy, probably didn't even know\n\t\t\twhat was happening.\n\nEric stares at the dead Sportsmen.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n27   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(continuing)\n\t\t\tQuestion is why they sat here\n\t\t\twhen the storm moved in.  Check\n\t\t\ttheir stuff while I sniff around.\n\nWilder tries the ignition.  The starter TURNS OVER, but the\nengine makes a horrendous GRINDING.  He walks to the front\nof the vehicle.  Noticing the bullet holes in the grille, he\nbends down for a closer look.\n\nNEW ANGLE\n\nEric opens the rear hatchback and digs through the plentiful\nsupplies.  Still in their packages are some matchbox-sized\nELT locating beacons.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThey had Emergency Locater\n\t\t\tTransmitters, but didn't use\n\t\t\tthem.\n\t\t\t(opens one up; shakes his\n\t\t\t\thead)\n\t\t\tMaybe because they didn't bring\n\t\t\tbatteries.\n\nCLOSE\n\nAnne Marie opens the back door of the Land Rover.  She pulls\nback the camping blanket... and uncovers the third\nSportsman.  The torn red flesh on his head and his\nbugged-out eyes are a hideous sight.\n\nAnne Marie SCREAMS and stumbles away.\n\n28   EXT.  SPORTSMEN'S CAMP - LAND ROVER\n\nEric runs over to her as she tries to catch her breath.\n\nWilder looks at the third Sportsman and angrily kicks the\nside of the Land Rover.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI'm too old for this shit.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tAny idea who could've done it?\n\nSourly, Wilder points to a patch of frozen mud under the\nvehicle.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tA certain sonofabitch bastard\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n28   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tWILDER (Cont'd)\n\t\t\twearing a damaged mountain boot.\n\t\t\tLeft a footprint clear as an\n\t\t\tautograph.\n\nWilder examines the Sportsman, finding the bullet hole in\nhis chest.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(continuing)\n\t\t\tEven for Ben Corbett, this is\n\t\t\tnasty.  Man's got balls.  He was\n\t\t\tsitting in Devil's Cauldron when\n\t\t\tI left, calm as can be.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tThank God.  You can arrest him.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tNot necessarily.  Corbett's awful\n\t\t\thardbitten these days.\n\nWilder leans against the Land Rover, feeling tired.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(continuing)\n\t\t\tHis old roaming area's all\n\t\t\tprivate reserve now.  Normally,\n\t\t\tlong as he stays civil in my\n\t\t\tjurisdiction, I let him be.\n\t\t\t(beat)\n\t\t\tWon't be able to take him by my\n\t\t\tlonesome, though.  Nobody in\n\t\t\ttown'll lift a finger on this.\n\nEric looks hard at the dead Sportsmen.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(quietly)\n\t\t\tI'll go into town with you.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tEric, leave it alone.  It's not\n\t\t\tyour business.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(shakes his head)\n\t\t\tNo way can he get away with this.\n\t\t\tI'll be back by tonight.\n\n29   EXT.  DEVIL'S CAULDRON - AFTERNOON\n\nThe town is quiet.\n\n\n\n30   INT.  HOT SPRINGS SPA\n\nCorbett soaks in one of the huge wooden tubs with a pudgy\nInupiat hooker, DIXIE.\n\nHe looks up as Eric comes into the spa.  Eric holds\nCorbett's boots, which have been repaired.  Eric pauses when\nhe sees Corbett.  There is a flash of recognition between\nthem.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tBen Corbett?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYep.  Afraid you have me at a\n\t\t\tdisadvantage.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tKenai at the general store asked\n\t\t\tme to bring these.  Didn't expect\n\t\t\twe'd already met.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tNo big deal.  We just got off on\n\t\t\tthe wrong foot.  What's your\n\t\t\tname?\n\nEric glances down at Corbett's duffel bag, which sits on the\nfloor next to Corbett's tub.  Corbett's magnum rests on top\nof it, well within reach.  Corbett notices Eric's interest\nin it.  He leans back and smiles.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tDesmond.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tNew to the country, kid?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSix months.  Ecological study for\n\t\t\tNorthland Oil.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tEcology.  Folks use that term for\n\t\t\teverything but what it means:\n\t\t\twho's eating who.\n\nPutting his hand on Dixie's shoulder, Corbett stands and\ngets out of the tub.  His sinewy body, resembling a\nscarecrow made of steel cable, is covered with scars.  He\nwraps a towel around his waist and crosses to Eric.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n30   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tNow, why don't you get around to\n\t\t\tsaying what you want.\n\nCorbett grabs his boots from Eric and finds himself facing a\nrevolver, which Eric has been hiding inside one of the\nboots.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; smiling)\n\t\t\tYou wouldn't shoot anyone...\n\t\t\t\t\t\n\t\t\t\t\tWILDER (OS)\n\t\t\tBut I would.\n\nNEW ANGLE\n\nWilder has come in the back way and stands behind Corbett\nwith a 12-gauge shotgun.  He kicks Corbett's magnum out of\nreach.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tAll this for laying traps on\n\t\t\tprivate land?\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tYou left a footprint at the\n\t\t\tSportsmen's camp.  Only pretty\n\t\t\tsight there, Ben, 'cause the two\n\t\t\tmen you didn't shoot and mutilate\n\t\t\tdied of exposure.\n\nCorbett shakes his head but remains implacable.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tChrist if I shouldn't know better\n\t\t\tthan to step in soft earth.  I've\n\t\t\tseen footprints in the tundra a\n\t\t\thundred years old.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(to Eric)\n\t\t\tI got it from here.  Thanks.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Wilder)\n\t\t\tSam, give Dixie here fifty bucks\n\t\t\tout of my kit, will you?\n\n31   EXT.  HOT SPRINGS SPA\n\nEric comes outside.  Earl Kenai, overdressed for the weather\nin gloves, mukluks and a full-length sealskin coat, stands\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n31   CONTINUED:\n\nshivering by a woodshed near the hot springs, hacksawing a\npiece of meat from a frozen moose carcass.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tBefore white men came, my people\n\t\t\tlived in sod houses underground\n\t\t\tand laid our dead on the tundra.\n\t\t\tNow we live above ground and bury\n\t\t\tour dead, and we haven't been\n\t\t\twarm since.\n\nWilder comes out of the spa with his shotgun and Corbett's\nduffel bag cradled in his arm.  Handcuffed, Corbett walks in\nfront of him.\n\nKenai looks down to avoid eye contact with Corbett as he\ngoes by.  Corbett stops next to Eric and smiles.\n\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tNice bluff the other day with the\n\t\t\ttranquilizer gun out your jeep\n\t\t\twindow.  See you again, maybe.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(unintimidated)\n\t\t\tYeah.  Maybe so.\n\n32   EXT.  DEVIL'S CAULDRON - FOLLOW WILDER\n\nas he leads Corbett along the boardwalk to the other end of\ntown.  They approach a prefab house perched on skids under a\ntall antenna tower.  Mounted above the shack, a DC wind\ncharger turbine spins lazily in the faint breeze.  From\nwithin the cabin comes an anomalous SOUND -- MTV.  Wilder\nKNOCKS on the door.\n\nARTHUR NEFF, a pasty-white, 45-year-old ex-Texan, pulls the\ndoor open.  His customary grin fades when he sees Corbett.\n\n33   INT.  NEFF'S HOUSE\n\nWilder pushes Corbett inside past Neff.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI need to call Fairbanks.\n\nNeff just stares at Corbett.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(continuing)\n\t\t\tNeff!  Dial it up.  State police.\n\nWith a \"what can I do but oblige?\" look to Corbett, Neff\nsits in front of the RCA Alascom radio telephone and dials.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n33   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t(on phone)\n\t\t\tFairbanks Alascom?  Patch me\n\t\t\tthrough to the State Police.\n\nAfter a moment, he hands the receiver to Wilder.  Wilder\ntakes it, keeping one eye and the shotgun on Corbett.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(on phone)\n\t\t\tThis is Sam Wilder, Marshal in\n\t\t\tDevil's Cauldron.  Had some\n\t\t\tkillings here.  I got a suspect;\n\t\t\tbe real nice if someone came and\n\t\t\ttook him off my hands.\n\t\t\t\t\t\n\t\t\t\t\tSTATE POLICEMAN (VO)\n\t\t\t(thru phone)\n\t\t\tOn a good day I couldn't spare a\n\t\t\tcrosswalk guard.  But now, no\n\t\t\tway.  Folks're batshit with the\n\t\t\tweather turning sour.  Bring him\n\t\t\tin yourself.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(on phone)\n\t\t\tNext plane's not coming 'til next\n\t\t\tMonday.\n\t\t\t\t\t\n\t\t\t\t\tSTATE POLICEMAN (VO)\n\t\t\t(thru phone)\n\t\t\tSit your suspect out in the cold.\n\t\t\tHe'll keep.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(on phone)\n\t\t\tThis man's friends ain't gonna\n\t\t\tlook favorably on his\n\t\t\tincarceration.\n\t\t\t\t\t\n\t\t\t\t\tSTATE POLICEMAN (VO)\n\t\t\t(thru phone; Mr. Glib)\n\t\t\tSo shoot him.  Won't have to feed\n\t\t\thim that way --\n\nAngry, Wilder slams the receiver down.\n\n34   INT.  WILDER'S CABIN\n\nIn one room, there is a wood-burning cookstove and an Ashley\nheat stove, a table, a bunk and a small window.  Behind a\ncloth partition is an eight by six holding cell.  The frame\nof an iron-bar door is securely cemented to the log walls.\nWilder comes in with Corbett and locks him in the cell.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n34   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tMind if I get some stuff from my\n\t\t\tkit?\n\nWilder does mind.  He locks the duffel bag and Corbett's .44\nin his desk drawer.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tSam, listen -- I shot to defend\n\t\t\tmy man.  Other guy drew first.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tIf that was all, fine.  But\n\t\t\tcarving him up, stranding the\n\t\t\tothers, that's too fucking much.\n\t\t\tIs everything that walks, crawls,\n\t\t\tflies or swims fair game to you?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(softly)\n\t\t\tI'll get loose before that plane\n\t\t\tcomes.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tDon't try me.  I'll kill you if\n\t\t\tit comes to it.\n\n35   EXT.  DEVIL'S CAULDRON - AFTERNOON\n\nAs Eric walks into Kenai's general store, Neff hurries over.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tMr. Desmond!\n\t\t\t(grins; sticks his hand\n\t\t\t\tout)\n\t\t\tArthur Neff.  Area rep for the\n\t\t\tFederal Assistance Plan.  Tell\n\t\t\tthe boys in DC to keep those\n\t\t\tgoodies coming.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSure.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tSnowplow, generator, TV dish...\n\t\t\thell, we get the goddamn Playboy\n\t\t\tChannel!  Here, this is for you.\n\nHe hands Eric a piece of styrofoam shaped like a commode\nseat.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n35   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t(continuing)\n\n\t\t\tWarm to forty below.  Remember,\n\t\t\tanything you want, you ask Arthur\n\t\t\tNeff.\n\n36   EXT.  HAUL ROAD - THE TURTLE - NIGHT\n\nThe storm has passed.   A faint CHUGGING emanates from the\nsmall orange generator trailer behind the Turtle.  Eric\npulls up and parks the Scout.\n\n37   INT.  THE TURTLE\n\nNylon storage netting along the ceiling holds Eric's\nresearch equipment and Anne Marie's photographic supplies.\nIn one corner of the Turtle are several of her black and\nwhite prints.  All are of man-made objects whose presence is\njuxtaposed with the natural surroundings.\n\nRelieved he's home in one piece, Anne Marie meets Eric at\nthe door and kisses him.  Carrying a brown-paper-wrapped\npackage, Eric follows her into the kitchen, where she's\npreparing dinner.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tDid you catch Corbett?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSure did.  He was one of the\n\t\t\ttrappers we rousted from the Haul\n\t\t\tRoad.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tWas there any trouble?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHe was sitting in a hot tub with\n\t\t\ta hooker.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tGoing after killers isn't the\n\t\t\tsame as chasing poachers, Eric.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(grins)\n\t\t\tCan't help myself.  Corbett's\n\t\t\ttype always pisses me off.\n\t\t\t(hands her the package)\n\t\t\tOh, I found this at the post\n\t\t\toffice.  Had your name on it.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n37   CONTINUED:\n\nPerplexed, she looks at the return address --\nBloomingdale's.  Delighted, she tears it open.  Inside is a\npretty, elegant dress.  Anne Marie kisses him.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tOh, sweetheart.  It's beautiful!\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou were looking at it in the\n\t\t\tcatalog.  Don't know where you\n\t\t\tcan wear it...\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI'll wear it for you.  And I can\n\t\t\twear it when we go home.  We\n\t\t\twon't be here forever.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(frowning)\n\t\t\tYou make it sound like a prison\n\t\t\tsentence.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tThat's not what I meant.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIt's exactly what you meant.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tLook, why get into this again.\n\t\t\tAs long as it's working, let's\n\t\t\tleave it alone.  It's been nice\n\t\t\tso far.  We're together --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t-- Permanently?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(sighs)\n\t\t\tDo I want to be with you\n\t\t\tpermanently?  Yes, I think I do.\n\t\t\tBut be with what you do and the\n\t\t\tway you live?  That I don't know.\n\t\t\tC'mon, Eric, until I met you,\n\t\t\tcoming back to Alaska was totally\n\n\t\t\tout of the question for me.  But\n\t\t\tI'm here.  I'm getting great\n\t\t\tpictures, and I'm having fun.\n\t\t\t(slips her arms around him)\n\t\t\tI love you.\n\t\t\t(kisses him)\n\t\t\tSo shut up and let's eat.\n\n\n\n38   EXT.  DEVIL'S CAULDRON - NIGHT\n\nAn old primer-grey station wagon rattles into town and\nparks.  With an unlit cheroot stuck in his mouth, \"VIKING\"\nBOB CORBETT gets out and stretches.  He's 38, six-foot-six,\nwith sandy hair, beard, ruddy skin, and his brother's dark\neyes.\n\nHe looks around for some sign of life.  He spots Neff\ntending one of the windmills and walks over to him.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tI'm looking for some trappers.\n\t\t\tBen Corbett, Mitchell, LeMalle.\n\t\t\tSeen 'em?\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tYesterday.  Said they were going\n\t\t\tto Cache.  They were thirsty, but\n\t\t\twe were voted dry.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tShit.\n\nAs Viking Bob walks back to his station wagon, he notices\nKenai poking around in front of Wilder's cabin.\n\nVIKING BOB'S POV\n\nIlluminated by a bare bulb is Wilder's typical bush-country\nfront yard.  Piled are five cords of wood, boxes, tarps,\nstove parts, saw horses, 55-gallon drums, dismantled snow\nmachines, wash tubs, tires, etc.\n\nBunching his collar around his neck, Kenai shivers and sorts\nthrough Corbett's traps.\n\nNEW ANGLE\n\nViking Bob ambles over to Kenai.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tThese yours?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tGonna make an offer.  Man who\n\t\t\towns them won't need them where\n\t\t\the's going.\n\n39   INT.  WILDER'S CABIN\n\nWilder peers out the window and sees Viking Bob, then turns\nto Corbett.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n39   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tBack against the bars.  Now.\n\nWilder handcuffs Corbett's hands to the cell door bars, then\nquickly wraps a piece of duct tape across Corbett's face,\ncovering his mouth.\n\nStuffing a .357 magnum in his belt, Wilder, coatless, slips\noutside.\n\nAs soon as he's out the door, Corbett cranes his neck and\npainfully tries to pry the tape off his face with the corner\nof the door hinge.\n\n40   EXT.  WILDER'S CABIN\n\nThe look on Wilder's face tells Kenai to shut up.  Viking\nBob realizes something's up.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tYour brother and the boys left me\n\t\t\tsome traps to sell for them.\n\t\t\tThey're gone --\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t-- To Cache.  So I heard.  Ben\n\t\t\tnever said nothing to me about\n\t\t\tselling his gear.\n\n41   INT.  WILDER'S CABIN\n\nCorbett gets the tape partially off his mouth.  He pries one\nof his boots off and kicks it through a window.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tBob!  They got me on a murder\n\t\t\tcharge!\n\n42   EXT.  WILDER'S CABIN\n\nWilder pulls his .357 out.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tSorry, Bob.  I'll have to keep\n\t\t\tyou here 'til I ship him south.\n\nViking Bob responds by flinging a heavy trap at Wilder, then\npunching him in the gut.  Wilder sprawls among the junk,\ndropping his revolver.  Kenai freezes, not about to take\nsides.\n\nBefore Viking Bob can come at him again, Wilder grabs for\nhis .357. Viking Bob jumps back and bolts for his car.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n42   CONTINUED:\n\nHe dives into his station wagon and starts it up.  As he\ndrives past, Wilder POPS off a few rounds, but Viking Bob\nkeeps going.\n\nNEW ANGLE\n\nKenai helps Wilder up.  Pissed, Wilder shoves him against\nthe cabin.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(continuing)\n\t\t\tYou stupid, greedy, loudmouth\n\t\t\tsonofabitch!  He'll have the\n\t\t\tothers here in a few hours.  You\n\t\t\tfucked me up, now you're gonna\n\t\t\thelp me move him.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\t(shakes head)\n\t\t\tForget it, Sam.  I never work for\n\t\t\tfree.\n\n43   INT.  THE TURTLE - NIGHT\n\nAnne Marie sits on the floor, editing one of her VIDEOTAPES.\nOn the monitor, it SHOWS footage of the traps under the\npipeline piling.  Eric comes out of the back module holding\ntwo ELT pendants.  He glances over at the monitor and nods\napprovingly.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI still can't believe I'm being\n\t\t\tfinanced by an oil company.\n\t\t\tEspecially when they get a look\n\t\t\tat these pictures.  Technology in\n\t\t\tthe wilderness; not too pretty.\n\t\t\t(re ELTs)\n\t\t\tWhat's that?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI thought I should check our\n\t\t\temergency transmitters.\n\nEric activates the ELT's.  They emit an SOS pattern of radio\nwaves -- three short, three long and three short.  This is\nvisible as rhythmic INTERFERENCE on Anne Marie's video\nMONITOR.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tAvalanche season is coming.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n43   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tWinter.  Two straight months of\n\t\t\tnight -- we may never get out of\n\t\t\tbed.\n\t\t\t(kisses him)\n\t\t\tWhich would suit me fine.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tProlonged darkness makes people\n\t\t\tcrazy.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tNot me.  I'm equipped.\n\nShe turns on a small S-VHS video camera and snaps off the\nroom lights.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(continuing)\n\t\t\tAllow me to give you a practical\n\t\t\tdemonstration of low-light\n\t\t\tinfrared photography...\n\nShe does so by seductively undressing for the camera.  She's\nSEEN on the MONITOR, illuminated by the \"light\" from the hot\nstove.  Eric appreciates the show.  He crawls toward her.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(continuing)\n\t\t\tHigh-tech in the wilderness.\n\t\t\tGets me excited, too.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tCome here...\n\nLaughing, he wrestles her to the rug.\n\n44   EXT.  HILLS ABOVE DEVIL'S CAULDRON - NIGHT\n\nThere is a full moon and a clear night sky.  Viking Bob's\nstation wagon is parked out of sight.  He sits inside,\nwaiting.\n\nHe hears an ENGINE starting in the distance.  Sitting up, he\ngrabs some binoculars.\n\nHIS POV\n\nWilder's extended cab truck pulls out, heading west.\n\n45   EXT.  FOOTHILLS - NIGHT\n\nIn the bright moonlight, two people are seen in Wilder's\ntruck as it speeds along a dirt road.\n\nViking Bob follows at a discreet distance, headlights off.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n45   CONTINUED:\n\nNEW ANGLE\n\nViking Bob turns and takes the literal high road -- a narrow\ntrail above the roadway that Wilder's truck is on.\n\nHe zooms ahead and gets in front of his quarry, then drops\nback down onto the road and waits in ambush.\n\nAs Wilder's truck approaches, Viking Bob turns on his bright\nlights and crouches behind his car door with a shotgun.\n\nWilder's truck screeches to a stop.\n\nCLOSER\n\nKenai gets out with his hands up.\n\nViking Bob slowly approaches Wilder's truck.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tBen?\n\nNo answer.  Viking Bob looks in the cab.  Kenai's passenger\nis Dixie, the Inupiat hooker.  Viking Bob grabs Kenai and\npushes the barrel of the shotgun hard against his cheek.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t(continuing)\n\t\t\tWhere's Ben Corbett?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tI have no argument with you, Bob.\n\t\t\tWilder said I could keep his\n\t\t\ttruck if I drove it ten miles\n\t\t\taway from town.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tWhere did they go?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tHe didn't say, but I would guess\n\t\t\tthe opposite way from here.\n\nViking Bob shoves Kenai against the truck, then punches him\nfor good measure.  Cussing, he runs back to his station\nwagon and drives off.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n46   INT.  THE TURTLE - REAR MODULE - NIGHT\n\nEric and Anne Marie are asleep.  Eric starts awake at the OS\nsound of a high-pitched vehicle HORN and an approaching\nENGINE.\n\n\n\n\n47   EXT.  HAUL ROAD - THE TURTLE\n\nEric pulls the door open.  Wilder is untying Corbett from\nthe snowmobile.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI got an emergency on my hands.\n\nCorbett smiles at Eric as he walks inside.\n\n48   INT.  THE TURTLE\n\nEric, Wilder and Corbett sit in the front module.  Anne\nMarie, nervous, wearing a down robe, serves coffee.  She\nstares at Corbett, trying to reconcile his quiet demeanor\nwith what she saw that afternoon.  Corbett smiles at Eric.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(to Eric)\n\t\t\t...You give us a ride in the\n\t\t\tCessna you got hangared at the\n\t\t\tpumping station, we'll be in\n\t\t\tFairbanks in a few hours.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThat's what we should've done in\n\t\t\tthe first place.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI could've sat tight for the\n\t\t\ttransport, 'til Bob came poking\n\t\t\taround.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Wilder; re Anne Marie)\n\t\t\tA lot to ask, dragging him away\n\t\t\tfrom such a good-looking girl --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(irritated)\n\t\t\t-- To take you to jail?  It'll be\n\t\t\tmy pleasure.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(to Eric)\n\t\t\tYou better get some sleep.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tGood idea.  Flying over mountains\n\t\t\tcan give you some nasty\n\t\t\tsurprises.  Go too low, one of\n\t\t\tthe clouds might have a big rock\n\t\t\tinside it.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n48   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(hard)\n\t\t\tI'll get you there all right.\n\nEric takes Anne Marie to the rear module, leaving Wilder\nwith his prisoner.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n49   INT.  THE TURTLE - LATER THAT NIGHT\n\nA bottle of Eric's Scotch sits almost empty on the table\nbeside Wilder.  Wilder dozes in a chair facing Corbett.\n\nCorbett is awake.  He contorts his body to bring his\nhandcuff chain under his feet and get his hands in front of\nhim.  He eyes Wilder's .357.  It's in a lefty Sam Browne\nholster.  No way to take it without waking Wilder.\n\nCorbett stands and inches toward the door.  As he pulls it\nopen, the insulation makes enough NOISE to stir Wilder.\n\nWilder gets up and pushes Corbett back into his chair.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tGoddammit, I don't need this\n\t\t\taggravation.  I'll shoot you,\n\t\t\tBen.  Bank on it.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI don't want to hurt you, Sam.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\tI'm not too old to knock the snot\n\t\t\tout of you!\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tNothing personal.\n\nWilder's mind clears enough to realize that Corbett's hands\nare in front of him.  He reaches for his .357.  Corbett\nbutts into Wilder's midsection with his head.  Amazingly,\nWilder stays on his feet.\n\nCorbett hurries back to the door.  Wilder lunges,\nbull-determined to hold onto him.  Corbett smashes Wilder\nacross the face with his clenched hands.  Wilder goes down\nhard, hitting his head on the table, and stays there.\nCorbett instinctively kneels to see if Wilder is still\nbreathing.  But then, hearing MOVEMENT in the rear module,\nCorbett flees.\n\n\n\n50   INT.  THE TURTLE - REAR MODULE\n\nEric is pulling on his pants.\n\n51   INT.  THE TURTLE - FRONT MODULE\n\nEric rushes in.  The outside door is open and Wilder lies on\nthe floor.   His holster is empty.  Anne Marie comes in and\ncrosses to Wilder.\n\nEric pulls a floor trap door open and digs through the\ncompany-issue equipment, coming up with a huge Remington\nbolt-action bear rifle.  Unfamiliar with weapons, Eric tears\nopen a box of shells and fumbles to load the rifle.\n\n52   EXT.  THE TURTLE\n\nCorbett is trying to start Eric's Scout.\n\nEric fires a loud warning SHOT from the Turtle doorway.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou want to try that handgun\n\t\t\tagainst this rifle, go ahead.\n\nCorbett sits in the Scout for a long moment, weighing his\nodds.  He takes his hands off the steering wheel...\n\nEric SHOOTS again, this time SMASHING the side-view mirror\nand window next to Corbett's head.\n\nStill handcuffed, Corbett gets out of the Scout.  Holding\nthe .357 gingerly by the butt, he puts it on the hood of the\nScout.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSome day you might have to face\n\t\t\tme without a gun.\n\n53   INT.  THE TURTLE\n\nEric leads Corbett in.  Anne Marie is cradling Wilder's\nhead. She's crying.  Eric looks at Wilder.  There is blood\ncoming from his ear and he's fading fast.\n\t\t\t\t\t\n\t\t\t\t\tWILDER\n\t\t\t(thickly)\n\t\t\tFetch him back?\n\t\t\t(Eric nods)\n\t\t\tDon't let him walk...\n\nEric nods again.  Wilder holds his gaze on Eric, then simply\nstops breathing.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n53   CONTINUED:\n\nEric is stunned.  Quietly, Corbett sits down.  Clutching the\nrifle, Eric sits on the floor and glares at Corbett.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(softly)\n\t\t\tDoes he have people?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(after a beat)\n\t\t\tA daughter in Oregon.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSend him down to her.  There's\n\t\t\tmoney in my duffel bag, back at\n\t\t\this cabin.\n\nCorbett's benign attitude is chilling.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI better call in.\n\nHe turns the shortwave radio on.  It SPARKS and burns out.\nThe remainder of the liquor has been poured inside it.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tThought of everything, huh?\n\t\t\t\t\t\n\n\t\t\t\t\tCORBETT\n\t\t\tSurviving is what I know --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t-- Killing is what you know.\n\t\t\t(to Anne Marie)\n\t\t\tPack some food while I prep for\n\t\t\tthe flight.\n\t\t\t(off her look)\n\t\t\tI'm sure not gonna let him go.\n\nCovering Corbett with the rifle, Eric handcuffs him to the\nsturdy metal bracket of a wall unit.\n\n54   EXT.  CACHE, ALASKA - (MOVING SHOT) - NIGHT\n\nViking Bob approaches in his station wagon on a narrow dirt\nroad.  The huge night sky all but smothers the weak light\nfrom the town up ahead.\n\nCache seems a mistake -- a jumble of unpainted buildings in\nthe middle of a big nothing, twenty miles north of the\nArctic Circle.  Still, it's more animated than Devil's\nCauldron.  There are a hundred permanent residents, several\ntaverns and a three-store, fly-in shopping center.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n54   CONTINUED:\n\nEven though it's the middle of the night, people roam the\nstreets, drinking and socializing.  With only a couple feet\nof snow on the ground, this is still summertime.  Under\nstorefront awnings, drunken INDIANS sleep on the concrete.\n\nViking Bob cruises the main drag, looking for the other\ntrappers.  He spots their jeep in front of a\ndangerous-looking saloon called the \"Bear Sign Inn.\"\n\nANGLE WITH VIKING BOB\n\nas he parks and gets out of his station wagon.  He hears a\nfamiliar VOICE around the side of the building.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE (OS)\n\t\t\tC'mon, girl, talk to me,\n\t\t\tnegotiate with me...\n\n55   EXT.  CACHE - ALLEY\n\nDrunk, LeMalle stands in an alley with a bored, acne-scarred\nOriental PROSTITUTE.  He weaves and leers, his hand stuck\ninside her blouse.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tLeMalle.  We got a problem.\n\t\t\tWhere's Mitchell?\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tGoddamn!  Viking Bob!  Mitchell's\n\t\t\tinside, boring bastard...\n\nGrumbling, Viking Bob separates LeMalle from the Prostitute\nand drags him by the collar out of the alley.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n56   INT.  BEAR SIGN INN - NIGHT\n\nMeyerling's campaign posters cover the walls.  Many have\nbeen pulled down and muddied underfoot by the drunken crowd.\n\nIn a booth covered with grafitti, Mitchell squints and works\non his scrimshaw.  LeMalle, somewhat sober, eats a plate of\nmuktuk -- whale blubber.  Viking Bob pours him more coffee.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(to Viking Bob)\n\t\t\t...Ben never sent a signal.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tMusta never got a chance to\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n56   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB (Cont'd)\n\t\t\tactivate.  Wilder's aiming to\n\t\t\ttake him to Fairbanks, we can\n\t\t\tcount on that much.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tMeaning he'll need a plane.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tClosest planes for hire are here\n\t\t\tin Cache.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tHang on...\n\t\t\t(to LeMalle)\n\t\t\tRemember that Cessna we saw at\n\t\t\tthe pumping station on the Haul\n\t\t\tRoad?  Belongs to the guy they\n\t\t\tgot patrolling the pipeline.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tThere you go.  Wilder's always\n\t\t\tchummy with the fuckin'\n\t\t\tBambi-lovers.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tIt's a long shot.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tYou got a better idea?\n\n57   EXT.  HAUL ROAD - THE TURTLE - DAWN\n\nWisps of light cut across the cold blue sky.\n\nEric comes out of the Turtle, leaving the front door ajar.\nHe throws a knapsack of supplies into the back of the Scout.\n\n58   INT.  THE TURTLE\n\nCorbett's right hand is still handcuffed to the wall unit.\nTerrified about being alone with Corbett, Anne Marie\ncautiously puts a cup of coffee in front of him.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHow long have you been up north?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(after a beat)\n\t\t\tSix months.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tCan't be.  Too keen a sense of\n\t\t\tthis place in your pictures.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n58   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tSix months this time.  I was born\n\t\t\tin the Aleutians.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYour people Alaskan?\n\nAnne Marie doesn't want to talk to a killer, but Corbett is\nso soft-spoken and charming that she answers despite\nherself.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tMy dad was a Navy doctor.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tKnew you had no native blood,\n\t\t\teven with your dark hair.  Blue\n\t\t\teyes give you away.  My wife had\n\t\t\tblue eyes.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tHad?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tShe's dead.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tOh.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHad some good years.  Met her in\n\t\t\t'66.  She showed up one day in\n\t\t\tColdfoot.  No one knew her.  One\n\t\t\tSunday morning, she marched into\n\t\t\ta bar and announced she was\n\t\t\tavailable as a wife to the\n\t\t\thighest bidder.  Didn't work out\n\t\t\tin three months, she'd return the\n\t\t\tmoney and leave, no hard\n\t\t\tfeelings.\n\t\t\t(off Anne Marie's amazed\n\t\t\t\tlook)\n\t\t\tMy bid was eight thousand\n\t\t\tdollars.  Beautiful girl.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tHow did she..?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI was gone, in September, laying\n\t\t\ttraplines.  She went to our cache\n\t\t\tfor some meat.  Got mauled by a\n\t\t\tbear.  Tore open her skull.\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n58   CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (Cont'd)\n\t\t\tMight've lived if she got help,\n\t\t\tbut the exposed part of her brain\n\t\t\tfroze.\n\nAnne Marie shudders.  Smiling good-naturedly, Corbett looks\naround, spotting the package Anne Marie's new dress came in.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tWhat about you -- why come back?\n\t\t\tClassy girl like you seems more\n\t\t\tsuited to the finer things.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tThat's why I left, moved to\n\t\t\tWashington.  When I met Eric I\n\t\t\twas doing day shoots -- products\n\t\t\tand fashion, mostly.  Pretty\n\t\t\tdull.  Eric was teaching college,\n\t\t\tand then he got the job with\n\t\t\tNorthland Oil.  We wanted to stay\n\t\t\ttogether, so we talked them into\n\t\t\tfunding some wilderness\n\t\t\tphotography... and here I am.\n\nAs she's talking, the Turtle ROCKS slightly.  She looks out\nthe tiny window.\n\nHER POV - THROUGH WINDOW\n\nEric is putting Wilder's body inside an enclosed storage\ncompartment built flush into the side of the Turtle.\n\nBACK TO SCENE\n\nHorrified, Anne Marie turns away.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou should know something.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI don't want to talk any more.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWasn't my intention to hurt\n\t\t\tWilder.  I'm telling you the\n\t\t\ttruth.  I liked the man.  I only\n\t\t\tmeant to get loose... to survive.\n\t\t\tYour cheechako boyfriend better\n\t\t\tunderstand that.\n\t\t\t(beat)\n\t\t\tListen, I've got some money put\n\t\t\taway --\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n58   CONTINUED:  (3)\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t-- Don't ever think you can buy\n\t\t\tEric off, Mr. Corbett --\n\t\t\t\t\t\n\t\t\t\t\tERIC (OS)\n\t\t\t-- Cheechako?\n\nEric comes in, none too thrilled about Anne Marie chatting\nwith Corbett.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(translating)\n\t\t\tOutsider.\n\nHe carefully stuffs Wilder's magnum in his belt and ignores\nAnne Marie's disparaging look as he does.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(to Corbett)\n\t\t\tLet's go.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tWait a second.\n\n59   INT.  THE TURTLE - REAR MODULE\n\nAnne Marie leads Eric out of earshot from Corbett.  Eric\nkeeps a cautious eye on him.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tMaybe you should drive him into\n\t\t\tDevil's Cauldron, let them decide\n\t\t\twhat to do with him.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(reassuringly)\n\t\t\tFairbanks is a three-hour flight.\n\t\t\tI'll be back by dinnertime.\n\nRealizing he's determined, she sighs and kisses him.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tBe careful, okay?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tThat's my line.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n\n\n60   EXT.  HAUL ROAD & FELDSPAR CREEK - DAWN\n\nEric and Corbett drive toward the deserted pumping station.\nThey cross over a prefabricated steel portal bridge spanning\na fast-running creek.\n\n61   INT.  SCOUT - (MOVING SHOT)\n\nThe wind whips through the shot-out wing window.  Corbett's\nhandcuffs are lashed to the seat frame with sturdy nylon\nrope.\n\n62   EXT.  PUMPING STATION\n\nThe pumping station consists of three corrugated steel\nbuildings.  The largest is an airplane hangar.\n\nJust beyond the hangar is a narrow blacktop landing strip\nrunning parallel to the Haul Road.\n\n63   INT.  SCOUT - ANGLE THROUGH WINDOW - (MOVING SHOT)\n\nEric pulls up to the hangar.  Suddenly, LeMalle steps out\nfrom behind the building.\n\n64   EXT.  PUMPING STATION\n\nLeMalle recognizes the International Scout.  He swings his\nrifle up to stop it.\n\nEric slams it in reverse and SCREECHES back around the\nhangar.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL (OS)\n\t\t\tAim for the tires!\n\nLeMalle FIRES as the Scout rounds the corner.  He hits a\nfender, doing no damage.  Angry, he runs after the vehicle.\n\n65   INT.  SCOUT - (MOVING SHOT)\n\nEric slams on the brakes and turns the Scout around.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLet me out and keep going.  They\n\t\t\tcatch us, they'll kill you.\n\nEric doesn't need any convincing of that.  He tears out.\n\n66   EXT.  PUMPING STATION\n\nMitchell runs out in front of them and BLASTS the front of\nthe Scout with his .45 Peacemaker.  Steam HISSES out of the\nradiator.  Eric floors it and races past Mitchell, almost\nhitting him.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n66   CONTINUED:\n\nMitchell and LeMalle SHOOT at the retreating vehicle.  One\nof the Scout's back tires gets blown out.\n\n67   INT.  SCOUT - (MOVING SHOT)\n\nEric slows, shifts into four-wheel drive and continues,\ndriving on the rim.\n\n68   EXT.  PUMPING STATION\n\nChewing an unlit cheroot, Viking Bob pulls up next to\nMitchell and LeMalle in the trappers' jeep.  They pile in.\n\n69   EXT.  HAUL ROAD\n\nEric backtracks as fast as possible in the crippled vehicle.\n\n70   INT.  TRAPPERS' JEEP - THROUGH WINDSHIELD - (MOVING SHOT)\n\nAs the Scout heads for the Feldspar Creek bridge, it\ndisappears from sight over a hill.\n\n71   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nViking Bob zooms over Feldspar Creek.  They come over the\nrise, but the Scout still can't be seen ahead of them.\n\nREVERSE ANGLE\n\nThe Scout sits idling in a depression near the creek bed,\nbelow the Haul Road.  Above, the trappers speed past without\nnoticing.\n\nAfter giving the trappers time to get around the next bend,\nEric drives the Scout up the embankment and crosses back\nover the bridge.\n\n72   INT.  SCOUT\n\nEric stops the vehicle.  He grabs a five-gallon gas can and\na piece of cloth from the back.\n\n73   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nThe prefab bridge is the transportable type used by the Army\nCorps of Engineers, left over from the building of the\npipeline.  Eric stuffs the gas can between the abutment and\nthe honeycombed underside of the bridge.  He puts the rag\ninside the spout of the can, lights it with a match and runs\nlike hell back to the Scout.\n\n\n\n74   EXT.  HAUL ROAD\n\nThe trappers realize their quarry is missing.  Viking Bob\nslams on the brakes and looks around.\n\n75   INT.  SCOUT - (MOVING SHOT)\n\nEric speeds away.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThey'll still catch us.  All\n\t\t\tyou're doing is pissing them off.\n\n76   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nThe gasoline can EXPLODES, tearing the bridge couplings away\nfrom the concrete abutment.\n\n77   EXT.  HAUL ROAD\n\nThe trappers see the explosion behind them.  They turn\naround and head toward it.\n\n78   EXT.  PUMPING STATION - HANGAR\n\nEric parks the Scout sideways to block the way to the\nairstrip.\n\nWith the magnum at the ready, Eric cuts Corbett's handcuffs\nloose from the seat and hurries him toward the hangar.\n\nThe leeward side of the structure is a huge metal door on\nrollers.  Eric unlocks it and rolls it back.  Inside is a\nCessna 182, dusted with snow and ice blown through the\ncracks by crosswinds.  Eric brushes the windshield with his\nsleeve.\n\n79   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nThe trappers pull up and find the far side of the bridge\nburning and disconnected from the creek bank.\n\n80   INT.  HANGAR - CESSNA\n\nEric helps Corbett into the cockpit, then secures his\nhandcuffs to the frame of the seat with more nylon rope.\n\n81   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nViking Bob assesses the damage to the bridge.  Loose from\nthe abutments, it wobbles like a diving board.  Below, the\nwater is too deep and fast-moving to be traversable.\n\n\n\n82   INT.  HANGAR - CESSNA\n\nEric tries to turn the ENGINE over.  The starter is sluggish\nfrom cold and lack of use.\n\n83   EXT.  HAUL ROAD & FELDSPAR CREEK\n\nViking Bob looks at the others, bursting with frustration.\nHe climbs into the driver's seat.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tGet in.  We can jump it.\n\nThey hop in.  He SCREECHES backwards to get a running start,\nREVS the engine, pops the clutch, and tears toward the\nbridge.\n\nAs they reach the midpoint of the bridge it begins to buckle\nunder them.  With a sickening WRENCHING, the crossbar\nsupports crumple.\n\nThe jeep flies through the still-burning gasoline, becomes\nairborne, and SCRAPES to a rude stop on the edge of the\npavement on the other side, the back wheels dangling in\nspace.\n\nLeMalle and Mitchell gingerly get out and push the ass end\nof the jeep onto solid earth.\n\n84   INT.  HANGAR\n\nEric finally STARTS the plane and taxis out onto the landing\nstrip.\n\n85   EXT.  PUMPING STATION\n\nThe trappers drive up to where the Scout blocks their path.\nThey pile out of their jeep and run toward the landing\nstrip.\n\n86   INT.  CESSNA - (AERIAL SHOT)\n\nIt picks up speed and takes off.\n\nANGLE THROUGH WINDOW - (AERIAL SHOT)\n\nBelow, the trappers watch the plane zoom over their heads.\nLeMalle points his carbine at it, but Viking Bob pushes the\nrifle down.\n\n87   INT.  CESSNA - (AERIAL SHOT)\n\nCorbett scowls as he sees the trappers helpless below him.\n\n\n\n88   EXT.  PUMPING STATION\n\nViking Bob watches, wide-eyed with fury.  Mitchell spits.\nLeMalle punches the wall.  Then he turns and repeatedly\nBLASTS the Scout, parked nearby, with his carbine.\n\n89   INT.  CESSNA - (AERIAL SHOT)\n\nEric's knapsack, an emergency kit and several five-gallon\ncans of aviation fuel are tucked behind the seats.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHow the hell were they smart\n\t\t\tenough to find us?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSmart?  Sure.  That's why I'm\n\t\t\tsitting in this plane and they're\n\t\t\tdown there blowing me kisses.\n\nEric retracts the landing gear and banks toward the\nsouthwest.  Corbett notices that Eric seems a little unsure\nof the controls.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tBeen driving long?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI needed a pilot's license to\n\t\t\ttake the job here, so I got one\n\t\t\tin six weeks.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThat makes the flight more\n\t\t\tinteresting.\n\nEric ignores the jibe.  He stays at 2,000 feet, making the\nlandscape all the more immediate.\n\nCorbett stares out the window and broods.  He spots an open,\nsnow-covered area where some dark blotches mar the\nwhiteness.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tSee the blood?  Pack of wolves\n\t\t\ttook down a moose.  Greedy,\n\t\t\tgut-ripping sons of bitches.  I'd\n\t\t\tkill the last wolf on earth,\n\t\t\tright in front of the President\n\t\t\tof the U.S.  Stinking, cowardly\n\t\t\tpredator, the wolf.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n89   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSounds like professional\n\t\t\tjealousy.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHunting and trapping was a damn\n\t\t\tfine life.\n\t\t\t(beat)\n\t\t\tMe and Mitchell, Bob and LeMalle,\n\t\t\twe were teams.  I'd always go\n\t\t\twith Mitchell.  Good man,\n\t\t\tMitchell.  I'd let Bob worry\n\t\t\tabout goddamn LeMalle.  We'd hire\n\t\t\ta plane in October.  On the way\n\t\t\tto a dirt airstrip somewhere,\n\t\t\twe'd drop supplies.  We'd land,\n\t\t\ttell the pilot to come back for\n\t\t\tus a few days before Christmas.\n\nANOTHER ANGLE - (AERIAL SHOT)\n\nWhile talking in an even tone, Corbett intently studies the\ninstrument panel and scans the landscape below.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThe idea was to get to the\n\t\t\tsupplies before the bears did.\n\t\t\tAlong the route we'd set our\n\t\t\ttraps.  Made our year's living in\n\t\t\tthree months.\n\nCorbett spots a flat plateau farther in the mountains, above\nthe tree line.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tLot of times we didn't even have\n\t\t\ta landing strip.  We'd set down\n\t\t\ton a plateau, like that one\n\t\t\tthere.  Yeah, that one's easy;\n\t\t\tyou could glide right in...\n\nSuddenly, he turns in the seat and pins Eric against the\ndoor with his left foot.\n\nThe plane flies erratically.  With his right foot, Corbett\nkicks the fuel jettison lever on the instrument panel,\njamming it on.\n\n90   EXT.  CESSNA - (AERIAL SHOT)\n\nThe lever, used to empty the fuel tanks in case of\nemergency, does so with great expediency.  All the gas is\ninstantly discharged.\n\n\n\n91   INT.  CESSNA - (AERIAL SHOT)\n\nCorbett releases Eric and calmly sits back up in his seat.\n\nEric rubs his neck, incredulous.  Corbett's move was too\nfast and too outrageous.  In a moment, the engine SPUTTERS\nto a stop.  Eric struggles to hold the stick steady and\nglide the plane down to the plateau Corbett pointed out.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHope you got your money's worth\n\t\t\ton those lessons.\n\n92   EXT.  CESSNA - (AERIAL SHOT)\n\nThere's an even chance of hitting a mountain instead of the\nplateau.  Eric pushes the Cessna's nose down.  The plateau\ncomes up fast.\n\nThe plane drops lower and lower, pitching and yawing in the\nwind.\n\nIt CRASH LANDS, its metal underbelly SCREECHING as it hits\nthe jagged granite under the snow.  It stops suddenly,\nflipping tail over nose.\n\n93   INT.  CESSNA\n\nIt rests upside down in the snow.  The men are dazed.\n\nBehind Eric, one of the extra fuel cans, now hanging upside\ndown, leaks gas.  In front of him, the engine is ON FIRE.\n\nEric undoes his seat belt and rights himself, but his leg\ngets caught in the tangled belt.  He pulls out a Swiss Army\nknife and cuts the rope binding Corbett's handcuffs to the\nseat.  Corbett pushes the passenger door open.  Panicking,\nEric tries to pull loose of his seat belt, painfully\nwrenching his ankle.\n\n94   EXT.  CESSNA\n\nCorbett rolls out into the snow.  With no time to grab his\nsupplies, Eric clambers from the wreckage.  He and Corbett\ncrawl/roll down the incline of the plateau, away from the\nplane.\n\nA moment later the leaking gas reaches the burning engine\nand the Cessna EXPLODES.\n\nWIDER\n\nEric tries to stand.  He cries out and falls into the\npowdery snow, clutching at his ankle.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n94   CONTINUED:\n\nCorbett realizes Eric is at a disadvantage.  But before he\ncan bolt, Eric grabs for the .357 magnum under his coat.  He\nlies on the snow, gasping, pointing the gun at Corbett's\nmidsection.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tStay put!\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou got the belly to look me in\n\t\t\tthe eye and pull the trigger?\n\nEric cocks the gun's hammer with his thumb.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tBe no different than shooting a\n\t\t\trabid dog.\n\nThe men face off for a tense moment.\n\nCorbett smiles and zips up his jacket, dispelling the\ntension.  Letting the hammer down, Eric looks back at the\nburning plane.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tNext time you want to kill\n\t\t\tyourself, don't include me.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI took the odds on getting down\n\t\t\tin one piece, and I made it.  Now\n\t\t\twe're in my territory.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWith light clothing and no\n\t\t\tsupplies, this is nobody's\n\t\t\tterritory.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou sound like the tourists.\n\t\t\tKnow-it-alls who read about\n\t\t\tsurvival in a magazine.  Fuck\n\t\t\tyou.  You won't make it off this\n\t\t\tmountain.\n\nCorbett drops his facade of conviviality.  Eric is too angry\nto be intimidated.  He takes the scarf from around his neck\nand wraps his ankle with it.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tLet's go.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n94   CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(re Eric's ankle)\n\t\t\tI'm not gonna carry you out of\n\t\t\there.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThat's right.  You're not.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLook, take these cuffs off.  We\n\t\t\tneed to work together.\n\t\t\t\t\t\n\n\t\t\t\t\tERIC\n\t\t\tForget it.\n\nEric holds his wristwatch up, points the hour hand at the\nsun, counts forward to noon, and, accordingly, makes an\napproximation of their direction.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tLast time I checked the flight\n\t\t\tplan, we were forty miles\n\t\t\tnortheast of Devil's Cauldron.\n\t\t\tSouthwest is that way.  No sense\n\t\t\twaiting for a goddamn taxi.\n\nGrimacing with pain, he gets up.  Clutching the magnum, he\nshoves Corbett in front of him and starts walking.  Corbett\nfrowns -- it's tough to trudge through the snow with his\narms cuffed tightly behind his back.\n\nEric looks around and tries not to let his emotions register\non his face.  They wouldn't be farther from the rest of\nhumanity on another planet.  Smelling fear on Eric, Corbett\nenjoys the view.  And waits.\n\n95   EXT.  ENDICOTT MOUNTAINS - LATER THAT DAY\n\nThe Endicott range is full of jagged peaks, icy streams and\ngnarled tundra valleys.  Squinting in the glare of the snow,\nEric and Corbett trek through the grandiose Gates of the\nArctic area.  The smoldering plane wreckage is a hard-won,\nsnow-covered mile behind them.\n\nIntricate patterns of fragmented rock, strips of scruffy\ntundra and bedrock outcrops produce lonely, foreboding\nmosaics upon the landscape.  The air is still.  The silence\n\nis itself a disconcerting presence.  Ten miles ahead and two\nthousand feet lower, the forest begins.  But here, on the\nrock face of the mountains, Eric and Corbett might as well\nbe in a desert.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n95   CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIt'll be interesting, trying to\n\t\t\tbuild a fire without any wood.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWelcome to the environment, Mr.\n\t\t\tEcology.  Out here, one mistake\n\t\t\tis all you get.\n\nDetermined and dour, Eric pushes on.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tWhy in hell you care enough about\n\t\t\tme to die taking me in?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI don't plan on dying.\n\nIt's all academic.  The sheer magnitude of the surroundings\nmakes them feel they're the only people in the world.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n96   EXT.  ENDICOTT MOUNTAINS - DUSK\n\nThe sun drops behind the mountains.  A wind whips up,\nchilling the men through their clothing.  Eric tries not to\nshiver.  He spies a small rock formation with a granite\nelbow protruding from it, making an enclosed triangle of\nsolid rock.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe'll stop here, dig out a snow\n\t\t\tshelter.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSnow shelter.  Okay.  You dig.\n\t\t\tI'll have a little sit-down.\n\nCorbett sits on his haunches and smiles while Eric digs near\nthe rocks.  Although he knows Corbett is testing his every\nmove, Eric refuses to let his patronizing air get to him.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tEven in the drifts, this snow's\n\t\t\ttoo powdery to make a shelter.\n\t\t\tWhen you're done jerking around,\n\t\t\treach down the back of my coat.\n\nEric approaches him suspiciously.  He puts his hand down\nthrough Corbett's collar.  Something is stowed inside a\nhomemade flap in the lining of his coat.  Eric pulls out a\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n96   CONTINUED:\n\nfolded nylon tarp with twine threaded through corner\neyeholes.  He shakes the eight by eight orange tarp open...\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n97   EXT.  NYLON SHELTER - EVENING\n\nEric and Corbett have stretched the tarp out tent-style next\nto the granite rock formation, making a minimal but\nfunctional refuge from the cold night.\n\n98   INT.  NYLON SHELTER\n\nThe men huddle inside the tarp.  Eric keeps a wary eye on\nCorbett -- at all times he treats him like a rattlesnake.\nEric unwraps his ankle and rubs it.  It's swollen to the\nsize of a softball.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tStill quite a hike to Devil's\n\t\t\tCauldron.\n\t\t\t(beat)\n\t\t\tDays.  A long stretch to go\n\t\t\twithout sleep, my friend.  You\n\t\t\tcan hide behind that pistol for\n\t\t\tnow, but take your eyes off me\n\t\t\tlong enough to sneeze --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t-- Turn around.\n\nWhile poking the .357 in Corbett's ribs, Eric one-handedly\nunlocks Corbett's right manacle, pulls his arm through the\ngranite elbow, then locks it back up again.  He's learning.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tFADE TO:\n\n99   EXT.  HAUL ROAD - DREAM  - (AS IN SCENE 3)\n\nEric is hurrying along the pipeline in his business suit,\nfollowing the predator's paw prints in the snow.  He peers\nahead and his prey becomes visible.  But it isn't a wolf,\nit's Corbett.  His hands and face are covered in blood.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tEND DREAM\n\n100  EXT.  ENDICOTT MOUNTAINS - DAWN\n\nThe sun peeks over the mountain tops, drenching them with\nlight and color.\n\n\n\n101  INT.  NYLON SHELTER\n\nThe light hits Eric's eyes.  He bolts awake from a fitful\nsleep.  Corbett sits, already awake, looking like he'd\nuproot the rock to which he's chained if he could.  He waits\nfor an opportunity -- any opportunity -- with the patience\nof a vulture.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n102  EXT.  ENDICOTT MOUNTAINS - SMALL VALLEY - DAY\n\nEric and Corbett trudge up to the bank of a frozen stream\nbisecting their path.  It's simple -- to continue, they have\nto cross it.  Corbett takes in the scenery, in no particular\nhurry.  Frustrated, but making dead sure he's always got the\ndrop on Corbett,  Eric puts a tentative foot on the ice.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tIce is too thin -- you can see\n\t\t\tthe water moving underneath.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe're not sitting here 'til\n\t\t\tNovember.  There's a cargo plane\n\t\t\tcoming to Devil's Cauldron in\n\t\t\tfour days, and I'm putting you on\n\t\t\tit.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWe get wet, we freeze to death in\n\t\t\ta couple hours.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI've been on ice like this when I\n\t\t\twas a kid, skating.  Spread your\n\t\t\tweight, keep moving.  Go on.\n\nCorbett is not about to be outdone in the guts department by\nsomeone with a Master's Degree.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(gestures 'you first')\n\t\t\tBe my guest.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(points .357)\n\t\t\tI'm right behind you.\n\nFrowning, Corbett tentatively steps onto the ice and inches\nacross the fifteen feet to the other bank.\n\nNEW ANGLE\n\nHe turns and, indeed, Eric is right behind him.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n102  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWait 'til I'm across!\n\nEric doesn't want to be too far from his prisoner.  He keeps\ncoming.  The ice GROANS and HISSES under their weight.\n\nCorbett is three feet from solid ground.  He drops to his\nknees, then stomach, and rolls like a log the rest of the\nway.\n\nEric splays out on the ice and crabwalks across.  The ice\nmakes an ominous CRACKING and water begins to seep through\nair holes.\n\nStanding, Corbett weighs his chances of bolting from Eric.\n\nEric crawls doubletime.  He makes it onto solid ground just\nas the ice under him breaks off in a big, thin, clear plate.\n\nCLOSER\n\nEric sits on some rocks.  Corbett glares it him.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tMost dangerous thing in the\n\t\t\tworld: A regular Joe, in over his\n\t\t\thead.  You trying to prove how\n\t\t\ttough you are for me, or for\n\t\t\tyourself?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIt wasn't my idea to crash the\n\t\t\tplane.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLet's camp.  There's grayling\n\t\t\tunder this ice. I'll snare some\n\t\t\tfor dinner.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(standing)\n\t\t\tWe've got another two hours of\n\t\t\tdaylight.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tPushing it is flat wrong.  All\n\t\t\tyou prove is your ignorance about\n\t\t\tbreaking trail.\n\nEric is not convinced.   Grumbling, Corbett gets up and\ntakes the lead as they continue southward.\n\n\n\n103  INT.  THE TURTLE - DARKROOM - DAY\n\nTrying to keep busy, Anne Marie develops some prints in the\ndarkroom she's made from the front bathroom.  She glances at\nher watch and sighs, her mind on Eric's overdue return.\n\n104  INT.  THE TURTLE - FRONT MODULE\n\nAnne Marie comes out of the darkroom and hangs the prints up\nto dry.  Outside, (OS), a car HORN blares a couple of times.\nGrinning, she runs to the door.\n\n105  EXT. / INT.  THE TURTLE\n\nMeyerling's Dodge truck pulls up.  Anne Marie comes outside.\nHer smile wilts when she sees it's not Eric.  As Meyerling\nclimbs the embankment to the Turtle, he glances at Wilder's\nsnowmobile parked alongside the Turtle.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI've been trying to raise you on\n\t\t\tthe shortwave for two days.\n\nHe pushes past Anne Marie and goes into the Turtle.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tHave you talked to Eric?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI have not, but I very much want\n\t\t\tto.  What do you know about the\n\t\t\ttrouble in Devil's Cauldron?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI was hoping you had some news --\n\t\t\t\t\t\n\n\t\t\t\t\tMEYERLING\n\t\t\t-- Get this straight: I'm the\n\t\t\tDistrict Supervisor.  Whatever\n\t\t\tyou do reflects on me.  It wasn't\n\t\t\tmy idea to bring you people up\n\t\t\there, but I'm stuck with you.\n\t\t\tYou are absolutely not to involve\n\t\t\tyourself in any local disputes.\n\t\t\tWhichever side you take, you\n\t\t\talienate the other.  Mr. Corbett\n\t\t\tis quite well-known in this\n\t\t\tregion.  People admire him --\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t-- Corbett's a killer.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n105  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI don't care if Ben Corbett makes\n\t\t\tmeatloaf out of nuns and babies,\n\t\t\the's not your concern.\n\t\t\tUnderstood?\n\nAnne Marie just glares at him.  Meyerling examines the\ndamaged shortwave.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(continuing)\n\t\t\tWhat happened here?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tThe radio's on the fritz.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tWhere'd you say Eric is?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tSomewhere along the pipeline.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tWhat about that hotheaded\n\t\t\tmarshal, Sam Wilder?  I heard he\n\t\t\twas in the middle of this mess.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tSam?  We haven't seen him.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tReally.  I thought maybe that was\n\t\t\this snowmobile outside.\n\t\t\t(beat)\n\t\t\tBy the way -- your truck also 'on\n\t\t\tthe fritz?'\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(blanching)\n\t\t\tWhy?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tIt's out by the pumping station,\n\t\t\tshot full of holes.\n\nNoting Anne Marie's distressed reaction to this news, he\ncrosses to the door.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(continuing)\n\t\t\tStill nothing to tell me?\n\t\t\t(no reply)\n\t\t\tSuit yourself.\n\n\n\n106  EXT.  ENDICOTT MOUNTAINS - DAY\n\nEric limps further down from the mountains.  Corbett keeps\npace in front of him and his magnum.  As their altitude\ndecreases, there is ever thicker vegetation.\n\nTheir tracks in the snow stretch up behind them into the\ndistance.  The magnificence and grandeur of the surroundings\ncannot be overstated.  Picture the most rustic, overwhelming\nwilderness imaginable, and then make it ten times larger.\n\nNEW ANGLE - LATER\n\nThe men's way is once again interrupted, this time by a\nsheer granite drop. The steep decline would be tough to\nnegotiate with mountaineering equipment and proper footwear.\nCorbett peers over the edge and shakes his head.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHave to backtrack, find another\n\t\t\tway down.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tForget it.  It would take days.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(assessing the drop)\n\t\t\tGoing to be a bit of a challenge\n\t\t\twith handcuffs on.\n\nEric realizes he's right.  After some deliberation, Eric\ncautiously approaches him.  With the .357 cocked and ready,\nhe undoes one of the cuffs, leaving them hanging from\nCorbett's wrist.  He then unthreads the nylon twine from\nCorbett's tarp.\n\nANGLE - GRANITE SHEER\n\nEric and Corbett are tied, belt to belt, with the nylon\nrope.  Corbett inches down first, feet spread for maximum\nfooting, gloveless hands grasping at anything.\n\nEric mimics Corbett's moves and follows the same path.\nUnable to grasp the rocks effectively, he stops and takes\nhis gloves off.  Continuing, he winces -- the rock is cold\nand sharp.  His hands are soon numb and bloody.  Even in the\ndry, below-freezing air, Eric is sweating.\n\nHe looks down and hangs on more tightly.  Sliding to level\nground two hundred feet below would pummel him to hamburger.\nCorbett pauses and rests his cheek against the rocks.  Eric\nis right above him.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n106  CONTINUED:\n\nSuddenly, Corbett's foot slips.  His right hand\ninstinctively goes for a hold.  The dangling handcuffs snare\non a protuberance, knocking him off balance.\n\nThe fulcrum of Corbett's body leans out into the empty air.\nEric moves down a little, braces himself and extends his\nleg, giving Corbett something to grab.  Corbett takes hold\nof Eric's shoe and tries to teeter back against the rock\nwall.  Adrenaline screams through Eric's system.\n\nCorbett looks up at Eric.  A careless move will send them\nboth tumbling.  Eric clutches harder at the rocks and waits\nfor the worst.\n\nAfter a long moment, Corbett regains his balance and lets go\nof Eric's foot.  He continues his descent.  Eric lets out\nhis breath and tries to swallow.  His mouth is as dry as the\ngranite.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n107  EXT.  TREELINE - LATER THAT DAY\n\nHandcuffed again, Corbett hikes in front of Eric along the\ntop of some foothills.  Now and again he glances behind,\ngauging Eric's weariness, waiting for a moment's\ncarelessness.  Around them there is heavy vegetation now --\nsnow-covered sedge tussocks, knee-deep muskeg and twisted\nthickets that are treacherous and slow to tramp through.\nAbove them, ominous clouds and sharp, cold winds are coming\ndown from the north.\n\nBut below, a mile ahead, the edge of the forest is like the\nhem of a great green garment stretching endlessly southward.\nThe combination of altitude and latitude creates an\namazingly sharp topographical dividing line.  Within a few\nthousand yards, the landscape abruptly changes from scrub\nbrush to thick coniferous forest.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tBetter get into those trees\n\t\t\tbefore that squall blows down.\n\nThen, Corbett pauses as a walloping sound ECHOES across the\nfoothills.\n\nJust ahead, two enormous bull moose are fighting.  They ram\neach other with six-foot-wide antlers.\n\nCorbett stares, transfixed, admiring.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou talk about ecology -- there\n\t\t\tit is.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n107  CONTINUED:\n\nEric turns, surprised at Corbett's unabashed awe.\n\nCatching the men's smell the moose bound away, and the spell\nis broken.\n\n108  EXT.  MINING SETTLEMENT - EVENING\n\nViking Bob, Mitchell and LeMalle head somberly back to\nCache.  They drive along a hydraulic gold mining sluice on a\nnearby river and come into town.\n\nAs the trappers park their jeep, some MINERS greet them,\nshouting over the ROAR of the water.\n\t\t\t\t\t\n\t\t\t\t\tMINER #1\n\t\t\tWhere's Ben at?\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tYou'll want to hear about it with\n\t\t\ta drink in your mitt.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n109  INT.  BEAR SIGN INN - CACHE - EVENING\n\nOutside, a STORM rages.  LeMalle is drunk, but still able to\nstuff himself with a thick steak.  Mitchell drums his\nfingers and listens to everyone talk.  With them at the bar\nare the Miners, LOGGERS, CAT SKINNERS (bulldozer drivers)\nand some leathery WOMEN.\n\t\t\t\t\t\n\t\t\t\t\tMINER #1\n\t\t\t...Figures, Corbett getting\n\t\t\thauled off by a Federal marshal.\n\t\t\tGod almighty, how I hate the U.S.\n\t\t\tgovernment.\n\t\t\t\t\t\n\t\t\t\t\tLOGGER\n\t\t\tWe should pass a hat.  Send\n\t\t\tCorbett a few bucks.  We owe him.\n\nSomeone's hat comes off.  It quickly gets filled with bills.\n\t\t\t\t\t\n\t\t\t\t\tMINER #1\n\t\t\tGovernment and business.  They\n\t\t\truined this state.\n\t\t\t(re Meyerling poster)\n\t\t\tLike that little weasel, for\n\t\t\tinstance.\n\t\t\t\t\t\n\t\t\t\t\tWOMAN CAT DRIVER\n\t\t\t'People's Friend,' my lily-white\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n109  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tWOMAN CAT DRIVER (Cont'd)\n\t\t\tbutt.  I heard Northland got a\n\t\t\tconservation program, up along\n\t\t\tthe pipeline.\n\t\t\t\t\t\n\t\t\t\t\tLOGGER\n\t\t\tHold it.  Meyerling told me that\n\t\t\tstuff's nothing but P.R. for the\n\t\t\tTV and papers down in Juneau.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tHe's full of shit.  We got run\n\t\t\tout of there by some fuckhead\n\t\t\tdriving a Northland truck.\n\nNEW ANGLE\n\nViking Bob hurries in and whispers something in Mitchell's\near.  Mitchell shoots LeMalle a look and gets up.  The\nthreesome hastily exit, leaving behind the hat full of\nmoney.\n\n\n110  INT.  BEAR SIGN INN\n\nViking Bob, Mitchell and LeMalle stand in a quiet corner\nnear the front door.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tI called the cops in Fairbanks,\n\t\t\tsee when Ben is standing trial.\n\t\t\tThey don't know shit about Ben or\n\t\t\tWilder!\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tGet the fuck out of here.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tIt's a three-hour flight.  They\n\t\t\tshoulda got there yesterday.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tMaybe they went back to Devil's\n\t\t\tCauldron.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tNaah, Wilder knows we got friends\n\t\t\tin town.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tThat plane might've been to throw\n\t\t\tus off the track.  Remember the\n\t\t\tbait-and-switch Wilder pulled\n\t\t\twith the Eskimo and his truck?\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n110  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tWilder still woulda made\n\t\t\tFairbanks by now.  Fuck a duck!\n\t\t\tBen musta got loose.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tOkay, let's backtrack, try to\n\t\t\tpick up his trail.  You know the\n\t\t\tkid out on the pipeline that\n\t\t\tWilder's buddies with?\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(smiles)\n\t\t\tWe were just talking about him.\n\n111  EXT.  FOREST - CAMPSITE PREPARATION MONTAGE - EVENING\n\nThe STORM brings gusting winds and below-zero temperatures.\nEric and Corbett move through the storm in slow motion.\nBoth recognize the need for a truce in the face of a common\nenemy.  The snow and wind cut through their clothing like\nrazors.  They poke around for dead wood with which to make a\nfire.  The trees are small and healthy; little is found.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(shouts over WIND)\n\t\t\tJust gather birch.  It'll smoke\n\t\t\tlike hell, but it'll burn green.\n\nAwestruck by the intensity of the storm, Eric tears branches\nfrom birch trees and piles them in Corbett's handcuffed\narms.\n\nThey hurry back to the nylon tarp, strung between two tree\ntrunks, FLAPPING violently in the storm.  Hunching against\nthe wind, Eric pulls off his gloves and reaches in his\npocket for some precious matches.  His fingers are so cold\nhe can't hold them, and he drops several in the wet snow.\n\nAngry, he shoots a look at Corbett. Corbett is holding his\nhands inside his coat.  He pulls them out and quickly takes\nthe remaining matches from Eric.\n\nCrouching down, back to the wind, Corbett grasps a match\nbetween his numb fingers and awkwardly strikes it.  He holds\nthe flame next to the kindling.  It doesn't catch fire\nimmediately.  Corbett lets the match burn out against his\nfingers.  He tries another match.  This time, a flame takes\nhold but could succumb to the wind at any moment.\n\nOn his knees and elbows, Corbett nurses along the tiny fire.\nEric can't control his shivering.  He gets on his knees next\nto Corbett and holds his coat open to further baffle the\nwind.  Corbett keeps his hands cupped around the flame, not\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n111  CONTINUED:\n\ncaring that it's burning his skin.  Finally the fire begins\nto grow.  Relieved, Eric and Corbett look at each other with\na glimmer of a grudging mutual respect.\n\nThe fire, now unattended, is smoky as Corbett predicted, but\nburns along nicely.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tEND MONTAGE\n\n112  EXT. / INT.  NYLON SHELTER - NIGHT\n\nCorbett and Eric sit under the nylon shelter.  The STORM\nrages outside.  Eric empties his pockets of Eskimo potato,\nreindeer lichens, bistsort sorrel and other plants for his\ndinner.\n\nCorbett has fashioned a snare from his boot laces and a tree\nbranch, and placed some crushed roots as aromatic bait next\nto a small animal burrow outside the shelter.  A squirrel\nsticks his nose out of the burrow to investigate.\n\nCorbett sits catlike, ready to pounce.  Eric grimaces as\nCorbett yanks on the snare and the squirrel's SQUEALS (OS)\nabruptly cease.\n\n113  INT.  NYLON SHELTER\n\nCorbett pulls his dead dinner inside.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI need your pocket knife.\n\t\t\t(Eric hesitates)\n\t\t\tI have to eat, too.\n\nAfter a beat, Eric pulls open the small blade on his Swiss\nArmy knife and pushes it with his foot to Corbett.  Smiling,\nCorbett admires the fancy knife.  Then, BELOW FRAME, he\nskins and guts his catch.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tDamn lucky this storm didn't blow\n\t\t\tdown when we were on those\n\t\t\tbaldheaded mountains.  It\n\t\t\tcontinues, we better stay put.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIt could blow over tomorrow, too.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI'm still figuring: You're either\n\t\t\treal brave or real dumb.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n113  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI just want this over with.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(laughs)\n\t\t\tWhere in hell Meyerling dig you\n\t\t\tup?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou know Meyerling?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSure.  The People's Friend.  Kiss\n\t\t\tyour ass with precision if\n\t\t\tthere's a vote in it.\n\n\nCorbett eats the squirrel Eskimo-style.  Raw.  He uses the\nknife like a native, too, holding the meat in his teeth,\nthen expertly cutting off a mouthful with a quick slice.\nEric stares, disgusted.  Off his look:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tAlways eat your meat raw when the\n\t\t\tweather's cold.  Does you more\n\t\t\tgood, long as the entrails look\n\t\t\tclean.\n\nCorbett uses snow and the squirrel's fur to wipe the blood\nfrom his face, then wipes the knife off and lays it, open,\nnext to his leg.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI'll hold onto that.\n\nWith a wry smile, Corbett pushes it back over to Eric.\nWhile Eric eats his dinner, Corbett listens to the STORM and\nwatches him eat.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSure love to know where you fit\n\t\t\tin up here.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI'm here to do my job.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou want to fool yourself about\n\t\t\tthat bullshit job, fine.  Damn\n\t\t\tshame you have to drag your\n\t\t\tgirlfriend along.  You think a\n\t\t\twoman like that will be happy\n\t\t\tmaking moose stew for a man\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n113  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (Cont'd)\n\t\t\tmaking your salary?  Look, I'll\n\t\t\tgive you five grand.  Take the\n\t\t\tmoney and go home where you both\n\t\t\tbelong.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tDon't fucking insult me.\n\nCorbett smiles -- maybe he's beginning to understand Eric.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tFolks come to Alaska for a real\n\t\t\tshort list of reasons:  Money.\n\t\t\tAdventure.  Solitude.  Those\n\t\t\tcover most everyone.  But\n\t\t\tfrontiers also draw another type\n\t\t\tof man.  One with a demon in his\n\t\t\tgut.  He comes to the edge of the\n\t\t\tworld to face that demon, and lay\n\t\t\tit to rest.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYeah?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYep.  Sometimes they do, but\n\t\t\tusually they end up crazy or\n\t\t\tdead.\n\nEric ponders Corbett's words as he eats.\n\n114  INT.  THE TURTLE - NIGHT\n\nAnne Marie is frantic with worry.  She has the AM/FM RADIO\non for company.\n\t\t\t\t\t\n\t\t\t\t\tRADIO (VO)\n\t\t\t...This is \"Tundra Topics\" on\n\t\t\tKFAR.  Remember, as the nights\n\t\t\tget longer, be sure to stay on a\n\t\t\tregular sleep schedule.  The\n\t\t\tdepression from the coming of\n\t\t\twinter that doctors call\n\t\t\t'Seasonal Affective Disorder' --\n\t\t\tor 'Arctic Blue' to us lay folk\n\t\t\t-- is preventable.\n\nAnne Marie tunes the radio to \"Pipeline of the North\" on\nKIAK.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n114  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tRADIO (VO)\n\t\t\t(continuing)\n\t\t\t...John Byers was hospitalized in\n\t\t\tFairbanks today for an infection\n\t\t\tin an abscessed tooth.  Mr. Byers\n\t\t\thad a toothache and attempted to\n\t\t\tremove the tooth himself with a\n\t\t\tpair of pliers...\n\nSuddenly, a BUMP rocks the Turtle.  Someone is outside.\nStartled, Anne Marie turns the lights off and looks out the\nwindow.\n\nNo sign of a vehicle or a person.  As she pulls on her\nparka, she glances at the big rifle leaning against the\nwall, but doesn't touch it.\n\n115  EXT.  THE TURTLE\n\nHer visitor, whoever it is, is behind the Turtle.  Anne\nMarie cautiously rounds the corner and stops dead.\n\nNEW ANGLE\n\nA foraging GRIZZLY sniffs around, attracted by the smell of\nfresh carrion -- Wilder.  Eight feet tall and eleven-hundred\npounds, it's used to having its way.  Right now, it's\nhungry.\n\nWith a casual swipe of its paw, its massive claws puncture\nthe Turtle's aluminum skin, popping open the door of the\n\nutility compartment.  The bear pokes its head inside, and\nWilder's body slumps out into the snow.  The bear pushes at\nthe corpse with its snout.  Salivating, it prepares to dig\nin.\n\nAnne Marie looks around, wondering what the hell to do nEXT.\nWilder's snowmobile is a few yards behind her, parked\nagainst the side of the Turtle.  She inches toward it.\nTestily, the bear looks up, SNIFFING loudly.\n\nKeeping her eyes on the bear, Anne Marie feels for the\nsnowmobile ignition keys.  They're not there.  She feels\naround inside the saddlebags and finds three emergency road\nflares.\n\nAnne Marie IGNITES the flares.  They illuminate the area\nwith an eerie reddish glow.  She YELLS at the bear, wields\nthe flares like Excalibur and moves forward.\n\nThe bear, reluctant to leave so hearty a pre-hibernation\nmeal, GROWLS and cocks its head back and forth to assess the\nthreat.  As Anne Marie inches ahead, the bear stands on hind\nlegs to its full height to meet the challenge.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n115  CONTINUED:\n\nAnne Marie tosses a flare toward the bear.  It grunts when\nthe flare hits it, and shuffles backwards.  Anne Marie\nthrows another flare.  With a ROAR from hell, the bear\ncharges.  Anne Marie falls back.  Still holding the last\nflare, she's forced into a crawl space under the Turtle.\n\nANGLE - UNDER THE TURTLE\n\nAnne Marie tries to squeeze out the other side, but she's\npinned in by the unevenness of the hard ground.  The bear\nswipes at her, its huge paw inches away.  Anne Marie jabs at\nthe paw with the flare, but that only makes the bear more\nquarrelsome.\n\nShe twists around, looking for a defense.  Above her is the\ncabling from the generator to the circuit box for the\nTurtle's electrical system.  She tugs at it, but it won't\nbudge.  The bear SNIFFS at Anne Marie with its big wet\nsnout.  Anne Marie notices warning a sign on a control\nvalve:\n\t\t\t\t\t\n\t\t\t\t\t?  DANGER!!\n\t\t\t\t\t\n\t\t\t\t\t?  BLACK WATER\n\t\t\t\t\t\n\t\t\t\t\t?  UNTREATED SEWAGE\n\nGrimacing, she tries to turn the valve.  After much effort,\nit SNAPS and opens, releasing a stream of fetid sewage.\n\nWIDER\n\nThe bear gets a muzzle full of the stuff.  HOWLING\nunhappily, it backs away, GRUNTING and SNEEZING.  Greatly\noffended, its appetite gone, it lopes into the forest.\n\nAnne Marie squirms out from under the Turtle and, gagging\nfrom the horrible smell, pulls off her wet parka.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n116  EXT.  WOODS NEAR THE TURTLE - SERIES OF SHOTS - NIGHT\n\nWearing one of Eric's coats, Anne Marie stands in the center\nof three similarly-sized trees.  A FLARE supplies the light.\nThe big Remington rifle leans against the tree closest to\nher.\n\nShe tosses one end of a hundred feet of nylon rope over a\nsturdy tree branch twenty-five feet from the ground.  Then\nshe throws the other end over an opposing branch and\nstretches the rope like a clothesline.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n116  CONTINUED:\n\nShe attaches a second length of rope perpendicular to the\nfirst and throws it over a third tree branch, midway between\nthe other two.  She kneels and ties something BELOW FRAME to\nthe cross-length rope.\n\nPulling mightily on the perpendicular rope, she hoists\nsomething heavy to the level of the branches.  The flare\nburns out, plunging the area into darkness.\n\nAnne Marie wraps the rope around the tree trunk and\nnervously tries to LIGHT another flare.  As she does, the\nforest seems closer, sinister, filled with lurking ogres.\nSeized with an instinctual fear, she grabs the rifle and\nruns back to the Turtle.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tFADE TO:\n\n117  EXT.  ENDICOTT FOOTHILLS - DAY\n\nThe storm has passed, leaving a fresh covering of powdery\nsnow in drifts like sand dunes.  Eric and Corbett trek\ntoward Devil's Cauldron through the ever-thickening forest.\nCorbett has made them snow goggles by cutting slits in\nstrips of tree bark worn like sunglasses.  Eric, using a\ntree branch as a walking stick, still limps on his sore\nankle.  For the first time, he keeps the magnum stuck in his\nwaistband.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThere's a cabin, maybe twenty\n\t\t\tmiles south of here.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(kneels to adjust his ankle\n\t\t\t\twrap)\n\t\t\tToo bad we're heading west.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThere's a snowmobile. Inside a\n\t\t\tday we could be on the Yukon.  I\n\t\t\tgot money there.  Remember that\n\t\t\tfive thousand?  Make it ten.  Be\n\t\t\tsmart.  Take it and walk away.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(bristling)\n\t\t\tYou don't get it, do you?\n\nCorbett takes advantage of Eric's poor peripheral vision\nfrom the visor by kneeing Eric in the face.  Eric falls\nbackwards into the snow.  Corbett takes off like a\njackrabbit.  Eric spits out some blood, shakes the stars out\nof his eyes and yanks the .357 from under his coat.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n117  CONTINUED:\n\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tStop!\n\nCorbett bounds through the snow, dodging trees and\nsnow-covered rocks.\n\nEric squeezes off a SHOT, and is startled by the recoil and\nthe blast.  He scrambles to his feet and SHOOTS again.\n\nCorbett zigzags and disappears from sight over a snowbank.\n\nNEW ANGLE - FOLLOW CORBETT\n\nCorbett runs over a frozen stream, invisible under a cover\nof snow.  Suddenly, the ice SHATTERS under him.  Corbett is\nimmersed in frigid, waist-deep water.  He gasps from the\nsudden temperature drop.\n\nERIC\n\nhobbles after him, CUSSING bitterly to himself.\n\nCORBETT\n\ncrawls to solid ground.  Disoriented from the shock to his\nsystem, he rolls over to catch his breath.\n\nWIDER\n\nEric appears over a snowbank.\n\nCorbett tries to run, but his frozen, waterlogged legs feel\nlike pig iron.  Stumbling and panting, he looks for a safe\nplace to cross the stream.  Eric easily catches up to him.\nCorbett sits in the snow, shivering.  He looks up as Eric\ntrots over.\n\nEric glares at Corbett and rubs the bruise on his cheek.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tNothing personal.  Just wanted to\n\t\t\tsee what you'd do.\n\nNoticing Corbett's sopping legs, Eric becomes furious.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tHave to get these wet things off.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou're not going to slow us down!\n\t\t\tKeep moving!\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n117  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tInside of three hours you'd be\n\t\t\tdragging my dead carcass.\n\nFuming, Eric helps Corbett up.\n\n118  EXT.  ENDICOTT FOOTHILLS - EVENING\n\nThe sun sinks below the horizon, creating across the\nmountains a spectacular show of color and shadows.  The wind\nHOWLS.\n\n119  INT.  NYLON SHELTER\n\nEric stokes a fire at the mouth of the shelter.  Corbett's\npants and boots hang to dry from branches next to it.  He\nhuddles under the tarp, covered by his coat, drowsy and\nlistless.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tStay awake!  You want to go\n\t\t\thypothermic?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tIf that means freeze my balls\n\t\t\toff, no thanks.\n\t\t\t(yawns)\n\t\t\tI'll be okay.\n\nEric examines him.  Corbett's skin is white and rigid, his\nlips are pale blue.  He scowls at Eric.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tTold you I'm fine!\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(holds up three fingers)\n\t\t\tHow many do you see?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(irritable)\n\t\t\tWhat?!  Fuck off.  Save yourself.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou don't feel cold?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tIt's a spring day...\n\nHe starts to doze off.  The shivering he's been repressing\nnow racks his body.  Eric sits him up, closer to the fire,\nand puts his own parka over Corbett's shoulders.  With his\nfoot, Eric rolls some hot rocks bordering the fire closer to\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n119  CONTINUED:\n\nCorbett's legs.  Eric rubs his arms and hands, but it isn't\nenough.  Eric loathes the specter of death, even Corbett's.\nHe shakes him, trying to keep him awake.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWake up, goddammit!  You've got\n\t\t\tclassic hypothermia --\n\t\t\tcrankiness, fatigue, can't feel\n\t\t\tyour coldness.  Worst thing you\n\t\t\tcan do is fade out.\n\nCorbett is headed someplace far away.  Sighing, Eric turns\nhim so his back faces the fire.  He unbuttons Corbett's\nshirt, then unbuttons his own shirt and lies across Corbett.\nEric gasps -- Corbett feels like a slab of ice.  Corbett's\nteeth chatter.  He's completely unconscious.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tOne more thing -- this doesn't\n\t\t\tmean we're going steady.\n\nDISSOLVE TO:\n\nLater, Corbett rests fitfully.  It could go either way.\nEric chews on some roots and pokes at the fire to keep it\nlively.\n\nDISSOLVE TO:\n\nIt's night.  Some color has returned to Corbett's skin.\nEric turns as Corbett mumbles and clutches at the front of\nhis shirt.  His eyes open.  He tries to sit up, but he's too\nweak.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tStay still.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWhere's my ELT?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tEmergency transmitter?  All your\n\t\t\tgear is back at Wilder's.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou got one?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIt was blown up with the plane.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tToo bad.  We'd be out of here in\n\t\t\ta few hours.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n119  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHow?  Nobody this far north\n\t\t\tmonitors that frequency until\n\t\t\tavalanche season.\n\t\t\t(beat)\n\t\t\tBesides, I'm surprised a tough\n\t\t\tguy like you uses fancy\n\t\t\telectronics.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI'm surprised a flat-ender like\n\t\t\tyou knows cold-weather remedies.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\n\t\t\tRead a lot of adventure stories\n\t\t\twhen I was a kid...\n\nCorbett smiles.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI'm hungry.  Go kill me some\n\t\t\tdinner.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tAn appetite.  Maybe you won't die\n\t\t\tafter all.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHate to disappoint you.\n\n120  EXT.  HAUL ROAD - THE TURTLE - NIGHT\n\nThe AURORA makes a dazzling display in the cold clear sky.\nBelow, the only light on the endless expanse of dark earth\ncomes from the Turtle.\n\nCLOSER\n\nFlashlight in hand, wearing one of Eric's coats, Anne Marie\nrefuels the generator.  Something catches her eye --\n\nANNE MARIE'S POV\n\nIn the distance, headlight beams jostle along the Haul Road.\n\nBACK TO SCENE\n\nAnne Marie caps the diesel fuel can and stows it away.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(grinning)\n\t\t\tIt's about time...\n\nShe hurries back into the Turtle.\n\n\n\n121  INT.  THE TURTLE\n\nAnne Marie brushes her hair and makes herself presentable.\n\n122  EXT.  THE TURTLE\n\nThe vehicle gets closer.  It's the trappers' jeep.  It slows\nand parks on the Haul Road next to the Turtle.\n\n123  INT.  THE TURTLE\n\nAnne Marie peers out the window.  She gasps as she\nrecognizes the jeep.  Ducking from sight below the window,\nshe grabs Eric's coat and hurries into the rear module.\n\n124  EXT.  THE TURTLE\n\nMitchell stays in the jeep.  Viking Bob and LeMalle get out\nand walk cautiously toward the Turtle.\n\nLeMalle stands midway between the jeep and the Turtle,\ncradling his carbine.  Viking Bob goes up the steps.\n\n125  INT.  THE TURTLE - REAR MODULE\n\nAnne Marie remembers something she should've taken with her:\nthe rifle.  Too late.  She hears Viking Bob's FOOTSTEPS (OS)\ncome up the wooden stairs outside.\n\n126  EXT.  THE TURTLE\n\nViking Bob knocks on the front door.  He peers through the\nsheer curtain on the window, into the front module.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tHullo?\n\nHe shrugs to the others, then tries the door.  It's\nunlocked.\n\nMitchell gets out of the jeep, spits and follows the others\nin, his hand close to the Colt Peacemaker strapped to his\nleg.\n\n127  INT.  THE TURTLE\n\nAnne Marie climbs out a window in the back.  She closes it\nbehind her just as Viking Bob pokes his head in the rear\nmodule.\n\nThe trappers snoop around, noticing that the coffee pot is\nstill warm, etc.  The emptiness is ominous.  LeMalle picks\nup the big Remington bear rifle.  He opens the breech to\ndetermine if it's loaded, and sniffs the barrel to see if\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n127  CONTINUED:\n\nit's recently been fired.  Viking Bob notices the damaged\nradio.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tSomebody left in a big hurry.\n\t\t\t(to LeMalle)\n\t\t\tCheck outside.\n\n128  EXT.  THE TURTLE\n\nLeMalle goes outside and shines his flashlight around.\n\nNEW ANGLE\n\nIn the back, Anne Marie drags an evergreen tree branch\nbehind her to cover her tracks in the snow, then climbs into\nthe utility compartment where Wilder's body was stored.\n\nA moment later, LeMalle comes around the corner.  He notices\nbear tracks and scat from the prior night's visit.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(calls out to others)\n\t\t\tGrizzly sign.  Looks fresh.\n\nViking Bob and Mitchell converge with LeMalle.  They point\ntheir flashlights around, spotting footprints and marks\ngoing off into the woods.\n\n129  EXT.  WOODS NEAR THE TURTLE\n\nTense and silent, the trappers follow the marks.  A breeze\nRUSTLES the needles of the evergreens around them.  They\nstop at the point the footprints end.  A rhythmic CREAKING\nabove them makes LeMalle shine his light upward.\n\nNEW ANGLE\n\nThe light REVEALS Wilder's feet swinging back and forth\nabove their heads.  His body is suspended in the manner of a\ntrail cache.  Viking Bob lets out a startled grunt.  He and\nMitchell shine their lights on Wilder's face.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tIt's Sam Wilder!\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tMusta wanted to keep him from the\n\t\t\tbears.  If Ben killed him, he\n\t\t\tsure as hell wouldn't hang him up\n\t\t\tlike this.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tWhere's the kid?\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n129  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tWho gives a husky fuck?  Where's\n\t\t\tBen?\n\nThe trappers look glumly at one another.\n\n130  INT.  UTILITY COMPARTMENT - THE TURTLE\n\nAnne Marie jams herself behind a pile of her photo\nequipment.  She stops as she hears the trappers' boots (OS)\nCRUNCH in the snow past her and go inside the Turtle.\n\n131  INT.  THE TURTLE\n\nThe trappers peel off their overcoats.  They look around at\nthe comfortable surroundings.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tI should get me a job with an oil\n\t\t\tcompany.\n\nHe sits on the couch and lays his scrimshaw and engraving\ntools out on the coffee table.  LeMalle helps himself in the\nwell-stocked larder.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tI say we eat, torch this fuckin'\n\t\t\tthing, and move on.\n\nLeMalle digs through the cupboards and comes up with a fresh\nbottle of Scotch.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tGo easy.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tCool out.  I ain't about to get\n\t\t\tblasted.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n132  EXT.  THE TURTLE - LATER THAT NIGHT\n\nFlashlight in hand, gloriously drunk, LeMalle stumbles\noutside.  He crosses to the jeep to grab a box of Twinkies\nand, as long as he's at it, take a leak in a snowbank.\nBleary-eyed, he notices the damage to the utility\ncompartment inflicted by the bear.\n\nHe walks to it, stepping over the bear scat.  He marvels at\nthe size and depth of the clawmarks.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n132  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tBig mother musta wanted something\n\t\t\treal bad in here...\n\nLeMalle tries the door, but it's jammed shut.  He tucks his\nflashlight under his arm and gives another tug.  This time\nthe door cracks open.\n\nCLOSER - HIS POV\n\nHe peers through the opening and shines his flashlight in.\nA pair of eyes stare back at him.\n\nWIDER\n\nLeMalle jumps back, startled, and pulls out his knife.   He\ntries the door again.  It WRENCHES open...\n\n...He's looking at his own face in one of Anne Marie's\nmirrored photo reflector boards.\n\nLetting his breath out, LeMalle pokes around the equipment\nin the compartment.  Ever larcenous, he pulls a few items\nout, examines them, and, disinterested, leaves them in the\nsnow.  Doing so, he comes close to uncovering Anne Marie,\nwho sits motionless and terrified in the back of the\ncompartment.\n\nNothing in the compartment catches LeMalle's fancy.  Leaving\nthe door hanging open, he wanders away.\n\n133  INT.  UTILITY COMPARTMENT - THE TURTLE\n\nAfter he's gone, Anne Marie reaches over and closes the\ndoor.  She can hear the trappers' (OS) CONVERSATION inside:\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB (OS)\n\t\t\tI know in my gut he was here.\n\t\t\tFirst light, we try to get scent\n\t\t\tof his trail.\n\nSighing, Anne Marie stuffs her hands inside her parka and\ntries to get comfortable.  It's going to be a long night.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tFADE TO:\n\n134  EXT.  ENDICOTT FOOTHILLS - DAWN\n\nEric and Corbett wearily trudge through the woods.  Corbett\nhas the tarp wrapped around him for extra warmth.  As he\nwalks, he sniffs at one of Eric's Eskimo potato roots and\ntakes a tentative nibble.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n134  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tUsed to see the natives eating\n\t\t\troots when I was a kid in Nome.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tNome?  I figure you'd be a\n\t\t\twhaler, coming from there.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tTold that's what our old man was.\n\t\t\tPlanned on going to sea, me and\n\t\t\tBob, 'til I read Jack London.\n\t\t\tStarted trapping when I was ten.\n\t\t\tMailed the furs to Sears.  Eight\n\t\t\tbucks for a skunk, three for a\n\t\t\tmuskrat.\n\t\t\t(off Eric's look)\n\t\t\tThat was fine money.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tKilling wildlife not good enough\n\t\t\tanymore, so you go on to bigger\n\t\t\tand better things.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou got a knack for seeing things\n\t\t\tthe way you want to see them.\n\nThey walk in silence.  Corbett tightens the tarp against the\ncold air and looks at Eric.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tDon't judge me.  You're a joke,\n\t\t\tcoming here from a fucked-up\n\t\t\tculture, telling us what to do!\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYeah, it is fucked up -- but it's\n\t\t\tnot too late to keep that from\n\t\t\thappening here.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(temper flaring)\n\t\t\tAll you do is keep folks from\n\t\t\tworking the land, living like\n\t\t\tthey're meant to.  You don't\n\t\t\tunderstand shit!  Trappers,\n\t\t\thunters -- we're part of the\n\t\t\tenvironment.  Who's protecting\n\t\t\tus?\n\t\t\t(sourly)\n\t\t\tI've seen plenty like you.  So\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n134  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (Cont'd)\n\t\t\tfull of yourselves there's no\n\t\t\troom for other people's way of\n\t\t\tlife.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhat do you know about people?\n\t\t\tYou live like an animal!  A\n\t\t\tsavage goddamn throwback like you\n\t\t\tbelongs out here, as far away\n\t\t\tfrom the rest of us as possible.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tI'm real sad you don't approve of\n\t\t\tme.\n\nHe shoves Eric with his handcuffed hands.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tTell me what I should do,\n\t\t\tProfessor.  You got all the\n\t\t\tanswers.  I shouldn't hunt?\n\t\t\tFine, I'll just phone up and have\n\t\t\ta salad delivered.\n\nLivid, Eric backs away and knocks Corbett's hands away from\nhim.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tDon't push me..!\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tCowardly bastard.  I'm in\n\t\t\thandcuffs and I still scare the\n\t\t\tpiss out of you.\n\nEric smashes his fist into Corbett's face.  Corbett reels\nback, more surprised than hurt.  Eric moves in, furiously\nthrowing punches.  Corbett plows his clenched fists into\nEric's midsection, doubling him over.  Gasping, Eric rams\nhis head into Corbett and they fall into the snow.\n\nDespite the handcuffs, Corbett gets a few blows in.  They\nwrestle fiercely, and Eric ends up on top of Corbett.  He's\nabout to throw another punch when Corbett looks up at him.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tFirst you save my ass, now you\n\t\t\twant to kill me.  Make up your\n\t\t\tgoddamn mind.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n134  CONTINUED:  (3)\n\nEric lowers his fist and climbs off of Corbett.  Corbett\ngets up and they continue on their way in sullen silence.\n\n135  EXT.  DEVIL'S CAULDRON - DAY\n\nSunday morning.  Chimney smoke rises straight up in the\nstill morning air and mingles with the wisps of fog hanging\nabove the Devil's Cauldron valley.\n\nA scratchy RECORDING of a HYMN (\"We Will Gather at the\nRiver\") plays through a PA system, ECHOING forlornly off the\nhills.  The PEOPLE of Devil's Cauldron walk through the new\nsnow to the center of the settlement.  Some, older Women\nmostly, head for the dance hall, where the HYMN originates.\n\n136  INT.  DANCE HALL\n\nThe Women SING along with the HYMN.  They face a shelf\nholding the PA, a rusty TV and record player.  And, in front\nof the shelf, an unmanned pulpit.\n\n137  EXT.  DEVIL'S CAULDRON\n\nThe Men, including Neff, split off from their mates and go\ninto the Maqi.\n\n138  INT.  MAQI\n\nNeff joins some other Men sweating on benches in the\nprimitive steam bath.   Kenai sits closest to the fire.  His\nthick glasses are steamed up, but he finally looks warm.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tWilder's missing church services;\n\t\t\tyou believe it?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tI just as soon he stay gone.\n\t\t\tFool could've got us all killed,\n\t\t\tarresting Ben Corbett here in\n\t\t\ttown.\n\n139  EXT.  FOOTHILLS ABOVE DEVIL'S CAULDRON - DAY\n\nExhausted, Corbett and Eric climb across the last set of\nfoothills before the Devil's Cauldron valley.  The town\ncomes into view below them; faintly the MUSIC carries from\nbelow.  Corbett looks at Eric and breaks the silence:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWhat makes you so sure my boys\n\t\t\twon't be waiting for us?\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n139  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThey think you're in Fairbanks.\n\t\t\tIf not, they still won't find you\n\t\t\tbefore the plane comes tomorrow.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tDon't bet on it.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI already have.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou don't know how true that is.\n\nEric sweeps the snow from between two rocks and sits down.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe'll wait here until nightfall.\n\t\t\tNo fire, no tarp.\n\nCorbett sits next to him.  After a long moment:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tDidn't mean it, you being a\n\t\t\tcoward.  You're a lot of things,\n\n\t\t\tbut chickenshit isn't one of\n\t\t\tthem.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tMaybe...maybe not.  I'll tell you\n\t\t\twhat scares me -- stumbling\n\t\t\tthrough life, like an ordinary\n\t\t\tjerk.  That's why I want to work\n\t\t\ton the front lines, where what I\n\t\t\tdo means something.\n\t\t\t(beat)\n\t\t\tSoon as I got here, I realized my\n\t\t\tjob was bullshit.  Oil company\n\t\t\tpropaganda.  I was ready to\n\t\t\tleave, then I thought screw it,\n\t\t\tI'll outsmart them, do the work\n\t\t\tanyway.\n\t\t\t(beat)\n\t\t\tI don't know anymore.  Maybe I am\n\t\t\tfooling myself.  That's what I'm\n\t\t\tafraid of most of all.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tHell, I still get a knot in my\n\t\t\tgut every season, wondering how\n\t\t\tmuch longer I can go on.  No\n\t\t\t'Home for Retired Trappers' that\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n139  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (Cont'd)\n\t\t\tI ever saw.  We're like Eskimos\n\t\t\t-- get too old to be useful,\n\t\t\twe're left on the ice to die.\n\nThe men listen to the faint MUSIC echoing through the silent\nfoothills.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; softly)\n\t\t\tMy wife used to go to chapel on\n\t\t\tSundays.  See her friends, 'cause\n\t\t\tI was away so much.\n\t\t\t(beat)\n\t\t\tShould've been home that day.\n\t\t\tShe'd be getting dressed right\n\t\t\tabout now...\n\nEric glances over as a look of utter desolation crosses\nCorbett's face.\n\n140  EXT.  HAUL ROAD - THE TURTLE - DAY\n\nThe trappers file out the front door.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tMy guess is he's loose and\n\t\t\theading for Chukfoktulik.  He'll\n\t\t\tneed supplies; that's the closest\n\t\t\tsettlement without a lawman.\n\nLeMalle carries his booty with him.  Viking Bob looks at him\ndisapprovingly as he puts the big Remington rifle in the\njeep.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tI ain't gonna leave a seven-\n\t\t\thundred-dollar Remington behind.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t(exasperated)\n\t\t\tWhat you gonna do with it?  Large\n\t\t\tbore's for shit on small game.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tNot in the right hands it ain't.\n\nTo demonstrate, he rapid-fires several SHOTS from the hip,\ntaking the radio antenna off the roof of the Turtle,\nshattering panes of glass in an accurate succession, and\nblasting the door latch off the utility compartment.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n140  CONTINUED:\n\nPleased, LeMalle slams back the bolt, ejecting a spent\nshell.  He glances curiously at the door of the utility\ncompartment and starts toward it.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(continuing)\n\t\t\tThought that door was open last\n\t\t\tnight...\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tQuit fucking around.  Get in.\n\nLeMalle climbs into the back of the jeep.  With Viking Bob\ndriving, they pull away.\n\n141  EXT.  TRAPPERS' JEEP - (MOVING SHOT)\n\nGrinning maliciously, LeMalle hangs the Remington out the\nwindow as they retreat.  Taking careful aim, he SHOOTS.\n\n142  EXT.  THE TURTLE\n\nLeMalle's bullet hits the metal fuel tank of the generator.\nThe kerosene fumes EXPLODE, splattering BURNING KEROSENE on\nthe rear module of the Turtle.\n\nThe trappers don't slow down to enjoy the show.  Viking Bob\nhurries on to more important business.\n\n143  INT.  UTILITY COMPARTMENT - THE TURTLE\n\nAs soon as the SOUND of the jeep fades away, Anne Marie\nclambers out of the utility compartment.  Haggard and numb\nwith cold, she helplessly watches as the fire ravenously\ndevours the rear module.  Shielding her face from the\nflames, Anne Marie reaches under the accordion cover between\nthe modules.  With great effort, she unbolts the coupling\nbracket.\n\n144  INT.  DIESEL RIG - THE TURTLE\n\nAnne Marie STARTS the engine, SLAMS it into gear, and\nlurches the front module away from the burning rear module.\nShe shuts the motor off and, trying to hold back the tears,\nwatches the rear module BURNING.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tDISSOLVE TO:\n\n145  EXT.  DEVIL'S CAULDRON - NIGHT\n\nBone weary, Eric and Corbett walk toward town, staying on\nthe outskirts to avoid being seen.  They look at one another\n-- this moment seemed impossible not very long ago.  No one\nseems to notice as they limp into Wilder's cabin.\n\n\n\n146  INT.  WILDER'S CABIN\n\nIt's dark.  Eric locks Corbett up in the holding cell, not\nnoticing that Corbett seems almost pleased to be there.  He\nblocks the windows, pumps up the pressure on the white gas\nlantern and heads back outside again.\n\n147  INT.  NEFF'S HOUSE\n\nNeff pries himself from his MTV to answer a KNOCK at the\ndoor.  Eric hobbles in.  Neff notes Eric's weatherbeaten\ncondition.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tYou don't mind me saying, Mr.\n\t\t\tDesmond, you look like hell.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHave you heard anything from the\n\t\t\tgirl staying with me, Anne Marie?\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tNot a damn thing.  What's going\n\t\t\ton?  Mr. Meyerling was here, all\n\t\t\tsteamed up, looking for you.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tLook, Neff, I've got Ben Corbett\n\t\t\twith me --\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t-- Here?!  Where's Wilder?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tBack at my place... he, uh, broke\n\t\t\this leg.\n\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tIf Corbett's men find out --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t-- I'm putting him on the plane\n\t\t\tto Fairbanks, eleven tomorrow.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tJiminy Christmas.\n\t\t\t(beat)\n\t\t\tWhat do you want from me?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tCorbett ruined my two-way.  Go to\n\t\t\tmy place on the Haul Road, tell\n\t\t\tAnne Marie I'm okay and to sit\n\t\t\ttight.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n147  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tI'll go at dawn.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThanks.  Don't tell anyone you\n\t\t\tsaw me.\n\nAfter Eric goes, Neff closes his door and bolts it.\n\n148  EXT.  DEVIL'S CAULDRON - VARIOUS ANGLES - NIGHT\n\nThe temperature dips as the winds shifts and blows down from\nthe north.  Another storm approaches.  The temperate days of\nlast week seem ages ago.\n\nKenai, Neff, and other TOWNSMEN batten Devil's Cauldron down\nfor the STORM.  Kenai is bundled up in the cold.  The men\ntighten guy wires on the radio tower, windmills and caches;\nbring firewood indoors; close off unused rooms in the\ngeneral store and spa.  Then Neff and Kenai split off from\nthe others.\n\n149  INT.  HOT SPRINGS SPA\n\nVia a catwalk, Neff and Kenai climb up into the ceiling\nstruts above the partitioned cubicles in the spa to caulk a\nroof leak with pitch.  Neff is sullen from his conversation\nwith Eric. Kenai, however, is smiling at Neff.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tWhy the smirk?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tBet I could make some money\n\t\t\tturning Ben Corbett in.  Maybe\n\t\t\tmore for lettin' him loose.\n\t\t\t(off Neff's flustered look)\n\t\t\tI was up in my cache.  Saw the\n\t\t\tNorthland man come talk to you.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tYou're out of your greedy goddamn\n\t\t\tmind.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tCorbett coming here stinks of\n\t\t\ttrouble.  We should make the best\n\t\t\tof it before it turns around and\n\t\t\tbites us in the ass.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tStay out of it.\n\n\n\n150  INT.  WILDER'S CABIN - NIGHT\n\nEric stirs a pot of beans on the cookstove.  Corbett watches\nfrom the cot in the cell.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tTalk to that good-looking girl of\n\t\t\tyours?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou broke the radio, remember?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(smiles)\n\t\t\tI'm sure she's fine.  Seemed like\n\t\t\ta clever kid.\n\nCorbett sits up as Eric hands him a plate of beans.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tYou were real resourceful out\n\t\t\tthere.  Got me thinking of this\n\t\t\tperimeter man, froze all his\n\t\t\tfingers one winter.  So he hacked\n\t\t\tthe tips off and sharpened the\n\t\t\texposed bones.  Gets along better\n\t\t\tthan ever.  Yeah, maybe I\n\t\t\tunderestimated you.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI liked you better frozen.  You\n\t\t\tdidn't talk so much.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou're damn lucky, glimpsing this\n\t\t\tcountry before it's ruined, gone\n\t\t\tfor good.  You saw wonders you'd\n\t\t\tonly dreamed of.  That alone\n\t\t\tmakes you different than the\n\t\t\tsorry bastards back where you\n\t\t\tcame from, because you have\n\t\t\tdreamt them.\n\nCorbett sees he's hit a nerve with Eric.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing)\n\t\t\tRemember that demon in the gut?\n\t\t\tSometimes it's nothing more than\n\t\t\twondering if the so-called\n\t\t\tcivilized life has bred the balls\n\t\t\tand brains out of you.  That's\n\t\t\twhat you want out of this, isn't\n\t\t\tit?\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n150  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tAll I want want is you in jail --\n\nA KNOCK at the door interrupts.  Eric lowers the flame on\nthe gas lantern and peers out through a corner of the\ncardboard in the front window.  Frowning, he cracks the door\nopen and slips outside.\n\n151  EXT.  WILDER'S CABIN\n\nIt's Neff and Kenai.  Neff looks guiltily at Eric.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t(explaining)\n\t\t\tHe saw you and Corbett come in...\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tDixie's waiting at the infirmary.\n\t\t\tShe'll put a splint on that\n\t\t\tinjured leg.\n\nEric is skeptical of Kenai's concern.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tDon't let him fool you.  Real\n\t\t\treason he's here is to buy\n\t\t\tCorbett's traps.\n\nEric looks at Kenai, then at Neff.  Neff nods that it's\nokay.  As extra precaution, Eric handcuffs Corbett's right\nwrist to the frame of the cot inside the cell.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(to Kenai)\n\t\t\tOkay.  You can talk to him.  But\n\t\t\tI'll keep the keys with me.\n\n152  INT.  HOT SPRINGS SPA - NIGHT\n\nOutside the wind HOWLS.  Eric enters and walks into the\nhallway connecting the bath partitions.  A hand grabs his\narm.  Startled, he turns around.\n\nIt's Dixie, wearing a threadbare flannel robe.\n\t\t\t\t\t\n\t\t\t\t\tDIXIE\n\t\t\tEarl says you get discount.\n\t\t\tTwenty-five dollar.\n\nEric shakes his head -- typical Kenai.  He gives her three\ntens.  She smiles and leads Eric toward the \"infirmary.\"\nIt's actually a bath partition outfitted with an examining\ntable and a first-aid kit.\n\n\n\n153  INT.  WILDER'S CABIN - NIGHT\n\n\nNeff paces nervously.  Corbett smiles at him and Kenai.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t(apologetically)\n\t\t\tLook, Ben, we don't want any\n\t\t\ttrouble.  The kid's got the key,\n\t\t\tand besides, he looks edgy enough\n\t\t\tto use that magnum he's carrying.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tRelax.  I'll get loose in time.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tAny traps you don't want, I'll\n\t\t\tpay cash money.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tGuess someone should use them.\n\t\t\tOpen the bottom drawer in\n\t\t\tWilder's desk.  My kit's in\n\t\t\tthere.  Might as well unload\n\t\t\teverything.\n\nKenai tugs on the drawer.  It's locked.  Undaunted, he\njimmies it open with a knife.  Neff groans.  Kenai goes to\nthrow Corbett the duffel bag, but Neff grabs it.  He checks\nfor weapons, pulling out a hunting knife.  Satisfied, he\nhands Corbett the bag through the bars.\n\nWith his free hand, Corbett digs through his belongings:\nclothing, freeze-dried provisions, jerky, paperback books.\nHe looks up and shrugs.\n\n154  INT.  HOT SPRINGS SPA - NIGHT\n\nEric's ankle is in a resin cast.  His foot rests on a stool.\nWhile waiting for the cast to set he soaks in the bathtub, a\nhot towel draped over his face.  Above him, on a wall\nbracket, a closed circuit TV plays a war-surplus PORNO FILM.\n\nThe door CREAKS open and Dixie comes in.  She impassively\nchecks his cast -- which is interesting, as she's now\nwearing panties, clog shoes and nothing else.  Eric takes\nthe towel off his face and sits up, astonished.\n\t\t\t\t\t\n\t\t\t\t\tDIXIE\n\t\t\tI wash your back for you.  You\n\t\t\twill like it.\n\nBefore Eric can protest, the door OPENS again.  It's\nMeyerling.  He snaps his fingers at Dixie to shoo her and\nshe scurries away.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n154  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI hate to interrupt playtime, but\n\t\t\twhy the hell are you caught up in\n\t\t\ta local matter when I gave you\n\t\t\texpress instructions to the\n\t\t\tcontrary?!\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tCut the shit, Leo.  I might need\n\t\t\tyour help...\n\n155  EXT.  CHUKFOKTULIK, ALASKA - NIGHT\n\nConsisting of a handful of sod-roof cabins, mostly bars,\nChukfoktulik is a way station in the coniferous forest,\nsixty miles southeast of Devil's Cauldron.\n\n156  INT.  TRAPPERS' JEEP\n\nWith the seats pushed back, LeMalle peels the town's lone\nWHORE out of her parka.  He's got the motor running for\nwarmth.  Her gold tooth glints in the light from the\nbuilding next to them.  The locating screen on the beat-up\nradio beacon receiver bolted to the dash GLOWS\nphosphorescent green.\n\t\t\t\t\t\n\t\t\t\t\tWHORE\n\t\t\tThey got nice beds upstairs,\n\t\t\thoney.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tI'm standin' guard duty.\n\t\t\tBesides, rather spend the room\n\t\t\tmoney on sloppy seconds.\n\nOver the sound of LeMalle's exertions there begins an\ninsistent succession of BEEPS.  The Whore looks over\nLeMalle's shoulder at the locating device.\n\t\t\t\t\t\n\t\t\t\t\tWHORE\n\t\t\tHey, Tiger --\n\nLeMalle turns and immediately loses interest in the Whore.\nPushing her off of him, he blows the jeep's HORN three\ntimes.\n\n157  INT.  HOT SPRINGS SPA - NIGHT\n\nEric and Meyerling are in the middle of an argument.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t...I won't let a killer walk!\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n157  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tAlleged killer.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhat does this matter to you?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(sneering)\n\t\t\tYou can't see past your lousy\n\t\t\tlittle assignment, sniffing\n\t\t\taround the pipeline.  The few\n\t\t\tvoters there are in this district\n\t\t\tlook up to Corbett, and I'm not\n\t\t\tabout to alienate them.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI should release Corbett because\n\t\t\tyou want some votes?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tThis miserable wilderness is a\n\t\t\tstate of the union.  Policy's\n\t\t\tmade here the same way as in the\n\t\t\tcivilized world: at the ballot\n\t\t\tbox.  That's the beauty of it --\n\t\t\tthese icebox cowboys are living a\n\t\t\tcentury too late.  Get them on\n\t\t\tyour side, it's like buying\n\t\t\tManhattan for beads.  With a\n\t\t\thandful of votes you control the\n\t\t\tgreatest frontier since white men\n\t\t\tstumbled onto the New World.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSome day these people'll wake up,\n\t\t\tand you'll be the first one\n\t\t\tthey'll run out of here.\n\nEric's attention turns to a rhythmic INTERFERENCE on the TV\nscreen.  There are three short bursts, followed by three\nlong bursts.  Something about it is very familiar.\nScowling, he sits up.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tShit...\n\t\t\t(to Meyerling; distracted)\n\t\t\tDo what you have to.  So will I.\n\nEric climbs out of the water and pulls his pants on.\n\n\n\n158  INT.  WILDER'S CABIN - NIGHT\n\nKenai sorts through the tangle of Corbett's traps.   The\ndoor bursts open and Eric hobbles in.  Gun drawn, Eric\nunlocks the cell door.  He rips Corbett's shirt open.\nLooking around, he sees Corbett's duffel bag sitting by the\ncot.  Digging through it, he finds at the bottom of the bag\nan ELT with a small red LED flashing on it.\n\nFurious, he flings it against the wall, smashing it.\n\n\n159  INT.  TRAPPERS' JEEP - CHUKFOKTULIK - NIGHT\n\nThe green dot on the screen and rhythmic BLEEP go suddenly\ndead, just as Viking Bob and Mitchell run up to the jeep.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tNorthwest.  Devil's Cauldron.\n\nLeMalle dumps the half-naked Whore out onto the snow.\nViking Bob starts the jeep and they roar off.\n\n160  INT.  WILDER'S CABIN - NIGHT\n\nEric shoves Kenai and Neff out the door.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tWhat's wrong?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tJust stay out of my face until\n\t\t\tI'm gone!\n\nHe slams the door.  Corbett smiles his Cheshire smile.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing; picks up ELT)\n\t\t\tEmergency transmitter?  What\n\t\t\thappened to signal mirrors or\n\t\t\ttwo-tone smoke fires?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tLets us watch each other's backs\n\t\t\tover a wide area.  Only thing\n\t\t\tmessed me up this time was\n\t\t\tgetting arrested in the baths.\n\t\t\tELT was in my duffel bag, not\n\t\t\taround my neck where it should've\n\t\t\tbeen.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tNo way they'll find you on a\n\t\t\tfive-minute signal.  And no way\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n160  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC (Cont'd)\n\t\t\tthey'll get here in eight hours\n\t\t\tin this weather, unless they're\n\t\t\tright around the corner.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThey haven't disappointed me yet.\n\n161  EXT.  DEVIL'S CAULDRON - DAWN\n\nFat, dry snowflakes pour through the still air.  Gloomy\nclouds hang immediately overhead.  Visibility is ten feet;\nthe temperature is below zero.\n\n162  INT.  WILDER'S CABIN\n\nIt's 5:30 AM.  Sitting at Wilder's desk, Eric pries the tops\nfrom some bullets and dumps the gunpowder into a styrofoam\ncup. He rings the top of the cup with bluetip matches, then\nseals it with masking tape.  Watching him from the cell,\nCorbett smiles.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tFlashbomb, eh?\n\nEric doesn't answer.  He pulls on a heavy overcoat of\nWilder's.  Putting the unused bullets back in Wilder's desk,\nEric finds Corbett's .44 magnum.  He puts it and some\nspeedloaders full of .357 hollowpoints in his pockets.\n\n163  EXT. / INT.  DEVIL'S CAULDRON - MONTAGE\n\nEric hobbles across town to the hot springs under cover of\nthe early hour and heavy snowfall.  He paces out several\ncircuitous routes from the rental cabins to the airstrip at\nthe edge of town, pausing now and again along the way.\n\nHe hears a door SQUEAK open and someone COUGH nearby, so he\nstands motionless in the snow.\n\nBundled in wool blankets, Kenai trundles down to his\nouthouse.\n\nAfter Kenai passes by, Eric sneaks inside the spa.  He\nclimbs up into the catwalk.\n\nAs Kenai goes back to his cabin, he notices that the antique\nbear traps on display in front of the general store are\nmissing.  Suddenly, Eric grabs him and pulls him into the\nspa doorway.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tEND MONTAGE\n\n\n\n164  INT.  HOT SPRINGS SPA\n\nEric's unexpected appearance startles Kenai.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI need to rent a cabin.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tWhat's the problem with Sam\n\t\t\tWilder's place?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWill you rent me a cabin, or not?\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tPretty clever:  If the trappers\n\t\t\tgot that signal beacon and get\n\t\t\there in time, Sam's is the first\n\t\t\tplace they'll look.  They may\n\t\t\tfigure you're waiting for an\n\t\t\tairplane, so you can't stay in\n\t\t\tthe shack by the airstrip.  Last\n\t\t\tplace they'd expect you is on the\n\t\t\tfar side of town.\n\t\t\t(shakes his head)\n\t\t\tI can't afford any trouble --\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(takes out all his cash)\n\t\t\t-- Here's a hundred dollars.  And\n\t\t\tif you or anyone else will back\n\t\t\tme up on this --\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\t(grabs money)\n\t\t\t-- Forget it.  And try not to\n\t\t\tbleed on my throw rugs.\n\t\t\t(walks away, then turns\n\t\t\t\tback)\n\t\t\tWhy do this?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tIf you have to ask, you wouldn't\n\t\t\tunderstand.\n\nNEW ANGLE\n\nOutside, there is the high-pitched WHINE of a snowmobile\n(OS) driving into town.  Eric cautiously follows the SOUND.\n\n165  EXT.  DEVIL'S CAULDRON - CLOSE ON ERIC\n\nHe listens as the vehicle cuts across town toward Neff's\nhouse.  The snowfall is too thick to see who it is.  Eric\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n165  CONTINUED:\n\nmoves in as close as he dares.  The ENGINE stops (OS) and\nFOOTSTEPS crunch up Neff's driveway.\n\nWIDER ANGLE - NEFF'S HOUSE\n\nA person in a hooded parka stands on Neff's stoop, about to\nknock.  Magnum drawn, Eric suddenly appears from the curtain\nof falling snow.  He shoves the person against the side of\nthe house.\n\nNEW ANGLE\n\nIt's Anne Marie.  She gasps.  Seeing Eric, she's more angry\nthan relieved.  Eric puts the gun back in his waistband.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tEric!  Why aren't you in\n\t\t\tFairbanks?\n\nHe pulls her away from Neff's doorstep.  Her anger\ndissolving, she wraps her arms around him.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(continuing)\n\t\t\tOh, Christ, sweetheart.  Four\n\t\t\tdays!  I thought you were dead,\n\t\t\tor worse.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou can't stay here.  Go back to\n\t\t\tthe Turtle.  I'll meet you back\n\t\t\tthere in a few hours.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(stung by his coolness)\n\t\t\tWhat's going on?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI'll tell you everything later.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tWhere's Corbett?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHere.  A transport plane is due\n\t\t\tat eleven.  Once I put him on it,\n\t\t\tit's all over.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tSo what's the problem?\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n165  CONTINUED:  (2)\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThere isn't one, unless Corbett's\n\t\t\tmen get here before the plane\n\t\t\tdoes.\n\nAnne Marie grasps the situation with a sickening clarity.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tLet the people here handle it.\n\t\t\tIt's their marshal Corbett\n\t\t\tkilled!\n\nCUTAWAY - NEFF\n\nhas been eavesdropping on the conversation through his\nwindow.  The news about Wilder stuns him.\n\nBACK TO SCENE\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tPlease, Anne Marie, you being\n\t\t\there only complicates things.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tI'm staying.\n\nEric knows she won't relent.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tTake the snowmobile, park it\n\t\t\tbehind Wilder's cabin.\n\nSighing, she STARTS the snow machine.  Most of her photo\ngear is lashed to the saddlebags.  As she pulls away, Eric\nlimps back to Neff's house and knocks on the door.\n\t\t\tINT.  NEFF'S HOUSE\n\nShaken, Neff opens the door and lets Eric in.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tI was just on my way to your\n\t\t\tladyfriend's, but I guess she\n\t\t\tfound you.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYeah.  Sorry I barked at you last\n\t\t\tnight.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tI'm the one should be sorry...\n\t\t\tGoddamn Kenai, always out for a\n\t\t\tscore.  I never should've let him\n\t\t\tgo over there.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n165  CONTINUED:  (3)\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI'd sure like that favor you\n\t\t\toffered a while back.\n\nNeff gets a seasick look on his face.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tLook, Mr. Desmond, I didn't count\n\t\t\ton it turning this ugly.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhat are you talking about?\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tBastards killed Sam, you think\n\t\t\tthey won't kill the rest of us?\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tThere'll be three, four men at\n\t\t\tthe most.  I have some backup,\n\t\t\tnothing will happen.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tI'm real sorry.  In a while,\n\t\t\tyou're gone from this country.\n\t\t\tBut we live here.  No one wants\n\t\t\tto mix it up with those hombres.\n\nNeff opens the door for Eric.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(angry)\n\t\t\tYou don't care enough about Sam\n\t\t\tto --\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t-- Sam Wilder was my cousin.\n\t\t\tHe's why I came to Alaska.  All\n\t\t\this letters, saying what a\n\t\t\tparadise it is.  But me ending up\n\t\t\tdead won't do Sam a lick of good.\n\n166  EXT.  WILDER'S CABIN\n\nAnne Marie waits in front as Eric hobbles up.  She looks at\nhis bad ankle.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tYou're hurt.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tNothing broken.  C'mon, we have\n\t\t\tto hurry.\n\nHe leads her inside.\n\n\n\n167  INT.  WILDER'S CABIN\n\nCorbett is calmly reclining on the cot in the holding cell.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tCould've told you no one would\n\t\t\thelp...\n\nSeeing Anne Marie, he smiles.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; to Anne Marie)\n\t\t\tMaybe you can talk sense into\n\t\t\tyour boyfriend.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tShut up!\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Anne Marie)\n\n\t\t\tEither way, you better clear out.\n\t\t\tI don't want anyone innocent\n\t\t\tgetting harmed.\n\nThis comment has the intended effect on Anne Marie.  Angry,\nEric throws Corbett a coat.  Corbett puts it on.  Reaching\nthrough the bars, Eric cuffs Corbett's hands together.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe're moving.  Let's go.\n\nAs they exit, Corbett's sardonic look makes Anne Marie\nshiver.\n\n168  INT.  RENTAL CABIN\n\nThe ten-by-ten cabin is furnished with two sagging cots, a\nbeat-up color TV set, a cookstove and a half-drum heat\nstove.  Built into the rear wall is a rustic dumb waiter\nthat once lowered perishables into the icy waters of a\nnow-dry stream.\n\nEric checks his watch.  6:15 AM.  He bolts the door and\nblocks the windows, opening one enough to let sound in from\noutside.  He extinguishes the Benman lantern and douses the\nfire in the heat stove so no smoke will emit from the\nchimney.  Anne Marie slumps into the corner next to the dumb\nwaiter.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou'll catch a chill by that dumb\n\t\t\twaiter shaft.  Sit on the cot.\n\t\t\t(hands her the .44)\n\t\t\tKeep this pointed at him if I get\n\t\t\tpreoccupied.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n168  CONTINUED:\n\nAnne Marie reluctantly takes the huge gun.  Trying to allay\nher fears, Eric sits and brushes the hair from her face.\nCorbett intently watches them.  Before he can say anything,\nEric shoots him a cold look.  Corbett stays quiet.\n\n169  EXT. / INT.  DEVIL'S CAULDRON - VARIOUS ANGLES - DAY\n\nA pall hangs over the town.  People know to stay inside.\nTime crawls by.\n\nIn his house, Neff, for once, has his TV turned off.  He\ntries to read and listens for sounds outside.\n\nIn the spa, water DRIPS somewhere.  All the stalls are\nempty.\n\nIn his sod house, Kenai looks out his one tiny window at the\ncurtain of snow.  Dixie comes up behind him and puts her\nhands on his shoulders.  He looks up at her, glum.\n\nIn Wilder's empty cabin, his belongings are scattered about\nas if expecting his imminent return.\n\nIn the rental cabin, Eric checks his watch.  10:45 AM.\n\n170  EXT.  DEVIL'S CAULDRON - NEAR WILDER'S CABIN - DAY\n\nThe sound of a MOTOR grows in volume, then abruptly ceases.\nThe trappers' jeep APPEARS in the snowfall on the road into\ntown.  It coasts quietly in and stops behind the cover of a\nwoodpile across from Wilder's cabin.\n\nThe trappers get out of the jeep.  LeMalle has Eric's\nRemington, Mitchell has his Peacemaker, and Viking Bob\ncarries LeMalle's old carbine.  Mitchell spits.  It's so\ncold outside that the spittle freezes and CRACKS before it\nhits the ground.\n\nThey fan out and approach Wilder's cabin.\n\nANGLE WITH TRAPPERS\n\nThe cabin comes more clearly into view as the trappers move\ncloser.  There is no sign of life.  Viking Bob gestures for\nthe others, now positioned on either side of the cabin, to\ncrouch down for cover.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t(calls out)\n\t\t\tBen?  Ben Corbett?\n\nNo response.  Carbine held at his hip, Viking Bob walks up\nto the door and, with a mighty kick, BREAKS it in.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n170  CONTINUED:\n\nREVERSE ANGLE - THROUGH WILDER'S CABIN DOOR\n\nViking Bob points the carbine at an empty room.  He notices,\nhowever, Corbett's duffel bag on the floor of the cell.\n\n171  EXT.  DEVIL'S CAULDRON\n\nThe trappers march through town like an advancing army,\nlooking for some sign of Corbett.  LeMalle stops to dig\nthrough his pockets for some food.  All he comes up with is\nthe stump of a candy bar.  Viking Bob looks at him\nimpatiently.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tLook, we pull Ben's ass out of\n\t\t\tthe fire, I'll get you a whole\n\t\t\tdamn crate of Snickers bars.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(insulted)\n\t\t\tI'm right fuckin' here with you.\n\nTo prove his point, LeMalle trots from dwelling to dwelling,\nlooking through windows and letting himself in through any\nunlocked door.  This proves fruitless, so he lets out a\nfrustrated YELL.  Pointing the Remington skyward, he lets\noff a couple thunderous SHOTS that ECHO back off the\nfoothills.\n\n172  INT.  RENTAL CABIN\n\nHearing the shots, Eric pushes Anne Marie against the floor.\nCautioning her to stay put, he crawls to the window and\ntries to see through the snowfall.  After a moment of\nsilence, from outside, not too far away:\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE (OS)\n\t\t\tBen!  Speak out before I torch\n\t\t\tevery dump in town!\n\nEric points the magnum at Corbett.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tAnswer and I'll shoot!\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou kill me, you sign your death\n\t\t\twarrant.\n\t\t\t(re Anne Marie)\n\t\t\tAnd hers.\n\n\n\n173  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nViking Bob and Mitchell come running over to LeMalle.\nLeMalle fires another couple SHOTS for emphasis.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(calls out)\n\t\t\tYou hear me?  Ben?\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t(to LeMalle)\n\t\t\tEase off.  We do this my way.\n\nHe and the others strain their ears for a clue.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\t(continuing; calls out)\n\t\t\tWhoever's holding Ben Corbett,\n\t\t\tlisten to me: we just want to\n\t\t\tknow he's okay.  He is, nobody\n\t\t\tgets hurt.\n\n174  INT.  RENTAL CABIN\n\nHis mind racing, Eric stares at Corbett.  Despite the\nfreezing temperature of the room, he's sweating.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThey know I'm here.  I don't say\n\t\t\tsomething, they'll plow this town\n\t\t\tunder.  You willing to accept\n\t\t\tthat responsibility?\n\nSetting his resolve, Eric drags Corbett to the window.  He\npushes the barrel of the magnum against Corbett's cheek.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tSay you're okay.  Tell them I'll\n\t\t\tkill you if they rush us.\n\nAnne Marie bites her lip and tries to maintain a brave\nfront.  Despite the gun in his face, Corbett remains calm.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(shouts through window)\n\t\t\tBob?\n\n175  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nHearing Corbett's voice, the trappers spin around, trying to\nascertain its direction.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (OS)\n\t\t\tRelax.  I got a nervous man here\n\t\t\twith a magnum up my nose.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n175  CONTINUED:\n\nThe trappers follow his VOICE toward the rental cabins.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tYou in one piece?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (OS)\n\t\t\tI'm fine.  Look forward to seeing\n\t\t\tyou...\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tCount on it.\n\n176  INT.  RENTAL CABIN\n\nEric pulls Corbett away from the window.  He shoots a look\nat Anne Marie.  They're in a bind and she knows it.\n\n177  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nLeMalle grabs Viking Bob's arm.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(to Viking Bob)\n\t\t\tSweet-talk won't get shit.\n\t\t\t(calls out)\n\t\t\tChoose it, asswipe -- cut Corbett\n\t\t\tloose, or soon as you come\n\t\t\toutside, I put a fuckin' bullet\n\t\t\tthrough your eye!\n\n178  INT.  RENTAL CABIN\n\nEric glances at Corbett, whose grim look certifies LeMalle's\nboast.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSnow's to their advantage, kid.\n\t\t\tYou can't see them, but soon as\n\t\t\tthat plane comes, they'll sure as\n\t\t\thell know where we're going.\n\t\t\tWise up.  Take me to the Yukon.\n\t\t\tI'll give you that money and\n\t\t\tguarantee you'll walk away.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhy offer a buyoff with your\n\t\t\tgunmen waiting outside?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tThe time has passed for men like\n\t\t\tthem and me.  I know it.  But\n\t\t\tthey're still fighting for\n\t\t\tsurvival, like cornered animals.\n\t\t\tThat's why they'll kill you.\n\t\t\t\t\t-more-\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n178  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT (Cont'd)\n\t\t\t(smiles)\n\t\t\tBe rude to let that happen after\n\t\t\tyou kept me from freezing back\n\t\t\tthere.\n\nAnne Marie tries to hide how tempted she is by Corbett's\noffer.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(to Eric)\n\t\t\tHe's right about the snow.  We're\n\t\t\tblind.\n\nEric sighs -- is she against him, too?  From outside:\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB (OS)\n\t\t\tBen?\n\nThe trappers are obviously much closer.  Eric signals to\nCorbett not to answer.\n\nNEW ANGLE\n\nEric and Corbett face the window.  They don't notice as Anne\nMarie quietly shimmies outside through the narrow dumb\nwaiter shaft to the back of the rental cabin.  Eric turns,\ngasping as he realizes she's gone.  Corbett smiles\nsardonically.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tAt least your girl had the sense\n\t\t\tto jump ship.  Too bad she's the\n\t\t\tonly one small enough to fit\n\t\t\tthrough that dumb waiter.\n\n179  EXT.  DEVIL'S CAULDRON - FOLLOW ANNE MARIE\n\nUsing the cover of the snowfall, Anne Marie circles around\nthe outside edge of town toward Wilder's cabin.  She takes\nsome of her photo gear from the snowmobile.\n\n180  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nUnaware of Anne Marie's maneuver, the trappers wait for a\nresponse from Corbett.  None comes.  Viking Bob places a\ncalming hand on LeMalle's shoulder.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tJust wait, we don't know what\n\t\t\tthis guy's up to.  Ben'll let us\n\t\t\tknow what to do.\n\n\n\n181  EXT.  DEVIL'S CAULDRON - ANTENNA TOWER\n\nWith a camera bag slung over her shoulder, Anne Marie climbs\nup the metal antenna tower behind Neff's house on the edge\nof town. She grits her teeth and fights back a wave of\nvertigo. The ground disappears from sight, hidden by the\nsnow and fog.\n\nFifty feet up, she attaches her infrared video camera to the\ntower crossbars and, using a length of coaxial cable, hooks\nits RF output to the feedline of the community TV antenna.\n\n182  INT.  RENTAL CABIN\n\nEric looks at his watch.  10:55 AM.\n\n183  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nA CRACKING twig behind the cabins gets the trappers'\nattention.  Clutching his rifle, LeMalle goes to\ninvestigate.\n\nWITH LEMALLE\n\nas he probes through the snow, listening.  He reaches the\nedge of the woods and, finding nothing, returns to the\nothers.\n\nNEW ANGLE\n\nAnne Marie crouches behind a tree, twenty feet behind\nLeMalle.  After a moment, she tiptoes back toward the rental\ncabin.\n\n184  INT.  RENTAL CABIN\n\nEric and Corbett turn as Anne Marie's camera bag suddenly\ndrops from the dumb waiter shaft.  Anne Marie wriggles back\ninside.  Before Eric can say anything, she puts her fingers\nover his mouth.  She turns on the TV set and tunes it to\nchannel 3.\n\nANGLE ON TV\n\nA fuzzy IMAGE comes into view.  It's Devil's Cauldron from\nthe vantage of Anne Marie's infrared video camera.  The\nfalling snow shows up as a translucent yellow wash over the\nscene.  Buildings are distinguishable as bluish silhouettes.\nHeat-producing objects -- warm walls, chimney smoke, etc. --\nare pink and red.  And there are three clearly-definable\nhuman figures standing near the Maqi.  The trappers.\n\nBACK TO SCENE\n\nCorbett is amazed.  Eric smiles at Anne Marie.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n184  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYour infrared camera?\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(nods)\n\t\t\tTechnology in the wilderness.\n\t\t\tOnly problem is talking to you on\n\t\t\tyour way to the landing strip.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tI've got an idea.  We'll have to\n\t\t\twork fast.\n\nHe digs through Anne Marie's bag of equipment and supplies,\nthen stops and looks up.  Outside, there is an OS SOUND that\nis felt before it is HEARD.  The cargo PLANE approaches in\nthe distance.\n\n185  EXT.  DEVIL'S CAULDRON - NEAR MAQI\n\nThe trappers look at each other as the SOUND of the plane\ngrows louder.\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tThere's what they're waiting on!\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(smiles tightly)\n\t\t\tThey'll have to come right past\n\t\t\tus.\n\n186  EXT.  RENTAL CABIN\n\nEric quietly pulls the door open.  Holding the pistol to\nCorbett's head, he pushes Corbett out in front of him.\n\nAnne Marie and Eric exchange a long look.  Fighting back\ntears, she reaches up and touches his face.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWhen you ran off, I thought you'd\n\t\t\tkeep going 'til you were back\n\t\t\thome in Washington.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tMy home is here.  With you.\n\nHe smiles.  Then he and Corbett are gone, lost from sight in\nthe snowfall.   After a beat, Anne Marie takes a deep breath\nand slinks away in the other direction, toward the dance\nhall.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n186  CONTINUED:\n\nANGLE NEAR THE MAQI\n\nThe trappers wait, twenty-five feet from Eric and Corbett.\nThe DRONE of the plane grows louder.\n\nERIC AND CORBETT\n\nstart toward the airstrip.  Corbett sees a patch of bare\ndirt and SCUFFS his feet in it.\n\nANGLE NEAR MAQI\n\nThe trappers turn to the SOUND, heard under the RUMBLE of\nthe still-distant plane.  Converging, they head in that\ndirection.  Suddenly, Anne Marie's VOICE booms through the\ntown:\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE (OS)\n\t\t\t(over PA)\n\t\t\tThey're moving toward you!\n\nWIDER\n\nEric SHOOTS a couple times, then backtracks and pulls\nCorbett behind one of the rental cabins.\n\nDucking the bullets, the trappers sprawl onto the ground.\n\n187  INT.  DANCE HALL\n\nAnne Marie has turned on the rusty TV near the pulpit.\nWhile watching the infrared IMAGE of the action outside, she\nholds the microphone wired to the old PA.\n\nANGLE - THE TRAPPERS\n\nViking Bob gestures to Mitchell and LeMalle to separate.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE (OS)\n\t\t\t(over PA)\n\t\t\tThey're fanning out.\n\nAngry, LeMalle BLASTS his rifle in direction of her VOICE.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(to Viking Bob)\n\t\t\tKenai's PA -- but how the fuck\n\t\t\tshe seein' us?\n\t\t\t\t\t\n\t\t\t\t\tVIKING BOB\n\t\t\tDoesn't matter.  We know where\n\t\t\tthey're going.  C'mon.\n\nStalking, anxious, LeMalle follows Viking Bob.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n187  CONTINUED:\n\n\nMITCHELL\n\nsplits off from them and looks for footprints in the snow.\n\n188  EXT.  ALLEY\n\nEric pushes Corbett through a narrow pass between two\nbuildings in the center of town.  He walks in Corbett's\nfootprints.  Almost through to the other side, he suddenly\nstops.  Pulling Corbett with him, Eric walks backwards,\nstill carefully placing each foot in an existing footprINT.\nCorbett can't help but smile.\n\n189  INT.  DANCE HALL\n\nWatching the TV screen, Anne Marie sees one of the red blips\nchange direction and head toward her.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(into mic)\n\t\t\tOne is moving back toward the\n\t\t\tcabins.\n\n190  EXT.  DANCE HALL\n\nIt's LeMalle.  He crosses to Kenai's generator.  With a\nwell-placed rifle SHOT to its innards, he GRINDS it to a\nhalt.\n\n191  INT.  DANCE HALL\n\nThe TV PICTURE disappears as the power dies.  Anne Marie\nkeys the PA microphone; it's dead, too.\n\n192  EXT.  ALLEY\n\nEric and Corbett emerge from between the buildings.  Eric\nbacktracks toward the hot springs spa, now leaving an\nobvious trail.\n\n193  EXT.  HOT SPRINGS SPA\n\nEric and Corbett go inside.  Eric pulls the door closed\nbehind them, but leaves it ajar.\n\n194  INT.  KENAI'S HOUSE\n\nThe DRONE of the approaching plane is ever louder.  Kenai\nstands and pulls on a succession of sweaters.  Dixie looks\nat him.\n\t\t\t\t\t\n\t\t\t\t\tDIXIE\n\t\t\tEarl, it's crazy to go out there.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n194  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tI hear someone in the spa.\n\nHe straps on a holster under his sealskin coat.\n\n195  EXT.  DEVIL'S CAULDRON - AIRSTRIP - LONG SHOT\n\nThe big 4-prop plane is about to touch down on the far side\nof the snow-covered airstrip.\n\n196  INT.  DANCE HALL\n\nAnne Marie zips up her parka and cautiously goes outside.\n\n197  EXT.  HOT SPRINGS SPA\n\nLeMalle follows the footprints to the door Eric left ajar.\nHe peers inside.\n\n198  INT.  HOT SPRINGS SPA\n\nIt's tomb-quiet except for water DRIPPING and pipes\nCREAKING.  LeMalle looks around.  The sound of a small DING\nagainst metal above him gets his attention.\n\nHe sees a fleeting shadow cut across the catwalk above him.\nHe finds a metal ladder, slings his rifle over his shoulder\nand climbs up.  Hearing another SOUND on the far side of the\ncatwalk, he hurries across, holding onto the pipes for\nbalance.\n\nLeMalle is directly above the huge central pool.  He ducks\nto go under a long piece of twine running from the ceiling\nto a dark corner below.  Suddenly, the twine snaps tight,\npulling open a heavy trap door on the ceiling.  The door\nswings down and knocks LeMalle off the catwalk.  With a\nyelp, he splashes into the water below.\n\nNEW ANGLE\n\nHidden in the shadows, Eric drops the end of the twine and\nrushes toward the front door with Corbett in tow.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(to Corbett)\n\t\t\tThat'll keep him out of the cold.\n\nLEMALLE\n\nclimbs out of the central pool, soaked.   He pulls his wet\njacket off and furiously throws it down.\n\n\n\n199  EXT.  HOT SPRINGS SPA\n\nEric leads Corbett around the back of the spa.  A GUNSHOT\nrings out nearby and a BULLET hits the wall above Eric's\nhead.\n\nMITCHELL\n\nhas seen their faint silhouettes through the snow.  He\npurposely SHOOTS over their heads so he doesn't hit Corbett.\n\nANGLE BEHIND HOT SPRINGS SPA\n\nEric and Corbett crouch down and double back.   They are\nonce again swallowed up by the snowfall.\n\n200  EXT.  ALLEY\n\nViking Bob follows their footprints in between the\nbuildings.  He continues to a point where they converge to\none set, then stop.  He smiles at the naivete of Eric's\nploy.  Looking at the boardwalk railing above, he assumes\nEric and Corbett have swung over it onto the iced-over\nboardwalk.  Pleased with his deduction, Viking Bob continues\nalong the alley.\n\nSNAP!  Viking Bob lets out a horrible HOWL and falls on his\nback in the snow.  Biting into his right calf is a huge\nconibear leg trap.  In extreme pain, he struggles to lever\nit open with the barrel of his rifle.\n\n201  EXT.  KENAI'S GENERAL STORE\n\nCorbett shoots Eric a dangerous look as Viking Bob's CRIES\ncarry though the town.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHe'll live.\n\n202  EXT.  ALLEY\n\nHearing Viking Bob's cries, Mitchell backtracks and rushes\nto Viking Bob's aid.  Between them, they manage to yawn open\nthe jaws of the trap and free Viking Bob's leg.  Viking Bob\ntries to walk but the leg won't support him -- the bone is\nbroken.  Bitterly frustrated, he waves Mitchell on.  In\nagony, Viking Bob eases down in the snow.  He tears a strip\nof lining from his coat and wraps his leg to stop the\nbleeding.\n\n203  EXT.  HOT SPRINGS SPA\n\nAnne Marie scurries by on her way to the airstrip.\nSuddenly, the hot springs door bursts open and LeMalle\nlunges at her.  Stripped of his wet clothes, he's wrapped\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n203  CONTINUED:\n\nin blankets and furs, his feet protected by sacks lashed to\nthem.  His wet body and hair steams in the frigid air.\n\nAnne Marie lets out a startled cry and springs away from\nhim.  She falls hard on her back, knocking her wind out.\nScrambling for footing in the snow, LeMalle drops his rifle.\nHe comes at her again.  Anne Marie moves away and pulls the\n.44 magnum out.  LeMalle stops and glares at her.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(gasping)\n\t\t\tDon't make me shoot.\n\nShe gets up, keeping the magnum pointed shakily toward him.\nLeMalle glowers menacingly.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\t(continuing)\n\t\t\tWe're going to Sam's cabin.  You\n\t\t\tcan stay in the jail until this\n\t\t\tis over.\n\nLeMalle slowly crouches down for his rifle.  Anne Marie\nwields the handgun at him, but he doesn't stop.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tWant to chance it with that\n\t\t\thog-leg?  You can't even hold it\n\t\t\tup.  Better drop me first shot,\n\t\t\tbitch, or I'll rip your fuckin'\n\t\t\tlungs out.\n\nTaunting, sneering, LeMalle stares her down.  Anne Marie is\nparalyzed.  Feeling that he's won, LeMalle wraps his bony\nfingers around the stock of the Remington.\n\nAnne Marie closes her eyes and FIRES.  Pulling the rifle\nclose, LeMalle tucks and rolls and jumps to his feet.  Anne\nMarie FIRES again, and AGAIN.  Shot, LeMalle hobbles away,\nleaving a trail of blood in the snow.  Numb, Anne Marie lets\nher arm fall.\n\n204  EXT.  BOARDWALK NEAR WILDER'S CABIN\n\nEric looks around at the sound of the shooting, fearing the\nworst.  He pulls Corbett off the boardwalk and they cut\nacross open ground toward the airstrip depot.\n\n205  INT.  HOT SPRINGS SPA\n\nKenai looks around at the messy RESULTS of LeMalle's\nransacking for things to wear.  Kenai turns, startled, when\nhe hears footsteps.  It's Neff and Meyerling.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n205  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\t(disgusted)\n\t\t\tLookit this damn mess.  Where in\n\t\t\thell's Wilder?\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\t(after a beat)\n\t\t\tDead.  Trappers killed him.\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tAw, Jesus.  Told you this was\n\t\t\ttrouble.\n\t\t\t(to Meyerling)\n\t\t\tWhat about you, big shot?  Do\n\t\t\tsomething.  Who's side are you\n\t\t\ton, anyway?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tHey, I thought you people loved\n\t\t\tCorbett and his wild men!\n\t\t\t\t\t\n\t\t\t\t\tKENAI\n\t\t\tThis shoot-'em-up shit is bad for\n\t\t\tbusiness.  I'm sick of it.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tWhat about you, Neff?\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tWell... two of the trappers are\n\t\t\tdown already --\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(suddenly on the bandwagon)\n\t\t\t-- One left; three of us.  Let's\n\t\t\tfinish it.\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tWhat about Eric Desmond?\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tI'll handle him.\n\n206  EXT.  YARDS BEHIND AIRSTRIP DEPOT\n\nThrough the snow, Eric can see the faint outline of the\nplane on the runway.  He and Corbett hurry toward the back\nof the airstrip depot.\n\nAs they wend their way through the junk-filled yards, Eric\ncatches a glimpse of movement around a corner, REFLECTED in\na pane of glass leaning against a roll of tar paper.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n206  CONTINUED:\n\nERIC'S POV - REFLECTION\n\nPeacemaker in hand, Mitchell is behind the depot, coming\nright for them.\n\nWIDER\n\nEric takes out the homemade flashbomb.  He lights it, tosses\nit toward Mitchell and covers his eyes.  It EXPLODES with a\nmuffled pop and a bright flash of white light.\n\nMitchell stumbles backwards and blinks his eyes.  The flash\nhas temporarily clouded his vision.\n\nEric moves Corbett to another approach to the depot and\nwaits for Mitchell to move on.\n\n207  EXT.  REAR WALL OF AIRSTRIP DEPOT\n\nMitchell is about to do just that when a hand on his\nshoulder stops him.  It's LeMalle, oblivious to the profuse\nbleeding from his right shoulder.  Mitchell blinks, still\nhaving trouble seeing.  LeMalle gestures for him to be quiet\nand points in Eric and Corbett's direction.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\t(whispers)\n\t\t\tOver there...\n\nHe hoists his Remington.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\t(whispers)\n\t\t\tHold it.  You might hit Ben.\n\t\t\t\t\t\n\t\t\t\t\tLEMALLE\n\t\t\tBullshit.  I hit what I'm aiming\n\t\t\tat.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tLet 'em come closer first...\n\nBut LeMalle is too anxious.  He swings the rifle up,\nleft-handed, and SHOOTS.\n\nNEW ANGLE\n\nThe bullet just misses Eric.  He panics and wildly returns\nFIRE with the .357.\n\n208  EXT.  REAR WALL OF AIRSTRIP DEPOT\n\nMitchell and LeMalle scatter under the hail of bullets.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n208  CONTINUED:\n\nANGLE ON ERIC AND CORBETT\n\nas they HEAR LeMalle's labored footsteps run past them,\nnearby.  Eric peers cautiously around the corner toward the\ndepot.  There is no further movement.\n\nEric waits a moment, then leads Corbett cautiously toward\nthe depot.\n\n209  EXT.  REAR WALL OF AIRSTRIP DEPOT\n\nReaching the rear wall, they practically stumble over\nsomething.  It's Mitchell, lying on the ground near the\nwall, badly wounded by Eric's barrage.  Eric gasps.\nAnguished, Corbett kneels next to Mitchell.  Mitchell pulls\nhim closer.\n\t\t\t\t\t\n\t\t\t\t\tMITCHELL\n\t\t\tGlad to see you're okay.  I told\n\t\t\tLeMalle not to shoot.\n\t\t\t(tries to smile)\n\t\t\tHad some fine seasons, didn't\n\t\t\twe...\n\nMitchell's grasp on Corbett's coat relaxes as he dies.\nHorrified, Eric stares at the man he killed.  Noticing the\nscrimshaw lying on the snow where it slipped from Mitchell's\npocket, Corbett picks it up.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Eric)\n\t\t\tFifteen years on the trail with\n\t\t\tthis man, I never saw him rise to\n\t\t\tanger.\n\nGlaring at Eric, Corbett dips his hand in Mitchell's blood,\nand suddenly smears it across Eric's mouth.  Repelled, Eric\npulls back.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; bitterly)\n\t\t\tYour first kill.  How does it\n\t\t\ttaste?\n\nWiping his face, sickened and desolate, Eric has no reply.\n\nWIDER\n\nThen, from somewhere close by, LeMalle FIRES at them.  Eric\nstuffs the .357 in his belt and uses a brick to knock the\npadlock off the back door of the depot.  He pushes Corbett\ninside.\n\n\n\n210  INT.  CARGO PLANE - COCKPIT\n\nThe pony-tailed, ex-hippie PILOT shuts his engines off and\nremoves his Walkman headphones.  Hearing LeMalle's\ncontinuing GUNSHOTS, the Pilot pulls his door closed and\nturns on his two-way radio.\n\t\t\t\t\t\n\t\t\t\t\tPILOT\n\t\t\t(into radio mic)\n\t\t\tCircle, this is BMY-955.  I just\n\t\t\ttouched down in Devil's Cauldron.\n\t\t\tNobody's here to greet me like\n\t\t\tusual, and there's gunfire.  I'm\n\t\t\tgetting scarce.\n\nWith that, he STARTS his engines up again.\n\nCUT TO ERIC IN DEPOT\n\nwho turns, startled, when he hears the ENGINES coughing to\nlife OS.\n\n211  INT.  CARGO PLANE - COCKPIT\n\nThe Pilot fiddles with his controls and prepares to take\noff.  He looks up, surprised, as the passenger door suddenly\nopens.\n\nWIDER\n\nAnne Marie slides onto the seat.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tYou can't leave yet.\n\t\t\t\t\t\n\t\t\t\t\tPILOT\n\t\t\tIt's my responsibility to get\n\t\t\tthis aircraft out of here safely.\n\nAnne Marie points the .44 at him.\n\t\t\t\t\t\n\t\t\t\t\tPILOT\n\t\t\t(continuing)\n\t\t\tYou got to be kidding.\n\t\t\t\t\t\n\t\t\t\t\tANNE MARIE\n\t\t\tLeave the engines idling.  Go\n\t\t\tback and open the side door.\n\n\nShaking his head and muttering, the Pilot unfastens his seat\nbelt, climbs between the two seats to the cargo compartment,\nand obliges the little lady with the big gun.\n\n\n\n212  INT.  AIRSTRIP DEPOT\n\nThe depot, as temporary-looking as the rest of Devil's\nCauldron, is a boxcar-shaped loading dock and warehouse with\na corrugated steel roof.  Boxes, wood palettes and hand\ndollies are piled haphazardly about.\n\nEric and Corbett navigate through the piles of boxes,\ninching toward the front door -- the door leading to the\nplane.\n\nSuddenly, a string of overhead lights come on.  Eric goes\nfor the .357, then stops when he sees Meyerling, Kenai and\nNeff have come in the front door.  Kenai stomps his feet and\nshivers.  Grandstanding for the others, Meyerling steps\nforward.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tNobody wants any more killings;\n\t\t\twe all agree to that, correct?\n\t\t\t(no one argues)\n\t\t\tThat's good.  Now, Eric, you're\n\t\t\tgonna hand your prisoner over to\n\t\t\tus.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tFuck you.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tThis isn't your concern.  It's\n\t\t\tover, here and now.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(to Meyerling)\n\t\t\tSure, when you put a bullet in my\n\t\t\tback on the way out.  Easier for\n\t\t\tall involved.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\tNot a bad idea.  Face it, Ben.\n\t\t\tThere's no room in Alaska for you\n\t\t\tany more.\n\nMeyerling pokes with his foot at a tipped-over rack of\nEskimo paraphernalia -- masks, furs, big skin drums, fish-\nand bear-spears.\n\t\t\t\t\t\n\t\t\t\t\tMEYERLING\n\t\t\t(continuing)\n\t\t\tYou're as antiquated as this\n\t\t\tshit.\n\nMeyerling moves toward Corbett, but Eric stands in his way.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n212  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tKeep back.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tYou're quite a piece of work,\n\t\t\tMeyerling.  The tide changes, you\n\t\t\tride right along with it.\n\nEric looks at Neff.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tNeff, you know better than\n\t\t\tthis...\n\t\t\t\t\t\n\t\t\t\t\tNEFF\n\t\t\tYou're an outsider, Mr. Desmond.\n\t\t\tStep aside; stay out of it.\n\nKenai and Neff move in with Meyerling.  Eric stands his\nground and reaches for the .357 in his belt.\n\nNEW ANGLE\n\nSuddenly, LeMalle stumbles into the depot, the blankets and\nfurs dragging at his feet.  His right side is bathed in\nblood.  Half-frozen, bled dry, he looks ready to drop down\ndead.  In his left hand, impossibly, he still clutches the\nmassive Remington.\n\nHe hoists it to his hip and grits his teeth as he BOLTS a\nround into the chamber with his injured right arm.  Bracing\nhimself, he levels the rifle at Eric.\n\nHearing the ACTION of the rifle, Eric turns.\n\nCorbett reaches down, grabs a rusty Eskimo spear in both his\nhandcuffed hands, and hurls it.\n\nThere is a deafening ROAR as LeMalle's rifle discharges.\n\nLeMalle flies back from the recoil -- and from the spear\nstuck clear through his chest.\n\nSome packing material above Eric's head smolders, ignited by\nthe muzzle blast.\n\nNEW ANGLE\n\nThere is a moment of silence.  Corbett looks at the other\nweapons near him, and then at Meyerling.  Threatened,\nMeyerling pulls out a .380 automatic.  Before Eric can do\nanything, Meyerling FIRES.\n\nThe IMPACT of the bullet throws Corbett against some boxes.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n212  CONTINUED:  (2)\n\nWith a YELL, Eric jumps Meyerling and rips the gun from his\ngrasp.  Enraged, he pummels Meyerling with it until Kenai\nand Neff pull them apart.  Eric wrenches away from them and\nscrambles to his feet with Meyerling's gun in his hand.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tAnybody moves and I'll shoot!\n\nHolding the .380 on them, Eric crosses to Corbett.  Bleeding\nfrom the abdomen, he's trying to stand up.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\t(continuing)\n\t\t\tCan you walk?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tWound's a through-and-through.\n\t\t\tMissed my liver, I think.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tLet's get out of here.\n\nCautiously backing away from the others, Eric helps Corbett\nget up and shuffle toward the OS SOUND of the cargo plane.\n\n213  EXT.  DEVIL'S CAULDRON - AIRSTRIP\n\nAnne Marie jumps down from the cockpit.  She and Eric lift\nCorbett into the plane.\n\n214  EXT.  CARGO PLANE\n\nas it taxis and lifts off.\n\n215  INT.  CARGO PLANE - (AERIAL SHOT)\n\nWhile Eric takes Corbett's handcuffs off, Anne Marie looks\nat his wound.  He waves her away.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tHow come you didn't let him shoot\n\t\t\tme?\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(softly)\n\t\t\tLike I said, I'd still be up on\n\t\t\tthat mountain, frozen solid, it\n\t\t\twasn't for you.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tWe'll get you to a hospital, soon\n\t\t\tas we get to Fairbanks.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t(CONTINUED)\n215  CONTINUED:\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\tSo they can patch me up and put\n\t\t\tme in a cage?  Forget it.\n\t\t\tMeyerling's right -- I'm a\n\t\t\tdinosaur.  Greedy bastards like\n\t\t\thim, it's their turn with this\n\t\t\tland.  Put me in the woods, let\n\t\t\tme live or die on my own.\n\nHe painfully pulls himself into a sitting position.\n\t\t\t\t\t\n\t\t\t\t\tCORBETT\n\t\t\t(continuing; peers out\n\t\t\t\twindow)\n\t\t\tLook down there, tell me what any\n\t\t\tof this matters.  Struggles of\n\t\t\tmen get swallowed by the bigness.\n\t\t\tSoon there won't be a trace of\n\t\t\tour troubles... or us.\n\t\t\t\t\t\n\t\t\t\t\tERIC\n\t\t\tYou're wrong.  Everything we do\n\t\t\tleaves its mark.  You said it\n\t\t\tyourself -- there are hundred-\n\t\t\tyear-old footprints in the\n\t\t\ttundra.\n\nToo tired to argue, Corbett leans back against the window.\nHe takes Mitchell's scrimshaw out of his pocket and looks at\nit.\n\nEXTREME CLOSE UP - THE SCRIMSHAW\n\nThe exquisitely beautiful and detailed engraving depicts a\ngrizzly beside a wilderness creek, with trees and mountains\nin the background.\n\nCORBETT\n\nclutches the scrimshaw in his hand and closes his eyes.\n\nNEW ANGLE - (AERIAL SHOT)\n\nEric sighs as he looks at the blood -- Mitchell's blood --\non the back of his hand.  He stares at Corbett for a long\nmoment.  Then, resolved, he climbs up front and says\nsomething to the Pilot.  Grumbling, the Pilot adjusts his\ncontrols.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tCUT TO:\n\n\n\n216  EXT.  HAUL ROAD - PUMPING STATION - DAY\n\nThe snow clouds are dissipating.  The cargo plane comes down\nthrough them and lands on the airstrip behind the pumping\nstation.\n\n217  INT.  CARGO PLANE\n\nAs it rolls to a stop, Eric throws open the cargo door.\nCorbett sits up, surprised.  He and Eric exchange a long\nlook, then Corbett crosses to the open door and gingerly\nsteps down onto the snow-covered runway.\n\n218  EXT.  CARGO PLANE\n\nEric and Anne Marie watch from the door of the plane as\nCorbett limps across the runway toward the treeline.  As he\ngoes, his footprints are dusted over by the snow and wind.\n\nCorbett stops, turns and looks back at Eric, then continues\nonward, disappearing into the forest.\n\nANGLE ON CARGO PLANE\n\nEric closes the cargo door as the Pilot turns the plane\naround and taxis back down the runway.\n\n219  INT.  CARGO PLANE - (AERIAL SHOT)\n\nEric wearily sits next to Anne Marie.  She kisses him.\n\nThe Pilot glances over his shoulder and frowns.\n\t\t\t\t\t\n\t\t\t\t\tPILOT\n\t\t\t(to himself)\n\t\t\tToo damn crazy in this state\n\t\t\tanymore.  I'm moving back to L.A.\n\n220  INT.  CARGO PLANE - ANGLE THROUGH WINDOW - (AERIAL SHOT)\n\nThe plane climbs above the fog and snow clouds into a sunny,\nice blue sky.  It banks and turns south.  Behind it, the\nmountains roll on toward the Arctic wasteland, forever.\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tFADE OUT\n\t\t\t\t\t\t\n\n\n\n<!--Ad Banner\nfunction popupPage() {\n var windowopts = \"location=no,scrollbars=no,menubars=no,toolbars=no,resizable=yes,left= 50,top=50,width=490,height=130\";\n\n popup2054 = open('/prohost/banner.html',\"MenuPopup\",windowopts);\n popup2054.focus();\n<b>}\n</b>\npopupPage();\n\n//  Ad Banner-->\n\n\n\n\n\n\nArctic Blue\nWriters :   Ross LaManna\nGenres :   Action  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:39.874378"}