{"title": "Armageddon", "film_link": "/Movie Scripts/Armageddon Script.html", "script_link": "/scripts/Armageddon.html", "info_raw": "\n\nArmageddon Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.85 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jonathan Hensleigh  J.J. Abrams\nGenres  Action  Sci-Fi  Thriller\nScript Date :  1998\n\nRead \"Armageddon\" Script\n\n\n", "script": "\nArmageddon\n\nFADE IN\n\nBlackness. Then a hint of green becomes EARTH. It lies across an \nexpanse of  space. Richly colored. Fertile.\n\nA GIGANTIC ASTEROID cuts into frame, Burning into EARTH'S \nATMOSPHERE and  striking down in the currant area of Guzumel, \nMexico.\n\nVoice An impact equivalent to ten thousand nuclear weapons \ndetonating  simultaneously.\n\nA HUGE DINOSAUR FOOT steps down hard and is VAPORIZED with a \ndeafening ROAR.\n\nVoice One hundred trillion tons of dirt and rock hurled into the \natmosphere. \n\nEARTH, seen from space, is rocked with an IMMENSE SHOCKWAVE. A \nSHEET OF DEBRIS  washes across the North and South Hemispheres.\n\nVoice A blanket of dust the sun is powerless to penetrate. For \nfive thousand  years our world is robbed of light as a nuclear \nwinter falls. In that darkness,  a civilisation is removed from \nexistence.\n\nEARTH is now completely entombed in a dark, cold hell. Letters \npush towards us--\n\n\"A R M A G E D D O N\"\n\n65 MILLION YEARS LATER\n\nEARTH, reflected off the face of ASTRONAUT PETE SHELBY'S HELMET. \nIt appears  close enough to touch. Shelby, attached to SHUTTLE \nATLANTIS BY LIFELINE,  struggles to replace a piece of the \nshuttle's operational arm.\n\nShelby \n(with radio squawking)\n Houston, I can't get this thing to work...\n\nEXT. N.A.S.A. - MISSION CONTROL - DAY\n\nGolden The size of Texas. In a hub of computers and tracking \nequipment, we find DAN GOLDEN, former  Astronaut from Apollo 8 \n(first crew to orbit the Moon)\n and now N.A.S.A's  second-in-command. Golden is watching Shelby \non a SERIES OF VIDEO SCREENS.  FLIGHT DIRECTOR WALTER CLARK sits \nwith rows of N.A.S.A Techs. Golden stands over  him, arms on the \nback o his chair.\n\nClark Atlantis, what's the problem?\n\nShelby \n(V.0)\n It just isn't working. Any suggestions?\n\nClarke Hang on Pete. We'll figure something out for you.\n\nGolden taps Clark and sits down.\n\nGolden \n(to Shelby)\n We got the top scientific minds in the world working on  this. \n(a slight smile)\n Try \"whacking\" the thing. \n\nShelby Okay, Houston, commence whacking.\n\nSelby begins Whacking the satellite with his glove. The SATELLITE \ncomes n-line,  lights up like a Christmas tree.\n\nA HORRIFYING RUMBLING SOUND. SHOTGUN LIKE PELLETS assault the \nsatellite.  SHRAPNEL rips into it's delicate gold skin. The \nsatellite EXPLODES. Shelby's  lifeline breaks; he spins off, suit \nleaking from twenty punctures.\n\nINT. SHUTTLE ATLANTIS\n\nCOMMANDER JAMES TURNER turns to his left\n\nGeneral \"WHAT THE HELL WAS THAT?\"\n\nEXT. SHUTTLE ATLANTIS\n\nSTOTGUN LIKE PELLETS shred through Atlantis' N.A.S.A. logo, \npeeling the shuttle  down to her ribs. FIERY EXPLOSION.\n\nEXT. SPACE\n\nCLOSE ON SHELBY as he twirls away from Atlantis. His helmet is \nfogging. He gasps  for air, wretching, his eyelids leaking blood. \nHe tries to form words\n\nShelby Ple...he...me....\n\nShelby's SHOULDER-CAM angle spins end-over-end....\n\nINT. N.A.S.A - MISSION CONTROL MONITORS go dead.\n\nN.A.S.A. Technician #1 All systems crashing!\n\nN.A.S.A. Technician #2 Massive failure. We lost them.\n\nUtter silence. Utter desolation. DOLLY IN ON GOLDEN'S FACE. Utter \ndisbelief.\n\nINT. WKU MOUNTIAN OBSERVATORY - NIGHT\n\nTHEO and PEARL \n(at telescope)\n, and JIMBO \n(at the console)\n, 20's, are  star-gazing. Astronomy books, Starbucks cups, etc., \nspread all over. Nine Inch  Nails plays on the radio. These three \ncould land a date if only they would lose  the road flares \n(plaid shirts, glasses)\n that signal the painful fact that they  are die-hard science \nnerds THEO'S POV - THROUGH WKU TELESCOPE - Far off in space  is a \ndusty, murky swarm of matter - something resembling a FLOATING \nEXPLOSION.\n\nJimbo When are we going to let N.A.S.A in on what we've found?\n\nTheo We don't even know what we have yet. Comet, asteroid - it \ncould be  anything up there. And don't be so eager to red flag \nN.A.S.A. They don't call us  when they discover anything.\n\nJimbo Yeah, but this is their sandbox were playing in.\n\nTheo This is our discovery. We're going to hold a press \nconference. We're  going to be famous. SPACEWATCH'll name this \nthing after us. Job offers are going  to fly in from all the big \ncompanies. J.P.L., that think tank up at M.I.T., hell  even \nN.A.S.A. 'll be chasing us.\n\nPearl I'm going on Oprah, Larry King, Letterman...\n\nJimbo Hell with them, I'm going on Howard Stern....\n\nPearl \n(concentrating)\n This things really acting up tonight. We should find out  if \nanyone else knows about this.\n\nTheo How?\n\nJimbo \n(master of factly)\n Call N.A.S.A\n\nTheo And say what? \"Hi, we're a couple astronomer geeks who found \nsomething  really bitchin; floatin' in space.\" You can't just \ncall N.A.S.A. It's like  calling the White House. Besides, you'll \nnever get the number.\n\nJimbo I have the number. I got it from \"Mega monster.\"\n\nPearl Who?\n\nJimbo He's some super-hacker, I went to high school with. Guy's \ntotally wired  into every encrypted government installation.\n\nTheo He's also an ex-con.\n\nJimbo They never proved he shut down the power in those seven \nstates.\n\nTheo grabs the phone.\n\nINT. HOUSTON TEXAS - JOHNSON SPACE CENTER - NIGHT\n\nGolden and his crew, devastated and exhausted, search for \nanswers. We cut around  the room.\n\nClark What the hell was that?\n\nTechnician 1 Space junk?\n\nTechnician 2 Too big, too much. It took out the whole shuttle.\n\nClark The press is going to want answers. What are we going to \nsay?\n\nGolden Nothing. Not until we know what happened.\n\nINTERCUT - N.A.S.A. MISSION CONTROL/WKU OBSERVATORY\n\nINT. N.A.S.A. - MISSION CONTROL\n\nTwo N.A.S.A. techs, FLIP and SKIP, looking very haggard, \nfuriously typing  numbers into the circulator. The phone RINGS, \nFlip answers.\n\nJimbo \n(whispers to Pearl & Theo)\n I got mission control....!\n\nFlip Yeah, Mission Control.\n\nJimbo \n(into phone)\n Uhh hi, I'm an astronomer in Kentucky, and I was wondering  if \nyou guys had seen some strange activity in the southern middle \nquadrant of  the asteroid belt between Antares Major and Epsilom \nScorpio....\n\nFlip Who is this?\n\nJimbo My name? Uhh....Louis Lipshitz...\n\nFlip This is a restricted line. How did you get it? Where are \nyou?\n\nJimbo Lexington... Massachusetts.\n\nFlip Can you tell me the exact co-ordinates..?\n\nTheo Hang up! Hang up now!\n\nJimbo hangs up the phone.\n\nTheo Lexington.. uhh...Massachusettes. Idiot. I told you not to \ncall them.\n\nEXT. MANHATTAN ISLAND - SUNRISE\n\nEstablishing. The sun rises over the Brooklyn Bridge.\n\nEXT. MANHATTEN - MADISON AVENUE - EARLY MORNING\n\nLITTLE GUY, still yawning, exits an apartment with a Jack Russell \nterrier on a  long RETRACTABLE LEASH. TERRIER'S POV as the little \ndog attacks the city,  looking for a place to relieve himself. \nThe Man stops in front of a \"Crazy  Eddie's\" T.V. store. Floor-\nto-ceiling T.V.'s in the window broadcasting  E.S.P.N.'s \"Morning \nExercise Show\" with hot women SWEATING.\n\nThe Jack Russell strains on the leash to a FIRE HYDRANT. A SHOE \nis next to the  hydrant, connected to a HUGE SAMOAN GUY watching \nthe pelvic thrusting on T.V.  The dog lifts his leg and pees, \nhitting both hydrant and shoe. The huge Samoan  guy kicks the \ndog. The dog YELPS.\n\nLittle Guy You kick my dog again and I'll go nuclear on you.\n\nThe T.V. images BLINK and STATIC. A massive SONIC BOOM emanates \ndirectly above.  The huge Samoan guy looks up as---\n\nA ROCK, the size of a basketball, strikes him and EXPLODES into \nthe pavement,  spewing sparks and concrete, throwing PEDESTRIANS \nto the sidewalk.\n\nINT. \"CRAZY EDDIE'S\" T.V. STORE\n\nFIFTY T.V.s are BLOWN across the showroom floor. SALESMEN and \nCUSTOMERS dive to  the floor, SCREAMING.\n\nEXT. MANHATTEN - \"CRAZY EDDIES\"\n\nLittle guy, lying on the sidewalk, recovers. His DOG LEASH runs \nfrom the leash  grip into a 10 FOOT CRATER in the sidewalk. The \nhuge Samoan guy's LEGS protrude. \n\n\n\nLittle Guy Samson?\n\nPedestrian Somebody call 9-1-1!\n\nINSIDE THE CRATER - THE JACK RUSSELL dangles by the leash. \nEmbedded in the hole  30 feet below is A SMOKING, RED HOT OBJECT. \n\nINT - N.O.R.A.D. - CHEYENNE MOUNTAIN\n\nThe U.S.'s Early Warning Air Defence. Two U.S.A.F RADAR \nTECHNICIANS are hunched  over radar screens.\n\nRadar Tech 1 I got one, two, three boggies...the whole board's \nlighting up!\n\nThe RADAR TECH 2 hits a KLAXON, stabs phone line buttons.\n\nEXT. MANHATTEN - MORNING\n\nTraffic is ground to a halt. CAMERA MOVES into a cab. STU, the \nCabbie, with an  ASIAN TOURIST, who's craning his neck out the \nwindow.\n\nAsian Tourist What's the problem? Stu Could be a couple of \nthings: shootin',  stabbin', dead guy \n(shrugs)\n Well, it's Friday, payday. Could be a jumper.\n\nA projectile the size of a dump truck SCREAMS through the sky and \nblasts through  three huge buildings.\n\nMore projectiles explode in the intersection. Cars get thrown \neverywhere. Stu's  cab slams upside down into JOHNNY'S BAR.\n\nONE BLOCK DOWN. THE ENTIRE TOP FIVE STORIES -- A sheared section \ntopples and  hits the street below. Bricks, mortar and gargoyles \neverywhere.\n\nEXT. WASHINGTON D.C. - PENTAGON - DAY\n\nEstablishing, over which we hear RINGING PHONES.\n\nEXT. PENTAGON - GENERAL TEMPLE'S OFFICE - DAY\n\nChaos in the corridors. GENERAL TEMPLE, Chairman of the Joint \nChiefs of Staff, a  man of stature, bursts out of his office, met \nby his SECRETARY.\n\nSecretary We're getting reports as far away as Greenland and \nparts of Mexico!\n\nTemple Get me Dan Goldman on the secure phone.\n\nTemple enters his office and picks up a secure phone.\n\nINT. MISSION CONTROL - INSIDE THE GLASS-ENCASED ROOM\n\nGolden enters the room and sits down. Technician Flip hands him a \nsecure phone.  Golden sinks into his chair. In the b.g., VIDEO \nMONITORS show twenty live feeds  from T.V. stations across the \ncountry.\n\nTemple \n(V.O.)\n Can you go secure?\n\nGolden \n(presses a button on the phone)\n I am secure. Go ahead, General.\n\nHe listens...WE HEAR the distinct gargled voice of a secure line.\n\nGolden When?\n\nTemple \n(V.O.)\n Twelve minutes ago. Now you know what happened to your shuttle.\n\nINTERCUT - GOLDEN / TEMPLE\n\nINT. PENTAGON - GENERAL TEMPLE'S OFFICE - DAY\n\nTemple paces in his office.\n\nTemple I'm going to brief the President. What's going on here, \nDan? Why didn't  we have warning?\n\nGolden Tell the president it's called \"budget cuts.\" We don't \nhave enough  telescopes to track the skies.\n\nTemple Is it over?\n\nGolden I don't know. We'll figure it out. \n(hangs up)\n\n\nINT. MISSION CONTROL - INSIDE THE GLASS-ENCASED ROOM\n\nFlip enters the room. Skip writes notes....\n\nGolden \n(to Skip and Flip)\n Fly a team up to New York. Contact every Space Watch  facility \nin the world. We gotta find what part of the sky this is coming \nfrom.\n\nSkip I'll call J.P.L. and get the Hubble telescope on it.\n\nGolden Did we find who made the phone call last night?\n\nFlip The F.B.I.'s on it.\n\nINT. KENTUCKY - DORMITORY ROOM\n\nTheo is sleeping. The door is RAMMED in. Two F.B.I. AGENTS ROAR \ninto the room,  overwhelming him.\n\nEXT. KENTUCKY - COLLEGE CAMPUS\n\nPearl and Jimbo are walking across campus. TWO BLACK SEDANS pull \nup. The kids  increase their pace.The sedans SKID to a stop. \nF.B.I. AGENTS spring from the  cars, cuff them and CUT TO\n\nMANHATTEN - JOHNNY'S - DAY\n\nStu's upside down cab, in front of Johnny's. A tow truck removes \ndented cars  from the trashed intersection. Career drunks, FRANK, \nFRED and WILLIE, stand in  the threshold looking out at the \ndevastated intersection. Stu sits on top of his  cab, Listening \nto the guys\n\nFrank This city sucks...\n\nFred What the hell was it?\n\nWillie They're sayin' it's space rocks.\n\nStu Rocks from space, my ass. That, my friends, was the work of \nthe big  Saddam. That was big-ass Iraqi missiles\n\nINT. MANHATTAN - SUBWAY - DAY\n\nF.B.I. AGENTS and N.A.S.A. SCIENTISTS examine a CHUNK OF \nASTEROID, still  smouldering, which has ripped through the roof \nand floor of a subway car. The  plastic seats and aluminium \npanelling of the car has melted.\n\nEXT. KENTUCKY - INTERROGATION ROOM - AFTERNOON\n\nJimbo, Theo and Pearl sit in front of three F.B.I. AGENTS. Two \nN.A.S.A.  ASTRONOMERS look over the kids' TELESCOPE PHOTOS with \nconcern.\n\nJimbo So, that N.A.S.A. guy wasn't kiddin; about bein' arrested \nand....\n\nFederal Agent Please shut up.\n\nJimbo Yes, absolutely, yes sir.\n\nN.A.S.A. Astronomer I'm a N.A.S.A. astronomer. When were these \nphotos taken?\n\nFederal Agent And which of you called N.A.S.A. Mission Control \nlast night?\n\nJimbo \n(points at Theo)\n Him.\n\nTheo \n(points at Jimbo)\n Him.\n\nJimbo I was calling the Houston area code, which is 713. I was \ncalling 712,  which is outside Spokane, Washington, where my Aunt \nZelda....\n\nN.A.S.A. Astronomer Tell us the exact ascension angle of your \ntelescope when  this was taken.\n\nTheo It's our discovery. No way.\n\nN.A.S.A. Astronomer Your \"discovery\" killed close to 100 people \nin New York  alone - people who could've used a warning.\n\nJimbo, Theo and Pearl lower their eyes.\n\nJimbo Our math must've been off! we thought it was gonna pass the \nEarth!\n\nPearl Ascension 712, retention 345.\n\nF.B.I. Agent 2 And you've told no one about this- not your \nteachers, not your  friends?\n\nN.A.S.A. Astronomer \n(into cellular phone)\n J.P.L., please. Search  co-ordinates...\n\nINT. PASADENA CALIFORNIA - J.P.L. - NIGHT\n\nN.A.S.A.'s Jet Propulsion Laboratory home of the HUBBLE SPACE \nTELESCOPE. Two  J.P.L. TECHNICIANS man the Hubble's control \nconsole. \n\nJ.P.L. Technician 1 New info! Plot co-ordinates 712 by 345. Let's \nmove on  high-resolution imaging. J.P.L. TECHNICIAN 2 punches the \nco-ordinates into a control console.\n\nEXT. OUTER SPACE - CONTINUOUS \n(DAY)\n\n\nThe HUBBLE SPACE TELESCOPE floats by in geosynchronous orbit. The \ntelescope  tilts, repositioning in view.\n\nINT. PASADENA CALIFORNIA - J.P.L. - NIGHT\n\nImages from the Hubble arrive on a high resolution printer. \nJ.P.L. Technician 1  grabs four PHOTOS from the printer. \nTechnician 2 swipes stuff off the console,  making room. Together \nthey arrange the four photos. They star silently at the  awesome \nCOMPOSITE PHOTO.\n\nJ.P.L. Technician 1 Motherfu......\n\nINT. N.A.S.A. - MISSION CONTROL - ENCLOSED ROOM - NIGHT\n\nGolden and all his TECHNICIANS crowd around a console, staring at \na smaller  version of the COMPOSITE PHOTO.\n\nGolden Copies to the Pentagon, Colorado Space Command, and the \nWashington  office. We gotta compute size, composition, speed, \nimpact point\n\nWE SEE the photo -- A HUGE ASTEROID\n\nEXT. OUTER SPACE - CONTINUOUS - DAY\n\nCAMERA PUSHES THROUGH A CLOUD OF ROCKY, ICY DEBEIS, penetrating \nthe cloud until  the HUGE ASTEROID CORE comes into clear view -- \na mass of dirt and ice -- rough,  craggy, menacing. INT. N.A.S.A. \n- BRIEFING ROOM - NIGHT\n\nGolden and Clark enter. A group of ten N.A.S.A. SENIOR \nTECHNICIANS are all  talking at once.\n\nGolden Okay guys, one of the worst days in N.A..S.A history just \ngot worse.  Ten million to one. A rogue comet came from deep \nspace and collided with an  asteroid. Some  kids actually got a \npicture of the collision event and told no one.  The stuff that \nhit this morning was the collision's forward-thrown matter, mere  \npebbles from what's  about to come. Walter? \n\nClark A big asteroid. E.T.A., eighteen days. A lot bigger than \nthe five mile  one that obliterated the dinosaurs.\n\nSilence. Everybody stares at each other.\n\nThe phone CHIRPS.\n\nGolden's Secretary Director, the Pentagon.\n\nGolden hits a button.\n\nA LARGE T.V. SCREEN establishes AUDIO/VISUAL link.\n\nINTERCUT; PENTAGON - SITUATION ROOM/ N.A.S.A. - BRIEFING ROOM\n\nINT. PENTAGON - SITUATION ROOM - NIGHT\n\nTemple sits with the Joint Chiefs, White House Chief of Staff, \nthe Directors of  the N.A.S.A., C.I.A., etc.\n\nTemple Dan, we're all here. Tell us what we're up against. \n\nGolden \n(V.O.)\n In it's simplest terms? The end of Mankind. One asteroid, one  \nmile wide or bigger, impacts the Earth with the equivalent force \nof all the  nuclear weapons in the  world, times a thousand. Half \nour population will die within 24  hours from tidal waves and \nheat pulses. The other half won't be so lucky. In the  end, it \nwill be men  eating the flesh of other men. \n(beat)\n It's not the end of the  world, General, the world - Earth - \nwill still be here. But there will be no  life - maybe \ncockroaches and  some resilient strands of bacteria. \n\nTemple Well, that's really positive, Dan. The President just got \noff the phone  with the Russians. They're just about to launch a \nnew Mars Probe on the biggest  rocket in the world.  Golden and \nthe N.A.S.A. BRASS exchange sceptical looks.\n\nGolden \n(V.O)\n With the worst guidance system in the world. Their Mars Probe in  \n'96 was found by a pygmy tribe in Africa. \n\nTemple They're going to pull off the probe and replace it with \nfour Atlas  Class IV nuclear warheads. Enough punch in their \nopinion - not to break it up -  but to slow it down enough to \nmiss Earth's orbit. \n\nGolden \n(V.O)\n Their launch date is set for next month.\n\nTemple They're going to move it up.\n\nGolden \n(V.O)\n To when?\n\nTemple Sixteen hours from now.\n\nAll the N.A.S.A. Technicians CLAMOR at once.\n\nGolden \n(V.O)\n What are they gonna do, glue, spit, and scotch tape it together?  \nEven if they get a nuke out to the asteroid, a surface nuclear \ndetonation is not  going to work.  The only way is to split the \nthing in half and hope the two pieces  slide past us. \n\nTemple Thank you for bringing up the impossible, Dan.\n\nColinswood People, the President's joining us, Mr. President?\n\nPresident \n(V.O)\n Well, this has been a tough day. The media's all over this.  \nThey're going to get nothing. Telling the public we might all be \ndead in  eighteen days achieves nothing but panic. \n\nGolden \n(V.O)\n Mr President, finding this speck in the sky is a very hard thing  \nto do unless you have the exact co-ordinates. There are only \ntwelve telescopes  powerful enough  to see it right now. You've \ngot a full moon goin' for four days -  makes it all but \nimpossible to see.. Once these things draw closer to Earth,  \nyou'll never keep a lid on  this. No way. \n\nINT. N.A.S.A. BRIEFING ROOM - NIGHT\n\nThe video screen blinks off. Golden looks at his Techs.\n\nGolden How many of you are as scared as I am?\n\nGolden raises his hand. All the other N.A.S.A. Techs, one by one, \nraise their  hands.\n\nGolden One giant leap for Mankind. Everyone remember that? This \nis what we are  going to do. We're going to fly to that asteroid \nwith a nuclear device, implant  it and get off  before it blows. \nQuincy? \n\nAll eyes turn to N.A.S.A. Chief of R&D, RONALD QUINCY. Quincy has \ncoke bottle  glasses and a 198 I.Q.\n\nQuincy Look: set a fire cracker off in your open palm, you get a \nthird degree  burn. Close your fist, It'll do some serious \ndamage. If we can get a nuke deep  in one of the asteroid's fault \nlines, she'll split in two, like a diamond. \n\nGolden You're all looking art us like we're crazy. We're not.\n\nSkip Dan, our currant shuttle fleet is too old and too slow.\n\nGolden What I'm going to tell you is a breach of national \nsecurity and could  land me in jail, but in eighteen days there \narnt' gonna be any jails,  so....We're not gonna use a  current \nshuttle. Gentlemen, I'm talking about the X-71. \n\nSkip It's done?\n\nQuincy Has been for three months.\n\nEXT. ARIZONA DESERT - FLIGHT TESTING FACILITY - DAY\n\nN.A.S.A.'s flight testing facility. A flat, hard, dry area \ndominated by an  ENORMOUS HANGER. The HANGER DOOR is open; breeze \nblows back a BLACK SILK  TARPAULIN, revealing the X-71's NOSE. \nTechnicians come and go. \n\nINT. N.A.S.A - BRIEFING ROOM - DAY\n\nGolden Time is our enemy. This is like the race to the Moon, guys \n- what this  Agency was founded on.\n\nSkip Boss, we're good at space travel, but you're talkin' about \ndrilling a  hole.\n\nGolden Quincy's been working on excavating the ice from the Moon \n- he's gonna  reorient his thinking. Right, Quince?\n\nQuincy Right. And the first thing I'm gonna do is talk to the guy \nI ripped  off. His name is Harry S. Stamper. He's the best oil \ndriller in the world. \n\nGolden I don't care who he is, what he's doing.\n\nEXT. NORWAY COAST - NORTH SEA - \"TROLL\" OIL RIG - DAY\n\nSUPER -  DAY TWO\n\nClose on a GOLF BALL. THWACK! The golf ball EXPLODES off the tee \nfrom an oil  rig. The \"TROLL\" is the largest man-made structure \nin the world - 12 aircraft  carriers big and 1200 feet tall. A \nself-contained city. \n\nHARRY STAMPER, world's foremost expert on offshore deep drilling, \nimmaculately  attired in golf attire and spikes, stands on a \npatch of Astroturf with a five  iron in his hand. Piped-in MOZART \ndrown out the rig noise. \n\nEXT. \"TROLL\" - DRILLING PLATFORM - \"A\" DERRICK - DAY \n\nThe main drilling platform. On \"A\" derrick, Chief Driller, A.J. \nFROST, 30,  handsome, is at the controls. Roughnecks \"JIMBO\" \nCARTWRIGHT, \"BEAR\" BROWN,  \"CHICK\" CHAPPLE, TITO GUEVARA, and MAX \nLOGAN, handle 20 foot sections of PIPE  DRILLING SRTRING with a \nHYDRAULIC TONG AND CLAMP. \n\nRoughneck BENNIE MORGAN, late 20's an ox of a man, comes across \nthe platform,  pulling an oily green coveralls and donning his \nhard-hat. Bennie examines the  rig's DOWNHOLE PRESSURE GAUGE. \n\nBennie Chick! take a look at this!\n\nChick Pressure's been up all morning. She kicked twice on me.\n\nA.J.'s eyes move to a TALL BLOND MAN on his lunch break across \nthe rig.\n\nA.J. What did our always-at-lunch-Swedish geologist say?\n\nBennie Jah, jah, jah. No bleeper. Too much pressure.\n\nChick You askin' the old man?\n\nA.J. nods and walks off.\n\nEXT. \"TROLL\" RIG - TOP TIER\n\nHarry HITS another ball. WE REVEAL his target, a GREENPEACE BOAT \nanchored off  the rig. The BALL strikes the side of the boat, \njust missing the head of ONE of  the PROTESTERS.\n\nHarry Almost caught that little bastard.\n\nHe admires his shot as his daughter, GRACE, walks up. Grace is \nlate 20's,  business dress, Harvard Law.\n\nGrace Having fun?\n\nHarry HITS another ball. It misses the boat, skips across the \nwater.\n\nGrace Sure sliced the shit outta that one. \n(frowns)\n\n\nHarry Watch your language, Gracie.\n\nGrace Seagulls swallow those and they die.\n\nHarry Stupid birds.\n\nHarry's EYES move to a GROUP OF GREENPEACE PROTESTERS across the \nrig, being held  back by Stamper Oil SECURITY GUARDS. \n\nGrace I just talked with A.J.\n\nHarry Talking to him quite a bit these days....\n\nGrace \n(awkward pause)\n \"A\" rig's acting up. The drill string kicked twice this  \nmorning, gave Chick a nasty bruise in the head.\n\nHarry Good. He's not vulnerable there.\n\nGrace Chase Manhatten okayed the bridge financing for the \nMicronesia Project,  but at 21 percent interest. And Lloyd's of \nLondon refuses to underwrite the  Venezuela> Project....  \n\nHarry Thieves and cowards, all of 'em. Twist their arms.\n\nGrace I am.\n\nHarry Keep twisting. Like a pit bull.\n\nGrace Oh, and that magazine article - they want some human \ninterest stuff -  likes and dislikes. \"Likes\" I said Golf, Fly \nFishing, Single Malt Scotch, Old  Movies. What about  \"Dislikes?\"\n\nHarry Any kind of flying and oil company executives. Go deal with \n'em. I  always look better when you're doing the talking.\n\nHarry HITS another ball. CLANG.\n\nGrace You know you donate 300 grand a year to Greenpeace.\n\nHarry smiles at the contradiction.\n\nHarry What'd your mother call me?\n\nGrace Complicated.\n\nHarry Yeah well....I'm complicated.\n\nGrace walks off, passing A.J., winking at him. A.J. winks back.\n\nA.J. What's his mood?\n\nGrace Complicated.\n\nA.J. walks up to Harry.\n\nHarry I understand we're having problems with \"A\" rig.\n\nA.J. I'm on top of it \n(Harry picks up his bag)\n Harry, you have a second?\n\nHarry Yeah. One.\n\nA.J. I'll hurry. I've worked for you for a long time.\n\nHarry Twelve years.\n\nA.J. And you've been real good to me....\n\nHarry Another company make you an offer, kid?\n\nA.J. No. The reason I am here, today, standing here, talking to \nyou. I'm  obviously talking to you...but it's, you know, not, \nuhh...it's not an  oil-related matter exactly....\n\nHarry You're sweating, A.J.\n\nA.J. You know there comes a time in a man's life when...\n(to himself)\n No,  that's a cliché...\n(to Harry)\n Can I start again? I, uhh, fell...I've fallen...\n\nHarry You hurt yourself?\n\nA.J. In love, I mean. Fallen in love. It's the damnedest thing, \nbut this  person you...know...really well.\n\nACROSS THE PLATFORM - Grace escorts five angry OIL INDUSTRY \nEXECUTIVES over to  Harry. A KLAXON SOUNDS. Harry, alarmed, \nrushes right past them, toward the \"A\"  Derrick. They follow, \nsnapping at his heels\n\nOil Executive 1 You explicitly promised results at 25 thousand \nfeet.\n\nHarry We have results.\n\nOil Executive 2 But we don't have oil. We've given you everything \nyou've  asked....\n\nHarry Horseshit. What the...? Chick! Bennie! Somebody better tell \nme why the  hell \"A\" derrick is not turning!\n\nChick hurries up to Harry.\n\nChick The uhh....the Greenpeace guys.\n\nHarry approaches \"A\" Derrick. Five MEMBERS of Greenpeace have \nhandcuffed  themselves in a circle around the drilling pipe.\n\nHarry Hey there, what can I do for you?\n\nGreenpeace Leader This is an official protest.\n\nHarry 'Course it is. I love you guys. You like dolphins and \nwhales, I like 'em  too. Hey, I know you. You too. Didn't you \nhave shorter hair?\n\nGreenpeace Leader Stamper, do you know what this thing does to \nthe eco-system?\n\nHarry How'd you get out here? Canoe? Rowboat? Oh, that boat down \nthere with a  thousand horsepower diesel!\n\nGreenpeace Leader How can you wake up every day and look at \nyourself in the  mirror?\n\nHarry The same way you did when you blow-dried your hair this \nmorning. And you  used a curling iron, I betcha. Did you know \nmost electricity's from burning oil?  I'' stop drillin' when the \nworld - stops usin' it. Bennie, start 'er up! \n\nGreenpeace Leader Wait........\n\nHarry Can't wait! I'm a businessman! Those goons over there gave \nme 57 mil. to  find oil and they ain't leavin' till I do! 'cause \nthey have no lives! \n\nThe drill string begins to turn in the hole.\n\nGreenpeace Leader We....we threw away the key.\n\nHarry Sorry. Time is money. BENNIE!\n\nThe MASSIVE HYDRAULIC KELLY begins to descend on the Greenpeace \nActivists'  heads.\n\nGreenpeace Leader STOP!!!!\n\nHarry Bennie! Third gear!\n\nThe Greenpeace Leader miraculously produces a key and frantically \nbegins  unlocking the handcuffs.\n\nGrace turns to the oil executives.\n\nGrace He's good at public relations.\n\nA.J. approaches Grace; they watch Harry.\n\nGrace So? \n(A.J. stares at her)\n What? \n(no response)\n What? \n(no response)\n A.J.?\n\nSuddenly, across \"A\" Derrick, a KLAXON SOUNDS.\n\nChick She's kickin'!\n\nThe civilians get the hell away.\n\nHarry and A.J. run toward the rig.\n\nChick Pressure's north of seven thousand!\n\nA.J. We gotta clear the Derrick!\n\nHarry \n(looks at wellhead)\n Chick, rig up another pipe. \n(Chick and Bennie look  at Harry with uncertainty)\n NOW, NOT TOMORROW. \n\nCHick and Bennie begin clamping, and tong a PIPE STRAND onto the \nDRILL STRING  like an INDY PIT STOP CREW.\n\nA.J. Harry, we've hit pressure. We gotta bleed it off. e go any \ndeeper, we'll  blow the rig.\n\nHarry Thanks for that opinion. Chick, full speed!\n\nA.J. The bit's five thousand feet down! Full speed'll rip the \npipe apart!\n\nHarry You learn all this in college? I been doing this thirty \nyears, kid. Get  on the controls.\n\nA.J. moves reluctantly to the DRILLING CONTROLS. Chick nods to \nA.J., who engages  the gears. The PIPE STRING turns at FULL \nSPEED. The new drill pipe descends ten  feet into the hole, \nthen....\n\nThe torque rips the NEWLY ATTACHED PIPE from the drilling string. \nThe drill  spins freely.\n\nA.J. hits the \"stop! lever and stares at Harry.\n\nThe roughnecks converge around the wellhead.\n\nA.J. I'm goin' down. Reattach it. Gimme a wrench and a band \ncoupling.\n\nChick hand the items to A.J.\n\nA.J. descends into the drilling hole.\n\nINT. DOWN THE DRILLING HOLE - DAY\n\nA.J., holding his breath under water, shimmies down the drilling \npipe  feet-first, inside the water-filled concrete tube running \nfrom the rig to the  ocean floor. \n\nA.J. begins wrestling the disconnected sections together. EXT. \nRIG - \"A\" DERRICK\n\nThe wellhead KICKS. The rig platform shakes and shudders. \nSEAWATER erupts from  the wellhead.\n\nChick The drill hole's flooding!\n\nGrace A.J.!!\n\nHarry strips off his jacket and climbs into the wellhead. He \ntakes a huge breath  and disappears into the brine-filled \ndrilling hole. \n\nINT. DRILLING HOLE\n\nA.J. is pinned against the hole wall by one of the disconnected \npipes. Harry  comes down the hole. He plants his back against the \nhole wall and kicks the  pipe, freeing A.J. A slow, deep, RUMBLE \nemanates from below. The Briny water  inside the hole suddenly \nturns BLACK and VISCOUS. \n\nA.J. and Harry exchange an alarmed look. Harry, then A.J., pull \nfor the surface,  up the drilling hole as -- \n\nEXT. DRILLING PLATFORM - \"A\" DERRICK - DAY\n\n-- the wellhead KICKS again. The rig platform SHUDDERS violently. \nThe derrick  sways. SEAWATER SPEWS up from the wellhead. \n\nChick Get back, she's gonna blow!\n\nGrace, Chick, Bennie and the other Roughnecks huddle around the \nflooded drilling  hole, waiting. Tense, agonising seconds pass. \n\nHarry scrambles out, covered in....CRUDE OIL.\n\nHe grabs Grace and pulls her away.\n\nGrace Where's A.J.!!!?\n\nHarry RIGHT BEHIND ME! RUN!\n\nThe platform SHAKES. Harry, Grace, and the others sprint away as \n--\n\nA GEYSER OF CRUDE OIL erupts from the drilling hole, blowing A.J. \nout of the  hole fifteen feet above the wellhead. A.J. crashes to \nthe platform floor. \n\nCRUDE OIL rains down on Grace and the Roughnecks...they run to \nA.J.\n\nGrace Never do that again!\n\nCLOSE ON A.J. - he's looking back at the DRILL HOLE, panting, \ntraumatised,  greasy oil raining on his head.\n\nA.J. You know how I told you there were two obstacles? I didn't \ndo the  first,'cause he's tough...but I did the second...! \n(pulls out case; opens it)\n I  got it at uhm..Tiffany's. I can't give it to you until I talk \nto him, but try it on. \n\nShe reaches for the ring. It slips from A.J.'s hand and falls \nthrough the grated  floor, pinging off the rig's steel pylons, \n100 feet into the sea below. \n\nGrace Don't worry! Tiffany's insures up to a week from purchase!\n\nA.J. stares despondently over the railing.\n\nHarry, black with crude oil, staggers past A.J.\n\nA.J. \n(pointedly)\n Good plan, Harry.\n\nHarry \n(walks over to Oil Execs)\n There's your oil, gentlemen. Now get the hell  off my rig.\n\nINT. N.A.S.A. - MISSION CONTROL - DAY\n\nGolden, Clark, Skip, Flip and the rest of the Mission Control \nTechnicians watch  a live feed from Russia. A RUSSIAN ENERGIA \nSUPER BOOSTER ROCKET sits on its  launch platform. \n\nFlip Look it that sucker. They got a nuke up there in sixteen \nhours?\n\nSkip It'll never fly. Never.\n\nClark Three things the Russians make well, guys - vodka, gymnasts \nand rockets.  Don't count 'em out.\n\nGolden It's the late 20th century, I run the U.S. Space Program, \nand I'm  praying to God the Russians are better at this than we \nare.... \n\nEXT. RUSSIA SPACE CENTER - SMOLINSKAYA A.F. BASE - DAY\n\nThe ground begins to SHAKE uncontrollably. EXHAUST billows out \nfrom the Rocket's  BOOSTERS. The Russian rocket blasts off and \nlifts into.... \n\nSomething's wrong. The Rocket stops accelerating and stands still \nfor a moment.  It falls to Earth; BLOWING UP in a thunderous \ninferno. \n\nINT. N.A.S.A. - MISSION CONTROL - DAY\n\nGolden, Clark, and all the N.A.S.A. Techs stare at the burning \nrocket.\n\nGolden So, where's our oil driller?\n\nEXT. RIG - \"A\" DERRICK\n\nA champagne cork POPS and WIDEN TO Harry, Grace, A.J., and all \nfifty Roughnecks.  The wellhead's been capped; pumping 2500 \ngallons per minute. \n\nHarry To Hole Number Seventy-Six!\n\nRoughnecks \n(UNISON)\n Hole Number Seventy-Six!\n\nThe Oil Executives stand off, watching.\n\nOil Executive 1 Seventy-Six?\n\nOil Executive 2 This is Harry's Seventy-Sixth straight hit.\n\nOil Executive 1 The man's a legend.\n\nWe hear the WHOP, WHOP, WHOP of HELICOPTER BLADES. Harry, Grace \nand A.J. turn  toward the noise.\n\nTWO U.S. ARMY BLACKHAWK HELICOPTERS whirr across the choppy \nocean.\n\nEXT. OIL RIG - TOP TIER HELI-PAD - MINUTES LATER\n\nThe helicopters land on the heli-pad on the oil rig's top tier, \nMAJOR STINSON,  50's, wearing formal dress and sunglasses along \nwith two strapping ADJUTANTS  stride across the rig. \n\nMajor Stinson Harry Stamper? I'm Major William Stinson, United \nStates Army. I  need a few words with you. In private.\n\nHarry Say it now, say it quick, or get off my rig, Major. I've \ngot a business  to run here.\n\nMajor Stinson You've been summoned back to the States.\n\nHarry Who's doin' the summoning?\n\nMajor Stinson Your Government, Mr Stamper.\n\nINT. SOMEPLACE IN KENTUCKY - HOLDING CELL - NIGHT\n\nJimbo, Theo and Pearl sit in a holding cell some place. Jimbo's \nbanging on the  door.\n\nJimbo Hey, zipperheads! Ever watch \"L.A. Law?\" Right to remain \nsilent, right  to an attorney? My brother's a bad-ass lawyer - \nhe's gonna sue your asses to  Mars. I was in pre-  law for a \nmonth - you can't put somebody in jail for makin' a phone  \ncall!!! \n\nPearl It isn't about that, Jimbo. We saw something we weren't \nsupposed to.\n\nTheo Something they're not telling the public.\n\nJimbo Yeah, that's why they were so hot for the co-ordinates. Do \nyou think  it's an asteroid? Or comet?\n\nTheo I dunno - but I bet it's a whopper.\n\nINT. N.A.S.A. FLIGHT MISSION ROOM - DAY\n\nHarry, AJ. and Grace are led into the room by Stinson. Quincy's \neyes move to  Harry --\n\nQuincy He's here.\n\nQuincy, Clark and Golden stand, approach --\n\nQuincy \n(cont'd)\n Dan Golden, meet Mister Harry Stamper, the finest oil driller  \nin the world.\n\nGolden Mister Stamper..\n(shaking hands)\n Dan Golden, I'm Director of --\n\nHarry I know who you are. I watched T.V. once. Apollo 8, right? \nFirst manned  lunar orbit.\n\nGolden That was a long time ago. I run this place now. And we've \ngot a serious  problem on our hands that Quincy here thinks you \nmight be able to help us out  with -- \n\nQuincy eagerly outstretches his hand. They shake. Quincy doesn't \nlet go.\n\nQuincy I'm a big fan, Mr. Stamper.\n\nHarry I kinda caught that. \n(to Golden)\n What's the problem, gentlemen?\n\nGolden I wonder if we might speak alone?\n\nHarry These two are my right and left arms. Grace Stamper and \nAlbert Jack  Frost. Stupid name, so we call him A.J.. \n(handshakes)\n They run my company. You  talk to me, you  talk to them. \n\nGolden Okay.\n\nGolden direct everyone into --\n\nINT. N.A.S.A. - BRIEFING ROOM - DAY\n\nGolden, Temple, Clark, Harry, Grace, and A.J. sit in a dark room \nviewing a  VIDEOTAPE. Quincy stands beside the projector, \nsupplying narration. On the tape  we see Harry on a rig platform \nshaking hands with an ARAB BUSINESSMAN -- \n\nHarry Great, home movies.\n\nGrace and A.J. smile.\n\nQuincy Nineteen eighty five. The first well drilled over 50 \nthousand feet.  They said it couldn't be done. You did it. \nIncredible. \n\nON THE SCREEN - Harry's on another rig, shaking hands with an \nINDONESIAN  BUSINESSMAN. Harry leans over and kisses the bit. The \nBusinessmen shake their  heads, awed. \n\nQuincy \n(cont'd)\n Nineteen Ninety-One. Directional drilling through two miles of  \nanthracite. They also said that couldn't be done. You did it. \nIncredible. \n\nHarry looks at Quincy strangely; this sure is a bizarre form of \ncelebrity.\n\nQuincy \n(cont'd)\n Ninteen Ninety-Three. The first hole over seventy thousand.  \nOnce again they said --\n\nGolden Move it along, Quincy.\n\nQuincy Right, sorry. Mister Stamper, you're the world's foremost \nexpert in  deep drilling. You hold specialized patents in high \nspeed bits, drilling fluids,  downhole motors Can I call you \nHarry? \n\nHarry Stick with Stamper.\n\nGolden Well, Mister Stamper, we need you to drill a hole. It's in \na difficult  place.\n\nHarry I've drilled in them all.\n\nGolden Not...this place. This is really out there. \n(beat)\n Space, Mister  Stamper.\n\nHarry As in...outer?\n\nSATELLITE PHOTOS OF THE ASTEROID come up on the screen --\n\nTemple You've watched the news the last 24 hours? You heard about \nthe meteor  shower? \n(Harry nods)\n What you don't know is that an asteroid is on a collision  \ncourse with  Earth. If it hits us, Earth as we know it will be \nover. \n\nGolden We're manning a mission to that asteroid to plant a \nnuclear device in  it's core. To do that we need to drill an \neight hundred foot hole. \n\nHarry looks at A.J. and Grace.\n\nHarry A.J., is this guy shitting me?\n\nA.J. I don't think they shit people at N.A.S.A., Harry --\n\nHarry An eight hundred foot hole. On a moving asteroid. In space.\n\nGolden All we want is your advice in perfecting our drilling arm, \nany help you  can provide. We'll pay your usual consultancy, of \ncourse.  \n\nHarry Show me your rig.\n\nINT. N.A.S.A. - RESEARCH AND DEVELOPMENT - DAY\n\nQuincy leads Golden, Harry, A.J., Grace, and Clark through \nN.A.S.A.'s Research  and Development area. This place looks like \n\"Q's\" weapons shop from the James  Bond movies as funded by every \ncompany on the fortune 500 -- \n\nHuge, clinically clean, dominated by MASSIVE ROCKET ENGINES. \nTECHNICIANS in  white coats and hairnets work on a variety of \nequipment. \n\nTECHNICIANS hunch over a ROVER VEHICE, not the golf cart used on \nthe moon. This  is low, squat, sturdy, with an enclosed airlocked \npassenger compartment. \n\nQuincy The \"Armadillo\" - our fourth generation rover. It carries \na six-cell  solar engine with 824 horses. This was a joint \nventure with the Germans. \n(winks)\n  It's designed by Porsche. \n\nQuincy motions to TWO TECHNICIANS. They roll over a ROBOTIC ARM \non a gurney,  powered by an ELECTRIC MOTOR. The robotic arm is \nconnected to an OIL DRILLING  BIT. \n\nHarry Where's the Kelly?\n\nQuincy This baby works without one.\n\nHarry How does it work?\n\nHarry starts to inspect the bit.\n\nQuincy It works through a series of complexly designed \ndifferential gears.\n\nHarry's face tightens, as he studies the bit further --\n\nHarry This is my Patent.\n\nQuincy \"Drilling Power Transfer Without Conventional Hydraulics,\" \nby Harry S.  Stamper. You registered it with the U.S. Patent \nOffice last year. \n\nHarry You stole it.\n\nQuincy We just borrowed it, Mister Stamper.\n\nQuincy unpockets a remote control panel and presses a button. The \ndrill bit  presses down into a block of concrete and begins to \nrapidly CHEW through it, as  Harry marvels at the realisation of \nhis design.\n\nQuincy \n(cont'd)\n We built this arm to mine ice from the moon -- greatest  \ndiscovery in space in thirty years.\n\nHarry What'd this cost?\n\nGolden Ten million.\n\nQuincy Twenty-our million.\n\nHarry Boy, I'm in the wrong line of work. So, that's where my \ntaxes go. For  thievin' incompetent, government employed rip-off \nartists?\n\nA.J. No torque adjustment, no pressure release valve....a big \nhunk of junk.\n\nQuincy We're working on that.\n\nHarry What happens if you hit gas? You have three seconds. Drill \nfaster, run  like hell, or pray. \n(beat)\n Time's up. You're dead., The rig just blew. \n\nGolden Gentlemen, gentlemen, wait a second. The crux of the \nmatter....\n\nHarry Hang on. I betcha everyone in this room has a PH.D.\n\nGolden Or three....\n\nHarry I left school after tenth grade. I earned my PH.D every day \noffshore  drilling holes. You can't get it in a book. Drilling \nholes is about instinct -  about smellin' it. Drillin' holes is \nan art. You want the crux of the matter?\n(beat)\n You stole my  patent, and you don't have a goddamn idea how to \nuse it. As for this piece o'  crap, don't insult me. \n(walks around the rig)\n I'll rebuild it - the right way - and drill the  hole for you. \n\nGrace Uhm, pop, could we discuss this...?\n\nHarry Just give me a space suit.\n\nGolden You won't need one. You're not going up.\n\nHarry You don't have a choice. I think all you PH.D's know that.\n\nHarry walks off. Grace and A.J. follow.\n\nGolden \n(calling after Harry)\n Harry. Let's figure this out.\n\nINT. N.A.S.A. - CONFERENCE ROOM - DAY\n\nHarry sits opposite Golden and Temple. Grace and A.J. stand \nbehind him.\n\nHarry First of all, you're going to buy my patent.\n\nTemple Of course, completely in order. What is the price?\n\nHarry Fifty million dollars.\n\nUncomfortable pause. Temple clears his throat.\n\nTemple Mr. Stamper, this mission is to preserve the future of....\n\nHarry You're right, too low. I'm still pissed. Seventy million.\n\nTemple Done.\n\nHarry looks to Grace.\n\nHarry Give that money to my Greenpeace buddies. \n(smile)\n Told  you...complicated.\n\nHarry goes to shake, pulls back --\n\nHarry \n(cont'd)\n And I never want to pay taxes again.\n\nTemple I'll call the I.R.S., try to uhm, explain the situation.\n\nThey begin to shake. Harry withdraws his hand.\n\nHarry I have this great log cabin in Montana. It's kind of a  \nnature...getaway...thing.\n\nTemple You want us to buy that, too?\n\nHarry No. I fly fish there. But the fly fishin's sucked ever \nsince they put in  that goddamn hydro-electric dam. I want it \ngone by the time I get back. \n\nTemple reluctantly nods. They stand to shake, Harry pulls away \nagain.\n\nHarry \n(cont'd)\n Now about my crew.\n\nGolden The deal was for you, not others.\n\nHarry I'm only as good as the men I work with. The ones in those \nhome movies  of yours.\n\nGolden It's out of the question.\n\nHarry half-smiles to Grace.\n\nGolden \n(cont'd)\n Okay, who?\n\nHarry :My chief tool pusher. You game A.J.? A.J. Wouldn't miss \nit, Harry.\n\nHarry And my roughnecks, Roustabouts, and Rockhound?\n\nTemple Rock what? Is that a dog?\n\nHarry No. Just a meek, geek geophysicist.\n\nGolden What kind of men are these?\n\nINT. SUPERSTRETCH LIMOUSINE - DAY\n\nBennie, Chick \n(30's, a street philosopher)\n, Max \n(35, hulky)\n, TITO, and ROCKHOUND  \n(small, wiry)\n are riding in high style. Chick is hanging out of the sun roof  \nwith his shirt off. Radio's on full blast. Rockhound's pouring \nwhiskey from the  fancy decanters. \n\nChick We're living LARGE!\n\nBennie \n(talking on a cellular phone)\n Give me nickels on Miami, Washington, San  Diego, and Green Bay. \n(listens)\n Quit whining. Last thing I need is to be friends  with my \nbookie. \n(listens, then angry)\n \n(MORE)\n \n\nBennie \n(cont'd)\n Look, when the entire Mexican Army had Butch and the Sundance  \nKid trapped in that Hacienda, did they wait to die? Hell no. They \nwent out guns  blazing. I live  by the code of that movie, man. \n\nBennie hangs up the phone, he looks across from him at -- Tito \nGuevara, late  30's, stocky, tattooed, Latino, \n(reformed 118th Street L.A. o.g. gangbanger who  was rescued from \nthe streets ten years back and put to work on a rig by Harry)\n  is reading a book \"Men are from Mars, Women are from Venus.\" \n\nChick drops down into his seat, continues his heated discussion \nwith Max.\n\nChick Charlie Bronson could kick Steve McQueen's ass and have \nenough left over  to duke it out with Burt Reynolds in his \n\"Smokey and the Bandit\" period. \n\nMax I'm glad you qualified that shit 'cause you know the Burt \nReynolds of  \"Deliverence\" would have kicked Charlie's ass.  \n\nChick Burt was trouble in that flick.\n\nMax What would you say the all-time, slam-bam, take-no-prisoners, \nkick-ass  Charlie Bronson movie is?\n\nChick All time? Well, let me think. \"Dirty Dozen,\" the first \n\"Death Wish.\" No,  no! That movie where he hunted the buffalo. I \ndon't remember the name but he  hunted a buffalo and he said like \nthree words during the whole picture. That's my  selection. \n\nMax Fine. The buffalo movie. That's your pick. You relly think \nthat buffalo  Charlie could have thrown-down with the Steve \nMcQueen form \"Bullitt?\" \n\nChick He'da whooped his ass and then his father's. We'll settle \nthis right  now. Rockhound? You heard the debate. You're the \nSupreme Court. What's the final  verdict? \n\nRockhound Tough call. But for me though, one name -- Poncherello. \nEric  Estrada. You know, \"Chips.\"\n\nChick and Max just look at him. A beat. Then --\n\nMax What did you ask him for? Guy makes his living looking at \nrocks.\n\nThe limo pulls over and stops. The DRIVER gets out and walks to \nthe rear door.  Opens it.\n\nEXT. N.A.S.A. - FRONT OF FACILITY - DAY\n\nThe Roughnecks get out in front of the JOHNSON SPACE CENTER. They \nstare up at  the familiar N.A.S.A. LOGO imprinted on the \nbuilding. Chick and Bennie exchange  looks -- \n\nBEHIND THEM\n\nA battered Ford pick-up pulls up, driven by 71 year-old \"MAMA\" \nMABEL BROWN.  Mabel's six foot-five, 375 pound son, BEAR, gets \nout of the car. \n\nBear 'Bye, Mama.\n\nMabel Reginald, get over here and kiss your Mama goodbye.\n\nBear In front of the guys?\n\nMabel Never too old to kiss your Mama.\n\nJIMBO, six-foot five, 375 pounds, bald, pulls up on a HARLEY \nDAVIDSON  motorcycle. He climbs off the bike.\n\nChick There ain't no oil in this place. What the hell are we \ndoing here?\n\nINT. JOHNSON SPACE CENTER - MEDICAL WING - DAY\n\nHarry has just briefed his crew on the mission.\n\nBear ARE YOU OUT OF YOUR MIND?\n\nChick Harry, this is some \"Star Wars\" shit. This ain't for us.\n\nHarry It's a job, like any other. Just a different location.\n\nMax We work rigs. We understand rigs. We don't know dick about \nbeing  astronauts.\n\nRockhound \n(pointing)\n I might add that to get us up there they're going to have  to \nstrap our asses on one of those rockets. That means fire, \ninvoluntary shit  release, and a slew of other stuff I can't hang \nwith. \n\nJIMBO We don't have \"The Right Stuff,\" know what I'm saying? \n(looking around)\n  We're Roughnecks. \n\nHarry I'd rather die up there fighting this thing than sit  here \nwaiting for it. \n\nHarry's line hangs in the air. Everyone exchanges looks.\n\nBear I don't like the idea of waiting around to croak. It's \nwimpy.\n\nChick If Harry-the-iron-ass is going, I'm going with him.\n\nBear Hell, I'm going just so I can say I went. \n(shrugs)\n Once we get up there,  it's making hole.\n\nTito I'm in.\n\nINT. JOHNSON SPACE CENTER - EXAMINATION ROOM - DAY\n\nMax, Chick, and Tito sit in HOSPITAL SMOCKS on two examination \ntables. They have  tattoos, long hair. A cigarette dangles from \nTito's lips. AIR FORCE NURSES are  everywhere. A NURSE clips a \nSWATCH OF HAIR from each of the men. She comes to  Tito. He grabs \nher arm. Takes the scissors from her. \n\nTito Nobody touches my hair but me.\n\nHe cuts a SWATCH of hair, gives it to her. A SECOND NURSE is in \nfront of Max and  Tito.\n\nMax You're not taking any more blood. You vampires already have \nenough to feed  your coven for a year.\n\nNurse \n(nasally-voiced)\n We need to know what substances you've recently  ingested.\n\nTito What, uhh, \"substances\" you talkin' about?\n\nNurse \n(matter of fact)\n Drugs.\n\nMa and Tito eye each other nervously. Head Nurse, HELGA, stands \nbefore Chick  with an ENAMA PROBE and a JAR OF VASELINE. \n\nChick An Ena-WHAT?\n\nHelga Enema.\n\nChick And you want to stick it where?\n\nHelga sticks the ENEMA PROBE in a jar of VASELINE.\n\nChick \n(cont'd)\n No way, lady. I came here to drill.\n\nHelga So did I.\n\nINT. JOHNSON SPACE CENTER - PSYCHOLOGICAL TESTING CENTER - DAY\n\nChick sits before a hugely endowed but square female N.A.S.A. \nCLINICAL  PSYCHOLOGIST.\n\nPsychologist Say the first two words that come to mind, beginning \nwith each  letter.\n\nChick Bodacious and....Bountiful. \n(she holds up \"S\")\n Succulent and Sinful.\n\nShe holds up the letter \"F\" and HOLD ON CHICK'S REACTION.\n\nINT. JOHNSON SPACE CENTER - EXAMINATION ROOM - DAY\n\nHarry sits before the Chief Physician, DR. BANKS. Golden looks \nout the window.  Dr. Banks, dead-serious, flips through the \nmedical and psychiatric test scores. \n\nDr Banks Mr. Stamper, your men...are...take Mr. Chappel. I \nbelieve they call  him Chic.\n\nHarry Charles, but if you call him that, he'll kill you.\n\nDr Banks \n(nervous laugh)\n I assume you're joking. \n(no response)\n Your men show  aggression, extreme maladjustment to their \nsurroundings, anti-social behaviour  -- \n\nHarry With all due respect, Doctor, I don't know too army guys \nwho are social  when someone is trying to jam a tube up their \nbutt. \n\nDr Banks Does your company have a drug testing program? These \ntoxicology  reports are a throwback to the sixties. All show huge \nlevels of nicotine and  alcohol. Three of the, four show illegal \ndrugs. A couple I had to look up. One of them  had \"Kematine\" -- \na very potent sedative. \n\nHarry A lot of people take sedatives.\n\nDr Banks This one is used on horses.\n\nHarry I don't tell my men how to live their lives. They're with \nme to do a job  and they do it well.\n\nGolden This is getting us nowhere. Can they fly, or not?\n\nDr Banks \n(flipping through physical records)\n Failed. Failed. Really failed.  Under the circumstances...\n(locks eyes with Golden)\n They're the finest physical  specimens I've ever seen. \n\nINT. N.A.S.A. - LONGSHOT\n\nHarry's crew walk together in newly issued N.A.S.A. jumpsuits. \nBear and JIMBO  have ripped the sleeves and collars off their X-\nLarge suits. \n\nThey walk past two N.A.S.A. mathematicians.\n\nMathematician 1 \n(to mathematician 2)\n We're screwd.\n\nPULL BACK TO REVEAL\n\nTemple and Golden standing there with their arms crossed, \nwatching the motley  crew of Roughnecks. They're joined by \nU.S.A.F. test pilots COLONEL SHARP, a  young Chuck Yeager type, \nand LT. COLONEL LUCAS TRUMAN, 30's, rigid and muscular. \n\n\n\nSharp I mean, they kind of look like Armstarong, Lovell, and \nGlenn. \n(turns,  soberly to Golden)\n So, my wife and little girls' lives are in their hands, sir? \n\nGolden We need to drill. Do you know how to drill, colonel? \n(beat)\n Neither do  I. They're going up.\n\nTemple \n(pointing to his lapel)\n With my stars came the power to be blunt. These  drillers are \nnot trained for this, Dan.\n\nTruman shakes his head. Sharp eyes Golden, waiting for a \nresponse.\n\nGolden General, it's our job to get them ready to go into space. \nThey're there  to do the drilling. \n(beat, then)\n And Colonel Sharp, we all have families. \n\nA hard look from Sharp to Temple, as Golden walks away.\n\nTemple \n(to Golden)\n If they can't drill this hole, my men are going to take  over.\n\nINT. N.A.S.A. - RESEARCH AND DEVELOPMENT DAY\n\nQuincy is face-to-face with Golden. TECHS work on the drilling \narm in the b.g.  Harry and the Roughtnecks are across the room. \n\nHarry That Armadillo car. Get it in here.\n\nIn rolls the Armadillo, two TECHNICIANS pushing it. Harry and the \nguys look at  it. Quincy shows it off.\n\nQuincy Pressurised titanium alloy cab. Airlocked life support. \nThe chassis's  by General Motors. Heavy duty suspension and six \nwheel drive. \n\nHarry How were you going to power your drill arm?\n\nQuincy Turbo-jet engine fuelled by Kerosene and liquid oxygen.\n\nHarry I need to be able to start and stop. I need different \nspeeds, and I need  reverse.\n\nQuincy A jet engine can't do that.\n\nHarry It can if it's hooked up to a clutch. A.J., get me a Mack \ntruck  transmission.\n\nQuincy That's so simple it's brilliant.\n\nHarry I'm a simple man. But don't underestimate me.\n\nA.J. Chick, Max! Mack truck tranny!\n\nChick and Max hurry off. A.J. smiles at Harry.\n\nINT. JOHNSON CTR - ASTRONAUT TRAINING - WORKROOM - DAY\n\nHarry, A.J., Bennie, Chick, Max, and Tito sit before Quincy, who \ndemonstrates a  series of components on the N.A.S.A. SPACE SUIT. \n\nQuincy The new generation EMU - Extravehicular Mobility Unit - \nprovides oxygen  for seven hours, a pressurised enclosure, and \ntemperate control. The gloves and  helmet slide  on and lock with \na twist, like this. The cap is worn underneath. It  contains a \nmike and headphones for two-way communication. We'll be able to \nsee  you from a small  video cam mounted inside the helmet. The \nUndergarment has 300 feet  of plastic tubing circulating cooling \nwater. Owen... \n\nOWEN THE TAILOR, five foot nothing & bald, stands in front of the \nmen.\n\nOwen These are made for men 5'8\" to 6'2\", between 140 and 200 \npounds. All of  you fit within those parameters - thank God we \nwon't have to do any  re-tailoring.... \n\nOwen stops because --\n\nBear and Jimbo stand in the doorway --\n\nJIMBO Yo. This where we get our suits?\n\nBear Sorry, we're late. Doc said we had... What do we got?\n\nJIMBO Cholesterol difficulties. Said we gotta enter \"The Zone.\"\n\nBear Shit, the only zone I know is the one around my mama's \ngrill.\n\nJIMBO \n(holding up form)\n But we're approved.\n\nOwen looks at the human mountains standing before hi, and then at \nthe tiny EMU  suit. Alterations will be necessary. \n\nINT. JOHNSON CENTER - ASTRONAUT TRAINING - MORNING\n\nClark briefs Harry and the mildly attentive Roughnecks. Sharp, \nTruman, CO-PILOTS  MEGAN WATTS \n(30's, tough as nails)\n and STAN WESTON stand in the back along with  N.A.S.A. Engineers \nJACK CROSS and RAYMOND SEARS. \n\nClark United States astronauts train for eighteen months. You \nhave nine days.  Officers Sharp, Truman, Watts and Weston are \nyour military instructors and the  only pilots to have flown the \nspacecraft. \n(beat)\n Each is a combat decorated officer  and among the finest men and \nwomen we have in the service. Pay attention to  them. \n\nSharp We spend six months on emergency training - we're throwing \nthat out. If  we fail, everyone dies. Game over. That's a heavy \nload but it's ours to carry.  The purpose of this is to train you \nin the physical and mental rigors of working  in a weightless \nenviroment so that you will not panic. So you can do your jobs.  \n(beat)\n You will vomit.  Your eyes will be sucked into the back of your \nheads. You'll be so  tired you can't eat but that won't matter \n'cause you'll be so sore you can't  take a dump. By the  \nway...good morning. \n\nINT. NEUTRAL BUOYANCY TANK - DAY\n\nSplash, Splash. Harry and the Roughnecks descend underwater. They \nlook like  Michelin Men in their thick space suits. Navy divers \nare around them as they are  lined up. \n\nThrough the underwater speaker, WE HEAR a trainer giving them \ninstructions for  their weightless aerobic training. WE HEAR a \nloud, embarrassing gastric sound  from Bear's suit. \n\nBear Houton, we have a problem. That is some vicious methane.\n\nHarry gives a \"shut the fuck up\" look. Time passes as the guys \nare dying,  HUFFING and PUFFING. One by one, they reach \nexhaustion. A cabled harness hoists  each out.\n\nINT. JOHNSON CENTER - CARDIO LAB - DAY\n\nHarry and his team, in T-shirts and running shorts, jog on a \nseries of  threadmills, wired to EKG machines, nostrils taped \nshut, breathing tubes locked  in their mouths. EXT. N.A.S.A. T-38 \nJET HANGER - DAY\n\nA gleaming spit-shine hanger full of fifteen N.A.S.A. T-38 \nfighter jets. Our  drill team walks up looking worn out. They are \nmet at the open hanger door by  pilots CHUCK JR., Vietnam vet, \nleatherneck-take-no-pussy-bullshit-type-of-guy  and HAMMER. \n\nChuck Jr. On this mission, they tell me you will experience the \nworst G-Forces  in the history of flight. It's like an elephant \nsitting on your chest. So, I  intend to flip you, spin you, splat \nyour bodies till your bones hurt. Now load up and  enjoy the \nflight. \n\nThe Roughnecks, wearing flight suits and helmets, board the \nplanes. Harry does  not like the look of these things. Bear is \ntrying to figure out how to fit  inside. \n\nBear Thing's made for a child - like my kid's car seat.\n\nChuck Jr. and Hammer walk up to a nervous Harry.\n\nChuck Jr. What's the problem, Texas tough guy?\n\nHarry I've got a thing about flying.\n\nChuck Jr. Not good for an astronaut. \n(looks to Hammer)\n Hammer, go easy, don't  rip his guts out.\n\nHammer Sure thing, Chuck.\n\nINT. JET FIGHTER.\n\nHarry plastered to the seat, MOANING so scared he can't puke. The \nplane  barrel-rolls and dives straight to the ground. Harry is \nGRUNTING and sweating  trying to stay conscious. \n\nEXT. N.A.S.A. T-38 JET HANGER - DAY\n\nThe T-38's are pulling up and letting the drill crew out. They \nwalk back with  white sweat, soaked faces and wobbly legs. Harry \nexits the plane. \n\nHarry I hate to fly. I hate to fly. I hate it so much.\n\nHarry leans over to puke.\n\nINT. N.A.S.A. T-38 JET HANGER - DAY\n\nThe Roughnecks walking to the T-38 Hanger. Sharp stands on the \nstairway to the  707 and calls everyone to attention.\n\nSharp Trainees, AT EASE \n(in command)\n We are not done here. We're taking you  for a little ride. This \nbird will climb to 40 thousand feet and drop to 10  thousand feet \nto give  you the feeling of weightlessness for 30 seconds. \nWelcome to  N.A.S.A.'s Vomit Comet. INT. VOMIT COMET\n\nThe plane drops. The Roughnecks lift off inside. Everyone's \nflying around the  cabin. It's a disaster. Guys bump heads. Bear \nfloats like a beached whale. Jimbo  rams the roof. Hary hold a \nbarf bag as he floats. An alarm SOUNDS, then the  plane levels \noff, the guys go slamming into the floor. \n\nINT. JOHNSON SPACE CENTER BATHROOM\n\nTracking past a row of stalls, WE SEE the soles of a pair of \nshoes peeking out.  Then another pair, another, and another over \nthe multiple sounds of guts being  tossed into the toilet. \n\nGolden, Clark, and Sharp stand outside the stalls.\n\nGolden This is like putting the Hell's Angels in space.\n\nINT. N.A.S.A. RESEARCH & DEVELOPMENT\n\nHarry and the Roughnecks are welding the Armadillo, working tough \nand hard.\n\nINT. N.A.S.A. LOCKER ROOM - NIGHT\n\nThe Roughnecks are getting dressed.\n\nMax \n(to Chick)\n We're going to go pound some brews where they have a lot of  \nsweaty, naked women. You in?\n\nChick \n(shakes head)\n No. I got to take care of something.\n\nThe Roughnecks walk out, leaving Chick behind.\n\nINT N.A.S.A. CAR - NIGHT\n\nDriven by a uniformed N.A.S.A. TECH, Chick pulls up to a house in \na residential  neighbourhood. He sits there with a beat, unsure \nof what to do. \n\nEXT. HOUSE - NIGHT\n\nChick walks up to the house, KNOCKS. DENISE WILLIAMS answers the \ndoor.\n\nChick Hey, Denise.\n\nDenise What do you want, Chick?\n\nA big six-year old boy, TOMMY, runs up behind his mom.\n\nTommy Who is it, Mommy?\n\nChick looks at Tommy, smiles.\n\nDenise It's um...just a salesman, honey.\n\nChick Hi.\n\nTommy \n(looking straight up)\n You look like big foot.\n\nChick kneels, extends his hand. Tommy smiles and shakes it. Chick \ndoesn't want  to let go.\n\nChick I got a feeling you're going to be pretty big yourself. \nDenise Go  inside and play, Tommy.\n\nTommy Okay, mommy. 'Bye, Big Foot.\n\nChick 'Bye, Tommy.\n\nChick watches Tommy run off. He looks to Denise.\n\nDenise What was I supposed to tell him? We've got a life here \nnow, Chick, with  someone we can depend on.\n\nChick What I did before was wrong. Every day of my life I regret \nit. I can see  you've got a good thing going, Denise, I'm not \ntrying to mess that up. But this  thing's come my  way and I got \nthe chance to do something really right. \n\nDenise This another one of your scams, Chick?\n\nChick It's no scam. You might just be proud of me.\n\nDenise opens the door a little wider, SHE SEES the car in the \ndriveway. The  N.A.S.A. logo stencilled on the door. The N.A.S.A. \nTech waiting. \n\nDenise What's going on, Chick?\n\nChick I can't tell you now. But if it comes out good, I'll be \nback. \n(beat)\n  Then maybe you'd consider telling Tommy I'm not a...salesman. \nIt's good to see  you. You look really  beautiful. \n\nChick turns and walks away.\n\nDenise Hey, Chick. \n(Chick turns)\n You be careful.\n\nINT. LUCKY LAURIE'S - NIGHT\n\nA seedy Houston drinking hole. All the Roughnecks sit at the bar. \nThe bar is  littered with EMPTY MUGS AND SHOTGLASSES. A WOMAN \nlooks at Bennie. \n\nWoman What are you boys doin' down here in good 'ol Houston?\n\nBennie \n(burps)\n We're in astronaut training.\n\nThis gets the reaction you'd expect.\n\nINT. JOHNSON CENTER - RESEARCH AND DEVELOPMENT - LATE NIGHT\n\nHarry and Quincy go over a list of stuff to order and logistical \nproblems.  N.A.S.A. Tech rushes into the room.\n\nN.A.S.A. Tech Space Command spotted more incoming.\n\nQuincy \n(springing up)\n Where' it headed? How big?\n\nN.A.S.A. Tech Don't know.\n\nThey start to run out of the room. Harry follows.\n\nINT. ROCKET ENGINE DEVELOPMENT ROOM\n\nThe camera follows up a long ladder to a huge rocket bell housing \nwhere A.J. and  Grace are kissing passionately. They notice Harry \nand Quincy, and the other  Techs heading for Mission Control. \nHarry locks eyes with A.J. He doesn't like  it. A.J. and Grace \nknow something is up. They follow Harry and the others into  \nMission Control. \n\nINT. MISSION CONTROL - LATE NIGHT\n\nThe room is lit up. Men are scrambling. Phones and satellite \ncharts pop up.  Tracking devices PING. Golden on top of the \nchaos. A TRACKING TECH plots on a  map. Clark stands over a \nN.A.S.A. TECH reading a computer screen. \n\nGolden Projected impact tracking. I need stats!\n\nTracking Tech Eastern Asian Hemisphere... someplace...ETA 17 \nminutes.\n\nN.A.S.A. Tech We have confirmation. The incoming is about the \nsize of the  Astrodome.\n\nClark We've got to warn.\n\nGolden Warn who? The whole South Pacific?\n\nGolden, with lack of sleep and stress, falls back into a chair. \nHe closes his  eyes, opens them -- finding Harry in the upper \nMission Control Deck. They lock  eyes for a long moment. \n\nINT. SHANGHAI - ESTABLISHING - NIGHT\n\nThe city ablaze in neon. The harbour, floating junksmanned by \nChinese merchants.  A loud sonic boom CRACKS in the sky. There's \na BRIGHT FLASH in the sky. Night  becomes day for two seconds. \n\nThe world slows down, motion creeps. The bright FLASH catches the \nface of a  little BOY reaching out for his father's hand. The \nasteroid SHRIEKS down,  hitting the harbour's surface in a red \nhot FLASH-BOILED at 100 thousand degrees. \n\nINT. MISSION CONTROL - NIGHT\n\nThe room is silent. Reports are starting to come in about the \ndevastation.  Golden walks up to Harry who is standing with Grace \nand A.J. He pulls Harry  aside. \n\nGolden Stamper, answer me one question - have you ever let anyone \ndown?\n\nWe go close on Harry's face. Searing flashbulbs popping, WIDEN TO\n\nINT. WHITE HOUSE PRESS ROO - NIGHT\n\nWE SEE him from behind as he addresses the massive crowd. The \nU.S. PRESIDENT  stands before a throng of reporters.\n\nPRESIDENTIAL ADDRESS\n\nPapers headlines, CNN reporters flash on screens. Images of \npeople watching the  news in bars, at home. A NEW YORK POST slams \ndown on the pavement, the headline -  SHANGHAI DISASTER, MASSIVE \nDEATH TOLL RISING.\n\nINT. SOMEPLACE IN KENTUCKY - HOLDING CELL - DAWN\n\nJimbo is talking to an F.B.I. AGENT who is on the other side of \nthe bars holding  a newspaper.\n\nJimbo If it's over then why aren't you lettin' us out of this \ngoddamn cell?\n\nF.B.I. Agent Be real soon, son.\n\nThe agent flips the newspaper into the holding cell and walks \naway.\n\nJimbo Don't walk away, I want to talk to my lawyer. You hear me?\n\nPearl \n(refering to the newspaper)\n This says that the asteroid came from the  Southern Hemisphere.\n\nTheo Southern Hemisphere?\n\nPearl No kidding. It's a big sky - they want people to look the \nother way.\n\nINT. MANHATTEN - TAXI CAB\n\nStu the cabbie is riding with a WALL STREET GUY.\n\nStu Kennedy lied about the Bay of Pigs, Nixon...Watergate, say no \nmore.  Clinton. One word. 'Women.' If I know one thing; ALL \nPRESIDENTS LIE. \n\nINT. N.A.S.A. - TRAINING ROOM - MORNING\n\nMorning after the devastating disaster in Shanghai. Harry walks \ninto the quiet  room. Harry's all business. \n\nHarry Forty thousand people died last night. But I guess that \ndidn't concern  any of you. I hope you all had a good time last \nnight. \n\nThe Roughnecks look around. They know there were wrong.\n\nChick I gotta tell you...I'm scared.\n\nHarry Well, you should be scared. We all should be. 'Cause if we \nfail, they  say the Earth will die.\n\nHarry sits down, looks out the window at N.A.S.A. Techs working \nin the room down  below.\n\nHarry You think these N.A.S.A. guys are a bunch of clean-cut \npussies, that's  it. They can out think you, they can outrun you. \nThis job, gentlemen, is as real  as it gets. I need every one of \nyou. \n(he looks them in the eye)\n If you're not up to it,  then walkout of that door. \n\nFinally. Theo and Pearl, frustrated, go to the TWO-WAY MIRROR, \nblocking Jimbo  from view.\n\nTheo I'm hungry! When're we gonna eat?\n\nPearl I have p.m.s.!! I need some ibuprofen!\n\nJimbo grabs Randy's legal pad and writes:\n\nHELP!! BIG ASTEROID GOING TO HIT EARTH. COORDINATES 712 BY 345.\n\nRandy stares at the message.\n\nRandy Okay, I'm done here!\n\nThe door opens. Two F.B.I. AGENTS lead Randy out. Jimbo looks at \nTheo and Pearl.\n\nJimbo He flunked the bar three times.\n\nINT. N.A.S.A. - RESEARCH AND DEVELOPMENT\n\n-- Harry shows Quincy his DRAWINGS of the DRILLING ARM - the way \nHarry wants it.\n\n-- Harry, A.J. and Quincy work with the TURBO PROP ENGINE, \ntransforming it into  a JET FUEL GENERATOR.\n\nQuincy We'll run your liquid oxygen from the shuttle through a \ntube into the  intake manifold. No problem.\n\nA.J. I figured out how to bring up the slag. Direct the jet \nturbine's exhaust  down the drill pipe. It'll blow the stuff \nright up the hole. \n\nHarry Good, A.J. Good.\n\n-- Chick, Bennie, Bear, Jumbo welding new pieces of the DRILLING \nARM together.  The Roughnecks have changed. Chick and Bennie now \nhave crew-cuts. \n\n-- A.J., Harry, Max and Tito build the drilling arm.\n\nEXT. ARIZONA - SHUTTLE TAKE OFF AREA\n\nTWO X-71 SHUTTLES in the hanger. TECHNICIANS scramble around, \npreparing the  shuttles for the mission.\n\nHarry \n(points)\n From all of your intel, the deepest fault line is here. This is  \nmy sweet spot. If I can get a clean hole in there, She'll blow in \nhalf.... \n\nGolden ....and the two pieces will slide right past us. You \ncannot shatter it.  Getting hit with 20 smaller asteroids is as \nbad as one big one. You have to  drill, plant the nuke,  lift \noff, and detonate -- all before the asteroid reaches this  \nposition. \n(demonstrates position)\n You have eight hours. Remember it. You must  detonate by this \npoint or,  the two halves will hit us. \n\nHarry nods and walks off.\n\nSharp Drill an eight-hundred foot hole in eight hours? Is that \npossible?\n\nHarry doesn't like to be questioned --\n\nHarry You just worry about getting me on that rock, Colonel. Let \nme worry  about the drilling.\n\nA moment of conflict between them.\n\nEXT. JOHNSON CENTE - ASTRONAUT TRAINING - DAY\n\nONE OF THE ARMADILLOS, complete with drilling arm, sits at the \nbottom of the  tank. Harry and six Roughnecks are already at the \nbottom, in pressure suits and  helmets. \n\nGolden, Quincy, Clark, Sharp, Truman, and all of the N.A.S.A. \nBRASS, observe.\n\nA.J. is the last to enter the tank.\n\nINT. N.A.S.A. NEUTRAL BUOYANCY TANK - UNDERWATER\n\nA.J. descend to the tank's bottom. Harry, Chick, Bennie, Max and \nTito are in  bulky white pressure suits. Jimbo and Bear wear the \nlargest pressure suits ever  made. They talk through their helmet \nradio links. \n\nOne drilling arm starts turning. The Roughnecks turn toward a \nSTACK OF 20 FOOT  LONG STAINLESS STEEL DRILLING PIPES on the \ntank's bottom. ABOVE WATER - SIDE OF  TRAINING TANK\n\nGolden hits a stopwatch.\n\nGolden \n(into intercom)\n Go.\n\nINT. N.A.S.A. NEUTRAL BUOYANCY TANK - UNDERWATER\n\nBear and Jimbo grab a pipe string and handle onto the mock-up \ndrill arm. They  clamp it on. Bennie and Chick screw a drill bit \nonto the pipe string. They are  good, very good. The work with \nthe manic intensity of a pit crew at Indy. \n\nHarry Done!\n\nABOVE WATER - SIDE OF TANK\n\nGolden hits his stopwatch. Smiles. The N.A.S.A. Brass is \nimpressed.\n\nGolden These guys are fast. Harry, interior gauge check.\n\nINT. N.A.S.A. NEUTRAL BUOYANCY TANK - UNDERWATER\n\nHarry We're on A.J.\n\nA.J. Let's see what this baby can do.\n\nHarry and A.J. move the Armadillo's AIRLOCK DOOR. It has an \nexterior open/close  button. Harry punches it. The side door \nopens. Harry enters, then A.J. \n\nINT. ARMADILLO - UNDERWATER\n\nHarry and A.J., still underwater, climb inside. Harry presses the \nPRESSURIZATION  button. Simulating pressurisation in space, the \nwater in the cab is blown out,  and air WHOOSHES IN. \n\nHarry and A.J. sit dripping in the watertight cab. Through the \nfront window WE  SEE the other Roughnecks in the tank. Harry \nunlocks his neck seals. Pulls off  his helmet. \n\nHarry Lose the helmet, A.J.\n\nA.J. snaps out of it. His hands go instinctively to the helmet \nand in one  motion...CLICK. It's off.\n\nHarry \n(clicks radio)\n We're in. Run the simulation.\n\nThe interior PRESSURE GUGE NEEDLES and MONITORS \n(engine torque, drill direction,  etc.)\n start bobbing. The drill starts to cut into a BLOCK OF CONCRETE. \n\nGolden \n(V.O)\n How's she look?\n\nHarry Torque adjuster's good. Fuel level good. A.J., downhole \npressure?\n\nA.J. We can do better. I'm increasing the RPM's to seven \nthousand. We can get  more torque.\n\nGolden \n(V.O)\n Negative, A.J. Don't exceed ix thousand. Not on this run.\n\nA.J. Relax. I built this thing. She's got more in her. Increasing \nthe RPM's.\n\nGolden \n(V.O)\n Negative, A.J. A.J. increases the RPM's. The gauge starts to \nrise. The N.A.S.A. Brass shifts  uneasily in their seats. They're \nnot accoutomed to seeing their astronauts  disobey orders. \n\nGolden \n(V.0)\n \n(cont'd)\n A.J., shut the Armadillo down now\n\nA.J. We can push it, further. Let's see what she can do.\n\nSuddenly, the RPM''s shoot into the red. A red siren spins in the \ncontrol room.  The Armadillo SHAKES violently. The DRILLING BIT \ngrinds to nothing. The  Armadillo BLOWS a tranny. \n\nHarry's eyes close. He's pissed.\n\nIN THE CONTROL ROOM\n\nThe N.A.S.A. Brass looks to Golden. One of them shakes their \nhead. Sharp and  Golden exchange a look. Sharp shakes his head. \nINSIDE THE TANK\n\nA.J. presses a button and the cabin, simulating \n\"depressurisation\" in space,  begins to fill with water.\n\nINT. NEUTRL BUOYANCY TANK - SIDE OF TANK - DAY\n\nEveryone around him just watches, as A.J. climbs out of the tank. \nAfter a  minute, A.J. looks up, sees all the eyes in the room on \nhim. \n\nEXT. CREW QUARTERS - NIGHT\n\nHarry is outside, smoking a Coheba. Harry runs his hand over a \nSMALL METAL MEDAL  that hangs from his neck. Golden approaches. \n\nGolden A.J.'s off the team. We need a list of names from you to \nfill the slot.\n\nHarry A.J. would be the first name on my list.\n\nGolden We don't want independent thinkers. And we don't need \nheroes. We need a  team.\n\nHarry You have to have confidence in the men you send up. I \nunderstand that.  But I'm the one that has to land on that rock. \nNot you. \n(firm)\n I pick my own  team. \n\nGolden One shot. Pull him in line or send him home.\n\nINT . HUB OF ROCKET SIMULATOR - NIGHT\n\nA.J. and Grace are there talking. Grace is on A.J.'s lap.\n\nA.J. I pushed it, I screwed up.\n\nGrace These astronauts train for years for what you're training \nfor in a few  days.\n\nA.J. I don't know why I didn't just listen to them.\n\nGrace So, tomorrow you listen.\n\nA.J. and Grace share a look.\n\nA.J. I love you, Grace.\n\nA N.A.S.A. Tech approaches.\n\nN.A.S.A. Technician Harry wants to see you.\n\nINT. DESIGN AND PROTOTYPE ROOM - NIGHT\n\nHarry and A.J. stand in the centre of a high-tech supply room. \nSPARE PARTS from  shuttles, PROTOTYPES and WORK TOOLS are \neverywhere. \n\nHarry You tell me what the hell you think you're doing?\n\nA.J. I'm trying to work with the team.\n\nHarry Bullshit. You're trying to lead this team. You're trying to \nbe me.  You're not me.\n\nA.J. What do you want? You want me to quit?\n\nHarry If you can't bury this cowboy shit, yeah, I want you to \nquit.\n\nA.J. I don't have to prove anything to anybody, Harry.\n\nHarry I listen to N.A.S.A., you listen to me. That's the chain. \nEither you  follow it, or you're done.\n\nA.J. I'll follow it.\n\nHarry I stood up for you, because I've made a life of proving \npeople wrong.\n\nHarry's hand slides down to the medal hanging from his neck.\n\nHarry \n(cont'd)\n When I was about your age, I was in Galveston, Texas. I scraped  \ntogether some money, bought some old equipment, a little land. I \nset up a rig  and drilled my first hole. Then I sat there and \nwatched her soak up the sun for six  months - waiting for this \nbaby to pop. Everybody told me to quit. I wouldn't  listen. My \nwife ran off with a drill-rigger, left me with Grace. Everybody \nin town thought I  was a fool. But I stayed with it. And in the \nlast hour of the last day, she  popped. She spit out that black \ngold and I danced in it like a wild Indian. \n(reflective )\n I  captured the magic \n(holding medal)\n This is the last piece of pipe that struck  gold that day. \n\nHarry takes off the medal. Sets it on the table. He grabs a \ncutting vice and  cuts the medal in two perfect halves. He hands \none half to A.J. \n\nHarry \n(cont'd)\n Here, take it up there.\n\nQUICK MONTAGE\n\nInside the neutral buoyancy tank -- Harry's crew goes through all \nDRILLS one  final time \n(final mission checks)\n in quick succession. Everything runs  perfectly. The Armadillo \nis rebuilt and shown functioning without error. A.J.  works as \npart of the team. \n\nINT. JOHNSON SPACE CENTER - DAY\n\nThe hour of the mission. The two teams sit in the orange N.A.S.A. \nflight  pressure suits. Golden enters and stands before the room. \n\nGolden In the book of Revalations, the Bible speaks of a final \nday on Earth,  when all mankind shall perish, shall cease to \nexist. This day is known as  Armageddon. \n(firm)\n Right  now, that day conflicts with six billion schedules. \n(beat)\n For the  first time in the history of this planet, s species \npossesses the technology to  prevent it's own  extinction. \n(beat)\n I've been with N.A.S.A. my entire adult life.  Eleven years as \nan astronaut, another fifteen on the ground at Mission Control.  \nTwenty-six years I've had  to answer one question -- why? Why \nmore money? Why the race for  space? Why do we need to know what \nis up there? \n(beat)\n When we come through  this, I'll take  comfort in the fact that \nI won't ever have to answer those  questions again. You are our \nwarriors up there. You are our last hope. God be  with you. \n\nThe crew stands......\n\nEXT. JOHNSON SPACE CENTER - RUNWAY - DAY\n\nTwo sleek BLACK LEAR JETS are parked on the runway. Harry studies \nthem. Grace  approaches.\n\nHarry You know I was thinking, Gracie. Over the years, I should \nhave patted  you on the back more....\n\nGrace Dad, you don't need --\n\nHarry No father has ever been prouder of his child, Gracie. I \nwant you to know  that.\n\nGrace's reaction makes it clear that Harry has never said \nanything like this  before.\n\nGrace I love you, Dad.\n\nHarry I love you too, Gracie.\n\nGrace \n(as they hug)\n Keep an eye on A.J. for me.\n\nHarry climbs up the metal stairs --\n\nA.J. and the rest of Harry's crew comes out of the building. A.J. \nmoves to Grace  as she watches her father disappear into the jet. \n\nA.J. Excuse me. \n(Grace turns)\n You're really insanely gorgeous and I was jost  sort of \nwondering if you -- \n\nGrace I'm engaged. But my father hasn't given him his blessing so \nyou might  still have a chance. \n(smiles, then serious)\n Promise me you won't do anything  stupid up there.\n\nA.J. nods. They kiss passionately. Harry's crew sees this and \napplauds. Grace  blushes, embarrassed.\n\nA.J. I love you, Grace.\n\nGrace I love you. Come back, Okay?\n\nHarry's crew boards LEAR JET 2. A.J. starts toward LEAR JET 1. \nGrace watches him  walk away, eyeing his suit.\n\nGrace A.J.--\n\nA.J. \n(turning)\n Yeah?\n\nGrace When you get back, ask them if you can kep the suit \n(winks)\n It's kind of  sexy.\n\nEXT. ARIZONA DESERT - BY SHUTTLE FREEDOM\n\nThe cone-shaped noses of the two X-71's are towering silhouettes \nagainst the  sun. Massive CRAWLERS move the shuttles to the \nlaunch tower. \n\nEXT. SHUTTLES FREEDOM & INDEPENDENCE LAUNCH - DAY\n\nSeen from a distance as silhouettes behind a sun-soaked sky, \nsixteen figures  walk toward us. As they grow closer, WE SEE the \nintense game faces of Harry,  A.J., Bennie, Chick, Jumbo, Tito, \nRockhound, Max and others approaching the  launch site. They look \nlike N.A.S.A.'s version of the \"Dirty Dozen.\" \n\nHarry carries a LARGE MYSTERIOUS METAL CASE, that we've not seen \nbefore now.\n\nINT. LAUNCH TOWER ELEVATOR - LATER\n\nHarry exits the elevator and start to walk to the CATWAL to the \nFreedom shuttle.  Harry carries his suitcase.\n\nN.A.S.A. Tech 1 Sir, was that case authorised for transport?\n\nN.A.S.A. Tech 2 Our weight to fuel ratio's calibrated to the \nkilogram, sir.  How much does that weigh?\n\nHarry Sixty pounds.\n\nN.A.S.A. Tech 1 That can't go up with you, sir.\n\nHarry Wait here.\n\nINT. SHUTTLE FREEDOM - AFTERNOON\n\nHarry enters the cabin. N.A.S.A.'s crack seven-member \"Strap-in-\nTeam\" goes to  work. Harry's crew are outfitted with their \nHELMETS and CHUTE PACKS. Each step  is methodical, each piece of \nequipment is checked and rechecked. \n\nHarry Hey you. Yeah you. Come here.\n\nA YOUNG N.A.S.A. TECH approaches. Harry gestures at a row of \nMETAL COMPONENTS  housed in the wall.\n\nHarry What's all this crap?\n\nN.A.S.A. Technician \n(pointing to various)\n Multi-track C.D. player.  Anti-gravity hand washer, utensil \nwasher, and micro-wave oven. \n(proud)\n We worked  hard to make the X-71 feel  more like home. \n\nHarry just looks at the kid.\n\nEXT. ARIZONA DESERT - BY SHUTTLE FREEDOM - DAY\n\nMetal components one after the other come out of the shuttle \nhatchway and SLAM  into a heap on the lake bed. Harry then \nappears in the hatchway. \n\nHarry We don't need music and we don't mind dirty utensils.\n\nHarry picks up his LARGE METAL CASE and ducks back inside the \nFreedom. The  N.A.S.A Techs stare at the ruined components at \ntheir feet. \n\nINT. MISSION CONTROL - DUSK\n\nGolden and Clark prepare for the launch.\n\nN.A.S.A. Tech \n(into intercom)\n T-minus six minutes and counting.\n\nINT. SHUTTLE FREEDOM - COCKPIT - DUSK\n\nSharp and Watts settle in. MAJORS PITTS and FISK, two stern Army \ndemolition  experts, finish tying down their equipment.\n\nMission Control \n(V.O)\n Roger, Independence and Freedom, auto ground launch  sequencer \ncommencing.\n\nSharp looks at Pitts and Fisk\n\nSharp You two ready?\n\nPitts \n(enthusiastically)\n AIRBORNE!\n\nINT. N.A.S.A. - MISSION CONTROL - DUSK\n\nGolden, Clark and the N.A.S.A. Techs study the CENTRAL BOARD as \nfinal  preparations for take-off commence.\n\nTechnician Shuttles Freedom and Independence you are cleared for \nlift off.\n\nEXT. ARIZONA DESERT - SHUTTLE TAKE OFF ZONE - DUSK\n\nThe ground TREMBLES like an earthquake. EXHAUST BILLOWS out of \nthe ROCKET  BOOSTERS, filling frame. Shuttles Freedom and \nIndependence ROCKET OFF from dual launch pads, STREAKING  BETWEEN \nCAMERA, climbing to the heavens.\n\nINT. SHUTTLE FREEDOM - COCKPIT - DUSK\n\nSharp and Watts flip switches, check gauges.\n\nSharp Instituting roll manoeuvre. We have S.R.B. Sep, over.\n\nINT N.A.S.A. - MISSION CONTROL - DUSK\n\nTechnician You are a 'go' for ET separation.\n\nEXT. UPPER ATMOSPHERE - DUSK\n\nFreedom and Independence scream away from Earth, dropping their \nbooster  canisters.\n\nEXT. SHUTTLE FREEDOM - DUSK\n\nHarry, Chick and the others experience their first G-Forces.\n\nINT. N.A.S.A. - MISSION CONTROL - DUSK\n\nClark Lookin' real good, Freedom.\n\nGolden When you meet the Russian, you might want to go easy on \nthe guy. He  just broke the record for the longest solo - \nthirteen months, seven days. \n\nINT. SHUTTLE FREEDOM\n\nChick \n(to Harry)\n Thirteen months, seven days. \n(beat)\n What the hell has he been  doing all by himself?\n\nINT. RUSSIAN MIR STATION\n\nLife inside, like the cluttered glove-box of an old car. George \nMichael's  \"Freedom\" plays on a piped-in sound system. COSMONAUT \nLEV ANDROPOV dances and  sings. \n\nLev FREEDOM! FREEDOM! GOT TO GIVE WHAT IT TAKES....Hello Yankees! \nI love you  America. \n(reading from English book)\n Would you prefer an appetiser or aperitif? \n\nEXT. RUSSIAN MIR SPACE STATION\n\nPULL OUT of the MIR's window to see Lev dancing with joy. He's \ncelebrating the  forthcoming arrival.\n\nPULL FURTHER BACK to catch a wider view of the Russian multi-\nmodule Space  Station -- a white winged steel seagull.\n\nINT. SHUTTLE FREEDOM\n\nThrough the cockpit window, the BLUENESS of Earth's atmosphere \nbecomes the  BLACKNESS of space.\n\nINT. MISSION CONTROL\n\nClark Freedom, Independence. You're looking good. Prepare to \nstart docking  procedures at the MIR.\n\nINT. SHUTTLE FREEDOM\n\nSharp addresses the crews of both shuttles over the radio --\n\nSharp Listen up -- the MIR will be spinning to give us gravity so \nwe can work  faster. You might feel queasy or dizzy. We'll dock, \ntransfer the fuel, then  detach from the MIR.  Fast and safe. \nThis stuff is very volatile. \n\nINT. RUSSIAN MIR SPACE STATION - DOCKING PORT\n\nLev is working feverishly, running highly insulated liquid oxygen \nand hydrogen  PROPELLANT TRANSFER HOSES from the MIR's several \nLABORATORY and LIVING MODULES  to the MIR's twin docking ports. \n\nA BLUE INDICATOR LIGHT FLASHES. Lev looks out of the MIR's \nportside window. His  eyes light up. He smiles.\n\nEXT. SPACE - LOW EARTH ORBIT - MIR DOCKING PORTS\n\nFreedom and Independence approach the MIR station. The MIR is T-\nshaped, with  TWIN DOCKING PORTS at each end of the T's crossbar. \nFreedom begins docking at  one end., Independence at the other. \n\nINT. SHUTTLES FREEDOM/INDEPENDENCE - AIRLOCK PORT TO MIR\n\nTruman Fuel teams prepare to unload.\n\nA RED LIGHT \n(unsafe)\n turns GREEN \n(safe)\n. The docking port's HATCHWHEEL spins,  and the door slides open. \nHarry, Sharp, Watts, Chick, A.J., Bennie, and Truman  enter the \nMIR. \n\nINT. MIR SPACE STATION - DOCKING MODULE\n\nThe TEAM comes through the docking module and out pops Lev, \nhanging upside down  in frame.\n\nLev HELLO YANKEES! Welcome to the home of me, Cosmonaut Lev \nAndropov. \n(MORE)\n\n\nOn a wall, A COMPUTER BOARD that monitors the fuel transfer is \nfilled with GREEN  LIGHTS.\n\nINT. CENTRAL ROOM - CENTER HUB OF MIR\n\nHarry, Bennie, and Lev are talking in the combination kitchen/ \nrec room of the  MIR -- a little bigger than a walk-in closet. \nLev grabs a VIDEO CAMERA and  starts video-taping Harry and \nBennie. \n\nLev I hear rumour on radio. My country broke. No steaks in \nfreezer. They plan  to sell me and the MIR \n(moving in closer, conspiratorial)\n Can you confirm this? \n\nBennie We wouldn't know. What's the camera?\n\nLev Oh, I also di-rec-tor. Russian cinema. MIR movies. Each has \ntitle.\n\nLev grabs remote control. On a large TELEVISION screen VARIOUS \nIMAGES OF LEV  appear.\n\nLev \"Lev loves cargo.\" \"Lev sleeps.\" \"Lev prepares for \nAmericans.\" \"Lev gets  bored so he gets drunk.\" Funny but...too \nlong. \n\nBennie Looks like you have a lot of free time on your hands.\n\nLev Yeah. I alone by myself.\n\nWatts comes into the room. The first woman Lev has seen in a \nvery, very long  time. Lev moves the camera all over her. \n\nLev Hello, fellow space colleague.\n\nWatts nods.\n\nWatts I'll be in the docking port.\n\nLev Please allow me to escort you. \n(as they walk out)\n You California girl?\n\nINT. MIR SPACE STATION - REAR MODULES\n\nHarry and Bennie enter the MIR's rearmost module. Two propellant \nhoses run into  TWIN PROPELLANT OUTPUT VALVES on a rear panel. \nBennie's eyes move to a LAUNDRY  LINE. BOXERS hang from the line. \n\nBennie This Lev guy is a little off.\n\nOn the computer board, a small RED LIGHT replaces the GREEN \nLIGHT. Then another.  No one notices.\n\nINT. MIR STATION - DOCKING PORTS\n\nCAMERA FOLLOWS MICROSCOPIC AEROSOL BUBBLES OF LIQUID OXYGEN \n(MACRO SHOT)\n  DRIPPING from a valve onto a COMPUTER CIRCUIT BOARD. \n\nINT. MIR - FUEL STORAGE\n\nTHE GAUGE STARTS TO rise. A.J. WATCHES. One hundred eighty-\nfive...190...195...\n\nA.J. \n(into intercom)\n Lev, the pressure's climbing.\n\nINT. MIR CORRIDOR\n\n\n(EXTREME MACRO)\n The Liquid Oxygen oozes into the circuit board. Surgeon-like  \nmicroscopic camera tracks it under the keys, reaching a COMPUTER \nSWITCH. It  SPARKS. \n\nINT. DOCKING PORT\n\nLev, Sharp, and Chick are walking toward the shuttles. The \nELECTRICITY in the  MIR FLUTTERS. Lev stops. Sharp stops. Lev \nlooks over his shoulder toward the  central hub. A chill runs \ndown his spine. DOLLY INTO LEV'S EYES - \n\nLev \n(whispering)\n Leak. Run.\n\nLev and Sharp run toward the central hub. Lev punches a KLAXON.\n\nLev \n(cont'd)\n LEAK! RUN!\n\nChick takes off running past Lev and Sharp.\n\nSharp \n(to Chick)\n E-vac. E-vac. Unhook the shuttles. Move!\n\nINT. MIR - FUEL STORAGE\n\nA.J. reacts to the KLAXON, starts to climb up the shaft ladder. \nA.J. struggles  under the heavy weight of his cold suit, finally \nreaching --- \n\nINT MIR - CORRIDOR ABOVE FUEL STORAGE\n\nCircuits pop VIOLENTLY all around A.J., as the mixture of \nchemical in the air  starts to CHEW the MIR's walls.\n\nINT. MIR - CENTRAL HUB\n\nLev, Sharp, and Chick RUN into the hub as the leak continues, \ngrowing rapidly  worse, EATING the walls. Sharp sees the LEAK. \nRuns back toward the docking port. \n\n\n\nLev \n(to Sharp)\n Seal door.\n\nAs Sharp SEALS the hatch, Lev returns to look for A.J.\n\nINT. MIR STATION - REAR MODULE\n\nHarry and Chick react to the KLAXOX BLARES.\n\nHarry Unhook the shuttles.\n\nHarry and Chick RUN out of the rear module and race through the \nmaze of twisting  corridors.\n\nINT. MIR CORRIDOR\n\nA.J. runs through another corridor, heading for the docking port \nas the walls  around him POP! Lev files around the corner almost \nsmashing into A.J. \n\nINT. MIR STATION - REAR MODULE \n\nThe smoking circuitry SPARKS, and the REAR MODULE explodes in a \nVIOLENT  CONCUSSION, LAUNCHING A LONG TONGUE OF FLAME into -- \nINT. MIR STATION - UPPER  MODULES\n\nHarry and Chick race for the DOCKING MODULE as -- BEHIND THEM, A \nSECOND MODULE  fills with FIRE and EXPLODES, rocking the MIR. \nThen a third. Fire starts to RIP  THROUGH corridors in the MIR. \n\nEXT. MIR STATION - SPACE\n\nThe MIR shudders and begins to TILT TO ONE SIDE. \n\nINT. MIR STATION - UPPER MODULES\n\nEverything is SIDEWAYS. Lev is KNOCKED to the ground. A HEAVY \nCOMPUTER BOARD  falls, separating A.J. and Lev.\n\nAttempting to reach A.J., Lev turns back and runs from where he \njust came.\n\nINT. MIR STATION - UPPER MODULES - SEALED CORRIDOR\n\nA.J. looks left, then right. He doesn't know how to get to the \ndocking port. He  starts running.\n\nINT. MIR STATION - DOCKING PORTS\n\nSharp re-joins Bennie and Truman. They unhook the FUEL LINES to \nthe shuttles.  Sharp and Chick run aboard Shuttle Freedom. Truman \nboards Independence. \n\nINT. MIR CORRIDOR\n\nA.J. is at the corridor fork. Right or left? The Russian writing \nabove both  paths doesn't help. Just as he's about to go left -- \nLev suddenly appears, grabs  A.J., and PUSHES HIM into the RIGHT \nCORRIDOR. \n\nLev Run Yankee!\n\nINT. SHUTTLE FREEDOM\n\nSharp \n(to Watts as he sits and buckles up)\n Shut the doors and fire her up!\n\nWatts We still have people out there.\n\nSharp It's them or ALL OF US. CLOSE THE DOORS NOW!\n\nAs the doors are closing, Harry and Chick rush into Shuttle \nFreedom. Harry's  fingers grab the doors just in time. The doors \nretract back. \n\nHarry Did A.J. make it?\n\nChick I didn't see him.\n\nINT. SHUTTLE INDEPENDENCE\n\nTruman buckles himself in, fires up the Independence.\n\nINT. SHUTTLE FREEDOM\n\nFreedom is fired up. The MIR shudders again. TILTS further.\n\nSharp We have to GO!\n\nINT. MIR CORRIDOR\n\nA.J. and Lev are running hard as DEBRIS falls behind them and the \nwalls start to  TEAR APART. They turn a corner, headed toward the \ndocking port -- \n\nINT. SHUTTLE FREEDOM\n\nHarry is at the door, eyes frantically searching for A.J. --\n\nSharp WE GO NOW!\n\nSharp stabs a button on his pilot console. The AUTOMATED DOORS \nBEGIN to slide  shut.\n\nINT. SHUTTLE INDEPENDENCE\n\nTruman stabs a button on his pilot console. The AUTOMATED DOORS \nBEGIN to slide  shut.\n\nINT. MIR DOCKING PORT\n\nA.J. and Lev race into the docking port from a rear corridor. \nHarry sees them.  Lev dives into Independence just as the doors \nclose. A.J. dives head-long  through the shutting Independence \ndoors. \n\nINT. SHUTTLE FREEDOM\n\nSharp \n(to Watts)\n Full thrusters!\n\nEXT. MIR STATION - SHUTTLES FREEDOM AND INDEPENDENCE\n\nThe two shuttles RELEASE AWAY from the MIR Station on FULL \nTHRUSTER POWER, just  escaping as --\n\nTHE MIR STATION EXPLODES in an eternal flash fire, blowing out \nsections of wall  panels and sending a SOLAR PANEL shooting \ntoward Freedom that just misses her!  The collapsed MIR STATION \ndrifts off into the oblivion of space. \n\nINT. SHUTTLE INDEPENDENCE\n\nA.J. sits panting on the floor of the shuttle next to the docking \nport door. Lev  stares down at him.\n\nLev I am Cosmonaut Lev Andropov, what your name?\n\nA.J. My name is A.J.\n\nLev You just blew up my home.\n\nSUPER -  TWENTY THREE HOURS TO THE MOON\n\nGolden and Sharp sitting around going over data. New images of \nthe closer,  meaner asteroid approaching.\n\nINT. FREEDOM\n\nInterior small sleeping area. Max hanging upside-down in zero \ngravity. Wakes up  yawning. He looks to Bear.\n\nMax Oh, man, did I have a dream.\n\nBear So did Martin Luthor King.\n\nMax No, this was a bad dream. We were drilling and the ground ate \nthe bit.  Then it ate the pipe, then the derrick. Then it ate us. \n\nBear That's a dumb-ass dream.\n\nMax I'm not coming home.\n\nThey look at each other.\n\nINT. FREEDOM COCKPIT\n\nHarry, Bear, Chick, and Sharp stand looking out the cockpit rear \nwindow toward  the brilliant blue Earth.\n\nBear What are you thinking about, Chick?\n\nChick My kid. You.\n\nBear My Mom, she'd be proud to see me as an astronaut.\n\nChick Harry, what are you thinking?\n\nHarry \n(looking at Earth)\n How beautiful it is. Thinkin' about all that oil I  sucked out \nand spit into the air.Funny how a man can live 46 years and \nrealize  he ain't been doing the right thing. \n\nINT. N.A.S.A. - PRESS CONFERENCE ROOM\n\nBEHIND A CURTAIN - Golden confers with Collinswood.\n\nCollinswood The President is counting on you to put out the fire, \nDan. Say  whatever you have to. Just do it.\n\nGolden walks from behind the curtain. Walks up to the podium, ten \nVIDEO CAMERAS  swivel into position.\n\nFor a long moment Golden just stands there, saying nothing.\n\nGolden I work for the President of the United States. \n(long pause; looks over  at Collinswood)\n But I think it's my duty as a scientist to tell the world what  \nis happening. Three,  days ago a manned space mission was sent to \nintercept an asteroid  which has entered the Earth's orbit. \n(REPORTERS all chatter)\n This is a difficult  mission. In all  frankness, it is the most \ndifficult mission anyone has ever flown.  \n(beat)\n A little over fifty years ago we sent our Armed Forces half-way \naround  the world to save the  world from an evil empire that \nthreatened mass extinction. The men  and women of this nation \nunited, answered the calland preserved our freedom.  \n(beat)\n Once again  we face a threat to our way of life. And once again \nwe look to our  military to preserve our future. The men and \nwomen selected to lead this mission  are America's  finest and \nmost decorated career officers in the military. Our  hopes and \nprayers are with them. Thank you. \n\nGolden walks off. The REPORTERS CLAMOR\n\nReporters \n(UNISON)\n Director Golden! DIRECTOR GOLDEN!\n\nBACKSTAGE - Golden approaches Collinswood.\n\nCollinswood Golden, your drillers better not let us down.\n\nGolden We'll do your best.\n\nEXT. SPACE - APPROACHING THE MOON\n\nThe two Shuttles approach THE MOON, Freedom in the lead, \nIndependence following.\n\nBeyond the Moon, too distant to see clearly, THE ASTEROID is on \nits trajectory  toward Earth. It is a HUGE, GRAGGY MASS \nsurrounded on all sides by a DEBRIS  CLUSTER of rock and ice, the \nice glinting on and off in reflected sunlight, like  millions of \nfireflies. \n\nINT. SHUTTLE FREEDOM - COCKPIT\n\nWatts \n(unbelieving)\n My goodness, look at that thing....\n\nSharp We have visual of target, Houston. Velocity thirty-three \nhundred miles  an hour.\n\nINT. HOUSTON - MISSION CONTROL\n\nClark sits with Techs Flip and Skip. Golden and Temple pace \nbehind the console.\n\nINT. SHUTTLE FREEDOM - REAR CABIN\n\nHarry, Chick, Bear, and Max finish buckling into their seat \nrestraints and  harnesses.\n\nINT. SHUTTLE INDEPENDENCE - REAR CABIN\n\nA.J., Lev, Bennie, Jimbo and Tito buckle on harnesses. Bennie \nlooks at A.J.  nervously.\n\nEXT. SPACE - APPROACHING THE MOON\n\nThe Shuttles rapidly close on the moon. The dead, luminous sphere \nlooms larger  in frame.\n\nINT. SHUTTLE FREEDOM - COCKPIT\n\nTHE LUNAR SURFACE completely fills the cockpit windshield. We've \nlost sight of  the oncoming asteroid.\n\nSharp Visual contact with target lost, Houston.\n\nIN THE REAR CABIN - Harry, Chick, Bear, and Max stare in awe at \nthe  ever-approaching Moon.\n\nEXT. SPACE - APPRAOCHING THE MOON\n\nShuttles Freedom and Independence shoot toward the Moon, pulled \nby the lunar  gravitational field.\n\nINT. SHUTTLE FREEDOM - COCKPIT\n\nTHROUGH THE WINDSHIELD - THE LUNAR SURFACE is only 150 miles \ndown, looking close  enough to reach down and touch.\n\nEXT. SPACE - APPROACHING THE MOON\n\nThe two Shuttles whip into lunar orbit, moving around the Moon, \ncontinuing to  accelerate, nearing its Dark side.\n\nINT. N.A.S.A. - MISSION CONTROL\n\nClark \n(into headset)\n How we doin', Freedom, over?\n\nINT. SHUTTLE FREEDOM - COCKPIT\n\nWatts Nearing the Dark Side, Houston, a minute thirty and \ncounting.\n\nEXT. SPACE - THE OTHER SIDE OF THE MOON\n\nOn the Moon's opposite side, THE ASTEROID roars into frame, its \ntrailing  fragments motionless in relation to each other, \ntravelling as a swarm, a cluster  of debris. As it nears the \nMoon's gravitational field -- \n\nTRAILING FRAGMENTS peel away, drawn into the Moon by its lunar \ngravity. A  relatively DEBRIS-LESS CORRIDOR begins to form on one \nside of the asteroid. \n\nINT. N.A.S.A. - MISSION CONTROL\n\nSkip Twenty seconds till we lose radio contact, Director.\n\nClark You're on your own, Willie. You've got to raise your \nvelocity 17  thousand miles an hour or you won't catch the \ntarget, over. \n\nINT. SHUTTLE FREEDOM - COCKPIT\n\nSharp See you on the other side, Houston.\n\nSkip \n(V.O)\n Entering Dark Side, Freedom, and counting: ten, nine, eight,  \nseven...\n\nINT. N.A.S.A. - MISSION CONTROL\n\nSkip Radio contact terminated.\n\nThe radio crackles with STATIC. ON THE TECHNICIAN'S CONSOLES, all \nof Freedom's  and Independence's COMPUTERIZED SYSTEM MONITORS \n(pressurization, oxygen,  electrical power, fuel capacity, etc.)\n GO DEAD. \n\nGolden They'll be pullin' nine and half G's for eleven minutes, \nGeneral.\n\nTemple Anyone done that before?\n\nFlip Yeah. That Russian monkey in 1957.\n\nClark We'll pick 'em up again in sixteen minutes, Danny.\n\nGolden If they're still alive.\n\nINT. SHUTTLE FREEDOM - AROUND DARK SIDE OF MOON\n\nThe radio is STATIC.\n\nWatts Rockets ready for burn, Willie.\n\nSharp \n(over shoulder to Harry and others)\n Time to suck it up, people. Just  pretend you're on the big \nroller coaster at Disneyland...\n(mumbles under breath)\n  ...times a  hundred.... \n\nSharp reaches for the BOOSTER ROCKET SWITCH. He gives Watts one \nlast look, then  throws the switch. \n\nEXT. DARK SIDE OF THE MOON - FREEDOM AND INDEPENDENCE \n\nFreedom and Independence fire their BOOSTERS. The two SHUTTLES \nexplode forward,  hurtling around the Moon's DARK SIDE with a \ndegree of increasing velocity never  before experienced by man. \n\nINT. SHUTTLE FREEDOM - REAR CABIN\n\nHarry, Chick, Bear, and Max get hit with the first G-Forces. \nTheir torsos press  back against their seats. They flex their \narms, breathing deeply, expanding  their chest cavities as they \nwere taught in training. \n\nHarry I hate to fly, I hate to fly, I hate to fly....\n\nINT. SHUTTLE INDEPENDENCE - REAR CABIN \n\nA.J., Lev, Bennie, Jimbo, and Tito get slammed back by the first \nwave of  G-Forces. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nWatts reads her VELOCITY INDICATOR under G-Forces so bad she \nspeaks through  clenched teeth\n\nWatts Fourteen thousand....sixteen thousand...twenty thousand \nmiles an hour,  Willie...! \n\nINT. N.A.S.A. - MISSION CONTROL\n\nSilence. Tension. Technicians stare at their consoles.\n\nClark They're hittin' the big G's right about...now.\n\nGolden Come on, Willie, you can do this....\n\nINT. SHUTTLE FREEDOM - REAR CABIN\n\nExcruciating, gut-wrenching, turn-your-intestines-inside-out G-\nForces. HARRY and  CHICK'S FACIAL MUSCLES distort hideously; \ntheir rubbery cheeks and lips flatten  out. They continue anti-G \nexercises, tensing every muscle, trying to keep blood  flow \nevenly distributed. \n\nINT. SHUTTLE INDEPENDENCE\n\nA.J. and Bennie's distorted faces, likewise, go through the anti \nG-Force  exercises, tensing every muscle.\n\nEXT. LUNAR ORBIT - MASTER SHOT\n\nIN ONE AWE-INSPIRING SHOT, we see -- \n\nShuttles Freedom and Independence rocketing around the Moon in \ndarkness, further  and further, until finally WE SEE, \nincreasingly, a staggering, mind blowing  visual -- \n\nTHE ASTEROID'S TRAILING DEBRIS appears, a HUGE CLOUD of tiny ICE \nCHUNKS AND  PEBBLES, and much larger BOULDERS, and ICEBERGS the \nsize of houses, the ice  glinting with reflected sunlight, \nthrowing off a dazzling SPECTRAL SHOWER OF  LIGHT in all \ndirections, and finally -- \n\nTHE ASTEROID'S HUGE CORE - it has just cleared the Moon and now \nflies straight  for it's destination - the cool, blue PLANET \nEARTH dead ahead across an expanse  of space. \n\nShuttles Freedom and Independence slingshot out of the Lunar \norbit and fall in  behind the asteroid, settling into the DEBRIS-\nLESS CORRIDOR. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nContinued STATIC on the radio. Everyone sits nervously waiting. \nSuddenly the  shuttles' computerised SYSTEM MONITORS begin to \nclick back on. \n\nClark Freedom, come in, over. Independence, come in, over.\n\nNothing. Golden grabs the mike.\n\nGolden Willie? Come in, over. Willie, can you hear me...? \n\nTotal silence. A pin could drop. The N.A.S.A. Technicians stare \nnervously at the  Central Board. \n\nThen, suddenly through static\n\nSharp \n(V.0)\n Houston, you gotta see this to believe it.... \n\nElation. Held breaths are exhaled. Golden and N.A.S.A. \nTECHNICIANS smile. No one  is more relieved than Grace. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nSharp and Watts stare through the windshield at -- \n\nTHE ASTEROID, below them and dead ahead. We get our first \n(and only temporary)\n  clear glimpse of the designated landing field, a relatively \nsmooth, unobstructed  plane on the asteroid's surface. \n\nHarry is green, looks like he's gonna blow chunks. \n\nSharp We're awake, we're not pukin'....\n(looks over shoulder at Harry)\n  ....well, Harry is. And we got a clear path to the target. \nHouston, over. \n\nINT. SHUTTLE INDEPENDENCE \n\nTruman smiles. \n\nTruman Copy that, Freedom. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nClark gives Golden a thumbs up. \n\nClark We'll take you in, guys. \n\nEXT. SHUTTLES FREEDOM AND INDEPENDENCE \n\nFreedom, in the lead, and Independence, following to the rear and \nside, descend  through the debris-less corridor to the waiting \nasteroid. \n\nSuddenly a CLOUD OF ICE AND PEBBLES wafts in front of the \nShuttles. \n\nINT. SHUTTLE FREEDOM COCKPIT \n\nIn one terrifying second, visibility is cut to twenty feet. Then \nBANG! BANG!  BANG! BANG! \n\nPEBBLES and SMALL ICE CHUNKS strike the windshield, chipping and \ndenting it. The  impacts are violent; the interior is buffeted \naround. It's the space equivalent  of bad hailstorm. \n\nSharp Damn it....! \n\nClark \n(V.O)\n What is it, Willie? \n\nSharp Problem, Houston. We've got debris all over us! \n\nREAR OF COCKPIT - Harry and the others, alarmed, are buffeted \naround violently. \n\nINT. SHUTTLE INDEPENDENCE - COCKPIT \n\nNo visibility here either. Ice chunks and pebbles BANG against \nthe windshield. \n\nTruman I've got no visibility. I've lost orientation to the \ntarget! \n\nSuddenly, as sudden as it came, the debris clears. \n\nBut a HUGE ICE BOULDER the size of a three-story building twirls \ninto  Independence's path. It hits a BOULDER which collides with \nanother. \n\nTruman Big guy! Dead ahead! \n\nTruman stabs his directional thruster button. Shuttle \nIndependence veers to the  right.... \n\nINT. SHUTTLE FREEDOM \n\nSharp hits his directional thruster, and Freedom veers to the \nleft.... \n\nEXT. THROUGH THE ASTEROID'S TAIL \n\nFreedom goes left, Independence right, splitting the ice boulder. \n\nFreedom clears the ice boulder by a foot. Independence, not so \nlucky, clips the  ice boulder, ripping her left thruster clean \noff. With one thruster,  Independence careens out of control, \ntwirling and spinning. \n\nINT. SHUTTLE INDEPENDENCE \n\nTruman \n(panicked)\n I lost left thruster! No control! I have no control! \n\nIn the Independence's cargo bay, one of the Armadillos RIPS free \nfrom its  moorings and plunges through the CARGO BAY DOORS. \n\nINT. SHUTTLE FREEDOM \n\nSharp steers Freedom past the ice boulder.\n\nWatts Where's the other ship....?!\n\nSuddenly the Independence, with a RIPPED OPEN CARGO BAY DOOR, \ncareens directly  across Freedom's path, filling Freedom's \ncockpit window, nearly colliding with  her. \n\nSharp hits his thrusters, veering away from the damaged \nIndependence. \n\nSharp and Watts watch Independence twirling toward the asteroid. \nSuddenly  BANG!!! \n\nThe INDEPENDENCE'S ERRANT ARMADILLO strikes the Freedom's nose, \nspider-webbing  the WINDSHIELD. Sharp and Watts recoil in terror. \nWatts SCREAMS. \n\nINT. SHUTTLE INDEPENDENCE \n\nThe fuselage is spinning. A.J., Bennie and the others are in \nterror. In the  cockpit, Truman SCREAMS over the radio\n\nTruman Houston, MAYDAY, MAYDAY, we're going down! \n\nThe Shuttle's roof collides with a rock. We hear SCRAPING METAL. \nThe CEILING  dents in, dislodging INTERIOR CEILING PANELS filled \nwith wires and electrical  components; they rain down on A.J. and \nthe others. \n\nChoas. The SPARKING CABIN fills with smoke. \n\nTruman Crew, go to life support! \n\nEveryone grabs for their HELMET, frantically trying to get them \non. A.J. gets  his on, but he can't lock his neck seal. He \nfidgets with the little SEAKL LOCKS. \n\nA.J. rips off the helmet. It slips from his fingers and floats \noff through the  zero-g cabin! \n\nA.J. Goddamn it! \n\nA.J. throws off his seat harnesses and goes after his helmet. In \nzero-gravity,  the sides of the twirling cockpit revolve around \nA.J. as he moves. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nWe hear a CACOPHONY OF VOICES and BANGING ROCKS against \nIndependence's fuselage. \n\n\n\nTruman MAYDAY, HOUSTON, MAYDAY....!! \n\nGolden and the N.A.S.A. personnel can only sit and listen, \nhorrified, impotent  to do anything..... \n\nINT. SHUTTLE INDEPENDENCE - REAR CABIN \n\nAT THE BACK OF THE CABIN - A.J. reaches his helmet and \nfrantically gets it back  on. The fuselage is still twirling \naround him. \n\nBennie, strapped in and freaking out, throws off his seat harness \nand bolts for  the SAFETY EMERGENCY HATCH equipped with EXPLOSIVE \nRELEASE CHARGES. \n\nTruman sees Bennie at the Emergency Hatch. BIG ROCKS smash off \nthe windshield in  front of Truman; the windshield's safety glass \nis weakened, splintered, to the  point of bursting. \n\nTruman Get away from that door!!!! \n\nBennie is wild-eyed, crazed. \n\nBennie Go to hell, man, I ain't dyin' on this thing!!!! \n\nA SERIES OF QUICK CUTS\n\nA ROCK SMASHES through the windshield, gouging into Truman. \nDepressurisation.  Truman and Co-pilot Weston are sucked out \nthrough the windshield. \n\nBennie BLOWS the Emergency Hatch's explosive charges. The hatch \ndoor pulls  Bennie out into space...to his death. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nFLASH CUTS Independence's System Monitors flash off \nPRESSURIZATION goes to  zero; CABIN OXYGEN goes to zero; \nINDIVIDUAL LIFE SUPPORT MONITORS go to zero. \n\nIndependence's radio transmissions are STATIC and PANICKED \nVOICES. Golden runs  down the aisle to Independence's monitors. \n\nSkip No cabin pressure! Systems-wide failure! \n\nINT. SHUTTLE FREEDOM - REAR CABIN \n\nHarry and the Roughnecks are SMASHED around in their seats. \n\nIN THE COCKPIT - THROUGH THE WINDSHIELD \n\nA BOULDER the size of a house looms downslope. Shuttle Freedom is \nskidding  straight for it. \n\nSharp and Watts watch helplessly as the Shuttle skids toward the \nboulder. \n\nEXT. ASTEROID SURFACE \n\nFreedom hits a SMALLER ROCK, which changes its skid angle. It \nclears the boulder  by a foot and skids to a stop at the base of \nthe slope. \n\nINT. SHUTTLE FREEDOM - REAR CABIN \n\nHarry and the others JOLT to a stop. No one moves. No one \nbreathes. It's scary  as hell. \n\nINT. N.A.S.A. - MISSION CONTROL Golden and the other Technicians \nwait  breathlessly for some response. Golden GRABS the mike.\n\nGolden Freedom. come in. \n(no response)\n Independence, come in . no response)\n  Come in, Freedom.\n\nNothing. Skip buries his face in his hands. Flip chews his \npencil. Golden,  having lost one crew already, twists his wedding \nring. \n\nSharp \n(V.O)\n Houston, it's Freedom. We just landed on this son-of-a-bitch,  \nover.\n\nGolden and the Technicians breath a sigh of relief.\n\nWatts \n(V.O)\n What's the status of Independence?\n\nINT. SHUTTLE FREEDOM - REAR CABIN\n\nCAMERA PUSHES IN ON HARRY, as he waits for Houston's response to \nthis last  question.\n\nSharp \n(V.O)\n We lost her.\n\nCAMERA TIGHT ON HARRY. He's lost men before, many men on oil \nrigs. But not  A.J.....\n\nChick \n(O.S.)\n Harry, Harry, Jesus Christ, this can't happen....\n\nHarry snaps out of it, turns to Chick.\n\nHarry It did happen. They're gone. Deal with it. We got a lot of \nwork to do.\n\nHarry unharnesses himself and rises.\n\nINT. N.A.S.A. - MISSION CONTROL\n\nGolden looks at Grace. She looks back. A tear slides off her \ncheek to the  console. Harry's daughter doesn't say a word, or \nbreak down. She just quietly  rises and walks to the back of the \nroom. Grace rubs her bare ring finger. A  BEAT. \n\nCAMERA SPIES the ZERO BARRIER CLOCK. Seven hours, 52 minutes, 000 \nfeet drilled.\n\nINT. SHUTTLE FREEDOM\n\nChick, Bear, and Max prepare to disembark, donning helmet and \nglove assemblies,  clicking neck and wrist seals into locking \nposition. \n\nHarry comes into the cockpit. Watts is flipping switches and \nreading gauges.  Sharp's on the radio. A haze fills the cockpit. \n\nWatts Engine ignition system isn't responding.\n\nINT. N.A.S.A. - MISSION CONTROL\n\nINTERCUT - FREEDOM/ MISSION CONTROL\n\nGolden What's the problem?\n\nFlip Engine ignition. Starting diagnostics.\n\nSharp Houston, I don't know where we are. Tell me how far we \novershot Harry's  sweep spot. Advise on currant location, over. \n\nSkip motions to Golden and Clark. They hurry over to his console. \nOn Skip's  computer screen is a MAP OF THE ASTEROID containing \nits geological fault lines. \n\nSkip They overshot their landing 26 miles. There's a different \nfault line, but  it's deeper.\n\nGolden How much deeper? \n\nSkip Two hundred feet. \n\nGolden exchanges a look with Temple. \n\nGolden Harry, your fault line's fifty yards off the starboard \nside. \n\nINT. SHUTTLE FREEDOM \n\nHarry stalks to the rear. \n\nHarry Rockhound. \n\nRockhound Yes, sir. \n\nHarry I'm gonna get you some surface samples and you're gonna \ntell me what I'm  up against. \n\nRockhound Rocks are my life. \n\nWatts Willie, we might be stuck. \n\nSharp exchanges grim looks with Pitts and Fisk over this bad \ninformation. \n\nHarry The good news just keeps comin'. Load up, guys. \n\nSharp watches Harry and the guys exit to the rear. \n\nEXT. ASTEROID SURFACE - SHUTTLE FREEDOM \n\nFreedom's cargo door opens; its RAMP unfolds to the asteroid's \nsurface. HARRY  looks out. \n\nFreedom is in a small, cold, dark valley. The asteroid's face is \ntilted away  from the Earth and Sun. THE MOON is huge on our rear \nhorizon. The place is  eerily calm and tranquil. Harry walks down \nthe ramp onto the asteroid surface. \n\nINT. FREEDOM CARGO BAY - INSIDE ARMADILLO \n\nChick, at the Armadillo's controls, engages gears. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nThe Armadillo rumbles out of the cargo bay, carrying Bear, Max, \nRockhound and  Pitts over the wheel wells. \n\nThe Armadillo drives 50 yards from Freedom and parks. The guys \nhop down, turning  on their PRO-GRAVITY THRUSTERS. Bear begins \noff-loading 20-foot long DRILLING  PIPES. \n\nHarry takes readings from a SEISMIC INSTRUMENT. Pulls out a SOIL \nSAMPLER, a  small shovel on a telescoping shaft. He digs it in \nwith his boot. Clang. It  doesn't dig in at all. He walks around, \nstabbing it into the ground. CLANG.  CLANG. \n\nChick exchanges nervous looks with Bear and Max. \n\nHarry Bedrock. Whole goddamn place is Bedrock. \n\nHarry examines the ground. Not satisfied. He finds a spot he \nlikes; digs an \"X\"  in the soil with his boot. \n\nHarry \n(cont'd)\n Here. Fire up the Bad Boy bit. \n\nChick, Max and Bear go into action. Max screws the Bad Boy bit \nonto the first  drilling pipe. Bear hoists the pipe up to the \nDRILLING MECHANISM, muscles it  onto the DRILL DRIVE, then clamps \nit on. \n\nHarry plugs a TEE and GOLF BALL into the craggy surface. He \nwaggles his club, a  5-IRON HEAD, screwed onto the soil sampler's \nshaft. \n\nPitts What's he doing? \n\nChick Wildcatters are superstitious, Colonel. Harry does this \nevery time we  break ground. \n\nHe swings....WHACK! The ball rockets off the tee and keeps \ngoing...and going... \n\nHarry HOLE NUMBER 77. Let 'er rip! \n\nChick throws a lever, lowering the BAD BOY BIT into the rocky, \nicy surface. Down  the drill pipe goes, unimpeded, 10 feet just \nlike that. It suddenly stops. It's  turning, but not drilling. \nBear and Max approach the drill hole. \n\nBear What in hell's down there?\n\nHarry Chick, bring 'er up!\n\nChick throws it in reverse. The DRILLING ARM reverses out of the \nhole. The Bad  Boy bot comes up CHEWED TO SHREDS. Harry and the \nguys examine the drill bit.  Everyone exchanges a worried look. \n\nMax The dream. It's my dream. \n\nHarry Shut up, Max. \n(looks at Bear)\n What's with the look? Get that off your  face. You've seen bits \nget eaten before. \n\nBear Not after ten feet. \n\nChick The first ten better be the worst ten. \n\nHarry Go to the Terminator. \n\nChick grabs Harry's mysterious METAL CASE. Harry pops open the \nmetal case,  revealing THE TERMINATOR, a super high-tech bit. \n\nHarry I designed you. I built you. You are the enemy of all \nsubterranean shit.  You are the king. It's showtime. \n\nHarry passes it to Bear, who screws it onto the drilling pipe, \nRockhound scoops  up a COLLECTION OF DOWNHOLE ROCK CHIPS. \n\nHarry \n(cont'd)\n Hit it, Chick. \n\nThe DRILL PIPE turns. Sediment comes WHOOSHING out of the hole \nand -- THE DRILL  PIPE descends like a bitch. \n\nINT. FREEDOM \n\nSharp, Watts, Pitts and Fisk have a PANEL removed, exposing the \nguts of  Freedom's wiring and components. Watts and Sharp are \ninside the panel, scrunched  against the fuselage wall, unbolting \na large COMPONENT. Watts hands Pitts and  Fisk a SMALLER \nCOMPONENT. \n\nWatts Unbolt the housing. There and there. \n\nINT. ARMADILLO \n\nThe rock CHIPS spew into the COLLECTOR in front of ROCKHOUND. \nHarry looks on. \n\nHarry What do you make of that? \n\nRockhound picks up several chips. Draws them close to his eyes. \n\nRockhound Oh my. Oh my, my, my. This isn't rock. It's uhh, it's \nuhh,  it's......iron. \n\nHarry Iron deposit? \n\nRockhound \n(shakes head)\n No. It's been melted. Forged rather. I've only seen  this once - \nat a volcano in Hawaii. \n(looks up at Harry)\n You're drilling into a  big slab of cast-iron, Mr. Stamper. \n\nINT. FREEDOM \n\nHarry picks up the radio. \n\nHarry Give me Dan Golden. \n\nINTERCUT - MISSION CONTROL / FREEDOM \n\nGolden's handed the phone. \n\nGolden Yeah, Harry. What's your situation? \n\nINTERCUT - GOLDEN AND TEMPLE IN MISSION CONTROL / HARRY ON \nFREEDOM \n\nHarry Situation? You put me down on the worst possible place on \nthis asteroid.  I'm drillin' into something I shouldn't. The hole \njust ate one of my  diamond-tipped bits in thirty minutes. That \nhas never happened to me in twenty years. \n\nGolden You're forty minutes in. You should be down 150 feet. How \nfar are you? \n\nHarry Not far. \n(beat)\n Twenty-three feet. \n\nCLOSE ON Golden as he looks at Temple. \n\nTemple This is an exercise in futility. \n\nGolden \n(to Harry)\n \"Don't tell me what you can't do, tell me what you can.\"  \nRemember that, Stamper? Go faster. \n\nHarry We will. \n\nGolden How? \n\nINT. FREEDOM CARGO BAY \n\nSharp and Pitts enter. Fisk hands Sharp the phone. \n\nSharp Sharp, over. \n\nPUSH IN on Sharp in EXTREME CLOSE-UP. His jaw tightens. His eyes \ndart. \n\nSharp \n(cont'd)\n Sir, the bird can't fly. \n\nTemple \n(V.O.)\n Well, you need to get it fixed unless you want to die along with  \nthat asteroid. \n\nA LONG PAUSE, as Sharp listens. \n\nSharp :\n(cont'd)\n Yes, sir. \n\nTemple \n(V.O.)\n And, I don't want those drillers knowing about this. They have  \nenough to worry about just drilling the damn ole. \n\nCollinswood \n(V.O.)\n Colonel Sharp, this is Chief of Staff Collinswood. Have  Pitts \nand Fisk prepare to detonate that nuke on the surface. Too many \nlives are  at stake here. Have them standing by. \n\nSharp On your order sir. \n\nEXT. ASTEROID SURFACE - A TINY VALLEY - ESTABLISHING \n\nThe gnarled WRECK OF SHUTTLE INDEPENDENCE lies below. Twisted \nmetal and cabin  materials strewn everywhere. \n\nINT. INDEPENDENCE CRASH SITE \n\nCAMERA moves through the wreckage of Independence. Nightmarish. \nEMERGENCY LIGHTS  still on battery flicker. The shattered \nwindshield; the blown emergency hatch; A  CORPSE lies face down, \nhelmet half on, half off; Independence's huge tubular  NUCLEAR \nDEVICE. \n\nSomething moves on the ceiling. REVEAL A.J. hanging upside down, \ncaught in the  twisted fuselage skin. A.J. cuts himself down. He \ntwirls to the ground. Sees  LEGS MOVING UNDER RUBBLE. \n\nA.J. throws off the rubble, revealing Lev, dazed but alive. A.J. \nhelps him to  his feet. \n\nLev What happened to the others.... \n\nA.J. and Lev move toward the cockpit. \n\nA.J. \n(grabs the radio)\n Freedom, come in, over. Freedom, come in, over....  Freedom...? \n(shaking head)\n It's you and me. \n\nA.J. smashes the radio in frustration. \n\nEXT. FREEDOM - DRILLING SITE \n\nChick and Bear screw on a new length of drill pipe. Chick engages \nthe gears. The  drill pipe descends. THE TERMINATOR is working. \nHarry approaches from the  shuttle. \n\nHarry How far? \n\nChick Almost 60 feet and startin' to kick ass! \n\nSuddenly GRRRR. CLANG. BANG. The drill pipe stops. Harry walks \nover to the hole. \n\n\n\nChick \n(cont'd)\n That did not sound good. \n\nHarry Increase r.p.m. \n\nChick throws the lever. The drill pipe turns faster, but still \ndoesn,t descend.  Harry and the guys crowd around the drilling \nhole. \n\nMax Freaky, man.\n\nBear I got one of those big-time crappy feelings about this.\n\nHarry We gotta get more power down to this bit. \n(thinks; looks up at Chick)\n  Full throttle.\n\nChick You sure?\n\nHarry Yeah, I'm sure.\n\nChick I don't think she can take it.\n\nHarry She's gonna have to.\n\nChick The last time we ran her at full throttle we ripped her up!\n\nHarry I don't have time to argue, Chick, now goddamn it, throttle \nup, or I'll  come up there and do it for you.\n\nChick reluctantly throws the lever to FULL THROTTLE. The TURBINE \nENGINE ROARS.  The DRILL PIPE turns faster in the hole. The \nTURBINE ENGINE is shaking the  Armadillo. The drill pipe is \ndescending again. Suddenly BANG!! The CLUTCH  rupture, spewing \nthe CLUTCH PLATES and GEARS into space.\n\nHarry Stop!\n\nChick throws it into reverse. Up comes THE TERMINATOR, CHEWED TO \nSHREDS. Bear  and Max look at it, then each other. Very worried \nnow. \n\nBear The Terminator's terminated.\n\nChick The clutch is dead.\n\nHarry We're goin' to the second rig.\n\nHarry stalks off toward the Shuttle.\n\nHarry \n(cont'd)\n We need the second Armadillo.\n\nSharp We'll bring it out to you.\n\nHarry moves to get his pipe tongs. Fisk and Pitts are next to the \nuncovered  nuclear bomb. Harry looks at the bomb.\n\nEXT. FREEDOM - DRILL SITE\n\nChick, Bear and Max listen to Harry over the inter-crew link. \n\nINTERCUT WITH ABOVE.\n\nINT. FREEDOM\n\nHarry Why don't we cut to the chase, fellahs? What the fuck is \ngoing on with  that other nuke?\n\nHarry stares at the nuclear weapon.\n\nSharp Stamper, if you can't drill the hole, we're detonating this \nthing on the  surface....\n\nChick and the guys eye each other. Harry walks off, pissed \noff....\n\nINT. MISSION CONTROL\n\nGolden and Clark are hunched over monitors. Two MILITARY AIDES \ncarrying a  NUCLEAR COMMAND LINK \n(FOOTBALL)\n SUITCASE.\n\nGolden, alarmed, tries to figure out what they have.\n\nINT. SHUTTLE FREEDOM\n\nChick, Bear and Max enter through the airlock. Everyone turns and \nstares at  Sharp. \n\nSharp There's no way in hell you're gonna get that hole dug, and \nyou know it. \n\nHarry Well, it wasn't my scientists that told me about the \nfucking fire  cracker inside the hand story. Are we detonating on \nthe surface or are we gonna  drill? \n\nBear I didn't come up here to die. \n\nChick I say we drill. They say we have until Zero Barrier. \n\nSharp \n(freaked out)\n That hole better be dug in two hours, or we're detonating.  \nWhether you're on this godforsaken rock or not! \n\nHarry We're drilling.\n\nHarry and his crew file out.\n\nINT. MISSION CONTROL - NIGHT\n\nGolden \n(to Temple)\n What is going on up there?\n\nTemple Your drillers aren't doing the job, Dan.\n\nGolden After 15 minutes? What do you expect?\n\nTemple Golden, we are preparing for surface detonation.\n\nGolden A surface detonation isn't going to do it, General. My \nscientists have  already told you that. It must be detonated \ninside the asteroid. The alternative  is that the Earth  will be \nbombarded by smaller matter which will be just as  catastrophic. \n\nTemple stares off pensively into the sky.\n\nTemple We have a lot better chance of surviving the \"smaller \nmatter.\" The  drillers have two hours \n(to the Aides)\n I want you ready on my command. \n\nThe Adjutants prepare the nuclear command link.\n\nMilitary Adjutant Sir, we have interface with the weapon. Remote \ndetonator  standing by.\n\nINT. INDEPENDENCE - CRASH SITE\n\nLev is sitting on the ground, head in his hands, completely \ndemoralised.\n\nLev I feel like Skywalker Luke when he learn Darth Vader his \nfather. What I  should do?\n\nA.J. Get up, we got work to do.\n\nLev A.J., let me cash in my chips.\n\nA.J. Lev, we're getting off this rock, if I have to drag your ass \nthe whole  way. \n(off Lev's look)\n Now get up! \n\nA.J. walks into the Independence cargo bay, detached from the \nnose section. Then  climbs into Independence's Armadillo. \n\nA.J. C'MON LEV, PUT YOUR WEIGHT INTO IT!\n\nEXT. INDEPENDENCE - WRECKAGE OF CARGO BAY\n\nLev is prying open the cargo bay ramp door \n(the hydraulics are shot)\n.\n\nLEV YOU COME PUSH, YANKEE....\n\nINT. - MISSION CONTROL\n\nGolden turns to Temple.\n\nGolden The asteroid's surface is heating up.\n\nTemple What does that mean?\n\nGolden It means they may not be able to work on the surface for \nmuch longer.  The temperatures will be unbearable. \n\nEXT. INDEPENDENCE - WRECKAGE OF CARGO BAY \n\nThe Armadillo, engine rumbling, is poised to roll Independence's \nlong tubular  NUCLEAR WEAPON which has been ejected with other \ndebris from the broken  fuselage. \n\nLev Wait A.J.! We drive over nuclear weapon and we finished \nbefore we started. \n\nA.J. So move it. \n\nLev jams a pipe between the ARMING DEVIC and the nuke. As he \nrolls the nuke  over, the arming device detaches, rips off, and \nclatters to the ground. \n\nINT. MISSION CONTROL \n\nTemple Golden, tell your drillers the clock is ticking. I have 6 \nbillion  people down here relying on them! \n\nIn the b.d. hangs a crayon drawing of sunny day by Temple's \ndaughter. \n\nTemple \n(cont'd)\n A lot of people are die.... \n\nINT. INDEPENDENCE - CRASH SITE \n\nThe ARMADILLO blasts through the cargo bay door. A.J. and Lev \nroll off away from  the Independence. \n\nA.J. cranes his neck looking out through the Armadillo. A RIDGE \nwith THRE TALL  SPIRES is in the distance, ringed with LIGHT from \nFreedom's FLOOD LIGHTS. \n\nA half-smile from A.J hope. \n\nINT. SHUTTLE FREEDOM \n\nSharp comes back from the cockpit, carrying the detonator. \nHarry's on the phone  to Golden. \n\nHarry ...You told me that the only way to deal with this hunk 'o \ncrud is to  get a nuke 1000 feet down. You sticking with that? \n\nGolden \n(V.O.)\n Firmly. \n\nHarry Great. Glad we have that understanding. \n\nGolden \n(V.O.)\n IF you're gonna pull this off, we have to have a little talk  \nabout time...and temperature. Zero Barrier's in two hours. \n\nHarry Wait...wait..what about temperature? When did temperatures \ncome into the  picture? \n\nGolden \n(V.O.)\n Harry, your suits are good upto 150 degrees Celsius.... \n\nHarry And...? How hot is it going to get? \n\nGolden \n(V.O.)\n We didn't anticipate you being on the asteroid so long. The  \nclock is ticking... \n\nHarry How hot is it going to get?! \n\nGolden \n(V.O.)\n Three hundred and fifty degrees. \n\nHarry's face drops. \n\nHarry Thanks for telling us now, Golden....I don't think my bits \ncan handle  those kind of temperatures.... \n\nINT. FREEDOM - CARGO BAY \n\nHarry clicks off the radio. \n\nWatts We've still gotta fix this shuttle, Stamper. \n\nHarry Give me some more good news. You've got two new assistants \nwho can fix  your shuttle. Bear, Max, hop to it. There's not a \nmachine they can't fix. We can  handle the hole from here. \n\nEXT. SHUTTLE FRREDOM\n\nThe airlock opens. Sharp and Pitts are led out by Harry.\n\nHarry Colonel Sharp, if we're going to blow this hole, you gotta \nhelp ME. I  need some more manpower....\n\nEXT. FREEDOM DRILL SITE - MINUTES LATER\n\nThe SECOND ARMADILLO rumbles out of Freedom's cargo bay. Chick \nand the  Roughnecks work like a NASCAR pit crew. Sharp and Pitts \nlay on their backs  holding down a 1000 pound axle, fighting \nzero-g. \n\nSuddenly, the ground begins to tremble.\n\nEXT. ASTEROID SURFACE - FRONT OF \"THREE SPIRES RIDGE\"\n\nA.J.'s ARMADILLO rumbles over a little hill revealing the RIDGE \nWTH THREE SPIRES  directly in front of them. THE SUN is moving \nover the asteroid's FAR HORIZON,  causing a \"sunrise.\" It is \nbreathtaking, spiritual...and frighteningly bright. \n\nINT. A.J.'S ARMADILLO\n\nA.J. Over the hill.\n\nSuddenly, the ground under the vehicle shakes sharply. A.J. stops \nthe Armadillo.\n\nThe ground around the vehicle heaves up and down. The GROUND \nSPLITS. One  TECTONIC PLATE rises 15 feet in the air. The ground \nbreaks like a wave, up and  down. \n\nINT. ASTEROID SURFACE - DRILLING SITE\n\nHere, too, the ground shakes. Bear, terrified, drops a DRILL \nPIPE. Max is shaken  to the ground.\n\nChick is nearly thrown off the Armadillo.\n\nChick Clear the rig!!!\n\nChick jumps down, bouncing. Everybody gets the hell away from the \ndrilling hole.\n\nINT. A.J.'S ARMADILLO\n\nThe asteroid shakes violently, throwing A.J. and Lev around the \ncab. ROCKS BANK  down on the Armadillo's top and hood. The \nASTEROID SURFACE continues splitting  apart across the slope's \nfall line. \n\nA.J. EARTHQUAKE!\n\nThe asteroid RUMBLES a few more seconds, then the quake slowly \nstops. All is  stll. \n\nA.J. \n(cont'd)\n Let's take a look. \n\nEXT. ASTEROID SURFACE \n\nLev gets out; he nervously paces back and forth across the lip of \nthe fissure. \n\nLev This bad. \n(repeating, mantra)\n Darth Vader. Darth Vader. \n\nA.J. Listen, Mr. Negative. Everyone thinks we're dead. We're not. \nSo, suck it  up. Because if we don't drill that hole, six billion \npeople are going to die.  And I'm not lettin' Harry Stamper get \nall the freaking credit for saving the world. \n(firm)\n  We're gona do this, then we're going home. \n\nLev I l-o-v-e this American confidence! Like John Wayne. \n(sotto)\n This why I  suspect you won Cold War. \n\nA.J. Hep me get these rocks over there. \n\nA.J. and Lev start dragging rocks to use as a \"kicker ramp\" for \nthe jump. Lev is  oblivious. They pull embedded rock out, \nrevealing DIAMONDS. A.J. holds up a  large chunk. \n\nA.J. \n(cont'd)\n This outta cut into a sweet wedding ring. \n\nLev \n(holding chunk)\n With this I can rebuild my MIR. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nChick, Bear, and Max cautiously approach the drill hole. \nEverything seems okay.  Chick climbs back up to the drill-drive \nplatform. \n\nChick Back to work! \n\nBear grabs the drill pipe and hoists it... back to work. \n\nEXT. ASTEROID SURFACE - \"THREE SPIRES RIDGE\" \n\nA.J. is walking along the GAPING, JAGGED FISSURE, 50 feet wide, \n50 feet deep,  stretching across the entire slope. \n\nLev This bad, this very bad, very, very bad... \n\nA.J. Stick a cork in it, Lev. I'm tryin' to think. \n\nA.J. stares at the fissure, his eyes roaming from the \nfissure...to the  Armadillo...back to the fissure. \n\nA.J. \n(cont'd)\n Hop on the back. Get our weight distributed better. \n\nLev \n(uncertain)\n And why to do this? \n\nA.J. Because I'm askin'. And turn your suit's thrusters off. \nTrust me, okay? \n\nA.J. gets in the Armadillo. Lev goes around back, climbs on the \nREAR BUMPER. He  clicks off his pressure suit's pro-gravity \nthrusters. \n\nLev Okey-doke. \n\nThe Armadillo begins backing down the slope. \n\nINT. A.J.'S ARMADILLO \n\nA.J. throws it in neutral. The Armadillo stops. \n\nA.J. Hey, Lev, we're gonna see what this Porche engine can do.... \n\nHe throws it in drive. The Armadillo lurches ahead. \n\nEXT. A.J..'S ARMADILLO - BACK BUMPER \n\nThe Armadillo's REAR TIRES CHURN FORWARD, slinging rocks and \ngravel which, in  zero-g, shoot off in a stream into space, never \nfalling. Lev holds on for dear  life. \n\nA.J.'S Armadillo churns up the slope like a Bronco 4X4, slinging \ngravel, heading  for THE JAGGED FISSURE. It FLIES over the \nfissure's edge as -- \n\nINT. A.J.'S ARMADILLO \n\n-- A.J. punches the Armadillo's PRO-GRAVITY THRUSTER \"OFF\" \nSWITCH. \n\nEXT. A.J.'S ARMADILLO - ROOF \n\n-- the Armadillo's roof-mounted PRO-GRAVITY THRUSTERS shut down. \n\nEXT. ASTEROID - \"THREE SPIRES RIDGE\" - JAGGED FISSURE \n\nThe Armadillo, no longer thrusting downwardly, flies across the \njagged fissure  in zero-g. The heavy steel vehicle doesn't fall. \nIt ascends, and amazingly,  shoots across the entire 50 foot \nexpanse of jagged fissure. \n\nEXT. A.J.'S ARMADILLO - BACK BUMPER \n\nLev looks down. The FISSURE passes beneath him, then SOLID GROUND \nagain. They've  cleared the fissure....but they're not coming \ndown. \n\nLev A.J., up is bad! Down! \n\nINT. A.J.'S ARMADILLO \n\nA.J. punches the PRO-GRAVITY THRUSTER \"START\" SWITCH. Nothing.... \n\nEXT. A.J.'S ARMADILLO - BACK BUMPER \n\nThe thruster nozzles SPUTTER, but no thrust. The Armadillo is 50 \nfeet off the  ground and still ascending...into outer space. Lev, \nhis next stop being Planet  Mars, panics. He climbs the roof and \npeers inside the front windshield, POUNDING  ON THE WINDSHIELD. \n\nLev Down! Not up! Up is bad! Down! \n\nINT. A.J.'S ARMADILLO \n\nThe Armadillo continues lifting into space, from which there is \nno return. A.J.  toggles the \"start\" switch. The swtich's \nINDICATOR LIGHT FLICKERS. \n\nA.J. HOLD ON, LEV, I GOT HER WORKIN'!! \n\nEXT. A.J.'S ARMADILLO \n\nNot quite. Only the right-front and right-rear THRUSTER NOZZLES \nfire, pushing  the right side downward, rolling the Armadillo \nover on its side. Lev, on the  bumper, clings to the rear-mounted \nTOW WINCH AND CABLE ASSEMBLY. \n\nSuspended in zero-g, on its side and in mid-air, the Armadillo is \npushed by  thrusters, tires-first, against the SHEER, 90 DEGREE \nCLIFF FACE next to the  slope. All four Armadillo tires slam \nagainst the cliff. The Armadillo bounces  off. \n\nLev, grabbing the Armadillo's TOWING CABLE, flies off the rear. \nThe cable spools  out and LEV, hanging on for all he's worth, \nSLAMS against the cliff face and  descends.... \n\nINT. A.J.'S ARMADILLO \n\nA.J., lying sideways, keeps toggling the thruster START SWITCH. \nThe indicator  light finally FLASHES \"IN\" and A.J. rams it into \ndrive -- \n\nEXT. ASTEROID SURFACE - CLIFF FACE / ARMADILLO \n\n-- the Armadillo, all four thrusters now working, drives sideways \nacross the  cliff face dragging Lev, who bounces against the \ncliff face and gradually falls,  until he's bouncing on the \nasteroid surface. \n\nThe Armadillo finally falls down the cliff face and skids to a \nstop. \n\nINT. A.J.'S ARMADILLO \n\nA.J., shaken, takes a deep breath and gets out. \n\nEXT. A.J.'S ARMADILLO - REAR \n\nA.J. walks to the rear. Lev splayed out 50 feet from the back of \nthe Armadillo,  covered in asteroid surface dirt and grime, looks \nup at him. \n\nLev Very bad idea, A.J. \n\nEXT. FREEDOM - DRILLING SITE \n\nHarry orders his crew to start the drill up. The men drill a \nshitload of feet in  record time. They finally burst through the \nrock and hit easy sediment. \n\nThe asteroid is spinning toward sunlight. Here, too, there is a \nsunrise. Bear's  face sweats inside the helmet. Chick's vision \nbegins to blur. Tito takes a seat  on a nearby rock, exhausted. \n\nChick Mutha...it's getting warm. \n\nBear \n(worried)\n We got that sunrise, Harry. These bits are gonna fry up...... \n\nSuddenly the TRANSMISSION LINKAGE in the Armadillo BLOWS. \n\nHarry Goddamn it! \n(thinks)\n We'' take the tranny from the other rig! And if you  wanna \ncomplain about the heat, go to some other fucking \nasteroid....Toughen up. \n\nSharp \n(to Roughnecks)\n Let's move it.....let's go, guys. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nChick and Bear yank the detached good TRANSMISSION HOUSING from \ninside Armadillo  2 and carry it across to Armadillo 1. \n\nINT. ARMADILLO 1 - CABIN \n\nMax finishes unbolting the BROKEN TRANSMISSION HOUSING. He passes \nit to Chick  who dumps it on the surface. Sharp and Truman work \nwith Bear and Chick who feed  in the good transmission housing. \n\nMax presses the airlock. The doors close and the cabin \npressurises. Max clicks  off his helmet. He begins installing the \ntransmission housing and the linkage. \n\nEXT. ARMADILLO 1 \n\nChick and Bear, atop the drilling platform, begin installing the \nclutch plates  and transmission linkage. \n\nHarry Move guys, move it..... \n\nBolting, bolting, bolting, connecting, connecting..... \n\nINT. N.A.S.A. - MISSION CONTROL - DAY \n\nSkip is analysing the asteroid's THERMAL READINGS. A MULTI-\nCOLORED THERMAL IMAGE  MAP shows most of the asteroid is GREEN \n(no heat)\n, but around the chosen landing  site are numerous RED SPOTS \n(heat)\n. \n\nSkip Look at these thermals. This is BEFORE sunlight hits the \ndrill site.  She's really heating up.... \n\nINT. ARMADILLO \n\nMax is bolting. The DOWNHOLE PRESSURE GAUGE NEEDLE jolts. Max \ndoesn't see it. He  keeps working. \n\nEXT. DRILLING SITE \n\nHarry's watching the work. Out of the corner of his eye... THE \nDRILLING ARM  KICKS. Harry turns to it. Nothing happens. His eyes \nmove back to Chick and Bear,  then back to the drilling arm. It \nkicks up again. Just a few inches. \n\nHarry Chick. Unbolt the tranny. \n\nChick We just put it in. \n\nHarry Do it. NOW. \n\nChick, confused, starts unbolting the tranny. Suddenly the well \nkicks hard, one  foot high. Chick's jostled. BANG!! The RIG KICKS \nHARD, THREE FEET, bucking Chick  off. \n\nChick scrambles back up to the drill platform. \n\nThe ground shakes. a terrific TREMBLER rumbles through the \nvalley. Harry, Max  and Bear cling to the side of the Armadillo. \nChick's nearly thrown off. \n\nHarry \n(cont'd)\n GET THE TRANNY OUTTA THERE! WE LOSE THE TRANNY, WE'RE DEAD  \nMEN!! \n\nHarry climbs up to the DRILL PLATFORM. The GROUND SHAKES \nviolently, throwing  harry and Chick around the top of the drill \nplatform. \n\nHarry Max, you gotta get those bolts undone! \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax is furiously unbolting the TRANNY HOUSING. There are two \nbolts to go. He  ratches one off.... \n\nMax I'm doin' it, I'm doin' it. \n\nMax gets to the last bolt.... \n\nHarry \n(V.O.)\n Go Max, go Max, get the last bolt....! \n\nMax gets the last bolt undone. \n\nMax DONE!! \n\nEXT. ARMADILLO - DRILL PLATFORM \n\nChick and Harry pull the unfastened TRANNY HOUSING out of the \nArmadillo as -- \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax stares at the DOWNHOLE PRESSURE GAUGES, groping through the \ncompartment for  his helmet. \n\nMax Pressure's through the roof! Shit, where's my helmet....!? \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nSuddenly the DRILLING ARM jolts upward, lifting the ARMADILLO SIX \nFEET off the  ground. \n\nChick She's gonna blow! \n\nHarry MAX, GET THE HELL OUT OF THERE!!! \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax is thrown against a wall of the rear compartment. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nThe DRILLING ARM KICKS again, six feet this time, tossing the \nArmadillo over on  two wheels. \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax is SLAMMED against the wall again. Terrified, he grabs for \nhis helmet and  locks the NECK SEALS. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nA DEEP RUMBLING emanates from the drilling hole, coming seemingly \nfrom the  ASTEROID'S CORE. Harry gets to his feet and SLAMS HIS \nFIST against the  Armadillo's SIDE. \n\nHarry CLEAR THE RIG! \n\nEveryone scatters.... \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax, helmet on, is frantically scrambling to the airlock, but \nthere's no time... \n\n\n\nMax I CAN'T DEPRESSURIZE!! \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nWIth an awesome force, the DRILLING HOLE BLOWS. The DRILLING PIPE \nEXPLODES  upward, lifting the DRILLING ARM and the ENTIRE \nARMADILLO VEHICLE with it. THE  ENTIRE RIG blows upward into \nspace. \n\nINT. ARMADILLO - REAR COMPARTMENT \n\nMax punches the DOOR LOCK without depressurising the cabin and is \nsucked  violently out of the rear compartment into open space. \n\nEXT. SPACE OVER ASTEROID SURFACE \n\nFIFTY FEET OF DRILL PIPE, THE DRILLING ARM, and the entire \nARMADILLO RIG with  MAX trailing, BLOWS into space. MAX'S FACE is \na screaming mask of terror and  confusion, reaching out, but \nthere's no one to catch him....Harry and the guys  watch in \nhelpless silence as the drill rig and Max ascend into space. \n\nChick Max.....No. No. No. \n\nINT. N.A.S.A. - MISSION CONTROL - DAY \n\nSkip motions to Golden. He comes over. \n\nSkip They just lost the rig. The hole blew out. \n\nGolden takes the news stoically. He thinks, looking across the \nroom at Temple.  He looks at the clock. ONE HOUR AND FORTY \nMINUTES TO GO. \n\nGolden Say nothing. \n\nEXT. FREEDOM - DRILLING SITE \n\nSilence. A stark tableau. Harry and the men standing there, just \nwatching.  Devastated, confused, in shock. This is a total \ncatastrophe. The mission is  over. \n\nSharp nods to Pitts. Pitts picks up the REMOTE NUCLEAR DETONATOR. \n\nSharp Stamper, you ready to blow this? Let's get outta here...! \n\nHarry ignores him. He won't accept defeat. \n\nHarry Chick, get your butt over here. \n\nChick drags his ass over to Harry. \n\nChick Yeah. \n\nHarry We're gonna fix this - make it work. If we weld those two \ntogether and  go in one speed.... \n\nChick Harry.... \n\nHarry Get your ass up here! \n\nChick doesn't move. The two men stare at each other. \n\nChick I've been with you fourteen years. I've never said this to \nyou, never  thought I would. It's over. \n\nChick walks off toward the shuttle. Bear joins him. \n\nHarry, atop of the Armadillo, looks around. His head drops...he's \nburning up.  His fist clenches the HALF MEDALLION in his hand \n(where is it - clipped to suit  - in pouch of suit?)\n His eyes shut tightly. He is going to will victory from  defeat. \nHe will not give up. \n\nCAMERA'S at low angle, giving Harry a larger-than-life look. \n\nHarry hears something. A LOW RUMBLE. It is confusing. It sounds \nlike......an  ARMADILLO ENGINE. \n\nHarry opens his eyes. He slowly turns and looks -- \n\nACROSS THE VALLEY - ON THE DISTANT RIDGE - The front bumper of \nA.J.'s Armadillo  inches over the ridge crest. \n\nHARRY, for the first time on the asteroid, smiles. Miracles do \nhappen. \n\nHARRY CHICK...BEAR!!! \n\nChick and Bear about ready to enter the Freedom's airlock, stop \nand turn. They  see A.J.'S ARMADILLO ROARING down the hillside \nonto the drilling site. \n\nEXT. FREEDOM - DRILLING SITE \n\nA.J. and Lev roar up to the drilling site in the Independence's \nArmadillo. They  come down a hill spectacularly without brakes \nand it piles into shit, knocking  things down. \n\nLev and A.J. bounce up to Chick and Bear.....hugs and high-fives \ngo around. \n\nBear A.J. Frost. Back from the dead. \n\nChick Now you can die with us. \n\nHarry All the bits are gone, A.J. I've been inventing drill bits \nfor  twenty-five years and I don't know what to use. \n\nA.J. You wouldn't happen to need a diamond tipper, would you? \n\nA.J. pulls out the POUCH OF DIAMONDS, found on the ridge. \n\nHarry Boys, we're back in business! \n\nINT. N.A.S.A. - MISSION CONTROL - DAY \n\nGolden stares at the wall. Grace is curled up on a chair in the \ncorner. \n\nHarry \n(V.O.)\n We have good news folks. A.J. and the Russian just showed up. No  \nother survivors. \n\nGrace shuts her eyes, smiling. Sobbing. \n\nEXT. SHUTTLE FREEDOM - AFTERNOON \n\nChick shuts off an ARC WELDER and moves aside, letting Harry view \na DRILL BIT  with A.J.'S DIAMONDS mounted on the top like \ndiamonds in a ring setting. Harry  and the guys smile. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nThe NEWLY CREATED DRILL BIT lowers into the drilling hole and \nbegins turning. It  CHEWS into the shit down below, WHIRRING and \nRIPPING and......descends quickly. \n\nChick It worked! She's goin' through her like a hot knife through \nbutter! \n\nBEGIN MONTAGE\n\nThe men drill a shitload of feet in very little time. It is a \nfeverish pace,  their teamwork perfectly timed, as if \nchoreographed. \n\nQUICK CUTS\n\n--A.J. working the levers on the drill platform. \n\n--Hydraulic tongs clamping, unclamping on pipe. \n\n--Bear hoisting pipe. \n\n--Chick and Bear waiting with connecting pipe. \n\n--The drilling arm going up and down. \n\n--Newly connected drill pipes descending into the hole. \n\n--Harry watching, shouting orders. \n\n--There are serious wind storms, giving Harry, A.J., and the \nother guys  problems. So severe they knock guys across the \nasteroid. \n\nEND MONTAGE \n\nINT. MISSION CONTROL \n\nSkip looks at thermal readings with alarm. \n\nSkip Dan, the surface is heating up! \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry Time, A.J. \n\nA.J. One hour. \n\nHarry Distance, Chick. \n\nChick Eight hundred and twenty feet, Harry. \n\nHarry We gotta do 180 in thirty minutes. \n\nChick Downhole pressure's goin' through the roof! \n\nHarry Stop! Shut down. \n\nChick throws the lever. The drill pipe stops turning. \n\nA.J. Harry, we can't stop. \n\nHarry Got to, kid. No choice. \n\nA.J. Drill right through the pressure to pay dirt. \n\nHarry That's crazy. \n\nA.J. Sometimes crazy works. \n\nHarry and A.J. stare at each other. \n\nHarry Chick, A.J.'s callin' this one. \n\nA.J. Full throttle! \n\nChick throws the lever. The DRILL PIPE descends on full throttle. \n\nINT. N.A.S.A. - MISSION CONTROL - DAY \n\nAll the TECHNICIANS stand, staring at the CENTRAL BOARD, where a \ngraph shows the  drilling progress. \n\nFlip Nine hundred and eighty...Nine ninety...they're into the \nfault, they're  doing it. \n\nGolden looks at the CLOCK. THIRTY-ONE MINUTES TO GO. He twists \nhis wedding ring. \n\n\n\nGolden Now just get the thing in the hole. \n\nAll the TECHNICIANS stare at their monitors. The atmosphere is \nthick with  tension. Clark chews his nails. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nThe HOLE'S finished, the drill pipe's been pulled; A.J. drives \nthe ARMADILLO  safely away from the site. \n\nWatts and Sharp roll a GURNEY containing the NUCLEAR DEVICE \n(a massive stainless  steel tube)\n down Freedom's cargo bay RAMP toward the hole. Harry and all the  \nRoughnecks stand by the HOLE. \n\nHarry One thousand feet. \n\nChick \n(smiles)\n Thousand and three, Harry. With a half hour to spare. \n\nSharp and Watts roll the NUCLEAR DEVICE GURNEY past the \nRoughnecks up to the  drilling hole. \n\nHarry Get the pipe and bit outta there. \n\nChick gets inside the Armadillo. Grabs the stick-shift. \nCompresses the clutch  and throws it in reverse. \n\nTHE DRILL PIPE begins to reverse out of the hole. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nSkip She's gettin' hotter! Gotta mean gas - methane, helium, \nprobably water  vapor. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nThe DRILL PIPE turns sloely, retracting from the hole. Bear, atop \nthe drilling  platform, is working on something with a wrench. \n\nBear accidently drops his wrench. It falls on the turbine's \nRIPPED MESH  PROTECTIVE SCREEN and hangs there. Bear looks at it \nnervously and reaches...THE  WRENCH falls into the turbine \nspinning at six-thousand r.p.m. With a GRINDING  SQUEAL, the \nwrench shrapnel blows out of the turbine and -- \n\nTHE DRILLING ARM reverses speeds and VIOLENTLY THRUSTS THE PIPE \nFORWARD,  buckling it. A piece of the drill string is BLOWN OUT, \nsmashing into Sharp's  helmet, spider-webbing his faceshield. \nHe's out cold. \n\nHarry and the guys dive away from the hole. Chick, confused, \nworks the clutch  furiously to no avail. THE DRILLING ARM RAMS \nTHE PIPE back down the hole, where  it BUCKLES, BENDS AND BREAKS \nIN HALF. \n\nTito tends to Sharp..his face has lost all color. Harry \napproaches the hole.  Looks down. FIFTY FEET DOWN IS A MESS OF \nMANGLED PIPE, blocking the hole. \n\nINT. N.A.S.A. - MISSION CONTROL - DAY \n\nGolden continues looking at the THERMAL IMAGING. \n\nGolden Harry, c'mon, we got thirty minutes. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry Well, Dan, you're just going to have to goddamn wait 'CAUSE \nWE GOTTA BIG  PROBLEM UP HERE IN HELL. \n(turns to guys)\n Somebody's gotta go down there. \n\nChick Don't look at me. \n\nBear I can't even get my foot in there. \n\nHarry turns and eyes A.J.    A.J. stares down the hole. \n\nHarry Do or die, kid. \n\nCLOSE ON A.J. as he peers into the hole. \n\nA.J. Something I've been meaning to talk to you about. When this \nis all over  and we're back home, I'd like to marry your \ndaughter.... \n\nHarry stares at A.J., the look priceless. \n\nA.J. \n(cont'd)\n Maybe I'll ask her again later.... \n\nHarry turns around..looking up at the star-filled sky. A.J. walks \nover to  Sharp...who's coming to now. \n\nHarry \n(to Golden)\n Oh yeah, Golden? \n\nGolden \n(V.O.)\n Go ahead, Harry. \n\nHarry Your shuttle pilot just took a nasty shot from a drill \nstring.... \n\nGolden Is he alright? \n\nHarry I hope so, he's gotta get us off this shithole. \n\nINT. DRILLING HOLE \n\nA.J, tied to a SAFETY TETHER, comes down the hole with a HAND-\nHELD CUTTER and a  LENGTH OF ROPE. He reaches the obstruction. \nThe DRILL PIPE has been mashed,  bent, buckled. Severed ends stab \ninto the sides of the hole. A.J. starts cutting  with the hand-\nheld cutter. \n\nEXT. DRILLING HOLE \n\nThe guys stand there, watching. Nothing happens. Agonising \nseconds pass.  Suddenly the ground rumbles. Another EARTHQUAKE. \nIt slowly starts to subside. \n\nINT. DRILLING HOLE \n\nThe hole shakes. A.J. freezes, sweating. \n\nHarry \n(V.O.)\n A.J., we need you. I need everything you got. \n\nA.J. wrestles with the severed pipes, untangling them, tying the \nROPE to them.  He gives the rope a tug. Chick and Bear, above, \npull up the broken pipes. \n\nEXT. DRILLING HOLE \n\nSharp Enter interface with the weapon. \n\nPitts clicks a six digit code into a DIGITAL PAD on the DEVICE'S \nREMOTE  DETONATOR. \n\nPitts Device armed. \n\nThe NUCLEAR DEVICE has a small SLED with RATCHET WHEELS to let it \nslide down the  hole slowly. Sharp and Watts lift one end of the \ngurney. THE NUCLEAR DEVICE  slides off the gurney toward the \nMOUTH OF THE DRILLING HOLE. \n\nNT. N.A.S.A. - MISSION CONTROL - DAY \n\nThe thermal and seismic sensors BEING TRANSMITTED FROM FREEDOM \nSTART GOING CRAZY \n\n\n\nSkip It's a mess up there...! \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nANOTHER TEMBLOR hits, the worst yet, 9.7 on Earth. Watts falls, \nlosing her grip  on the gurney; her end collapses. THE NUCLEAR \nDEVICE lurches sideways off the  gurney and rolls away from the \ndrilling hole...... \n\nThe NUCLEAR DEVICE slides off the gurney.... \n\nINT. DRILLING HOLE \n\nA.J. experiences the DEEPEST, MOST SINISTER RUMBLE YET, emanating \nform the  asteroid's core, something from hell. There's a \nhorrendous WHOOSHING SOUND. \n\nA WINDSTORM OF PEBBLE, like a blowing tornado, whooshes up from \nthe hole,  smashing into A.J.'S FACESHIELD. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nEveryone whirls around in the sound's direction as -- \n\nACROSS THE VALLEY FLOOR - A 100 FOOT METHANE GEYSER erupts, \nspewing a PLUME OF  HIDEOUS GREENISH GAS into space. Then another \n200 FEET HIGH! Another 500 FEET  HIGH! The ASTEROID has become \nalive. The geyser's eruptions loosen the  asteroid's surface \nmaterial and -- \n\nINT. DRILLING HOLE \n\nA.J. THIS SUCKS.... \n\nA.J. is whooshed violently out of the hole. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nPEBBLES AND HOT STEAM BLASTS from the drilling hole. Everyone \nrecoils.... \n\nHarry Get back!! \n\nA.J. shoots out of the pipe, tethering the SAFETY LINE behind \nhim, blowing into  space. The safety tether snaps and RIPS off. \nA.J. is 70 feet off the surface.  Harry dives for his ripped \ntether. Catching it, inches before A.J.'s thrown into  space. \n\nHarry and Bear grab A.J.'s safety tether and begin to pull him \ndown. Chick  stares at something O.S., his jaw drops. \n\nChick This thing definitely doesn't like us. \n\nCHUNKS OF THE ASTEROID, some as big as trucks, others as big as \nhouses, dislodge  from the ASTEROID SURFACE and, slowly at first, \nbut with terrifyingly increasing  speed and momentum..... \n\n.... they start rolling. \n\nHARRY AND THE GUYS just stand there, disbelieving what they're \nseeing. \n\nOn come the ROCKS and ICE CHUNKS, rolling. As they hit smaller \nsurface rocks,  they take little hops, and bigger hops, until \nthey are BOUNDING across the  surface. Harry lashes A.J.'s tether \nto the Armadillo. \n\nHarry and the guys run for their lives. \n\nIn the midst of this -- \n\n-- A 500 FOOT HIGH GEYSER erupts next to the drilling hole. Pitts \ngets blasted  by the geyser, which blows him across the asteroid \nfloor, SLAMMING him into the  parked Armadillo. A BOULDER rolls \nat Pitts and squashes him against the  ARMADILLO , killing him. \n\nA 20 FOOT ICE BOULDER rolls toward A.J.'s SAFETY TETHER. \n\nA.J., suspended 70 feet off the asteroid surface, looks down at \nthe ONCOMING ICE  BOULDER. A.J., terrified, tries to unbuckle the \ntether, but he can't in time. \n\nThe boulder hits A.J.'s tether, rolling over it, flattening it to \nthe asteroid  surface, which causes -- \n\n--A.J., with a JOLT, to be yanked toward the surface. A.J. \nscrambles with his  safety harness. \n\nChick, next to the Armadillo, sees A.J.'s plight. He dives \ninside, engages the  gears. The Armadillo ROARS toward the \noncoming ICE BOULDER. \n\nA.J., terrified, continues to descend as -- \n\nChick, driving the Armadillo, rams the ICE BOULDER just as it's \nabout to roll  over A.J. The boulder hops up, SMASHES down on the \nArmadillo's hood, CRUSHING  the steel compartment around Chick, \nand gently rolls over onto -- \n\nA.J., who log-rolls under the Armadillo, as the ice boulder \nWHOMPS down and  keeps rolling. \n\nTHE NUCLEAR DEVICE is rolling across the asteroid's surface. \nPebbles and debris  CLANGING off the device's REMOTE \nDETONATOR..... \n\nHarry bounds toward the Armadillo. THE LARGEST, JAGGED ROCK rolls \nat the  vehicle. Harry's caught. There's no place to turn. The \nrocks rolls straight at  him. Twenty feet....10 feet....Harry \nFALLS heavily to the ground. \n\nHarry gets up and dives down inside a fox-hoe-sized INDENTATION \nin the asteroid  surface.... \n\nThe BOULDER rolls right over him. \n\nFinally the quake stops. The situation stabilises. Everyone gets \nto their feet.  Harry and A.J. get up. They look off at -- \n\nThe MASSIVE BOULDERS rolling away in the distance, smashing into \nother rock  formations. \n\nHarry picks up a DIAMOND. It SPARKLES in the light. Chick grabs \none. Holds it  up, marvelling at it. The MASSIVE BOULDERS rolling \naway in the distance,  smashing into other rock formations. \n\nHarry picks up a DIAMOND. It SPARKLES in the light. Chick grabs \none. Holds it  up, marvelling at it. \n\nSharp, with bruises on his face, looks through his cracked \nfaceshield down at  Pitt's corpse. \n\nSharp He's dead. \n\nHarry Put it down, Chick. \n\nChick tosses down the diamond and follows Harry. Everyone checks \nthemselves.  Looks at others. There's no talk, no time to lose. \nThey reconvene, by the  NUCLEAR DEVICE. It's dented. The \nalumniium gurney is smashed, mangled. \n\nSharp Three on that side, the rest over here. \n\nThey hoist the nuclear device and carry it to the drilling hole. \nThey plug one  end of the nuke in the drilling hole and lift the \nother. The NUKE begins to  insert down the hole. Suddenly Sharp \ntries to grab a TUBULAR PIECE OF ALUMINIUM  from the broken \ngurney. \n\nSharp \n(cont'd)\n Stop...! \n\n-- rams it into the wheels of the NUKE'S RATCHET-WHEEL DELIVERY \nSLED. The nuke  stops inserting into the hole. Sharp inspects the \nREMOTE DETONATOR. \n\nSharp \n(cont'd)\n The remote's shot. \n(looks up)\n It'll have to be manually  detonated. \n\nChick What's that mean? \n\nPause. \n\nHarry Means one of us ain't leaving. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nGolden addresses the room. \n\nGolden The situation: the hole is drilled but the remote \ndetonator is not  functional. One of the crew is going to stay \nbehind and....\n(deep breath)\n  ...manually detonate the device. \n\nGolden looks over at Grace. She is stunned. The news is just \nsinking in. \n\nGolden Don't stay for this. \n\nGrace I'm not leaving. \n\nTemple In 18 minutes we will be at Zero Barrier. \n(to Grace)\n Your father better  be a man of his word. \n\nINT. SHUTTLE FREEDOM - CABIN \n\nPAN FROM HARRY...to A.J. to...to Chick....to Lev...to Bear. \nEveryone is huddled  inside the cabin. \n\nThe SMASHED REMOTE DETONATOR, a 2000-foot spool-drum of \nELECTRICAL WIRE and a  KNIFE sit on the table. \n\nSharp \n(stoically)\n I'd trade places with any one of you. But we need two people  to \nfly this mother back. So, we either all stay or you guys draw. \n\nSharp raises a BUNDLE OF ELECTRICAL WIRES in his hand. The crew's \ngoing to draw  straws. The highest tension yet. No one breathes, \nno one moves. \n\nSharp Who's first? \n(no response)\n Clockwise then. \n\nSharp holds the WIRE STRAND BUNDLE in front of Lev. \n\nLev stares at it. He smiles nervously and reaches...and draws. \nThe strand is  LONG. Lev exhales. Next... \n\nChick, Chick stares at the bundle, sweating. He grabs a strand. \nPulls slowly.  LONG. He exhales. Next... \n\nBear. He stares at the bundle, thinking, choosing. He grabs and \npulls quickly,  decisively. LONG. Two strands remain, and two \nmen, Harry and A.J. It's A.J.'s  turn.... \n\nA.J. stares at the wire strands - not a bundle now. A.J. shifts \nin his chair.  The matter will be decided on this last pull. A.J. \nlooks at Harry. They lock  eyes. \n\nHarry Your turn. \n\nA.J. I ain't gonna draw against you Harry. \n\nChick \n(starts to get up)\n I can't watch this. \n\nHarry \n(stern, hard)\n Sit down, Chick. \n\nChick sits down. Harry looks at A.J. \n\nHarry Draw. \n\nA.J. stares at the two strands. Gets used to the idea. He reaches \nand begins to  pull. Stops. Chooses the other strand. And pulls. \nIt is SHORT. A.J. stares at  the SHORT STRAND OF WIRE in his \nhand. We see a fear on his face that gets  covered by a small \nsmile. \n\nA.J. Well, I guess I won. Now I'm the guy who gets to save the \nEarth. \n\nA.J. takes off the half medallion. Harry takes off his half \nmedallion. \n\nA.J. We said we'd join these after we drilled the hole. It just \nain't gonna be  on Earth. \n\nThey slide the two halves together to make a whole. Harry and \nA.J. exchange a  long look. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nWatts flips switches. Suddenly the jets ignite! \n\nWatts Ignition! She's started! \n\nINT. N.A.S.A. - MISSION CONTROL \n\nSkip turns to Golden excitedly. \n\nSkip They got Freedom goin'! \n\nINT. SHUTTLE FREEDOM - CARGO BAY \n\nA.J. and Harry stand in the airlock, helmets on. Harry carries \nthe two thousand  foot spool-drum of wire. The airlock opens. \nHarry and A.J. descend onto the  asteroid. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nGolden looks at the CLOCK running down - ten thirty-three... Ten \nthirty-two... Ten thirty-one... \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry and A.J. approach the NUCLEAR DEVICE. It's half in, half \nout of the  drilling hole, as they left it. Harry and A.J. \nalligator-clamp the end of the  wire spool-drum onto the nuke's \nDETONATION DEVICE. \n\nA.J You never answered my question. \n\nThey finish attaching the wire. \n\nA.J. pulls the piece of TUBULAR ALUMINIUM out of the nuke's \nratchet wheel  delivery sled. The NUKE descends downhole, slowly \nspooling out wire from the  SPOOL DRUM. \n\nA.J. About Grace, Harry. \n(laughs nervously)\n I know it ain't gonna happen now,  but....if things were \ndifferent...What would you say...? \n\nHarry walks back toward Freedom. A.J. follows. \n\nHarry I always wanted a son. And if I had....I'd want him to be \nlike you. \n\nHarry hands him the pipe section. \n\nHarry \n(cont'd)\n You're going to need some magic in the world. You can marry  \nher, A.J. \n\nA.J. laughs, being told at this dire time in his life. He looks \nat Harry with a  hint of bittersweet smile. \n\nA.J. Mean \"could have...?\" \n\nHarry No. Go home, A.J. Marry Grace. \n\nA.J. I'm not going home Harry. \n\nWith one hand, Harry stabs the airlock door, and then with a \nsmall pipe clamp,  rips A.J.'s air tubes off. \n\nHarry It's my hole, I drilled it, and I'm staying with it till \nthe end. \n\nHarry grabs him, throws his kicking, screaming body into the \nairlock. A.J. is  choking. \n\nHarry \n(cont'd)\n She's always going to be my little girl. \n\nThe door shuts automatically. Harry is now alone. \n\nINT. SHUTTLE FREEDOM - AIRLOCK \n\nA.J. explodes from the airlock into the cabin. \n\nA.J. Goddamn it, HARRY....! \n\nA.J. lunges for the airlock. \n\nSharp grabs A.J. with his good arm, helped by Bear..holding him \nback. \n\nA.J. LET ME GO....LET ME GO....!! \n\nSHARP YOU HAVE NO OXYGEN...YOUR TUBES ARE RIPPED...LET IT \nGO....!! \n\nA.J., sobbing, furious, POUNDS on the AIRLOCK WINDOW, staring at \nHarry outside. \n\nA.J. \n(pounding on the door)\n HARRY!! \n\nHarry turns and walks back to the drilling hole. Sharp looks at \nhim. \n\nSharp This guy really is a hero.... \n\nINT. N.A.S.A. - MISSION CONTROL REAR ROOM \n\nSkip Director? It's Mr. Stamper. He wants to talk to his \ndaughter. \n\nGolden looks over at Grace. Their eyes meet.... \n\nA N.A.S.A. Tech hands Grace a mike and exits. She stares at the \nstatic on the  monitor. Harry's face fades in and out. Grace \nknows something is very wrong from  her father's strained, tired \nface. She forces a smile. INTERCUT with Harry  inside the \nArmadillo\n\nGrace Daddy. \n\nHarry \n(V.O.)\n Grace. I...\n(sighs)\n This is so hard for me. I don't have.... \n\nTears start to well up in her eyes. \n\nHarry \n(V.O.)\n \n(cont'd)\n ...I just....want you to know how much I love you. \n\nGrace I'm so proud of you, Daddy. \n\nGrace wipes a tear from her face. \n\nHarry \n(V.O.)\n \n(looking at Earth)\n It's so beautiful up here. So pure. \n(swallows  hard)\n I remember something I read once...\"The world is a fine \nplace...and worth  fighting for.\"  looks at Earth, smiles)\n Gracie, I'm just an iron-ass-warrior doin'  what's best. \n(pause)\n Take care of A.J. I'll look in on you from time to time.... \n\nHarry pulls off the video link. Grace's monitors go black. Grace \ntouches the  monitor, as Harry's face fades away. \n\nHer knees buckle. She sinks to the floor. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry looks at the detonator in hand. \n\nHarry You have three minutes and I'm not waiting. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nWatts and Sharp settle into the cockpit and begin flipping \nswitches. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry, all business now, situates himself next to the nuke. The \nmanual detonator  in his hand. \n\nHarry Let's go, Sharp. Get the hell off this rock. I WILL push \nthis button. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nSharp hits the THRUSTER SWITCH. \n\nEXT. FREEDOM \n\nThe booster rockets SPUTTER and die. \n\nINT. FREEDOM - COCKPIT \n\nNothing happens. He HITS it again. Again. \n\nWatts unbuckles and goes to the ENGINE IGNITION SYSTEM. \n\nThe timer continues counting down to one thirty-four... One \nthirty-three... One thirty-two... \n\nINT. N.A.S.A. - MISSION CONTROL \n\nSkip The thrusters are down! 32 seconds. \n\nEXT. ASRTEROID SURFACE - DRILLING SITE \n\nHarry looks irritably at the SHUTTLE'S SPUTTERING THRUSTER. \n\nHarry Sharp, you better get those engines goin'. \n\nINT. SHUTTLE FREEDOM - SERVICE HATCH \n\nThe timer counts 23...22...21. \n\nWatts is frantically adjusting the FUEL MODULATOR'S VALVES... \n\nSharp Watts, we gotta get that thing going! \n\nWatts THE INTERIORR VALVE'S STUCK! \n\nLev crowds in next to her. \n\nWatts \n(cont'd)\n \n(to Lev)\n BACK OFF!! YOU DON'T KNOW THIS COMPONENT!! \n\nLev backs off. Keeps looking at the modulator, curiously. \n\nIN THE COCKPIT - the Timer reads 10...9...9...SHARP keeps hitting \nthe THRUSTER  SWITCH. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nGolden paces. Technicians stare pessimistically at consoles. \n\nGolden Stamper, you gave me your word. You have five seconds. \nPRESS THE  BUTTON! \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nTemple \n(V.O.)\n Sharp, I NEED A SOLUTION! \n\nBACK TO LEV , Watts and Sharp. \n\nSharp Sir with all due respect, if I knew the PROBLEM, I'd give a \nSOLUTION,  SIR..! \n\nTemple Well, find a solution!! \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry is looking at the shuttle. Close-Up on finger ready to pull \nthe trigger. \n\nHarry SHARP, WHAT THE HELL ARE YOU DOING? GET THE HELL OUT OF \nHERE! \n\nHarry's eyes close as the clock counts -10...-11...-12. \n\nTemple STAMPER DETONATE! \n\nINT. SHUTTLE FREEDOM - SERVICE HATCH \n\nLev \n(to Watts)\n WE HAVE JUST THE SAME SHIT PART IN RUSSIA!! SOMETIMES IT NOT  \nWORK SO WE HIT!! YOU GOTTA GIVE IT WHACK!! WHACK!! HIT!! \n\nWatts WHAT!!? \n\nLev GIVE IT WHACK!! \n\nLev grab a wrench and goes ballistic. SMASHES it down on the \ncomponent, AGAIN  and AGAIN and AGAIN. We hear JET FUEL COURSE \nthrough the component and -- \n\n-- SHARP hits the IGNITION SWITCH and the THRUSTERS FIRE. \n\nEXT. ASTEROID SURFACE - SHUTTLE FREEDOM \n\nShuttle Freedom lifts off the asteroid on full REVERSE THRUSTER \nPOWER, like a  Harrier jet. It ascends backwards, falling away \nfrom the asteroid, away from  Earth, toward the Moon. \n\nHarry is a solitary figure, left behind. \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nSharp, Watts, A.J., Lev and Bear watch Harry becoming smaller and \nsmaller on the  asteroid. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry takes his final breaths. Looks around. \n\nHarry All right, son-of-a-bitch, it's just you and me.... \n\nHarry's FINGER compresses on the detonator button.... \n\nA GEYSER OF STEAM next to the drilling hole BLAT up to five feet \naway. A SECOND  GEYSER, directly underneath Harry, BLOWS. The \nMANUAL DETONATOR flies from  Harry's hand as he's knocked \nbackward -- \n\n-- into the drilling hole! \n\nINT. DRILLING HOLE \n\nHarry falls ass-first down the hole, his PRO-GRAVITY THRUSTERS \npushing him  further and further down. Harry's FINGERS GOUGE into \nthe walls of the hole. He  scissors his legs. HIS BOOTS scrape \nthe sides. He begins climbing up out of the  hole....We see that \nhis air has been punctured. He's losing pressure. He starts  to \nchoke. \n\nINT. SHUTTLE FREEDOM \n\nThey've ascended to a safe distance. \n\nSharp Something's wrong. \n\nA.J. Don't worry. He'll come through. \n\nSharp We should have detonation by now. \n\nA.J. Harry doesn't fail. \n\nSharp We're going back. \n\nA.J. What? \n\nSharp Every life, that you know, will die....unless that nuke is \ndetonated. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHARRY'S GLOVED HANDS grip the sides of the hole. Then his helmet \nappears. He  looks across the asteroid surface to the MANUAL \nDETONATOR, lying in the dirt. \n\nThe nuke has now descended several hundred feet into the hole. \n\nINT. SHUTTLE FREEDOM \n\nWE MOVE DOWN the faces of the terrified men, looking down on the \ncraggy  asteroid.... \n\nChick \n(unsure)\n That means we might die too.... \n\nSharp Watts, prepare for re-landing. NOW!! \n\nWatts, frozen with fear, begins hitting switches. \n\nEXT. ASTEROID SURFACE - DRILLING SITE \n\nHarry crawls out of the hole. \n\nThe nuke is at the bottom of the hole. Harry runs, gasping for \nair, bounding  across the asteroid surface, dodging geysers and \nrolling debris. He dives for  the detonator. He stares long and \nhard. A TEAR wells in his eye. His finger  presses on the \ndetonator...sweat pours over his face.... \n\nHarry I beat you. \n\nSLOW-MOTION CLOSE-UP on Harry's finger as it presses the \ndetonator. \n\nEXT. SPACE \n\nThe nuclear device DETONATES. A spectacular concussion. The \nASTEROID SPLITS in  two halves, as planned, like a split diamond. \nThe TWO BLOWN PIECES wing off into  space, on new vector angles \nwhich might miss the Earth.... \n\nINT. SHUTTLE FREEDOM - COCKPIT \n\nThe detonation ROCKS the cabin. Everyone's violently buffeted \naround. \n\nWatts Houston, we have detonation! \n\nWatts fumbles for the reverse switches as the flames from the \nexplosion grow  CLOSER....She hits the directional THRUSTERS, \njamming it as hard as it will  go...the flames bite up at them. \nThe shuttle veers off toward Earth. \n\nA.J. Harry.... \n\nA.J. and the others stare out the cockpit window as the NUCLEAR \nFISSION  EXPLOSION FLAMES OUT, the halves of the asteroid wing \noff. \n\nEXT. AROUND THE WORLD - MONTAGE OF IMAGES \n\nIN EXTREME SLOW MO, we see images around the world. WALL STREET \ndeserted....a  crowded BAR with people huddled around a \nT.V....Extremely tight on a TEAR  falling form a woman's \nface....ENGLISH FARMERS in a corn field.....a FATHER  holding his \nSON as they watch the brilliant flaming sky....Golden closes his  \neyes and falls to his seat....Arms raise in unison....PEOPLE \nembrace....AT THE  PYRAMIDS, dappled in firelight, hundreds \npraying.... \n\nINT. N.A.S.A. - MISSION CONTROL \n\nGrace is quietly weeping. \n\nTHE ASTEROID'S DETONATION is computer-imaged on the Central \nBoard. WE SEE the  ASTEROID'S TWO HALVES, moving in new \ndirections. The Technicians stare in  wonderment. \n\nGolden Where are they, Flip? Give me some angles, give me some \ndirections,  give me speeds... \n\nFlip \n(analysing new data)\n The new courses are....they're gonna miss us! \n\nThe Technicians CHEER. Grace looks up. Wipes her tears. Golden \napproaches her. \n\nGolden I just want to tell you I'm proud to know the daughter of \nthe man who  just saved the world. \n\nEXT. ARIZONA - SHUTTLE LANDING AREA \n\nShuttle Freedom touches down. N.A.S.A. QUARANTINE VEHICLES race \nout to meet it. \n\nINT. N.A.S.A. - MISSION CONTROL \n\nN.A.S.A.TEHNICIANS sit at consoles, exhausted. There are Coke \ncans, coffee mugs,  cigarettes overflowing ashtrays. Jimbo, Theo \nand Pearl, wearing V.I.P. VISITORS  BUTTONS, stand at the back. \n\nJimbo This definitely doesn't look like a glamorous job. \n\nINT. SHUTTLE FREEDOM \n\nA.J., Chick and Bear unbuckle, begin to rise from seats. \n\nChick I'm dyin' for a Budweiser. \n\nSharp Stay seated. Let the medical quarantine trucks set up. \n\nBear I ain't gettin' another enema from Nurse Ratchet. \n\nA.J., Chick and Bear look at each other. \n\nA.J. What would Harry do? \n\nBear I think he'd go get a beer. \n\nEXT. SHUTTLE FREEDOM \n\nThe EMERGENCY HATCH DOOR BLOWS in front of surprised N.A.S.A. \nQUARANTINE  TECHNICIANS. \n\nEXT. ARIZONA - SHUTTLE LANDING AREA \n\nA.J., Chick and Bear walk away from the shuttle. All he N.A.S.A. \nQUARANTINE  MEDICS are looking for them. \n\nChick What are you lookin' at? \n\nBear Yeah, okay, you're right, we're the studs who just blew up \nthe Death  Star. \n\nA wave of fans are held back by MILITARY POLICE. \n\nSharp, holding his shoulder in pain, is helped across the tarmac \nby Watts. A VET  BYSTANDER comes up to Sharp and drapes an \nAmerican flag over his shoulders. \n\nTemple, with a huge grin, approaches Sharp. Temple salutes Sharp. \n\nAmong the masses, Chick catches sight of Denise. Tommy stands \nnext to her,  waving a small flag, proud as can be. \n\nGrace runs toward A.J.; he sees her and runs to her. \n\nThey fall into each others arms. Grace is crying. A.J. is crying. \nThey kiss.  A.J. looks up at the sky. \n\nA.J. He's up there, Grace. And he'll never die. Will you marry \nme? I gotcha a  new rock.... \n\nA.J. pulls out one of the DIAMONDS from the asteroid surface, as \nbig as a  doorknob, about two thousand karats. It glitters in the \nsunlight. Grace stares  at it, agog. \n\nAs we PULL BACK and CAMERA TILTS TO THE SKIES ABOVE. \n\nWhere Harry Stamper's soul remains..... \n\nTHE END\n\n\n\n\n\n\n\n\nArmageddon\nWriters :   Jonathan Hensleigh  J.J. Abrams\nGenres :   Action  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:41.695645"}