{"title": "Arsenic and Old Lace", "film_link": "/Movie Scripts/Arsenic and Old Lace Script.html", "script_link": "/scripts/Arsenic-and-Old-Lace.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Arsenic and Old Lace Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Arsenic-and-Old-Lace.jpg\" title=\"Arsenic and Old Lace Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Julius J. Epstein\" title=\"Scripts by Julius J. Epstein\">Julius J. Epstein</a><br/>  <a href=\"/writer.php?w=Philip G. Epstein\" title=\"Scripts by Philip G. Epstein\">Philip G. Epstein</a><br/>  <a href=\"/writer.php?w=Joseph Kesselring\" title=\"Scripts by Joseph Kesselring\">Joseph Kesselring</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/><br/>\n<b>Movie Release Date</b> : September 1944<br/>\n<b>Submitted by</b>: Dominique<br/>\n<br/>\n<a href=\"/scripts/Arsenic-and-Old-Lace.html\">Read \"Arsenic and Old Lace\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n<b>                         ARSENIC AND OLD LACE\r\n</b>\r\n\r\n\r\n                              Written by\r\n\r\n                     Julius J. &amp; Philip G. Epstein\r\n\r\n\r\n\r\n                        Adapted from the play by\r\n\r\n                           Joseph Kesselring\r\n\r\n\r\n<b>   CREDITS\r\n</b>\r\n   Credits roll, in white letters, on several funny cartoons, all of\r\n   them about witches and witchcraft (a caldron over a fire, with two\r\n   witches on either side of it - A close-up of one of the witches -\r\n   A witches falling down from the sky on her broomstick, and loosing\r\n   her hat in the fall - A furious black cat spitting at an owl\r\n   seated on a branch - A carafe with two glasses, actually a direct\r\n   reference to the film - An Halloween pumpkin pressing her two\r\n   forefingers in its ears, with music notes around it - Black bats\r\n   flying over a village).\r\n\r\n<b>   BROOKLYN - GENERAL OVERVIEW - EXTERIOR DAY\r\n</b>\r\n   A general overview of Brooklyn, near New York, seen from the roof\r\n   of a very high building. Written in white letters on this\r\n   overview, the following words :\r\n\r\n                         This is a Hallowe'en\r\n                       tale of Brooklyn, where\r\n                        anything can happen--\r\n                         and it usually does.\r\n\r\n   Then :\r\n                           At 3 P.M. on this\r\n                         particular day, this\r\n                             was happening-\r\n\r\n   Several white circles move on the screen, then the whole screen is\r\n   covered by a huge base ball, with «Brooklyn» written on it in\r\n   black letters.\r\n\r\n<b>   BASEBALL GAME - SPECTATORS - EXTERIOR DAY\r\n</b>\r\n   Close-up of the face of man, screaming :\r\n\r\n<b>          BASEBALL FAN\r\n</b>          I'll knock your block off, you big stiff ! You're a bum !\r\n\r\n   The camera moves away, so we can see the other baseball spectators\r\n   behind the first one.\r\n\r\n<b>   BASEBALL FIELD - EXTERIOR DAY\r\n</b>\r\n   General view of a baseball field, where a game is being played.\r\n   Follow several very quick sequences (one or two seconds each) : A\r\n   general view of the spectators. Then a player throwing a ball.\r\n   Then a very excited brass band playing. Then a few very excited\r\n   spectators. Then another player throwing a ball.\r\n\r\n   Finally we see a batter missing his ball. We hear the Umpire,\r\n   standing behind the catcher and heavily covered with a protection\r\n   suit, yelling :\r\n\r\n<b>       THE UMPIRE\r\n</b>       Strike ! You're out !\r\n\r\n   The batter, who missed the ball, drops his bat on the ground and\r\n   comes back to the Umpire. He tears the Umpire helmet and mask\r\n   away, and gives him a good punch in the nose. The Umpire falls on\r\n   the ground. The catcher then hits the batter. The Umpire rises\r\n   slowly from the ground.\r\n\r\n   Several very quick sequences : The ball-thrower drops his glove\r\n   and runs to the fight. Then several excited spectators stand up to\r\n   join the fight. Several player, who were waiting for their turn to\r\n   go on the field, also run to the fight. Then a view of the fight,\r\n   where all the players are hitting each other. Then the popcorn\r\n   seller, dropping his basket to join the fight. Then spectators\r\n   jumping over the balustrades to join the fight. Then another view\r\n   of the players fighting. Then a final view of the Umpire, laying\r\n   on the field and leaning on one elbow, and quietly munching some\r\n   food.\r\n\r\n<b>   NEW YORK - A BRIDGE - EXTERIOR DAY\r\n</b>\r\n   We see a large view of a bridge with a white boat passing\r\n   underneath. Written in large white letters on the screen, the\r\n   words :\r\n\r\n                      While at the same time\r\n                     across the river in the\r\n<b>                        UNITED STATE PROPER\r\n</b>                      there was a romance in\r\n                              the air.\r\n\r\n<b>MARRIAGE LICENSE BUREAU - INTERIOR DAY\r\n</b>\r\nClose-up on the sign «MARRIAGE LICENSE BUREAU», with people\r\npassing underneath.\r\n\r\n<b>       AN EXCITED GIRL VOICE\r\n</b>       Elmer, here it is.\r\n\r\n<b>       A MORE QUIET MALE VOICE\r\n</b>       I knew you'd find it.\r\n\r\n<b>       ANOTHER MALE VOICE\r\n</b>       Boy, I could sure use a drink.\r\n\r\nThe camera gets down from the sign to floor level. Two journalists\r\nare approaching, one equipped with a camera.\r\n\r\n<b>       THE PHOTOGRAPHER\r\n</b>       I wonder if any big shots are getting married today ?\r\nThey stop at the door of the room.\r\n\r\nLarger view of the room, where several people are, either standing\r\nin a queue, either sitting at a table and filling forms, either\r\nchatting in groups of two or three\r\n\r\nBack to the two journalists still standing a the door.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       Looks like the same suckers get married every day.\r\n\r\nHe looks around for a few second, then starts to move away.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       Come on.\r\n\r\nThe photographer makes him come back. He points to someone in the\r\nroom.\r\n\r\n<b>       THE PHOTOGRAPHER\r\n</b>       Hey, the guy with the cheaters.\r\n\r\nIn a line of people queueing in front of a counter, we see\r\nMortimer Brewster, with a hat and a pair of large dark glasses. He\r\nturns around and notices the two journalists looking at him. He\r\nraises the collar of his black coat to try to hide his face. The\r\ngirl in front of him turns around to look at him. She has blonde\r\ncurly hair and wears a hat with a strange white feather. She is\r\nElaine Harper. With both his hands, Mortimer turns her face back\r\ntoward the counter.\r\n\r\nBack to the two journalists at the door of the room.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       Now what's he hiding from ?\r\n\r\nHe starts moving to get a better look at Mortimer.\r\nMortimer moves in front of Elaine, who smiles.\r\n\r\nThe two journalists are now in the room, and they look at\r\nMortimer.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       Hey, isn't that Mortimer Brewster?\r\n\r\n<b>       THE PHOTOGRAPHER\r\n</b>       Mortimer Brewster, the dramatic critic ?\r\n\r\nMortimer looks very embarrassed.\r\n\r\nBack to the two journalists.\r\n\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       No, it's not him. But what a scoop it would be ! The guy\r\n       who wrote The Bachelor's Bible finally getting hooked\r\n       himself. Nope. It's too good to be true. Come on, let's\r\n       snap the mayor in his new fire helmet and go home.\r\n<b>       THE PHOTOGRAPHER\r\n</b>       Hey, let's stick around, and see who the guy is.\r\n\r\nBack to the line of people waiting in front of the counter. The\r\nmarriage clerk is standing behind a set of metal bars. A couple of\r\npeople leaves the counter. It's now Mortimer and Elaine's turn.\r\nThe marriage clerk sings :\r\n\r\n<b>       THE CLERK\r\n</b>       \"Two by two they come and go. Hip hip hig hay !\"\r\n\r\nHe smiles to Mortimer and Elaine.\r\n\r\n<b>       THE CLERK\r\n</b>       Good morning, children. Your name, please ?\r\n\r\n<b>       ELAINE\r\n</b>       Elaine Harper.\r\n\r\nShe spoke in a very soft voice. The clerk put his hand around his\r\near.\r\n<b>        THE CLERK\r\n</b>        Speak a little louder.\r\n\r\nShe speaks louder.\r\n\r\n<b>       ELAINE\r\n</b>       Elaine Harper.\r\n\r\n<b>       THE CLERK\r\n</b>       Thank you. Yours ?\r\n\r\nMortimer comes very close to the bars above the counter and\r\nwhispers.\r\n\r\n<b>       MORTIMER\r\n</b>       Mortimer Brewster.\r\nThe clerk puts his hand back around his ear.\r\n\r\nThe two journalists are straining their own ears to be able to\r\nunderstand Mortimer's name\r\n\r\n<b>       THE CLERK\r\n</b>       How's that ?\r\n\r\nMortimer raises his glasses, but still whispers.\r\n\r\n<b>       MORTIMER\r\n</b>       Mortimer Brewster.\r\n\r\n<b>       THE CLERK\r\n</b>       Speak up, sonny. There's nothing to be afraid of.\r\n\r\nMortimer bends down, putting his chin at the counter level. Then\r\nhe stands up again, and opens the gate in front of the clerk. He\r\nknocks his head on the bar above the gate. He straightens his hat,\r\nand brings his face close to the clerk's one. He still whispers.\r\n<b>       MORTIMER\r\n</b>       I want to keep this undercover.\r\n\r\n<b>       THE CLERK\r\n</b>       Love her ? But of course you love her. You're going to\r\n       marry her, aren't you ?\r\n\r\n<b>       MORTIMER\r\n</b>       No-no, you don't understand. Come here, come.\r\n\r\nWith his finger, he signals the clerk to come close to him.\r\n\r\n<b>       MORTIMER\r\n</b>       You see, I don't want this to get out for a while. I'm\r\n       Mortimer Brewster.\r\n\r\n<b>       THE CLERK\r\n</b>       You're who ?\r\n\r\nMortimer stops controlling himself and starts yelling\r\n\r\n<b>       MORTIMER\r\n</b>       Mortimer Brew...\r\n\r\nHe doesn't finish telling his name, takes Elaine's hand, and runs\r\noutside the room, dragging Elaine behind him.\r\n\r\nThe two journalists react to the news.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       That's him !\r\n\r\nThey start running after Mortimer.\r\n\r\n<b>CORRIDOR OUTSIDE THE MARRIAGE BUREAU - INTERIOR DAY\r\n</b>\r\nStill dragging Elaine, Mortimer runs in the corridor.\r\n<b>       THE OTHER JOURNALIST\r\n</b>       (voice over)\r\n       Mister Brewster !\r\n\r\nMortimer pushes Elaine into a telephone booth and enters behind\r\nher. There is already a man in the booth who is using the phone.\r\nWith three people in the booth, Mortimer can hardly close the door\r\nbehind him.\r\n\r\nThe two journalists runs in the corridor.\r\n\r\n<b>       THE OTHER JOURNALIST\r\n</b>       Oh, Mister Brewster !\r\n\r\nBut they pass the booth without noticing that Mortimer is inside.\r\n\r\nIn the booth, the man, still holding the phone receiver, tries to\r\nprotest the intrusion.\r\n\r\n<b>       THE MAN ON THE PHONE\r\n</b>       Now, look...\r\nMortimer takes the receiver from him and speaks into it.\r\n\r\n<b>       MORTIMER\r\n</b>       Goodbye, dear.\r\n\r\nHe hangs up the receiver, and then pushes violently the man\r\noutside the booth. The man looks very angry, but doesn't try to\r\ncome back in the booth.\r\n\r\nIn the booth, a very exciter Mortimer is talking to Elaine.\r\n\r\n<b>       MORTIMER\r\n</b>       Don't you understand ? How can I marry you ? Me, the symbol\r\n       of bachelorhood. I've sneered at every love scene in every\r\n       play. I've written four million words against marriage !\r\n       Not only hooked, but to a minister's daughter, and not only\r\n       a minister's daughter but a girl from Brooklyn. And look at\r\n       the way you look ! What is that sort of contraption you've\r\n       got there ?\r\n\r\nHe taps on a pin on the lapel of Elaine's jacket.\r\n\r\n<b>       ELAINE\r\n</b>       That's a pin I borrowed from your aunts. You know what\r\n       they're saying, \"Something borrowed...\"\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, I know that \"Something borrowed, something blue.\"\r\n       Old, new. Rice and old shoes. Carry you over the threshold.\r\n       Niagara Falls. All that silly tripe I made fun for years.\r\n       Is this what I've come to ? I can't go through with it. I\r\n       won't marry you. And that's that.\r\n\r\nHe takes his glasses off. Elaine whispers :\r\n\r\n<b>       ELAINE\r\n</b>       Yes, Mortimer.\r\n<b>       MORTIMER\r\n</b>       What do you mean, «Yes, Mortimer» ? Aren't you insulted ?\r\n       Aren't you going to cry ? Aren't you going to make a\r\n       scene ?\r\n\r\n<b>       ELAINE\r\n</b>       No, Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       And don't «No, Mortimer» me, either ! Don't you see\r\n       marriage is a superstition. It's old-fashioned. It's...\r\n       a... a... Ohh !...\r\n\r\nHe kisses her very passionately.\r\n\r\nHe stops kissing her, and gets out of the booth, dragging her\r\nbehind him. They enter the marriage bureau.\r\n\r\n<b>MARRIAGE LICENSE BUREAU - INTERIOR DAY\r\n</b>\r\nThey get back a the end of the line of people waiting to be\r\nmarried.\r\nThe girl in front of Elaine winks to Elaine. Elaine winks back to\r\nher.\r\n\r\nA man in front of the girls turns toward Mortimer and smiles to\r\nhim, in a slightly idiotic way. Mortimer looks at him, a bit\r\nsurprised, and gives him a forced smile, showing his teeth.\r\n\r\n<b>BROOKLYN - RESIDENTIAL DISTRICT - EXTERIOR DAY\r\n</b>\r\nWe see a street in Brooklyn, in front of nice house. Written on\r\nthe screen in large white letters :\r\n\r\n                        And now, back to\r\n                     one of Brooklyn's most\r\n                      charming residential\r\n                           districts--\r\n\r\n<b>BROOKLYN - CHURCHYARD - EXTERIOR DAY\r\n</b>\r\nA churchyard, with a close-up on a tombstone : «Jacob John\r\nVendemeer died 1654». Written on the screen in large white\r\nletters :\r\n\r\n                      --From her in you're\r\n                           on your own.\r\n\r\nWe see the gate of the churchyard, with a plate that says : «This\r\ncemetery was established in april 1654»\r\n\r\nAlong this gate, two cops are doing their beat. The older one,\r\nSargent Brophy, is talking to the younger one, Officer Patrick\r\nO'Hara.\r\n\r\n<b>       BROPHY\r\n</b>       O'Hara, don't be a jerk. You don't seem to realize. I'm\r\n       turning over to you the nicest, the best beat in Brooklyn.\r\n       Now look at that old church. And them old houses.\r\n<b>       O'HARA\r\n</b>       Did George Washington ever do any sleeping around here ?\r\n\r\n<b>       BROPHY\r\n</b>       Of course he did. Well, this whole neighborhood just stinks\r\n       with atmosphere. And look at that old house there.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nWalking their beat, the two cops have come outside the Brewster\r\nsisters residence.\r\n\r\n<b>       O'HARA\r\n</b>       Are the original owners still over there ?\r\n\r\n<b>       BROPHY\r\n</b>       Now, don't crack wise about the Brewster sisters. They're\r\n       two of the dearest, sweetest, kindest old ladies that ever\r\n       walked the earth. They're out of this world. They're\r\n       like... they're like pressed rose leaves.\r\nThey have come near a police call box. Brophy takes a key out of\r\nhis pocket to open the box\r\n\r\n<b>       O'HARA\r\n</b>       Pressed rose leaves ?\r\n\r\nIn front of the house, there is a «Room for Rent» sign. While\r\nBrophy picks up the phone in the call box, O'Hara looks at the\r\nsign.\r\n\r\n<b>       O'HARA\r\n</b>       The old girls must be kind of hard up, huh ?\r\n\r\n<b>       BROPHY\r\n</b>       No, no. Their old man left them fixed for life. And don't\r\n       you call them «the girls», either.\r\n\r\nBrophy starts talking in the receiver of the call box.\r\n\r\n<b>       BROPHY\r\n</b>       Brophy. Is Lieutenant around ?\r\n\r\n<b>       O'HARA\r\n</b>       Then, so why here do they rent a room for ?\r\n\r\n<b>       BROPHY\r\n</b>       They don't rent rooms. But you can bet if anybody came\r\n       looking for a room, they wouldn't go away without a good\r\n       meal and probably a couple of bucks in their pockets.\r\n       That's just their way of digging up people to do good to.\r\n\r\nWe get a closer view of the front of the house. A large\r\nrectangular stone, with «Brewster» engraved on it. A group of\r\nchildren runs in front of the house.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nIn the forefront of the room, Teddy Brewster is playing Mozart's\r\nTurkish March on the harpsichord. He looks a bit like late\r\nPresident Theodore Roosevelt. And he is dressed like the President\r\nwas dressed on the official pictures we've got of him... And, like\r\nthe President, he is wearing a pince-nez.\r\n\r\nIn another corner of the room, Abby Brewster is having tea with\r\nReverend Harper, Elaine's father. She looks like an old English\r\nlady, a bit like Agatha Christie's Miss Marple.\r\n\r\n<b>       ABBY\r\n</b>       Reverend Harper, I do hope you don't disapprove of Mortimer\r\n       just because he's a dramatic critic and takes your daughter\r\n       to the theater every night.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       It's not so much that I disapprove of his being a critic,\r\n       but no man, no man with this published attitude on\r\n       marriage...\r\n\r\nClose-up on the book Reverend Harper just took on the table :\r\n«Marriage, a Fraud and a Failure, by Mortimer Brewster».\r\n<b>       REVEREND HARPER\r\n</b>       ...should take any man's daughter anyplace...\r\n\r\nHe sneezes.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       ...at any time.\r\n\r\nHe sneezes again, louder this time. Teddy stops playing and there\r\nis a puzzled look in his eyes.\r\n\r\n<b>       TEDDY\r\n</b>       I must be catching cold.\r\n\r\n<b>       ABBY\r\n</b>       (to Teddy)\r\n       No, dear. It was Reverend Harper who sneezed.\r\n       (to Reverend Harper)\r\n       Bless you.\r\n\r\nTeddy puts back in his pocket the handkerchief he had taken out\r\nand starts playing again.\r\n\r\n<b>       ABBY\r\n</b>       We mustn't be angry with Mortimer. He's so very much in\r\n       love with her. And Sister Martha and I are so happy about\r\n       it. He used to come to see us only occasionally, and now,\r\n       now he's in Brooklyn six nights a week.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nThe two cops, Brophy and O'Hara, are mounting the steps to the\r\nBrewster sisters house.\r\n\r\n<b>       BROPHY\r\n</b>       Remember now, watch your language.\r\n\r\n<b>       O'HARA\r\n</b>       Besides, you know I'm not a swearing man.\r\n\r\n<b>       BROPHY\r\n</b>       You'd be surprised what they'd consider swearing.\r\n\r\nHe rings the doorbell.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nAt the sound of the doorbell, Teddy stops playing.\r\n\r\n<b>       ABBY\r\n</b>       Oh, will you excuse me ?\r\n\r\nShe gets up from her armchair.\r\n\r\n<b>       ABBY\r\n</b>       No, no, Teddy, dear. Thank you. I'll go.\r\n\r\nShe goes to the door and opens it.\r\n\r\n<b>       ABBY\r\n</b>       Oh, come right in, Mr. Brophy.\r\n\r\nThe two cops get in.\r\n\r\n<b>       BROPHY\r\n</b>       Miss Abby, we came for the toys.\r\n\r\n<b>       ABBY\r\n</b>       Oh yes.\r\n\r\nO'Hara closes the door.\r\n\r\n<b>       BROPHY\r\n</b>       This is Officer O'Hara. He's taking over my beat.\r\n\r\n<b>       O'HARA\r\n</b>       How are you doing ?\r\n\r\n<b>       ABBY\r\n</b>       May I welcome you to our neighborhood, Mister O'Hara.\r\n\r\nTeddy, with his teacup in hand, joins the group. He speaks with a\r\nvery serious expression on his face.\r\n\r\n<b>       TEDDY\r\n</b>       Gentlemen, what news have you brought me ?\r\n\r\nBrophy salutes him and stands at attention.\r\n\r\n<b>       BROPHY\r\n</b>       Colonel, we have nothing to report.\r\n\r\nTeddy gives an intrigued look to O'Hara, who doesn't seem to\r\nunderstand. Brophy elbows him with the arm which is still\r\nsaluting.\r\n\r\n<b>       O'HARA\r\n</b>       Huh ?\r\nHe eventually understands what his Sargent is trying to tell him.\r\n\r\n<b>       O'HARA\r\n</b>       Oh no, absolutely nothing to report.\r\n\r\nHe salutes but with a less official attitude than his Sargent.\r\nTeddy smiles.\r\n\r\n<b>       TEDDY\r\n</b>       Splendid ! Thank you, gentlemen.\r\n       (very serious again)\r\n       At ease.\r\n\r\nBrophy puts his arm down. O'Hara looks at his Sargent with a\r\nperplexed expression, and takes longer to put his arm down\r\n\r\n<b>       ABBY\r\n</b>       You know the Reverend Doctor Harper from the church next\r\n       door ?\r\n\r\n<b>       BROPHY\r\n</b>       Hello, Reverend. This is Officer O'Hara, the new man on the\r\n       beat.\r\n\r\nTeddy looks at O'Hara with a puzzled expression.\r\n\r\n<b>       O'HARA\r\n</b>       How do you do, sir ? It's nice to meet you.\r\n\r\nO'Hara looks ill at ease under Teddy's stare.\r\n\r\n<b>       ABBY\r\n</b>       The toys are on the chair up here, by the library door.\r\n\r\nO'Hara moves toward the pile of toys. Teddy's eyes are following\r\nhim with the same puzzled expression. O'Hara feels less and less\r\nat ease.\r\n\r\n<b>       ABBY\r\n</b>       Oh, Teddy, will you run upstairs and bring down your Army\r\n       and Navy from Aunt Martha's room. They're all packed.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       That's splendid work you men do, fixing up discarded toys\r\n       for the kids at camp.\r\n\r\nTeddy, who has started to mount the stairs to the upper level,\r\nstops in his stride, pretends he is taking a sword out of a sheath\r\nat his side, points this imaginary sword in front of him and\r\nstarts running up the stairs, yelling :\r\n\r\n<b>       TEDDY\r\n</b>       Charge !\r\n\r\nWhen he arrives on the balcony, on which open the bedroom doors,\r\nhe rushes into his room and slams the door.\r\n\r\nWhile Bophy and Reverend Harper remain unmoved, O'Hara, who is\r\nstanding by the grandfather's clock, jumps and looks at the clock,\r\nwhich chimes once. The minute hand of the clock falls down to the\r\nhalf-hour position. O'Hara is very disturbed and points his stick\r\nto his Sargent, who seems to be totally unmoved by the event and\r\nlaughs with Reverend Harper and Abby.\r\n\r\n<b>       BROPHY\r\n</b>       It gives us something to do as we are sitting around the\r\n       station. You get tired of playing cards.\r\n\r\nAbby moves away from them to the grandfather's clock. She puts the\r\nminute hand back into its original position. Brophy and Reverend\r\nHarper joins her by the clock.\r\n\r\n<b>       BROPHY\r\n</b>       So these are the toys ?\r\n\r\nO'Hara picks up the box in which the toys are stocked.\r\n\r\n<b>       ABBY\r\n</b>       How's Missis Brophy ?\r\n\r\n<b>       BROPHY\r\n</b>       Oh, she's better, thank you. But a little weak, still.\r\n\r\n<b>       ABBY\r\n</b>       Well, I'll better get some beef broth for you to take to\r\n       her.\r\n\r\n<b>       BROPHY\r\n</b>       Oh, Miss Abby, please don't bother. You've done so much\r\n       already.\r\n\r\n<b>       ABBY\r\n</b>       Oh, Stuff and nonsense ! I won't be a minute.\r\n\r\nShe moves away and exits into the kitchen.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Gentlemen, if I know what pure kindness and absolute\r\n       generosity are, it's because I've known the Brewster\r\n       sisters.\r\n\r\nOn the balcony, Teddy gets out of his room with a bugle, and\r\nstarts playing it very loudly. O'Hara jumps and drops the box with\r\nthe toys on the floor. Reverend Harper and Brophy seem to be less\r\nmoved by the event.\r\n\r\nBrophy stands back and points his finger up to Teddy.\r\n\r\n<b>       BROPHY\r\n</b>       Oh, Teddy, you promised me you wouldn't do that anymore.\r\n\r\nTeddy, still standing on the balcony, answers him leaning on the\r\nbalustrade.\r\n\r\n<b>       TEDDY\r\n</b>       But I have to call a Cabinet meeting to get the release of\r\n       those supplies.\r\n\r\n<b>       BROPHY\r\n</b>       Now don't do that again. Do you hear me ?\r\n\r\nTeddy goes back into his room, slamming the door behind him. The\r\ngrandfather's clock chimes once, and the minute hand falls back to\r\nthe half-hour position. O'Hara jumps and looks at the clock.\r\n\r\n<b>       BROPHY\r\n</b>       He used to do that in the middle of the night, and\r\n       neighbors raised Cain with me. They're a little afraid of\r\n       him anyway.\r\n\r\n<b>       O'HARA\r\n</b>       Look, Sarge, I promised you I wouldn't swear, but what the\r\n       heck...\r\n\r\nHe stops in the middle of his sentence, gives a quick look to\r\nReverend Harper, and corrects himself.\r\n\r\n<b>       O'HARA\r\n</b>       ...What's going on here anyway ?\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Oh, he's quite harmless.\r\n\r\n<b>       BROPHY\r\n</b>       He thinks he's Teddy Roosevelt. So what, there's a lot of\r\n       worse guys he could think he was.\r\n\r\n<b>       O'HARA\r\n</b>       Huh ?\r\n\r\nO'Hara gives a quick look toward the upper landing, and then nods.\r\n\r\n<b>       O'HARA\r\n</b>       That's right. I'll make a note of it. He's a very\r\n       interesting character.\r\n\r\n<b>       BROPHY\r\n</b>       Isn't it a shame, Father, isn't it a shame, Reverend, that\r\n       a nice family like this should be hatching a cuckoo ?\r\n\r\nThe front door opens and Martha Brewster comes in. Like her\r\nsister, she looks like an old English lady. She is wearing a short\r\ncape and a hat, and she carries a cylindrical can with a handle.\r\n\r\nShe closes the door.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, well, now, isn't this nice !\r\n\r\nShe goes to Brophy and the Reverend.\r\n\r\n<b>       BROPHY\r\n</b>       Good afternoon, Miss Brewster.\r\n\r\n<b>       MARTHA\r\n</b>       How do you do, Mr Brophy ?\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Good afternoon, Miss Brewster.\r\nO'Hara has picked up the toys and he joins the group.\r\n\r\n<b>       MARTHA\r\n</b>       Reverend Harper, how do you do ?\r\n\r\n<b>       BROPHY\r\n</b>       Oh, Miss Martha, this is Officer O'Hara. He's taking over\r\n       my duties.\r\n\r\n<b>       O'HARA\r\n</b>       How do you do, ma'am ?\r\n\r\n<b>       MARTHA\r\n</b>       I'm very glad to know you.\r\n\r\nAbby comes out of the kitchen, carrying a cylindrical can, similar\r\nto the one her sister is carrying\r\n\r\n<b>       O'HARA\r\n</b>       Thank you.\r\nAbby joins the group.\r\n\r\n<b>       ABBY\r\n</b>       Oh, Martha, you're back.\r\n\r\nShe gives the can to Brophy. Meanwhile, Martha has taken her cape\r\noff.\r\n\r\n<b>       ABBY\r\n</b>       Here's the broth for Missis Brophy. Be sure it's good and\r\n       hot.\r\n\r\n<b>       BROPHY\r\n</b>       You bet I will, and thank you very much.\r\n\r\nTeddy is getting down the stairs, carrying a box full of toys\r\nunder his arm. He stops a few steps from floor level\r\n\r\n<b>       TEDDY\r\n</b>       The Army and Navy are ready for action.\r\n\r\nHe resumes his walking down the stairs.\r\n\r\n<b>       BROPHY\r\n</b>       Oh, Colonel, this is grand. It'll make a lot of kids happy.\r\n\r\nBrophy takes the box from Teddy. Teddy looks into the box O'Hara\r\nis carrying, and takes a model warship out of the box.\r\n\r\n<b>       TEDDY\r\n</b>       What's this ? The Oregon ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, Teddy, dear, put it back.\r\n\r\nShe has taken her hat off.\r\n\r\n<b>       TEDDY\r\n</b>       But the Oregon goes to Australia.\r\n\r\n<b>       ABBY\r\n</b>       Now, Teddy...\r\n\r\nTeddy tucks the model ship under his arm. O'Hara looks at him with\r\npuzzled eyes.\r\n\r\n<b>       TEDDY\r\n</b>       No, it goes to Australia.\r\n\r\n<b>       BROPHY\r\n</b>       These are lovely. Thank you very much.\r\n\r\n<b>       ABBY\r\n</b>       Not at all.\r\n\r\nBrophy moves toward the front door. O'Hara follows him, still\r\nlooking at Teddy. Teddy doesn't seem to like the way he looks at\r\nhim, and moves the toy ship away from him.\r\n\r\n<b>       BROPHY\r\n</b>       The children will go crazy.\r\n\r\nHe has reached the front door. Abby has moved near the door, ready\r\nto open it for him.\r\n\r\n<b>       ABBY\r\n</b>       Oh, now, don't mention it.\r\n\r\nO'Hara salutes Teddy.\r\n\r\n<b>       O'HARA\r\n</b>       Well... So long, Colonel.\r\n\r\nTeddy looks at him and then looks at Brophy, who doesn't salute\r\nhim. O'Hara elbows his Sargent with the arm which is saluting.\r\n\r\n<b>       O'HARA\r\n</b>       Hey, Sarge.\r\n\r\n<b>       BROPHY\r\n</b>       Hey ?\r\n\r\nBrophy looks at Teddy and understands the situation. He also\r\nsalutes Teddy.\r\n\r\n<b>       BROPHY\r\n</b>       Oh, yes.\r\n\r\nTeddy salutes them.\r\n\r\n<b>       TEDDY\r\n</b>       Dismissed !\r\n\r\nBrophy and O'Hara bring their arms down.\r\n\r\n<b>       BROPHY\r\n</b>       Well, goodbye and thank you.\r\n<b>       ABBY\r\n</b>       Good bye.\r\n\r\nAbby opens the front door. The two cops start going out, Brophy\r\nfirst.\r\n\r\n<b>       ABBY\r\n</b>       Careful of the step here now with the toys.\r\n\r\n<b>       BROPHY\r\n</b>       Good night.\r\n\r\nO'Hara goes out, and then comes one step back and shows his face\r\nbehind the door. He winks to Teddy. Teddy raises his eyebrows.\r\n\r\n<b>       TEDDY\r\n</b>       Young man, let that be a lesson to you.\r\n\r\nO'Hara chuckles, then makes a strange face, and goes out.\r\n\r\n<b>       ABBY\r\n</b>       Goodbye.\r\nShe closes the door, and goes back to her sister and Reverend\r\nHarper.\r\n\r\n<b>       ABBY\r\n</b>       Well...\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Well, I must be going.\r\n\r\nTeddy, still carrying his model warship, starts mounting the\r\nstairs, stops after a few steps, takes his imaginary sword out,\r\npoints it forward and runs upstairs, yelling :\r\n\r\n<b>       TEDDY\r\n</b>       Charge !\r\n\r\nHe reaches the balcony, turns toward the balustrade and yells.\r\n\r\n<b>       TEDDY\r\n</b>       Charge the blockhouse !\r\n\r\nHe goes into his room and slams the door behind him. We hear the\r\ngrandfather's clock chiming once.\r\n\r\nReverend Harper looks up at the balcony, then turns to the\r\nBrewster sisters with puzzled eyes.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Blockhouse ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, the stairs are always San Juan Hill.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Oh, I...\r\n\r\nBut Reverend Harper doesn't finish his sentence and sneezes very\r\nloudly. He takes his handkerchief out of his pocket to put it\r\nunder his nose.\r\n\r\n<b>       ABBY\r\n</b>       Bless you !\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Have you ever tried to persuade him he wasn't Teddy\r\n       Roosevelt ?\r\n\r\n<b>       ABBY\r\n</b>       Oh, no !\r\n\r\nShe goes to the grandfather's clock.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, he's so happy being Teddy Roosevelt.\r\n\r\nAbby moves the minute hand of the clock back in place.\r\n\r\n<b>       ABBY\r\n</b>       Oh, do you remember, Martha ?\r\nShe comes back to her sister and Reverend Harper.\r\n\r\n<b>       ABBY\r\n</b>       Once, a long time ago, we thought if he'd be George\r\n       Washington, it might be a change for him, and we suggested\r\n       it.\r\n\r\n<b>       MARTHA\r\n</b>       And do you know what happened ? He just stayed under his\r\n       bed for days and wouldn't be anybody.\r\n\r\nReverend Harper laughs.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Well, if he's happy, and what's more important, you're\r\n       happy...\r\n\r\nHe starts walking toward the front door, followed by the Brewster\r\nsisters. He reaches the door and opens it.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, our only worry for Teddy is after we are gone.\r\n\r\nThey all go out.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nThe three of them are coming out of the house.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Yes, indeed. That is quite a problem.\r\n\r\n<b>       ABBY\r\n</b>       But Mortimer's made all the arrangements for Teddy to go to\r\n       Happy Dale Sanitarium after we pass on.\r\n\r\n<b>       REVEREND HARPER\r\n</b>       Splendid idea ! A very pleasant place.\r\n\r\n<b>       MARTHA\r\n</b>       Yes...\r\n\r\nReverend Harper put his hat back on his head, and starts walking\r\ntoward his own house.\r\n\r\n<b>       ABBY\r\n</b>       Dear, sweet Reverend Harper.\r\n\r\nThe two sisters look at him. We see him cross the churchyard and\r\nenter his house.\r\n\r\n<b>       ABBY\r\n</b>       You know, Martha, I really do believe he's beginning to see\r\n       the light.\r\n\r\nThey start walking back to the door of their house.\r\n\r\n<b>       MARTHA\r\n</b>       I'm sure we needn't worry about him. He won't interfere\r\n       with our plans for Mortimer and Elaine.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nThe two sisters enter their house. Martha closes the door.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, did you just have tea ?\r\n\r\n<b>       ABBY\r\n</b>       Yes. And dinner's going to be late, too.\r\n\r\n<b>       MARTHA\r\n</b>       Ohh ! Why ?\r\n\r\nThey both turn their heads toward the stairs, because they just\r\nheard Teddy's door slamming.\r\n\r\n<b>       ABBY\r\n</b>       Teddy ?...\r\n\r\nShe goes to the stairs, followed by Martha. Teddy is coming down.\r\n\r\n<b>       ABBY\r\n</b>       Oh, Teddy, good news for you. You're going to Panama and\r\n       dig another lock for the canal.\r\n\r\nShe points her finger toward the cellar door. Martha seems\r\ndelighted by the news.\r\n\r\n<b>       TEDDY\r\n</b>       Delighted !\r\n\r\nHe rubs his hands\r\n\r\n<b>       TEDDY\r\n</b>       That's bully ! Just bully ! I shall prepare at once for the\r\n       journey.\r\nHe starts mounting the stairs, stops and goes back a few steps\r\ndown, takes his imaginary sword out, points it forward, and runs\r\nupstairs, yelling :\r\n\r\n<b>       TEDDY\r\n</b>       Charge !\r\n\r\nBefore Teddy slams his door, Abby put her hand on the face of the\r\nclock to prevent the minute hand falling down.\r\n\r\n<b>       MARTHA\r\n</b>       Abby ! While I was out ?\r\n\r\n<b>       ABBY\r\n</b>       Yes, dear. I just couldn't wait for you. I didn't know when\r\n       you'd be back, and Reverend Harper was coming.\r\n\r\n<b>       MARTHA\r\n</b>       But all by yourself.\r\n\r\n<b>       ABBY\r\n</b>       Oh, I got along fine.\r\n\r\n<b>       MARTHA\r\n</b>       I'll run right downstairs and see.\r\n\r\nShe goes to the cellar door.\r\n\r\n<b>       ABBY\r\n</b>       No, no, dear. There wasn't time. And I was all alone.\r\n\r\nMartha looks around in the room, then looks at her sister with\r\nquestioning eyes.\r\n\r\n<b>       MARTHA\r\n</b>       Well ?\r\n\r\n<b>       ABBY\r\n</b>       Martha, just look in the window-seat.\r\n\r\nShe points to the large chest-bench under the window. Martha seems\r\ndelighted and both sisters go to the window-seat. They bend down\r\nto raise the lid of the seat, when someone taps on the window\r\nabove the seat. The two sisters stand up and move the curtains\r\nrevealing Elaine's face.\r\n\r\n<b>       ABBY\r\n</b>       Oh ! It's Elaine !\r\n\r\nElaine raises the window and kisses the two sisters.\r\n\r\n<b>       ELAINE\r\n</b>       You, darlings.\r\n\r\nShe winks at them, and then runs away.\r\n\r\n<b>       MARTHA\r\n</b>       But, Elaine !\r\n<b>       ABBY\r\n</b>       What did she mean ? You don't suppose they've gone and...\r\n\r\nMartha puts her hand over her mouth.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nA taxi cab has stopped in front of the Brewster sisters house. The\r\ndriver is half inside the back of his car, apparently looking for\r\nsomething. Mortimer is already out of the cab. He is whistling. He\r\nraises his hand and yells :\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine !\r\n\r\nElaine is crossing the churchyard to go to her father's house. She\r\nstops and turns around to look at Mortimer.\r\n\r\nOn one of the tombstones is engraved the name «Amanda Brewster»\r\nand the dates : «1813-1863».\r\n\r\nThe Brewster sisters, who were bending out of their window to get\r\na better view of the scene, are coming back in, looking extremely\r\nhappy.\r\n\r\nThe cab driver gives his coat to Mortimer.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Listen, buddy. This old cab has seen osculation but...\r\n\r\nHe whistles and goes back inside the back of the car to look for\r\nother missing items.\r\n\r\n<b>       MORTIMER\r\n</b>       You ain't seen anything yet. You've got to drive us to the\r\n       station.\r\n\r\nThe driver comes out of the cab, holding a hat.\r\n\r\n<b>       CAB DRIVER\r\n</b>       You'd better take her hat.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh thanks.\r\n\r\nThe driver goes back inside the car.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Wait a minute. Wait a minute. Wait a... And her brooch.\r\n\r\nHe gives Mortimer the brooch.\r\n\r\n<b>       MORTIMER\r\n</b>       If you find her hairpins, you can keep them. Hold on to\r\n       that.\r\n\r\nHe gives his coat back to the driver and runs away.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yeah !\r\nMortimer runs across the churchyard to meet Elaine.\r\n\r\nWe see the two Brewster sisters peeking behind the curtains of\r\ntheir window.\r\n\r\n<b>       MARTHA\r\n</b>       There they are.\r\n\r\nMortimer gives Elaine her hat. She doesn't take it.\r\n\r\n<b>       MORTIMER\r\n</b>       Here's your hat.\r\n\r\n<b>       ELAINE\r\n</b>       Just throw it. I don't like that look in your eyes.\r\n\r\n<b>       MORTIMER\r\n</b>       What ? What's the matter ?\r\n\r\n<b>       ELAINE\r\n</b>       Father preached in sermon about it only last Sunday.\r\n<b>       MORTIMER\r\n</b>       He did ? He did ? What did he say ? What did he say ?\r\n\r\nElaine is trying to avoid Mortimer by going around a tree.\r\n\r\n<b>       ELAINE\r\n</b>       He was against it.\r\n\r\n<b>       MORTIMER\r\n</b>       Ah ! But that was only Sunday.\r\n\r\nHe chases her around the tree. They laugh. Mortimer starts\r\nclowning.\r\n\r\n<b>       MORTIMER\r\n</b>       Please ! For heaven's sake !\r\n\r\n<b>       ELAINE\r\n</b>       But, Mortimer, right out here in the open with everyone\r\n       looking ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah ! Right out here in the open with everyone looking.\r\n       Let everyone in Brooklyn over 16 look.\r\n\r\nHe starts chasing her again.\r\n\r\nBehind their curtain, the two sisters are still peeking. They\r\nlaugh and then slightly move the curtains open a few inches to\r\nhave a better look.\r\n\r\nBack to the tree. The couple is hidden by the tree. They separate\r\nand move a little away from each other, each one of them appearing\r\non either side the tree.\r\n\r\nElaine drags Mortimer by the hand from behind the tree.\r\n<b>       ELAINE\r\n</b>       But, Mortimer, you're going to love me for my mind, too ?\r\n\r\n<b>       MORTIMER\r\n</b>       One thing at a time.\r\n\r\nShe starts running away from him.\r\n\r\n<b>       ELAINE\r\n</b>       Oh ! There's that look again !\r\n\r\nMortimer comes slowly from behind the tree, clowning.\r\n\r\n<b>       MORTIMER\r\n</b>       «There's that look again, Mortimer !» You better get used\r\n       to it.\r\n\r\nHe becomes more serious and come closer to her.\r\n\r\n<b>       MORTIMER\r\n</b>       Look like you're going to see it often. It goes just before\r\n       this.\r\nHe kisses her very passionately.\r\n\r\n<b>       MORTIMER\r\n</b>       You know what we're doing, darling ? We're wasting time.\r\n       Look, I'll go tell my aunts and you tell your old... No,\r\n       you'd better not tell your father just yet. You'll run that\r\n       cold of his into a pneumonia.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, I can handle Father. He's a dear.\r\n\r\n<b>       MORTIMER\r\n</b>       Look, why don't we wire him from Niagara Falls ?\r\n\r\n<b>       ELAINE\r\n</b>       Niagara Falls ?\r\n\r\nMortimer nods.\r\n\r\n<b>       ELAINE\r\n</b>       Then that's why you stopped at your office.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, certainly ! We're going to go the whole hog. Niagara\r\n       Falls ! Everybody ought to go to Niagara Falls. You\r\n       should've seen my secretary's face when I made the\r\n       reservation. We've got a drawing-room on the train,\r\n       the bridal suite in the hotel, and tomorrow morning\r\n       we go over the falls in a barrel.\r\n\r\nElaine kisses Mortimer very passionately.\r\n\r\n<b>       MORTIMER\r\n</b>       Go on, darling, hurry and pack.\r\n\r\n<b>       ELAINE\r\n</b>       I don't have to. I started packing the day after I met you.\r\nShe starts moving away. He holds her back.\r\n\r\n<b>       MORTIMER\r\n</b>       There, you see ! You see ? That's what I mean. That's what\r\n       I hate about women.\r\n\r\nMortimer kisses her.\r\n\r\nBack to the cab driver who is pacing in front of his car. He rubs\r\nhis chin.\r\n\r\n<b>       CAB DRIVER\r\n</b>       I wonder what Mary's doing now ?\r\n\r\nMortimer and Elaine are still kissing. Mortimer lets go of Elaine.\r\nHe puts her hat on her head.\r\n\r\n<b>       MORTIMER\r\n</b>       Go on, darling, the train leaves in an hour, and hurry.\r\n\r\n<b>       ELAINE\r\n</b>       It'll be a few minutes before I'm ready. Father may want to\r\n       pray over me a little.\r\n\r\nShe moves away.\r\n\r\n<b>       MORTIMER\r\n</b>       Whistle when you're ready. Oh, Elaine...\r\n\r\nShe turns around.\r\n\r\n<b>       ELAINE\r\n</b>       Yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       When you whistle, open the front door fast. If you see a\r\n       tall, dark streak of light, it's me.\r\n\r\nHe starts running toward his aunts' house. Elaine runs to her\r\nfather's house.\r\n\r\nShe stops at the door of her house and starts whistling.\r\n\r\nMortimer, who had also reached his door, stops and turns around.\r\n\r\n<b>       MORTIMER\r\n</b>       What ? Now ?\r\n\r\nHe starts running toward her, but she stops him.\r\n\r\n<b>       ELAINE\r\n</b>       No, not now !\r\n\r\nShe opens her door.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nThe two sisters are eagerly waiting for Mortimer. Martha whispers.\r\n<b>       MARTHA\r\n</b>       Look surprised when he tells us.\r\n\r\nAbby laughs. They hear a door slamming in the next room.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Aunt Abby, Aunt Martha !\r\n\r\nMortimer rushes into the room and throws his hat on a chair.\r\n\r\n<b>       MORTIMER\r\n</b>       Hold on to your bustles. We're married. Elaine and I are\r\n       married.\r\n\r\nThe two sisters hug and kiss Mortimer.\r\n\r\n<b>       ABBY\r\n</b>       Oh, darling, how wonderful ! Oh, Martha, isn't it\r\n       wonderful ? They're married!\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah ! Don't pretend to be so surprised either, you two old\r\n       frauds. Can I use the telephone, darling ?\r\n\r\n<b>       ABBY\r\n</b>       Yes, of course.\r\n\r\nMortimer goes to the telephone, followed by his two aunts.\r\n\r\n<b>       ABBY\r\n</b>       Isn't it too, too wonderful ?\r\n\r\nMortimer sits at the small desk on which the telephone is, and\r\nwhistles while dialing.\r\n\r\n<b>       MARTHA\r\n</b>       And to think that it happened right here in this room !\r\n\r\nShe dabs her nose with her handkerchief.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, now, here, here, now ! Hello ?... Hello ? Benson's\r\n       Florists ? This is Mortimer Brewster. Did you send those\r\n       roses to Missis Brewster's apartment ?... You did ? Good.\r\n       Now, send four dozen more to drawing room A, Canadian\r\n       Limited, Grand Central Station. Yes... And hurry then. And\r\n       throw in a flock of orange blossoms.\r\n\r\nHe puts the telephone receiver back on his hook, and he turns on\r\nhis chair to face his aunts, his arms resting on the back of the\r\nchair.\r\n\r\n<b>       ABBY\r\n</b>       But before you go, we can have our celebration. I'll open a\r\n       bottle of wine and we'll sing. And we'll invite a few of\r\n       the neighbors in.\r\n\r\n<b>       MARTHA\r\n</b>       And, of course, a wedding cake.\r\n<b>       MORTIMER\r\n</b>       Oh, darling, you won't have time to bake a cake. We're\r\n       going to Niagara Falls. I've got a taxi waiting.\r\n\r\n<b>       ABBY\r\n</b>       Oh, it's all ready. It's been ready since..\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, I bet it's been ready since the first day I met her,\r\n       huh ?\r\n\r\nHe stands up.\r\n\r\n<b>       MORTIMER\r\n</b>       What is it ? Did everybody in Brooklyn know I was getting\r\n       married, except me ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, we knew you'd find out about it in time.\r\n\r\nMortimer laughs and hugs his aunts.\r\n<b>       MORTIMER\r\n</b>       Come here. I've got the two nicest aunts in the world. Of\r\n       course, you've got the nicest nephew in the world, too.\r\n\r\nMartha moves away to the kitchen.\r\n\r\n<b>       MARTHA\r\n</b>       Well, I'll run along and get everything ready.\r\n\r\n<b>       ABBY\r\n</b>       Oh, dear. I do hope the Reverend isn't too angry. You know\r\n       how your books upset him.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, I'm going to burn all my books. And I'll let the\r\n       Reverend Harper light the first match. Oh, by the way, did\r\n       I leave some notes here for my new book ?\r\n\r\n<b>       ABBY\r\n</b>       You mean «Mind Over Matrimony» ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes ! Shhh ! Where are they ?\r\n\r\n<b>       ABBY\r\n</b>       I hid them someplace...\r\n\r\nAbby turns to go searching, and Mortimer pats her behind.\r\n\r\n<b>       MORTIMER\r\n</b>       Come on, come on. Let's go.\r\n\r\nAbby turns back to him.\r\n\r\n<b>       ABBY\r\n</b>       Now you behave.\r\nShe goes away on her search.\r\n\r\n<b>       MORTIMER\r\n</b>       Let's find them before Elaine sees them.\r\n\r\nTeddy comes out of his room on the balcony. He is dressed in full\r\ncolonial costume, complete with pith helmet. He is carrying a\r\nshovel and his bugle is stuck in his belt. He walks rapidly down\r\nthe stairs.\r\n\r\nHe stops a few steps from the ground floor, when he spots\r\nMortimer. He seems very happy to see him.\r\n\r\n<b>       TEDDY\r\n</b>       Hello, Mortimer !\r\n\r\nThey shake hands.\r\n\r\n<b>       MORTIMER\r\n</b>       How are you, Mister President ?\r\n\r\n<b>       TEDDY\r\n</b>       Bully, thank you. Just bully. What news have you brought\r\n       me ?\r\n\r\nTeddy takes off his pince-nez.\r\n\r\n<b>       MORTIMER\r\n</b>       Just this, Mister President. The country's squarely behind\r\n       you.\r\n\r\n<b>       TEDDY\r\n</b>       Yes, I know. Isn't it wonderful ?\r\n\r\nHe puts his pince-nez back on his nose, and shakes hands again\r\nwith Mortimer.\r\n\r\n<b>       TEDDY\r\n</b>       Well, goodbye. I'm off to Panama.\r\n\r\nTeddy walks to the cellar door. Mortimer bends slightly.\r\n\r\n<b>       MORTIMER\r\n</b>       Goodbye, Mister President.\r\n\r\nBefore he opens the door, Teddy turns to Mortimer.\r\n\r\n<b>       TEDDY\r\n</b>       A new lock for the canal, you know.\r\n\r\nHe opens the door, and starts walking down the steps to the\r\ncellar. Before the door closes back, we can hear him singing :\r\n\r\n<b>       TEDDY\r\n</b>       «Oh, tell the news to Mother».\r\n\r\nAbby is still looking for Mortimer's note, and, in a drawer, she\r\nfinds a piece of paper that seems to annoy her.\r\n\r\n<b>       ABBY\r\n</b>       Oh, dear.\r\n\r\n<b>       MORTIMER\r\n</b>       Did you find those notes ?\r\n\r\nMortimer senses there is something wrong in his aunt's voice, and\r\nwalks to her.\r\n\r\n<b>       MORTIMER\r\n</b>       What's the matter ?\r\n\r\nShe holds the paper for Mortimer to take it.\r\n\r\n<b>       ABBY\r\n</b>       There's a baby picture of your brother Jonathan.\r\n\r\nMortimer takes the picture and looks at it.\r\n\r\nINSERT - Close-up of the picture. It shows a very ugly child with\r\na very strange face.\r\n\r\n<b>       MORTIMER\r\n</b>       You ought to put that in the fire with my books. My, what a\r\n       face !\r\n\r\nHe gives the picture back to Abby.\r\n\r\n<b>       MORTIMER\r\n</b>       I remember now. He used to scare grownups with it.\r\n\r\nMortimer walks away from his aunt.\r\n\r\n<b>       ABBY\r\n</b>       Just the thought of Jonathan frightens me. Do you remember\r\n       how he used to cut worms in two with his teeth ?\r\n\r\nMortimer is searching on the small telephone desk.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Jonathan ? Oh, he's probably in prison or hanged or\r\n       something by now.\r\n\r\nHe walks across the room and starts searching on the table.\r\n\r\n<b>       MORTIMER\r\n</b>       I saw a play, which had a character in it. Reminded me of\r\n       Jonathan.\r\n\r\n<b>       ABBY\r\n</b>       No ? Really?\r\n\r\nWhile talking, they both keep on searching everywhere in the room.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah. Oh, a honey of a lunatic. One of those whodunits\r\n       called «Murder Will Out».\r\n\r\n<b>       ABBY\r\n</b>       Oh, dear !\r\nAbby goes into the kitchen.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, what a play. When the curtain goes up, the first\r\n       thing you see is a dead body.\r\n\r\nWhile talking, he keeps on searching and opens the lid of the\r\nwindow-seat. He gives its insides a quick look and closes it back,\r\nand then moves away.\r\n\r\n<b>       MORTIMER\r\n</b>       The next thing...\r\n\r\nHe stops in his tracks and looks back at the window-seat. He jumps\r\nback to it, opens the lid and closes it very quickly. He then sits\r\non the seat with a frightened look on his face. Slowly, he kneels\r\ndown on the floor, and opens the lid again, but very slowly. He\r\ntalks to whatever, or whomever, is in the seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Hey, mister.\r\nHe remains a few seconds seated of the seat, with a very puzzled\r\nface.\r\n\r\nWe hear Elaine whistling. Mortimer tries to whistle back, but no\r\nsound comes from his mouth. He tries again, but with no more\r\nsuccess. He seems in shock.\r\n\r\nHe looks at the kitchen, then at the seat. There is horror on his\r\nface.\r\n\r\nHis two aunts come from the kitchen, singing and carrying things\r\nfor the celebration.\r\n\r\nMortimer shows a forced smile.\r\n\r\nThe two sisters puts things on the table, then they come to\r\nMortimer, who is still seated on the window-seat. Abby is carrying\r\na big bowl of rice, and the two girls start throwing rice on him.\r\n\r\n<b>       ABBY\r\n</b>       Happy bridegroom !\r\n\r\n<b>       MARTHA\r\n</b>       Congratulations, darling !\r\n\r\n<b>       MORTIMER\r\n</b>       Never mind that now. I know.\r\n\r\nMortimer takes the bowl from Abby's hands and put it on a small\r\ntable. He remains seated while his aunts are standing in front of\r\nhim.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, listen, darlings. Aunt Abby, Aunt Martha, you know how\r\n       we've always planned to send Teddy to that Sanitarium,\r\n       Happy Dale ?\r\n\r\n<b>       ABBY\r\n</b>       Oh, yes, dear. That's after we're gone.\r\n\r\nThey move away to start setting the table.\r\n\r\n<b>       ABBY\r\n</b>       Yes, we talked with Reverend Harper about it.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no. Teddy's got to go to Happy Dale now. At once ! Now,\r\n       he's down in the cellar. Get him up here right away.\r\n\r\n<b>       MARTHA\r\n</b>       But, there's no such hurry as yet, you know.\r\n\r\n<b>       ABBY\r\n</b>       No... When Teddy's working on the canal, you can't get his\r\n       mind on anything else.\r\n\r\nMortimer stands up and comes to the table where his aunts are\r\nworking.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, look, darlings. Look, I'm frightfully sorry, but I've\r\n       got an awful shock for you.\r\n\r\nHe takes Abby's hands in his.\r\n\r\n<b>       MORTIMER\r\n</b>       Teddy's killed a man, darlings !\r\n\r\nMartha laughs.\r\n\r\n<b>       MARTHA\r\n</b>       Nonsense !\r\n\r\n<b>       MORTIMER\r\n</b>       (he yells)\r\n       But there's a body in the window-seat !\r\n\r\n<b>       ABBY\r\n</b>       Yes, dear. We know.\r\n\r\nMortimer looks even more shocked than before. His two aunts keep\r\non setting the table as if nothing had happened.\r\n\r\n<b>       MORTIMER\r\n</b>       You know ?\r\n\r\n<b>       MARTHA\r\n</b>       Of course.\r\n\r\n<b>       ABBY\r\n</b>       Yes, but it has nothing to do with Teddy.\r\n\r\nMortimer wants to speak, but Abby stops him.\r\n\r\n<b>       ABBY\r\n</b>       Now, Mortimer. You just forget about it. Forget you ever\r\n       saw the gentleman.\r\n<b>       MORTIMER\r\n</b>       Forget ?\r\n\r\n<b>       ABBY\r\n</b>       We never dreamed you'd peek.\r\n\r\n<b>       MORTIMER\r\n</b>       What the... Who is he ?\r\n\r\n<b>       ABBY\r\n</b>       He's a Mister Hoskins. Adam Hoskins. That's really all I\r\n       know about him, except that he's a Methodist.\r\n\r\n<b>       MARTHA\r\n</b>       Oh ! He's a Methodist ? Isn't that nice.\r\n\r\n<b>       MORTIMER\r\n</b>       That's all you know ? But what's he doing here ? What\r\n       happened to him ?\r\n\r\nMortimer is more and more shocked and his aunts, very calmly, keep\r\non putting plates and silverware on the table.\r\n<b>       MARTHA\r\n</b>       He died.\r\n\r\n<b>       MORTIMER\r\n</b>       Look, Aunt Martha, men just don't get into window-seats and\r\n       die.\r\n\r\n<b>       ABBY\r\n</b>       No, dear. He died first.\r\n\r\nMortimer takes his aunts' hands to stop them from setting the\r\ntable.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, well, now wait ! Stop all this.\r\n\r\nHe takes Abby's hands in his.\r\n\r\n<b>       MORTIMER\r\n</b>       Now look, darlings, how did he die ?\r\n\r\n<b>       ABBY\r\n</b>       Oh, Mortimer, don't be so inquisitive. The gentleman died\r\n       because he drank some wine with poison in it.\r\n\r\n<b>       MORTIMER\r\n</b>       But, how did the poison get in the wine ?\r\n\r\n<b>       MARTHA\r\n</b>       Well we put it in wine because it's less noticeable.\r\n       When it's in tea, it has a distinct odor.\r\n\r\n<b>       MORTIMER\r\n</b>       You mean you...\r\n       (yelling)\r\n       You put it in the wine ?\r\n<b>       ABBY\r\n</b>       Yes. And I put Mister Hoskins in the window-seat, because\r\n       Reverend Harper was coming.\r\n\r\nMortimer seems ready to faint.\r\n\r\n<b>       MORTIMER\r\n</b>       Ohh ! Look at me, darling.\r\n\r\nHe takes again Abby's hands in his.\r\n\r\n<b>       MORTIMER\r\n</b>       You mean, you mean you knew what you'd done and you didn't\r\n       want the Reverend Harper to see the body ?\r\n\r\n<b>       ABBY\r\n</b>       Well, not at tea. That wouldn't have been very nice.\r\n\r\nAbby goes back table-setting and Mortimer holds himself on the\r\nedge of the table.\r\n\r\n<b>       MORTIMER\r\n</b>       Ohh ! It's first-degree.\r\n\r\n<b>       ABBY\r\n</b>       Now, Mortimer, you know all about it and just forget about\r\n       it. I do think that Martha and I have the right to our own\r\n       little secrets.\r\n\r\nMartha walks to the kitchen door, but she stops and turns around.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, Abby, while I was out I dropped in on Missis Schultz.\r\n       She's much better. But she wants us to take Junior to the\r\n       movies again.\r\n\r\n<b>       ABBY\r\n</b>       Well, we must do that, tomorrow or next day.\r\n\r\n<b>       MARTHA\r\n</b>       Yes, but this time we'll go where we want to go. Junior's\r\n       not going to drag me into another one of those scary\r\n       pictures.\r\n\r\nThe two sisters enter the kitchen.\r\n\r\n<b>       ABBY\r\n</b>       No, they ought not to be allowed to make those pictures\r\n       just to frighten people.\r\n\r\nMortimer remains alone in the room. He has the face of someone who\r\nthinks he is having a nightmare and hopes to wake up soon.\r\n\r\nHe goes to the telephone desk, picks up the phone and dials «0».\r\n\r\n<b>       MORTIMER\r\n</b>       Operator ?... Can you hear my voice ?... You can ?...\r\n       Are you sure ?...\r\n\r\nHe puts the phone down.\r\n<b>       MORTIMER\r\n</b>       Then I must be here.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nElaine is appearing of her room in her father's house. She has got\r\nher purse and her gloves. She plays with a large artificial\r\nflower. She whistles.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nMortimer, half-seated on the telephone desk, comes out of his\r\ndream, and goes to the window. By signs only, he tries to explain\r\nto Elaine that he's got a problem with the window-seat. We don't\r\nsee her, but we imagine she doesn't understand, because Mortimer\r\nrushes to the kitchen.\r\n\r\n<b>BREWSTER RESIDENCE - KITCHEN - INTERIOR DAY\r\n</b>\r\nMortimer rushes into the kitchen.\r\n<b>       MORTIMER\r\n</b>       Aunt Abby ! Aunt Martha !\r\n\r\nHe stops abruptly. A group of costumed and masked children are\r\ngathered behind the window. Martha is distributing watermelons,\r\npumpkins and pies to them. The children are saying\r\nincomprehensible words of thanking.\r\n\r\nMartha closes the window on them, and switches on the lights.\r\n\r\n<b>       ABBY\r\n</b>       Oh, the dears. Isn't Halloween a wonderful time for them ?\r\n\r\n<b>       MARTHA\r\n</b>       Yes, it is. They have so much fun.\r\n\r\nThey both go back to their cooking work in the kitchen. Martha is\r\npreparing some kind of desert in a bowl.\r\n\r\n<b>       MARTHA\r\n</b>       Now, Mortimer, don't be so impatient. We'll let you lick\r\n       the bowl out.\r\n\r\n<b>       MORTIMER\r\n</b>       Lick the bowl ? I don't want to lick the bowl. I want to\r\n       know what we're going to do !\r\n\r\n<b>       MARTHA\r\n</b>       Well, we're going to celebrate, dear.\r\n\r\n<b>       MORTIMER\r\n</b>       Celebrate ? There's a body in the window-seat !\r\n\r\n<b>       ABBY\r\n</b>       Yes, dear. Mister Hoskins.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, I know what his name is. I just want to know what we're\r\n       going to do. We can't turn you over to the police.\r\n\r\nMortimer paces the kitchen, while his aunts are busy cooking.\r\n\r\n<b>       ABBY\r\n</b>       Yes. You just should get stop worrying about it.\r\n\r\n<b>       MARTHA\r\n</b>       We told you to forget the whole thing.\r\n\r\n<b>       MORTIMER\r\n</b>       (yelling)\r\n       Forget ? Look, my dear aunt Martha, can't I make you\r\n       realize that something has to be done ?\r\n\r\nAbby leaves the stove where she was working and comes to the\r\ntable.\r\n\r\n<b>       ABBY\r\n</b>       Now, Mortimer, you behave. You're too old to be flying off\r\n       the handle like this.\r\n<b>       MORTIMER\r\n</b>       But, but Mister Hodgekiss...\r\n\r\n<b>       ABBY\r\n</b>       Hoskins, dear.\r\n\r\n<b>       MORTIMER\r\n</b>       But whatever his name is, you can't leave him in there.\r\n\r\n<b>       MARTHA\r\n</b>       We don't intend to, dear.\r\n\r\n<b>       ABBY\r\n</b>       No, Teddy's down in the cellar now, digging the lock.\r\n\r\nMortimer looks very shocked.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you mean you're going to bury Mister Hodgekiss in the\r\n       cellar ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, yes, dear. That's what we did with the others.\r\n\r\n<b>       MORTIMER\r\n</b>       Look, here, Aunt Martha. You can't...\r\n\r\nHe comes close to the table where Martha is working. And all of a\r\nsudden, he seems to realize what she just said.\r\n\r\n<b>       MORTIMER\r\n</b>       Others ?\r\n\r\n<b>       MARTHA\r\n</b>       The other gentlemen.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh ! When you say «others», do you mean «others» ? More\r\n       than one «others» ?\r\n\r\nMartha laughs.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, yes, dear. Let me see now. This is eleven, isn't it,\r\n       Abby ?\r\n\r\n<b>       ABBY\r\n</b>       Oh no, dear. This makes twelve.\r\n\r\n<b>       MARTHA\r\n</b>       Abby, dear, I think you're wrong. This one is only eleven.\r\n\r\n<b>       ABBY\r\n</b>       No, dear, because I remember when Mister Hoskins first came\r\n       in, it occurred to me that he'd make just an even dozen.\r\n\r\nMortimer seems completely dejected and he sits down, not even\r\nlistening to his aunts anymore.\r\n\r\n<b>       MARTHA\r\n</b>       But, look, Abby dear, I really don't think you should count\r\n       the first one.\r\n\r\n<b>       ABBY\r\n</b>       Oh, I was counting the first one, and that makes it twelve.\r\n\r\n<b>       MARTHA\r\n</b>       It does ?\r\n\r\nAbby, who is sucking her finger, nods to answer.\r\n\r\n<b>       MARTHA\r\n</b>       Well, she's probably right. Abby usually is. I get them\r\n       mixed up sometimes.\r\n\r\n<b>       MORTIMER\r\n</b>       Makes it twelve. Well...\r\n\r\nThe telephone rings. Mortimer puts his hand to his ear.\r\n\r\n<b>       MORTIMER\r\n</b>       Hello ?\r\n\r\nHe suddenly realizes that he doesn't have a telephone in his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh !\r\n\r\nHe rushes out of the kitchen.\r\n\r\n<b>       ABBY\r\n</b>       Well, whatever is the matter with Mortimer today ?\r\n\r\n<b>       MARTHA\r\n</b>       Why, Abby, what do you think happened to him ?\r\n\r\nThey walk out of the kitchen.\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nMortimer sits at the telephone desk and picks up the phone.\r\n\r\n<b>       MORTIMER\r\n</b>       Hello ?\r\n\r\nWe hear some whistling, coming from the telephone. Mortimer takes\r\nthe receiver a bit away from his ear, surprised. Then he takes it\r\nback.\r\n\r\n<b>       MORTIMER\r\n</b>       Not now. Not now. For heaven's sake, keep your shirt on !\r\n\r\nHe slams the phone down on his hook. Then he realizes he has been\r\nrude, and picks it up again.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh... Oh, Elaine, I didn't mean...\r\n\r\nHe realizes there is no one on the phone, and puts it back down.\r\n<b>       MORTIMER\r\n</b>       Now, let's see. Where were we ? Twelve.\r\n       (he yells)\r\n       Twelve !\r\n\r\nHe jumps from his chair and rushes toward the kitchen. But, when\r\nhe sees his two aunts setting the table, he stops and goes to\r\nthem.\r\n\r\n<b>       MARTHA\r\n</b>       Yes, dear. Abby thinks we should count the first one.\r\n\r\n<b>       MORTIMER\r\n</b>       Never mind about that. Just sit down.\r\n\r\nMartha sits down.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, tell me, who was the first one ?\r\n\r\n<b>       ABBY\r\n</b>       Mister Midgely. He was a Baptist.\r\n\r\n<b>       MARTHA\r\n</b>       He was such a lonely, old gentleman, Mister Midgely was.\r\n\r\n<b>       ABBY\r\n</b>       All his kith and kin were dead.\r\n\r\n<b>       MARTHA\r\n</b>       We felt so sorry for him.\r\n\r\n<b>       ABBY\r\n</b>       And then, when his heart attack came, and he sat there dead\r\n       in that chair, looking so peaceful. Remember, Martha ? We\r\n       made up our minds, then and there, that if we could help\r\n       other lonely, old men to find that same peace, we would.\r\n<b>       MORTIMER\r\n</b>       Why, you poor... You mean, he dropped dead right in this\r\n       chair ?\r\n\r\nMortimer realizes it's the chair he's sitting on, and stands up\r\nvery quickly.\r\n\r\n<b>       ABBY\r\n</b>       And then, you see, Teddy came up from digging in Panama,\r\n       and he thought Mister Midgely was a yellow-fever victim.\r\n       And that meant he had to be buried immediately.\r\n\r\n<b>       MORTIMER\r\n</b>       So ?\r\n\r\n<b>       MARTHA\r\n</b>       So, we all took him down to Panama, and put him in the lock\r\n       and gave him a decent Christian burial. There, now you\r\n       see ?\r\n       (she stands up)\r\n       That's why we told you not to bother about it, because we\r\n       know exactly what's to be done.\r\nMortimer is sitting on the table, and seems not to know what he\r\nmust do next. But he suddenly stands up.\r\n\r\n<b>       MORTIMER\r\n</b>       Wait a minute !\r\n\r\nHe rushes to his aunts.\r\n\r\n<b>       MORTIMER\r\n</b>       Come here, darlings. What about the others ? All twelve of\r\n       them didn't walk in here and drop dead.\r\n\r\n<b>       ABBY\r\n</b>       Oh, no, dear. Of course not !\r\n\r\n<b>       MORTIMER\r\n</b>       Well, so, so...\r\n\r\nAbby whispers something in Martha's ear. Martha looks at Mortimer,\r\nsmiles, and whispers back in her sister's ear.\r\n\r\n<b>       MARTHA\r\n</b>       Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Wh... what?\r\n\r\n<b>       MARTHA\r\n</b>       Do you remember those jars of poison that were on the\r\n       shelves in Grandfather's laboratory all these years ?\r\n\r\n<b>       ABBY\r\n</b>       You know your Aunt Martha's knack for mixing things.\r\n       You've eaten enough of her piccalilli.\r\n\r\n<b>       MARTHA\r\n</b>       Well, dear, for a gallon of elderberry wine, I take one\r\n       teaspoonful of arsenic, then add half a teaspoonful of\r\n       strychnine. And then, just a pinch of cyanide.\r\n\r\n<b>       MORTIMER\r\n</b>       Mmmm ! Should have quite a kick.\r\n\r\n<b>       ABBY\r\n</b>       Yes, as a matter of fact, one of our gentlemen found time\r\n       to say : «How delicious !»\r\n\r\n<b>       MORTIMER\r\n</b>       He did ? Well, wasn't that nice of him ?\r\n\r\n<b>       MARTHA\r\n</b>       Abby, we mustn't be standing here gossiping all night.\r\n       Well, we must get that cake frosted.\r\n\r\nShe moves toward the kitchen, followed by Abby.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh no, darling, don't worry about the cake. I couldn't eat\r\n       a thing.\r\n<b>       ABBY\r\n</b>       Oh, you newlyweds! A sip of wine will give you an appetite.\r\n\r\n<b>       MORTIMER\r\n</b>       That'd be nice, darling, a sip of... A sip of wine !\r\n\r\nHe stands up.\r\n\r\n<b>       MORTIMER\r\n</b>       Wine !\r\n\r\nHe wants to move away, but his foot get entangled in the back of a\r\nchair, and he almost falls down.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR DAY\r\n</b>\r\nElaine appears at the window of her room. She is arranging the\r\nartificial flower on the lapel of her jacket. She moves away from\r\nthe window.\r\n\r\nThe cab driver is still pacing on the sidewalk near his car.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nMortimer closes the drapes between the sitting-room and the next\r\nroom. He then goes to the cellar door and opens the door ajar. A\r\ncat meows and comes out through the opening. We hear Teddy singing\r\ndown in the cellar.\r\n\r\n<b>       MORTIMER\r\n</b>       I'm beginning to think the cat's in on this.\r\n\r\nHe listens to the singing coming from the cellar.\r\n\r\n<b>       MORTIMER\r\n</b>       He's wonderful. Happy as a lark. Singing away, digging\r\n       locks.\r\nHe closes the cellar door.\r\n\r\n<b>       MORTIMER\r\n</b>       Got him working on a yellow-fever victim. Oh, I can see the\r\n       headlines now : «Murder Incorporator Rides Again» right\r\n       across the front page. Let me see... Teddy ! Of course.\r\n       Everybody knows he's crazy. Let me see. Who can I call up ?\r\n       Dewey, La Guardia, Winchell ? No, Winchell's no good. Old\r\n       Judge Cullman !\r\n\r\nHe starts moving across the room, putting his hand in the inside\r\nbreast pocket of his jacket.\r\n\r\n<b>       MORTIMER\r\n</b>       I wonder if I got his number.\r\n\r\nHe gets a couple of tickets out of his pocket. He sits at the\r\nsmall telephone desk.\r\n\r\n<b>       MORTIMER\r\n</b>       What am I doing with tickets ?\r\nHe throws the tickets on the desk. He picks up the phone, and\r\nstarts dialing.\r\n\r\n<b>       MORTIMER\r\n</b>       Information... Hello ? Information ?... Get me the number\r\n       of Judge Cullman on North Shore Road, Brooklyn. Yeah, would\r\n       you call me back ?\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nThe night has come. Elaine is walking very rapidly on the\r\nsidewalk. She passes near the taxi. The driver opens the door for\r\nher, but she keeps on walking.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer is standing by the window-seat. All the drapes are\r\nclosed. He bends down.\r\n\r\n<b>       MORTIMER\r\n</b>       How it would be marvelous if he wasn't there.\r\n\r\nHe slowly opens the lid of the seat. When the lid is a few inches\r\nopen, he peeks inside.\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       Hey, you !\r\n\r\nWhen he hears Elaine's voice, Mortimer slams the lid down and sit\r\non the seat.\r\n\r\n<b>       ELAINE\r\n</b>       Thought you were tall, dark streak of light.\r\n\r\nShe is standing by the half-open door, and she makes the gestures\r\nMortimer made when he had told her the same sentence, earlier in\r\nthe churchyard.\r\n\r\n<b>       MORTIMER\r\n</b>       What are you doing here?\r\n\r\n<b>       ELAINE\r\n</b>       What am I doing here ? Didn't you hear me whistle ?\r\n\r\n<b>       MORTIMER\r\n</b>       Whistle ? Oh, yes, yes. I heard you whistle. But...\r\n\r\nHe stands up and comes to her in the middle of the room. He gives\r\nher a quick kiss.\r\n\r\n<b>       ELAINE\r\n</b>       Hey, how do I look ?\r\n\r\nShe pivots to show him the way she is dressed.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you look fine, you look fine. Now, run on home. I'll\r\n       call you up tomorrow.\r\n<b>       ELAINE\r\n</b>       Tomorrow ?\r\n\r\nHe pushes her toward the door.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, you know I always call you up every day or two.\r\n\r\nShe laughs.\r\n\r\n<b>       ELAINE\r\n</b>       Oh ! you and your gags ! Where's your hat ? Come on. The\r\n       bags are in the taxi.\r\n\r\n<b>       MORTIMER\r\n</b>       Huh ? Taxi ? Huh, huh, huh ?\r\n\r\nShe is pulling him toward the door.\r\n\r\n<b>       ELAINE\r\n</b>       Yeah, come on !\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Elaine, I'm so sorry. But something's happened.\r\n\r\n<b>       ELAINE\r\n</b>       What'd you do, lose your nerve ? Hey, where's that look\r\n       I was going to see so often ?\r\n\r\nShe takes his head to bring her mouth close to his ear, and then\r\nshe starts whistling. He moves away and rubs his ear.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, stop ! Don't whistle in my ear, please.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer, what is wrong ? Look at your hair.\r\nHe bends down for her to see his hair better.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, my God, what color is it ? Quick ! Has it turned ?\r\n\r\n<b>       ELAINE\r\n</b>       Oh, darling, what's the matter ? What happened ?\r\n\r\nShe starts stroking his face. He bends down on her shoulder.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Elaine, if I could only tell you, Elaine. You smell so\r\n       nice.\r\n\r\nThe phone rings. Mortimer jumps up\r\n\r\n<b>       MORTIMER\r\n</b>       Oh ! Oh !\r\n\r\nHe pushes her out through the open door.\r\n<b>       MORTIMER\r\n</b>       You better go home !\r\n\r\n<b>       ELAINE\r\n</b>       But, darling, we were married today.\r\n\r\n<b>       MORTIMER\r\n</b>       All right, go home, go to bed, get some rest !\r\n\r\n<b>       ELAINE\r\n</b>       Rest ?\r\n\r\nHe slams the door on her, and rushes to the telephone. He sits\r\ndown at the desk and picks up the phone.\r\n\r\n<b>       MORTIMER\r\n</b>       Who ? Who ? Judge Cullman ?\r\n\r\nThe front door opens, and Elaine comes back inside the house.\r\n\r\n<b>       MORTIMER\r\n</b>       This is Mortimer Brewster. Look, Judge, I'll tell you why I\r\n       called you. It's about Teddy.\r\n\r\nElaine crosses the room and sits on the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       I've got to come over and see you right away. Oh, I'm\r\n       afraid it won't wait until tomorrow, Judge. Yeah, you see,\r\n       it's very, very important. We've got to do something about\r\n       it immediately. But it's practically a matter of life\r\n       and...\r\n\r\nMortimer turns his head and sees Elaine sitting on the window-\r\nseat. He drops the phone on the desk, and yells :\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine !\r\nElaine, frightened, jumps up from the seat. Mortimer rushes to\r\nher.\r\n\r\n<b>       MORTIMER\r\n</b>       Will you get out of here ?\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer, what in the world is going on around here ? I\r\n       don't even know where I stand !\r\n\r\n<b>       MORTIMER\r\n</b>       Anywhere, but don't stand there !\r\n\r\nHe moves her away from the window-seat.\r\n\r\n<b>       ELAINE\r\n</b>       But, darling, Niagara Falls !\r\n\r\n<b>       MORTIMER\r\n</b>       If it does, we'll let it !\r\n<b>       ELAINE\r\n</b>       Now, wait a minute ! Listen. You can't marry me one minute\r\n       and then throw me out the house the next !\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, darling, I'm not throwing you out of the house !\r\n\r\nHe lifts her and actually throws her out of the house\r\n\r\n<b>       MORTIMER\r\n</b>       Will you get out of here ?\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nElaine bumps into an old man, Mr. Gibbs, standing just outside the\r\nentrance of the house. He is holding a newspaper in his hand.\r\n\r\nShe comes back to the door, but Mortimer slams it in her face.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer locks the door and goes back to the phone\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nElaine is knocking desperately on the door. Gibbs is still behind\r\nher.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer !\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer is back sitting at the desk and talking into the phone.\r\nIn the background, we hear Elaine's pounding on the door.\r\n\r\n<b>       MORTIMER\r\n</b>       I'm sorry, Judge. But... a thing happened. But, Judge,\r\n       about Teddy, you see...\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       Mortimer !\r\n\r\n<b>       MORTIMER\r\n</b>       Hold it. You see, Judge, it's his bugle blowing. Yes, the\r\n       neighbors have been complaining, and the police are all set\r\n       to throw him into a state institution.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nElaine seems quite angry.\r\n\r\n<b>       ELAINE\r\n</b>       How do you like that ?\r\n\r\nGibbs shows his newspaper to Elaine\r\n\r\n<b>       GIBBS\r\n</b>       I read an ad here about a room to rent.\r\n<b>       ELAINE\r\n</b>       Oh ! Shut up !\r\n\r\nShe walks away, leaving Gibbs at the door. She walks quickly by\r\nthe taxi. The driver opens the door for her, but she walks on with\r\nquick steps.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer is still on the phone.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, I thought that if you sign the papers, I can get\r\n       Teddy to commit himself, and get him in Happy Dale... Yes,\r\n       it's a wonderful place, Judge... You will ?... Fine ! I'll\r\n       be over right as soon as I've made another call.\r\n\r\nThe front door bell rings.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nGibbs is standing by the door, ringing the bell.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nAbby comes in the room from the kitchen. Mortimer is still on the\r\nphone.\r\n\r\n<b>       ABBY\r\n</b>       Doorbell's ringing, dear.\r\n\r\nShe crosses the room to the front door. She opens the door,\r\nrevealing Gibbs.\r\n\r\n<b>       ABBY\r\n</b>       Oh, how do you do ? Come in.\r\nThe kitchen door has remained open, and we see Martha still\r\nworking on her cooking.\r\n\r\n<b>       GIBBS\r\n</b>       (voice over)\r\n       I understand you've got a room to rent.\r\n\r\nHearing that, Martha drops her cooking and comes into the room.\r\n\r\n<b>       ABBY\r\n</b>       Yes... Do step in.\r\n\r\nAbby opens the door wide for him to get in.\r\n\r\n<b>       GIBBS\r\n</b>       Well, are you the lady of the house ?\r\n\r\n<b>       ABBY\r\n</b>       Yes, I'm Miss Brewster.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Yeah, operator ? Give me long distance, please.\r\n\r\nMartha has joined her sister.\r\n\r\n<b>       ABBY\r\n</b>       And this is my sister. Another Miss Brewster.\r\n\r\nGibbs takes off his hat.\r\n\r\n<b>       GIBBS\r\n</b>       My name's Gibbs.\r\n\r\nQuick shot on Mortimer, still on the phone. He gives a quick look\r\ntoward his aunts, but doesn't seem interested.\r\n\r\n<b>       ABBY\r\n</b>       Well, do sit down. I'm sorry, but we're just setting the\r\n       table for dinner.\r\n\r\nShe moves an armchair on the other side of the table.\r\n\r\n<b>       ABBY\r\n</b>       Now, this would be a nice comfortable chair.\r\n\r\nBack to Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh. Hello, long distance ? I want the Happy Dale\r\n       Sanitarium, Happy Dale, New York.\r\n\r\nBack to Gibbs and the sisters.\r\n\r\n<b>       ABBY\r\n</b>       Is Brooklyn your home ?\r\n\r\n<b>       GIBBS\r\n</b>       I haven't got a home. I live in a hotel. Don't like it.\r\n<b>       MARTHA\r\n</b>       A... are your family Brooklyn people ?\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Hello ? Hap...\r\n\r\n<b>       GIBBS\r\n</b>       Haven't got any family.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Well, operator...\r\n\r\n<b>       ABBY\r\n</b>       All alone in the world ?\r\n\r\n<b>       GIBBS\r\n</b>       Yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       No, no...\r\n\r\nAbby looks at her sister with a knowing smile.\r\n\r\n<b>       ABBY\r\n</b>       Well, Martha....\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       No, Happy Dale... Yes.\r\n\r\n<b>       ABBY\r\n</b>       Well, you've come to just the right house. You sit down.\r\n\r\nShe helps him sit down in the armchair, while Martha is bringing a\r\ncarafe of wine and a glass.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Dale. «D» like in «dig», you know, when you dig a lock.\r\n       That's right. «A» like in «arsenic». Got that ?\r\n\r\nShort close-up on the carafe of wine, now on the table.\r\n\r\n<b>       GIBBS\r\n</b>       Is there always this much noise ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh ! He doesn't live with us.\r\n\r\nMortimer is standing, with the telephone set in one hand, and the\r\nreceiver on his ear in the other hand. He whispers.\r\n\r\n<b>       MORTIMER\r\n</b>       I can see the headlines now. Oh, please.\r\n       (back to normal voice)\r\n       Hello ?\r\nBack to the table.\r\n\r\n<b>       GIBBS\r\n</b>       I'd really like to see the room. Well, I don't think I'll\r\n       like it.\r\n\r\nHe stands up and takes his hat, which he had put on the table.\r\n\r\n<b>       ABBY\r\n</b>       The room's upstairs.\r\n\r\nAbby is seated at the table, with Martha standing behind her. She\r\ntakes the carafe.\r\n\r\n<b>       ABBY\r\n</b>       Won't you try a glass of our wine before we start up ?\r\n\r\n<b>       GIBBS\r\n</b>       Never touch it.\r\n\r\n<b>       MARTHA\r\n</b>       Well, we make this ourselves. It's elderberry wine.\r\n<b>       GIBBS\r\n</b>       Elderberry ?\r\n\r\nHe puts his hat back on the table and sits down.\r\n\r\n<b>       GIBBS\r\n</b>       I haven't tasted elderberry wine since I was a boy.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Oh...\r\n\r\n<b>       GIBBS\r\n</b>       Thank you.\r\n\r\nAbby starts pouring the wine in the glass.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Operator ! Well, I don't want the Happy Dale Laundry !\r\n       I want the Happy Dale Sanitarium ! Sanitarium !\r\n       Sanitarium ! Sanitarium ! Yes, like a broken record !\r\n\r\nGibbs takes the glass from Abby.\r\n\r\n<b>       GIBBS\r\n</b>       Have your own elderberry bushes ?\r\n\r\n<b>       MARTHA\r\n</b>       No, but the cemetery's full of them.\r\n\r\nGibbs raises his glass.\r\n\r\n<b>       GIBBS\r\n</b>       Well, skoal.\r\n\r\nIn the background, Mortimer is yelling louder and louder. Gibbs,\r\nwho had the glass almost to his lips, puts it down. The two\r\nsisters watch him with expecting eyes.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Hello, operator! No, operator, what's taking you so long ?\r\n       It's only across the river ! I could swim it faster ! Yes !\r\n       Hello ! Hello...\r\n\r\nGibbs, who had taken the glass back to his lips, put it down once\r\nmore.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       What ?... What, they're busy ? Busy ? They're busy and\r\n       you're dizzy ! No, I'm not drunk, madam, but you've given\r\n       me an idea !\r\n\r\nA noise of chairs and various objects falling.\r\n\r\nMortimer comes to the table and takes the carafe and a glass.\r\nAbby, concentrated on Gibbs raising the glass to his lips again,\r\ndoesn't see him, but Martha does, and seems very anxious about it.\r\nShe taps her two forefingers together.\r\n\r\n<b>       MARTHA\r\n</b>       Mortimer ! Ah-ah ah-ah !...\r\n\r\nMortimer keeps on pouring the wine in the glass\r\n\r\n<b>       MORTIMER\r\n</b>       Darling, don't «ah-ah ah-ah», I'm nervous. Don't do this.\r\n\r\nAbby sees him. She turns around, and very calmly, holds the hand\r\nwhich is holding the glass.\r\n\r\n<b>       ABBY\r\n</b>       Mortimer. Not that.\r\n\r\nHe puts the glass down, and suddenly realizes the situation. He\r\nlooks at Gibbs, who has taken the glass to his lips. He yells and\r\nGibbs, frightened, stands up and drops the glass on the floor.\r\nMortimer points his finger at him.\r\n\r\n<b>       MORTIMER\r\n</b>       Get out of here ! Do you want to be poisoned, do you want\r\n       to be murdered, do you want to be killed ? Do you ?\r\n\r\nGibbs grabs his hat and runs to the front door. Mortimer runs\r\nafter him and falls over an armchair standing in his way. The two\r\nsisters seem very upset.\r\n\r\nGibbs gets out and slams the door.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nGibbs runs out of the house, and stops by the cab driver, who is\r\nseated near his taxi, smoking a cigarette.\r\n\r\n<b>       GIBBS\r\n</b>       They... they're nuts !\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey, you're telling me !\r\n\r\nGibbs runs away in the street.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nThe two sisters are seated on the window-seat. Mortimer slowly\r\nraises himself from the overturned armchair.\r\n\r\n<b>       MORTIMER\r\n</b>       Look, you can't do things like that !\r\n\r\nHe stands up and puts the armchair back on its legs.\r\n\r\n<b>       MORTIMER\r\n</b>       Now I don't know how I can explain this to you, but it's\r\n       not only against the law, it's wrong.\r\n\r\nHe walks slowly toward them.\r\n<b>       ABBY\r\n</b>       Oh, piffle !\r\n\r\nBoth sisters are sulking.\r\n\r\n<b>       MORTIMER\r\n</b>       It's not a nice thing to do. People wouldn't understand.\r\n\r\nHe points to the front door and the departed Mr. Gibbs.\r\n\r\n<b>       MORTIMER\r\n</b>       He wouldn't understand. What I mean is... Well... This is\r\n       developing into a very bad habit !\r\n\r\nThe telephone rings.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh... Yes...\r\n\r\nHe goes to the desk, sits on the chair, and picks up the phone.\r\n\r\n<b>       MORTIMER\r\n</b>       Hello ?... Who ?... Oh, Happy Dale Sanitarium ? Oh, that's\r\n       amazing, operator. Yeah... Happy Dale ? Oh, let me talk to\r\n       Mister Witherspoon, please.\r\n\r\n<b>WITHERSPOON'S OFFICE - INTERIOR NIGHT\r\n</b>\r\nWitherspoon is sitting behind his desk, the telephone receiver to\r\nhis ear.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Mr. Witherspoon speaking... Oh, how do you do, Mister\r\n       Brewster ? How are you ?\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>Mortimer is still at the desk, telephoning.\r\n\r\n<b>       MORTIMER\r\n</b>       Uh... uh... Well, Mister Witherspoon, do you... Oh, I'm\r\n       fine, thanks. How are you ? Mister Witherspoon, do you\r\n       remember that conversation we had about committing my\r\n       brother Teddy to Happy Dale ?... You do ? Well, we want to\r\n       commit him there immediately.\r\n\r\n<b>WITHERSPOON'S OFFICE - INTERIOR NIGHT\r\n</b>\r\n<b>       WITHERSPOON\r\n</b>       Oh, dear. Oh, dear. Oh, that's too bad. Well, I'd hoped we\r\n       wouldn't have him for some time yet. Well, you see, Mister\r\n       Brewster, we have several Theodore Roosevelts at the\r\n       moment, and it would lead to trouble. Oh, trouble... Oh,\r\n       now, if he thought that... Look, Mr. Brewster, we're a bit\r\n       short of Napoleons at present. The Bonaparte. And if...\r\n       Oh... oh, I see. Of course. Well, if your mind is made up.\r\n       Yes. Yes. Have you had the papers drawn up ?\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b><b>       MORTIMER\r\n</b>       No, but I'm going to attend to it right now and call you as\r\n       soon as I have them. Thank you, Mister... What ?... All\r\n       right. Thank you, Mister Witherspoon.\r\n\r\nHe puts the phone down.\r\n\r\n<b>WITHERSPOON'S OFFICE - INTERIOR NIGHT\r\n</b>\r\nWitherspoon puts his phone down\r\n\r\n<b>       WITHERSPOON\r\n</b>       Another Roosevelt. Oh, dear, dear.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer goes back to his aunts, still sitting on the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Now listen, darlings. I've got to run over to Judge\r\n       Cullman's, but, before I go, I want you to promise me\r\n       something.\r\n\r\n<b>       MARTHA\r\n</b>       Well, we'd have to know what it was first.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, I love you both very much. And you know I'd do\r\n       anything in the world for you, don't you ?\r\n\r\n<b>       ABBY\r\n</b>       Yes, dear.\r\n\r\n<b>       MORTIMER\r\n</b>       All right, then I want you to do one little thing for me,\r\n       like good girls.\r\n<b>       ABBY\r\n</b>       What do you want us to do ?\r\n\r\n<b>       MORTIMER\r\n</b>       Don't do anything. I mean, don't do anything ! Don't let\r\n       anyone in the house and leave Mr. Whosit right where he is.\r\n       Oh ! Get off that thing. I can't talk to you... I can't\r\n       concentrate.\r\n\r\nHe makes them stand up from the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, look, darlings, I wouldn't want anything in the world\r\n       to happen to either of you.\r\n\r\n<b>       ABBY\r\n</b>       But, what on earth could happen to us?\r\n\r\n<b>       MORTIMER\r\n</b>       Well, darling... Anyway, you'll do that little thing for\r\n       me, won't you ? All right.\r\nAbby nods.\r\n\r\n<b>       MORTIMER\r\n</b>       Where's my hat ? There it is.\r\n\r\nHe leaves them to pick up his hat.\r\n\r\n<b>       MARTHA\r\n</b>       But, Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       What, darling, what ?\r\n\r\n<b>       MARTHA\r\n</b>       We were planning to hold services before dinner.\r\n\r\n<b>       MORTIMER\r\n</b>       Look, couldn't that wait until I get back ?\r\n\r\n<b>       ABBY\r\n</b>       Oh, and you could join us in the hymns !\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, darling, I could join you in the hymns. I'll sing with\r\n       you, I'll dance with you, I'll do anything. But...\r\n       remember, don't let anybody in the house until I get back.\r\n       You promise ?\r\n\r\nAbby and Martha nod.\r\n\r\n<b>       MORTIMER\r\n</b>       Good.\r\n\r\nHe puts the hat on his head. The hat is ostensibly to large for\r\nhim. He opens the front door\r\n\r\n<b>       ABBY\r\n</b>       (voice over)\r\n       Mortimer !\r\n\r\nHe was almost out, but he turns around.\r\n\r\n<b>       MORTIMER\r\n</b>       What ?\r\n\r\nAbby points to the hat, but can't talk.\r\n\r\n<b>       ABBY\r\n</b>       Uh-uh-uh-uh !...\r\n\r\n<b>       MORTIMER\r\n</b>       Stop that «uh-uh-uh». What is it ?\r\n\r\n<b>       ABBY\r\n</b>       Mr. Hoskins' hat !\r\n\r\nMortimer raises his eyes, and tears the had off his head\r\n\r\n<b>       MORTIMER\r\n</b>       Ohhhh !...\r\n\r\nHe throws the hat away, leaves and closes the door.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nThe cab driver is pacing back and forth on the sidewalk near his\r\ntaxi.\r\n\r\nMortimer comes running out of the house. The driver goes toward\r\nhim.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Do you still want me to wait here ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes ! Call me a cab !\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yeah. Okay, okay !\r\n\r\nThey run together and stop in front of the parked taxi. The driver\r\nwaves his arm.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey, cab !... Here you are.\r\n\r\nAnother taxi stops near the first one. The driver wants to open\r\nthe back door for Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Don't open it. I'll sit with you !\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yeah, that's right. I can go faster that way. Sure.\r\n\r\nMortimer climbs in the front of the taxi, next to the driver. The\r\ntaxi drives away, and the first driver remains on the street,\r\ntouching his cap.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Wait a minute ! What am I doing ? Hey !\r\n\r\nHe pats his own taxi, points his finger to it and waves for the\r\nother taxi to come back.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Come here !\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nAbby picks up Mr. Hoskins' hat. She brushes it with her hand and\r\ngives it to Martha.\r\n\r\n<b>       ABBY\r\n</b>       Fancy getting nice Mr. Hoskins' hat all mussed up.\r\n\r\n<b>       MARTHA\r\n</b>       Shame ! Such a nice hat.\r\nShe crosses the room and, takes a brush on a cupboard near the\r\nwindow-seat, and starts brushing the hat.\r\n\r\n<b>       MARTHA\r\n</b>       You know, Abby, Mortimer didn't seem to be quite himself\r\n       today.\r\n\r\nAbby brings two candlesticks on the table\r\n\r\n<b>       ABBY\r\n</b>       No. Oh, well.\r\n\r\nMartha opens the cupboard, which is full of man's hats. She puts\r\nHoskins' hat with the others, and then closes the cupboard\r\n\r\n<b>       MARTHA\r\n</b>       Well, what were you saying about Mortimer ?\r\n\r\nAbby has lit the candles.\r\n\r\n<b>       ABBY\r\n</b>       Oh, I think I understand why he seemed so upset.\r\n\r\n<b>       MARTHA\r\n</b>       Why ?\r\n\r\n<b>       ABBY\r\n</b>       He's just been married. I believe that always makes a man a\r\n       little nervous.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, yes. The poor dears.\r\n\r\nShe crosses the room to the door to switch off the lights\r\n\r\n<b>       MARTHA\r\n</b>       I'm so happy for Elaine. Oh, Abby ! If Mortimer's coming\r\n       back for the services for Mr. Hoskins, we're going to need\r\n       another hymnal. There's one up in my room.\r\n\r\nKnocks at the front door. Through the frosted window-panels of the\r\ndoor, we see the shadows of two men.\r\n\r\n<b>       ABBY\r\n</b>       Oh, I'll go, dear.\r\n\r\n<b>       MARTHA\r\n</b>       Abby, we promised Mortimer we wouldn't let anyone come in.\r\n\r\nMore knocks at the door. Martha peeks through the drapes of a\r\nconvenient window, a few steps above floor-level on the staircase.\r\n\r\n<b>       MARTHA\r\n</b>       Abby ! Two men, and I've never seen them before.\r\n\r\n<b>       ABBY\r\n</b>       Are you sure ?\r\n\r\n<b>       MARTHA\r\n</b>       Yes.\r\n<b>       ABBY\r\n</b>       Let me look.\r\n\r\nAbby climbs the steps and comes near her sister to peek through\r\nthe drapes\r\n\r\n<b>       MARTHA\r\n</b>       You look.\r\n\r\nThe two shadows knock again.\r\n\r\n<b>       MARTHA\r\n</b>       Do you recognize them ?\r\n\r\n<b>       ABBY\r\n</b>       No, they're strangers to me.\r\n\r\n<b>       MARTHA\r\n</b>       Well, we'll just have to pretend we're not at home.\r\n\r\nThe front door opens. The tallest of the two men, dressed in black\r\nand wearing a large hat, comes in first. The other one, shorter\r\nand hatless, follows him.\r\n\r\nWe get a close-up of the face of the tall man, actually Jonathan\r\nBrewster. It's full of scars and it makes him look a bit like\r\nBoris Karloff in the Frankenstein films. He looks around the room.\r\n\r\n<b>       JONATHAN\r\n</b>       Come in, doctor.\r\n\r\nDoctor Einstein, who was waiting at the door, comes into the room,\r\nand closes the door behind him.\r\n\r\n<b>       JONATHAN\r\n</b>       This is the home of my youth. As a boy, I couldn't wait to\r\n       escape from this house. Now I'm glad to escape back into\r\n       it.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, Johnny, it's a good hideout.\r\n\r\nHe takes a small bottle from an inside pocket of his jacket, and\r\ntakes a sip at it.\r\n\r\n<b>       JONATHAN\r\n</b>       The family must still live here. I hope there's a fatted\r\n       calf awaiting the return of the prodigal.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       A fatted calf ? Oh, Johnny, I'm so hungry.\r\n\r\nHe comes closer to the table.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Look, Johnny. Drink.\r\n\r\n<b>       JONATHAN\r\n</b>       As if we were expected.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes.\r\n\r\n<b>       JONATHAN\r\n</b>       A good omen.\r\n\r\nEinstein pours some wine from the carafe in a glass. Jonathan\r\ntakes a glass already full on the table.\r\n\r\nAbby gets down the few steps, followed by Martha.\r\n\r\n<b>       ABBY\r\n</b>       Who are you ? What are you doing here ?\r\n\r\nThe two men put their glasses down on the table\r\n\r\n<b>       JONATHAN\r\n</b>       Aunt Abby. Aunt Martha. It's Jonathan.\r\n\r\n<b>       MARTHA\r\n</b>       You, you get out of here !\r\n\r\n<b>       JONATHAN\r\n</b>       I'm Jonathan, you know. Your nephew, Jonathan.\r\n\r\nHe takes his hat off.\r\n\r\n<b>       ABBY\r\n</b>       Oh no, you're not. You're nothing like Jonathan, so don't\r\n       pretend you are. You just get out of here.\r\n\r\nShe points to the door.\r\n\r\n<b>       JONATHAN\r\n</b>       I see you're still wearing the lovely garnet ring that\r\n       Grandma Brewster bought in England. And you, Aunt Martha,\r\n       still the high collar to hide the scar where Grandfather's\r\n       acid burned you.\r\n\r\n<b>       MARTHA\r\n</b>       Why, his voice is like Jonathan's.\r\n\r\n<b>       ABBY\r\n</b>       Have, have you been in an accident ?\r\n\r\n<b>       JONATHAN\r\n</b>       My face. Doctor Einstein is responsible for that. He's a\r\n       plastic surgeon.\r\n\r\n<b>       MARTHA\r\n</b>       But I've seen that face before. Do you remember when we\r\n       took the little Schultz boy to the movies and I was so\r\n       frightened ? It was that face.\r\n\r\nJonathan turns around and look harshly at Einstein, who seems a\r\nbit uneasy.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Take it easy, Johnny. Take it easy. Don't worry. The last\r\n       five years, I give him three different faces. I give him\r\n       another one right away. That last face. I saw that picture,\r\n       too, just before I operated. I was intoxicated.\r\n\r\nJonathan grabs Einstein's collar and squeezes it.\r\n\r\n<b>       JONATHAN\r\n</b>       You see, doctor, what you've done to me ? Even my own\r\n       family think I'm...\r\n\r\nEinstein has breathing problems because of Jonathan's squeezing.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Johnny, Johnny ! You are home in this lovely house.\r\n\r\nJonathan lets go of Einstein, who walks toward the two sisters.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You know how many times he tells me about... about\r\n       Brooklyn, about this house, and about his aunts he loves so\r\n       much ? They know you, Johnny. Please tell him so.\r\n\r\n<b>       ABBY\r\n</b>       Well, Jonathan, it's been a long time.\r\n\r\nJonathan sits down.\r\n\r\n<b>       JONATHAN\r\n</b>       Bless you. It's good to be home again.\r\n\r\nAbby turns toward Martha, and then goes down the few last steps to\r\nfloor level.\r\n\r\n<b>       ABBY\r\n</b>       Well, Martha, we mustn't let what's on the stove boil over.\r\n\r\nShe picks up the glasses on the table.\r\n<b>       ABBY\r\n</b>       If you'll excuse us for a moment, Jonathan. Unless you're\r\n       in a hurry to go somewhere.\r\n\r\nShe goes to the kitchen with the glasses. Martha picks up the wine\r\ncarafe, to the disappointment of Dr. Einstein, and follows her\r\nsister toward the kitchen. Before entering the kitchen, she puts\r\nthe carafe back on the shelf where it was before. She then closes\r\nthe kitchen door after her.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Well, Johnny, where do we go from here ? You know, Johnny,\r\n       we got to think fast.\r\n\r\nClose-up on the hands of Jonathan playing with a metallic brain-\r\nteaser.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       The police, they got pictures of that face. I got to\r\n       operate on you right away. We got to find someplace. We got\r\n       to find someplace for Mister Spenalzo, too.\r\nWhile talking, he has taken another sip from his bottle.\r\n\r\n<b>       JONATHAN\r\n</b>       Don't waste any worry on that rat.\r\n\r\nEinstein stands up.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But we got a hot stiff on our hands.\r\n\r\n<b>       JONATHAN\r\n</b>       Forget Mr. Spenalzo.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But, Johnny, we can't leave a dead body in the rumble seat.\r\n       You shouldn't have killed him. Just because he knows\r\n       something about us, what happens ?\r\n\r\nEinstein mimes the breaking of a neck with his hands.\r\n\r\n<b>       JONATHAN\r\n</b>       We come to him for help and he tries to shake us down.\r\n       Besides, he said I looked like Boris Karloff. That's your\r\n       work, doctor. You did that to me.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, please, Johnny, take it easy. We'll find some place\r\n       and I'll fix you up right away.\r\n\r\n<b>       JONATHAN\r\n</b>       Tonight.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, tonight, but I have to eat first.\r\n\r\nThe two sisters are peeking in the room through a small\r\nrectangular hole in the door of the kitchen.\r\n<b>       JONATHAN\r\n</b>       This time, I want the face of an absolute nonentity.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, Johnny. I know exactly what I'm going to do.\r\n\r\nHe comes close to Jonathan and shows him on his face what he is\r\ngoing to do to it.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You see, I'm going to take this piece here and lift it\r\n       up...\r\n\r\n<b>       JONATHAN\r\n</b>       Be careful about the stitches this time.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You leave that up to me. I'll give you nice little ears\r\n       and...\r\n\r\n<b>       JONATHAN\r\n</b>       You were careless last time.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       And new stitches. And on the eyes I'll do a Schmidt. That's\r\n       my specialty. You see, I take it together like this...\r\n\r\n<b>       JONATHAN\r\n</b>       Leave the eyes alone. Leave the nose alone.\r\n\r\nThe scene dissolves to :\r\n\r\n<b>JUDGE CULLMAN'S OFFICE - INTERIOR DAY.\r\n</b>\r\nThe judge is sitting, studying some papers. Mortimer is standing\r\nat his side.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Poor Teddy. I imagine it's for the best.\r\n\r\nHe drops the papers on the desk and starts declaiming.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Well... «Ours not to reason why, ours but to do...»\r\n\r\nMortimer is very irritated by the Judge's erratic attitude. He\r\nputs a pen in his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Sign right here, please, Judge. Excuse me. Right there.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Sometimes I think, with the world in its present chaotic\r\n       state...\r\n\r\nMortimer takes the pen from the Judge's hand and starts signing\r\nthe papers.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, I know, we'd all be better off at Happy Dale. I sign\r\n       here as next of kin, don't I ?\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Only last week I created a mild sensation at the Bar\r\n       Association, when I said...\r\n\r\nMortimer dries the document, and shakes the Judge's hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes. Goodbye. Good luck, Judge. Thank you.\r\n\r\nHe walks to the door of the office.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Tell Martha and Abby I'll be over this week. I've been\r\n       feeling rather lonely.\r\n\r\nMortimer comes back on his steps.\r\n\r\n<b>       MORTIMER\r\n</b>       No ! No ! Oh no ! Never tell them you've been lonely.\r\n       Never !\r\n<b>       JUDGE CULLMAN\r\n</b>       Why, I... I... I...\r\n\r\nMortimer comes back to the Judge's desk.\r\n\r\n<b>       MORTIMER\r\n</b>       Judge ! Tell me, are you a drinking man ?\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Why, no. I never indulge.\r\n\r\n<b>       MORTIMER\r\n</b>       Good ! Then you'll live longer.\r\n\r\nHe goes back to the door.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       Of course a little wine now...\r\n\r\n<b>       MORTIMER\r\n</b>       No ! No ! For heaven's sake, no wine ! No wine !\r\n\r\nHe goes out, slamming the door behind him. The Judge looks\r\npensively at the door Mortimer just closed.\r\n\r\n<b>       JUDGE CULLMAN\r\n</b>       I may be committing the wrong Brewster.\r\n\r\nThe scene dissolves to :\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nThe Brewster sister are sitting at the table with Doctor Einstein\r\nand Jonathan. The dinner is finished, and both men are smoking.\r\n\r\n<b>       ABBY\r\n</b>       Well, I'm sure you both want to get to wherever you're\r\n       going.\r\n\r\nThe two sisters stands up from the table.\r\n\r\n<b>       JONATHAN\r\n</b>       My dear, sweet aunties, I'm so full of your delicious\r\n       dinner I'm unable to move a muscle.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, it's nice here.\r\n\r\nTeddy comes out of his room on the balcony. He is still wearing\r\nhis colonial costume. He has a book in his hand and a spare pith\r\nhelmet under his arm. He rushes down the stairs.\r\n\r\n<b>       TEDDY\r\n</b>       I found it ! I found it !\r\n\r\nHe stops suddenly in the staircase.\r\n\r\n<b>       TEDDY\r\n</b>       Gentlemen, be seated.\r\nJonathan and Einstein pretend they are standing up, but they\r\nimmediately sit back in their chairs.\r\n\r\nTeddy comes down the last steps and goes toward the table.\r\n\r\n<b>       TEDDY\r\n</b>       Here it is, gentlemen. The story of my life, my biography.\r\n\r\nHe puts the book on the table, in front of Einstein. It's open on\r\na page with a picture.\r\n\r\n<b>       TEDDY\r\n</b>       Here's the picture I was telling you about, General. Here\r\n       we are, both of us. President Roosevelt and General\r\n       Goethals at Culebra Cut. That's me, General, and that's\r\n       you.\r\n\r\nEinstein looks at the picture.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       My, how I've changed !\r\n\r\n<b>       TEDDY\r\n</b>       Well, you see, that picture hasn't been taken yet. We\r\n       haven't even started work on Culebra Cut. We're still\r\n       digging locks. And now, General, we will both go to Panama\r\n       and inspect the new lock.\r\n\r\nHe gives the spare helmet to Einstein.\r\n\r\n<b>       ABBY\r\n</b>       No, Teddy. Not to Panama.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh, maybe some other time, Mister President. Panama is a\r\n       long ways off.\r\n<b>       TEDDY\r\n</b>       Nonsense ! It's just down in the cellar.\r\n\r\nJonathan, who hadn't seemed to be much interested by Teddy's\r\nconversation, suddenly looks up.\r\n\r\n<b>       JONATHAN\r\n</b>       The cellar ?\r\n\r\n<b>       MARTHA\r\n</b>       Well, we let him dig the Panama Canal in the cellar.\r\n\r\n<b>       TEDDY\r\n</b>       General Goethals ?\r\n\r\nEinstein slightly raises the hand holding the cigarette to his\r\nforehead.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, sir.\r\n\r\n<b>       TEDDY\r\n</b>       As President of the United States, Commander in Chief of\r\n       the Army and Navy, and the man who gave you this job, I\r\n       demand that you accompany me on the inspection of the new\r\n       lock.\r\n\r\n<b>       JONATHAN\r\n</b>       Teddy ! I think it's time for you to go to bed.\r\n\r\n<b>       TEDDY\r\n</b>       I beg your pardon. Who are you ?\r\n\r\n<b>       JONATHAN\r\n</b>       I'm Woodrow Wilson. Go to bed.\r\n\r\n<b>       TEDDY\r\n</b>       No, you're not Wilson. But your face is familiar. Let me\r\n       see... You're not anyone I know now. Perhaps later, on my\r\n       hunting trip to Africa. Yes, you look like someone I might\r\n       meet in the jungle.\r\n\r\nJonathan starts standing up with a very menacing face.\r\n\r\n<b>       ABBY\r\n</b>       I think, perhaps, you had better go to bed, Teddy. He and\r\n       his friend want to get back to their hotel.\r\n\r\nJonathan sits back in his chair.\r\n\r\n<b>       JONATHAN\r\n</b>       General Goethals, inspect the canal.\r\n\r\nEinstein stands up and takes his helmet.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       All right, Mister President, we go to Panama.\r\n\r\n<b>       TEDDY\r\n</b>       Bully, bully ! Follow me, General.\r\nHe opens the door to the cellar, then turns toward Einstein, taps\r\non the helmet Einstein is carrying and then on his own helmet.\r\n\r\n<b>       TEDDY\r\n</b>       It's down south, you know.\r\n\r\nEinstein puts the helmet on his head. The helmet is too large for\r\nhim, and gets down on his eyes.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh !\r\n\r\nTeddy starts going downstairs. Before following him, Einstein\r\nturns around to the others.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Well, bon voyage !\r\n\r\nHe waves them goodbye and then follows Teddy downstairs.\r\n\r\nJonathan has remained seated, with both his aunts standing on the\r\nother side of the table.\r\n\r\n<b>       JONATHAN\r\n</b>       Aunt Abby, I must correct your misapprehension. You talked\r\n       of our hotel. We have no hotel. We came here directly.\r\n\r\n<b>       ABBY\r\n</b>       This is not your home, and I'm afraid you can't stay here.\r\n\r\nJonathan stands up and looks menacingly at his aunts. While\r\ntalking, he moves closer to them. They look frightened.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor Einstein and I need a place to sleep. You remember\r\n       that, as a boy, I could be disagreeable. It would not be\r\n       pleasant for any of us if... but I don't have to go into\r\n       details, do I ?\r\n\r\n<b>       MARTHA\r\n</b>       Perhaps we'd better let them stay here tonight.\r\n\r\nEinstein appears at the door of the cellar.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny, Johnny. Come here. Quick.\r\n\r\nHe goes back down the stairs to the cellar.\r\n\r\n<b>       JONATHAN\r\n</b>       Oh, I forgot to tell you, Doctor Einstein and I are turning\r\n       Grandfather's laboratory into an operating room. We expect\r\n       to be very busy.\r\n\r\nHe goes to the cellar door.\r\n\r\n<b>BREWSTER RESIDENCE - CELLAR - INTERIOR NIGHT\r\n</b>\r\nEinstein is on the staircase, halfway down to the cellar. On the\r\nwall behind him, we see the shadow of Teddy digging.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny, down here, what do you think I find ?\r\n\r\nHe takes off his helmet. Jonathan joins him on the stairs.\r\n\r\n<b>       JONATHAN\r\n</b>       What ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       The Panama Canal. And it just fits Mister Spenalzo. See the\r\n       hole he's digging. Four feet wide, six feet long. He just\r\n       fits ! You'd think he knew we were bringing Mister Spenalzo\r\n       along. That's hospitality.\r\n\r\nJonathan smiles and looks upstairs.\r\n\r\n<b>       JONATHAN\r\n</b>       Rather a good joke on my aunts. They're living in a house\r\n       with a body buried in the cellar.\r\nEinstein laughs.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, how do we get him in here ?\r\n\r\n<b>       JONATHAN\r\n</b>       Yes, we can't just walk Mister Spenalzo in through the\r\n       door. We'll bring the car up between the cemetery and the\r\n       house, and after they've gone to bed, we'll bring Mister\r\n       Spenalzo in through the window.\r\n\r\nHe goes back up the stairs. Einstein follows him. The shadow of\r\nTeddy keeps on digging.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny...\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nJonathan comes in through the cellar door, with Einstein following\r\nbehind him. His two aunts are still standing up in the room.\r\n\r\n<b>       JONATHAN\r\n</b>       We're moving the car behind the house. You'd better get to\r\n       bed.\r\n\r\nHe crosses the room with Einstein following him.\r\n\r\n<b>       MARTHA\r\n</b>       The car is all right where it is until morning.\r\n\r\n<b>       JONATHAN\r\n</b>       I don't want to leave it in the street. That might be\r\n       against the law.\r\n\r\nHe opens the front door, and gets out, still followed by Einstein.\r\n\r\n<b>       MARTHA\r\n</b>       Abby ! What are we going to do ?\r\n\r\n<b>       ABBY\r\n</b>       Well, we're not going to let them spend more than one night\r\n       in this house, for one thing. But what would the neighbors\r\n       think ? People coming in here with one face and going out\r\n       with another.\r\n\r\n<b>       MARTHA\r\n</b>       And what are we going to do about Mister Hoskins ?\r\n\r\n<b>       ABBY\r\n</b>       Oh ! Mister Hoskins ! It can't be very comfortable for him\r\n       in there. And he's been so patient, the poor dear. Well, I\r\n       think Teddy had better take Mister Hoskins downstairs right\r\n       away.\r\n\r\nTeddy enters by the cellar door.\r\n\r\n<b>       TEDDY\r\n</b>       General Goethals was very pleased. He said the canal was\r\n       just the right size.\r\nFrom the table, he picks up the book he had shown to Dr. Einstein,\r\nand starts looking at it.\r\n\r\n<b>       ABBY\r\n</b>       Teddy ! Teddy, there's been another yellow-fever victim.\r\n\r\n<b>       TEDDY\r\n</b>       Dear me ! This will be a shock to the General.\r\n\r\n<b>       ABBY\r\n</b>       No, Teddy, we must keep it a secret.\r\n\r\n<b>       MARTHA\r\n</b>       Yeah !\r\n\r\n<b>       TEDDY\r\n</b>       A state secret ?\r\n\r\n<b>       ABBY\r\n</b>       Yes, a state secret.\r\n\r\n<b>       MARTHA\r\n</b>       Promised ?\r\n\r\n<b>       TEDDY\r\n</b>       You have the word of the President of the United States.\r\n       Cross my heart and hope to die.\r\n\r\nHe crosses his chest and spits on the floor. Then, he takes his\r\naunts in his arms.\r\n\r\n<b>       TEDDY\r\n</b>       Now, let's see. How are we going to keep it a secret ?\r\n\r\n<b>       ABBY\r\n</b>       Well, Teddy, I think you'd better get back down into the\r\n       cellar. And then, when I turn out the lights, when\r\n       everything's dark here, you come up and take the poor man\r\n       down to the canal. Now get along, Teddy.\r\n\r\nTeddy crosses the room to the cellar door.\r\n\r\n<b>       ABBY\r\n</b>       And we'll come down later and hold services.\r\n\r\nTeddy opens the door, and turns around.\r\n\r\n<b>       TEDDY\r\n</b>       Where is the poor devil ?\r\n\r\n<b>       ABBY\r\n</b>       (voice over)\r\n       In the window-seat.\r\n\r\n<b>       TEDDY\r\n</b>       It seems to be spreading. We've never had yellow fever\r\n       there before.\r\n\r\n<b>       MARTHA\r\n</b>       Abby. I've never even seen Mister Hoskins !\r\n\r\n<b>       ABBY\r\n</b>       Oh, my goodness! That's right, you were out. Well, you just\r\n       come right along and see him now. You know, he's really\r\n       very nice looking, considering that he's a Methodist.\r\n\r\nBoth sisters go to the window-seat and are ready to lift the lid,\r\nwhen the drapes above the seat suddenly open wide, revealing a\r\nvery menacing Jonathan. The two sisters back off, frightened.\r\n\r\nJonathan slowly climbs in through the window, and stands up on the\r\nwindow-seat.\r\n\r\n<b>       JONATHAN\r\n</b>       We're bringing the luggage through here.\r\n\r\nHe gets down from the window-seat. Then Einstein appears behind\r\nthe window, carrying a suitcase. Jonathan helps him to bring the\r\nsuitcase in the room.\r\n\r\n<b>       ABBY\r\n</b>       Jonathan, your room is waiting for you. You can go right\r\n       up.\r\n\r\nEinstein, still outside the window, gives Jonathan another\r\nsuitcase.\r\n\r\n<b>       JONATHAN\r\n</b>       I'm afraid we don't keep Brooklyn hours. You two run along\r\n       to bed.\r\n\r\n<b>       ABBY\r\n</b>       Oh, but you must be very tired. Both of you. And we don't\r\n       go to bed this early.\r\n\r\n<b>       JONATHAN\r\n</b>       It's time I came home to take care of you.\r\nBehind Jonathan, Einstein has come into the room and is closing\r\nthe window, and then the drapes.\r\n\r\n<b>       JONATHAN\r\n</b>       (to Einstein)\r\n       Take the bags upstairs.\r\n\r\nEinstein takes the two suitcases and starts moving away.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       For the instruments, I'll come back later.\r\n\r\n<b>       ABBY\r\n</b>       Good night.\r\n\r\nEinstein slightly bows to Abby.\r\n\r\n<b>       JONATHAN\r\n</b>       Now, we'll all go to bed.\r\n\r\n<b>       ABBY\r\n</b>       I'll wait until you're up and then turn out the lights.\r\n\r\nEinstein has already almost reached the balcony. Martha starts\r\nclimbing, with Jonathan behind her.\r\n\r\n<b>       JONATHAN\r\n</b>       Run along, Aunt Martha. Just off the laboratory, Doctor.\r\n\r\nEverybody reaches the balcony. Einstein disappears at the end of\r\nthe balcony, and Martha enters her room. Jonathan turns around and\r\nlooks down at Abby.\r\n\r\n<b>       JONATHAN\r\n</b>       All right, Aunt Abby.\r\n\r\n<b>       ABBY\r\n</b>       I'll be right up.\r\n\r\n<b>       JONATHAN\r\n</b>       Now, Aunt Abby ! Turn out the lights.\r\n\r\nAbby goes to the switch near the front door, and switches the\r\nlights off. The room is completely dark.\r\n\r\nAbby climbs the stairs, reaches the balcony, and walks slowly pass\r\nJonathan, who is still standing at the same place. Then, she\r\nquickly enters the room she shares with her sister, who is holding\r\nthe door open for her.\r\n\r\nJonathan moves along the balcony and starts climbing the stairs to\r\nthe upper floor. He stops after a few steps, and sees the door of\r\nhis aunts' room opening slowly. Abby comes out.\r\n\r\n<b>       JONATHAN\r\n</b>       Aunt Abby.\r\n\r\nAbby quickly goes back into the room and closes the door. Jonathan\r\nresumes his climbing.\r\nThe camera moves down into total black darkness, and then into the\r\nroom, where we see some light underneath the cellar door. We hear\r\nsteps, and the door opens to reveal Teddy, still in his colonial\r\ncostume, but without the helmet. He stops a few seconds, then\r\nstarts crossing the room, only lit by light coming from underneath\r\nthe kitchen door. We hear the lid of the window-seat creaking, and\r\nwe guess Teddy has just opened it. Shuffling noises. Then we see\r\nthe shadow of Teddy carrying something apparently heavy. We hear\r\nthe cat screaming, and we guess Teddy must have stepped on its\r\ntail. When Teddy comes into the light from the open door of the\r\ncellar, we discover he is carrying a human body, which could only\r\nbe Mr. Hoskins' one taken from the window-seat. Teddy turns around\r\nand starts going backward down the steps to the cellar. He stops a\r\nfew seconds to close the door. Then we hear noises of something\r\nfalling, and we guess that Teddy must have missed a step and\r\nfallen all the way down to the cellar.\r\n\r\nBlack screen during one second.\r\n\r\nEinstein is going down the staircase, lit only by a match he is\r\nholding in his hand.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       He's all right, Johnny.\r\n\r\nWhen he gets on floor level, he meets Jonathan.\r\n\r\n<b>       JONATHAN\r\n</b>       I'll open the window. You go round and hand him through.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But he's too heavy for me.\r\n\r\nHe burns his finger and blows the match. The scene becomes\r\ncompletely dark. We see only shadows.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You go outside, Johnny, and push, and I'll stay here and\r\n       pull. And then together we take him down to Panama. Huh ?\r\n\r\n<b>       JONATHAN\r\n</b>       All right. We must be quick. I'll take a look around\r\n       outside the house. When I tap on the glass, you open the\r\n       window.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah.\r\n\r\nJonathan moves to the front door, opens it, stops to look around,\r\nand then closes the door.\r\n\r\nEinstein walks slowly in the room.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       It's dark in here.\r\n\r\nHe bumps into something. We hear the lid of the window-seat\r\ncreaking several times.\r\nEinstein light another match, and we discover he has fallen into\r\nthe open window-seat, where he is now lying\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Where am I ? Oh, here I am.\r\n\r\nHe slowly gets out of the seat.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Who left this open ?\r\n\r\nJonathan taps on the window. Einstein blows the match and opens\r\nthe window.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Johnny ?\r\n\r\nWe see only shadows in the dark, but we guess Jonathan is handing\r\nMr. Spenalzo's corpse to Einstein, who will then put it in the\r\nwindow-seat.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Okay, Johnny, wait a minute. Hand him over. Now I have him.\r\n       «Allez !» Up ! Now, wait a minute, Johnny. You lost a leg\r\n       somewhere. Hey, help me. He's so heavy. Now I have him. Now\r\n       I got him.\r\n\r\n<b>       JONATHAN\r\n</b>       Be careful.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh, but his shoe came off. Help me, Johnny. He's so heavy.\r\n       Now I've got him !\r\n\r\nKnocking at the door.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny, somebody's at the door. Go open, quick.\r\n       I'll manage Spenalzo. Go, quick !\r\n\r\nSome more knocking. We hear the creaking of the lid of the window-\r\nseat, and we guess Einstein is closing it.\r\n\r\nThe front door opens slowly, and Elaine enters the house.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer ! Aunt Abby !\r\n\r\nWe see the frightened face of Einstein.\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       Aunt Martha !\r\n\r\nJonathan enters through the front door left open by Elaine, closes\r\nit and locks it.\r\n\r\n<b>       ELAINE\r\n</b>       (looking frightened)\r\n       Who is it ? Is that you, Teddy ?\r\n<b>       JONATHAN\r\n</b>       Who are you ?\r\n\r\n<b>       ELAINE\r\n</b>       I'm Elaine Harper. I live next door.\r\n\r\n<b>       JONATHAN\r\n</b>       What are you doing here ?\r\n\r\n<b>       ELAINE\r\n</b>       I came here to see my husband, Mortimer.\r\n\r\n<b>       JONATHAN\r\n</b>       Why did you say your name was Harper ?\r\n\r\n<b>       ELAINE\r\n</b>       Well, it is Harper. I mean, it's Brewster. I'm not very\r\n       used to it. I'm a brand-new Brewster.\r\n\r\nEinstein goes to the front door and switches the lights on.\r\n<b>       JONATHAN\r\n</b>       Doctor !\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       It's all right, Johnny. It's okay.\r\n\r\nEinstein has his little bottle in one hand, and, with the finger\r\nof the other hand, he tries to explain to Jonathan that the corpse\r\nis safely in the window-seat.\r\n\r\nJonathan looks at Einstein, and then goes across the room to look\r\naround. He even moves the drapes of a window to look outside.\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       Maybe you'd better explain what you're doing here.\r\n\r\nJonathan keeps on checking around. He goes to the window above the\r\nwindow-seat, and looks outside.\r\n\r\n<b>       JONATHAN\r\n</b>       We happen to live here.\r\n\r\nHe spots an orphan shoe on the floor and picks it up.\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       You don't live here. I've been in this house every day, and\r\n       I've never seen you before. Where are Miss Martha and Miss\r\n       Abby ? What have you done to them ?\r\n\r\nEinstein tries to explain to Jonathan, without using words, that\r\nthe shoe belongs to the corpse in the window-seat.\r\n\r\n<b>       JONATHAN\r\n</b>       Perhaps we'd better introduce ourselves. May I present\r\n       Doctor Einstein ?\r\nHe puts the shoe on the table, then lifts the tablecloth to look\r\nunderneath it.\r\n\r\n<b>       ELAINE\r\n</b>       Doctor Einstein ?\r\n\r\n<b>       JONATHAN\r\n</b>       A surgeon of great distinction. And something of a\r\n       magician.\r\n\r\n<b>       ELAINE\r\n</b>       Now I suppose you're gonna tell me that you're Boris...\r\n\r\n<b>       JONATHAN\r\n</b>       (cutting her very harshly)\r\n       I am Jonathan Brewster.\r\n\r\n<b>       ELAINE\r\n</b>       Oh ! You're Jonathan.\r\n\r\nJonathan comes close to her and looks at her in such a strange way\r\nthat she starts walking backward.\r\n<b>       JONATHAN\r\n</b>       You've heard of me ?\r\n\r\n<b>       ELAINE\r\n</b>       Yes, they talk about you.\r\n\r\n<b>       JONATHAN\r\n</b>       What do they say about me ?\r\n\r\nElaine stops walking backward.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, just that there's another brother named Jonathan,\r\n       that's all they say. Oh, that explains everything. Now that\r\n       I know who you are, I'll just be running along, if you'll\r\n       kindly unlock the door.\r\n\r\nThey move to the front door, beside which Einstein is standing,\r\nsmiling. Jonathan unlocks the door. He opens it a few inches, but\r\nstands in the way of Elaine, ready to got out.\r\n\r\n<b>       JONATHAN\r\n</b>       «That explains everything.» Just what do you mean by that ?\r\n       Why do you come here at this time of night ?\r\n\r\n<b>       ELAINE\r\n</b>       Well, I just thought I saw Mortimer drive up. I suppose it\r\n       was you.\r\n\r\nJonathan slams the door and locks it.\r\n\r\n<b>       JONATHAN\r\n</b>       You thought you saw someone drive up ?\r\n\r\nHe walks menacingly toward her, and she starts walking backward\r\nacross the room.\r\n<b>       ELAINE\r\n</b>       Yes. Weren't you just outside ? Isn't that your car ?\r\n\r\n<b>       JONATHAN\r\n</b>       You saw someone at the car ?\r\n\r\n<b>       ELAINE\r\n</b>       Yes.\r\n\r\nEinstein starts walking behind Jonathan.\r\n\r\n<b>       JONATHAN\r\n</b>       What else did you see ?\r\n\r\n<b>       ELAINE\r\n</b>       Oh, just that, that's all !\r\n\r\n<b>       JONATHAN\r\n</b>       I see. Is that why you came over here ?\r\n\r\n<b>       ELAINE\r\n</b>       Oh no, I came to see Mortimer. But if he's not home, I'll\r\n       run...\r\n\r\nShe tries to run away, but Jonathan grabs her arms and holds it\r\nvery firmly.\r\n\r\n<b>       JONATHAN\r\n</b>       You've given two names.\r\n\r\n<b>       ELAINE\r\n</b>       You're hurting me !\r\n\r\n<b>       JONATHAN\r\n</b>       I think she's dangerous.\r\n\r\nTeddy comes in through the cellar door. He has his helmet back on\r\nhis head and wears heavy working gloves.\r\n\r\n<b>       TEDDY\r\n</b>       No visitors. It's going to be a private funeral.\r\n\r\nHe crosses the room and starts climbing the stairs. Both Jonathan\r\nand Einstein are now holding Elaine.\r\n\r\n<b>       ELAINE\r\n</b>       Teddy ! Teddy, tell these men who I am !\r\n\r\nTeddy stops a few steps from floor level.\r\n\r\n<b>       TEDDY\r\n</b>       Oh, that's my daughter, Alice.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, no, Teddy ! Teddy !\r\n\r\n<b>       TEDDY\r\n</b>       Now, Alice, don't be a tomboy. Don't play rough with the\r\n       gentlemen.\r\nHe pulls out his imaginary sword and rushes up the stairs.\r\n\r\n<b>       TEDDY\r\n</b>       Charge !\r\n\r\nHe rushes into his room and slams the door.\r\n\r\n<b>       ELAINE\r\n</b>       Teddy !\r\n\r\nElaine starts screaming. Jonathan holds a handkerchief over her\r\nmouth. Einstein runs to the front door and switches the lights\r\noff.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor, the cellar.\r\n\r\n<b>       ELAINE\r\n</b>       Let go of me ! Let go of me !\r\n\r\nThe cellar door is opened, and we see the shadows of the two men\r\ndragging Elaine down to the cellar.\r\n<b>       MARTHA\r\n</b>       What's the matter ? What's happening down there ?\r\n\r\nThe lights are switched back on, and we see Abby and Martha on the\r\nbalcony, just coming out of their room. They are both dressed in\r\nblack funeral clothes.\r\n\r\n<b>       ABBY\r\n</b>       What's the matter ? What are you doing there ?\r\n\r\nJonathan is coming alone out of the cellar.\r\n\r\n<b>       JONATHAN\r\n</b>       We caught a burglar, a sneak thief. Go back to your room.\r\n\r\n<b>       ABBY\r\n</b>       We'll call the police.\r\n\r\nShe starts going down the stairs, followed by Martha.\r\n\r\n<b>       JONATHAN\r\n</b>       I'll handle this. Go back to your room.\r\n\r\nAbby stops at the top of the stairs.\r\n\r\n<b>       JONATHAN\r\n</b>       Do you hear me ?\r\n\r\nKnocking on the door, followed by the doorbell. The two sisters\r\nstarts going down the stairs.\r\n\r\n<b>       JONATHAN\r\n</b>       Don't answer that.\r\n\r\nAnother doorbell. The two sisters are running downstairs.\r\n\r\n<b>       JONATHAN\r\n</b>       Don't answer that !\r\n\r\nElaine rushes through the cellar door, screaming. She runs into\r\nMartha's arms, followed by Einstein.\r\n\r\n<b>       ELAINE\r\n</b>       Let go of me !\r\n\r\nMore knocking and ringing at the door. Abby goes and opens the\r\ndoor. Mortimer enters the house..\r\n\r\n<b>       MORTIMER\r\n</b>       Where's Teddy ? Is he upstairs ?\r\n\r\nElaine rushes to Mortimer and holds him by the neck. He gets rid\r\nof her.\r\n\r\n<b>       MORTIMER\r\n</b>       Never mind that now, darling, please.\r\n\r\nHe starts climbing the stairs and looks, surprised, at Martha.\r\n<b>       MORTIMER\r\n</b>       What are you doing with your best clothes on ?\r\n\r\nHe suddenly notices Jonathan's presence and stops mounting the\r\nstairs.\r\n\r\n<b>       MORTIMER\r\n</b>       Holy... What's that ? What's that thing there that looks\r\n       like a cigar-store dummy ?\r\n\r\n<b>       ABBY\r\n</b>       It's your brother Jonathan, and this is Doctor Einstein.\r\n\r\n<b>       MORTIMER\r\n</b>       Aunt Abby, didn't I tell you not to let anybody in the\r\n       house ? Who did you say it was ?\r\n\r\n<b>       ABBY\r\n</b>       It's your brother, Jonathan !\r\n\r\nElaine grabs Mortimer's coat, and starts talking to him. So do\r\nAbby and Martha on either side of him. Since the three of them are\r\ntalking together, it is impossible to understand what they say.\r\n\r\n<b>       JONATHAN\r\n</b>       I've come back home, Mortimer.\r\n\r\nAt the voice of Jonathan, the three women stop talking\r\n\r\n<b>       MORTIMER\r\n</b>       What ?\r\n\r\n<b>       JONATHAN\r\n</b>       I've come back home, Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       «I've come back home, Mortimer.» Listen, it talks !\r\n<b>       JONATHAN\r\n</b>       Yes, I talk. Mortimer, have you forgotten the things I used\r\n       to do to you when you were tied to the bedpost ? The\r\n       needles under your fingernails.\r\n\r\nElaine grabs Mortimer's coat.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer, he...\r\n\r\n<b>       MORTIMER\r\n</b>       Wait a minute.\r\n\r\nMortimer walks closer to Jonathan.\r\n\r\n<b>       MORTIMER\r\n</b>       Holy mackerel ! It is Jonathan !\r\n\r\n<b>       JONATHAN\r\n</b>       I'm glad you remember, Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, I remember. How could I forget you ? Where'd you get\r\n       that face ? Hollywood ?\r\n\r\nJonathan is ready to fight with his brother. Einstein grabs his\r\narm to stop him and Abby comes between them.\r\n\r\n<b>       ABBY\r\n</b>       Oh, don't you two boys start quarreling again the minute\r\n       you've seen each other.\r\n\r\n<b>       MARTHA\r\n</b>       We invited Jonathan and Doctor Einstein to stay.\r\n\r\n<b>       MORTIMER\r\n</b>       What ?\r\n\r\n<b>       MARTHA\r\n</b>       Just for tonight.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh no, you don't, I'm staying here tonight. In fact, I'm\r\n       staying here from now on.\r\n\r\nElaine taps on Mortimer's arm.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer, what about me ?\r\n\r\n<b>       MORTIMER\r\n</b>       There's no room for anybody else in the house.\r\n       (to Elaine)\r\n       Please, darling, just a moment.\r\n       (to Jonathan)\r\n       So take that little squirt and beat it !\r\n       (to Martha)\r\n       Now where's Teddy ? I've got to see him right away. Is he\r\n       upstairs ?\r\nHe starts climbing the stairs.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Mister Brewster ! We don't take up much room. Johnny can\r\n       sleep on the sofa, and I'll sleep on the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Nothing to...\r\n\r\nHe stops going upstairs\r\n\r\n<b>       MORTIMER\r\n</b>       Window-seat ?\r\n\r\nHe comes back downstairs.\r\n\r\n<b>       MORTIMER\r\n</b>       Certainly not on the window-seat. I'm going to sleep on the\r\n       window-seat.\r\n\r\nHe crosses the room to sit on the window-seat.\r\n<b>       MORTIMER\r\n</b>       I'm going to sleep on the windows-eat from now on.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer !\r\n\r\nMortimer stands up and goes to Jonathan\r\n\r\n<b>       MORTIMER\r\n</b>       Now look. Now look, Jonathan. Now, be a good fellow. Here's\r\n       ten dollars. Go out and haunt yourself a hotel.\r\n\r\nJonathan throws Mortimer's money on the floor. Mortimer tries to\r\nstep on it, but instead, he steps on Jonathan's foot.\r\n\r\n<b>       JONATHAN\r\n</b>       Mortimer, you know what I do to people who order me around.\r\n\r\nEinstein pulls Jonathan's sleeve.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny. Mister Spenalzo.\r\n\r\nMortimer bends down to look at Jonathan foot, then he touches his\r\nlegs.\r\n\r\n<b>       JONATHAN\r\n</b>       What ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       What's going to happen to Mister Spenalzo ?\r\n\r\nMortimer takes a fork on the table and stabs Jonathan's leg with\r\nit.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       We can't leave him here in the window-seat. Johnny ?\r\n<b>       JONATHAN\r\n</b>       Doctor, you know, Doctor, I've completely lost track of\r\n       Mister Spenalzo.\r\n\r\n<b>       MORTIMER\r\n</b>       Wait ! Who's this Mister Spenalzo ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       A friend of ours Johnny was looking for.\r\n\r\n<b>       MORTIMER\r\n</b>       Don't you bring anyone else in here. Now, come on, beat it,\r\n       both of you !\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       It's all right, Johnny. While we are packing, I'll tell you\r\n       about him.\r\n\r\nJonathan walks to the staircase, and starts going upstairs,\r\nfollowed by Einstein. He stops a few steps before he reaches the\r\nbalcony.\r\n<b>       JONATHAN\r\n</b>       I'll take care of you, Mortimer, in just a little while.\r\n\r\nHe resumes his walking upstairs.\r\n\r\n<b>       MORTIMER\r\n</b>       How do you like that ? The guy stays away for twenty years\r\n       and picks tonight of all nights to come back. Oh, Elaine,\r\n       what are you doing here ?\r\n\r\nShe falls in his arms.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer !\r\n\r\n<b>       MORTIMER\r\n</b>       What's the matter, darling ?\r\n\r\n<b>       ELAINE\r\n</b>       I almost got killed.\r\n\r\n<b>       MORTIMER\r\n</b>       Killed ? Aunt Abby, Aunt Martha !\r\n\r\n<b>       ABBY\r\n</b>       Oh, no !\r\n\r\n<b>       MARTHA\r\n</b>       Oh, no ! It was Jonathan !\r\n\r\n<b>       ABBY\r\n</b>       He mistook her for a sneak thief.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, that.\r\n\r\nMartha just found the shoe on the table and seems very intrigued\r\nby it.\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       It was worse than that. He's some kind of a maniac.\r\n\r\nAbby looks at the shoe, and seems also very intrigued. Martha\r\nwhispers something to her.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       I know, darling, I know.\r\n\r\n<b>       ELAINE\r\n</b>       (voice over)\r\n       Oh, Mortimer, I'm afraid of him.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       Oh, darling, don't worry about it. I'm here now. Now forget\r\n       it.\r\n\r\nAbby whispers back to Martha, who puts the shoe back on the table.\r\nThe two sisters move away.\r\n\r\n<b>       ELAINE\r\n</b>       We were married today, we were going over Niagara Falls in\r\n       a barrel, your brother tries to strangle me, a taxi's\r\n       waiting, and now you want to sleep on a window-seat !\r\n\r\nMortimer hardly listens to her, but catches the last word.\r\n\r\n<b>       MORTIMER\r\n</b>       Window seat... Witherspoon. Darling, you'd better run along\r\n       home.\r\n\r\n<b>       ELAINE\r\n</b>       What ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, yes. Go home like a good girl. I got things to do.\r\n\r\nHe sits at the desk and starts dialing on the telephone.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer ? But... but...\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, please.\r\n       (in the phone)\r\n       Hello ? Operator ? Get me Happy Dale 2-7-0, please.\r\n\r\n<b>       ELAINE\r\n</b>       But, Mortimer, didn't you hear what I was just saying ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, 2-7-0.\r\n\r\n<b>       ELAINE\r\n</b>       Your own brother Jonathan, he was trying to strangle me !\r\n<b>       MORTIMER\r\n</b>       Please ! This is important !\r\n\r\n<b>       ELAINE\r\n</b>       That ?\r\n\r\n<b>       MORTIMER\r\n</b>       Hello ? Oh, hello, Mr. Witherspoon ? This is Mortimer\r\n       Brewster.\r\n\r\n<b>WITHERSPOON'S OFFICE - INTERIOR NIGHT\r\n</b>\r\nWitherspoon is sitting behind his desk, the telephone receiver to\r\nhis ear.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Yes, Mr. Brewster, yes.\r\n\r\nHe puts an effervescent pill in a glass of water.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Well, I don't understand you.\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nElaine is crying, standing near the desk, where Mortimer is still\r\non the telephone.\r\n\r\n<b>       MORTIMER\r\n</b>       (in the phone)\r\n       Look, look, I...\r\n\r\nHe raises his head to look at Elaine\r\n\r\n<b>       ELAINE\r\n</b>       He was going to kill me !\r\n\r\n<b>       MORTIMER\r\n</b>       (to Elaine)\r\n       Wait a minute, I can't hear the man.\r\n       (to Witherspoon on the phone)\r\n       What ? I've got the papers all drawn up. I know it's late,\r\n       but I want you to come down here and get my brother\r\n       immediately ! I's got to be done.\r\n       (to Elaine)\r\n       Please, darling, please.\r\n\r\n<b>WITHERSPOON'S OFFICE - INTERIOR NIGHT\r\n</b>\r\n<b>       WITHERSPOON\r\n</b>       By the way, you've had the papers signed by your brother\r\n       and the doctor, of course ?\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer seems surprised by the question.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, the doctor ? Oh, holy mackerel ! I forgot the doctor !\r\nMortimer takes a piece of paper from the inside pockets of his\r\njacket and puts it on the desk. Elaine is still whining at his\r\nside.\r\n<b>        ELAINE\r\n</b>        Mortimer !\r\n\r\n<b>       MORTIMER\r\n</b>       (yelling to Elaine)\r\n       Please, be quiet ! Can't you see I've got to get a doctor ?\r\n       (to Witherspoon on the phone)\r\n       Hello ? What kind of a doctor ? A family doctor ?\r\n\r\n<b>       ELAINE\r\n</b>       You can take your honeymoon, your wedding ring, your taxi,\r\n       your window-seat, and put them in a barrel, and push them\r\n       all over Niagara Falls !\r\n\r\nShe walks away\r\n\r\n<b>       MORTIMER\r\n</b>       (to the departing Elaine)\r\n       Thank you, darling. Thank you.\r\n       (to Witherspoon on the phone)\r\n       Oh, look, why don't you come down here anyway ? While\r\n       you're getting here, I'll get Teddy's and the doctor's\r\n       signatures both.\r\n\r\nThe front door slams violently. Mortimer turns around.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah. Elaine ! Elaine !\r\n       (to Witherspoon)\r\n       Yeah, I'll get both signatures. Yeah, well, come right\r\n       away.\r\n\r\nHe puts the phone down.\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine ? What's the matter with her ?\r\n\r\nHe stands up and runs across the room to the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, dear !\r\n\r\nHe kneels on the window-seat and looks through the open window.\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine ! Elaine !\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nLarge shot of Reverend Harper's residence. Elaine enters the front\r\ndoor, and slams the door behind her.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer is still looking through the open window.\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine !\r\n\r\nHe enters back into the room, and sits on the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       (whispering to himself)\r\n       Oh, let me sit down. Let me think about this thing. Doctor,\r\n       Teddy, signature...\r\n\r\nHe looks at the seat.\r\n\r\n<b>       MORTIMER\r\n</b>       Hoskins !\r\n\r\nHe remains seated a few seconds in deep thought, then he gives a\r\nquick look outside the window, stands up and starts lifting the\r\nlid. The lid creaks. Mortimer seems very surprised by what he sees\r\ninside the seat. He opens the lid completely and let it rest on\r\nthe bottom of the window.\r\n\r\n<b>       MORTIMER\r\n</b>       Ye gods ! There's another one !\r\nHe closes the lid and walks across the room toward the kitchen\r\ndoor.\r\n\r\n<b>       MORTIMER\r\n</b>       Aunt Abby ! Aunt Martha ! Come in here !\r\n\r\n<b>       ABBY\r\n</b>       (voice over from the kitchen)\r\n       We're busy.\r\n\r\n<b>       MORTIMER\r\n</b>       No, you come in here now !\r\n\r\nAbby, still in funeral clothes, enters the room through the\r\nkitchen door.\r\n\r\n<b>       ABBY\r\n</b>       Yes, dear, what is it ? Where's Elaine ?\r\n\r\n<b>       MORTIMER\r\n</b>       Wait a minute. Didn't you promise me not to let anyone in\r\n       the house while I was gone ?\r\n\r\n<b>       ABBY\r\n</b>       Jonathan just walked in.\r\n\r\n<b>       MORTIMER\r\n</b>       I don't mean Jonathan !\r\n\r\n<b>       ABBY\r\n</b>       And Doctor...\r\n\r\n<b>       MORTIMER\r\n</b>       And I don't mean Doctor Einstein ! Who is that in the\r\n       window-seat ?\r\n\r\n<b>       ABBY\r\n</b>       We told you. Mister Hoskins.\r\n\r\n<b>       MORTIMER\r\n</b>       He is not Mister Hoskins !\r\n\r\nHe opens the window-seat wide and let the lid rest on the bottom\r\nof the window.\r\n\r\n<b>       MORTIMER\r\n</b>       There !\r\n\r\nAbby walks to the window-seat and looks inside, surprised.\r\n\r\n<b>       ABBY\r\n</b>       Who can that be ?\r\n\r\n<b>       MORTIMER\r\n</b>       You're trying to tell me you've never seen that man\r\n       before ?\r\n\r\n<b>       ABBY\r\n</b>       I certainly am. Well, this is a fine how-do-you-do ! It's\r\n       getting so anyone thinks he can walk in this house !\r\n\r\n<b>       MORTIMER\r\n</b>       Now, you look here, Aunt Abby. Don't you try to get out of\r\n       this ! That's another one of your gentlemen, and you know\r\n       it !\r\n\r\n<b>       ABBY\r\n</b>       Mortimer, how can you say such a thing ? That man's an\r\n       impostor. And if he came here to be buried in our cellar,\r\n       he's mistaken.\r\n\r\n<b>       MORTIMER\r\n</b>       You admitted to me you put Mister Hoskins in the window-\r\n       seat.\r\n\r\n<b>       ABBY\r\n</b>       Yes, I did.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, this man couldn't have got the idea from Mister\r\n       Hoskins !\r\n\r\n<b>       ABBY\r\n</b>       Oh, no.\r\n\r\n<b>       MORTIMER\r\n</b>       By the way, where is Mister Hoskins ?\r\n\r\nMortimer starts looking around the room.\r\n\r\n<b>       ABBY\r\n</b>       He must have gone to Panama.\r\n\r\n<b>       MORTIMER\r\n</b>       What ? You buried him ?\r\n\r\n<b>       ABBY\r\n</b>       No, no, not yet. He's just down there waiting for the\r\n       services, poor dear. We haven't had a minute, what with\r\n       Jonathan in the house.\r\n\r\nMortimer suddenly realizes the corpse could be a «friend» of\r\nJonathan. He quickly closes the lid.\r\n\r\n<b>       ABBY\r\n</b>       Oh, dear. We've always wanted to hold a double funeral.\r\n       But I will not read services over a total stranger !\r\n\r\nShe walks back to the kitchen. Mortimer catches her.\r\n\r\n<b>       MORTIMER\r\n</b>       A total stranger. Aunt Abby, how can I believe you ? There\r\n       are twelve men down there, some you admit you poisoned\r\n       them !\r\n\r\n<b>       ABBY\r\n</b>       Yes, I did. But you don't think I'd stoop to telling a\r\n       fib ! Martha !\r\nShe enters the kitchen.\r\n\r\n<b>       ABBY\r\n</b>       Martha ! Martha ! What do you think has happened ?\r\n\r\n<b>       MORTIMER\r\n</b>       «A fib !»\r\n\r\nMortimer starts dancing around the room. Then he hears a door\r\nclosing on the balcony, and he sits on the window-seat. We see\r\nJonathan on the balcony. He starts going downstairs. Mortimer goes\r\ntoward him.\r\n\r\n<b>       MORTIMER\r\n</b>       Jon... Oh-oh... Ah-ah...\r\n\r\n<b>       JONATHAN\r\n</b>       This may interest you, Mortimer. I've decided that we're\r\n       staying. And I've also decided that you're leaving, and I\r\n       mean now.\r\n\r\n<b>       MORTIMER\r\n</b>       Listen, handsome. I'm in no mood to debate the question.\r\n       Are you getting out, or am I throwing you out on your ear?\r\n\r\n<b>       JONATHAN\r\n</b>       I've led a strange life, Mortimer.\r\n\r\nAbby comes in through the kitchen door, followed by Martha.\r\n\r\n<b>       ABBY\r\n</b>       Martha, you come straight along here. You just look and see\r\n       what's in that window-seat.\r\n\r\nJonathan and Mortimer both rushes across the room and sit on the\r\nwindow-seat\r\n\r\n<b>       MORTIMER\r\n</b>       No. No, no, Aunt Abby, don't...\r\n\r\nHe stops when he realizes that Jonathan is sitting with him. He\r\nsuddenly understands the situation, and shows a broad smile to his\r\nbrother. He then stands up\r\n\r\n<b>       MORTIMER\r\n</b>       Jonathan, let Aunt Martha see what's in the window-seat.\r\n\r\nJonathan's face shows that he is no more so sure of himself.\r\n\r\n<b>       MORTIMER\r\n</b>       Aunt Abby, darling, I owe you an apology.\r\n\r\nHe kisses her on the forehead.\r\n\r\n<b>       MORTIMER\r\n</b>       I've got some very good news for you. Jonathan is leaving.\r\n       And he's taking Doctor Einstein and that cold companion\r\n       with him.\r\n       (to Jonathan)\r\n       Listen, Jonathan. You're my brother, you're a Brewster. So,\r\n       I'm giving you a chance to get away and take the evidence\r\n       with you. You can't ask for more than that. Well ?\r\n\r\nJonathan doesn't move from the window-seat.\r\n\r\n<b>       MORTIMER\r\n</b>       All right, in that case, I'll have to call the police.\r\n\r\nHe goes to the desk.\r\n\r\n<b>       JONATHAN\r\n</b>       Don't reach for the telephone. Remember, what happened to\r\n       Mister Spenalzo can happen to you, too.\r\n\r\nMortimer picks up the phone.\r\n\r\n<b>       MARTHA\r\n</b>       Spenalzo ?\r\n\r\n<b>       ABBY\r\n</b>       I knew he was a foreigner.\r\n\r\n<b>       JONATHAN\r\n</b>       Put down that telephone, Mortimer.\r\n\r\nJonathan puts his hand to his pocket, to take his gun. The\r\ndoorbell rings and we see a policeman's shadow through the frosted\r\nglass. Jonathan stands up and Abby rushes to the door.\r\n\r\n<b>       ABBY\r\n</b>       Oh...\r\n\r\nShe opens the door on O'Hara. He is smiling and he's got his stick\r\nin his hand.\r\n\r\n<b>       O'HARA\r\n</b>       Hello !\r\n<b>       ABBY\r\n</b>       Oh, Officer O'Hara !\r\n\r\n<b>       O'HARA\r\n</b>       I saw the lights and thought you might have sickness in the\r\n       house...\r\n\r\n<b>       ABBY\r\n</b>       No...\r\n\r\nHe looks around.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, you got company ? Oh, I'm sorry I disturbed you.\r\n\r\nHe starts to walk back out, but Mortimer stops him.\r\n\r\n<b>       MORTIMER\r\n</b>       No ! Come in.\r\n\r\n<b>       ABBY\r\n</b>       Yes, do come in.\r\nShe closes the door behind him.\r\n\r\n<b>       MARTHA\r\n</b>       Come right in, Officer O'Hara. This is our nephew,\r\n       Mortimer.\r\n\r\nThey shake hands, both smiling.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, pleased to meet you.\r\n\r\n<b>       MORTIMER\r\n</b>       And glad to see you, fellow.\r\n\r\n<b>       ABBY\r\n</b>       And this is another nephew, Jonathan.\r\n\r\n<b>       O'HARA\r\n</b>       Pleased to make your acquaintance. Hey, your face is\r\n       familiar. Haven't I seen a picture of you somewhere\r\n       before ?\r\n\r\n<b>       JONATHAN\r\n</b>       I don't think so.\r\n\r\n<b>       O'HARA\r\n</b>       I'll be running along.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, come on. What's the hurry ? Why don't you stick around\r\n       until my brother leaves.\r\n\r\n<b>       O'HARA\r\n</b>       I got to ring in, Mr. Brew... Say, you're not «the»\r\n       Mortimer Brewster, the book-writer and the dramatic critic,\r\n       are you ?\r\n<b>       MORTIMER\r\n</b>       Yes, why ?\r\n\r\n<b>       O'HARA\r\n</b>       Oh, what a break for me ! I'm a playwright.\r\n\r\n<b>       MORTIMER\r\n</b>       No ?\r\n\r\n<b>       O'HARA\r\n</b>       I'm working on a play now.\r\n\r\n<b>       MORTIMER\r\n</b>       You are ?\r\n\r\n<b>       O'HARA\r\n</b>       Yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, well, well ! Maybe I can help you with it.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, would you ? Oh, what a break ! I get wonderful ideas,\r\n       but I can't spell them.\r\n\r\n<b>       MORTIMER\r\n</b>       You can't ?... Oh, I can spell like the dickens.\r\n       Constantinople ? Come on, come on, let's go into the\r\n       kitchen.\r\n\r\n<b>       O'HARA\r\n</b>       All right.\r\n\r\n<b>       MORTIMER\r\n</b>       You can tell me all about it.\r\n       (to Abby)\r\n       Couldn't you whip up a sandwich for Officer O'Hara ?\r\n\r\n<b>       MARTHA\r\n</b>       I hope you don't mind eating in the kitchen, Officer\r\n       O'Hara.\r\n\r\n<b>       O'HARA\r\n</b>       And where else would you eat ?\r\n\r\nThey all enter the kitchen, laughing, and leaving Jonathan alone\r\nin the room. Mortimer lets them in, but comes back into the\r\nsitting-room, closing the kitchen door behind him.\r\n\r\n<b>       MORTIMER\r\n</b>       (to the policeman and his aunts)\r\n       See you in a moment.\r\n\r\nHe crosses the room toward Jonathan\r\n\r\n<b>       MORTIMER\r\n</b>       Now, listen, Jonathan, this is your last chance. I'll keep\r\n       O'Hara busy in the kitchen and give you a chance to get\r\n       out. All three of you : you, Doctor Einstein and Spenalzo.\r\n<b>       JONATHAN\r\n</b>       Mortimer...\r\n\r\n<b>       MORTIMER\r\n</b>       Now if you don't leave here in five minutes, I'll bring in\r\n       Officer O'Hara, and introduce him to Mr. Spenalzo.\r\n\r\nHe opens the lid of the window-seat. But O'Hara comes into the\r\nroom and Mortimer quickly closes the lid.\r\n\r\n<b>       O'HARA\r\n</b>       Mister Brewster, my play takes place in...\r\n\r\nMortimer moves him back to the kitchen.\r\n\r\n<b>       MORTIMER\r\n</b>       I'll be right with you, O'Hara. Right with you. Right with\r\n       you. Just give me one moment.\r\n\r\nMortimer closes the door behind O'Hara and turns toward Jonathan.\r\n\r\n<b>       MORTIMER\r\n</b>       Now get going ! All three of you.\r\n\r\nHe enters the kitchen, and closes the door behind him. Einstein\r\narrives silently behind Jonathan and taps on this shoulder.\r\nJonathan turns quickly around. He then goes to the kitchen door\r\nand comes back to Einstein.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor, this affair between my brother and myself has got\r\n       to be settled.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But, Johnny, we've got trouble enough as it is. Come, let's\r\n       go.\r\n\r\n<b>       JONATHAN\r\n</b>       We're not going. We're going to sleep right here in this\r\n       house.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       What ? With a cop in the kitchen and Spenalzo in the\r\n       window-seat ?\r\n\r\n<b>       JONATHAN\r\n</b>       That's all he's got on us. We'll take Spenalzo and dump him\r\n       in the bay. After that, we're coming back here. Then if he\r\n       tries to interfere...\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, no, Johnny. No, please.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor, we've got a wonderful setup here. We can make a\r\n       fortune. Two old ladies as a front. Only Mortimer stands in\r\n       our way. I never did like Mortimer.\r\n\r\nHe goes toward the kitchen door. Einstein catches up with him.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, Johnny, please, take it easy. Please !\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor, you know when I make up my mind...\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah, I know, when you make up your mind, you lose your\r\n       head. Look, Johnny, Brooklyn ain't a good setup for you.\r\n\r\nJonathan takes Einstein's hand, twists it and brings Einstein down\r\non the floor.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Okay, Johnny. Okay !\r\n\r\nJonathan releases Einstein's hand, who stands up to massage his\r\nhand.\r\n\r\n<b>       JONATHAN\r\n</b>       Take the instruments and hide them in the cellar. Move\r\n       fast.\r\nEinstein takes the suitcase and walks to the cellar. Jonathan\r\nopens the lid of the window-seat.\r\n\r\n<b>BREWSTER RESIDENCE - KITCHEN - INTERIOR NIGHT\r\n</b>\r\nIn the kitchen, the Brewster sisters are moving around the room,\r\npreparing food on the table. Both men are standing up near the\r\ntable. O'Hara, without his cap on his head, has a sandwich in his\r\nhand.\r\n\r\n<b>       O'HARA\r\n</b>       Mister Brewster, you don't know what goes on in Brooklyn.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, I don't know.\r\n\r\nO'Hara picks up a cup on the table.\r\n\r\n<b>       O'HARA\r\n</b>       No. My mother was an actress.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh ? Legitimate ?\r\n\r\n<b>       O'HARA\r\n</b>       Of course she was. She was my mother.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, excuse me.\r\n\r\n<b>       O'HARA\r\n</b>       Peaches La Tour was her name.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nThe door to the cellar is open. Einstein rushes up from the\r\ncellar. He looks a bit frightened.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny, Johnny, come quick !\r\n\r\nJonathan, who was looking down into the open window-seat, stands\r\nup.\r\n\r\n<b>       JONATHAN\r\n</b>       What's the matter ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You know that hole in the cellar ?\r\n\r\n<b>       JONATHAN\r\n</b>       Yes.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Well, we got an ace in the hole.\r\n\r\nJonathan closes the window-seat, and walks toward the cellar.\r\n\r\n<b>BREWSTER RESIDENCE - KITCHEN - INTERIOR NIGHT\r\n</b>O'Hara is explaining something to Mortimer.\r\n\r\n<b>       O'HARA\r\n</b>       It's no fly-by-night idea. I've been working on this thing\r\n       for twelve years.\r\n\r\nMortimer, who had just heard the creaking of the lid of the\r\nwindow-seat, turns back toward the policeman.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, you have ?\r\n\r\n<b>       O'HARA\r\n</b>       Yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, rehash it in your mind. I'll be back in a minute.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, swell.\r\n\r\n<b>       MORTIMER\r\n</b>       I like the first act.\r\n\r\n<b>       O'HARA\r\n</b>       But I didn't tell you the first act, Mister Brew... I...\r\n\r\nBefore he can finish his sentence, Mortimer is already out of the\r\nroom.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer enters the empty sitting-room. He goes to the window-\r\nseat, opens it and talks to the corpse.\r\n\r\n<b>       MORTIMER\r\n</b>       No, I thought I told you...\r\nHe closes the lid, kneels on the seat and looks through the open\r\nwindow.\r\n\r\n<b>       MORTIMER\r\n</b>       Jonathan ! Jonathan ! Jonathan !\r\n\r\nJonathan enters from the cellar, followed by Einstein.\r\n\r\n<b>       JONATHAN\r\n</b>       Yes, Mortimer.\r\n\r\nMortimer turns around and looks, surprised, at his brother. Then\r\nhe comes into the room\r\n\r\n<b>       MORTIMER\r\n</b>       What are you two doing still here ? I thought I told you to\r\n       beat it.\r\n\r\n<b>       JONATHAN\r\n</b>       We're not going.\r\n<b>       MORTIMER\r\n</b>       You're not going ?\r\n\r\n<b>       JONATHAN\r\n</b>       No.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No.\r\n\r\n<b>       MORTIMER\r\n</b>       You stay out of this. All right, you asked for it.\r\n\r\nHe goes to the kitchen door, which he opens slightly.\r\n\r\n<b>       MORTIMER\r\n</b>       Officer O'Hara ?\r\n\r\n<b>       O'HARA\r\n</b>       (voice over from the kitchen)\r\n       Coming.\r\n\r\nMortimer comes back in the middle of the room.\r\n\r\n<b>       JONATHAN\r\n</b>       Now, if you tell O'Hara what's in the window-seat, I'll\r\n       tell him what's down in the cellar.\r\n\r\n<b>       MORTIMER\r\n</b>       Cellar ?\r\n\r\n<b>       JONATHAN\r\n</b>       There's an elderly gentleman down there who seems to be\r\n       very dead.\r\n\r\n<b>       MORTIMER\r\n</b>       What were you doing down the cellar ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But what is he doing in the cellar ?\r\n\r\n<b>       JONATHAN\r\n</b>       Now what are you going to tell O'Hara ?\r\n\r\nO'Hara comes into the room from the kitchen.\r\n\r\n<b>       O'HARA\r\n</b>       Hey, your aunts heard my opening, it's swell. They want to\r\n       hear the rest. Shall I bring them in here ?\r\n\r\nHe starts going back into the kitchen, but Mortimer stops him.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, no, no. You can't do that now. You'd better ring\r\n       in.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, the heck with ringing in ! You got me rolling now.\r\n       I want to tell you the whole plot.\r\n\r\n<b>       MORTIMER\r\n</b>       You know, you can't tell me in front of those two fellas,\r\n       they wouldn't appreciate it.\r\n\r\n<b>       O'HARA\r\n</b>       Huh ? Hey, lowbrows, huh ?\r\n\r\n<b>       MORTIMER\r\n</b>       Let's go some place we can be alone. I'll meet you there\r\n       later.\r\n\r\nO'Hara puts his cap back on his head.\r\n\r\n<b>       O'HARA\r\n</b>       Okay. Say ! How about the back room at Kelly's ?\r\n\r\n<b>       MORTIMER\r\n</b>       Kelly's ?\r\n\r\n<b>       O'HARA\r\n</b>       Yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh yeah, fine place for Bohemian atmosphere. Genius at\r\n       work.\r\n\r\nHe escorts O'Hara to the front door.\r\n\r\n<b>       MORTIMER\r\n</b>       You ring in and I'll meet you at Kelly's.\r\n\r\n<b>       O'HARA\r\n</b>       Fine.\r\n\r\n<b>       MORTIMER\r\n</b>       Fine.\r\n\r\n<b>       JONATHAN\r\n</b>       Why don't you both go down in the cellar ?\r\n<b>       O'HARA\r\n</b>       That's all right with me.\r\n\r\nO'Hara starts moving toward the cellar, but Mortimer stops him.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, no. There's a much more literary atmosphere in\r\n       Kelly's, I assure you.\r\n\r\n<b>       O'HARA\r\n</b>       Okay.\r\n\r\n<b>       MORTIMER\r\n</b>       We'll meet later\r\n\r\n<b>       O'HARA\r\n</b>       This opening will kill you.\r\n\r\nHe opens the door and starts going out.\r\n\r\n<b>       MORTIMER\r\n</b>       You will.\r\n\r\n<b>       O'HARA\r\n</b>       I'm waiting to be born, you see, and the doctor comes in...\r\n\r\nMortimer, who was pushing O'Hara outside, suddenly slaps his\r\nforehead with his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, the doctor !\r\n\r\n<b>       O'HARA\r\n</b>       Yeah !\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah. Now, Look, you ring in and I'll see you later.\r\n\r\n<b>       O'HARA\r\n</b>       Okay. You won't stand me up, will you, Mister Brewster ?\r\n\r\n<b>       MORTIMER\r\n</b>       No.\r\n\r\n<b>       O'HARA\r\n</b>       This is a great play, you'll like it. I'll see you down\r\n       there.\r\n\r\n<b>       MORTIMER\r\n</b>       Can't wait ! Can't wait !\r\n\r\nMortimer closes the door.\r\n\r\n<b>       MORTIMER\r\n</b>       Doctor, doctor. Where are those papers ? Oh, there they\r\n       are.\r\n\r\nHe goes to the desk and picks up his papers. He then turns to\r\nJonathan and Einstein, still standing by the cellar door.\r\n<b>       MORTIMER\r\n</b>       Oh, oh-oh ! You're smug, aren't you? You think you've got\r\n       it over me. But you haven't. You think I'm afraid to go to\r\n       the police about Spenalzo because you've got hold of\r\n       Hoskins. Well, I'm not !\r\n\r\nHe taps on his papers.\r\n\r\n<b>       MORTIMER\r\n</b>       The moment I get Spenalzo... I mean, the moment the doctor\r\n       signs this, I don't care who knows about him, Hoskins, I\r\n       mean. And you better feel the same way about Spenalzo. Yes,\r\n       Spenalzo !\r\n\r\nHe starts running upstairs.\r\n\r\n<b>       JONATHAN\r\n</b>       Where are you going ?\r\n\r\n<b>       MORTIMER\r\n</b>       To the Doctor. Where do you... Oh !\r\nMortimer stops and starts running downstairs, and then to the\r\nfront door.\r\n\r\n<b>       MORTIMER\r\n</b>       When I come back, I expect to find you gone. Wait for me !\r\n\r\nHe goes out and closes the door. Einstein takes a sip at his\r\nbottle.\r\n\r\n<b>       JONATHAN\r\n</b>       We'll wait for him.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Did he look guilty !\r\n\r\nThe two sisters come out of the kitchen.\r\n\r\n<b>       ABBY\r\n</b>       Well, Martha, I think we can start the services now.\r\n\r\nThey stop when they see Jonathan and Einstein.\r\n\r\n<b>       ABBY\r\n</b>       Oh ! We thought we heard you leave.\r\n\r\n<b>       JONATHAN\r\n</b>       Perish the thought, dear aunties. That was just Mortimer.\r\n       And speaking of services, Aunt Martha, will you make us\r\n       some coffee while we take Mister Spenalzo down to the\r\n       cellar ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, no. No, Jonathan. You've got to take him with you !\r\n\r\nJonathan opens the lid of the window-seat.\r\n\r\n<b>       JONATHAN\r\n</b>       There's a friend of Mortimer's downstairs waiting for him.\r\n\r\n<b>       ABBY\r\n</b>       A friend of Mortimer's ?\r\n\r\n<b>       JONATHAN\r\n</b>       Take his feet, Doctor. Mister Spenalzo and he will get\r\n       along fine together. They're both dead.\r\n\r\nThe two men bend down to take the corpse out of the window-seat.\r\n\r\n<b>       MARTHA\r\n</b>       Oh ! He must mean Mister Hoskins.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Mister Hoskins ?\r\n\r\nThe two men stand up and look at the sisters. Jonathan comes\r\ncloser to them.\r\n\r\n<b>       JONATHAN\r\n</b>       You know about what's down there ?\r\n<b>       ABBY\r\n</b>       Of course we do. And he's no friend of Mortimer's. He's one\r\n       of our gentlemen.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Your gentlemen ?\r\n\r\n<b>       MARTHA\r\n</b>       Yes. And we won't have any strangers buried in our cellar.\r\n\r\n<b>       JONATHAN\r\n</b>       But Mister Hoskins ?\r\n\r\n<b>       MARTHA\r\n</b>       Mister Hoskins is no stranger.\r\n\r\n<b>       ABBY\r\n</b>       Besides, there's no room for Mister Spenalzo. The cellar's\r\n       crowded already.\r\n\r\n<b>       JONATHAN\r\n</b>       Crowded ? With what ?\r\n\r\n<b>       ABBY\r\n</b>       There are twelve graves down there now.\r\n\r\nThe two men look at each other. Jonathan seems the most surprised.\r\n\r\n<b>       JONATHAN\r\n</b>       Twelve graves.\r\n\r\n<b>       ABBY\r\n</b>       That leaves very little room and we're going to need it.\r\n\r\n<b>       JONATHAN\r\n</b>       You mean that you and Aunt Martha have murdered twelve...\r\n<b>       ABBY\r\n</b>       Murdered ? Certainly not. It's one of our charities.\r\n\r\n<b>       MARTHA\r\n</b>       Why, what we've been doing is a mercy.\r\n\r\n<b>       ABBY\r\n</b>       So you just take your Mister Spenalzo out of here.\r\n\r\nThey turn to Einstein, who has seated himself and is laughing his\r\nhead off.\r\n\r\n<b>       JONATHAN\r\n</b>       You've done all that right here in this house and buried\r\n       them in the cellar ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       That's wonderful, Johnny !\r\n\r\nHe stands up.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       We've been chased all over the world, and they stay right\r\n       here in Brooklyn, and they do just as good as you do.\r\n\r\n<b>       JONATHAN\r\n</b>       What ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah. You got twelve, they got twelve.\r\n\r\nJonathan grabs Einstein by his shirt.\r\n\r\n<b>       JONATHAN\r\n</b>       I've got thirteen.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, Johnny, twelve. Don't brag.\r\n\r\n<b>       JONATHAN\r\n</b>       Thirteen.\r\n\r\nThey both starts counting on their fingers.\r\n\r\n<b>       JONATHAN\r\n</b>       There's Mister Spenalzo. Then the first one in London.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah.\r\n\r\n<b>       JONATHAN\r\n</b>       Two in Johannesburg, one in Sydney, one in Melbourne, two\r\n       in San Francisco, one in Phoenix, Arizona.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Phoenix ?\r\n\r\n<b>       JONATHAN\r\n</b>       The filling station.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Filling st... Oh, yes.\r\n\r\nHe mimes the gesture of one having his throat cut.\r\n\r\n<b>       JONATHAN\r\n</b>       Three in Chicago and one in South Bend. That makes\r\n       thirteen.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You cannot count the one in South Bend. He died of\r\n       pneumonia.\r\n\r\n<b>       JONATHAN\r\n</b>       He wouldn't have died of pneumonia if I hadn't shot him.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, no, Johnny, you cannot count him. You got twelve, they\r\n       got twelve. The old ladies is just as good as you are.\r\n\r\nBoth sisters seem very happy by Einstein's statement. They smile.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       They are, are they ? That's easily taken care of. All I\r\n       need is one more. That's all. Just one more. And I've a\r\n       pretty good idea who it is.\r\n\r\nHe looks menacingly at his two aunts, who do not smile anymore.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nMortimer is walking along the gate of the churchyard, dragging Dr.\r\nGilchrist with him. Gilchrist is trying to tie his necktie while\r\nwalking. Apparently, Mortimer didn't let him dress completely when\r\nhe took him out of his home.\r\n\r\n<b>       MORTIMER\r\n</b>       I'm a very lucky man to have caught you at home, Doctor\r\n       Gilchrist.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       This is most irregular, most irregular.\r\n\r\n<b>       MORTIMER\r\n</b>       I'm sorry to have dragged you out of bed, but, you see,\r\n       you're the only one who can help me.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       I know Teddy blows bugles, but I can't commit a man to an\r\n       institution just on that.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, well, if only you had a little talk with him, I assure\r\n       you you'd be convinced by him. Here's the house I...\r\n\r\nThey stop walking when they hear hymns sung by the Brewster\r\nsisters.\r\n\r\n<b>       MORTIMER\r\n</b>       There goes Hoskins.\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Who ?\r\n\r\nMortimer looks embarrassed : he doesn't want to explain to the\r\ndoctor who Hoskins is.\r\n\r\n<b>       MORTIMER\r\n</b>       What ? What ? Did I say... Oh, I...\r\n\r\nHe moves the doctor to the entrance of the churchyard.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, you better wait.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Here ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, I'll bring Teddy out. Well, you see, I wouldn't want\r\n       to alarm the old ladies, you know, seeing a doctor and\r\n       everything. You wait here, huh ?\r\nHe helps him finish tying his necktie.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       In the cemetery ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, that'll be good.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       It's Halloween.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, don't worry about that. At Halloween, the pixies won't\r\n       be out till after midnight. Now look, you wait here. Make\r\n       yourself comfortable. Pull up a tombstone. I'll be right\r\n       back.\r\n\r\nHe moves away to the house, and passes near the taxi, still\r\nwaiting.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey, 22.50 !\r\n\r\n<b>       MORTIMER\r\n</b>       What ?\r\n\r\n<b>       CAB DRIVER\r\n</b><b>       22.50 !\r\n</b>\r\n<b>       MORTIMER\r\n</b>       Oh, yes, looks good on you !\r\n\r\nHe hasn't stop walking, and goes into the house. The driver, who\r\nhad been following him, stops near the entrance of the house.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yeah ! Not the suit, the meter ! «Looks good on me.»\r\n<b>       22.50 !\r\n</b>\r\nA quick shot of Dr. Gilchrist waiting, frozen and slightly\r\nfrightened.\r\n\r\nThen back on the entrance of the house, near which the driver is\r\nstill standing. Teddy and Mortimer come out of the house. Teddy is\r\nback in his President Roosevelt costume.\r\n\r\n<b>       TEDDY\r\n</b>       Did you give him a twenty-one-gun salute ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, with a Maxim silencer.\r\n\r\nThe driver catches up with them.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey, you. Five more bucks and you'll own it.\r\n\r\nMortimer and Teddy don't stop walking. The driver follows them.\r\n<b>       MORTIMER\r\n</b>       Oh no, thanks. It wouldn't fit me.\r\n\r\nThe two men reach the place where Dr. Gilchrist is waiting.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Mister President, may I have the pleasure...\r\n\r\nTeddy seems very happy to meet Dr. Gilchrist, and shakes his hands\r\nvigorously.\r\n\r\n<b>       TEDDY\r\n</b>       Doctor Livingstone !\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Livingstone ?\r\n\r\n<b>       MORTIMER\r\n</b>       (to the doctor)\r\n       Well, that's what he presumes.\r\n       (to Teddy)\r\n       Mister President, the doctor would like to have a few words\r\n       with you in private.\r\n\r\nHe bows slightly.\r\n\r\n<b>       TEDDY\r\n</b>       Certainly. Welcome to Washington, doctor.\r\n\r\nHe shakes his hand again, then puts his arm around the doctor's\r\nshoulders and moves away with him into the churchyard.\r\n\r\n<b>       TEDDY\r\n</b>       Arlington is beautiful at this time of year, is it not,\r\n       doctor ?\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Yes, indeed.\r\nThe doctor looks back at Mortimer, seeming a little frightened.\r\nMortimer remains alone, with the papers in his hand. We still hear\r\nthe hymns sung by the Brewster sisters in the background.\r\n\r\n<b>       MORTIMER\r\n</b>       Well now, that's that. It gives me a chance to rest.\r\n\r\nHe sits down on a tombstone.\r\n\r\nReverse shot on Reverend Harper's house. Elaine opens the window\r\nof her room.\r\n\r\nBack to Mortimer seated on his tombstone. A little further behind\r\nhim, we see Teddy and the doctor talking.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, so far, so good.\r\n\r\nHe stands up.\r\n\r\n<b>       MORTIMER\r\n</b>       Not so good.\r\n\r\nHe runs to Elaine's window.\r\n\r\nThe cab driver looks at the scene with intrigued eyes.\r\n\r\nMortimer is now outside Elaine's window.\r\n\r\n<b>       ELAINE\r\n</b>       Do you or do you not love me ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Elaine. Elaine, how can you say such a thing ? Darling,\r\n       of course I love you.\r\n\r\n<b>       ELAINE\r\n</b>       Do you ?\r\n\r\nMortimer takes her in his arms.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, darling.\r\n\r\n<b>       ELAINE\r\n</b>       Hey, then why have you been treating me the way you have ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, Elaine.\r\n\r\nHe moves slightly away from her.\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine, Elaine, darling, I love you so much, I can't go\r\n       through with our marriage.\r\n\r\nShe goes slightly back into her room.\r\n\r\n<b>       ELAINE\r\n</b>       Have you suddenly gone crazy ?\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, I don't think so, but it's only a matter of time.\r\n       Now, look, darling, you wouldn't want to have children\r\n       with three heads, would you ? I mean, you wouldn't want to\r\n       set up housekeeping in a padded cell.\r\n\r\n<b>       ELAINE\r\n</b>       What are you talking about ?\r\n\r\n<b>       MORTIMER\r\n</b>       Well, I don't quite know really. Look, I probably should\r\n       have told you this before, but you see... well, insanity\r\n       runs in my family.\r\n\r\nWe hear very clearly the Brewster sisters singing their hymns.\r\n\r\n<b>       MORTIMER\r\n</b>       It practically gallops.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, darling, just because Teddy's a little strange, that\r\n       doesn't mean...\r\n\r\n<b>       MORTIMER\r\n</b>       Oh no, darling, no, no. It's way back before Teddy. No,\r\n       this goes back to the first Brewster, the one who came over\r\n       on the Mayflower. Yeah. You know, you know how in those\r\n       days the Indians used to scalp the settlers ? Well, he used\r\n       to scalp the Indians.\r\n\r\nElaine bends out of her window to hug Mortimer.\r\n\r\n<b>       ELAINE\r\n</b>       Darling, that's ancient history.\r\n\r\nMedium shot on the doctor and Teddy walking arm in arm among the\r\ntombstones.\r\n\r\n<b>       TEDDY\r\n</b>       Yes, Doctor, I'll run for a third term, but I won't be\r\n       elected. And that'll mean the last of the Roosevelts\r\n       in the White House.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       That's what you think.\r\n\r\n<b>       TEDDY\r\n</b>       Of course, if the country insists...\r\n\r\nBack to Elaine's room window. The young couple is still talking on\r\neither side of the window.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, darling, all this doesn't prove a thing. Look at your\r\n       aunts. They're Brewsters, aren't they ? They're the\r\n       sweetest, sanest people I've ever known.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah.\r\n\r\nHe turns around to listen to his aunts singing their hymns.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, even they have their peculiarities.\r\n\r\n<b>       ELAINE\r\n</b>       What of it ? So your family's crazy. So you're crazy.\r\n       That's the way I want you, the way I love you. I'm crazy\r\n       too, but kiss me.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no. I... Ohhh !\r\n\r\nMortimer hesitates a little and then gives a passionate kiss to\r\nElaine.\r\n\r\nBack to Teddy and the doctor. Teddy is vigorously shaking the\r\ndoctor's hand.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Goodbye, Ambassador. I've enjoyed this little talk very\r\n       much. Anytime you're in Washington, drop in to see me at\r\n       the White House.\r\n\r\nHe walks away, leaving the doctor very shaken by the experience.\r\nThe doctor runs to Mortimer, still outside Elaine's window and\r\nkissing her passionately. The doctor clears loudly his throat to\r\nattract Mortimer's attention.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       Those papers. Those papers.\r\n\r\n<b>       MORTIMER\r\n</b>       Go away.\r\n\r\nMortimer suddenly realizes what the doctor is talking about.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, papers ! Papers ! Yes.\r\n\r\nHe pulls the papers from his jacket pocket, and gives them to the\r\ndoctor.\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       I'll enjoy committing him to any place.\r\n\r\n<b>       MORTIMER\r\n</b>       You will ?\r\n\r\n<b>       DOCTOR GILCHRIST\r\n</b>       I've just been appointed Ambassador to Bolivia !\r\n\r\n<b>       MORTIMER\r\n</b>       Ah, you see ? Didn't I tell you ?\r\n\r\nElaine suddenly slams her window down... on Mortimer's fingers !\r\nMortimer yells because of the pain. The doctor looks up from the\r\npapers. Elaine also shut the inside shade down, shutting the room\r\ncompletely from the outside world.\r\n\r\n<b>       MORTIMER\r\n</b>       No. Don't worry about that. Just go on signing the papers.\r\n       Oh dear. Thank you.\r\n\r\nMortimer blows on his hurt fingers, then grabs the papers from the\r\ndoctor and runs away.\r\n\r\n<b>       MORTIMER\r\n</b>       Okay, thank you.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nClose-up on the empty window-seat, where just remains Mr.\r\nSpenalzo's hat.\r\n\r\nFrom the open cellar door, Martha is coming out, followed by Abby.\r\nThey are still dressed in their funeral clothes.\r\n\r\n<b>       ABBY\r\n</b>       All right ! All right ! We'll find out whose house this\r\n       is ! I'm warning you, you better stop it. There's no use\r\n       doing what you're doing, because it'll just have to be\r\n       undone.\r\n\r\n<b>       JONATHAN\r\n</b>       (voice over from the cellar)\r\n       Aunt Abby, go to bed !\r\n\r\n<b>       ABBY\r\n</b>       It's a terrible thing to do to bury a good Methodist with a\r\n       foreigner.\r\n\r\nMortimer comes rushing into the room with the papers in his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Hello.\r\n\r\nHe blows on the papers to dry the ink of the signature.\r\n\r\n<b>       ABBY\r\n</b>       Mortimer, where have you been ?\r\n\r\nMortimer starts running upstairs.\r\n\r\n<b>       MORTIMER\r\n</b>       Uh-uh ? Oh, I was getting some papers signed. Is Teddy in\r\n       his room ?\r\n\r\n<b>       MARTHA\r\n</b>       Oh, Mortimer, what is the matter with you ? Running around\r\n       getting papers signed at a time like this.\r\n\r\n<b>       ABBY\r\n</b>       Martha and I are going for the police.\r\n\r\n<b>       MORTIMER\r\n</b>       Police !\r\nHe quickly get back downstairs\r\n\r\n<b>       MORTIMER\r\n</b>       Oh-oh-oh ! Wait-wait-wait ! You can't go for the police.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, no ? You know what Jonathan's doing ?\r\n\r\n<b>       ABBY\r\n</b>       He's putting Mister Hoskins and Mister Spenalzo in\r\n       together.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, darling, let him.\r\n\r\n<b>BREWSTER RESIDENCE - CELLAR - INTERIOR NIGHT\r\n</b>\r\nEinstein just finished working, and he is cleaning the bottom of\r\nhis pants. We notice he is wearing Mr. Spenalzo's shoes. A shovel\r\nis resting on the wall near him.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       This is all fixed up nice now. Nice and smooth like a lake.\r\n       The President will be very proud of his Panama Canal.\r\n\r\nHe stretches himself\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh, Johnny, bed feels good already. You know, we didn't get\r\n       any sleep for forty-eight hours.\r\n\r\nJonathan walks behind him, carrying a shovel. He puts the shovel\r\ndown against the wall and start mounting the stairs\r\n\r\n<b>       JONATHAN\r\n</b>       You're forgetting, Doctor.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       What ?\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nMortimer is trying to calm his aunts down\r\n\r\n<b>       ABBY\r\n</b>       Now, look. If Jonathan and Mister Spenalzo aren't out this\r\n       house before morning, we're going for the police.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah, but I'll get them out, I promise you that !\r\n\r\n<b>       ABBY\r\n</b>       Then you get the wedding silver.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, but remember, no police ! No police ! All right.\r\n\r\nHe starts mounting the stairs.\r\n\r\n<b>       MORTIMER\r\n</b>       There's a thing. Look, go to bed, will you ? Fine. Get out\r\n       of those clothes ! You two look like a double blackout.\r\n\r\nHe reaches the balcony.\r\n\r\n<b>BREWSTER RESIDENCE - CELLAR - INTERIOR NIGHT\r\n</b>\r\nJonathan is standing on the bottom of the cellar staircase.\r\n\r\n<b>       JONATHAN\r\n</b>       My brother, Mortimer.\r\n\r\nHe goes back down in the cellar toward Einstein, who has his\r\nbottle in his hand.\r\n\r\n<b>       JONATHAN\r\n</b>       I just heard him upstairs.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, no, no ! I am tired. You forget, I got to operate on\r\n       your face tomorrow.\r\nHe sits down on the bottom steps of the stairs.\r\n\r\n<b>       JONATHAN\r\n</b>       (voice over. We just see his shadow on the wall behind\r\n       Einstein)\r\n       You are going to operate tomorrow, Doctor. But tonight we\r\n       are taking care of Mortimer.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, but Johnny, not tonight ! I'm sleepy. We'll do it\r\n       tomorrow. Or the next day.\r\n\r\n<b>       JONATHAN\r\n</b>       (voice over from the shadow on the wall)\r\n       Look at me, Doctor. You can see that it's got to be done,\r\n       can't you?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah, I know that look.\r\n\r\n<b>       JONATHAN\r\n</b>       (voice over from the shadow on the wall)\r\n       It's a little late to dissolve our partnership.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Okay, okay, Johnny, okay. We'll do it. But the quick way,\r\n       huh ? The quick twist like in London.\r\n\r\nHe mimes the breaking of a neck with his fingers, and then takes a\r\nsip from his bottle\r\n\r\n<b>       JONATHAN\r\n</b>       (voice over from the shadow on the wall)\r\n       No, Doctor. I think this calls for something special. I\r\n       think, perhaps, the Melbourne method.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Not the Melbourne method, please ! Two hours ! And then\r\n       when it was all over, what ? The fellow in London was just\r\n       as dead as the fellow in Melbourne.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nTeddy comes out of his room on the balcony, in his President\r\nRoosevelt costume. He takes his bugle to his mouth, ready to play\r\nit. Mortimer comes out of the room and lowers the bugle.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, no. Don't do that, Mister President.\r\n\r\n<b>       TEDDY\r\n</b>       But I cannot sign any proclamation without consulting my\r\n       Cabinet.\r\n\r\nMortimer puts the papers in front of his eyes.\r\n\r\n<b>       MORTIMER\r\n</b>       This must be secret.\r\n\r\nTeddy takes the papers and looks at them.\r\n<b>       TEDDY\r\n</b>       A secret proclamation ? How unusual.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, it's the only way we can outsmart the other fellow.\r\n\r\n<b>       TEDDY\r\n</b>       Who's the other fellow ?\r\n\r\n<b>       MORTIMER\r\n</b>       That's the secret.\r\n\r\n<b>       TEDDY\r\n</b>       Oh, I see ! Very clever. Well, if it's a a secret\r\n       proclamation, it has to be signed in secret.\r\n\r\nHe folds the papers.\r\n\r\n<b>       MORTIMER\r\n</b>       Of course, Mister President.\r\n\r\n<b>       TEDDY\r\n</b>       I'll have to put on my signing clothes.\r\n\r\nHe starts to move back to his room. Mortimer stops him.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you already have them on, Mister President.\r\n\r\nTeddy looks at his costume.\r\n\r\n<b>       TEDDY\r\n</b>       So I have. Wait here.\r\n\r\nHe goes back into his room and closes the door. Einstein appears\r\nat the bottom of the stairs.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Mister Brewster.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, what is it ? Mice ?\r\n\r\nEinstein climbs the stairs very rapidly. He takes Mortimer by the\r\nsleeve and whispers to him.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Mister Brewster, you get out of this house.\r\n\r\n<b>       MORTIMER\r\n</b>       Can't you see I'm busy ?\r\n\r\nHe tries to get rid of Einstein's hand on his sleeve.\r\n\r\nWe hear the bugle playing the first notes of Beethoven's fifth\r\nsymphony.\r\n\r\n<b>       MORTIMER\r\n</b>       (singing the same tune)\r\n       Ta-ta-ta taaa !\r\n\r\nHe knocks on Teddy's door. The papers are slid under the door.\r\nMortimer bends down to pick them up.\r\n\r\n<b>       MORTIMER\r\n</b>       Thank you, Mister President. Oh, what a load off my mind.\r\n       Boy, could I use a drink ! Thank God for that.\r\n\r\nHe starts going downstairs. Einstein follows him and takes his\r\nsleeve again.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       (whispering)\r\n       Get out of here, will you, please ?\r\n\r\n<b>       MORTIMER\r\n</b>       Huh ? What did you say ? Speak up, sonny. I can't hear you.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       (still whispering)\r\n       Johnny's in a bad mood. You get out of here !\r\n\r\n<b>       MORTIMER\r\n</b>       Stop underplaying. I can't hear you.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Please listen to me. Get out.\r\n\r\nMortimer gets rid of Einstein's hands on his sleeves.\r\n\r\n<b>       MORTIMER\r\n</b>       Stop all this ! What are you doing ? Look, Doc. Are you\r\n       really a doctor ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, Heidelberg, 1919. You go...\r\nHe takes his sleeve again and tries to move him to the front door.\r\n\r\n<b>       MORTIMER\r\n</b>       Heidelberg ? How'd you... How'd you come to hook up with\r\n       Jonathan ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       I tell you later about that, but you go now. Please listen\r\n       to me.\r\n\r\nThey've reached the front door. Mortimer takes Einstein's hand out\r\nof his sleeve.\r\n\r\n<b>       MORTIMER\r\n</b>       Tch-tch-tch ! Stop it, Doctor, now stop it !\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You get out of here ! Look, look, when Johnny's in that\r\n       mood, he's a madman. He's a maniac ! And then things\r\n       happen. Horrible things.\r\n\r\nHe mimes the cutting of his own throat, and takes Mortimer's hand\r\nto throw him out.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You get out of here !\r\n\r\n<b>       MORTIMER\r\n</b>       Will you stop it ? Now look, stop telling me about\r\n       Jonathan, I'll take care of Jonathan, and you take care of\r\n       yourself. Now, get going, little fellow.\r\n\r\nHe opens the door to throw him out. He pats him on the behind to\r\nmove him, and discover the shape of the bottle under his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       What's that ? What's that ? Wait a minute.\r\n\r\nHe takes the bottle out of Einstein's pocket\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh no ! My schnapps !\r\n\r\n<b>       MORTIMER\r\n</b>       I could use that. I could use that.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       That's mine.\r\n\r\nHe tries to get his bottle back, but Mortimer holds on it.\r\n\r\n<b>       MORTIMER\r\n</b>       Please. Only for dramatic critics. Now look, you beat it\r\n       before things start popping around here.\r\n\r\nHe moves away to the table, with the bottle in his hand. Einstein\r\njoins his hand in a praying gesture.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But, look, Mr. Brewster, please. You've just been married.\r\n       You have a nice little wife waiting for you. Please go now.\r\n       Please.\r\n\r\nMortimer pours some of the schnapps in a glass.\r\n\r\nEinstein slams the front door with a very nervous punch, and walks\r\ntoward Mortimer. He mumbles incomprehensible words, probably in\r\nGerman.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Tell me, don't those plays you see all the time teach you\r\n       anything ?\r\n\r\nMortimer is drinking. He lowers his glass.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, stop it, don't get me on the subject of plays ! I've\r\n       got a lot on my mind now. I've got to wait here for Mister\r\n       Witherspoon.\r\n\r\nHe looks at his watch.\r\n<b>       DOCTOR EINSTEIN\r\n</b>       At least people in plays act like they got sense.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you think so ? Did you ever see anybody in a play ever\r\n       act like they got intelligence ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       How can somebody be so stupid ?\r\n\r\n<b>       MORTIMER\r\n</b>       You ought to have my job a few nights. Listen to me,\r\n       brother. When you get out of prison, you have yourself\r\n       wheeled over to the Garrick Theater. Oh ! Oh ! There's a\r\n       play there that's been running so bad that it'll still be\r\n       running when you get out. Now, in this, there's a man...\r\n       Now listen to this...\r\n\r\nBehind Mortimer, the cellar door opens silently and Jonathan\r\nenters slowly into the room, without Mortimer noticing him.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, he knows he's in the house with murderers. So he ought\r\n       to know he's in danger. He's even been warned to get out of\r\n       the house. And does he go ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes.\r\n\r\n<b>       MORTIMER\r\n</b>       No, he doesn't. He stays ! This fellow doesn't even have\r\n       sense to be scared or to be on his guard. No, no. The\r\n       murderer even invites him to sit down. What do you think he\r\n       does ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Well, I don't know.\r\n<b>       MORTIMER\r\n</b>       He sits down ! I remember what he did. He deliberately\r\n       pulls up a chair like that and he sits down in it.\r\n\r\nMortimer goes to a wooden armchair and sits down in it. He puts\r\nhis glass on the table.\r\n\r\n<b>       MORTIMER\r\n</b>       Isn't that great ? So there he is, all waiting to be\r\n       trussed up and gagged. What do you think they used to truss\r\n       him up with ?\r\n\r\nHe keeps on laughing while talking.\r\n\r\nClose-up of Jonathan's face, smiling.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       (voice over)\r\n       Oh, what ?\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       The curtain cord.\r\n\r\nJonathan looks in the direction of the window... and the curtain\r\ncord.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Curtain cord ? But didn't he see him get it ?\r\n\r\nBehind the seated Mortimer, Jonathan is silently walking to the\r\nwindow.\r\n\r\n<b>       MORTIMER\r\n</b>       Seen him get it. No. The silly chump sits down with his\r\n       back toward the murderer.\r\n\r\nMortimer turns slightly on his chair, but without taking his eyes\r\noff Einstein, and, of course, without looking at his brother\r\nbehind him, quietly cutting the curtain cords with a jack-knife.\r\n\r\n<b>       MORTIMER\r\n</b>       All he has to do is look around, but does he ? No !\r\n\r\nMedium shot on Jonathan cutting the curtain cords.\r\n\r\n<b>       MORTIMER\r\n</b>       (voice over)\r\n       No... Look, you see, brother Heidelberg, in a play or even\r\n       in a movie, for that matter, ...a fellow never sees or\r\n       hears anything. No. That's right.\r\n\r\nJonathan folds the jack-knife and puts it in his pocket. He\r\nprepares the cords he has just cut. Einstein takes a napkin on the\r\ntable.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But what does he do ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, what does he do ? Well, the big chump sits there. This\r\n       fellow's supposed to be bright. He sits there.\r\n\r\nJonathan is now just behind Mortimer's chair, with the cord ready\r\nin his hands.\r\n\r\n<b>       MORTIMER\r\n</b>       Now get a load of this. Look, look at the attitude. Large\r\n       as life ! He sits there waiting to be tied up and gagged.\r\n       The big dope !\r\n\r\nHe bursts out laughing... But only for two seconds, because\r\nJonathan ties up his arm to the armchair from behind, and Einstein\r\nshoves the napkin in his open mouth. Einstein then helps Jonathan\r\nto tie Mortimer's legs to the legs of the armchair. Then, with the\r\nhelp of a knife, he puts all the napkin in Mortimer's mouth.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       You were right about that fellow. He wasn't very bright.\r\n\r\nFade out, and then fade in on the same scene a few moments later.\r\nThe lights have been dimmed. Mortimer is completely tied on the\r\nchair, and the gag is tied around his head.\r\n\r\n<b>       JONATHAN\r\n</b>       Yes, Mortimer. I've been away for twenty years. But never,\r\n       my dear brother, were you out of my mind.\r\n\r\nJonathan is lighting candles on the table.\r\n\r\n<b>       JONATHAN\r\n</b>       In Melbourne one night, I dreamt of you.\r\n\r\nHe opens his instruments case. We see the surgery instruments\r\nshining in the candles light.\r\n\r\nClose-up on Mortimer's very frightened face.\r\n\r\nEinstein sits down near the table. He seems depressed at the sight\r\nof his surgery instruments.\r\n\r\nJonathan takes a small phial from the inside pocket of his jacket,\r\nopens it, smells it and closes it, and puts it back in his pocket.\r\n\r\n<b>       JONATHAN\r\n</b>       The more you struggle, Mortimer, the more you strangle\r\n       yourself. Later on, you may consider that a blessing.\r\n\r\nHe takes a curved forceps from the case and plays with it.\r\n\r\nClose-up on Mortimer's frightened face.\r\n\r\nEinstein wipes his face with a napkin.\r\n\r\nJonathan takes a scalpel from the case and feels the sharpness of\r\nthe blade.\r\n\r\nEinstein takes a bottle on the table and brings it to his mouth.\r\nUnfortunately, the bottle is empty.\r\nJonathan takes a pair of surgery gloves from the box and puts them\r\non.\r\n\r\n<b>       JONATHAN\r\n</b>       Now, Doctor, we go to work.\r\n\r\nEinstein stands up.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Johnny, for me, please, the quick way. Please.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor, this must be an artistic achievement.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Please.\r\n\r\n<b>       JONATHAN\r\n</b>       After all, we're performing before a very distinguished\r\n       critic.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Johnny, please !\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor !\r\n\r\nEinstein takes his jacket off. He is almost crying.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       All right. Let's get it over with. No, but, Johnny, I\r\n       cannot see this without a drink.\r\n\r\n<b>       JONATHAN\r\n</b>       Pull yourself together, Doctor.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       But I can't pull myself together without a drink. Johnny,\r\n       you remember when we came in here, there was some wine. And\r\n       then they took it. Where did they put it ?\r\n\r\nA glint of hope appears in Mortimer's eyes at the mention of his\r\naunts' wine.\r\n\r\nEinstein runs across the room to the shelves where the carafe of\r\npoisoned wine has been put away.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Johnny, I found some wine. I found some wine.\r\n\r\nHe comes back to the table with the carafe and glasses.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Here, I'll split it with you. We both have a drink before\r\n       we operate. Oh, I am so happy that we don't have to operate\r\n       without a drink.\r\n\r\nEinstein gives a glass to Jonathan. Mortimer, who recognized the\r\ncarafe, is smiling behind his gag. Jonathan smells the glass.\r\nEinstein has his glass almost to his lips, when Jonathan stops\r\nhim.\r\n\r\n<b>       JONATHAN\r\n</b>       Doctor. One moment, please. Where are your manners ?\r\n       (to Mortimer)\r\n       Yes, Mortimer. I realize now that it was you who brought me\r\n       back to Brooklyn. We drink to you. Doctor ! To my dear,\r\n       dead brother.\r\n\r\nThey clink their glass in front of Mortimer's face. Einstein\r\nraises his glass before drinking.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Prosit !\r\n\r\nTeddy suddenly comes out of his room and plays his bugle very\r\nloudly.\r\n\r\nBoth Jonathan and Einstein drop their glass on the floor.\r\n\r\nTeddy then goes back into his room and slams the door. The grand-\r\nfather clock chimes once.\r\nMortimer seems very disappointed. He moves back and forth in his\r\nchair, moaning.\r\n\r\n<b>       JONATHAN\r\n</b>       That idiot ! He goes next. That's all. He goes next !\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Not Teddy ! Not Teddy ! Please !\r\n\r\n<b>       JONATHAN\r\n</b>       We'll get to him later.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Not Teddy, we won't get to him at all !\r\n\r\n<b>       JONATHAN\r\n</b>       Now, we have to work fast. The quick way.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Oh, the quick way, oh yes ! If it has to be, then the quick\r\n       way. Yes, I'll help you with it.\r\n\r\nThey starts getting the instruments out of the case.\r\n\r\nAt the front door, we see the shadow of a policeman behind the\r\nfrosted glass. He rings the doorbell.\r\n\r\nJonathan and Einstein stop what they were doing. Einstein closes\r\nthe case and puts it under the table. He also puts all the\r\ninstruments lying on the table on the floor, behind the case.\r\n\r\nKnocking on the door. The door being open, O'Hara enters the room.\r\nHe spots Jonathan and Einstein.\r\n\r\n<b>       O'HARA\r\n</b>       Hey, the colonel has to quit blowing that horn.\r\n<b>       JONATHAN\r\n</b>       It's all right, Officer. We're taking the bugle away from\r\n       him.\r\n\r\n<b>       O'HARA\r\n</b>       I'd better talk to him myself. Where's the lights ?\r\n\r\nHe finds the switch by the door, and switches the lights on. He\r\ngoes to the stairs and starts mounting them, when he hears\r\nMortimer moaning. He goes down and walks toward Mortimer.\r\n\r\n<b>       O'HARA\r\n</b>       Hey ! You stood me up ! I've been waiting for you for over\r\n       an hour at Kelly's. What happened to him ?\r\n\r\nO'Hara is surprised to find Mortimer tied up on his chair. He\r\npoints his stick to Jonathan.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Nothing. He was explaining a play he saw the other night\r\n       and that's what happened to a poor man in the play.\r\nHe walks away with his jacket in his hands.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, I see. Did that really happen in a play you saw ? How\r\n       do you like that ? You can't trust nobody no more. They\r\n       practically stole that from the second act of my play. You\r\n       know, in the second act, just... Well, maybe I'd better\r\n       start at the beginning.\r\n\r\nMortimer is moving and moaning on his chair. He tries to explain\r\nby movements of his face that he would like to have his gag taken\r\noff.\r\n\r\nBehind O'Hara, Einstein starts mounting the stairs, and Jonathan\r\nstands up at the bottom of them.\r\n\r\n<b>       O'HARA\r\n</b>       Huh ? Oh, yes, sure.\r\n\r\nHe puts his hands to Mortimer's face to take off his gag.\r\n\r\nEinstein runs upstairs, followed by Jonathan.\r\n\r\nSuddenly, O'Hara removes his hands and smiles broadly.\r\n\r\n<b>       O'HARA\r\n</b>       Nooo ! You've got to hear the plot !\r\n\r\nHe takes his jacket off.\r\n\r\n<b>       O'HARA\r\n</b>       My mother's sitting there, making up, see. And, like a\r\n       flash, suddenly, out of a clear sky, the door comes open\r\n       and a man with a black mustache comes in.\r\n\r\nOn the stairs behind O'Hara, Jonathan takes his jack-knife out of\r\nhis pocket and opens it.\r\n<b>       O'HARA\r\n</b>       He turns to my mother and he says, «Miss Peaches La Tour,\r\n       will you marry me ?» That's the first scene. My mother\r\n       doesn't tell him they're married. That's the surprise !\r\n\r\nEinstein, who has seen the knife, tries to stop Jonathan. But\r\nJonathan keeps on walking slowly downstairs.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, What a kick ! All right. Twenty-five years pass. Well,\r\n       in the meantime, there's me. Growing into a magnificent\r\n       specimen. So what do I do ? I join the police force and\r\n       become one of New York's finest. Well, I'm cleaning out a\r\n       crooked laundry, see ?\r\n\r\nClose-up on Jonathan's hand holding the knife, the blade of which\r\nis shining in the light.\r\n\r\nMortimer stares at the knife\r\n\r\n<b>       O'HARA\r\n</b>       Little do I know it, but there is a dope fiend with a long\r\n       knife crawling after me. I'm in great danger. It's getting\r\n       you, ain't it ? I can see it in your eyes.\r\n\r\nActually, Mortimer's eyes are trying to attract O'Hara's attention\r\nto Jonathan, just behind him now.\r\n\r\n<b>       O'HARA\r\n</b>       Well, you ain't heard nothing yet.\r\n\r\nEinstein tries to stop Jonathan, but Jonathan pushes him away.\r\nEinstein takes off one of his shoes, and hits Jonathan very hard\r\non the head with it. Jonathan falls on the floor.\r\n\r\n<b>       O'HARA\r\n</b>       All of a sudden, a fire breaks out. What an effect ! The\r\n       firemen rush in and who do you think is leading them ?\r\n       Mayor Fiorello La Guardia !\r\n\r\nO'Hara turns around and sees Jonathan lying on the last steps of\r\nthe stairs.\r\n\r\n<b>       O'HARA\r\n</b>       What's the matter with him ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah, probably your play put him to sleep.\r\n\r\n<b>       O'HARA\r\n</b>       What ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       I personally, I like it very much.\r\n\r\n<b>       O'HARA\r\n</b>       It's probably over his head, huh ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yeah.\r\nO'Hara looks at Jonathan's face.\r\n\r\n<b>       O'HARA\r\n</b>       Where have I seen that face before ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       No, please.\r\n\r\nHe kneels beside Jonathan's body, and O'Hara returns to Mortimer.\r\n\r\n<b>       O'HARA\r\n</b>       Well, the scene changes. It's an evolving stage. I'm\r\n       walking along my beat, well, like that, casual-like, when a\r\n       guy that I'm following, it turns out he's really following\r\n       me !\r\n\r\nKnocks at the door. O'Hara turns to Einstein.\r\n\r\n<b>       O'HARA\r\n</b>       (to Einstein)\r\n       Don't let nobody in.\r\n       (to Mortimer)\r\n       I figure I'll outsmart him. There's a vacant house on the\r\n       corner.\r\n\r\nEinstein peeks through the drapes to have a look at the outside of\r\nthe front door. He rushes to Jonathan.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Hey, Johnny, the cops !\r\n\r\nEinstein tries to wake up Jonathan, but doesn't succeed. He picks\r\nup his shoe and rushes upstairs.\r\n\r\n<b>       O'HARA\r\n</b>       So, I ducks in there. I sees the door handle turn, so I\r\n       pulls out my gun, braces myself against the wall and I\r\n       says : «Come in !»\r\n\r\nHe takes out his gun and points it at the door. Brophy and another\r\ncop, officer Saunders, come in. When they see O'Hara's gun\r\npointing at them, they raise their arms. O'Hara puts his gun back\r\nin his holster and welcomes his colleagues.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, hello, boys.\r\n\r\n<b>       BROPHY\r\n</b>       What the Sam Hill's going on here ?\r\n\r\n<b>       O'HARA\r\n</b>       Hello Sarge, what do you think, this is Mortimer Brewster.\r\n       He's going to help me write my play.\r\n\r\n<b>       SAUNDERS\r\n</b>       Do you have to tie him up to make him listen ?\r\n\r\nHe starts to untie Mortimer.\r\n<b>       BROPHY\r\n</b>       O'Hara, you better report in the station. Why didn't you\r\n       ring in ? You got the whole force out looking for you.\r\n\r\n<b>       O'HARA\r\n</b>       Right in the middle of the second act. Did they send you\r\n       guys here looking for me ?\r\n\r\nBrophy goes to the telephone and starts dialing.\r\n\r\n<b>       BROPHY\r\n</b>       No, we came to warn the old ladies. There is a difficulty.\r\n       The colonel blew that bugle again.\r\n\r\n<b>       O'HARA\r\n</b>       Yeah, I heard him.\r\n\r\n<b>       BROPHY\r\n</b>       The neighbors are all phoning in. The Lieutenant's on the\r\n       warpath. He says we've got to put him away someplace.\r\n\r\nHe sees Jonathan lying on the steps.\r\n<b>       BROPHY\r\n</b>       Now, who the heck is this ?\r\n\r\n<b>       O'HARA\r\n</b>       Oh, that's Mister Brewster's brother. My play put him to\r\n       sleep.\r\n\r\n<b>       BROPHY\r\n</b>       Oh ! That's the one that ran away. So he came back.\r\n       (in the phone)\r\n       Brophy. Get me Mac.\r\n       (to O'Hara)\r\n       Haven't you got yourself in a mess ! You're two hours\r\n       overdue at the station. I better let them know that I found\r\n       you.\r\n\r\nO'Hara bends on Jonathan and shakes him\r\n\r\n<b>       O'HARA\r\n</b>       Hey ! It wasn't that bad, was it ?\r\n\r\n<b>       BROPHY\r\n</b>       (in the phone)\r\n       Mac ? Tell the Lieutenant he can call off the big manhunt.\r\n       We found him... At the Brewster house... Shall we bring him\r\n       in ?... All right, we'll hold him right here.\r\n\r\nHe puts the phone down and turns to O'Hara, who has succeeded in\r\nwaking up Jonathan and getting him on his feet. Jonathan stares at\r\nBrophy. He thinks Brophy is talking about him.\r\n\r\nMortimer looks at his left hand, which has just been freed by\r\nSaunders.\r\n\r\n<b>       BROPHY\r\n</b>       The Lieutenant is on his way over.\r\n<b>       JONATHAN\r\n</b>       So I've been turned in, hey ? All right, you've got me. I\r\n       suppose you and my stool-pigeon brother will split the\r\n       reward.\r\n\r\nBrophy and O'Hara each take one arm of Jonathan.\r\n\r\n<b>       BROPHY &amp; O'HARA\r\n</b>       Reward ?\r\n\r\n<b>       JONATHAN\r\n</b>       Yes, reward ! Now I'll do some turning in !\r\n\r\nMortimer, who had his hand and legs untied by Saunders but is\r\nstill gagged and has his chest still tied on the armchair, moans\r\nand moves excitedly on his seat.\r\n\r\n<b>       O'HARA\r\n</b>       (to Jonathan)\r\n       Oh, wait a minute, Mr. Brewster.\r\n\r\n<b>       JONATHAN\r\n</b>       You think my aunts are sweet, charming old ladies, don't\r\n       you ? Well, there's thirteen bodies buried in the cellar !\r\n       Yes, thirteen.\r\n\r\nMortimer jumps on his chair and try to scream through his gag.\r\nSince he cannot succeed to get off the chair, he stands up, still\r\ngagged and tied to the back of the chair and rushes to Brophy,\r\ncarrying the armchair with him.\r\n\r\n<b>       BROPHY\r\n</b>       Be careful what you say about your aunts, they happen to be\r\n       friends of ours.\r\n\r\n<b>       JONATHAN\r\n</b>       I'll show them to you.\r\n\r\n<b>       BROPHY\r\n</b>       Don't you make any trouble for them, do you hear me !\r\n\r\nMortimer walks between Brophy and Jonathan, and tries to say\r\nsomething to Brophy through his gag. Saunders, behind Mortimer,\r\nkeeps on untying him.\r\n\r\n<b>       BROPHY\r\n</b>       (to Mortimer)\r\n       Never mind, Mr. Brewster. Leave him to me, I'll take care\r\n       of him.\r\n\r\n<b>       JONATHAN\r\n</b>       (to O'Hara)\r\n       You come down to the cellar.\r\n\r\n<b>       O'HARA\r\n</b>       (to Jonathan)\r\n       Now, wait a minute.\r\n\r\nMortimer is still trying to talk through his gag to O'Hara and\r\nBrophy, and moves excitedly around the two cops. He moves so much\r\nthat Saunders has stopped trying to untie him.\r\n\r\n<b>       JONATHAN\r\n</b>       Thirteen bodies. I'll show you where they're buried.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, yeah !\r\n\r\n<b>       BROPHY\r\n</b>       Go down to the cellar with him, O'Hara.\r\n\r\n<b>       JONATHAN\r\n</b>       Yes, come to the cellar.\r\n\r\nHe grabs O'Hara's hand and drags him to the cellar door.\r\n\r\n<b>       O'HARA\r\n</b>       Well, look, do I have to ?\r\n\r\nMortimer, still gagged, and still carrying his armchair like a\r\nbackpack, tries to follow them, but Saunders moves him away.\r\nMortimer runs round the table to try again to join the party going\r\ndown to the cellar, with Saunders running behind him.\r\n\r\n<b>       O'HARA\r\n</b>       Sorry, maybe I don't want to go down to the cellar with\r\n       him.\r\n\r\nMortimer bumps violently into Brophy, who tries to push him away.\r\n\r\n<b>       BROPHY\r\n</b>       O'Hara, go on down the cellar with him !\r\n\r\nMortimer then goes to O'Hara, but O'Hara doesn't realize Mortimer\r\nis coming to him to prevent him going down to the cellar.\r\n\r\n<b>       O'HARA\r\n</b>       Now, please, Mister Brewster. I'll tell you the rest of my\r\n       play later.\r\n\r\nHe pushes Mortimer away from him.\r\n\r\n<b>       BROPHY\r\n</b>       Go on down to the cellar with him.\r\n\r\n<b>       O'HARA\r\n</b>       Gee, do I have to, Sarge ? Look at that puss. He looks like\r\n       Boris Karloff.\r\n\r\nHearing that, Jonathan screams, jumps on O'Hara and puts his hand\r\naround his throat.\r\n\r\n<b>       O'HARA\r\n</b>       (to Jonathan)\r\n       Don't !\r\n       (to Brophy)\r\n       Sarge !\r\n\r\nThe three cops and Jonathan starts fighting. A fist comes out of\r\nthe battle and hits Mortimer on the chin. He staggers back to the\r\ncenter of the room, and falls on the floor.\r\n\r\nWe see Einstein cautiously appearing on the landing of the upper\r\nfloor of the house. He slowly comes down the stairs.\r\n\r\nDown in the sitting-room, the fight goes on. Saunders falls on his\r\nback and Jonathan jumps on him. O'Hara, in his turn, jumps on\r\nJonathan. Behind them, Mortimer is slowly getting up and getting\r\nrid of his ropes. Apparently, his fall has completely untied him.\r\n\r\nEinstein, watching this heated fight, moves back to the upper\r\nfloor.\r\n\r\nMortimer gets rid of his gag, and slowly moves away from the\r\nbattle.\r\n\r\n<b>       BROPHY\r\n</b>       (voice over)\r\n       Look out, Pat !... Look out, Pat !\r\n\r\n<b>       SAUNDERS\r\n</b>       (voice over)\r\n       He's got a gun...\r\n\r\n<b>       BROPHY\r\n</b>       (voice over)\r\n       I got him, Pat. Look out !\r\n\r\n<b>       MORTIMER\r\n</b>       Fight. Go on and fight.\r\n\r\nMortimer climbs up a few steps on the staircase and sits down on a\r\nstep.\r\n\r\n<b>       MORTIMER\r\n</b>       That's enough, that's enough. Everybody off.\r\n\r\n<b>       BROPHY\r\n</b>       (voice over)\r\n       Pat ! Pat, look out!\r\n\r\nMortimer, still seated on the step, quietly gets his cigarette\r\ncase from his pocket, takes a cigarette, puts the case back in his\r\npocket, while we hears the noise of the battle still going on down\r\nbelow.\r\n\r\n<b>       MORTIMER\r\n</b>       Amazing... Such a fine day, too. All I did was cross the\r\n       bridge and I was in Brooklyn. Amazing. Amazing, amazing.\r\n\r\nHe takes a matchbox from another pocket and lights his cigarette.\r\nBehind Mortimer, on the wall, we see the shadows of the men\r\nfighting. Then we see various objects falling around Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Don't... Don't bother me now.\r\n\r\nO'Hara is projected on the wall below the staircase, near the\r\nplace where Mortimer is still quietly seated.\r\n<b>       MORTIMER\r\n</b>       Buddy, you could use this in the third act.\r\n\r\n<b>       O'HARA\r\n</b>       Oh yes, I got something better than this. Let me tell\r\n       you...\r\n\r\nJonathan breaks a chair on his back. O'Hara staggers slightly.\r\n\r\n<b>       O'HARA\r\n</b>       I'll see you later.\r\n\r\nHe goes back in the battle. Jonathan gives him a heavy punch and\r\nO'Hara falls in the window-seat, closing the lid over himself in\r\nhis fall.\r\n\r\nBack to Mortimer, still quietly smoking his cigarette, seated on\r\nthe same step. He takes papers out of his pocket.\r\n\r\n<b>       MORTIMER\r\n</b>       I got the papers signed. There, they're all signed. What do\r\n       I care ? Go ahead, go ahead, fight, fight, fight-fight-\r\n       fight !\r\n\r\nO'Hara cautiously lifts the lid of the window-seat, but seeing a\r\nchair flying in his direction, he slams it back shut. The chair\r\nhits the window-seat and breaks off in small pieces.\r\n\r\nBack to Mortimer on his steps. He puts the papers back in his\r\npocket.\r\n\r\n<b>       MORTIMER\r\n</b>       I'd better call up and see if Witherspoon has left.\r\n\r\nHe puts his hand through the banister of the staircase to take the\r\ntelephone on the desk, but he cannot reach it.\r\n\r\n<b>       MORTIMER\r\n</b>       Telephone. Hey !\r\n\r\nAt this moment, Jonathan comes smashing on the wall below the\r\nstaircase. He grabs the telephone and lifts it to throw it on the\r\ncops, bringing it within easy reach of Mortimer's hand.\r\n\r\n<b>       JONATHAN\r\n</b>       I'll get every one of you ! I hate cops. I'll brain the\r\n       first one that comes near me !\r\n\r\nMortimer picks up the telephone handset, and starts dialing.\r\n\r\n<b>       MORTIMER\r\n</b>       Yeah. A little higher, please, brother.\r\n\r\nJonathan is watching the cops around him, and he is not looking at\r\nall at his brother behind him. Without thinking about it, he lifts\r\nthe telephone a little higher.\r\n\r\n<b>       MORTIMER\r\n</b>       Thank you very much. Yeah, that's fine.\r\nJonathan suddenly realizes what Mortimer is doing and turns his\r\nhead toward him. Brophy immediately comes behind him and hits him\r\nwith his stick. Jonathan starts falling, and Mortimer has to pick\r\nup the telephone not to loose it.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh ! Don't do that, please.\r\n\r\n<b>       BROPHY\r\n</b>       Get him, Pat.\r\n\r\nSaunders comes on the other side of Jonathan and hits him with his\r\nstick.\r\n\r\n<b>       MORTIMER\r\n</b>       (in the phone)\r\n       Come on, doc...\r\n       (to the cops)\r\n       That won't have any effect. I've tried it before...\r\n\r\nJonathan falls heavily on the floor.\r\n<b>       MORTIMER\r\n</b>       Oh, it did. Dear me ! Isn't that amazing ?\r\n\r\nO'Hara slowly lifts the lid of the window-seat.\r\n\r\nSaunders bends on the motionless body of Jonathan\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, dear. Wish I could relax like that.\r\n\r\nThe doorbell rings, and we see the shadow of a hatted man through\r\nthe frosted glass. Mortimer looks at the door.\r\n\r\n<b>       MORTIMER\r\n</b>       Witherspoon !\r\n\r\n<b>       BROPHY\r\n</b>       Come in.\r\n\r\nThe visitor enters. It's Lieutenant Rooney, a plain-cloth\r\npoliceman. He closes the door behind him. Both Brophy and Saunders\r\nstand at attention. Mortimer puts the phone receiver back on its\r\nhook. O'Hara comes out of the window-seat, and, seeing his\r\nsuperior, stands at attention. Rooney walks to the body of\r\nJonathan.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What has occurred ?\r\n\r\n<b>       BROPHY &amp; SAUNDERS\r\n</b>       (speaking together)\r\n       Well, we...\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Never mind ! Didn't I tell you I'd handle this myself ?\r\n\r\nO'Hara comes out of the window-seat to join his colleagues.\r\n<b>       O'HARA\r\n</b>       Well, Lieutenant ! We were just acting in self-defense.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (pointing to the body of Jonathan)\r\n       What happened ? He put up a fight ?\r\n\r\n<b>       BROPHY\r\n</b>       This isn't the one who blows the bugle. This is his\r\n       brother. He tried to kill O'Hara.\r\n\r\n<b>       O'HARA\r\n</b>       All I said was he looked like Boris Karloff.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Boris ?... Turn him over.\r\n\r\nSaunders turns Jonathan over and both the lieutenant and Brophy\r\nbends on the face of Jonathan.\r\n\r\n<b>       BROPHY\r\n</b>       Kind of think he's wanted somewhere.\r\nRooney stands up and looks at Brophy with an ironical smile.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Oh ! You «kind of think he's wanted somewhere» ? If you\r\n       guys can't look at the circulars we put up in the station,\r\n       you can at least read short detective stories. Certainly,\r\n       he's wanted somewhere. In Indiana ! He escaped from the\r\n       prison for criminally insane. He's a lifer.\r\n\r\nStill seated on his step, Mortimer smiles.\r\n\r\n<b>       MORTIMER\r\n</b>       That's my brother !\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       For Pete's sake, that's the way they described him. «He\r\n       looked like Karloff». Why'd you have to knock him off ?\r\n\r\n<b>       BROPHY\r\n</b>       He tried to get us to go down to the cellar. He says there\r\n       are thirteen bodies buried down there.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Thirteen bodies buried in the cellar, and that don't tip\r\n       you off the guy's come from a nuthouse ?\r\n\r\n<b>       MORTIMER\r\n</b>       Thanks, pal.\r\n\r\n<b>       O'HARA\r\n</b>       Say, lieutenant, about my not ringing in, I want to\r\n       explain...\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Where have you been all night ? Don't bother to tell me.\r\n\r\n<b>       O'HARA\r\n</b>       Oh, I was right here writing a play with Mortimer Brewster.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Yeah ?\r\n\r\n<b>       O'HARA\r\n</b>       Yeah.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Well, you're going to have a long time on that play.\r\n\r\n<b>       O'HARA\r\n</b>       Yeah ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       You're suspended. Now go on. Report in.\r\n\r\nTeddy comes out of his room, with his bugle under his arm, and\r\nwalks downstairs\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (voice over)\r\n       Take this guy out in the kitchen and bring a pillow. I want\r\n       to find out where his accomplice is.\r\n\r\n<b>       TEDDY\r\n</b>       (to Mortimer)\r\n       What is the meaning of this commotion ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       The guy who helped him escape. He's wanted, too.\r\n\r\nTeddy gives his bugle to Mortimer.\r\n\r\n<b>       TEDDY\r\n</b>       Here.\r\n\r\nHe joins the group of policemen.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Forty-eight hours I've been after these guys. Nothing to\r\n       eat. No sleep. No wonder Brooklyn's in the shape it's in.\r\n       With flatheads like you on the force. Falling for a story\r\n       like that ! Thirteen bodies buried down in the cellar.\r\n\r\n<b>       TEDDY\r\n</b>       But there are thirteen bodies in the cellar !\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Who are you ?\r\n\r\n<b>       TEDDY\r\n</b>       I'm President Roosevelt.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (whispering to Brophy)\r\n       What the blazes is this ?\r\n\r\n<b>       BROPHY\r\n</b>       He's the guy that blows the bugle.\r\n<b>       SAUNDERS\r\n</b>       Howdy, Colonel.\r\n\r\nSaunders and Brophy both salutes Teddy. Teddy salutes them back.\r\nRooney raises his hand to salute, but rapidly puts it down with a\r\ndisgusted expression on his face.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Well, Colonel, you've blown your last bugle.\r\n       (pointing to Jonathan's body)\r\n       Come on, get this guy out of here.\r\n\r\n<b>       TEDDY\r\n</b>       Dear me ! Another yellow-fever victim ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What ?\r\n\r\n<b>       TEDDY\r\n</b>       All the bodies in the cellar are yellow-fever victims.\r\n<b>       BROPHY\r\n</b>       No-no-no, Colonel. This is a spy. We caught him at the\r\n       White House.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Take him out and bring him to. I want to question him.\r\n\r\nBrophy and Saunders lift Jonathan and carry him to the kitchen.\r\n\r\n<b>       TEDDY\r\n</b>       If there is any questioning of spies, that's my department.\r\n\r\nHe follows the two cops. But Rooney stops him.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Hey, you, keep out of that.\r\n\r\n<b>       TEDDY\r\n</b>       You're forgetting that as President, I am also head of the\r\n       Secret Service.\r\n\r\nHe follows the two cops in the kitchen. Rooney goes to the table,\r\ntakes the carafe and smells it. Mortimer watches him, still seated\r\non his step.\r\n\r\n<b>       MORTIMER\r\n</b>       Huh-huh-huh !\r\n\r\nRooney puts the carafe back on the table, and looks at Mortimer.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Who are you ? What's your name ?\r\n\r\n<b>       MORTIMER\r\n</b>       Usually, I'm Mortimer Brewster. But I'm not quite myself\r\n       today.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Oh, you're his brother. Now, look, Mister Brewster, no\r\n       argument. He's got to be put away.\r\n\r\nMortimer stands up and goes down the steps toward the lieutenant.\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, no arguments, Captain. No arguments. Just a minute,\r\n       take it easy. Read this.\r\n\r\nHe takes the papers from his pocket and show them to Rooney.\r\n\r\n<b>       MORTIMER\r\n</b>       Teddy's going to go to Happy Dale tonight. I'm just waiting\r\n       here for Mr. Witherspoon.\r\n\r\nRooney looks at the documents.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Well, as long as he's going someplace. He's scaring the\r\n       neighbors, what with that bugle and all. And that cockeyed\r\n       story about thirteen bodies being buried...\r\nRooney stops, looks around with a suspicious eye and takes his hat\r\noff.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       You know, I've been without sleep for forty-eight hours.\r\n       I'm liable to think anything.\r\n\r\n<b>       MORTIMER\r\n</b>       I know just how you feel.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       There's people dumb enough to believe a story like that.\r\n       Last year there was a crazy guy, started a murder rumor. I\r\n       had to dig up a half acre plot before I could prove...\r\n       Ohh ! What's this ?\r\n\r\nRooney puts the papers down.\r\n\r\n<b>       MORTIMER\r\n</b>       What's the matter ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       These papers are no good.\r\n\r\n<b>       MORTIMER\r\n</b>       Why not ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       He signed it Theodore Roosevelt !\r\n\r\nRooney shows the papers to Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       He what ?...\r\n\r\nMortimer looks at the papers with horror in his face and takes\r\nthem back.\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nThe cab driver is seated with O'Hara and Witherspoon standing on\r\neither side of him.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Is your cab engaged ?\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yeah ! I'm losing dough every minute. Got me offers ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       I'm Mister Witherspoon of Happy Dale Sanitarium, I have\r\n       come here to collect a Brewster. I would like you to drive\r\n       us back to the sanitarium.\r\n\r\nHe walks to the entrance of the house. O'Hara stays with the cab\r\ndriver.\r\n\r\n<b>       CAB DRIVER\r\n</b>       I knew this would end up in a nuthouse !\r\nWitherspoon comes back a few steps.\r\n\r\n<b>       WITHERSPOON\r\n</b>       We like to think of it as a rest home.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR DAY\r\n</b>\r\nWitherspoon enters the room. We hear voices talking excitedly. And\r\nwe see people in some sort of a large alcove at the back of the\r\nsitting-room, between the cellar-door and the grandfather clock.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Mister Brewster ? Mister Brewster ?\r\n\r\nThrough the hole in the kitchen door, we see Brophy talking.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Mr. Witherspoon is here.\r\n\r\nWitherspoon slams the door.\r\n\r\nIn the alcove, Mortimer, Rooney and Teddy are having an argument.\r\nMortimer still has the bugle in his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Supposing the spy steals this document and finds the name\r\n       Theodore Roosevelt on it. Think what that would mean to the\r\n       safety of the nation !\r\n\r\nRooney holds the document for Teddy, who has a pen in his hand.\r\n\r\n<b>       TEDDY\r\n</b>       No, it's chicanery.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, wasting the time.\r\n\r\nSaunders approaches his lieutenant.\r\n<b>       SAUNDERS\r\n</b>       He's come to. He's ready to talk.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Hold him till I get there.\r\n\r\n<b>       SAUNDERS\r\n</b>       Yes, sir.\r\n\r\nHe moves away back to the kitchen.\r\n\r\n<b>       MORTIMER\r\n</b>       Let me explain. The name Brewster is code for Roosevelt.\r\n\r\n<b>       TEDDY\r\n</b>       Code for Roosevelt ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, don't you see ? Take the name Brewster. Take away the\r\n       «B» and what have you got ?\r\n<b>       TEDDY\r\n</b>       Rooster.\r\n\r\n<b>       MORTIMER\r\n</b>       And what does a rooster do ?\r\n\r\n<b>       TEDDY\r\n</b>       Crows.\r\n\r\n<b>       MORTIMER\r\n</b>       It crows! And where are you hunting in Africa ?\r\n\r\n<b>       TEDDY\r\n</b>       On the veldt !\r\n\r\n<b>       MORTIMER\r\n</b>       There you are ! «Crowsveldt».\r\n\r\nMortimer gives a quick look at Rooney.\r\n\r\n<b>       TEDDY\r\n</b>       Ingenious ! My compliments to the boys in the code\r\n       department.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Hey, that's all right ! Do that again for me.\r\n\r\n<b>       TEDDY\r\n</b>       Never mind ! Give me that pen. This is fun.\r\n\r\nHe signs the paper under Rooney's supervision.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, now, all I got to get is Witherspoon.\r\n\r\nHe runs to the table in the middle of the sitting-room, where\r\nWitherspoon is standing. He goes around the table to shake hands\r\nwith him.\r\n<b>       MORTIMER\r\n</b>       Oh ! Oh ! Mister Witherspoon, I can't tell you how glad I\r\n       am to see you. Mister Witherspoon... Before... Look... You\r\n       will take good care of Teddy at Happy Dale ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Best of care of him, Mister Brewster.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, that's fine. And no wagon when he leaves.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Why ? To take him away ? Oh, never, never. Taxicabs. We\r\n       always... I have one waiting now.\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, look, it means a great deal to me. You will personally\r\n       see that Teddy's happy at Happy Dale ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       He'll be very happy at Happy Dale.\r\n<b>       MORTIMER\r\n</b>       Oh, that's good.\r\n\r\n<b>       WITHERSPOON\r\n</b>       You know, I sometimes envy some of our patients, secretly,\r\n       you know.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you do ? It must be a nice place. Because I've never\r\n       been to Happy Dale.\r\n\r\n<b>       WITHERSPOON\r\n</b>       You never can tell.\r\n\r\nMortimer looks surprised by Witherspoon's answer. Then he looks\r\nalso a bit horrified.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, this is a particularly happy moment for me tonight,\r\n       Mister... Mister Brewster. Yes, I've never met a dramatic\r\n       critic and I had been so anxious to.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, the woods are full of them.\r\n\r\n<b>       WITHERSPOON\r\n</b>       I have here something that will explain what we're trying\r\n       to do out there at Happy Dale.\r\n\r\nHe gets a booklet out of his pocket.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh ! A pamphlet about Happy Dale ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, no-no, it's a play. Something I've been working on for\r\n       some time now.\r\nWhen Mortimer sees Witherspoon flipping the pages of his booklet,\r\na slightly frightened look comes to his face.\r\n\r\n<b>       WITHERSPOON\r\n</b>       It's a dramatization of many of the little incidents\r\n       that have happened here at Happy Dale.\r\n\r\n<b>       MORTIMER\r\n</b>       Captain ! Captain !... Captain !\r\n\r\nRooney, who was checking the documents signed by Teddy, turns\r\naround.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Now, I want you to read this very carefully. I want you to\r\n       be just as harsh as you like. I shan't mind, you know...\r\n\r\nRooney comes toward them with the documents in his hand.\r\n\r\n<b>       MORTIMER\r\n</b>       Captain, this is Mister Witherspoon.\r\nWitherspoon looks at Rooney with a smile.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, yes, yes, he'll be very happy at Happy Dale. Come, my\r\n       boy.\r\n\r\nWitherspoon takes Rooney's arm. Rooney pushes him away.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What is this?\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, no-no, Mister Witherspoon, you got it wrong. This\r\n       is... this is Captain Rooney.\r\n\r\n<b>       WITHERSPOON\r\n</b>       The police ?... Oh !\r\n\r\nThe two men shake hands, and Rooney gives the papers to\r\nWitherspoon.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       I'm sure! Here are the papers, all signed. Now you can take\r\n       him away, Super.\r\n\r\nTeddy joins them.\r\n\r\n<b>       TEDDY\r\n</b>       I'll be in my office vetoing some bills.\r\n\r\n<b>       MORTIMER\r\n</b>       Mister President, I have good news for you. Your term of\r\n       office is over.\r\n\r\n<b>       TEDDY\r\n</b>       Is this March the four ?\r\n<b>       MORTIMER\r\n</b>       Practically.\r\n\r\n<b>       TEDDY\r\n</b>       Let's see... Oh ! Now I go on my hunting trip to Africa !\r\n       Well, I must get started immediately.\r\n\r\nTeddy starts walking away, but he stops suddenly and gives\r\nWitherspoon a suspicious look.\r\n\r\n<b>       TEDDY\r\n</b>       Is he trying to move into the White House before I've moved\r\n       out ?\r\n\r\n<b>       MORTIMER\r\n</b>       Who, Mister President ?\r\n\r\nTeddy looks at Witherspoon with a disgusted face.\r\n\r\n<b>       TEDDY\r\n</b>       Taft !\r\n<b>       MORTIMER\r\n</b>       No, no, Teddy this isn't Mister Taft. It's Mister\r\n       Witherspoon, he's going to be your guide to Africa.\r\n\r\nTeddy shakes hands with Witherspoon.\r\n\r\n<b>       TEDDY\r\n</b>       Bully ! Bully ! Wait right here. I'll bring down my\r\n       equipment.\r\n\r\nWitherspoon looks at Teddy walking away with a sweet smile.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Happy man.\r\n\r\nTeddy starts going upstairs and he meets Abby and Martha coming\r\ndown. They're dressed back in their usual clothes. Teddy shakes\r\nhands with them.\r\n\r\n<b>       TEDDY\r\n</b>       Goodbye, Aunt Abby, goodbye Aunt Martha. I'm on my way to\r\n       Africa. Isn't it wonderful ?\r\n\r\nFor the last time, Teddy takes out his imaginary sword, points it\r\nforward and rushes upstairs.\r\n\r\n<b>       TEDDY\r\n</b>       Charge !\r\n\r\nHe gets into his room and slams the door behind him. Witherspoon\r\nlooks a bit surprised, and Mortimer holds the hands of the\r\ngrandfather clock. Abby joins him\r\n\r\n<b>       MORTIMER\r\n</b>       It's all right, Aunt Abby, I've got it.\r\n\r\nWitherspoon looks at the scene with slightly anxious eyes.\r\n<b>       WITHERSPOON\r\n</b>       Oh, dear. And Happy Dale is full of staircases.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nElaine walks across the churchyard toward the Brewster's house.\r\nShe is wearing a coat over her nightdress.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nAbby and Martha are talking with Witherspoon.\r\n\r\n<b>       MARTHA\r\n</b>       You've come to meet Teddy, haven't you ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (voice over)\r\n       No, he's come to take him. Teddy's been blowing his bugle\r\n       again.\r\n\r\nBoth sisters turn toward Rooney.\r\n<b>       ABBY\r\n</b>       Oh, no-no, no, he can't go now ! We won't permit it.\r\n\r\n<b>       MARTHA\r\n</b>       We promise to take his bugle away from him. We won't be\r\n       separated from Teddy.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       I'm sorry.\r\n\r\n<b>       ABBY\r\n</b>       Mortimer, how can you allow this ? You promised.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Mister Brewster's got nothing to do with this, see. The law\r\n       is the law ! Teddy's committed himself and he's got to go.\r\n\r\n<b>       ABBY\r\n</b>       Well, if he's going, we're going, too !\r\n\r\n<b>       MARTHA\r\n</b>       Yes, you'll have to take us with him.\r\n\r\nMortimer smiles broadly.\r\n\r\n<b>       MORTIMER\r\n</b>       Why-why... why not ? Why not, indeed ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh well now, indeed, it's sweet of them to want to go, but\r\n       it's quite impossible. We never take sane people at Happy\r\n       Dale.\r\n\r\nMortimer comes very close to Witherspoon, and tries, by mime only,\r\nto induce Witherspoon to take his aunts.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, no-no-no-no...\r\n<b>       MORTIMER\r\n</b>       (whispering)\r\n       Now, these two little sane people, mixed up with all the\r\n       others, will get lost in the shuffle. You could arrange\r\n       that.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, no-no-no-no...\r\n\r\n<b>       MORTIMER\r\n</b>       Just put them in and they'll get all mixed up.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh, no ! No, no ! No ! Too dangerous. Dissension, jealousy.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nElaine has now reached the Brewster house and opens a window. We\r\nhear Lieutenant Rooney's voice.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (voice over)\r\n       Now, let's be sensible, ladies...\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nRooney is talking to the Brewster sisters.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       ...Here I am wasting my time when I could be doing some\r\n       serious work. You know, ladies, there are still murders\r\n       to be solved in Brooklyn. It ain't only his bugle blowing,\r\n       and neighbors being afraid of him. But things are going to\r\n       get worse. We're liable to have to dig up your cellar.\r\n\r\n<b>       ABBY\r\n</b>       Our cellar ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Yeah.\r\n\r\nMortimer seems a bit worried.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh-oh !\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Yeah, Teddy's been telling around there's thirteen bodies\r\n       buried in the cellar.\r\n\r\n<b>       ABBY\r\n</b>       But there are thirteen bodies in our cellar.\r\n\r\nWitherspoon, who was looking at something on the table, looks up,\r\nvery surprised by what Abby just said.\r\n\r\nBehind the window and the drapes, where she is hiding and\r\neavesdropping, Elaine looks very surprised too.\r\nRooney smiles a little, and then becomes suddenly very serious.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What ?\r\n\r\n<b>       ABBY\r\n</b>       Yes. You just ask our nephew, Mortimer.\r\n\r\nMortimer blows the bugle very loudly. Rooney puts his hands on his\r\nears. Then Mortimer rushes upstairs, yelling :\r\n\r\n<b>       MORTIMER\r\n</b>       Charge !\r\n\r\nMortimer reaches the balcony. Teddy comes out of his room, looking\r\nintrigued\r\n\r\n<b>       MORTIMER\r\n</b>       (whispering)\r\n       Isn't that amazing ?\r\n\r\n<b>       ABBY\r\n</b>       Now, Mortimer, you behave yourself. You know very well\r\n       there are thirteen bodies down in our cellar.\r\n\r\n<b>       MORTIMER\r\n</b>       Certainly there's thirteen bodies down in the cellar. And\r\n       there are hundreds more up in the attic, Captain !\r\n\r\nTeddy taps the side of his head with his finger, goes back into\r\nhis room, and closes the door. Mortimer tries to indicate by mime\r\nthat his aunts are crazy\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What is this ?\r\n\r\nVery quick shot of Elaine peeking behind the drapes\r\n\r\n<b>       MARTHA\r\n</b>       You mustn't mind Mortimer.\r\n\r\nSaunders comes to his lieutenant.\r\n\r\n<b>       SAUNDERS\r\n</b>       How about it, lieutenant ?\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       I'll be right there.\r\n\r\nHe moves away.\r\n\r\n<b>       MARTHA\r\n</b>       He's been a little strange all day.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Well, right now I wouldn't know what is and what ain't\r\n       strange anymore. I'll better have a look in that cellar.\r\n\r\n<b>       MORTIMER\r\n</b>       I'll tell you what we'll do, Captain. I'll bring my bodies\r\n       down from the attic and you get yours down from the cellar,\r\n       and we'll get them all together, and we'll send them to\r\n       Happy Dale.\r\n\r\nHe sings the last words, trying again to mime to Rooney that his\r\ntwo aunts are crazy.\r\n\r\n<b>       ABBY\r\n</b>       No, no, you wouldn't have to dig. The graves are all\r\n       marked. We put flowers on them every Sunday.\r\n\r\nMortimer walks downstairs.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Flowers ?\r\n\r\n<b>       MORTIMER\r\n</b>       Sure, I put neon lights on mine.\r\n\r\nHe whispers to Rooney from the staircase.\r\n\r\n<b>       MORTIMER\r\n</b>       Humor them, humor them. Smile.\r\n\r\nRooney doesn't seem to understand what Mortimer is trying to tell\r\nhim. But Witherspoon is beginning to understand.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What ?\r\n\r\n<b>       ABBY\r\n</b>       There's one down there, a Mister Spenalzo...\r\n\r\n<b>       MORTIMER\r\n</b>       (whispering)\r\n       Hasn't got it yet.\r\n\r\nHe resumes his walking downstairs.\r\n\r\n<b>       ABBY\r\n</b>       ...who doesn't belong here and who's going to have to\r\n       leave.\r\n\r\n<b>       MARTHA\r\n</b>       But the other twelve are our gentlemen.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Your gentlemen ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, you'd like mine better. None of mine are gentlemen.\r\n\r\n<b>       ABBY\r\n</b>       You mustn't mind him at all. He got married today.\r\n\r\n<b>       MORTIMER\r\n</b>       (singing)\r\n       «There is a Happy Dale far, far away. There is a Happy\"\r\n\r\nWhile singing, Mortimer makes signs to Rooney and Witherspoon.\r\nAnd, finally, Rooney understand what Mortimer is trying to tell\r\nhim, that his aunts are crazy.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (nodding)\r\n       Yeah, yeah.\r\n\r\n<b>       MORTIMER\r\n</b>       He got it. It's amazing.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (to Witherspoon)\r\n       Look, Super, don't you think you can find room for the\r\n       ladies ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Just the ladies ?\r\n\r\nHe looks at Mortimer. Mortimer stops clowning, and becomes very\r\nserious.\r\n\r\n<b>       MORTIMER\r\n</b>       Just the ladies, not me !\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       How about it, Super ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Well, of course, they'd have to be committed.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Well, Teddy committed himself. Couldn't they commit\r\n       themselves also ? All they have to do is sign the papers.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Certainly.\r\n\r\n<b>       MARTHA\r\n</b>       Oh well, if we can go with Teddy, we'll sign the papers.\r\n       Where are they ?\r\n\r\nWitherspoon takes the papers out of the inside pocket of his coat.\r\n\r\n<b>       WITHERSPOON\r\n</b>       I have them, ladies, I have them right here.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (to Witherspoon)\r\n       Sign them up, will you, Super ? I want this all cleaned up.\r\n       I'm going out to talk to that spy. Maybe I can understand\r\n       him. Thirteen bodies down in the cellar.\r\n\r\nRooney, absent-mindedly, is ready to go down to the cellar, but he\r\nchecks himself and goes toward the kitchen instead.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Ladies, if you will sign right here.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>Elaine opens a large trapdoor opening on a stairway going down to\r\nthe cellar. She starts going down that passage.\r\n\r\n<b>BREWSTER RESIDENCE - SITTING ROOM - INTERIOR NIGHT\r\n</b>\r\nEinstein walks on the balcony, carrying a suitcase, and starts\r\ngoing downstairs. In the room, we can guess that the two sisters\r\nare signing the papers.\r\n\r\n<b>       ABBY\r\n</b>       (voice over)\r\n       Right here ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       (voice over)\r\n       Yes, please. It's on the right-hand side right there.\r\n\r\nMartha and Abby are seated at the table, signing the papers.\r\nWitherspoon and Mortimer, standing besides them, are helping them.\r\n\r\n<b>       ABBY\r\n</b>       I'm really looking forward to going. The neighborhood here\r\n       has changed so.\r\n\r\n<b>       MARTHA\r\n</b>       Yes. Especially since they won that old pennant thing.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh... oh, dear, I'm so sorry. We've overlooked something.\r\n       It's absolutely compulsory that we have the signature of a\r\n       physician.\r\n\r\nEinstein has reached the bottom of the stairs and he is sneaking\r\nout through the front door.\r\n\r\n<b>       MORTIMER\r\n</b>       A doctor... Oh ! Doctor Einstein ! Come here and sign some\r\n       papers, please.\r\n\r\nEinstein turns around.\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Good night.\r\n\r\n<b>       MORTIMER\r\n</b>       Come here, Doctor Einstein.\r\n\r\n<b>       WITHERSPOON\r\n</b>       A doctor ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, yes, yes. Doctor Einstein almost operated on me earlier\r\n       this evening. Come on, Doctor.\r\n\r\nEinstein drops his suitcase by the front door, and comes to the\r\ntable.\r\n\r\n<b>       MORTIMER\r\n</b>       Here. Just sign right here, please, Doctor.\r\nEinstein signs the paper Mortimer gives him. Meanwhile, Rooney and\r\nSaunders are coming out of the kitchen and crossing the room.\r\n\r\n<b>       ABBY\r\n</b>       Were you leaving, Doctor ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       Yes, please.\r\n\r\n<b>       MARTHA\r\n</b>       Oh ! Aren't you going to wait for Jonathan ?\r\n\r\n<b>       DOCTOR EINSTEIN\r\n</b>       I don't think we go to the same place.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (speaking on the telephone)\r\n       Hello, Mac. We picked up that guy that's wanted in Indiana.\r\n       His accomplice's description is one on the circular, on the\r\n       desk. Read it to me, will you ?\r\n\r\nEinstein leaves the table, and almost bumps into Saunders, who is\r\nbrushing his uniform. He listen to the description of himself that\r\nRooney is repeating from his colleague at the police station.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       (still on the phone)\r\n       Yeah... About forty... Five-foot-three... One hundred and\r\n       forty pounds... Pop eyes... Talks with a German accent...\r\n       Poses as a doctor... Okay, Mac. Thanks.\r\n\r\nHe puts the phone back on its hook.\r\n\r\nWitherspoon slaps Einstein on the back, and Einstein starts\r\nraising his arms.\r\n\r\n<b>       WITHERSPOON\r\n</b>       It's all right, Lieutenant Rooney. The doctor here has\r\n       completed the signatures.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Oh, that's great ! Thanks, Doc. You've done Brooklyn a\r\n       great service.\r\n\r\nHe shakes Einstein's hand and slaps his back. Einstein cannot\r\nbelieve his luck. He smiles and rushes to the door.\r\n\r\n<b>       ABBY\r\n</b>       But Dr. Einstein !\r\n\r\nEinstein picks up his suitcase, and rushes out of the door, and\r\ncloses it behind him.\r\n\r\n<b>       WITHERSPOON\r\n</b>       (to Mortimer)\r\n       Now, Mister Witherspoon...\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, you're Mister Witherspoon, I'm Mister Brewster.\r\n<b>       WITHERSPOON\r\n</b>       (laughing)\r\n       It's contagious, yes. It's your turn.\r\n\r\n<b>       MORTIMER\r\n</b>       Now, don't play games...\r\n\r\n<b>       WITHERSPOON\r\n</b>       You sign. You sign as next of kin.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, next of kin. Why didn't you say so ? I'm all confused.\r\n       Don't mind me.\r\n\r\nTeddy appears on the balcony, all dressed up in his colonial\r\ncostume, but without the helmet.\r\n\r\n<b>       TEDDY\r\n</b>       Mr. Witherport.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Spoon.\r\nMortimer picks up a spoon on the table and gives it to\r\nWitherspoon.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, here it is.\r\n\r\n<b>       TEDDY\r\n</b>       Come up and pack my duffel.\r\n\r\n<b>       WITHERSPOON\r\n</b>       Duffel ?\r\n\r\n<b>       MORTIMER\r\n</b>       Yes, duffel. Pack his duffel. He's President, you know ?\r\n\r\n<b>       WITHERSPOON\r\n</b>       Oh !\r\n\r\n<b>       TEDDY\r\n</b>       And bring along my bugle.\r\n\r\nWitherspoon looks on the table, where the bugle is, and then at\r\nMortimer. Mortimer makes a little agreement sign.\r\n\r\n<b>       MORTIMER\r\n</b>       President.\r\n\r\nWitherspoon picks up the bugle, and starts walking upstairs. He\r\nstops after a few steps, as if he were hesitating.\r\n\r\n<b>       MORTIMER\r\n</b>       Don't charge !\r\n\r\nMortimer and Witherspoon are exchanging faces. Martha and Abby are\r\nwhispering into each other's ear.\r\n\r\n<b>       ABBY\r\n</b>       Mortimer. Mortimer, we're really very worried about\r\n       something.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, now, darling, don't be worried.\r\n\r\nHe kisses Abby.\r\n\r\n<b>       MARTHA\r\n</b>       Me too, Mortimer.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, of course, darling.\r\n\r\nHe kisses Martha.\r\n\r\n<b>       MORTIMER\r\n</b>       You'll both are going to be very happy at Happy Dale, will\r\n       you.\r\n\r\n<b>       MARTHA\r\n</b>       Oh yes, dear, we're very happy about the whole thing,\r\n       but that's just it. We don't want anything to go wrong.\r\n\r\n<b>       MORTIMER\r\n</b>       Well, what would go wrong ?\r\n\r\n<b>       ABBY\r\n</b>       Mortimer, will they investigate those signatures ?\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, no, they won't look up Dr. Einstein...\r\n\r\n<b>       MARTHA\r\n</b>       But it's not his signature, dear. It's yours.\r\n\r\n<b>       MORTIMER\r\n</b>       Mine ?\r\n\r\n<b>       ABBY\r\n</b>       You see, you signed as next of kin.\r\n\r\n<b>       MORTIMER\r\n</b>       Oh, what's wrong about that, darling ?\r\n\r\n<b>       ABBY\r\n</b>       Well... Martha, you tell him now.\r\n\r\n<b>       MARTHA\r\n</b>       Well, dear.\r\n\r\n<b>       MORTIMER\r\n</b>       What, dear ?\r\n\r\n<b>       MARTHA\r\n</b>       You're not really a Brewster.\r\n\r\nMortimer, who had a happy smile on his face until now, suddenly\r\nlooks very surprised.\r\n<b>       MORTIMER\r\n</b>       Huh ? What ? What ?\r\n\r\n<b>       ABBY\r\n</b>       Your mother came to us as a cook. And you were born about\r\n       three months afterwards. And she was such a sweet woman and\r\n       such a good cook, we didn't want to lose her. So brother\r\n       married her. Your real father was a cook, too. He was a\r\n       chef on a tramp steamer.\r\n\r\n<b>       MORTIMER\r\n</b>       You mean... you mean I'm not really a Brewster ?... Oh !\r\n\r\nHe almost falls backward. Both sisters catch him up.\r\n\r\n<b>       MARTHA\r\n</b>       Oh, darling ! Don't feel so badly about it.\r\n\r\n<b>       ABBY\r\n</b>       I'm sure it won't make any difference to Elaine.\r\n\r\nHe yells several whooping cries and then kisses them both very\r\naffectionately. Then he rushes to the window, jumps into the open\r\nwindow-seat, opens the drapes and yells outside.\r\n\r\n<b>       MORTIMER\r\n</b>       Elaine ! Elaine ! Where are you ? Can you hear me ? I'm not\r\n       really a Brewster ! I'm the son of a sea cook !\r\n\r\nWe hear Elaine screaming. Elaine comes running upstairs from the\r\ncellar.\r\n\r\n<b>       ELAINE\r\n</b>       Mortimer ! Mortimer ! Mortimer ! It's true ! It's true ! I\r\n       saw them. Mortimer, it's true.\r\n\r\nRooney and Saunders come out of the kitchen.\r\n\r\n<b>       ELAINE\r\n</b>       It's true ! There are thirteen bodies down there !\r\n\r\nMortimer tries to make her shut up, and succeeds only by kissing\r\nher very passionately on the mouth.\r\n\r\n<b>       ELAINE\r\n</b>       (mumbles through Mortimer's mouth)\r\n       But I saw them\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What's all this screaming about ?\r\n\r\nElaine tries to put a few words but Mortimer keeps on kissing her.\r\n\r\n<b>       ELAINE\r\n</b>       (mumbles through Mortimer's mouth)\r\n       But I saw them...\r\n\r\n<b>       MORTIMER\r\n</b>       It's way past her bedtime.\r\nWith his mouth still pressed on her, he lifts her and carries her\r\nacross the room to the front door.\r\n\r\n<b>       MORTIMER\r\n</b>       Quiet !\r\n\r\n<b>       ELAINE\r\n</b>       But, Mortimer...\r\n\r\n<b>       MORTIMER\r\n</b>       Goodbye !\r\n\r\nHe opens the door and rushes outside. The two sisters come to the\r\ndoor, waving goodbyes to him.\r\n\r\n<b>       ABBY\r\n</b>       Bye.\r\n\r\n<b>       MARTHA\r\n</b>       Goodbye, darling !\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       What is all this ?\r\n\r\n<b>       ABBY\r\n</b>       They're going on their honeymoon.\r\n\r\n<b>       LIEUTENANT ROONEY\r\n</b>       Well, they're off to a flying start.\r\n\r\nThe two sisters burst laughing and turn to the door.\r\n\r\n<b>BREWSTER RESIDENCE - EXTERIOR NIGHT\r\n</b>\r\nMortimer comes out of the house, still carrying Elaine with his\r\nmouth pressed on her. O'Hara and the cab driver, who were chatting\r\ntogether, jump up and look at the strange couple. Mortimer, still\r\ncarrying Elaine, moves along the house, with the cab driver\r\nfollowing him.\r\n\r\n<b>       O'HARA\r\n</b>       (finishing the story he was telling the cab driver)\r\n       I pull my gun at...\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey !\r\n\r\n<b>       MORTIMER\r\n</b>       What ?\r\n\r\n<b>       ELAINE\r\n</b>       I really did see...\r\n\r\n<b>       CAB DRIVER\r\n</b>       Hey ! You'll own two cabs !\r\n\r\n<b>       MORTIMER\r\n</b>       Huh ?\r\n\r\n<b>       CAB DRIVER\r\n</b>       I mean the meter !\r\n\r\nElaine, eventually, comes out of her hysteria. She puts her arms\r\naround Mortimer, and talks to him in a very sweet voice.\r\n\r\n<b>       ELAINE\r\n</b>       Oh, Mortimer.\r\n\r\nThey kiss very tenderly. The cab driver comes closer to the couple\r\nand looks at their closed-eyes faces.\r\n\r\n<b>       CAB DRIVER\r\n</b>       (imitating Elaine's voice)\r\n       Oh, Mortimer.\r\n\r\nMortimer turns to him.\r\n\r\n<b>       MORTIMER\r\n</b>       (to the cab driver)\r\n       Oh, we're going to Niagara Falls. Call me a cab, dear.\r\n\r\n<b>       CAB DRIVER\r\n</b>       Yes, love.\r\n\r\nThe cab driver realizes his mistake and checks himself.\r\n\r\n<b>       CAB DRIVER\r\n</b>       But, Mister Brewster !\r\n\r\n<b>       MORTIMER\r\n</b>       No, no, I'm not a Brewster. I'm a son of a sea cook.\r\n\r\nHe laughs and lifts a very surprised Elaine on his shoulder, and\r\nruns through the churchyard towards Reverend Harper's house.\r\n\r\n<b>       MORTIMER\r\n</b>       Charge !\r\n\r\nThe cab driver puts his hands to his face, then takes them away\r\nand yells :\r\n\r\n<b>       CAB DRIVER\r\n</b>       I'm not a cabdriver. I'm a coffeepot !\r\n\r\nWith one hand on his cap, and the other hand extended on his side,\r\nhe mimes a coffeepot.\r\n\r\nIn the background, we see Mortimer entering the house, with Elaine\r\nstill on his shoulder. The cab driver drops his arms and walks\r\nback to his taxi.\r\n\r\n<b>FADE OUT TO BLACK SCREEN\r\n</b>\r\n<b>                                 THE END\r\n</b>\r\n\r\n<b>END CREDITS\r\n</b>\r\nBoth the words «The End» and the credits are written in white\r\nletters on a cartoon representing a village with a sorceress\r\nflying on a broomstick above the village.\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Arsenic-and-Old-Lace.jpg\"/>\n</td><td><h1>Arsenic and Old Lace</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Julius J. Epstein\" title=\"Scripts by Julius J. Epstein\">Julius J. Epstein</a>  <a href=\"/writer.php?w=Philip G. Epstein\" title=\"Scripts by Philip G. Epstein\">Philip G. Epstein</a>  <a href=\"/writer.php?w=Joseph Kesselring\" title=\"Scripts by Joseph Kesselring\">Joseph Kesselring</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Arsenic and Old Lace Script.html#comments\" title=\"Arsenic and Old Lace comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:59:04.964523"}