{"title": "At First Sight", "film_link": "/Movie Scripts/At First Sight Script.html", "script_link": "/scripts/At-First-Sight.html", "info_raw": "\n\nAt First Sight Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Oliver Sacks  Steve Levitt  Irwin Winkler  Rob Cowan\nGenres  Drama\n\nRead \"At First Sight\" Script\n\n\n", "script": "\n\n        AT FIRST SIGHT\n\n\n\n\n\nBODY { background-color: \"#FFFFFF\"; font-family: Courier New, Helvetica, sans-serif; font-size:10.0pt }\n\nDIV { position:absolute; left:5px; top:20px; width:734px; height:500px;  }\n\n#loc { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.2in; margin-bottom:0in;\nmargin-left:0.8in;text-transform:uppercase } \n\n#slug {\n\tfont-family:Courier New;\n\tfont-weight: normal;\n\tmargin-top:0in;\n\tmargin-right:1.2in;\n\tmargin-bottom:0in;\n\tmargin-left:0.8in;\n\ttext-transform:uppercase;\n<b>\t\n</b><b>} \n</b>\n#act { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.8in; margin-bottom:0in;\nmargin-left:0.8in } \n\n\n#speaker { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.in; margin-bottom:0in;\nmargin-left:2.8in;text-transform:uppercase }\n\n#spkdir { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.7in; margin-bottom:0in;\nmargin-left:2.2in }\n\n#dia { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.6in; margin-bottom:0in;\nmargin-left:1.6in }\n\n#pg { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.75in; margin-bottom:0in;\nmargin-left:6.5in }\n\n#right { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:0.75in; margin-bottom:0in;\nmargin-left:5.0in }\n\n\n\n\n\n\n\n\n\n\nAT FIRST SIGHT\n\nEXT. VALLEY - DUSK\n \nGold light dappling across a valley that seems to reach on forever. \nWe ease back, revealing more - taking in the visual feast - finally \ndiscovering a seated figure facing out over the valley - a DOG at \nhis feet. \n\nVIRGIL ANDERSON, life ahead of him - someone seemingly at ease with \nhimself. As we watch. him a moment - SOUNDS become prominent - \nwhistle of the wind through the grass - a bird's wings as it takes \nflight - a tree branch creaking under its own weight. And as he sits \nthere, listening, we see the last rays of sunlight slip from the \nday. \n\nBLACK - and our TITLES come up. \n\nThen out of the darkness come a pair of HEADLIGHTS. - and we're: \n\nEXT. NEW YORK TURNPIKE - INTO PINECREST - DUSK \n\nAn old BMW 2002 making its way up the Taconic Parkway. \n\nINT. BMW - DUSK \n\nOn the radio: Whitney Houston's \"I'll Always Love You\". AMY TREMONT, \n30's, driving, on the phone. \n\nAMY\nI'm lost Betsy, and you know me - \nI don't wear lost well - wait, wait I'm losing you...\n(the cell phone glitches)\nI'm pulling over before you disappear forever.\n\n\nAmy pulls off the side of the road. Wrestles with a map and the \nphone. \n\nAMY\nSign? I was looking for a sign? There's no...\n\n\nHer attention is caught by something off camera. She stares out into \nthe night.. \n\nHER POV - A small iced over pond - and in the middle - moving about \nis Virgil, ICE SKATING - hockey stick in hand - moving about the \nrink with an imaginary puck. \n\nAMY (O.S.)\n(distracted)\nYes... I took the first ..... no, no, I'm listening...\n\n\nVirgil winds up and takes a slap at the ice with his stick - throws \nhis hands up in the air like he just scored. \n\nAmy smiles, peers off down the road. A sign: BEAR MTN. SPA AND \nRESORT 1.4 miles. \n\nAMY\nWait, I got it - yeah. No don't call me.. right, \nunless you hear from Atlanta. And fax me the \ndesigns - I want to tinker with them a bit more\n... I'm going to rest - bye - I'll see you in a week.\n\n\nBeep she hangs up. Looks back out to the pond. It's empty. Shrugs - \nabout to pull out - that love song still blaring. \n\nAMY\nOh p-lease, Whitney.\n\n\nCLICK - she shuts off the radio - and pulls back out onto the road. \n\nEXT. BEAR MTN. HEALTH SPA - NIGHT \n\nAmy pulling luggage out of her car. She takes a breath - clearly \nshe's exhausted - and starts towards the entrance. \n\nINT. BEAR MTN. HEALTH SPA - RECEPTION DESK - NIGHT \n\nAmy at the front desk with the Night Manager CAROLINE, 30'S, \nannoyingly fit. \n\nCAROLINE\n\u0085 we have a full weight room, lifecycles, \nstairmasters, a spa, yoga, aerobics, spin classes...\n\n\nAMY\nI'm really just looking for a quick fix, here. \nDo you have anything that just involves lying down?\n\n\nCAROLINE\nA massage.\n\n\nAMY\nGreat. I'll have one a day. Not too early.\n\n\nINT. BEAR MTN. - MASSAGE WAITING AREA - NEXT DAY \n\nAmy enters, wearing sweats, she checks her watch - looks toward a \nclosed door - about to grab a magazine when she hears from behind \nthe door: \n\nWOMAN'S VOICE\nVirgil, Oh God..., right there. Yes.\n\n\nAmy's interest piques - the woman's murmur continuing - deep \necstasy. \n\nWOMAN'S VOICE\nYes there - a bit more...\n(a small bell DINGS)\n--wait - wait, you can't stop - one more minute - noo! \n\nVIRGIL'S VOICE\nSorry, Susan - time's up. \nI've got someone waiting.\n\n\nAnd the door opens - and we see a woman, 60's, \nSUSAN, Bette Midler type, backing out of the room. \n\nSUSAN\nVirgil, you have to come live with me.\n\n\nVIRGIL'S VOICE\nAnd what would your husband say? \nAmy, you out there? - c'mon in.\n\n\nSUSAN\nThat's it - I'm getting a divorce.\n\n\nAmy smiles as she passes Susan and enters. \n\nINT. VIRGIL'S MASSAGE ROOM - DAY \n\nVirgil has his back to us as he prepares the table. The room is very \nordered - every vial, bottle, towel has its exact spot. \n\nVIRGIL\nHey, Amy, I'm Virgil - why don't you \nget ready - hop up on the table.\n\n\nAmy sees Virgil - his head turned slightly away - she drops her \nsweats and lies on the table, face down - pulling the sheet to cover \nherself. \n\nAMY\nSounds like you're a genius at this.\n\n\nVIRGIL\n(laughs)\nThat's right.. Mozart, Einstein, Virgil Anderson, massage therapist. \nNow I'm going to start working somewhat deep -\nyou let me know if you want anything deeper.\n\n\nAMY\nDeeper is good - where I come from, \nall you get is shallow.\n\n\nVIRGIL\nI like that - deep it is.\n\n\nCLICK - he hits a button on a CD player and as we hear the soulful \naria \"Mira, 0 Norma\" from Bellini's Norma. \n\nVIRGIL\nFirst time in Pinecrest?\n\n\nAMY\nCame in late last night.. \nmissed the town completely.\n\n\nVIRGIL\nIf you came in broad daylight, \nyou could still miss the town completely.\n\n\nDISSOLVE TO:\n\nSlow moving cuts of Virgil, working long strokes over Amy's body - - \nhis hands gracefully LENGTHENING and STRETCHING her muscles. \n\nVIRGIL\nToo much compute? work.\n\n\nAMY\nUh-huh.\n\n\nVIRGIL\nBad chair - you should think about a change.\n\n\nAMY\n(quiet)\nAbsolutely.\n\n\nVirgil reaches his hands all the way down her spine and makes a move \nthat causes Amy to release a very deep guttural sound. \n\nVIRGIL\nToo deep?\n\n\nAMY\nNo.. ..... just right.\n\n\nAmy is now lost in another world - as Virgil shifts - working gently \n- not caressing - but molding - like a sculptor. \n\nA moment and Amy, surprisingly, begins to cry - softly. Virgil stops \n- takes a step back. \n\nVIRGIL\nI - I'm sorry - it was too deep...\n\n\nShe cries for another few beats - then takes a breath. \n\nAMY\nNo - it.. It's not you..\nIt's just things have kinda built up, \nI don't know why I'm crying.. look, \nthis is embarrassing...\n\n\nVIRGIL \nDon't be embarrassed - \nyou obviously needed it. \nWe should stop for today.\n\n\nAMY\nYeah, thanks.\nYou always make the girls cry.\n\n\nVIRGIL\nNot since grade school. \nI'm going to go now - unless you'd like me to stay.\n\n\nAMY\nCould you - just for a minute?\n\n\nVIRGIL\nOf course, whatever you need.\n\n\nVirgil sits next to her - then reaches out - takes her hand and \nstarts a slow comforting massage - we see Amy visibly relax. \n\nAMY\nYou ever feel like a Martian's\ninvaded your entire body?\n\n\nVIRGIL\nEvery day.\n\n\nAmy, closes her eyes - smiling slightly in thanks. \n\nINT. VIRGIL'S MASSAGE ROOM - LATER \n\nCAMERA pans slowly over to Amy asleep - and on the click of the door \n- her eyes dreamily open. \n\nAMY\nVirgil?\n\n\nINT. BEAR MTN. HEALTH SPA - LATE DAY \n\nHallway outside the massage area. Amy exits the change room, now \nwearing her sweats - pulling on her sneakers. \n\nVIRGIL (O.S.)\n(calling out)\nHey Caroline, you look incredible today.\n\n\nCAROLINE (O.S.)\n(laughing)\nQuite a compliment, Virgil. See ya tomorrow.\n\n\nVIRGIL (O.S.)\nSee ya.\n\n\nAmy looks down the hall - sees a glimpse of Virgil rounding the \ncorner. She chases after hi~n into the reception area where she sees \nhim exiting the door and moving of f down the driveway. \n\nAMY\nVirgil - wait...\n\n\nHe's gone. Hopping along, tugging on her last sandal - she decides \nto go after him - fighting her way through a large tour group just \nchecking in. \n\nEXT. BEAR MTN. SPA - LATE DAY \n\nVirgil in the distance, moving his way towards the main street. Amy \nexiting the building - trying not to slip on the ice as she, hurries \nafter him - trying to get close enough to call out. \n\nVirgil stops at a main roadway as Amy comes up behind him. \n\nAMY\nVirgil, hey.\n\n\nVirgil turns - sunglasses on - looks directly at Amy. \n\nVIRGIL\nYes.\n\n\nAMY\nIt's Amy - Amy Tremont.\n\n\nVIRGIL\nOf course - you were sleeping, \ndidn't want to wake you.\n\n\nAMY\nYes thanks - you're the skater, right - \nI saw you last night, coming in. \nPretty mean slapshot. \nYou play on some team or something?\n\n\nVIRGIL\nYeah, something. You a hockey fan?\n\n\nAMY\nAlways liked it - never get around to \nseeing a game. But I loved to skate \nas a kid - unfortunately I have two left feet.\n\n\nVIRGIL\n(playing with her) \nThey look perfectly OK with me.\n\n\nAmy laughs, starts relaxing - unconsciously starts to flirt. Head \ncocked, shifts her weight on one foot, moving slightly closer. \n\nAMY\nI love the view you get here.\n\n\nVIRGIL\nSame here - I never get used to it.\n\n\nJust then a YELLOW SCHOOL BUS pulls up in front of him and WHOOSH \nthe doors pop open revealing CARL KIPLING, black, a hundred years \nold. Virgil turns as a few kids pile off the bus.. \n\nVIRGIL\nWell, this is my ride. \nHey Tommy, my man.\n\n\nAnd with his hand extended a kid high fives it. Amy looks up - a BUS \nfull of young school kids. Seems odd. \n\nTOMMY\nVirge.\n\n\nAs the kid moves off. \n\nAMY\nWell, I just wanted to apologize for back there - \nblubbering like that - I was just in a weird place.\n\n\nVIRGIL\nAnd now...\n\n\nAMY\nNow, I'm fine - so I wanted to \nthank- you. For what you did.\n\n\nVIRGIL\nFor making you cry.\n\n\nAMY\nNo, I made me cry - and you handled \nit great - didn't freak or anything.\n(beat)\nIs my mascara smeared or something?\n\n\nVIRGIL\n(laughs)\nNo. Why?\n\n\nAMY\nYou're just looking at me funny.\n\n\nCARL\nVirgil - lets move it.\n\n\nVIRGIL\nAs I said earlier - I just never get used to the view.\n\n\nVirgil starts towards the bus, reaching behind to his pack. Pulls \nsomething out. \n\nVIRGIL\nSee you tomorrow.\n\n\nAnd CLICK, CLICK, CLICK - a WHITE CANE unfolds in his hand. And he \ntaps his way to the bus. \n\nAMY\nSee you... oh my God.\n\n\nVIRGIL\nWhat?\n\n\nAMY\nYou're, you're -- I'm so sorry.\n\n\nVIRGIL\n(smile)\nHey, you already apologized once \n- no need to overdo it. Bye now.\n\n\nAmy doesn't know how to respond. And he moves into the front seat of \nthe bus - amongst \"Hey Virgil's\" from the school kids and Ca-chunk \nthe doors close - the Yellow Bus steaming off - past Amy, as she \nstares at Virgil in the front seat - about to wave to him - then \nrealizing he wouldn't see. \n\nAs she turns and watches the bus move off down the street - a hand \ncomes out - Virgil's - and waves good-bye. \n\nEXT. VIRGIL'S HOME.- DUSK \n\nThe BUS stopping in front of Virgil's home - a side-by-side DUPLEX \nat the edge of surrounding woods. \n\nVirgil steps into the street and with a HONK the bus pulls away. He \nturns, grazes his hand across a tree out front - and starts towards \nhis home. \n\nAT THE PORCH - he hesitates at the first door. Finds it with his \nhand - then raps on it. \n\nNo answer. He moves over to his own door - and goes inside. \n\nINT. VIRGIL'S HOME - EVENING \n\nAs he enters, Sophie, an aging LAB, lays on the couch. \n\nVIRGIL\nGet of f the couch, Sophie.\n\n\nAs the dog slides guiltily off the couch. \n\nVIRGIL\nSome seeing eye dog - \nmore like sleeping eye dog.\n\n\nVirgil bends down as he passes the coffee table to pick up the \nREMOTE CONTROL placed just so. Click - a Game Show pops on. \n\nVIRGIL\nMet a girl today - nice voice -\nfollowed me out of the building.\n\n\nSophie barks. \n\nVIRGIL\nNo she wasn't a stalker.\n\n\nCLOSE ON Virgil's hand flipping open a large book marked \"TV HOCKEY \nSCHEDULE\" - it's completely WHITE - all in BRAILLE. \n\nJENNIE (O.S.)\nSophie's just worried about you - \nshe watches too many horror movies.\n\n\nIn the kitchen, JENNIE ANDERSON, older than Virgil, simply dressed, \nputting a just made dinner carefully onto a plate. \n\nVIRGIL\nHey, you're here - so how \nare the kids today?\n\n\nRunning his hand down the pure white page - he finds what he wants: \nBAP - he hits the channel changer and the game comes on. \n\nJENNIE\nThe usual - need a lot of attention. So who's the girl?\n\n\nMoving into the kitchen, Virgil puts the remote to the side of the \nrefrigerator where it VELCRO sticks to an exact spot. \n\nVIRGIL\nFrom the spa. I made her cry.\n\n\nJENNIE\nYou haven't done that since-- \n\n\nVIRGIL/JENNIE\n-- grade school.\n\n\nVIRGIL\n(smile)\nThat's what I told her. Coke?\n\n\nVirgil moves past Jennie as she goes into the living room - hand up, \ndoor open and he's got a glass. Back to the fridge, he grabs a coke. \n\nJENNIE\nI'm fine. Your dinner's ready - chicken's \nat 3 o'clock - rice is at...\n\n\nVIRGIL\n6 o'clock, peas at 9 o'clock \nand news at 11.\n\n\nJennie places Virgil's dinner down in an exact spot on a coffee \ntable (facing away from the TV). \n\nJENNIE\n(laughs)\nOne day I'm going to switch them on you.\n\n\nVIRGIL\nAnd one day I'll play forward \nfor the New York Rangers.\n\n\nFour precise steps into the room and Virgil plops down on the sofa - \nfinds his fork. Jennie moves to a counter where a pile of school \nbooks sit. \n\nJENNIE\n\nHa - ha. You need new jokes.\n\n\nVIRGIL\nOr a new sister. \n\nJENNIE\nI'd work on the jokes.\n\n\nPicking up the books she moves past Virgil - pecks him on the head \nand moves to the door. \n\nVIRGIL\nYou want to watch some hockey?\n\n\nJENNIE\n(at the door)\nYou want to grade some spelling tests? \n(beat)\nI'll be next door you need me.\n\n\nShe leaves and Virgil pats the couch and Sophie hops up next to him. \n\nVIRGIL\nYou know this girl - for one moment -\nshe actually thought I could\n(Sophie grumbles as she settles in) \nI'm not kidding. \n(beat) \nAnd she had this great voice - relaxing - \nsoft like a breeze through\n(beat)\nWonder what she thinks about \"blind dates.\" \n\n\nINT. AMY'S ROOM - EVENING \n\nAmy in bed - just out of the shower - the only light in the room \ncomes from the TV. She has the remote, mindlessly switching channels \n- not staying on one for more than a second or two. \n\nClick - an Odd Couple rerun - click - ESPN bowling - click - Three \nStooges - Moe poking Curly in the eye - click - click - click. \n\nBored, she stops - notices a small scarf on a chair next to the bed. \nShe picks it up, holds it against her eyes and ties it tight around \nher head. \n\nShe stands - hands out in front of her - starts to walk across the \nroom - not so bad - WHAM - right into a side table. Shit that hurts! \nGrabbing her leg, she hops - hits a lamp. \n\nAMY\nDAMMIT!\n\n\nRipping the towel of f her head - hopping around on one foot - she \nhears: \n\nKNOCK KNOCK \n\nAMY\nComing!\n\n\nRubbing her leg - she limps/half walks to the door - opens it to: \n\nVirgil: dark glasses, cane, smile \n\nAMY\nVirgil..?\n\n\nShe pulls a towel in closer - then realizes it doesn't matter \n\nVIRGIL\nMy turn to apologize. I should have told \nyou I was blind it wasn't fair.\n\n\nAMY\nThat's OK. You want to come in -\nI just got out of the shower - give me \na minute to get changed?\n\n\nVIRGIL\n(as he moves in)\nSure, I promise I won't look.\n\n\nAs Amy starts to get changed in the bathroom. \n\nVIRGIL\nAnyways, I was in the neighborhood -- \nactually the whole town's my neighborhood \n-- and since you've never been to our\nillustrious village, I thought maybe we could \ngo into town - see what we see.\n\n\nAMY\nSee what we see?\n\n\nVIRGIL\nFigure of speech\n. \n\nAMY\nYou mean right now, tonight?\n\n\nVIRGIL\nGreat - I'm blind and you're deaf - what a pair.\n\n\nEXT. MAIN STREET - EVENING \n\nA few store windows lit up. Some people eating dinner at a \nstreetside cafe. Virgil, holding Amy's arm as they walk down the \nstreet. \n\nWITH AMY AND VIRGIL WALKING: \n\nVIRGIL\n... the Mechanic at the top of the street is Doug - smokes too \nmuch - but a good guy. Three steps down is Carlson's hardware\n- he's got a laugh like a donkey - we sometimes listen to games\ntogether - he's a Devil's fan. And just up ahead should be Grady's \njunk shop - he calls it \"antiques\"...\nSmells like junk. I'd hate to see what it looks like\n. \n\nA woman bustles past, NANCY BENDER, weighed down with groceries. \n\nVIRGIL\n(intuitively)\nHey Nancy.\n\n\nNANCY\nHey Virgil - got that book in for you.\n\n\nVIRGIL\nNancy's our librarian, brings in \nany braille book I want.\n\n\nNANCY\n(to Amy)\nThe guy's nuts about the pyramids -\nanything he can get his hands on...\n\n\nVIRGIL\nThank-you Nancy - you should get your\ngroceries home - your ice cream's melting.\n\n\nNancy laughs - as she moves off. \n\nAMY\nNice place - you seem to know everyone here.\n\n\nVIRGIL\nMoved here when I was eight. \nMy family figured it would be a \ngood place for me to grow up. \nTell me what you see.\n\n\nAMY\nWell, there's a good structure to the \ntown - genuine lines, good use of space. \nTo be honest I'd find a better balance \nto a lot of these buildings. But that's me.\n\n\nVIRGIL\nWhat's you?\n\n\nAMY\nThe architect in me - can't leave well\nenough alone. Art school in college - \nI made the arms for the Venus DeMilo. \n(realizing he probably doesn't understand)\nsee, the Venus De Milo has no arms and...\n\n\nVIRGIL\n(laughs)\nI know the Venus De Milo has no arms, and \nthe Mona Lisa has this captivating smile\nand David doesn't wear a fig leaf.\n\n\nAMY\nHow do you...\n\n\nVIRGIL\nI may not have been a lot of places -\nbut I read about things, then make an\nimage up here -- (points to his head)\n--that works for me.\n\n\nGrazing his hand across a telephone pole - Virgil stops - turns to \nAmy. \n\nVIRGIL\nThis is the end of the street. \nWe should turn back.\n\n\nAMY\nWhat about past the end of the street? \nWhat's out there?\n\n\nHe turns around. \n\nVIRGIL\n(shrugs)\nNothing.\n\n\nAMY\nNo - there's an old run down \nbuilding off to the side...\n\n\nVIRGIL\nMust be the old firehouse. \nIt had a fire so they shut it down. (Amy laughs)\nHonest to God.\n(intrigued)\nWhat else do you see?\n\n\nAMY\nA wall of shrubs - \na field with an interesting configuration of trees.\n\n\nThe wind has picked up a bit. \n\nVIRGIL\nTell me how you see it.\n\n\nAMY\n(enjoying the game)\nOK, sure. Let's see - long and elegant. Like -- \nlike a woman dancing with two lovers, trying \nto decide which one she loves.\n\n\nVirgil stops a moment - takes in the image. \n\nAMY\nWhat?\n\n\nVIRGIL\nIt's just - the image you just \ngave me - \"Dancing trees. - I like that.\n\n\nVirgil stops - his head cocks slightly. \n\nVIRGIL\nWe should go - it's starting to rain.\n\n\nAMY\n(looking around) \nThere's a bit of a breeze but-- \n\n\nKABOOM - thunder - and the rain just drops. \n\nINT. FIREHOUSE - NIGHT \n\nThey run in laughing - Amy closing the door behind them as Virgil \nmoves his way into the center of the room - stands where the \nmoonlight from a high window hits the floor. Water runs down the \noutside glass, causing the light to ripple across him. The room is \nempty - almost surreal. \n\nAMY\nI can't believe how fast it happens...\n\n(she sees Virgil - his head cocked towards the ceiling) \n\nAMY\nVirgil?\n\n\nVirgil's head turns toward her. \n\nVIRGIL\nYou like rain - I love the rain.\n\n\nAMY\n(moving to him)\nWhat were you just doing there?\n\n\nVirgil slowly moves his head about, sensing the room. \n\nVIRGIL\nListening - the rain - it brings out the \ncontours of everything, gives life to \na room I can't see.\n\n\nWE SEE SLOW MOVING CUTS of the building as Virgil describes what he \nhears. \n\nVIRGIL \nYou hear it?...on the roof dripping down the \nwalls on every side. On the right, on the \ndrainpipe, it's drumming with a deeper, \nsteadier sound - - like a timpani - echoing \nacross the room - tells me the room is large \n- open. You feel it - in your chest? On the left, \nthe rain says... (he listens)\n...a fire escape, with it's own rhythm \n- ping - ping. Then listen - there...\n(he points)\n--what's that - over there...?\n\n\nAMY\nLooks like it's...\n\n\nVIRGIL\nNo, listen for it - not what it \nlooks like - what it becomes. \nCome here.\n\n\nAmy moves closer - Virgil puts his hands out on her shoulders - \nturns her to the sound. \n\nVIRGIL\nNow just listen to it - shut out\neverything but that sound - \ndo you hear it?\n\n\nAmy strains to listen - closes her eyes - her head instinctively \nturning - no in unison with Virgil's \n\nAMY\nYes - there - it's soft - like a shimmer\n\n\nVIRGIL\nThe wind blowing the rain against a window.\n\n\nAMY\n(smile)\nLike a cymbal. It's like our own \npercussive symphony, isn't it?\n\n\nAmy opens her eyes - looks about the room - listening. \n\nVIRGIL\nThe world is invisible to me - with my touch it comes \nalive. But only one thing at a time. But when it's raining,\nI feel everything at once. Sometimes, I wish it could \nrain inside rain all around us.\n\n\nAMY\n(musing)\n\"Einfuehlung.\"\n\n\nVIRGIL\nWhat?\n\n\nAMY\nEinfuehlung - it's an architectural term. \nIt means to share an empathy. \nBeen a long time since I felt that.\n\n\nAnd as they stand listening to the rain, playing its music - Amy \nwatches him - fascinated by him - then shivers slightly. \n\nVIRGIL \nYou're cold, we should go.\n\n\nAMY\nNo, I'm fine, really. It was just something passing \nthrough me - can't explain it - a good thing.\n\n\nAmy smiles at him - then quietly realizes \nhe can't see it. She moves close, her \nhand reaching out and taking his. \n\nAMY\nWhat you just showed me \u0085 how \nI feel - makes me smile.\n\n\nShe takes his hand - hesitates - then puts it on the side of her \nface. \n\nVIRGIL\nI see it now. Thank-you.\n\n\nWe hold a beat - enjoying the symphony of rain - then cut to: \n\nEXT. BEAR MTN. LODGE - MORNING \n\nThe sun warming the cool morning air. The school bus pulling away to \nreveal Virgil making his way into work. \n\nVIRGIL (V.O.)\nI thought after yesterday, \nyou'd never get up on my table again.\n\n\nINT. MASSAGE ROOM - NEXT DAY \n\nAmy on the table. Virgil squirting oil in his hand - preparing. \n\nAMY\nYou kidding? today, I'm looking \nfor a complete nervous breakdown.\n\n\nVIRGIL\nI love a challenge.\n\n\nAnd as he places his palms carefully on her back - working her back \nslowly we hear opera play quietly in the background. \n\nDISSOLVE TO:\nVirgil's hands on the small of her back - something amazingly \nsensual about how he works her muscles. Amy speaks to him in low \ntones - in a state of complete relaxation. \n\nAMY\nCan I ask how long you've been blind?\n\n\nVIRGIL\nOf course, most people avoid the subject. You tell them \nyou're blind and they act surprised. \"You're blind? Reallv? \nI didn't know - you hide it so well.\" And then they wave their\nhand in front of your face just to make sure.\n(beat)\nIt started when I was a little over a year old.\n\n\nVirgil's hands move down Amy's sides - slow - feeling each contour - \nthe oil making her skin glisten. Amy moves her head slightly with \nhis touch. She lets out a small breath of air. \n\nAMY\n(quiet)\nYou see shadows?\n\n\nVIRGIL\nNo. Congenital cataracts. And a case of retinitis \npigmentosa thrown in for good measure. \nThis area needs to loosen up.\n\n\nAMY\nI think you're doing it. \n(beat)\nNo bright lights, nothing?\n\n\nVIRGIL\nI'm blind as a bat. Actually, blinder 'cause they \nemit sonar all the time. I don't have a sixth sense,\nI just don't have the fifth one. I can't hear things in \nVermont, can't smell if you're mad at me, and, no \n- I don't know Helen Keller, Ray Charles or Stevie Wonder.\n\n\nAmy murmurs in response to Virgil's touch. \n\nVIRGIL\nYou say something?\n\n\nAMY\nNo, I just - this feels nice - too nice.\n\n\nVirgil moves his hands down her back - sensually kneading each \nmuscle. It's clear he's enjoying this as much as she is. \n\nAMY\nYou're very good.. at what you do.\n\n\nAnother breath exhales from her involuntarily as Virgil hits a \nsensitive spot. \n\nVIRGIL\nThank-you.\n\n\nAMY\nYou enjoy it.\n\n\nVIRGIL\nAt times. Some clients make it \nmore enjoyable than others.\n\n\nVirgil now works down her thighs - Amy's back arching slightly with \nthe movement - both of them heating to the moment. Both their \nbreaths quickening. \n\nAMY\nAnd this client...\n\n\nVIRGIL\nIs very, very...\n\n\nDING - and the spell is broken. \n\nAMY\nWhat?\n\n\nVIRGIL\nSorry - it's time. I've got Mr. Ketchum coming in next - \nall two hundred pounds. Sorry - I felt like we \nwere just getting started.\n\n\nAmy sits up on the table - the sheet pulling away slightly revealing \nher. For a moment she watches him - his head turned towards her - \nbut not seeing. Then she slowly pulls the sheet up covering herself. \n\nAMY\nThank-you. For last night as \nwell - love to do it again.\n\n\nVIRGIL\nHow about I cook dinner then, tonight.\n\n\nAMY\nI'd like that.\n\n\nINT. BEAR MIN. - NEXT DAY \n\nAerobics step class. Amy working out. In front of her two rather \nlarge women in neon stretch workout clothes - Amy tries to avoid the \nview - a thought - and she shuts her eyes as she continues her \nexercise. \n\nINT. BEAR MTN. - NEXT DAY \n\nAmy, towel around her neck - coming in from the workout. \n\nCAROLINE\nAmy \u0085\n\n\nINT. VIRGIL'S HOME - NIGHT \n\nOnions frying. Tilt up to Virgil - cutting the last of it and \nputting it in the pan - sizzling as it hits. Vegetables and a box of \npasta are arranged on the countertop. Sophie watches the \nproceedings. \n\nRRRRINNNG - the phone. \n\nVirgil stops cutting - his hand easily finds the phone. \n\nINTERCUT WITH \u0085 \n\nAmy: on the phone in her car on the Taconic Parkway. \n\nAMY\nVirgil - it's Amy. I - I can't make dinner - \nI'm really sorry - an emergency came up - \nthey're dragging me back to New York.\n\n\nVIRGIL\nOh. Yeah. Anything serious?\n\n\nAMY\nThe project we were working on was rejected - \ncould go down the drain. I'll deal with it quick - \nI'd like to come back.\n\n\nVIRGIL\nYeah. Good. Well. I'll be here.\n\n\nVirgil hangs up the phone - frustrated, he reaches for the frying \npan - and promptly burns his hand. \n\nVIRGIL\n-DAMN IT!!!\n\n\nDropping the pan - Sophie goes scurrying, as he kicks at it - \nsending it across the room. He turns - thrusts his hand under the \nsink - turning on the cold water. \n\nVIRGIL\nShit - that was stupid.\n\n\nEXT. FLATIRON DISTRICT - LATE DAY \n\nEvening rush hour traffic surrounding the Flatiron building. \n\nVOICE (ON SPEAKERPHONE)\nI'm just saying there seems to be something missing.\n\nINT. ROSWELL-TREMONT DESIGN - DAY \n\nA small cardboard model of what looks like a small mini-mall. Amy \nsits in front of it - drawing on a sketch pad. The office is sparse, \nfunctional. A few DRAFTSMEN can be seen in the background through a \nglass partition. \n\nDUNCAN\nAbsolutely Mr. Falk - something lj missing - we realize that now. We \njust need some time to figure out what.\n\n\nDUNCAN ROSWELL, 30's, leaning a little too ardently into a speaker \nphone. The voice on the other end is JACK FALK - their would be \nemployer. Their assistant BETSY ERNST, early 20's, sits in the \ncorner, taking notes. \n\nFALK \nFine - but you all know what kind of schedule we're on here?\n\n\nDUNCAN\n(watching Amy)\nAnd budget. Yes sir. Don't worry, we won't let you down.\n\n\nShe takes a piece of paper, has an idea, starts sketching - Duncan \nhangs up. \n\nDUNCAN\nDon't say it, I know. You were never happy with the design.\n\n\nAMY \nI wasn't going to say that.\n\n\nDUNCAN\nBut you'd have tinkered with it till the job went away. So now we've \ngot him hooked, you've got your second chance.\n\n\nAnd Amy shoves her rough sketch across the table. \n\nAMY\nLook at these site photos - see those \ntrees - we were going to get rid of them \n- let's incorporate them into the design \nuse what's natural about the location. \n(Duncan stares at her) \nAnd by the way - the 53rd St. lobby - coming \nback from Pinecrest, I came up with a new \naddition - add some life to that place.\n\n\nDuncan stares at the sketch - then looks up at Amy \n\nDUNCAN \nOK -- what's going on here? We sent Hydra \nthe three headed monster off a few days ago \nand got back Mary Poppins in return.\n\n\nAMY\nWhat? I can't have a couple of ideas. \n(even Betsy stares at her)\nFine, you want to know - I met a guy.\n\nBetsy stands. \n\nBETSY \nToo modern for me.\n\n\nDUNCAN \nSit down.Betsy. We're all friends here. \nSo - spill the beans.\n\n\nAMY \nNothing to spill - he's a good guy - \nsmart, funny, blind...\nDUNCAN \nWhoa, whoa - wait a minute - Blind!? \nLike tap-tap, white cane blind? Come on \nAmy - I mean, I know you like \nchallenges, hell you married me - but...\n\n\nAMY \nI knew you'd be understanding.\n\n\nDUNCAN \n(standing) \nNo, no I am. You're right, this is none \nof my business anymore - but a blind\nguy? If you're lonely - in my. opinion \n-- get a puppy.\n\n\nBETSY \nDuncan, don't be a jerk.\n\n\nDUNCAN \nYou still work here.\n\n\nHe's gone. \n\nBETSY \nHe's just jealous.\n\n\nAMY\nSo much for the \"we're all friends here\" idea.\n\n\nINT. ROSWELL-TREMONT OFFICES - NIGHT \n\nCLOSE ON - Computer screen. A cursor blinks - then the words \nCONGENITAL BLINDNESS - a CLICK and a web page for the AMERICAN \nBRAILLE INSTITUTE comes up. \n\nWIDE - we see Amy hovering over her computer - various sketches of \nthe proposed building next to her - two giant Magnolia trees have \nbeen incorporated into the design. As we watch her search on the \ncomputer we move over her shoulder to see in the corner of her plans \n- a sketch of the intertwined \"dancing trees\" and the Firehouse. \n\nBetsy enters carrying her jacket. \n\nBETSY \nEverybody's gone for the day.\n\n\nAMY \nThanks. You go ahead - I'm just finishing \nup something here.\n\n\nShe turns to look at Betsy who now peers over her shoulder - sees \nwhat she's doing. Amy looks up at her - sees Betsy's look. \n\nAMY \nWhat? I just want to know a little more \nabout what's wrong with him.\n\n\nBETSY \n(pause) \nAmy? Friend to friend?\n\n\nAMY \nShoot\n\n\nBETSY\nI hate to admit it but I agree \nwith Duncan on this one.\nAMY\n(back to the computer) \nDon't shoot.\nBETSY\nHe makes sense sometimes. My father had \na problem a few years back with severe \ncataracts. Do you have any idea what \nyou're getting into?\n\n\nAmy spins in her chair - looks to Betsy. \n\nAMY \nYou ever listened to rain - \nI mean really listened?\n\n\nBETSY \nThis like that smell the roses thing?\n\n\nAMY\n(turns to her) \nI've spent the last five years of my adult \nlife with a man who has the emotional \ncontent of a soap dish. The only time I \nsaw him cry was doing our tax return three \nyears ago.\n(beat) \nI need more than that, Betsy. For once in a \nlong, long time I feel like I can breathe again. \nJust the way he touches me I know I found \nsomeone I can connect with.\n\n\nBETSY \nAh, here we go.\n\n\nAMY \nNo, no. I can tell he's sensing everything about \nme with a simple touch. He listens to my every \nword as if it's the only sound on the planet - \nI feel like even though he can't see me, he knows \neverything about me. He just moves me - does that \nsound crazy.\n\n\nBETSY \n(beat) \nDoes he have a brother?\n\nEXT: PINE CREST MOUNTAINS - LATE DAY \n\nThe FROZEN POND, nestled against a strand of pine. Virgil skates \nfast across the ice enjoying the speed - the wind using his hockey \nstick as a guide - he nears the edge of pond - feels it with the \nstick and slams to a stop. \n\nHe shuffles his body around to face in the other direction - then \nstarts skating again - passing AMY standing on the snow covered \nbank. \n\nON AMY - smiling, watching Virgil - enjoying his release of energy. \n\nHER POV - VIRGIL - skating well, a look of relaxation we've never \nseen on his face. He skates in an arc coming back past Amy. \n\nFinally she speaks. \n\nAMY \nWayne Gretzky, look out.\n\n\nVirgil slams to a halt in surprise - nearly toppling over. \n\nAMY \nSorry -- sorry. \nDidn't mean to scare you.\n\n\nVIRGIL \nAmy?!\n\n\nAMY \nI said I'd come back.\n\n\nVIRGIL \nHow long ... how long have you been...?\n\n\nAMY \nWatching you? Just got here - \ncouldn't find you at the spa - took\na chance you'd be here. You're very good.\n\n\nVIRGIL \nSkated since I was a kid. My dad taught me \n- wanted me to play pro one day. \nHow do you like my pond?\nAMY\nIt's beautiful.\n\n\nVIRGIL \nDescribe it for me.\nAMY\nOK. Let's see. Like cool \nblue silk - you know blue?\n\n\nVIRGIL \nI think so - keep going.\n\n\nAMY \nBlue silk stretched tight across \na bowl - surrounded by white \njacketed sentries of trees on \nthe horizon, protecting it from \nthe outside world.\n\n\nVIRGIL \nHorizon's a tough one.\n\n\nAMY \nWhat?\n\n\nVIRGIL \nNever understood horizon - if touch it - \ndon't know what it that's OK I liked \nthe rest of picture. \n(he starts moving towards her) \nYou want to skate?\n\n\nAMY \nSorry, I didn't bring my skates.\n\n\nVIRGIL \nDon't need them. Come on step hold of my stick.\n\n\nAMY \nExcuse me?\n\n\nVIRGIL\n(smile) \nHockey stick. Here.\n\n\nHe holds the stick out like a cross bar. Amy moves cautiously \nforward and takes hold of it. \n\nVIRGIL \nOK. Now hold on for balance. \nI used to do this with Jennie when we were kids.\n\n\nAnd Virgil starts skating backwards pulling Amy with him. Amy is \napprehensive at first then starts to enjoy the movement - the \nsensation - both of them laughing out loud. \n\nWIDE as we see them move about the rink - Amy sliding and being \npulled by Virgil. As he picks up speed we hear Amy scream in \ndelight. \n\nAMY \nLook out - we're running out of ice.\n\n\nVirgil turns expertly, arcing around the edge of the ice but Amy \nloses her nerve - and balance - and lets go of the stick and goes \nflying into an embankment. The momentum carries Virgil off down the \nice - both of them laughing hysterically. \n\nVIRGIL \nYou OK?\n\n\nAMY \nFine. Never been dumped so fast in my life.\n\n\nVIRGIL \nMe, dump you? No way. Stay where you are \n- I'll come to you - just keep talking.\n\n\nAmy sits up on her elbows in the embankment. \n\nAMY \nWhat do I say?\n\n\nVirgil starts gliding across the ice searching for Amy. \n\nVIRGIL \n(hearing her voice, veering in her direction) \nAnything - how'd you become an architect?\n\n\nAMY \nGod - let's see - I was in college - \nart school - a little aimless - and I met\nthis guy -. an architect - opened up a new \nworld to me. I liked the structure the \ncontrol - finding problems, coming up with \nsolutions - when I graduated - we started \na company together - on impulse got married\n- which was crazy - divorced a year ago - \nbut we're still partners.. which must seem\neven crazier.\n\n\nAnd Virgil's suddenly there - going a little too far - tumbling off \nthe pond and into her. \n\nVIRGIL \nYou'd think I meant to do that. \nA patented move.\n\n\nThey're close - in the snow together - face to face. \n\nAMY\n(Amy smiles, realizes) \nThis is tough.\n\n\nVIRGIL \nWhat?\n\n\nAMY \nI bat my eyelashes, toss my head just \nright, and there's this very sexy thing \nI do with my eyes - then realize none of \nit matters to you.\n\n\nVIRGIL \nIt doesn't matter. \nTell me what you look like.\n\n\nAMY \nI.. .1 don't know I'm...\n\n\nVIRGIL \nWait. Let me.\n\n\nHe puts his hand out, over her face -- hesitates, then slowly feels \ndown the contours of her cheek, her eyelids, the shape of her lips - \nAmy moving with the touch, the sensuality of it - and as he \ncontinues - Amy's hand reaches up - touching his face - Virgil \nsmiles. \n\nVIRGIL \nEyes, mouth, chin, cheek.. \nyou are very beautiful.\n\n\nAMY \nThank-you. So are you - more than \nI could describe.\n\n\nVirgil's hands move down her face - closing her eyes - letting her \njust experience his touch - his exploring. \n\nAnd as both their hands continue, enjoying the sensation of \ndiscovering each other - Amy leans forward, her eyes still closed, \nfinding his mouth - grazing his lips with her own - softly, gently, \nthen they fold into each other's arms locked into a warm, deep kiss. \n\nINT. VIRGIL'S HOUSE - BEDROOM - NIGHT \n\nIt's dark - a pale moonglow highlights the two intertwined naked \nbodies. A fire burns in the background. In flowing CUTS we see them \nmake love: \n\nVirgil - his head tilted down - Amy - puts her hand to his chin - \nlifts his head - then kisses each of his closed eyelids in rhythm \nwith Virgil's movements. \n\nAmy - now astride Virgil - she closes her eyes - feels it the way \nVirgil would - moving faster now - in total rhythm - shuddering in \nmutual release -- and she collapses on top of him - a deep breath \nand she rolls over - cuddles into his arm. \n\nA long beat - out of breath: \n\nAMY \nSo -- that's what a blind date is.\n\n\nThey breathe - then both start laughing - quietly - then \nhysterically together as Virgil wraps her up in his arms - holding \nher tightly. \n\nEXT. PINECREST - DAWN \n\nThe horizon. The sun cresting it - bringing a new light to the day. \n\nINT. VIRGIL'S HOME - EARLY MORNING Sounds of a shower in the \nbackground. Amy in Virgil's robe, pulls a juice container out of the \nfridge - pours herself a glass, putting the juice on the counter as \nshe walks into the living room - taking in the sparseness of his \nsurroundings. \n\nCLOSE ON - an open Braille Book. The completely white pages with \nminute bumps. Amy pulls up a chair, sits - and flips through the \nbook, running her hand across the pages - trying to understand his \nworld. \n\nShe then turns to the front cover to see what it is. Playboy. \n\nWe hear the shower stop as Amy smiles, puts the book down - pushes \nthe chair aside then moves to a series of pictures on the wall: \n\nVirgil as a young boy - his sister Jennie a few years older - and \nhis mother and father. Then another picture next to it - Virgil in \nhis skates and Jennie older - no father - Sophie at their feet. \n\nAnd a final picture - Virgil as an adult - he and Jennie on the \nfront porch - his arms wrapped around his sister like he's never \ngoing to let go. \n\nVOICE (O.S.) \nHello?\n\n\nAmy turns to see - Jennie, carrying a bag under her arm. \n\nAMY \nHello.\n\n\nJennie moves towards the kitchen. \n\nJENNIE \nI'm Jennie, Virgil's sister. \nAnd you are..?\n\n\nVirgil steps out - bathrobe - drying his hair. \n\nVIRGIL\nJen, this is Amy Tremont.\n\n\nJennie now at the kitchen - stares at the juice container - places \nit back in the fridge - just so. \n\nJENNIE\nI was just at the market Virgil, \npicking up a few things before \nschool - and I thought you might like some...\n\n\nVIRGIL \n(smells) \nApples and bananas.\nAmy sees the fruit on the counter - impressed. \n\nJENNIE \nHe's being a show-off, Amy - I always bring him these. \n(putting them in the fridge) \nThe apples are on the bottom shelf...\n\n\nVIRGIL \nAt two o'clock. Oranges at 10. \nI know, thanks.\n\n\nJENNIE \nAmy -- you in town long...\n\n\nAnd WHAM - Virgil moving into the room, collides right into the \nchair Amy moved - knocking into a lamp sending it to the ground. \nJennie immediately rushes over. \n\nAMY \nVirgil?\n\n\nVIRGIL \nI'm fine.\n\n\nJENNIE \nNo you're not - you're bleeding. \n(turning to Amy, sudden) \nFirst lesson with a blind man, \nAmy - don't change anything - \nit's too dangerous\n\n\nAMY \n(moving to Virgil)\nI'm sorry - I didn't know...\n\n\nVIRGIL\nIt was my fault. I'm OK.\n\n\nJennie still dabbing at his leg. \n\nVIRGIL\n(embarassed, snaps) \nGoddamit, Jennie - I said I was OK \n- leave me alone!\n\n\nJennie hesitates, then stands to go - sees the hockey book out of \nplace. A glance to Amy and she picks it up - quietly moves it back \nto it's rightful spot. \n\nJENNIE \nI've got parent meetings tonight - \nthere's dinner in the freezer - left corner.\n(turns to Amy) \nNice to have met you, Amy.\n\n\nAMY \nMe too - and again - I'm sorry.\n\n\nAnd she's gone - leaving Amy and Virgil together - a moment of \nawkwardness. \n\nAMY \nShe seemed ... nice.\n\n\nVIRGIL \nShe seemed jealous.\n\n\nAMY \nYour leg is still bleeding.\n\n\nVIRGIL \nIt'll stop - happens all the time. \nWelcome to my world.\nWe hold on Amy - taking this in: \n\nINT. BEAR MTN. - LATER THAT NIGHT \n\nJapanese lanterns criss-cross across an open area. Guests of the spa \nmingle about - drinks in hand - some dance on a floor set up over \nthe aerobics area. Music plays in the background. \n\nAmy, carrying two trays of food, finds her way to where Virgil sits \nat a table off to the side - putting his food in front of him. \n\nAMY \nLet's see if I can get this right. \nChicken's at three - salad at seven - \nvegetables at ten.\n\n\nVIRGIL \n(picking up his fork) \nVery good - thank-you.\n\n\nAMY \nThis is nice. \nThey do this every weekend?\n\n\nVIRGIL \nEvery Friday - for the guests leaving. Supposed to make them want to \ncome back.\n\n\nAMY \n(sits, uneasy) \nLove the music - \nGershwin - makes you want to...\n\n\nShe stops. Virgil, fork poised over his food, senses her \nuncomfortableness. \n\nVIRGIL \nYou like dancing?\n\n\nAMY \nHmmm? Yeah - don't do it much. \n(changing subject) \nChicken's good.\n\n\nAmy resumes eating - Virgil's fork spears something on his plate - \nraising it to his mouth - both we and Amy now see it's a large pat \nof butter. Too late - it's in his mouth. \n\nAmy watches him - the reaction on his face as he tastes it - then \nsurreptitiously swallows it. Then realizes Amy saw him. \n\nVIRGIL \nNothing like a good pat of fat. \nWhat do you say we dance?\n\n\nAMY \nNo, really, I'm fine...\n\n\nVirgil is up - pulling her hand. \n\nVIRGIL \nCome on\n\n\nShe stands and Virgil puts his hands on the back of her shoulders. \n\nVIRGIL \nLead on.\n\n\nAnd as she ushers him to the floor the music changes - a salsa - \nlively. Amy stops: \n\nAMY \nDifferent piece - maybe we should...\n\n\nVIRGIL \nYou kidding - take my hand.\n\n\nAnd as she does - Virgil starts dancing to the music - feeling the \nbeat - in perfect rhythm but his moves are his own, something we've \nnever seen before - uninhibited, wild - a little funny, but also \nthere's something sensual in his abandonment. \n\nAll Amy can do is hang on for the ride - enjoying Virgil enjoying \nhimself. People even clear back a little to give him some room - \nhowever he moves about the floor easily - somehow sensing where the \nother couples are. \n\nIt's a whirlwind moment - a moment where the two of them get lost \nwith each other - for a second shutting out the world and it's just \nthem, the music and their movement. \n\nThen suddenly the music is over. And they stop - the moment gone. \nVirgil turns to Amy and she applauds Virgil's wild moves \n\nHe takes a bow with a flourish. Spins to another angle - another \nbow. Spins back again - a step back and: \n\nCRASSSH - he's into the buffet table - sliding to the ground - food \nspilling on top of him. Amy, can't help but laugh, rushes to him. \n\nAMY \nYou have to teach me that move.\n\n\nAnd Amy reaches down to his guacamole covered hand - and pulls him \nup into an embrace and as they kiss amidst sauce and salad dressing \n- we see: \n\nINT. AMY'S HOTEL ROOM - MORNING \n\nAmy - on the phone - looking out her window. \n\nAMY \nBetsy - you were telling me about your father, \nhis cataracts - you said he had a problem. \nHow is he now? \n(she listens) \nDoctor - Dr. Aaron? - do you have his number?\n\n\nINT. BEAR MTN. GYM - DAY \n\nA handful of people on various pieces of equipment. Virgil, tank \ntop, heavy sweat, on a stationary bicycle - working out. Amy next to \nhim on a treadmill - trying to keep up as Caroline from the front \ndesk comes and hands her something. \n\nAmy reads it briefly then hops off the treadmill moving to Virgil. \n\nAMY\nVirgil, I just got some great news.\n\n\nVIRGIL \n(picking up speed again)\nThe Atlanta project?\n\n\nAMY\nNo, no - I was talking to my assistant \nthis morning - her father had these \nsevere cataracts...\n\n\nVIRGIL \n(slowing) \nOh. Really.\n\n\nAMY\nShe put me in touch with a Dr. Richard \nAaron - the guy's the leading eye surgeon\non the eastern seaboard - he's been working \nwith techniques - I don't know all the jargon \n- but I spoke to him earlier on the phone \nat the Institute...\n\n\nVIRGIL \nYou called this guy?\n\n\nVirgil stops riding - starts to get off the bike. \n\nAMY \n(excited) \nI told him all about you - he just faxed me \nback - he'd love to get a look at your eyes \n- he thinks maybe, mavbe - there might be a \nchance of reversal.\n\n\nVirgil faces Amy, best he can, while he pulls on his sweat jacket. \n\nVIRGIL \nI don't get it - am I missing the sign \nthat says it's help the handicapped week.\n\n\nVirgil starts to move away. Amy stops him. \n\nAMY \nI thought you'd be excited. What's the problem?\n\n\nVirgil turns on her. \n\nVIRGIL\nNo problem. That's the whole point \nhere Amy - there is no goddamned problem.\n\n\nAnd Virgil turns and bumps into a stationary bike, he SHOVES it off \nto the side, and makes his way out of the gym. \n\nINT. LOCKER ROOM - DAY \n\nVirgil enters, visibly upset - passing a CO-WORKER coming out of the \nshower. \n\nCO-WORKER \nHey Virgil.\n\n\nVirgil steams right past him - not answering - hands feeling down \nthe lockers - finding his - he tugs it open - pulls off his shirt \nand throws it in. He takes a breath, settles himself - then SLAMS \nthe locker door shut. \n\nEXT. JENNIE'S SCHOOL \n\nPARENTS are picking up their CHILDREN from Jennie's school. As \nJennie helps the last of the kids into her mother's car - she looks \nup to see Amy across the street. \n\nJENNIE \nAmy, right?\n\n\nAmy nods - starts towards her. \n\nAMY \nI'd like to talk to you if \nI could -- about Virgil.\n\n\nJENNIE \nSomething wrong?\n\n\nAMY \nSort of. There's something I don't \nunderstand. You see I spoke to a doctor \nwho's apparently doing breakthrough \nwork on cataracts -\n(Jennie turns to Amy) \n- but when I brought it up to Virgil he acted as if...\n\n\nJENNIE \nWhat don't you understand?\n\n\nAMY \nIf I was blind almost all my life -- \nand there was even a remote possibility \nI could see - I'd jump at it.\n\n\nJENNIE \nWhen there's something you've adapted to, \naccepted - you'd just want to change \nit without even thinking about it? \n(beat) \nWe're very comfortable here, Amy. \nVirgil has everything he needs.\n\n\nAMY \nI thought just maybe he'd like to not \nbe falling over things for the rest \nof his life. Look, I see...\n\n\nJENNIE \n(cuts her off) \nYes you do and Virgil doesn't. He spent \nthe first eight years of his life having \nhis eyes prodded, pierced and poked by \ndoctors, faith healers, spiritualists, \nshamans and medicine men. My father had them \nlined up out the door. It hurt and disappointed \nus all and it almost killed him. He doesn't \nneed to go through that again. Now - maybe \nyou understand.\n\n\nAnd she turns on her heel and is gone. \n\nEXT. VIRGIL'S COTTAGE - LATE DAY \n\nAmy making her way up to the porch - hearing from inside. \n\nVIRGIL (V.O.)\nNo, no - why - why?!\n\n\nShe hurries up the steps, reaching the open door where she sees \nVirgil, his head in his hands. \n\nVIRGIL (V.O.)\nI can't believe you're doing this to me.\n\n\nAMY \nWhat - Virgil?\n\n\nVirgil turns sharply - Sophie jumps up - starts barking. \n\nVIRGIL \nSophie - stop it. Amy? C'mon in - it's just \nthe Rangers. I could check better than these \nguys today.\n\n\nAMY \nThey lost?\n\n\nVIRGIL \nI prefer to think of it as not winning.\nI thought you would have been long gone\nafter that outburst from my evil twin\nbrother. We've had him committed you\nknow. Rikers Island - hard time. \n(standing)\nCan I get you something - - Coke - beer?\n\n\nAMY \nNo - I - I'm fine. I just wanted apologize \nfor stomping around in life like Bigfoot today.\n\n\nVirgil turns towards Amy. \n\nVIRGIL \nAmy, you see the big tree outside? \nHow far is it from my front porch?\nAMY\nGuessing, about thirty feet.\n\n\nVIRGIL \nTo you. But to me, it's fourteen steps exactly. \nFourteen steps and I arrive right where I want \nto be. But -- if I run or rush, I'll lose count \nand slam into it.\n\n\nAMY\nI'm sorry. Told you - can't leave well enough \nalone. I - I guess I should get back, start to pack...\nVIRGIL \nRushing into trees again?\n\n\nOff Amy's smile we CUT TO: \n\nEXT. VIRGIL'S HOUSE - NIGHT \n\nOn the Porch - the two of them - sipping glasses of wine - we see \ntheir dinner - Hungry Man beef entree - each category of food in \nit's own perfect little compartment. \n\nAMY \nYou know this dinner - this is really quite...\n\n\nVIRGIL \nOrdinary? \n(she laughs) \nIt's an acquired taste - trust me. \nJennie thinks it's the only way I'll \nknow where my food is. But I have a \nsecret weapon.\n(holds up a little bottle) \nHot sauce! Let's you know you're eating \nsomething - like some.\n\n\nHe starts to sprinkle liberally on Amy's food. Amy, laughing grabs \nthe bottle. \nAMY \nThat's OK - I'll do it. \nDon't want to overdo it.\n\n\nShe puts the bottle down - looks to Virgil - sips her wine. Time to \nface it. \n\nAMY \nVirgil - I have to go home tomorrow...\n\n\nVIRGIL \nWait, wait - you smell that?\n\n\nAMY\nNo - what?\n\n\nVIRGIL \nThe winter pines - it's so strong at \nnight - drifts on the wind - wait - \nhear the breeze then...\n\n\nAMY \nThere.\n\n\nAmy closes her eyes - takes in the scent - and they both sit there - \nclose - taking in the night air - enjoying the moment. \n\nAnd on Virgil's face we see him lost in thought. \n\nINT. VIRGIL'S HOME - NIGHT \n\nCLOSE ON VIRGIL - eyes closed - we hear a sound - like night \ncrickets. His eyes slowly open. \n\nHe rolls over - his arm reaching out for her: \n\nBut there's no one there. Virgil sits upright. \n\nVIRGIL \nAmy?\n\n\nAmy is sitting in a chair by the window. \n\nAMY \nI'm here - trouble sleeping.\n\n\nVIRGIL\nC'mere.\n\n\nAnd she crawls back into bed, Virgil takes hold of her and as she \nsettles into his arm, he strokes her face gently - a blind man's \nversion of watching his lover fall to sleep. \n\nBLACK - then we hear voices \n\nINT. VIRGIL'S BEDROOM - MORNING \n\nCLOSE ON: Amy's face - the voices awaken her - cutting into her \ndreams. \n\nShe looks out the doorway - sees Virgil and Jenny arguing on the \nfront porch. She can't hear what they are saying - but it's clear \nthere's a problem. \n\nINT. VIRGIL'S LIVING ROOM - MORNING \n\nAmy pulling a robe around herself - comes into the room - as Jenny \nturns on her heel and walks away from Virgil. \n\nEXT. PORCH - MORNING \n\nVirgil stands there a moment - taking in what just happened. Amy \nsteps out onto the porch. \n\nAMY \nEverything alright?\n\n\nVIRGIL \nYeah, yeah. Morning - Look, \nsomething I want to say...\n\n\nAMY \nThe leaving thing - I know - hate it too.\n\n\nVIRGIL\nThe other night - when we were dancing - \nbeing with you - I felt different -\nspecial - I don't know - whole.\n\n\nAMY \nThat was whole?\n\n\nVirgil puts his hand out - she takes it - he turns to her. \n\nVIRGIL \n(smile) \nJust for a second I felt like I could see \nyou - all of you. \n(beat) \nWhat you said about this Doctor, this eye guy - \nI know how important it is to you...\n\n\nAMY \n(turns to him) \nAre you sure you want to do this?\n\n\nVIRGIL \nWe're just going to talk to the guy \n- what could it hurt?\nOff Amy's smile: \n\nSMASH TO: \n\nEXT. GEORGE WASHINGTON BRIDGE - MORNING \n\nA soaring shot. Amy's car - travelling across the bridge - heading \ntowards Manhattan. \n\nAMY (V.0.) \nYou're going to love the city \n- so many things to see.\n\n\nINT. CAR - MORNING \n\nVirgil in the passenger seat - windows open - taking in all the \nsounds - new and exciting. Amy watches him as she drives. \n\nVIRGIL \n(laughing) \nWaitwaitwait - he hasn't said he \ncan even do anything yet.\n\n\nAMY \nI know I just feel good about this. \n(Amy looks to him - sees him feeling \nthe light against his face) \nVirgil, before you lost all sight, \ndo you remember seeing anything at all? \n\n\nVIRGIL \nYeah, I do. I was just a baby when it \nhappened - but there is one thing. \n(beat) \nSomething ... puffy. That's all I \nremember about it. Everyone says it's \n\"clouds,\" but I know I had it in my hands \n- so it couldn't be clouds. This puffy \nthing - that was something special - \nit's stayed with me all these years - \nI don't know why.\n\n\nINT. NEW YORK EYE HOSPITAL - EXAM ROOM - DAY \n\nDR. RICHARD AARON, wire rims, short, stylish haircut - is finishing \na high-tech examination of Virgil's eyes. Cups attached to wires sit \nover his eyes. The machine, an ELECTRORETINOGRAM, emits an \nirritating strange flat line sound. The room is very dimly lit. \n\nAaron adjusts an intensity dial on the machine - a series of \nflashing lights hit Virgil's eyes. The doctor jots down a reading - \nthen with a flourish, spins the machine away from Virgil's face and \npops a button emitting a detailed computer print out. \n\nIn the corner sits an older gentleman - Dr. Goldman - focused on \npapers in his hands. \n\nAARON \nOK - we're done.\n\n\nAaron bumps up the lights and wheels his chair back over to Virgil \nas Amy moves to join them. \n\nAARON \nSome good news. You have grade 4 \nposterior subscapular cataracts.\n\n\nVIRGIL \nAnd this is the good news?\n\n\nAARON\nGood news in that I should be able to \nremove them with little or no damage \nto your cornea.\n\n\nAMY \nSo -- what does that mean - \nthey're gone - then what?\n\n\nAARON \nThe cataracts are acting like a curtain - \ncovering the window of sight. If the disease \nto the retina is reduced as much as I think \nit is - there's a very good possibility \nwe can give you sight.\n\n\nAmy looks to Virgil - apprehensive. Virgil's expressionless - taking \nthis all in. \n\nVIRGIL \nSounds expensive.\n\n\nAARON \n(looks to Goldman who nods imperceptibly) \nWe feel there's an opportunity for us all here - \nI think I can get the institute to pick up the bill.\n\n\nVIRGIL \nSo. Say you remove the cataracts - \ndo you have any idea what kind of vision I'd have?\n\n\nAaron looks to Goldman. \n\nAARON \nAt this time - no. Unfortunately the \ncataracts are not allowing me to see the \nretinal wall. I can't tell how advanced \nthe retinitas pigmentosa has become.\nVIRGIL \nSo you're suggesting an operation \nthat may or may not be successful.\n\n\nAMY \nBut there is a chance he \ncould regain his sight.\n\n\nAARON \nThere have been a few cases of restored \nvision in adulthood to a patient blind since birth. \n(moves near Virgil) \nThe operation is delicate, I'll admit - \nbut nothing as invasive as what you went \nthrough as a child. Of course there is \nalways some risks with any operation - \ninfection, swelling - long shot stuff. \nI would do both eyes at the same time \n- it's basically out patient surgery.\nVirgil - an exhale of air. A lot to take in. \n\nVIRGIL \nWhat if it doesn't work? What if I have \nthe operation - with all it's risks - \nand you remove the cataract - and it doesn't work.\n\n\nAaron looks to Amy. \n\nAARON \n(somber) \nIt would be evident that you will \nnever be able to see.\n\n\nVirgil's head shifts slightly. Not what he wanted to hear. Amy \nreaches out takes his hand. \n\nAMY \nWhat do you think?\n\n\nVIRGIL \nThat's what I need - to think.\n\n\nEXT. AMY'S LOFT - SOHO - DAY \n\nVirgil and Amy stepping out of a cab. Virgil using his cane - seems \nblinder than we've seen him before. The city sounds an assault on \nhim. \n\nAMY \nThis is my place - there's a park \nacross the street and...\n\n\nShe stops - realizes he wants to walk in silence. They enter her \nloft building, an old converted industrial space. \n\nINT. LOFT STAIRWELL - DAY \n\nThere is an odd, loud sound which echoes three times after every \nbounce. As they come up on the second floor landing, a basketball \ncomes flying down the hall which Amy fumbles with - then catches. \n\nAMY \nEthan!\n\n\nFrom around the corner comes ETHAN COLVIN, eight, oversized Knicks \nshirt. Amy tosses him his ball. \n\nETHAN \nSorry - my mom won't let me go \noutside till she gets home from work.\n\n\nAMY\nWell, if the super catches you playing\nball in the hall, he'll have a coronary.\n\n\nETHAN \nA what?\n\n\nAMY \nNever mind. Ethan, \nthis is my friend Virgil.\n\n\nVIRGIL \nHey, Ethan\n\n\nETHAN \n(seeing his cane) \nAre you blind?\n\n\nVIRGIL \nYeah.\n\n\nETHAN \nCool. See ya.\n\n\nAnd he turns and runs back up the stairs. \n\nAMY \n(apologetic) \nVirgil...\n\n\nVIRGIL \nHey, the kid thinks I'm cool \n- what's so bad.\n\n\nINT. AMY'S LOFT - LATE DAY \n\nAmy's loft is a wide open space - a KITCHEN facing onto a small \nliving area - a BED in the corner of the room - a WORK SPACE with \nDRAFTING BOARD and DRAWING RACKS fill one side of the room. By a \nwindow stands a plaster SCULPTURE stuck in the corner as if \nforgotten. \n\nAMY \nThis is where I hang my hat \n- it's a bit of a mess but...\n\n\nAmy stops, realizes he can't see it. Virgil puts his overnight bag \ndown. \n\nVIRGIL \nNow, Blind 101. Help me out with a mental map. \nWalk me down a straight line and show me your \nplace, all the obstacles. Remember once you've \ntold me, they can't be moved - otherwise...\n\n\nAMY\nGot it - here take my arm. \n(they start about the room) \nCouch, chair, TV to the left, \nlow table at.. .at 4 o'clock, \nhas the phone on it...\n\n\nThey come to the Sculpture, Virgil's hand grazes across it. \n\nVIRGIL \nWhat's this?\n\n\nAMY \nNothing. A sculpture.\n\n\nVIRGIL \nIt's yours?\n\n\nAMY \nMy art school days - not very good.\n\n\nVirgil continues to feel the sculpture from top to bottom, not \nstopping during the dialogue. \n\nVIRGIL \nIt's a mother? - holding her child - up in the air \n- like she's proud? It's beautiful.\n\n\nAMY\nIt's not done yet - \none day I'll finish it.\n\n\nVirgil turns - his hand to the wall - feels a window: \n\nVIRGIL \nDoes this window open? \nI could use some air.\n\n\nAMY \n(moving to the windows) \nI think so.\n\n\nAs Amy throws open the window, a wind blasts through - catching a \nstack of plans on her drafting table - blowing them across the \nfloor. \n\nAMY \nDamn!\n\n\nVirgil turns, concerned, makes his way to her. \n\nVIRGIL \nWhat happened?\n\n\nAMY \nThe wind - knocked over my plans.\n\n\nAmy down on the floor picking them up - Virgil senses her down there \n- crouches down beside her - tries to help her pick up. \n\nVIRGIL \nWhat is this - these plans?\n\n\nAmy looks at Virgil - - his hand running across one of her plans. \n\nAMY \nJust my work - - some plans for the Atlanta \nproject we're bidding on - drawings of a lobby \nwe're finishing up, some other smaller stuff. \nIt's -- it's what I do.\n\n\nAmy realizes they mean nothing to him - he hands them back - stands. \nShe watches him - then standing, moves to him. \n\nAMY \nI've got to get to work. Tonight we'll do something \n- we could listen to music or go out for dinner...\n\n\nVIRGIL \nHow about a movie?\n\n\nAMY \nA movie?\n\n\nVIRGIL \nYeah. I haven't been in years.\n\n\nAMY\nAlright. A movie. I won't be long.\n\n\nAnd Amy gives him a quick kiss and dodges for the door - a beat - \nshe forgets her purse - steps back in to see: \n\nVirgil standing there quietly - his hand out on her plans again - \nfeeling the paper - searching for the design - wanting to know her - \nwanting to understand her - finding nothing there. \n\nAmy feels uncomfortable - quietly steps out - closes the door. \n\nINT. REVIVAL THEATER - NIGHT \n\nWIDE - the theater half full playing Woody Allen's \"Annie Hall\" the \nvery funny scene where Woody and Diane Keaton wrestle with the \nlobster. \n\nWe move in slowly and discover Virgil and Amy leaning in close to \neach other - Amy quietly describing the scene to him. \n\nAMY \nThere's these big pots and Woody's got \na huge lobster in his hand...\n\n\nVIRGIL \nLobster - what's a lobster?\n\n\nAMY \n(trying not to use her hands to describe) \nIt's a.. .kind of like.. it's got...\n\n\nThen she looks to Virgil - sees he was kidding her. \n\nAMY \n(laughing) \nThat's it - you're on your own.\n\n\nOff Virgil's laugh: \n\nINT. SUBWAY LINE - NIGHT \n\nBWAM - a subway train explodes past us. \nINT. SUBWAY CAR - NIGHT \n\nA collection of typical night riders - everyone keeping to \nthemselves. Two kids sit in the corner - blasting their boom box \nVirgil stands in the middle of the train - enjoying the vibrations. \nAmy sits on a seat watching him. \n\nVIRGIL \nAnd they lived happily ever after.\n\n\nAMY \nWoody and Diane...\n\n\nVIRGIL \nAnd the lobster?\nAMY \nStop with the lobster. \n\nA song comes on the radio - Virgil's head turns. \n\nVIRGIL \nHey - you here that?\n\n\nAll she hears is the clatter of the subway. \n\nAMY \nWhat?\n\n\nVirgil turns towards the music - BAPPING his hands rhythmically on \nthe subway car wall. \n\nVIRGIL \nHey - can you turn that up?\n\n\nThe KID shrugs - CRAKKS it up. It's Gershwin's \"Can't take that Away \nfrom Me.\" Virgil turns to Amy - picks up on the song - hands RAPPING \n- he starts singing: \n\nVIRGIL \n\"The way you comb your hair, \nThe way you sip your tea...\"\n\n\nHe finds Amy, pulls her up and into an embrace as he saunters them \ndown the aisle. \n\nAMY \nVirgil?!\n\n\nVIRGIL \n(loudly) \n\"Can't take that away from meee\" - what?\n\n\nAMY \nPeople are watching.\n\n\nVIRGIL \nWatching? Watching what?\n\n\nAMY\nYou. Me. Everyone is staring at us.\n\n\nVIRGIL \nAnd?\n\n\nAMY \nWell - it can be embarrassing.\n\n\nVIRGIL \n(kidding) \nOh - I see.\n\n\nAMY \nNo - you don't.\n\n\nVIRGIL Touche. \n\"The way you make me see...\"\n\n\nAMY\n(turns to him) \nWhat do you mean?! \n(Virgil gives her a look - \nI want the operation) \nYou mean it. I mean I only want \nyou to have the operation...\n\n\nVIRGIL \nAmy. I want the chance to see. \nThe chance to see Central Park, \nthe Brooklyn Bridge, apples, raisins,\na buffalo, a carbuerator and the man \nin the moon. \n(beat) \nBut I would give all that up - \njust to see this face.\n\n\nAnd Amy folds herself into Virgil - a moment - they hold each other \n- then - Amy starts to sing along with the song - Virgil joining in \n- and they dance - together - in love. \n\nSMASH CUT TO: \n\nEXT. SUBWAY CAR - NIGHT \n\nAMY/VIRGIL (V.0.) \n\"You can't take that away from me.\"\n\n\nAnd the car explodes past again - and as the music dies we cut to: \n\nINT. NEW YORK EYE HOSPITAL - OPERATING ROOM \n\nCLOSE ON: a platter of silver utensils - fine, exacting scalpels. A \ngloved HAND comes into frame - picks up a clamp - and we follow it \nto: \n\nVIRGIL'S EYES - the clamp being used to hold it open. The work we \nare seeing is grueling - difficult to watch - but at the same time \nso fascinating it is hard to take our eyes off. \n\nDr. Aaron followed by Dr. Goldman - hands in the air - mask on - \nleans over Virgil - looks to the ANESTHESIOLOGIST who nods - then to \nno one in particular. \n\nAARON \nOK Virgil - let's get to it.\n\n\nAnd as he is handed a SCALPEL, we watch as it moves down to cut open \nthe white section of the eye - and just as it feels almost \nunbearable to watch- - \n\nINT. NEW YORK EYE HOSPITAL - WAITING ROOM - DAY \n\nWe see Amy, coffee cup in hand, grab a second just poured cup out of \na vending machine. She makes her way over to reveal Jennie who sits \nquietly reading a book. \n\nAMY \nCoffee? It's really bad. \n\nJennie looks up - smiles takes the cup. Amy sits down next to her. \nThey both sip for a moment. \n\nAMY \nVirgil never mentions his parents \n- do they know? \n\nJENNIE \nOur mother died when I was 20 - Virgil wasn't\neven a teenager. And our father - he's been \ngone for quite awhile. \n\nAMY \nI'm sorry. I didn't know. \n\nJennie looks into her coffee - takes another sip. \n\nJENNIE \n(smile) \nYou're right this is bad.\n\n\nAMY \nIt must have been very tough on you \n- taking care of Virgil alone after \nyour mother died.\n\n\nJENNIE \nHe's my brother.\n\n\nSimple. \n\nAMY \nYou don't like Virgil \ndoing this - do you?\n\n\nJENNIE \nI don't like Virgil getting hurt. \nHope is like fire, it can keep you \nwarm - - or it can burn you.\n\n\nINT. NEW YORK EYE HOSPITAL - OPERATING ROOM - DAY \n\nDr. Aaron: - focused on his exacting work. His hands move deftly. \n\nCLOSE ON: Virgil's eye. Cut open. Aaron's probe working right in the \nmiddle of it. \n\nDR. AARON \nThere you are.\n\n\nAnd Aaron pulls out the cloudy cataract tissue - holding it up for \nall to see - before he PLOPS it on a tray. Switching instruments - \nhe gingerly picks up a plastic implant - moving back towards the eye \n- he glances at the nurse assisting him: \n\nDR. AARON \nYou know what they say, Virgil? \nThe eyes are the windows to the soul.\n\n\nVirgil can't move - listens intently as he carefully places the \nimplant into Virgil's eye. \n\nDR. AARON \n(with a wink) \nThat makes us the Windex to the soul. \n(he focuses) \nOK, both eyes done. Let's patch him up.\n\n\nOn a large monitor we see an EXTREME CLOSE-UP of Virgil's eye - \nwaiting. \n\nINT. NEW YORK HOSPITAL - LATER \n\nVirgil being wheeled down a hall - head wrapped in bandages. \n\nINT. EXAMINATION ROOM - DAY \n\nAs he enters: \n\nVIRGIL \nHello?\n\n\nJennie's there - takes his hand. \n\nVIRGIL \nJennie?\n\n\nJENNIE\nHow're you feeling?\n\n\nVIRGIL\nOK - a little pain, \nlike a tequila hang over\n- is Amy here?\n\n\nAMY \nRight here - Dr. Aaron said you did great\n\n\nVIRGIL \nSo how's my hair - I'd hate the first time \nI see myself to be a bad hair day. \n(Virgil reacts to a sound) \nWhat's that?\nAMY \nThere's camera guys here too.\n\n\nWIDE - we now see the room has a small VIDEO CREW in it preparing to \ndocument the event. \n\nVIRGIL \nCamera guys?\n\n\nAARON \n(entering) \nFor posterity. We're going to make you\nfamous. We're also sending this closed \ncircuit to one of our conference rooms \n- there's a lot of people interested in \nour results today. So how you feel Virgil?\n\n\nVIRGIL \nGood. Great. Fine. \n(a laugh) \nNervous.\n\n\nAaron moves about the room closing blinds to let in just a few slats \nof light. \nAARON \nNothing to be nervous about. \nNow Jennie and Amy, if you would \nstand off to my right -- I want \nVirgil to get just a slight bounce \nof light.\n(returning to Virgil) \nReady Virgil.\n\n\nVIRGIL \nLet's go.\n\n\nBoth Amy and Jennie subconsciously adjust their hair as Aaron starts \nto unravel the bandages. \n\nWhen the bandages are completely off - all that is left are two \ngauze patches on both eyes. \n\nAARON \nOkay - last phase - \nwe remove these patches and...\n\n\nVIRGIL\n(suddenly apprehensive, hand up) \nOkay - wait. So - so - what do I do? \nI mean, what will I see first?\n\n\nAARON\nWell - we're all here - Amy, \nyour sister. This is new for \nus all. Why don't we find out?\n\n\nAaron reaches up and plucks the two patches from his eyes - and \neveryone waits. \n\nVirgil slowly opens his eyes - he just seems to be staring blankly, \nbewildered - not focusing at Aaron who stands before him, still \nholding the bandages. \n\nAmy looks to Jennie - to Aaron - what's happening? Then finally: \n\nAARON \nWell?\n\n\nAnd Virgil reacts - a startling look of recognition mixed with fear \ncrossing his face. \n\nAMY \nWhat is it Virgil?\n\n\nVIRGIL \nIt's - it's - I don't know.\n\n\nAnd now for the first time we see Virgil's POV: \n\nThere is light, movement, color, shadow - but somehow it is foreign \nto us. There is no perception of depth -. no sense of definition of \nshape or shadow - it is as confounding to us as it is to Virgil - \nlike an explosion of Picasso, Dali and Monet on screen. \n\nSuddenly in the midst of this chaos of images - there is movement - \nand a voice emits out of what we now for the first time recognize as \na mouth. Dr. Aaron speaks again - leaning in to Virgil, who reacts \nback. \n\nAARON \nVirgil - what do you see?\n\n\nVIRGIL \nSomething's wrong.\n\n\nJennie's reaction comes pouring out of her eyes in tears, first \nslowly, then a dam break. \n\nAMY \nVirgil what's wrong?\nWhat's happening?\n\n\nAARON \nEverything's fine - \nit's going to take...\n\n\nJENNIE\nIt's not fine - \ndon't say it's fine.\n\n\nAARON \nTell me what you're seeing Virgil.\n\n\nVirgil suddenly pulling back - his eyes dancing around in his head - \ntrying to take it all in - trying to focus. \n\nVIRGIL \n(over everyone) \nI don't know - it's all screwed up - \nthis can't be seeing - something's wrong\n- too confusing - what the hell's happening??!\n\n\nHIS POV - the camera crew coming toward him for a closer shot - it's \nlike a giant monster violently moving towards us! \n\nVIRGIL \nWhat is it - Stop!\n\n\nVirgil's hand lashes out towards the camera crew - even though they \nare 15 feet away. \n\nAARON \nWhat? The camera?\n\n\nJENNIE \n(to the crew) \nStop moving!\n\n\nAMY\nVirgil, it's just the camera.\n\n\nThe room has heightened into chaos - Virgil reacting to everything \nhe sees, any quick movement - Amy moves next to him - Aaron trying \nto remain calm - Jennie assuring Virgil everything's OK. \n\nAARON \nAlright - alright - they've stopped. \nOK. Let's everybody just calm down \n- we'll take it slowly.\n\n\nEveryone settles - takes a breath. \n\nAMY \nVirgil. What can we do?\n\n\nThey all look to Virgil - breathing heavy - his eyes swinging back \nand forth. \n\nVIRGIL \nI gotta focus - gotta think - \ngimme a second - OK, OK - get me a \ncoke. Somebody?\n\n\nJENNIE\nHe's thirsty - someone get him a drink!!\n\n\nVIRGIL\nNo - just a can - a bottle -- \nput something in my hands!\n\n\nAmy reaches over - grabs an empty coke can. \n\nAMY \nHere - how's this?\n\n\nVirgil takes it in his hands - closes his eyes - feels it. Then \nslowly opens his eyes - trying to focus on what is in his hand - \nAaron catching on. \n\nAARON \nGood, Virgil - that's it - use your touch - \nassociate - now, tell me - what do you see \nin your hand?\n\n\nLong moment. Virgil holds it up - stares hard. \n\nVIRGIL \nA can. Is it a can?\n\n\nJENNIE \nWhat's going on?\n\n\nThey all look at Virgil turning the can over and over in his hand - \nstaring intently at it - learning it. \n\nAARON \n(beams) \nHe's associating - one sense to the other. \nHis fingers tell his brain - then his brain \ntells his eyes and he recognizes the image \nin front of him. \n(realizing) \nHe's seeing!\n\n\nAaron looks to Amy and Jennie - they're still doubtful - he motions \nto them to meet him outside. \n\nAARON \nVirgil - let's rest your eyes for today and \nwe'll check them again tomorrow. We should\nall be happy - we've got something.\n\n\nVirgil: not happy, just very confused. As Aaron leaves, Jennie takes \nVirgil's hand while Amy stands there upset - watching him just \nstaring at a Soda Can. \n\nINT. NEW YORK EYE HOSPITAL - DAY \n\nIn the corridor, Dr. Aaron shaking hands with Dr. Goldman - people \nexiting the near-by conference room all congratulating the two \ndoctors. As Amy exits the room - Aaron moves to her. \n\nAMY\nWhat just happened in there?\n\n\nAARON \nYou saw it. Success.\n\n\nAMY \nSuccess - wait a minute - then why can't \nhe see me, his sister, anything.\n\n\nAARON\nHe sees you. He just doesn't \nunderstand that he sees you.\n\n\nAMY \nBut he'll overcome it - I mean - \nthis is temporary right?\n\n\nAARON \nThere's a very real possibility the \npart of his brain area allocated to \nvision is atrophied - given it's lack \nof use, Virgil has probably used it \nfor some other function.\n\n\nJennie has stepped into the waiting area - has just heard Aaron. \n\nJENNIE\nYou didn't think of this?\n\n\nThis is as much an accusation of Amy as of Aaron. \n\nAARON \nWe had no way of knowing what his faculties \nwere until we gave him the operation. If you \nremember - we didn't know what to expect \n- though it's clear his retinal disease must \nbe in remission.\n\n\nAMY\nSo what are we supposed to do now - \nyou saw him - it's like he's another \nperson in there.\n\n\nAARON\nHe won't need to stay here - take him home \n- let him rest. But I will need to see him \nevery couple of days for the next month. \n\n\nAMY \nIsn't there some kind of therapy \nhe should be doing - someone to help him.\n\n\nAaron stares at her - hadn't thought of this. \nAARON\nOK, there is a visual therapist - Ray Webster \n- a little unorthodox - that's why he's probably \nyour best bet, especially considering the unique \naspects of Virgil's condition. I'll contact \nhim for you - but there's no guarantee he can help.\n\n\nJENNIE \n(can't believe this) \nNo guarantees.\nAARON\nJennie, I told Amy here when we first talked - this is whole \nnew ground - for all of us.\n\n\nAnd Jennie quietly turns and goes back into Virgil's room. Amy just \nstares at Dr. Aaron - a little overwhelmed. \n\nINT. HOSPITAL ROOM - CHANGE AREA - DAY \n\nVirgil - starting to dress. He stares at his clothes on a hangar - \nnot comprehending what it is. He closes his eyes - his hand going \nout to feel it - then opening his eyes - he takes the shirt turns - \nand notices someone watching him. \n\nVIRGIL \nHello?\n\n\nHIS POV - it's his own reflection in a mirror next to his clothes. \nVirgil stares at himself standing stock still - waiting for a \nresponse from the person staring at him. \nVIRGIL\nIs there...?\n\n\nSlowly realizing that what he sees is himself. He starts moving \ntowards the mirror fascinated. \n\nVirgil's POV - Focusing on the image as it slowly takes shape - \nbecomes clearer to him. His hand going up to his nose - moving it \nback and forth - laughs at it's absurdity - then is taken with his \nown smile. He tries a smile - comes off awkward as he starts to \nstare at his teeth. Touching each part of his face he investigates \nhis chin, ears and finally his hair. \n\nThen he stops - and just stares - and stares at a face that is his \nown - but so incredibly foreign to him. Who is this person? \n\nINT. VIRGIL'S ROOM - DAY \n\nJenny starting to pack up Virgil's things. Suddenly there is a burst \nof laughter from the other room. She looks up quizzically \n\nINT. HOSPITAL CHECK-OUT - DAY \n\nAmy in the check-in area - pacing - on a cellphone. \n\nAMY \nDuncan - I know the additions to the mall will \ncost more.. look, I can't do this on the phone \n- I'll be in tomorrow.. yes, I remembered they're \nputting the fixtures in the lobby - I'll get \nthere as well - I'm just asking for one more day.\n\n\nINT. WAITING AREA - DAY \n\nJenny - finishing packing up Virgil's things. \n\nVIRGIL (V.O.)\nAmy?\n\n\nJenny looks up - Virgil standing in the doorway, dressed. \n\nJENNIE \nNo - it's Jennie.\n\n\nShe moves toward him - Virgil pulls back - hands out in front of \nhim. \n\nJENNIE \nI'm sorry - I'll move slower - I just...\n\n\nAnd Virgil's hands are on her face - eyes closed - feeling. He opens \nhis eyes - staring blankly - trying to figure this out. \n\nVIRGIL \nThis is you.\n\n\nJENNIE \nThis is me.\n\n\nINT. HOSPITAL HALLWAY - DAY \n\nAngle on Amy moving down the hall - hearing the voices. \n\nINT. HOSPITAL ROOM - DAY \n\nJENNIE \nEverything's going to be alright \n- we just need to get you home.\n\n\nVIRGIL \nNo, no - I can't go home. \nI need to be here - see the therapist\n- doctor's. I want to be here.\n\n\nJENNIE\nBut I can't stay here - and you can't \ndo this alone--who's going to take care.. .?\n\n\nShe stops. Realizing. \n\nANGLE On Amy - outside the door - not wanting to go in. \n\nJENNIE \nAmy? She's going to look after you? \nShe doesn't know anything about the blind.\n\n\nVIRGIL\nI'm not blind anymore - and I'm not \ngoing to let someone I care about \nwalk out of my life again.\n\n\nJENNIE\n(moves to him) \nIt's not your fault he left. \nYou can't keep blaming yourself.\n\n\nVIRGIL \n(beat) \nI'm staying here.\n\n\nA pause - and Jennie moves her hand out to him - touches his arm. \n\nINT. HALLWAY - DAY \n\nAmy feeling uncomfortable - starts to step away. \n\nJENNIE (O.S.)\nAmy?\n\n\nAmy turns - Jennie in the doorway. \n\nJENNIE \nVirgil's finishing getting ready. \nCould you walk me to my car?\n\n\nAmy nods - sees an element of defeat in Jennie's eyes. \n\nEXT. HOSPITAL - LATE DAY \n\nJennie and Amy stand on the curb near Jennie's car. A moment of \nuncomfortableness - then: \n\nAMY \nYou alright? \n\nJENNIE \nI'm scared to death. I've spent my whole life \nlooking for any holes he might fall in. \nI'd run up ahead and cover them. Everywhere\nI look here, I see holes.\n\n\nAMY \nPlease believe me - I don't want him \nto get hurt anymore than you do.\n\n\nJENNIE \nAmy - when Virgil was very young, he couldn't \nsee those close to him - so he never learned \nto reach out. \n(turns to her) \nDon't expect him to reach out when he's in pain,\nor confused, or unhappy. If you really care \nabout him you have to just be there for him.\n\n\nAnd before Amy can answer, she gets into her car - starts it up and \ndrives off. \n\nEXT/INT AMY'S.LOFT - DUSK \n\nVirgil slowly gets out of the cab, looks up at the buildings - \nimmediately gets dizzy and nearly falls over. Amy lunges to help \nhim. Virgil is laughing in spite of himself. \n\nVIRGIL \nThis is just great - I don't believe this. \nWhat's that saying - stop the world I wanna get off.\n\n\nETHAN (O.S.) \nHey Virgil, it's Ethan.\n\n\nVirgil turns to the familiar voice. Ethan, basketball under his arm, \ncoming out of the building with his Mom, KAREN COLVIN. Virgil scans, \ntries to focus on them. \n\nVIRGIL \nThat you Ethan?\n\n\nETHAN \nIt's me - and this is my mom.\n\n\nAMY \nVirgil - Karen.\n\n\nKAREN \nHi, Virgil - heard a lot about you.\n\n\nETHAN \nYou look funny.\n\n\nVIRGIL \nYou should see how I look from this side.\n\n\nAMY Let's just get you inside - \nthen you can rest. \nWe'll see you later Ethan. Karen.\n\n\nAnd she gives Karen a small glance as she takes Virgil's arm as they \nstart towards the stairs leading into the building - Virgil suddenly \nslamming to a halt. \n\nVIRGIL \nWait, wait, what are we doing \n- WE'RE WALKING INTO A WALL!!\n\n\nVirgil's POV - the staircase. A flat image - a solid wall with \nhorizontal lines. Ethan, surprised, what's up here? \n\nAMY \nIt's OK - it's not a wall - \nit's just a staircase. You're \ngoing to have to trust me on \nthese things.\n\n\nVIRGIL\nGod, I feel like... like such a child - \nI just thought seeing would be different.\n\n\nAMY \nWe'll get a hold of this Ray Webster guy\n- we'll get his help.\n\n\nVirgil steps slowly forward - giant baby steps - each foot reaching \nout to feel the step before making the commitment. \n\nHIS POV - the 'wall' of stairs changing perspective with each step. \nLike an accordion spreading itself out to us. This is all a very bad \nacid trip. \n\nINT. AMY'S APARTMENT - DUSK \n\nVIRGIL'S POV - multi-colored balloons, dozens of assorted flowers, \nbowls of colorful fruit and streamers intertwined across the room. A \ncandyland of seeing. \n\nVIRGIL \nMan. Something exploded \nin your apartment.\n\n\nAmy laughs - pulls him into the room. Virgil trying to take it all \nin - not understanding anything. \n\nAMY \nI wanted to do something \nspecial for you.\n\n\nVIRGIL \nIt's making me a little \nbit dizzy - but it is special.\n\n\nVirgil's hands go out - Amy moves to him - he holds her shoulders. \nHe stares at her. \n\nAs she turns her head slightly, Virgil is able to focus on her - her \neyes - her smile. \n\nVIRGIL \nOkay - so - this is what \nbeautiful looks like.\n\n\nAMY \nThank-you. You want to\nsee the rest.\nFocusing on her, Virgil smiles, takes her face in his hands - leans \nin and kisses her. She pulls back a little. \nAMY \nI can't believe this \n- how nervous I am.\n\n\nShe kisses him then takes a step back. \n\nAMY \nWhat if you don't like what you see?\n\n\nVIRGIL \nDo you want me to turn off the lights?\n\n\nAMY\nNo - no. This is your first seeing day. \n(she starts to unbutton her dress) \nI want you to see everything.\n\n\nAnd she drops the dress from her shoulders - it hits the ground - a \nbeat - and she stands there naked. \n\nAMY \nOK?\n\n\nVIRGIL \nYes, very OK.\n\n\nAnd she takes a step towards him and folds into his arms and as they \nkiss we slowly fade to black. \n\nINT. AMY'S LOFT - NIGHT \n\nThe sound of heavy New York rain. Amy awakening, and sees Virgil is \ngone, his side of the bed empty. She looks across the room - where \nshe sees silhouetted against the moonlit window - - Virgil standing \nnext to Amy's sculpture, his face and body pressed up against the \npane of glass. \n\nAMY \n(wrapping a house coat around her) \nVirgil?\n\n\nVirgil turns around - half faces her - the rain on the windows \ndecorating his face. \n\nVIRGIL \nI can't sleep - I'm afraid if I close my eyes...\n\n\nAMY \nIt'll be black when you open them again.\n\n\nVirgil nods. A moment and his hand goes out to her sculpture. \n\nVIRGIL \nYou enjoy sculpting?\n\n\nAMY \nAt first. I liked the idea of molding - \ntaking the way I saw things up here- - \n(touching her head) \n- and making it take shape with my hands.\n\n\nVIRGIL \nBut you never finish them.\n\n\nAMY \nPieces never come out the way I wanted \n- the way I saw them. I end up working \non them forever - like this one - \nnever getting them right.\n\n\nVirgil stares out the window at the rain. \n\nVIRGIL \nThis is what rain looks like?\n\n\nAMY \nYeah.\n\n\nVIRGIL \nIt looks lonely. Not what I expected. \nBut I like it.\n\n\nAmy smiles - moves into him as he pulls her in close and they look \nout at the night rain. \n\nINT. ROSWELL-TREMONT - DAY \n\nAmy working over a CAD computer with & draftsman. \n\nAMY \nYou've got to alter each of \nthe windows by five feet...\n\n\nDRAFTSMAN \nThese are the specs you gave me.\n\n\nAMY \nI know - I'm changing them - \nthis is better. \n(calling out) \nBetsy!\n\n\nBetsy pokes her head in. \n\nAMY \nCan you get me some research on \nthose Maple trees we're leaving in. \nThey're too big - I want to change \nthem so they fit in with the design \nbetter. Get rid of the dead weight.\n\n\nBETSY \nDon't you have an appointment?\n\n\nAmy looks to her watch. Starts for her jacket and the door. \n\nAMY \nYes, yes. Thank-you. \nEvan here will print out the new specs \n- give them to Duncan - tell him I'll\nbe back in two hours.\n\n\nDUNCAN (O.S.) \nAmy?\n\n\nDuncan steps out of his office. She turns - virtually out the door. \n\nAMY \nJust give me two hours.\n\n\nAnd she's gone. \n\nEXT. NYU CAMPUS - NEXT DAY \n\nA few KIDS smoking on the steps. Others entering, laden down with \nbooks - a small sea parting to allow Amy helping Virgil up the steps \nand inside. \n\nINT. NYU HALLWAY - DAY \n\nThey make their way down the hall - past a - room where a group of \nBLIND CHILDREN learn to read Braille. Amy can't help but stare at \nthese young faces struggling to learn. It's a whole different world. \n\nINT. RAY WEBSTER'S OFFICE - DAY \n\nA strange space, dark, as all the windows are covered. In a jar on \nthe desk - two pickled eyeballs stare back at Virgil and Amy waiting \npatiently. There are books everywhere - periodicals stacked and \noverflowing on shelves. A dead plant in the corner. \n\nRAY WEBSTER - 60's, almost completely bald, wearing a worn NYU \nsweatshirt, sits at the desk in front of them - flipping through a \nfile in front of him. \n\nWEBSTER \nRight - OK, Virgil - says here you went \nblind at one - before you developed a \nvisual vocabulary. \n(Webster stands - moves towards a bookshelf) \nYou have no sense of depth of field, \nno knowledge of space, shape, size or \ndistance. Basically your eyes work but \nyour brain hasn't learned to process \nthe information. \n(beat) \nYou are mentallv blind. Neurologists \ncall this \"visual agnosia\".\n\n\nVIRGIL \nI call it pretty screwed up.\n\n\nWEBSTER \nBetter term. I'll make a note of that.\n\n\nWebster plops down a large book - flips through some pages, then \nsearching his pockets: \n\nWEBSTER \nDammit\n\n\nAMY \nWhat?\n\n\nWEBSTER \nGlasses, can never find 'em. \n(calling out) \nMrs. Fenster.\n\n\nMrs. Fenster pops her head in the door - this must be a ritual they \nhave as she instantly pulls her GLASSES off and hands them to \nWebster who drops them over his nose. They are clearly woman's \nglasses - pointed in the ends - little jewels. As Mrs. Fenster \nleaves. \n\nWEBSTER \n(referring to the book) \nOK. Alberto Valvo \"Sight Restoration after \nLong Term Blindness\" - blah-blah-blah. -\nah here... \n(reading) \n\"One must die as a blind person to be born\nagain as a sighted person. However it is \nthe interim, the limbo- -between two worlds,\none dead/the other powerless to be born - \nthat is so terrible.\" \n(slamming the book shut) \nThere. You're in limbo.\n\n\nAMY \nWhat do you mean - there - he's in limbo.\nThat's all you have to offer?\n\n\nWEBSTER\nWhat? - I'm Anne Bancroft all of a sudden? \nI'm a professor - I teach people, how to \nteach the blind how to become independent. \n(beat) \nThere's no book on what you're going through\n- I'd like to help - but like the rest of \nthings in life - it's up to you.\n\n\nVIRGIL\nWait a minute - up to me? \nI thought you were going to help me here.\n\n\nWebster rummages in his desk - pulls out a magazine photo - then \ndigging in a brown paper bag - he pulls out an apple. \n\nWEBSTER \nYou want a lesson? Right - here. \nWhat's this?\n\n\nHe holds out the apple for Virgil - who reluctantly takes it - holds \nit in his hand, eyes closed, feels it - then opening his eyes he \nholds it out in front of him, trying to focus on it. \n\nHIS POV - as the apple slowly takes on dimension and shape. \n\nVIRGIL \nIt's an apple.\n\n\nWEBSTER \nGood. Good. \n(holding up the photo) \nOK. What's this now?\n\n\nVirgil stares at the photo. HIS POV - a photo of -- an APPLE. Not \nthat different from the real apple he holds in his hand - he holds \nthe real apple up to compare - using his eyes. \n\nVIRGIL \nIt's an apple.\n\n\nWEBSTER \n(holding the paper out to Virgil) \nGood. Good. But is it an apple or \njust a picture of an apple?\n\n\nAnd Virgil feels the paper and suddenly realizes - it's not an apple \n- just a representation of one. Virgil is visibly disappointed. \n\nVIRGIL \nSo this is a joke? Is that what you're\nsaying - your eyes lie to you? Great \n- looking forward to this.\n\n\nWEBSTER \nYour eyesight can and will play tricks on \nyou Virgil. Remember that. No matter what\nI could teach you - no matter what exercises \nI could give you - they'll still play tricks on you.\n\n\nVIRGIL\nThat's all it is right now - one big trick. \nNothing makes any sense. I can't function like this.\n\n\nWEBSTER\n(he moves to his chair) \nVirgil - look - you have to learn to see - \njust like you learned to speak. Only this \nis not like learning a new language - \nit's like learning language for the first time. \n(he leans forward) \nPerception - sight - life, is about experience \n- about reaching out and exploring the world \nfor yourself. It's not enough to just see Virgil -- \n(he points two fingers into his eyes) \n-- we've got to look as well.\n\n\nAnd Webster turns the fingers from his eyes outward - to the world. \n\nAMY \n(wound up) \nWell, thank-you Obi Wan Kenobi - \nbut that doesn't tell us anything. \nWhat we need is some assistance here \n- some kind of program - a set of exercises \n- we're kind of adrift and...\n\n\nWEBSTER \nAmy - last I checked - this isn't a game \nof Parcheesi, it doesn't come with a set of rules.\n\n\nAMY \nI can't believe you're just...\n\n\nVIRGIL\nAmy. Let's go.\n\n\nAMY \nNo, wait, Virgil...\n\n\nVIRGIL \nLet's go. \n(standing) \nThank-you Dr. Webster.\n\n\nWEBSTER \nYou want me - I'm always here.\n\n\nAnd Virgil turns and half steps - half shuffles towards the door. We \nhold on Amy's befuddled face - then: \n\nEXT. NYU - DAY \n\nVirgil feels his way down the steps - Amy rushing out after him. \n\nAMY \nI'm going to call Aaron - \nget him to recommend someone else.\n\n\nVIRGIL \nHe's right, Amy. I've got to do this \non my own. No one taught you how to see.\n\n\nVirgil starts walking stiffly towards the street. Amy hurries after \nhim - grabs him just as he was about to step into traffic. \n\nAMY \nI was a baby then - I had years to learn - \nyou don't - you need to...\n(anxious)\n --we don't even know what to do \n- where to start..\n\n\nVirgil's hand goes out - brushes a mailbox. \n\nVIRGIL \nWhat's this - this thing?\n\n\nAmy looks over. \n\nAMY \n(shrugs) \nWhat - it's a mailbox.\n\n\nVIRGIL \nWhat color is it?\n\n\nAMY\nBlue.\n\n\nVirgil stares at it - tries to take it in. \n\nVIRGIL\nBlue. OK, good - that's a mailbox\n- it's blue. There - we've started.\n\n\nShe says nothing. Virgil senses her apprehension. \n\nAMY Let's just get a cab, get you home \n- and tonight we can work on it.\n(hand out) \nCab!\n\n\nA cab veers across traffic - pulls up to them. \n\nVIRGIL \nI want to walk. I want to see what's out there.\n\n\nAMY\nFine. Let's walk.\n\n\nVIRGIL \nDon't you have a job?\n\n\nAMY \nI'm going to make time for this. I promise.\n\n\nVIRGIL \nGo to work. If I need you - \nI have your number.\n\n\nA beat, she looks to Virgil then climbs into the cab and it pulls \naway. \n\nVirgil looks left, right - trying to decide where to start his \njourney when we see the cab back up in front of him and Amy climbs \nout. \n\nAMY \nScrew work - let's go try those eyes.\n\n\nINT. LECTURE RALL - DAY \n\nAaron at a podium. The room filled with colleagues. A NEWSCREW \nrecords the lecture from the back of the hall. \n\nAARON \nNow just two weeks after surgery--the patient is \nstill having difficulty understanding images,\nshapes, contours - \n\nEXT. NY CITY STREET - NEW DAY \n\nVirgil - determined to see - making his way down a street - trying \nto dodge people coming at him from all angles. Amy walks a short \ndistance behind him - coaxing him along. \n\nHIS POV - people seem to explode out of two dimensions into three. \nThis is clearly exhausting. \n\nAARON (CONT'D)\n- and his progress with depth of field has been especially slow...\n\n\nWHAM - Virgil collides with a kid on a skateboard - Amy winces as he \nquickly regains his balance - shakes it off - starts his journey \nagain - determined. \n\nEXT. BROADWAY - STREET VNNDORS - DAY \n\nAmy trying to help Virgil take in the confusion of images - \nexplaining to him items hanging about the stalls. It's clear he's a \nlittle overwhelmed - when something familiar catches his eye. He \nmoves toward it: \n\nHIS POV - focusing - trying to give it shape - it's a YELLOW CAB - \njust like the one Amy drove off in - again he focuses - reaches out \n- surprisingly wrapping his hand around the car. \n\nAARON (CONT'D)\nVirgil is still very reliant on his touch \nto interpret objects in his surroundings -\n\n\nHe then realizes it's a porcelain toy from a souvenir shop. Amy \nwatches him examine it like a child as we hear: \n\nEXT. STREET CORNER - DAY \n\nAARON (CONT'D)\n- and his understanding of three dimensionality \nis extremely limited and confounding to him...\n\n\nVirgil - his hands all over a small long haired TERRIER. He looks to \nAmy as he stands. \n\nVIRGIL \nIt's a dog.\n\n\nAmy on her cellphone - trying to get work done - nods - yes that's a \ndog. Virgil looks back at the pup - which has now turned around \nbackwards. \n\nVIRGIL \nNow what's that?\n\n\nOn Amy - disturbed by his slow progress. \n\nEXT. GARDEN MARKET - ANOTHER DAY \n\nAmy and Virgil being led through a series of plants and trees by a \nEARTHY SALESWOMAN. \n\nSALESWOMAN \nI believe we have just the tree you're \nlooking for your lobby. Needs very little \nlight - slow growing - ah here we are...\n\n\nAmy and Virgil stop at a large Ficus Tree. \n\nAMY \nNice. Good. What do you think Virgil?\n\n\nAARON (CONT'D)\nHe is also still having great difficulty \n\"scanning\", basically putting a whole picture together.\n\n\nVirgil stares at the large tree. Up - down - up - down - up - down - \nup - down - Amy and the Saleswoman watch him, Amy wants to help but \ncan't comprehend what he's going through. \n\nAARON (CONT'D)\nIf he looks at the top of a tree - then scans \nto the bottom - he's forgotten the top by the \ntime he reaches the trunk.\n\n\nINT. AMY'S WORK - DAY \n\nANGLE ON Virgil in Amy's office - staring at a construction sign - \nFUTURE HOME OF etc... Using his finger to outline the letters of the \nsign - he tries to read the word FUTURE. He mouths the letters - \ntries to form the word. \n\nAARON (CONT'D)\nThis includes the ability to read. In reading a \nword - he forgets the first letter by the time \nhe gets to the last.\n\n\nAmy working with a draftsman - glances up to see Virgil struggling \nwith reading. \n\nINT. NEW YORK EYE HOSPITAL - LECTURE ROOM - DAY \n\nBathed in a bank of lights, Aaron at the podium continuing. Virgil \nquiet - is seated behind him. \n\nAARON (CONT'D)\n-- meaning ... he has a total lack of visual \nmemory. This is an unexpected physiological \nflaw. We are hopeful Virgil can overcome this. \n(beat) \nThank-you - that's all for today.\n\n\nINT. NEW YORK EYE HOSPITAL HALLWAY - DAY \n\nVirgil and Amy exit the hall, are immediately surrounded by \nREPORTERS and PHOTOGRAPHERS. There's a sudden FLASH. Virgil reacts, \npulling away. \n\nVIRGIL \nWhat's that?\n\n\nAMY \nA camera - it's OK - \ntaking your - picture.\n\n\nVIRGIL \nWhat, by flashing me in the face?\n\n\nFLASH - there's another - Amy tries to block the light. \n\nAMY \nPlease!! - It's not good for him.\n\n\nSuddenly - there's a mike in his face, as CHRISTIE EVANS reporter \nfrom Channel 2 news steps forward with CAMERA CREW in tow. \n\nCHRISTIE EVANS \nMr. Anderson. Christie Evans Eyewitness news. \nWe heard the Doctor speak about your progress \n- and we're wondering what your expectations are.\n\n\nAs Virgil stops - stunned by the lights in his face. As he looks to \nAmy we cut to: \n\nINT. HOME - LATE DAY \n\nTV MONITOR - Virgil turns to camera - starts talking to the \nreporter. As we pull back we hear less and less as we reveal a \nmodest living room. A TEENAGER doing homework on a table in the \ncorner and a MAN - early 60's, rugged - sitting on a couch watching \nthe news. \n\nMAN \nOh my God.\n\n\nHe leans forward - his interest piqued and he picks up the phone. \n\nMAN \nInformation. Pinecrest. \nFor a Jennie Anderson..\n\n\nINT. RESTAURANT - LITTTE ITALY - LATER THAT NIGHT \n\nA silver fork held up in front of us. \n\nAMY \nWhat's this?\n\n\nVirgil and Amy sit on the patio of La Mela. Virgil's hand goes out \nfor the fork. Amy pulls it away. \n\nAMY \nUh uh uh. See it first. \nNo cheating. Concentrate.\n\n\nVirgil stares hard at it. \n\nVIRGIL \n(guessing) \nA pen. I don't know - let me touch it.\n\n\nShe hands it to him. \n\nVIRGIL \nA fork.\n\n\nAMY \nRight.. Now put it down in \nfront of you. How far is it from.\n\n\nVIRGIL \nTwenty feet\n\n\nAMY \nYou're not looking.\n\n\nVIRGIL \nDammit, Amy, Amy, I spent all day in front \nof that panel feeling like a guinea pig. \nEvery time I open my eyes I have to look. \nCan we just sit and have dinner for once?\n\n\nAmy just stares. It's clear they're both tired. \nAMY \nI'm just trying to help you see.\n\n\nVIRGIL \nI know. But that's all it seems we're \nabout. How was your day - what goes on \nat work - how about those Rangers - \ndid the stock market hold today - \nis there anything else going on in our \nworld besides my eyes?\n\n\nAMY \n(beat) \nOK, we've been invited to a party \n- Duncan's birthday.\n\n\nAn ITALIAN WAITER appears - putting a large plate of spaghetti in \nfront of Virgil and Amy. Virgil is a little repulsed by what he \nsees. \n\nVIRGIL \nWhat's this - looks like worms.\n\n\nAMY \nIt's spaghetti - it's fine.\n\n\nAs Virgil tries to maneuver his fork - Amy reaches behind her. \n\nAMY \nI brought you a present - \ngood for hand eye coordination.\n\n\nShe hands him a TOYS R US bag. He peers inside. \n\nVIRGIL \nGreat - you go to work building buildings \n- I go home with building blocks.\n\n\nINT. ROSWELL -TREMONT - LATE DAY \n\nAmy - looking a little worn - staring blankly at her computer. A \nthree dimensional rendition of the mall rotates on the screen. \nDuncan pokes his head in. \n\nDUNCAN \nI'm here for you to wish me \nhappy birthday. How's it going?\n\n\nAMY \n(distracted) \nOK. He's progressing, slowly \n- doing the best he can.\n\n\nDUNCAN \nI was actually wondering about the mall \ndesigns. We're expected in Atlanta tomorrow \n- with these plans.\n\n\nAMY \nI can't go to Atlanta tomorrow \n- not with Virgil's problems,..\n\n\nDUNCAN \nOk, ok \n(Duncan moves in behind her) \nI'm sorry. Things aren't going so well?\n\n\nAMY \n(stares at her work) \nHe seems blinder now than he ever was.\n\n\nDuncan puts his hands on her shoulders - starts to knead them. Amy \nstarts to relax. \n\nAMY \nDo you ever wonder why \nyou do the things you do?\n\n\nDUNCAN \nDidn't get what you expected did you? \n\nAMY \nSometimes I think he's not going to make it \n- that he's never going to be able to see.\n\n\nDUNCAN \nAmy - listen to me. You liked this guy \n- I saw that. You wanted to help him \n- it didn't work out so hot. You can't \npunish yourself.. Sometimes things just \ndon't work out the way we want them to \n- look at us.\n\n\nAmy smiles warmly. \n\nAMY \nYeah. Thanks Duncan.\n\n\nDUNCAN \nAnytime. \n(beat, a joke) \nNow back to work.\n\n\nAs he starts out of the room, Amy turns stops him. \nAMY \nHey, Happy Birthday.\n\n\nINT. AMY'S LOFT - DAY \n\nVirgil sits at the kitchen table staring at everyday kitchen \nutensils - being held by Ethan. \n\nVIRGIL \nMeasuring cup?\n\n\nEthan shakes his head - no - it's a cheese grater. Virgil stares \nagain. Ethan mimes grating cheese. \n\nVIRGIL \nCheese grater.\n\n\nETHAN \nYes - my man.\n\n\nEthan holds up something new - one of those strange spaghetti \nstrainers. Now they are both staring at something they don't \nunderstand. Virgil looks to Ethan. \n\nETHAN \nGot me.\n\n\nVIRGIL \n(laughing) \nYou're no help. How am I supposed \nto do my homework if...\n\n\nETHAN \nHomework - dude - I\nain't doin' homework.\n\n\nVirgil continues to look at the strainer as Ethan gravitates towards \nhis cane folded up on the table. \n\nETHAN \n(beat) \nYou're lucky you got a cane.\n\n\nVirgil looks over - sees his fascination. \n\nVIRGIL \nYou want it. I've been thinking\nabout throwing it out.\n\n\nEthan's up in a flash. \n\nETHAN \nMan - really - I can have it? Cool. \n(picking it up) \nI could be a Ninja Darth Vader fighter \nwith one of these - protect my mom from \nthe evil super.\n\n\nVirgil is up - with the spaghetti strainer in his hand. \n\nVIRGIL \nBut first you'll have to fight \noff the evil --- whatever this is.\n\n\nAs they joust about - Virgil enjoying himself - there's a knock at \nthe door. \n\nVIRGIL \nCould be the super - go for cover.\n\n\nAs Ethan ducks behind the couch, Virgil makes his way to the door, \nfumbling with the handle - he opens it to: \n\nJENNIE. Virgil stares at her. We soon realize he has no idea who \nthis is. \n\nVIRGIL \nYes?\n\n\nJenny looks at him, her eyes welling. \n\nJENNIE \nVirgil - it's me.\n\n\nAnd suddenly Ethan is there - cane drawn like a sword. \n\nETHAN \nEn garde.\n\n\nJennie startled - looks to Ethan then Virgil. What's going on? \n\nVIRGIL\nJennie?! Jennie.. God, I'm sorry \n- c'mon in - this is my friend Ethan \n- what are you doing here?\n\n\nOff Jennie's look: \n\nEXT. CONSTRUCTION SITE - DAY \n\nVirgil and Jennie standing across the street from a building being \ntorn down. Hard hatted WORKERS hover about the large trucks at work. \n\nVIRGIL \nYou want to tell me \nwhat we're doing here?\n\n\nJennie points. \n\nJENNIE \nThat's him. That's our Father.\n\n\nVirgil looks in the direction she's pointing - tries to focus on a \nfigure moving across the lot. The MAN we saw watching TV. \n\nVIRGIL \nI can't - I can't see him.\n\n\nJennie looks to him. \n\nJENNIE \nI thought your eyes were better.\n\n\nVIRGIL\nNo. I - I don't want to see him. \nMy eyes aren't good enough - not yet \n- he won't understand. It won't be enough.\n\n\nVirgil takes a step back. \n\nJENNIE \nHe's our father. He heard about the \noperation and he's asked to see you. \nLook here he comes.\n\n\nVIRGIL \nGODDAMIT Jennie - I don't want to \nsee him - I don't even know why you\nbrought me here.\n\n\nAnd Virgil takes another step back then turns and starts of f down \nthe street leaving Jenny alone. \n\nINT. AMY'S BUILDING - NIGHT \n\nAmy making her way up the stairs - roll of plans under her arm. \nOpening her door to: \n\nINT. AMY'S LOFT - NIGHT \n\nA totally dark room. She drops her things. \n\nAMY \nVirgil?... Virgil?!\n\n\nShe flicks on the light - to reveal Virgil has been sitting in the \ndark. She looks over - sees the scattered blocks on the floor. \n\nVIRGIL \nI'm here. I forget about the lights sometimes.\n\n\nAMY\nLook - about this party tonight \n- it's no big deal - maybe we should just...\n\n\nVIRGIL\nIt's your partner's birthday. We should go \n- besides you wanted me to meet your friends, right?\n\n\nAMY \nYeah. Right.\n\n\nINT. LOFT - NIGHT \n\nNoisy, crowded - PEOPLE mill about carrying drinks - black and \nsilver balloons float about the ceiling. Moving through the crowd - \nmusic blasting - Amy introducing people to Virgil over the noise. \n\nA WAITER walks up to them holding a tray of wine. \n\nWAITER \nGlass of wine? Red - white?\n\n\nAmy reaches out - takes one. \n\nVIRGIL \nWhich is the red?\n\n\nAmy looks at the waiter - then points to one. Virgil's hand reaches \nout slowly - hovering - it's clear it's confusing - trying to \nseparate out one glass. The Waiter looks to Amy like \"is he OK?\" \n\nAMY \nVirgil - here let me.\n\n\nHer hand darts in front of his. \n\nVIRGIL \n(quick) \nNo! Sorry - I mean - I'm almost \nthere - I think I got it.\n\n\nAnd she backs off as his hand wraps around a glass - pulling it \nback. At the last second knocking over two other glasses. \n\nVIRGIL \nDammit. Sorry.\n\n\nThe Waiter - trying not to spill on himself. \n\nWAITER \nTrust me - you're not the first - \nor probably the last. Let me get a cloth.\n\n\nVIRGIL \nThanks\n\n\nThe Waiter smiles - and as he walks off. Virgil nervously takes a \nlarge drink of wine. \n\nWAITER \nI hope you're driving.\n\n\nSuddenly from the front of the room - MARSHALL, the host calls out: \n\nMARSHALL \nOK. He's coming up the stairs. \nEverybody get ready - kill the lights.\n\n\nExcitement - a buzz - Virgil looks around then CLICK - all the \nlights go out. Virgil panics momentarily. \n\nVIRGIL \nWhat - what's happening?\n\n\nAmy moves to him in the near dark room. \n\nAMY \nIt's for the surprise - \nthey turned off the lights.\n\n\nVIRGIL \nSurprise - yeah.\n\n\nAnd suddenly the lights flood back on, everyone screams: SURPRISE!! \n\nDuncan - at the door with Betsy - genuinely surprised - catches his \nbreath - then fakes a quick heart attack and drops to the floor. \n\nThe room explodes in laughter - Amy included. This action is even \nmore confusing to Virgil. \n\nVIRGIL \nIs he OK?\n\n\nHearing this - everyone breaks into bigger laughter - Virgil now the \nfocus of attention - good naturedly laughs - Amy smiles, \nembarrassed. Virgil takes a gulp of his wine, finishing it off. \n\nLATER: \n\nThe Music is cranked! Many couples dance. Virgil exits the bathroom \n- glances back in the mirror again, at his hair - not sure he likes \nits style. He tries brushing it to the other side - it's OK. How \nabout the other way - not so bad - maybe. It's clear he's a little \ntipsy as he keeps playing with his hair. \n\nWAITER (O.S.) \nHere ya go Virgil.\n\n\nVirgil turns - the Waiter stands there holding a glass of wine - \nplacing it carefully into Virgil's hand: \n\nVIRGIL \nCheers, Kevin.\n\n\nAMY (O.S.)\n(over the noise)\nVirgil!!\n\n\nVirgil embarrassed, turns - can faintly hear Amy's voice over the \nmusic. Searches the room - bopping bodies - balloons being bashed \nround - lights dim. The number of drinks he's had isn't helping. \n\nAMY \nVirgil--over here!!\n\n\nAmy, standing with Duncan and Betsy. \nDUNCAN\nMaybe he's blind again.\n\n\nAMY \nDon't even think it. C'mon - I want the \nboth of you to meet him - he'll never \nfind us here.\n\n\nWith VIRGIL - smiling as he sees Amy, Duncan and Betsy move towards \nhim. \n\nAMY \nVirgil - I'm sorry - I went to get \nDuncan. Duncan - Virgil. And this is \nBetsy.\n\n\nDUNCAN \nHey Virgil good to meet you.\n\n\nBETSY \nHeard a lot about you.\n\n\nVIRGIL \nHeyyy! Yeah. Good to meet you.\n\n\nVirgil thrusts his hand out - colliding it into Duncan's. \n\nVIRGIL \nSorry - things still get a \nlittle cockeyed sometimes.\n\n\nDUNCAN \n(holding up his drink) \nFew more of these and I'll be the same.\n\n\nVIRGIL \nLemme get Kevin - my man - \nhe'll top you up. KE-VIN!!!\n\n\nAMY \nVirgil!\n\n\nVIRGIL \nWhat?\n\n\nUncomfortable - everyone stops. \n\nAMY \nNothing. It's ok.\n\n\nDUNCAN \nAmy, in Atlanta tomorrow...\n\n\nAMY \nDuncan - I told you...\n\n\nDUNCAN \nI spoke to Falk and he...\n\n\nAMY \n(can't hear) \nWhat?\n\n\nDuncan pulls Amy in close to talk - shutting Virgil and Betsy out. \n\nBETSY \nAmy said you had great hands. \n\n\nVIRGIL \n(laughs) \nShe did, did she.\n\n\nVirgil holds them up in front of his face - tries to see them. Then \nlooks past them and watches Amy and Duncan - more importantly looks \nat Duncan's hair, his clothes. It's clear he's becoming aware of \nappearances. His own especially. \n\nAs they break their tete a tete. \n\nBETSY\nYou know my father was blind for several \nyears, he had cataracts as well.\n\n\nSomehow this comes out patronizing. \n\nVIRGIL \nReally. I'm surprised I don't \nknow him. It's a club you know.\n\n\nKevin, the African American waiter comes up. \n\nKEVIN \nYes.\n\n\nVirgil throws his arm around Kevin. \n\nVIRGIL \nKevin - Duncan here the birthday man \n- could use himself a drink. Kevin here \ntells me he's black - did you know that\n- I mean look at him - look at me -\nisn't that the damnedest thing. He's black. \n\n\nAmy is mortified, Kevin laughs. \n\nKEVIN\nI'll get you a drink.\n\n\nVirgil looks to Amy. \n\nVIRGIL \nWhat's that look?\n\n\nAMY \nWhat look?\n\n\nVIRGIL \nI've never seen your face that way \nbefore. It's.. .weird. What does it mean?\n\n\nBefore she can answer - a dance song breaks out - Betsy wraps her \narm around Duncan's. \n\nBETSY \nCome on Duncan - let's dance - \nmove those old bones.\n\n\nDuncan only acknowledges Betsy's contact with a raised eyebrow to \nAmy. \n\nDUNCAN \nWhat the hell it's my birthday -- nice to \nmeet you Virgil - see you at the opening.\n\n\nAnd they're gone onto the floor. Virgil watches him - sees the ease \nwith which Duncan moves, handles things. \n\nVIRGIL \nOpening?\n\n\nAMY \nThe lobby we designed. Virgil - you can't...\n\n\nVIRGIL \nLet's dance.\n\n\nVirgil takes her arm and pulls her out on the floor. Amy - ready for \none of Virgil's wild dances takes hold of his hand. The music \nblaring, Virgil starts to get into it - Amy starting to relax - then \nVirgil slowly notices how everyone else is dancing - more \nconservative. \n\nHe's even getting some looks from people. Slowly he winds down - \ntries to mimic what everyone else is doing - ends up in just a slow \nshuffle. \n\nAmy watches him - sees he's uncomfortable - moves to him - but \nVirgil turns on his heel and strides away. Amy follows after him. \n\nINT. LOFT - CORNER - NIGHT \n\nVirgil stands near the glass doors leading to an outdoor balcony. \nAmy comes up to him - finds Virgil facing a wall - eyes shut. \n\nAMY \nWhat are you doing?\n\n\nVirgil's head cocks slightly towards her - just like when he was \nblind. \n\nVIRGIL \nI feel like Rip Van Winkle. \nI've woken up from a thirty year sleep \n- and the world's passed me by.\n\n\nAMY \nIt's just dancing. Who cares?\n\n\nVirgil whirls on her - his hand on her shoulder to steady his look \nat her. \n\nVIRGIL \nNo-no-no-no. It's not the Goddamn dancing. \nI wanted to come here tonight - show you I\ncould \"fit\" in. Like the big boys do. Big \nseeing boys. Yes. Well, I don't. Don't.\n\n\nAMY \nIt's just going to take time. \nYou weren't ready. We shouldn't have come.\n\n\nVIRGIL \nNo - I - me, shouldn't have come. \nYou want me to see - but you know what \n- you know what - shit - I don't belong \nin the wonderful world of seeing. \n\n\nAmy reaches out to him. \n\nAMY \nVirgil \u0085 look \u0085.\n\n\nAmy realizes what she just said - Virgil pulls his arm away. \n\nVIRGIL \nNo, I won't. I'm tired of looking. \nFuck looking and the horse it came in on.\n\n\nAnd he spins to get away from her and takes a step crashing right \ninto the sliding glass door which explodes in a shower of little \ncrystals. \n\nThe party slams to a halt - Amy stands stunned. Virgil shaken - tiny \ncuts on his face. \n\nAMY \nOh my God, are you alright?\n\n\nVirgil slams his eyes shut. \n\nVIRGIL \nYeah, I'm just fine. Take me home.\n\n\nINT. AMY'S LOFT - NEXT MORNING \n\nVirgil, small nicks on his face, wakes up - rolls over - feels the \nempty bed beside him. Looks up to see Amy pulling her coat on - \nsuitcase at her side. \n\nAMY \nDidn't want to wake you.\n\n\nVIRGIL \nYou're going.\n\n\nAMY \nI'll only be a couple of days.\n\n\nVIRGIL \nThis isn't working.\n\n\nAMY \nWhat - we're not working - your eyes \n- what's not working?\n\n\nVIRGIL \nI get up every morning - I look in the mirror \n- and I stare at a total stranger. I stare and \nI stare - and no matter how hard I look - I \ndon't see Virgil there anywhere. And the more \nI look at you...\n\n\nAMY \nWhat? You don't see me?\n\n\nVIRGIL \nI saw you better when I was blind.\n\n\nAMY \nWell, you're not blind any more. \nI'm sorry if that disappoints you. \n(beat) \nI've got a plane to catch. I'm going \nto go before we say things we don't mean.\n\n\nAnd she grabs her bag and is out the door. As we hold on Virgil's \nface. \n\nAT THE WINDOW - Virgil looking out - watching Amy get in the cab. \n\nAs she drives away we see Virgil watch the car recede - then his \nhand goes out. \n\nHIS POV - his hand grasping at the tiny disappearing cab - trying to \nhold onto it like in Times Square - trying not to let it go. \n\nINT. FALK BOARD ROOM - DAY \n\nCLOSE ON - Amy's sketches. The Mall has been integrated into the two \nlarge trees - giving it shelter and shape. \n\nFALK (O.S.) \nI love it.\n\n\nAmy and Duncan sit across from Falk, a man in his 40's - earned \neverything he's got - no bullshit kinda guy. \n\nFALK \nBut we already cut those trees down.\n\n\nEXT. NYU CAMPUS - DAY \n\nKids milling about. A young couple neck unabashedly against a wall. \n\nWe see this is Virgil's POV - he's watching - people together. \n\nINT. NYU HALLWAY - DAY \n\nVirgil makes his way down the hall. Stops at an open doorway - a \nsign next to it with raised letters in Braille. As his hand feels \nacross it - he also reads the visual letters - Dr. Ray Webster. \n\nPeering inside - he sees a Lab - full of the NEWLY BLIND - some \nTEENAGERS - a couple of ADULTS - a handful of SEEING IMPAIRED - all \nlearning to use a cane. The rapid tapping of their cane like a room \nfull of typewriters. \n\nVirgil watches - the Blind working their way around a small obstacle \ncourse - many of them running into desks, tables - it's tough, \nfrustrating work. \n\nSuddenly Virgil feels someone next to him. Webster. \n\nWEBSTER \nYou want to join us.\n\n\nVirgil watches the blind. \n\nVIRGIL \nNo - no - I'll wait for you \nout here - when you're done.\n\n\nAs Virgil moves off to a hallway bench: \n\nWEBSTER \nVirgil\n\n\nVirgil turns as Webster tosses his something. Virgil misses it - it \nhits the ground - he reaches down - finding it, he picks it up - \nit's an apple. He looks to Webster who smiles back at him. \n\nWEBSTER \nI'll be done in a minute.\n\n\nINT. HOTEL LOBBY - ATLANTA - DUSK \n\nAmy and Duncan walk through the lobby to their rooms. A little combo \nplays music in the adjacent bar - a few people on the tiny dance \nfloor. \n\nAMY \nYou'd think he would have told us. \nI mean those trees were in the photos.\n\n\nDUNCAN \nWe'll just have to win him over tomorrow. \nLet me buy you a drink - get those \ncreative juices going.\n\n\nAMY\n(looks at her watch) \nAw - no - I really...\n\n\nBut Duncan has her by the arm - and in one spin has her in a dance \nembrace. This move seems comfortable, familiar to them both. \n\nDUNCAN \nC'mon - listen, they're playing our song.\n\n\nAMY \n(laughs) \nMack the Knife was our song?\n\n\nINT. WEBSTER'S LAB - LATER \n\nWebster is cleaning up after class. Virgil watching some of the \nTeenage kids and Adults find their way out of the room. As the last \nof them leaves. \n\nWEBSTER \nOK - I'm just about done here - I got a place\nfor you - relax those eyes a bit.\n\n\nINT. STRIP CLUB - NIGHT \n\nA table front and center. Some empty beer glasses in front of them. \nTwo full ones in their hands - they're both a little in their cups. \nA STRIPPER grinds and weaves her way about the small dance floor to \nthe sounds of Talking Heads \"Burning down the House\". \n\nVIRGIL \n(eyeing the girl) \nYou want to know the truth -- God's honest truth? \nSeeing's been the shits.\n\n\nWEBSTER \nYou got to be kidding me son. You can say \nthat - sitting here in these prime viewing seats. \nForget fixing your eyes - we're going to get \nyour head examined.\n\n\nVIRGIL \nI'm serious. I was better off blind. \nPeople don't have these expectations of you \nyou can't live up to. You're blind - \nfine - they deal with it.\n\n\nWEBSTER \nDidn't get what you expected did you?\n\n\nVIRGIL \nWhen I was blind - I had an image of \nwhat everything was, up here...\n(points to his head)\nnow - it's all different - not at all \nwhat I'd expected - not what I'd hoped for.\n\n\nWEBSTER \nVirgil, let me explain something here. \nWhen you were blind - you dealt with things \none at a time - sequentially right? A wall \nled to a door to a tree to a car. That's \nhow you got to what you wanted - right.\n(beat)\nSeeing people - for better or worse - \ndeal with everything all at once - taking in \nthe whole picture - which sometimes confuses \nthe hell out of what they want.\n(beat)\nVirgil, my advice after three beers - don't be \nafraid to take in the whole picture - just don't \nlose sight of what you want.\n\n\nVIRGIL\nWhat I want is to make it work with Amy.\n\n\nWEBSTER \nAnd what does she have to say\n\n\nVIRGIL \nShe just wants me to see.\n\n\nWEBSTER \nIt's that important is it?\n\n\nVIRGIL \nYou know what I learned a long \ntime ago. Seeing girls like seeing guys. \n(beat) \nI'm not going to let her down.\n\n\nINT. HOTEL BAR - NIGHT 102 \n\nAmy and Duncan are dancing - they seem good together. Nothing fancy \n- but they move as one about the floor. \n\nDUNCAN \nSee - not so bad.\n\n\nAMY\nNot so bad.\nDUNCAN \nIt's nice to dance together again. \n\n\nAMY \nYeah.\n\n\nDUNCAN \nYou remember...?\n\n\nAMY \nFirst time we danced - Connecticut. We \nwatched the leaves turn - so much to see \n- I'd love to go back. \n\n\nDUNCAN \nSo would I. \n(beat) \nWhat happened to us Amy? You're so intent on \nfixing everything - why'd you give up on us?\n\n\nAMY \nI learned some things can't be fixed. \nWe got married for all the wrong reasons. \nI don't think I fell in love with you as \nmuch as I fell in love with architecture.\n\n\nDUNCAN \n(serious) \nI never fell in love with architecture - \nbut I know I fell in love with you. \n\n\nAMY \nNow - that's bullshit.\n\n\nDUNCAN \nIt used to work.\n\n\nThey smile at each other - everything's easy right now - pause - \nthey dance - Amy looks up at Duncan - who hesitates - then leans in \nand kisses her. \n\nA moment and Amy pulls away slightly - looks down for a second - \nthen she leans back in and they kiss again. We hold on this kiss, \nthen cut to: \n\nINT. HOTEL ROOM - NIGHT \n\nBLACK - we hear movement - then a light comes on in the bathroom. \nAmy stands there clutching her clothes - staring into the mirror. In \nthe background we see Duncan curled up asleep in bed. \n\nAmy stares at herself long and hard. \n\nAMY \n(whisper) \nOh, God.\n\n\nAnd she starts to dress: \n\nDUNCAN \nAmy? - what's going on -\nwhat time is it?\n\n\nClick - he flicks the bedside lamp on - squinting - finds Amy. She \ndoesn't talk - keeps dressing. \n\nDUNCAN \nWhat's wrong?\n\n\nAMY \nWhat's wrong? This was' a mistake - \na big mistake. Go back to sleep - \nyou've got an important meeting tomorrow.\n\n\nDUNCAN \nI've got? - hold on here - you're not \nbailing out on me - I need you.\n\n\nAMY \n(flat) \nFor the meeting.\n\n\nDUNCAN \nOf course for the meeting.\n\n\nDressed, she moves toward the doorway - Duncan sits up in bed. \n\nAMY \nI'm going home.\n\n\nDUNCAN \nTo be a babysitter.\n\n\nShe stops at the door. \n\nAMY \nCan't we for once be adults - face the \nfact that we've just made a colossal error? \n\n\nDUNCAN \nFine - this was stupid, there - happy? - \nbut goddamit Amy - I still care about you. \nWhere do you actuallv think any of this is \ngoing to lead with this guy?\n\n\nAMY \nI don't know - but the one good thing to come \nof this mess tonight - I know I want to find out.\n\n\nAnd she's gone - WHAM. \n\nEXT. AMY'S LOFT - DUSK \n\nA cab pulls up - Amy gets out - looks up at her loft - it's dark. \n\nINT. AMY'S LOFT - DUSK \n\nKitchen light on - a pile of Ethan's blocks on the table. Amy makes \nher way over to see it reads: \n\nON THE ROOF \n\nEXT. AMY'S ROOF - DUSK \n\nAmy opens the door and sees Virgil leaning against the parapet wall, \nstaring out at the night Manhattan skyline. After a moment, he walks \nback to the other end of the roof, turns and slowly walk - toward \nthe parapet wall again - all the time staring at the skyline - with \na smile and look of amazement on his face. \n\nAMY \nHi\n\n\nVirgil turns - finds her. \n\nVIRGIL \nHey.\n\n\nAmy starts toward Virgil. \n\nAMY \nWhatcha doing?\n\n\nVIRGIL \nIt's the craziest thing. You start back over \nthere - focus on a building. And when you walk \ntowards it - it changes - each step makes it \nlook different. I started out just looking \nfor the horizon.\n\n\nAMY \nYou can't see it from here \n- too many buildings.\n\n\nVIRGIL \nBut it's still there - even though you can't \nsee it - right? You gotta have faith it's there. \nThings exist beyond what I can see - \nI just have to take it on faith.\n\n\nShe comes up next to him - Virgil, looking out over the wall turns \nto her - studies her face: \n\nVIRGIL \nYou have so many looks?\n\n\nAMY There's something I have to tell you. \nI was getting confused - which is no \nexcuse for how I've acted, but...\n\n\nVIRGIL\nWait - no - this isn't your fault - \nI'm the one's been a shit. You're too \nhard on yourself - expect too much of yourself.\n\n\nAMY \nVirgil \u0085\n\n\n\nVIRGIL \n(stopping her) \nLet me say this. Every day of my life - \nI've wished for just one thing.\n\n\nAMY \nTo see.\n\n\nVIRGIL \nTo be whole. For just one month. For just \none day or one minute. For one goddamned \nhalf a second. And not just to be able to \nrun, or ride a bike, or drive a car. \n(beat) \nBut for once not to have a bruise from \nbumping into something or to stand in a room\nand have to ask \"is anyone here\" and here \nthat dead silence, knowing someone is there. \nNot to have food on my sweater, or have to \nput my finger in my glass to know when it's \nfull. I just want to be whole. \n(beat) \nI went to see my father the other day.\n\n\nAmy moves toward him. \n\nVIRGIL \nI couldn't face him. I felt like \nI was letting him down. I feel \nlike I'm letting you down.\n\n\nAMY \nNo \u0085\n\n\n\nVIRGIL \nNo, listen. I gave up years ago - I'm not \ngoing to give up now. Amy - that day I met \nyou - for the first time in my life I felt \nsomeone needed me as much as I needed them. \nI don't want you to give up on me.\n\n\nAmy out of breath - feels a surge of love for this man - moves in \nkissing him. A long kiss - then: \n\nVIRGIL \nBesides I couldn't leave you - \nI owe too much in back rent.\n\n\nAnd as Amy pulls him into embrace - we hold on her face - then: \n\nINT. LECTURE HALL - DAY \n\nCLOSE ON - Dr. Aaron - harsh lights washing him out. \n\nAARON \nUp until the operation five weeks ago - \nVirgil had been a touch person - someone \nwho's vocabulary, whole sensibility, \nhis picture of the world was based on \ntactile -- non-visual terms.\n\n\nINT. DOWNTOWN ATELETIC CLUB - DAY \n\nA HEALTH INSTRUCTOR - 50's Jack LaLaine type - is giving Virgil the \ntour of the facilities. They enter the weight/workout room. Various \nshapes and sizes of people work out on various shapes and sizes of \nworkout machines. \n\nAaron's voice-over continues as Jack motions to Virgil to follow \nhim.. Virgil hesitates. \n\nHIS POV - chrome, iron, plastic - but somehow it's more defined than \nwe've seen before. \n\nDetermined - Virgil starts his way into the gym - hand' out brushing \nby what he sees in front of him. \n\nAARON (CONT'D)\nBut - now - as a sighted person - by \nfocusing singlemindedly on his goal, \nVirgil has a new found ability to \nunderstand his own physical relationship \nto objects in his life around him...\n\n\nVirgil now drops his hand - starts moving through the maze of people \nand equipment - actually \"seeing\" his way. \n\nAARON (CONT'D)\nDistance, size, shape - perspective - \nnow all have profound meaning to him...\n\n\nEXT. HEALTH CLUB - DAY \n\nVirgil negotiating a glass door - exiting the building. \n\nAARON (CONT'D)\n\nand though there are still miles to go in his \nlearning process - for all medical intents \nand purposes - he is becoming a seeing person.\n\n\nVirgil walking down the street - deftly dodging a kid on a \nskateboard - throwing out his hand to hail a cab. \nAARON (CONT'D)\nThis is an extraordinary achievement and \nadvancement for medical science and a \ntribute to Virgil's determination to see.\n\n\nINT. LECTURE HALL - DAY \n\nAARON (CONT'D)\nLadies and Gentlemen - Virgil Anderson.\n\n\nApplause and Virgil looking to Amy in the audience, stands - a \nseeing man - and easily makes his way to the podium. Standing in the \nlights he readjusts the microphone - moving it up from the much \nshorter Aaron. \n\nVIRGIL \n(clears his throat) \nSince this may be one of our last \nsessions - are there any questions?\n\n\nVOICE IN THE DARK \nMr. Anderson - is there something you\nwere surprised to see for the first time\n- something that looked quite different \nthan you thought?\n\n\nVIRGIL \nBreasts. \n(laughter) \nNo, really. Don't get me wrong - I love them \n- they just weren't what I expected.\n\n\nVOICE \nWhat about your girlfriend?\n\n\nVIRGIL \nWhose did you think I was talking about?\n\n\nLaughs. \n\nANOTHER VOICE IN THE DARK \nNow that you're fully seeing - \nwhat are you looking forward to most?\n\n\nVIRGIL \nNot having to do these sessions. \n(laugh) \nNo - actually - being independent.\n\n\nVOICE \nCan you read yet?\n\n\nVIRGIL \nNo, but...\n\n\nVOICE \nWill you ever be able to?\n\n\nVIRGIL \nI don't know.\n\n\nVOICE \nIf you can't read - will you ever be able to drive?\n\n\nVIRGIL \n(suddenly somber) \nI don't know.\n\n\nVOICE \nWell how can you say...\n\n\nFAMILIAR VOICE \n(interrupting) \nVirgil. After so many years of darkness - \ndescribe what it is to actually see.\n\n\nAngle on the Voice in the dark. Webster. \n\nCLOSE ON - Virgil - as he thinks about the question. \n\nINT. ROSWELL-TREMONT - AMY'S OFFICE - LATE DAY \n\nCLOSE ON - the Atlanta project. Miniature size. And a set of plans \nlaid out across Amy's desk. Virgil's hand comes into frame - touches \nthe model - moves to the plans - touches them. \n\nON VIRGIL - alone in Amy's office - looking at her work. We go to \nhis face - his eyes - we see that he is seeing Amy's work. \n\nAMY (O.S.)\nYou're here.\n\n\nVirgil looks up - Amy at the doorway. \n\nVIRGIL \nThe Atlanta project - I thought it went away.\n\n\nAMY \nDuncan did some song and dance - Falk's coming\nto the lobby opening tomorrow - see our work.\n\n\nVIRGIL \nI see it Amy.\n\n\nAMY \nWhat's that?\n\n\nVIRGIL \nYour world. What you do. The plans - \nthe work the ideas. The molding. \nFor the first time I really see what\nyou do - and not just up here... \n(he points to his head) \nbut in here.\n\n\nVirgil's hand goes out to her chest - places it on her heart. \n\nAMY \n(moves in close, sexy)\nTonight is your night something \nspecial I want to show you\nVIRGIL \nWhat is it?\n\n\nSMASH TO: \n\nEXT. BUILDING - LATE DAY \n\nAMY (V.0.) \nEverything.\n\n\nTOP OF THE WORLD TRADE CENTER \n\nThe sun starting to set - the whole of the five burroughs of New \nYork laid out in front of us. Virgil moves to the edge - looks out \nover this amazing panorama. \n\nAmy moves up next to Virgil - they take it in a moment. \n\nAMY \nThat's the Brooklyn Bridge, Empire State \nBuilding, Chrysler building just over there...\n\n\nVIRGIL \nAmy, look at me.\n\n\nAMY \nWhat? \n\n\nVIRGIL \nThis face - this is everything. It's all \nI've ever wanted to see. \n(he watches her) \nYou have so many looks. \nWhat do all those looks mean?\n\n\nAMY \nWell. Let's see. This... \n(makes corresponding face) \n... is sad. This...is frustrated. \nThis... is tired. This.. is confused. \nThis.. is happy. And this... \n(her face softens) \n... is what in love looks like.\n\n\nVirgil puts his hand on her face - looks at it carefully. \n\nVIRGIL \nThis look - this look I love. \n\nAmy leans forward and kisses him - and he soon forgets it even \nhappened. As they kiss we pull slowly back and away as the sun goes \ndeep gold and we start to hear what sounds like rain: \n\nWe cut to: \n\nINT. AMY'S LOFT - NIGHT \n\nAnd they are still kissing - and we realize they are in the shower - \ntogether - kissing - exploring - very sensual. As Virgil moves to \nkiss her neck - her breasts - Amy's head tilts back in to the spray. \n\nAMY \nVirgil - it's raining.\n\n\nAnd he moves up again - looks her in the eyes - and for a moment his \neyesight shudders ever so slight1y - it goes away and they kiss \nagain. \n\nEXT. AMY'S LOFT - MORNING \n\nAmy and Virgil on the street - each hailing separate cabs. \n\nAMY \nSo - eight o'clock tonight.\n\n\nVIRGIL \nEight o'clock - building opening - \nI haven't forgotten.\n\n\nShe blows him a kiss and she's gone. Virgil watches her cab pull \naway - clear something is bothering him. \n\nHIS POV - his vision going in and out. Then clear, then clouded \nagain. \n\nINT. DOWNTOWN ATHLETIC CLUB - DAY \n\nVirgil's massage room. Not as organized as he had at Bear Mtn.. \nVirgil is working on an OVERWEIGHT MAN - his back is splotchy from \ntoo much sun. \n\nVirgil massaging - becomes preoccupied with his skin's imperfections \n- losing his concentration. \n\nOVERWEIGHT MAN \nHey, Virgil - I'm the one supposed \nto fall asleep here. \n\n\nVIRGIL \nYes - sorry.\n\n\nHe closes his eyes - gets back into his rhythm. \n\nINT. ATHLETIC CLUB - LATER \n\nVirgil, pack over his shoulder leaving for the day - about to cut \nthrough the weight room - when it suddenly comes to a halt. \n\nHis POV - his vision fading in and out - and then suddenly quick \nflashes of black. On the final BLACK: \n\nWe smash to: \n\nINT. NEW YORK HOSPITAL - DAY \n\nVirgil at the desk. The Nurse looks up. \n\nVIRGIL \nDaphne - I need to see Dr. Aaron \n- right away. It's an emergency.\n\n\nINT. NEW YORK HOSPITAL - EXAM ROOM - DAY \n\nDr. Aaron is again examining Virgil on the Electroretinogram. Done, \nAaron pulls the machine out of the way. Looks at Virgil - rubs his \nhand across his face. \n\nVIRGIL \nWhat does that mean?\n\n\nAARON \nWhat?\n\n\nVIRGIL \nWhat you just did?\n\n\nVirgil imitates him. \n\nAARON \nIt means - the machine is only registering \nsparks of activity - retinal sparks - \nfollowed by nothing. How long has this \nbeen going on?\n\n\nVIRGIL \nI don't know - first I thought I was \ntired - some blurs - occasional cloudiness \nbut it's been getting worse. Today I'm \ngetting complete blackouts.\n\n\nAARON \nYour retinal function is down ten \npercent. I'm afraid - your retinal \ndisease seems to have returned.\n\n\nVIRGIL \nYou're afraid. What does that mean - I \nthought you corrected it. You told me \nI was a 'seeing person'.\n\n\nAARON \nNow, you've every right to be upset. \nMaybe you didn't have the blood vessels \nto supply enough oxygen to the retinas. \n- Possibly some trauma - there are so \nmany variables...(beat)\nto be honest, I don't know. I wish to God I did.\n\n\nVirgil stands, anxious - starts pacing. \n\nVIRGIL \nOK. You're the expert. Tell me - what \ndo we do now - how do we repair this?\n\n\nAARON \nVirgil. I -- I wish there was a \nnice way to say this.\n\n\nVirgil backs away - doesn't want to hear it. \n\nVIRGIL \nNo - there is no nice way to say it is \nthere. No nice way to let the man know \nit's all over - that.. he's going blind again!\n\n\nAARON \nVirgil, I understand what...\n\n\nVIRGIL \nNo you don't! Don't ever say that. \nYou'll never understand. Ever!\n\n\nAaron stands there - says nothing - tries to let Virgil's anger \ndissipate. A long moment. \n\nVIRGIL \nHow long?\n\n\nAARON \nHard to say. \nMonth - few weeks - \n(beat) \nDays.\n\n\nVirgil stands there stunned - then looking to Aaron. \n\nVIRGIL \nGod, what do I tell Amy? \nWhat do I tell her?\n\n\nOn Virgil's face. \n\nINT. EYE INSTITUTE HALLWAY - DAY \n\nVirgil steps into the hall - Sees: \n\nA FIVE YEAR OLD BOY - blind - eyes half shut - hands reaching out, \nplodding it' a half circle over to where his mother waits for him. \n\nAnd we see the realization on Virgil's face of seeing his past - and \nwhat he will return to: \n\nEXT. STREETS - DAY \n\nVirgil RUNNING, RUNNING, best he can - through the crowded street - \nhands out - bumping into people - desperate - scared - trying to run \nfrom himself - from his fate. \n\nWHAM - he comes to a stop - out of breath - he looks left - right - \nwhere do you go - then sees something off screen. His face torn with \nfear - he moves forward - hand out - reaching to a window - to his \nown REFLECTION. \n\nAnd we push slowly in on the reflection as he touches the window - \nhis hand on his face - a face he may never see again - and a cloud \npasses overhead and his reflection is gone. \n\nEXT. CONSTRUCTION SITE - DAY \n\nVirgil stands at the site - amidst the rubble and mud. His Father \nwalks slowly over to him - raising his arms to embrace him. \n\nVirgil takes a step back - not, ready - his father stops, \nunderstands - looks his son up and down. \n\nFATHER \nYou look good. Hey - how do I look?\n\n\nVIRGIL \nI need some answers. Why'd you leave? Because \nI'm blind - or because I quit trying to see?\n\n\nFATHER \nTo the point - I like that - \nsomething you got from me.\n\n\nVIRGIL \nCut the bullshit - \"dad\". I don't hear from \nyou for over twenty years - then you find \nout I can see and all of a sudden you show up?\n\n\nFATHER \n(looks around) \nHey. Virge - can we talk about this later, huh...\n\n\nVIRGIL \nNo, not later. Now! Was my blindness so \nwrong that made you tear our family apart.\n\n\nVirgil's riled his father. He steps towards Virgil tries to speak \nunder his breath. \n\nFATHER \nEvery morning I woke up and looked at you \nand saw my own failures. If I couldn't get \nmy own son to see then...What difference \ndoes any of this make - you can see now \n- hell, I knew you could.\n\n\nVirgil watches his father - this stranger. His eyes start to well. \n\nVIRGIL \nI'm going blind again.\n\n\nHis Father looks at him - stunned. He reels from the news - takes a \nstep back. \n\nFATHER \nNo...\n\n\nVIRGIL \nThe doctor told me today. You're the first \nperson I've told. I wanted to come see \nyou before it was completely gone.\n\n\nFATHER \n(speechless) \n\nA beat and Virgil's father takes another step back, then turns and \nwalks away - forever. \n\nEXT. NEW BUILDING - LATE DAY \n\nVirgil standing across the street. Trying to take in the building \n\nEXT. NEW BUILDING - LATE DAY \n\nStanding at the front as a security guard opens the door. \n\nGUARD \nSorry the building doesn't open until tonight.\n\n\nVIRGIL \nI know. I'm Virgil Anderson...with Roswell \nTremont. We did the lobby. I'm here to \ncheck some details for tonight.\n\n\nGUARD \nOh, okay, sure Mr. Anderson.\n\n\nINT. LOBBY - LATE DAY \n\nThe lobby is pretty, straightforward. Open - a few plants - a large \ncentral check in desk. Simple - unobtrusive - nothing exceptional or \nunique. \n\nVirgil moves his way about the lobby - looking at it carefully from \nevery possible angle - his hand grazing across walls, entranceways - \ndesperately committing as much as he can to memory - finally ending \nup in the middle of the room in a final attempt to absorb as much as \nhe can. \n\nGUARD (O.S.) \nYou want to see that the thing work?\n\n\nVIRGIL \nThing? What thing?\n\n\nGUARD \nThis thing\n\n\nThe Guard reaches over - hits a switch - and against one section of \nwindows a wall of water comes dripping down - causing a shower of \nindoor rain - the sound instantly echoing off of the walls. \n\nVirgil smiles - moves toward it - closing his eyes - listening to \nthe indoor rain - really taking in the room having total empathy \nwith what Amy has created. \n\nINT. AMY'S LOFT - BATHROOM \n\nVirgil, wrapped in a towel, is shaving. But he has his eyes closed. \nAmy comes in, dressed beautifully - using the mirror to put her \nearrings in. Virgil quickly opens his eyes. \n\nVIRGIL \nYou nervous?\n\n\nAMY \nNo - not a bit. \nWhat do you think?\n\n\nShe pivots for him. \n\nVIRGIL \nYou look great.\n\n\nAMY \nReally. Not too flashy? \n(she looks in the mirror, she is nervous) \nI'm going to change.\n\n\nVirgil lets her go - calls to her. \n\nVIRGIL \nThis is an important night for you.\n\n\nAMY \nBut you know what's most important... \n(she pokes her head in) \nThat you're going to be there to see it.\n\n\nVirgil turns to the mirror, stares at himself - contemplating what \nhe's up against. \n\nINT. NEW BUILDING - NIGHT \n\nThe lobby is filled with business types, waiters circulating with \nchampagne, tiny hors-d'oeuvres. Virgil and Amy enter - standing at \nthe top of the stairs leading to the party. Virgil immediately going \ninto a performance for Amy. \n\nAMY \nSo.\n\n\nVIRGIL \nAmy, it's good - very good. \nI'm proud of you. I love the detail \n- planted pots in the corners, \nthe moldings... \n(beat) \nIt's got genuine lines.\n\n\nAMY \n(excited) \nLook around - do you see it?\n\n\nVIRGIL \nWhat?\n\n\nHe looks about the room - then turns towards the indoor rain. \n\nHIS POV - clear - then slight haziness - a momentary flash of black \n- then back in focus. \n\nHe turns to Amy. Puts his arm around her. \n\nVIRGIL \nOur rain. \n\n\nAMY \nYour rain.\n\n\nDUNCAN \nHey Virgil.\n\n\nHe extends his hand. Virgil, obliged slowly extends his - having \ntrouble focusing - but Duncan helps him - taking hold of it and \nshaking it. \n\nDUNCAN \nStill working on that hand shake \nyou'll get it don't worry.\n\n\nVIRGIL \nCongratulations - the place looks great.\n\n\nDUNCAN \nThanks - here's the genius though - \nI just get the gigs. Can I steal her \naway Falks' over there and I can't \ntell if he's impressed with our work \nor just has gas from the pate.\n\n\nVIRGIL \nGo - do your thing.\n\n\nAMY \nI'll be right back. There's food \nand drinks down on the floor.\n\n\nDuncan and Amy start down the stairs as Virgil tries to find a safe \nplace to stand. His eyesight fading in and out - he looks around - \ndecides to negotiate the steps: \n\nHe takes one step on the stairs - looks down - is able to see Amy \nwith Falk and Duncan, looking up at him - she smiles - he does his \nbest - smiles back - lets go of the handrail - takes another step - \nfinally reaching the bottom floor. \n\nHe stands there for a long moment - lost as to where to move. A \nglimpse towards the rain sculpture and he starts towards it using \nthe sound to help guide him. \n\nAmy looks over - sees Virgil moving across the floor - gives him a \nlittle wave - he doesn't notice her. \n\nAt the rain Virgil stands taking in the sound. A FIGURE comes up \nnext to him. \n\nVIRGIL \nQuite a party. Love the detail of the building.\n\n\nWEBSTER \nSometimes the detail doesn't matter.\n\n\nVirgil stops - turns to Webster. \n\nVIRGIL \nRay. What are you doing here?\n\n\nWEBSTER \nAaron called me. He was worried. \nI've been trying to find you - \nAmy's office told me you were \nhere. It's bad?\n\n\nVIRGIL \nIt's almost gone. Last few days \nhave been pretty bad.\n\n\nWEBSTER \nObviously Amy doesn't know.\n\n\nVIRGIL \nIt's going to break her heart. \nThis is her big night - I didn't \nwant to ruin it. Thought I could \npull it off.\n\n\nWEBSTER \n(beat) \nYou can't avoid this forever.\n\n\nVirgil turns back towards the rain. \n\nVIRGIL \nI know \n(beat) \nSo Ray? Is it better to have seen and \nlost than never to have seen at all?\n\n\nWEBSTER \nI thought it was loved and lost.\n\n\nAmy comes up to them. \n\nAMY \nDr. Webster - this is a surprise.\n\n\nWEBSTER \nVirgil invited me - wanted to show \nyou off I think. The place is terrific \n- he's got every right to be proud.\n\n\nAMY \nThank-you. I need Virgil for a \nmoment - schmoozing time.\n\n\nWEBSTER \nShmooze away.\n\n\nVIRGIL \n(as he's led away) \nThanks Ray. I'll call you.\n\n\nANGLE ON - Duncan standing anxiously with Falk and his wife Donna as \nthey arrive. \n\nAMY \nVirgil - I'd like you to meet Jack \nFalk and his wife Donna up from Atlanta.\n\n\nVIRGIL \nPleased to meet you.\n\n\nDONNA \nAmy tells us you were blind.\n\n\nAmy spurts out a glass of wine. Virgil deflects the comment. \n\nVIRGIL \nThat's OK - nice to see someone so honest.\n\n\nFALK \nAmy tells us you're her inspiration. \nAny help you can give us with our project?\n\n\nVIRGIL \nI'm a little biased but I kind of \nliked Amy's original design.\n\n\nFALK \nBut could we do better.\n\n\nAmy jumps in with. \n\nAMY \nWe could do better, Mr. Falk - a lot better.\n\n\nFALK \nGood, I like that attitude. \nLet's keep trying for perfection.\n\n\nEveryone smiles - Amy wraps her arm around Virgil. \n\nAMY \nThat's right - that's \nwhy I've got Virgil.\n\n\nPleasant laughter all around - and as Amy and the others continue - \nwe push in on Virgil as he takes in this thought. \n\nEXT. NEW BUILDING - NIGHT \n\nVirgil and Amy out front. People leaving - Duncan getting into a \ntown car with Falk and his wife - he looks back - gives the thumbs \nup and climbs in after them. The car pulls away into the night. \n\nVIRGIL \nYou wanna walk - I feel like some air.\n\n\nAMY \nSee what we see? Sure.\n\n\nVIRGIL \nCan I take your arm - eyes a little tired.\n\n\nAs they walk. \n\nVIRGIL \nYou really made the place \ncome alive with that fountain.\n\n\nAMY \nThank-you. \n(beat) \nYou know I've been thinking - you're doing \nso great now - and if we get this new \ndesign job we'd have some extra money\n- I think we should go on a big seeing\ncelebration.\n\n\nVIRGIL \n(taken aback) \nA seeing celebration?\n\n\nAMY \nYeah, maybe in a couple of months. \nI looked into Egypt - we could see \nthe pyramids - we could see it \ntogether for the first time. \nWhat do you say?\n\n\nVIRGIL \nYou know - there is something \nI'd like to see.\n\n\nAMY \nOf course, anything.\n\n\nVIRGIL \nThe Rangers play tomorrow. Season'll \nbe over before we know it - could be\nour last chance.\n\n\nAMY \nThe Rangers. Sure, why not?\n\n\nBLACK \n\nThen a tiny pinpoint of light ahead - one that grows increasingly \nlarger as we move towards a SOUND. A hum that grows in intensity \nuntil the light fills the frame and BAM - we exit the tunnel and we \nare: \n\nINT. MADISON SQUARE GARDEN - NIGHT \n\nThat glorious first view - people - the white ice shining below like \na giant jewel- and the players - in bright colors scurrying about \nthe playing surface below. \n\nAMY \nThis is amazing - isn't it?\n\n\nShe looks to Virgil who is awed by what he is seeing. Then suddenly \non his face - a flash - one of those moments of darkness. \n\nAMY \nShould we find our seats. Looks \nlike the game's already started.\n\n\nVIRGIL \nYeah - I - I'll follow you.\n\n\nINT. GARDEN - SEATS - LATER \n\nVirgil and Amy in the loge seats - on the aisle - up behind the \ngoal. Amy looking at the stadium while Virgil next to her, watches \nthe game best he can. \n\nAMY \nI love the stadium the \nway it's structure...\n\n\nVIRGIL \nAmy - the game...\n\n\nAMY \nRight - the game.\n\n\nSMASH - a hard check into the boards deep in the Rangers end of the \nice. The puck squirts out Gretzky picks it up - fires it across ice \n- one, two it's back to him and he has a wide open break from center \nice - the crowd is out of their seats - Virgil included - Amy \nquickly getting caught up in the enthusiasm. \n\nOn Virgil's face - watching Gretzky skate towards him - excited - \nthen losing him - another flash of blackness - like a blow to the \nhead - and we hear the crowd suddenly explode - and as Virgil's \nvision regains we see the players mobbing Wayne after his goal - the \nlittle red light behind the net the only evidence of it happening. \n\nWe see the frustration as Virgil realizes he'll never see it. \n\nAMY \nHe scored, he scored - you see \nthat - it was amazing.\n\n\nAs the players make their way to center ice - the crowd sits and Amy \nsees the expression again on his face. \n\nAMY \nWhat? That was good right?\n\n\nVIRGIL \nYeah - it was great - I was just...\n\n\nSuddenly Virgil becomes transfixed. Walking down the aisle, away \nfrom him: \n\nA VENDOR - carrying a tray of PINK COTTON CANDY. \n\nVirgil stares at it a moment - transfixed - then like in a trance - \nhe stands - stepping out into the aisle - a man on a mission. \n\nAMY \nVirgil, where are you going?\n\n\nAnd he's on the stairs - carefully moving down the stairs toward the \nvendor. \n\nThen she sees the Vendor - handing Virgil a large cotton candy - \nround and puffy like a cloud - but something he can hold in his \nhand. Amy can't believe it - watching Virgil - his fascination at \nfinding this long lost memory. \n\nAMY \nThe puffy thing.\n\n\nAngle on Virgil turning - admiring his prize - then looking up, \ntrying to find Amy - who waves to him excited. \n\nHIS POV - scanning the crowd - it's hazy - then flashes of dark. \n\nAmy's face - suddenly drops - it's clear, even though she is only \nfour rows up - he doesn't see her. \n\nINT. MADISON SQUARE GARDEN - NIGHT \n\nGame is over - Virgil is packing up his stuff - Amy staring. at him. \n\nAMY \nVirgil, what's happening?\n\n\nVIRGIL \nJust having a bad eye day. \nA lot to take in.\n\n\nAMY \nTell me. What's going on?\n\n\nVIRGIL \nNothing. I see almost nothing.\n\n\nAmy: she feels like she's about to explode. \n\nAMY \nOh God.\n\n\nVIRGIL \nIt's OK.\n\n\nAMY \nOK?!!\n\n\nVIRGIL \nIt's OK for you to cry.\n\n\nAMY \n(recovering) \nNo, no - I'm not going to cry. \nSolve the problem. We made it \nthrough one operation - we'll \nmake it through another. We won't\ngive up. We'll get this right \n- we just need to...\n\n\nVIRGIL \nI saw Dr. Aaron. \nThere's nothing they can do.\n\n\nAMY \nThen we'll find another Doctor. \nThere's got to be someone else. \nWe'll find something that works.\n\n\nVIRGIL \nDon't you get it - \nI can't go through this again.\n\n\nAMY \nSo just like that - we just forget it - \ngive up? Why the hell haven't you told\nme what was going on?\n\n\nVIRGIL \n(whirls on her) \nBecause of this!!\n\n\nAMY \nWhat this?\n\n\nVIRGIL \nYou! Not letting it go - thinking \nthere's a solution. Goddamit, \nI'm not design flaw in your fucking \nwork that you can just change to \nmake work Or throw away because \nit doesn't meet your expectations. \n(beat) \nLet's face it - it's over!!\n\n\nAMY \nVirgil, give it time, you'll see.\n\n\nVIRGIL \nNo! I won't! This conversation is ended!!\n\n\nINT. AMY'S APARTNENT - NIGHT \n\nThe door swings open - Amy and Virgil enter - Virgil moves towards \nthe bed - pulls out his duffel bag. \n\nAMY \nWhat are you doing?\n\n\nVIRGIL \nI'm leaving.\n\n\nAMY \nWhat do you mean leaving - you're \nleaving this apartment - you're \nleaving New York - you're leaving me?\n\n\nVirgil turns - they stand across the room from each other - miles \napart. \n\nVIRGIL \nI'm going home.\n\n\nAmy walks toward him, picking a battle, rejection. \n\nAMY \nSo you're big sister can take care of you - \nfeed you TV dinners for of your life.\n\n\nVirgil tries to side step her. \n\nVIRGIL \nI'm not going to go through this bullshit again.\n\n\nAmy moves in front - confronting him \n\nAMY \nIs that what this has all\nbeen to you - bullshit?\n\n\nVIRGIL \nYes!! Who the hell were we fooling? \nI'm blind - I'm not meant to see \n- I don't belong here.\n\n\nAMY \nGod damn right you're blind. You want to \nlive in your own little world - this perfect \nworld that your sister built for you \n- where no one can touch you ... where no \none can reach you.\n\n\nVIRGIL \nDo you know the reason why I remembered the \ncotton candy all those years? Because I went \nto the game with my father. And it's the \nonly good thing I can remember about him. \nThe rest is him pushing me to be something\nI'm not - then turning his back on me the \nminute his plans fail.\n\n\nAMY \nI am not turning my back on you. \nYou want me to give up on you \n- you love the self pity.\n\n\nVIRGIL \nI don't want you to give up on ME. \nBut you won't give up on me seeing.\n\n\nAMY \nBecause there must be other options.\n\n\nVIRGIL \nNot anymore.\n\n\nVirgil, avoiding her, sidesteps quickly past her - straight into the \nlamp, which crashes to the ground and breaks. \n\nDARKNESS. \n\nVIRGIL \nDammit.\n\n\nA short few steps then a much larger crash - the sound of a large \nheavier thing breaking. \n\nAMY \nVirgil!!\n\n\nAmy feels her way to the lights - and turns them on. We see that \nVirgil has collided with Amy's sculpture of the woman. He sits among \nthe pieces on the floor. \n\nVirgil - feeling the damage. \n\nAMY \n(going to him) \nIs anything broken?\n\n\nVIRGIL \nNo - no bones are broken.\n\n\nVirgil uses the wall to stand - then - with his hands out in front \nof him he finds his way to the bed. \n\nVIRGIL \nIt's finished - can't you see that! \nWe both didn't get what we wanted.\n\n\nAMY \n(quietly) \nI never meant to hurt you.\n\n\nVIRGIL \nWhen you asked me to come here - \ndid you ever think this wasn't going \nto work - that for one minute I may \nnot be able to see. \n(beat) \nDid you ever think it would be OK \nto have a relationship with a blind man?\n\n\nAmy - a pause.. Too long. \n\nVIRGIL \nThere's my answer.\n\n\nAnd he grabs his duffel and pack - throws the last few things in - \nand moving to the door - leaves. \n\nINT. BUS - NIGHT - RAINING \n\nVirgil riding - crossing the George Washington Bridge - going home. \nHe looks out the window - sees the receding city - and he closes his \neyes - listens to the rain. \n\nEXT. PINECREST - MAIN STREET - NIGHT \n\nThe Bus comes down the main street of Pinecrest. Stopping - the bus \ndoor opens and Virgil gets out - and turns to face up the street - \nthe street he knew so well that is so foreign to him right now. \n\nEXT. VIRGIL AND JENNIE'S - NIGHT \n\nThe door opens. Jennie smiles warmly, reaches out to him. \n\nJENNIE \nWelcome home.\n\n\nINT. HOME - NIGHT \n\nVirgil and Jennie entering his place - to be greeted immediately by: \n\nSOPHIE bounding across the floor towards them - tail wagging - \ntongue hanging out. \n\nVIRGIL \nSophie!?\n\n\nAnd he bends down to hug her. Sophie laps at his face. Virgil holds \nher back to get a good look at her. \n\nVIRGIL \nLet me look at you. \nYou're so beautiful.. yes.\n\n\nJennie watches her brother - happy to have him home. Hoping to get \nhim back to 'normal'. \n\nINT. VIRGIL'S HOME - LATER \n\nVirgil walks around, touching things, seeing the simplicity of his \nlife. Nothing on the walls - no decorations - no plants. Everything \nfunctional. He realizes this is a home designed by his sister. \n\nHe moves over to the photo of the family. He on his dad's shoulders. \nStares at it - at his father and mother for the first time. \n\nJENNIE \nMom and dad. \n\nVirgil just stares. \n\nJENNIE \nEverything's as you left it. \nNothing's changed.\n\n\nVIRGIL \nJen - I'm pretty tired - \nI'd like to be alone.\n\n\nThe PHONE rings. Rings again. Virgil doesn't move - his apprehension \nis clear - he knows who it is. Jennie sees this and moves toward the \nphone. \n\nVirgil turns and walks out onto the front porch - followed by \nSophie, as his sister picks up the phone in the background. \n\nEXT. VIRGIL'S PORCH - NIGHT \n\nHe sits down - looks into the night as we hear Jennie faintly on the \nphone. A beat and she hangs up. We hold on Virgil: \n\nEXT. PINECREST STREET - DAY \n\nVirgil walks down Main street. Seeing his town - a town he grew up \nin but now seems so foreign. Virgil seems oddly disturbed by what he \nsees. \n\nThe yellow bus drives by - full of kids - Carl at the helm. Somehow \nit's not what he expected. \n\nINT. ROSWELL-TRRMONT DESIGN FIRM - DAY \n\nAmy organizing all her work on the Atlanta project - - the original \ndesigns - the new design with the trees - then she sees: \n\nThe sketch she made of the \"dancing trees\". Her eyes hold - and she \nslowly shuts them - and with them tightly closed - her hand reaches \nout and runs along the drawings. \n\nEXT. PINECREST - END OF MAIN STREET - DAY \n\nWe find Virgil standing - looking out at the end of the street where \nhe stood with Amy. In front of him he sees: \n\nThe \"dancing trees\". \n\nVIRGIL'S POV - a retinal spark - a quick glimpse of the intertwined \ntrees - one lover choosing between two others. \n\nINT. FIREHOUSE - LATE DAY \n\nVirgil - stands in the middle of the room. Looks about at what was \nat one time so special to him. Now it just seems old and dingy - the \nmagic is gone. \n\nHe closes his eyes for a moment - listens - cocks his head to the \nleft - the right - but there is nothing there. \n\nEXT. TOWN LIBRARY - LATE DAY \n\nVirgil standing outside - staring at a building he's never seen - \nnever been inside. \n\nHIS POV: flickering a moment. \n\nINT. LIBRARY - SUNSET \n\nVirgil now sits at a table. Stacks and stacks of LIFE magazine \nsplayed out in front of him. He is flipping through them at a rapid \nrate - like a drowning man searching for air. \n\nIMAGES - cars, JFK, the pyramids, Martin Luther King, houses, \nflowers, Marilyn Monroe, that Napalm burned little girl in Viet Nam, \nAfrican masks, Dachau prisoners, Nixon, Warhol paintings, the Mona \nLisa, that vulture watching over the little baby, the Eiffel tower, \nFirst Man on the moon, the Venus De Milo, that guy in front of the \ntank in Tianaman square .. and the Pyramids. \n\nThe pictures go by fast and furious - Virgil soaking them up like a \nsponge - life, beauty, horror, great people, great events... \n\nAnd we move in on his face - absorbing these images for the last \ntime - a face filled with anguish at a world disappearing. And we \ncut to: \n\nEXT. AMY'S ROOF - SUNSET \n\nGolden rays of the late afternoon sun. Amy on the roof - leaning on \nthe parapet - watching the horizon. \n\nThen a thought comes to her. And mimicking what Virgil had done - \nshe walks back to the other end of the roof, turns and looks out \ntowards the skyline again ... then starts slowly walking towards the \nparapet till she reaches the wall again. \n\nThe reaction on her face - she doesn't \"see\" it - not like Virgil \ndid. \n\nINT. VIRGIL'S HOME - DAY \n\nVirgil is shifting furniture in his house. A table - moves it to the \nwindow - moves a chair to join it - stands back to have a look at \nit. \n\nHIS POV - a moment of clear - then haze - then dark - then haze. \n\nVirgil rubs his head - these last days of sight have been painful \nand exhausting for him. \n\nJENNIE (O.S.) \nHello! \n\nShe's at the door. Virgil cocks his head in her direction. \n\nJENNIE \nI picked up some things at the store - \nT-shirts, I'm sure you're out, some socks...\n\n\nVIRGIL \nJennie, what's at the \nend of Main Street?\n\n\nJENNIE \nWell - I think it's Vivian's little stationery...\n\n\nVIRGIL \nBeyond all the stores - past firehouse. \nWhat happens when this is no more Main Street?\n\n\nJENNIE \nWell - there's nothing really - you know that. ~ \n\nVIRGIL \nNo! You told me that's all there was. \nThat's wrong. There's a helluva lot out there.\n\n\nJennie surprised at where this is going. \n\nJENNIE \nI told you what you needed to know.\n\n\nVIRGIL \nWhat was within my reach.\n\n\nJENNIE \nWhat more do vou want?\n\n\nVIRGIL \nIsn't there anything more that vou want?\n\n\nJENNIE \nIs this about our father -\nhe called told me...\n\n\nVIRGIL \nNo. This isn't about him. Jennie - \nyou've spent your whole life as \nblind as I was. The world doesn't \nstop within our reach.\n\n\nJENNIE \nVirgil, please. This is your home. \nStop thinking about what's out there \n- things that will never matter to you. \nYou're safe here where everyone...\n\n\nVIRGIL \nWhere everyone what!?\n\n\nJENNIE \nKnows you.\n\n\nVIRGIL \nCan protect me?! (beat) \nJennie, this place was a wonderful safe \nhaven for me growing up. I know that. \n(looking around) \nAnd I can only imagine what you gave up \nto keep this world for me. I thank you \nand love you from the bottom of my soul. \nBut now I want to give you your life back.\n\n\nJENNIE \nVirgil, I - I can't...\n\n\nVIRGIL \nYou can\n\n\nVirgil reaches out his arms for her to join him. \n\nVIRGIL \nI'm reaching out, Jennie.\n\n\nThis gets Jennie and she goes to him, really hugging him for the \nfirst time as tears flow from her eyes. \n\nINT. AMY'S LOFT - LATE DAY \n\nAmy, dressed in sweat pants and tee shirt sitting on the ground, \ntrying to piece the sculpture back together. It's a difficult fix. \n\nKNOCK KNOCK \n\nDUNCAN \nAmy - you in there.\n\n\nAMY \nGo away.\n\n\nShe scrapes some plaster into a dust pan. We hear enters a key in \nthe door - and the door opens. Duncan \n\nDUNCAN \nI knew keeping this key would come in \nhandy one day. What a mess - what happened?\n\n\nAMY \nIt broke - I'm trying to fix it.\n\n\nDUNCAN \nSo - guess what?\n\n\nAMY \nI'm not in the mood for games.\n\n\nDUNCAN \nWe got it. The goddamned Atlanta mall - \nwe got it!! Now - pull yourself out of this \nslump - I want you to fly down this week to...\n\n\nContinuing to work on the sculpture. \n\nAMY \nI'm not going.\n\n\nDUNCAN \nWhat are you ta1king about? \nWhat's the problem here?\n\n\nAMY \nThe problem?! Everything. \nNothing is right thank-you very much.\n\n\nDUNCAN \nYou know what the problem is - you're \nthe problem - you met a blind guy you \nthought was cool and spent the first \ntwo months trying to change him.\n\n\nAMY \nAre you finished?\n\n\nDUNCAN \nNot even close. Let me tell you something \n- you can't change people to solve you. \nYou tried to do it with me - you tried \nto do it with Virgil. You ever think \nsome of the things you try to fix \n- ain't broke.\n\n\nAnd he's gone - as Amy slumps into a chair - confused, tired - then \nslowly she starts to hear: \n\nTAP - TAP - TAP...TAPTAP - TAP \n\nThe SOUND of a CANE in the stairwell! Amy's heart starts racing - \nshe takes a breath - jumps up quickly and moves her way over to the \ndoor - unlocking it and swinging it open: \n\nAMY \n(excitedly) \nVirg .......\n\n\nThe CANE - being held by Ethan - as he taps his way down the stairs. \n\nETHAN \nHey Amy.\n\n\nAMY \nHi, Ethan. Sorry - I thought...\n\n\nETHAN \nHe's not coming back is he?\n\n\nAMY \nNo - he's not.\n\n\nEthan sees she's covered in dust - looks past her into the loft. \n\nETHAN \nWhatcha doin'?\n\n\nHe looks past her at the sculpture half repaired. \n\nAMY \nCleaning up a mess - going to start over.\n\n\nEXT. PINECREST - SUNSET \n\nVirgil walks the path, Sophie following close behind. By the way he \nwalks, counting steps, touching landmarks, we realize he is using \nsight very little. \n\nEXT. HIDDEN VALLEY - SUNSET \n\nComing through the clearing, to the plateau where he took Amy, the \nleaves now starting to turn golden colors - he stops - stands over \ntop of the pond. \n\nVIRGIL'S POV - A retinal spark. The view across the valley, with \nwhite clouds against the bluest sky. \n\nHis hand reaches out - to touch the edge of the world - to touch the \nhorizon. \n\nAnd as he drops his hand, we see the clouds start to race by - while \nthe blue sky goes golden then drifts into darkness. Virgil doesn't \nmove from the spot. The screen goes almost black - then slowly the \nsun starts to rise in the east. \n\nVirgil makes no movement. A long beat - then - as the sun moves \nacross him - he realizes it's day. He stands and unfolds his cane. \nIt's clear he has returned to being completely blind. \n\nAs he turns and starts his way down the hill we hear: \n\nVIRGIL (V.O.)\nGrowing up blind - I had two dreams. \nOne was to see. The other - to play \nfor the New York Rangers.\n\n\nINT. LECTURE HALL - N.Y. EYE INSTITUTE - DAY \n\nVirgil stands at the podium speaking - dark glasses on, cane in \nhand. \n\nVIRGIL \nAfter the 'miracle' of my short period of \nsight - I realize - I'd rather play for the Rangers. \n(laughs from the dark) \nIt's not that it was so awful - I saw many \nthings - some good, some back some that \nI'm already forgetting.\n\n\nINT. WEBSTER'S LAB - NYU \n\nVIRGIL (V.O.)\nBut I realized that our eyes aren't what \nmake us see. We only live in darkness \nwhen we don't look - look at what is \ngenuine about ourselves - genuine \nabout others - you don't need eyes for that.\n\n\nVirgil sitting with three young blind children - working through \nBraille with them. Webster watches from the corner of the room. \n\nEXT. NYU - DAY \n\nVirgil - small brown bag in one hand - cane in the other - exits the \nbuilding and makes his way across the street to Washington Square. \n\nEXT. WASHINGTON SQUARE - DAY \n\nVirgil - taking in the sun - finishing off the last of his sandwich. \nBalling up his paper bag - he taps his cane out - finds the garbage \ncan nearby - and tosses the bag - rim shot - it misses, hits the \nground. A hand reaches into frame and puts the bag in the garbage. \nVirgil looks up - senses the presence. \n\nVIRGIL \nDid I miss?\n\n\nVOICE (O.S.) \nBy a mile.\n\n\nVIRGIL \nAmy?\n\n\nANGLE ON Amy: watching Virgil - realizing his sight is gone. \n\nAMY \nRay told me you were living in town \n- said I could find you here. \n(beat) \nI rushed, didn't I? Fourteen steps \nto the tree and I made us smash \nright into it.\n\n\nVIRGIL \nWe tried.\n\n\nAmy sits next to him. \n\nAMY \nI finished the sculpture. \nI'd love you to see it.\n\n\nVIRGIL \nFigure of speech.\n\n\nAMY \nFigure of speech. Virgil - when I \nfirst met you - you saw more than \nany sighted person I've ever known. \nI didn't mean to take that away from you.\n\n\nVIRGIL \nAmy. I saw ... I actually saw \nthe horizon. You did that for me. \nIt's out there. You showed me you \njust have to reach for it..\n\n\nAmy smiles - her hand goes out - hesitates - then lands lightly on \nhis. \n\nAMY \nYou want to walk?\n\n\nVIRGIL \nSee what we see?\n\n\nAMY \nYeah. Just see what we see.\n\n\nVirgil smiles, nods. As he stands - he takes her arm - and as they \nwalk off into the park, we slowly FADE to BLACK and just LISTEN, \nlisten to the SOUNDS of the day - the percussion of the city. \n\nTHE END\n\n\n\n\n\n\n\n\n\n\n\nAt First Sight\nWriters :   Oliver Sacks  Steve Levitt  Irwin Winkler  Rob Cowan\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:48.742097"}