{"title": "Autumn in New York", "film_link": "/Movie Scripts/Autumn in New York Script.html", "script_link": "/scripts/Autumn-in-New-York.html", "info_raw": "\n\nAutumn in New York Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Allison Burnett\nGenres  Romance  Drama\nMovie Release Date : August 2000\n\nRead \"Autumn in New York\" Script\n\n\n", "script": "\n\n\n\n                                    AUTUMN IN NEW YORK\n\n                                      Screenplay by\n\n                                     Allison Burnett\n\n                                      Shooting Draft\n\n\n                                                                      2000\n\n                \n\n               FADE IN:\n\n               EXT. CENTRAL PARK -- SEPTEMBER AFTERNOON\n\n               A COUPLE moves down a walkway, deep in subdued conversation. \n               All around them trees explode with autumn color. Birds sing. \n               Their path is dappled with leafy shadow.\n\n               To their left, on the sunny meadow, TEENAGERS throw saucers \n               and footballs, smoke cigarettes and joints, drink beer and \n               soda, savoring the waning hours of summer.\n\n               CLOSER ON THE COUPLE\n\n               He is WILLS KEANE, late 40's to early 50's, strikingly \n               handsome, impeccably dressed, and supremely poised. At first \n               glance he has the proud glow of a hedonist who in the war \n               against time has been the undisputed victor.\n\n               Only a closer look hints at the toll of battle. His shoulders \n               strain under the weight of so much repetition. His eyes are \n               touched by regret. The lines in his face reveal an emerging \n               disenchantment not so much with the world as with himself.\n\n               Walking at his side is a WOMAN, 30, attractive and bright. \n               Her name is unimportant because so many have come before her \n               and, if the past prevails, so many will come after.\n\n               She listens intently, as Wills finishes speaking --\n\n                                     WILLS\n                         -- and I could have waited to tell \n                         you, but I wanted to leave no room \n                         for misunderstanding.\n\n                                     WOMAN\n                         Well, you certainly didn't.\n\n               EXT. ANOTHER CENTRAL PARK WALKWAY -- LATER\n\n               Still talking quietly, they pass into a more secluded area \n               of the park--\n\n                                     WOMAN\n                         No, I see how you could feel this \n                         way. Of course I do. It's human. But \n                         what I don't get is why you'd want \n                         to announce it so quickly. I mean, \n                         we just met. Feelings change. You \n                         don't even know me.\n\n                                     WILLS\n                         Yes, I do.\n\n               She is amused by his confidence --\n\n                                     WOMAN\n                         Oh, really?\n\n                                     WILLS\n                         The minute I laid eyes on you. It's \n                         the saddest thing about getting older. \n                         You know people so quickly. I even \n                         knew you'd end up hating me.\n\n                                     WOMAN\n                         Well, you're wrong. I don't.\n\n                                     WILLS\n                              (with a weary smile)\n                         Give it time.\n\n               She laughs. Then he stops. He hears something. She stops. \n               She hears it, too. It's a GIRL'S VOICE. He casually turns \n               and looks, squinting into the sun.\n\n               He takes a few steps and there, between trees, he sees TWO \n               DOZEN PEOPLE sitting on the grass and on folding chairs -- \n               most are middle-aged or older with a distinctly intellectual-\n               bohemian look to them.\n\n               Standing and addressing them is CHARLOTTE FIELDING, 19, fair, \n               willowy, pale, lovely in an unconventional way. She wears an \n               eccentric hat and a vintage dress. Her bearing is upright, \n               her gaze warm and intelligent, her voice rich with emotion --\n\n                                     CHARLOTTE\n                         -- and for weeks I sat by her bed \n                         and cried. I told her I loved her \n                         and I begged her not to leave me. \n                         All I could think about was what I'd \n                         lose if she died. And then one \n                         night... she was in really bad pain... \n                         I stopped thinking about myself for \n                         a second and I thought about her.\n                              (fighting tears)\n                         I stopped crying. I said goodbye. \n                         And in less than an hour Ella was \n                         gone.\n\n               The woman whispers in Wills' ear --\n\n                                     WOMAN\n                         It's so sad.\n\n               But Wills ignores her. He watches Charlotte with keen \n               interest, touched by the depth and sincerity of her emotion.\n\n                                     CHARLOTTE\n                         I really think it's possible to hold \n                         a person back... cry them back... \n                         from dying. That's what I did to \n                         Ella and I'll never do it to anyone \n                         else again.\n                              (softly)\n                         I hope no one ever does it to me.\n\n               She looks out at the group, many of whom are crying. A tear \n               runs down her cheek. She smiles and wipes it away.\n\n               The woman, seeing Wills' interest in the girl, whispers --\n\n                                     WOMAN\n                         So what do you know about her?\n\n               He knows a great deal. Or at least he thinks he does. But \n               his answer is nonchalant --\n\n                                     WILLS\n                         That she's just a kid.\n\n               He takes the woman gently by the elbow and guides her away. \n               He steals one last look back.\n\n               Charlotte, returning to where she was sitting, notices Wills. \n               Their eyes meet and a charge passes between them.\n\n               Meanwhile an OLD MAN has risen from his chair --\n\n                                     OLD MAN\n                         I met Ella at City College in 1938...\n\n               Wills slowly turns and walks away.\n\n               MUSIC AND TITLES IN:\n\n               EXT. MANHATTAN SUBWAY STOP -- AUTUMN DUSK\n\n               A SWARM OF PEDESTRIANS ascends the steps to the bustling \n               street.\n\n               FIND CHARLOTTE amid the swarm, struggling with a load of \n               BOXES and SHOPPING BAGS, carrying an antique, wood-and-wire \n               DRESSMAKER'S MANNEQUIN.\n\n               She wears a peasant dress with a cycle jacket, a backpack, \n               and another eccentric hat.\n\n               EXT. WASHINGTON SQUARE PARK -- DUSK\n\n               Charlotte makes her way down the leaf-strewn pathway. Wheeling \n               the mannequin by the neck, she passes NYU STUDENTS smoking, \n               laughing, and chatting on their way to class.\n\n               EXT. WEST VILLAGE AVENUE -- DUSK\n\n               Charlotte hauls the mannequin down the block. A YOUNG MAN \n               offers her assistance, but she politely and firmly refuses.\n\n               EXT. WEST VILLAGE STREET -- DUSK\n\n               Charlotte wearily hauls the mannequin across the cobblestone \n               street, over the curb, and up to the stoop of a charming but \n               slightly dilapidated BROWNSTONE.\n\n               INT. BROWNSTONE FOYER -- DUSK\n\n               Charlotte opens the door into the darkness. She hits a light \n               switch and nothing happens. She flips it back and forth --\n\n                                     CHARLOTTE\n                         Shit.\n\n               She dumps her boxes and bags, then wheels in the mannequin.\n\n                                     CHARLOTTE\n                         Dolly! The bulb burned out!\n\n               MUSIC AND TITLES OUT:\n\n               INT. BROWNSTONE LIVING ROOM -- SAME\n\n               EIGHT SILHOUETTES are crouched in the dark room. The mantel \n               is draped with a HAPPY BIRTHDAY BANNER. The coffee table is \n               stacked with WRAPPED GIFTS.\n\n               INT. FOYER -- SAME\n\n               Charlotte looks suspiciously at the living room door --\n\n                                     CHARLOTTE\n                         Dolly?\n\n               She tiptoes through the darkness and lays her ear against \n               it.\n\n               INT. LIVING ROOM -- SAME\n\n               We hear chuckles and whispers of anticipation. An older \n               woman's raspy, boozy voice growls --\n\n                                     RASPY VOICE\n                         My ass hurts.\n\n               A few people chuckle, but they're quickly hushed. The DOOR \n               KNOB TURNS and the DOOR OPENS. Everyone leaps up in a blaze \n               of light --\n\n                                     ALL\n                         SURPRISE!\n\n               The MANNEQUIN bursts into the room, teetering crazily, wearing \n               CHARLOTTE'S JACKET, BACKPACK, and HAT.\n\n               Everyone FLINCHES and SCREAMS. Amid a chorus of laughter, \n               Charlotte enters. Grinning, she wags a facetious finger --\n\n                                     CHARLOTTE\n                         See? Surprises suck!\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               An antique clock ticks crisply on the dresser. Wills stands \n               before a mahogany mirror, buttoning a freshly laundered white \n               shirt.\n\n               Lying on the cradle bed, half-wrapped in a sheet, naked but \n               for a string of pearls, is TANYA, 35, raven-haired, much too \n               thin. She smokes a cigarette.\n\n                                     TANYA\n                         Oh, Wills, please, not again. It's \n                         our third date and we're already in \n                         a rut.\n\n                                     WILLS\n                         But I thought you loved it.\n\n               She stretches with her cigarette but before she can make it \n               to the ashtray, her ASH FALLS on a New York magazine.\n\n               On the cover is a PHOTOGRAPH OF WILLS standing next to a \n               YOUNG CHEF in a fashionable restaurant. The caption reads: \n               \"The Prodigal Son Returns.\"\n\n                                     TANYA\n                         Oh, I do -- except for the fact that \n                         there isn't a single thing on the \n                         menu I can eat.\n\n                                     WILLS\n                              (with a chuckle)\n                         Sure, there is; there's just very \n                         little you're willing to digest.\n\n               He slips in a cuff link. She affects a breezy indifference --\n\n                                     TANYA\n                         Fine then. We'll go, I'll get big, \n                         fat, and horrible, and it'll serve \n                         you right.\n\n               Wills slips on a silk tie --\n\n                                     WILLS\n                         No, it won't. Because it takes at \n                         least a few weeks to get fat and by \n                         then you won't even be speaking to \n                         me.\n\n                                     TANYA\n                              (curiously)\n                         Why do you say that?\n\n               He stops tying his tie and stares at her in the mirror --\n\n                                     WILLS\n                         Because we have no future. All I can \n                         offer you is this... what we have \n                         right now... nothing more \n                         meaningful... until it ends.\n\n               He goes back to tying his tie, then adds softly --\n\n                                     WILLS\n                         I could have waited to tell you, but \n                         I wanted to leave no room for \n                         misunderstanding.\n\n               She stares at him, speechless.\n\n               INT. RESTAURANT -- THAT NIGHT\n\n               Its decor is exquisitely tasteful, its ambiance warm and \n               convivial. The night is in full swing. Most of the tables \n               are taken and the bar is packed.\n\n               EXT. UPPER EAST SIDE -- SAME\n\n               From amid the RUSH OF TRAFFIC, a TAXI breaks free and glides \n               to the curb in front of the RESTAURANT.\n\n               Its facade is windowless. Only a small brass plaque on the \n               grey marble reveals that this is ELYSIUM.\n\n               Wills and ERIKO, 30's, Japanese, aloof and stunning, emerge \n               from the taxi, elegantly dressed, and move to the front door.\n\n               INT. ELYSIUM -- CONTINUOUS\n\n               TWO TIPSY DEBUTANTES pass Wills and Eriko as they enter. One \n               recognizes Wills and smiles flirtatiously.\n\n               Wills stops and helps Eriko off with her jacket. JESUS, 30, \n               the dashing Cuban-American maitre d', superbly discreet, \n               approaches --\n\n                                     JESUS\n                         Good evening, Mr. Keane. Will you be \n                         dining with us tonight?\n\n                                     WILLS\n                         We certainly will. Table seven, Jesus, \n                         if it's available.\n\n                                     JESUS\n                         Yes, sir.\n\n               Wills hands Eriko's jacket to MELISSA, 20, the hat check \n               girl --\n\n                                     WILLS\n                         How are you, Melissa?\n\n                                     MELISSA\n                              (blushing)\n                         Fine, Mr. Keane.\n\n               CELIA, mid-20's, the chipper, blonde Midwestern hostess, \n               arrives, wearing a stunned, glassy smile.\n\n                                     WILLS\n                         Good evening, Celia. And how --\n\n                                     CELIA\n                              (with forced cheeriness)\n                         Just dandy, sir, thanks!\n\n                                     JESUS\n                         Table seven.\n\n                                     CELIA\n                         This way, please.\n\n               Celia, barely making eye contact with Eriko, walks quickly \n               away. Wills is amused and a little confused by Celia's \n               behavior. He lays a hand on Eriko's back --\n\n                                     WILLS\n                         I'll be right with you.\n\n               Eriko nods and follows Celia.\n\n               Wills moves to the reservation stand where his best friend \n               and the restaurant's manager, JOHN VOLPE, 40, a brilliant, \n               dapper, tough as nails Brooklynite stands, listening to \n               someone on the telephone.\n\n               Wills lays a hand on his shoulder and mutters into his ear --\n\n                                     WILLS\n                         How's it going?\n\n                                     JOHN\n                              (covering the phone)\n                         Chaos.\n\n                                     WILLS\n                         The house specialty.\n\n                                     JOHN\n                         Easy for you to say, ya prick. \n                         Waltzin' in here like you own the \n                         joint.\n\n               Wills laughs and takes a look into the bar. John gestures \n               with his head in Eriko's direction --\n\n                                     JOHN\n                         So who's the new potential ex-wife? \n                         I thought you were still wastin' \n                         time with Tanya-von-What's-her-name.\n\n                                     WILLS\n                         We wisely agreed to cut our losses.\n\n               Wills exits into the bar. John smiles and shakes his head.\n\n               FOLLOW WILLS, as he glides along the bar. CUSTOMERS and STAFF \n               greet him warmly.\n\n               As he enters the main dining room, DINERS spot him -- \n               sprinkled among them are CELEBRITIES from every walk of city \n               life. Wills greets them, stopping to shake their hands and \n               kiss their cheeks.\n\n               Suddenly, Celia, the hostess, red-faced, blocks his path --\n\n                                     CELIA\n                         Look, I have no right to say this, \n                         okay? And you can fire me if you \n                         want, but in the six weeks we've \n                         been open you've brought in six \n                         different women -- tonight makes \n                         seven -- and it's really starting to \n                         get to me.\n\n                                     WILLS\n                         In what way?\n\n                                     CELIA\n                         I have to greet them! It's like \n                         working at a dog shelter! I'm afraid \n                         to learn their names or even smile \n                         at them because I know any minute \n                         they could be put down!\n\n                                     WILLS\n                         I assure you it's an absolutely \n                         painless procedure.\n\n               Shocked, she can't help but sputter a laugh --\n\n                                     CELIA\n                         It is?\n\n                                     WILLS\n                         Sure.\n                              (beat)\n                         Especially for me.\n\n               They both laugh. He moves closer, lowers his voice, and speaks \n               with warm sincerity --\n\n                                     WILLS\n                         Actually, I appreciate your concern, \n                         Celia. The truth is I'm a little \n                         worried myself.\n\n                                     CELIA\n                         Seriously?\n\n                                     WILLS\n                         Seriously. I've been trying to do \n                         better.\n                              (uneasily)\n                         But... you know how it is... old \n                         habits die hard.\n\n                                     CELIA\n                         So I'm not fired?\n\n                                     WILLS\n                         Nope. In fact, John's been looking \n                         for an assistant. Tell him you've \n                         just been promoted.\n\n               Wills smiles, pats her in the shoulder, and moves on. She \n               can't believe it.\n\n               A WAITER carrying a BIRTHDAY CAKE -- blazing with candles \n               and decorated with a WOMAN'S HAT made of MERINGUE LATTICEWORK -- \n               passes by on his way to the REAR DINING ROOM.\n\n               From inside, VOICES begin to sing HAPPY BIRTHDAY. Wills, his \n               curiosity piqued, follows.\n\n               INT. REAR DINING ROOM -- CONTINUOUS\n\n               The waiter sets down the cake at the center of a round table. \n               There's a CHEER and APPLAUSE as the song ends. Wills cannot \n               see whose birthday it is because the waiter blocks his view.\n\n               Just as Wills is about to exit the room, the waiter steps \n               away. Wills glances over and sees the birthday girl. At first \n               he can't place her, but then he does, and his face softens \n               and brightens.\n\n               It's Charlotte. She wears a black velvet dress and a \n               wonderfully eccentric hat. Her eyes glow in the candlelight. \n               Through the chorus of voices, urging her to make a wish, she \n               cries out --\n\n                                     CHARLOTTE\n                         You guys! Let me think!\n                              (concentrating)\n                         Okay. Okay.\n\n               Charlotte blows hard, and, with a little more effort than \n               you might expect, extinguishes the candles. Everyone APPLAUDS \n               and CHEERS.\n\n               To Charlotte's right sits SIMON LORING, late 20's, English, \n               sardonic, adoring. He gestures at her CHEST and says --\n\n                                     SIMON\n                         Watch carefully, everyone -- they \n                         ought to begin emerging any moment \n                         now.\n\n               Everyone laughs. Charlotte playfully slaps him --\n\n                                     CHARLOTTE\n                         Very funny! Actually, any moment now \n                         you're gonna turn straight and fall \n                         at my feet.\n\n                                     SIMON\n                         Oh, darling, you know I would if I \n                         could.\n\n               Charlotte's best friend, SHANNON HARRIS, 19, a spoiled but \n               big-hearted redhead, drowning in curls, mutters --\n\n                                     SHANNON\n                         The only time he falls at your feet \n                         now is when he wants to borrow your \n                         Prada loafers.\n\n               More laughter.\n\n               BACK TO WILLS. He considers approaching Charlotte, but then \n               he looks back and sees Eriko sitting alone at their table, \n               idly stabbing at her drink with a straw.\n\n               Regretting his rudeness, he takes a step toward her, but \n               then hears --\n\n                                     WOMAN'S VOICE\n                         Is that Wills Keane?\n\n               He turns and sees DOLORES TALBOT, 70, blonde wig, spindly \n               frame, weathered skin, large, sad eyes. She holds a mixed \n               drink --\n\n                                     WOMAN\n                         It sure as hell is and he hasn't \n                         changed a bit!\n\n                                     WILLS\n                         I'm sorry, do I --\n\n                                     WOMAN\n                         You little fool, it's Dolores Talbot. \n                         Dolly!\n\n               His smile shows uneasy surprise --\n\n                                     WILLS\n                         My God, it is.\n\n                                     DOLLY\n                         Yeah, I know, time's kicked my ass \n                         but good. Come on, Romeo, let's bury \n                         the hatchet. Give me a hug. Careful \n                         of the cocktail.\n\n               As he hugs Dolores, he can't help but look over at Charlotte \n               again.\n\n                                     DOLLY\n                         So what the hell're you doin' around \n                         here? Last I heard you were out in \n                         earthquake country blowin' the family \n                         fortune.\n\n                                     WILLS\n                         Actually, I doubled it.\n\n                                     DOLLY\n                         Good for you!\n\n               ON CHARLOTTE. She looks over. Her view is such that she sees \n               Wills but not Dolores.\n\n               A faint blush creeps into Charlotte's cheeks. She pretends \n               to listen as Shannon tells a story --\n\n                                     SHANNON\n                         -- and you know how bouncer's get. \n                         He's like, \"That's the worst fake \n                         I.D. I've ever seen.\" And I'm like, \n                         \"Yeah? Well, you have the worst dread-\n                         extensions!\" And then just when --\n\n               Noticing Charlotte's distraction, Simon whispers calmly to \n               her --\n\n                                     SIMON\n                         Are you feeling all right? You look \n                         positively green.\n\n               Charlotte speaks under her breath without moving her lips --\n\n                                     CHARLOTTE\n                         He's here. And he's staring at me \n                         again.\n\n                                     SHANNON\n                         No way!\n\n               Both Shannon and Simon turn to look, but like lightning \n               Charlotte grabs them both --\n\n                                     CHARLOTTE\n                         Don't!\n                              (to Simon)\n                         Wait a few seconds, then go to the \n                         bathroom.\n\n                                     SIMON\n                         How will I know him?\n\n                                     CHARLOTTE\n                         He's beautiful. And much older.\n\n                                     SIMON\n                         Really?\n                              (getting up)\n                         If he's rich you might have a fight \n                         on your hands.\n\n               Charlotte watches furtively as Simon rises from his chair \n               and walks over. As he passes Wills, he flashes him a seductive \n               smile. Wills is confused by it.\n\n                                     CHARLOTTE\n                         Okay, look.\n\n               Shannon swivels her head and throws an aloof, vacant stare \n               in Wills' direction. Then she looks back at Charlotte, mouth \n               agape --\n\n                                     SHANNON\n                         He's as old as my dad!\n\n               Charlotte laughs.\n\n               BACK ON WILLS. He does his best to be attentive as Dolores \n               exhales a plume of smoke into his face --\n\n                                     DOLLY\n                         Sure, L.A.'s okay if you're a cactus \n                         or a lizard, but if you're a New \n                         Englander, your soul dries up and \n                         blows away like a god damn leaf.\n\n                                     WILLS\n                         It only took me twenty years to come \n                         to my senses.\n\n                                     DOLLY\n                         So what're you doin' now? You owned \n                         some restaurants out there, didn't \n                         you?\n\n               ON CHARLOTTE. She sits listening to Shannon --\n\n                                     SHANNON\n                         And so, after all that, we pay our \n                         cover, we get in, and it's totally \n                         heinous! Nothing but losers and --\n\n               Charlotte looks over and pales, her eyes widening --\n\n                                     CHARLOTTE\n                         Oh, shit.\n\n                                     SHANNON\n                         What?\n\n               Dolores walks up, hauling Wills by the arm --\n\n                                     DOLLY\n                         Kids! I want you to meet an old chum \n                         of mine, the owner of this fine \n                         establishment -- Wills Keane!\n\n               The table greets him. Wills, slightly self-conscious, looks \n               at everyone but Charlotte.\n\n                                     DOLLY\n                         And that over there's the birthday \n                         girl -- my granddaughter, Charlotte.\n\n               The news hits Wills hard. But he does his best to hide it. \n               He musters a casual smile --\n\n                                     WILLS\n                         Not Katie and Jay's daughter?\n\n                                     DOLLY\n                         You bet. She got her height from her \n                         dad. But her talent's all Katie's.\n\n               Dolores indicates the hat that Charlotte's wearing --\n\n                                     DOLLY\n                         Made it herself from scratch. That \n                         one, too.\n                              (to Shannon)\n                         Honey, show 'im.\n\n               Shannon makes an elaborate comic show of modeling the hat \n               she's wearing. The table laughs.\n\n               Wills levels his gaze at Charlotte --\n\n                                     WILLS\n                         Impressive.\n\n               Try as she might to accept the compliment with grace, \n               Charlotte can't help but grin.\n\n                                     CHARLOTTE\n                         Thanks.\n\n               The WINE STEWARD stands at a station on which sit TWO BOTTLES \n               OF CHAMPAGNE on ice. He reaches for one. Wills stops him --\n\n                                     WILLS\n                         I think we can do better than that.\n\n               The steward, understanding, nods and departs, taking the \n               champagne with him.\n\n                                     WILLS\n                         Happy birthday, Charlotte.\n\n                                     CHARLOTTE\n                         Thanks.\n\n                                     SHANNON\n                              (under her breath)\n                         Twenty years old and never been...\n\n                                     CHARLOTTE\n                              (laughing)\n                         Shut up!\n\n               Amused, he flashes Charlotte his most dazzling smile.\n\n                                     WILLS\n                         I'll let you get back to your \n                         celebration.\n                              (kissing Dolly's cheek)\n                         A pleasure to see you again.\n\n                                     DOLLY\n                         Same here.\n\n               Wills turns to exit. Simon, returning to his seat, murmurs \n               seductively to Wills as he passes by --\n\n                                     SIMON\n                         Leaving so soon?\n\n               Wills looks at him, confused again, then continues on. As \n               Simon sits, he mutters to Charlotte --\n\n                                     SIMON\n                         Be still my beating heart.\n                              (beat)\n                         Or is that your heart?\n\n                                     SHANNON\n                              (whisper to Charlotte)\n                         You're not really into him, are you?\n\n               Charlotte turns to Dolores who has just sat down.\n\n                                     CHARLOTTE\n                         Hey, Dolly, how do you know him?\n\n                                     DOLLY\n                              (uneasily)\n                         From Newport. Old friend of your \n                         mom's.\n\n               Dolores eats a sloppy forkful of birthday cake.\n\n                                                               DISSOLVE TO:\n\n               EXT. WINDOW -- ESTABLISHING -- MORNING\n\n               A gentle breeze tickles a white lace curtain. A PHONE RINGS.\n\n               INT. BROWNSTONE KITCHEN -- SAME\n\n               Charlotte, standing in the small antiquated kitchen, wearing \n               flannel pajamas, tenses when she hears the PHONE RINGING \n               UPSTAIRS. She snatches an apple from a bowl and dashes out \n               of the room.\n\n               FOLLOW CHARLOTTE running through the DINING ROOM... into the \n               LIVING ROOM... into the FOYER... and up a DARK STAIRCASE.\n\n               INT. CHARLOTTE'S BEDROOM -- MORNING\n\n               A startling clash of childhood, adolescence, and womanhood. \n               Everything from stuffed animals to posters of pop icons to \n               volumes of great literature.\n\n               THE PHONE RINGS AGAIN\n\n               Charlotte bangs in, flings herself on the bed, and grabs the \n               phone --\n\n                                     CHARLOTTE\n                         Okay, bitch, I'm ready!\n\n               INTERCUT WITH:\n\n               INT. WILLS' ROOFTOP TERRACE -- MORNING\n\n               Wills sits in his woolen robe, holding a portable phone. \n               Amused, he smiles into the morning sun --\n\n                                     WILLS\n                         For what?\n\n                                     CHARLOTTE\n                         Oh my God, I'm so sorry! Wait. Who \n                         is this?\n\n                                     WILLS\n                         Wills Keane.\n\n               Her heart stops. She sits up slowly, her body tensed.\n\n                                     WILLS\n                         Who did you think it was?\n\n                                     CHARLOTTE\n                         My friend Simon, actually. He always \n                         calls me the morning after to sort \n                         of... you know... sum everything up.\n\n                                     WILLS\n                         And how would you sum it up, \n                         Charlotte? Turning twenty.\n\n                                     CHARLOTTE\n                         Kinda cool, kinda creepy. Anyway, \n                         you wanna speak to my grandmother?\n\n                                     WILLS\n                              (with a chuckle)\n                         I don't think so.\n\n               OLIVIA, 30's, Wills' Jamaican cook and housekeeper, enters. \n               Plump, handsome, and perpetually amused, she carries a tray \n               laden with continental breakfast and a New York Times. Wills \n               mouths a greeting. She smiles back and sets the tray on a \n               table.\n\n                                     WILLS\n                         I called because I'm going to be \n                         attending a benefit... a black-and-\n                         white ball.... and I'd like you to \n                         design a hat... for my date.\n\n                                     CHARLOTTE\n                         Really? Wow. Sounds fun. Okay.\n\n                                     WILLS\n                         It's a gift. I don't have her \n                         measurements, but she's about your \n                         size. What're you, a six?\n\n                                     CHARLOTTE\n                         Uh-huh.\n\n                                     WILLS\n                         Good -- then let's assume your hat \n                         size is also the same.\n\n                                     CHARLOTTE\n                         But that doesn't necessarily --\n\n                                     WILLS\n                         It's a risk we'll just have to take.\n\n               Charlotte runs over to her sewing table, looking for a pen \n               and paper. She finds paper, but no pen --\n\n                                     WILLS\n                         Her dress is a sheath... sleeveless, \n                         black. The hat must, of course, be \n                         black or white or both.\n\n               She finds a pen but it doesn't work. She grabs an eyeliner \n               and uses that --\n\n                                     CHARLOTTE\n                         Any particular style?\n\n                                     WILLS\n                              (sipping his coffee)\n                         No, just plenty of it. How long will \n                         it take?\n\n                                     CHARLOTTE\n                         A week or two.\n\n                                     WILLS\n                         You have till Thursday. I'll need it \n                         here by seven o'clock. I'm at the \n                         Pembroke on Central Park West and \n                         76th.\n\n                                     CHARLOTTE\n                         Oh. Wow. Okay.\n\n                                     WILLS\n                         What's your fee?\n\n                                     CHARLOTTE\n                              (faltering)\n                         I don't really have one. I usually \n                         just make them for friends.\n\n                                     WILLS\n                         How's five hundred dollars?\n\n                                     CHARLOTTE\n                         Really? Wow.\n\n                                     WILLS\n                         Charlotte?\n\n               His tone has abruptly shifted; it's intimately hushed. It \n               both daunts and excites her --\n\n                                     CHARLOTTE\n                         Yeah?\n\n                                     WILLS\n                         You say \"wow\" a lot.\n\n                                     CHARLOTTE\n                         I know.\n\n                                     WILLS\n                         It has to stop. You're a woman now.\n\n                                     CHARLOTTE\n                         I know.\n\n                                     WILLS\n                         Bye.\n\n                                     CHARLOTTE\n                         Bye.\n\n               She clicks off the phone, wilts into a swoon on the bed, and \n               breaks out laughing.\n\n               Wills, still holding the receiver, stares dreamily into the \n               middle distance.\n\n               He snaps to when Olivia enters. Her accent is as much Queens \n               as it is Caribbean --\n\n                                     OLIVIA\n                         See, now you got me worried.\n\n                                     WILLS\n                         What do you mean?\n\n                                     OLIVIA\n                         You slept alone last night. You must \n                         be sick or somethin'. You want me to \n                         call a doctor?\n\n                                     WILLS\n                         Thank you, no, I'm fine.\n\n               She throws him a sly, sidelong glance, then exits. Wills \n               laughs and contentedly sips his coffee.\n\n               FROM THE NEXT SCENE, we hear the sound of SQUEALING, LAUGHING, \n               SHOUTING CHILDREN.\n\n               INT. FAO SCHWARZ -- NIGHT\n\n               Surrounded by swarming PARENTS and KIDS, Wills stands with \n               John, the manager of Elysium, and his wife, SARAH VOLPE, 30, \n               who, gazing out of frame, keeps a watchful eye on their kids --\n\n                                     JOHN\n                         Save it, pal! Don't even bother! I \n                         may not have gone to a fancy school \n                         like Bendover --\n\n                                     WILLS\n                              (to Sarah)\n                         That would be Andover.\n\n                                     SARAH\n                         Sure, if his folks could have afforded \n                         it.\n\n                                     JOHN\n                         -- but when Wills Keane comps three \n                         bottles of Dom to a twenty-year-old \n                         girl, then tells me he did it 'cause \n                         he likes the kid's grandma, I smell \n                         a rat!\n\n                                     SARAH\n                              (looking around)\n                         Oh, is that what that is? I figured \n                         there was a dirty diaper somewhere.\n\n                                     WILLS\n                              (lightly)\n                         Okay, I admit it, she interests me.\n\n                                     JOHN\n                              (turning to Sarah)\n                         He's gonna do it! I don't believe \n                         it! He moved us back here for nothing!\n\n                                     SARAH\n                         So much for that turned leaf.\n\n                                     WILLS\n                              (amused)\n                         Come on, you're overreacting.\n\n                                     JOHN\n                         Is that what you think? Buddy, since \n                         we hit town, I have done nothin' but \n                         cut you slack! Every week a new woman \n                         on your arm and I didn't say a word. \n                         Why? 'Cause I figured at least they're \n                         in the right demographic. Maybe by \n                         accident you'll trip over something \n                         substantial. But this little girl? \n                         Best she could be is Miss Right's \n                         daughter!\n\n                                     WILLS\n                              (uneasily)\n                         I know. It's just that there's \n                         something about her. She's special... \n                         and I just thought --\n\n                                     SARAH\n                         \"She's young. She's hot. I'm on the \n                         verge of menopause. Why not go for \n                         it?\"\n\n               Wills and Sarah meet eyes.\n\n                                     WILLS\n                         There wouldn't be much point in lying \n                         to you, would there?\n\n               Sarah shakes her head.\n\n                                     KIDS' VOICES\n                         Mommy, Daddy, look, look!\n\n               MOLLY and CARLA, the Volpes' five-year-old TWIN DAUGHTERS \n               run up, beaming, each carrying a huge stuffed animal.\n\n                                     JOHN\n                         Hey, they're bigger than you are!\n\n               John scoops both his daughters up in his arms and kisses \n               them repeatedly.\n\n               Wills watches, his eyes filling with a vague, wistful envy. \n               He sees Sarah staring at him. She smiles sympathetically.\n\n               INT. BROWNSTONE LIVING ROOM -- AFTERNOON\n\n               The furniture is antique and dark. The white walls are tinged \n               with yellow from years of cigarettes. In one corner, the \n               paint has chipped off the ceiling in a jagged plate.\n\n               Dolores sits on a worn-out leather arm chair, smoking, sipping \n               a cocktail, watching a DAYTIME TALK SHOW.\n\n               In the background, we see Charlotte working in the ADJOINING \n               DINING ROOM which she has turned into a lovely sewing room.\n\n               CLOSER ON CHARLOTTE. She builds her hat on a HAT BLOCK -- a \n               wooden mannequin head. Strewn all around her are the materials \n               of her hatmaking -- bolts of cloth, hat blocks, a sewing \n               table.\n\n               Shannon, wearing sweats and a T-shirt, lies on the floor, \n               eating M+M's and drinking diet soda, while heavily marking \n               up a text book with a YELLOW HIGHLIGHTER.\n\n               Charlotte stops and rubs her eyes, then she glances down at \n               Shannon and smiles --\n\n                                     CHARLOTTE\n                         Why don't you mark what isn't \n                         important? That way you'll save ink.\n\n                                     SHANNON\n                         Why don't you sew your mouth to my \n                         butt? That way you'll stop annoying \n                         me.\n\n               They both laugh. Overhearing, Dolores croaks facetiously --\n\n                                     DOLLY\n                         Now, now, if you two kids can't play \n                         nice --\n\n               Shannon rolls over onto her back --\n\n                                     SHANNON\n                         God, I hate school.\n\n               Charlotte pins a strip of black lace to the hat --\n\n                                     CHARLOTTE\n                         Oh, come on, just last week, you \n                         said you were on a roll. You loved \n                         it!\n\n                                     SHANNON\n                         Well, now I'm on the rag and I hate \n                         it.\n\n               Charlotte chuckles and sets the half-finished hat on her \n               head. Still seated, she wheels her work chair over to a mirror --\n\n                                     CHARLOTTE\n                         I think you're incredibly lucky. I'd \n                         love to be going to college.\n\n               Shannon rolls over and looks at her. Suddenly her expression \n               is inexplicably solemn --\n\n                                     SHANNON\n                         Am I the most spoiled brat in the \n                         world or what?\n\n                                     CHARLOTTE\n                         Spoiled brats don't even ask questions \n                         like that.\n                              (re: the hat)\n                         What do you think?\n\n               She models the hat. Tears well in Shannon's eyes and she \n               says without even a hint of irony or sentimentality --\n\n                                     SHANNON\n                         That you're the most beautiful person \n                         in the entire world.\n\n               Charlotte smiles, looks away, and, trying not to cry, fusses \n               with the hat.\n\n               EXT. CENTRAL PARK WEST -- NIGHT\n\n               A cold autumn rain falls. The Irish doorman, MICHAEL, 60's, \n               melancholy, stoop-shouldered, smokes a cigarette, looking up \n               at the unburdening sky.\n\n               A LIMOUSINE pulls up. The passenger window glides down --\n\n                                     DRIVER\n                         Mikey! How ya doin'?\n\n                                     DOORMAN\n                         A bit early, aren't you?\n\n                                     DRIVER\n                         Hey, in this soup, better safe than \n                         sorry, you know what I mean?\n\n               RUNNING FOOTSTEPS approach. Michael looks. The driver looks, \n               too.\n\n               It's Charlotte, dressed in tattered jeans, a light rain coat, \n               and sneakers, dashing at breakneck speed down the street, \n               carrying something in a GARBAGE BAG.\n\n                                     CHARLOTTE\n                         KEANE!\n\n               She runs right past Michael --\n\n               INT. ELEVATOR -- NIGHT\n\n               Michael works the shiny brass controls. Charlotte, winded, \n               hair dripping wet, watches the numbers tick by overhead. \n               Michael smiles at her with paternal fondness --\n\n                                     MICHAEL\n                         He's goin' to a fancy party tonight.\n\n               Charlotte, nonplused by his lack of discretion, smiles \n               politely --\n\n                                     CHARLOTTE\n                         Oh, really?\n\n               INT. WILLS' PENTHOUSE -- MOMENTS LATER\n\n               The elevator doors open.\n\n                                     MICHAEL\n                         Watch your step, Miss.\n\n                                     CHARLOTTE\n                         Thank you.\n\n               She emerges, moves to Wills' door, and waits for the elevator \n               to close. When it does, she hurries back to a table over \n               which hangs a GILDED MIRROR.\n\n               She takes a LOVELY OLD HAT BOX out of the garbage bag and \n               ditches the bag under the table. Then she quickly checks \n               herself in the glass.\n\n               She doesn't like what she sees. She pokes at her sopping \n               hair and squeezes it, but it's hopeless. Remembering the \n               time, she hurries back to the door, takes a deep breath, and \n               rings the bell.\n\n               She waits. And waits. Then she hears footsteps approaching. \n               She realizes she's left the hat box on the table.\n\n               She rushes over and grabs it, just in time to get back to \n               the door when it OPENS.\n\n               Olivia, the housekeeper, steps out, wearing her coat and \n               carrying her purse. Her voice is low and gentle --\n\n                                     OLIVIA\n                         He's waitin' for you, Miss Fieldin'.\n\n               They exchange cordial smiles. Charlotte enters.\n\n               INT. WILLS' APARTMENT -- CONTINUOUS\n\n               Charlotte steps into a dim hallway lined with oil paintings, \n               carpeted with a Persian runner, and lighted by three antique \n               sconces. She walks slowly, terribly self-conscious.\n\n               INT. WILLS' LIVING ROOM -- CONTINUOUS\n\n               The room is vast, furnished with antiques, decorated with \n               the same masculine good taste. Charlotte enters timidly, \n               then hears --\n\n                                     WILLS\n                         What happened?\n\n               She looks and sees Wills standing, back turned, before a \n               broad set of high windows. City lights glimmer in the \n               distance; beneath them lies the vast gloom of Central Park.\n\n                                     CHARLOTTE\n                         I couldn't get a cab, so I took the \n                         subway... only it was an express and \n                         it didn't stop at --\n\n                                     WILLS\n                         You realize, don't you, that you're \n                         a full eighteen minutes late?\n\n                                     CHARLOTTE\n                         I know... I'm so sorry... I --\n\n               Wills turns around. A magnificent figure -- expertly tailored \n               tux, every hair in place, freshly manicured. And then he \n               offers her an amused, reassuring smile --\n\n                                     WILLS\n                         Charlotte, relax. What's the point \n                         of being a beautiful young woman if \n                         it isn't to keep your admirers \n                         waiting? In fact, you disappoint me: \n                         I was looking forward to at least \n                         another half hour of suspense.\n\n               Flattered, her face brightens --\n\n                                     CHARLOTTE\n                         I could leave and come back.\n\n                                     WILLS\n                         Nope, too late. Anyway, I want to \n                         see the hat.\n\n               He walks over to her. Smiling, she sets down the box, unties \n               the ribbon, and gingerly removes the hat. It's sublimely \n               simple and elegant. She looks at him with hope. His face \n               betrays nothing --\n\n                                     WILLS\n                         Try it on.\n\n                                     CHARLOTTE\n                         I can't. I'm soaked.\n\n                                     WILLS\n                         It's all right.\n\n               Charlotte, a little confused, carefully sets the hat on her \n               head. She steps to a wall mirror, pulls the veil down, and \n               sets it at the correct angle.\n\n               Wills appears behind her and shares the reflection. She feels \n               his presence, hears his breathing. They speak in hushed tones --\n\n                                     WILLS\n                         It's perfect. It's like a tiny \n                         sculpture.\n\n                                     CHARLOTTE\n                         I wanted it to be a tiny poem.\n\n               She smiles. Their eyes meet in the glass.\n\n                                     WILLS\n                         If only I had some use for it.\n                              (off her look)\n                         My date canceled a few hours ago.\n\n                                     CHARLOTTE\n                         Why?\n\n                                     WILLS\n                         I don't know. She was vague. Would \n                         you... like to come in her place?\n\n               Charlotte can't believe it. She smiles at his reflection.\n\n                                     CHARLOTTE\n                         Like this?\n\n                                     WILLS\n                         The outfit I bought her is hanging \n                         in the guest room closet.\n\n                                     CHARLOTTE\n                              (anxiously)\n                         It's okay? Are you sure?\n\n                                     WILLS\n                              (amused)\n                         Of course.\n\n               He gestures toward the half-open door on other side of the \n               room. Charlotte turns and, biting her lip, looks at the door, \n               then back at Wills, then back at the door.\n\n               INT. GRAND BALLROOM, PLAZA HOTEL -- NIGHT\n\n               A spectacular affair is in full swing, a benefit for the \n               METROPOLITAN MUSEUM OF ART attended by FIVE HUNDRED GUESTS \n               from HIGH SOCIETY dressed only in black and white.\n\n               A LARGE BAND plays -- everything from waltzes to jazz to \n               swing. Chandeliers glisten. Guests, sitting in ornate boxes, \n               look down on the marble dance floor where a WALTZ is in \n               progress.\n\n               FIND WILLS AND CHARLOTTE, dancing together. Charlotte looks \n               sophisticated and beautiful beyond measure, wearing a \n               sleeveless black sheath with a fake fur wrap, and, of course, \n               her hat.\n\n                                     WILLS\n                         Nonsense. You're very good. Where \n                         did you learn?\n\n                                     CHARLOTTE\n                         From Ella. The woman whose memorial \n                         you crashed.\n\n                                     WILLS\n                         So you did see me there.\n\n                                     CHARLOTTE\n                         Uh-huh. And the next time I saw you, \n                         you were on the cover of New York \n                         magazine. And I had to pick a place \n                         for my birthday. So...\n\n               It takes a few beats for Wills to put it together. He smiles, \n               realizing that her presence at Elysium wasn't a coincidence. \n               She smiles back, sweetly, coyly.\n\n               ON THE PERIMETER, FIND TWO RICH WOMEN, 40's, too thin, too \n               lifted, watching Wills and Charlotte waltz.\n\n               They stand with LISA, 23, unassuming, fair-haired, simply \n               dressed.\n\n                                     RICH WOMAN #1\n                         Of course he moved back. I mean, \n                         he'd already seduced every A- and B-\n                         list actress in town. What was left \n                         for him?\n\n               Pause. Lisa looks at her, feigning naivety.\n\n                                     LISA\n                         The C-list?\n\n                                     RICH WOMAN #2\n                         Exactly.\n\n                                     RICH WOMAN #1\n                         But if what I hear is true and he's \n                         shopping for a bride, I can tell you \n                         one thing -- he's barking up the \n                         wrong tree there.\n\n                                     LISA\n                         Why do you say that?\n\n                                     RICH WOMAN #1\n                              (with an icy smile)\n                         Good wives are rarely found up cherry \n                         trees.\n\n               The women share a laugh. Lisa, slightly discomposed, looks \n               back at Wills and Charlotte.\n\n               INT. GRAND BALLROOM -- LATER\n\n               Wills and Charlotte slow dance to a romantic ballad. Wills \n               seems entranced by her easy manner of expression --\n\n                                     CHARLOTTE\n                         I met Ella in the fourth grade. She \n                         was my teacher at the Little Red \n                         School House. We stayed friends after \n                         she retired. She taught me how to \n                         cook and sew... speak Italian... \n                         basically enjoy life, have fun -- \n                         that's what she was best at... even \n                         when she knew she was dying.\n                              (pause)\n                         The most important thing she did was \n                         introduce me to poetry. She believed \n                         it was the highest form of art and \n                         that everything we say and do should \n                         aspire to it.\n\n               Wills is uncomfortable for a moment, then ventures quietly --\n\n                                     WILLS\n                         It sounds as though, in a way, she \n                         took your mom's place...\n\n                                     CHARLOTTE\n                         My mom and my dad's. After they died, \n                         Dolly was so devastated she pretty \n                         much gave up on everything. It was \n                         like if something that tragic could \n                         happen, there was no way she was \n                         ever gonna care about anyone else \n                         ever again. Including herself. She \n                         wasn't a horrible parent... she didn't \n                         abuse me or anything... she just \n                         ignored me. She was more like a weird \n                         landlady than a grandmother.\n\n               Charlotte smiles sadly. Her eyes glisten in the light.\n\n                                     WILLS\n                         I'm sure she did the best she could.\n\n                                     CHARLOTTE\n                         For a long time I kinda thought that, \n                         too, and I made excuses for her, but \n                         now I don't. I was seven years old \n                         and I needed her and she wasn't there.\n\n               Silence as Wills somberly reflects. Finally, he speaks --\n\n                                     WILLS\n                         I remember when I heard the news \n                         about your parents. You know how \n                         after a crash they print a long list \n                         of names in the newspaper? Well, I \n                         grew up outside Boston, so I naturally \n                         started to scan the list. But \n                         casually, not expecting to --\n\n               Suddenly, a SWING SONG starts. Wills smiles at the ironic \n               change of mood, then turns to escort Charlotte away --\n\n                                     CHARLOTTE\n                         Oh, no, come on! I love this stuff! \n                         Don't you? Didn't you grow up on it?\n\n                                     WILLS\n                         How old do you think I am?\n\n                                     CHARLOTTE\n                         Ancient!\n\n               Holding his hand, she starts moving to the music. Wills laughs --\n\n                                     WILLS\n                         I have no idea what to do!\n\n                                     CHARLOTTE\n                         Have fun!\n\n               She flings her wrap onto a chair and keeps dancing. Wills, \n               charmed senseless, finally surrenders.\n\n               A SEQUENCE BEGINS during which we see WILLS and CHARLOTTE \n               having an inordinately good time. Wills maintains a modicum \n               of reserve; Charlotte is joyful and entirely unembarrassed.\n\n               CERTAIN GUESTS NOTICE THEM. The reactions to their pairing \n               runs from confusion to disgust to amusement.\n\n               But no one watches them more carefully than Lisa.\n\n               Finally, in the middle of a song, Wills and Charlotte make \n               their way off the floor, winded and laughing. Wills heads \n               off to the bar. Charlotte turns around and watches the other \n               dancers.\n\n               Then we notice Lisa standing next to her. They smile at each \n               other. Lisa offers her a cocktail napkin. Charlotte takes it \n               and wipes off her brow.\n\n               They speak above the music --\n\n                                     LISA\n                         I had to come. I work at the Met. \n                         What's your excuse?\n\n                                     CHARLOTTE\n                         Sort of a date.\n\n                                     LISA\n                         With Wills Keane, right?\n\n                                     CHARLOTTE\n                         You know him?\n\n                                     LISA\n                         Just by reputation.\n\n                                     CHARLOTTE\n                         A major womanizer, right?\n\n                                     LISA\n                         That's what they say.\n                              (beat)\n                         I'm Lisa.\n\n                                     CHARLOTTE\n                         Charlotte Fielding.\n\n               They shake hands. Lisa looks away and sees Wills making his \n               way toward them with two glasses of punch.\n\n               Coolly covering, Lisa beats a hasty retreat --\n\n                                     LISA\n                         Anyway, I should keep mingling. But \n                         it was nice to meet you.\n\n                                     CHARLOTTE\n                         Same here.\n\n               Lisa smiles politely and walks away.\n\n               Wills walks up, watching Lisa melt into the crowd. His brow \n               is furrowed. He's wondering if his eyes have deceived him. \n               He hands Charlotte a punch --\n\n                                     WILLS\n                         Who was that?\n\n                                     CHARLOTTE\n                         Lisa something.\n\n               The name hits home. Wills is flustered, but then he covers \n               as best he can and lifts his glass --\n\n                                     WILLS\n                              (lifting his glass)\n                         Here's to --\n\n                                     CHARLOTTE\n                         Us.\n\n               Wills smiles slowly and they toast.\n\n               INT. WILLS' LIVING ROOM -- NIGHT\n\n               The room is empty. There's laughter in the distance. The \n               front door opens and shuts. We hear Wills and Charlotte, \n               both a little tipsy, advancing down the hall toward us --\n\n                                     CHARLOTTE\n                         God, you talk like you're a hundred \n                         and sixteen!\n\n                                     WILLS\n                         That's usually how I feel. But not \n                         tonight. Tonight I feel sixteen... \n                         just sixteen... and three-quarters.\n\n               Wills crosses to the bar and from a small refrigerator pulls \n               out a BOTTLE OF CHAMPAGNE already sitting in an ice bucket.\n\n                                     WILLS\n                         Champagne?\n\n                                     CHARLOTTE\n                         He asked nonchalantly.\n\n               Wills laughs, then opens the bottle as he picks up his \n               previous train of thought --\n\n                                     WILLS\n                         You see, Charlotte, the way you know \n                         you're getting older is that you \n                         start to notice patterns. People \n                         start falling into types. Pretty \n                         soon you know a person before you've \n                         even been introduced. And if it's a \n                         woman, before the romance even starts, \n                         a whisper in your head tells you \n                         exactly what it is and how long it's \n                         going to last. And the saddest, the \n                         most tedious, part of all is that \n                         that little voice is almost always \n                         right.\n                              (popping the cork)\n                         Now, what I like about you -- and I \n                         think that's actually what inspired \n                         this little lecture -- is that I \n                         find you completely unprecedented... \n                         and, therefore, wholly unpredictable.\n\n                                     CHARLOTTE\n                         God, it must be a relief.\n\n                                     WILLS\n                              (confused)\n                         What?\n\n                                     CHARLOTTE\n                         To finally deliver that speech to a \n                         woman and actually have it apply to \n                         her.\n\n                                     WILLS\n                         Now wait a minute.\n\n                                     CHARLOTTE\n                         No, because coincidentally I am all \n                         those things you just said. And more.\n\n               Wills chuckles, shaking his head, charmed but a little \n               unsettled.\n\n                                     CHARLOTTE\n                         I'm a \"unique\". At least that's what \n                         my yoga teacher says. He says there \n                         are very few uniques in the world \n                         and I'm one of them.\n\n                                     WILLS\n                         Well, he's a wise man.\n\n               He hands her a glass of champagne.\n\n                                     CHARLOTTE\n                         You, on the other hand, are what \n                         he'd call a \"typical.\"\n\n                                     WILLS\n                         Oh, really?\n\n                                     CHARLOTTE\n                         Uh-huh. And I can prove it. Want me \n                         to? Come here.\n\n               Wills moves a few steps closer.\n\n                                     CHARLOTTE\n                         Closer.\n\n               Wills walks even closer, until they are just a few feet apart.\n\n                                     CHARLOTTE\n                         No, come on, really close.\n\n               Wills can't believe his good luck. He nears her until their \n               faces are almost touching.\n\n                                     CHARLOTTE\n                         Perfect. Now watch very carefully.\n\n               She rises on tiptoe and puts her mouth just inches from his.\n\n               Their breathing mingles. Wills seems almost dizzied by it.\n\n               And then, very slowly, he kisses her.\n\n               She does not kiss back.\n\n               Finally, he pulls away, staring blankly, breathing hard, not \n               sure what to say.\n\n               Charlotte whispers --\n\n                                     CHARLOTTE\n                         See? You're a typical.\n                              (pause)\n                         And for what you just did, most girls \n                         my age would slap your face. Or ask \n                         to be put in a cab.\n                              (pause)\n                         Lucky for you, I'm a unique.\n\n               She smiles, then kisses him deeply on the mouth. Her arms \n               wrap around his neck.\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               Cloaked in deep shadow, set off against a rainy window pane, \n               we see Wills, his shirt off, on top of Charlotte whose blouse \n               is open. He passionately kisses her neck and mouth.\n\n                                                               DISSOLVE TO:\n\n               INT. WILLS' BEDROOM -- MORNING\n\n               The room is bathed in golden light. Charlotte lies naked \n               under the covers asleep on her stomach. Her brow is tense \n               and one of her hands is slightly clenched.\n\n               ANGLE ON WILLS, standing in the doorway, watching her, his \n               face a portrait of conflicted thoughts.\n\n               Finally, she stirs. Smiling and squinting into the sun, she \n               gets up on one arm and looks at him, standing there in the \n               doorway --\n\n                                     CHARLOTTE\n                         Boy, do you look guilty.\n\n               EXT. WILLS' TERRACE -- LATER\n\n               Charlotte happily wolfs down her continental breakfast. Wills \n               sits across from her, watching and worrying.\n\n                                     CHARLOTTE\n                         Didn't anyone ever teach you that \n                         it's bad manners to stare at a girl \n                         when she's eating like a pig?\n\n               Wills chuckles, then his smile fades and he clears his throat.\n\n                                     WILLS\n                         Listen --\n\n                                     CHARLOTTE\n                         Uh-oh. Here it comes.\n\n                                     WILLS\n                         That's right, because, look, I could \n                         put this off, but I genuinely like \n                         you. So I want to be clear... right \n                         now... from the start, so there's no \n                         chance for misunderstanding later.\n\n                                     CHARLOTTE\n                         Okay.\n\n                                     WILLS\n                         What I want to say you is.... well... \n                         that all I can offer you is this... \n                         what we have right now... nothing \n                         more substantial... just this... \n                         until it ends.\n\n               She looks at him. Lowers her fork. He adds almost reluctantly --\n\n                                     WILLS\n                         The truth is, we have no future \n                         together.\n\n                                     CHARLOTTE\n                         I know. I'm dying.\n\n               Wills' face reddens slightly. He shifts uneasily in his chair. \n               A suggestion of a smile plays along his features --\n\n                                     WILLS\n                         What... what do you mean?\n\n                                     CHARLOTTE\n                         What I said. Nobody thought I'd even \n                         last this long.\n\n               Wills stares at her blankly, not knowing what to think or \n               say.\n\n                                     CHARLOTTE\n                         I could have put off telling you, \n                         but I genuinely like you, so I wanted \n                         to be clear... you know, right from \n                         the start.\n\n               Olivia enters, takes her orange juice glass and leaves a \n               full one.\n\n                                     CHARLOTTE\n                         Thanks, Olivia!\n\n               Charlotte gulps down the juice. Wills watches, his mind \n               reeling.\n\n               INT. DOCTOR'S OFFICE -- DAY\n\n               Wills sits across from a large desk, beneath a wall of framed \n               certificates and diplomas. The door opens and DR. PAUL SIBLEY, \n               60, African-American, dour and forbidding, enters --\n\n                                     SIBLEY\n                         Mr. Keane? Dr. Sibley.\n\n               Wills jerks to his feet and they shake hands --\n\n                                     WILLS\n                         Thank you so much for taking the \n                         time.\n\n                                     SIBLEY\n                         It's my job, sir. Please, sit down.\n\n               He walks around the desk. Sibley is all business, but his \n               brusqueness masks genuine regret --\n\n                                     SIBLEY\n                         Now, Mr. Keane, on the phone you \n                         referred to Charlotte's condition as \n                         cancer. That isn't strictly accurate. \n                         Neuroblastoma is a soft tissue \n                         malignancy, but it isn't cancer -- \n                         although it sometimes can be just as \n                         aggressive.\n                              (sitting)\n                         It's most common in children. In \n                         young adults, the condition is \n                         extremely rare. In Charlotte's case, \n                         the tumor is located in her chest. \n                         It's growing rapidly and has proved \n                         resistant to both irradiation and \n                         chemotherapy. And because of its \n                         proximity to her aorta, surgery is \n                         out of the question.\n\n                                     WILLS\n                         So then what treatment is she getting?\n\n                                     SIBLEY\n                         At present? Nothing.\n\n               Wills shifts uneasily in his chair.\n\n                                     SIBLEY\n                         Eventually she'll be treated for \n                         pain. In the end, surgery could become \n                         an option, but her chances of survival \n                         would be slim. Right now Charlotte's \n                         against it. She's signed a directive \n                         forbidding any sort of heroic \n                         intervention.\n\n               A silence settles between them. Sibley opens a folder on his \n               desk.\n\n                                     SIBLEY\n                         There's more here if you're \n                         interested, but it won't mean much \n                         to you.\n\n               Wills shakes his head and rises from his chair. He turns to \n               the door, then turns back to the doctor --\n\n                                     WILLS\n                         How long?\n\n                                     SIBLEY\n                         Optimistically? A year.\n\n               EXT. ST. VINCENT'S HOSPITAL WAITING ROOM -- LATER\n\n               Wearing her tattered jeans from the night before, Charlotte \n               sits on the couch doing the New York Times crossword. Wills \n               emerges, walking slowly, pensively, as though in a trance.\n\n               Charlotte looks up and masks her anxiety with a grin --\n\n                                     CHARLOTTE\n                         A real charmer, isn't he?\n\n               Wills doesn't react. He keeps walking toward her. Unsettled, \n               she holds up the puzzle.\n\n                                     CHARLOTTE\n                         How are you on Cambodian money units?\n\n               Wills keeps advancing.\n\n                                     CHARLOTTE\n                         Are you okay, old man? You look kinda \n                         woozy.\n                              (jokingly calling out)\n                         Is there a doctor in the house?\n\n               Ignoring her, Wills sits down, takes her in his arms, and \n               embraces her. At first she resists, but slowly she surrenders \n               and hugs him back.\n\n               INT. TAXI -- AFTERNOON\n\n               As the cab bounces down a cobblestone Village street, Wills \n               and Charlotte stare straight ahead, each following the \n               tortuous path of his own thoughts.\n\n               Slowly, Charlotte steals a sidelong look at him. His face is \n               tense, ashen, and unreadable --\n\n                                     CHARLOTTE\n                         Hey.\n\n               Wills slowly turns his head. She smiles sweetly --\n\n                                     CHARLOTTE\n                         Look on the bright side: if I weren't \n                         sick, there's no way we could hang \n                         out together.\n                              (off his look)\n                         I'm serious. You'd be scared of \n                         hurting me and I'd be scared you \n                         were just using me for my perfect \n                         young body.\n\n               He can't help but smile. Encouraged, she moves closer --\n\n                                     CHARLOTTE\n                         And then our friends would say we \n                         were just into each other for weird \n                         psychological reasons. You know, \n                         because I'm looking for a daddy \n                         substitute and you're looking for \n                         someone you can feel superior to so \n                         you won't have to confront how scared \n                         you are of real intimacy -- and, of \n                         course, they'd be right and eventually \n                         we'd break up.\n                              (beat)\n                         But since I'm so sick it doesn't \n                         really matter what deep-seated \n                         weirdness has brought us together \n                         because there's no way we can possibly \n                         screw each other over... or up... \n                         because that takes time. And I don't \n                         have much left.\n\n               The cab comes to a stop in front of her brownstone. She smiles \n               archly, savoring the irony --\n\n                                     CHARLOTTE\n                         So considering everything, don't you \n                         think we should just sort of chill \n                         out, forget I'm sick, and enjoy what \n                         we have... right now... no strings... \n                         just this... until it ends? 'Cause \n                         that's really all I have to offer.\n\n               Wills grimly appreciates the irony.\n\n                                     CHARLOTTE\n                         Think about it, okay? But not too \n                         hard.\n\n               She kisses his cheek and jumps out of the cab. She skips up \n               the steps of the brownstone, then immediately turns around \n               and runs back down to the open window.\n\n               She leans in and mutters sexily --\n\n                                     CHARLOTTE\n                         Last night was so incredibly hot.\n                              (beat)\n                         By the way -- it was my first time. \n                         And I picked you for the job. I hope \n                         you're flattered.\n\n               Wills is shocked. She turns and runs back upstairs. She sticks \n               in the key, then turns and waves at Wills before banging \n               open the door with her hip.\n\n                                     DRIVER\n                         Okay, pal, where to?\n\n               Wills hasn't moved a muscle.\n\n               FROM THE NEXT SCENE, we hear the pop of FLASHBULBS and the \n               whirr of SHUTTERS --\n\n               INT. DOWNTOWN LOFT -- NIGHT\n\n               YOUNG FASHION MODELS OF EVERY RACE strut down a runway, \n               modeling a new line of WOMEN'S URBAN CASUAL WEAR.\n\n               FIND CHARLOTTE, ignoring the show, pushing through the crowd, \n               hurrying toward the side of the stage. She speaks to a GUARD \n               at the entrance and he lets her pass.\n\n               INT. BACKSTAGE -- MOMENTS LATER\n\n               Charlotte searches amid the chaos of models dressing and \n               undressing. Finally, she spots them.\n\n               FIND SIMON AND SHANNON styling a BLACK FEMALE MODEL in a \n               tank top and fatigues.\n\n               He applies a finishing touch, adjusting the tilt of the \n               model's baseball cap. Shannon, lacing the girl's boots, works \n               as Simon's assistant.\n\n               EXT. SOHO STREET -- NIGHT\n\n               The threesome, in high spirits, bangs open a fire door. \n               Shannon is beside herself, frantically half-screaming --\n\n                                     SHANNON\n                         I don't believe it! I don't believe \n                         it!\n\n                                     SIMON\n                         I think what Miss Harris is trying \n                         to say, is that you've strained her \n                         credulity.\n\n                                     CHARLOTTE\n                         Really? Better put some ice on that.\n\n               Shannon lifts a hand to high-five her --\n\n                                     SHANNON\n                         Girlfriend, you are so incredibly \n                         cool!\n\n                                     SIMON\n                         So I've been told.\n\n               Simon high-fives her instead. The girls laugh.\n\n                                     SHANNON\n                         Okay, now tell us everything! Don't \n                         leave anything out!\n\n               FROM THE NEXT SCENE, we hear --\n\n                                     JOHN'S VOICE\n                         Okay, then what happened?\n\n               INT. ELYSIUM -- LATE AFTERNOON\n\n               The restaurant is empty. John stands behind the bar, taking \n               an inventory of the liquor. In the background, TWO BUSSERS \n               mop up. Wills sits on a bar stool, nursing a mineral water --\n\n                                     WILLS\n                         Not much. I took her home and she \n                         pointed out an irony -- that fate \n                         was now offering us the very same \n                         thing that just this morning I'd \n                         told her was all I could offer her: \n                         a relationship with no future.\n\n                                     JOHN\n                              (chuckling)\n                         A kid figured that out?\n\n                                     WILLS\n                         She's not a kid! That's what I've \n                         been trying to tell you. Nothing's \n                         lost on her. I'm the kid. She... I \n                         don't know what the hell she is...\n                              (muttering)\n                         But I do know what she was.\n\n               John looks at him curiously. Wills glances over his shoulder \n               at the bussers, then leans in close --\n\n                                     WILLS\n                         A virgin.\n\n                                     JOHN\n                         What?\n\n               The busboys turn their heads.\n\n                                     WILLS\n                         I had no idea. That's the only reason \n                         she had her party here, so she could \n                         lure me into doing the honors.\n\n                                     JOHN\n                              (grinning)\n                         She used you, pal.\n\n                                     WILLS\n                         I know.\n\n                                     JOHN\n                         The hangman got hanged. How's it \n                         feel?\n\n                                     WILLS\n                         Embarrassing.\n\n               John laughs. Wills settles into a brooding silence. John \n               goes back to work --\n\n                                     JOHN\n                         So what now?\n\n                                     WILLS\n                         I end it.\n\n                                     JOHN\n                         How come?\n\n                                     WILLS\n                         What, you're endorsing this now?\n\n               John, continuing his work, smiles sweetly --\n\n                                     JOHN\n                         I don't know, when you talk about \n                         her, you're not such an arrogant son \n                         of a bitch. You get all whiny and \n                         stupid. I like that.\n\n                                     WILLS\n                         Thanks.\n\n                                     JOHN\n                         And since I don't see you gettin' \n                         serious with any of your other \n                         victims, I figure why not spend a \n                         little time together?\n\n               Pause.\n\n                                     WILLS\n                         Because she's dying.\n\n                                     JOHN\n                         I got bad news for you, brother, so \n                         are you.\n\n               Wills stares at him thoughtfully.\n\n               EXT. BROWNSTONE STOOP -- DAY\n\n               Wills stands stiffly at the door, holding a bouquet of \n               flowers. He stares at his own reflection in the porthole \n               window. He straightens his hair, tugs at the collar of his \n               cashmere jacket.\n\n               Footsteps approach. The door opens and there's Dolores, bleary-\n               eyed and disheveled. She smiles sourly --\n\n                                     DOLLY\n                         Well, well.\n\n               INT. BROWNSTONE FOYER -- CONTINUOUS\n\n               Through the dark prism of Dolores' inhospitable wariness, we \n               catch glimpses of the high-society hostess she once was --\n\n                                     DOLLY\n                         She'll be right down. She's upstairs, \n                         gildin' the lily.\n                              (shouting up the stairs)\n                         HE'S HERE!\n                              (wryly)\n                         Do come in.\n\n               They move through a doorway --\n\n               INT. BROWNSTONE LIVING ROOM -- CONTINUOUS\n\n               Wills is surprised by the room's run-down state.\n\n                                     DOLLY\n                         Excuse the mess. My maid died fourteen \n                         years ago and it's been simply \n                         impossible to replace her. She did \n                         windows and spoke English.\n\n               She chuckles to herself. Wills hands her the flowers.\n\n                                     WILLS\n                         For you.\n\n                                     DOLLY\n                         Well, aren't they loverly.\n\n               She casually drops them into an EMPTY BLENDER at the bar.\n\n                                     DOLLY\n                         Care for a cocktail?\n\n                                     WILLS\n                         No, thanks.\n\n               INT. CHARLOTTE'S BEDROOM -- SAME\n\n               Simon lounges on the bed. Charlotte stands before a full-\n               length mirror, trying on a dress.\n\n                                     SIMON\n                         It really is uncanny. I tell you, in \n                         that dress you're the spitting image \n                         of Michel Simon.\n\n                                     CHARLOTTE\n                              (flattered)\n                         Who's she?\n\n                                     SIMON\n                         A French character actor, long dead, \n                         who was not only hideous and fat, \n                         but quite male.\n\n                                     CHARLOTTE\n                         So that would be a \"no.\"\n\n               Simon nods. Charlotte takes off the dress.\n\n               INT. BROWNSTONE LIVING ROOM -- SAME\n\n               Wills looks around the room. Dolores splashes her drink with \n               vodka --\n\n                                     DOLLY\n                         What can I say? Time's a thief. One \n                         day you're rich as an Arab, the next \n                         you're lucky if you can afford a god \n                         damn can of pistachio nuts.\n\n               Wills wanders over to the mantel where FAMILY PHOTOS sit in \n               tarnished antique silver frames. He picks up a photograph of \n               a YOUNG GIRL in TENNIS WHITES -- it's Charlotte's mother, \n               Katie.\n\n               Wills' face is suffused with tenderness as he studies it. \n               Dolores walks over and looks --\n\n                                     DOLLY\n                         How about that, huh? That was the \n                         summer you two --\n\n                                     WILLS\n                         I know.\n\n                                     DOLLY\n                         Who'd have guessed what time had in \n                         store for her, huh? Look at that \n                         smile.\n\n               Eyes moistening, Dolores crosses to her armchair. Her tone \n               is slightly bitter --\n\n                                     DOLLY\n                         Then again, time loves some people. \n                         Like you, for instance. Oh, time's \n                         just wild about you.\n\n               She plops down unsteadily and reaches for her cigarettes --\n\n                                     DOLLY\n                         Just as handsome and charming as \n                         ever. And still up to the same old \n                         tricks.\n\n               Wills sets the photo back on the mantel --\n\n                                     WILLS\n                         What do you mean?\n\n                                     DOLLY\n                         First time you came to pick up Katie, \n                         you brought me flowers. Just like \n                         those.\n                              (to herself)\n                         Flower the mother; then deflower the \n                         daughter. But Katie was too smart \n                         for you...\n\n                                     WILLS\n                         Dolly, look --\n\n                                     DOLLY\n                              (abruptly)\n                         Aw, why the hell don't you leave her \n                         alone? Christ, she's sick!\n\n               But before Wills can answer, they hear footsteps on the \n               stairs. Neither moves.\n\n               Charlotte enters, wearing a peasant dress and felt hat, \n               looking pretty, pale, and excited.\n\n               Wills and Dolores slowly turn. They smile at her, then \n               exchange a quick glance. Charlotte catches it and becomes \n               self-conscious --\n\n                                     CHARLOTTE\n                         What? What's wrong?\n\n                                     DOLLY\n                         You look like your mom is all.\n\n               Charlotte looks to Wills to see if that's, indeed, what he \n               was thinking. He nods his agreement. She is pleased.\n\n               EXT. GREENWICH VILLAGE STREET -- MINUTES LATER\n\n               Charlotte, full of energy, hauls Wills down the block by the \n               hand.\n\n                                     WILLS\n                         What do you mean, you knew?\n\n                                     CHARLOTTE\n                         I did! I just didn't think it would \n                         take so long!\n\n                                     WILLS\n                         Two days is long?\n\n                                     CHARLOTTE\n                         It is when you're sitting by the \n                         phone. You wanna know how I knew?\n\n                                     WILLS\n                         You're psychic?\n\n                                     CHARLOTTE\n                         I am, but no -- it's because of my \n                         birthday wish.\n\n                                     WILLS\n                         But we hadn't even been introduced \n                         yet.\n\n                                     CHARLOTTE\n                         I know, but I wished that whatever \n                         happened... you know, with my \n                         illness... I'd go out with a bang. \n                         Nothing heavy. No violins. No \n                         melodrama. Just fun. A total \n                         adventure!\n\n               Charlotte jumps off the curb.\n\n                                     WILLS\n                         CAREFUL!\n\n               He yanks her back just as a TAXI, horn blaring, SPEEDS PAST, \n               nearly hitting her.\n\n               For a moment, they both stand there, hearts pounding, \n               breathing hard. Then Charlotte looks back at him and grins --\n\n                                     CHARLOTTE\n                         Wow, it's getting exciting already.\n\n               EXT. WASHINGTON SQUARE PARK -- AFTERNOON\n\n               Under a perfect blue sky, the park swarms with autumn \n               celebrants. Charlotte and Wills move together down a walkway.\n\n               Half-joyously and half comically, Charlotte addresses the \n               heavens with grand theatricality --\n\n                                     CHARLOTTE\n                         \"Lord, I do fear \n                         Thou'st made the world too beautiful \n                         this year! \n                         My soul is all but out of me, -- let \n                         fall \n                         No burning leaf; prithee, let no \n                         bird call!\"\n\n                                     WILLS\n                         We could go to a museum.\n\n                                     CHARLOTTE\n                         No, that would be a thing! I don't \n                         want to do any thing today. I want \n                         to do no thing all day.\n\n                                     WILLS\n                         Nothing at all?\n\n                                     CHARLOTTE\n                         Uh-huh. No thing at all.\n\n                                     WILLS\n                         So a movie is out.\n\n                                     CHARLOTTE\n                         Way out!\n\n                                     WILLS\n                         Ice cream at the Plaza? High tea at \n                         the Palace?\n\n                                     CHARLOTTE\n                         Both out.\n\n                                     WILLS\n                         What about shopping?\n\n               She considers for a few moments --\n\n                                     CHARLOTTE\n                         Possible.\n\n                                     WILLS\n                         It's not a thing?\n\n                                     CHARLOTTE\n                         Only when I have money.\n\n               EXT. FIFTH AVENUE IN THE 50'S -- AFTERNOON\n\n               The sidewalk swarms with pedestrians. Wills and Charlotte \n               emerge empty-handed from the revolving door of a department \n               store --\n\n                                     WILLS\n                         But all I gave you was champagne. \n                         That's not a proper birthday present.\n\n                                     CHARLOTTE\n                         I agree, and I promise I'll let you \n                         give me something else, but not today.\n\n                                     WILLS\n                         When?\n\n                                     CHARLOTTE\n                         Soon. But I'm warning you, it's not \n                         going to be anything material.\n\n                                     WILLS\n                         Why not?\n                              (then solemnly)\n                         Oh, I see... because you're sick. \n                         Because --\n\n                                     CHARLOTTE\n                         That's right, but we're not gonna \n                         talk about that.\n\n                                     WILLS\n                         How come?\n\n                                     CHARLOTTE\n                         Because it's my rule.\n\n                                     WILLS\n                         Any particular reason?\n\n                                     CHARLOTTE\n                         Yeah, because everybody always wants \n                         to talk about miracles, or about \n                         some genius quack-doctor, or their \n                         friend's friend who went into \n                         remission eating nothing but sunflower \n                         seeds. It's boring and pointless.\n\n                                     WILLS\n                         Are you sure? I mean, there are \n                         specialists who --\n\n                                     CHARLOTTE\n                         Don't start, okay?\n                              (abruptly)\n                         Now what I would enjoy is taking you \n                         shopping. For clothes. I'm serious. \n                         It's quality not quantity, you know.\n\n               INT. BARNEY'S MEN'S DEPARTMENT -- AFTERNOON\n\n               Wills sits in a chair while Charlotte looks through silk \n               scarves --\n\n                                     CHARLOTTE\n                         At work you should look perfect, but \n                         in everyday life you need to delight \n                         in disorder more. Don't you know? \"A \n                         sweet disorder in the dress kindles \n                         in clothes a wantonness.\"\n\n                                     WILLS\n                         I think that goes without saying.\n\n                                     CHARLOTTE\n                         It was true when that poem was written \n                         three hundred years ago and it's \n                         true today. Wouldn't it be fun to \n                         look wanton occasionally?\n\n                                     WILLS\n                         It's been a lifelong dream of mine. \n                         But will a scarf do it?\n\n                                     CHARLOTTE\n                         Totally. Accessories rule. But we \n                         have to be careful. I don't want you \n                         looking too young. Nothing's worse \n                         than an old guy trying to look young.\n\n                                     WILLS\n                         Good advice. I'll remember that for \n                         when I get old.\n\n                                     CHARLOTTE\n                         You know what I meant.\n\n                                     WILLS\n                         That I'm old.\n\n                                     CHARLOTTE\n                         Uh-huh.\n\n               INT. BARNEY'S LOBBY -- LATER\n\n               Wills walks a little self-consciously. He wears around his \n               shoulders a sloppily draped wrinkly silk scarf.\n\n               He walks past OTHER SHOPPERS. Among a GROUP OF WOMEN walking \n               past him FIND CHARLOTTE who subtly checks him out as though \n               he were a stranger.\n\n               As she passes by, she gives him a sexy look, then, not very \n               subtly, she spins around to look at his ass.\n\n               Finally, she breaks character, runs after him, and throws \n               her arms around his neck from behind.\n\n                                     CHARLOTTE\n                         Perfectly imperfect!\n\n               Laughing, he holds her hands and hauls her on his back to \n               the door.\n\n               INT. ITALIAN RESTAURANT -- NIGHT\n\n               Wills and Charlotte are in the middle of a candlelight dinner. \n               Wills refills her wine glass --\n\n                                     WILLS\n                         I don't know why, but for some odd \n                         reason, I feel absolutely compelled \n                         to tell you the truth about this... \n                         even at the risk of --\n\n                                     CHARLOTTE\n                         Hey, you're giving me the creeps. \n                         Just spit it out.\n\n               Wills holds his breath for a moment, then exhales and says \n               it --\n\n                                     WILLS\n                         I never had a date for the benefit. \n                         My plan from the beginning was for \n                         you to come with me.\n\n               Charlotte sets down her wine glass as she pieces it together --\n\n                                     CHARLOTTE\n                         So I made the hat for myself?\n                              (He nods.)\n                         And you bought that dress for me?\n                              (He nods.)\n                         And you did all this just so you \n                         could sleep with me?\n                              (He nods.)\n                         Why? I mean, why me?\n\n               Wills settles himself, then, meeting her eyes, speaks softly --\n\n                                     WILLS\n                         The eulogy you gave at Ella's service \n                         was so... impressive. You spoke about \n                         her death... about loss... in a way \n                         that I could never have done. You \n                         understood life emotionally in a way \n                         that I didn't. Whatever that \n                         understanding was, I wanted to get \n                         close to it.\n\n                                     CHARLOTTE\n                         And sex seemed like the best way to \n                         do it.\n\n                                     WILLS\n                         And the most enjoyable, yeah.\n\n               Charlotte sips her wine and considers. Then she sets down \n               her glass --\n\n                                     CHARLOTTE\n                         Well, first of all, let me say, you \n                         have great taste because that little \n                         Dolce & Gabbana was to die for.\n\n                                     WILLS\n                         Thanks.\n\n                                     CHARLOTTE\n                         And, second, don't ever lie to me \n                         again.\n\n                                     WILLS\n                         All right.\n\n                                     CHARLOTTE\n                         Seriously. There isn't a lie in the \n                         whole world I'd rather hear than the \n                         truth.\n\n               Wills stares at her solemnly. Her expression just as somber, \n               she lifts a hand and points to her lips. He leans forward to \n               kiss her.\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               Wills and Charlotte, kissing deeply, tumble fully clothed \n               onto the bed. As their passion builds, Wills reaches for the \n               bedside lamp.\n\n               Charlotte watches curiously, thoughtfully, as he pulls the \n               cord, plunging the room into UTTER DARKNESS.\n\n               MUSIC UP: A SEQUENCE BEGINS\n\n               -- Savoring the last sunny days of autumn, Wills and Charlotte \n               walk across the green of Central Park, which swarms with \n               happy, healthy teenagers.\n\n               -- At night, Wills and John and his wife Sarah sit in box \n               seats at Yankee Stadium watching the play-offs. Bernie \n               Williams hits a colossal shot. The crowd jumps to its feet. \n               As the ball flies over the right field wall, we see that \n               Charlotte sits next to Wills, munching a hotdog, her nose \n               buried in a book, utterly uninterested.\n\n               -- In Elysium's kitchen, Wills watches on as Charlotte, \n               wearing an apron over her clothes, prepares bisque under the \n               approving eye of the CHEF. She quickly and expertly pours a \n               cup of cream and a cup of broth into a large blender. Then \n               she dumps in lobster meat and adds some saffron. Just when \n               she, with a dramatic flourish, is about to hit the start \n               button, Wills INTERRUPTS and puts the lid on the blender.\n\n               -- One morning, Charlotte sits up in bed doing the Sunday \n               New York Times crossword puzzle. Olivia sits on the chair \n               next to the bed, chatting and laughing with her. Wills enters, \n               carrying a silver tray laden with breakfast. Olivia looks up \n               and gestures haughtily for him to set it down, as though he \n               were the housekeeper.\n\n               -- At the Metropolitan Museum of Art, Wills and Charlotte \n               wander amid the shadows of Egyptian ruins.\n\n               MUSIC OUT.\n\n               INT. METROPOLITAN MUSEUM LOBBY -- LATER\n\n               Flipping through a stack of postcards he has just purchased, \n               Wills waits for Charlotte to come out of the ladies room.\n\n               He idly glances up as a STREAM OF TOURISTS moves past. He is \n               about to look away when his eye catches someone.\n\n               It is Lisa, the young woman who spoke to Charlotte at the \n               benefit. Around her neck she wears a chain bearing a Met \n               employee photograph I.D. She carries a take-out coffee.\n\n               Wills FOLLOWS HER, agitated and curious.\n\n               He sees her pass through a set of glass doors into the Watson \n               Research Library.\n\n               He hurries over to the doors just in time to see her disappear \n               behind a bank of card catalogues.\n\n               Wills notices a sign at the door that forbids entry to the \n               public. He hesitates, then enters.\n\n               He speaks to the first person he sees -- a ROTUND FEMALE \n               LIBRARIAN IN HER 60'S. He stops and asks a question about \n               Lisa. She nods.\n\n               Wills is shaken by the answer. He stares into the middle \n               distance, wondering what to do, his mind racing.\n\n               The librarian, a little nervous now, reminds him that he is \n               not allowed in the library. He snaps to, thanks her, and \n               moves away.\n\n               But then he stops, takes out a BUSINESS CARD, and returns to \n               the librarian. He is about to hand it to her, but then he \n               thinks better of it.\n\n               Flustered, he thanks her again and exits. The librarian looks \n               after him, confused and a little apprehensive.\n\n               INT. HALLWAY OUTSIDE THE LIBRARY -- SAME\n\n               Wills sees Charlotte at the end of the hall looking around \n               for him. When she spots him, her face brightens. She calls \n               out facetiously as she walks to him --\n\n                                     CHARLOTTE\n                         I thought I told you to wait right \n                         there!\n\n                                     WILLS\n                         I got restless.\n\n                                     CHARLOTTE\n                         Well, I hope you didn't talk to \n                         anybody!\n\n                                     WILLS\n                         Not a soul.\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               Wills and Charlotte stand, disrobing in the near-total \n               darkness. They converse in whispers, between kisses --\n\n                                     CHARLOTTE\n                         You know what would scare me right \n                         now?\n\n                                     WILLS\n                         What?\n\n               Charlotte moves slowly through the darkness.\n\n                                     CHARLOTTE\n                         This.\n\n               She yanks a cord by the window. The BLIND OPENS and the room \n               is flooded with MOONLIGHT. The room is still dark, but she \n               is far more clearly visible.\n\n               Her dress is unbuttoned down the front. She walks back to \n               him and stops about five feet away.\n\n               She releases the last buttons on her dress, then slides it \n               off her shoulders to the floor. She wears only her underwear. \n               She crosses her arms over her breasts, and smiles --\n\n                                     CHARLOTTE\n                         Have I told you my latest motto?\n\n                                     WILLS\n                         No.\n\n                                     CHARLOTTE\n                         If it's scary, do it.\n\n                                     WILLS\n                         I'm not sure I like that motto.\n\n                                     CHARLOTTE\n                         I'm not sure that matters.\n\n               She closes her eyes, takes a deep breath, then slips off her \n               underwear. She drops her arms to her side.\n\n               She stands before him entirely naked.\n\n               Her self-consciousness is excruciating but she is determined \n               to endure it. Finally, she opens her eyes and smiles with a \n               hint of pride.\n\n               Wills' eyes widen as he takes her in. He crosses to her and \n               lays his hands on her hips. He kisses her neck.\n\n               As their breathing quickens, she begins to unbutton his shirt \n               and pull it free of his pants.\n\n               He takes hold of her hands, stopping her, and starts to ease \n               her toward the bed. She resists. Wills falters and she \n               realizes something.\n\n                                     CHARLOTTE\n                         Oh my God.\n\n                                     WILLS\n                         What?\n\n                                     CHARLOTTE\n                         You're scared, too.\n\n               From his expression, she knows she is right.\n\n                                     CHARLOTTE\n                         Your turn.\n\n               For the first time since we've met him, Wills is utterly at \n               a loss. But he sees that Charlotte has no intention of backing \n               down.\n\n               He begins to undress. His hands are uncertain as he untucks \n               his shirt and unbuckles his belt. When he is finished \n               undressing, he turns to face her, his arms at his side.\n\n               Although we cannot see him in the moonlight and shadows, \n               Charlotte can. She looks down at his naked body and studies \n               it. He stares back with shy wariness.\n\n               Then she breaks into a crooked grin --\n\n                                     CHARLOTTE\n                         What's the matter, old man? Can't \n                         afford a gym?\n\n                                     WILLS\n                         That's it!\n\n               Laughing, he grabs her wrists and throws her on the bed. She \n               dissolves into paroxysms of laughter.\n\n               INT. WILLS BEDROOM -- LATER\n\n               Wills and Charlotte make love. As their passion builds, \n               Charlotte is suddenly stabbed with a pain in her chest.\n\n               She grabs his back, her face twists. She holds her breath, \n               not wanting to reveal the incident to Wills. She closes her \n               eyes and exhales as the pain subsides.\n\n               INT. WILLS' BEDROOM -- LATER\n\n               Wills and Charlotte lie in bed with the blinds open and the \n               city glimmering in the distance.\n\n               Charlotte's head rests on his chest. Eyes closed, he brushes \n               his hand along her face as though he were a blind man \n               committing every detail to memory.\n\n               Charlotte's voice, almost inaudible, drifts up through the \n               dark --\n\n                                     CHARLOTTE\n                         \"Counting the beats, \n                         Counting the slow heart beats, \n                         The bleeding to death of time \n                         In slow heart beats, \n                         Wakeful they lie.\"\n\n               Wills, half-asleep, murmurs deeply --\n\n                                     WILLS\n                         So many words in that wonderful head \n                         of yours...\n\n                                     CHARLOTTE\n                         If I could give you anything in the \n                         whole world, that's what it would \n                         be.\n\n                                     WILLS\n                         Words?\n\n                                     CHARLOTTE\n                         Poetry.\n\n               They lie in silence.\n\n               EXT. CENTRAL PARK WEST -- LATE AFTERNOON\n\n               Dusk falls on the park. Charlotte, red-cheeked and happy, \n               carrying shopping bags, walks into a brisk autumn breeze.\n\n               She smiles at a BUNCH OF SCHOOL KIDS, dressed in HALLOWEEN \n               COSTUMES, being led on their trick or treating.\n\n               INT. ELYSIUM REAR OFFICE -- AFTERNOON\n\n               Wills sits at a desk, reading the newspaper. John, inspecting \n               a KING HENRY VIII COSTUME on a hanger, shouts into the \n               telephone --\n\n                                     JOHN\n                         Oh no, your boy made it! At ten \n                         minutes before close! All night I \n                         got a card announcing a halibut \n                         special, only I got no halibut! Now \n                         it's Sunday and I got three dozen \n                         cats lickin' their chops in the alley! \n                         Tony, I don't wanna hear it! I don't \n                         wanna hear it! I don't wanna -- MAN, \n                         GO TO HELL!\n\n               He slams down the phone. His face is beet red. Wills looks \n               up calmly from his paper --\n\n                                     WILLS\n                         Are you familiar with the phrase, \n                         \"You can catch more flies with honey \n                         than with vinegar?\"\n\n                                     JOHN\n                         Are you familiar with the phrase, \n                         \"Mind your own god damn business?\"\n\n                                     WILLS\n                         Sure, it's from Poor Richard's \n                         Almanac. But the last time I checked --\n\n                                     JOHN\n                         No, your business is to smile, make \n                         friends, and get rich! My business \n                         is the business.\n\n               John heads out, then stops abruptly and looks back. His tone \n               is suddenly calm and curious --\n\n                                     JOHN\n                         What're you doin' here, anyway? You \n                         got a girl. Go home. Carve a pumpkin.\n\n                                     WILLS\n                         We can't spend every waking moment \n                         together.\n\n               John looks at him strangely, with a hint of suspicion --\n\n                                     JOHN\n                         Why not?\n                              (pause)\n                         No, seriously. Why not?\n\n               Wills has no answer. John moves closer when Celia, his new \n               assistant, enters cheerily --\n\n                                     CELIA\n                         Special delivery!\n\n               She tosses him a paper bag; he catches it.\n\n                                     WILLS\n                         No trouble?\n\n                                     CELIA\n                         None.\n\n               Wills removes a PAIR OF RED PLASTIC HORNS. John shakes his \n               head with disbelief.\n\n                                     JOHN\n                         Every year. You got no imagination.\n\n                                     WILLS\n                         It's a classic. A little spirit gum \n                         and voila!\n\n               He holds the horns up to his forehead.\n\n                                     WILLS\n                         -- young women are rendered helpless.\n\n                                     CELIA\n                         It's true. I see a guy with horns \n                         growing out of his head and my knees \n                         go weak.\n\n                                     WILLS\n                         Of course -- it's biological.\n\n               They share a laugh. A flirtatious charge passes between them. \n               She blushes slightly and exits. John looks suspiciously at \n               Wills.\n\n                                     JOHN\n                         What's goin' on?\n\n                                     WILLS\n                         What do you mean?\n\n                                     JOHN\n                         At home.\n\n               Wills smiles at him as though he were insane --\n\n                                     WILLS\n                         Nothing. Honestly. We're having a \n                         lot of fun. We're very happy.\n\n               From the next scene, we hear Charlotte laughing --\n\n                                     CHARLOTTE'S VOICE\n                         Don't come in! Don't!\n\n               INT. WILLS' LIVING ROOM -- AFTERNOON\n\n               A fire burns in the fireplace. Still wearing his coat, wills \n               stands by the mantel, sorting through a stack of mail --\n\n                                     WILLS\n                         I'm not even tempted!\n\n                                     CHARLOTTE'S VOICE\n                              (from another room)\n                         I'll be right out!\n\n               Olivia enters with a steamy mug --\n\n                                     OLIVIA\n                         You like hot cider?\n\n                                     WILLS\n                         Sure, thanks.\n\n               She carefully takes his coat off him as he sips the cider --\n\n                                     WILLS\n                         Mmmm.\n\n                                     OLIVIA\n                         Charlotte made it. I just poured it \n                         in the cup.\n\n               She exits. As Wills sips the drink, he sits on the leather \n               sofa and continues to glance through his mail.\n\n               Suddenly, shocked, he stops on a letter. He sets his mug \n               down. He hears Charlotte making noise in the next room. He \n               opens the letter and begins to read.\n\n               His eyes dart down the page, but he quickly sees that the \n               letter is not friendly. His face shows disappointment.\n\n               He hears footsteps in the hall. He folds the letter up, slips \n               it back into its envelope, and jams it in his back pocket.\n\n               Charlotte enters and throws her hands out to her side --\n\n                                     CHARLOTTE\n                         Ta-da!\n\n               She stands before him, dressed in a WHITE SPINSTERLY VICTORIAN \n               OUTFIT with braids coiled at her ears. Wills smiles with \n               appreciation --\n\n                                     WILLS\n                         Incredible.\n\n                                     CHARLOTTE\n                         Don't I look just like her?\n\n                                     WILLS\n                         Absolutely incredible.\n\n               Pause.\n\n                                     CHARLOTTE\n                         You have no idea who I am.\n\n                                     WILLS\n                         Give me a hint.\n\n                                     CHARLOTTE\n                         \"Hope is the thing with feathers \n                         that perches in the soul.\"\n\n                                     WILLS\n                         Was that the hint?\n\n                                     CHARLOTTE\n                         You dummy! Emily Dickinson! Only the \n                         greatest American female poet ever!\n\n               She hugs and kisses him --\n\n                                     CHARLOTTE\n                         Uncultured swine.\n\n                                     WILLS\n                         The truth is out. I've lost you \n                         forever.\n\n                                     CHARLOTTE\n                         Wanna bet?\n\n               She lays her head on his chest, smiling contentedly. A subtle \n               shadow of apprehension passes over Wills' features. Eyes \n               closed, she asks --\n\n                                     CHARLOTTE\n                         When do I get to see your costume?\n\n               EXT. BROOKLYN BROWNSTONE -- ESTABLISHING -- NIGHT\n\n               A cardboard ghost hangs on the door. A Jack-o'-lantern grins \n               in the window. A HALLOWEEN PARTY is in full swing.\n\n               INT. BROOKLYN LIVING ROOM -- SAME\n\n               John's wife, Sarah, dressed as QUEEN ELIZABETH, walks through \n               the crowd, picking up empty glasses and bottles.\n\n               As she moves among COSTUMED GUESTS and their CHILDREN, we \n               notice a few of Elysium's customers and staff, including \n               Celia, dressed as GLINDA, talking to the maitre d', Jesus, \n               dressed as a COWBOY --\n\n                                     JESUS\n                         No, I think we make a great couple. \n                         A good witch and a bad hombre. That \n                         could make for some very interesting \n                         sex.\n\n               Celia laughs.\n\n               INT. BROOKLYN KITCHEN -- CONTINUOUS\n\n               Wills stands off to the side, wearing his devil's horns, \n               sipping a drink, watching an EIGHT-YEAR-OLD BOY bob for \n               apples, while other BOYS and GIRLS cheer him on.\n\n               John, wearing his king costume, supervises, as the boy, wildly \n               sputtering, struggles to bite into a renegade Granny Smith.\n\n                                     JOHN\n                         O, Ricky, chill out! You're gonna \n                         get snot in the water!\n\n               The boy laughs even harder. John facetiously grabs his collar --\n\n                                     JOHN\n                         That's it -- outta the pool!\n\n               The boy, choking with laughter, plunges his face into the \n               water again. Sarah enters and calls out over the din --\n\n                                     SARAH\n                         Where're the girls? I thought you \n                         were tucking them in!\n\n                                     JOHN\n                         We got a volunteer!\n\n               Sarah, smiling curiously, heads to the back stairwell.\n\n               She sees Wills standing there. Watching the kids, his eyes \n               are filled with the same sort of wistful yearning that she \n               noticed at the toy store --\n\n               She gives him an affectionate poke in the stomach as she \n               passes by and disappears upstairs.\n\n               Finally, the boy grabs the apple in his teeth and lifts his \n               soaked head to the cheers of his friends.\n\n               Then he grabs it out of his mouth and begins taking big bites \n               out of it until he uncovers a SILVER DOLLAR.\n\n               Wills laughs at the kids' excitement. A moment later a WOMAN'S \n               GLOVED HANDS cover his eyes.\n\n                                     WOMAN\n                         Guess who?\n\n               Wills feels her LONG GLOVES.\n\n                                     WILLS\n                         Wonder Woman?\n\n                                     WOMAN\n                         No.\n\n                                     WILLS\n                         Batgirl?\n\n                                     WOMAN\n                         I'll give you a hint. You dumped me.\n\n                                     WILLS\n                         Princess Di?\n\n               She laughs and playfully strangles him.\n\n                                     WILLS\n                         Wendy?\n\n               He turns and sees that it's the woman from the film's opening, \n               dressed as HOLLY GOLIGHTLY.\n\n                                     WILLS\n                         Yup, I'd know that throttle anywhere!\n\n               INT. BROOKLYN SECOND-FLOOR HALLWAY -- SAME\n\n               Sarah stops silently at an AJAR DOOR and looks inside. \n               Charlotte sits on a bed between the twin girls who are nestled \n               up against her --\n\n                                     MOLLY\n                         Just one more.\n\n                                     CARLA\n                         Please?\n\n                                     CHARLOTTE\n                         All right, but this is the last last \n                         one!\n\n               She clears her throat and settles herself. The twins listen \n               with rapt attention as she recites from memory, slowly as \n               though it were a suspenseful bedtime story --\n\n                                     CHARLOTTE\n                         \"Because I could not stop for Death, \n                         He kindly stopped for me; \n                         The carriage held but just ourselves \n                         And Immortality. \n                         We slowly drove, he knew no haste, \n                         And I had put away \n                         My labor, and my leisure too, \n                         For his civility.\"\n\n               Charlotte looks up and sees Sarah, who face is beaming with \n               affection. They share a smile and Charlotte keeps reciting --\n\n                                     CHARLOTTE\n                         \"We passed the school where children \n                         played \n                         At wrestling in a ring; \n                         We passed the fields of grazing grain, \n                         We passed the setting sun.\"\n\n               Sarah eases the door shut and steps away.\n\n               INT. BROOKLYN LIVING ROOM -- HOUR LATER\n\n               THE CAMERA makes a CIRCUIT of the THINNING CROWD. Sarah blows \n               out candles, dumps ash trays, and collects empties.\n\n               Charlotte, rubbing a knuckle into her sleepy eye, descends \n               the stairs. She sees Celia talking to Jesus, and walks over \n               to them --\n\n                                     CELIA\n                         Sweet dreams?\n\n                                     CHARLOTTE\n                         I had no idea I was so tired.\n\n                                     SARAH\n                              (from across the room)\n                         They're down?\n\n                                     CHARLOTTE\n                         And out.\n                              (looking around)\n                         Where's Lucifer?\n\n                                     JESUS\n                              (jokingly)\n                         Last time I saw him, he was in the \n                         kitchen going pretty heavily with \n                         Holly Golightly.\n\n                                     CELIA\n                         Hey, no gossip! Holly's a valued \n                         customer.\n\n               Charlotte pretends to be fighting mad --\n\n                                     CHARLOTTE\n                         Lemme at 'er!\n\n                                     JESUS\n                         Hell hath no fury like a recluse \n                         scorned.\n\n               Charlotte laughs and heads to the kitchen.\n\n               INT. BROOKLYN KITCHEN -- SAME\n\n               John wipes down the table which is littered with bits of \n               apple.\n\n                                     CHARLOTTE\n                         Hey, shouldn't one of your minions \n                         be doing that?\n\n                                     JOHN\n                         You know, in my day, you bobbed for \n                         the apple, and, sure, maybe there \n                         was a nickel inside it and that was \n                         sweet -- but you ate the god damn \n                         apple! These little animals grab the \n                         coin and they're out the door!\n\n                                     CHARLOTTE\n                         -- off to buy crack!\n\n                                     JOHN\n                         Exactly my point.\n\n               They share a laugh.\n\n                                     CHARLOTTE\n                         Seen Beelzebub around?\n\n                                     JOHN\n                         The Prince of Darkness?\n\n                                     CHARLOTTE\n                         Uh-huh.\n\n                                     JOHN\n                         Yeah, he went upstairs.\n\n               Charlotte is puzzled.\n\n               INT. BROOKLYN SECOND-FLOOR HALLWAY -- LATER\n\n               Charlotte walks down the hall, opening doors and glancing \n               inside. She opens a bathroom and THREE CATS dash out.\n\n                                     CHARLOTTE\n                         Shit.\n\n               She gets to the end of the hall and is about to give up. \n               When she hears FOOTSTEPS.\n\n               She walks around the corner and sees a NARROW STAIRCASE \n               leading to the third floor.\n\n               At the dark at the top of the stairs Wills and Wendy appear. \n               Charlotte smiles --\n\n                                     CHARLOTTE\n                         You lost your horns.\n\n                                     WILLS\n                         Hey, looking for me?\n\n                                     CHARLOTTE\n                         Uh-huh.\n\n                                     WILLS\n                         We were checking out the roof. John's \n                         got quite a set-up.\n\n               They arrive at the bottom of the stairs.\n\n                                     WILLS\n                         Wendy, this is Charlotte Fielding. \n                         Charlotte -- my friend Wendy Lister.\n\n               They smile and shake hands. Charlotte looks at them both \n               carefully for any sign of uneasiness. There is none.\n\n                                     WENDY\n                         Actually, I saw you at that memorial \n                         service in Connecticut. Your eulogy \n                         was beautiful.\n\n                                     CHARLOTTE\n                         Thank you.\n\n                                     WENDY\n                              (re: her outfit)\n                         Betsy Ross, right?\n\n                                     CHARLOTTE\n                         You guessed it.\n\n               Wills smiles and rubs his hands together --\n\n                                     WILLS\n                         Is the party over?\n\n               EXT. BROOKLYN BRIDGE -- NIGHT\n\n               A TOWN CAR speeds toward Manhattan.\n\n               INT. TOWN CAR -- SAME\n\n               Wills and Charlotte stare straight ahead, each lost in \n               thought. The lights of the city illuminate their faces in \n               eerie flashes.\n\n               Finally, Wills glances over and smiles --\n\n                                     WILLS\n                         I have a strange feeling that you're \n                         upset with me.\n\n                                     CHARLOTTE\n                         No, I was just wondering if you had \n                         sex with that woman.\n\n                                     WILLS\n                         Ever?\n\n                                     CHARLOTTE\n                         No, the answer to that's pretty \n                         obvious. I meant tonight. On the \n                         roof.\n\n               Wills breaks into a grin --\n\n                                     WILLS\n                         You're not serious.\n\n               Wills laughs to himself, then glances up and sees the \n               reflection of the driver's amused eyes in the rearview mirror. \n               Wills smiles back at Charlotte --\n\n                                     WILLS\n                         Of course not. Why would I want to \n                         do something like that?\n\n                                     CHARLOTTE\n                         That's what I was wondering. I \n                         thought, \"We're so happy he'd have \n                         no reason to do it. And if he did do \n                         it, he'd at least look guilty, \n                         wouldn't he? But he doesn't. He looks \n                         more relaxed than before the party \n                         started.\"\n\n                                     WILLS\n                         Well, there you have it.\n\n                                     CHARLOTTE\n                         But then I thought, \"He's a womanizer -- \n                         that's what they say.\" Funny word, \n                         huh? Sounds like some sorta machine. \n                         \"And how do you get to be a womanizer? \n                         Obviously by sleeping with lots of \n                         different women for no good reason \n                         and being really good at lying about \n                         it.\"\n\n                                     WILLS\n                         Sure, except that --\n\n                                     CHARLOTTE\n                         Let me finish.\n\n               Again, Wills looks up at the driver's eyes in the mirror. \n               They seem more serious now.\n\n                                     CHARLOTTE\n                         Anyway, there's something about being \n                         sick right here --\n\n               She touches her own chest. Her voice trembles slightly --\n\n                                     CHARLOTTE\n                         -- that has made me acutely aware of \n                         my heart. Nothing corny -- I mean, \n                         literally... I feel every beat. I \n                         know how sensitive it is. It reacts \n                         to everything.\n\n               She turns in her seat and lifts an OPEN PALM.\n\n                                     CHARLOTTE\n                         If you're lying to me, I'll know it.\n                              (beat)\n                         Did you have sex with Wendy on the \n                         roof?\n\n               He smiles at her as though he were indulging a child. She \n               looks him deeply in the eye and opens a button of his shirt.\n\n               She slips her palm inside, over his heart.\n\n               Still smiling, he doesn't move a muscle.\n\n               Their eyes are locked.\n\n               Ever so slowly, her face crumples and tears appear in her \n               eyes. She shakes her head --\n\n                                     CHARLOTTE\n                         My God... oh my God.\n\n               She slides away from him, drops her face into her hands, and \n               begins to cry. Wills looks down, then glances up at the \n               rearview mirror.\n\n               Illuminated in flashes, the driver's eyes have taken on an \n               ominous, unblinking quality as though they were the outward \n               embodiment of his own conscience.\n\n               Wills looks out the window. When he finally speaks, his voice \n               is calm and a little cold --\n\n                                     WILLS\n                         Look, I never pretended to be anything \n                         other than --\n\n                                     CHARLOTTE\n                              (a piteous cry)\n                         You hate yourself so much!\n\n               Wills is stunned. He looks out the window, speechless, his \n               eyes small and frightened.\n\n               EXT. CHARLOTTE'S BROWNSTONE -- NIGHT\n\n               The town car is stopped at the curb, motor running, lights \n               on.\n\n               INT. TOWN CAR -- SAME\n\n               Charlotte and Wills sit in silence --\n\n                                     WILLS\n                         This was all a mistake. Right from \n                         the start. All of it. I'm a grown \n                         man and you're a child.\n                              (beat)\n                         Anyway, you have better things to do \n                         with your last -- With your time \n                         than spend it with me.\n\n                                     CHARLOTTE\n                              (distantly)\n                         What about you? Do you have anything \n                         better?\n\n               Wills has no answer. Charlotte slowly gets out of the car. \n               She leans back in, her eyes narrow with disdain --\n\n                                     CHARLOTTE\n                         You know, maybe you're right. Maybe \n                         this is the best time to end it. \n                         Because I was actually starting to \n                         love you, Wills, and that's the last \n                         thing I ever wanted.\n\n               She shuts the door.\n\n               INT. BROWNSTONE FOYER -- NIGHT\n\n               As Charlotte enters, we hear Wills' cab pull away. She moves \n               to the stairs and sees a LIGHT shining beneath the living \n               room door.\n\n               INT. BROWNSTONE LIVING ROOM -- SAME\n\n               Dolores sits watching an old movie, her eyes dulled by a \n               cataract of boozy fatigue. The door opens. She looks up and \n               sees Charlotte in costume.\n\n                                     DOLLY\n                         Well, if it ain't the Belle of \n                         Amherst.\n\n               Charlotte smiles feebly and plops down on the cracked leather \n               ottoman. She looks blankly at the TV. She sniffles and wipes \n               a hand across her nose. Dolores glances over, then back at \n               the set.\n\n                                     DOLLY\n                         Seen that face before.\n\n                                     CHARLOTTE\n                         You have?\n\n                                     DOLLY\n                         And for the same god damn reason.\n\n               Charlotte is confused, but then puts it together --\n\n                                     CHARLOTTE\n                         But you said Wills and my Mom were \n                         just friends.\n\n                                     DOLLY\n                         Sure, but she was nuts about him. \n                         The only reason she didn't sleep \n                         with him is 'cause she was \n                         sentimental. And smart. She wanted a \n                         ring first.\n\n                                     CHARLOTTE\n                         Why didn't he give her one?\n\n                                     DOLLY\n                         'Cause he knocked up little Millie \n                         Tyler instead. In Newport. At Bailey's \n                         Beach. During the Labor Day clam \n                         bake.\n\n               She chuckles grimly, coughs, and sips her drink.\n\n                                     DOLLY\n                         Millie was your mom's best friend \n                         from Nightingale. You had to hand it \n                         to him. He sure knew how to make a \n                         point.\n\n               She coughs again. Charlotte struggles to make sense of it \n               all.\n\n                                     CHARLOTTE\n                         Why did he do that?\n\n                                     DOLLY\n                         Aw, who the hell knows? 'Cause the \n                         moon was full. 'Cause life's short. \n                         'Cause he's Wills Keane. I'll tell \n                         you a little secret -- after that, \n                         your Mom hated his guts, but your \n                         dad never made her smile like he \n                         did.\n                              (pause)\n                         'Course your dad never made her cry \n                         like that either.\n\n                                     CHARLOTTE\n                              (softly)\n                         Why didn't you tell me any of this \n                         before?\n\n                                     DOLLY\n                         Oh, I dunno...\n\n                                     CHARLOTTE\n                         You never talk to me! You never try \n                         to help me!\n\n               Dolores' eyes grow nervous. She swallows hard.\n\n                                     DOLLY\n                         Christ, look at me. I'm gonna tell \n                         you what to do?\n\n                                     CHARLOTTE\n                         Yes! You're my family. You're supposed \n                         to take care of me.\n\n                                     DOLLY\n                         Aw, you wouldn't listen. That's the \n                         thing about people -- they just do \n                         what they want from the day they're \n                         born till the day they die.\n\n               She realizes her poor choice of words. She looks over and \n               their eyes collide. Charlotte begins to cry --\n\n                                     CHARLOTTE\n                         No, that's you, Dolly! People who \n                         have given up don't listen to other \n                         people! People who want to die close \n                         off! That's not me! I wanted your \n                         help! I wanted to learn!\n\n               Charlotte drops her head dejectedly.\n\n                                     CHARLOTTE\n                         Anything... anything you would ever \n                         have told me, I would have listened \n                         to! I promise.\n\n                                     DOLLY\n                              (fighting tears)\n                         Aw, come on, honey. I can throw a \n                         party and I can mix a gimlet. After \n                         that, what the fuck do I know?\n\n               She rises, gives Charlotte a nervous, awkward pat on the \n               shoulder, then crosses over to the bar.\n\n               INT. WILLS' LIVING ROOM -- NIGHT\n\n               Wills stands in the center of the room, looking around \n               blankly. He disappears into the bedroom.\n\n               INT. WILLS' BEDROOM -- CONTINUOUS\n\n               Wills enters and sees some of Charlotte's clothes folded \n               neatly on the bed. A LITERARY ANTHOLOGY lies open, showing a \n               DRAWING OF EMILY DICKINSON.\n\n               He grabs the clothes and the book and puts them in a SHOPPING \n               BAG that she has left on the floor.\n\n               Then he walks into the bathroom. We see him gathering BEAUTY \n               PRODUCTS off the sink. He walks back in and sets them into \n               the shopping bag.\n\n               He looks around and spots a nearly completed crossword puzzle \n               sitting folded on the dresser. He drops that in the shopping \n               bag, too, then sets it by the door.\n\n               He feels a draft and spots an OPEN WINDOW. As he crosses to \n               it, he notices something on his pillow. A blank ENVELOPE. He \n               picks it up and rips it open.\n\n               It's a HALLOWEEN CARD of a grinning JACK-O-LANTERN. He opens \n               it and inside is handwritten:\n\n               The scariest night of the year and only one thing haunts me: \n               that we might never have met.\n\n               All my love, \n               XXX Charlotte.\n\n               Wills lowers the card and heaves a deep breath. His jaw tight, \n               he walks over and drops the card into the shopping bag.\n\n               INT. BROWNSTONE FOYER -- SAME\n\n               Charlotte emerges from the living room and shuts the door \n               behind her. She climbs the stairs to her solitary bedroom.\n\n                                                             FADE TO BLACK:\n\n               FADE IN:\n\n               EXT. UPPER EAST SIDE -- NIGHT\n\n               From amid the RUSH OF TRAFFIC, a TAXI CAB breaks free and \n               glides to the curb in front of Elysium.\n\n               Wills emerges with PATTY, 35, bosomy, bright-eyed, pitched a \n               little too loudly. Wills seems stiff and tentative, a shadow \n               of his former self.\n\n               INT. ELYSIUM -- CONTINUOUS\n\n               AN ELDERLY COUPLE passes them as they enter. Wills stops at \n               the coat check and helps Patty with her coat. She admires \n               the decor --\n\n                                     PATTY\n                         Oh, Wills, it's beautiful!\n\n               Although his spirits are low, he is effortlessly cordial --\n\n                                     WILLS\n                         Thank you. It was designed by a team \n                         from --\n\n                                     PATTY\n                         So functional! Is that stainless \n                         steel?\n\n                                     WILLS\n                         Actually, no, it's velvet.\n\n               She furrows her brow, squints, then laughs.\n\n                                     PATTY\n                         Oh, my God, it is!\n\n               Wills hands Patty's coat to Melissa, the hat check girl, and \n               asks under his breath --\n\n                                     WILLS\n                         How are you?\n\n               Looking at Patty, Melissa asks with deep sympathy --\n\n                                     MELISSA\n                         How are you, sir?\n\n               Before Wills can respond, Patty takes his arm --\n\n                                     PATTY\n                         Well, if the food's even half as \n                         good as the moldings I'm in for a \n                         very special treat.\n\n               Jesus is surprised to see that Wills is not with Charlotte --\n\n                                     JESUS\n                         Uhhh, good evening, Mr. Keane. Will \n                         you be dining with us?\n\n                                     WILLS\n                         Yes, Jesus. Table seven, if it's \n                         available.\n\n                                     JESUS\n                         Certainly, sir.\n\n               Celia approaches, equally surprised not to see Charlotte --\n\n                                     WILLS\n                         Hello, Celia.\n\n                                     CELIA\n                              (sincerely)\n                         How are you this evening, sir?\n\n                                     WILLS\n                         I've been worse.\n\n                                     CELIA\n                              (under her breath)\n                         Are you sure?\n\n               The NEW HOSTESS, Celia's replacement, arrives.\n\n                                     JESUS\n                         Table Seven.\n\n                                     NEW HOSTESS\n                         This way, please.\n\n                                     WILLS\n                              (to Patty)\n                         Order a drink. I'll be right with \n                         you.\n\n               Patty follows Celia. Wills moves to the reservation stand \n               where John stands, stone-faced, flipping through the \n               reservation book --\n\n                                     JOHN\n                         Where the hell you been?\n\n                                     WILLS\n                         Splendid, how are you?\n\n                                     JOHN\n                         Where's Charlotte?\n\n                                     WILLS\n                         Deliveries on time?\n\n                                     JOHN\n                         Who's the broad? She looks like a \n                         Holiday-Inn hooker from Ohio.\n\n                                     WILLS\n                         Keep up the good work!\n\n               Wills walks away.\n\n               INT. DOWNTOWN BAR -- NIGHT\n\n               Dark, smoky, and boisterous. FIND CHARLOTTE, standing with \n               Simon. She looks around disgustedly and shouts above the \n               roar --\n\n                                     CHARLOTTE\n                         Okay, I'm chugging Scotch, gagging \n                         on smoke, and losing my hearing! Now \n                         why is this so good for me again?!\n\n                                     SIMON\n                         That's just it! The great spiritual \n                         benefit in leaving one's room is \n                         that it reminds one of how odious it \n                         is to leave one's room!\n\n               ACROSS THE ROOM\n\n               FOLLOW SHANNON, coming out of the ladies' room. She makes \n               her way through the crowd--\n\n                                     SHANNON\n                         Excuse me! Excuse me! Sorry! Excuse \n                         me!\n\n                                     BOY'S VOICE\n                         No problem!\n\n               She looks up and can't believe her eyes.\n\n               BACK TO CHARLOTTE AND SIMON\n\n               Simon, shouting above the music, speaks with difficulty --\n\n                                     SIMON\n                         There's one thing you don't know \n                         about Mr. Keane and his adultery and \n                         as painful as it is I feel that I \n                         should tell you!\n\n                                     CHARLOTTE\n                              (alarmed)\n                         What? What is it!\n\n                                     SIMON\n                         That woman on the roof? That was no \n                         ex-girlfriend! In fact, no woman at \n                         all. It was I, Simon Loring, master \n                         of disguise! Willsy and I have moved \n                         in together!\n\n               Charlotte laughs and slaps him. Shannon approaches hauling \n               by the hand ERIC BALES, 24, small, beautiful, long-haired, \n               glasses.\n\n                                     SHANNON\n                         Look what I found!\n\n               Charlotte can't believe it either --\n\n                                     CHARLOTTE\n                         Eric! Wow!\n\n                                     ERIC\n                         Hey, Char!\n\n               They hug and kiss with some slight awkwardness, then shout \n               above the music --\n\n                                     CHARLOTTE\n                         God, long time no see! One night we \n                         show up to rent Eraserhead and you're \n                         just gone!\n\n                                     ERIC\n                         Sorry about that!\n\n                                     SHANNON\n                         It was such a drag! You know, having \n                         to actually start paying to rent \n                         movies!\n\n                                     ERIC\n                         I bet!\n\n                                     CHARLOTTE\n                         What's up? Ralph said you moved to \n                         Rockland County!\n\n                                     ERIC\n                         Yeah, I got a job working for my \n                         mom's new boyfriend!\n\n                                     CHARLOTTE\n                         What does he do?\n\n                                     ERIC\n                         He sells pot!\n\n                                     SHANNON\n                         Cool!\n\n                                     ERIC\n                         Not really. I was a driver! I got \n                         laid off when he got busted. He's \n                         awaiting trial!\n\n                                     CHARLOTTE\n                         So what're you doing now?\n\n                                     ERIC\n                         Same thing pretty much. Only for \n                         Domino's!\n\n               Charlotte laughs.\n\n                                     SHANNON\n                         Whoa, I don't believe it!\n                              (to Eric)\n                         She hasn't laughed in like a week!\n\n               Eric smiles quizzically at Charlotte, wondering why.\n\n               INT. ELYSIUM -- NIGHT\n\n               Wills sits listening to Patty talk --\n\n                                     PATTY\n                         -- so everybody on the conference \n                         call starts introducing themselves. \n                         Ned Lewey, Paris Office. Takashi \n                         Matsuo, Tokyo Office. Whoever, the \n                         London Office. And then someone says, \n                         \"Will the architect from the New \n                         York office please identify himself.\" \n                         And I pipe up and say, \"Well, guys, \n                         I'm not a him or an architect. I'm \n                         Patty Strauss and I'm head of East \n                         Coast marketing.\" And there's like \n                         total silence. It was hysterical!\n\n               Wills smiles feebly. He looks away and sees John holding the \n               TELEPHONE, urgently signaling to him. Alarmed, Wills jumps \n               up --\n\n                                     WILLS\n                         I'm sorry, would you excuse me?\n\n                                     PATTY\n                         Of course.\n\n               AT THE RESERVATION STAND\n\n               Wills, fearing the worst, hurries to John --\n\n                                     WILLS\n                         Who is it?\n\n                                     JOHN\n                         Nobody!\n\n               John slams down the phone, grabs him by the arm, hauls him \n               through the reception area and out the door. Patty watches, \n               confused.\n\n               EXT. ELYSIUM -- CONTINUOUS\n\n               John walks quickly down the block, still hauling Wills --\n\n                                     JOHN\n                         Last time I checked I was your best \n                         friend!\n\n                                     WILLS\n                         So?\n\n                                     JOHN\n                         So after the party, no thank you! I \n                         call you three times -- no call back! \n                         And for six days you don't even eat \n                         at your own god damn restaurant! \n                         What am I supposed to think? Huh?! I \n                         was ready to call the morgue!\n\n                                     WILLS\n                         Relax, I'm alive.\n\n                                     JOHN\n                         Well, you sure don't look it!\n\n               EXT. ANOTHER BLOCK -- MINUTE LATER\n\n               John walks as quickly as he can with Wills struggling to \n               keep up --\n\n                                     JOHN\n                         I'll tell you why it's my concern! \n                         Because I had a god damn swimming \n                         pool! An ocean view! A fabulous lemon \n                         tree hangin' right over my Jacuzzi! \n                         And I gave it up for you, brother! \n                         Back to a life of concrete and dirt \n                         and sirens just so you could get \n                         your shit together!\n\n               EXT. ANOTHER BLOCK -- MINUTES LATER\n\n               John, walking a little more slowly now, cannot believe his \n               ears --\n\n                                     JOHN\n                         On my roof? You gotta be kiddin'! \n                         Not on my green chair! Tell me it \n                         wasn't on the green chair.\n\n               Wills winces.\n\n                                     JOHN\n                         Oh, great. Now how am I gonna clean \n                         that?\n\n               EXT. ANOTHER BLOCK -- MINUTE LATER\n\n               John walks slowly now, backward, listening to an anxious \n               Wills --\n\n                                     WILLS\n                         Look, it doesn't matter that she's \n                         sick -- she's still a kid and there's \n                         no way we should be together. It's \n                         unhealthy... it's... it's \n                         inappropriate...\n\n                                     JOHN\n                              (with disgust)\n                         What the hell is that? Some sorta \n                         shrink talk?\n\n                                     WILLS\n                         Look, if she were just fun... just \n                         some sort of diversion... maybe I \n                         could justify it. But the worst part \n                         is that it's becoming more. Much \n                         more. It's embarrassing how much I \n                         like her. She gets to me. She affects \n                         me...\n\n               He stops and leans back against a building. He looks around, \n               avoiding eye contact with John, as tears rise into his eyes.\n\n                                     WILLS\n                         And she's gonna be gone and... I'm \n                         not sure I can... I mean... I already \n                         think about her all the time...\n                              (fighting tears)\n                         Her smile kills me... and the \n                         thought... that it'll be gone... \n                         forever... that I'll never see her \n                         again... I don't know... I can't -- \n                         I don't think I'm that strong, Johnny. \n                         It's too much. I'd rather have it be \n                         over... over now. I'll start missing \n                         her now.\n\n               Wills is still unable to look at him. John speaks softly --\n\n                                     JOHN\n                         Buddy, I hate to break it to you, \n                         but in the real world... where I \n                         live... there're only two kindsa \n                         love stories. Boy loses girl and \n                         girl loses boy. That's all there is. \n                         Somebody always gets left behind. \n                         You try to avoid that, you'll end up \n                         an old man toastin' yourself with \n                         egg nog in the mirror on Christmas \n                         Eve. You'll end up dying in your own \n                         arms.\n\n               Wills lifts his frightened eyes. John pats him on the cheek.\n\n               EXT. HIGH-RISE APARTMENT BUILDING -- NIGHT\n\n               Wills stands with Patty in the driveway in front of the glass \n               lobby. He is distracted and terribly anxious. She looks as \n               though she expects, at the very least, a kiss --\n\n                                     PATTY\n                         Thank you so much. I had such a great \n                         time.\n\n                                     WILLS\n                         Good. I'm... I'm glad.\n\n                                     PATTY\n                         Didn't you?\n\n                                     WILLS\n                         Patty, I... I want to be honest with \n                         you... right now, from the start... \n                         so there's no room for \n                         misunderstanding. I didn't have a \n                         good time, but it's nothing personal. \n                         I just split up with someone and \n                         rather than admit to myself how much \n                         I miss her, I asked you out instead. \n                         And it's unfair. If I feel sad I \n                         should just feel sad and not try to \n                         use you... and your body... as some \n                         sort of painkiller, right?\n                              (beat)\n                         Anyway, I think you're a warm and \n                         engaging woman and I wish you all \n                         the best.\n\n               Relieved to have unburdened himself of the truth, he shakes \n               her hand. Patty, utterly baffled, doesn't know what hit her.\n\n               EXT. WILLS' BUILDING -- LATER\n\n               The doorman Michael, smoking a cigarette, sees Wills walk \n               up, his expression pensive.\n\n                                     MICHAEL\n                         Mr. Keane --\n\n                                     WILLS\n                         Good night, Michael.\n\n                                     MICHAEL\n                         You've got a visitor.\n\n               Wills stops and turns --\n\n                                     WILLS\n                         Who?\n\n                                     MICHAEL\n                         She's been waitin' almost an hour. \n                         In the lobby.\n                              (off Wills' look)\n                         A little surprise for ya.\n\n               He winks. Wills realizes that it's Charlotte. It must be. He \n               smiles and hurries inside.\n\n               INT. WILLS' LOBBY -- CONTINUOUS\n\n               Wills bursts in and freezes. A WOMAN stands across the way, \n               studying an oil painting. She turns quickly. It's LISA. She \n               sees his excited expression fall. Beneath her rather composed \n               facade, Lisa is a chaos of conflicting emotions --\n\n                                     LISA\n                         Sorry to disappoint you.\n\n                                     WILLS\n                         No, no. Not at all. You surprised \n                         me, that's all. I didn't expect to \n                         see you... not here... not after \n                         your letter.\n\n                                     LISA\n                         Well, I didn't expect you to show up \n                         at my job.\n\n                                     WILLS\n                         I followed you in. I wasn't even \n                         sure it was you. All I have is an \n                         old snapshot.\n\n                                     LISA\n                         My boss thought you were a stalker.\n\n                                     WILLS\n                         I didn't mean to run off like that.\n\n                                     LISA\n                         But you did.\n\n               An awkward silence.\n\n                                     LISA\n                         So you got my letter. What'd you do? \n                         Freak out? Burn it?\n\n                                     WILLS\n                         I saved it.\n\n                                     LISA\n                         I was just blowing off some steam, \n                         okay? I think I have the right.\n\n                                     WILLS\n                         So do I. Look, why don't we go \n                         upstairs.\n\n                                     LISA\n                              (uneasily)\n                         No. I didn't plan to come. Peter... \n                         my husband... he agrees. He thinks \n                         it's a futile exercise. But it turns \n                         out I'm pregnant. Just a few months, \n                         but --\n\n                                     WILLS\n                         Lisa -- Congratulations. That's \n                         wonderful.\n\n               His sincerity stops her. She softens slightly, mustering a \n               tiny smile --\n\n                                     LISA\n                         Thanks. Anyway, I guess it made me \n                         want to meet you. I've been a little \n                         sentimental about parent-hood.\n\n                                     WILLS\n                         Is that what you consider me?\n\n                                     LISA\n                         In a lousy absentee sorta way, sure.\n\n               Pause.\n\n                                     WILLS\n                         How's your mom?\n\n                                     LISA\n                         Great. Nuts. She moved to Costa Rica \n                         last summer.\n\n                                     WILLS\n                         Why?\n\n                                     LISA\n                         A guy, what else? He owns a charter \n                         airline and wears sunglasses indoors. \n                         I think he might be a gunrunner.\n\n               Wills chuckles. For the first time, Lisa relaxes enough to \n               take him in.\n\n                                     LISA\n                         You know, you're much better looking \n                         in person than in photographs. I \n                         always assumed Mom was exaggerating, \n                         but she wasn't.\n\n                                     WILLS\n                         Thanks. You're not bad looking \n                         yourself.\n\n               Lisa smiles, and, much to her embarrassment, tears come to \n               her eyes. She shakes her head at how absurd she is, treasuring \n               kind words from a father she doesn't know.\n\n                                     LISA\n                         Anyway... I should go...\n\n                                     WILLS\n                         Already?\n\n                                     LISA\n                         I really just wanted to meet you \n                         and... maybe... I don't know...\n\n                                     WILLS\n                              (gently)\n                         What is it? Tell me.\n\n               She sniffles and looks away --\n\n                                     LISA\n                         Nothing earth-shattering. Maybe just \n                         to hear you say you were sorry.\n\n               Silence.\n\n                                     WILLS\n                         I am. I'm very sorry.\n\n               She stares at him long and hard, waiting for some more \n               palpable sign of remorse. It isn't forthcoming. Finally, she \n               nods.\n\n                                     LISA\n                         Okay. Thanks.\n\n               She turns and walks away. His voice stops her --\n\n                                     WILLS\n                         Can I call you?\n\n               She turns around, hesitates for a moment, then nods. She \n               continues to the door. But then she stops and turns --\n\n                                     LISA\n                         Before... when you came in... who \n                         did you think I was?\n\n                                     WILLS\n                         A friend.\n\n                                     LISA\n                         You must like her an awful lot.\n\n               She smiles simply and heads for the door. When she is gone, \n               Wells slowly walks back toward the elevators, but then \n               abruptly stops in his tracks, deliberating...\n\n               EXT. VILLAGE -- DAWN\n\n               THE CAMERA CRANES DOWN SLOWLY from a view of the sun rising \n               in the EASTERN SKY to a TAXI gliding over to the curb in \n               front of...\n\n               CHARLOTTE'S BROWNSTONE -- DAWN\n\n               Charlotte, looking tired and a little pale, pays the driver \n               and emerges from the taxi. She makes her way up the steps.\n\n               INT. BROWNSTONE -- CONTINUOUS\n\n               Looking down from the second-floor landing, we see Charlotte \n               enter and walk up the stairs toward us.\n\n               As she reaches the landing, she feels a STABBING PAIN IN HER \n               CHEST and stops walking. Wincing, she waits for the pain to \n               subside.\n\n               INT. CHARLOTTE'S BEDROOM -- CONTINUOUS\n\n               Charlotte enters wearily, drops her purse on the floor, then \n               turns and GASPS.\n\n               Wills lies sprawled in an armchair fully dressed, sound \n               asleep.\n\n               Charlotte is offended by the intrusion. She hurries over to \n               awaken him. But then she stops. Her face softens slightly.\n\n               She studies his face... touches his cheek with the back of \n               her hand... traces the lines at his eyes with a fingertip.. \n               smooths back a wisp of hair.\n\n               Finally, snapping to, steeling herself, she jostles him --\n\n                                     CHARLOTTE\n                         Hey.\n\n               Wills wakes with a violent start. When he sees her, he drops \n               his head back. He closes his eyes again and murmurs sleepily --\n\n                                     WILLS\n                         Where were you? I was worried.\n\n                                     CHARLOTTE\n                         So worried you fell asleep. What're \n                         you doing here?\n\n                                     WILLS\n                         I've missed you. You have no idea \n                         how much.\n\n               She crosses coldly to her closet and, half-shutting the door, \n               blocking his view, starts to undress.\n\n                                     CHARLOTTE\n                         How'd you get in?\n\n               He sits up, rubbing his eyes in the morning light.\n\n                                     WILLS\n                         Dolly. We watched TV. She fell asleep. \n                         What time is it?\n\n                                     CHARLOTTE\n                         I didn't know I had a curfew.\n\n                                     WILLS\n                         Where were you?\n\n                                     CHARLOTTE\n                         None of your business. So what is \n                         it? What do you want?\n\n               Wills sits forward, more alert now. He exhales heavily and \n               begins:\n\n                                     WILLS\n                         To tell you that you were right. I \n                         do hate myself. But not so much that \n                         I can't see how stupid and despicable \n                         and --\n\n                                     CHARLOTTE\n                         Cowardly.\n\n                                     WILLS\n                         And cowardly what I did was. And \n                         even though there's no excuse for \n                         it, I want you to forgive me.\n\n               She turns and looks at him. She feels herself relenting. She \n               turns away and continues undressing --\n\n                                     CHARLOTTE\n                         Why should I?\n\n                                     WILLS\n                         Because, for better or worse, I'm \n                         falling in love with you, and the \n                         thought of our not being together is \n                         unbearable to me.\n\n               She stops, then glances at him with a flash of pain and \n               longing. Determined not to surrender to her feelings, she \n               crosses to the bed and throws open the covers.\n\n                                     CHARLOTTE\n                         Let's sleep.\n\n               She crawls into bed.\n\n                                     CHARLOTTE\n                         In the morning, we'll talk about \n                         what a gigantic asshole you are.\n\n               Wills, relieved, crosses to the bed and begins to undress. \n               He asks casually --\n\n                                     WILLS\n                         So where were you?\n\n                                     CHARLOTTE\n                         With Shannon and Simon and Eric.\n\n                                     WILLS\n                         Who's Eric?\n\n                                     CHARLOTTE\n                         An old friend who used to work at \n                         Blockbuster.\n\n                                     WILLS\n                         What'd you guys do?\n\n                                     CHARLOTTE\n                         Talked and drank. Simon and Shannon \n                         finally went home. Eric and I hung \n                         out.\n\n               Thinking nothing of it, Wills nods. He slips into bed. Her \n               back is to him. He drapes an arm around her and pulls her a \n               little closer.\n\n               He smiles contentedly and closes his eyes. But then something \n               occurs to him. He opens his eyes --\n\n                                     WILLS\n                         Hung out where?\n\n                                     CHARLOTTE\n                         Stop. We'll talk about it tomorrow.\n\n                                     WILLS\n                         Fine.\n\n               He closes his eyes again. A few beats later, they open.\n\n                                     WILLS\n                         Talk about what? Is there something \n                         to talk about? What happened?\n\n               Charlotte, eyes still closed, breaks into a sly, amused smile.\n\n               EXT. CENTRAL PARK WEST -- DAY\n\n               Wills and Charlotte, collars turned up against the brisk \n               wind, walk together. Charlotte wears a backpack. Wills tries \n               desperately to appear casual --\n\n                                     WILLS\n                         No, honestly, I think I have a right \n                         to know.\n\n                                     CHARLOTTE\n                         And I honestly think I have a right \n                         not to tell you.\n\n                                     WILLS\n                         You're being unreasonable.\n\n                                     CHARLOTTE\n                         You're being nosy.\n\n               EXT. CENTRAL PARK -- DAY\n\n               They move down a winding walkway beneath barren trees --\n\n                                     WILLS\n                         You know, in this day and age it's \n                         not so outrageous a request. I mean, \n                         I don't know this kid. I don't know \n                         where he's been.\n\n                                     CHARLOTTE\n                              (laughing incredulously)\n                         You're worried about where he's been? \n                         Give me a break!\n\n               EXT. WOLLMAN RINK -- DAY\n\n               Wills watches as Charlotte laces up her figure skates --\n\n                                     WILLS\n                         It requires balance and I have lousy \n                         balance, okay?\n\n                                     CHARLOTTE\n                         Oh, come on, what's the worst that \n                         can happen?\n                              (beat)\n                         Well, I guess you could break a hip.\n\n                                     WILLS\n                         Look, I'm not in a sporting mood!\n\n                                     CHARLOTTE\n                         How come?\n\n                                     WILLS\n                         I'm jealous, okay?! Is that what you \n                         want to hear? Are you satisfied now?\n\n               She burst out laughing --\n\n                                     CHARLOTTE\n                         Not even close!\n\n               EXT. WOLLMAN RINK -- DAY\n\n               Wills paces the bleachers, furious, while Charlotte skates \n               nearby --\n\n                                     WILLS\n                         All I want is a simple answer and \n                         you're torturing me! And I resent \n                         it! It's cruel and juvenile! And I --\n\n                                     CHARLOTTE\n                              (exploding)\n                         HEY!\n\n               Her anger startles him. She skates over quickly and skids to \n               an abrupt stop --\n\n                                     CHARLOTTE\n                         It's not! It's adult! It's revenge! \n                         And if you think it's bad not knowing \n                         what I did -- well, it's even worse \n                         knowing exactly what you did!\n\n               She turns and skates away.\n\n               EXT. WOLLMAN RINK -- AFTERNOON\n\n               Wills sits on the bleachers, miserably brooding, while \n               Charlotte gracefully glides by, laughing and chatting with \n               THREE YOUNG MALE SKATERS whom she's just met.\n\n               EXT. CENTRAL PARK -- NIGHTFALL\n\n               They walk together in silence. Wills is sullen. Finally, \n               Charlotte takes his hand and speaks gently but firmly --\n\n                                     CHARLOTTE\n                         Do me a favor, okay? Never ask me \n                         again what happened with Eric. Just \n                         accept the fact that you'll never, \n                         ever know. And if that hurts, then \n                         think about it next time you want to \n                         cheat on somebody.\n\n               Wills reflects.\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               Charlotte and Wills are little more than silhouettes, lying \n               entwined in the rich darkness, conversing in whispers:\n\n                                     WILLS\n                         I wish I were exaggerating, but I'm \n                         not. I slept with every one of them. \n                         Really. Look through Dolly's old \n                         photo albums... or any movie \n                         magazine... visit Aspen at Christmas. \n                         I was on a mission. And until recently \n                         I really didn't think I had a problem. \n                         Or if I did, it was definitely the \n                         most pleasurable one I could imagine.\n\n                                     CHARLOTTE\n                         What changed?\n\n                                     WILLS\n                         My house in Malibu burned to the \n                         ground.\n\n               Charlotte laughs. Wills smiles with sad irony.\n\n                                     WILLS\n                         I know, it sounds funny. But it must \n                         have triggered something because the \n                         next thing I knew I couldn't sleep. \n                         I'd lie awake at night absolutely \n                         terrified. Like a kid left alone in \n                         the dark.\n\n                                     CHARLOTTE\n                         What were you scared of?\n\n                                     WILLS\n                         How quickly time was passing and how \n                         adolescent I still felt. How \n                         meaningless all my choices seemed. \n                         How lonely I was. So I liquidated my \n                         portfolio, sold my businesses, and \n                         moved back here. To start over, settle \n                         down, start acting my age.\n                              (beat)\n                         You were supposed to be my one last \n                         dalliance with youth.\n\n                                     CHARLOTTE\n                         Well, for your sake, I hope I am.\n\n               He thinks for a moment, then smiles, and kisses her brow.\n\n               INT. MACDONALD'S -- DAY\n\n               Wills sits with John, Sarah, and the twins at a plastic table \n               overrun with food, wrappers, and squashed condiment tubes. \n               Sarah speaks to Wills --\n\n                                     SARAH\n                         Judge you? Why would I? Screw the \n                         age difference -- I like the new \n                         you! Before Charlotte came along, do \n                         you have any idea how hard it was to \n                         get you to sit down for a Happy Meal?\n\n               Wills and John laugh. Molly, one of the twins, chimes in --\n\n                                     MOLLY\n                         Uncle Wills, how come you don't get \n                         married?\n\n                                     JOHN\n                         Yeah, how come, Uncle Wills?\n\n                                     WILLS\n                         I want to, Carla, but --\n\n                                     MOLLY\n                         I'm not Carla! I'm Molly!\n\n                                     WILLS\n                         Well, Molly, I just haven't met the \n                         right woman yet.\n\n                                     CARLA\n                         What about Charlotte? She's funny-\n                         pretty.\n\n                                     SARAH\n                              (aside to Wills)\n                         It means funny and pretty. It's their \n                         highest compliment.\n\n                                     WILLS\n                         I agree.\n                              (rising from the table)\n                         She's also demanding.\n\n                                     JOHN\n                         Where're you goin'?\n\n                                     WILLS\n                         She's decided she wants her birthday \n                         present today.\n\n               Wills gives both of the little girls hugs and kisses.\n\n                                     JOHN\n                         But that was last month.\n\n                                     WILLS\n                         The Dom didn't count. This is her \n                         real present. She chose it herself \n                         and it's not material.\n\n                                     JOHN\n                         Now you got me curious.\n\n                                     SARAH\n                         Yeah, what is it?\n\n               Wills shakes his head and smiles, reluctant to answer.\n\n               From the next scene we hear the sound of TWO DOZEN PEOPLE \n               BREATHING FURIOUSLY.\n\n               INT. STUDIO -- AFTERNOON\n\n               On a slightly elevated stage, HARI SINGH, 35, an American \n               Sikh wearing a white robe and turban, sits in the lotus \n               position before a lighted candle, softly instructing the \n               crowded class --\n\n                                     HARI\n                         Okay... breath of fire... now inhale \n                         deeply... hold the breath... let \n                         your heart lotus blossom... feel the \n                         energy rise... and exhale. Good. Now \n                         peacock pose.\n\n               Hari rolls forward, digs his elbows into his midsection, and \n               pops up so that he is parallel to the floor with his legs \n               still crossed.\n\n               ANGLE ON THE CLASS, all moving into the pose. In the center \n               of the class are Wills and Charlotte, wearing sweats. His \n               arms shaking, Wills is clearly in pain. He mutters --\n\n                                     WILLS\n                         When does the enlightenment start?\n\n                                     CHARLOTTE\n                         When you realize that I'm God.\n\n               Wills laughs. A moment later, Charlotte winces and falls out \n               of the pose onto the mat. Hari looks over, confused --\n\n                                     HARI\n                         Are you all right?\n\n               Charlotte sits up quickly, smiling --\n\n                                     CHARLOTTE\n                         Yeah. No big deal. Cramp in the old \n                         fifth shakra!\n\n               She glances over at Wills. He sees that she's scared to death. \n               He helps her to her feet, speaking softly in her ear --\n\n                                     WILLS\n                         Don't worry. You're gonna be okay.\n\n               She nods. They move toward the door. But after a few steps, \n               her eyes flutter, her body goes limp, and she slams down on \n               the mat, UNCONSCIOUS.\n\n               INT. SPEEDING AMBULANCE -- AFTERNOON\n\n               Charlotte lies on a stretcher near Wills and a PARAMEDIC --\n\n                                     CHARLOTTE\n                         It's no big deal. I just \n                         hyperventilated. Really.\n\n               But then she gasps as she's hit by a stab of pain. Wills \n               throws a grave look at the medic and squeezes her hand more \n               tightly.\n\n               EXT. ST. VINCENT'S HOSPITAL -- ESTABLISHING -- NIGHT\n\n               The building is brightly illuminated against the night sky.\n\n               INT. ST. VINCENT'S WAITING ROOM -- NIGHT\n\n               Wills sits, anxiously struggling with a half-finished \n               crossword puzzle. He hears the click of a lighter. A GRUBBY \n               LITTLE MAN standing by the coffee machine lights a generic \n               cigarette.\n\n                                     WILLS\n                         Excuse me... do you have an extra \n                         one of those?\n\n                                     LITTLE MAN\n                              (eyes narrowing)\n                         You a smoker?\n\n                                     WILLS\n                         Not for years.\n\n                                     LITTLE MAN\n                         Well, hell, if I'm gonna be the one \n                         to get you goin' again.\n\n               Pause.\n\n                                     WILLS\n                         Thanks.\n\n                                     LITTLE MAN\n                         Don't mention it.\n\n               Wills looks up and sees Dr. Sibley standing in the doorway.\n\n               INT. TELEMETRY FLOOR CORRIDOR -- NIGHT\n\n               Sibley walks Wills down the hallway --\n\n                                     SIBLEY\n                         The repeat MRI and CAT scan do show \n                         interval progression.\n\n                                     WILLS\n                              (uncertainly)\n                         Which means the tumor's grown?\n\n                                     SIBLEY\n                         Yes. Yes, it has. Considerably. As \n                         for her loss of consciousness, one \n                         explanation is a disturbance in her \n                         heart's electrical function. We'll \n                         be monitoring her overnight for any \n                         arrhythmias. If we find something, \n                         we'll treat it. Unfortunately, the \n                         more likely explanation is that the \n                         tumor has begun to obstruct the \n                         outflow of her heart. If that's the \n                         case, there's little we can do. We \n                         could be speaking in terms of weeks \n                         not months.\n\n               They arrive at Charlotte's room.\n\n                                     SIBLEY\n                         When she returns home, we'll want \n                         her to stay active, but don't let \n                         her overexert herself.\n                              (off Wills' nod)\n                         Don't stay long. She's been sedated.\n\n               INT. CHARLOTTE'S HOSPITAL ROOM -- SAME\n\n               Charlotte lies in the bed with her eyes closed. An EKG monitor \n               bleeps steadily in the corner. An IV drip hangs by her bed.\n\n               Wills enters and sits down at her bedside. He touches her \n               hand. She opens her eyes and smiles drowsily --\n\n                                     CHARLOTTE\n                         Hey.\n\n               Wills is terribly anxious. His speech is accelerated\n\n                                     WILLS\n                         Are you all right? You're okay? How \n                         do you feel?\n\n                                     CHARLOTTE\n                         Stoned.\n\n                                     WILLS\n                         I'll let you rest. I should. You'll \n                         sleep and then --\n\n                                     CHARLOTTE\n                              (touching his hand)\n                         Shhh.\n\n               He nods and inhales deeply. His heart is racing. She murmurs --\n\n                                     CHARLOTTE\n                         You still owe me a birthday present.\n\n                                     WILLS\n                         I do not.\n\n                                     CHARLOTTE\n                         Just 'cause I fainted is no excuse \n                         for you to bail on your peacock pose.\n\n               She smiles sleepily. Wills lifts a hand to her mouth and \n               whispers:\n\n                                     WILLS\n                         It ought to be illegal.\n\n                                     CHARLOTTE\n                         What?\n\n                                     WILLS\n                         Your smile. It's too pretty.\n\n                                     CHARLOTTE\n                         I've ruined you for other women.\n\n                                     WILLS\n                         You have.\n\n                                     CHARLOTTE\n                         All part of my master plan.\n                              (beat)\n                         Do you wanna hear a story... a bedtime \n                         story?\n\n                                     WILLS\n                         Shouldn't I be telling you one?\n\n                                     CHARLOTTE\n                         Once upon a time, there was a woman \n                         on a ship crossing the Atlantic and \n                         her little boy got sick. Very sick. \n                         And she said whoever saves my boy's \n                         life... I'll name my next baby after \n                         them. Well, they got into port and \n                         they rushed her son to St. Vincent's \n                         hospital... to here... and they saved \n                         his life. And so the mother named \n                         her next baby Edna St. Vincent Millay.\n                              (beat)\n                         And Edna grew up to be, as I am sure \n                         you know, the second greatest female \n                         poet in American history.\n\n                                     WILLS\n                         The first would be Emily Dickinson.\n\n                                     CHARLOTTE\n                         You're a quick learner -- I like \n                         that about you...\n                              (half to herself)\n                         \"It may be, when my heart is dull, \n                         Having attained its girth, \n                         I shall not find so beautiful \n                         The meagre shapes of earth, \n                         Nor linger in the rain to mark \n                         The small of tansy through the dark.\"\n\n               Her eyes drift shut --\n\n                                     CHARLOTTE\n                         I am so pretentious...\n\n               Wills laughs, then clears his throat, and looks suddenly \n               serious --\n\n                                     WILLS\n                         Charlotte, listen, I --\n\n                                     CHARLOTTE\n                         Uh-oh. Heavy, heavy...\n\n                                     WILLS\n                         I just think --\n\n                                     CHARLOTTE\n                         No. No violins. I'm fine. Go home... \n                         sleep...\n\n               He considers for a moment, then, tears welling in his eyes, \n               he lifts her hand to his mouth and kisses it.\n\n               INT. BROWNSTONE LIVING ROOM -- AFTERNOON\n\n               Wills sits across from Simon who strokes Shannon's back as \n               she weeps --\n\n                                     SHANNON\n                         It just didn't seem real and now \n                         that it is, I hate it! It's so unfair!\n\n               Dolores, sitting in her armchair, mutters as though by rote --\n\n                                     DOLLY\n                         Fare is what you pay on the train to \n                         Jersey. Fair is the place that smells \n                         like manure where, if you're real \n                         lucky, you win a blue ribbon for \n                         your home-made pickles. Fair is a \n                         sky without a cloud and a face with \n                         a mark. Fare is food. What fair isn't \n                         is everything else.\n\n                                     SIMON\n                         Well, I think I speak for all of us \n                         when I say that we've heard quite \n                         enough from Dolores.\n\n               Dolores chuckles. Simon continues to Wills --\n\n                                     SIMON\n                         Now, correct me if I'm wrong, but I \n                         believe what you're saying is that \n                         while the end may be in sight, it \n                         has not yet arrived.\n\n                                     WILLS\n                         That's right. The tumor's begun to \n                         interfere with the function of her \n                         heart, but she --\n\n                                     SIMON\n                         Then why exactly have you called us \n                         here?\n\n               Wills falters, looking at him incredulously.\n\n                                     SIMON\n                         I cut short a lunch date, Shannon's \n                         missing her low-impact aerobics class, \n                         and Dolores has delayed the start of \n                         her happy hour -- surely you must \n                         have had good reason.\n\n                                     WILLS\n                         I thought Charlotte's health might \n                         be of some interest you.\n\n                                     SIMON\n                         It is. You could have told me all \n                         about it on the telephone.\n\n                                     WILLS\n                         I also thought it might be a good \n                         idea if we discussed ways to make \n                         her as comfortable as possible for \n                         the --\n\n                                     SIMON\n                         Charlotte loathes comfortable. I \n                         never sought to bore her with comfort \n                         while she was well, why should I \n                         start now that she's sick?\n\n               Wills stares at Simon, his face ashen and full of contempt --\n\n                                     WILLS\n                         Tell me, are you really so cold? Or \n                         is it just a pose that you've \n                         cultivated?\n\n                                     SIMON\n                         It's a pose that I've cultivated.\n                              (beat)\n                         I chose it, as a sort of smoke screen, \n                         some time after attending my twentieth \n                         funeral in as many months.\n\n               Pause.\n\n                                     WILLS\n                         I'm sorry.\n\n                                     SIMON\n                         It's quite all right. But, honestly, \n                         it shocks me how often you people \n                         forget. Our phone books have as many \n                         numbers crossed out as written in. \n                         So that while death is certainly as \n                         painful to us as it is to you, we do \n                         not find it nearly so... \n                         extraordinary.\n                              (beat)\n                         Don't misunderstand me. I adore \n                         Charlotte and when she dies, I \n                         would... were it not already in that \n                         state... cry my heart dry.\n\n               Shannon looks at Simon and burst into tears again. Simon \n               holds her even closer, rubbing her back.\n\n               MUSIC UP:\n\n               EXT. MANHATTAN STREET -- NIGHTFALL\n\n               Wills emerges from Charlotte's brownstone, hails a cab, then \n               decides against it.\n\n               EXT. CITY STREETS -- NIGHTFALL\n\n               Head down, eyes desolate, Wills walks uptown. The roaring \n               traffic, dense crowds, blaring music, flashing neon -- the \n               great welter of urban life is entirely lost on him.\n\n               He can think only of Charlotte.\n\n               EXT. HELL'S KITCHEN -- NIGHT\n\n               Wills walks down a dark block, his jacket open to the cold \n               night wind, his cheeks and ears burned red.\n\n               INT. HELL'S KITCHEN WALK-UP FOYER -- NIGHT\n\n               Wills enters, checks the tenant list, then presses a buzzer. \n               He speaks into the intercom and a moment later is buzzed up.\n\n               INT. WALK-UP STAIRWELL -- NIGHT\n\n               FOLLOW WILLS, running up the stairs. He arrives at a door, \n               cold and gasping for breath. He hears footsteps.\n\n               THE DOOR OPENS, but we do not see who is there.\n\n               MUSIC OUT:\n\n               INT. WALK-UP LIVING ROOM -- LATER\n\n               Wills paces, speaking desperately to someone. He seems on \n               the verge of a total nervous collapse --\n\n                                     WILLS\n                         She's in the hospital now. She doesn't \n                         have long. Weeks maybe and -- She... \n                         Anyway, I have something to ask you. \n                         A favor. I have no right to ask. I \n                         know. I'd do it myself, but I can't. \n                         I'm too... I'm...\n\n               He takes a deep breath to keep himself from crying.\n\n               ANGLE ON LISA, his daughter, sitting on the couch, listening, \n               her face unreadable --\n\n                                     LISA\n                         What is it?\n\n                                     WILLS\n                         I want you to find a surgeon. Dr. \n                         Sibley told me... Charlotte's doctor \n                         told me... he said at some point, \n                         when it's hopeless, surgery could be \n                         an option. Heroic surgery, he called \n                         it. I want to make sure that when \n                         the time comes a hero is performing \n                         that heroic surgery. Do you \n                         understand? You'll have to make calls. \n                         I'll get names. Sibley will give me \n                         names.\n                              (fighting tears)\n                         I'm sorry to ask you... I have no \n                         right. But, you see, she doesn't \n                         want it... this surgery... I'll have \n                         to convince her. So no one can know... \n                         for now. And I trust you. You're my \n                         only family and I...\n                              (beat)\n                         You have every right to refuse me. \n                         After what I did. You were a child... \n                         and you needed me... and I was nowhere \n                         to be found. There's no excuse for \n                         that. I'm so terribly sorry!\n\n               Silence.\n\n                                     LISA\n                         I'd be happy to do it.\n\n               Wills, stunned, deeply grateful, allows himself a breath.\n\n                                     LISA\n                         Dad, I'm really sorry she's sick.\n\n                                     WILLS\n                              (almost inaudible)\n                         I am, too. So sorry. I should be the \n                         one. It should be me.\n\n               Lisa, flooded with compassion, wants to go to him, comfort \n               him, but she stays where she is.\n\n                                                             FADE TO BLACK:\n\n               FADE IN:\n\n               EXT. CARL SCHURZ PARK -- LATE AFTERNOON\n\n               The darkening sky is swept with a brisk wintry breeze. Shadows \n               descend from the trees and towering rocks. AN OLD MAN sits \n               on a bench, reading a newspaper. A NANNY pushes a baby \n               carriage past.\n\n               Wills and Charlotte walk together, bundled up again the cold. \n               Charlotte walks backward, her breath shooting out into the \n               cold air like smoke --\n\n                                     CHARLOTTE\n                         You never talk about my mother.\n                              (beat)\n                         Talk about her.\n\n                                     WILLS\n                         What do you want to know?\n\n                                     CHARLOTTE\n                         Everything. All I remember is that \n                         she smelled like vanilla, loved to \n                         read to me, and was really good at \n                         cutting up fruit. I couldn't believe \n                         she didn't cut her fingers off.\n\n                                     WILLS\n                         Well, I remember a little more than \n                         that. Let's see... she was blonde... \n                         about your height --\n\n                                     CHARLOTTE\n                         I've seen pictures, dummy.\n\n                                     WILLS\n                         Oh, okay. She... always ate her ice \n                         cream with a fork -- how's that?\n\n                                     CHARLOTTE\n                         Much better.\n\n                                     WILLS\n                         And she wrote great letters, but \n                         couldn't spell at all.\n\n                                     CHARLOTTE\n                         Neither can I.\n\n                                     WILLS\n                         She was a McGovern Democrat but also \n                         an incredible snob. She loved \n                         blueberries. She had the world's \n                         worst backhand. Her favorite singer \n                         was Stephen Stills.\n\n                                     CHARLOTTE\n                         Who?\n\n                                     WILLS\n                         Never mind. She was afraid of sharks. \n                         And, considering the times, she was \n                         pretty square. She only tried drugs \n                         once -- a lifeguard gave her a hash \n                         brownie and she threw it up all over \n                         him.\n\n               Charlotte laughs.\n\n                                     WILLS\n                         And she laughed just like that. And \n                         she bit her fingernails. And she \n                         couldn't tell a joke.\n                              (beat)\n                         In short, she was a unique.\n\n               Charlotte smiles happily.\n\n               EXT. EAST RIVER ESPLANADE -- MINUTES LATER\n\n               Wills and Charlotte lean down on the railing, watching the \n               water purl and eddy around Randall's Island.\n\n                                     CHARLOTTE\n                         Did you know she was in love with \n                         you?\n\n                                     WILLS\n                         She told me.\n\n                                     CHARLOTTE\n                         Were you in love with her?\n\n                                     WILLS\n                         Yes.\n\n                                     CHARLOTTE\n                         Why? Because she was the only girl \n                         in Rhode Island who wouldn't sleep \n                         with you?\n\n                                     WILLS\n                         That's how she got my attention; \n                         it's not why I fell in love with \n                         her.\n                              (beat)\n                         I fell in love with her because she \n                         charmed me senseless day and night \n                         for an entire summer.\n\n                                     CHARLOTTE\n                         Then why did you screw her best friend \n                         on Labor Day?\n\n               Wills looks at her darkly. She smiles and shrugs --\n\n                                     CHARLOTTE\n                         It's just a question.\n\n               Wills sighs and looks away, reflecting --\n\n                                     WILLS\n                         I have no idea. The summer was over. \n                         Your mom was going back to Smith. I \n                         was moving down here to work on Wall \n                         Street. It was our last day together. \n                         She was crying. She told me, for the \n                         first time, that she loved me. I \n                         said I loved her, too. I promised to \n                         call and visit. A few hours later I \n                         was in a cabana with Millie.\n                              (beat)\n                         When Millie told me she was pregnant \n                         and that she wanted to marry me, I \n                         escaped to L.A... and I never saw \n                         her or your mom again.\n\n                                     CHARLOTTE\n                              (wryly)\n                         Well done.\n\n                                     WILLS\n                         I think it's part of the reason I \n                         never came back.\n\n                                     CHARLOTTE\n                         But why're you like that? What is \n                         it? I mean, you weren't born that \n                         way.\n\n                                     WILLS\n                         I might as well have been. For as \n                         long as I can remember, I've always \n                         run off at the first sign of a woman \n                         wanting anything from me... relying \n                         on me in any way.\n\n               She considers for a moment --\n\n                                     CHARLOTTE\n                         But I want everything from you, Wills. \n                         I rely on you in every way.\n\n                                     WILLS\n                         I know.\n\n                                     CHARLOTTE\n                         So the only reason you don't dump me \n                         is because I'm sick? Because you \n                         know that it's all going to be over, \n                         anyway?\n\n                                     WILLS\n                         Maybe. But it doesn't feel that way.\n                              (beat)\n                         It feels as though I'm not afraid \n                         anymore.\n\n               She looks at him and smiles. He puts an arm around her and \n               draws her close.\n\n               INT. TAXI -- AFTERNOON\n\n               Wills looks out the window, his arm draped around Charlotte \n               who lies nestled against him, eyes closed.\n\n               He suddenly sees something. He thinks. Checks his watch. His \n               eyes ignite and he calls out excitedly to the driver --\n\n                                     WILLS\n                         Driver! Quick! Pull over here! Right \n                         here!\n\n               Charlotte, a little sleepy, comes to. She looks out the window \n               and her face softens with happiness.\n\n               EXT. THE BRICK CHURCH, 92ND AND PARK -- SAME\n\n               On the steps of the old church a CHOIR sings Christmas carols. \n               All around them, a LARGE CROWD sings along.\n\n               Wills and Charlotte get out of the cab. His arm around her, \n               Wills pulls her into the crowd. They join the carol. Wills \n               sings well. Charlotte is tone deaf.\n\n               In between lines of the song, she calls out --\n\n                                     CHARLOTTE\n                         I didn't know you could sing!\n\n                                     WILLS\n                         I didn't know you couldn't!\n\n               She laughs and continues to sing.\n\n               THE CAROLS ENDS to cheers and applause. THE CHOIRMASTER steps \n               forward to a microphone --\n\n                                     CHOIRMASTER\n                         Well, you all know what time it is!\n\n                                     CHARLOTTE\n                              (confused to Wills)\n                         No, I don't. Do you?\n\n               He grins. The choirmaster nods at someone in the distance. \n               Then holds up a hand, fingers spread, and begins to count \n               down. The crowd joins in --\n\n                                     CHOIRMASTER AND CROWD\n                         TEN, NINE, EIGHT, SEVEN, SIX, FIVE, \n                         FOUR, THREE, TWO, ONE!\n\n               At that instant, ALL THE WHITE CHRISTMAS LIGHTS on the trees \n               of the median from 96th Street to 44th Street POP ON \n               SIMULTANEOUSLY -- an enchanted fairy-tale spectacle.\n\n               The crowd and the choir cheer and clap, cars honk their horns. \n               Charlotte's eyes are filled with happy wonder.\n\n                                     CHOIRMASTER\n                         HAPPY HOLIDAYS!\n\n               As another carol begins, Wills wraps his arms around Charlotte \n               and kisses her. He pulls away, looks deeply into her eyes, \n               and whispers with passionate sincerity --\n\n                                     WILLS\n                         I love you, Charlotte.\n\n               For an instant, her eyes flare as though she were surprised. \n               Then her eyes fill with tears. She tries to speak but she is \n               choked by a sob.\n\n               She buries her face in his chest and cries. Wills smiles \n               with warm, almost paternal, indulgence. He strokes her hair. \n               She hugs him as though she'll never let go.\n\n               INT. ELYSIUM -- NIGHT\n\n               The restaurant is packed. John, overwhelmed by the crowd \n               waiting for tables, glances angrily away when he hears the \n               phone ringing and no one answering it.\n\n               INT. ELYSIUM KITCHEN -- SAME\n\n               Amid the Pandemonium, Wills watches as Charlotte teases HENRY, \n               30, the young chef, as he lays the beet garnishes on a fish \n               entree.\n\n                                     CHARLOTTE\n                         You call that a rose? It looks more \n                         like a hand grenade!\n\n                                     HENRY\n                         Mr. Keane, you get her outta here \n                         or, I swear to God, I'm gonna \n                         butterfly and stuff her!\n\n                                     WILLS\n                         I'll add it to the specials list.\n\n                                     CHARLOTTE\n                              (laughing)\n                         No way! I'm too pricey!\n\n               The door bangs open. John enters, looking angry --\n\n                                     CHARLOTTE\n                         Hello, Sunshine!\n\n                                     JOHN\n                         You seen Celia?\n\n                                     WILLS\n                         What's the matter?\n\n                                     JOHN\n                         The matter is I got a half-hour wait \n                         and no help up front! You got a call \n                         on Two!\n\n               INT. ELYSIUM OFFICE -- SAME\n\n               Wills enters, picks up the phone, and hits a flashing button--\n\n                                     WILLS\n                         Wills Keane.\n\n               INT. LISA'S LIVING ROOM -- EVENING\n\n               Lisa's face is flushed with excitement --\n\n                                     LISA\n                         I've got him!\n\n               EXT. WILLS' BUILDING -- MORNING\n\n               A TOWN CAR is parked out front. Michael, the doorman, chats \n               with the driver.\n\n                                     LISA (V.O.)\n                         His name's Tom Grandy. Harvard \n                         undergrad. Columbia Medical School. \n                         He's at the Cleveland Clinic. I know, \n                         I know. But don't laugh. It's one of \n                         the best in the world.\n\n               Wills exits the building and gets into the car.\n\n               EXT. QUEENS -- MORNING\n\n               The town car speeds down the expressway.\n\n                                     LISA (V.O.)\n                         He did his residency at the Brigham \n                         in Boston... his cardiac surgery \n                         training at Cleveland.\n\n               EXT. LA GUARDIA AIRPORT -- MORNING\n\n               Wills walks quickly through the terminal.\n\n                                     LISA (V.O.)\n                         He was so good they kept him on and \n                         within three years he was chief of \n                         the program.\n\n               EXT. CLEVELAND CLINIC -- DAY\n\n               Wills gets out of a taxi and heads inside --\n\n                                     LISA (V.O.)\n                         He travels a lot. Spends lots of \n                         time lecturing. I got you an \n                         appointment tomorrow at twelve-thirty. \n                         Don't be late. He only has fifteen \n                         minutes.\n\n               INT. CLEVELAND CLINIC CORRIDOR -- DAY\n\n               TOM GRANDY, 35, long-hair, small beard, loose-limbed, wearing \n               scrubs, saunters down the hall, wearing a vaguely goofy smile. \n               Wills watches him approach with some apprehension.\n\n                                     LISA (V.O.)\n                         The surgeon that recommended him \n                         said, and these are his words not \n                         mine, \"Don't let his appearance fool \n                         you. He's brilliant and has balls \n                         the size of your head.\"\n\n               INT. GRANDY'S OFFICE -- SAME\n\n               Wills listens to Dr. Grandy who speaks casually, more like a \n               benign hippie than a renowned surgeon. Charlotte's X-rays \n               hang between them in an illuminated view box --\n\n                                     GRANDY\n                         Listen, I'm not gonna bullshit you. \n                         If she were a baby, she'd have a \n                         decent chance, 'cause these sorts of \n                         tumors can regress like crazy, but \n                         she's twenty and... I don't know, \n                         man... I've never seen anything like \n                         it.\n                              (pointing at the X-\n                              ray)\n                         I mean, look! It's wrapped around \n                         her vital structures like an octopus!\n                              (sitting)\n                         You know, just once I'd like to get \n                         sent something simple. A \"cabbage,\" \n                         a valve replacement. Even a good old-\n                         fashioned transplant. But it doesn't \n                         happen anymore. It's the downside of \n                         being good at my job.\n\n                                     WILLS\n                         Good? They say there's no one better.\n\n                                     GRANDY\n                         I don't know. I'm like most people. \n                         I do the best I can.\n\n                                     WILLS\n                         Can your best save her?\n\n                                     GRANDY\n                         Probably not.\n\n               INT. CLEVELAND CLINIC CORRIDOR -- LATER\n\n               Grandy and Wills walk together --\n\n                                     GRANDY\n                         In these sorts of cases, it's best \n                         if she signs a consent.\n\n                                     WILLS\n                              (covering)\n                         No problem.\n\n                                     GRANDY\n                         Good.\n                              (stopping at the main \n                              entrance)\n                         The last time Charlotte passed out, \n                         she regained consciousness almost \n                         immediately. The next time or the \n                         time after, she won't. When that \n                         happens, call me.\n                              (handing him a card)\n                         Here's my service. They'll reach me \n                         no matter where I am. In the meantime, \n                         I'll coordinate with Dr. Sibley.\n\n                                     WILLS\n                         I can't thank you enough.\n\n               Grandy smiles and pats him on the shoulder.\n\n                                     GRANDY\n                         I haven't done anything yet.\n\n               INT. WILLS' BEDROOM -- NIGHT\n\n               Wills sits up, wearing glasses, reading a book. Charlotte \n               enters from the bathroom wearing a flannel night shirt --\n\n                                     CHARLOTTE\n                         By the way -- where were you today?\n\n                                     WILLS\n                         What do you mean?\n\n                                     CHARLOTTE\n                         When you called I assumed you were \n                         at the restaurant, but when I called \n                         back later, Jesus said you hadn't \n                         been in all day.\n\n                                     WILLS\n                         I was in Montclair, New Jersey.\n\n                                     CHARLOTTE\n                         Why?\n\n                                     WILLS\n                              (playfully vague)\n                         An opportunity.\n\n                                     CHARLOTTE\n                         Oh, really? Sexual or professional?\n\n                                     WILLS\n                         I was considering opening a \n                         restaurant. But the rents are too \n                         high.\n\n               He smiles at her. And she smiles back.\n\n               INT. WILLS' BEDROOM -- MORNING\n\n               Charlotte lies asleep with her head on his chest. She opens \n               her eyes. The room seems strange. It's the light.\n\n               She rises up and turns around. Her eyes narrow with curiosity. \n               She crawls out of bed and runs to the window and looks out.\n\n               She can't believe her eyes. Central Park is blanketed by \n               deep snow and more is falling. She calls out gaily --\n\n                                     CHARLOTTE\n                         Hey! How do you feel about Christmas?\n\n                                     WILLS\n                              (sleepily)\n                         Bah humbug...\n\n               She runs back, laughing, and jumps on the bed, rousting him.\n\n               MUSIC UP:\n\n               A SEQUENCE BEGINS showing Charlotte and Wills during a day \n               of holiday shopping. The deep snow has slowed the city to a \n               crawl but filled everyone with good spirits.\n\n               Charlotte and Wills move from store to store; they buy \n               wreaths, garlands, ornaments, candles, and, finally, a \n               CHRISTMAS TREE and STAND.\n\n               Wills starts to lug the tree, but when it's obvious that \n               it's too much for him, Charlotte spots a GROUP OF KIDS \n               spilling out of a record store.\n\n               The next thing we know the kids are lined up, carrying the \n               tree over their heads like a battalion of ants.\n\n               Wills and the kids load the tree into the freight elevator \n               and squeeze in. There's no room for Charlotte. She'll take \n               the lobby elevator.\n\n               MUSIC OUT:\n\n               INT. LOBBY ELEVATOR -- AFTERNOON\n\n               Charlotte, carrying shopping bags, ascends in silence with \n               Michael. She has no interest in chatting. He, as ever, does.\n\n                                     MICHAEL\n                         Will you and Mister Keane be goin' \n                         away for the holidays?\n\n                                     CHARLOTTE\n                         I doubt it.\n\n                                     MICHAEL\n                         I've seen so little of America. I \n                         don't care for airplanes, you see, \n                         and I have so little time to travel.\n                              (beat)\n                         Did Mister Keane enjoy his trip then?\n\n                                     CHARLOTTE\n                         What trip?\n\n                                     MICHAEL\n                         Why, just yesterday.\n\n                                     CHARLOTTE\n                         I wouldn't really call that a trip.\n\n                                     MICHAEL\n                         Perhaps not. But I've never been to \n                         Ohio myself. They say parts of it \n                         are quite lovely.\n\n               Charlotte goes pale. The elevator stops and he opens the \n               door.\n\n               INT. WILLS' FOYER -- CONTINUOUS\n\n               Charlotte steps out right into the kids who are roughhousing \n               and laughing. Each holds a five-dollar bill --\n\n                                     MICHAEL\n                              (calling out)\n                         All right, you little hellions! Get \n                         in here!\n\n               INT. WILLS' LIVING ROOM -- MOMENTS LATER\n\n               Charlotte wanders in. The tree stands erect. Wills, on all \n               fours, tightens the screws on the stand. He crawls to his \n               feet and studies it.\n\n                                     WILLS\n                         Straight?\n\n               Then he sees her grave expression and freezes.\n\n                                     CHARLOTTE\n                         I thought we had a deal.\n\n                                     WILLS\n                         I'm sure we do. About what?\n\n                                     CHARLOTTE\n                         Lying.\n                              (beat)\n                         You were in Ohio yesterday.\n\n               Wills stares at her for a moment, then explains without \n               apology --\n\n                                     WILLS\n                         I met with a heart specialist. He's \n                         willing to operate.\n\n               For an instant she is surprised, but then her indignation \n               takes over --\n\n                                     CHARLOTTE\n                         But you know I don't want that! You \n                         know I've signed papers that --\n\n                                     WILLS\n                         Well, maybe I want it.\n\n                                     CHARLOTTE\n                         It isn't your decision!\n\n                                     WILLS\n                         Of course not, but if you'll hear me \n                         out --\n\n                                     CHARLOTTE\n                         No! I told you right from the start \n                         how I felt and you went behind my \n                         back! You lied and --\n\n                                     WILLS\n                              (exploding)\n                         Oh, Christ, knock it off! You're \n                         such a god damn saint, so above it \n                         all, but you're scared to death! You \n                         do want to live! And if you were as \n                         honest as you say you are you'd let \n                         the doctors do whatever they can to \n                         help you!\n\n               Her face shuts like a trap. She walks toward the bedroom \n               door --\n\n                                     CHARLOTTE\n                         I won't give people hope when there \n                         isn't any.\n\n                                     WILLS\n                         Why not?! Maybe we want hope! Or \n                         maybe we just need to know that we \n                         did everything we could! Maybe I \n                         need to know that... if I'm going to \n                         be able to live... to go on without... \n                         without --\n\n               Suddenly, a sob catches in his throat. Charlotte, on her way \n               to the bedroom, stops and slowly turns around.\n\n               She speaks matter-of-factly, without judgment or feeling.\n\n                                     CHARLOTTE\n                         Now I know why you hurt so many women. \n                         Because you always knew if you held \n                         on to one of them, you'd never let \n                         go.\n\n               She turns and exits coldly to the bedroom. Wills sinks into \n               an armchair.\n\n               INT. WILLS' BEDROOM -- LATER\n\n               In grey afternoon shadows, Charlotte lies on her side, fully \n               clothed under the covers, with her eyes open, thinking. She \n               hears something and looks back.\n\n               Wills stands in the lighted doorway.\n\n               She gestures for him to come. He walks over and lies down \n               next to her. She turns her back to him, so that he's spooning \n               her, but she takes hold of his hand, pressing it against her \n               chest and squeezing it like a doll.\n\n               For a long time, they lie in silence. Finally, she murmurs \n               almost inaudibly --\n\n                                     CHARLOTTE\n                         When we met, I was so lonely. But I \n                         didn't even know it. I'd been alone \n                         so long.. almost forever...\n\n                                     WILLS\n                         So had I.\n\n                                     CHARLOTTE\n                         But now we have each other.\n                              (beginning to cry)\n                         Oh, what would I do, Wills? What \n                         would I do if you weren't here? Where \n                         would I be?\n\n               Fighting his emotions, determined to stay strong for her, he \n               holds her close.\n\n                                     WILLS\n                         You don't ever have to worry about \n                         that.\n\n                                     CHARLOTTE\n                         I'll do whatever I have to! I'll \n                         tear up the papers! Whatever you \n                         want! Tell the doctor! Because... I \n                         really do want... I don't want to \n                         leave you!\n\n               The dam breaks and she is wracked by sobs. Wills closes his \n               eyes, holds her even tighter, and rocks her in his arms.\n\n                                                               DISSOLVE TO:\n\n               INT. WILLS' BEDROOM -- THAT EVENING\n\n               Charlotte, still fully clothed, lies sound asleep. She slowly \n               awakens and sees that Wills is gone. She gets up on one elbow --\n\n                                     CHARLOTTE\n                         Wills?!\n\n               She waits, hears hurried steps, then Wills sticks his head \n               in --\n\n                                     WILLS\n                         Yeah?\n\n                                     CHARLOTTE\n                         How long was I asleep?\n\n                                     WILLS\n                         A couple of hours.\n\n                                     CHARLOTTE\n                         Wow. And I'm still tired.\n\n                                     WILLS\n                         That's all right. Relax.\n\n               Charlotte senses something odd in his tone. Her eyes narrow \n               with suspicion.\n\n                                     CHARLOTTE\n                         What're you doing in there?\n\n                                     WILLS\n                         Nothing.\n\n               She laughs and starts to get up --\n\n                                     CHARLOTTE\n                         Liar!\n\n                                     WILLS\n                         Don't! Don't move! Just one more \n                         minute!\n\n               He closes the door.\n\n               INT. WILLS' LIVING ROOM -- SAME\n\n               Wills runs back into the room. The tree is fully decorated \n               now. He dashes back and adjust some lights along the base.\n\n                                     CHARLOTTE'S VOICE\n                              (from the bedroom)\n                         What're you doing?!\n\n               He runs over, inserts the plug and the TREE LIGHTS UP with \n               LITTLE WHITE LIGHTS, but for the STAR AT THE TOP.\n\n                                     CHARLOTTE'S VOICE\n                         Oh no! You didn't!\n\n                                     WILLS\n                         You were just going to tire yourself \n                         out!\n\n               He grabs a chair and fiddles with the bulb inside the star.\n\n                                     CHARLOTTE'S VOICE\n                         This I've gotta see!\n\n                                     WILLS\n                         Just hold on!\n\n               THE STAR LIGHTS UP. He jumps down and puts the chair away. \n               Then he runs over and dims the lights --\n\n                                     WILLS\n                         Finishing touches!\n\n               He runs over and adjusts a garland. He runs back to the dimmer \n               and adjusts it again --\n\n                                     WILLS\n                         Almost!\n\n               He runs back to the bedroom door and flings it open.\n\n                                     WILLS\n                         Voila!\n\n               He looks into the room and freezes in the doorway. He backs \n               up a step, then, crying out, lunges into the room.\n\n               MUSIC UP:\n\n               EXT. WILLS' BUILDING -- NIGHT\n\n               Charlotte, lying unconscious on a stretcher, wearing an oxygen \n               mask, is rushed into a waiting ambulance. Wills, beside \n               himself with panic, is gently barred by a MEDIC from jumping \n               in with her.\n\n               INT. NEW HAVEN HOSPITAL LECTURE HALL -- NIGHT\n\n               In the reflection of a projected slide, a hand offers a \n               CELLULAR PHONE to Dr. Grandy, standing at a lectern in front \n               of a group of doctors. He stops his lecture and takes the \n               call.\n\n               EXT. MANHATTAN STREET -- NIGHT\n\n               The ambulance rushes, light flashing, sirens wailing, \n               downtown.\n\n               INT. ST. VINCENT'S HOSPITAL -- NIGHT\n\n               Charlotte's stretcher is rushed into the emergency room at \n               the same time that Wills' cab pulls up.\n\n               EXT. NEW HAVEN HOSPITAL HELIPORT -- NIGHT\n\n               Grandy is rushed into a MEDICAL HELICOPTER.\n\n               INT. CORONARY CARE UNIT WAITING ROOM -- NIGHT\n\n               Wills looks up and sees Dolores and Shannon arrive.\n\n               EXT. SKY -- NIGHT\n\n               Grandy's helicopter speeds toward the City.\n\n               INT. CORONARY CARE UNIT WAITING ROOM -- NIGHT\n\n               Wills comforts Shannon. Dolores looks up and sees Simon \n               standing in the doorway. Then a CORONARY CARE NURSE appears. \n               She asks to speak to Wills.\n\n               INT. MEDICAL HELICOPTER -- NIGHT\n\n               Grandy looks out the window as the helicopter swoops down \n               toward the lights of lower Manhattan.\n\n               INT. CORONARY CARE UNIT PRE-OP -- NIGHT\n\n               Charlotte lies, semi-conscious, on a gurney. Wills appears \n               in the doorway with the nurse.\n\n               EXT. ST. VINCENT'S HOSPITAL HELIPORT -- NIGHT\n\n               The helicopter lands and Grandy jumps out.\n\n               MUSIC OUT:\n\n               INT. CORONARY CARE UNIT PRE-OP -- NIGHT\n\n               Wills sits down next to Charlotte's bed. He touches her hand. \n               Her eyes open then close again. Her breathing is heavy and \n               labored.\n\n               Wills pushes a lock of hair off her brow, then whispers, \n               half to himself --\n\n                                     WILLS\n                         Time cannot break the bird's wing \n                         from the bird. Bird and wing together \n                         Go down, one feather. No thing that \n                         ever flew, not the lark, not you, \n                         Can die as others do.\n\n               Charlotte's eyes open dreamily. She shows a faint smile at \n               the poem and murmurs almost inaudibly --\n\n                                     CHARLOTTE\n                         What have I done to you?\n\n                                     WILLS\n                         Ruined me for other women.\n\n                                     CHARLOTTE\n                         No... I saved you for them...\n\n               Her eyes close. Wills takes her hand and presses it to his \n               cheek.\n\n                                     MALE VOICE\n                         Is she type 'n' cross for six units?!\n\n                                     NURSE'S VOICE\n                         Yes, Doctor.\n\n               Wills turns around and sees Grandy standing in the doorway.\n\n                                     GRANDY\n                         What're we waiting for?\n\n                                     PRE-OP NURSE\n                         Just you, Doctor!\n\n                                     GRANDY\n                         Then let's move!\n\n               The NURSE rushes over to the gurney and in an instant \n               Charlotte is gone -- wheeled with a bang through SWINGING \n               DOORS into the operating room corridor.\n\n               MUSIC UP:\n\n               INT. CORONARY CARE UNIT WAITING ROOM -- NIGHT\n\n               Everyone is there now -- John, Sarah, Celia, Simon, Dolores, \n               and Shannon. Wills enters silently. He walks to the new \n               arrivals and greets each one with an embrace.\n\n               INT. CORONARY CARE OPERATING ROOM -- NIGHT\n\n               Charlotte lies on the table. Grandy's eyes, visible above \n               his mask, are fiercely focused on his work.\n\n               INT. CORONARY CARE UNIT WAITING ROOM -- NIGHT\n\n               Shannon lies with her head in Sarah's lap.\n\n               Dolores, ignoring the sign, smokes a cigarette.\n\n               John and Celia sit side-by-side in silence.\n\n               Wills stands at the window. He looks over and see Simon \n               standing close by. Simon looks at him, his eyes sad but eerily \n               calm. Wills shakes his head --\n\n                                     WILLS\n                         It happened so quickly. We'd just \n                         talked about the surgery. She agreed \n                         to it. But I thought there'd be time.\n\n                                     SIMON\n                         I've had friends who weren't expected \n                         to last till morning who lived another \n                         seven years. Another ran a marathon \n                         and died the next weekend. It's all \n                         so terribly random the way life \n                         actually works. I take nothing for \n                         granted.\n\n               A light enters Wills' eye. He smiles as he remembers --\n\n                                     WILLS\n                         You know, it's funny, the first time \n                         I saw her, I --\n\n               But then Wills hears something. He turns and there's Grandy \n               at the end of the long hall, walking toward the waiting room.\n\n               Simon looks and sees him, too.\n\n               Wills looks at Simon with alarm. It's impossible. How could \n               Grandy be finished so soon? Wills looks back at Grandy.\n\n               SLOW-MOTION\n\n               Grandy moves with long strides down the corridor.\n\n               One by one, as they notice, Charlotte's loved ones react to \n               the sight of Grandy.\n\n               Shannon rises from Sarah's lap, looks at the doctor, then \n               covers her face with her fists, holding her breath.\n\n               Dolores crushes out her cigarette, her expression falling.\n\n               Celia touches John's back as he rises and walks over to Wills.\n\n               Simon's face turns to stone.\n\n               John reaches for Wills, but Wills advances a few steps toward \n               the corridor, almost defiantly, his eyes riveted to Grandy.\n\n               Grandy's head is down.\n\n               Then, ever so slowly, Grandy lifts his head and in one \n               decisive move YANKS OFF HIS SURGICAL MASK and THROWS IT \n               AGAINST THE WALL.\n\n               CLOSE ON WILLS' FACE as he realizes.\n\n               His mouth opens wide as though to cry out, but no sound comes.\n\n               INT. WILLS' LIVING ROOM -- DAWN\n\n               Wills stands in the center of the room wearing his overcoat. \n               He is pale, exhausted, his face expressionless.\n\n               John stands, also wearing his coat, in the hall archway, \n               unsure whether he should stay or leave.\n\n               Wills looks at the Christmas tree, whose lights still burn. \n               He slowly walks over and pulls the cord from the wall.\n\n               The lights go out.\n\n                                                             FADE TO BLACK:\n\n               FADE IN:\n\n               EXT. CENTRAL PARK -- SPRING AFTERNOON\n\n               A COUPLE walks down the same walkway. They are deep in subdued \n               conversation. All around them spring is in full glory. Melted \n               snow. Trees exploding with green. Birds singing.\n\n               The man is Wills Keane, but he has markedly changed. His \n               dress is not so impeccable, his hair has gone grey at the \n               temples. His face, though still beautiful, has gracefully \n               turned the corner into middle age.\n\n               Walking at his side is his daughter, Lisa, now well along in \n               her pregnancy --\n\n                                     LISA\n                         Actually, to be honest, Peter's more \n                         than a little freaked. I mean, how \n                         could he not be? He's twenty-six. \n                         His first child. A baby girl, no \n                         less. Nothing really prepares you \n                         for it.\n\n                                     WILLS\n                         I guess not.\n\n                                     LISA\n                         He said it's the first time since we \n                         got married that he's actually \n                         realized what marriage is. That it's \n                         forever. That he can't just pick up \n                         and run away to Nepal or something \n                         if we have a fight. That he's part \n                         of the cycle of things now. That \n                         he's gonna die some day. That it's \n                         the next generation's turn to take \n                         the stage.\n\n               EXT. ANOTHER CENTRAL PARK WALKWAY -- LATER\n\n               Wills and Lisa walk together in silence, enjoying the perfect \n               afternoon. Then Lisa smiles crookedly and slaps his shoulder --\n\n                                     LISA\n                         So what about you, Mr. Keane? You \n                         ready to be a grandpa?\n\n               Wills looks over at the spot where he first saw Charlotte.\n\n               He smiles with wistful confidence then, a little awkwardly, \n               puts his arm around his daughter.\n\n               She is surprised at first. But then slowly, trustingly, she \n               rests her head on his shoulder.\n\n               And they walk.\n\n                                                                  FADE OUT:\n\n                                         THE END\n\n\n\n\n\nAutumn in New York\nWriters :   Allison Burnett\nGenres :   Romance  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:53.130827"}