{"title": "Avventura, L' (The Adventure)", "film_link": "/Movie Scripts/Avventura, L' (The Adventure) Script.html", "script_link": "/scripts/Avventura,-L'-(The-Adventure).html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Avventura, L' (The Adventure) Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Avventura, L' (The Adventure) Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Michelangelo Antonioni\" title=\"Scripts by Michelangelo Antonioni\">Michelangelo Antonioni</a><br/>  <a href=\"/writer.php?w=Elio Bartolini\" title=\"Scripts by Elio Bartolini\">Elio Bartolini</a><br/>  <a href=\"/writer.php?w=Tonino Guerra\" title=\"Scripts by Tonino Guerra\">Tonino Guerra</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<br/>\n<a href=\"/scripts/Avventura,-L'-(The-Adventure).html\">Read \"Avventura, L' (The Adventure)\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>L'avventura (The Adventure)\n\nscript by\nMichelangelo Antonioni\nElio Bartolini\nTonino Guerra\n\ntranslated by\nLouis Brigante\n\n\n\nIt is the afternoon of a summer's day. Anna, a twenty-five-year-old brunette, \ncomes out from the entrance of a stately building and walks along a pathway \nthat leads up to a dirt road. She is in a great hurry and becomes a little \nannoyed and surprised at seeing her father, a meticulously dressed and \nelderly gentleman, standing near the curb busily talking to his chauffeur in \nfront of a black British car.\n<b> \n</b><b>\t\t\t\tANNA\n</b>\t\tSo, there you are... I've been upstairs looking \n\t\tall over for you...\n<b> \n</b>There is a moment of silence during which Anna's father deliberately ignores \nher presence. She stares at him intently, trying to determine his mood and \nwondering how she is going to tell him what she has to say before she leaves. \nFinally, he turns around and faces her.\n<b> \n</b><b>\t\t\t\tFATHER \n</b>\t\tOh, I thought you were already on the high \n\t\tseas.\n<b> \n</b>Anna is barely able to control her temper, but realizing that the discussion \nis about to take the usual sarcastic turn, she immediately checks herself.\n<b> \n</b><b>\t\t\t\tANNA\n</b>\t\tNo, not yet, Dad.\n<b> \n</b>Her father fixes her with a long ironic look. Conscious of his daughter's \nhaste, he is apparently trying his best to detain her.\n<b> \n</b><b>\t\t\t\tFATHER \n</b>\t\tIsn't it fashionable any more to put on a \n\t\tsailor's cap with the name of the yacht? \n\n<b>\t\t\t\tANNA \n</b>\t\tNo, Dad, it isn't.\n<b> \n</b>There is another moment of silence. Meanwhile, a car has pulled up on the \nother side of the road. It is Claudia, a twenty-four-year-old blonde and a \nfriend of Anna's. Both she and the driver get out of the car and remain \ndiscreetly in the background, waiting for the conversation to end. Anna's \nfather resumes speaking, after a cursory nod to Claudia who, in turn, \nresponds with a polite but half-hearted smile.\n<b> \n</b><b>\t\t\t\tFATHER \n</b>\t\tAnd how long will you be away? \n\n<b>\t\t\t\tANNA \n</b>\t\tFour or five days.\n\n<b>\t\t\t\tFATHER \n</b>\t\t\t(resignedly) \n\t\tOh, very well. I'll just spend the weekend \n\t\talone by myself and take a little rest. I \n\t\tshould be used to it by now.\n<b> \n</b>Anna glares at him furiously but still manages to restrain herself.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tUsed to what?\n\n<b>\t\t\t\tFATHER \n</b>\t\tTo the fact of my retirement, not only as a \n\t\tdiplomat but also as a father.\n\n<b>\t\t\t\tANNA \n</b>\t\t\t(protestingly and with a \n\t\t\t deep sense of compassion) \n\t\tBut how could you say such a thing? \n\n<b>\t\t\t\tFATHER \n</b>\t\tBecause it's true. After thirty years -- not \n\t\thaving ever spoken the truth to anyone, I \n\t\tshould at least allow myself to do so with my \n\t\town daughter. \n\n<b>\t\t\t\tANNA \n</b>\t\tAnd have you any other truths to tell me? \n\n<b>\t\t\t\tFATHER \n</b>\t\tYou already know what they are.\n\n<b>\t\t\t\tANNA \n</b>\t\tYou mean Sandro, don't you?  Well, I beg of \n\t\tyou, please, spare me that. Goodbye, Dad.\n<b> \n</b>She kisses him on the cheek but the father remains unmoved. It is obvious \nthat he still has something else he wants to say to her. In fact, after \ngazing upon his daughter with a certain amount of pity, he finally does say \nit.\n<b> \n</b><b>\t\t\t\tFATHER \n</b>\t\tThat type will never marry you, my child.\n\nAnna has a difficult time restraining herself but manages somehow to keep \ncalm as she answers.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tUp until now, Dad, I've been the one who hasn't \n\t\twanted to marry him.\n\n<b>\t\t\t\tFATHER \n</b>\t\tIt's the same thing. Goodbye, dear.\n<b> \n</b>He now returns the kiss his daughter had given him a short while ago. Then, \nwithout once turning around, he heads slowly towards the entrance of the \nhouse, as Claudia comes into the foreground.\n\nAnna, still very tense and upset over the scene with her father, gets into \nthe car. Claudia follows after her, as the driver puts her suitcase into the \ntrunk.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHave you been waiting long? You'll have to \n\t\texcuse me.\n<b> \n</b>Anna doesn't answer. She merely pats Claudia's hand. The car takes off, as \nAnna's maid, standing to one side of the road, waves a warm goodbye. Claudia \nresponds by waving back, but Anna doesn't even look around. Instead, she \nturns to the driver and says:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tPlease hurry, Alvaro. We're late.\n<b> \n</b>The car speeds ahead along the dusty road, across a verdant strip of land, \nuntil it reaches the archway of a stone-wall fence around which it turns and \ndisappears. It is seen again emerging from behind a cement wall and continues \nracing swiftly onward over a road that runs between two high walls. There is \nno sign of traffic. Only silence. It is an ancient road, and a very elegant \none. Claudia looks at it admiringly. Anna continues to remain wrapped up \nwithin herself. The car now makes another turn, heading into a small, narrow \nroad flanked on each side by gardens of patrician villas. Suddenly, it \nemerges on a drab, modern street amid the kind of traffic typical of any \nmodern town.\n\nFinally the car enters the street where Sandro lives and pulls up in front of \na small but very fashionable palazzo. Anna and Claudia get out. And as the \ndriver starts to remove the suitcases from the trunk, Claudia turns to Anna \nand says:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI'll wait for you here.\n<b> \n</b>Anna starts to walk across the street and is about to enter a building. \nSurprised, Claudia calls out to her:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tBut where are you going? \n\n<b>\t\t\t\tANNA \n</b>\t\tI'm thirsty.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tIf I had a man waiting for me for half an hour \n\t\tand whom I hadn't seen for a month ...\n<b> \n</b>All of a sudden, Anna stops. She is pensive, almost sullen.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tYou know, I could just as well go without \n\t\tseeing him today.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tWhat! After giving us such a run around... \n\nClaudia stops, smiles, and jokingly tries to laugh it off. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI see... so it's farewell to the yacht...and \n\t\tfarewell to the cruise...\n<b> \n</b>Anna pays no heed to Claudia's teasing comments but follows her own original \nline of thought.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tYou know, it's terrible to be far away from one \n\t\tanother. Really, it's difficult to keep an \n\t\taffair going when one is here and the other is \n\t\tsomewhere else. But, at the same time...it's \n\t\tcomforting.  Because it gives you a chance to \n\t\tconsider what you want and how you want it...\n\t\tbut when he's right there before you all the \n\t\ttime... well, he's right there...\n\t\t\t(Then, with a sense \n\t\t\t of exasperation) \n\t\tOh, let's go back....\n<b> \n</b>Claudia notices Sandro leaning out of the window from his apartment on the \nfirst floor of the building. He is looking at them attentively. He is a young \nman of thirty-five. His shirt is unbuttoned and the tie around his neck is \nunknotted. Realizing that he has been spotted, he smiles and waves a cheerful \nhello.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tI'll be right down.\n<b> \n</b>As if seized by a sudden powerful impulse, Anna heads straight towards the of \nthe building. Claudia looks at her with astonishment, and watches her \ndisappear into the doorway. Then she looks up again at the window. But Sandro \nis no longer there.\n<b> \n</b>\n<b>***\n</b>Sandro's apartment is extremely small. Although it contains many books, it \nhas the atmosphere of a place that is very seldom lived in. Sandro has just \nfinished knotting his tie. He closes his suitcase and heads toward the door. \nHe turns back, however, to pick up a towel fallen from the bed. He takes the \ntowel into the bathroom. Then he goes to the door again, opens it, and sees \nAnna. She appears a little anxious. Without giving Sandro a chance to say a \nword, she enters the apartment, closing the door behind her. Sandro puts down \nhis suitcase and is about to embrace her, but Anna steps aside and begins \nstaring at him with an intense look upon her face. Taking him all in with her \neyes, she examines his suit, his hands, his legs, his shoes. Then her gaze \nmoves back up to his face which she proceeds to scrutinize. Sandro is unable \nto understand her behavior, so he shrugs and jokingly exclaims:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWould you like to see my profile?\n<b> \n</b>He snaps himself into profile, then turns, slowly, in the manner of a store \nwindow mannequin. Anna continues to stare at him. This time she peers \ndirectly into his eyes. Sandro is no longer amused.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWell, what is it?\n<b> \n</b>Finally, Anna puts an end to her staring, and taking Sandro by the hand she \nleads him around the room. She stops in front of a mirror and looks at \nherself. The expression on her face becomes taut, determined. She starts \nunbuttoning her dress as she continues looking at herself in the mirror. \nSandro comes up close to her shoulders, caresses her hair, and whispers \nsoftly into her ear.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tBut your friend is waiting downstairs. \n\n<b>\t\t\t\tANNA \n</b>\t\tShe'll wait.\n<b> \n</b>Anna turns around and presses herself up against him with such a violent \npassion that Sandro is somewhat dismayed. But only for an instant. Soon they \nare feverishly kissing each other, and it is almost with a sense of sheer \nanimal pleasure that Sandro abandons himself.\n<b> \n</b>\n\n<b>***\n</b>Meanwhile, left alone, Claudia is pacing back and forth outside in front of \nthe building. She is bored and obviously tired of waiting. Then, as she is \nabout to cross over to the other side of the street, she sees Sandro and Anna \ncoming out of the doorway. The expression on Anna's face hasn't changed -- \nshe appears sad and gloomy. But Claudia doesn't take note of it; she is too \nbusy fuming over Anna's lack of consideration, eager to let them both \nunderstand that she is sick and tired of waiting around.\n<b> \n</b>As Sandro opens the window of the car, which is pointed towards Milan, he \nsays to Claudia:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tI have a feeling that you're not used to being \n\t\talone.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\t\t(glancing first at Sandro \n\t\t\t and then at Anna)\n\t\tThat seems to apply to you also...\n<b> \n</b>Meanwhile, the driver has taken Anna's suitcase out of the black car and puts \nit into Sandro's. Claudia picks up her own suitcase and is about to do the \nsame but Sandro intervenes and takes it from her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tDon't be so humble.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tHow should I be ... arrogant? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut of course... arrogant, haughty... Hasn't \n\t\tAnna ever told you?\n<b> \n</b>While this exchange was going on, Anna has already climbed into Sandro's car. \nSandro follows and takes his place at the wheel; Claudia gets in alongside \nhim. The car takes off at high speed.\n<b> \n</b>\n\n<b>***\n</b>Heading south along a state highway, Sandro's car is traveling at high speed \nover a straight open road. It is twilight and as the evening shadows begin to \nfall, the surrounding countryside is bathed in an aura of mystery.\n\nInside the car Anna, Claudia and Sandro sit in complete silence. Anna is \ndeeply absorbed in her own thoughts. Claudia is looking out of the window, \nenthralled by the dark beauty of the landscape. Another car draws up \nalongside of Sandro's and is about to pass him. But Sandro steps on the \naccelerator and pulls ahead with a tremendous burst of speed. The other car \nlags behind and then turns off at a crossroad. However, Sandro makes no \nattempt to slow down. In fact, spurred on by what has now become a definitely \nhostile atmosphere, he drives even faster.\n\nAs Sandro suddenly switches on the headlights, the violent glare that \npolarizes the roadside cuts off Claudia's view. She turns to Sandro with a \nlook of disappointment\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tIt was lovelier before.\n<b> \n</b>To please her, Sandro turns the headlights off and once again the countryside \nis covered by a veil of thick but romantic shadows.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tLike this?\n<b> \n</b>Now Claudia again peers out at the landscape -- but only for an instant. \nSandro abruptly turns the headlights on again, revealing a sharp curve in the \nroad up ahead, only about a hundred yards away. He quickly shifts into lower \ngear, and the car swerves slightly. The sudden shift from fourth to third \ngear causes the motor to emit a sound that resembles a cry. The car races \nswiftly towards the curve, getting closer and closer. But at such high speed \nit appears impossible the car will be able to make the turn. Further up \nahead, where the curve fades, there is a stone wall that runs along the side \nof the road. At this point, even Anna is attentive, her eyes wide open. Both \nshe and Claudia are petrified and terror-stricken as the curve and the wall \nloom closer and closer. Fifty yards, forty, ten. All of a sudden, the \nheadlights illuminate a large gap in the wall about three or four yards away, \njust on the other side of a small ditch that separates the road from the wall \nitself. There seems to be no other choice. With a frightening leap -- and \ngoing well over fifty miles an hour -- the car barely makes it over the ditch \nand right through the opening in the wall. The car comes to a sudden halt, \nbut skids along on the muddy ground of an empty lot until it finally stops \nnear the door of a small farmhouse in front of an old man. He is seated on a \nbench and has been observing the entire scene without budging an inch. \n\nThere is a brief pause -- silence. Then Sandro comes out of the car followed \nby Claudia and Anna. Claudia is visibly shaken. She leans up against the \nbuilding for support, as though in search of something solid and dependable. \nShe is also unnerved by the feeling that she is responsible for what has just \nhappened.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tIt's all my fault!\n<b> \n</b>But instead of reproaching her, Sandro turns to the old man and excuses \nhimself for having broken into his property. Imperturbably, the old man looks \nup at him and says:\n<b> \n</b><b>\t\t\t\tOLD MAN\n</b>\t\tAnd who do you think made that hole over there?\n<b> \n</b>Even before he has a chance to be surprised at the old man's remark, Sandro \nbecomes aware that Anna is laughing. It is not the hysterical laugh that \nnormally might be expected after such a close call. It is, instead a pure and \nsimple laugh, almost a happy one, and leaves both Sandro and Claudia plainly \nbaffled.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tThere's nothing much to laugh at. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd that's what I say, too. We could have all \n\t\tbeen killed.\n<b> \n</b>Anna looks at them as she continues to laugh.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tI'm sorry ... but I can't help laughing...\n<b> \n</b>\n\n<b>***\n</b>On a calm sea, amid the Aeolian Isles, just off the coast of Sicily, a motor \nyacht is moving quietly and smoothly over the water. It is heading directly \ntowards a small island that appears like a huge rock jutting up from the sea, \nsharply silhouetted against the sky, about a hundred yards away. A few sea \ngulls are lazily wheeling around up above.\n\nAboard the yacht, a sailor is at the helm, peacefully smoking his pipe, while \nanother peers out over the water as he munches on a sandwich. It is almost \nnoon.\n<b> \n</b>Raimondo, a deeply bronzed young man in his thirties, is lying outstretched \nin the sun on top of the cabin. Towards the prow, lying flat on her stomach \nupon a small rubber mat, is Claudia. Her arms are dangling over the side of \nthe boat, catching the cool, fine spray of water splashing gently against the \nprow. Corrado comes out of the cabin. He sits down on a bench near the stern \nafter placing a cushion under himself so as not to soil his suit, which is \nwhite and of an elegance that is slightly out of style. Corrado has a \nsensitive face, with a look that is both sharp and intelligent. In age, he is \ncloser to his fifties than his forties. Following directly behind him is \nGiulia, one of those impossible women who are so terribly sweet and coy and \nyet so demanding of attention. The pose she strikes as she looks out over the \nwater, and the saccharine tone of voice in which she speaks, are precisely \ncharacteristic of her nature.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tIt's as smooth and slick as oil. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tI detest comparisons made with oil.\n<b> \n</b>Anna also appears on deck, looks around and, noticing Claudia, goes over and \nlies down beside her. Claudia rolls over on her back to embrace all that \nwonderful sun but her outstretched arm comes in contact with Anna, who smiles \nand joins her in a friendly embrace.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tDid you sleep well?\n\n<b>\t\t\t\tANNA \n</b>\t\tYes, fairly well. But I went to bed last night \n\t\tplanning to do some thinking about a number of \n\t\tthings ... instead, I fell asleep.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI didn't know one could sleep so well on a \n\t\tyacht. It lulls you ...\n<b> \n</b>Their conversation is suddenly interrupted by Sandro's voice shouting \n\"Hello.\" He comes up to them and gives Anna a warm hug, then nods hello to \nClaudia. He is in a jaunty mood. Stretching himself out on the deck, he opens \na picture magazine he had brought with him and starts to read. But Anna \nplaces her hand over the page he is looking at and says to him:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tIt would be better for you to get some sun.\n\nSandro closes the magazine and throws it overboard. The pages come apart in \nthe water. Some of them are quickly swept under by the waves, while others \nfloat and slowly drift away: white specks upon which a few sea gulls converge \nemitting their guttural cries. \n\nAs Sandro stretches himself out in the sun, Anna looks upon him with \ntenderness. She is about to embrace him but stops midway, and then finally \nchanges her mind. Instead, she proceeds to stare at him with a profoundly \ntroubled expression. Then, momentarily dismissing her anxiety, she cuddles up \nclose to him in an effort to provoke his affection. Sandro responds, but only \nwith a fleeting kiss. Seeing them together like this, Claudia gets up and \nmoves away to the far side of the prow. Sandro and Anna remain as they are \nuntil they are suddenly enveloped by a dark shadow. Sandro opens his eyes and \nsits up. Anna does the same. The rocky island is now quite close, almost \ndirectly upon them. It is larger than it previously appeared and casts a \nlong, dark shadow over the yacht. The water beneath the overhanging cliffs is \nextremely clear and almost motionless. Sandro rises to his feet and shouts \nout to everybody aboard.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tShall we go for a swim? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOh, no... please... not here.  It looks too \n\t\tdangerous.\n<b> \n</b>The yacht proceeds to encircle the island. Up ahead, another island comes \ninto view. It is smaller, brighter, and less foreboding. Corrado gets up and \ncomes over to the prow to join Sandro, Anna and Claudia. He is immediately \nfollowed by Giulia, who peers intently at the landscape.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tAt one time the Aeolian isles were all \n\t\tvolcanoes. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tYou must know your third grade geography book \n\t\tinside out.\n<b> \n</b>Giulia looks at him resentfully and abashed. Claudia points to an island \nwhich they have just passed.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tWhat is that one over there called? \n\n<b>\t\t\t\tCORRADO \n</b>\t\tThat must be Basiluzzo.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSounds like the name of a fish -- merluzzo, \n\t\tbasiluzzo...\n<b> \n</b>Corrado then points to an even smaller island which they are now approaching.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tNow that one is Lisca Bianca.\n<b> \n</b>Anna, who had been absorbed all the while in contemplating the landscape, \nthough still preoccupied with certain personal thoughts of her own, suddenly \nunfastens her thin dress. Stripping down to her bathing suit, she turns to \nthe group and exclaims with a note of exasperation:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tOh, my goodness... All that yapping just for a \n\t\tlittle swim.\n<b> \n</b>She then goes to the edge of the boat, which has slowed down somewhat, and \nbefore Sandro has a chance to call out to her, she dives into the water.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAnna!\n<b> \n</b>Once in the water, Anna starts swimming towards the island. The sailor at the \nhelm slows the boat even more so as to keep it within Anna's range. Raimondo, \nmeanwhile, has gotten his skin-diving equipment ready; around his waist he is \ntightening a belt to which a long knife is attached. The yacht continues to \nslow down. Sandro now dives into the water and starts swimming towards Anna. \nClaudia and Giulia are removing their clothes and they too get ready to go \ninto the water. But Claudia is afraid to dive in while the boat is still in \nmotion, so she turns to the sailor and shouts:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tStop ... stop the boat!\n<b> \n</b>The motor is turned off and the yacht soon comes to a halt. A sailor places a \nladder over the side of the boat. Claudia goes down the ladder, easing \nherself into the water. She moves away from the side of the yacht by swimming \nbackwards. Giulia follows her down the ladder but stops on the last rung.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tHow's the water?\n<b> \n</b>Sandro looks up and, pointing to the rocks at the highest part of the island, \nanswers her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tLet's see you dive from the top of those rocks, \n\t\tGiulia. That would be really sensational.  Come \n\t\ton, Giulia ... your life is much too \n\t\tcircumscribed. \n\n<b>\t\t\t\tGIULIA \n</b>\t\tWhat has everybody got against me this morning?\n<b> \n</b>From inside the cabin, a feminine voice is heard shouting:\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tRaimondo!\n<b> \n</b>Solicitously, Raimondo goes over to the door of the cabin, from which \nPatrizia emerges wrapped in a filmy nightgown. She is a woman of great \nelegance, somewhere in her thirties.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tWhy have we stopped?\n\n<b>\t\t\t\tRAIMONDO\n</b>\t\t\t(kissing her hand) \n\t\tLady Patrizia!\n<b> \n</b>Then, holding her by the hand, Raimondo leads her towards the prow, where \nCorrado greets her and likewise kisses her hand.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tAren't you going in for a swim, Patrizia? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tWhat makes you think I would even dream of such \n\t\ta thing? Raimondo, why don't you go in for a \n\t\tdip?\n<b> \n</b>She turns around to look at Raimondo and becomes somewhat startled to see him \nall rigged out in his diving equipment, complete with mask, spear-gun, etc.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tRaimondo... Do you enjoy fishing underwater?\n<b> \n</b><b>\t\t\t\tRAIMONDO \n</b>\t\tI detest it. But, after all, what can you do...\n\t\tIt's the latest...and I try my best to adapt \n\t\tmyself.\n<b> \n</b>He dives in. As soon as he hits the water, he starts shivering and exclaims:\n<b> \n</b><b>\t\t\t\tRAIMONDO \n</b>\t\tWho ever said that man was originally a \n\t\tcreature of the sea!\n<b> \n</b>Then, lowering the mask over his face, he begins to submerge. On deck, \nPatrizia peers out over the sea and covering her eyes to shade them from the \nsun, remarks:\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tI have never understood the islands. With all \n\t\tthat water around them, poor things ...\n<b> \n</b>\n\n<b>***\n</b>Out on the water, Sandro and Anna are almost at a standstill, keeping  \nthemselves afloat with only the slightest movement of their arms. Sandro is \nlaughing and joking as though all this purely physical enjoyment of sun and \nwater has freed him of all other cares. Anna tries to emulate him but is not\nentirely successful. Every now and then, her face becomes clouded with that \nsame worried expression.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tWhen do you have to go back?\n\n<b>\t\t\t\tSANDRO\n</b>\t\tI don't know... It depends on Ettore... He's \n\t\tnow in the process of negotiating for a \n\t\tcontract here in Sicily...\n\n<b>\t\t\t\tANNA \n</b>\t\tThen how come you're not with him? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tWhat a question... Because I want to be with \n\t\tyou, naturally. I hope he doesn't close the \n\t\tdeal so he'll leave me alone at least for a few \n\t\tdays... Isn't this water wonderful!\n<b> \n</b>He is lying on his back in the water, with his eyes closed, his face to the \nsun, cradled in the gentle movement of the waves. Anna looks at him, then \nafter a moment of silence, she says:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tI'd like to find a place where I can get some\n\t\tpeace and rest, maybe around here somewhere. \n\t\tI'd like to try...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tWhat could be more restful than this?...\n\t\t\t(He opens his eyes and \n\t\t\t is upright in the water) \n\t\tExcuse me, what is it that you want to try?\n<b> \n</b>Instead of answering him, Anna starts swimming rapidly out to sea. Sandro \ntries to hold her back but because she swims much faster, he gives up and \nfinds himself alongside of Giulia.\n<b> \n</b><b> \t\t\t\tGIULIA\n</b>\t\t\t (referring to Anna) \n\t\tWhere is she going? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAsk her.\n<b> \n</b>Giulia is not much of a swimmer; she bobs up and down in the water, doing a \ncrawl, and it seems she is always on the verge of going under. Still, she \nmanages to stay afloat, enjoying herself like a little child. Slightly off to \none side, Raimondo is exploring the depths, with his spear-gun in hand, ready \nto shoot. He seems to be chasing a fish that is apparently trying to elude \nhim. But the water is so clear that it would be difficult even for a fish to \nhide. In fact, only a moment later, Raimondo takes aim with his spear-gun, \npulls the trigger and the little harpoon shoots out. Then, with a great \nsplash, he swims off in hasty pursuit of the fish. A rubber raft, piloted by \none of the crew and bearing Corrado ashore, comes passing through the \nswimming area. The sailor is carrying on a conversation with Corrado.\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tI've always worked on pleasure boats... even \n\t\tthough it's more tiring. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tWhy?\n\n<b>\t\t\t\tSAILOR \n</b>\t\tBecause the owners never seem to have any fixed \n\t\thours. For example, last night we kept right on \n\t\tsailing... We didn't even have a chance to get \n\t\tsome sleep. Still, I like it better.\n<b> \n</b>The raft passes alongside of Sandro, and Corrado calls out to him:\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tI'm going ashore to take a look around the \n\t\tisland. There are some ruins up there... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tThere too...\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tWell, we're still in Italy, you know!\n<b> \n</b>The raft continues on its way towards shore. A little distance away, Claudia \nis floating on her back, basking in the sun, with her eyes closed -- almost \nmotionless. Her arms are outstretched and only the very slightest movement of \nher fingers in the water is sufficient to keep her afloat. Suddenly, her hand \ncomes in contact with something viscous... which seems to be a fish that has \nshot up to the surface of the water. At first, Claudia merely withdraws her \nhand without bothering to see what it is, but since it persists in following \nher, she opens her eyes and notices something moving right next to her. \nFrightened, she lets out a tiny yelp. At that very moment, directly behind \nthe fish, Raimondo's rubber fins appear above the water, and she realizes \nthat it is Raimondo himself. He removes his mask and breaks out into a hearty \nlaugh as Claudia playfully splashes some water into his face.\n\nObserving them from a few yards away is Anna. Having returned from her swim \nout in the open sea, she was about to join Claudia. But Claudia, involved now \nin chasing after Raimondo, doesn't notice her. \n\nMeanwhile, Raimondo, outdistancing Claudia, finds himself alongside of \nSandro.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWhat kind of a fish is that? \n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tIt's a cernia. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tMy God, it's enormous.\n<b> \n</b>Claudia, having given up trying to catch Raimondo, swims up alongside of \nGiulia, who is busy observing Corrado disembark on a little strip of beach \nthat stands out distinctly white against the dark rocks. Claudia is in a \nplayful mood. She dives underwater, grabs hold of Giulia's leg, comes up, and \nthen dives under once again. Giulia, caught up in the spirit of all this \nplayfulness, drops her concern with Corrado and joins in with the fun and \nmerriment.\n\nSuddenly there is a loud shriek, then Anna's voice is heard screaming:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tA shark!... A shark!\n<b> \n</b>They all turn around to look at her. Anna is swimming furiously towards the \nboat. Then, immediately, the booming voice of the sailor aboard the yacht \nsounds out:\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tDon't move,  lady... Stay where you are... \n\t\tStop! Everybody keep still.\n<b> \n</b>But Sandro ignores the warning and starts swimming out towards Anna like a \ndemon. Raimondo, who was about to climb aboard the yacht, grasps his \nspear-gun firmly in his hand, hurls himself back into the water, and also \nstarts to swim in Anna's direction. Claudia is stricken with fear, and holds \non tight to Giulia. Anna has stopped swimming and is cautiously looking \naround to see if anything comes up out of the water. Then, she looks up and \nseeing Sandro and Raimondo approaching, she shouts:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tStay away!\n<b> \n</b>They both stop. Then, Raimondo hurriedly dons his mask and disappears under \nwater while Sandro again starts swimming out towards Anna. Sandro comes up \nalongside her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAnna...\n<b> \n</b>But Anna doesn't say a word. Instead, they both swim silently back to the \nyacht, where Claudia and Giulia are already climbing aboard. Patrizia comes \nout of the cabin to see what is happening.\n\nThey all lean over the side of the boat, looking down into the water, \nexpecting the shark at any moment to come into view. But the water remains \nunruffled, the seaweed below is clearly visible, waving like so many fans. \nEven the rocks at the bottom can be seen with all sorts of small-gilled fish \ndarting about. A mysterious, fascinating world and yet, because of what \nhappened, one that arouses fear. Everyone aboard is silent. Until Anna and \nSandro, followed by Raimondo, finally arrive and climb aboard. Sandro \nimmediately takes Anna to her cabin, and the others follow, making various \ncomments.\n<b> \n</b><b> \t\t\t\tCLAUDIA \n</b>\t\t\t(to Anna)\n\t\tBut how did you become aware of it? Did it \n\t\ttouch you?\n<b> \n</b>Anna doesn't answer but continues on ahead amid the overlapping remarks.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tI would have died.\n<b> \t\t\t\t\n</b><b>\t\t\t\tPATRIZIA\n</b>\t\t... and how ugly they are ... with all those teeth...\n\n<b>\t\t\t\tCORRADO \n</b>\t\t\t(shouting from the shore) \n\t\tWhat happened? \n\n<b>\t\t\t\tGIULIA \n</b>\t\t\t(shouting from the prow) \n\t\tThere's a shark in the area. Don't move from \n\t\twhere you are! \n\n<b>\t\t\t\tCORRADO \n</b>\t\tWho's moving?\n<b> \n</b>\n\n<b>***\n</b>Inside the cabin, which is partitioned into separate rooms, the general \nlayout is neat and orderly, with a number of prints decorating the walls. \nSandro and Anna, followed by Claudia, enter from the outside deck and cross \nover into Anna's room. It is extremely small, with two cots on one side and a \nlong curtain that partially conceals a bureau from which several dresses are \nseen hanging.\n\nAnna is soaking wet in her bathing suit and her hair is all knotted into  \nclusters that hang down over her face. Without bothering to dry herself, she \ncrouches down on the cot and, assisted by Claudia, wraps a blanket around her \nbody. Sandro and Claudia look at her with great concern. A member of the crew \nenters carrying a tray on which there is a half-filled glass of liquor, which \nSandro takes and offers to Anna.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tHere, drink some cognac.\n<b> \n</b>Anna positively refuses it, and the sailor leaves as Sandro sets the glass \ndown on a shelf. Looking up at both Sandro and Claudia, Anna appears pleased \nwith their solicitude.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tIt's nothing... really. Let's go back... It's \n\t\tall over now. \n\nA pause and then an instant later, she begins shivering under the blanket. \n\n<b>\t\t\t\tANNA \n</b>\t\tOnly, I'd like to change. I'm a little cold.\n<b> \n</b>Leaving Anna and Claudia alone on their own, Sandro turns and goes outside \nthe cabin where the others are still congregated, busy chattering. Among the \nremarks exchanged, one that is distinctly heard is Patrizia's.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tBut where did the shark go to?\n<b> \n</b>As soon as Sandro closes the door to the cabin, Anna is suddenly and \ncompletely changed. She gets up from the cot, goes over to the curtain and \ndraws it aside, revealing an array of feminine attire. Wondering which dress \nto choose, she finally selects two and tosses them on the cot.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tWhich one shall I wear?\n\n<b>\t\t\t\tCLAUDIA\n</b>\t\t\t(picking up one of the two dresses)\n\t\tThis one is gorgeous.\n\n<b>\t\t\t\tANNA \n</b>\t\tThen why don't you try it on?\n<b> \n</b>As Anna begins to dry herself with a large bath towel, Claudia slips on the \ndress and looks at herself in the mirror with a coquettish expression on her \nface.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tIt looks better on you than it does on me... \n\t\tYou keep it.\n<b> \n</b>Anna is removing her bathing suit as she continues talking to Claudia with a \ntone and manner that reveal a sense of excitement mixed with one of amusement.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tYou know, that thing about the shark was all a \n\t\tjoke.\n<b> \n</b>Claudia looks at her as though dumbfounded, as though she had never known her \nbefore. She is obviously piqued and angry, but more with herself than with \nAnna.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tThere's the difference between you and me: you \n\t\tknow how to put over certain things, and I \n\t\tdon't. Sometimes I envy you.\n<b> \n</b>Anna is all dressed and ready. She opens the door and steps outside, as \nClaudia follows behind. \n\n\n\n<b>***\n</b>Out on the deck, Sandro, Patrizia, Raimondo and Giulia are looking over the \nside of the boat, watching the sailor as he approaches the yacht with a \nrubberized raft.  Giulia, with her usual air of affectation, looks down at \nthe water splashing up against the raft and asks the sailor:\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tBut aren't you afraid?\n\n<b>\t\t\t\tSAILOR \n</b>\t\tMa'am, sharks never attack anybody. Anyway, the\n\t\traft is dark, and they wouldn't be able to see \n\t\tit.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tSo, it is true that they're blind...\n<b> \n</b>Anna appears at the door of the cabin and Sandro rushes over to meet her, a \nlittle surprised to find her looking so cheerful, as though the incident that \nhad just taken place were completely forgotten.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tHow are you?\n\n<b>\t\t\t\tANNA \n</b>\t\tFine. Can't you see so yourself?\n<b> \n</b>Anna goes over to the edge of the boat and stands at the head of the little \nstairway leading down to the water.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tI have an urge to put my feet on some land. \n\t\tAren't you coming?\n<b> \n</b>As she starts to go down the steps, Sandro quickly comes over to her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAnna... Maybe it would be better to wait a \n\t\twhile.\n\n<b>\t\t\t\tANNA \n</b>\t\tWait for what?\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tWell, with a shark running loose around the \n\t\tplace, I for one won't get aboard that raft! \n\t\tThey'll have to catch it first. I want to see \n\t\tit right here before my feet, dead or alive. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tBetter dead.\n<b> \n</b>But Anna has already stepped aboard the raft, and Sandro follows her. Giulia \nhas her eyes fixed on the beach where Corrado in his white suit is waiting \nfor them. Her desire to join him is greater than her fear of the shark, so \nshe looks down at the sailor and asks:\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tWill the three of us fit?\n\n<b>\t\t\t\tSAILOR \n</b>\t\tSure, sure. There's plenty of room.\n<b> \n</b>Patrizia, instead, turns around and heads back to the cabin. And Raimondo \nfollows her shortly after. Giulia descends into the raft and, as it moves \naway from the boat with a slight pitch, she lets out a few hysterical shrieks. \nAnna laughs and then shouts out to Claudia:\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tClaudia, aren't you coming?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI'm certainly not going to swim across. \n<b>\t\t\t\n</b><b>\t\t\t\tANNA \n</b>\t\tWe'll send the raft back to you.\n\n<b>\t\t\t\tGIULIA \n</b>\t\tAnd bring some cushions when you come, and a \n\t\ttowel...\n<b> \n</b>Claudia nods assent, and remains there looking over the side and watching the \nwater splash against the boat. Suddenly, she looks up at the sky and realizes \nthat the sun has disappeared. Actually, it is hidden behind a cloud, and over \non the horizon a group of other clouds have accumulated.\n\nThe sailor left aboard the yacht is now signaling the other sailor on the \nraft who, having deposited Sandro, Anna and Giulia on the beach, is returning \nto pick up Claudia. He sounds the depths with his oar and then shouts up:\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tOkay. Come ahead, come ahead.\n<b> \n</b>The sailor aboard the yacht goes over to Claudia and says:\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tI'm taking the boat right up to the shore, and\n\t\twe'll let you get off from the gangplank as \n\t\tsoon as we get there.\n<b> \n</b>Then he disappears inside and soon the yacht starts moving towards the shore. \nClaudia peers out over the landscape; the islands are sharply silhouetted \nagainst the sea and sky, the volcano on Stromboli smokes feebly, and in the \ndistance a ship passes by. Claudia is plainly enchanted by the view. Then she \ncollects her thoughts and slowly heads towards the cabin.\n<b> \n</b>\n\n<b>***\n</b>Patrizia, seated at a small table inside the cabin, is busy working on a \ncomplicated jigsaw puzzle, which, once completed, is supposed to represent a \ntypically classical scene. One by one, she selects the various pieces of \ncardboard and inserts them in their rightful places. Simultaneously, she is \nmunching on some crackers spread with jam, and a piece of cold fruit. Beside \nher is Raimondo.  He is staring at Patrizia with such an intense expression \nthat she becomes thoroughly annoyed and says to him, as she continues working \nat her puzzle:\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tWhat do you want, Raimondo? Do you want me? A \n\t\tfew years ago, maybe... but now... And, then, \n\t\tat this hour of the day!\n<b> \n</b>Coming down the steps that lead into the cabin, Claudia overhears the end of \nthe conversation, and decides to withdraw. But Patrizia sees her and calls \nher back.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tCome, Claudia, do come in... There's no \n\t\tromance going on here.\n<b> \n</b>Claudia enters. Raimondo continues to stare at Patrizia, particularly at her \nlegs. Patrizia becomes aware that Raimondo is staring at her, and with a \ncondescending gesture, she lifts her skirt a little higher to make him see \nbetter.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tThere, have you seen enough now? Are you \n\t\tsatisfied?\n<b> \n</b>Raimondo nods yes. Claudia is amused by their behavior but also a little \nsurprised.\n\nPatrizia calmly resumes her game and Raimondo again begins to stare at her. \nThis time, at her breasts. And again Patrizia becomes conscious of the fact \nthat he is staring at her. She assumes a bored attitude and looks up at the \nceiling in a gesture of quiet forbearance. Raimondo reaches out with his hand \nand gently caresses Patrizia's breast. Claudia looks on in amazement. \nRaimondo withdraws his hand.\n<b> \n</b><b>\t\t\t\tPATRIZIA\n</b>\t\t\t(regretfully) \n\t\tNow, tell the truth, aren't you a bit \n\t\tdisappointed?... But I already told you... \n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tIf women's breasts were colored, yours would be \n\t\tblue...\n<b> \n</b>Patrizia laughs at Raimondo's remark and looks at him sympathetically. Then \nshe turns to Claudia.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tTell me, Claudia, what do you think of Raimondo?\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI would say he's pretty depraved. \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tOh no; quite the contrary. He's really just a \n\t\tchild.\n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tPatrizia, don't start in again... I would \n\t\trather be called depraved. Unless you happen to \n\t\tlove children.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tYou know, I don't love anybody. \n\n<b>\t\t\t\tRAIMONDO\n</b>\t\t\t(angrily)\n\t\tI know, dammit, I know! \n\t\t\t(turning to Claudia) \n\t\tAnd just think -- if there ever was a woman so \n\t\tright, so perfectly cut out for all kinds of \n\t\tdissipations, degradations, infidelities... \n\t\tof.. . of... of debaucheries, it's her. Well, \n\t\tanyway, she's faithful. Faithful out of \n\t\tlaziness... of unwillingness.\n<b> \n</b>Raimondo has such a disgruntled look on his face that Patrizia laughs.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tHe amuses me. I don't know of anything more \n\t\tamusing. Outside of this jigsaw puzzle. Don't \n\t\tyou find it so, Claudia?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOne would have to be in love with somebody to \n\t\tknow that.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tHave you ever been in love?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNot really... It's suffocating in here... Shall \n\t\twe go out?\n<b> \n</b>Claudia leaves the cabin and goes up to the deck. Patrizia returns to her \ngame, and Raimondo continues to stare at her.\n<b> \n</b>\n\n<b>***\n</b>Along a narrow strip of beach on the island of Lisca Bianca, Sandro, Anna, \nCorrado and Giulia are waiting for Claudia to come ashore. There are some \npatches of vegetation growing here and there, but by and large the island is \none huge rock with rugged cliffs which descend perpendicularly to the water. \nJutting promontories give the place a sense of raw, primitive beauty. Seeing \nAnna and Sandro climbing a short distance up along the rocks to find a \ncomfortable place where they can lie down and stretch themselves, Corrado \nremarks:\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tIf any of you get into your bathing suits \n\t\tagain, you can be sure we won't be seeing one \n\t\tanother for the rest of the year. I just can't \n\t\tstand seeing anybody in the city after having \n\t\tseen them naked on the beach.\n<b> \n</b>The yacht finally has arrived and the gangplank is laid out between the boat \nand the shore. Claudia descends and as she wades ashore she stops, bends over \nto dip her hand in the water, and with a tone of voice resembling that of a \nmother speaking to its newborn child, she pretends she is speaking with \nsomeone or something in the water.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tOh, how sweet... What a dear little darling!\n<b> \n</b>They all turn around to look at her, wondering to whom or what she is \nreferring.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tWho are you talking to? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tTo the shark.\n<b> \n</b>They all break out into a laugh, and Claudia continues her comic bit as she \nplayfully pretends to lose her balance on the slippery pebbles along the \nshore. Corrado looks at her somewhat surprised, as though up until now he had \nnever seen her comport herself with such a lively sense of humor and wit.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tSay, Claudia, wouldn't you like to climb up \n\t\twith me and take a look over there? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAt what?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tAt the ruins. They're very ancient, you know.\n<b> \n</b>Out of the entire group, Claudia is perhaps the only one who really has the \ndesire to explore, to see, and to generally take advantage of whatever the \ncruise has to offer.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tThat sounds like a good idea. But why don't we \n\t\tall go together?\n<b> \n</b>Though Claudia's suggestion is heard by all, none of them make a move. \nRelaxing so comfortably in the sun as they are, it seems the last thing they \nwould want to do is to climb up the rocky slopes. So Claudia starts to go up \non her own, following Corrado who is already under way. But Giulia \nimmediately comes up to him and, squeezing his arm to emphasize her plea, \nwhispers to him:\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tPlease, I beg of you, stay here.\n<b> \n</b>Giulia's plea is expressed with such a pitiful sense of humility that Claudia \nis immediately taken aback, although she does not fully understand its \nmotive.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\t\t(noticing Claudia's hesitancy)\n\t\tWell? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tWell, what?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tHave you decided?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAll I said was that it sounds like a good idea.\n<b> \n</b>Disappointed and rather irritated, Corrado turns back, while Claudia looks \naround for a place on the rocks where she can comfortably set herself down. \nGiulia, in turn, approaches Corrado.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tWhy didn't you ask me to go with you? \n\n<b>\t\t\t\tCORRADO \n</b>\t\tDo you know why? Because if you saw those ruins \n\t\tI'm sure you would have said they were very, \n\t\tvery beautiful. You always say \"how beautiful\" \n\t\tto everything -- whether it's the sea, or a \n\t\tbaby, or a cat! You have such a sensitive \n\t\tlittle heart that it throbs for anything.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\t\t(ironically)\n\t\tBut Corrado...  If something is beautiful why \n\t\tshouldn't one say so?\n\n<b>\t\t\t\tGIULIA\n</b>\t\t\t(referring to Corrado)\n\t\tHe never misses a chance to humiliate me, to\n\t\tlet me know that he doesn't care about me any \n\t\tmore.\n\n<b>\t\t\t\tCORRADO \n</b>\t\tGiulia, that remark is not worthy of our twelve \n\t\tyears of honest concubinage. I repeat, once and \n\t\tfor all, and publicly, that I admire you. Does \n\t\tthat please you?\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\t\t(under her breath to \n\t\t\t Anna and Sandro)\n\t\tTwelve years ... But why haven't they married?\n<b> \n</b><b>\t\t\t\tSANDRO\n</b>\t\t\t(with a faint smile)\n\t\tAnd why haven't they left each other?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI'm beginning to have my doubts. It couldn't be \n\t\tthat they're in love?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tCould be. They're the kind of people who are \n\t\tcapable of anything.\n<b> \n</b>Sandro suddenly grabs Anna around the waist and pulls her to him. His action \nis so unexpected that even Anna is astonished. But Giulia's voice is heard \nagain.\n<b> \n</b><b>\t\t\t\tGIULIA\n</b>\t\t\t(to Corrado)\n\t\tThe trouble with you is that nobody can speak \n\t\tto you, that's all.\n\n<b>\t\t\t\tSANDRO\n</b>\t\t\t(placatingly)\n\t\tGiulia, don't you understand that the more \n\t\tinvolved you become with people, the more \n\t\tdifficult it is to speak with them? \n\n<b>\t\t\t\tGIULIA \n</b>\t\tYou men are all so dreadful!\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI know we are. But as the years go by, we \n\t\tbecome even worse. Isn't that so, Corrado? \n\n<b>\t\t\t\tCORRADO \n</b>\t\tI hope so.\n<b> \n</b>Breaking the nervous tension that has spread itself throughout the group, a \nseaman appears with a small basket of frozen peaches brought from the yacht. \nClaudia runs to the basket, picks up a peach and quickly bites into it.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHow wonderful!\n\n<b>\t\t\t\tCORRADO \n</b>\t\tThat's Patrizia's way of letting us know she's \n\t\twith us.\n<b> \n</b>Claudia takes another peach from the basket and gives it to Corrado.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI think you're very sweet, Corrado. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tMore so than the shark? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tThere's no comparison.\n\n<b>\t\t\t\tCORRADO \n</b>\t\tThen why don't we go up and see the ruins?\n\n\n\n<b>***\n</b>Anna and Sandro have left the group and are ensconced further up among the \nrocks, on a grassy slope overlooking the beach.\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\tSandro... A month is too long a time. I have \n\t\tbecome used to being without you.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYou'll get over it soon. It's the usual anxiety. \n\n<b>\t\t\t\tANNA \n</b>\t\tA little more so this time.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tSo, it will just take you a little longer to \n\t\tget over it.\n\n<b>\t\t\t\tANNA \n</b>\t\t\t(angrily)\n\t\tBut I think we should talk about it. Or are you \n\t\tfully convinced that we too won't understand \n\t\teach other?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tThere will be plenty of time to talk about it\n\t\tlater.  We'll  get married  soon.  That way \n\t\twe'll have more time...\n\n<b>\t\t\t\tANNA \n</b>\t\tIn this case, getting married means nothing. \n\t\tAren't we already the same as being married? \n\t\tAnd Corrado and Giulia -- aren't they already \n\t\tthe same as being married?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut why rattle your brains by arguing and \n\t\ttalking... Believe me, Anna, words never help \n\t\tat all. They only serve to confuse. I love you, \n\t\tAnna. Isn't I that enough?\n\n<b>\t\t\t\tANNA \n</b>\t\tNo. It's not enough... I told you before that I \n\t\twould like to get away for a while and be alone. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut you just said that a month was too...\n<b> \n</b><b>\t\t\t\tANNA \n</b>\t\t\t(interrupting)\n\t\tI mean, to stay away longer -- two months... a \n\t\tyear... three years... Yes, I know, it sounds \n\t\tabsurd. And I feel awful. The very idea of \n\t\tlosing you makes me want to die... And yet... \n\t\tI... I just don't have the same feeling for you \n\t\tany more. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd what about yesterday... at my house... \n\t\tdidn't you have any feeling for me, even then? \n\n<b>\t\t\t\tANNA \n</b>\t\t\t(angrily)\n\t\tThere you go... Must you always spoil \n\t\teverything!\n<b> \n</b>She turns and walks away in a rage. Sandro breathes a deep sigh, as though \nthe scene had exhausted him, then stretches himself on the ground, his face \nturned skyward, his eyes shut tight.\n<b> \n</b>\n\n<b>***\n</b>The sky over the island of Lisca Bianca is completely filled with clouds. It \nis early afternoon, the atmosphere has darkened, and occasional sounds of \nthunder are heard in the distance.\n\nSandro is asleep with his arms folded under his head. Further below, Claudia, \nCorrado and Giulia are also taking a nap. Gradually, however, with the sound \nof thunder, they become aroused.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tLooks like the weather is changing. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tPlease, Giulia; must you always emphasize the \n\t\tobvious? I can see for myself that the weather \n\t\tis changing.\n<b> \n</b>Corrado rises and looks around lazily, listening to what appears to be the \nsound of a motor boat and which seems to be coming from the other side of the \nisland. Claudia, spotting a sailor approaching, also rises.\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tWe'll have to get going.\n<b> \n</b>Claudia turns around, looks up, and sees Sandro asleep by himself.\n<b>                                 \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tAnd where's Anna? \n\t\t\t(then, turning to the sailor)\n\t\tIsn't she on the yacht?\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tI don't know... you see... we were taking a \n\t\tlittle nap...\n<b> \n</b>\n\n<b>***\n</b>Out on the yacht, Patrizia is completing her puzzle. Only a few pieces are \nmissing but the area to be filled in is a very difficult one. Raimondo, who \nhas grown impatient over Patrizia's long and tedious concentration, exclaims:\n<b> \n</b><b>\t\t\t\tRAIMONDO \n</b>\t\tYou've made some mistake there with the \n\t\tbushes... that's why you can't finish it.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tTake it easy, Raimondo. Why are you getting so \n\t\timpatient?\n<b> \n</b>Claudia's voice is heard, calling out from the shore.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tPatrizia! ...\n<b> \n</b>Patrizia raises her eyes and gives a quick, casual glance at the porthole. \nRaimondo immediately takes the hint that she would like him to get up and see \nwhat Claudia wants. So he goes out to the deck where he sees Claudia calling \nfrom the shore.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tIs Anna there? \n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tI don't think so.\n<b> \n</b>He goes over to the cabin, and looking through the portholes, calls out \nAnna's name. But there is no answer, so he returns to the side of the boat \nand shouts back.\n<b> \n</b><b>\t\t\t\tRAIMONDO \n</b>\t\tShe's not here.\n<b> \n</b>\n\n\n<b>***\n</b>Meanwhile, on the beach, Sandro is also looking for Anna, disturbed and \namazed that she is not in sight.\n<b> \n</b><b>\t\t\t\tSANDRO\n</b>\t\t\t(angrily, to himself)\n\t\tThis is the kind of behavior that drives me \n\t\tcrazy!\n\nDown at the shore, Giulia is getting ready to step on the gangplank and go \naboard the yacht but, anxious about Anna's whereabouts, she changes her mind \nand turns back. Claudia, also deeply concerned, decides to remain and look \naround for herself. She turns and starts climbing up towards the rock in an \nopposite direction than that taken by Sandro, who has now reached the top.\n<b> \n</b>The search is fruitless; there seems to be no trace of Anna. But Sandro \ncontinues to explore the area, stopping every now and then to call out Anna's \nname. Then, looking down over the slope, he notices Claudia, Giulia and \nCorrado coming towards him.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tDid you find her?\n<b> \n</b>None of them answer but it is clear from the worried expressions on their \nfaces that they too have found no trace of Anna. Still they continue the \nsearch, each going off in different directions. Claudia, walking over land \ncovered with large white rocks and clumps of dry brush, spots something \nmoving behind one of the bushes. Anxiously, she starts to walk up closer. \nSuddenly the branches begin to move and a stray lamb emerges. Surprised, but \nalso somewhat relaxed, she turns around and calls out to Corrado, who is \nfollowing her only a short distance away.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tIt's a lamb!\n<b> \n</b>Corrado looks at her without answering, then stops and notices further up \nahead a jumbled pile of rocks which he feels might very well be the ruins he \nhad previously intended to explore. He is about to head towards them but \nsuddenly realizes that Giulia is following directly behind him. He quickly \nchanges his direction in an effort to avoid her.\n\nSandro comes upon a small stone hut that leans up against a high section of \nrock. As he starts to approach it, another stray lamb appears, as if from \nnowhere, and runs off, frightened by Sandro's approach. He tries to open the \ndoor to the hut but finds it locked. As he looks around the area, uncertain \nas to his next move, he sees Claudia and Corrado coming towards him.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tFind anything? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tNo.\n\n<b>\t\t\t\tCORRADO \n</b>\t\tPerhaps she's taking a swim somewhere...\n<b> \n</b>Though no less concerned over Anna's disappearance than any of the others, \nCorrado attempts to lighten the tension by feigning a calm and sensible \nattitude. Taking note of the stone hut before him, he observes it carefully \nand remarks:\n\n<b>\t\t\t\tCORRADO \n</b>\t\tIt's really a fact -- there's nothing new under \n\t\tthe sun. Now, look here. Look at this \n\t\tstructure... a kind of natural shelter. Sandro, \n\t\tthat's how you should design your houses.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tMe?... I no longer have any interest in \n\t\tbuilding... And, then, where can you find \n\t\tboulders of rock like this in Milan?\n<b> \n</b>Claudia comes up close to the hut and tries to peer through the tiny window \nbut inside it is so dark that nothing can be seen. Suddenly, she finds a \nsmall piece of bread on the ledge of the window. She picks it up and starts \nexamining it. Then, realizing the bread is still fairly fresh, exclaims:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSomebody must live here!\n\n<b>\t\t\t\tCORRADO \n</b>\t\t\t(after examining the bread himself)\n\t\tBut Anna wouldn't be staying with the kind of \n\t\tpeople who live here.\n<b> \n</b>The discussion is suddenly interrupted by the arrival of one of the sailors \nwho has come up from the shore.\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tWe had better get started. The storm may \n\t\tbreak any minute now.\n\n<b>\t\t\t\tCLAUDIA\n</b>\t\t\t(angrily)\n\t\tWhat do you mean! What about Anna?\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(to the seaman)\n\t\tTell Lady Patrizia that we can't leave now. In \n\t\tfact, we'll have to make a tour around the \n\t\tisland...\n\n<b>\t\t\t\tSAILOR \n</b>\t\tWouldn't it be better if you told that to the \n\t\tLady yourself. I can't assume the \n\t\tresponsibility for keeping the boat here. \n\t\tThere's no place to tie it up... And then, \n\t\tyou know, it's got a flat bottom, and if the \n\t\tsea gets a little too rough...\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(angrily)\n\t\tThat doesn't make any difference! If we have to \n\t\tstay, we'll stay!\n<b> \n</b>\n\n<b>***\n</b>Aboard the yacht, which is circling the island, Sandro, Patrizia, Raimondo \nand one of the sailors are peering out over the side, scrutinizing the banks \nand rocky slopes in hope of finding some trace of Anna. The jagged cliffs \nappear enormously tall and ominous, harboring tiny grottoes in which someone \ncould easily hide.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tPerhaps she wasn't feeling well... Maybe a \n\t\tcramp or something...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnna is an excellent swimmer. Even with a \n\t\tcramp, she would have managed to reach shore \n\t\tsomehow.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut you have to  consider all possibilities, \n\t\tSandro.\n<b> \n</b>Incensed by her remark, which he considers to be absurd, Sandro moves away \nfrom Patrizia and goes towards the stern of the boat where he notices Corrado \nsignaling to them from a remote section of the beach.\n<b> \n</b><b>\t\t\t\tCORRADO\n</b>\t\t\t(calling out)\n\t\tThere are some footprints around here...\n<b> \n</b>But he stops in the middle of the statement, and throws up his arms to \nindicate that the discovery is really of little significance. So he proceeds \nto climb back up along the pathway from which he descended, and the yacht \ncontinues on its way.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(calling from the stern, excitedly)\n\t\tPatrizia!\n<b> \n</b>Both Patrizia and Raimondo come rushing over to the stern and look towards \nwhere Sandro is pointing at something dark and obscure afloat on the water up \nahead.\n<b> \n</b><b>\t\t\t\tRAIMONDO\n</b>\t\t\t(to the sailor)\n\t\tMario...Steer the boat that way.\n<b> \n</b>The yacht heads in the direction of the black object in the water, but as \nthey come up close, they realize it is nothing more than some wooden piece of \nfurniture. The turn has taken the boat slightly away from Lisca Bianca and \nthey now find themselves closer to the little island of Basiluzzo.\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tShall I turn back?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tNo. Now that we're here, let's have a look \n\t\taround Basiluzzo. \n\t\t\t(then turning to Patrizia) \n\t\tWhen we were swimming, she swam out in that \n\t\tdirection. \n\n<b>\t\t\t\tSAILOR \n</b>\t\tIt won't be easy to find a place to go ashore.\n<b> \n</b>\n\n<b>***\n</b>The first shadows of evening begin to fall over the island of Lisca Bianca. \nThe sky is now even gloomier, streaked with flashes of lightning. Rumbling \nsounds of thunder are heard in the distance. The entire group is once again \nreunited on the beach, and the impending storm has heightened their fears and \nanxiety. They are cold, restless, and exhausted, but profoundly moved and \nshaken by the reality of Anna's strange disappearance.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tLet's try to be practical about this. The best \n\t\tthing to do is for all of you to go to the \n\t\tclosest island that has a police station, or \n\t\tsomething, and report the disappearance. I'll \n\t\tremain here... because... well, I don't know, \n\t\tbut it seems to me that something may turn up. \n\t\tAnyway, I just don't feel like leaving. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tThen let's get started... It's senseless to \n\t\twaste any more time.\n\n<b>\t\t\t\tPATRIZIA\n</b>\t\t\t(to the sailor)\n\t\tHow long will it take to go there and come \n\t\tback?\n\n<b>\t\t\t\tSAILOR \n</b>\t\tIf there's a police station at Panarea, it \n\t\tshould take us a couple of hours. But if we \n\t\thave to go to Lipari, it will take much longer. \n\t\tThen it also depends on how rough the sea is.\n<b> \n</b>Giulia is about to get on her way but she stops and turns around to look for \nCorrado, who notices her looking at him.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tI'll stay here also.\n<b> \n</b><b>\t\t\t\tGIULIA\n</b>\t\t\t(alarmed)\n\t\tBut why?... What if it starts to rain? \n\n<b>\t\t\t\tCORRADO \n</b>\t\tIf it rains, I'll buy myself an umbrella.\n<b> \n</b>Claudia, who has remained to one side, wrapped up in her own thoughts, \ndoesn't make a move to leave. Sandro and Corrado look at her in surprise.\n\n<b>\t\t\t\tCORRADO \n</b>\t\t\t(to Claudia, understandingly)\n\t\tClaudia, I know how you feel, but there are \n\t\talready two of us staying... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI'll go even further and say that her presence \n\t\there -- I don't want to sound offensive -- could \n\t\tbe a great hindrance.\n<b> \n</b>Ignoring Sandro's remark, Claudia turns and determinedly heads towards the \ninterior of the island. Meanwhile, Patrizia and Giulia have gone aboard the \nyacht.\n<b> \n</b><b>\t\t\t\tGIULIA\n</b>\t\t\t(calling to Corrado \n\t\t\t from the boat)\n\t\tDo you want some blankets? ... and something \n\t\tto eat?\n<b> \n</b>Corrado makes an irritated gesture signifying no, then together with Sandro \nstarts climbing up the rocky slope towards the stone hut. As they meet up \nwith Claudia midway, the first drops of rain start to fall and it is clear \nthat the storm is on the verge of breaking. The three of them reach the door \nof the hut and Corrado tries to pull it open, but the lock resists. Then \nSandro comes to his aid, and placing their shoulders up against the wooden \ndoor, they finally manage to force it open.\n\n\n<b>***\n</b>Inside the hut it is pitch black. Sandro strikes a match and finds a kerosene \nlamp on a nearby table. He lights it and the room is suddenly illuminated, \nrevealing a miserable interior with a few broken chairs, several empty boxes, \na shovel and a few other utensils. Over to one side is a small pile of straw \nsuggesting a makeshift bed.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tAs far as I'm concerned, I think she's alive... \n\t\tWhy, even this morning... that business about \n\t\tthe shark... it wasn't at all true.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd why do you tell us this only now?\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI... I don't know... I didn't think it was \n\t\tworthwhile... She was laughing over it... \n\n<b>\t\t\t\tCORRADO \n</b>\t\tReally! Still, it remains to be seen why she \n\t\tinvented a shark. What was her purpose in that? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\t\t(indicating Sandro)\n\t\tMaybe you'd better ask him.\n\n<b>\t\t\t\tCORRADO\n</b>\t\t\t(to Sandro)\n\t\tWhat were you and Anna arguing about?... \n\t\tExcuse me for being so indiscreet, but this is \n\t\tserious...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tNothing but the usual argument... The only \n\t\tthing was -- if I remember correctly -- that \n\t\tshe said she had a need to be alone.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAnd how do you explain that?\n<b> \n</b>Ignoring the question, Sandro begins pacing back and forth across the room. \nThe silence is broken only by the sound of the rain outside which is now \ncoming down harder and harder. Suddenly, footsteps are heard approaching the \nhut. Sandro, Claudia and Corrado quickly turn around and face the door, their \nfaces clearly revealing the expectation that it might be Anna. Finally the \ndoor begins to open and an old man appears, carrying a sack in his hand.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAre you the owner of this place? \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tNo. The owners are in Australia. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut where did you come from? \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tFrom Panarea. Why?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tAh, then it was you... I heard a boat leaving \n\t\there at two o'clock today...\n\n<b>\t\t\t\tOLD MAN \n</b>\t\t\t(scratching his head)\n\t\tIt must have been around four or five... \n\n<b>\t\t\t\tCORRADO \n</b>\t\tIn the afternoon?\n<b> \n</b><b>\t\t\t\tOLD MAN \n</b>\t\tNo... in the morning. Why? What's happened?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tNothing... nothing at all!\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tBut why don't you tell him? \n\t\t\t(then turning to the old man) \n\t\tA girl who was with us has disappeared. \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tWhat do you mean... disappeared?  Was she \n\t\tdrowned?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo, she didn't drown... She just disappeared, \n\t\tand nobody knows where.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAnd I suppose it's my fault... Why don't you \n\t\ttell him that too. That's what you believe, \n\t\tisn't it? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tRather than being so occupied with my thoughts, \n\t\tyou would have been better off trying to \n\t\tunderstand what Anna was thinking.\n\n<b>\t\t\t\tOLD MAN \n</b>\t\tHave you searched in back of the house to see \n\t\tif she might have fallen off that cliff? Last \n\t\tmonth that's what happened to one of my \n\t\tsheep... I looked all over for it all day long \n\t\tand it wasn't until late at night that I heard \n\t\tit bleating... It had been there the whole \n\t\tday... and was almost dead.\n<b> \n</b>Claudia suddenly jumps up and runs out of the hut and into the dark, calling \nout desperately.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tAnna! . . . Anna!\n<b> \n</b>But her cries are lost in the sound of the storm. Drenched by the rain, her \nshoes full of mud, her dress soaked, she stops, as Corrado, who had followed \nafter her, grabs hold of her arm and leads her back to the hut.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tCome, Claudia...come back inside.\n<b> \n</b>\n\n<b>***\n</b>It is early morning inside the hut, and the flame of the kerosene lamp has \ndwindled down to a tiny, flickering light. Claudia awakens with a bewildered \nlook upon her face, wondering where she is and how she comes to be there. She \nnotices Corrado dozing on an empty box in a corner of the room, then \nrealizing that Sandro and the old man are no longer there, she gets up and \ngoes out the door.\n\nOutside, everything is covered by a thick haze, which is gradually beginning \nto lift. Sandro, who is standing a short distance away from the hut, hears \nClaudia approaching and turns around to greet her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAre you feeling better?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\t\t(nodding yes)\n\t\tI'm sorry about last night. Please forgive me.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYou're very fond of Anna, aren't you?\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tYes, very much so.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tHas she ever spoken to you about me? \n<b>\t\n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tOccasionally, but always with affection. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd yet, she seemed to feel that our love for \n\t\ther -- mine, yours, even her father's, in a \n\t\tcertain sense -- weren't enough for her, or \n\t\tdidn't mean much to her. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI know. I keep asking myself what I could have \n\t\tdone to prevent all this from happening.\n<b> \n</b>There is a pause, then suddenly they both hear the sound of a motor growing \nlouder and louder. They look out over the shore but the haze is so heavy that \nit is impossible for them to determine the source. Then, seeing the old man \ncoming up the path, Sandro impulsively runs towards him and seizes him by the \ncollar.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWhose boat is that? \n\n<b>\t\t\t\tOLD MAN\n</b>\t\t\t(astonished)\n\t\tWhat boat?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tJust a moment ago... didn't you hear the sound \n\t\tof a motor?\n\n<b>\t\t\t\tOLD MAN \n</b>\t\tAt this time of the year there are so many \n\t\tboats...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd how come you're up so early? \n\n<b>\t\t\t\tOLD MAN \n</b>\t\tEarly? Is four in the morning early for you?\n<b> \n</b>Sandro is visibly deflated by the old man's casualness, and he decides to \nabandon his questioning. He turns away from him and looks up to see Claudia \nwalking slowly towards the top of the cliffs, directly behind the hut where \nthe night before the old man had said Anna might have fallen. She looks down \nover the side and quickly withdraws, almost in fear of being sucked down into \nthe swirling waters below. She turns away and starts walking towards the \ninterior part of the island. In the rocky hollows around her, she notices \nsmall accumulations of yesterday's rain and, scooping up some of the water \nfrom one of these rocks, she rinses her face. As she gets up again, Sandro is \nthere, standing directly before her. Claudia is almost startled. They \ncontinue to gaze at one another in silence. Then Claudia abruptly turns away \nand heads towards a higher point of land. A moment later, Sandro joins her \nagain and once more they find themselves staring into each other's eyes, \nalmost embarrassed by their own behavior, yet unable to control it.\n\nThe wailing siren of a police boat resounds through the air like a shrill \nlament. Only then do Sandro and Claudia detach themselves from their trance-\nlike state, from the sudden compulsion of being drawn towards each other. \nThrough the haze, they notice a landing taking place down at the shore. \nRealizing it is their friends returning with the police, they both start \ndescending the slope to greet them.\n\nStepping ashore are Patrizia, Giulia and Raimondo, followed by a Marshal of \nthe carabinieri and two police agents. As Sandro and Claudia come rushing \ndown over the rocks, Claudia suddenly stops and lags behind so as not to \narrive on the beach simultaneously with Sandro.\n\nMeanwhile, Corrado has already gone down to the shore and as he goes out to \nmeet them, Patrizia, Giulia and Raimondo anxiously look to him as though \nexpecting some good news. But Corrado remains silent, then throws out his \narms in a gesture of despair.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tHow did you spend the night?... In that hut?...\n\t\tAnd what did you have to eat? \n\n<b>\t\t\t\tCORRADO \n</b>\t\tWhat do you think?\n\n<b>\t\t\t\tGIULIA \n</b>\t\tWe, too, you know. It was disastrous. First at \n\t\tPanarea, where there weren't any boats... then \n\t\tat Lipari, where everybody was asleep... And \n\t\tthe phone call to Rome...\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tWe had to notify her father. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tYes, that was a very good idea.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tHe'll be here sometime today. \n\t\t\t(then turning to Sandro who \n\t\t\t has just arrived on the scene) \n\t\tI also phoned my house in Milan... but Ettore \n\t\thad already left.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\t\t(to Sandro) \n\t\tAnything new develop? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tUnfortunately, no.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tVery well. First of all, I'll have them search \n\t\tthe waters around the island. I brought two \n\t\tfrogmen with me... Meanwhile, we'll take a look \n\t\tup around here.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tLook, Marshal, with those deep crevasses, \n\t\tyou'll need some rope and ladders... \n\n<b>\t\t\t\tMARSHAL\n</b>\t\tDon't worry, we've got everything. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnother thing; there's an old man who lives \n\t\there on the island...\n\n<b>\t\t\t\tMARSHAL\n</b>\t\t\t(interrupting)\n\t\tI know, I know. One thing at a time.\n<b>  \n</b>The Marshal starts climbing up towards the interior of the island, with \nSandro following behind. As Claudia sees them coming in her direction, she \nmoves away to a lower section of the island to avoid coming in contact with \nSandro. Peering over a precipice, she sees the frogmen below, and watches \nthem slide into the clear water like two enormous fish.\n\nSandro and the Marshal have arrived on the edge of the same precipice, where \ntwo men are lowering a rope ladder into the depths. Moving up further to \nwatch the operations, Sandro becomes aware of Claudia standing alone just a \nshort distance away. He heads towards her but she tries to avoid looking at \nhim. Sandro, however, is unable to take his eyes from her and continues \nwalking in her direction. But seeing Patrizia and Raimondo approaching, he \nsuddenly stops. A small stone, accidentally loosened from the ground, rolls \nalong the path and comes to a halt directly in front of Claudia, almost like \na message. She picks it up, looks at it, then throws it away. Sandro moves \naway and heads back to the edge of the precipice.\n\nPatrizia and Raimondo join Claudia. Raimondo, who is carrying a box of \ncrackers in his hand, offers them to both Claudia and Patrizia.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tNo, who wants crackers... Why don't you go and \n\t\thave some coffee made instead?\n\nMeanwhile, Sandro has arrived at the edge of the precipice where he finds \nGiulia and Corrado. They are looking down at one of the carabinieri who is \ndangling from a long rope over the side of the rock, exploring the crevasses \nwhere a body might have fallen from the precipice above. The Marshal leans \nover to see if anything has been discovered.\n<b> \n</b><b>\t\t\t\tCARABINIERE\n</b>\t\t\t(calling up to the Marshal)\n\t\tNothing here!\n<b> \n</b>The Marshal turns around in disgust and looks at Corrado who is frankly sick \nand tired of the whole operation.\n<b> \n</b><b>\t\t\t\tCORRADO\n</b>\t\tDon't look at me like that, Marshal...  I had \n\t\tnothing to do with it.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\t\t(referring to the frogmen below)\n\t\tLet's hope they don't find her... If they do, \n\t\tthey would find her dead.\n<b> \n</b>All of a sudden, Claudia breaks out into tears. Patrizia doesn't say a word. \nShe just lets Claudia cry, knowing it will do her good. Sandro comes over and \nas soon as Claudia sees him there, she stops crying, and avoids looking up at \nhim.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tListen, Patrizia... The Marshal says there's a \n\t\tcurrent that passes by here and ends up at \n\t\tanother island... I don't know which... He \n\t\twants to send one of his men over to have a \n\t\tlook... One never knows... Do you mind if I ask \n\t\tRaimondo to go with him? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tI don't see why I should mind.\n\n<b>\t\t\t\tCLAUDIA\n</b>\t\t\t(to Sandro)\n\t\tI think that you might go and have a look \n\t\tyourself.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes, maybe that is better.\n<b> \n</b>He turns and starts heading down towards the beach.\n<b> \n</b><b>\t\t\t\tPATRIZIA\n</b>\t\t\t(to Claudia)\n\t\tWhat amazes me, is Sandro. He seems so calm.\n\n<b>\t\t\t\tCLAUDIA\n</b>\t\t\t(rising)\n\t\tCalm?... He doesn't seem so to me... He was \n\t\tawake all night.\n<b> \n</b>One of the frogmen emerges with an ancient vase in his hand, evidently found \nin the depths below. Raimondo, who has just arrived with a thermos of hot \ncoffee, puts it down and goes over to the frogman to fetch the vase.\n<b> \n</b><b>\t\t\t\tRAIMONDO\n</b>\t\t\t(to the frogman)\n\t\tWhat is it?\n\n<b>\t\t\t\tFROGMAN\n</b>\t\tAn ancient vase. There's a buried city under \n\t\there. It's full of this stuff.\n<b> \n</b>Raimondo takes the vase and shows it to Patrizia and Claudia. It is an \nextremely beautiful amphora, in terra cotta, with a figured design around it. \nPatrizia and Claudia momentarily drop their thoughts to examine it. Then \nCorrado, who had observed the scene, comes over, followed immediately by \nGiulia.\n<b> \n</b><b>\t\t\t\tPATRIZIA\n</b>\t\t\t(ironically)\n\t\tCome on, Corrado, tell us what century it \n\t\tbelongs to.\n<b> \n</b>Corrado smiles, then comes closer to examine it. Claudia also kneels down to \nlook at it. A moment later she feels a presence at her side, and even without \nturning around she knows it is Sandro. Taking advantage of the discovery that \nwas made, he purposely has returned to join the group in order to be near \nClaudia. They both now feel between them the warmth of that contact, and for \na brief moment, succumb once again to that sudden sense of wonderment which \nthey already had experienced at dawn.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tCorrado, why don't you ask them to give it to \n\t\tus as a gift?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tReally! So that you can stuff it with your \n\t\tgeraniums.\n\n<b>\t\t\t\tPATRIZIA\n</b>\t\t\t(to Sandro)\n\t\tBut aren't you supposed to be on your way?\n<b> \n</b>Claudia, stricken with dismay, immediately detaches herself from Sandro, who \nreplies with a certain sense of embarrassment.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tYes... I'm going... I'm going now.\n\n\n<b> \n</b><b>***\n</b>A patrol boat is anchored off the cliff of a small island where the current \nrunning through the surrounding waters comes to an end. Sandro is leaning \nagainst the wall of a dilapidated building, which is constructed right on \nthat part of the rock where the sea close by discharges all kinds of refuse. \nFour or five islanders are busy scouring through the accumulated rubbish. \nThey are taciturn, poorly dressed people who every now and then come to blows \nover the possession of some article washed ashore by the waves. Sandro is \nwatching them, feeling distraught and melancholy. One of the carabinieri who \nhad accompanied him is walking up and down beside an elderly gentleman who is \nobviously one of the local gentry.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(to the carabiniere)\n\t\tIt's already two hours... What are we going to \n\t\tdo?\n\n<b>\t\t\t\tCARABINIERE\n</b>\t\tIt takes about twenty to twenty-two hours for \n\t\tthe current to reach here from Lisca Bianca. \n\n<b>\t\t\t\tELDERLY GENTLEMAN\n</b>\t\tAnd sometimes even twenty-four... depending on \n\t\tthe wind...\n\n<b>\t\t\t\tCARABINIERE\n</b> \t\tIf the girl disappeared yesterday afternoon, \n\t\twe'll have to wait at least until three or four \n\t\to'clock.\n<b> \n</b>Sandro looks at them without commenting, then turns and walks away towards \nthe center of the village. The houses and shops around the square are very \nplain and shabby. Sandro spots a barber shop and, fingering his day-old \nbeard, enters for a shave.\n\nShortly thereafter, a clamor of voices is heard outside and Sandro comes \ndashing out of the shop. Seeing the islanders fighting and arguing about \nsomething drawn up from the sea, he runs over to find out what it is.  As he\narrives on the scene, two policemen step out of the confusion dragging a \nlarge crate, which they carry over to the door of a nearby shack, amid the \nprotests of the islanders who are still arguing and shouting among \nthemselves.\n<b> \n</b><b>\t\t\t\tVOICES\n</b>\t\tIt belongs to me... We found it... \n\n<b>\t\t\t\tGENTLEMAN\n</b>\t\tBack... Stand back!\n<b> \n</b>The two policemen set the crate down and lift the lid. It is full of \ncigarettes.\n<b> \n</b><b>\t\t\t\tCARABINIERE\n</b>\t\t\t(to the islanders)\n\t\tYou see? It contains cigarettes. We'll have to \n\t\tconfiscate it.\n<b> \n</b>The islanders react violently, shouting out all sorts of epithets. But the \npolicemen manage to restrain them and soon the commotion is quieted down.\n<b> \n</b><b>\t\t\t\tCARABINIERE\n</b>\t\t\t(to Sandro)\n\t\tThese people are contemptible. They have no \n\t\tsense of dignity at all.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(referring to the crate)\n\t\tAnd you say that came from Lisca Bianca?\n\n<b>\t\t\t\tCARABINIERE\n</b>\t\tIt couldn't have come from anywhere else. At \n\t\tleast, somewhere from that vicinity... But I \n\t\treally can't understand it. Contraband \n\t\tcigarettes on that island! It's the first time \n\t\tthat ever happened.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tLook... I'd like to get back to Lisca Bianca. \n\n<b>\t\t\t\tCARABINIERE\n</b>\t\tBut how could we...at a time like this when we \n\t\tjust... well, let's at least first have a look\n\t\taround the other islands. Could be that \n\t\tsomething might turn up there.\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(impatiently)\n\t\tBut even here we were supposed to find who \n\t\tknows what... And all we bring back with us is \n\t\ta crate of cigarettes.\n\n<b>\t\t\t\tCARABINIERE\n</b>\t\t\t(shrugging his shoulders)\n\t\tAs you wish.\n<b> \n</b>\n\n<b>***\n</b>At Lisca Bianca, a helicopter is hovering above the island and preparing to \nland. Waiting for it to descend are Claudia, the old man, the Marshal and \nAnna's father, just arrived from the mainland.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\t\t (to the old man)\n\t\t... Is it also true that you saw no boat around\n\t\there at Lisca between yesterday and this \n\t\tmorning?\n\n<b>\t\t\t\tOLD MAN\n</b>\t\tHow many times do I have to tell you, Marshal, \n\t\tthat I was at Panarea.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tI believe you, I believe you... But I'm also \n\t\tcertain that you're hiding something from me. I \n\t\tcan see it written all over your face... And \n\t\tyou know that I have never liked your face. And \n\t\tif you want to know something, that gentleman \n\t\tover there...\n\t\t\t(indicating Anna's father)\n\t\t...who's a very important person... doesn't \n\t\tlike it either. So, just keep that in mind. \n\t\tI'll talk to you later.\n<b> \n</b>The Marshal moves away from the old man and goes over towards Anna's father \nwho is watching the helicopter come down.\n<b> \n</b><b>\t\t\t\tANNA'S FATHER  \n</b>\t\tI presume by this method that you'll be able to \n\t\tuncover some new clue, either a handkerchief or \n\t\tan article of clothing... In other words, \n\t\tsomething which your men have not been able to \n\t\tfind as yet. \n\n<b>\t\t\t\tMARSHAL\n</b>\t\tWithout any doubt, sir. If anything belonging \n\t\tto the girl who has run away is still here on \n\t\tthis island...\n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\t\t(resentfully)\n\t\tAllow me to inform you that my daughter is not \n\t\ta fugitive.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tI'm sorry, sir. I didn't mean to put it that \n\t\tway. But, you must understand, sir, that I...\n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\tI understand very well. Only I don't want any \n\t\trash assumptions to be made.\n<b> \n</b>One of the carabinieri appears with Anna's valise which he sets down on the \nground.\n<b> \n</b><b>\t\t\t\tMARSHAL\n</b>\t\tHere's her valise, sir.\n<b> \n</b>The helicopter is now a few feet above the ground, and everyone steps aside \nto allow it room to land. The rush of wind from the propeller sends up a \ncloud of dust, and finally the helicopter touches down. The propeller stops, \nthe door opens, and out comes two large bloodhounds accompanied by a police \nattendant. He immediately says something to the dogs in German which suddenly \ncreates an atmosphere of resentment among the group assembled there.\n\nAnna's father goes to his daughter's valise, bends down, but doesn't dare to \ntouch it.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tDo you want me to open it? \n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\tYes, please.\n<b> \n</b>Claudia opens the valise and starts pulling out several dresses, a few \nintimate garments, and several other items of clothing. As she continues \nrummaging, she suddenly comes upon two books, Fitzgerald's Tender Is The \nNight and a copy of the Bible, which she hands to Anna's father who, in turn, \nexamines them with great care and deliberation.\n<b> \n</b><b>\t\t\t\tANNA'S FATHER  \n</b>\t\tThis looks to me like a good sign. Don't you \n\t\tthink so? As far as I'm concerned, anyone who \n\t\treads the Bible could not have committed an act \n\t\tof impropriety. Why... as a matter of fact, I \n\t\tremember when I was in China, many years ago, I \n\t\thappened to be involved in a similar situation, \n\t\tconcerning an English woman, the wife of \n\t\tAmbassador Shafford, a good friend of mine. \n\t\tThere, too, we found a Bible... And I said at \n\t\tthe time that whatever had happened, that clue \n\t\talone had definitely ruled out the possibility \n\t\tof... suicide. Why, it was logical, I said, \n\t\tthat whoever reads the Bible believes in God \n\t\tand therefore...\n\t\t\t(then, turning to Claudia in an \n\t\t\t almost supplicating tone of voice) \n\t\tNo? You don't believe it? Well, as a matter of \n\t\tfact, I was right... The woman was found two \n\t\tdays later. It was a case of amnesia.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tSir, if you have no objections, may we start \n\t\tthe search?\n<b> \n</b>Anna's father turns around to look at the bloodhounds who are already \nsniffing the air for a scent and anxious to get on with the hunt. Then he \nthrows a quick glance at his daughter's valise once more, and with an air of \ndisgust and irritation, walks off in a huff, followed by Claudia.\n<b> \n</b>\n<b>\t\t\t\tATTENDANT\n</b>\t\t\t(to the Marshal)\n\t\tGet everybody out of the way...\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tOkay. I'll send them down to that part of the \n\t\tbeach over there...\n<b> \n</b>After they all have left the area, the attendant leads the two bloodhounds \nover to Anna's valise, instructs them to pick up the scent, then takes them \nup to the very top of the island, where he subsequently unties them from his \nleash and sets them off.\n\nClaudia and Anna's father arrive on the beach where Patrizia, Giulia, \nCorrado, Raimondo and one of the sailors are seated on a pile of rocks.\n\nAs the dogs begin running in different directions over the island, trying to \ntrack down the scent from Anna's valise, the entire group remains silent, \nawaiting the outcome of the search. Suddenly, the bloodhounds come racing \ndown the slope, heading directly towards the beach where they are gathered, \napparently hot on the trail of some familiar scent. To everybody's amazement, \nthe dogs stop in front of Claudia, jumping excitedly and barking at her as \nthough they had found their prey. Claudia is nonplussed and almost petrified \nwith fear. She turns around and sees the others all staring at her. But she \ncannot understand why they are looking at her that way nor why the dogs have \nstopped right in front of her. Then, as if struck by a sudden flash of \nmemory, she touches her dress and cries out:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tIt's because of this... The dress... It's \n\t\tbecause of this dress. Anna gave it to me \n\t\tyesterday, right after the swim.\n<b> \n</b>Completely relieved, Claudia smiles and bends over to pet the dogs, as the \nattendant comes up to them and ties the leash back on to their necks. Then he \nleads them away and heads once again upthe slope towards the top of the \nisland. Anna's father seems almost disillusioned by the negative results of \nthe search. Corrado also feels dissatisfied, and addressing himself to the \nMarshal, says:\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tAnd what are we going to do now? \n\n<b>\t\t\t\tMARSHAL\n</b>\t\tWe'll try again.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut is it really necessary? Those two \n\t\tbeasts... How absurd!\n<b> \n</b>Meanwhile, the patrol boat has returned and is pulling ashore. Giulia is the \nfirst one to notice its arrival and she calls out to the others that Sandro \nis back. Then she goes over to where Anna's father is standing.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tSandro's here.\n\n<b>\t\t\t\tANNA'S FATHER \n</b>\t\t\t(coldly)\n\t\tI don't know him. \n\n<b>\t\t\t\tGIULIA \n</b>\t\tIt seems to me that at a moment like this... \n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\tI don't want to know him.\n<b>  \n</b>By this time, Sandro has come ashore, followed by the carabiniere, and \nimmediately goes up to Claudia.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tClaudia, listen ... Claudia.\n<b> \n</b>But Claudia hardly looks at him, and seeing Corrado approaching, she moves \naway from Sandro. \n\n<b>\t\t\t\tCORRADO \n</b>\t\t\t(to Sandro)\n\t\tI didn't think you'd be back so early.\n\n<b>\t\t\t\tCARABINIERE\n</b>\t\t\t(interrupting)\n\t\tWe didn't check the other islands, so...\n\n<b>\t\t\t\tCORRADO \n</b>\t\tAnd why didn't you go there?\n\n<b>\t\t\t\tCARABINIERE\n</b>\t\t\t(referring to Sandro)\n\t\tHe wanted to come back.\n<b> \n</b>The sailors have unloaded the crate of cigarettes from the patrol boat and \nthe Marshal is getting all the details from the carabiniere.\n<b> \n</b><b>\t\t\t\tMARSHAL\n</b>\t\tUp until now those smugglers were operating \n\t\tonly around the Palermo area. This will be a \n\t\tnice surprise for the Lieutenant in Milazzo... \n\t\tCall up headquarters. Bring them up to date and \n\t\thave them give you instructions on what to do \n\t\twith this crate.\n\n<b>\t\t\t\tCORRADO \n</b>\t\tSo... the boat we saw yesterday afternoon might \n\t\thave also been that of these smugglers. Could it \n\t\tbe possible, then, that Anna...?\n\n<b>\t\t\t\tMARSHAL\n</b>\t\t\t(evading Corrado's question \n\t\t\t and pursuing his own thoughts)\n\t\tI wonder where they could have unloaded the \n\t\tstuff ... Maybe right here at Lisca. \n\n<b>\t\t\t\tCORRADO \n</b>\t\tI was saying... it might even be possible that \n\t\tAnna had left with them.\n\n<b>\t\t\t\tMARSHAL\n</b>\t\tBut for what reason would she have wanted to go \n\t\taway?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tListen, Marshal... As for there being reasons \n\t\tfor going away, anyone of us might have three \n\t\tthousand of them. So you can assume that she \n\t\thad them. What I want to know, is it possible \n\t\tthat the smugglers might have taken her aboard? \n\n<b>\t\t\t\tMARSHAL\n</b>\t\tI think it's possible.\n\n<b>\t\t\t\tA SAILOR \n</b>\t\t\t(calling from the patrol boat)\n\t\tMarshal!... Headquarters is calling. They have \n\t\tan important message.\n<b> \n</b><b>\t\t\t\tMARSHAL\n</b>\t\tWhat is it about?\n\n<b>\t\t\t\tSAILOR \n</b>\t\tThey've stopped a suspicious-looking boat a \n\t\tfew miles from here... yesterday afternoon. The \n\t\tcrew has been taken to Milazzo for questioning.\n<b> \n</b>The Marshal takes off for the patrol boat, and Corrado goes over to Anna's \nfather.\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tDid you hear that? What do you plan on doing?\n\n<b>\t\t\t\tANNA'S FATHER \n</b>\t\t\t(resignedly) \n\t\tWe are in the hands of God. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tThat's true...But in the meantime, as far as \n\t\tI'm concerned, it's absolutely necessary to go \n\t\tto Milazzo. \n\t\t\t(directly to Anna's father)\n\t\tI know that you have no desire to meet me, and \n\t\tI shall take pains not to impose myself upon \n\t\tyou. But, besides you, I am the closest person \n\t\tto your daughter...\n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\tHowever that may be, at this moment my daughter \n\t\thas more need of her father than of you. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tPardon me for being so frank, but there are \n\t\tcertain things that a father -- especially a \n\t\tfather like you --cannot understand. So don't \n\t\tbe stubborn. I'm coming with you.\n<b> \n</b>As soon as he finishes saying this, Sandro turns around and looks at Claudia, \nas though he had just now realized that she was there listening to him. \nClaudia goes to the gangplank and boards the yacht, disappearing into the \ncabin. Having followed her with his gaze, Sandro then turns to Patrizia.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tPatrizia, what are you going to do? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tWhat do you want us to do? I don't know \n\t\tmyself... But we'll do something. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI'll go and get my valise.\n<b> \n</b>Sandro goes aboard the yacht and enters the cabin. On the way to his room he \nmeets Claudia who has just changed clothes and is about to return ashore. \nThey stare at each other for a moment without saying anything. But the \nintensity in Claudia's look, mixed with fear and desire, is so overpowering \nthat Sandro takes her in his arms and kisses her. Claudia immediately \nreleases herself from his embrace, but for the moment it lasted, the kiss was \nfull and  passionate.  Then she turns and goes out on deck. Sandro remains \nthere, momentarily stunned, then picks up his valise and returns ashore.\n\nAs Claudia, followed by Sandro, steps back on the beach, she is met by \nPatrizia.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tWe've decided to go to Montaldo's place. In \n\t\tfact, Ettore should already be there.\n\n<b>\t\t\t\tSANDRO \n</b> \t\t\t(intervening)\n\t\tGood. Then I'll meet you there.\n<b> \n</b>He says this primarily for Claudia's sake, hoping to catch her eye. But she \nkeeps her head bowed low, and doesn't look up. After a moment of hesitation, \nSandro turns away and heads towards the small motorboat in which Anna's \nfather arrived from the mainland. And without saying another word, he climbs \naboard. Patrizia places her arm around Claudia's waist and together they \nstart walking towards the yacht. But upon reaching the foot of the gangplank, \nClaudia stops.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI'm going with the patrol boat to make a tour \n\t\taround the islands. \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tTo do what?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI just can't leave without first searching \n\t\tthose islands, one by one.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut aren't you tired? I can just about manage \n\t\tto stand on my feet! \n\t\t\t(then turning around to look \n\t\t\t for Raimondo, she calls out) \n\t\tRaimondo! \n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tHere I am, Patrizia. I'm always here. \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tClaudia isn't coming with us. Will you please \n\t\ttake care of her luggage? Thanks.\n<b> \n</b>Raimondo goes aboard the yacht and returns with Claudia's valise. He consigns \nit to one of the carabinieri who, in turn, takes it aboard the patrol boat. \nClaudia follows him aboard. The Marshal comes out of the radio room, steps \nashore, then joins Sandro and Anna's father on the motorboat, while Patrizia, \nGiulia, Corrado and Raimondo go aboard the yacht.\n\n\n<b> \n</b><b>***\n</b>In the seaport town of Milazzo, on the Sicilian mainland, Sandro and Anna's \nfather are seated in an office at police headquarters.  The sailors picked up \non a charge of carrying contraband are being questioned by the police \nLieutenant.\n<b> \n</b><b>\t\t\t\tSAILOR \n</b>\t\tNo, sir, Lieutenant, we weren't even able to \n\t\tdrop anchor once ... the sea was too rough.\n<b> \n</b>The Lieutenant motions for the sailor to come up to the desk, then points to \na sheet of paper in front of him.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tOkay. Just sign here. \n\t\t\t(turning to a guard \n\t\t\t standing at the door) \n\t\tHave the next one come in. He's the last, \n\t\tisn't he?\n<b> \n</b>Another sailor enters and timidly approaches the Lieutenant's desk. He is \nrather young, and his face is completely bronzed by the sun.\n<b>  \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tThey tell me you have a lot of trouble at home. \n\t\tIs that right?\n<b> \n</b><b>\t\t\t\tYOUNG SAILOR \n</b>\t\tYes, sir. My sister is sick... and my \n\t\tfather, too.\n\n<b>\t\t\t\tLIEUTENANT\n</b>\t\tSo that's why you've turned to smuggling, eh? \n\t\tYou need the money. Now, I can help you. I can \n\t\tsee that you get some assistance from the \n\t\tgovernment. But first there's a little \n\t\tformality we've got to take care of. Just a \n\t\tfew questions and then we can all go to \n\t\tlunch... Your friend tells me you dropped \n\t\tanchor three times...\n<b> \n</b>The sailor starts, as though taken by surprise, then quickly answers.\n<b> \n</b><b>\t\t\t\tYOUNG SAILOR \n</b>\t\tYes, sir. Three times.\n\n<b>\t\t\t\tLIEUTENANT\n</b>\t\t\t(to Sandro and Anna's father)\n\t\tNow, we're getting somewhere! They're beginning \n\t\tto contradict each other. \n\t\t\t(then, facing the sailor again) \n\t\tNow look here, your friend just swore to me \n\t\tthat you weren't able to do any fishing at all \n\t\tbecause the sea was too rough... And what about \n\t\tthe other boat? \n\n<b>\t\t\t\tYOUNG SAILOR \n</b>\t\tWhat other boat?\n\n<b>\t\t\t\tLIEUTENANT\n</b>\t\tNow look, my men saw it and they also saw you \n\t\tmen throwing those crates overboard. What have \n\t\tyou got to say about that?\n\n<b>\t\t\t\tYOUNG SAILOR \n</b>\t\t\t(stuttering) \n\t\tI ... I ... wasn't feeling well ... I.. I was \n\t\tsleeping... I don't know anything ... I ... \n\t\tI'm all mixed up and ...\n<b> \n</b>Sandro is unable to control himself any longer. He gets up, walks over to the \nsailor and yells in his face.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tBut what are you saying?... What are you \n\t\tsaying?\n<b> \n</b>The Lieutenant motions to Sandro to be quiet, then calmly rises from his desk \nand continues.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tNow look here, I'm ready to forget the whole \n\t\tthing: the cigarettes, the contraband --\n\t\teverything. If you would only tell me... you or \n\t\tyour friends... whether the girl was aboard \n\t\tyour boat and how far she went.\n<b> \n</b>They all remain silent. The Lieutenant motions to the guard who then leads \nthe sailors out of the office.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\t\t(to Anna's father)\n\t\tJust as I thought. Even if you caught them in \n\t\tthe act, they'd deny it. They always deny \n\t\teverything. And then, in this case, if they \n\t\twere to admit having had the girl aboard, it \n\t\twould mean they'd be admitting to the charge \n\t\tof carrying contraband. Oh, it's easy to say: \n\t\ttalk! But if they did talk, the following \n\t\tmorning you'd find them cold dead in front of \n\t\ttheir doorstep.\n\n<b>\t\t\t\tANNA'S FATHER  \n</b>\t\tI think it would be worth my while to take a \n\t\trun over to Palermo. The Chief of Police there \n\t\tis a very good friend of mine and I'm sure \n\t\the'll do whatever he can. I feel we're wasting \n\t\tour time here... Excuse me, Lieutenant. I hope \n\t\twe see each other again under better \n\t\tcircumstances. And thanks for everything.\n<b> \n</b>Bidding goodbye to the Lieutenant, Anna's father leaves, without looking at \nSandro. A moment later, Sandro folds the newspaper he was reading, tucks it \nunder his arm, and starts heading towards the door.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tAt any rate, we'll continue investigating. I \n\t\tknow that headquarters has sent out an alarm to \n\t\tall areas...\n\n<b>\t\t\t\tSANDRO\n</b>\t\t\t(showing the newspaper \n\t\t\t to the Lieutenant)\n\t\tTell me, Lieutenant, do you happen to know this \n\t\tF.Z. who wrote this article here?\n<b> \n</b>The Lieutenant takes a look at the paper which carries a two-column story \nheaded: DISAPPEARANCE OF A ROMAN TOURIST AT LISCA BIANCA.\n<b> \n</b><b>\t\t\t\tLIEUTENANT\n</b>\t\tThat's Francesco Zuria. He's the news \n\t\tcorrespondent.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tWhere can we locate him? Don't you think that \n\t\tby offering a reward to anyone who can give us \n\t\tsome information...\n\n\n<b>\t\t\t\tLIEUTENANT\n</b>\t\tZuria is in Messina. You might try him. Shall \n\t\twe phone him?\n<b> \n</b>From the opposite end of the corridor through which Sandro and the Lieutenant \nare walking, appears the Sergeant who was in charge of the patrol boat on \nwhich Claudia toured the islands in search of Anna. After saluting his \nsuperior, the Sergeant says:\n<b> \n</b><b>\t\t\t\tSERGEANT\n</b>\t\tHave you any instructions for me, Lieutenant? \n\t\tMay I return to Lipari?\n\n<b>\t\t\t\tLIEUTENANT\n</b>\t\tYes. With whom did you leave the crate of \n\t\tcigarettes?\n\n<b>\t\t\t\tSERGEANT\n</b>\t\tI left it at the warehouse.\n<b> \n</b>The Sergeant again salutes his superior, then continues on his way along the \ncorridor. Sandro abruptly turns around and follows after him.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tPardon me, Sergeant, but when did you get back?\n\n<b>\t\t\t\tSERGEANT\n</b>\t\tAbout two hours ago.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd the young lady who was with you? \n\n<b>\t\t\t\tSERGEANT\n</b>\t\tI don't know... She said she had to catch a \n\t\ttrain.\n<b> \n</b>Sandro remains a while, absorbed in his thoughts, then hurriedly leaves the \nbuilding, and heads towards the station.\n<b> \n</b>\n\n<b>***\n</b>On her way to the waiting room of the station, Claudia purchases a newspaper, \nthen goes over to an empty bench and sits down. Turning to the local news \nsection, she suddenly comes upon the article announcing Anna's disappearance.\n\nA moment later, Sandro appears at the door. Claudia looks up at him but \ndoesn't say a word. He walks over and sits down beside her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWhere are you going?... To Montaldo's? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tYes.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tThen I'll go with you.\n<b> \n</b>There is a moment of silence, then Claudia shows him the newspaper article.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHave you read it?... They're asking for anyone \n\t\twith information to get in touch with them. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes. I had also thought of going there to talk \n\t\twith them...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tYes, you should go. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut then when will we see each other?\n<b> \n</b>Claudia looks at him imploringly, intent on making him understand, without \nhaving to tell him outright, that it is not a question of their seeing each \nother. Sandro, of course, does realize and suddenly springs to his feet and \nnervously begins pacing back and forth across the waiting room. Claudia, in \nturn, also rises and goes over to him.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI know it's difficult. But if you go on like \n\t\tthis it will become even more difficult.\n<b> \n</b>The bell announcing the train's arrival is sounded. Sandro turns around and \nfaces Claudia, almost with a sense of helpless despair.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tPlease, don't look so solemn... And don't wait \n\t\tfor the train to come in.\n<b> \n</b>But Sandro doesn't move. And again Claudia insists, imploring him not to \nstay, although she realizes full well that this may mean a final goodbye.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tPlease, please leave. I don't want to look out \n\t\tof the window and wave to you with a \n\t\thandkerchief.\n<b> \n</b>Sandro still doesn't move, and is about to say something, but Claudia looks \nat him so pleadingly and with such a determined expression, that he finally \nsuccumbs and starts walking towards the exit behind the train tracks.\n\nThe train has just pulled into the station. The platform is completely empty \nand Claudia is the only one to board the train. She climbs up the steps and \nthe door is closed behind her. A second later, she appears at the window, \nlooks out briefly, then disappears into her compartment. The station master \nraises the signal for the engine to start, a short whistle is heard, and soon \nthe train gets under way.\n\nSandro dashes out across the tracks, swings open one of the doors, and boards \nthe train as it picks up speed and pulls away from the station.\n\nClaudia is seated in a corner near the window, looking out. She appears \ncompletely relaxed and totally drained of energy, fatigued after so much \ntension. After a few seconds, she turns around and is abruptly startled to \nsee Sandro standing nearby in the corridor. He comes over to her compartment \nand takes a seat directly opposite to hers. Claudia is absolutely furious.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tGo ahead, now say something! I want to know \n\t\tjust what it is we have to say to each other.\n<b> \n</b>Sandro remains silent, waiting for Claudia to settle down and calm herself. \nBut she continues to reproach him.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro, I don't want you to come with me, I \n\t\tdon't want to see you... How can I make it \n\t\tclear to you?...Why did you come?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI don't know why. I just couldn't help it.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tBut sooner or later we've got to end this \n\t\trelationship. And it's better to do it right \n\t\tnow. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI have no desire to sacrifice myself... It's \n\t\tidiotic to sacrifice oneself... Why?... For \n\t\twhom? If Anna were here I might understand your \n\t\tscruples. But she's not...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\t\t(deeply wounded)\n\t\tOh, Sandro... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI'm sorry. I didn't want to sound cynical. But \n\t\tisn't it better to look things squarely in the \n\t\teye?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tFor me they are exactly as they were when we \n\t\tmet three days ago -- just three days ago...\n\t\tdon't you realize? And you and Anna... No, I \n\t\tguess they aren't like that any more. My God, \n\t\tis it possible to forget in such a short time, \n\t\tfor things to change so quickly? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tIt takes even less.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tBut it's so sad. So terribly sad. I'm not used \n\t\tto it, I'm not ready for it... You know... I \n\t\thave never been so upset in my life. Sandro, \n\t\twhy don't you help me? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI think the only way to help ourselves, Claudia, \n\t\tis for us to be together.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo, I'm sure it won't. Move over there. Let's \n\t\tmake believe nothing happened. And when we get \n\t\tto the next station, get off. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd what about you?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tMe... I... I... Please leave me alone.\n<b> \n</b>Suddenly, she stands up and goes into the corridor. The car is of an old type \n-- one half is first class, the other second. Claudia stops in front of a \nsecond-class compartment from which the sound of two voices is heard. One is \nthat of a woman -- sweet, very delicate and very feminine; the other is that \nof a man with a Sicilian accent. Sandro joins Claudia. Standing there \ntogether they hear the conversation.\n<b> \n</b><b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tI work there but I'm really a stranger. \n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tI tell you this acquaintance of mine knows you \n\t\tand she has often spoken to me about you.\n\n<b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tAnd who is she? Does she work in Catania?\n<b> \n</b><b>\t\t\t\tMAN'S VOICE  \n</b>\t\tYes, she takes care of the garden. \n\n<b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tThen it's impossible for her to know me. In the \n\t\tvilla where I'm at, we have a male gardener. \n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tSo? That's logical. You see, both being \n\t\tgardeners, they spoke about you to one another. \n\n<b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tAnd what did they say about me? \n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tThey told me that you were a very nice girl, \n\t\tthat you always mind your business... In other \n\t\twords, things of that sort.\n<b> \n</b>There is a moment of silence. Then, the sound of music is heard coming from \nthe compartment. Claudia and Sandro look at one another with a smile on their \nfaces. Then Claudia leans over to peek into the compartment. The woman is \nyoung; she has thick, wavy brown hair.  He is one of those typical seducers \nfrom the provinces, with black hair. There is a tiny radio between them. \nSandro also takes a peek into the compartment. Then they withdraw as the two \nresume their conversation.\n<b> \n</b><b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tWe have a radio like this, too. \n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tNo, not like this one.\n\n<b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tAnd why wouldn't we have one like this?\n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tBecause this is a Chinese radio.\n<b> \n</b>Another pause. Sandro takes hold of Claudia's hand and presses it. She \ndoesn't resist, but allows him to do it.\n<b> \n</b><b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tCertainly a radio this small is very practical. \n\t\tIt's especially useful for... I don't know... \n\t\tfor traveling.\n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tBut for you, what comes first: music or love?\n<b> \n</b>Claudia presses up close to Sandro, amused and, at the same time, obviously \nmoved.\n<b> \n</b><b>\t\t\t\tWOMAN'S VOICE  \n</b>\t\tMusic, of course. To get a sweetheart, one has \n\t\tto look around, but to get a radio, all you \n\t\thave to do is buy one.\n\n<b>\t\t\t\tMAN'S VOICE  \n</b>\t\tAh, no... For me, love comes first. I'm a man, \n\t\tand I know what's what: first love, and then \n\t\tmusic.\n<b> \n</b>Claudia laughs but she is still very upset. All of a sudden, she starts and \nlooks out the little window. The train is coming into a station and is \nbeginning to slow down. Claudia grabs Sandro by the sleeve and pulls him \nthrough the corridor. Sandro tries to resist.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tClaudia, listen to me...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo, Sandro, please... I ask you as a favor...\n<b> \n</b>She continues to drag him through the corridor, until they finally reach the \nplatform. Then she opens the door. They are both highly emotional. Claudia is \nalmost hysterical.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tPromise that you won't try to look for me... \n\t\tyou shouldn't try to look for me any more... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut why, Claudia?... Why?\n<b> \n</b>Sandro tries to grab her in his arms, but Claudia pushes him away, almost \nwith a sense of violence, as though she were afraid she might change her mind \nonce in his arms. In the meantime, the train has come to a stop in the \nstation. Sandro pauses to look at Claudia once more.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tEven if you chase me away, I... Claudia, let's \n\t\tnot wait any longer... After, it will be too \n\t\tlate ... Come with me.\n<b> \n</b>Claudia is visibly battling with herself. Then, in one last moment of \ndecision, she pushes Sandro towards the door and goes back into the car.\n<b> \n</b>Once on the ground, Sandro walks back and forth along the platform to see if \nhe can find Claudia, hoping she might look out the window to wave goodbye. \nBut she doesn't appear. The train starts to move, as Sandro desperately tries \nto catch a glimpse of Claudia. But she is not to be seen. Sandro starts \nrunning along the platform, but the train is now going too fast. He stops -- \nangry, disappointed and upset.\n<b> \n</b>\n\n<b>***\n</b>At the entrance-way of a luxurious villa, Claudia, who has just arrived, is \ngreeted by the Princess. She is an elderly woman, rather ordinary in \nappearance but very aristocratic in taste and manner.\n<b> \n</b><b>\t\t\t\tPRINCESS  \n</b>\t\tDid you have a good trip? It is such a \n\t\tmagnificent day! I am very happy that Sicily is \n\t\table to give you so warm a welcome. And you do \n\t\tdeserve it. You're such a lovely blonde. Come, \n\t\tmy dear.\n<b> \n</b>Claudia smiles, and follows the Princess into the garden.\n<b> \n</b><b>\t\t\t\tPRINCESS  \n</b>\t\tAnd where are you from? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tFrom Rome.\n\n<b>\t\t\t\tPRINCESS\n</b>\t\tOh, how nice! So, you're from Rome... And would \n\t\tyou happen to know of some intelligent \n\t\tclergyman in Rome who might be willing to come \n\t\there and stay with us? We have our own private \n\t\tlittle chapel... It is a masterpiece, with \n\t\tseventeenth-century frescoes... and the \n\t\tremains of all our dead ancestors, a wonderful \n\t\tcollection... He would find it very convenient \n\t\tthere, and could say his own masses. Then he \n\t\twould have to spend a little time with my \n\t\thusband, who never sees anyone, to keep him \n\t\toccupied.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAn intelligent clergyman, Princess? But I \n\t\tthink the intelligent clergymen of today have \n\t\tso many other things to do.\n\n<b>\t\t\t\tPRINCESS \n</b>\t\tWell, perhaps one with a little physical \n\t\thandicap. One who is slightly lame, for \n\t\texample.\n<b> \n</b>In the meantime, they have arrived at a shady alcove where, seated in various \nwicker lounge chairs, are Patrizia, Giulia and a young man dressed in simple, \ncasual clothes. The first one to notice Claudia and to greet her with warm \ncordiality, is Giulia.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tWell, finally! We were beginning to get worried \n\t\tabout you, too.\n<b> \n</b>Claudia plunks herself down in one of the lounge chairs next to Patrizia. The \nyoung man rises and bows slightly.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tBut where did you finally end up? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tIt was futile. We went all over.\n<b> \n</b>There is a moment of silence; the thought of Anna returns to weigh on the \ngroup. Claudia pours herself an orange drink from a pitcher on the table \nbeside her.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\t\t(referring to Anna) \n\t\tBut why does she do these things? \n\t\t\t(she takes a sip from \n\t\t\t her glass, then rises) \n\t\tI can't stand it any more.\n<b> \n</b>She takes a few steps, looks around at the villa, and at the other end of the \nalcove sees Corrado and Ettore saying goodbye to a pair of elderly gentlemen.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\t\t(to Corrado and Ettore)\n\t\tBut how can you carry on a discussion in this \n\t\theat?\n\n<b>\t\t\t\tCORRADO \n</b>\t\tWhen one approaches fifty, my dear, he is \n\t\taffected only by the cold.\n\n<b>\t\t\t\tETTORE\n</b>\t\t\t(noticing Claudia)\n\t\tAnd who is this? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tThis is Claudia, Anna's friend...\n\t\t\t(to Claudia) \n\t\tYou've never met my husband, have you?\n<b> \n</b>Ettore immediately recalls Claudia's name from a previous conversation that \nwas apparently held before she arrived.\n<b> \n</b><b>\t\t\t\tETTORE  \n</b>\t\tBy the way, have you phoned him?\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tYou mean Sandro? I told you already. He's not \n\t\tin. At least he's not at the hotel.\n\n<b>\t\t\t\tETTORE  \n</b>\t\tNow look what has to go and happen... At a time \n\t\twhen I'll be needing him. How can we discuss \n\t\tthings when we lack dates and figures?... \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut didn't he say he was coming here...\n<b> \n</b>Now, with all this talk about Sandro, the sense of relaxation Claudia had \nfelt upon her arrival, has changed into a feeling of anxiety that becomes \nmore and more noticeable.\n\n<b>\t\t\t\tETTORE  \n</b>\t\tWell, what are you all waiting for? Send a car \n\t\tout to get him. He can't be more than a couple \n\t\tof hundred miles away...\n\n<b>\t\t\t\tGIULIA \n</b>\t\tTo me, the fact that hasn't shown up is a good \n\t\tsign. Do you want to bet that he's found Anna? \n\n<b>\t\t\t\tETTORE  \n</b>\t\tMaybe. But do you know that forty thousand \n\t\tpersons a year disappear in Italy without \n\t\tleaving a single trace behind them. Forty \n\t\tthousand! Almost as much as the entire \n\t\tpopulation of San Siro... Raimondo, will you go \n\t\tand see if you can locate Sandro? \n\n<b>\t\t\t\tRAIMONDO \n</b>\t\tOkay.\n<b> \n</b>A gong announcing lunch resounds throughout the garden.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tFirst let the poor thing have something to eat. \n\n<b>\t\t\t\tETTORE  \n</b>\t\tIt wouldn't really do you any harm to skip a \n\t\tmeal.\n\n<b>\t\t\t\tPRINCESS  \n</b>\t\tI've never met this Sandro. What kind of a \n\t\tperson is he?... He couldn't have done her in \n\t\thimself, by any chance?\n\n<b>\t\t\t\tETTORE\n</b>\t\t\t(breaking out into a loud laugh)\n\t\tSandro?... Oh, sure... I can see Sandro calling\n\t\tAnna over to him and saying: Listen, Anna, I \n\t\tintend to get rid of you, but since it's so \n\t\tpainful and complicated... and besides, I \n\t\tdon't happen to have a gun on me... why don't \n\t\tyou do me a favor and get rid of yourself on \n\t\tyour own...\n<b> \n</b>There is a moment of complete, dead silence, during which the same disturbing \nthought flashes across the minds of all those who are present like a sudden \nrevelation.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tMy God, how could we joke over something like \n\t\tthat! We should be ashamed of ourselves. \n\n<b>\t\t\t\tPRINCESS \n</b>\t\t\t(rising)\n\t\tCome on, let's go.\n<b> \n</b>They all get up except Claudia. She is left so completely shaken by the \nconversation, by the thought, that it seems she no longer has the strength to \nmove. Giulia, after giving Corrado a defiant look, turns and smiles at the \nyoung man who had stopped to wait for her.\n<b> \n</b><b>\t\t\t\tGIULIA\n</b>\t\t\t(to Claudia, referring \n\t\t\t to the young man)\n\t\tGoffredo is the Princess' nephew. He's \n\t\teighteen years old, the lucky boy. And, what do \n\t\tyou know -- he paints. \n\n<b>\t\t\t\tGOFFREDO \n</b>\t\tAnybody can hold a brush in his hand. All you \n\t\tneed is to buy some oils and start painting. \n\t\tEven Rembrandt did the same.\n<b> \n</b>Giulia laughs with a strange sense of excitement, then takes Goffredo by the \narm and leaves. Claudia remains alone. She watches the group heading towards \nthe house,  Giulia holding tight to  Goffredo, Ettore  to Patrizia. Their \nvoices are heard, somewhat unclear.\n<b> \n</b><b>\t\t\t\tETTORE  \n</b>\t\tBut... where is the Prince?... Is he well? \n\n<b>\t\t\t\tPRINCESS  \n</b>\t\tThe last time I saw him, the day before \n\t\tyesterday, it seemed he was well.\n\n<b>\t\t\t\tETTORE  \n</b>\t\tPrincess, why don't you sell this villa? I \n\t\twould turn it into a lovely psychiatric clinic. \n\n<b>\t\t\t\tPRINCESS  \n</b>\t\tIt's a little like that already.\n\nFinally, even Claudia starts moving, slowly, behind the others; but she is \nstill very much upset.\n<b> \n</b>\n\n<b>***\n</b>A crowd of people that keeps growing and growing from one moment to the next, \nis gathered in one of the main streets of Messina, in front of a men's store \nwith its shutters half-shut. The local police are unable to control the flow \nof traffic, which has been blocked as a result of the crowd. The cars are \npacked close to one another, raising a great din with their horns. The throng \nis composed chiefly of young men pushing and climbing over each other to get \nnear the shop to see inside. Sandro tries to make his way through the crowd \nin an attempt to get up close himself, but the confusion is so great that he \nfinds the going very difficult. Remarks and comments are heard above the \nnoise.\n<b> \n</b><b>\t\t\t\tFIRST YOUNG MAN\n</b>\t\tWho is it, Sophia Loren? \n\n<b>\t\t\t\tSECOND YOUNG MAN\n</b>\t\tOh, no! It's some model from Turin with a \n\t\tlow-cut dress.\n\n<b>\t\t\t\tOTHER VOICES\n</b>\t\tIt's Queen Saroya... I saw her... So, who \n\t\tcould it be?\n\n<b>\t\t\t\tTHIRD YOUNG MAN\n</b>\t\tThey've torn her dress... She's almost nude... \n\t\tShe ran into the shop to hide herself...\n<b> \n</b>A police siren is heard from afar, then before long it fills the air and \ndominates every other sound.  An Alfa Romeo pulls up, followed by a police \nwagon full of policemen. Both vehicles maneuver their way through the crowd \nlike snakes through a jungle, and stop right in front of the shop. Sandro \ntakes advantage of the opening created by the two cars and thus finds himself \na few steps away from the door. Bending over in order to see through the \nsmall space left open by the half-drawn shutters, he notices several \nnewspapermen and photographers.\n<b> \n</b><b>\t\t\t\tSANDRO\n</b>\t\t\t(to one of the newspapermen) \n\t\tWhich one of you is Zuria?\n\n<b>\t\t\t\tNEWSPAPERMAN\n</b>\t\tHe's inside.\n<b> \n</b>Meanwhile, the policemen have come out of the wagon and arrive at the door of \nthe shop, with the Chief of Police leading the way. One of them raises the \nshutter, and the crowd, which has backed away slightly at the insistence of \nthe police, begins pressing forward threateningly. Soon pandemonium breaks \nloose. In the confusion, Sandro manages to get inside the store along with \nthe policemen and two photographers. The shutter is again lowered, just a few \ninches behind him.\n<b> \n</b>Standing in the middle of the shop is a most charming and provocative young \nbrunette with tight-fitting pants and a blouse that is open almost from the \nneck to the waist. She is wearing nothing under her blouse, so that with \nevery movement of her body, one cannot help catching a glimpse of her naked \nbreasts. As the policemen come forward, she receives them with a smile. \nSandro asks one of the journalists standing nearby if he can tell him which \none of them is Zuria.  The journalist points to a man who is only a few steps \naway -- a man not very old but who has a ravaged face, and whose hair is \nalmost completely white.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tZuria?\n\n<b>\t\t\t\tZURIA  \n</b>\t\tYes. Until proven otherwise. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI would like to ask you something. \n\n<b>\t\t\t\tZURIA  \n</b>\t\tWait a moment. Can't you see I'm busy?\n<b> \n</b>Everybody is gathered around the Chief of Police and the girl. The store \nclerks are looking at her admiringly. The manager, most upset, is explaining \nthe situation to the Chief of Police.\n<b> \n</b><b>\t\t\t\tMANAGER\n</b>\t\tI phoned you, Chief, because, in view of the \n\t\tsituation... I thought it best...\n<b> \n</b>The girl interrupts him. She has a very self-satisfied look on her face.\n<b> \n</b><b>\t\t\t\tGIRL\n</b>\t\tI came down here to buy a foulard... Suddenly \n\t\tI realized that little by little, directly \n\t\tbehind me, I was being followed by so many \n\t\tmen, and more and more of them kept coming.\n<b> \n</b><b>\t\t\t\tCHIEF OF POLICE\n</b>\t\tWell, I should think so... Dressed like that.\n\n<b>\t\t\t\tGIRL\n</b>\t\tBut I have always gone around like this, \n\t\teverywhere in the world. Nothing like this has \n\t\tever happened to me before.\n<b> \n</b>Zuria turns to Sandro and clears his throat. Outside, the crowd becomes very \nnoisy.\n<b> \n</b><b>\t\t\t\tZURIA\n</b>\t\t\t(to the girl) \n\t\tHow old are you?\n\n<b>\t\t\t\tGIRL\n</b>\t\tNineteen. My name is Gloria Perkins. I'm \n\t\tmarried and a writer by profession. I write in \n\t\ta trance, almost always in contact with people \n\t\twho are dead. Tolstoi, for example, or \n\t\tShakespeare. But the movies also interest me.\n<b> \n</b>Zuria nods to Sandro as if to say: now watch this.\n<b> \n</b><b>\t\t\t\tZURIA  \n</b>\t\tHow do you find the men of Messina? Are you \n\t\tshocked by their warm display of friendliness? \n\n<b>\t\t\t\tGIRL\n</b>\t\tNo, why should I be shocked? We're in Italy, \n\t\tnot Finland.\n\n<b>\t\t\t\tZURIA  \n</b>\t\tAnd how were you received in Palermo?\n<b> \n</b>The girl turns around and looks down at Zuria with contempt, but she manages \nto remain calm.\n<b> \n</b><b>\t\t\t\tGIRL\n</b>\t\tIn Palermo I was with my husband. Now I'm \n\t\tgoing to Capri to write an article for the \n\t\tTourist Office.\n<b> \n</b>Zuria clears his throat again and whispers to Sandro.\n<b> \n</b><b>\t\t\t\tZURIA  \n</b>\t\tShe did exactly the same thing in Palermo. \n\n<b>\t\t\t\tCHIEF OF POLICE\n</b>\t\t\t(to the girl) \n\t\tIf you want to go back to your hotel... we're \n\t\tready to escort you.                   \n\n<b>\t\t\t\tGIRL\n</b>\t\tOh, yes, thank you... \n<b> \n</b>Photographer snaps a flash photo. The girl immediately strikes a pose. Other \nflashes follow. The clerks ask for her autograph. One of the policemen raises \nthe shutter; the girl comes forward smiling, and is greeted with a certain \nkind of roar from the crowd. The group leaves the shop. Sandro and Zuria also \ncome out. The girl, ushered out by the policemen, climbs into the Alfa Romeo. \nThe guard holds the crowd back. There are more camera flashes. More smiles \nfrom the pretty stranger. Finally the car pulls out, followed by the police \nwagon. Sandro and Zuria watch the car disappear through the crowd, which \nstarts to disperse. The din, however, is still enormous, due to the \nunsnarling of the traffic jam.\n<b> \n</b><b>\t\t\t\tZURIA  \n</b>\t\tDo you like her?\n<b> \n</b>Sandro shrugs his shoulders, somewhat surprised by the journalist's question.\n<b> \n</b><b>\t\t\t\tZURIA  \n</b>\t\tShe costs a hundred thousand lire. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tYou're kidding!\n\n<b>\t\t\t\tZURIA  \n</b>\t\tNo, I'm not. Why do you think she does all \n\t\tthis? It's one of the many ways she can put \n\t\therself on display. When you bait the trap, the \n\t\tmouse will snap. To tell you the truth,  if it \n\t\twasn't for the fact that one hundred thousand \n\t\tlire represents my whole month's salary, well...\n\t\tBut you had something you wanted to ask me?\n<b> \n</b>Sandro is still looking at the journalist with a sense of incredulity, almost \nas if he felt Zuria's conversation was something out of this world. But he is \nbrought back to reality by Zuria's last remark, which is made as the \njournalist starts walking at a very hurried pace.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tI read one of your articles regarding the \n\t\tdisappearance of a girl. I'm that girl's fianc\u0082.\n\n<b>\t\t\t\tZURIA  \n</b>\t\tOh... I'm sorry I have to rush but I've got to \n\t\twrite a story about this thing that just \n\t\thappened... Tell me exactly how it all turned \n\t\tout.\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(impatiently)\n\t\tNow listen, if I had any information, I \n\t\twouldn't have come here to ask you. But I see \n\t\tthat you, too, lack any information ...\n<b> \n</b>The journalist casts a sidewards glance at Sandro. He is a bitter and \nsarcastic man, one who is completely absorbed with his own little problems \nand his own daily routine. But for this very reason he is quite capable of \ntaking any kind of insult, either big or small.\n<b> \n</b><b>\t\t\t\tZURIA  \n</b>\t\tAs a matter of fact, I've already had several \n\t\tphone calls on that article. One said they had \n\t\tseen the missing girl in an automobile \n\t\tsomewhere in Rome. Another one said they saw \n\t\ther on the pier talking with some strange \n\t\tsailors... Could be she secretly left the \n\t\tisland by boat...\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tIs that possible?\n\n<b>\t\t\t\tZURIA  \n</b>\t\tWho knows?... Another one has it that she \n\t\tentered a store in Troina. This information \n\t\tcomes from the storekeeper himself who stated \n\t\tthat such and such a girl had bought I don't \n\t\tknow what in his store... at Troina.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tIs that far from here?\n\n<b>\t\t\t\tZURIA  \n</b>\t\tAbout fifty miles or so. If you want, I'll give \n\t\tyou the name of the storekeeper.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tYes... of course... But you should also print \n\t\tthat in your paper... But right away, tomorrow \n\t\tmorning... It's the local Palermo paper, isn't \n\t\tit?... I mean, it's widely read...\n\n<b>\t\t\t\tZURIA  \n</b>\t\tYes, but why do you think our readers would be\n\t\tinterested in such news now? Even if I sent it, \n\t\tthe editors wouldn't print it.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYou really must do me this one favor. \n\n<b>\t\t\t\tZURIA  \n</b>\t\tPardon me, but why must I do you a favor? \n<b>\t\t\t\n</b><b>\t\t\t\tSANDRO \n</b>\t\tThen let's call it a business proposition. \n\t\tSomething to round out your salary.\n<b> \n</b>The journalist clears his throat without answering. Then he grabs Sandro by \nthe arm and takes him back to the other side of the street where a few \npeople, left over from the crowd, are still discussing the incident that just \ntook place as they gradually drift away from the scene. The traffic is now \nback to normal.\n<b> \n</b>\n\n<b>***\n</b>At the Princess' villa, Claudia is in her room, applying some fresh make-up \nin front of a small dressing table. Although she appears thoroughly engrossed \nin all the minute details of her make-up, nevertheless, she seems \nconsiderably  interested in any sound that comes through her window.\n\nThe rumble of a motor is heard. Claudia runs to the window and looks out into \nthe garden. A dark car pulls up in front of the service entrance. A uniformed \nchauffeur gets out of the car and enters the house carrying a package under \nhis arm. There is an obvious look of disappointment on Claudia's face. She is \nabout to return to the dressing table when she notices, there in the garden, \nGiulia heading towards the house accompanied by the young Prince, Goffredo. \nClaudia is profoundly shocked by Giulia's behavior as she laughs, jokes, \nbends over to pick up some flowers, and skips along unashamedly.\n\nIn the meantime, Patrizia has entered the room with two wigs, one of which \nshe is wearing and the other in her hand. She also has on a cocktail dress, \nbut one that is more elaborate than Claudia's. Patrizia immediately goes up \nto the mirror of the dressing table and, while she finishes arranging the wig \non her head, says to her friend:\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tAre you ready? I'm not. That's all we needed -- \n\t\ta cocktail party... The vitality some people \n\t\thave irritates me! \n\t\t\t(indicating the wig on her head)\n\t\tHow does it look?\n<b> \n</b>Claudia, who has meanwhile tried on the other wig and is looking at herself \nin the mirror, turns around to Patrizia.\n<b> \n</b><b>\t\t\t\tCLAUDIA\n</b>\t\t\t(ironically)\n\t\tIt's divine! \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tYou say that just to flatter me. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tDo you consider that a compliment? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tNo.\n<b> \n</b>The two of them burst out laughing and together they leave the room. Then \nafter a few steps through the corridor, they separate with a friendly gesture \ntowards each other. Patrizia goes into her room while Claudia prepares to \ndescend the wide stairway. Coming up the same stairway are Giulia and the \nyoung Prince, Goffredo.  There is something of an embarrassing moment between \nthem. Then Giulia, aware of Claudia's presence, detaches herself from \nGoffredo and, as they reach the top of the stairs, she comes over to Claudia \nand takes her by the wrist in order to confide with her more intimately.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tHe wants to show me his paintings. He won't \n\t\tlet go  of me  anymore.  Poor thing, he must \n\t\thave a crush on me...\n<b> \n</b>She laughs with an obvious sense of amusement, but she is also tickled by her \nown vanity. Claudia looks at her without knowing what to say to her.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\t\t(even more excited)\n\t\tPlease, you come too... \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tBut for what reason should I come there? \n\n<b>\t\t\t\tGIULIA \n</b>\t\tPlease, do come... Don't leave me alone with \n\t\thim. He's capable of... I don't know... Have \n\t\tyou noticed his eyes?\n<b> \n</b>Claudia resigns herself to escorting Giulia to the floor up above. The very \ntop of the stairway leads to an attic, where Goffredo is leaning over the \nrailing, looking down.\n<b> \n</b><b>\t\t\t\tGOFFREDO  \n</b>\t\tGiulia... \n\n<b>\t\t\t\tGIULIA \n</b>\t\tHere I am.\n<b> \n</b>Seeing the two of them arriving together, the young Prince feels \ndisappointed. But he knows he has to cover his intentions with a show of good \nmanners. When the two women reach the top of the stairs, he bows to Claudia \nin a most respectful fashion. Then he leads them down a low and narrow \ncorridor to a door they pass through.\n<b> \n</b>The attic is bright and spacious, with slanted roof, and two huge windows. It \nis filled with paintings, easels, canvases, brushes and oils. As soon as \nGiulia enters the studio, she moves away from Claudia and attaches herself to \nthe young Prince who is setting up one of his paintings on an easel beside \none of the windows. Claudia looks around the room with a sense of \nindifference. Going over to the window, she looks out and sees a vast \npanorama of the countryside. \n\nGiulia looks at the painting with a certain amount of surprise. It is a \npicture of a nude woman; a shapely figure, slightly plump, in the manner of \nRenoir.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tClaudia, come and see. It's a nude.\n<b> \n</b>Claudia is looking through the paintings that lean up against the wall face \nbackwards. She turns one around: a nude woman. A second: another nude woman. \nA third: the same.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tThey're all nudes, if I'm not mistaken. \n\n<b>\t\t\t\tGIULIA \n</b>\t\t\t(to Goffredo)\n\t\tBut why all nudes?\n\n<b>\t\t\t\tGOFFREDO  \n</b>\t\tBecause there is no landscape as beautiful as a \n\t\twoman.\n\n<b>\t\t\t\tGIULIA \n</b>\t\tAnd where do you find the models? \n\n<b>\t\t\t\tGOFFREDO  \n</b>\t\tOh, there are as many as one wants. \n\n<b>\t\t\t\tGIULIA \n</b>\t\t\t(turning to Claudia)\n\t\tI thought the model was something obsolete \n\t\tnowadays. Didn't you, Claudia?\n<b> \n</b>Claudia goes back to look out the window: a group of flying birds swoops down \nto land directly under the roof. The birds settle themselves in a little nest \ndirectly in front of the window. Claudia bends over to get a better look and \nis actually able to see the little nest, as she hears behind her the exchange \nof remarks between Giulia and the young Prince.\n<b> \n</b><b>\t\t\t\tGOFFREDO  \n</b>\t\tIt's strange how anxious women are to display \n\t\tthemselves. It's almost a natural inclination. \n\n<b>\t\t\t\tGIULIA \n</b>\t\tBut how could they pose like that? I couldn't. \n\n<b>\t\t\t\tGOFFREDO  \n</b>\t\t\t(with a grave, youthful sensuality)\n\t\tWhy don't you try?\n\n<b>\t\t\t\tGIULIA \n</b>\t\tMe... Goffredo, you're mad! \n\t\t\t(turning to Claudia) \n\t\tHe's mad.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNot really.\n<b> \n</b>Claudia moves away from the window, and continues to look at Giulia and \nGoffredo with a deep sense of amazement. Giulia is euphoric, kittenish and \ntrembling with excitement. Goffredo is firm, resolute and serious.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tDon't you ever paint men?\n\n<b>\t\t\t\tGOFFREDO  \n</b>\t\tAnswer me, why don't you try posing? I'll paint \n\t\tyou a beautiful portrait.\n\n<b>\t\t\t\tGIULIA \n</b>\t\tBut why me?... Ask Claudia, she's much more \n\t\tbeautiful than me.\n\n<b>\t\t\t\tGOFFREDO  \n</b>\t\t\t(insistent)\n\t\tBut I want to paint you. You appeal to me more.\n\n<b>\t\t\t\tGIULIA \n</b>\t\t\t(timidly)\n\t\tI appeal to you more?\n<b> \n</b>Giulia glances over at Claudia, who is still preoccupied looking out of the \nwindow, then screws up her courage and boldly advances towards Goffredo, \nmaking her intentions clearly understood. Goffredo immediately responds to \nher invitation and draws himself close up against her. There is a moment of \nhesitation, then a kiss -- awkward but passionately violent. Giulia, on her \npart, is completely shameless. Claudia turns around exactly at that moment \nwhen the two of them are caught up in a feverish embrace. She looks at them, \ncompletely dumbfounded, then takes a few steps forward as though she doesn't \nbelieve her own eyes.\n<b> \n</b><b>\t\t\t\tCLAUDIA\n</b>\t\t\t(almost unconsciously) \n\t\tGiulia!\n<b> \n</b>Giulia quickly turns around, her face is flushed with excitement but also \nwith an expression that seems somewhat triumphant. Before anybody has a \nchance to say anything, she heads towards the door, swings it open and stands \nfirmly on the threshold,  obviously intent on telling Claudia to leave. In \nfact, Claudia doesn't wait to be told but immediately walks out into the \nhallway.\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tAnd tell Corrado, too, that I'm here... if he \n\t\twants me. You can also tell him that my tiny \n\t\tlittle heart is beating like mad, and that at \n\t\tthis moment, it's the only thing that interests \n\t\tme. Is that clear? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tIt couldn't be any clearer.\n<b> \n</b>Giulia takes a few steps backward into the room, and seeing Claudia still \nthere looking at her strangely, exclaims:\n<b> \n</b><b>\t\t\t\tGIULIA \n</b>\t\tNow what do I have to do to be left in peace? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI think all you have to do, Giulia, is to close \n\t\tthe door.\n<b> \n</b>And with a violent bang that leaves Claudia startled, Giulia slams the door \nshut. Claudia remains standing there for a moment, still very much amazed. \nBut she is aroused from her stupor by the sound of a car pulling into the \ncourtyard. Then she rapidly starts descending the stairs.\n<b> \n</b>Claudia has reached the hallway leading out to the garden and is anxiously \nwaiting there, looking at the car that has just arrived. But she is not able \nto distinguish exactly who it is, and her view is also blocked by Ettore and \nCorrado who have just come out of the house and are now standing in front of \nthe car. So she walks out to the garden and joins the group. A certain look \nof disappointment spreads over her face as she sees only Raimondo come out of \nthe car. Evidently, Sandro has not been located.\n<b> \n</b><b>\t\t\t\tRAIMONDO \n</b>\t\tHe's not at the hotel... and he probably wasn't \n\t\teven in Milazzo. The room clerk said he rented \n\t\ta car...\n<b> \n</b>Claudia moves away from the group, as though she has heard enough. She goes \nover to lean against an enormous vase standing there on the side. Her hands \nare trembling. In back of her she hears the sounds of the others' voices but \ncannot distinguish what they are saying. Then Patrizia arrives and calls out \nClaudia's name. But she has to repeat it a second time before Claudia \nrealizes she is being called.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tClaudia... Let's go.\n<b> \n</b>Claudia turns around but doesn't move. Another car pulls up, driven by the \nsame chauffeur who had evidently picked her up the other day, and in which \nthe Princess is already seated.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI'm not coming.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut then why did you bother changing?\n<b> \n</b>Patrizia remains puzzled for a moment as though searching for a motive behind \nClaudia's sudden decision, then discreetly turns away without insisting and \ngoes over to the car. In the meantime, Giulia and Goffredo have come out \nthrough the hallway and head towards one of the two cars. Corrado looks at \nthem with a cold and critical stare, then with a deliberate intent to prick \nGiulia's feelings, he says:\n<b> \n</b><b>\t\t\t\tCORRADO \n</b>\t\tGiulia is like Oscar Wilde; give her the \n\t\tsuperfluous and she will do without the \n\t\tessential.\n<b> \n</b>Ettore breaks out into a laugh as he helps Patrizia into the car.\n<b> \n</b><b>\t\t\t\tETTORE  \n</b>\t\tThat's him; he'd die if he didn't have somebody \n\t\tto quote. He comes up with quotations like that \n\t\teven at a board of directors meeting...\n<b> \n</b>Claudia watches them getting into the car. She is beside herself, completely \nwrapped up in her own thoughts.\n<b> \n</b>\n\n<b>***\n</b>In the rear of a general store, on the outskirts of a small Sicilian town, a \nwoman is seated at the window. She is very young, thin and irascible. Up \nfront, her husband is speaking with Sandro, and as she listens attentively to \nwhat he is saying, a sarcastic smile spreads over her face.\n<b> \n</b><b>\t\t\t\tHUSBAND  \n</b>\t\tBe patient, I can't remember everything. \n\n<b>\t\t\t\tSANDRO\n</b>\t\t\t(indicating the newspaper article)\n\t\tBut it even says what she bought: a bar of soap! \n\t\tSo there's no point in making believe you can't \n\t\tremember.\n<b> \n</b>After waiting a few seconds to give her husband a chance to explain himself, \nthe wife jumps up from where she is sitting, comes over to Sandro and yanks \nthe paper from his hands. Then she starts reading the article in a jerky \nmanner typical of one who is not too literate.\n<b> \n</b><b>\t\t\t\tWIFE  \n</b>\t\t\"A young female stranger, whose description \n\t\tcorresponds with that of the missing girl, came \n\t\tinto my store...\"\n<b> \n</b>She suddenly stops reading and turns toward Sandro.\n<b> \n</b><b>\t\t\t\tWIFE  \n</b>\t\tShe came and then she left. With him. But this \n\t\tone won't admit it. \n\t\t\t(turning upon her husband furiously)\n \t\tYou think I wasn't aware of it...\n<b> \n</b>The husband, a young man, tries to keep calm and carry on the conversation in \na logical, persuasive manner.\n<b> \n</b><b>\t\t\t\tHUSBAND  \n</b>\t\tBut if I was carrying on with the girl, why \n\t\twould I want to give any of this information to \n\t\tthe newspaper?\n\n<b>\t\t\t\tWIFE  \n</b>\t\tThat's what I'd like to know myself.\n\n<b>\t\t\t\tHUSBAND  \n</b>\t\tFine, that makes two of us who want to know. In \n\t\tfact, three, with him. \n\nHe indicates Sandro.  Then, seeing a fat, luscious female customer enter the \nstore, he turns to her and continues:\n\n<b>\t\t\t\tHUSBAND  \n</b>\t\tAh, Lady Amalia, would you be interested in \n\t\tknowing why I told the newspapers about a \n\t\tcertain girl who came here the other day and \n\t\tthen disappeared?\n<b> \n</b>The woman, anxious to learn about any new bit of gossip, becomes immediately \ninterested.\n<b> \n</b><b>\t\t\t\tLADY AMALIA\n</b>\t\tDisappeared? Who is she? ... Where? When?\n\n<b>\t\t\t\tHUSBAND  \n</b>\t\tAnd that makes four. Anybody else?...\n<b> \n</b>Sandro, a little sick and tired of the whole matter, and wanting to put an \nend to what has by now become farcical, intervenes.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tYou have to be precise. Did this girl enter \n\t\tyour store or didn't she? \n\n<b>\t\t\t\tWIFE\n</b>\t\t\t(shouting)\n\t\tYes!\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(ignoring her)\n\t\tWas she blonde or brunette? \n\n<b>\t\t\t\tHUSBAND\n</b>\t\t\t(calmly)\n\t\tBrunette. \n\n<b>\t\t\t\tWIFE\n</b>\t\t\t(contradicting him)\n\t\tBlonde. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tHow was she dressed?\n\n<b>\t\t\t\tHUSBAND  \n</b>\t\tI don't quite remember. Seems to me she wore a \n\t\tblack dress.\n\n<b>\t\t\t\tWIFE\n</b>\t\t\t(intervening sarcastically)\n\t\tHe doesn't look at dresses, he looks at what's \n\t\tunder them.\n<b> \n</b>The husband turns around and looks at his wife menacingly.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tPardon me, but has anyone else been here asking \n\t\tabout this girl?\n\n<b>\t\t\t\tHUSBAND  \n</b>\t\tNo ... I don't think so. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tThanks.\n<b> \n</b>\n\n<b>***\n</b>Sandro leaves the store. He walks a few steps along the pavement, then sits \ndown at a small outside table of a nearby caf\u0082. He looks out over the square: \na small Sicilian town, quiet and still in the hot afternoon sun. Every now \nand then, he glances up at the country road that winds around the town, as \nthough he were waiting for someone.\n\nA few moments later, in fact, a car comes into view and slows down as it \nreaches the square. The driver looks out for a place in which to park. Sandro \nrises to his feet. The car comes to a stop a few steps away from him. The \ndriver rushes out of the car to open the door for the person inside: it is \nClaudia. Sandro immediately goes over to meet her, looking at her somewhat \namazed. Not only does he see her more elegantly dressed than he has ever seen \nher before, wearing a smartly tailored polka-dot suit, but also as an \nentirely new person, as someone whose beauty he has discovered for the first \ntime. For a moment they continue staring at each other, without even \nbothering to say hello.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tAny news?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes... but it's all so conflicting... However, \n\t\tthere is some slight indication...\n<b> \n</b>Claudia drops her gaze, relieved by even that slight note of hope. Then she \nlooks up at him again, as though inspired by another sudden thought: \nsomething which must have lingered in her mind from one of the Princess' \nhumorous quips. Then, the owner of the general store appears on the scene. \nAfter having dealt his nagging wife a crushing verbal blow, he turns to \nSandro, but not without first glancing at Claudia, for whom it soon becomes \nevident he has really come out on the street.\n<b> \n</b><b>\t\t\t\tHUSBAND  \n</b>\t\tListen... In the paper they forgot to say that \n\t\tas soon as the girl left here she took the bus \n\t\tto Noto. The bus leaves from the square, over \n\t\tthere. I saw her clearly... I came to the door \n\t\tto see her off... She was a beautiful girl. \n\t\tLovely pair of legs!\n<b> \n</b>While speaking, he continues to keep an eye on Claudia with the look of one \nwho thinks his gaze is loaded with irresistible masculinity. All of a sudden, \nhe pulls out a package of Nazionali cigarettes from his pocket and offers one \nto Claudia. She looks at him dumbfounded, then automatically declines with a \nshake of her head. In turn, he lights up a cigarette, inhaling the smoke \nvoluptuously. Meanwhile, his wife has come upon the scene and looks at him \nsuspiciously. Then, with a sad, wistful voice, she turns to Claudia.\n<b> \n</b><b>\t\t\t\tWIFE  \n</b>\t\tYou're from Rome, aren't you? I knew right away \n\t\tbecause I'm from Viterbo... He was a soldier \n\t\tthere and so...\n\t\t\t(indicating her husband, and\n\t\t\t then quickly continuing) \n\t\tI don't like it very much, here.\n<b> \n</b><b>\t\t\t\tHUSBAND\n</b>\t\t\t(interrupting)\n\t\tThen why don't you go back?\n<b> \n</b>His wife turns and looks at him hatefully, exactly in the same manner he had \nlooked at her.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHow long have you been married? \n\n<b>\t\t\t\tWIFE  \n</b>\t\tThree months.\n\nClaudia and Sandro look at each other. There is a moment of embarrassment, \nthen Sandro breaks the silence.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tWell... Thanks for the information.\n<b> \n</b>They exchange goodbyes, then Claudia and Sandro move away from the store and \nhead towards Claudia's car. Suddenly, Sandro takes Claudia by the hand.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tIt's better if we present a happy picture, no?\n<b> \n</b>Claudia is about to withdraw her hand but she is taken aback by Sandro's \nphrase, which also fills her with a warm and tender feeling after the squalid \nsituation with the young storekeeper and his wife. Now Sandro opens the door \nof the car, looks at Claudia as if to ask her consent for what he is about to \ndo, and since Claudia says nothing but just stands there trying to figure out\nwhich one of the feelings struggling within her will win, he removes \nClaudia's valise and closes the door.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(to the driver)\n\t\tTell the Signora Patrizia that we are \n\t\tcontinuing the search...and that the Signorina \n\t\tClaudia will manage to survive somehow...\n<b> \n</b>The driver bows slightly, then he climbs into the car and departs. Sandro and \nClaudia remain there, watching the car disappear out of view. Now Sandro \nturns to look at Claudia, and smiles at her. Claudia is visibly upset. She \ndoesn't smile back but merely turns away and heads towards Sandro's car.\n<b> \n</b>\n\n<b>***\n</b>Claudia is intent on looking at Sandro who is doing the driving. The car is \ntraveling on a country road but Claudia shows no interest in the landscape. \nShe continues to stare at Sandro as if she wants to know his most secret \nthoughts. Suddenly, feeling himself being stared at, Sandro turns towards \nClaudia. She quickly drops her gaze. Then Sandro turns his eyes back to the \nroad, and Claudia looks up at him again.\n\nFrom a bend in the road up ahead, preceded by the loud and penetrating blast \nof a horn, the bus mentioned earlier by the storekeeper appears. Sandro \nbarely manages to stop the car in time off to one side of the road. He gets \nout and places himself in the middle of the road where he starts signaling \nfor the bus to stop. With a loud screech of its brakes, the bus comes to a \nstop almost directly in front of him. The bus driver opens the window and \nleans out.\n<b> \n</b><b>\t\t\t\tDRIVER\n</b>\t\tDid your car break down? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tNo. I only want some information.\n<b> \n</b>Meanwhile, the driver's assistant gets down from the bus and the passengers \nlean out of the windows.  Claudia has also gotten out of the car and appears \non the scene.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWe're searching for a girl of about \n\t\ttwenty-five... Seems she boarded this bus two \t\n\t\tdays ago, in the afternoon... You should \n\t\tremember her because she was a stranger around \n\t\there...\n<b> \n</b>The driver gets down from the bus and comes over to Sandro, scratching his \nhead.\n<b> \n</b><b>\t\t\t\tDRIVER\n</b>\t\tShe was a little nervous... dark-haired ... with \n\t\ta kerchief around her head?\n<b> \n</b>He turns to his assistant for verification, who, in turn, searches his memory \nand then adds:\n<b> \n</b><b>\t\t\t\tASSISTANT\n</b>\t\tTwo days ago... wasn't there that midwife on \n\t\tthe bus, too? Sure, that's right, and she was \n\t\ttalking to some young woman ...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tCan you tell me where she got off? \n\n<b>\t\t\t\tASSISTANT\n</b>\t\tAll I can tell you is that the midwife is from \n<b>\t\tX... \n</b>\n<b>\t\t\t\tSANDRO \n</b>\t\tOkay, thanks.\n<b> \n</b>Sandro turns and goes back to his car while the others climb back on the bus \nwhich begins to leave. Claudia and Sandro remain standing near the car, \nwatching the bus disappear. Then Claudia turns and looks out over the fields. \nShe sees a dry riverbed filled with stones that sparkle in the sun, beside it \na high rocky bank. Sandro stands next to her and she becomes vividly aware of \nhis presence. As she glances at him, he turns around, then she quickly starts \nup a conversation as though she were anxious not to have any romantic mood \ndevelop between them.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tMy God ... Let's hope it was her.\n<b> \n</b>Then, still feeling Sandro's eyes fixed upon her, she turns and starts  \nheading towards the car.  Sandro catches up with her and takes her hand. \nBefore they climb into the car they look at each other intensely. A moment \nlater, the car takes off at full speed.\n<b> \n</b>\n\n<b>***\n</b>In a courtyard of the midwife's house, Sandro and Claudia are questioning a \nmiddle-aged woman.\n<b> \n</b><b>\t\t\t\tMIDWIFE  \n</b>\t\tI only exchanged a few casual words with her, \n\t\tas one would ordinarily do on a public bus... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAnd do you remember where she got off? \n\n<b>\t\t\t\tMIDWIFE  \n</b>\t\tWell...probably at the last stop, which is Noto.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAfter that, you didn't see her anymore?\n<b> \n</b>The woman pauses for a few seconds and looks at Claudia as though she had \ndetected some hidden motive behind the question. And when she resumes \nspeaking, what she has to say is in sharp contrast to the way she says it. \nThey are words of protest but spoken condescendingly, almost sweetly, yet \nleaving no doubt as to their meaning.\n<b> \n</b><b>\t\t\t\tMIDWIFE  \n</b>\t\tWhat are you trying to insinuate, young lady?\n\t\tWhy should I have seen her again? I don't do \n\t\tanything that's illegitimate.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOh, no... What are you saying? I'm not \n\t\tinsinuating anything...\n\n<b>\t\t\t\tMIDWIFE  \n</b>\t\tAnd furthermore, my dear young lady... because \n\t\tyou really are a dear, you know ...if the story \n\t\tof that girl is merely a pretext, let us say, \n\t\tto get in touch with her, then I feel it is my \n\t\tduty to warn her. These things are very, very \n\t\tdangerous, especially in a neighborhood like \n\t\tthis where people occupy themselves more with \n\t\tother people's affairs than their own.\n<b> \n</b>Seeing Claudia being put into an uncomfortable position, Sandro, who had been \nfollowing the midwife's discussion with a cagey attitude, intervenes.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tThen you should also be able to tell me where a \n\t\tyoung girl might stay in Noto; are there any \n\t\thotels or rooming houses?\n\n<b>\t\t\t\tMIDWIFE  \n</b>\t\tThere's the Trinacria Hotel... or the Regina, \n\t\tnear the municipal building. As for rooming \n\t\thouses, I don't know...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tThank you.\n\n<b>\t\t\t\tMIDWIFE  \n</b>\t\tDon't mention it... Pleased to be of service \n\t\tany time.\n<b> \n</b>Claudia starts moving hurriedly out of the courtyard, followed by Sandro.\n<b> \n</b>\n\n<b>***\n</b>Sandro's car is speeding across a harsh, sun-baked landscape, bypassing long \nlines of peasants returning from the fields: the women seated on donkeys, the \nmen on foot. The more fortunate among them have horse drawn carts.\n<b> \n</b>Claudia is looking at the surrounding countryside and spies an iron bridge \nthat is all rusty and obviously no longer in use.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tLook at that bridge! Who knows why they even \n\t\tbothered to make it...\n<b> \n</b>The car continues onward, passing an abandoned factory, then a railroad \nstation, also abandoned, its tracks covered by weeds, the ticket office \nhaphazardly boarded up with old wooden planks.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tLook at that: a factory... a station... and \n\t\tlook at those tracks, all full of weeds... But \n\t\twhy?\n<b> \n</b>Sandro shrugs his shoulders and continues driving without saying a word. Up \nahead a small town comes into view, with monotonous rows of newly constructed \nhomes lined up along the side of the road. The car enters the town and stops. \nSandro gets out and goes over to a fountain nearby, but the fountain is dry. \nSomewhat surprised, he begins to look around. And only then do Sandro and \nClaudia become aware that the silence around them is an unnatural one, that \nthe doors and the windows of all the houses in the town are tightly shut. \nThere is no sign of life anywhere, except for the weeds growing between the \ncracks in the walls, invading and suffocating everything in sight. \n\nClaudia gets out of the car, joins Sandro, and together they start walking \nalong the streets. The sun beats furiously down upon the crumbling houses, \nupon the church, upon the useless monument in the square on which a \ndedication is inscribed: \"To The Agricultural Worker.\" \n\nSandro looks around in absolute silence. Claudia is also  silent, somewhat  \ndismayed. Instinctively, she presses up close to Sandro who leads her to a \nshady spot where the ground is overgrown with weeds. \n\nSandro and Claudia are lying next to each other on the grass. Sandro appears \ncalm but is actually looking at Claudia as though he were about to embrace \nher with his eyes. Then he takes her hand. Claudia offers no resistance; in \nfact, she entwines her fingers around his, almost with a sense of \ndesperation. Sandro tries to kiss her. She makes a feeble attempt to resist, \nlooks around, and sees the deserted town, the barren fields, the crumbling, \nsun-baked walls. She turns and looks at Sandro again, and now it is she who \nkisses him. When they break apart, they stretch themselves out upon the grass. \nSandro kisses her violently, again and again and again...\n<b> \n</b>\n\n<b>***\n</b>The early twilight shadows are beginning to fall. The sky is still clear but \nthe sun is fading. There is a deep silence and the air is absolutely still. \nIn a certain sense, Sandro's car, standing there in the middle of the \ndeserted street, is the only thing alive in that desolate town.\n\nHuddled close to each other, Claudia and Sandro are asleep on the grass. \nLazily, Claudia awakens, and then Sandro also opens his eyes. They are both \nsomewhat disheveled.\n<b> \n</b><b>\t\t\t\tCLAUDIA\n</b>\t\t\t(faintly audible)\n\t\tIt's late... We should be going.\n<b> \n</b>Little by little, she leaves behind the drowsiness of her deep and peaceful \nsleep, purring languorously in a typically feminine fashion. Sandro smiles \nand gently embraces her. A moment later, Claudia releases herself from \nSandro's arms, sits up and realizes that the countryside and the town itself \nare as black and motionless as death. A cold shiver runs down her back and \nshe quickly comes to her feet.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tLet's get out of here, fast... This is not a \n\t\ttown, it's a cemetery.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tWho knows why they all left...\n<b> \n</b>Claudia starts to move but her legs are still numb from her sound sleep and \nshe hobbles along comically, laughing at the same time. Sandro also gets up \nand finds that his legs are cramped. Hobbling and laughing himself, he \nfollows Claudia towards the car. But the car, baked by the sun, is like an \noven. They both make boisterous and playful exclamations, then another \nembrace, another kiss. Finally, they climb into the car and drive off with a \nloud roar that echoes up and down the abandoned town.\n<b> \n</b>\n\n<b>***\n</b>Sandro and Claudia arrive in the town of Noto and pull up on the opposite \nside of the street from the Trinacria Hotel. As they climb out of the car, \nClaudia turns to Sandro:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro ... maybe it's best that you go in alone. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAre you joking?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tDon't think that I want to save myself from any \n\t\tembarrassment, from the awkwardness of meeting \n\t\tAnna... It's not that; it's that you can say \n\t\tcertain things easier if you're alone. Please, \n\t\tSandro, do try to understand me... It would \n\t\tlook like I was trying to influence you, to \n\t\tforce you, to control you... and that makes me \n\t\tfeel uncomfortable...\n<b> \n</b>Sandro agrees by a nod of his head and indicates that he understands very \nwell. Nevertheless, he doesn't move. Several agonizing moments go by in which \nthey both remain silent and still, looking at the hotel across the way. Then, \ntossing away his cigarette, Sandro finally walks off and goes into the hotel.\n\nLeft alone, Claudia strolls along for a few steps. She sees a letter box up \nagainst a building and deposits a postcard she had been carrying with her. \nShe remains there for a moment, watching a parade of ants crawling along the \nwall, ending up who knows where. They come and go, scurrying up and down in \nvast numbers, incredibly busy. Then Claudia turns away and starts pacing back \nand forth, stopping from time to time behind townspeople who mill about in \nthe streets; she pays them no heed. Several young men pass by and turn around \nto look at her. They are obviously the town's dandies. Circling around her, \nthey exchange suggestive comments to one another. Even among the women \nClaudia arouses a certain curiosity. But she remains totally unaware of it; \nsuch is the intensity with which she concentrates her gaze upon the hotel \nentrance. Suddenly the sound of a shutter being lowered directly behind her \ncauses her to start and turn around. It is a shop being closed. Other shops, \nfurther down the street, are also closing for the day. The people in the \nstreets begin thinning out and it is not long before Claudia is left entirely \nby herself. In that total solitude, the doorway of the hotel emerges like the \nmouth of some dark and fearful cavern, so much so that Claudia is unable to \nkeep her eyes fixed upon that spot. She turns her head away, but her \nattention is immediately drawn back again. From the darkness of the hotel's \nhallway, she spies Sandro coming out. Claudia doesn't wait to see if he is \nalone or not, for she has only one thought in mind: not to let herself be \nseen. But she doesn't know what to do since there is practically no one else \nin the streets and all the shops are closed. Then she notices a tobacco shop \nstill open and she quickly dashes into it. She goes up to the counter as she \nopens her purse and starts looking for some change.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSome cigarettes, please... Do you have any?...\n\t\tNazionali with filters ...\n<b> \n</b>Her hands tremble as she searches for the money. Finally, she pays the  \nstorekeeper and immediately lights up a cigarette. Suddenly, she wheels \nabout, having heard Sandro enter. He is alone. Throwing away his cigarette, \nhe comes up to her, all nervous and excited, and they both step out into the \nstreet.\n<b> \n</b>As soon as she is outside, Claudia leans up against the wall as if she has no \nstrength left. She lets her cigarette fall to the ground and shuts her eyes.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWhat is it, Claudia?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOh, Sandro... I'm so ashamed of myself, so \n\t\tashamed...I tried to hide myself...I feel so \n\t\tsmall... I hate myself ...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tDoes it please you to say such things? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOh no... It doesn't please me at all... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tThen why do you say them?\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tBecause what I'm doing is so ugly ... Because \n\t\tif you told me right now: \"Claudia, I love \n\t\tyou,\" I would believe you...\n<b> \n</b>   Sandro is about to say the phrase, somewhat jokingly in the hope that it \nmight calm her, but also with a certain amount of seriousness. But as soon as \nhe opens his mouth to say \"Claudia,\" she places her hand over his lips.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tNo... Because then I'd force you to swear it, \n\t\tI'd force you to tell me an infinite amount of \n\t\tthings... and that wouldn't be right, it \n\t\tcouldn't be right... It would be absurd.\n\nSandro tries to calm her with an embrace.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tGood. It's better if it were absurd. That would \n\t\tmean nothing much can be done about it.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tBut just think -- the very same things you had\n\t\tsaid to her who knows how many times... maybe \n\t\teven just before we left, while I was waiting \n\t\toutside your place...\n\n<b>\t\t\t\tSANDRO \n</b>\t\tSo, even if I did say them, I was sincere with \n\t\ther, as I am now with you.\n\nMoved by Sandro's remark, Claudia lifts her head and looks deeply into his \neyes. The statement reveals him as being someone quite different from the \nperson she had imagined him to be, and at the same time, it opens up for her \na new way of looking at things. Shaking his head, and with much tenderness, \nhe says:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tI have never seen a woman like you, who needs \n\t\tto see everything so clearly.\n<b> \n</b>At the sound of a man's voice coming from behind him, Sandro turns and sees a \ngentleman with two large packages under his arms, pointing to a bell-cord \ndangling on the side of a door nearby.\n<b>         \n</b><b>\t\t\t\tMAN\n</b>\t\tExcuse me, but would you mind pulling that cord \n\t\tfor me?\n<b> \n</b>Sandro pulls the bell-cord and the sound of a bell is heard inside.\n<b> \n</b><b>\t\t\t\tMAN\n</b>\t\tThank you.\n<b> \n</b>The door opens and the gentleman quickly steps inside. Sandro looks up at the \nbuilding.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAt one time, all these houses were convents.\n<b> \n</b>He takes Claudia by the arm and pulls her away towards the square, then looks \nattentively around the area. Bathed in the soft twilight, the buildings and \nthe churches bordering the square reveal themselves in all their beauty. \nSandro and Claudia climb up the steps of a church building and from there \ngaze at the scene. Gradually he allows himself to be overcome with \nenthusiasm. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tLook! What a fantastic scene! What movement, \n\t\twhat disorder! They were very much concerned \n\t\twith scenographic effects... an extraordinary \n\t\tsense of liberty...\n<b> \n</b>There is a moment of silence during which he continues to look at the scene \nbefore him. Then, giving voice to a sincere thought, he exclaims:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tReally, I've got to stop this business with \n\t\tEttore... I would like to go back and start \n\t\tworking on my own projects again. You know, I \n\t\thad many ideas... \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAnd why did you drop them?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tOnce they gave me a job to draw up an estimate \n\t\tfor the construction of a school. It took me \n\t\tonly a day and a half to finish it, and I got \n\t\tpaid six million lire. Ever since then I've \n\t\tbeen doing estimates for other people's \n\t\tdesigns.\n<b> \n</b>Claudia looks at him as if she were about to render judgment, and Sandro \nbecomes aware of it.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWhy are you looking at me like that? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI'm sure you'd be able to design some very \n\t\tlovely things.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI don't know about that. And then, who's \n\t\tinterested in beautiful things nowadays?\n<b> \n</b>The last words are spoken with a deep sense of sadness, Sandro avoiding \nClaudia's glance. He laughs to himself and for a while remains silent. He \ntakes another look up at the dark outlines of the buildings, then turns to \nClaudia.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tClaudia, let's get married? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\t\t(astonished) \n\t\tWhat! Get married?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes. We'll get married. You and I. What do you \n\t\tsay?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tWhat do I say? What can I say? No. At least, \n\t\tnot yet. I don't know... I can't even think of \n\t\tit... at a time like this... Oh, but why did \n\t\tyou have to ask me? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tYou look at me as though I had said something \n\t\tfoolish...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tAnd are you sure you want to marry me? Are you \n\t\treally sure...that you want to marry... me? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tThat's why I asked you...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tSo... Oh, how I wish that everything were so \n\t\tmuch simpler... that people could just come \n\t\ttogether by the color of their hair or the size \n\t\tof their shoes. What size shoe do you wear? \n\t\tSize 9. That's a very lovely size. But I'm \n\t\tsorry, I wear size 8.\n<b> \n</b>Sandro smiles and playfully ruffles Claudia's hair. She also smiles, then \nslowly they both head towards the hotel.\n<b> \n</b>\n\n<b>***\n</b>It is morning inside the Hotel Trinacria.  Claudia has just had breakfast in \nher room and is almost finished dressing. It is a rather large room, set out \nwith old pieces of furniture. The place is in a state of disarray, and the \ndoor leading into Sandro's room is wide open. Because of the general \ndisorder, Claudia is unable to find her stockings. But instead of being \nangered by this, she appears quite jovial and laughs gaily. As she continues \nto look for her stockings, Sandro appears in the doorway.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAre you ready?\n<b> \n</b>Claudia comes up to Sandro and gazes upon him with a look of adoration.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\t\t(ironically)\n\t\tBut why am I so infatuated with you?\n\n<b>\t\t\t\tSANDRO \n</b>\t\t\t(smiling)\n\t\tHurry up now, or it'll begin to get hot \n\t\toutside...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tYes, yes, yes, yes... Right away...\n<b> \n</b>She starts looking hurriedly around the room again but is still unable to \nlocate her stockings. Suddenly, up from the street comes the sound of music. \nIt is a popular tune, wild and rhythmic, emanating from a publicity truck as \npart of some local advertising stunt. Claudia is overtaken by the music and \ncannot resist the temptation to do a little dance for Sandro. Little by \nlittle, she starts swaying back and forth to the music. Then, kicking off her \nshoes, she begins to dance around the room in her bare feet. Sandro looks at \nher, amused but also somewhat impatient.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(leaving)\n\t\tOkay. I understand. See you later.\n<b> \n</b>Claudia rushes up to the door, and feigning an exaggerated attitude of \ndespair, says:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tAnd you leave me here all alone... in this \n\t\thotel room... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tAs soon as you're ready, you can come down and \n\t\tcatch up with me. I'll be waiting for you right \n\t\toutside on the square.\n<b> \n</b>Claudia is in a playful mood and she is anxious to demonstrate her \nexuberance.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\t\t(teasingly)\n\t\tVery well. But you must first tell me that when \n\t\tyou go out without me it's like going out \n\t\twithout one of your legs. Go ahead, have a look \n\t\taround the town all by yourself, but you'll \n\t\thave to hobble along on only one leg. And you \n\t\tmust also tell me that you are filled with a \n\t\tgreat desire to embrace my shadow on the \n\t\twalls... Then you must tell me...\n\t\t\t(suddenly her tone of voice \n\t\t\t changes and she becomes \n\t\t\t quite serious) \n\t\tYou must tell me that you love me.\n<b> \n</b>Sandro replies with the same good-natured tolerance with which he had been \nwatching Claudia as she danced her coquettish dance.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tBut you know it already. Why must I tell you? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tSo, you wonder why?\n<b> \n</b>Without waiting for him to answer, she goes back towards the center of the \nroom and once again starts looking around for her stockings. Sandro begins to \nleave.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tThen I'll see you later. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOkay. In a few minutes.\n<b> \n</b>Sandro goes out the door. Claudia finally locates her stockings and proceeds \nto finish dressing.\n<b> \n</b>\n\n<b>***\n</b>Sandro comes out of the hotel and crosses over to the sunny square. He starts \nstrolling down along a street which leads to a baroque church that opens up \nto a wide flight of stone steps. Beyond these steps is a small dead-end \nstreet that runs up against the fa\u0087ade of a large and magnificent old \nbuilding. A few feet away from the fa\u0087ade, seated on a bench in the shade, is \nan old coachman whose horse is standing beside him with its head deep in a \nsack of hay.\n\nSandro goes down the flight of steps and approaches the door of the old \nbuilding which is closed. He rings the bell but there is no answer. Then he \nnotices a time schedule posted on the door indicating visiting hours. After \nglancing at it, he walks over to the seated coachman.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tIt's closed. Isn't there any custodian or \n\t\tcaretaker inside?\n<b> \n</b><b>\t\t\t\tCOACHMAN\n</b>\t\t \t(apathetically)\n\t\tNobody there.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tBut it says it's open from 9:30 to 10:30., and \n\t\tit's ten o'clock now...  That's a fine way to \n\t\tgreet tourists.\n\n<b>\t\t\t\tCOACHMAN\n</b>\t\tTourists? Last year a few Frenchmen came here \n\t\tand they all walked around in their bathing\n\t\tsuits. So they were made to understand that it \n\t\twas better if they didn't come at all.\n<b> \n</b>Sandro shakes his head and is about to say something but he sees the door \nopening and a man appears.  Sandro goes over to him.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAre you the custodian?\n\n<b>\t\t\t\tCUSTODIAN\n</b>\t\tYes, come right in.\n<b> \n</b>Sandro enters and finds himself inside a large courtyard of noteworthy \narchitectural design, though somewhat in a state of decay. The custodian goes \non his way and Sandro walks further into the courtyard where two young men \nare studying the architecture. On hearing Sandro's footsteps, they turn \naround for a moment, then resume their observation. They are, in fact, young \narchitectural students busily engaged in taking notes and copying certain \narchitectural details. They do this with an extraordinary interest, almost \nwith a sense of religious zeal. Sandro continues to stroll through the \ncourtyard. His footsteps are the only sounds to be heard disturbing the \notherwise absolute silence. The two young students exchange words between \neach other but they speak in faint whispers, almost as though they were \ninside a church. \n\nSandro gazes up at the arcades, the columns, the windows. He is obviously \nfilled with a painful sense of regret, resentful and bitter. He turns to look \nat the two young students who are deep in their studies and ignore his \npresence. But he is unable to ignore them; they plainly annoy him. In a \ncertain sense, they humiliate him. He turns away and heads towards the exit, \nwalking on the tip of his toes so as not to make any noise. Then he goes out, \nquietly closing the door behind him.\n<b> \n</b>\n\n<b>***\n</b>In the hotel lobby, a maid is cleaning and dusting, and at the same time, \nsinging little snatches from a popular romantic tune. The hotel manager, who \nis busy writing something in the register behind the desk, looks up and says:\n<b> \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\tGo ahead, keep right on singing...\n<b> \n</b>Disappointed, the maid immediately stops singing, and the manager resumes \nwriting. But she quickly looks up again as she hears footsteps coming down \nthe stairs. It is Claudia.\n<b> \n</b><b>\t\t\t\tHOTEL MANAGER\n</b>\t\t\t(to Claudia)\n\t\tExcuse me for interfering, but I've heard about \n\t\tthat girl... Here in this place one gets to \n\t\tknow about everything... That girl you're \n\t\tlooking for... Why don't you try asking at the \n\t\tyouth hostel in Pergusa? Almost all the young \n\t\tgirls traveling through here end up there.\n<b> \n</b>Claudia is immediately interested to hear this bit of news and is about to \nask for additional information. But she is suddenly distracted by Sandro who \nenters the lobby at that very moment.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI was just coming out to meet you. How come \n\t\tyou're back so soon?\n<b> \n</b>Sandro doesn't answer but merely shrugs his shoulders. Then he takes Claudia \nby the arm and gently leads her towards the stairway. He has a worried \nexpression on his face and remains absolutely silent as he starts climbing \nthe stairs. As they walk through the corridor, Claudia looks at him \nanxiously, wondering what is wrong.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro ...What's the matter? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tNothing.\n<b> \n</b>He opens the door to his room and ushers Claudia in. As soon as he enters, he \ntakes off his jacket and throws it on a chair. Then he walks over to the \nwindow and closes the shutters. Then, without saying a word, he turns to \nClaudia, grabs her in his arms and squeezes her. Claudia smiles, and \nplayfully yells \"Ouch!\" Then he goes to kiss her but Claudia tries to resist \nbut doesn't succeed. This little struggle stimulates Sandro and is enough to \nmake him forget all reserve. He drags Claudia on to the bed and forces her to \nlie down.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo, Sandro... Please... \n\n<b>\t\t\t\tSANDRO \n</b>\t\tWhy?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo reason why...\n<b> \n</b>But Sandro hugs her and kisses her again. This time, Claudia lets herself be \nkissed.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tWhat's the matter with you?\n<b> \n</b>Sandro only responds by kissing her again. Then Claudia yields. Sandro is \nangry and excited, as though he wanted to take his resentment out on Claudia.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro, wait a moment, just one moment... You \n\t\tseem like an entirely different person ...\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tAnd aren't you pleased?... That way you'll have \n\t\ta new kind of adventure.\n<b> \n</b>Wounded, Claudia pushes him away with all her might, and exclaims:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tWhat are you saying?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI was only joking, really... Can't I make a \n\t\tjoke? And now you've got to tell me why you \n\t\tdon't want to.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tOh, Sandro... I want everything you do. But...\n<b> \n</b>She stops short, then turns aside and reaches out to touch his jacket on the \nchair, looking into the pockets, not with curiosity but with a sense of love. \nSandro grabs her by the shoulders and forces her to turn around.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tBut what?\n<b> \n</b>Claudia remains silent, then gets up from the bed, and in a subdued tone of \nvoice, says:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tDid the hotel manager speak to you about that \n\t\tplace nearby?\n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes, she started to but I didn't feel like \n\t\tstaying to listen to what she had to say. If we \n\t\thad to listen to everybody...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tNo, Sandro... We should go. Besides, we \n\t\thaven't been in touch with anybody. Not even \n\t\twith Anna's father. We should have at least \n\t\tsent a wire or telephoned... let's be fair, he \n\t\tmust be feeling awfully lonely.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI don't doubt it. But at a time like this we're \n\t\tthe least suitable persons to be with him. And \n\t\tas far as telephoning him... Who knows where he \n\t\tis?\n<b> \n</b>There is a moment of silence, then Claudia starts heading towards the door.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tCome, let's go. Pack your things, and I'll get \n\t\tmine ready too.\n<b> \n</b>\n\n\n<b>***\n</b>It is evening. Sandro's car is pulling into the town of Taormina on its way \nto the San Domenico. It comes to a small square and passes by a group of men \nand women seated on the steps of an ancient ruin. They are dressed in evening \nclothes and are laughing and giggling. The car turns into the street of the  \nSan Domenico and stops in front of the hotel. A porter immediately comes out \nand opens the door. Claudia and Sandro get out and head towards the small \ncourtyard that leads into the foyer.\n\nThe lobby is full of activity and alive with people dressed in formal attire. \nClaudia is clearly intrigued by everything she sees: the surroundings, the \npeople, etc. Sandro approaches the reception desk as Claudia walks slightly \nahead, anxious to see what is going on. The sound of music is heard coming \nfrom one of the halls at the other end of the lobby. There is obviously a \nparty underway: further on, through a glass partition, couples are seen \ndancing. Suddenly, Claudia stops. Directly up ahead, she notices Patrizia. As \nsoon as she see Claudia, Patrizia comes to greet her, smiling.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tWell, I'm looking for somebody else and who do \n\t\tI find but you.\n<b> \n</b>Claudia smiles and they both kiss each other on the cheek.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHow are you?\n<b> \n</b>Instead of answering, Patrizia takes Claudia by the hand and leads her over \nto a bench along the side of the wall and sits down. Claudia remains \nstanding, somewhat annoyed by the crowd of people around her.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tShouldn't we try to find a quieter place? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tQuieter? Oh, yes, of course.\n<b> \n</b>Patrizia rises and leads Claudia out to a terrace that overlooks the entire \nbay which is dotted with lights. Claudia takes in the view but her attention \nis still focused on Patrizia. She waits from one moment to the next to have \nquestions thrown at her, but Patrizia remains silent. So Claudia turns around \nand looks at her as though to say: Come on, say what you have to say and \nlet's get it over with. But Patrizia smiles at her sweetly and only murmurs:\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tYou look so wonderfully tanned.\n<b> \n</b>Claudia feels relieved and presses Patrizia's hand, almost with a sense of \nrenewed friendship. Sandro appears from behind the glass partition and comes \nout on the terrace to greet Patrizia.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tAnd here's Sandro. \n\t\t\t(he kisses her hand)\n\t\tWhy don't you two go upstairs and change? \n\n<b>\t\t\t\tSANDRO \n</b>\t\tYes, we will.\n<b> \n</b>They leave the terrace and go through one of the halls towards the corridor \nthat leads to the rooms. Claudia walks ahead, with Patrizia and Sandro \nfollowing slightly behind. The hall is still packed with people.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tDid you manage to find good rooms?\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tThey didn't seem too good.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tYou should have told Ettore. He always manages \n\t\tto get what he wants.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tEttore must be fed up with me by now. \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tOh, no, not at all. And then you know very well \n\t\tthat he'll forgive you anything; just as long \n\t\tas you admit to him that you're a worse driver \n\t\tthan he is...\n<b> \n</b>Claudia looks at Sandro, assured by Patrizia's reply. She remains thoughtful \nfor a moment, then asks Patrizia:\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tHow do you manage to put up with all this \n\t\tconfusion? You always said people bore you. \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tYou shouldn't always take me seriously. \n\t\tActually, I'm used to it by now. First my \n\t\tmother and now my husband; both of them are \n\t\tlike dynamos. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tYour mother?\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tYes, even I had a mother. She was part \n\t\tAustrian, but she was still my mother. My \n\t\tchildhood was like a tennis match; they \n\t\tbounced me back and forth, here and there...\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tMy childhood, instead, was a very sensible one.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tWhat do you mean by sensible? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tIt means being without money.\n<b> \n</b>Patrizia and Sandro burst out laughing, and Sandro reaches out and ruffles \nClaudia's hair. They have arrived in front of a room that is situated on the \nground floor, and are greeted by a hotel clerk who is waiting for them with \nkeys in hand. The door is already open and Claudia is about to enter.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tSee you soon, then.\n<b> \n</b>Sandro nods yes and Claudia waves so long, as Patrizia takes her leave. \nClaudia enters the room behind the clerk, and Sandro follows. Claudia stops \nin the middle of the room, as the clerk goes through his various duties with \nprofessional exactitude: he turns on the lights, draws the window curtains, \nchecks to see if there are enough hangers in the wardrobe, then finally opens\nthe door to the adjoining room, into which he disappears. All his movements \nseem completely automatic.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\t\t(commenting under his breath)\n\t\tYou see? Just like a robot.\n<b> \n</b>Then Sandro enters the adjoining room, where the clerk has in the meantime \nturned on all the lamps and performed all the other little duties. Sandro \nstarts to undo his tie. Claudia remains standing in the middle of the room, \nlistening to all of Sandro's movements in the other room. A knock is heard at \nthe door of Sandro's room and Sandro is heard saying:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tCome in.\n<b> \n</b>A few seconds later, the porter also enters Claudia's room with her baggage. \nShe opens the valise and starts taking out her nightgown and other \nnecessities. Her gestures are slow and imprecise because fatigue has overcome \nher. Several moments pass, and Sandro appears at the door in his pajamas.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro, listen... Try not to get yourself too \n\t\tinvolved tomorrow.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tAren't you going to change?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tYou said you wanted to quit working for Ettore.\n<b> \n</b>Sandro shrugs his shoulders without, apparently, giving much thought to \nClaudia's statement. He goes into the bathroom saying:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tSure, that's what I said...\n<b> \n</b>The sound of the shower running is heard.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tWow, it's ice cold...\n<b> \n</b>Claudia goes up to the door adjoining the two rooms and stops at the doorway \nof the bathroom that is situated between the two rooms.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tSandro, I'm not coming down. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tWhy?\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI'm too sleepy.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tSleep is something one must learn to overcome. \n\t\tI learned how to do it when I was a child. I \n\t\tnever slept. And I had friends who even slept \n\t\tless than I did. The one who went to bed first, \n\t\tpaid a penalty. And we really didn't do \n\t\tanything. After seeing a movie, we'd go to a \n\t\tcafe and discuss things for a while... then \n\t\twe'd sit down on a bench somewhere... listen to \n\t\tsome drunkard... watch them putting up posters \n\t\tor manifestoes...or look at the sheep passing \n\t\tby... or go for a stroll around the market \n\t\tplace... Or else we'd go and wake up some girl \n\t\tin the neighborhood by standing in front of her \n\t\twindow and calling out her name...\n<b> \n</b>Claudia has been listening to Sandro with her head leaning against the door \njamb, her eyes closed. As soon as Sandro stops, she goes back to her bed and \nstarts undressing. Sandro comes out of the bathroom, wearing a bathrobe, and \ngoing over to Claudia, says in an affectionate tone:\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tYou're that sleepy, eh? What time do expect to \n\t\tget up tomorrow? \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tLate, very late.\n<b> \n</b>Claudia disappears into her bathroom, and Sandro returns to his room. After a \nwhile, his voice is heard.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tDid you know that when I was a boy I wanted to \n\t\tbe a diplomat? Can you imagine that! Me, a \n\t\tdiplomat? It's strange but I never thought I'd \n\t\tbe rich. I saw myself living in a rooming house, \n\t\tfull of geniuses...\n<b> \n</b>Claudia has slipped into her nightgown and returned to her room. Sandro is \nheard clearing his throat, and then continuing.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tInstead, I have two apartments, one in Rome and \n\t\tone in Milan. As far as genius goes, it's a \n\t\thabit I've never formed. What do you think of \n\t\tthat?\n<b> \n</b>Sandro reappears at the doorway, already half dressed. Claudia slides into \nbed and stretches herself out under the covers.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tI look at things differently... But maybe it's \n\t\tbest we talk about it some other time. Do you \n\t\tmind turning off that light over there?\n<b> \n</b>Sandro turns out the lamp on the table while Claudia closes the main switch. \nThe room is enveloped in darkness. Sandro approaches the bed and bends over \nClaudia to kiss her.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tGood night, my love.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tGood night. Tell me that you love me. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI love you.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tTell me once more. \n\n<b>\t\t\t\tSANDRO \n</b>\t\tI don't love you. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\t\t(smiling) \n\t\tI deserve it.\n<b> \n</b>Sandro goes towards the door, then turns and smiles.\n<b> \n</b><b>\t\t\t\tSANDRO \n</b>\t\tThat's not true. I love you.\n<b> \n</b>He returns to his room, closing the door behind him. He seems somewhat \nmeditative, as though the little discourse he has just delivered has in some \nway touched him deeply. He also seems a little sad. Then he puts on his tie \nand jacket, lights up a cigarette, and goes to the door.\n<b> \n</b>\n\n<b>***\n</b>Sandro comes out of his room and walks along through the corridors, heading \ntowards the reception halls down at the other end. Other persons are walking \nup and down the corridor in both directions.\n<b> \n</b>Sandro's attention is attracted by the figure of a woman who is coming his \nway at a rather quick pace. She is wrapped in a tight-fitting evening dress \nthat emphasizes the various harmonious parts of her body. Sandro looks at \nher. He seems to recognize her but isn't quite sure who it is. The girl \npasses alongside of him and apparently she too has the same impression, for \nshe gives him a look that lasts much longer than it normally would between \ntwo complete  strangers. She stops in front of a door but before entering, \nshe casts another glance at Sandro, who suddenly recalls that she is the same \nwoman who had almost provoked a riot in the streets of Messina and who was \nforced to take refuge in a men's shop. There is a moment of hesitation, then \nthe girl opens the door and disappears into the room. Sandro continues on \nahead until he reaches the bar, which is still very crowded. \n\nEvening clothes of all kinds. Shiny silks. Jewels dangling from wrists, necks \nand ears that are either white or bronzed by the sun. Shoes of silver or \nlustrous black. Headdresses of many women -- high, cropped or short and \nbobbed. Men with hair well groomed but also frequently mussed. A vast, \ntumultuous wave of people, all wealthy and respectable, talking, laughing and \ncarrying on as though the whole wide world was right there and everybody in \nit was like them. \n\nSnatches of witticisms. Faces of passing people. Hands reaching out for \nglasses. The expressions on the face of the barman, smiling and indifferent. \nThe sad, sullen face of the cloakroom attendant. The dumbfounded look on the \nface of a thirteen-year-old elevator boy.\n\nSandro feels very much at home in this milieu. One thinks so little, forgets \nso easily. And things are so conveniently ignored, beginning with one's own \nself. Sandro moves through the crowd, here and there. Standing next to the \norchestra is a girl in black pants, singing strange songs in a soft, \nsuggestive voice. \n\nSandro encounters Ettore. As soon as he sees Sandro, Ettore comes over and \nplaces an arm around his shoulder, almost in the form of an embrace.\n<b> \n</b><b>\t\t\t\tETTORE  \n</b>\t\tWell, finally... Come, I'll introduce you to my \n\t\tfriends.\n\n<b>\t\t\t\tSANDRO \n</b>\t\tI want to take a look around first... I'll join \n\t\tyou later.\n\n<b>\t\t\t\tETTORE  \n</b>\t\tSay, I hope it's understood that starting \n\t\ttomorrow morning, I'll need to have you around. \n\t\tIf you don't give me some figures to work with, \n\t\thow can I proceed?\n<b> \n</b>Sandro agrees with a nod of his head. But he is thoughtful and somewhat \nsaddened. As Ettore returns to his friends with whom he had been speaking and \nlaughing, Sandro looks at him almost with a sense of rage.\n\nThen he goes back to the bar and orders something to drink. He is not aware \nthat the girl from Messina is just a few yards away and is watching him. She \nis extremely tanned, extremely voluptuous, and extremely beautiful.\n\nSandro moves away from the bar with the glass in his hand. He passes in front \nof a semi-dark room and takes a peek inside: a television set is turned on \nbut nobody is watching it. Sandro is restless. He comes to a terrace and \nstops to look down at the illuminated docks below. The headlights of cars \npassing by fan out across the road that runs along the shore of the sea. With \nan angry gesture, Sandro finishes his drink, gulping the whiskey down in one \nfast swallow. He squeezes the empty glass in his hand as though he had wanted \nto crush it.\n<b> \n</b>\n\n<b>***\n</b>The early rays of dawn are faintly seen coming through a window at the far \nend of the corridor. Claudia comes rushing out of her room and runs over to \nPatrizia's door. She knocks, then without waiting for a response, she enters.\n<b> \n</b><b>\t\t\t\tCLAUDIA \n</b>\t\tPatrizia... Patrizia ... Where's Ettore? \n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tI imagine he must be inside sleeping. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tWould you please see if Sandro is with him? \n\t\tHe's not in his room. I'm sorry to disturb you.\n<b> \n</b>Patrizia gets up out of bed and goes into the adjoining room.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tEttore... \n\n<b>\t\t\t\tETTORE  \n</b>\t\tWhat is it?\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tNothing, nothing  at all. I was just looking \n\t\tfor Sandro.\n\n<b>\t\t\t\tETTORE  \n</b>\t\tAnd you expect to find him in here? Go and ask \n\t\tClaudia.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tYes, yes, of course. \n\nShe returns to her room. \n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tPatrizia, I'm afraid.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tMore or less, we are all afraid. Especially at \n\t\tnight.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tI'm afraid that Anna has come back. I feel \n\t\tshe's back, and that they're together.\n\n<b>\t\t\t\tPATRIZIA \n</b>\t\tBut what's gotten into you?... We would have \n\t\tknown. Sandro must be out in the garden \n\t\tsomewhere, taking a breath of fresh air, or \n\t\twatching the break of dawn. It would be a lovely \n\t\tsurprise indeed if he turned out to be the \n\t\tsentimental type.\n<b> \n</b>Claudia sinks down into a chair, weak and exhausted.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tNow, listen. For God's sake, try not to let \n\t\tyourself become obsessed with that idea. Go to \n\t\tyour room and get back into bed.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tJust several days ago, the thought of Anna \n\t\tbeing dead would have made me sick. And now, I \n\t\tdon't even cry, I'm afraid she might be alive. \n\t\tEverything is becoming so damned simple and \n\t\teasy, even to deprive one's self of pain and \n\t\tsuffering.\n<b> \n</b><b>\t\t\t\tPATRIZIA \n</b>\t\tYou should never wish to get melodramatic over \n\t\tanything.\n\n<b>\t\t\t\tCLAUDIA \n</b>\t\tYes, you're right. I'm sick and tired of being \n\t\tlike that.\n<b> \n</b>Claudia gets up and leaves the room. She continues walking down along the \ncorridor, checking here and there. But the hotel is deserted. There are still \na few lights  on in  the reception hall but not enough to illuminate the \nplace adequately. Finally, she reaches the main hall and stops. The only \nsigns of last night's party is a certain disorder in the placement of the \narmchairs and ashtrays filled with cigarette butts. Even the main hall seems \ncompletely deserted. But all of a sudden, Claudia becomes aware of something \nmoving on a sofa at the far end of the room. She takes a few steps, walking \nsilently over the thick carpet, so as to get a better look. There seems to be \na slight movement among what appears to be a jumbled pile of male and female \nclothes, partly hidden from view by the back of the sofa. Claudia goes up \nstill closer because she is not able to see clearly what or who it is. Only \nthat she has the impression of having seen that suit before... A man's suit. \nShe is now able to distinguish what it is: a couple embracing and kissing.\n\nClaudia approaches still closer. She is now just a few steps away. Little by \nlittle, as she advances, her face takes on such a painful look of \nastonishment that she appears almost petrified. She hesitates and bumps up \nagainst a little table that makes a small noise. The couple on the sofa come \nout of their embrace and look up. The man is Sandro; the woman is the girl \nfrom Messina. Sandro looks at Claudia as though he were filled with terror. \nThe girl, instead, seems quite amused. Claudia remains for a moment, staring \nat them as if she can't believe her own eyes, and is incapable of making any \nmove. Then, she abruptly turns away and starts running. She runs through the \nmain hall, the reception room, the courtyard, and out into the street.\n<b> \n</b>There is not a soul to be seen. No sound. The day is breaking clear and \nserene.\n\nClaudia comes over to a bench with its paint all peeling off, but she doesn't \nsit down. Transfixed, and with her eyes almost wide open, she stares out at \nthe sea, and at the waves which are also a mystery unto themselves.\n<b> \n</b>Footsteps are heard approaching from behind, but Claudia doesn't even bother \nto turn. It seems that nothing could distract her from that painful state of \nshock which is written all over her face. A young laborer in overalls, \ncarrying a small bundle under his arm, passes by, glancing at her with a look \nof curiosity. He walks a few paces ahead, then turns around to look at her \nagain as though she were some kind of strange creature.\n\nThe sound of footsteps dies down in the distance, and everything is silent \nonce more. There is only the gentle lapping of the waves as they roll up \nagainst the shore. Claudia is completely oblivious to the scene. Several \nbirds swoop down emitting their small cries. A sudden but almost \nimperceptible sea breeze ripples Claudia's hair.\n\nOther footsteps are heard approaching: slow, heavy. Claudia is still not \nstirred from her thoughtful, trance-like state. The footsteps come to a halt \ndirectly behind her. It is Sandro. He appears thoroughly crestfallen. He \ndoesn't even have enough courage to look at Claudia. His face is worn and \ndisfigured, like that of a tired old man. And he lets himself fall limp onto \nthe bench. They both remain completely motionless, without looking at each \nother. And detached: Claudia standing, Sandro seated. Behind them, the \nskeleton of cement. Further off, the sea.\n\nGradually, Claudia turns her head towards Sandro. Her eyes are filled with \ntears. She looks down upon him as though he were something that greatly \npained her. She moves up closer to the bench. Sandro doesn't budge an inch. \nClaudia reaches out to him with her hand, then slowly, gently, and with an \noverwhelming sense of desperation, she caresses his hair.\n<b> \n</b><b> \n</b><b> \n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Avventura, L' (The Adventure)</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Michelangelo Antonioni\" title=\"Scripts by Michelangelo Antonioni\">Michelangelo Antonioni</a>  <a href=\"/writer.php?w=Elio Bartolini\" title=\"Scripts by Elio Bartolini\">Elio Bartolini</a>  <a href=\"/writer.php?w=Tonino Guerra\" title=\"Scripts by Tonino Guerra\">Tonino Guerra</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Avventura, L' (The Adventure) Script.html#comments\" title=\"Avventura, L' (The Adventure) comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:59:21.089335"}