{"title": "Awakenings", "film_link": "/Movie Scripts/Awakenings Script.html", "script_link": "/scripts/Awakenings.html", "info_raw": "\n\nAwakenings Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Steven Zaillian\nGenres  Drama\nScript Date : October 1989\n\nRead \"Awakenings\" Script\n\n\n", "script": "\n AWAKENINGS\n\n\n\n    Scree nplay by\n\n   Steven 2ai11Ian\n\n\nBased on t he Book by\n\n    Olive r Sac ks\n\n\n\n\n                        OCTOBER 2, 1989\n                                         (BLUE)\n                        REV .10/1 3/89\n                        REV.1 0/16/ 89   (PINK)\n                        REV.1 0/25/ 89   (YELLOW)\n                        REV.1 1/6/8 9    (GREEN)\n                        REV.1 1/10/ 89   (GOLDENROD\n                        REV .11/1 4/89   (SALMON)\n                        REV .11/1 6/89   (LAVENDER)\n                        REV .11/2 2/89   (CHERRY)\n                        REV .12/4 /89    (WHITE)\n                        REV.1 2/5/8 9    (BLUE)\n                        REV.1 2/12/ 89   (PINK)\n                        REV .12/ 13/89   (YELLOW)\n                        REV. 1,2/15/89   (GREEN)\n\n 1. A dusty deserted street - saloon, livery stable, sunset.\n Only there is something unsettling about it all. The colors\n are too muted and the angles not quite in perspective. Pulling\nslowly back eventually reveals the edges of a narrow wooden\npicture frame ...\n\nINT. BEDROOM - NIGHT - 1930\nDrifting away from the painting and slowly across a room.\nAcross Venetian blinds, open, letting in moonlight, across\nintricate handmade wooden models, dime novels and comic books,\nacross the arm of a metronome gently slapping back and forth,\nand settling finally on a small hand writing slowly and\ndeliberately, over and over, in synchronization, it seems, to\nthe rhythm of the metronome, the word, \" L E O N A R D . \"\n\n2.   INT. DINING ROOM - MORNING - 1930\nThe pendulum of a clock. An adult hand placing a bowl of\ncereal on a table. Leonard, ten or eleven, waits a moment for\nthe adult to leave, grasps his spoon, and manipulates it from\nbowl to mouth in time with the soft regular rhythm of the\nclock.\n\n3.   EXT. STREET - NEW YORK - MORNING - 1930                      3.\nSchoolbooks slung over their shoulders, Leonard and another boy\nhis age, a classmate, move along a street.\nAll around them are \"visual rhythms\" - lines in the sidewalk,\nthe even placement of trees, the sunlight breaking through the\nbranches above them - and somewhere unseen, the rhythmic\npounding of an elevator train.\nAs they climb a fence, a pocket watch, Leonard's, falls to the\nground.\n\n                                                                  4.\n4.   INT. CLASSROOM - DAY - 1930\nAn adult hand chalking the words of a poem on a blackboard.\nChildren at desks dutifully transcribing the lesson.\nAll but one. Leonard. Whose hands are trembling slightly and\nwhose paper is blank. There is a noticeable lack of rhythms.\nA cold silence. The broken watch rests on his desk.\nThe boy from the train, glancing at Leonard, begins gently\ntapping the end of his pen against his desk. Leonard, \"guided\"\nby the cadence of his friend's tapping, begins to write.\n\n(o   The teacher's hand at the blackboard hesitates. Distracted by     4.\n     the rhythmic noise, he traces it to the offender and silences\n     him with a look.\n                            \\      '\n     Without the rhythm, and without, apparently, inner natural\n     rhythms to replace it, Leonard's hand begins dragging the pen\n     across the paper, forming vague scrawl, each word less defined\n     than the last, until they begin melding together into what\n     resembles nothing so much as a child's rendering of ocean\n     waves.\n     The teacher resumes chalking on the board. The boy from the\n     train begins tapping his pen again, and, \"guided\" again by the\n     rhythm, Leonard is able to give definition to the \"ocean\n     waves,\" to form recognizable letters.and words.\n     The teacher hesitates again and glares at the boy making the\n     irritating noise. The boy stops tapping and Leonard's writing\n     again becomes formless.\n\n                                                                       5.\n     5. INT. CLASSROOM.- LATER - DAY - 1930\n     The finished poem on the blackboard. The sounds of children at\n     play on the schoolyard. The teacher, alone in the classroom,\n\no    at his desk grading the penmanship lesson.\n     He circles offending errors on the last page of the last\n     composition book. He scribbles a grade opposite the student's\n     name in a grade book. He notices the absence of a grade in\n     Leonard's column.                         .\n     Leonard's desk. The teacher locates the missing composition\n     book buried under textbooks. He takes it back to his own desk,\n     opens it, and stares curiously at the last lesson, the poem, or\n     rather Leonard's illegible representation of it.\n     He considers earlier lessons in the book. He begins to see in\n     the script a pattern of deterioration. He reaches the last\n     entry again and stares at the few recognizable words drowning\n     In \"the waves.\"\n                                   <\n                                                                       6\n     6.   INT. LEONARD'S BEDROOM - DAY - 1930 - WINTER\n     The painting on the wall. The intricate wooden models and dime\n     novels. The Venetian blinds, closed, shutting out sunlight.\n     Voices, barely audible, from somewhere else in the house:\n                          BOY'S VOICE\n                When can I see him?\n                          WOMAN'S VOICE\n                When he's well.\n\n                                       REV.12/15/89 (GREEN)   Pg.3\n\n6.C0NT.              BOY'S VOICE                              6.CONT,\n           When will he be well?\nAfter a moment --\n                     WOMAN'S VOICE\n           I don't know.\n-- and the sound of a door closing.\nA small twisted hand lifts a slat of the Venetian blinds\nrevealing the snow-patched street below. Leonard's friend,\ncrossing it, glances back . . . then disappears around a corner.\nAnd the small gnarled hand lets the slat slide down,\nextinguishing the single ray of light.\n\n                                             FADE TO BLACK\n\n\n6A.   EXT. BAINBRIDGE -HOSPITAL - THE. BRONX - DAY - 1970 .        6A\nTight on the face of a man (SAYER), late thirties, glasses,\nstaring up at the face of a building, imposing in its\ninstitutional dullness.\n\n6B.    INT. LOBBY - BAINBRIDGE - DAY                               6B.\nA dim, sleepy cavern of a lobby. No one but a switchboard\noperator thumbing through a magazine. Echoing footsteps reach\nher station and she glances up and at the man from outside.\n                                   i\n                     OPERATOR\n           Yes?\n\n7.    INT. ADMINISTRATION OFFICE - BAINBRIDGE - DAY\nHe seems uncomfortable. Perhaps it's the suit. Or the place.\nOr the situation. Or the hard straight-backed chair he's in.\nWhen he does finally speak, it's with great sincerity --\n                     SAYER\n           When you say people ... you mean\n           living people,                 .\nBehind an old oak desk, the hospital's Director glances over\nto its Chief of Medicine, Dr. Kaufman, with a look that seems\nto wonder, As opposed to what?\n                     DIRECTOR\n           Living people, yes.   Patients.\n\n                                   REV.12/15/89 (GREEN)        Pg.4\n\n 7.C0NT.                                                    7.\n  There's some mistake. And Sayer's chair begins to feel more *\nuncomfortable. He tries to clear up the confusion -\n                                                                      *\n                      SAYER\n          I ' m here for the research                                 *\n          position . . . in your neurology                            *\n          lab.\n                     DIRECTOR\n          Neurology lab?\nHe doesn't laugh at Sayer, just at the thought of it.\n                    DIRECTOR\n          We have an x-ray room.\nSayer tries to share the Director's amusement with a good- *\nnatured smile, but doesn't really understand it. Kaufman seems *\nto have less time for this, and in plain English, unadorned -  *\n                    KAUFMAN\n         - The-position-ds-Staff-^Neurologist.            .\nSayer looks like a man who's just learned that everything he *\nknows about the world is wrong.         f\n                     DIRECTOR\n                (pause)\n          A doctor ... doctor.\nThe Director refers to stapled sheets of paper in his hands,\nSayer's resume.\n                     DIRECTOR\n          The Camel Institute. Tell me                                *\n          about that, anything with patients                          *\n          there? Or . . .                                             *\n                     SAYER\n                (burying it)\n          Earthworms.\nThe Director isn't sure he heard right.\n                    DIRECTOR\n          Sorry?                               ,\n                                               >\n                     SAYER\n          It was an immense project. \"\n          I was trying to extract a decigram\n          of myelin from four tons of\n          earthworms.\n\n                                        REV.12/15/89 (GREEN)         Pg.5\n\n\n     7.C0NT.              DIRECTOR                                          7.\n                      (pause)\n                Really.\n                         SAYER\n               I was on it for five years.\n               I was the only one who really\n               believed in it. The rest of them\n               said it couldn't be done.                         t\n\n                           KAUFMAN\n               It can't.\n                         SAYER\n               Well, I know that now.       I proved\n               it.\n    The director offers a slow tentative nod before consulting the\n    resume again.\n                         DIRECTOR\n               Maybe before. At Saint Thomas.\n                    (Sayer is already\n                     shaking his head no)\n               All research. Earth - ?\n                          SAYER\n               Pigs brains . . . they·re quite\n               similar to human brains.\n                         DIRECTOR\n                    (hopefully)\n               Are they?\n                           SAYER\n               Oh, yes . . . three years.\n    As the Director retreats back to the resume, hoping against\n    hope of finding in it something germane, Sayer glances away to\n    a window. He wishes he were outside it. He has no business\n    being here. He should leave.\n                         SAYER\n               Excuse me, I made a mistake coming\n               here. Clearly you're looking for\n               someone with more of a clinical\n               background.\n    He stands up to leave. Kaufman stands to see him out.      But the       *\n    director keeps searching the resume.\n\n\nQ\n\n                                        REV.12/15/89 (GREEN)        Pg.6\n\n7.C0NT.              SAYER                                      .    7.\n           I've taken enough of your time.\n           You must have a hundred applicants\n           more suitable.\n                     KAUFMAN\n           Thanks anyway.\n                     DIRECTOR\n           Back in medical school ...\nKaufman shoots the Director a look that says, No, we're not\nthat desperate.\n                      DIRECTOR\n           I mean, you couldn't have\n           graduated without some clinical\n           experience. .\nSayer hesitates. And eventually manages sort of a shrug and a\nn od .,            v'\n\n                     DIRECTOR\n           Well, there we are, doctor.\nKaufman can't believe it, but is sent back a look that says,\nWe have no choice. The Director gets up out of his chair, and,\nsmiling broadly, extends his hand to Sayer. Which unsettles\nSayer. Which in turn unsettles the Director.\n                     DIRECTOR\n                (not far from                 v\n                 begging)\n           You do want the job, don't you?\nSayer isn't so sure.   He thinks about it long and hard . . .\n\n8.   INT. CORRIDOR   - BAINBRIDGE - DAY                                8.\nMoving along a corridor crowded \"with patients, some ambulatory,\nsome in wheelchairs, \"living people\" living with profound\nneurological disease.\n                     ANTHONY O.S.\n           Spent much time in chronic\n           hospitals, doctor?\nA patient approaches, and, passing Sayer and the orderly who's\nescorting him (ANTHONY), offers -\n                     FEMALE PATIENT 1\n           Hello. Hello. Hello. Hello . . .\n\n                                   REV.12/15/89 (GREEN)               pg.7\n\n\n8.C0NT.               ANTHONY                                          8.\n                 (to Sayer)\n           You'd remember.\n                     SAYER\n           I guess not.\nAs they pass an old patient in a wheelchair -\n                      ANTHONY\n           Hey, how you doing?\n                 (calling to someone\n                  down the hall)\n           Dr. Sullivan.\nStaying on the old patient, he eventually manages, too late -\n                     OLD PATIENT\n           Fn ...\n           ie\nDown the hall in an alcove, Dr. Sullivan glances up long\nsufferingly from-a.patient~with'.an .Ouij a-board who !.s mumbling,          *\ncomplaining, unintelligibly. Anthony and Sayer arrrive.\n                     ANTHONY\n           Dr. Sullivan, this is Dr. Sayer;\n                     ' ': : '                      '   -'.\n There's a kind a \"deadness\" in Sullivan's eyes and voice; he's\nbeen here too long.\n                     SULLIVAN\n          Not the neurologist, that'd be\n           asking too much. You're not the\n           neurologist.\n                     SAYER\n           I think I am.\nSayer extends his hand. Instead of shaking it -\n                     SULLIVAN\n           Well, come on, Anthony, get him a\n           coat for Christ's sake.\n- Sullivan thrusts his clipboard into Sayer's hand.\n9.   OMITTED                                                                9.\n10. INT. DAYROOM (A) - DAY                                              10.\nA woman in a wheelchair uttering high-pitched screams (FEMALE\nPATIENT 2 ) . Sayer in a lab coat trying to calm her.\n\n                                  REV.12/15/89 (GREEN)        Pg.7\n\n10.CONT.            SAYER                .                    10.\n          They're just pencils, pens.\nHe tries to prove it to her by removing one of them from the\npocket of his white coat. Screaming louder at the sight of it,\nshe tries to protect her face with her hands like a boxer being\nbeaten senseless.\n\n                                        v\n11.   INT. DAYROOM (B) - DAY                                  11.\nA man in his sixties confronts Sayer with an announcement in a\nloud commanding voice -\n                       MALE PATIENT 1\n           X was born in I911f in\n           Kinasbridae, New York. I came\n           here in July of 1955. Prior to\n           July of 1955. I resided a£ the\n           Brooklyn Psychiatric Centerf\n           Brooklyn. New York. Prior to\n           thatP I was a person. And you.\n           sir.- i Who the* hell >are.*v.ou?       .\n\n12.   INT. DAYROOM (C) - DAY                                     12.\nStepping around a wheelchair, Sayer finds in it an elderly\nwoman, nicely dressed, her hair done-up, a ribbon in it.\nGlancing at the chart in his hand -\n                     SAYER\n           Mrs. Cohen?\n                     MRS. COHEN\n           He·s here?\nShe smiles, glances around. Sayer hesitates, uncertain who she\nmeans.\n                      SAYER\n           I 'm here.\n                 (pause)\n           To examine you.\n                      MRS. COHEN\n           Oh, no, I ' m leaving today. My\n           son's coming to take me home.\n\n(6   Confused, Sayer tries to find a discharge form among the papers\n     on the clipboard. Unsuccessful, he excuses himself from her\n     and crosses the room to a nurse.\n                           SAYER\n                 Excuse me. Mrs. Cohen's son.\n                 He's coming today?\n                           NURSE 1\n                 I wouldn't bet on it, he hasn't\n                 for twenty years.\n     The nurse turns away. Sayer crosses slowly back to Mrs. Cohen,\n     trying to find the words to tell her. He doesn't have to; his\n     discomfort does it. Her hand slowly reaches up and pulls the\n     ribbon from her hair.\n     13.    OMITTED                                    .\n                                                   v\n\n\n     14.    INT. EXAMINATION ROOM/OFFICE- LATER - DAY\n     Silence. Institutional beige walls. Glass cabinets, locked,\n     containing medical instruments. A metal examination table with\n     leather straps.\n     Sayer alone at one of three old desks in the large room, still\n     unsettled from the experience with Mrs. Cohen. Eventually, he\n     gets up, crosses to a window and tries to open it.\n     It's jammed shut, painted shut perhaps, but finally gives way,\n     sliding up. He lets the air from outside wash over his face as\n     he stares out absently at children on an elementary school\n     playground beyond a debris-strewn field.\n                           MISS COSTELLO O.S.\n                      (a matter of fact)\n                 It gets easier.\n     Sayer turns to the voice, to Miss Costello, the hospital's head\n     nurse, a veteran of this place, a woman who has seen it all.\n     She's standing in the doorway.\n                           MISS COSTELLO\n                 You don't think it will, but it\n                 does.\n     A moment and she A urns and leaves.\n                      t\n\n     14A.   EXT. TENEMENT (LUCY'S) - ESTABLISH - DAY\n\n15.    INT. TENEMENT - NEW YORK.- DAY                                  1\nThe needle of a Victrola clawing at the endless music-less\ninner bands of a 78 . . .                                .*       .\nCold eggs and toast and prescription medicine on a kitchenette\ntable. A puddle of coffee on the floor. Ceramic shards, a\nbroken cup. .\nAn old woman on her knees, eyes closed, arms tangled in an\naluminum walker, limp and stiff at once somehow, like the limbs\nof a discarded marionette. Beyond her, beyond a threshold, a\nshuttered living room. Furniture from another era and the\nclutter of a lifetime.\nA shadowy figure in a wicker wheelchair near the Victrola.\nAnother old woman, with spindly limbs, profoundly afflicted and\npreposterously still. The back of her head is flat and bald,\nthe result of lying supine upon it for much of several decades.\nOn her passive face rest round wire-rim glasses. Insane or\nretarded and unaware of the dead woman, she mumbles, just\nbarely audibly, a melody.\n                     SAYER'S VOICE\n           Can you hear me?                 .\n\n                                                                      16\n16.   INT. EXAMINATION ROOM/OFFICE - BAINBRIDGE - DAY\nDistant music of children's laughter. Perhaps real, emanating\nfrom outside; perhaps imagined, remembered, playing in a remote\nregion of the woman's damaged mind. Arrested of all movement,\nshe stares, transfixed, at the blades of a fan.\n                      SAYER'S VOICE\n           Do you know where you are?\n                 (nothing back)\n           Do you remember being brought\n           here?\n                 (nothing back)\n           Do you know what has happened?\nIf she does, she gives no indication. No word or gesture. No\nchange of expression on her mask of a face. She is elsewhere\n(or nowhere), cut adrift by her illness, living in a private\nworld (or hell).\n                    SAYER'S VOICE\n          Can you hear me?\nSayer, wearing a white lab coat, tries to read her eyes.\nBehind thick lenses, uncleaned for weeks or months, the eyes\nare inscrutable.                                         .   ··\n\n                                        REV. 12/5/89 (BLUE)       Pg.-lO\n16.CONT.                                                            16.\nSayer reaches to her face and carefully pulls the glasses from\nit. He cleans them with a flap of his lab coat -- they are\nloose, bent out of shape*-- and gently slides the temples back\nover her ears.\nHe turns away from her and types at a manual Underwood. The\nform in the machine, at the top, reads -- BAINBRIDGE HOSPITAL /\nADMISSIONS / CONSULTATION REQUEST / NEUROLOGY. Sayer types in\na lower section headed -- FINDINGS / DIAGNOSIS.\nHe turns back in his chair to find the woman doubled-over in\nher wheelchair, one arm very close to the floor, the hand\nclutching the glasses. She is not moving, but she has moved.\nThat, or she is dead.\nSayer rights her, takes the glasses from her hand and slips\nthem back onto her face. He studies her for a moment, and for\nthat moment remains as still, as entranced, as her.\nHe takes the glasses from her face again and sets them on the\nfloor. He waits. She doesn't retrieve them. He picks them up\nand holds them out to her. She doesn't move to take them. He\nlets go of them and she lunges forward, catching them the\ninstant before they hit the floor. Sayer just stares.\n                       SAYER«S VOICE\n            Her name is Lucy Fishman . . .\n                                                              r\n\n16B.    INT. CORRIDOR OUTSIDE EXAMINATION ROOM - LATE AFTERNOON   16B.\nDr. Kaufman, the hospital's Chief of Medicine, notices a number\nof patients lined up in their wheelchairs as he passes them on\nhis way into Sayer's examination room -\n                        SAYER'S VOICE\n            She was found by neighbors with                               *\n            her sister, several days after the ,\n            sister had died . . .\n\n17.    INT. EXAMINATION ROOM - LATE AFTERNOON                       17.\nThe same room as before. The same woman. All that has changed\nis the light. It's late afternoon.\n                      SAYER (CONT'D)\n           According to the neighbors,                                    *\n           she's never set foot outside her                               *\n           apartment, has no other living                                 *\n           relatives, and has always been the                             *\n           way she is now - without any                                   *\n           comprehension or response.                                     *\n\nKaufman tries to feign interest. He glances to the others         1\nSayer has summoned to the room -- two other doctors, Tyler and\nSullivan, and Miss Costello.\n                       SAYER\n          And yet . . .\nWithout any warning whatsoever Sayer tosses a tennis ball at\nher. Her hand suddenly jerks up out of her lap and catches it.\nAnd stays there, stiff, still.\nSayer is delighted but the expression on Kaufman's face is that\nof one who has long ago learned and tired of simple card\ntricks. Dismissing the phenomenon --·\n                       DR. KAUFMAN\n          A reflex.\n                    SAYER\n          If she batted it away I might call\n          that a reflex. She doesn't bat it\n          away, she catches it.\n                    DR. KAUFMAN\n -        It's still a reflex.\n         ..·.    :        · ·' .· \" .'\n                     SAYER\n          I'm sorry, if you were right I'd\n          agree with you.\nKaufman, understandably, takes some offense at the comment.\nSayer, however, is unaware that he has caused any.\n                     SAYER\n          It's as if . . . having lost all\n          will of her own on which to act,\n          she borrows the will of the ball.\nAwkward silence.    Eventually--\n                     DR. TYLER\n          The \"will of the ball?\"\n                       .\nSayer nods. Kaufman and the other doctors concur with glances\nthat the theory and theorist are absurd.\n                       DR. SULLIVAN\n          Excuse me.\nSullivan has better things to do and leaves the room.   So does\nTyler. Kaufman and Miss Costello remain.\n\n                                 DR. KAUFMAN                                 .       I\n                            (hopefully)\n                      You're trying to make a good\n                      impression. That's it, isn't it?\n                      You're still settling in.\n           Sayer isn't sure if he should agree or not.   He does neither.\n                                DR. KAUFMAN\n                      Miss Costello, you'll see that Dr.\n                      Saver's patients waiting out there\n                      are rescheduled for tomorrow?\n                                  MISS COSTELLO\n                      Yes, sir.\n                                 DR. KAUFMAN\n                      Good night.\n           Sayer watches Kaufman leave. So does Miss Costello. Lucy,\n           looking less like a woman than a Diane Arbus photograph of one,\n           doesn't.\n\n           18.   EXT. PARKING LOT - BAINBRIDGE - LATE AFTERNOON\nC'\\      Sayer climbs into his Toyota and, as he buckles his seat belt,\n -*©     recites in a mumble to himself --\n                                    SAYER\n                      One . . .                                                  .\n                                                     *\n                              (he turns the key)\n                      Two . . .\n                              (puts on sunglasses)\n                      Three . . .\n                              (releases the brake)\n                      Four . . .\n                              (shifts out of\n                                'park')\n                                               .\n                      Five.\n           Just as he's depressing the accelerator, someone raps on his\n           window. He slams on the brakes. Miss Costello's face appears\n           at the window. Recovering, Sayer rolls it down.\n                                SAYER\n                     What'd I forget?\n                               MISS COSTELLO\n                     I just wanted to say to you I\n                     preferred your explanation.\n    ()   It's unclear whether he knows what she's referring to.\nr\n\n                         MISS COSTELLO\n               And that I'll look after things\n               for you until you've \"settled in.\"\n               Good night, doctor.\n    She leaves. He stares blankly out after her, then at his\n    dashboard. To it eventually, quietly --\n                            SAYER\n               Thank you . . .\n    He glances to his rear view mirror and can see her walking away\n    toward her car. To the reflection --\n                          SAYER\n               Thank you very much.\n\n    18A. EXT. SAMMY'S FISH GROTTO - ESTABLISH - NIGHT             18A.\n\n    19.   INT. SAMMY'S GROTTO, CITY ISLAND, THE BRONX - NIGHT     19.\n    Sayer at a table eating dinner alone. He should've brought\n    along something to read. He glances at the little \"Catch of\n    the Day\" notice on his table for the tenth time, then absently\n    in at an eel in a fish tank, which seems to be peering back out\n    at him.\n                          SIDNEY V.O.\n               I am not mad ... not mad . . .\n\n    20.   EXT. SCHOOLYARD & BAINBRIDGE HOSPITAL - DAY                 20.\n    A tether ball dangling from a rope, resting against a pole.\n    The chains of a swing. Pigeons scavenging scraps on the\n    asphalt of the elementary school playground, deserted.\n·\n                          SIDNEY V.O.\n               I know the difference between what\n               is real and what is not . . .\n    Beyond a chain-link fence, across the field, on the roof of one\n    of Bainbridge's brick buildings, peering down from the edge of\n    it, coat over his smock, hat on his head, an elderly man.\n\n    21.   INT. SIDNEY'S DAYROOM - DAY                                   21.\n    Tight on the elderly man's face.\n                         SIDNEY\n               The voice was real.\n\n                                     REV.12/12/89 (PINK)      Pg.14\n21.C0NT.                                                          21.\nSayer nods in agreement though he is not altogether as certain\nof tne claim. They are in a ward crowded with many patients\nwho are mad, obviously and irretrievably so.\n                     SAYER\n           What did the voice say?\n                     SIDNEY\n           \"Mr. Titch, get your coat and hat,\n           go up to the roof and jump off.\"\n                     SAYER\n           Did you recognize it as belonging\n           to a person? Or was it just a\n           voice?\nSidney considers Sayer suspiciously ... then smiles slyly.        *\n                                                                       *\n                     SIDNEY\n           You don't deny it was you.                                  *\n                      SAYER\n                                                                       *\n           Me?\nSayer is taken aback. As is Sidney. One of them, and Sidney\nbelieves he knows which, is lying or crazy.\n                  ' ' · * SAYER '        .\n            I do deny it. It wasn't me.\n           It wasn't real.\n                 (pause)\n           We've only just now met, sir.       »\nSidney, suddenly completely disoriented, withdraws.\n                       SIDNEY\n           If that's true . . . I'm in a\n           predicament.\n\n22.   INT. STAFF CAFETERIA - BAINBRIDGE - DAY                    22.\nSayer in line with Drs. Tyler and Sullivan, both younger than      *\nhimself. He seems distracted, Sayer, lost in the color of the\nbeets on his tray. Or a thought.\nLike George telling Lenny again about the rabbits:\n                     DR. SULLIVAN\n                                                                       *\n           We'd be high up - 40th, 50th\n           floor, nice midtown view - suite                            *\n           of offices, carpeted, good-looking                          *\n           receptionist -                                              *\n\n                                            REV.12/12/89 (PINK)        Pg.15\n\n         22.CONT.            DR. TYLER                                    22\nfp\\    ·        Aquarium in the waiting room,\n\\_J)               George.                          ,\n                               DR. SULLIVAN\n                   We could have all that ... but\n                   we'd miss all this. We'd miss        the\n                   wards.\n                               DR. TYLER\n                   The smell of them.\n                               DR. SULLIVAN\n                   We'd miss this place -\n                         (this cafeteria)\n                   We'd miss this . . .\n                         (the plate of mush as\n                          it's set down onto\n                          his tray)\n                   Whatever this is.        .\n                             SAYER\n                   Ye ....\n                     s\n        Sayer glances up at them, having paid attention to nothing\n        they've said, and nods at some other thought.\n               .        '    SAYER\n                   Yes . . .    ,'\n        He leaves his tray where he stands, and heads out of the\n        cafeteria.                                 v\n\n\n        23.   INT. SIDNEY'S DAYROOM - DAY                                23.\n        Sayer back with Sidney.\n                              SAYER\n                   Did you see me when-1 \"spoke?\"\n       Sidney thinks about it, tries to remember, to summon back the\n       moment in question, to picture it exactly as it happened, or\n       didn't happen.\n                             SIDNEY\n                   No.\n                              SAYER\n                   You see me now though.\n                             SIDNEY\n                   Yes.\n\n                             REV.12/12/89 (PINK)               Pg.l5\n23.CONT,                       (continuity only)\nSidney turns to a patient, an elderly woman in a wheelchair\nbeside him. Her state resembles that of Lucy's, that is, she\nappears to have no awareness of Sidney, Sayer, or anything else\nin her environment. It is only now, in fact, as Sidney spoons\nsoup into her mouth, careful not to spill any, that Sayer\nnotices her.\n\n                                        CONTINUED:\n\nsr^                                                   SAY    ER\n(y--\\                         I   f    it    ha p   pe n s     ag a   in ,     M r. Ti t ch , I\n v_y                          w   an   ty    ou     to l     oo k     a ro u   nd . If yo u\n                              d   on   't    act    u al l   y se     e me     , i f yo u o n ly\n                              h   ea   rm    e,     you      c an     be s     u re th a t I ' m\n                              n   ot    re   a l,    a nd     y ou     c an     i g no re m e.\n         Sa ye r sm il es , pl ea se d w it h hi s so lu ti on .\n                                          SID NE Y\n                              U nle ss you us e th e P .A. sy ste m.\n         S a ye r' s sm il e fa de s. Si d ne y is s ti ll i n a pr ed ic a me nt a nd\n         Sa ye r has n' t t he a nsw er .\n\n         2 4.          INT . NUR SE S' ST AT ION - D AY                                                                          24\n                                                                                                                             ;\n\n\n         Sa ye r di al s th e ho sp it a l op er at or .\n                                          S AY E R\n                              Mai nten ance, plea se.\n         W ai     ti n g t   o be        co n ne ct e d, he n o ti c es a n ot h er \" s ta t         ue \" ( BE R T) .\n         W ha     t's un     se t t    l i n g a b ou t t h i s o n e, a pa r t f r om t he          ma n ' s g h os t -\n         l ik     e ap p e   ar a n    ce , i s th e an g le o f h i s w he e l ch a i r.              I t ' s l i ke a n\nP~ -\\    ask      e w p ai   n ti n    g, a s i f w ho e ve r w as wh e el in g i t s im             p ly le t g o o f\n\\TS?    the       c h ai r   and       t h i s i s wh e r e i t a n d i t s c a r g o h a p p        e n e d to c o m e\n        *to       r est,     faci      n g th e wal l.\n         N   ot       wa nt i ng    to l o se th e c al l , Sa y er mo ve s t o wa r               d th   e p at i    en t ,\n         k   ee   p   ing the       r e c e i ve r t o h i s e a r . At f u l l e x t e n          sion     of th     e\n         c   or   d   , un f or t   un at e ly , h e' s s t il l t wo pa ce s s h or t             .R     e ac hi n   g b ac k\n         w   it   h    the arm       w it h th e ph o ne , he g ai n s d i st a n ce               a nd   tu r n s    the\n         w   he   e   lc ha i r q   ui ck l y j us t a s h is c a ll co nn e ct s .\n                                            SA Y ER\n                              Yes. Hi. I need                      a lock installed\n                              on th e d oo r to th                e E as t Win g roo f.\n                              A b ig l oc k . T he                s oo n e r t he\n                              better.\n                                    ( pa us e )\n                              I'm sor ry, th is i                 s D r. Say er. .\n                                    (p au se )\n                              I'm sorry, form . .                 .\n        H e s c ri b b le s a n um b e r o n t h e b a ck o f h is h an d an d h a n gs u p.                               He\n        wa nd e rs ov er to th e \" st a tu e\" ag a in .\n                                           S AY E R\n                              H ow ar e y ou ?\n        No re s p on s e w h at s o ev e r . Sa y e r m a na g es h is p en i nt o t h e m a n 's\n        ha nd an d s ea r ch e s hi s p o ck et s f o r pa p er .\n\n                                                           REV. 10/13/89   p. 17\n      He glances around. Sees an orderly reading a newspaper.\n(P\\   Borrows a section, returns with it, slides it under the pen and\n       waits. The man doesn't write. Doesn't move.\n      Sayer takes the pen back, returns it to his coat pocket,\n      hesitates, pulls it out again, holds it out . . . and lets it go.\n      The man, lightning quick, catches it.\n\n      25.   INT. ANOT HE R DAYRO OM ( B) - L ATE R - DAY                           2 5.\n\n      Another man rigid as stone (FRANK). This one peering up at a\n      television set with a horizontal hold problem.\n      Sayer drags a chair over, stands       on it, adjusts the set,\n      corrects it, gets a picture . . .      but the man's \"attention\"\n      slowly drifts away. Sayer \"read       justs\" it, gets the jumping\n      horizontal lines again, and the       man's vacant eyes return.\n\n      26.   INT. LEONARD'S DAYROOM - LATER - DAY                                . 26.\n      Another dayroom crowded with patients, one of which stands\n      before a table, absolutely motionless, on thin bird-like legs.\n      It is Lucy, the one who caught/the tennis ball. The movement\n      of nurses and other patients only accentuates her stillness.\n       Sayer considers her from all      angles as    one considers an\n       abstract art piece that baff     les but in   trigues. Unlike the\n      others, she's on her feet. A      nd unlike    the others, she seems,\n      to Sayer, to have been headed      somewhere    before turning to stone\n      again.\n                                   - .\"        »\n      He decides that her destination was the drinking fountain\n      across the room. And that it's the table, like a barrier, that\n      has arrested her progress. He moves the table.\n      In what appears to be slow motion, she takes a tiny step. And\n      another. And another before encountering and being \"blocked\"\n      by an empty wheelchair. She stops.\n      Sayer moves the wheelchair and all other obstacles out of her\n      path. She continues and eventually makes it halfway to the\n      fountain before mysteriously stopping again.\n      Sayer studies the puzzle ... there are no longer any barriers\n      in her way, but she's not moving. Defeated, he goes to the\n      fountain himself, fills a paper cup, and takes it to her.\n      Across the room, a man in a wheelchair, another \"ghost\"\n      (LEONARD), stares through eyes which seem more dead than alive.\n      \"At\" Sayer.\n\n    27.   INT. FILE ROOM, BAINBRIDGE - DAY                            27\n\no   An admission form, yellowed and brittle with age --\n                    BAINBRIDGE HOSPITAL / ADMISSIONS\n                           STATE OF NEW YORK\n    A typed date / AUGUST 2, 1929. The admitting physician's name.\n    The patient's name. And age / 15. An identification number\n    and ward assignment number.\n    As Sayer pulls the folder and closes the drawer of one of\n    several filing cabinets lining the walls of a claustrophobic\n    room, Miss Costello slides open another, locates a particular\n    folder in it and in the folder another admitting form -- The\n    date / MAY 7, 1932. Names and numbers.\n    Another drawer. Sayer pulling another folder. Another\n    admission form ~ Date / DECEMBER 12, 1930. Age of the patient\n    / 22.\n\n                                                                      28\n    28.   INT. EXAMINATION ROOM - LATER - DAY\n    The files spread out on a table. Sayer and Miss Costello\n    leafing through them.                    .\n                                             .\n    Sayer considers one's original admission forms. He scans\n    bodies of text and finds a diagnosis -- ATYPICAL SCHIZOPHRENIA.\n    He sets it aside and picks up another.\n                         MISS COSTELLO\n               \"Atypical Hysteria,\" this one.\n    Sayer nods to himself and keeps reading his. He eventually\n    finds in its text -- ATYPICAL RABIES. He flips to the end of\n    the file. \"No change since last examination\" it reads. He\n    turns the page. \"No change, no therapy recommended.\" He turns\n    the page, the last entry. \"No change.\" The date, \"11/9/44.\"\n                         SAYER\n              There must be more recent files we\n              missed somehow. \"Part Twos\" to\n              their medical histories.\n                    (Miss Costello is\n                     shaking head 'no.')\n              In some other filing cabinet\n              somewhere.                 . ..\n                          MISS COSTELLO\n              NO.\n\no\n\n                                                                 REV. 10/13/89   p.19\n            29.   EXT. PARKING LOT - BAINBRIDGE - EVENING                               29.\n(>~s,       Sayer and Miss Costello walking to their cars.\n                                 SAYER\n                      One would think that after a point\n                      enough atypical somethings would\n                      amount to a typical something.\n                      But a typical \"what?\"\n            Miss Costello, no doubt, has less of an idea than Sayer what\n            the \"what\" could be.\n                                 MISS COSTELLO\n        ,            Doctor . . . would you like      to g e t a\n                       cup of coffee somewhere?\n                            (pause)\n                      Tea?\n                                  SAYER\n                       Ah . . . normally I'd say yes . . .\n                       only I've made other plans . . .\n            She nods quickly.    She seems, strangely, relieved.\n                                 MISS COSTELLO\n                       Some other time.\n                                  SAYER\n                       Yes.\n                                 MISS COSTELLO\n                                                             ,\n                       Good night.\n                                 SAYER\n                       Good night.\n            They veer apart to their respective cars.\n\n            30.   INT. SAMMY'S GROTTO, CITY ISLAND - NIGHT                              30.\n            The tiny gree/i eyes in the head of the eel staring out at\n            refracted light and shadow. Sayer, alone at the same table as\n            before, finished with his meal.\n                                                                                              i\n                                WAITER\n                      Tea, right?                 ·\n                                                  /\n                                                  ·\n                                   SAYER\n                      P e s . '...-·\n                       lae\n            The waiter leaves. Sayer glances back into the fish tank at\n            the eel behind the rock, its rock, its home.\n\n                                                                                (RE V. 10 /1 6/ 89) Pin k      _ p. 2 0\n\n\n       31.    EXT. CITY ISLAND - LATER - NIGHT                                                                   31.\nfpl\n        Sayer strolling down a dark side street. He reaches a snail\n        wooden house near the water and climbs three steps to the\n        porch. He gets the front door opened and bends to pick up mail\n        (including a few book parcels from antiquarian shops) just     *\n        inside the threshold.                                            *\n\n        32.    OMITTED                                                                                           32.\n                                                                                                          i\n\n\n\n        33.    INT. SAYER'S HOUSE - DINING ROOM - LATER - NIGHT                                                  33.\n       Tight on (Ernst Heckle) drawings of primitive life forms.                                                   *\n       Sayer, in his dining room, leafs through the old first edition,                                             *\n       pleased it has arrived, intrigued by its pictures. The parcel                                               *\n       paper lies beside it on the table.                                                                          *\n\n        34.    INT. SAYER'S HOUSE - LIVING ROOM - LATER - NIGHT                                                  34.\n       Fingers on the keys of a baby grand piano that seems out of\n       scale with Sayer's small living room. Wrapped in a robe, he\n       plays a melody.\nfcuJ   All around him lay packing boxes, some empty, many not. The\n*^^    books are out at least - many of a medical nature, many others\n        on nature itself,, botany, many first editions - two and three\n        deep on shelves, on the floor, on tables, stacked on the couch -\n        and chairs almost like figures of people.t\n\n       35.     INT. SAYER'S HOUSE - LIVING ROOM - LATER - NIGHT                                                  35.\n       A lamp, on, in the living room. Sayer asleep on the couch, an\n       open book and reading glasses resting on his chest.\n       His eyes blink open. Not at a noise. At a thought.\n\n       36.     INT. EXAMINATION ROOM - BAINBRIDGE - LATER - NIGHT                                              36.\n       A n i g h t ja n i to r w i th a p a i l -o n -w h e e l s a n d a m o p m o v e s p a s t\n       da r k e n e d o ffi c e s.   H e p a u s e s a t o n e , th e fi l e r o o m , l i g h t u n d e r\n       i ts d o o r , a n d o p e n s i t.                        .                   -..                  *\n                                 JANITOR\n                       I'm sorry, doctor. I thought\n                       someone left the lights on.\n\n\nQ\n\n                                           REV.,12/5/89 (BLUE)       Pg.2\n 36'.CONT.                                                         36.\n  Glancing up from files strewn across the table, Sayer shares a\n  discovery with the janitor -\n                        SAYER\n           They all survived encephalitis\n           years before they came here. In\n           the 1920' s .\nHe taps a finger at the files - the patients' medical histories\nprior to admission - forms listing childhood diseases and\nailments. The janitor, having no idea of course what he means,\nretreats with his pail and mop, closing the door.\n36A. EXT. MEDICAL LIBRARY, NEW YORK - ESTABLISH - DAY            36A.\n37.   INT. MEDICAL LIBRARY, NEW YORK - DAY                         37.\nSayer displays what he has written on the back of his hand to\n                                                                         *\nan assistant librarian: NEJM 4-6-35.\n                      SAYER\n           The New England Journal of\n           Medicine, April 6th, 1935.                                    *\n\n38.   INT. MEDICAL LIBRARY - LATER - DAY    .                      38.\nA microfilm machine. Sayer manipulating its levers and\neventually finding what he's after, an article titled:\nENCEPHALITIS LETHARGICA, TEN YEARS LATER.\nAccompanying the text are grainy black and white photographs\ntaken in an old operating theatre. An anatomical skeleton, a\ndoctor in a white coat, subjects-- men, women and children\nwith haunting eyes.\n\n39.   EXT. RESIDENTIAL GARDEN, NEW YORK - DAY                      39.\nClose on the doctor from the photographs - ancient and ill.\n                     OLD DOCTOR\n                (philosophically\n                 detached)\n          Pus and pain, that's the final                                *\n          reward. Pus and pain and\n          obscurity.\nHe's in a small unkept rose garden. With Sayer.                         *\n\n\nNo te: To g et c lear anc e fr om t he N ew En gla nd Jo urn al of *\nMedicine, we must indicate that it is a weekly publication, *\nwhich is why the \"6th\" has been added.                             *\n\n                    OLD DOCTOR                .\n          I believe you when you say some\n          still live. But I can assure you\n          they're medically irrelevant. As\n          they were thirty years ago when I\n          fought to get my work published.\nHe smiles at a thought, at once wistful and bitter.\n                    OLD DOCTOR\n          That's the problem with a unique\n          disease. Once it no longer rages,\n          I'm telling you, it becomes very\n          unfashionable.         .\nHe buries his face into his mask, manages to get some deep\nbreaths into his lungs and shakes his head at Sayer.\n                     OLD DOCTOR\n          What would I be without this\n          thing? A man with a1 shred of\n          dignity le_ft.\n                    SAYER\n          Should I get your nurse?\n                    OLD DOCTOR\n           God forbid, no.\nHe lights a cigarette, coughs and puts it out.\n                    OLD DOCTOR\n          How many have you found there?\n                    SAYER\n          Five. So far. I think there may\n          be more.\nThe old doctor nods. He has the torn look of someone reminded\nof an unfaithful lover just when he'd managed to forget about\nher. He wants and doesn't want to know how they're doing.\nFinally --\n                    OLD DOCTOR\n          How are they?\n                   SAYER\n         As you described them. As they\n         were back then. As \"insubstantial\n         as ghosts.\" Only I guess most of\n         them were children then.\n                     OLD DOCTOR\n          Yes.   Children who fell asleep.\n\no   40.   INT. OLD DOCTOR'S STUDY - DAY                               40\n    Boxes of ancient history have been dragged out of storage, the\n    emphysema-plagued doctor's post-encephalitic research, files\n    and photographs and cans of 16mm film.\n                         OLD DOCTOR\n               Most died during the acute stage\n               of the illness, during a sleep so\n               deep they couldn't be roused. A\n               sleep that in most cases lasted\n               several months.\n    The doctors, in the dark, watch forty year old footage\n    projected onto a screen by a pre-World War II Bell & Howell -\n    a motionless man in a chair, his head thrust back, mouth gaping\n    open, arms suspended out from an emaciated torso as if from\n    invisible strings.\n                        OLD DOCTOR\n              Those who survived, who awoke,\n              seemed fine, as though nothing had\n              happened. Years went by - five,\n              ten, fifteen - before anyone\n              suspected they were not well. .\n              They were not.\n    A doctor, this doctor decades younger, appears beside the\n    subject on the screen and lowers the man's arms.\n                        OLD DOCTOR\n              I began to see them in the early\n              1930's - old people brought in by\n              their children, young people\n              brought in by their parents - all\n              of them complaining they weren't\n              \"themselves\" anymore. They'd\n              grown distant, aloof, anti-social,\n              they daydreamed at the dinner\n              table. I referred them to\n              psychiatrists.\n    The man on the screen disappears and is replaced by a seal-\n    shaped woman in whom a hundred strange diseases seem to reside.\n    They conspire against her, torment and harass her, force her to\n    perform incessant and meaningless actions with her hands, to\n    paw her chin, to flutter, to adjust glasses that aren't there.\n\n                                             REV.12/5/89 (BLUE)       Pg.24\n\n     40.CONT.                  DOCTOR                                    40\n                                0<\n                                ID\n\n                Before long they were being\n                referred back to me. They could\n                no longer dress themselves or feed\n                themselves. They could no longer\n                speak in most cases. Families\n                went mad. People who were\n                normal, were now . . .        *\n                      (searches for the\n                       word)\n                . . . elsewhere ...\n    The woman on the screen is replaced by a young man, a teenager,\n    who seems composed less of flesh than wax, a wax figure with\n    real eyes.\n                         SAYER\n              What must it be like to be them?\n    On the screen, the young man's eyes, entranced, gaze upward as\n    if trying hard to remember something. Or trying hard to forget\n    it.\n                         SAYER\n              What are they thinking?       .\n                           OLD DOCTOR\n\n0               They're not. The virus didn't   :\n                spare the higher faculties.\n                           SAYER\n                      (hopefully)\n                We know that for a fact.\n                                OLD DOCTOR\n                Yes.\n                                SAYER\n                Bec use . . .\n                   a\n                                                        4\n\n\n\n    Sayer waits for the old doctor to tell him the reasons, the\n    data, to support the merciful truth. But he doesn't seem to\n    possess it any more than Sayer does. Long silence before:\n                          OLD DOCTOR\n                Because the alternative is\n                unthinkable.\n\n    40A. INT. DAYROOM (C) - DAY                     '                 40A.\n    The hand of a stone-like woman catches the tennis ball while\n    the rest of her remains absolutely still. Sayer gestures to\n    Anthony, Okay, and the orderly wheels her out of the crowded\n    room.\n\n4OB. INT. WARD 5 DAYROOM - DAY                   ·                4OB\nThe hand of an otherwise still-life man snaps to catch the\nball. Sayer nods to an orderly who wheels him out past younger\npatients, Ward 5's residents.\n                                  i\n\n40C. INT. CORRIDOR - DAY                                          40C\nThe ball glances off the face of a nan who turns in his\nwheelchair and glares at Sayer.\n                     SAYER\n           Sorry.                                      .\n\n                                                                   41\n41.   INT. LEONARD'S DAYROOM - LATER - DAY\nSayer has assembled them all, the fourteen or fifteen he has\ndecided are post-encephalitics, and wanders among them like a\nnaturalist in a garden of stone.\nHe lifts an arm of one particularly remote male patient.   It\nremains suspended, doll-like.\nHe tries to follow the trajectory of another's gaze.   It leads\n only to blank space.\nHe considers another who appears \"deeply involved\" in some\nminute and curious activity with his twisted hands, a kind of\ntearing, shredding motion.\n                     .                       v\nAcross the room, paying no attention to Sayer, are Sidney and\nLolly. He's gently brushing her hair.\nSayer manages a pen into the hand of another woman and she\n\"draws\" a kind a kind of circular shape that spirals in on\nitself until it reaches a \"vanishing point\" in the center.\n\n42.   INT. EXAMINATION ROOM - LATER - DAY                         42.\nThe results of standard perception tests scotch-taped to a wall\nof the examination room.\nSayer and Miss Costello, like visitors to a museum, consider\neach for a moment before moving onto the next.\nPrinted in the left column of each are a circle, square,\ntriangle and daisy. In the right are the post-encephalitics'\nfailed \"attempts\" to copy them.\n\n                                              REV. 10/13/83   p.26\nSayer keeps coming back to one in particular. Unlike the\nothers which, if you use your imagination, vaguely correspond\nsomewhat positionally to the pre-printed shapes, this one bears\nno resemblance. This patient has instead scrawled over the\nshapes, seemingly violently.\nMiss Costello joins Sayer and ponders it along with him.\nEventually, as if to excuse it and its maker--\n                     MISS COSTELLO\n           It's different.\n                      SAYER\n           Quite.   It's quite bad.\nSayer keeps studying it.\n                    SAYER\n               (more to himself)\n          Did he fail to understand? Or was\n          he unwilling to fail?\nHe isn't really asking her to answer, which is fine with her\nsince she doubts equally both hypotheses.\n                    SAYER\n          Could he be saying, \"I can't draw\n          a triangle, don't make me\"?\n               (before she can\n                respond:)\n          Could it be willfully bad?\nShe doesn't say it but it's clear she thinks Sayer is reading\nfar too much into the \"badness\" of the patient's scrawl. To\nhimself -\n                    SAYER\n          Which one is this?\nHe leans closer to see the typed name . . .\n\n43.   INT. LEONARD'S WARD - DAY                                      43.\nThe painting of the Western town from the prologue - saloon,\nlivery stable, sunset. Below it, in his wheelchair, Leonard.\nHis face is unlined and passive, like a mask. His body is\nstill, like the dead.\n                    SAYER'S VOICE          >|           v\n          Does he ever speak to you?\nLeonard's mother, a woman of seventy or so, is combing her\nson's hair, being careful to get the part straight.\n\n                                              REV. 10/13/89 p.27\n\n                     MRS. LOWE\n           Of course not. Not in words.\n                     SAYER\n           He speaks to you in other ways.\n           How do you mean?\n                     MRS. LOWE   i\n           You don't have children.\n                     SAYER\n           No. ,\n                     MRS. LOWE\n           If you did you'd know.\nFinished with his hair, she wheels him from the sleeping ward         *\nand into the -\n\n43A.   INT. LEONARD'S DAYROOM - CONTINUOUS - DAY                     43A\nSayer, trailing after Mrs. Lowe and her sonr becomes\nmomentarily distracted by Lucy, the most recently arrived post-\nencephalitic, the one he tried unsuccessfully to coax to the\ndrinking fountain. She is there again, \"stuck\" at the same\npoint, angled toward the fountain but unable to reach it.\nSayer brings her a cup of water and rejoins Mrs. Lowe.       -\n                     SAYER\n           I'd like to examine him again-if\n           that's all right with you.\n                     MRS. LOWE                              ,\n           He did well.\n                     SAYER\n           In a sense.\n                     MRS. LOWE\n           He's very clever. Aren't you,\n           Leonard.                    .\nSayer shows her the perception test \"drawing** Leonard made.\n                     SAYER\n           Does this mean anything to you?\n                     MRS. LOWE                          .\n                (more to Leonard)                               ;·\n          It's very good.                                       '·\n                                                                 .\nShe glances back to Sayer who nods uncertainly. She recognizes.\nthe look on his face; she's seen it before on the faces of more\ndoctors than she cares to remember.                 '         f\n\n                                                REV. 10/13/89 p.28\n                      MRS. LOWE\n                 (becoming impatient\n                  with him)\n           Well it's abstract, isn't it.\nSayer can't bring himself to agree with her.\n                     MRS. LOWE\n           That's the problem with all you\n           doctors, you have no imagination.\n           Everything has to be real to you.\nNo longer having any use for him, she pointedly ignores him.\n                                                                         *\nTaking the hint, Sayer's wanders off, past Lucy, looking like a\nstatue, holding the paper cup he brought her.\n\n43B. EXT. APARTMENT BUILDING (MRS. LOWE'S) - ESTABLISH - NIGHT    43B.\n\n44.   INT. MRS. LOWE'S APARTMENT - NIGHT                               44\nThe door opens from the inside revealing Sayer in street\nclothes. Judging from the look on Mrs. Lowe's face, he has\narrived unannounced.\n                     SAYER                  .\n           I want to know more about him.\n\n44A. INT. MRS. LOWE'S APARTMENT - LEONARD'S BEDROOM - NIGHT          44A.\nAn old photograph. A sixth grade class picture from 1930?,\nMoving slowly across the young faces to Leonard, eleven, at the\nend of a row.\n\n                     MRS. LOWE 0.8.\n           Something was wrong, they said,\n           with his hands. He couldn't write\n           anymore, he couldn't do the work,\n           I should take him out of school,\n           they said. He was eleven.\nThey're in Leonard's old bedroom, Sayer and Mrs. Lowe. Except\nfor the Western painting that's missing, nothing has changed in\nit in thirty years.\n\n                                                    CONTINUED:\n\n                                     REV. 10/13/89   p.28A\n          MRS. LOWE\nHe slowly got worse. He'd be\ntalking, suddenly he'd come to a\nstop. After a few seconds he'd\nfinish what he was saying like\nnothing happened, but these\nstandstills got longer. Sometimes\nhe'd call to me and I'd come in\nand find him at his desk in a\ntrance. An hour, two hours. Then\nhe'd be okay again.\n\n\n\n                                    CONTINUED:\n\nSayer glances around the room.    It's been preserved, like a\nshrine.\n                     MRS. LOWE\n           One day I came hone from work and\n           found him in his bed, his arm like\n           this, reaching.\n                (pause)\n           \"What do you want, Leonard?\"\nShe pictures the moment in her mind, and waits, it seems, for\nthe young Leonard to speak, to tell her what it is he wants.\nFinally she lowers her arm and shrugs.\n                     MR.S LOWE\n           He never spoke again. It was like\n           he'd disappeared. I took him to\n           Bainbridge later that year.\n           November fourteenth, 1937.\n           He was twenty.\nSayer glances away from her to the room itself again.\n                     SAYER\n           What'd he do with himself, Mrs.\n           Lowe, those nine years he stayed\n           in this room?\nShe smiles to herself, proudly it seems.\n                      MRS. LOWE\n           He read.                        y\n\n\n\n45.   INT. EXAMINATION ROOM - BAINBRIDGE - DAY                   45\nLeonard's face in shadow. Wires emerging from his scalp. A\nsluggish EEG pattern.\nA blinding flash from a strobe.suddenly lights up the room.\nThe pupils of Leonard's eyes shrink, but his EEG remains\nstuporously slow.\n\n45A. EXT. RESEARCH LAB, NEW YORK - ESTABLISH - DAY              45A.\n\n46.   INT. RESEARCH LAB - DAY                                    46\nA monkey flipping switches on a panel built into a laboratory\nroom, searching for a sequence.\nIn an observation booth, years of collected data - charts and\ngraphs, EEG's and notes.\n\nThere, Dr. Mann, a contemporary of Sayer's, stares at Sayer      Ay\ncuriously. Eventually he manages --\n                    MANN\n          When you say you're working with\n          people, you don't mean living\n          people.                               (\n\n\n                    SAYER\n          Living people, yes. Patients.\nMann just stares. He's a scientist, they both are, and the\nidea of Sayer working with living people, rather than expired\nones laid out on the pathology table, is inconceivable to him.\n                    MANN\n               (fearing the answer)\n          Where?\n                     SAYER\n          It's in The Bronx. It's a poor\n          private chronic hospital called\n          M ou nt --\n                    MANN\n               (appalled)\n           Oh, Malcolm, Malcolm, come back,\n           come on. You're a benchman,\n          you're no clinician, why would you\n          lower yourself?\nSayer hasn't an answer for him.           »·\n                    SAYER\n          How's Hank?\n                    MANN\n          How's Hank? He's great, he's\n          brilliant, look at him.\nSayer glances away to Hank the monkey, watches him. Mann\nstudies Sayer, chagrined and incredulous.\n                    MANN\n          A physician? You?\nHe slaps him angrily across the shoulders with some papers.\nThe monkey completes a complex sequence which opens a chamber\nrevealing an electric train. The animal jumps and hoots with\nwild glee. Sayer reaches out and presses the button on the\nstop watch dangling from Mann's neck.\n                     SAYER\n           Subtract two seconds off his\n          time.\n\n 47. OMITTED                                                         47\n48.   INT. RESEARCH LAB - LATER - DAY                                48\nRats in cages, wired up, manipulating elaborate series of\nladders and pulleys, traversing catwalks, or ratwalks, leading\nto glucose rewards.\nWhile Mann, with something less than great enthusiasm,\nconsiders an EEG Sayer has brought, his monkey drags toys over\nto Sayer and tries to engage him in play. One of the toys is\nan Ouija Board.\n                      MANN\n                (to, Sayer)\n          Don't look at me like that. It's\n          for his alphabet lessons.\n                (to the monkey)\n          We're busy, Hank, go play\n          solitaire.\nThe monkey obediently goes off in search of a deck of cards.\nGesturing at patterns on the EEG --\n                    MANN\n           Asleep. First stage normal.\n           Second a little dull. Normal\n          RM...\n          E\nHe shrugs, lays out a second EEG, and gestures at patterns on\nit --\n                     MANN\n          Awake. Slightly erratic. No more\n          so than a lot of people walking\n          the streets of New York.\n                (shrugs again)\n          I give up, what's wrong with him?\n                      SAYER\n          You have them backwards. This is\n          him awake . . .\n                (points to one EEG;\n                 then the other)\n          This is him asleep.\n           .-,\" -           .                            ^       ·\nMann thinks Sayer is kidding. He isn't.\n                    MANN\n          This is him awake? This is him\n          asleep?\nSayer nods. Mann tries, without success, to make some sort of\nsense out of that.\n\n                    MANN\n          What are you saying? When he's\n          awake, what, he's dreaming?\n                     SAYER\n          When there's any brain activity at\n          all, which is infrequent, yes.\n          Dreaming or hallucinating.\n                      MANN\n          And when he's asleep . . . ?\n                     SAYER\n          When he's asleep he manages to\n          create a kind of reality. What we\n          might call reality.\n                     MANN\n          That's what you think these say?\n                     SAYER\n          1 don't know.\nMann studies the \"waking\" EEC     He points to its one and only\nlarge electrical peak.                     ;\n\n                    MANN\n          What's this peak? Strobe?\n                    SAYER\n          No. This is the strobe.\nSayer indicates a flat section of the pattern where there is\nscribbled in pencil a small \"s.\"\n                       SAYER\n          This . . .\n  ,               (the large peak,\n                   marked with an \"L\")                /\n          . . . is me saying his name to him.\nMann stares rather dumbly at Sayer. Then at Hank the monkey on\nthe floor dealing solitaire.\n\n49. INT. LEONARD'S DAYROOM - DAY                                  49\nTight on Leonard. Something blurs past him but his eyes don't\nfollow it. Pulling back, the object blurs by again from the\nother direction.\nTight on Sayer. The thing blurs past his face. His eyes don't\nfollow it either. Pulling back, it blurs again.\n\n                                               REV. 10.13/89 p.33\nA circle of patients in wheelchairs. The post-encephalitics\nreunited. \"Waking\" just long enough to catch and release the\nobject, a small beach ball.\nLeonard and Sayer, on opposite sides of the circle, ignoring\nthe ball and the other patients. He's reached a dead end,\nSayer, right where he began, his only \"accomplishment,\"\nthis, ball-catching patients.\n\n50.   INT. EXAMINATION ROOM - DAY                                   50.\nSayer alone in the examination room, tired, at its window\nstaring blankly out.\nHis perspective: The empty lot below littered with abandoned\ncouches, refrigerators, rusting automobile carcasses.\nAnd beyond the lot, the elementary school playground. Laughing\nchildren on swings and slides. Jumping rope. Batting tether\nballs. Playing hopscotch.\nMoving slowly in on one of the hopscotch games. On a girl\ntossing a bean bag into a square. Jumping over it and into the\nnext square. Turning and jumping back. Balancing on one foot.\nRetrieving the bean bag and tossing it down again. Into the\nnext square of the tile pattern chalked on the asphalt.\n\n51.   INT. LEONARD'S DAYROOM - DAY                                  51.\nFrom above, patients in wheelchairs dot the black and white\ncheckerboard linoleum-tile floor like chess pieces. The\npattern is regular to a point but then breaks up -- is\ninterrupted by an area of solid white, where a wall once stood\n-- before being restored. It forms a kind of narrow \"sea,\" the\nwhite area, on either side of which lies \"land.\"\n\nAt floor level Sayer and Miss Costello, on their hands and\nknees, are \"blacking in\" the missing tiles with shoe polish,\n\"bridging\" the gap between the two checkerboards. The retarded\npatients around them ignore them. The ward nurses pretend to. '\nCompleting the pattern Sayer glances across the room to\nLeonard. He seems to be \"watching.\" His mother, nearby, idly\nthumbing through a magazine as she brings Leonard up to date on\nneighborhood news, isn't.\n                                     ·t,   .\n\nSayer crosses to Lucy. Lifts her gently out of her chair.\nPoints her in the direction of the drinking fountain.\nShe begins to move. To step slowly over each tile. She\nreaches the \"bridge\" and hesitates. Then crosses it.\n\n                                                REV. 10/13/89   p.34\nSayer doesn't know whether to applaud or cry. He does neither,\nburying his emotions behind a professional mask instead, and\nwatches as Lucy, \"delivered\" to the other side, free now, lets\nthe regularity of the pattern guide her toward the fountain.\nShe nears it. She is almost there. Then she is. there. But\ndoesn't drink. Doesn't stop. She continues past it . . .\nTo a window, the window bevond the drinking fountain which\nSayer hadn't noticed before, had no reason to notice, had no\nneed to notice, with a broken pane allowing a view to the\noutside.\nShe stares out at the traffic below, in hopes no doubt of\nfiguring out where she is.\nAnd Sayer's eyes, behind which exhilaration and horror rise up,\nshift from her to Miss Costello, and then to Leonard, in whose\nmask of a face Sayer thinks he sees a faint glimmer.\nThese people are alive inside.\n\n                                                                       52\n52.   INT. DAYROOM (B) - DAY\nA soap opera on a portable black and white TV in a narrow\npassageway of a nurses' station. Beyond.it, beyond a glass\npartition, a crowded idle dayroom.\nMiss Costello crosses into and out of view and reappears\nmoments later next to the TV. She switches it off and turns to\nface the three RNs who were watching it. In their defense --\n                                            V\n                     NURSE\n           The patients have all been given\n           their morning medication.\n                     MISS COSTELLO\n           Good. Dr. Sayer was hoping you'd\n           have some free time.\nShe hands a book to the nurse who spoke (MARGARET), a first\nedition worn /rom many readings. Margaret glances from it to\nthe other nurses and back to Miss Costello.\n\n53.   INT. DAYROOM (B) - LATER - DAY                                   53\nThe nurse holds the book like it's something quite foreign to\nher. She finds the beginning of the first chapter, clears her\nthroat, and reads --\n                       MARGARET\n           \"Call me . . . Ish-ma-el . . .\n\nShe glances up at her audience: three blank-faced post-          ,55\nencephalitics. Miss Costello, who is nearby, nods to her to\ncontinue. She clears her throat again, and, feeling like a\nfool, reads --\n                       MARGARET\n           \"Some years ago, never mind how\n           long precisely, having little or\n           no money in my purse, and nothing\n           particular to interest me on\n           shore, I thought I would sail\n           about a little and see the watery\n           part of the world . . . \"\nMiss Costello leaves.\n\n                                                                     54\n54.   INT. EXAMINATION ROOM - DAY\nLeonard's head locked on his shoulders at an improbable angle\nthat forces his entranced gaze upward to a point well above\nSayer.\n                     SAYER\n           Can you hear me, Leonard? I want\n           to hear you speak your name. :\n            .               -\n Sayer waits . . . but Leonard remains mute.\n\n55.   INT. SAYER'S HOUSE - MORNING   \"                               55\nTight on Sayer pulling record albums from his extensive\nclassical collection.\n\n56.   INT. DAYROOM (D) - DAY                                         56\nAn.old box-style phonograph. The kind whose top is also a\ndetachable speaker.\nAn orderly, Fernando, dusts it off, rigs it, takes the record\nMiss Costello holds out to him, gets it spinning, and sets the\nneedle down.\nOpera music. For the \"enjoyment\" of two more post-\nencephalitics. The eyes of one narrow slightly, almost\nimperceptibly.                         -.\n                                        -\n                                                                 i\n\n57.   INT. EXAMINATION ROOM - DAY                                    57\nThe keys of Sayer's old manual Underwood typewriter. And\nLeonard's claw of a hand hanging over them like one of those\nunmanageable penny arcade cranes.\n\n                                                    REV. 10/2/85\n\n\n                         SAYER                                              57\n           L . . . Leonard . . . L . . .\nLeonard's hand remains still, suspended above the keys, for\nwhat seems an eternity.\n\n58.   INT. LEONARD'S DAYROOM - DAY                                         58.\nUnder Miss Costello's supervision, maintenance men remove the\ngratings from the windows and washhthe panes.\n\n      INT.- DAYROOM (D) - DAY                                              59.\n59.\n30's jazz music. The orderly from before with \"his\" two post-\nencephalitics. Each has a tray of cafeteria food, but only one\nis eating, and mechanically at that.         <\n                       FERNANDO\n            . . . not just any music, it has to\n           be the right, music for them. Jazz\n           does nothing for Bert. Only Rose.\n                  (pause)\n           It's like they're only moved by\n           music that moves them. I'm that\n                       '*''-\n           w ay .\n                       SAYER\n                  (intrigued)\n            Yes, so am I.                       >\nThe moment Fernando takes the record off, Rose stops eating,\nstops moving. The orderly puts on Mozart and waits. Neither\npatient moves.\n                      FERNANDO\n           I haven't found anything that\n           moves Bert yet.\n\n59A. INT. CORRIDOR - DAY                                           '     59A.\nA \" no r ma l\" pa t ie nt wi t h m ul t ip le sc l er os is h as ma na g ed to\ninte rcep t S ayer on hi s w ay some wher e el se, his ar ms f ull wit h\nan 8mm camera and tripod and screen.\n                    j MS WOMAN\n           I don't interest you like those\n           other people, those ones with that\n           disease.\n                      SAYER\n           That's not true.\n\n                                                REV. 10/2/89\n\n\n                     MS WOMAN\n           I wish I had something like that.\n           SSmething that would interest you\n           instead of this stupid boring MS.\n\n60.   INT. EXAMINATION ROOM - DAY                                  6\nLeonard in his wheelchair, absolutely motionless. Sayer behind\nthe lens of the 8mm camera on the tripod. Drs. Tyler and\nSullivan, at the doorway, watch with some amusement.\n\n60A. INT. DAYROOM (A) - DAY                                       60A\nMiss Costello wheels the man who shreds invisible things to a\nwindow and places a piece of toast from a tray into his hands.\nHe tears at it, the crumbs sailing out onto a landing, and a\nflock of pigeons swoops up.\n\n61.   INT. DAYROOM (C) - DAY                                      61\nThree post-encephalitics with cards in their hands and the best\npoker faces you ever saw.                :\n\n                     MARGARET\n           They'll sit there all day like\n           that if I let them. I have to\n           play the first card.\n                                         >\nSayer watches her pull a card from one of their hands and place\nit on the table. All three \"wake\" and begin throwing down\ncards, one after another.\n                     SAYER\n           Is it a real game I wonder?\n                     MARGARET\n           If it is, I don't know it. Maybe\n           it's three different games.\n                       SAYER\n                  (delighted)\n           Yes.\n                                                                   62\n62.   OMITTED                               ,\n\n63.   INT. CORRIDOR / DAYROOM (B) - DAY                            6\nSayer moving past \"normal\" patients lined up in the hall like\nplanes on tarmac. Suddenly, from a dayroom, booms the opening\nbass line of Hendrix's \"Foxy Lady.\"\n\n                                                          (WHITE) REV. 12/4/89         P. 38\n63.CONT.                      .. ..                   ,,    .     ,,        «            63.\nSa ye r pe er s cu ri ou sl y i nt o th e    ro om . B er t is ea ti ng a nd\nAn tho ny is g rin nin g. He see s S         aye r i n t he d oor way an d s ends\nhim a s elf -sa tis fied th umb s-u p        s ign.\n\n64.    INT . DAY ROOM (C) - DAY                                                           64.\n\nMi ss C os te ll o si tt in g wi t h a po st -e nc ep ha li ti c m an . (F RA NK )\n\n                            M IS S COS TE LLO\n                Ther e's so met hin g el se tha t\n                r eaches th em.\nShe t ouc he s the m an' s ha nd, h old s it , a nd hi s he ad sl owl y tu rns\nto fa ce her.\n\n                           M ISS CO STE LLO\n                Human cont act.\n\nSh e pu ll s hi m ge nt ly t o h is if ee t an d wa lk s wi t h hi m a fe w\nsteps.                                                                                   .\n\n                             M IS S CO ST EL LO\n                H e ca n' t wa lk w it ho ut m e . I f I\n                let go -                                 ;\n                       (to the patient)\n                I won't let go of you' -\n                       (to Sayer)\n                - if I let go , he 'll fa ll. H e'll\n                wa lk wit h me an ywh ere .\n\nThey wa lk a f ew more st eps an d t ears be gin to fo rm i n M iss\nCoste llo's eyes .\n\n                           M IS S CO ST EL LO\n                It's like the ball . . . only it's\n                my wi ll he's bo rro win g.\n\nSa ye r, to o, is m ov ed. But a s he wa tch es M iss C ost el lo an d her\np at ie nt w al k aw ay , hi s e xp re ss io n ch an ge s; s om e th in g sh e ha s\nsa id o r do ne h as s tr uc k a c ho rd , or u nl oc ke d a d oo r:\n\nClose on their hands . . .\n\n65.    OM IT TE D    -                                                                    65.\n\n66.    IN T. BAI NBRI DGE - NIG HT                                                        66.\n                                                             -\n\nEm pt y cor ri dor .     E cho in g f oo ts tep s.\n\n67.    IN T. LEO NARD 'S WAR D - NI GHT                                                   67.\n\nLe o na r d .   T uc k ed i n b u t \" a wa k e. \" St a r in g a t th e ce i li n g .\n\n                                            REV. 10/13/89   p.39\n\n                       SAYER O.S.\n           Leonard?\n\n68.   INT. LEONARD'S WARD - LATER - NIGHT                               68.\nIn a far corner of the darkened ward, in a pool of lamp light,\ntwo silhouetted figures. Sayer and Leonard. Sleeping patients\nall around them.\nSayer carefully, awkwardly, places   his hand on Leonard's.\nAfter a moment, the contact brings   the useless appendage \"to\nlife.\" As it slowly turns over and   grasps the doctor's hand, a\nglimmer of life seems to appear in   Leonard's eyes as well.\nSayer, unfamiliar, it seems, with the feeling the contact\nproduces in him, nonetheless places his other hand on Leonard's\nother. Soon it too turns and holds onto Sayer's.\nThe doctor draws both of Leonard's hands toward him and sets\nthem down on the pointer of an Ouija Board.\n                     SAYER\n           I'll begin moving the pointer\n           toward the \"L.\" For \"Leonard.\"\n           Once I feel you beginning to move\n           it, I'll stop and you'll take .\n           over. Do you understand?\n Leonard, of course, cannot say whether he does or not. The\nlook on his face is \"thoughtful.\" The look on Sayer's, hopeful\nand foolish.\n                       SAYER\n           I'm beginning . . .\nThe pointer begins to slowly move past stars and moons.\nJudging from Sayer's expression he begins to feel Leonard's\nmovement of it and, presumably, stops his own.\n                      SAYER\n          Yes, good . . .\nThe pointer moves across the letters, but passes the \"L\"\nwithout stopping. It stops on the \"R.\"\n                    SAYER\n          No. No, I didn't make myself\n          clear. My fault. I . . .     .\nThe pointer begins moving again, \"interrupting\" Sayer.      It\npasses the \"L\" again, reaches the \"I\" and stops.\n                                                                       ..\n                      SAYER                                      '    \".,\n           No. No, I . . .                                  .     .\n\n                                                REV. 10/13/89   p.40\n But the pointer is moving again.      It stops on the \"L.\"\n                      SAYER\n            Yes. Yes. That's what I meant. .\n            \"L.\" Good. Now the \"E.\"\n It begins moving again. But not to the \"E.\" To the nK,\" where\n it hesitates briefly before moving again.\n                        SAYER\n                   (realizing, to\n                    himself)\n            . . . you're spelling something\n            el e . . .\n              s\nKeeping one hand on the moving pointer, Sayer fumbles a pen\nfrom his shirt pocket and scribbles on his lab coat what\nLeonard has and is continuing to \"write\":\n            RILKESPA\n\n69.    INT. EXAMINATION ROOM - NIGHT\nSayer alone in the examining room, standing over his desk.           The\nlab coat is on it. And on it is scrawled:\n             RILKESPANTHERILKE\nHe has to study it only a moment before he sees the meaning of\nit; he quickly scratches out the last four letters,and adds a\nslash between the \"S\" and the \"P,\" so that it reads:\n             R I L K E s/p A N T H E R     BmBJUP*\n\n69A. EXT. PUBLIC LIBRARY. - ESTABLISH - DAY                                69\n\n70.    INT. PUBLIC LIBRARY - DAY                      '                    7\n A card catalogue.   Cards flipping by, stopping on one that\n.reads:\n      831 R Rilke, Rainer Maria\n            German poet and fiction>fwriter;\n            1875-1926; Collected Poems\n            tr. fr. German by --\n\n71.    INT. PUBLIC LIBRARY - LATER - DAY                  .     .,         7\nMoving slowly in on Sayer at one of the library tables with a V            .\nbook.        ,                                         ·..\n\n                                                   REV. 10/13/89 p.\"\n                                                        (continuity onxy;\n                      SAYER'S VOICE\n           \"His gaze from staring through the\n           bars has grown so weary that it\n           can take in nothing more . . .\n\n      INT. LEONARD'S WARD - DAY\n72.                                                                      72.\nMoving slowly into the Western painting.\n                      SAYER'S VOICE\n           \"For him it is as though there\n           were a thousand bars, and behind\n           the thousand bars, no world . . .\n\n72A. EXT. BRONX ZOO - DAY                                               72A.\nMoving in on a panther, limbs weakened, spirit broken, slowly\npacing back and forth before the bars of a small cage.\n                       SAYER V.O.\n           \"As he paces in cramped circles,\n           over and over, his powerful\n           strides are like a ritual dance\n           around a center where a great will\n            stands paralyzed . . .\n Moving slowly away from Sayer watching, moving high above him;\nthe place is virtually deserted.\n\n73.   INT. LEONARD'S WARD - DAY                                          73.\nMoving slowly in on Leonard as, in bed, flannel pajamas, as his\nmother diapers him for the night.\n                      SAYER V.O.\n           \"At times the curtains of the eye\n           lift without a sound . . .\nMoving slowly< in on Sayer, unseen in a doorway, staring at\nLeonard, at the look of contentment on his face. Or is it a\nlook of impotent rage?\n                         SAYER V.O.\n           \".    . . and a shape enters, '.slips\n           thr   ough the tightened silence of\n           the    shoulders, reaches the heart\n           and    dies .i.\"                         .            ...\n                                              FADE TO BLACK   . '''.'\n\n                                            REV. 10/13/89 p.41A\n                                                 (continuity only)\n73A. EXT. AUDITORIUM - NEW YORK - AFTERNOON                       73A.\nProfessional and    professorial types filing in past a placard,\nan enlargement of    an article from the Journal of Neurochemistry\ntitled: LEVADOPA     IN THE TREATMENT OF PARKINSONISM. Below it:\nA DISCUSSION WITH    MARTIN S. THOMAS, PH.D.\nThere's excitement (and jealousy) in the air.\n\n74.   INT. AUDITORIUM - AFTERNOON                                74\nAn anatomical skeleton dangling from a metal stand.\n                     NEUROCHEMIST\n           There's an ordinary medicine with\n           which we are all familiar. An\n           everyday medicine of stubbed toes\n           and bunions and boils.\nA man at a podium in a modern version of the 1920's basement\noperating theatre.\n                                                             ·\n                                                     ,\n                    NEUROCHEMIST\n          And then there is another kind.\n          A medicine that holds out to the\n          afflicted the promise of restored\n          life.\nHe glances to a point above his listeners, and an overhead\nprojector splashes a diagram of molecular structure (and the\nsilhouette of a raised hand) onto a screen. The neurochemist\ntraces the shadow to its maker in the audience.\n                     SAYER\n           Thank you. Yes. Yes, I'm very\n           much interested in your work with\n           this drug. I'm curious if . . .\n                     NEUROCHEMIST\n           Doctor ...?\n                      SAYER\n                 (pause)\n           Sayer. I'm curious if you . . .\n                    NEUROCHEMIST\n          After I'm through, Dr. Sayer.      If\n          you wouldn't mind.\nSayer glances around the auditorium. Everyone's looking at\nhim. He grasps the offending hand and holds it in his lap with\nthe other.\n\n75.   INT. AUDITORIUM LOBBY - LATER - AFTERNOON                  75,\nRefreshments on tables. Sayer, uncomfortable in his suit,\nwandering around the crowded room with a glass of wine. He\napproaches its hub of activity, the neurochemist surrounded by\nseveral impressed colleagues, but can't manage to get close\nenough to speak with him.\n\n76.   INT. MEN'S ROOM, AUDITORIUM - LATER - AFTERNOON             7\nThe neurochemist walks in and crosses to the urinals. A moment\nlater, he hears the door opening, and footsteps, and then\nnothing, until --\n                       SAYER O.S.\n           Do you   think it's possible that\n           simple   Parkinsonian tremor taken\n           to its   furthest extreme could\n           appear   as no tremor at all?\nWhen no one answers, the chemist glances over his shoulder.\nSayer is there, quite alone, looking at him.\n                     NEUROCHEMIST\n           Are you speaking to me?\nSayer is. And really wants to know the answer. The chemist\nzips up and moves to the sinks to wash his hands.\n                    SAYER\n          If jail the compulsions in the\n          Parkinson's patient were somehow\n                                         .\n          accelerated -\n               (demonstrating what\n                he means)\n          - the hands, the shaking, the\n          tics, the head bobbing, the\n          quickening speech -\n               (he's become a mass       »\n                of tics and\n                accelerated speech)\n          - might they not cave in on\n          themselves and, in effect, turn\n          the person into stone?\nHe comes to a abrupt stop, his eyes transfixed like a post-\nencephalitic's, staring. The chemist slowly dries his hands\nwith a paper towel.\n                    NEUROCHEMIST\n          Dr. Sayer, yes?\n               (Sayer nods)\n          I'm a chemist, doctor. I leave it\n          to you guys to do the damage.\nHe drops the paper towel into the trash and leaves\n\n77.   EXT. PARKING LOT - BAINBRIDGE - MORNING                 77\nEmerging from his car with some papers, Dr. Kaufman is ambushed\nby Sayer.                                                  ..\n\n                                          REV.12/13/89 (YELLOW)    Pg.\n\n77.CONT.              SAYER                                       77.\n           Did you have a chance to look at\n           any of the -.\n                       KAUFMAN\n           Freud believed in miracles.\n           Prescribing cocaine like it was\n           candy . . .\nSayer has to hurry to keep up with his supervisor as he heads\ntoward the hospital.\n                     KAUFMAN\n           We all believed in the \"miracle\"\n           of Cortisone until our patients\n           went psychotic on it. Now it's\n           L-Dopa.\nHe hands over the papers - xeroxed articles from medical\njournals and newspapers which Sayer gave him to read - and\nkeeps going, Sayer straggling a few steps back.\n                     SAYER\n           With all due respect, I think it's\n           rather too soon to say that.\n                                             :\n                     KAUFMAN\n           With all due \"respect,\" it's\n           rather way too soon. Let the\n           chemists do the damage.\nThe gap between them widens as Sayer slows. He expected this\nsort of reaction from Kaufman, but had hoped for another.\nKaufman disappears into the building.\n\n77A. INT. KAUFMAN'S OFFICE - LATER - MORNING                       77A\nThe stack of papers drops onto Kaufman's desk. The one on top\nreads, NEW DRUG LETS SHAKING PALSY PATIENTS EAT JELL-O.\n                     SAYER\n           Did you read the case - the\n           husband who came home to find his\n           wife singing. She hadn't felt\n           like singing in years.\nKaufman, on the phone, glances to Sayer long-sufferingly, lets\nhim wait while he finishes with his call, and eventually sets\ndown the receiver.\n\n                                                 REV.12/13/89 (YELLOW)     Pg.\n\n           77A.CONT.             KAUFMAN                                   77A.\n                       I read them all. Soberly. All\n                       thirty cases had mild Parkinson's.\n                       Your Parkies - if that's what they\n                       are - haven't moved for decades.\n                       You know better than to make a\n                       leap like that, you want to\n                       believe there's a connection, that\n                       doesn't mean there is one.\n                                 SAYER\n                       What I believe, what I know, is\n                       that these people are alive\n                       inside.\n                                 KAUFMAN\n                       How do you know? Because they\n                       catch tennis balls?\n                                    SAYER\n                       I know it.\n           Sayer doesn't elaborate, but his tone is resolute. And it has\n           the intended effect on Kaufman, causing him to consider the\n           possibility that Sayer could, somehow, know it as a fact.\n                                   KAUFMAN\nr..iiJi!                And what if this drug were to\n                        kill them?\n                                SAYER -\n                           (right back)              >\n                     And what if this drug were to\n                     cure them?\n           Somewhere behind Kaufman's eyes Sayer can see, he thinks, a\n           change, or reminiscence, long ago, long buried, of things he\n           once believed or wanted to believe.\n                                  KAUFMAN\n                       How many did you think I ' d let you\n                       put on it?\n                                   SAYER\n                       All of them ... some of them ...\n                       one of them . . .\n                                KAUFMAN\n                       One. With the family's consent.\n                       Signed.\n           Sayer tries to hide his elation and turns to leave before\n           Kaufman changes his mind.\n\n                                        REV.12/13/89 (YELLOW)       Pg.46\n\n    77A.CONT.                KAUFMAN                                 77A.\n                Sayer -\n    Sayer turns. He was almost to the door. He had almost made            *\n    it out.\n                          KAUFMAN\n                That \"immense\" project of yours.\n                The myelin? The worms? When that\n                failed, what was the reaction of\n                your lab supervisor?                                  ·\n    Sayer thinks about lying, but senses Kaufman knows the answer         *\n    already and just wants to hear him say it. So he does:\n                          SAYER\n                He asked me to leave.   .\n    Kaufman nods like, Just checking. And -\n                             KAUFMAN                     .\n                Good luck.\n    Sayer leaves.\n\n    78.   INT. MRS. LOWE'S APARTMENT - NIGHT                          78.\n                                               :\n\n\n    A standard consent form and pen on a kitchenette table. Two\n    coffee cups. One used tea bag.\n                           SAYER\n                People with ordinary Parkinson's\n                Disease sometimes complain that\n                they've \"lost their grace . . . \"\n                      (he picks up a cup\n                       with a shaking hand)\n                They have to think about the\n                things we just do . . .\n                      (with great \"trouble\"\n                       he sets it down)\n                It has to do with a chemical in\n                the midbrain, or rather the lack\n                of it, called dopamine. L-Dopa\n                replenishes this dopamine, making\n                it possible for these patients\n                to move more naturally.\n    He picks up the cup again, gracefully, and sets it down.\n                          MRS. LOWE\n                Leonard has Parkinson's Disease?\n\nQ\n\n                                    REV.12/13/89 (YELLOW)\n\n78.CONT.              SAYER\n           No. No, his symptoms ... are\n           like Parkinsons ... and then again\n           they're not.\nShe doesn't understand what he means; there's no reason why she\nshould.\n                      MRS. LOWE\n                 (pause)\n           Then what will this medicine dp.\n           for him?\n                     SAYER\n           I don't know what it'll do for\n           him, if anything.\n                     MRS. LOWE\n           What do you think it will do?\n                     SAYER\n           I don't know.\n                      MRS. LOWE\n           What db< you hope it will do?\n\n                                                   REV. 10/13/89   p.47\n                          SAYER\n                I hope it'll bring him back from\n                wherever he is.\n(O                         MRS. LOWE\n                To what?\n                           SAYER\n                To the world.\n                           MRS. LOWE\n                      (pause)\n                What's here for him after all\n                these years?       '\n                          SAYER\n                You are here.\n     She ponders that and the enormity of the whole situation, all\n     the while staring at the consent form.\n\n                                                                          79\n     79.   INT. PHARMACY, BAINBRIDGE - DAY\n     The hospital pharmacy, a subterranean structure built into the\n     basement, cluttered from floor to ceiling with medicines.\n     Ray, the pharmacist, dips into a bag of powder. He spoons some\n     out onto a scale and looks to Sayer to tell him the dosage.\n                          SAYER\n                I have no idea. What do you say\n                we ease into it with ... what, »      .\n                fifty milligrams?\n     Ray begins to measure five milligrams.\n                          SAYER\n                Let's say a hundred.\n     Ray shrugs; it's okay with him. He knifes at the powder,\n     removing all but 100 milligrams.\n\n     80.   INT. LEONARD'S DAYROOM - DAY                                   80\n     Leonard, sphinx-like in his wheelchair, his mother by his side.\n     Sayer, stirring the L-Dopa into a paper cup of orange juice.\n     Miss Costello, in the doorway, watching. Sayer hands the glass\n     to Mrs. Lowe.                                  v\n     (NOTE: Consult w/Sacks on this; may need the contents of a '          *\n     capsule emptied into the cup)  -             '-'\n\n                                                          RSV. 10/13/89   p.48\n                               SAYER\n                     Leonard? Your mother's going to\n                     give you some juice. There's\n                     medicine in it which is why it may\n                     taste more bitter than usual.\n          Sayer glances to Mrs. Lowe. It's as if they've rehearsed it\n          all. She holds the glass to her son's lips and gradually\n          drains the liquid down his throat.\n          Nothing immediately happens, of course, but they all, with the\n          exception of Leonard, look as if they expect it to. Mrs. Lowe\n          hands the empty glass back to Sayer.\n          And they all wait.\n\n          81.   INT. THE PHARMACY, LATER - DAY                                   81.\n          Ray measuring out another 100 milligram dose.\n                                RAY\n                    Maybe the acid in the orange juice,\n                     neutralized it.\n                                SAYER\n                    Or maybe it's not enough.\n                                    .                *                           ·\n^··,-N    . Ray tosses Sayer a look that says, \"don't push it.\" Sayer\n\\0     \" n od s .             ·      .\"'·          \"\n                                SAYER\n                     I'll try it in milk.\n\n          82.   INT. LEONARD'S WARD - NIGHT                                      82.\n          An empty milk glass on a night table. \"\n          Leonard, in his wheelchair, in pajamas, still and silent under             *\n          the painting of the boat.\n          His mother, Sayer and Miss Costello watch and wait while around            *\n          them nurses atid orderlies hoist other patients into bed.\n\n          83.   INT. THE PHARMACY - DAY                                          83.\n          Ray scrapes powder from the scale into a pharmaceutical funnel\n          which takes it down onto a miniature glass dish. Handing the\n          dis h to Say er --     ;\n                                RAY\n                     Five hundred milligrams.\n\n                                              REV. 10/13/89 p.49\n\n84.   INT. LEONARD'S DAYROOM - DAY                                   84.\nAnother empty milk glass. Leonard, stoic, or     so it seems, in\nhis wheelchair. His mother and Sayer and Miss     Costello waiting\nfor a movement, a change of expression, a sign    of any kind that\nsomething is happening inside him. But there's   nothing . . .\n\n85.   INT. BAINBRIDGE - NIGHT                                        85.\nA corridor. Mrs. Lowe is leaving.    Sayer is with her, seeing *\nher to the door.\n                     SAYER\n           I'll call if there's any change.\n                     MRS. LOWE\n           Yes.\nNeither really knows what else to say except for good night.\nShe leaves.\n\n86.   INT. LEONARD'S WARD - NIGHT                                    86.\nSayer and Miss Costello lift Leonard out of his wheelchair and\ninto his bed.\n                     MISS COSTELLO\n           I'm going home too. If you need\n           me . · *\n                     SAYER\n           Yes, I'll call.\nThey nod \"good night\" atT each other and Miss Costello leaves.\nSayer slumps into Leonard's wheelchair. lAnd waits.\n\n87.   INT. THE PHARMACY - NIGHT                                      87.\nRay has gonejhome, too. Sayer, alone in the pharmacy, measures\nout 1000 milligrams, ten times the original dose.\n\n88.   INT. LEONARD'S WARD - NIGHT                                    88.\nSayer at Leonard's bedside, holding the glass to Leonard's\nlips, draining the liquid into him, all of it.\n\n89.   INT. LEONARD'S WARD - LATER - NIGHT      .                   8\nSayer asleep in the wheelchair. He stirs. Wakes. And takes a\nmoment to remind himself where he is. And why. His eyes\nnarrow, uncomprehending.\nLeonard's bed is empty.\n\n                                                                   9\n90.   INT. DAYROOM - LATER - NIGHT\nA claw of a hand dragging a crayon across a sheet of paper.\nTight on Sayer, framed in a doorway, as still and silent and\nentranced as a post-encephalitic.\nHis perspective of the dayroom -- deserted except for a figure,\na patient, Leonard, hunched over the table.\nAs Sayer crosses toward him, Leonard's head slowly rises.\nSayer sits opposite him and they consider each other in silence\nfor several moments.\nLeonard struggles to speak, to form words. They come out in a\nhalting cadence, flat, without inflection, and are only barely .\nrecognizable as words:                   .\n                     LEONARD\n           It's quiet.\n                        SAYER\n           It's late.    Everyone's asleep·>\n                     LEONARD\n           I'm not asleep?\n                     SAYER\n          No.   You're awake.\nThough he nods, it's unclear whether Leonard realizes how\nsignificant that is. Sayer gestures at the piece of paper\nbeneath Leonard's hands.\n                        SAYER\n          May I?\nSayer draws the paper across the table. It's covered with what\nseems imponderable hieroglyphic-like scrawl. But there is\norder in the chaos. Letters. Leonard's name.\n                        LEONARD\n          Me.\n\n91.    INT. EXAMINATION ROOM - DAWN                                 91\nAlone in the room, Leonard moves slowly around it, feeling\nthings: the smoothness of the cabinet glass/ the warmth thrown\nby a desk lamp, water from the cooler splashing onto his hand.\n                       SAYER O.S.\n            Leonard?\nLeonard turns to Sayer's voice with an expression of child-like       ,\nwonder on his face.\n                      SAYER\n            Your mother is here.\nShe appears in the doorway of the room. She's done her hair,\nher face, she's put on a nice dress, yet she remains unprepared\nfor this reunion. She can do nothing but stare at her \"infant\nson\" who is now, \"suddenly,\" a man.\nAs he slowly crosses toward her, she is struck by the fact she\nmust look u£ in order to meet his eyes. He reaches her.\nReaches out to her. And she embraces him.\n\n92.    INT. CORRIDOR - MORNING                                     .92.\n                                             :\n\n A corridor crowded with patients in wheelchairs with nowhere to\ngo and nothing much to do.\n                      MISS COSTELLO\n            My name is Elizabeth. It's a »\n            pleasure to meet you.\nLeonard, standing, reaches for her hand and struggles to\npronounce her name correctly. Fighting to keep from crying in\nfront of him, Miss Costello glances to Sayer and Mrs. Lowe.\n\n                                                                    93.\n9.3.   INT. ANOTHER CORRIDOR - MORNING\nMiss Costello, flanked by Sayer and Mrs. Lowe, watches as\nLeonard extends his hand to the \"card playing nurse.\"\n                     MARGARET\n           How do you do, sir? My name is\n           Margaret.\n                       LEONARD\n           Margaret.\n\no   94.   INT. ANOTHER CORRIDOR - MORNING                              9\n    Margaret has joined the \"tour, group\" and introduces Leonard to\n    the \"music orderly.\" They shake hands.\n                         LEONARD\n               Fernando. How are you?\n                         FERNANDO\n               Great, man. How're you?\n                         LEONARD\n               Great, too.\n\n                                                                       9\n    95.   INT. THE PHARMACY - MORNING\n    Fernando is along for the ride and watches Leonard shaking Ray\n    the pharmacist's hand.\n                         RAY\n               How do you do, Mr. Lowe?\n                            LEONARD\n                                 !\n               Good, sir.\n\n                                                                      95\n    95A. INT. CAFETERIA KITCHEN -MORNING\n    The cooks and kitchen workers around Leonard and his entourage,\n    shaking his hand.\n                                             >.                .\n    96. INT. STAFF CAFETERIA - LATER - DAY                            9\n    A tray of truly awful cafeteria food. The group, minus Sayer\n    and Miss Costello, watches Leonard dip a fork into some mush-\n    like concoction and manipulate it, with difficulty, to and into\n    his mouth. He seems amazed by its flavor.\n                         LEONARD\n               It's delicious.\n                         FERNANDO\n               I wouldn't go that far, Len.\n    Sayer and Miss Costello, at another table, glance over to the\n    others who are all laughing. Sayer smiles.\n                         MISS COSTELLO\n               I don't think I could deal with\n               losing 3D years of my life. I\n                can't even imagine it.\n\n                                             REV. 10/13/89 p.53\nSayer's smile fades. The possibility that Leonard might not\nhave realized the extent of the passage of time had not, until\n this moment, occurred to him. He stares blankly at Miss\n Costello.\n                     MISS COSTELLO\n           He does realize it, doesn't he?\nSayer nods uncertainly.\n                       SAYER\n           He must.\n\n                                                                  97.\n97.   INT. EXAMINATION ROOM - LATER - DAY\n                (NOTE: CONSULT SACKS ON THIS SCENE:)\nSayer demonstrates a clapping motion. Leonard repeats it more\nslowly but with decent motor control.\n\n\n                       SAYER\n           Splendid.\nSayer makes a note. They are alone in the examination room\nwhich, like most of the hospital, has little in it to indicate\nthat it is not the 1930's.\n                     SAYER\n           Can I see you walk the length of\n           the room?                        *\nLeonard walks slowly across the room past the perception tests\nand notes and Polaroids cluttering the wall. Coming back, he\npauses. He's looking at a picture of himself taped there.\nSayer watches him slowly reach his hands to his face to feel\nhis features. He stares at the photograph of himself, trying\nto comprehend that which cannot be comprehended.\nHe's not younjg anymore.\n                                                                  98.\n98.   OMITTED\n99.   INT. LEONARD'S WARD - NIGHT                                 99.\nSayer and Mrs. Lowe at Leonard's bedside.\n\n                                                                  RE V. 10 /1 3/ 89   p .54\n                                 L EO N AR D\n                 I ' m af r ai d to cl os e m y ey e s . . . If\n(y\\              I close my eyes . . .\n      He hesitates, as if saying it may make the fear more real.\n                           SAYER\n                 . . . you'll sleep. And when you\n                 wake up in the morning, it will be\n                 the next morning. I promise.\n      Sayer's smile tries to assure them both that it will happen\n      just that way. He excuses himself, leaving Leonard with his\n      mother, joins Miss Costello by the door and glances back. Mrs.\n      Lowe is stroking Leonard's head as she hums a lullaby.\n\n      100.   INT. ROOM ADJACENT TO EXAMINATION ROOM - MORNING                             100.\n      Sayer comes in with some books, sets them on Miss Costello's\n      desk and crosses to a closet.\n                           SAYER\n                 I didn't sleep, did you?\n                           MISS COSTELLO\n                 Does it look like it?                   .\n      Sayer hangs up his jacket and slips into a lab coat.\n                           SAYER\n                 Do you know if Leonard's awake?\n                                                             v\n      She smiles and points toward the adjoining examination room.\n\n      101.   INT. THE EXAMINATION ROOM - MORNING                                              101.\n      Showered and shaved and groomed and bright-eyed, Leonard sits\n      listening to his own heartbeat with Sayer's stethoscope.\n      Coming in --\n                    i      SAYER\n                 Good morning.\n                          LEONARD\n                Good morning.     .\n      His speech is still rather flat, halting.,\n                           SAYER\n                 Been waiting for me long?\n                              LEONARD\n                Yes.\n\n                                                      REV. 10/13/89 p.55\n\n      Sayer smiles.    He hands Leonard the books.   History books. An\n      almanac.\n                           SAYER\n                Some things have happened while\n                you've been away. I thought you'd\n                be interested.\n      Leonard opens one carefully, reverently, and begins reading\n      from it to himself.\n                           SAYER\n                 You don't have to read them now,\n                 Leonard. They're yours. At your\n                 leisure.\n      Leonard closes the book but holds onto it and the others like\n      they're gold.\n                          LEONARD\n                I used to read quite a lot.\n                                                                  .\n                Before.\n                          SAYER i\n                Yes, I know.      .\n                           LEONARD\n                Thank you for these.\n            i                       .\n      Sayer nods that he's welcome.\n                           SAYER\n                Have you thought about what you'd\n                like to do today?\n                           LEONARD\n                Everything.\n                           SAYER\n                      (smiles)\n                I'm not sure I can arrange that.\n                            LEONARD\n                Try.\n      Sayer smiles again. For a man who just yesterday learned he\n      has been cheated out of the greater\"- part of his life, Leonard\n      seems to have recovered extraordinarily.\n                          SAYER\n                Let's approach it this way. What              . \".\n  x             do you think you'd like to do                    .\n1J              first?                                       ..·\n\n                                             REV. 10/13/89 p.55A\n                                             (continuity only)\n                    LEONARD\n          I'd like to go outside.\n\n101A. EXT. BAINBRIDGE HOSPITAL - DAY                              101A\nSayer and Leonard emerge from the hospital and move under trees\nalong a path toward the parking lot. At a point, the doctor\nrealizes his patient is no longer at his side; he's several\nsteps back, feeling the sunshine on his skin.\n\n      102.   EXT. PARKING LOT, BAINBRIDGE - MORNING                      102\n(p\\\n      Though it is only a Toyota, its dashboard, to Leonard,\n      resembles something out of Jules Verne. He allows Sayer to\n      buckle his seatbelt for him and watches with fascination as\n      Sayer performs the \"complex\" preparatory sequence necessary,\n      apparently, to make the car go.\n      The car pulls away. Above, framed in a second story window of\n      one of the buildings, stands a lone figure looking out --\n      Leonard's mother.\n\n      103.   INT. SAYER'S CAR - MOVING - MORNING                         103\n      Tight on the radio. Sayer switches it on. To Leonard's\n      amazement, classical music fills the interior\n\n      and CONTINUES OVER:\n\n      104.   EXT. THE BRONX - MOVING SHOTS - MORNING                     104\n      Billboards advertising color televisions and electric shavers.\n      Buses which have grown over the decades to a behemoth scale.\n      \"Ultra-modern\" housing projects and gas stations.\n      \"Futuristic\" cars.\n      Leonard cannot imagine a more enthralling re-introduction to\n      the world and stares at it all with wonder. Everywhere he\n      looks there is something \"extraordinary.\"\n                           LEONARD\n                 What a wonderful place The Bronx\n                 has become.\n      The music CONTINUES OVER:\n                        ''   '                           *\n\n\n      105.   INT/EXT. NEW YORK BOTANICAL GARDENS - DAY                   105\n      A rose.       ,\n      Leonard puts his face close to it to appreciate its fragrance.\n      He touches its petals gently, explores them, and is quietly\n      astonished by the tactile sensation.\n      Sayer watches. He, too, can appreciate wonders of the real\n      world, especially those of a botanical nature, but not with, the\n      purity or intensity Leonard can.\n      Pulling back reveals them in the middle of a vast garden of\n      countless thousands of roses.\n\n106.   INT. SAYER'S CAR - MOVING - DAY                            106\nLeonard turns the radio dial from the classical station to\nanother playing a very different kind of music, and listens to\nit bemused but intrigued. It's John Lennon singing \"A DAY IN\nTHE LIFE\"\nand it CONTINUES OVER:\n\n107.   EXT. PARK - THE BRONX - LATER - DAY                        107\nChildren playing flag-football on an expanse of grass. Dogs\nrunning around, nannies with prams, lovers.\nA disk, a frisbee, falls at Leonard's feet. He retrieves it\nbut has no idea what it is or what to do with it. Sayer\ndemonstrates the wrist action with an invisible one. Leonard\ndoesn't get it. Sayer takes it from him and flings it\npathetically not halfway back to its owners.\nThe music CONTINUES OVER:\n\n108.   EXT. STREET CORNER JOINT - THE BRONX - LATER - DAY        108.\nLeonard watches with interest a Carvel ice cream machine. He\nand Sayer are handed cones and Leonard's attention moves to a\ngirl wearing an unbelievably short skirt.\nHer boyfriend stares at Leonard. Sayer tries to pull his\ncharge's attention elsewhere. Leonard, finally, glances away,\nup, to a sound overhead.\nThe music CONTINUES OVER:\n\n                                                                  109\n109.   EXT. KENNEDY AIRPORT - DAY\nA 747 roaring down a runway. At the edge of it, it lifts off\nand thunders over Sayer and Leonard and the parked Toyota.\nExhilerated, Leonard waves.\nThe music CONTINUES OVER:\n110.   OMITTED                                                    110\n111.   EXT. THE BRONX / CITY ISLAND - DAY                         111\nAn expressway. The Toyota traveling at \"astounding\" speed,\npassing a sign that reads CITY ISLAND.\n\n                                               R!V. 10/13/89   p.58\n    Boats and fish markets and lush vegetation. Paradise compared\n    to the Bronx. The Toyota turns down a side road near the water         t\n    and into the driveway of Sayer's small wooden house.\nw   '.·.                     .         '\n    And the mus ic ends.\n\n    112.   INT. SAYER'S KITCHEN / DINING ROOM - DAY                       112.\n    Tea bags steeping in a pot on a cluttered kitchen counter.\n    Sayer, exhausted from the day, hunts in vain through packing\n    boxes on the floor for crackers, cookies, something he can\n    offer his guest.\n    He keeps glancing in at Leonard, who's wandering around the\n    dining room, navigating around packing boxes, to browse at the\n    spines of books. Noticing Sayer watching -\n                          LEONARD\n               You just moved here.\n                         SAYER\n               Yeah. Well, five years ago.                                 ,\n    Sayer shrugs, disappears into the kitchen a moment . . . before            ;\n    peeking back in to see what Leonard is looking at now: a small             i\n    framed photograph of a boy with a toy sailboat and a forlorn\n    expression posed in front of a curtain; the boat obviously a\n    photography studio prop.\n                           LEONARD\n               Your son?\n                         SAYER\n               Me, actually.\n                                       '      ,,\"                     t\n                          LEONARD\n                     (looking closely at                              '\n                      the photograph)\n               You seem uncomfortable.\n                          SAYER\n               I probably was.\n    Sayer disappears into the kitchen again. And a moment later\n                                                                               .\n    glances back in around the door frame at Leonard who has moved\n    over to an old sideboard on which several pairs of glasses are\n    neatly arranged.                   ·\n                                       /·\n                         SAYER\n               Each has a specific purpose.\n\n                                                   REV. 10/13/89   p.59\n    As Leonard considers each pair of glasses ...\n                          SAYER\n               Those are my normal interior\n               glasses. And spare pair. Those,\n               I wear outside. Two pairs, in\n               case I los.e one. Those, those are\n               my daytime reading glasses. And\n               spare. Those are for close work.\n               For fine print. Those are my\n               nighttime reading glasses -\n\n    Leonard's examining the frames of this last pair closely.\n                         SAYER\n               That's heavy-gauge metal so when I\n               fall asleep and roll over on them\n               I don't wreck them. They're\n               indestructible.\n    Leonard returns the indestructible ones to their proper place\n    and considers them all together.\n                         SAYER\n               As long as I pretty much know\n               ahead of time what I'll be looking '\n               at, it works out, I don't have to\n               carry all five pairs around.\n                         LEONARD\n               What if you just want to go for a\n               walk?\n                          SAYER\n                     (pause)\n               Walks are a problem. Walks are\n               the hardest thing. You just never\n               know.\n    He's absolutely serious, like a man plagued for years by an\n    imponderable dilemma. He retreats back into his kitchen before\n    reappearing again with the pot of tea, two mismatched cups and\n    some saltine% on a tray.\n                         SAYER\n               I hope you'll forgive the\n               inelegant presentation. I don't\n               entertain much.       ·/·       .\n\n                                                                          113.\n    113.   INT. SAYER'S LIVING ROOM - DAY\n    They've cleared places on the sofa and chair and sit there\nQ   sipping their tea.       *\n\n                                                  REV. 10/13/89 p.60\n                      SAYER\n           I can date my interest in science\n           precisely, actually. I'd been                                   *\n           sent off to boarding school - a\n           place perhaps not quite as\n           Dickensian as I remember it - when\n           I happened to come across the\n           periodic table of elements.\n                 (smiles at the\n                  thought)\n           I memorized it. Which I admit was\n           a rather precocious thing for a\n           seven year old to do. And I\n           remember feeling . . . not so much a\n           sense of accomplishment . . . as\n           comfort. The halogens were what\n           they were. The alkali metals were\n           what they were. Each element had\n           its place, and nothing could                                    *\n           change that. They were secure, no                               *\n           matter what.                                                    *\n Leonard nods, perhaps more out of politeness than                      *\n understanding. Sayer nods too, feeling, perhaps, a little             *\n exposed.\n                     LEONARD\n                                           :\n           You're not married.\n* It seems to Sayer a non sequitor.                                        *\n                      SAYER\n           No.\nHe smiles. Sips his tea. Silence except for the ticking of a           *\nclock somewhere. Then, very matter of factly -\n                       SAYER\n           I'm not terribly good with people.\n           I like them. I wish I could say I\n           had more than a rudimentary\n           understanding of them.\n                 (pause)\n           Maybe if they were less\n           unpredictable . . .\nHe shrugs. Silence again.\n                     LEONARD\n           Eleanor would disagree with you.                                *\nSayer stares at him blankly. He doesn't seem to know who\n\"Eleanor11 is.                                .                            *\n\n                                                        REV.10/13/89    p.61\n                                 SAYER\n-~                   Eleanor?\n^r *                           LEONARD\n                     Miss Costello.\n                                SAYER\n                     Oh, yes, of course.\n                           (uneasy)\n                     She's spoken to you about me?\n          Leonard nods. Sayer can't imagine why, nor what she might have\n          said. Fearing the worst --\n                               SAYER\n                     What'd she say?\n                               LEONARD           '\n                     That you're a kind man. That you\n                     care very much for people.\n          Sayer shifts in his chair uncomfortably.\n                                a.\n                               LEONARD\n                     But you meant normal people.\n          Sayer seems at a loss as to how to respond.   The accompanying\n/til**)    silence grows awkward.                                 7\n\n                               SAYER\n                     We should be getting back.\n          Sayer crosses over to the sideboard, to the pairs of glasses,\n          stares at them for several moments, and picks up two pairs.\n          114.   OMITTED                                                       114\n          114A. EXT. PARKING LOT - BAINBRIDGE - DAY                        114A.\n          Climbing out of his car, Kaufman sees Sayer striding toward\n          him. He glances to the sky, Kaufman, to God, and silently\n          complains to Him.\n                     '4\n          115.   INT. STAFF CAFETERIA, BAINBRIDGE - LATER - DAY                115\n          Cafeteria workers carting serving trays back to the kitchen.\n          Nurses and orderlies and office workers at tables with finished'\n          meals and cups of coffee. They seem unaware of Drs. Sayer and\n          Kaufman at a table near the door.\n                               KAUFMAN\nz^                   When you say expensive, what are\n                     we talking about?\n\n               To put them all on the dosage Mr.\n               Lowe is on . . . about twenty\n               thousand dollars.\n     Kaufman stares at Sayer aghast. He knew L-Dopa was expensive,\n     but not that expensive. He manages to recover somewhat.\n                         KAUFMAN\n               That would be for how long?\n                         SAYER\n               About a month.\n                          KAUFMAN\n               A month?\n     Sayer nods. Kaufman glances away.   Stares blankly at faces at\n     other tables. Back to Sayer.\n                          KAUFMAN\n               I can't go before the board with\n               that. I could . . .\n\n\n     He laughs to himself at the futility of it.\n                         SAYER\n               I was thinking of speaking to the\n               patrons.\n                         KAUFMAN\n               The few patrons this hospital has\n               give what they can.\n                         SAYER\n               Well, we'd have to convince them\n               to give more than they*re\n               accustomed to giving.\n\n     He hadn't intended as impudent a tone as that which came out.\n     More calmly ~\n                           SAYER\n                Perhaps if they saw Mr. Lowe.\n     . .;. ·· -; '     ..'·' ' : '. :..;. .,.-, '    ·'    \"'    · ·' ·:\n                           KAUFMAN\n                I think you overestimate the\n               effect Mr. Lowe has on people.\n               We're talking about money here.\n     Kaufman sips at his coffee and slowly becomes aware   of the\n     silence around them. No one is talking. He glances    up as Miss\n     Costello walks by setting something on the table in   front of\n     him. She leaves the cafeteria without a word.\n\nCD   Kaufman glances down. She has left a Bainbridge payroll check )\\cz>\n     made out in her name. Kaufman turns it over. She has endorsed\n     it back to Bainbridge Hospital.\n     Fernando walks by and    out, leaving his salary check on the\n     table. Then Ray, the    pharmacist, leaving his. Then the nurse\n     who reluctantly read    \"Moby Dick\" to the patients. Then a\n     cafeteria worker. A     secretary. A clerk. A janitor.\n     The cafeteria is soon empty, except for Sayer and Kaufman.\n     Long silence.\n\n     116.   INT. BOARD ROOM - NIGHT                                    116\n     8mm film of Leonard before L-Dopa -- a wide shot of him\n     absolutely motionless in his wheelchair.\n                            SAYER O.S.\n                There was extreme rigidity of the\n                axial musculature . . . only vague\n                available motion in the neck . . .\n                no voluntary movement in the\n                limbs . . .\n     A tight shot of Leonard's entranced face appears on the screen.\n                          SAYER O.S.\n                Perhaps most striking was the\n                profound facial masking -- which\n                we now know should not have been\n                confused with apathy.         *\n     Tight on Sayer, the light from the projector flickering on his\n     face.\n                         SAYER\n               Virtually aphonic, Mr. Lowe could\n               articulate no words, but rather\n               only, with considerable effort, an\n               occasional noise, a kind of,\n               \"h .. . \"\n                A                                      ·\n     In the darkness sit Kaufman, the rest of the Board of\n     Directors, some elderly patrons of the hospital, and, near\n     Sayer, Miss Costello. She hands him a scribbled note.\n     \"Less scientific\" it reads.\n\n                     SAYER\n          Isolated circumstances -- the\n          mention of his name, notes of\n          particular pieces of music, the\n          touch of another human being --\n          managed on occasion to briefly\n          summon him, but these awakenings\n          were rare and transient, lasting\n          only a moment or two.\nSayer glances to Miss Costello.   She nods, \"Good, that's\nbetter.\"\n                      SAYER\n          The rest of the time he remained\n          in a profoundly eventless place ~\n          deprived of all sense of history\n          and happening and self --\n          encysted, cocooned, enveloped in\n          this metaphorical if not\n          physiological equivalent of sleep\n          . . . or death.\nTight on the screen, on Leonard, as he was. Looking more like\na photograph of a man than a motion picture of one.\n                    SAYER\n          This was his condition when first\n          seen by me in a remote bay of this\n          hospital. And the quality of his\n          life for the last 30 years.\nThe \"before picture\" of Leonard on the screen is replaced with\nthe \"after\" -- his eyes alert, his hands exploring a desk\nmicrophone. He glances up and off at something.\n                      LEONARD (FILM)\n          Now?\n                    SAYER'S VOICE\n          Whenever you're ready.\n                     LEONARD (FILM)\n          My name is Leonard Lowe. It has\n          been explained to me that I have\n          been away for . . . quite some\n          time . . .\nHe seems to withdraw, to wrestle with the thought, to try to\nsomehow come to terms with it, to somehow resolve it. He nods\nas he finds within himself some source of strength and looks\ndirectly at the camera.\n                      LEONARD (FILM)\n          I'm back.\n\n117.   INT. BOARD ROOM, LATER - NIGHT                            117\nThe lights are on, the screen rolled up, the board members and\npatrons visibly moved, almost shaken, and silent.\nEventually one of the patrons, an old woman, reaches into her\npurse for her checkbook and a pen. Another patron, an elderly\nman, pulls a checkbook and pen from an inside jacket pocket.\nAnother already has hers out in front of her ...\nSayer and Miss Costello exchange a glance. The room is\nabsolutely silent, except for the muted scratch of pens on\npaper.\n\n                                                                 118.\n118.   INT. THE PHARMACY - DAY\nThe raw L-Dopa powder, 20,000 dollars worth, has arrived. It\nsits on a pharmacy counter in large clear bags. Sayer and Ray\npeer between racks of medicine at two teenage girls and two\nvery old men chatting in a corner of the pharmacy.\n                     RAY\n           They're volunteers from the   :\n           neighborhood.\n                        SAYER\n           Wonderful.\n                                             v                   119.\n119.   OMITTED\n120.   INT. LEONARD'S DAYROOM - DAY                              120.\nSeveral empty medicine paper-cups. The \"garden of stone,\"\nreassembled. Sayer knows better than to sit and wait, that\nnothing is going to immediately happen, but he sits and waits\nanyway. As does Miss Costello. As does Leonard and his\nmother.\n\n121.   INT. STAFF ROOM - NIGHT               .                   121\nSayer asleep on a couch that's too short for him. Miss\nCostello asleep on another.\n                        VOICE\n           Dr. Sayer?\nSayer wakes to find a night nurse standing over him.\n                     SAYER\n           What is it?\n\n                                                                            ry\n                                               (continuity only)\n121. CONT.                                                             121.\n                       NIGHT NURSE\n             It's a miracle.\n\n121A. INT. CORRIDOR - NIGHT                                            121A.\n                                                                   i\nThey move along a silent corridor that seems to stretch out\nforever -- the doctor, the two nurses -- carrying themselves\nprofessionally, with sobriety and restraint. But as they near\nthe ward, as they're joined by others, other nurses, orderlies,\ntheir steps and hearts quicken. They break into a trot.\n\n                                                                           122.\n122.     INT. LEONARD'S WARD - MOMENTS LATER - NIGHT\nThey appear at the threshold, Sayer, Miss Costello, the night\nnurse, the others, and peer into the darkened room:\nIn the quiet, in the shadows, in the moonlight filtering in\nthrough the windows, the post-encephalitics are emerging from\ntheir \"cocoons,\" rising from the \"dead\" like Lazarus from the\nearth, reborn.\nMoving slowly past the beds: A figure rediscovering the\nfeeling of her skin; another, the sound of his breath; another,'\nthe beating of her heart.\nA figure still asleep . . . wakes. And for the first time in\nnearly half a century sees herself in the world.\nTight on Sayer, on the look of awe on his face as he stares at\nthe scene going on in the darkened ward. His glance finds\nLeonard who is sitting up in his bed, smiling.\n\n123.     INT. LEONARD'S DAYROOM - DAY                                      123,\nTight on Lucy's face, deep in thought, lost in thought. After\nseveral moments of silence, she speaks -\n.,:, ·     . :... .        ,.LUCY    V    .   .·       *   .-..        .\n             . . . I just had the strapgest\n            dream . . .\nA cacophony   of off-screen voices - from a radio, the\ntelevision,   and the awakened post-encephalitics themselves -\nrises up as   another woman, Miriam, moves past Lucy's face. We\nfollow her,   as does a nurse with a blood pressure guage on\nwheels.                                    ,\n\n                                                  11/ b/ aa) tireen   Pg\n\n\n123.CONT.             NURSE                                           12\n            Miriam, please, I - (have to\n            check your blood pressure - )\n                      MIRIAM\n                 (interrupting)\n            I've been sitting for 25 years,\n            you missed your chance.\nMiriam and the nurse trailing after her pass in front of a man *\nwith no English (Josef) trying to explain something to a couple\nof orderlies. One to the other -   .\n                      ORDERLY 1\n            You're Italian, he's Italian,\n            what's the problem?\n                      ORDERLY 2\n            I was born here - X don't speak ·\n            Italian.\nNearby, another man. This one does speak English -\n                      BERT\n            I want a steak, rare. I want\n            mashed potatoes and gravy, string\n            beans, a slice of pie and a   '\n            chocolate phosphate.\nAnthony turns away with the tray he just brought in - broth,\njello and juice - and carries it away, passing the \"card\nplaying nurse,\" Margaret.\n                      ANTHONY\n            I think I prefer them the other\n            way.\nHaving settled on Margaret: she smiles, glances to \"her\"\npatient, Rose, who, staring at her reflection in a hand mirror,\ntugs at her grey hair.\n                      ROSE\n            And some dye. Black.\n                      MARGARET\n                 (jotting down the\n                  request)\n            Black, are you sure?\n                       ROSE\n            And some clothes . . . my. clothes.\n\n                                                                    i.1/ b/«y)Green       Pg.\n\n123.CONT.                                          -                                      123\nSh e p ull s at he r f ade d s hape les s d res s w ith gre at dis dai n.\n                        ROSE\n              Who put me in this?\n\nA be wi ld er ed m an o n st if f l eg s (F RA NK ) wa lk s by . Fo ll ow in g\nh im , we c at c h a gl i m ps e of a D u tc h wo m an i n a wh e el c h ai r , w i t h\na nurse -\n\n                         MAG DA\n              ... t he garden er, he mus t prune\n              the fruit trees ... the roses . . .\n              I think he's forget . . .\n\n- be f or e se t t li n g o n M i s s C o st e ll o wi t h a ma n wh o se e ms l os t in\na w or ld o f hi s ow n, h is he ad n od di ng s li gh tl y t o mu si c fr om a n\nunseen radio.\n\n                           M I SS C OS TE LL O\n              Ca n you s pe ak to me , Ro lan do ?\n              Ro lan do, it' s M iss Co ste llo. C an\n              yo u u nde rsta nd me?\n\nAp p a r e nt l y n ot . A fi g u r e bl u r s pa s t . An d a m om e n t la t e r ,\nan oth er, t he nu rse w ith t he pr ess ure g auge , sti ll tr ail ing\naf te r Mi ri am. T he c ame ra f ol low s th em -\n\n                         NUR SE\n              Miriam ... Miriam . . .\n\n- befor e set tling on a man , Des mond, doin g a soft- shoe.\nLe on ar d, a nd a f ew o th e rs , wa tc h. Fr an k bl ur s b y ag ai n, p as se s\na w oman , Fra ncis, sort of l ost, seat ed Wi th a nurse :\n\n                           F RANCIS\n              . . . I was aware of things, but\n              no thi ng mea nt a nyt hin g, the re w as\n              no connection to me.\n                     (vagu e recollec tion:)\n              There was a war . . .\n                     (pailse)\n              ... or two . . .\n\nMi ss C os te ll o no ti ce s F ra nk , st an di ng n ea rb y, lo ok in g pu zz le d.\n\n                              M IS S C OS T EL LO\n              F r a nk ? A r e y o u al l r i gh t ?\n\n                           FRANK                       <\n              M y wi fe a nd s on .     A re th ey w el l?\n\n                                               xu/ os > vaU.bL>£NKUD           Pg.6\n123.CONT.                                                          123.\nHiss Costello finds herself at a loss for a moment . . .\n                    MISS COSTELLO\n          We'll find them for you.     We'll\n          track them down.\nLucy again, Sayer still at her side.\n                     LUCY\n          . . . I called to my sister, but she\n          couldn't hear me. No one could\n          hear me. I was alone . . .\n                (pause)\n          And then I woke up.\nShe smiles. Sayer tries to. He hesitates ... but finally\ncan't help asking her -                                                ·\n                    SAYER\n          Lucy, what year is it?\n                    LUCY\n          What year is it? You don't know?\nHe shakes his head 'no.' She glances around the place, then\nleans close to him and whispers -\n                     LUCY\n           ·26.\n                     MIRIAM O.S.\n          DoctorI   Doctor!                                      .\n                                          *                                ,\nSayer turns to the urgent voice, concerned, and sees Miriam\nflanked by a large group of staff from other parts of the\nhospital gathered at the threshold of the room.\n                    MIRIAM\n          I walked all the way over there.\n          And back. What a perfect day.\nThe group at the doorway applauds, and it CARRIES OVER:\n\n123A. OMITTED                                              123A.\n123B. INT- CORRIDOR - SAME TIME - DAY                      123B. *\nThe corridor, and the sound of a woman's voice, very faint,   .*\nfrom somewhere unseen:                                           *\n                     PAULA O.S.\n          \" . . . Like crowds storming the                                       *\n          Bastille ...                                                           *\n\n124.-128.    OMITTED                                           124.-12\n129.   INT.'POST-ENCEPHALITIC DAYROOM - CONTINUED - MORNING      129.\nSidney bursts into the room out of breath and scans the faces\nof the awakened post-encephalitics and staff. He spots Sayer,\nseated with a woman, her back to him and the door. She slowly\nturns to look over her shoulder and, seeing Sidney, smiles.\n                      LOLLY\n            Hi, Sidney.\nThere's a kind of hush. Conversations, activities cease.\nEveryone is looking at Sidney. Not knowing what else to say,\nhe manages a hesitant --\n                           SIDNEY\n            Hi.        i\nHe smiles and crosses toward her, but by the time he reaches\nher the smile has disappeared. Something troubling has\noccurred to him. He glances to Sayer and whispers --\n                         SIDNEY\n            Is it real . . . or . . .\n                      SAYER              :\n\n            As real as real can be.\n                                         CONTINUED:\n\n                                                                  f123B.CONT.                              ,                      123B\nLeonard, moving along the corridor with Saver's camera and\ntripod (or looking for something to read at the magazine table)\nslows and listens:\n                      PAULA O.S.\n             . . . the Mighty Mets stormed\n           11\n           their locker room shortly after\n           nine o'clock on their night to\n           remember -\nHe moves toward the voice, traces it to a crafts area, where a\nyoung woman is reading from the sports page to an older man\ntied to his wheelchair.\nThough it's doubtful the man is even aware of her presence, she\nreads to him as if her were, and in the process, draws Leonard\ninto the sound of her words until there are no sounds but her\nwords:\n                     PAULA\n           \"Released from bondage and\n           ridicule after seven destitute\n           seasons, they raised the roof of\n           Shea Stadium - while their fans\n           attempted to dismantle it - in one\n           of the loudest, wildest victory\n           celebrations in baseball     :\n           history - \"         ._\nThe reverie is suddenly shattered, the real sounds of the\nhospital rising back up, as Sidney, wild with excitement, bangs\nthrough the far doors of the corridor. He sprints past the\ncrafts area, past Leonard, runs the entire length of the\ncorridor, and -\n\n                                                             124-12\n124-128.   OMITTED\n129.   INT. LEONARD'S DAYROOM - CONTINUED - DAY                    1\nSidney bursts into the room out of breath and scans the faces\nof the awakened post-encephalitics and staff. He spots Sayer,\nseated with a woman, her back to him and the door. She slowly\nturns to look over her shoulder and, seeing Sidney, smiles.\n                     LOLLY\n           Hi, Sidney.\nThere's a kind of hush. Conversations, activities cease.\nEveryone is looking at Sidney. Not knowing what else to say,\nhe manages a hesitant --\n                     SIDNEY\n           Hi.\n\n                                                . x x / x u / o ; I V a U i i U & e mU U   J r* g »\n\n\n       129.CONT.                                                                             129\n       He smiles and crosses toward her, but by the time he reaches\n       her the smile has disappeared. Something troubling has\n       occurred to him. He looks to Sayer and whispers --\n                               SIDNEY\n                   Is it real ... or . . .\n                             SAYER\n                   As real as real can be.\n       Sidney lowers himself to his knees before Lolly and, weeping\n                                                                                                 *\n       quietly, rests his head on her lap. She strokes his head.\n\n                                                   FADE TO BLACK\n\n       130.   INT. CORRIDOR - ANOTHER DAY                                                      13\n       Sidney and Lolly emerge from the dayroom, followed by the other\n       post-encephalitics. They're all wearing suits and dresses and\n       walk with purpose past wheelchair-bound patients with\n       \"uninteresting\" diseases.\n       As they wait for the elevator, Leonard wanders slightly down\n       the corridor to see if the girl is there again reading in the\n       crafts area. The chair she was in is empty.\n\n       130A. INT. ELEVATOR & CORRIDOR - MOMENTS LATER - DAY                                  130\n       The elevator door slides open revealing them. Paula, inside,\n       hesitates: the sight is almost surreal. >As they crowd in, she\n       wedges out, and down the hall, Leonard watching after her.\n                             ANTHONY\n                   Len - come on.\n       Leonard steps into the elevator, the last one in.\n\n       131.   EXT. BAINBRIDGE -SAME DAY                                                        13\n       They're going on a field trip. As they're escorted onto an\n       idling hospital bus, Leonard, outside it, tries to reason with\n       his mother:\n                             MRS. LOWE\n                   Sidney's going.\n                              LEONARD\n                   He's a patient, Mom.\nA3                            MRS. LOWE\n                              MRS. LOWE\nC -j               He's not the same kind of patient.\n\n                                                         XX / XU /O y / V aU J jU K NK U D    P\n\n\n        131.CONT.                           .                                                13\n                               LEONARD\n                    He's still a patient.       You're not\n                    a patient.\n                              MRS. LOWE\n                    I'm your mother.\n        Inside the bus, Miriam, anxious to leave, leans over the driver\n        to honk the horn. Leonard kisses his mother on the cheek and\n        turns away.\n                             MRS. LOWE\n                  Wait a minute.\n                        (he turns back)\n                  What on earth have you done to\n                  your hair?\n        He's parted it, apparently, on the \"wrong\" side. She pulls a\n        comb from her purse, recombs it \"correctly,\" straightens his\n        jacket lapels and steps back.                          '\n                              MRS. LOWE\n                    There.\n                              LEONARD\n                    There's your bus.                .\n        The public bus, behind her, coming down the street. As she\n        hurries to the corner, Sayer climbs down off the hospital bus.\n                              SAYER\n                    Ready?\n                                                                                         *\n                            LEONARD\n                  I've decided not to go.\n        He waves to his mother. Sayer stares at him.\n                              LEONARD\n                    I'm staying here.\n                              SAYER\n                    Why? What's wrong?\n                             LEONARD\n                    Nothing. Wave.\n        He waves again to his mother; she's boarding the public bus.\n        Sayer does as he's told, waves too. Impatient, Miriam honks\n        the horn again.\n                              MIRIAM\n'(_J)               Let's go, already.\n\n131.C0NT.                                .                        131\nAs the public bus pulls away, Leonard pats Sayer on the\nshoulder.\n                     LEONARD\n           I'll see you later, have a good\n           time.\nHe climbs the hospital steps and disappears inside, Sayer\nstaring after him. Miriam honks the horn again, and he climbs\naboard. The doors hiss shut and driver turns to him.\n                       BUS DRIVER\n           Where to?\nSayer suddenly realizes he has no idea \"where to.\" He glances\nover his shoulder at the expectant faces of the patients, all\ndressed up with nowhere to go. It's up to him . . .\nHis face brightens; he's thought of a good place.\n\n                                                                  132\n132.   INT. MUSEUM OF NATURAL HISTORY - NEW YORK - DAY\nMoving slowly toward a herd of still and silent elephants in a\ncavernous, darkened room.\nAs a nun counts the heads of parochial school children filing\npast the huge beasts, Miss Costello counts the heads of the\npost-encephalitics.\nBoth come up short and glance frantically around.\n                      NUN                    v\n                 (calling)\n           William?\n                      MISS COSTELLO\n                (calling)\n           Dr. Sayer?\n\n132A. INT. ANOTHER ROOM - NATURAL HISTORY MUSEUM - DAY          132A.\nA lifeless polar bear in a diorama \"stares\" out at Sayer who's\npeering in, intrigued. Miss Costello appears at his side.\n                    MISS COSTELLO\n          It's very hard to keep everyone\n          together, doctor.\n                    SAYER\n          Has someone wandered off?\n                       MISS COSTELLO\n          You.\n\n                                             (REV.11/10/89)GOLDENROD       Pg.\n\n        132A.CONT.                                                           1\n.,->,     She leads him away by the arm.\nCO                                                          .          .\n        133.   INT. SIDNEY'S DAYROOM - SAME DAY                             13\n        A dayroom thick with inactivity. And the voice:\n                              PAULA O.S.\n                   \"From the sleek skyscrapers\n                   of Wall Street where a tickertape\n                   blizzard filled the sky . . .\n        From the doorway, from a distance, Leonard watches Paula across\n        the room with her father, reading to him again from the\n        newspaper:\n                              PAULA\n                   \" . . . to the undistinguished\n                   bars of a hundred neighborhoods,\n                   New York yesterday went pleasantly\n                   mad over the World Champion\n                   Mets . . .\n                                                        '   ·\n        133A. INT. PATIENTS' CAFETERIA - LATER - DAY                       133\n        Paula moving along the serving line with a tray. Leonard, next\n        in line, moving along with his tray, a little too close. He\n        steals a glance.\n                             PAULA\n                   You following me?               *\n        Startled and embarrassed, Leonard withdraws.\n                              PAULA\n                   I'm kidding. I'm sorry. I saw\n                   you upstairs . . . just now.\n        Leonard nods without looking at her.\n                             PAULA\n                   Visiting someone?\n                              LEONARD\n                   No.                                 ·\n                              PAULA\n                   You work here.\n\n                              LEONARD\n                   I live here.\n\n                                         (REV.11/10/89)GOLDENROD   Pg.75\n133A.CONT.                                    .                     133\n                        PAULA\n                   (pause)\n             You're a patient?\nHe admits it with a nod, lags back again, and eventually dares       *\nanother glance at her.\n                       PAULA\n             You don't look like a patient.\n                       LEONARD\n                  (pause)\n             I don't?\nShe smiles and shakes her head 'no.1\n\n                                                                    134.\n134.   INT. PATIENTS' CAFETERIA- LATER - DAY\nLeonard and Paula at a table. At other tables are patients who\ndo look like patients.\n                       PAULA\n             I don't know if he knows I\n             visit him or not. I don't know\n             that he knows who I am. My mother\n             doesn't think so. She doesn't;\n             come around any more--\n                        LEONARD\n                   (pause)\n             But you do.\n                        PAULA\n             Sometimes I think I see something.                          *\n             I think I see a change. And for a                           *\n             second, I see him like he was . . .                         *\nShe smiles at the memory of her father like he was . . . but then   *\nit's gone and her smile fades.\n                       PAULA\n             Does that make any sense?\nA slow nod from him . . .                                  ·             *\n                       LEONARD\n                                                  s\n             Yes.                                              ·         *\nHis tone is that of someone speaking of a fact, rather than          *\noffering an opinion. She studies him . . . and eventually:           *\n                       PAULA\n             Why are you here?\n\n                                                (REV.11/10/89)GOLDENROD           Pg\n         134.CONT.\n         He doesn't know how to begin to explain it to her.\n                              LEONARD\n                         (pause)\n'                   I receive medication.\n,        She waits for more, but it doesn't come.           Only a smile.\n                              LEONARD\n,                   I'm okay now.\n    *           -                                   '\n         135.   OMITTED                                                               1\n         136.   INT. NATURAL HISTORY MUSEUM - ANOTHER ROOM - DAY                  13\n,   .   The post-encephalitics filing past still figures in African ·\n,        ceremonial costumes and masks.\n                                                                            s\n                              NUN O.S.                                          '\"'\n                         (calling)\n                    William?\n                               MISS COSTELLO O.S.\n                         (calling)\n                    Dr. Sayer?\n\n         136A. INT. ANOTHER ROOM - NATURAL HISTORY MUSEUM - DAY                  136\n         A working display of a tide pool. Anthony's reflection joins\n         Sayer's in the glass.\n                              SAYER\n                    I've always loved tide pools,\n                    haven't you?\n         Anthony doesn't answer. He seems troubled.\n                              SAYER\n                    What is it?\n                              ANTHONY\n                    You chose this place?\n                         (Sayer nods)\n                    Why?\n                              SAYER\n                         (pause)                        ,\n                    I come here all the time.\n                              ANTHONY\n                    Why?\n\n                                               (REV.11/10/89)GOLDENROD    Pg.\n        136A.CONT.                              .\n        Sayer glances away, sees Miss Costello coming.      She looks a\n        little irritated. As she arrives -\nti^                          SAYER\n                   Miss Costello, I think Anthony\n                   thinks they're bored.\n        He says it like, Have you ever heard anything so ridiculous?\n                               MISS COSTELLO\n                   They are.\n        Sayer, taken aback, glances back to Anthony, whose look says,\n        There you go.\n                               SAYER\n                   I ' d thought about the opera house.\n                   Do you think they'd prefer that?\n                             ANTHONY\n                   The opera house?\n                             SAYER\n                   The Botanical Gardens?\n        Anthony looks to Miss Costello and rolls his eyes.\n                               SAYER\ny5?.               Well, where else is there?\n\n        137.   INT. ROSELAND - LATE AFTERNOON\n        Roseland's Big Band belting out \"That Old Black Magic.\"\n        On the dancefloor, the post-encephalitics dance with one\n        another amidst \"normal\" middle-aged and older couples, all\n        having a great time.\n        At the bar, Sayer tries to get the attention of a young\n        bartender busy mixing drinks. Watching, it slowly dawns on\n        Rose that something is \"wrong\" here. More to herself -\n                             ROSE\n                   It's legal again?\n                              MISS COSTELLO\n                         (pause)\n                   For some time now.\n        Rose is delighted; she can hardly believe it.      She gets the\n        bartender's attention.\n -( )                       ROSE\n                  A Rob Roy on the rocks.\n\nP\n\n                137.CONT.                              .\n               The young bartender has to think a moment. Rose turns back to\n                watch the action on the dance floor. Gesturing to Rose, Miss\n                 Costello whispers to the bartender -\n                                    MISS COSTELLO\n                          A Shirley Temple.\n\n               138.   INT. LOBBY, BAINBRIDGE - LATE AFTERNOON\n               Leonard and Paula crossing toward the front doors. She's just\n               chatting but he's taking it seriously.\n                                    PAULA\n                          Things happen, people are late.\n                                    LEONARD\n                          They won't be angry.\n                                    PAULA\n                          Oh, they'll be angry. What're\n                          they going to do, fire me?\n               He doesn't realize she's not asking him. He has to shrug that\n               he doesn't know.\n    ,                               PAULA      _          :\n\n    (U*T                  I'll just take the graveyard.\n               Her look to him says, Right? He has no idea what she means,\n               but finally nods in agreement.\n                                      LEONARD\n                          Okay.\n           ]\n               They're almost to the doors.      She offers her hand to him.\n                                       PAULA\n                                  (pause)\n                          Bye.\n               He shakes the hand gently, lets it go.\n                                      LEONARD\n                         Bye.\n                                   PAULA\n                         Thanks for talking to me.            ·\n               She steps away toward the door.\n                                      LEONARD\n                          He knows.\n\n                                                 (REV.11/10/89)GOLDENROD    Pg.7\n           138.CONT.                                                        138\n           She glances back at him.     She's not sure what he means.\n                        ·         LEONARD\n                       Your father. He knows you visit\n                       him.\n            Whether he's saying it just to be nice doesn't matter to her.\n            It's what she wants to believe. She smiles gratefully.\n       *\n                                PAULA\n                      I'll see you.\n            She leaves.\n\n                                                                           138A.\n            138A. OMITTED\n           · 139.   INT. ROSELAND - LATER - EVENING                         139.\n            The band in the middle of \"You Hade Me Love You.\"\n            At the bar -\n                                 ROSE\n                       Is he betrothed, do you know?\n           Miss Costello doesn't know who she could possibly mean. She\n  ,-       follows her sightline to the opposite wall, to a chair, to\n           Sayer sitting alone.\n                                 MISS COSTELLO\n                       Not that I know of. I kind of\n                       doubt it.\n           Rose gets up and crosses toward Sayer. Seeing her coming, he\n           smiles ... but the smile slowly begins to fade as she sings to\n           him:\n                                 ROSE\n                      You made me love you\n                      I didn't want to do it               ·\n                      I didn't want to do it . . .\n           Singing as she does it, she pulls him out of his chair.\n           Embarrassed, he resists, but she finally gets on the dance\n           floor. Never more mortified in his life (it seems as if\n           everyone is watching) he \"dances . . . \"\n           And the band finishes the song.             '\n\n\n\n' (\")\n\n                                    (REV.11/10/89)GOLDENROD   . Pg.76\n                                     (continuity only)\n                                                                 . 14\n140.   OMITTED\n 141. INT.- CORRIDOR & LEONARD'S WARD                             14\nReturning from their night out, happy and satisfied, the post-\nencephalitics come down a quiet corridor, trailed by their\nchaperons.\nPassing the examination room, Sayer hears faint typing, and\nslows.\n\n142.   INT. EXAMINATION ROOM - MOMENTS LATER - NIGHT              14\nSayer steps into the room to find a figure hunched over his\ntypewriter in a pool of lamplight. Glancing over to the door,\nthe figure is revealed to be Leonard.\n\n                                         CONTINUED:\n\n                                                                  142\n                     LEONARD                                      \"\n          Everybody have a good time?\nLeonard doesn't wait for the answer, returns to his typing.\nSayer comes closer.\n                     SAYER\n           What are you doing?\nHe peers over Leonard's shoulder to read what he's typing, and\na slow smile crosses his face.\n                       SAYER V.O.\n           \"One - typewriters and writing\n           supplies in all dayrooms at all\n           times . . .\n\n                                                                  143\n143.   INT. BOARD ROOM - DAY\nDrifting slowly across the faces of Kaufman, the director and\nthe other board members as Sayer reads to them from a\ntypewritten sheet of paper --\n                      SAYER                  ;\n           \" . . . Two - music and dance\n           classes for those patients who\n           desire them. Three - technical\n           courses for those who wish to\n           learn a trade. Four - patients'\n           grievance committees. Five - the\n           same food in the patients'\n           cafeteria as in the staff's. Six\n           . . . \" and I happen to think this is\n           an excellent idea, \"the\n           establishment of a permanent\n           hospital library. And \"Seven -\n           televisions that work.\"\n\nSayer sets the paper down on the table --\n                     SAYER\n           \"Respectfully, Leonard Lowe.\"\n-- and listens to the silence.    It's a long one.\n\n144.   INT. BASEMENT - BAINBRIDGE - DAY                          144.\nRumbling furnaces. The boiler room. Exposed conduit and pipes\nand ducts on the ceiling like tangled roots of an enormous\nmetal tree.\n\n                                                   (REV.11/22/89)CHERRY      Pg\n           144.CONT.                                                          I\n          A subterranean corridor. Deserted except for Sayer and Leonard\n              145.   INT. BASEMENT OPERATING THEATRE - DAY                       1\n          A dusty anatomical skeleton shrouded in fdarkness is suddenly\n          illuminated as Sayer yanks down a sheet covering a high window.\n          Yanking down another, a second shaft of light falls on old\n          discarded surgical tables and equipment.\n          Brain surgeries were once routinely performed here back in a\n          time when they held out hope for docile patients and dociled\n          the rest. Used only for storage now, its floor and tiers of\n          observation benches! are covered with boxes and files and broken\n          furniture.\n          Leonard stares in at the eerie room and listens to the distant\n,         muted drone of the furnaces. He feels as though he's been here\n,    .   before. Maybe he has, long ago. Quietly ~\n                               LEONARD\n                     What is this place?\n                               SAYER\n                     It's your library.\n          Sayer pulls down another sheet and more light spills in.\n                                SAYER\n                     It'll take some fixing up     »\n                     obviously. A thorough cleaning\n                     to begin with. Some desks. Books                ·\n                     of course.\n          Leonard's glance slowly moves across the dim room, settling\n          finally on Sayer, who's smiling.\n                               SAYER\n                     They agreed to find the money for\n                     it. And to my suggestion that you\n                     oversee it and select the books.\n                               LEONARD\n                     Me?\n\n         146.    INT. LEONARD'S DAYROOM - DAY                                14\n          Fingers on the keys of a piano, Sayer's baby grand, moved here\n     ·    from his house. Rolando, oblivious to the world, at it playing\n     )   a simple yet emotional melody.\n\n                                    (REV.11/22/89)CHERRY   Pg.7\n                                    \"(continuity only)\n                                               *     *\n146.CONT.\n                      RAY\n            He's still hasn't talked?\n                      MISS COSTELLO\n            We think he got sick before he\n            learned how to talk.\n\n                                             CONTINUED:'\n\n                                          (REV.11/14/89)Salmon   Pg.79\n\n146.CONT.                                                        146.\nListening to the music a moment more, she corrects herself:             *\n                     MISS COSTELLO\n          To talk with words.\nClose on two nurses, across the room.\n                     NURSE 1\n          She's the daughter of the nephew\n          of a Dutch archduke. She's\n          royalty.\nShe's referring to Magda, who glances over as if sensing\nthey're talking about her. They drop their voices:\n                      BETH                               ·\n           He's dead, this duke?\n                      NURSE 1\n           He's been dead a hundred years.\n                      BETH\n           Then forget it, I'm not curtsying.\nLucy, wearing \"stylish\" new glasses, smiles as Sayer listens to\nher heartbeat through a stethoscope. Satisfied with it, he\nmakes a notation in her chart.\n                    SAYER\n          Can I have your hand?\n                      LUCY                 \\\n          Yes, you can have my hand.\n                (she holds it out\n                 to him)\n          Take me away from this place.                           .\nHe smiles uneasily.\n                    SAYER\n          I'm your doctor, Lucy.\n                     LUCY\n          You're my Prince Charming.\nClose on hands rapidly dealing 3-Card Monte. The cards\neventually settle, and the hand of someone else hesitates over\nthem before gingerly tapping one. As it's turned over:\n                     ORDERLY\n          There it is.\n The orderly snaps his finger in triumph. The 3-Card Monte\ndealer, a dextrous encephalitic, shrugs.\n\n                                         (REV.11/14/89)Salmon    Pg.80\n                                                  i\n\n\n 146.CONT.                                        .              146.\n                     LUIS                                                 *\n          Another tough break for me.                                     *\nThe orderly reaches to rake another dollar into his pile.                 *\nThere's a nice watch on the wrist. Luis smiles to himself.                *\n                       MARGARET O.S.                                      *\n             I don't know how to say this,                                *\n             Miriam, so I ' m just going to say                           *\n             it.\nMiriam waits, but Margaret doesn't immediately say it.                    *\n                        MARGARET\n             Your husband?                                                *\n                   (Miriam nods)                                          *\n             He was granted a divorce from                                *\n             you in 1953.                                         ,       *\nMargaret almost grimaces, anticipating hysteria. Instead, a               *\nslow smile crosses Miriam's face.                                         *\n                          MIRIAM                                          *\n             Thank God.                                                   *\nPliers, tin snips and a pile of found objects on a table.                 *\nJosef is there, fashioning strange and beautiful toys from the            *\njunk.                                                                     *\n                          NURSE 2                                         *\n             Francis?                                                     *\n                                                  t\nFrancis turns to find the nurse standing with a 20 year old               *\ngirl who's holding a toddler by the hand.                                 *\n                        NURSE 2                                           *\n             Your daughter.                                               *\nFrancis smiles at the toddler, mistaking her for the daughter.            *\n                          DAUGHTER                                        *\n             Hi, mom.                                                     *\nFrancis' glance comes up to meet the 20 year old's, shifts down       *\nto the toddler again, comes back up.                                   *\n                          FRANCIS                                         *\n             Of course . . .                      '                       *\nFrom across the room, Frank watches Francis hug her \"actual               *\ndaughter,\" glances to Rose who has been reunited with a few old       *\n girlfriends, to Desmond with his son and daughter-in-law and             *\n their teenage kids, and to Sidney and Lolly in a corner.                 *\n\n                                             (REV.11/14/89)Salmon   Pg.80A\n    146.CONT.                                                        146.\n\n\no\n                          ANTHONY\n                How's it going, Frank?\n    Frank glances blankly at Anthony and another orderly, who are\n    hanging out nearby with Bert, passing around a Road & Track\n    magazine.\n                          FRANK\n                How's it \"going?\"\n                          ANTHONY\n                How do you feel?\n                           FRANK\n                How do I feel?\n                      (pause)\n                My parents are dead. My wife is       I\n                in an institution. My son has\n                disappeared ... \"Out West\"\n                somewhere.\n                      (pause)\n                I feel old and I feel swindled,\n                that's how I feel.\n    Anthony glances at the others with a why-did-I-ask kind of\n    look. Frank wanders away.\n                     ,      BERT\n                 He is old.\n    So is Bert, though he doesn't feel it. As far as he's\n    concerned, he's still twenty years old. He glances back at the\n    magazine.\n                          ANTHONY\n                Pontiac Firebird, 350 engine, now\n                there's a car, Bert.\n                             BERT\n                Firebird . . .\n    He likes the sound of it.       Tight on the picture in the\n    magazine.\n    Rough sketches and balsa wood models of the operating theatre-      *\n    proposed library on a table. Leonard working on them.\n                          PAULA\n                Hi, Leonard.\n    Leonard glances up from his work. His mother glances up from\n    her magazine. One of them is delighted to see the girl.\n\n                                     (REV.11/22/89)CHERRY          Pg.81\n\n146A.    INT. OPERATING THEATRE / LIBRARY - LATER - DAY            14 6A.\nThe anatomical skeleton being dragged across the flpor like the\nlifeless thing that it is.\n                      MOVER 1\n            Excuse me, ma'am.                  .\n                                               .\nPaula steps aside as the guy goes past her and Leonard with the\nrattling bones.\n                        LEONARD\n            . . . bookcases there . . . there . . .\n            take some of these benches out . . .\n            maybe have a ramp over here . . .\nHe's not exactly sure where everything is going to go, but he's\nproud of it. Gesturing to the operating lamp hovering from\nabove like a giant spider\n                      LEONARD\n            I'm going to get rid of this\n            thing.\nThe thing is so unbelievably macabre they have to grimace.\nAnother mover comes past dollying out old: operating equipment.\n                      MOVER 2\n            Excuse me, ma'am*\n                                                                     147.\n147.    OMITTED\n148.    INT. EXAMINATION ROOM - DAY                                  148.\nMrs. Lowe, slowly pacing.\n        *             MRS. LOWE\n            He never talked about girls\n            before. He certainly never had\n            anything to d£ with them.\nShe casts around trying to come to terms with it.\n                      MRS. LOWE\n            It's a bit ridiculous all this\n            girl business, don't you think? A\n            grown man like him?\nShe looks to Sayer for confirmation.        Sayer manages a nod.\n                      MRS. LOWE\n            You know what he said? I should\n            take a vacation. I should go away\n            for a few days and \"relax.\"\n\n                                       (REV.11/22/89)CHERRY      Pg.82\n                                        (continuity only)\n                                                                       148\n 148.CONT.              SAYER\n             Maybe you should.\n                   (she shoots him a\n                    look)\n             I'm sure he meant you deserve a\n             vacation. Which you do.\n                        MRS. LOWE          ^\n             I can't leave him alone in this\n             place. He'd die without me.\nSayer \"agrees\" with a sympathetic nod, but suspects it is she\nwho would die if she left. She resumes pacing, and mutters to\nherself the bitter-tasting word:\n                           MRS. LOWE\n             Girls . . .\n\n149.   INT. SAYER'S HOUSE - NIGHT                                 149.\nSayer in bed, asleep with a book on his chest and his\nindestructible reading glasses on his face. The phone rings.\nHe groans and gropes for it, puts the receiver to his ear.\n                           SAYER               :\n             Hello?\n                       LEONARD'S VOICE\n             I think we should organize a\n             speaking tour.\nSayer, more asleep than awake, can't be sure that what he's\nhearing, who he's hearing, is real.\n                           SAYER\n             Leonard?\n                                                                   i\n150.   INT. EXAMINATION ROOM - SAME TIME - NIGHT                  150.\nLeonard, wide awake, alone in the room. He's seated at Sayer's\ndesk with Sayer's office phone to his ear.\n                       LEONARD\n             I think it's important. I think\n             it's important some things were\n             said.\n                       SAYER'S VOICE\n             What kind of things?\n\n                                            CONTINUED:\n\n                             LEONARD\n                   Things that matter. Things that\n                   have happened to me. Things I've\n                   cone to understand. Things.\n\n        151.   INT. SAYER'S HOUSE - CONTINUED - NIGHT                   151\n        Sayer is gradually coining to. He glances at his clock. It's\n        like three o'clock in the morning.\n                             SAYER\n                   Where are you calling from?\n                             LEONARD'S VOICE\n                   Your office.\n                             SAYER                      i\n                   It's very late, Leonard.\n                             LEONARD'S VOICE\n                   Is it?\n        Sayer nods to himself that it is. That fact and that Leonard\n        has apparently felt compelled to call him to discuss \"things\"\n        concerns him.                          :\n\n                            SAYER\n                  Stay there. I'm coming over.\n                              LEONARD'S VOICE\n                  Good.                          *\n        Dial tone. Sayer listens to it a moment before slowly setting\n        the receiver back on its cradle.\n\n        152.   INT. EXAMINATION ROOM - LATER - NIGHT                    152\n        Dressed haphazardly, hair messed up, eyes still a little\n        unfocussed, Sayer resembles more a patient than doctor. Clean\n        and alert, Leonard appears rather more \"doctor-like.\"\n                          ;                                 N\n\n                            LEONARD\n                  Read a newspaper, people have\n                  forgotten what life is all about.\n                  They've forgotten what it is to be\n                  alive. They need to be reminded.\n                  They need to be reminded what they\n                  have, what they can lose, what I\n                  feel, this, the, the, the . . .\n        His mind seems to be racing ahead of his mouth's ability to\n\n                      LEONARD\n           . . . the joy, the freedom, the\n           spaciousness of life, the gift of\n           life. This is what they've\n           forgotten. This is what they need\n           to remember. This is what we'll\n           tell them.\nLeonard waits for a reaction to his idea, his \"Gospel According\nto L-Dopa\" lecture tour. Sayer can manage only an uncertain\nnod.\n\n153.   INT . THE PHAR MACY - DA Y    >                            153.\n\nAmidst the thousands of bottles and jars of medicines, Sayer\nwonders out loud to Ray --\n                     SAYER\n           I don't know if it's liberation or\n           mania or love.\n                      RAY\n           With me?- I never know. ·\n                      SAYER\n           What he says is absolutely true.\n           We don't really live.\n               . (pause)\n           Does that mean there's something\n           wrong with him or us?\nThe balance of the pharmaceutical scale wavers like the sword\nof Damocles.\n                       SAYER & RAY\n           Us.\n                                                                  154.\n154.   OMITTED\n155.   OMITTED                                                    155.\n156.   INT. LEONARD'S DAYROOM - NIGHT                             156\nA night janitor with a cleaning cart peers into the darkened\nroom at Leonard standing at a window looking out.\n                     JANITOR     .\n           Mr. Lowe?\n                (Leonard glances\n                 over)\n           Are you all right?\n                       LEONARD\n           Yeah.\n\n                                           REV. 12/12/89 (PINK)          Pg.85\n      156.CONT.                                     .               156.\n     The janitor wheels his cart back down the corridor. Leonard\n       stares back out the window, at what lies beyond the grounds of *\n       the hospital . . . the glittering lights of the Manhattan *\n     skyline.\n                                                                157-158.\n     157-158. OMITTED\n     159.   INT. BOARD ROOM - DAY                ,                            159.\n     Drifting slowly across the faces of the board members again,\n     and across Sayer -\n                            LEONARD O.S.\n                I ' m thankful to everyone in this                                  *\n                room . . . I was dead, and you                                      *\n                brought me back ...                                                 *\n     - and reaching Leonard, standing at the head of the table.                 *\n                           LEONARD\n               I ' m thankful, but what I need now\n               isn't here.\n                  .    .   .   .\n     Silence. And, eventually, since no one else asks it:\n                           KAUFMAN\n               Where is it?                      :\n\n\n                           LEONARD ·\n                There.\n     Kaufman and Sayer and the others follow Leonard's gesture to *\n     the windows.\n                           KAUFMAN\n                                                                                    *\n                Mr. Lowe, I ' m sorry, I ' m afraid I\n                don't understand. What is it                                        *\n                you want now?                                                       *\n                           LEONARD\n                The simplest thing.\n                           KAUFMAN\n                      (somehow doubting it\n                       will be simple)\n                And what is that?\n                          LEONARD\n                I want to know that I'm free\n                to go for a walk, if I feel like\n                it. Like any normal person.\n     The board members glance among themselves.         They seem relieved.\n{V   That is a simple request.\n\n                                        REV. 12/12/89 (PINK)          Pg.8\n\n     159.CONT.             KAUFMAN                                    159.\n\n                            LEONARD\n                 I am?\n                       (Kaufman's shrug says\n                        \"of course\")\n                 Alone?\n     Now there's a pause. And Leonard's hand makes a gesture to his *\n     face, to his brow. He ignores it (or is unaware of it).        *\n                           KAUFMAN\n                 What difference does that make?\n                            LEONARD\n                       (pause)\n                 I think you know.\n                           KAUFMAN\n                 I don't know. Tell me.\n                            LEONARD\n                       (right back)\n                 It makes all the difference.\n     He brushes at his brow again. Sayer studies him, or rather the\n     tic itself as it repeats.\n                           LEONARD          -                            *\n                 You didn't wake a thing, you woke                       *\n                 a person. I ' m a person.     »                         *\n                            PSYCHIATRIST\n                 Mr. Lowe? I wonder . . . are you\n                 at all aware of the unconscious\n                 hostility you're exhibiting\n                 towards us right now?                                   *\n     Kaufman glances over to the psychiatrist, weary. The look on *\n     Leonard's face is complete innocence; and his tone completely *\n     without innuendo -\n                           LEONARD\n                 How could I be aware of something\n                 that's unconscious?              *\n     Sayer smiles to himself. So does Kaufman. The psychiatrist *\n     doesn't.                                                  **\n                            KAUFMAN\n                 I 'm curious . . . I can tell this is\n                 important to you but I ' m not sure\n                 why. What would you do if you\n                 went out?\n\n                                     REV.12/12/89 (PINK)            Pg.86A\n\n\n     159.CONT.               LEONARD                                  159.\n                 I don't know, what would you do\n                 if you were me?\n                             KAUFMAN\n                        (his patience\n                         straining)\n                 I ' m hot you. Enlighten me.\n                             LEONARD\n                 I ' d walk around. I ' d talk to\n                 people, I ' d look at things. I' d\n                 decide whether I wanted to go this\n                 way, or that way, or keep going\n                 straight. I ' d do the things you\n                 do everyday and take for granted.\n     Long silence. Then:\n                           KAUFMAN\n                 I'll tell you what, we'll take it\n                 under consideration. We'll let\n                 you know.\n\n                                                                      160.\n^   160.   INT. PATIENTS' CAFETERIA - DAY\n     Leonard at a table. Waiting. Sayer appears. Sits.\n                            LEONARD\n                 Yeah, I was aware of it.     ·\n                       (the tic)\n                 I was nervous. It's nothing.\n                 What'd they say?\n                           SAYER\n                 They said it's a dangerous place\n                 out there. They said they can't\n                 be held responsible for what might\n                 happen to you out there. They\n                 said no.\n     Leonard nods, sips his coffee, seems to take the decision in\n     stride.\n                           LEONARD\n                 And what did you say?\n                           SAYER\n                 They don't have to listen to me.\n                           LEONARD\n                 Did you agree with them?\n\n                       SAYER\n                  (pause)\n           Yes.\nLeonard nods again, philosophically it seems.\n                       SAYER\n           I ' m not sure we're out of the\n           woods yet, Leonard. I'm not sure\n           this is nothing.\n                  (the tic)\n           I have to be sure you're well.\n           There'll be time enough -\nLeonard gets up out of his chair --\n                       LEONARD\n           Bye.\n-- and turns to leave.\n                     SAYER\n           Leonard ...\nLeonard ignores him and walks out --      :\n\n\n                                                                  161\n161.   INT. CORRIDOR - MOMENTS LATER - DAY\nLeonard striding down a corridor.    Sayer hurrying* after him.\n                     SAYER\n           Where are you going?\n                     LEONARD\n           For a walk.\n                        SAYER\n           Leonard . . .\nLeonard ignores him.\n                        SAYER\n           Leonard . . .\nLeonard disappears around a corner. Sayer veers off to a\nhospital phone and picks it up. Into it -\n                      SAYER\n           This is Dr. Sayer . . .\n\n                                      (REV. 11/22/89) CHERRY       Pg.8.8\n\n162.   INT. CORRIDORS / LOBBY - DAY                                  162.\nFaces of patients in wheelchairs blur as Leonard runs past\nthem. In another corridor faces blur as orderlies rush past\nthem. In another corridor faces blur as Sayer runs.\nLeonard reaches the lobby just ahead of the orderlies. They\ntry to be gentle with him but when he fights to free himself it\nit gets out of control. Sayer appears.\n                     SAYER\n           Let go of him.\nThe orderlies don't know what to do. They're just trying to\nrestrain Leonard but he's making it almost impossible.\n                      SAYER\n           Leonard, stop fighting.\nHe keeps fighting. He can see the outside through the glass\ndoors, so close, so far.\n                      SAYER\n           Let ao of him.                                      .\nThey pull him back, away from the doors, into the corridor\n                         -w\nbehind them.         .\n\n163.   INT. EXAMINATION ROOM - DAY                                   163.\n                                                                            *\nTight on Sayer, staring at the floor, despondent.\n                     MRS. LOWE O.S.\n           I don't understand it, he was\n           never any trouble before.\nKaufman, too, is there, and Miss Costello. Kaufman watches            *\nSayer.\n                     MRS. LOWE\n          He was quiet: and polite and\n          respectful. He never demanded\n          anything. He was never\n          disobedient.\n                    SAYER\n          He was catatonic, Mrs. Lowe.\nHe seems to say it more for Kaufman's benefit; regardless, she\ndoesn't care for his tone.\n                    MRS. LOWE\n          I'm speaking of when he was a boy.\n\n                                          (REV.11/22/89)CHERRY\n\n        163.CONT.                SAYER                                        163\nfT~\\                Of course.\n                               MRS. LOWE\n                          (to Kaufman)\n                    He was always nice-minded when he\n                    was a boy.                    ^\n       Kaufman nods, studies Sayer.\n                              MRS. LOWE\n                    I don't know who that is up there.\n                    I don't think he knows.\n                         (to Sayer)\n                    You've turned Leonard into\n                    something he is not.\n\n                                                                        ,. 164\n       164.   INT. WARD 5 STAIRWELL & CORRIDOR - DAY\n       Coming up a flight of stairs, 1930's music can be heard.          ,,\n       Reaching a caged landing the orderly escorting Sayer unlocks*\n       door, leads him along a short corridor to another door and\n       unlocks that one.\n\n  *    165.   INT. WARD 5 DAYROOM - CONTINUOUS - DAY                          165\n       An old black and white musical blaring from a television bolted\n       to the ceiling. Young male patients, subdued with Thorazine,\n       vacantly staring at it.                   >\n       Sayer comes in, finds Leonard in one of the chairs, and kneels\n       to gain some confidentiality. Leonard cranes slightly to see\n       around him, to see the television.\n                               SAYER\n                    This is a mistake. It's wrong\n                    and it's cruel and it should never\n                    have happened like this - but you\n                    have to understand - nothing quite\n                    like this has happened before, no\n                    one knows what to do . . . Leonard,\n                    please don't ignore me.\n       Leonard condescends a look to him. A moment and Sayer smiles\n       at a thought:                        ,\n                              SAYER\n                    I wish you could just walk out\n                    like that. I wish it were that\n                    simple.\n\n                                    (REV.11/22/89)CHERRY            Pg»9\n\n 165.CONT.                LEONARD           /                       165.\n                    is.                                               .\n Sayer's smile fades. Leonard glances back to the set. Tight\n  on the screen: Fred Astaire and Ginger Rodgers dancing.\n\n                                                                    166.\n166.   EXT. BAINBRIDGE HOSPITAL - NIGHT *\nLight glows in only a few of the windows.\nIn one, on the third floor, the examination room, a figure in        .*\nsilhouette (Sayer), stares out.\nIn another, on the fifth floor, a second figure in silhouette\n(Leonard), behind bars, slowly paces.\n\n166A. INT. WARD 5 DAYROOH - DAY                                  166A.\nThe blaring TV again. Suddenly the picture goes dark.\nLeonard, who turned it off, climbs down off a chair and faces\nthe \"somnambulant\" men who were \"watching.\"\nMoving along their chairs he considers each much as Sayer\nconsidered the post-encephalitic \"garden of stone.\" Reaching\n one stretched out across three chairs, asleep, Leonard\n\n gently nudges him.                                         .\n                          LEONARD\n             Wake up.\n167-163. OMITTED                                                167-169\n169A-. INT. ELEVATOR & CORRIDOR                                 169A.\nThe elevator door slides open revealing an orderly with several *\ntrays of untouched food on a cart. Kaufman steps in and the\ndoor slides shut. Descending:\n                     ORDERLY\n          I guess they're not hungry.\nKaufman nods distractedly, not really listening. The orderly\nbegins whistling a tune to himself. Kaufman glances over long-\nsufferingly, quieting him. The door slides open, and the young\nman wheels the cart past Kaufman. Finally:                     ~\n                          KAUFMAN\n             Who?\n                          ORDERLY\n             Ward 5.\nThe door slides shut.\n\n                                              (REV.11/22/89)CHERRY           , Pg\n\n\n(7~)   170.    OMITTED                                                       170\n        171.   INT. WARD 5 DAYROOM - DAY                                     171\n       Leonard paces before the entire Ward 5 population, gathered\n       like the blind and the sick under a revivalist's tent.\n                              LEONARD\n                   It isn't us that's defective,\n                   it's them. We're not in crisis,\n                   they are. We've been through the\n                   worst that can happen to a person\n                   and survived it. They haven't.\n                   They fear it. And they hide from\n                   their fear by hiding us, because\n                   they know, they know . . .\n       The men wa it for the rest, but L eonard loses his tra in of\n       t ho ugh t. F ru str at ed, h is t ics r es urf ac e and ela bor at e. H e\n       seems unaware of them. To one of the men:                             .\n                             LEONARD\n                  How long have you been here?            *\n                        (the man shrugs)\n                  You don't know? A month, a year?               .\nsj^                  (he doesn't know)\n(^7             Whv are you here?\n       He doesn't know that, either. To another patient:\n                            LEONARD                -\n                  How do you feel being locked up?\n                             WARD 5 PATIENT\n                   I don't like it.\n                            LEONARD\n                  You don't like it? Aren't you an\n                  animal?\n                            WARD 5 PATIENT\n                  I'm no animal.\n                            LEONARD\n                  Then why are you in a cage?\n       The man's getting agitated . . . they all are. Leonard stops\n       pacing, faces them, and almost whispers:\n                                LEONARD\n                  Anger . . .\n\n                                     REV.12/13/89 (YELLOW)           Pg.9\n171.CONT.                                                             171.\nSilence ... and suddenly, loudly, exploding:\n                     LEONARD\n           That's what you feel ... anger!\nThe men erupt in a burst of noisy approval; they cone alive.\nTight on Kaufman on the other side of the \"cage,\" watching.\nAnd, over the din -\n                      SAYER V.O.\n           He's lived for thirty years in\n           abjection and defeat . . .\n\n                                                                     172.\n172.   INT.' KAUFMAN'S OFFICE - NIGHT\nSayer and Kaufman alone in the room, arguing -\n                     SAYER\n           - He's lived for thirty years\n           without the ability to release his\n           anger -\n                     KAUFMAN\n           - So have the others -\n                     SAYER\n           I happen to think his behavior's                      .\n           more natural than theirs -\n                     KAUFMAN              t\n           Really - and his tics and\n           paranoia? They're more natural - ;\n                      SAYER\n           He's in that place.\n                     KAUFMAN\n           Oh, is that it -\n                     SAYER\n           We wake him up, then lock him up,                 »\n           that's not \"paranoia,\" that's a\n           fact.\n                     KAUFMAN\n           I've got 20 psychotics up there,\n           \"doctor,\" refusing to eat. They\n           have no idea whv they're refusing\n           to eat. How long should I let\n           that go (on) -\n                      SAYER\n           He knows why, hs. wants out.\n\n                                              REV.12/13/89 (YELLOW)       Pg.9\n\n\n\nCD   172.CONT.             KAUFMAN                                        172.\n                 Hell, so do I.\n     Kaufman suddenly looks weary, as if all his years in this place\n     have finally, at this moment, caught up with him. Eventually,\n     calmly, evenly -\n                            KAUFMAN\n                 Mr. Lowe is not the Messiah of\n                 Ward 5, he's a man in trouble. He\n                 wasn't \"resurrected,\" he was\n                 administered a drug - by. you -\n                 that's fallen somewhat short of\n                 its \"miraculous\" reputation -\n                            SAYER      .\n                 The others are fine, they show no\n                 signs of -\n                           KAUFMAN\n                 He's been OQ it longer!\n     Sayer has no rejoinder. A silence before:\n                           KAUFMAN              .\n                  I sympathize with him. I've\n                  tried to accommodate him. But                       .\n                  I will not let him endanger the\n                 health of other patients.\n     He's resolute; it feels like a threat, or ultimatum. Trying t\n     remain calm, Sayer changes tacks -\n                           SAYER\n                 I'll talk to him, I'll      explain t he\n                 problem. He'll listen       to (m e) -\n                      (Kaufman has to\n                       laugh)\n                 Without the drug, he's    dead.\n     Th e sta teme nt do esn 't hav e qui te the p owe r Saye r may h av\n     hoped. At least not on Kaufman. His eyes seem to go dead . .\n     and then the slightest, slightest shrug.\n\n     173/174.    INT. WARD 5 DAYROOM - DAY                            173/174\n     Sayer enters the dayroom and is immediately intercepted by\n     three young male patients.\n                            SAYER\n                  Excuse me.\n\n                                    REV.12/13/89 (YELLOW)      Pg.93\n173/174CONT.                        (continuity only)       173/174.\nThe patients stand their ground forming a kind of human barrier\nwhich Sayer cannot get past.\n                       SAYER\n          Excuse me.\n                    WARD 5 PATIENT\n          We can't allow it.\nLeonard, across the room, pacing slowly, glances over.\n                    LEONARD\n          He's all right.\nLeonard's \"bodyguards\" step aside. Sayer crosses to Leonard\nand is greeted in a tone precisely that of master to servant,\nvery courteous yet unmistalcably condescending:\n                    LEONARD\n          How are you today?\n                    SAYER\n          I'm all right, how are you?\n                    LEONARD\n          Never better.\nA strange gesture, a tic, appears and repeats.\n                    SAYER\n          And these gentlemen?\n                                         »\n                                        \"CONTINUED:\n\n                                          (REV'.'11/22/89) CHERRY    Pg.9\n\n    173/174.CONT.       LEONARD                                     173/17\n               These gentlemen protect me.    I\n               wish I didn't need them.\n                       SAYER\n             Someone wants to hurt you?\n                   (no answer)\n             Who?\n    Leonard glances at Sayer with a slight knowing smile.\n                                                                       '.\n                                                                        .\n                       LEONARD\n             That's the thing, isn't it, you\n             never know who. Someone I least\n             expect, I expect. Look at\n             history.\n                       SAYER\n             Every patient in this ward thinks\n             there's a plot against him,\n             Leonard.\n                        LEONARD\n             Yeah, well they're mistaken,\n             they're crazy.\n                                    j                 ..\n                                                                           *\n    The smile that appears this time on Leonard's face is as insane\n    as anything Sayer's ever seen. He hesitates. Then:\n                       SAYER\n             Something's wrong.\n                        LEONARD\n             Hey, buddy.                                     .\n                       SAYER                                               *\n             The drug's not working. These are                             *\n             side-effects and they're consuming                            *\n             you, and if we don't do -                                     *\n                       LEONARD\n             Hey, I appreciate you coming to\n             see me, I have some things to do.\nLeonard abruptly extends his hand; it's a little twisted.              *\nSayer doesn't so much shake the hand as hold onto it.\n                       SAYER\n           Look at yourself, Leonard.\nr\nLeonard tries to pull his hand away, but Sayer's grasp is               *\nstronger.\n                       SAYER\n             Look at yourself -\n\n                                     (REV.11/22/89)CHERRY          Pg.95\n\n 173/174.CONT.        LEONARD                                    173/174.\n                 (erupting)\n           Look at vou.\nLeonard yanks his hand free of Sayer's, and, in a torrent:\n                      LEONARD            *\n           Disease took mjs out of the\n           world, I fought to come back, I\n           failed for 30 years but at least I\n           fought, look at you.\nBut Sayer is looking at him, moving back and forth against the\nbars on a window, panther-like. He retaliates:\n                      SAYER\n           The medicine can be taken away.                               .'\n           That can be done. You. can wake up                             \"\n           in the morning and it won't be\n           there.\nThe remarks seem to have no effect on Leonard. He seems not to '\nhave heard them. But as Sayer takes a step closer, Leonard, *\nwithout warning, lunges.                                        *\nSayer stumbles back and his glasses fall to the floor. He . '\nscrambles to his feet, leaving them, and backs away from     *\n                                                             *\nLeonard's bodyguards who are slowly coming toward.him.\nOrderlies get the cage unlocked and hustle Sayer out. As it *\nslams shut again, he glances back in at Leonard, and hardly *\n                                                       ,    *\nrecognizes him.\n\n174A. EXT. SAYER»S HOUSE - NIGHT (ALREADY SHOT)                  174A.    *\nBeyond the porch windows, Sayer can be seen slowly pacing the *\nnarrow width of his living room. Opera music blares           *\nand CONTINUES OVER:                                                   .*\n                       0\n\n\n\n\n                                                                          *\n175.   INT. WARD 5 - LATER - NIGHT                                175.\nMoving slowly past the sleeping forms of Ward 5 inhabitants.\nAnd reaching and settling on a bed that's empty.\nThe opera music CONTINUES OVER:\n\n176.   INT. SAYER«S HOUSE - LATER - NIGHT                         176.\nThe record spinning. And Sayer at his desk, just sitting, his\n\"close work\" glasses resting on a page of Ernst Heckle.\n\n                                                 (REV.11/22/89)CHERRY         Pg.\n\n            176.CONT.                                                           1\n/T~-\\       The opera music CONTINUES OVER:                                     ·\n\n            177. INT. WARD 5 - LATER - NIGHT                                  177\n            Test pattern on the television. Leonard, in a chair, blankly\n            staring. His eyes are drawn to something glimmering on the\n            floor across the room. Saver's shattered glasses.\n            The opera music CONTINUES OVER:\n        *\n            178.   INT. SAYER'S HOUSE - LATER - NIGHT (ALREADY SHOT)       178.\n            Alone in his room, perched on his bed, Sayer pathetically\n            cleans his remaining pairs- of glasses.\n            The opera music CONTINUES OVER:\n\n            178A. INT. WARD 5 - LATER - NIGHT                               178A.\n            The shards of the lenses layed out on a table.\n            Leonard picks one up, and, turning it over to consider it, sees\n             that it has already cut his finger.\n             He doesn't set it down.\n\n            178B. INT. STAIRWELL - DAWN                 ,                   178B.\n            A metallic dang interrupts the music and echoes into silence.\n            Footsteps. Sayer appears, and slowly climbs up through the\n            caged stairwell. He reaches a landing' and unlocks a door.\n\n            179.   INT. WARD 5 - MOMENTS LATER - DAWN                         179.\n            Sayer steps into room and quietly crosses it. He peers in at\n            sleeping figures, and at the one empty bed.\n                                LEONARD O.S.\n                      How are the others?\n            Sayer turns to the voice, to Leonard, a ticcing figure in\n            shadow hunched in a corner of the dayroom.\n                                 SAYER\n                      Scared.\n\n                                           (REV.11/22/89)CHERRY   Pg.\n                                            (continuity only)\n    179-.CONT.              LEONARD                                179\n                       (pause)\n                 They should be.\n                            SAYER\n                       (pause)\n                 They want you back. I want you\n                 back.                         *\n\n\n\n\n                                           CONTINUED:\n\n\n\n\n&\n\n                                         .REV. 12/5/89 (BLUE)       Pg.98\n 179.CONT.                                                           179.\nLeonard remains in the shadows.   Eventually -\n                    LEONARD\n          I want to be back.\n\n180.  INT. LEONARD'S DAYROOM - DAY                                      180.\n                        i                           '*\nSayer has called together the ward staff, the other patients,\nKaufman and Ray.\n                      SAYER\n          He's aware of his appearance.\n          He's less concerned with it than\n          he is with the effect it may have\n           on the rest of us.                                       .\nHe waits for the patients to acknowledge they understand. They\nnod.\n                    SAYER\n          We'll be working with his dosage.\n          He's aware of this, too, and says\n          he's prepared for it. He wants us.\n          to be prepared for it.\n                      ANTHONY             :\n\n          Hey, Len.                                             .\nThe patients glance away to the threshold of the room. Miss\nCostello and Mrs. Lowe are escorting Leonard slowly in.\nAnthony comes over, shakes his hand.     ,\n                    ANTHONY\n          Welcome back.\n                      LEONARD\n          Thanks.\nThe others come over, shake his hand and pat him on the back,             *\nbut all a little too gently, too concerned, like he might\nbreak. Leonard manages a smile.\n                     LEONARD\n          I' m all right.\nThe others nod quickly in agreement. And the room falls into               *\nsilence.\n                   LEONARD                       .\n         Only it's too quiet in here.\n\n                                             REV.12/5/89 (BLUE)         Pg.9\n\n     18OA.    INT. LEONARD'S DAYROOM - NIGHT                            18OA.\nCO   Anthony at the piano, playing, singing; the others echoing the\n     refrains -\n                            ANTHONY\n                  \"You build me up, Buttercup,                           \"\n                   Only to let me down ... \"   v\n     It's like    a cocktail party - everybody dressed up, some\n     singing,    some milling around talking. Leonard tries to enjoy\n     it, too,    struggling to contain,, to hide from the others, the\n     tics that    are trying to \"come out.\"\n                            LEONARD V.O.\n                 . . . I keep acquiring new ones like\n                 a junk collector . . .\n     181-182.    OMITTED                                            181-182.\n     183.    INT. EXAMINATION ROOM - DAY                                 183.\n     Through the lens of the 8mm camera -\n     The blackboard. Chalked on it: LEONARD LOWE - 750 MGS.\n     In front of it, Leonard seated in a chair, his hands performing\n      repertoires of tics. He seems wholly unbothered by them.\n                            LEONARD (CONT'D)\n                 . . . some are new . . . some are      *\n                 elaborations . . . some are counter-\n                 tics. They don't bother me. What\n                 bothers me is that I know they\n                 shouldn't be there . . .\n     One of his hands makes a movement to his ear, to his pants, to\n     his ear again, like some bizarre genuflection.\n                             LEONARD\n                 This is new . . .\n                                                            ·   '\n\n\n\n\n     1 8 4 . OMITTED                                                     184.\n\n     185.    INT. BATHROOM - DAY                                         185.\n\n     Alone in the bathroom, Leonard struggles to get toothpaste onto\n     a toothbrush with two tremoring \"disobedient\" hands. It's a\n     monumental struggle.\n\n     185A.   INT. PHARMACY - DAY                                        185A.\n     The counterweight of a pharmaceutical scale being slid by hand\n     from 750 to 500 mgs.\n\n                                        RE V. 12/ 5/ 8 9 ( B LUE)       Pg . 1\n\n186-188. OMITTED                                                    186-188.\n189.   INT. LEONARD'S DAYROOM - DAY          *                          189.\nThe other patients at tables, painting.\nLeonard at another table, with the sketches of his library. On\n                                                                               *\none showing the placement of tables and desks, he writes the\nletters, \" F L O W \" before getting \"stuck.\"\n                        LEONARD V.O.\n                 (flat)\n          There's no sense of time. It's\n           like being caught between mirrors\n           . . . or echoes . . .\nTight on his face, his eyes, transfixed.\n                     LEONARD V.O.\n            Something has to happen ...\nA cockroach runs across the paper and Leonard's eyes \"wake up\"\nand his hand finishes the word, \" F L O W E R S \"\n\n190.   INT. EXAMINATION ROOM - DAY           .                          190.\nSayer and Leonard watching film of him eating from a bowl of\nsoup. The hand with the spoon freezes midway to his mouth.\n                     LEONARD (CONT'D)\n           It's not that it feels bad, it's,\n           nothing, I feel nothing. Like I'm\n           nothing. Like I ' m dead.\n\n191.   INT. PHARMACY - DAY                                              191.\nThe counterweight sliding up from 500 to 625 mgs.\n\n                                                                       192. *\n192.   INT. OPERATING THEATRE - NIGHT\nThough the junk has been cleared and some of the railings                      *\nripped out, the place is still grim, unpainted. Wood scraps                    *\nand workmen's tools lay around. There's a wheelchair ramp,                     *\nhalf-built, not yet in place.                                                  *\n                     LEONARD\n           I feel good when I ' m working. I\n           feel good in here.                                           ·      *\n In this room. They're alone in it, he and Sayer, by a table- *\n saw that's cluttered with the original hospital blueprints and *\nLeonard's plans and notes.\n\n                                                         REV; 12/5/89 (BLUE).       Pg.l\n\n\nCD             192.CONT.              LEONARD                                       U 92 .\n                           The book list is coming along.\n                                       SAYER\n                           I ' d love to see it.\n                                       LEONARD\n                           It's here somewhere . . .\n               As he hunts for it amidst all the notes, his hands and head\n               begin shaking. The hands seize on some other papers and, hard\n               as he tries, he can't make himself let go of them. The pages\n               crumple.\n                                     SAYER\n                           It's all right, I'll see it some\n                           other -                                              i\n               He's interrupted as Leonard suddenly goes into an severe\n               oculogyric crisis, his head thrusting back -\n                                     LEONARD\n                           Get the camera get the camera get\n     ·                     the camera get the camera -.\nf ' « >!» '\n                    INT. OPERATING THEATRE - NIGHT                                  193.\n\\S~P          ig2,\n               8mm film of Leonard, in a chair in the middle of the room\n              , where, thirty years earlier, patients had been filmed. His\n               head still back, his eyes darting, his mouth spitting out\n               words -\n                                     LEONARD (FILM)\n                          I-I-I-I-I--\n                                      SAYER O.S. (FILM)\n                           - I can't do this - I'm turning\n                           the camera off -                       ,\n                                      LEONARD\n                           No - no - no - no - watch - watch\n                           - watch - watch -\n                                      SAYER O.S. (FILM)\n                           - I have to help you -\n                                     LEONARD\n                           - learn - learn - learn - learn -\n                           learn - learn - learn -\n\n                                             REV.12/5/89 (BLUE)   . Pg.1\n\n193A.    INT. PHARMACY - DAY                                       193A.\nL-Dopa powder, falling like snow onto the scale; and the\ncounter-weight balancing precariously at 575 mgs.\n\n194.     INT. EXAMINATION ROOM - DAY   (WAS SC. 186)                194.\nThe chalkboard: Name and dosage (575 MGS). And Leonard signing\non it, clearly, without trouble, \"Leonard Lowe.\"\n                      SAYER\n            Good.\nLeonard sits. He seems fine. Suddenly his hand jerks up and\ncatches the tennis ball Sayer has thrown.\n                      SAYER\n            Good.\nThe ball, without warning, comes back. Sayer lunges at it, but\nmisses. It hits his wrist and rolls across the floor.\n                       SAYER\n            Well, I wasn't ready, was I.\n Leonard smiles. Sayer smiles. They're both so relieved, they\n can hardly believe it. It seems they're out of the woods, that\nthey've found the \"middle ground.\"\nTight on Leonard's pharmaceutical chart on the desk. Sayer's\nhand comes in and boldly underlines the, dosage - 575 MGS.\n\n195.    INT. LEONARD'S WARD - DAY                                   195.\nLeonard buttons his shirt, then picks up the bow tie he always\nwears when he's seeing Paula. He looks well, he feels good,\nthe only sign of illness some fine motor skill trouble.\n                     MRS. LOWE                      .\n           Here, let me.\n                     LEONARD\n           No, I can do it.\nShe watches him try to get the tie on by himself, and casts\naround, feeling, perhaps, without a purpose. Eventually, more\nto herself than to him:\n                      MRS. LOWE\n           What you see in that girl . . .\n                 (she trails off)\n           I don't get it.\n\n                                                   REV.12/5/89 (BLUE)   Pg.10\n     195.CONT.              LEONARD                                     195.\n(D                     (to himself)\n                 She's normal.\n                             MRS. LOWE\n                 What?\n                       (no answer)\n                 You're not talking to yourself*\n                 again.\n                             LEONARD\n                 Yeah.\n                           MRS. LOWE\n                 You shouldn't do that, you know.\n                             LEONARD\n                 I know.\n     She watches him struggle with the tie a moment more. Finally,        *\n     she can't bear it any longer, and reaches to do it for him.          *\n                           MRS. LOWE\n                 You're taking forever, it's hard                              *\n                 to watch. .   -.                                              *\n                             LEONARD\n                  I can get it.                                                *\n                            MRS. LOWE\n                                                                               *\n                 No, you can't.\n                                                       >      ·\n                           LEONARD\n                 I can, get away from me.              .,                      *\n     He pushes her hand away and turns his back to her. She can't         *\n     believe it. Silence. Then, to herself, in a murmur -                      *\n                             MRS. LOWE\n                 . . . thirty years . . . for what . . .                       *\n                 thirty years . . . gone . . .                                 *\n     The tie comes off in Leonard's hand, which begins shaking            *\n     uncontrollably. JUMP CUT TO:\n\n     196.   INT. LEONARD'S DAYROOM - LATER - DAY                        196.\n     The trembling has escalated into a full-blown crisis. The\n     staff and other patients can't ignore this one. Sayer wedges\n     past them and into the room, and crosses quickly to Leonard and\n     his mother, both hysterical. All trying to speak at once:            *\n                           SAYER\n                 What happened?\n\n                                                   REV.12/5/89 (BLUE)                       Pg.1\n\n\n       196.CONT.                LEONARD                                                    196.\n                     . . . I'm ungrateful . . . I'm\n                   ungrateful . . .\n                              MRS. LOWE\n                   I said a terrible thing . . .\n                               LEONARD\n                   ... she, she, she, she ...\n      Hi s a rm lash es out , s end ing the mo del of the li bra ry cra shin g               *\n      to the floor.\n                              SAYER\n                         (to Mrs. Lowe)\n                   What happened?\n                                LEONARD\n                   ... she devoted her life to me . . .\n                   she'd have a life if it weren't                                     p-\n                   for me . . .\n                               MRS. LOWE\n                   . . . I said the most terrible\n                   thing . . .\n                                LEONARD\n                   . . . I ' m ungrateful . . . I'm\n                   ungrateful . . .                               >\n      Hi s m othe r t rie s t o c omfo rt him , t o h old him , t ear s c omin g t o         *\n      her eyes, too.\n                                LEONARD\n                   I'm sorry . . . I'm so sorry . . .\n                                MRS. LOWE\n                   I'm sorry . . . I'm sorry . . .\n      F ran k, kne eli ng t o t he flo or, gat her s t he pie ces of the br oke n            *\n      library model.\n      196A.   (NOW SC. 196C)                                                               196A.\n      196B.   INT. LEONARD'S DAYROOM - LATER - DAY                                         196B.\n      Moving slowly ac ross Jose f's work t able wher e he and F rank are .                   *\n      rebuilding the library model.\n                              LUCY'S VOICE\n,,                 There's a song at twilight                                          ,\n6                       When the lights are low\n  J\n\n                                                 REV.12/5/89 (BLUE)\n                                                                Pg.10\n       196B.CONT.                                               196B.\n       H er voice C ONTINUES t he verse O VER: Rose, her sad stra nge\n       china doll face.\n                           ROSE\n                 You'd never know it now, but I\n                 used to be so pretty, Dr. Sayer,\n                 even you would've thought so.\n                           SAYER\n                 I do think so.\n       She shakes her head 'no.1   She knows what she looks like.\n                           MAGDA O.S.\n                 What if he's just had enough\n                 of it?\n       Sayer glances to Magda, nearby with a group of other patients,\n       some of them looking off toward the sunroom where Leonard,\n       alone, at a window, stares out.\n                           FRANCIS\n                 What if it's just a matter of\n                 time for all of us?\n                             SAYER\n                                               :\n                 There's no reason to think\n                 any of this will happen to you.\n                 You're individuals. And you're\n                 all well.\n                       (pause)\n                 Aren't you?\n       Most nod, but it's without great conviction.\n                            BERT\n                 He's the strongest of us.\n       Close on Lucy/ across the room with Miss Costello, finishing\n       the song:\n                            LUCY\n                 Comes love's old song\n                    Comes love's old sweet song . . .\n       Her voice trails into silence.\n                            MISS COSTELLO\n                 That was lovely.                  '.\n                           LUCY\n ,               I learned that song a long, long\n(\\_y             time ago.\n\n                                                     REV .12/5 /89 ( BLUE )          Pg.1\n     196B.CONT.                                                                       196\n\n\no\n    Sh e gla nc es ac ro ss to t he su nro om , to Le ona rd , sti ll at t he\n    w in do w, u na wa re , or s o i t se em s, o f he r an d th e o th er s.\n\n                              LUCY\n                I know what year it is . .      .\n                I ju st ca n' t i ma gin e be i ng o lde r\n                th an tw e nt y- t wo , I h a veno\n                e xper ience at i t.\n                       (pause)\n                I know it's not 1926 . . .         I just\n                need it to be.\n\n\n    196C . I NT. PH ARM ACY - N IGH T                                                196C\n\n    Drifting across Leonard's dosage schedules, minute milligram\n    changes leading to vanishing point of health, across the scale,-\n    with nothing on it, and reaching, finally, Sayer, alone in the\n    room, surrounded by racks of medicine and no solution.\n                                                                              They\n    He glances up. Mrs. Lowe has appeared in the doorway,\n    consider each other for a long moment before:\n                           MRS. LOWE\n                When my son was born healthy,\n                I never asked why. Why was I sp\n                lucky, what did I do to deserve\n                this perfect child, this\n                perfect life? -\n    Silence. Her face toughens.\n                          MRS. LOWE\n                But when he got sick, you can bet\n                I asked why. I demanded to know\n                why. Why was this happening?\n    Silence. Then with an almost philosophical shrug:\n                         MRS. LOWE\n               There was nothing I could do\n               about it. There was no one I\n               could go to and say, \"Stop this,\n               please stop this, can't you see\n               my son is in pain?\"\n                         SAYER\n               He's fighting, Mrs -\n                         MRS. LOWE\n               He's losing.\n\no\n\n                                         REV.12/5/89 (BLUE)   Pg.\n196C.CONT.                                                196C.\nSayer almost recoils, as if from a slap. Silence. Then:          *\n                       MRS. LOWE\n           The truth is . . . I wouldn't mind\n           if he lost . . .\n                  (long pause)\n           I know you can't understand how I\n           could say such a thing . . .                        MRS. LOWE\n           But we were happy before.\n\n197.   INT. LEONARD'S DAYROOM - NIGHT                                    197.\nLeonard, alone at a table with a book. He glances up as Sayer\nsits opposite him, then down again at the book.\n                      LEONARD\n           I can't read anymore. The words\n           are written too slow. I keep\n           going back to the beginning, to\n           the beginning, and trying . . .\nHe turns back to the beginning, tries      again, his eyes moving\ntoo quickly across the lines, \"ahead\"      of the words. His hands\nand head begin shaking out of control      and it' s' all he can do to\nclose the book.\n                     LEONARD\n          I've let the others down.\n                      SAYER\n         · You have not.\n\n                   ( LEONARD\n          I've let you down.\n                     SAYER\n          You have not.\n                       LEONARD\n          I'm grotesque . . . grotesque . . .\n          grotesque . . .\n                    SAYER\n          Leonard, I won't sit here and\n          listen to you talk about yourself\n          like this --\n                    LEONARD\n          Look at me.\n\n                                                REV.1,2/5/89 (BLUE)       Pg.lO7\n         ,\\\n          -\n                                                      ·                     19 7.\n^      197.CONT.\n       He is a man consumed by illness. With a voice that is flat and\n\\f)\n w*    limbs that are bent and hands that are twisted and a grimace\n         that can only hint at the great depth of the despair he is\n         suffering.\n                             LEONARD\n                   Look at me and tell me I am not.\n                              SAYER\n                   You are not.\n        It's over and Leonard knows it. And though he won't admit it,\n        so does Sayer. Leonard barely gets the words out -»-\n                                LEONARD\n                   This . . . isn't . . . me.\n\n        198.   INT. BATHROOM - MORNING                                     198.\n        Standing before a mirror above a sink, Leonard struggles to\n        part his hair straight. He's wearing his best clothes, those\n        he wears when he's seeing Paula, but they seem to drape\n        awkwardly.\n\n        199.   INT. PATIENTS' CAFETERIA - DAY                             199.\n        He may not have looked like a patient when Paula first met him,\n        but he does now. It's all she can do to not break down in\n        front of him.                               >\n\n                                                 CONTINUED:\n\n\n\n\n    \n\n                                                     REV. 10/2/89\n\n                            PAULA\n               .. I worked . . . I had friends\n(p             over . . . I went dancing . . . that's\n               about it . . .\n     Leonard, ticcing, nods, smiles through his grimace, imagining\n     those things.\n                         PAULA\n               I know, I should do something with\n                my life.          ·\n                          LEONARD\n               Like what? Those are great\n               things. I've never done any of\n               those things.\n                           PAULA\n               You will.\n     Leonard shakes his nead 'no.'\n                          LEONARD\n               They'll never let me out of this\n               place. They shouldn't.\n     They consider each other for several moments -- the one, young\n      and healthy; the other, old and ill.\n                         LEONARD\n               I'm not well. I feel well inside\n               when I see you. I wish you could\n               see what's inside. Instead of\n               this.\n                          PAULA\n               I can see it.\n     Silence. As much as Leonard wants to say \"I love you,\" he\n     knows he cannot, that it would be ludicrous. Instead:\n                           LEONARD\n               Goodbye.                          ·\n     He ho lds out o ne of his sh aking han ds to her. S he reach es to\n     it, places her hand on it, holds it, and the shaking slowly,\n     slowly, slowly begins to subside.\n     She lifts him gently out of his wheelchair and leads him away    *\n     from the table. She arranges his arms in such a way that he is\n     sort of holding her and begins to slowly dance with him.\n\n                                                                        (REV. 10/16/89) Pink p. 10\n      199. CONT.                                                 .                             199.\n     Some patients glance      up from their       food.        Ser   vers glance up\nCO   f rom their work . All     watc h wi th a    sort o    f    re   verie the coup le\n     dancing without music     . They watch        as Leo   n   ard   's tics gradually\n     disappear. They watc      h as he finds      a sens    e    of    grace and ease,\n     as he borrows her gra     ce and ease.        They w   a   tch    him become,\n     simply, a man dancing      with a woman     .\n     From somewhere, perhaps imagined, there is music, a quiet\n     melody played on a piano.\n\n     200.   INT.* DAYROOM - SAME DAY                                                          200\n     Rolando's hands on the keys of the piano, playing the melody.\n     (NOTE: Hay want to shoot front end of this scene again without\n     Rol ando to l eave op en the opt ion of usi ng the sam e s core Ra ndy\n     writes for Lucy's walk to the window - SC. 51.)\n     L eonar d, r eturn ing f rom t he ca fete ria, walks slow ly in to t he                   *\n     room. He's bent, his arms at strange angles like the limbs of\n     a diseased tree, his legs managing each step only with great\n     concentration.\n     He nears the center of the room, the area of inconsistent tiles\n     which Sayer and Miss Costello long ago conformed with shoe\n      polish. Some of the black has worn off, and as Leonard reaches                            *\n      i t, h e f in ds hi ms elf t hro wn b y t he ir re gu lar it y. He t rie s to             *\n      step over to \"the other side,11 but his feet or legs or mind\n     will not do it.\n     Everyone in the room except Rolando becomes acutely aware of\n     the problem, of the struggle, of Leonard fighting with all his\n     will, and nothing but it, to \"cross over.\"\n     H e-cro sses the \"barr ier.\" And, wit h sur er bu t sti ll di ffic ult\n     steps, passes -the drinking fountain.\n     Tig ht o n th e wi ndow . Le onar d res ts h is gn arle d ha nd on the\n     frame as he p eers down at Paula wal king away from the hosp ital.\n     She glances back briefly before disappearing around a corner.\n     Rolando's musdc CONTINUES OVER:\n\n     201.   INT. EXAMINATION ROOM - NIGHT                                                     201.\n     The original 8mm film of Leonard, h'is eyes alert, his hands\n     exploring the microphone.                                       .\n                  · ,, >\"·>;> ' · ·                           ·.'···':'··.\"··\n                      . . LEONARD (FILM)                        ·\n                 NOW?      ·       .··                                                  ·v : .\n                                                                                          ...\n                          · .. · '                                       ·   *          ·..·\n                                                                                         .  .' '\n                        .f     SAYER S VOICE (FILM)\n                                     '                          .            \"       ;:\n                                                                                      \"'· :\n                 Whenever youfre ready.                                          .        ;\n\n                                                                         OQ\n                            L EONARD (FILM )      .\n(T~^\\             My name is Leonard Lowe. It has\n                  been explained to me that I have\n                  been away for quite some time.\n        Tight on Sayer,- alone in the darkened room, watching the\n        footage, watching Leonard wrestling with the thought.\n                              LEONARD (FILM)\n                  I'm back.\n        Light moves across the screen. Someone has entered. Miss\n        Costello. She exchanges a long glance with Sayer before they\n        both look back to the screen.\n                            LEONARD (FILM)\n                  I thought it was a dream at first.\n        Silence except for the sound of the projector.   Then -\n                            SAYER'S VOICE (FILM)\n                  When did you realize it wasn't?\n        Leonard thinks back, trying to recall the exact moment he\n        realized he was \"alive.n Finally --\n                            LEONARD (FILM)\n                  When I spoke and you understood\n                  me.\n        One tear snakes down Saver's cheek. The film cuts to silent\n        footage of Leonard, soon after his awakening, combing his hair\n        and delighting in the fact that he cjan comb it.\n        Quietly, without looking at Miss Costello --\n                            SAYER\n                  You told him I was a kind man ...\n                       (long pause)\n                  It's kind to give life only to\n                  take it away?\n        There is self-loathing in his voice. On the screen, Leonard's\n        trying to operate an electric shaver that seems alive.\n                             MISS COSTELLO\n                  It's given and taken away from\n                  all of us.\n        On screen, Leonard buttons buttons on his shirt and glances up\n        smiling, proud. Tight on sayer in the dark room, the projector\n        light flickering behind him. More to himself --\n                            SAYER\n                  Why doesn't that comfort me?\n\n                                                                                              3\n                     MISS COSTELLO\n                (quietly)\n          Because you are kind.\n                (pause)\n          And because he's your friend.\nOn screen, Leonard is beckoning to someone unseen. No one\nappears but he keeps beckoning. Finally Sayer, embarrassed and\ncamera shy, appears. Though there is no sound, it is clear he\nasks, \"What?\" Leonard turns the doctor so that he is facing\nthe camera, and points. Sayer again asks, \"What?\" \"There,\"\nLeonard says. \"Where?\" Sayer demands. Finally, Sayer\nlooks directly, curiously, into the camera.\nRolando's music CONTINUES OVER:                                           )\n\n202.    INT. DAYROOM - NIGHT                                                                 20\nThrough a window, autumn leaves on trees.\nAnd the school yard beyond the field, quiet, deserted.\nPulling back, panes of glass. Across the walls of the dayroom.\nDrawings and water colors, of people and: places.\nTo the arm of the metronome slapping back and forth.\nAnd a twisted hand, a pen grasped awkwardly in it, writing\nexcruciatingly slowly, and just barely legibly:\n              & « « * c # * * * O » * * r i ' « « * A · * · x\\ · · ·\n\nTh e ha nd , an d th e mu si c, un fi ni sh ed , st op .\nT he han d i s s till , t he arm is sti ll, th e h ead is sti ll,\nL eo na rd 's e ye s ar e \"s ti ll . \"\nO nl y th e me tr on om e mo v es , ge nt ly s la pp in g.\nD r if t in g s lo w ly a w ay fr om Le o na rd , h i s fa c e, hi s b od y , hi s\nbe in g, \"a sl e ep \" . . . ac r os s t he e mp t y ro o m . . . a n d sl ow l y to w ar d\nthe window . . .\n.. . w he re it is no w s no win g . . .\n         v,                          ·\n\n\n                                              . . . long sil ence bef ore . . .\n\n                                                                           O\n                              LEONARD O.S.\n                                                                           *\n/T\\                It's winter.\n         His voice is flat, inflectionless. His eyes, with little life\n         behind them, staring at the falling snow. He's in a\n         wheelchair.\n                                SAYER O.S.\n                   Yes.\n                             LEONARD\n                   Am I speaking?\n                                SAYER O.S.\n                   Yes.\n         Leonard's eyes drift to a chair, his mother's chair, the one\n         she has used for thirty years. It's empty.\n                             SAYER O.S.\n                   Your mother is well. She's home.\n                   She visits you on Sundays.\n         Leonard slowly nods.    Somehow he knows that.\n                             LEONARD                :\nf ~^               She's living her own life.\n                             SAYER O.S.                     ,\n                   She's trying to.\n         Leonard's eyes drift again, across to silent ghost-like figures\n         in wheelchairs, the post-encephalitics, all of them, \"asleep\"\n         again.\n                             SAYER O.S.\n                   They fought, as you did, with\n                   great courage. They were strong.\n         Leonard looks down at his hands and feels one with the other.\n         He looks back at the \"sleeping\" patients, not comprehending why\n         they cannot do the same.\n                             LEONARD\n                   I'm stronger?\n         Sayer is finally revealed seated beside him. He doesn't\n         answer. Leonard's hands slowly reach to his face and feel its\n         features.\n                             LEONARD\n    ,x             I'm here, aren't I?\n\n&\n\n    His glance finds the tray beside Sayer, the paper medicine cup\n     and empty juice cup on it. He must be back on the medication\n     again. He looks back to Sayer, who's looking toward the\n    window, to the falling snow. Eventually -\n                         SAYER\n               Do you think you can walk?\ni\n\n    203.   INT. CORRIDOR - DAY                                          203\n    A doctor in a lab coat, one Sayer long ago imparted his \"will\n    of the ball\" theory to, emerges from a ward.\n                            FERNANDO O.S.\n               Dr. Tyler?\n    The doctor turns.    Fernando is walking toward him.\n                         FERNANDO\n               You got a minute?\n                         DR. TYLER\n                    (not really)\n               What is it?\nFernando arrives, leans against the corridor wall, and sort of\nmumbles --·\n                          FERNANDO\n               You know that woman in Ward 7 . . .\n               Grace, uh ... what's her last name\n               ... Grace ...\n                          DR. TYLER\n                    (annoyed)\n               Does it matter, Fernando?\nSayer and Leonard walk slowly past, behind Tyler.          Fernando's\neyes briefly meet Sayer's.\n                           FERNANDO\n               . . . no . . . I guess not . . .\n\n204.       INT. ANOTHER CORRIDOR, - DAY                                 204\nAnother doctor emerges from another ward.\n                       ·                                                *\n                     MARGARET O.S.\n          Dr. Sullivan?\n                     DR. SULLIVAN\n                (turning)\n          Yeah?\n\n                                              REV.12/15/89 (GREEN)             Pg.114\n                                                                                   204\n            204 CONT.\n            Sayer and Leonard approach. Margaret has positioned herself,\n            like Anthony, against the wall, and, pointing out something on\n            a clipboard to Dr. Sullivan, glances up briefly as Sayer and\n    T~^\\\n(   i--J   Leonard pass.\n            205.   INT. CORRIDOR / LOBBY - DAY                                    205.\n           Sayer and Leonard approaching the lobby. As they enter, the\n           switchboard operator glances up, notices them, and glances back\n           down without a word.\n           They approach the front doors.      They are almost there.   From\n           behind them, loudly --\n                                 MISS COSTELLO O.S.\n                       Dr. Kaufman?\n                                    KAUFMAN O.S.\n                       Dr. Sayer?\n           Sayer and Leonard stop just short of the doors. They glance\n           back and see- Kaufman -and,v-several* steps .behind..him, looking\n           distraught, Miss Costello. She has failed.\n                                    SAYER\n                       Yes?\n           The two doctors stare at one another for several moments.\n           Clearly Kaufman knows what is happening. Clearly Sayer knows\n           he knows. Eventually --\n                                 KAUFMAN               ,\n                       Put a coat on him for Christ's\n                       sake.                          ·\n           He turns around, walks past Miss Costello and down the corridor-\n           from which he came. Miss Costello relaxes, turns around and\n           walks away down the corridor.\n           Sayer and Leonard turn and walk outside.\n\n           206.    INT. DAYROOM - SAME TIME - DAY                                 206.\n           Though Rolando is not playing, cannot play, the piano, he can\n           hear it, distant, like an echo, as a nurse wheels him toward\n           the windows. Other nurses and orderlies are wheeling Rose,\n           Frank, Bert, and Lucy and the others there. Sidney is wheeling\n           Lolly.\n           They all \"peer\" out. They all \"see\" down below, standing\n           across the street, Sayer and Leonard.\n\n                                         REV.12/15/89 (GREEN)       Pg.115\n\n                                                                        207\n     207.   EXT. BAINBRIDGE - SAME TIME - DAY\n\nCO   Sayer drapes his coat around Leonard. Neither speaks.\n     Neither quite knows what to say. Eventually, Sayer holds out a\n     hand for Leonard to shake. Leonard stares at it for a long\n     moment, then awkwardly embraces Sayer.\n\n     208.   INT. DAYROOM - SAME TIME - DAY                              208\n     The others \"watch\" Sayer cross back to the hospital. They\n     \"watch\" Leonard staring after him. He glances down the street,\n     Leonard, glances down the street the other way. He seems\n     uncertain which way to go . . .\n     He walks away.\n\n     209.   INT. SUBWAY - EVENING                                       209\n     Rhythmic pounding.   Metal wheels over metal tracks.\n     Leonard feels things.inside his coat pockets. He,pulls from\n     one several capsules of L-Dopa in a clear plastic bag; and from\n     the other, a wad of money wrapped in paper on which is typed\n     his name and \"Bainbridge Hospital, Bronx.\" He stuffs it\n     all back into his pocket and glances up. :\n      The train is crowded. Everyone seems to be hiding behind a\n     newspaper or the veil of a glazed look; everyone but Leonard\n     and the eleven year old boy seated next to him with his mother.\n     They're taking everything in, Leonard and1 the boy - the rumbl\n     of the train, the overhead lights flashing off and on again,\n     the mounting excitement they both feel.\n     The boy glances up at Leonard, and, like a secret -\n                          BOY ON TRAIN\n                     (a whisper)\n                We're going to the city.\n                           LEONARD .\n                      (a whisper back)           .\n                Me, too.                                        '\n\n     210.   INT. SUBWAY STATION - N.Y. - NIGHT                          210\n     Underground tunnels. People climbing stairs. Leonard climbing\n     with them. Under exposed pipes and ducts. Along passageways.\n     Through an exit turnstile. Up more stairs. And finally -\n\n                                      REV.12/15/89 (GREEN)              Pg.116\n                                        (continuity only)\n        211.    EXT. NEW YORK CITY - NIGHT                                 2 1..\n                                                                            1\n        Leonard, emerging from down below, reaches the street. People\n        jostle past him but he doesn't move. He stares in wonder at\n        what lies before him . . . lights, skyscrapers, Christmas\n        decorations, taxis, noise, people . . . life.\n\n        211A.   INT. EXAMINATION ROOM - SAME TIME - NIGHT                211A.\n        An oppressive silence. The oppressive institutional room.\n        Sayer, alone in it, at his desk in the corner.\n                              MISS COSTELLO O.S.\n                    Good night.\n        Sayer glances up, sees Miss Costello in the doorway to the\n        corridor.\n                              SAYER\n                    Good night.\n    i\n        She leaves. He-stays. iPuts.a -folder in.a.drawer* Straightens\n        things on the desk. Looks for something more to do. Clearly\n        there's nothing more to do.\n        He gets up. Wanders slowly around the room. Past the medical\n         instruments in the glass cases, the tripod and projector, along\n         tne waii covered with taped and tacked data, notes, Polaroids.\n        Buried in it he sees Leonard's original perception test, and\n        alongside it, the first Polaroid of him . . .\n        Sayer abruptly moves to the window, yanks at it, but it's\n        jammed shut again. Below he can see Miss Costello crossing\n        toward her car. He fights with the window, finally frees it,\n        slides it open and yells out loudly -\n                               SAYER\n                    Eleanor.\n        She turns to the voice. He turns from the window.\n        Tight on the glasses left on his desk.\n\n        211B.   EXT. PARKING LOT, BAINBRIDGE - MOMENTS LATER - NIGHT    211B.\n        He hurries out of the building and across the lot. Winded, he\n        reaches her.\n                             MISS COSTELLO\n                   What's wrong?\n\nQ\n\n                                                 R EV. 12/ 15/ 89 (GRE EN)           Pg.1 17\n\n        211B.C0NT.                                                                         211\n        He h old s h is han d up wh ile he tr ies to cat ch his bre ath . She\n        s ta re s a t him , co nce rn ed pe rh aps s ome th in g h as ha pp en ed to\n        Leonard.\n                                      SAYER\n                     Nothing ...\n                             (he casts around)\n                     No , I was wo nde rin g . .. W hat ar e\n                     y o u d o i n g ? Y o u pr o b a b l y h a v e\n                     plans . . . or . . .\n\n                                 M ISS C OSTE LLO\n                     No, I ' m just -\n\n                                SA YER\n                     Because I was wondering . . .\n                     m aybe ... you h ave n o pla ns .. .?\n                                MIS S COS TELL O\n                     I ha ve no -\n\n                                  S AY ER\n                     Because -I -was -wondering, ..maybe . . .           .\n                     you'd . . . we . . . could . . .\n                            (grasping for an\n                             idea)\n                     I do n' t kn ow , go g et a c up    .\n                     o f cof fee somew here ... t ogeth er\n                     · · · or ···\n\n        O r wh at - s ep er at el y? H e t ra il s of f, p er ha ps w is h in g he\n        h adn't com e out at a ll.\n                                SAYER\n                     ... Maybe we could just . . . go\n                     for a walk ... ?\n        He shrugs. That's the best he can do. A slow, slow smile\n        crosses her face.\n                                MISS COSTELLO\n                     I 'd be delighted.\n\n        212.   EXT. NEW YORK CITY - NIGHT                                            .    212.\n        A mechanical dog crosses Leonard's path wagging its tail.\n        Unlike everyone else, he stops to admire it. He's enchanted by\n        it. He smiles at the peddler and the \"litter of pups\" moving\n        around his feet.\n                               LEONARD\n,                    They're so life-like.\n    (\n\n                                    REV.12/15/89 (GREEN)        Pg.118\n\n212.CONT.             PEDDLER                                      212.\n            And only five bucks, can you\n            believe it?\n\n213.   INT/EXT. TAXI/STREETS - NIGHT                               213.\nIn the back of a taxi, Leonard stares out the window,\nmesmerized by all he sees. The driver glances back in the rear\nview mirror.\n                      HECTOR\n            How 'bout those Jets?\nLeonard glances at the rear view mirror and finds in it the\ndriver's eyes.\n                       LEONARD\n            I like them.\nLeonard glances out the window, a little puzzled, to the sky,\nto see if there's one flying overhead.\n                       HECTOR\n            Broadway Joe.\nThe driver glances back to see what Leonard thinks of that.              *\nLeonard nods uncertainly.\n                         LEONARD\n            Yeah.\nAs they rattle along, Leonard peers back but the window at\nthings going by, and absently pets the mechanical dog in his\nlap. Eventually -\n                      HECTOR\n            You·re not from here.\n                      LEONARD\n            I am. I was born here.     But.I've\n            been away a long time.\n                         HECTOR\n            Where?\n                         LEONARD\n            The Bronx.\nHector has to laugh, but it's cut short by the blare of his *\nhorn as he slams it in response to another cab sliding into his *\nlane.\n214-217.    OMITTED                                            214-217.\n\n                              REV.12/15/89 (GREEN)             Pg.119\n\n218.   INT/EXT. TAXI/STREET - NEW YORK - NIGHT                     218.\nThe meter clicks over and into double digits.    The taxi is\nparked across the street from a diner.\n                     HECTOR\n           I don't mind sitting here if you\n           don't, but to what end are we\n           sitting here?\nLeonard watches a waitress in the diner, Paula, chatting with\nsome young customers. His hand moves to and onto the car door\nhandle, but then hesitates opening it. Paula is getting her\ncoat and leaving with her friends. They have ice skates.\n\n                                                                   219.\n219.   EXT. ROCKEFELLER CENTER - NIGHT\nPrometheus stealing fire from heaven, dwarfed by the Christmas\ntree that towers over him. Figures glide past the statue.\nSkaters on the ice rink.\nIt's magical.- At *least« as-seen, through .Leonard's eyes. From\nthe promenade he watches the skaters gliding gracefully over\nthe ice. Hector appears at his side.\n                      HECTOR                 :\n           I ' m sorry to bother you, Len, I\n           just thought you should know this\n           is adding up, you know?\nWithout taking his eyes from the skaters below, Leonard digs\ninto his coat pocket and hands Hector a clump of money,\nhundreds of dollars. Embarrassed -\n                     HECTOR\n           I didn't mean that, just -\n                      LEONARD\n           I don't need it, you keep it.\nHector puts the money back in Leonard's coat. Leonard finds\nPaula among the skaters, isolates her from them, and watches\nher glide around the rink. A fine mist of snow is falling,\nveiling her.\n                    HECTOR\n          Beautiful, isn't it.\n                    LEONARD\n          Unforgettable.\n\n                                               REV.12/15/89 (GREEN)        Pg.120\n           219.CONT.                                                         219«\n\n ^       A blur of faces, of people on the promenade, from Paula's\n/'\"~J~      perspective. Though it is impossible, she thinks for a moment\nWj       she sees Leonard's among them. She arcs and glances back up\n           again, but the man who resembled Leonard is gone.\n\n           220.   INT. TAXI - NIGHT                                          220.\n           The cab rattling down another street.\n                                LEONARD\n                      You have children, Hector?\n           Hector takes a photograph from his chauffeur's permit plate and\n           hands it back. A boy, five, healthy and happy.\n                                 LEONARD\n                      He's lovely.\n                                HECTOR\n                      I thank God for him every day.\n                      Every single day.\n           Leonard begins to weep softly. Once Hector notices, he slows\n           the car, pulls to the curb, and studies Leonard in the rear\n           view mirror. Has this man lost a child? The taxi engine\n          idles.                                     :\nr--\n                          '    ,\n\\%\n           221.   EXT. NEW YORK CITY - NIGHT                                 221.\n           The cab, empty, parked in front of an apartment building in a\n           working class neighborhood.\n\n           222.   INT. HECTOR'S APARTMENT - NIGHT                             222\n           The mechanical dog on a bathroom sink. Leonard staring at his\n           reflection in a mirror. And at his hands. It's happening.\n           He's falling apart.\n          HALLWAY. Leonard at a bedroom door. Peering in at Hector's\n          sleeping son. He steps quietly into the room and places the\n          mechanical dog on the pillow beside the boy's head.\n          THE LIVING ROOM. A small Christmas tree. Hector and his wife\n          sitting on cheap furniture with cups of egg nog. Leonard\n          emerges from the hallway.\n                                  '                *\n                               LEONARD\n                    I have to be leaving.\n                          (having trouble with\n                            the words)\n                     I want to th-ank you. You've been\n                     very kind to me.\n\n                               REV.12/15/89 (GREEN)               Pg.121\n\n222.CONT.                                         .           .     222.\nHector and his wife are both thinking the same thing:      this\nman's not well and they shouldn't let him go.\n                    HECTOR\n          Leave? You're our guest, we got\n          dinner coming. We're having\n          something to eat.\nHis wife agrees with a couple of words in Spanish as she gets              *\nup and crosses toward the kitchen.    .\n                     HECTOR\n          Stay with us.\n                     LEONARD\n          I can't.\nAnd he can't explain why. He takes the crumpled wad of money               *\n(and paper) from his coat pocket and tries to give it to Hector\nagain.\n                     HECTOR\n          Hey -\n                     LEONARD\n          It has no value to me, believe    ;\n          me.\n                    HECTOR\n          I don't want it.\n                    LEONARD\n          It's for your son. It's for him.\nHector doesn't take it but doesn't say anything more about it\nwhen Leonard sets it down on the coffee table.\n                    HECTOR\n          At least let me give you a lift\n          wherever you're going.\n                     LEONARD\n          No, I think I ' d like to walk.       .\n                (to Hector's wife)\n          Thank you.\nShe nods, Your welcome, from the doorway of the kitchen.\nLeonard offers his hand to Hector to shake.\n                    HECTOR\n          What's wrong with you, Len?\n\n                                    REV.12/15/89 (GREEN)    Pg.122\n\n222.CONT.              LEONARD                                       222\n                  (pause)\n            This is good, what you've got\n            here.\n                       HECTOR\n            I know that.\nLeonard smiles; the man does know it, and appreciates it.\n                       LEONARD\n            Bye.\n\n223.    EXT. NEW YORK CITY - NIGHT                                 223.\nDescending from a fire escape strung with a single strand\nof Christmas lights . . . down to the street below, to Leonard,\nmoving along the sidewalk, noticing:\nA young couple, bundled up, hurrying down the stairs of a\nbasement apartment, fumbling with keys;\nA Christmas tree too large for the doorway of an another\napartment across the street, being tugged at by someone inside,\nunseen. >\nLeonard smiles. His gait and tics, and especially the smile,\nmake him look insane. He passes a shop window with very simple\nornamentation as the proprietor inside switches out the lights,\nand continues on, and into the darkness of the street ahead.\n\n224.    EXT. EAST RIVER - NIGHT                    -               224.\nBlack water. The river. The drone of engines and syncopated\nrhythms of wheels of unseen cars.\nLeonard, at the river's edge, stares into the water. His hand\ncomes out of his pocket holding the bag of L-Dopa capsules, and\nhe lets it fall in. It floats for a moment before a force from\nbelow, like a hand, pulls it under.\n\n224A.   EXT. EAST RIVER - DAWN                                    224A.\nLeonard on a bench. Behind him, across an empty field, bums\nhuddled over a barrel fire warming their hands.\n                       SAYER O.S.\n            Leonard?\nSayer's face appears against a pastel dawn sky. Leonard\n glances up at him. Behind them, in the distance, Hector stands\n outside his parked cab. Sayer sits. Long silence . . .\n\n                                                  REV.12/15/89 (GREEN)   Pg.123\n                                                   (continuity only)\n\n        224A.CONT.                 SAYER                                    224A.\n                     I' m sorry.\n                                   LEONARD\n                     What for?\n        He smiles crookedly, then looks out across the water again.\n                                LEONARD\n                     Isn't that something . . .\n        Sayer looks out. The morning colors are mirroring off the\n        water like paint on glass. They both watch. The colors are\n        deepening right before their eyes. Long, long silence\n        before . . .\n                               LEONARD\n                     Can you take me home?\n        Sayer helps him up. And as they move slowly toward the waiting\n        taxi. Hector opens the rear door. The only sound is the hiss\n        of tires, the -rhythm of wheels, .until -\n                               LEONARD V.O.\n                     When I was a boy I felt myself\n                     being carried away by illness like\n                     a swimmer sucked out by the tide.\n        Drifting slowly out across the water and the Brooklyn Bridge\n        stretching out across it.\n                                 LEONARD V.O.\n                      I feel it again, only this time\n                     I've been somewhere. I vent to a\n                J\n                     place and felt things I never\n                     dreamed of. I went to a place and\n                      felt hope and fear and hatred and\n                      love, I glimpsed life . . .\n\n        225.   INT. LEONARD'S LIBRARY - BAINBRIDGE - DAY                    225.\n        Drifting slowly across the faces of patients reading in\n        Leonard's library, and settling finally tight on him, \"asleep.\"\n                               LEONARD V.O.\n                     It's good, life.\n        Spines of books on shelves lining the walls. And Paula's face,\n        considering the titles.\n [--\\                           SAYER O.S.\n;( __\n  lJ                 I t doesn't matter wh ich one.\n   '                 They'r e all his favorites .\n\nr\n                                              REV.12/15/89 (GREEN)      Pg.124\n                                               (continuity only)\n            225.CONT.                                                      225\n           She pulls one of the books down at random and crosses the     ,\n           library with Sayer, passing patients - including the woman with\n           multiple sclerosis - readiny at tables with flowers on them.\n                                SAYER O.S.\n                     Leonard?\n           He's in a wheelchair, behind an oak desk on which rests, among\n           other things, the Ouija board. His eyes open but do not appear\n           to comprehend the doctor's presence or his surroundings. His\n           expression is absolutely \"expressionless.\"\n                                SAYER\n                     I ' m sorry to wake you, but there's\n                     someone here to see you.\n           Leonard remains still. \"Asleep.\" And there's a long silence\n           broken only by the sound of pages being turned. And then, from\n           Dickens' \"The Old Curiosity Shop\" --\n                                PAULA\n                           (reading)\n                     \"Night is generally my time for\n                     walking. In the summer, I often\n                     leave home early in the morning\n                     and roam about fields and lanes.:\n    ' \"^             all day. Or even escape for\n                     days or weeks together . . .\n           Leonard is unable to acknowledge in any way that he recognizes\n           the words or her voice . . . but he does. And as she reads,\n           the words become alive and the walls recede ...\n                                   PAULA\n                     \"But saving in the country, I\n                     seldom go out until after dark,\n                     though Heaven be thanked, I love\n                     its light and feel the\n                     cheerfulness it sheds upon the\n                     earth as much as any creature\n                     living . . . \"\n           And he is moving into the light.\n\n\n\n\n\nAwakenings\nWriters :   Steven Zaillian\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:19:57.925875"}