{"title": "Bachelor Party, The", "film_link": "/Movie Scripts/Bachelor Party, The Script.html", "script_link": "/scripts/Bachelor-Party,-The.html", "info_raw": "\n\nBachelor Party, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paddy Chayefsky\nGenres  Drama\nMovie Release Date : April 1957\n\nRead \"Bachelor Party, The\" Script\n\n\n", "script": "\n                               \n\n\n                               THE BACHELOR PARTY\n \n                               by Paddy Chayefsky\n\n\n\n\tFADE IN.\n \n\tEXTERIOR. STUYVESANT TOWN HOUSING PROJECT -- DAY.\n\tUnder the credits, the CAMERA PANS slowly across the project, \n\tcapturing the sober monotony, the endless straight apartment \n\thouses. Seven o'clock in the morning.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. CHARLIE'S BEDROOM\n\tThe bedroom of a two-and-a-half-room apartment in the housing \n\tproject. It is early morning, but the shades are drawn and \n\tthe room is dark. CAMERA moves slowly across the room, over \n\tthe large double bed on which Charlie and Helen Samson, a \n\tyoung couple in their late twenties, are sleeping. They are \n\tsleeping more or less on their sides, facing away from each \n\tother. One of Helen's pajama-clad legs projects from under \n\tthe light covers. We close in on Charlie's sleeping face.\n \n\tThe alarm clock at a distant end of the room suddenly bursts \n\tinto a soft relentless buzz. Charlie's eyes open. There is a \n\tmuffled movement at his side, and Helen gets up on one elbow. \n\tThen she sits up, rises, and pads barefooted -- a rather \n\tpretty girl in rumpled pajamas -- to the alarm clock and \n\tturns it off. Charlie's head turns on the pillow so that he \n\tcan watch her. She pads back to the bed now and stands at the \n\tfoot, looking down at her husband. She produces a smile, then \n\tturns and shuffles into the bathroom where she turns on the \n\twall switch. A shaft of light now pours into the bedroom.\n \n\tCharlie sits up in bed. His shoes and socks are on the floor \n\tby his feet. He reaches down and starts to put them on. \n\tSuddenly, from the recesses of the bathroom, Helen's rather \n\tvague soprano lifts into the first lines of a popular song. \n\tThen it stops as abruptly as it began. Charlie's head slowly \n\tturns to look at the bathroom, back again to the business of \n\tputting on his socks. His face is expressionless, but there \n\tis no mistaking the sodden distaste he has for the world \n\ttoday.\n \n\tHe just sits on the bed, a young man of twenty-nine, clad \n\tonly in his pajama trousers, one sock dangling from his hand, \n\this head hanging, his shoulders slumped. Behind him, the \n\tsudden noise of rushing tap water, then off. Then his wife \n\tcomes back into the bedroom. She is carrying a bath towel \n\twith which she is drying her face. Finished, she drops the \n\ttowel on the bed and begins to dress. A moment later, she \n\tpads around the corner of the bed to Charlie's front. She \n\tis still barefooted and wears her pajama top, but she has \n\texchanged the trousers for a half-slip. Charlie hasn't moved \n\ta muscle since the effort required to lift one sock from the \n\tfloor.\n \n\t\t\t\tHELEN\n\t\tYou think it's too early to call \n\t\tmy mother?\n \n\t\t\t\tCHARLIE\n\t\tI don't know.\n \n\tCharlie shrugs without looking up. Helen goes out of the \n\tbedroom, into the little square of foyer where there is a \n\ttelephone table with a telephone on it. She dials, waits. In \n\tthe bedroom, Charlie rubs his eyes with two fingers.\n \n\t\t\t\tHELEN\n\t\t\t(on phone) \n\t\tHello, Ma, did I wake you up? This \n\t\tis Helen.... Well, I'll be going to \n\t\twork, and I wanted to get ahold of \n\t\tyou before I left. I called you last \n\t\tnight. Where were you and Pop anyway? \n\t\tI kept calling you every half hour \n\t\tup till one o'clock.... Oh, yeah? Did \n\t\tyou have a nice time? ...\n \n\tCAMERA SLOWLY MOVES IN FOR CLOSEUP\n\tof Charlie in bedroom.\n \n\t\t\t\tHELEN'S VOICE\n\t\tWell, listen, Ma, I got something to \n\t\ttell you. I'm pregnant.... Yeah, \n\t\tpregnant.... Of course I'm sure. \n\t\tI've got the report back from the \n\t\tlaboratory.... No, you wouldn't know \n\t\thim, Doctor Axelrod.... Second month. \n\t\tHe says I can expect the baby in \n\t\tFebruary.... Well, Grandma, act a \n\t\tlittle excited, will you? ... You \n\t\tbet I'm excited....\n \n\tCLOSEUP OF CHARLIE \n\tHe is not excited. If anything he is miserable. His bowed \n\thead rises slowly. The eyes open. He stares abstractedly \n\tahead for a moment. Then he sighs a profound sigh of \n\tresignation. Then his eyes close again, and his head slowly \n\tsinks back to its previous abjection. \n \n\t\t\t\t\t\tDISSOLVE TO:\n \n\n\tINTERIOR. THE KITCHEN -- HALF HOUR LATER \n\tHelen, dressed in skirt and blouse now, is preparing two \n\tcups of instant coffee, pouring hot water from the saucepan \n\tinto the two cups. The toaster is ticking. A packaged loaf \n\tof white bread is open on the cupboard shelf. Finished with \n\tpouring the water, Helen sets the saucepan back on the stove \n\tand comes out into the dining area. The dinette table is \n\tcovered from end to end by open textbooks, several very large \n\taccounting worksheets on which are scrawled meticulous \n\tnumbers, a ruler, several pencils and a pen, an ash tray \n\tglutted with cigarettes, a cup and saucer. \n \n\t\t\t\tHELEN\n\t\t\t(calling to the bedroom)\n\t\tDo you need any of this or can I \n\t\ttake them off the table? \n\n\tCharlie appears in the bedroom doorway, dressed and washed \n\tnow, a neat, clean young man in a white shirt and neatly \n\tknotted tie.\n \n\t\t\t\tCHARLIE\n\t\tI'll clean that up in a minute.\n \n\tHe disappears back into the bedroom. Helen picks up the ash \n\ttray and the cup and saucer.\n \n\t\t\t\tHELEN\n\t\tHow late were you up last night?\n \n\t\t\t\tCHARLIE'S VOICE\n\t\tAbout two.\n \n\tINTERIOR. THE BEDROOM \n\tCharlie standing by the window, is picking up his keys, a \n\tfew dollar bills, a comb, etc., from a chair and putting \n\tthem into his trouser pockets. The blinds of the bedroom \n\twindow have been opened, and the high August sun streams in, \n\twhitening Charlie's face. After he has pocketed his odds and \n\tends, he moves to the chest of drawers on which, among all \n\tsorts of other things, there are several textbooks and an \n\topened notebook. He stands a moment looking down into the \n\topen notebook, his lips moving ever so little, as he commits \n\tsome of his notes to memory. He turns a page of the notebook \n\tback to check something and then goes back to the previous \n\tpage. Now he opens one of the smaller drawers in the chest \n\tof drawers. The drawer contains wisps of his wife's stockings \n\tand other feminine things. He finds a small roll of bills and \n\ttakes one of them, putting the bill in his pocket and closing \n\tthe dresser drawer. \n\n\t\t\t\tCHARLIE\n\t\tI'm taking five bucks from your \n\t\tdrawer. \n\n\tHe pauses now to affix a less frowning expression onto his \n\tface and goes out into the little foyer and into the dining \n\tarea.\n\n\tINTERIOR. THE DINING AREA\n\tHelen is seated at the dinette table, sipping coffee and \n\treading yesterday's newspaper. There are two cups of coffee \n\ton the table.\n \n\t\t\t\tCHARLIE\n\t\tA guy in my office is getting \n\t\tmarried, and I got clipped four \n\t\tbucks for his wedding present.\n \n\tHe begins assembling the mass of papers and textbooks on the \n\ttable.\n \n\t\t\t\tHELEN\n\t\tWho's getting married?\n \n\t\t\t\tCHARLIE\n\t\tArnold. I told you about him. The \n\t\tguy with the sick mother.\n \n\t\t\t\tHELEN\n\t\tOh, yeah.\n \n\t\t\t\tCHARLIE\n\t\t\t(trying to decide \n\t\t\twhether he needs a \n\t\t\tcertain worksheet) \n\t\tThe rest of the guys are giving him \n\t\ta bachelor party tonight.\n \n\t\t\t\tHELEN\n\t\tDo you want to go, Charlie?\n \n\t\t\t\tCHARLIE\n\t\tI got class tonight.\n \n\t\t\t\tHELEN\n\t\tWhat have you got -- cost accounting?\n \n\t\t\t\tCHARLIE\n\t\tYes.\n\n\t\t\t\tHELEN\n\t\tI think you ought to take off a \n\t\tnight. You ought to go, have a little \n\t\tfun for yourself. I think you need \n\t\tthat. You go to work all day, you go \n\t\tto school all night. You can miss one \n\t\tnight, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tNo, these bachelor parties get kind \n\t\tof wild sometimes. The whole \n\t\tphilosophy is: it's the groom's last \n\t\tnight of freedom. So it gets kind of \n\t\twild sometimes.\n \n\t\t\t\tHELEN\n\t\tThat's a good philosophy to start a \n\t\tmarriage with.\n \n\t\t\t\tCHARLIE\n\t\tWell, a bunch of guys get together, \n\t\tthey like to tear up the town a \n\t\tlittle.\n \n\tHe has assembled his notes and notebooks and texts in a pile \n\ton the table, ready to take with him. He sits down and \n\tbegins sipping his coffee. Helen looks back to her newspaper, \n\tfrowning a little, then looks up at Charlie again.\n \n\t\t\t\tHELEN\n\t\tI think you oughta go, Charlie. I \n\t\tknow you're upset about the baby.\n \n\t\t\t\tCHARLIE\n\t\tI'm not upset about the baby.\n \n\t\t\t\tHELEN\n\t\tCome on, Charlie. I know how you \n\t\tfeel. Listen, you don't have to \n\t\tpretend you're excited about the \n\t\tbaby. We weren't exactly planning \n\t\ton a baby right now ...\n \n\t\t\t\tCHARLIE\n\t\tI'm not upset about the baby.\n \n\t\t\t\tHELEN\n\t\tIt's a shock. I had some bad days \n\t\tbefore I told you. I said: \"Oh, boy, \n\t\tthat's all we need. A baby.\" Then I \n\t\tsaid to myself: \"If I'm having a \n\t\tbaby, I'm having a baby. That's all \n\t\tthere is to it.\" And I like the idea. \n\t\tWe're going to have a family, \n\t\tCharlie. I like the idea.\n \n\t\t\t\tCHARLIE\n\t\tWell, give me a couple of days to \n\t\tget used to the idea. I'll be all \n\t\tright.\n \n\t\t\t\tHELEN\n\t\tI know you will, Charlie. That's why \n\t\tI think you ought to go to this \n\t\tbachelor party tonight.\n \n\t\t\t\tCHARLIE\n\t\t\t(bursting out) \n\t\tI don't want to go to this bachelor \n\t\tparty.\n \n\tHe looks down at his coffee, embarrassed at the outburst.\n \n\t\t\t\tCHARLIE\n\t\tI'm sorry I yelled.\n \n\t\t\t\tHELEN\n\t\tDon't be silly.\n \n\t\t\t\tCHARLIE\n\t\tI better get going. Kenny's probably \n\t\twaiting for me now. I'm sorry I \n\t\tyelled like that.\n \n\t\t\t\tHELEN\n\t\tWhat are you sorry about? Don't I \n\t\tyell at you all the time?\n \n\tWE STAY ON HELEN, as she reads her newspaper, but there is \n\ta faint frown on her face.\n\n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. LOCAL PLATFORM EASTSIDE IRT SUBWAY\n\tAn express train hurtles southward. We see it flashing by \n\tthrough the concrete pillars of the subway. \n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tIRT EXPRESS HURTLING SOUTHWARD\n\tCharlie and another young man, named Kenneth, are seated in \n\ta crowded subway car. People are standing tightly in the \n\taisles. Kenneth is an amiable young man of thirty-odd. He \n\thas his jacket off and his tie loosened as a concession to \n\tthe August heat. Charlie is neatly and coolly dressed. He \n\thas two notebooks and a battered text in his lap. He is \n\treading the text. Two young white-collar workers on their \n\tway to work. They ride along silently for a moment. Kenneth \n\tis rather stealthily concerned with a full-busted young \n\twoman who is standing directly in front of him, holding on \n\tto a strap. It is summertime, and the girls all wear light \n\tsummer frocks. There is a feeling of wistful sensuality to \n\tthe scene.\n \n\t\t\t\tKENNETH\n\t\tYou going to Arnold's bachelor party?\n \n\t\t\t\tCHARLIE\n\t\tI don't think so, Kennie. \n\n\t\t\t\tKENNETH\n\t\tWhat?\n\n\t\t\t\tCHARLIE\n\t\tI got two classes tonight.\n\n\t\t\t\tKENNETH\n\t\tYeah, I was going to go, but I think \n\t\tI better not, because my kid, the \n\t\tyoung one, the girl, she's been \n\t\tacting up again lately. She's got \n\t\tsome kind of allergy, the doctors \n\t\tdon't know what.\n \n\t\t\t\tCHARLIE\n\t\tThese bachelor parties get kind of \n\t\twild sometimes. Eddie Watkins is \n\t\tmaking all the arrangements. He's \n\t\tprobably got us lined up with a \n\t\tbunch of chorus girls.\n\n\t\t\t\tKENNETH\n\t\tYeah, do you think so?\n \n\t\t\t\tCHARLIE\n\t\tYou know Eddie.\n \n\t\t\t\tKENNETH\n\t\tYeah, boy, he really lives it up, \n\t\tdon't he? Did you see that blonde \n\t\twho picked him up for lunch last \n\t\tweek? Boy, sometimes I wish I was a \n\t\tbachelor. Well, you know what I mean. \n\t\tI never seem to get out of the house \n\t\tany more, you know what I mean? \n\t\tAbout once a week, I go to the \n\t\tmovies. We never even see the whole \n\t\tpicture. My wife starts worrying \n\t\tabout the kids. My youngest kid, the \n\t\tgirl, she's got some kind of rash. \n\t\tWe don't know what it is. I never \n\t\tseem to see anybody any more. Do you \n\t\tknow how long it is since I've seen \n\t\tWillie Duff? I haven't seen Willie \n\t\tin about six months. My wife can't \n\t\tstand his wife. You ever seen her, \n\t\tWillie's wife?\n \n\t\t\t\tCHARLIE\n\t\tNo, I didn't know Willie too well. \n\n\t\t\t\tKENNETH\n\t\tBoy, wait'll you have kids, boy. \n\t\tYou'll never get out of the house.\n \n\t\t\t\tCHARLIE\n\t\tHelen's pregnant now.\n \n\t\t\t\tKENNETH\n\t\tNo kidding.\n \n\t\t\t\tCHARLIE\n\t\tYeah.\n \n\t\t\t\tKENNETH\n\t\tOh, that's wonderful, Charlie, \n\t\tthat's wonderful! \n\n\tThe two young husbands look down again at their hands and \n\tride along silently. Kenneth sneaks a quick look up at the \n\tgirl standing in front of him, and then lets his attention \n\tdrift down the length of the car.\n \n\t\t\t\tKENNETH\n\t\tHey, there's a guy down there, \n\t\ttrying to pick up a girl down there.\n \n\tHe is referring to a Young Fellow who elbowed his way down \n\tthrough the crowded aisle but who stopped abruptly when he \n\tnoticed an attractive girl, seated about three seats down \n\tfrom Kenneth. The Girl is reading a newspaper. The Young \n\tFellow stares at her. The Girl, aware of this sudden \n\tattention, looks briefly up from her newspaper. The Young \n\tFellow smiles pleasantly. The Girl, with a show of \n\tannoyance, looks back to her newspaper.\n \n\t\t\t\tKENNETH\n\t\tWere you with us about eight years \n\t\tago when I picked up that chick in \n\t\tfront of the bus stop in Paterson, \n\t\tNew Jersey?\n \n\t\t\t\tCHARLIE\n\t\tWhen was this?\n \n\t\t\t\tKENNETH\n\t\tYeah, you were there. You were with \n\t\tthat girl from Brooklyn. We just \n\t\tcame from Palisades Amusement Park, \n\t\tand we were driving Frankie Klein's \n\t\tgirl home, and the car broke down \n\t\tright in the middle of Route One.\n \n\t\t\t\tCHARLIE\n\t\t\t(beginning to laugh) \n\t\tOh, yeah.\n \n\t\t\t\tKENNETH\n\t\t\t(laughing) \n\t\tAnd Frankie opened up the hood and \n\t\tthe water cap blew right up in the \n\t\tair.\n \n\t\t\t\tCHARLIE\n\t\tAnd the cop came over ... \n \n\t\t\t\tKENNETH\n\t\tThat's right, the cop. He thought \n\t\tFrankie shot off a gun....\n \n\tThey are both laughing audibly now at the memory.\n \n\t\t\t\tKENNETH\n\t\tHe was going to pull us all in. Oh, \n\t\tman!\n \n\t\t\t\tCHARLIE\n\t\tFrankie, he was funny.\n \n\t\t\t\tKENNETH\n\t\tOh, that was a lot of fun, those \n\t\tdays.\n \n\t\t\t\tCHARLIE\n\t\tYeah, they were.\n \n\tThe little spasm of laughter is over. A sort of ruefulness \n\tsettles down on the two young husbands. Kenneth looks lazily \n\tdown the aisle to see how the Young Fellow is making out \n\twith The Girl. He seems to be making out all right. They are \n\tlooking steadily at each other now. Kenneth turns back to \n\tCharlie.\n \n\t\t\t\tKENNETH\n\t\tHey, this guy's making out all right. \n\t\tShe's giving him the eye now.\n\n\tCharlie leans forward to see this progress.\n \n\t\t\t\tKENNETH\n\t\t\t(looking out the \n\t\t\twindow at the passing \n\t\t\tlocal station) \n\t\tWhere are we now, Prince Street? I \n\t\tbet you he picks her up before we \n\t\thit Chambers Street.\n \n\tSomehow this has a sobering effect on the two young husbands. \n\tAgain they sit silently as the train buckets along.\n \n\t\t\t\tCHARLIE\n\t\tBoy, I'm bushed today. I was up till \n\t\ttwo o'clock last night on this thing \n\t\there. I'm getting to be a nervous \n\t\twreck. I snarled at Helen this \n\t\tmorning. I think this whole night \n\t\tschool business is getting me down. \n\n\t\t\t\tKENNETH\n\t\tI don't see how you do it.\n \n\t\t\t\tCHARLIE\n\t\tNeither do I. I thought I was \n\t\tthrough with it. The plan was for me \n\t\tto quit work and go to college full \n\t\ttime and cram through in a year or \n\t\tso. But now we got this kid coming, \n\t\tand Helen's going to have to quit \n\t\ther job, and that sets me back where \n\t\tI started from. Another five years \n\t\tof this, summers included.\n \n\t\t\t\tKENNETH\n\t\tI couldn't do it, man, I'll tell you \n\t\tthat. I wish I could, but I couldn't.\n \n\t\t\t\tCHARLIE\n\t\tOh, what am I griping about? This is \n\t\tthe life I picked out for myself. \n\t\tBut it's a grind, boy, I tell you. \n\n\tThey sit silently again. The train hurtles along and then \n\tsuddenly slows as it approaches a stop. There is a rustle of \n\tmovement among the passengers in the subway car. A few \n\tpeople start edging toward the doors. The Girl reading the \n\tnewspaper now folds her newspaper and stands almost directly \n\tin the Young Fellow's face. They regard each other.\n \n\t\t\t\tYOUNG FELLOW\n\t\t\t(to the girl)\n\t\tExcuse me, can you tell me how to \n\t\tget to the Nassau Street exit?\n \n\t\t\t\tGIRL\n\t\tWell ... well, at the top of the \n\t\tstairs, you'll see all the signs.\n \n\t\t\t\tYOUNG FELLOW\n\t\tAre you getting off here?\n \n\t\t\t\tGIRL\n\t\tYes.\n \n\t\t\t\tYOUNG FELLOW\n\t\tWell, I'll follow you then. That'll \n\t\tbe easier, if you don't mind.\n \n\t\t\t\tGIRL\n\t\tNo, not at all.\n \n\tThey start to crowd down the aisle. The train is chugging \n\tinto the Chambers Street station, and we can see the \n\tyellowed lights of the platform and the quick blur of faces. \n\tThe two young husbands, who had been following the byplay \n\tbetween The Girl and the Young Fellow, now watch them slowly \n\texit. There is an expression of poignant wistfulness on both \n\ttheir faces.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n\n\tEXTERIOR. THE OFFICE\n\tWe look down on the bookkeeping department of a life \n\tinsurance company in downtown Manhattan area around Pine \n\tStreet. It is a fairly large room, large enough to hold \n\televen desks. But you get the feeling that this is one of \n\tthe smaller offices on the floor. You get the feeling that \n\tthis company occupies three or four floors of this building. \n\tDespite the size of the office, it has a cluttered look. \n\tEach desk has piles of paper on it, and all the impedimenta \n\tof the bookkeeper -- the pens and pencils, the adding \n\tmachine, the telephone. Some of the desks have typewriters. \n\tAlong the walls there are rows of filing cabinets and wall \n\tbins stocked with large worksheets and thick ledgers. At \n\tthe far end of the room, there is a row of windows, but it \n\tis still necessary to keep the overhead fluorescent lights \n\ton all day. They are on now. There are two middle-aged \n\twomen standing, murmuring to each other, and a rather \n\theavy-set balding man in his late forties, sitting at a \n\tdesk in his shirt sleeves, already hard at work, although \n\tit is still ten minutes shy of eight-thirty.\n \n\tKenneth and Charlie enter. Ad lib hellos between them and \n\tthe two middle-aged women. Charlie moves to the coat rack to \n\thang up his jacket, drops off his books on his desk, starts \n\tfor the coat rack. Behind Charlie, we see Kenneth, carrying \n\this jacket, moving to his desk, up where the middle-aged man \n\tis working.\n \n\t\t\t\tKENNETH\n\t\tHiya, Walter.\n \n\t\t\t\tCHARLIE\n\t\tHiya, Walter.\n \n\tWalter, the middle-aged man, nods his good mornings.\n \n\t\t\t\tKENNETH\n\t\t\t(poking in his desk \n\t\t\tdrawer; amiably) \n\t\tWalter, what time do you come in in \n\t\tthe mornings? You're making us all \n\t\tlook lousy, you know that? I get \n\t\tthe feeling sometimes, you stay here \n\t\tovernight. \n\n\tWalter merely nods, doesn't bother to look up from the work. \n\tKenneth finds a stick of gum in his drawer, unwraps it. Two \n\tmore women, gray-haired and bespectacled, come into the \n\toffice. There is an ad lib mumble of hellos in background. \n\tCharlie hangs up his jacket on the coat rack.\n \n\t\t\t\tCHARLIE\n\t\tArnold in yet?\n \n\t\t\t\tWALTER\n\t\tHe starts his vacation today. He's \n\t\tgetting married Sunday, you know.\n \n\tCLOSEUP of Charlie looking out the window into the bright \n\tAugust morning. His face is just a little ruffled by a \n\tfrown, and there is a kind of pain in his eyes. Behind him, \n\tWalter and Kenneth.\n \n\t\t\t\tWALTER\n\t\t\t(a nervous, anxious man) \n\t\tWell, the doctor was over last night. \n\t\tBrought over the X rays; brought \n\t\tover the allergy tests. Brought over \n\t\ta bill for sixty-eight dollars.  I \n\t\tsaid to him: \"Doctor, you're a young \n\t\tman, professional, highly educated, \n\t\tfour years of college, two years of \n\t\tpremedical training, several years \n\t\tof interning, of residency. If \n\t\tyou're so smart, how can you charge \n\t\tme sixty-eight dollars? One thing \n\t\tthey apparently didn't teach you in \n\t\tmedical school. You can't get blood \n\t\tfrom a stone.\"\n \n\t\t\t\tKENNETH\n\t\tSo what's wrong with you, Walter?\n \n\t\t\t\tWALTER\n\t\tWhat's wrong? I have to go to \n\t\tArizona, that's what's wrong. I have \n\t\tasthma. When I was a kid, they \n\t\tcalled it hay fever, and you carried\n\t\ta bag around your neck. Asafetida. \n\t\tNow, they call it asthma, and you \n\t\thave to go to Arizona. I said to him: \n\t\t\"Doctor, you're a professional man, \n\t\tfour years of college, premedical \n\t\tschool, Bellevue, several diplomas. \n\t\tAnswer me a question. Who's going to \n\t\tpay for Arizona?\" I said to him: \n\t\t\"Doctor,\" I said, \"perhaps you have \n\t\tthe illusion I am the Aga Khan. I \n\t\thave a bearing about me, perhaps, \n\t\tthat misleads you to believe I have \n\t\tblood ties with the Whitneys and the \n\t\tRockefellers. This isn't true.\" \n\t\tArizona. Did you ever hear of such \n\t\tnonsense?\n \n\t\t\t\tKENNETH\n\t\tHow serious is it, Walter?\n \n\t\t\t\tWALTER\n\t\tSerious. Nothing serious. I have hay \n\t\tfever, I sneeze a couple of times. \n\t\tThe idiot told my wife I have to go \n\t\tto Arizona, and she wouldn't leave \n\t\tme alone all night. She's already \n\t\tpacking the bags. I said: \"For \n\t\theaven's sakes, you listen to \n\t\tdoctors, we'll all be dead.\" My son, \n\t\tHarold, believe me, he's going to be \n\t\ta doctor. That's some racket, boy. \n\t\tSixty-eight dollars.\n \n\tCLOSEUP of Charlie, still at the window, when a bell \n\tsuddenly clangs, indicating the start of the workday. The \n\tsudden jangle makes him start, and he closes his eyes \n\tbriefly against the noise.  Walter, in background, who had \n\trisen and was bent over Kenneth's desk, darts nervously back \n\tto his own desk.\n \n\t\t\t\tWALTER\n\t\tYou better get to work. Hey, Charlie, \n\t\tthat was the bell. I think Flaherty \n\t\tis here this morning. We'll all be \n\t\tfired today. I have a feeling.\n \n\tHe hunches over his ledgers again, his anxious, harried face \n\tdrawn into intense wrinkles of concentration. Several other \n\twomen have come into the office by now, and there is a \n\tgeneral movement to the desks. There is the click of a \n\ttypewriter, and Walter runs his fingers glibly over the \n\tadding machine on his desk. The day has started.\n \n\tAfter a moment, Charlie turns from the window and comes back \n\tto his desk, sinks down onto his chair.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n\n\tINTERIOR. THE OFFICE -- TWENTY MINUTES LATER\n\tWe look down on the bookkeeping department. All the desks \n\tare occupied but two. There are six women and our three men. \n\tThe office is silent with industry, everybody's head bent \n\tover his desk. There is the occasional punctuation of an \n\tadding machine or a typewriter or a phone ringing.\n \n\tOur three men are bent over their tally sheets, worksheets, \n\tand ledgers, occasionally reaching up to quickly tabulate \n\tsomething on the adding machine. After a moment, Walter says:\n \n\t\t\t\tWALTER\n\t\t\t(without looking \n\t\t\tup from his work) \n\t\tYou fellows going to Arnold's party \n\t\ttonight? \n \n\t\t\t\tKENNETH\n\t\t\t(without looking up) \n\t\tNo, I'm not going, are you?\n \n\t\t\t\tWALTER\n\t\tNo. Eddie already hooked me for four \n\t\tbucks for Arnold's present. This \n\t\tdinner is going to cost another \n\t\tcouple of good dollars.\n \n\t\t\t\tCHARLIE\n\t\tIt looks like nobody's going to \n\t\tArnold's bachelor party.\n \n\t\t\t\tWALTER\n\t\tYou ain't going?\n \n\t\t\t\tCHARLIE\n\t\tNo, I'm not going. \n\n\t\t\t\tWALTER\n\t\tEddie's going to be mad. \n\n\t\t\t\tCHARLIE\n\t\tI told Eddie last week I couldn't \n\t\tmake it. I've got school. Eddie's a \n\t\tbachelor. It's all right for him to \n\t\tgo rooting around town, picking up \n\t\tgirls.\n \n\t\t\t\tWALTER\n\t\tYeah, you get married you give that \n\t\tkind of thing up.\n \n\t\t\t\tKENNETH\n\t\tYeah, Charlie says Eddie has a whole \n\t\tbunch of chorus girls lined up for \n\t\tus tonight.\n \n\tWalter's head comes up for the first time.\n \n\t\t\t\tWALTER\n\t\tNo kidding. \n\n\t\t\t\tCHARLIE\n\t\tI didn't say that. I just said that \n\t\tif I knew Eddie, we'd probably wind \n\t\tup with some of his crazy girl \n\t\tfriends. \n\n\tWalter looks back down to his work again. \n \n\t\t\t\tKENNETH\n\t\tI don't know where he gets all these \n\t\tgirls. He's a screwy looking jerk.\n \n\t\t\t\tWALTER\n\t\tDid you see that blonde who was up \n\t\there looking for him last week?\n\n\t\t\t\tKENNETH\n\t\tYeah. He told me she was a \n\t\ttelevision actress. I think I saw \n\t\ther once on \"Studio One.\" She was in \n\t\ta coal mine with some stir-crazy \n\t\tcoalminer who was trying to strangle \n\t\ther with a necktie.\n \n\t\t\t\tWALTER\n\t\tI'd like to strangle her with a \n\t\tnecktie.\n \n\t\t\t\tKENNETH\n\t\tNow, Walter, an old married man like \n\t\tyou, with asthma and everything.\n \n\tWalter looks up suddenly from his work, a strange sting of \n\tpain crossing his face.\n \n\t\t\t\tWALTER\n\t\tI get real jealous of Eddie \n\t\tsometimes. He's as free as a bird. \n\t\tDid you see that convertible he's \n\t\tgot?\n \n\t\t\t\tKENNETH\n\t\tYeah, he really banged it up I hear.\n \n\t\t\t\tWALTER\n\t\tYou ought to see the old heap I've \n\t\tgot. He walks out of here on payday, \n\t\the can spend the whole works on \n\t\thaving himself a good time. I walk \n\t\tout of here, and I got three kids \n\t\tand a wife, all of them with their \n\t\tpalms out. I lost two bucks playing \n\t\tpoker at my house last week. It was \n\t\tan economic catastrophe. My wife \n\t\tdidn't sleep all night.\n\n\t\t\t\tCHARLIE\n\t\tHe's late again.\n \n\t\t\t\tWALTER\n\t\tHe'll be twenty minutes late again. \n\t\tIf Flaherty walked in now, he'd fire \n\t\thim. If that ever happened to me, I \n\t\tthink I'd kill myself. What does \n\t\tEddie care? So he scrambles around \n\t\tfor another job. Flaherty told me \n\t\tlast week I had too many days off. \n\t\tI told him I was sick in bed. What \n\t\tdo you want me to do?\n \n\tHe turns back again to his work, his face creased with \n\tanxiety. The three men work silently for a moment. Then the \n\toffice door opens, and a man of about thirty-five, a little \n\tstout, but rather casual in his dress, wearing steel-rimmed \n\tglasses, enters. This is Eddie Watkins, the office bachelor. \n\tHe seems to have had very little sleep the night before. His \n\teyes, behind the wire-rimmed glasses, are heavy-lidded. A \n\tcigarette dangles listlessly, from his mouth. There is \n\tsomething of the bacchanalian libertine about Eddie. There \n\tis a perfunctory exchange of hellos and good mornings, \n\testablishing that this is Eddie. He shuffles with ineffable \n\tweariness to his desk.\n \n\t\t\t\tWALTER\n\t\tHi, Eddie, you're early today, only \n\t\ttwenty minutes late, what happened?\n \n\t\t\t\tEDDIE\n\t\t\t(muttering through \n\t\t\treluctant lips) \n\t\tFlaherty come in yet?\n \n\t\t\t\tKENNETH\n\t\tNo.\n \n\tEddie sits down at his desk, pulls his cigarette \n\tautomatically for a moment. Then he reaches over to a pile \n\tof telephone directories on the floor beside his desk, pulls \n\tup the Manhattan one, flips through the pages, finding the \n\tnumber he wants. He picks up the phone. \n \n\t\t\t\tEDDIE\n\t\tMary, give me an outside line....\n\t\t\t(he pauses, checks \n\t\t\tthe number in the \n\t\t\tphone book again, \n\t\t\tdials, waits) \n\t\tHello, is this Leathercraft on \n\t\tMadison Avenue? ... This is Mr. \n\t\tWatkins. I was in about a week ago. \n\t\tI ordered a military set and a \n\t\twallet. They were supposed to be \n\t\tready yesterday.... Yes, please, \n\t\twould you? ... \n\t\t\t(he is searching \n\t\t\this pockets while \n\t\t\the waits, finds a \n\t\t\tpiece of paper, \n\t\t\tpulls it out) \n\t\tYeah, a military set and a wallet....\n \n\t\t\t\tWALTER\n\t\tIs that what we bought poor Arnold?\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tThat's right. The following \n\t\tinscriptions should be on them:\n\t\t\t(reads from the paper) \n\t\tOn the military set: \"To Arnold: \n\t\tBest wishes on your marriage from \n\t\tAlice, Charlie, Eddie, Evelyn, \n\t\tJeanette with two t's, Kenneth, \n\t\tLucy, Mary, Olga, Walter, and \n\t\tFlaherty.\" Now on the wallet ... \n\t\tYeah, what? .... Yeah, that's right \n\t\t-- Flaherty. Now, on the wallet, \n\t\tthe following inscription: \"To my \n\t\tBest Friend Arnold from his Best Man \n\t\tEddie.\" ... No, to my best friend \n\t\tArnold. ... That's right. \"From his \n\t\tbest man Eddie\" ... Now, can I come \n\t\tin at lunch and pick them up? ... \n\n\tA young woman comes into the office, goes to Walter's desk \n\tand drops some papers before him.\n \n\t\t\t\tWALTER\n\t\tWhat's this, Jeanette?\n \n\t\t\t\tGIRL\n\t\tIt's from finance, don't ask me.\n \n\tThis is the girl in the office who goes to the water cooler \n\tthree times a morning and all the men covertly watch her. \n\tShe is cute, but attractive more by comparison to the other \n\twomen in the office. Nevertheless, all the men, including \n\tEddie and Charlie, let their eyes cautiously watch her as \n\tshe leaves, her sheath dress tight on her hips.\n \n\tEddie, who has hung up, now rubs his eyes with two fingers to \n\tclear his head and picks up the phone again.\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tMary, give me the Hotel Westmore. \n\t\tCircle 7-0598.\n \n\t\t\t\tCHARLIE\n\t\t\t(hands Kennie paper) \n\t\tThis isn't for me -- it's for you.\n \n\t\t\t\tEDDIE\n\t\t\t(to the others) \n\t\tNow who owes me on the presents? \n\t\tCharlie, you owe me?\n \n\t\t\t\tCHARLIE\n\t\tI gave you four bucks yesterday....\n \n\t\t\t\tKENNETH\n\t\tI owe you, Eddie. I'll pay you \n\t\ttomorrow, payday.\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tMiss Frances Kelley, please. I \n\t\tthink it's room 417.... \n\n\tThe three heads around him look slowly up from their \n\trespective work, naked interest manifest on their faces.\n \n\t\t\t\tEDDIE\n\t\t\t(calling to one \n\t\t\tof the women in \n\t\t\tthe office) \n\t\tHey, Evelyn, you owe me four bucks. \n\n\t\t\t\tEVELYN\n\t\t\t(calling back) \n\t\tAll right. I know.\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tHello, Frances, this is Eddie.... \n\t\tAll right, wait a minute. Give me a \n\t\tchance to explain.... I know I woke \n\t\tyou up.... All right, let me tell \n\t\tyou. You know I'm supposed to be the \n\t\tbest man at this fellow Arnold's \n\t\twedding. So I called him up last \n\t\tnight because I didn't know whether \n\t\tI was supposed to wear tuxedo or \n\t\ttails. Well, he didn't know either, \n\t\tso he said: \"Come on over to my \n\t\tgirl's house with me tonight. \n\t\tThey're making all the arrangements \n\t\tfor the wedding now.\" So I called \n\t\tyou and left a message at the desk \n\t\tsaying I couldn't get over till \n\t\tabout ten o'clock.... All right! \n\t\tThat's what I'm going to explain! \n\t\t... Thank you.\n\t\t\t(holds receiver \n\t\t\tagainst his chest \n\t\t\tand looks at his \n\t\t\tcolleagues with \n\t\t\tair of a man being \n\t\t\ttried just a little \n\t\t\ttoo much. Returns \n\t\t\treceiver to his ear, \n\t\t\tlistens for a moment) \n\t\tAll right, so I had to go over to \n\t\tArnold's girl's house with Arnold \n\t\tlast night. Well, there was about \n\t\tthirty people there, and, man, you \n\t\tnever saw such a crazy mess. There \n\t\twas this little bald-headed guy \n\t\tthere. He's the bride's uncle. He's \n\t\tcome all the way down from Boston \n\t\twith his whole family to go to the \n\t\twedding. The only trouble was, he \n\t\twasn't invited. Well, this crazy \n\t\tuncle, he grabs ahold of me, he \n\t\tstarts shaking me by the lapels. So \n\t\tI said: \"What do you want from me? \n\t\tI ain't the groom! I'm just trying \n\t\tto find out whether I'm supposed to \n\t\twear tuxedo or tails.\" \n\t\t\t(apparently this got \n\t\t\ta laugh. Eddie breaks \n\t\t\tinto a smile) \n\t\tFunny, huh? ... Look, Frances. I \n\t\thave to go to work now. I'm calling \n\t\tyou from the office. How about \n\t\tletting me make this up to you? I'll \n\t\ttake you out to dinner Saturday \n\t\tnight.... I can't make it tonight. \n\t\tThe bachelor party's tonight.... \n\t\tAll right, Saturday night.... It's a \n\t\tdate.... S'help me.... I swear, right \n\t\ton time. Eight-thirty, okay? ... \n\t\tOkay, we'll have a ball. Goodbye, go \n\t\tback to sleep.\n \n\tHe hangs up. The three married men look down again to their \n\tledgers and tap away again on their adding machines. Eddie \n\tsits slumped in his seat for a moment.\n \n\t\t\t\tEDDIE\n\t\tWhat did I just tell that girl, \n\t\tSaturday night?\n \n\t\t\t\tKENNETH\n\t\tYeah.\n \n\t\t\t\tEDDIE\n\t\t\t(picks up phone)\n\t\tMary, give me Columbus 5-1098.... \n\t\tWhat do you mean personal calls! \n\t\tThese are business calls! Well, stop \n\t\tlistening to other people's \n\t\tconversations.... What have you got, \n\t\tstock in the company? Columbus \n\t\t5-1098. \n\t\t\t(waits)\n \n\t\t\t\tKENNETH\n\t\tListen, Eddie, I don't think I can \n\t\tgo tonight. My father-in-law's in \n\t\tfrom Akron, Ohio, and----\n \n\t\t\t\tEDDIE\n\t\t\t(all sweetness) \n\t\tHello, who is this, Mrs. Stebbins? \n\t\t... This is Eddie, Mrs. Stebbins. I \n\t\twonder if I can talk to Muriel.... \n\t\tCould I speak to her? ... Thank \n\t\tyou.... \n\n\tThe three married men each look up slowly again, naked envy \n\ton each face.\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tMuriel, baby, listen, sweetie, I \n\t\tcan't make it Saturday night.... I'm \n\t\tall loused up with this wedding I'm \n\t\tsupposed to be the best man at.... \n\t\tWe have to rehearse the ceremony. \n\t\tYou'd think they were getting \n\t\tmarried on television.... Yes, \n\t\tsweetie, why don't I call you Monday. \n\t\tMaybe, we'll work out something \n\t\tbefore you go back to California.... \n\t\tAll right, sweetie, good-bye.\n\n\tHe hangs up, sits a moment, then finally removes the \n\tcigarette from his mouth, crushes it in his ash tray, and \n\tturns to the others.\n \n\t\t\t\tEDDIE\n\t\tWell, what do you say? I'm going to \n\t\tcall Louie and make a reservation \n\t\tfor a table for tonight. Who's \n\t\tcoming and who isn't? Walter, you're \n\t\tcoming, right? It won't cost you \n\t\tmore than three-fifty for the whole \n\t\tmeal. What do you say, Walter? You \n\t\tonly live once.\n \n\t\t\t\tWALTER\n\t\t\t(strangely sad) \n\t\tThat's right. You only live once.\n \n\t\t\t\tEDDIE\n\t\tWell, yes or no?\n \n\t\t\t\tWALTER\n\t\tAll right, I'll come.\n \n\t\t\t\tEDDIE\n\t\tKennie?\n \n\t\t\t\tKENNETH\n\t\tYeah, I'll get out of the house for \n\t\ta change.\n \n\t\t\t\tEDDIE\n\t\tHow about you, Charlie?\n \n\tCharlie is frowning down at a sheaf of adding machine totals \n\tin front of him.\n \n\t\t\t\tCHARLIE\n\t\tI don't think so, Eddie.\n \n\t\t\t\tKENNETH\n\t\tAh, come on, Charlie, you got to \n\t\tbust loose every now and then. We'll \n\t\thave a couple of drinks.\n \n\t\t\t\tEDDIE\n\t\t\t(picks up phone) \n\t\tMary, give me an outside line and \n\t\tdon't give me no trouble.... \n\t\tChickering 4-5099. \n \n\t\t\t\tWALTER\n\t\tCome on, Charlie, it's a short life, \n\t\tbelieve me. \n\n\tMove in for CLOSEUP of Charlie, frowning. Over this, Eddie's \n\tvoice.\n \n\t\t\t\tEDDIE'S VOICE\n\t\tHello, hello, Louie? Is this Louie? \n\t\t... Louie, this is Eddie Watkins. \n\t\tI'd like to reserve a table for \n\t\tfour for tonight.... For four ...\n\n\t\t\t\tCHARLIE\n\t\tHey, Eddie ...\n \n\t\t\t\tEDDIE'S VOICE\n\t\tWhat?\n \n\t\t\t\tCHARLIE\n\t\tCount me in.\n \n\tHe immediately bends back to his work, takes his pencil up \n\tagain. CAMERA PULLS QUICKLY UP AND AWAY until we have an \n\tANGLE SHOT looking down at their desks in various positions \n\tof work.\n \n\t\t\t\tEDDIE\n\t\t\t(on phone) \n\t\tLouie, make that five.... Five guys \n\t\t... Yeah, a bachelor party ...\n \n\t\t\t\t\t\tFADE OUT\n\n \n\tFADE IN \n\n\tEXTERIOR. DOWNTOWN NEW YORK CITY -- NIGHT\n \n\tFADE IN with a big loud blare on Eighth Street in Greenwich \n\tVillage on a warm August night. Packed sidewalks, jammed \n\ttraffic, taxis, trucks, buses, honking of horns, etc. \n\tMan-we're-going-to-have-a-ball type feeling.\n\n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. STREET -- NIGHT\n\tThirteenth Street off Sixth Avenue not so blary and lit up \n\tas the main drags, but traffic is heavy, and there are lots \n\tof people on the sidewalks. There are a number of restaurants \n\tdotting the street with their little striped awnings and \n\tmodest neons. If we are on our toes, we notice one neon that \n\treads: \"LOUIE'S.\"\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. LOUIE'S RESTAURANT\n\tThe entire interior isn't too much to show, really. It's a \n\tsmall restaurant, but it is packed. Waiters scurry here and \n\tthere. People jammer and jab. Hustle and bustle. In \n\tbackground, we can pick out our bachelor party, five men now, \n\tclustered around a table, yakking it up.\n \n\tWIDE SHOT of our bachelor party, showing all five. They all \n\tseem to be in the best of spirits. The new member of the cast \n\tis Arnold, the groom, a towheaded, pleasant-looking young man \n\tof thirty, shy to the point of being noticeable. Of all the \n\tmen at the party, he is the quietest. He sits, a smile nailed \n\tonto his face, turning his head from one friend to another as \n\tthey talk, enjoying the rare privilege of being liked. The \n\tdinner is over. During the ensuing scene, a bus boy continues \n\tto remove the used dishes. Several large bottles of beer and \n\ttwo fifths of Scotch are on the table. There is a welter of \n\tvariously assorted glasses. Eddie, Walter, and Kenneth are \n\tsmoking cigars, Charlie a cigarette. The Groom is not \n\tsmoking.  We have cut into the scene during a jumble of \n\tconversation. Walter is talking to Charlie, whose head is \n\tbent toward the older man. Kenneth is trying to tell the \n\tGroom a joke, but the Groom's attention is being distracted\n\tby Eddie, who is leaning across the table trying to get \n\tCharlie's attention. Ad libs.\n \n\t\t\t\tKENNETH\n\t\t\t(finishing story) \n\t\tThree hundred pounds! Isn't she kind \n\t\tof fat? No, man, tall! Hey, waiter! \n\t\tWaiter!\n \n\t\t\t\tEDDIE\n\t\tHey, Charlie ...\n \n\t\t\t\tWALTER\n\t\t\t(to Charlie) \n\t\t... so we were stationed right \n\t\toutside Paris, about eight miles, a \n\t\ttown called Chatou ...\n \n\t\t\t\tEDDIE\n\t\t... hey, Charlie ...\n \n\t\t\t\tWALTER\n\t\t\t(to Charlie) \n\t\t... so the first night, a whole \n\t\tbunch of us swiped a jeep out of the \n\t\tmotor court. We had a feller there \n\t\twho was a tech sergeant in the motor \n\t\tcourt. Oh, what a character he was! \n\t\tHe used to get loaded every night on \n\t\tthat vanilla extract.\n \n\t\t\t\tEDDIE\n\t\tHey, Charlie ...\n \n\t\t\t\tCHARLIE\n\t\tWhat do you want, Eddie?\n \n\t\t\t\tEDDIE\n\t\tHey, Charlie, did I ever tell you \n\t\tabout the time I was stationed at \n\t\tBuckley Field in Denver, and I \n\t\tpicked up this girl in Lakeside \n\t\tAmusement Park?\n \n\t\t\t\tWALTER\n\t\tHey, Eddie, listen to this story \n\t\tI'm telling Charlie. Hey, Arnold, \n\t\tI'm telling Charlie about the time \n\t\tme and that crazy tech sergeant \n\t\tfrom the motor court got loaded on \n\t\tvanilla extract and went to Paris \n\t\t... Hey, Kenneth ...\n \n\t\t\t\tKENNETH\n\t\tWhen do the Giants come back from \n\t\ttheir road trip, does anybody know?\n \n\t\t\t\tEDDIE\n\t\tHey, let's give out the presents now.\n \n\t\t\t\tWALTER\n\t\tHey, Kenneth, listen to this story. \n\t\tI was stationed outside of Paris, \n\t\tabout eight miles ...\n \n\t\t\t\tCHARLIE\n\t\tWhat?\n \n\t\t\t\tKENNETH\n\t\tOh, that Paris! I was there for two \n\t\tdays! Clubs! You had to beat the \n\t\twomen off with clubs! ...\n \n\t\t\t\tCHARLIE\n\t\t\t(to people at \n\t\t\tanother table) \n\t\tWhat ...? Oh, it's a bachelor party \n\t\t-- this guy's getting married.\n \n\t\t\t\tEDDIE\n\t\tListen, I want to give the \n\t\tpresents ...\n \n\t\t\t\tWALTER\n\t\tWell, let me tell you what \n\t\thappened ...\n \n\t\t\t\tEDDIE\n\t\tHey, you know what was a great town \n\t\tfor women, Hamburg!\n \n\t\t\t\tKENNETH\n\t\tHamburg! Clubs! Clubs! You had to \n\t\tbeat them off with clubs! Hey, \n\t\twaiter -- who's our waiter?  \n \n\t\t\t\tCHARLIE\n\t\tHey, Arnold, enjoying yourself?\n \n\t\t\t\tEDDIE\n\t\tThe first night I was in Hamburg, \n\t\ttwo Frauleins come walking right in \n\t\tthe barracks. So I said to the \n\t\tlieutenant ...\n \n\tWalter, who is pretty lit, suddenly stands and bangs the \n\ttable mightily with his fist.\n \n\t\t\t\tWALTER\n\t\t\t(bellowing out) \n\t\tThe best fighting outfit in the \n\t\twhole fighting army was the fighting \n\t\tHundred and Fourth Infantry Division, \n\t\tGeneral Terry Allen commanding!\n \n\tThis brings the jumbled conversation to a halt. Walter \n\tsurveys the other four, looking for possible challenges, \n\tthen sits heavily down.\n \n\t\t\t\tEDDIE\n\t\t\t(standing) \n\t\tWell, now that we got that settled....\n \n\t\t\t\tCHARLIE\n\t\tI'm with you, Walter.\n \n\t\t\t\tARNOLD\n\t\tWe believe you, Walter.\n \n\t\t\t\tEDDIE\n\t\tI'd like to make a little speech to \n\t\tour guest of honor and mutual friend, \n\t\tArnold Craig. Arnold, a bunch of us \n\t\tdown the office, the girls too, all \n\t\tchipped in, and we got you a couple \n\t\tof small gifts....\n \n\tEddie crosses to extra chair, picks up wrapped gifts, crosses \n\tback to his place.\n \n\t\t\t\tWALTER\n\t\t\t(whispering to Kenneth) \n\t\tThese are the gag gifts. \n \n\t\t\t\tEDDIE\n\t\tLet's see, what's this one? Oh, yeah. \n\t\tArnold, we figured Louise might be \n\t\tvery sleepy on your wedding night, \n\t\tso we thought you might want \n\t\tsomething to keep you warm.\n \n\tWalter leans forward to see what the tissue-wrapped parcel \n\tArnold is now unwrapping is.\n \n\t\t\t\tWALTER\n\t\tWhat is it? What is it?\n \n\tArnold holds a hot-water bottle aloft. Walter is seized with \n\ta paroxysm of laughter at this immensely Rabelaisian gift.\n \n\t\t\t\tWALTER\n\t\tIt's a hot-water bottle!\n \n\t\t\t\tKENNETH\n\t\tOkay, Walter, okay.\n \n\t\t\t\tWALTER\n\t\tHey, did you see that? Hey, he bought \n\t\thim a hot-water bottle for his \n\t\twedding night. Hey, that's funny ...\n \n\t\t\t\tCHARLIE\n\t\tHey, Eddie, you should have bought \n\t\thim an ice pack for after tonight.\n \n\t\t\t\tEDDIE\n\t\t\t(holding a \n\t\t\tsecond parcel)\n\t\tWalter, take it easy.... Now, this \n\t\tone, Arnold, this one is something \n\t\tto keep you busy on cold winter \n\t\tnights.\n \n\t\t\t\tWALTER\n\t\t\t(crosses to Arnold; \n\t\t\tto the others) \n\t\tThis ought to be good.\n \n\t\t\t\tEDDIE\n\t\tLook at Walter.\n \n\tWalter has come around behind Arnold's chair and can hardly \n\twait to see what the next joke is.\n\n\t\t\t\tWALTER\n\t\tHey, these are funny. Who bought \n\t\tthese? You buy these, Eddie? These \n\t\tare funny. You got a good sense of \n\t\thumor.\n \n\tArnold unwraps the parcel, holds out a miniature baby bottle. \n\tThis is too much for Walter; how funny can you get? He \n\tclutches his sides.\n \n\t\t\t\tWALTER\n\t\tHey, did you guys see that? Hey, did \n\t\tyou guys see that?\n \n\t\t\t\tCHARLIE\n\t\tCome on, Walter, sit down.\n \n\tCharlie and Kenneth are smiling appreciatively. Walter \n\tcrosses with bottle, sits, starts pouring whisky into baby \n\tbottle.\n \n\t\t\t\tWALTER\n\t\tEddie got a good sense of humor, you \n\t\tknow?\n \n\t\t\t\tKENNETH\n\t\t\t(to Charlie) \n\t\tBoy, old Walter is crocked.\n \n\t\t\t\tARNOLD\n\t\t\t(smiling, rising \n\t\t\thalfway in his chair) \n\t\tListen, I want to thank you. Really. \n\t\tI really want to thank you fellows.\n \n\t\t\t\tEDDIE\n\t\tWe haven't got to the serious \n\t\tpresents yet, Arnold. \n\n\tA hush falls over the assembled guests. Arnold composes his \n\tface into a solemn expression and looks down at the \n\tcluttered table.\n \n\t\t\t\tEDDIE\n\t\t\t(solemnly) \n\t\tWell, in all seriousness, Arnold, \n\t\tseriously, I don't know why you \n\t\tpicked me to be your best man, but I \n\t\tam deeply honored. I guess it's \n\t\tbecause we're both Dodger fans, and \n\t\tI'm going to miss you at next \n\t\tTuesday's night game when the \n\t\tPittsburgh Pirates invade Ebbets \n\t\tField. We always had a lot of fun \n\t\ttogether, and, seriously, Arnold, \n\t\tin all seriousness, good luck on \n\t\tyour wedding, but see if you can't \n\t\tget out of the house occasionally, \n\t\tsee a night game or even a Sunday \n\t\tdoubleheader with your old buddy, \n\t\tEddie.\n \n\tThis touching address has brought a note of sadness to the \n\tgathering. Indeed, there are tears in Walter's and Arnold's \n\teyes.\n \n\t\t\t\tEDDIE\n\t\t\t(handing Arnold \n\t\t\ttwo neatly wrapped \n\t\t\tpackages) \n\t\tWell, anyway, in all seriousness, \n\t\there are a couple of presents from \n\t\tall of us in the office and good \n\t\tluck. \n\n\tArnold takes the presents, stands, head bowed. Eddie sits \n\tand all faces turn to Arnold.\n \n\t\t\t\tARNOLD\n\t\tWell, I just want to thank you \n\t\tfellows. I don't know what to say. \n\t\tI just want to thank you.\n \n\t\t\t\tKENNETH\n\t\tOpen the presents, Arnold.\n \n\t\t\t\tARNOLD\n\t\tI will. I just want to say, Eddie, \n\t\tthat when the Pirates invade Ebbets \n\t\tField next Tuesday night, I'm going \n\t\tto be sitting right there in Section \n\t\t37 there right with you.\n \n\t\t\t\tEDDIE\n\t\tYou'll be on your honeymoon next \n\t\tTuesday, Arnold. \n\n\tThis interesting information gives Arnold pause.\n \n\t\t\t\tARNOLD\n\t\tGee, that's right. \n\n\t\t\t\tCHARLIE\n\t\t\t(smiling) \n\t\tArnold, you're getting married \n\t\tSunday, did you forget?\n \n\t\t\t\tWALTER\n\t\tLook at him blush.\n \n\t\t\t\tARNOLD\n\t\t\t(frowning fuzzily) \n\t\tNo, I didn't forget. It's just that \n\t\t... Gee, that's right. Sunday. \n\t\tWhat's today, Thursday? \n\n\t\t\t\tKENNETH and EDDIE \n\t\tAll day!\n \n\t\t\t\tARNOLD\n\t\tBoy, it's here, isn't it? I guess \n\t\tI've been running around so much the \n\t\tlast couple of weeks, I guess the \n\t\twedding snuck up on me.\n \n\t\t\t\tKENNETH\n\t\tI think Arnold's having a little \n\t\tbuck fever. Does anyone know what \n\t\tour waiter looks like?\n \n\t\t\t\tEDDIE\n\t\t\t(to Kenneth) \n\t\tYou know who didn't want to chip in \n\t\tfor Arnold's presents? ... \n\n\t\t\t\tCHARLIE\n\t\tArnold'll be all right. Have a drink, \n\t\tArnold.\n \n\t\t\t\tWALTER\n\t\tI had my basic training in Camp Croft, \n\t\tSouth Carolina, near Spartanburg.\n \n\t\t\t\tEDDIE\n\t\tI was at Maxwell Field, what a \n\t\tdesert.\n \n\t\t\t\tCHARLIE\n\t\tWalter, what ever happened when you \n\t\tand that tech sergeant from the\n\t\tmotor pool got loaded on vanilla \n\t\textract?\n \n\t\t\t\tWALTER\n\t\tWhat tech sergeant?\n \n\t\t\t\tCHARLIE\n\t\tWalter, you're crocked. \n\t\t\t(to Arnold) \n\t\tOpen up the presents -- see what you \n\t\tgot.\n \n\t\t\t\tKENNETH\n\t\tHey, are you our waiter? Bring us \n\t\tsome ice. I got him -- I got our \n\t\twaiter!\n \n\t\t\t\tARNOLD\n\t\tIt was sure nice of you fellows.\n \n\tThe voices have risen again into the jumbled high spirits \n\tthat opened the scene.\n \n\t\t\t\tEDDIE\n\t\tHey, man, we're having a ball!\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. EIGHTH STREET -- NIGHT\n\tWe look down on Eighth Street in Greenwich Village. It is \n\teight thirty at night. It is a fairly active and well-lit \n\tstreet, bright with neons and movie marquees and lit-up \n\tshops. Our five carousers are marching down the sidewalk, \n\tthat is four of them are on the sidewalk. Walter can't quite \n\tdecide whether he wants to walk on the sidewalk or in the \n\tstreet. He keeps hopping in and out between the parked cars, \n\trunning to catch up when he falls behind. They are all \n\tfeeling pretty good. Arnold is singing in a wavering \n\tbaritone:\n \n\t\t\t\tARNOLD\n\t\tDe-Witt C-l-i-n-t-o-n\n\t\tBoom! \n\t\tClinton!\n\t\tOh, Cli-inton! \n\t\tEver to theeeee!\n \n\tCLOSER SHOT of the five carousers.\n\n\t\t\t\tARNOLD\n\t\t\t(singing) \n\t\tFairest of high schools ...\n \n\t\t\t\tEDDIE\n\t\tHow did he ever get on this alma \n\t\tmater kick?\n \n\t\t\t\tARNOLD\n\t\t\t(singing) \n\t\t... Give her three times three \n\t\tOh, fellows ...\n\t\tRah! Rah! Rah!\n \n\tANOTHER SHOT of the five carousers, Walter whistling at two \n\tpassing girls.\n \n\t\t\t\tARNOLD\n\t\tLong may we cherish thee \n\t\tFaithful we'll be. \n\t\tClinton, oh, Clinton \n\t\tFor you and me ... \n\t\tDa-da-da-da-da ...\n\t\tCrash through that line of blue \n\t\tAnd send the backs around the end.\n \n\t\t\t\tEDDIE\n\t\tThere he goes with those fullbacks \n\t\tagain.\n \n\t\t\t\tARNOLD\n\t\tRah! Rah! Rah!\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. GREENWICH AVENUE AND TENTH STREET -- NIGHT\n \n\tGROUP SHOT of our five carousers paused on the curb, waiting \n\tfor the lights to change in their favor. Greenwich Avenue \n\ttraffic is pretty heavy, going in both directions. The five \n\tmen are kind of strung out along the curb with Charlie being \n\tthe last in line. Standing beside him, also waiting for the \n\tlight to change, is a good-looking, well-dressed, chic young \n\twoman of twenty-four or five.\n \n\t\t\t\tKENNETH\n\t\tWhere we going? Eddie's place to \n\t\tsee movies?\n \n\t\t\t\tARNOLD\n\t\tWhat movies?\n \n\t\t\t\tEDDIE\n\t\tBoy, just wait till you see these \n\t\tmovies! Hey, Charlie, hey Charlie ...\n \n\t\t\t\tCHARLIE\n\t\tWhat?\n \n\t\t\t\tEDDIE\n\t\t\t(indicating the \n\t\t\tyoung woman) \n\t\tWho's your beautiful friend, Charlie?\n \n\tCharlie turns and regards the pretty young woman.\n \n\t\t\t\tCHARLIE\n\t\t\t(to the girl) \n\t\tExcuse me. My friend down there \n\t\twants to know who you are.\n \n\tThe young woman, who for our own mysterious purposes we shall \n\trefer to as The Existentialist, regards the five reasonably \n\ttight young men all staring at her. Kenneth has already begun \n\tto giggle.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\t\t(with a Mona Lisa smile) \n\t\tWhere are you all from, out-of-town?\n \n\t\t\t\tCHARLIE\n\t\tIndiana.\n\t\t\t(turning to \n\t\t\tthe others) \n\t\tIsn't that right, fellers? We're \n\t\tfrom Indiana, right?\n \n\t\t\t\tEDDIE\n\t\tIndiana! Indiana, man!\n\n\tKenneth and Arnold, to whom this incident is already \n\tunbearably funny, have turned away and are clutching their \n\tsides, trying to suppress a fit of giggles.\n \n\t\t\t\tCHARLIE\n\t\t\t(to The Existentialist) \n\t\tWe're from the Hoosier State, ma'am...\n \n\t\t\t\tWALTER\n\t\tTerre Haute! We're from Terre Haute!\n \n\t\t\t\tCHARLIE\n\t\t\t(to The Existentialist) \n\t\tWe're from Terre Haute, and we've \n\t\tcome to the big city looking for a \n\t\tgood time, and we just don't know \n\t\twhat to do with ourselves, ma'am.\n \n\t\t\t\tEDDIE\n\t\t\t(to Walter) \n\t\tLook at that Charlie operate.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tMust be a convention in town.\n \n\t\t\t\tCHARLIE\n\t\tWe've just come off the ranch there, \n\t\thoney, and we're just raring. Is \n\t\tthat right, men? Are we raring?\n \n\t\t\t\tEDDIE\n\t\tWe're raring, boy, we're raring!\n \n\t\t\t\tKENNETH\n\t\t\t(beside himself \n\t\t\twith laughter) \n\t\tHey, Charlie, cut it out, will you?\n \n\tThe lights change and The Existentialist starts off across \n\tGreenwich Avenue to the west side of the street. The five \n\tcarousers follow right along after her.  That is, Charlie \n\tdogs along behind The Existentialist as they cross the \n\tstreet. Walter and Eddie are close behind him, listening to \n\tCharlie's pitch. Kenneth and Arnold, embarrassed and \n\tgiggling, stagger along behind. \n \n\t\t\t\tCHARLIE\n\t\t\t(chugging along behind \n\t\t\tThe Existentialist) \n\t\tWe're down here in Greenwich Village \n\t\tlooking for some wild bohemians. Do \n\t\tyou happen to know any wild \n\t\tbohemians?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tAll right, fellows, enough's enough, \n\t\thuh?\n \n\tShe steps up to the sidewalk on the west side of Greenwich \n\tAvenue and hurries along down Tenth Street to a little house \n\tabout four doors down, the five carousers on her heels like \n\ta pack of puppies.\n \n\t\t\t\tCHARLIE\n\t\t\t(hurrying along after \n\t\t\tThe Existentialist) \n\t\tI'm something of a poet myself, \n\t\tma'am. Many's the long night in the\n\t\tbunkhouse where I sat by myself and \n\t\twrote by the flickering light of a \n\t\tkerosene lamp. Could I read you some \n\t\tof my poems, ma'am? I know they \n\t\tain't much, but they're from the \n\t\theart, ma'am. \n\n\tThe Existentialist pauses in her hurried walk down Tenth \n\tStreet to examine Charlie with some interest.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tYou have a sense of humor, don't you?\n \n\t\t\t\tEDDIE\n\t\t\t(to Charlie) \n\t\tYou're going great, man, don't stop \n\t\tnow. \n\n\tThe Existentialist goes up the two little steps to the front \n\tdoor of the house and rings the bell.\n \n\t\t\t\tEDDIE\n\t\t\t(to The Existentialist) \n\t\tWhere are you going, honey? \n\n\tThe Existentialist waits composed and patient for someone to \n\tanswer her ring. Charlie has wandered back to Arnold and \n\tKenneth, and the three of them are now suffused with \n\tlaughter. Kenneth has been laughing so much, tears are \n\tcoming out of his eyes. He walks around in little circles \n\tclutching his sides. Several passersby hurry by, noting the \n\tstrange little group on the sidewalk.\n \n\t\t\t\tEDDIE\n\t\t\t(to The Existentialist) \n\t\tWhat's going on in there, honey?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\t \t(patiently bored)\n \t\tThere's a party going on. I'm not sure \n\t\tI'm invited myself, so I can't really \n\t\tinvite you.\n \n\t\t\t\tEDDIE\n\t\tSure you can.\n \n\tThe door opens and a woman in a tea gown stands there \n\tlooking at The Existentialist and then at the five men on \n\tthe sidewalk. Behind her, there is evidence of a party going \n\ton.\n \n\t\t\t\tTHE HOSTESS\n\t\tHow nice to see you, darling. Who \n\t\tare your friends?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tI haven't the vaguest idea. I was \n\t\tambushed crossing Greenwich Avenue \n\t\tby a tribe of the Terre Haute \n\t\tKiwanis.\n \n\t\t\t\tTHE HOSTESS\n\t\t\t(she waves a vague \n\t\t\thand in a sort of \n\t\t\tshooing motion at \n\t\t\tthe five men on \n\t\t\tthe sidewalk) \n\t\tGo away, you men. Go back to the \n\t\tBiltmore Hotel and put on your red \n\t\tcaps.\n \n\t\t\t\tEDDIE\n\t\tI always thought you city people \n\t\twere more hospitable to us poor \n\t\tfarm boys.\n \n\tThe other four carousers are laughing too much to even talk. \n\tCharlie has ambled up to The Existentialist, who is peering \n\tover her hostess into the room behind her. \n \n\t\t\t\tCHARLIE\n\t\t\t(to The Existentialist,\n\t\t\tsmiling amiably) \n\t\tI'm sorry, miss. A friend of ours is \n\t\tgetting married here, and we're just \n\t\thorsing around.\n \n\tThe Existentialist looks into the young man's smiling, \n\trather winning face.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tWhy don't you come back after you \n\t\tget rid of your friends.\n \n\t\t\t\tEDDIE\n\t\tHe'll be back!\n \n\tShe turns abruptly and disappears past the hostess into the \n\troom.\n \n\t\t\t\tEDDIE\n\t\t\t(to Charlie) \n\t\tMan, she likes you, man!\n \n\t\t\t\tTHE HOSTESS\n\t\tNow, you boys go away.\n \n\tShe backs into her house and closes the door. Eddie starts \n\tup the steps to the door. The other four just roar with \n\tlaughter, clutch their sides, and giggle and snort.\n \n\t\t\t\tEDDIE\n\t\tWell, what do you say, men, are we \n\t\tgoing to this party, or aren't we?\n \n\t\t\t\tCHARLIE\n\t\t\t(laughing) \n\t\tCome on, Eddie. I thought you had \n\t\tsome movies you want to show us.\n \n\t\t\t\tEDDIE\n\t\tWhat do you want to see movies for? \n\t\tYou got the real thing right here.\n\n\t\t\t\tCHARLIE\n\t\t\t(laughing) \n\t\tEddie, we're married men here.\n \n\t\t\t\tEDDIE\n\t\tCome on, let's crash this party. \n\t\tI've been to these Greenwich Village \n\t\tparties. Man, they're wild.\n \n\t\t\t\tKENNETH\n\t\tCome on, Eddie, let's go up to your \n\t\tplace, see these movies.\n\n\t\t\t\tEDDIE\n\t\t\t(coming reluctantly \n\t\t\tback to the others, \n\t\t\tsays to Charlie) \n\t\tMan, you were going strong with that \n\t\tgirl. You could have scored. She's \n\t\tjust waiting for you. Go in after \n\t\ther.\n \n\t\t\t\tKENNETH\n\t\tCome on, Eddie. Let's go see the \n\t\tmovies.\n \n\t\t\t\tEDDIE\n\t\t\t(to the others) \n\t\tAll right, I live about three blocks \n\t\tdown. You guys want to see movies, \n\t\tall right, let's go see movies.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. THE BACHELOR'S APARTMENT\n\tEddie is scowling over a home-style movie projector, \n\tmuttering over the intricacies of fitting a reel into the \n\tratchets. Arnold has suddenly become voluble and is gabbing \n\taway at him. CAMERA DOLLIES AROUND THEM during the scene so \n\tthat we can see into the living room of the apartment, \n\tappointed in simple but neat masculine taste, where the \n\tother three men move in and out of view. Right now, we are \n\tconcerned only with Arnold and Eddie.\n \n\t\t\t\tARNOLD\n\t\t... we're moving in with her mother \n\t\tand father. I don't know if that's \n\t\tsuch a good idea. What do you think? \n\t\tWe haven't got an apartment yet, and \n\t\twe figure we'll live a year with her \n\t\tfolks, save on the rent, see? \n\n\tKenneth comes back from the kitchen with three open bottles \n\tof beer.\n \n\t\t\t\tKENNETH\n\t\tAnybody want a bottle of beer?\n \n\t\t\t\tARNOLD\n\t\t\t(to Eddie) \n\t\tShe's a widow, and that bothers me a \n\t\tlittle. I don't know why. She's two \n\t\tyears older than me. I don't know if \n\t\tyou know that. Her husband got killed \n\t\tin Korea. She's a cousin of mine, you \n\t\tknow.\n \n\t\t\t\tKENNETH\n\t\t\t(moving into \n\t\t\tthe living room) \n\t\tWho wants a bottle of beer?\n \n\t\t\t\tCHARLIE\n\t\tI'll take a bottle.\n \n\t\t\t\tWALTER\n\t\tYeah, give me one.\n \n\t\t\t\tARNOLD\n\t\tA third cousin, something like that. \n\t\tIt's not good for cousins to marry, \n\t\tis it? What do you think of her? I \n\t\tknow she's not terribly pretty, but \n\t\tI mean ...\n \n\t\t\t\tEDDIE\n\t\t\t(muttering imprecations \n\t\t\tat the projector) \n\t\tArnold, leave me alone a minute, \n\t\twill you?\n \n\t\t\t\tARNOLD\n\t\tSure.\n\t\t\t(turns to the others in \n\t\t\tliving room, plants a \n\t\t\thuge smile on his face) \n\t\tWell, I'm getting married Sunday. \n \n\t\t\t\tKENNETH\n\t\tHaving fun, Walter?\n \n\t\t\t\tWALTER\n\t\tFun. A bunch of grown men sitting \n\t\taround waiting to look at college \n\t\tboy pictures.\n \n\t\t\t\tARNOLD\n\t\tI swear, I never thought two months \n\t\tago I was ever going to get married. \n\t\tI still don't know how it happened....\n \n\t\t\t\tEDDIE\n\t\tHey, somebody turn off the lights. \n\n\tWalter is promptly up to turn off the lights.\n \n\t\t\t\tCHARLIE\n\t\tHey, you know, you've got a nice \n\t\tplace here. \n\n\tThe room is abruptly flooded in darkness. A beam of light \n\tshoots out from the projector. It seems pointed at the \n\twindow. Arnold stands up directly in the shaft of light.\n \n\t\t\t\tARNOLD\n\t\tI was just taking her out. I didn't \n\t\tknow it was so serious.\n\n\t\t\t\tEDDIE\n\t\tArnold, get out of the way, will \n\t\tyou?\n \n\t\t\t\tARNOLD\n\t\tOh, sure.\n \n\tArnold moves a step, still in the shaft of light, his shadow \n\thuge on the wall. Eddie, muttering, jockeys the projector \n\taround trying to focus it on the screen. The square of light \n\tand some flickering images wander up and down a wall.\n \n\t\t\t\tARNOLD\n\t\t... We're sitting in the car, so she \n\t\tsays: \"Well, Arnold, we've been \n\t\tgoing together six months now. I \n\t\tthink it's time we decided whether \n\t\twe were being serious.\" \n\n\t\t\t\tWALTER\n\t\tHey, Eddie, you got it on the window.\n \n\t\t\t\tARNOLD\n\t\tI didn't know it was so serious. I \n\t\tdidn't even know we were going \n\t\ttogether. I just took her out every \n\t\tnow and then.\n \n\t\t\t\tCHARLIE\n\t\tArnold, you're funny.\n \n\t\t\t\tEDDIE\n\t\tTurn on the lights again, will you, \n\t\tWalter.\n \n\t\t\t\tWALTER\n\t\tWhat's the matter?\n \n\t\t\t\tEDDIE\n\t\tI forgot to loop it over this loop \n\t\tthing.\n \n\tWalter crosses to light switch. The room is flooded in light \n\tagain.\n\n\t\t\t\tCHARLIE\n\t\tOh, for crying out loud.\n \n\t\t\t\tARNOLD\n\t\t\t(small panic) \n\t\tI can't even remember what she looks \n\t\tlike! I just saw her this afternoon!\n \n\t\t\t\tKENNETH\n\t\tArnold, have a bottle of beer. It's \n\t\tnot so terrible.\n \n\t\t\t\tARNOLD\n\t\tBoy, I tell you. It's for the rest \n\t\tof your life when you get married. \n\t\tThis is a big decision to make.\n \n\t\t\t\tWALTER\n\t\tDoes anybody seriously want to see \n\t\tthese movies? \n\n\tEddie is furiously winding and unwinding spools. CAMERA HAS \n\tDOLLIED AROUND so that we are looking back up the living \n\troom toward the projector and the men.\n \n\t\t\t\tARNOLD\n\t\tI could be making a serious mistake.\n \n\t\t\t\tEDDIE\n\t\tArnold, you're in the way again. \n\t\tCome on now. All right, put off the \n\t\tlights.\n \n\tThe room is flooded in darkness again. Walter hurries to a \n\tchair. The square of light is reasonably focused, just an \n\tedge trailing off onto the drapes of the window. Numbers \n\tflicker quickly on on the screen. The rest of the scene we \n\tsee looking into the whitened faces of the five men at their \n\tvarious posts. Arnold crosses, stands back of Walter.\n \n\t\t\t\tKENNETH\n\t\tHere we go.\n \n\t\t\t\tEDDIE\n\t\tHey, Arnold, if this is the one I \n\t\tthink it is, there's one part here I \n\t\twant you to see.\n \n\t\t\t\tWALTER\n\t\t\t(a picture of determined \n\t\t\tboredom, but putting on \n\t\t\this glasses) \n\t\tThis is for kids.\n \n\t\t\t\tCHARLIE\n\t\tSays he -- putting on his glasses.\n \n\t\t\t\tKENNETH\n\t\t\"The Baseball Game.\" That's a nice \n\t\ttitle, don't you think?\n \n\t\t\t\tEDDIE\n\t\tThis is the one, Arnold. There's a \n\t\tguy in here who looks just like \n\t\tArnold.\n \n\t\t\t\tKENNETH\n\t\tHey, she's not bad. Usually, the \n\t\tgirls in these things look like \n\t\tdinosaurs.\n \n\t\t\t\tWALTER\n\t\t\t(his eyes glued \n\t\t\tto the screen) \n\t\tA bunch of grown men ...\n \n\tHe breaks off as apparently some interesting action has \n\tstarted on screen. An involuntary grunt of acknowledgment \n\tescapes him.\n \n\t\t\t\tEDDIE\n\t\tI got these pictures off my dentist. \n\t\tI don't know where be got them. \n\t\tThere you are, Arnold, that's you.\n \n\t\t\t\tCHARLIE  \n\t\tYeah, it does look like Arnold.\n\n\t\t\t\tEDDIE\n\t\tDoesn't that look like Arnold?\n \n\t\t\t\tKENNETH\n\t\tWho's looking at the guy?\n \n\t\t\t\tCHARLIE\n\t\tArnold, you've got a great career \n\t\tahead of you.\n \n\t\t\t\tKENNETH\n\t\tThat girl looks like the girl \n\t\tCharlie picked up just before.\n \n\t\t\t\tEDDIE\n\t\tProbably is.\n \n\t\t\t\tWALTER\n\t\tThat fellow there is not a bad actor.\n \n\t\t\t\tCHARLIE\n\t\tActor. You could play that part \n\t\tpretty easy yourself.\n \n\t\t\t\tKENNETH\n\t\tI think the Daily News gave this one \n\t\tfour stars.\n\n\t\t\t\tEDDIE\n\t\tI'd like to see this in Three-D.\n \n\tThe side comments drift off for a moment, and a sort of \n\tfrozen attention settles on the white faces. Each face is \n\tsort of set in a mold of determined disinterest, but the \n\teyes are all watching.\n \n\t\t\t\tWALTER\n\t\tWell, I'll just watch one of them. \n\t\tThen, I think I'll just go home.\n \n\tHe wets his lips, lifts the bottle of beer to his mouth and \n\ttakes a swallow. His eyes never leave the screen.\n \n\t\t\t\t\t\tDISSOLVE TO:\n\n\n\tINTERIOR. KITCHEN  CHARLIE AND HELEN'S APARTMENT\n\tHelen standing in front of the laundry part of the sink, \n\tdoing her private laundry. She has on a house smock and her \n\tsleeves are rolled up. The doorbell rings. Helen takes a \n\ttowel off the doorknob behind her and, wiping her hands, \n\tcomes down across the dining area to the front door. She \n\topens the door to admit a young woman, about eight years \n\tolder than Helen.\n \n\t\t\t\tHELEN\n\t\tHiya, Julie. I was beginning to \n\t\tthink you weren't coming.\n \n\t\t\t\tJULIE\n\t\t\t(coming in) \n\t\tI was at my mother's house. Did they \n\t\tcall you? They said they were going \n\t\tto call you.\n \n\t\t\t\tHELEN\n\t\tYeah, your mother was very sweet.\n \n\t\t\t\tJULIE\n\t\tYou should have seen my father. I \n\t\tsaid, \"Pa, you have another \n\t\tgrandchild coming.\" So he said, \n\t\t\"Who?\" So I said, \"Charlie.\" So he \n\t\tsaid, \"That little Helen?\" So I said, \n\t\t\"If it isn't that little Helen, \n\t\tCharlie better leave town.\" So out \n\t\tcame the beer. Well, they've been \n\t\tafter Charlie to have a baby for a \n\t\tlong time now. I said, \"Pa, leave \n\t\thim alone. Let him get established \n\t\tbefore he saddles himself with a \n\t\tbaby.\" Anyway, I want you to know \n\t\tjoy reigns supreme in your in-laws' \n\t\thouse. \n\t\t\t(she moves into \n\t\t\tthe kitchen) \n\t\tHow's Charlie taking it?\n \n\t\t\t\tHELEN\n\t\t\t(following her \n\t\t\tinto the kitchen) \n\t\tListen, let me make you a cup of \n\t\ttea or something.\n \n\t\t\t\tJULIE\n\t\tNo, no, I've been drinking beer for \n\t\tthe last two hours, celebrating your \n\t\tbaby.\n \n\t\t\t\tHELEN\n\t\tSoda, anything like that?\n \n\t\t\t\tJULIE\n\t\tNo, honey, you go on with your wash. \n\t\tIs that what you're doing? \n\t\t\t(she sits) \n\t\tWhen I had my first baby, Mike was \n\t\tashamed to be seen on the streets \n\t\twith me. Well, listen, he was \n\t\tinterning at the time. We needed a \n\t\tbaby like a hole in the head. That's \n\t\twhy he's a general practitioner now, \n\t\tbecause of that baby. He was \n\t\tstudying to be a surgeon. He \n\t\tabsolutely refused to admit I was \n\t\tpregnant. Even in my ninth month, \n\t\tand I was as big as a house. He \n\t\tused to walk ten paces in front of \n\t\tme in the street like he didn't \n\t\tknow who that woman with the belly \n\t\twas. Where is Charlie anyway?\n \n\t\t\t\tHELEN\n\t\tI told you he--\n \n\t\t\t\tJULIE\n\t\tOh, yeah. I wouldn't let my Mike go \n\t\ton a bachelor party.\n \n\t\t\t\tHELEN\n\t\t\t(turning back \n\t\t\tto her wash) \n\t\tWhat are they going to do, get a \n\t\tlittle drunk?\n \n\t\t\t\tJULIE\n\t\tAre you kidding? What do you think \n\t\tthese bachelor parties are for, \n\t\tbachelors? This is for the married \n\t\tmen. It's a good excuse to get \n\t\tdrunk and find some girls. \n\n\t\t\t\tHELEN\n\t\tCan you picture Charlie getting \n\t\tdrunk and picking up a girl? \n\t\tCharlie's old sobersides. You \n\t\tshould have seen what I went through \n\t\tto get him to make a pass at me. \n\t\tHe's so sweet. Nobody knows how \n\t\treally sweet he is, he's so quiet \n\t\tall the time. My brother died in \n\t\tSeptember, he used to stay up with \n\t\tme till three, four o'clock every \n\t\tnight. I used to cry all night, and \n\t\the used to sit on the bed and talk \n\t\twith me. I used to look at him \n\t\ttalking there, and I used to think: \n\t\t\"What would I do without this sweet \n\t\tman here? I'd go crazy.\" You know, \n\t\tyou like to be a little cynical \n\t\tsometimes, Julie.\n \n\t\t\t\tJULIE\n\t\tWait'll you've been married eleven \n\t\tyears.\n \n\t\t\t\tHELEN\n\t\tYou like to talk about all the \n\t\taffairs everybody's husband is \n\t\thaving. Do you know actually one \n\t\twoman whose husband is actually \n\t\tplaying around?\n \n\tAn abrupt, sad expression, tinged with pain, has come over \n\tJulie's face. She looks down at the table.\n \n\t\t\t\tJULIE\n\t\tWait'll you've been married eleven \n\t\tyears.\n \n\tHelen, aware that she has perhaps touched on a sensitive \n\tsubject, frowns and turns back to her washing. A quick, \n\tthick silence dips into the room. \n \n\t\t\t\tJULIE\n\t\t\t(looking down) \n\t\tWait'll Charlie gets to be forty-two. \n\t\tMy Mike's having an affair right now \n\t\twith one of his patients right now. \n\t\tWe don't talk about it -- don't you, \n\t\teither, not even to Charlie. But \n\t\tMike knows I know about it. I even \n\t\tknow the patient. A married woman \n\t\twith a hyperthyroid problem. My \n\t\tMike's a good doctor with a pretty \n\t\tgood practice. The kids are crazy \n\t\tabout him. But every now and then \n\t\the has to go out and get involved \n\t\twith a woman. \n\n\tShe looks down at her hands in her lap.\n \n\t\t\t\tJULIE\n\t\tListen, I will take a cup of tea if \n\t\tyou've got one. \n\n\tShe stands, opens the pantry, looks around among the cans \n\tand packages for a box of tea bags.\n \n\t\t\t\tHELEN\n\t\t\t(quite shocked) \n\t\tYou're kidding, aren't you?\n \n\t\t\t\tJULIE\n\t\t\t(finds the box \n\t\t\tof tea bags) \n\t\tWould I kid about something like \n\t\tthat?\n \n\tShe puts the box of tea bags an the workshelf, unhooks a \n\tsaucepan hanging over the stove, turns to the sink and fills \n\tit with water. Helen regards her, not quite knowing what to \n\tsay. Julie sets the saucepan going on the stove, stares at \n\tit.\n \n\t\t\t\tJULIE\n\t\tI don't know why I told you. Don't \n\t\ttell anybody, not even Charlie. I \n\t\tdon't want the family to know. But \n\t\tthis woman isn't the first one. I \n\t\tknow that much. About three years \n\t\tago, the doorbell rings. I open the \n\t\tdoor. There's a man there. He says: \n\t\t\"Tell your husband to stay away from \n\t\tmy sister.\" How would you like to \n\t\topen the door and have somebody say \n\t\tthat to you? I cried for two weeks. \n\t\tI don't know what to do about it, \n\t\tHelen. Should I bring it out in the \n\t\topen with Mike or should I just keep \n\t\tmy mouth shut like the other time? \n\t\tBecause he's not going to leave me. \n\t\tEven if he doesn't care about me, \n\t\the has his kids to think about. We \n\t\tmarried too young. That was our big \n\t\tmistake. We married too young. \n\n\tHer face, her whole body suddenly tightens to forestall any \n\tpossibility of breaking into tears, and she sits down \n\tabruptly on the kitchen stool, her eyes clenched tight and \n\ther face rigidly impassive. Helen remains nervously silent.\n \n\t\t\t\tJULIE\n\t\t\t(her voice rising just \n\t\t\ta little from the \n\t\t\tsuppressed emotion \n\t\t\twithin her) \n\t\tWe should have waited till he \n\t\tfinished his internship. What kind \n\t\tof married life is that? Twenty-two \n\t\tdollars a month he was earning. \n\t\tEvery other day, he had to sleep in \n\t\tthe hospital. The first two years of \n\t\tour marriage, we didn't even see \n\t\teach other. And then I'm pregnant. \n\t\tHe had to quit, what do you think? \n\t\tHe wanted to be a surgeon, he wound \n\t\tup being a G.P. From that day he \n\t\thated me. I had two other children \n\t\tby him, but he hated me. He told me \n\t\tin just so many words. Why do you \n\t\tthink I kept telling you, Helen, why \n\t\tdo you think I kept telling you: \n\t\t\"Don't have a baby till Charlie finds \n\t\thimself.\" \n\t\t\t(suddenly cries out) \n\t\tIt hurts! Even after eleven years, \n\t\tit hurts!\n \n\tShe stands abruptly and moves quickly past Helen out the \n\tkitchen doorway into the dark living room, leaving Helen \n\tstanding troubled, concerned, in the kitchen. After a moment, \n\tHelen moves to the kitchen doorway and a step out into the \n\tdining area. She looks through the dark living room to the \n\tgray silhouette of Julie standing by the living room window, \n\ther form lightly outlined by a tracing of moonlight.\n \n\t\t\t\tHELEN\n\t\tAre you all right, Julie?\n \n\t\t\t\tJULIE\n\t\t\t(muttering) \n\t\tI'm all right. I'm all right.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. BACHELOR'S APARTMENT (45 MINUTES LATER)\n\tWe are looking back up the living room as we were at the \n\tclose of the last scene in this apartment. The room is \n\tabsolutely dark now, but a light pours in from the foyer. In \n\tthis shaft of light, we can see Eddie moving from behind the \n\tprojector to the wall switch and turning on the lights. The \n\troom is abruptly bright with light, and our five men squint \n\tagainst the sudden glare. They have all changed their \n\tpositions and taken off their jackets and loosened their \n\tties. They are lolling about. CAMERA LOOKS DOWN TO THE FLOOR \n\tto take particular note of eight empty beer bottles, an \n\topened fifth of bourbon, ash trays, crumpled packs of \n\tcigarettes, a cup and saucer, somebody's shoes, somebody's \n\tjacket that has fallen off the back of a chair. Over this \n\twe hear Walter's voice:\n\n\t\t\t\tWALTER\n\t\tIs that the last one?\n \n\t\t\t\tEDDIE\n\t\tYeah.\n \n\tA thick silence fills the room. There is a kind of sodden \n\tfeeling to this scene. After a long moment, Walter's voice \n\tagain:\n \n\t\t\t\tWALTER\n\t\tAh, you've seen one, you've seen \n\t\tthem all. \n \n\t\t\t\tKENNETH\n\t\tYeah, they're all alike.\n \n\t\t\t\tCHARLIE\n\t\tI don't know -- I think the first \n\t\tone was all right.\n \n\t\t\t\tWALTER\n\t\tYeah, I was so bored by the rest of \n\t\tthem. I nearly fell asleep during \n\t\tthe last one.\n \n\t\t\t\tKENNETH\n\t\tYou in the habit of sleeping with \n\t\tyour eyes open? \n\n\tWe look down on the room now, at all five of the men, Eddie \n\trewinding the last reel, the little motor of the projector \n\thumming. The others loll about, their legs dangling over the \n\tarmrests of the soft chairs and sofas. There is a heavy, \n\tdense mood that no one seems willing to break.\n \n\t\t\t\tCHARLIE\n\t\tWhat time's it about, anybody know?\n \n\t\t\t\tARNOLD\n\t\t\t(glancing at his watch) \n\t\tI got a quarter to nine.\n \n\t\t\t\tEDDIE\n\t\tNo, it's later than that, about a \n\t\tquarter after. \n\n\tAgain the silence falls upon the five men. Only the humming \n\tlittle motor interrupts the thick silence. Nobody moves.\n \n\t\t\t\tWALTER\n\t\t\t(after a moment) \n\t\tAh, you see one, you've seen them \n\t\tall.\n \n\tAgain the silence. Charlie stretches over for his bottle of \n\tbeer on the floor beside his chair. He pours what's left of \n\tthe bottle into the glass standing beside it. Otherwise \n\tnobody moves.\n\n\t\t\t\tWALTER\n\t\t\t(after a moment) \n\t\tSo that's the last one you've got to \n\t\tshow us, Eddie?\n \n\t\t\t\tEDDIE\n\t\tYeah. You want to run them backwards?\n \n\t\t\t\tKENNETH\n\t\tI wonder where they get the girls to \n\t\tmake these movies?\n \n\t\t\t\tWALTER\n\t\tMight as well go home, I guess.\n \n\t\t\t\tKENNETH\n\t\tYeah.\n \n\tThe idea doesn't seem to propel anybody to any decisive \n\tmovement. Walter shifts his position on the sofa, stretches \n\tout his legs, regards his shoes with a sudden sadness.\n \n\t\t\t\tWALTER\n\t\t\t(after a moment) \n\t\tLife is short.\n \n\tThis gives everybody something to think about for a moment.\n \n\t\t\t\tEDDIE\n\t\t\t(hunched over \n\t\t\tthe projector, \n\t\t\tdismantling it) \n\t\tYou guys feel like going down to \n\t\thave a drink for Arnold?\n \n\tThis brings a reaction. Walter stands.\n \n\t\t\t\tWALTER\n\t\tYeah! What do you say? One last \n\t\tdrink for Arnold!\n \n\t\t\t\tCHARLIE\n\t\tOkay with me.\n \n\tSuddenly life is back in the room, the men ad-lib: \"Where's \n\tmy coat?\" \"Let's get out of here,\" etc. \n \n\t\t\t\tKENNETH\n\t\t\t(unwinding himself \n\t\t\tfrom his slouched \n\t\t\tposition on a chair) \n\t\tYou can say what you want to about \n\t\tthese pictures -- they're really \n\t\tpretty bad -- but they get you.\n \n\t\t\t\tARNOLD\n\t\tDon't you think we ought to clean up \n\t\tthe place?\n \n\t\t\t\tEDDIE\n\t\tNo, I got a woman comes in.\n \n\t\t\t\tWALTER\n\t\t\t(grabbing up \n\t\t\this jacket) \n\t\tI almost fell asleep during the \n\t\tlast one. \n\t\t\t(he looks at \n\t\t\tthe others) \n\t\tWell, what do you say, huh? Let's \n\t\tgo! One last drink! \n\n\tAd libs on exit.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. LIVING ROOM CHARLIE AND HELEN'S APARTMENT\n\tHelen and Julie. A corner lamp in the living room is lit, \n\tlending a soft but not too effective light to the room. The \n\ttwo young women are on the couch. Helen sits curled at one \n\tend, head down listening to Julie, who has been talking and \n\tprobably crying a little since we last saw them forty-five \n\tminutes ago. Julie is seated with her legs stretched out in \n\tfront of her, her head resting back on the back of the couch. \n\tShe is talking more freely and easily now, the first hard \n\toutburst over with.\n \n\t\t\t\tJULIE\n\t\t... He's a boy, my Mike. Till the \n\t\tday he dies, he'll never be more \n\t\tthan fifteen. Perpetual adolescence, \n\t\tthat's the curse of the professional \n\t\tman. He spends his whole youth trying \n\t\tto be a doctor, a lawyer, an \n\t\taccountant. Then he spends the rest \n\t\tof his life looking for the fun he \n\t\tshould have had when he was a boy.\n \n\t\t\t\tHELEN\n\t\tOh, I know. Charlie and I hardly \n\t\teven see each other.\n \n\t\t\t\tJULIE\n\t\tIt's very hard on the wife, Helen. \n\t\tThese are the years when you should \n\t\tbe building your marriage. Instead, \n\t\tyou grow away from each other. I've \n\t\tseen it happen with my friends. In \n\t\tthe end, they have nice homes in New \n\t\tRochelle, and a maid, and their \n\t\tmaids are happier than they are. But \n\t\tsometimes it does work. It can be \n\t\tdone, Helen. Encourage Charlie to \n\t\tstay with his school because...\n \n\t\t\t\tHELEN\n\t\tOh, I will, Julie ...\n \n\t\t\t\tJULIE\n\t\t... he's an ambitious boy ...\n \n\t\t\t\tHELEN\n\t\t... oh, it's not just he's \n\t\tambitious ...\n \n\t\t\t\tJULIE\n\t\t... and if he doesn't fulfill \n\t\thimself, he'll resent you and your \n\t\tbaby the rest of his life.\n \n\t\t\t\tHELEN\n\t\tOh, I don't want him to quit. He \n\t\tloves accounting, Julie. I see him \n\t\tsometimes, sitting over his homework. \n\t\tHe's got his ledgers out, and he's \n\t\tadding up columns of figures as long \n\t\tas his arm. And he's chuckling. \n\t\tYou'd think he was reading the \n\t\tcomics. He has a book there, \n\t\tBusiness Law. How he can read it I \n\t\tdon't know. But I'll be watching \n\t\ttelevision or something, and he'll \n\t\tcome over, and he'll start telling \n\t\tme about some fine legal point. I \n\t\tdon't know what he's talking about, \n\t\tbut it's enough for me to see how \n\t\texcited it makes him. He loves it,\n\t\tJulie. You can't take something like \n\t\tthat away from him. It's just -- \n\t\tit's just I feel we're not really \n\t\tclose any more. I mean, he comes \n\t\thome from school, lots of times I'm \n\t\tasleep already. And, when I do see \n\t\thim, he seems all involved with \n\t\thimself. He looks at me sometimes as \n\t\tif I were a stranger to him, and I \n\t\tfeel sometimes I am. I'm afraid of \n\t\tthat, Julie.\n \n\t\t\t\tJULIE\n\t\tThen get rid of the baby.\n \n\tIt is said simply, inevitably, even innocently. It brings \n\tonly a frown to Helen's face and a short silence.\n \n\t\t\t\tJULIE\n\t\tIf I had it to do again, believe me, \n\t\tthat's what I would do.\n \n\t\t\t\tHELEN\n\t\t\t(slowly becoming aware \n\t\t\tof the depth of what \n\t\t\tthey are talking about) \n\t\tYou don't mean that, Julie.\n \n\t\t\t\tJULIE\n\t\tYes, I do. My children are the only \n\t\tthings in my life now, but I would \n\t\trather have a husband.\n \n\t\t\t\tHELEN\n\t\tI wouldn't even think about it.\n \n\t\t\t\tJULIE\n\t\tThat's what I said, too.\n \n\t\t\t\tHELEN\n\t\tLet's not even think about it. If I \n\t\teven mentioned it, he'd -- he'd hit \n\t\tme, I think.\n \n\t\t\t\tJULIE\n\t\tAll right.\n \n\tNow, the thick, tense silence falls between them. They both \n\toccupy themselves with their own troubled thoughts. \n \n\t\t\t\tHELEN\n\t\tI want this baby, Julie. I've wanted \n\t\tthis baby for a long time. It's the \n\t\tonly thing I've ever asked of \n\t\tCharlie. If I mentioned that to him \n\t\t-- I don't know what he'd do. \n\n\tAgain, they sink into silence. Then in the thick silence, \n\tthe telephone rings. The two young women are so deep within \n\ttheir thoughts that neither of them moves. It rings again, \n\tand Helen slides off the couch and goes to the phone. It \n\trings again. She picks it up.\n \n\t\t\t\tHELEN\n\t\t\t(on phone) \n\t\tHello.... Hello, Charlie, where are \n\t\tyou calling from? ... You sound like \n\t\tyou're having a nice time.... Oh, \n\t\tyou're having a ball, huh? ... Well, \n\t\twhat time do you think you'll be \n\t\tcoming home?\n \n\tINTERIOR. PHONE BOOTH IN EIGHTH STREET BAR\n\tCharlie in the phone booth, smiling broadly. He seems in \n\twonderful spirits. Through the glass of the phone booth we \n\tcan see part of the bar and some of the barflies.\n \n\t\t\t\tCHARLIE\n\t\t\t(on phone) \n\t\tWell, that's what I wanted to call \n\t\tyou about, honey. I think a couple \n\t\tof the guys are cutting out now. I \n\t\tthink Kennie's going home. But I was \n\t\twondering if you wanted me home for \n\t\tany special reason.\n \n\tINTERIOR. THE FOYER\n \n\t\t\t\tHELEN\n\t\t\t(on phone) \n\t\tJust a minute, Charlie....\n \n\tShe rises, goes to kitchen door, still holding the phone. \n \n\t\t\t\tHELEN\n\t\t\t(to Julie) \n\t\tExcuse me a minute, Julie. It's \n\t\tCharlie.... \n\n\tShe goes into the kitchen. A little embarrassed, she closes \n\tthe kitchen door.\n \n\tINTERIOR. THE KITCHEN\n \n\t\t\t\tHELEN\n\t\t\t(on phone) \n\t\tCharlie? ... \n\t\t\t(sits) \n\t\tCharlie, come on home now.... No, I \n\t\tfeel all right. I just miss you. \n\t\tJulie's here, and we were talking \n\t\tabout you, and I just miss you.... \n\t\tAh, come on.... \n\t\t\t(frowns a little) \n\t\tWell, no, if you're having such a \n\t\tgood time, stay out and enjoy \n\t\tyourself.... No, Charlie, I don't \n\t\twant you to come home if you're \n\t\thaving a good time.... I'm not \n\t\tlonely. Julie's here. We're talking. \n\t\tI was washing some things.... I \n\t\tknow, that's what I told you this \n\t\tmorning. You've finally got a night \n\t\toff for yourself. I don't want you \n\t\tto feel guilty about it.... \n\t\tCharlie, do you love me? ... You \n\t\tsound angry.... No, come home any \n\t\ttime you want....\n\t\t\t(she wets her \n\t\t\tlips nervously) \n\t\tCharlie ...\n\t\t\t(she lets her head \n\t\t\tsink down onto the \n\t\t\tpalm of her free hand) \n\t\tCharlie, there's no girls at this \n\t\tparty, are there? ... I'm not \n\t\tchecking up on you, Charlie. I just \n\t\tmiss you, that's all.... All right, \n\t\tCharlie, please, I don't want to \n\t\targue with you. Julie's in the \n\t\tliving room. ... All right, have a \n\t\tgood time, stay out as long as you \n\t\twant.... All right, Charlie, good-\n\t\tbye.\n \n\tShe slowly hangs up the receiver, sits slumped and abject.\n \n\n\tINTERIOR. PHONE BOOTH IN EIGHTH STREET BAR\n\tCharlie in booth. The broad grin has disappeared from his \n\tface. As seen through the closed glass doors of the booth, \n\the is a very sullen and despondent young man. He stands now, \n\tpushes the doors open, and comes out. CAMERA PULLS BACK so \n\tthat we can see the whole area of the bar near the phone \n\tbooths. Next to the phone booth are two doors marked GUYS \n\tand DOLLS. Kenneth is coming in from the deeper recesses of \n\tthe bar where the other members of the bachelor party are \n\tgrouped in a booth. He is headed for the door marked GUYS. \n\tCharlie regards Kenneth bleakly as he approaches.\n \n\t\t\t\tCHARLIE\n\t\tThe party breaking up?\n \n\t\t\t\tKENNETH\n\t\t\t(pushing into \n\t\t\tthe men's room) \n\t\tI don't know. I'm going home. You \n\t\tgoing home?\n \n\t\t\t\tCHARLIE\n\t\tYeah, I think so.\n   \n\tHe pushes into the men's room after Kenneth.\n \n\tINTERIOR. THE MEN'S ROOM \n\tA small, white-tiled, yet somehow not too clean, men's room, \n\ttwo-urinal size. There is one washbowl with a small mirror \n\tover it, and two water closets with doors, separated from \n\teach other by a steel partition. Charlie perches on the edge \n\tof the washbowl; he apparently came in just to talk. Kenneth \n\tmoves off camera for more practical use of the room. CAMERA \n\tstays on Charlie who seems depressed, pensive, sad. Stay on \n\thim for a long moment. Then ...\n \n\t\t\t\tCHARLIE\n\t\t\t(frowning) \n\t\tYou love your wife, Kennie?\n \n\t\t\t\tKENNETH'S VOICE \n\t\t\t(off)\n\t\tWell, I've been married six years. \n\t\tI've got two kids that keep me awake \n\t\tall night long. Every Sunday, we go \n\t\tout driving in Long Island looking \n\t\tfor a house that's going to take \n\t\tone, probably two mortgages. I better \n\t\tlove my wife.\n \n\tKenneth appears now, edges Charlie away from the wash basin, \n\tso he can wash his hands.\n \n\t\t\t\tCHARLIE\n\t\tI don't feel like going home. Are \n\t\tyou going? Hang around, Kennie. It's \n\t\tonly about nine thirty, ten.\n \n\t\t\t\tKENNETH\n\t\tIt's after ten. It's about ten after \n\t\tten.\n \n\tKenneth rips off a paper towel. The only noise for a moment \n\tis the soft crumpling of paper as Kenneth dries his hands.\n \n\t\t\t\tKENNETH\n\t\tThe party's getting a little wild in \n\t\tthere anyway. Eddie and Walter got \n\t\tpoor Arnold nailed in there, they're \n\t\ttrying to talk him into getting a \n\t\tgirl. This party's going to wind up \n\t\tin a joint, let me tell you. This is \n\t\ta good time to blow.\n \n\t\t\t\tCHARLIE\n\t\t\t(frowning)\n\t\tYeah.... I should have gone to class \n\t\ttonight. I'm paying twenty bucks a \n\t\tcredit. The least I can do is go to \n\t\tclass.\n \n\tHe breaks off abruptly, turning away with a sudden frown.\n \n\t\t\t\tCHARLIE\n\t\tI take one night off, I can't even \n\t\tenjoy myself. Did you know Eddie \n\t\twent back to Europe? \n \n\t\t\t\tKENNETH\n\t\tNo, I didn't know that.\n \n\t\t\t\tCHARLIE\n\t\tHe was telling me he lived in Paris \n\t\tfor three months. I'd like to do \n\t\tthat! \n\n\tHe ambles around the men's room, studying himself with \n\tunseeing eyes in the little mirror, poking the trash can \n\tinto which Kenneth is now dropping his wadded paper towel. \n\tHe suddenly turns to Kenneth, stares at him. Kenneth looks \n\tat him in mirror.\n \n\t\t\t\tKENNETH\n\t\tWhat's the matter?\n \n\t\t\t\tCHARLIE\n\t\tI'm going to quit. What am I \n\t\tkilling myself for?\n \n\t\t\t\tKENNETH\n\t\tQuit what?\n \n\t\t\t\tCHARLIE\n\t\tQuit night school. Tonight was the \n\t\tfirst laughs I've had in years. I \n\t\tcan't remember the last time I had \n\t\tso much fun. Look what I'm missing. \n\t\tI'm making a pretty good living. I \n\t\tcan support a wife and baby on what \n\t\tI make. I'm going to quit! I mean \n\t\tit. I'm going to quit. Boy, what a \n\t\ttime to have a baby.\n \n\t\t\t\tKENNETH\n\t\tYou don't have to quit school \n\t\tbecause you're having a baby, \n\t\tCharlie. There are lots of guys go \n\t\tto night school with two, three \n\t\tkids.\n \n\t\t\t\tCHARLIE\n\t\tYou ought to meet some of these guys. \n\t\tThey're just grinding their lives \n\t\taway. It's an obsession with some of \n\t\tthese guys. I mean, what's the point? \n\t\tSo I'll go five more years to night \n\t\tschool. So I'll get my degree. So \n\t\tI'll get a job as a junior accountant \n\t\tfor three years at seventy-five bucks \n\t\ta week. I'm making better than that \n\t\tnow. And then it just starts. The \n\t\tCPA exams. By the time I'm fifty, I \n\t\tcan start living. At this point, I \n\t\tget a heart attack and an ulcer, and \n\t\tthey bury me in the ground, and they \n\t\tsay: \"That was Charlie Samson, the \n\t\tman who didn't see a movie in fifty \n\t\tyears.\" Why go through all that? \n\t\tI'll quit. I feel so mad right now, \n\t\tyou better keep an eye on me, Kennie, \n\t\tbecause I'm going to wind up punching \n\t\tsomebody.\n\n\tThe door opens. Man enters to clean a spot off his tie.\n \n\t\t\t\tKENNETH\n\t\tCome on, let's go home.\n \n\t\t\t\tCHARLIE\n\t\tWhat do I want to go home for?\n \n\t\t\t\tKENNETH\n\t\tYou're in a lousy mood.\n   \n\tThe man, finished with his tie, exits.\n \n\t\t\t\tKENNETH\n\t\t\t(after a moment) \n\t\tCharlie, go home. I can see you're \n\t\tgoing to get fried tonight and wind \n\t\tup picking up a tramp and you're \n\t\tgoing to wake up in the morning \n\t\tfeeling like two-bits.\n \n\t\t\t\tCHARLIE\n\t\tIt'd be a profit.\n \n\t\t\t\tKENNETH\n\t\tCharlie, about five years ago, I \n\t\twent without a job for seven months. \n\t\tAlice was carrying our first baby. \n\t\tWe were living on money I borrowed \n\t\tfrom my brother. I don't know if you \n\t\tremember me in those days, but it \n\t\twas rough. I used to go out every \n\t\tnight, put a load on, and make a \n\t\tpass at any girl who looked at me. \n\t\tAnd I mean any. Big, tall, short, \n\t\tfat, anything. Well, one night I \n\t\tpicked up some tomato somewheres, \n\t\tand we were sitting in a bar or \n\t\tsomewheres, and I kept calling her \n\t\tAlice all night. So she says to me: \n\t\t\"My name ain't Alice. Who's Alice?\" \n\t\tSo I said: \"Alice is my wife,\" and \n\t\tI got up and I went home.\n \n\tCharlie waits a moment for Kenneth to continue, but \n\tapparently this is all Kenneth has to offer at the moment.\n \n\t\t\t\tCHARLIE\n\t\tWhat does that mean?\n \n\t\t\t\tKENNETH\n\t\tI don't know. I had a point when I \n\t\tstarted telling that story.\n \n\t\t\t\tCHARLIE\n\t\tI'm not looking for another woman.\n \n\t\t\t\tKENNETH\n\t\tYes, you are, Charlie. You may not \n\t\tknow it, but you are. So go on home, \n\t\tCharlie, before you get any drunker \n\t\tthan you are. Charlie, you start \n\t\tmessing with other women, something \n\t\tgoes. It'll kill your marriage. \n\t\tIt'll kill your wife. It'll just \n\t\tkill her. What my wife went through \n\t\t-- well, I don't even want to \n\t\tremember it. It's never the same \n\t\twith your wife again, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tI'm not looking for any woman.\n \n\t\t\t\tKENNETH\n\t\tI think what I was trying to say \n\t\twas you stick with your night school. \n\t\tSome guys have to make peace with \n\t\tthemselves that they're never going \n\t\tto amount to too much. A guy like me. \n\t\tOnce I made that peace with myself, \n\t\tI found out it doesn't really matter \n\t\twhat you amount to. I got a nice \n\t\twife and two children I complain \n\t\tabout all the time, but if anything \n\t\tever happened to either one of them, \n\t\tI think I'd die. But you don't have \n\t\tto make that kind of peace, and \n\t\tyou'd be crazy to settle for less \n\t\tthan what you want. You want \n\t\tsomething, Charlie. I think that's \n\t\twonderful.\n\t\t\t(Charlie's eyes go \n\t\t\ttoward Kenneth) \n\t\tYou're a little drunk now, and \n\t\tyou're fed up to the teeth. \n\t\tEverybody gets fed up, Charlie. You \n\t\tstick with it. You're going to be all \n\t\tright.\n \n\t\t\t\tCHARLIE\n\t\t\t(touched) \n\t\tYou're a nice guy, Kennie.\n \n\t\t\t\tKENNETH\n\t\tSure. You're a nice guy too.\n \n\tThe door to the men's room opens, and a Young Man comes in, \n\tlooks around quickly at Kenneth and Charlie -- bumps into \n\tKennie.\n \n\t\t\t\tYOUNG MAN\n\t\tWatch it -- will you, Mac?\n \n\tCharlie regards this statement a moment. Then advances to \n\tthe Young Man.\n \n\t\t\t\tCHARLIE\n\t\tWait a minute.... What are you, a \n\t\twise guy? \n\n\tHe is all set to bust the Young Man one in the nose, but \n\tKenneth takes him by the arm.\n \n\t\t\t\tKENNETH\n\t\tCome on, Charlie, let's go home. \n\n\tCharlie allows himself to be led to the door.\n \n\t\t\t\tCHARLIE\n\t\tI'm just about drunk enough right \n\t\tnow to bust somebody right in the \n\t\tnose.\n \n\tKenneth reaches for the knob of the door, opens it, and the \n\ttwo men go out. They find themselves in the crowded, noisy \n\tbar. A jagged kind of intensity to the atmosphere as if some \n\tof the men at the bar might be gangsters. Booths filled with \n\tmen and women and some mixed-up types. Kenneth and Charlie \n\tmake their way through the bodies down to one of the booths \n\twhere Eddie and Arnold are sitting and Walter is standing, \n\theavily drunk. Eddie is expostulating to Walter:\n \n\t\t\t\tEDDIE\n\t\t\t(to Walter) \n\t\t... Come on, will you? Look Walter, \n\t\tit's just the shank of the evening! \n\t\tWhat's so special in your home? You \n\t\tgot a floor show every night? Who \n\t\tare you married to, Jayne Mansfield? \n\t\tCome on, it's not even half past \n\t\tten!\n \n\tWalter sits heavily down.\n \n\t\t\t\tKENNETH\n\t\t\t(smiling amiably) \n\t\tWe got to get up tomorrow, go to \n\t\twork, Eddie.\n \n\t\t\t\tEDDIE\n\t\tWe're just starting! We got to get \n\t\tArnold a girl yet!\n \n\t\t\t\tARNOLD\n\t\tEddie, please ...\n \n\t\t\t\tEDDIE\n\t\tThat's the whole point to a bachelor \n\t\tparty! You got to get the guy a girl!\n \n\t\t\t\tARNOLD\n\t\tLook, fellows, it's been a nice \n\t\tclean party ...\n \n\t\t\t\tKENNETH\n\t\tWell, Arnold, since I'm not going to \n\t\tsee you again before the wedding, \n\t\tcongratulations and best wishes in \n\t\tthe coming future to both you and \n\t\tthe bride.\n \n\t\t\t\tARNOLD\n\t\tThanks a lot, Kennie....\n \n\tEddie turns to Charlie, who is still glowering.\n \n\t\t\t\tEDDIE\n\t\tYou're not going, are you, Charlie? \n\t\tWe're just starting! We got to get \n\t\tArnold a girl yet! \n\n\t\t\t\tARNOLD\n\t\t\t(to Kenneth) \n\t\tI want to thank you for the \n\t\tpresents, Kennie....\n \n\t\t\t\tCHARLIE\n\t\t...No, I'll stick around another \n\t\thour or so....\n \n\t\t\t\tEDDIE\n\t\t... That's my boy....\n \n\t\t\t\tARNOLD\n\t\t\t(to Kenneth, who is \n\t\t\tlooking at Charlie) \n\t\t... Honestly, I never expected any \n\t\tpresents....\n \n\t\t\t\tKENNETH\n\t\t\t(to Charlie) \n\t\t... Aren't you coming home? ...\n \n\t\t\t\tCHARLIE\n\t\t... What for? Sit around talking to \n\t\tmy sister Julie? ...\n \n\t\t\t\tARNOLD\n\t\t\t(standing) \n\t\t... I want to thank all you \n\t\tfellows ...\n \n\t\t\t\tEDDIE\n\t\tAll right, stop thanking them, \n\t\tArnold. They just gave you a party, \n\t\tthey didn't elect you President.\n \n\t\t\t\tARNOLD\n\t\t... This has been one of the nicest \n\t\tnights of my life....\n \n\t\t\t\tCHARLIE\n\t\tLet's go someplace ... let's go to \n\t\ta nightclub.\n \n\t\t\t\tEDDIE\n\t\tThat's great with me.\n \n\t\t\t\tCHARLIE\n\t\tCome on, Ken.\n \n\t\t\t\tARNOLD\n\t\tThanks a lot.\n \n\t\t\t\tKENNETH\n\t\t... Well, listen, fellows, I'm \n\t\tcutting out.... Good night, Walter, \n\t\tEddie. \n\t\t\t(to Charlie) \n\t\t... You coming, Charlie? ...\n \n\t\t\t\tCHARLIE\n\t\t... No, I'll kill another hour.... \n\t\tCome on, Kennie....\n \n\t\t\t\tKENNETH\n\t\tNo, you go ahead. I'll see you in \n\t\tthe morning, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tOkay, I'll see you.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. THIRD STREET \n\tThe little stretch of strip-joints on Third Street. Bright \n\tlittle cluster of honky-tonks.\n \n\tEXTERIOR. THIRD STREET\n\tOur bachelor party, now down to four carousers, ambles along \n\tthe rather filled sidewalk, looking at the cardboard cutouts \n\tof the strippers in the windows of the night clubs.\n \n\tThe four men pause before one of the strip-joints, examining \n\tthe cardboard cutout and billboard which promises first-rate \n\tentertainment inside.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. THIRD STREET NIGHT CLUB \n\tWe look down on the whole night club, showing the dark, \n\tdingy, crowded, smallness of it. There is a strip going on. \n\tIt doesn't look very interesting. \n\n\tOur four men are huddled over a very small table in one of \n\tthose Third Street clip-joints. It is a dark little hovel, \n\tbut a blue stage light drifts across the table, vaguely \n\tilluminating our four celebrators. Behind them, a strip \n\ttease is in progress. Every now and then, an almost stout \n\twoman in her forties, garish in the blue spotlight, dressed \n\tin a white satin ill-fitting gown, moves in and out of our \n\tview. Half the tables and wall booths are occupied. There is \n\ta horseshoe bar off in the recesses of the club. A three-\n\tpiece band is playing spiritlessly.\n \n\tWalter is gone, deep in some painful, drunken world of his \n\town. Charlie rubs his eyes as if to keep his senses awake. \n\tArnold, who is soggy, is leaning toward Eddie, who alone of \n\tthe four men is giving any attention to the show.\n \n\t\t\t\tARNOLD\n\t\tSo what do you think of my girl, \n\t\tEddie? You met her. Be honest with \n\t\tme. Tell me the truth. I had the \n\t\tfeeling you didn't like her.\n \n\t\t\t\tEDDIE\n\t\tCome on, come on, Arnold. What do \n\t\tyou want from me. \n\n\tArnold turns to Charlie.\n \n\t\t\t\tARNOLD\n\t\tListen, Charlie, I'd like to ask you \n\t\ta little advice. I mean, you're a \n\t\tmarried man. This girl, I'm supposed \n\t\tto marry, she's all right, but I'm \n\t\tnot really attracted to her, you \n\t\tknow what I mean? That's important,\n\t\tisn't it? I kissed her a couple of \n\t\ttimes, but I ... I don't know why \n\t\tI'm getting married, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tWhat did you say, Arnold?\n \n\t\t\t\tARNOLD\n\t\tI said, I don't know why I'm getting \n\t\tmarried. I did pretty good for \n\t\tthirty-two years without getting \n\t\tmarried. I get along fine at home. \n\t\tMy mother's a good cook. I have a \n\t\tnice life. What do I want to break \n\t\tit all up for?\n \n\t\t\t\tCHARLIE\n\t\tWell, Arnold, everybody feels that \n\t\tway before they get married.\n \n\t\t\t\tARNOLD\n\t\tYeah? Did I ever show you a picture \n\t\tof my girl?\n \n\t\t\t\tCHARLIE\n\t\tNo, you didn't, Arnold.\n \n\t\t\t\tARNOLD\n\t\tDo you want to see a picture?\n \n\t\t\t\tCHARLIE\n\t\tSure.\n \n\tArnold clumsily hauls out his wallet and extracts a picture. \n\tHe gives it to Charlie who twists at an angle in order to \n\tget some light on it.\n \n\t\t\t\tARNOLD\n\t\tI want you to give me your honest \n\t\timpression, Charlie. She isn't much, \n\t\tis she?\n \n\t\t\t\tCHARLIE\n\t\tI can't see much in this light, but \n\t\tshe looks like a nice pretty girl.\n \n\t\t\t\tARNOLD\n\t\tWell, I wouldn't say that. We were \n\t\tmatched up, you know. The families \n\t\tkind of agreed on it. I was brought \n\t\tover to her by my mother and father. \n\t\tThat's how I met her. She's some \n\t\tkind of tenth cousin. She's all \n\t\tright. She's quiet. I kissed her a \n\t\tcouple of times. She just sat there \n\t\tand I kissed her. I think she \n\t\texpected more. She even asked me \n\t\tthat. She said to me: \"Are you \n\t\tafraid of me?\" I really don't go out \n\t\twith women much. You know. Don't \n\t\ttell nobody this, Charlie, but you \n\t\taren't going to believe this, but I \n\t\tnever ... I mean, you wouldn't \n\t\tbelieve that a guy of my age, I \n\t\tnever ... Don't tell anybody I ever \n\t\ttold you this, but I never-- I mean, \n\t\tCharlie, she's a widow. She's been \n\t\tmarried already -- she's going to \n\t\texpect a lot -- and I never ---- \n\t\tWhat do you think I ought to do?\n \n\t\t\t\tCHARLIE\n\t\tWhat do you mean, Arnold?\n \n\t\t\t\tARNOLD\n\t\tI mean, you think I ought to marry \n\t\ther?\n \n\t\t\t\tCHARLIE\n\t\tWell, Arnold, even if I knew the \n\t\tgirl, I wouldn't answer that \n\t\tquestion. I may not like her, but \n\t\tshe may be fine for you.\n \n\t\t\t\tARNOLD\n\t\tBecause I'm thinking of calling the \n\t\twhole thing off.\n \n\t\t\t\tCHARLIE\n\t\tIt's kind of late for that, isn't \n\t\tit?\n \n\t\t\t\tARNOLD\n\t\tI'm scared stiff, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tWhat are you scared about?\n \n\t\t\t\tARNOLD\n\t\tI'm not much of a talker, and she's \n\t\tone of those quiet ones. What are \n\t\tyou supposed to do with your wife? \n\t\tI mean, most of the time.\n \n\t\t\t\tCHARLIE\n\t\t\t(has to think) \n\t\tMost of the time, Arnold, you don't \n\t\teven see her. You're away working. \n\t\tYou come home, she fixes you supper. \n\t\tThen one of you washes the dishes. \n\t\tThen if you're not tired, you can go \n\t\tto the movies or visit somebody. Or \n\t\tyou watch teevee.\n \n\t\t\t\tARNOLD\n\t\tI do that now with my mother. \n\n\tThis gives Charlie pause.\n \n\t\t\t\tCHARLIE\n\t\t\t(scowling) \n\t\tI don't know what there is to \n\t\tmarriage. I suppose it's to have \n\t\tkids.\n \n\t\t\t\tARNOLD\n\t\tSo what do you think I ought to do? \n\t\tYou think I ought to go through with \n\t\tthis marriage?\n \n\t\t\t\tCHARLIE\n\t\t\t(angry) \n\t\tArnold, I can't answer that! \n\n\tHe stands abruptly.\n\n\t\t\t\t\t\tDISSOLVE TO:\n\n  \n\tEXTERIOR. STREET -- NIGHT\n\tOur four amble along Washington Square North, headed west. \n\tIn the background, the high apartment houses. It is about \n\tmidnight now, and there are a number of people around, and \n\tthere are lots of lights in the windows. There is still the \n\tfeeling of life. However, some of the wind has gone out of \n\tour bachelor party since we last saw them carousing on \n\tLexington Avenue. Now, of course, there are only four of \n\tthem, and there is somewhat a feeling of straggling about \n\tthem.\n \n\tEXTERIOR. STREET -- NIGHT\n\tThe four men straggle along Tenth Street east of Seventh \n\tAvenue. This is a dark little street. Off at the \n\tintersection, you can see Seventh Avenue and an occasional \n\tcar moving downtown, but West Tenth Street right now seems \n\tan empty, sleeping street of dark and old little apartment \n\thouses. The houses sometimes have little stoops. On one of \n\tthe stoops, there is a woman sitting. She is in her thirties, \n\tnot attractive nor unattractive. She wears a light summer \n\tfrock, and she has one shoe off, and she is toying with the \n\tidea of pushing the other one off too. As the four men \n\tapproach her, she looks up, half quizzically, half \n\tquestioningly. The four men note her in passing and seem to \n\tcontinue on, but then come to a dragging halt about ten \n\tpaces down.\n \n\tCLOSE GROUP SHOT OF THE FOUR MEN.\n \n\t\t\t\tEDDIE\n\t\tI think we've got one for you, \n\t\tArnold.\n \n\t\t\t\tARNOLD\n\t\tOne what?\n \n\tEddie looks back to the woman on the stoop. They all turn to \n\tlook. Actually, Charlie has ambled a few paces even further \n\tdown and doesn't know quite why they've stopped. They look \n\tat the woman; the woman looks at them a little warily. Rest \n\tof the scene from her point of view.\n \n\t\t\t\tARNOLD\n\t\tAh, come on, Eddie.\n \n\t\t\t\tEDDIE\n\t\tShe ain't bad.\n \n\t\t\t\tCHARLIE\n\t\t\t(calling from a \n\t\t\tfew paces down) \n\t\tWhat's the matter?\n \n\t\t\t\tEDDIE\n\t\tWe've got a live one.\n \n\t\t\t\tARNOLD\n\t\t\t(starting to walk) \n\t\tCome on, let's go.\n\n\t\t\t\tEDDIE\n\t\tArnold, for Pete's sake.\n \n\t\t\t\tCHARLIE\n\t\tAh, leave him alone! He doesn't want \n\t\tto.\n \n\t\t\t\tEDDIE\n\t\tCome on. We've been walking around \n\t\tall night here -- are you a man, or \n\t\tain't you? \n\n\tArnold frowns.\n \n\t\t\t\tARNOLD\n\t\tAll right, all right.\n \n\tWith a scowl, he assumes the responsibility of being a man. \n\tThe four men, Charlie bringing up the rear, move down toward \n\tThe Woman, who now looks down at her feet and begins wiggling \n\ther bare foot back into the unused shoe.\n \n\t\t\t\tTHE WOMAN\n\t\t\t(not looking up) \n\t\tI don't know who you fellows think \n\t\tI am, but you fellows have the \n\t\twrong idea about me.\n \n\t\t\t\tEDDIE\n\t\tYeah, I know. Arnold, see that bar \n\t\tdown the corner. That's where we'll \n\t\tbe.\n \n\t\t\t\tTHE WOMAN \n\t\tI'm afraid you fellows have the \n\t\twrong idea about me.\n\n\t\t\t\tARNOLD\n\t\tShe says we have the wrong idea.\n \n\t\t\t\tCHARLIE\n\t\tAh, leave him alone.\n\n\t\t\t\tTHE WOMAN \n\t\tYou fellows are working under a \n\t\tmisconception. \n\n\tEddie and Walter have already started down the street to \n\tthe bar.\n \n\t\t\t\tEDDIE\n\t\tWe'll be in the bar, Arnold.\n \n\t\t\t\tCHARLIE\n\t\tYou all right, Arnold?\n \n\t\t\t\tARNOLD\n\t\tYeah, I'm all right, it's just ...\n \n\t\t\t\tTHE WOMAN \n\t\tLook, I'm just sitting here, fellows. \n\t\tDid I say anything? I was just \n\t\tsitting here.\n \n\t\t\t\tARNOLD\n\t\tYou want to come with me, Charlie?\n \n\t\t\t\tCHARLIE\n\t\tNo, Arnold.\n \n\tCharlie scowls at the suggestion, but there is something \n\tpleading in Arnold's face.\n \n\t\t\t\tCHARLIE\n\t\tYou want me to? All right. I'll go \n\t\tup with you.\n \n\t\t\t\tEDDIE\n\t\t\t(from halfway down \n\t\t\tthe street) \n\t\tWhere you going, Charlie?\n \n\t\t\t\tCHARLIE\n\t\tI'll go up with him. Moral support.\n \n\t\t\t\tEDDIE\n\t\tWhat the---- we'll all go with you. \n\n\tCharlie waves him away.\n\n\t\t\t\tEDDIE\n\t\t\t(walks back to fellows) \n\t\tWe'll be down at the bar.\n \n\tCharlie nods. Arnold looks briefly at The Woman and then \n\taway again.\n \n\tShe turns and goes up the steps into the building, her \n\tleather heels clicking on the stone steps. Arnold, head \n\tdown, and Charlie, a little sheepishly, follow her.\n \n\tINTERIOR. THE HOUSE\n\tA dark, ill-lit hallway. A flight of stairs going up, wooden \n\trailings, worn carpeting. The Woman starts up the stairs, \n\tthe two men following her.\n \n\t\t\t\tTHE WOMAN \n\t\t\t(as she goes) \n\t\tSsshhh....\n \n\tArnold, wetting his lips, nods. The Woman reaches the first \n\tlanding.\n \n\tINTERIOR. LANDING\n\tThe Woman has come around to one of the three doors on the \n\tlanding and is inserting a key into a lock. Arnold and \n\tCharlie appear now at the head of the stairway. The Woman \n\tgoes into her room, leaving the door open. A moment later, \n\ta shaft of light streams out into the landing. For a moment, \n\tnothing happens. Then Arnold and Charlie amble slowly down \n\tthe landing to the open doorway and shaft of light.\n \n\t\t\t\tCHARLIE\n\t\tHey, Arnold, you don't have to go \n\t\tthrough with this.\n \n\t\t\t\tARNOLD\n\t\tI think I should.\n \n\t\t\t\tCHARLIE\n\t\tI'll wait out here for you, okay?\n \n\tArnold nods and goes into the room. He closes the door. \n\tCharlie takes out a cigarette and lights it and inhales \n\tdeeply. He feels a little sordid. There is the sound of \n\tsteps, muffled by the carpeting, coming down the stairs. A \n\tman appears coming down from the floor above. He gives \n\tCharlie a quick look and continues on down the landing to \n\tthe stairs and down again. Charlie scowls at the floor. He \n\tsmokes his cigarette.\n \n\tINTERIOR. THE WOMAN'S ROOM\n\tIt is a furnished room for which the woman pays eleven \n\tdollars a week. It is not particularly unkempt or tarty. \n\tThere is a print slipcover on the soft chair and flowers on \n\tan end table. There is a studio couch with a neat spread and \n\tthrow pillows on it. The Woman stands expressionlessly in \n\tfront of the old chest of drawers. She has kicked off one \n\tshoe and she is now kicking off the other. She starts to say \n\tsomething:\n \n\t\t\t\tTHE WOMAN\n\t\tListen, I don't want you to think I \n\t\tdon't have a job. I got a job. I \n\t\twork.\n \n\tShe stops abruptly as Arnold, who is sitting, eyes averted, \n\ton a straight-back wooden chair, suddenly stands up and \n\tmoves toward the door.\n \n\t\t\t\tTHE WOMAN\n\t\tWhat's the matter?\n \n\tArnold's lips open to form words, but nothing comes out, and \n\the clamps his mouth tight and just stands, miserable and \n\twretched. His hand makes a nervous, spasmodic, involuntary \n\tgesture, and he quickly clenches his fist. Beads of sweat \n\tare on his forehead. \n \n\t\t\t\tTHE WOMAN\n\t\tAre you afraid of me?\n \n\tArnold's head has started to shake nervously, and he opens \n\tthe door and steps out into the landing. The Woman, \n\tbeginning to get angry, follows him.\n \n\tINTERIOR. LANDING\n\tCharlie looks up at the opening of the door and Arnold's \n\tentrance. The Woman stands in the doorway. Arnold moves \n\tquickly past Charlie about halfway down the landing, white-\n\tfaced and trembling.\n \n\t\t\t\tTHE WOMAN\n\t\t\t(getting a \n\t\t\tlittle shrill) \n\t\tWhat's the matter? Hey. Hey, you. \n\t\tHey, you, what's the matter?\n \n\t\t\t\tCHARLIE\n\t\tLet's go.\n\t\t\t(to The Woman) \n\t\tWhat's the trouble?\n \n\t\t\t\tTHE WOMAN\n\t\tI don't know. Ask him. What's the \n\t\tmatter? Hey, you. You, what's the \n\t\tmatter?\n \n\t\t\t\tCHARLIE\n\t\tGo back inside.... All right, all \n\t\tright.\n \n\t\t\t\tTHE WOMAN\n\t\tHow about that, huh?\n \n\tShe turns angrily, goes back into her room (ad libbing as \n\tshe crosses) and slams the door. Charlie moves down the \n\tlanding to Arnold, who looks at him wide-eyed, almost in \n\tterror.\n \n\t\t\t\tCHARLIE\n\t\tWhat happened, Arnold?\n \n\t\t\t\tARNOLD\n\t\tI don't know. I'm just scared.\n \n\t\t\t\tCHARLIE\n\t\tYeah, I don't blame you, I'd be \n\t\tscared too like this. I don't know \n\t\twhy we dragged you up here in the \n\t\tfirst place. It's a barbaric custom. \n\t\tCome on.\n \n\tHe has taken Arnold's arm and would lead him down the \n\tstairs, but Arnold pauses again at the first step.\n \n\t\t\t\tARNOLD\n\t\tDon't tell Eddie.\n \n\t\t\t\tCHARLIE\n\t\tNo I won't, Arnold.\n \n\t\t\t\tARNOLD\n\t\tWhy don't we just sit here for ten\n\t\tminutes or so? \n\n\tCharlie frowns, then shrugs.\n \n\t\t\t\tCHARLIE\n\t\tAll right, Arnold.\n \n\tThey both sit slowly on the steps. Arnold is still trembling \n\tfrom the whole terrifying experience.\n \n\t\t\t\tARNOLD\n\t\tDon't ever tell anybody.\n \n\t\t\t\tCHARLIE\n\t\tIt's nothing to be ashamed of.\n \n\t\t\t\tARNOLD\n\t\tPlease, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tI won't tell anybody.\n \n\tA man's voice suddenly calls down from an upper floor.\n \n\t\t\t\tMAN'S VOICE\n\t\tAnything wrong down there? \n \n\t\t\t\tCHARLIE\n\t\t\t(calling back) \n\t\tNo. No. Nothing wrong.\n \n\tCharlie sits. CAMERA MOVES UP CLOSER to both men. The whole \n\texperience has depressed Charlie, and it shows on his face.\n \n\tCAMERA PULLS SLOWLY BACK so that we get the small, sordid \n\tfeeling of the two men, somewhat tight, sitting on a dirty \n\till-lit staircase outside a whore's bedroom.\n \n\n\tINTERIOR. CORNER BAR\n\tNeighborhood bar with about ten people in it. Eddie and \n\tWalter are two of them. Eddie is playing on one of those \n\tbowling machines. He seems surly, ill-tempered, restless.\n \n\t\t\t\tEDDIE\n\t\tHey Walter -- you know what we \n\t\tought to do, don't you? We ought to \n\t\tgo to that party. Remember that girl \n\t\tCharlie picked up on Tenth Street?\n \n\tWalter, who is so drunk he is sober, looks up at Eddie with \n\tblurred eyes.\n \n\t\t\t\tWALTER\n\t\tI'm going to die, do you know that?\n \n\t\t\t\tEDDIE\n\t\tNot tonight, Walter. Tonight you're \n\t\tgoing to live. Ah, these things are \n\t\tfixed. \n\t\t\t(crosses to bar) \n\t\tI'm down to my last buck. Got any \n\t\tmoney on you? \n\n\tHe turns as the door to the bar opens and Charlie and Arnold \n\tcome in.\n \n\t\t\t\tEDDIE\n\t\t\t(to Charlie) \n\t\tHey! \n\t\t\t(to Arnold) \n\t\tHow'd it go, lover?\n\t\t\t(Arnold smiles a \n\t\t\tmysterious smile, \n\t\t\tpregnant with \n\t\t\tsensual meaning) \n\t\tHey, Charlie, let's go to this party. \n\t\tIt's only twelve o'clock. Oh, these \n\t\tparties are mad, man. All the women \n\t\twear pajamas, and all the men wear \n\t\tbeards. Everybody sits on the floor. \n\t\tArnold, you got any money? I spent \n\t\tmy last buck on those drinks. How \n\t\tabout you, Charlie?\n \n\t\t\t\tARNOLD\n\t\t\t(assessing his assets) \n\t\tI got a little over a buck.\n \n\t\t\t\tEDDIE\n\t\tWhat are we, all out? So let's go to \n\t\tthis party then. \n\t\t\t(punches Charlie's arm) \n\t\tHey, Charlie, come on.\n \n\t\t\t\tCHARLIE\n\t\t\t(himself sullen and angry)\n\t\tCut it out.\n \n\t\t\t\tEDDIE\n\t\tYou can have that girl you picked up \n\t\ton Tenth Street. Come on.... All \n\t\tright, you married men want to be so \n\t\tmarried that's all right with me. \n\t\tBut I'd like to see some women \n\t\ttonight.\n\t\t\t(punching Charlie's \n\t\t\tarm with more hostility \n\t\t\tthan he knows) \n\t\tCome on.\n \n\t\t\t\tCHARLIE\n\t\tLay off.\n \n\t\t\t\tEDDIE\n\t\tI'd like to see some women tonight, \n\t\tyou know. Do you mind?\n \n\t\t\t\tCHARLIE\n\t\tCut it out, Eddie. You keep punching \n\t\tme, I swear I'm going to belt you \n\t\tone.\n \n\t\t\t\tEDDIE\n\t\tWhat's the matter with you?\n \n\tCharlie is off his seat and ready to belt Eddie one right on \n\tthe spot. There is abruptly the imminent reality of a fist \n\tfight. The two men are just sullen enough. Arnold hurriedly \n\tintercedes.\n \n\t\t\t\tARNOLD\n\t\tAll right, all right, fellows.\n \n\t\t\t\tEDDIE\n\t\tLook, don't get so tough with me, \n\t\tCharlie.\n \n\t\t\t\tARNOLD\n\t\tAll right, all right, come on.\n \n\t\t\t\tCHARLIE\n\t\t\t(angry)\n\t\tI don't want to see any other women!\n \n\t\t\t\tEDDIE\n\t\t\t(just as angry) \n\t\tAll right! Go on home! Who's holding \n\t\tyou?! You want to call it a night? \n\t\tBecause I'm tired of grousing from \n\t\tone bar to another. You guys go home, \n\t\tand I'll go about my merry way. All \n\t\tright? And don't get so tough with \n\t\tme.\n \n\t\t\t\tCHARLIE\n\t\tWell, don't poke me.\n \n\t\t\t\tARNOLD\n\t\t\t(turning Charlie \n\t\t\tback to his seat) \n\t\tCome on, let's go ... gee ...\n \n\tFor a moment, the sudden, thick hostility fills the silence \n\tin the room. Nobody says anything. Walter is soddenly \n\tpreoccupied with his own thoughts. Arnold is shaken from his \n\trecent experience with The Woman and from the flaring of \n\ttempers. Charlie just sits bleakly examining a book of \n\tmatches he is toying with, trying to bring his temper down. \n\tAfter a moment, he mutters:\n \n\t\t\t\tCHARLIE\n\t\t\t(mutters)\n\t\tYou mess around with other women, it \n\t\tkills your wife and it kills your \n\t\tmarriage.\n \n\tEddie suddenly, sulkily strides for the door of the bar.\n \n\t\t\t\tEDDIE\n\t\tAll right, you guys go home, and \n\t\tI'll go on my merry way. \n\t\t\t(gets to the door, \n\t\t\tpauses, then turns, \n\t\t\this sudden hot temper \n\t\t\tgone as quickly as \n\t\t\tit had come) \n\t\tHey, you guys, you guys want to go \n\t\tto a nutty night club, look at the \n\t\tnuts? There's a nutty night club \n\t\tover on Second Avenue. You know \n\t\twhat we can do? Charlie, you live in \n\t\tStuyvesant Town, don't you?\n \n\t\t\t\tCHARLIE\n\t\tYeah.\n \n\t\t\t\tEDDIE\n\t\tYou know what we can do? We'll take \n\t\tthe crosstown. We'll go over to \n\t\tCharlie's house, he'll get some \n\t\tmoney, and we'll go to this nutty \n\t\tnight club. It's right down on \n\t\tSecond Avenue. You got any money \n\t\thome, Charlie?\n \n\t\t\t\tCHARLIE\n\t\tWhat do you say, Arnold? You want to \n\t\tgo? \n\n\tArnold shrugs. Eddie has started for the door already. \n\tCharlie wearily gets off his stool, starts to follow Eddie \n\tout. Walter takes his arm.\n \n\t\t\t\tEDDIE\n\t\tCharlie, get Walter.\n \n\t\t\t\tCHARLIE\n\t\tCome on, Walter....\n \n\tCLOSEUP of Walter\n \n\t\t\t\tWALTER\n\t\tI'm going to die, you know what I \n\t\tmean? \n\n\tThe sad little party files wearily out of the bar, Arnold \n\tpausing at the bar to pay for the drinks.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. FOURTEENTH STREET CROSSTOWN SUBWAY\n \n\tLONG SHOT looking down through the length of one almost \n\tempty car, through the open door at the end of the car, \n\tdown into the next almost empty car. Just a few people \n\triding the subway at this hour, half past eleven on a \n\tweek-day. But down in the second car, we can see our four \n\tcavaliers. Eddie, Arnold, and Charlie are sitting. Our \n\tattention is most caught by Walter, who is heavily drunk and \n\tweaves and lurches up and down the central aisle of the car. \n\tWe cannot hear if he is saying anything.\n \n\tCLOSE SHOT Walter weaving up and down the aisle of the car. \n\tHe stumbles on the toes of a man in a windbreaker, sitting \n\tin the car.\n \n\t\t\t\tWALTER\n\t\t\t(mumbling) \n\t\tExcuse me ... excuse me ...\n\t\t\t(turns his blurred \n\t\t\tattention to Charlie, \n\t\t\twho, alone of the \n\t\t\tthree, seems painfully \n\t\t\tinterested in what \n\t\t\tWalter is talking \n\t\t\tabout) \n\t\tSo what'll I do? I mean, he says, \n\t\tI'm going to die. I mean, the man's \n\t\ta specialist. He says: \"Go to \n\t\tArizona, go to Colorado,\" he says. \n\t\t\"You got to get out of New York or \n\t\tyou're going to die.\" He tells my \n\t\twife, the stupid idiot. My wife \n\t\tcried all night. I'm going to die, \n\t\tyou know that? You understand that? \n\t\tI'm going to die? You know what an \n\t\tasthma attack is like? Your heart \n\t\tstarts beating like a drum! I passed \n\t\tout the last time!\n \n\t\t\t\tCHARLIE\n\t\t\t(deeply compassionate) \n\t\tWalter, why don't you just quit the \n\t\tjob and pack your bags and get out \n\t\tof here?\n \n\tWalter stands in front of Charlie, his lips moving, but no \n\twords coming out for a moment. There are tears in his eyes, \n\tand all the pain and anguish of the man's forty-eight years \n\tare clear on his face.\n \n\t\t\t\tWALTER\n\t\t\t(getting the words out) \n\t\tI can't quit. Don't you understand? \n\t\tYou don't understand. I can't quit! \n\t\tI got a fourteen-year-old girl, I \n\t\tdon't know what time she comes in at \n\t\tnight any more. She's so wild, these \n\t\tkids. I got a nineteen-year-old boy \n\t\tin college; he's going to be a \n\t\tdoctor if I have to die. He's not \n\t\tgoing to quit school. You hear me! \n\t\tI worked hard to put that kid in \n\t\tschool! I don't care if I die! I \n\t\tdon't care! What am I going to do \n\t\tin Arizona? Who wants me? Who's \n\t\tgoing to give me a job? What kind \n\t\tof a job am I going to get? I'm \n\t\tforty-eight years old. They don't \n\t\twant no forty-eight-year-old \n\t\tbookkeeper. They got machines from \n\t\tIBM. You ever been up on the ninth \n\t\tfloor? You ever see all those IBM \n\t\tmachines? What am I going to do out \n\t\tin Arizona? You look in the Help \n\t\tWanted lately? You see any jobs \n\t\tlisted for Bookkeeper, Male? What \n\t\tare you talking about? Do you know \n\t\twhat you're talking about?\n \n\tCharlie reaches up to steady Walter, who has worked himself \n\tup into a lurching fury.\n \n\t\t\t\tCHARLIE\n\t\tEasy, Walter.\n \n\t\t\t\tWALTER\n\t\t\t(flinging Charlie's \n\t\t\thand aside) \n\t\tTake your hand off me. You don't \n\t\tknow nothing! You're just a kid! \n\t\tYou don't know! I've seen death, \n\t\tkid. I've seen it, boy. I know what \n\t\tit looks like.\n\t\t\t(he staggers away a \n\t\t\tfew paces down the \n\t\t\taisle, stumbles over \n\t\t\tthe man's toe again) \n\t\tExcuse me.... Forty-eight years old \n\t\tand so what? What does it mean? What\n\t\thappened? What have I got? What did \n\t\tI make? Who needs me? So this is it. \n\t\tA man's life, nothing. Worry about \n\t\tbeing sick, worry about making money, \n\t\tworry about your wife, worry about \n\t\tyour kids, and you're on your way to \n\t\tthe grave from the day you're born. \n\t\tThe days drag on, and the years fly \n\t\tby, and so what?\n\t\t\t(cries out to \n\t\t\tthe whole world) \n\t\tWhat is it all about? Will you tell \n\t\tme? \n\n\tThe train is slowing up for a station now.\n \n\t\t\t\tWALTER\n\t\tLife is nothing! It's a gag! It's a \n\t\tjoke! It's a mortgage! It's a \n\t\tbankrupt! It's a lot of noise over \n\t\tnothing! Sound and fury! Isn't that \n\t\twhat the man said? What do you \n\t\tthink, I never read a book? I read a \n\t\tbook! Don't worry! I was a bright \n\t\tkid! Everybody thought I was going \n\t\tto be the first Catholic to be \n\t\tPresident! Where did it all go?! \n\n\tHe turns to look at the station they are edging into, the \n\tyellow lights, the dark shadows, the few blurred faces. His \n\tface is wet with the tiny rivulets left by tears. \n \n\t\t\t\tWALTER\n\t\t\t(mumbling)\n\t\tWhere did it all go? \n\n\tThe train stops, the green doors slide open.\n \n\t\t\t\tEDDIE\n\t\t\t(looking out, \n\t\t\tin a low voice) \n\t\tWhere are we, Third Avenue?\n \n\t\t\t\tARNOLD\n\t\t\t(low voice) \n\t\tWhere are we getting off? Next stop?\n \n\t\t\t\tCHARLIE\n\t\t\t(low voice)\n\t\tYeah.\n \n\tA few people come into the car. Walter stands, shoulders \n\thunched and sagging, in front of the open doors.\n \n\t\t\t\tWALTER\n\t\t\t(muttering) \n\t\tI'm going home.\n \n\t\t\t\tCHARLIE\n\t\t\t(looking up) \n\t\tWhat did you say, Walter?\n \n\t\t\t\tWALTER\n\t\tI'm going home.\n \n\tWalter steps out onto the platform. Just in time, because \n\tthe doors are beginning to slide closed again.\n \n\t\t\t\tCHARLIE\n\t\t\t(standing) \n\t\tWalter, where are you going? Come \n\t\there ... \n\n\tOn the platform, Walter has started to weave slowly up the \n\tplatform toward the stairway.\n \n\t\t\t\tEDDIE\n\t\t\t(standing) \n\t\tWhat, did Walter get out?\n\n\t\t\t\tCHARLIE\n\t\t\t(calling through \n\t\t\tthe open window) \n\t\tWalter, stay there, we'll come back \n\t\ton the next train. Stay there.\n \n\tBut Walter has already reached the stairway and, clinging to \n\tthe handrail, has started slowly climbing the steps. The \n\ttrain starts slowly up. Arnold has stood now too. He is \n\tpretty soggy himself.\n \n\t\t\t\tARNOLD\n\t\tPoor Walter, huh?\n \n\t\t\t\tCHARLIE\n\t\t\t(bellowing through \n\t\t\tthe window) \n\t\tWalter! ...\n \n\t\t\t\tEDDIE\n\t\t\t(standing) \n\t\tHe'll be all right, Charlie. God \n\t\tprotects drunks and fools.\n \n\tThe train is sweeping by the stairway now. Charlie bellows \n\tout:\n \n\t\t\t\tCHARLIE\n\t\tWalter! Grab a cab if you're going \n\t\thome! \n\n\tThe train has swept by, and in a moment they have been \n\tplunged into the tunnel of the subway, the bleak dirty white \n\twalls, and the small yellow lights flashing by. Charlie sits \n\tdown, somehow greatly shaken and disturbed.\n \n\t\t\t\tEDDIE\n\t\t\t(sits)\n\t\tPoor Walter, I didn't know he was so \n\t\tsick. I thought there was something \n\t\twrong with him, though. He's been \n\t\tout so much.\n \n\t\t\t\tARNOLD\n\t\t\t(sitting drunkenly down) \n\t\tI didn't know he was so sick. \n\n\tCLOSE IN on Charlie.\n\n\t\t\t\tCHARLIE\n\t\tThat's me in fifteen years.\n \n\tCLOSEUP of Charlie. Hold for a moment.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. FOURTEENTH STREET AND FIRST AVENUE\n\tWe look down at the subway kiosk as our sad little party of \n\tthree comes up the stairs to the sidewalk. It is midnight, \n\tand the street is occasionally patrolled by a taxicab. The \n\tsidewalks are pretty empty, just a few people walking. \n\tPerhaps a drugstore is still open, and its lonely lit store \n\tfront catches the eye.\n \n\tOur three men stand at the head of the stairs at the subway \n\tkiosk, drained, tired, a little despondent. Charlie looks up \n\tat the dim silhouettes of the endless apartment houses of \n\tStuyvesant Town.\n \n\t\t\t\tCHARLIE\n\t\tThat's where I live.\n \n\t\t\t\tEDDIE\n\t\tWhich one?\n \n\t\t\t\tCHARLIE\n\t\tIn the back there. You can't see it \n\t\tfrom here. \n\n\tLONG SHOT of Stuyvesant Town as seen from their point of \n\tview. PAN SLOWLY ACROSS, capturing the silent monotony of \n\tthe dark buildings. Only a few of the windows are still lit.\n \n\t\t\t\tEDDIE\n\t\tIt looks like a state hospital.\n \n\t\t\t\tCHARLIE\n\t\tIt looks like a prison.\n \n\t\t\t\tEDDIE\n\t\tYeah, it does look a little like a \n\t\tprison. \n\n\tThe three men just stand, worn out, tired.\n \n\t\t\t\tCHARLIE\n\t\t\t(suddenly) \n\t\tI'm going home.\n \n\tHe starts to walk to the buildings, across the little street \n\tthat separates the corner of Fourteenth Street and First \n\tAvenue from the parallel corner of the housing project.\n \n\t\t\t\tEDDIE\n\t\t\t(calling after him) \n\t\tHey, Charlie ... \n\n\tCharlie turns.\n \n\t\t\t\tEDDIE\n\t\tHey, Charlie! What about the money? \n\t\tHave you got ten bucks?\n \n\t\t\t\tCHARLIE\n\t\t\t(after a moment) \n\t\tAll right, if you want to walk me to \n\t\tthe house, I'll get you ten bucks.\n \n\tEddie has to take a moment to consider this. Then he \n\tshuffles across the little street toward Charlie. Charlie \n\tdoesn't quite wait for him to catch up when he turns and \n\tleads the way between two cars and up the sidewalk toward \n\tthe promenade that leads to the heart of the project. \n\tArnold, after a moment, follows Eddie. The three men \n\tdisappear single-file into the darkness of Stuyvesant Town.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. LANDING OUTSIDE CHARLIE'S APARTMENT\n\tWe are looking at the twin elevator doors. The light of an \n\televator climbs into the little square window of one of the \n\televator doors. The door opens, and Charlie, Eddie, and \n\tArnold shuffle out into the landing. They are all a little \n\tsoggy.\n \n\t\t\t\tCHARLIE\n\t\t\t(mutters) \n\t\tI'll be right out.\n \n\tHe moves around the turn of the wall, fishes in his pocket \n\tfor the key to his apartment. He finds it, brings it out, \n\topens the door carefully, goes into his apartment.\n \n\tINTERIOR. CHARLIE AND HELEN'S APARTMENT\n\tCharlie comes in. The dining area is lit, and there is the \n\tlamp lit in the living room. As Charlie moves to the living \n\troom, we can see that Helen is seated on the couch, \n\twatching television. The gray-white light of the television \n\tset drifts out into the room. Helen is in her pajamas and \n\tshe has washed for bed; her face is devoid of make-up. She \n\tis half-watching television; the rest of her attention is \n\tdevoted to cutting her fingernails and other aspects of \n\tmanicure. She looks up as Charlie comes into the living \n\troom, smiles.\n \n\t\t\t\tHELEN\n\t\tHiya, have a nice time?\n \n\tCharlie shrugs. He is depressed and can't conceal it.\n \n\t\t\t\tCHARLIE\n\t\tI'm taking ten bucks. A couple of \n\t\tthe guys are waiting outside. I \n\t\tpromised them I'd loan them ten \n\t\tbucks.\n \n\t\t\t\tHELEN\n\t\tSure.\n \n\tHe stands by the couch now, without interest, automatically \n\twatching the television set.\n \n\t\t\t\tCHARLIE\n\t\t\t(looking at the set)\n\t\tTomorrow's payday. I'll get it back \n\t\ttomorrow. \n \n\t\t\t\tHELEN\n\t\tIt's in the drawer.\n \n\tA kind of ennui has engulfed him. He stands, watching the \n\ttelevision set out of which is now pouring the end of an \n\tanimated cartoon commercial. Then the familiar tinkling \n\tmusic sets in, the inscription, \"The Late Show\" appears on \n\tthe screen, and the announcer's voice informs us that we are \n\tnow going back to the late show, starring Rex Harrison in \n\t\"Strictly Dishonorable.\" The whole thing brings a wince of \n\tpain to Charlie's face, and he turns and moves wearily \n\tthrough the little foyer into the darkened bedroom. Enough \n\tlight flows in from the other rooms to show Charlie going to \n\tthe drawer in the chest of drawers and taking out a \n\tten-dollar bill. He returns the other bills, closes the \n\tdrawer and just stands there, suddenly so weak and exhausted \n\tthat he has to steady himself with one hand on the chest of \n\tdrawers.\n \n\tBack in the living room, Helen still sits, a slight frown \n\tnow indicating she is sensitive to the deeply depressed mood \n\ther husband is in. She continues with her nails for a moment. \n\tThen, wondering what is keeping her husband, she stands and \n\tgoes to the bedroom doorway and looks in.\n \n\tINTERIOR. THE BEDROOM\n\tCharlie is seated on the bed, hunched, in deep depression. \n\tHe is holding the ten-dollar bill. His eyes are open, but \n\tthere is a feeling of hurt and pain on his face. Helen moves \n\tquietly into the bedroom and sits down on the bed beside him.\n \n\t\t\t\tHELEN\n\t\tWhat's the matter, Charlie? \n\n\n\tHe shrugs, even smiles briefly. \n \n\t\t\t\tCHARLIE\n\t\tI don't know.\n \n\tShe puts out her hand as if to take his head and press it \n\tagainst her, but he takes her in his arms almost desperately, \n\tand they lie back on the bed, clutching each other, their \n\tfaces pressed against each other, seeking some kind of\n\tstrength just from the sheer physical closeness of each \n\tother.\n \n\t\t\t\tHELEN\n\t\tIt's not so bad, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tI know. I know.\n \n\tThey lie quietly, even stiffly, holding each other.\n \n\t\t\t\tCHARLIE\n\t\t\t(eyes wide open \n\t\t\tbut unseeing) \n\t\tI don't know what's the matter with \n\t\tme, I keep getting so depressed. I'm \n\t\tgoing to quit night school, Helen. \n\t\tMy nerves are shot.\n \n\tHe releases himself from his wife's embrace and sits up.\n \n\t\t\t\tCHARLIE\n\t\tThose guys are waiting outside. I \n\t\tbetter give them their money.\n \n\tHe stands and starts out the bedroom.\n \n\t\t\t\tHELEN\n\t\tCharlie ... Maybe I shouldn't have \n\t\tthe baby?\n \n\t\t\t\tCHARLIE\n\t\tWhat do you mean? ...\n \n\tShe doesn't answer. She doesn't have to. They both know what \n\tshe means.\n \n\t\t\t\tCHARLIE\n\t\tIsn't that dangerous? ... Well, I \n\t\tdon't know ... maybe ... Well, you \n\t\tbrought it up. \n\n\t\t\t\tHELEN\n\t\t\t(shocked -- after \n\t\t\ta moment) \n\t\tYou really don't want this baby....\n \n\tShe turns away on the bed to hide the sudden flush of tears.\n \n\t\t\t\tHELEN\n\t\tYou're my husband, Charlie. This is \n\t\tyour baby too. That doesn't mean \n\t\tanything to you. For the first time \n\t\tin our marriage I feel I can't \n\t\tdepend on you, Charlie -- I'm not \n\t\timportant to you.\n\t\t\t(she has to stop \n\t\t\tbecause she can no \n\t\t\tlonger trust her \n\t\t\tvoice. After a \n\t\t\tmoment she continues) \n\t\tI could make my life sound hard, too, \n\t\tCharlie. I work all day, I rush home, \n\t\tI make you dinner. I sit home alone \n\t\tfour nights a week, I'm even alone \n\t\twhen you're here because when do I \n\t\tsee you? But it was easy for me \n\t\tbecause I loved you. Do you think I \n\t\tcare whether you're an accountant or \n\t\ta ditch digger, or even out of work? \n\t\tAll I ever wanted was you. And this \n\t\tbaby because it's you, too.\n \n\tShe closes her eyes again to hide the warm flow of tears in \n\ther eyes and stops talking rather than cry. Charlie sits, \n\tunmoved and wretched, his shoulders hunched, his head \n\tslumped forward. After a moment, he turns and reaches \n\tforward, quite frightened, to touch her arm.\n \n\t\t\t\tHELEN\n\t\t\t(dully) \n\t\tLeave me alone, Charlie.\n \n\tHe stands and goes to the bedroom window and looks out. \n\tHelen turns on her side so that her back is to him. At the \n\tsound of her moving, Charlie turns his head, but sensing the \n\trejection in her back, he turns back and looks out the \n\twindow again. The silence is thick between them.\n \n\t\t\t\tCHARLIE\n\t\t\t(looking out \n\t\t\tthe window) \n\t\tI decided I'd quit school and ...\n \n\t\t\t\tHELEN\n\t\tI don't care ...\n \n\t\t\t\tCHARLIE\n\t\tI decided I'd quit school and come \n\t\thome in the evenings like everybody \n\t\telse and live a normal life.\n \n\t\t\t\tHELEN\n\t\t\t(staring at the \n\t\t\twall ahead of her) \n\t\tI don't care what you do, Charlie. \n\n\tHe stands another moment.\n \n\t\t\t\tCHARLIE\n\t\tI don't care what I do either.\n \n\tHelen neither moves nor makes a response. Charlie goes on \n\tinto the living room and shuffles to the front door, his \n\tlong body heavy with pain and guilt and dense, unknown \n\tterrors. He opens the door and goes out onto the landing.\n \n\tINTERIOR. LANDING\n\tEddie and Arnold, looking up as the door opens and Charlie \n\tcomes out.\n \n\t\t\t\tEDDIE\n\t\tWhat took you so long? What did you \n\t\tdo, blow open the safe?\n \n\t\t\t\tCHARLIE\n\t\t\t(giving Eddie the \n\t\t\tten-dollar bill) \n\t\tHere.\n \n\t\t\t\tEDDIE\n\t\t\t(taking it)\n\t\tI'll give it to you tomorrow. I'll \n\t\tsee you in the morning, Charlie.\n\n\t\t\t\tCHARLIE\n\t\tI'll see you.\n \n\tEddie takes Arnold's arm and guides him back around the turn \n\tof the wall to the elevators. Charlie follows a few paces \n\tbehind. Eddie pushes both elevator buttons. Charlie nods, \n\tlooks down at the tiling at his feet, fairly sick within \n\thimself, oppressed and guilty. The light in the elevator \n\twindow shows, and Eddie opens the door.\n \n\t\t\t\tCHARLIE\n\t\tWait a minute. I'll go with you.\n \n\t\t\t\tEDDIE\n\t\tLet's go to that party -- we'll \n\t\thave a ball!\n \n\tCharlie shuffles the few paces forward and follows Eddie and \n\tArnold into the elevator. The door closes, and, a moment \n\tlater, the light of the elevator cage disappears downward.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. GREENWICH VILLAGE DUPLEX APARTMENT\n\tThis is one of those duplex apartments on West Tenth Street \n\twhich consists of one huge living room that is two stories \n\thigh and you need a little rolling stepladder to reach the \n\tbooks on the upper shelves of the built-in bookcases. There \n\tis a little wrought-iron stairway that leads to the second \n\tfloor, which consists of two tiny little bedrooms. \n\n\tApartments like these, as is the case in this one, are \n\tusually lived in by two girls, one of whom is a secretary in \n\tan advertising agency and the other a model for a garment \n\tmanufacturing firm. Both girls are in their early thirties \n\tand are milling about somewhere in the mass of people in the \n\tliving room, carrying drinks, laughing up a storm, pausing \n\tat the little knots of discussion groups with an apt phrase. \n\tThey rather think of themselves as Madame de Staëls with \n\ttheir own salon of bright young people, for most of the men \n\tand women at the party are in some way connected with the \n\tarts, probably in an avant garde way. It is a little \n\tdifficult to tell this by looking at them because avant \n\tgarde artists have become obsessed with dressing like \n\tbusinessmen, but if you can hear the talk as we can, you get \n\tthe point fast enough. We pick up phrases like: \"I really \n\tfind it difficult to think of Tennessee Williams as a \n\tserious artist,\" or \"My teacher thinks all tenors are frogs \n\texcept Gigli,\" or \"I don't see how you can say that; his \n\tdesigns fairly throb with sex.\" There are, as Eddie \n\tpredicted, a number of people sitting on the floor, mostly \n\tgirls, circled in the swirl of their Ann Fogarty dresses, \n\tand there is one obvious ballerina, with her black hair \n\tpulled tightly back into a severe pony tail, using the \n\twrought-iron railing that separates the dropped living room \n\tfrom the small entrance foyer to demonstrate something about \n\tpositions at the dancing bar. There is someone at the piano \n\tbanging away, shouting his songs, but he is completely \n\tinaudible five feet away. A few people lean over the piano, \n\tapparently exhilarated by the songs. Thin blankets of smoke \n\twreathe their way up to the two-story-high ceiling. We catch \n\tsome more phrases: \"I thought Truman Capote was supposed to \n\tbe here.\" -- \"Truman's in Russia, I think.\" -- \"Good \n\theavens, what can the Russians want with Truman Capote?\" -- \n\t\"Oh, I never read anything published in this country.\" \"Oh, \n\tI mean, the paper-bound Paris edition.\" In short, this is a \n\treal chi-chi wingding where all the furniture is too low, \n\tand the hostess is very proud of the fact that her end table \n\tis made out of an orange crate.\n\n\tSomewhere, through the jumble of the party, we can hear the \n\tdoorbell chime. A young woman, at one of the little knots of \n\tpeople, perks her ears and says: \n\n\t\t\t\tHOSTESS\n\t\tI'm sure that's the police again.\n \n\tShe's very proud of this. She turns and weaves her way \n\tthrough the crowded room, carrying her drink. She goes up \n\tthe step to the entrance foyer, turns to her left, picks her \n\tway over two middle-aged men who are both throwing a pitch \n\tat a fairly tight girl of eighteen, past the kitchen, which \n\tis a bedlam of ice cubes and kitchen towels and which is \n\toccupied at the moment by two intense women in their late \n\tthirties wrapped in deep discussion, up past two young men \n\twho have no immediate use for girls, to the front door of \n\tthe apartment. She opens the door.\n \n\tGROUP SHOT of Eddie, Arnold, and Charlie from the Hostess's \n\tpoint of view. Not exactly a heartening sight to most \n\thostesses, three fairly loaded young men with their collars \n\tunbuttoned and their ties limp and dangling.\n \n\t\t\t\tHOSTESS\n\t\t\t(beaming) \n\t\tAre you coming to complain about the \n\t\tnoise?\n \n\t\t\t\tEDDIE\n\t\tDo we look like complainers?\n \n\t\t\t\tHOSTESS \n\t\tI don't know who you are, but come \n\t\tin, come in. I don't know half the \n\t\tpeople who are here tonight. \n\n\tThey enter a little warily and ill-at-ease, peering into the \n\tjammed room.\n \n\t\t\t\tHOSTESS\n\t\tThe police have been here twice. The \n\t\tfirst fellow was just adorable. We \n\t\tgave him a drink, and he's upstairs \n\t\tin a bedroom now, for all I know.\n \n\t\t\t\tEDDIE\n\t\tIs that right?\n\n\t\t\t\tHOSTESS\n\t\tIf you want something to drink, \n\t\tyou'll just have to go into the \n\t\tkitchen and get it yourself. The \n\t\tplace is just mad. Do you write, \n\t\tpaint or sing?\n \n\tEddie spreads his arms in all-inclusive expansiveness.\n \n\t\t\t\tEDDIE\n\t\tEverything.\n \n\tBut the hostess has already bent to chat with two women, one \n\told, one young, sitting on the floor. Our three cavaliers \n\tlook at each other and then look out over the wild, jumbled \n\troom.\n \n\t\t\t\tCHARLIE\n\t\tBoy, do you get invited to a party \n\t\tlike this or do you get committed?\n \n\tA passing young man who overhears this, pokes his head into \n\tthe group and says to Charlie with a flashing smile:\n \n\t\t\t\tYOUNG CHAP\n\t\tI heard that. It's awfully funny. \n\n\tCharlie regards the smiling young chap.\n \n\t\t\t\tEDDIE\n\t\tBeat it.\n \n\tThe chap's smile flashes off and he scurries away. Eddie \n\trubs his palms and surveys the women in the crowded room \n\twith a measuring eye.\n \n\t\t\t\tEDDIE\n\t\tThis is going to be like shooting \n\t\tducks. Pick out your duck, men.\n \n\tWetting his lips, he starts out for some girl he has decided \n\ton across the room.\n \n\tINTERIOR. GREENWICH VILLAGE APARTMENT -- HALF HOUR LATER \n\n\tHIGH SHOT showing progress of party, still crowded, still \n\thigh. If we look sharp we can see Charlie seated on the \n\tfloor in the rear of the shot, his back against the wall.\n \n\tCLOSER SHOT of Charlie sitting morosely, back against the \n\twall, regarding his drink with sodden eyes. The chatter of \n\tthe party, an occasional shrill laugh.\n\n\tFULL SHOT of Eddie coming out of the kitchen, carrying two \n\tdrinks. He picks his way through the people to the living \n\troom with the general intention of getting to the \n\tarrangement of divans around the coffee table, when he spots \n\tCharlie and moves across to him.\n \n\t\t\t\tEDDIE\n\t\tHey, what's the matter, Charlie? \n\t\t\t(squats down \n\t\t\tbeside Charlie)\n \n\t\t\t\tCHARLIE\n\t\t\t(without looking up) \n\t\tLet's get out of here, Eddie.\n \n\t\t\t\tEDDIE\n\t\tThe last time I saw you, you was \n\t\twith that girl you picked up. What \n\t\thappened?\n \n\t\t\t\tCHARLIE\n\t\tShe's over there talking to that \n\t\told guy with the glasses. \n\n\tTheir point of view, The Existentialist on steps with \n\tlandlord.\n \n\t\t\t\tCHARLIE\n\t\tI didn't like her. She's one of \n\t\tthese real Greenwich Village phonies. \n\t\tIf I added up all the guys she told \n\t\tme about, she must have had her \n\t\tfirst boy friend when she was two \n\t\tyears old. Where are you going, \n\t\tEddie. Stick around a minute.\n \n\t\t\t\tEDDIE\n\t\t\t(who has stood) \n\t\tI'm with that one over there -- not \n\t\tbad, huh? I think she's a Communist. \n\t\tI think she's trying to talk me into \n\t\tjoining the Party.\n \n\t\t\t\tCHARLIE\n\t\tHow are you making out?\n \n\t\t\t\tEDDIE\n\t\tNot so hot. I may have to join.\n \n\t\t\t\tCHARLIE\n\t\tHang around. Let's talk a bit.\n \n\t\t\t\tEDDIE\n\t\tI better get back. She's liable to \n\t\trecruit somebody else.\n \n\t\t\t\tCHARLIE\n\t\tWhere's Arnold?\n \n\t\t\t\tEDDIE\n\t\tHe's in the kitchen. I think he's \n\t\tout cold. I'll see you. \n\n\tCharlie nods as Eddie moves off. He returns his morose \n\tattention back to his glass of liquor. Then his eyes close, \n\tand his face, though impassive, shows pain. After a moment, \n\the opens his eyes and slowly clambers to his feet and makes \n\this way, a little unsteadily, through the living room in the \n\tdirection of the kitchen. In the background we can hear the \n\tpiano and somebody singing indistinguishable lyrics. Charlie \n\tgets to the kitchen door and looks in. Arnold is at the tiny \n\tkitchen table, head on the table, out cold. The kitchen is \n\tin a state of havoc.\n \n\t\t\t\tCHARLIE\n\t\tHey Arnold-- You okay, Arnold? \n\n\tArnold makes no answer. Charlie regards his prostrated \n\tfriend expressionlessly for a moment. Then turns and \n\tshuffles aimlessly back to the group around the piano in the \n\tliving room. He looks over to the stairway again. The \n\tExistentialist is alone now, The Landlord having gone for \n\tthe moment. She is looking at Charlie, and he drops his eyes. \n\tHe turns away from the piano and moves out a few steps into \n\tthe middle of the living room. He moves to the stairway. \n\tThe Existentialist looks up at him as he approaches, Charlie \n\tkind of nods to her, and, for a moment, she just sits and he \n\tjust stands. Then ...\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tThat old man I was talking to before? \n\t\tThat's my landlord. About ten thirty \n\t\tlast night, someone began pounding on \n\t\tmy door. So I got up and opened the \n\t\tdoor, and there was this white-haired \n\t\tman with  a pince-nez standing there. \n\t\tI said: \"What do you want?\" So he \n\t\tsaid: \"I'm the landlord, and I want \n\t\tthe rent.\" Well, I just looked at him \n\t\tbecause the landlord I knew was a \n\t\tHungarian man named Frank, who was \n\t\tcrazy about me, and the issue of rent \n\t\tnever came up, you see. Well, it \n\t\tturned out that this man with the \n\t\tpince-nez had just bought the \n\t\tbuilding the day before and he kept \n\t\tgrabbing my arm and saying he wanted \n\t\tthe rent. Well, then I got the point, \n\t\tof course. Well, meanwhile, a boy \n\t\tnamed Bob I knew had come over. He's \n\t\tengaged to a Javanese girl with \n\t\twonderful planes in her face who \n\t\tlives at the International House. \n\t\tBut he's crazy about me and he drops \n\t\tin about twice a week. Well, \n\t\tmeanwhile, my new landlord was \n\t\tgrabbing my arm and kept quoting \n\t\tpoetry to me which he was trying to \n\t\tpass off as his own. He was an \n\t\tabsolute fraud. He scotched the \n\t\twhole thing from Baudelaire. \"Tu \n\t\tmettrais.\" You know that one. Well, \n\t\the kept screaming about the rent -- \n\t\tI didn't like him, you know -- and I \n\t\tcalled this boy named George who \n\t\tused to live in Poughkeepsie when I \n\t\twas going to Vassar, and he's crazy \n\t\tabout me. He lives in St. Luke's \n\t\tplace now, but he goes to \n\t\tPoughkeepsie every Wednesday to see \n\t\this mother, he's got an Oedipus, so \n\t\tthat was out. Well, my new landlord \n\t\tkept telling me how much he was in \n\t\tlove with me. I said: \"How \n\t\texistentialist can you get? You just \n\t\tmet me five minutes ago.\" He was \n\t\tabsolutely crazy about me.\n \n\tCharlie has been sort of half-listening to all this. His \n\tattention, if any at all, has been vaguely given to the \n\tgirl's bare arms, the lines of her body. \n\n\t\t\t\tCHARLIE\n\t\t\t(resigned) \n\t\tYou have an apartment around here \n\t\tsomewheres? \n\t\t\t(looks up to \n\t\t\tsecond floor) \n\t\tWhat's up there? What kind of rooms \n\t\tare up there?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tSo, I finally got to sleep around \n\t\tsix thirty.... \n\n\tCharlie bends down to her, takes her arm.\n \n\t\t\t\tCHARLIE\n\t\tCome on, let's go. \n\n\t\t\t\tTHE EXISTENTIALIST\n\t\t\t(wrenching her \n\t\t\tarm away) \n\t\tNo! Oh, stop trying to be so \n\t\tprimitive. \n\n\tCharlie straightens with an irritated sigh.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tI find you very unpleasant. \n\n\tHe stands, she sits in sullen silence.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tThere's nothing upstairs. \n\t\t\t(suddenly rises, \n\t\t\tmumbles) \n\t\tOh, I don't care.\n \n\tShe starts up the stairs, Charlie following close behind her. \n\tThey pick their way past the other people sitting on the \n\tstairs to the second-floor landing. They walk in hostile \n\tsilence down the landing to the bedroom door, which she \n\topens.\n \n\tINTERIOR. THE BEDROOM\n\tIt is a tiny bedroom. The bed is covered with purses and \n\tsummer stoles and other guest things. An uncovered, \n\timprovised closet, really a rack of hanging dresses and \n\tthings, gives the room an overburdened look. Charlie comes \n\tinto the room after her, closes the door, looks for the \n\tlatch. She pushes some of the things on the bed aside and \n\tsits down and waits while Charlie latches the door, a matter \n\tof turning a bent nail into locking position. She begins to \n\tprattle again.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tSo I finally got to sleep around six \n\t\tthirty this morning. At nine thirty, \n\t\tsomeone began pounding on my door \n\t\tagain. I got out of bed and opened \n\t\tthe door, and there was my landlord \n\t\twith the pince-nez wearing a blue \n\t\tsilk kimono. \"Oh, for heaven's \n\t\tsakes,\" I said, \"what do you want \n\t\tnow?\" He said: \"I'm the landlord, \n\t\tand I want the rent.\" I said: \n\t\t\"You're an old man, go to sleep.\" \n\t\tThen the phone rang. It was a boy \n\t\tnamed Andrew I know who teaches \n\t\tphysics at Columbia University, and \n\t\the's insanely jealous. He's married \n\t\tand has four children, but he keeps \n\t\tbadgering me to run away with him to \n\t\tNicaragua, throw up his professorship \n\t\tand all that. Well, my landlord began \n\t\tshouting some garbled Baudelaire at \n\t\tthe top of his lungs, and a little \n\t\tVerlaine, and a little Huysmans. He \n\t\tapparently has some kind of fetish \n\t\tabout French decadents. And \n\t\tnaturally, Andrew heard him, and he \n\t\tgot furious, and he said: \"Who's that \n\t\tI hear?\" I said, \"That's the \n\t\tlandlord.\" He said: \"What does he \n\t\twant?\" I said: \"He wants the rent.\" \n\t\tWell, at this point, I felt like \n\t\tchucking the whole business and \n\t\tgoing back to Bessemer City and \n\t\tgoing to work in my father's \n\t\thardware store.\n \n\tCharlie has stood a moment, listening to this bizarre story. \n\tThen he has busied himself cleaning a place beside The \n\tExistentialist on the bed. He brings an end to the rococo \n\tnarration by putting his arms around The Existentialist and \n\tin a moment, she responds hungrily.\n \n\tCLOSEUP of Charlie and The Existentialist in a desperate \n\tembrace.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\t\t(muttering) \n\t\tJust say you love me.\n \n\t\t\t\tCHARLIE\n\t\tWhat?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tJust say you love me. You don't have \n\t\tto mean it. \n\n\tHe tries to kiss her again, himself charged high at the \n\tmoment, but she turns her face away from him. The dialogue \n\tis intense, whispered, hungry.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tNo, don't. ...\n \n\t\t\t\tCHARLIE\n\t\tWhat's the matter?\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tSay you love me....\n \n\t\t\t\tCHARLIE\n\t\tCome on.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tSay you love me....\n \n\t\t\t\tCHARLIE\n\t\tCome on....\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tNo ...\n \n\t\t\t\tCHARLIE\n\t\tI love you! I love you!\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\t\t(content)\n\t\tLook, maybe we ought to go someplace\n\t\telse? I'm having a very tricky thing \n\t\tgoing with my landlord and I don't \n\t\twant him to see us leaving together. \n\t\tSo you know what you do? There's a \n\t\tbar down the street. You go out the \n\t\tdoor and turn to your right. You \n\t\tknow the one I mean?  \n \n\t\t\t\tCHARLIE\n\t\tYes, I know.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tWell, you go there and I'll be there \n\t\tas fast as I can. Now, wait for me \n\t\tnow, because I can't stand being \n\t\talone at night. You'll like me. I'm \n\t\tsupposed to be very amusing. All \n\t\tright?\n \n\tShe turns abruptly and goes out the door. He stands for a \n\tmoment and then follows. He stands on the upper landing, \n\twatching her pick her way down the stairs into the living \n\troom.\n \n\tShe looks quickly around the room, apparently finds whom she \n\tis looking for, and moves quickly to a little group of men, \n\tone of whom is about sixty years old with a thin elegance \n\tand a cruel face, the landlord. He has several young men \n\taround him, all rather frail, Ivy-Leagueish. She joins the \n\tgroup, to the distaste of the young men, and is immediately \n\tvoluble and gesticulatory. After a moment, Charlie lets his \n\teyes wander over the room, apparently sees Eddie.\n \n\t\t\t\tCHARLIE\n\t\t\t(calling down) \n\t\tHey, Eddie ...\n \n\tApparently, Eddie doesn't hear him. Charlie frowns and \n\tbegins making his own way down the stairs to the living room.\n \n\tINTERIOR. LIVING ROOM -- GREENWICH VILLAGE APARTMENT\n\tCharlie moves down the stairs into the living room proper. \n\tHe makes his way to Eddie, who is still sitting in the back \n\tof the room, throwing an intense pitch at his girl, talking \n\tquickly, smiling, gesturing. \n \n\t\t\t\tCHARLIE\n\t\t\t(muttering) \n\t\tEddie, I'm cutting out.\n \n\t\t\t\tEDDIE\n\t\t\t(standing, low voice) \n\t\tWait a minute, I'll go with you.\n \n\t\t\t\tCHARLIE\n\t\tI don't want to take you away from \n\t\tyour girl, Eddie.\n \n\t\t\t\tEDDIE\n\t\tAah, this one lives out in Long \n\t\tIsland with her mother. What kind of \n\t\tCommunist is that? It'll take me a \n\t\thalf hour on the subway there and a \n\t\thalf hour back.\n \n\t\t\t\tCHARLIE\n\t\t\t(shrugs) \n\t\tWhere's Arnold? Still in the kitchen?\n \n\t\t\t\tEDDIE\n\t\tI guess so. \n\t\t\t(to the girl) \n\t\tI'll see you, next time I get to \n\t\tLong Island. \n\n\tHe starts off after Charlie who is already wandering through \n\tthe living room in the general direction of the kitchen, \n\tlooking about for Arnold. They pass The Existentialist en \n\troute. She is saying: \"... this boy named Charlie, I never \n\tsaw him before in my life, has been clutching at me all \n\tevening. He's absolutely insane about me.\" Charlie leans \n\tinto the kitchen where Arnold is awake now, seated at the \n\tsmall kitchen table, staring gauntly, unseeingly at his \n\tfingers on the white porcelain-topped table. There are two \n\tmen, one middle-aged, one young, having a whispered chat \n\tover the sink.\n \n\t\t\t\tEDDIE\n\t\t\t(over Charlie's \n\t\t\tshoulder) \n\t\tHey, Arnold, come on.\n \n\tArnold stands obediently, almost dumbly. He squeezes around \n\tthe table, his face soddenly expressionless, to join Eddie \n\tand Charlie in the kitchen doorway. Eddie is saying to \n\tCharlie:\n \n\t\t\t\tEDDIE\n\t\tWell, it wasn't a bad party. We \n\t\tkilled a couple of hours anyway.\n \n\tThe three men push their way past three women in their \n\tthirties, who are standing in the little hallway before the \n\tfront door, in earnest brow-furrowed conversation with each \n\tother. Charlie opens the door, and the three morose \n\tcarousers go out into the dark street.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. GREENWICH VILLAGE APARTMENT -- NIGHT \n\tThe three carousers come out into the street. The door \n\tcloses behind them. The night air is hot and muggy. They \n\twalk down the street toward the corner where only the light \n\tof the corner bar gives any indication of life. There is a \n\tnewspaper on the sidewalk which Eddie bends down to pick up, \n\tand the three men straggle to a halt. Eddie opens the paper \n\tto the sports pages and starts to read by the light of the \n\tstreet lamp. Arnold moves a step to the lamp and leans \n\tagainst it. Charlie stands in the middle of the sidewalk, a \n\tmelancholy, pondering young man. The evening seems to have \n\tcome to a dead halt. After a moment, Eddie starts walking \n\tagain, reading the paper as he does. The others slowly \n\tgather themselves and follow him.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. THE CORNER BAR \n\tA wall clock reading twenty-five minutes to three. CAMERA \n\tPANS DOWN the wall. We are in the bar on the corner of Tenth \n\tand Sixth, almost entirely empty except for Charlie, Eddie, \n\tArnold, and the bartender. The three carousers are leaning \n\twearily on the bar over their beers; the only other person \n\tin the bar is a worn, battered old veteran of the streets, a \n\twoman in her forties, bespectacled, who is perched on a bar \n\tstool at the far end of the bar, gloomily reading a \n\tnewspaper. CAMERA MOVES DOWN and IN on Charlie, Eddie, and \n\tArnold.\n \n\t\t\t\tEDDIE\n\t\t... I mean, you can't compare the \n\t\ttwo. This kid the Yankees have in \n\t\tcenterfield. Are you trying to tell\n\t\tme he's a natural .368 hitter? What's \n\t\the normally hit, .310, .315? Musial \n\t\tled the National League in hitting \n\t\tsix times. He's only having a fair \n\t\tyear, this year -- and he's still \n\t\thitting .320. Musial is an all-time \n\t\tgreat!\n \n\t\t\t\tCHARLIE\n\t\tYeah. I guess so.\n \n\t\t\t\tARNOLD\n\t\t\t(stiff with liquor) \n\t\tEddie -- Eddie. So what do you think, \n\t\tEddie? You think I ought to go \n\t\tthrough with this marriage?\n \n\t\t\t\tEDDIE\n\t\tI don't know about you, Arnold, but \n\t\tif it was me, boy, I'd be in China \n\t\tby now. \n\t\t\t(back to Charlie) \n\t\tWho have the Yankees got on first? \n\t\tSkowron. Boy, how they touted \n\t\tSkowron. All right, he's having a \n\t\tlucky year.\n \n\t\t\t\tCHARLIE\n\t\tYeah....\n \n\t\t\t\tEDDIE\n\t\t\t(continuing) \n\t\t... Well, I mean, is there any \n\t\targument? Hodges is the best first \n\t\tbaseman in both leagues.... \n \n\t\t\t\tARNOLD\n\t\tSo, Eddie, what do you think? You \n\t\tthink I ought to marry her, go to \n\t\tChina, or what?\n \n\t\t\t\tEDDIE\n\t\tArnold, if it bothers you so much, \n\t\tcall her up and tell her to forget \n\t\tthe whole deal. \n\t\t\t(back to Charlie) \n\t\tAll right Hodges is having a bad \n\t\tyear -- but how about last year? He \n\t\thit over .300. He only hit thirty-\n\t\tfive homers and he drove in over a \n\t\thundred runs----\n \n\t\t\t\tARNOLD\n\t\tSo, Eddie...\n \n\t\t\t\tEDDIE\n\t\tArnold! Get rid of her! You're \n\t\tdriving me crazy! \n\n\tArnold lowers his head, and he rises, loses his precarious \n\tbalance and moves backward a few lurching steps.\n \n\t\t\t\tEDDIE\n\t\t\t(continuing) \n\t\tAll right, who's on second? We got \n\t\tCharlie Neal or Gilliam, for that \n\t\tmatter, and this isn't even counting \n\t\tJackie Robinson, head and shoulders, \n\t\teven with a trick knee, the best \n\t\tsecond baseman in both leagues if \n\t\tthey'd let him play there. We got \n\t\tthree guys, for Pete's sake, who can \n\t\toutplay anybody the Yankees put on \n\t\tsecond. \n\n\tArnold weaves slowly up the bar to the two phone booths at \n\tthe far end of the counter. Then walks out of shot.\n \n\t\t\t\tEDDIE\n\t\t\t(continuing) \n\t\tEver see Charlie Neal go to his \n\t\tright? That Yankee guy, what's his \n\t\tname -- he can't go to his right. \n\t\tAnd don't forget Neal gets a lot of \n\t\tbases on balls, and once he's on the \n\t\tbases, man, it unnerves the pitcher ... \n\n\tThe bartender decides to take issue.\n \n\t\t\t\tBARTENDER\n\t\tWhat's Brooklyn going to do for \n\t\tpitching?  \n \n\t\t\t\tEDDIE\n\t\tNever heard of Newcombe? Never heard \n\t\tof Erskine?\n \n\t\t\t\tBARTENDER\n\t\tWhat have you got to compare with \n\t\tFord, Kucks, McDermott, Turley---\n \n\t\t\t\tEDDIE\n\t\tMcDermott -- McDermott hasn't \n\t\tpitched a full game since last year.\n \n\t\t\t\tBARTENDER\n\t\tThe best relief pitcher in both \n\t\tleagues.\n \n\t\t\t\tEDDIE\n\t\tWhat's the matter with Eddie Roebuck?\n \n\t\t\t\tBARTENDER\n\t\tHow do you compare Eddie Roebuck \n\t\twith McDermott? \n\n\t\t\t\tEDDIE\n\t\tWhat are you, a Yankee fan? \n\n\t\t\t\tBARTENDER\n\t\tYeah. \n\n\t\t\t\tEDDIE\n\t\tWell, drop dead.\n\t\t\t(turns angrily \n\t\t\tback to Charlie) \n\t\tA Yankee fan.\n \n\tThere is a sudden bellow off.\n \n\t\t\t\tARNOLD'S VOICE\n\t\tHey!\n \n\tEddie and Charlie slowly turn to look in Arnold's direction. \n\tCAMERA PANS to see Arnold from their point of view, a \n\twavering, drunken young man standing in front of the phone \n\tbooths.\n \n\t\t\t\tARNOLD\n\t\tI did it.\n \n\t\t\t\tEDDIE\n\t\tYou did what?\n \n\tArnold staggers a few paces into the center of the empty bar.\n \n\t\t\t\tARNOLD\n\t\tI just woke her up! I called her! I \n\t\tsaid: \"I'm not going to marry you. \n\t\tWhat do I want to marry you for? I'm \n\t\thaving a ball. What am I going to \n\t\tmarry you for?\"\n \n\t\t\t\tEDDIE\n\t\tWhat is he talking about?\n \n\tThen, suddenly, effortlessly, Arnold sinks down onto the \n\tfloor -- out cold. For a moment, Eddie and Charlie regard \n\tthe prostrate form.\n \n\t\t\t\tBARTENDER\n\t\tBoy, he's gone.\n \n\tEddie and Charlie move to Arnold, lying curled stiffly on \n\tthe floor.\n \n\t\t\t\tCHARLIE\n\t\tI think he's just called his girl, \n\t\tbroke his engagement.\n \n\t\t\t\tEDDIE\n\t\tIs that what he was yelling about?\n \n\t\t\t\tCHARLIE\n\t\t\t(trying to raise \n\t\t\tArnold's head) \n\t\tWake up, kid. Help me get him up, \n\t\tEddie.\n \n\t\t\t\tEDDIE\n\t\tYou think he did it because I was \n\t\tneedling him there before? I was \n\t\tjust needling him.\n \n\tThe two men contrive to lift Arnold and get him onto a stool.\n \n\t\t\t\tBARTENDER\n\t\tYou better get him out of here \n\t\tbecause I'm closing up now.\n\n\t\t\t\tCHARLIE\n\t\tWe better get him home.\n \n\t\t\t\tEDDIE\n\t\tAh, let's not break it up yet. I \n\t\tthought you were waiting for this \n\t\tgirl.\n \n\t\t\t\tCHARLIE\n\t\tIt's three o'clock in the morning, \n\t\tfor Pete's sake.\n \n\t\t\t\tBARTENDER\n\t\tTake him out in the air. He'll be \n\t\tall right.\n \n\t\t\t\tCHARLIE\n\t\tWhat a bachelor party. We start out \n\t\tcelebrating the guy's wedding; we \n\t\twind up breaking his engagement. \n\t\t\t(moves to bar) \n\t\tWhat do we owe you here?\n\t\t\t(he puts some change \n\t\t\ton the counter) \n\t\tEddie, pay it, will you? I gave you \n\t\tthe ten bucks.\n \n\t\t\t\tEDDIE\n\t\t\t(following him \n\t\t\tto the bar) \n\t\tWhat do you want to go home for?\n \n\t\t\t\tCHARLIE\n\t\tIt's going to take us an hour to get \n\t\thim home. He lives in Queens \n\t\tsomewheres. By the time I get back \n\t\tto Fourteenth Street, it'll be \n\t\tdaybreak. What are you going to do, \n\t\tstay up all night? Don't you want to \n\t\tgo home sometimes?\n \n\t\t\t\tEDDIE\n\t\tWhat am I going to do home? I read \n\t\tall the papers.\n \n\t\t\t\tCHARLIE\n\t\t\t(crosses to Arnold)\n\t\tWell, go to sleep then.\n \n\t\t\t\tEDDIE\n\t\tAh, don't go home, Charlie. I feel \n\t\tlike doing something. \n\n\tCharlie turns to him, a cold fury in him.\n \n\t\t\t\tCHARLIE\n\t\tWhat? Stand around this bar and \n\t\targue about the Yankees and the \n\t\tDodgers? Wind up with some miserable, \n\t\tlonely girl who begs you to say, \"I \n\t\tlove you\"? Go home, Eddie. Go to bed. \n\t\tYou got to go home sometimes. I'll \n\t\ttake Arnold home. Come on, Arnold, \n\t\tkid. I'm going to take you home.\n \n\tArnold manages, with Charlie's arm, to get out of the booth \n\tand stand. Charlie's firm arm holds him, and they start for \n\tthe exit. Eddie watches the two figures making their way \n\tdown the length of the bar to the door. They exit. The door \n\tshuts behind them. For a moment, Eddie regards the closed \n\tdoor. Then he shuffles to the bar, back to his schooner of \n\tbeer and looks at it without taking it up. He is profoundly \n\tweary. His shoulders slump, his face sags. He runs his hand \n\tdown his face and shakes his head as if to clear it. He \n\tturns and looks down to the other end of the bar where the \n\tBar Hag sits engrossed in her newspaper. He watches her for \n\ta moment.\n \n\t\t\t\tEDDIE\n\t\t\t(spiritlessly) \n\t\tHey, honey, what are you, a Yankee \n\t\tfan or a Dodger fan?\n \n\tThe Bar Hag slowly turns to regard him over the rim of her \n\tglasses.\n \n\t\t\t\tBAR HAG\n\t\tHiya.\n \n\tBleakly, Eddie shuffles slowly down the long length of the \n\tbar to where the battered old woman sits.\n \n\t\t\t\t\t\tDISSOLVE TO: \n\n\n\tEXTERIOR. THE BAR -- NIGHT \n\n\tHIGH ANGLE SHOT looking down on the sidewalk immediately \n\toutside the bar Arnold and Charlie have just come out of. \n\tThere is a house with a small stoop, and Arnold is standing \n\tslumped by the stoop, holding himself up by the iron railing. \n\tHe is being sick, quietly retching. Charlie is standing a few \n\tpaces away from him in the middle of the sidewalk, a deeply \n\tunhappy figure in his own right. From our angle, we may or \n\tmay not be able to tell that Charlie is crying.\n \n\tCLOSE SHOT of Charlie standing in the middle of the sidewalk \n\tof Sixth Avenue and Tenth Street, the whole dark world around \n\thim, silent and empty. He is crying quietly, unashamedly, his \n\tshoulders shaking ever so little.  Behind him, Arnold is bent \n\tover the railing of the stoop, weak and spent.\n \n\tANOTHER SHOT of the two men. Charlie stops crying, sighs, and \n\tstarts toward Arnold.\n \n\t\t\t\tCHARLIE\n\t\t\t(gently) \n\t\tAre you all right, Arnold?\n \n\tArnold nods weakly. Charlie gets out a handkerchief and \n\tgives it to Arnold who begins to weakly clean his chin and \n\tspots on his suit.\n \n\t\t\t\tCHARLIE\n\t\tWould you like to go back in and \n\t\tsit down? \n\n\tArnold shakes his head weakly \"no.\"\n \n\t\t\t\tCHARLIE\n\t\tWhat subway do you take, Arnold, \n\t\tthe BMT? Can you make it?\n \n\tArnold nods weakly. Charlie puts his arm supportively around \n\this friend's back, but Arnold makes no move yet, being \n\tthoroughly drained.\n \n\t\t\t\tCHARLIE\n\t\tCome on, Arnold, I'll take you home.\n \n\tThere is a clicking of high heels on concrete pavement, and \n\tCharlie looks up. The Existentialist has just come out of \n\tthe party several houses down and has come up a few steps \n\tand is standing watching them. She has her bag and her light \n\tsummer stole. She nods to Charlie, sort of smiles, moves a \n\tfew steps closer to them.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\tIs he all right?\n \n\t\t\t\tCHARLIE\n\t\t\t(nods) \n\t\tYeah, he's all right. Look, I've got \n\t\tto take my friend home...\n \n\tThe two men start slowly down the street to the corner. \n\tArnold leaning heavily on his friend. The Existentialist \n\tstands, watching them a moment.\n \n\t\t\t\tTHE EXISTENTIALIST\n\t\t\t(calling lightly) \n\t\tAre you coming back? Where does he \n\t\tlive? How long will you be?\n \n\tREVERSE SHOT Charlie and Arnold just about getting to the \n\tcorner. Charlie hasn't heard her.\n \n\tFULL SHOT of The Existentialist watching them disappear \n\taround the corner. Then she turns, and, wetting her lips, \n\tshe hurries back to the house where the party is.\n \n\tINTERIOR. BMT SUBWAY -- HURTLING NORTHWARD\n\tHalf past three, and the car is absolutely empty except for \n\tCharlie and Arnold. Arnold is sprawled across the straw seat, \n\tone leg buckled beneath him, the other on the floor. He is \n\tsleeping heavily. Charlie sits expressionlessly, obviously \n\tinvolved in deep introspection. The car buckets along into \n\tthe night. \n\n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. QUEENS APARTMENT HOUSE\n\tArnold and Charlie coming up to a landing. It is the third \n\tfloor; we can see enough of the corridor to see two \n\tapartment doors, lettered \"3D\" and \"3C.\" A small overhead \n\tbulb provides a thin sketchy light. Charlie and Arnold \n\tshuffle down the landing to apartment 3D. They pause outside \n\tthe door. The scene is played in low mutters and whispers.\n \n\t\t\t\tARNOLD\n\t\tWell, thanks a lot, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tYou all right?\n \n\t\t\t\tARNOLD\n\t\tYeah, I'm all right. I'm a little \n\t\tgroggy, but I'm awake anyway. You \n\t\tdon't want to come in, do you?\n \n\t\t\t\tCHARLIE\n\t\tNo, I don't think so.\n \n\t\t\t\tARNOLD\n\t\tI think my father and mother are up. \n\t\tI hear voices. My girl must have \n\t\tcalled them because they wouldn't \n\t\tbe up at this hour.\n \n\t\t\t\tCHARLIE\n\t\tWell, you just go in and explain to \n\t\tthem that you were drunk, and you're \n\t\tsorry, and you'll call your girl the \n\t\tfirst thing in the morning because \n\t\tshe must really be upset about this.\n \n\t\t\t\tARNOLD\n\t\t\t(who has been \n\t\t\tlistening at \n\t\t\this door) \n\t\tI think she's here.\n\n\t\t\t\tCHARLIE\n\t\tWho?\n \n\t\t\t\tARNOLD\n\t\tMy girl. I think I hear her voice in \n\t\tthere.\n \n\t\t\t\tCHARLIE\n\t\tWell, be nice to her, Arnold. \n\t\tRemember, you woke her up in the \n\t\tmiddle of the night and probably \n\t\tscared her to death.\n \n\t\t\t\tARNOLD\n\t\tWhat'll I say to her, Charlie?\n \n\t\t\t\tCHARLIE\n\t\tI don't know, Arnold. What do you \n\t\tfeel like saying to her? Do you \n\t\treally love this girl? Do you want \n\t\tto marry her? Are you marrying this \n\t\tgirl because your family wants you \n\t\tto marry her, or why?\n \n\t\t\t\tARNOLD\n\t\tI think I like her, Charlie. It's \n\t\tjust that I'm afraid I won't make a \n\t\tgood husband.\n \n\t\t\t\tCHARLIE\n\t\tWell, tell her what you told me, \n\t\tArnold. Tell her you're scared, and \n\t\tthat you don't think you'll make a \n\t\tgood husband. If she's a halfway \n\t\tdecent girl, she'll try to understand \n\t\thow you feel, and, if she loves you, \n\t\tshe's going to make it her job to \n\t\tmake you happy. That's what love is, \n\t\tArnold, when you have somebody else \n\t\tin the world you want to be happy. \n\t\tMy wife, Arnold, I don't know what \n\t\tI'd do without her. Arnold, I've got \n\t\ta tough grind ahead of me. Work all \n\t\tday, I'll go to night school at night. \n\t\tBut my wife knows that I need this to \n\t\tbe happy, and she does everything she \n\t\tknows to help me. And we've got a \n\t\tbaby coming. But if you love that \n\t\tbaby and you love your wife, then \n\t\tit's easy. Everything seems so easy \n\t\tto me now -- I don't know why I even \n\t\tthought of quitting.\n\t\t\t(tears have welled \n\t\t\tin his eyes, and he \n\t\t\thurriedly puts his \n\t\t\thand to his face \n\t\t\tshading his reddening \n\t\t\teyes) \n\t\tArnold, I want my wife so much right \n\t\tnow. I want her to be happy. I want\n\t\tto just go home and hold her and tell \n\t\ther how much she means to me. I mean, \n\t\teven Walter, he's going to die, but \n\t\tdon't you think he'll be in tomorrow \n\t\tmorning, same old Walter, jokes and \n\t\tlaughs? He's got somebody to live \n\t\tfor. He's even got somebody to die \n\t\tfor. I mean, how rich can a man be? \n\t\tAnd poor Eddie -- I used to be so \n\t\tjealous of him. I used to think he \n\t\twas so free. Free from what? From \n\t\tloving a woman, from really wanting\n\t\ta woman. Arnold, what I'm trying to \n\t\ttell you is life is nothing if you \n\t\tdon't love somebody but life is \n\t\twonderful if you do love somebody. \n\t\tArnold, I want my wife so much right \n\t\tnow ...\n \n\tArnold is a little embarrassed by his friend's display of \n\temotion and, frankly, hasn't understood a word Charlie was \n\ttalking about.\n \n\t\t\t\tARNOLD\n\t\tI'm going to tell her about that \n\t\twoman tonight and everything. I'll \n\t\ttell her about that woman.\n \n\t\t\t\tCHARLIE\n\t\tArnold, I want to get home so much \n\t\tto my wife right now I'm going to \n\t\tbust.\n \n\t\t\t\tARNOLD\n\t\tI'll see you, Charlie.\n \n\t\t\t\tCHARLIE\n\t\tGood-bye, Arnold, have a nice \n\t\thoneymoon. I'll see you when you get \n\t\tback.\n \n\t\t\t\tARNOLD\n\t\tI'll see you, Charlie.\n \n\tBut he is talking to an empty staircase. Charlie has plunged \n\tdown into the darkness of the floor below. Arnold turns and \n\tsighs and shuffles back to the door of his apartment. He \n\trings the bell lightly, takes a deep breath. A moment, and \n\tthe door opens. A girl of about thirty-five, bespectacled, \n\trather plain, with a sensitive face, stands in the doorway. \n\tArnold stands, his head down in shame.\n \n\t\t\t\tARNOLD\n\t\tHello, Louise. I'm very sorry, \n\t\thonest.\n \n\t\t\t\tLOUISE \n\t\tSure, Arnold, I know.\n \n\tShe looks anxiously over Arnold's shoulder to see if anyone \n\telse is there. Arnold lumbers past her into the apartment. \n\tVoices, both male and female, pop out at him. \"What's the \n\tmatter with you, are you crazy?\" \"What's the matter with \n\tyou?\" \"For heaven's sakes, where have you been?\" ... The \n\tdoor closes.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tEXTERIOR. STUYVESANT TOWN HOUSING PROJECT\n \n\tLONG SHOT looking down the wide courtyard of Stuyvesant Town, \n\tits endless little pathways winding from the various \n\tapartment house doors to the central pathway which leads to \n\ta stairway to the street. It is half past five in the morning. \n\tThe sky is gray and desolate. The courtyard and any other \n\tstreet we see is absolutely empty. THE CAMERA PANS OVER this \n\tempty expanse to the stairway where Charlie appears now, \n\tcoming quickly up the steps. He moves down the central \n\tsidewalk, a little faster than he would usually walk; you have \n\tthe feeling he is exerting an effort to keep from running. \n\tCAMERA PANS with him as he hurries to one of the winding side \n\tlanes leading to a particular apartment house.\n \n\t\t\t\t\t\tDISSOLVE TO:\n \n \n\tINTERIOR. CHARLIE AND HELEN'S APARTMENT\n \n\tMEDIUM SHOT looking from the foyer of the apartment across \n\tthe dining area to the front door. The apartment is dark. \n\tThe door opens and Charlie comes in. He closes the door \n\tquietly after himself and moves a few steps into the \n\tapartment. He stops when he sees Helen seated on the couch, \n\twearing a kimono over her pajamas. She stands; she has been\n\tcrying.\n \n\t\t\t\tCHARLIE\n\t\tI love you, Helen.\n \n\tShe moves slowly to him and puts her head on his chest and \n\tcries quietly. He holds her tightly.\n \n\t\t\t\tHELEN\n\t\t\t(crying softly) \n\t\tI love you so much, Charlie. I love \n\t\tyou so much....\n \n\t\t\t\tCHARLIE\n\t\tI love you....\n \n\t\t\t\tHELEN\n\t\tI love you, Charlie, I love you, \n\t\tCharlie. I love you, Charlie ...\n \n\tCAMERA MOVES SLOWLY UP AND AWAY from the young couple, \n\tholding each other closely and tightly, murmuring to each \n\tother in the dark living room of a two-and-a-half-room \n\tapartment in a housing project. \n\n\t\t\t\t\t\tFADE OUT\n\n \n\n\n\n\nBachelor Party, The\nWriters :   Paddy Chayefsky\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:01.368477"}