{"title": "Bachelor Party", "film_link": "/Movie Scripts/Bachelor Party Script.html", "script_link": "/scripts/Bachelor-Party.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Bachelor Party Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Bachelor-Party.jpg\" title=\"Bachelor Party Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Neal Israel\" title=\"Scripts by Neal Israel\">Neal Israel</a><br/>  <a href=\"/writer.php?w=Pat Proft\" title=\"Scripts by Pat Proft\">Pat Proft</a><br/>  <a href=\"/writer.php?w=Bob Israel\" title=\"Scripts by Bob Israel\">Bob Israel</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<b>Movie Release Date</b> : June 2004<br/>\n<br/>\n<a href=\"/scripts/Bachelor-Party.html\">Read \"Bachelor Party\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                                     \"BACHELOR PARTY\"\n</b>\n\n\n                                      Screenplay by\n\n                                 Neal Israel &amp; Pat Proft\n\n\n\n                                         Story by\n\n                                        Bob Israel\n\n\n\n<b>                                   SHOOTING DRAFT (1984)\n</b>\n<b>                \n</b>\n<b>               FADE IN:\n</b>\n<b>               EXT. ST. ANN'S SCHOOL - DAY\n</b>\n               CAMERA PANS a group of freshly-scrubbed, innocent children, \n               obediently standing in line, like recruits for the Holy \n               Crusade. PULL BACK to REVEAL they are wearing the gray \n               blazers, striped ties and navy slacks of St. Luke's School. \n               They are waiting patiently at the curbside in front of the \n               statue of the school's sainted namesake. One of the fifth \n               grade BOYS pokes the KID next to him with his elbow. The \n               other Kid is about to retaliate when SISTER MARY FRANCIS, a \n               stern-faced nun, appears behind them, grabbing them both \n               firmly by the shoulders.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                         Make one more move and you'll both \n                         be staying late for the rest of the \n                         week.\n\n<b>                                     THE BOYS\n</b>                              (softly; in unison)\n                         Sorry, Sister Mary Francis.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                         I didn't hear you.\n\n<b>                                     THE BOYS\n</b>                              (louder)\n                         Sorry, Sister Mary Francis.\n\n               Sister Mary Francis checks her watch. She scowls and looks \n               out past the parking lot gate.\n\n               Suddenly we HEAR the SOUND of an ENGINE roaring at full \n               throttle. There is a SCREECHING of BRAKES, followed by the \n               loud GRINDING of GEARS. It sounds like the Indy 500 is taking \n               place around the corner.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                              (used to this)\n                         Step away from the curb, children.\n\n<b>               ANOTHER ANGLE\n</b>\n               Zooming through the parking lot gates is a large yellow school \n               bus. It practically takes the last turn on just two wheels. \n               The bus driver quickly slams on the brakes, leaving ten feet \n               of rubber behind him as the bus comes to an ear-splitting \n               halt right in front of them. The front door immediately swings \n               open and RICK STAHL, the driver, hops out. Rick is the life \n               of the party, even when there isn't any party going on.\n\n               While chronologically older than the St. Luke students, the \n               only thing that sets him apart from them is that he has a \n               driver's license. Rick figures he'll live up to his \n               capabilities and get serious in his next life... This \n               incarnation's strictly for laughs. Sister Mary Francis steps \n               up to him.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                         You're late again, Rick.\n\n<b>                                     RICK\n</b>                         I know, Sister, but I have a very \n                         good excuse.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                         There can be no excuse for tardiness.\n\n<b>                                     RICK\n</b>                         You're absolutely right. I should \n                         never have stopped to save that \n                         drowning infant. I'm just weak, \n                         Sister; I'm so weak.\n\n               He starts sobbing softly into his hands.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                         All right, stop that... Children, on \n                         the bus.\n\n               The kids obediently file past Rick, who makes like he is \n               drying his tears with his handkerchief.\n\n<b>                                     RICK\n</b>                         Sister, do you ever get lonely after \n                         vespers? If you do, why don't you \n                         give me a call. I'm in the book.\n\n<b>                                     SISTER MARY FRANCIS\n</b>                              (smiling despite \n                              herself)\n                         Get going, Rick... you're late enough \n                         as it is.\n\n<b>                                     RICK\n</b>                         Right... Think it over.\n\n               He hops on the bus, closes the door and gently backs the bus \n               out of the parking lot.\n\n<b>               INT. BUS - DAY\n</b>\n               As soon as the bus is out of sight of the school, all hell \n               breaks loose. The formally well-mannered children are acting \n               like normal kids... hitting each other over the heads with \n               books, running up and down the aisles, screaming at the top \n               of their lungs.\n\n<b>               ANGLE - RICK\n</b>\n               He removes the St. Christopher statue from the dashboard, \n               revealing a hulaing Hawaiian girl in a grass skirt. He watches \n               the madness behind him in his rearview mirror, picks up the \n               P.A. microphone and rationally attempts to restore order.\n\n<b>                                     RICK\n</b>                              (over mike)\n                         If you don't all calm down I'm gonna \n                         drive this thing over a cliff.\n\n               The kids pay no attention to him.\n\n<b>                                     RICK\n</b>                              (continuing; \n                              philosophically)\n                         Ah... youth.\n\n<b>               EXT. THE BUS\n</b>\n               Rick's bus pulls up to a light and another school bus filled \n               with kids (from a public school) pulls up alongside of it. \n               The other DRIVER gives Rick a competitive smirk and guns his \n               engine. Rick counters by gunning his.\n\n<b>               INT. THE BUS\n</b>\n               All the kids start screaming \"Race... race.\" \"Wipe 'em out.\" \n               \"Go for it.\" Etc. Some of the kids even start taking out \n               money and start betting one another on the race's outcome.\n\n<b>               ANGLE - RICK\n</b>\n               as he readies for action.\n\n<b>               EXT. THE BUSES\n</b>\n               The light turns green and they're off. Or as off as two lunky \n               school buses filled with kids can be.\n\n<b>               WIDE SHOT - ANOTHER STREET\n</b>\n               The two buses come zooming down the street.\n\n<b>               INT. RICK'S BUS\n</b>\n               The kids are screaming at Rick to go faster. One of the little \n               boys looks nauseous as he clutches the seat in front of him.\n\n<b>               EXT. THE STREET - LOW ANGLE\n</b>\n               The buses squeeze down a narrow street, neck and neck with \n               one another.\n\n<b>               INT. THE BUS\n</b>\n               The kids are all yelling words of encouragement to Rick, who \n               is hunched over in his seat, driving with the determination \n               of Andy Granitelli. The nauseous kid is now turning a pale \n               shade of green. He moves to an open window, straining to \n               control the inevitable.\n\n<b>               EXT. THE BUSES\n</b>\n               They race down a steep hill.\n\n<b>               INT. THE BUS\n</b>\n               The nauseous kid can't hold it any longer.\n\n<b>               EXT. THE OTHER BUS\n</b>\n               Something hits with a splat against the windshield that \n               resembles Campbell's Chunky Vegetable Soup.\n\n<b>               INT. THE OTHER BUS\n</b>\n               The other Driver turns on the windshield. It only makes it \n               worse.\n\n<b>               EXT. THE STREET\n</b>\n               Rick's bus pulls out in front, accompanied by the cheering \n               of his passengers. Suddenly a stop light looms ahead. Rick \n               puts on his brakes. Both buses stop just in time.\n\n<b>               INT. RICK'S BUS\n</b>\n               Rick's kids are all piled in a clump right behind him in the \n               front of the bus. Although disheveled, the kids still manage \n               a victorious cheer.\n\n<b>               PHOTOGRAPHER'S POV\n</b>\n               We're LOOKING THROUGH the camera lens. We SEE a cute one-\n               year-old baby boy. He's sitting on a cuddly blanket. We HEAR \n               the VOICE of Jay O'Neill. He is a baby photographer at Sears.\n\n<b>                                     O'NEILL (O.S.)\n</b>                         Okay, Timmy... hold that smile... \n                         and watch the birdie.\n\n               He takes the picture and we SEE the camera flash.\n\n<b>                                     O'NEILL (O.S.)\n</b>                         There.\n\n<b>               O'NEILL\n</b>\n               We see he has his camera and backdrop set up in the camera \n               department behind a velour curtain which blacks out the rest \n               of the store. He's conservatively dressed in a suit, vest \n               and tie. He looks like he could be a Young Republican. But \n               under those Sears clothes is a man a little off center. Rick's \n               best friend. Need we say more? He takes the film out of the \n               camera. The matronly mother is in the process of gathering \n               up her baby.\n\n<b>                                     O'NEILL\n</b>                         These should be in the mail to you \n                         by next Friday.\n\n               She smiles and exits.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         Next.\n\n               A beautiful -- and we're talking gorgeous -- WOMAN enters. \n               Her clothes hug every curve of her body. She has her baby in \n               her arms. O'Neill immediately wants her, and now. His eyes \n               settle onto her full breasts. These he likes.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         Whoa. Look at those babies.\n\n               She gets this innuendo and loves it.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         How are we doing? My name is O'Neill. \n                         And you are...?\n\n<b>                                     WOMAN\n</b>                         Klupner.\n                              (teasing)\n                         Mrs. Klupner.\n\n<b>                                     O'NEILL\n</b>                         Mrs.?\n\n<b>                                     WOMAN\n</b>                         I'm separated.\n\n<b>                                     O'NEILL\n</b>                         Then there is a God. Why don't we \n                         take that baby picture.\n\n               He takes the baby. He has a hard time taking his eyes off \n               her breasts. He places the baby on the blanket.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         If I were you, I'd breast feed until \n                         I was 17 or 18.\n                              (gets behind camera; \n                              sizing up the shot)\n                         Tell ya what...\n\n<b>               O'NEILL'S POV THROUGH CAMERA\n</b>\n               We SEE the baby sitting on the blanket.\n\n<b>                                     O'NEILL (O.S.)\n</b>                         Why don't you lean into the picture \n                         with your child?\n\n               She coyly leans INTO FRAME.\n\n<b>                                     O'NEILL (O.S.)\n</b>                              (continuing)\n                         A-huh. A little more... good!\n\n               She is totally blocking her baby out of the picture.\n\n<b>               O'NEILL\n</b>\n               He gets out from behind the camera.\n\n<b>                                     O'NEILL\n</b>                         I'm getting one heck of a glare off \n                         your dress there. Could you undo a \n                         few buttons?\n\n<b>                                     WOMAN\n</b>                              (seductively)\n                         Of course.\n\n               She starts to unbutton her blouse. O'Neill looks into his \n               camera.\n\n<b>               O'NEILL'S POV THROUGH LENS\n</b>\n               We SEE the Woman finish her last button.\n\n<b>                                     O'NEILL (O.S.)\n</b>                         Now lean in a little more... more... \n                         more...\n\n               As she complies, her breasts all but spill out of her dress.\n\n<b>                                     O'NEILL (O.S.)\n</b>                              (continuing)\n                         Hold that pose.\n\n<b>               O'NEILL\n</b>\n               He runs from behind the camera and poses with the woman.\n\n<b>               THROUGH CAMERA LENS\n</b>\n               We SEE a QUICK SERIES of camera flashes. Each pose finds him \n               near her breasts. He has them on his head. He's cheek to \n               breast. Etc.\n\n<b>               RICK\n</b>\n               enters and witnesses the photo session. He immediately jumps \n               into the shots.\n\n<b>               THROUGH CAMERA LENS\n</b>\n               Rick joins the craziness. After several beats, the Woman \n               gets bored and EXITS the FRAME.\n\n<b>               THE WOMAN\n</b>\n               As Rick and O'Neill continue mugging like two 12-year-olds \n               in a photo booth, the Woman takes her child and exits. A few \n               beats pass and the guys notice they're alone.\n\n<b>                                     O'NEILL\n</b>                         Where'd she go?\n\n<b>                                     RICK\n</b>                         She probably had sex scheduled for \n                         12:30. O'Neill, let's pick up the \n                         guys for a drink... I have major \n                         news to announce.\n\n               O'Neill crosses to his camera and takes out the film.\n\n<b>                                     O'NEILL\n</b>                         Okay... be right with ya.\n\n<b>               RICK\n</b>\n               He picks up some photographs of today's work.\n\n<b>               INSERT - PHOTOS\n</b>\n               Each one has a different mother in several seductive poses. \n               Their babies are barely visible, if at all.\n\n<b>                                     RICK (O.S.)\n</b>                         Pictures a family will cherish \n                         forever.\n\n<b>               EXT. CHULO'S AUTO SHOP - DAY\n</b>\n               Rick's school bus pulls into the yard of the auto shop. \n               Several Chicanos are working on various cars. Rick and O'Neill \n               hop out.\n\n<b>                                     RICK\n</b>                         Hey, Chulo, where are you, man?\n\n<b>               ANGLE - LATE-MODEL CAR\n</b>\n               We SEE a very large pair of shoes sticking out from under \n               the chassis. Slowly, a large, bear-like body rolls out and \n               we catch our first glimpse of CHULO. A happy-go-lucky mechanic \n               of Mexican ancestry.\n\n<b>                                     CHULO\n</b>                         Hey, you guys, what's going on?\n\n<b>                                     RICK\n</b>                         We're going for a little liquid \n                         refreshment.\n\n<b>                                     CHULO\n</b>                         Great. I'll go with you. Wait a \n                         second. Hey, Raul! Move that car, \n                         will you?\n\n               A SMALL MECHANIC with an eye patch gets into a car behind \n               them as we DOLLY WITH the guys THROUGH the lot.\n\n<b>                                     CHULO\n</b>                              (continuing)\n                         Roberto, you finished fixing that \n                         lighter yet?\n\n               Another MECHANIC sticks his face out of another car and shakes \n               his head. Just then Raul, the eye-patched worker, whizzes by \n               behind the guys, driving the car in a zig-zag pattern right \n               into traffic.\n\n<b>                                     CHULO\n</b>                              (continuing; to Rick)\n                         I'm glad you guys came by... What's \n                         the occasion?\n\n<b>                                     O'NEILL\n</b>                         Rick's got an important announcement \n                         to make.\n\n<b>                                     CHULO\n</b>                         Yeah. What is it?\n\n<b>                                     RICK\n</b>                         I've decided not to run for President.\n\n<b>                                     CHULO\n</b>                         Too bad, man, that blows my chance \n                         to be Ambassador to France.\n\n               Behind them we can SEE Roberto fiddling with the lighter. \n               Suddenly flames leap out of the car, blowing Roberto ten \n               feet into the air.\n\n<b>               ANGLE\n</b>\n               The guys all start to pile into the bus. Nearby another \n               employee is washing down the garage with a hose.\n\n               Chulo turns to another mechanic, who has his head under the \n               hood of a car.\n\n<b>                                     CHULO\n</b>                         Manuel, be sure and finish up the \n                         electrical system on that Chevy.\n\n               Manuel waves at Chulo, who turns, hops on the bus. Rick starts \n               it up and starts to drive away. Just as the bus CLEARS FRAME, \n               we SEE Manuel connect two wires together at the same moment \n               the guy with the hose washes down the area around his feet. \n               Manuel lights up like a Christmas tree, screaming in pain. \n               There is a beat, and then Robert falls INTO FRAME, still \n               holding the cigarette lighter, and the car Raul is driving \n               enters the lot and smashes into the side of the garage.\n\n<b>               INT. OFFICE BUILDING - DAY\n</b>\n               A sign on an office door says \"CONCERT TICKET AGENCY.\" From \n               inside we HEAR someone TALKING loudly on the phone. Chulo, \n               Rick and O'Neill open the door and go inside. On the walls \n               in the cramped office there are rock 'n' roll concert posters \n               advertising rock bands like Men At Work, The Clash and Barry \n               Manilow. Behind a cluttered desk we FIND a little man with a \n               thin mustache and horn-rimmed glasses. This is GARY MELNITZ, \n               wheeler-dealer, entrepreneur and coward. Gary yells a lot, \n               which is a definite overcompensation for his size and \n               inability to deal with the opposite sex.\n\n<b>                                     GARY\n</b>                              (yelling; into phone)\n                         Screw you... Screw that... Don't \n                         jerk me around. You promised me 1500 \n                         seats for the Police Concert... 1500, \n                         not fifteen!... Screw that... Screw \n                         you -- Screw Sting.\n                              (hangs up and sees \n                              the guys standing \n                              there)\n                         Hi, guys.\n\n<b>                                     RICK\n</b>                         Gary, you're quite an animal.\n\n<b>                                     GARY\n</b>                         Screw you...\n\n               The PHONE RINGS.\n\n<b>                                     GARY\n</b>                              (continuing; into \n                              phone)\n                         Hello, Concert tickets... What? Pat \n                         Benitar has a yeast infection? She's \n                         cancelling? Screw her. You know what \n                         this is gonna cost me?...\n                              (he hangs up)\n                         Okay. Let's go.\n\n               He gets up and they start for the door. Just then the PHONE \n               RINGS. Gary picks it up.\n\n<b>                                     GARY\n</b>                              (annoyed)\n                         Screw you... That's crap... Suck \n                         my...\n                              (softly)\n                         Oh, Mom, I didn't know it was you... \n                         eggs and milk... Okay, I won't forget.\n\n               He hangs up the phone and they start for the door again.\n\n<b>                                     GARY\n</b>                         Let's go.\n\n<b>                                     RICK\n</b>                         Isn't he incredible, gets along with \n                         everybody.\n\n<b>                                     CHULO\n</b>                         Yeah, he's really got his thing \n                         together.\n\n<b>                                     GARY\n</b>                         Oh, eat me!\n\n               The guys all laugh and exit.\n\n<b>               INT. HARBORSIDE INN - DAY\n</b>\n               It's a quiet restaurant near a Marina. A lot of business-\n               people in suits are eating.\n\n<b>               TWO MALE CUSTOMERS\n</b>\n               CUSTOMER ONE calls for a waiter.\n\n<b>                                     CUSTOMER ONE\n</b>                         Waiter.\n\n               The WAITER approaches them from OUT OF FRAME.\n\n<b>                                     CUSTOMER ONE\n</b>                         We'd like to order now.\n\n<b>               ANOTHER ANGLE\n</b>\n               We see their waiter, RYKO, a blond, tanned, muscular beach \n               bum who has definitely stayed out in the sun too long.\n\n<b>                                     RYKO\n</b>                         How you guys doin'... Could you \n                         believe how overcast it was this \n                         morning? Bad day for sailin', waves \n                         are too rough and...\n\n<b>                                     CUSTOMER\n</b>                              (annoyed)\n                         You can skip the small craft warnings. \n                         We're in a hurry.\n\n<b>                                     RYKO\n</b>                         No prob, bud... Here's today's \n                         dealie...\n\n               He holds up a blackboard with the day's menu.\n\n<b>                                     RYKO\n</b>                         We got... uh, veal... ah... veal...\n                              (to customer)\n                         What's this word?\n\n<b>                                     CUSTOMER ONE\n</b>                         Parmisan.\n\n<b>                                     RYKO\n</b>                         Yeah right. I always want to say \n                         Paramisian when I see that. We looked \n                         at them under the jigamabob in biology \n                         once. Little squirmy, creepy things \n                         that live in your intestine and...\n\n<b>                                     CUSTOMER\n</b>                         Please... We have an appointment in \n                         a half hour...\n\n<b>                                     RYKO\n</b>                         Wow, sounds stressful. What do you \n                         guys do for a living?\n\n<b>                                     CUSTOMER ONE\n</b>                         We're lawyers.\n\n<b>                                     RYKO\n</b>                         Whoa... You got to go to school for \n                         that or what?\n\n<b>                                     CUSTOMER\n</b>                              (he's had enough)\n                         Look, forget the specials. We'll \n                         take three hamburgers.\n\n<b>                                     RYKO\n</b>                         Okay, great... Any of you guys got a \n                         pencil by any chance?\n\n               One of the customers shrugs and hands him a pen.\n\n<b>                                     RYKO\n</b>                              (impressed)\n                         All right, a Bic... How 'bout a piece \n                         of paper?\n\n               Ryko's customers look totally disgusted as Ryko's short \n               attention span is interrupted by something he sees O.S.\n\n<b>               ANOTHER ANGLE\n</b>\n               Rick and the guys appear in the bar.\n\n<b>                                     RICK\n</b>                         Ryko. Come on!\n\n               They all disappear into the bar area.\n\n<b>                                     RYKO\n</b>                         Be right there.\n                              (to customers)\n                         Nice rappin' with you guys. \n                         Unfortunately I'm outta here. Someone \n                         else will have to help you.\n                              (calling off)\n                         Skip!\n\n               The customers are pleased to get rid of Ryko. SKIP enters. \n               He's a clone of Ryko.\n\n<b>                                     SKIP\n</b>                         Like um... What's the deal, you guys \n                         gonna order?\n\n               The customers give each other a \"Here we go again\" look\n\n<b>               ANGLE - THE GUYS\n</b>\n               They're laughing uproariously and carrying on as Ryko comes \n               over and sits down.\n\n<b>                                     RYKO\n</b>                         Hi pals.\n\n               The guys acknowledge him.\n\n<b>                                     GARY\n</b>                         Okay... We're all here. Rick, what's \n                         the big announcement?\n\n<b>               ANGLE - RICK\n</b>\n<b>                                     RICK\n</b>                         All right, gentlemen, I'm not gonna \n                         sugar-coat this thing. I've known \n                         you guys since grade school, so I'm \n                         gonna give it to you straight from \n                         the hip... right from the shoulder... \n                         without beating around the bush... \n                         Nothing fancy, just the plain, hard \n                         facts... tell it like it is.\n\n<b>                                     CHULO\n</b>                         Man, you're losing your audience.\n\n<b>                                     RICK\n</b>                         Okay... This is it... I'm getting \n                         married.\n\n<b>                                     O'NEILL\n</b>                         What?\n\n<b>                                     CHULO\n</b>                         You're kidding.\n\n<b>                                     GARY\n</b>                         I don't believe it.\n\n<b>                                     RYKO\n</b>                         Fuck me!\n\n<b>                                     RICK\n</b>                         Yes, gentlemen. Saturday after next, \n                         I lose my amateur standing and turn \n                         pro.\n\n<b>                                     CHULO\n</b>                         Hey, man, congratulations!\n\n               Chulo gets up and gives Rick a big bear hug... The other \n               guys shake his hand.\n\n<b>                                     GARY\n</b>                         Wait a minute. You been living with \n                         Debbie! Why do you want to get \n                         married?\n\n<b>                                     RICK\n</b>                         Because I love her. What can I tell \n                         you?\n\n<b>                                     RYKO\n</b>                         You sure? This means no more partying.\n\n<b>                                     RICK\n</b>                         No more raping and pillaging, either. \n                         You'll have to carry on without me.\n\n<b>                                     GARY\n</b>                         Next Saturday... That's just two \n                         more weeks to live.\n\n<b>                                     O'NEILL\n</b>                         Hold it... As long as you're gonna \n                         go through with this, the least we \n                         can do is make sure you go out in \n                         style.\n\n<b>                                     CHULO\n</b>                              (warming to this)\n                         Yeah, man. Let's throw a bachelor \n                         party with drugs, booze and broads.\n\n<b>                                     O'NEILL\n</b>                         Yeah. Right. All the things that \n                         make life worth living.\n\n<b>                                     RICK\n</b>                         Sounds swell... I'm really touched. \n                         And my getting married's not gonna \n                         change a thing between me and my \n                         pals. We're still gonna go bowling \n                         on Tuesdays, play cards on Fridays \n                         and wear women's clothes on Sunday \n                         night. I love you guys... I always \n                         will.\n\n<b>                                     GARY\n</b>                         Let's have a toast.\n\n               The guys all raise their glasses.\n\n<b>                                     O'NEILL\n</b>                         To Rick.\n\n<b>                                     GARY\n</b>                         To us.\n\n<b>                                     CHULO\n</b>                         To girls with big pairs.\n\n<b>                                     ALL THE GUYS\n</b>                         Yeah, right on, etc.\n\n               As they down their drinks, we:\n\n<b>                                                                    CUT TO:\n</b>\n<b>               EXT. THE JEAN MACHINE - DAY\n</b>\n               We SEE a couple of very contemporary looking 15-year-olds \n               going into a very \"now\" clothing store -- like Fred Segal's... \n               When the door opens, loud ROCK 'N ROLL MUSIC blasts out.\n\n<b>               INT. THE JEAN MACHINE - DAY\n</b>\n               Inside the store we see all the sales clerks grooving \n               narcissistically to the music like they're at a disco. The \n               cashier, PHOEBE, has devoted her life to following the current \n               trends and fads no matter how inane they may be. Today she's \n               in a reggae mode, her hair wound into tight dreadlocks, as \n               she sways lost in the ozone to the music. A CUSTOMER \n               approaches her with a purchase.\n\n<b>                                     CUSTOMER\n</b>                         I'd like to pay for these.\n\n<b>                                     PHOEBE\n</b>                         Huh... What... Oh sure, wait till \n                         this song is over.\n\n               She floats off again...\n\n               One of the young MALE CUSTOMERS approaches an attractive \n               salesgirl. This is DEBBIE THOMERSON, Rick's intended. She \n               seems to be the only sane employee in the place because she's \n               actually working, putting clothes on the racks. This \n               impression of sanity fits her, as she is level-headed, and \n               has a clear sense of herself. She can also take a joke, thus \n               her engagement to Rick.\n\n<b>                                     CUSTOMER\n</b>                         Excuse me, where can I try on these \n                         pants?\n\n<b>                                     DEBBIE\n</b>                         Right over here.\n\n               She leads the Customer to the try-on booths. The Customer \n               enters one. We SEE that the saloon-style doors of the booths \n               have been hung too high, so as he takes off his pants, his \n               underwear is exposed to the world. We PULL BACK, REVEALING \n               other people in other booths, their bare asses clearly in \n               sight. No one in the store seems to care, however, as they \n               are much too busy dancing.\n\n               The front door opens and BOBBIE, a very sultry and earthy-\n               looking girl with long, dark hair, pushes inside. She is \n               O'Neill's girl and Debbie's best friend... She's also someone \n               who would party every night if given half a chance.\n\n<b>                                     BOBBIE\n</b>                              (excited)\n                         Debbie... I don't believe it. I'm so \n                         excited.\n\n<b>                                     DEBBIE\n</b>                         Bobbie, what are you talking about?\n\n<b>                                     BOBBIE\n</b>                         O'Neill just tole me. It's sooo \n                         great... I don't believe it.\n\n               Phoebe crosses to them.\n\n<b>                                     PHOEBE\n</b>                         What's happening?\n\n<b>                                     BOBBIE\n</b>                         Debbie's marrying Rick.\n\n<b>                                     PHOEBE\n</b>                         ...Really?\n\n<b>                                     DEBBIE\n</b>                         Yes, it's true.\n\n<b>                                     PHOEBE\n</b>                         Ohmygod.\n\n               The girls screech and jump around, hugging each other in \n               sheer joy. A MALE CUSTOMER, moved by this outpouring of \n               affection, moves over and gets in the middle of the girls, \n               enjoying every moment of being hugged by three women at once.\n\n<b>                                     DEBBIE\n</b>                              (to Customer; realizing)\n                         Would you get out of here.\n\n               Reluctantly the guy retreats back to the Calvin Klein jeans \n               rack.\n\n<b>                                     BOBBIE\n</b>                         Does Cole know about this?\n\n<b>                                     PHOEBE\n</b>                         Really -- you went with him for two \n                         years.\n\n<b>                                     DEBBIE\n</b>                         He still thinks I'm going with him. \n                         I'm going to break the news to him \n                         tomorrow.\n\n<b>                                     BOBBIE\n</b>                         He's not gonna be happy. And your \n                         parents can't be too thrilled either.\n\n<b>                                     DEBBIE\n</b>                         No. As far as they're concerned the \n                         only good Rick is a dead Rick. But I \n                         don't care... it's my decision.\n\n<b>                                     PHOEBE\n</b>                              (oblivious)\n                         I'm totally blown away. You're getting \n                         married. It seems like only yesterday \n                         I showed you how to have oral sex.\n\n<b>                                     BOBBIE\n</b>                         Deb, I want to throw you a shower.\n\n<b>                                     DEBBIE\n</b>                         Oh, that's really sweet. I'd love \n                         that.\n\n<b>                                     PHOEBE\n</b>                         We'll invite all the girls.\n\n<b>                                     BOBBIE\n</b>                         I don't believe it... Mrs. Rick Stahl.\n\n               The girls all start to scream and carry on all over again.\n\n<b>               INT. RICK AND DEBBIE'S APARTMENT - NIGHT\n</b>\n               Rick is cooking dinner in the cramped combination kitchen / \n               living room. He has about five dishes going at once as he \n               dashes from stove to refrigerator. He grabs some hamburger \n               meat, rolls it into a ball, then slaps it on the counter. He \n               then takes a steam iron and presses it on the patty.\n\n               Debbie comes in the front door and crosses to him and hugs \n               him tightly, kissing him sweetly.\n\n<b>                                     DEBBIE\n</b>                              (between kisses)\n                         God, you're a slob.\n\n<b>                                     RICK\n</b>                         But a fabulous cook.\n\n<b>                                     DEBBIE\n</b>                         What are we having?\n\n<b>                                     RICK\n</b>                         It's either meatloaf, Swiss steak or \n                         charred flesh. I won't know till \n                         it's finished.\n\n<b>                                     DEBBIE\n</b>                              (looking at the stove)\n                         I think your dinner's burning.\n\n               Rick crosses to the stove. A small fire is coming out of one \n               of the frying pans. He douses it with water.\n\n<b>                                     RICK\n</b>                         Don't worry... it's supposed to do \n                         this.\n\n<b>                                     DEBBIE\n</b>                              (setting the table)\n                         Want to hear something great? Bobbie \n                         and Phoebe are throwing me a shower. \n                         It's really gonna be fun.\n\n<b>                                     RICK\n</b>                         Not as much fun as the bachelor party \n                         the guys are throwing for me.\n\n<b>                                     DEBBIE\n</b>                         You're going to have a bachelor party?\n\n<b>                                     RICK\n</b>                         Of course. I'm a traditional guy... \n                         It's a traditional event.\n                              (he brings all the \n                              food to the table)\n                         Well, what do you think?\n\n<b>                                     DEBBIE\n</b>                         It looks awful.\n\n<b>                                     RICK\n</b>                         Yes, but looks are deceiving...\n                              (takes a bite)\n                         Not in this case, however.\n\n<b>                                     DEBBIE\n</b>                         Are you going to have women at your \n                         party?\n\n<b>                                     RICK\n</b>                         No, sweetheart, it's a stag party. \n                         Does stay home.\n\n<b>                                     DEBBIE\n</b>                         I'm not talking about does. I'm \n                         talking about hookers.\n\n<b>                                     RICK\n</b>                         Oh, those. Why do you ask?\n\n<b>                                     DEBBIE\n</b>                         Because from what I've heard, it's a \n                         tradition and you're a traditional \n                         guy.\n\n               Rick grabs her; starts kissing her passionately on the neck.\n\n<b>                                     RICK\n</b>                         Deb, you is my woman now. I is yo \n                         man. No painted lady ever gonna come \n                         between us.\n\n<b>                                     DEB\n</b>                         I need you to promise.\n\n<b>                                     RICK\n</b>                         Okay, you got it. I got a way we can \n                         seal the deal -- what'd you say?\n\n               He grabs her. They kiss and slide down onto the table, \n               knocking the dishes to the floor.\n\n<b>               EXT. BEL AIR-TYPE ESTATE - DAY\n</b>\n               Through the iron gates of an impressive-looking estate comes \n               Debbie in her convertible VW Rabbit. She pulls up behind a \n               new Porsche 911 and a Jeep, all decked out with rifles, nets \n               and other hunting equipment. As she walks down the path toward \n               the house, she sees something off in the distance that \n               startles her.\n\n<b>               DEBBIE'S POV\n</b>\n               A large brown grizzly bear appears to be entering the side \n               door of the house.\n\n<b>               ANGLE - DEBBIE\n</b>\n<b>                                     DEBBIE\n</b>                              (calling O.S.)\n                         Cole?... Cole!\n\n<b>               DEBBIE'S POV\n</b>\n               The \"Bear\" turns around. We SEE that the bear is, in fact, \n               dead. It is being carried by a tall, handsome HUNTER. He \n               waves to Debbie and indicates for her to follow him inside.\n\n<b>               INT. COLE'S SMOKEHOUSE - DAY\n</b>\n               Debbie opens a rustic-looking door and peers in.\n\n<b>                                     DEBBIE\n</b>                         Cole?\n\n<b>                                     COLE (O.S.)\n</b>                         Over here, Deb... in the Smokehouse.\n\n               CAMERA PANS WITH Debbie as she enters the room. She passes \n               several trophies, guns and stuffed animal heads hanging from \n               the wall. She makes her way past some sections of an \n               undetermined animal's anatomy hanging from hooks suspended \n               from the ceiling. Finally we see COLE WHITTIER, a Steve Garvey \n               look-alike... rugged all-American, and heir to the Whittier \n               Plastic Wrap fortune. Despite his jockish good looks and \n               outward arrogance, there's something in his manner that is \n               definitely unsavory.\n\n               As Debbie approaches him we SEE that he is butchering some \n               unfortunate friend of the forest on the table in front of \n               him. (NOTE: For the squeamish, all of this is done OUT OF \n               FRAME. The only thing we should HEAR are the delightful SOUNDS \n               of TAXIDERMY.)\n\n<b>                                     COLE\n</b>                         Hi, Deb. Just got back from the \n                         mountains.\n                              (as he cuts in with a \n                              surgeon's skill)\n                         Isn't this a beauty?... It's gonna \n                         look great in the den.\n\n               Debbie tries her best not to look down at what he's doing.\n\n<b>                                     DEBBIE\n</b>                         Cole, we've got to talk.\n\n<b>                                     COLE\n</b>                         Finally realized Rick's a jerk, huh?\n\n<b>                                     DEBBIE\n</b>                         No, Cole, I...\n\n<b>                                     COLE\n</b>                              (lifting an organ of \n                              some sort O.S.)\n                         It's all right, I forgive you. I'm \n                         not the vengeful type. We'll forget \n                         what happened. Why don't we take a \n                         trip together? Maybe kill a few lions \n                         in Kenya over Christmas.\n\n<b>                                     DEBBIE\n</b>                         Cole, listen to me... I've got to \n                         tell you...\n\n<b>                                     COLE\n</b>                         You know, when you dumped me for \n                         that wimp, I thought, Cole, she'll \n                         be back. God wants the two of you to \n                         be together, and sure enough...\n\n<b>                                     DEBBIE\n</b>                         Cole, I'm marrying Rick.\n\n<b>                                     COLE\n</b>                              (confused)\n                         You're marrying him? Then why are \n                         you coming back to me?\n\n<b>                                     DEBBIE\n</b>                         I'm not. I just thought I should \n                         tell you myself before you heard it \n                         somewhere else.\n\n               Cole stops what he is doing for a beat and just stares at \n               Debbie intensely. Then he returns to his work with a renewed \n               enthusiasm, chopping, slashing and slicing.\n\n<b>                                     COLE\n</b>                         You know how that makes me feel, \n                         Deb? Wanta know how that makes me \n                         feel?\n                              (softly)\n                         Angry, Deb.\n                              (a little louder)\n                         Yesss, that's the word, angry. But \n                         if he makes you happy, you go right \n                         ahead. I want you to be happy, Deb.\n                              (a little nuts)\n                         No matter what, no matter how angry \n                         it makes me, no matter how much it \n                         hurts. Be happy, Deb. Be oh, so very, \n                         very happy.\n\n<b>                                     DEBBIE\n</b>                         Cole, I'm sorry, I...\n\n<b>                                     COLE\n</b>                         That's all right, Deb. Go be happy \n                         and smile a lot, Deb. Do it for me.\n\n<b>                                     DEBBIE\n</b>                              (uncomfortable)\n                         I'm going now, Cole.\n\n<b>                                     COLE\n</b>                         I understand, Deb. 'Bye... be happy.\n\n               Debbie exits and we PUSH IN ON Cole. Something on his face \n               says, \"Hi! I'm really out of my mind.\"\n\n<b>               INT. DR. STAN STAHL'S OFFICE - DAY\n</b>\n               DR. STAN is Rick's older brother and a proctologist. Although \n               he's only in his early thirties, he thinks and acts like \n               someone in their early 70's. A little on the pompous side, \n               Stan is never without his pipe.\n\n<b>                                     STAN\n</b>                         Okay, Rick, hold out your arm.\n\n               He crosses to a sterile container and takes out a syringe.\n\n<b>                                     RICK\n</b>                         You wouldn't hurt your own brother, \n                         would you?\n                              (looking at the needle \n                              cautiously)\n                         I changed my mind. I don't need a \n                         blood test. The marriage is off. I --\n\n               Just then, Stan sticks the needle in his arm.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         You always were sneaky, Stan, very \n                         sneaky.\n\n<b>                                     STAN\n</b>                         Rick, marriage will be good for you. \n                         It's done wonders for me.\n\n<b>                                     RICK\n</b>                         True, you're a lot handsomer now. \n                         Don't you have enough blood already?\n\n<b>                                     STAN\n</b>                              (without much \n                              conviction)\n                         You won't miss a thing about being \n                         single... The wild parties, the \n                         different girls every night, running \n                         around like a maniac... God, I miss \n                         that.\n\n<b>                                     RICK\n</b>                         Stan, you're depressing me... Hey, I \n                         didn't know you were going to fill \n                         'er up. Just take a couple of gallons, \n                         okay?\n\n               Stan removes the needle and hands Rick a cotton ball.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         That's an even trade... a cotton \n                         ball for all my blood.\n\n<b>                                     STAN\n</b>                              (returning to this \n                              world)\n                         Okay, Rick, all finished. I can't \n                         wait for that bachelor party... I \n                         need the action.\n\n               CAMERA FOLLOWS them as they go out into the hall.\n\n<b>                                     STAN\n</b>                              (continuing)\n                         Don't say anything to my wife about \n                         it.\n\n               They pass an open examining room. Stan's wife, TINA, is also \n               a doctor and is examining an old man. She's not as tiny as \n               her name suggests. In face, she's more like over-sized.\n\n<b>                                     RICK\n</b>                         Hi, Tina.\n\n               Rick moves to hug her and he notices that Tina has her finger \n               up the old guy's ass.\n\n<b>                                     TINA\n</b>                              (looking up)\n                         Rick...\n                              (to PATIENT)\n                         Mr. Goldsmith, this is my brother-in-\n                         law. He's getting married.\n\n<b>                                     PATIENT\n</b>                              (without turning around)\n                         Congratulations.\n\n               Tina turns to a NURSE.\n\n<b>                                     TINA\n</b>                         Nurse, will you take over?\n\n               The nurse shrugs and sticks her finger up the patient's rear \n               end as Tina hugs Rick.\n\n<b>                                     TINA\n</b>                              (continuing)\n                         I'm so happy for you.\n\n               Rick hugs her, uneasily trying to make sure her right hand \n               doesn't come anywhere near his face.\n\n<b>               EXT. DEBBIE'S PARENTS' HOUSE - BACKYARD - DAY\n</b>\n               Debbie and Rick and her MOM and DAD are having a frustrating \n               game of tennis behind her parents' plush home. Mr. Thomerson \n               is a stockily-built guy in his fifties who prides himself on \n               being tough and competitive. His wife loves to shop. As far \n               as she's concerned, appearances are everything. Neither of \n               them likes Rick's appearance or anything else about their \n               future son-in-law. Mr. Thomerson slams the ball to Rick; \n               Rick slams the ball back and drives it over the fence, out \n               of the court.\n\n<b>                                     RICK\n</b>                         Oops!\n\n<b>                                     MR. THOMERSON\n</b>                              (frustrated)\n                         All right, who serves?\n\n<b>                                     DEBBIE\n</b>                         You do, Daddy.\n\n               Mr. Thomerson serves the ball to Debbie, who hits it over \n               the net to her mother, who hits it to Rick, who slams it \n               over the fence, out of the court. Mr. Thomerson does not \n               look pleased.\n\n<b>                                     MR. THOMERSON\n</b>                         Rick, hit the ball easier, son. You \n                         don't have to kill it.\n\n<b>                                     RICK\n</b>                         Can't I just maim it a little?\n\n<b>                                     MRS. THOMERSON\n</b>                         Er... perhaps we ought to stop now.\n\n<b>                                     MR. THOMERSON\n</b>                         No. Let's at least finish the set.\n\n               Rick starts humming the \"ABC Wide World of Sports\" theme \n               loudly. Mr. T. gives him a disgusted look and serves the \n               ball. Rick smashes the ball and sends it over the fence, out \n               of the court.\n\n<b>               EXT. THE THOMERSON'S NEIGHBORS' BACKYARD - DAY\n</b>\n               A middle-aged COUPLE are sitting on some lawn furniture trying \n               to read the newspaper. A tennis ball comes down from the sky \n               and hits the guy squarely on the top of the head. PULL OUT \n               to REVEAL that they're surrounded by dozens of tennis balls.\n\n<b>                                     MAN\n</b>                         One of these days I'm gonna burn \n                         Thomerson's court to the ground.\n\n<b>               EXT. THE THOMERSON'S - MEDIUM SHOT - DAY\n</b>\n               Rick and Mr. Thomerson are having a heart to heart chat over \n               some lemonade in front of the tennis court.\n\n<b>                                     RICK\n</b>                         Well, I have to admit my game's a \n                         little rusty, but I love polo. It's \n                         unrelenting, a constant challenge to \n                         the senses. Really a beautiful \n                         experience.\n\n<b>                                     MR. THOMERSON\n</b>                         Rick, I want to cut through the b.s.\n\n<b>                                     RICK\n</b>                         I'd love that.\n\n<b>                                     MR. THOMERSON\n</b>                              (sitting on his anger)\n                         Good. I think you're an asshole. No, \n                         let me correct that, an immature \n                         asshole. Which is fine, except you're \n                         marrying my daughter and I'm afraid \n                         my grandchildren are going to be \n                         little assholes.\n\n<b>                                     RICK\n</b>                         Mr. Thomerson, I...\n\n<b>                                     MR. THOMERSON\n</b>                         Let me finish. Debbie's an adult. \n                         She can do what she wants. But if \n                         you want your marriage to last, you're \n                         going to have to change some things \n                         about yourself. If I may make some \n                         suggestions...\n\n<b>                                     RICK\n</b>                         Feel free.\n\n<b>                                     MR. THOMERSON\n</b>                         First, you're a slob. You have to \n                         dress for success. Second, your \n                         outlook on life...\n\n               As Mr. Thomerson drones on, Rick shifts uncomfortably in his \n               chair, focusing his attention on Debbie, her mother and her \n               older, cynical cousin, ILENE, who are sitting nearby on the \n               rear patio.\n\n<b>               ANGLE - DEBBIE, MRS. THOMERSON AND ILENE\n</b>\n<b>                                     MRS. THOMERSON\n</b>                         I'm using the same caterer for the \n                         shower I had for our Christmas party \n                         last year.\n\n<b>                                     DEBBIE\n</b>                         Great, Mom.\n\n<b>                                     ILENE\n</b>                         If I were you, I'd worry less about \n                         the shower and more about Rick's \n                         bachelor party.\n\n<b>                                     DEBBIE\n</b>                         Ilene, why would I want to do that? \n                         I trust Rick.\n\n<b>                                     ILENE\n</b>                         Of course you do. I trusted my ex, \n                         Mel, too. Cousin, I can only talk \n                         from experience. What do you think \n                         they do at these parties, have tea \n                         and play scrabble?\n\n<b>                                     DEBBIE\n</b>                         Ilene, Rick promised...\n\n<b>                                     ILENE\n</b>                         Debbie, don't be naive. Men are pigs.\n\n<b>                                     MRS. THOMERSON\n</b>                              (trying to change the \n                              subject)\n                         Girls, why don't we go inside for \n                         lunch.\n                              (calling to Mr. T)\n                         Boys, would you mind bringing in \n                         that lemonade?\n\n<b>               ANGLE - MR. THOMERSON AND RICK\n</b>\n<b>                                     MR. THOMERSON\n</b>                         In a second...\n                              (to Rick)\n                         And you're irresponsible. Show some \n                         initiative, try to better yourself, \n                         stop showing off, actions speak louder \n                         than words.\n\n<b>                                     RICK\n</b>                         Well, sir, that's quite a list. But \n                         you're absolutely right. And if I \n                         work hard at it, I think I can be a \n                         totally changed person by the time \n                         we finish lunch...\n\n               Mr. Thomerson rolls his eyes, knowing he's been wasting his \n               breath. He grabs the pitcher of lemonade and Rick grabs the \n               tray, which is filled with fresh lemons. They get up at the \n               same time and collide, sending the lemonade all over Mr. T., \n               and the lemons bounding over the fence.\n\n<b>               EXT. THOMERSON'S NEIGHBORS' HOUSE\n</b>\n               The Neighbor we saw before is reading his paper when an \n               avalanche of lemons comes flying at him, joining the tennis \n               balls on the lawn.\n\n<b>                                     NEIGHBOR\n</b>                         I hate those people... I really do.\n\n<b>               INT. THOMERSON HOUSE - DAY\n</b>\n               The Thomersons, Rick, Debbie and Ilene are just finishing \n               lunch. The DOORBELL RINGS. Mr. Thomerson gets up to answer \n               it. Standing there is Cole, wearing his tennis shorts.\n\n<b>                                     COLE\n</b>                         Hi, everybody. Am I late?\n\n<b>                                     MR. THOMERSON\n</b>                         Not at all. We're just finishing \n                         lunch.\n\n               Cole crosses to the table and kisses Mrs. T's hand gallantly.\n\n<b>                                     COLE\n</b>                         Good to see you, Mrs. Thomerson. \n                         Hello, Debbie.\n\n               He turns to Rick.\n\n<b>                                     COLE\n</b>                              (continuing)\n                         And...\n\n<b>                                     RICK\n</b>                         Bond... James Bond.\n\n               Cole gives him a quick look of contempt and exits with Mr. \n<b>               T.\n</b>\n<b>                                     MR. THOMERSON (O.S.)\n</b>                         So, Cole, you been practicing your \n                         game?\n\n<b>                                     COLE (O.S.)\n</b>                         Sure have...\n\n<b>                                     DEBBIE\n</b>                         Why is Cole here?\n\n<b>                                     MRS. THOMERSON\n</b>                         You know your father enjoys his \n                         company.\n\n<b>                                     RICK\n</b>                         Much the way Hitler enjoyed hanging \n                         out with Mussolini.\n\n<b>               EXT. THOMERSON TENNIS COURT - DAY\n</b>\n               Mr. T. and Cole are having a fast-paced game.\n\n<b>                                     MR. THOMERSON\n</b>                         Nice shot.\n\n<b>                                     COLE\n</b>                         Thank you, sir.\n\n<b>                                     MR. THOMERSON\n</b>                         I know you're as unhappy as I am \n                         about Debbie's marriage to Rick.\n\n<b>                                     COLE\n</b>                         Yes, sir, I am.\n\n<b>                                     MR. THOMERSON\n</b>                         Cole, I don't want you to give up on \n                         her.\n\n<b>                                     COLE\n</b>                         I've tried to change her mind.\n\n<b>                                     MR. THOMERSON\n</b>                         It's not her mind you need to change. \n                         It's Disneyland head in there.\n\n<b>                                     COLE\n</b>                         But how can I do that?\n\n<b>                                     MR. THOMERSON\n</b>                         If it were me, I'd reason with him \n                         first. Then, if that failed...\n                              (with malice)\n                         ...I'd take more persuasive action.\n\n               Mr. T. drills a wicked forehand shot straight at Cole, who \n               swings at it and misses.\n\n<b>                                     COLE\n</b>                              (conspiratorily)\n                         Thanks for the advise, sir.\n\n<b>                                     MR. THOMERSON\n</b>                         Keep me informed.\n\n               PUSH IN ON Cole. This is a man with a plan...\n\n<b>               EXT. PARK ON A BLUFF - DAY\n</b>\n               The bluff overlooks the ocean. It's a beautiful spot. Just \n               the right setting for an outdoor wedding. Some folding chairs \n               have been set up and a canvas canopy.\n\n               Gathered for the rehearsal are Gary, Ryko, Chulo, O'Neill \n               who is with Bobbie, Debbie's mother and Mr. Thomerson, Phoebe, \n               Ilene, Tina, Stan, a gray-haired priest. FATHER FALWELL and, \n               of course, Rick and Debbie. Everyone is admiring this \n               picturesque setting. Everyone but Mr. Thomerson. He's very \n               underjoyed at the sight of Rick and his friends. Mr. and \n               Mrs. Thomerson are standing with Father Falwell. They are \n               watching Rick holding Debbie.\n\n<b>                                     MR. THOMERSON\n</b>                         The thought of that person marrying \n                         my daughter makes me want to upchuck.\n\n<b>                                     MRS. THOMERSON\n</b>                         You can tell a man by his friends.\n\n<b>                                     FATHER FALWELL\n</b>                         They're not such a bad bunch.\n\n<b>                                     MR. THOMERSON\n</b>                         No?\n                              (he points off)\n                         That's his best man peeing on a tree.\n\n<b>               ANOTHER ANGLE\n</b>\n               In the b.g. we SEE O'Neill's back TO US. He is definitely \n               relieving himself on a weeping willow. The wind begins to \n               pick up.\n\n<b>                                     FATHER FALWELL\n</b>                         If everyone would take their \n                         positions...\n\n               Everyone takes their places for the wedding procession. The \n               wind now takes this time to blow with much greater force. As \n               Father Falwell opens his Bible, the wind rips the pages out \n               of the Holy Book. They blow to the four corners of the Earth.\n\n<b>                                     FATHER FALWELL\n</b>                              (continuing)\n                         Oh, dear. Well, let's begin. And...\n\n               He hums the Wedding March. Chulo hums along. His humming is \n               a driving Jimi Hendrix-like guitar lick that all but drowns \n               out Father's humming.\n\n<b>               FATHER FALWELL\n</b>\n               He's orchestrating the proceedings.\n\n<b>                                     FATHER FALWELL\n</b>                         Flower Girls... Now Rick...\n                              (he gestures for him \n                              to start down the \n                              aisle)\n                         Good... Debbie and Mr. Thomerson.\n\n               As he gestures for them to make their walk to him, a gust of \n               wind lifts up Father's cassock, exposing his bare ass. He \n               quickly grabs his cassock and covers himself.\n\n<b>               RICK\n</b>\n               He begins to walk toward the priest. Suddenly, out of nowhere, \n               Cole appears at his side.\n\n<b>                                     RICK\n</b>                         Cole. Don't you know it's bad luck \n                         to see the groom before the wedding?\n\n<b>                                     COLE\n</b>                         I want Debbie.\n\n<b>                                     RICK\n</b>                         Cole...\n\n<b>                                     COLE\n</b>                         You dump her and I'll give you cash.\n\n<b>                                     RICK\n</b>                         What's Debbie's blue book value right \n                         now?\n\n<b>                                     COLE\n</b>                         Five thousand dollars.\n\n<b>                                     RICK\n</b>                         No.\n\n               They are now standing near Father Falwell. Debbie is \n               approaching them with Mr. Thomerson. Mr. T. shoots Cole a \n               signal to up the ante.\n\n<b>                                     COLE\n</b>                         Seventy-five hundred.\n\n<b>                                     RICK\n</b>                         Not interested.\n\n<b>                                     COLE\n</b>                         Okay, ten thousand plus a G.E. toaster \n                         oven, a Litton microwave, a \n                         Cuisinart...\n\n<b>                                     RICK\n</b>                         I'm marrying Debbie.\n\n<b>                                     COLE\n</b>                         Michelin tires... brand new. A set \n                         of Sears Best metric tools...\n\n<b>                                     RICK\n</b>                              (to O'Neill)\n                         What is this person's story here?\n\n<b>                                     O'NEILL\n</b>                         The way I see it, the big lug is in \n                         love and he's got a lot of major \n                         appliances lying around.\n\n               Debbie and Mr. T. have joined Rick.\n\n<b>                                     DEBBIE\n</b>                         Cole, what are you doing here?\n\n<b>                                     MR. THOMERSON\n</b>                         He's just trying to save you from \n                         making a mistake.\n                              (to Rick)\n                         A big mistake.\n\n<b>                                     RICK\n</b>                         Thanks, Dad.\n                              (to Cole)\n                         Cole, go away.\n\n<b>                                     COLE\n</b>                         He's gonna hurt you, Debbie. He'll \n                         never be true to you the way I would.\n\n<b>                                     RICK\n</b>                         Thank you. We'll all keep that in \n                         mind. 'Bye now.\n\n               Cole turns red with anger.\n\n<b>                                     COLE\n</b>                              (pissed)\n                         Rick, me and you aren't through yet.\n\n               He runs off.\n\n<b>                                     RICK\n</b>                              (a la talk show host)\n                         Ladies and gentlemen, Cole Whittier. \n                         Let's hear it for him -- a funny, \n                         funny guy. We love ya, babe.\n\n               The wind suddenly picks up. A storm is coming in off the \n               sea. Father Falwell's cassock blows up again. It starts to \n               rain and hail. Everyone runs for cover but Rick and O'Neill.\n\n<b>                                     RICK\n</b>                              (to O'Neill)\n                         You think the gods are telling me \n                         something?\n\n<b>               INT. RICK AND DEBBIE'S BEDROOM - NIGHT\n</b>\n               Rick is snuggled cozily on his side of the bed, fast asleep. \n               Debbie is staring anxiously at the ceiling. After a couple \n               of beats, she tugs at Rick's shoulder.\n\n<b>                                     RICK\n</b>                              (drowsy)\n                         Huh? Wha...\n\n<b>                                     DEBBIE\n</b>                         I can't sleep.\n\n<b>                                     RICK\n</b>                         Oh... I got something for that.\n\n               He groggily reaches into the nightstand, pulls out a hammer. \n               He raises it as if to hit Debbie over the head.\n\n<b>                                     DEBBIE\n</b>                         Stop fooling around... I need to \n                         talk.\n\n<b>                                     RICK\n</b>                         What's the matter?\n\n<b>                                     DEBBIE\n</b>                         I don't know... I just feel scared.\n\n<b>                                     RICK\n</b>                              (he sits up)\n                         About what?\n\n<b>                                     DEBBIE\n</b>                         The wedding, my parents, your family, \n                         our friends, my job, the future, our \n                         relationship, the caterers, my gown, \n                         your tuxedo, our honeymoon, the \n                         apartment, my shower, your bachelor \n                         party...\n\n<b>                                     RICK\n</b>                         I think the only think you've left \n                         out are our relations with the Soviet \n                         Union. Sweetheart, everything's gonna \n                         be all right.\n\n<b>                                     DEBBIE\n</b>                         Before or After I have my nervous \n                         breakfown?\n\n<b>                                     RICK\n</b>                         C'mere.\n\n               He starts to gently rub her shoulders. She breathes deeply, \n               trying to let go.\n\n<b>                                     DEBBIE\n</b>                         That feels so great.\n\n<b>                                     RICK\n</b>                         Good...\n\n<b>                                     DEBBIE\n</b>                         Um... that's very relaxing.\n\n<b>                                     RICK\n</b>                         Now, I want you to lie down and drift \n                         off to slumberland.\n\n               He slowly lowers her to her pillow and tucks the covers in \n               around her.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Close your eyes... that's it... \n                         There's nothing to worry about... I \n                         love you... I'm a great guy...\n                              (yawning)\n                         In two days you're gonna be Mrs. \n                         Great Guy.\n\n               He yawns again and turns off the light on the night table. \n               There is a beat of silence in the dark. We PUSH IN ON their \n               faces, which are faintly illuminated by a street light outside \n               the open window. Both of them have their eyes wide open as \n               they stare at the ceiling in fearful anticipation of the \n               next day.\n\n<b>               INT. AIRPORT - DAY\n</b>\n               The guys (except Gary) are walking through the busy airport.\n\n<b>                                     RYKO\n</b>                         You sure Gary's got this whole party \n                         deal together?\n\n<b>                                     CHULO\n</b>                         Yeah, man, he's got us a great room \n                         at the hotel and lots of chicks.\n\n<b>                                     RYKO\n</b>                         I hope so. Hundred bucks apiece is a \n                         lot of dinero.\n\n<b>                                     CHULO\n</b>                         What time are we supposed to get to \n                         the hotel?\n\n<b>                                     O'NEILL\n</b>                         Don't worry, Chulo, the party's not \n                         gonna start without you. We got plenty \n                         of time.\n\n<b>                                     STAN\n</b>                         I can't wait to see old Larry... \n                         It's been five years.\n\n<b>                                     RICK\n</b>                         At least.\n\n<b>               ANGLE - THE EXIT RAMP\n</b>\n               People are streaming out of the plane. Finally the last person \n               exits.\n\n<b>                                     O'NEILL\n</b>                         Where the hell is he?\n\n<b>                                     RICK\n</b>                         Knowing Larry, he probably missed \n                         the flight.\n\n<b>                                     STAN\n</b>                         There he is... Hey, Larry!\n\n<b>                                     LARRY\n</b>                              (talking very slowly)\n                         Guys... guys... guys...\n\n<b>                                     RICK\n</b>                         'Ludes... 'ludes... 'ludes.\n\n               Larry floats toward them and stops in front of them. He stares \n               at them strangely, looking from face to face.\n\n<b>                                     LARRY\n</b>                         God, I love you guys.\n\n               To the guys' surprise, he goes around hugging each one of \n               them.\n\n<b>                                     LARRY\n</b>                              (continuing)\n                         This makes me so happy.\n\n               They start walking toward the baggage claim area.\n\n<b>                                     O'NEILL\n</b>                         So, Larry, how have you been?\n\n<b>                                     LARRY\n</b>                         Just in love with everybody. It's \n                         really a beautiful planet. I love \n                         you, Rick. I love you guys. I love \n                         everybody.\n\n<b>                                     RICK\n</b>                         So how's your wife?\n\n               Larry stops walking and immediately breaks down.\n\n<b>                                     LARRY\n</b>                         I hate her. I hate her guts, the \n                         bitch.\n\n<b>                                     O'NEILL\n</b>                         Larry, you and your wife got problems?\n\n<b>                                     LARRY\n</b>                         I don't want to talk about it. I \n                         love you guys. I love my friends.\n\n               Larry reaches into his pocket, takes out a Quaalude.\n\n<b>                                     LARRY\n</b>                              (continuing)\n                         You want to share it?\n\n<b>                                     RICK\n</b>                         Naw, two on a Quaalude... bad luck.\n\n<b>                                     LARRY\n</b>                         Right.\n\n               He pops it in his mouth.\n\n<b>               EXT. TERMINAL\n</b>\n               The guys exit the Baggage Area. Rick is pushing Larry who is \n               sprawled out on top of his bags in a luggage cart.\n\n<b>                                     LARRY\n</b>                         My marriage is the worst. All crap. \n                         A big pile of shit.\n\n<b>                                     RICK\n</b>                         Maybe your marriage should lay off \n                         grains for a while.\n\n<b>                                     LARRY\n</b>                         She hates me. It's over. You'll see, \n                         as soon as you get married, everything \n                         changes. You sure you want to go \n                         through with it, man?\n\n<b>                                     RICK\n</b>                              (his interest peaked)\n                         What do you mean, it changes?\n\n               Before Larry can answer they reach the bus where Debbie is \n               waiting for them.\n\n<b>                                     DEBBIE\n</b>                              (hugging Larry)\n                         Larry, how are you?\n\n<b>                                     LARRY\n</b>                         Hi, Debbie, congratulations. Hey, do \n                         you know where there's a pharmacy \n                         around here so I can get a \n                         prescription filled?\n\n<b>                                     RICK\n</b>                         Come on, get him on the bus.\n\n               As a couple of the guys pick Larry up and carry him into the \n               bus we\n\n<b>                                                                    CUT TO:\n</b>\n<b>               INT. BUS - DUSK\n</b>\n               Rick is driving the bus with Debbie sitting next to him in \n               the driver's seat. The guys sit in the row of seats behind \n               them.\n\n<b>                                     RICK\n</b>                         Well... twenty-four more hours to go \n                         and tonight we'll share with our \n                         friends and loved ones the joys of \n                         those last moments of singleness.\n\n<b>                                     DEBBIE\n</b>                         You better not have too much joy.\n\n<b>                                     RICK\n</b>                         Wouldn't think of it. Because \n                         tomorrow...\n                              (starts singing)\n                         We're going to the chapel and we're...\n\n<b>                                     DEBBIE\n</b>                              (singing)\n                         Gonna get married...\n\n<b>               ANGLE - THE GUYS\n</b>\n               They start to join in the song in a little less than perfect \n               harmony.\n\n<b>                                     EVERYBODY\n</b>                         Going to the chapel and we're gonna \n                         get married.\n\n<b>                                     DEBBIE\n</b>                         Gee, I really love you...\n\n<b>                                     RICK\n</b>                         And we're gonna get ma-a-a-ried.\n\n<b>                                     EVERYBODY\n</b>                              (whooping it up)\n                         Going to the chapel of love.\n\n<b>                                     RICK\n</b>                         Yeah, yeah, oh, yeah.\n\n<b>               EXT. BUS\n</b>\n               The bus zooms down the street.\n\n<b>                                     EVERYBODY (V.O.)\n</b>                         Going to the chapel of love.\n\n<b>               EXT. THOMERSON'S - DUSK\n</b>\n               Rick's bus comes up to the driveway in front of the house \n               and stops.\n\n<b>               INT. RICK'S BUS - DUSK\n</b>\n<b>                                     RICK\n</b>                         This is it, lady. Last stop.\n\n<b>                                     DEBBIE\n</b>                         Can't I just go with you guys?\n\n<b>                                     RICK\n</b>                         Sorry, we got men's business to do. \n                         It's no place for a lady.\n\n               He opens the door, picks Debbie up and carries her out to \n               the sidewalk.\n\n<b>                                     DEBBIE\n</b>                         Remember, you promised... no screwing \n                         around.\n\n<b>                                     RICK\n</b>                         Did I promise that? I don't remember \n                         that...\n\n<b>                                     DEBBIE\n</b>                         You're really pissing me off.\n\n               She grabs Rick and wraps her arm around him in a playful \n               headlock.\n\n<b>                                     RICK\n</b>                         Okay, I promise... I swear on my \n                         mother's grave.\n\n<b>                                     DEBBIE\n</b>                         Your mother's not dead.\n\n<b>                                     RICK\n</b>                         Well, if I go back on my word, I'll \n                         kill her.\n\n               Debbie lets go of his neck.\n\n<b>                                     DEBBIE\n</b>                         Have a good time. Don't make it too \n                         late.\n\n<b>                                     RICK\n</b>                         Anything you say, ma'am. Have a fun \n                         shower. Use soap.\n\n<b>                                     DEBBIE\n</b>                         I love you.\n\n               They kiss, and the guys whistle in the background. Then Debbie \n               starts toward the house and Rick hops back into the bus. He \n               gets into the seat and sits there for a moment, watching \n               Debbie with a guilty look as she goes into the house.\n\n<b>                                     O'NEILL\n</b>                              (to Rick)\n                         What's the matter?\n\n<b>                                     RICK\n</b>                              (snapping out of it)\n                         Nothing... Let's get crazy!\n\n<b>                                     RYKO\n</b>                         All right!\n\n<b>                                     CHULO\n</b>                         When do the girls get to the party?\n\n<b>                                     O'NEILL\n</b>                         Don't worry, Gary's taking care of \n                         that now.\n\n               The guys holler and whoop it up as Rick puts the bus in gear \n               and takes off down the street.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               INT. GRIMY STREET CORNER - EVENING\n</b>\n               JUMBO, a well-dressed behemoth in a sky blue suit and \n               widebrimmed hat, is standing on a street corner talking to \n               Gary.\n\n<b>                                     GARY\n</b>                         So we want your best girls, the cream \n                         of your crop.\n\n<b>                                     JUMBO\n</b>                         Let's see your bread.\n\n               Gary takes out a roll of bills, which Jumbo grabs and quickly \n               counts.\n\n<b>                                     JUMBO\n</b>                              (continuing)\n                         Okay, I got just what you're looking \n                         for.\n                              (calling off)\n                         Margot... Darlene...\n\n               Two shapely HOOKERS in tight-fitting clothes come up to them.\n\n<b>                                     GARY\n</b>                         They'll do just fine. Hiya, girls. \n                         Look, after the orgy, maybe we could \n                         have coffee.\n\n               The girls look at him with \"Is he for real?\" in their eyes.\n\n<b>                                     JUMBO\n</b>                         Shorty, where's the party?\n\n               Gary takes some slips of paper out of his pocket and hands \n               Jumbo one.\n\n<b>                                     GARY\n</b>                         Park View Hotel, Room 1002.\n\n<b>                                     JUMBO\n</b>                         They'll be up there in a half hour.\n\n<b>                                     GARY\n</b>                         Okay. Nice to meet you both.\n\n               Gary turns, almost collides with a garbage can, and starts \n               walking down the street. He passes a parked Porsche. After a \n               beat, Cole Whittier sticks his head up and watches Gary walk \n               off. Then he hops out of his car and approaches Jumbo and \n               the girls.\n\n<b>                                     COLE\n</b>                         Hi. I must have just missed my friend. \n                         He hired you for a bachelor party.\n\n<b>                                     JUMBO\n</b>                         At the Park View Hotel, Room 1002. \n                         What about it.\n\n               Cole's face lights up. This is the information he needed.\n\n<b>                                     COLE\n</b>                         Yeah. Right.\n                              (takes out piece of \n                              paper)\n                         This is the new address. We changed \n                         our minds and decided to send the \n                         girls over to his house instead.\n\n               He takes out a fifty-dollar bill.\n\n<b>                                     COLE\n</b>                              (continuing)\n                         And here's a fifty... I want this to \n                         be a surprise, so you never saw me, \n                         okay?\n\n<b>                                     JUMBO\n</b>                              (pocketing the money)\n                         No problem.\n\n               Cole smiles happily as he slithers back to his car.\n\n<b>                                     COLE\n</b>                              (to himself)\n                         Now she'll see what kind of jackoff \n                         he is.\n\n<b>               ANGLE - HOTEL\n</b>\n               A parking VALET crosses to the bus as Rick hands him the \n               keys.\n\n<b>                                     RICK\n</b>                         Be careful with it. It's a rental.\n\n               The guys hop out with the enthusiasm of a home team that's \n               just won the state championship. They race in the front door. \n               A banner over the door reads: \"WELCOME MISS MOOSEHEAD BEER \n<b>               PAGEANT.\"\n</b>\n<b>               INT. HOTEL LOBBY - NIGHT\n</b>\n               This is a pretty plush place. The kind of hotel that prides \n               itself on its classy image. The guys are totally unaware of \n               the sedate atmosphere in the lobby as they go screaming toward \n               the elevators.\n\n<b>                                     O'NEILL\n</b>                              (to some dignified \n                              guests)\n                         We who are about to go ape shit salute \n                         you.\n\n<b>                                     RYKO\n</b>                         All right, I'm stoked!\n\n               Just as they are about to get into the elevator, a hand comes \n               INTO FRAME and holds the door so it will not close.\n\n               WIDEN TO INCLUDE the MANAGER. All their carrying-on stops \n               when the guys see him staring grimly at them. If he wasn't a \n               hotel manager, he'd be a mortician. He has a constant \n               expression on his face that suggests he's constantly sucking \n               lemons.\n\n<b>                                     MANAGER\n</b>                         Just where do you guys think you \n                         are?\n\n<b>                                     O'NEILL\n</b>                         The Library of Congress?\n\n<b>                                     CHULO\n</b>                         Detroit?\n\n<b>                                     LARRY\n</b>                         Beyond the sun?\n\n<b>                                     RICK\n</b>                         Are any of those right?\n\n<b>                                     MANAGER\n</b>                         This is the Park View Hotel. I'm the \n                         Hotel Manager. Are you looking for \n                         someone?\n\n<b>                                     RICK\n</b>                         Yes, you. We're looking for our \n                         room... 1002.\n\n               Rick takes out his key.\n\n<b>                                     MANAGER\n</b>                         It's on the tenth floor.\n\n<b>                                     RICK\n</b>                         What do you know, they moved it. \n                         Catch you later.\n\n               The door starts to close and the guys start yelling.\n\n<b>                                     MANAGER\n</b>                         Keep your voices down. This is a \n                         respectable establishment. We don't \n                         go for any funny business here. Just \n                         then a GUY with a Moosehead Beer hat \n                         and TWO GUYS in a moose costume pass \n                         him and enter the elevator with the \n                         boys.\n\n<b>                                     RICK\n</b>                         I see what you mean... You're a \n                         beautiful guy. And you're doing a \n                         damn good job.\n\n               The door slams shut before the Manager can say anything else.\n\n<b>               INT. THE THOMERSON'S - NIGHT\n</b>\n               Several of Debbie's friends have arrived and are chatting \n               amiably in the living room. Phoebe is dipping potato chips \n               into a bowl that says \"Muffy\" on it.\n\n<b>                                     PHOEBE\n</b>                         Do you have any more of this dip, \n                         Mrs. Thomerson? It's really excellent.\n\n<b>                                     MRS. THOMERSON\n</b>                         You just ate Purina Cat Chow.\n\n<b>                                     PHOEBE\n</b>                         Gross me out...\n\n               Debbie comes into the living room and sits next to Bobbie.\n\n<b>                                     DEBBIE\n</b>                              (concerned)\n                         What do you think's gonna go on at \n                         the guys' party?\n\n<b>                                     BOBBIE\n</b>                         They'll probably get drunk, and watch \n                         dirty movies. But don't worry about \n                         the dirty movies.\n\n<b>                                     DEBBIE\n</b>                         What do you mean?\n\n<b>                                     BOBBIE\n</b>                         I forgot to tell you. Yesterday I \n                         found a bunch of pornos in the back \n                         seat of O'Neill's car.\n\n<b>                                     DEBBIE\n</b>                         You're kidding.\n\n<b>                                     BOBBIE\n</b>                         Nah. Everything's cool... I took \n                         care of 'em.\n                              (starts to giggle)\n\n<b>               EXT. HOTEL HALLWAY - NIGHT\n</b>\n               Rick, Ryko, O'Neill, Chulo, Larry and Stan are walking down \n               the hallway, looking for their room.\n\n<b>                                     O'NEILL\n</b><b>                         1004, 1003...\n</b>                              (spots the room)\n                         Aha! 1002.\n\n               The guys give out a hearty cheer as they huddle around the \n               door. O'Neill grabs the doorknob. He takes his time, playing \n               up the moment.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         And now...\n\n               The guys lean forward, anticipating the opening of the gates \n               of heaven.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         ...to our honored guest Rick, and \n                         his life-long friends, I say...\n                              (turns the doorknob)\n                         ...gentlemen, start your boners.\n\n               He flings open the door and everyone but he and Rick burst \n               into the room.\n\n<b>               INT. HOTEL SUITE - NIGHT\n</b>\n               The guys all but dive into the room. It is a two-room suite \n               with living room/kitcheonette and separate bedroom. The room \n               has been decorated with balloons. A sign reads: \"Happy \n               Bachelor Party!\" It looks far from professionally decorated. \n               Chulo frantically checks out the rooms.\n\n<b>                                     RYKO\n</b>                         Bitchin' place.\n\n               He hangs a chin-up bar in a doorway and starts to chin \n               himself.\n\n<b>                                     O'NEILL\n</b>                         I did the balloons myself.\n\n               He takes a prophylactic out of a Trojan carton. He blows it \n               up. On closer examination, we SEE all the balloons are \n               inflated prophylactics.\n\n<b>               ANOTHER ANGLE\n</b>\n               Chulo returns from his search of the rooms.\n\n<b>                                     CHULO\n</b>                              (crazed)\n                         Where's the women, man? We gotta \n                         have women.\n\n<b>                                     O'NEILL\n</b>                         Chulo, one thing at a time.\n\n<b>                                     CHULO\n</b>                         Sex is my one thing. I'm good at it.\n\n<b>                                     STAN\n</b>                         What's first?\n\n<b>                                     O'NEILL\n</b>                         A bit of a warm-up.\n\n               He threads a film projector.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         We'll spend an hour with \"Nymphos \n                         Without Pants\"...\n\n<b>                                     RICK\n</b>                         Olivier's in that, right?\n\n<b>                                     O'NEILL\n</b>                         Then it's on to the real thing.\n\n<b>                                     GUYS\n</b>                              (cheering)\n                         All right!\n\n               Ryko flips off the lights as O'Neill puts the projector into \n               forward and the title flashes on a movie screen. All the \n               guys yell in anticipation.\n\n<b>               HOME MOVIE SCREEN\n</b>\n               We SEE a man stepping out of a shower. He puts on his robe \n               and exits the bathroom. To his surprise and to the delight \n               of our guys, two young, beautiful Nordic looking women, \n               dressed in micro-minis and see-through blouses stand waiting \n               for him.\n\n<b>                                     CHULO (O.S.)\n</b>                         They're Danish, I know it. I'm crazy \n                         for Danes.\n\n<b>               RYKO AND CHULO\n</b>\n               sit watching the screen.\n\n<b>                                     RYKO\n</b>                              (to Chulo)\n                         Denmark makes great Nautilus \n                         equipment.\n\n<b>                                     CHULO\n</b>                         I'd like to jerk and press those \n                         babies.\n\n<b>               RICK AND O'NEILL\n</b>\n<b>                                     RICK\n</b>                              (to O'Neill)\n                         And I thought we wouldn't have any \n                         meaningful conversation.\n\n<b>               ON SCREEN\n</b>\n               The man takes off his robe. The girls start to seductively \n               undress.\n\n<b>                                     GUYS (O.S.)\n</b>                              (excitedly)\n                         All right, yeah, yeah, yeah...\n\n               Suddenly an abrupt jump cut. The girls are undressed and \n               lying on top of the man. Our guys are seriously let down.\n\n<b>               GUYS\n</b>\n<b>                                     EVERYONE\n</b>                              (disappointed)\n                         Awwww...\n\n<b>               O'NEILL\n</b>\n               He can't figure it out.\n\n<b>               ON THE SCREEN\n</b>\n               As the women kiss the man from his head slowly down his chest, \n               past his navel and heading south...\n\n<b>               GUYS\n</b>\n               Their eyes start to widen like a child in a Keene painting.\n\n<b>                                     GUYS\n</b>                         Yes, go, go, yes, go...\n\n<b>               ON THE SCREEN\n</b>\n               Another abrupt jump cut spliced together with what looks \n               like a band-aid, and the girls are sitting on the side of \n               the bed. The man is recovering from the best sex he's ever \n               encountered.\n\n<b>               GUYS\n</b>\n<b>                                     GUYS\n</b>                              (disappointed)\n                         Awwwwww...\n\n               Rick turns to a shocked O'Neill.\n\n<b>                                     RICK\n</b>                         Excuse me, but this is as arousing \n                         as a stroll through the Vatican.\n\n<b>                                     O'NEILL\n</b>                         This isn't right.\n\n<b>               GUYS' POV\n</b>\n               They watch the screen. The two women seem to be taking a \n               liking to each other. They begin to fall onto the bed and \n               entwine.\n\n<b>                                     GUYS\n</b>                         Please, yes, do it, yes, yes, oh \n                         yes...\n\n               A jump cut and they are dressing. Stan can't take it anymore. \n               He jumps to his feet.\n\n<b>                                     STAN\n</b>                         Where are the dirty parts? I'm a \n                         doctor. I can see these things.\n\n<b>                                     CHULO\n</b>                         What a waste of two women.\n\n               O'Neill rises abruptly.\n\n<b>                                     O'NEILL\n</b>                         I don't get it, but at least Gary's \n                         got the real stuff coming up here in \n                         a few minutes.\n\n<b>                                     CHULO\n</b>                              (in ecstasy)\n                         Women!\n\n               Everyone cheers.\n\n<b>               INT. THOMERSON HOUSE\n</b>\n               The girls are having a great time. The front DOORBELL RINGS. \n               Mrs. Thomerson answers it. Standing in the doorway is Tina \n               Stahl, Stan's wife; she's late for the shower. Behind her \n               are two obvious hookers: Margot and Darlene. Tina doesn't \n               know either of the girls.\n\n<b>                                     MRS. THOMERSON\n</b>                         Yes?\n\n               Before Tina can speak, Margot speaks up. She's reading from \n               the piece of paper Cole gave her.\n\n<b>                                     MARGOT\n</b>                              (through heavy gum \n                              chewing)\n                         Yeah, hi. Look, is this...\n\n<b>               INSERT - PIECE OF PAPER\n</b>\n               Margot reads the address.\n\n<b>                                     MARGOT (O.S.)\n</b>                         838 North Franek Avenue?\n\n<b>               BACK TO SCENE\n</b>\n<b>                                     MRS. THOMERSON\n</b>                         Yes.\n\n<b>                                     MARGOT\n</b>                         We're here.\n\n<b>                                     MRS. THOMERSON\n</b>                         How nice.\n\n<b>                                     TINA\n</b>                         I'm Tina Stahl.\n\n<b>                                     MRS. THOMERSON\n</b>                         Of course. Stan's wife... Everyone \n                         come in.\n\n<b>               REVERSE ANGLE - THE STREET\n</b>\n               Cole sits in his car and watches happily as the hookers go \n               inside.\n\n<b>               INT. THOMERSON'S LIVING ROOM\n</b>\n               Debbie spots Tina. She is oblivious to the two hookers.\n\n<b>                                     DEBBIE\n</b>                         Tina!\n\n               They give each other a big hug. The hookers watch closely. \n               Debbie leads Tina to the other women.\n\n<b>                                     DEBBIE\n</b>                              (continuing)\n                         You know everyone here, don't you?\n\n<b>                                     TINA\n</b>                         Yes.\n\n               The girls hug and give big hellos. Meanwhile, Margot and \n               Darlene have come to the conclusion they've been hired for a \n               kinky scene.\n\n<b>                                     MARGOT\n</b>                         One of these, huh?\n\n<b>                                     DARLENE\n</b>                         Looks that way.\n\n<b>                                     MARGOT\n</b>                         Buck's a buck.\n\n               They start to unbutton their coats.\n\n               Tina hands Debbie her present.\n\n<b>                                     DEBBIE\n</b>                         It's so heavy.\n\n               She sits and the girls gather around as she starts to open \n               the gift.\n\n               Phoebe happens to look off and is stunned by what she sees. \n               The others are curious at what she is looking at and they \n               too stare O.S., stunned to silence.\n\n<b>               MARGOT AND DARLENE\n</b>\n               dressed in leather and mesh stockings. Margot carries a whip. \n               Darlene is holding a phallic electrical device.\n\n<b>                                     DARLENE\n</b>                              (business-like)\n                         Is there an empty outlet in here?\n\n               Debbie unconsciously points to a nearby wall. Margot and \n               Darlene stand amidst the girls. Darlene plugs in her device. \n               She and Margot start to embrace and fondle one another. The \n               girls watch in stony silence. Dumbfounded at what they see. \n               Margot and Darlene start to sink to the floor, OUT OF OUR \n               SIGHT. Before they disappear, we see Margot take out her gum \n               and park it on an end table. Now OUT OF SIGHT, the girls \n               watch for a beat. Then we hear the WHIRRING of Darlene's \n               implement. Our girls screech in horror and hold onto one \n               another in a protective clump.\n\n<b>               INT. HOTEL SUITE\n</b>\n               The guys are sitting around drinking, eating and looking \n               generally bored. Chulo sits in front of the TV, glumly \n               watching an old \"I Love Lucy\" re-run.\n\n<b>                                     CHULO\n</b>                         If I was Ricky Ricardo I would beat \n                         the shit out of that chick.\n\n<b>                                     LARRY\n</b>                              (totally ripped, \n                              staring at the black \n                              and white image)\n                         Wow! The colors are sooo beautiful.\n\n               Chulo gives him a strange look.\n\n<b>                                     RYKO\n</b>                              (opening a beer, \n                              reading the label)\n                         Isn't there any beer that's not \n                         imported? All this stuff's from St. \n                         Louis.\n\n<b>                                     RICK\n</b>                              (calling to imaginary \n                              person O.S.)\n                         Bartender, round of brains for my \n                         friend here.\n\n               Gary enters the room. He's all smiles. Confident he's done a \n               great job arranging for the entertainment.\n\n<b>                                     GARY\n</b>                         How's it going, guys?\n\n               Everyone crowds around him like children greeting Daddy. \n               Looking for candy hidden in his coat.\n\n<b>                                     EVERYONE\n</b>                         Where's the girls? Where's the girls?\n\n               Rick pushes them away from Gary like a referee separating \n               two fighters.\n\n<b>                                     RICK\n</b>                         Give the guy air. Everyone to a \n                         neutral corner.\n\n<b>                                     GARY\n</b>                         What's going on?\n\n<b>                                     CHULO\n</b>                         Nothing. We got no women.\n\n<b>                                     GARY\n</b>                         Screw you.\n\n<b>                                     RICK\n</b>                         It's true.\n\n<b>                                     GARY\n</b>                         This place should have been wall to \n                         wall tits by now.\n\n<b>                                     RICK\n</b>                              (to O'Neill)\n                         Guy paints a beautiful picture.\n\n<b>                                     GARY\n</b>                         I'm going to see what the hell \n                         happened.\n\n<b>                                     RICK\n</b>                         Looks like the only one who got \n                         screwed here was you.\n\n<b>                                     GARY\n</b>                         Screw that.\n\n               He exits out the door.\n\n<b>                                     O'NEILL\n</b>                         So, what do you guys think of the \n                         party so far?\n\n               The guys toss sandwiches and empty beer cans at him.\n\n<b>                                     RICK\n</b>                              (putting his arm around \n                              O'Neill)\n                         Well, I think you've done a damn \n                         fine job.\n\n               Everyone pelts Rick and O'Neill with more junk.\n\n               Suddenly the door bursts open. The guys look up and are \n               surprised to see Cole enter.\n\n<b>                                     COLE\n</b>                         Rick, I want to talk to you.\n\n<b>                                     RICK\n</b>                         Ah, Cole.\n                              (turns to the others)\n                         I don't remember ordering an asshole \n                         from room service.\n\n               Cole enters, closing the door behind him.\n\n<b>                                     COLE\n</b>                         I don't want any trouble.\n\n<b>                                     RICK\n</b>                         Oh, come on, just a little.\n\n<b>                                     COLE\n</b>                         I'm ready to make you another deal.\n\n<b>                                     RICK\n</b>                              (mock excitement)\n                         Ooh, be still, my heart.\n\n<b>                                     COLE\n</b>                              (points out window)\n                         See that down there? That's my most \n                         prized possession. My new Porsche.\n\n<b>               RICK'S POV\n</b>\n               Cole's Porsche parked in the hotel parking lot.\n\n<b>                                     RICK (O.S.)\n</b>                         Very nice...\n\n<b>               BACK TO SCENE\n</b>\n               Rick gestures to Chulo to look out the window.\n\n<b>                                     RICK\n</b>                              (his voice tells us \n                              he has something in \n                              mind)\n                         Isn't that a great car, Chulo?\n\n               Chulo gets Rick's drift.\n\n<b>                                     CHULO\n</b>                         Yeah... real nice. Ah, excuse me. \n                         I'll be right back.\n\n               He starts to exit. Before he does, he grabs a hanger out of \n               the closet.\n\n<b>                                     COLE\n</b>                         Great car.\n\n<b>                                     RICK\n</b>                         The best.\n\n<b>                                     COLE\n</b>                         I love that car.\n\n<b>                                     RICK\n</b>                         I'm very happy for you two.\n\n               They back away from the window.\n\n<b>                                     COLE\n</b>                         I'll trade you my Porsche for Debbie. \n                         An even swap.\n\n<b>                                     RICK\n</b>                              (surprised)\n                         The car for Debbie?\n\n<b>                                     COLE\n</b>                              (getting a little \n                              excitable)\n                         I mean it. The car is yours. Dump \n                         Debbie.\n\n<b>                                     RICK\n</b>                         Gee, guys, what should I do? The car \n                         or Debbie?\n\n               All the guys treat this as if it's \"Let's Make A Deal\". They \n               take sides, yelling out, \"Take the car,\" \"Keep Debbie.\" Over \n               the din we hear a befuddled Rick.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         What a decision here.\n\n               He walks over to the window. Cole follows closely. He's trying \n               to convince Rick to take the car.\n\n<b>                                     COLE\n</b>                         Low mileage... Handles like a dream.\n\n<b>                                     RICK\n</b>                         So does Debbie.\n\n<b>               EXT. HOTEL PARKING LOT - NIGHT\n</b>\n               Chulo is using the hanger to jimmy the car lock on Cole's \n               Porsche. He's successful. He jumps into the car and drives \n               off.\n\n<b>               INT. HOTEL SUITE\n</b>\n               Rick and Cole are at the window. The guys are still trying \n               to convince Rick on his decision.\n\n<b>                                     COLE\n</b>                         I got the car only two months ago -- \n                         it's got --\n\n               As he looks out the window we see with him that his car is \n               gone.\n\n<b>                                     COLE\n</b>                              (continuing)\n                         Shit, shit, shit, shit. My car's \n                         gone!\n\n<b>                                     RICK\n</b>                         Maybe it had something to do.\n\n<b>                                     COLE\n</b>                         Shit!\n\n               He charges out of the room.\n\n<b>                                     O'NEILL\n</b>                         Odd. He's only been gone a few seconds \n                         and I already miss him.\n\n<b>               EXT. STREET CORNER - NIGHT\n</b>\n               Gary spots Jumbo on the same grimy street corner. He's pimping \n               for one of his ladies and makes a sale to an anxious young \n               Marine as Gary approaches him.\n\n<b>                                     GARY\n</b>                         Jumbo, where the hell are the women?\n\n<b>                                     JUMBO\n</b>                         What are you talking about, asshole?\n\n<b>                                     GARY\n</b>                         Your whores never showed up.\n\n<b>                                     JUMBO\n</b>                         They left an hour ago, pink nuts.\n\n<b>                                     GARY\n</b>                         Screw you!\n\n               Jumbo has had enough. He backs Gary against a wall and pulls \n               a knife on him.\n\n<b>                                     JUMBO\n</b>                              (irritated; a lot)\n                         That's it, prick lips.\n\n<b>                                     GARY\n</b>                         What are you...\n\n<b>                                     JUMBO\n</b>                         I've had it, numb nuts... How much \n                         money you got?\n\n<b>                                     GARY\n</b>                         Why?\n\n<b>                                     JUMBO\n</b>                         Because I'm pissed off. Now give me \n                         your cash.\n\n               Gary hurriedly digs into his pockets and gives Jumbo his \n               money.\n\n<b>                                     GARY\n</b>                         This is bad public relations. I was \n                         planning to do a lot of business \n                         with you. But now I'm going to have \n                         to go elsewhere.\n\n<b>                                     JUMBO\n</b>                              (mock sincerity)\n                         Hey. I'm sorry. You want girls. I'll \n                         give you girls.\n\n               He snaps his fingers and TWO of his LADIES come forward.\n\n<b>                                     JUMBO\n</b>                              (continuing; to girls)\n                         Give him the works.\n\n<b>                                     GARY\n</b>                         That's more like it.\n\n               The girls walk over to Gary and proceed to beat the crap out \n               of him.\n\n<b>               EXT. CHIPPENDALE'S - NIGHT\n</b>\n               It is a garish nightclub. A large lighted billboard proclaims \n               \"ALL MALE... ALL NUDE.\" Two cars pull into the parking lot. \n               Debbie and all of her shower guests get out.\n\n<b>                                     DEBBIE\n</b>                         Are you sure this is a good idea?\n\n<b>                                     ILENE\n</b>                         Look, you heard what those hookers \n                         said. They were supposed to go to a \n                         bachelor party.\n\n<b>                                     DEBBIE\n</b>                         That doesn't mean it was Rick's party.\n\n<b>                                     ILENE\n</b>                         Debbie, men are pigs -- if they can \n                         have women, we can have men.\n\n<b>                                     BOBBIE\n</b>                              (agreeing)\n                         Yeah.\n\n<b>                                     MRS. THOMERSON\n</b>                              (reluctantly)\n                         I don't know about this.\n\n<b>                                     DEBBIE\n</b>                         C'mon, Mother, it'll be fun.\n\n               The girls giggle as they enter the place, with Mrs. Thomerson \n               following reluctantly behind.\n\n<b>               INT. CHIPPENDALE'S - NIGHT\n</b>\n<b>                                     PHOEBE\n</b>                         Look at that guy. What a hunk.\n\n<b>                                     BOBBIE\n</b>                         Check out the other guy's buns.\n\n<b>                                     TINA\n</b>                         Let's sit over here.\n\n               They head for some empty tables. Debbie notices her mother \n               is still standing transfixed by the MAN on display on stage. \n               Debbie grabs her by the shoulder.\n\n<b>                                     DEBBIE\n</b>                         C'mon, Mom.\n\n               On the way to the table they pass MICHAEL, the bartender, \n               who looks at them and immediately recognizes Debbie. Finding \n               this interesting, he picks up a phone and dials.\n\n<b>                                     MICHAEL\n</b>                              (softly; into phone)\n                         Yes... is there a Rick Stahl \n                         registered there?\n\n<b>               INT. HOTEL SUITE\n</b>\n               Gary, beaten up, his clothes ripped, stands amidst the guys.\n\n<b>                                     RICK\n</b>                         Hookers beat you up?\n\n<b>                                     GARY\n</b>                         Yes.\n\n<b>                                     RICK\n</b>                         I didn't know you were into that.\n\n<b>                                     CHULO\n</b>                         How could you be so stupid. I'm gonna \n                         kill you.\n\n<b>                                     GARY\n</b>                         Go ahead, but if you want women, we \n                         need more money.\n\n<b>                                     RYKO\n</b>                         This just isn't righteous.\n\n<b>                                     GARY\n</b>                              (angered)\n                         Screw you... Do me a favor, join \n                         this decade, will ya, pal!\n\n<b>                                     RICK\n</b>                              (as if he's working a \n                              fundraiser)\n                         Hey, now, our buddy needs help. Come \n                         on, dig into those pockets. Help \n                         this man.\n                              (puts his arm around \n                              Gary)\n                         Help this person help others get \n                         laid. Give till it hurts. He needs \n                         you.\n\n               The guys take out money. Larry stands and digs into his pocket \n               for his wallet. Along with the wallet comes dozens of pills. \n               The PHONE RINGS.\n\n<b>                                     RICK\n</b>                         And there's our first pledge coming \n                         in --\n\n               Rick picks up the receiver.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Hello. End Horniness Telethon. Yeah. \n                         Michael... how you doing?\n\n<b>               INT. CHIPPENDALE'S - MICHAEL\n</b>\n               He's standing behind the bar.\n\n<b>                                     MICHAEL\n</b>                         I'm working... Right. At \n                         Chippendale's. Guess what. Debbie \n                         and her friends just walked in.\n\n<b>               INT. HOTEL SUITE\n</b>\n<b>                                     RICK\n</b>                              (surprised)\n                         Really? That's very interesting.\n                              (he brightens)\n                         I'll tell you what... stay there and \n                         we'll be right down. I want to check \n                         this out.\n\n               He hangs up the phone. Gary, meantime, has collected his \n               money.\n\n<b>                                     GARY\n</b>                         I'll be back with women.\n\n<b>                                     STAN\n</b>                         I might as well have left my genitals \n                         at home, the good they're doing me \n                         here.\n\n<b>                                     CHULO\n</b>                              (calling after Gary)\n                         Hurry back.\n\n               Gary exits.\n\n<b>                                     RICK\n</b>                              (it's obvious he has \n                              something in mind)\n                         While we're waiting for Gar, why \n                         don't we all go for a little fresh \n                         air.\n\n<b>                                     RYKO\n</b>                         Where we going?\n\n<b>                                     RICK\n</b>                         Out.\n\n               The guys start toward the door.\n\n<b>                                     LARRY\n</b>                              (zonked and depressed)\n                         Guys, I think I'd rather stay here.\n\n<b>                                     RICK\n</b>                         C'mon, Larry. Be good for you.\n\n<b>                                     LARRY\n</b>                         I just want to be alone.\n\n<b>                                     RICK\n</b>                         All right. Now, there's milk and \n                         cookies in the refrigerator. Go to \n                         bed right after \"Falcon Crest.\"\n\n               As Larry slumps on the couch, the guys exit.\n\n<b>               EXT. HOTEL\n</b>\n               Rick and the guys exit the hotel. As they exit, Mr. Thomerson \n               enters. Both parties are oblivious to the other's presence.\n\n<b>               INT. HOTEL\n</b>\n               Mr. Thomerson is greeted by a Moosehead Beer EXECUTIVE who \n               is wearing a straw hat that says \"Moosehead Beer.\"\n\n<b>                                     EXECUTIVE\n</b>                         Ed, we're so glad you could come \n                         over at the last minute and judge \n                         our little beauty pageant.\n\n<b>                                     MR. THOMERSON\n</b>                         My pleasure, Al... Always happy to \n                         help out in a pinch...\n                              (looking around)\n                         Excuse me. I better call my service... \n                         tell them where I am.\n\n               He enters a phone booth and starts to dial.\n\n<b>                                     MR. THOMERSON\n</b>                              (to executive, covering \n                              mouthpiece)\n                         I had to get out of the house anyway \n                         tonight. The wife is throwing a bridal \n                         shower for my daughter.\n                              (into phone)\n                         This is Ed Thomerson. Please transfer \n                         my calls to...\n                              (reading number off \n                              phone)\n                         220-1892. Right.\n\n               He crosses with executive toward the ballroom.\n\n<b>                                     EXECUTIVE\n</b>                         Congratulations on your daughter's \n                         wedding. Who's she marrying?\n\n<b>                                     MR. THOMERSON\n</b>                         A real turd.\n\n<b>                                     EXECUTIVE\n</b>                              (at a loss for words)\n                         Well... hope she'll be very happy.\n\n               They exit into ballroom.\n\n<b>               INT. CHIPPENDALE'S KITCHEN - NIGHT\n</b>\n               Amidst the kitchen activities we SEE Rick, O'Neill, Ryko, \n               Stan, and Michael.\n\n<b>                                     RICK\n</b>                         So will your friend Nick do it?\n\n<b>                                     MICHAEL\n</b>                         He'll do anything for money.\n\n<b>                                     RICK\n</b>                         I love his attitude.\n                              (calling off)\n                         They still out there?\n\n<b>               STAN\n</b>\n               He's peeking through the kitchen door. We SEE Debbie and the \n               shower girls whooping it up at a ringside table. Stan turns \n               back to Rick.\n\n<b>                                     STAN\n</b>                         Breathing heavy at ringside.\n\n               He joins the other guys.\n\n<b>                                     RICK\n</b>                              (a la Long John Silver)\n                         So, they want action, eh? Are you \n                         with me, me hardies?\n\n               The guys shout approval as NICK, one of the male dancers, \n               enters carrying a tray of food. Nick is a muscled hunk.\n\n<b>                                     MICHAEL\n</b>                         Guys, this is Chippendale's star \n                         attraction, Nicholas Carter... better \n                         known as Nick the Dick.\n\n<b>                                     RYKO\n</b>                         Nick the what?\n\n               Nick drops his pants. Since he's being SHOT only from the \n               WAIST UP, we can't see what the guys see.\n\n<b>                                     NICK\n</b>                              (proudly)\n                         The Dick.\n\n<b>                                     ALL OUR GUYS\n</b>                              (astonished at this \n                              O.S. sight)\n                         Jesus Christ!\n\n<b>                                     RICK\n</b>                         Let's get this thing going. Tray, \n                         please.\n\n               Nick holds the tray waist high. Rick arranges the food.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Looks good. Can I have the bun, \n                         Michael?\n\n               Michael hands Rick a hot dog bun. Rick places it on the tray. \n               He turns to Nick.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         And now, Nick... or is it Mr. Dick?\n\n<b>                                     NICK\n</b>                         Nick.\n\n<b>                                     RICK\n</b>                         Nick, if you would be so kind...\n\n<b>               NICK\n</b>\n               He holds the tray with one hand. With the other he reaches \n               OUT OF FRAME. In a nutshell, what he does is place his honker \n               in the hot dog bun. As he slaps his business into the bun, \n               we HEAR a solid THUMP.\n\n<b>                                     RICK\n</b>                         Nick, the rest is all yours.\n\n<b>                                     NICK\n</b>                              (excusing himself)\n                         Gentlemen.\n\n               He exits. As he does, our guys crowd around and peek through \n               the kitchen door.\n\n<b>               NICK\n</b>\n               We FOLLOW him as he approaches the girls' table.\n\n<b>                                     NICK\n</b>                         If you ladies would like to serve \n                         yourselves...\n\n               The girls grab their orders. Mrs. T. is last. Hers is the \n               hot dog. She points to it.\n\n<b>                                     MRS. THOMERSON\n</b>                         Is this the foot long?\n\n<b>                                     NICK\n</b>                         And then some.\n\n               Mrs. T. grabs the hot dog. It won't come off the tray. She \n               yanks harder. Nick drops the tray and Mrs. T. finally comes \n               to realize what she is pulling on. She screams in terror. \n               Because of sheer fright, she can't seem to drop Nick's schlong \n               from her grip. The rest of our ladies look to see Mrs. T. 's \n               hot dog. They scream in shock. Debbie spits out her \n               marguerita, hitting Phoebe in the face.\n\n<b>               OUR GUYS\n</b>\n               They are busting a gut watching the girls' reactions.\n\n<b>                                     ILENE\n</b>                         She looks up just in time to see the \n                         guys close the kitchen door.\n\n<b>               MRS. T\n</b>\n               still frozen in a state of shock. The girls try to pry her \n               hands off.\n\n<b>               EXT. STREET CORNER\n</b>\n               Several HOOKERS are standing around. Gary approaches them.\n\n<b>                                     GARY\n</b>                         Ladies... come here.\n\n<b>                                     HOOKER\n</b>                         Talk to the pimp.\n\n               She gestures to a MAN with his back TO US.\n\n<b>                                     GARY\n</b>                         Let's talk.\n\n               The PIMP turns around and we SEE he is the stereotypical \n               pimp. One big difference: he's an Indian straight from the \n               streets of Calcutta. He's soft-spoken and ever smiling and \n               he still hasn't quite mastered English.\n\n<b>                                     RAJAH\n</b>                              (oh-so-heavy Indian \n                              accent)\n                         What can I be doing for you?\n\n<b>                                     GARY\n</b>                         You're a pimp?\n\n<b>                                     RAJAH\n</b>                         I'm telling you I am, Joe.\n\n<b>                                     GARY\n</b>                         I want women.\n\n<b>                                     RAJAH\n</b>                         That I got. Very good women. They \n                         sit on your face, anything you want.\n\n<b>                                     GARY\n</b>                         I'll take some.\n\n<b>                                     RAJAH\n</b>                         Big problem now. Soon they go to \n                         customers.\n\n<b>                                     GARY\n</b>                         I need them for a bachelor party at \n                         the Park View Hotel.\n\n<b>                                     RAJAH\n</b>                         You are being in luck. Customers in \n                         same hotel. I let you have them at \n                         cut-rate price for 45 minutes.\n\n<b>                                     GARY\n</b>                         Sold. 45 minutes. No problem.\n\n<b>                                     RAJAH\n</b>                         Not one minute longer or Milt will \n                         come for you.\n\n<b>                                     GARY\n</b>                         Milt?\n\n<b>               ANOTHER ANGLE\n</b>\n               MILT joins them. Milt is a massive hulk. A bearded exbiker. \n               He could have come out of an MX silo. A menacing mountain of \n               a man decked out in a cowboy hat.\n\n<b>                                     RAJAH\n</b>                         This being Milt.\n\n               Milt casually takes off his hat and immediately sticks his \n               face through a nearby window, smashing it to pieces. He pulls \n               his head out, smiles and puts his hat back on.\n\n<b>                                     RAJAH\n</b>                              (continuing)\n                         Girls back in 45 minutes or Milt \n                         cuts your balls off. Fair enough? \n                         Shake!\n\n               Gary extends his hand and they shake.\n\n<b>                                     GARY\n</b>                              (to himself as he \n                              walks to his car)\n                         I just bet my balls and shook on it.\n\n<b>               EXT. HOTEL - NIGHT\n</b>\n               The guys are piling back out of the bus into the hotel. The \n               Manager watches them suspiciously.\n\n<b>               INT. HOTEL SUITE\n</b>\n               Rick, O'Neill, Ryko and Stan come back into the room.\n\n<b>                                     RICK\n</b>                              (concerned; calling \n<b>                              O.S.)\n</b>                         Larry! Yo, Larry.\n\n               Rick crosses to the bathroom door, opens it and goes in.\n\n<b>               RICK'S POV\n</b>\n               Larry is on his knees on the side of the tub with his head \n               submerged fully under several inches of water.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         What are you doing?\n\n               Larry comes out of the water. He gasps for breath and speaks.\n\n<b>                                     LARRY\n</b>                         I'm killing myself.\n\n               He takes a deep breath and submerges his head again. Rick \n               unplugs the tub and it begins to drain.\n\n<b>                                     RICK\n</b>                         Larry... you've got to lighten up. \n                         You and the wife can work it out.\n\n               The water has drained from the tub, leaving Larry high and \n               dry. He lifts his head out of the tub. In his state, he's \n               unaware that the water is gone. He gasps for air as Rick \n               holds him up.\n\n<b>                                     RICK\n</b>                         Lar... sometimes when people are mad \n                         they say things they don't mean.\n\n<b>                                     LARRY\n</b>                         No, she hates me... I want to end \n                         everything here... now.\n\n               Larry takes a deep breath and plunges his head into the tub. \n               His head hits the waterless tub bottom with a loud THUD. He \n               goes limp from the concussion. His body drapes into the tub, \n               head first.\n\n<b>                                     RICK\n</b>                         You okay?\n\n<b>                                     LARRY\n</b>                         Yeah, I guess so.\n\n<b>                                     RICK\n</b>                         Really?\n\n<b>                                     LARRY\n</b>                         Yeah. I see you're right. C'mon, \n                         let's party.\n\n               Larry gets up and exits the room. PUSH IN ON Rick. He looks \n               after Larry, concerned.\n\n<b>                                     RICK\n</b>                              (to himself)\n                         He ain't all right.\n\n<b>               ANGLE - THE LOBBY\n</b>\n               Cole sits in a phone booth holding the receiver impatiently.\n\n<b>               ANGLE WIDENS TO REVEAL THE ADJOINING PHONE BOOTH\n</b>\n               The receiver is off the hook. After a beat, Mr. T. crosses \n               to the phone. Cole does not see him, and vice versa.\n\n<b>                                     MR. T\n</b>                         Hello?\n\n<b>                                     COLE\n</b>                         Mr. Thomerson.\n\n<b>                                     MR. T\n</b>                         Yes, son, did you find out where the \n                         bachelor party is?\n\n<b>                                     COLE\n</b>                         Yes I did.\n\n<b>                                     MR. T\n</b>                         Fine. How's everything going?\n\n<b>                                     COLE\n</b>                         Not so good. He wouldn't listen to \n                         reason. He stole my car... my \n                         Porsche... I can't find it anywhere...\n\n<b>                                     MR. THOMERSON\n</b>                         So, he's playing hard ball. Well, \n                         two can play that game.\n                              (yelling)\n                         Go after him. Stop at nothing. You \n                         hear me?\n\n<b>                                     COLE\n</b>                         What? I'm sorry, sir, I can't hear \n                         you.\n\n               Looking over into the next booth, he sees Thomerson's back.\n\n<b>                                     COLE\n</b>                              (continuing)\n                         Some fat slob in the next booth is \n                         making a lot of noise.\n\n<b>                                     MR. THOMERSON\n</b>                         Well, tell the asshole to shut up.\n\n<b>                                     COLE\n</b>                         Right.\n                              (calling off)\n                         Hey, shut up. Okay, sir.\n\n<b>                                     MR. THOMERSON\n</b>                         Sorry, I can't hear you. Some pin \n                         head's yelling...\n                              (yelling O.S.)\n                         Shut up, I'm talking here.\n                              (into phone)\n                         Now look, I want you to go back and \n                         I don't care what you do. Stop that \n                         marriage.\n\n               He slams the phone down and EXITS SCREEN RIGHT. Cole starts \n               to exit left when he spots Chulo getting into the elevator.\n\n<b>                                     CHULO\n</b>                         Hey, man, your car's looking good.\n\n<b>                                     COLE\n</b>                              (crazed)\n                         Where is it?\n\n<b>                                     CHULO\n</b>                         Out front.\n\n               The elevator doors slam shut. Cole races out into the street.\n\n<b>               EXT. HOTEL\n</b>\n               Cole comes bursting out into the street. We can tell by his \n               shocked expression he doesn't like what he sees.\n\n<b>                                     COLE\n</b>                         Shit, shit, shit, shit, shit.\n\n               CAMERA PANS as he charges to his Porsche. His pride and joy \n               has now, thanks to Chulo, been customized into a Chicano \n               special. It's chopped and channeled; dingleberries rim the \n               back window, flames have been painted on the rear fender; a \n               chain steering wheel, fuzzy dashboard, dice hanging from the \n               mirror. A real East L.A. beauty.\n\n<b>               ANGLE - COLE\n</b>\n               He's snapped -- totally flipped. He turns and yells up to \n               the hotel:\n\n<b>                                     COLE\n</b>                              (screaming)\n                         Rick... Rick... Goddamn it.\n\n<b>               INT. HOTEL SUITE - ANGLE - RICK\n</b>\n               He's standing near the window.\n\n<b>                                     RICK\n</b>                         Gee. I think that's for me.\n\n               He looks out the window and sees Cole standing next to his \n               transformed Porsche.\n\n<b>                                     COLE\n</b>                         Rick... Debbie is mine. She'll always \n                         be.\n\n<b>                                     RICK\n</b>                              (yelling back)\n                         Cole, when was the last time you had \n                         a lobotomy?\n\n<b>                                     COLE\n</b>                              (furious)\n                         You've had it. I'm gonna get you.\n\n<b>               ANGLE - THE STREET\n</b>\n               Cole hops in his car and drives off, blowing his HORN at \n               oncoming traffic. The HORN PLAYS \"LA CUCURACHA.\" Cole slams \n               his fist on the steering wheel in disgust.\n\n<b>               INT. HOTEL SUITE\n</b>\n<b>                                     RICK\n</b>                              (to guys)\n                         Don't you love it when old friends \n                         stop by?\n\n<b>                                     O'NEILL\n</b>                              (to Rick)\n                         Hey, I'm starved... Let's go get \n                         something to eat. We'll bring back \n                         food for everybody.\n\n<b>                                     RICK\n</b>                         I'm not really hungry.\n\n<b>                                     O'NEILL\n</b>                         C'mon. I insist.\n\n               He grabs Rick by the arm and leads him out of the room.\n\n<b>               INT. HOTEL RESTAURANT\n</b>\n               Rick is finishing giving the food order to a WAITER. In the \n               b.g. we SEE O'Neill talking to a BELLHOP. The Bellhop is \n               pointing to a table. O'Neill thanks him and slips him some \n               money.\n\n<b>                                     RICK\n</b>                         ...couple more on rye. Lots of \n                         fries... and a burger and diet soda.\n\n               Waiter acknowledges he's got it and exits. O'Neill joins \n               Rick.\n\n<b>                                     O'NEILL\n</b>                         Let's sit down.\n\n               O'Neill leads Rick to the table the Bellhop pointed out. \n               They sit down. Immediately O'Neill takes some cash from his \n               pocket and holds it under the table.\n\n<b>               ANGLE UNDER THE TABLE\n</b>\n               Huddled underneath the table, hidden by the tablecloth, is a \n               HOOKER. Her specialty is coming right up. She grabs the bills \n               from O'Neill's hand. She tucks the money in her cleavage and \n               turns her talents to Rick. She unzips his fly.\n\n<b>               RICK\n</b>\n               He reacts to the ZIP SOUND.\n\n<b>                                     RICK\n</b>                         What the hell is that?\n\n<b>                                     O'NEILL\n</b>                         My gift to you.\n\n<b>                                     RICK\n</b>                         Under the table!\n\n<b>                                     O'NEILL\n</b>                         The best table in the house.\n\n               The Hooker has begun to do what she does best. And Rick loves \n               it.\n\n<b>                                     RICK\n</b>                         ...I think we can skip the wine list. \n                         Oh, gee...\n\n<b>               FATHER FALWELL\n</b>\n               enters the restaurant. He spots Rick and O'Neill and crosses \n               to them.\n\n<b>                                     FATHER FALWELL\n</b>                         Boys, good evening to you.\n\n               Rick tries to maintain his dignity. But from under the table \n               a blue ribbon job is being applied to his fun zone.\n\n<b>                                     O'NEILL\n</b>                         Father Falwell, good evening.\n\n               Falwell shakes Rick's hand. Rick hangs on for dear life. \n               Pumping the hand up and down at a faster and faster rate.\n\n<b>                                     RICK\n</b>                         Father... Oh, yes... yes... yesssss... \n                         Oh, yesssssss!\n\n               Falwell pries his hand loose.\n\n<b>                                     FATHER FALWELL\n</b>                         So, Rick, soon you will be a married \n                         man. How does it feel?\n\n<b>                                     RICK\n</b>                         Innnnnn-credible!\n\n<b>                                     FATHER FALWELL\n</b>                         Well, nice seeing you both.\n\n               Rick's excitement heightens as the Hooker pulls out all stops.\n\n<b>                                     RICK\n</b>                         Ooooooooh, Jesus, Oh God, God, God, \n                         God, Oh Jesus, Jeeeesussss...\n\n               Father Falwell looks on rather perplexed. Rick sees Falwell's \n               puzzled look.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         I was just saying grace.\n\n<b>                                     FATHER FALWELL\n</b>                         How nice.\n\n<b>                                     O'NEILL\n</b>                         You done?\n\n               Before Rick can speak we HEAR a VOICE from under the table.\n\n<b>                                     HOOKER (O.S.)\n</b>                         Not yet.\n\n               Rick's hand EXITS FRAME and zips up his pants. Then Rick and \n               O'Neill get up.\n\n<b>                                     RICK\n</b>                         Father, would you like to take our \n                         table?\n\n               O'Neill can't believe what Rick is about to do.\n\n<b>                                     FATHER FALWELL\n</b>                         Yes. Thank you.\n\n               He sits in Rick's spot. Rick leans on the table to say his \n               final farewell to the priest. He takes this moment to get \n               some money out of his pocket and hold it under the table.\n\n<b>               UNDER THE TABLE\n</b>\n               The Hooker grabs the money.\n\n<b>               BACK TO SCENE\n</b>\n<b>                                     RICK\n</b>                         I think you'll enjoy this table.\n\n<b>                                     O'NEILL\n</b>                         So long, Father.\n\n               He and Rick, suppressing a laugh, exit. Father Falwell picks \n               up the menu. We HEAR the ZIP SOUND. Father perks up. He \n               doesn't know what the hell is happening.\n\n               O'Neill turns to Rick as they're leaving the coffee shop.\n\n<b>                                     O'NEILL\n</b>                         I don't get it. Why didn't you go \n                         for it just now?\n\n<b>                                     RICK\n</b>                         I don't know. Maybe it's because I \n                         love Debbie or maybe it's hard for \n                         me to get off in a place that smells \n                         like egg salad. I'm not sure.\n\n<b>               INT. HOTEL SUITE\n</b>\n               Rick and O'Neill enter the suite. No one is there.\n\n<b>                                     RICK\n</b>                         Where the hell is everybody?\n\n               Everyone jumps out from their hiding places. With our guys \n               is Gary and his team of FIVE PROSTITUTES.\n\n<b>                                     GARY\n</b>                         Surprise!\n                              (gesturing to the \n                              girls)\n                         The team bus just pulled in.\n\n<b>                                     STAN\n</b>                         Hookers. It's a party!\n\n<b>                                     RICK\n</b>                         All right!\n\n               One of our hookers, KELLEY, gets everyone's attention.\n\n<b>                                     KELLEY\n</b>                         Who's first, guys?\n\n               Everyone acts as if they're in grade school. They raise their \n               hands; they come on like kids trying to get the teacher's \n               attention.\n\n<b>                                     GUYS\n</b>                         Oh, me... me... me!\n\n<b>                                     O'NEILL\n</b>                         Wait. The guest of honor should be \n                         first.\n\n<b>                                     RICK\n</b>                         Nah, that's okay. My brother has to \n                         look up old people's asses all day \n                         long. Let's give him a break.\n\n<b>                                     STAN\n</b>                         Right. Give me the will to live. Let \n                         me go first.\n\n<b>                                     O'NEILL\n</b>                         A moving plea. Okay, Doc, you lead \n                         off. I'll screw clean up.\n\n               Everyone cheers Stan's good fortune. Kelley takes Stan by \n               the hand and leads him into the bedroom. Gary turns on a \n               record and everyone starts dancing. Larry is laying out drugs \n               on a table. They consist of lines of coke and various happy \n               time pills of all colors and shapes. Rick takes a look at \n               the layout.\n\n<b>                                     RICK\n</b>                         How thoughtful. A drug smorgasbord.\n\n<b>               ANOTHER ANGLE\n</b>\n               Chulo enters. He sees the party has taken off.\n\n<b>                                     CHULO\n</b>                         I have returned!\n\n               He spots a sweet-faced young hooker, LAVERNE. She is prancing \n               around in her bra and underwear. Chulo wants her.\n\n<b>                                     CHULO\n</b>                              (continuing; points \n                              to her)\n                         You! Mine!\n\n               Laverne is frightened of Chulo. Mainly because he's coming \n               at her like a sex-starved buffalo. Chulo goes after her. \n               Scared, she runs around the room, then out the door. Chulo \n               gives chase.\n\n<b>                                     RICK\n</b>                              (to O'Neill)\n                         Chulo's got such a nice, light touch \n                         with women.\n\n<b>               INT. HOTEL CORRIDOR\n</b>\n               Laverne runs down the hall, closely pursued by Chulo. An all-\n               female NEW WAVE BAND comes to the door. O'Neill greets them.\n\n<b>                                     O'NEILL\n</b>                         Terrific. You made it... You can set \n                         up over there...\n\n               As they enter we go to --\n\n<b>               INT. CORRIDOR\n</b>\n               Chulo is on the heels of Laverne. She bursts through a door \n               to excape him.\n\n<b>               INT. STAGE\n</b>\n               Laverne finds herself on the stage of a beauty pageant, still \n               in her bra and panties. FIVE other LADIES are dressed in \n               their bathing suits. Chulo stops short of running on stage. \n               Laverne, seeking the safety of the moment, stands in line \n               with the contestants.\n\n<b>               ANGLE ON MR. THOMERSON AND OTHER JUDGES\n</b>\n               They like what they see.\n\n<b>                                     MR. THOMERSON\n</b>                              (to another)\n                         Great bathing suit.\n\n<b>                                     EXECUTIVE\n</b>                              (indicating Laverne)\n                         I think I screwed that one once.\n\n<b>               INT. THOMERSON'S BEDROOM - NIGHT\n</b>\n               Debbie and the shower guests are all in a state of undress. \n               We WATCH as they put on dresses and heavy makeup. Mrs. \n               Thomerson is still freaked out over her meeting with Nick \n               the Dick.\n\n<b>                                     MRS. THOMERSON\n</b>                         I had his weiner right in my hands.\n\n<b>                                     ILENE\n</b>                         I told you. Men are pigs... I saw \n                         them standing there.\n\n<b>                                     PHOEBE\n</b>                         What a gross thing to do... gawd!\n\n<b>                                     ILENE\n</b>                         I bet right now Rick and his pals...\n                              (she spits disdainfully)\n                         ...are knee deep in whores.\n\n<b>                                     MRS. THOMERSON\n</b>                         A strange wang right in my palm.\n\n<b>                                     DEBBIE\n</b>                         Ilene, we don't really know that.\n\n<b>                                     BOBBIE\n</b>                         That's what we're going to find out...\n\n<b>                                     DEBBIE\n</b>                         I feel like I'm spying on Rick.\n\n<b>                                     ILENE\n</b>                         Good. That's just what we're doing.\n\n<b>                                     TINA\n</b>                         I'll kill Stan if I find out he's \n                         been screwing around.\n\n               Ilene shoves socks in her bra to enhance her cleavage and \n               defiantly slaps on her new dress.\n\n<b>                                     ILENE\n</b>                         Brett, are you with us?\n\n<b>                                     MRS. THOMERSON\n</b>                              (coming out of her \n                              fog)\n                         Yeah, sure... I was eye to eye with \n                         an unfamiliar pud.\n\n<b>               INT. HOTEL SUITE\n</b>\n               The party is taking off. The all-girl band is going ape shit. \n               The guys are dancing with the hookers. They're all moving in \n               unison, to a gyrating New Wave dance step and singing along \n               with the MUSIC.\n\n<b>               ANGLE - RYKO\n</b>\n               He's wearing gravity boots, hanging upside down, entwined \n               around one of the hookers. They're hanging there, making out \n               like crazy. Gary passes by.\n\n<b>                                     RYKO\n</b>                         Hey, Gary, spot me.\n\n<b>               ANGLE - BEDROOM DOOR\n</b>\n               Stan comes out of the bedroom. He's disheveled, but looks \n               very happy. He crosses to Rick.\n\n<b>                                     STAN\n</b>                         Thanks a lot, that was the best. \n                         You're next.\n\n<b>                                     RICK\n</b>                         Nah, not yet. Look, you're my older \n                         brother. I need some advice here. \n                         What's the deal with marriage? What \n                         can I expect?\n\n<b>                                     STAN\n</b>                         Well, the first month it's great. \n                         The second month things calm down a \n                         little. By the third month you're \n                         looking through your old girlfriends' \n                         phone numbers; by the fourth month \n                         you're numb; by the fifth month, \n                         hopefully the football season starts.\n\n<b>                                     RICK\n</b>                         Thanks, Stan, you've been a lot of \n                         help.\n\n               Stan pats Rick on the back and dives into the festivities.\n\n<b>               ANGLE - GARY\n</b>\n               He spots someone across the room. It's like Tony spotting \n               Maria for the first time in \"West Side Story.\" As in a DREAM \n               SEQUENCE, ALL SOUNDS STOP. Two pinspots hit them. She turns \n               and sees him. She smiles. Both are madly in love. Like two \n               pieces of metal attracted to the same magnet, they walk toward \n               each other.\n\n<b>                                     GARY\n</b>                         Hi.\n\n<b>                                     SHE\n</b>                         Hello.\n\n               They take each other by the hand. They walk into the bedroom \n               and close the door behind them.\n\n               The New Wave dance briefly continues, then comes to an end.\n\n<b>               ANOTHER ANGLE - THE HOTEL ROOM\n</b>\n               O'Neill grabs Ryko (who is just coming down from his gravity \n               bar) and Stan, who is wearing a pair of women's underwear on \n               his head.\n\n<b>                                     O'NEILL\n</b>                         You guys better get going. It's \n                         getting late.\n\n<b>                                     STAN\n</b>                         Oh, right.\n\n               Ryko and Stan cross to the door and exit. As they do, four \n               or five pretty GIRLS are passing by in the hallway.\n\n<b>                                     GIRL\n</b>                         Is there a party going on in there \n                         or something?\n\n<b>                                     RYKO\n</b>                         Yeah. It's great. Go on in.\n\n               The girls cross inside.\n\n<b>                                     STAN\n</b>                         My God. Fresh meat. Let's hurry back.\n\n<b>               INT. BATHROOM - TIGHT ON LARRY\n</b>\n               There is a pained, tragic and extremely stoned out look on \n               his face as he sighs deeply and then summons up his courage. \n               WIDEN as he looks down at his right wrist.\n\n               He heaves another deep sigh and brings an electric razor \n               INTO FRAME. He turns it on and runs it over his wrist. Of \n               course, nothing happens. Just then Rick enters.\n\n<b>                                     RICK\n</b>                         What the hell are you doing?\n\n<b>                                     LARRY\n</b>                         I'm trying to slash my wrists.\n\n<b>                                     RICK\n</b>                         You're trying to kill yourself with \n                         an electric razor?\n\n<b>                                     LARRY\n</b>                         I couldn't find any razor blades.\n\n<b>                                     RICK\n</b>                         Well, this is terrific. Now you're \n                         gonna have wrists that are smooth \n                         and kissable. Just go out there. \n                         Forget about everything and laugh it \n                         up.\n\n<b>                                     LARRY\n</b>                              (suddenly laughs like \n                              a crazy man)\n                         Ha, ha, ha.\n\n<b>                                     RICK\n</b>                         No, have fun first. Then laugh. Now, \n                         forget about marriage for a while. \n                         Go party.\n\n               As he shoves Larry out, Gary enters the bathroom. His \n               expression tells us he's had the best sex of his life.\n\n<b>                                     RICK\n</b>                         Gary, how we doing, big stallion?\n\n<b>                                     GARY\n</b>                         Rick, I really think I'm in love.\n\n<b>                                     RICK\n</b>                         This is cause for celebration. She'll \n                         probably charge half price for sex \n                         from now on.\n\n               Rick exits as Gary dreamily crosses to the mirror.\n\n<b>                                     GARY\n</b>                              (into mirror)\n                         This time it's real. She's wonderful.\n\n               Gary's \"woman\" enters and closes the door. Their eyes meet. \n               Gary takes her hand and kisses it gently. She turns away, \n               then lifts up the toilet seat, lifts up her dress and proceeds \n               to pee. She is a man. Gary is stunned. His jaw drops open. \n               Gary's dream girl/guy finishes his business. He drops his \n               dress and turns to Gary.\n\n<b>                                     SHE\n</b>                         The name's Tim. I'm always available.\n\n               He blows a kiss and starts to leave, but turns back.\n\n<b>                                     SHE/TIM\n</b>                         By the way... I also do engine work \n                         on BMW's. 'Bye.\n\n               Tim exits. Gary feels filthy. He rips open the cabinet, takes \n               out tooth paste and toothbrush and vigorously brushes his \n               teeth. He rips off his clothes and jumps in the shower and \n               scrubs as if he's scraping barnacles off a hull of a tugboat.\n\n<b>               EXT. STABLES - NIGHT\n</b>\n               Ryko and Stan drive up to a country stable. They get out of \n               the car and open a barn door. Both are pleased at what they \n               see.\n\n<b>                                     RYKO\n</b>                         All right.\n\n<b>               ANOTHER ANGLE\n</b>\n               Standing there is a donkey, eating straw.\n\n<b>               EXT. HOTEL - NIGHT\n</b>\n               Cole drives up in his Chulo-customized Porsche. He gets out, \n               then reaches back into the car and takes out a crossbow (the \n               heavy duty metal kind hunters use). He looks up menacingly \n               at the hotel and spots the room where the party is going on. \n               He sees another hotel across the way. He gets an idea and \n               enters the other hotel.\n\n<b>               INT. HOTEL SUITE\n</b>\n               The party is going full blast. Some other girls and a couple \n               of guys (hotel guests) enter the room and are quickly swept \n               up in the spirit of the party. O'Neill approaches Rick.\n\n<b>                                     O'NEILL\n</b>                         Rick, I'm concerned.\n\n<b>                                     RICK\n</b>                         About what?\n\n<b>                                     O'NEILL\n</b>                         This is your bachelor party. You \n                         haven't had sex with anyone yet.\n\n<b>                                     RICK\n</b>                              (trying to joke his \n                              way out of it)\n                         Get a few drinks into me, we'll dance \n                         and see what happens.\n\n<b>                                     O'NEILL\n</b>                         I got something you can't resist. I \n                         have a friend, Tracey. She wants to \n                         meet you. She loves to please.\n\n<b>                                     RICK\n</b>                         Oooooo.\n\n<b>                                     O'NEILL\n</b>                              (indicating the bedroom)\n                         Right in there, pal.\n\n<b>                                     RICK\n</b>                         If I'm not out in a half hour, send \n                         for the paramedics.\n\n<b>                                     O'NEILL\n</b>                         That's the old Rick!\n\n               Rick enters the bedroom.\n\n<b>               INT. BEDROOM\n</b>\n               It's dark, but for a lamp on the nightstand which is on. In \n               one corner of the room we SEE the figure of a woman.\n\n<b>                                     RICK\n</b>                         Hellooo!\n\n               Tracey walks toward Rick. The light illuminates her. What we \n               see is truly the most beautiful woman on earth. She is totally \n               nude. A vision that would make any man screw and ask questions \n               later.\n\n<b>                                     RICK\n</b>                              (to himself; \n                              overwhelmed by her)\n                         Eat my chair!\n\n<b>                                     TRACEY\n</b>                         Take me... please.\n\n               Rick instinctively makes a move toward her. He decides to go \n               for it.\n\n<b>               RICK'S POV - TRACEY\n</b>\n               Just then a strange thing happens to Tracey's face. It \n               transforms into Debbies.\n\n<b>               ANOTHER ANGLE\n</b>\n               Rick stops dead in his tracks. He can't believe it. Debbie's \n               face is now on Tracey's body.\n\n<b>                                     TRACEY/DEBBIE\n</b>                         You promised me, Rick. You promised \n                         you wouldn't make love to anyone \n                         else.\n\n               Rick is shaken by this. He shakes his head and wipes at his \n               eyes. Debbie's face is gone. He moves toward Tracey again.\n\n<b>               TRACEY\n</b>\n               Her face transforms into Sister Mary Francis.\n\n<b>                                     TRACEY/SISTER MARY FRANCIS\n</b>                         Don't go back on your word, Rick. Be \n                         true; be strong.\n\n               Sister Mary Francis's face disappears.\n\n<b>               ANOTHER ANGLE\n</b>\n<b>                                     RICK\n</b>                         I can't do it.\n\n<b>               TRACEY\n</b>\n               Her face becomes Stan's.\n\n<b>                                     TRACEY/STAN\n</b>                         You nuts? Look at me, I'm beautiful!\n\n               Stan's face turns back to Tracey's.\n\n<b>               ANOTHER ANGLE\n</b>\n               All the kids from his bus are gathered around Tracey. They're \n               egging him on.\n\n<b>                                     KIDS\n</b>                         Do it! Come on! Put her away! Go for \n                         it!\n\n               Debbie's face appears on Tracey's.\n\n<b>                                     TRACEY/DEBBIE\n</b>                              (pleading)\n                         Don't Rick.\n\n               Debbie's face disappears. Rick can't take it anymore.\n\n<b>                                     RICK\n</b>                         I can't do it. I love Debbie.\n\n               He runs out of the room, leaving a very confused Tracey in \n               his wake.\n\n<b>               INT. HOTEL ROOM\n</b>\n               O'Neill is waiting outside the bedroom door as Rick comes \n               out.\n\n<b>                                     O'NEILL\n</b>                         How'd it go?\n\n<b>                                     RICK\n</b>                         Put it to you this way -- you're \n                         gonna have to pry her out of the bed \n                         with a spatula, mister.\n\n<b>                                     O'NEILL\n</b>                         I'm proud of you, lad.\n\n               Rick crosses to the bar area as O'Neill watches him go, \n               beaming.\n\n<b>               INT. HOTEL ROOM ACROSS THE STREET - NIGHT\n</b>\n               Cole enters the room. He runs to the window.\n\n<b>               COLE'S POV\n</b>\n               His window is right opposite the window in the hotel of Rick's \n               party.\n\n<b>               COLE\n</b>\n               He's pleased. Very pleased. He places an arrow into his \n               crossbow.\n\n<b>               COLE'S POV\n</b>\n               He's looking down his sights. Rick is the target... and an \n               easy one at that, for at this very moment Rick is crossing \n               past the window.\n\n<b>               INT. HOTEL SUITE\n</b>\n               The door opens and in walks Rajah, the Indian pimp. He looks \n               pissed. He's looking for Gary.\n\n<b>                                     RAJAH\n</b>                              (angry)\n                         Am looking for this dunghead who \n                         took my women... He is being liar to \n                         me. 45 minutes way over.\n\n<b>               COLE'S POV\n</b>\n               He has Rick right where he wants him.\n\n<b>               CROSSBOW TRIGGER\n</b>\n               Cole's finger squeezes off a shot.\n\n<b>               RICK\n</b>\n               Luckily he starts to dance with a female guest. This takes \n               him out of line of the arrow.\n\n<b>               HOTEL SUITE WINDOW\n</b>\n               The arrow zooms through the open window.\n\n<b>               INT. HOTEL SUITE\n</b>\n               Rajah is standing by the door. The arrow zips through the \n               room, misses everyone and lodges in the wall inches from \n               Rajah's head. He looks at the arrow and realizes he almost \n               was killed.\n\n<b>                                     RAJAH\n</b>                              (frightened)\n                         Holy Dung is this thing! I sic Milt \n                         on you. He get back bitches. Me? I \n                         haul ass.\n\n               He runs out of the room. Rick and O'Neill watch Rajah exit, \n               confused.\n\n<b>                                     RICK\n</b>                         Who was that?\n\n<b>                                     O'NEILL\n</b>                         I don't know.\n\n<b>                                     RICK\n</b>                              (looking at arrow)\n                         What's this?\n\n<b>                                     O'NEILL\n</b>                         Got me.\n\n               Just then another arrow comes zipping through the room, \n               lodging in a chair inches from Rick.\n\n<b>                                     RICK\n</b>                              (to new arrow)\n                         How 'bout this?\n\n<b>                                     O'NEILL\n</b>                         Still drawing a blank.\n\n               They turn in the direction the arrow came from and look out \n               the window. They spot Cole loading his bow in the room across \n               the way.\n\n<b>                                     RICK\n</b>                         He look familiar?\n\n<b>                                     O'NEILL\n</b>                         Very.\n\n<b>                                     RICK\n</b>                         C'mon. Get the hookers in a circle. \n                         We better put Cochise out of business.\n\n               They start for the door as we go to --\n\n<b>               INT. BACKSTAGE OF BEAUTY PAGEANT\n</b>\n               Chulo is waiting outside a door that says \"Dressing Room.\" \n               Several of the beauty contestants race out wearing formal \n               gowns. Laverne follows them, wearing a very tight black dress. \n               Chulo approaches her.\n\n<b>                                     LAVERNE\n</b>                         Stay away from me.\n\n<b>                                     CHULO\n</b>                         I'm not gonna hassle you... Don't \n                         worry. You look beautiful.\n\n<b>                                     LAVERNE\n</b>                              (nervous)\n                         Think so? I borrowed it from one of \n                         the girls. I don't look too fat?\n\n<b>                                     CHULO\n</b>                         You're an angel... A madonna.\n\n               Laverne is moved by this. Before she can respond a Stage \n               Manager takes her by the arm and pushes her on stage.\n\n<b>                                     STAGE MANAGER\n</b>                         You're on.\n\n               Chulo watches Laverne enter the stage to hearty applause.\n\n<b>               ANGLE - THE AUDIENCE\n</b>\n               Mr. Thomerson and the other Judges sit in the front row making \n               notes.\n\n<b>               MEDIUM SHOT - THE STAGE\n</b>\n               The girls are lined up on pedestals as the MC approaches \n               Laverne\n\n<b>                                     MC\n</b>                         All right, here is your question, \n                         Miss... Er...\n\n               He looks through his cards hurriedly and is unable to find \n               Laverne's.\n\n<b>                                     LAVERNE\n</b>                         Rivas.\n\n<b>                                     MC\n</b>                         Miss Rivas... Yes... How would you \n                         solve our country's present economic \n                         problems?\n\n<b>                                     LAVERNE\n</b>                         Who, me?\n\n<b>                                     MC\n</b>                         Yes.\n\n<b>                                     LAVERNE\n</b>                         That's a good question. From the way \n                         I understand it, according to supply \n                         side economics, when supply exceeds \n                         demand, recession is the result. \n                         That's why I think we should control \n                         the credit markets and increase the \n                         prime rate. That way, the consumer \n                         price index will stabilize and we \n                         will have economic recovery.\n\n<b>               ANGLE - THE CROWD\n</b>\n               They break into spontaneous applause.\n\n<b>               ANGLE - CHULO\n</b>\n               He is totally blown away.\n\n<b>               ANGLE - LAVERNE\n</b>\n               She smiles broadly at the applause and walks off stage. Chulo \n               moves alongside her.\n\n<b>                                     CHULO\n</b>                         How'd you know all that stuff? You're \n                         a real brain.\n\n<b>                                     LAVERNE\n</b>                         Nah, I used to fuck a librarian.\n\n               Chulo looks at her with awe and respect as she exits into \n               the dressing room.\n\n<b>                                     CHULO\n</b>                         Wow!\n\n<b>               INT. HOTEL LOBBY - NIGHT\n</b>\n               Debbie, her mother and the girls enter the lobby. They \n               approach the Hotel Manager, who is standing behind the front \n               desk. They are dressed garishly, like hookers. Debbie has on \n               a cheap blonde wig and mini skirt. The Manager looks at them \n               the way one would look at an approaching plague.\n\n<b>                                     DEBBIE\n</b>                         I don't believe we're doing this.\n\n               The Manager crosses to them.\n\n<b>                                     MANAGER\n</b>                         Can I help you, ladies?\n\n<b>                                     DEBBIE\n</b>                         Yes, we're looking for the Stahl \n                         party.\n\n<b>                                     MANAGER\n</b>                         Room 1002.\n\n               The girls turn and start toward the elevator. Mrs. Thomerson, \n               who is wearing the kind of push-up bra that makes her tits \n               look like the Black Hills, smiles at the Manager seductively. \n               He smiles back, then catches himself.\n\n<b>                                     MANAGER\n</b>                              (to Bellboy)\n                         Those guys are asking for it.\n\n               The girls cross to the elevator. Ilene pushes the button and \n               the doors swing open. They get inside and just before the \n               doors close, a huge behemoth of a man joins them inside. He \n               turns and faces CAMERA. It's Milt, Rajah's beefy helper. He \n               doesn't look happy as he eyes the girls. They look back at \n               him uncomfortably as the doors slam shut.\n\n<b>               INT. HOTEL CORRIDOR\n</b>\n               The elevator door opens. Milt has all the girls by the collar \n               and hustles them down the hall.\n\n<b>                                     ILENE\n</b>                         You're making a big mistake.\n\n<b>                                     MILT\n</b>                         Shut up. You still got another job \n                         to do here.\n\n<b>                                     MRS. THOMERSON\n</b>                         What kind of job? I'm a housewife.\n\n<b>                                     DEBBIE\n</b>                         Quiet, Mother.\n\n               Milt stops at a door and kicks it with his foot. The door \n               opens a crack at first, then swings open wide, revealing six \n               middle-aged Japanese business MEN in their underwear. They \n               smile wide at the girls, obviously thrilled with the quality \n               of the merchandise delivered to them. Milt shoves them into \n               the room.\n\n<b>                                     MILT\n</b>                         Get in there.\n\n               He slams the door shut and exits.\n\n<b>               INT. JAPANESE GUYS' ROOM\n</b>\n               The guys start to move toward our panicked girls. They speak \n               to each other in Japanese (with English subtitles)\n\n<b>                                     JAPANESE ONE\n</b>                         Nice looking quim, huh, Bob?\n\n<b>                                     JAPANESE TWO\n</b>                         Yeah, you know me, Ray, I've always \n                         been a sucker for redheads.\n\n<b>                                     JAPANESE FOUR\n</b>                         Hubba-hubba.\n\n<b>                                     BOBBIE\n</b>                         Let's get out of here, girls.\n\n               They turn toward the door. One of the Japanese races over \n               and gets there first, slamming and bolting the door shut.\n\n<b>                                     DEBBIE\n</b>                         Guys, take it easy. Guys.\n\n               The girls run around the room in a panic with the Japanese \n               chasing them in very hot pursuit.\n\n<b>               EXT. COLE'S ROOM\n</b>\n               Rick, O'Neill and Tracey quietly approach Cole's door. Tracey \n               is dressed in a see-through negligee.\n\n<b>                                     RICK\n</b>                         This is it.\n                              (he positions Tracey \n                              outside the door)\n                         Go get 'im.\n\n               He and O'Neill duck around the hallway corner, out of sight.\n\n<b>               INT. COLE'S ROOM\n</b>\n               He is at the window, holding his crossbow. He is frantically \n               searching the bachelor party across the way for any sign of \n               Rick.\n\n<b>                                     COLE\n</b>                         Where the hell is he?\n\n               He hears a KNOCK on the DOOR. Cole quickly hides his crossbow \n               under the bed and answers the door.\n\n<b>               ANOTHER ANGLE\n</b>\n               Tracey stands in the open door. Cole's jaw drops open. He \n               has never seen anything as lovely.\n\n<b>                                     COLE\n</b>                         Yeah?\n\n<b>                                     TRACEY\n</b>                         Make love to me... please.\n\n               She walks into the room. Cole closes the door.\n\n<b>               INT. CORRIDOR OUTSIDE COLE'S DOOR\n</b>\n               Rick and O'Neill run up to the door. They listen closely. We \n               HEAR the SOUND of Cole's SHIRT being RIPPED off, the buttons \n               flying around the room, then the SOUND of his pant ZIPPER \n               being undone.\n\n<b>                                     RICK\n</b>                         T minus... 3... 2... 1. We have \n                         ignition.\n\n               e and O'Neill burst into the room and close the door.\n\n<b>                                     COLE (O.S.)\n</b>                         Hey!\n\n<b>               INT. COLE'S ROOM\n</b>\n               O'Neill is tying the end of a sheet around the bed post. We \n               SEE the bed is minus its sheets and blankets.\n\n<b>                                     O'NEILL\n</b>                         All set here.\n\n<b>               ANOTHER ANGLE\n</b>\n               The guys have tied the sheets and blankets together and made \n               a rope. The other end is tied around Cole's chest. And that's \n               all Cole is wearing; he's nude.\n\n<b>                                     COLE\n</b>                         You guys are never going to get away \n                         with this.\n\n               Rick stuffs Cole's underwear in his mouth to gag him.\n\n<b>                                     RICK\n</b>                         We're just going to keep you in a \n                         safe place until after the party.\n\n               He and O'Neill lift Cole up and put him out the window. They \n               hang onto the sheet/blanket rope and lower him slowly outside.\n\n<b>               EXT. HOTEL\n</b>\n               We SEE Cole being lowered from the window.\n\n<b>               CLOSER ON COLE\n</b>\n               He's struggling, but can do nothing about his predicament. \n               He looks down.\n\n<b>               COLE'S POV\n</b>\n               The hotel parking lot is ten stories below.\n\n<b>               COLE\n</b>\n               He looks up to the guys.\n\n<b>               RICK AND O'NEILL\n</b>\n               They look down at him from the window above.\n\n<b>                                     RICK\n</b>                         Now, don't get into any trouble.\n\n<b>                                     O'NEILL\n</b>                         Take care.\n\n<b>                                     RICK &amp; O'NEILL\n</b>                         Byeeeee!\n\n               They duck inside the window.\n\n<b>               INT. COLE'S ROOM\n</b>\n               Rick, O'Neill and Tracey exit the room.\n\n<b>                                     RICK\n</b>                              (to Tracey)\n                         Don't you wish you were a guy so you \n                         could have fun like this?\n\n<b>               COLE\n</b>\n               He's scared to death.\n\n<b>               INT. COLE'S ROOM\n</b>\n               We SEE that Cole's weight is pulling the bed to the window.\n\n<b>               COLE\n</b>\n               He's slowly lowering down the side of the building.\n\n<b>               INT. ANOTHER HOTEL ROOM\n</b>\n               A YOUNG COUPLE enters the room. They are very much in love. \n               He gives her a kiss and closes the door.\n\n<b>                                     MAN\n</b>                         Why don't you get comfortable?\n\n               She smiles coyly and starts to undress. He crosses to the \n               closed blinds.\n\n<b>                                     MAN\n</b>                              (continuing)\n                         There's a wonderful moon out tonight.\n\n               He opens the blinds, revealing Cole's ass pressed up against \n               the window.\n\n<b>               WOMAN\n</b>\n               She screams, horrified.\n\n<b>               INT. JAPANESE BUSINESSMEN'S ROOM\n</b>\n               The girls are being hotly pursued by the Japanese men.\n\n<b>                                     JAPANESE/RAY\n</b>                              (subtitled)\n                         Hey, Bob, this beats the shit out of \n                         sushi, doesn't it?\n\n<b>               INT. COLE'S ROOM\n</b>\n               The bed moves right up against the wall under the window. We \n               SEE the end tied to the bed post is beginning to untie.\n\n<b>               COLE\n</b>\n               He's panicked.\n\n<b>               INT. COLE'S ROOM\n</b>\n               The knot unties.\n\n<b>               COLE\n</b>\n               He falls OUT OF FRAME. The \"rope\" trailing behind.\n\n<b>               INT. CAR\n</b>\n               The young couple from the room are seated in his sportscar. \n               He's cranking open the sun roof.\n\n<b>                                     MAN\n</b>                         Babe, I didn't know anything about \n                         that.\n\n               The sun roof opens. Suddenly Cole's ass sticks through it. \n               The Woman freaks out again.\n\n<b>               EXT. SPORTSCAR\n</b>\n               We SEE a groggy Cole sitting in the sun roof. The Man in the \n               car is trying to calm down his lady.\n\n<b>               INT. BANQUET ROOM - BACKSTAGE\n</b>\n               Chulo and Laverne are standing in the wings while in the \n               b.g. we can SEE the MC singing the Moosehead Beer jingle. \n               Then:\n\n<b>                                     MC\n</b>                         All right, can we have our five \n                         finalists, please.\n\n<b>                                     CHULO\n</b>                         Good luck, Laverne.\n\n               Laverne and the five finalists go out on stage.\n\n<b>               ANGLE - MR. THOMERSON\n</b>\n               He gives an envelope to the MC.\n\n<b>                                     MC\n</b>                         Thank you, Mr. Thomerson. Well, the \n                         judges have made their decision, and \n                         this year's Miss Moosehead Beer is...\n\n<b>               ANGLE - THE GIRLS\n</b>\n               They are all nervous, especially Laverne.\n\n<b>                                     MC\n</b>                         Laverne Rivas.\n\n               Laverne squeals with delight and hugs the MC as he puts the \n               bejeweled crown on her head. Then the MC leads her to the \n               microphone.\n\n<b>                                     LAVERNE\n</b>                              (teary-eyed)\n                         I can't believe it. This is the \n                         happiest day of my life, and I owe \n                         it all to him.\n\n               She points O.S. to Chulo, Chulo, with tears in his eyes, \n               comes out on stage and, in a surge of emotion, picks Laverne \n               up off her feet and hugs her passionately.\n\n<b>               ANGLE - THE JUDGES\n</b>\n<b>                                     JUDGE\n</b>                         I know I've had that girl.\n\n<b>                                     MR. THOMERSON\n</b>                              (looking at Chulo)\n                         And I know that guy from somewhere, \n                         too.\n\n               The other judge looks at Mr. Thomerson suspiciously.\n\n<b>               EXT. HOTEL - NIGHT\n</b>\n               CAMERA PUSHES IN TO a car in the parking lot which is towing \n               a U-Haul trailer behind it. The car stops and turns off its \n               lights.\n\n<b>               INT. CAR\n</b>\n               Stan and O'Neill sit in the car looking at the hotel.\n\n<b>                                     STAN\n</b>                         How the hell are we supposed to get \n                         this donkey inside?\n\n<b>                                     RYKO\n</b>                         I don't know.\n\n<b>                                     STAN\n</b>                         What? I thought you told me you had \n                         it all figured out.\n\n<b>                                     RYKO\n</b>                         Maybe I did... I don't remember.\n\n<b>                                     STAN\n</b>                              (through clenched \n                              teeth)\n                         I'd love to get you in an operating \n                         room. Just once.\n\n<b>               ANGLE - HOTEL ENTRANCE\n</b>\n               Just then the \"Moose\" from the beauty pageant steps outside \n               the hotel for a smoke.\n\n               The guy in front removes the head, takes a drag of his \n               cigarette and passes it to the guy bringing up the rear. \n               After a beat, smoke steams out the rear end of the costume.\n\n<b>               ANGLE - THE GUYS IN THE CAR\n</b>\n               They both have the same idea. They stroll out of the car and \n               approach the two men in the moose suit. We can't hear what \n               they're saying, but we can SEE the bills Stan is taking out \n               of his pocket. Ryko grabs the moosehead and runs over to the \n               trailer with it.\n\n<b>               INT. HOTEL LOBBY - A FEW MINUTES LATER\n</b>\n               The door opens and Stan and Ryko enter pulling the \"Moose\" \n               by a rope.\n\n<b>                                     RYKO\n</b>                         Can you believe how perfect it fits?\n\n<b>                                     STAN\n</b>                         Yeah. Who'd have thought they'd both \n                         be a size 138 regular.\n\n               Just then Rick and O'Neill saunter into the lobby.\n\n<b>                                     O'NEILL\n</b>                         Hey, you guys...\n\n<b>                                     RICK\n</b>                         Who's your friend?\n\n<b>                                     STAN\n</b>                              (keeping it a surprise)\n                         Oh... it's... er... the guys from \n                         the beer convention. We're bringing \n                         them to the party.\n\n<b>                                     RICK\n</b>                         Great.\n                              (to moose)\n                         I was wondering, how do you guys go \n                         to the bathroom in that thing?\n\n               At that moment he HEARS a SPLAT hit the ground. The guys \n               look down and see a large, shiny clump of shiny brown \n               excrement nestled in the shag carpet.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Say no more.\n\n               The Manager crosses to them.\n\n<b>                                     MANAGER\n</b>                         I don't know which one of you did \n                         this, but you're not going anywhere \n                         till you clean up this disgusting \n                         mess.\n\n<b>                                     O'NEILL\n</b>                              (resigned)\n                         Anybody got a paper towel or a shovel \n                         or something?\n\n               All the guests turn away in disgust. Stan takes out a \n               handkerchief and hands it to Rick, who closes his eyes and \n               picks up the warm little bundle. The Manager turns and walks \n               off in a huff. On the way back to the elevator, Rick checks \n               to see no one is watching and places the handkerchief's \n               contents on the front desk, just OUT OF FRAME. Smiling \n               contentedly, the guys lead the reluctant \"moose\" into the \n               elevator. The doors slam shut.\n\n<b>               ANGLE AT THE DESK\n</b>\n               The Manager is just finishing checking in a couple from out \n               of town.\n\n<b>                                     MANAGER\n</b>                         I'll have the boy take your bags up.\n\n               He goes to hit the bell and to his surprise, his hand comes \n               down on something soft and mushy. The look on his face tells \n               us what it is. It's the \"gift\" Rick left behind.\n\n<b>                                     MANAGER\n</b>                              (to couple)\n                         Excuse me. I seem to have a hand \n                         full of potty.\n\n               Revolted, he races into a room marked \"MEN.\"\n\n<b>               ANGLE - BALLROOM DOORS\n</b>\n               The doors open and several people from the Moosehead beauty \n               pageant come out. Mr. Thomerson is one of them.\n\n<b>                                     EXECUTIVE\n</b>                         Thanks for helping us out, Ed. We \n                         appreciate it.\n\n<b>                                     MR. THOMERSON\n</b>                         Any time, Al.\n\n               Mr. T. crosses to the door just as Cole comes running in, \n               slightly dazed, wrapped in the tattered remnants of the sheet \n               that held him suspended out the window. They both are shocked \n               to see one another.\n\n<b>                                     MR. THOMERSON\n</b>                         Cole, my God, boy, what are you doing \n                         here? What happened?\n\n<b>                                     COLE\n</b>                              (nearly hysterical)\n                         The bachelor party's upstairs. They \n                         made me get naked. They hung me from \n                         the window so high up it was so scary \n                         I fell down...\n\n<b>                                     MR. THOMERSON\n</b>                         Take hold of yourself. What room are \n                         they in?\n\n<b>                                     COLE\n</b><b>                         1002. \n</b>\n<b>                                     MR. THOMERSON\n</b>                         All right, I'll go up there and take \n                         care of this myself.\n                              (disgusted)\n                         You look awful, son. Go find yourself \n                         some clothes.\n\n<b>                                     COLE\n</b>                         Yes, sir.\n\n               With a determined look, Thomerson crosses to the elevator, \n               as Cole runs into the hotel gift shop.\n\n<b>               INT. HOTEL SUITE - NIGHT\n</b>\n               Rick, Ryko, Stan, O'Neill enter with the \"moose.\"\n\n<b>                                     RICK\n</b>                         Hi, guys. We brought back a friend.\n\n<b>                                     LARRY\n</b>                         It's Bullwinkle.\n\n<b>                                     O'NEILL\n</b>                         Gentlemen... Ladies... For your \n                         viewing pleasure, meet Mike the \n                         Magical Sexual Mule.\n\n               O'Neill lifts the head off the moose costume, revealing a \n               real burro. The burro shows all his teeth as burros are apt \n               to do when excited. O'Neill and Stan zip off the rest of his \n               costume, revealing a well-endowed beast.\n\n<b>                                     RICK\n</b>                              (surprised)\n                         How about this, a Trojan donkey.\n\n<b>                                     O'NEILL\n</b>                         And here's Mike's partner, in more \n                         ways than one. A gal who doesn't \n                         think happiness ends with primates. \n                         The very lovely, Miss Desiree...\n\n               DESIREE, an erotic, tall woman wearing a leather face mask, \n               comes out of the bedroom carrying a long whip. Desiree puts \n               Ravel's \"Bolero\" on the PHONOGRAPH; then she starts to sway \n               her hips sensuously in front of the animal.\n\n<b>               ANGLE - THE PARTY GUESTS\n</b>\n               They all scream and holler approval.\n\n<b>               ANGLE - DESIREE\n</b>\n               She rubs up against the donkey, shaking her backside against \n               the animal's.\n\n<b>                                     RICK\n</b>                         Swell. She's gonna pin her tail on \n                         the donkey.\n\n               Now all eyes are on Desiree as she does an erotic striptease.\n\n<b>               ANGLE - THE DONKEY\n</b>\n               It is getting bored and a little hungry. It bends its head \n               to the left and spots the table with food on it. It bends \n               over and starts munching on some cole slaw.\n\n<b>               ANGLE - DESIREE\n</b>\n               To the catcalls of the partygoers, Desiree is getting all \n               worked up, stripping down to a G-string.\n\n<b>               THE DONKEY\n</b>\n               It's had enough cole slaw. Now it sniffs at Larry's drug \n               smorgasbord and then starts to chomp on a few pills. Next it \n               sticks its head into the lines of coke and snorts them up in \n               one gigantic sniff.\n\n<b>               ANGLE - DESIREE\n</b>\n               She lets her long, flowing hair hang down over her breasts. \n               Then she takes a mattress and sets it on the floor. She rolls \n               on it and sways her hips sensuously on her knees.\n\n<b>               ANGLE - HER AUDIENCE\n</b>\n               Rick can't believe he's seeing this. The other guys are \n               screaming at the top of their lungs. Even Larry seems spell-\n               bound.\n\n<b>               ANGLE - THE DONKEY\n</b>\n               It doesn't look so hot as it finishes off every drug on the \n               table.\n\n<b>               ANGLE - DESIREE\n</b>\n               She moves over to the donkey, hits him on the side gently \n               with her whip, then pulls him over to her mattress. The \n               donkey's blood-shot eyes are the size of saucers. Once again \n               he shows his teeth in a kind of shit-eating grin. Desiree \n               drops to the mattress and beckons the animal to her. Mike \n               the Donkey obediently does as he's told, moving to her in a \n               trance-like, very turned-on state.\n\n<b>                                     DESIREE\n</b>                         C'mon, Mike... Come to Mama.\n\n               The Donkey takes another step forward, and then suddenly \n               rears up on his hind legs, snorting. He starts bucking wildly. \n               The crowd moves out of his way as the animal goes berserk \n               for a few seconds, then without warning collapses in a heap \n               on the floor.\n\n               Everyone goes rushing up to it.\n\n               Chulo and Laverne enter the room, followed by several of the \n               other contestants and others from the beauty pageant.\n\n<b>                                     CHULO\n</b>                              (excited)\n                         Hey, you guys, I'm getting married.\n                              (to Laverne)\n                         We're gonna make lots of kids.\n\n               He looks over and sees everyone gathered around Mike.\n\n<b>                                     CHULO\n</b>                         What the hell happened?\n\n               Gary shushes him. We PUSH IN ON Dr. Stan, who is listening \n               for signs of life in the animal's chest. Finally Stan stands \n               up somberly.\n\n<b>                                     STAN\n</b>                         Drug overdose.\n\n<b>                                     DESIREE\n</b>                         You mean it's...\n\n<b>                                     STAN\n</b>                         Afraid so. I did everything I could.\n\n<b>                                     LARRY\n</b>                         It's my fault. He's dead because... \n                         I left those drugs...\n\n<b>                                     RICK\n</b>                         It's really not all your fault. I \n                         was talking to Mike earlier and he \n                         had a lot of problems. Personal \n                         things, you know. Made some bad \n                         investments. At least now he's \n                         peaceful...\n\n<b>                                     O'NEILL\n</b>                         C'mon, we gotta get this thing out \n                         of here.\n\n               O'Neil places the moosehead on the donkey as Rick, Gary, \n               Chulo and Stan pull the donkey out into the hall like \n               pallbearers at a funeral.\n\n<b>               INT. HALLWAY\n</b>\n               Mr. Thomerson, who's been standing at the door, takes this \n               time to sneak into the suite right behind them.\n\n<b>               INT. RICK'S SUITE\n</b>\n               Mr. Thomerson can't believe the goings-on. People are making \n               out, drinking and dancing. He hides in a corner to watch \n               undercover.\n\n<b>               ANGLE IN CORRIDOR\n</b>\n               The guys shove the donkey onto the elevator and the doors \n               snap shut.\n\n<b>               INT. HOTEL LOBBY\n</b>\n<b>                                     MANAGER\n</b>                              (on phone)\n                         Yes... I see... Of course we don't \n                         allow that sort of thing here, ma'am. \n                         No... Well, I'm sorry the noise woke \n                         you. I'll take care of it right away.\n\n               He hangs up and crosses to the elevator.\n\n<b>                                     MANAGER\n</b>                         I've had enough of this.\n\n               Just then the elevator door swings open. The donkey falls \n               out into the lobby. The Manager screams in terror, as do \n               several of the hotel guests.\n\n<b>                                     MANAGER\n</b>                              (continuing)\n                         That's it. I'm calling the cops.\n\n<b>               INT. HOTEL SUITE - NIGHT\n</b>\n               Some more uninvited guests come drifting into the room.\n\n<b>                                     RICK\n</b>                         Welcome, welcome, one and all.\n\n<b>                                     MR. THOMERSON (O.S.)\n</b>                         Rick!\n\n<b>                                     RICK\n</b>                              (recognizing the voice)\n                         Oh, no!\n\n               He turns and spots Mr. Thomerson as he makes his way through \n               the party.\n\n<b>                                     RICK\n</b>                         Christ... it's Mr. Laughs.\n\n               Mr. Thomerson goes nose to nose with Rick.\n\n<b>                                     MR. THOMERSON\n</b>                         This is it. You're through. When \n                         Debbie hears about this she'll never \n                         see you again. Now I'm calling the \n                         cops to break up this sex orgy... \n                         And toss your ass in jail!\n\n               He turns away and walks OUT OF FRAME. O'Neill crosses to \n               Rick.\n\n<b>                                     O'NEILL\n</b>                         What are you going to do about it?\n\n<b>                                     RICK\n</b>                              (defeated)\n                         What can I do? I'm dead. Debbie's \n                         going to go crazy and end the whole \n                         thing.\n\n<b>                                     O'NEILL\n</b>                         I'll stop him... You stall him.\n\n<b>               ANOTHER ANGLE\n</b>\n               Mr. Thomerson is heading for the phone in the bedroom.\n\n<b>                                     RICK\n</b>                         Mr. Thomerson!\n\n               Thomerson stops and turns to Rick.\n\n<b>                                     RICK\n</b>                              (continuing; dramatic)\n                         Please, no. Don't ruin my life. \n                         Please!\n\n               He drops to his knees and hugs Thomerson's legs. The party \n               stops and everyone watches.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         It's not me. I was brought up on the \n                         wrong side of the tracks. A victim \n                         of my environment...\n\n<b>               INT. HOTEL BEDROOM - O'NEILL AND LARRY\n</b>\n               Larry is handing O'Neill a plastic bag filled with white \n               powder.\n\n<b>                                     O'NEILL\n</b>                         Is that all the coke in the place?\n\n<b>                                     LARRY\n</b>                         That's it.\n\n<b>                                     O'NEILL\n</b>                         Good.\n\n               O'Neill unscrews the mouthpiece off the phone. He pours the \n               bag of cocaine into the phone. He then screws the mouthpiece \n               back on over this mound of powder. Satisfied with his work, \n               he exits the bedroom.\n\n<b>               INT. SUITE - MAIN ROOM\n</b>\n               Thomerson is trying to free himself from Rick's grasp as \n               Rick continues with his \"hard luck\" story.\n\n<b>                                     RICK\n</b>                         My poor old mammy had to take in \n                         laundry. My pappy had to work 20 \n                         hours a day at the Pez Factory.\n\n<b>               ANOTHER ANGLE\n</b>\n               O'Neill gestures to Rick that everything's ready. Rick \n               immediately jumps to his feet.\n\n<b>                                     RICK\n</b>                         The end.\n\n<b>                                     MR. THOMERSON\n</b>                         No sob story is going to change my \n                         mind.\n\n               Mr. Thomerson pushes O'Neill aside and enters the bedroom.\n\n<b>                                     O'NEILL\n</b>                         The phone's all yours.\n\n               Mr. Thomerson, in the bedroom, picks up the receiver. As he \n               does so, a cloud of cocaine falls out of the mouthpiece. He \n               screams at Rick, gesturing with the phone in his hand as he \n               dials. Each move produces a large cloud of powder, which \n               causes him to sniffle slightly.\n\n<b>                                     MR. THOMERSON\n</b>                         I never liked you. I've never liked \n                         any of your friends. I've hated you \n                         from the first time I saw you. And \n                         now you are out of my life. You are \n                         out of my life!\n\n               He starts to react from inhaling the powder. He puts the \n               receiver to his ear. He takes a deep breath and tries to \n               dial another number. A large cloud of coke flies up his nose. \n               He's stunned. He takes another deep drag. He's hooked. He \n               forgets all about dialing. He jams the receiver against his \n               nose and takes deep drag after deep drag.\n\n               Desiree, still wearing her leather mask, crosses to him and \n               sits down next to him on the bed. He gives her a big, wide \n               smile.\n\n               O'Neill closes the door.\n\n<b>                                     O'NEILL\n</b>                         Reach out and snort someone.\n\n<b>                                     RICK\n</b>                         I'm saved. Let's party!\n\n               Everyone starts to whoop it up again.\n\n<b>               INT. JAPANESE SUITE\n</b>\n               It's still a standoff between the girls and the horny \n               Japanese.\n\n<b>                                     DEBBIE\n</b>                         Let's give them what they want.\n\n<b>                                     PHOEBE\n</b>                         What?\n\n               Debbie opens the bedroom door and motions for the Japanese \n               to file in.\n\n<b>                                     DEBBIE\n</b>                         Let's go. Everyone inside.\n\n               The Japanese immediately put two and two together and get \n               orgy. These are some happy fellas as they enter the bedroom.\n\n<b>                                     BOBBIE\n</b>                         Deb, we're pretending to be hookers.\n\n<b>                                     DEBBIE\n</b>                              (herding in the last \n                              Japanese)\n                         Right in here. The big show starts \n                         in one minute.\n\n               The Japanese man enters the room. Debbie slams the door shut \n               behind him.\n\n<b>                                     DEBBIE\n</b>                         Let's go.\n\n<b>                                     ILENE\n</b>                         Look, girls -- I'll stay behind and \n                         hold them off. The rest of you break \n                         for it!\n\n<b>                                     DEBBIE\n</b>                         Ilene, are you crazy?\n\n<b>                                     ILENE\n</b>                         I know what I'm doing... Go!\n\n               The girls run out the door.\n\n<b>               INT. JAPANESE BEDROOM\n</b>\n               Ilene smiles. She has what she wants. She walks into the \n               bedroom, surrounded by panting Japanese.\n\n<b>                                     ILENE\n</b>                         Gentlemen, the gods have answered \n                         your prayers... Bonzai!\n\n               She takes a running leap and dives on top of the Japanese.\n\n<b>               INT. CORRIDOR\n</b>\n               Debbie and the ladies run to an elevator. Debbie presses the \n               \"down\" button.\n\n<b>                                     MRS. THOMERSON\n</b>                         I hope Ilene's all right.\n\n<b>                                     DEBBIE\n</b>                         I hope those guys are all right.\n\n               The elevator door opens, revealing the donkey lying flat on \n               his back. His stiff legs point skyward. The girls see him \n               and scream. They run down the hall to the stairway. On the \n               way Debbie notices she's passing Room 1002. She HEARS the \n               party SOUNDS inside.\n\n               She heads for the room angrily. This is a lady out to even a \n               score.\n\n<b>               INT. HOTEL SUITE\n</b>\n               As Debbie opens the door, her father walks by with Desiree \n               on his arm. Neither sees the other. Debbie enters the room. \n               She is surprised by the masses of humanity rubbing shoulders \n               with one another in the room.\n\n               O'Neill looks over from the other side of the room and spots \n               her. He isn't fooled for a minute by her wig and mini skirt. \n               He runs over to Rick.\n\n<b>                                     O'NEILL\n</b>                         Guess who's here? Another surprise \n                         guest.\n\n<b>                                     RICK\n</b>                         Who?\n\n<b>                                     O'NEILL\n</b>                         Debbie.\n\n<b>                                     RICK\n</b>                         My Debbie?\n\n<b>                                     O'NEILL\n</b>                         What's with her costume?\n\n               O'Neill points and Rick sees Debbie. She doesn't see them.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         I don't know... Go up to her, make \n                         like you don't know her and send her \n                         into the other bedroom.\n\n<b>                                     O'NEILL\n</b>                         You got it.\n\n               O'Neill crosses to Debbie.\n\n<b>                                     O'NEILL\n</b>                              (continuing)\n                         Hi, baby. You're new here. I don't \n                         think the groom's had you yet, has \n                         he?\n\n               PUSH IN ON Debbie. She's pissed.\n\n<b>                                     DEBBIE\n</b>                         No, not yet. Where is he?\n\n<b>               INT. BEDROOM\n</b>\n               Rick opens the door from the bathroom. The lights are turned \n               off and from the flashing illumination of a neon sign outside \n               the window we can MAKE OUT the outline of Debbie's body on \n               the bed.\n\n<b>                                     RICK\n</b>                         I can't see anything.\n\n               Debbie, in a disguised Southern accent, speaks out.\n\n<b>                                     DEBBIE\n</b>                         Don't turn on the lights, sugar.\n                              (seductively)\n                         I'll lead you around.\n\n<b>                                     RICK\n</b>                         How wonderful. A seeing eye hooker.\n\n<b>                                     DEBBIE\n</b>                         Why don't you get undressed.\n\n               Rick starts to undress. While undressing, he takes on the \n               persona of Mr. Rodgers. He sings Rodgers' opening theme in \n               that same sappy, child-like manner of his.\n\n<b>                                     RICK\n</b>                              (singing)\n                         It's a lovely day in the neighborhood. \n                         It's a lovely day, it's a beauty, \n                         would you be mine, could you be mine.\n                              (he's now stripped \n                              down to his underwear)\n                         ...Please won't you be my neighbor.\n                              (as Mr. Rodgers)\n                         Hi... Hi there... Today we're going \n                         to learn about anatomy...\n\n               He jumps on top of her and starts mauling her passionately. \n               Debbie snaps on the lights. She throws off her wig and she \n               and Rick come face to face.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Debbie... you're a hooker! I can't \n                         believe it!\n\n               She all but jumps out of bed.\n\n<b>                                     DEBBIE\n</b>                         I can't trust you!\n\n<b>                                     RICK\n</b>                         C'mon, I knew it was you.\n\n<b>                                     DEBBIE\n</b>                              (holding back tears)\n                         Rick, you're lying!\n\n               As Rick protests, she throws on her blouse and runs out of \n               the room. Rick charges after her.\n\n<b>               INT. HOTEL SUITE - MAIN ROOM\n</b>\n               The place is wall to wall people.\n\n<b>               ANGLE - DEBBIE\n</b>\n               She tries to make her way to the exit, but her path is slowed \n               by all the happy revelers.\n\n<b>                                     DEBBIE\n</b>                              (yelling over the \n                              din; furious)\n                         Let go of me!\n\n<b>                                     RICK\n</b>                              (yelling back)\n                         Debbie, I'm telling you, I didn't do \n                         anything, hardly.\n\n<b>                                     DEBBIE\n</b>                         The marriage is off. Now you can \n                         screw around with your friends for \n                         the rest of your life.\n\n<b>                                     RICK\n</b>                         I don't want that. I want to be with \n                         you.\n\n<b>                                     DEBBIE\n</b>                         And I want to be with someone who \n                         understands the meaning of the word \n                         commitment.\n\n<b>                                     RICK\n</b>                         I am committed. I love you.\n\n               Just then Desiree and Mr. Thomerson cross THROUGH FRAME. \n               She's leading him around by the silver chain, which is now \n               attached to his neck. She's also carrying a leather whip.\n\n<b>                                     DEBBIE\n</b>                         I don't believe you.\n\n<b>                                     RICK\n</b>                         You don't believe me? Okay, fine.\n\n               Rick gets up on the sofa and yells loudly over the din.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         People! Can I have your attention... \n                         people!\n\n               Everyone stops what they're doing and looks up.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         I want to ask you all a question. \n                         Have I had sex with anybody in this \n                         room tonight?\n\n               There's a negative response from the crowd.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Are you sure?\n\n               Everyone responds positively.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         Thank you.\n\n               All the guests go back to partying. Rick drops off the sofa \n               and faces Debbie.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         See? And these are not just ordinary \n                         party-goers -- there are professionals \n                         in this crowd -- I didn't want any \n                         of them. You... You're what I want. \n                         Understand?\n\n<b>                                     DEBBIE\n</b>                              (melted)\n                         Yes...\n\n<b>                                     RICK\n</b>                         Great. Now, what do you want to do \n                         about it?\n\n<b>                                     DEBBIE\n</b>                              (sexy)\n                         Let's get naked.\n\n<b>                                     RICK\n</b>                         You're on.\n\n               She takes him by the hand and crosses into the other bedroom.\n\n<b>               INT. OTHER BEDROOM\n</b>\n               Rick and Debbie enter. To their surprise they find a man \n               wearing a leather mask tied to the bed and happily licking \n               Desiree's boots, which she dangles in front of him. She also \n               holds a whip over his head. Despite the mask, there is \n               something very familiar about his face, and the white powder \n               encrusted all over his nose.\n\n               Debbie picks up on this immediately.\n\n<b>                                     DEBBIE\n</b>                              (shocked)\n                         Daddy?\n\n               Sure enough, Mr. Thomerson looks up and grimaces, knowing \n               he's been caught with his bondage down. He tries to say \n               something, but the boot in his mouth prevents anything \n               intelligent from coming out.\n\n<b>                                     MR. THOMERSON\n</b>                         Ebbie. Ger... umph... lable...\n\n<b>                                     RICK\n</b>                         Of course, sir. That explains it. \n                         Leather is a very good source of \n                         vitamin E.\n\n<b>               INT. SUITE - MAIN ROOM\n</b>\n               The party has reached fever pitch. Suddenly police SIRENS \n               pierce through the party sounds. Everyone freezes. We HEAR \n               the Hotel Manager BEATING on the DOOR with his fists.\n\n<b>               INT. HOTEL CORRIDOR\n</b>\n               The Manager is pounding on the door. By his side are several \n<b>               UNIFORMED POLICE.\n</b>\n<b>                                     MANAGER\n</b>                         You're all under arrest. Open up!\n\n<b>               INT. HOTEL SUITE\n</b>\n<b>                                     RICK\n</b>                              (to everyone in the \n                              room)\n                         Your attention, please. May I be the \n                         first to say, It's a raid!\n\n               Everyone starts to panic and run for the doors.\n\n<b>                                     RICK\n</b>                              (continuing)\n                         I'm glad no one is panicking.\n\n               He snaps up his clothes from the bedroom.\n\n<b>               INT. HOTEL CORRIDOR\n</b>\n<b>                                     MANAGER\n</b>                              (to Police)\n                         Break it in, boys!\n\n               The cops rear back for a run at the door. At that moment the \n               hotel door opens up and the cops and the Manager are trampled \n               by Rick, Debbie, Mr. Thomerson, Rick's gang, other guests \n               and assorted hookers. They run down the stairs. The cops \n               pick themselves up and give chase. The Manager looks inside \n               the room and is devastated by what he sees... Hiroshima looked \n               better after the A-bomb.\n\n<b>               INT. HOTEL LOBBY\n</b>\n               We SEE the police have collared Bobbie, Phoebe, Mrs. Thomerson \n               and the other ladies of the shower as hooker suspects. Our \n               bachelor party mob now charges down the stairs and out the \n               hotel doors.\n\n               The cops grab Mr. Thomerson as he tries to get out, and they \n               throw him in line with the others. Unfortunately for him, \n               he's standing next to Mrs. Thomerson.\n\n<b>                                     MRS. THOMERSON\n</b>                         Ed! What are you doing here?\n\n               Before he can answer, Mrs. Thomerson checks out his shocking \n               leather outfit.\n\n<b>                                     MRS. THOMERSON\n</b>                              (angry)\n                         Ed... you're kinky!\n\n<b>                                     MR. THOMERSON\n</b>                         The phone made me do it!\n\n<b>                                     MRS. THOMERSON\n</b>                              (shocked)\n                         You've been having strange sex...!\n\n<b>                                     MR. THOMERSON\n</b>                         No, Brett, I...\n\n<b>                                     MRS. THOMERSON\n</b>                         It's all right...\n                              (proudly)\n                         So have I.\n\n               He is totally blown away by this as the cops lead them out \n               of the room.\n\n<b>                                     MRS. THOMERSON\n</b>                         I've seen another man's diddly.\n\n<b>               EXT. HOTEL - MORNING\n</b>\n               Our people pile out of the hotel. Rick, Debbie and all Rick's \n               friends run down the street.\n\n               Suddenly a Porsche pulls up between Rick and Debbie. It's \n               Cole. He reaches over and pulls Debbie into the car with \n               him. She screams.\n\n<b>                                     RICK\n</b>                         Cole, what the hell are you doing?\n\n<b>                                     COLE\n</b>                         She's mine!\n\n               He drives off.\n\n<b>                                     RICK\n</b>                         He's kidnapped her! Everyone into \n                         the bus!\n\n               They all board the bus.\n\n<b>               EXT. CITY STREET\n</b>\n               As Cole rounds a corner, a tire comes loose and rolls off \n               the car -- thanks to Chulo's shoddy workmanship.\n\n<b>               INT. PORSCHE\n</b>\n<b>                                     COLE\n</b>                         Shit, shit, shit, shit, shit.\n\n               He looks to the rear and sees Rick's bus not far behind them. \n               Suddenly he spots something O.S. He grabs Debbie and runs \n<b>               OUT OF FRAME.\n</b>\n<b>               EXT. CITY STREET\n</b>\n               A city maintenance truck is driving slowly down the center \n               of the street. A man in the back of the truck is leisurely \n               placing orange cones in the center line of the road.\n\n               Cole, with Debbie in tow, grabs the truck's DRIVER and hauls \n               him out of his seat. He then places Debbie inside the truck \n               and him at the wheel. He peels out. Our man with the cones \n               in the back is unaware of what has happened. He keeps placing \n               the cones on the street. However, now the truck is hitting \n               speeds in the upper 70's. The man's leisure pace speeds up. \n               He rapidly places cones on the road at break-neck speed.\n\n<b>               INT. RICK'S BUS\n</b>\n               Rick, is plowing into the cones and knocking them all over.\n\n<b>               MAINTENANCE TRUCK\n</b>\n               Our man with the cones is almost completely exhausted.\n\n<b>               EXT. HIGHWAY\n</b>\n               Rick is in pursuit, knocking over cones. He's almost caught \n               up with Cole.\n\n<b>               EXT. STREET\n</b>\n               The vehicles reach the top of the hill. Cole grabs a sharp \n               left and pulls into a movie theater parking lot. The maneuver \n               loses Rick for a second. Rick jams on the brakes and doubles \n               back into the parking lot.\n\n<b>               EXT. MOVIE THEATER PARKING LOT\n</b>\n               Cole pulls up with a SCREECH in front of the theater. He \n               grabs Debbie and jumps out of the truck. He drags her into \n               the theater entrance.\n\n               Rick brings his bus to a stop and he and the gang pour out \n               of the bus.\n\n<b>                                     COLE\n</b>                         He and Debbie stand outside the \n                         theater, which is a multi-plex cinema. \n                         Fourteen movie theaters under one \n                         roof. Prominent is a sign which reads: \n                         \"24 HOUR 3D FESTIVAL!\" Cole drags \n                         Debbie into one of the theaters. The \n                         gang runs up to the theaters.\n\n<b>                                     RICK\n</b>                         Fan out and look for them.\n\n               They all go running into various theaters.\n\n<b>               ANGLE - RYKO\n</b>\n               He approaches a theater and sees the title of the movie \n               playing inside.\n\n<b>                                     RYKO\n</b>                         Aw, I've seen this one already.\n\n               Rick chooses a theater and goes inside.\n\n<b>               INT. MOVIE THEATER\n</b>\n               The patrons are wearing their 3D glasses, watching the action \n               on the screen. On the movie screen we SEE a man and a woman \n               arguing. Cole and Debbie enter the theater. They run down to \n               the front of the screen, heading for an exit. Rick enters. \n               He gives chase and catches up with Cole.\n\n               He takes a swing at Cole and Cole swings back. Behind them \n               on the screen a man has come to the rescue of the woman.\n\n               A fight starts in the movie, also. The patrons sit calmly \n               watching the action. Miraculously, Rick's fight with Cole is \n               in perfect sync with the actors in the movie. Rick hits Cole \n               with a punch that sends him backwards into several movie \n               patrons. The patrons are impressed by the realism of the \n               film's special effects. Cole throws a punch. Rick ducks. The \n               punch hits a MAN in the front row in the mouth.\n\n<b>                                     MAN\n</b>                              (to LADY next to him)\n                         Gee, what a realistic effect.\n\n<b>                                     WOMAN\n</b>                         Yeah, like you're in the movie with \n                         them.\n\n               Rick climbs over several rows and continues to pummel Cole. \n               Cole grabs a woman's purse and begins to hit Rick with it. \n               Cole runs out of the aisle as Rick climbs over people and \n               dives onto Cole, knocking him to the aisle.\n\n<b>                                     PATRON\n</b>                              (to his date)\n                         Best 3D I've ever seen.\n\n               As the movie ends, Rick has Cole by the collar and is dragging \n               him out of the theater.\n\n<b>               INT. MALL OUTSIDE THEATER\n</b>\n               Rick exits the theater with Cole. He tosses Cole to Chulo. \n               Debbie comes running behind Rick.\n\n<b>                                     RICK\n</b>                              (to Debbie)\n                         Are you okay?\n\n<b>                                     DEBBIE\n</b>                         Yeah.\n\n<b>                                     RICK\n</b>                         This has been quite a night. Here's \n                         a thought. Why don't we go home and \n                         give our private parts a workout?\n\n<b>                                     DEBBIE\n</b>                              (hugging him)\n                         You're so romantic...\n\n               The Patrons are exiting. All of them are very up and excited \n               by their 3D experience.\n\n<b>                                     WOMAN\n</b>                         Absolutely amazing.\n\n               A Man who has taken a punch and has had his jacket ripped to \n               shreds doesn't seem pleased.\n\n<b>                                     MAN\n</b>                         I've seen better.\n\n<b>               EXT. BLUFF - DAY\n</b>\n               It's another gorgeous day on the bluff overlooking the ocean. \n               Just right for Rick and Debbie's wedding. We SEE the wedding \n               in progress. The area is adorned with flowers.\n\n               The many guests are seated and taken in the moment. Among \n               these are Tracey, Desiree and Gary's she-man, who waves to \n               Gary as he stands with the other ushers, Chulo, Ryko and \n               Larry. Chulo is choked up and trying to hide his tears. He \n               looks over at Laverne, who smiles to him.\n\n<b>                                     CHULO\n</b>                              (to Ryko)\n                         Hey, man, don't forget my bachelor \n                         party's next Friday night.\n\n<b>                                     GARY\n</b>                         I'll get the hookers.\n\n<b>                                     RYKO\n</b>                         No way.\n\n               Nearby stand the maids of honor, Bobbie, Phoebie and Ilene, \n               who blows a kiss to her date, Ray (one of the Japanese \n               businessmen).\n\n               The Thomersons sit in the front row. Neither of them is \n               cherishing this moment.\n\n<b>                                     MR. THOMERSON\n</b>                              (sotto; to Mrs. \n                              Thomerson)\n                         We'll have morons for grandkids.\n                              (resigned to the fact)\n                         But... at least we'll have grandkids.\n\n               They sort of smile at each other at the thought.\n\n               Father Falwell is almost through with the ceremony. A car \n               pulls up in the b.g. Exiting the car is Stan and a WOMAN. \n               O'Neill, the best man, sees the car. He pokes Rick. He \n               indicates to Rick someone has arrived.\n\n<b>               STAN\n</b>\n               We SEE the man in the car is Stan. He ushers the lady in the \n               car to Larry. He's surprised at who she is: his wife.\n\n<b>                                     LARRY\n</b>                         Sue!\n\n<b>                                     SUE\n</b>                         Hi, honey.\n\n<b>                                     LARRY\n</b>                         How'd you get here?\n\n<b>                                     SUE\n</b>                         Rick called me.\n\n               Larry looks to Rick and gives him a warm smile and a wave. \n               Rick acknowledges Larry.\n\n<b>                                     LARRY\n</b>                         Why don't we go someplace and talk.\n\n               They walk off.\n\n<b>               FATHER FALWELL\n</b>\n<b>                                     FATHER FALWELL\n</b>                         Now, before I pronounce you man and \n                         wife, the groom wishes to recite his \n                         vow to Debbie. Richard.\n\n<b>                                     THOMERSONS\n</b>                         They fear the worst.\n\n<b>                                     MR. THOMERSON\n</b>                         Oh, God Almighty.\n\n<b>               RICK\n</b>\n               He turns to Debbie. He waits a beat and begins.\n\n<b>                                     RICK\n</b>                         Cheese. I love you more than cheese. \n                         And I love cheese a lot.\n\n<b>                                     THOMERSONS\n</b>                         They hide their faces in their hands. \n                         Off in the distance a storm is coming \n                         in fast over the ocean. The wind \n                         begins to pick up. Undaunted, Rick \n                         continues his soliloquy.\n\n<b>                                     RICK\n</b>                         In fact, more than dairy products in \n                         general. I love dairy. My love is \n                         cream. Pour me on the cereal of your \n                         life...\n\n               Now it starts to rain.\n\n<b>               FATHER FALWELL\n</b>\n               He wants this to end. He calls softly to Rick, trying to get \n               his attention.\n\n<b>                                     FATHER FALWELL\n</b>                         Rick. Rick. Hey...\n\n               People begin to scurry for cover. In the b.g., under a tree, \n               we SEE Larry and his wife huddled in each other's arms. From \n               the way they look, they have worked things out.\n\n<b>               RICK\n</b>\n<b>                                     RICK\n</b>                         I think this song pretty much sums \n                         up the way I feel at this moment.\n\n               He begins to sing the theme from \"The Flintstones\" with all \n               the gusto of Jack Jones.\n\n               Father Falwell has had enough.\n\n<b>                                     FATHER FALWELL\n</b>                              (rapid fire)\n                         I now pronounce you man and wife. \n                         Goodbye.\n\n               He blesses them lightning fast and springs for his car.\n\n<b>               THE SCENE\n</b>\n               CREDITS ROLL as Rick continues to sing in the driving rain. \n               Debbie joins in on the chorus. She loves her man.\n\n               Everyone has run for the safety of their cars. Everyone but \n               the Thomersons, who sit and look on bewildered.\n\n<b>                                     RICK AND DEBBIE\n</b>                         \"Flintstones, meet the Flintstones \n                         They're a prehistoric family From \n                         the town of Bedrock They're a page \n                         right out of history...\"\n\n<b>                                                                  FADE OUT:\n</b>\n<b>                                         THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Bachelor-Party.jpg\"/>\n</td><td><h1>Bachelor Party</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Neal Israel\" title=\"Scripts by Neal Israel\">Neal Israel</a>  <a href=\"/writer.php?w=Pat Proft\" title=\"Scripts by Pat Proft\">Pat Proft</a>  <a href=\"/writer.php?w=Bob Israel\" title=\"Scripts by Bob Israel\">Bob Israel</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Bachelor Party Script.html#comments\" title=\"Bachelor Party comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 21:59:24.307889"}