{"title": "Basquiat", "film_link": "/Movie Scripts/Basquiat Script.html", "script_link": "/scripts/Basquiat.html", "info_raw": "\n\nBasquiat Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Julian Schnabel\nGenres  Drama\n\nRead \"Basquiat\" Script\n\n\n", "script": "\nBLACK\n\nWe HEAR \"Waltzing Matilde,\" by Tom Waits.\n\n\nINT. MUSEUM OF MODERN ART - DAY (DREAM SEQUENCE IN GRAINY BLACK\nAND WHITE)\n\nFade out music.\n\nSilence.\n\nA well-dressed black BOY and his MOTHER walk through several\ngalleries.\n\nThey stand before Picasso's \"Guernica,\" holding hands.\n\nThe mother is disturbed. Crying.\n\nThe boy looks up, confused and frightened, concerned to see his\nmother crying in public. She looks at him tenderly.\n\nHer brow furrows. She stops crying. She stares just above his\neyes.\n\nSomething's happening: she looks with wonder at the top of his\nhead... his eyes roll upward, trying to see - it's a crown!\n\nHe raises his hands. He touches it.\n\nA beam of light illuminates the crown, casting its glow on his\nmother's face.\n\nThe beam gets whiter, the rest of the screen gets black.\n\n\nINT. CARDBOARD BOX\n\nSilence. In darkness, we hear a VOICE - imbued with a sense of\nits own history:\n\n                      VOICE (O.S.)\n           Everybody wants to get on the Van Gogh\n           boat. There's no trip so horrible that\n           someone won't take it. The idea of the\n           unrecognized genius slaving away in a\n           garret is a deliciously foolish one. We\n           must credit the life of Vincent Van Gogh\n           for really sending this myth into orbit.\n           How many pictures did he sell? One? He\n           couldn't give them away. We are so ashamed\n           of his life that the rest of art history\n           will be retribution for Van Gogh's neglect.\n           No one wants to be part of a generation\n           that ignores another Van Gogh.\n\nThe beam of light shines through a small hole. It falls upon a\nsleeping, dreaming, delighted face. It belongs to JEAN MICHEL\nBASQUIAT.\n\nOUTDOOR, DAYTIME SOUNDS filter in.\n\nHearing the voice, Jean frowns at being woken up.\n\n\nEXT. TOMPKINS SQUARE PARK - DAY\n\nA long, rectangular cardboard box.\n\nSUPER: \"NEW YORK CITY\"\n\n\nANGLE ON:\n\nRENE RICARD (early 30's), seated at a park bench, hunched over a\nnotebook. He's a raggedy dandy: A poet in a hooded sweatshirt and\nwhite hightops.\n\nAs he writes, he reads aloud, as if addressing Posterity.\n\n                        RENE (CONT'D)\n                   (sighing theatrically)\n            In this town one is at the mercy of the\n            recognition factor. One's public\n            appearance is absolute.\n\nBeyond him, a HAND gropes its way out of the box. It tosses a can\nof YOOHOO chocolate drink.\n\n                       RENE (CONT'D)\n            I consider myself a metaphor of the public.\n            I am a public eye. I am a witness.\n\nA HEAD appears from the box. It's Jean's.\n\nJean sees the start of a crisp, colorful autumn day. The urban\npark around him is alive with a typically full range of the good\nand bad in life. He eases himself out of the oversize box in\nwhich he has spent the night. There's something about the way\nthat he stands while waking up that suggests he's almost\nsurprised at his own body, the adultness of his limbs - just a\nsubtle hint of him coming out of a dream.\n\nHe squints in the sunlight. He has a soft, gentle, Haitian face.\nHis hair is pulled tight to his head. He wears two pairs of blue\njeans (one cut like chaps over the other) a paint-covered\nWesleyan University T-shirt, and the inside lining of an\novercoat. His appearance is unruly, but it's deliberate. He's\nstylish.\n\nHe shakes himself off and collects his stuff, which includes: a\nsmall book of Pontormo drawings, a can of black spray paint. and\na cigar box made into a loudspeaker with pencil holes and masking\ntape.\n\nJean walks out of the park and looks up past the buildings at the\nsky:\n\n\nSUPERIMPOSED IN THE SKY - STOCK FOOTAGE OF A HAWAIIAN SURFER\n\nJean sees the surfer, 'riding the nose' in glistening, shimmering\n\nsunlight.\n\n                                                  DISSOLVE TO:\n\n\nEXT. TOMPKINS SQUARE PARK - DAY\n\nRene grabs the box for use as a desk and continues to speak out\nloud as he writes.\n\n                       RENE (CONT'D, O.S.)\n            Part of the artist's job is to get the work\n            where I will see it.\n\n\nEXT. LOWER EAST SIDE ST. - DAY\n\nAs he speaks, we see Jean pass the wall of a funeral parlor. He\nspraypaints: \"SAMO AS AN ALTERNATIVE TO GOD\"\n\n                        RENE (CONT'D, O.S.)\n            When you first see a new picture, you don't\n            want to miss the boat. You have to be very\n            careful because you may be staring at Van\n            Gogh's ear.\n\nJean signs his words with his 'logo', a triple pointed crown.\n\nAs he presses the spray can, we HEAR the roar of a breaker.\n\n                                                  CUT TO:\n\n\nINSERT: CLOSEUP OF SIDEWALK\n\nPressed into the concrete is a pair of EYEGLASSES. A light-\ncolored piece of rock completes the picture to make a face.\n\n\nEXT. LESHKO'S RESTAURANT - DAY\n\nJEAN'S POV: His shoes pause next to the face in the concrete.\n\n                                                  CUT TO:\n\n\nIN FRONT OF THE RESTAURANT\n\nIs a METAL BILLBOARD with red plastic magnetized LETTERS that\nreads: \"TODAY'S SPECIAL: CLAM CHOWDER $1.50. TRY IT!!!\"\n\n                                                  CUT TO:\n\n\nINT. LESHKO'S - DAY\n\nJean enters.\n\n                                                  CUT TO:\n\nEXT. LESHKO'S RESTAURANT - DAY\n\nThe sign. It now reads: \"SAMO'S DAY OLD TEETH $5.00\"\n\n                                                     CUT TO:\n\n\nINT. LESHKO'S RESTAURANT - DAY\n\nBending over a countertop, we see GINA CARDINALE, 22. He fixates\non her.\n\nShe looks up and notices his stare. She continues to work.\n\nStill staring at her, he sits down at a table. He pours maple\nsyrup onto the table. He draws in the syrup with his fingers.\n\n\nCLOSE ON SYRUP ON TABLE\n\nANOTHER WAITRESS arrives at his table. She's put off by the\nsyrup.\n\n                      WAITRESS\n           What'll it be?\n\nJean thinks about it, eyes still following Gina.\n\n                       BASQUIAT\n           Ummm. It'll be great. We'll live together\n           in peace. What's her name?\n                  (indicates Gina)\n\nHe looks up at the waitress.\n\n                      WAITRESS\n           Gina. What'll it be?\n\n                       BASQUIAT\n           Pancakes.\n\nShe leaves and whispers something to Gina. Gina turns and glances\nover at Jean.\n\nJean pours more syrup and starts writing his name.\n\nAt the grill, LESHKO, the burly Owner/Cook, has his watchful eye\non Jean. He doesn't like what he sees.\n\nJean smears the syrup thinly, so it doesn't erase itself. He\ndraws a picture of Gina, using his fingers and the silverware,\nrendering her last expression strikingly with a few quick lines.\n\nA GAUNT YOUNG MAN saunters up to Jean's table. He's sort of a\ntall Puerto Rican Alain Delon with sleepy eyes. He is BENNY.\n\n                      BENNY\n           Hey - Willie Mays.\n\n                      BASQUIAT\n           Willie Mays.\n\nSuddenly, Rene Ricard enters - a one-man parade. He beckons to\nGina, snapping his fingers.\n\n                      RENE\n           Nurse!!! Oh!!! Nurse!!! Carrot juice. Tofu\n           burger. Rapido!\n\n                      GINA\n           We don't serve that - amigo.\n\n                      RENE\n           Fine... A greasy cheeseburger. Fries - and\n           a vodka.\n\n                       BASQUIAT\n                  (under his breath)\n           Who's that?\n\n                      BENNY\n           The Devil, man. Rene Ricard. Art critic -\n           writes for Artforum. People read him. Tell\n           him who you are..\n\n                         BASQUIAT\n           Who am I?\n\n                         BENNY\n           SAMO.\n\n                         BASQUIAT\n           Oh yeah..\n\nRene lands at the counter.\n\nJean's gaze is still on Gina.\n\nShe waits on a MAN at a nearby table.\n\n                      CUSTOMER\n           How's the special today?\n\n                      GINA\n           It's your stomach.\n\nShe hurries past Jean.\n\n                         BASQUIAT\n           Hey.\n\nShe slows down, not wanting to.\n\n                      BASQUIAT (CONT'D)\n           What do you think?\n\nShe looks at her portrait in the syrup... She can't resist\nsmiling.\n\n                      GINA\n           It's me. I've never been done in maple\n           syrup. Here's a rag.\n\nGina smiles. She offers him one. As she holds it out, their eyes\nlock. She tries to resist his smile.\n\n                        BASQUIAT\n                   (gently)\n           Gina?\n\nShe puts her finger in the syrup and licks it off.\n\nBenny takes it all in.\n\nLeshko is upon them.\n\n                      LESHKO\n           Alright. Look at you, staring at this girl,\n           making a mess.\n\nHe waves Jean toward the door.\n\nJean takes Gina's rag and begins cleaning his mess, seemingly\ncompliant.\n\n                      BASQUIAT\n           How about those pancakes?\n\nHe brings out a roll of dimes to the tabletop and splits it open.\nDimes roll all over the table and stick in the syrupy parts. The\nmanager explodes.\n\n                      LESHKO\n           OK! Goodbye!\n\n                      GINA\n           Pipe down, Lech. Let him order.\n\n                      LESHKO\n           You nuts? Let him order? You on his side?\n           You're not such a good waitress. You get\n           out, too.\n\n                      GINA\n           I just don't think you're being fair.\n\n                      LESHKO\n           I need this?\n\n                      GINA\n           I need this?\n\nGina quietly removes her apron in disbelief.\n\nBenny gets up to leave very casually.\n\n                       BENNY\n                  (waving g'bye to Jean)\n           Willie Mays.\n\n                       LESHKO\n                  (to Gina)\n           That's right. You go with them. Make babies\n\n           the government has to pay for.\n\n                                                     CUT TO:\n\n\nGINA AND JEAN\n\nLeave the restaurant.\n\nBehind them, we see Rene, absorbed in his writing.\n\n\nEXT. AVE. A - DAY\n\nThey stand outside, not knowing quite what comes next.\n\nJean gives Benny a look (i.e. 'scram').\n\n                      BENNY\n           Catch you later.\n\nBenny leaves.\n\nA CHILLY WIND picks up.\n\nJean's mood is suddenly downcast.\n\nThey button up their overcoats, about to leave.\n\n                       GINA\n           What's a job, anyway?\n                  (pause)\n           What's wrong with you?\n\nThe truth is, he feels awful for causing Gina's trouble, but\nshows it by moping like a child.\n\n                      GINA (CONT'D)\n           No, don't tell me - you just got fired by\n           your crazy boss.\n\n                      BASQUIAT\n           I guess you did.\n\n                      GINA\n           Guess I just got sick of him.\n\n                      BASQUIAT\n           Can I walk you home?\n\n                      GINA\n           I think I could do that alone.\n\nGina walks away.\n\nHe runs after her.\n\n                      BASQUIAT\n           Wait, I'm in a band....We're at the Mudd\n           Club on Halloween. I'll put you on the\n           list.\n\nGina turns and looks back at Jean.\n\n                      GINA\n           I hate the Mudd Club.\n\nHe catches up to her.\n\nGina notices a dead leaf in his hair and picks it out.\n\n                      GINA (CONT'D)\n           Have you been camping? You could use a\n           scrub.\n\n                      BASQUIAT\n           I'm clean. Smell me. I always smell good. I\n           don't know why, I just do!\n\nHe leans forward, offering his neck.\n\n                       GINA\n                  (smelling)\n           You do! You definitely do.\n\n                      BASQUIAT\n           Just come to the Mudd Club on Friday.\n\n                      GINA\n           I don't go there. Too many party girls.\n\n                      BASQUIAT\n           Party girls? Can I call you?\n\n                       GINA\n                  (teasing him)\n           Yeah, if you have any dimes left. 477-0496.\n\nHe writes her number on his pant cuff with a big fat magic\nmarker.\n\n                      BASQUIAT\n           Here, this is for you. I made this.\n\nHe hands her the small speaker.\n\nShe takes it.\n\n                        GINA\n           Thanks.\n\nShe admires the speaker watches him walk off.\n\n\nEXT. MENTAL HOSPITAL (OUTSIDE THE CITY)\n\nWe see Jean crossing a lawn outside a mental hospital.\n\n\nINT. MENTAL HOSPITAL - RECREATION / VISITING ROOM - DAY\n\nPSYCH. PATIENTS fill a cavernous day-room engaged in arts and\n\ncrafts. Some of the sadder patients stare off into space as Jean\ncrosses the room. He carries a plate of cookies and a full glass\nof milk.\n\nHe approaches a sad, nice-looking, middle-aged black woman - the\nsame one from the dream, earlier. She sits alone fondling a\npillow in her lap. It's his mother, MATILDE. She doesn't see him\ncoming.\n\nAs he sets the plate in front of her, she notices him. She\nrecognizes him and seems pleased, even in her isolation. He\nkisses her on the cheek.\n\n                       BASQUIAT\n           Hey, mom.\n\nShe smiles slightly.\n\nJean takes a cookie. She does likewise.\n\nThey eat in silence, looking at each other, communicating what\nthey can.\n\nTime passes. In between cookies her fingers find and break the\nstems of the pillow feathers.\n\n                      BASQUIAT (CONT'D)\n           I met the girl I'm gonna marry.\n\nHis mother brightens. She drinks the milk. They finish the\ncookies.\n\n                      MATILDE\n           Do you like it here?\n\n                      BASQUIAT\n           I'd like it better in Hawaii.\n\n\nINT. CARDBOARD BOX - NIGHT\n\nJean tries to sleep in the box. RAIN falls heavily onto it.\n\nDrops of water hit his face.\n\nHe wills it to stop. It doesn't.\n\nFinally, he can't stand it. Rain forces his blinking eyes open.\n\n\nINT. BENNY'S APARTMENT -     NIGHT\n\nA door opens to reveal Jean's wet face.\n\nBenny lets him in.\n\nJean enters a rundown railroad flat crammed with musical\ninstruments, beer cans, and homemade art. There's a couch with a\nsheet over it.\n\nJunk is piled in a corner - mostly art books and drawings.\n\nBenny sits down at an electric piano, which he's evidently\nplaying. He sings along, softly, working out the words,\nconcentrating, absorbed.\n\nJean sets his belongings on the couch, walks to a mic stand and\nstarts making up his own words.\n\n                      BASQUIAT\n           \"She loves me.\n           Oh yeah she loves me!\n           She loooooooves me,\n           Oh yeah she loves me!\"\n           Bring me some chicken, baby!\n\n                      BENNY\n           Would you shut the fuck up? You hear what\n           I'm doing?\n\n                       BASQUIAT\n           Yeah man. I'm jealous. You're always great,\n           Benny.\n                  (goes back into 'act')\n           \"Her name is G-I-N-A Gina\n           And she lo-oooves me.\"\n           I did say chicken!\n\nBenny turns off the piano and lights a roach, angry at Jean's\nself-centeredness.\n\nJean digs through a pile of garbage. Finally, he finds what he's\nlooking for - a pile of \"SAMO baseball cards\" - color Xeroxes of\nhis favorite images and words. He pockets them.\n\n                       BASQUIAT (CONT'D)\n           I knew I left these somewhere. One of\n           these'll send your kids to college someday.\n                  (hands it to Benny solemnly)\n           Here - I made this for you.\n\n                       BENNY\n           Thanks.\n                  (beat)\n           Your dad called again - something about a\n           job.\n\nHe hands Jean a slip of paper. He notices the number on Jean's\npants.\n\n                      BENNY (CONT'D)\n           You got a date already?\n\n                       BASQUIAT\n                  (exhaling)\n           We're getting married. She said she could\n           tell I was a great artist - she could see\n           it in my eyes. She said she wanted to be by\n           my side and have inter-racial babies with\n           me.\n\nBenny grins. He grabs a basketball and spins it expertly on his\n\nindex finger.\n\n                      BENNY\n           G'night... See you in court tomorrow.\n\nJean turns on the TV. He notices the roach. He picks up the paper\nBenny gave him with the message from his father and sets it on\nfire.\n\nHe lights the roach with it.\n\nHe looks up; on television, we see a BUM being interviewed. Jean\nturns up the volume.\n\nThe bum's on the ground, looking beat up. Jean picks up a pocket\nrecorder and turns it on:\n\n                      BUM\n           The guy just hit me and I was on the\n           ground!!!! Boom, for real.\n\nJean mutes the sound on the TV. He rewinds and proudly plays back\nthe words \"Boom, for real.\"\n\nHe picks up the phone and dials. He turns on the speakerphone.\n\nJean holds the recorder to the speaker as someone answers the\nphone. (Jean walks in and out of frame throughout the following.)\n\n                      VOICE\n           Hello?\n\n                       BASQUIAT\n                  (deadpan)\n           I-Is this the s-s-suicide h-h-hotline?\n\n                      VOICE\n           Yes. My name is Chris. What's yours?\n\n                      BASQUIAT\n           Jean Michel.\n\n                      CHRIS\n           That's a beautiful name. French?\n\n                      BASQUIAT\n           Haitian. I'm going to kill myself. I'm\n           taking pills. Reds, blues, greens.\n\nJean opens his notepad and looks down a long list of seemingly\nrandom words. He comes to the words (in order) \"liquid, hijack,\"\nand \"Marlboros.\"\n\n                      CHRIS\n           What? Wait a minute... talk to me.\n\n                       BASQUIAT\n                  (about to sob)\n           Life doesn't... make... sense. This city's\n           k-killing me. I want my liquid hijack\n           Marlboros!\n\n                       CHRIS\n           What? Life's beautiful. Depression isn't\n           permanent. Don't you believe that?\n                  (pause)\n           What is it - did your girlfriend leave you?\n\n                      BASQUIAT\n           No! I have a boyfriend. He loves me.\n\nJean spies an electric pencil sharpener and plugs it in.\n\n                      CHRIS\n           You see? You have someone to live for.\n\n                      BASQUIAT\n           No, I don't. I'm alone. We all are.\n           Especially here. The world's unjust. The\n           respect fools get. The disrespect I get.\n\n                      CHRIS\n           What is it you want?    Respect? I have\n           respect for you, just    for making this call.\n           One philosopher said    \"Sadness is a sin\n           against the richness    of the world.\" Think\n           about it. Feel it.\n\n                      BASQUIAT\n           You don't even know me. I want real\n           respect.\n\nHe jams a pencil into the electric sharpener and holds the\nreceiver right next to it, giving the guy an earful:\nRRRRKKKKKKK!!!\n\n\nANGLE ON\n\nCLOSE UP - A speaker. It fills the screen.\n\nWe continue to hear:\n\n                       CHRIS (O.S.)\n                  (beat)\n           What? What do you want?\n\n                       BASQUIAT\n                  (breaking loose)\n           Fame. My liquid hijack Marlboros and the\n           moon and the cow that jumped over it.\n\nCAMERA PULLS BACK FROM SPEAKER TO REVEAL:\n\n\nINT. MUDD CLUB - HALLOWEEN NIGHT\n\nJean and Benny are on stage with two other GUYS, members of the\nband Gray. Everyone but Jean is dressed in some sort of Halloween\ncostume.\n\nWe HEAR the words \"Boom, for real\" blasting from the P.A. system.\n\nWhat follows is a continuation, a collage of words from Jean's\n\"suicide hotline\" call -\n\n                      P.A.\n           One philosopher said \"Give me my liquid\n           hijack Marlboros. Life's beautiful. You\n           have someone to live for. What do you want?\n           RKKKK! That's a beautiful name... French?\n\nJean sits in a chair onstage with his band members. Benny plays\nthe organ. The other band members play percussion and guitar.\n\nIt works. The crowd loves it.\n\nThe song ends abruptly.\n\nWe begin to hear James Brown's \"Sex Machine.\"\n\nJean looks out into the crowd and notices Gina. She's looking\nright back at him from the bar. Pleased to see her face, he says\nto himself -\n\n                      BASQUIAT\n           Boom, for real.\n\nWe see him walk offstage into the crowd. They meet.\n\n                      BASQUIAT (CONT'D)\n           I thought you hated this place?\n\n                         GINA\n           I do.\n                  (beat)\n           I just said that. I was never here before.\n           I actually like it.\n\nMUSIC segues into PIL's \"Public Image\".\n\n                      BASQUIAT\n           Let's get out of here.\n\nHe leads her towards the exit. They step out of the club.\n\n\nEXT. MUDD CLUB - NIGHT\n\nHIGH, WIDE ANGLE\n\nIt's raining heavily. Jean motions for Gina to wait under the\nentrance. He tries to hail a cab... And another. And another.\n\nA parade of them passes, but each time they slow down, they get a\nglimpse of Jean and drive off.\n\nFinally, Gina steps out of the entrance. She raises her hand, and\na car pulls over instantly.\n\n\nINT. CAB - NIGHT\n\nThey scurry into the backseat.\n\nThe cab pulls off.\n\n\nEXT. CHINESE RESTAURANT - NIGHT\n\nThrough a steamy, rain-wet window, we see Jean and Gina seated at\na table, dining.\n\nThey seem to be having a nice time.\n\n\nINT. GINA'S APARTMENT - NEXT MORNING\n\nGina lays in bed. Daylight streams into the apartment.\nJackhammers RATTLE outside. (Music: REGGAE SONG - Errol\nScorcher's \"Cockroach in de Corner.\")\n\n\nEXTREME CLOSEUP\n\nA cockroach crawls from Gina's bedroom across the floor and into\nthe kitchen where Jean sits naked on the floor, working on a\ndrawing. It crawls over his drawing towards a cardboard box.\n\nJean rummages through a cabinet. He finds a can of bugspray. Jean\ntears off a side of the box. With cardboard in one hand and\nbugspray in the other, he forgets the cockroach.\n\nHe's mesmerized by the list of ingredients on the aerosol can.\n\nSomeone POUNDS furiously at the door.\n\nIgnoring the pounding, he starts listing the ingredients on the\npiece of cardboard, finishing his new drawing by including a\nsymbol of a cockroach to the left of the list.\n\n                      LANDLADY\n           Miss Cardinale... Open up for me, please!\n\nHe gets up and peeks through the security hole. He sees a middle-\naged Hispanic woman reaching to unlock the door. He opens it.\n\n                      LANDLADY (CONT'D)\n           Ohhh, Dios mio!\n\nShe stares at him levelly.\n\n                      LANDLADY (CONT'D)\n           I just want the rent.\n\n                      BASQUIAT\n           Why didn't you say so? Damn! She's asleep!\n\nJean draws on a piece of paper on the counter next to him. He\nhands it to the landlady. It's a a little shack with a big head\nnext to it that says \"'Here' For Rent.\"\n\nThe landlady looks at him like he's crazy. She balls up the\ndrawing and puts it in her pocket.\n\nGina arrives in the doorway, wearing a robe. The landlady's\ntrapped between them.\n\n                       GINA\n                  (to Jean)\n           What're you doing?\n\nThe landlady wags her finger at Gina.\n\n                      LANDLADY\n           Next Monday.\n\nGina and Jean look amused as they watch her leave.\n\n                      BASQUIAT\n           Wanna go get some breakfast?\n\n                      GINA\n           A friend of mine offered me a job doing a\n           little work installing a show in a gallery.\n           He's an electrician. I was supposed to be\n           there an hour ago.\n\nShe looks at the bugspray drawing on the floor.\n\n                      GINA (CONT'D)\n           Ohh, that's nice.\n\nJean kisses her neck as she looks at the drawing.\n\nWe HOLD on the drawing.\n\n\nINT. MARY BOONE GALLERY - DAY\n\nWhite dust sprinkles down onto Jean's face from the ceiling.\nUnable to use his hands, he tries to blow the dust out of his\neyes...\n\nHis boss, GREG, a mild-mannered hippie electrician, works above\nhim on the ladder. Jean steadies the ladder. Greg's head is out\nof frame.\n\nThe gallery is an impressive space under preparations for an\nopening.\n\n                      GREG\n           Jean, could you get me a Phillips\n           screwdriver?\n\n                      BASQUIAT\n           A what?\n\n                      GREG\n           A Phillips head. From the toolbox.\n\n                      BASQUIAT\n           Yeah.\n\nJean searches through the toolbox. He picks up a screwdriver and\nreads the handle: \"CRAFTSMAN\"\n\n                         BASQUIAT (CONT'D)\n              'Phillips head,' right?\n\n                         GREG\n              Yeah.\n\nJean shakes his head and puts it back. He tries a couple more -\nthey each say \"CRAFTSMAN.\" He puts them back.\n\nFinally, he finds one with a different handle. It says \"G.S.C.\n2000.\"\n\n                         BASQUIAT\n              You don't have any!!!\n\n                         GREG\n              That's impossible. I've got, like, five of\n              'em!\n\nHe comes down off the ladder.\n\n                          GREG (CONT'D)\n              You're holding one in your hand!!!\n                     (beat)\n              You've never done this kind of work before,\n              have you?\n                     (demonstrating)\n              See, this is a regular screwdriver, and\n              this is a Phillips head. The cross thing...\n              I'll tell you later what all the tools are\n              so you'll know.\n\nA GROUP of people arrives.\n\nAlbert Milo    comes into view, tailed closely by Rene Ricard and\nMARY BOONE    - well dressed, petite, intense, 30. Milo, (also about\n30), wears    casual clothes splattered with paint. Mary Boone is\nengaged in    conversation with Milo. Rene chatters away.\n\nGreg climbs back up the ladder. He holds a piece of wire down to\nJean. Jean stares at the group while trying to be invisible.\n\n                         RENE\n              I need to make a call, Mary. You don't\n              mind, do you?\n\n                         MARY BOONE\n              Certainly not. You can use my line.\n\nRene picks up the phone.\n\n                          RENE\n              To Paris. Bernard Picasso -\n                     (to Mary)\n              You know Bernard -\n\n                          MARY BOONE\n                     (wincing)\n              Be my guest.\n\nJean watches the group talking.\n\n                       GREG\n           Jean? Hold this, please.\n                  (beat - he sees why Jean's so\n                  distracted)\n           You'll get there. But it's good to have\n           something to fall back on. That's why I\n           became an electrician. It pays the rent.\n           Y'know, I'm an artist, too.\n\n                      BASQUIAT\n           I didn't know.\n\n                      GREG\n           I sculpt. I'm really just starting to find\n           myself. How old are you? Twenty? You're\n           just like I used to be. I'm forty-one. And\n           I'm glad I haven't gotten any recognition.\n           It gave me time to develop.\n\nJean watches Mary and Milo talking.\n\n                       MARY BOONE\n                  (to Milo)\n           I can't tell you how happy I am with this\n           show.\n\nMary yells across the room to Jean.\n\n                       MARY BOONE (CONT'D)\n                  (her tone impersonal)\n           Excuse me - you - what's your name? Would\n           you move those tools there and put them\n           somewhere else?\n\nHe looks at her.\n\nMilo watches to see what he's going to do.\n\n                       BASQUIAT\n                  (to Milo)\n           My name is Jean Michel Basquiat. Have you\n           heard of me?\n\n                       ALBERT MILO\n                  (amused)\n           No. Should I have?\n\n                      BASQUIAT\n           I'm a painter, too.\n\n                      ALBERT MILO\n           Really. Huh. Too bad.\n\n                      MARY BOONE\n           Excuse me, would you please move those\n           tools?\n\nJean looks at Milo. Milo looks back at him.\n\nJean walks past the tools and continues toward the door. He walks\nout without turning around.\n\nMilo smiles to himself.\n\n\nEXT. BOONE GALLERY - ALBERT MILO OPENING - DUSK\n\nThe ART WORLD CROWD fills the gallery. Jean lurks across the\nstreet, watching through the window.\n\nCabs and limousines line the block. A crowd outside blocks the\nstreet.\n\nJean's obviously impressed, jealous and estranged -     he feels\nentitled to all this.\n\nHe crosses the street to get a closer look.\n\n\nTHROUGH THE WINDOW\n\nHe sees Albert Milo    talking with ANDY WARHOL and BRUNO\nBISCHOFBERGER. Andy,    of course, is thin, silver-haired, and\nnearly albino. Bruno    is a Swiss art dealer in his 40's. He exudes\nmoney - a pillar of    security.\n\nOn the other side of the room, Rene Ricard is surrounded by a\ncoterie of young, mostly BLACK AND HISPANIC MALES. Rene looks\ndrunk, enjoying the moment, holding court.\n\nRene crosses to Albert and Andy.\n\nPeople pass by.\n\nJean starts to walk.\n\nAbout half a block away, he sprays on a wall:\n\n\"THE WHOLE LIVERY LINE BOW LIKE THIS WITH THE BIG MONEY ALL\nCRUSHED INTO THESE FEET\"\n\nHe looks pleased. He turns and looks up West Broadway beyond the\nbuildings at the sky:\n\n\nSUPERIMPOSED IN THE SKY\n\nWe see a surfer emerging from a HUGE WAVE. He looks powerful and\nexalted.\n\n                                                     CUT TO:\n\n\nEXT. BASKETBALL COURT - DAY\n\nANGLE ON: A wall. We see the following graffity:\n\n\"JIMMY BEST ON HIS BACK TO THE SUCKERPUNCH OF HIS CHILDHOOD\nYEARS\"\n\nA basketball bounces against a wall.\n\nJean and Benny amble onto a basketball court. Jean's changed his\nhairstyle. Now the dreadlocks stand straight up from his head.\n\nBenny dribbles with skill while Jean puffs furiously on a\ncigarette. He doesn't look like he's slept, but he's happy.\n\nBenny throws the ball to Jean. It bounces off a puddle and\nsplashes Jean.\n\n                      BENNY\n           Come on, Jean. Get rid of your cigarette.\n           Concentrate.\n\n                       BASQUIAT\n           I am... On Gina.\n                  (beat)\n           Fuck - I didn't think we were actually\n           gonna do this.\n\n                      BENNY\n           Concentrate on the ball. Shoot.\n\nJean shoots. It flies up, up, up -     and over the backboard.\n\nHe runs after the ball, gets it, and dribbles clumsily.\n\n                      BENNY\n           You're shattering all my myths.\n\n                         BASQUIAT\n           About what?\n\n                      BENNY\n           Your people.\n\n                      BASQUIAT\n           Oh - you mean black people!\n\nHe shoots and misses again. He throws it to Benny, who does a\npicture-perfect lay-up.\n\n                       BASQUIAT (CONT'D)\n                  (changing the subject)\n           How long do you think it takes to get\n           really famous?\n\nDuring the following, Benny performs a series of amazing shots\nwhile Jean looks on admiringly.\n\n                      BENNY\n           For a musician or a painter?\n\nJean shrugs.\n\n                      BASQUIAT\n           Whatever. Famous. To where you can do your\n           stuff all day without thinking about\n           anything else.\n\n                      BENNY\n           Ummm... Four years. Six to get rich.\n\nHe shoots. Swish.\n\n                      BENNY (CONT'D)\n           First, you have to dress right.\n\nHe shoots again. Swish.\n\n                      BENNY (CONT'D)\n           Then, you have to hang out all the time -\n           with famous people - the right people, the\n           right chicks, the right parties.\n\nHe shoots again. Swish.\n\n                      BENNY (CONT'D)\n           And you gotta do your work all the time\n           when you're not doing that. The same kinda\n           work, the same style - over and over\n           again, so people recognize it and don't get\n           confused. Then, once you're famous, you\n           have to keep doing it the same way, even\n           after it's boring - unless you want people\n           to really get mad at you - which they will\n           anyway.\n\nBenny tosses Jean the ball. Jean walks off the court.\n\n                      BASQUIAT\n           Come on. I hate this. I'm no good at it.\n\nJean shoots the ball and keeps walking. The ball goes in. He\ndoesn't notice. Benny runs after it.\n\n\nEXT. HOUSTON ST. - DUSK\n\nBenny and Jean walk along. Benny dribbles.\n\n                      BENNY\n           Famous people are usually pretty stupid.\n           You're too smart. You'd get bored to death.\n           You don't wanna be like John Henry -\n           fighting the machine. Just do what you do.\n           It's about integrity. Follow your heart.\n\n                      BASQUIAT\n           Who's John Henry?\n\n                      BENNY\n           Oh man! Folklore guy - worked on the\n           railroad. Y'know, pounding in spikes and\n           laying down track. Then one day they\n           invented a machine to do it. And he says\n           \"Fuck that, I'm a MAN\" and he challenges\n           the machine to a race to lay down a mile of\n           track. It takes two days. Neck and neck the\n           whole time. They get right to the end, and\n           he beats it by one spike.\n\n                  (pause)\n           Got a cigarette?\n\n                      BASQUIAT\n           So then what?\n\n                      BENNY\n           He drops dead! See? Just do your shit like\n           you do it! Your friends like you, you get\n           laid, everyone walks by, sees your stuff\n           everywhere. It's good. What else do you\n           want?\n\nThey watch a long stretch limo cruises up across the street.\n\n                       BASQUIAT\n           Like I said - my liquid hijack Marlboros.\n                  (indicates limo)\n           Check it out.\n\nThe LIMO DRIVER opens the back door. Andy Warhol and Bruno\nBischofberger step out.\n\n                      BASQUIAT (CONT'D)\n           Andy Warhol. He's famous and he's not\n           boring.\n\n\nINSERT: AN IMAGE OF ANDY'S PAINTINGS AT THE WHITNEY MUSEUM\n(FOOTAGE FROM JONAS MEKAS FILM)\n\nJean scrounges in his pockets, pulls out his Xerox cards, and\nreadies himself as Bruno and Andy enter BALLATO'S RESTAURANT.\n\n                      BENNY\n           What're you doing? You're doing something.\n\n                      BASQUIAT\n           He's the best painter in the world. I'm\n           gonna give him one of these.\n\n                      BENNY\n           Don't give him anything, man. Your art's\n           worth a lot. Trade. That's what real\n           artists do with each other. Besides, he'll\n           just use you. He's famous for that.\n\nBenny watches Jean crosses the street. Jean passes the limousine.\nInside, the driver (a 24-year old Rasta) takes a hit from a joint\nand watches Jean.\n\n\nCLOSE ON\n\nThe driver's eyes.\n\n                                                   CUT TO:\n\n\nDRIVER'S POV:\n\nHe watches Jean cross the street.\n\nJean enters the restaurant.\n\n\nINT. BALLATO'S - DAY\n\nJean enters. Andy and Bruno spot him. The Maitre'd becomes\nalarmed. but it's too late - he's at their table.\n\nHe spreads his cards on the table. The topmost card reads\n\"REDEEMABLE BECAUSE OF HIS YOUTH.\"\n\nAndy stares dead ahead, Sphinxlike.\n\nBruno watches the non-interaction between the two.\n\n                       MAITRE'D\n                  (to Jean, flustered)\n           Can I help you?.\n\nHe taps Jean's shoulder.\n\n                       MAITRE'D (CONT'D)\n                  (to Jean)\n           Sir...?\n\n                       BRUNO\n                  (sympathetically)\n            I think it's ok.\n\n                      MAITRE'D\n           Of course, Mr. Bischofberger.\n\nBruno picks up one of the cards.\n\n                      BASQUIAT\n           You wanna buy some ignorant art? Ten bucks.\n\n                      ANDY WARHOL\n           Ignorant art?\n\n                      BASQUIAT\n           Yeah... Like - stupid, ridiculous, crummy\n           art.\n\n                      ANDY WARHOL\n           Ohhh. That's new. That sounds good.\n\n                      BASQUIAT\n           Ten bucks apiece.\n\n                      ANDY WARHOL\n           I can give you five. You didn't do very\n           much to these.\n\n                      BASQUIAT\n           You don't even work on your stuff!\n\n                      BRUNO\n           It doesn't matter how much you worked on\n\n           them. It matters how much you can get for\n           them.\n\n                      BASQUIAT\n           I can get ten.\n\n                       ANDY WARHOL\n           I'll take two. This one and... that one.\n                  (to Bruno)\n           Can I borrow some money, Bruno?\n\nBruno pulls out a hundred dollar bill.\n\n                      BRUNO\n           Here. Do you have change?\n\nAs WAITER arrives with the tray, Jean pockets the bill.\n\n                       BASQUIAT\n           You made a good deal. Here, you can have\n           these, too.\n\nHe leaves all the cards and walks toward the door.\n\n\nBRUNO'S POV:\n\nJean leaving past stupified Maitre'd.\n\n\nEXT. GINA'S APARTMENT - DAY\n\nJean and Benny are outside the entrance to Gina's building. Jean\ncarries two huge bags overflowing with groceries and flowers. He\nbuzzes. There's no answer.\n\n                      BASQUIAT\n           I'll be right back.\n\nHe produces a key and lets himself in.\n\nHe enters the building.\n\n\nINT. GINA'S APARTMENT - DAY\n\nJean sets the groceries on the counter and leaves.\n\nWe notice the Bugspray painting on the wall, along with more of\nJean's work and supplies.\n\n\nEXT. GINA'S APARTMENT - DUSK\n\nJean rejoins Benny in front of Gina's building.\n\nAs they're leaving, Gina comes up the street.\n\n                       BASQUIAT\n                  (to Benny)\n           Check you later, man.\n\n                      BENNY\n           Hi Gina.\n\n                      GINA\n           Hi.\n\n\nINT - GINA'S APARTMENT - DAY\n\nFlowers and groceries are strewn on the counter.\n\n                                                     FADE TO BLACK\n\n                                                     FADE IN:\n\n\nOver the following MONTAGE we HEAR:\n\n                      RENE (O.S.)\n           ... 'APT 20'... The church bells would ring\n           at noon and six a.m.. 24 strokes:\n           How many times we counted them.\n           We called our bed the cloud.\n           And there we'd float.\n           The bathtub was in the kitchen\n           and took forever to fill up.\n           We'd bathe together afterwards.\n           Oh the countless cigarettes and\n           take out Chinese food...\n           The bed was so narrow\n           Three years we made it fit.\n           The sheets were green the\n           sheets were pink the sheets\n           white linen from the past.\n           Little home, farewell,\n           The broken windows\n           and the bodega on the corner.\n           Now from my balcony\n           I look out over all New York...\n\n\nINT. GINA'S APARTMENT - NIGHT\n\nJean and Gina are sleeping.\n\nSERIES OF DISSOLVES: As they're turning together in their sleep.\n\n                                                     FADE TO BLACK\n\n                                                     FADE UP:\n\n\nINT. KITCHEN / LIVINGROOM (GINA'S APARTMENT) - DAY\n\nFilled with Jean's paintings.\n\nSERIES OF DISSOLVES: Paintings and objects fill the room.\n\n                                                     FADE TO BLACK\n\nSUPER: \"A YEAR AND A HALF LATER EAST 9TH ST.\"\n\n                                                     FADE UP:\n\n\nINT. GINA'S APARTMENT - DAY\n\nJean watches \"The Little Rascals\" on TV in the living room. The\nsound is turned off and a record player PLAYS Gypsy music loudly.\n\nRolled up in a large drop cloth, Gina is asleep on the floor.\nNext to her, Jean works on all fours, drawing figures, crowns,\nand houses.\n\nWorking feverishly, he writes \"HEY, HEY, HEY\" in big clusters,\nthen writes other words: SHARK, IMMORTALITY, JOHN THE REVELATOR,\nFAME, INK, TEETH, HAWAII SUPERMARKET, POLE STAR, BABOON and TAR.\n\nHe has an acoustics manual and Bible open    on the floor. He copies\nthe technical blueprints from the manual.    He reads the Bible,\nfollowing the text with a dirty finger. It    seems that he watches\nTV, draws, listens to the music and reads    at the same time.\n\nHe mixes Liquitex paints and puts some colors on the drawings. He\ndraws a long blue line and carries it over onto the floor. Up the\nwall. Through the fridge. Across the window.\n\nHe takes off his paint-covered clothes and changes into Gina's\nblack slip. He rummages around the room, gathering pieces of his\nand Gina's clothes.\n\nHe spreads the clothes on the floor, and selecting wide brushes\nwith long bristles, picks up the cans of Liquitex paint.\n\nWhen paint spills on the clothes, he spreads it into shapes.\n\nGina wakes up. She reaches for one of the painted shirts.\n\n                       GINA\n                  (in disbelief)\n           Basquiat, those are my best clothes!!! What\n           are you doing?\n\n                      BASQUIAT\n           C'mon, baby, I painted them for you.\n           They're beautiful now.\n\n                       GINA\n           I'm going to my parents this weekend. What\n           am I going to wear?\n                  (she begins to cry)\n           How could you do that to me?\n\nJean wipes his hands off on his thighs and puts his arms around\nGina, holding her.\n\n                      BASQUIAT\n           ... I'll buy you some new ones.\n\n                      GINA\n\n           You don't have any fucking money..\n\nJean lets her cry for a moment, then notices the music playing on\nthe stereo - a Gypsy song sung in Spanish.\n\n                      BASQUIAT\n           Do you know what he's saying?\n\n                      GINA\n           What who's saying?\n\n                       BASQUIAT\n           Manzanita....\n                  (translating song)\n           ... if one day I die, and    you read this\n           piece of paper, I want you    to know how much\n           I love you. Although I'll    never see you\n           again, Gypsy, Gypsy, your    hair, your hair,\n           your face, your face'\n\nGina looks up at him.\n\n                       BASQUIAT (CONT'D)\n           'Even though you were never mine\n           And you never will be\n           You have a piece of my heart\n           You have, you have, you have...'\n                  (he reaches down, wiping off\n                  Gina's face)\n           'Gypsy, Gypsy, your hair, your hair, your\n           face, your face.'\n\nNo longer crying, Gina leans her head against Jean.\n\nWe HEAR a CALL from the window:\n\n                      BENNY (O.S.)\n           Willie Mays!!! Willie Mays!!!\n\n                       BASQUIAT\n                  (at the window)\n           Come on in!\n\n                                                    CUT TO:\n\n\nBenny and two GUYS come barreling into the apartment. Immediate\nchaos. Benny holds up a packet of drugs and jiggles it\ntemptingly. They make themselves at home. Jean sits with them and\nstarts to chop up the drugs.\n\nGina gives Jean a look. She stands, still wrapped in the drop\ncloth. She lets it fall to the floor. She's wearing only her\nunderwear. She walks to the bedroom. Benny watches her.\n\n                      BASQUIAT\n           Gina, don't you want any of this? You could\n           use some.\n\nGina doesn't respond. She comes out of the bedroom with a small\nsuitcase.\n\n                         GINA\n              See you later.\n\nShe leaves.\n\nSilence.\n\n                         GUY #1\n              Nice underwear...\n\nThey start to laugh.\n\n\nINT. GINA'S APARTMENT - LATER\n\nKneeling on the floor,    Jean    covers the surface    of the\nrefrigerator door with    fast,    rushing strokes.    He mixes paint in a\nlarge soupbowl and dips    his    hair in the bowl.    Pressing his head\nto the door, he paints    with    his hair. He stops    to examine the\nmarks.\n\nHe HITS his head against the door harder and harder.\n\n                                                           FADE TO WHITE\n\n\nINT. GINA'S APARTMENT - MORNING\n\nCAMERA PULLS BACK: Revealing Jean's eyes. They're open and\nmotionless. His head is tilted toward his chest.\n\nOFF SCREEN WE HEAR the sounds of Gina coming home:\n\nThe LOCK turns. The door OPENS.\n\nGina comes in and drops a bag on the floor.\n\n                          GINA\n              Basquiat?\n\nSilence. She picks up the mail from under the door and walks into\nthe room. There's a lump on the floor. It's Jean.\n\n                         GINA (CONT'D)\n              Wake up! I'm back!\n\nShe shakes his arm. No result. She lifts his head, revealing his\npainted hair.\n\nShe shakes him harder. His body is totally limp.\n\nThe whites of his eyes are red; his pupils slowly float up,\nvanishing.\n\n                         GINA\n              Jean, what did you do to yourself?\n\nShe listens to his breath, then to his heart.\n\n                          GINA\n\n                  (panicking)\n           Jesus Christ!\n\nShe finds heroin sprinkled into some pot on the floor near him.\n\n                       GINA\n                  (slapping his face)\n           Don't do this to me.\n\nShe shakes him until his eyes unglue. His pupils float into their\nproper place.\n\n                      BASQUIAT\n           ... What's the matter?\n\n                       GINA\n                  (furious)\n           Oh, God, Basquiat, you scared the shit out\n           of me. How the fuck could you do that to\n           yourself?\n\n                      BASQUIAT\n           You're back.\n\n                      GINA\n           It's Monday morning.\n\n                      BASQUIAT\n           It's not Sunday? I missed you. You\n           shouldn't leave me alone.\n\n                      GINA\n           You're blaming me? I had to go see my\n           family.\n\n                      BASQUIAT\n           I'm your family.\n\n                      GINA\n           Basquiat, what did you take?\n\nJean tries to pick himself up from the floor. He gets up stiffly,\nlike Pinnocchio. The long sleep made his limbs wooden.\n\n                      BASQUIAT\n           Nothing special - just some weed.\n\nHe finds an old joint and lights it up.\n\n                       GINA\n           Basquiat, don't lie.\n                  (holds up powder)\n           This is smack.\n\n                      BASQUIAT\n           You want some?\n\nHe offers her the joint.\n\n\nEXT. ST. MARK'S PLACE - NIGHT\n\nJean and Benny walk along, sharing a beer in a brown paper bag.\n\nThey approach a DRUG DEALER and exchange money for dope.\n\nJean finds a discarded window frame in a pile of trash and\ncarries it with him.\n\nThey sit down on a stoop. Jean rolls up a dollar bill, empties\nthe dope onto the window, and splits it into two lines. He hands\nthe rolled up bill to Benny, who snorts the line.\n\nBenny shakes his head involuntarily, making a violent face, as\nthough the dope burned a hole in his sinus.\n\n                        BENNY\n             We got beat.\n\n                         BASQUIAT\n             For real?\n\nJean takes a taste with his finger... He tastes his tongue and\nmakes a face..\n\nHe snorts part of his line, anyway, to make sure.\n\nHe frowns.\n\nThey continue onwards. Jean still carries the window.\n\n                        BENNY\n             You gonna carry that around all night?\n\n                        BASQUIAT\n             Yeah... I'll paint on it.\n\n\nINT. PARTY - NIGHT\n\nThe party's winding down - hip-hop kids, Lower East Side types.\nJean and Benny pass through the room, ignoring the two or three\nclusters of people - maybe fifteen in all...\n\nJean encounters a familiar face: an enormous red-haired dealer -\nROCKETS (35). They greet each other as friends.\n\nRockets leads Jean aside. They stand near a wall where a painting\nhangs (\"Flats Fixed\"). It bears Jean's three-point crown.\n\n                        ROCKETS\n             You did that, didn't you?\n\nJean shrugs.\n\n                         BASQUIAT\n             I gave it to Maripol. She let me stay here\n             for awhile.\n\nJean hands him twenty dollars. Rockets hands him two dime bags.\nAs if thinking better, he hands the bill back to Jean.\n\n                       ROCKETS\n            Do one for me and it's free. How's that?\n\nJean re-pockets his money. He gestures to Rockets as if to say\n\"fine - it's a deal.\"\n\nHe and Benny sit down across the room and split a bag onto the\nwindow, as before. This time, it's good. They lean back into it,\nslumping down into the couch.\n\nNearby, Rene sits on a couch with THREE STREET KIDS - artists\n(who we've seen at Milo's opening). They sit on their knees\nlooking out a window passing binoculars back and forth.\n\nARTIST #1 looks through the window with a pair of BINOCULARS. He\npoints down towards the street, trying to get Rene's attention.\n\n                       ARTIST #1\n            Check this out, Rene.\n\nRene lunges towards the window. The stereo BLARES (Curtis Blow's\n\"Survival\")\n\n                        RENE\n                   (singing along)\n            \"The name of the game is survival, You\n            learn it in jail upon your arrival!\"\n\nAnother ARTIST (#2) a young black man, runs up and tries to turn\ndown the volume.\n\nRene grabs his crotch.\n\n                       ARTIST #2\n            Chill, man! Be cool! This isn't even my\n            apartment!\n\n                       RENE\n            Oh man, you a FINE nigga! You know that?\n\n                       ARTIST #2\n            Cut it out, man! And don't be callin' me\n            that shit!\n\n\nANGLE ON:\n\nBenny is now alone on the couch. He nods out.\n\n                        RENE\n                   (noticing him)\n            Oh my, there goes the neighborhood. Who's\n            house is this, anyway?\n\nArtist #2 is still mad at Rene.\n\n                        RENE (CONT'D)\n                   (to Artist #2)\n            That's what I like about you straight boys.\n            You're so sensitive!!!\n                   (resumes singing)\n\n           \"The name of the game is survival,\n           Survival! Survival! only the strong\n           survive\"\n\n                      ARTIST #1\n           Rene! Come here, man!\n\n                      RENE\n           I gotta go pee.\n\nRene weaves across the room. Suddenly, he stops cold. He's\nstaring at Jean's painting. He doesn't move.\n\n                       RENE (CONT'D)\n                  (to himself)\n           Who did this?\n                  (beat - louder)\n           Who did this?\n\n                      ARTIST #2\n           I don't know. I told you, this isn't my\n           apartment.\n\n                      ARTIST #3\n           I know who did that. That's Jean Michel's.\n           He's right here, man...\n\nHe turns to look for Jean.\n\n                      ARTIST #3\n           Fuck, man, where'd he go? Where's Jean?\n\nBenny looks around ineffectually and shrugs.\n\n                       RENE\n                  (to himself)\n           It's fucking amazing. Motherfucker's got to\n           put a crown on it.\n\n                       ARTIST #1\n                  (yelling from the window)\n           Rene, man, check this out. Whoa... He's\n           kinda cute.\n\nRene looks to him and back at the painting. He takes one last\nlook.\n\nHe stumbles towards the window and grabs the binoculars from\nArtist #1..\n\nWe look through the binoculars' POV at a GUY coming down the\nstreet. He's wearing all black, cowboy boots, and sunglasses.\n\n                      RENE\n           Naaaa. Poor thing has a little dick.\n\n                      ARTIST #2\n           How do you know?\n\n                      RENE\n           Just look at him.\n\n                  (Rene hands the binoculars to\n                  him)\n           Little silver thingies on his cowboy boots?\n           Honey, I don't think so.\n\nHe looks around the room again as if looking for Jean.\n\n                      ARTIST #3\n           Whoa - check it out. It's him!\n\nRene grabs binoculars.\n\n\nBINOCULARS POV:\n\nJean pauses before one of his own graffiti pieces:\n\n\"PLUSH SAFE, HE THINK\"\n\nRene watches in awe. Jean, moving a bit slowly, `signs' his tag\nwith the copyright sign. He walks off.\n\n                      RENE\n           MOTHAFUCKAH!\n\n                      ARTIST #2\n           That's the same guy who did this painting.\n\n                      RENE\n           I know that. Don't let him get away.\n\nHe hands the binoculars to Artist #3 and runs towards the door.\n\n\nEXT. STREET - NIGHT\n\nBINOCULARS POV\n\nWe watch as Rene looks frantically for Jean, but can't spot him.\nFinally he sees Jean's hair-do bobbing up and down a block away.\nHe runs towards it.\n\n                      RENE\n           Hey, wait up!!!\n\nHuffing and puffing, he catches up.\n\n                      RENE\n           You heard of Albert Milo. I made    that\n           niggah. I'm Rene Ricard. Didn't    you read\n           \"Not About Albert Milo?\" I know    who to\n           hype. Baby, I'm gonna make you a    star.\n\n                      BASQUIAT\n           Can you put me in the ring with him?\n\n                       RENE\n           I can put you in the ring with him. Even\n           book the dates.\n                  (beat)\n           But those big boys know how to fight. They\n\n            could make you look real sissy.\n                   (they laugh)\n            I was looking at that painting upstairs.\n            It's the first time a picture made me\n            embarrassed to own anything.\n                   (beat)\n            So what's your real name? 'Samo?'\n\n                       BASQUIAT\n            Jean Michel Basquiat.\n\nThey shake hands.\n\n                       RENE\n            Sounds famous already.\n\n\nINT. PS 1 SHOW - DAY\n\nINSERT:   A huge poster reads:\n\n\"NEW YORK / NEW WAVE\n100 ARTISTS\"\n\n\nCLOSE ON: A HAMMER, POUNDING\n\nJean pounds a nail into one of his pieces, nailing it directly\nonto the wall. Everyone stares.\n\n                       RENE\n            Oh child... You got no respect. Didn't\n            anyone teach you how to mount paintings?\n\nRene smiles. Jean finishes pounding the last piece into the wall.\n\nCAMERA pulls back to reveal several of Jean's paintings - found\nobjects with paint on them.\n\n                        RENE (CONT'D)\n            This is a very important season in New\n            York. One's public appearance is absolute.\n                   (beat - a man approaches)\n            Oh!!! Louise!!! I'd like you to meet Jean\n            Michel Basquiat -\n                   (beat)\n            SAMO. This is Henry Geldzahler.\n\nA crowd begins to gather around the work.\n\n                       HENRY\n            Ohh... SAMO. I've heard a lot about you. I\n            love your graffiti.\n\n                       BASQUIAT\n            I was a kid then.\n\n                        HENRY\n                   (to Rene)\n            How much are these?\n\n                      RENE\n           You or the museum?\n\n                      HENRY\n           It's for me.\n\n                      RENE\n           Five.\n\n                      HENRY\n           I'll take it.\n\nHenry leaves.\n\n                       RENE\n           That's five thousand dollars.\n                  (hissing to Jean)\n           He's from the Metropolitan Museum of Art so\n           suck my pussy, you star.\n\n\nLATER\n\nThere seems to be a buzz about Jean already. People gather around\nhis paintings.\n\nGina arrives. She looks great.\n\n                      BASQUIAT\n           You look fucking beautiful, beautiful.\n\n                      GINA\n           Well thanks!\n\nANNINA NOSEI, a sophisticated, well-groomed woman appears at\nJean's side. She takes in his paintings.\n\nAs Jean, Rene, and Annina talk, Gina is left out.\n\n                      RENE\n           This is Jean Michel, whose work I told you\n           about.\n\n                       ANNINA NOSEI\n                  (to Jean)\n           Rene hasn't stopped talking about your\n           paintings. Haven't I seen you in my\n           gallery?\n\n                      BASQUIAT\n           No.\n\n                       ANNINA NOSEI\n                  (to Rene)\n           You haven't been by lately.\n\n                      RENE\n           I didn't have the subway fare. My Medicare\n           ran out.\n\n                      ANNINA NOSEI\n\n                  (to Jean)\n           How do you come up with all those words you\n           put over everything?\n\n                      BASQUIAT\n           I don't know.\n\nJean sees Bruno and turns his back to her.\n\nBruno looks at the paintings with a smile... He gives a cheerful\nnod to Annina.\n\n                      BRUNO\n           You're doing well.\n\nHe leaves. Annina's impressed that Jean knows Bruno.\n\n                      ANNINA NOSEI\n           I'd love to see some more of your work...\n           Where's your studio?\n\n                      BASQUIAT\n           You name it, I paint there.\n\n                      ANNINA NOSEI\n           Well, I don't want to get mugged on a\n           Bowery street corner. Maybe I could find a\n           place for you to work. Take my card.\n\n                      BASQUIAT\n           You want a drink?\n\nHe produces a pint bottle in a paper sack.\n\n                       ANNINA NOSEI\n           No thanks.\n                  (to Rene)\n           But I'd like one of these paintings.\n\nShe walks off.\n\n                         GINA\n           Who's that?\n\n                       RENE\n           You kidding? That's Annina Nosei. Jean's\n           been in her gallery a thousand times.\n                  (to Jean)\n           You slut. How do you know Bruno\n           Bischofberger?\n                  (to Gina)\n           He's only the biggest art dealer in Europe.\n\n                      BASQUIAT\n           I had lunch with him once.\n\n\nINT. GINA'S APARTMENT (BEDROOM) - NIGHT\n\nJean and Gina lay in bed.\n\n                       BASQUIAT\n            Which island of Hawaii do you want our\n            house to be on? Maui? Kaui? Molokai?\n\n                        GINA\n                   (a little upset)\n            I hadn't thought about it.\n\n                        BASQUIAT\n                   (in perfect Hawaiian)\n            Oahu, Lanai, Niihau, Kahoolawee -\n\n                       GINA\n            Staten Island would be ok.\n\nBeat. Silence.\n\nJean can't sleep. He stares at the ceiling.\n\n                       BASQUIAT\n            Do you wanna marry me?\n\nBeat.\n\nNo reply.\n\nGina's asleep.\n\n\nINT. GINA'S APARTMENT (KITCHEN) - LATER (NIGHT)\n\nQuietly, Jean kneels on the floor of the kitchen. He paints on an\nold window.\n\nHe draws figures of three people sitting at a table - obviously a\nfamily. He crosses out one person and paints a dog under the\ntable.\n\nHe crosses everything out.\n\nHe mixes the paint in a large bowl and starts again.\n\nAgain, he crosses everything out.\n\n\nINT - GINA'S APARTMENT - MORNING\n\nJean continues to work. He's wearing pajamas and a bathrobe.\n\nGina enters, waking up.\n\nShe looks at the painting.\n\n                       GINA\n            Kind of a family portrait.\n\nJean moves to add something. She stops him.\n\n                       GINA (CONT'D)\n            It looks done.\n\n                           BASQUIAT\n             Think so?\n\nHe pauses.\n\n                           BASQUIAT (CONT'D)\n             ... babies.\n\n                        GINA\n             You mean babies with you?\n\n                        BASQUIAT\n             What's wrong with me?\n\n                        GINA\n             You're your own baby.\n\nJean paints out the image.\n\nThere's a KNOCK at the door.\n\n                           GINA\n             Who is it?\n\n                        ANNINA NOSEI (O.S)\n             Annina Nosei.\n\n                           GINA\n             Who?\n\nJean jumps up and locks himself in the bathroom. Gina goes to the\ndoor, unlocks the chain, and looks out.\n\n                         GINA (CONT'D)\n                    (through the crack)\n             Hello? Oh. Come in.\n\nShe opens the door.\n\n                        ANNINA NOSEI\n             Is Jean Michel here?\n\n                           GINA\n             No.\n\nClosed in the bathroom, Jean smiles while eavesdropping.\n\n                        ANNINA NOSEI\n             I'm here to see some work.\n\nAnnina starts noticing all the work around her. Gina hands her a\nstack of drawings.\n\n                        ANNINA NOSEI (CONT'D)\n             These are great.\n\n                        GINA\n             Aren't they?\n\n                        ANNINA NOSEI\n             How much for these five?\n\n                      GINA\n           You should talk to him about this.\n\nAnnina contains her excitement.\n\n                       ANNINA NOSEI\n                  (continuing to stare at the\n                  work)\n           Um... Do Rene and Jean have a contract\n           together?\n\nWe see Jean in the bathroom looking at himself in the mirror with\na bird's nest on his head.\n\n                      ANNINA NOSEI (CONT'D)\n           I'm interested in showing Jean's work.\n\n                      GINA\n           I really think you should talk to him about\n           this.\n\nJean pops out of the bathroom.\n\n                      BASQUIAT\n           When?\n\n                      ANNINA NOSEI\n           How about right now?\n\nShe opens the door.\n\nUnnoticed, Gina starts for the bedroom.\n\n                       GINA\n                  (calling back)\n           Be ready in a minute!\n\n                                                    CUT TO:\n\n\nTHE DOOR SLAMS\n\nAs Jean exits with Annina.\n\n\nINT. TAXI - DAY\n\nJean waits in a taxi in front of Benny's apartment.\n\n                      BASQUIAT\n           Honk the horn again, will you please?\n\nThe DRIVER obliges. The back of the cab is loaded with all his\nbelongings. Boxes piled with junk. Bags of new painting supplies.\n\nBenny emerges from his building and jumps into the cab.\n\n                       BASQUIAT (CONT'D)\n                  (annoyed)\n           You're late.\n\n                  (to cabby)\n           One-fourteen Prince.\n\nThe cab pulls out. Jean lights a joint. and smokes it furiously.\nHe doesn't pass it to Benny.\n\n                      BENNY\n           What's the rush, John Henry?\n\n                      BASQUIAT\n           I ain't John Henry.\n\n                      BENNY\n           Good.\n\n                      BASQUIAT\n           What's your fuckin' problem, anyway?\n\nBenny holds out his hand for the joint.\n\n                       BENNY\n                  (inhaling)\n           I don't really have any problems.\n\n                      BASQUIAT\n           Good. What do you have?\n\n                      BENNY\n           What's your fuckin' problem? You get a\n           girlfriend and a little attention and then\n           start acting all uppity with me.\n\n                       BASQUIAT\n                  (mortified)\n           'Uppity?' Like as in 'uppity nigger?'\n\nHe snaps his finger for the joint back.\n\n                       BENNY\n           That's not how I meant it.\n                  (beat)\n           For all you know, you might just be a flash\n           in the pan! You can never tell.\n\n                      BASQUIAT\n           Hey fuck you! I deserve this shit. You're\n           just jealous 'cause it ain't happening to\n           you!\n\nThe cab stops for a red light. Benny gets out. He doesn't say a\nword. Jean doesn't look at him. The cab sails off.\n\n\nEXT. ANNINA NOSEI GALLERY - DAY\n\nIt stops in front of the gallery. From outside, we see Annina\nconversing on the phone. She looks up and opens the door for him.\n\n\nINT. STAIRWELL - BLACK.\n\nOff screen we HEAR Jean walking down the stairs.\n\n                      ANNINA NOSEI\n           I've got to find the switch.\n\n\nINT - BASEMENT, ANNINA'S - DAY\n\nAnnina flips on a light.\n\n                         ANNINA NOSEI\n           Here it is.\n\nJean looks around him. He's in a large, empty cement-floored room\nlit by fluorescent lights.\n\n\nINT. BASEMENT, ANNINA'S - (LATER) - DAY\n\nJean bends over, beginning several canvases. He pours paint on\nthem - kind of like photographs we've seen of Jackson Pollock. We\nHEAR Miles Davis' \"Flamenco Sketches.\"\n\n\nINT - BASEMENT, ANNINA'S - DAY (LATER)\n\nGRANDMASTER FLASH'S \"WHITE LINES\" fills the room.\n\nThe walls are covered with half-finished, unstretched CANVASES.\nTwo or three more lie on the floor.\n\nHe works like a maniac, buzzing back and forth from one painting\nto another, adding figures, crossing out words, all the while\nsmoking and eating cookies. The crumbs fall onto the paintings.\nHe walks on them.\n\nEvery so often, he refers to a book of DaVinci drawings. Torn\npages litter the floor beneath the book.\n\nWe hear someone THUMPING down the stairs.\n\nIt's Rene. A PUPPY follows him.\n\nHe dumps a huge load of paint supplies, art books, and carryout\nribs. The puppy sniffs around happily, licking at Jean and\nwalking over the paintings, wagging his tail.\n\nHe stops the tape player and inserts some Persian music.\n\nJean empties some foil-wrapped bags of coke. He cuts a line of\ncoke on a foil plate.\n\nRene starts reading from a poem he's evidently written:\n\n                      RENE\n           3rd night I called    him 'boy'\n           He sed \"don't call    me 'boy'\" \"Well\n           Then don't call me    'Boss'\" That\n           Was the end for us    and I've\n           Been seeing him for    2 1/2 years.\n           In kangaroo court I    want to be\n\n           Able to say I never kept a\n           Slave. But he tricked me in\n           To Tying him up and busting his\n           Face. He'll jump up at my Trial\n           Yelling 'He wupped me gud.'\n\nJean warms the plate 'til the coke crackles, and then \"chases the\ndragon,\" sucking the smoke through a straw.\n\nHe offers it to Rene, who refuses. He lights and hands Rene the\njoint. Rene takes a hit. Jean takes it back.\n\nJean starts to work again.\n\nThe PUPPY runs around, chasing after him, getting in his way,\nrunning across the paintings. Jean laughs, playing tag. The puppy\ngets a hold of Jean's sleeve. It unravels about ten feet.\n\nWhile Jean's playing, Rene spots a painting with the words\n\"Famous Negro Athletes.\"\n\n                      RENE\n           Oh man! That's one looks famous already.\n\nWithout hearing him, Jean walks towards the painting and with a\nswipe, paints out what Rene is pointing to.\n\n                       RENE (CONT'D)\n           You are a willful boy. How'm I s'posed to\n           write about you if you keep changing\n           everything?\n\nThe phone RINGS... Jean ignores it. Rene gets it -\n\n                       RENE (CONT'D)\n           Uh huhh... Band practice?\n                  (to Jean)\n           It's Benny. He wants to know why you're not\n           at band practice...?\n\n                       BASQUIAT\n                  (quietly)\n           Fuck...\n                  (to Rene)\n           I forgot about that.\n\nHe sets his brush down.\n\nRene hold the phone against his leg.\n\n                      RENE\n           Fuck band practice... If you're gonna be a\n           painter you're gonna have to break a few\n           hearts - you don't wanna be like Tony\n           Bennett..\n\n                      BASQUIAT\n           Tony Bennett... What do you mean?\n\n                      RENE\n           Singing on stage and painting in your spare\n\n           time.\n\n                      BASQUIAT\n           I didn't know Tony Bennett painted.\n\n                      RENE\n           My point exactly.\n\nJean picks up the phone... All he hears is a DIAL TONE.\n\n                      RENE (CONT'D)\n           So keep painting.\n\n                       BASQUIAT\n           Yes, Boss.\n                  (beat)\n           If you're so smart, why are you here with\n           me in this basement?\n\n                       RENE\n           You're news. I want the scoop. I write it\n           down. When I speak, no one believes me. But\n           when I write it down, people know it's\n           true.\n                  (beat)\n           There's never been a black painter in art\n           history that's been considered really\n           important, you know?\n\n                      BASQUIAT\n           So what?\n\n                      RENE\n           So shut up and keep painting..\n\n                       BASQUIAT\n                  (touched)\n           What time is it?\n\n                      RENE\n           5:11.\n\nJean regards a near-finished painting. He writes \"5:11\" on it. He\ncrosses it out and re-writes it, \"Rene 5:11.\" Rene looks pleased.\n\n                      BASQUIAT\n           That one's for you.\n\n                      RENE\n           Thanks... I'll take it tonight.\n\n                      BASQUIAT\n           I can't. After the show.\n\nJean continues painting. Rene slumps down onto the floor, happy -\na parasite content to have a host, impressed with Jean's\nlimitless energy. Rene closes his eyes.\n\nBLACK\n\nINT. ANNINA'S BASEMENT - LATER\n\nJean is bent over his work. He looks to see a pair of legs. They\nbelong to Albert Milo.\n\n                      BASQUIAT\n           Hey - it's the big A.M..\n\n                      ALBERT MILO\n           Rene's been telling me about your work.\n\nMilo takes his time looking at the paintings.\n\nJean continues to work, never wanting to appear impressed by\nanyone. He walks on top of the paintings.\n\n                      ALBERT MILO (CONT'D)\n           Is this finished yet?\n\n                      BASQUIAT\n           I don't know.\n\n                      ALBERT MILO\n           When's your show?\n\n                      BASQUIAT\n           Not sure. How was yours?\n\n                       ALBERT MILO\n           I haven't decided yet.\n                  (beat)\n           Rene, you wanna come over to the studio\n           tomorrow. I wanna make a painting of you.\n\n                      RENE\n           How about now?\n\nRene shrugs to Jean. He prepares to leave.\n\n                      ALBERT MILO\n           See you at your opening. Thanks.\n\nAlbert and Rene begin to ascend the stairs. Jean continues\npainting. The dog leaves with Rene and Albert.\n\n                      WOMAN'S VOICE (O.S.)\n           Ohhh, Albert Milo, what a pleasure to meet\n           you.\n\nJean's brush stops.\n\n                      ALBERT MILO (O.S.)\n           This is Rene Ricard.\n\nJean paints over the words \"Rene 5:11.\"\n\nWe hear FOOTSTEPS COMING DOWN THE STAIRS. The woman continues -\n\n                      WOMAN'S VOICE (O.S.)\n           We're Tom and Cynthia Kruger - nice to have\n           met you.\n\nJEAN'S POV\n\nWe see Annina's legs coming down the stairs.\n\n\nREVEAL\n\nA man wearing a pin-striped suit and gold-rimmed glasses. The\nwoman is wrapped in a cashmere shawl.\n\n                        ANNINA NOSEI (O.S)\n             Tom and Cynthia Kruger.\n\n                        BASQUIAT (O.S)\n             I know.\n\nWe SEE that Jean continues to paint, looking down.\n\n                         ANNINA NOSEI\n             This is Jean Michel Basquiat.\n                    (beat)\n             You've seen the SAMO graffiti everywhere.\n             That's his. This is the true voice of the\n             gutter.\n\nAs she speaks, Jean squirms. He grabs a banana from a fruit bowl.\nWithout peeling it, he takes a big bite. And another. And\nanother. Everyone looks uncomfortable. Annina starts showing them\nthe paintings.\n\n                        CYNTHIA KRUGER\n             We've seen the graffiti. I work on Wall\n             Street. And I've heard wonderful things\n             about the paintings. Everybody's talking\n             about you.\n\n                        BASQUIAT\n             Yeah.\n\nHe looks up at them, eating the banana.\n\n                         ANNINA NOSEI\n             Here's a very good example of his recent\n             work that's not spoken for yet.\n                    (beat)\n             He's got to work in a basement. He's got so\n             much energy that if he worked in a place\n             with a window, he'd jump right through it.\n             Most of these are reserved already. After\n             this week, this work will not be available.\n\n                         TOM KRUGER\n                    (to his wife)\n             ... I don't know.... This one's nice, but I\n             don't know if I could live with it. That\n             green is so... institutional.\n\nHe (Kruger) looks up to see two KIDS enter - young black artists,\none of whom we saw with Rene at the loft party.\n\nThey walk right into the middle of the room, completely oblivious\nto the presence of Annina and the Krugers..\n\n                       KID #1\n                  (enthusiastically)\n           Yo, man, you're a damn lucky nigger selling\n           this shit!\n\n                      BASQUIAT\n           You like it?\n\n                      KID #1\n           Not bad. Yeah, I do.\n\nThe Krugers hem and haw in front of the painting next to Jean.\n\n                      CYNTHIA KRUGER\n           I'm fascinated by his choice of crossing\n           out words that way.\n\n                      ANNINA NOSEI\n           Yes, well, they are more meaningful in\n           their absence, no?\n\n                       KID #1\n                  (to Jean, joking)\n           What does it mean?\n\nJean paints the words \"Rene 5:11\" back into a painting. They\nignore the kid..\n\n                      CYNTHIA KRUGER\n           I like this one, but that green...\n\nSuddenly, we see LEGS coming down the stairs. It's Gina. Everyone\nlooks at her.\n\n                      BASQUIAT\n           Y'want me to make it a nice shit brown?\n\n                         TOM KRUGER\n           Beg pardon?\n\nGina hadn't expected to find herself in the middle of this scene.\n\n                      BASQUIAT\n           Hi. This is Gina.\n\nAnnina nods to her.\n\nGina nods to the group.\n\n                      CYNTHIA KRUGER\n           They're something like Dubuffet's...\n           That... childlike quality.\n\nGina tries to connect with Jean. He's cold.\n\n                       CYNTHIA KRUGER (CONT'D)\n                  (to her husband and Annina)\n\n           I can't make up my mind.\n\n                      TOM KRUGER\n           I like this one. If it were just another\n           color..\n\n                       BASQUIAT\n           Get a fucking decorator. If you buy one,\n           you'll have to change your whole lives -\n           maybe even sell your kids!\n                  (to Annina)\n           These paintings aren't even done yet!!!\n\nHe sets his brush down. As he leaves -\n\n                      TOM KRUGER (O.S.)\n           I think we'll take the green one.\n\n\nHOLD ON:\n\nGina, left standing in the middle of this.\n\n\nINT. MCDONALDS - DAY\n\nCLOSE ON McDonald's COUNTERMAN. He smiles.\n\n                      BASQUIAT\n           I'll take three big Macs, two chocolate\n           shakes, two orders of fries, and an apple\n           pie.\n\n                      COUNTERMAN\n           You want three Big Macs, two chocolate\n           shakes, two orders of fries, and an apple\n           pie.\n\nA line begins forming behind Jean.\n\n                      BASQUIAT\n           Forget it .I'll take six, no, seven\n           chocolate shakes, an order of fries, a Big\n           Mac, and two apple pies.\n\n                      COUNTERMAN\n           You only want one Big Mac?\n\nThe people in line are beginning to get impatient.\n\n                      BASQUIAT\n           Yeah... And make it three apple pies.\n\n\nEXT. SOHO STREET - DAY\n\nJean leans on a fire hydrant, eating a Big Mac.\n\nA pink scarf blows on the wind right in front of his face. He\ncatches it.\n\nA BOMBSHELL BLONDE arrives with her hand outstretched to retrieve\nit.\n\n                      BIG PINK\n           How can I ever thank you?\n\n                       BASQUIAT\n                  (with a smile)\n           I'd like to squeeze your titties.\n\nHe offers her a Big Mac.\n\n                         BIG PINK\n           Come on.\n\n                         BASQUIAT\n           Wanna Mac?\n\n                      BIG PINK\n           No, I'd like the scarf.\n\n                         BASQUIAT\n           Have a Mac.\n\n                      BIG PINK\n           I don't eat junk food.\n\n                       BASQUIAT\n           Oh. I didn't know. I'll take you to the\n           best restaurant in town.\n                  (beat)\n           You'll miss a great meal and I'll keep the\n           scarf, anyway. What's your name?\n\n                      BIG PINK\n           You're a fast mover.\n\n                      BASQUIAT\n           No name? That's ok. I'll just call you Big\n           Pink.\n\nA man sleeping on the ground with a beehive of paper bags on his\nhead and three overcoats sticks out into the sidewalk.\n\nJean leaves the McDonald's bag near his head as he walks down the\nstreet with the girl.\n\n\nINT. GINA'S APARTMENT - NIGHT\n\nJean enters the apartment.\n\n                         GINA\n           Hi.\n\n                         BASQUIAT\n           Hi.\n\n                      GINA\n           What's that?\n\n                        BASQUIAT\n             A present I picked up for you.\n\nGina holds the scarf up and looks at it.\n\n                        GINA\n             It's beautiful. Thanks.\n\nAs she holds it up he puts it around her neck and kisses her.\n\n                         BASQUIAT\n                    (tenderly)\n             You look like an angel.\n\n\nINT. ANNINA NOSEI GALLERY - NIGHT\n\nSilence.\n\n\nCLOSE UP PAINTING\n\nWe read the words:\n\n\"BOOM #2\nA CAT POURING TACKS ON ITS TONGUE\"\n\nSOMEONE (the big red-haired dealer we met earlier) walks in front\nof us.\n\nCAMERA PULLS BACK to reveal a crowd in a gallery. It is literally\nfilled with people. Again - all this takes place in silence.\n\nWe begin to HEAR Peggy Lee's \"Is That All There Is?\" It colors\nthe motion of the crowd.\n\n                                                  CUT TO:\n\n\nEXT. PRINCE ST (BET. MERCER AND WOOSTER) - DUSK\n\nJean walks down the street. He's got on a new set of clothes and\nhe listens to a Walkman. We HEAR Miles Davis' \"Flamenco\nSketches.\"\n\n\nJEAN'S POV\n\nWe MOVE down Prince St. and take a left on West Broadway. We\napproach a huge crowd. We get closer and closer until we are\nimmersed in it.\n\nThe crowd realizes Jean's amongst them. People start approaching\nhim. Someone removes the headphones.\n\nThe DIN of the crowd replaces the music. Amongst the normal crowd\nchatter, we hear friends' calling out:\n\n                        VOICES IN CROWD\n             Jean!!! Jean Michel!!!\n\nINT. ANNINA NOSEI GALLERY\n\nAnnina    beckons to him. Beyond her, he sees Albert, Andy, and\nBruno.    He's being escorted or maybe just pushed - it's hard to\ntell.    Each step of the way, he's pounced upon by INDIVIDUALS\nwe've    never met. The room is wall-to-wall with people. People are\nswept    along in currents.\n\n                          MAN\n                     (wildly enthusiastic)\n              Jean, man!!! Let's make a record!\n\n                          WOMAN\n                     (slyly, intimately)\n              You finally did it.\n\n                          MAN #2\n                     (pointing to Jean, sneering)\n              He's so fulla shit.\n\n                         MAN #3 (O.S.)\n              How much is he getting for these?\n\nJean walks up to Andy Warhol.\n\n                         BASQUIAT\n              Andy, man, thanks for coming. I'd like to\n              paint your jacket.\n\n                          ANDY WARHOL\n              My jacket? Gee, great...\n                     (he Polaroids Jean)\n              Your show looks great. Quite a turnout. You\n              look great. You kids. You drink red wine\n              with fish. You can do anything! Make\n              paintings in the basement of your gallery?\n              First time I've heard of that!\n\nThey are approached by Mary Boone, a short woman in high heels\nand an Armani suit).\n\n                         ANDY WARHOL (CONT'D)\n              Jean Michel, this is Mary Boone. She's got\n              the great new gallery.\n\n                         BASQUIAT\n              Yeah, I met her already.\n\n                          MARY BOONE\n                     (shaking Jean's hand)\n              You should be pleased. It's a great\n              show...I'm having a dinner later at Mr.\n              Chow's for Albert. You should come.\n\nIn the background, we see Annina watching.\n\n                         ANDY WARHOL\n              You'll like it. Everyone'll be there.\n\nAnnina walks over to Jean with a COUPLE.\n\n                      ANNINA NOSEI\n           Jean, your parents are here.\n\n                      BASQUIAT\n           Hi Dad. Hi Nora.\n\n                      NORA\n           Congratulations.\n\n                      BASQUIAT\n           Thanks for coming.\n\nRene appears out of the crowd.\n\n                       ANNINA NOSEI\n                  (continuing to Jean's father)\n           You must be very proud.\n\n                      FATHER\n           I am!\n\n                      RENE\n           How does it feel to have a genius in the\n           family?\n\n                      FATHER\n           It feels... good!\n\nJean notices Benny across the room. He slows down and waves.\n\nJean sees Gina across the room wearing the scarf.\n\nJust beyond her, he sees Big Pink approaching.\n\nThere must be ten people between them.\n\n                       BASQUIAT\n                  (to Rene)\n           I'll be right back.\n\nHe moves towards her. Suddenly, directly in front of him are the\nKrugers.\n\n                      TOM KRUGER\n           We love our painting.\n\n                      BASQUIAT\n           Which painting?\n\n                      TOM KRUGER\n           The green one.\n\n                      BASQUIAT\n           Oh yeah.\n\n                      CYNTHIA KRUGER\n           We got a couch to match.\n\n                      TOM KRUGER\n           She's only kidding!\n\nLooking past the Krugers, Jean looks for Gina. He sees her. His\npath is blocked.\n\nHe presses forward, looking for Gina, getting caught in the\ncrowd.\n\nJean strains to keep an eye on Gina and Big Pink..\n\nBenny arrives at Jean's side holding a bottle of Jack Daniels and\na shot glass.\n\n                      BENNY\n           Willie Mays. A Toast.\n\nJean brushes past him.\n\n                      BASQUIAT\n           Not now, ok?\n\nBenny is left standing next to Andy holding the bottle.\n\nJean manages to advance a few more feet through the crowd, then\nruns smack into Rockets, his drug dealer.\n\n                      ROCKETS\n           Jean Michel, my man. Nice party. Should we\n           step into my office?\n\nNearby, Benny sees this meeting and walks off, disgusted,\nthinking this is why Jean gave him the brush off.\n\n                      BASQUIAT\n           That's alright. I'm cool now.\n\nJean looks off and sees Big Pink fingering the scarf, saying\nsomething to Gina.\n\nGina slaps her in the face.\n\nJean tries to get around the dealer.\n\nGina turns to leave. She catches Jean's eye.\n\nShe walks out.\n\n                      ROCKETS\n           A gift! I was just trying to give you a\n           gift!\n\nThe dealer palms something to Jean.\n\n                         BASQUIAT\n           I gotta go.\n\nJean steps away from Rockets, but is trapped in the crowd.\nRockets looks after him with disappointment.\n\nRene arrives with, Andy, Bruno, and a PHOTOGRAPHER.\n\n                         RENE\n\n                  (edging his way in)\n           This guy wants a picture.\n\nThey shrug and crowd in - Jean, Andy, and Rene. The photographer\ngets them to squeeze closer and closer.\n\n                      PHOTOGRAPHER\n           Of the painters, please.\n\nThere's not enough room. Rene accidentally gets pushed out of\nframe.\n\nRene fumes. Albert Milo arrives with his parents (JACK AND ESTHER\nMILO). They are a nice Jewish couple in their 70's.\n\n                      BASQUIAT\n           He said 'of the painters!' Hey - Albert!\n           Get in the picture!\n\nAlbert crowds in. The photographer SNAPS a picture and the FLASH\nblinds everyone momentarily.\n\n                      ALBERT MILO\n           Hey, Jean, I'd like you to meet my\n           wife....and my parents. Mom, Dad, this is\n           Jean Michel Basquiat.\n\nJean pulls out a joint and lights it as if it were a cigarette.\nHe offers it to Albert, who takes a hit.\n\n                       ESTHER MILO\n                  (frowning at her son)\n           Don't do that.\n                  (beat)\n           Hello, Jean.\n\n                      JACK MILO\n           Hi, John... Are your parents here?\n\n                      BASQUIAT\n           Well.\n                  (inhaling)\n           My dad's here with his wife. My mom\n           couldn't make it.\n\nHe offers the joint to Albert's mother.\n\n                       ESTHER MILO\n                  (waving it away)\n           No thanks.\n\nEveryone laughs.\n\n                       BRUNO\n                  (to Jean)\n           I'd like to do a show with you.\n                  (pointing to \"Rene 5:11\"\n                  painting)\n           I'm especially interested in that one. I'd\n           like to buy it for myself.\n\nJean spots the very word on the painting (\"Rene 5:11\") and\nfreezes for a second.\n\n                      BASQUIAT\n           I wasn't gonna sell this one.\n\nHe looks around the room for Rene, but doesn't see him. Bruno\nremains smiling, waiting for an answer.\n\n                      BRUNO\n           You shouldn't have put it in the show. This\n           is the one I absolutely have to have. I\n           really love it.\n\n                        BASQUIAT\n           Sure, ok..\n\nJean wants out. He feels compromised.\n\n                      BASQUIAT (CONT'D)\n           Do you think I could borrow your limousine?\n           I'll get it back to you in an hour.\n\n                      BRUNO\n           It's OK. Just have him bring you to dinner\n           at Mr. Chow's later. We'll be there.\n\n                        ANDY WARHOL\n           Bye, Jean.\n\nJean makes his way through the crowd, as we see images of the\ncrowd and fragments of paintings. As he nears the door, he feels\nhis arm pulled.\n\n                       RENE\n                  (hissing)\n           You fucking little whore! You sold my\n           painting! I'm gonna tell you something,\n           brother - when you're climbing up the\n           ladder of success, don't kick out the\n           rungs! Believe that shit.\n\n                      BASQUIAT\n           I'll make you another one.\n\n                        RENE\n           Forget it.\n\nHe pulls out a scrap of paper and starts writing.\n\n                        BASQUIAT\n           Rene -\n\nRene shushes him... He hisses loudly, like a cat.\n\n                       RENE\n           SHHHHHH. Later.\n                  (speaking to himself)\n           \"What is it about art, anyway......\"\n\nJean pauses. He turns around and surveys the room once more.\n\nA blink.\n\nSilence.\n\nWe see the crowd in SLOW MOTION.\n\nEveryone's eyes are shut.\n\n                       RENE (O.S.; CONT'D)\n           ... that we give it so much importance?\n           Artists are respected by the poor because\n           what they do is an honest way to get out of\n           the slum using one's sheer self as the\n           medium. The money earned is proof pure and\n           simple of the value of that individual...\n           The Artist.\n\n\nINT. / EXT. GALLERY - NIGHT\n\nThe CAMERA rises higher and higher over the crowd and follows\nJean as he makes his way toward the street.\n\nWe begin to DISSOLVE into a MONTAGE of stills of ARTISTS:\n\n                      RENE (O.S.CONT'D)\n           The picture a mother's son does in jail\n           hangs on her wall as proof that beauty is\n           possible even in the most wretched. And\n           this is a much different idea than the\n           fancier notion that art is a scam and a\n           rip-off. But you could never explain to\n           someone who uses God's gift to enslave that\n           you have used God's gift to be free.\"\n\n\nEXT. STREET - NIGHT\n\nJean enters a waiting limo. It pulls away from the curb.\n\nRene finishes as the limo threads its way through the night-lit,\ntwinkling city.\n\n\nINT. LIMO - NIGHT\n\nThe DRIVER is the young Rasta we saw earlier outside Ballato's\ndriving Bruno and Andy.\n\nJean slumps in the back seat.\n\nThe driver can't help staring in the rearview mirror.\n\n                      DRIVER\n           I really... admire you.\n\n                      BASQUIAT\n           Me? Why?\n\n                      DRIVER\n\n           You did it! You made it. I'm a painter,\n           too.\n\n                      BASQUIAT\n           That's great.\n\n                      DRIVER\n           Would you check out my studio some time?\n\n                      BASQUIAT\n           Sure. I'd be glad to.\n\nThe limo pulls over.\n\n                       DRIVER\n           Here?\n\nQuickly, Jean gets out of the limo. He leaves the door open.\n\nThe DRIVER watches as Jean talks to two DRUG DEALERS.\n\nJean jumps back into the limo.\n\nThe driver pulls away. In the rearview mirror, he sees Jean\nseparate a bag from a bundle of ten. He rips it open and snorts\ndirectly from it.\n\nHe lays his head back and takes a deep breath.\n\n                       BASQUIAT\n                  (calm, relieved)\n           What's your name, man?\n\n                      DRIVER\n           They call me Steve, but I prefer Shenge.\n\n                      BASQUIAT\n           Nice to meet you, Shenge. Want a job?\n\n\nINT. MR. CHOW'S RESTAURANT - NIGHT\n\nAn elegant Chinese restaurant on the Upper East Side. The dining\nroom is split level with a mezzanine reserved for celebrities and\nspecial friends of the owner.\n\nAt the podium, the MAITRE'D approaches.\n\n                      MAITRE'D\n           Good evening.\n\nFrom behind the Maitre'd on the mezzanine we see Bruno waving to\nJean.\n\nIn the dining room on the lower level sit Annina and Rene.\nNearby, at another, smaller table, are seated DAVID MCDERMOTT and\nPETER MCGOUGH, two artists dressed in Victorian attire.\n\nAnnina beckons him.\n\nRene looks away from him and talks to a WAITER. Jean waves to\n\nAnnina and continues towards Bruno's table.\n\nSeated at a large table are Andy, Bruno, Albert Milo, his wife\nand parents, Henry Geldzahler, MELINA PORTOS (a young heiress)\nand FRANCESCO and ALBA CLEMENTE and Mary Boone. Dinner's already\nserved.\n\nAt the large table, everyone watches as Milo makes a portrait of\nFrancesco in a beautiful leatherbound book. It belongs to Mr.\nChow, who is nearby at the bar.\n\n                       ANDY WARHOL\n           Hi, Jean.\n\nHe motions to Mr. Chow to set a chair for Jean between Mary Boone\nand himself.\n\n                      BRUNO\n           Jean, everyone loved your show.\n\nAs Jean is seated, Andy and Jack Milo resume conversation -\n\n                      JACK MILO\n           Nixon lives in Saddle River, New York.\n\n                      ANDY WARHOL\n           Saddle River's in New Jersey.\n\n                      JACK MILO\n           Saddle River, New York!\n\n                      ANDY WARHOL\n           It's in New Jersey.\n\n                       JACK MILO\n           New York.\n\n                      ANDY WARHOL\n           I think it's in New Jersey.\n\n                      JACK MILO\n           It's in New York.\n\n                      ANDY WARHOL\n           Oh, I didn't know that.\n\nCLOSE UP: Jean smiles at Andy's diplomacy.\n\nAlbert finishes drawing his portrait: it's Francesco with his arm\naround a headless torso.\n\n                       ALBERT MILO\n                  (to Francesco)\n           You finish it.\n\nHe pushes the book across the table.\n\nFrancesco begins to draw.\n\n                       MARY BOONE\n                  (to Jean)\n\n           I hear your show was sold out already.\n           There's a very important collector who's\n           interested in some of your works.\n\n                      BASQUIAT\n           Bring him over sometime. I have some other\n           stuff to show him.\n\nAnnina watches from the other table as Jean talks to Mary.\n\nFrancesco finishes his drawing.\n\nAlbert takes the book and passes it to Jean.\n\n                      ALBERT MILO (CONT'D)\n           Go on, take it..\n\nJean takes it. Mr. Chow watches his book change hands.\n\nJean takes a bowl of moo-shoo pork in front of him and dumps it\nonto the book. Then he uses a piece of pork to draw a head.\n\nSuddenly, there's a shrill, familiar voice.\n\n                       RENE\n           I'd like a glass of your best champagne,\n           please?\n                  (reading)\n           This is an enormously important season in\n           New York, and to make a false step could\n           have severe repercussions for years. We are\n           no longer collecting art, we're buying\n           individuals.\n\n                      ANDY WARHOL\n           Oh shut up, Rene.\n\n                       RENE\n           Everything's over your head, Andy. Even Mr.\n           Chow's menu.\n                  (beat - to Jean)\n           Thanks for not inviting me\n\nHe leans over everyone and helps himself to some spears of\nasparagus.\n\n\nANGLE ON\n\nEsther Milo, watching.\n\n                      RENE (CONT'D)\n           I'm starving. You can't buy    advertising\n           like this. This is the most    glamorous\n           dinner you'll have here this    fall. How\n           about some of that imitation    crab?\n\n                      MR. CHOW\n           I'm not paying for the drawing with crab.\n           It's a present to my friends. It's my\n           birthday.\n\nJean finishes his drawing - a big beautiful head that fills the\nscreen.\n\nRene grabs it from him. He holds it up for everyone to see.\n\n                      RENE\n           Isn't he great? Thanks, Jean.\n\nHe rips the page from the book.\n\n                      RENE (CONT'D)\n           He owes me one.\n\nEveryone's face drops. Mr. Chow grabs his book. He motions to a\ncouple WAITERS -\n\n                      MR. CHOW\n           You're too much, Rene. Get this guy out of\n           here.\n\n                      RENE\n           I haven't eaten yet!!!\n\nThe waiters grab Rene's arms.\n\n                      RENE (CONT'D)\n           Hands off me, you faggots! I'm going. I'm\n           going...I've kept Diana Vreeland waiting\n           too long, anyway.\n\n                      ANDY WARHOL\n           Wow... That was a nice drawing, too, Jean.\n           Maybe you should do another one.\n\n                       MR. CHOW\n                  (exhausted)\n           Some other time.\n\nSpontaneously, David McDermott climbs onto the tabletop\ndownstairs and sings \"Paris Je T'aime.\"\n\nAs he belts it out in a theatrical falsetto, he glides over\nglasses and plates, executing a leap to another table in mid-\nsong.\n\nThe restaurant staff and OTHER DINNER GUESTS watch, agape.\n\n\nCLOSE UP - DAVID'S SHOES.\n\nAs David dances, Annina walks over to the table, greeting people\nand saying goodnight.\n\n                       ANNINA NOSEI\n                  (to Jean)\n           It's great that people are interested, but\n           if anyone's going to buy anything, I'll\n           handle it for you. Everything goes through\n           the gallery, even if they come to your\n           studio.\n\n                      BASQUIAT\n           Sure.\n\nAnnina leaves.\n\nJean leans back in his chair, taking in this splendid new world.\nHe pulls out a joint, lights up, inhales with pleasure, closes\nhis eyes and smiles.\n\nSUPER OVER HIS FACE: \"FOUR YEARS LATER\"\n\nSCREEN GOES BLACK\n\n                      INTERVIEWER (O.S.)\n           ... had twenty-three one man shows, been in\n           forty three group shows from Zurich to\n           Tokyo..\n\n                                                    FADE UP\n\n\nINT. GREAT JONES STREET LOFT - DAY\n\nNote: The following scene is shot in documentary style.\n\n                      INTERVIEWER (O.S, CONT'D)\n           ... had over fifty articles written about\n           you, switched galleries - how many times? -\n           DJ'd in the hottest clubs -\n\nJean looks out the window, yawns and rubs his eyes. He now sports\ndreadlocks bundled into groups of spikes sticking out of his\nhead. He wears a wrinkled Wesleyan College T-shirt, paint-\nsplattered jeans, and no shoes; just out of bed, it would seem.\n\nAn INTERVIEWER - a balding Brit with all the humor of a bank\nclerk - tries to buddy up with Jean on camera.\n\n                       INTERVIEWER   (CONT'D)\n           ... one of the youngest    artists ever to be\n           included in the Whitney    Biennial, also\n           produced a rap record.    It's said you're\n           quite the ladies man -    even dated Madonna\n           for a couple months!!!\n                  (takes a breath)\n           All at the ripe old age    of 24. One might\n           ask: is there anything    left for Jean Michel\n           Basquiat to do?\n\nJean and the interviewer face each other in front of one of\nJean's paintings. Jean stares at the interviewer, incredulous.\n\n                       INTERVIEWER (CONT'D)\n           What is it that gets you out of bed in the\n           morning?\n                  (nervous laugh)\n\n                      BASQUIAT\n           I hate this. Turn that off.\n\nJean walks off camera and disappears into his bedroom.\n\nShenge (the former limo driver, now working as Jean's assistant)\nassembles stretchers.\n\nSUPER: \"GREAT JONES STREET, 1985\"\n\nA CAMERA CREW waits in the room. Jean returns.\n\n                      INTERVIEWER\n           We're running a little late.\n\nHe signals to the crew that he's beginning.\n\n                         INTERVIEWER (CONT'D)\n                    (to crew)\n           Ready?\n\nHe points to some scribbled words on the canvas.\n\n                      INTERVIEWER (CONT'D)\n           ... Can you... decipher this for us?\n\n                        BASQUIAT\n           Decipher?\n\n                      INTERVIEWER\n           Yes. What do they... stand for?\n\n                      BASQUIAT\n           They're just words.\n\n                      INTERVIEWER\n           Yes, I understand - but where do you take\n           them from?\n\n                       BASQUIAT\n           Where? Do you ask Miles where he got that\n           note from? Where do you take your words\n           from?\n                  (beat)\n           Everywhere.\n\n                       INTERVIEWER\n                  (pointing to a detail)\n           What are they?\n\n                       BASQUIAT\n                  (smiling mischievously)\n           Leeches. A long list of leeches.\n                  (looking at some frames\n                  Shenge's working on)\n           It looks good like that.\n\n                       INTERVIEWER\n           Hmmm. And 'Parasites.'\n                  (beat)\n           You seem to be a Primal Expressionist.\n\n                      BASQUIAT\n           You mean like an ape?\n\nHe grabs a huge double mouthful of French Fries and washes them\ndown with champagne..\n\n                       BASQUIAT (CONT'D)\n                  (chewing, spilling)\n           A primate?\n\n                       INTERVIEWER\n           Well, you said that.\n                  (beat - looks at notes)\n           You've got a lot of references from\n           Leonardo da Vinci, don't you?\n\n                      BASQUIAT\n           Oh, that's a \"Leonardo's Greatest Hits\"\n           painting. You like it?\n\n                      INTERVIEWER\n           Yes, but as a black painter -\n\n                      BASQUIAT\n           I use a lot of colors - not only black.\n\n                         INTERVIEWER\n           What?\n\n                      BASQUIAT\n           I'm not black.\n\n                         INTERVIEWER\n           You're not?\n\n                         BASQUIAT\n           Not what?\n\n                         INTERVIEWER\n           Not black.\n\n                      BASQUIAT\n           No, I'm Haitian-Puerto Rican.\n\nThe BUZZER sounds. He signals for Steve not to answer the door.\n\n                      INTERVIEWER\n           Yes, yes... Let's talk about that.... your\n           roots... Your father is from Haiti, isn't\n           he?\n\n                        BASQUIAT\n                   (growing weary)\n           Yup.\n\n                      INTERVIEWER\n           Hmmmm. Interesting. And when you grew up\n           were there any primitives hanging in your\n           home?\n\n                      BASQUIAT\n           We don't hang them at home, y'know - just\n           in the streets..\n\n                       INTERVIEWER\n           I see..\n                  (beat)\n           And... How do you respond to being called -\n           hmmm...\n                  (peruses some notes)\n           - yes, \"the pickaninny of the art world.\"\n\n                       BASQUIAT\n                  (smiles - hurt, stunned)\n           Who said that?\n\n                      INTERVIEWER\n           Why, that's from Time Magazine.\n\n                      BASQUIAT\n           No, he said I was the Eddie Murphy of the\n           art world. He said the Eddie Murphy.\n\n                      INTERVIEWER\n           Is it true that your mother resides in a\n           mental institution?\n\nJean walks off camera like he just received a punch in the\nstomach.\n\nThe filming of the interview becomes increasingly erratic.\n\n                      INTERVIEWER (CONT'D)\n           Let me... just... open something up here.\n           You come from a nice, middle class,\n           respectable home. Your father is an\n           accountant. Why did you at one time live in\n           a cardboard box in Tompkins Square?\n\nJean walks back into frame.\n\n                       INTERVIEWER (CONT'D)\n           Or rather, do you think you're being\n           exploited or are you yourself exploiting\n           the white image of the black artist from\n           the ghetto?\n\n                       BASQUIAT\n           Are those the only two possibilities?\n                  (cramming a French Fry into\n                  his mouth)\n           You wanna French fry?\n\n                      INTERVIEWER\n           OK. One last thing. Is there any anger in\n           you? Any anger in your work?\n\n                      BASQUIAT\n           Should there be?\n\n                      INTERVIEWER\n           Tell me about it. What are you angry about?\n\nJean drifts off.\n\n                      BASQUIAT\n           Mmmm. I don't know. I don't remember.\n\n\nINT. FANCY GOURMET DELI - DAY\n\nJean and Andy browse through the aisles. Jean piles things into\nhis cart.\n\nJean approaches the specialty counter. Andy continues with the\ncart.\n\n                       BASQUIAT\n                  (to COUNTERMAN)\n           Can I have some caviar, please?\n\nThe Counterman selects a miniscule plastic spoon of caviar and\nbegins to put it into a tiny glass jar.\n\n                      BASQUIAT (CONT'D)\n           I'd like to taste it, first.\n\nReluctantly the Counterman gives him a taste with a look like\n\"what's a person who looks like you doing buying caviar?\"\n\nJean tastes the caviar and hands him back the spoon.\n\n                      BASQUIAT (CONT'D)\n           Is that the best quality you have?\n\n                      COUNTERMAN\n           Yeah, it's the best one.\n\n                      BASQUIAT\n           I'll take the whole tin.\n\n                      COUNTERMAN\n           It's three thousand dollars!\n\n                       BASQUIAT\n           I'll take it.\n                  (wipes nose with sleeve.)\n           Andy, gimme three thousand dollars.\n                  (beat)\n           Just the caviar - I'll get the rest.\n\nHe hands two one hundred dollar bills for the other items to the\ncounterman, who checks them carefully.\n\n                      BASQUIAT (CONT'D)\n           You check everyone's bills or just mine?\n\n                                                   CUT TO:\n\n\nEXT. WINDOW - DAY\n\nA cheap pharmacy gift shop window. Jean and Andy look in on two\nyellow furry stuffed ducks which are part of a larger display.\n\n                      ANDY WARHOL\n           When I was little, my brother and I used to\n           have two ducks as pets. We called them the\n           Rodriguez Brothers.\n\nThey walk into a beauty salon.\n\n\nINT. BEAUTY SALON - DAY\n\nJean and Andy recline on the beautician's armchairs. THREE\nBEAUTICIANS busy themselves with the two of them, simultaneously\ngiving them pedicures and manicures. Jean sets down a magazine.\n\n                      BASQUIAT\n           I wish they'd quit writing this shit about\n           me.\n\n                      ANDY WARHOL\n           That's good. At least they're interested.\n\n                       BASQUIAT\n           Everybody's paying top dollar for scraps of\n           paper, refrigerator doors - anything with a\n           SAMO tag on it.\n                  (beat)\n           The other day, I just wanted a pack of\n           cigarettes, so I did a drawing and sold it\n           for two bucks. A week later this gallery\n           calls me up: \"Somebody's offering us the\n           drawing. Should we buy it for five\n           thousand?\"\n\n                       ANDY WARHOL\n           Wow... Stop giving them away.\n                  (beat)\n           I got an invitation to model for Comme de\n           Garcons... You wanna do it with me?\n\n                      BASQUIAT\n           Yeah - I'd do that... You could teach me.\n\n                      ANDY WARHOL\n           Gee. I don't need to. You're a natural. You\n           should sign up with my modeling agent.\n\nJean points to Andy's ankles - they have plastic flea collars on\nthem.\n\n                      BASQUIAT\n           Cool.\n\n                      ANDY WARHOL\n           My dog, Archie... I woke up with flea\n           bites... Creepy. I ran out and bought flea\n           collars. They work really well.\n\nBeat.\n\n                      BASQUIAT\n           Let's leave this town and go someplace.\n\n           Some island.\n\n                         ANDY WARHOL\n           Let's go to    the Carnegie Museum. They have\n           the world's    most famous sculptures all in\n           these giant    plaster replicas. It's really\n           great. It's    in Pittsburg.\n\n\nEXT. STREET - - DAY\n\nThey walk out of the beauty salon..\n\nJean sees the back of a girl. She looks a lot like Gina.\n\n                         BASQUIAT\n           Ouch..\n\n                      ANDY WARHOL\n           What's wrong?\n\n                      BASQUIAT\n           That girl looks just like my old girlfriend\n           Gina.\n\n                      ANDY WARHOL\n           Do you still love her?\n\n                      BASQUIAT\n           Yeah. I really blew it. I still think about\n           her.\n\n                      ANDY WARHOL\n           Well, have you asked her to come back?\n\nJean shakes his head `no,' sorry that he didn't.\n\n\nINT. BARBETTA'S (RESTAURANT) - DAY\n\nA medium-sized dining room with dark wood paneling and tastefully\nappointed furnishings.\n\nJean and Gina enter. Gina looks considerably more conservative\nthan previously - more like a student. Jean's dressed well, but\nlooks even more careworn than usual. His hair is tied back with a\nnecktie. He has a couple sores on his face. His skin looks a\nlittle puffy.\n\nThe MAITRE'D smiles at Jean and bows -\n\n                      MAITRE'D\n           Mr. Basquiat - what a pleasure to see you\n           again.\n\n                      BASQUIAT\n           Hey George, what's up?\n\nA huge table with NINE WHITE EXECUTIVES. WAITERS clear their\nlunch settings. As they spot Jean and Gina entering, they gawk\nand snicker.\n\nGeorge leads them to their table. As they take their seats, Jean\nnotices the suppressed giggles coming from the executives' table.\nThey try to ignore it. George disappears.\n\nJean seems self-conscious about the sores on his face.\n\n                      GINA\n           So are you really friends with Andy? He\n           seems like such a weirdo.\n\n                      BASQUIAT\n           He's not. He's out of town and he calls me\n           every day. What's weird about him?\n\n                      GINA\n           Don't you think he's using you?\n\n                      BASQUIAT\n           Why does everybody say that? He's the only\n           person I know who doesn't need to use me.\n\nGeorge reappears.\n\n                      GEORGE\n           Would you like to see the wine list?\n\n                      BASQUIAT\n           Chateau Latour '64, please.\n\nGeorge disappears again.\n\n                       GINA\n           So. Are you ready? I start Columbia next\n           fall. Of course, there's like, a year of\n           pre-med stuff, but - whatever. I'm really\n           excited.\n                  (beat)\n           And: Rene gave me a job as his secretary.\n           His poems are getting published.\n\n                         BASQUIAT\n           How is he?\n\n                      GINA\n           Pretty much the same.\n\nJean's eyebrows go up.\n\n                       BASQUIAT\n           Wow. Congratulations. I hate that asshole.\n                  (beat)\n           Thanks for coming. I guess I just wanted to\n           find out how you're -\n\n                       GINA\n                  (referring to an extra loud\n                  snicker from execs)\n           What's that about?\n\n                         BASQUIAT\n\n           Forget it.\n\nGeorge arrives and pours a sip for Jean to taste. He nods. George\nmoves off. Two or three of the executives break out laughing.\n\nJean puts the glass down and looks at them. The other table is\nclearly making fun of him.\n\n                      GINA\n           That is amazing. What year is it?\n\n                        BASQUIAT\n           George?\n\nGeorge hurries over.\n\n                      GEORGE\n           I'm sorry, Mr. Basquiat.\n\n                       BASQUIAT\n           See that table over there? I'd like to pay\n           their bill.\n\nLong silence.\n\n                        GEORGE\n           I'm sorry?\n\nGina looks at Jean, confused.\n\n                      BASQUIAT\n           Yeah, just put their bill on my tab.\n\n                        GEORGE\n           Really?\n\n                        BASQUIAT\n           Yeah.\n\n                        GEORGE\n           Very well.\n\nHe moves off towards the executives. George whispers to the HEAD\nEXECUTIVE, and nods towards Jean. The executives spread the words\namongst themselves. They're horrified.\n\n                       BASQUIAT\n                  (continuing)\n           Baby, I think about you a lot. I'm really\n           sorry about everything. You have to believe\n           me. I'm serious. I wish, y'know, that we\n           were -\n\n                      GINA\n           I don't believe it, Jean - they're picking\n           straws.\n\nA YOUNG EXECUTIVE, obviously the loser, takes a deep breath and\nheads towards them.\n\n                        YOUNG EXECUTIVE\n\n           Excuse me... On behalf of my friends I'd\n           like to apologize. We're really sorry.\n\n                      BASQUIAT\n           I wish you niggahs could get it togeth-\n           ahhhhhh.\n\nThe Executive reaches to shake Jean's hand. Jean puts a hundred\ndollar bill in his hand.\n\n                      YOUNG EXECUTIVE\n           What's this for?\n\n                       BASQUIAT\n           The tip.\n\nJean turns back to Gina. The Executive leaves them. George\nsmiles.\n\n                      GINA\n           You don't have to be sorry. There's no one\n           to blame. Jean, you're a real artist. I\n           thought I was one. You made me realize I\n           wasn't.\n\n                      BASQUIAT\n           What's his name?\n\nGina balks. Rather than face a disappointment -\n\n                      BASQUIAT (CONT'D)\n           I have to go to the bathroom.\n\n\nINT. BARBETTA'S (BATHROOM) - DAY\n\nCLOSE ON JEAN - looking in the mirror.\n\nHe looks at himself.\n\nHe starts to pick at his face.\n\n\nINT. PALLADIUM - HUGE ROOM - NIGHT\n\nJean and Albert Milo sit on a banquette\n\nA huge white painting of Jean's with a dragon's head hangs on one\nwall to their left. On the opposite wall in back of the bar hangs\nanother huge painting with a lot of heads, mostly black.\n\nLots of PEOPLE mill about a huge room.\n\nA GIRL - another Gina look-alike walks through the crowd. Jean's\neyes follow her momentarily..\n\n                       BASQUIAT\n                  (re: the paintings)\n           What do you think?\n\n                       ALBERT MILO\n\n           I like the one with the dragon's heads a\n           lot. But the black one's filled up with too\n           many heads...\n                  (beat)\n           I'd take some of them out.\n                  (beat)\n           I think you're painting too fast. I\n           wouldn't put in so many heads. Let it\n           breathe a bit.\n\n                      BASQUIAT\n           It's always how you would do it. This is my\n           version.\n\n                      ALBERT MILO\n           You're right. It's your version. You should\n           come over to the studio sometime.\n\n                      BASQUIAT\n           Why, so you could humiliate me?\n\n                      ALBERT MILO\n           No, I wanted to make a painting of you.\n\n\nEXT. UNION SQUARE PARK - DAY\n\nJean rides his bicycle through the park. He's looking up at the\nbirds flying in the trees.\n\n\nANGLE ON\n\nThe birds. We see the statue in the middle of the park, but we\nhave no idea where we are until we see the Mays Dept. Store sign.\nThe birds circle in flocks, never lighting on the trees.\n\n\nEXT. THE FACTORY (ENTRANCE) - DAY\n\nJean presses a buzzer. He's admitted. He carries his bike on his\nshoulder.\n\n\nINT. THE FACTORY - DAY\n\nJean enters a broad, high-ceilinged studio. It's neat. Paintings\nlie on the floor.\n\nAndy's back is turned to him. As Jean gets closer, he sees that\nAndy's assistant FRANK is peeing on canvas covered with copper\npigment. We hear the SOUND of the piss.\n\nFrank holds a bottle of beer in his hand.\n\n                      ANDY WARHOL\n           A little more to the right, Frank. OK...\n           Good. Now up... You got a little more?\n\nJean notices a bunch of Andy's wigs on a desk.\n\n                      BASQUIAT\n           What's with the wigs?\n\n                      ANDY WARHOL\n           I'm going to send them to my friends for\n           Christmas presents.\n\n                      BASQUIAT\n           You think those are good presents? Who\n           wants an old wig?\n\nJean makes a grimace. He walks up to the painting Frank's peeing\non.\n\n                      BASQUIAT\n           Piss painting?\n\n                      ANDY WARHOL\n           I wanted to make a few more of these.\n           Frank's been drinking this Mexican beer. It\n           makes a good green.\n\n                      BASQUIAT\n           How come you're not peeing on them\n           yourself?\n\n                      ANDY WARHOL\n           I don't like beer.\n\nLooking down at the painting -\n\n                      BASQUIAT\n           If you ever want me to shit on 'em, just\n           ask. You could finger paint.\n\n\nINT. THE FACTORY - LATER\n\nJean and Andy collaborate on a large canvas. Andy outlines a\nMobil Oil winged horse.\n\nJean paints it out. To the side he paints a penguin with a hat.\n\n                      ANDY WARHOL\n           That was my favorite part!\n\n                      BASQUIAT\n           We can do better. It needed more white.\n\nAndy watches as Jean lights a joint and continues working on his\npenguin.\n\n                      ANDY WARHOL\n           Jean, you make me feel worthless. You're so\n           famous.\n\nAndy paints an Amoco logo next to the penguin.\n\n                      BASQUIAT\n           I don't even have any friends anymore\n           besides you. And everyone says \"Warhol?\n\n           That death-warmed over person on drugs?\n           He's just using you.\"\n\n                      ANDY WARHOL\n           Gee. You shouldn't take it so seriously,\n           Jean. That's why you can't stop taking\n           drugs. You always think people don't like\n           you. Everyone likes you.\n\n                      BASQUIAT\n           People are only interested in you because\n           you're famous, not because they know a\n           fuckin' thing about your work.\n\nJean paints out part of Andy's logo.\n\n                      ANDY    WARHOL\n           Bruno called. In    Europe, people are saying\n           you're gonna die    from drugs. They think\n           they can cash in    on your death.\n\n                      BASQUIAT\n           When I was poor, everybody doubted I could\n           make it. When I got rich, everyone said,\n           `yeah, but he'll never keep it up.' Now\n           everyone says `he's killing himself.' So I\n           clean up, and then they say `Look. His\n           art's dead.' I don't take drugs, anyway.\n           I'm healthy now.\n\nJean obliterates Andy's logo.\n\n                      ANDY WARHOL\n           If you say so. You sleep until 5:00 p.m.\n           You call at four in the morning. You never\n           show up anywhere on time - if you show up.\n           You're painting out everything I do!\n\nAndy paints back in part of the horse.\n\n                      BASQUIAT\n           That's better.\n\nJean adds some letters on top of Andy's logo.\n\n                      ANDY WARHOL\n           I can't even see what's good anymore.\n\nJean Michel obliterates the rest of the logo with some white.\n\nAndy steps back and squints as he examines Jean's work.\n\n                      ANDY WARHOL (CONT'D)\n           Yeah, I see what you mean about the white.\n           It's better.\n\nJean quits painting.\n\n                      BASQUIAT\n           After the show we should take a nice long\n           vacation. Maybe go to Hawaii. That's what\n\n           I'm gonna do. I'm going to give up painting\n           and start playing music again. I wanna\n           sing.\n\n                      ANDY WARHOL\n           That would be a pity because you're a real\n           painter.\n\nFrank arrives.\n\n                      FRANK\n           Here's the poster for the show.\n\nHe presents them with a yellow poster of Jean and Andy facing\neach other with boxing gloves.\n\n\nINT. FACTORY - NEXT DAY\n\nShenge hands Andy a box.\n\nAndy opens the box. Inside is a football helmet with Jean's\ndreadlocks glued to the outside.\n\nCLOSE UP: Andy in mirror wearing helmet.\n\n                                                  CUT TO:\n\n\nINSERT\n\nThe screen is filled with the cover of the New York Times\nMagazine. Jean is featured on the cover, without his dreadlocks.\n\n\nINT. GREAT JONES ST. LOFT - NIGHT\n\nAs Shenge opens the door, a CROWD of people spill out. They pour\ninto the loft. The studio is crowded with PEOPLE. (Many of them\nwe recognize from earlier scenes in Mudd Club, Jean's opening,\netc). On the wall there is a portrait of Jean by Andy. The\nbackground is a piss painting.\n\nInside, Jean kneels on the floor in the corner of the loft with a\nbunch of people around him - girls, mostly. Twenty-five copies of\nthe Times Magazine lay stacked on the floor.\n\nCrouching on one knee, Jean signs a copy for a BRUNETTE.\n\nLooking up -\n\n                      BASQUIAT\n           Name?\n\n                      BRUNETTE\n           Elke.\n\n                      BASQUIAT\n           Number?\n\n                      BRUNETTE\n\n           505-0236.\n\nA BRUNETTE walks up -\n\n                        BASQUIAT\n           Name?\n\n                        BLONDE\n           Monica.\n\n                        BASQUIAT\n           Number?\n\n                        BLONDE\n           477-0258.\n\nAndy's assistant, Frank, arrives with CHRISTINE, 25, a model.\n\n                        BASQUIAT\n           Yo, Frank.\n\n                      FRANK\n           This is really great. What a nice place.\n\nJean is taken with Christine.\n\n                      FRANK (CONT'D)\n           Have you met Christine?\n\n                      BASQUIAT\n           I don't think so.\n\nHe's thrown off his rhythm.\n\n                      CHRISTINE\n           Would you sign one of those for me?\n\nTOXIC (seen with Rene at loft party earlier) spots Jean and steps\nin.\n\n                      TOXIC\n           YO! Jean, this is Ramellzee.\n\n                      RAMMELLZEE\n           Yo... You know why Rammellzee's here, don't\n           you?\n\n                        TOXIC\n           Uh-oh!\n\n                      RAMMELLZEE\n           I'm here for an interrogation. You've been\n           called a graffiti artist and I wanna know\n           why. All I see are scribble scrabble\n           abstractions!\n\n                        BASQUIAT\n           Boom.\n\n                      RAMMELLZEE\n           Boom? As in ordnance? Are your letters\n\n           armed? What is the prime directive of\n           graffiti culture? Do you know, black man?\n\nJean likes Rammellzee enough to be patient... Toxic grins and\nrolls his eyes to Jean. Jean watches Christine as they go on.\n\n                       TOXIC\n                  (to Ram, re: Jean)\n           Man, I was up on him years ago on the IRT.\n\n                      RAMMELLZEE\n           You're selling and ending the culture. Not\n           one bit of information. Only to get the\n           money and growl with the power, man.\n\n                      TOXIC\n           That's ignorant.\n\n                       BASQUIAT\n           That ain't ignorant - that's just stupid.\n                  (beat - to Christine)\n           Can I get you a bowl of gumbo?\n\nRammellzee yells after him -\n\n                      RAMMELLZEE\n           This interrogation is not over!\n\nJean escorts Christine to the kitchen.\n\nBruno and Andy stand in the crowd.\n\nNearby are two WOMEN.\n\n                      WOMAN\n           Albert Milo? Ugh! He's just a pressmonger.\n           That's all these people do.\n\n                      WOMAN #2\n           You know, I love Jean's early work. It's\n           really got something. But this\n           collaboration with Andy - maybe they\n           thought it was a joke... I mean - whose\n           work is it? Jean's or Andy's?\n\nWalking by, Rene responds to this -\n\n                      RENE\n           His early work? He's only twenty-six!\n\nRene walks over to Jean.\n\n                        BASQUIAT\n           Hey, Rene.\n\n                      RENE\n           Thanks again for not inviting me. I'm only\n           here on business.\n\nRene heads back out into the party.\n\nJean eats gumbo while Christine thumbs through the Times\nMagazine.\n\n\nANGLE ON\n\nRene responds to something Andy's been telling him in a low\nvoice.\n\n                        RENE (CONT'D)\n                   (loudly)\n            You're asking me? Nigga, please. After the\n            way you treated me? This is the first time\n            I've heard from either of you in months! I\n            had to crash this party! You treated me\n            like a suede biscuit. Rene don't play that!\n            I can't get him off drugs! I don't even\n            talk to him any more!!!\n\n                        ANDY WARHOL\n                   (to Bruno)\n            What's a suede biscuit?\n\n                                                  CUT TO:\n\n\nCHRISTINELooks up from her magazine..\n\n                        CHRISTINE\n                   (amused)\n            Hey, what's this? It says right here you're\n            Andy's... \"lapdog\"...\n\nJean walks away.\n\nHe passes through the crowd, making his way to the door.\n\nHe exits.\n\n\nEXT. GREAT JONES ST LOFT - NIGHT\n\nDrugged, upset, Jean leaves the party.\n\nHe opens a limo door and looks back at his house. The party\ncontinues.\n\nThe limo drives off.\n\nWe HOLD on Jean's building.\n\n\nINT. LIMO - NIGHT\n\nThe limo floats through the streets.\n\nJean stares out the window.\n\n                       BASQUIAT\n            Here... Pull over.\n\nThe limo pulls over.\n\nJean exits.\n\n\nEXT. STREET - NIGHT\n\nJean disappears around the corner.\n\n\nANGLE ON\n\nTHREE KIDS in the process of prying a door panel with crowbars.\n\nWe see that they're removing one of Jean's SAMO pieces from a\nwall. We read:\n\n\"PAY FOR SOUP\nBUILD A FORT\nSET IT ON FIRE\"\n\nJean arrives behind them.\n\n                           BASQUIAT\n              What's up?\n\n                         KID #1\n              Mind your own fuckin' business.\n\n                          BASQUIAT\n                     (recognizing his work)\n              That's mine.\n\n                         KID\n              That ain't yours, man. Some asshole named\n              SAMO did this.\n\n                         KID#3\n              He's dead. That's what I heard.\n\n                         KID #2\n              He ain't dead yet. He's gonna kill himself.\n              That's why all those art fags in Soho are\n              paying more every time we bring one of\n              these in.\n\n                         KID #1\n              Stupid SAMO... Hardly any of this shit\n              left.\n\nThe panel is almost pried free without a scratch.\n\n                         KID #3\n              This one's damn nice. I say we hang onto it\n              if he's almost dead.\n\nJean shoves his way in front with a magic marker and adds a\ncouple words; now it reads:\n\n\"SAMO IS DEAD\"\n\n                      BASQUIAT\n           There you go. Now it's worth more.\n\nThe kids are outraged, thinking Jean's ruined their find.\n\nThey jump on him.\n\nThey beat the shit out of him.\n\nThey're done.\n\nJean lies curled up on the ground, trying to talk.\n\n                      KID #2\n           What's he saying?\n\n                      BASQUIAT\n           I'm SAMO... I'm SAMO...\n\n                       KID #3\n                  (bending close)\n           He says he's SAMO.\n\nKid #1 whacks him in the back once more for good measure.\n\n                       KID #1\n           He wish.\n\n                                                     DISSOLVE TO:\n\n\nTHE SEA\n\nIt is flat, dead, gray.\n\nOminous and waiting.\n\n\nINT. GREAT JONES ST. LOFT - DAY\n\nWashed in sunlight, a large painting leans against the wall, the\nwords \"HAITIAN BASEBALL FACTORIES\" scrawled through its center.\n\nJean lays down, watching TV.\n\nHe looks older now, more worn. His face is slightly swollen. His\ncomplexion is discolored.\n\nShenge covers a triptych with wide brush strokes of yellow paint.\nHe circles a large, primitive figure of a black man drawn with\nmagic marker in the center. He is careful to leave the figure\nintact.\n\n                      BASQUIAT\n           Paint it out.\n\n                       SHENGE\n           Out?\n\n                      BASQUIAT\n           Yeah... Maybe just his arms.\n\n                  (Shenge paints out the arms)\n           Put some Cerulean Blue there.\n\nJean points to the lower corner.\n\nShenge picks up the phone, which has been RINGING for some time.\n\n                      SHENGE\n           It's Andy again.\n\n                      BASQUIAT\n           Still not here.\n\n                      SHENGE\n           - In this corner?\n\n                         BASQUIAT\n                    (not looking)\n           Yeah..\n\nShenge changes the brush and dips it in the can.\n\n                      SHENGE\n           You want me to put it here?\n\n                      BASQUIAT\n           Use your fucking instinct.\n\nShenge shrugs and starts to spread the blue. Jean looks at his\nwork.\n\n                      BASQUIAT (CONT'D)\n           Don't try to make art. Just paint like a\n           housepainter.\n\nA woman's shout can be heard through the open window. Shenge\nlooks out.\n\n                      SHENGE\n           It's Maria Portos. What should we do?\n\n                      BASQUIAT\n           Why don't you try letting her in, Steve - I\n           mean Shenge.\n\n                      SHENGE\n           Get up. She won't buy anything if she sees\n           me working on it!\n\n                      BASQUIAT\n           Wanna bet? If you show too much respect for\n           people with money, they don't have respect\n           for you.\n\nMARIA, a raven-haired, sharp-featured beauty in a Chanel suit\njacket, blue jeans, and pearls walks into the room. She's with\nELLEN - younger - a millionaire fake hippie from Texas.\n\nMaria carries a bag with clogs in it - a present for Jean. She\ntakes them out.\n\n                       MARIA\n                  (showing him the clogs)\n           These reminded me of you, the clogs. I\n           found them in Amsterdam.\n\nJean doesn't get up from the floor.\n\n                      MARIA (CONT'D)\n           How are you?\n\n                      BASQUIAT\n           Fine.\n\n                       MARIA\n           You remember Ellen?\n                  (looking around)\n           What are you working on?\n\nBasquiat points at the painting.\n\n                      ELLEN\n           How much is something like that?\n\nJean raises his hand and pumps five fingers three times in the\nair.\n\n                      MARIA\n           Fifteen. Reasonable.\n\nEllen makes a snotty face.\n\n                       BASQUIAT\n           It's unfinished.\n                  (to Shenge)\n           How 'bout some blue in the corner?\n\nShenge gives Jean a stupefied look.\n\n                      SHENGE\n           Blue? Where?\n\n                      BASQUIAT\n           What's wrong with you today?\n\nShenge is embarrassed by Jean's remark in the company of the two\nwomen.\n\n                      BASQUIAT (CONT'D)\n           Don't look at me like that. It hurts my\n           feelings.\n\nHe points. Unsure, Shenge picks up the brush and paints one of\nthe corners.\n\nMaria browses through a stack of paintings leaning against the\nwall.\n\n                      MARIA\n           I love these.\n\n                      ELLEN\n\n           God... I just can't even care anymore.\n           Compare this to a mountain or a tree.\n           Who're y'all trying to kid? That's what I\n           think. I was just in the Himalayas, and\n           like - OK - is this important? No. I mean,\n           compared to the rain forest or something?\n           These are just narcissistic jokes.\n\n                       MARIA\n                  (to Jean)\n           Who are you selling these through now?\n\nJean gets to his feet. He dips a long, thin brush into black\npaint and nonchalantly crosses out the half figure that Shenge is\ncarefully surrounding with blue.\n\n                       BASQUIAT\n           Well, that's better.\n                  (to Maria)\n           You can buy direct from me.\n\n                      ELLEN\n           Look at these - silkscreens? What're you?\n           Andy Warhol Junior? It's like - not even\n           handmade anymore.\n\nShe's not even worth a response. Jean looks around, numb.\n\n\nINT. MARY BOONE GALLERY - DAY\n\nJean enters the gallery. Cleaned up. Healthier. Bruises healing.\n\nHe looks like he's been painting.\n\nMary looks up from her desk, surprised to see Jean.\n\n                      MARY BOONE\n           Jean Michel... Crawling from the wreckage?\n\n                      BASQUIAT\n           I need a dealer.\n\n                      MARY BOONE\n           You have a bunch of them, don't you? Albert\n           Milo walks in from another room.\n\n                       ALBERT MILO\n           Hey Jean!\n                  (to Mary)\n           It'll never fit.\n\n                      MARY BOONE\n           It'll be ok.\n\n                      ALBERT MILO\n           You better take a look. Why's your door so\n           small? The ceilings are sixteen feet and\n           your door's the size of a mouse hole!\n\n                      MARY BOONE\n\n           Why are your paintings so big? Just go\n           home. I'll get it in.\n\n                       ALBERT MILO\n                  (to Jean)\n           You doing anything right now?\n\n                       BASQUIAT\n           Naa..\n\n                      ALBERT MILO\n           Let's get out of here.\n\n                       BASQUIAT\n           See ya in an hour.\n                  (to Mary)\n           So what do you think?\n\n                      MARY BOONE\n           Bruno spoke to me already. We could talk\n           about it.\n\n                       BASQUIAT\n           I'm here.\n\n                      MARY BOONE\n           OK. I'll be at your studio Thursday three\n           o'clock.\n\n\nINT. ALBERT MILO'S LOFT - DAY\n\nAlbert shows Jean through a series of large rooms filled with\nenormous paintings.\n\nIt looks like the Cairo Museum.\n\nThey pause before a painting.\n\n                      ALBERT MILO\n           This is painted on a backdrop from the\n           Kabuki theater in Japan. I painted it after\n           Joseph Beuys died. A rebirth painting. I\n           felt like he could've painted it, or maybe\n           someone else was painting it instead of me.\n           The Chinese calligraphers used to change\n           their name mid-career so they could start\n           over as someone else..\n\n                      BASQUIAT\n           Do you ever get sick of it?\n\n                       ALBERT MILO\n           Of what?\n\n                      BASQUIAT\n           The whole thing - painting.\n\n                      ALBERT MILO\n           No. It's one of the few times I feel good.\n           I used to have to go to work and cook every\n\n           day. That I got sick of.\n\n                      BASQUIAT\n           What about the shit they write?\n\n                      ALBERT MILO\n           You're asking me this because of the\n           'lapdog' remark. I read that. The person\n           that wrote that has the compassion of a\n           housefly. That's your enemy, not your\n           audience. Your audience hasn't even been\n           born yet. It's a lie that art is popular.\n           The only thing popular about it is that\n           it's written about in newspapers. I'm\n           surprised when anybody comes to my\n           openings. There're about ten people on the\n           planet who know anything about painting,\n           and Andy's one of them.\n\n                      BASQUIAT\n           I haven't felt like talking to him since\n           that thing came out.\n\n                      ALBERT MILO\n           As long as I've known Andy, he's never\n           asked me for anything except to speak to\n           you about getting off drugs. He's painted\n           my picture, we've eaten dinner in God knows\n           how many places together. But he doesn't\n           care about me. He cares about you. You're\n           the only person he cares about. He's your\n           friend. Fuck that article. You want a\n           toasted bagel with cream cheese?\n\nMilo's daughter STELLA (12) calls out from over the balcony.\n\n                      STELLA (O.S.)\n           Papa, the TV's broken... Will you fix it\n           please?\n\n                      ALBERT MILO\n           Alright. I'll be right up.\n\nAlbert leaves.\n\nJean looks at some paintings.\n\nStella comes downstairs.\n\n                       STELLA\n                  (to Jean)\n           Hi.\n\n                      BASQUIAT\n           Hi.\n\n                      STELLA\n           I've seen you before. I like your paintings\n           a lot. Your hair was different.\n\n                      BASQUIAT\n\n           You like your dad's paintings?\n\n                      STELLA\n           Some of them.\n\n                      BASQUIAT\n           Stand still.\n\nHe draws her.\n\n                      BASQUIAT (CONT'D)\n           See you later.\n\n                      STELLA\n           Thanks\n\nHe walks to the door, leaving the drawing on the floor.\n\nAlbert returns.\n\n                      ALBERT MILO\n           Where's Jean?\n\n                      STELLA\n           He just left.\n\nAlbert opens the door to the stairwell looking for Jean.\n\nHe hears the sound of URINATING.\n\nHe leans over the stairwell.\n\nHe sees Jean Michel, taking a piss on the landing.\n\nHe shuts the door quietly.\n\n\nEXT. GIFT SHOP WINDOW - DAY\n\nJean walks out of the gift shop (seen earlier, next to\nbeautician's)\n\n\nEXT. BROADWAY AND HOUSTON STREET - DAY\n\nJean walks through the middle of the intersection. He carries two\nyellow, furry toy ducks under his arm.\n\nSUPER: \"FEBRUARY 22, 1987\"\n\nSeeing Bruno at the wheel of a black Mercedes stopped at a light,\nJean clowns around like a street vendor who wants to wash his\nwindow.\n\nBruno doesn't notice him.\n\n                      BASQUIAT\n           B.B. It's me - Jean! What's the matter? No\n           snow in Switzerland this year?\n\n                      BRUNO\n\n           I didn't see you.\n\n                      BASQUIAT\n           What do you mean?\n\n                      BRUNO\n           You haven't heard? Andy's dead.\n\nThe light changes.\n\nBruno pulls across the street because of the traffic.\n\nJean drops one of the ducks in the street and walks off.\n\n\nANGLE ON\n\nThe duck lying in the street.\n\n\nEXT. GREAT JONES ST. LOFT - NIGHT\n\nThe \"OUT FOR RIBS\" sign hangs outside Jean's door.\n\n\nEXT. GREAT JONES ST - DAY\n\nMary sits in her limo trying to call Jean.\n\n\nINT. GREAT JONES ST. LOFT - DAY\n\nNear darkness. The curtains are drawn. Music plays: `Birds' by\nNeil Young: \"it's over.....it's over\".\n\nJean watches a video tape with the sound MUTED. The screen fills\nwith Andy's face. We SEE a series of quick scenes from his life.\n\nJean and the remaining duck are lit by the TV.\n\n\nINT. GREAT JONES ST. LOFT - DAY\n\nEXTREME CLOSEUP: A COLORED PENCIL TIP\n\nHeld in Jean's hand. It's stalled in mid-stroke. He writes with a\nmagic marker on the heel of two wooden clogs the word: \"TITANIC\"\n\nThere's a loud BANGING at the door.\n\nWhen it stops, the pencil tip resumes its long voyage across the\npage.\n\nMUSIC UP: Tom Waits' \"Tom Traubert's Blues\"\n\n\nEXT. GINA'S APARTMENT - DAY\n\nJean buzzes the doorbell. He's wearing the clogs. He's hurting.\nThe intercom comes on.\n\n                      BASQUIAT\n           Hello? Gina?\n\n                         MALE VOICE\n           Who is it?\n\nJean recognizes Benny's voice.\n\n\nANGLE UP\n\nGina and Benny look out the window into the street.\n\nJean's a block away.\n\n\nEXT. MENTAL HOSPITAL - NIGHT\n\nJean gets out of a cab. He walks up to the entrance.\n\nThe doors are locked. He rattles them.\n\nInside, an OLD JANITOR keeps mopping.\n\nJean pounds harder, RATTLES the doors more.\n\n                      BASQUIAT\n           Hey, come here! Please. Just for a second.\n           Open the door.\n\nThe janitor gets nervous. He leaves.\n\nHe returns a moment later with a large SECURITY GUARD.\n\n                      BASQUIAT\n           Open up! Open up!\n\nThe guard unlocks the door, hoping to settle Jean down.\n\n                      BASQUIAT (CONT'D)\n           My mother's inside.\n\n                       GUARD\n           Come back tomorrow. Visiting hours are\n           over.\n                  (beat)\n           Don't cause any trouble.\n\n                      BASQUIAT\n           I'm not here to visit... I wanna take her\n           home.\n\nThe guard gently ushers Jean out through the door.\n\n                      GUARD\n           Don't cause any trouble.\n\nHe locks the door and walks off with the janitor.\n\n\nEXT. STREET - DAYBREAK\n\nJean, walks around, drifting, stoned. He looks up at the skyline.\n\n                                                    DISSOLVE TO:\n\n\nWaves crash silently over a surfer.\n\n                                                    FADE TO BLACK\n\n                                                    FADE IN:\n\n\nSTREET SOUNDS\n\n                      BENNY (O.S.)\n           Willie Mays.\n\n                                                    FADE IN:\n\n\nEXT. STREET -   MORNING\n\nJean has been passed out on a sidewalk.\n\nCLOSE ON: Benny's face.\n\nHe leans over Jean and helps him up.\n\n                      BASQUIAT\n           Willie Mays... Nice to see you.\n\nBenny looks at Jean's eyes.\n\nJean stretches, kicking life back into his limbs.\n\n                      BASQUIAT (CONT'D)\n           How's Gina? You guys getting along?\n\nBenny looks at him guiltily.\n\n                          BENNY\n           She's good.\n\n                      BASQUIAT\n           I guess it was a long time ago.\n\n                      BENNY\n           Come on, let's get out of here.\n\n\nEXT. JEEP - STREETS - DAY\n\nJean and Benny zoom along in a battered old Army Jeep. Now\nrevived, Jean stands up, waving at people miming General Patton.\nWe HEAR the music of \"Summer of Siam.\"\n\n                      BENNY\n           Sit down! You're gonna fall out!\n\n                          BASQUIAT\n\n           Me fall? Let's get some drugs!\n\n                      BENNY\n           Drugs??!\n\n                      BASQUIAT\n           Medicine, man! Like health food. I'm taking\n           care of my health!\n\n\nINT. HEALTH FOOD STORE - DAY\n\nA mountain of homeopathic medicine and health food on the\ncounter. Benny helps the clerk load it into a box.\n\n                      CLERK\n           You starting a hospital?\n\nJean approaches and dumps some more stuff onto the counter.\n\nHe's chewing something.\n\n                       BASQUIAT\n           Just ring it up. I don't need a bag.\n                  (to Benny)\n           Try this tabouli - it's great...\n\nTabouli spills onto Jean's shirt.\n\n\nEXT - WEST BROADWAY - DAY\n\nJean and Benny walk along. Benny's arms are full with boxes.\n\nJean walks in front, eating yogurt. He's wearing his Titanic\nclogs. Benny tries to keep up.\n\n\n                      BASQUIAT (CONT'D)\n           My mom told me this... Or was it a dream?\n\n                                                  DISSOLVE TO:\n\n\nINT. CELL - DAY\n\nA crude stone jail - almost medieval - fairy-tale like. A thick\nwooden plank suspended by chains for a bench. A candle on the\nwall.\n\nA small, crowned prince (the boy seen in the dream in intro.)\nlooks longingly out the window at rolling green hills. Terraced\nhillsides, cedar trees, cottages, smoke wafting up from chimneys.\nDirt streets.\n\nThe prince smashes the window. He hits his head on the bars,\ngripping them tightly.\n\n\nEXT. MEDIEVAL VILLAGE' - DAY\n\nThe villagers cease their activities as they listen to the SOUND.\nLooking up, they smile, as if warmed to their souls by some\nunearthly and intangible substance. They look heavenwards.\n\nCAMERA follows their collective gaze skywards.\n\nWe shoot up, up, into the sky.\n\n                      BASQUIAT (O.S.)\n           There was this little prince with a magic\n           crown. An evil warlock kidnapped him,\n           locked him in a cell in a huge tower and\n           took away his voice. There was a window\n           made of bars. The prince would smash his\n           head against the bars hoping that someone\n           would hear the sound and find him. The\n           crown made the most beautiful sound that\n           anyone ever heard. You could hear the\n           ringing for miles. It was so beautiful,\n           that people wanted to grab the air. They\n           never found the prince. He never got out of\n           the room. But the sound he made filled\n           everything up with beauty.\n\n                      BASQUIAT (O.S)\n           It's definitely time to get out of here.\n\n\nEXT. WEST BROADWAY - DAY\n\nWe rush down, down through the sky.\n\nBuildings come up at us.\n\nWe're over Soho.\n\nWe're back on the ground.\n\nBenny and Jean continue walking.\n\nWe see Jean from behind. He's looking up.\n\nBenny stops to readjust his parcels.\n\nJean continues down the street, talking louder.\n\n                      BASQUIAT (CONT'D)\n           Hawaii? Fuck Hawaii. Let's go to Ireland.\n           We'll stop in every bar and have a drink.\n\n\nFREEZE FRAME ON HIS FACE\n\nSUPER:\n\n\"JEAN MICHEL BASQUIAT\nBORN: DECEMBER 14, 1961\nDIED: AUGUST 12, 1988\"\n\n\nEXT. IRELAND - DAY\n\nRolling hills. Green. Lush. Peaceful..\n\n                                         FADE OUT\n\n\n\nTHE END\n\n\n\n\n\nBasquiat\nWriters :   Julian Schnabel\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:25.258608"}