{"title": "Batman", "film_link": "/Movie Scripts/Batman Script.html", "script_link": "/scripts/Batman.html", "info_raw": "\n\nBatman Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.09 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Sam Hamm  Warren Skaaren\nGenres  Action  Crime  Fantasy  Thriller\nScript Date : October 1988\n\nRead \"Batman\" Script\n\n\n", "script": "\n\n\n\n   \"Batman\", early draft, by Sam Hamm\n\n\n\n   \n\n\n\n\n\n\n                           BATMAN\n\n\n\n                        Screenplay by\n\n                          Sam Hamm\n\n\n\n              Based on the Character Created by\n\n                          Bob Kane\n\n\n\n\n\n\n                                               FIRST DRAFT\n\n                                               October 20, 1986\n\n\n\n\n\n\n\n\n     FADE IN:\n\n     EXT. CITYSCAPE - NIGHT\n\n     The place is Gotham City. The time, 1987 -- once removed.\n\n     The city of Tomorrow: stark angles, creeping shadows, \n     dense, crowded, airless, a random tangle of steel and \n     concrete, self-generating, almost subterranean in its \n     aspect... as if hell had erupted through the sidewalks and \n     kept on growing. A dangling fat moon shines overhead, ready \n     to burst.\n\n     EXT. CATHEDRAL - NIGHT\n\n     Amid the chrome and glass sits a dark and ornate Gothic \n     anomaly: old City Cathedral, once grand, now abandoned -- \n     long since boarded up and scheduled for demolition.\n\n     On the rooftop far above us, STONE GARGOYLES gaze down from \n     their shadowy, windswept perches, keeping monstrous watch \n     over the distant streets below, sightless guardians of the \n     Gotham night.\n\n     One of them is moving.\n\n     EXT. GOTHAM SQUARE - NIGHT\n\n     The pulsing heart of downtown Gotham, a neon nightmare of \n     big-city corruption, almost surreal in its oppressiveness. \n     Hookers wave to drug dealers. Street hustlers slap high-\n     fives with three-card monte dealers. They all seem to know\n     each other... with one conspicuous exception:\n\n     A TOURIST FAMILY, Mom, Dad, and little Jimmy, staring \n     straight  ahead as they march in perfect lockstep down the \n     main drag. They've just come out of a bit show two blocks \n     over; the respectable theatre crowd has thinned out, and \n     now -- Playbills in hand -- they find themselves adrift in \n     the predatory traffic of Gotham's meanest street.\n\n                              MOM\n               For God's sake, Harold, can we\n               please just get a taxi??\n\n                              DAD\n               I'm trying to get a --\n                     (shouting)\n               TAXI!!\n\n     Three cabs streak pass and disappear. MOM grimaces in \n     frustration as LITTLE JIMMY consults a subway map.\n\n                              JIMMY\n               We're going the wrong way.\n\n     Nearby, STREET TYPES are beginning to snicker. DAD surveys \n     them nervously, gestures toward the subway map.\n\n                              DAD\n               Put that away. We'll look like\n               tourists.\n\n     TWO COPS lean on their patrol car outside an all-night \n     souvlaki stand, sipping coffee and chatting with a HOOKER. \n     The HOOKER smiles at JIMMY.  JIMMY smiles back. MOM yanks \n     him off down the street and glowers at DAD.\n\n                              DAD (cont.)\n               We'll never get a cab here. Let's\n               cut over to Seventh.\n\n                              JIMMY\n               Seventh is that way.\n\n                              DAD\n               I know where we are!\n\n     EXT. SIDE STREET - THAT MOMENT - NIGHT\n\n     A deserted access street, sidewalks lined with the husks of \n     stripped-down cars. MOM, DAD, and JIMMY take a deep breath \n     and march down the darkened street. A VOICE startles them.\n\n                              VOICE\n               Hey, mister. Gimme a dollar?\n\n     The VOICE belongs to a DERELICT -- nineteen or twenty, \n     acne-scarred -- who sits between two garbage cans, his palm \n     uplifted. His ratty t-shirt reads: 'I LOVE GOTHAM CITY.'\n\n     MOM, DAD, and JIMMY pause for the merest of seconds, then \n     move on -- pretending not to hear.\n\n                              DERELICT\n               Mister. How about it. One dollar?\n                     (standing up)\n               One dollar, man. Are you deaf?\n               Are you deaf? -- Do you speak\n               English??\n\n     By now the TOURISTS are halfway across the street. \n     Mercifully, the DERELICT doesn't seem to be following.\n\n     They pick up their pace. They don't see the SHADOWY FIGURE \n     in the alleyway. They don't see the GUN until a gloved hand \n     brings it down, butt-first, across the back of DAD's neck.\n\n     DAD crumples. MOM grabs JIMMY and backs up against a brick \n     wall, too terrified to scream. The DERELICT races across \n     the street to join his confederate, the STREET PUNK, who's \n     already searching for DAD's wallet.\n\n     MOM's mouth opens in panic. They can see she's about to \n     snap -- so  the STREET PUNK, still in a crouch, trains his \n     gun on JIMMY.\n\n                              STREET PUNK\n               Do the kid a favor, lady. Don't\n               scream.\n\n     The poor woman is utterly horrified. TEARS stream down her \n     face. But she keeps her wits about her, stifles the urge to \n     shriek, and hustles JIMMY off down the street.\n\n     The two PUNKS watch them break into a run -- then chuckle, \n     slap hands, race off in the opposite direction.\n\n     EXT. ROOFTOP - NIGHT\n\n     Six stories up. The PUNKS -- NICK and EDDIE -- hunker down \n     on the tar-and-gravel roof, sizing up their take.\n\n                              NICK\n                     (emptying the wallet)\n               All right. The Gold Card.\n                     (tossing the credit card\n                     in EDDIE's face)\n               Don't leave home without it.\n\n     A chill wind whips across the roof as NICK extracts the \n     cash and begins to count it. There's a distant, indistinct \n     CLANG: metal on metal. EDDIE hears it and tenses up.\n\n                              EDDIE\n               Let's beat it, man. I don't like\n               being up here.\n\n                              NICK\n               What, scared of heights?\n\n                              EDDIE\n               I dunno, man. After what happened to\n               Johnny Gobs --\n\n                              NICK\n               Look, Johnny Gobs got ripped and\n               walked off a roof, all right? No big\n               loss.\n\n                              EDDIE\n               That ain't what I heard. That ain't\n               what I heard at all.\n                     (beat)\n               I heard the bat got him.\n\n                              NICK\n               Gimme a break, will you? Shut up... \n\n                              EDDIE\n               Five stories, straight down. There\n               was no blood in the body.\n\n                              NICK\n               No shit. It was all over the\n               pavement.\n\n     NICK has no patience with campfire tales -- but here on the \n     roof, in the pale moonlight, he can't ignore the slight \n     tingle at the base of his spine... \n\n                              EDDIE\n               There was no blood, man.\n                     (beat)\n               My brother says... all the bad things\n               you done... they come back and\n               haunt you... \n\n                              NICK\n               Listen to this. How old are you?\n               There ain't no bat.\n\n                              EDDIE\n               My brother's a priest, man.\n\n                              NICK\n               No wonder you're such a chickenshit.\n               Now shut up.\n                     (conclusively)\n               There ain't no bat.\n\n     As they speak our attention shifts to a point at the \n     opposite corner of the roof, some fifteen yards away... \n     where, at the end of a line, a STRANGE BLACK SILHOUETTE is \n     dropping slowly, implacably, into frame... \n\n                              EDDIE\n               You shouldn'ta turned the gun on\n               that kid, man. You shouldn'ta --\n\n                              NICK\n               Do you want this money or don't\n               you? Now shut up! Shut up --\n\n     BOTH PUNKS FREEZE at the sudden, inexplicable sound of \n     BOOTS CRUNCHING ON GRAVEL. They turn slowly. Their JAWS \n     DROP.\n\n     Standing at the edge of the roof, bathed in moonlight, is a \n     BLACK APPARITION. IT DOES NOT MOVE.\n\n     EDDIE stands rooted to the spot, a choked gurgle in his \n     throat, as if he's just seen his own death. The BLACK \n     FIGURE advances, spreading  its arms. Or rather, its WINGS: \n     GREAT BLACK BATWINGS, flapping in the wind.\n\n     NICK drops to the gravel, gropes for the gun, brings it up.\n\n     And still the BLACK FIGURE draws closer, deliberate, \n     menacing. On its chest: THE EMBLEM OF A BAT, in an oval \n     yellow field, glowing like a target in the darkness... \n\n     NICK FIRES TWICE. TWO CLEAN HITS. The strange black figure \n     is knocked bodily to the roof.\n\n     Trembling, sweating buckets, NICK gets to his feet. He \n     whacks a motionless EDDIE on the arm --\n\n                              NICK (cont.)\n               I'm gettin' outta here.\n\n     -- and bends to retrieve his loot. EDDIE lets out a \n     strange, pre-verbal squeal... \n\n     ... and NICK sees THE HUMAN BAT, BACK ON ITS FEET, \n     NIGHTMARISH, UNDEAD, MOVING SLOWLY AND INEVITABLY CLOSER.\n\n     Panic. Sheer, raw, unrelenting panic. Stolen money flutters \n     out of NICK's hands. He scuttles around the periphery of \n     the roof, his feet skidding on the gravel as he searches \n     for a way down. The BLACK SPECTRE is blocking his path to \n     the fire escape. Trapped like a rat, NICK FIRES WILDLY.\n\n     EDDIE is frozen in place, his eyes glazed over, his face \n     drained of blood. The BAT treads calmly past. A LEG snakes \n     out. A BLACK BOOT catches EDDIE high on the chest --\n\n     -- LIFTS HIM CLEANLY OFF HIS FEET --\n\n     -- AND SENDS HIM FLYING THROUGH THE AIR. EDDIE slams into a \n     brick chimney and slumps to the roof unconscious, a broken, \n     weightless puppet.\n\n     THIS ACTION IS SO SMOOTH, SO AUTOMATIC, THAT THE BAT DOES \n     NOT EVEN BREAK HIS STRIDE. NICK sees his chance and CHARGES \n     past the black wraith, scrambling toward the fire escape... \n\n     A GLOVED HAND slices through the air, and NICK pitches \n     forward, his legs ensnared in a tangle of WIRES. Screaming \n     now, he drags himself across the gravel roof, the looming \n     figure of the BAT at his heels... \n\n     ... until there's no place left to go. NICK cowers against \n     the ledge, his pants torn, his hands and knees bloody. He \n     has dissolved into total mindless hysteria.\n\n     Almost by reflex, NICK keeps shooting. He'd do better if he \n     could manage to open his eyes. By now the hammer is falling \n     on an empty chamber, but NICK continues, obsessively, to \n     pull the trigger. He weeps; he moans; he wails... \n\n     THE BAT grabs a fistful of NICK's shirt, and with \n     supernatural ease HOISTS HIM into the air.\n\n                              NICK (cont.)\n               Don't kill me... don't kill me... \n\n     When NICK finally opens his eyes, he realizes THE BAT is \n     standing on the ledge of the roof -- HOLDING HIM OUT, at \n     arm's length, over six stories of nothingness.\n\n     The gruesome black apparition speaks, in a rasping whisper:\n\n                              BATMAN\n               I won't kill you. I want you to do\n               me a favor.\n\n     NICK looks down. Far, far below, CARS wink silently past.\n\n     He looks up. And sees, in the mirrored lenses where \n     BATMAN's eyes should be, the twin reflections of his own \n     stricken face.\n\n                              BATMAN (cont.)\n               Tell your friends. Tell all your\n               friends.\n\n     NICK HOWLS. Almost as an afterthought, THE BATMAN heaves \n     him roughly back onto the roof. And then -- casually, \n     without a moment's hesitation -- STEPS OFF THE LEDGE OF THE \n     ROOF, INTO MIDAIR.\n\n     Trembling, NICK crawls to the ledge and looks over... \n     finding ABSOLUTELY NO TRACE of the Batman.\n\n     NICK is still screaming as we PAN UP to the bilious yellow \n     globe of Gotham's moon. MAIN CREDITS ROLL:\n\n                              BATMAN\n\n                                                 CUT TO:\n\n     INT. GOTHAM CITY DEMOCRATS' CLUB - NIGHT\n\n     An oversized CAMPAIGN POSTER fills one wall: \"A NEW GOTHAM. \n     HARVEY DENT FOR DISTRICT ATTORNEY\". We TILT DOWN to find \n     the man himself, determined, dynamic HARVEY DENT, \n     addressing a crowd from behind his podium.\n\n                              DENT\n               ... it is no longer enough to go\n               after the small-time punks and petty\n               criminals who infest the streets of\n               Gotham City. Crime and corruption\n               must be attacked at the root!\n\n     ANOTHER ANGLE - THE AUDIENCE\n\n     Civic-minded politicos decked out in fund-raiser finery. \n     They applaud DENT's tough talk wildly. They've just shelled \n     out $500 a plate for a chicken dinner, and by God they're \n     going to enjoy this.\n\n     Tuxedoed WAITERS move among the tables, deftly refilling \n     water glasses. As they do, we SEE an EMPTY PLACE SETTING -- \n     the only one in the hall. Some well-meaning moneybags has \n     laid out half a grand and then neglected to show up.\n\n     The engraved placecard reads: BRUCE WAYNE.\n\n     ANGLE ON DENT\n\n                              DENT\n               If elected, my first act as district\n               attorney will be to return an\n               indictment against Boss Carl\n               Grissom!\n\n                                                 CUT TO:\n\n     INT. APARTMENT - NIGHT\n\n     A woman's apartment, decorated in pastel pinks and mauves. \n     Original paintings and sculptures everywhere. The place \n     reeks of money.\n\n     In the foreground: a MAN'S HAND, long, elegant, manicured.\n     Manipulating a DECK OF CARDS, doing a one-handed shuffle \n     with extraordinary finesse.\n\n     In the background: a TV set tuned to the 11 o'clock news, \n     with highlights of HARVEY DENT's campaign speech.\n\n                              DENT\n                     (on the TV screen)\n               Together we can make Gotham city a\n               safe place for decent people to live\n               and work and play.\n\n     THE HAND sets the deck on an end table, raps it twice, \n     turns up four aces off the top. This most unusual deck \n     sports a .22 calibre BULLET HOLE straight through the \n     middle.\n\n                              JACK NAPIER\n               Decent people shouldn't live here.\n               They'd be much happier someplace\n               else.\n\n     JACK NAPIER, 32, is right-hand man and chief enforcer to \n     Boss Carl Grissom. His features are delicate, almost \n     feminine, and he takes a vain, gangsterish pride in his \n     appearance. He is also absolutely merciless.\n\n     He trains a cold eye on DENT's televised image as ALICIA \n     HUNT -- 26, beautiful, Carl Grissom's kept woman -- glides \n     over in her negligee and snuggles up.\n\n                              ALICIA\n               Anything new?\n\n                              JACK\n               The usual gas. If this clown could\n               lay a hand on Grissom... I would've\n               had to kill him by now.\n\n     ALICIA finds JACK's necktie draped over a nearby chair. She \n     begins knotting it playfully about his neck.\n\n                              ALICIA\n               If Grissom knew about us... he\n               might kill you.\n\n     JACK seems uninterested in her affections. His eye darts \n     back and forth between the TV and his own reflection in a \n     nearby vanity.\n\n                              JACK\n               Don't think so, angel. I'm too\n               valuable. That's the way I've\n               planned it.\n                     (pause)\n               And besides, he doesn't know.\n\n     JACK checks his watch, reaches for his topcoat, and stands \n     in front of the vanity. He runs a hand through sculpted \n     hair, checks out his Albert Nipon ensemble.\n\n                              ALICIA\n               You look just fine, Jack.\n\n     He smiles at himself before turning to the door.\n\n                              JACK\n               ... I didn't ask.\n\n                                                 CUT TO:\n\n     EXT. ALLEYWAY - NIGHT\n\n     The scene of the earlier mugging, a half-block off Gotham \n     Square. Only now, the deserted alleyway is a beehive of \n     activity: police cars, an ambulance, a forensics van.\n\n     EDDIE THE PUNK goes past on a stretcher, catatonic. \n     Watching him are a porcine cop, LT. ECKHARDT, and a POLICE \n     MEDIC.\n\n                              MEDIC\n               That one there won't say a word. The\n               other one's raving his head off.\n\n                              ECKHARDT\n               Variety, huh? The spice of life.\n\n     At the mouth of the alley, we find ALEXANDER KNOX --\n     thirty, hyperactive, a crime reporter for the Gotham\n     Gazette. At the moment, he's chatting with a uniformed\n     PATROLMAN.\n\n                              PATROLMAN\n               They found him hugging a drainpipe.\n               He was scared to come off the roof.\n\n                              KNOX\n               Great, but tell me: is this another\n               you-know-what? 'Cause if so, it's\n               the third one this week.\n\n                              PATROLMAN\n                     (testily)\n               I dunno. What's \"what\"?\n\n                              KNOX\n               Good answer. I'm gonna put you in\n               for a commendation.\n\n     KNOX spots ECKHARDT and the MEDIC, waves cheerily, and \n     saunters down the alley. ECKHARDT curses under his breath.\n\n                              ECKHARDT\n               Oh Christ, it's Knox.\n\n                              KNOX\n               Hiya, gents. This anything I should\n               know about?\n\n                              ECKHARDT\n               Nothing out of the routine.\n\n     At this exact moment two uniformed PATROLMEN drag a brain-\n     fried NICK past the mouth of the alley.\n\n                              NICK\n               A bat, I tell you, a giant bat!\n               He wanted me to do him a favor...!\n\n     KNOX tilts one eyebrow. ECKHARDT and the MEDIC trade \n     disgusted looks.\n\n                              KNOX\n               No offense, boys, but these guys are\n               seeing something up there.\n\n                              ECKHARDT\n               No comment. Print what you like.\n\n                              KNOX\n               Come on. One question. Is there a\n               six-foot bat in Gotham City?\n\n     KNOX's tone is jokey, but only half-jokey. ECKHARDT snorts \n     in disgust and turns away. KNOX shouts after him:\n\n                              KNOX (cont.)\n               If so, is he on the police payroll?\n               If so, what's he pulling down after\n               taxes?\n\n     EXT. STREET - THAT MOMENT - NIGHT\n\n     We pick up LT. ECKHARDT as he emerges onto the side street. \n     He's headed for his car when he spies a STRETCH LIMO idling \n     across the street. Leaning on the hood, waving hi, is the \n     dandyish JACK NAPIER -- flanked by two impressive GOONS.\n\n     ECKHARDT throws a nervous glance back in KNOX's direction. \n     He turns left, gestures to JACK to meet him farther up the \n     block. By the time he reaches the corner JACK has swaggered \n     up alongside him.\n\n     ECKHARDT takes a fat brown envelope from JACK and stuffs it \n     quickly in his coat.\n\n                              JACK\n               You didn't show up.\n\n                              ECKHARDT\n               We had another bat sighting.\n\n                              JACK\n               I'm sure that was vitally important.\n               Listen: things are heating up.\n               Someone is leaking information to\n               Harvey Dent.\n\n     ECKHARDT bristles. There's no love lost between these two.\n\n                              ECKHARDT\n               I'm doing the best I can. If it's a\n               problem --\n\n                              JACK\n               Eckhardt... our problems are your\n               problems.\n\n                              ECKHARDT\n               I'll work on it.\n\n     JACK reaches out and grabs ECKHARDT by the lapels of his \n     topcoat -- an Italian job, obviously expensive. He rubs the \n     material between his fingers.\n\n                              JACK\n               Very nice, Lieutenant. But a little\n               ostentatious on a cop's salary,\n               don't you think?\n\n                              ECKHARDT\n                     (knocking his hands away)\n               I answer to Grissom, punk. Not to\n               you.\n\n                              JACK\n               You're a smart boy, Eckhardt. You\n               should be thinking about the future.\n\n     ECKHARDT laughs in his face.\n\n                              ECKHARDT\n               Ambition.\n                     (nodding his head)\n               Forget it, Jack. You'll never run\n               that organization.\n\n                              JACK\n               And why's that?\n\n                              ECKHARDT\n               You're a psycho, friend. You're an\n               A-one crazy boy and Grissom knows\n               it.\n\n     JACK lashes out and BACKHANDS ECKHARDT across the face. The \n     fat cop, stunned, turns bright red and CHARGES JACK.\n\n     JACK claps a hand on ECKHARDT's face and shoves him back \n     full-force. The cop sprawls on his ass in the doorway of an \n     all-night Cuban-Chinese restaurant.\n\n     By now PATRONS are staring out of the restaurant windows. \n     ECKHARDT is livid. His hand goes instinctively to his gun.\n\n                              JACK\n               Here. Use mine.\n\n     JACK pulls an automatic from his pocket and tosses it in \n     ECKHARDT's lap. He looks down and laughs, daring ECKHARDT \n     to pick it up -- just as the two enormous GOONS from the \n     stretch limo appear behind him for reinforcement.\n\n     ECKHARDT wipes blood from his mouth as JACK -- an A-one \n     crazy-boy grin on his face -- reaches down for the gun.\n\n                              JACK (cont.)\n               It's all right, boys. Lt. Eckhardt\n               here is a good cop. A real good cop.\n                     (pause; smiling)\n               Inexpensive.\n\n                                                 DISSOLVE TO:\n\n     INT. GOTHAM GLOBE - CITY ROOM - DAY\n\n     Gotham city's leading tabloid daily. COPY BOYS rush to and \n     fro; REPORTERS pound out articles on computer terminals. \n     ALEXANDER KNOX saunters in, a sheath of typed pages in his \n     hand, and pauses at a CARTOONIST's drawing table.\n\n                              KNOX\n               What have you got for me, Jerry?\n\n     JERRY holds up a cartoon: a HUMAN BAT, with an awful, \n     fanged rodent's face, wearing a business suit. The caption \n     at the top reads: \"HAVE YOU SEEN THIS MAN?\"  KNOX nods in \n     approval.\n\n                              KNOX (cont.)\n               Nice, but... maybe a little more gore\n               on the fangs, huh?\n\n     He pats JERRY on the shoulder, moves on. A BESPECTACLED \n     COLLEAGUE spots him and calls out:\n\n                              COLLEAGUE\n               Hey Knox, you got a visitor.\n\n                              KNOX\n               I'm real busy, Clark. Be a pal and\n               dust him, okay?\n\n                              COLLEAGUE\n               This one you might want to dust\n               yourself.\n\n     Curiosity piqued, KNOX moves toward his desk... and stops \n     in his tracks. Propped up on the desk are a PAIR OF LEGS. \n     The legs -- exceptionally nice ones -- are attached to a \n     WOMAN leaning back in KNOX's swivel chair, taking a nap, \n     her face obscured by a big outrageous hat.\n\n                              KNOX\n               ... Vicki Vale.\n\n     The hat tips back. VICKI VALE, her face framed by a shock \n     of bright red hair, flashes a dazzling smile. She pulls \n     KNOX over for a quick smooch and laughs.\n\n                              VICKI\n               How'd you know it was me?\n\n                              KNOX\n               Honey -- I would know any randomly\n               selected square inch of Vicki\n               Vale.\n                     (grinning)\n               If I had a good enough hint.\n\n     He points at the oversized CAMERA BAG on his desk. It bears \n     the monogram \"V.V.\"  VICKI catches on, makes a face at him.\n\n                              KNOX (cont.)\n               Where the hell have you been?\n\n                              VICKI\n               A nice, restful vacation.\n\n     She reaches into the camera bag and pulls out a stack of \n     glossy 8x10's: COMBAT PHOTOS from some unspecified war-torn \n     corner of the world. KNOX leafs though them, impressed.\n\n                              KNOX\n               God, a girl could get hurt doing\n               this.\n\n                              VICKI\n               I do get hurt.\n\n     She unbuttons her sleeve, rolls it back to show KNOX a long \n     fresh scar on the inside of her arm. He winces -- then \n     points to the scar and adds, slyly:\n\n                              KNOX\n               Got any more of those?\n\n                              VICKI\n               Nothing I'm at liberty to reveal\n               here. What's new and hot in Gotham\n               City?\n\n                              KNOX\n               It's too good, Vick. We got a six-\n               foot bat that swoops out of the\n               night and preys on evildoers.\n\n                              VICKI\n                     (laughing)\n               Evildoers, huh? Big or small?\n\n                              KNOX\n               Small so far. I mean -- they don't\n               allow bats in boardrooms, do they.\n\n                              VICKI\n               Speaking of which... I hear the\n               notorious Bruce Wayne is throwing a\n               big do for the Harvey Dent campaign.\n\n                              KNOX\n               Yeah. Hottest ticket in town. Every\n               law'n'order freak in the city's\n               gonna be there.\n\n     KNOX suddenly freezes. It's just occurred to him that VICKI \n     may have a purpose in all this.\n\n                              KNOX (cont.)\n               Wa-a-it. Vicki. You're not saying --\n\n     She reaches back into her camera bag and hands over an \n     INVITATION. KNOX is all but panting with excitement.\n\n                              KNOX (cont.)\n               Aw, Vicki. Vicki!\n                     (apprehensively)\n               Got a date?\n\n     She flutters her great big eyelashes, shakes her head no. \n     KNOX grabs her face and plants a kiss on her forehead, \n     nearly knocking her out of the swivel chair.\n\n                              KNOX (cont.)\n               Vicki, baby, I love you, I've always\n               loved you. Will you marry me?\n\n                              VICKI\n                     (straightening her clothes)\n               No.\n\n                              KNOX\n               Well, I'm starving. Will you at\n               least buy me a hamburger?\n\n                              VICKI\n               Yes, but please -- be gentle.\n\n     Overwhelmed with glee, he offers her his arm.\n\n                                                 CUT TO:\n\n     INT. PENTHOUSE - DAY\n\n     A HUGE PLATE GLASS WINDOW opens on the best view in Gotham. \n     This spectacular penthouse suite is just one of the power \n     perks available to CARL GRISSOM, kingpin of the Gotham City \n     rackets, fat, fifty, and utterly without charm.\n\n     GRISSOM, behind a big broad desk, addresses his LIEUTENANTS \n     -- a fearsome assemblage of bloodless white-collar types \n     and few outright goons, sprawled in chairs throughout this \n     makeshift 'boardroom.'  The big boss waves a copy of the \n     Gotham Globe -- with HARVEY DENT's face on the cover.\n\n                              GRISSOM\n               Nine points ahead in the new poll. I\n               don't like the way this is shaping\n               up.\n\n     JACK NAPIER slouches in an easy chair off to GRISSOM's \n     right, doing his trademark one-handed shuffle.\n\n                              JACK\n               We can always pop him. -- Or pop\n               someone close to him.\n\n                              LIEUTENANT\n               Let's feed him to the bat.\n\n     This suggestion draws CHUCKLES from several members of the \n     crowd. GRISSOM is unamused.\n\n                              GRISSOM\n               He's going after our front\n               companies. Specifically Ace\n               Chemical. Which would tie us\n               in with Councilman Kane, Senator\n               Miller... on up the line.\n                     (pause)\n               We have to clean out our files\n               before the subpoena comes down.\n\n                              LIEUTENANT\n               How do we go? The usual fire?\n\n                              GRISSOM\n               I'm thinking break-in. Trash the\n               office, remove the relevant\n               documents... \n\n                              JACK\n               \"Industrial espionage.\"\n\n                              GRISSOM\n               That's right. And Jack --\n                     (pause)\n               I'd like you to handle this\n               operation personally.\n\n     JACK has just turned up the third ace off the top of the \n     deck. His hand freezes in midair.\n\n                              JACK\n               ... Me?\n\n     At this exact moment, METAL DOORS slide back -- and ALICIA \n     HUNT steps out of GRISSOM's private penthouse elevator. \n     She's carrying a handful of SHOPPING BAGS.\n\n                              GRISSOM\n               Hello, sweetheart. I wonder if you'd\n               mind waiting in the other room.\n\n     ALICIA's gaze meets JACK's as she vanishes through a side \n     door. The eye contact is not lost on GRISSOM.\n\n                              JACK\n               Why do you need me to handle a\n               simple break-in?\n\n                              GRISSOM\n                     (emphatically)\n               Because I want someone I can\n               trust.\n\n     JACK bridles, but doesn't protest. Nervously, he turns the \n     fourth card off the top of the deck. It's not an ace.\n\n     It's a JOKER -- a Joker with a neat, round, .22 calibre \n     HOLE through its face.\n\n                              GRISSOM (cont.)\n               We'll work out the details later.\n               But it's got to be soon. -- All\n               right, that's all for now.\n\n     GRISSOM'S CRONIES get up to go. JACK, troubled, lingers \n     behind a moment.\n\n                              GRISSOM (cont.)\n               You don't mind, do you Jack? It's an\n               important job. I can't trust it to\n               somebody who'll screw up.\n\n                              JACK\n               I understand.\n\n                              GRISSOM\n                     (smiling)\n               Jack. Don't forget your lucky deck.\n\n     JACK pockets the deck and leaves. GRISSOM sits behind the \n     big desk and GRINS WOLFISHLY.\n\n                              GRISSOM (cont.)\n               My friend, your luck is just about\n               to change.\n\n     He reaches for the phone. ALICIA appears in the doorway \n     nearby, modeling her new purchases for him. He smiles \n     coolly at her as he speaks into the receiver.\n\n                              GRISSOM (cont.)\n               Get me Lieutenant Eckhardt.\n\n                                                 CUT TO:\n\n     EXT. WAYNE MANOR - ESTABLISHING - NIGHT\n\n     A vast, rambling mansion on sixty wooded acres a half-\n     hour's drive from Gotham: old money, and how. Out front, a \n     team of red-jacketed VALETS are parking expensive cars.\n\n     INT. BALLROOM - NIGHT\n\n     A DEALER'S HAND pushes cards out of a shoe (the card kind, \n     not the Florsheim kind). It's casino night at Wayne Manor; \n     the ballroom has been outfitted with roulette wheels, \n     blackjack tables, etc., and the various members of Gotham's \n     power elite are happily -- and legally -- throwing money \n     into Harvey Dent's campaign kitty.\n\n     DENT himself is surrounded by a gang of political cronies, \n     telling jokes, calling in favors. VICKI's off in another \n     group, looking luscious, drawing compliments from big shots \n     and envious, furtive glances from their wives. And, in a \n     corner of the room, all alone in his cheap suit, stands \n     ALEXANDER KNOX -- staring inquisitively up at the ceiling.\n\n     A butler, ALFRED, appears alongside KNOX with a trayful of \n     champagne glasses. He too looks up at the ceiling.\n\n                              KNOX\n               How high up would you say that is?\n\n                              ALFRED\n               I'd say about thirty feet, sir.\n\n                              KNOX\n               You know, if you cut your bathroom\n               in half, you'd have my apartment.\n\n                              ALFRED\n               Which bathroom is that, air?\n\n                              KNOX\n               The small one.\n\n     KNOX takes a drink and ALFRED moves on. A moment later, \n     VICKI detaches herself from her little circle of admirers \n     and hooks up with KNOX.\n\n                              KNOX (cont.)\n               Man, I feel like Robin Leach. You\n               actually know all these people?\n\n                              VICKI\n               Some. I am a rich bitch, remember.\n                     (pause)\n               I'm quoting.\n\n     KNOX winces at the reminder. She smiles and takes his arm.\n\n                              KNOX\n               Yeah, I guess we move in different\n               circles. -- Though I did meet a\n               one-eyed pimp last week.\n\n     ANGLE ON JAMES W. GORDON\n\n     Gotham's Police Commissioner, a distinguished-looking gent \n     in his late fifties. He's at a craps table, blowing into \n     his fist. ONLOOKERS root him on as he lets the dice fly.\n\n     Snake eyes. Crapped out. GORDON passes the dice as KNOX and \n     VICKI wander up alongside him.\n\n                              KNOX\n               Commissioner Gordon! What do you\n               hear from our pointy-eared friend?\n\n     KNOX puts his hands up behind his head and wiggles his \n     fingers -- like little bat ears. GORDON groans.\n\n                              GORDON\n               Knox, for the ninth time, and you\n               can quote me -- there is no bat.\n\n                              KNOX\n               Aww, Commissioner. There's gotta be\n               one honest cop in Gotham city.\n\n     HARVEY DENT is working the room. He ambles up, claps a \n     friendly hand on GORDON's shoulder.\n\n                              DENT\n               How's your luck, Jim?\n\n                              KNOX\n               Mr. Dent. What's your stand on\n               winged vigilantes?\n\n     DENT exchanges a meaningful look with GORDON.\n\n                              DENT\n               Mr. Knox, I think we have enough\n               real problems in this city without\n               worrying about ghosts and goblins\n               and Halloween characters.\n\n                                                 CUT TO:\n\n     EXT. ACE CHEMICAL CO. ESTABLISHING - NIGHT\n\n     A NEON SIGN reads: \"ACE CHEMICAL. FOR A MODERN TOMORROW.\"  \n     From the SIGN we pan over to a METAL SLUICE GATE -- dumping \n     TONS of CHURNING TOXIC SLUDGE into Gotham's East River.\n\n     INT. VAN - THAT MOMENT - NIGHT\n\n     TIGHT ON the rear-view mirror. JACK NAPIER is meticulously \n     applying BLACK CAMOUFLAGE PAINT to his face. He could be \n     getting ready for a date.\n\n     The van is parked outside a chain-link fence which \n     surrounds the Ace Chemical complex.\n\n     JACK'S POV - THROUGH WINDSHIELD\n\n     The SECURITY GUARD in a glass booth at the entrance to the \n     parking lot. ONE OF JACK'S BOYS creeps up behind the booth \n     and takes the GUARD out.\n\n     INT. VAN - ON JACK\n\n     He turns the key in the ignition, shifts into first.\n\n                                                 CUT TO:\n\n     INT. WAYNE MANOR - NIGHT\n\n     KNOX and VICKI are taking an unauthorized tour of BRUCE's \n     house, wandering through rooms decorated in wildly \n     divergent motifs, eyeing an astounding collection of \n     artworks and antiques from every corner of the world.\n\n                              KNOX\n               My question is, where does one man\n               get all this junk.\n\n                              VICKI\n               All over the world. They say he\n               spends most of the year overseas --\n               until recently, anyway.\n\n                              KNOX\n               Holy shit... \n\n     KNOX goes goggle-eyed as they enter the LIBRARY.\n\n     INT. BRUCE WAYNE'S LIBRARY - NIGHT\n\n                              KNOX (cont.)\n               ... We found the arsenal.\n\n     One wall is lined to the ceiling with leather-bound \n     volumes. On the other walls hang EXOTIC WEAPONS. Halberds. \n     Maces. Blowguns. Bolas. Thugee ropes and samurai swords... \n     every arcane implement of death the human mind has ever \n     devised. KNOX lets out a low whistle.\n\n                              KNOX (cont.)\n               This guy has just gotten\n               interesting. What else do you know?\n\n                              VICKI\n               Just what I've heard. Rich.\n               Reclusive. Old money and lots of it.\n\n                              KNOX\n               Likes to kill?\n\n                              VICKI\n                     (smiling)\n               Women find him magnetic.\n\n                              KNOX\n               I bet they like him for his big\n               charity balls.\n\n                              VICKI\n               That, and the sweet smell of two\n               hundred million bucks.\n\n                              KNOX\n               Well, you know me. The more they've\n               got, the less they're worth.\n                     (scanning the room)\n               This guy must be the most worthless\n               man in America.\n\n     Just then, A VOICE FROM BEHIND intrudes.\n\n                              BRUCE WAYNE\n               You disappoint me. Why not the\n               world?\n\n     KNOX turns. We get our first good look at the smiling face \n     of BRUCE WAYNE: 32, tall, athletic, impeccably mannered... \n     and intensely handsome.\n\n                              KNOX\n               I assume in my usual charming manner\n               I've just insulted the host.\n                     (extending a hand)\n               Alexander Knox.\n\n                              BRUCE\n               Bruce Wayne. -- I've read your work.\n               I quite like it.\n\n                              KNOX\n               Great. Give me a grant.\n\n                              BRUCE\n               I might consider it if you introduce\n               me to Miss Vale.\n\n     KNOX blinks at VICKI. BRUCE already seems to know who she \n     is. KNOX shrugs and forges bravely ahead:\n\n                              KNOX\n               \"This is Miss Vale.\" -- That felt\n               redundant.\n\n                              BRUCE\n                     (to VICKI)\n               You're just back from Corto Maltese.\n               I saw your combat photos. Quite a\n               departure for you.\n\n                              VICKI\n               That's intriguing. They haven't been\n               published yet.\n\n     BRUCE smiles and ignores the implied question.\n\n                              BRUCE\n               ... You have an extraordinary eye.\n\n     He's laying on the charm now. KNOX, his territorial \n     instincts aroused, pipes up:\n\n                              KNOX\n               Some people think she has two.\n\n     VICKI shoots KNOX a sidelong glance:\n\n                              VICKI\n               Don't mind my friend. He's a little\n               nervous tonight.\n\n     KNOX, chastened, calls off the dogs and sizes up his \n     competition. BRUCE is charming, all right, but there's \n     something formal, maybe even calculating about it -- he\n     could be reading his clever remarks off cue cards. It's \n     almost as though he's an actor doing a brilliant imitation \n     of charm.\n\n     This is a man who thinks three moves ahead. KNOX doesn't\n     like him. But VICKI -- who's used to seeing male charm \n     turned on and off, at will -- doesn't seem to mind at all:\n\n                              VICKI (cont.)\n               This is an amazing house. I'd love\n               to shoot it sometime.\n\n                              BRUCE\n               I don't... seek publicity. -- Will\n               you be staying in Gotham for a\n               while?\n\n                              VICKI\n               As far as I know.\n\n                              BRUCE\n               Good. Then with any luck we'll run\n               into each other.\n\n     Suddenly ALFRED, the butler, appears in the doorway behind \n     them. He clears his throat. BRUCE turns.\n\n                              ALFRED\n               Excuse me, sir. Commissioner Gordon\n               was compelled to leave -- very\n               unexpectedly. He asked me to convey\n               his regrets.\n\n                              BRUCE\n               Thank you, Alfred.\n                     (to VICKI)\n               I hope you'll excuse me. It was a\n               great pleasure meeting you.\n                     (to KNOX)\n               And you.\n\n     Without bothering to shake hands BRUCE does a sharp 180 and \n     strides hurriedly out of the room.\n\n                              KNOX\n               I know the rich are different, but\n               that guy is real different.\n\n     VICKI, staring off after BRUCE, doesn't seem to hear him.\n\n                              KNOX (cont.)\n               Hello? Vicki?\n\n                              VICKI\n               Oh. Sorry. I was thinking.\n\n                              KNOX\n               What were you thinking?\n\n                              VICKI\n               Yum, yum.\n\n                              KNOX\n               Well, he must like the way he\n               looks. He's got a mirror in every\n               room.\n\n     And indeed, the two of them are standing before an enormous \n     WALL MIRROR, eight feet wide, running from floor to \n     ceiling.\n\n                              VICKI\n               I get it. Bruce Vain.\n\n     She pokes KNOX. He groans at the dumb pun. And suddenly we\n\n                                                 CUT TO:\n\n     REVERSE ANGLE - THROUGH THE MIRROR\n\n     looking DOWN ON KNOX and VICKI -- THROUGH ONE-WAY GLASS -- \n     as they continue to chat. Behind the mirror... recording \n     everything that happens in the room... is a small, silent, \n     state-of-the-art SURVEILLANCE CAMERA.\n\n     CLOSEUP - VIDEO MONITOR\n\n     showing KNOX and VICKI in the library. CAMERA PULLS BACK to \n     reveal that the screen we're watching is only one in a \n     whole vast bank of video monitors. From this control \n     center, we can see everything that's happening in the \n     house.\n\n     Now we ZERO IN on a single screen: GUESTS moving backward, \n     with exaggerated speed, as a videotape REWINDS.\n\n     At the panel, BRUCE WAYNE hits a button. And now we see \n     COMMISSIONER GORDON talking to a uniformed POLICEMAN.\n\n                              PATROLMAN\n               ... anonymous tip. Tonight. The Ace\n               Chemical Company.\n\n                              GORDON\n                     (obviously agitated)\n               Good Lord, it we could put our hands\n               on Jack Napier... Why wasn't I told\n               about this? Who's in charge of\n               the --\n\n                              PATROLMAN\n               Lt. Eckhardt, sir.\n\n                              GORDON\n               Eckhardt. Oh my God... \n\n     And suddenly COMMISSIONER GORDON is grabbing for his coat. \n     The monitor goes black. BRUCE reaches up, loosens his tie.\n\n                                                 CUT TO:\n\n     EXT. ACE CHEMICAL CO. - PARKING LOT - NIGHT\n\n     UNMARKED POLICE CARS are pulling into the lot, headlights \n     off. ECKHARDT circulates among his ARMED SWAT TEAM, handing \n     out xeroxed copies of a PHOTOGRAPH.\n\n     The PHOTOGRAPH is a full-face shot of JACK NAPIER.\n\n                              ECKHARDT\n               Shoot to kill.\n\n     INT. ACE CHEMICAL - FILE ROOM - NIGHT\n\n     SPARKS FLY. A SAFECRACKER, in welder's mask, trains a \n     blowtorch on the office safe. Behind him, JACK'S HOODS are \n     at work on the filing cabinets.\n\n     The SAFECRACKER kills his blowtorch and opens the metal \n     door of the safe, giving JACK a good look at its contents:\n\n                              SAFECRACKER\n               ... Empty.\n\n                              HOOD I\n               Just like the file cabinets.\n\n                              HOOD II\n               I don't get it. If this place is\n               cleaned out already, what do we need\n               five men?\n\n     JACK shakes his head. His boys are antsy, ready to mutiny. \n     By now it's depressingly obvious: they've been set up.\n\n     Then, as if they needed any proof -- a SIREN blares \n     outside.\n\n     EXT. ACE CHEMICAL - NIGHT\n\n     ECKHARDT'S SWAT TEAM goes wide-eyed as a CONVOY OF POLICE \n     BLACK-AND-WHITES roars into the Ace parking lot. UNIFORMED \n     COPS pile out of their squad cars, relieving the SWAT TEAM. \n     ECKHARDT goes livid as COMMISSIONER GORDON approaches.\n\n                              ECKHARDT\n               What are you trying to do, blow the\n               collar?\n\n                              GORDON\n                     (to SWAT TEAM)\n               You men are dismissed. We'll take\n               over from here.\n                     (to UNIFORMED COPS)\n               Any man who opens fire on Jack\n               Napier... will answer to me.\n\n     ECKHARDT tries to slink off. GORDON grabs him roughly.\n\n                              GORDON (cont.)\n               You. Stick around.\n\n     INT. ACE CHEMICAL - THAT MOMENT\n\n     JACK and his HOODS ducking out of the office. It's two \n     stories above the refinery floor, accessible by a network \n     of steel ladders and CATWALKS running between the walls.\n\n     Down below, a CORRUGATED METAL DOOR begins to rise.\n\n                              COP\n               Freeze!\n\n     One hood goes into a crouch and OPENS FIRE. Half of his \n     colleagues dive back into the office, looking for a rear \n     exit. The others take off across the CATWALKS.\n\n     ANGLE ON GORDON\n\n     standing in the doorway as his MEN rush into the building \n     and take their places behind heavy machinery. SHOTS RING \n     OUT as the HOODS scatter.\n\n                              ECKHARDT\n                     (snidely)\n               Nice work, Commissioner.\n\n                              GORDON\n               I'm in charge here. Not Carl\n               Grissom.\n\n     INT. HALLWAY - THAT MOMENT\n\n     TWO HOODS run down a tiled corridor in the office section \n     of the complex. They're almost at the end of the hall when \n     a CAPED BLACK SHADOW steps into their path.\n\n     It stands there, motionless. EXTENDS ITS ARMS -- like giant \n     WINGS -- revealing the yellow-and-black insigne on its \n     massive chest. BATMAN.\n\n     One millisecond later, the shocked HOODS are racing back in \n     the opposite direction.\n\n     THE BATMAN flings a handful of STEEL BALL-BEARINGS across \n     the tiled floor. HOOD I tumbles to the floor and lands \n     hard, losing his breath. HOOD II rolls and pulls a GUN.\n\n     BATMAN hurls a BOOMERANG -- its edges scalloped, like a \n     bat's wing. HOOD II finds his gun hand PINNED TO THE WALL \n     by the twin prongs of the BATARANG.\n\n     THE BATMAN strides briskly toward them, businesslike, \n     taking his time. He grabs a handful of HOOD I's hair, lifts \n     his head off the floor, KNEES HIM IN THE FACE.\n\n     He turns to the petrified HOOD II. CHROME-STEEL TALONS \n     spring out of his fingertips. He strolls past HOOD II,\n     reaching out casually to give him a QUICK NICK on the chin.\n\n     HOOD II slumps against the wall, unconscious.\n\n     ANGLE ON JACK\n\n     down on the floor, racing along a wall, THROWING SWITCHES \n     -- anything to create a diversion. With every switch he \n     throws, ANOTHER GIGANTIC MACHINE roars to life. CENTRIFUGES \n     SPIN. HUGE POLYMER EXTRUDERS spit out thick strands of \n     plastic gunk. OVERHEAD CHEMICAL TANKS rotate into place \n     over giant basins.\n\n     JACK SEES a squad of COPS on his tail, moving from machine \n     to machine, keeping covered. He SHOOTS AND RUNS.\n\n     ANGLE ON CATWALKS\n\n     BLASTING AWAY, HOODS III and IV scuttle across the elevated \n     walkways, keeping down, avoiding police fire. One of them \n     starts up a vertical ladder leading to the next catwalk up.\n\n     BATMAN plunges past on the end of a rope. A BLACK-GLOVED \n     HAND snatches at HOOD III's collar as he climbs and YANKS \n     HIM CLEANLY OFF THE LADDER. They drop to the lower catwalk.\n\n     HOOD IV gapes. He LEVELS HIS GUN at BATMAN, who stands his \n     ground, holding onto the rails of the catwalk for support. \n     A bullet hits him squarely in the chest. He does not fall.\n\n     HOOD IV turns and scrambles. BATMAN goes to his belt for a \n     miniature SPEAR GUN. He points it at HOOD IV and FIRES... \n     planting a BARBED HOOK in the HOOD'S LEG.\n\n     ANGLE ON COPS\n\n     staring up in utter disbelief at the action on the catwalk.\n\n                              COP\n               LOOK!\n\n                              GORDON\n               My God... it's him.\n\n     ANGLE ON CATWALK\n\n     HOOD III, on his feet now, charges BATMAN from behind. \n     BATMAN -- not even turning to face him -- DROPS HOOD III \n     with an ELBOW. Now he has a HOOD on either side.\n\n     He takes a STEEL BILLY CLUB from his belt, whips it once \n     through the air. It telescopes out into a FOUR-FOOT STAFF.\n\n     Like a drum majorette from hell, he WHIRLS THE STAFF as the \n     HOODS CONVERGE on him. HOOD III takes a debilitating JAB \n     UNDER THE JAW. BATMAN SPINS on his heels and SLAMS THE \n     STAFF into HOOD IV's BACK -- knocking him OFF THE CATWALK \n     to the factory floor forty feet below!\n\n     INT. ACE LOADING BAY - THAT MOMENT\n\n     JACK spots a possible out. He hits a button on the wall; \n     STEEL DOORS RISE to reveal ACE CARGO TRUCKS in the parking \n     lot outside. Beyond the trucks... AN ARMY OF COPS waiting \n     for JACK to make his move.\n\n     No go. He turns. Behind him, other cops -- the inside team \n     -- are rushing at him in full riot gear. JACK ducks behind \n     a forklift and darts into the adjacent room.\n\n     INT. CHEMICAL SUPPLY ROOM - A MOMENT LATER\n\n     JACK sprints through the room, firing FOUR SHOTS at the \n     metal CHEMICAL TANKS on the wall. TOXIC CHEMICALS gush out \n     onto the floor in streams. The streams run together... \n     begin to SMOKE and SIZZLE.\n\n     COPS RIGHT BEHIND HIM. JACK can't resist taking one last \n     pot-shot at a FIFTH CHEMICAL TANK.\n\n     AN EXPLOSION knocks him off his feet.\n\n     INT. FACTORY FLOOR - A MOMENT LATER\n\n     COPS LOOK ON IN PUZZLEMENT as a RIVER OF CHEMICALS courses \n     out into the main refinery. A second later, they go UP IN \n     FLAMES. A WALL OF FIRE bisects the factory floor.\n\n     JACK RACES ALONG behind the spreading wall of flame. The \n     cops can't see him now. He ducks behind a huge machine, \n     hits a switch -- and SLUICE GATES OPEN. CHEMICAL SLUDGE \n     begins to churn. A big HOLE IN THE WALL appears as a gate \n     opens on the East River. It's the waste dump!\n\n     Up on the catwalk, BATMAN has a perfect view of JACK. If \n     JACK can just sprint through the flames without getting \n     shot, he'll make it to the river. BATMAN hooks a rope to \n     his Batarang, FLINGS IT at a catwalk across the floor.\n\n     JACK bolts. BURSTS THROUGH the wall of fire. And just as he \n     does --\n\n     BATMAN leaps off the catwalk and swings down toward him! \n     His foot catches a THIRTY-FOOT ROLL of plastic, six feet in \n     diameter, one of several standing upright on the floor. The \n     plastic roll DROPS into JACK's path, BLOCKING HIS EXIT.\n\n     An instant later, BATMAN lands on top of JACK. Wraps an arm \n     around his throat and RAISES his free hand. DRUG-TIPPED \n     STEEL TALONS appear. But before he can paralyze JACK... \n\n                              VOICE\n               HOLD IT!\n\n     In all the ruckus, HOOD V has managed to circle back behind \n     the heavy machinery. Now he's got a GUN pointed DIRECTLY AT \n     COMMISSIONER GORDON'S HEAD.\n\n                              HOOD V\n               Let him go or I'll do it.\n\n     BATMAN releases JACK and stands back. JACK chuckles to \n     himself: what loyalty. Then, with plenty of time, he \n     strolls across the floor to a Jacob's ladder mounted on the \n     back wall... and BEGINS TO CLIMB toward the catwalks.\n\n     All action stops. BATMAN doesn't move. The COPS don't move. \n     HOOD V stands there sweating, his gun hand shaking as he \n     waits for JACK to climb safely out of shooting range.\n\n     ECKHARDT's pig-like eyes glisten. His hand drops to his \n     side. He's half-tempted to pull a gun and get the \n     Commissioner plugged.\n\n     ANGLE ON JACK\n\n     at a crouch, groping his way along the rail of the catwalk. \n     He reaches a paneled glass window propped open by a \n     supporting rod. It's a forty-foot drop to the swirling \n     black currents of the East River... and freedom.\n\n     He's about to climb out when his eye falls on a .38 \n     AUTOMATIC -- which lies, abandoned, on the gridwork floor \n     of the catwalk mere yards away.\n\n     ANGLE ON FACTORY FLOOR\n\n     The HOOD, one arm around GORDON. With his gun at the \n     Commissioner's temple, he backs slowly toward the door.\n\n                              HOOD V\n               Nobody makes a move. We go out\n               clean.\n\n                              JACK'S VOICE\n               ECKHARDT!!\n\n     ALL EYES TURN to the catwalk overhead, where JACK stands \n     poised with the .38 in his fist. A SINGLE SHOT drops \n     ECKHARDT cleanly.\n\n     The moment's distraction is all BATMAN needs. He hurls a \n     NINJA WHEEL -- a small, ratcheted, razor-sharp disc -- at \n     the FOREARM of HOOD V. One jerk of a thin filament WIRE -- \n     a sudden SHRIEK -- and GORDON IS FREE.\n\n     The THUG lurches forward. His GUN DROPS to the floor, \n     DISCHARGING ACCIDENTALLY.\n\n     AN UNGODLY HOWL OF PAIN echoes out from the catwalk above. \n     JACK REELS and STAGGERS, his hands CLUTCHING AT HIS CHEEKS. \n     BLOOD GUSHES from between his fingers.\n\n     JACK NAPIER HAS BEEN SHOT THROUGH THE FACE.\n\n     A YOUNG COP, unnerved by the sight of JACK's agonized \n     pirouette, draws his gun and OPENS FIRE.\n\n                              GORDON\n               NO!!\n\n     But the bullet has caught JACK in the arm. He spins, \n     totters to the edge of the catwalk... and TOPPLES OVER. The \n     COPS look on helplessly as JACK plunges TWO STORIES DOWN \n     into a CATCH BASIN full of BUBBLING TOXIC WASTE, SCREAMING \n     ALL THE WAY.\n\n                              GORDON (cont.)\n               Goddammit, we had him. We --\n\n     And suddenly, with JACK out of the picture, all attention \n     focusses on THE BATMAN. COPS reach for their guns, circle \n     warily around him. Cornered now, he backs off slowly, HANDS \n     ON HIS BELT.\n\n                              GORDON (cont.)\n               Hold it right there, Mister.\n\n     THE BATMAN raises his hands in a gesture of surrender. Then \n     -- as the COPS advance -- he flicks TWO TINY CAPSULES onto \n     the factory floor.\n\n     A BLINDING FLASH OF LIGHT. COLORS BURST in a wild \n     pyrotechnic display. COPS stumble backwards, momentarily \n     dazzled, as a THICK WALL OF BLACK SMOKE conceals BATMAN \n     from view.\n\n     A TINY GRAPPLING HOOK rockets out of the dense curling \n     cloud and CATCHES on a catwalk overhead.\n\n                              COP\n               LOOK!\n\n     The COPS are firing wildly into the smoke. But it's too \n     late. At the end of a cord, THE BLACK MAJESTIC FIGURE OF \n     THE BATMAN whips upward, rising out of the smoke like an \n     avenging angel -- and DISAPPEARING into the shadowy \n     heights, safely out of range.\n\n                              GORDON\n               HOLD YOUR FIRE!\n\n                              COP\n               ... Who is this guy?\n\n                              GORDON\n               I don't know, but he's one hell of a\n               showman.\n\n                                                 CUT TO:\n\n     EXT. ACE CHEMICAL CO. - THAT MOMENT - NIGHT\n\n     A BLACK SHADOW scurries across the roof. From the \n     illuminated sign with its neon ace, WE PAN DOWN past the \n     chemical sluice to a SECOND ACE... a card from JACK's lucky \n     deck, pierced by a neat, round bullet hole, bobbing on the \n     oily surface of the foul, polluted river.\n\n     As deadly toxins gush forth, OTHER CARDS from the deck \n     swirl past: a nine. A deuce. A queen. And finally, a JOKER \n     -- SHOT CLEANLY THROUGH THE FACE.\n\n     A BONE-WHITE HAND BREAKS THE SURFACE as we\n\n                                                 SHOCK CUT TO:\n\n     INT. GOTHAM GLOBE - CITY ROOM - DAY\n\n     A BANNER HEADLINE on the late edition of the Globe: \"BAT \n     MAN FOILS ROBBERY. WHO IS MASKED VIGILANTE?\"\n\n     Behind the newspaper, feet propped up on his desk, is a \n     jubilant KNOX. He's on the horn to COMMISSIONER GORDON.\n\n                              KNOX\n               Commissioner. Do us both a favor.\n               Don't tell me some lie you'll have\n               to retract later.\n\n     CLICK. KNOX grins, lowers the paper, finds himself looking \n     up at the smiling face of VICKI VALE.\n\n                              KNOX (cont.)\n               Vick! Looks like our friend the bat\n               is getting ambitious. -- Why the\n               dopey grin?\n\n                              VICKI\n               Guess who's got a date with Bruce\n               Wayne.\n\n                              KNOX\n               Bruce Wayne? Date? He called you up\n               and asked you for a date?... Shit.\n                     (shouting)\n               HEY MIRANDA! C'MERE!\n                     (to VICKI)\n               I want you to pay close attention to\n               this. Miranda -- tell my friend here\n               what you told me about Bruce Wayne.\n\n     A SUPERANNUATED SOUTHERN BELLE toddles over. MIRANDA REITZ, \n     60, is the society editor of the Globe.\n\n                              MIRANDA\n               You mean Mister One-Nighter?\n\n                              KNOX\n               Yeah. \"Mister One-Nighter.\"\n                     (to VICKI)\n               Because that's the average length of\n               his relationships with women.\n\n                              MIRANDA\n               The current record is almost two\n               weeks. That cover girl -- what's her\n               name? You must've shot her, Vicki --\n\n                              KNOX\n               Tell her about the peanuts.\n\n                              VICKI\n               Peanuts?\n\n                              KNOX\n               Yeah. Peanuts. Which is how he goes\n               through women.\n\n                              MIRANDA\n               Like Planter's Peanuts.\n\n     VICKI is about to break out into helpless giggles.\n\n                              VICKI\n               Plain or roasted?\n                     (standing up)\n               Alex, I'm very flattered that you've\n               gone out and done all this research.\n\n                              KNOX\n               Why?\n                     (blushing suddenly)\n               Aw, come on, Vicki, I'm a reporter.\n               I'm curious. I do this for a living.\n               -- What'd you tell him?\n\n                              VICKI\n               I told him yes.\n\n     KNOX fumes. VICKI shakes her head and laughs. She takes \n     KNOX's face in her hands, plants a kiss on his forehead.\n\n                              VICKI (cont.)\n               You're awfully sweet to be\n               concerned, but it's really not\n               necessary. I'll call you, okay?\n\n     She exits. KNOX stands there looking poleaxed.\n\n                              KNOX\n               ... What was that?\n\n                              MIRANDA\n               That was one of the most gracious\n               fuck-yous it's ever been my pleasure\n               to watch. -- What a nice girl.\n\n     KNOX, totally flustered, sighs and sinks into his chair.\n\n                              KNOX\n               Miranda, I'm busy. Go be productive.\n\n                                                 CUT TO:\n\n     EXT. COASTLINE - DAY\n\n     A CABIN CRUISER slices through the waves. In the distance, \n     closer to the shore, we see a throng of SAILBOATS.\n\n     EXT. DECK - YACHT - DAY\n\n     BRUCE's forty-foot cabin cruiser, aptly christened \"DIE \n     FLEIDERMAUS.\" BRUCE and VICKI are on the deck, in chairs, \n     soaking up sun, gazing off at the sailboats.\n\n                              VICKI\n               Do you sail?\n\n                              BRUCE\n               Too much work. I'm not really the\n               physical type. -- Thank you, Alfred.\n\n     ALFRED has just appeared from belowdecks with a tray of \n     drinks for BRUCE and VICKI. VICKI watches as BRUCE reaches \n     for his glass. His forearm looks like a thin layer of skin \n     over braided telephone cables.\n\n                              VICKI\n               You do a very convincing imitation.\n                     (sipping her drink)\n               Mm, this is tasty. What's yours?\n\n     He smiles, slides the drink over toward her, gestures for \n     her to try a sip.\n\n                              VICKI (cont.)\n               ... Ginger ale?\n\n                              BRUCE\n               Two drinks and I start swinging from\n               the rooftops.\n                     (beat)\n               Tell me, Vicki. There's something\n               I'm very curious about. What took\n               you down to Corto Maltese?\n\n                              VICKI\n               ... I guess I needed a change.\n\n                              BRUCE\n               You were one of the most successful\n               magazine photographers in the city.\n               Everyone wanted you.\n\n                              VICKI\n               Have you ever been to Corto Maltese?\n\n                              BRUCE\n               Not since the shooting started.\n\n                              VICKI\n               We went there once when I was\n               little. I played on the beach. And\n               at nights -- they had a band -- I\n               danced with my father on the hotel\n               patio.\n                     (shrugging)\n               That was Corto Maltese. When the war\n               broke out I had to go back. And I\n               promised myself that this time... I\n               wouldn't look away.\n\n                              BRUCE\n               What did you see?\n\n                              VICKI\n               ... Terror.\n\n     The conversation is getting rather intense -- at both ends. \n     VICKI seems to have hit some weird chord within BRUCE.\n\n                              BRUCE\n               There's terror everywhere. Some\n               types are just more -- familiar\n               than others.\n\n     For a moment BRUCE seems to be drifting back into his \n     familiar 'preoccupied' mode. VICKI laughs apologetically.\n\n                              VICKI\n               I'm sorry. I didn't mean to -- I\n               know it all seems a million miles\n               away, out here on the water, with\n               all this --\n\n                              BRUCE\n               Insulation?\n\n     VICKI is momentarily stuck for a reply. In some way she \n     can't quite grasp, he seems to be challenging her.\n\n                              VICKI\n               Bruce, really, when I say these\n               things I don't mean to criticize\n               you.\n\n                              BRUCE\n               I think you see things very clearly.\n\n                              VICKI\n               I'm happy to talk about something\n               else. I don't want to be depressing.\n\n                              BRUCE\n                     (smiling)\n               Do you assume that if I know you\n               better I won't like you as much?\n\n     VICKI starts laughing. BRUCE is a notorious womanizer, but \n     if this is a come-on, it's like no come-on she's ever seen.\n\n                              VICKI\n               I'm sorry, Bruce, I have to ask. Are\n               you like this with the other women\n               you know? -- Because I just can't\n               seem to get a handle on this\n               conversation.\n\n                              BRUCE\n                     (taking her hand)\n               Vicki, if I say anything cryptic, or...\n               ambiguous, I think you should put\n               the most flattering possible\n               interpretation on it. Because even\n               if it doesn't sound that way... \n               that's how I'll mean it.\n\n     Bingo. The guy's a chessplayer, but on the other hand he's \n     also rather touchingly, almost childishly, sincere. Before \n     she knows it, VICKI finds herself melting.\n\n                                                 CUT TO:\n\n     INT. GOTHAM CITY OPERA HOUSE - NIGHT\n\n     Rigoletto. THE DUKE onstage, launching into his big \n     crowd-pleaser, \"La Donna e Mobile.\"\n\n     WE PAN THE AUDIENCE, finding several mobile young DONNAS in \n     the crowd -- drop-dead beauties in slinky gowns. Although \n     most eyes are fixed, reasonably enough, on the stage, DONNA \n     #1 is staring with undisguised envy at a PRIVATE BOX above \n     the orchestra seats. Her mouth twists in disgust.\n\n     She scans the crowd, finds her counterpart (DONNA #2) some \n     rows back, on the arm of a bald bigwig. DONNA #2 is wearing \n     a similar sour expression, staring up at the same box.\n\n     DONNA #3 is even less discreet than her comrades. She has \n     her opera glasses trained on the couple in the box.\n\n     HER POV - THROUGH OPERA GLASSES - THE BOX\n\n     BRUCE and VICKI. He whispers in her ear. She smiles and \n     whispers back.\n\n     A beat. He whispers again. This time she doesn't laugh. But \n     her lips part slightly. SCREEN GOES BLACK as the opera \n     glasses SNAP SHUT.\n\n     ANGLE ON CROWD - DONNA #3\n\n     staring icily at the DUKE as he finishes up to a round of \n     TUMULTUOUS APPLAUSE.\n\n                                                 CUT TO:\n\n     INT. WAYNE MANOR - NIGHT\n\n     BRUCE and VICKI enter. He takes her coat, drops it on a \n     chair by the door. VICKI is giddy, all champagned up.\n\n                              VICKI\n               -- but it's not fair. I'm half\n               drunk and you're not even --\n\n                              BRUCE\n               Would you like me to take you home?\n\n                              VICKI\n               God. You would.\n                     (sidling up to him)\n               Come on, Bruce. I just want to get\n               two drinks in you. As an\n               experiment.\n\n                              BRUCE\n               Maybe we should just kiss.\n\n                              VICKI\n               ... We could try that.\n\n     WIDER ANGLE\n\n     BRUCE embracing VICKI in the vastness of the darkened entry \n     hall, framed by long semicircular STAIRWAYS on opposite \n     walls. A SUDDEN FLASH OF LIGHTNING transports us to:\n\n     EXT. OFFICE BUILDING - ESTABLISHING - NIGHT\n\n     Broken windows, graffiti on the walls: a decrepit rathole \n     near the Gotham docks.\n\n     INT. DOCTOR'S OFFICE - NIGHT\n\n     TIGHT ON a face swathed in bandages. The patient sits erect \n     in a wooden chair, surrounded by the grimy paraphernalia of \n     an unlicensed gangland doctor.\n\n     The DOCTOR, a nervous little ferret with the bedside manner \n     of a back-alley abortionist, steps up with a scissors.\n\n                              DOCTOR\n               Well, Mr. Napier, let's see how we\n               did.\n\n     He begins to snip away. As the bandages come off, we get:\n\n     JACK NAPIER'S POV\n\n     The last strands of gauze peel away. The DOCTOR stands \n     there, looking at his handiwork. His mouth falls open. His \n     eyes bug out. He GAGS.\n\n                              JACK (V.O.)\n               Mirror.\n\n     The DOCTOR just stands there staring AT CAMERA, stock-\n     still, apparently transfixed by the sight of JACK's face.\n\n                              JACK (V.O.)\n               Mirror.\n\n     ANGLE ON DOCTOR\n\n     He clears his throat, reaches apprehensively for a hand \n     mirror, and passes it out of frame to JACK. Two beats. \n     Then, the sound of GLASS SHATTERING as the mirror drops to \n     the floor.\n\n     JACK begins to laugh. THE DOCTOR gets a little edgy.\n\n                              DOCTOR\n               You understand the facial muscles\n               were completely severed --\n\n     JACK keeps on laughing.\n\n     The DOCTOR turns uneasily away, gestures apologetically at \n     his seedy equipment.\n\n                              DOCTOR (cont.)\n               -- you can see what I have to work\n               with here --\n\n     MORE LAUGHTER. The trembling DOCTOR covers his face with \n     one hand, whining now, not daring to look at JACK.\n\n                              DOCTOR (cont.)\n               I'm sure that with proper recon--\n               recon-- reconstructive surgery --\n\n     A DOOR SLAMS. JACK is gone. The grateful DOCTOR breathes a \n     sigh of relief and steadies himself on an operating table.\n\n     EXT. OFFICE BUILDING - OVERHEAD ANGLE - NIGHT\n\n     From a point high above we see JACK emerging into the \n     alley, pulling on a hat, wrapping a muffler about his head. \n     We can't see his face. But we can't forget his LAUGH.\n\n                                                 CUT TO:\n\n     INT. BRUCE WAYNE'S BEDROOM - NIGHT\n\n     VICKI nestled peacefully under the covers. Beside her is \n     BRUCE: hands behind his head, staring up at the ceiling.\n\n     It's almost as though BRUCE is not used to sleeping at \n     night. He doesn't know what to do with himself.\n\n     He looks at VICKI. She's terribly lovely. But despite all \n     that, we can't shake the feeling that BRUCE... would really \n     rather be somewhere else.\n\n                                                 CUT TO:\n\n     EXT. STREET - NIGHT\n\n     LOUD MUSIC. KIDS in punk regalia stand outside a rock club \n     as JACK stalks past. The wind knocks his hat off.\n\n                              KID\n                    Nice hair, dude!\n\n     JACK ignores them as he bends to retrieve his hat. Then he \n     gazes up at the steel-and-glass facade of a SKYSCRAPER -- \n     and strides deliberately across the street.\n\n     INT. GRISSOM'S PENTHOUSE - NIGHT\n\n     The spectacular Gotham skyline, seen through the plate-\n     glass window of GRISSOM's conference room. The doors to the \n     private elevator hiss open and JACK wanders in. He plops in \n     the big plush swivel chair behind GRISSOM's desk.\n\n                              GRISSOM (O.S.)\n               That you, sugar bumps?\n\n     GRISSOM waddles in unsuspectingly from the adjoining room. \n     He's fresh out of the shower, a towel wrapped around his \n     impressive girth. He's using a smaller towel to dry his \n     hair, and so it's a moment before he sees the bundled-up \n     figure at his desk.\n\n                              GRISSOM (cont.)\n               Who the hell are you?\n\n                              JACK\n               It's me. \"Sugar Bumps.\"\n\n                              GRISSOM\n                     (recognizing his voice)\n               Jack?\n                     (advancing cautiously)\n               Thank God. I can't believe it's you.\n               I heard you'd been --\n\n                              JACK\n                     (standing up)\n               Is that what you \"heard\"?\n\n     JACK gestures him over to the empty chair. GRISSOM doesn't \n     move until he sees the GUN pointed at his belly.\n\n                              JACK (cont.)\n               YOU SET ME UP!\n                     (beat)\n               Over a girl. You must be insane!\n\n     GRISSOM surreptitiously reaches for a desk drawer.\n\n                              JACK (cont.)\n               Keep your hands on the desk.\n\n                              GRISSOM\n               Sooner or later you would've tried\n               to take me, Jack. You may get me\n               now, but your life won't be worth a\n               dime.\n\n                              JACK\n               I've died once already. It wasn't so\n               bad. -- In fact I recommend it.\n\n     GRISSOM is beginning to panic now. It's obvious that JACK \n     is utterly, hopelessly deranged.\n\n                              GRISSOM\n               Jack, listen -- we'll cut a deal --\n\n                              JACK\n               JACK? JACK? DO I LOOK LIKE A JACK??\n\n     And now, for the first time, he flings away the hat. RIPS \n     THE MUFFLER from his face. And -- as GRISSOM gasps in shock \n     -- STANDS REVEALED in his full horrendous glory.\n\n     His flesh is bleached bone-white. His hair is a luminous \n     seaweed-green. And his cheeks are torn and puckered from \n     the bullet wound, TWISTING HIS MOUTH INTO A HIDEOUS, \n     PERPETUAL HARLEQUIN'S GRIN.\n\n                              JACK (cont.)\n               I'm not a Jack any more.\n                     (pause; cackling)\n               You made me a Joker!\n\n     THE CACKLE BUILDS INTO FURIOUS, HYSTERICAL LAUGHTER. \n     GRISSOM, revulsed, terrified, pushes himself away from the \n     desk, back toward the window which overlooks the city.\n\n                              GRISSOM\n               Jack -- I'm warning you. WIPE THAT\n               LUNATIC GRIN OFF YOUR FACE.\n\n                              JACK\n               HA! That's the best part. I CAN'T!!\n\n     And with that JACK pulls the trigger. And fires. And fires \n     again until the CLIP IS EMPTY.\n\n     EXT. GRISSOM'S BUILDING - NIGHT\n\n     We TILT UP the chrome-and-glass facade of the skyscraper, \n     arriving finally at the TOP FLOOR: a PLATE GLASS WINDOW \n     spiderwebbed with cracks where Jack's bullets hit.\n\n     INT. GRISSOM'S PENTHOUSE - THAT MOMENT - NIGHT\n\n     The room is still dark. JACK -- or, as we'll know him from \n     this moment on, THE JOKER -- sits in GRISSOM's swivel \n     chair, staring out at the moon-drenched skyline.\n\n                              JOKER\n               What a view. Our little city. It\n               always brings a smile to my face.\n\n     He reaches for a nearby glass of liquor and glances down at \n     GRISSOM -- who lies dead on the floor, the towel still \n     wrapped around him. THE JOKER laughs softly to himself.\n\n                              JOKER (cont.)\n               Guess it's my little city now.\n               Wonder what it'll look like when I\n               get done with it.\n                     (pause)\n               I bet it'll be something real fine.\n               Real fine and pretty.\n\n                                                 DISSOLVE T0:\n\n     INT. BRUCE WAYNE'S BEDROOM - MORNING\n\n     The sun is just up, and VICKI finds herself alone in bed. A \n     SOFT, OFF-KEY BARITONE VOICE drifts out of the adjacent \n     bathroom: BRUCE in the shower, singing \"Honeysuckle Rose.\"\n\n     She breaks into a huge smile and climbs out of bed. Somehow \n     she's wound up wearing BRUCE's ribbed formal shirt.\n\n     INT. BATHROOM - A MOMENT LATER - MORNING\n\n     BRUCE in his opulent deco shower stall, still SINGING to \n     himself. VICKI sneaks up behind him, opens the door. He \n     instantly STOPS SINGING -- as if he's been hit by a brick.\n\n                              VICKI\n               I didn't mean to scare you. I just\n               had to come in here and see it that\n               was really you singing.\n\n     She smiles, teasing him. He doesn't respond. He acts as if \n     she's caught him doing something shameful -- exposed him.\n\n                              VICKI (cont.)\n                     (singing)\n               \"Don't buy sugar -- you just have to\n               touch my cup.\" Come on. \"You're my\n               sugar --\"\n                     (no response from BRUCE)\n               Bruce, you are such a case.\n\n     BRUCE seems somehow unable to sing along. But be quickly \n     recovers his composure -- and forces a crooked, almost \n     childish smile.\n\n                              BRUCE\n               I don't sing very well.\n\n                              VICKI\n               Then there's one thing in the world\n               you don't do very well. And I know\n               what it is. -- Now you'll have to\n               kill me.\n\n     He kisses her good morning, steps out and reaches for a \n     towel. His body is one big mass of BRUISES AND ABRASIONS.\n\n                              VICKI (cont.)\n               Poor thing. You should stay off that\n               horse.\n\n                                                   CUT TO:\n\n     INT. GLOBE - CITY ROOM - DAY\n\n     KNOX, in a surly mood, examines the morning edition of the \n     Globe. He's turned to page six -- the gossip page -- and \n     there, under Miranda Reitz's byline, is a picture of VICKI. \n     It seems she and BRUCE are the talk of the town.\n\n                              KNOX\n                     (disgusted)\n               ...Peanut.\n\n     A COPY BOY approaches his desk with a MANILA FOLDER:\n\n                              COPY BOY\n               Here's that morgue file you wanted.\n\n     KNOX leans back in his chair. The file is labelled \"BRUCE \n     WAYNE: 1982-1987.\"  KNOX opens it and begins to leaf \n     through old clippings from back issues of the Globe.\n\n     WAYNE FOUNDATION TO FUND LOW-COST HOUSING. MILLIONAIRE \n     HEADS CHARITY DRIVE FOR GOTHAM HANDICAPPED. HURRICANE \n     VICTIMS SAY 'THANK YOU' TO BRUCE WAYNE. KNOX's face sags in \n     dismay. Every article seems to be telling us just how swell \n     a rich philanthropist can be.\n\n                              KNOX\n               Come on. Gimme some dirt!\n\n     Then he notices something odd. In the whole fat file of \n     clippings, there are no pictures of Bruce Wayne -- with two \n     partial exceptions.\n\n     One is a group shot, Bruce in the middle, waving at the \n     camera and blocking our view of his face. The other is an \n     ancient picture of a collegiate Bruce, stern-faced, hair \n     down to his collar. The caption reads \"BRUCE WAYNE IN \n     1973\" -- years out of date even when it ran in the paper.\n\n                              KNOX (cont.)\n               ... Why don't you like your picture\n               taken?\n\n                                                   CUT TO:\n\n     INT. APARTMENT LOBBY - NIGHT\n\n     A DOORMAN DOZES in the plush lobby of ALICIA HUNT's \n     apartment building on the East Side of Gotham. Through the \n     glass doors we see ALICIA outside in the chill wind, \n     peering inside, hesitant to enter.\n\n     As silently as possible she uses her key and steps in, \n     tiptoeing past the doorman, trying not to wake him. She's \n     almost made it when he SITS BOLT UPRIGHT, startling her.\n\n                              DOORMAN\n               Miss Hunt!\n                     (smiling)\n               No need to sneak in. The rent's been\n               taken care of.\n\n                              ALICIA\n               ... The rent? Paid?\n\n     INT. ALICIA'S APARTMENT - NIGHT\n\n     ALICIA, mystified, lets herself in and turns to lock the \n     door. She's startled once more by a VOICE FROM BEHIND.\n\n                              VOICE\n               Honey -- I'm home!\n\n     She pivots. Her eyes widen. She SHRIEKS.\n\n     Sitting cross-legged in an easy chair, a twisted grin on \n     his loathesome face, is THE JOKER. He's in a smoking jacket \n     and slippers, reading the paper, a dry martini at his side.\n\n     This grim parody of domesticity sends poor ALICIA into a \n     dead faint.\n\n     INT. PENTHOUSE SUITE - DAY\n\n     It looks for all the world like a corporate boardroom. At a \n     long table sit Gotham's most distinguished criminals: \n     GANGLORDS and RACKETS BOSSES from every corner of the city. \n     They stare suspiciously at the head of the table.\n\n                              JOKER (O.S.)\n               So that's how it is, gents. Until\n               Grissom decides it's safe to come up\n               for air... I'm running the show.\n\n     Now we see what they see: THE JOKER, dressed rather \n     flamboyantly in a big slouch hat. His FACE is layered with \n     flesh-toned makeup, and his HAIR's been rinsed black.\n\n     Unfortunately, he can't conceal his ghoulish SMILE.\n\n                              GANG BOSS\n               So why don't we hear this from\n               Grissom?\n\n                              RACKETEER\n               I got something I'd like to know.\n               How come you're wearing that stupid\n               smirk?\n\n                              JOKER\n               'Cause I got an army, chum. And I\n               got Grissom's army. And this city\n               is mine.\n\n     CARMINE ROTELLI, an especially oily mobster, speaks up:\n\n                              ROTELLI\n               I don't like taking orders, from\n               Grissom. And I especially don't like\n               taking orders from Grissom's goon.\n\n                              JOKER\n               I've considered that possibility.\n\n                              ROTELLI\n               And what happens if we say no?\n\n                              JOKER\n                     (chuckling)\n               Nobody wants a war, Carmine. If we\n               can't do business, we shake hands\n               and part friends.\n\n                              ROTELLI\n               That's it?\n\n                              JOKER\n               That's it.\n\n     THE JOKER extends a hand. ROTELLI reaches out to shake it. \n     He doesn't see the JOY BUZZER concealed in the JOKER's \n     palm.\n\n     40,000 VOLTS course through ROTELLI's body. He drops back \n     into his seat a blackened husk, SMOKE pouring out from his \n     sleeves and shirt collar.\n\n     The CRIMELORDS recoil in horror. Before they can make a \n     move, a squad of ARMED THUGS burst into the room.\n\n                              JOKER (cont.)\n               Looks like Carmine got a little hot\n               under the collar.\n\n                              CRIMELORD\n               ... You're insane!\n\n     The JOKER is a wee bit agitated. He removes the hat and \n     mops sweat from his brow, exposing a patch of CHALK-WHITE \n     FLESH -- to the great bewilderment of the ONLOOKERS.\n\n                              JOKER\n               That's what they said about Lee\n               Iacocca. Now GET OUT OF HERE. -- And\n               THINK IT OVER!\n\n     The sickened CRIMINALS file out cautiously. That leaves THE \n     JOKER alone in the room with the charred corpse of ROTELLI. \n     THE JOKER sinks into a chair and -- as is his wont -- \n     ADDRESSES THE STIFF:\n\n                              JOKER (cont.)\n               Heck, they're not such bad guys. I\n               say we give 'em a couple of days to\n               come around.\n                     (thoughtful pause)\n               We-e-ll... maybe one day.\n                     (then, casually)\n               Aaah, screw it. Let's grease 'em.\n\n                                                 CUT TO:\n\n     INT. SMALL BACK ROOM - NIGHT\n\n     A poker game. A CRIMELORD from the JOKER's board meeting \n     picks up his hand and fans out the cards. FIVE JOKERS.\n\n     He looks up, puzzled. The last thing he sees is a HIRED \n     KILLER bursting in through the door, GUN IN HAND.\n\n     EXT. GOTHAM PARK - DAY\n\n     A COSTUMED CLOWN with a wheeled cart, filling balloons from \n     a helium tank, passing them out to the kids. CRIMELORD #2 \n     strolls past. The CLOWN offers him a balloon, which be \n     politely refuses.\n\n     THE CLOWN reaches into his cart for a RED METAL TANK. But, \n     as we quickly find out, it's not a helium tank -- it's a \n     FLAMETHROWER.\n\n     EXT. HALLIDAY PLAZA - DAY\n\n     A sunny, landscaped quad surrounded by corporate \n     skyscrapers: trees, grass, marble fountains, flags of many \n     nations. Amid the pedestrians we catch BRUCE and VICKI, all \n     smiles, cutting through the plaza on the way to lunch.\n\n                              VICKI\n               ... To tell you the truth, I'd just\n               about given up waiting.\n\n                              BRUCE\n               I said I'd call you the minute I got\n               free. And I did. -- And here we are.\n\n                              VICKI\n                     (teasing him)\n               Hm hmm. Lunch. Not even dinner.\n\n     He stops in his tracks, takes her by the shoulders.\n\n                              BRUCE\n               Vicki. Do you want the whole truth?\n               All coyness aside?\n                     (long pause)\n               I wish I had more time to give you.\n               Every day I don't see you, I miss\n               you.\n                     (beat)\n               Now. Are you going to waste this\n               lovely afternoon being all mad at\n               me?\n\n     All this, of course, is delivered with devastating \n     sincerity. VICKI finds herself totally disarmed.\n\n                              VICKI\n               Okay, I'm a sucker. You sound so\n               much like someone I used to... \n                     (stopping suddenly)\n               Bruce? I know this is silly, but --\n               you're not married, are you?\n\n     He stops and laughs. She smiles crookedly, takes his arm.\n\n     ANOTHER ANGLE - ACROSS PLAZA - THAT MOMENT\n\n     PHILLY RICORSO -- another CRIMELORD from the boardroom -- \n     enters the plaza flanked by a cadre of PAID BODYGUARDS.\n\n     ON BRUCE AND VICKI\n\n     A PAINTED STREET MIME walks alongside them, feeling his way \n     along an imaginary wall. VICKI groans.\n\n                              VICKI\n               All street mimes should be executed.\n\n                              BRUCE\n               ... Looks like a convention.\n\n     And indeed, there are HALF A DOZEN STREET MIMES converging \n     on the center of the plaza.\n\n     RICORSO and co. approach the mirrored-glass entrance of a \n     skyscraper. In the lobby, A MIME -- who's been annoying the \n     passersby -- THROWS A BOLT, LOCKING THE DOORS from inside.\n\n     A BODYGUARD bangs on the glass. Nearby, ANOTHER MIME \n     reaches into a trash bin -- and pulls out a MACHINE GUN.\n\n     SUDDEN SCREAMS OF TERROR from the onlookers.\n\n     VICKI turns to BRUCE. Before she can get his name out, he's \n     HOISTED HER BODILY and THROWN HER behind a marble fountain.\n\n     SERIES OF SHOTS\n\n     BRUCE'S EYES darting birdlike around the plaza -- INTERCUT \n     with the following POV SHOTS, ALL IN SLOW MOTION:\n\n     -    TWO MIMES with machine guns. One of them lining PHILLY \n          and co. up against the glass doors, the other holding \n          the CROWD at bay;\n\n     -    A WOMAN in the crowd fainting. A THIRD MIME gleefully \n          imitating her swoon, to no one's amusement;\n\n     -    PHILLY and his goons, COWERING, hands in the air, as \n          OTHER MIMES cruelly mimic their terrified poses... \n\n     ... and suddenly BRUCE is RUNNING FRANTICALLY, looking for \n     a secluded spot, an alleyway, anything. No go. He's out in \n     the open, with onlookers everywhere. In his civvies, he's \n     just another citizen... TOTALLY IMPOTENT.\n\n     He darts around a corner, backs against a wall. WOMEN, \n     CHILDREN, GROWN MEN race past. No privacy. He's \n     practically quaking now, in the throes of some terrible \n     anxiety. He looks up at the sky overhead, terrified.\n\n     A BRILLIANT SUN bears down on him as MACHINE GUNS CHATTER.\n\n     ANGLE ON PHILLY AND BODYGUARDS\n\n     BODIES JERKING as GLASS rains down in shards.\n\n     ANGLE ON BRUCE\n\n     his back arched, his mouth agape, his face drained of blood \n     as the sounds of carnage echo through the plaza. It's \n     almost as if the bullets are striking him.\n\n     A moment later, it's all over but the screaming. VICKI \n     emerges from the crowd and finds BRUCE slumped against the \n     wall, nearly catatonic. She moves to touch him.\n\n     As if by reflex he reaches out and GRABS HER BY THE ARMS -- \n     with a grip so strong it could crush bone. She GASPS, looks \n     up -- and sees, in his traumatized EYES, a look so raw, so \n     desperate, that it virtually defies comprehension.\n\n                              VICKI\n               BRUCE!!\n\n     He blinks rapidly. He relaxes his grip. Before VICKI's \n     eyes, he's changing... becoming the BRUCE she knows.\n\n                              BRUCE\n               Oh my God... are you all right?\n\n     He reaches for her. Involuntarily, she steps back.\n\n     He sees her reaction and his face goes slack -- frightened, \n     pleading. This time she lets him embrace her... but her \n     face is full of bewilderment and doubt.\n\n     INSERT - TELEVISION SCREEN\n\n                              ANCHORWOMAN\n               ... live from Halliday Plaza, where a\n               gangland-style execution claimed the\n               life of racketeer Philly Ricorso.\n               Ricorso's death is the third in a\n               rash of underworld killings... \n\n     CUT TO TWO-SHOT: the ANCHORWOMAN and COMMISSIONER GORDON.\n\n                              ANCHORWOMAN (cont.)\n               Commissioner, you've heard the\n               rumors. Are these murders the work\n               of the mysterious 'Batman'?\n\n     A PIERCING CACKLE fills the air. CAMERA PULLS BACK from the \n     TV, placing us in the JOKER's boardroom. Behind the big \n     desk he SWIVELS INTO VIEW, phone in hand.\n\n                              JOKER\n               All reet! I think it's about time\n               we called another meeting, huh?\n\n                                                 CUT TO:\n\n     INT. WAYNE MANOR - DAY\n\n     ALFRED on the phone, a feather duster in his hand.\n\n                              ALFRED\n               I'm sorry, Miss Vale. I've given him\n               your messages. That's all I can do.\n\n     ANGLE WIDENS. BRUCE is sitting mere feet away, obviously \n     distraught, locked in some sort of internal struggle.\n\n     INT. VICKI'S APARTMENT - THAT MOMENT - DAY\n\n                              VICKI\n               Please tell him... I'm not trying to\n               make his life difficult. I'd just --\n               I'd just like to know what's going\n               on.\n\n     A KNOCK at the door as VICKI hangs up. She goes to open it, \n     finds KNOX -- wearing a big, cheshire-cat smile.\n\n                              KNOX\n               Hiya, peanut. I got something I'd\n               like you to see.\n\n     INT. LIBRARY - DAY\n\n     A MICROFILM MACHINE. As VICKI looks on curiously, KNOX -- \n     all eagerness now -- threads up a roll of film and begins \n     cranking through back-issue newspapers.\n\n                              KNOX\n               Okay, here we go. Check it out.\n\n     He steps back. VICKI stares down at the display screen. A \n     FRONT-PAGE BANNER HEADLINE reads:\n\n                      THOMAS WAYNE MURDERED\n            Prominent Doctor, Wife Slain in Robbery\n            Unidentified Gunman Leaves Child Unharmed\n\n     Beneath it, a PHOTO: cops kneeling over corpses. Medics \n     with stretchers. And off to one side, a YOUNG BOY -- BRUCE \n     WAYNE -- his arms wrapped around the waist of a BEAT COP.\n\n     The BOY stares straight at the camera. His face is a mask \n     of UNFORGETTABLE AGONY. You can't take your eyes off it.\n\n                              VICKI\n               Oh my God... I've seen this picture.\n\n                              KNOX\n               I guess so. Pulitzer Prize, 1963.\n\n                              VICKI\n               His face. Allie, look at his face.\n\n     TIGHT ON THE BOY'S contorted face, staring out in shock and \n     disbelief, his features recognizable across all the years \n     -- permanently, indelibly traumatized. The same face VICKI\n     saw in Halliday Plaza.\n\n                              KNOX\n               Yep. He watched the whole thing\n               happen. -- Recognize the beat cop?\n               Jim Gordon.\n\n                              VICKI\n               Oh, Bruce... \n\n                              KNOX\n               Something like this -- what do you\n               suppose this could drive a guy to?\n\n     INT. RESTAURANT - DAY\n\n     A greasy spoon off the lobby of the Globe building. KNOX\n     and VICKI in a booth.\n\n                              VICKI\n               Alexander, you are on drugs.\n\n                              KNOX\n               He walks out on his own party. Half\n               an hour later, the Caped Crusader\n               turns up in full bat-drag.\n                     (beat)\n               Sees an execution, freaks out in an\n               alleyway. No place to change.\n                     (smiling)\n               Yeah, Vicki, he's \"married\" all\n               right.\n\n                              VICKI\n               You're pissing me off, Allie. I know\n               exactly why you're doing this.\n\n                              KNOX\n                     (leaning forward)\n               Oh? Why is that, Vicki?\n\n     VICKI wilts under the challenge. She holds her silence for \n     a second, then changes the subject.\n\n                              VICKI\n               He's best friends with Jim Gordon\n               and Harvey Dent. They would know.\n\n                              KNOX\n               ... Okay, Vicki, I have a confession\n               to make. I'm the Batman.\n\n     VICKI snorts, rolls her eyes impatiently.\n\n                              KNOX (cont.)\n               Don't believe me? Why not?\n\n                              VICKI\n               Alexander... I know you.\n\n                              KNOX\n               Right. And they know him. And\n               that's why it would never occur to\n               them for a minute that their old\n               buddy Bruce puts on a cape at night\n               and goes out looking for --\n\n                              VICKI\n               This is pointless. I'm leaving.\n\n                              KNOX\n                     (grabbing her arm)\n               Your little chum is out of his mind.\n                     (relaxing his grip)\n               Next time you call him up and he\n               can't go out Friday night -- think\n               it over.\n\n                                                 CUT TO:\n\n     INT. ACE CHEMICAL CO. - DAY\n\n     LOW ANGLE on the JOKER. He stands on a catwalk high above \n     the refinery floor, lord of all he surveys, overseeing \n     production like a demented middle manager.\n\n     INT. STOREROOM - DAY\n\n     A dank, windowless room in the bowels of Ace Chemical, \n     which the JOKER has converted into a makeshift lair. SAP-\n     LIKE GOO drips in puddles from exposed pipes overhead.\n\n     CAMERA DRIFTS across the JOKER's cluttered desk. Shipping \n     manifests. Ledgers. PSYCHOTIC DOODLES scrawled in crayon.\n\n     More significantly: an old CONTRACT dating back to the mid-\n     seventies. It's half-obscured by other papers, but the \n     initials 'CIA' are plainly visible.\n\n     Then: a BOUND REPORT with the title 'DDID NERVE GAS: \n     RESULTS OF PRELIMINARY EXPERIMENTATION.' Across its title \n     page, a diagonal rubber stamp: 'DISCONTINUED January 1977.'\n\n     And finally: a sheaf of PHOTOS. Laboratory apes, chimps and\n     orangutans, all DEAD. Their LIPS are drawn back, exposing \n     HIDEOUS, CHEMICAL-INDUCED GRIMACES.\n\n     ON ONE WALL: POSTER-SIZED BLOWUPS of the grinning apes.\n\n     ON THE OPPOSITE WALL: a large-scale photographic \n     reproduction of the Gotham City skyline, its bottom half \n     HIDDEN FROM VIEW by the JOKER's desk.\n\n     The PHONE RINGS. The JOKER -- who has been sitting on the \n     floor by the cityscape -- POPS INTO FRAME and picks it up.\n\n                              JOKER\n               How's that first shipment coming?\n\n                              VOICE ON PHONE\n               Right on schedule. Oh, we got that\n               address for you -- 79 East End,\n               #12-C.\n\n                              JOKER\n               Mmm. How'd you find it?\n\n                              VOICE ON PHONE\n               Called her agent.\n\n     The JOKER nods in satisfaction and resumes his place on the \n     floor. Like a happy kindergartener, with paste pot and \n     scissors, he's CLIPPING PHOTOS from a magazine -- horrible \n     scenes of death, destruction, panic, mutilation.\n\n     One by one, he's PASTING these shots on the blowup of \n     Gotham city -- all along sidewalk level -- creating a \n     massive photomontage of ANARCHY IN THE STREETS.\n\n     We've seen these photos before. VICKI VALE took them... in \n     Corto Maltese.\n\n     INT. PHOTOGRAPHER'S STUDIO - DAY\n\n     In foreground, ROWS OF MAKEUP in startling profusion: \n     mascara, blusher, eyeliner, lipstick. HALF A DOZEN \n     BEAUTIFUL MODELS giggle into their makeup mirrors.\n\n     In the background VICKI wanders past with a stylish friend, \n     CLAIRE, who owns and operates the studio.\n\n                              CLAIRE\n               ... of course, after Corto Maltese,\n               this must all seem pretty tame.\n\n                              VICKI\n               Not to me. I need a job.\n\n                              CLAIRE\n               Now Vicki. Everyone knows you've\n               got your hooks in Bruce Wayne.\n\n                              VICKI\n               Then \"everyone\" must know something\n               I don't.\n\n                              CLAIRE\n                     (cattily)\n               Oh. Really. Well. -- Come on,\n               dear, Tony's dying to see you.\n\n     In a corner of the studio, TONY, a gaunt, tubercular Brit, \n     is shooting a swimsuit layout with two SUPERMODELS. They \n     all ad lib greetings to VICKI as TONY darts around \n     hyperkinetically, snapping the girls in a series of poses.\n\n                              TONY\n               Yes, ladies, smiles, show me\n               those smiles, fabulous, tropical\n               smiles, think Tahiti, I want to\n               see teeth, yes, those glorious\n               teeth --\n\n     As VICKI looks on, the SUPERMODELS freeze in place \n     simultaneously, a strange, STRICKEN LOOK on their faces.\n\n                              TONY (cont.)\n               My God no, don't stop now, those\n               smiles, I need those smiles --\n\n     Suddenly the girls are LAUGHING -- but the laughter is \n     unnatural, involuntary. VICKI, sensing that something is \n     terribly wrong, lays a hand on CLAIRE's arm.\n\n     The MODELS, now wearing HUGE SMILES, begin to TWITCH \n     SPASMODICALLY. TONY snaps away.\n\n                              TONY (cont.)\n               Yes! Oh baby, YES! That's --\n                     (beat)\n               No! Too far, too far! Pull back,\n               pull back!\n                     (dropping the camera)\n               OH MY GOD!\n\n     The SUPERMODELS PITCH TO THE FLOOR, shuddering \n     convulsively, their LIPS drawn back in FRIGHTFUL, FROZEN, \n     LAB-APE GRINS. VICKI GASPS. CLAIRE SCREAMS. TONY SCREAMS.\n\n                                                 CUT TO:\n\n     INT. TELEVISION STUDIO - EVENING\n\n     The Eyewitness News set, with anchors PATSY NARITA and\n     DAVE McELROY. Behind them, BLOWUPS of the two dead \n     SUPERMODELS.\n\n                              PATSY\n               The fashion world was stunned today\n               by the sudden deaths of top models\n               Kelly Brinkley and Christie Emberg.\n               Cause of death has been attributed\n               to a violent allergic reaction,\n               although authorities have not yet\n               ruled out the possibility of drug\n               use. Dave?\n\n     Behind DAVE, on the bluescreen: a HUGE STATUE, covered in \n     canvas -- not unlike New York's Statue of Liberty.\n\n                              DAVE\n               In Gotham, plans continue for the\n               city's 300th birthday celebration.\n               The four-day event will conclude\n               with the unveiling, in Gotham\n               Harbor, of the newly restored 'Lady\n               Gotham'... \n\n     A TECHNICIAN'S HAND passes a slip of paper into frame.\n\n                              DAVE (cont.)\n               This bulletin just in. Nine more\n               mysterious deaths at a beauty parlor\n               in --\n\n     Off to the left, PATSY begins to LAUGH. DAVE FROWNS.\n\n                              DAVE (cont.)\n               Patsy! This is hardly the --\n                     (his eyes widen)\n               PATSY!!\n\n     An offscreen CRASH. Suddenly DAVE is up out of his seat, \n     mouth agape in horror.\n\n     PATSY HAS GONE INTO CONVULSIONS. CAMERA WHIPS VIOLENTLY \n     RIGHT AND LEFT as she jerks out of her seat and TOTTERS \n     UNCONTROLLABLY across the set, LAUGHING INSANELY.\n\n     TECHNICIANS rush the soundstage in an unrehearsed frenzy. \n     PATSY spins like a dervish and LURCHES BACKWARD over the \n     newsdesk in a death spasm, giving us a quick look at the\n     grisly Joker's grin etched on her now-lifeless face.\n\n     DAVE gestures frantically to the cameraman:\n\n                              DAVE (cont.)\n               KILL THE CAMERA!! KILL THE --\n\n     Suddenly, CRACKLING VIDEO STATIC wipes out the screen. A \n     moment later, we're looking at:\n\n     SPLITSCREEN CLOSEUP - THE SUPERMODELS\n\n     Their gorgeous faces sprout BIG, ANIMATED-CARTOON GRINS as \n     a BOUNCY TUNE -- \"Put on a Happy Face\" -- comes up \n     underneath.\n\n                              MODELS (CARTOON VOICE)\n               ... Love that Joker!\n\n     INT. SUPERMARKET - DAY\n\n     THEME MUSIC CONTINUES as a grinning, deranged pitchman -- \n     THE JOKER -- pushes his shopping cart down the aisle. The \n     shelves are filled with products bearing his TRADEMARK \n     HARLEQUIN'S FACE. He waves merrily in time to the music.\n\n     INT. STUDIO - VIDEO CONTROL BOOTH - THAT MOMENT\n\n     PANICKED TECHNICIANS swarm the booth. The studio feed has \n     been JAMMED. Every monitor shows THE JOKER'S COMMERCIAL.\n\n                              DIRECTOR\n               WHERE'S IT COMING FROM??\n\n                              TECHNICIAN\n               I DON'T KNOW!\n\n     CLOSEUP - THE JOKER\n\n                              JOKER\n               ... new improved Joker brand. With\n               the secret ingredient... SMYLENOL!\n                     (a sweep of the hand)\n               Let's go to our blind taste test.\n\n     TIGHT ON an anonymous MAN -- GAGGED AND BLINDFOLDED, tied \n     to his chair, squirming, struggling. On the table before \n     him is a package labelled \"BRAND X.\" A SUPERIMPOSED TITLE \n     reads: \"NOT AN ACTOR.\"\n\n                              JOKER (cont.)\n               Ooh. He's tense. Irritable. Out of\n               sorts.\n                     (wagging a finger)\n               He's been using Brand X! But with\n               new improved Joker brand... \n\n     ANGLE WIDENS to include a BLINDFOLDED CORPSE, limp in his \n     chair, GRINNING HORRIFICALLY.\n\n                              JOKER (cont.)\n               ... it's a SMILE EVERY TIME!!\n\n     EXT. IDYLLIC PASTORAL SETTING - DAY\n\n     THE JOKER in a field of wheat. On a picnic blanket before \n     him are TWO CLEAN-CUT MODELS -- one male, one female, BOTH \n     DEAD... and GRIMACING HORRIBLY.\n\n                              JOKER (cont.)\n               -- and the world smiles with you!\n               Irresistable -- oh-so-kissable --\n\n     He grabs the dead MODELS by the hair. THEIR TEETH CLINK as \n     he forces their heads together for a post-mortem kiss.\n\n     SERIES OF SHOTS\n\n     Television sets all over Gotham, as startled citizens react \n     to the JOKER's maniacal promo.\n\n                              JOKER\n               I know what you're saying. Where can\n               I buy these fine, fine products?\n               Well, that's the gag, folks, you\n               never know. Chances are... you've\n               bought 'em already!!!\n\n     As his RANT CONTINUES, we SEE:\n\n     -    A YOUNG MAN watching the bedroom TV as he dresses for \n          a date. He's got an aerosol deodorant can poised under \n          one arm, ready to spray. He looks down at the can, \n          suddenly uncertain. Could it be...?\n\n     -    A FAMILY in their kitchen, eyeing a 12-inch portable \n          as MOM serves dinner. They dig in automatically, then \n          FREEZE with their forks in midair.\n\n     -    A MIDDLE-AGED MATRON at the living-room TV. Shocked, \n          she calls to her husband -- and gets no reply. We \n          FOLLOW HER to the bathroom door.\n\n          On the floor she sees AN OVERTURNED SHAMPOO BOTTLE. \n          Then: her HUSBAND, slumped down in the tub, a lethal \n          GRIN on his face. She lets out a SHRIEK.\n\n     INT. WAYNE MANOR - STUDY - NIGHT\n\n     ALFRED THE BUTLER in a crouch, glued to the tube.\n\n                              ALFRED\n               ... Sir!\n\n     HIS POV: THE JOKER in tight closeup. Offscreen, an INFANT \n     begins to squall. THE JOKER cocks an eyebrow.\n\n                              JOKER\n               Baby's got a tummyache? Here's\n               something that'll fix him quick!\n\n     He tosses a JOKER PRODUCT out of frame. Then -- leering -- \n     he gives the camera a BIG JUICY WINK.\n\n                              JOKER (cont.)\n               Now on your grocer's shelf. So\n               remember -- use Joker brand -- and\n               put on a happy face!!\n\n     MUSIC UP. VIDEO SNOW fills the screen as the jammed \n     transmission end. ALFRED looks over his shoulder.\n\n     TRACK IN ON THE GRIM, DETERMINED FACE OF BRUCE WAYNE.\n\n     SERIES OF SHOTS\n\n     -    The Gotham Globe cartwheeling into frame:\n\n                         PANIC GRIPS GOTHAM\n                Contaminated Products Claim 72 Lives\n                WHO IS THE MYSTERIOUS \"JOKER\"?\n\n     -    An ANCHORWOMAN on the evening news. Her complexion is \n          curiously sallow. BLACK BAGS show under her eyes.\n\n                              ANCHORWOMAN\n                  ... sixteen new deaths, with no clues\n                  as to the Joker's identity or\n                  demands. The list at potentially\n                  lethal products now includes:\n                  perfume -- mascara -- cold cream --\n\n     -    The makeover counter at Bloomingdale's. SECURITY \n          GUARDS rush to the scene as THREE MATRONLY CUSTOMERS\n          go into simultaneous smiling fits.\n\n     -    An ANCHORMAN with a BIG UGLY ZIT on his nose:\n\n                              ANCHORMAN\n                  Men's cologne toothpaste mouthwash\n                  -- underarm deodorant --\n\n     -    A SUBWAY CAR jammed with STRAPHANGERS. HUGE PATCHES OF \n          SWEAT under every arm. The doors slide open; ONCOMING \n          PASSENGERS RECOIL VISIBLY at the unendurable stench.\n\n     -    The original ANCHORWOMAN, whose look is now 100% \n          natural. Her hair is frizzy. Her eyebrows are missing \n          altogether. Every wrinkle on her face is plainly \n          visible.\n\n                              ANCHORWOMAN\n                  Hair spray -- eyebrow pencil --\n                  moisturizing cream --\n\n     -    A LARGE DRUGSTORE. CASHIERS sit idly by the registers. \n          The store is utterly devoid of customers.\n\n                                                 CUT TO:\n\n     EXT. STREET - DUSK\n\n     From across the street we see VICKI headed down the \n     sidewalk toward a museum. A GLOVED HAND reaches for a pay \n     phone.\n\n                              VOICE\n               She's outside the Fluegelheim.\n\n     INT. ALICIA HUNT'S PENTHOUSE - THAT MOMENT\n\n     A BONE-WHITE HAND slams a phone receiver down. THE JOKER is \n     at his vanity. He's rinsed his hair black. He's applying \n     pounds of pancake makeup to his bleached face, his puckered \n     cheeks. In the right light he could almost pass for human.\n\n     In all the city, he's the only person still using \n     cosmetics.\n\n     A DREAMY, DRUGGED VOICE intrudes:\n\n                              ALICIA\n               Jack? Who was that?\n\n     As he looks up at the mirror, we get a quick glimpse of \n     ALICIA behind him. The voice, the long blonde hair, are \n     unmistakable. But for some reason, ALICIA'S FACE is \n     COVERED... by a SHINY WHITE PORCELAIN DOLL'S MASK.\n\n                              JOKER\n               Get dressed. We're going out.\n\n     INT. FLUEGELHEIM MUSEUM - EVENING\n\n     A Gotham landmark, the Fluegelheim looks like something \n     Frank Lloyd Wright would've dreamed up -- a large open \n     atrium encircled by a stucco RAMP, which spirals up along \n     the interior walls to the CEILING four stories above. You \n     walk up this gently-inclined ramp to view the paintings.\n\n     INT. FLUEGELHEIM - ROOFTOP TEA ROOM - EVENING\n\n     The upper terminus of the ramp opens on an airy, fern-\n     filled dining room popular with tourists and elderly \n     matrons who work up an appetite looking at art. VICKI \n     enters, camera bag slung over one shoulder, portfolio in \n     hand.\n\n                              VICKI\n               I'm meeting Mr. Wayne. Is he here?\n\n                              MAITRE D'\n               No, but your table is ready.\n\n     INT. TEA ROOM - TWENTY MINUTES LATER - EVENING\n\n     VICKI, sipping on a gin and tonic, checks her watch. A \n     WAITER brings her a small parcel, wrapped in brown paper, \n     bearing a single word: URGENT.\n\n                              WAITER\n               Miss Vale, this just arrived for\n               you.\n\n     As the WAITER leaves, she tears off the wrapper. Inside is \n     a small white box and a NOTE -- SCRIBBLED IN CRAYON.\n\n               DEAR V. VALE,\n                    PUT THIS ON RIGHT NOW.\n\n     Unsigned, of course. VICKI, puzzled, opens the box to find \n     a MINIATURE GAS MASK.\n\n     She hears a strange HISSING NOISE. A few feet away, GREEN \n     SMOKE is billowing out of an air-conditioning vent.\n\n     TRAYS OF FOOD CRASH TO THE FLOOR as WAITERS pass out. ART \n     LOVERS drop forks, go face down in their pasta salad.\n\n     VICKI hurriedly fits the gas mask over her nose and mouth. \n     Within seconds, she's the only one conscious in the room.\n\n     INT. MUSEUM - THAT MOMENT\n\n     GREEN SMOKE plumes up toward the ceiling as we TILT DOWN \n     toward the floor of the atrium. PATRONS and SECURITY GUARDS \n     lie sprawled on the floor, twisted at odd angles, out cold.\n\n     The mist is beginning to clear now. The doors swing open \n     and in strolls THE JOKER, looking quite dapper in his\n     street makeup and BIG PURPLE PIMP'S HAT.\n\n     A SQUAD OF GOONS enters behind him. Some of them are \n     carrying large cartons. They lock the entry doors, place a \n     \"CLOSED\" sign in front of them, and begin uncrating LARGE \n     CANS OF BLACK PAINT.\n\n     The JOKER steps up onto the ramp, examines the artwork with \n     an appreciative eye.\n\n                              JOKER\n               Okay, boys, let's broaden our minds.\n\n     He stops in front of an Ingres odalisque. Stands back a \n     pace or two to get a better look. Then pulls out a STRAIGHT \n     RAZOR and cuts a LONG DIAGONAL GASH in the canvas.\n\n     He ambles up the ramp, stepping over collapsed patrons, \n     pausing at every fourth or fifth painting. Monet water \n     lilies, a Degas ballerina -- all get the razor treatment. \n     Behind him his CRONIES work their way up the ramp, HEAVING \n     BLACK PAINT on every canvas the JOKER has missed.\n\n     He cocks an eyebrow at Edvard Munch's \"THE SCREAM.\"\n\n                              JOKER (cont.)\n               I kinda like this one. Leave it.\n\n     INT. TEA ROOM - A MOMENT LATER - EVENING\n\n     VICKI at her table, still wearing the gas mask, scared as \n     hell. The overhead lights wink out and the room goes dark. \n     The JOKER saunters over and pulls up a chair.\n\n                              JOKER\n               I think it's safe to take that off.\n\n     VICKI recognizes the deranged smile instantly. She removes \n     the gas mask, tries to gather her wits.\n\n                              JOKER (cont.)\n               You're quite beautiful.\n\n                              VICKI\n               ... Thank you.\n\n                              JOKER\n               Unfortunate, but I think we can work\n               around it.\n\n     He sets a couple of CANDLESTICKS on the table and reaches \n     for his lighter. A LONG JET OF FLAME shoots out, Jerry \n     Lewis-style, as he lights the candles.\n\n                              JOKER (cont.)\n               You're Vicki Vale. I guess you know\n               who I am. -- Is this your\n               portfolio?\n\n     She nods. He opens it, begins leafing through the record of \n     VICKI's career. Newspaper photos from the Globe, at first.\n     Then fashion layouts, magazine covers of celebrities. \n     Artier B&W shots from VICKI's first couple of exhibitions.\n\n                              JOKER (cont.)\n               Crap. Crap. Crap, crap, crap... \n               Ahhh. Now here's what caught my eye.\n\n     He's come to the COMBAT PHOTOS from Corto Maltese.\n\n                              JOKER (cont.)\n               The panic. The bloody skulls. The\n               armless screaming fellows... you\n               know, the atrocities.\n                     (smirking)\n               Somehow, when you shoot it, it all\n               comes out so clean, so lovely.\n\n     VICKI is squirming, but she doesn't think it wise to debate \n     the point. Not with this lunatic, anyway.\n\n                              JOKER (cont.)\n               I guess I'm just an old cornball,\n               but... I live for beauty. I look\n               around at my little city, it gets me\n               down.\n                     (indicating the photos)\n               We don't have anything like this.\n               Well, it came to me that what this\n               city needs... is beautification. Kind\n               of a big makeover.\n                     (enraptured)\n               Miss Vale, I finally realized that\n               one man can make a difference. You\n               know the saying. \"In his image... \n               created he them\"?\n\n     VICKI gazes at the awful face of this deranged visionary, \n     getting more frightened by the minute.\n\n                              VICKI\n               And you want a --\n\n                              JOKER\n               A visual record, yes. A before-and-\n               after kind of thing.\n                     (leaning closer)\n               This could make your reputation.\n\n     Her first impulse is to get up and run. But she fights the \n     impulse. She won't run... not until she gets this maniac\n     on film. She reaches for her camera bag.\n\n                              VICKI\n               Maybe we should start with a\n               portrait of the artist. People might\n               like to see the face behind the\n               makeup.\n\n                              JOKER\n                     (momentarily puzzled)\n               ... Behind the makeup?\n\n     Then it sinks in. By candlelight, in the darkened \n     restaurant, with his pancake makeup and his black rinse \n     job, he looks practically normal. VICKI must think she's\n     looking at his real face!\n\n                              JOKER (cont.)\n               Oh. Yes. I see what you mean.\n\n     He finds a pitcher, pours a glass of water, and very \n     carefully SETS IT ON THE TABLE in front of VICKI. Then -- \n     suddenly, inexplicably -- HE BARKS AT HER:\n\n                              JOKER (cont.)\n               Silly little TWIT -- I can't take\n               you ANYWHERE!\n\n     He sits back and grins expectantly. VICKI is thoroughly \n     nonplussed by this bizarre outburst. A moment passes.\n\n     He obviously wants her to do something, but she hasn't\n     got a clue as to what it is. Growing impatient now, he \n     POINTS at the WATER GLASS:\n\n                              JOKER (cont.)\n               Well? What are you waiting for??\n\n     Now VICKI gets the point. She picks up the glass and HURLS \n     ITS CONTENTS in THE JOKER'S FACE.\n\n     His hands go up. He writhes. He shrieks -- like the Wicked \n     Witch of the West dissolving. He reaches for a napkin to \n     wipe his face clean... and begins to CACKLE.\n\n     His awful white-and-green clown's face revealed behind the \n     running makeup, he LEERS at her.\n\n                              JOKER (cont.)\n               You see, Miss Vale -- that was my\n               makeup.\n                     (leaning forward)\n               What do you think?\n\n     VICKI is repulsed, but she's determined to tough it out.\n\n                              VICKI\n               I've seen worse. Much worse.\n\n                              JOKER\n               Strong stomach, huh? I like that in\n               a woman. -- Maybe we can do business\n               after all.\n\n     He seems to have calmed down a bit. It's almost as if he's \n     coming on to her. But just then, a tiny BELL sounds behind \n     them... and a VOICE intrudes:\n\n                              VOICE\n               Jack?\n\n     The JOKER turns. ALICIA steps out of a ROOFTOP ELEVATOR and \n     moves toward them, drugged, wraithlike. She's still wearing \n     the porcelain DOLL'S MASK we saw earlier.\n\n                              JOKER\n                     (to VICKI)\n               Christ, it's my girlfriend.\n                     (to ALICIA)\n               WHAT?\n\n                              ALICIA\n               You said I could look at the\n               pictures before you -- before you --\n\n                              JOKER\n               Shucks, honey, I forgot.\n                     (rolling his eyes at\n                      VICKI)\n               I'm in trouble now.\n                     (to ALICIA)\n               This is business, sweetie. Why don't\n               you go outside and see how the boys\n               are coming?\n\n     VICKI can't take her eyes off this strange figure drifting \n     eerily through the abandoned tea room.\n\n                              VICKI\n                     (hesitantly)\n               ... Why the mask?\n\n                              JOKER\n               Alicia! Come here, have a seat. Show\n               Miss Vale why you wear the mask.\n\n     ALICIA sits down numbly and begins to undo the mask.\n\n                              JOKER (cont.)\n               You see, Miss Vale, Alicia's beautiful.\n               One in a million. A work of art. In \n               fact... \n\n     We're looking at ALICIA's profile as the mask comes off. \n     The side that's turned to us is indeed beautiful. But the \n     side we can't see... SENDS VICKI RIGHT OVER THE EDGE.\n\n                              JOKER (cont.)\n               She makes you look sick.\n\n     VICKI lurches out of her seat, knocking it over, HER FACE \n     FROZEN IN HORROR. She finds her CAMERA, holds it out like a \n     weapon as THE JOKER advances on her.\n\n                              VICKI\n               You SCUM! You SICK FILTH!... You DID\n               THAT to her!\n\n                              JOKER\n               What? I improved her a little... \n\n     VICKI backs away, snapping the shutter on her camera. HE \n     BLINKS as the flash gun goes off repeatedly.\n\n                              VICKI\n               I'll see you burn. I'll see you dead.\n               -- GET AWAY FROM ME!!\n\n                              JOKER\n               Miss Vale, was it something I said?\n                     (brightly)\n               Do you want to sniff my flower?\n\n     There's a BRIGHT PURPLE BOUTONNIERE in his lapel. He holds \n     it up for VICKI's inspection as he moves menacingly closer.\n\n                              VICKI\n               NO!\n\n     The JOKER squeezes a concealed BULB. A JET OF CLEAR LIQUID \n     spurts out of the FLOWER, NARROWLY MISSING VICKI.\n\n     She GASPS. BUMPS INTO A TABLE. ACRID BLACK SMOKE rises from \n     the floor where the clear liquid hit. Acid.\n\n                              JOKER\n               Come on, Miss Vale... STOP AND SMELL\n               THE ROSES!!\n\n     He backs VICKI into a corner. And then -- abruptly --\n\n     A SKYLIGHT SHATTERS IN A HAIL OF GLASS! A CAPED SHADOW \n     DROPS TO THE FLOOR OF THE RESTAURANT! And THE JOKER is face \n     to face with... \n\n     THE BATMAN!\n\n     On his wrist is a STEEL GAUNTLET. Ha AIMS IT at the JOKER \n     like a weapon. Then PIVOTS SUDDENLY -- POINTS HIS ARM \n     THROUGH THE DOOR OF THE RESTAURANT --\n\n     -- AND FIRES A METAL SPIKE into the adobe wall of the RAMP \n     OUTSIDE!!\n\n                              JOKER (cont.)\n               ... YOU!!\n\n     On the end of the spike is a CORD leading to BATMAN's belt. \n     In the wink of an eye he's GRABBED VICKI -- DRAGGED HER OUT \n     OF the tea room -- and PLUNGED OVER THE RAMP WALL, FOUR \n     STORIES STRAIGHT DOWN TO THE ATRIUM FLOOR BELOW!!!\n\n     The JOKER races to the edge of the ramp.\n\n                              JOKER (cont.)\n               GET 'EM!! GET 'EM!!\n\n     His GOONS are stationed at various points along the ramp, \n     still defacing masterpieces. They pull their guns and OPEN \n     FIRE as BATMAN and VICKI plummet past.\n\n     ANGLE ON BATMAN AND VICKI - AS THEY FALL\n\n     He holds the gauntlet overhead, ROPE whistling through it. \n     As we watch, the gauntlet sprouts STEEL WINGS -- forming a \n     BULLETPROOF SHIELD over their heads!\n\n     TWO FEET ABOVE the marble floor, THE ROPE jerks them up \n     short -- like a bunjee cord. GUNS BLAZE as BATMAN and VICKI \n     drop safely to earth and MAKE FOR THE EXIT.\n\n     The doors are LOCKED. BATMAN spots the black \"CLOSED\" sign \n     on a metal stand. He HEAVES IT through the glass doors.\n\n     VICKI hustles through. He points her to a side alley.\n\n     EXT. SIDE ALLEY - THAT MOMENT - DUSK\n\n     VICKI rounds the corner just as BATMAN lobs a SMOKE PELLET \n     into the doorway of the Fluegelheim.\n\n                              BATMAN\n               GET IN THE CAR!\n\n                              VICKI\n               WHICH CAR?\n\n     VICKI suddenly feels quite stupid. Because -- while there \n     are many cars parked along the side alley -- there is only \n     one BATMOBILE.\n\n                              VICKI (cont.)\n               ... Oh.\n\n     The BATMOBILE is sleek, futuristic, and... well, \n     indescribable. Imagine your own. VICKI climbs into the \n     passenger seat and is immediately dazzled by a stunning \n     array of electronic gadgetry.\n\n                              BATMAN\n               Ignition!\n\n     As BATMAN sprints down the alley, a COMPUTER DISPLAY on the \n     dashboard registers his unique voiceprint. A tinny, \n     synthesized VOICE repeats the command:\n\n                              COMPUTER\n               Ignition.\n\n     The engines are revving up even as BATMAN vaults into the \n     cockpit alongside VICKI.\n\n     Guns in hand, the JOKER'S GOONS Are stumbling out of the \n     Fluegelheim, hacking, coughing, blinded by smoke. They DIVE \n     FOR THEIR LIVES as the BATMOBILE comes barrelling out of \n     the alley at ninety miles an hour.\n\n     THE JOKER emerges just as the BATMOBILE careens off.\n\n                              JOKER\n               I WANT HIM!! I WANT HIM!!\n\n     The JOKER climbs into the back of a van labelled \"MONARCH \n     PLAYING CARDS.\"  Half his GOONS pile into the van behind \n     him, the other half into a second car nearby.\n\n     EXT. STREETS - THAT MOMENT\n\n     SIRENS HOWL as POLICE CARS converge on the Flugelheim.\n\n     INT. BATMOBILE - THAT MOMENT\n\n     roaring out into CITY TRAFFIC.\n\n                              VICKI\n               Look! Police!\n\n                              BATMAN\n               I called them.\n\n                              VICKI\n               Shouldn't we --\n\n     A POLICE CAR whizzes past the BATMOBILE. TIRES SKID. The \n     COP CAR does a quick 180 and sets out in hot pursuit of the \n     BATMOBILE. BATMAN FLOORS THE ACCELERATOR in response.\n\n     INT. VAN - THAT MOMENT\n\n     TIGHT ON the demented face of THE JOKER. A GOON calls out \n     from the front of the van.\n\n                              GOON\n               There they are! Dead ahead!\n\n     THE JOKER screams into a RADIO DISPATCHER'S MIKE.\n\n                              JOKER\n               ALL UNITS! SOUTHBOUND ON RIVERVIEW!\n\n     SERIES OF SHOTS\n\n     The JOKER'S ARMY. THUGS in cars. CREEPS in Italian \n     restaurants. CROOKED COPS at a coffee shop. LIGHTS FLASH, \n     BEEPERS SOUND, and within seconds they're racing to the \n     streets, eager to join the chase.\n\n     SERIES OF SHOTS - THE STREETS\n\n     COP CARS. GOON CARS. THE BATMOBILE streaks through an \n     intersection, nearly causing a pileup. THE JOKER'S VAN \n     makes short work of a SABRETT'S HOT DOG STAND in its path.\n\n     INT. BATMOBILE - THAT MOMENT\n\n     PEDESTRIANS GAWK as the sleek supercar RIPS UP THE \n     PAVEMENT.\n\n                              VICKI\n               What about her? What about the girl?\n\n                              BATMAN\n               He won't kill her.\n                     (gritting his teeth)\n               GODDAMMIT!\n\n     They're moving up on an EMPTY BLOCK -- a NIGHT CONSTRUCTION \n     TEAM. A HUGE PIECE OF HEAVY MACHINERY backs up slowly and \n     inexorably, BLOCKING THE INTERSECTION.\n\n     BATMAN GUNS THE ENGINE. SWERVES LEFT. TRIES TO SLIDE PAST. \n     And HITS THE BRAKES -- stopping inches short of a head-on \n     collision with a lamppost.\n\n     He jumps out of the car. No chance to get through. THE \n     JOKER'S VAN is two blocks back and coming up fast.\n\n     ONLOOKERS and CONSTRUCTION WORKERS are beginning to form a \n     crowd around them.\n\n                              VICKI\n               Can't we --\n\n                              BATMAN\n               Too many people. Come on!\n                     (as she scrambles out)\n               SHIELDS!!\n\n     The BATMOBILE's computerized VOICE replies:\n\n                              COMPUTER\n               Shields.\n\n     With a series or CLANGS, CHROME-STEEL PLATES slide into \n     place -- across the cockpit, over the tires -- leaving the \n     BATMOBILE an inert, impenetrable BLOCK OF BLACK METAL.\n\n     BATMAN and VICKI sprint through the CONSTRUCTION SITE, \n     vaulting over mounds of loose dirt and concrete rubble.\n\n     INT. VAN - MOVING - NIGHT\n\n     THREE POLICE CARS, red lights blazing, OVERTAKE THE JOKER'S \n     VAN and bear down on the abandoned BATMOBILE.\n\n                              GOON AT WHEEL\n               Are they ours?\n\n                              JOKER\n               ... I don't know. We'd better get out\n               of here.\n                     (into RADIO MIKE)\n               Westbound on 36th. DO YOU COPY??\n\n     The VAN does a discreet U-turn and rumbles off sedately \n     down the street.\n\n     EXT. SIDE STREET - THAT MOMENT - NIGHT\n\n     BATMAN and VICKI zigzag past storefronts and candy stands, \n     dodging astonished PEDESTRIANS.\n\n     INT. CAR - MOVING - THAT MOMENT\n\n     FOUR GOONS with GUNS. They spot BATMAN and VICKI coming off \n     the side street. GOON I, the driver, speaks into a radio:\n\n                              GOON I\n               We got 'em!\n\n                              JOKER (V.O.)\n                     (over radio)\n               Take 'em! I want his head!\n\n     EXT. STREET - THAT MOMENT - NIGHT\n\n     BATMAN and VICKI race down the sidewalk. The car is gaining \n     on them; and then, from behind --\n\n     BATMAN and VICKI are caught in a SPRAY OF BULLETS. They \n     dive. Drop behind a parked car. And don't come up.\n\n     They've ducked into a BLIND ALLEY.\n\n     INT. ALLEYWAY - NIGHT\n\n     Hunkered on the pavement, they watch the car glide past the \n     mouth of the alley. VICKI sighs in relief. BATMAN -- still \n     alert, his muscles tensed -- puts a restraining hand on her \n     arm. He looks overhead, sees a catwalk spanning the width \n     of the alleyway five stories up.\n\n                              BATMAN\n               How much do you weigh?\n\n                              VICKI\n               ... A hundred and eight?\n\n     He does some quick mental calculations. A beat. Then the \n     CAR reappears -- backing up -- blocking their only avenue \n     of escape. BATMAN unfurls a rope, HEAVES A BATARANG UPWARD, \n     and grabs VICKI roughly about the waist.\n\n                              BATMAN\n               HANG ON!\n\n     The JOKER'S THUGS pile out of the car. The BATARANG catches \n     on the catwalk, and BATMAN triggers the spring-action REEL \n     on his utility belt -- jerking him and VICKI INTO THE AIR.\n\n     BULLETS zing past as they whip upward like fish on a line. \n     One story; two stories; and then... \n\n     They slow. They STOP. They DANGLE IN MIDAIR as the Joker's \n     goons advance. BATMAN wriggles, twists. They lurch upward \n     another few feet -- and stop again. VICKI SCREAMS.\n\n     Her additional weight is too much for the reel mechanism. They're\n     stranded two stories up -- SITTING DUCKS.\n\n                              BATMAN (cont.)\n               Whatever happens -- DON'T LET GO!!\n\n     In the wink of an eye he's detached the reel from his own \n     waist and hitched it around VICKI's belt. Before she has a \n     chance to protest, he LETS GO.\n\n     VICKI rockets upward at blinding speed, shrieking all the \n     way. BATMAN, his cape billowing, PLUMMETS DOWNWARD.\n\n     VICKI slams up into the catwalk and BOBS on the end of the \n     line as BATMAN lands with a loud crash, overturning a row \n     of garbage cans. The GOONS are on him in a flash -- one per \n     limb. Random kicking and flailing. BATMAN manages to slam \n     two GOONS into a wall, but before he can get to his feet --\n\n     -- GOON #3 slams a lead pipe into the back of his skull.\n\n     BATMAN is down for the count. The THUGS dust themselves off \n     and circle around his prostrate form, still wary.\n\n     The LEAD THUG holds his colleagues back, draws his gun, and \n     fires TWO SHOTS, point-blank, at the yellow-and-black \n     INSIGNE on BATMAN's chest. The body jerks.\n\n     They move closer. And stop.\n\n                              GOON I\n               ... No blood.\n\n                              GOON II\n               Jesus.\n\n                              GOON III\n               Wait a minute.\n\n     GOON III screws up his courage and crouches beside the \n     body. He examines THE BATMAN'S TUNIC... and RIPS IT OPEN.\n\n                              GOON IV\n               ... What is that?\n\n                              GOON III\n               Some kind of body armor.\n\n                              GOON I\n               He's human after all. -- Take that\n               mask off.\n\n     EXT. ROOFTOP - ON VICKI\n\n     Five stories overhead, VICKI has pulled herself up onto the \n     roof of the adjacent building. She watches transfixed as \n     the THUGS bend over to remove BATMAN's cowl. But at this \n     height -- and this angle -- she can't see his face. On a \n     sudden impulse she reaches for her CAMERA BAG.\n\n     ANGLE ON GOONS\n\n     peering-down open-mouthed at the unconscious face of BRUCE \n     WAYNE. Blood seeps from BRUCE's left nostril.\n\n                              GOON I\n               Well?... Who is this guy?\n\n                              GOON II\n               I dunno. You seen him before?\n\n                              GOON III\n               Maybe he's got some kind of I.D.\n\n                              GOON IV\n               Good idea. Let's check his wallet.\n\n                              GOON I\n               We'll worry about it later. Plug\n               him.\n                        (beat)\n               In the head.\n\n     GOON II draws his automatic. And at that very instant... A \n     FLASH GUN EXPLODES OVERHEAD.\n\n     Startled, the THUGS look up. ANOTHER CAMERA FLASH.\n\n                              GOON III\n               Goddam, it's the redhead!\n\n     ON VICKI\n\n     A chunk of ledge chips off mere inches from her head as the \n     GOONS OPEN FIRE. She ducks back behind the overhang, holds \n     the camera out over the ledge, and KEEPS ON FLASHING.\n\n     ON BRUCE\n\n     HIS EYES WINK OPEN.\n\n     ON VICKI\n\n     momentarily idle. She's used up her roll. The GOONS KEEP \n     SHOOTING as she reaches in her bag for new film. She finds \n     it, loads the camera with astonishing dexterity -- and \n     then, on instinct, reaches back inside the bag for a \n     TELEPHOTO LENS. All the better to see you with, Batman... \n\n     ON THE THUGS\n\n     No response from VICKI. They begin to relax a little.\n\n                              GOON II\n               Did you hit her?\n\n                              GOON I\n               Who cares? Wax that freak.\n\n     They turn their attention to BRUCE. A GLOVED HAND snakes \n     out with lightning speed -- GRABBING GOON I BY THE COATTAIL \n     and pulling him DIRECTLY INTO THE LINE OF FIRE. GOON II bas \n     pulled the trigger twice before he knows what's happened.\n\n     In one fluid motion BRUCE HEAVES GOON I's lifeless body \n     THROUGH THE AIR, knocking GOON II backward over a garbage \n     can. GOON II falls and CRACKS HIS HEAD on the nearest wall.\n\n     GOON III takes a rabbit punch to the throat. He's on the \n     way down when he catches a STEEL-TOED BOOT in the gut.\n\n     Four seconds after all this began, BRUCE is alone in the \n     alleyway with GOON IV. GOON IV has his gun pointed right at \n     BRUCE, but he's shaking too much to pull the trigger.\n\n     BRUCE smiles. GOON IV SCREAMS and RUNS FOR HIS LIFE.\n\n     Through all this, VICKI's telephoto camera has been poised \n     on the ledge, snapping away. BRUCE looks up at the FLASH \n     GUN and shakes his head. He bends to retrieve his cowl.\n\n     ON VICKI\n\n     She finally dares to peek down at the alley. Limp goons \n     everywhere. And, in addition, THE BATMAN -- leaping up, \n     grabbing the edge of a fire escape, climbing up to meet \n     her.\n\n     VICKI thinks fast. She may have a clean shot of BATMAN'S \n     FACE. She advances the film in the camera and removes the \n     roll, then drops it down her blouse.\n\n     But BATMAN is likely to want that roll. So she straightens \n     her skirt and scurries across the roof, away from the \n     alley. She should have a minute or so before be gets there.\n\n     It's a three-foot drop to the next roof over. VICKI \n     clambers down and quickens her pace, tossing a nervous \n     glance over her shoulder every couple of steps.\n\n     Then, somehow -- and she'll be damned if she can figure out \n     how -- she walks smack into THE BATMAN. And GASPS.\n\n                              BATMAN\n               ... Not even a 'thank you'?\n\n                              VICKI\n               Well -- I think you might consider\n               thanking me. You were good as\n               dead.\n\n                              BATMAN\n               That's because you lied about your\n               weight.\n                     (a long pause)\n               Thank you.\n\n     VICKI NODS and tries to walk past him. He grabs her arm.\n\n                              BATMAN (cont.)\n               I'll have to ask you for that film.\n\n                              VICKI\n               I just wanted to distract them. I\n               wasn't trying to get a picture of\n               you.\n\n     BATMAN looks down at the camera hanging from her neck. The \n     telephoto lens must jut out six inches. VICKI gulps.\n\n                              BATMAN\n               Please.\n\n                              VICKI\n               I won't let you have it.\n\n     THE BATMAN is amused. He smiles menacingly.\n\n                              VICKI (cont.)\n               I know you can break my neck and\n               take it. But the Joker's on that\n               same roll. I --\n\n                              BATMAN\n               The Joker is a murderer. And you\n               were as good as dead. So --\n\n                              VICKI\n               Look, I appreciate what you did for\n               me. But this is my job. And I'm\n               keeping those pictures.\n\n                              BATMAN\n               All right, here's a compromise. I'll\n               develop the photos. You keep the\n               Jokers and I'll keep the rest.\n\n                              VICKI\n               How do I know you won't keep them\n               all?\n\n                              BATMAN\n               Because I'll take you with me.\n\n     He reaches out, holds her gently by the shoulders. His \n     voice is deep and soothing. True, VICKI is a little dizzy \n     from all that's happened, but she's undeniably drawn to \n     him.\n\n     Still cautious, though. She reaches into her bag and hands \n     over a roll of film. The original roll -- not the telephoto\n     shots, which are still stashed in her blouse.\n\n                              BATMAN (cont.)\n               Thank you, Vicki.\n\n                              VICKI\n               ... Where are you going to take me?\n\n     No reply. She looks up into his mirrored eyes. He pulls her \n     closer to him. Brushes back her hair, runs one hand \n     delicately along the line of her cheek... \n\n     ... AND BREAKS A TINY CAPSULE under her nose. VICKI SLUMPS \n     into BATMAN's arms.\n\n                                                 CUT TO:\n\n     EXT. ALLEYWAY - NIGHT\n\n     Street level. BATMAN emerges carrying VICKI's inert form in \n     his arms. He pauses and peers around the edge of a wall at \n     the BATMOBILE two blocks down.\n\n     The car is still there, the chrome-steel shields intact. \n     But DOZENS OF COPS and CURIOSITY-SEEKERS are SWARMING ALL \n     OVER the fearsome machine.\n\n     BATMAN snorts in frustration. AN ENORMOUS THREE-TON \n     CATERPILLAR WINCH rumbles up the street toward the \n     Batmobile.\n\n     He's about to get towed. BATMAN takes a RADIO TRANSMITTER\n     from his utility belt and SPEAKS INTO IT.\n\n                              BATMAN\n               Shields open.\n\n     EXT. STREET - ON BATMOBILE\n\n     TWO COPS are crawling along the hood of the car. From \n     within they hear the tinny computerized voice:\n\n                              COMPUTER\n               Shields open.\n\n     The steel plates begin to retract.\n\n                              BATMAN (V.O.)\n                     (over radio)\n               Ignition.\n\n                              COMPUTER\n               Ignition.\n\n     The stunned COPS gaze into the Batmobile's cockpit.\n\n                              COP\n               There's somebody in there!\n\n     They TUMBLE OFF THE HOOD as the turbine engines ROAR TO \n     LIFE and THE BATMOBILE BEGINS TO MOVE.\n\n     COPS AND ONLOOKERS quickly clear a path. They stand there \n     stunned as the futuristic auto PICKS UP SPEED and advances \n     toward the end of the block. The LEFT TURN SIGNAL flashes \n     dutifully. And the BATMOBILE VANISHES AROUND THE CORNER.\n\n     PANDEMONIUM BREAKS LOOSE as the COPS bolt for their cars.\n\n     EXT. STREET - NIGHT\n\n     SIRENS WAIL. PASSERSBY STARE SLACKJAWED at the driverless \n     BATMOBILE as it tears down the street, passing, darting, \n     dodging buses and CUTTING OFF TAXIS -- all with a squad of \n     COP CARS in hot pursuit.\n\n     EXT. ALLEYWAY - NIGHT\n\n     BATMAN sees the BATMOBILE rounding the corner and \n     approaching on the straightaway. He takes VICKI in his arms \n     and STEPS DIRECTLY INTO THE PATH OF THE ONRUSHING \n     HEADLIGHTS.\n\n                              BATMAN\n               STOP!\n\n     BRAKES SQUEAL. The BATMOBILE stops one yard short of BATMAN \n     and VICKI. A moment later BATMAN is AT THE WHEEL.\n\n     SIRENS BUILD. LIGHTS FLASH. The COP CARS are now visible \n     behind them. BATMAN floors the pedal; the Batmobile's \n     powerful AFTERBURNERS kick in; and the hapless cops KILL \n     THEIR SIRENS as BATMAN zooms off into the night at 140 mph.\n\n                                                 DISSOLVE TO:\n\n     EXT. BACK ROAD - NIGHT\n\n     A deserted stretch of road, lined by ancient tall pines on \n     either side. The BATMOBILE roars past.\n\n     INT. BATMOBILE - NIGHT\n\n     VICKI is gradually coming to on the passenger's side.\n\n                              VICKI\n               ... How long have I been out?\n\n                              BATMAN\n               Quite a while. I took the scenic\n               route.\n\n                              VICKI\n                     (gazing around her)\n               Well, I've certainly enjoyed it.\n               What's that?\n\n     He's just hit a BUTTON on the dashboard.\n\n                              BATMAN\n               Garage door.\n\n     EXT. ROAD - THAT MOMENT - NIGHT\n\n     At the side of the road, a FALLEN TREE, surrounded by \n     underbrush, RISES HYDRAULICALLY INTO THE AIR -- revealing a \n     SECRET ROAD invisible from the main thoroughfare.\n\n     Doing sixty, the BATMOBILE makes a hairpin turn. Seconds \n     later, the FALLEN TREE drops back magically into place.\n\n     INT. BATMOBILE - A MOMENT LATER - NIGHT\n\n     As they cruise down the hidden road, VICKI STUDIES BATMAN'S \n     FACE. KNOX's words are very much on her mind.\n\n                              VICKI\n               I meant to ask you. Up on the roof\n               -- how did you know my name?\n\n     BATMAN SMILES in response. VICKI smiles with him.\n\n                              VICKI (cont.)\n               I'm serious. How did you know?\n\n     No reply. VICKI frowns, looks through the windshield, and \n     SEES -- much to her horror -- an enormous SHEER CLIFF WALL \n     LOOMING DEAD AHEAD.\n\n     Wide-eyed, she looks at BATMAN. Still smiling, he HITS THE \n     GAS -- SPEEDING UP. She lets out a SCREAM.\n\n     ANGLE ON CLIFF WALL\n\n     One second to impact. Suddenly the cliff wall VANISHES \n     ALTOGETHER -- revealing, in its place, the GAPING MOUTH OF \n     AN UNDERGROUND CAVERN.\n\n     The Batmobile zooms through. A moment later, the CLIFF WALL \n     -- which is nothing more than a HOLOGRAPHIC PROJECTION -- \n     winks back into existence, showing no trace of the cavern.\n\n     INT. BATCAVE - NIGHT\n\n     We all know this place. Although we haven't had time to \n     acquire the familiar mementos -- the dinosaur, the giant \n     penny -- the BATCAVE is unmistakable. Vast banks of \n     blinking computers. A state-of-the-art crime lab. A fully-\n     equipped workshop for hammering out new toys. It's the \n     biggest and best secret clubhouse a boy could wish for.\n\n     BATMAN climbs out of the car. He removes his cape, strips \n     off his bullet-riddled jersey and his body armor. There are \n     TWO BIG BRUISES on the center of his chest.\n\n     VICKI looks on as he goes to a rack along one wall and \n     picks out a fresh tunic -- one of four. She wanders over to \n     examine the row of bat-suits -- and the BODY ARMOR.\n\n                              VICKI\n               What is this stuff? Kevlar?\n\n                              BATMAN\n               Better. It's not on the market yet.\n\n                              VICKI\n               It doesn't protect your head,\n               though.\n\n                              BATMAN\n               That's why I wear a target on my\n               chest.\n\n     THE BATMAN takes obvious pleasure in showing her his \n     futuristic bachelor's pad. His tone is jokey, almost \n     flirtatious. Behind the mask, he's a lot looser, more \n     carefree, than some guys we could name... \n\n     ... like Bruce Wayne.\n\n     VICKI is, to put it mildly, awed. She wanders around gaping \n     at millions of dollars' worth of equipment.\n\n                              VICKI\n               How'd you find this place?\n\n                              BATMAN\n               Stumbled across it when I was a boy.\n\n     VICKI'S HEAD jerks up abruptly. In the dim recesses \n     overhead, BATS ARE SCREAMING. She shivers.\n\n                              BATMAN (cont.)\n               They don't come down here. They're\n               afraid of the lights.\n\n                              VICKI\n               I don't like bats. Not that kind.\n\n                              BATMAN\n               They used to terrify me. But I\n               forced myself to keep coming back,\n               and --\n                     (smiling)\n               -- I guess I became the thing I\n               feared the most. I'll do your photos\n               now.\n\n     He goes to a HIGH-SPEED PHOTO PROCESSING MACHINE -- the \n     kind they have at Fotomat, only better -- and loads the \n     roll.\n\n     VICKI wanders over to the edge of a DEEP BLACK PIT. She \n     kicks a pebble over. Long seconds pass; no sound.\n\n     She looks up. Suspended over the bottomless pit are a pair \n     of GYMNAST'S RINGS. This guy is dedicated.\n\n                              VICKI\n               Who pays for all this?\n\n                              BATMAN\n               I have sponsors.\n\n                              VICKI\n               The computers?\n\n                              BATMAN\n               I'm running a check on the tainted\n               products. There is a pattern.\n               Beauty products. Personal hygiene.\n\n                              VICKI\n               No more makeup. -- Looks like we'll\n               all be showing our true faces now.\n\n     She looks straight at him. It's almost a direct request. \n     But BATMAN is preoccupied with the matter at hand.\n\n                              BATMAN\n               I've tracked all the records. Every\n               shipment, every warehouse, every\n               loading dock. Nothing. No\n               opportunities for tampering. Somehow\n               the Joker is supplying tainted\n               ingredients... at the source.\n\n                              VICKI\n               Wait. You can just tap into any\n               corporate database you want?\n               Anywhere?\n\n                              BATMAN\n               Oh, no. I let the FBI do that. Then\n               I tap into the FBI. -- Your photos\n               are ready.\n\n     He holds up a hand to VICKI: stand back. Then he checks out \n     the pictures -- SMILING as he shuffles through the prints.\n\n                              VICKI\n               You could've killed him, you know.\n               You could have killed the Joker.\n\n                              BATMAN\n               I had to save you, Vicki.\n                     (turning to face her)\n               Here you go. I think I'll let you\n               keep the whole set.\n\n     She looks at the photos. Joker. Joker. Joker. And four \n     shots of the BATMAN in action. He's without his mask, but \n     there's no clean angle on his face.\n\n     VICKI doesn't quite know why, but her head is reeling.\n\n                              BATMAN (cont.)\n               Care for an autograph?\n\n     He takes one of the prints, scrawls on it, hands it to her \n     with the inscription: \"TO VICKI. LOVE, B.\"\n\n     Now he turns to shut down the photo machine. VICKI is \n     trembling. Her hand goes to her belt, finds the telephoto \n     roll concealed in her blouse. She steps up silently behind \n     him, reaches for his cowl. At the last second... she STOPS.\n\n                              VICKI\n               ... Bruce?\n\n     HE FREEZES IN PLACE for an indecisive moment. Then:\n\n                              BATMAN\n               Are you talking to me?\n\n     He turns in seeming incomprehension. And shows her a \n     SMILE... the same crooked, curious, childlike smile she saw \n     on BRUCE's face that morning when she caught him singing.\n\n                              BATMAN (cont.)\n               Maybe we've had enough for one\n               night. I'll take you home.\n\n     Almost in a trance now, she lets him lead her to the \n     BATMOBILE. As she takes her seat he reaches into his \n     utility belt for another KNOCKOUT CAPSULE.\n\n                              BATMAN (cont.)\n               Do you want to do it this time?\n\n     VICKI doesn't move. She looks at the capsule in her hand as \n     he walks over to the driver's side and gets in.\n\n                              BATMAN (cont.)\n               Don't be afraid. I'm here.\n\n     She takes one last look at the familiar SMILE beneath the \n     mask... then breaks the capsule and BREATHES DEEP.\n\n     FLAME ERUPTS from the rear of the Batmobile as the after-\n     burners kick in and BATMAN screeches off. A FIERY RED GLOW \n     fills the screen, BURNING OUT THE IMAGE as we\n\n                                                 DISSOLVE TO:\n\n     EXT. GOTHAM STREET - 1963 - NIGHT (DREAM SEQUENCE)\n\n     The red glow resolves itself into a DREAMLIKE STREET SCENE: \n     liquid, weightless figures moving in a tinted, soundless \n     cityscape as DISTANT, TINKLY CARNIVAL MUSIC plays \n     underneath. We're outside a theatre watching first-nighters \n     emerge from the opening of a hit musical.\n\n     In the crowd we pick out THREE FIGURES: DR. THOMAS WAYNE, \n     his wife MARTHA, and -- in THOMAS's arms -- their young son \n     BRUCE. BRUCE hasn't made it through the show. He's asleep, \n     head nestled peacefully against his father's shoulder.\n\n     THOMAS rouses the boy gently, sets him down on the \n     sidewalk. BRUCE rubs the sleep from his eyes as THOMAS puts \n     an arm around his wife. Together they begin walking.\n\n     IN A SINGLE CUT the crowd has DISAPPEARED, and the WAYNES \n     are walking toward us up a deserted street. THOMAS and \n     MARTHA are laughing, making jokes, reaching down to tousle \n     BRUCE's hair. Their FACES, as they draw closer, are FULL OF \n     JOY. And then, without warning --\n\n     A HANDGUN enters frame.\n\n     The WAYNES freeze in their tracks. THOMAS steps \n     protectively in front of his wife, reaches for his wallet, \n     begins unbuckling his watch. He won't put up a fight.\n\n     MARTHA's hand goes involuntarily to the PEARL NECKLACE at \n     her throat.\n\n     The GUNMAN sees it, gestures for her to hand it over. But \n     MARTHA is paralyzed, afraid to move.\n\n     The GUNMAN steps past THOMAS, SNATCHES AT THE NECKLACE.\n\n     The instant his wife is threatened, THOMAS ATTACKS. The \n     pearl strand BREAKS in the GUNMAN'S HAND as he drops toward \n     the sidewalk.\n\n     A SILENT BURST OF FLAME erupts from the muzzle of the gun.\n\n     THOMAS CRUMPLES. MARTHA emits a PIERCING SHRIEK -- a shriek \n     we cannot hear --\n\n     -- a shriek cut short by a second burst of flame.\n\n     BRUCE stands paralyzed in shock. THE GUNMAN scoops a \n     handful of pearls off the sidewalk, reaches for MARTHA's \n     purse, and rises slowly -- his gun levelled directly at the \n     boy.\n\n     Almost catatonic, BRUCE stares down at the corpses of his \n     parents. At their hands, somehow intertwined. At the tiny \n     glinting pearls and the spreading pool of blood around \n     them.\n\n     He looks up with a gaze so bleak, so petrifying... that the \n     GUNMAN turns and runs.\n\n     AND WE CUT. To an exact reproduction of the Pulitzer Prize-\n     winning photo... the cops bent over the bodies, the medics \n     with their stretchers, the boy BRUCE, his arms wrapped \n     tightly around the waist of OFFICER GORDON.\n\n     There's only one difference. BRUCE's head is turned away \n     from us. We can't see his face.\n\n     And now a HAND enters the frame. Much like the GUNMAN's \n     hand, but feminine, beckoning. BRUCE, hearing his name, \n     LOOKS UP; then, agonized, ashamed, he BURIES HIS FACE in \n     GORDON's side. GORDON gestures angrily at the intruder.\n\n     But the hand keeps beckoning. And ultimately BRUCE turns. \n     Showing us the tear-stained face from the famous photo. A\n     face slack with horror. The horror of his parents' death... \n     and more importantly, the horror that someone would dare to\n     violate this most private and terrible of moments.\n\n     At last we see what BRUCE sees: a WOMAN crouched on the \n     sidewalk nearby. The WOMAN is holding a camera. The WOMAN \n     is smiling prettily at BRUCE.\n\n     The WOMAN is VICKI VALE.\n\n     A FLASHBULB EXPLODES. FILLING. THE SCREEN with its blinding \n     white light, SCORCHING OUT THE IMAGE as a HARSH RINGING \n     SOUND cuts through the silence.\n\n                                                 CUT TO:\n\n     INT. BEDROOM - NIGHT\n\n     VICKI AWAKENS. She sits up in bed, tremulous, distraught. \n     The bedside phone is ringing. She reaches for it, but her \n     hand freezes in midair. She knows who's calling.\n\n     Three rings later, she manages to lift the receiver. To her \n     amazement, she finds she cannot speak. Finally, she hears a \n     VOICE at the other end of the line.\n\n                              BRUCE (V.O.)\n               Vicki... ?\n\n     INT. BRUCE WAYNE'S STUDY - NIGHT\n\n     BRUCE at a big mahogany desk in his somber, book-lined \n     study. The room is dark but for a small table lamp.\n\n                              BRUCE\n               Vicki, I've been thinking about you.\n                     (long pause)\n               I know it's late. I'm sorry. I --\n               Are you there?\n\n     INTERCUT BRUCE AND VICKI\n\n                              VICKI\n               Yes, Bruce -- I'm here --\n\n                              BRUCE\n               I'm sorry about the way things went\n               between us. I'd very much like to\n               see you again.\n\n                              VICKI\n               Well, Bruce... I don't think... that\n               would be possible.\n\n                              BRUCE\n               I wish you'd reconsider.\n                     (groping)\n               I didn't stand you up today. The\n               museum was closed when I got there.\n\n                              VICKI\n               I, uh... \n\n     ON VICKI\n\n     Her voice trails off. She's profoundly shaken. She knows.\n\n                              BRUCE (V.O.)\n               Vicki? Vi --\n\n     She returns the receiver to its cradle.\n\n     ON BRUCE\n\n     He hears the click. His lips part slightly. He hangs up and \n     sits there at the desk, staring straight ahead.\n\n                                                 CUT TO:\n\n     INT. VICKI'S BATHROOM - NIGHT\n\n     TOTAL DARKNESS. VICKI stands before the bathroom mirror. \n     She holds the OPENED ROLL OF TELEPHOTO SHOTS over the sink.\n\n     Then she strikes a match. IGNITES the film. Drops it into \n     the sink, and -- with hollow eyes -- WATCHES IT BURN.\n\n                                                 CUT TO:\n\n     INT. VICKI'S APARTMENT - LATER - NIGHT\n\n     It's four in the morning. VICKI, wrapped in a bathrobe, \n     still shaky, pours her fifth cup of coffee. Sitting across \n     from her is a rumpled and stubbly ALEXANDER KNOX.\n\n                              KNOX\n               Vicki, it all fits. The stuff you're\n               telling me -- the car, the equipment\n               -- somebody's paying for it.\n\n                              VICKI\n               I just can't --\n\n                              KNOX\n               The FBI. You know who's got the FBI\n               computer contract? Wayne\n               Technologies.\n                     (shaking his head)\n               The guy's bats all right. He's bat\n               shit crazy. This is gonna be the\n               most incredible --\n\n                              VICKI\n               But he's not.\n\n                              KNOX\n               Not what?\n\n                              VICKI\n               He's not crazy.\n\n     KNOX slaps his forehead in frustration, sprawls back in his \n     chair.\n\n                              KNOX\n               Vicki. We got a wealthy millionaire\n               here... who dresses up like a bat. He\n               goes out at night and swings around\n               -- in his cape -- on a rope.\n                     (throwing up his hands)\n               Okay. Maybe I'm crazy.\n\n                              VICKI\n               Allie... he wants to tell me.\n               That's why he took me there. Because\n               he's trying to tell me.\n\n                              KNOX\n               Gimme a break. If he wants to chat,\n               he can talk to his car.\n\n     The joke dies. VICKI stares dead ahead. KNOX looks on in \n     utter disbelief as it all comes into focus: he's lost her \n     loyalty. VICKI is in over her head with BRUCE.\n\n                              VICKI\n               He has to tell someone. And I'm the\n               one. He's trying to tell me.\n\n     KNOX, hurt in a way he doesn't fully understand, gets up \n     and pulls on his coat. He stares at her coldly:\n\n                              KNOX\n               Well, when he does you know my\n               number.\n\n                                                 CUT TO:\n\n     EXT. NEWSSTAND - DAY\n\n     CUSTOMERS are lining up to buy the early edition of the\n     Globe, which carries the full-page banner headline:\n\n                       WAR OF THE FREAKS\n             Batman, Joker in Fluegelheim Shootout\n\n     In the midst of the hubbub a DELIVERY TRUCK cruises past, \n     dumping a bundle of AFTERNOON EDITIONS on the sidewalk. \n     \"WAR OF THE FREAKS\" has been relegated to the lower right-\n     hand corner of the page -- supplanted by more pressing \n     news:\n\n                       STOCK MARKET CRASHES\n             Product Scare Drops Dow to 1100\n             Biggest One-Day Decline in History\n\n     INT. WAYNE FOUNDATION - DAY\n\n     BRUCE in a plush office suite downtown, on the phone to his \n     broker. Behind his desk is a big plate-glass window with a \n     fortieth-floor view of the financial district, so he can \n     wave at his fellow millionaires on their way down.\n\n                              BRUCE\n               Don't sell. It won't last. We'll\n               ride it out.\n\n     With exaggerated calm, he hangs up. He lifts the receiver \n     to dial another number, then hesitates and hangs up again.\n\n     INT. RECEPTION AREA - A MOMENT LATER - DAY\n\n     BRUCE, affecting an air of nonchalance, strolls past a \n     squad of SECRETARIES at desks. Phones are ringing off the \n     hook.\n\n     INT. HALLWAY - A MOMENT LATER - DAY\n\n     BRUCE ambles past a couple of COLLEAGUES. One of them is \n     shambling catatonically down the hall, bumping into walls. \n     The other is WAILING HYSTERICALLY.\n\n                              WAILING COLLEAGUE\n               ... a nine-million-dollar bath!\n\n     BRUCE nods in sympathy as they pass. He stops outside the \n     door to a men's room, looks around cautiously, then enters.\n\n     INT. MEN'S ROOM - A MOMENT LATER - DAY\n\n     A small anteroom outside the bathroom proper, with a bank \n     of PAY PHONES on one wall. BRUCE checks the bathroom to \n     make sure it's empty, then digs out a quarter and dials a \n     number. He cups one hand confidentially over the receiver:\n\n                              BRUCE\n                     (the familiar rasp)\n               Vicki?... This is Batman. I thought\n               I'd call and see how you're doing.\n\n     INT. VICKI'S APARTMENT - DAY\n\n                              VICKI\n                     (hesitantly)\n               ... I know it's you, Bruce. I'm not\n               going to talk to you unless we can\n               discuss it.\n\n     INT. MEN'S ROOM - ON BRUCE\n\n                              BRUCE\n                     (a little smile)\n               Who's this \"Bruce\"? Are you trying\n               to make me jealous?\n\n                              VICKI (V.O.)\n                     (filter)\n               I'm serious, Bruce. We have to --\n\n     At this very moment, a DAZED FINANCIER enters from behind.\n\n                              FINANCIER\n               Hi, Bruce.\n\n     BRUCE automatically claps a hand over the mouthpiece. His \n     face goes slack as he hangs up -- with VICKI'S TINNY VOICE \n     still squeaking on the other end of the line.\n\n                                                   CUT TO:\n\n     INT. DISTRICT ATTORNEY'S OFFICE - NIGHT\n\n     HARVEY DENT at a big desk, flanked by a number of \n     POLITICOS.\n\n                              DENT\n               ... We deal.\n\n                              ADVISER\n               Harvey, please. I mean --\n                     (shaking his head)\n               If your first official act as D.A.\n               is to cut a deal with a\n               terrorist... \n\n                              DENT\n               Screw that, Ed. We've got a market\n               panic of national proportions.\n               -- We've got 786 people dead.\n                     (beat)\n               I won't sacrifice one more life for\n               the sake of appearing strong.\n\n                              POLITICO\n               Harvey's right. We've got the 300th\n               anniversary gala coming up. The\n               networks won't even send in a crew.\n\n                              ADVISER\n               Harvey, the police are working round\n               the clock, the feds are coming in.\n               This thing could break any minute\n               now.\n                     (turning)\n               Tell him, Jim.\n\n     COMMISSIONER GORDON reaches into his vest pocket for a \n     cigar. He clips the end off, lights it, takes a long \n     drag... and STARES GLUMLY at the floor.\n\n                              GORDON\n               Cut the deal.\n\n     INT. CITY HALL - NIGHT\n\n     The MAYOR sits impatiently at a long table, flanked by JIM \n     GORDON, HARVEY DENT, and other prominent officials. The \n     room is packed with REPORTERS and TV NEWS CREWS.\n\n                              NEWS ANCHOR\n               ... at City Hall, where the mayor is\n               waiting to open negotiations with\n               the clown-faced terrorist known as\n               the Joker. It is now eight minutes\n               past the appointed deadline, and\n               still no word from --\n\n     INT. GOTHAM GLOBE - CITY ROOM - THAT MOMENT - NIGHT\n\n     REPORTERS cluster around a bank of four TV sets, each tuned \n     to a different station, all broadcasting from city Hall.\n\n                              REPORTER I\n               Look at 'em sweat. Can't wait for\n               the next Gallup Poll.\n\n                              REPORTER II\n               Hey Knox, cheer up. It ain't the\n               Batman but it's pretty choice.\n\n     KNOX, who has recently taken up smoking, responds with a \n     grunt. SUDDEN HUBBUB from the ONLOOKERS as a wave of VIDEO \n     NOISE wipes half the screen away.\n\n     INSERT - TELEVISION SCREEN\n\n     Split-screen. On one side is the MAYOR. On the other -- \n     sitting in a director's chair with a big yellow HAPPY-FACE \n     BACKDROP behind him -- is the JOKER, grinning fiendishly.\n\n                              JOKER\n               Joker here. Can we talk?\n\n     The MAYOR fumbles for his prepared statement.\n\n                              MAYOR\n               \"While this administration remains\n               vehemently opposed to terrorism in\n               any form, we are prepared to\n               negotiate any reasonable demands\n               which will guarantee the safety of\n               the populace.\"\n\n                              JOKER\n               Huh. Demands. Well, gents, this is\n               kinda embarrassing, but... I'm having\n               such a swell time, I just haven't\n               thought any up.\n\n     He shrugs. STARTLED REACTIONS from the city officials.\n\n                              JOKER (cont.)\n               But I'm a reasonable fella. If you\n               want to make me an offer... \n\n     Panicked, the MAYOR and co. go into a quick huddle.\n\n                              MAYOR\n               All right, all right. Here's the\n               deal. Total amnesty... and the sum of\n               ten million dollars, payable in --\n\n                              JOKER\n               Ten million dollars. Ten million\n               dollars.\n                     (flying off the handle)\n               Ten mi-- YOU CHEAPSKATES! I've just\n               wiped out the stock market. I've\n               cost you billions!\n                     (petulantly)\n               I want ten million and one.\n\n                              MAYOR\n               No, wait, please! We'll talk. Just\n               tell us what you expect.\n\n                              JOKER\n               Goddammit, I expect to be treated\n               like an ARTIST. GET OFF MY SCREEN!!\n\n     MORE VIDEO STATIC sweeps across the screen, pushing the \n     MAYOR clean out of frame. The JOKER leers at the camera.\n\n                              JOKER (cont.)\n               I might just think up some demands.\n               And I'm gonna talk to all my\n               friends, and see what they want,\n               too. And then maybe we'll get\n               together -- have a little party --\n               exchange presents.\n                     (waving goodbye)\n               Happy Birthday, Gotham.\n\n     \"The Shadow of Your Smile\" comes up UNDERNEATH as the \n     JOKER's transmission ends and the SCREEN GOES BLACK.\n\n     INT. GLOBE CITY ROOM - THAT MOMENT - NIGHT\n\n     FRANTIC ACTIVITY as REPORTERS rush to their telephones and\n     typewriters. KNOX strolls slowly back to his desk. He's \n     sitting on the biggest story of his career... and now, as \n     he realizes grimly, nobody knows or cares.\n\n                                                   CUT TO:\n\n     EXT. ANDREWS ISLAND - DAY\n\n     A tiny island in Gotham Harbor, homesite of LADY GOTHAM -- \n     the huge, newly restored stone statue that welcomes \n     incoming ships. Her upper half is draped in a huge TARP \n     prior to the unveiling ceremony scheduled for this Sunday.\n\n     At the base of the statue, WORKMEN are assembling a big \n     wooden platform, complete with microphones, amplifiers and \n     spotlights. They raise a gigantic BANNER which reads: \n     \"GOTHAM CITY -- 300TH ANNIVERSARY CELEBRATION.\"\n\n                                                   CUT TO:\n\n     EXT. WAYNE MANOR - DAY\n\n     A TAXI pulls away from the wrought-iron gate at the \n     entrance to the estate. KNOX ambles up to a stone pillar, \n     glances up at a VIDEO CAMERA mounted over the gate, and \n     hits a BUZZER.\n\n                              ALFRED (V.O.)\n                     (through loudspeaker)\n               Yes?\n\n                              KNOX\n               Alexander Knox. Gotham Globe.\n\n                              ALFRED (V.O.)\n               Mr. Wayne is out for the day.\n\n                              KNOX\n               Actually, I wanted to talk to\n               Batman. Pass that on to Mr. Wayne,\n               would you?\n\n     KNOX starts cockily off down the driveway -- then STOPS. \n     Behind him, the iron gates are SLIDING OPEN.\n\n     INT. BRUCE'S LIBRARY - TEN MINUTES LATER - DAY\n\n     KNOX, agitated, drums his fingers on the edge of a big \n     leather chair. BRUCE stands across from him.\n\n                              BRUCE\n               I've been expecting to hear from\n               you.\n\n                              KNOX\n               Well, that's how it is, chum. She\n               tells me everything.\n\n                              BRUCE\n               What is it you want?\n\n                              KNOX\n               Simple. You know the score. One\n               column -- and I can bring all this\n               tumbling down. I can take you off\n               the streets once and for all.\n                        (a shaky pause)\n               I want you to hang up the suit. And\n               I want you to stay away from Vicki.\n\n                              BRUCE\n               I can't do that. Not while the\n               Joker's still out there.\n\n                              KNOX\n               Then stay away from Vicki. That's\n               all I want, man. I just want your\n               word.\n\n     BRUCE turns away, evading his gaze. KNOX fumbles in his \n     jacket for a cigarette.\n\n                              KNOX (cont.)\n               See, I don't know how it happened --\n               she's a smart girl and you are an\n               extraordinarily screwed-up guy -- but\n               she's in love with you.\n\n                              BRUCE\n               There's something I don't\n               understand. If you've got the story,\n               why haven't you printed it?\n\n                              KNOX\n               Because I --\n                     (beat)\n               Because she'd never speak to me\n               again.\n\n     KNOX is a bundle of nerves now. No longer cocky, he stubs \n     out his newly-lit cigarette -- and begins to PLEAD OPENLY.\n\n                              KNOX (cont.)\n               Come on, Bruce. Be straight. What\n               have you got to offer? You gonna\n               marry her? Batman and Mrs. Batman?\n                     (laughing bitterly)\n               Gimme a break, huh? Who's gonna be\n               Best Rodent?\n\n     BRUCE sinks into a chair, exhales sharply. He can't even \n     put up an argument. The two of them sit there, not looking \n     at each other, as ALFRED appears in the doorway.\n\n                              BRUCE\n               Do you want a drink?\n\n                              KNOX\n               Yeah, a drink. \"Civilized.\"  Man-to-\n               man, right?\n\n                              BRUCE\n               Alfred, bring something for Mr.\n               Knox. -- I'll have one too.\n\n                                                   CUT TO:\n\n     EXT. GOTHAM PARK - LATE AFTERNOON\n\n     The weekend-long BIRTHDAY GALA is getting underway, and \n     Gotham Park is mobbed with CELEBRANTS enjoying a FREE \n     CONCERT. Onstage: FIVE ELVIS IMITATORS, dressed in \n     everything from black leather to white spangled jumpsuits, \n     representing the King in progressive stages of \n     deterioration.\n\n     INT. VICKI'S APARTMENT - DUSK\n\n     She's on the sofa beside a disconsolate BRUCE.\n\n                              VICKI\n               ... So we just pretend none of this\n               ever happened. We never met. We --\n                     (frightened)\n               You're going to get yourself killed,\n               Bruce. You know that, don't you?\n\n                              BRUCE\n               It wouldn't matter much.\n\n                              VICKI\n               I don't understand it. You can do so\n               much good for people. As Bruce\n               Wayne.\n\n     He sinks back on the sofa, closes his eyes. He's had the \n     same argument with himself a thousand times.\n\n                              BRUCE\n               Money makes money, Vicki. The\n               foundation runs itself. -- I'm\n               extraneous to the process.\n\n                              VICKI\n               You're one man. You can't save\n               everybody.\n\n                              BRUCE\n               What it I could save a handful?\n               -- What if I could save one?\n\n     VICKI is sick of watching BRUCE torment himself. She stands \n     up, almost crying now, and ACCUSES HIM DIRECTLY:\n\n                              VICKI\n               Bruce, at the rate you're going, you\n               can't even save yourself.\n\n                              BRUCE\n                     (staring right at her)\n               Sometimes... I don't know if there's\n               enough of me left to save.\n\n     VICKI is totally drained. She heads for the kitchen.\n\n                              VICKI\n               Oh, God. I've got to have some\n               coffee or something.\n\n     A moment's breather as BRUCE sits on the sofa reflecting. \n     Then, suddenly, a KNOCK at the door.\n\n     VICKI reappears and moves to answer the door. BRUCE -- on \n     his feet instantly -- grabs her by the shoulder.\n\n                              BRUCE\n               Are you expecting anyone?\n\n     She nods no. He goes to the peephole in the door.\n\n                              BRUCE (cont.)\n               Who's there?\n\n     THROUGH THE PEEPHOLE he sees a DELIVERY BOY.\n\n                              DELIVERY BOY\n               Package tor Miss Vale.\n\n                              BRUCE\n               Set it down by the door. On the\n               left-hand side.\n\n     The DELIVERY BOY sets the package down and wanders off, \n     tipless, muttering something about \"cheap shits.\" After a \n     moment's interval, BRUCE opens the door and bends to pick \n     up the mysterious package.\n\n     Another brown-paper parcel... ADDRESSED IN CRAYON.\n\n                              VICKI\n               BRUCE!\n\n     He strides past her, handling the parcel gingerly, and sets \n     it down on the kitchen counter.\n\n                              VICKI (cont.)\n               It's just like the last time. He\n               sent me a present before he --\n\n                              BRUCE\n               Very thoughtful. Don't touch it.\n\n     As VICKI watches, he goes into the living-room and finds \n     his ALLIGATOR ATTACHE CASE. He opens the case, removes a \n     LAPTOP COMPUTER and a handful of business papers... then \n     lifts out a false bottom to reveal his UTILITY BELT.\n\n                              VICKI\n               Oh, Bruce. Don't tell me you carry\n               it around with you.\n\n                              BRUCE\n               I feel naked without it.\n\n     He takes out a tiny ULTRASOUND SCANNER -- rather like a \n     stethoscope, with a miniature sonar display where the \n     earpieces should be -- and runs it over the package.\n\n                              BRUCE (cont.)\n               Not a bomb. But it could be rigged.\n               Wait in the next room.\n\n     He takes a small GAS MASK from his belt, puts it on, then \n     SLITS THE WRAPPING with a steak knife.\n\n     Nothing. Cautiously, he pulls back the flaps. The box is \n     full of STYROFOAM POPCORN. BRUCE shoves a hand down into \n     the popcorn... and extracts a HUMAN EAR.\n\n     In the doorway behind him, VICKI lets out a squeal.\n\n     BRUCE grabs the box and dumps TWO DOZEN EARS on the \n     counter.\n\n                              BRUCE\n               ... They're wax.\n\n     VICKI finds a hand-scrawled NOTE among the ears.\n\n                              VICKI\n               \"It worked for Van Gogh. Let's make\n               up. I'll need you soon.\" -- Whew.\n\n                              BRUCE\n                     (lost in thought)\n               That does it. It's going to be this\n               weekend.\n\n     The KITCHEN PHONE rings. VICKI reaches for the receiver. \n     Her eyes go wide and she gestures him over.\n\n     INT. ALICIA HUNT'S APARTMENT - THAT MOMENT\n\n     ALICIA, in her porcelain mask, on the phone.\n\n                              ALICIA\n               I thought you ought to know -- he's\n               coming for you... \n\n     ON BRUCE AND VICKI\n\n     Faces pressed together as they listen in. BRUCE covers the \n     mouthpiece with one hand.\n\n                              BRUCE\n               Keep her on the line!\n\n                              VICKI\n               ... Where are you calling from?\n\n     As VICKI struggles to keep the conversation alive, BRUCE \n     rushes into the living room and crouches beside his LAPTOP \n     COMPUTER. He plugs it in, flips open the screen, punches up \n     a telecommunications program.\n\n     A moment later VICKI enters from the kitchen.\n\n                              VICKI\n               I'm sorry, she hung up. What are --\n\n                              BRUCE\n               Finding out where she is.\n\n                              VICKI\n               How can you do that if she's already\n               off the line?\n\n                              BRUCE\n               I've had an automatic tracer on this\n               number ever since he tracked you to\n               the museum.\n\n     INT. BATCAVE - THAT MOMENT\n\n     MASSIVE COMPUTERS click and whir. At BRUCE's prodding, \n     INFORMATION comes up on the monitor: a number, a name -- \n     ALICIA HUNT -- and an East Side address.\n\n     INT. VICKI'S APARTMENT - THAT MOMENT - EVENING\n\n     THE SAME INFORMATION scrolls across BRUCE's screen.\n\n                              BRUCE\n               Got it!\n\n                              VICKI\n               What now!\n\n                              BRUCE\n               Hang on. I have to leave a message.\n\n     HE FREEZES. He's heard something in the hallway outside.\n\n     INT. HALLWAY - THAT MOMENT\n\n     ELEVATOR DOORS open on THREE THUGS. One of them uses a key \n     to lock the car in place on VICKI's floor. The key is on \n     the end of a ring which contains dozens of other keys.\n\n     The KEY RING belongs to a DOORMAN, who's riding in the \n     elevator with the JOKER's trio of thugs. He's dead, alas. \n     The THUGS dump him unceremoniously on the floor of the hall \n     and march toward VICKI's apartment.\n\n     INT. VICKI'S APARTMENT - A MOMENT LATER\n\n     BRUCE is nowhere in sight. VICKI is at the sink washing \n     dishes, acting nonchalant. She pretends not to hear the \n     DOOR unlocking behind her.\n\n     She turns -- and faces the THREE ADVANCING THUGS.\n\n                              THUG I\n               Hi, Miss Vale. Let's not put up a\n               fight, huh? 'Cause we'd hate to have\n               to --\n\n     BRUCE steps into the doorway behind them. With a single \n     sweep of the arm, he flings THREE DRUG-TIPPED NINJA WHEELS \n     at the thugs, catching one in the neck, one in the \n     shoulder, one in the hip. They COLLAPSE in quick \n     succession.\n\n                              BRUCE\n               There's a garage in this building?\n\n     VICKI nods yes. BRUCE -- all business now that he's in his \n     element -- disappears into VICKI's bedroom.\n\n     She peeks around the corner. He reemerges carrying a BLACK \n     NYLON STOCKING, which he stuffs into his pocket. VICKI is \n     full of question, but he shushes her before she can speak.\n\n                              BRUCE (cont.)\n               I've got to take him out now.\n\n     He stoops down beside the THUGS and pulls the elevator key \n     off the key ring -- which he then tosses to VICKI.\n\n                              BRUCE (cont.)\n               Pick an apartment and stay there.\n               And listen: call the police. Give\n               them that address. Every available\n               man.\n\n     He starts out the door, stops just long enough to take a \n     dumbfounded VICKI in his arms for a kiss.\n\n     INT. UNDERGROUND GARAGE - A MOMENT LATER - EVENING\n\n     THE JOKER'S VAN, bearing the Monarch Playing Card logo. TWO \n     ARMED GOONS lean against the hood. They watch as the \n     elevator opens and an ordinary fellow in a suit steps out.\n\n     BRUCE pulls car keys from his pocket and strolls past the \n     thugs, head down, whistling. As he walks around the van, \n     his hand brushes against it -- leaving a MAGNETIZED HOMING \n     DEVICE, almost too tiny to notice, stuck to the fender.\n\n     He walks another six paces, then stops short. He feels \n     around in all his pockets, making a big show of having\n     forgotten something.\n\n                              BRUCE\n               Oh, hell!\n\n     The GOONS eye him curiously as he strides back toward the \n     elevator. The doors are closing before it strikes them that \n     something is amiss.\n\n                              GOON\n               Hey, boss, something's up. The\n               elevator's working.\n\n     INT. VAN - ON JOKER\n\n     Frustrated, snarling, ready to throw a tantrum.\n\n                              JOKER\n               DAMMIT! You can't get good help\n               these days. -- Let's move out.\n\n     EXT. STREET - EVENING - OVERHEAD ANGLE\n\n     From high above the street we see the JOKER'S VAN pulling \n     out of VICKI's building. We're up on the roof, with BRUCE. \n     He hits a button on his utility belt, and a RED SIGNAL \n     LIGHT begins to flash.\n\n     BRUCE clamps the utility belt around his waist. Pulls the \n     BLACK NYLON STOCKING over his head. And suddenly, he's \n     BOUNDING ACROSS THE ROOFTOPS in pursuit of the JOKER.\n\n     EXT. CROSS STREET - A MOMENT LATER - EVENING\n\n     The VAN turns right at the intersection. Nothing unusual. \n     But for some reason, PEDESTRIANS are pointing at the sky, \n     staring goggle-eyed at the rooftops.\n\n     Far above them, a MAN -- dressed in a suit, a tie, a yellow \n     belt and a BLACK STOCKING MASK -- is gliding across the \n     intersection on a ROPE.\n\n     INT. VAN - A MOMENT LATER\n\n     The VAN DRIVER guns through a red light. BRAKES SQUEAL on \n     either side. In the back of the van, the JOKER GROWLS:\n\n                              JOKER\n               Slow down, you maniac!\n\n     EXT. INTERSECTION - THAT MOMENT - EVENING\n\n     As the VAN ROARS PAST, a MOUNTED POLICEMAN shakes his fist. \n     His horse shies, rears back, turns in a circle. He's just \n     about gotten the beast calmed down when a MAN IN A STOCKING \n     MASK plummets down on a rope from nowhere and lands \n     directly behind him on the horse's back.\n\n     BRUCE elbows the startled COP. Now there's only one rider. \n     The VAN turns left. BRUCE gallops straight ahead through \n     the intersection, hoping to cut the JOKER off.\n\n     INT. ALICIA HUNT'S APARTMENT - THAT MOMENT\n\n     ALICIA peers out through the window. On the street below, \n     UNMARKED CARS are converging.\n\n     INT. VAN - THAT MOMENT\n\n     The JOKER and co. are two blocks away from ALICIA's. They \n     see a POLICE SWAT TEAM sealing off the building.\n\n                              DRIVER\n               Boss! Jesus! They've --\n\n                              JOKER\n               They'll be sorry. They'll be\n               sorry. -- GET OUT OF HERE!\n\n     EXT. SIDE STREET - THAT MOMENT - EVENING\n\n     BRUCE on horseback, charging past elegant old brownstones, \n     drawing stares from passersby. We get a quick look at the \n     FLASHING RED SIGNAL LIGHT on his belt.\n\n     EXT. RIVERVIEW DRIVE - THAT MOMENT - EVENING\n\n     A YELLOW VW BUG rips up the street at 70 mph.\n\n     INT. VOLKSWAGEN BUG - THAT MOMENT\n\n     We can't see the driver. But we do see, on the seat \n     beside him, a VIDEO DISPLAY with a shifting grid map of the \n     city -- and on it, a FLASHING SIGNAL blinking in perfect \n     sync with the one on BRUCE's belt.\n\n     EXT. SIDE STREET - THAT MOMENT\n\n     BRUCE sees the VW bug rounding the corner and STREAKING \n     TOWARD HIM. He reins in the horse; it rears back on its \n     hind legs in a classic western pose; the BUG zooms past --\n\n     -- and ALFRED THE BUTLER heaves out a BROWN LAUNDRY BUNDLE, \n     neatly tied in string.\n\n     BRUCE snatches it out of the air, gives ALFRED a quick \n     salute -- and the BUG is gone.\n\n     INT. JOKER'S VAN - EVENING\n\n     The JOKER and his boys are stalled in heavy traffic at the \n     southern border of Gotham Park. POLICE BARRICADES are \n     everywhere; the surrounding streets have been roped off for \n     the birthday gala. HORNS HONK in anger.\n\n                              JOKER\n               MOVE! Can't you do something??\n\n                              DRIVER\n               It's some kind of detour. They're\n               backed up for blocks!\n\n     The JOKER snorts. He happens to glance into the side-view \n     mirror. What he sees there... CURDLES HIS BLOOD.\n\n                              JOKER\n               Oh my God. How does he do it... ?\n\n     EXT. STREET - A BLOCK AWAY - THAT MOMENT\n\n     THE BATMAN, IN FULL COSTUMED GLORY, GALLOPING UP THE STREET \n     ON HORSEBACK -- passing stunned COPS, weaving in and around \n     the stalled autos, GAINING FAST on the JOKER.\n\n     INT. VAN - THAT MOMENT\n\n     THE JOKER climbing all over the DRIVER. He HITS THE GAS, \n     RUNS THE VAN UP ON THE SIDEWALK, and -- at the first \n     opening he sees -- CRASHES THROUGH A POLICE BARRICADE INTO \n     GOTHAM PARK ITSELF.\n\n     BATMAN is half a block behind him now. As he follows hot on \n     the JOKER's heels, TWO HELICOPTERS swing into the park from \n     overhead.\n\n     EXT. GOTHAM PARK - EVENING\n\n     CROWDS EVERYWHERE. On the central platform where we saw the \n     FREE CONCERT earlier, an EMCEE mans the microphone:\n\n                              EMCEE\n               -- the most spectacular, most death-\n               defying aerial stunt ever devised.\n               Tonight -- for the first time\n               anywhere -- THE FLYING GRAYSONS!\n\n     He points up at the two approaching HELICOPTERS, flying \n     side-by-side in tight formation some forty feet apart.\n\n     ANGLE ON HELICOPTERS\n\n     ONLOOKERS GASP as TWO TRAPEZES drop from the bellies of the \n     twin copters. Dangling from the trapezes are the FLYING \n     GRAYSONS -- a husband-and-wife aerialist team in spangled \n     red-and-green suits. They begin swinging toward each other \n     in a plane perpendicular to the path of the copters.\n\n     EXT. GOTHAM PARK - GROUND LEVEL\n\n     PANIC DOWN BELOW as the JOKER's van barrels through the \n     crowd, HORN BLARING. BATMAN is moving up swiftly.\n\n     On each wrist he's wearing a MINIATURE ROCKET LAUNCHER. He \n     lets fly with TWO SALVOS. The first explodes harmlessly \n     against a tree. The second HITS THE REAR DOOR OF THE VAN -- \n     driving it off the access road down into the brush, where \n     it nearly topples over sideways.\n\n     ANGLE ON FLYING GRAYSONS\n\n     GRAYSON has just completed a double somersault in midair, \n     landing in the capable hands of his wife. Now they're \n     swinging again, building momentum as he prepares to make \n     the return leap back to his own trapeze.\n\n     INT. HELICOPTER - THAT MOMENT\n\n     In the bay of the helicopter stands a kid, fifteen, \n     compact, tough, and wiry: DICK GRAYSON. Like his parents, \n     he's wearing a red-and-green suit. From the copter, he's \n     got a perfect bird's-eye view of the BATMAN-JOKER chase.\n\n                              PILOT\n               Ready to go, Dick?\n\n                              DICK\n               What's all the ruckus down there?\n\n     EXT. PARK - GROUND LEVEL - THAT MOMENT\n\n     The VAN bounces over rocks and bushes, narrowly avoiding \n     trees, with BATMAN in hot pursuit.\n\n     INT. VAN - THAT MOMENT\n\n     At the foot of a hill, the JOKER spies a truck. On its \n     side, in bright red letters, a WARNING: \"DANGER - \n     FIREWORKS. FLAMMABLE LOAD.\"\n\n     The JOKER reaches into the back for a HIGHWAY FLARE.\n\n                              JOKER\n               Head for the truck!\n\n     INT. HELICOPTER - THAT MOMENT\n\n     Hovering over the chase scene, DICK catches sight of the \n     JOKER. He GASPS IN SHOCK as a LIT FLARE flies from the back \n     of the VAN... directly into the FIREWORKS TRUCK.\n\n     EXT. PARK - GROUND LEVEL - A MOMENT LATER\n\n     THE BATMAN is thrown off his horse by the shock of a \n     massive EXPLOSION. All at once, THE SKY IS FULL of \n     BURSTING, INCANDESCENT COLORS!!\n\n     THE JOKER hangs out of the rear of the van, looking up, an \n     expression of PURE DELIGHT on his face.\n\n                              JOKER\n               I love fireworks!\n\n     ANGLE ON HELICOPTERS\n\n     LURCHING AND SPINNING IN THE SKY as FIREWORKS rocket past. \n     One of them takes a dead hit on the rotor. JOHN GRAYSON \n     falls to his death instantly; a moment later, the COPTER \n     plummets into the trees with a resounding, fiery CRASH.\n\n     MARY GRAYSON hangs from the second copter as it bobs and \n     weaves out of control. ONLOOKERS SCREAM IN TERROR.\n\n     EXT. STREET - THAT MOMENT\n\n     THE JOKER'S VAN bursts out of the park and speeds up a \n     wide, cordoned-off avenue. Overhead, THE SECOND COPTER \n     veers wildly, out of the park now, swinging dangerously \n     close to the tall buildings along the avenue.\n\n     INT. HELICOPTER - THAT MOMENT\n\n     DICK GRAYSON at the mouth of the bay, hanging on by a \n     canvas strap. He watches helplessly as his MOTHER swings \n     into a POWER LINE and drops three stories to the pavement.\n\n                              DICK\n               NO! NOOOOOOOO!!!!\n\n     His face is contorted with rage and pain. The PILOT \n     struggles desperately to right the copter, barely avoiding \n     a collision with the nearest building. And then -- before \n     THE PILOT can make a move to stop him -- DICK HAS JUMPED \n     OUT OF THE COPTER.\n\n     ANGLE ON DICK\n\n     With astonishing physical grace, he DIVES. GRABS A \n     FLAGPOLE. Executes a perfect somersault. FLIPS onto a \n     nearby fire escape. VAULTS to the next fire escape down. \n     And LEAPS OUT OVER THE STREET --\n\n     -- MAKING A PERFECT TWO-POINT LANDING on his intended \n     target... THE ROOF OF THE JOKER'S VAN!!\n\n     INT. VAN - THAT MOMENT\n\n     THE JOKER hears a THUNK overhead. He casually lifts his gun \n     and BLOWS A HOLE THROUGH THE ROOF OF THE VAN.\n\n     EXT. ROOF OF VAN - MOVING - THAT MOMENT\n\n     The blast just misses DICK. He sprawls flat, YANKS at the \n     chrome luggage rack on the roof of the van, and BREAKS OFF \n     A FOUR-FOOT SHAFT OF METAL.\n\n     ANOTHER SHOT through the roof. DICK rolls forward, hoists \n     his chrome spear over the windshield.\n\n     INT. VAN - THAT MOMENT\n\n     SPLINTERED GLASS flies everywhere as DICK RAMS THE SHAFT \n     THROUGH THE WINDSHIELD. THE DRIVER dodges left and LOSES \n     CONTROL OF THE WHEEL.\n\n     EXT. ROOF OF VAN - MOVING - THAT MOMENT\n\n     The VAN careens wildly toward an OVERPASS. DICK rises up \n     into a crouch just in time to see a sign which reads \n     \"DANGER -- LOW CLEARANCE.\" He's about to get his head taken \n     off!\n\n     ONE SECOND BEFORE IMPACT a BLACK-CAPED SHADOW swings across \n     the street and SCOOPS DICK OFF THE ROOF OF THE VAN.\n\n     EXT. STREET - NIGHT\n\n     BATMAN AND DICK tumble to the pavement. THE VAN knocks over \n     a fire hydrant and STOPS. DICK is already on his feet, \n     ready to CHARGE THE VAN, when BATMAN throws a powerful arm \n     around his waist.\n\n                              DICK\n               LET ME GO! LET ME --\n\n     THE JOKER steps casually out of the van. TWO GOONS with \n     MACHINE GUNS emerge behind him. PEDESTRIANS SCREAM as the \n     GOONS level their guns at the CROWD.\n\n                              DICK (cont.)\n               YOU PIECE OF -- YOU MOTHERF--\n\n     DICK is kicking, screaming, clawing, biting. BATMAN has his \n     hands full restraining the kid.\n\n                              JOKER\n               Like your boyfriend. He's kinda\n               hot.\n                     (glowering at BATMAN)\n               Hands off the belt.\n\n                              BATMAN\n               Take me. Let the boy go.\n\n                              JOKER\n               Gosh, I could kill you, but then\n               you'd miss my party. And I'd be\n               real, real sad if you couldn't make\n               it.\n\n                              BATMAN\n               What are you talking about?\n\n                              JOKER\n               Batman! Don't you even recognize\n               your old pal Jack? After all... \n                     (cackling insanely)\n               You made me what I am today.\n\n     BATMAN cocks his head in puzzlement as DISTANT SIRENS \n     BLARE. The JOKER and his HOODS -- guns still aimed at the \n     crowd -- back away and race off on foot, vanishing into the \n     night.\n\n     DICK BREAKS FREE and BOLTS AFTER THEM. BATMAN throws him to \n     the street with a flying tackle. The boy is hysterical.\n\n                              DICK\n               HE KILLED MY PARENTS! HE KILLED\n               MY --\n\n     BATMAN flinches at the sound of the words. He reaches into \n     his belt and -- mercifully -- breaks a KNOCKOUT CAPSULE \n     under DICK's nose.\n\n                                                 DISSOLVE TO:\n\n     INSERT - TELEVISION SCREEN\n\n     A taped report from the hallway outside ALICIA's apartment. \n     COPS and FORENSICS MEN mill about in the b.g.\n\n                              REPORTER\n               ... on a tip attributed to the\n               mysterious Batman. The apartment was\n               booby-trapped with the Joker's\n               laughing gas, leaving 17 policemen\n               dead.\n                     (beat)\n               Also found dead at the scene was\n               Alicia Hunt, 26, a former model --\n\n     CAMERA PULLS BACK to reveal that the TV SCREEN is part of \n     BRUCE'S BANK OF MONITORS, deep in the Batcave. The other \n     screens show the various rooms of Wayne Manor, all empty.\n\n     We move now to the video display of a COMPUTER WORKSTATION, \n     showing TWO FACES side-by-side: a mug shot of JACK NAPIER \n     and a freeze-frame of the JOKER from one of his pirate \n     transmissions. A GRAPHICS PROGRAM abstracts the twin heads \n     into THREE-DIMENSIONAL, ROTATING TOPOLOGICAL GRIDS -- and, \n     as we watch, the two spinning heads COLLIDE AND MERGE.\n     Except for the fearsome grin, they MESH PERFECTLY.\n\n     Yet another terminal: BRUCE's database. The same phrase\n     flashes again and again, scrolling up the screen: ACE \n     CHEMICAL CO. ACE CHEMICAL CO. ACE CHEMICAL CO.\n\n     And, finally: BRUCE HIMSELF, slumped at a table, his head \n     in his hands. He's realized, to his horror, that he is\n     responsible for the birth of the Joker. And frankly...\n     he would just as soon be dead.\n\n     INT. WAYNE MANOR - GUEST BEDROOM - DAY\n\n     DICK GRAYSON is sprawled on a huge four-poster bed, \n     unconscious, softly moaning. He COMES TO with a jolt.\n\n     Breaking into a sweat almost instantly, he looks at his \n     unfamiliar surroundings. A shadowy figure stands nearby.\n\n                              DICK\n               ... Where am I?\n\n                              BRUCE\n               My name is Bruce Wayne. You're\n               welcome to stay here as long as you\n               want.\n\n     BRUCE steps out just as ALFRED enters with a breakfast \n     tray. DICK makes a puzzled face. What the hell is going on \n     here?\n\n     INT. HALL OF JUSTICE - DAY\n\n     Beneath the statue of blind Justice, BRUCE and HARVEY DENT \n     march through the portico, engaged in a heated argument.\n\n                              DENT\n               We'll send a team into Ace the\n               moment the warrant comes through.\n\n                              BRUCE\n               He'll be ready when you do. Remember\n               what happened at the apartment.\n\n                              DENT\n               All right, Bruce, what do you\n               suggest?\n\n                              BRUCE\n               I suggest a nice big bomb.\n\n                              DENT\n               Good. A bomb. On a blind tip from\n               Bruce Wayne. -- We do have laws.\n\n                              BRUCE\n               Then for God's sake, Harvey, cancel\n               the anniversary celebration.\n\n                              DENT\n               We've told him we'll deal. What\n               could he possibly have to gain by --\n\n                              BRUCE\n               Do you still think the Joker cares\n               about money??\n\n                              DENT\n               I don't know. I'm just a D.A. I\n               don't have access to all your\n               expert sources.\n\n     Mexican standoff. BRUCE stalks off fuming. DENT hangs back \n     a moment, then turns down the hall.\n\n     EXT. WAYNE MANOR - ESTABLISHING - DAY\n\n     The ornate, wrought-iron GATE which opens on the long \n     driveway snaking up toward Wayne Manor. It's bolted shut.\n\n     INT. WAYNE MANOR - DAY\n\n     A glass-enclosed room which houses an enormous HEATED \n     INDOOR SWIMMING POOL. DICK GRAYSON does a couple of laps, \n     then climbs out and towels himself off.\n\n     He looks out at the estate: tennis courts, a riding stable \n     in the distance. He's not happy. All this opulence could \n     drive a guy stark staring nuts in short order.\n\n     INT. GUEST BEDROOM - DAY\n\n     An OPEN SUITCASE on the bed. DICK fingers a gold ashtray \n     bearing the figure of Winged Victory -- then shrugs and \n     tosses it into the suitcase on top of his gymnast's \n     costume. When he looks up he sees BRUCE in the doorway \n     behind him.\n\n                              DICK\n               ... Your butler wouldn't gimme a ride\n               so I figured I'd hoof it.\n\n                              BRUCE\n               Sorry. I can't let you leave.\n\n                              DICK\n               You can't keep me here, man. That's\n               kidnapping.\n\n                              BRUCE\n               If I let you leave, you'll do the\n               same thing again. You'll go after\n               the Joker... and you'll wind up dead.\n                     (turning to go)\n\n                              DICK\n               Hey, man. Look at you. You're\n               rich. You got everything you want.\n               How do you know what's in my mind?\n\n     BRUCE turns to face him. The little hellion's eyes are \n     filled with raw, burning hatred. BRUCE knows the feeling.\n\n                              BRUCE\n               I don't care what's in your mind.\n               You're staying.\n\n     BRUCE reaches for a key in his pocket. Without warning, the \n     kid RUSHES him, throwing a rock-solid punch. With blinding \n     speed, BRUCE sidesteps him, parries the blow, and winds up \n     spinning DICK around -- INTO A WALL.\n\n     DICK is stunned, but he has to laugh. This rich boy has a \n     move or two. BRUCE stands there, silently challenging him.\n\n     A second later, the kid is airborne -- upping the ante with \n     a scissor-kick aimed squarely at BRUCE's gut. In a blur of \n     motion BRUCE checks the kick, swings an arm into DICK's \n     chest, and sends the boy sprawling flat on his back.\n\n     INT. WAYNE MANOR - KITCHEN - THAT MOMENT\n\n     ALFRED, in his apron, fixing a tray of snacks. He looks up \n     curiously at the ceiling. From the sound of it, a battle \n     royal is shaping up in the guest bedroom.\n\n     INT. GUEST BEDROOM - THAT MOMENT\n\n     DICK'S BODY -- head down, feet up -- flies through the air. \n     He SMASHES INTO a closet door and slumps to the carpet. \n     Shaken now, and sweating profusely, he looks up at BRUCE... \n     who stands calmly over him, adjusting his necktie.\n\n     A long, tense moment passes between them. Then:\n\n                              DICK\n               ... You're him.\n\n     No reply from BRUCE. Their gazes lock. And suddenly... \n\n                              ALFRED (V.O.)\n               FREEZE!\n\n     DICK and BRUCE look around. The puny, mustachioed butler \n     stands in the doorway, feet spread in a Dirty Harry stance, \n     a .44 MAGNUM trained on DICK.\n\n                              BRUCE\n               It's all right, Alfred. Everything's\n               under control.\n\n                              ALFRED\n               ... Very good, sir.\n\n     ALFRED relaxes, musters his dignity, and turns to go.\n\n                                                 CUT TO:\n\n     INT. CONFERENCE ROOM - AFTERNOON\n\n     CANNED APPLAUSE as THE JOKER marches out onto a makeshift \n     STAGE to give his QUARTERLY REPORT to the stockholders.\n\n                              JOKER\n               Thankya, thankya. Ladies and germs,\n               I'm here to tell you... we have had\n               one helluva quarter.\n\n     He waves a pointer at three SALES CHARTS on portable \n     easels.\n\n                              JOKER (cont.)\n               Panic's up. Terror's up. And fear --\n               fear's gone straight through the\n               roof. You guys should be proud --\n               'cause I couldn'ta done it without\n               each and every one of you!\n\n     MORE CANNED APPLAUSE. The JOKER takes a bow.\n\n                              JOKER (cont.)\n               I feel it's time to expand the\n               Joker line. I was askin' myself,\n               what are the products that every\n               consumer wants most? And that's when\n               it hit me: the water you drink, and\n               the air you breathe! Huh? Bingo!\n                     (strutting across stage)\n               Now, some of you have your eye on\n               the profit margin. You're thinkin':\n               this boy's too ambitious. You\n               don't approve. In fact, some of you\n               have been talking about turning me\n               in to the cops. Or knocking me off.\n\n     He pauses. GLARES OUT at the audience. NO RESPONSE.\n\n                              JOKER (cont.)\n               But that's okay. I understand. Not\n               everyone shares my eye for beauty.\n               And just to show there's no hard\n               feelings, I'm throwin' a little\n               shindig tonight -- and you're all\n               invited!\n\n     THE CANNED APPLAUSE goes right off the meter.\n\n                              JOKER (cont.)\n               How 'bout it? IS EVERYBODY HAPPY??\n\n     REVERSE ANGLE - THE AUDIENCE\n\n     Familiar faces all around -- the major players of the \n     Gotham underworld. But despite the enormous twisted grins, \n     no one here is laughing or applauding. No one here is\n     living. The JOKER is playing to a roomful of smiling \n     corpses.\n\n     One of them topples out of his chair and lands with a plop.\n\n                              JOKER\n               Look at that, folks. We got 'em\n               rolling in the aisles!\n\n                                                 CUT TO:\n\n     INT. BRUCE'S BEDROOM - TOWARD DUSK\n\n     VICKI lies in BRUCE's bed, under the covers, propped up on \n     the pillows. BRUCE is in his robe over by the window, \n     looking out at his estate.\n\n                              BRUCE\n               All this apparatus, Vicki... this\n               house, and the money, and the\n               power... it was never mine. It was\n               something I inherited. Bruce Wayne\n               was something I inherited.\n                     (pause)\n               All I ever hoped for was someone who\n               could see through Bruce -- who could\n               see me -- and not be frightened.\n\n                              VICKI\n               I'm not frightened of you, Bruce.\n               I'm frightened for you.\n\n                              BRUCE\n               In all these years... why couldn't I\n               see how it would turn out?\n\n     He turns toward her. His face is ravaged with guilt. Now \n     she's truly afraid.\n\n                              BRUCE (cont.)\n               I'm responsible, Vicki. If it wasn't\n               for me, there'd be no Joker.\n\n                                                 CUT TO:\n\n     INT. BATCAVE - EVENING\n\n     TIGHT ON a tiny electronic device: two cylindrical steel \n     casings bracketed together, topped by a DIGITAL TIMER. \n     BRUCE makes a few adjustments with a jeweler's screwdriver, \n     hits a trigger, and watches the TIMER tick off seconds. 30. \n     29. 28. At 25 seconds, BRUCE kills the\n     countdown and CLAMPS THE DEVICE into an empty packet on his \n     utility belt.\n\n     He stands up wearily. He's in his bat-suit, minus the cape \n     and cowl. Behind him, hanging back discreetly in the \n     shadows, is his loyal butler ALFRED.\n\n                              BRUCE\n               Where's the boy?\n\n                              ALFRED\n               Upstairs. He's quite docile.\n\n                              BRUCE\n               I know that feeling. It won't last.\n\n     BRUCE takes a moment to survey the Batcave as ALFRED looks \n     on tremulously.\n\n                              BRUCE (cont.)\n               He's a long way ahead of where I was\n               at his age.\n                     (taking ALFRED's\n                      shoulders)\n               I want you to treat him just as if\n               he were me. Promise.\n\n                              ALFRED\n               Yes, sir.\n\n                              BRUCE\n               He'll be taken care of financially.\n               Beyond that... you know what to do.\n               Don't let all this go to waste.\n\n     Their eyes lock for a long moment. ALFRED is unable to \n     speak. Finally BRUCE turns and starts slowly up the long \n     circular stairway which leads from the Batcave to Wayne \n     Manor. On the third step he pauses:\n\n                              BRUCE (cont.)\n               Alfred? -- Thank you.\n\n     As BRUCE disappears up the stairs, a shaken ALFRED steadies \n     himself against a lab table, fighting back tears.\n\n     INT. BRUCE'S BEDROOM - EVENING\n\n     BRUCE draws the curtains, sets an alarm clock. The current \n     time is 7:09 PM.\n\n     He sits cross-legged on the floor, slumps forward slightly, \n     and closes his eyes. He inhales, exhales, taking deep, \n     regular breaths. His muscles relax. Ten seconds later, \n     BRUCE has plunged into DEEP SLEEP.\n\n     Time passes. The clock shows 7:19, 7:32.\n\n     At 7:44 we TRACK IN on BRUCE's unconscious face, drawing \n     closer and closer until HIS EYELIDS FILL THE FRAME, \n     twitching with the irregular movement characteristic of \n     R.E.M. sleep. Without warning his EYES SNAP OPEN.\n\n     HOLD ON BRUCE'S GAZE -- grim, alert, determined -- as the \n     clock hits 7:45. An ALARM SOUNDS, BREAKING THE SILENCE with \n     its grating electronic WHINE.\n\n                                                 DISSOLVE TO:\n\n     EXT. ACE CHEMICAL - AERIAL SHOT - NIGHT\n\n     The trademark ace on the illuminated sign. From our vantage \n     point high above, we can see THREE CARGO TRUCKS rolling out \n     the main gates. A half-mile away, THE BATMOBILE cruises up \n     the waterfront, approaching soundlessly, its headlights \n     off... preparing for a final showdown with the JOKER's \n     forces.\n\n     INT. ACE CHEMICAL - THAT MOMENT - NIGHT\n\n     The JOKER'S MINIONS, working late, readying a huge \n     shipment. At an open loading bay, we find a DISPATCHER with \n     a clipboard, directing MORE UNMARKED TRUCKS in the lot \n     outside.\n\n                              DISPATCHER\n               Boston, Philly: loading bay one.\n\n     EXT. ACE CHEMICAL - THAT MOMENT - NIGHT\n\n     The BATMOBILE stops short of the main gate. ENGINES ROAR \n     and the supercar ACCELERATES, SMASHING THROUGH THE GATE and \n     taking half the chain-link fence with it.\n\n     In the guard's booth, ARMED GOONS pull guns as the \n     BATMOBILE streaks across the parking lot and LAUNCHES A \n     ROCKET at the corrugated metal door which opens on the \n     factory floor. A THUNDEROUS EXPLOSION tears a gaping hole \n     in the door.\n\n     INT. ACE CHEMICAL - THAT MOMENT - NIGHT\n\n     The BATMOBILE cruises through the flaming wreckage and \n     SKIDS TO A HALT on the refinery floor. The JOKER'S MEN are \n     everywhere. They take one look at the BATMOBILE, PANIC, and \n     PELT THE CAR with a barrage of MACHINE-GUN FIRE.\n\n     CRACKS begin to spread across the Batmobile's plexiglass \n     dome. Within moments, the windshield SHATTERS -- and \n     COLLAPSES ALTOGETHER.\n\n     INT. BATMOBILE - THAT MOMENT\n\n     BULLETS rip through the upholstered passenger seats. It \n     doesn't matter. The car is empty. No one's driving.\n\n     TRACK IN on the computer console -- where a familiar tinny \n     voice calmly repeats its pre-programmed command:\n\n                              COMPUTER\n               ... Detonate.\n\n     A beat. Then: BLAM.\n\n     INT. POLICE CAR - THAT MOMENT - NIGHT\n\n     A CONVOY approaches Ace Chemical -- GORDON's team preparing \n     to raid the plant. Inside each car: SPECIAL UNIT COPS \n     dressed in asbestos suits, gas masks in their laps.\n\n     All at once, a BRILLIANT RED GLARE suffuses the sky.\n\n                              COP\n                    Good Lord!\n\n     EXT. ACE CHEMICAL - THAT MOMENT - NIGHT\n\n     THE JOKER'S MEN running for their lives across the parking \n     lot, KNOCKED FLAT by the force of SIX DEAFENING EXPLOSIONS. \n     For a few seconds everything is flame and fury. And then --\n\n     All that's left of Ace Chemical is a pile of charred rubble \n     and a PILLAR OF THICK BLACK SMOKE, spiraling up to the sky.\n\n                                                 CUT TO:\n\n     EXT. ANDREWS ISLAND - NIGHT\n\n     DAZZLING FIREWORKS explode in the night sky over Gotham \n     Harbor. SEARCHLIGHTS sweep across the mammoth, welcoming \n     stone figure of LADY GOTHAM -- still wrapped in canvas, \n     ready to be unveiled.\n\n     THOUSANDS OF RUBBERNECKERS jam every square inch of \n     Andrew's Island. COPS ON HORSEBACK speak into walkie-\n     talkies as they patrol the edges of the crowd. Across the \n     Harbor, Ace Chemical is going up in flames -- but as far as \n     the crowd can tell, with all the noise and excitement, it's \n     just another part of the celebration.\n\n     At the base of the statue, GOVERNOR GILROY speaks into a \n     microphone:\n\n                              GOVERNOR GILROY\n               As Governor of this great state, it\n               is now my honor to unveil for you a\n               very special lady -- a lady who\n               stands tall for life and liberty --\n               America's favorite lady... LADY\n               GOTHAM!\n\n     The CROWD begins to APPLAUD RHYTHMICALLY, chanting 'LADY \n     GOTHAM! LADY GOTHAM!' It's like Times Square on New Year's \n     Eve, waiting for the big ball to drop. GILROY hoists a pair \n     of oversized scissors and cuts a ceremonial ribbon: \n     hydraulic CRANES kick into gear: CABLES DROP FREE, and the \n     canvas cover draws back from LADY GOTHAM's face... \n\n     ... to a chorus of SCREAMS from the crowd. LADY GOTHAM IS\n     WEARING A GRISLY JOKER GRIN!!!\n\n     Suddenly -- in the midst of the hysteria -- THE \n     SEARCHLIGHTS DIE. The STAGE LIGHTS BLINK OUT. ANDREWS \n     ISLAND IS PLUNGED INTO DARKNESS. Instantaneous mass panic: \n     the GOVERNOR shouts to his aides as ONLOOKERS mob the \n     stage. COPS are knocked from their horses as the CROWD \n     stampedes. PANDEMONIUM RULES.\n\n     And across the harbor... block by block... GOTHAM CITY IS \n     GOING DARK.\n\n     EXT. GOTHAM SKIES - AERIAL SHOTS - NIGHT\n\n     QUICK SHOTS of FOUR HELICOPTERS hovering at different \n     points over the blacked-out city. LOUDSPEAKERS blare out a \n     PRE-RECORDED MESSAGE:\n\n                              JOKER (V.O.)\n               HAPPY BIRTHDAY, Gotham. Here's a\n               little token of my esteem. HAVE\n               FUN... 'cause THE PARTY'S ON ME!\n\n     INSANE LAUGHTER echoes. CARGO BAYS open wide. The JOKER'S \n     HELICOPTERS begin LEAFLETING THE CITY... with MONEY!\n\n     SERIES OF SHOTS\n\n     ANARCHY IN GOTHAM as high-denomination bills flutter to \n     earth, blanketing the streets. HOPELESSLY OUTMANNED COPS \n     try to maintain order as SOLID CITIZENS trample one another \n     in a paroxysm of ANIMAL GREED. BUILDINGS EMPTY as APARTMENT \n     DWELLERS race outside. ALL TRAFFIC STOPS as DRIVERS climb \n     out of their cars to SNATCH MONEY FROM THE AIR.\n\n     DARKNESS EVERYWHERE. In the pitch-black subways, TERRIFIED \n     COMMUTERS are seized by claustrophobia. GLASS SHATTERS, \n     DOORS BREAK OPEN as they claw their way out of stalled \n     subway cars and SPILL OUT onto the tracks.\n\n     On the streets above, GOTHAM'S CRIMINAL ELEMENT is having a \n     field day. The cops are preoccupied, utterly helpless \n     against the first waves of RIOTING AND LOOTING.\n\n     FLAMES ERUPT. PUNKS race down the street carrying fur coats \n     and color TV's. LOOTERS break through the display window of \n     an electronics store, and climb in among the goodies... \n     only to FLY OUT, two seconds later, on the wrong end of a \n     SHOTGUN BLAST. THE JOKER'S DREAM IS COMING TRUE.\n\n     EXT. STREET - NIGHT\n\n     In a crouch on the pavement, snapping photos of the wild \n     street action, is VICKI -- fearless, professional, doing\n     her job. A battered FORD ESCORT cruises up behind her.\n\n                              KNOX\n               VICKI!\n\n     VICKI sees KNOX, climbs into the passenger seat. He's \n     wearing a big smile. They're jazzed, oblivious to danger.\n\n                              KNOX (cont.)\n               Couldn't turn down the job, huh? A\n               girl could get hurt this way.\n\n                              VICKI\n               Yeah. Deja vu.\n\n                              KNOX\n               What do you say? Let's head for the\n               lights.\n\n     In the distance, above the tops of the buildings, BEACONS \n     are sweeping the sky.\n\n     EXT. BROAD AVENUE - NIGHT\n\n     Stationed all up and down Gotham's widest thoroughfare are\n     huge portable SEARCHLIGHTS -- mounted on trucks with\n     portable generators, unaffected by the power outage.\n\n     On the money-covered sidewalks, TOTAL BEDLAM. But on the \n     street itself, a bizarre PARADE is taking place, just as if \n     nothing's wrong. Rumbling up the avenue at two-block  \n     intervals, moored to floats, are DOZENS OF ENORMOUS \n     BALLOONS in the shapes of cartoon characters and historical \n     figures. It's like a hellish Thanksgiving's day procession.\n\n     The LEAD-OFF BALLOON is a gigantic, grotesque CLOWN -- \n     smiling ghoulishly, dressed in white pierrot frills. We \n     TILT DOWN to the FLOAT BENEATH IT... \n\n     ... and there, atop a mountain of roses where the prom\n     queen should be, sits the JOKER -- smiling, waving daintily \n     at the rioters and looters, presiding over the carnage like \n     some demented parade marshal.\n\n                                                 CUT TO:\n\n     EXT. LAKE - NIGHT\n\n     A desolate rural setting. UTTER SILENCE. Moonlight glints \n     on placid waters. We track in on a small sign bearing the \n     legend: \"GOTHAM CITY RESERVOIR.\"\n\n     Far off in the distance, HEADLIGHTS ARE APPROACHING.\n\n     EXT. ACCESS ROAD - AERIAL SHOT - MOVING - NIGHT\n\n     The THREE CARGO TRUCKS from Ace Chemical roll ominously \n     TOWARD THE RESERVOIR on their deadly mission. And then -- A \n     STREAKING BLACK SHADOW ENTERS FRAME, overtaking the TRUCKS.\n\n     THE BATWING! A phenomenal ULTRALIGHT AIRCRAFT, swift, \n     sleek, jet-black and infinitely maneuverable, it SOARS \n     EASILY past the trucks, swooping low just long enough to \n     release a BOMB over a concrete bridge.\n\n     EXT. ACCESS ROAD - A MOMENT LATER\n\n     The BRIDGE EXPLODES, blocking the trucks' path to the \n     reservoir. PUZZLED DRIVERS climb out of their cabs and \n     wonder what to do next.\n\n     They spot the BATWING in the distance -- banking, doing a \n     sharp 180. For a moment they gape in disbelief. Then they \n     HEAD FOR THE TREES as the BATWING DIVES DIRECTLY AT THE \n     TRUCKS, firing THREE ARMOR-PIERCING SHELLS... and \n     destroying the JOKER's lethal cargo once and for all.\n\n     ANGLE ON BATMAN\n\n     in the cockpit, his jaw set, not even looking back at the \n     wreckage as his plane screams off toward the Gotham \n     skyline.\n\n     EXT. GOTHAM STREET - NIGHT\n\n     FRIGHTENED PEDESTRIANS race past OVERTURNED CARS. A PARADE \n     FLOAT, run aground on the sidewalk, begins to BURN.\n\n     Above it, a damaged BALLOON -- the cartoon character \n     UNDERDOG -- is losing helium, warping and buckling in on \n     itself, sinking down gently toward the flames. Down the \n     street, KNOX'S FORD ESCORT is coming up fast.\n\n     INT. FORD - MOVING - THAT MOMENT\n\n     VICKI snapping photos out the window as UNDERDOG drifts \n     downward. FLAMES lick up at his belly -- and the cartoon \n     blimp EXPLODES.\n\n                              KNOX\n               So much for Underdog.\n\n     THEN -- as they drive past -- A SECOND EXPLOSION. And all \n     at once the STREET IS FULL OF DEADLY GREENISH GAS!\n\n                              VICKI\n               ALLIE!! THE WINDOWS!!\n\n     EXT. STREET - A MOMENT LATER - NIGHT\n\n     The Ford Escort, windows up, swerves out of a THICK \n     SPREADING CLOUD of GREEN LAUGHING GAS -- threatening to \n     engulf the entire block!\n\n     INT. FORD - MOVING - THAT MOMENT\n\n                              KNOX\n               WHAT HAPPENED?!?\n\n     VICKI stares back at the green cloud. Turns. And sees, up \n     the street, THE JOKER'S PROCESSION: BALLOONS BY THE DOZEN!\n\n                              VICKI\n               Oh my God. Compressor tanks. He's\n               got the balloons rigged with\n               compressor tanks!!\n\n                              KNOX\n               Jesus Christ, the guy's a genius.\n\n     INT. BATWING - THAT MOMENT - NIGHT\n\n     BATMAN, at the controls, gliding over the Gotham streets. \n     He looks down, sees a BILLOWING HAZE of DENSE GREEN FUMES. \n     At its periphery: LOOTERS reeling and staggering, falling \n     to the pavement, LAUGHING THEMSELVES TO DEATH.\n\n     INT. FORD - MOVING - THAT MOMENT\n\n     VICKI staring through the windshield. Overhead, an AIRCRAFT \n     streaks past... an aircraft with SCALLOPED BLACK BAT WINGS.\n\n                              VICKI\n               LOOK! IT'S BRUCE!!\n                     (frantically)\n               Allie -- the balloons. We've got to\n               find some way to tell him!\n\n                              KNOX\n               Great. How??\n\n     They speed up the street toward the PARADE. SPOTLIGHTS \n     SHINE. Suddenly KNOX's eyes bug out. He SLAMS ON THE BRAKES \n     and SKIDS TO A HALT.\n\n                              KNOX (cont.)\n               COME ON!\n\n     EXT. AVENUE - A SECOND LATER - NIGHT\n\n     Before VICKI can speak, KNOX has grabbed a tire iron from \n     the back of the car and RACED OUT ONTO THE STREET. He \n     flings the TIRE IRON through a glass STOREFRONT.\n\n     It's a COSTUME SHOP. In the window, MANNEQUINS dressed in \n     party costumes: Frankenstein. Ronald Reagan. And, that \n     current popular sensation... THE BATMAN.\n\n     As VICKI catches up with him, KNOX drags the Batman dummy \n     out of the store window. RIPS OFF ITS BLACK CAPE. And \n     DASHES MANIACALLY UP THE SIDEWALK.\n\n     Waving the cape, he VAULTS onto the back of a SPOTLIGHT \n     TRUCK. VICKI's face goes slack. Now she gets it.\n\n                              KNOX\n               GIMME A HAND UP HERE!\n\n     VICKI climbs aboard. They drape the cape over the face of \n     the spotlight. Then they put their shoulders to the swivel \n     assembly -- tilting the spotlight -- AIMING THE BEAM... \n\n     ... DIRECTLY AT THE JOKER'S WHITE CLOWN BALLOON!!!\n\n     INT. BATWING - THAT MOMENT\n\n     BATMAN stares at the CLOWN BALLOON dead ahead. On its \n     massive distended belly... a BURNING YELLOW OVAL. And in \n     the center of the oval... THE BLACK SILHOUETTE OF A BAT.\n\n     BATMAN'S MOUTH drops open. He understands.\n\n     EXT. AVENUE - ON JOKER'S FLOAT - THAT MOMENT\n\n     THE JOKER reaches into a big sack and begins distributing \n     MINIATURE GAS MASKS, like party favors, to his cronies on \n     the float. Then he pulls out a radio-operated REMOTE \n     CONTROL DEVICE and points it up at the CLOWN BALLOON.\n\n     He hits a button. The CLOWN begins to INFLATE. Its joints \n     bulge. Its FACE SWELLS UP as the COMPRESSOR TANK concealed \n     inside it releases its noxious contents. The JOKER is \n     BEAMING, a look of PURE UNALLOYED JOY on his face... \n\n     ... when his PARADE FLOAT BLOWS TO SMITHEREENS BENEATH HIM! \n     The JOKER and his men CARTWHEEL THROUGH THE AIR and TUMBLE \n     TO THE ASPHALT as THE BATWING WHIPS PAST OVERHEAD, soaring \n     through the stone canyons of Gotham at a 90-degree angle to \n     the ground!\n\n                              JOKER\n               No... NOOOOO!!!\n\n     ANGLE ON CLOWN BALLOON\n\n     as it rises, rises, swelling to grotesque proportions in \n     the starless night. The tallest buildings are far below it \n     now. Finally it BURSTS -- and the deadly GAS inside it \n     disperses harmlessly in the wind.\n\n     EXT. AVENUE - THAT MOMENT\n\n     THE JOKER on the edge of a tantrum as he digs amid the \n     rubble of his float for the remote device. At last he finds \n     it; aims it up at the other balloons in the procession; \n     hits a button repeatedly... \n\n     ... and HOWLS IN FRUSTRATION. Nothing's happening. The \n     damned thing is broken. He heaves it to the street in a\n     fit of pique.\n\n     A SCREAMING COMES ACROSS THE SKY as the BATWING swings back \n     for another pass, BUZZING the JOKER at an altitude of \n     twenty feet. SIZZLING LASER FIRE sweeps the street.\n\n     CABLES SNAP and BALLOONS DRIFT UPWARD as BATMAN'S LASERS \n     sever their moorings. The JOKER can only look on \n     helplessly, in stunned disbelief.\n\n     As he's watching his plans evaporate... HIS EYES FALL ON \n     THE MAKESHIFT BAT-SIGNAL.\n\n                              JOKER\n               There. There. -- GET 'EM!!\n\n     ANGLE ON SPOTLIGHT TRUCK\n\n     A SPRAY OF MACHINE-GUN FIRE shatters the Bat-signal. KNOX \n     throws VICKI to the street, ducks down behind the \n     spotlight, and tosses her his CAR KEYS.\n\n                              KNOX\n               GET THE CAR!\n\n     The JOKER'S GOONS are coming up fast as VICKI reaches the \n     Ford, starts it, and comes ROARING UP toward KNOX. He jumps \n     off the truck as VICKI twists the wheel, lays a track of \n     rubber, and noses the car back in the opposite direction.\n\n     GUNFIRE as KNOX jumps inside and they PEEL OUT.\n\n     INT. FORD ESCORT - MOVING - A MOMENT LATER\n\n     KNOX's breathing is ragged, but he breaks out in HYSTERICAL \n     LAUGHTER nonetheless. The two of them are totally \n     exhilarated. They can't believe what they've just done.\n\n                              KNOX\n               HOLY SHIT!!\n\n                              VICKI\n               You okay?\n\n                              KNOX\n               Yeah. Yeah. Little winded. DID YOU\n               SEE THAT?!\n\n                              VICKI\n                     (laughing wildly)\n               God yes, Allie. I've gotta say --\n               that was the ballsiest move I\n               ever --\n\n                              KNOX\n                     (ecstatic)\n               Holy shit. Holy --\n\n     He GURGLES. AN ENORMOUS GOUT OF BLOOD bubbles up between \n     his lips -- and BURSTS.\n\n                              VICKI\n               ALLIE!!\n\n     His hand goes to his stomach -- and comes away bloody. He \n     looks down in genuine bewilderment.\n\n                              KNOX\n               Jesus, Vicki.\n\n     That quickly, he's dead. VICKI lets out an awful wail and \n     slams on the brakes. She sits there in the middle of the \n     street, POUNDING THE WHEEL, TEARS pouring down her face.\n\n     EXT. GOTHAM HARBOR - NIGHT\n\n     In the sky, CARTOON CHARACTERS drift lazily out to sea.\n\n     EXT. BROAD AVENUE - NIGHT\n\n     THE JOKER and his boys running like hell down the avenue, \n     past the parade. They reach the last of the floats -- the \n     one bringing up the rear -- then CLIMB ABOARD and disappear \n     through a CONCEALED HATCH.\n\n     WOOD SPLINTERS as the top of the float begins to ROTATE \n     mysteriously. The muzzle of a CANNON breaks through the \n     parade decorations. And one moment later... \n\n     A ROSE-COVERED TANK is rumbling up Broad Avenue!\n\n     INT. BATWING - THAT MOMENT\n\n     BATMAN sweeps past overhead. He sees the tank, unleashes a \n     burst of LASER FIRE. It bounces harmlessly off the tank, \n     leaves a trail of SMOKING ASPHALT on the street. He swoops \n     low overhead, hits a button on his control panel as he \n     streaks OVER THE TANK and into firing range.\n\n     INT. TANK - THAT MOMENT\n\n     THE JOKER and his MEN clap hands to their ears as an EAR-\n     SPLITTING ULTRASONIC SHRIEK reverberates in the tank. The \n     JOKER screams out commands, to no avail. No one can hear\n     him. He falls on the controls, begins hitting buttons.\n\n     EXT. STREET - THAT MOMENT\n\n     The TANK TURRET swings wildly. A HEAT-SEEKING MISSILE rips \n     through the night, narrowly missing the BATWING... and \n     BLOWING A HOLE in the side of a skyscraper.\n\n     INT. BATWING - THAT MOMENT\n\n     THE BLAST all but knocks the BATWING out of the sky. BATMAN \n     stabilizes the plane, climbs for the clouds. When he's \n     clear of the buildings, he grits his teeth and rolls out.\n\n     He's coming back for more!\n\n     INT. TANK - THAT MOMENT\n\n     The JOKER stares at a tiny BLIP on his radar screen.\n\n                              JOKER\n               He'll be back... he'll be back!!\n\n     EXT. BROAD AVENUE - ON BATWING\n\n     The black ultralight hurtles down Broad Avenue at full \n     speed, on a suicide mission. MISSILES streak past on either \n     side. MACHINE GUN FIRE peppers the dome of the cockpit. The \n     REAR STABILIZER WING takes a direct hit... and BURSTS INTO \n     FLAME!\n\n     The BATWING, trailing thick black smoke, bears down on the \n     tank like a kamikaze plane. BOMB BAYS OPEN as BATMAN dumps \n     the last of his high explosives DIRECTLY INTO THE PATH OF \n     THE TANK. The BATWING takes a hard bounce off the top of \n     the tank and CRASHES TO THE STREET.\n\n     And suddenly a GAPING CHASM opens underneath the tank as \n     the bombs go off -- and BROAD AVENUE BEGINS TO SPLIT WIDE \n     OPEN!\n\n     INT. SUBWAY TUNNEL - THAT MOMENT\n\n     BROKEN CONCRETE SLABS rain down on a SUBWAY CAR stalled in \n     the tunnel DIRECTLY BENEATH BROAD AVENUE. SUPPORT GIRDERS \n     groan and GIVE WAY as the STREET ITSELF COLLAPSES -- and \n     the front end of the TANK drops through, CRUSHING THE \n     SUBWAY TRAIN BENEATH IT!\n\n     EXT. BROAD AVENUE - THAT MOMENT - NIGHT\n\n     The rear end of the TANK projects out through the rubble. A \n     hatch pops open. The JOKER crawls out through the smoke and \n     pulls himself up to the street.\n\n     He's down to his last three GOONS. He points to the \n     BATWING: bent, broken, WEDGED ON ITS SIDE in the asphalt \n     SEAM running up Broad Avenue -- half in, half out of the \n     tunnel.\n\n                              JOKER\n               You do him. I'm outta here.\n\n     The GOONS look on in dismay as the JOKER scurries off. They \n     sidestep blackened debris and move up cautiously on the \n     Batwing. Through the cockpit dome they can see BATMAN... \n     inert in his harness, beaten to a pulp, all but dead.\n\n     A JET OF FLAME drives them back momentarily. They reach for \n     their guns, move in warily... \n\n                              VOICE\n               Yo.\n\n     The frightened GOONS turn in unison. An abrupt flurry of \n     motion -- feet and fists flying -- quick flashes of red and \n     green --\n\n     -- and THREE GOONS lie paralyzed on the street. The only \n     one left standing is a fifteen-year-old boy garbed in a \n     red-and-green aerialist's uniform... DICK GRAYSON.\n\n     INT. BATWING - THAT MOMENT\n\n     BATMAN slumps at the controls. Beneath him, asphalt SHIFTS \n     and BUCKLES. The Batwing lurches to the right, drops a foot \n     or two into the tunnel. Metal braces collapse and the \n     plexiglass dome of the cockpit SHATTERS LIKE AN EGGSHELL.\n\n     TONGUES OF FIRE lick at his face. He's helpless, pinned in \n     place. He manages to look up -- and SEES, through a dream-\n     like haze, A HAND extended toward him:\n\n                              DICK\n               HEY! COME ON!\n\n     And suddenly DICK is clambering down into the flaming \n     wreckage. He gets an arm around BATMAN's chest and with an \n     extraordinary effort HAULS HIM OUT OF THE BATWING.\n\n     EXT. STREET - A MOMENT LATER - NIGHT\n\n     They stagger across the ruptured street. BATMAN grimaces in \n     agony. His right leg -- shattered -- is like rubber beneath \n     him. His ribs are crushed. He's barely conscious.\n\n                              DICK\n               Now we're even, huh? Even up.\n\n                              BATMAN\n               How did you... \n\n                              DICK\n               I hitched. MOVE IT!\n\n     DICK drags BATMAN to safety as the Batwing ERUPTS INTO \n     FLAME behind them.\n\n                              BATMAN\n               The Joker. Is he --?\n\n                              DICK\n               Forget it. Relax.\n                     (beat)\n               ... He's mine now.\n\n     DICK snatches an abandoned .38 off the pavement.\n\n                              BATMAN\n               DICK!\n\n     THE BATMAN tries to pull himself erect. The pain is \n     unendurable. His body has finally failed him.\n\n     He collapses on the pavement, powerless to intervene, as \n     DICK races off with murder in his eyes.\n\n     EXT. GOTHAM CATHEDRAL - NIGHT\n\n     A BELLTOWER's jagged spire, jutting up into the night sky, \n     piercing the moon. Down at street level, the JOKER is \n     scrambling up the marble steps at the entrance to the old \n     abandoned cathedral. He pulls a WALKIE-TALKIE off his belt.\n\n                              JOKER\n               Gotham cathedral. Come and get me.\n\n     HEAVY PANELED DOORS groan on tired hinges as THE JOKER \n     forces his way inside. A beat. Then DICK GRAYSON appears, \n     hot on his trail, sprinting up the steps two at a time.\n\n     INT. CATHEDRAL - A MOMENT LATER - NIGHT\n\n     Ancient and creepy. A huge pipe organ, shattered stained\n     glass windows, row after row of mahogany pews... all \n     forgotten, covered with dust and cobwebs. The JOKER wanders \n     about, staring at the statuary, the rusted icons.\n\n     DICK enters silently behind him. He kneels behind a rear \n     pew, brings up the gun, and squeezes off THREE QUICK SHOTS \n     at the JOKER. The JOKER dives, takes cover, and RETURNS \n     DICK'S FIRE. Then: silence.\n\n     In a crouch, groping his way along the wall, THE JOKER \n     finds what he wants: a small door opening on a wooden \n     stairway, leading to the belltower. He ducks inside and \n     starts up.\n\n     DICK'S GUN drops with a thud. His hand slips from the back \n     of the pew. In the second before he slumps to the floor, \n     unconscious, he sees a curious sight: a TINY BLACK NINJA \n     WHEEL, imbedded in the flesh of his leg.\n\n     Behind him -- framed in the arched doorway -- A RAGGED \n     BLACK GHOST begins his final unholy march down the center \n     aisle of the old cathedral.\n\n     INT. CATHEDRAL - BELLTOWER - NIGHT\n\n     A tiny stone chamber, 8'x8', open on four sides to the \n     wind. The enormous church bell has long since been removed.\n\n     The JOKER stands in an archway, gazing at the gargoyles on \n     the roof below. He hits a button on the walkie-talkie:\n\n                              JOKER\n               I'm in the belltower. Don't land.\n\n     INT. HELICOPTER - MOVING - NIGHT\n\n     A PILOT replies through his radio headset.\n\n                              PILOT\n               E.T.A. two minutes. Hang on.\n\n     The PILOT swings the copter right in a wide, swooping arc.\n\n     INT. STAIRWAY TO BELLTOWER - THAT MOMENT - NIGHT\n\n     BATMAN. Broken, beaten, his right leg useless, he hauls \n     himself up the steps one at a time. He should be dead.\n     Dried blood cakes his face, his chest.\n\n     Dizzy, exhausted, his body strained to the limit, he slumps \n     against a wall to steady himself, then reaches into his \n     utility belt for a painkiller -- and forces the capsule \n     back onto his dry, swollen tongue.\n\n     Quaking all over, he tries to draw himself erect... and \n     TOPPLES OVER, landing with his full weight on the rotten \n     wood of the belltower stairs.\n\n     THE STAIRWAY COLLAPSES, turning to splinters beneath him. \n     And suddenly BATMAN finds himself DANGLING PRECARIOUSLY IN \n     MIDAIR, hanging by one hand to an upper step.\n\n     It would be so much easier to let go. He looks down at the \n     fragments of the shattered stairway, STILL FALLING, \n     vanishing into the dark depths of the stairwell.\n\n     Then he looks up. At the trapdoor. A mere six feet away. \n     His TEETH CLENCH in a monstrous grimace. AND WITH AN \n     INHUMAN EFFORT, HE HOISTS HIMSELF UP ONTO THE UPPER STEPS.\n\n     For a full five seconds he's blind with pain. A RAGGED \n     WOODEN SHAFT is buried in his right shoulder. Twitching, \n     trembling, he reaches up and YANKS IT OUT with his last \n     ounce of strength.\n\n     The trapdoor is a foot above his head. It could be a mile. \n     BATMAN finally realizes he's not going to make it.\n\n     He reaches down and rips open a Velcro seal on his utility \n     belt, revealing the strange TIMER DEVICE we saw him making \n     earlier. Before he can activate it his hand falls limply at \n     his side.\n\n     THE BATMAN is out like a light.\n\n     INT. BELLTOWER - THAT MOMENT - NIGHT\n\n     The JOKER glances casually down at the trapdoor, wondering \n     what all the noise is about. He draws his gun, moves \n     cautiously to the trapdoor, and lifts it a few inches... \n     just enough to see the unconscious form on the stairs.\n\n                              JOKER\n               ... Batman?\n\n     No reply. The JOKER stands there and lets out a little \n     snicker. He looks out through the archway, sees no sign of \n     his rescue copter. Then -- a look of curious amusement on \n     his face -- he steps down THROUGH THE TRAPDOOR and LUGS \n     BATMAN up into the belltower.\n\n     He props BATMAN up against a wall. Still no sign of life. \n     The JOKER crouches beside him and -- almost tenderly -- \n     pats his face.\n\n                              JOKER (cont.)\n               Batman? Batman?\n\n     THE BATMAN's lips part. But he's too weak to speak.\n\n                              JOKER (cont.)\n               I thought you'd be more comfortable\n               here in the belfry.\n                     (chuckling to himself)\n               Before I kill you I'd like to see\n               who you are. Would that be okay?\n\n     BATMAN emits a tiny low moan. The JOKER takes it as a yes \n     and reaches over to undo his cowl.\n\n     BRUCE WAYNE stares up with dulled, sightless eyes. The \n     JOKER reaches into his pocket for a purple handkerchief, \n     moistens it, dabs at the caked blood on BRUCE's face.\n\n                              JOKER (cont.)\n               Oh my, aren't we pretty.\n                     (brightening suddenly)\n               I know you! You're the rich boy!!\n\n     The JOKER is enormously tickled by this discovery. He claps \n     his hands together in sheer glee.\n\n                              JOKER (cont.)\n               My goodness, what in the world made\n               you do it? It must've been\n               something pretty terrible!\n\n     He's practically dancing now. He's made a friend.\n\n                              JOKER (cont.)\n               You know, we should've sat down and\n               had us a little heart-to-heart. I\n               bet we would have got on famously.\n\n                              BATMAN\n               Mad... man... \n\n                              JOKER\n               Well now, you're not exactly the\n               picture of mental health, are you.\n\n                              BATMAN\n               ... Murderer... \n\n                              JOKER\n               Bruce, we're both murderers. Think\n               how many people you've killed by\n               letting me live.\n\n     A SPOTLIGHT cuts through the night sky. The JOKER hears his \n     helicopter approaching in the distance.\n\n     BRUCE reaches down furtively. Finds the timer on his \n     utility belt. FLICKS A SWITCH... and the countdown begins.\n\n     The JOKER pulls a straight razor from his pocket and opens \n     it gingerly.\n\n                              JOKER (cont.)\n               I have to do it now, Bruce, but it\n               won't even hurt. Now relax. The\n               bat's in his belfry, all's right\n               with the world... \n\n     He has the razor almost up to BRUCE's throat when BRUCE \n     reaches out and GRABS HIS LAPELS in a death grip. The JOKER \n     is momentarily amused by this seeming display of affection.\n\n                              JOKER (cont.)\n               Why, Bruce... \n\n     Then he hears ticking.\n\n     Looks down at the flashing digital display on BRUCE's belt. \n     0:26 seconds. 0:25 seconds.\n\n     He SHRIEKS HORRIFICALLY and DROPS THE RAZOR.\n\n     BRUCE won't let go of him. Finally he manages to lurch \n     convulsively away, sprawling on the floor of the belfry.\n\n     BRUCE is wearing a great big Joker smile.\n\n                              JOKER (cont.)\n               IT'S NOT FUNNY!!!\n\n                              BRUCE\n               No... sense... of humor?\n\n     The JOKER reaches out for the ticking time bomb. Thinks \n     better of it and retracts his shaking hand.\n\n     He can see the copter approaching now, slicing through the \n     clouds. He screams, waves a flashlight in the air: his \n     signal beacon. 0:20 and counting.\n\n     The JOKER scans the belltower frantically. His eyes fall on \n     the trapdoor. He races over, flings it open, starts down \n     the stairs in a frenzy.\n\n     There are no stairs. They've collapsed. 0:16 and \n     counting.\n\n     Screaming insanely, the JOKER vaults through the door and \n     makes for the open stone archway. The copter is directly \n     overhead now. A rope ladder drops from its belly.\n\n     EXT. BELLTOWER - THAT MOMENT\n\n     The helicopter descends, its whirling blades stirring up a \n     windstorm on the roof of the old abandoned cathedral. DEAD \n     LEAVES rise and swirl in the churning air.\n\n     INT. BELLTOWER\n\n     The JOKER makes a futile grab at the rope ladder, almost \n     losing his purchase on the archway parapet. He gestures \n     wildly for the copter to make another pass. 0:12 to go.\n\n     EXT. BELLTOWER\n\n     A maelstrom of swirling leaves. And now, among the leaves \n     -- roused from their resting place in the rotten rafters of \n     the old cathedral --\n\n     -- A HORDE OF SQUEALING, CHITTERING BATS!! Filling the air \n     like a black cloud, HUNDREDS OF THEM, taking flight in\n     blind uncomprehending fury --\n\n     INT. BELLTOWER\n\n     The JOKER leaps into empty space, grabs hold of the ladder, \n     cackles in mad triumph --\n\n     -- AND SUDDENLY THE BELLTOWER IS FULL OF BATS. A SCREECHING \n     SWARM, HIDEOUS, BLACK-WINGED -- SWOOPING THROUGH THE \n     ARCHWAYS DIRECTLY AT THE JOKER --\n\n     -- WHO SCREAMS IN TERROR -- LETS GO OF THE LADDER --\n\n     -- and plunges into the night.\n\n     TIGHT ON BATMAN. Six seconds remain. There is still time if \n     he makes his choice now.\n\n     Surrounded by the flapping of leathery wings, his body \n     working on pure adrenalin, he unbuckles the belt. Lurches \n     into position. Heaves it out into the darkness.\n\n     It snags on the bottom rung of the dangling rope ladder.\n\n     INT. HELICOPTER - POV CO-PILOT\n\n     The CO-PILOT is hanging out one side of the copter, just \n     enough to see what's going on.\n\n                              CO-PILOT\n               PULL UP!! PULL --\n\n     EXT. CHURCHYARD - OVERHEAD ANGLE\n\n     It's as if time has stopped. The world has grown suddenly \n     silent. We're looking down at the JOKER, whose body lies \n     splayed and broken on the flagstone surface of the \n     churchyard. Slowly, elegantly -- we have all the time in \n     the world, now -- we DRIFT DOWNWARD, closer, until his FACE \n     FILLS THE SCREEN, the familiar chilling grin still intact.\n\n     Sad clown, A-one crazy boy, staring aimlessly at the stars. \n     Suddenly his face is bathed in a brilliant gasoline GLOW.\n\n     POV JOKER\n\n     Looking up he sees a beautiful display of fireworks, \n     bursting and burning, spirals of color snaking through the \n     sky as the helicopter explodes in eerie silence.\n\n     REVERSE ANGLE - THE JOKER'S FACE\n\n     It's all so lovely. The JOKER's expression is happy, almost \n     childlike, as he gazes up at this private show. Gradually, \n     though, the bright colors fade; and the JOKER's face begins \n     to relax, the twisted grin dissolving at last as darkness \n     sets in.\n\n                                               FADE THROUGH TO:\n\n     INT. TELEVISION STUDIO - NIGHT\n\n     AN ANCHORWOMAN delivering an oncamera EDITORIAL.\n\n                              ANCHORWOMAN\n               As the details of the Joker's\n               heinous plan become known, a city's\n               gratitude goes out to the mysterious\n               Batman. His whereabouts remain\n               unknown, but Batman -- if you're\n               alive -- if you're listening --\n               thank you.\n\n     EXT. CEMETERY - DAY\n\n     VICKI at a fresh gravesite. She places a FLORAL ARRANGEMENT \n     in the urn at the head of the grave; stands back to examine \n     it; then bends once more to reposition the drooping \n     flowers.\n\n                              VICKI\n               I loved you too.\n\n     As soon as the words come out, she begins to CRY. Then she \n     gets hold of herself; rises; turns up her collar; and goes.\n\n     The headstone reads: \"ALEXANDER KNOX, 1956-1987.\"\n\n     INT. WAYNE MANOR - STUDY - DAY\n\n     ALFRED, in his apron, on the phone.\n\n                              ALFRED\n               No, Mr. Wayne is in Thailand. I'm\n               afraid he's quite unreachable.\n\n     INT. WAYNE MANOR - DAY\n\n     The glass-enclosed room which houses BRUCE's Olympic-sized \n     SWIMMING POOL. Outside, snow is falling.\n\n     In the pool, on an inflatable rubber raft, is BRUCE WAYNE. \n     Beside him, waist-deep is the water, is VICKI -- helping \n     him rehabilitate his leg and shoulder.\n\n                              VICKI\n               I don't know why I'm doing this. I\n               half wish you'd stay a cripple.\n\n                              BRUCE\n               Ohhhh... you don't mean that.\n\n                              VICKI\n                     (grasping for words)\n               I don't, but... I do. It's just... I\n               love you, Bruce. I --\n\n                              BRUCE\n                     (taking her hand)\n               Vicki. Do you love half of me? Or\n               all of me?\n\n     A hard question for VICKI to answer. She thinks it over for \n     several beats, then SMILES... SLOWLY, SADLY.\n\n                              VICKI\n               I guess you did it, didn't you. You\n               saved everyone.\n                     (pause)\n               Almost.\n\n     For a moment he stares deeply into her eyes. Then he pulls \n     her over, takes her in a tight embrace.\n\n                              BRUCE\n               I don't know how to explain this so\n               it makes sense... but you saved\n               me.\n\n     INT. BATCAVE - THAT MOMENT - DAY\n\n     DICK GRAYSON stands at the brink of the bottomless pit and \n     looks up at the GYMNAST'S RINGS suspended overhead. He sets \n     his jaw and then -- with only a moment's hesitation -- \n     LEAPS INTO THE VOID.\n\n     His hands find the rings. He launches himself HIGH INTO THE \n     AIR and does a spectacular TRIPLE SOMERSAULT, catching the \n     rings on his way down.\n\n     Exhilarated, he makes a perfect landing on the edge of the \n     pit. 10-point-0. A SMILE OF PLEASURE comes to his lips.\n\n                                                 CUT TO:\n\n     EXT. ROOFTOP - GOTHAM CITY - NIGHT\n\n     A dark, moonless night. LIGHTS OF THE CITY sparkle in the \n     distance. CAMERA DRIFTS across the rooftop, settling \n     finally on the broad back of a BLACK-CAPED FIGURE poised at \n     the edge of the roof, gazing down on the streets below.\n\n     A SECOND FIGURE enters frame. We get a brief glimpse of his \n     RED-AND-GREEN SUIT in the seconds before our EYES TURN \n     SKYWARD... to the SEARING YELLOW SPOTLIGHT sweeping through \n     the clouds. In its center: the VAST BLACK SILHOUETTE of a \n     BAT, wings extended, DOMINATING the night sky.\n\n     We HOLD on the GLARING BAT-SIGNAL as BATMAN and ROBIN \n     vanish over the edge of the roof, plunging down toward new \n     adventures. MUSIC BUILDS and we\n\n                                                 FADE OUT.\n\n\n\n\n   \n\n\n\n\n\n\n\nBatman\nWriters :   Sam Hamm  Warren Skaaren\nGenres :   Action  Crime  Fantasy  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:25.937356"}