{"title": "Battle of Algiers, The", "film_link": "/Movie Scripts/Battle of Algiers, The Script.html", "script_link": "/scripts/Battle-of-Algiers,-The.html", "info_raw": "\n\nBattle of Algiers, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gillo Pontecorvo  Franco Solinas\nGenres  Drama  War\n\nRead \"Battle of Algiers, The\" Script\n\n\n", "script": "\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nThe Battle of Algiers\n\n\nThe Battle of Algiers\n\n\n1\tVILLA HEADQUARTERS. INSIDE. NIGHT. \n\n\tInside a three-story villa, just built, with whitewashed walls. \n\tAn elevator shaft is empty, the large cables dangle. \n\n\tOn every landing two apartments. The front doors are wide open.\n\tWhitewash on the floor of the halls, swirls of whitewash on the \n\twindowpanes, naked light bulbs hung from electric wires. The rooms \n\tcontain hardly any furnishings. \n\n\tThe kitchens are still without sinks and stoves.\n  \n\tAn agitated bustle, a rhythm of efficiency. Paratroopers go up and \n\tdown the stairs, pass along the halls, enter and leave the rooms.\n\n\tThe sounds in the background are indecipherable.\n\n\tSHOUTED ORDERS, CRIES, HOWLS. \n\n\tSHOUTS, HALF-SPOKEN REMARKS, LAUGHS.\n\n\tSOMEWHERE A GRAMOPHONE IS PLAYING AT FULL BLAST. \n\n\tThe scene is tense. No pauses.\n \n\tWhen the paras are tired, they move to another room. \n\n\tThey sit down, stretch out on the floor, drink coffee or beer, and \n\tsmoke cigarettes while awaiting the next shift. Suddenly, the rhythm \n\tof this routine, the timing of these images is upset. A para rushes \n\tdown the stairs, and asks cheerfully while running:\n\n\t\t\t\tMARC\n\t\tThe colonel. Where's the colonel? \n\n\t\t\t\tPARAS\n\t\tWhy? What's happening?\n\n\t\t\t\tMARC \n\t\tWe know where Ali la Pointe is. One of \n\t\tthem \"spoke\" ...\n\n\tHis voice echoes through the corridors, on the landings, from one \n\tfloor to another. The excitement is contagious. Many crowd around \n\tthe door of the kitchen.\n \n\tThe Algerian who has \"spoken\" is there. He is young with a thin face \n\tand feverish eyes. The paras are all around him: they help him stand \n\tup, dry him, clean his face with a rag, give him some coffee in a \n\tthermos cover. They are full of attention, sincerely concerned. One \n\tof them tries to push away the others.\n\n\t\t\t\tPARA \n\t\tC'mon, let him breathe!\n\n\tMeanwhile others who are arriving ask if it is true. \n\n\t\t\t\tOTHER PARAS\n\t\tSo he spoke? Does he really know where \n\t\tAli is?\n \n\t\t\t\tMARC \n\t\tIt seems so. We'll go see. Give him a \n\t\tlittle coffee. \n\n\tMarc is tall and husky, his eyes young and cheerful. One of the others \n\tasks him with a shade of admiration:\n \n \t\t\t\tPARA \n\t\tHey Marc, you made him talk?\n \n \t\t\t\tMARC \n\t\t\t(smiling)\n\t\tSure.\n \n\tHe then begins to smoke again, and moves aside to rest a bit. The \n\tAlgerian is trying to drink, but his hands are trembling. Someone \n\thelps him and holds still the cover of the thermos, drawing it to his \n\tmouth:\n \n\t\t\t\tLAGLOY \n\t\tC'mon Sadek ... Drink, you'll feel better. \n\n\tThe Algerian drinks, but his stomach can't take it, causing him to \n\tdouble over and vomit again. \n\n\tColonel Mathieu enters, elegant and graceful.\n \n\t\t\t\tMATHIEU \n\t\t\t(smiling)\n\t\tAt ease. Is it true? \n\n\t\t\t\tMARC \n\t\tI think so. Rue des Abderames three ...\n \n\tThe colonel turns to the para, who had gone to call him, and who is \n\tholding a pair of camouflage fatigues in his hands. \n\n\t\t\t\tMATHIEU \n\t\tDress him.\n\n\tThen he goes near the Algerian, lifts his chin, inspects him for a \n\tmoment with curiosity.\n \n\t\t\t\tMATHIEU \n\t\tChin up, it's all over. Nothing can happen \n\t\tto you now, you'll see. Can you stand up?\n \n\tThe Algerian nods yes. The colonel turns to the paras who are holding \n\thim up. \n\n\t\t\t\tMATHIEU \n\t\tLet him go.\n\n\tHe takes the camouflage fatigues and hands them to the Algerian.\n\n\t\t\t\tMATHIEU \n\t\tHere, put them on.\n \n\tThe Algerian mechanically takes the fatigues, but he doesn't \n\tunderstand. The colonel explains to him:\n\n\t\t\t\tMATHIEU \n\t\tWe're trying to help you. We're going to \n\t\tthe Casbah. Dressed like this, they won't \n\t\tbe able to recognize you. Understand? \n\t\tWe're going to see the place, then you'll \n\t\tbe free ... and under our protection ...\n\n\tThe Algerian shivers from the cold. He is completely naked. He \n\tlaboriously puts on the fatigues which are too big for him. \n\n\t\t\t\tMATHIEU \n\t\tGo on, give him the cap.\n\n\tThey give him a wide belt and buckle it. The other paras, one on either \n\tside of him, pull up his sleeves to the elbows. A third places the cap \n\ton his head and cocks it. \n\n\t\t\t\tLAGLOY \n\t\tNationalized!\n      \n\tThe colonel turn to him angrily: \n\n\t\t\t\tMATHIEU \n\t\tDon't be an idiot, Lagloy!\n     \n\tThe Algerian is ready. The paras look at him repressing their laughter. \n\tThe Algerian continues to tremble. His breath is short, his eyes \n\tglossy. He is crying.\n \n \t\t\t\tCAPTAIN \n\t\tLet's go.\n \n\tThe Algerian looks around. He breathes deeply. Then, suddenly, \n\tunexpectedly, he lets out a hoarse cry:\n \n \t\t\t\tSADEK \n\t\tNo!\n \n \tand tries to jerk forward toward the window.\n\n\tMarc seizes him immediately, and with his right hand grabs him by the \n\tchest, almost lifting him. With his left hand he gives him two quick \n\tslaps, not very hard.\n \n \t\t\t\tMARC \n\t\t\t(persuadingly)\n\t\tWhat do you think you're doing, you fool? \n\t\tDo you want us to start all over again? \n\t\tC'mon, be good. Don't make me look like \n\t\tan idiot in front of the others.\n \n\tHe makes a reassuring sign to the colonel. Then, he takes the Algerian\n \tby the arms, and they move off.\n \n\n2\tSTREETS OF ALGIERS. OUTSIDE. DAWN. OCTOBER 7, 1957. \n\n\tThe city is gray and white, by the sea which looks like milk. The dawn\n\toutlines her features sharply.\n \n\tThe streets and wide avenues of the European quarters are empty.\n\tSilence, until gradually is heard ...\n \n\tA HUMMING OF MOTORS.\n \n\tOne truck after another. Their headlights on, with an opaque glow, by \n\tnow useless.\n \n\tA line of trucks follow one another along the sea-front, all at the \n\tsame speed.\n \n\tThey turn right and go up toward Place du Gouvernement. \n\n\tHere, without stopping, the columns divide in two. The two lines enter \n\teach of the two roads that lead up to surround the Casbah.\n\n\tIn the brighter light, the Casbah appears completely white, limestone. \n\tEnclosed by the European city, it stands at a greater height and \n\toverlooks it.\n \n\tMosaic of terraces. White pavement, pavement interspersed by the black \n\toutlays of narrow alleys. Only a jump from one terrace to another ...\n\n\tAgile and silent, the paras jump one by one from the trucks in a hurry.\n \n\tSOUND OF TRUCKS.\n \n\tThey arrange themselves geometrically, their movements synchronized. \n\tThey disperse and disappear in the alleys. \n\n\tThey reappear together, then once again scatter. \n\n\tThey meet without looking at one another; each one takes his own \n\tcourse.\n \n\tIn like manner without a sound, they are above, even on the terraces, \n\tin perfect geometry. Even up here, the paras tighten their grip ...\n \n\n3\tRUE DES ABDERAMES. COURTYARD OF HOUSE. INSIDE/OUTSIDE. DAWN.\n \n\tEvery three yards, there is a para, even at all four corners of an \n\tintersection.\n\n\tThey are also in the side streets as well as the main streets. \n\n\tAnd also above, against the sky, many other paras appear. \n\n\tNumber three. The doorway is the height of a man. A squadron stands \n\tready in a semicircle with machine guns in firing position.\n\n\tMarc continues to hold up the Algerian by his arm. \n\n\tThe captain glances at his watch, then looks up at the terrace and \n\tgives a signal.\n \n\tIn a lowered voice, without turning around, he speaks to the para who \n\tis at his back:\n \n \t\t\t\tCAPTAIN \n\t\tFire ...\n \n\tThe para nears the front door, his legs wide open, his machine gun, \n\tclenched at his side, and aims at the lock.\n \n \tMACHINE GUN FIRE.\n \n\tHe moves the gun barrel in a circular direction. \n\n\tImmediately the others hurl themselves against the door. \n\n\tAt the same time, the door of the terrace is broken down, and the paras \n\tburst into the house below.\n\n\tThe inner courtyard is square. In the center there is a well; above, a \n\tpatch of sky; on four sides, the arcades, columns, and majolica arches. \n\tBeneath the porches, there is a door for every dwelling. And above, a \n\tbalcony with railings and other doors. The doors are wide open. The \n\tparas quickly carry out their orders.\n\n\tORDERS, CURT AND BRIEF.\n\n\tThe people are used to all this and know how to obey. The scene takes \n\tplace exactly as if it were an arranged maneuver, a practice drill.\n \n\tThe rooms are emptied in a few seconds. The people are crowded together \n\tin the courtyard. \n\n\tEyes wide with fright.\n \n\tMen, women, and children with blankets and sheets thrown around their \n\tshoulders. By now, it is almost day. A soft light is diffused from \n\tabove.\n \n\tThe Algerian walks with his head lowered, Marc on one side, the captain\n \ton, the other.\n \n\tThey climb to the first floor and go along the balcony. \n\n\tThe Algerian stops in front of a door. \n\n\tThe captain murmurs softly:\n \n \t\t\t\tCAPTAIN \n\t\tHere?\n \n \tThe Algerian nods yes. They enter.\n \n\n4\tALI'S ROOM. INSIDE. DAWN. \n\n\tThe room is badly lit. There is a mattress on the floor, and another on \n\tthe table, a cupboard against the wall, some chairs. Nothing else. At \n\tthe back of the room to the left, there is a dividing curtain hung by a \n\tcord at medium height. The curtain is drawn and a large bed with brass \n\theadboards is visible. The Algerian points in that direction; the \n\tcaptain signals for him to go there.\n\n\tThey go forward silently, and push aside the curtain. There is a small \n\tlight bulb hung on the wall beneath a small shelf covered with \n\tpostcards and photos.\n \n\tThe baseboard all around is more than three feet tall and is covered by \n\tmajolica tiles.\n\n\tThe Algerian points to a spot in the brick structure, on the back \n\twall, between the headboard of the bed and a corner of the room.\n\n\tMarc and the captain have their machine guns ready. The captain goes \n\tnear the wall, his breath drawn, and begins to examine it.\n \n\tHe runs the fingernail of his thumb along the wall horizontally, \n\tbetween one row of tiles and another.\n\n\tHe taps the tiles at different places until he hears the plaster in the \n\tinterstices crumble. He looks at the bit of plaster that is left in his \n\tnail.\n \n\tHe squeezes it in his fingertips; it is soft, newly laid.\n\n\tThen he bends over, places his ear to the wall, and listens. \n\n\tSuddenly he smiles.\n \n\n5\tALI'S HIDING PLACE. INSIDE.\n \n \tThere isn't enough air in the hiding place. The four are forced to \n\tbreathe deeply. And in that small space their laborious breaths \n\tresound like splashes.\n \n\tAli la Pointe has his eyes fixed upon the square patch of wall that \n\tseals the hiding place. His eyes are large, black, slanted, his eyelids \n\theavy, somewhat lowered, so that the black of the irises appears even \n\tblacker in the shadows, deeper and more sullen.\n\n\tPetit Omar is with him, a boy of twelve, and Mahmoud who is eighteen. \n\tThere is also Hassiba, a Kabyle girl, blond, blue-eyed, and fair \n\tskinned.\n\n\tThe hiding place is only five feet high, and hardly holds them. They \n\tare sitting or stretched out on the ground, close to one another.\n\n\tThe entrance to the hiding place is blocked by the small patch of wall \n\twhich matches exactly the rest. It is held firm by a bar through an \n\tiron ring attached at the center. On the other side of the cell, above \n\tthem, there is a hole for air. \n\n\tThey are tense and do not move. Their lips are dry, half-open, and \n\ttheir breasts rise and fall in a difficult attempt to breathe.\n \n\t\t\t\tCAPTAIN \n\t\t\t(off)\n\t\tAli la Pointe ... the house is surrounded. \n\t\tYou haven't got a chance. Surrender. Let \n\t\tthe child and the girl come out, then you \n\t\tand the other one. Leave your weapons \n\t\tinside. It's useless to try anything. Our \n\t\tmachine guns are ready to fire -- you \n\t\twouldn't have time. Do you understand?\n \n\tAli's face is motionless and hasn't changed its expression.\n \n\t\t\t\tCAPTAIN \n\t\t\t(off)\n\t\tAli, do you hear me? Listen! You are the \n\t\tlast one. The organization is finished. \n\t\tAll your friends are dead or in prison. \n\t\tCome out. You'll have a fair trial. Come \n\t\tout, surrender.\n \n\tSOUND OF FOOTSTEPS, OTHER VOICES, CHEERFUL, INCOHERENT: \n\n\t\t\t\tVOICES PARAS\n\t\tWhy are they breathing so heavily? \n\t\tFear ...\n\t\tAir ... \n\t\tThey haven't got enough air inside ...\n\n\tAnd again the voice of the captain, clear and somewhat distant:\n\n\t\t\t\tCAPTAIN \n\t\t\t(off)\n\t\tMake up your mind, Ali? Do you want us to \n\t\twall you in, or do you prefer that we \n\t\tblow you to pieces? ... Alright. So much \n\t\tthe worse for you.\n\n\tAli's expression is still firm; his stare is dark and sullen.\n \n\n6\tVIEWS OF THE CASBAH. OUTSIDE. DAY. NOVEMBER 1, 1954. \n\n\tThe Casbah: compressed humanity, swarming in the alleyways, on the \n\tsteps, in the cafes, in the Arab baths, in the mosques, and in the \n\tmarkets; a tangle of voices, gestures, faces, veiled women, eyes. \n\tSomeone is putting up a handbill, another distributes them.\n \n\t\t\t\tSPEAKER\n\t\t\"National Liberation Front! Algerian \n\t\tbrothers! The time has come to break \n\t\tloose at long last from the bonds of \n\t\tmisery in which one hundred and thirty \n\t\tyears of colonial oppression has kept us \n\t\tchained. The moment of struggle is near; \n\t\tour goal -- national independence ...\"\n \n\n7\tVIEWS OF THE EUROPEAN CITY. OUTSIDE. DAY. \n\n\tThe European city: reinforced concrete, asphalt, steel, lights, shop \n\twindows, buildings, automobiles. A steady rhythm of efficiency, music, \n\tcordiality, an apéritif.\n \n\t\t\t\tSPEAKER\n\t\t\"In order to avoid a fatal and bloody \n\t\tconflict, we propose an honorable program \n\t\tof discussion to the French authorities, \n\t\ton condition that they recognize the right \n\t\tof our people to self-government ...\"\n\n\tAnd the Algerians who work in the European city, the dockers, waiters, \n\tlaborers, street-cleaners, farm-hands, and gardeners.\n\n\t\t\t\tSPEAKER\n\t\t\"Algerians unite! Be ready for action! \n\t\tThe National Liberation Front calls you to \n\t\tstruggle.\" \n\n\tUnemployed, peddlers, beggars, shoeshine boys ...\n \n\n8\tSTREET CARD GAME. OUTSIDE. DAY.\n \n \tTwo hands are moving; one over the other, they criss-cross with \n\tincredible speed; at the same time, they are shifting three small \n\tpieces of wood which appear to be identical. The hand movements are \n\tmarked by a kind of Algerian CHANT.\n\n\tFrom time to time, the pieces of wood are overturned for a split second \n\tso that the other sides are visible. Robust hands, thick, unusually \n\tagile for their size. The hands of Ali la Pointe, younger then, twenty-\n\tfour years old.\n \n\tA European quarter of Algiers. Coming and going of people, automobile \n\ttraffic. On the sidewalk a small group of European and two Algerian \n\tboys.\n \n\tOther passersby stop to watch. The group crowds around the stand where \n\tAli la Pointe is playing his game.\n\n\tThe entranced eyes of all present are staring at the pieces of wood.\n\n\tAli's hands seem to move by themselves.\n \n\tHis glance, always a bit sullen, apparently distracted, indifferent, \n\tpasses from one face to another, and then to the street, from one side \n\tto another.\n \n\tAt fifty yards, a policeman. Two Europeans, a man and a woman, are \n\tspeaking to him in an excited manner, and nudging him along pointing to \n\tAli.\n \n\t\t\t\tWOMAN\n\t\tLook! Yes, that's him!\n  \n \tAli is no longer singing. His hands have stopped moving. \n\n\tA POLICE SIREN IS HEARD.\n\n\tAli pushes his way through the crowd. \n\n\tHe breaks into a run.\n \n\tThe policeman also begins to run.\n \n\n9\tSTREET. ALI'S FLIGHT. OUTSIDE. DAY.\n \n\tThe street is sloping. Ali flees, pursued by the policeman. He dodges \n\tpassersby with agility. He gains ground. But nearby are heard ... \n\n\tSIRENS \n\n\tand also in front of him.\n\n\tAnother two policemen; they too are running. \n\n\tThere is an intersection. At the corner, a cafe. \n\n\tGAY MUSIC.\n\n\tYoung Europeans leaning against a shop window stop chattering and look.\n\n\tAli reaches the corner, crosses the street, passes by the bar. \n\n\tThere is a blond youth, about eighteen, who seems to be a student who \n\tstretches out his foot, and pushes a chair in front of him.\n\n\tAli stumbles and falls.\n \n\tThe youth attempts a laugh, and at the same time moves backward.\n\n\tAli is lying face downward, but suddenly turns his head toward the \n\tyouth and stares at him. Then lifting himself by his arms, he turns to \n\tlook back. \n\n\tThe police are now twenty yards away.\n\n\tAli gets to his feet. For a split second, he hesitates. He hurls \n\thimself against the youth, headfirst.\n\n\tUsing his head, Ali rams into the youth's face, striking him in the \n\tnose and splurting blood everywhere.\n \n\tThe youth is unable to shout. He opens his mouth in the attempt, but \n\tthe only result is a gurgling sound and blood. His friends intervene. \n\tAli is surrounded. The police arrive. A mass of people jump on Ali, \n\tkicking him and striking him with their fists as long as they please. \n\tFinally the police aid Ali and disperse the crowd.\n\n\tAli is now in handcuffs and being led away.\n\n\tMore people have arrived. They are yelling, shouting insults, and \n\tspitting on Ali.\n \n\tAli passes in their midst protected by the police. He pays no heed to \n\tthe fist blows, the shouts, the spits, but seems neither to see nor \n\thear, as if he were already resigned to having lost the battle this \n\ttime, and were preparing to wait patiently for a better chance.\n\n\tHe is walking with an unfaltering step. His face is emotionless, oval, \n\tswarthy. His hair black and wavy, his forehead low and wide; his eyes \n\tlarge and slanted with eyelids somewhat lowered, his mouth firm and \n\tproud.\n\n\t\t\t\tSPEAKER\n\t\tOmar Ali, known as \"Ali la Pointe\" born \n\t\tin Miliana, March 1, 1930. Education: \n\t\tIlliterate. Occupation: Manual laborer, \n\t\tfarm hand, boxer, presently unemployed.\n\t\tFormer convictions: 1942 -- Oran Juvenile \n\t\tCourt, one year of reformatory school for \n\t\tacts of vandalism. 1944 -- Two years of \n\t\treformatory school for theft. 1949 -- \n\t\tCourt of Algiers, eight months for \n\t\tcompulsory prostitution and resisting \n\t\tarrest. Habitual offender.\n \n\n10\tPARIS 1955. OUTSIDE. DAY. \n\n\tThe air is clear and springlike. A 4CV Citroen delivery van is parked \n\tin front of the Minister of the Interior warehouses. The rear door is \n\topen, the motor is running, a policeman is at the wheel. Two workers in \n\toveralls exit from the warehouses.\n\n\tEach one is carrying a box, and places it inside the van. The boxes are \n\tmade of seasoned wood, both of them rectangular. They are each about \n\teight inches long; one and two yards high respectively. The two workers \n\tsit down inside the van, toward the rear. They are facing toward the \n\texterior. Their feet are dangling and almost touch the ground.\n\n\tThe jolting movement of the van in motion causes them to laugh.\n\n\tSTREETS OF PARIS. Spring. Girls with lightweight clinging dresses. The \n\ttwo workers call them, whistle, gesture, and then move off in the \n\tdistance.\n \n\tORLY AIRPORT. The van stops in front of a warehouse. The two workers \n\tjump to the ground, place the boxes on their shoulders, and enter the \n\twarehouse.\n \n\tThe boxes are moving on a mobile ramp. There is a large label on each \n\tone which says: REPUBLIC OF FRANCE. MINISTER OF THE INTERIOR. \n\tDESTINATION: BARBEROUSSE PRISON. ALGIERS.\n \n\n11\tALGIERS. BARBEROUSSE PRISON. OUTSIDE. MORNING.\n \n\tBarberousse prison is situated on the outskirts of the Upper Casbah. It \n\tis an ancient fortress with thick, high surrounding walls, which appear \n\tto vanish in contrast with the central building which dominates them. \n\tThe whole structure is covered with limestone like the other houses of \n\tthe Casbah. Only the bars on the windows and the big gate are black. \n\n\tThe gate opens. A covered jeep enters the prison courtyard. In the \n\tstronghold of the jeep are the two boxes sent from Paris. \n\n\tEarly morning. The sky is pale blue. In the prison courtyard, the \n\tworkers open the two chests and assemble the guillotine. It is possible \n\tto see it from the cell windows that face the courtyard. Faces of \n\tprisoners appear between the bars of some windows.\n \n\tThe workers have disappeared. Only the delicate, makeshift structure of \n\tthe guillotine is visible, its slender outline lengthened.\n \n\n12\tPRISON CELL. INSIDE. MORNING.\n \n\tIn one of the cells there are about twenty prisoners. The cell is huge; \n\tthere are two very high windows that almost reach the ceiling.\n \n\tA prisoner is standing on the urine bucket, and looks outside through \n\tthe barred window. On the ground there are some mats which serve as \n\tbeds. Nothing else.\n \n\tAbout ten prisoners are in a group, seated on the ground, and they are \n\tspeaking in whispers. \n\n\tAD LIB DIALOGUE IN LOWERED VOICES.\n \n\tTwo of them are playing with some stones on a chessboard drawn in the \n\tdirt; others are speaking among themselves. One is reading a Mickey \n\tMouse comic book and laughing to himself. But all of them, in \n\tappearance and behavior, are distinguished from those who make up the \n\tmore numerous group. These solitary men are different in some way, they \n\tare not ordinary delinquents.\n\n\tAli la Pointe is alone, withdrawn from the others, seated on the \n\tground, his shoulders propped against the wall, his knees raised. He is \n\tbarefoot. On his left ankle, directly above his foot, are tattooed two \n\twords in print: TAIS-TOI. His shirt is unbuttoned and on his chest are \n\tother tattoos in a strange design.\n\n\tAli looks at the group and seems to listen to their murmured words \n\tabsent-mindedly. His expression is taciturn, reserved, and indifferent.\n\n\tAli turns to the prisoner at the window.\n \n\t\t\t\tPRISONER AT WINDOW\n\t\tLook at them!\n\n\tAli jumps to his feet. Everyone moves toward the two windows.\n \n \tAli moves away two yards at a quick pace, then runs toward the window, \n\tand grabbing hold of the bars, heaves himself up to it.\n\n\tThe condemned man turns and looks up toward the windows. He seems to \n\tsmile although his face is motionless. In a soft voice, he speaks to \n\tthose faces which appear behind the bars: \n\n\t\t\t\tCONDEMNED MAN\n\t\tTahia el Djez-air! [Long live Algeria!]\n\n\tThe political prisoners take up the phrase and recite it gutturally, \n\tkeeping time to the steps of the condemned man. \n\n\t\t\t\tPOLITICAL PRISONERS\n\t\tTahia el Djez-air!\n \n\n13 \tPRISON COURTYARD. OUTSIDE. MORNING.\n \n \tThe condemned man walks toward the guillotine accompanied by guards and \n\ta priest reading the Koran. There is also the executioner wearing a \n\tblack hood. The executioner tries to appear indifferent. The priest \n\trecites his prayers. The entire ceremony seems improvised and hasty. \n\tThe epilogue is reached quickly. \n\n\tPRAYERS.\n\n\tThe condemned man bends. The executioner places his neck in the right \n\tposition, adjusts it, turns his head a bit, then pushes his body \n\tforward. He releases the mechanism.\n \n\tThe blade falls, the head rolls. There is no longer a chorus. No one is \n\tchanting.\n \n\tAli's eyes have remained motionless.\n \n\tThen from above, as the dismembered body is being carried away in a \n\tbasket, as the priest, the guards, and the officer are leaving, as the \n\tworkers dismantle the guillotine, from above, from the balconies of the \n\tCasbah, suddenly the \"ju-jus\" of the women are heard, dense like the \n\tcries of birds, shrill, metallic, angry.\n \n\t\t\t\tWOMEN\n\t\tJu-ju ... \n \n \n14\tSMALL SQUARE. CASBAH. OUTSIDE. DAY. JANUARY 1956. \n\n\tIt is raining. The water runs along the gulleys of the narrow alleys. \n\tThe white houses have turned spongy gray. The children of the Casbah \n\tare playing and spattering mud. Skinny and half-naked children with \n\tbloated bellies and hair cropped because of sores.\n\n\tTheir mothers call them in vain. They continue to run, play, and wallow \n\tin the mud with a despairing gaiety. \n\n\tCALLS. VOICES. SHOUTS.\n \n\tPetit Omar was then ten years old. He is slender, dressed in long pants \n\tand a jacket which is too large for him and torn so that he seems \n\talmost clownish. Calm and absorbed, he passes in the midst of the other \n\tchildren, but doesn't notice them or their games.\n \n\tA small square on a sloping ascent.\n\n\tIn the center, a fountain. On the elevated side of the square, on a \n\tcorner, there is a mosque. \n\n\tSOUNDS OF CHURCH MUSIC.\n\n\tStanding still at the foot of the steps is an Algerian in white cloak, \n\tand hood down to his eyes. Other people pass by. The Algerian is turned \n\tto one side so as not to be seen. Petit Omar walks toward him and nears \n\this back. The Algerian turns; it is Ali la Pointe. He tells the boy \n\twith a tone of boredom and curtness:\n \n\t\t\t\tALI \n\t\tGo away!\n \n \t\t\t\tPETIT OMAR \n\t\tMen have two faces: one that laughs and \n\t\tone that cries ...\n \n\tAli looks at him incredulously and asks:\n \n\t\t\t\tALI \n\t\tAnd they sent you!\n \n\tThe child slips a hand under his sweater to his chest.\n \n\t\t\t\tPETIT OMAR \n\t\tSure, something wrong with that?\n \n\tOmar takes out a piece of paper folded in four, and hands it to Ali.\n \n\t\t\t\tPETIT OMAR \n\t\tTake it. Everything's written here. \n\n\tHe turns away and begins to run. \n\n\t\t\t\tALI \n\t\tWait!\n\n\tOmar stops running and turns to Ali.\n\n\t\t\t\tALI \n\t\tCome here ... Come.\n \n\tOmar retraces his footsteps. Ali goes to meet him. \n\n\t\t\t\tALI \n\t\t\t(in a brusque manner)\n\t\tCan you read? \n\n\t\t\t\tPETIT OMAR \n\t\tSure ...\n\n\tAli hands back the paper.\n \n \t\t\t\tALI \n\t\tRead it.\n \n \t\t\t\tPETIT OMAR \n\t\tHere?\n \n\tAli turns and looks around him. He squats on his heels in order to \n\treach Omar's height.\n \n \t\t\t\tALI \n\t\tHere.\n \n \tIt is still drizzling. Omar unfolds the paper and begins to read it.\n \n\n15 \tRUE RANDOM. CAFE MEDJEBRI. OUTSIDE/INSIDE. DAY.\n \n\tThe following day at 5 p.m., rue Random. The street is fairly wide for \n\ta street in the Arab quarter and at this hour it is crowded with \n\tpeople. There are Algerians in traditional costumes and others in \n\tEuropean clothes. Noisy and tumultuous background ...\n \n\tVOICES, SOUNDS, WORDS -- ALL MIXED TOGETHER. \n\n\tVeiled women with intent glances. Silent women who seem to float \n\tthrough the crowds, untouchable.\n\n\tAn Arab cafe filled with customers at the tables and bar. Through the \n\tlarge shop window, a smoky, steamy interior is visible. The cafe is \n\tlocated in rue Random, number 40.\n \n\t\t\t\tOMAR \n\t\t\t(off)\n\t\tThere is an Arab cafe at rue Random 40. \n\t\tThe owner's name is Medjebri. He is a \n\t\tpolice informer ...\n \n \tMedjebri is standing behind the cash register, smiling, very busy. He \n\tis wearing a traditional costume. He is very clearly visible through \n\tthe shop window above the heads of the customers.\n \n\tIn a doorway near the cafe there is a clock hanging from a signboard in \n\tfront of a store. It is five o'clock. A French policeman enters the \n\tcafe.\n \n \t\t\t\tOMAR \n\t\t\t(off) \n\t\tEvery day at 5 p.m., a French policeman \n\t\tgoes to see him. He stops for a few \n\t\tminutes to get information with the \n\t\texcuse of drinking a cup of tea. You have \n\t\tto kill the policeman ...\n \n\t\t\t\tALI \n\t\t\t(off) \n\t\tNot Medjebri?\n \n \tMedjebri moves away from the register, still standing behind the bar, \n\tto where the policeman is seated. He greets him, and hands him a cup of \n\ttea.\n \n \t\t\t\tOMAR \n\t\t\t(off)\n\t\tNo. It says the policeman.\n \n \tThe policeman is leaning on the bar. He is tall and husky, and is \n\twearing a scruffy uniform with a kepi pushed back somewhat. Now his \n\tthick lips are sipping the scalding mint tea.\n\n\t\t\t\tALI\n\t\t\t(off)\n\t\tOkay ...\n \n\tThe large clock and store signboard. Standing in front, there is a \n\tslender girl, veiled, her eyes darting in contrast with the rigid form \n\tof her motionless body. Her arms are raised to form an arch, her hands \n\tsupporting the edges of a large basket balanced on her head.\n \n\t\t\t\tOMAR \n\t\t\t(off) \n\t\tAt the corner, right in front of the \n\t\tlarge clock, there will be a girl \n\t\tcarrying a basket. When the policeman \n\t\tcomes out, you will follow him together. \n\t\tAt the right moment she will give you a \n\t\tpistol. You have only to shoot ... \n\t\tquickly and in the back. \n\n\tNow the policeman has finished drinking his tea. He makes a sign to \n\tpay. Smiling, Medjebri refuses the money, and says good-bye.\n\n\tAli approaches the girl. They exchange glances. The girl puts down her \n\tbasket which is filled with corn, and rests it by her side.\n\n\tShe moves slowly toward the cafe. Ali walks beside her.\n \n\tThe policeman is coming out of the cafe. He rudely bumps into those who \n\tare entering.\n \n\tHe makes his way along the sidewalk, and moves further away, balancing \n\this heavy body at every step.\n \n\tAli and the girl are about a yard away from him. They follow him, \n\tpushed along with the many others who are crowded on the sidewalk.\n\n\tThen the girl plunges her hand into the corn. In a second, she places \n\tthe revolver in Ali's right hand.\n\n\tHe holds it under his cloak. The policeman's back is a hand's-bredth \n\taway. But Ali does not shoot. \n\n\tHe moves forward to pass by the policeman.\n \n\tAlarmed, the girl looks at him, and tries to hold him back. She shakes \n\ther head as if to speak. \n\n\tAli smiles at her. His eyes have a hard glint.\n\n\tHe moves a few steps past the policeman. Suddenly Ali turns, lifts his \n\tarm as if to push his way through, and then stretches out his hand with \n\tthe revolver aimed.\n \n\tThe policeman stops; his eyes are wide with fear. Instinctively he \n\tlifts his arms and opens his palms. \n\n\tTerror paralyzes him.\n \n\tAli glances about him. Many people are moving away hastily, but others \n\tstand still in a circle and watch fascinated. Ali speaks to all of \n\tthem, in a loud voice. His eyes are alight.\n \n \t\t\t\tALI \n\t\tDon't move! Look at him. You're not \n\t\tgiving any orders now! Your hands are up, \n\t\teh! Do you see him, brothers? Our masters \n\t\taren't very special, are they?\n \n\tA sharp, metallic click. Ali tries a second time, presses the trigger \n\tagain.\n \n\tSEVERAL CLICKS. REVOLVER EMPTY. \n\n\tAli rolls the gun barrel; it is empty.\n\n\tThe policeman slowly lowers his hands. His right hand rushes to his \n\tholster.\n \n\tAli is ready to jump, throws away the gun, and starts to move forward.\n\n\tHe knocks down the policeman, who is overwhelmed, and falls backward.\n \n\tThe crowd moves away quickly. Ali starts to throw himself on the \n\tFrenchman lying on the ground, but stops halfway. \n\n\tA thought restrains him. He turns and sees the girl who has picked up \n\tthe revolver and hidden it again in her basket. \n\n\tThen she moves away hurriedly.\n \n\tAli curses angrily, then, kicks the policeman's head twice, and runs \n\tafter the girl.\n\n\tHe reaches her, grabs her shoulder so roughly that she shouts.\n \n\t\t\t\tALI \n\t\t\t(in a whisper) \n\t\tBastard! ... Bitch!\n \n\tThe girl struggles free from his grip. At the same time, they hear \n\tbehind them ...\n \n \tPOLICE WHISTLES.\n \n\tThe girl quickens her step.\n \n\n16 \tSIDE ALLEY WITH FRONT DOOR. OUTSIDE/INSIDE. SUNSET. \n\n\tThe girl arrives at a side street, enters it, and breaks into a run.\n\n\tAli is again beside her, but unexpectedly the girl enters a front door.\n\n\tShe bends, places the basket on the ground, removes the revolver, and \n\thides it in her breast beneath her shawl. She gets up again, and leaves \n\tthe basket. Ali blocks her way.\n \n\t\t\t\tALI \n\t\tTell me what this joke is all about.\n      \n\tThe girl attempts to push past him toward the door.\n \n\t\t\t\tDJAMILA \n\t\tLet's move now or they'll catch us.\n \n\tAli grabs her by the arm, shakes her, and shouts uncontrollably:\n\n\t\t\t\tALI \n\t\tI want to know who sent me that letter. \n\t\tWhat's his name? \n\n\t\t\t\tDJAMILA \n\t\tHe's waiting for you! \n\n\t\t\t\tALI \n\t\tWhere?\n \n\t\t\t\tDJAMILA \n\t\tWe're going there ... if you don't get us \n\t\tarrested first.\n\n\tThe girl nods toward the street where two policemen are passing by \n\thastily.\n \n\tAli moves backward into the shadow of the doorway. He regains control \n\tof his nerves, loosens his cloak, and lets it fall on the basket. He is \n\tdressed in European clothes, trousers and pullover.\n \n\t\t\t\tALI \n\t\t\t(pushing her ahead)\n\t\tMove ... go ahead. I'll follow you.\n \n\tThe girl takes a look outside, then goes out. Ali follows her a few \n\tsteps behind. By now it is dusk.\n \n\n17\tTERRACE. KADER'S HOUSE. OUTSIDE. NIGHT.\n \n\tIt is a starry night and there are few lights visible in the windows of \n\tthe Casbah. In the background, there is the triumphant neon of the \n\tEuropean city, the sea, the ships at anchor, the shining beams of a \n\tlighthouse. Kader turns around gracefully, and goes to sit on the wall \n\tof the terrace. \n\n\t\t\t\tKADER \n\t\tYou could have been a spy. We had to put \n\t\tyou to the test.\n \n\tAli looks at him sullenly. \n\n\t\t\t\tALI \n\t\tWith an unloaded pistol?\n \n \t\t\t\tKADER \n\t\tI'll explain.\n \n\tKader is a few years older than Ali, but not so tall. He is slender \n\twith a slight yet sturdy bone structure. The shape of his face is \n\ttriangular, aristocratic, his lips thin, his eyes burning with hatred, \n\tbut at the same time, cunning. He continues to speak in a calm tone \n\twhich has an ironic touch to it.\n \n\t\t\t\tKADER \n\t\tLet's suppose you were a spy. In prison, \n\t\twhen the NLF contacts you, you pretend to \n\t\tsupport the revolution, and then the \n\t\tFrench help you to escape ...\n\n\t\t\t\tALI \n\t\tSure. By shooting at me.\n\n\t\t\t\tKADER \n\t\tEven that could be a trick. You escape, \n\t\tthen show up at the address which the \n\t\tbrothers in prison gave to you, and so \n\t\tyou are able to contact me ...\n \n\t\t\t\tALI\n\t\tI don't even know your name yet ...\n \n\t\t\t\tKADER \n\t\tMy name is Kader, Ali ... Saari Kader ... \n\t\tIn other words, in order to join the \n\t\torganization, you had to undergo a test. \n\t\tI could have told you to murder the \n\t\tbarman, but he's an Algerian ... and the \n\t\tpolice would let you kill him, even \n\t\tthough he is one of theirs. By obeying \n\t\tsuch an order, you still could have \n\t\tbeen a double agent. And that's why I \n\t\ttold you to kill the French policeman: \n\t\tbecause the French wouldn't have let \n\t\tyou do it. If you were with the police \n\t\tyou wouldn't have done it.\n \n\tAli has followed Kader's logic a bit laboriously, and he is fascinated \n\tby it. But not everything is clear yet. \n\n\t\t\t\tALI \n\t\tBut I haven't shot him.\n \n \t\t\t\tKADER \n\t\t\t(smiling)\n\t\tYou weren't able to. But what's important \n\t\tis that you tried.\n \n\t\t\t\tALI \n\t\tWhat's important for me is that you let me \n\t\trisk my life for nothing.\n \n \t\t\t\tKADER \n\t\tC'mon ... you're exaggerating. The orders \n\t\twere to shoot him in the back.\n \n\t\t\t\tALI \n\t\tI don't do that kind of thing. \n\n\t\t\t\tKADER \n\t\tThen don't complain.\n \n\t\t\t\tALI \n\t\tYou still haven't told me why you didn't \n\t\tlet me kill him.\n \n\t\t\t\tKADER \n\t\tBecause we aren't ready yet for the \n\t\tFrench. Before attacking, we must have \n\t\tsafe places from which to depart and find \n\t\trefuge. Of course, there is the Casbah. \n\t\tBut even the Casbah isn't safe yet. There \n\t\tare too many drunks, pushers, whores, \n\t\taddicts, spies ... people who talk too \n\t\tmuch ... people who are ready to sell \n\t\tthemselves, undecided people. We must \n\t\teither convince them or eliminate them. \n\t\tWe must think of ourselves first. We must \n\t\tclean out the Casbah first. Only then \n\t\twill we be able to deal with the French. \n\t\tDo you understand, Ali? \n\n\tAli doesn't answer.\n \n\tKader has come down from the wall and looks toward the Casbah. Ali too \n\tlooks toward the Casbah, immersed in the night.\n \n\t\t\t\tALI \n\t\tAnd how many are we? \n\n\t\t\t\tKADER \n\t\tNot enough.\n \n\n18 \tAREAS OF CASBAH UNDERWORLD. OUTSIDE/INSIDE. DAY. MARCH 1956.\n \n\tA warm spring wind, large white clouds. At the western edge of the \n\tCasbah, from the Upper to Lower Casbah, the street of the Algerian \n\tunderworld descends to the brothel quarter.\n \n\t\t\t\tSPEAKER\n\t\t\"National Liberation Front, bulletin \n\t\tnumber 24. Brothers of the Casbah! The \n\t\tcolonial administration is responsible not \n\t\tonly for our people's great misery, but \n\t\talso for the degrading vices of many of \n\t\tour brothers who have forgotten their own \n\t\tdignity ...\"\n \n\tShady bars for gamblers and opium smokers, shops filled with tourist \n\ttrinkets, merchants, fences, pimps, children with adult faces, ghastly \n\told women, and young girls, whores standing in the doorways of their \n\thouses.  The girls having their faces uncovered have put scarves on \n\ttheir heads, knotted at the nape.\n \n \t\t\t\tSPEAKER\n\t\t\"Corruption and brutality have always \n\t\tbeen the most dangerous weapons of \n\t\tcolonialism. The National Liberation \n\t\tFront calls all the people to struggle \n\t\tfor their own physical and moral \n\t\tredemption -- indispensable conditions \n\t\tfor the reconquest of independence. \n\t\tTherefore beginning today, the \n\t\tclandestine authority of the NLF \n\t\tprohibits the following activities: \n\t\tgambling, the sale and usage of all types \n\t\tof drugs, the sale and usage of alcoholic \n\t\tbeverages, prostitution and its \n\t\tsolicitation. Transgressors will be \n\t\tpunished. Habitual transgressors will be \n\t\tpunished by death.\"\n \n\n19\tBAR. EUROPEAN CITY FACING CASBAH. OUTSIDE/INSIDE. SUNSET.\n \n\tIt is dusk. In the European city, the first lights are visible. People \n\tbegin to crowd the bars for an apéritif.\n\n\tAn Algerian shoeshine man leaves his workbox at the entrance of the \n\tbar. He goes to the counter. He is tall and thin as a reed. He takes \n\tfrom his pocket a handful of change; his hands tremble slightly as he \n\tcounts it.\n \n\tThe barman recognizes him, fills a glass of wine, and places it in \n\tfront of him. The Algerian pays and takes the glass. It's probably not \n\this first; the trembling of his hands increases. The Algerian drinks \n\tthe wine in one gulp, then goes to the door. He waits patiently while \n\tsome Europeans enter. He goes out, picks up his workbox, and moves \n\taway.\n \n\n20 \tRUE MARENGO AND STEPS. OUTSIDE. SUNSET.\n \n\tThe Algerian is standing at the top of some steep, almost vertical \n\tsteps that lead from the European quarters to the Casbah.\n\n\tNow he is in rue Marengo. There is still some daylight. The street is \n\tcrowded. The Algerian is unsteady on his legs. He stops and mutters \n\tsomething to himself. It is obvious that he is trying to hide his \n\tdrunkenness.\n \n\tHe begins to walk, his hand against the wall for support. He stumbles.\n \n\tThe workbox falls, scattering brushes and cans of shoe polish on the \n\tground. The Algerian bends down, and begins to pick up his tools. He is \n\tswearing.\n \n\tOthers have seen him. A peddler points him out to a child of about ten. \n\tIt is Petit Omar, who nods yes, then whistles. \n\n\tAnother whistle answers him, then another and another. \n\n\tThere are other children, at every corner of the street. \n\n\tThey arrive in a run and gather together.\n\n\tOmar points to the drunk who is now moving away, and gives the order to \n\tattack. It is evident that this is not a game for them, but a duty.\n\n\tThere is a chorus of brief shouting, of insults, and whistles. \n\n\tThe drunk sees them approaching. He is terrified. \n\n\tHe tries to quicken his step.\n \n\tThey reach him quickly and surround him. They attack him and then flee, \n\tsmall yet elusive. They do not laugh even once; their faces are hard \n\tand cruel.\n \n\tThe drunk swings around holding his workbox by its strap. \n\n\tSome children are hit; some fall.\n \n\tThe drunk avails himself of this chance to escape, and retraces his \n\tsteps to the staircase.\n \n\tHe begins to descend toward the European quarters. But the children are \n\tagain upon him.\n \n\tThey are shouting more loudly now, and pushing him. He quickens his \n\tstep, and staggering jumps the steps two by two. \n\n\tThe children trip him and he falls.\n \n\tHe is crying. He shields himself with his hands. \n\n\tThe workbox has fallen and is rolling down the steps. The children are \n\tnow on top of him, like small beasts on a carrion. They smother him, \n\tpush him and pull him. They are no longer shouting.\n\n\tAll of them are intent upon their efforts. Only the drunk is shouting \n\tdespairingly.\n \n\tThey succeed in moving him, and hurl him down the steps. He rolls \n\tdownward, trying in vain to grab something with his hands.\n \n\n21\tBAR CASBAH. OUTSIDE/INSIDE. DAY.\n \n\tOutside the sun's light is blinding. Inside the small bar there is \n\tfresh air and shade.\n \n\tA young Algerian, with lifeless eyes and an idle expression, is rolling \n\tan opium cigarette. He lights it. Two slaps cause the cigarette to fall \n\tfrom his lips.\n\n\tAli la Pointe is wearing a djellabah, a type of cloak without buttoning \n\twhich slips on over the head. There is an opening of about eight inches\n \tat the waist.\n \n\tAli has stretched his arm through the opening to slap the opium addict, \n\twho recognizes Ali, smiles, and makes a dazed grimace.\n \n \t\t\t\tOPIUM-ADDICT\n\t\tAli la Pointe ...\n\n\t\t\t\tALI \n\t\tWake up! Have you seen Hacene le Bonois?\n \n\t\t\t\tOPIUM-ADDICT \n\t\t\t(shaking his head) \n\t\tNot today ...\n \n\tThen he gets up laboriously, bends down, and looks for the cigarette \n\tthat had fallen from his hand.\n\n\tHe doesn't reach it. Ali quickly crushes the cigarette with his foot. \n\tHe is wearing a pair of sneakers. He moves away and leaves the bar.\n \n\n22 \tSTREET BAR. CASBAH. OUTSIDE. DAY.\n \n \tAli continues to scour the streets. From time to time, without \n\tlingering, he asks someone:\n \n \t\t\t\tALI \n\t\tSeen Hacene le Bonois?\n \n \tThen adds:\n \n \t\t\t\tALI \n\t\tTell him I'm looking for him ...\n \n\n23 \tBROTHEL QUARTERS. OUTSIDE. DAY.\n \n \tOFF LIMITS \n\tEntrance to the brothel quarters. The street widens, the alleys branch \n\toff and seem to broaden. There are one or two Europeans, not only \n\ttourists in search of adventure, but also elements of the international \n\tcriminal underworld who mingle here with the Algerians.\n\n\tAlmost all the buildings house a brothel or other place of ill-repute. \n\tOn some doorways signs are hanging which read: \n\n\t\t\tTHIS IS AN HONEST HOUSE.\n \n\n24\tBROTHEL. INSIDE. DAY. \n\n\tAli has entered a brothel. It is morning and there are few clients. The \n\twhores are Algerian and European. Some of them are pretty.\n\n\tThe madam is an Algerian, dressed in European clothes. She is about \n\tforty, heavily made up. When she spots Ali, she interrupts her usual \n\tprofessional chant. She seems curious, yet glad.\n \n\t\t\t\tMADAM \n\t\t\t(shouting) \n\t\tAli la Pointe!\n \n \tShe stops herself, already sorry for having spoken so quickly and \n\timprudently. Ali doesn't answer her, but approaches with a steady and \n\tserious glance.\n \n \t\t\t\tMADAM \n\t\t\t(changing tone)\n\t\tHaven't seen you around for some time. I \n\t\tthought you were still in prison.\n \n\tAli leans against the counter, never once taking his eyes off her.\n\n\t\t\t\tALI \n\t\tIs Hacene le Bonois here?\n \n\t\t\t\tMADAM\n\t\tNo. He left early this morning. You know \n\t\thow it is with the boss ...\n\n\t\t\t\tALI \n\t\tI want to see him. If he shows up, tell \n\t\thim that I'm around. \n\n\tAli moves away from the counter and turns. He leaves without a word. \n\tThe woman tries to understand what has happened, and follows him with a \n\tworried glance.\n \n\n25\tSMALL STREET. HACENE. OUTSIDE. DAY.\n \n \t\t\t\tHACENE \n\t\tAli, my son ... Where have you been \n\t\thiding? \n\n\tAli turns suddenly, then pulls back so that his back is against the \n\twall of the alley.\n \n\t\t\t\tALI \n\t\t\t(in sharp voice)\n\t\tDon't move! \n\n\tThen he glances at the others. \n\n\t\t\t\tALI \n\t\tHands still.\n \n\tThe others are three young Algerians, Hacene's bodyguards. Hacene le \n\tBonois is tall with short legs out of proportion with his enormous \n\tchest. He is somewhat corpulent. He has a wide face, a cheerful and \n\tself-confident expression. His clothing is a strange combination of \n\tAlgerian and European which does not, however, appear ridiculous, but \n\timposing. At Ali's remark, his expression changes, becomes amazed and \n\tbaffled. But at the same time, his eyes give away the brain's attempt \n\tto find an explanation and a solution.\n \n \t\t\t\tHACENE \n\t\t\t(astonished)\n\t\tYou know I never carry weapons ...\n\n\tAli keeps his arms and hands hidden under his djellabah.\n \n\t\t\t\tALI \n\t\tI know.\n \n\tHacene laughs warmly, and stretches out his hands which are enormous, \n\tthick and rough.\n \n \t\t\t\tHACENE \n\t\tYou afraid of these ...?\n \n \t\t\t\tALI \n\t\tDon't move, Hacene.\n\n\t\t\t\tHACENE \n\t\tWhy are you afraid? We've always been \n\t\tfriends. One might even say that I brought \n\t\tyou up ... Isn't it true, Ali? \n\n\t\t\t\tALI \n\t\tIt's true.\n \n \t\t\t\tHACENE \n\t\tWhat's happened to you? \n\n\t\t\t\tALI \n\t\tThe NLF has condemned you to death.\n\n\tHacene is stunned. He speaks aloud his thoughts in a soft voice.\n \n\t\t\t\tHACENE \n\t\tAh, so its come to this ...\n \n\tThen he bursts into loud laughter, and seems to turn to the three \n\tguards at his back.\n \n\t\t\t\tHACENE \n\t\tI'm dying of laughter! Ha ... ha ... \n\t\tha ...\n \n \tAli doesn't speak. He continues to stare at Hacene. Hacene suddenly \n\tstops laughing. His tone of voice changes, becomes brusque and hurried.\n \n\t\t\t\tHACENE \n\t\tHow much are they paying you?\n\n\t\t\t\tALI \n\t\tThey're not paying me anything. They've \n\t\talready warned you twice; this is the \n\t\tlast warning. Decide. \n\n\t\t\t\tHACENE \n\t\tWhat ... What must I decide?\n \n \t\t\t\tALI \n\t\tYou've got to change occupations, Hacene. \n\t\tRight away! \n\n\tHacene makes a gesture as if to emphasize what he is going to say.\n \n\t\t\t\tHACENE \n\t\t\t(with irony) \n\t\tOkay, you convince me.\n \n \tThen suddenly, unexpectedly, he lets out a SHRILL SCREAM, like fencers \n\twho before plunging their swords, try to frighten their adversaries.\n \n\tSimultaneously, he hurls himself forward, head lowered and arms \n\toutstretched.\n\n\tAli steps aside, and releases a BLAST OF MACHINE-GUN FIRE.\n\n\tHacene falls flat on his face. There is movement. Some passersby \n\tapproach. The three boys try to escape.\n \n\t\t\t\tALI \n\t\t\t(shouting)\n\t\tStop!\n \n\tThe barrel of the machine gun is visible through the opening in his \n\tdjellabah. Ali's voice is quivering angrily:\n \n \t\t\t\tALI \n\t\tLook at him well! Now nobody can do \n\t\twhatever he wants in the Casbah. Not even \n\t\tHacene ... least of all you three pieces \n\t\tof shit! Go away now ... go away and \n\t\tspread the word ... Go on!\n\n\n26\tWEDDING. OUTSIDE. DAY.\n \n\tSummer. There is a garland of flowers strung across an alley. A front \n\tdoor is open, and the guests continue to arrive.\n \n\n27\tWEDDING HOUSE. OUTSIDE. DAY.\n \n \tIn the inner courtyard, there are benches and chairs arranged in rows. \n\tIn front of all of them, there are two chairs separated from the rest, \n\tone next to the other. In front of them, there is a small table with a \n\tpen and inkstand on top. The people remain standing, about twenty \n\tAlgerians, of all ages. They are speaking among themselves in thick \n\twhispers. There is an expectant and ceremonious atmosphere. \n\n\tBUZZING.\n\n\tMahmoud was seventeen then. He has soft down on his cheeks, his first \n\tbeard. He is thin, his neck long and tense, his glance nervous. He \n\tappears to be the protagonist of what is about to take place. His hair \n\tis combed with care and covered with much hair cream. He is wearing a \n\tclean and newly bought white costume.\n\n\tMany of the others come to speak with him; the younger ones are joking \n\tand trying to provoke him. \n\n\tAD LIB REMARKS.\n \n\tMahmoud reacts comically with a grim frown with which he tries in vain \n\tto hide his shyness. At the same time, he glances secretly, anxiously, \n\tup to the empty balcony on the first floor. Much gay and lively \n\tchattering can be heard from an open door above.\n \n\n28\tWEDDING ROOM. INSIDE. DAY.\n \n \tIn the room, a group of girls are busy preparing trays with cups of \n\tcoffee. They are little more than children, twelve or thirteen years \n\told, with soft complexions, white teeth, and shining eyes. They seem\n\tchildren who are playing, but beneath that veneer of gaiety, some \n\tanxiety is noticeable, emotions in suspense. The faltering voice of an \n\told woman calls from the adjoining room.\n\n\tA girl leaves the group, lifts the dividing curtain, and nearing the \n\tbed where the old woman is lying, she kneels beside her. The old woman \n\tlifts her hand and places it on the girl's hair, caressing her \n\ttenderly. She speaks in a wavering voice, and her small yet kind eyes \n\tfill with tears. \n\n\tOLD WOMAN'S SPEECH IN ARABIC.\n\n\tThe girl nods yes, then she gets up and goes to rejoin her companions. \n\tPassing before a mirror, she stops a minute to tidy her hair.\n \n\n29\tWEDDING HOUSE. OUTSIDE. DAY.\n \n\tThey appear on the balcony, then descend to the courtyard. The nervous \n\tglance of Mahmoud scans their faces, then rests upon that girl who, \n\twith lowered eyelids, also glances quickly at him. Meanwhile the trays \n\tare being passed among the guests.\n\n\tNow the people turn to face the front door. A young man has entered \n\tcarrying a briefcase under his arm. Behind him are two boys who seem to \n\tbe his bodyguards, and are the only ones dressed in European clothes. \n\tBoth of them have their right hands under their jackets, which are old \n\tand torn. They seem to be armed. They close the door, and remain \n\tstanding on either side of it.\n\n\tThe man with the briefcase walks toward the table. All present look at \n\thim respectfully. He smiles, responds to their greetings, shakes hands \n\twith all. But he refuses coffee and seems to be in a hurry.\n\n\tHe sits down, places his briefcase on the table, opens it, and takes \n\tout a large notebook. From the open briefcase, the metallic butt of a \n\tsub-machine gun appears.\n\n\tOn the cover of the notebook is written: NLF -- ALGERIAN  AUTONOMOUS \n\tZONE. CIVIL RECORDS.\n \n\tHe turns the pages of the notebook until he reaches the last written \n\tpage. Then he glances up toward the people who, in the meantime, have \n\ttaken their seats. He smiles, says a few words, then calls two names.\n \n\tMahmoud walks forward stiffly, erect, his eyes staring straight ahead \n\tof him.\n \n\tThe girl also walks forward, with a perplexed expression. They sit down \n\tnext to each other, but without looking at each other. The ceremony \n\tconsists of a few words. Finally the two youths look at each other. \n\tMahmoud tries to smile, but he cannot.\n \n\tThe girl's expression softens somewhat. Her glance is tender; she \n\tlowers her face quickly. Meanwhile the others recite the verses of the \n\tKoran in low voices. \n\n\tCHORUS.\n \n\n30\tRUE D'ISLY. OUTSIDE. DAY. JUNE 20, 1956. 8:05 A.M.\n \n\tThere is a French guard, no more than thirty years old. He has a blond \n\tmustache, his beard recently shaved. There are few people in the \n\tstreet. The guard walks slowly, glancing in the shop windows from time \n\tto time to admire his reflection. He stops, adjusts his cap, and \n\tsmiles.\n \n\tAn Algerian appears beside him; he is also young. The guard pretends to \n\tbe interested in the photographic equipment which is on display, then\n\tmoves on.\n \n\tThe Algerian's arm springs forward and returns quickly to its place. He \n\tplunges the knife into the guard's neck.\n \n\tThe guard opens his mouth wide to shout, but he cannot. The blood \n\tgurgles in his gashed throat. None of the few passersby has seen what \n\thappened. The guard falls flat on his face. Someone sees him and \n\tscreams.\n \n\tThe Algerian hurls himself on top of the soldier, opens his holster, \n\ttakes his pistol, then gets up pulling the gun with him. The gun is \n\tfastened by a leather cord. The cord gets tangled in the gashed neck of \n\tthe guard.\n\n\tThe Algerian pulls in vain. He panics. He looks about him with \n\tterrified eyes.\n \n\tPeople approach hurriedly. They are shouting. The Algerian pulls the \n\tcord a second time, desperately.\n\n\tHe regains his control, picks up the knife which is lying on the \n\tground, and cuts the leather cord, thus freeing the pistol. The others \n\thave almost reached him and he is surrounded, but he manages to dodge \n\tthem, and escapes.\n \n\n31\tBOULEVARD BRU. OUTSIDE. DAY. 8:40 A.M.\n \n\tA group of zouaves on patrol, three soldiers and an officer. The street \n\tis sloping; on the right there is a high fence covered with advertising \n\tsigns and cinematographic posters, all of them torn and full of holes; \n\tthe emptiness on the other side is visible through the holes.\n\n\tThe soldiers are chatting among themselves and looking at the posters.\n\n\tA soldier stops because he sees something moving on the other side of \n\tthe fence.\n \n\tHe points to it and shouts, but not in time. \n\n\tMACHINE-GUN FIRE INTERRUPTED BY SINGLE SHOTS. \n\n\tThe soldier falls, the others remain motionless, unbelieving. They \n\tbegin to run and scatter and look for cover. \n\n\tAn Algerian appears on top of the fence. He moves like a cat, and jumps \n\tfrom the other side.\n \n\tHis invisible companions continue to shoot. He is unarmed, and runs to \n\tthe dead soldier. He grabs the machine gun and retraces his steps. The \n\taction takes place in a second. \n\n\tBy now the soldiers too are shooting, but it is too late.\n \n\n32\tPOLICE STATION. CHEMIN AIN-ZEBOUDJA. OUTSIDE/INSIDE. DAY. 9:10 A.M.\n \n\tA police station in the Casbah, a small prefabricated one-story\n\tbuilding.\n \n\tAt the main door there is a police guard. A group of five Algerians is \n\tapproaching. They are talking among themselves, and gesticulating.\n\n\tBUZZING.\n \n\tThe policeman enjoys watching them, then asks what it's about. All five \n\tof them answer him at once, trying to outdo one another.\n\n\tThe policeman has to shout to make them keep quiet. Then, assuming a \n\tvery humble behavior, they enter silently. The oldest among them speaks \n\tin a mournful voice. He seems to be crying and asks the sergeant \n\tsomething.\n \n\tThe policeman calls a colleague, and tells him to accompany the \n\tAlgerians. Four of them go with the policeman, while another remains in\n \tthe waiting room, saying that it is better because he is afraid of \n\tlosing his control.\n \n\tThen he begins to explain the reasons for the quarrel: it concerns a \n\twill. The old man is his grandfather, but he has recently remarried. \n\tThen from inside is heard ...\n \n\tMACHINE-GUN FIRE.\n \n\tThe policeman reacts quickly and tries to draw his gun. But the \n\tAlgerian is faster and fires point-blank.\n\n\tThe four reappear. One of them is wounded. All of them are armed with \n\trevolvers, and carry at their sides a machine gun and two sub-machine \n\tguns that they have taken from the armory. Other cries and shots are \n\theard behind them. \n\n\tAll five of them run out in haste.\n \n\n33\tRUE MARENGO. OUTSIDE. DAY. 9:45 A.M.\n \n\tAnother police station. Two policemen are chatting in front of the \n\tentrance.\n \n\tA black Renault is passing by at a walking speed, then slows down \n\talmost to the point of halting completely.\n \n\tThe right door opens and there is a burst of machine-gun fire. One of \n\tthe policemen has been, hit, and grabs the other so as not to fall.\n\n\tAnother burst of ...\n \n\tMACHINE-GUN FIRE.\n \n\tThe two policemen fall down together. The car motor is accelerated, the \n\ttires screech and the Renault shoots forward.\n \n\tA military jeep arrives from the opposite direction, crashes into the \n\tcar and blocks its escape.\n \n\tAn Algerian flees and is pursued. Another descends from the auto with \n\this hands raised. \n\n\tThe soldiers shoot and kill him.\n\n\n34\tAVENUE DU 8 NOVEMBRE. OUTSIDE. DAY. 1:10 P.M.\n \n\tA large garage with workshop and filling station. In front are some \n\tautomobiles and a military truck.\n\n\tA scooter with two Algerian boys passes by, rumbling noisily along the \n\troad. Then at full speed, it makes a sharp turn, retraces its steps and \n\tturns again. The boys seem to be showing off for fun.\n\n\tMeanwhile, the employees of the garage are leaving their work since it \n\tis lunchtime. The attendant at the gasoline pumps is left alone.\n\n\tThe scooter stops in front of the high-test gasoline pump. The attendant \n\tis a European, an elderly man, who approaches them holding in one hand \n\tsome bread he has just unwrapped. He detaches the pump handle of high-\n\ttest, and asks how many gallons.\n\n\tOne of the Algerians points a revolver at the attendant, and tells him \n\tto pour out the gasoline on the ground all around. The other, \n\tmeanwhile, goes to the other two gasoline pumps, detaches the handles, \n\tand fastens them in an open position in order to empty them of\n\tgasoline. He uses two pieces of iron that he has brought with him to \n\tclamp the handles open. He stretches the pump hoses as far as they can \n\tgo toward the garage and the parked cars.\n \n\tThe gasoline flows all over the large square. The two youths are again \n\ton the scooter; they tell the European to move away. They have soaked a \n\trag in gasoline and they light it. \n\n\tThe gasoline continues to flow from the two open pumps. The European is \n\tby now far away, the scooter is already moving away, and at the same \n\ttime, the boys hurl the lit rag into the square. It immediately bursts \n\tinto flames.\n \n\n35\tCOMMISSIONER's OFFICE. INSIDE. NIGHT. \n\n\tThe night of the same day, in an office of the police commissioner's \n\theadquarters. On the desk, photos of the day's terroristic attempts are \n\tpiled in a heap. An employee is in front of his typewriter.\n\n\tThe Assistant Commissioner is about forty years old, very robust. His \n\tface is somewhat wide, ordinary, and with heavy features. He leafs \n\tthrough the photos while speaking on the telephone. It is a very warm \n\tnight, and the window of the office is open. From outside is heard \n\tthe SOUND OF TRAFFIC.\n \n \t\t\t\tASSISTANT COMMISSIONER \n\t\t\t(on telephone) \n\t\tYes, sir, but they haven't received a \n\t\tsearch-warrant yet. Rue d'Isly? We \n\t\tfollowed them for a while, but then we \n\t\tlost track ... Yes, sir, but it is in \n\t\tanother precinct. No, it wasn't in \n\t\ttheirs ... There are some suspects for \n\t\true Marengo ... No ... the judge hasn't \n\t\tgiven permission yet. He is requesting a \n\t\tformal investigation first. Yes, sir, \n\t\tyes ... Yes, sir, yes -- But we haven't \n\t\tenough men. Of course, I understand ...\n\t\tIf it were possible, sir, you should ... \n\t\tbut the Commissioner can't ... in ... But \n\t\tcouldn't you ... Alright, sir ...  We'll \n\t\tlet them cut our throats then!\n \n \tHe slams the receiver angrily and begins to dictate his report. His \n\tvoice is harsh, filled with rancor.\n \n\t\t\t\tASSISTANT COMMISSIONER\n\t\tTime: 3 P.M. Attempt at homicide against a \n\t\tPatrol of the 3rd B.P.C. Place: Luciani \n\t\tstreet at El Biar. Weapon: Revolver 7.75.\n\t\tVictim: A soldier wounded in the right leg \n\t\tand groin. Hospitalized. Assailants: \n\t\tUnknown. ... Time: 3:35 P.M. Homicide. \n\t\tPlace: Chopin Street, opposite number 20. \n\t\tWeapon: P.M. 38. Victim: Private \n\t\tsecond-class Dare Jackie, born March 12, \n\t\t1931. Deceased. Assailant: A moslem.\n\t\tHeight: five feet and seven/eights \n\t\tinches. Light colored clothing. Probably \n\t\tescaped in Simca. License plates unknown.\n \t\tTime: Four minutes past 4 P.M. Homicide \n\t\tand attempt at homicide against patrol of \n\t\tborder guards. Place: Intersection between \n\t\tConsular Street and General Laquiere ...\n\t\tWait a minute ...\n \n\tThe officer stops speaking, takes a glass from his desk, and goes near \n\tthe window. On the ledge, there is a bottle of beer, left there \n\tevidently to keep it a bit cool. He takes it, fills his glass and \n\tdrinks.\n\n\tThen he speaks in a lowered voice, while looking outside, without even \n\tgiving any directions to the employee who waits with his hands poised \n\tabout the keyboard of his typewriter.\n \n\t\t\t\tASSISTANT COMMISSIONER\n\t\tI want to see the newspapers tomorrow. If \n\t\tthey're still talking about pacification \n\t\tof our Moslem brothers!\n \n\tHe returns to his desk.\n \n\t\t\t\tASSISTANT COMMISSIONER\n\t\tWhere were we?\n\n\t\t\t\tEMPLOYEE\n\t\tIntersection, between Consular Street and \n\t\tGeneral Laquiere Avenue ...\n \n\n36\tVARIED FLASHES. POLICE STATIONS. OUTSIDE. DAY.\n \n\tIn front of police stations: Ain-Zeboudja ... rue Marengo ... and all \n\tthe others ... in the Casbah ... in the European quarters ... sandbag \n\tentrenchments are being prepared, barbed wire is being stretched, \n\tmetallic lookout turrets are being set up. It is very hot. Workers and \n\tpolicemen work in silence. There is an oppressive atmosphere.\n \n\t\t\t\tSPEAKER\n\t\t\"Ordinance of the Prefecture of Algiers: \n\t\tAll police stations in Algiers, without \n\t\texception and until further notice, are \n\t\trequired to prepare and maintain external \n\t\tprotection devices. The shifting of guards \n\t\toutside must continue uninterrupted \n\t\ttwenty-four hours a day. Sentinels must \n\t\tbe equipped with automatic weapons ...\"\n \n\n37\tEUROPEAN AND CASBAH PHARMACIES. MUSTAPHA HOSPITAL. OUTSIDE/INSIDE. DAY.\n\n\tView of pharmacies in the European quarters and in the Casbah.\n\n \tThe shelves, medicines; people who are buying. The Mustapha hospital, \n\treserved for Algerians. The wards: hospitalized Algerians.\n\n\t\t\t\tSPEAKER\n\t\t\"The Governor-General of Algiers decrees: \n\t\tArticle No. 1 -- The sale of medicinal \n\t\tand pharmaceutical products, effective \n\t\tfor the cures of gunshot wounds, can be \n\t\tmade only to those who present written \n\t\tauthorization from the Commissioner of \n\t\tPolice.\n\n\t\tArticle No. 2 -- Directors of all \n\t\thospitals and clinics must produce to the \n\t\tpolice authorities an immediate listing \n\t\tof all patients admitted to their \n\t\tinstitutions for the care and treatment \n\t\tof gunshot wounds.\"\n \n\n38\tCASBAH ROAD BLOCKS. OUTSIDE. DAY.\n \n \tThe Casbah is being closed off. Every point of entrance, every alley, \n\tevery street that joins the Casbah and the European quarters has been \n\tblocked off with wooden horses and with barbed wire nine feet high.\n\n\tThere are also workers, policemen, and soldiers who are working at the \n\tbarricades.\n \n\tBeyond them, on the other side of the barbed wire, the Algerians seem \n\tto be encaged.\n \n \t\t\t\tSPEAKER\n\t\t\"The Prefecture of Algiers states: In \n\t\tthe course of these last few days, dozens \n\t\tof assaults have been committed in this \n\t\tcity. We have reason to believe that the \n\t\tassailants originate in the Casbah, and \n\t\tthat they have always found a speedy and \n\t\teasy refuge in the alleys of the Arab \n\t\tquarters. As a result, and in order to\n\t\talleviate without delay the insecurity \n\t\tthat now reigns in the city, the \n\t\tPrefecture of Algiers has decided that \n\t\tentrance to the Casbah can only he \n\t\tpermitted at those points in the blockade\n\t\tunder military control, where citizens in \n\t\ttransit must exhibit their documents at \n\t\trequest, and submit to eventual searches.\"\n \n\tThe Casbah is imprisoned, like a huge concentration camp. Only five \n\tstreets have been left open, the widest streets. There are five exits \n\twhere the wooden horses serve to restrict passage, and where some \n\twooden posts for the guards are being built.\n\n\tEvery exit is marked by a sign with large lettering.\n \n\n39 \tBLOCKADE MARENGO. OUTSIDE. DAY. AUGUST 10, 1956.\n \n\tAt each blockade, there are two ramps, an entrance and an exit to the \n\tCasbah. The Algerians and some Europeans crowd around in both \n\tdirections. The soldiers are wearing fatigues with helmets and machine \n\tguns. The Europeans are not requested to show identity papers.\n\n\tThe Algerians are often frisked, and accept this fact silently, \n\tpatiently, without any sign of intolerance. But if the soldiers attempt \n\tto search a woman, then, it is different.\n \n\tA woman begins to shout, while waving her arms wildly, and pushes away \n\tthe soldier who had tried to search her. A stream of incoherent words.\n \n\tOther Algerians intervene; they push forward threateningly. The soldier \n\tis young; he is timid and frightened. He looks over his back for help.\n\n \tA police officer approaches. He has a different tone, and a very self-\n\tassured manner. He shouts at the Algerians to calm down.\n \n\t\t\t\tOFFICER\n\t\tAre you mad, touching one of their women? \n\t\tGo on, go on, alright ... Go ahead, keep \n\t\tmoving!\n \n \tThe woman passes the blockade, but still continues her protest with a \n\tshrill and unbearable voice.\n \n\n40\tRUE PHILIPPE. OUTSIDE. DAY. 8:35 A.M.\n \n \tAn Algerian woman walks along the sidewalk. She is elderly, fat, and is \n\twearing a traditional costume with her face veiled. She walks slowly \n\ttoward a bar, which has its tables outside, and already some customers.\n\n\tNear the bar, leaning against a wall, there is an Algerian who now \n\tbegins to move and goes to meet the old woman. They greet one another \n\twith much warmth, like a mother and son who haven't seen each other for \n\ta long time.\n \n\tThey embrace, and the man searches at her breast among the folds of her \n\tveil. He finds a revolver which is hung by a cord, and grabs it. They \n\tare at ten or twelve feet distance from the bar. At a table, there is a \n\tFrench soldier having coffee with cream, croissant, and an open \n\tnewspaper.\n \n\tThe Algerian continues to embrace the old woman, and aims from above \n\ther shoulders. Only one shot; the newspaper rips, the soldier tries to \n\tget up again, his face full of blood. Then he collapses on the table.\n \n\tThe Algerian has hidden the revolver in the woman's veil. The two \n\tseparate from their embrace. They seem terrified and surprised, and \n\tmove away from each other in different directions while the people are \n\trushing about and SHOUTING.\n \n\n41\tDE LA LYRE MARKET. OUTSIDE. DAY. 9:10 A.M.\n \n \tThe cries of the peddlers are loud and incoherent. An Algerian is \n\tsquatting on his heels in front of his wares scattered on the ground:\n\tclusters of aromatic herbs, jars of spices. A youth is in front of him, \n\tand from time to time, he looks around him. He seems to be waiting.\n\n\tNow he bends down and begins to rummage through the herbs. He selects a \n\tbunch of mint, weighs it in his hand, and argues the price with the \n\tpeddler.\n \n\tA policeman in the market passes nearby and watches. The youth waits a \n\tsecond, then turns toward the back of the policeman, and stretches out \n\this arm.\n \n\tHe has in his hand the bunch of mint; a revolver is hidden among the \n\tgreens. He shoots twice.\n \n\tThe French policeman falls down. The youth drops the mint with the \n\trevolver among the other herbs, and moves away in the midst of the\n\tcrowd.\n \n\n42 \tRUE DE BAR-EL-QUED. OUTSIDE. DAY. 10:15 A.M.\n \n\tIn front of the police station there are sandbags and a police guard at \n\tduty with helmet and machine gun. The policeman jumps to attention and \n\tsalutes. An officer has come out of the station and returns his salute. \n\tHe moves away and walks along the sidewalk.\n \n\tThere are few people. An Algerian seems to appear from nowhere, and \n\twalks behind him. He is very young, is wearing a short-sleeved shirt \n\tand blue jeans.\n \n\tThe officer turns at the first corner. Further on, there is a row of \n\tcars and a metallic sign which warns that the parking space is reserved \n\tfor police vehicles only.\n \n\tThe officer hears the steps of the boy behind him, and summons him in a \n\tbrusque manner.\n \n \t\t\t\tOFFICER\n\t\tWhat are you doing here? Where are you \n\t\tgoing?\n \n\tThe boy shrugs his thin, shoulders and lowers his head.\n \n\t\t\t\tBOY \n\t\t\t(in servile tone)\n\t\tI'm going for a swim; my friends are \n\t\twaiting for me.\n \n\tThe officer curses under his breath and proceeds. He stops in front of \n\ta Dyna-Panhard, parked not too far away. \n\n\tThe boy moves on a few yards past the automobile until he reaches a \n\tmetallic wastebasket which is fastened to the pole of a street lamp. He \n\tstops there, then glances around. \n\n\tThe officer is not far behind him; he has taken his car keys from his \n\tpocket, and is about to open the car door. The boy plunges his hand \n\tinto the basket, rummages among the torn papers, then suddenly turns, \n\tpoints a revolver at the officer's back, and shoots.\n \n\tThe man tries to clutch something, but slips and falls down. The boy \n\tshoots again at the man on the ground, then plunges his hand again into \n\tthe wastebasket, drops the revolver, and glances around him. He breaks \n\tinto a run.\n \n\tThe policemen come out of the police station hurriedly. \n\n\tWHISTLES, ORDERS, EXCITED CRIES.\n \n\tThey turn the corner. Some rush to the man lying on the ground. Others \n\tjump into a jeep. Four of them jump on motorcycles that are lined up in\n \tthe rack. They move off in two directions.\n\n\tAt the same time, wails of police sirens moving nearer are heard in the \n\tdistance. The street is deserted. There is no trace of the boy. \n\n\tPeople are seen at their windows. The officer is lifted by his arms.\n \n\tAn ambulance arrives and stops, its siren at full blast, its doors wide \n\topen. The officer is placed inside.\n \n\tThe motorcycles are racing through the sidestreets. The jeep converges \n\ton them, then reverses its direction, moving while balanced on two \n\twheels.\n \n\tPassersby stop to watch, all of them Europeans. The siren's wail is at \n\ta high pitch.\n \n\n43\tADJACENT STREETS. OUTSIDE. DAY.\n \n \tA deserted street, recently covered with wet asphalt. \n\n\tA Moslem road worker is sitting on the ground next to a steamroller. \n\tHe is eating his lunch. The combined sounds of the siren's wail and the \n\trumbling of the motorcycles are heard approaching.\n \n\tTwo motorcyclists appear in the street, passing by the road worker.\n\n\tOne of them stops and turns around.\n \n\tThe road worker moves backward to the street corner. He breaks into a \n\trun. His eyes are burning with fear, his face is anxious, undecided.\n\n\tFrom the windows, the people point to him, and shout after him.\n\n\tA jeep appears in the street in front of him. \n\n\tThe motorcyclist approaches from the opposite direction. \n\n\tThe Algerian stops running; he doesn't know what to do. \n\n\tFrom the windows, continuous SHOUTING.\n \n\tThe Algerian leans against the wall, watches the scene, and begins to \n\tcry. The policemen jump down from the jeep and leap at him. The \n\tAlgerian isn't able to speak, but only shakes his head.\n \n\n44\tPOLICE STATION. INSIDE. DAY. \n\n\tA room inside the police station. The Algerian's face is beaten from \n\tright and left by a series of slaps.\n\n\tThe room is filled with policemen. All of them are practically on top \n\tof the Algerian; all of them are shouting. In the confusion can be \n\theard SHOUTS.\n \n\t\t\t\tVARIED VOICES\n\t\tDo you know he's dead, you bastard? Do you \n\t\tknow you killed him?\n\n\tThey try to reach him, pushing against one another in order to get \n\tcloser and hit him. The Algerian is crying and speaks in broken-off \n\tphrases, half Arabic and half French. His continual efforts to repeat \n\tcertain words are heard: \n\n\t\t\t\tALGERIAN\n\t\tNo, no, no, no, ... me no ... Viva \n\t\tFrance ...\n\n\tAn officer arrives making his way.\n\n\t\t\t\tOFFICER\n\t\tGet out, go on, outside ... Get out of \n\t\tthe way! Go away ...\n\n\tThey make way for him; he reaches the Algerian who tries to smile at \n\thim, continually shaking his head: \n\n\t\t\t\tALGERIAN\n\t\tSir ... sir ... sir ...\n \n \t\t\t\tOFFICER \n\t\tWhat's your name?\n \n\tThe Algerian's mouth is dry; he tries to swallow.\n \n\t\t\t\tALGERIAN \n\t\tSir ... sir ... sir ...\n \n\t\t\t\tOFFICER \n\t\tWhat's your name?\n\n\t\t\t\tALGERIAN \n\t\t\t(straining, still \n\t\t\ttrying to swallow)\n\t\tLardjane Boualem, sir ...\n \n\n45\tCOMMISSIONER'S OFFICE. INSIDE. NIGHT.\n \n \tIn the Commissioner's office, the Assistant Commissioner dictates:\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tGuilty: Lardjane Boualem, manual worker, \n\t\tmarried with three children. Resident in \n\t\true de Thèbes, number eight ... So? How \n\t\tmany today?\n\n\tThe employee removes the copies from the typewriter and begins to put \n\tthem in order. \n\n\t\t\t\tEMPLOYEE\n\t\tSeven assaults, three dead.\n \n\tThen he moves to the desk, and hands over the various copies for \n\tsignature.\n \n\t\t\t\tEMPLOYEE\n\t\tHere, one for the Commissioner ... the \n\t\tpress offices ... the archives ... and \n\t\tone for you, sir. \n\n\tThe Assistant Commissioner signs.\n\n\t\t\t\tASSISTANT COMMISSIONER \n\t\tGood, thank you, Corbiere... . See you \n\t\ttomorrow.\n \n\t\t\t\tEMPLOYEE\n\t\tGood evening, sir.\n\n\tThe employee salutes, then moves toward the door. He is about to go out \n\twhen the Assistant Commissioner stops him. \n\n\t\t\t\tASSISTANT COMMISSIONER \n\t\tTell me ... Where is this rue de Thèbes?\n \n\t\t\t\tEMPLOYEE\n\t\tRue de Thèbes? In the Upper Casbah, I \n\t\tthink ...\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tAll right. See you tomorrow, Corbiere.\n \n\t\t\t\tEMPLOYEE\n\t\tGood evening, sir.\n\n\tThe employee leaves and closes the door. The Assistant Commissioner \n\tcrosses the room to the large map of Algiers which covers the entire \n\twall. He moves his finger along the Casbah zone; as he moves it, he \n\tfollows it with his glance in that tangle of streets.\n\n\t\t\t\tASSISTANT COMMISSIONER \n\t\t\t(to himself)\n\t\tRue de Thèbes ... de Thèbes ... \n\n\tHe has found it. He observes it for a minute, then moves his finger \n\talong the road leading to the European quarters. He finds the right \n\troute, then concentrates in order to memorize it.\n\n\tHe returns to the desk, lifts the receiver, and dials a number.\n\n\t\t\t\tASSISTANT COMMISSIONER \n    \t\t\t(on the phone) \n\t\tHello, Engineer Henry Amaud, please ... \n\t\tHe's already left? Alright, yes, yes, \n\t\talright ... I have the number.\n \n\tHe clicks the receiver, then dials another number. At the other end of \n\tthe line, a feminine voice is heard. The Assistant Commissioner \n\tabandons his usual peremptory tone.\n \n \t\t\t\tASSISTANT COMMISSIONER\n\t\tHello, Bernadette...Yes, right away. I'm \n\t\tgoing to change my clothes first, and I'll \n\t\tbe right there. My wife is already there, \n\t\tright? No, it's not important. But call \n\t\tHenry for me. Just for a minute ... \n\t\tAlright ... thanks ...\n \n\tHe places the receiver on the desk, then puts on his jacket which is on \n\tthe back of his chair. He straightens his tie. Now from the receiver a \n\tmuffled voice is heard; the Assistant Commissioner picks up the \n\treceiver.\n \n \t\t\t\tASSISTANT COMMISSIONER\n\t\tHello, Henry? ... Everything's okay. \n\t\tGood. What are we going to tell our \n\t\twives? The club? Good idea, yes. I'll be \n\t\tthere right away. Just give me time to \n\t\tchange my clothes ... Ah, I've found the \n\t\taddress. No, it's better to talk in \n\t\tperson. Yes, it's the right place ... \n\t\tOkay. Bye.\n \n\tHe puts down the receiver, then goes to the coat-hanger and takes his \n\tberet. He goes out after glancing again at the photos of the day's \n\tassaults.\n \n\n46\tHENRY ARNAUD'S HOME. INSIDE. NIGHT.\n \n\tTwo small children are kneeling in front of their beds.\n \n\t\t\t\tCHILDREN\n\t\tNotre Père, dans le ciel ...\n\n\tTwo children, five or six years old, blond, charming, but not affected. \n\tThey seem to be twins, and are wearing identical pajamas.\n\n\tAt the same time, a servant is preparing their beds for the night. She \n\tis about fifty years old, her apron clean and ironed; she has gray \n\thair, her face that of a good woman. She is Algerian.  When the \n\tchildren falter in their prayers, she helps them. When they have \n\tfinished she says with an Algerian accent:\n\n\t\t\t\tSERVANT\n\t\tNow, let's go to say good night.\n \n \tIn the dining room, there is a large open window. The beach, the sea, \n\tand the sound of the surf are outside, not too distant. It is a starry \n\tnight. At a table, there are four men and four women, all of them well \n\tdressed and tanned. It is the home of Henry and Bernadette Arnaud. The \n\tAssistant Commissioner is in plain clothes. He and his wife seem ill at \n\tease, somewhat out of place.\n \n\tThe maid and children have entered the room.\n \n\t\t\t\tBERNADETTE\n\t\tCome here, children. Say hello ...\n\n\t\t\t\tCHILDREN \n\t\tGood evening ...\n\n\tThe others smile. The servant accompanies the children to their \n\tparents.\n\n\t\t\t\tCHILDREN\n\t\tGood night, daddy. Good night, mommy. \n\n\t\t\t\tBERNADETTE \n\t\tGood night, dear.\n \n\tThey kiss. At the same time the women make the usual delighted \n\texclamations. One of the men attracts the Assistant Commissioner's \n\tattention, points to his watch, and makes a sign.\n\n\tThe Assistant Commissioner nods his head affirmatively.\n \n\n47\tALGERIAN STREETS. OUTSIDE. NIGHT.\n \n \tA DS Citroen is crossing the city at high speed.\n\n\tThe four men are inside. Arnaud is at the wheel. The Assistant \n\tCommissioner is sitting in the back seat.\n \n\n48 \tCASBAH ENTRANCE. OUTSIDE. NIGHT.\n \n \tThe automobile arrives at Place du Gouvernement, takes a turn around \n\tthe square, then turns toward the blockade, and slows down.\n\n\tOne of the soldiers moves to the center of the ramp, and raises the \n\tphosphorescent flag. The car lowers its headlights and stops.\n\n\tThe soldier goes to the driver's window. In his right hand, he is \n\tholding a machine gun which hangs from his shoulders. He greets them.\n \n\tHe bends to window level:\n\n\t\t\t\tSOLDIER \n\t\tGood evening ...\n\n\tArnaud responds in an innocent, cheerful tone: \n\n\t\t\t\tARNAUD\n\t\tGood evening ... Can we pass?\n\n\t\t\t\tSOLDIER \n\t\tIt's too late. No one is allowed to enter \n\t\tthe Casbah at this hour. It's impossible.\n\n\t\t\t\tARNAUD\n\t\tBut it's not even midnight yet!\n\n\t\t\t\tSOLDIER \n\t\tIt's ten minutes past midnight. Curfew \n\t\tbegins at midnight.\n\n\t\t\t\tARNAUD\n\t\tPlease, we just want to take a short ride. \n\t\tA friend of mine has never seen the \n\t\tCasbah.\n \n\t\t\t\tSOLDIER \n\t\tI'm sorry. Tomorrow. Tonight is out of \n\t\tthe question.\n \n\tThe Assistant Commissioner intervenes with the self-assured and \n\tsomewhat arrogant tone common to all policemen. He stretches his arm \n\ttoward the window and hands the soldier a card.\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tIt's alright, they're with me. \n\n\tThe soldier examines the card by the glare of the headlights, hands it \n\tback, and bringing his hand to his visor, he salutes. \n\n\t\t\t\tSOLDIER \n\t\tOkay, sir. Go ahead.\n      \n\tThe Assistant Commissioner salutes with his hand.\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tLet's go, Henry. \n\n\t\t\t\tARNAUD \n\t\t\t(he changes gears)\n\t\tThank you. Good evening. \n\n\tThe soldier steps aside, and salutes again.\n\n\tThe automobile begins to move, steadily increasing its speed.\n\n\n49\tCASBAH STREET. OUTSIDE. NIGHT. \n\n\tThe streets of the Casbah are deserted, almost completely blackened. \n\tSome cats are frightened by the headlights and run close to the walls.\n \n\tInside the car the four men are silent. They keep their eyes fixed \n\tstraight ahead of them, their faces concentrating, taut.\n \n\t\t\t\tARNAUD \n\t\tThis way?\n\n\t\t\t\tASSISTANT COMMISSIONER \n\t\tYes, it's the first intersection ... or \n\t\tthe second.\n \n \n50\tRUE DE THÈBES. OUTSIDE. NIGHT.\n \n\tThe automobile slows down at the first intersection. Arnaud leans out \n\tthe window and looks. There is an enamel nameplate -- RUE DE THÈBES.\n \n\t\t\t\tARNAUD \n\t\tRight or left?\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tTry going to the right. \n\n\tThe car turns right, moving slowly.\n \n\tOn one side of the street, the even numbers are getting higher: 26 ... \n\t28 ... 30 ...\n \n\t\t\t\tARNAUD \n\t\tWhat number is it?\n \n\t\t\t\tASSISTANT COMMISSIONER \n\t\tEight.\n      \n\tThe man next to the Assistant Commissioner says:\n \n\t\t\t\tFRIEND\n\t\tLet's park here. It doesn't matter.\n \n \t\t\t\tASSISTANT COMMISSIONER \n\t\t\t(in sharp tone) \n\t\tIt does matter. Go back, Henry. Let's go \n\t\tto number eight.\n \n\tArnaud puts the gears in reverse; the car moves back quickly and passes\n \tthe intersection: 16 ... 14 ... 12 ... 10 ... 8... it stops.\n\n\tArnaud puts it in neutral. With the motor still running, he presses the \n\tcigarette lighter on the dashboard.\n\n\tThe Assistant Commissioner takes a large package that he is holding \n\tunder his legs on the car floor. It is wrapped in pieces of newspaper. \n\tHe lifts it forward. The man who is next to Arnaud takes it, leans it \n\tagainst the back of his seat, touches it until he finds the right spot, \n\tunwraps it from that part, and straightens a small plastic tube which \n\tappears at the opening. It is a fuse.\n \n\t\t\t\tARNAUD \n\t\tHow long do you want the timing device? \n\n\t\t\t\tFRIEND\n\t\tFive minutes. Give me a match ...\n \n\tArnaud takes the cigarette lighter from the dashboard.\n \n\tThe other man has opened the car door. He takes the lighter and touches \n\tit to the fuse which ignites immediately. The door of number eight is \n\tvery near, almost directly opposite the car door. \n \n\tThe man places the package in a shady area and returns to the car in a \n\trun. Arnaud has already changed gears, releases the clutch, and the \n\tautomobile shoots forward.\n \n\n51\tRUE DE THÈBES. EXPLOSION. OUTSIDE. NIGHT. AUGUST 11, 1956. 12:20 A.M.\n\n\tThe explosion is very violent. The fronts of buildings number eight, \n\tten, and twelve explode and collapse. \n\n\tEXPLOSION.\n \n\tThe echo of the explosion has ended. There is a long pause, only some \n\tisolated noises resound. They are stressed, recognizable: a burning \n\tbeam, the thud of falling debris, broken glass ...\n\n\tThen suddenly and almost simultaneously with the other sounds, after \n\tthe shock, the human voices, the shouts and weeping are heard.\n\n\tVOICES, SHOUTS, WEEPING.\n \n\n52\tRUE DE THÈBES. OUTSIDE. DAWN.\n \n\tThe dawn's light is clear and white. It dispels every shadow and \n\tdesigns precisely every outline. Here and there, in the middle of the \n\tsky, there are numerous clouds of dust, strangely motionless. In the \n\tlight, the human figures seem black. Seen from a distance, they seem to \n\tbe ants upon heaps of debris. There are women, motionless, weeping \n\tsoftly, their voices similar to prayer. From time to time, there is a \n\tsudden scream, a despairing sob, someone running.\n\n\tAnother corpse is pulled out from the rubble, bodies mutilated or still \n\tintact -- they are all dead.\n\n\tThe people continue to rummage through the debris and to wait around \n\tpitifully.\n \n\n53\tCASBAH STREETS. OUTSIDE. DAY.\n\n\tBut there is no pity in the other streets and alleys of the Casbah, or \n\tat the top of the steps. There is anger and hatred. The people are \n\trunning and shouting.\n\n\tThey are shouting from their windows and balconies:\n \n\tJU-JU.\n \n\tThey smother every other sound. The excitement increases. They run \n\twhere there is more shouting, more people. They don't know what to do \n\tyet, but want to be together. Until there is a voice stronger and \n\tclearer than the others which gives them a goal and direction.\n\n\tAli la Pointe points below beyond the slopes of the alleys and \n\tstairways. There below are the European quarters which widen near the \n\tsea.\n \n\tThe crowd is shouting, pushing, rushing forward with him, like a raging \n\tstream, tumultuous and unrestrainable. Ali is together with his men, \n\tfive boys, one of them older than twenty. All of them are armed. The \n\tcrowd forces them to quicken their step to a run.\n\n\tPetit Omar is furthest in the rear. He is wearing a pair of short \n\tpants, his chest bare; he is barefoot. He calls Ali with all his might, \n\tbut in vain.\n\n\tHe tries to join Ali, to make his way through the legs of the others; \n\the runs, clinging to the others, pushes, passes near the walls; then, \n\tturning into a side-street, he rushes into an alleyway, and finally \n\tarrives in front. He runs to Ali, almost out of breath.\n \n\t\t\t\tPETIT OMAR \n\t\t\t(shouting)\n\t\tKader says to stop them! He says we've \n\t\tgot to stop them!\n \n\tAli slows down as much as he can with the crowd pushing him from \n\tbehind.\n \n\t\t\t\tALI \n\t\tWhere's Kader?\n \n\t\t\t\tPETIT OMAR \n\t\tWith the others. They are trying to stop \n\t\tthe people.\n \n\t\t\t\tALI \n\t\tGo away.\n\n\tTheir voices can hardly be heard or understood amid the loud noises.\n \n\t\t\t\tPETIT OMAR \n\t\tBut he says that if we go on like this, \n\t\twe're playing their game, and they'll \n\t\tmurder everyone ... Stop, Ali!\n \n\tAli continues to run. His face is sullen, frowning, as always when he \n\tmust choose between instinct and reason. Omar calls him again. His \n\tvoice is hysterical, repeating again to stop. He is hanging on one of \n\tAli's arms. Ali jerks himself free violently; he strikes the child. \n\tOmar sways and falls against the wall.\n\n\tWith this movement, Ali seems to release his anger at not being able to \n\tcarry out his actions.\n\n\tHe slows down, speaks to his men, a few words in Arabic, his voice cold \n\tand bitter.\n \n\tAli extends his arm and the others imitate him. Each man grabs another \n\tby the arm, forming a chain. They check the flow behind them and hold \n\tback the crowd that is pressing forward.\n \n\n54 \tKADER'S HOUSE. INSIDE. DAY. SEPTEMBER 30, 1956.\n \n\tDjamila, the girl who in January, in rue Random, gave the revolver to \n\tAli la Pointe, is now standing in front of a large mirror. She removes \n\tthe veil from her face. Her glance is hard and intense; her face is \n\texpressionless. The mirror reflects a large part of the room: it is a \n\tbedroom. There are three other girls.\n \n\tThere is Zohra, who is about the same age as Djamila. She undresses, \n\tremoving her traditional costume, and is wearing a slip ...\n\n\tThere is Hassiba who is pouring a bottle of peroxide into a basin. She \n\tdips her long black hair into the water to dye it blond.\n\n\tEvery action is performed precisely and carefully. They are like three \n\tactresses preparing for the stage. But there is no gaiety; no one is \n\tspeaking. Only silence emphasizes the detailed rhythm of their \n\ttransformation ...\n\n\tDjamila's lightweight European dress of printed silk ...\n\n\tZohra's blouse and short skirt to her knees ... make-up, lipstick, \n\thigh-heeled shoes, silk stockings ...\n\n\tHassiba has wrapped her hair in a towel to dry it ... a pair of blue \n\tjeans, a striped clinging tee-shirt ...\n\n\tHer blond hair is now dry. She ties it behind in a ponytail. Hassiba \n\thas a young, slim figure. She seems to be a young European girl who is \n\tpreparing to go to the beach. \n\n\tContinual silence. Djamila and Zohra have finished their preparations \n\tand sit down to wait. Hassiba is still barefoot. She is putting on her \n\tsandals, when someone knocks at the door.\n \n\tDjamila gets up and goes to open it. \n\n\tIt is Kader.\n\n\tA quick attentive glance; Djamila ... Zohra ... Hassiba ...\n\n\tHassiba responds to his look with a gay and somewhat coquettish \n\texpression; she says, stressing her French:\n \n\t\t\t\tHASSIBA\n\t\tÇa va, monsieur?\n \n \tKader smiles for a second, without any gaiety, but to please her. Then\n\the speaks briefly and harshly in Arabic. And turning one at a time to\n \teach of the three, he gives them three addresses.\n \n\t\t\t\tKADER \n\t\t\t(to Djamila)\n\t\tNumber three rue de Chêne.\n\t\t\t(to Zohra)\n\t\tNumber fourteen rue Monseigneur Leynaud. \n\t\t\t(to Hassiba)\n\t\tNumber twenty-one rue de l'Hydre.\n \n\tEach one of the girls repeats, in turn, the address which he has given \n\ther. Each one of the three responds emotionally. The atmosphere is \n\ttense. Kader bids them farewell according to the Algerian custom, first \n\tbringing his right hand over his heart. Then he embraces them.\n\n\tThey look at him for a moment; they are embarrassed. Kader tries to \n\tease their discomfort, smiles, and answers Hassiba's previous remark.\n \n\t\t\t\tKADER \n\t\tÇa va ... Et bonnes chances!\n \n\n55\tRUE DE L'HYDRE. OUTSIDE/INSIDE. DAY. 5:45 P.M.\n \n\tAt number twenty-one rue de l'Hydre, there is a bread store. Hassiba \n\thas again covered her face with a veil, and is also wearing a white \n\tcloak which covers her whole body. \n\n\tShe enters the store. There are other women who are buying bread. \n\tHassiba waits for them to leave, then says in Arabic to the shopkeeper:\n \n\t\t\t\tHASSIBA\n\t\tI've come to take the package ...\n \n\tThe shopkeeper empties half a basket of bread; at the bottom, there is \n\ta beach bag with a shoulder-strap, and he gives it to Hassiba.\n\n\tHassiba hides it under her cloak, bends her head in a sign of farewell, \n\tand leaves.\n \n\n56\tRUE MONS. LEYNAUD. INSIDE. DAY. 5:45 P.M. \n\n\tAt number fourteen rue Monseigneur Leynaud, there is a tailor shop and \n\tclothing store. Zohra is also wearing the veil and white cloak. She \n\tenters.\n \n\t\t\t\tZOHRA\n\t\tI've come to take the package ...\n \n\tThe tailor accompanies her to the back of the shop, where there is a \n\tworkroom and young girls who are sewing. He rummages in a closet, takes \n\tout an Air France utility bag and gives it to Zohra who hides it under \n\ther cloak, greets him, and leaves.\n \n\n57\tRUE DU CHÊNE. INSIDE. DAY. \n\n\tInside number three rue du Chêne, an Algerian craftsman is working in \n\tfiligree. Djamila takes a small leather cosmetic case.\n\n\tDjamila hides it, greets the man, and leaves.\n \n\n58\tALLEY AND BLOCKADE. RUE MARENGO. INSIDE/OUTSIDE. DAY. 6:05 P.M. \n\n\tAt an intersection of rue Marengo, an alley, Hassiba enters a large \n\tdoor, and shuts it. In a second, she has removed her veil and cloak. \n\tHer face is made up; she is wearing pants and a jersey top. She places \n\tthe strap of her bag on her shoulder.\n \n\tInside the bag, a towel and bathing suit are visible. \n\n\tHassiba goes out the door, proceeds down the alley until she reaches \n\true Marengo. She approaches the blockade. \n\n\tIt is Saturday evening; there is a hurried bustle of Algerians and \n\tEuropeans. Soldiers and policemen, are very busy with their usual \n\trequests for documents.\n\n\tHassiba's arrival is quickly noticed for she is very pretty and \n\tattracts much attention. Some soldiers whistle.\n\n\tAn elderly Algerian woman looks at her with dislike. Hassiba is \n\tindifferent and waits her turn. A French soldier approaches her.\n \n\t\t\t\tSOLDIER\n\t\tI'd like to search you, Miss ...\n\n\tFor an instant, Hassiba is dismayed; then, she glances down at her \n\tclinging shirt and pants.\n \n\t\t\t\tHASSIBA \n\t\t\t(innocently)\n\t\tWhere?\n      \n\tThe boy is young, handsome, and cheeky. \n\n\t\t\t\tSOLDIER\n\t\tNot here. There's too many people.\n\n\t\t\t\tHASSIBA \n\t\tBut you don't understand. I was saying \n\t\tthat there's nothing to search.\n\n\t\t\t\tSOLDIER\n\t\tThat's what you think!\n \n\tSome Europeans laugh, the Algerians seem not to see or hear, but it is \n\tevident that they are scornful.\n\n\t\t\t\tSECOND SOLDIER\n\t\tAre you going for a swim, Miss ... all by \n\t\tyourself?\n\n\t\t\t\tHASSIBA \n\t\tNo, with some friends.\n     \n\tAt the same time, she passes the blockade. \n\n\t\t\t\tSECOND SOLDIER\n\t\tLucky them. Next Sunday I'm free .... Shall\n\t\twe go together?\n     \n\tHassiba shrugs her shoulders, smiles again, and moves away.\n \n \n59\tBLOCKADE RUE DU DIVAN. OUTSIDE. DAY.\n \n\tAt the rue du Divan blockade, Zohra too is dressed like a European, and \n\tseems to be calm.\n \n\tThere are not too many people. A soldier makes a sign for her to pass \n\tin a hurried manner, and the girl passes.\n \n\n60\tBLOCKADE RUE DE LA LYRE. OUTSIDE. DAY.\n \n\tDjamila is tense, pale, her features are strained. Her eyes seem even \n\tlarger with make-up. Now, at the blockade at rue de la Lyre, the Casbah \n\texit is blocked. An Algerian has been discovered without documents. He \n\targues, shouts, and says that he wants to go back. \n\n\tINCOHERENT VOICES.\n\n\tThe soldiers try to catch him, he struggles to get free. \n\n\tMeanwhile the people push forward in protest. Two soldiers catch the \n\tAlgerian, and drag him bodily into the guard posts. The flow of people \n\tcontinues.\n\n\tDjamila steps forward, holding the cosmetic-case with both of her \n\thands. She doesn't know how to carry it, and from time to time she \n\tchanges her position. She realizes that she looks awkward.\n\n\tIt's now her turn. The soldiers' tone is arrogant. The previous scene \n\thas made them nervous. An officer signals her to pass, then points to \n\tthe cosmetic-case.\n \n \t\t\t\tOFFICER \n\t\tWhat's inside?\n \n \tInstinctively, Djamila lifts the case and looks at it; she feels \n\therself failing, but makes an effort to answer.\n \n\t\t\t\tDJAMILA \n\t\tHere?\n\n \t\t\t\tOFFICER \n\t\tThere ...\n \n\tDjamila uses all her strength to smile and she succeeds. Her eyes light \n\tup defiantly.\n \n \t\t\t\tDJAMILA \n\t\t\t(provocatively)\n\t\tNothing. \n\n\tThe officer signals her to pass.\n \n\n61\tFISH-MARKET. INSIDE. DAY. 6:15 P.M.\n \n\tA large warehouse in the fish-market. There are enormous iceboxes with \n\tcartons of frozen fish and tubs with running water and live fish. The \n\tthree girls are next to one another. \n\n\tThe three bags are on top of the counter, a few steps away. With them \n\tis a thin Algerian about twenty-five years old. He has thick black \n\thair, straight and combed neatly. He is wearing glasses. With his rough \n\tand nervous hands, he pulls out the towel and bathing suit from \n\tHassiba's bag, then delicately and carefully, a square wooden box. He\n\topens it, and turning to the girl, signals her to move away a bit. The \n\tgirl steps back. In the box, there is a huge iron tube, sealed at both \n\tends by two clock dials. Inside the tube, two batteries with wires are \n\tattached to the dials. The youth glances at his wristwatch, then \n\tadjusts the hands of the dials to six forty-five. He puts the bomb back \n\tinto the box, closes it, and places it in the bag. He replaces the \n\ttowel and bathing suit, then hands the bag to Hassiba. He is smiling \n\tslightly. \n\n\tHassiba takes the bag and goes away.\n\n\tThe box fits perfectly into Djamila's cosmetic-case. The youth opens it \n\twithout removing it from the case, adjusts the two dials to six fifty, \n\tputs everything back in its place, and hands the case to Djamila. He \n\tsmiles at her and she moves away. In the Air France bag, there are \n\tnewspapers and magazines on top, and the same box. The youth adjusts \n\tthe bomb to six fifty-five, arranges it again inside the bag, closes \n\tthe zipper, and hands the bag to Zohra. He smiles at her. His smile is \n\tmore genuine, less mechanical. There is less tension than before.\n\n\tThe youth smiles at the girl and says in Arabic:\n \n \t\t\t\tALGERIAN\n\t\tMay Allah protect you.\n \n\tZohra thanks him in a whisper, bends her head, and moves away. The \n\tyouth takes a cigarette from his shirt pocket, places it between his \n\tlips, and lights it. His hand is trembling a little.\n \n\n62\tCAFETERIA RUE MICHELET. INSIDE. DAY. 6:30 P.M.\n \n\tCafeteria, rue Michelet 1. The club is very crowded. There are two \n\trooms; one at the entrance with an American-style bar, and one at the \n\tback with tables. It is Saturday, and at this hour many European\n\tfamilies go out to have an ice cream. There is not too much confusion \n\tor uproar. The people are calm, they take their places at the bar and \n\tsmall tables, and eat their ice cream while chatting quietly.\n\n\tHassiba enters, glances at the large clock above the cash register. It \n\tis half past six. She goes to the register and waits her turn. The \n\tdifferent orders mingle; she orders a Coca-Cola. They give her the \n\tcheck. She pays.\n\n\tShe goes to the bar; all the seats are taken. She gives her order and \n\tthe ticket to the waiter.\n \n\tA man moves aside, looks at her, then steps down from his stool and \n\toffers it to her.\n \n\tHassiba tells him that it doesn't matter, but the man insists. Hassiba \n\tthanks him and sits down. The man is about fifty, well groomed. He \n\tsmiles again, and turns to chat with some friends.\n\n\tHassiba settles herself more comfortably on the seat, then removes the \n\tbag from her shoulder. Holding it by the strap, she places it on the \n\tfloor below the counter behind the brass railing used to lean one's \n\tfeet.\n \n\tThe waiter has brought her the drink. Hassiba drinks slowly, from time \n\tto time glancing at the clock. She finishes drinking. The bag is in a \n\tvertical position.\n \n\tMoving her feet slowly and carefully, Hassiba lets the bag slip on its \n\tside.\n \n\tShe gets down from the seat, and points it out to the man who is \n\tstanding next to her. \n\n\t\t\t\tHASSIBA\n\t\tI'm giving your seat back. \n\n\t\t\t\tMAN\n\t\tAre you already leaving, Miss? \n\n\tHassiba smiles, nods yes. \n\n\t\t\t\tHASSIBA\n\t\tGood evening ...\n\n\tThe man sits down.\n \n \t\t\t\tMAN\n\t\tGood evening ...\n \n\n63\tMILK BAR. RUE D'ISLY. OUTSIDE/INSIDE. DAY.\n \n\tMilk Bar, rue d'Isly, at the corner of Place Bugeand. The jukebox is \n\tplaying full blast. It is a bar for young people. There is much bustle \n\tand confusion, much laughter. The girls are making plans for Sunday.\n\n\tDjamila enters and moves to the jukebox which is in the corner near the \n\tdoor. There are playbills for various theater performances hanging on\n \tthe wall. Djamila stops to look at them and reads the bottom lines. She \n\tplaces the cosmetic-case on the floor. Rising again she looks around \n\ther, and pushes the case behind the jukebox with her foot ...\n \n\n64 \tAIR FRANCE. IMMEUBLE MAURETANIA. INSIDE. DAY.\n \n\tMaison Blanche, Immeuble Mauretania. The entire ground floor is filled \n\twith ticket counters and a waiting room for the airlines. There are \n\tsome employees, stewardesses and some travelers.\n \n\tZohra passes through the large glass door at the entrance, goes to the \n\tAir France counter, takes a time schedule, then goes to sit down on a \n\tsofa which runs along the opposite wall. She sits down and places the \n\tairline bag on the ground in front of her, and begins to leaf through \n\tthe timetable, from time to time glancing around. Using her heels, she \n\tpushes the bag under the sofa.\n\n\tShe looks at the large electric clock which is hanging in the center of \n\tthe room; it is forty minutes past six.\n \n \n65\tCAFETERIA RUE MICHELET. INSIDE. DAY.\n \n\tIt is six forty-four by the cafeteria clock. The second hand is moving.\n \tThere are more or less the same people. The old man is still seated on\n \tthe barstool, and continues to chat.\n\n\tHassiba's bag is still at his feet; the second hand is racing. A five-\n\tyear-old child hands a coin to the waiter:\n \n\t\t\t\tCHILD\n\t\tIce cream ...\n\n\tThe father and mother are watching him, delighted. The waiter smiles at \n\tthe child and points to the cash register. He speaks to the child in \n\tthe usual tone of a grownup when speaking to children:\n \n \t\t\t\tWAITER\n\t\tYou have to go there first ... and then \n\t\tcome back to me.\n\n\tThe second hand reaches twenty-five, then thirty. The child goes to the \n\tcashier and pays. The cashier smiles at him and gives him the check.\n \n\t\t\t\tCASHIER\n\t\tWhat a good boy ...\n\n\tThe child returns to the counter. The waiter has already prepared the \n\tice cream for him, and hands it to him. The child is standing on\n\ttiptoes.\n \n\n66\tCAFETERIA MICHELET. EXPLOSION. INSIDE. DAY. \n\n\tThe second hand, the explosion: bodies flung into the air, arms, legs, \n\twhite smoke, screams.\n \n\tBodies thrown outside, the doors unhinged, the windows broken, empty.\n\n\tThe people watch from their windows, the passersby move closer, they \n\tbend down to look at those who are writhing on the ground.\n\n\tAstonished and incredulous faces. No one speaks. Only screams and \n\tweeping. Sirens which are drawing nearer. Firemen and police \n\tarriving ...\n \n\n67\tMILK BAR. RUE D'ISLY. OUTSIDE. DAY. \n\n\tThe ambulance sirens on rue d'Isly, one car after another. \n\n\tAt the Milk Bar, the people go to the doors to look at the ambulances \n\twhich are racing toward Place Bugeand. The sirens fade in the distance \n\tand move away. The jukebox is again loud: \"Brigitte Bardot, Bardot ...\" \n\n\tThe people re-enter the bar, chattering, to have their apéritifs. It is \n\tsix fifty: the explosion.\n \n\n68 \tMILK BAR. EXPLOSION. OUTSIDE. DAY.\n \n \tThe jukebox is flung into the middle of the street. There is blood,\n \tstrips of flesh, material, the same scene as at the Cafeteria; the \n\twhite smoke and shouts, weeping, hysterical girls' screams. One of them \n\tno longer has an arm and runs around, howling despairingly; it is \n\timpossible to control her. The sound of sirens is heard again. The \n\tcrowd of people, the firemen, police, ambulances all rush to the scene \n\tfrom Place Bugeand.\n\n\tThe ambulances arrive at rue Michelet.\n\n\tThey are already loaded with dead and wounded. The relatives of the \n\twounded are forced to get out. The father of the child who was buying \n\tice cream seems to be in a daze: he doesn't understand.\n\n\tThey pull him down by force. The child remains there, his blond head a \n\tclot of blood.\n \n\tThe policemen try to bring order to the chaos, are forced to shout, \n\tpush, threaten. The wounded swarm around the ambulances. A Commissioner \n\tsends off the first one.\n \n \t\t\t\tCOMMISSIONER\n\t\tWhat time is it?\n \n \t\t\t\tPOLICEMAN\n\t\tA quarter to seven.\n \n \tThe Commissioner goes to the second ambulance, pulls down a man who is \n\ttrying to enter by force, slams the door, and shouts to the driver. His \n\tface is pale and drawn; the veins of his neck are swollen.\n \n\t\t\t\tCOMMISSIONER \n\t\tGo away, for God's sake!\n \n\tThe auto leaves and now, the third explosion resounds in the distance. \n\tIt is heard clearly and violently from the Mauretania section.\n\n\tThe Commissioner stops midway in his last gesture, and likewise, all \n\tthe others, who are paralyzed with fright, incapable of taking action\n\tagain, of accepting such reality for a third time.\n\n\tIn Place Bugeand, there also, the people are motionless. All of them \n\tare looking in the same direction. Their faces are alike in their \n\tterror, alike in their sense of impotence, alike in their deep sadness.\n\n\n69\tSTREET. EUROPEAN CITY. OUTSIDE. DAY. \n\n\tThe sun appears, then hides behind black clouds. There is a cool wind.\n \tIt is ten in the morning, and the European city has its usual rapid and \n\tefficient rhythm of every day at this hour, only there is terror \n\twritten on the face of every person. That same terror has remained, and \n\tsuspicion, and despairing impotence.\n\n\tPatrols of soldiers and policemen move around the city, search \n\tAlgerians and some Europeans, stop automobiles, trucks, buses, and \n\ttrams that they block at both doors. \n\n\tAt the entrance to every shop, the owner searches every customer before \n\tletting him enter.\n \n\tHe does so politely with a drawn smile, and methodically rummages \n\tthrough every handbag, every package. \n\n\tSo too in the bars, in the offices, in workshops ... And now that it is \n\talready late afternoon, also outside the brothels, the cinemas, the \n\ttheaters.\n \n\n70\tLEMONS STREET. OUTSIDE. SUNSET.\n \n\tA young Algerian boy thirteen or fourteen years old, wearing sandals\n\twithout socks, trousers that reach to his ankles, walks quickly \n\tcarrying a cardboard box tied with a cord. It is dusk.\n \n\tA European woman sees him pass in front of her, looks at him, and \n\tfollows him with her glance.\n \n\tOn the sidewalk there are some youths. The woman points to the Algerian \n\tboy, says something. The traffic is heavy. Her words are unclear. One \n\tyouth calls to the boy who is by now thirty feet away:\n\n\t\t\t\tYOUTH\n\t\tHey, little rat ...\n \n\tThe boy turns around for a second, his face frightened, and quickens \n\this step. The youths follow behind him and the boy begins to run. The \n\tyouths too begin to run and others join them, people who are passing. \n\tThey form a small mob and are shouting. The boy shoots into a\n\tsidestreet, drops his box, and races ahead.\n\n\tWhile some chase the boy, others stop around the box, make way, look \n\tfor a policeman, a soldier, an officer. A circle continues to form \n\taround the box. A patrol arrives. One of the soldiers has a Geiger \n\tcounter. He moves near the box, carefully placing the counter above it, \n\tthen ceasing to be prudent, he takes his bayonette, cuts the cord, and \n\ttears open the box: lemons.\n \n\n71\tSTREET CORNER. OUTSIDE. SUNSET.\n \n\tThe boy has been cornered, surrounded, pinned down, kicked, hit with \n\tumbrellas, until he is exhausted and can no longer defend himself. He \n\tis no longer moving. He is lying on the ground, dead. The air is gray \n\tnow, and slowly all the colors unite to form gray. Lights are lit in\n\tthe city and contrast with the whiteness of the Casbah high above. The \n\tsky is still clear, the black profiles of the mountains, the straight \n\tcoasts on the sea, the sea itself that seems to be land until it \n\treaches the horizon where the moon rises between the clouds.\n \n\t\t\t\tSPEAKER\n\t\t\"Following a lengthy discussion, the \n\t\tGeneral Assembly of the United Nations has \n\t\tdecided its agenda for the forthcoming \n\t\tdebates:\n \n\t\t(1) re-unification of Korea \n\t\t(2) disarmament \n\t\t(3) the Algerian question.\n\n\t\tColombia has proposed that only the first \n\t\ttwo points be discussed for the day. \n\t\tHowever, the Afro-Asian nations opposed, \n\t\tunderlining the importance they attribute \n\t\tto the Algerian question ...\"\n \n\n72\tSEA-FRONT. OUTSIDE. DAY. JANUARY 10, 1957.\n \n\tThe European crowd applauds, their eyes aglow, their mouths wide open, \n\tshouting and yelling, their teeth flashing in the sun. Clapping of \n\tapplause on the sea-front of Algiers. Children, are held up to see, \n\twaving small flags. The paratroopers of the Tenth Division march past.\n \n\t\t\t\tSPEAKER\n\t\t\"Mr. Raymond Lefevre, Inspector General \n\t\tof the Administration, has presided over \n\t\ta meeting in which important decisions \n\t\thave been taken with the aim of securing \n\t\tpublic order and the protection of \n\t\tpersons and their property. In particular, \n\t\tit has been decided to recall the 'Tenth' \n\t\tDivision of paratroopers to Algiers that, \n\t\tuntil now, has been employed in the \n\t\tantiguerrilla operations on the Cabiro \n\t\tplateau. The Commander General of the \n\t\tTenth Division will assume responsibility \n\t\tfor the maintenance of order in Algiers, \n\t\tand will have at his disposal in order to \n\t\tachieve this goal, all civil and military \n\t\tmeans provided for the defense of the \n\t\tzone.\"\n \n\tMassu and the authorities are standing on the balconies of the \n\tPrefecture building.\n \n\tThe paras are marching, their sleeves rolled up, their faces sunburned. \n\tMachine guns, bazookas, crew-cuts, the eyes of singing boys, silent \n\tsteps, one battalion after another. \n\n\tThe dragon \"black berets\" pass by ...\n\n\tThe \"red berets\" of the 2nd Regiment of colonial paratroopers ...\n\n\t\"Les casquettes\" of the 3rd Regiment parade by; \"les hommes-peints,\"\n\tMathieu's paras.\n \n\tColonel Mathieu is at the head of the regiment. He is tall, slender, \n\tover fifty. He has thinning gray hair, a lean face, blue eyes, and a \n\twide forehead. His face is lined with many wrinkles. Were it not for \n\tthe uniform, the weapons, his tanned skin, his manner of walking, and \n\this energetic voice when giving orders, he wouldn't seem a soldier, but \n\tan intellectual.\n \n \tThe 3rd Regiment colonial paratroopers are now before the Commissioner. \n\tMathieu turns his head slightly and: \n\n\t\t\t\tMATHIEU \n\t\t3rd Regiment! Attention à droite ... \n\t\tDroite!\n \n\t\t\t\tSPEAKER\n\t\tFamily name: Mathieu; Name: Philippe; \n\t\tBorn in Rennes May 3, 1906; Rank: \n\t\tLieutenant Colonel; Schooling: \n\t\tPolitechnique-degree in Engineering; \n\t\tCampaigns: Second World War, Anti-Nazi \n\t\tResistance Movement, Italian Campaign, \n\t\tIndochinese War, Algerian War ...\n \n\n73\tVILLA HEADQUARTERS. INSIDE. DAY.\n \n\tIn a villa in the military headquarters, a reception room is visible \n\tthrough a large window on the first floor. There are about twenty \n\tofficers seated in rows of chairs as if for a lecture. Mathieu is in \n\tfront of them and he is speaking while standing next to a desk. At his \n\tback there is a blackboard, and near it, a large map with pyramid \n\tgraphs, cells, arrows, crossmarks, and, above them, the title: \n\tSTRUCTURE NLF AUTONOMOUS ZONE OF ALGIERS.\n\n\tMathieu's voice has nothing of the military and traditional. His tone \n\tis neither harsh nor cold, but rather kind and pleasing; from it\n \temanates a superior authority imposed by reason and not by position.\n \n\t\t\t\tMATHIEU \n\t\tThe result is that in the last two \n\t\tmonths, they have reached an average of \n\t\t4.2 assaults per day, including \n\t\taggression against individuals, and the \n\t\texplosions. Of course, the conditions of \n\t\tthe problem are as usual: first, the \n\t\tadversary; second, the method to destroy \n\t\thim ... There are 80,000 Arabs in the \n\t\tCasbah. Are they all against us? We know \n\t\tthey are not. In reality, it is only a \n\t\tsmall minority that dominates with \n\t\tterror and violence. This minority is \n\t\tour adversary and we must isolate and \n\t\tdestroy it ...\n \n\tWhile speaking, he goes to the window, and pulls down the shade. He \n\tinterrupts his speech, points to the rest of the window:\n \n\t\t\t\tMATHIEU \n\t\tDraw it down there too ...\n \n\tTwo or three officers stand up to perform the task. At the back of the \n\troom there is a movie projector. \n\n\tNext to it there is a para who is preparing to operate it. \n\n\tThe other shades are drawn, and gradually the room is darkened.\n\n\tMathieu, meanwhile, has resumed speaking:\n \n\t\t\t\tMATHIEU \n\t\tHe is an adversary who shifts his \n\t\tposition above and below the surface with \n\t\thighly commendable revolutionary methods\n \t\tand original tactics. ... He is an \n\t\tanonymous and unrecognizable enemy who \n\t\tmingles with thousands of others who \n\t\tresemble him. We find him everywhere: in \n\t\tthe alleys of the Casbah; in the streets \n\t\tof the European city, and in working \n\t\tplaces.\n\n\tMathieu interrupts himself again and makes a signal to the back of the \n\troom which is completely darkened.\n \n\t\t\t\tMATHIEU\n\t\tGo ahead, Martin.\n\n\tMartin turns on the projector. On the white wall next to the map and \n\tgraph appear pictures of the Casbah. There are the blockades, the \n\tbarbed wire, the metal screens, the Algerians who exit and enter, the \n\tpolicemen and soldiers who examine documents and frisk someone. From \n\ttime to time, close-ups of the pictures are shown, enlarged to the \n\tminutest details, close-ups of faces, motionless images that last only \n\tfor a few seconds.\n \n\t\t\t\tMATHIEU \n\t\tHere is some film taken by the police. \n\t\tThe cameras were hidden at the Casbah \n\t\texits. They thought these films might be \n\t\tuseful, and in fact they are useful in \n\t\tdemonstrating the usefulness of certain \n\t\tmethods. Or, at least, their inadequacy.\n\n\tHassiba is now seen and the soldiers who are wooing her, while she \n\tlaughs, jokes, flirts in a provocative manner, and passes the blockade.\n \n\t\t\t\tMATHIEU \n\t\tI chose these films because they were \n\t\tshot in the hours preceding some recent \n\t\tterroristic assaults. And so, among all \n\t\tthese Arabs, men and women, there are the \n\t\tones responsible. But which ones are they? \n\t\tHow can we recognize them? Controlling \n\t\tdocuments is ridiculous: one who has \n\t\teverything in order is most likely to be \n\t\tthe terrorist.\n\n\tAn Algerian is being dragged away while protesting, kicking, and trying \n\tto free himself. And then the scene changes. There is another Casbah \n\texit, and an Algerian who is being searched.\n \n \t\t\t\tMATHIEU \n\t\t\t(smiling)\n\t\tNote the intuition of the cameraman. He \n\t\trealized that in that box, there had to \n\t\tbe something of interest, and he paused \n\t\tto focus it.\n \n\tThe picture is enlarged. The small box which the Algerian is carrying \n\ton his shoulder is seen in detail. It is opened. The box is swarming \n\twith snakes; the soldier who had wanted to examine it jumps backward.\n\n\tThe officers in the room burst into laughter.\n\n\t\t\t\tMATHIEU \n\t\t\t(laughing)\n\t\tMaybe the bomb was hidden right there, in \n\t\ta double bottom. Who knows? We'll never \n\t\tknow.\n \n\tUsing the barrel of his machine gun, a soldier has closed the box. A \n\tsnake has managed to jump out, and fallen to the ground. The people are \n\tterrified and move away. Others laugh, among them, Petit Omar, who \n\tseems to be an ordinary child enjoying himself. \n\n\t\t\t\tMATHIEU \n\t\tThat's enough, Martin ...\n\n\tThe lights are again switched on in the room. Mathieu is again next to \n\tthe desk, and waits a second until the buzz of comments subsides.\n\n\t\t\t\tMATHIEU\n\t\tWe must start again from scratch. The only \n\t\tinformation that we have concerns the \n\t\tstructure of the organization. And we \n\t\tshall begin from that ...\n\n\tHe takes a wooden pointer from the desk in order to illustrate the \n\tgraph, while he speaks with the tone and precision of a university \n\tprofessor.\n \n\t\t\t\tMATHIEU \n\t\tIt is a pyramid-like organization divided \n\t\tinto a series of sectors. At the top of \n\t\tthe pyramid is their General Staff. \n\n\tHe has moved near the blackboard, and taken some chalk, and slowly as \n\the speaks, he illustrates his speech. \n\n\t\t\t\tMATHIEU \n\t\tThe military commander responsible for \n\t\tthe executive body finds the right man \n\t\tand nominates him to responsibility for \n\t\ta sector: number one. Number one in his \n\t\tturn, chooses another two: number two and \n\t\tnumber three ... And so they form the \n\t\tfirst triangle.\n\n\tHe has written high on the board a number one and below it, with some \n\tspace between them, the numbers two and three. He unites the three \n\tnumbers with lines and forms a triangle. \n\n\t\t\t\tMATHIEU \n\t\tNow number two and number three choose, \n\t\tin their turn, two men each ... number \n\t\tfour and five, and so on ...\n \n\tMathieu writes the new numbers, spacing them on the next line. Then he \n\tunites two to four and five, and three to six and seven, forming two \n\tnew triangles.\n \n\tMathieu has written other numbers and unites them to those of the \n\tpreceding line and thus forms other triangles. Now the blackboard is \n\tcovered by a series of triangles that form a large pyramid.\n \n\t\t\t\tMATHIEU \n\t\tThe reason for this geometry is so that \n\t\tevery militant will know only three \n\t\tmembers in the entire organization: his \n\t\tcommander who has chosen him, and the two \n\t\tmembers that he himself has chosen ... \n\t\tContacts take place only by written \n\t\tinstructions ... That is why we do not \n\t\tknow our adversaries: because, in \n\t\tpractice, they do not even know each \n\t\tother.\n\n\tMathieu leaves the blackboard and moves near the officers. The tone of \n\this voice changes. The explanation is now finished. He gives \n\tdirections ... \n \n\t\t\t\tMATHIEU \n\t\tTo know them means to eliminate them. \n\t\tConsequently, the military aspect is \n\t\tsecondary to the police method. I know we\n \t\tare not fond of this word, but it is the \n\t\tonly word that indicates exactly the type \n\t\tof work that we must perform. We must \n\t\tmake the necessary investigations in \n\t\torder to proceed from one vertex to \n\t\tanother in the entire pyramid. The \n\t\treason for this work is information. The \n\t\tmethod is interrogation. And \n\t\tinterrogation becomes a method when \n\t\tconducted in a manner so as to always \n\t\tobtain a result, or rather, an answer. \n\t\tIn practice, demonstrating a false \n\t\thumanitarianism only leads to the \n\t\tridiculous and to impotence. I am \n\t\tcertain that all the units will \n\t\tunderstand and react accordingly. \n\t\tHowever, success does not depend solely \n\t\ton us. We need to have the Casbah at our \n\t\tdisposal. We must sift through it ... and \n\t\tinterrogate everyone. And here is where \n\t\twe find ourselves hindered by a \n\t\tconspiracy of laws and regulations that \n\t\tcontinue to be operative, as if Algiers \n\t\twere a holiday resort and not a \n\t\tbattleground. We have requested a carte \n\t\tblanche. But it is very difficult to \n\t\tobtain. Therefore, it is necessary to \n\t\tfind an excuse to legitimize our \n\t\tintervention, and make it possible. It \n\t\tis necessary to create it ourselves --\n\t\tthis excuse. Unless our adversaries will \n\t\tthink of it themselves, which seems to be \n\t\twhat they are doing.\n \n\n74\tALLEY UPPER CASBAH. OUTSIDE. DAY.\n \n \tIt is not a song, but a type of spoken chorus, an assembly of young \n\tvoices, words whispered from the throat, both high and low, and sudden \n\tsilent pauses. It is monotonous; but it is just such a repetition, \n\talways with the same pattern of tones -- high, low, then, silent -- \n\tthat manages to transform itself into a motif, reach an excited pitch, \n\tand acquire breadth and solemnity. The sound fills the alleys, rises \n\ttoward the long rectangle of sky, and moves farther away as if it were \n\tmeant to be heard by all.\n\n\tThe alley is narrow and sloping, with crumbling walls, tufts of grass,\n \tand refuse. It is located at the outer periphery of the Casbah -- the \n\tcountryside is in the background. An Algerian is walking with large \n\tsteps; a five-year-old child is behind him, moving quickly, stumbling \n\tfrom time to time on the pavement; although he does not cry, \n\toccasionally he calls to his father, who proceeds forward, and does not \n\tturn around. The chorus arises from behind them. It is incoherent. They \n\tstop in front of a door; they have arrived. The door gives way and they \n\tenter.\n \n\n75\tKORAN SCHOOL. INSIDE. DAY.\n \n\tA large room, like a shop or stable. Here too, on the ground and \n\tpavement, there are tufts of grass. It is cold. The walls are \n\tunplastered, the windows boarded. The roof is in sight, but not the \n\tbeams. The roof is made of tiles and covered with a coat of whitewash.\n \n\tThere are about twenty children, five to eight years old, seated on the \n\tfloor. The teacher is in front of them; he too is seated. He is \n\tprompting the verses in a low voice, almost in a whisper, and the \n\tchorus repeats it.\n \n\tThe Koran School: a bare, wobbling place.\n\n\tThe Algerian who has entered takes the child by his hand, and \n\taccompanies him to the teacher who is now standing; the chorus \n\tcontinues; the other children, do not look at the two who have just \n\tentered.\n \n\tThe Algerian and the teacher greet each other, bringing their hands to \n\ttheir hearts, and then to their mouths. At the same time, the teacher \n\ttakes an envelope from under his tunic, and hands it over to the other.\n \n\t\t\t\tSPEAKER \n\t\t\"To all militants! After two years of \n\t\thard struggle in the mountains and city, \n\t\tthe Algerian people have obtained a great \n\t\tvictory. The UN Assembly has placed the \n\t\tAlgerian question in its forthcoming \n\t\tagenda. The discussion will begin on \n\t\tMonday, January 28. Starting Monday, for \n\t\ta duration of eight days, the NLF is \n\t\tcalling a general strike.  For the \n\t\tduration of this period, all forms of \n\t\tarmed action or attempts at such are \n\t\tsuspended. We are requesting that all \n\t\tmilitants mobilize for the strike's \n\t\torganization and success.\"\n \n\tThe Algerian has hidden the envelope inside his tunic, then presents \n\tthe child to the teacher, who makes him sit down with the other \n\tchildren The teacher also returns to his place and sits down, and \n\tsuggests a new phrase; the chorus continues. The Algerian leaves the \n\tschool.\n \n\n76\tALLEY UPPER CASBAH. OUTSIDE. DAY.\n \n\tHaving passed through the door, he again moves along the alley, this \n\ttime descending, with hurried steps. The chorus continues, again heard \n\tfrom without, but its echo is now different.\n \n\n77\tVARIOUS VIEWS CASBAH. OUTSIDE/INSIDE. DAY.\n \n \tBars, stores, market stalls, \"Arab baths.\" Typewritten pieces of paper \n\tare used to wrap purchases, or slipped inside bags, or used on the \n\tblank side to add up bills and then handed to the customers.\n \n\n78\tVARIOUS VIEWS EUROPEAN CITY. OUTSIDE/INSIDE. DAY. \n\n\tIn the European city the Algerian workers: at the docks, the central \n\tgas company; on the trams; the waiters in the restaurants, in the bars; \n\tthe shoeshine men\n \n\t\t\t\tSPEAKER\n\t\t\"Algerian brothers! A great hope has \n\t\tarisen for us. The world is watching us. \n\t\tThe next few days may be decisive for our \n\t\tfuture and our freedom. The colonial \n\t\tpowers will attempt to demonstrate to the \n\t\tUN that the NFL does not represent the \n\t\twill of our people. Our response will be \n\t\tunanimous support of the general strike.\"\n \n\n79\tSEA-FRONT. OUTSIDE. DAY.\n \n \tAt the sea-front, there is a newspaper boy, about twelve years old, \n\tbarefoot. His voice is shrill yet cheerful. He is smiling.\n \n\t\t\t\tNEWSBOY \n\t\tLe Monde! Le Monde! General strike! ... \n\t\tStrike! \n\n\tSome Europeans buy the newspaper, half-heartedly, grumbling\n\tdisagreeably. The boy remains cheerful, places the change inside the \n\tbag strapped to his shoulder, thanks them.\n \n\tNow he passes in front of a beggar, an elderly Algerian who is leaning \n\tagainst a railing.\n\n\tThe boy winks at him, while he continues to shout:\n \n\t\t\t\tNEWSBOY \n\t\tStrike!\n\n\t\t\t\tSPEAKER\n\t\t\"During the eight days of the strike, do \n\t\tnot frequent the European city, or leave \n\t\tthe Casbah. Provide lodgings in your \n\t\thomes for the poor, the beggars, the \n\t\tbrothers who do not have homes. Store \n\t\tprovisions of food and water for eight \n\t\tdays!\"\n \n\n80\tCASBAH STREETS AND SHOPS. INSIDE/OUTSIDE. DAY.\n \n\tThere is a strange atmosphere in the Casbah. People are greeting each \n\tother in the streets; a thick buzz of voices, a festive mood, a sense \n\tof brotherhood, and the children, who are taking advantage of the \n\tsituation and play and run everywhere.\n\n\tThe shops are unusually crowded. The people enter and exit, loaded with \n\tsupplies. In the shops too, there is the same festive mood, almost as \n\tif the supplies were for a trip to the country. The shopkeepers are \n\talso cheerful.\n \n\tAnd the poor customers, instead of paying, hand over a ticket stamped \n\tNLF.\n \n \n81\tCASBAH BLOCKADE. OUTSIDE. DAY. SUNSET. SUNDAY. JANUARY 27, 1957.\n \n\tLate afternoon, at the blockades of rue de la Lyre, rue du Divan, and \n\true Marengo. The Casbah exit ramps are deserted, while the entrance \n\tramps are overflowing with people. Here too, there is an intangible air \n\tof gaiety, witty remarks, laughter, ironic glances toward the soldiers \n\tand policemen with cold faces, immobile -- helmets and machine guns --\n\twho stand at the entrances without intervening.\n \n\tThe image is shortened and focused through the lenses of binoculars.\n \n\n82\tGOVERNMENT PALACE. OUTSIDE/INSIDE. SUNSET. \n\n\tA paratrooper officer looks at the blockades of rue du Divan from a \n\tGovernment Palace balcony. Mathieu is beside him.\n \n\t\t\t\tMATHIEU \n\t\tNo one is leaving, eh?\n\n\tThe officer hands him the binoculars. \n\n\t\t\t\tOFFICER\n\t\tNo. They continue to enter, the rats.\n \n\tMathieu looks through the binoculars, and comments in a low voice, \n\tsmiling:\n \n\t\t\t\tMATHIEU \n\t\tRats in a trap, we hope ...\n\n\t\t\t\tOFFICER\n\t\tBut do you believe that the strike will \n\t\tbe widespread? \n\n\t\t\t\tMATHIEU \n\t\tWithout a doubt.\n \n \tBehind the two officers, through a large open window, a room is \n\tvisible. There is a large table, and around it, other high officers of \n\tthe various armed forces, and some important officials in plainclothes.\n\n\tA general, who has his back to the balcony, turns and calls Mathieu:\n \n\t\t\t\tGENERAL\n\t\tMathieu! Mathieu, a name ...\n\n\t\t\t\tMATHIEU \n\t\tA name?\n \n\t\t\t\tGENERAL\n\t\tYes, a name for the operation.\n \n\tMathieu moves the binoculars from the blockades and turns slowly around \n\tthe Government square, until he reaches an advertising sign for a brand \n\tof champagne which now, in the dusk, lights up with a sporadic rhythm: \n\tCORDON ... ROUGE.\n \n\tMathieu pauses then turns toward the room, and enters smiling:\n\n\t\t\t\tMATHIEU \n\t\tChampagne ... All right? \n\n\tThe general repeats absent-mindedly: \n\n\t\t\t\tGENERAL\n\t\tChampagne ... Champagne. \n\t\t\t(then, in a convinced voice) \n\t\tOperation Champagne, yes, alright.\n \n \n83 \tRUE DU DIVAN BLOCKADE. OUTSIDE. EVENING.\n \n\tAt the rue du Divan blockade, there is an incoherent, monotonous, and \n\tirritating chant. There is a blind beggar. He is light-complexioned, \n\ttall and thin, his beard long, his arms stretched out, a cane in his \n\thand. He arrives at last at the entrance ramp, tries to find the way, \n\tbut cannot. He tries again and again with his cane, continually \n\trepeating his sorrowful chant, until a policeman takes him by his free \n\thand, placing the hand roughly on the metal screen.\n \n \t\t\t\tPOLICEMAN\n\t\tGo on! Go on!\n \n\tThe beggar protests and waves his cane in a way that the policeman has \n\tto duck to prevent himself from being hit. The policeman curses, \n\tspitefully, coarsely.\n\n\tA soldier starts to laugh. The old man takes up his chant again, and \n\tmoves forward leaning on the metal screen. On the other side of the \n\tblockade, behind the square, there is a group of veiled girls who have \n\tseen the old man, and seem to be waiting for him.\n\n\tTwo of them go to meet him, and each one takes one of his arms. At the \n\ttouch of their hands, the old man is again infuriated. Even the girls \n\tlaugh. Then, one of them speaks to him slowly in a loud voice.\n\n\tIt seems that the old man has understood. He is convinced. He mumbles \n\tsomething kindly and lets them accompany him.\n \n\n84\tCASBAH ALLEY. FRONT DOOR. OUTSIDE. NIGHT.\n \n\tA poorly lit alley. A group of unemployed men and beggars are standing \n\tin front of a door.\n \n\tOne of the three companions consults a list, then points to two in the \n\tgroup. He signals them to enter.\n \n\n85\tKADER'S HOUSE. INSIDE. NIGHT.\n \n \tInner courtyard.\n \n\tIn the inner courtyard, there is an elderly man who awaits them and \n\treceives them kindly.\n \n\tThey greet each other in the customary Algerian manner.\n \n\tCourtyard and balcony.\n\n\tOn the terrace also, someone is looking toward the courtyard. Kader is \n\ton the terrace together with a man about forty years old, dressed in \n\tEuropean clothes, he has narrow shoulders and a sunken chest. His face \n\tis sensitive, his forehead high, and his hair and eyes black. His eyes \n\tare kind and thoughtful and twinkle with irony.\n\n\tHe is Ben M'Hidi, one of the four members of the CCE, the Central \n\tExecutive Committee.\n \n\t\t\t\tKADER \n\t\t\t(to him)\n\t\tThey are beggars and unemployed, homeless. \n\t\tWe have organized things in such a way \n\t\tthat during the strike they will be \n\t\tguests of other families who have homes \n\t\tand will provide shelter in the event of \n\t\tpossible reprisals ... But I didn't know \n\t\tthat they would be brought to this house \n\t\ttoo. It is a mistake.\n \n \t\t\t\tBEN M'HIDI \n\t\tWhy?\n \n\t\t\t\tKADER \n\t\tBecause you are here too. It would be \n\t\tbetter for you to move to another house.\n \n\tBen M'Hidi moves away from the parapet. \n\n\t\t\t\tBEN M'HIDI\n\t\tAll right ... You're the one who must \n\t\tdecide. \n\n\tKader follows him along the terrace.\n \n\t\t\t\tKADER \n\t\tNo, if I were the one to decide, you \n\t\twouldn't be in Algiers now.\n \n\tBen M'Hidi looks at him, smiling.\n \n\t\t\t\tBEN M'HIDI \n\t\tWhy? Isn't it wise?\n \n\tKader smiles too, and repeats:\n \n \t\t\t\tKADER \n\t\tIt isn't wise.\n \n\tAt the end of the terrace, there is a construction raised to a level \n\twith the stairs that lead to the floor below. There is a large room; \n\tthrough the open door, the lighted interior is visible. The walls have \n\thigh brick baseboards, and at the bottom of one of the four walls there \n\tis a square opening that leads into a hiding place. The closure of the \n\thiding place, a square of very thick wall, is placed to one side. Ali \n\tla Pointe is covering it with bricks.\n \n\tOn the other side of the room next to the door, there are some cement \n\twash-basins, and a shed for rain water. Kader appears at the door.\n \n\t\t\t\tKADER \n\t\tAli, you must accompany Ben M'Hidi to the \n\t\tMaison des Arbres.\n \n\tAli doesn't answer immediately. He finishes placing the last brick then \n\tturns to Kader.\n \n \t\t\t\tALI \n\t\tWhy? Isn't he sleeping here?\n \n \t\t\t\tKADER \n\t\tNo, it's better if he doesn't. The house \n\t\tis filled with new people.\n \n\tAli gets up, wipes his hands on his trousers, at the same time \n\tinspecting the work that he has just completed. \n\n\t\t\t\tALI \n\t\tHere's another one ready. What a hideout! \n\t\tIt really looks like a wall. I'll dirty \n\t\tit a bit, and it's perfect. Want to give \n\t\ta look inside?\n \n\tKader has taken a machine gun from one of the basins, and he tosses it \n\tto Ali, who catches it. \n\n\t\t\t\tKADER \n\t\tNo, go now. It's already late.\n\n\tThey go out on the terrace. Ali releases the catch of his machine gun \n\tso that the bullet slips into the barrel. \n\n\t\t\t\tKADER \n\t\t\t(to Ben M'Hidi)\n\t\tThey are a family of militants from way \n\t\tback. Everything will work out well, \n\t\tyou'll see ... C'mon, Ali, hurry up.\n\n\t\t\t\tBEN M'HIDI \n\t\tAlright. See you tomorrow.\n\n\tThey say good-bye, embracing one another. Ali has already climbed over \n\tthe terrace wall, and has jumped to the next one.\n\n\tBen M'Hidi follows him; he is less agile and moves with a bit of \n\ttrouble.\n\n\tFrom the parapet, Kader says to him:\n\n\t\t\t\tKADER \n\t\tPassing along the terraces only takes \n\t\tfive minutes ... and with Ali la Pointe, \n\t\tyou'll be safe ...\n\n\tWhile jumping, Ben M'Hidi loses his balance, and has to grab on to Ali \n\tto prevent himself from falling. \n\n\t\t\t\tBEN M'HIDI\n\t\tBut it's he who won't be safe with me ...\n\n\tThe two figures move away from terrace to terrace, and disappear in the \n\tdark.\n \n\n86\tCASBAH VIEWS AND TERRACES. OUTSIDE. NIGHT.\n \n\tIn the dark in front of them, a metallic reflection is visible and the \n\tsharp and aggressive sound of an Algerian voice is heard.\n\n\tAli responds to the password.\n \n\tA youth steps out from the shadows. He too is carrying a machine gun, \n\trecognizes Ali, and greets him. Ali and Ben M'Hidi continue ...\n \n\n87\tMAISON DES ARBRES, TERRACE. OUTSIDE. NIGHT. \n\n\tUntil they arrive at a terrace which is separated from the next one by \n\tan alley about ten feet wide. \n\n\t\t\t\tALI \n\t\tHere it is ... we've arrived ... \n\n\tBen M'Hidi glances at the emptiness beneath them, looks at Ali, and \n\ttakes a deep breath.\n \n\t\t\t\tBEN M'HIDI \n\t\tNot yet ...\n\n\tAli has climbed onto the parapet, looks around him concentrating \n\tattentively for a moment, and then jumps into the void, reaching the \n\topposite side. He bends, searches for something in the dark, and lifts \n\ta type of gangplank.\n \n\tHe hands it over to Ben M'Hidi, and together they place it between the \n\ttwo terraces.\n \n\t\t\t\tALI \n\t\tBe careful now. Unless you know how it \n\t\tworks, it's better if you sit on the plank \n\t\tand move forward like this ...\n\n\t\t\t\tBEN M'HIDI \n\t\tLet's try ...\n\n\tHe tries to stand up on the gangplank, but he lacks the necessary \n\tsteadiness. He can't hold his balance. He does as Ali has advised him; \n\the sits astride on the plank, and using the force of his arms, he \n\tpushes himself forward. He stops halfway to rest for a minute. \n\n\t\t\t\tBEN M'HIDI \n\t\tIt's good nobody is following us ...\n\n\t\t\t\tALI \n\t\tIt's a question of habit ...\n\n\tAnd when Ben M'Hidi is closer, Ali helps him to get down to the terrace.\n\n\t\t\t\tALI \n\t\tIt's better if I go first, to make sure \n\t\teverything's okay ...\n\n\tWithout waiting for an answer, he moves toward the stairway that leads \n\tto the floor below; his movements are silent and graceful.\n\n\tBen M'Hidi leans out from the terrace, and looks toward the European \n\tcity and the sea. At the port, two searchlights are lit, and their long \n\tbright rays move slowly toward the Casbah ...\n\n \tWhen Ali la Pointe returns, Ben M'Hidi is still leaning on the railing. \n\tHe seems not to hear the sound of Ali's footsteps, or his voice.\n \n\t\t\t\tALI \n\t\tEverything's okay ... They're waiting for \n\t\tyou ...\n\n\tAli moves near him, and Ben M'Hidi turns and looks at him. \n\n\t\t\t\tBEN M'HIDI \n\t\tWhat do you think of the strike, Ali? \n\n\t\t\t\tALI \n\t\tI think it'll be a success ...\n\n\t\t\t\tBEN M'HIDI\n\t\tYes, I think so too ... It's been \n\t\torganized well ... But what will the \n\t\tFrench do?\n      \n\tBoth the question, and the answer seem obvious to Ali. \n\n\t\t\t\tALI \n\t\t\t(shrugging)\n\t\tIt's clear. They'll do everything \n\t\tpossible to make it fail.\n \n \t\t\t\tBEN M'HIDI\n\t\tNo, they'll do even more. We've given \n\t\tthem the opportunity to do a lot more ... \n\t\tDo you understand what I mean? Starting \n\t\ttomorrow, they won't be groping in the \n\t\tdark any more; every shop and every \n\t\tworker who strikes will be a known enemy, \n\t\ta self-confessed criminal ... And they \n\t\twill be able to pass to the offensive. \n\t\tHave you thought of this?\n \n\tAli has listened attentively. The effort with which he is trying to ask \n\thimself the meaning of these words is visible on his face.\n \n\t\t\t\tALI \n\t\t\t(shaking his head)\n\t\tNo ...\n \n \t\t\t\tBEN M'HIDI\n\t\tBut Kader told me that you weren't in \n\t\tfavor of the strike.\n \n \t\t\t\tALI \n\t\tNo, and neither were my men. \n\n \t\t\t\tBEN M'HIDI\n\t\tWhy?\n \n\t\t\t\tALI \n\t\tBecause they told us that we mustn't use \n\t\tweapons, now, when the time is right.\n\n \t\t\t\tBEN M'HIDI\n\t\tThat's true ... Wars aren't won with \n\t\tterrorism, neither wars nor revolutions. \n\t\tTerrorism is a beginning but afterward, \n\t\tall the people must act ... This is the \n\t\treason for the strike, and its necessity: \n\t\tto mobilize all Algerians, count them and \n\t\tmeasure their strength ...\n\n\t\t\t\tALI \n\t\tTo show them to the UN, right?\n \n \t\t\t\tBEN M'HIDI \n\t\t\t(smiling slightly)\n\t\tYes ... yes. The problem also involves the \n\t\tUN. I don't know what it's worth, but this \n\t\tway, we'll give the UN the possibility of \n\t\tevaluating our strength. \n\n\tAli breathes deeply, instinctively, unrestrainedly, Ben M'Hidi watches \n\thim, smiles, and says:\n \n \t\t\t\tBEN M'HIDI\n\t\tDo you know something Ali? Starting a \n\t\trevolution is hard, and it's even harder \n\t\tto continue it. Winning is hardest of all. \n\t\tBut only afterward, when we have won, \n\t\twill the real hardships begin.\n \n\tHe pats Ali's back fondly with his hand and continues, smiling:\n\n\t\t\t\tBEN M'HIDI\n\t\tAnyway, there's still a lot to be done \n\t\t... you aren't already tired, Ali, are \n\t\tyou?\n \n\tAli looks at him, and without reacting to his irony: \n\n\t\t\t\tALI \n\t\t\t(with conviction)\n\t\tNo!\n \n\n88 \tVARIOUS HOUSES. CASBAH. OUTSIDE. DAWN. JANUARY 28, 1957. \n\n\tIt is gray and smoky dawn, a slow reabsorption of the night, an opaque \n\tlight which is diffused, sprayed, frozen, to transparency, and \n\trediscovers its outlines and perspectives; and finally, the sun, golden \n\tlight, awakens all Algiers. To the north, the sea. To the south, the \n\tmountains and the Casbah, situated halfway along the coast. The Casbah, \n\tstill, inert, expectant, on this first day of the strike ...\n\n\tThe paratroopers are already at their places, one after another, at \n\tequal distances like links of a very long chain, strung through every \n\talley, spreading to every sidestreet, twisting through the squares, \n\tclimbing up the stairways, dividing, joining, and lengthening again. \n\tThe silence is perfect; the camouflaged immobile forms seem to be part \n\tof the landscape.\n\n\tThen a brief and sharp hiss, a hundred whistles together. \n\n\tA signal releases the still forms: the attack begins. \n\n\tDoors are beaten down, shots, screams, rifle fire, machine gun fire; \n\tthe doors opened or broken down; the courtyards, the houses, the rooms, \n\tinvaded; the men who are trying to escape and who protest and try to \n\tsave themselves.\n \n \t\t\t\tVOICES\n\t\tOf course ... I was just going to work ...\n \n\n89\tBEN M'HIDI'S HIDING PLACE. INSIDE. DAWN.\n\n\tBen M'Hidi is inside the hiding place. From outside, an old man helps \n\thim to place the square piece of wall over the entrance, and then, in \n\tthe spaces between the bricks, he adds a paste of plaster mixed with \n\tcoal dust. When the paras arrive, everything is in order.\n\n\tStill men are being seized, beaten, dragged; a cache of weapons; men \n\tpushed down the stairs:\n \n\t\t\t\tSOLDIERS \n\t\tGo on, go on, you little rats! Get to \n\t\twork!\n\n\n90\tCASBAH. STREETS. OUTSIDE. MORNING.\n \n\tWomen are clinging together after the beatings. \n\n\tSomeone is fleeing toward the terraces. We hear the deafening whirl of \n\tthe helicopters flying against the wind, their cabin doors open, paras \n\tsitting on both sides with their legs dangling out, their machine guns \n\ton their knees, a loudspeaker for every helicopter, microphones turned \n\ton in such a way that the din of the motors is multiplied a hundred \n\ttimes.\n \n\tThe helicopters fly low again, they skirt the terraces. \n\n\tThe Algerians are fleeing in terror, the uproar begins to fade away, is \n\tless intense; microphones are turned on, and off. The terraces are \n\temptied, men seized, beaten, dragged; all the men are forced outside in \n\tthe alleys, the streets, the squares, every man is forced to face the \n\twall, his hands up.\n \n\n91\tSHOPS. DOORS UNHINGED. OUTSIDE. MORNING.\n \n \tA truck in reverse, a rope fastened to the hub of the wheels, its other \n\tend to a door-latch. The motor is accelerated, clouds of exhaust \n\tfumes ...\n\n\tDoor latches pried open like lids of sardine cans, shop windows smashed \n\twith machine-gun butts, the counters, the shelves, flung into the air, \n\tthe merchandise thrown into the streets; a game, a frenzied \n\texcitement ...\n\n\tThe Algerians watch, but can not intervene. Some shopkeepers rush to \n\tthe scene, crying despairingly, while others are dragged away forcibly, \n\ttossed about, slapped, pushed, forced to open their shops.\n \n\n92\tCANDY SHOP. INSIDE. MORNING.\n \n \tA shopkeeper is pushed behind the counter; he gets up, trembling with \n\tfear.\n \n\tA para asks him for a bag of candy, pays politely, smiles, pats his \n\tbald head, and asks him sweetly:\n \n\t\t\t\tPARA \n\t\tAnd the strike, my friend?\n \n\tThen he distributes the candy among the children who are outside.\n \n\n93\tCANDY SHOP. OUTSIDE. MORNING.\n \n \tThe children take the candy silently, without thanking him, then eat \n\tthe candies slowly, their faces unfriendly and cold ...\n \n\n94\tPLACE DU GOUVERNEMENT. OUTSIDE. MORNING.\n \n\tThe black sky, the trees, the advertising signs ... Cordon Rouge ...\n\t... an equestrian statue, a car radio, a loudspeaker. \n\n\t\t\t\tLOUDSPEAKER\n\t\t\"Attention, people of the Casbah! The NLF \n\t\twants to stop you from working. The NLF \n\t\tforces you to close your shops. \n\t\tInhabitants of the Casbah, rebel against \n\t\ttheir orders. France is your country. \n\t\tFrance has given you civilization and \n\t\tprosperity: schools, streets, hospitals. \n\t\tPeople of the Casbah, show your love for \n\t\tyour mother country, by disobeying the \n\t\tterrorists' orders. Algerians, return to \n\t\twork!\"\n\n\tAnd then Algerian music, a cheerful and rhythmical melody; the \n\tAlgerians are forced out of the Casbah in columns, and are pushed \n\ttoward the military trucks which clutter the southern side of the \n\tsquare, and continue to arrive and depart.\n \n\n95\tCASBAH. EXIT. OUTSIDE. MORNING.\n\n\tMeanwhile the paras of the psychological divisions make their first \n\tselection, randomly, or else deliberately, basing them on the slightest \n\tsuspicions. They evaluate each man by his appearance or behavior. They \n\tblock the Algerians from the exit ramp, and assault them with a battery \n\tof questions: \n\n\t\t\t\tPARA'S VOICES\n\t\tWho are you? What's your name? Occupation? \n\t\tWhere do you work? Why did you strike?\n \t\tThey forced you, eh? ... No ... Tell the \n\t\ttruth! You promised them, right? Then \n\t\tyou're the one who wants to strike. Do \n\t\tyou belong to the NLF? C'mon, answer me! \n\t\tAre you afraid to say it? Never mind, it \n\t\tdoesn't matter.\n \n\tThe Algerian does not answer, but stares into the para's eyes. The para \n\tturns to his companions and shouts:\n \n\t\t\t\tPARA \n\t\tJacques! ... Jacques! ... Another one to \n\t\theadquarters! \n\n\tThe Algerian is seized, and pushed toward the truck.\n\n\t\t\t\tLOUDSPEAKER\n\t\t\"Attention, Algerians! The NLF wants to \n\t\tstop you from working. The NLF forces you \n\t\tto close your shops. The NLF wants to \n\t\tstarve you and condemn you to misery. \n\t\tAlgerians, return to work ... !\"\n \n\n96\tTHE PORT. OUTSIDE. DAY. \n\n\tThe port is deserted, the cranes still. A loaded ship sways lazily at \n\ther moorings, the fork-lifts are filled with supplies ...\n\n\tThe limestone is dried out, the bridges empty, dangling cables swing \n\tslowly from the pulleys. There is silence in the docks ...\n\n \tThen, the sound of motors approaching, clouds of dust, Arabs pushed out \n\tof the trucks, into the shipyard.\n \n\n97\tSTREETS OF ALGIERS. OUTSIDE. DAY. \n\n\tIn the streets of the European city, there is an atmosphere of fear and \n\tdoubt. The shop windows have their shutters lowered halfway, the \n\tshopkeepers are standing in the doorways, ready to close.\n\n\tThe front doors of houses are shut. There are a few hurried passersby \n\tbut no automobiles; the trams are not running; on the sidewalks the \n\tgarbage is piled high, nearby the long brooms of the Algerian street \n\tcleaners. \n\n\t\t\t\tPARAS\n\t\t\t(yelling)\n\t\tSweep, mes enfants, sweep.\n\n\tAn Algerian with a very refined expression, a gentle appearance, says, \n\twhile excusing himself: \n\n\t\t\t\tALGERIAN \n\t\tI don't know how, sir, I'm sorry ...\n\n\tThey shove the broom into his hands, and shout to him:\n \n\t\t\t\tPARA \n\t\tLearn!\n\n\t\t\t\tLOUDSPEAKER\n\t\t\"French citizens! Europeans of Algiers! \n\t\tThe strike called by the NLF is a failure. \n\t\tDo not be afraid. Return to your jobs. \n\t\tGeneral Massu guarantees your safety. \n\t\tThe Army will protect you!\"\n \n\n98\tSTREETS OF ALGIERS. OUTSIDE. DAY.\n \n\tA jeep with loudspeaker precedes a row of military trucks loaded with \n\tAlgerians.\n\n\tIn every truck there are two paras carrying machine guns by their \n\tsides. The Algerians are standing crowded together one against the \n\tother. Some of them are holding banners and signs:\n \n\t\tI AM GOING TO WORK BECAUSE I AM FREE. \n\n\t\tWE ARE FREE.\n\n\t\tARMY-POPULATION-PEACE. \n\n\t\tTHE ARMY PROTECTS OUR RIGHTS.\n\n \tThe trucks turn a corner, a youth jumps from the last truck, falls, \n\tgets up again, and breaks into a run.\n\n\tThe paras shout to him to stop, their voices mix with that of the \n\tloudspeaker.\n \n\tThe Algerian continues to run.\n\n\tA burst of machine-gun fire, then another.\n\n\tThe Algerian jerks forward, his back curved, his arms raised. \n\n\tHe falls down.\n \n\n99\tCOMMISSIONER'S OFFICE. PRESS ROOM AND STAIRWAY. INSIDE. DAY.\n \n\tNoise, confusion in the Commissioner's office press room, ticking of \n\tthe teletype machines, throngs of journalists in the telephone room. \n\tThey are trying to transmit the first news. \n\n\tVARIED VOICES.\n      \n\tShouting in every language is heard.\n \n \t\t\t\tA JOURNALIST\n\t\tWe are now in the fourth day and the \n\t\tstrike continues, with total support by \n\t\tthe Arab population. The city is very \n\t\tcalm. However -- Calm ... Are you deaf? \n\t\tThe city is peaceful. In the Moslem \n\t\tquarters, in the outskirts of the city, \n\t\tin the Casbah ... Bye, will call again, \n\t\tI'm busy.\n \n\tThrough the open door, Mathieu can be seen passing, accompanied by \n\tanother officer. Some journalists see him, and rush behind him. Some \n\tothers follow, four or five in all, trying to stop him.\n\n\t\t\t\tJOURNALISTS \n\t\tColonel, colonel ... Excuse me, colonel, \n\t\ta statement ... We don't know anything ... \n\t\tYou promised us a press conference ...\n\t\tNow there is a meeting with the \n\t\tCommissioner. \n\n\t\t\t\tFIRST JOURNALIST\n\t\tWill you tell us what is happening? \n\n\t\t\t\tMATHIEU \n\t\tNothing. Absolutely nothing. We are still \n\t\tweighing the situation.\n\n\tThey move to the landing and begin to ascend the stairway that leads to \n\tthe second floor. The journalists have difficulty keeping up with \n\tMathieu.\n \n\t\t\t\tMATHIEU \n\t\tLook around. I've put everything at your \n\t\tdisposal. Go take a look with your own \n\t\teyes.\n\n\t\t\t\t2ND JOURNALIST\n\t\tThe strike is a success; but ...\n\n\t\t\t\tMATHIEU \n\t\tNo. It has failed in its objective. \n\n\t\t\t\t1ST JOURNALIST\n\t\tInsurrection? \n\n\t\t\t\tMATHIEU \n\t\tInsurrection.\n \n\t\t\t\t2ND JOURNALIST \n\t\tBut the NLF has always spoken of a strike \n\t\tas a demonstration ...\n\n\t\t\t\tMATHIEU \n\t\tAnd you believe the NLF?\n \n\t\t\t\t2ND JOURNALIST \n\t\tThey seemed to be plausible this time. A \n\t\tgeneral strike is a good argument for the \n\t\tUN.\n\n\t\t\t\tMATHIEU \n\t\tThe UN is far away, dear sir. It is easier \n\t\tto make oneself heard with bombs. If I \n\t\twere in their place, I would use bombs. \n\n\t\t\t\t1ST JOURNALIST\n\t\tArmed insurrection ... but what is it \n\t\texactly?\n \n \t\t\t\tOFFICER\n\t\tIt is an armed insurrection ...\n\n\tThey have arrived at the second-floor landing, hurry along, and stop in \n\tfront of a large door, where there is a written sign: PREFECT. Mathieu, \n\tat the same time, has continued speaking.\n \n \t\t\t\tMATHIEU \n\t\tIt is an inevitable stage in revolutionary \n\t\twar; from terrorism, one passes to \n\t\tinsurrection ... as from open guerrilla \n\t\twarfare one passes to real war, the latter \n\t\tbeing the determining factor ...\n \n\t\t\t\t3RD JOURNALIST\n\t\tDien Bien Phu? \n\n\t\t\t\tMATHIEU \n\t\tExactly.\n \n \tMathieu glances at the journalist, as if to see if there were any irony \n\tin his remark, but the journalist's face is expressionless.\n \n\t\t\t\tMATHIEU \n\t\tIn Indochina, they won. \n\n\t\t\t\t3RD JOURNALIST \n\t\tAnd here? \n\n\t\t\t\tMATHIEU \n\t\tIt depends on you.\n \n\t\t\t\t4TH JOURNALIST \n\t\tOn us? You aren't thinking of drafting us \n\t\tby any chance, are you, colonel?\n\n\tMathieu leans his hand on the door handle and smiles at the \n\tjournalists.\n\n \t\t\t\tMATHIEU \n\t\tNo! We have enough fighters. You have \n\t\tonly to write, and well, if possible.\n\n\t\t\t\t1ST JOURNALIST \n\t\tWhat's the problem then?\n\n\t\t\t\tMATHIEU \n\t\tPolitical support. Sometimes it's there, \n\t\tsometimes not ... sometimes, it's not\n\t\tenough. What were they saying in Paris \n\t\tyesterday?\n\n\t\t\t\t5TH JOURNALIST\n\t\tNothing ... Sartre has written another \n\t\tarticle ...\n\n\tMathieu gestures and makes an expression as if to say: \"see what I \n\tmean?\" At the same time, he opens the door. But before entering, he \n\tturns again to the journalists. \n\n\t\t\t\tMATHIEU \n\t\tWill you kindly explain to me why all the \n\t\tSartres are always born on the other side?\n\n\t\t\t\t5TH JOURNALIST\n\t\tThen you like Sartre, colonel ... \n\n\t\t\t\tMATHIEU \n\t\tNot really, but he's even less appealing \n\t\tas an enemy.\n \n\n100\tPLACE DU GOUVERNEMENT AND RUE DU DIVAN BLOCKADE. OUTSIDE. SUNSET.\n \n\tPlace du Gouvernement, dusk, the other side of the blockade is silent, \n\tonly the uncovered eyes of the Algerian women who await their men.\n \n\tThe trucks continue to arrive: the men are forced to descend and \n\tallowed to enter the Casbah. There is an atmosphere of sadness, for not \n\tall the men have returned. The women look at them, scrutinize their \n\tfaces, from the first to the last in one glance, then slowly ... one \n\tface at a time. Some women recognize their husbands, or their brothers \n\tor their sons, and run to meet them ... \n\n\tBut others continue to ask for news in lowered, sorrowful voices.\n \n\t\t\t\tAD-LIB VOICES \n\t\tHave you seen Mohamed? Where? When? Why\n\t\thasn't he returned?\n \n\tA steady hum of voices in Arabic; then the monotonous voice of a \n\tpoliceman who speaks in the microphone of the loudspeaker.\n \n\t\t\t\tLOUDSPEAKER \n\t\t\"The NLF wants to stop you from working. \n\t\tThe NLF forces you to close your shops, \n\t\tinhabitants of the Casbah, disobey their \n\t\torders. France has given you civilization \n\t\tand prosperity: schools, streets, \n\t\thospitals. People of the Casbah! Show your \n\t\tlove for your mother country by disobeying \n\t\tthe terrorists' orders.\"\n \n\tThe loudspeaker is attached to one of the blockade posts, and from it a \n\tlong wire for the microphone is hanging. The policeman has a raspy and \n\tbored voice; he stops speaking and leans the microphone on the table in \n\tfront of him. He gets up, lights a cigarette, and moves away a few \n\tsteps.\n \n\tTwo children are among the women and behind the wooden horses \n\tbarricades. They were waiting for this moment.\n \n\tThey bend, seem to be playing, but one of them lifts the barbed wire\n \tas high as he can, from the ground. Petit Omar passes a wire \n\tunderneath, its farthest end bent in the form of a hook. He moves it \n\ttoward the microphone cord which is lying coiled on the ground. He \n\tsucceeds in clasping it and pulls it toward him slowly. The cord  \n\tunwinds, lengthens, stretches, until the microphone on the table begins \n\tto move, until it reaches the edge of the table, and falls ...\n\n\tThe noise re-echoes in the loudspeaker, but no one pays any attention \n\tto it.\n \n\tPetit Omar waits a second, then begins to pull again. \n\n\tThe microphone is dragged along the ground -- a humming sound -- it \n\tmoves nearer, inch by inch, forward, under the barbed wire, until the \n\tchildren are able to take it, and disappear with it behind the women.\n \n\t\t\t\tLOUDSPEAKER \n\t\t\"Algerians! Brothers! Do not be afraid! \n\t\tAlgeria will be free. Be courageous, \n\t\tbrothers! Resist! Do not listen to what \n\t\tthey are telling you ... Algeria will be \n\t\tfree ...\"\n \n\tThe voice is not violent, but gentle, somewhat breathless and hurried. \n\tIt extends to the whole square, so that all can hear it well: the \n\tpeople stop what they are doing to listen. They are emotional, proud, \n\tor angry, and look toward the sky where the voice seems to be diffused, \n\tas if those words should be written up above.\n\n\tThe officer is slow to realize what has happened, looks at the \n\tloudspeaker, the cord, and now grabs it, cursing. He pulls and tugs it; \n\tthe wire yields, and he wrenches it from the microphone.\n \n\t\t\t\tLOUDSPEAKER \n\t\t\"Brothers--\" \n\n\tThe voice is no longer heard, nothing more, silence. \n\n\tSilence, only that something is changed in the women's eyes. The veils \n\tthat cover the lower half of their faces suddenly begin to tremble, \n\tsway as if shaken by a breath, a light wind. There is no longer an \n\tatmosphere of sadness, or silence.\n \n\tJU-JU.\n\n\tThe ju-jus attack the air, invade it, shake it, make it vibrate as if \n\tthey were electric charges, or the sound produced by the wind on a \n\tfield of dry reeds, or the sound produced by a hundred, a thousand \n\tfingernails that are scratching a window pane ...\n \n\n101\tHEADQUARTERS. PARA. OUTSIDE. DAY.\n\n\t\t\t\tPARA \n\t\tOne, two, three, four ... Inside! C'mon!\n \n\tThe five Algerians indicated are forced to get up, taken, pushed, and \n\tbrought inside a large deserted house which is the paras' headquarters.\n \n\tThe other Algerians, about a hundred of them, are sitting on the \n\tground, in the clearing in front of the house, and the paras of the \n\tfirst regiment continue to guard them with pointed machine guns ...\n\n\tSuddenly from the villa, the music of a French song comes forth at full \n\tblast.\n \n\tThe Algerians look at each other nervously. Even a young para seems to \n\tbe upset.\n \n\t\t\t\t1ST PARA \n\t\t\t(turning to other para)\n\t\tWhat are they doing?\n \n \t\t\t\t2ND PARA \n\t\t\t(smiling)\n\t\tDancing inside ...\n \n\n102\tHEADQUARTERS. VILLA. INSIDE. DAY. \n\n\tA para rushes through a corridor carrying a tape recorder, enters a \n\troom where there are some sergeants and an Algerian.\n\n\tThe adjoining room with white tiled walls and a sink is visible through \n\tan open door. Two paras are sitting on the floor, smoking and chatting \n\tbetween themselves in whispers. \n\n\tThe para places the tape recorder on the table. The Algerian is naked \n\tto the waist. Signs of torture are visible. His face is swollen and \n\twet. The sergeant places the chair near him, and helps him to sit down, \n\tthen starts the tape recorder. He says to the Algerian who is \n\ttrembling:\n \n\t\t\t\tSERGEANT\n\t\tGo ahead! C'mon ... Repeat everything \n\t\tfrom the beginning, and then we'll let \n\t\tyou go. Name ...\n \n\t\t\t\tALGERIAN \n\t\tSid Ahmed.\n \n\t\t\t\tSERGEANT\n\t\tSecond name.\n \n\t\t\t\tALGERIAN \n\t\tSail.\n \n\t\t\t\tSERGEANT\n\t\tWhich \"district\" do you belong to? \n\n\t\t\t\tALGERIAN \n\t\tSecond district ...\n\n\t\t\t\tSERGEANT\n\t\tSecond district ... Explain better ...\n\n\t\t\t\tALGERIAN \n\t\tSecond district, Casbah, West Algiers.\n \n\t\t\t\tSERGEANT\n\t\tWhat \"group\"? \n\n\t\t\t\tALGERIAN \n\t\tThird group.\n\n\t\t\t\tSERGEANT\n\t\tThird group. What's your assignment? \n\n\t\t\t\tALGERIAN \n\t\tUh ... responsible for the sixth section.\n \n\n103\tVILLA. HEADQUARTERS. INSIDE. DAY.\n \n \tIn a room on the ground floor, a captain is bent over a large map with \n\tgraphs, and is writing the name Sid Ahmed Sail in one of the blocks at \n\tthe bottom of the pyramid ...\n \n\tAt the same time, paras are seen through the large window, bringing \n\tother Algerians to the villa, and immediately afterward, the music and \n\tsong are heard again very loudly.\n \n\n104\tCASBAH ALLEY. OUTSIDE. NIGHT. \n\n\tNight, darkness, locked doors. The Casbah is silent. The paras tread \n\tnoiselessly on their rubber soles. Patrols. \n\n\tA flashlight searches for the number of a door, then stops. A para \n\tknocks discreetly. \n\n\tNOISES INSIDE. VOICES.\n\n\t\t\t\tALGERIAN VOICE\n\t\tWho is it?\n \n \t\t\t\tPARA\n\t\tSid Ahmed ... Sid Ahmed Sail.\n \n\tThe door is opened, the paras break in.\n \n\n105\tANOTHER ALLEY. CASBAH. OUTSIDE. NIGHT.\n \n\tAnother alley in the Casbah, other paras. \n\n\tAnother door forced open, broken into.\n \n\tAlgerians are crowded together in a courtyard which is illuminated with \n\telectric flares. \n\n\tThey are being interrogated.\n \n\n106\tCASBAH STREET. OUTSIDE. DAY. RAIN. \n\n\tA cloudy day, a light drizzle, a sloping street, Algerian music. A \n\tcompany of zouaves walk two by two in the Casbah, through the alleys, \n\tstop, play their music, and move on again, alternating Algerian music \n\tand a French song.\n\n\tBehind them, a line of donkeys with baskets full of packages and bags, \n\tand cheerful paras who are joking, as they distribute the supplies to \n\tthe starving women and children, who stand ashamed in front of their\n\thouses, their eyes lowered, their gestures too brusque, and hesitant.\n \n\t\t\t\tSPEAKER\n\t\t\"At the General Assembly of the United \n\t\tNations, none of the motions presented in \n\t\tthe course of the debate has obtained the \n\t\tnecessary majority. At last an agreement \n\t\thas been reached on a resolution that \n\t\texcludes any form of direct intervention \n\t\tby the UN in the Algerian question. The \n\t\tAssembly of the United Nations has limited \n\t\titself to expressing the hope that in a \n\t\tspirit of cooperation, a peaceful, \n\t\tdemocratic, and just solution will be \n\t\tfound, that conforms to the principles of \n\t\tthe United Nations Charter ...\"\n \n\tThe monotony of the last words is drowned out and lost. It is raining \n\tmore heavily now. The water has begun to run along the sloping alleys. \n\tThe walls are gray, wet; the doors of the cafes and shops are barred \n\twith signs nailed upon them. \n\n\t\tTHIS SHOP HAS SUPPORTED THE NLF STRIKE. \n\t\tTHE PREFECT HAS ORDERED ITS CLOSING UNTIL \n\t\tFURTHER INSTRUCTIONS. \n\n\tThe band of zouaves has stopped again, and now they are playing \"La vie \n\ten rose.\"\n \n\n107\tVILLA HEADQUARTERS. INSIDE. DAWN.\n \n \tIn some parts of the villa a gramophone is playing \"La vie en rose.\"\n \n\tIn the room on the first floor, through the large window, the whiteness \n\tof the dawn is visible. The desk is cluttered with beer cans and \n\tthermos. Mathieu and other officers have their eyes fixed on the graph, \n\twhere the captain is marking other small crosses at the bottom of the \n\tpyramid. The scene is motionless; their expressions are dull. Everyone \n\tseems to be incapable of movement, overcome by the dull apathy that\n\talways follows a sleepless night.\n\n\tUntil Mathieu breaks the stillness of the scene. \n\n\t\t\t\tMATHIEU\n\t\tGood ... Good work ... Now we can all go \n\t\tto sleep. \n\n\tAnd moving together with the others, he continues.\n \n\t\t\t\tMATHIEU \n\t\tThe end of the strike doesn't change \n\t\tanything. The directives remain the same. \n\t\tGive your men the usual shifts. We must \n\t\tremain in the Casbah: twenty-four hours a \n\t\tday! \n\n\tHe turns and points to the graph. \n\n\t\t\t\tMATHIEU \n\t\tWe must cling to it, and work fast!\n\n\tThen he turns to the officers and smiling, says in another tone of \n\tvoice:\n \n\t\t\t\tMATHIEU \n\t\tHave any of you ever had a tapeworm?\n \n\tThe officers say \"no\" and laugh.\n\n\t\t\t\tMATHIEU \n\t\tThe tapeworm is a worm that can grow to \n\t\tinfinity. There are thousands of segments. \n\t\tYou can destroy all of them; but as long \n\t\tas the head remains, it reproduces itself \n\t\timmediately. It is the same thing with the \n\t\tNLF. The head is the General Staff, four \n\t\tpersons. Until we are able to eliminate \n\t\tthem, we must always start again from the \n\t\tbeginning.\n\n\tWhile he is speaking, Mathieu takes his wallet from his back pocket, \n\topens it, takes out four photos.\n\n\t\t\t\tMATHIEU \n\t\tI found these in the police archives. \n\t\tThey are old shots, but I made some \n\t\tclose-ups. Ramel ... Si Mourad ... \n\t\tKader ... Ali la Pointe. We must print a \n\t\tthousand copies and distribute them to \n\t\tthe men.\n \n\tMeanwhile, the photos are passed around.\n\n\tThere are photos taken from identification cards, or blown up from some \n\tgroup shots, figures somewhat blurred, faded, smiling, peaceful ...\n \n\n108\tNLF LEADERS' HIDING PLACE. INSIDE. DAY.\n \n\tIn the dim light, the four faces are barely illuminated. The shadows \n\ttone down their expressions: Kader, Ali la Pointe, Ramel, Si Mourad. \n\tThey are crowded into the hiding place, sitting on the floor, \n\tmotionless, their eyes staring straight ahead, their breathing heavy. \n\tFrom outside, noises, voices that are fading in the distance. Silence. \n\n\tThen, a discreet knock, a remark in Arabic.\n \n\tThe four breathe deeply, look at each other, then smile a little.\n\n\tAli unslips the beam which, placed through an iron ring, is holding \n\tshut the door of the hiding place. Using the soles of his feet, he \n\tpushes against the square of wall: the light enters violently. It is \n\tnot electric light, but daylight.\n \n\tKader blinks his eyes to accustom them to the light, then goes out on \n\tall fours; after him, Ramel, and then the others. They leave the hiding \n\tplace that Ali built in the wash-house on the terrace.\n \n\n109\tCOMPLEX OF KADER'S HOUSE. OUTSIDE. DAY. \n\n\tAll of them have machine guns. Ramel is very tall and robust, about \n\tthirty years old.\n \n\tSi Mourad is slightly older than Ramel. His movements are slow and \n\tprecise; his glance expresses patience and authority. Djamila is \n\twaiting for them.\n \n\t\t\t\tDJAMILA \n\t\tYou can come out. Thank God. There were so \n\t\tmany this time, about ten.\n\n\tAli recloses the hiding place.\n \n \t\t\t\tKADER \n\t\tParatroopers? \n\n\t\t\t\tDJAMILA \n\t\tYes.\n \n \t\t\t\tKADER \n\t\tWhat do you think? Did they come here on \n\t\tpurpose or by accident?\n \n\t\t\t\tDJAMILA \n\t\tNo. By accident. They asked some questions, \n\t\tbut they didn't touch anyone.\n \n\tAli has come out of the wash-house. The sun is high, and helicopters \n\tare seen passing one another in the sky. On some faraway terraces, \n\tbivouacs of paras are visible. They are guarding the Casbah from above.\n\t\n\tThe rumble of motors and the voice of the loudspeaker are heard more \n\tclearly as they near the house.\n \n\t\t\t\tLOUDSPEAKER\n\t\t\"Attention! Attention! Inhabitants of the \n\t\tCasbah! The terrorist Ben Amin has been \n\t\texecuted this morning. Qrara Normendine \n\t\thas been arrested. Boussalem Ali has been \n\t\tarrested. Bel Kasel Maussa has been \n\t\tarrested. Inhabitants of the Casbah! The \n\t\tNFL has been defeated. Rebel against the \n\t\tremaining terrorists who want to force \n\t\tyou to continue a bloody and futile \n\t\tstruggle. People of the Casbah, the \n\t\tterrorist Ben Amin has been executed. \n\t\tHelp us to build a free and peaceful \n\t\tAlgeria. Inhabitants of the Casbah, the \n\t\tNLF has been defeated. Rebel against the \n\t\tremaining terrorists who want to force \n\t\tyou to continue a bloody and futile \n\t\tstruggle. Attention! Attention! \n\t\tInhabitants of the Casbah! The terrorist \n\t\tBen Amin has been executed this morning. \n\t\tQrara Normendine has been arrested. \n\t\tBoussalem Ali has been arrested. Bel \n\t\tKasem Moussa has been arrested. \n\t\tInhabitants of the Casbah -- the NLF has\n\t\tbeen defeated ...\"\n \n \tThe voice fades away and is no longer heard. At the same time, a woman \n\thas come up from the floor below, carrying a tray of cups and a teapot.\n\n\tAli looks at her quickly, but then watching her more closely, he sees \n\tthat she is crying. When she passes near him, he stops her, places his \n\thand kindly on her shoulder, and asks her in Arabic why she is crying.\n\n \tDIALOGUE IN ARABIC BETWEEN ALI AND WOMAN. \n\n\tThe woman shakes her head, tries to smile, but says nothing. Then she \n\tenters the wash-house silently and begins to serve the tea.\n \n\t\t\t\tKADER \n\t\tIt's better to split up, to increase our \n\t\tchances. We must change hiding places, and \n\t\tchange them continually ... In the \n\t\tmeantime, we must make new contacts, \n\t\treplace our arrested brothers, reorganize \n\t\tour sections--\n \n\t\t\t\tALI \n\t\t\t(interrupting him)\n\t\tYes, but we must also show them that we \n\t\tstill exist.\n \n \t\t\t\tKADER \n\t\tOf course. As soon as possible.\n \n\t\t\t\tALI \n\t\tNo, immediately. The people are \n\t\tdemoralized. Leave this to me ...\n \n \t\t\t\tKADER \n\t\tNo. Not you, or any one of us. As long as \n\t\twe are free, the NLF continues to exist \n\t\tin the Casbah. If they manage to take us \n\t\ttoo, there won't be anything left ... And \n\t\tfrom nothing comes nothing ...\n\n\t\t\t\tRAMEL \n\t\t\t(intervening)\n\t\tBut it's also necessary to do something ...\n \n\t\t\t\tKADER \n\t\tAnd we will do something, don't worry. As \n\t\tsoon as we have reestablished contacts ...\n \n \t\t\t\tMOURAD\n\t\tAnd our movements?\n \n\t\t\t\tKADER \n\t\tFor this too we've got to change methods.\n \n\n110\tMUNICIPAL STADIUM. OUTSIDE. DAY. FEBRUARY 10, 1957.\n\n\tThe municipal stadium is crowded with people. There is a football game \n\tbetween two European teams. It is almost the end of the first half. \n\tFrom above to the right of the guest box, there is a very loud \n\texplosion.\n \n\tStrips of flesh are hurled into the air. Thick, white smoke ... There \n\tare screams of terror. The people try to move away in haste. They are \n\tshoving, pushing, bumping into one another ... Then, calm returns. The \n\tsirens of the ambulances are heard.\n\n\tThe stretcher, the dead carried away, scores of wounded.\n \n\n111\tPREFECT'S OFFICE. PRESS HALL. INSIDE. DAY. FEBRUARY 25.\n \n \tBen M'Hidi is standing in front of the journalists with handcuffs on \n\this wrists and ankles. He is without a tie. He is smiling a little, his \n\tglance ironical. There are two paras behind him with machine guns \n\tready. The picture is still for an instant; Ben M'Hidi's smile is \n\tsteady, so too his eyes, his entire face. Flashes, clicking of cameras.\n \n\t\t\t\t1ST JOURNALIST\n\t\tMr. Ben M'Hidi ... Don't you think it is \n\t\ta bit cowardly to use your women's baskets \n\t\tand handbags to carry explosive devices \n\t\tthat kill so many innocent people?\n \n\tBen M'Hidi shrugs his shoulders in his usual manner and smiles a \n\tlittle.\n \n\t\t\t\tBEN M'HIDI \n\t\tAnd doesn't it seem to you even more \n\t\tcowardly to drop napalm bombs on unarmed \n\t\tvillages, so that there are a thousand \n\t\ttimes more innocent victims? Of course, \n\t\tif we had your airplanes it would be a lot \n\t\teasier for us. Give us your bombers, and \n\t\tyou can have our baskets.\n\n\t\t\t\t2ND JOURNALIST\n\t\tMr. Ben M'Hidi ... in your opinion, has \n\t\tthe NLF any chance to beat the French \n\t\tarmy?\n\n\t\t\t\tBEN M'HIDI\n\t\tIn my opinion, the NLF has more chances \n\t\tof beating the French army than the \n\t\tFrench have to stop history. \n\n\tThe press hall in the prefect's office is crowded with journalists of \n\tevery nationality. At the side and central aisles there are \n\tphotographers and cameramen.\n \n\tBen M'Hidi is opposite them, standing on a low wooden platform. Mathieu \n\tis next to him, seated behind a small desk. Mathieu now gets up, and \n\tsignals to two paratroopers. Another journalist simultaneously has \n\tasked another question:\n \n \t\t\t\t3RD JOURNALIST\n\t\tMr. Ben M'Hidi, Colonel Mathieu has said \n\t\tthat you have been arrested by accident, \n\t\tpractically by mistake. In fact, it seems \n\t\tthat the paratroopers were looking for \n\t\tsomeone much less important than yourself. \n\t\tCan you tell us why you were in that \n\t\tapartment at rue Debussy last night?\n \n\tThe two paras have moved forward and they take Ben M'Hidi by the arms. \n\tAt the same time, he answers.\n \n\t\t\t\tBEN M'HIDI\n\t\tI can only tell you that it would have \n\t\tbeen better if I had never been there ...\n \n \t\t\t\tMATHIEU \n\t\t\t(intervening)\n\t\tThat's enough, gentlemen. It's late, and \n\t\twe all have a lot of work ...\n \n\tBen M'Hidi glances at him ironically. \n\n\t\t\t\tBEN M'HIDI\n\t\tIs the show already over?\n \n\t\t\t\tMATHIEU \n\t\t\t(smiling)\n\t\tYes, it's over ... before it becomes \n\t\tself-defeating.\n\n\tThe paras lead Ben M'Hidi away. He moves away with short steps, as much \n\tas he can with the irons that are tightened around his ankles. Mathieu \n\thas turned to the journalists and smiles again.\n \n\n112\tPREFECT'S OFFICE. PRESS HALL. INSIDE. DAY. MARCH 4. \n\n\tColonel Mathieu is standing. On his face is a brief smile, motionless, \n\this eyes attentive, but half-closed somewhat, due to the camera \n\tflashes.\n \n \t\t\t\t1ST JOURNALIST\n\t\tColonel Mathieu ... the spokesman for the \n\t\tresiding minister, Mr. Gorlin, has stated \n\t\tthat \"Larbi Ben M'Hidi committed suicide \n\t\tin his own cell, hanging himself with \n\t\tpieces of his shirt, that he had used to \n\t\tmake a rope, and then attached to the \n\t\tbars of his cell window.\" In a preceding \n\t\tstatement, the same spokesman had \n\t\tspecified that: \"... due to the intention \n\t\talready expressed by the prisoner Ben \n\t\tM'Hidi to escape at the first opportunity, \n\t\tit has been necessary to keep his hands \n\t\tand feet bound continually.\" In your \n\t\topinion, colonel, in such conditions, is \n\t\ta man capable of tearing his shirt, \n\t\tmaking a rope from it, and attaching it \n\t\tto a bar of the window to hang himself?\n \n\t\t\t\tMATHIEU \n\t\tYou should address that question to the \n\t\tminister's spokesman. I'm not the one who \n\t\tmade those statements ... On my part, I \n\t\twill say that I had the opportunity to \n\t\tadmire the moral strength, intelligence, \n\t\tand unwavering idealism demonstrated by \n\t\tBen M'Hidi. For these reasons, although \n\t\tremembering the danger he represented, I \n\t\tdo not hesitate to pay homage to his \n\t\tmemory.\n \n\t\t \t\t2ND JOURNALIST\n\t\tColonel Mathieu ... Much has been said \n\t\tlately not only of the successes \n\t\tobtained by the paratroopers, but also of \n\t\tthe methods that they have employed ... \n\t\tCan you tell us something about this? \n\n\t\t\t\tMATHIEU \n\t\tThe successes obtained are the results \n\t\tof those methods. One presupposes the \n\t\tother and vice versa.\n \n\t\t\t\t3RD JOURNALIST \n\t\tExcuse me, colonel. I have the impression \n\t\tthat perhaps due to excessive prudence ... \n\t\tmy colleagues continue to ask the same \n\t\tallusive questions, to which you can only \n\t\trespond in an allusive manner. I think it \n\t\twould be better to call things by their \n\t\tright names; if one means torture, then \n\t\tone should call it torture.\n\n\t\t\t\tMATHIEU \n\t\tI understand. What's your question?\n\n\t\t\t\t3RD JOURNALIST\n\t\tThe questions have already been asked. I \n\t\twould only like some precise answers, \n\t\tthat's all ...\n \n \t\t\t\tMATHIEU \n\t\tLet's try to be precise then. The word \n\t\t\"torture\" does not appear in our orders. \n\t\tWe have always spoken of interrogation as \n\t\tthe only valid method in a police \n\t\toperation directed against unknown \n\t\tenemies. As for the NLF, they request \n\t\tthat their members, in the event of \n\t\tcapture, should maintain silence for \n\t\ttwenty-four hours, and then, they may \n\t\ttalk. Thus, the organization has already\n \t\thad the time necessary to render useless \n\t\tany information furnished ... What type \n\t\tof interrogation should we choose? ... \n\t\tthe one the courts use for a crime of \n\t\thomicide which drags on for months?\n \n \t\t\t\t3RD JOURNALIST\n\t\tThe law is often inconvenient, colonel ...\n \n\t\t\t\tMATHIEU \n\t\tAnd those who explode bombs in public \n\t\tplaces, do they perhaps respect the law? \n\t\tWhen you asked that question to Ben \n\t\tM'Hidi, remember what he said? No, \n\t\tgentlemen, believe me, it is a vicious \n\t\tcircle. And we could discuss the problem \n\t\tfor hours without reaching any \n\t\tconclusions. Because the problem does \n\t\tnot lie here. The problem is: the NLF \n\t\twants us to leave Algeria and we want to \n\t\tremain. Now, it seems to me that, despite \n\t\tvarying shades of opinion, you all agree \n\t\tthat we must remain. When the rebellion \n\t\tfirst began, there were not even shades \n\t\tof opinion. All the newspapers, even the \n\t\tleft-wing ones wanted the rebellion \n\t\tsuppressed. And we were sent here for \n\t\tthis very reason. And we are neither \n\t\tmadmen nor sadists, gentlemen. Those who \n\t\tcall us fascists today, forget the \n\t\tcontribution that many of us made to the \n\t\tResistance. Those who call us Nazis, do \n\t\tnot know that among us there are \n\t\tsurvivors of Dachau and Buchenwald. We \n\t\tare soldiers and our only duty is to \n\t\twin. Therefore, to be precise, I would \n\t\tnow like to ask you a question: Should \n\t\tFrance remain in Algeria? If you answer \n\t\t\"yes,\" then you must accept all the \n\t\tnecessary consequences.\n \n\n113\tCASBAH HOUSES. TORTURE SEQUENCE. INSIDE. DAY.\n\n\tCasbah, bedrooms, kitchens, bathrooms.\n \n\tSharp, white light; motionless faces, figures paused midway in \n\tgestures.\n \n\tWomen, children ... glassy eyes ...\n\n\tBackground motionless like in a landscape.\n\n\tAlgerians ... wild eyes ... animals being led to slaughter.\n\n\tParas, their every gesture measured exactly, perfection achieved.\n \n\tAn Algerian is lying down on the table, his arms and ankles bound with \n\tbelts.\n\n\tAn Algerian, in the form of a wheel, an iron bar in the curvature of \n\this knees, his ankles tied to his wrists. \n\n\tElectrical wires wrenched from their outlets, a generator with crank, \n\textended pliers with their prongs open wide, the tops of the wires held \n\tbetween two prongs, the pliers applied to a naked body, the most \n\tsensitive parts: lips, tongue, ears, nipples, heart, sexual organs ...\n\n\tFaucets, tubing, buckets, funnels, a mouth forced open, held open, with \n\ta wooden wedge, tubing in the mouth, rags scattered around, water, a \n\tbelly that is swelling . .. The torture is precise in every detail, and \n\tevery detail points to a technique that is taken apart and reassembled.\n \n\n114\tUPPER CASBAH ALLEY. OUTSIDE. DAY. \n\n\tThe chorus of the Koran school like ceaseless wailing, like a stubborn \n\twill to survive that seems to be spreading through the Casbah.\n\n\tPetit Omar looks up instinctively, his small face hardened and \n\ttaciturn, like that of an adult, then enters the school.\n \n\n115\tKORAN SCHOOL. INSIDE. DAY. \n\n\tThe children are sitting on the mats, motionless; only their lips are \n\tmoving. There is an oblique light, the teacher is in the shadow.\n\n\tRELIGIOUS CHORUS.\n\n\tPetit Omar approaches the teacher who shakes his head in denial. Omar \n\tgoes out.\n \n\n116\tCASBAH STREETS. PATROLS. OUTSIDE. DAY.\n \n\tThe Casbah is patrolled by paratroopers; helmets, machine guns, \n\tportable radios, police dogs ...\n\n\tParatroopers are erecting loudspeakers at every street corner. \n\tParatroopers with brushes and buckets of paint are marking the doors of \n\tthe Casbah with large numbers. From time to time, machine-gun fire is \n\theard in the distance.\n\n\tAlgerians are standing against the wall, their hands up. There is a \n\tdead man a few feet away, an Algerian youth. The paratroopers turn him \n\tover and search him. A child with terrified eyes turns around a little.\n \n\tA para transmits the dead man's name into the portable radio.\n \n\n117\tCASBAH. OTHER STREETS. OUTSIDE. DAY.\n\n\tA car radio receives and transmits the same name; and then the name is \n\trepeated by the loudspeakers scattered throughout the Casbah.\n\n\t\t\t\tLOUDSPEAKER\n\t\t\"Inhabitants of the Casbah! The rebellion \n\t\tgets weaker every day. The terrorist Ben \n\t\tAmin has been executed. Kasem Moussa has \n\t\tbeen arrested. He was commander of the 2nd \n\t\tSector NLF. Inhabitants of the Casbah! The \n\t\tterrorists are not your true brothers. \n\t\tLeave them to their fate. Rely on the \n\t\tprotection of the French army. Denounce \n\t\tthe terrorists and agitators. Cooperate \n\t\twith us to reestablish peace and \n\t\tprosperity in Algeria ...\"\n \n\n118\tFOUR WOMEN. STREET. OUTSIDE. DAY.\n \n \tFour women, their faces veiled, meet a patrol of paras in a small \n\tstreet.\n \n\tTwo of the paras stop the last woman, and lift her dress, uncovering \n\ther feet and ankles -- those of a man. The tear away her veil.\n\n\tThe man is Ali. At the same time, there is ...\n \n\tMACHINE-GUN FIRE.\n \n\tThe two paras fall to the ground. Ali grasps his weapon, visible \n\tthrough the opening of his cloak. The other paras fling themselves to \n\tthe ground.\n \n\tThe other three women flee, while Ali continues to shoot, then runs \n\taway.\n \n\tThe four flee through the narrow streets and alleys, climb a stairway, \n\tand leap from one terrace to another. Behind them, shouts, whistles, \n\tand machine-gun fire are heard. And moving nearer ...\n\n\tBARKING OF DOGS.\n\n\n119 \tCOURTYARD WITH WELL. OUTSIDE. DAY. \n\n\tThe four enter a courtyard. Ali's three companions have also lifted \n\ttheir veils. They are Kader, Mourad, and Ramel. \n\n\tA woman rushes to shut the door while a man leads the four toward an \n\topening hidden by some boxes.\n \n\tThe others who are in the courtyard, women and children, are also busy \n\thelping, silently, hurriedly, in a tense atmosphere of solidarity with \n\tthe four fugitives. \n\n\tVery near are heard ...\n \n\tBARKING OF DOGS AND PARAS' HURRIED FOOTSTEPS. \n\n\tA woman runs toward the door and throws some large handfuls of pepper \n\tunder the cracks.\n \n\n120 \tSTREET COURTYARD WITH WELL. OUTSIDE. DAY. \n\n\tThe group of pursuers -- paras who are holding police dogs by leashes \n\t-- slow down in front of the door. \n\n\tBARKING DOGS.\n \n\tThe animals sniff the ground, then move on together with the paras.\n \n\n121\tARAB BATH. INSIDE. DAY.\n\n\tPetit Omar enters the large steamy room. He moves near the manager and \n\thands him an envelope. The manager slips it quickly under the counter.\n \n\t\t\t\tSPEAKER\n\t\t\"To all NLF militants! Reorganize! Replace \n\t\tyour fallen and arrested brothers. Make \n\t\tnew contacts! This is a grave moment. \n\t\tResist brothers! The General Staff leaves \n\t\tyou free to take any and all necessary \n\t\toffensives ...\n \n\n122 \tCASBAH HOUSE. INSIDE. DAY.\n \n\tAll the inhabitants of a house. The men are in a row on the balcony of \n\tthe first floor, their hands crossed behind their heads, their backs to \n\tthe wall, while paras guard them with pointed machine guns.\n\n\tTwo paratroopers lead an Algerian girl forward: she seems to be \n\texhausted, and can barely walk, her eyes half-closed. \n\n\tThey stop in front of the first man and ask her:\n \n \t\t\t\tPARAS \n\t\tIs this one?\n\n\t\t\t\tSPEAKER\n\t\t\"Our hearts are breaking before such \n\t\toutrages, our houses invaded, our \n\t\tfamilies massacred. Brothers, rebel! \n\t\tBring terror to the European city!\"\n \n\n123\tALGERIAN STREETS. OUTSIDE. EVENING.\n \n \tThe European city, evening, houses are being lit. People have finished \n\tworking. They are going to the bars, cinemas, or for walks, or crowding \n\tthe bus stops ...\n \n\tThe wail of a siren at full blast, an ambulance, driven at frightening \n\tspeed.\n \n\tThe people move aside, jump to the sidewalks. The cars squeeze to the \n\tright, stop.\n \n\tThe ambulance door is opened, a corpse is thrown out, falls, rolls into \n\tthe street.\n \n\tThe people rush to it. It is a hospital attendant's in white uniform \n\twith a knife stuck in his throat.\n \n\tThe sound of the siren decreases in intensity; the ambulance is by now \n\tfar away.\n \n\n124 \tAMBULANCE. OUTSIDE/INSIDE. EVENING. \n\n\tIn the driver's cab, there are two Algerian boys. Their hair is curly, \n\ttheir shirts old and torn. They are sweating; their eyes wide open, \n\tstaring.\n \n\tThe one who is driving barely reaches the height of the steering wheel. \n\tHe clutches it desperately. The other has a machine gun. He makes a \n\tremark in Arabic shouting to be heard above the siren.\n\n\tThe driver takes a hand off the steering wheel, places it on the \n\tdashboard, and tries all the switches until he finds the one for the \n\theadlights. The high beams.\n \n\tThe other, meanwhile, is now on his knees on the seat. He is leaning \n\tout the open window to his waist, and he begins to shoot.\n\n\n125\tROUTE OF AMBULANCE. OUTSIDE. EVENING.\n \n \tThe pictures succeed one another in a dizzy rhythm; surprise, terror, \n\tsomeone falls. \n\n\tSHOTS. SIREN.\n \n\n126\tAMBULANCE. OUTSIDE/INSIDE. EVENING.\n \n\tThere is no more ammunition. The machine gun is thrown in the back of \n\tthe ambulance. The siren is still at full blast. The auto races ahead \n\tat terrifying speed. The two boys don't know any more what to do, where \n\tto go, and the one who is driving has his eyes almost closed, as if he \n\twere dizzy. \n\n\tThey reach a square. \n\n\tSIREN.\n \n\tThe other points ahead to the left.\n \n\n127\tBUS SHELTER. OUTSIDE. EVENING.\n \n \tThe people are crowded in a bus shelter. The one who is driving doesn't \n\tunderstand or doesn't want to.\n\n\tThe other shouts to him again and again, the same phrase, then flings \n\thimself on the steering wheel, and turns it in that direction.\n \n\tThe bus shelter is nearer and nearer.\n \n\tThe people are paralyzed. They have no time to move. They are run down, \n\trammed into. The ambulance crashes into a pillar.\n\n\tOn the ground, all about, the bodies of dead and wounded. The boys' \n\tbodies remain motionless, their foreheads resting on the smashed \n\twindshield.\n \n\tBut the sound of the siren does not stop, and is heard, mournful and \n\tfull of anguish.\n \n\n128\tRAMEL'S HOUSE. IMPASSE ST. VINCENT DE PAUL. \n\tOUTSIDE/INSIDE. DAY. AUGUST 26.\n \n\tImpasse St. Vincent-de-Paul, noon. There are helicopters in the sky, \n\tand paras fill the alley.\n \n\tTheir faces are pale and tense, their eyes wide open, their hands \n\tclutch their machine guns. There is a strange silence. Then a movement \n\tat the back of the alley, a voice, a brief greeting. Mathieu has \n\tarrived and he is saying to an officer:\n \n \t\t\t\tMATHIEU \n\t\tNow is not the time for heroes. Give me \n\t\tthe megaphone. \n\n\tMathieu takes the megaphone in his hands and approaches an open door. \n\tThrough the doorway the inner courtyard of the house is visible where \n\tthe corpses of four paras are strewn about.\n \n\tRamel and Si Mourad are on the first-floor balcony, lying in wait \n\tbehind the railings, so they are able to watch the door, courtyard, and \n\tthe stairway that leads from the balcony to the terrace.\n\n\tOn the terrace there are other paras who are facing the balcony. From \n\ttime to time they release a burst of machine gun fire.\n\n\tThe voice of Mathieu is heard over the loudspeaker.\n \n\t\t\t\tMATHIEU \n\t\tRamel ... Si Mourad ... use your heads. \n\t\tIf you go on like this, I wouldn't want to \n\t\tbe in your place when you are captured ... \n\t\tBecause you will be captured in the end, \n\t\tand you know it too. Surrender! If you do \n\t\tit immediately, I promise that you will \n\t\tnot be harmed and you will have a fair \n\t\ttrial. Can you hear me?\n \n\tRamel and Si Mourad look at each other.\n \n \t\t\t\tMOURAD\n\t\tWho is speaking?\n\n\t\t\t\tMATHIEU \n\t\tMathieu. Colonel Mathieu.\n \n \t\t\t\tMOURAD\n\t\tWe don't trust you, colonel. Come \n\t\tforward, show yourself.\n \n\tA moment of silence.\n\n\t\t\t\tMATHIEU \n\t\tI don't trust you either. First stand up \n\t\tso I can see you, and keep your hands \n\t\tstill and well in sight.\n\n\tMourad hesitates an instant, glances at Ramel, then: \n\n \t\t\t\tMOURAD\n\t\tOkay. But we want your promise for a fair \n\t\ttrial in writing. Give us a written \n\t\tstatement, Mathieu, and then we'll \n\t\tsurrender. \n\n\t\t\t\tMATHIEU \n\t\tHow can I give you this statement? \n\n\t\t\t\tMOURAD\n\t\tWe'll lower a basket from the window ...\n\n\t\t\t\tMATHIEU \n\t\tOkay, I'll make the statement in \n\t\twriting ...\n\n\tMourad shows his companion the two large time-bombs that are on the \n\tfloor in front of him. He takes one, begins to prepare it, and \n\tregulates the mechanism.\n\n\tAt the same time, he tells Ramel in Arabic to go find the basket.\n \n\tRamel crawls past the doors which are all closed, and asks for a basket.\n\n\tA door opens and an old woman appears. She hands him a basket with its \n\tcord rolled up.\n \n\t\t\t\tMOURAD\n\t\t\t(without turning around)\n\t\tA newspaper too, or a piece of paper ...\n \n\tRamel brings him the basket and newspaper. Mourad has loaded the time-\n\tbomb mechanism, and the tic-toc sound is sharp and clear.\n\n\tNow he has to move the second hand. Mourad's hands do not tremble, his \n\tglance is attentive, concentrating. Ramel watches him without saying a \n\tword; his fear is obvious. \n\n\tWithout moving, his eyes glued to the bomb dial:\n \n\t\t\t\tMOURAD\n\t\t\t(loudly)\n\t\tAre you ready, colonel?\n \n\t\t\t\tMATHIEU \n\t\tYes ... But let me first see you.\n\n\tMourad moves one of the clock hands to precede the other one by a \n\tminute. Immediately afterward he places the flat and rectangular bomb \n\tin the bottom of the basket.\n \n\tThe basket seems to be empty. The piece of newspaper protects its \n\tbottom. Mourad tells Ramel to get up, and he too gets up. Their machine \n\tguns are lying on the ground. Meanwhile, Mourad has begun to count to \n\thimself silently, his lips moving: one, two, three, four ... \n\n\tFrom the terrace, the paras can see Ramel and Mourad standing up not \n\tvery far away, their empty hands resting near the basket on the \n\trailing. \n\n\tA para shouts:\n \n \t\t\t\tPARA \n\t\tWe see them. You can come.\n \n\tMourad begins to lower the basket very slowly.\n \n\t\t\t\tMOURAD \n\t\t\t(counting)\n\t\t60, 59, 58, 57, 56, 55, 54, 53 ...\n\n\tMathieu enters the courtyard together with an officer and other paras. \n\tHe looks up toward the balcony, smiles, and shows them a folded piece \n\tof paper.\n \n\t\t\t\tMATHIEU \n\t\tHere it is ... you know that when I give \n\t\tmy word, I keep it ...\n \n\tMourad does not answer, but looks at Mathieu as if to calculate the \n\tdistance and time, and slows down even more the basket's descent.\n\n\tMathieu moves forward a few steps, as if to go for the basket that is \n\thanging on the other side of the courtyard, but suddenly he seems \n\tperplexed for a second, and then changes his mind. He turns to the \n\tnearest para, and gives him the note.\n \n\t\t\t\tMATHIEU\n\t\tYou go ...\n\n\tMourad's face has remained motionless. In his expression there is a \n\tshade of disappointment. He sees Mathieu retrace his steps toward the \n\tdoor, and is now surrounded by a group of paratroopers ...\n\n\t\t\t\tMOURAD \n\t\t\t(counting) \n\t\t25, 24, 23, 22, 21, 20, 19 ...\n\n\tThe basket has stopped moving two yards from the ground. In order to \n\treach it, the para has to step over the corpses of his dead companions, \n\this face hardens, he reaches the basket, and extending his arm, he \n\tthrows in the note. The basket does not move; the para looks up.\n\n\t\t\t\tPARA \n\t\t\t(muttering)\n\t\tHurry up, black bastard!\n \n\tMourad smiles at him, and mumbles something in Arabic, a phrase that he \n\tdoesn't manage to finish, for now is heard -- the explosion.\n \n\n129\tRUE CATON 4. FATHIA'S HOUSE. INSIDE. NIGHT. SEPTEMBER 2.\n\n\tRue Caton number four. It is 11 p.m. A large, badly lit room is filled \n\twith paratroopers and one of them is now being carried away on a \n\tstretcher. Another three or four wounded are seated on the opposite \n\tside of the room and are waiting their turn to be carried away.\n\n\tTwo paras are by the door. They look out from time to time, and are \n\tattentive, ready, with machine guns clutched by their sides.\n \n\tOn the other side of the room opposite the door, the Algerians who live \n\tin the house are standing against the wall. Mathieu is in front of \n\tthem, and he is asking a group of women:\n\n\t\t\t\tMATHIEU\n\t\tWhich one of you is Fathia?\n\n\tA woman about forty years old raises her eyes toward him.\n \n\t\t\t\tMATHIEU\n\t\tIs it you?\n\n\tThe woman nods yes.\n \n\t\t\t\tMATHIEU \n\t\tGo up the stairs, and tell Kader that if \n\t\tthey don't surrender, we'll blow up \n\t\teverything ... Do you understand? \n\n\tThe woman again nods yes, and without waiting for more words, she moves \n\ttoward the door, taciturn, silent. Mathieu follows her, he pushes past \n\ther.\n\n\t\t\t\tMATHIEU \n\t\tTry to convince him, if you care about \n\t\tyour house ... Wait a minute ... Do you \n\t\twant to get killed? \n\n\tHe leans out the door and says loudly:\n \n\t\t\t\tMATHIEU \n\t\tKader, look. Fathia is coming ... I \n\t\twouldn't shoot ...\n \n\tThen he steps aside and lets the woman pass.\n \n\t\t\t\tMATHIEU \n\t\tGo on ...\n \n\tOutside the door, there is a small landing, then a steep stairway, and \n\tat the top, a corridor. Fathia climbs the stairs that are cluttered \n\twith empty magazines, with cartridge boxes. The walls are chipped from \n\tthe shooting. The ceiling is parallel to the stairway at the same \n\tinclination, for part of its distance. But for the last few yards, it \n\tstraightens out and lowers to become horizontal.\n\n\tThe floor of the hiding place is open. Inside are Zohra and Kader.\n\n\tFathia repeats to them in Arabic what Mathieu has said to her.\n\n\tKader listens to her then answers, he too in Arabic. Then he smiles.\n \n\t\t\t\tKADER \n\t\tOkay ... You can tell the colonel to blow \n\t\tup whatever he likes. Go on, now.\n \n\tFathia goes down the stairs, and reenters the room.\n \n\t\t\t\tFATHIA \n\t\t\t(to Mathieu)\n\t\tHe said that you can blow up whatever \n\t\tyou like ...\n\n\tShe, then, rejoins the other women.\n\n\tMathieu seems to be tired, he has lost weight, he is nervous. He turns \n\tto his men, and slowly as he gives the orders, the paras begin to move.\n \n\t\t\t\tMATHIEU \n\t\tReturn to where the others are. Prepare \n\t\tthe plastic. It should be placed on the \n\t\tceiling of the stairway under the hiding \n\t\tplace ... a long fuse rolled up ... Take \n\t\tcover ... keep shooting while you are \n\t\tworking. Quickly! Clear the house ... \n\t\tBring them outside, then check the rooms \n\t\tagain ... Hurry up!\n \n\tKader gives Zohra a box of matches. She goes to the back of the hiding \n\tplace where there is a bundle of papers. She lights them, then returns \n\tnear to Kader who is inspecting the magazine of his machine gun.\n\n\tThere are only two shots left. The other empty magazines are scattered \n\taround. Kader turns to Zohra, and starts to speak, but suddenly his \n\twords are blurred by the sound of shots. \n\n\tKader and Zohra have to step back a little, because the shells are \n\tflashing at the edge of the opening.\n \n\tThe shooting stops. From the stairway, one end of a long fuse is \n\tthrown into the corridor. The other end is inserted into a plastic \n\tcharge fastened to the ceiling of the stairway, under the hiding place.\n \n\tKader and Zohra can see two or three yards in front of them, below, \n\tinto the corridor, where the end of the fuse is glowing and burning.\n\n\tKader too has lost weight, his beard is long. He looks at the fuse, \n\tthen at Zohra. A second passes in silence. Now Zohra too looks at him, \n\tand Kader says calmly in his usual voice:\n\n\t\t\t\tKADER \n\t\tIt doesn't do any good to die like this ... \n\t\tit doesn't help anybody ...\n\n\tHe leans out from the hiding place.\n \n\t\t\t\tKADER \n\t\t\t(shouting)\n\t\tMathieu! If you give your word that you \n\t\twon't touch any of the other people in \n\t\tthe house, we'll come out.\n \n\n130\tMILITARY CAR. INSIDE. NIGHT. \n\n\tInside a military automobile.\n\n\tIn the back seat, Mathieu is sitting next to Kader who is handcuffed.\n \n\tZohra is in the front seat, between the driver and a para who has in \n\this hand a large regulation pistol. The interior is lighted by the \n\theadlights of a jeep which is following directly behind the auto a few \n\tyards. Silence. Mathieu looks hastily at Kader, who is staring straight \n\tin front of him, and appears to be sullen and downcast.\n\n\tThen Mathieu speaks in a pleasant tone, as if in friendly conversation.\n\n\t\t\t\tMATHIEU\n\t\tIf you had let me blow you up, you would \n\t\thave disappointed me ...\n\n\tKader turns to him, and replies, trying to maintain his own voice at \n\tthe same level of indifference:\n\t \n\t\t\t\tKADER\n\t\tWhy?\n \n\t\t\t\tMATHIEU \n\t\tFor many months, I've had your photo on \n\t\tmy desk together with a dozen or so \n\t\treports on you ... And naturally, I am \n\t\tunder the illusion that I know you \n\t\tsomewhat. You never seemed the type, \n\t\tKader, inclined to performing useless \n\t\tactions. \n\n\tKader doesn't answer right away, then speaks slowly as if expressing \n\tthe results of his doubts, a new point of view ...\n \n \t\t\t\tKADER \n\t\tYou seem to be very satisfied to have \n\t\ttaken me alive ...\n \n \t\t\t\tMATHIEU \n\t\tOf course I am.\n \n\t\t\t\tKADER \n\t\tThat proves that I was wrong. Evidently I \n\t\tcredited you with an advantage greater \n\t\tthan I should have.\n\n\t\t\t\tMATHIEU \n\t\tNo. Let's just say that you've given me \n\t\tthe satisfaction to have guessed \n\t\tcorrectly. But from the technical point \n\t\tof view, it isn't possible to speak of \n\t\tadvantages. By now the game is over. The \n\t\tNLF has been defeated.\n\n\tZohra has turned around suddenly. She is crying and speaks hastily in \n\tArabic, violently, harshly.\n\n\tMathieu doesn't understand, and turns to Kader to ask him politely, \n\talthough with a bit of irony:\n\n\t\t\t\tMATHIEU \n\t\tWhat is she saying?\n\n\t\t\t\tKADER \n\t\tShe says that Ali is still in the Casbah.\n \n\n131\tCROWDED BEACH. OUTSIDE. DAY. \n\n\tAli la Pointe's glance is sullen, heavy, motionless. He moves his head \n\tslowly in such a way so that his glance also moves in a semicircle.\n\n\tWhite beach, fine sand, transparent sea, bodies stretched out in the \n\tsun, golden skin of girls; girls in bikinis, sensual, smiling, young \n\tmen with narrow hips, with muscles well cared for, cheerful youth, \n\tnaturally happy, enviable. The children are building sand castles near \n\tthe water's edge; the beach is shaped like a half-moon with rocky reefs \n\tat both ends ...\n \n\tA September Sunday, warm and calm. Ali is leaning on the wall. He is \n\twearing a white wool cloak. Only his eyes are visible ... the eyes of a\n \thungry tiger perched above a path, on the lookout for innocent prey. \n\tEyes that now gleam, cruel eyes, tension dilating the pupils ... Then\n\tagain the calm, a gloomy calm, a gratifying tension. The place is \n\tright, and the victims couldn't be better ones.\n\n\tAli moves, leaves the wall, crosses the street to a large city \n\tsanitation truck, one of those metallic trucks with no visible \n\topenings.\n\n\tA young Algerian is at the steering wheel, a street cleaner. He is \n\tleaning his thin face on the wheel. His hands are dirty, by now \n\tunwashable from years of work.\n\n\tAli has climbed into the cab. The truck is in motion and leaves.\n \n\n132\tSANITATION TRUCK. INSIDE. DAY.\n \n\tThe name of the street cleaner is Sadek. He seems frightened. He looks \n\taround, hesitates before speaking.\n \n \t\t\t\tSADEK\n\t\tThen the beach is okay, Ali.\n\n\tSilence. Sadek looks at him again, waiting, but Ali does not respond.\n\n \tAli looks straight ahead at the street bathed in sunlight, the tar that \n\tseems to be liquid, the villas that surround Algiers, the lemon trees, \n\tthe oleanders ... Then he speaks, but without turning to Sadek. He \n\tspeaks in a whisper, his eyes continually staring straight ahead. \n\n\t\t\t\tALI \n\t\tWe need two more, the biggest ones.\n \n \t\t\t\tSADEK\n\t\tAnd the others?\n\n\t\t\t\tALI \n\t\tThe others ... let's wait and see. \n\n\tSadek remains silent for a while.\n\n \t\t\t\tSADEK\n\t\tI've looked, Ali, even where I work. \n\t\tNothing. The ones who have not been \n\t\tarrested have left Algiers and gone into \n\t\tthe mountains ... And the others don't \n\t\twant to hear any more about it ... \n\t\tthey're afraid ...\n    \n\tAli doesn't answer him. Silence.\n \n\t\t\t\tALI \n\t\tCan't you go any faster?\n \n \t\t\t\tSADEK\n\t\tYes, sure ... here.\n\n\tSadek puts the truck in third gear, accelerates the motor, then shifts \n\tback again into fourth gear. The truck increases its speed. The road is \n\tstraight, the outskirts of Algiers are visible.\n\n \t\t\t\tSADEK\n\t\tIf we don't find any others ... should we \n\t\tcall it off? \n\n\tAli turns suddenly to look at him but says nothing. Sadek can feel \n\tthose eyes on him, and tries to justify himself.\n \n \t\t\t\tSADEK\n\t\tWe can't plant all of them by \n\t\tourselves ... \n\n\tAli speaks to him in a dry and indifferent voice. \n\n\t\t\t\tALI \n\t\tYou don't have to plant anything. You \n\t\tonly have to carry them, that's all.\n \n\n133\tRUE DES ABDERAMES. ALI'S HOUSE. OUTSIDE/INSIDE. NIGHT.\n \n\tNight. At number three rue des Abderames, on the first-floor balcony, \n\tthe stove fires are glowing. The women are cooking outside on their \n\tstoves built from tin containers. They are cooking in front of the \n\tdoors of their homes. The doorways are lit up.\n\n\tAli passes along the balcony, passes by Mahmoud and his wife who are \n\tspeaking in whispers by themselves and leaning on the railing. It is a \n\twarm and starry night. Mahmoud says some more words to his wife, still \n\tspeaking in whispers, tenderly. Then he follows Ali who has stopped in \n\tfront of the door.\n \n\n134\tALI'S ROOM. INSIDE. NIGHT.\n \n\tIn the room, there is Petit Omar who is cutting out some pictures from \n\ta comic book.\n \n\tAs soon as he sees Ali at the door, he stops, closes his book, puts the \n\tscissors in his pocket. He seems to be embarrassed at being caught in \n\this childish game.\n \n\tIn the center of the room, there is a dividing curtain, pulled halfway \n\tto the side. On the other side, Hassiba is typing. Behind Hassiba, next \n\tto the bed, the hiding place is open. Ali enters. He seems tired, \n\tsweating. He removes his cloak, tosses it on the chair, and puts his \n\tmachine gun on the table.\n \n\t\t\t\tALI \n\t\t\t(turning to Petit Omar)\n\t\tC'mon, hurry. Go to sleep. Tomorrow we \n\t\tfour have a lot of work to do: Mahmoud, \n\t\tHassiba, you and I.\n \n\tMahmoud has remained motionless at the door. Hassiba has stopped typing \n\tand approaches them. Omar says nothing, but there is a satisfied look \n\tin his eyes. He can't help stretching out his hand to touch the machine \n\tgun.\n \n\tAli sits down, at the table, moves the machine gun away from Omar, and \n\tcontinues to speak, still talking to Omar.\n \n \t\t\t\tALI \n\t\tBecause we can't find anyone else, Sadek \n\t\twill bring us there in the truck. You get \n\t\tout first and plant the bomb where I tell \n\t\tyou ... then return here quickly. But be \n\t\tcareful that no one is following you. Then \n\t\tHassiba will get out, and after her, \n\t\tMahmoud. Then I will plant the ones that \n\t\tare left. They'll know that we're still\n\t\tstrong ... you can be sure of that.\n \n \n135\tALI'S ROOM. INSIDE. DAWN. OCTOBER 7, 1957.\n \n \tThe room is badly lit by a small lamp which is on the other side of the \n\tcurtain. There is a mattress on the table and Petit Omar is lying on \n\ttop, asleep.\n \n\tAli is lying on a mattress on the ground, fully dressed, with his \n\tmachine gun by his side. His eyes are open, and he is listening to the \n\tfar-away sound of a motor. He looks at his watch, gets up, and goes to \n\topen the door. Outside there is the first gray light of dawn. The sound \n\tis heard more clearly and seems to be moving nearer.\n \n\tAli returns to Petit Omar, stays a minute looking at him, then shakes \n\thim roughly. The child gets up immediately. He is trembling, as if he \n\thad slept with taut nerves, and jumps down quickly from the table. His \n\teyes are open, but he is still sleepy.\n\n\tAli smiles for a moment, and runs his fingers through Omar's hair.\n \n\t\t\t\tALI \n\t\tOmar, Omar. C'mon, wake up. Hurry, little \n\t\tone. Today you're going to see fireworks.\n\n\tThe child also smiles and his face relaxes, then brightens up. At the \n\tsame time, he extends his hand and pats Ali's side. Mahmoud enters the \n\troom from the balcony. He is carrying a tray with four cups of coffee. \n\n\t\t\t\tMAHMOUD\n\t\tIt's almost time, isn't it? \n\n\t\t\t\tALI \n\t\tYes.\n \n \tThen Ali turns to the curtain and calls:\n \n \t\t\t\tALI \n\t\tHassiba ...\n \n\t\t\t\tHASSIBA\n\t\tI'm ready.\n \n\tAli sits down and puts on a pair of sneakers. Petit Omar has finished \n\tdressing.\n      \n\tThe curtain is drawn, Hassiba appears, already dressed. \n\n\t\t\t\tMAHMOUD\n\t\tI heard the sound of a truck before ...\n \n \t\t\t\tALI \n\t\tMe too. But I don't think it was Sadek. \n\t\tOtherwise he'd be here by now.\n\n\tHassiba is dressed in European clothes, a skirt and blouse. She nears \n\tthe table and takes a cup of coffee. \n\n\t\t\t\tHASSIBA \n\t\t\t(smiling)\n\t\tHow is your wife now?\n      \n\tMahmoud's face is expressionless. He shakes his head.\n \n\t\t\t\tMAHMOUD\n\t\tSo-so ... \n\n\tAli has finished putting on his shoes. He takes a cup of coffee. In the \n\tsame moment, outside the door is heard: \n\n\tMACHINE-GUN FIRE. \n\n\tThe four are startled. \n\n\t\t\t\tALI \n\t\t\t(shouting)\n\t\tInside! Inside!\n \n\tSimultaneously, all of them move toward the hiding place. \n\n\tMahmoud's wife appears at the door. Her face is despairing, but she \n\tmoves carefully, quickly, precisely. She closes the door. She puts the \n\tcoffee cups back on the tray, and hides everything in the sink.\n \n\tShe goes to the other side of the curtain. Ali is entering the hiding \n\tplace. The other three are already inside. Ali pushes the movable piece \n\tof wall toward him, and the woman helps him.\n\n\tThen, she takes a can from the night table; it is full of plaster mixed \n\twith coal dust. The woman spreads the paste in the joints between the \n\tbricks of the wall and the closure of the hiding place. At the same \n\ttime, shouting, shots, and the footsteps of paras are heard.\n\n\tAs soon as she has finished, the woman slips into bed under the sheets.\n\n\tThe paratroopers break into the room shouting, and make the woman get \n\tup. They drag her outside on the balcony.\n \n\n136 \tABDERAMES COURTYARD. OUTSIDE. DAWN.\n \n\tThey drag Mahmoud's wife down from the balcony to the center of the \n\tcourtyard, where now all the inhabitants of the building are standing \n\t-- men, women, children -- all of them with their hands to the wall, in \n\tfull sight of the paras who are guarding them.\n\n\tSadek's head is lowered. He passes along the balcony between Marc and \n\tthe captain. He stops in front of the door.\n \n\t\t\t\tCAPTAIN \n\t\t\t(mumbling softly)\n\t\tHere?\n \n\tThe Algerian nods yes. They enter.\n \n\n137\tALI'S ROOM. INSIDE. DAWN.\n \n \tSadek points toward the curtain. The captain signals him to go there. \n\tThe Algerian points to a spot in the brick baseboard.\n\n\tThe captain examines it and with his thumb, he tests the fresh plaster. \n\tHe bends down and leans his ear to the wall. He smiles as he listens to \n\tthe ...\n\n\tHEAVY BREATHING.\n \n\tIt is the same breathing that soon after Mathieu hears, bent in the \n\tsame position as the captain. The colonel gets up and looks around him.\n \n\tFour paras are ready with their machine guns aimed at the hiding place. \n\tOthers are arranging plastic charges along the wall, all of them \n\tconnected to a single fuse.\n \n\tIn a corner, Sadek, wearing his cap and army camouflage fatigues, is \n\tsitting on a chair.\n\n\tHe is watching the scene with his eyes wide open. He is trembling. His \n\tbody is slouched forward. He seems to be lifeless, without nerves. If \n\tit weren't for his face, he would seem to be a heap of rags.\n \n\t\t\t\tMATHIEU \n\t\t\t(to the captain)\n\t\tEverything ready?\n \n \t\t\t\tCAPTAIN \n\t\tYes, sir.\n \n \t\t\t\tMATHIEU \n\t\tHe hasn't answered?\n \n \t\t\t\tCAPTAIN \n\t\tNo, sir. Total silence. \n\n\t\t\t\tMATHIEU \n\t\tI thought so. It was obvious.\n \n\tMathieu bends down again and leans his ear against the bricks. He gets \n\tup again. He remains a minute in this position, lost in thought.\n\n\t\t\t\tMATHIEU \n\t\t\t(loudly and markedly)\n\t\tAli ... Ali la Pointe ... You're going to \n\t\tbe blown up. Let the others come out, at \n\t\tleast the child. We'll let him off with \n\t\treformatory school ... Why do you want to \n\t\tmake him die?\n\n\tMathieu stops, and shakes his head. He turns to the captain: \n\n\t\t\t\tMATHIEU \n\t\tLet's go ...\n\n\tA paratrooper is unrolling a large bundle of fuse. \n\n\t\t\t\tCAPTAIN \n\t\tBring it down there, till it reaches \n\t\toutside ...\n \n\t\t\t\tPARA \n\t\tYes, sir ...\n\n\tMathieu has stopped in front of Sadek. He looks at him.\n \n\t\t\t\tMATHIEU \n\t\tIs this one still here? ... Take him away. \n\n\tTwo paratroopers grab the street cleaner by the armpits and almost \n\tlifting him completely, they lead him away. Mathieu is about to go out, \n\tthen turns and takes the megaphone from the captain's hands, and places \n\tit to his mouth. \n\n\t\t\t\tMATHIEU \n\t\tAli! Ali la Pointe! I am giving you \n\t\tanother thirty seconds. What do you hope \n\t\tto gain? You've lost anyway. Thirty \n\t\tseconds, Ali, starting now.\n \n\n138\tALI'S HIDING PLACE. INSIDE. DAWN.\n \n \tAli la Pointe's eyes are staring at the square piece of wall that seals \n\tthe hiding place. His glance is taciturn, gloomy. The others are \n\twatching Ali. Their lips are half-open, their breasts rise and fall in\n \tlaborious breathing.\n \n \t\t\t\tALI \n\t\t\t(in deep, resigned voice) \n\t\tWho wants to leave?\n \n\tPetit Omar presses against Ali's arm; he looks like a son with his \n\tfather.\n \n\tMahmoud takes his head in his hands and squeezes it.\n \n \t\t\t\tHASSIBA\n\t\tWhat are you going to do? \n\n\t\t\t\tALI \n\t\tI don't deal with them.\n \n\n139\tALI'S ROOM. INSIDE. DAWN.\n \n \tMathieu checks his watch; thirty seconds have passed. He moves to go \n\tout. The four paras with machine guns are still in the room.\n \n \t\t\t\tCAPTAIN \n\t\t\t(to another paratrooper)\n\t\tYou stay here by the door to signal the \n\t\tothers. When I call you, all of you come \n\t\tdown ...\n \n\n140\tRUE DES ABDERAMES. OUTSIDE. MORNING.\n \n \tThe sun has risen to the height of the terraces. \n\n\tThe terraces are swarming with people.\n \n\tThe alley is empty and only the fuse is visible; it reaches to a small\n\tclearing full of paratroopers. Two more colonels and a general have \n\tarrived.\n \n\tThere is a paratrooper with an \"Arriflex\" ready to film the explosion.\n \n\tThe atmosphere is that of a show. Two paratroopers are connecting the \n\tends of the fuse to the electric contact.\n \n\tOn the terraces, there are Algerian women, children, and old people.\n\n\tTheir eyes are motionless; someone is praying. There is an atmosphere \n\tof suspense.\n \n\tThere is also the wife of Mahmoud; her eyes seem blank. \n\n\tFive paras come out of the house quickly, and pass along the alley \n\ttoward the clearing.\n\n\tThe captain signals, and the para begins to lower the contact switch \n\tslowly.\n \n\tThe eyes of all are motionless. The camera is ready. But the explosion \n\tdoes not occur.\n      \n\tThe paratrooper swears; he examines the wires.\n \n \t\t\t\tCAPTAIN \n\t\tStand back! Ready, Pierre?\n \n \tPierre responds by mumbling something, and at the same time his hands \n\tare moving frenziedly around the wires.\n \n\n141\tALI'S HIDING PLACE. INSIDE. MORNING.\n \n \tAli la Pointe bends over Petit Omar as if to cover him. Hassiba has \n\tstopped breathing, her eyes wide open; Mahmoud is crying ...\n\n\tA single image, a second and now: \n\n\tTHE EXPLOSION.\n \n\n142 \tRUE DES ABDERAMES. OUTSIDE. MORNING.\n \n\tThe house collapses in a white cloud, as if its foundations had \n\tsuddenly been removed.\n \n\tMathieu and the other officers move away. Behind them the echo of the \n\texplosion continues to resound, then shouts, orders, and isolated \n\tju-ju.\n \n\tMathieu's face is weary but his expression is relieved. He is smiling.\n \n\t\t\t\tGENERAL\n\t\tAnd so the tapeworm no longer has a head. \n\t\tAre you satisfied, Mathieu? In Algiers \n\t\teverything should be over.\n \n\t\t\t\tMATHIEU \n\t\tYes, I believe there won't be any more \n\t\ttalk of the NLF for some time.\n \n\t\t\t\tGENERAL\n\t\tLet's hope forever. \n\n\tAnother colonel intervenes:\n \n \t\t\t\t1ST COLONEL\n\t\tAt heart they are good people. We've had \n\t\tgood relations with them for a hundred and \n\t\tthirty years ... I don't see why we \n\t\tshouldn't continue that way.\n\n\t\t\t\t2ND COLONEL\n\t\tYes, but Algiers is not the only city in \n\t\tAlgeria. \n\n\t\t\t\tMATHIEU \n\t\t\t(smiling)\n\t\tBah, for that matter, Algeria isn't the \n\t\tonly country in the world ...\n \n\t\t\t\tGENERAL \n\t\t\t(smiling)\n\t\tWhy, yes, of course ... But for the \n\t\tmoment, let's be satisfied with Algiers! \n\t\tIn the mountains our work is always \n\t\teasier.\n \n\tGradually the officers move away down the slanting street toward their \n\tjeeps, and their remarks fade away and are lost.\n \n\n143\tCASBAH STREETS. DEMONSTRATIONS. OUTSIDE. DAY. DECEMBER 1960.\n \n\tLike the cries of birds, of thousands of wild birds, the ju-jus invade \n\tand shake the black sky. \n\n\tJU-JU-JU ...\n\n\tAnd below, in the Casbah the white cloaks of the Algerians are like \n\tstreams, floods; through the alleys, down the stairways, through the \n\tstreets and the squares, they flow toward the European city.\n \n\n144\tPRESS HALL. PREFECT'S OFFICE. INSIDE. DAY.\n \n \tIn the press hall, the journalists are taking the telephones by force, \n\tshouting at the top of their voices. An English journalist:\n \n\t\t\t\tJOURNALIST\n\t\tNo one knows what could have been the \n\t\tpretext. The fact is that they seem to be \n\t\tunleashed without warning ... I telephoned \n\t\tLausanne ... yes, Lausanne. I spoke with \n\t\tan NLF leader in exile. They don't know \n\t\tanything there.\n \n\n145\tALGIERS STREETS. DEMONSTRATION. OUTSIDE. DAY/NIGHT.\n \n\tIn front, the adolescents, very young boys and girls, their mouths wide \n\topen, their eyes burning, laughing, their arms stretched above them, \n\traised and lowered to mark the rhythm.\n \n\t\t\t\tVOICES\n\t\tAlgerie! \n\t\tMu-sul-mane!\n \t\tAlgerie Musulmane!\n \n \tThe paratroopers jump down from the trucks, and rush forward.\n\n\tThe policemen rush forward, soldiers, zouaves, the CRS ...\n\n\tDeployed in cordons, in a wedge, in turtle-like formations, in order to \n\tdivide, to scatter, to hold back ...\n\n\tBut the demonstrators will not move back, or divide. They continue to \n\tpress forward, pushing against the troops, face to face.\n \n\t\t\t\tVOICES\n\t\tFree Ben-Bel-la! \n\t\tFree Ben-Bel-la!\n \n\tThe Europeans are closing their doors, lowering shutters. They too, the \n\tyounger ones, the more decisive, are grouping together, trying to \n\tconfront the Algerians. They are less numerous, but armed ...\n\n\tThe first revolver shots resound in the streets, from the windows. Some \n\tAlgerians fall, but the others continue to advance. They are running \n\tnow, scattering.\n \n \t\t\t\tVOICES\n\t\tTa-hia Et-thou-ar! \n\t\t[Long live the partisans!]\n \n\tThe jeeps, the trucks, the sirens, the tear-gas bombs, machine gun \n\tfire.\n \n\tAnd then the tanks. The turrets move slowly in a semi-circle. The \n\tmachine gunner fires the first burst at point-blank. \n\n \t\t\t\tVOICES \n\t\tTa-hia el-Djez-air! \n\t\tTa-hia el-Djez-air! \n \n\tMeanwhile the sun has set, and shadows of night are visible.\n \n\t\t\t\tVOICE OF \n\t\t\t\tENGLISH \n\t\t\t\tJOURNALIST \n\t\t\t(off)\n\t\tToday the situation is tenser. In spite \n\t\tof pressure from the more intolerant \n\t\tcolonialist group it seems that the \n\t\tGovernment has given strict orders not \n\t\tto use arms except in emergency \n\t\tsituations. But this afternoon there were \n\t\tattempts to enter the European city by \n\t\tforce: as a result, the first casualties \n\t\t... Now calm has returned, although from \n\t\tthe Casbah continue to be heard those \n\t\tcries ... incoherent, rhythmic, \n\t\tnightmarish cries ...\n\n\tAnd then, from time to time, in the by now dark night, the shrill and \n\tangry ju-jus. \n\n\tJU-JU-JU ...\n \n\n146\tALGERIAN STREETS. FLAGS. OUTSIDE. DAY.\n \n\tThose cries continued until the following day.\n\n\tThe following day is sunny; the scene begins again like the day \n\tbefore. Only that ...\n \n\t\t\t\tVOICE OF \n\t\t\t\tENGLISH \n\t\t\t\tJOURNALIST \n\t\t\t(off) \n\t\tThis morning for the first time, the \n\t\tpeople appeared with their flags -- green \n\t\tand white with half moon and star. \n\t\tThousands of flags. They must have sewn \n\t\tthem overnight. Flags so to speak. Many \n\t\tare strips of sheets, shirts, ribbons, \n\t\trags ... but anyway they are flags.\n \n\tThousands of flags. All are carrying flags, tied to poles or sticks, or \n\twaving in their hands like handkerchiefs. Waving in the sullen faces of \n\tthe paratroopers, on the black helmets of the soldiers.\n \n\t\t\t\tSPEAKER \n\t\t\"Another two years had to pass and \n\t\tinfinite losses on both sides; and then \n\t\tJuly 2, 1962 independence was obtained --\n\t\tthe Algerian Nation was born.\"\n \n \t\t\t\tVOICES \n\t\tTa-hia el-Djez-air! \n\t\tTa-hia el-Djez-air! \n\t\tTa-hia el-Djez-air!\n\n \n\n \n\t\t\t\tTHE END\n \n  \n\n\n\n\n\n\n\n\nScreenplay by Franco Solinas \n\n\n\n\n\n\nBattle of Algiers, The\nWriters :   Gillo Pontecorvo  Franco Solinas\nGenres :   Drama  War\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:30.243688"}