{"title": "Beloved", "film_link": "/Movie Scripts/Beloved Script.html", "script_link": "/scripts/Beloved.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Beloved Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Beloved.jpg\" title=\"Beloved Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Richard LaGravenese\" title=\"Scripts by Richard LaGravenese\">Richard LaGravenese</a><br/>  <a href=\"/writer.php?w=Toni Morrisson\" title=\"Scripts by Toni Morrisson\">Toni Morrisson</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> : October 1996<br/>\n<b>Movie Release Date</b> : October 1998<br/>\n<br/>\n<a href=\"/scripts/Beloved.html\">Read \"Beloved\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                               BELOVED\n</b>\n\n                              Written by\n\n                          Richard LaGravenese\n\n\n\n                         Based on the Novel by\n\n                             Toni Morrison\n\n\n\n\n\n                                                October 11, 1996\n\n\n\n\n\n<b>     FADE IN...\n</b>\n<b>     EXT. 124 BLUESTONE ROAD - DAWN.\n</b>\n     It is winter in Ohio. A house sits isolated beside a barren\n     field. The field stretches beyond, until a line of distant\n     woods stops it. Around the back of the house stands a rundown\n     STORAGE SHED, a cold house, a privy and a water pump. A porch\n     with a single door serves as the only entrance.\n\n     Camera begins a slow move toward the house as we;\n\n<b>     SUPER - OHIO, 1865\n</b>\n     WE HEAR SOUNDS from inside the house - BUMPS, A CHAIR FALLING\n     OVER...and FEET RUNNING on wooden floor boards.\n\n<b>                                                            CUT TO:\n</b>\n<b>     INT. 124 BLUESTONE ROAD - DAWN.\n</b>\n<b>     C.U. - THE HANDS OF TWO BROTHERS HOLDING EACH OTHER AS THEY\n</b><b>     RUN DOWN THE STAIRS..\n</b>\n     BULGAR (13 yrs. old) and HOWARD (14 yrs. old) run down the\n     steps from the second floor. They are fully dressed, carrying\n     a small bag of belongings.\n\n<b>                         HOWARD\n</b>               We gonna need food. Wait here.\n\n     Bulgar reluctantly lets go of Howard's hand as the latter\n     runs into the kitchen. Alone, he edges towards the front\n     door, when suddenly;\n\n     THE DOOR SLOWLY CREAKS OPEN on it's own. Scared, he steps\n     away slowly.\n\n<b>     INT. KITCHEN - DAWN.\n</b>\n     Howard is trying to toss some food into a bag. He spots A\n     CAKE sitting on top the wooden table, with some pieces\n     already eaten. He finds a knife and approaches the table.\n\n     He is about to cut into the cake when he sees TWO TINY HAND\n     PRINTS appear on the cake's surface. Howard stops cold -\n     dropping the knife.\n\n<b>     INT. FRONT ENTRANCE - DAWN.\n</b>\n     Howard exits the kitchen and takes Bulgar's hand;\n\n<b>                         HOWARD\n</b>               Come on!\n\n<b>                         DENVER (OS)\n</b>               Bul?\n\n     The boys look up the stairs and see their baby sister, nine\n     year old DENVER.\n\n<b>                         DENVER\n</b>               Where you goin?\n\n     The brothers are brokenhearted at the sight of her. They love\n     their sister. But there are stronger forces here.\n\n     A MIRROR on a wall beside Howard cracks down the middle.\n\n<b>                         HOWARD\n</b>               We gotta go!\n\n     Bulgar looks up to Denver. They exchange a look of deep\n     affection and pained longing. He wants to take her.\n\n<b>                         HOWARD\n</b>               Bye, Denver. You take care.\n\n<b>                         DENVER\n</b>               Bye? Bul?\n\n     Bulgar is starting to cry. He rushes up the steps and hugs\n     his sister. He kisses her hard then breaks away. Denver's\n     outstretched hand misses his shirt and hangs mid-air.\n\n<b>                         DENVER\n</b>               No..Bul...\n\n     Bulgar flies down the steps and disappears out of the house\n     holding Howard's hand once more.\n\n     Denver sits alone at the top of the stairs.  She sadly looks\n     up and weeps, as if to the house itself:\n\n<b>                         DENVER\n</b>               Now what you go and do that for?\n\n<b>     EXT. ROAD TO THE TRAIN - DAWN.\n</b>\n     THE VOICE OF SETHE HUMMING A MELODY carries over the images\n     of:\n\n     The two boys running for their lives towards the train,\n     holding hands all the way.  Howard is the first to reach it.\n     As it passes by, he throws his bag upon it and jumps in.\n     Bulgar races beside it as Howard reaches for him.\n\n     C.U. - HOWARD'S HAND reaching for BULGAR's...They connect.\n\n     WIDE SHOT - The boys are on the train as it leaves town.\n\n     On it's route, the train passes a ramshackle GRAVEYARD.\n\n     CAMERA MOVES SLOWLY INTO THE GRAVEYARD until it reaches A\n     HEADSTONE, made with flecked pink stone. Upon the headstone\n     is only one word:\n\n<b>     BELOVED.\n</b>\n<b>     EXT. 124 BLUESTONE RD. - CONTINUOUS.\n</b>\n     Camera moves slowly towards the side exterior of 124, into a\n     Close-Up of a WOMAN looking out of a second floor bedroom\n     window. It is SETHE, mother of the two boys and Denver. She\n     hums her melody, softly, sadly, with a resigned understanding\n     of why her boys are running away...and a deep pain that is\n     too constant to notice.\n\n<b>                                                          FADE OUT;\n</b>\n<b>     FADE IN:\n</b>\n<b>     INT. 124 - BABY SUGGS BEDROOM - LATER THAT DAY.\n</b>\n     BABY SUGGS, grandmother and mother-in-law to Sethe, sits in\n     her bed fondling colored fabric of BRIGHT GREEN..It is the\n     only vibrant color in an otherwise drab surrounding. Suggs is\n     bed-ridden, exhausted to her bones - her face a mosaic of\n     suffering and sacrifice and tested faith.\n\n<b>                         BABY SUGGS\n</b>               Ya know what I'd love to see? I loved to\n               see me some lavender. You got any\n               lavender? Or even pink - pink'll do.\n\n     Sethe is placing folded laundry into a dresser. She stops and\n     checks her pockets for rags or swatches...She looks around\n     the room..\n\n<b>                         SETHE\n</b>               No. Sorry.\n\n<b>                         BABY SUGGS\n</b>               Ah, winter in Ohio is especially rough if\n               you've got an appetite for color.\n\n     Suggs goes back to contemplating her green until;\n\n<b>                         SETHE (OS)\n</b>               Oh wait...\n\n     Suggs looks up to see Sethe sticking her pink tongue out at\n     her. Suggs smiles.\n\n<b>                         BABY SUGGS\n</b>               Oh, that's fine. Fine.\n\n     Sethe lets out a small laugh. She walks toward the window,\n     stretching her body. Her expression changes as she thinks of\n     her boys. Baby Suggs reads her like a book.\n\n<b>                         BABY SUGGS\n</b>               They'll be all right. I'm surprised they\n               lasted here this long.\n\n<b>                         SETHE\n</b>               I don't know. Maybe we should have moved.\n\n<b>                         BABY SUGGS\n</b>               What'd be the point? Not a house in the\n               country ain't packed to the rafters with\n               some dead Negro's grief. We lucky our\n               ghost is a baby. My husband spirit come\n               back? Or yours? Don't talk to me! Ha..You\n               lucky. You got one child left, still\n               pullin at your skirts. Be thankful. I had\n               eight. Eight with six fathers. Every one\n               of them gone from me. Four taken, four\n               chased and all, I expect, worrying\n               somebody's house into evil. My first born\n               - alls I can remember of her now is how\n               she loved the burned bottom of bread. Her\n               little hands..I wouldn't know'em if they\n               slapped me. Can you beat that? Eight\n               children and that's all I remember.\n<b>               \n</b><b>                         SETHE\n</b>                    (returning to her work)\n               You remember Halle.\n\n<b>                         BABY SUGGS\n</b>               Oh, I remember bits and pieces of all\n               of'em I guess..Halle, of course..I had\n               Halle a lifetime. Almost twenty years...\n               My two girls, sold and gone before I\n               could even a heard about it, and them\n               without their grown up teeth yet. My\n               third child, my son after Halle...I let\n               that straw boss have me for four months\n               so's I could keep that boy. Next year, he\n               had him traded for lumber anyway and me\n               pregnant with his child. I couldn't love\n               that child. I wouldn't. Not any of the\n               rest either. God take what He\n               would....and He did...\n\n<b>                         SETHE\n</b>               The boys wouldn't have left if Halle were\n               here.\n\n<b>                         BABY SUGGS\n</b>               Those boys didn't even know him. You had\n               six whole years of marriage to my Halle\n               Fathered every one of your children. A\n               blessing. I learned hard that a man's\n               just a man, but a son like that...like\n               Halle..now that's somebody.\n\n     Sethe's mixed feelings show all over her face. Although she\n     loved Halle, there is clearly something unresolved in her.\n\n<b>                         SETHE\n</b>               Just got a few more things to do, then\n               I'll start supper.\n\n     Sethe exits.\n\n<b>     EXT. 124 BLUESTONE RD. - LATE DAY.\n</b>\n     Denver is playing in the front yard by herself.\n\n     Sethe is pumping water into a bucket for clothes washing. A\n     gentle breeze carries a LEAF into the bucket. Sethe sees it\n     floating atop the water for a moment, then picks it up.\n\n     C.U. of SETHE as the image triggers a feeling - and the\n     feeling a memory - from long ago.\n\n     Sethe looks around her and finds she is no longer standing in\n     the barren field of 124...but rather-\n\n<b>     MEMORY;\n</b>\n<b>     EXT. SWEET HOME - LATE DAY.\n</b>\n     A stunning vista of the plantation SWEET HOME - sun beating\n     down on groves and rows of gorgeous sycamores for as far as\n     the eye can see. Sethe's figure dwarfed by the majestic\n     landscape.\n\n     Sethe looks frightened. Her breathing grows shallow. She\n     hears something;\n\n     THE SOUND OF A WAGON'S WHEELS - rolling over a road, growing\n     louder, coming towards her\n\n<b>                                                          INTERCUT;\n</b>\n<b>     C.U. OF A WAGON WHEEL MOVING RAPIDLY ON A ROAD. CAMERA PANS\n</b><b>     UP TO THE MAN DRIVING THE WAGON - A STERN WHITE MAN WEARING A\n</b><b>     DISTINCTIVE HAT...\n</b>\n     SETHE TURNS away from the sycamores towards the road to see;\n\n<b>     END OF MEMORY;\n</b>\n<b>     EXT. 124 BLUESTONE - LATE DAY.\n</b>\n     A MAN driving a horse and wagon with two children in the\n     back, coming up Bluestone Road. He wears no hat.\n\n     Sethe breathes easily. She looks around her -the reality of\n     124's barren field has returned. The memory of Sweet Home's\n     sycamores have vanished.\n\n     Denver is playing near the road. As the wagon nears 124,\n     Denver looks up and smiles. The Man whips the horse hard so\n     as to ride past the house faster. The children stare at\n     Denver and 124, with horror and curiosity.\n\n     The stares of the children destroy Denver's smile. She\n     watches them go, then turns to hide her upset and sees her\n     mother watching her.\n\n     Sethe looks to Denver with empathy and impotence: wanting to\n     ease her daughter's pain and knowing full well she cannot.\n\n     Hurt and angry, Denver runs past Sethe, towards the woods.\n\n<b>     EXT. WOODS - LATE DAY.\n</b>\n     Denver runs with a purpose, knowing exactly where she is\n     going.\n\n     She reaches FIVE BOXWOOD BUSHES planted in a ring. The tall\n     bushes stretch toward each other four feet off the ground,\n     forming a round, emerald room in the center, seven feet high,\n     with walls fifty inches thick of murmuring leaves.\n\n     This is Denver's private place. She bends low and crawls\n     through the leaves into the center. Once there, this lonely\n     child wipes away her tears and tries to pull herself\n     together. She lays her face against the cool earth.\n\n<b>     INT. 124 BLUESTONE RD. - NIGHT.\n</b>\n     Denver walks to her room in her night dress. She passes the\n     opened door of her mother's bedroom and peeks in:\n\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     Sethe kneeling by her bed, as if praying...\n\n     Beside Sethe, A WHITE DRESS KNEELS as well, with it's sleeve\n     around Sethe's waist. Like two friendly grown-up women,\n     comforting each other in prayer.\n\n     Denver tip toes away.\n\n<b>     INT. DENVER'S ROOM - NIGHT.\n</b>\n     Sethe enters to check on Denver, whom she thinks is asleep.\n     She leans over and kisses her forehead, only to discover she\n     is awake;\n\n<b>                         DENVER\n</b>               Mama?\n\n<b>                         SETHE\n</b>               What is it baby?\n\n<b>                         DENVER\n</b>               You think maybe when daddy comes, he\n               could talk to the baby ghost. Maybe make\n               her behave and then people won't be\n               scared of here no more.\n\n<b>                         SETHE\n</b>               I don't know.\n\n<b>                         DENVER\n</b>               Why won't she ever settle?\n\n<b>                         SETHE\n</b>               She's mad like a baby gets mad. You\n               forgetting how little it is. She wasn't\n               even two years old when she died. Too\n               little to understand.\n\n<b>                         DENVER\n</b>               For a baby she throws a powerful spell.\n\n<b>                         SETHE\n</b>               No more powerful than the way I loved her.\n\n     Hearing her mother say this, moves Denver.\n\n<b>                         DENVER\n</b>               What do you pray for Mama?\n\n<b>                         SETHE\n</b>               Oh, I don't really pray anymore. I just\n               talk.\n\n<b>                         DENVER\n</b>               About what?\n\n<b>                         SETHE\n</b>               Oh, about time. How some things go. Pass\n               on. Some things just stay.\n\n<b>                         DENVER\n</b>               What things?\n\n<b>                         SETHE\n</b>               Like, the place I was at before here -\n               Sweet Home. Even if that whole farm and\n               every tree and blade of grass on it died -\n               it'll still be there. Waiting. And if you\n               go and stand in the place where it was,\n               what happened there once, will happen\n               again.\n\n<b>                         DENVER\n</b>               If it's still there, waiting, that mean\n               nothing ever dies?\n\n<b>                         SETHE\n</b>               Nothing ever does. That's why I had to\n               get my children out. No matter what.\n               That's why you can never go there.\n\n<b>                         DENVER\n</b>               You never tell me all what happened. Just\n               that they whipped you and you run off\n               pregnant with me.\n\n<b>                         SETHE\n</b>               You don't need to know nothing else.\n\n<b>                         DENVER\n</b>                    (nods)\n               I saw a white dress kneeling next to you\n               when you was praying.\n\n<b>                         SETHE\n</b>               White? Maybe it was my bedding dress.\n               Describe it to me.\n\n<b>                         DENVER\n</b>               Had a high neck. Whole mess of buttons\n               coming down the back.\n\n<b>                         SETHE\n</b>               Buttons. Well, that's not my bedding\n               dress. I never had a button on nothing.\n               What else?\n\n<b>                         DENVER\n</b>               A bunch at the back. On the sit down\n               part.\n\n<b>                         SETHE\n</b>               A bustle?\n\n<b>                         DENVER\n</b>               I don't know what it's called.\n\n<b>                         SETHE\n</b>               You say it was holding on to me. How?\n\n<b>                         DENVER\n</b>               Kneeling next to you while you were\n               praying. I mean, talking. It looked just\n               like you.\n\n<b>                         SETHE\n</b>               Well, I'll be.\n\n<b>                         DENVER\n</b>               I think it was a sign. I think maybe\n               baby's got plans.\n\n<b>                         SETHE\n</b>               What plans?\n\n<b>                         DENVER\n</b>               I don't know, but that dress holding onto\n               you got to mean something.\n\n<b>                         SETHE\n</b>               Maybe. Maybe it does.\n\n     Sethe smiles sympathetically for her lonely child. They hear\n     a sound in the house - floor boards creaking.\n\n<b>                         DENVER\n</b>               She's crawling again.\n\n     Sethe nods and holds her daughter's hand as they listen.\n\n<b>                                                          FADE OUT;\n</b>\n<b>     SUPER: 1873.\n</b>\n<b>                                                           FADE IN;\n</b>\n<b>     EXT. 124 BLUESTONE ROAD - DAY.\n</b>\n<b>     C.U. - PAUL D. GARNER.\n</b>\n     Paul stands on the road, gazing up at the house. Grateful\n     he's arrived, cautious about what he'll find, he steps\n     towards the porch. His clothes are ragged. His feet sore and \n     blistering in his shoes.\n\n<b>     EXT. THE PUMP - DAY.\n</b>\n     Off to the side of the house, Sethe washes her feet and legs\n     at the pump. She looks up and sees Paul's figure walking\n     towards the house. The sun blazes in her eyes. She can't make\n     out who it is, or whether or not he's even real. As he\n     reaches the porch, Paul disappears from view.\n\n     Sethe walks towards the front of the house. When she is\n     little more than forty feet away, she stops - still not\n     certain Paul is a real man or an hallucination of the past.\n\n<b>                         SETHE\n</b>               Paul? Paul D.? Is that you?\n\n<b>                         PAUL\n</b>                    (smiles)\n               What's left.\n                    (He rises)\n               How you been girl, besides barefoot?\n\n     Sethe jams her balled up stockings into her pocket. She\n     smiles like a little girl, not able to believe her eyes.\n\n<b>                         SETHE\n</b>               You looking good.\n\n<b>                         PAUL\n</b>               Devil's confusion. He lets me look good\n               long as I feel bad.\n\n<b>                         SETHE\n</b>               How long has it been?\n\n<b>                         PAUL\n</b>               'Bout eighteen years, I figure.\n\n<b>                         SETHE\n</b>               Eighteen years.\n\n<b>                         PAUL\n</b>               And I swear I been walking every one of\n               them. Mind if I join you?\n\n     He begins taking off his shoes.\n\n<b>                         SETHE\n</b>               You want to soak them? Let me get you\n               some water.\n\n<b>                         PAUL\n</b>               No, uh, uh. Can't baby feet. A whole more\n               tramping they got to do yet.\n\n<b>                         SETHE\n</b>               You're not leaving right away, are you?\n               You stay awhile.\n\n<b>                         PAUL\n</b>               Well, long enough to see Baby Suggs,\n               you..Where is she?\n\n<b>                         SETHE\n</b>               Dead.\n\n<b>                         PAUL\n</b>               Aw no. When?\n\n<b>                         SETHE\n</b>               Eight years now. Almost nine.\n\n<b>                         PAUL\n</b>               Was it hard? I hope she didn't die hard.\n\n<b>                         SETHE\n</b>               Soft as cream. Being alive was the hard\n               part. Sorry you missed her though. Is\n               that what you came by for?\n\n<b>                         PAUL\n</b>               That's some of what I came for. The rest\n               is you.\n\n     Sethe doesn't know what to do with her eyes when he says\n     this..she looks away instinctively. Paul realizes that may\n     have sounded too intimate so he leans back and sighs:\n\n<b>                         PAUL\n</b>               The truth be known, I go anywhere these\n               days. Anywhere they let me sit down.\n\n<b>                         SETHE\n</b>               Come on inside.\n\n<b>                         PAUL\n</b>               Porch is fine. Cool out here. Sit with\n               me.\n\n     Like a nervous little girl, Sethe takes a sit beside a man\n     for the first time in years, folding her sweat stained skirt\n     beneath her.\n\n<b>                         PAUL\n</b>               So Baby Suggs is gone. Somehow never\n               thought death would find her.\n\n<b>                         SETHE\n</b>               It finds everyone.\n\n<b>                         PAUL\n</b>               We managed well enough without meeting\n               it.\n\n<b>                         SETHE\n</b>               I suppose.\n\n     Awkward pause. Sethe tries to find the words to a difficult\n     question - but one that is foremost in her mind;\n\n<b>                         SETHE\n</b>               I wouldn't have to ask about him, would\n               I?...You'd tell me if there was anything\n               to tell, wouldn't you?\n\n     Paul knows instantly she is asking about Halle.\n\n<b>                         PAUL\n</b>               You know I would. But I don't know any\n               more about what happened to Halle now\n               than I did then.\n\n     Something about Paul's expression might suggest he's keeping\n     something from her. He turns his gaze outward as he says;\n\n<b>                         PAUL\n</b>               You must think he's still alive.\n\n<b>                         SETHE\n</b>               No. I think he's dead. It's just not\n               being sure that keeps him alive.\n\n<b>                         PAUL\n</b>               What did Baby Suggs think?\n\n<b>                         SETHE\n</b>               Same. Ha, listen to her, all her children\n               dead and she felt each one go the very\n               day and hour it happened.\n\n<b>                         PAUL\n</b>               When she say Halle went?\n\n<b>                         SETHE\n</b>               1855. Same day my baby was born.\n\n<b>                         PAUL\n</b>               You had that baby, did you? Damn, never\n               thought you'd make it. Running off\n               pregnant.\n\n<b>                         SETHE\n</b>               Had to. Couldn't be no waiting.\n\n<b>                         PAUL\n</b>               All by yourself too.\n\n<b>                         SETHE\n</b>               Almost. A white girl helped me.\n\n<b>                         PAUL\n</b>               Then she helped herself, God bless her.\n\n     Awkward silence.\n\n<b>                         SETHE\n</b>               We got spare rooms. You could stay the\n               night, if you had a mind to.\n\n<b>                         PAUL\n</b>               You don't sound too steady in the offer.\n\n<b>                         SETHE\n</b>               Oh it's..it's truly meant. I just hope\n               you'll pardon my house.\n\n     Paul smiles a warm, touched smile that after all that they've \n     survived, Sethe is worried about what he'll think of her\n     home.\n\n<b>                         PAUL\n</b>               My house. I like the sound of that.\n\n     Sethe smiles, then rises to escort him in.\n\n<b>     INT. 124 BLUESTONE ROAD - DAY.\n</b>\n     Sethe opens the front door and enters, with Paul behind her,\n     hanging his shoes by the laces over his shoulder. As he\n     follows her in;\n\n     A POOL OF RED, UNDULATING LIGHT forms around him. It worries\n     him.\n\n<b>                         PAUL\n</b>               You got company?\n\n<b>                         SETHE\n</b>               On and off.\n\n     The light undulates faster and faster, extending all the way\n     to the kitchen at the end of the hall. Frightened, Paul steps\n     back out the door.\n\n<b>                         PAUL\n</b>               Good God! What kind of evil you got in\n               there?\n\n<b>                         SETHE\n</b>               It's not evil..It's just..just sad. Come\n               on. Just step through.\n\n     Sethe reaches out her hand. Paul tentatively takes it and is\n     lead through the red light of the hallway, through to the\n     kitchen where it ends.\n\n     As he walks through, we can see Paul affected by the light.\n     It is sad. A sadness that touches him, welling up inside\n     until tears are brimming in his eyes. He reaches the normal\n     light of the kitchen and steps out of it.\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Paul turns back to find the red light in the hall is gone.\n\n<b>                         PAUL\n</b>               I thought you said she died soft as cream.\n\n<b>                         SETHE\n</b>                    (busying herself in kitchen)\n               Oh that's not Baby Suggs. That's my\n               daughter. The one I sent ahead with the\n               boys before I run off.\n\n<b>                         PAUL\n</b>               She didn't live?\n\n<b>                         SETHE\n</b>               No.\n\n<b>                         PAUL\n</b>               The boys too?\n\n<b>                         SETHE\n</b>               No, they alive - they run off before Baby\n               Suggs died. The one I was carrying when I\n               left Sweet Home is all I got left.\n\n     Still affected by the light, Paul eases himself down at the\n     table, finding something to say.\n\n<b>                         PAUL\n</b>               Well, probably best..If a Negro boy got\n               legs he ought to use them. Sit down too\n               long, somebody figure out a way to tie\n               them up.......\n                    (the image disturbs Sethe)\n               You by yourself then?\n\n<b>                         SETHE\n</b>               Me and Denver... my daughter.\n\n<b>                         PAUL\n</b>               No man?\n                    (Sethe shakes head \"no\")\n               And that's all right by you?\n\n<b>                         SETHE\n</b>               It's all right by me...I cook at a\n               restaurant in town. Sew a little on the\n               sly....\n\n     She places a bottle and a glass on the table before him. The\n     light jarred him. He snatches the bottle to drink and calm\n     himself down. She jokes.\n\n<b>                         SETHE\n</b>               You look more done in by a walk through\n               my front hall than all those eighteen\n               years of walking put together.\n\n<b>                         PAUL\n</b>               Got that right.\n\n<b>     INT. SECOND FLOOR OF 124 - MORNING.\n</b>\n     Denver, all of eighteen years old now, and beautiful, is\n     buttoning up her dress when she hears the voice of a man down\n     in the kitchen. She stops. Her face lights up.\n\n<b>                         DENVER\n</b>               Daddy?\n\n     She runs down the white staircase.\n\n<b>     INT. KITCHEN - MORNING.\n</b>\n     As Denver runs into the kitchen, we hear:\n\n<b>                         SETHE (OS)\n</b>               Won't you stay a little while? Can't\n               nobody catch up on eighteen years in a\n               day.\n\n     Denver appears expectantly, down the white staircase that\n     leads from the second floor. She looks at Paul wide eyed.\n     They turn to her with gentle smiles;\n\n<b>                         SETHE\n</b>               Baby, this here's Paul D. Garner...Paul,\n               this is my Denver...Paul's the last of\n               the Sweet Home men.\n\n     Denver's heart sinks.\n\n<b>                         PAUL\n</b>               Good morning Miss Denver. It's a\n               pleasure.\n\n<b>                         DENVER\n</b>               Good morning, Mr. D.\n\n<b>                         PAUL\n</b>               Garner, baby. Paul D. Garner.\n\n<b>                         DENVER\n</b>               Yes sir.\n\n<b>                         PAUL\n</b>               Glad to get a look at you. Last time I\n               saw your mama, you were pushing out the\n               front of her dress. She's a fine looking\n               young lady, Sethe. Fine looking. Got her\n               daddy's sweet face.\n\n<b>                         DENVER\n</b>               You knew my father?\n\n<b>                         PAUL\n</b>               Knew him. Knew him well.\n\n<b>                         SETHE\n</b>               Of course he did. I told you, he's from\n               Sweet Home. Paul may stay with us a\n               while. Won't that be nice, having an old\n               friend stay a spell?\n\n     But Denver reacts with surprise and dismay. Paul is not her\n     friend. Paul, right now, is more of an intruder.\n\n<b>                         PAUL\n</b>               If that's all right with you, that is?\n\n<b>                         DENVER\n</b>               We have a ghost here, you know.\n\n<b>                         PAUL\n</b>               We met. But sad, your mama said. Not\n               evil.\n\n<b>                         DENVER\n</b>               No sir, not evil. But not sad either.\n\n<b>                         PAUL\n</b>               What then?\n\n<b>                         DENVER\n</b>               Lonely.\n\n<b>                         SETHE\n</b>               I don't see how it could be lonely\n               spending every minute with us like it\n               does.\n\n<b>                         DENVER\n</b>               It's my sister. She was just a baby when\n               she died in this house.\n\n<b>                         PAUL\n</b>               Reminds me of that headless bride back\n               behind Sweet Home. Remember that Sethe?\n               Used to roam them woods regular.\n\n<b>                         DENVER\n</b>                    (annoyed, resentful)\n               Mama doesn't like talk about Sweet Home.\n               Says it was never sweet and it sure\n               wasn't home.\n\n<b>                         SETHE\n</b>               Girl, mind yourself!\n\n<b>                         PAUL\n</b>               Now, now, she got it right there, Sethe.\n\n<b>                         SETHE\n</b>               But it's where we were. All together.\n               It's where I met your father. And it\n               comes back on us whether we want it to or\n               not....\n\n<b>                         DENVER\n</b>               Then why don't you ever tell me about it?\n\n     Sethe pauses - unnerved and irritated by Denver's challenge.\n\n<b>                         SETHE\n</b>               Denver, start up the stove. Paul must be\n               hungry.\n\n<b>                         PAUL\n</b>               Don't go to no trouble on my account.\n\n<b>                         SETHE\n</b>               Bread's no trouble. The rest I brought\n               back from where I work. Least I can do,\n               cooking dawn to noon, is bring dinner\n               home. You got any objections to pike?\n\n<b>                         PAUL\n</b>               If he don't object to me I don't object\n               to him.\n\n     He addresses his humor to Denver who offers no response. She\n     crosses to the stove and works on lighting it. She's mad.\n\n<b>                         DENVER\n</b>               Where's he going to sleep? Baby Sugg's\n               room got no sheets or nothing.\n\n<b>                         SETHE\n</b>               We'll figure it out.\n\n<b>                         DENVER\n</b>               Maybe you should stay with mama, Mr.\n               Garner. Then you two can talk about Sweet\n               Home all night long.\n\n<b>                         SETHE\n</b>                    (explodes)\n               What's the matter with you! I never knew\n               you to behave like this!\n\n<b>                         PAUL\n</b>               Leave her be, Sethe. I'm a stranger to her.\n\n<b>                         SETHE\n</b>               That's just it. She got no cause to act\n               up with a stranger.\n\n     Denver collapses where she stands, sobbing out loud. Sethe\n     moves to her.\n\n<b>                         SETHE\n</b>               Baby, what is it? Did something happen?\n\n     Denver moves away. Sethe registers this rejection.\n\n<b>                         DENVER\n</b>               I can't no more! I can't no more!\n\n<b>                         SETHE\n</b>               Can't what? What can't you?\n\n<b>                         DENVER\n</b>               I can't live here! I don't know where to\n               go or what to do but I can't live here.\n               Nobody speaks to us. Nobody comes by.\n               Nobody even knows I'm alive.\n\n<b>                         PAUL\n</b>               What she talking about 'nobody speaks to\n               you'?\n\n<b>                         SETHE\n</b>               It's the house. People don't...\n\n<b>                         DENVER\n</b>               It's not! It's not the house! It's us!\n               It's you!\n<b>                         SETHE\n</b>               Denver!\n\n<b>                         PAUL\n</b>               Leave off, Sethe. It's hard for a young\n               girl living in a haunted place. That\n               can't be easy.\n\n<b>                         SETHE\n</b>                    (growing irritated)\n               It's easier than some other things. Come\n               here, baby..\n\n     Denver allows herself to be held.\n\n<b>                         PAUL\n</b>               I'm a grown man with nothing new left to\n               see or do and I'm telling you it' ain't\n               easy. Maybe you oughta move.\n\n<b>                         SETHE\n</b>               No!\n\n<b>                         PAUL\n</b>               Sethe!\n\n<b>                         SETHE\n</b>               No. No moving. No leaving. It's all right\n               the way it is.\n\n<b>                         PAUL\n</b>               You going to tell me it's all right with\n               this child half out of her mind.\n\n<b>                         SETHE\n</b>                    (holding Denver in her arms)\n               I got a tree on my back and a haunt in my\n               house and nothing in between but the\n               daughter I'm holding in my arms. No more\n               running - from nothing! I will never run\n               from another thing on this earth, you\n               hear! I took one journey and I paid the\n               ticket but let me tell you something,\n               Paul D. Garner; it cost too much! Do you\n               hear me?! It cost too much! Now sit down\n               and eat with us or leave us be!\n\n     Sethe's sudden outburst startles Paul. He watches as Sethe\n     ushers Denver out to the keeping room off the kitchen to\n     quiet her down.\n\n     Alone, Paul is disturbed by Sethe's words. He fishes out a\n     pouch of tobacco and concentrates on it, searching for\n     smoking papers he knows he doesn't have...waiting for Sethe\n     to return.\n\n     When she does, she heads straight for the stove. She spits on\n     her finger and touches it to check it's heat. She then begins\n     to make bread from flour, soda and salt - keeping her back to\n     Paul throughout - as the scene continues;\n\n<b>                         PAUL\n</b>               What tree, Sethe?\n\n<b>                         SETHE\n</b>               Huh?\n\n<b>                         PAUL\n</b>               What tree on your back? I don't see\n               nothing growing on your back.\n\n<b>                         SETHE\n</b>               It's there all the same.\n\n<b>                         PAUL\n</b>               Who told you that?\n\n<b>                         SETHE\n</b>               White girl. That's what she called it. I\n               never seen it and never will. But she\n               said that's what it looked like. A\n               chokecherry tree. Leaves, branches. That\n               was 18 years ago. Could have cherries by\n               now for all I know...\n\n<b>                         PAUL\n</b>               I don't follow.\n\n     Sethe pauses. Something in her decides to tell Paul D,\n     although she keeps working on the bread to stay in control;\n\n<b>                         SETHE\n</b>               I had milk, see. I was pregnant with\n               Denver but I had milk for my baby girl\n               that I sent ahead with the boys. I hadn't\n               stopped nursing her when I sent her and\n               the boys ahead of me. Anybody could smell\n               me long before they saw me. Nothing I\n               could do about it. All I knew is I had to\n               get my milk to my little girl. Nobody was\n               going to nurse her like me. Nobody was\n               going to get it to her fast enough or\n               take it away when she had enough..nobody\n               knew she couldn't pass her air if you\n               held her up on your shoulder, only if she\n               was lying on your knee..Nobody knew that\n               but me...\n\n     Paul listens, half dreading where he thinks this story's going.\n\n<b>                         PAUL\n</b>               We was talking about a tree, Sethe.\n\n     Sethe works faster. It is the work, taking an action - any\n     action - that allows her tell the story numbly, without the\n     pain of reliving it...without the images attacking\n\n<b>                         SETHE\n</b>               Schoolteacher's boys drag me into the\n               barn and took my milk...\n\n     ....yet, the images come anyway.\n\n     INTERCUT: FLASHES OF MEMORY attack as SETHE TELLS HER\n<b>     STORY...\n</b>\n<b>                                                       JUMP CUT TO:\n</b>\n<b>     INT. BARN - A NIGHT REMEMBERED.\n</b>\n     - Sethe being raped, beaten, held down by SCHOOLTEACHER'S\n     BOYS in a barn with a loft...\n\n<b>                         SETHE (IN KITCHEN)\n</b>               ..Held me down in that barn and took it.\n\n<b>                                                       JUMP CUT TO:\n</b>\n     Sethe screams and is smacked across the face.\n\n<b>                         SETHE (IN KITCHEN)\n</b>               They were like boulders on me. Their\n               hands over my mouth and on my shoulders\n               and my legs.\n\n<b>                                                       JUMP CUT TO:\n</b>\n     One of the boys holds her face and mouth and head as the two\n     others hold down her body and ravage her....\n\n<b>                         SETHE (IN KITCHEN)\n</b>               I couldn't move. Alls I could see was the\n               loft above their heads.\n\n<b>                                                       JUMP CUT TO:\n</b>\n     Her mouth covered, her head immobile - she stares up at the\n     loft.\n\n<b>     END OF MEMORY IMAGES.\n</b>\n<b>                         PAUL\n</b>               The loft?\n\n<b>     INT. KITCHEN - PRESENT DAY.\n</b>\n     Sethe squeezes her eyes to erase the image and works harder\n     on the biscuit dough...The flashes of IMAGES STOP...\n\n<b>                         SETHE\n</b>               I told Mrs. Garner on them. She had that\n               lump on her neck and couldn't speak but\n               her eyes rolled out tears, I remember.\n               Them boys found out I told on 'em and\n               Schoolteacher made one open up my back,\n               and when it closed it made a tree.\n\n<b>                         PAUL\n</b>               They used cowhide on you?\n\n<b>                         SETHE\n</b>               And they took my milk.\n\n<b>                         PAUL\n</b>               They beat you and you was pregnant?\n\n<b>                         SETHE\n</b>               And they took my milk!\n\n     Sethe has separated the dough into biscuits which she slips\n     into the stove. As she rises, Paul steps gently behind her.\n     He slowly caresses her breasts from behind, pressing his\n     cheek against her back.. He rubs his cheek against it,\n     feeling the scars beneath the dress. Raising his fingers to\n     the hooks, as Sethe cries silently, he undoes her dress which\n     slips down to her hips, exposing the sculpture her back has\n     become.\n\n<b>                         PAUL\n</b>               Aw Lord, girl.\n\n     Grateful to have her body be someone else's responsibility\n     for the moment, Sethe closes her eyes as Paul touches every\n     ridge and leaf of her tree with his mouth. The tenderness is\n     almost unbearable.\n\n     Suddenly, PAUL'S LEGS BEGIN TREMBLING. He pauses and looks\n     down...He realizes it is not his legs that tremble, but\n     rather;\n\n<b>     THE FLOORBOARDS THEMSELVES ARE PITCHING, GRINDING, SHOVING\n</b>     the house from side to side.\n\n     Sethe slides to the floor, struggling with her dress.\n\n     On all fours, Denver crawls in from the keeping room as if\n     trying to keep the house together.\n\n     Paul, falling, reaching for an anchor, begins to shout;\n\n<b>                         PAUL\n</b>               GOD DAMN IT! HUSH UP! Leave this place\n               alone! Get the hell outta here!\n\n     A table rushes at him but Paul grabs it's leg. Managing to\n     stand at an angle as the house continues to pitch, he holds\n     the table by two legs and bashes it about, wrecking\n     everything, screaming at the house;\n\n<b>                         PAUL\n</b><b>               YOU WANT TO FIGHT, COME ON! GOD DAMN IT!\n</b><b>               SHE GOT ENOUGH WITHOUT YOU! SHE GOT ENOUGH!\n</b>\n     The quaking slows to an occasional lurch but Paul does not\n     stop whipping the table around until everything it is\n     absolutely still. He leans against the wall, panting.\n\n     Sethe is crouched by the stove. A mixed expression of relief\n     and guilt - the expression of a mother whose disobedient\n     child has been sent away. But a child she loves nonetheless.\n\n     Denver looks frightened. More alone than ever, now that her\n     one companion is gone.\n\n     All three are breathing together as if to the same beat, like\n     one tired person.\n\n<b>                                                      LAP DISSOLVE:\n</b>\n<b>     INT. KITCHEN - LATER THAT DAY..\n</b>\n     Denver walks through the broken furniture and dishes. At the\n     stove, she ashes over the fire and pulls the pan of biscuits\n     from the oven,\n\n<b>     EXT. 124 BLUESTONE RD. - CONTINUOUS.\n</b>\n     A shirtless Paul D. is by the water pump washing himself.\n\n<b>     INT. KITCHEN - CONTINUOUS.\n</b>\n     Denver lifts the fallen jelly cupboard, it's contents laying\n     in a heap in the corner of the bottom shelf. She takes out a\n     jar. She looks for a plate and finds half of one by the\n     broken table. She picks it up as she hears Paul enter through\n     the front door.\n\n<b>     INT. BABY SUGGS BEDROOM - CONTINUOUS.\n</b>\n     Sethe prepares a bed for Paul. Baby Suggs quilt is on the\n     bed. She hesitates whether or not to leave it there.\n\n     Paul stands by the door with his shoes in his bands, his\n     shirt hanging open down the front.\n\n     Sethe is surprised to see him there - she feels awkward.\n\n<b>                         SETHE\n</b>               Why don't you...take a rest..I'll call\n               you when we're ready.\n\n<b>                         PAUL\n</b>               Sure you don't want me to help clean up?\n\n<b>                         SETHE\n</b>               No..you'd just get in my way. Denver and\n               me'll do it.\n\n     They stand in silence, looking at each other for a moment.\n     The awkwardness they both feel strike them suddenly as funny.\n     Paul starts smiling. Sethe covers her mouth to conceal it.\n\n     And then, just as quickly, the urge to laugh subsides - and\n     the fear they feel takes it's place.\n\n     Paul slowly closes the door and places his shoes on the\n     floor. Sethe watches him. Paul crosses to her. He moves in to\n     kiss her. They approach each other's lips like two burn\n     victims, trying desperately not to hurt the other with their\n     touch.\n\n<b>     EXT. 124 BLUESTONE RD. - CONTINUOUS.\n</b>\n     Denver sits on the porch steps, alone once again. Miserably\n     eating the biscuit and jelly off of a half broken plate.\n\n<b>     INT. BABY SUGGS BEDROOM - MINUTES LATER.\n</b>\n     Sethe and Paul lay in bed, after lovemaking. They are still\n     fully clothed. The lovemaking was fast and finished quickly.\n     Now, there is an awkwardness that is without humor or\n     excitement - but sits like a chasm between them.\n\n     As Sethe lays there, SHE REMEMBERS:\n\n<b>     MEMORY:\n</b>\n<b>     EXT. THE CORN FIELDS OF SWEET HOME - A DAY REMEMBERED.\n</b>\n     A brilliant bright yellow and green corn stalks in a tiny\n     corn field.\n\n     Sethe and a slightly older HALLE - handsome, strong - run\n     through the field until Halle stops them at an isolated spot.\n\n<b>                         HALLE\n</b>               How's this?\n\n<b>                         SETHE\n</b>               Here?! out in the open?!\n\n<b>                         HALLE\n</b>               Look around - can you see anybody?\n\n     Sethe looks and can see nothing through the corn stalks. She\n     shakes her head no.\n\n<b>                         HALLE\n</b>               Then nothing can see us neither.\n\n     He takes off his shirt. Seethe giggles as she gets on the\n     ground, keeping her ankles crossed.\n\n     Halle lays her back and gently separates her legs. She\n     giggles. Halle pauses before laying on top of her.\n\n<b>                         HALLE\n</b>               You are a beautiful sight.\n\n<b>                         SETHE\n</b>               Don't talk stupid.\n\n<b>                         HALLE\n</b>               You're my wife now! I can talk as stupid\n               as I like about you!\n                    (she giggles)\n               I ain't never loved nothing like you\n               before, Sethe.\n                    (Sethe is moved)\n               And after I get mama out...then I get us\n               out too. And you'll see, baby girl...\n                    (smiles)\n               we're gonna have us a liiife..\n\n     He sings the word \"life\", so that Sethe laughs. Then, Halle\n     lowers himself slowly to her and they begin to make love. As\n     camera pans up to a HILL above the field, we hear Sethe ask;\n\n<b>                         SETHE (O.S.)\n</b>               You sure nobody can see?\n\n     We hear Halle grunt \"uh-huh\" as we arrive on the hill where a\n     GREAT TREE sits.\n\n<b>     EXT. GREAT TREE ON THE HILL - DAY.\n</b>\n     Beneath the tree, PAUL D, SIXO and Paul's brothers Paul A.\n     and Paul P. are pouring water over heads and watching;\n\n     POV; Unbeknownst to Halle and Sethe, their lovemaking is in\n     clear view to anyone on the hill...\n\n<b>                         PAUL A\n</b>               Damn. I don't get why she picked him.\n\n<b>                         PAUL D\n</b>               Halle's got that way about him. That way\n               a woman feels he's doing it all for her,\n               not for himself at all.\n\n<b>                         PAUL A\n</b>               I can't see nothing so special about Halle.\n\n<b>                         PAUL F\n</b>               What about what he's doing for his mama?\n\n<b>                         PAUL A\n</b>               Fool thing, if you ask me. By the time he\n               buys it, freedom won't mean a thing to\n               somebody that old and worn.\n\n<b>                         SIXO\n</b>               Freedom mean something anytime it come.\n\n     The men watch the corn stalks swaying to the lovemaking.\n\n     A YOUNG PAUL D., in particular, watches with tender yearning.\n\n<b>     INT. KITCHEN AT SWEET HOME - EARLY EVENING.\n</b>\n     MR. GARNER, the man who owns and runs Sweet Home. He offers\n     cooked corn to the men.\n\n<b>                         MR. GARNER\n</b>               Raccoon must've got into my corn. Damaged\n               a few so, no use throwing them out...\n\n     The men looks to each other, suppressing a laugh.\n\n<b>                         MR. GARNER\n</b>               Sethe, get the butter there.\n\n     Everyone looks at each other as they thank No. Garner and\n     begin to smear butter on their corn and eat.\n\n     A NEIGHBORING FARMER visiting the Garner's cautions him;\n\n<b>                         NEIGHBORING FARMER\n</b>               You spoil these nigger boys.\n\n<b>                         GARNER\n</b>               Maybe you got boys on your farm. My\n               nigger's are men. Not a boy among'em.\n               Bought 'em thataway, raised'em thataway.\n\n<b>                         NEIGHBORING FARMER\n</b>               Beg to differ Garner. Ain't no nigger men.\n\n<b>                         GARNER\n</b>               Not if you scared. But if you a man\n               yourself, you'll want your niggers to be\n               men too.\n\n<b>                         NEIGHBORING FARMER\n</b>               Wouldn't have no nigger men around my\n               wife.\n\n<b>                         GARNER\n</b>               Neither would I..Neither would I.\n\n     Sethe hides a smile as she hands a piece of corn to Halle.\n     Paul A and Paul F hesitate as they think of eating the corn\n     which the lovers consummated. But Sixo digs right in.\n\n     Paul D eats slowly, his eyes never leaving Sethe as she moves\n     Around the kitchen, her eyes never leaving Halle...Paul's\n     Attraction and love for her are apparent.\n\n<b>     END OF MEMORY;\n</b>\n<b>     INT. SETHE'S BEDROOM - EARLY EVENING.\n</b>\n     C.U. on PAUL, on his back, turned away from Sethe.\n\n     What began as Sethe's memory, has blended into Paul's.\n\n     Sethe rises off the bed, breaking the thick silence between them:\n\n<b>                         SETHE\n</b>               I'll call you when there's something to\n               eat.\n\n     She exits, leaving Paul alone on the bed.\n\n<b>     EXT. 124 BLUESTONE RD. - THE FOLLOWING DAY.\n</b>\n     We see the house now. No creaking or sounds of breaking\n     furniture. Just the sound of Paul D. singing.\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Paul is singing as he fixes the table he broke while driving\n     the baby ghost away.\n\n     Denver is sweeping the floor - irritated by Paul's presence\n     and voice.\n\n     They both hear the front door open as Sethe arrives home from\n     work.\n\n     They look to each other to see which one will make a move for\n     Sethe first. Paul knows enough to bide his time with Denver.\n     He watches as she places the broom down and exits the\n     kitchen.\n\n<b>     EXT. 124 BLUESTONE RD. - NIGHT.\n</b>\n     Paul and Sethe sit on the porch together. Sethe is sewing.\n     Paul nervously gets up his nerve to ask:\n\n<b>                         PAUL\n</b>               Sethe.\n                    (she stops and looks)\n               I was thinking of looking for work around\n               here. What do you think?\n\n<b>                         SETHE\n</b>               Ain't much. River mostly. And hogs.\n\n<b>                         PAUL\n</b>               Hogs is fine.\n\n     Paul moves to where Sethe is sitting.\n\n<b>                         PAUL\n</b>               I don't need much, Sethe. Eat, sleep,\n               sing a little when it strikes me. I don't\n               ask for more to..to live somewhere.\n\n     Sethe realizes what he is asking and tentatively responds:\n\n<b>                         SETHE\n</b>               All right. It's...it's fine with me.\n\n<b>                         PAUL\n</b>               Your girl Denver. Seems she's of a\n               different mind.\n\n<b>                         SETHE\n</b>               Don't worry about her. She's a charmed\n               child. Nothing ever touch her too bad.\n               From the beginning. Everybody I knew dead\n               or gone, but not her.\n                    (pause)\n               You got to know something, though - this\n               here ain't no better life. It's just not\n               that other one. What I do here - all I\n               ever do - is keep Denver from that\n               other..So if you stay, there's no more\n               talk about Sweet Home or anything else. I\n               won't let the past in my yard again.\n               Getting me and Denver through this here\n               life is all that matters. You understand?\n\n<b>                         PAUL\n</b>               Dangerous to love anything that much,\n               Sethe. Best thing is to love everything\n               just a little bit..that way, when it\n               breaks or runs off or gets taken, well\n               maybe you'd have a little love left over\n               for the next one.\n\n<b>                         SETHE\n</b>               Don't be asking me to choose, Paul D.\n               There ain't no choice here.\n\n<b>                         PAUL\n</b>               That's the whole point. I'm not asking\n               you to choose. Just want to know if\n               there's some space for me. Want to know\n               if it's more than \"you can stay\", \"it's\n               fine\"..more like, \"I want you here Paul\".\n\n     Beat. Sethe is frightened by the prospect of feeling for him.\n\n<b>                         SETHE\n</b>               Maybe we should leave things the way they\n               are.\n\n     Sethe rises to enter the house when Paul's words stop her:\n\n<b>                         PAUL\n</b>               How are they?\n\n<b>                         SETHE\n</b>               We get along.\n\n<b>                         PAUL\n</b>               What about inside?\n\n<b>                         SETHE\n</b>               I don't go inside.\n\n<b>                         PAUL\n</b>               Sethe, if I'm here with you, with Denver,\n               you can go anywhere you want. Jump, if\n               you want to, 'cause I'll catch you. Go as\n               far inside as you need - I'll hold your\n               ankles. Make sure you get back out. I'm\n               not saying this because I need a place to\n               stay. I told you, I'm a walking man, but\n               I been heading in this direction for\n               seven years. When I got here and sat out\n               there on the porch, waiting for you,\n               well, I knew it wasn't the place I was\n               heading toward. It was you. We can make a\n               life girl. A life.\n\n<b>                         SETHE\n</b>                    (scared)\n               I don't know. I don't know.\n\n<b>                         PAUL\n</b>               Leave it to me. See how it goes. No\n               promises, if you don't want to make any.\n               Just see how it goes, all right?\n\n     Sethe's heart is twisted. She wants to cry...because she\n     feels hope...and because she feels fear.\n\n<b>                         SETHE\n</b>               All right. We'll see how it goes.\n\n<b>                         PAUL\n</b>               You willing to leave it to me?\n\n<b>                         SETHE\n</b>               Well..some of it.\n\n<b>                         PAUL\n</b>                    (smiles)\n               Some?...Well okay...some.\n\n     Sethe manages a smile.\n\n<b>     INT. DENVER'S BEDROOM - NIGHT.\n</b>\n     Denver lies curled up in her bed. Alone.\n\n     Sethe enters and crawls in unexpectedly. Denver looks up,\n     surprised to see her.\n\n<b>                         DENVER\n</b>               What is it? What's wrong?\n\n<b>                         SETHE\n</b>               Nothing. Nothing's wrong. Lay back down.\n\n     Denver obeys, unsure.\n\n<b>                         DENVER\n</b>               You think baby ghost's really gone?\n\n<b>                         SETHE\n</b>               Don't know.\n\n<b>                         DENVER\n</b>               I miss her.\n\n     Sethe lets out a small laugh.\n\n<b>                         DENVER\n</b>               I do. Baby Suggs told me baby ghost would\n               never hurt me. She was my sister. When I\n               was little, after the boys left, I used\n               to think that she and me both were\n               waiting for daddy to come. And once he\n               did, she wouldn't be mad no more.\n                    (Sethe listens sadly)\n\n     They hear Paul singing out on the porch. Denver grimaces.\n\n<b>                         DENVER\n</b>               Wish he'd shut-up...He's ruined\n               everything.\n\n<b>                         SETHE\n</b>               No, he hasn't. He won't.\n                    (hesitates)\n               He..he wants to takes us to the\n               carnival next Thursday...\n\n     Denver's eyes light up with excitement then caution.\n\n<b>                         DENVER\n</b>               You mean, go out where they'll be other\n               people?\n\n<b>                         SETHE\n</b>               Dress up a little bit. Wear our hats.\n               What do you think?\n\n<b>                         DENVER\n</b>                    (downplaying her excitement)\n               Maybe....\n\n<b>                         SETHE\n</b>               Maybe...All right...all right.\n                    (difficult for her to say)\n               Can I ask you something?\n                    (Denver nods, her back to\n                    Sethe)\n               I was wondrin'..What you think about\n               us...maybe... maybe thinking we could\n               start...if we got an idea to, thinking we\n               could start.. countin' on...\n                    (she stops)\n\n<b>                         DENVER\n</b>               On what mama? Countin' on what?\n\n     Sethe can barely bring herself to say. To hope. To imagine.\n     Paul? But, for Denver, she forces herself and whispers;\n<b>                         SETHE\n</b>               Something.\n\n<b>     EXT. CARNIVAL - DAY.\n</b>\n     Paul and Sethe and Denver walk among the hundreds of black\n     townspeople gathered for the carnival.\n\n     A sign reads COLORED THURSDAY...TWO PENNIES ENTRANCE FEE.\n\n     Paul is in high spirits. Saying hello to anyone whose eye he\n     catches. Willing, eager to get anything for Denver she wants.\n     Feeling a little more like a normal van in a normal life.\n\n     Denver is excited but worried. She doesn't want to like Paul\n     but can't help the thrill she's feeling. And when one or two\n     passersby shout out;\n\n<b>                         VARIOUS PASSERS-\n</b><b>                         BY\n</b>               Hey Denver!...Hi there Denver!\n\n     Denver heart almost weeps with joy.\n\n     Sethe walks cautiously. Overdressed for the occasion, it is\n     her first outing among neighborhood folk in many years.\n\n     She catches the eyes of some of the women she knows...ELLA\n     and LADY JONES..good Christian women who nod in their\n     acknowledgement yet are holding back something. A judgement?\n     A repulsion?\n\n     Paul doesn't notice them and for this Sethe is glad.\n\n     MONTAGE of SCENES...the various carnival acts, all performed\n     by a WHITE TROUPE; magic, clowning, fire swallowing, spitting\n     ribbons, acrobats forming pyramids...\n\n     Our trio take it all in like water to the thirsty.\n\n     At one point, A WHITE CARNIVAL BARKER shouts to the children;\n\n<b>                         CARNIVAL BARKER\n</b>               All Pickaninnies free!!\n\n     The phrase stabs Sethe and Paul a bit. But Paul whispers;\n\n<b>                         PAUL\n</b>               Two pennies and an insult well spent in\n               my opinion to see the spectacle of\n               whitefolks making a spectacle of\n               themselves.\n\n     Sethe can't help but let out a small laugh - and with that\n     laugh, a sudden sensation of relief...\n\n     Paul buys Denver some licorice, peppermint and lemonade.\n     Holding the lemonade for her, Paul asks;\n\n<b>                         PAUL\n</b>               Mind if I take a sip?\n\n     Denver agrees. Paul takes some lemonade then wipes the rim\n     where he sipped with a small napkin and gently hands it back\n     to her. Denver, in spite of herself, is starting to like him.\n\n<b>     END MONTAGE.\n</b>\n<b>     EXT. COUNTRY ROAD - DAY.\n</b>\n     Our trio are leaving the carnival, walking three astride with\n     distance in between each. The sunlight casts strong shadows.\n\n     Sethe's eyes glance towards the ground behind them and sees;\n\n     THEIR THREE SHADOWS ARE HOLDING HANDS.....as they walk home.\n\n<b>                                                          FADE OUT;\n</b>\n<b>     FADE- IN.\n</b>\n<b>     EXT. A STREAM AND THE BANK BESIDE IT - DAY.\n</b>\n     WIDE ANGLE of a BEAUTIFUL, WIDE STREAM (more like a small\n     river) with a MULBERRY TREE standing tall on the bank before\n     it. There is not a soul in sight as the stream moves\n     gracefully beneath the sun.\n\n<b>     SUDDENLY;\n</b>\n<b>     A FULLY DRESSED YOUNG BLACK WOMAN EMERGES FROM THE MIDDLE OF\n</b><b>     THE STREAM LIKE A GODDESS ARISING OUT OF SPIRITUAL WATERS...\n</b><b>     SHE WEARS A STRAW HATT A WHITE DRESS WITH BUTTONS, A LACE\n</b><b>     COLLAR AND NEW SHOES. SHE WALKS OUT OF THE WATER TO THE BANK.\n</b>\n     Exhausted, sopping wet and breathing heavily as if from\n     asthma, she sits, leaning against the mulberry tree. She\n     seems too tired to even hold her head upon her neck. Yet her\n     skin is like new lineless and smooth. Glowing.\n\n     Although racked with pain, SHE IS SMILING. Smiling the way\n     travellers smile when they have finally arrived after a long\n     and arduous journey.\n\n<b>     EXT. WOODS - DAY.\n</b>\n     The Young Black Woman makes her way through the woods. She\n     passes by Denver's BOXWOOD BUSH secret place. Then continues\n     forward, as if with a specific direction in mind.\n\n<b>     EXT. 124 BLUESTONE ROAD - LATE AFTERNOON.\n</b>\n     Sethe, Paul and Denver approach 124. Denver is the first to\n     see.\n\n<b>                         DENVER\n</b>               Look. What is that?\n\n     All three look to see;\n\n     THE YOUNG BLACK WOMAN sitting on a stump not far from the\n     steps of 124.\n\n     As the three approach, the Young Woman lifts her head and\n     stares directly at Sethe.\n\n     The two women exchange a moment in their eyes - Sethe,\n     curious yet warm...The Young Woman, happy yet there is a\n     hunger in her stare.\n\n<b>     INT. KITCHEN - MOMENTS LATER.\n</b>\n     The Young Woman seated on a chair as Denver refills a tin cup\n     of water. The Young Woman drinks greedily, cup after cup.\n\n<b>                         SETHE\n</b>               You from around here?\n\n     The Young Woman shakes her head NO. She reaches down and\n     takes off her shoes, which Sethe notices as new. Sethe bends\n     down to pick them up. The Young Woman never lets her eyes\n     leave Sethe.\n\n<b>                         PAUL\n</b>               Those shoes look brand new.\n\n<b>                         SETHE\n</b>               What might your name be?\n\n     The Young Woman speaks in a low, rough voice;\n\n<b>                         BELOVED\n</b>               Beloved.\n\n     Sethe drops the shoes. Denver sits down. Paul smiles;\n\n<b>                         PAUL\n</b>               Beloved. You use a last name, Beloved?\n\n<b>                         BELOVED\n</b>               Last. No..just Beloved..\n                    (she spells it)\n<b>               B..E..L..O..V..E..D...\n</b>\n     As she spells it we see sethe's reaction; she is deeply\n     touched. Then Denver's - who looks both amazed and curiously\n     excited.\n\n     Sethe hangs her own hat on a peg then approaches Beloved.\n\n<b>                         SETHE\n</b>               That's a pretty name Beloved. Take off\n               your hat and I'll make us something. We\n               just got back from the carnival over near\n               Cincinnati-\n\n     But Beloved has fallen asleep upright in the chair.\n\n<b>                         PAUL\n</b>               Miss...Miss, you want to lay down?\n\n     Her eyes open to slits. Paul is about to help her when Denver\n     rises;\n\n<b>                         DENVER\n</b>               I'll take her up. She can sleep in baby\n               Suggs room - that all right Mama?\n\n<b>                         SETHE\n</b>               Course.\n\n     Denver eases Beloved onto her feet, which Sethe and Paul\n     notice do not have a line or sore on them.\n\n<b>                         PAUL\n</b>                    (whispers to Sethe)\n               Look at her feet? They're not walking\n               feet. More like she rode from somewhere\n               all the way here.\n\n     Yet, Beloved can barely stand upon them as Denver escorts her\n     to the white staircase. Beloved starts coughing.\n\n<b>                         PAUL\n</b>               Sounds like the croup.\n\n<b>                         SETHE\n</b>               Is she feverish, Denver?\n\n<b>                         DENVER\n</b>               No. She's cold.\n\n<b>                         SETHE\n</b>               Then she is. Fever goes from hot to cold.\n\n<b>                         PAUL\n</b>               Could have the cholera.\n\n<b>                         DENVER\n</b>                    (adamant)\n               She's not sick!\n\n     Denver helps her up the stairs. Sethe and Paul register\n     Denver's defensive reaction.\n\n<b>     INT. BABY SUGG'S ROOM - SAME TIME.\n</b>\n     Denver eases Beloved into the bed. Beloved falls asleep the\n     second she hits the pillow. Denver gently - cautiously -\n     strokes Beloved's forehead and cheek.\n\n<b>     INT. BABY SUGG'S ROOM - NIGHT.\n</b>\n     Denver stands vigil beside Beloved, wrapped beneath a quilt.\n\n<b>     INT. BABY SUGG'S ROOM - THE FOLLOWING DAY.\n</b>\n     Denver watches her sleep, wiping her hot forehead with cold\n     cloths...\n\n<b>     INT. BABY'S SUGG'S ROOM - NIGHT.\n</b>\n     Denver washes out Beloved's underwear and stockings...She\n     hears Beloved murmuring. She moves quickly to her side.\n\n<b>                         DENVER\n</b>               Beloved? Beloved I'm here...what is it?\n\n<b>                         BELOVED\n</b>               Heavy..this place is heavy.\n\n<b>                         DENVER\n</b>               Would you like to sit up?\n\n     Beloved shakes her head no. She takes hold of Denver's arm\n     and wraps it around her own body. Denver sits up against the\n     pillow as Beloved snuggles her body into Denver's arms and\n     falls back asleep. Denver holds her, lovingly.\n\n<b>     INT. BABY SUGGS ROOM - DAYS LATER.\n</b>\n     Denver has not left her bedside. She places another quilt\n     upon her, tucking it in around the sides. As she does this,\n     Beloved's eyes open for a brief moment, catching the sight of\n     Denver over her. She smiles. Denver gratefully smiles back.\n\n<b>                         DENVER\n</b>               Can I get you anything? Are you hungry?\n\n     Beloved looks over to a plate of half finished food -\n     Denver's meal. Denver picks up a piece of sweet bread and\n     feeds her. Denver is thrilled.\n\n<b>     THE FOLLOWING SCENES TAKE PLACE OVER SEVERAL WEEKS;\n</b>\n<b>     INT. KITCHEN - THE NEXT DAY.\n</b>\n     Denver places sugar between two pieces of bread and gives the\n     sandwich to Beloved, who, no longer feeling sickly, accepts\n     it with a bright smile.\n\n<b>     EXT. HEN HOUSE - ANOTHER DAY.\n</b>\n     Denver explains how to pack mud in the cracks of the hen\n     house as Beloved listens attentively, eating jelly out of a\n     jar.\n\n<b>     INT. HEN HOUSE - ANOTHER DAY.\n</b>\n     Denver explains to Beloved how to warm the chicks with their\n     skirts as the latter eats something sweet. They both giggle\n     at the softness of the chicks.\n\n<b>     INT. DENVER &amp; BELOVED'S BEDROOM - ANOTHER DAY.\n</b>\n     Denver is showing Beloved how to make her bed.\n\n<b>                         DENVER\n</b>               ..then you fold it over like this see.\n               This here used to be where my brothers\n               and me slept. I was always at the top.\n\n<b>                         BELOVED\n</b>               How you get so smart?\n\n<b>                         DENVER\n</b>               I ain't so smart.\n\n<b>                         BELOVED\n</b>               Yes you are!\n\n<b>                         DENVER\n</b>               Well, I used to go to Lady Jones. She'd\n               teach us with songs how to spell and\n               count.\n\n<b>                         BELOVED\n</b>               You don't go no more?\n\n<b>                         DENVER\n</b>               No I...I had to stop going.\n\n<b>                         BELOVED\n</b>               You so smart. Tell me about your\n               brothers.\n\n<b>                         DENVER\n</b>               Well..they're names were Howard and..\n\n     As Denver continues, Beloved steps towards her and begins to\n     touch her face - examining her lips, her nose, her skin as if\n     it were a rose to admire. Denver drinks in the attention, her\n     heart expanding with love with every touch from this strange\n     creature.\n\n<b>                         DENVER\n</b>               ..and....and Bulgar...At night, we used\n               to..crawl into bed together..I'd lay down\n               on Bul's lap and Howard would tell us die-\n               witch stories. He said they would protect\n               us...And if I learned them, they would\n               protect me if ever they were gone...\n\n<b>     EXT. PORCH - EARLY EVENING.\n</b>\n     Everyone is sitting on the porch after dinner.\n\n     Beloved, looking strong and fit, eats a cane stick - gnawing\n     at it to the flax, keeping the strings in her mouth long\n     after the syrup had been sucked off. It makes Denver laugh,\n     as she licks her cane stick. It makes Sethe smile, to see\n     them both happy.\n\n     It makes Paul disgusted.\n\n<b>     INT. KEEPING ROOM - NIGHT.\n</b>\n     Paul confronts Sethe as she sews.\n\n<b>                         PAUL\n</b>               You gonna just feed her, from now on?\n\n<b>                         SETHE\n</b>               Denver likes her. She's no real trouble.\n\n<b>                         PAUL\n</b>               But don't she have a home? Some place to\n               go?\n\n<b>                         SETHE\n</b>               Didn't mention one. I thought we'd wait\n               until her breathing got better. She still\n               sounds a little lumbar.\n\n<b>                         PAUL\n</b>               She breathe like she can eat, she could\n               blow this whole house down. And all those\n               sweets.\n\n<b>                         SETHE\n</b>               Sometimes the body needs that sugar for\n               strength when it's trying to recover\n               after an illness.\n\n<b>                         PAUL\n</b>               But that's just it. She don't seem sick.\n               Something funny about her.\n\n<b>                         SETHE\n</b>               Funny? How?\n\n<b>                         PAUL\n</b>               Acts sick, sounds sick but she don't look\n               sick. Good skin, bright hands and strong\n               as a bull.\n\n<b>                         SETHE\n</b>               She can hardly walk without holding onto\n               something.\n\n<b>                         PAUL\n</b>               That's what I mean. Can't walk but I\n               passed by Baby Sugg's room this morning\n               and saw her lifting the rocker with one\n               hand.\n\n<b>                         SETHE\n</b>               You didn't?\n\n<b>                         PAUL\n</b>               Don't tell me. Ask Denver. She was right\n               there.\n\n     At that moment, Denver passes by on her way to the kitchen.\n\n<b>                         SETHE\n</b>               Denver. Come in here a minute.\n\n     Denver enters the keeping room.\n\n<b>                         SETHE\n</b>               Paul says you saw Beloved pick up the\n               rocking chair in Baby Suggs room with one\n               hand. That so?\n\n     Denver looks at Paul with a hard gaze;\n\n<b>                         DENVER\n</b>               I didn't see no such thing.\n\n     From Paul's expression we can tell Denver is lying...and\n     whatever fragile connection they were building, is swiftly\n     destroyed.\n\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     Sethe is getting ready for bed. Denver sticks her head in:\n\n<b>                         DENVER\n</b>               Have you seen her? I can't find her.\n\n<b>                         SETHE\n</b>               Who?\n\n<b>                         DENVER\n</b>               Beloved.\n\n     Sethe shakes her head. Denver exits anxiously. The mentions\n     of Beloved's name stir a MEMORY in Sethe:\n\n<b>     MEMORY:\n</b>\n<b>     EXT. GRAVESTONE YARD - A DAY REMEMBERED.\n</b>\n     Sethe talks to the HEADSTONE ENGRAVER as he works in the hot\n     sun. His YOUNG SON helps him.\n\n<b>                         SETHE\n</b>               She need a marker. Somethin' to tell me\n               where she is. But I ain't got no money.\n\n     The Engraver eyes her body.\n\n<b>                         ENGRAVER\n</b>               What you got then?\n\n     Sethe is embarrassed by his lascivious tone, especially in\n     front of the young boy.\n\n     The Engraver rises, takes a step toward Sethe and touches her\n     hip, curling his hand around to her back.\n\n<b>                         ENGRAVER\n</b>               What you want it to say?\n\n<b>                         SETHE\n</b>               I was thinking what the preacher say at\n               the funeral. Dearly Beloved.\n\n<b>                         ENGRAVER\n</b>                    (touching her)\n               For ten minutes I give you one word for\n               free.\n\n     His hand glides down to her buttocks. Sethe can't help but\n     see the Young Boy watching the scene.\n\n     END of MEMORY.\n\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     As the memory starts to fade form her mind, Sethe suddenly\n     feels someone else's presence. She looks up to find:\n\n     Beloved standing by the door - watching her.\n\n<b>                         SETHE\n</b>               Oh!...I didn't know you were there.\n\n<b>                         BELOVED\n</b>               Can I help?\n\n<b>                         SETHE\n</b>               Help what, honey?\n\n     Beloved kneels before her on the floor and finishes buttoning\n     up Sethe's night dress.\n\n<b>                         BELOVED\n</b>               Where you go in the morning?\n\n<b>                         SETHE\n</b>               Work. I work in a restaurant.\n\n<b>                         BELOVED\n</b>               What time you go?\n\n<b>                         SETHE\n</b>               Little after the sun come up. I like to\n               make a loaf of bread before I go. How you\n               feelin'?\n\n     Beloved nods, absorbing the information.\n\n<b>                         SETHE\n</b>               You remember your mother at all?\n\n<b>                         BELOVED\n</b>                    (scratching back of her head)\n               I remember a woman who was mine and I\n               remember bein snatched away from her.\n\n     Sethe, nods, understanding such things. She cautiously\n     reaches out to stroke Beloved's face. Beloved responds like a\n     puppy, pressing her cheek against Sethe's hand. Sethe is\n     moved.\n\n<b>     INT. KITCHEN - PRE DAWN.\n</b>\n     Sethe enters the kitchen to make bread before she leaves for\n     work. She finds Beloved waiting for her, placing out her\n     cooking things on the table. Beloved looks up and smiles.\n\n<b>                         BELOVED\n</b>               I'm helpin make your bread.\n\n<b>     EXT. 124 BLUESTONE - EARLY EVENING.\n</b>\n     Beloved waits anxiously at the window for the sight of Sethe\n     coming home from work....\n\n     When she sees her, she runs through the house, out the door\n     to meet her.\n\n     Denver appears at the door, upset by Beloved's loss of\n     attention in her.\n\n<b>     EXT. PORCH - EVENING.\n</b>\n     C.U. - SETHE, as she leans her tired head against the porch,\n     sitting on the step. She closes her eyes and is about to\n     drift off, when;\n\n     BELOVED'S HAND gently touches her shoulder, settling there.\n\n     Sethe looks up and smiles, patting her hand. Beloved stands\n     above her as Denver takes a seat on the step.\n\n     Beloved searches Sethe's eyes and asks;\n\n<b>                         BELOVED\n</b>               Where your diamonds?\n\n     The question surprises Sethe...and startles Denver.\n\n<b>                         SETHE\n</b>               Diamonds? What would I be doing with diamonds?\n\n<b>                         BELOVED\n</b>               On your ears.\n\n<b>                         SETHE\n</b>               Wish I did.\n                    (beat)\n               Hmm..come to think of it, I had some\n               crystal once. A present from Mrs. Garner -\n               woman I worked for at Sweet Home.\n\n<b>                         DENVER\n</b>               I never saw you with no earrings.\n\n<b>                         SETHE\n</b>               Gone. Long gone.\n\n<b>                         BELOVED\n</b>               Tell me...Tell me about your diamonds...\n\n     Sethe hesitates. Beloved kneels at her feet.\n\n<b>                         DENVER\n</b>                    (to Beloved)\n               Ma'am don't talk about Sweet Home.\n\n<b>                         BELOVED\n</b>                    (ignoring her)\n               Tell me...Tell me about your diamonds.\n\n     Denver awaits her mother's reaction with great interest.\n     Sethe looks at Beloved sweet, innocent expression and\n     something in her resistance, eases:\n\n<b>                         SETHE\n</b>               Well..this lady I worked for in Kentucky\n               gave them to me when I got married..\n\n     Denver is both interested and slightly hurt at her mother's \n     willingness to tell Beloved what she'd never tell her:\n\n<b>                         SETHE\n</b>               ..What they called married back then. I\n               remember going up to her in the kitchen\n               to tell her. I'd help her make ink for\n               Mr. Garner in the kitchen. I was fool\n               enough to think I was going have some\n               kind of ceremony...maybe even a new\n               dress..\n<b>                    (CONTINUES AS WE CUT TO;)\n</b>\n     Sethe's continues telling Beloved, an attentive audience...\n\n     Denver, more attuned to Beloved's interest than the story, is \n     disturbed at her mother's telling of it.\n\n<b>     INT. KITCHEN - ANOTHER EVENING.\n</b>\n     Camera moves up from the mended legs of the table Paul broke\n     to;\n\n     A suspicious Paul glares at Beloved as they eat dinner.\n\n     Beloved is ever ready to pass Sethe a bowl or napkin or\n     whatever she needs. She is \"shining\" - for Sethe, and for\n     Sethe alone.\n\n     Denver notices it as well.\n\n     It is raining outside. Both Denver and Beloved are wet from\n     the rain. Denver's hair is all tangled.\n\n<b>                         SETHE\n</b>               Best unbraid that hair.\n\n<b>                         DENVER\n</b>               Tomorrow.\n\n<b>                         SETHE\n</b>               Today's always here. Tomorrow never.\n\n<b>                         DENVER\n</b>               It hurts.\n\n<b>                         SETHE\n</b>               Comb it everyday, it won't..\n\n<b>                         BELOVED\n</b>               Your woman never fixed up your hair?\n\n     All three look to Beloved, puzzled by her question, which is\n     clearly intended for Sethe. Paul's getting more annoyed.\n\n<b>                         PAUL\n</b>               What?\n\n<b>                         SETHE\n</b>               My woman?..You mean my mother?\n\n     Beloved nods. Paul and Denver exchange a curious look.\n\n<b>                         SETHE\n</b>               If she did I don't remember. I don't\n               think I saw her but a few times.\n\n<b>                         BELOVED\n</b>               Tell me 'bout her.\n\n     Paul and Denver look to Sethe, waiting to see if she'll answer.\n\n<b>                         SETHE\n</b>               ..I remember once, she picked me up and\n               carried me behind the smokehouse... The\n               only thing I do remember in fact...\n\n     Paul is disturbed by Sethe's carefree storytelling - how it \n     contradicts her words to him that first day and worried it\n     will lead to no good...\n\n     Once again, Denver is surprised to hear what she's never\n     heard before. She looks to Paul and knows what he is\n     thinking. Paul looks back and knows Denver realizes it. But\n     Denver returns his glance with a defensive dismissal of the\n     eyes.\n\n<b>                         SETHE\n</b>               ...She opened up her dress and right on\n               her rib, right here, was a circle and a\n               cross burnt right into the skin....\n\n<b>                         PAUL\n</b>                    (interrupts her)\n               Sethe.\n\n<b>                         SETHE\n</b>               What?\n\n     Paul doesn't want her to continue but doesn't want to say so.\n\n<b>                         PAUL\n</b>               Any more beans?\n\n     Sethe rises to get him more food and she continues:\n\n<b>                         SETHE\n</b>               ...anyway, she points to this mark and\n               says to me \"This is your ma'am. I am the\n               only one whose got this mark now. The\n               rest all dead. If something happens to me\n               and you can't tell me by my face, you can\n               know me by this mark\"..Scared me so...\n               I couldn't think of anything to say so I\n               said \"Yes Ma'am..but how will you know\n               us? Mark me too. Mark the mark on me\n               too.\"\n\n<b>                         DENVER\n</b>               Did she?\n\n<b>                         SETHE\n</b>               No. She slapped my face. I didn't\n               understand it then. Not until I had a\n               mark of my own...\n\n     Paul is disturbed. He can see Sethe getting upset. He is mad\n     at Beloved for her damn questions..\n\n<b>                         BELOVED\n</b>               What happened to her?\n\n     Something inside of Sethe stops, a wall erected. Something\n     unwanted is coming into her consciousness. Paul notices it.\n     She rises;\n\n<b>                         SETHE\n</b>               Don't know. Everybody done?\n\n     Sethe collects a few dishes and crosses to the sink as Paul asks:\n\n<b>                         PAUL\n</b>               Well, as long as we're all asking\n               questions, getting to know each other..\n                    (to Beloved)\n               Why don't you tell us a little bit about\n               yourself?\n\n     Camera follows Sethe as she arrives at the sink, placing the\n     dish inside. We hear the others O.S.:\n\n<b>                         DENVER (O.S.)\n</b>                    (defensively)\n               She don't remember nothing.\n\n<b>                         PAUL (O.S.)\n</b>               You be surprised what you start\n               remembering once you start talking.\n\n<b>                         BELOVED (O.S.)\n</b>               Can I have some more pudding?\n\n     Camera stays on Sethe as we drown out the voices at the\n     kitchen table. She is staring out the window above the sink\n     as if watching the MEMORY BEING RELIVED IN HER YARD;\n\n<b>     POV - OUT THE WINDOW;\n</b>\n<b>     MEMORY:\n</b>\n<b>     EXT. A LARGE TREE IN A FIELD - A DAY REMEMBERED.\n</b>\n     A CROWD of people surround a tree. SEVERAL WHITE MEN are\n     preparing to hang a group of black men and women standing in\n     line, awaiting their turn.\n\n     Among the crowd is A CHILD (SETHE) holding the hand of an\n     OLDER BLACK SLAVE WOMAN (NAN). Nan is pointing to a WOMAN\n     (SETHE'S MOTHER), who is one of the people waiting in line to\n     be hanged. Nan whispers to Sethe:\n\n<b>                         NAN\n</b>               That's your mama - right there.\n\n     Little Sethe looks up and sees her mother - her face a mask\n     of courage and rage and tears. She looks straight ahead - not\n     at anyone in particular, especially not her daughter.\n\n<b>                         NAN\n</b>               ..I'm telling you, small girl Sethe...Me\n               and your Mama was taken by the men many\n               times..She threw them other babies\n               away..the others from the whites, without\n               names, she threw them away..But you she\n               gave the name of the black man. She had\n               her arms around him, child. The others,\n               she did not put her arms around.\n               Never...Never...\n\n     The child Sethe listens, watching her mother move further\n     down the line.\n\n     END of MEMORY as WE CUT BACK TO:\n\n<b>     INT. KITCHEN -\n</b>\n     Sethe, the memory passing, hears the voices in her kitchen:\n\n<b>                         PAUL (O.S.)\n</b>               Ain't you got no brothers or sisters?\n\n<b>                         BELOVED (O.S.)\n</b>               I don't have nobody.\n\n     She finds Paul interrogating Beloved who eats a second\n     pudding. Denver tries to interfere.\n\n<b>                         DENVER\n</b>               She has us now!\n\n<b>                         PAUL\n</b>               You been here five weeks, we still don't\n               know nothing bout you..\n\n<b>                         SETHE\n</b>               Paul, Stop it. Denver bring those dishes.\n\n<b>                         PAUL\n</b>               What was you looking for when you came here?\n\n<b>                         BELOVED\n</b>               This place. I was looking for this place\n               I could be in.\n\n<b>                         PAUL\n</b>               Somebody tell you about this place?\n\n     At the sink, both Sethe and Denver pause, obviously interested.\n\n<b>                         BELOVED\n</b>               She told me. When I was at the bridge,\n               she told me.\n\n     Paul looks quizzically at Sethe, who shrugs;\n\n<b>                         SETHE\n</b>               Must be somebody from the old days.\n\n<b>                         PAUL\n</b>               How'd you come? Who brought you?\n\n<b>                         BELOVED\n</b>               I walked here. A long, long, long, long\n               way. Nobody bring me.\n\n<b>                         PAUL\n</b>               You had new shoes. If you walked so long\n               why don't your shoes show it?\n\n<b>                         SETHE\n</b>               Paul D. stop picking on her.\n\n<b>                         PAUL\n</b>               I want to know! Where'd you get them\n               shoes and that dress you had on?\n\n<b>                         BELOVED\n</b>               I take the shoes! (coughs) I take the\n               dress! (coughs) The shoe strings don't\n               fit! I...\n\n     Suddenly, she begins to CHOKE on a raisin from the pudding\n     and falls backward, off the chair.\n\n     Denver and Sethe rush towards her. Beloved thrashes around\n     until they help her turn over and spit up the raisin.\n\n     She breathes in Sethe's arms as Denver wipes up the mess,\n     glaring at Paul.\n\n<b>                         SETHE\n</b>               You all right?\n\n<b>                         BELOVED\n</b>                    (whispers)\n               I want to go to sleep now.\n\n<b>                         DENVER\n</b>               Come to my room. I can watch out for you\n               up there.\n\n     Sethe gets Beloved to her feet. Denver takes her up the\n     staircase to her room - glaring at Paul.\n\n     When the girls have gone, Sethe turns on Paul as she cleans\n     up.\n\n<b>                         SETHE\n</b>               What's the matter with you?\n\n<b>                         PAUL\n</b>               I don't understand what the hold is. It's\n               clear why she holds onto you, but I just\n               can't see why you holding on to her.\n\n<b>                         SETHE\n</b>               What you care who's holding on to who?\n               Feeding her is no trouble. And she's nice\n               company for Denver.\n\n<b>                         PAUL\n</b>               We was just starting to feel a little\n               like a family ourselves.\n\n<b>                         SETHE\n</b>               Is that what's got your teeth on edge?\n\n<b>                         PAUL\n</b>               I can't place it. It's a feeling in me.\n\n<b>                         SETHE\n</b>               You wanna feel somethin!? ... Feel how it\n               is to have a bed to sleep in and somebody\n               there not worrying you to death about\n               what you got to do each day to deserve\n               it. And if that don't get it, feel how it\n               feels to be a colored woman roaming the\n               roads with anything God made liable to\n               jump on you. Feel that!\n\n<b>                         PAUL\n</b>               I know every bit of that, Sethe. I wasn't\n               born yesterday and I never mistreated a\n               woman in my life!\n\n<b>                         SETHE\n</b>               Well, that makes one of you in this\n               world.\n\n<b>                         PAUL\n</b>                    (surprised)\n               One? Not two.\n\n<b>                         SETHE\n</b>               No. Not two!\n\n<b>                         PAUL\n</b>               What Halle ever do to you? Halle stood by\n               you. He never left you.\n\n<b>                         SETHE\n</b>               Ha, what'd he leave then if not me, huh?\n\n<b>                         PAUL\n</b>               I don't know but it wasn't you. That's a\n               fact.\n\n<b>                         SETHE\n</b>               Then he did worse - he left his children.\n\n<b>                         PAUL\n</b>               You don't know that.\n\n<b>                         SETHE\n</b>               HE WASN'T THERE! He wasn't where he said\n               he would be! I had to pack my babies off\n               ahead of me, on their own, so I could\n               stay behind to look for him...Underground\n               agent said by Sunday we had to leave..\n               Sunday came and he wasn't there.\n\n<b>                         PAUL\n</b>               He couldn't get out of the loft, I expect.\n\n     Forgetting himself, Paul let that slip out.\n\n<b>                         SETHE\n</b>               Loft? What loft?\n\n<b>                         PAUL\n</b>                    (hesitates)\n               The one over your head... The one in the\n               barn.\n\n     Sethe stops dead cold. It's no use...\n\n     The MEMORY TAKES OVER:\n\n<b>     INT. BARN - THE PAST.\n</b>\n     Violent, rapid images of Sethe being raped and beaten held\n     down by SCHOOLTEACHER'S BOYS. Sethe, pinned down, stares up\n     at the loft...Camera rises up...\n\n     There, in the loft, hides HALLE...The expression on his face\n     is that of a man broken in two...\n\n     END of MEMORY.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     Sethe wraps her arms tightly around herself and asks;\n\n<b>                         SETHE\n</b>               He saw? He told you he saw?\n\n<b>                         PAUL\n</b>               You told me. The day I came here. You\n               said they stole your milk. I never knew\n               what messed Halle up. That was it, I\n               guess. I seen him the day after you left.\n               Says where you been Halle? All he says to\n               me was \"the loft\". I asked him what he\n               meant not going with you but he never\n               answers me. But I knew was something\n               broke him. Not one of them years of\n               Saturdays, Sundays and nighttime extra\n               never touched him. But whatever he saw go\n               on in the barn that day broke him like a\n               twig.\n\n<b>                         SETHE\n</b>               He saw them boys do that to me and let\n               them keep on breathing?\n\n<b>                         PAUL\n</b>               A man ain't a Goddamn ax, Sethe.\n               Chopping, hacking, busting every Goddamn\n               minute of the day. Things get to him.\n               Things he can't chop down cause they\n               inside him. The last time I saw him, I\n               knew he was broken for good...\n\n<b>                         SETHE\n</b>               What did he say?\n\n<b>                         PAUL\n</b>               Nothing.\n\n<b>                         SETHE\n</b>               What did you say? Didn't you say anything\n               to him?\n\n<b>                         PAUL\n</b>               I couldn't.\n\n<b>                         SETHE\n</b>               Couldn't?! Why the hell not?!\n\n     C.U. on PAUL who doesn't want to explain - or even remember -\n     as we cut to:\n\n<b>     MEMORY:\n</b>\n<b>     EXT. SWEET HOME - DAY.\n</b>\n<b>     PAUL HAS A BIT IN HIS MOUTH CHAINED TO A WAGON.\n</b>\n     He is being lead away from Sweet Home with other black men,\n     by Three white Men. The bit jerks his head back, saliva\n     spills uncontrollably out of his mouth. His hands are chained\n     behind him. His feet chained together at the\n     ankles....Another chain is connected to an iron belt and\n     stretches to a wagon. He is being lead away with forty five\n     other prisoners...\n\n<b>                         PAUL (VO)\n</b>               I tried to kill Brandywine - man\n               Schoolteacher sold me to. Don't know what\n               possessed me...Me and about 45 other\n               prisoners were being walked from Kentucky\n               to Virginia...then on to Georgia. Two\n               places I don't ever want to see again.\n\n     He is lead past the milk shed, when he sees:\n\n     HALLE, alone with a crazed faraway look in his eyes, sitting\n     by the butter churn. HALLE'S FACE IS COVERED WITH BUTTER AND\n     CLABBER. He sticks his hands in the churn and continues to\n     cover his face with the sticky, slippery, white substance\n     covering his face and head, squeezing it through his hands.\n\n     The White Men laugh. Paul is aching to scream out to him but\n     the iron bit holds down his tongue.\n\n     As Paul is lead past Halle, A ROOSTER named MISTER is SITTING\n     ON A TUB in the sun shrieks with an almost arrogant glee.\n\n<b>                         WHITE MAN\n</b>               Look at Mister there...\n                    (referring to the rooster)\n               You go tell these niggers where to go\n               there Mister! Crow'em right outta here!\n\n     Mister crows and the white men laugh.\n\n     Tears of rage and humiliation stream down Paul's face. He\n     struggles to keep a view of Halle, until he is out of sight.\n\n<b>     END OF MEMORY.\n</b>\n<b>     EXT. PORCH. - EARLY EVENING.\n</b>\n     Paul approaches Sethe, touching her gently.\n\n<b>                         PAUL\n</b>               I didn't mean to tell you that.\n\n<b>                         SETHE\n</b>               I didn't plan on hearing it.\n\n<b>                         PAUL\n</b>               I can't take it back but I can leave it\n               alone.\n\n     Sethe, instead of collapsing from the information, she seems\n     hardened.\n\n<b>                         PAUL\n</b>               Let's do that..let's leave it alone now.\n\n<b>                         SETHE\n</b>                    (more to herself)\n               Let it alone. Just sit down and leave it\n               be! Yeah that would be nice. Would be\n               even nicer to lose it altogether - if I\n               had my choice. Halle did. Other people's\n               brains stopped, went crazy. How sweet\n               that would have been. Me and Halle\n               squatting by that churn, smashing cold\n               lumpy butter in our faces, not a care in\n               the world..\n\n<b>                         PAUL\n</b>               Sethe, don't do this..\n\n<b>                         SETHE\n</b>               What a relief to just stop it all right\n               there, huh?!! Close it shut! Squeeze that\n               butter...But I had three children on\n               their way to Ohio and nothing would have\n               changed that! And you tell me he didn't\n               leave me!!\n\n     Sethe exits O.S. Paul is left alone on the porch until\n     Beloved runs out of the house giggling with Denver in\n     pursuit. As Denver passes, Paul sarcastically remarks;\n\n<b>                         PAUL\n</b>               Guess she's feeling better, huh?\n\n     Denver gives him a quick, disdainful look, then continues\n     after Beloved.\n\n     The two girls run towards the woods.\n\n<b>     EXT. BOXWOOD BUSH ROOM - NIGHT.\n</b>\n     Beloved is dancing beneath a bright moon. Denver is an\n     attentive, grateful audience.\n\n<b>                         DENVER\n</b>               Where'd you learn to dance?\n\n<b>                         BELOVED\n</b>               Nowhere. Look at me do this!\n\n     She puts her fists on her hips and skips.\n\n<b>                         BELOVED\n</b>               Now you! Come on! Come on!\n\n     She takes Denver's hand and places another on her shoulder.\n     As they dance, Denver laughs harder and harder - a giddiness\n     from the dizziness and the gratitude she feels for Beloved's \n     attention.\n\n     They spin and fall to the ground, like two lovers nestled.\n     Beloved catches her breath as Denver asks;\n\n<b>                         DENVER\n</b>               Why you call yourself Beloved?\n\n<b>                         BELOVED\n</b>               In the dark my name is Beloved.\n\n<b>                         DENVER\n</b>               What's it like where you were before?\n\n<b>                         BELOVED\n</b>                    (a thoughtful expression)\n               Dark. I'm small in that place. I'm like\n               this here.\n\n<b>                         DENVER\n</b>               Were you cold?\n\n<b>                         BELOVED\n</b>               Hot. Nothing to breathe there. No room to\n               move.\n\n<b>                         DENVER\n</b>               How did you get here?\n\n<b>                         BELOVED\n</b>               I wait; then I got on the bridge. I stay\n               there in the dark, in the daytime, in the\n               dark in the daytime. Long time.\n\n<b>                         DENVER\n</b>               All this time you were on the bridge?\n\n<b>                         BELOVED\n</b>               No. After. When I got out.\n\n<b>                         DENVER\n</b>               Why'd you come here?\n\n<b>                         BELOVED\n</b>               To see her face.\n\n<b>                         DENVER\n</b>               Ma'am's? Sethe's?\n\n<b>                         BELOVED\n</b>               Yes. Sethe.\n\n     And with that, Denver takes a breath of courage to ask the\n     question she's been longing to ask:\n\n<b>                         DENVER\n</b>               You my sister, ain't you? You really are.\n\n     Beloved looks at her and smiles. They are so close she leans\n     in curiously and - touching Denver's face - kisses her on the\n     lips.\n\n<b>                         DENVER\n</b>               You won't leave us, will you?\n\n<b>                         BELOVED\n</b>               No. Never. This is where I am.\n\n<b>                         DENVER\n</b>               I knew it. I knew. First time I saw you\n               and you said your name. And when you\n               touched me - real gentle. And familiar.\n               Like I'd felt that touch before.\n\n     Smiling, Beloved moves to touch Denver's cheek when suddenly,\n     Denver sits up cross legged and urges Beloved;\n\n<b>                         DENVER\n</b>               Don't tell mama. You musn't tell her who\n               you really are. I don't know what she'd\n               do! Please, you hear?\n\n     Suddenly, Beloved's face turns to rage as she rises up as\n     well;\n\n<b>                         BELOVED\n</b>               Don't tell me what to do? Don't never\n               tell me what to do!?\n\n<b>                         DENVER\n</b>               But..but I'm on your side. I want to\n               protect you...\n\n<b>                         BELOVED\n</b>                    (stands above Denver)\n               She's the one! She's the one I need! You\n               can go but she's the one I have to have!\n\n     Beloved abruptly drops to her knees and crawls out the\n     boxwood bush room as Denver's pleads;\n\n<b>                         DENVER\n</b>               No. Beloved please! Don't go! I didn't do\n               nothing! We were dancing! Don't go!....\n\n<b>     INT. DENVER'S &amp; BELOVED'S ROOM - DAWN THE FOLLOWING DAY.\n</b>\n     The room is still dark from the night but the sun is rising\n     outside.\n\n     Suddenly, Beloved awakens with a start. She senses something.\n     She rises and looks out the window to see;\n\n<b>     POV;\n</b>\n<b>     SETHE WALKING ACROSS THE FIELD.\n</b>\n     Beloved quickly grabs her clothes and exits to follow her, as\n     Denver awakens just in time to see her go.\n\n<b>     EXT. WOODS EARLY MORNING.\n</b>\n     Sethe is dressed as if for church as she makes her way through\n     the woods with a specific destination in mind.\n\n     Soon, she comes upon;\n\n<b>     EXT. A CLEARING IN THE WOODS - EARLY MORNING.\n</b>\n     Sethe steps out of the woods and into an open clearing. A\n     LARGE ROCK sits in the clearing like a pulpit above the pew's\n     of grass and weeds.\n\n     Sethe remembers the place as it was... She hears the VOICES\n     OF A CROWD...a gathering of people though the clearing\n     remains empty. She crosses to the rock and sits. Camera moves\n     up to reveal -\n\n<b>     MEMORY:\n</b>\n     BABY SUGGS, vital and strong, standing on the rock,\n     preaching:\n\n<b>                         BABY SUGGS\n</b>               I'm not here to tell you all to clean up\n               your lives and sin no more....I'm not\n               here to tell you we're the blessed meek\n               and are glorybound!...I'm here to tell\n               you that the only grace we can have, is\n               the grace we can imagine...And if you\n               cannot see it, then you shall not have\n               it...\n\n<b>     END OF MEMORY.\n</b>\n     C.U. on SETHE as she remembers Baby Suggs words, sitting\n     alone in the clearing - the images of the past gone.\n\n<b>     EXT. WOODS - SAME TIME.\n</b>\n     Beloved has found her and watches from a hidden place...\n\n     Camera moves beyond her to find;\n\n     Denver, having followed Beloved, watches her from a distance.\n\n<b>     EXT. A CLEARING IN THE WOODS - EARLY MORNING.\n</b>\n     Sethe remembers Baby Suggs advice:\n\n<b>                         BABY SUGGS (V.O.)\n</b>               ..God lead you home... So now, lay'em\n               down, child. Sword and shield..Don't\n               study war no more. Lay all that mess\n               down. Sword and shield...\n\n<b>                         SETHE\n</b>               Lay'em down...sword and shield.\n\n     Sethe weeps...She slides to the ground and holds her head to\n     weep. She covers her head from God and cries AS SHE LETS THE\n     MEMORIES COME..memories she can no longer fight from coming;\n\n<b>                                                            CUT TO:\n</b>\n<b>     SETHE'S MEMORIES;\n</b>\n<b>     EXT. SWEET HOME - A NIGHT REMEMBERED.\n</b>\n     SETHE IS IN THE SAME BENT OVER POSITION only here, her back\n     is exposed and she is being beaten by the Schoolteacher's\n     boys. The BOY BEATING SETHE never stops with the whip for a\n     second as he rants;\n\n<b>                         BOY BEATING SETHE\n</b><b>               NIGGER TRASH..OPENING YOUR MOUTH...\n</b>\n<b>                         SECOND BOY\n</b><b>               YOU GONNA KILL HER! YOU BETTER STOP!\n</b>\n<b>                         BOY BEATING SETHE\n</b><b>               I'LL KILL HER ALL RIGHT...NEVER OPEN HER\n</b><b>               MOUTH 'BOUT ME AGIN....\n</b>\n     They beat her mercilessly.\n\n<b>     EXT. FIELD - NIGHT.\n</b>\n     Sethe, tear stained, bloody and very pregnant fights her way\n     through a corn field as she makes her escape..\n\n     Her dress hangs torn at the back - her wounds open and\n     bleeding. Her feet already swollen and blistered. She is in\n     agonizing pain. She moves like a figure in a nightmare.\n\n<b>                                                            CUT TO:\n</b>\n<b>     A SERIES OF IMAGES IN WHICH WE SEE SETHE STRUGGLING THROUGH\n</b><b>     DAYS AND NIGHTS OF WALKING AND HIDING, IN VARIOUS LOCATIONS\n</b><b>     AS SHE MAKES HER WAY ACROSS THE STATE.\n</b>\n<b>     THE FINAL IMAGE IS:\n</b>\n<b>     EXT. ONION FIELD - DAY.\n</b>\n     Sethe falls to the ground unable to move - her contractions\n     have started and the pain is unbearable.\n\n     Her breasts are leaking on her sweat stained body. Her legs\n     are scratched and bleeding from moving through broken twigs\n     and rock. On her back, the tree is starting to form.\n\n     She lays there waiting for death. Until a VOICE ASKS:\n\n<b>                         AMY (OS)\n</b><b>               WHO THAT BACK THERE!\n</b>\n     Sethe can not answer as she hears TWO FEET moving through the\n     field. She clutches her pregnant stomach as if somehow she\n     might hide it from whoever might be coming to harm her.\n\n     A RAGGEDLY LOOKING WHITE GIRL with arms like cane stalks and\n     enough hair for five heads steps through into view.\n\n<b>                         AMY\n</b>               Look there. A nigger. If that don't beat\n               all...\n\n     Sethe can not speak for fear.\n\n<b>                         AMY\n</b>               Man, you 'bout the scariest looking\n               something I ever seen. What you doing\n               back up here?\n\n     Sethe manages to control her breath and push out the word;\n\n<b>                         SETHE\n</b>               Running.\n\n     Amy looks at Sethe's swollen, bloody flesh at the end of her\n     legs.\n\n<b>                         AMY\n</b>               Them the feet you running on? My Jesus\n               my...\n\n<b>                         SETHE\n</b>                    (semi-delerious)\n               Am I in Ohio?\n\n<b>                         AMY\n</b>               Ohio! Fool girl - you in Kentucky. You\n               'bout a thousand miles from Ohio.\n\n<b>                         SETHE\n</b>                    (murmurs to herself)\n               I'm still in Kentucky.\n\n<b>                         AMY\n</b>               You got anything on you, gal, pass for\n               food?\n\n<b>                         SETHE\n</b>               No, ma'am.\n\n<b>                         AMY\n</b>               I like to die I'm so hungry. Thought\n               there might be huckleberries. That's why\n               I come up here. You having a baby?\n\n<b>                         SETHE\n</b>               I expect this baby ma'am is gonna die in\n               these wild onions.\n\n     Amy doesn't know what to do with that information. So..\n\n<b>                         AMY\n</b>               Well, I got to eat something.\n\n     Any stands and looks as if she's about to leave when Sethe,\n     feeling the girl is safe, stops her with a question.\n\n<b>                         SETHE\n</b>               Where you on your way to, miss?\n\n<b>                         AMY\n</b>                    (eager to tell)\n               Boston. Get me some velvet. It's a store\n               called Wilson. I seen pictures and they\n               have the prettiest velvet.\n\n<b>                         SETHE\n</b>               Boston - is that far?\n\n<b>                         AMY\n</b>               Farther than Ohio.\n\n<b>                         SETHE\n</b>               Must be velvet closer by.\n\n<b>                         AMY\n</b>               Not like in Boston. Be so pretty on me.\n               You ever touch velvet? Or even seen it?\n\n<b>                         SETHE\n</b>               If I did, I didn't know it. What's it like?\n\n     Sethe desperately wants her to stay - to not be alone. Amy\n     kneels back down to her, curious now;\n\n<b>                         AMY\n</b>               What they call you?\n\n<b>                         SETHE\n</b>                    (lies)\n               Lu.\n\n<b>                         AMY\n</b>               What you gonna do, just lay there and\n               foal?\n\n<b>                         SETHE\n</b>               I can't get up.\n\n<b>                         AMY\n</b>               What?\n\n<b>                         SETHE\n</b>               I can't get up.\n\n     Amy wipes her nose and looks up beyond Sethe.\n\n<b>                         AMY\n</b>               There's a house back yonder. Well, not a\n               house with people in it - more like a\n               lean-to near the river.\n\n<b>                         SETHE\n</b>               How far?\n\n<b>                         AMY\n</b>               Make a difference, does it? You stay\n               here, snake might get you.\n\n<b>                         SETHE\n</b>               Well, he may come but I can't stand up,\n               let alone walk...and God help me, I can't\n               crawl.\n\n<b>                         AMY\n</b>               Sure you can Lu..come on..\n\n     Amy helps Sethe turn over onto all fours.\n\n<b>     EXT. ONION FIELD - DAY...MINUTES LATER.\n</b>\n     Amy walks beside Sethe as the latter painfully crawls, taking\n     moments to stop and let the pain go through her.\n\n<b>                         AMY\n</b>               Come on Lu! You got to move faster than\n               that. You won't get to Ohio til you\n               ninety years old, you keep moving that\n               ways.\n\n<b>     INT. LEAN-TO - EARLY EVENING.\n</b>\n     Amy makes a pile of leaves for Sethe to lay on and some rocks\n     for her to put up her feet. She talks non-stop as she works.\n\n<b>                         AMY\n</b>               Never know it to look at me but I used to\n               be a good size. Nice arms, everything.\n               That was before they put me in the root\n               cellar...\n\n     She eases Sethe onto the leaves then lifts her feet onto the\n     rocks.\n\n<b>                         AMY\n</b>               ...Mama worked for these people here to\n               pay for her passage but then she had me\n               and died right after so I had to work\n               for'em.. I was fishing off the Beaver\n               once and a nigger floated right by me. I\n               don't like drowned people, do you? Your\n               feet remind me of him. All swole like.\n\n     Amy props Sethe up from behind when she notices\n\n<b>                         AMY\n</b>               You all bloody back here. Gal you a mess.\n               Undo your dress - let me see.\n\n     Sethe makes a tremendous effort just to turn to her side as\n     Amy undoes her dress;\n\n<b>                         AMY\n</b>               Lord, I ain't never seen a poorer excuse\n               for a-\n\n     Amy sees Sethe's back and, for a moment, is speechless. Then:\n\n<b>                         AMY\n</b>               Jesus...It's a tree Lu..A chokecherry\n               tree. I had me some whippings but I don't\n               remember nothing like this. Glad I ain't\n               you.. what God have in mind I wonder.\n               ...You thank your Maker I come along.\n               Spiderwebs all I can do for you. What's\n               in here ain't enough. I'll look\n               outside...Maybe I ought to break them\n               blossoms open and let the pus run..\n                    (rises)\n                    (smiles)\n               That you ain't dead yet Lu's a miracle.\n               Make you a bet..You make it through the\n               night, you make it all the way...\n\n<b>     INT. LEAN-TO - NIGHT.\n</b>\n     To Sethe's amazement, Amy begins to massage her feet and legs\n     the pain of which causes Sethe to cry.\n\n<b>                         AMY\n</b>               It's gonna hurt now..Anything dead coming\n               back to life hurts. Stop wiggling, girl.\n                    (sings)\n<b>               \"WHEN THE BUSY DAY IS DONE AND MY WEARY\n</b><b>               LITTLE ONE ROCKETH TO AND FRO; WHEN THE\n</b><b>               NIGHT WINDS SOFTLY BLOW AND CRICKETS\n</b><b>               CHIRP AGAIN; WHERE'PON THE HAUNTED GREEN\n</b><b>               FAIRIES DANCE AROUND THEIR QUEEN THEN\n</b><b>               FROM YONDER MISTY SKIES COMETH LADY\n</b><b>               BUTTON EYES...\"\n</b>                    (talks)\n               Don't up and die on me in the night, you\n               hear me Lu? I don't want to see your ugly\n               face hankering over me. If you do die,\n               just go on off somewhere where I can't\n               see you, hear?\n\n<b>                         SETHE\n</b>               I'll do what I can, miss.\n\n     Amy continues singing.....\n\n<b>     EXT. PATH LEADING TO RIVER - DAY.\n</b>\n     Sethe is trying to walk, holding on to Amy at first, then a\n     tree.\n\n<b>                         AMY\n</b>               Cause of me, you up and walking. See,\n               Jesus - Lu made it through..I'm good at\n               sick things, ain't I?\n\n<b>                         SETHE\n</b>               Yeah, you good...\n\n<b>                         AMY\n</b>               What's that all over your dress?\n\n<b>                         SETHE\n</b>               Milk..Got to get my milk to my baby girl.\n\n<b>                         AMY\n</b>               You got another baby waiting for you?\n\n<b>                         SETHE\n</b>                    (stops and touches belly)\n               I think this one is dead.\n\n     Amy doesn't know what to say, so she says:\n\n<b>                         AMY\n</b>               You hungry?\n\n     Sethe keeps trying to walk;\n\n<b>                         SETHE\n</b>               I ain't nothing but in a hurry, miss. Got\n               to meet someone...help bring me and my\n               milk to my baby girl...\n\n<b>                         AMY\n</b>               You want shoes?\n\n<b>                         SETHE\n</b>               Say what?\n\n<b>                         AMY\n</b>               I figured how...\n\n<b>                                                            CUT TO:\n</b>\n     Amy cutting two pieces form Sethe shawl then filling them\n     with leaves and tying them over her feet -\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. RIVERBANK - DAY.\n</b>\n     Sethe and Amy walk towards the river when then see:\n\n     A SMALL, ABANDONED ROWBOAT with oars.\n\n<b>                         AMY\n</b>               Jesus looking at you, girl!\n\n     Sethe can't believe her eyes. She walks right into the water\n     when suddenly, her own water breaks and her labor begins...\n     She doubles up in pain;\n\n<b>                         AMY\n</b>               What you doing that for!? Ain't you got a\n               brain in your head? Stop that right now!\n               I said stop it, Lu. You the dumbest thing\n               on this here earth, LU!..LU!\n\n     Sethe, on her knees, crawls into the boat and props her feet\n     up. Water leaks in wherever it can, rising up as high as her\n     waist. Amy takes her position to assist.\n\n<b>                         AMY\n</b>               Oh Jesus, I'm awful sorry 'bout the\n               braggin...I need you here now..Come on\n               Jesus...don't be getting lost on me now.\n\n     Sethe screams in agony as the child pushes through. Amy curses;\n\n<b>                         AMY\n</b>               Damn daddies never around 'cept for the\n               fun part. Biggest joke God made on woman\n               was giving men the planters 'stead of the\n               soil...!! PUSH!\n\n<b>                         SETHE\n</b>                    (gasping)\n<b>               PULL!!\n</b>\n     Amy's strong hands pull Denver's head out and up, to meet\n     Sethe's eyes. Sethe cannot believe this creature made it\n     through..Amy rinses it with water then, wrapping it in her\n     skirt, holds it up to Sethe..\n\n<b>                         AMY\n</b>               My Lord...She's never gonna know who I\n               am. You gonna tell her? Who brought her\n               into this world. You better tell her, you\n               hear! You say MISS AMY DENVER. Of Boston.\n\n<b>                         SETHE\n</b>               That's pretty. Denver. Real pretty.\n\n<b>     EXT. BANKS OF THE OHIO RIVER - DAY.\n</b>\n     Sethe awakens, mud-caked, on the banks of the river. Her baby\n     girl crying beside her. Amy is gone. She rises, painfully,\n     picks up her child and continues on her way.\n\n<b>                                                            CUT TO:\n</b>\n<b>     MONTAGE - MORE DAYS AND NIGHTS OF SETHE, NOW WITHOUT AMY - A\n</b><b>     NEW BABY STRAPPED TO HER BODY - MAKING HER AWAY ALONG THE\n</b><b>     OHIO RIVER...THROUGH HOT SUNNY DAYS AND RAINY NIGHTS WITHOUT \n</b><b>     PROTECTION...SEARCHING FOR FOOD AND SHELTER...\n</b>\n<b>     FINAL IMAGE IS:\n</b>\n<b>     EXT. RIVER BANK - OAK TREE - NIGHT.\n</b>\n     A thunderstorm cracks across the sky and floods the river.\n\n     Sethe is sitting beneath the oak - the rain soaking her as\n     she breast feeds her baby. She cries out loud - but her sobs\n     and tears are lost in the rain and thunder.\n\n<b>     EXT. RIVERBANK - LATER THAT DAY.\n</b>\n     Sethe walks downriver with Denver tied to her chest. She\n     stops when she sees:\n\n     A FLATBED gliding down river. She can't make out if they're\n     white people or not, so she hides behind a tree until it\n     passes;\n\n     Waiting behind the tree, we see that Sethe is sweating a\n     fever. But Denver seems to be doing fine.\n\n     She sees the flatbed pass her and continues on her way. She\n     sees;\n\n     THREE COLORED PEOPLE - AN OLDER MAN and two boys - fishing.\n\n     She approaches cautiously.\n\n     One of the boys is the first to see her. Sethe's bloody and\n     torn clothes and her feverish face make her quite a sight to\n     the young boy. He taps the Old Man on the shoulder and\n     motions for him to turn around.\n\n     The Old Man takes in Sethe and instantly knows where she's\n     been and why she's there.\n\n<b>                         STAMP PAID\n</b>               Headin cross?\n\n<b>                         SETHE\n</b>               Yes sir.\n\n<b>                         STAMP PAID\n</b>               Anybody know you coming?\n\n<b>                         SETHE\n</b>               Yes sir. My mother-in-law over in...\n\n     Stamp Paid raises his hand to stop her. He looks around to\n     see that no one else is in sight, then motions for her to sit\n     on a rock. As she does, he gets a water jug and hands it to\n     her - she drinks like a madman in the desert. The Boys watch\n     in fascination. Stamp Paid turns to one of them and says:\n\n<b>                         STAMP PAID\n</b>               Take off that coat?\n\n<b>                         BOY\n</b>               Why?\n\n<b>                         STAMP PAID\n</b>               You heard me?\n\n     The Boy slips out of his jacket, complaining.\n\n<b>                         BOY\n</b>               What am I gonna wear?\n\n<b>                         STAMP PAID\n</b>               You want it back...\n\n     He unties the baby from Sethe and wraps it in the coat.\n\n<b>                         STAMP PAID\n</b>               ..then you go head and take it off this\n               baby. And if you can do that, then go\n               'way somewhere and don't come back.\n\n<b>     EXT. RIVER - DAY.\n</b>\n     On a flatbed, Stamp Paid crosses the river with Sethe, her\n     baby and the two boys.\n\n<b>     EXT. OPPOSITE RIVER BANK - DAY.\n</b>\n     Stamp Paid helps Sethe walk up a very steep bank while the\n     Boy without a jacket, carries the baby who wears it.\n\n<b>     INT. BRUSH-COVERED HUTCH - DAY.\n</b>\n     Stamp Paid leads Sethe and the others into the hutch.\n\n<b>                         STAMP PAID\n</b>               Wait here. Somebody be here directly.\n               Don't move. They'll find you.\n\n<b>                         SETHE\n</b>               Thank you. What's your name - so I can\n               remember you right.\n\n<b>                         STAMP PAID\n</b>               Name's Stamp. Stamp Paid. Watch out for\n               that baby, you hear?\n\n     She nods as he and the boys exit.\n\n<b>                                                   LAP DISSOLVE:\n</b>\n<b>     LATER - SAME LOCATION:\n</b>\n     Sethe is asleep with the baby when ELLA enters the hutch;\n\n<b>                         ELLLA\n</b>               Saw the sign a while ago but I couldn't\n               get here no quicker.\n\n<b>                         SETHE\n</b>               What sign?\n\n<b>                         ELLA\n</b>               Stamp always leave the old sty open when\n               there's a crossing. Knots a white rag on\n               the post if it's a child too.\n                    (kneels)\n               My name's Ella..Where you headed?\n\n     Ella empties a sack with a wool blanket, cotton cloth, two\n     baked sweet potatoes and a pair of men's shoes.\n\n<b>                         SETHE\n</b>               My mother-in-law's. Name's Baby Suggs. She\n               got my other three children I sent ahead.\n\n<b>                         ELLA\n</b>               When was this one born?\n\n<b>                         SETHE\n</b>               Yesterday. I hope she makes it.\n\n<b>                         ELLA\n</b>               Hard to say.\n                    (gives her men's shoes)\n               Let's try to get these on your feet.\n\n<b>     EXT. 124 BLUESTONE ROAD - NIGHT.\n</b>\n     Baby Suggs rises off the bench on the porch when she sees\n     Sethe coming up the walk. She runs to her and embraces Sethe\n     and the baby, tears in her eyes.\n\n<b>                         BABY SUGGS\n</b>               Oh my Lord...My sweet Lord thank you.\n\n     Baby Suggs welcomes Sethe into the house, kissing her hard on\n     the lips....Sethe can't believe she's in her arms.\n\n<b>                         BABY SUGGS\n</b>               Where's Halle?\n\n     Sethe looks at her with confusion and exhaustion.\n\n<b>                         SETHE\n</b>               He wasn't there.\n\n     A flash of fear is quickly transformed into pragmatism.\n\n<b>                         BABY SUGGS\n</b>               Well, he be along presently, I'm sure.\n\n<b>                         SETHE\n</b>               Where are the children?\n\n<b>                         BABY SUGGS\n</b>               Not now. You too ugly looking to wake 'em\n               up in the night. First we get you well..\n\n<b>     INT. KEEPING ROOM - NIGHT.\n</b>\n     Baby Suggs bathes Sethe - first her face, her body...hands,\n     arms, legs...\n\n     When she gets to her unrecognizable feet, she touches them.\n\n<b>                         BABY SUGGS\n</b>               You feel this?\n\n<b>                         SETHE\n</b>               Feel what?\n\n<b>                         BABY SUGGS\n</b>               Nothing..\n\n     Baby Suggs notices roses of blood on Sethe's back...She looks\n     and covers her mouth when she sees the remnants of the whipping.\n\n<b>                         BABY SUGGS\n</b>               Girl...\n\n<b>     INT. KEEPING ROOM - LATER THAT DAY.\n</b>\n     Baby Suggs with two other grown women attend to Sethe's back -\n     greasing it and pinning double thicknesses of cloth to the\n     inside of a newly stitched dress...\n\n<b>     INT. KEEPING ROOM - STILL LATER THAT DAY.\n</b>\n     Sethe, sitting in bed with her new dress and her wounds\n     dressed waits for her children.\n\n     Baby Suggs opens the door and the boys are ushered in. Sethe\n     welcomes them to her arms...They run to her, jumping on the\n     bed. The startle causes some pain but Sethe doesn't care.\n\n     The Little Girl (Beloved) is crawling and ushered toward her\n     mama.\n\n<b>                         BABY SUGGS\n</b>               Already crawling - ain't that somethin?\n               ..Come on, baby girl..right this\n               way..Mama's waiting..\n\n     Sethe picks her up and the tears flow. She can't stop kissing\n     them - their necks, their heads, their hands...The Boys\n     inspect her strange looking feet and ask;\n\n<b>                         HOWARD\n</b>               Pappie come?\n\n<b>                         SETHE\n</b>               Soon.\n\n     Baby Suggs seems doubtful but appreciates the lie for the\n     children.\n\n<b>                         BABY SUGGS\n</b>               All right boys - mama's home now, you be\n               seeing her all the time..Go downstairs\n               and get your supper...Go on...\n\n     Sethe hugs and kisses them as if for the last time - as if\n     she still doesn't believe she can just get out of bed, walk\n     downstairs and be with them. The Boys leave as Sethe cradles\n     the Little Girl.\n\n     Sethe anxiously undoes her dress and carefully guides her\n     breast to the Little Girl. She winces with pain and smiles -\n     she got her milk to her baby girl.\n\n     Baby Suggs gathers the rags Sethe wore when she first arrived.\n\n<b>                         BABY SUGGS\n</b>               Nothing worth saving here.\n\n<b>                         SETHE\n</b>               Oh wait..Look and see if there's\n               something knotted up in the petticoat.\n               Wedding present. From Mrs. Garner.\n\n     Baby Suggs finds TWO CRYSTAL EARRINGS.\n\n<b>                         BABY SUGGS\n</b>               Be nice if there was a groom to go with\n               it. What do you think happened to him?\n\n<b>                         SETHE\n</b>               I don't know. He wasn't where he said to\n               meet him at. I had to get out. I had to.\n               He'll make it. if I made it, Halle sure\n               can.\n\n<b>                         BABY SUGGS\n</b>                    (skeptical)\n               Well put these on - maybe they'll light\n               his way.\n\n     As Sethe takes the earrings, the Little Baby Girl reaches for\n     them.\n\n     Through her eyes, we see them sparkle and shine - like\n     diamonds.\n\n     Baby Suggs hands gently massage Sethe's neck as she says;\n\n<b>                         BABY SUGGS\n</b>               Whatever happens now...God lead you home.\n               So now lay'em down Sethe...Sword and\n               shield..Don't study war no more. Lay all\n               that mess down. Sword and shield...\n\n     Sethe surrenders herself to Baby Suggs firm, safe hands -\n     letting go of the \"diamonds\", one of which lands in the hands\n     of the Little Girl...who plays with them in fascination...\n\n<b>     END OF MEMORY.\n</b>\n<b>                                                       CUT BACK TO:\n</b>\n<b>     PRESENT DAY;\n</b>\n<b>     EXT. A CLEARING IN THE WOODS - DAY\n</b>\n     Sethe is remembering these last images, she eases her own\n     hand up to her neck - rubbing herself the way Baby Suggs did.\n     She realizes how much she misses her...and wonder who can\n     touch her now and help her \"lay it all down\". And then, quite \n     suddenly;\n\n<b>     AN IMAGE FLASHES ACROSS HER MIND;\n</b>\n<b>     - PAUL GENTLY EASING HIS HANDS AROUND SETHE FROM\n</b><b>     BEHIND...TENDERLY KISSING SETHE'S BACK\n</b>\n     Paul...There is Paul. Sethe realizes, as IMAGES FLASH ACROSS\n<b>     HER MIND'S EYE:\n</b>\n<b>     - PAUL SITTING ON THE PORCH THE FIRST DAY HE ARRIVED.\n</b>\n<b>     - PAUL BATTLING THE BABY GHOST.\n</b>\n<b>     - PAUL SINGING AS HE FIXES THE KITCHEN TABLE.\n</b>\n<b>     - SETHE WRAPPED IN PAUL'S BIG ARMS AS THEY LAY IN BED.\n</b>\n     Sethe rises from the ground, as if with a new realization.\n     She begins to walk out of the clearing and into the woods,\n     her pace increasing with each image....\n\n<b>     EXT. WOODS - DAY.\n</b>\n     Sethe walks through the woods, passing Beloved unawares - who\n     has fallen asleep by a tree. Beloved is awakened as Sethe\n     walks by, and gets to her feet to follow.\n\n     Further on, Sethe passes a sleeping Denver, who also awakens\n     upon hearing the footsteps of her mother, followed by\n     Beloved. Sethe walks on, unaware of them following her.\n\n<b>     EXT. FIELD OF 124 BLUESTONE - DAY.\n</b>\n     Wide angle of Sethe walking well ahead of Beloved and Denver.\n\n     Sethe is walking with great purpose and energy.\n\n<b>     INT. 124 BLUESTONE ROAD - DAY.\n</b>\n     Sethe enters and runs through the house to the kitchen;\n\n<b>                         SETHE\n</b>               Paul? Paul, you home?...\n\n     Paul sits in a tub under the white staircase. He smiles.\n\n     Sethe is relieved...grateful to find him there, for her.\n\n<b>                         PAUL\n</b>               Where else would I be on a Sunday off?\n\n     Sethe smiles, almost in tears.\n\n<b>                         PAUL\n</b>               Why don't you come on in here?\n\n<b>                         SETHE\n</b>               Paul D. What if the girls came in?\n\n<b>                         PAUL\n</b>               I don't hear nobody.\n\n<b>                         SETHE\n</b>               I have to cook.\n\n     Paul D. stands up in the tub and holds Sethe against his wet,\n     naked body.\n\n<b>                         PAUL\n</b>               What you gonna cook?\n\n<b>                         SETHE\n</b>                    (loving his body and his \n                    attention)\n               I thought I'd make some snap beans.\n\n<b>                         PAUL\n</b>               Oh yeah.\n\n<b>                         SETHE\n</b>               Fry up a little corn?\n\n<b>                         PAUL\n</b>               Yeah.\n\n     He kisses her - and that's exactly what she wanted.\n\n<b>                         SETHE\n</b>               Oh Paul...\n\n<b>                         PAUL\n</b>               I'm right here baby.\n\n<b>                         SETHE\n</b>               Thank you Lord.\n\n     Camera slowly moves out of the kitchen as Sethe and Paul\n     begin to make love, revealing;\n\n     Beloved watching from the doorway, unknown to Sethe or Paul.\n     She is disgusted, envious...and runs out..\n\n<b>     EXT. 124 BLUESTONE ROAD - DAY.\n</b>\n     Beloved runs out of the house and heads back for the woods.\n     She passes Denver as if she weren't there.\n\n<b>     EXT. STREAM IN THE WOODS - DAY.\n</b>\n     Beloved reaches the stream and steps in. She begins to\n     violently hit the water around her, then begins hitting her\n     own face and head, clawing at it as if to escape from the\n     boundaries of flesh. Suddenly she submerges herself\n     underwater and holds herself there, as if to drown herself...\n\n     She bursts out of the water, gasping for air...Slowly, her\n     rage subsides, replaced with a calm, ruthless understanding\n\n<b>     EXT. THE FIELD OF 124 BLUESTONE RD.- DAY.\n</b>\n     Beloved is walking back toward the house. She stops.\n\n     She looks back at the house to the kitchen window - knowing\n     Paul and Sethe are in there. She approaches the kitchen\n     window and looks in.\n\n     POV - Sethe is drying off Paul's body and rebuttoning her\n     dress.\n\n     Camera moves slowly into a C.U. of Beloved, this time her\n     focus is on Paul.\n\n<b>     INT. 124 BLUESTONE ROAD - EVENING.\n</b>\n     The inhabitants eat dinner in silence.\n\n     Denver awaits a look from Beloved. As Beloved passes her a\n     bowl of peas with a smile, Denver is satisfied.\n\n     Beloved then turns to Paul, offering him the bowl.\n\n<b>                         BELOVED\n</b>               You have brothers or sisters?\n\n     Caught off guard, Paul looks to Sethe - whose expression asks\n     him to be nice.\n\n<b>                         PAUL\n</b>               We don't talk about that.\n\n     Beat.\n\n<b>                         BELOVED\n</b>               Sethe told us you been walking for\n               eighteen years. Where you been all that\n               time?\n\n     Paul is about to get mad when he looks to Sethe again, reels\n     it back in and answers curtly, but politely;\n\n<b>                         PAUL\n</b>               Lots of places. I don't remember them\n               all. Don't remember much about anything.\n\n<b>                         BELOVED\n</b>               You be surprised what you start\n               remembering once you start talking.\n\n     Hearing his own words echoed back to him, annoys him.\n\n<b>                         PAUL\n</b>               Well not me. What's gone is gone. No good\n               come from bringing it back.\n\n     Pause. Paul focuses on his dinner, suddenly ill at ease. He\n     can't help looking, covertly, at Beloved and finds Beloved\n     staring right back at him...It makes him shiver.\n\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     Sethe is asleep.\n\n     Paul is restless - tossing and turning as we Intercut;\n\n     Dream Images flashing across his mind...\n\n<b>     - RAIN POURING DOWN A TRENCH. A MUDDY POOL FORMING AROUND A\n</b><b>     BLACK MAN'S FEET.\n</b>\n<b>     - IRON CHAINS FED INTO METAL ANKLE CUFFS.\n</b>\n     - PAUL D. ON HIS KNEES BEFORE A WHITE GUARD crotch.\n\n<b>                         WHITE GUARD (OS)\n</b><b>               YOU HUNGRY NIGGER?\n</b>\n     Paul awakens.\n\n<b>     INT. KITCHEN - DAWN.\n</b>\n     Sethe enters to find Paul asleep in the rocker by the stove.\n     She stirs him.\n\n<b>                         SETHE\n</b>               Paul?..Paul?\n\n<b>                         PAUL\n</b>                    (waking up)\n               Mmmm. What?...\n\n<b>                         SETHE\n</b>               I called you two or three times but I\n               gave up round midnight. I thought maybe\n               you went out somewhere.\n\n<b>                         PAUL\n</b>               Damn. I'm sorry honey...\n\n<b>                         SETHE\n</b>               I'll make some breakfast - you get\n               yourself washed up.\n\n     Sethe begins to make breakfast as Beloved enters the kitchen\n     and sees Paul has slept in the rocker. She looks at him with\n     a smile, as if she knows more than she's letting on. Paul\n     registers the look.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     Paul is asleep in the rocker...He is restless...HE DREAMS:\n\n<b>     EXT. A ROAD IN VIRGINIA - DAY.\n</b>\n     Paul is chained by the ankles to forty-five other men. He\n     hands are shackled. In his mouth, an iron bit...\n\n     The men are being led by WHITE GUARDS with rifles.\n\n     Camera follows them under a burning sun as they approach;\n\n     A TRENCH. One thousand feet long. Five feet deep. Five feet\n     wide.\n\n     Camera tilts down to reveal, within the trench;\n\n     WOODEN BOXES, with scrap limber roofs and a door of bars\n     fitted on them like a cage that opens up to a wall of red\n     dirt stretching two feet above the top of the bars themselves.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     Paul awakens...his face and body drenched in sweat.\n\n<b>     EXT. FIELD BETWEEN 124 AND THE STOREROOM - NIGHT.\n</b>\n     Paul D. walks across the field with a thin blanket over his \n     nightclothes - walking toward the storeroom.\n\n     In the window of her bedroom, Sethe watches him - sensing he\n     is moving further and further away from her.\n\n     In the window of Denver's room, Beloved watches Paul as well -\n     with a pleased expression.\n\n<b>                                                            CUT TO:\n</b>\n<b>     PAUL'S MEMORIES;\n</b>\n<b>     EXT. A FIELD IN GEORGIA - DAY.\n</b>\n<b>     A RIFLE SHOT. A WHITE GUARD SHOUTS;\n</b>\n<b>                         WHITE GUARD\n</b>               Hiiiiiii!\n\n<b>     EXT. TRENCH - DAY.\n</b>\n     Three white Men walk along the trench unlocking the cage\n     doors one by one...\n\n     One by one, the Black men emerge and stand in a line in the\n     trench.\n\n     When all are assembled, A SECOND RIFLE SHOT signals them to\n     climb out of the trench to the ground above.\n\n     Waiting for them above the trench, is one thousand feet of\n     chain. Each Black Man bends over and waits as the First Man\n     on line threads the chain through his leg iron, passing it to\n     the second and so on...\n\n     As they connect each other to the chain, Camera Pans down the\n     line of men and while not a word is spoken, WE HEAR THEIR \n     THOUGHTS...thoughts to themselves, or, if possible, through\n     their eyes to the man beside them:\n\n<b>                         BLACK MAN ONE\n</b><b>                         (VO)\n</b>               I'm a make it..\n\n<b>                         BLACK MAN TWO\n</b><b>                         (VO)\n</b>               New man. New man...\n\n<b>                         BLACK MAN THREE\n</b><b>                         (VO)\n</b>               Steady now, steady.\n\n<b>                         BLACK MAN FOUR\n</b><b>                         (VO)\n</b>               Help me... this mornin's bad.\n\n<b>                                                       DISSOLVE TO:\n</b>\n<b>     THE BLACK MEN ARE CHAINED AND KNEELING IN A STRAIGHT LINE.\n</b>\n     The White Guards walk passed them. one White Guard stops in\n     front of the man beside Paul D. He turns to him.\n\n<b>                         WHITE GUARD\n</b>               Breakfast? Want some breakfast nigger?\n\n<b>                         BLACK MAN ONE\n</b>               Yes sir.\n\n<b>                         WHITE GUARD\n</b>               Hungry nigger?\n\n<b>                         BLACK MAN ONE\n</b>               Yes sir.\n\n<b>                         WHITE GUARD\n</b>               Here you go.\n\n     The White Guard unzips his fly and undoes his pants and moves\n     a step closer to the Black Man's mouth.\n\n     Paul D. looks ahead, trembling...He vomits...The Guard steps\n     away as another Guard steps in and hits Paul on the shoulder\n     with a rifle..\n\n<b>     EXT. FIELD - DAY.\n</b>\n     The Black Men work...sledge hammers in hand...\n\n     As they work, miraculously, THEY SING..\"They sing about the\n     women they knew, the children they had been...they sing of\n     bosses and masters and misses...of mules and dogs and the \n     shamelessness of life...They sing of sisters long gone. They\n     sing love songs to Death.\"\n\n<b>     INT. TRENCH - NIGHT.\n</b>\n     A torrential downpour. The men in the wooden cages watch the\n     rain filling the trench, corroding the red dirt wall around\n     them.\n\n     Bugs and human debris swirl around their legs and feet. Mud\n     covering them through the cracks of the scrap lumber roof.\n\n     Some finds rest. other's minds are long gone.\n\n     Camera finds Paul...HE IS SCREAMING. But there is no sound\n     coming from his mouth. Tears flow down his face, but when he\n     touches them, he realizes;\n\n     They are tears of mud. He looks up and the wooden planked\n     roof is breaking under the power of the rain..He looks down\n     and the water is up to his thighs.\n\n     Suddenly, the chain linking his feet is pulled and he is\n     knocked down..He gets up, searches through the mud for the\n     chain and notices it's slack..He pulls as well....\n\n     One by one the men in the boxes realize the chain's end is\n     being undone by the rain, as camera tracks down towards the\n     last box to the dirt wall, into which the chain has been\n     locked...It is giving way within the muddy wall.\n\n<b>     THE MEN BREAK THROUGH THE ROTTED WOOD ROOFS TO FREEDOM...\n</b>\n<b>     WIDE ANGLE;\n</b>\n<b>     AS THE MEN CLIMB OUT OF THE MUDDY COFFINS, GRASPING FOR A\n</b><b>     HOLD, CRAWLING WITH EVERY MUSCLE OF THEIR BODIES - TO GET OUT\n</b>     OF THE TRENCH before mud and water drown them....\n\n     Paul climbs with the will of ten men, with every ounce of\n     strength he has left...\n\n     END of MEMORY.\n\n<b>                                                       CUT BACK TO:\n</b>\n<b>     INT. COLD ROOM - A WINTER NIGHT.\n</b>\n     Paul D. is wide awake. The memories won't let him sleep.\n\n     Winter has arrived and the night is cold. He lies underneath\n     a thin blanket in yet another sleeping place, even further\n     from the house. He adds newspapers under and around his body\n     to stay warm.\n\n     He looks as if he has given up on sleeping altogether. He\n     hears the door to the cold room open. But he does not turn to\n     look.\n\n<b>                         PAUL\n</b>               What do you want in here?\n\n     Beloved enters the cold room.\n\n<b>                         BELOVED\n</b>               I want you to touch me on the inside part\n               and call me my name.\n\n     She hoists up her skirt and turns her head away.. Paul stares\n     at a silver lard can so as not to look.\n\n<b>                         PAUL\n</b>               When good people take you in and treat\n               you good, you ought to try to be good\n               back. You don't....Sethe loves you. Much\n               as her own daughter. You know that.\n\n<b>                         BELOVED\n</b>                    (drops her skirt)\n               She don't love me like I love her. I\n               don't love nobody but her.\n\n<b>                         PAUL\n</b>               Then what you come in here for?\n\n<b>                         BELOVED\n</b>               I want you to touch me on the inside\n               part.\n\n<b>                         PAUL\n</b>               Ever since you come here - feel like I\n               got a new devil to face.\n\n<b>                         BELOVED\n</b>               You have to touch me. On the inside part.\n               And you have to call me my name.\n\n<b>                         PAUL\n</b>               Ain't no chains on me no more. I don't\n               have to do nothing...Now, go back in that\n               house and go to bed.\n\n     Paul continues to stare at the lard can - like Lot's wife,\n     he's fearful what turning to look will do.\n\n<b>                         BELOVED\n</b>               Call me my name.\n\n     Beloved moves closer, right up behind him, entwining her arms\n     around his body, like chains..\n\n<b>                         PAUL\n</b>               No. Ain't no chains on me...\n\n<b>                         BELOVED\n</b>               Call me.\n\n<b>                         PAUL\n</b>               ...Ain't no chains on me...\n\n<b>                         BELOVED\n</b>               I'll go if you say it.\n\n     Tears well up in his eyes. Paul can feel her warmth. He\n     surrenders.\n\n<b>                         PAUL\n</b>               Beloved.\n\n     Beloved presses her body against his. He turns and grabs her,\n     kissing her with a passion bordering on hatred.\n\n<b>     EXT. COLD HOUSE - NIGHT.\n</b>\n     Denver sits outside the cold house - and listens to the\n     sounds of lovemaking. And cries.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     Sethe, Denver, Paul and Beloved eat dinner...in silence.\n\n<b>     INT. COLD HOUSE - ANOTHER NIGHT.\n</b>\n     Beloved is wrapping her body with a blanket as Paul lies on\n     his bed of newspapers - their lovemaking finished. Beloved\n     gives him a final look - no tenderness or affection or even \n     friendliness. Just a cold look, void of respect or even\n     attraction.\n\n     She exits the cold house, leaving Paul alone. He is on the\n     verge of tears.\n\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     Paul stands above the sleeping Sethe - his guilt driving him\n     mad. He wants to touch her, to wake her, to ask for\n     forgiveness and help. But he can not and buries his head in\n     his hands.\n\n<b>     EXT. SAWYER RESTAURANT - LATE AFTERNOON.\n</b>\n     Paul waits outside in the cold, cupping his hands and\n     breathing inside to keep them warm. He is rehearsing:\n\n<b>                         PAUL\n</b>               Look here Sethe..You ain't gonna like\n               what I got to say but I got to say\n               it...See, it's not the..a man\n               can't...what I mean is, it ain't really\n               me..see, it ain't weakness, the kind of\n               weakness I can fight, that girl is doing\n               it. I know you think I never liked her\n               nohow, still don't, but she is doing it\n               to me anyway. Fixing me, Sethe, she's\n               fixed me and I can't break it...\n\n     Sethe appears, exiting the back door of the restaurant with a\n     scrap pan in the crook of her arm. To her surprise. she finds\n     Paul waiting for her.\n\n<b>                         SETHE\n</b>               Man, you make me feel like a young girl,\n               you coming by to pick me up after work.\n               Nobody ever did that before. Better watch\n               out, I might start looking forward to it.\n\n     She tosses the bones and skins from the scrap pan into a heap\n     before four dogs who wait there as if by appointment.\n\n<b>                         SETHE\n</b>               Got to rinse this out.\n\n     She enters the restaurant. Paul watches the dogs eat -\n     watching them getting what they wanted. Sethe re-appears with\n     a cloth over her head.\n\n<b>                         SETHE\n</b>               You get off early or what?\n\n<b>                         PAUL\n</b>               I took off early.\n\n<b>                         SETHE\n</b>               Anything the matter?\n\n<b>                         PAUL\n</b>               In a way of speaking.\n\n<b>                         SETHE\n</b>               Not cut back?\n\n<b>                         PAUL\n</b>               No, no. They got plenty of work with them\n               pigs..More they can handle. I just..\n                    (Sethe waits)\n               You ain't gonna like what I'm about to\n               say, Sethe.\n\n     Sethe steps forward to hear what Paul came to tell her. There\n     is no apprehension or anger in her look. Instead, a calm\n     resolve - as if she were already able to accept whatever he\n     had to tell her without it being anyone's fault. As if she\n     already knew he cane to say he was leaving her. She smiles.\n\n<b>                         SETHE\n</b>               Well say it, Paul D...whether I like it\n               or not.\n\n     Paul knows what she's expecting. And when he sees her\n     diminished expectation, the melancholy without blame in her\n     eyes....he can't tell her about Beloved. He is filled with\n     respect and admiration for her in that moment. Something pops\n     into his head and out of his mouth that wasn't planned;\n\n<b>                         PAUL\n</b>               I want you pregnant, Sethe. Would you do\n               that for me?\n\n     Sethe breaks up with laughter. Paul joins in.\n\n<b>                         SETHE\n</b>               You came by here to ask me that!? You are\n               one crazy-headed man. You right; I don't\n               like it!...Don't you think I'm a little\n               too old to start that all over again?\n\n     She slips her fingers into his.\n\n<b>                         PAUL\n</b>               Think about it.\n\n     Paul lifts them, putting the tips of her fingers on his\n     cheek. He smiles broadly;\n\n     She laughs, shaking her head. A burden transformed into a\n     gift, so suddenly. They begin walking.\n\n     Sethe and Paul catch and snatch each other's fingers,\n     stealing quick pats on the behind, joyfully. Paul throws his\n     arm around Sethe and squeezes. She lets her head touch his\n     chest. They stop and stay that way for a moment - not\n     breathing. Sethe closes her eyes. Paul looks up to the trees\n     lining the roadside like defending arms against attack.\n     Softly, suddenly, it begins to snow. Sethe opens her eyes:\n\n<b>                         SETHE\n</b>               Mercy.\n\n<b>     EXT. BLUESTONE ROAD - EARLY EVENING.\n</b>\n     On the road towards 124, Paul and Sethe run hand in hand.\n     Snow falling all around them.\n\n<b>                         SETHE\n</b>               I been on my feet all day, Paul D.\n\n<b>                         PAUL\n</b>               Where I been? Sitting down!?\n\n<b>                         SETHE\n</b>               Stop! I don't have the legs for this!\n\n     They slow to a walk.\n\n<b>                         PAUL\n</b>               Then give'em to me.\n\n     Before she can stop him, Paul hoists Sethe up over his\n     shoulders.\n\n<b>                         SETHE\n</b>               You need some babies..somebody to play\n               with in the snow.\n\n<b>                         PAUL\n</b>               I sure would like to give it a try. Need\n               a willing partner though.\n\n<b>                         SETHE\n</b>               I'll say..Very, very willing.\n\n     They continue laughing and moving down Bluestone Road when\n     they are jolted by the appearance of;\n\n     Beloved. Waiting in her usual place for Sethe. Her hands\n     wrapped in a long shawl, waiting to be given to Sethe. Her\n     eyes only on Sethe, not even acknowledging Paul's presence.\n\n     Sethe gets herself down from Paul.\n\n<b>                         SETHE\n</b>               Crazy girl. You out here with nothing on.\n\n     She takes the shawl from Beloved's hands and wraps it around\n     her shoulders.\n\n<b>                         SETHE\n</b>               You got to learn more sense than that.\n\n     She walks on ahead with Beloved. Paul, suddenly icy cold and\n     filled with anger, walks behind.\n\n<b>     EXT. 124 BLUESTONE ROAD - NIGHT.\n</b>\n     Denver waits on the porch. Sethe and Beloved walk by her.\n\n<b>                         SETHE\n</b>               Evening, girl.\n\n     Sethe and Beloved enter the house. As Paul approaches, he\n     stops before Denver. Their eyes meet. Paul stares at her, as\n     if to ask - \"Who's ally are you?\"...Denver, unnerved by his\n     look, runs into the house. Paul waits on the porch until, a\n     moment later, Sethe re-appears.\n\n<b>                         SETHE\n</b>               Now I know you not sleeping out there\n               tonight, are you Paul D.?\n                    (Paul doesn't reply)\n               You come upstairs tonight. Where you\n               belong...and stay there.\n\n     As if healed by her strength, Paul's face melts into relief.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     Denver is cleaning the dishes. Beloved sits like an angry,\n     upset five year old with her fingers in her mouth.\n\n<b>                         BELOVED\n</b>               She likes him here...\n                    (to Denver)\n               Make him go away.\n\n<b>                         DENVER\n</b>               She'd be mad if he leaves.\n\n     Beloved didn't consider that. Her fingers move violently in\n     her mouth as if something were bothering her...until,\n     finally, she pulls out a back tooth...her lips slightly\n     bloody.\n\n<b>                         DENVER\n</b>               OOoo..didn't that hurt you?\n\n<b>                         BELOVED\n</b>               It's like my dreams...I get two dreams,\n               see..One, I exploding...BUUOOGGG...The\n               other I being swallowed. Sometimes it's\n               hard to keep my head on my neck, or these\n               legs connected to my hips...One day I\n               think I might wake up and I'll be in\n               pieces..\n                    (Looks at tooth)\n               Maybe it's starting.\n\n<b>                         DENVER\n</b>                    (cleans Beloved's mouth)\n               Oh stop. It's just a tooth. Probably\n               wisdom. Does it hurt?\n\n<b>                         BELOVED\n</b>               Yes.\n\n<b>                         DENVER\n</b>               Then why don't you cry?\n\n<b>                         BELOVED\n</b>               What?\n\n<b>                         DENVER\n</b>               If it hurts, why don't you cry?\n\n     Beloved, eases herself into Denver's arms, and cries...\n\n<b>     EXT. WINDOW OF 124 - NIGHT.\n</b>\n     We see Sethe and Paul united as the snow begins to pile up.\n\n<b>     INT. SETHE'S BEDROOM - LATER THAT NIGHT.\n</b>\n     Sethe lies with Paul, in the dark, her face looking up to the\n     ceiling. Paul is asleep.\n\n     On her face are reservations. She rises, crossing to the\n     window to look out.\n\n     At the same time, Beloved appears silently at the doorway of\n     the room, looking at Sethe - hurt and sad. She walks by\n     without Sethe noticing her.\n\n     Sethe takes a breath at the window, watching the snow fall.\n     Then, as she moves back to the bed,...\n\n     Camera moves ahead of her to:\n\n<b>     A DIFFERENT BED IN WHICH HALLE IS TRYING TO FALL ASLEEP. A\n</b><b>     YOUNGER SETHE CRAWLS IN BESIDE HIM.\n</b>\n<b>     WE ARE IN MEMORY;\n</b>\n<b>     INT. HALLE &amp; SETHE'S SWEET HOME LIVING QUARTERS - NIGHT.\n</b>\n     Sethe, Halle and the baby girl (Beloved) sleep together by\n     the wall. The boys sleep together under a window.  Halle is\n     trying to sleep but Sethe is awake...\n\n<b>                         SETHE\n</b>               What you think about Schoolteacher?\n\n<b>                         HALLE\n</b>               He white, ain't he?\n\n<b>                         SETHE\n</b>               I mean, is he different like Mr. Garner\n               was?\n\n<b>                         HALLE\n</b>               How was he different?\n\n<b>                         SETHE\n</b>               Well, he and Mrs. Garner - they ain't\n               like other whites I seen before.\n               Mr. Garner always spoke soft, for one.\n               Mrs. Garner too.\n\n<b>                         HALLE\n</b>               Don't matter. Loud or soft, what they\n               say is the same.\n\n<b>                         SETHE\n</b>               Mr. Garner let you buy out your mother.\n               Found that house for her to live in from\n               those friends of his in Ohio...\n\n<b>                         HALLE\n</b>               Yep. He did.\n\n<b>                         SETHE\n</b>               Well?\n\n<b>                         HALLE\n</b>               If he hadn't, she would have dropped in\n               his cooking stove.\n\n<b>                         SETHE\n</b>               Still, he did it. Let you work off her\n               fee, lending yourself out on Sundays. He\n               could of said no. He didn't tell you no.\n\n<b>                         HALLE\n</b>               No, he didn't tell me no. She worked here\n               ten years. If she worked another ten, ya\n               think she would have made it? I pay him\n               for her last years and in return he got\n               you, me and three more coming..\n\n<b>                         SETHE\n</b>               He always treated you fair. Called you\n               all men - said he never wanted niggers on\n               his farm.\n\n<b>                         HALLE\n</b>               That's just it. We was men because he\n               said so. We was men because we was on his\n               land. You think he be calling us men if\n               we ever walked off his land?\n\n<b>                         SETHE\n</b>               When we walk, don't matter what they call\n               you. You'll be free.\n\n<b>                         HALLE\n</b>               Sethe..baby girl, that ain't gonna\n               happen. Not by walking, anyway.\n\n<b>                         SETHE\n</b>               What you mean?\n\n<b>                         HALLE\n</b>               Schoolteacher in there told me to quit\n               lending myself out.\n\n     That phrase \"..while the boys is small\"..causes Sethe to look\n     at her sleeping boys..\n\n<b>                         SETHE\n</b>               But..then..how you gonna buy yourself\n               out? Or them?\n                    (points to the children)\n               Or me?\n\n     Halle raises himself up to face her, to give her the final blow.\n\n<b>                         HALLE\n</b>               Ain't gonna be no buying us out, like I\n               did with mama. Or them. As far as\n               Schoolteacher concerned, ain't no other\n               life ahead for any of us but this one.\n\n     Sethe understands, looks to her sleeping children and is\n     frightened.\n\n<b>                         SETHE\n</b>               Halle....what we going to do?\n\n<b>                         HALLE\n</b>                    (whispers)\n               Sixo, ya know he creeps out at night..he\n               says the way they took my ma'am..he says\n               freedom is that way. He and Paul A. got a\n               plan.  They heard of this man, what they\n               call an underground agent...if we do what\n               he says, don't need no buy out.\n\n<b>                         SETHE\n</b>               You mean...? But what if we caught?\n               What'd they do to us? To the children?\n\n<b>                         HALLE\n</b>               Same thing they're doing now, honey -\n               only quicker.\n\n<b>     EXT. SWEET HOME - A DAY REMEMBERED.\n</b>\n     Sethe carries a big basket of berries as young Howard and\n     Bulgar run ahead of her. She turns in the opposite direction\n     and walks along the side of the house to the back entrance of\n     the kitchen.\n\n     She passes the open window of the classroom and hears;\n\n<b>                         SCHOOLTEACHER\n</b><b>                         (OS)\n</b>               Which one are you doing?\n\n<b>                         BOY (OS)\n</b>               Sethe?\n\n     Hearing her name, Sethe stops and peeks through the window.\n\n     Schoolteacher is standing over the student, who has been\n     writing in a notebook. Schoolteacher licks his finger and\n     thumbs a couple of pages before saying;\n\n<b>                         SCHOOLTEACHER\n</b>               No, no. That's not the way. I told you to\n               put her human characteristics on the\n               left; her animal ones on the right. And\n               don't forget to line them up.\n\n     Although Sethe doesn't entirely understand, something about\n     the words disturb her. She looks to her children.\n\n<b>     INT. MRS. GARNER'S BEDROOM - A DAY REMEMBERED.\n</b>\n     Mrs. Garner is sick in bed with a goiter. Sethe enters with\n     some soup.\n\n<b>                         MRS. GARNER\n</b>               I don't think I can swallow that.\n               Too thick. I'm sure it's too thick.\n\n<b>                         SETHE\n</b>               Want me to loosen it up with a little\n               water?\n\n<b>                         MRS. GARNER\n</b>               No. Take it away. Bring me some cool\n               water, that's all.\n\n<b>                         SETHE\n</b>               Yes ma'am...\n\n     Sethe helps her drink a glass of cold water.\n\n<b>                         MRS. GARNER\n</b>               Yes, you can have quite a few.\n                    (drinks)\n               Mmmm. Thank you Sethe. Now tell me, I\n               know Halle's no trouble but the others,\n               the Pauls and Sixo - how's my brother-in-\n               law handling them? All right?\n\n<b>                         SETHE\n</b>               Yes Ma'am. Look like it.\n\n<b>                         MRS. GARNER\n</b>               They do what he tells them?\n\n<b>                         SETHE\n</b>               They don't need telling.\n\n<b>                         MRS. GARNER\n</b>               Good. That's a mercy. I know he's no Mr.\n               Garner. But after he died, I had no else\n               to turn to. I would've had to sell one.\n               It wasn't even enough selling Paul F. And\n               in my condition. I needed help. People\n               said I shouldn't be alone here with\n               nothing but Negroes. And he is a learned\n               man being a schoolteacher...\n\n     As Sethe fills Mrs. Garner's basin with fresh water, she\n     looks out the window and sees:\n\n     SCHOOLTEACHER outside with his students, we notice HE WEARS A\n     VERY DISTINCTIVE HAT as Mrs. Garners description continues;\n\n<b>                         MRS. GARNER\n</b>               ...I know his ways might be a little more\n               strict but as long as the men do as\n               they're told I'm sure it'll be fine. All\n               right, I'm through.. Talking makes me\n               tired.\n\n<b>                         SETHE\n</b>               Yes ma'am.\n\n<b>     INT. BARN - A NIGHT REMEMBERED.\n</b>\n     Sethe lies beaten and raped, her clothes torn, her body\n     aching and sweaty. She struggles to get to her feet and exit\n     the barn.\n\n<b>     INT. HALLE AND SETHE'S LIVING QUARTERS - NIGHT.\n</b>\n     Sethe opens the door to find her children asleep. She is\n     about to wake them when;\n\n     She notices Mrs. Garner's light is on in her bedroom window.\n\n     Sethe, blind with rage, decides there's one thing she must do\n     before she takes her children to the meeting place.\n\n<b>     INT. MRS. GARNER'S BEDROOM - NIGHT.\n</b>\n     Mrs. Garner lies ailing through a sleepless night when her\n     bedroom door opens. Sethe enters - her appearance tells all.\n\n<b>                         MRS. GARNER\n</b>               My God Sethe..what happened to you?\n\n<b>     EXT. SWEET HOME - NIGHT.\n</b>\n     Sethe carried her baby girl in one arm, her two boys by the\n     hand with the other...They move as fast as they can.\n\n<b>     EXT. CORN FIELD - NIGHT.\n</b>\n     They arrive at the meeting place where A WOMAN crouching in\n     the field is waiting.\n\n<b>                         WOMAN\n</b>               Hurry up. You're late.\n\n<b>                         SETHE\n</b>                    (hands her the children)\n               Here!\n\n<b>                         HOWARD\n</b>               But ma'am...\n\n<b>                         SETHE\n</b>               Just go with her! Do what I tell ya!\n\n     Sethe carefully hands her baby girl to the woman.\n\n<b>                         SETHE\n</b>               Put sugar water on that cloth for her to\n               suck so she won't forget me til I come.\n\n<b>                         WOMAN\n</b>               Where you going?\n\n<b>                         SETHE\n</b>               Halle wasn't there. I gotta go back.\n\n<b>                         WOMAN\n</b>               You crazy..\n\n<b>                         SETHE\n</b>               Take em out. Now! I'll get there myself.\n               I got her milk...I'll get there...Don't\n               worry.\n\n     She kisses her baby girl, a little too hard perhaps, waking\n     her...along with the boys...\n\n<b>                         SETHE\n</b>               Go..Go! Now!\n\n     Sethe disappears back into the corn field leaving the Woman\n     holding the baby girl... as Bulgar cries out.\n\n<b>                         BULGAR\n</b>               Mama?\n\n<b>     EXT. CORN FIELD CLOSER TO SWEET HOME HOUSE - NIGHT.\n</b>\n     Sethe exits the corn field and heads for her living quarters\n     when suddenly;\n\n     THE FOUR BOYS appears from out of nowhere..two restraining\n     her, one holding a horsewhip....\n\n<b>                         BOY WITH HORSEWHIP\n</b>               You nigger bastard..\n\n     Sethe struggles and is about to scream out when she is\n     slapped and muffled and dragged into the corn field to be\n     beaten.....\n\n<b>     END OF MEMORY;\n</b>\n<b>     INT. SETHE'S BEDROOM - NIGHT.\n</b>\n     Sethe awakens, sweating from having fallen asleep and\n     reliving her past nightmare. She sits up and realizes where\n     she is. She looks beside her and sees Paul asleep. She lays\n     down, pressing her body against his so that there is no space\n     between - enfolding her arms around him.\n\n<b>     EXT. PIG SLAUGHTERHOUSE - DAY.\n</b>\n     Pigs are crying in the chute as Paul, Stamp Paid and twenty\n     other workers push and prod them towards the slaughterhouse.\n\n     Although steeped in pig shit on a wintry day - his hands numb\n     from the cold - Paul D. is in high spirits. HE SINGS as he\n     works much to the amusement of his fellow co-workers.\n\n<b>                         CO-WORKER 1\n</b>               Hey - you like this work so much maybe\n               you best get in the chute with the\n               others. You ain't got much more sense\n               than they do.\n\n     The men laugh. Paul smiles and brushes it off.\n\n<b>                         PAUL\n</b>               Ain't just a job reason to sing. Other\n               things a man's got to look forward to\n               that a job just a way to spend your day\n               til the good times arrive.\n\n<b>                         CO-WORKER 2\n</b>               Good times? Ain't no such day.\n\n<b>                         STAMP PAID\n</b>               Now, now...it's all a state a mind, right\n               Paul D. If you can think it, it can\n               happen.\n\n<b>                         PAUL\n</b>               More than that. When a man can make plans\n               then a man can make good times happen.\n\n<b>                         CO-WORKER 1\n</b>               Oh the man's got plans! You saving up for\n               a gold mine, boy.\n                    (more laughter)\n\n<b>                         PAUL\n</b>               Better then gold, my friend. Me and my\n               woman's planning on starting a family.\n\n     Stamp Paid's face registers sudden concern.\n\n<b>                         PAUL\n</b>               New life. Born free, hear! Now if that\n               don't define a good tine, I don't know\n               what does.\n\n<b>                         CO-WORKER 2\n</b>               Nothing born free ever again.\n\n<b>                         PAUL\n</b>               What you talkin? Nobody owns us no more.\n               Nobody gonna own my children neither.\n\n<b>                         CO-WORKER 2\n</b>               Children inherit what come before'em.\n               Just cause you can't see no chains, don't\n               mean they not there. We're not free men.\n               We're somewhere between freedom and\n               chains. And as long as the world is\n               white, that's where we're stayin.\n\n     The truth of this causes the men to be silent as they\n     continue working. Stamp Paid looks at Paul, confused by what\n     he should do.\n\n<b>     EXT. PIG SLAUGHTERHOUSE - LATER THAT DAY.\n</b>\n     The men are on break. Paul sits alone enjoying a lunch packed\n     by Sethe...Stamp Paid approaches and sits beside him.\n\n<b>                         STAMP PAID\n</b>               May I?\n\n<b>                         PAUL\n</b>               Free country. No matter what anybody says.\n\n<b>                         STAMP PAID\n</b>               I like the way you think, boy. Good. Good\n               to think that way. Friend of mine, Baby\n               Suggs was her name...sort of became a\n               preacher in these parts..that was her way\n               of thinking too. When she was at her\n               best, that is.\n\n<b>                         PAUL\n</b>               You knew Baby Suggs?\n\n<b>                         STAMP PAID\n</b>               Oh yes...You're not one of her Sweet Home\n               men, now are you?\n\n<b>                         PAUL\n</b>               Yes sir...Me and my brothers and her son.\n\n<b>                         STAMP PAID\n</b>               Oh, I see now.\n\n<b>                         PAUL\n</b>               Sethe told me she died soft as cream.\n\n<b>                         STAMP PAID\n</b>               Well...maybe on the outside.\n\n<b>                         PAUL\n</b>               Why is that?\n\n     Stamp Paid looks at him with sympathetic, sudden\n     understanding.\n\n<b>                         STAMP PAID\n</b>               You don't know, son, do you? See I had to\n               figure that out first.\n\n<b>                         PAUL\n</b>               Know what?\n\n     Stamp Paid pulls out AN OLD NEWSPAPER CLIPPING from a bag he\n     carries with him all the time. He hands it to Paul who looks\n     to see:\n\n     A DRAWING OF A YOUNG BLACK WOMAN beneath a HEADLINE; MURDER!\n<b>     RUNAWAY SLAVE KILLS CHILD....\n</b>\n<b>                         PAUL\n</b>               Who is it?\n\n<b>                         STAMP PAID\n</b>               That there's a picture of Sethe.\n\n<b>                         PAUL\n</b>               Sethe?\n                    (studies it)\n               Nah, that ain't her mouth. I can see\n               where you might think it around the eyes\n               but that there ain't her mouth. Besides,\n               why would some black woman's picture be\n               in the paper?\n\n<b>                         STAMP PAID\n</b>               You don't read son, do you?\n                    (Paul shakes head NO)\n               You want me to read to you?\n\n     Paul senses something terribly wrong...and doesn't know\n     whether to say yes or no.\n\n<b>     EXT. 124 BLUESTONE RD. - EARLY EVENING.\n</b>\n     Sethe is sweeping the porch.\n\n     Paul appears on the road. When he sees Sethe on the porch in\n     the distance, he stops.\n\n     Sethe sees him and smiles - but something about his slow\n     approach to the house sends off an alarm within her.\n\n     Paul makes his way to the porch. He stops before her.\n\n<b>                         SETHE\n</b>               Already fed the girls. You eat?\n                    (he shakes NO)\n               Want something?\n\n     Paul doesn't answer. Instead, he steps up to her as he\n     removes the clipping from his pocket and hands it to her.\n\n     Sethe's heart stops beating for a moment - not having seen\n     this image for many years. But she's survived worse than the\n     telling so she faces him.\n\n<b>                         SETHE\n</b>               Best you come inside.\n\n     She rises and enters the house. Paul follows.\n\n<b>     INT. KITCHEN - EARLY EVENING.\n</b>\n     Paul sits at the table. Sethe begins her story seated before\n     him.\n\n<b>                         SETHE\n</b>               I don't have to tell you about Sweet\n               Home. What it was. But maybe you don't\n               know what it was like for me to get away\n               from there.\n\n     She looks for a response but expects none.\n\n<b>                         SETHE\n</b>               I did it. I got us all out. Without Halle\n               too. Up til then it was the only thing I\n               ever did on my own. Decided. And it came\n               off right like it was supposed to..\n\n     She rises and begins to move about the room, circling Paul\n     as she tries to find a way to explain it all;\n\n<b>                         SETHE\n</b>               We was here. Each and every one of my\n               babies and me too. I birthed them and I\n               got 'em out and it wasn't no accident. I\n               did that! I had help, of course, lots of\n               that, but still it was me doing it; me\n               saying, \"Go on\" and \"Now!\". Me having to\n               look out. Me using my own head. But it\n               was more than that. It was a kind of\n               ...'thinking-about-myself' I never knew\n               nothing about before. It felt good. Good\n               and right. I was big, Paul, and deep and\n               wide and when I stretched out my arms all\n               my children could get in between. I was\n               that wide. Look like I loved them more\n               after I got them here. Or maybe I\n               couldn't love'em proper in Sweet Home\n               'cause they wasn't mine to love. But when\n               I got here, when I jumped off that wagon -\n               there wasn't nobody in the world I\n               couldn't love if I wanted to....\n\n<b>                                                       DISSOLVE TO:\n</b>\n     MEMORY... as SETHE NARRATES:\n\n<b>                         SETHE (VO)\n</b>               I had 28 days...28 good days of free\n               life.....\n\n<b>     INT. SETHE'S ROOM AT 124 - A DAWN REMEMBERED.\n</b>\n     Sethe, out of habit, is awake before the sun has risen. She\n     is fully dressed.\n\n<b>                         SETHE (VO)\n</b>               ...of getting up like I always did,\n               getting dressed before the sun came out,\n               and then realizing I had to decide myself\n               what to do with the day...\n\n     She sits on the bed, watching the sun rise.\n\n<b>     INT. THE CHILDREN'S ROOM - CONTINUOUS.\n</b>\n     Sethe watches her children sleeping, safely.\n\n<b>                         SETHE (VO)\n</b>               ...Days of watching my children sleep\n               away the morning...And taking care of my\n               baby like it was the most important thing\n               I had to do...\n\n     Denver is asleep in a bassinet. Sethe reaches in and picks\n     her up. She sits by a window and breast feeds her as she hums\n     A MELODY. (This is the same melody we heard Sethe humming in\n     the beginning of the film).\n\n     Sethe's melody carries itself over the following images;\n\n<b>     EXT. 124 BLUESTONE ; WATER PUMP - DAY.\n</b>\n     Sethe is carrying a bucket of water to the house. She sees:\n\n     Bulgar and Howard running and playing. Howard tackles his\n     brother and starts tickling him. The two boys laugh hard.\n\n     Sethe watches, a moment of fear across her face;\n\n<b>                         SETHE (VO)\n</b>               I'd hear my boys laughing a laugh I ain't\n               never heard. And for a second I'd get\n               scared - scared someone might hear them\n               and get mad...\n\n     Sethe realizes, placing down the bucket:\n\n<b>                         SETHE (VO)\n</b>               Then I remembered...and if they laughed\n               that hard til it hurt, that would be the\n               only hurt they had all day....\n\n     Sethe sobs, uncontrollably.\n\n<b>     INT. 124 BLUESTONE RD. - DAY.\n</b>\n     Ella teaches Sethe a new stitch as she chatters on.\n\n<b>                         SETHE (VO)\n</b>               We had us days of company...\n\n<b>     EXT. FIELD - DAY.\n</b>\n     Another woman teaches Sethe the alphabet, as Sethe cradles\n     Denver and the Little Girl (Beloved) crawls around her feet.\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Baby Suggs and Sethe cook with a kitchen full of men and\n     women who have come for a visit.\n\n<b>                         SETHE (VO)\n</b>               ...of ease and real talk. Talks about the\n               Fugitive Bill, Dred Scott or book\n               learning...Talks as quiet or as stormy as\n               we wanted...\n\n     Two men get into an argument to the amusement of the women.\n\n<b>     EXT. CLEARING IN THE WOODS - DAY.\n</b>\n     As folks gather to hear Baby Suggs preach, she introduces a\n     smiling, shy Sethe to each one.\n\n<b>                         SETHE (VO)\n</b>               ...And when everyone would gather to hear\n               Baby Suggs, I saw something I ain't never\n               seen before in my whole life...\n\n     Alone for a moment, Sethe looks around at the crowd of faces;\n\n     Sethe's Melody stops as Baby Suggs stands on her rock and\n     calls to the crowd:\n\n<b>                         BABY SUGGS\n</b>               Let the children come!\n\n<b>     FROM OUT OF THE WOODS, CHILDREN RUN INTO THE CLEARING.\n</b>\n     Camera follows the joyous exodus to reveal:\n\n     THE CLEARING IS FILLED WITH ADULTS the entire black\n     community of the days when Sethe first arrived. The children\n     run to their respective families;\n\n<b>                         BABY SUGGS\n</b>                    (with joy)\n               Let your mother's hear you laugh!!\n\n     The children, loving the game, laugh hard. The adults get a\n     kick out of it.\n\n     Sethe watches her boys and hides her laughter.\n\n<b>                         BABY SUGGS\n</b>               Let the grown men come!!\n\n<b>     OUT OF THE WOODS, A GROUP OF GROWN MEN COME INTO THE CLEARING.\n</b>\n<b>                         BABY SUGGS\n</b><b>               LET YOUR WIVES AND YOUR CHILDREN SEE YOU\n</b><b>               DANCE!\n</b>\n     The men form a circle and dance as the crowd supports them\n     with a clapping rhythm. A SONG arises from the women to\n     accompany to dance....\n\n<b>                         BABY SUGGS\n</b>               Now...you women...I want you to cry. For\n               the living. For the dead....Just cry.\n\n     Camera follows those women who are not singing as one by one,\n     they remember and weep...\n\n     Sethe watches...and weeps.\n\n<b>                         SETHE\n</b>               ....Something in me knew Halle was never\n               gonna knock on our door. He was never\n               gonna see what I saw that day. I saw what\n               men look like...and I saw mothers, for\n               the first time.\n\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     Stamp Paid walks up to the porch carrying a TWO BIG BASKETS\n     OF BLACKBERRIES ... his body dirty, scratched and bleeding.\n\n<b>                         SETHE (VO)\n</b>               I think it was Stamp Paid who started it.\n               He walked six miles to the riverbank,\n               slid into a ravine, reached through blood\n               drawing thorns, suffered mosquitoes,\n               wasps and the meanest lady spiders in the\n               State just to bring us those berries.\n\n     He places the baskets on the porch in front of Baby Suggs,\n     Sethe who is holding Denver..and the Little Girl (Beloved).\n\n<b>                         BABY SUGGS\n</b>                    (laughs)\n               What a sight you are, Stamp.\n\n<b>                         STAMP PAID\n</b>               Worth it though. Just one bite of these\n               berries and you feel down right anointed.\n\n     He puts one into Denver's mouth.\n\n<b>                         SETHE\n</b>               She's too little for that, Stamp. Her\n               bowels be soup.\n\n<b>                         BABY SUGGS\n</b>               It'll sickify her stomach..Now go wash up\n               round back...crazy fool..\n\n     Stamp exits.\n\n<b>                         SETHE\n</b>               It was real nice of him.\n\n<b>                         BABY SUGGS\n</b>               He's a good one, no doubt of that. I can\n               get three, maybe four pies out of this.\n               Seems a shame just for us though. I'm\n               gonna invite Ella and John over...\n\n<b>                         SETHE\n</b>               How 'bout if I make a couple of chickens\n               to back it up?\n\n<b>                         SETHE (VO)\n</b>               And that's how it began...\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Sethe and Baby Suggs and Ella and several other women cook.\n\n<b>                         SETHE (VO)\n</b>               ...Three pies became twelve...two hens\n               became five turkeys...\n\n<b>     EXT.THE FIELD/124 BLUESTONE RD. - EVENING.\n</b>\n     Various images of people gathered enjoying food and\n     drink...laughing and singing...\n\n<b>                         SETHE (VO)\n</b>               ...and Ella and John turned into almost\n               ninety others...\n\n     - Women serving up the food...\n\n     - Older men sitting and talking as they eat...\n\n     - Younger men playing with the children. Chasing them with\n     sheets on their backs, scaring them into laughter..\n\n     - A Man with a guitar playing a blues song and singing.\n\n     While Sethe enjoys her free life and, most of all, her\n     children - the boys running around her..Denver in her\n     arms..Her Little Girl (Beloved) by her side.. Baby Sugg's\n     visits with various guests, serving up the food...\n\n<b>                         SETHE (VO)\n</b>               ... Everybody ate so well and laughed so\n               much...\n\n     INTERCUT; Images of whispers exchanged between some of the\n     women:\n\n<b>                         SETHE (VO)\n</b>               ...it made them angry...\n\n     Women head to head with a remark or an eye of disapproval\n     towards Baby Suggs as she continues cooking and feeding....\n\n<b>                         SETHE (VO)\n</b>               The pies, the turkeys...the bread pudding\n               and shortbread..the one whole block of\n               ice brought all the way from Cincinnati -\n               it made 'em mad...Loaves and fishes were\n               Jesus's powers...they did not belong to\n               an ex-slave who never had a white boy\n               beat her, who had her freedom bought, who\n               rented a house from white folks that\n               hated slavery worse than they hated\n               slaves...It made'em furious - her\n               thoughtless generosity and un-called for\n               pride...She had over stepped...offended\n               them by giving too much...and they left\n               their disapproval there so's you could\n               smell in the air the whole next day...\n\n<b>     EXT. THE FIELD/ 124 BLUESTONE RD. - THE FOLLOWING DAY.\n</b>\n     Baby Suggs works the field, not far from Stamp Paid...\n\n<b>                         SETHE (VO)\n</b>               Later on I wondered why no one warned\n               us...why no one saw them coming and ran\n               to 124 to tell us...\n\n     She chops at the soil over the roots of the pepper plants.\n     She stops - sensing something is wrong. She looks up at a\n     clear blue sky...She hears the birds and the stream way down\n     beyond the woods..\n\n     She looks around and sees Bulgar, Howard and the Little Girl\n     (Beloved) playing with loud voices by the side of the house.\n\n     She sees Sethe squatted in the pole beans with Denver in a\n     bushel basket beside her.\n\n     The clok, clok of wood being chopped causes her to look over\n     to Stamp Paid, helping out with the axe...\n\n     She returns to her work...but something is deeply wrong.\n\n     And then she hears it;\n\n     THE SOUND OF HORSES and A HORSE DRAWN WAGON coming from the\n     distance. (The same sound Sethe heard in her first memory of\n     the sycamores earlier on)\n\n     She rises up and looks;\n\n<b>     POV;\n</b>\n<b>     EXT. BLUESTONE ROAD - DAY.\n</b>\n     Far in the distance, FOUR HORSEMEN ARE RIDING TOWARD THEM.\n     ONE DRIVES A WAGON and IS WEARING A DISTINCTIVE HAT - IT IS \n<b>     SCHOOLTEACHER.....\n</b>\n<b>                                                       CUT BACK TO:\n</b>\n<b>     EXT. THE FIELD OF 124 BLUESTONE - DAY.\n</b>\n     Sethe continues working until she notices peripherally that\n     Baby Suggs is standing stock still, staring at something.\n\n     Sethe rises and looks in the same direction;\n\n<b>                                                       CUT BACK TO:\n</b>\n<b>     EXT. BLUESTONE ROAD - DAY.\n</b>\n     The Four Horsemen are closer...\n\n<b>                                                       CUT BACK TO:\n</b>\n<b>     EXT. THE FIELD OF 125 BLUESTONE - DAY.\n</b>\n     Sethe's face freezes in terror as ...\n\n     Stamp Paid, in between chops, looks up and sees the two\n     women..then turns his face to see the men.\n\n<b>     BUT IT IS SETHE'S FACE WE CONCENTRATE ON - AS WE INTERCUT THE\n</b>     ONCOMING APPROACH OF THE FOUR HORSEMEN and HEAR HER WORDS:\n\n<b>                         SETHE (VO)\n</b>               ...There's a Look whitefolks get..a Look\n               every Negro learns to recognize along\n               with his ma'am's tit..That righteous Look\n               that's like a flag going up the pole..the\n               righteousness that announces the whip,\n               the fist, the burning, the lie...long\n               before it happens in the open...\n\n     Over the above speech, we see in Sethe's expression a death\n     of soul - an instantaneous loss of hope for possibilities of\n     joy and life. And with it, an insane rage.\n\n     Sethe grabs Denver out of the basket, then scrambles after\n     the crawling Little Girl (Beloved), scooping her under her\n     free arm...\n\n<b>                         SETHE\n</b>               Howard!...Bulgar!\n\n     The tone of her voice cause the boys to freeze. She runs\n     towards them, grabbing one by the hand and ordering the other\n     to run in front of them. She moves and speaks with efficient\n     clarity.\n\n<b>                         SETHE\n</b>               The shed!...Get in the shed!...Run!\n\n     Baby Suggs and Stamp Paid watch helplessly -\n\n<b>     EXT. 124 BLUESTONE -\n</b>\n     The Four Horsemen - Schoolteacher, his Nephew, a Slave\n     Catcher and a Sheriff - arrive at the house and dismount,\n     tying their horses to the front gate (which is no longer\n     there).\n\n     The Nephew scampers to the front of the house and peers in\n     the window - he listens. Hearing nothing he motions for them\n     to go round the side of the house.\n\n     Camera follows them as it reveals Baby Suggs and Stamp Paid\n     standing exactly where we left them...Except;\n\n     They are both staring at the shed - out of which strange\n     noises, thuds and the FRIGHTENED CRIES OF CHILDREN are heard....\n\n     Two Black Boys and several Woman are coming up the road. The\n     Slave Catcher motions with his rifle for them to stop - and\n     they do.\n\n     The men move towards the shed, meeting up with the Nephew as\n     he runs past Baby Suggs and Stamp Paid...\n\n<b>     POV;\n</b>\n     Camera moves closer towards the shed, the sounds coning from\n     within more audible now...\n\n<b>     INT. THE SHED -\n</b>\n     The Nephew opens the door. The Four Men enter....\n\n     Howard and Bulgar are bleeding in the sawdust, unconscious -\n     a bloody shovel lays near them.\n\n     Sethe is holding a blood-soaked Little Girl (Beloved) to her\n     chest with one hand...and Denver by the heels of the other.\n     She is swinging Denver toward the wall planks, misses then\n     tries again...\n\n     When out of nowhere, Stamp Paid rushes by the horrified white\n     men and GRABS DENVER OUT OF SETHE'S HAND before she can swing\n     her a second time...\n\n     Stillness.\n\n     Schoolteacher looks at the carnage...a bloody saw lies at\n     Sethe's feet, the weapon she used on her own child's throat.\n     The Nephew is paralyzed...horrified.\n\n<b>                         NEPHEW\n</b>               What she go and do that for?...What she\n               go and do that for?\n\n     Baby Suggs walks in. Whatever amount of God's grace she could\n     imagine and will into being, vanishes with one look into that\n     shed.\n\n<b>                         SHERIFF\n</b>               You all better go on.\n                    (to Schoolteacher)\n               Nothing here to claim, I guess.\n               Look like your business is over. Mine's\n               started.\n\n     Schoolteacher beats his hat against his thigh and spits in\n     the shed before exiting, followed by the catcher and the\n     nephew.\n\n     The Sheriff speaks to Sethe.\n\n<b>                         SHERIFF\n</b>               I'll have to take you in. No trouble now.\n               You've done enough to last you....\n\n     Sethe doesn't move.\n\n<b>                         SHERIFF\n</b>               You come quiet, here, and I won't have to\n               tie you up.\n\n     Meanwhile, Baby Suggs notices who breathes and who does not\n     and moves straight to the boys....\n\n     Stamp Paid extends his arm to Sethe.\n\n<b>                         STAMP PAID\n</b>               Sethe. You take my arm and gimme yours.\n\n     Sethe turns to him, the first time she's looked into anyone's\n     eyes and sees Denver in his arms...A sound escapes from her\n     throat as though she'd made a mistake.\n\n<b>                         SHERIFF\n</b>               I'm going out here and send for a wagon.\n\n     He exits. Baby Suggs rubs the boys' hands, tries to raise\n     their eyelids, spits on her dress and wipes away the blood as\n     they slowly regain a dazed consciousness..She whispers;\n\n<b>                         BABY SUGGS\n</b>               I beg you pardon..I beg your pardon..\n\n<b>     EXT. 124 BLUESTONE RD. -\n</b>\n     Sethe, clutching the dead baby to her chest, is led out of\n     the shed by Stamp Paid,\n\n     Outside, a throng of black faces have gathered who stop\n     murmuring the second they see her. Among them are Ella and\n     Lady Jones. They are shocked and pained.\n\n     Sethe is led past them to a waiting cart - in total silence.\n\n     Baby Suggs, at the same time, is getting the boys up the\n     porch into the house. When Denver cries in Stamp Paid's arms,\n     she stops..lets the boys sit and runs towards the cart.\n\n     Sethe is seated in the cart beside the Sheriff. Baby Suggs\n     takes the crying Denver from Stamp Paid..She tells the\n     Sheriff.\n\n<b>                         BABY SUGGS\n</b>               Excuse me..but the child needs\n               nursin..needs the mother's milk..\n\n<b>                         SHERIFF\n</b>               Then she's best come too.\n\n     Baby Suggs approaches Sethe who sees Denver crying and\n     reaches for her without letting the baby go. Baby Suggs\n     resists;\n\n<b>                         BABY SUGGS\n</b>               One at a time!...And you gotta clean\n               yourself up!\n\n     But Sethe only wants her living child. The two women struggle\n     as Stamp Paid does what he can..Finally, Sethe wins and takes\n     Denver with her free hand, undoes her dress and nurse's her\n     with a bloody breast..\n\n     Baby Suggs breaks inside. Breaks right in two, although from\n     outwards appearances, she looks merely numbed by shock.\n\n     A WHITE BOY makes his way through the crowd with a pair of\n     shoes and hands them to her..\n\n<b>                         WHITE BOY\n</b>               Mama says Wednesday. She says you got to\n               have them fixed by Wednesday.\n\n     Baby Suggs looks at him not understanding..\n\n<b>                         WHITE BOY\n</b>               You hear, Baby? She says Wednesday.\n\n<b>                         BABY SUGGS\n</b>                    (taking the shoes)\n               I beg your pardon..Lord, I beg your\n               pardon..I sure do....\n\n<b>                                                            CUT TO:\n</b>\n<b>     PRESENT DAY (END OF MEMORY) :\n</b>\n<b>     INT. 124 BLUESTONE ROAD - NIGHT.\n</b>\n     Paul D. sits at the kitchen table. The story told. Sethe\n     looks out the window...and waits..\n\n<b>                         PAUL\n</b>               Your love is too thick, Sethe.\n\n<b>                         SETHE\n</b>               Love is or it isn't. Thin love ain't love\n               at all...I did stop him. I took and put\n               my babies where they'd be safe...\n\n<b>                         PAUL\n</b>               Didn't work though, did it?\n\n<b>                         SETHE\n</b>               It worked.\n\n<b>                         PAUL\n</b>               How? Your boys gone, you don't know\n               where. One girl dead, the other can't go\n               farther than the yard. How did it work?\n\n<b>                         SETHE\n</b>               They ain't at Sweet Home! Schoolteacher\n               ain't got'em!\n\n<b>                         PAUL\n</b>               Maybe there's worse.\n\n<b>                         SETHE\n</b>               It ain't my job to know what's worse.\n               It's my job to know what is and keep them\n               away from what I know is terrible. I did\n               that.\n\n<b>                         PAUL\n</b>               What you did was wrong, Sethe.\n\n<b>                         SETHE\n</b>               I should have gone back there? Taken my\n               babies back there?\n\n<b>                         PAUL\n</b>               There could have been a way. Some other\n               way.\n\n<b>                         SETHE\n</b>               What way?\n\n<b>                         PAUL\n</b>               You got two feet, Sethe. Not four!\n\n     That jumped out before he had a chance to choose saying it.\n     Sethe has no response...The distance between these two people\n     in this small room is suddenly vast.\n\n     Paul rises, playing with his hat...not knowing how to leave.\n     But desperately needing to. He moves to the exit and stops..\n\n<b>                         PAUL\n</b>               You can set aside supper for me... Might\n               be late getting back...\n\n     Unable to look at her, he turns to exit. When Sethe speaks in\n     a soft, forgiving tone, he stops to listen;\n\n<b>                         SETHE\n</b>               After all I told you, Paul D. and after\n               telling me how many feet I have, you\n               think saying goodbye is gonna break me\n               into pieces?\n\n     Paul turns to look at her and realizes she saw right through\n     him...\n\n<b>                         SETHE\n</b>               You're a sweet man.\n\n     Unable to bear it, Paul turns and leaves...\n\n     Sethe stands still, fighting tears, and whispers...\n\n<b>                         SETHE\n</b>               So long, Paul D.\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Sethe is scrubbing the floor, with Denver trailing by with\n     dry rags.\n\n     Beloved enters holding a pair of ice skates;\n\n<b>                         BELOVED\n</b>               What do these do?\n\n     Sethe and Beloved look up. Sethe smiles;\n\n<b>                         SETHE\n</b>               My Lord...where'd you dig up those?\n\n<b>                         DENVER\n</b>               There for skating on the ice.\n               We have another pair and half of another,\n               I think.\n\n<b>                         BELOVED\n</b>               Can we try them?\n\n     Sethe takes the skates and looks at them with a curious\n     lightness:\n\n<b>                         SETHE\n</b>               Go ice skating? Ha...\n                    (beat)\n               Why not?\n\n<b>                         DENVER\n</b>               You sure mama?\n\n<b>                         SETHE\n</b>               Strikes me that after your man leaves, it\n               might just be the wrong time to be\n               scrubbing floors... might just be the\n               perfect time to go ice skating.\n\n     Denver and Beloved register hopefulness in the light of\n     Sethe's attitude. Sethe speaks to Denver;\n\n<b>                         SETHE\n</b>               Go get the shawls..and find me an old\n               shoe for that half a pair...\n\n     The girls get excited. Sethe tosses the scrub brush into the\n     pail.\n\n<b>     EXT. A FROZEN CREEK - DAY.\n</b>\n     A bright, cold winter day. Beloved wears a pair of old\n     skates. Denver wears the second pair and Sethe has one skate\n     and one shoe..The two girls giggle and fall as they try to\n     skate on the ice... helping each other up. Their skirts \n     whirling...their laughter mingled with screams of delight.\n\n     Sethe, wearing only shoes, watches them and laughs.\n\n<b>                         DENVER\n</b>               Come on, ma'am...try!\n\n     Sethe steps onto the ice and takes a few strides and promptly\n     falls on her rear. The girls scream with laughter. Sethe\n     tries to get up and falls, their laughter infecting her as\n     well. The girls try to help her and fall over each other in\n     the trying.\n\n     Denver rises and tries an independent glide. The tip of her\n     skate hits a bump and she falls, flapping her arms wildly.\n     All three laugh so hard, they start coughing. Beloved goes to\n     Denver's aid.\n\n     Sethe rises up on her hands and knees, her laughter shaking\n     her chest and causing her eyes to tear in the cold air.\n\n     Beloved helps Denver, and falls as well. The two girls see\n     Sethe laughing and play it up even more, a few more times...\n\n     Until, Denver notices something and motions Beloved to stop\n     and look.\n\n     The two glide back to Sethe. Her laughter has stopped, but\n     her tears have not... They gently, comfortingly, touch her\n     shoulder.\n\n<b>     INT. KITCHEN - NIGHT.\n</b>\n     It is a snowy night outside the windows.\n\n     Sethe has laid out blankets and quilts in front of the fire\n     in the stove. She has made sweet milk that she hands to the\n     girls before taking her place in between them, on the floor,\n     facing the fire; Denver, on her right, rests her head on her\n     lap. Beloved sits on her left.\n\n     She looks over to Beloved who is staring at the fire. The\n     illumination highlights her beauty and her profile; the chin,\n     mouth, forehead - all copied and exaggerated in a huge shadow\n     the fire threw on the wall. Sethe can't help but stare as\n     another thought occurs to her;\n\n<b>                         BABY SUGGS (V.O.)\n</b>               ...All I remember is how she loved the\n               bottom of burned bread. Her little\n               hands...I wouldn't know 'em if they\n               slapped me\".\n\n<b>                         SETHE (VO)\n</b>               ...\"Here. Look here. See this mark? If\n               you can't tell me by my face, look here.\"\n\n     Beloved lifts her head towards the fire at the same time she\n     leans back to rest on a propped-up pillow. In the flickering\n     of the firelight, Sethe can see:\n\n<b>     A SMILE OF A SCAR BENEATH HER CHIN.\n</b>\n     Sethe knows before she's aware of it consciously. And just as\n     it hits her, BELOVED BEGINS TO HUM A MELODY.\n\n     Sethe recognizes it as her own melody.\n\n<b>                         SETHE\n</b>               I made that song up. I made it up and\n               sang it to my children...\n\n     Denver lifts her head from her mother's lap to look at Sethe,\n     knowing what is happening....\n\n<b>                         SETHE\n</b>               ...Nobody knows that song but me and my\n               children.\n\n     Beloved turns to Sethe;\n\n<b>                         BELOVED\n</b>               I know it.\n\n     A click. Sethe looks at her daughter, returned. \"There is no\n     gasp of astonishment - no exclaim for the miraculous. For\n     what is truly miraculous is so, because the magic lies in the\n     fact that you knew it was there for you all along.\"\n\n<b>                                                       DISSOLVE TO:\n</b>\n<b>     MORNING;\n</b>\n<b>     INT. KITCHEN - MORNING.\n</b>\n     It's snowy white outside. The girls are still asleep in front\n     of the stove. But Denver awakens upon hearing her mother load\n     the stove with dry wood and begin to cook breakfast. Sethe\n     hears her wake up and turns, as she beats eggs in a bowl;\n\n<b>                         SETHE\n</b>               Back stiff?\n\n<b>                         DENVER\n</b>               OOh, yeah...Don't know if it's the floor\n               or the skating.\n\n<b>                         SETHE\n</b>               Could be that fall you took.\n\n<b>                         DENVER\n</b>               That was fun.\n\n     Beloved snores lightly beside her;\n\n<b>                         DENVER\n</b>               Should I wake her?\n\n<b>                         SETHE\n</b>               No, let her rest.\n\n<b>                         DENVER\n</b>               She likes to see you off in the morning.\n\n<b>                         SETHE\n</b>               I'll make sure she does. But first I'm\n               going  make up a nice, big breakfast\n               against that cold outside.\n\n<b>                         DENVER\n</b>               Won't you be late for work?\n\n<b>                         SETHE\n</b>               Don't matter. First time I'll be late in\n               nine years. No great trouble..Whatever\n               goes on out there goes on with or without\n               me showing up on time... don't matter...\n                    (looks at the girls)\n               The world is in this room, baby. This is\n               all there is and all there needs to be.\n\n     Denver smiles - but it is a cautious smile. Something about\n     her mother's statement both elates and disturbs her.\n\n<b>     EXT. BLUESTONE RD. - DAY.\n</b>\n     A conflicted and contrite Stamp Paid walks through the snow\n     down Bluestone road towards 124.\n\n     As he does, he remembers his last conversation with Baby\n     Suggs;\n\n<b>     MEMORY:\n</b>\n<b>     EXT. RICHMOND STREET - DAY.\n</b>\n     A fall day. Leaves ankle high. Stamp Paid is walking when he\n     sees baby Suggs carrying a carpetbag full of repaired shoes.\n     He crosses over to her as he gets her attention;\n\n<b>                         STAMP PAID\n</b>               You missed the Clearing meeting three\n               Saturdays running.\n\n     Baby Suggs turns to her old friend - but there is no sign of\n     welcome or recognition. There is a noticeable change in her\n     demeanor. She continues walking. He follows;\n\n<b>                         STAMP PAID\n</b>               Folks came.\n\n<b>                         BABY SUGGS\n</b>               Folks come. Folks go.\n\n<b>                         STAMP PAID\n</b>               Here, let me carry that.\n\n     He reaches for the carpetbag but Baby Suggs pulls it away.\n\n<b>                         BABY SUGGS\n</b>               I got a delivery around here. Name of\n               Tucker.\n\n<b>                         STAMP PAID\n</b>                    (points)\n               Yonder. Twin chestnuts in the yard.\n\n     They walk a bit, until;\n\n<b>                         STAMP PAID\n</b>               Well?\n\n<b>                         BABY SUGGS\n</b>               Well what?\n\n<b>                         STAMP PAID\n</b>               This Saturday - you coming to Call or\n               what?\n\n<b>                         BABY SUGGS\n</b>               If I call them, and they come what on\n               earth am I going to say to them.\n\n<b>                         STAMP PAID\n</b>               Say the Word!\n\n     Two whitemen raking leaves look up at the sound of Stamp\n     Paid's voice, which was too loud. So he whispers;\n\n<b>                         STAMP PAID\n</b>               The Word. What you was put here to speak.\n\n<b>                         BABY SUGGS\n</b>               That's the last thing they took from me.\n\n<b>                         STAMP PAID\n</b>               But you got to do it. You got to. Can't\n               nobody Call like you. You have to be\n               there.\n\n<b>                         BABY SUGGS\n</b>               What I have to do is get in my bed and\n               lay down. I want to fix on something\n               harmless in this world.\n\n<b>                         STAMP PAID\n</b>               What world are you talking about? Ain't\n               nothing harmless down here.\n\n<b>                         BABY SUGGS\n</b>               Blue. That doesn't hurt nobody. Yellow\n               neither.\n\n<b>                         STAMP PAID\n</b>               You getting into bed to think about\n               yellow?\n\n<b>                         BABY SUGGS\n</b>               I likes yellow.\n\n<b>                         STAMP PAID\n</b>               Then what? When you get through with blue\n               and yellow, then what?\n\n<b>                         BABY SUGGS\n</b>               Can't say. It's something can't be\n               planned.\n\n<b>                         STAMP PAID\n</b>               You blaming God. That what you're doing?\n\n<b>                         BABY SUGGS\n</b>               No, Stamp. I ain't.\n\n<b>                         STAMP PAID\n</b>               You saying whitefolks won. That what you\n               saying?\n\n<b>                         BABY SUGGS\n</b>               Those white things have taken all I had\n               or dreamed. I'm saying ain't no bad luck\n               in this world 'cept for white folks..They\n               just don't know when to stop.\n\n<b>                         STAMP PAID\n</b>               You saying nothing counts?\n\n<b>                         BABY SUGGS\n</b>               I'm saying they came into my yard.\n\n<b>                         STAMP PAID\n</b>               You saying God give up? Nothing left for\n               us but pour out our own blood?\n\n<b>                         BABY SUGGS\n</b>               I'm saying they came into my yard.\n\n<b>                         STAMP PAID\n</b>               You punishing Him, ain't you?\n\n<b>                         BABY SUGGS\n</b>               Not like He punished me.\n\n<b>                         STAMP PAID\n</b>               You can't do that, Baby. It ain't right.\n\n<b>                         BABY SUGGS\n</b>               Was a time I knew what was.\n\n<b>                         STAMP PAID\n</b>               You still know.\n\n<b>                         BABY SUGGS\n</b>               What I know is what I see: a nigger woman\n               hauling shoes.\n\n<b>                         STAMP PAID\n</b>               Aw, Baby.\n\n     He stops her, before the Twin Chestnuts of the Tucker house.\n\n<b>                         STAMP PAID\n</b>               We have to be steady. \"These things too\n               will pass\". What you looking for? A\n               miracle?\n\n<b>                         BABY SUGGS\n</b>               No. I'm looking for what I was put here\n               to look for: the back door.\n\n     They exchange a look of silence and finality. She turns and\n     walks to the back door of the house and knocks. A moment\n     later a White Woman appears, takes the carpetbag and keeps\n     Baby waiting on the back steps while she goes in for a dime.\n     Baby rests on the railing until the whitewoman returns.\n\n<b>     MEMORY END.\n</b>\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     Now, Stamp Paid feels the need to find out what's going on\n     inside 124 since he caused Paul to leave. He approaches the\n     porch, then the front door. He raises his hands to knock -\n     but he can't bring himself to do it.\n\n     He turns to walk away then stops. He turns back and with a\n     force of will, KNOCKS LOUDLY upon the door. No answer. He\n     KNOCKS AGAIN. Still no answer.\n\n     He steps back, trying to sense if anyone's there. He turns to\n     leave when he sees;\n\n     TWO HEADS in the window. Denver and Beloved. Denver bolts\n     away, but Beloved remains a moment longer - looking in Stamp\n     Paid's eye, then disappearing into the house.\n\n     Stamp Paid is unnerved by her look.\n\n<b>     INT. SAWYER'S RESTAURANT - LATE MORNING.\n</b>\n     Sethe enters late, putting on her apron as SAWYER yells;\n\n<b>                         SAWYER\n</b>               What the hell you thinking, girl?\n               Strolling in here this late?\n\n<b>                         SETHE\n</b>               Don't talk to me, Mr. Sawyer. Don't say\n               nothing to me this morning.\n\n<b>                         SAWYER\n</b>               What? What? You talking back to me?\n\n<b>                         SETHE\n</b>               I'm telling you don't say nothing to me.\n\n     Sethe begins organizing her counter to make pies.\n\n<b>                         SAWYER\n</b>               You better get them pies made!\n\n     Sethe ignores him as she begins. Sawyer is at a loss.\n\n<b>                         SAWYER\n</b>               Not too sweet! You make it too sweet they\n               don't eat it.\n\n<b>                         SETHE\n</b>               Make it the way I always do.\n\n<b>                         SAWYER\n</b>               Yeah. Too sweet.\n                    (he exits)\n\n<b>     INT. ELLA'S HOUSE - DAY.\n</b>\n     Ella opens the front door for Stamp Paid. He looks disturbed.\n\n<b>                         ELLA\n</b>               Where you been keeping yourself? I told\n               John must be cold if Stamp stay inside.\n\n<b>                         STAMP PAID\n</b>               Oh I been out.\n\n     Stamp takes off his hat and follows Ella, who is doing\n     laundry in the kitchen.\n\n<b>                         ELLA\n</b>               Out where?\n\n<b>                         STAMP PAID\n</b>               Was over to Baby Suggs.\n\n<b>                         ELLA\n</b>               What you want there? Somebody invite you\n               in?\n\n<b>                         STAMP PAID\n</b>               That's Baby's kin. I don't need no invite\n               to look after her people.\n\n     Ella shrugs and continues folding wet laundry on a line\n     behind the stove. Stamp sits.\n\n<b>                         STAMP PAID\n</b>               Somebody new there. A woman. Thought you\n               might know who she is.\n\n<b>                         ELLA\n</b>               Ain't no new Negroes in this town I don't\n               know about. What she look like? You sure\n               that wasn't Denver?\n\n<b>                         STAMP PAID\n</b>               I know Denver.\n\n<b>                         ELLA\n</b>               You sure?\n\n<b>                         STAMP PAID\n</b>               I know what I see.\n\n<b>                         ELLA\n</b>               Might see anything at all at 124.\n\n<b>                         STAMP PAID\n</b>               True.\n\n<b>                         ELLA\n</b>               Better ask Paul D.\n\n<b>                         STAMP PAID\n</b>               Can't locate him.\n\n<b>                         ELLA\n</b>               He's sleeping in the church.\n\n<b>                         STAMP PAID\n</b>               The church!\n\n<b>                         ELLA\n</b>               Yeah. Asked Rev. Pike if he could stay in\n               the cellar.\n\n<b>                         STAMP PAID\n</b>               It's cold as charity in there! What he do\n               that for? Any number'll take him in.\n\n<b>                         ELLA\n</b>               Can't nobody read minds long distance.\n               All he have to do is ask somebody.\n\n<b>                         STAMP PAID\n</b>               Why? Why he have to ask? Can't nobody\n               offer? What's going on? Since when a\n               black man come to town have to sleep in\n               the cellar like a dog?!\n\n<b>                         ELLA\n</b>               Unrile yourself, Stamp. It's only a few\n               days he been there.\n\n<b>                         STAMP PAID\n</b>               NO! Shouldn't be no days! You know all\n               about it and don't give him a hand? That\n               don't sound like you, Ella. Me and you\n               been pulling colored folk out the water\n               more'n twenty years! Now you tell me you\n               can't offer a man a bed?! A working man\n               who can pay his own way?\n\n<b>                         ELLA\n</b>               He ask, I give him anything.\n\n<b>                         STAMP PAID\n</b>               Why's that necessary all of a sudden?\n\n<b>                         ELLA\n</b>               I don't know him that well.\n\n<b>                         STAMP PAID\n</b>               You know he's colored? What else there to\n               know?\n\n<b>                         ELLA\n</b>               Stamp, don't tear me up this morning! I\n               don't feel like it.\n\n<b>                         STAMP PAID\n</b>               It's her, ain't it?\n\n<b>                         ELLA\n</b>               Her who?\n\n<b>                         STAMP PAID\n</b>               Sethe. He took up with her and stayed in\n               there and you don't want nothing to-\n\n<b>                         ELLA\n</b>               Hold on! Don't jump if you can't see\n               bottom!\n\n<b>                         STAMP PAID\n</b>               Girl, give it up! We been friends too\n               long to act like this.\n\n     Beat. Ella knows he's right. She surrenders the truth.\n\n<b>                         ELLA\n</b>               Well, who can tell what went on in there?\n               I never even knew who Sethe was or none\n               of her people.\n\n<b>                         STAMP PAID\n</b>               You know she married Baby Suggs' boy.\n\n<b>                         ELLA\n</b>               I ain't sure I know that. Baby never laid\n               eyes on her till she showed up here. And\n               how'd she make it and her husband didn't?\n               And where is he? And how she have that\n               baby in the woods by herself? Said a\n               whitewoman help her. Shoot. You believe\n               that? Well, I know what kind of white\n               that was.\n\n<b>                         STAMP PAID\n</b>               Aw, no, Ella.\n\n<b>                         ELLA\n</b>               Anything white floating around in the\n               woods - if it don't got a shotgun, it's\n               something the Lord tells me I don't want\n               no part of.\n\n<b>                         STAMP PAID\n</b>               You was friends.\n\n<b>                         ELLA\n</b>               Till she showed herself.\n\n<b>                         STAMP PAID\n</b>               Ella.\n\n<b>                         ELLA\n</b>               I ain't got no friends take a handsaw to\n               their own children.\n\n<b>                         STAMP PAID\n</b>               What's any of that got to do with Paul\n<b>               D.?\n</b>\n<b>                         ELLA\n</b>               What run him off? Tell me that!\n\n<b>                         STAMP PAID\n</b>               I run him off.\n\n<b>                         ELLA\n</b>                    (surprised)\n               You?\n\n<b>                         STAMP PAID\n</b>               I told him...Showed him the newspaper.\n               About Sethe. Read it to him. He left that\n               very day.\n\n<b>                         ELLA\n</b>               You didn't tell me that. I thought he\n               already knew.\n\n<b>                         STAMP PAID\n</b>               He didn't know nothing. And nobody.\n               Except her, from when they was at that\n               place Baby Suggs was at.\n\n<b>                         ELLA\n</b>               He knew Baby Suggs?\n\n<b>                         STAMP PAID\n</b>               Sure he knew her. Her boy Halle, too.\n\n<b>                         ELLA\n</b>               And he left when he found out what Sethe\n               did?\n                    (Stamp sits)\n               What you say casts a different light on\n               it, I guess...I thought-\n\n     Stamp knows what she thought.\n\n<b>                         ELLA\n</b>               But you didn't come here talking 'bout\n               Paul. You came asking about a new girl.\n\n<b>                         STAMP PAID\n</b>               That's so.\n\n<b>                         ELLA\n</b>               Well, Paul D. must know who she is. Or\n               what she is.\n\n<b>                         STAMP PAID\n</b>               You mind loaded with spirits. Everywhere\n               you look you see one.\n\n<b>                         ELLA\n</b>               You know as well as I do, Stamp, that\n               people who die bad don't stay in the\n               ground.\n\n     Stamp can not deny this.\n\n<b>     EXT. BLUESTONE ROAD - EARLY EVENING.\n</b>\n     Sethe is walking home to her daughters. There is a serene,\n     introverted expression on her face...as if she were detached\n     from the world around her, safe inside. We hear her thoughts:\n\n<b>                         SETHE (VO)\n</b>               Beloved, she my daughter...She mine. She\n               come back to me of her own free will and\n               I don't have to explain a thing.. She had\n               to be safe and I put her where I knew she\n               would be. But my love was tough and she\n               back now. She come back to me in the\n               flesh...I won't never let her go. I'll\n               explain to her, even though I don't have\n               to. Why I did it. How if I hadn't killed\n               her she would have died and that is\n               something I couldn't let happen to her.\n               When I explain she'll understand, cause\n               she understands everything already..And\n               she ain't even mad...When I put that\n               headstone up I wanted to lay in there\n               with you, put your head on my shoulder\n               and keep you warm and I would have if\n               Bulgar and Howard and Denver didn't need\n               me, because my mind was homeless then. I\n               couldn't lay down with you then. No\n               matter how much I wanted to. I couldn't\n               lay down nowhere in peace, back then. Now\n               I can. I can sleep like the drowned, have\n               mercy. She come back to me, my daughter,\n\n<b>     DENVER'S VOICE OVER FADES IN OVER SETHE'S....\n</b>\n<b>                       SETHE (VO)              DENVER\n</b>               my Beloved and she        Beloved is my\n               is mine....               sister...\n\n<b>                         DENVER (VO)\n</b>               ..and she is mine...\n\n<b>                                                           FADE TO;\n</b>\n<b>     INT. 124 BLUESTONE ROAD - EARLY EVENING.\n</b>\n     Denver is cleaning the kitchen, waiting for her mother. We\n     hear her thoughts:\n\n<b>                         DENVER (VO)\n</b>               ..I swallowed her blood right along with\n               my mother's milk. She played with me and\n               always came to be with me whenever I\n               needed her. Me and her waited for our\n               daddy. I love her. I do. She never hurt\n               me. I love my mother but I know she\n               killed one of her own, and tender as she\n               is with me, I'm scared of her because of\n               it. All the time, I'm afraid the thing\n               that happened that made it all right to\n               kill her own, could happen again.\n               Whatever it is, it comes from outside\n               this house, outside the yard. So I never\n               leave this house and I watch over the\n               yard so it can't happen again ... I have\n               to keep it away from my sister...I'll\n               protect Beloved...'Cause She's mine...\n\n<b>     BELOVED'S VO FADES IN OVER DENVER'S...\n</b>\n<b>                 DENVER (VO)               BELOVED (VO)\n</b>               Beloved..She's mine       I am Beloved\n\n<b>                         BELOVED (VO)\n</b>               and she is mine...\n\n<b>     EXT. 124 BLUESTONE RD. - EARLY EVENING.\n</b>\n     Beloved, waiting for Sethe to come home, sees her\n     approaching. We hear her thoughts:\n\n<b>                         BELOVED (VO)\n</b>               I am not separate from her. There is no\n               place where I stop. Her face is my own\n               and I want to be there in the place where\n               her face is and to be looking at it\n               too...a hot thing..In the beginning I\n               could see her. I could not help her\n               because the clouds were in the way. But I\n               could see her. The shining in her ears. I\n               look hard at her so she will know that\n               the clouds are in the way..I cannot lose\n               her again. I see her face which is mine.\n               It is the face that was going to smile at\n               me in the place where we crouched before\n               I come up out of the blue water. Sethe's\n               is the face that left me. Sethe's sees me\n               in her and I see the smile. She is my\n               face smiling at me. It is the face I\n               lost. Now we can join..a hot thing.\n\n     Sethe comes to the waiting Beloved and smiles. She offers her\n     hand and Beloved rises. Denver exits to them and smiles. She\n     extends her hand to Beloved's free hand. The three women\n     stand astride each other, arms around each other's waist as\n     they walk toward the porch...\n\n     The dusk sunlight creates THREE SHADOWS - three figures\n     holding each other the way Sethe saw the shadows at the\n     carnival...Only they weren't Hers, Denver's and Paul's...They\n     were Hers, Denver's and Beloved's....\n\n<b>     INT. 124 BLUESTONE RD. - EARLY EVENING.\n</b>\n     The girls rush into the house, and down the hall.\n\n     Sethe enters. Then turns back to the door.\n\n<b>     C.U. ; OF SETHE'S HAND LOCKING THE FRONT DOOR AS WE HEAR;\n</b>\n<b>            SETHE (VO)\n</b>\n<b>     I AM BELOVED AND SHE IS MINE..     DENVER (VO)\n</b><b>                                      SHE IS MINE...\n</b>\n<b>     OVER THE FOLLOWING CHORUS OF DIALOGUE, A MONTAGE OF\n</b><b>     IMAGES DEPICTING SETHE, BELOVED AND DENVER CLOSING UP\n</b><b>     THE HOUSE FROM THE OUTSIDE WORLD - LOWERING SHADES,\n</b><b>     LOCKING WINDOWS, BARRING DOORS.....\n</b>\n<b>          SETHE (VO)\n</b>\n<b>     TELL ME THE TRUTH..              BELOVED (VO)\n</b><b>                                 CANNOT LOSE HER AGAIN.\n</b>\n<b>                         SETHE (VO)\n</b><b>               DID YOU COME FROM THE OTHER SIDE.\n</b>\n<b>                         BELOVED (VO)\n</b><b>               YES. I WAS ON THE OTHER SIDE.\n</b>\n<b>                         SETHE (VO)\n</b><b>               YOU CAME BACK BECAUSE OF ME?\n</b>\n<b>                         BELOVED (VO)\n</b><b>               YES.\n</b>\n<b>                         SETHE (VO)\n</b><b>               YOU NEVER FORGOT ME?\n</b>\n<b>                         BELOVED (VO)\n</b><b>               YOUR FACE IS MINE.\n</b>\n<b>                         DENVER (VO)\n</b><b>               DON'T LOVE HER TOO MUCH.\n</b>\n<b>                         SETHE (VO)\n</b><b>               DO YOU FORGIVE ME?\n</b>\n<b>                         BELOVED (VO)\n</b><b>               YOU HURT ME.\n</b>\n<b>                         DENVER (VO)\n</b><b>               I WILL PROTECT YOU.\n</b>\n<b>                         SETHE (VO)\n</b><b>               WILL YOU STAY?\n</b>\n<b>                         BELOVED (VO)\n</b><b>               WHY DID YOU LEAVE ME WHO AM YOU?\n</b>\n<b>                         SETHE (VO)\n</b><b>               I WILL NEVER LEAVE YOU AGAIN.\n</b>\n<b>                         DENVER (VO)\n</b><b>               WATCH OUT FOR HER; SHE CAN GIVE YOU\n</b><b>               DREAMS.\n</b>\n<b>                         BELOVED (VO)\n</b><b>               WHERE ARE THE MEN WITHOUT SKIN?\n</b>\n<b>                         DENVER (VO)\n</b><b>               THE WHITEFOLK?\n</b>\n<b>                         SETHE (VO)\n</b><b>               OUT THERE. WAY OFF.\n</b>\n<b>                         DENVER (VO)\n</b><b>               DADDY IS COMING FOR US.\n</b>\n<b>                         BELOVED (VO)\n</b><b>               CAN THEY GET IN HERE?\n</b>\n<b>                         SETHE (VO)\n</b><b>               NO. THEY TRIED ONCE BUT I STOPPED THEM.\n</b><b>               THEY WON'T EVER COME BACK...YOU MY BEST\n</b><b>               THING.\n</b>\n<b>     EXT. 124 BLUESTONE RD. - EARLY EVENING.\n</b>\n<b>     CAMERA PULLS BACK FROM THE FRONT DOOR, NOW LOCKED AGAINST THE\n</b><b>     WORLD, IN A SLOW MOVE....AS WE HEAR A BLEND OF THE THREE\n</b><b>     WOMEN'S VOICES - THE OVERLAPPING, HAUNTED THOUGHTS OF THE\n</b><b>     LIVING...\n</b>\n<b>                         THREE WOMAN (VO)\n</b><b>               BELOVED..YOU ARE MY SISTER..YOU ARE MY\n</b><b>               DAUGHTER. YOU ARE MY FACE..YOU ARE ME..I\n</b><b>               HAVE FOUND YOU AGAIN..I WAITED FOR\n</b><b>               YOU..YOU ARE MY BELOVED. DON'T LOVE HER\n</b><b>               TOO MUCH...YOU MY BEST THING.. YOU ARE\n</b><b>               MINE..YOU ARE MINE..YOU ARE MINE...\n</b>\n<b>     BY THE TIME THE CAMERA REACHES BLUESTONE ROAD, THE VOICES ARE\n</b><b>     MIXED, UNDECIPHERABLE YET AUDIBLE...\n</b>\n<b>     ...AUDIBLE TO STAMP PAID, WHO STANDS ON BLUESTONE RD.\n</b><b>     LISTENING TO THE HAUNTED VOICES OF 124.  HE IS FRIGHTENED.\n</b>\n<b>                                                         FADE -OUT.\n</b>\n<b>     FADE- IN:\n</b>\n<b>     EXT. CHURCH - DAY.\n</b>\n     A cold day. Paul D. sits against the church drinking from a\n     bottle when a voice causes him to look up;\n\n<b>                         STAMP PAID\n</b>               Howdy.\n\n     Stamp has his hands in his pockets, moving about.\n\n<b>                         PAUL\n</b>               You got any more newspaper in that pocket\n               for me, just a waste of time. Ain't\n               interested.\n\n     Stamp sits beside him.\n\n<b>                         STAMP PAID\n</b>               This is hard for me. But I got to do it.\n               Two things I got to say to you. I'm a\n               take the easy one first.\n\n<b>                         PAUL\n</b>                    (laughs)\n               If it's hard for you, might kill me dead.\n                    (he drinks)\n\n<b>                         STAMP PAID\n</b>               I come looking for you to ask your\n               pardon. Apologize.\n\n<b>                         PAUL\n</b>               For what?\n\n<b>                         STAMP PAID\n</b>               You pick any house, any house where\n               colored live. Pick any one and you\n               welcome to stay there. I'm apologizing\n               'cause they didn't offer to tell you. But\n               you welcome anywhere you want to be. My\n               house. John and Ella. Miss Lady\n               Jones..anybody. You choose. You ain't got\n               to sleep in no cellar and I apologize for\n               each and every night.\n\n<b>                         PAUL\n</b>               Well I...I did get offered one place but\n               I just wanted to be off by myself a\n               spell.\n\n<b>                         STAMP PAID\n</b>               Oh yeah. Oh that's load off. I thought\n               everybody gone crazy.\n\n<b>                         PAUL\n</b>               Just me.\n\n<b>                         STAMP PAID\n</b>               You planning to do anything about it?\n\n<b>                         PAUL\n</b>               Oh yeah. I got big plans.\n\n     He drinks from the bottle like an angry, broken man. It stabs\n     at Stamp's heart to see him like this.\n\n     A WHITE MAN in a horse and wagon drives up the path leading\n     to the church. He leans stops before them and leans forward;\n\n<b>                         WHITE MAN\n</b>               Hey!!\n\n<b>                         STAMP PAID\n</b>                    (on his feet)\n               Yes sir.\n\n<b>                         WHITE MAN\n</b>               I'm looking for a gal name of Judy. Works\n               over by the slaughterhouse. Said she\n               lived on Plank Road.\n\n<b>                         STAMP PAID\n</b>               Plank Road. Yes sir. That's up a ways.\n               Mile, maybe.\n\n<b>                         WHITE MAN\n</b>               You don't know her? Judy? Works in the\n               slaughterhouse.\n\n<b>                         STAMP PAID\n</b>               No sir, I don't, but I know Plank Road.\n               'Bout a mile up thataway.\n\n     Paul drinks from the bottle. The White Man addresses him.\n\n<b>                         WHITE MAN\n</b>               Look here..There's a cross up there, so I\n               guess this here's a church or used to be.\n               Seems to me like you ought to show it\n               some respect, you follow me?\n\n<b>                         STAMP PAID\n</b>               Yes sir..You right about that. That's\n               just what I come over to talk to him\n               about. Just that..\n\n     Paul offers no response. The White Man clicks his tongue and\n     drives off. Stamp breathes a sigh of relief.\n\n<b>                         PAUL\n</b>               You remember your price, Stamp?\n\n<b>                         STAMP PAID\n</b>               Never found out.\n\n<b>                         PAUL\n</b>               I did. Down to the cent.$900. Always\n               wondered though what Mrs. Garner got for\n               my brother Paul F. Must of been more than\n               nine hundred dollars cause she use that\n               money for Sweet Home for almost two\n               years. But then they hung my other\n               brother Paul A. up on a tree so I guess\n               he wasn't worth the same..I wonder what\n               was Baby Suggs worth? And Halle? I wasn't\n               surprised when I found out they tracked\n               down Sethe all the way to Cincinatti. Her\n               price must have been higher than all of\n               us - her being property that reproduced\n               itself without cost. A breeder.\n\n<b>                         STAMP PAID\n</b>               No use thinking these things now.\n\n<b>                         PAUL\n</b>               Oh but we got to. How we gonna know our\n               price in the future? How are children's\n               children's children gonna know what they\n               cost? Who's gonna tell them? What are\n               they gonna pay for us, if we free?\n\n<b>                         STAMP PAID\n</b>               Children ain't gonna need to know that\n               kind of thing.\n\n<b>                         PAUL\n</b>               They'll know. They'll know as soon as\n               they born. Cause it's inside us,Stamp.\n               It'll be inside them. We'll pass it down.\n               Schoolteacher didn't just change the\n               outside, he changed the mind..and the\n               blood..and what it carries...and what\n               it's worth..\n\n<b>                         STAMP PAID\n</b>               I don't believe that. I won't.\n\n<b>                         PAUL\n</b>               There was a rooster named Mister down at\n               Sweet Home. Last time I saw Halle, with\n               that butter all over his face and me with\n               an iron bit in my mouth, I saw Mister -\n               sitting on a tub. He loved that tub. Like\n               king on a throne. He was a hateful thing.\n               Bloody and evil..But he was better than\n               me.  Mister was allowed to be and stay\n               what he was. Even if you cooked him you'd\n               be cooking a rooster named Mister. But\n               wasn't no way I'd ever be Paul D.\n               again..Schoolteacher changed me. Was\n               never no beating under Mr. Garner.\n               Schoolteacher changed that. Why wouldn't\n               a man run from that? Why wouldn't a man\n               not work, kill, starve, pull out his own\n               heart to stop feeling 'stead of feeling\n               that? And it strikes me, it's got to be\n               cause we were something else. And that\n               something was less than a chicken sitting\n               in the sun on a tub.\n\n     He drinks.\n\n<b>                         STAMP PAID\n</b>               I said I had two things to say to you. I\n               only told you one. I have to tell you the\n               other.\n\n<b>                         PAUL\n</b>               I don't want to know.\n\n<b>                         STAMP PAID\n</b>               I was there Paul D...There in the yard.\n               When she did it.\n\n<b>                         PAUL\n</b>               What yard? When who-\n\n     And then Paul realizes he's talking of Sethe.\n\n<b>                         PAUL\n</b>               Jesus.\n\n<b>                         STAMP PAID\n</b>               It ain't what you think.\n\n<b>                         PAUL\n</b>               You don't know what I think.\n\n<b>                         STAMP PAID\n</b>               She ain't crazy. She love those children.\n               She was trying to outhurt the hurter's\n               all.\n\n<b>                         PAUL\n</b>               Leave off..\n\n<b>                         STAMP PAID\n</b>               She was only-\n\n<b>                         PAUL\n</b>               Stamp, leave off I said! I knew her when\n               she was a girl. She scares me and I knew\n               her when she was a girl...\n\n<b>                         STAMP PAID\n</b>               You ain't scared of Sethe. I don't\n               believe you.\n\n<b>                         PAUL\n</b>               She scares me. I scare me. And that girl\n               in her house scares me.\n\n<b>                         STAMP PAID\n</b>               Who is she? Where she come from?\n\n<b>                         PAUL\n</b>               Don't know. Just shot up one day from a\n               stump.\n\n<b>                         STAMP PAID\n</b>               She what run you off? Not what I told you\n               'bout Sethe?\n\n     Paul thinks a moment. Then, tears brimming in his eyes:\n\n<b>                         PAUL\n</b>               Tell me something, Stamp. Tell me this\n               one thing. How much is a nigger supposed\n               to take?\n\n<b>                         STAMP PAID\n</b>               All he can. All he can.\n\n<b>                         PAUL\n</b>               Why? Why? Why? Why? Why?\n\n<b>                                                          FADE OUT;\n</b>\n<b>     FADE IN;\n</b>\n<b>     SPRING.\n</b>\n<b>     EXT. 124 BLUESTONE RD. - MORNING.\n</b>\n     The sun shines on a warm April day..a day abundant with\n     growth and renewed hope.\n\n     But a shadow appears to be hovering over 124. It looks more\n     worn than before...neglected, abused.\n\n     A broken window...the front door off it's hinge...a front\n     step splintered and dangerous.\n\n<b>     INT. 124 BLUESTONE RD. - MORNING.\n</b>\n     Camera opens on the front hall and moves through the house,\n     revealing the same neglect inside;\n\n     Broken furniture, dusty floors, mess and disorder...\n\n     Camera enters;\n\n<b>     INT. KITCHEN - MORNING.\n</b>\n     Dirty pans, crusted food on the table, window curtains\n     hanging askew...\n\n     Sethe sits hunched over, asleep, in a chair against the wall.\n     She wears a dirty, torn dress that hangs on her body - which\n     seems withered, frailer since we last saw her...In her lap\n     lies a clean pretty dress she was in the process of sewing\n     when she fell asleep from fatigue.\n\n     A LOUD CRASH wakes her up. Followed by a LOUD FRUSTRATED\n     YELL. Her face registers fear. She realizes where she is,\n     what time it is...and begins organizing breakfast...\n\n     She places the dress neatly on the chair, then grabs a cloth\n     and wipes away the crumbs and dirty plates from supper,\n     placing them in the sink...\n\n     She opens a pantry cupboard to reveal BARE SHELVES except for\n     a SINGLE EGG and a bowl of HOMINY GRAINS about 1/4 full. She\n     searches in a panic for more food - anywhere - opening \n     cabinets, doors - places that never stored food. She realizes\n     there is none left.\n\n<b>     INT. DENVER'S ROOM - MORNING.\n</b>\n     Denver finished dressing. She has been able to maintain a\n     semblance of order about her person and room..\n\n     But as she steps out into the second floor hallway, we see\n     the same disarray as downstairs...\n\n     She passes by Baby Sugg's old room and discovers;\n\n     BELOVED, sprawled across the bed, half naked. Her belly is\n     huge, her body unwashed. She looks, and behaves, like a wild\n     animal...\n\n     A broken lamp lies on the fall - pushed over by her leg as\n     she shifted in bed. Her feet, overhanging the bed, are still\n     touching the bedside table where the lamp sat.\n\n     She is awake now - making a small hole larger in Baby Sugg's\n     old quilt.\n\n<b>                         DENVER\n</b>               You shouldn't be in here?\n\n     Beloved jolts her head up to Denver. She doesn't like being\n     looked at unawares...\n\n<b>                         BELOVED\n</b>               What do you know about it? I sleep where\n               I want.\n\n<b>                         DENVER\n</b>               You best leave that quilt alone. That was\n               grandma's quilt.\n\n     Beloved looks at Denver, then at the quilt - then abruptly\n     tears the hole apart with one strong pull.\n\n     Triumphant, she gets out of bed and exits, passing Denver;\n\n<b>                         BELOVED\n</b>               Breakfast ready? I'm hungry!\n\n<b>     INT. KITCHEN - MORNING.\n</b>\n     Sethe has prepared all the food that was left and placed it\n     on one plate which she sets on the table. She stands at the\n     stove, with her back to us, picking crusted pieces of food\n     off the bottom of the pan.\n\n     Beloved moves straight to the chair in front of the place and\n     begins to eat, shovelling the food into her mouth.\n\n     Denver sees her mother covertly eating the burnt pan crumbs,\n     as she pretends to wash the dishes.\n\n<b>                         SETHE\n</b>               Morning.\n\n<b>                         DENVER\n</b>               Morning, ma'am.\n\n     Sethe turns, not realizing Denver was there as well. Their\n     eyes meet. Sethe wonders if her daughter saw her eating the\n     pan crumbs. She smiles;\n\n<b>                         SETHE\n</b>               You hungry?\n\n     Knowing there must be nothing left, Denver answers;\n\n<b>                         DENVER\n</b>               No, ma'am.\n\n     Sethe looks relieved.\n\n<b>                         DENVER\n</b>               I'll finish those. Why don't you sit\n               down?\n\n     Denver crosses to the dishes, taking the pan from her mother.\n     Sethe nods and crosses to the table, to sit down.\n\n     But as she sinks into the chair, Beloved kicks it away;\n\n<b>                         BELOVED\n</b>               You don't sit with me!!\n\n<b>                         SETHE\n</b>               Baby, don't be like that.\n\n<b>                         BELOVED\n</b>               You don't sit with me!! I don't sit with\n               people who leave me!\n\n<b>                         SETHE\n</b>               Don't talk like that. Your mama loves\n               you.\n\n<b>                         BELOVED\n</b>               I had another dream last night.\n                    (as she eats)\n               The dead man laying on top of me and I\n               had nothing to eat. And the ghosts\n               without skin stuck their fingers in me\n               and said Beloved in the dark and bitch in\n               the light..\n\n<b>                         SETHE\n</b>               Don't say those things. You forget about\n               those dreams..\n\n<b>                         BELOVED\n</b>               You gave me the bad dreams. You left me\n               behind...\n\n<b>                         SETHE\n</b>               Mama told you - I'd give up my own life,\n               every minute, every hour of it to take\n               back one of your tears baby...My children\n               my best thing. You my best thing!\n\n<b>                         BELOVED\n</b>               You're weren't nice to me..you didn't\n               smile at me..\n\n<b>                         SETHE\n</b>               That's not true. I told you, I had to get\n               you out, make you safe...so's you and me\n               could be together on the other side,\n               forever..\n\n<b>                         DENVER\n</b>               Ma'am...\n\n     No one pays attention to Denver.\n\n<b>                         BELOVED\n</b><b>               LIAR!\n</b>\n     Beloved flings her plate at Sethe, hitting her hard across\n     the eye..the plate breaking...\n\n<b>                         DENVER\n</b><b>               MAMA!\n</b>\n<b>                         SETHE\n</b>               Hold back Denver - I'm fine..You..you go\n               on upstairs. I'll do the cleaning up.\n\n<b>                         DENVER\n</b>               But mama..\n\n<b>                         SETHE\n</b>               Go upstairs I said!!\n\n     Sethe's harsh tone is only for Denver. Denver exits the\n     kitchen, afraid to leave them alone...\n\n     As she moves from the kitchen, she hears;\n\n<b>                         BELOVED (OS)\n</b>               I want somethin' sweet.\n\n<b>                         SETHE (OS)\n</b>               We don't have nothing sweet no more,\n               baby.\n\n<b>                         BELOVED (OS)\n</b>               Not for me, you don't! You don't let me\n               eat the pies...\n\n<b>                         SETHE (OS)\n</b>               No. Since mama lost her job, we don't\n               have no more pies..\n\n     Denver walks up the white stairs...\n\n<b>     INT. BABY SUGGS' ROOM - DAY.\n</b>\n     Denver has straightened up her grandmother's room. Cleaned\n     away the broken pieces of the lamp. Gathered the remnants of\n     the quilt..\n\n     She holds the quilt as she sits on the bed, facing the\n     headboard. SHE REMEMBERS:\n\n<b>     MEMORY:\n</b>\n<b>     INT. BABY SUGGS' ROOM - A DAY REMEMBERED.\n</b>\n     Baby Suggs, near death, lying in her bed, chuckles and\n     coughs;\n\n<b>                         BABY SUGGS\n</b>               You mean I never told you about your\n               daddy? About the Bodwins who let me rent\n               this here house while I do my shoe\n               repairing? About your mother's feet, not\n               to mention her back? I never told you all\n               that?\n\n     A NINE YEAR OLD DENVER shakes her head.\n\n<b>                         BABY SUGGS\n</b>               Is that why you can't walk down the steps\n               and out yonder by yourself?\n\n     Denver can't answer.\n\n<b>                         BABY SUGGS\n</b>               Why you never go back to Lady Jone's and\n               learn your letters? You liked going there\n               I remember. Seeing the other children.\n               Then all a sudden, you stop.\n\n<b>                         DENVER\n</b>               There was a boy there...said mama was a\n               jailbird...said he could prove it..\n\n     Baby Suggs face registers the pain of her granddaughter, hurt\n     by hurtful words.\n\n<b>                         BABY SUGGS\n</b>               My Jesus my...What people won't say. Why\n               didn't you come and ask me?\n                    (Denver shrugs)\n               'Fraid I'll tell ya, huh?\n                    (Denver looks at her)\n               Come here, child..\n\n     Denver crawls into her arms.\n\n<b>                         BABY SUGGS\n</b>               You got to go sometime. You got to go out\n               there by yourself sometime.\n\n<b>                         DENVER\n</b>               But you said...you said out there, there\n               ain't no...what was that word?..no..de-\n               fense. No de-fense.\n\n<b>                         BABY SUGGS\n</b>               There ain't.\n\n<b>                         DENVER\n</b>               Then what do I do?\n\n<b>                         BABY SUGGS\n</b>               Know it, and go on out the yard. Go on.\n\n<b>     END OF MEMORY.\n</b>\n<b>     INT. BABY SUGGS' ROOM - DAY.\n</b>\n     Denver has crawled up and snuggled against the pillow in the\n     same position as when she was nine in her grandma's arms.\n\n<b>     INT. SECOND FLOOR LANDING - DAY.\n</b>\n     Denver has changed into a clean, pretty dress and is\n     approaching the stairs when she passes Sethe's room. It's\n     door is open. She looks in..\n\n     Sethe stands with her back to the door, cleaned up, wearing\n     her best dress and the hat she last wore to the carnival.\n\n     Denver smiles, hopefully;\n\n<b>                         DENVER\n</b>               Mama?\n\n     Sethe turns, startled, to reveal - it is BELOVED in Sethe's\n     best clothes...When Beloved sees Denver, she smiles\n     tauntingly and strikes a pose...\n\n<b>                         BELOVED\n</b>               I look just like her.\n\n     Disgusted, Denver exits.\n\n<b>     INT. KITCHEN - DAY.\n</b>\n     Denver walks down the stairs, entering the kitchen;\n\n     Sethe is on her knees, picking up pieces of broken plate. As\n     she moves the skin on her knees bleeds as it scrapes against\n     pieces too small to clean.\n\n<b>                         DENVER\n</b>               Mama let me help you.\n\n<b>                         SETHE\n</b>               NO!...She wanted me to do it.\n\n     Sethe continues her work, without even looking at Denver.\n\n     Denver pauses a moment, realizing she is of no use here - but\n     knowing she needs to help her mother somehow.\n\n     She looks up to the kitchen, where every cupboard door is\n     open revealing empty shelves...SHE EXITS - HEADING FOR THE\n<b>     FRONT DOOR.\n</b>\n<b>     INT. FRONT HALL - DAY.\n</b>\n<b>     C.U. - FRONT DOOR.\n</b>\n     Denver's hands slowly reaches towards the door lock - and\n<b>     OPENS IT.\n</b>\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     Denver opens the door, then pushes the broken screen door off\n     it's hinge. She closes the door behind her.\n\n     She begins her walk from the porch to the road. The first\n     time she's ever gone alone..not knowing what she will face\n     beyond the perimeters of her home.\n\n     She reaches Bluestone Road and stops. She looks in either\n     direction and sees not a soul. She takes a breath.\n\n     She begins to walk - to get help.\n\n     A block from the house, TWO BLACK MEN turn a corner and walk\n     towards her.\n\n     Denver stops, frightened, not knowing what to do.\n\n     The TWO BLACK MEN pass her, tipping their hats, saying;\n\n<b>                         TWO BLACK MAN\n</b>               Morning...Morning..\n\n     And they walk by. Denver's eyes speak the gratitude she never\n     got her mouth open in time to reply. Heartened by the\n     encounter, she picks up speed.\n\n<b>     EXT. LADY JONES' HOUSE - DAY.\n</b>\n     LADY JONES - a light-skinned black woman with gray eyes and\n     yellow woolly hair - opens the door to find Denver.\n\n<b>                         LADY JONES\n</b>               Why Denver..Look at you.\n\n     Denver manages to smile.\n\n<b>                         LADY JONES\n</b>               It's been so long. It's so nice of you to\n               come see me. What brings you?\n\n     Unfortunately, Denver can't manage anything beyond the smile.\n\n<b>                         LADY JONES\n</b>               Well, never mind - nobody needs a reason\n               to visit. Let me make us some tea. Come\n               on.\n\n     Lady Jones takes her by the hand and leads her inside.\n\n<b>     INT. LADY JONES' HOUSE - DAY.\n</b>\n     Tea things sit on a table between them. Denver eats whatever\n     she can. Lady Jones watches with care and concern.\n\n<b>                         LADY JONES\n</b>               How's your family, honey?\n\n     Denver swallows a bite of something with some tea, then;\n\n<b>                         DENVER\n</b>               I want to work, Miss Lady.\n\n<b>                         LADY JONES\n</b>               Work? Start learnin your letters again?\n\n<b>                         DENVER\n</b>               No. I mean work work.\n\n<b>                         LADY JONES\n</b>               Well, what can you do?\n\n<b>                         DENVER\n</b>               I can't do anything but I would learn it\n               for you if you have a little extra.\n\n<b>                         LADY JONES\n</b>               Extra?\n\n<b>                         DENVER\n</b>               Food. My mama, she doesn't feel well. I\n               couldn't stay away from her too long,\n               cause of her condition but I could do\n               chores in the mornings.\n\n<b>                         LADY JONES\n</b>               Oh baby...I don't know anyone could pay\n               anybody anything for work they did\n               themselves...But if you all need to eat\n               until your mother's well, all you have to\n               do is say so...We have a church committee\n               invented so nobody had to go hungry.\n\n<b>                         DENVER\n</b>               No..No that won't do...\n\n     Lady Jones can sense something far more serious is going on.\n\n<b>     INT. 124 BLUESTONE RD./ KITCHEN - DAY.\n</b>\n     Denver brings four eggs, some rice and some tea onto the\n     kitchen table.\n\n     Sethe's eyes well up. She looks at Denver as if for the first\n     time. Her face an expression of gratitude. Suddenly;\n\n<b>                         BELOVED (OS)\n</b><b>               RAAAIN!!! RAAAAIN!\n</b>\n     Sethe and Denver rush out of the kitchen to see;\n\n     beloved running through the rooms, clawing at her throat,\n     causing it to bleed...\n\n<b>                         SETHE\n</b><b>               BABY!\n</b>\n     Sethe and Denver rush towards into the keeping room. Sethe\n     stumbles over a chair to get to Beloved, kneeling on the\n     floor, ripping at her own neck...\n\n     Denver gets her from behind and Sethe grabs her from the\n     front, pinning her down - trying to stop her from hurting\n     herself. Beloved screams and strikes out at Sethe, pulling\n     her hair, clawing at her as well...\n\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     Denver exits the house because she sees something unusual in\n     the yard;\n\n<b>     POV - THE STUMP;\n</b>\n     On the same stump that Beloved first appeared, sits A BASKET\n     OF EGGS. Denver crosses to it, lifts it and a PAPER flutters\n     to the ground. She reads it;\n\n<b>     M. LUCILLE WILLIAMS...\n</b>\n<b>     EXT. M. LUCILLE WILLIAMS HOUSE - DAY.\n</b>\n     Denver returns the empty basket to M. Lucille Williams.\n\n<b>                         DENVER\n</b>               Thank you.\n\n<b>                         M. LUCILLE\n</b><b>                         WILLIAMS\n</b>               Your welcome..\n\n<b>     INT. 124 BLUESTONE RD. - DAY.\n</b>\n     Beloved eats ravenously from a bowl of white beans. Sethe\n     sits in the corner, as if waiting to serve her...\n\n<b>     EXT. 124 BLUESTONE RD. - DAY\n</b>\n     Upon the stump, sits a plate of cold rabbit meat, which\n     Denver brings inside.\n\n<b>     INT. GRACE'S HOUSE - DAY.\n</b>\n     Denver is returning a bowl to Grace, a friendly woman.\n\n<b>                         GRACE\n</b>               No, darling. That's not my bowl. Mine's\n               got a blue ring around it..Would you like\n               to come in a spell?\n\n<b>     INT. 124 BLUESTONE RD. - DAY.\n</b>\n     Beloved sleeps curled up on the kitchen floor after eating -\n     her mouth still dirty from the meal...\n\n     Sethe, unwashed, her hair uncombed, sits in her corner chair.\n     She is trying to mend a torn dress.\n\n     Denver eats a little from the latest neighborhood gift. She\n     hears her mother mumbling to herself like a madwoman.\n\n<b>                         SETHE\n</b>               Nobody..no sir..that's right..nobody's\n               going be doing that..nobody going be\n               writing my daughter's characteristics on\n               the animal side..no sir..I don't\n               care..ain't laying that down..no sir. I\n               refuse..that's right..that's right...\n\n<b>                         DENVER\n</b>               Mama...Mama she's asleep. Why don't you\n               eat something.\n\n<b>                         SETHE\n</b>               She likes this dress...\n\n<b>                         DENVER\n</b>               But you'll hurt your eyes doin it there.\n               Come sit at the table.\n\n     Sethe considers this. She rises cautiously, then sits at the\n     table. Denver rises and gets her some food, placing it before\n     her.\n\n<b>                         DENVER\n</b>               Please mama, eat something...\n\n     Sethe nods...Denver is getting more and more frightened of\n     losing her mother completely...Instead of protecting Beloved\n     from Sethe, she must protect her mother from Beloved.\n\n<b>     EXT. THE BODWIN'S HOUSE; BACK DOOR - DAY.\n</b>\n     A white family home in a white Ohio neighborhood.\n\n     JANEY WAGON, a benevolent black servant woman, opens the back\n     door for Denver.\n\n<b>                         JANEY\n</b>               Yes?\n\n<b>                         DENVER\n</b>               May I come in?\n\n<b>                         JANEY\n</b>               What you want?\n\n<b>                         DENVER\n</b>               I want to see Mr. and Mrs. Bodwin.\n\n<b>                         JANEY\n</b>               Miss Bodwin. They brother and sister,\n               darlin.\n\n<b>                         DENVER\n</b>               Oh.\n\n<b>                         JANEY\n</b>               What you want'em for?\n\n<b>                         DENVER\n</b>               I'm looking for work. I was thinking they\n               might know of some.\n\n<b>                         JANEY\n</b>                    (smiles)\n               You Baby Sugg's kin, ain't you?\n\n<b>                         DENVER\n</b>               Yes ma'am.\n\n<b>                         JANEY\n</b>               I heard your mother took sick, that so?\n\n<b>                         DENVER\n</b>               Yes ma'am..\n\n<b>                         JANEY\n</b>               Well, come on in. You letting in flies.\n\n<b>     INT. THE BODWIN'S HOUSE - DAY.\n</b>\n     The house is filled with books and pearl white lamps and\n     glass cases filled with glistening things.\n\n     Denver pushes her feet into the soft blue carpet as she sits\n     with Janey.\n\n<b>                         JANEY\n</b>               You know what? I've been here since I was\n               fourteen and I remember like yesterday\n               when Baby Suggs, holy, came here and sat\n               right where you are. Whiteman name of\n               Garner brought her. He and Mr. Bodwin\n               were good friends. That's how she got\n               that house you all live in. Other things\n               too.\n\n<b>                         DENVER\n</b>               Yes ma'am.\n\n<b>                         JANEY\n</b>               I never went to those woodland services\n               but she was always nice to me. Always.\n               Never be another like her.\n\n<b>                         DENVER\n</b>               I miss her.\n\n<b>                         JANEY\n</b>               Bet you do. Everybody miss her. That was\n               a good woman...Well, I don't know whether\n               the Bodwins think it or not but they sure\n               could use some extra help.\n\n<b>                         DENVER\n</b>                    (hopeful)\n               Ya think?\n\n<b>                         JANEY\n</b>               They getting older now and I can't take\n               care of 'em like I used to. More and more\n               they keep asking me to sleep over night.\n               Now, I don't want to quit these people\n               but they can't have all my days and\n               nights too. I got my own family needs me.\n               It'll take some convincing but maybe you\n               could come after supper - take care of\n               your mama during the day, then earn a\n               little something at night, how's that?\n\n<b>                         DENVER\n</b>               Fine. But what would I do at night?\n\n<b>                         JANEY\n</b>               Be here. In case.\n\n<b>                         DENVER\n</b>               In case of what?\n\n<b>                         JANEY\n</b>               In case the house burn down or bad\n               weather slops the roads so bad I can't\n               get here on time or late guests needed\n               cleaning up after. Anything.\n                    (laughs)\n               Don't ask me what whitefolks need at\n               night.\n\n     During Janey's lines, Denver looks about the house imagining\n     herself here at night...her eyes happen upon A STATUE OF A\n     BLACK BOY on his knees, his head thrown back farther than a\n     head could go, his mouth wide open like a cup and filled with\n     money for delivery tips. On the pedestal are the words' AT YO\n<b>     SERVICE;\n</b>\n<b>                         DENVER\n</b>               They good whitefolks?\n\n<b>                         JANEY\n</b>               Oh yeah. They good. Can't say they ain't\n               good. I wouldn't trade them for another\n               pair, tell you that. But you come back in\n               a few days - give me a chance to lead'em\n               to it. All right?\n\n     Denver nods, beaming gratefully - so gratefully that no words\n     come, only tears... Janey reaches for Denver's hand and holds\n     it warmly;\n\n<b>                         JANEY\n</b>               What is it, child? What's the trouble\n               with Sethe?\n\n     Denver looks at her and we know she needs to tell someone.\n\n<b>     INT. ELLA'S HOUSE - DAY.\n</b>\n     Ella has gathered all the women of the town for a meeting\n     including Lady Jones, Janey Wagon, M. Lucille Williams,\n     Grace;\n\n<b>                         GRACE\n</b>               But is it really the daughter, Janey? The\n               killed one?\n\n<b>                         JANEY\n</b>               That what she say.\n\n<b>                         M. LUCILLE\n</b><b>                         WILLIAMS\n</b>               How they know it's her?\n\n<b>                         ELLA\n</b>               It's sitting there. Sleeps, eats and\n               raises hell. Whipping Sethe every day.\n\n<b>                         GRACE\n</b>               I'll be. A baby?\n\n<b>                         JANEY\n</b>               No. Grown now. The age it would have been\n               had it lived.\n\n<b>                         GRACE\n</b>               In the flesh. And whipping her.\n\n<b>                         M. LUCILLE\n</b><b>                         WILLIAMS\n</b>               Guess she had it coming a little.\n\n<b>                         ELLA\n</b>               Nobody got that coming.\n\n<b>                         M. LUCILLE\n</b><b>                         WILLIAMS\n</b>               But Ella- you can't just up and kill your\n               children.\n\n<b>                         ELLA\n</b>               No, and the children can't just up and\n               kill the mama. What's fair ain't\n               necessarily right...\n                    (the women listen)\n               Now you all know how I felt about the\n               whole thing. I know the rage Sethe felt\n               in that shed that day.  We all do. But\n               what I could not understand, and still\n               don't, was her reaction to it. Prideful.\n               Too damn complicated for a black woman in\n               her position before God. But whatever she\n               done, I don't like the idea of past\n               errors taking possession of the present.\n               I don't cotton to sin moving in on a\n               house, unleashed and sassy. Every day\n               life takes enough, takes all a woman has.\n               \"Sufficient unto the day is evil thereof\"\n               and nobody needs more. Nobody needs a\n               grown up evil sitting at a table with a\n               grudge. As long as that ghost showed\n               itself from a ghostly place, I respected\n               it. But once it take on flesh and come\n               into this world, well, the shoe's on the\n               other foot now. I don't mind a little\n               communication between worlds. But this\n               here's an invasion.\n\n     The women agree.\n\n<b>                         GRACE\n</b>               Should we pray?\n\n<b>                         ELLA\n</b>               Uh-huh. First. Then we got to get down to\n               business.\n\n<b>     INT. 124 BLUESTONE RD.: KITCHEN - DAYS LATER.\n</b>\n     Denver comes down the stairs, entering the kitchen.\n\n     Sethe, worn out, looking more beaten and ravaged than before,\n     stands at the sink with an ICE PICK chopping up ice. Denver\n     speaks to her, but she does not turn or acknowledge her.\n\n<b>                         DENVER\n</b>               Mama?....Mama I'm going out..\n                    (no response)\n               Mama, I got a job. Working over at the\n               Bodwins at night. Mr. Bodwin coming over\n               now to pick me up on his way back from\n               town. I'll be staying there nights and\n               coming back here for the daytime. We'll\n               have some money, mama..Mama?\n\n     Sethe continues her action as if hypnotized. Denver\n     approaches her from behind and whispers softly;\n\n<b>                         DENVER\n</b>               I'm going help you, mama. Don't you give\n               up yet.\n\n     Denver touches her gently, but Sethe acts as if she hears and\n     feels nothing. Denver exits.\n\n<b>     EXT. 124 BLUESTONE RD. - LATE THAT DAY.\n</b>\n     Denver is sitting on the stump waiting for Mr. Bodwin when\n     she hears;\n\n     THIRTY WOMEN, gathered together, walking up Bluestone Rd.\n     towards 124, SINGING A HOLY SONG;\n\n     Denver is amazed by the sight as the women position\n     themselves right in front of 124 - armed with bibles,\n     crucifixes and whatever other symbols of heavenly power they\n     could find.\n\n<b>     INT. 124 BLUESTONE RD; THE KEEPING ROOM - DAY.\n</b>\n     Sethe is rubbing a naked Beloved's forehead with a cool cloth\n     filled with ice, when the two women hear the singing.\n\n     Beloved rises first and moves to the window to see.\n\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     The women continue singing.\n\n<b>                                                            CUT TO:\n</b>\n<b>     EXT. FURTHER DOWN BLUESTONE RD. - DAY.\n</b>\n     MR. BODWIN, sitting on a wagon pulled by a horse, is riding\n     toward 124 when he hears the singing as well.\n\n<b>     WE NOTICE THAT MR. BODWIN IS WEARING A HAT SIMILAR TO THE ONE\n</b>     SCHOOLTEACHER WORE on that fateful day.\n\n<b>                                                       CUT BACK TO:\n</b>\n<b>     EXT. 124 BLUESTONE RD. - DAY.\n</b>\n     The women continue singing as:\n\n     Sethe and Beloved, her belly as big as a pregnant woman's,\n     exit the house.\n\n     The women are stunned by the sight and slightly confused by\n     the lack of fear between the women.\n\n     Sethe is holding Beloved's hand. Beloved is smiling brightly\n     at the beautiful singing.\n\n     Denver looks to her mother;\n\n     Tears run down Sethe's face but she is not crying. The sound\n     of the women's voices wash over her like a baptism. She looks\n     to all the women, faces she remembers, faces she has missed\n     although up until this moment was not conscious of missing.\n\n     Then, Sethe looks beyond the women and sees:\n\n<b>     MR. BODWIN APPROACHING IN HIS WAGON. SHE SEES MR. BODWIN\n</b><b>     WEARING A HAT THAT LOOKS LIKE SCHOOLTEACHERS.\n</b>\n     Sethe's expression turns to fear, then rage. In her ravaged\n     mind, she thinks it is Schoolteacher coming back...\n\n<b>                         SETHE\n</b>               No...No, he's not coming into my yard. He\n               not taking my best thing...No..\n\n     She releases Beloved's hand and moves forward...\n\n<b>                         SETHE\n</b>               No...no...no..\n\n<b>                         DENVER\n</b>               Mama?\n\n     She passes Denver, feeling for the ICE PICK IN HER APRON.\n\n<b>                         SETHE\n</b>               No...NO..NO..NOOOOOOOOOOOO!\n\n     As Mr. Bodwin reaches the thirty women who separate him from\n<b>     124. HIS EYES FOCUS IN WONDER ON THE NAKED BELOVED AS;\n</b>\n<b>     SETHE RUNS TOWARDS HIM AND THE WOMEN, HER HAND EXTENDED\n</b><b>     HOLDING THE ICE PICK..\n</b>\n<b>                         DENVER\n</b><b>               MAMA...NOOOOOOO!\n</b>\n<b>     DENVER RUNS AFTER HER. SETHE REACHES THE WOMEN AND LUNGES FOR\n</b><b>     BODWIN BUT THE WOMEN SEIZE HER, CREATING A HILL OF BLACK\n</b><b>     PEOPLE. SETHE RISING TO THE TOP, HER HAND EXTENDED. DENVER\n</b><b>     REACHING HER FROM BEHIND, PULLING HER BACK AND PUNCHING HER\n</b><b>     OUT COLD AS THE BODIES FALL AROUND THEM....\n</b>\n     Beloved watches from the house - watches Sethe attack and\n     defend with the ice pick.  And something within her is\n     resolved. For a moment, we see a calm spirit instead of a\n     wild animal. And a tear upon her face..\n\n     Then, just as quickly, she sprints around the side of the\n     house and disappears from view.\n\n     The Women try to help Sethe as Denver cries for her mother.\n     Mr. Bodwin looks on stunned.\n\n<b>     WIDE ANGLE - OF A NAKED BLACK WOMAN WITH A FULL BELLY RUNNING\n</b><b>     THROUGH AN OPEN FIELD, REACHING THE WOODS THEN DISAPPEARING\n</b><b>     INTO THE TREES......\n</b>\n<b>                                                          FADE OUT;\n</b>\n<b>     FADE IN:\n</b>\n<b>     EXT. RICHMOND ST. - DAY. WEEKS LATER.\n</b>\n     Paul D. is on his way to work when he sees;\n\n     A poised, confident Denver walking in the opposite direction.\n     She spots him and smiles;\n\n<b>                         DENVER\n</b>               Good morning, Paul D.\n\n     Paul is clearly impressed by the sight of her.\n\n<b>                         PAUL\n</b>               Well, is it now? How you getting along?\n\n<b>                         DENVER\n</b>               Don't pay to complain.\n\n<b>                         PAUL\n</b>               You on your way home?\n\n<b>                         DENVER\n</b>               No. Got me an afternoon job at the shirt\n               factory. Figure between that and my night\n               work at the Bodwins I might be able to\n               put something away for me and mama.\n\n<b>                         PAUL\n</b>               They treating you right over at the\n               Bodwins?\n\n<b>                         DENVER\n</b>               More than all right. Miss Bodwin, she\n               teach me stuff..Book stuff. She says I\n               might go to Oberlin. She's experimenting\n               on me.\n\n     Paul smiles - wanting to warn her but deciding not to spoil\n     the possibilities that lay before her.\n\n<b>                         PAUL\n</b>               Your mother all right?\n\n<b>                         DENVER\n</b>               No. Not a bit all right. Hasn't gotten\n               out of bed since that day.\n\n<b>                         PAUL\n</b>               You think I should stop by? Think she'd\n               welcome it?\n\n<b>                         DENVER\n</b>               I don't know. I think I've lost my\n               mother, Paul D.\n\n     Silence.\n\n<b>                         PAUL\n</b>               That girl...You know, Beloved...\n\n<b>                         DENVER\n</b>               Yes?\n\n<b>                         PAUL\n</b>               She gone like they say?\n\n<b>                         DENVER\n</b>               Haven't seen her since that day. Ella\n               thinks she might be waiting in the woods\n               for another chance but..I don't think so.\n               Mama thinks she's gone for good. Says she\n               can feel it.\n\n<b>                         PAUL\n</b>               You think she sure 'nough your sister?\n\n<b>                         DENVER\n</b>               At times. At other times I think she\n               was...more. But who would know that\n               better than you. I mean, you sure 'nough\n               you her.\n\n     She levels her eyes at him and he knows what she means.\n\n<b>                         PAUL\n</b>               Well, if you want my opinion...\n\n<b>                         DENVER\n</b>               I don't. I have my own.\n\n<b>                         PAUL\n</b>               You grown.\n\n<b>                         DENVER\n</b>               Yes sir\n\n<b>                         PAUL\n</b>               Well, good luck with the job.\n\n<b>                         DENVER\n</b>               Thank you.\n\n     They pass each other until Denver turns back;\n\n<b>                         DENVER\n</b>               And Paul D...you don't have to stay 'way,\n               but be careful how you talk to my mama,\n               hear?\n\n<b>                         PAUL\n</b>               I will.\n\n     Paul watches her walk away. He watches as a YOUNG BLACK MAN\n     runs towards her shouting;\n\n<b>                         YOUNG MAN\n</b>               Hey, Miss Denver..Wait up!\n\n     He watches as the two young people, the future, walk\n     together.\n\n<b>     INT. 124 BLUESTONE RD. - DAY.\n</b>\n     Paul enters the house and hears HUMMING. He walks towards the\n     keeping room, whose door is ajar;\n\n<b>     INT. KEEPING ROOM - DAY.\n</b>\n     Sethe lies in bed with the remnants of Baby Sugg's quilt over\n     her, as she hums her melody and looks out of the window.\n\n<b>                         PAUL\n</b>               Sethe?\n\n<b>                         SETHE\n</b>                    (turns to him)\n               Paul D.\n\n     She looks like she's dying.\n\n<b>                         PAUL\n</b>               Aw, Sethe.\n\n     He approaches her.\n\n<b>                         SETHE\n</b>               You shaved.\n\n<b>                         PAUL\n</b>               Yeah. Look bad?\n\n<b>                         SETHE\n</b>               No, You looking good.\n\n<b>                         PAUL\n</b>               Devil's confusion. What's this I hear\n               about you not getting out of bed?\n                    (no response)\n               I saw Denver. She tell you?\n\n<b>                         SETHE\n</b>               She comes in the daytime.  She still with\n               me, my Denver.\n\n<b>                         PAUL\n</b>                    (nervous)\n               You got to get up from here, girl.\n\n<b>                         SETHE\n</b>               I'm tired, Paul. So tired. I have to rest\n               a while.\n\n<b>                         PAUL\n</b>                    (getting upset, shouts)\n               Don't you die on me!! This is Baby Suggs\n               quilt. Is that what you planning!?\n\n<b>                         SETHE\n</b>               Oh, I don't have no plans. No plans at\n               all.\n\n<b>                         PAUL\n</b>               Look - Denver be here in the day. I be\n               here in the night. I'm a take care of\n               you, you hear? Starting now.\n\n     Sethe looks at him - a long look - and sees in him that\n     thing, that blessedness, \"that makes him the kind of man who\n     can walk into a house and make women cry, make women tell him\n     things they could only tell each other\".\n\n<b>                         PAUL\n</b>               What, baby?\n\n<b>                         SETHE\n</b>                    (cries)\n               She left me. She's gone again.\n\n<b>                         PAUL\n</b>               Aw, girl. Don't cry...Me and you, we got\n               more yesterday than anybody. We need some\n               kind of tomorrow...\n\n<b>                         SETHE\n</b>               She was my best thing.\n\n     Paul leans down and takes her hand, entwining his fingers\n     into hers...\n\n<b>                         PAUL\n</b>               You your best thing, Sethe. You are.\n\n     Sethe smiles, with tears in her eyes, looking almost\n     surprised;\n\n<b>                         SETHE\n</b>               Me?...Me?\n\n<b>     EXT. THE CLEARING - A DAY OUT OF TIME.\n</b>\n     A beautiful, sunny day. The clearing is full. Everyone looks\n     bright and hopeful. Dressed in bright, summer clothes...\n\n     A robust Baby Suggs is on her rock giving her best Call, as\n     camera pans the crowd of faces eager to believe ....\n\n<b>                         BABY SUGGS\n</b>               ..The only grace we can have, is the\n               grace we can imagine. If you cannot see\n               it, you will not have it...Here, in this\n               place, we are flesh. Flesh that weeps,\n               laughs, dances on bare feet in the grass.\n               Love it. Love it hard. Yonder they do not\n               love your flesh. They despise it. They\n               flay it. O, my people, they do not love\n               your hands. Those they only use, tie,\n               bind, chop off and leave empty, Love your\n               hands. Love them. Raise them up and kiss\n               them. Touch others with them, put them\n               together, stroke them on your face 'cause\n               they don't love that either. You  got to\n               love it. You. Yonder out there, they\n               ain't in love with your moth. They will\n               see it broken and break it again. What\n               you say out of it, they will not heed.\n               What you scream from it they do not hear.\n               No, they don't love your mother. You got\n               to love it. And the feet that need to\n               rest and to dance. The backs that needs\n               support. The shoulders that need arms,\n               strong arms I'm telling you! O my people,\n               out yonder they don't love your neck\n               unnoosed and straight. So love your neck;\n               put a hand on it, grace it, stroke it and\n               hold it up. Love all your inside parts,\n               love 'em..and the beating heart, love\n               that too. More than eyes or feet. More\n               than lungs that have yet to draw free\n               air, love your heart. For this is the\n               prize.\n\n     And with her twisted, broken old body BABY SUGGS BEGINS TO\n<b>     DANCE AND TWIRL UP ON HER ROCK.\n</b>\n     And the crowd gives her music, SINGING IN FOUR PART HARMONY.\n     CAMERA PANS THE CROWD OF BEAUTIFUL FACES singing together.\n     Among the crowd, we see FAMILIAR FACES...\n\n<b>     WE SEE THE WOMEN WHO SANG AT 124...\n</b>\n     WE STAMP PAID, ELLA, JOHN, and LADY JONES...\n\n<b>     AND WE SEE SETHE, SURROUNDED BY ALL HER CHILDREN.\n</b>\n<b>                                                          FADE OUT.\n</b>\n\n<b>                             THE END\n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Beloved.jpg\"/>\n</td><td><h1>Beloved</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Richard LaGravenese\" title=\"Scripts by Richard LaGravenese\">Richard LaGravenese</a>  <a href=\"/writer.php?w=Toni Morrisson\" title=\"Scripts by Toni Morrisson\">Toni Morrisson</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Beloved Script.html#comments\" title=\"Beloved comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:00:18.801260"}