{"title": "Big White, The", "film_link": "/Movie Scripts/Big White, The Script.html", "script_link": "/scripts/Big-White,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Big White, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Big-White,-The.jpg\" title=\"Big White, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Collin Friesen\" title=\"Scripts by Collin Friesen\">Collin Friesen</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Script Date</b> : March 2004<br/>\n<b>Movie Release Date</b> : December 2005<br/>\n<br/>\n<a href=\"/scripts/Big-White,-The.html\">Read \"Big White, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n\n<b>                                       THE BIG WHITE\n</b>\n\n\n                                        Written by\n\n                                      Collin Friesen\n\n\n\n\n\n\n<b>      FADE IN:\n</b>\n<b>      EXT. ROAD - WINTER DAY\n</b>\n      A police car, nothing more than a speck on the landscape, is intermittently\n      visible through the blowing snow.\n\n<b>      INT. POLICE CAR - SAME\n</b>\n      A CORPORAL (20s), behind the wheel, with a bored DETECTIVE BOYLE (60s)\n      at his side.\n\n<b>                                  CORPORAL\n</b>              So his hand is like, off, right.  So he puts on a\n              tourniquet, puts the hand in his pocket, walks five\n              miles through the bush til he gets to the highway,\n              where he passes out, on the road, right.  Then this\n              logging truck comes along...\n\n<b>                                  DETECTIVE BOYLE\n</b>                        (looking ahead)\n              Hey.\n\n      The Corporal looks forward.\n\n      CAR'S POV: Through the windshield of a WOMAN (40s), dressed in her\n      pajamas and a parka, skipping down the middle of the road.\n\n<b>      EXT. ROAD\n</b>\n      The police car pulls to a stop, just as the woman does a pirouette and falls\n      over backwards.\n\n      Detective Boyle and the other Cop get out and walk over.\n\n<b>                                  CORPORAL\n</b>                        (into his radio)\n              Dispatch, this is unit 611, we need a first\n              responsder --\n\n<b>                                  DETECTIVE BOYLE\n</b>              Cancel that.\n\n      The Woman kicks up a leg, wiggles her foot.\n\n                                  DETECTIVE BOYLE (cont'd)\n              I know where she belongs.\n\n      As they lift her up...\n\n<b>1     INT. INSIDE A TRASH DUMPSTER - LATE AFTERNOON                                  1\n</b>\n      The dumpster lid opens on a bitterly cold, gray winter's day in an Alaskan city.  A\n      chunky, shivering HAIR STYLIST with jet black bangs shakes out a box of\n      conditioning samples.\n\n<b>                                  HAIR STYLIST\n</b>                        (to someone O.S.)\n              She says \"I haven't eaten all day,\" then, right there on\n              the bus she pulls out this, like, salmon steak and\n              I'm...\n\n<b>2     INT. INSIDE A TRASH DUMPSTER - LATE AFTERNOON                                  2\n</b>\n      The dumpster lid BANGS shut, reopens a beat later. A moment of calm until\n      two garbage bags SLAM against the inside of the lid. It falls shut with a CLANG.\n\n<b>3     EXT. TRASH DUMPSTER - NIGHT                                                    3\n</b>\n      The lid reopens. Night time now, as a street lamp BUZZES to life. A middle\n      aged MAN in work clothes checks to make sure he's alone. He gently lowers\n      the lid, opens it again a moment later, this time balancing a mini-bar fridge on\n      his shoulder.  He dumps the appliance into the bin and runs off.\n\n<b>4     INT. INSIDE A TRASH DUMPSTER - NIGHT                                           4\n</b>\n      The lid reopens.  SIRENS off in the distance...\n\n<b>                                  MEN'S VOICES (O.S.)\n</b>              One, two, three... up.\n\n      The lifeless body of a fair-sized man comes CRASHING into the garbage.\n      SIRENS closer.  A man seen only in silhouette leans in to pull some garbage\n      over the corpse.  A second man looks in, then pulls the first man away.\n\n<b>                                  MAN'S VOICE\n</b>              We'll get him later.  C'mon.\n\n      The lid drops.\n\n<b>5     EXT. TRASH DUMPSTER - MORNING                                                  5\n</b>\n      Black.  The dumpster reopens. Morning now. A Korean-American  TEENAGER\n      wearing an apron and headphones sings along to an  old KISS tune as he\n      deposits two large orange garbage bags.\n\n<b>                                  TEENAGER\n</b>              \"...Get up, everybody's gonna move their feet, get\n              down, everybody's gonna leave their seat...gonna\n              lose your mind in...\"\n\n      He shuts the lid with care.  Black.\n\n<b>6     EXT. CITY STREET - DAY                                                         6\n</b>\n      A cookie-cutter subdivision.  Old pine trees poke through the snow cover that\n      blankets the neighborhood.  HOWARD (30s), a burly outdoors type, is trying to\n      unload a new snowmobile from the back of his pickup.  TED WATTERS (late\n      20s) half hidden under a heavy dress coat, walks down the street. He stops by\n      Howard's driveway.\n\n<b>                                  TED\n</b>              Need a hand?\n\n<b>                                  HOWARD\n</b>                        (turning)\n              Yeah.  Could ya grab me those two by eights?\n\n      Ted walks up the driveway, grabs the wood slats, makes a ramp by leaning\n      them against the rear bumper.\n\n                                  HOWARD (cont'd)\n              Thanks.\n\n      Howard maneuvers the snowmobile down the ramp, his back turned toward\n      Ted -- who has taken out a small cam-corder and is taping Howard.\n\n                                  HOWARD (cont'd)\n              I tell ya, it may look fast but it sure ain't light.  You the\n              guy who just moved in to the Stevens old house?\n\n<b>                                  TED\n</b>              No.  Name's Ted.\n\n<b>                                  HOWARD\n</b>              Hey Ted, I'm Howard.\n\n<b>                                  TED\n</b>              Hey Howard.  What is that, an Arctic Cat? What do\n              those go for?\n\n<b>7     P.O.V. CAMCORDER VIEW FINDER                                                   7\n</b>\n      Howard finally has the snowmobile on the ground.  He's breathing heavy as he\n      pulls off his mitt to shake hands.\n\n<b>                                  HOWARD\n</b>              More than I could normally afford, I'll tell ya.\n                        (seeing the camera)\n              Hey!  What do you think you're you doing?\n\n      As Ted and Howard continue to talk, we PULL BACK to reveal we are watching\n      Ted's video playing on a VCR that is --\n\n<b>8     INT. INSURANCE OFFICE / COMMON AREA - DAY                                      8\n</b>\n      A group of office WORKERS look on, very much impressed, as a stunned\n      Howard stares at the camera.\n\n<b>                                  TED (O.S.)\n</b>              Howard, you seem like a reasonable kind of guy.\n              Lets you and me talk.\n\n      TIGHT ON: WATTERS at his nearby cubicle, typing frenetically on his computer.\n\n      At first, he appears to be working, until we realize that on his computer screen\n      pixilated Zombies die in silent anguish beneath an unholy hail of bullets.  A\n      Miami Dolphins sticker is the sole cubicle decoration.\n\n      As the tape finishes, a smattering of APPLAUSE from his colleagues.  Ted\n      gives a small wave over the cubicle wall.\n\n                                  TED (cont'd)\n              Thank you.  Just happy to give something back to\n              Liberty Capital...\n                        (to himself - bitter)\n              After all they've done for me.\n\n<b>9     INT. INSURANCE OFFICE / COMMON AREA - DAY                                      9\n</b>\n      CAM (30s), Native-American Alaskan walks over. Ted immediately hits a key\n      that turns the screen to a spread-sheet.\n\n<b>                                  CAM\n</b>              That was really cool.  It was like... watching \"Cops\".\n\n<b>                                  TED\n</b>              He was pretty spry for a man with a herniated disc.\n\n<b>                                  CAM\n</b>              You know, I don't want to bitch or anything, but you\n              were supposed to take me along on that one.\n\n<b>                                  TED\n</b>              Couldn't find you.\n\n<b>                                  CAM\n</b>              I know you know this, but the sooner they think I can\n              handle calls on my own, the sooner they'll kick you\n              back down south.\n\n<b>                                  TED\n</b>              I've been hearing that for 13 months and six days,\n              Cam.  After a while, it gets a little old.\n                        (off Cam's look)\n              Next time, okay.\n\n      Good enough.  Cam moves off.  Back to the zombie blood bath.  The phone\n      RINGS.  Ted picks up, his eyes never wavering from the gore intensive\n      computer game.\n\n                                  TED (cont'd)\n              Claims, Ted Watters.  Sure.\n\n      A final key stroke separates one last zombie from its entrails.\n\n<b>10    INT. INSURANCE OFFICE / BRANCH'S OFFICE - MOMENTS LATER                       10\n</b>\n<b>      TIGHT ON: A MOUNTED SALMON\n</b>\n      We PULL BACK to see the walls lined with souvenirs of a life spent on the\n      edge of the wilderness; citations from the Rotarians, pictures of sponsored\n      hockey teams... We are --\n\n      FRANK BRANCH (50s), a mid-level management type sits across from PAUL\n      BARNELL (40s), a mild-mannered everyman wrapped in a cheap suit.  Paul\n      takes in the display.  The two men sit in silence, smiling politely at one another.\n\n<b>                                  PAUL\n</b>              That's... quite the fish.\n\n      Branch is about to answer when Ted enters with a slim file.\n\n<b>                                  BRANCH\n</b>              Paul Barnell, Ted Watters.\n\n      Handshakes.  Paul makes steady eye contact.  Ted notices.\n\n                                  BRANCH (cont'd)\n              Mr. Barnell wants to talk to us about his brother's life\n              insurance policy.\n\n      Ted sits and flips open the file.\n\n<b>                                  TED\n</b>              Raymond, isn't it?\n\n<b>                                  PAUL\n</b>              Yes, Raymond.  You see, as I've already explained to\n              Mr. Branch, he's been gone for five years now, and I\n              thought it might be time to... move on.\n\n<b>                                  TED\n</b>              By move on you mean...?\n\n<b>                                  BRANCH\n</b>              ...cash in Raymond's policy.\n\n      Ted smiles to himself.\n\n<b>                                  PAUL\n</b>              I just thought, well, it's pretty unlikely he's still alive.\n              My Dad always wanted us to be able to look after\n              each other if anything should ever happen.  And to\n              be frank, money's a little --\n\n<b>                                  TED\n</b>              I understand Mr. Barnell, but here's the thing. With no\n              actual body, under Alaskan statutes a person must\n              be missing for seven years before he or she can be\n              legally declared dead and that's not withstanding an\n              investigation period where concerned parties can\n              take up to another year to file interventions\n              concerning the motion.  So, even though your\n              brother's status is undetermined at this point, there's\n              really very little we can do for you.\n\n      Ted flips the file shut.  Case closed.  Branch, not entirely happy with Ted's\n      demeanor, forces a smile.\n\n<b>                                  BRANCH\n</b>              Of course we are extremely sorry for your loss.\n\n      Branch looks at Ted.  Ted turns to Paul.\n\n<b>                                  TED\n</b>              Oh, absolutely.\n\n<b>11    EXT.  STRIP MALL - NIGHT                                                      11\n</b>\n      The city skyline rises in the distance as heat vents belch steam against the\n      rapidly setting sun.  But that's miles away.  Here on the outskirts is a rapidly\n      failing five store strip mall; a \"Porn-a-copia\" XXX Video store, hair stylist,\n      small engine repair shop, fish and chips joint and the \"Barnell Great Escapes\" \n      travel agency.  We might notice a big trash dumpster in the corner.  Paul's car,\n      a Ford Taurus, pulls onto the parking pad.\n\n<b>12    INT. PAUL'S CAR - CONTINUOUS                                                  12\n</b>\n      Paul driving, talking on his cell phone and balancing a big non-spill metallic\n      travel coffee mug at the same time.\n\n<b>                                  PAUL\n</b>              Hang on, hang on.  First off, how did you get my cell\n              number?  (Beat)  Because it's for mechanical and\n              medical emergencies only.\n\n      Paul, wound up, taps his brakes too hard.  His mug falls, the lid pops and the\n      coffee proceeds to soak a stack of papers.\n\n                                  PAUL (cont'd)\n              Great.\n                        (back into phone)\n              No, I'm not...  I just... give me a second here.\n\n      Paul parks his car, gathers the soggy papers and gets out.\n\n<b>13    EXT. STRIP MALL                                                               13\n</b>\n      Paul, still on the phone, carries the papers to the dumpster.\n\n<b>                                  PAUL\n</b>              Yes, and that check went out a week ago.  I watched\n              my secretary write it up.\n\n<b>14    EXT. INSIDE THE DUMPSTER                                                      14\n</b>\n      Black.  Paul opens the lid.  The phone is cradled in his neck, he checks each\n      soggy page to make sure he's not tossing anything important.\n\n<b>                                  PAUL\n</b>              Well I don't know.  I, I, I have no clue.  Could it\n              possibly be a problem on your end?  So the electric\n              company never makes a...  Look, I pay my bills.  I'm a\n              Rotarian for goodness --\n\n      Paul looks over to see some MEN from Rodney's Repo Ranch walking up to\n      the front door of his office.  Distracted for a moment, the phone slips and falls\n      into the trash.\n\n      Paul, muttering, leans in to get it.  He pushes aside an orange garbage bag,\n      guided by the faint sound of the other person STILL TALKING. And then--\n\n      PAUL'S POV: of THE BODY-- a 40-ish White (well, a little blue) male dressed in\n      a cheap suit.  Paul's phone lies across the corpse's mouth, like the dead guy is\n      talking.\n\n<b>                                  THE CELL PHONE\n</b>              Mr. Barnell?  Mr. Barnell?\n\n<b>15    EXT. PARKING AREA / STRIP MALL                                                15\n</b>\n      A SHOUT as Paul jumps back from the dumpster. The lid CRASHES down as\n      he scrambles/slides away.  He takes a moment to compose himself, then\n      realizes his phone is still in there.\n\n      He opens the dumpster lid and very quickly reaches in, grabs his cell and\n      hurries off.  The lid CRASHES shut.\n\n<b>                                  PAUL\n</b>                        (into the phone)\n              Hello?\n\n      Hung up.  Paul dials 911, looks back at the dumpster, thinks for a second, then\n      hits END.  He stands there, thinking.\n\n<b>A15   INT. \"BARNELL GREAT ESCAPES TRAVEL\" - LATER                                  A15\n</b>\n      Paul back in his office, staring out the window with a perfect view of the\n      dumpster.  He can't take his eyes off it.\n\n      Behind him, the Repo-Men are picking up a newish computer monitor and\n      walking toward the door.  He's oblivious.\n\n      At the sound of a TRUCK, his head snaps around.  It's a garbage truck, but\n      instead of heading to the dumpster, it rumbles past on the road.  That's all it\n      takes.\n\n<b>B15   EXT. PARKING AREA / STRIP MALL - MOMENTS LATER                               B15\n</b>\n      Paul backs his Ford Taurus up to the dumpster, pops the trunk, checks to\n      make sure he's alone then steps up on the rear bumper, opens the lid and\n      clambers inside.\n\n<b>16    INT. INSIDE A FRIDGE - LATER                                                  16\n</b>\n      Black.  The fridge door opens, the light revealing several cans of pop and beer\n      in the foreground.  Behind the\n\n      beverages, a garage where Paul struggles with the lifeless body.  He props the\n      man against the hood of his car, gives him a quick once over, pockets, obvious\n      wounds.  Nothing.\n\n      Paul moves to the fridge, starts to pull things out.\n\n<b>17    INT. ATTACHED SUBURBAN GARAGE - CONTINUOUS                                    17\n</b>\n      Jodie, an annoyingly small dog, enters the garage from the house and starts\n      sniffing around the body.  A new chew toy!\n\n<b>                                  PAUL\n</b>                        (at the sound)\n              Jodie, no!  Not for dogs!\n\n      He SHOOS the dog back into the house.  Paul moves back to the fridge, opens\n      the door and, with great effort picks up the dead man and tries to stuff him\n      inside.  Only problem...\n\n      The man's legs don't want to fit.  Paul leans down and grabs an uncooperative\n      appendage.  He grits his teeth, looks away as he kicks at the knee.  It SNAPS\n      sideways.\n\n      Paul fights nausea.  But with the leg now out of joint, the man fits.  Paul,\n      breathing heavy, leans against the door.\n\n                                  PAUL (cont'd)\n              OK then.  OK.\n\n      He packs in the remaining space with beer and pop bottles.  Then, just before\n      he shuts the door, Paul reaches in and sets the fridge temperature from 1 to 9\n      (the coldest setting).\n\n      A padlock and chain come from the base of a propane BBQ.  It goes around the\n      fridge, the lock SNAPS it in place.  Paul spots some leftover drink cans.  He\n      kicks them to the corner and walks into the house, trying to sound casual.\n\n                                  PAUL (cont'd)\n              Hey Honey.  Any mail?\n\n<b>18    EXT. CITY ROADWAY - EVENING                                                   18\n</b>\n      Ted drives home through a wooded section of town.\n\n<b>A18   INT. TED'S CAR - CONTINUOUS                                                  A18\n</b>\n      Ted checks out various radio stations, hating everything.  He lands on one\n      playing \"Escape (The piña Colada Song)\" when he looks up and suddenly\n      jams on the brakes.\n\n<b>B18   EXT. ROADWAY                                                                 B18\n</b>\n      Ted car slides toward a moose that has wandered into the middle of the road.\n      The car stops about five feet away.\n\n      The moose looks at Ted.  Ted looks back, wondering what he ever did to\n      deserve the life he's stuck with.  After a moment, the moose lumbers off.  Ted\n      drives on.\n\n<b>                                                                               CUT TO:\n</b>\n<b>C18   INT TED'S APARTMENT - NIGHT                                                  C18\n</b>\n      TIGHT ON: A COMPUTER SCREEN where swirling signs of the Zodiac act as a\n      screen saver.  PULL BACK TO REVEAL we are --\n\n      A telephone cord runs from the computer to the headset of TIFFANY (20s), pert,\n      smart and dressed in a tight University of Alaska T-shirt.  Tiffany sits with her\n      feet up on the desk as she flips through a copy of \"Cosmo\".\n\n      It's a medium sized apartment, littered with guy stuff although bowing to\n      advancing signs of feminine influence.\n\n      The phone RINGS.  Tiffany hits the space bar.  The caller's number flashes on\n      screen.  By the second ring, an electronic timer kicks in and a complete file on\n      the caller appears with name, address, background, pets...  She smiles, hits\n      \"enter.\"\n\n<b>                                  TIFFANY\n</b>                        (into her headset)\n              Psychic Pals.  How are you today... Mr. Williams?\n                        (pause - she listens)\n              Well, we are all registered psychics here.  I just had\n              a feeling you'd be calling.  What's up?\n\n      A KEY IN THE DOOR.  A tired Ted walks inside.\n\n<b>                                  TED\n</b>              Hey Tiff.\n\n      Tiffany looks up, then holds up a file folder with the words \"WORKING -\n      SHHHHHH!\" in big black letters.\n\n<b>                                  TIFFANY\n</b>                        (to caller)\n              Your TV remote control?  Okay.\n\n      Ted SIGHS, gives her a quick peck on the cheek as he wrestles off his winter\n      gear and heads to the kitchen.\n\n                                  TIFFANY (cont'd)\n              I need you to clear your mind...\n\n      Ted looks into the fridge, making up new words to the song \"Escape.\"\n\n<b>                                  TED\n</b>              \"If you like frozen enchiladas, getting caught in the\n              rain.  If you're not into...something brownish.\"\n\n      Ted pulls out some Tupperware, tries to figure out what's in it.  Tiffany, still\n      wearing her headset, appears behind him, grabs a Diet Coke from the fridge\n      and kisses him on the cheek.\n\n<b>                                  TIFFANY\n</b>              It's stew.  I'm not sure it's still good.\n\n<b>                                  TED\n</b>              Aren't you with a customer?\n\n<b>                                  TIFFANY\n</b>              They're concentrating.\n\n      Ted grabs a fork, takes the pot and sits at the table.  Tiffany goes back to her\n      desk and flips through her magazine.\n\n<b>                                  TED\n</b>                        (through a mouthful of food)\n              So?  How's the tea leaf business today?\n\n<b>                                  TIFFANY\n</b>              I've decided from now on to ignore you when you're\n              ignorant about my work.  And it's going very well\n              thank you.\n                        (reconnecting to the caller)\n              Mr. Williams, I'm seeing sofa cushions.  Do you have\n              a sofa?  Good.  Glad I could help.\n\n<b>                                  TED\n</b>              You here from that software distributor guy?\n\n<b>                                  TIFFANY\n</b>              No, but I did crack that code problem.  You know how\n              sometimes when you're running Beta versions you --\n\n<b>                                  TED\n</b>              English, please.\n\n<b>                                  TIFFANY\n</b>              There was a boo-boo, but I fixed it.\n                        (another call comes in)\n              Psychic Pals, how are you today, Carol?  Now I\n              thought we'd agreed God is everywhere, but not\n              specifically in your coffee pot.\n\n<b>                                  TED\n</b>              Jeez, Tiff.\n\n<b>                                  TIFFANY\n</b>              Jeez, Ted.  Do I tell you how to do your job?\n\n<b>                                  TED\n</b>                        (kidding... kind of)\n              No, but then again I'm not a computer aided pseudo\n              psychic, so if you're looking for moral equivalence...\n\n<b>                                  TIFFANY\n</b>              Before you say anything else that may keep us from\n              having sex ever again, let me ask you something...\n\n      She picks up her magazine.\n\n<b>                                  TED\n</b>              Tiff, please.  I always get these wrong.\n\n<b>                                  TIFFANY\n</b>              That's why we keep trying.  Now, Love is Sacrifice\n              test.\n                        (reading)\n              If you were in a life raft with me and there was only\n              enough water --\n\n<b>                                  TED\n</b>              Don't you have a customer?\n\n<b>                                  TIFFANY\n</b>                        (to the caller)\n              Carol?  God says he's busy with a famine right now,\n              but you should keep praying.  Cool.\n\n      She hangs up.  Turns back to Ted, about to pick up where she left off...\n\n<b>                                  TED\n</b>              No.  I'm not doing it.\n\n<b>                                  TIFFANY\n</b>              It's just a stupid quiz.\n\n<b>                                  TED\n</b>              Exactly.\n\n      The PHONE RINGS.  Tiffany bolts to her desk, sits, spins in her chair as she\n      answers the call.\n\n<b>                                  TIFFANY\n</b>              Psychic Pals.  Is this the first time you've called us\n              Mrs...?\n\n      Tiffany at her computer, enters the name \"Margaret Barnell\" into her database.\n      Tiffany works a \"mute\" button as she points back to the magazine.\n\n                                  TIFFANY (cont'd)\n              But stupid quizzes can be illustrative of potential\n              relationship problems.\n                        (to her caller)\n              Margaret, I'm getting the feeling this is an anxious\n              day for you.\n\n      Ted, cooking pot in hand, walks over to her desk.\n\n<b>                                  TED\n</b>              Our only relationship problem is you're running a\n              $1.99 a minute carny scam out of my living room.\n\n<b>                                  TIFFANY\n</b>              Don't call it a scam.\n                        (to the caller - startled)\n              Excuse me?\n\n<b>                                  TED\n</b>              What?\n\n<b>                                  TIFFANY\n</b>              You've got to learn to channel that rage, Margaret.\n                        (to Ted - playful)\n              You didn't just call this your living room, did you?\n\n<b>                                  TED\n</b>              I meant ours.  Ours, ours, ours.\n\n      Tiffany returns to her call, but keeps looking at Ted.\n\n<b>                                  TIFFANY\n</b>              I feel someone you really care about, maybe even\n              the love of your life, is being a real pain.  Now I need\n              you to concentrate...\n\n      Ted pretends to do just that, drawing a giggle from Tiffany before he walks off.\n\n<b>22    INT. \"BARNELL GREAT ESCAPES TRAVEL\" - MORNING                                 22\n</b>\n      Paul tries to open the front door, but finds it blocked by a small pile of snow.\n      Three good yanks and it finally opens. He enters the shop.\n\n      Faded travel posters cover the walls.  AVIS (40s), a career office gal, smiles at\n      her boss as she assembles a life-size stand-up cardboard display for Aloha\n      Airlines.  It features a\n\n      dark Hawaiian beauty holding a softball sized sea shell.  The shell juts out of\n      the display giving it a 3-D quality.\n\n<b>                                  AVIS\n</b>              Morning Mr. Barnell.  Coffee?\n\n<b>                                  PAUL\n</b>              Thanks Avis.  Looks good.\n\n      Paul, shivering, hangs up his coat as Avis picks up a promotional Aloha Air\n      surfboard (the old display) and walks it to the back.\n\n                                  PAUL (cont'd)\n              Was November this bad last year?\n\n<b>                                  AVIS (O.S.)\n</b>              Well if we didn't have the weather what would we talk\n              about?  Did you send the computer back?\n\n      Paul moves to his desk.\n\n<b>                                  PAUL\n</b>              Yeah, it was not working.  Any calls?\n\n<b>                                  AVIS (O.S.)\n</b>              Just that fellow from Municipal Power and Electric.  I\n              told him you sent the check in weeks ago, but some\n              people don't like to listen.\n\n      Paul turns to look at the snow covered empty parking lot, then at a photo of his\n      wife Margaret on his desk.  He mentally gathers himself.\n\n<b>                                  PAUL\n</b>              Something... strange happened last night Avis.\n\n<b>                                  AVIS (O.S.)\n</b>              What was that?\n\n<b>                                  PAUL\n</b>              Did... you ever meet my brother Raymond?\n\n<b>                                  AVIS (O.S.)\n</b>              The one who went missing?\n\n<b>                                  PAUL\n</b>              Uh huh.  Well anyway last night there's a knock on\n              the door and there's Raymond, just... standing there\n              on the doorstep.\n\n      Avis arrives with the coffee and the mail.\n\n<b>                                  AVIS\n</b>              Didn't you have him declared...?\n\n<b>                                  PAUL\n</b>              Dead?  No.  I mean, they said he hadn't been gone\n              long enough.\n\n<b>                                  AVIS\n</b>                        (smiling warmly)\n              Good thing in hindsight.\n\n      Paul puts the mail down on the desk and start to flip through it.  Lots of bills,\n      most marked past due.  He finds a \"pre- approved\" credit card application, sets\n      it to one side.\n\n                                  AVIS (cont'd)\n              So where was he all these years?\n\n<b>                                  PAUL\n</b>              Lower 48.  Said he wanted to get away from the cold.\n\n<b>                                  AVIS\n</b>              Where 'bouts?\n\n<b>                                  PAUL\n</b>                        (looking up)\n              Sorry, what was that?\n\n<b>                                  AVIS\n</b>              Where was he living?\n\n      Paul, a flash of panic, looks over at the Hawaii display.  He keys on the shell.\n\n<b>                                  PAUL\n</b>              Florida.\n\n<b>                                  AVIS\n</b>              I've got an aunt down there.  Where 'bouts?\n\n<b>                                  PAUL\n</b>                        (blanking)\n              A uh... small place.  By the beach.\n\n<b>                                  AVIS\n</b>              Well that's great.  You and Mrs. Barnell will have\n              some company for a bit I guess.  How is she?\n\n<b>                                  PAUL\n</b>              Better, a little better.  Some days are better than\n              others.\n\n<b>23    INT. BARNELL HOME - DAY                                                       23\n</b>\n      MARGARET BARNELL (early 40s) stands in a plush bathrobe and slippers.\n      Despite her casual attire she is immaculately made up as she walks to the\n      front door, opening it on -- a young wholesome PAPERBOY smiling through the\n      cold.\n\n<b>                                  PAPERBOY\n</b>              Collecting, Mrs. Barnell.\n\n<b>                                  MARGARET\n</b>              Daniel, you pussy little cocksucker.  I'll get my purse.\n\n      The paperboy, unfazed, smiles as Margaret walks off.\n\n<b>                                  PAPERBOY\n</b>              It's 12 dollars.  I missed you last time.\n\n<b>                                  MARGARET (O.S.)\n</b>              Jerk off... OK, jerk off, uhhuh...\n\n      Margaret gives the paperboy his money, the stamp card plus a dollar tip, then\n      tweaks his nose.  Twice.\n\n                                  MARGARET (cont'd)\n              You say hi to your slut Mom for me?\n\n<b>                                  PAPERBOY\n</b>              Sure will.  Thanks.\n\n      He trots down the walk as Margaret shuts the door.\n\n<b>24    EXT. INSIDE A TRASH DUMPSTER - NIGHT                                          24\n</b>\n      The lid opens.  GARY and JIMBO (30s), check to insure they're not being\n      watched.  Gary, slightly effeminate, leans into the bin and BURROWS through\n      the garbage.  Jimbo, a bear of man, keeps watch.  He's nervous, a little out of\n      sorts.\n\n<b>                                  GARY\n</b>              I thought stuff didn't smell when it was frozen?  I\n              don't know why we have to--\n\n<b>                                  JIMBO\n</b>              Dave wants visual confirmation, he gets visual\n              confirmation.  We have a chance to move up here,\n              so let's just--\n\n<b>                                  GARY\n</b>              Like the guy's not gonna end up in a land- fill,\n              anyway.  You ever ask Dave what he did?\n\n<b>                                  JIMBO\n</b>              Whatever it was, he told him if he did it again, he'd\n              snap his neck.\n\n<b>                                  GARY\n</b>                        (smiling)\n              Whoops, he did it again.\n                        (off Jimbo not getting it)\n              The song?  From that girl?\n\n      No response.  Gary, HUMMING now, keeps digging, finding nothing.\n\n                                  GARY (cont'd)\n              So how'd it feel?  I mean, not when you did it, but,\n              like now?\n\n<b>                                  JIMBO\n</b>              I don't want to talk about it.\n\n      Gary hops inside as his actions become more frantic.  Still no luck.  He stands.\n\n<b>                                  GARY\n</b>              Not here.\n\n      Jimbo glares at his partner.\n\n                                  GARY (cont'd)\n              Serious.  He's gone.  Maybe he wasn't...\n\n<b>                                  JIMBO\n</b>              Don't even joke.  Maybe the trash was emptied.\n\n<b>                                  GARY\n</b>              Looks pretty full.  Hey...\n                        (ducking down)\n              There's a little fridge down here.\n                        (standing)\n              If we would have shot him at least we'd know for\n              sure.\n\n<b>                                  JIMBO\n</b>              I was following orders.  And if you hadn't started a\n              screaming match, no one would have called the\n              cops and we wouldn't have had to dump his --\n\n<b>                                  GARY\n</b>              Fine.  Sorry.\n\n<b>                                  JIMBO\n</b>              Fine.\n\n<b>                                  GARY\n</b>              I'm just saying... maybe you didn't break it all the way.\n\n<b>                                  JIMBO\n</b>                        (walking away)\n              It was broken.\n\n<b>                                  GARY\n</b>              I'm just saying... maybe it was like hypothermia and\n              he just looked dead.\n\n<b>                                  JIMBO\n</b>              It - was - BROKEN!\n\n      Gary, embarrassed, digs in the trash with his feet.\n\n<b>25    INT. GARAGE - CONTINUOUS                                                      25 \n</b>\n      Margaret, still in her bathrobe, walks to the fridge.  As she puts her hand on the\n      latch, she notices the pile of pop cans on the floor.\n\n      She tugs on the door.  It opens just a crack before the chain stops it.  The\n      frozen head peeks through the slight gap.\n\n      Margaret SIGHS, tries to push the fridge door closed, but the body is in the way.\n      She gives the door a hip check.  The door latches shut while something frozen\n      and brittle inside CRACKS.  Margaret, oblivious, walks away.\n\n<b>26    INT. KITCHEN OVEN                                                             26\n</b>\n      A chicken sits in a pan, the rest of the room visible behind it through the oven\n      door window.\n\n<b>                                  MARGARET (O.S.)\n</b>              Paul?  Why is the fridge in the garage chained shut?\n\n<b>                                  PAUL\n</b>              How's my Angel tonight?\n\n<b>                                  MARGARET\n</b>              Blow me.  Dinner's almost ready.  You feel like some\n              wine?  I feel like some wine.\n\n      Paul walks to the oven, opens the door and pats the chicken.  Stone cold.\n\n<b>                                  PAUL\n</b>              Sweetie, here's a crazy thought... I don't feel like\n              chicken tonight, why don't we order in?\n\n<b>                                  MARGARET\n</b>              Fuck it, okay.\n\n<b>                                  PAUL\n</b>              There's actually something we need to talk about.\n              It's about Raymond.  He's back.\n\n      Paul smiles bravely as he shuts the oven door.  Behind the chicken, Margaret\n      doesn't look happy as Paul starts to explain.  She rushes from the room.\n\n<b>27/28 TIGHT ON: TV SCREEN                                                        27/28\n</b>\n      Home video of RAYMOND (then early 30s), fat, physically imposing and the only\n      person not in festive tropical gear, standing in a VFW hall decorated in a\n      Caribbean theme. (He is definitely not the same person Paul has cooling in the\n      fridge.)  A large banner behind him proclaims \"HAPPY 10TH ANNIVERSARY -\n<b>      BON VOYAGE.\"\n</b>\n<b>                                  RAYMOND\n</b>                        (a little drunk)\n              Okay, I never thought it would last this long, but\n              seeing as how it has... There ya go.  Let me just say\n              that my brother, old \"Puddles McBarnesy\" did better\n              than he should have.\n\n      A younger, somewhat tipsy Paul comes into frame, puts an arm around his\n      brother and smiles.\n\n<b>                                  PAUL\n</b>              What'cha saying there Raymond?  Wha'cha saying\n              'bout me?\n\n      Raymond shakes his brother's arm off his shoulder.\n\n<b>                                  RAYMOND\n</b>              Enough, OK?\n\n<b>                                  PAUL\n</b>                        (sing-songy)\n              Ray's a little jeallllllllous.  This is the one that got\n              away, right Ray?\n\n      The crowd LAUGHS as Paul reaches over and musses up his brother's hair.\n      Raymond, furious, grabs his brother by the lapels and throws him roughly to\n      the floor.  The laughter stops.\n\n<b>                                  MARGARET (O.S.)\n</b>              Leave him alone, ball licker!\n\n<b>                                  RAYMOND\n</b>              And shut that thing --\n\n      The screen turns to snow.  We are...\n\n      Paul at his desk, watching the video on a small TV in the wall unit.  He turns his\n      attention to a large cardboard box filled with documents, souvenirs, old report\n      cards...\n\n      On the TV playing behind him (the second part of the tape), Margaret is pictured\n      on a cruise ship, sunning herself.  Paul, obviously behind the camera, watches\n      as Margaret takes a tropical drink from a WAITER'S tray, who promptly dumps it\n      all over her.  But instead of the expected burst of profanity, Margaret just\n<b>      LAUGHS.\n</b>\n<b>                                  MARGARET\n</b>              That's okay, don't worry about it.\n                        (as the waiter walks off)\n              I'd like the next one in a cup, please.\n\n      Paul puts aside a faded hotel postcard from Hawaii and digs out an insurance\n      policy out of the box.  On the last page is a list of the payouts.  Loss of a limb:\n      $100,000.  Loss of thumb: $5,000. Accidental death: $1,000,000.\n\n      And, as an extra bonus, Raymond's birth certificate.  Perfect. Paul takes out the\n      credit card application from work, and starts to write...\n\n<b>                                  PAUL\n</b>                        (to himself)\n              Raymond... Barnell.\n\n<b>29    EXT. TOBOGGANING HILL - LATE AFTERNOON                                        29\n</b>\n      LAUGHING children on toboggans, inner tubes and discarded cardboard\n      boxes slide down a snow covered hill against a slate gray sky.  It's an isolated\n      area on the outskirts of the city.\n\n<b>30    INT. GARY AND JIMBO'S CAR - CONTINUOUS                                        30\n</b>\n      Gary and Jimbo sit in their car in the parking area.\n\n<b>                                  JIMBO\n</b>              Which one's your sister's kid?\n\n<b>                                  GARY\n</b>              See the one on the little bike-thing?  Him.\n\n<b>                                  JIMBO\n</b>                        (hesitant)\n              You been alright with this?\n\n<b>                                  GARY\n</b>              The thing with the guy?  Ya know, I thought it might\n              kinda mess me up...\n\n<b>                                  JIMBO\n</b>              First time for both of us.\n\n<b>                                  GARY\n</b>              ...but I've been sleeping really well.\n\n<b>                                  JIMBO\n</b>              Yeah.  'Course, you didn't actually...\n\n      Jimbo mimics snapping someone's neck.  It's clearly not a gesture he enjoys.\n      As Gary looks at him, a Cadillac pulls up beside them.  Behind the wheel is\n      DAVE (50s) well dressed, in a thuggish kinda way.  Jimbo and Gary share a\n      nervous look.\n\n<b>31    EXT. TOP OF THE HILL - CONTINUOUS                                             31\n</b>\n      About 50 yards away from the two cars, Gary's NEPHEW is having his\n      Snowrider (a tricycle with skis instead of wheels) hijacked by a playground\n      BULLY in a red parka.  A tug o' war for the toy ensues as Gary and Jimbo get\n      out of their car.\n\n<b>                                  NEPHEW\n</b>              Leggo... it's mine.  Uncle Gary!\n\n<b>32    EXT. PARKING AREA                                                             32\n</b>\n      Gary and Jimbo are leaning close to the Cadillac's open window. Dave does\n      not look happy.\n\n<b>                                  DAVE\n</b>                        (to Jimbo)\n              Wait a minute.  He's disappeared?\n\n      Gary waves to his nephew.\n\n<b>                                  GARY\n</b>                        (shouting)\n              You just... hang in there, Billy!\n\n<b>                                  JIMBO\n</b>              Yeah.  But he's dead.  I mean, that part, no question.\n\n<b>                                  DAVE\n</b>              Yeah?  Take off your coat.  And your shirt, too.\n\n\n      Jimbo knows better than to argue.  He strips down, exposing his corpulent\n      middle-aged belly to the chilly winter winds.\n\n<b>                                  JIMBO\n</b>              I'm not wearing a wire, Dave, if that's what this is\n              about.\n\n<b>                                  GARY\n</b>              It was our first time.  No one gets it perfect their first\n              time.\n\n<b>                                  DAVE\n</b>              You too, Sweetie.\n\n      Gary is about to comply when the sound of a FIGHT on the tobogganing hill\n      causes them all to look over, just in time to see GARY'S NEPHEW shoved to\n      ground.  The Bully LAUGHS as he slides away.\n\n<b>                                  GARY\n</b>              Excuse me for a second.\n\n      Gary trots toward the hill.  Jimbo can't believe it.\n\n<b>                                  JIMBO\n</b>              Gary!  We're in the middle of something.\n\n<b>                                  GARY\n</b>                        (calling back)\n              Hey, I'm supposed to be looking after him.\n\n      Jimbo turns back to Dave, shrugging sheepishly.\n\n<b>                                  DAVE\n</b>              Is he...?\n\n<b>                                  JIMBO\n</b>              He's fine.  Look, we can take you there right now.\n              We'll show you.\n\n      Behind them on the hill, Gary tries to retrieve his nephew's Snowrider from the\n      Bully.  He is failing.\n\n<b>                                  DAVE\n</b>              Show me what?  An empty trash dumpster?  It was\n              supposed to look like an accident.  I was hoping to\n              see it in the paper.  So help me, if this guy pops up\n              somewhere...\n\n      While Jimbo does his best to stay warm, behind him on the hill, Gary can only\n      watch as the Bully slides away.\n\n<b>                                  BULLY\n</b>                        (echoing in the cold)\n              Fag!  Big homo!\n\n<b>                                  JIMBO\n</b>              He won't.  He can't.  He's --\n\n<b>                                  DAVE\n</b>              Proof, Jimbo.  I like to know my money's well spent.\n              You got a week.\n\n      Dave drives off as Gary walks over with his SNIFFLING nephew.\n\n<b>                                  GARY\n</b>              Slippery little sucker.  You mind if we stop at a toy\n              store on the way back?\n\n<b>33    OMITTED                                                                       33\n</b>\n<b>A 33  INT. BARNELL HOME / BEDROOM - NIGHT                                         A 33\n</b>\n      HIGH ANGLE ON:  Paul and Margaret in bed.  Margaret takes up more than her\n      share of the bed, her arm tossed over her husband.  Paul, on his third of the\n      bed, looks as if he's lying in state. But Paul's not sleeping.\n\n<b>34    EXT.  BARNELL HOME - MORNING                                                  34\n</b>\n      A newspaper clears the \"For Sale - price reduced!\" sign on the front lawn and\n      lands with a THUD on the steps.\n\n<b>35    INT.  GARAGE - CONTINUOUS                                                     35\n</b>\n      Paul has the \"Morning News\" on the hood of his car.  He looks over at the\n      fridge, still padlocked.\n\n<b>                                  PAUL\n</b>                        (to himself)\n              Let's see if anyone's missing you.\n\n      He flips through each section.  There's nothing.  Paul walks to the fridge.\n\n                                  PAUL (cont'd)\n                        (to the corpse)\n              I don't know what kind of man let's himself just\n              freeze to death in the trash, but I was never one to\n              preach.  Way I see it, you've probably got family\n              somewhere and they'd probably appreciate seeing\n              you get a decent funeral, even if it's not really... yours.\n\n      Paul, somewhat befuddled, gently pats the fridge door.\n\n<b>36    OMITTED                                                                       36\n</b>\n<b>37    INT. BARNELL HOME / LIVING ROOM - LATER                                       37\n</b>\n      Margaret pushes the vacuum across the floor, humming to herself.  Paul walks\n      by slipping into his coat.  He notices that the vacuum isn't plugged in.  Without\n      missing a beat, he walks over and plugs it into the outlet.  The VACUUM\n      ROARS TO LIFE.  Margaret doesn't flinch.  Paul heads out the door.\n\n<b>38    OMITTED                                                                       38\n</b><b>39    OMITTED                                                                       39\n</b>\n<b>40    EXT. WOODED AREA - LATER                                                      40\n</b>\n      A ways out in the forest.  Only two houses on this turn-out; a cozy looking lived\n      in cabin sits up the road from a seemingly deserted rundown mobile home.  A\n      car pulls up.\n\n<b>A40   INT. PAUL'S CAR - CONTINUOUS                                                 A40\n</b>\n      Paul adjusts a pillow he has taped to his stomach, then pulls on a blue ski\n      mask.\n\n<b>41    EXT. BARNELL MOBILE HOME - MOMENTS LATER                                      41\n</b>\n      Paul undoes the bungee cord and drags his snowblower out of the trunk.  He\n      fires up the snowblower and starts to plow the drive way of both houses.\n\n      MRS. WHERRY (80s), in her bathrobe, looks out the window of the cozy cabin.\n      A tad confused, she waves to the man in the blue parka.  The blue parka waves\n      back.\n\n<b>42    INT.  PAUL'S KITCHEN - NIGHT                                                  42\n</b>\n      Paul walks in from the garage, pulling off his blue parka.  Margaret enters from\n      the living room.  (Paul still has the pillow taped to his front, which Margaret\n      happily pokes with a finger but never mentions.)\n\n<b>                                  MARGARET\n</b>                        (nervous)\n              He's not here, is he?\n\n<b>                                  PAUL\n</b>              Sweetie, don't you worry about Raymond.\n\n<b>                                  MARGARET\n</b>              When he's around, it just brings back... Fuck.\n\n<b>                                  PAUL\n</b>              I know.  He, he said he's probably gonna head back\n              down South soon.\n\n      Margaret smiles, relieved.  The phone RINGS.  Paul picks up.\n\n<b>43    INT. MRS. WHERRY'S HOME - CONTINUOUS                                          43\n</b>\n      Mrs. Wherry talks on the phone in her kitchen.  The head of a large antelope is\n      mounted on the wall behind her.\n\n<b>                                  MRS. WHERRY\n</b>              Paul?  Thank you so much for clearing the drive way.\n              That was most considerate.\n\n<b>                                  PAUL\n</b>              I'm afraid I don't understand Mrs. Wherry.\n\n<b>                                  MRS. WHERRY\n</b>              You were out at the cabin this morning.  Nice to see\n              you getting some use out of that thing.\n\n<b>44    INT. PAUL'S KITCHEN                                                           44\n</b>\n      Paul shakes off his boots.\n\n<b>                                  PAUL\n</b>              Oh I see.  No, you see that must have been\n              Raymond.  (beat) Very much so.  No, no one was\n              more surprised than we were. (beat)  No, he's...\n              indisposed right now, but I'm sure you'll see him\n              again.  He's going to stay at the cabin for a while\n              until he... leaves.  And bless you too.\n\n<b>45    OMITTED                                                                       45\n</b><b>46    OMITTED                                                                       46\n</b>\n<b>47    EXT. WILDERNESS ROAD - NIGHT                                                  47\n</b>\n      A \"Moose Xing\" sign is briefly illuminated by Paul's car's headlights as it heads\n      up a snow packed mountain road.  The distant lights of the city are swallowed\n      by the thick forests of fir trees that line the road.\n\n<b>48    INT. PAUL'S CAR - CONTINUOUS                                                  48\n</b>\n      Paul, nervous, sings along to \"Escape\" on the radio.\n\n<b>                                  PAUL\n</b>              \"...It was my own lovely lady, and she said, oh it's\n              you...\"\n\n<b>A48   EXT. WILDERNESS ROAD / TURNOUT - NIGHT                                       A48\n</b>\n      Paul pulls off.  Kills his headlights.  Pops the trunk.\n\n<b>49    EXT. FOREST - LATER                                                           49\n</b>\n      The corpse, now in Raymond's clothing and the blue parka, lies face up on the\n      Aloha Airlines promotional surfboard being lurched forward by Paul, who wears\n      a pair of snowshoes.  On the body's chest lies a second pair of snowshoes.\n      Somewhere, a WOLF HOWLS.\n\n<b>50    EXT. TOP/BOTTOM OF A RIDGE - LATER                                            50\n</b>\n      Paul at the top of a 25 foot drop.  He rolls the corpse, now wearing the other set\n      of snowshoes, over the side.  It BOUNCES down, landing in the snow with a\n      soft WHUMPH!\n\n<b>51    OMITTED                                                                       51\n</b>\n<b>52    INT. PAUL'S HOME / KITCHEN - DAWN                                             52\n</b>\n      Paul sits in a seeming stupor at the kitchen table.  A DING from the microwave\n      snaps him out of his catatonic state.  He walks to the appliance, takes out his\n      now re-heated coffee, checks his watch and heads out.\n\n<b>53    EXT. TOP OF THE RIDGE / FOREST - MORNING                                      53\n</b>\n      Paul, wearing snowshoes and carrying the surfboard, peeks over the edge.\n\n      PAUL'S POV: down at the corpse, exactly as it was last night.\n\n<b>                                  PAUL\n</b>              Well come on!  How much easier do I have to make\n              this?\n\n      His words echo in the cold wilderness.\n\n<b>54    INT.  PAUL'S KITCHEN  - DAY                                                   54\n</b>\n      Jodie the dog is in a complete frenzy, jumping up and down at the feet of Paul\n      who stands over a SIZZLING frying pan full of bacon.  He checks the bacon's\n      consistency with a fork.  Still pretty raw.  He takes the bacon and lays it on a\n      plate.\n\n      Beside the pan on the counter sit a baseball cap and a stapler.  Paul carefully\n      takes each strip of bacon and staples it to the peak of the ball cap.  He holds it\n      up.  The bacon hangs down like fringe.\n\n      Margaret appears in the doorway.\n\n<b>                                  MARGARET\n</b>              Paul?\n\n<b>                                  PAUL\n</b>                        (startled)\n              Holy-- Margaret, you scared the wits out of me.\n\n      Margaret lifts up Jodie, who's desperately trying to get at the hat.\n\n<b>                                  MARGARET\n</b>              She just wants that bacon.\n\n<b>                                  PAUL\n</b>              Such a little puppy.  How late is \"Rudys\" open?\n\n<b>55    EXT. SHOPPING CENTER / RUDYS MARKET  - LATE AFTERNOON                         55\n</b>\n      A large sign outside advertises \"Fresh Moose Meat\". Paul runs out with a\n      shopping bag, jumps in his car and drives off.\n\n<b>56    EXT. BOTTOM OF THE RIDGE - SUNSET                                             56\n</b>\n      Paul, carrying the shopping bag, he painfully picks his way down the rock face\n      toward the corpse.\n\n<b>                                  PAUL\n</b>                        (really bad British accent)\n              You may want to take a gander.  You may want to\n              take a gander...\n\n<b>                                                                               CUT TO:\n</b>\n<b>57    EXT. BOTTOM OF THE RIDGE - SUNSET                                             57\n</b>\n      THE BACON HAT -- as Paul pulls it snug on the corpse's head.  He pulls the\n      bloody steaks from the shopping bag and starts to smear them on the corpse's\n      parka.  Drops of blood hit the snow at the body's feet and disappear.\n\n      Paul drapes the steaks on the body, tucking one under an arm, the other\n      hanging from a pocket. He pauses for moment, then pulls out a container of\n      lard and, fighting his own revulsion, smears it across the dead man's face.\n\n<b>                                  PAUL\n</b>              Sorry about this part.\n\n      Paul pats the body on the shoulder, then looks up at the ridge and the long\n      journey ahead.\n\n<b>58    EXT. BOTTOM OF RIDGE  - NIGHT                                                 58\n</b>\n      A WOLF appears in the moonlight.  Followed by another, and another.  They\n      approach the corpse...\n\n<b>59    EXT. HIGHWAY TURNOUT / CLEARING - DAY                                         59\n</b>\n      Snowmobiles SCREAM to the site as people tramp through the thick snow,\n      covering all of Paul's hard work.  An ambulance and State Conservation\n      vehicles pack the area where Paul first pulled off.  Yellow police tape is strung\n      between fir trees marking a path toward the ridge.\n\n<b>60    EXT. BOTTOM OF RIDGE  - DAY                                                   60\n</b>\n      The corpse is covered with a tarp.  The area is littered with blood, animal tracks\n      and bits of blue parka.  POLICE OFFICERS and tough looking LOCAL\n      SNOWMOBILERS mill about the corpse, taking turns lifting the tarp that covers\n      the body.  A few yards away, DETECTIVE BOYLE (60s) talks to a seemingly\n      distraught Paul.\n\n<b>                                  DETECTIVE BOYLE\n</b>                        (looking at the ridge)\n              If it's any comfort to you, he likely wasn't eaten while\n              conscious.  Did he say where he'd been living,\n              before he came home?\n\n<b>                                  PAUL\n</b>              Florida.  He didn't really talk about it much.  He\n              brought us this shell.\n\n      Paul holds up a sea shell, obviously from the display at his office.  Tears well\n      up in his eyes.\n\n                                  PAUL (cont'd)\n              It's really all we have left.  He'd been gone for five\n              years.  We'd given him up--\n\n<b>                                  DETECTIVE BOYLE\n</b>              --for dead, yes sir.\n\n<b>                                  PAUL\n</b>              How did you...?\n\n<b>                                  DETECTIVE BOYLE\n</b>              Anonymous phone tip from some Jamaican guy.\n                        (Paul shows no reaction)\n              Said he saw what looked like a body.  We tracked\n              you through his ID.\n\n<b>                                  PAUL\n</b>              Just like on TV.\n\n      Boyle nods sympathetically\n\n                                  PAUL (cont'd)\n              I've got to see him.  Please.\n\n      Paul starts to make his way to the body.  Boyle stops him.\n\n<b>                                  DETECTIVE BOYLE\n</b>              Mr. Barnell,  I should warn you, an animal  attack isn't\n              pretty.  There's not much left.\n\n      Paul nods.  They make their way over to the tarp.  Boyle pulls it back.\n\n                                  DETECTIVE BOYLE (cont'd)\n              Is that your brother, sir?\n\n      Paul leans in-- the man's face is hamburger.  Paul nods.\n\n<b>                                  PAUL\n</b>              They chewed his ears off.  What kind of animal does\n              something like that?\n\n<b>                                  DETECTIVE BOYLE\n</b>              Normally I'd say bear, but these tracks and the\n              feeding pattern indicate wolf.  It's rare, but it can\n              happen.\n\n      Boyle pulls the cover back over the body. Boyle hands Barnell a clear baggie\n      with the dead man's wallet inside.\n\n                                  DETECTIVE BOYLE (cont'd)\n              Your brother's personal effects.  We've got some\n              people with the victim's assistance program who\n              can help you through this.  Marcie?\n\n      Marcie, a female police officer, walks a distraught Paul away.  As they go,\n      another FEMALE COP approaches.\n\n<b>                                  FEMALE COP\n</b>              Coroner found some smaller bite marks on the\n              ankle.\n\n<b>                                  DETECTIVE BOYLE\n</b>              Pups.  Must have been the whole freakin' pack.\n\n<b>                                  FEMALE COP\n</b>              You want an autopsy?\n\n<b>                                  DETECTIVE BOYLE\n</b>              On what?\n\n<b>                                  FEMALE COP\n</b>              Derek found this.\n\n      She holds up a clear evidence bag with the remnants of a strip of bacon on the\n      inside.\n\n<b>                                  DETECTIVE BOYLE\n</b>              Not the smartest snack for a hiker.\n\n<b>                                  FEMALE COP\n</b>              Messy animals aren't they?\n\n<b>                                  DETECTIVE BOYLE\n</b>              Messy.  Messy messy messy messy.\n\n<b>61    INT. INFLATABLE GOLF DOME - LATE AFTERNOON                                    61\n</b>\n      The second level of a large indoor driving range/mini golf course.  The sound of\n      clubs SMACKING golf balls echo as an intense Ted \"waggles\" before his shot.\n      On his back-swing, Tiffany throws her arms around him from behind.\n\n<b>                                  TED\n</b>              I take it you're done?\n\n<b>                                  TIFFANY\n</b>              Yup.\n\n<b>                                  TED\n</b>              Wanna hit some of mine?\n\n<b>                                  TIFFANY\n</b>                        (hugging him harder)\n              Nope.\n\n      He turns, LAUGHING.  They kiss as she playfully starts to grope him.\n\n<b>                                  TED\n</b>              Now this is definitely a violation of Golf Dome policy.\n\n<b>                                  TIFFANY\n</b>              Must be all this talk about using your wood.\n\n<b>                                  TED\n</b>              Woods.  So maybe later I can... check your grip?\n\n<b>                                  TIFFANY\n</b>              Secret?\n\n<b>                                  TED\n</b>              My dirty talk sucks?\n\n<b>                                  TIFFANY\n</b>              I like it when you try, though.\n\n      Tiffany gives him a peck and flits back to a nearby chair.  He hits one, skying it\n      into a low hanging light.\n\n<b>                                  TED\n</b>              You know in some states they actually do this\n              outside?\n\n      Tiffany looks over at one of the tacky tropically-theme'd mini-golf holes.\n\n<b>                                  TIFFANY\n</b>              So how many insurance companies are there in the\n              United States?  Like, a billion.\n\n<b>                                  TED\n</b>              That's not the point, Tiff.  I've busted my ass for\n              Liberty Capital.  I don't want to quit.  I deserve to be\n              promoted out of this ice bound backwater.\n\n<b>                                  TIFFANY\n</b>              And when it happens, I guess I'll just be another\n              notch on your briefcase.\n\n<b>                                  TED\n</b>              I can't believe you said that.  You know you are...\n\n      He looks around.  Embarrassed, he lowers his voice.\n\n                                  TED (cont'd)\n              ...the most important thing in my life.\n\n<b>                                  TIFFANY\n</b>                        (smiling/shouting)\n              Sorry, what was that!  You want to take me right\n              here?\n\n      As other GOLFERS look over, Tiffany and Ted share a warm smile, the moment\n      only broken by the ringing of a CELL PHONE.  She SIGHS, unzips Ted's gym\n      bag and answers his phone.\n\n                                  TIFFANY (cont'd)\n              Psychic... Uhm, sorry, hello?  Yeah.  Look, is this a\n              matter of life and death, because right now he's...\n\n      Suddenly concerned, she hands the phone to Ted.\n\n<b>                                  TED\n</b>              Hello? (beat)  You're kidding me.\n                        (almost stunned)\n              Yeah, I'll hold.\n\n<b>                                  TIFFANY\n</b>              Your Mom?\n\n<b>                                  TED\n</b>              Million dollar life policy just checked.\n\n<b>                                  TIFFANY\n</b>              On a Saturday?  What about the first annual golf, sex\n              and pizza triathlon?\n\n<b>                                  TED\n</b>              Look, if this is... who I think it is, I may have found us\n              a ticket out of here.\n\n<b>                                  TIFFANY\n</b>              We don't need a ticket.\n\n      Tiffany stands, knowing it's no use arguing, she pulls on her coat.  Ted tries to\n      give her a hug.  She falls into his embrace, but doesn't hug him back.\n\n                                  TIFFANY (cont'd)\n              Don't be late, OK?\n\n<b>                                  TED\n</b>              You won't even know I'm gone.\n\n      CORPSE'S POV:  Black.  The drawer is pulled open.  We are...\n\n<b>62    INT. CITY MORGUE (BODY TRAY)                                                  62\n</b>\n      Ted, Cam and Detective Boyle stand at the end near the feet.  A white sheet\n      covers most of the deceased.\n\n<b>                                  DETECTIVE BOYLE\n</b>              That's him.  Raymond Barnell.\n\n<b>                                  TED\n</b>              Could you?\n\n      Boyle moves toward the head and pulls back the covering.  Ted recoils.  Cam\n      leans in for a closer look.\n\n<b>                                  CAM\n</b>              Ouch.  That's gotta hurt.\n\n<b>                                  TED\n</b>              So what's your line on this?\n\n<b>                                  DETECTIVE BOYLE\n</b>              Just what it looks like.  Wolves got him. Maybe a\n              grizzly with insomnia, but we didn't find any tracks.\n\n<b>                                  TED\n</b>              Would it surprise you to learn his brother tried to\n              cash in his policy two weeks ago?\n\n<b>                                  DETECTIVE BOYLE\n</b>              You trying to tell me Mr. Barnell chewed off his\n              brother's leg?\n\n<b>                                  TED\n</b>              Doesn't that make you the least bit suspicious?\n\n<b>                                  DETECTIVE BOYLE\n</b>              Mr. Watters, this is a nice simple ending.  We like\n              nice simple endings.\n\n<b>                                  TED\n</b>              But shouldn't you--\n\n<b>                                  DETECTIVE BOYLE\n</b>              Ya know, I don't know thing one about insurance, but\n              I'm guessing it's your job\n              to find a way not to pay these poor people.\n\n<b>                                  CAM\n</b>              Hey now, we're just like you guys, gotta run down\n              whatever leads we can find.\n\n      Ted walks down to the head of the victim, pulls out a camcorder and starts to\n      tape the body.\n\n<b>                                  TED\n</b>              Detective, we're an insurance company, not the\n              Salvation Army.\n\n<b>                                  DETECTIVE BOYLE\n</b>              Mind telling me what you're doing?\n\n<b>                                  CAM\n</b>              They gave every claims team a video camera last\n              quarter... you'd be amazed at how it cuts down on\n              litigation.  We had this case two months ago where\n              this mother of six was claiming...\n\n<b>                                  DETECTIVE BOYLE\n</b>              I've got my own war stories, thanks.  You mind\n              stopping that?\n\n<b>                                  TED\n</b>              Just doing --\n\n<b>                                  DETECTIVE BOYLE\n</b>              Your job?  Yes, I caught that.\n\n      As Ted gets his last shot, Boyle covers the body back up and slides the drawer\n      shut with a loud CLANG.  Black.\n\n<b>63    EXT. PAUL'S HOUSE - SUNSET                                                    63\n</b>\n      TV NEWS CAMERA POV: Of Paul, standing on his stoop, as he's interviewed by\n      a well made-up female TV REPORTER (20s) dressed for the cold.\n\n<b>                                  TV REPORTER\n</b>              You ready Mr. Barnell?\n\n<b>                                  PAUL\n</b>              Yes.\n\n      The camera man flicks on his light as Paul squints.\n\n<b>                                  TV REPORTER\n</b>              The police told us what happened, how are you folks\n              holding up?\n\n<b>                                  MARGARET (O.S.)\n</b>              Paul?  Who's out there?\n\n      Paul reaches back, and, as discretely as possible, grabs the door handle to\n      keep Margaret from opening it.\n\n<b>                                  PAUL\n</b>              Obviously, my wife's very upset...\n\n<b>                                  MARGARET (O.S.)\n</b>              Paul, the door's stuck!\n\n      Margaret starts to HAMMER rhythmically on the door.\n\n<b>                                  PAUL\n</b>                        (ignoring her)\n              It's been a tough, you know, when something like\n              this happens you just have to ask yourself...\n\n<b>                                  MARGARET (O.S.)\n</b>              Who fucked with the fucking door!\n\n<b>                                  PAUL\n</b>              You can see how stressful it's been, I should really\n              go now.  We have to plan a service.\n\n      And with that, Paul opens his front door and ducks inside, quickly shutting it\n      behind him.\n\n<b>64    INT. BRANCH'S OFFICE - DAY                                                    64\n</b>\n      Branch, very unhappy, flips through some papers then looks up at Ted and\n      Cam.\n\n<b>                                  TED\n</b>              This isn't a standard case.  You were there when\n              this guy came in looking to cash in.  C'mon, it stinks.\n\n<b>                                  BRANCH\n</b>              Secondly, if the police say this guy was...\n\n<b>                                  CAM\n</b>              Eaten by wolves.  Sir.\n\n<b>                                  BRANCH\n</b>                        (incredulous)\n              Eaten by wolves, then we've got no case.  Did you\n              see Mr. Barnell on the news last\n              night?  Last thing we need is bad P.R.  I don't want\n              this thing Valdeez-ing on us.\n\n<b>                                  TED\n</b>              Mr. Branch, I'm sure head office would take a rather\n              dim view of our --\n\n<b>                                  BRANCH\n</b>              Corporate's view will be whatever I tell them.\n\n      Cam, seeing his partner is about to get himself into a heap of trouble, hustles\n      him toward the door.\n\n<b>                                  CAM\n</b>              Yes Sir.  Color us called off, as of now.\n\n<b>65    INT. INSURANCE OFFICE - MOMENTS LATER                                         65\n</b>\n      Ted and Cam walk through the cubicles.\n\n<b>                                  TED\n</b>              Stop looking at me right now.\n\n<b>                                  CAM\n</b>              You've got a strange way of bucking for a promotion,\n              my friend.\n                        (off Ted's look)\n              Look, I'm gonna start on the Johnasen file.  You want\n              to do up the paper work on Barnell?\n\n      Ted grabs his coat.\n\n                                  CAM (cont'd)\n              Where ya going?\n\n<b>                                  TED\n</b>              Lunch.\n\n<b>                                  CAM\n</b>              At 9:30?\n\n      Ted is out the door.\n\n<b>66    INT. \"BARNELL GREAT ESCAPES TRAVEL\" - DAY                                     66\n</b>\n      Ted sits across the desk from Paul.  As per usual, the place is a tomb.\n\n<b>                                  TED\n</b>              The police say they found Raymond's wallet, that's\n              how they tracked you down?\n\n<b>                                  PAUL\n</b>              That's right, yes.\n\n<b>                                  TED\n</b>              Any idea what he was doing out there?\n\n<b>                                  PAUL\n</b>              He'd go for walks.  Hikes, I mean.  Hiking.\n\n<b>                                  TED\n</b>              How sporty.  Was he a big hiker?\n\n<b>                                  PAUL\n</b>              Not sure I follow.\n\n<b>                                  TED\n</b>              Did he hike more than once a week?  Or was this a...\n              one time thing?\n\n<b>                                  PAUL\n</b>              Can I ask why you need to know all this?\n\n<b>                                  TED\n</b>              Just trying to tie up a few loose ends.\n\n<b>                                  PAUL\n</b>              You know the police... they say Raymond died in the\n              attack.  You do cover that sort of thing don't you?\n\n<b>                                  TED\n</b>                        (forced smile)\n              Yes sir.  It shouldn't take more than a few days.\n              Now, tell me a little more about your brother.  The\n              hiker.\n\n<b>67    EXT. STRIP MALL PARKING LOT - MOMENTS LATER                                   67\n</b>\n      Gary and Jimbo's car parked in the lot.  Gary is just returning to the vehicle with\n      a brown paper bag.  Jimbo has the look of man who hasn't slept in days.\n\n      Gary and Jimbo are eating fish and chips.  The name on the bag is \"Ye' Olde\n      Fish Shoppe.\"\n\n<b>                                  JIMBO\n</b>              Cod or Halibut?\n\n<b>                                  GARY\n</b>              Didn't ask.\n\n<b>                                  JIMBO\n</b>                        (digging in)\n              So we got six different stores here. We got your\n              \"Great Escapes\" travel agency, your Ye Old Fish and\n              Chips place, Porn-a-Copia videos, a hair place, one\n              for lease and one... what is that?\n\n<b>                                  GARY\n</b>              Small engine repair.  See all the snow blowers out\n              front.\n\n      There is indeed a row of snowblowers lined up outside.  Jimbo takes another\n      bite of his fish.\n\n                                  GARY (cont'd)\n              Should move the blowers over to the triple X store.\n\n      Gary LAUGHS.  Jimbo is in no mood.\n\n<b>                                  JIMBO\n</b>              So, which one you figure would want to take our\n              friend?\n\n<b>                                  GARY\n</b>              I guess maybe the porn palace.  Ya know for some\n              weird sex film.\n\n<b>                                  JIMBO\n</b>              Yeah, this place is just a hotbed of adult cinema\n              production.  Fish shop look clean?\n\n<b>                                  GARY\n</b>              Very nice Korean family.  You figure maybe they\n              battered him up?\n\n      Gary LAUGHS again, then shoves Jimbo's shoulder.\n\n                                  GARY (cont'd)\n              Maybe we're eatin' him right now.  Huh?\n\n<b>                                  JIMBO\n</b>              Gary, this isn't a joke.  You ever known Dave to joke?\n\n      Gary, embarrassed, takes another bite of his fish.  Jimbo turns up the radio.  A\n      local call-in show comes on.\n\n<b>                                  WOMAN CALLER (O.S.)\n</b>              ...it could never happen.  There's never been a\n              documented case--\n\n<b>                                  GARY\n</b>              Sorry.\n\n<b>                                  JIMBO\n</b>              Yeah, \"Sorry.\"  I get strip searched and you go off\n              playing snow angels...\n\n<b>                                  RADIO HOST (O.S.)\n</b>              Well, we've got one now, don't we!?\n\n<b>                                  WOMAN CALLER (O.S.)\n</b>              That was different. From what I read in the paper he\n              was unconscious. And now people are going to use\n              this as an excuse to--\n\n<b>                                  RADIO HOST (O.S.)\n</b>              Hey lady, why don't you tell Raymond Barnell how\n              wolves have gotten a bad rap.\n\n<b>                                  WOMAN CALLER (O.S.)\n</b>              I can tell you from years of experience that wolves do\n              not operate--\n\n<b>                                  JIMBO\n</b>              Wait a minute.\n\n<b>                                  RADIO HOST (O.S.)\n</b>              You can tell me all you want, lady, but it is an\n              undeniable, indisputable fact.  This Barnell guy got\n              turned into a Scooby Snack by a pack of wild\n              animals...\n\n      JIM'S POV: Through the windshield, looking at the sign for \"Barnell Great\n      Escapes Travel.\"  Jimbo and Gary look at each other. Maybe...\n\n<b>68    INT. INSURANCE OFFICE - DAY                                                   68\n</b>\n      Ted at his cubicle on his phone.\n\n<b>                                  TED\n</b>              Yeah, hi, it's Ted Watters from Fidelity Mutual. (beat)\n              I need a complete credit work up on a Raymond\n              Barnell... and Paul, a Paul Barnell too... sure, I'll hold.\n\n      Cam walks by, leans his head over the top of the cubicle.\n\n<b>                                  CAM\n</b>              You start the month ends yet?\n\n<b>                                  TED\n</b>              Can you take care of it?  I'm kinda... working on\n              something.\n\n<b>                                  CAM\n</b>              Oh God, you're not still on the Barnell thing are you--\n\n      Ted pulls Cam down into his cubicle, talks in a harsh whisper.\n\n<b>                                  TED\n</b>              I went to see him.\n\n<b>                                  CAM\n</b>              And?  Then?  So?\n\n<b>                                  TED\n</b>              Trust me. Something's not right.  I can smell it.  Help\n              me buy a week.\n\n<b>                                  CAM\n</b>              We're gonna get in such trouble.\n\n<b>                                  TED\n</b>              I promise from now on you can come along on\n              everything.\n\n<b>                                  CAM\n</b>              No more Cam goes to the coffee room and Ted\n              disappears for three hours?\n\n<b>                                  TED\n</b>              I'll try.\n\n<b>                                  CAM\n</b>              And you'll work on your interpersonal skills?\n\n<b>                                  TED\n</b>                        (a long beat)\n              Yes.\n\n<b>                                  CAM\n</b>              Good.  Now if you'll excuse me, I'll go start covering\n              your ass.\n\n<b>69    INT. BARNELL HOME / STUDY - EVENING                                           69\n</b>\n      Paul sits beside his desk, flipping through travel brochures. Margaret enters,\n      teetering in the doorway.  Paul looks up.\n\n<b>                                  PAUL\n</b>              Hey.  How's my Princess?\n\n<b>                                  MARGARET\n</b>              OK.  I took some Adavan.  And called my psychic.\n\n<b>                                  PAUL\n</b>                        (picks up the phone bill)\n              Honey, you know how expensive that is.  I thought we\n              agreed that...\n\n      She moves to him, runs her hand through his hair.\n\n<b>                                  MARGARET\n</b>              Don't be mad.  It's just... this week has been so...\n              well with Raymond getting eaten by animals and\n              someone trying to steal the fridge.\n\n<b>                                  PAUL\n</b>              I know.  Why don't you --\n\n<b>                                  MARGARET\n</b>              We got another letter from the HMO today.\n\n<b>                                  PAUL\n</b>              Have you opened it yet?\n\n      Margaret starts to CRY, holding the letter up to her face the SOBS building to a\n      full blown breakdown.\n\n                                  PAUL (cont'd)\n              Oh hey honey, come on now.\n\n<b>                                  MARGARET\n</b>              I'm sorry.  It's just, fucking cocksuckers.\n\n      Paul takes the letter, unfolds it and reads...\n\n<b>                                  PAUL\n</b>              \"As we have stated previously... usual onset before\n              the age of 18... coupled with no genetic history...\"\n\n<b>                                  MARGARET\n</b>              I'm sick!  I'm really, really sick!\n\n<b>                                  PAUL\n</b>              Shush, now.  (reading again) \"We hasten to add,\n              Tourette Syndrome is not...\"\n\n<b>                                  MARGARET\n</b>              Fuck them.\n\n      Paul is about to say something, but returns to the letter.\n\n<b>                                  PAUL\n</b>              \"As well, please reference our previous decisions\n              regarding your claims for ADD, ODO, OCD,\n<b>              ADHOPHI...\n</b>                        (treading lightly)\n              Honey.  I know you don't like to talk about it, but\n              maybe it's not... what we might think it is but... maybe\n              it's just stress?  Remember that cruise?  I saw you.\n              You were happy.\n\n      Margaret looks at him, crestfallen.\n\n                                  PAUL (cont'd)\n              I'm sorry.  I'm just really tired.\n\n<b>                                  MARGARET\n</b>              They say you can't get it all of a sudden but I did.  I\n              really, really did.\n\n<b>                                  PAUL\n</b>              I know.  They just don't --\n\n<b>                                  MARGARET\n</b>              I'll kill myself.  Then they'll see.\n\n<b>                                  PAUL\n</b>              That is nonsense talk.\n\n<b>                                  MARGARET\n</b>              Then you can go off and...\n                        (sobbing again)\n              ...marry someone normal.\n\n<b>                                  PAUL\n</b>              You're the most normal girl I know.\n\n<b>                                  MARGARET\n</b>              I'm not crazy, Paul.  Something's really wrong with\n              me.\n\n      He takes her to a small sofa, cradles her in his arms.\n\n<b>                                  PAUL\n</b>              I know, Sweetie.  I know.  And we're gonna find you\n              the best specialists in...\n                        (a second, then confident)\n              ...what you have that we can.\n\n<b>                                  MARGARET\n</b>              Promise?\n\n<b>                                  PAUL\n</b>              I really think things are going to turn around.  Call me\n              cr... I just have a feeling.  You just leave everything to\n              me, OK?  Is that OK?  Leave everything to me?  I\n              promise.\n\n<b>                                  MARGARET\n</b>                        (gently)\n              Shit bag.\n\n<b>                                  PAUL\n</b>              That's my girl.\n<b> \n</b><b>                                                                               CUT TO:\n</b>\n<b>      TIGHT ON : TV SCREEN\n</b>\n<b>70/71 INT. TED'S APARTMENT - NIGHT                                               70/71\n</b>\n      Where Edward G. Robinson (as the character Keyes in \"Double Indemnity\")\n      grills a man about a fake insurance claim.\n\n<b>                                  EDWARD G. ROBINSON\n</b>              \"Every time one of these phonies comes along it ties\n              knots in my stomach... I can't eat.  That's how I knew\n              your claim was crooked...\"\n\n      At the sound of DOORBELL, the whole scene freezes.  We are --\n\n      Tiffany at her desk, working on the computer.  Ted has paused the DVD, puts\n      down the Barnell file and opens the door on a snow covered PIZZA GUY, soggy\n      pizza box in hand.\n\n<b>                                  TED\n</b>              Hey.\n\n<b>                                  PIZZA GUY\n</b>              Hi there.  That'll be $12.97.\n\n      Ted looks at his watch.\n\n<b>                                  TED\n</b>              What about thirty minutes or free?\n\n<b>                                  PIZZA GUY\n</b>              Doesn't apply when it's snowing.\n\n<b>                                  TED\n</b>                        (digging out his wallet)\n              So nine months of the year your guarantee is\n              worthless?\n\n<b>                                  PIZZA GUY\n</b>              It doesn't snow every day.\n\n<b>                                  TED\n</b>              They should really tell people when they order.\n\n<b>                                  TIFFANY\n</b>              Would you just give him the money already?\n\n<b>                                  PIZZA GUY\n</b>              It's not my decision.\n\n<b>                                  TED\n</b>              I know that.  I'm just saying.\n\n<b>                                  PIZZA GUY\n</b>              Sure.\n\n<b>                                  TED\n</b>              You understand though?\n\n<b>                                  PIZZA GUY\n</b>              Absolutely.\n\n<b>                                  TED\n</b>              It wouldn't take much.\n\n<b>                                  PIZZA GUY\n</b>              Full disclosure to the pizza consumer. I'll be sure to\n              pass that along.\n\n      The delivery guy leaves.\n\n      Ted walks back into the living room.  Tiffany comes over, grabs a slice.\n\n<b>                                  TIFFANY\n</b>              Why you gotta argue with the service industry?\n\n<b>                                  TED\n</b>              The problem with people today is they don't expect\n              anyone to tell the truth.\n              We've just come to accept lying as acceptable.\n\n<b>                                  TIFFANY\n</b>              If this is another passive/aggressive shot at Psychic\n              Buddies, all our ads state \"for amusement purposes\n              only.\"\n\n<b>                                  TED\n</b>              Tiff, it has nothing to do with... look, just forget it.\n\n<b>                                  TIFFANY\n</b>              You remember being amused, don't ya, honey?\n              What is with you anyway?\n\n<b>                                  TED\n</b>              Want to know what's \"with\" me?  I'm on the verge of\n              cracking the biggest case of my career, one that\n              corporate has to notice, and nobody gives a crap.\n              Not my boss, and not even my girlfriend.\n\n<b>                                  TIFFANY\n</b>              So this is my fault?\n\n<b>                                  TED\n</b>              No, it's not your fault. I just want to live somewhere\n              where road hazards don't have antlers and the pizza\n              doesn't have to be delivered by dogsled.\n\n      Tiffany storms off as Ted flops onto the couch, swipes the snow from the top of\n      the pizza box and hits play on the DVD.\n\n<b>                                  EDWARD G. ROBINSON\n</b>              \"What kind of outfit is this, anyway?  Are we an\n              insurance company or a bunch of dim-witted\n              amateurs to write a policy on a mug like that?\"\n\n      Tiffany turns from the bedroom door, almost in tears.\n\n<b>                                  TIFFANY\n</b>              You know, even though Edward G. Robinson wins,\n              everyone like Fred MacMurray better.\n\n      She SLAMS the door.  Ted doesn't move, lost in his own world.\n\n<b>72    INT. MRS. WHERRY'S HOUSE / LIVING ROOM - DAY                                  72\n</b>\n      Ted and Mrs. Wherry sit on plastic covered furniture.  The mounted heads of\n      several dozen dead animals, foxes, wolves, elk, surround them.  Ted takes\n      notes.\n\n<b>                                  MRS. WHERRY\n</b>              It was terrible.  Just terrible. Raymond should have\n              known better.\n\n<b>                                  TED\n</b>                        (re: the mounted heads)\n              All these yours?\n\n<b>                                  MRS. WHERRY\n</b>              Greatest sport on earth.  Moved to a compound bow\n              two years ago.\n                        (whisper)\n              Arthritis.  Less draw weight.\n\n      She mimics pulling back an imaginary bow with her bony hand.\n\n                                  MRS. WHERRY (cont'd)\n              Coffee OK?\n\n<b>                                  TED\n</b>              I'm fine.  Did you talk to Raymond at all when he\n              came home?  Was he getting along with his\n              brother?\n\n<b>                                  MRS. WHERRY\n</b>              No.  Only saw him the once.  Never spoke.  Waved to\n              him.\n\n<b>                                  TED\n</b>              Waved?\n\n<b>                                  MRS. WHERRY\n</b>              He was clearing my driveway.  Raymond was a real\n              hellcat when he was younger.  But like they say, time\n              mellows even the hardest soul.\n\n<b>                                  TED\n</b>              Was he much of an outdoorsman?\n\n<b>                                  MRS. WHERRY\n</b>              I thought it was Paul at first.  Have you met Paul's\n              wife?  Now there's a story.  Not that I'm much for\n              gossip, but I think Raymond used to have a --\n\n<b>                                  TED\n</b>              Mrs. Wherry, I'm sorry, but --\n\n<b>                                  MRS. WHERRY\n</b>              Sorry.  Did Raymond like the outdoors.  Not so\n              much, no.  Liked living out here at the cabin, though.\n              I think he had some friends on the police force.\n              Have you talked to them?  They'd pull up here day\n              and night, always looking for --\n\n<b>                                  TED\n</b>              I'm sorry, did you say you thought it was Paul who\n              did your driveway?\n\n<b>                                  MRS. WHERRY\n</b>              Well in a ski mask you can hardly tell who's who.\n              Now, how 'bout some jerky?  I've got it drying out\n              back.\n\n<b>73    INT. INSURANCE OFFICE - DAY                                                   73\n</b>\n      Ted at his cubicle, thinking hard as he chews on some jerky as he works the\n      phone.  Snow whips by outside the window.\n\n<b>                                  TED\n</b>                        (just waiting to cut in)\n              That's really super, Simon.  Now how'd you like to\n              run some names for me?\n\n      Ted sees Cam reflected in his dark computer screen.  Annoyed, he puts his\n      hand over the receiver.\n\n                                  TED (cont'd)\n              You mind?\n\n<b>                                  CAM\n</b>              Now, now.  Let's not forget who's pulling double duty.\n\n<b>                                  TED\n</b>                        (hanging up)\n              Simon, I'll call you back.\n                        (to Cam: forced)\n              Sorry.\n\n<b>                                  CAM\n</b>              Much better.  So?\n\n<b>                                  TED\n</b>              Turns out our Mr. Barnell is mortgaged to the nuts.\n              His business is about one step\n              away from chapter 11.  Plus it's like his brother\n              Raymond never existed.  He's got no credit history,\n              no nothing for the last five years.\n\n<b>                                  CAM\n</b>              Ya know, not having a credit history isn't actually a\n              crime.  People around here have been known to\n              swap a snow mobile for 500 pounds of venison.\n              Doesn't exactly leave a paper trail.\n\n<b>                                  TED\n</b>              Yes, but he was in Florida, someplace.  Plus, the\n              only thing he did after his recent \"reappearance\" was\n              get some new ID and a new credit card.  Didn't\n              charge anything.\n\n<b>                                  CAM\n</b>              Wow.  Less than nothing.\n\n<b>                                  TED\n</b>              It's something.\n\n<b>                                  CAM\n</b>              No it's not... in my humble, junior investigator's\n              opinion.\n\n      The phone RINGS.  Ted picks up.\n\n<b>                                  TED\n</b>              Watters, claims.  Yeah, hang on...\n                        (to Cam)\n              It's personal.  I promise.\n\n      Cam shrugs, walks off.  Ted waits 'til he's gone...\n\n                                  TED (cont'd)\n              Mr. Barnell... Your ears must have been burning, I\n              was just -- sure, what time?\n\n      Ted is scribbling down something on a pad of paper.\n\n<b>74    EXT. GRAVEYARD - DAY (FULL ON BLIZZARD)                                       74\n</b>\n      Tombstones, barely visible through the blowing snow, dot the top of a small hill\n      on the outskirts of town.  A small group of mourners try to keep warm.  Paul and\n      Margaret, Avis, two other FRIENDS and the MINISTER huddle against the cold.\n\n<b>                                  MINISTER\n</b>              When someone is taken from us at such a young\n              age we often ask ourselves, why?  What possible\n              purpose could this serve?\n\n      The Minister is temporarily lost from view.\n\n                                  MINISTER (cont'd)\n                        (just a voice in the white)\n              Why is God, who is a loving God, capable of such\n              things...\n\n      The snow clears.  Paul, a pillar of strength, discreetly checks his watch then\n      sneaks a concerned look at Margaret who busily grins at everyone in sight.\n      Ted's car pulls into the parking area.\n\n<b>75    INT. JIMBO'S CAR / GRAVEYARD PARKING LOT - CONTINUOUS                         75\n</b>\n      Gary and Jimbo sit in their vehicle, watching as Ted gets out of his car and is\n      swallowed in a white out.  He reappears a moment later farther up the hill.\n\n<b>                                  GARY\n</b>              We should have checked the funeral\n              announcements right away.\n\n<b>                                  JIMBO\n</b>              Shoot.\n\n<b>76    EXT. GRAVEYARD                                                                76\n</b>\n      A wind GUST rocks the casket just as it's lowered into the frozen earth.  The\n      funeral breaks up quickly as Paul and his wife shake hands with the minister.\n\n<b>                                  PAUL\n</b>              That was lovely, thank you so much.\n\n<b>                                  MINISTER\n</b>              Margaret, Paul, you two get some sleep.\n\n      Paul looks nervously at Margaret, who is about to reply.  As her mouth\n      engages, a gust of wind obliterates most of her words, except for...\n\n<b>                                  MARGARET\n</b>              ...nun banger.\n\n      The Minister smiles, he must have misunderstood.\n\n<b>                                  MINISTER\n</b>              Absolutely.\n\n      Paul turns to see Ted approaching.  A blast of snow obscures his view.  When\n      Ted reappears, he's just a few steps away.\n\n<b>                                  TED\n</b>              Mr. Barnell.  There was no hurry on this, we could\n              wait until--\n\n<b>                                  PAUL\n</b>              It's OK.  We just wrapped up.  This is my wife,\n              Margaret.\n\n      As they shake hands, and Margaret opens her mouth to speak...\n\n                                  PAUL (cont'd)\n              Why don't you wait in the car, sweetheart?\n\n<b>                                  MARGARET\n</b>              Okee dokee, smokee.\n\n      Margaret smiles and totters off.\n\n<b>                                  PAUL\n</b>              She's under a little strain right now.\n\n      Ted looks down the hill at a small group of TV news vans, the REPORTERS\n      just now venturing out into the cold.\n\n<b>                                  TED\n</b>              I see the media's here.  They don't give people a\n              moment's peace, do they?\n\n<b>                                  PAUL\n</b>              I called them.\n\n<b>                                  TED\n</b>                        (surprised)\n              Really?\n\n<b>                                  PAUL\n</b>              Well, they've been asking me to talk some more\n              about Raymond.  I thought now might be an\n              appropriate time.\n\n<b>                                  TED\n</b>              And you'll just happen to mention your heartless\n              insurance company that hasn't paid off your policy\n              yet.\n\n<b>                                  PAUL\n</b>              I had to borrow money for the casket, Mr. Ted.\n\n<b>                                  TED\n</b>              You are breaking my heart.\n\n<b>                                  PAUL\n</b>              No, I doubt that.  They asked me to bring some\n              photos of Raymond.  Guess it's gonna be a pretty\n              big story.\n\n      He pulls out some shots of his brother.  They whip around in the wind and\n      blowing snow.\n\n                                  PAUL (cont'd)\n              Of course, we could walk over there together.  You\n              could tell them how deeply moved you were by this\n              tragedy and how... the check is on its way?\n\n      Ted thinks, grudgingly impressed with Paul's ploy.\n\n<b>                                  TED\n</b>              Enjoy your press conference, Mr. Barnell.\n\n      Paul stuffs the photos back in his pocket and walks down the hill.  Ted watches\n      him go, is about to leave when a gust of wind forces him to avert his eyes.\n      Looking down he sees a photo of Raymond Barnell, on the beach in swim\n      trunks.  Must have fallen.  Ted pockets it and moves on.\n\n<b>A76   INT. GARY'S APARTMENT - NIGHT                                                A76\n</b>\n<b>                                  JIMBO\n</b>              That's your plan?\n\n<b>                                  GARY\n</b>              How tough can it be?\n\n<b>                                  JIMBO\n</b>              You ever try digging through six feet of half frozen\n              sod?  We'd need a back hoe.  Can you operate a\n              back hoe?  Do you know where we'd get a back\n              hoe?  We don't even know for sure...\n\n<b>                                  GARY\n</b>              Oh please.  Don't you think it's a pretty neat\n              coincidence?\n\n<b>                                  JIMBO\n</b>              Maybe we just go explain it to Dave.\n\n<b>                                  GARY\n</b>              He won't take it well.\n\n<b>                                  JIMBO\n</b>              Then I'm all for new options, here, Gary. (beat)  If we\n              give the money back--\n\n<b>                                  GARY\n</b>              Hey, wait a minute, now.  We did the job.  We\n              deserve the--\n\n<b>                                  JIMBO\n</b>              I did the job, Gary.  I know, because I haven't been\n              sleeping for the last week.\n\n<b>                                  GARY\n</b>              I don't know why you're letting it get to you like this.\n              Look, let's just not rush into anything.  It's my turn to\n              step up.  I know that.  I'm on it.\n\n      They look on as Paul is interviewed by the reporters.\n<b>77    OMITTED                                                                       77\n</b>\n<b>78    INT. PAUL'S HOME / KITCHEN - MORNING                                          78\n</b>\n      Margaret washes down some pills with her morning coffee as she looks at a\n      fawn in the backyard, nibbling on a bush.\n\n<b>                                  MARGARET\n</b>              Hey little, Bambi.  Where's your Mommy?  Gettin' it\n              from some ten point buck.  Yes she is.  Yes she is.\n\n      Just then, a THUMPING sound from the garage causes the fawn to bolt.\n      Margaret turns, suspicious.  She picks up the portable phone as she moves\n      toward the door.\n\n<b>79    INT. GARAGE                                                                   79\n</b>\n      Gary sticks his head inside the now unchained fridge, grabs a can of soda\n      from the door rack and closes the door.  A moment later, he reopens the door...\n\n      There, hanging off the frosty inside, is a chunk of the dead man's hair and\n      scalp.  Gary pulls it off, not sure what it means, but sure it means something.\n\n      Unseen behind him, Margaret steps into the garage.  She quickly assesses\n      the situation.\n\n<b>                                  MARGARET\n</b>              Stay away from our fucking appliances.\n\n      Gary spins, shocked to see Margaret.\n\n<b>                                  GARY\n</b>              Lady, just calm down.\n\n      Margaret, eyes wide with fear, unleashes a hailstorm of soda cans,\n      knickknacks, gardening implements and anything else she can lay her hands\n      on.\n\n                                  GARY (cont'd)\n              Hey!  Would you... Lady... I have a--\n\n      He tries to close in on her, but the torrent of stuff (a rake, a Whipper-Snipper,\n      an old pair of skates...) keeps him pinned down.  Finally, he manages to grab his\n      gun from his pocket.  But even as he raises it...\n\n      A Bissel Handvac catches him flush in the face.\n\n                                  GARY (cont'd)\n              Sud of a bit!\n\n      He drops to his knees, grabbing his nose, which is now gushing blood.\n      Margaret reaches for her portable phone and starts punching numbers.\n\n<b>                                  MARGARET\n</b>              You are in so much trouble.\n\n      Gary stands, pissed off, gun aimed at Margaret's head.\n\n<b>                                  GARY\n</b>              Lady, so help me I --\n\n      Gary ducks as the phone whizzes over his head and smashes against the\n      garage wall.  He stares at her.  Game over.\n\n<b>80    INT. WAREHOUSE - DAY                                                          80\n</b>\n      A standard corrugated metal storage facility.  Snow falls in from a large hole\n      that's been cut in the roof.  Cam and Ted, clipboard in hand, stand by the\n      owner, MR. SPELLMAN (50s).\n\n<b>                                  CAM\n</b>              So you're a souvenir wholesaler?\n\n<b>                                  SPELLMAN\n</b>              For the cruise ship trade, mostly.  Usual stuff, stuffed\n              animals, your huskies, your moose, your baby seals,\n              your whales, your walrus --\n\n<b>                                  TED\n</b>              They came in through there?\n\n<b>                                  SPELLMAN\n</b>                        (looking up/duh!)\n              Yeah.  Through that... big hole in the roof.  I got a list\n              of all the things that are missing.\n\n      Ted stares up at the sky through the ceiling.\n\n<b>                                  TED\n</b>              How much?\n\n<b>                                  SPELLMAN\n</b>              Uh, we figure about 200,000, plus fixing the roof.\n              Now I know you guys are gonna bust my --\n\n<b>                                  TED\n</b>              Fax over your estimate.  We'll have you a check by\n              Friday.\n\n<b>                                  CAM\n</b>                        (taking Ted aside)\n              Ted.  Maybe we should take a look at their inventory\n              list first?\n\n<b>                                  TED\n</b>              This is a simple case, Cam.  Bad guys, through roof,\n              stole stuff.  Let's clear it and get going.\n\n<b>                                  SPELLMAN\n</b>              I should tell you... we also had some VCRs we were\n              holding for another company.  That could run\n              another couple of...\n\n<b>                                  TED\n</b>              Cam?  You wanna wrap this up?\n                        (off his look)\n              Gotta go primary some time.\n\n      Cam shrugs-- \"sure.\"  Ted hands him his clipboard and walks out, the door\n      closes behind him with a loud BANG.\n\n<b>                                  CAM\n</b>              Mr. Spellman?  Now I noticed a nice looking\n              computer in your office.  Why do you think they left\n              that?\n\n<b>81    INT. BARNELL HOME / LIVING ROOM - LATER                                       81\n</b>\n      Margaret sits taped to a Lazy-Boy recliner.  Gary, who's still bleeding from the\n      nose, sits across from her.\n\n<b>                                  MARGARET\n</b>              You try and rape me, I swear to Christ I'll bite it off.\n\n      Gary looks confused.  The doorbell CHIMES, playing \"Tiny Bubbles.\"  (We stay\n      in the living room as Gary answers it.)\n\n<b>                                  JIMBO (O.S.)\n</b>              What's going on?\n\n<b>                                  GARY (O.S.)\n</b>              Okay, now here's the thing, just keep an open mind.\n\n      They both enter the room.  Jimbo looks at Gary, is about to smack him when...\n\n<b>                                  MARGARET\n</b>              So what now, you gonna get me smokin' from both\n              ends?\n\n      Gary and Jimbo have no idea how to react.  Margaret senses their discomfort,\n      starts to relax.\n\n<b>                                  GARY\n</b>              I just came to look around, but she started yelling\n              and hitting me...\n\n<b>                                  MARGARET\n</b>              Oh please.\n\n<b>                                  JIMBO\n</b>              How the hell is this solving our problem?  How is\n              this stepping up?\n\n<b>                                  GARY\n</b>              Just listen, okay.\n\n<b>                                  MARGARET\n</b>              Yeah, listen, if the fat from your neck hasn't stopped\n              up your ears.\n\n      Jimbo looks confused.  Gary ushers him into the other room.\n\n<b>82    INT. BARNELL HOME / KITCHEN - LATER                                           82\n</b>\n      Gary and Jimbo sit at the table, talking.  Jimbo's not happy.\n\n<b>                                  JIMBO\n</b>              This is not what we do.\n\n<b>                                  GARY\n</b>              It is now.\n\n<b>                                  JIMBO\n</b>              Where would we stash her?  Your place?\n\n<b>                                  GARY\n</b>              Too small, plus we'd have to get her in and out\n              without anyone seeing.  And I've seen that sty you\n              call an apartment.\n\n<b>                                  JIMBO\n</b>              See, it's just a bad idea.\n\n<b>                                  GARY\n</b>              Yeah.  Maybe.\n                        (a possible idea)\n              You see the whirlpool tub?\n\n<b>                                  JIMBO\n</b>              You can't be serious.\n\n<b>                                  GARY\n</b>              It could be like a little getaway.\n\n      Off Jimbo, considering this.\n\n<b>83    EXT. BARNELL HOME - NIGHT                                                     83\n</b>\n      Paul pulls up, hits the garage door opener and drives in.\n\n<b>84    INT. BARNELL HOME / KITCHEN                                                   84\n</b>\n      Paul walks in from the garage, pulls off his jacket.\n\n<b>                                  PAUL\n</b>              Hey Maggie-magster.  How ya --\n\n      Paul stops short as he sees Margaret, Gary and Jimbo sitting around the table.\n      Margaret's mouth is taped shut.\n\n      Paul is about to lunge at the men when Gary slides his gun into view.  He\n      stops.\n\n                                  PAUL (cont'd)\n              What are you people doing in my house?\n\n<b>                                  GARY\n</b>              Mr. Barnell.  You have something that belongs to us.\n\n<b>                                  PAUL\n</b>              I, I don't know what you're talking about.\n\n<b>                                  JIMBO\n</b>              Do you remember a dead man you found in the\n              dumpster behind your office?\n\n      Paul, shocked, tries to hold it together.\n\n<b>                                  PAUL\n</b>              No, I can't say that... I mean that would probably stick\n              in my mind a... dead body.\n\n<b>                                  GARY\n</b>              Think hard Mr. Barnell.\n\n      He tosses the frozen lock of hair onto the table.\n\n                                  GARY (cont'd)\n              Think hard.\n\n      Paul realizes he's screwed, gestures to the living room.\n\n<b>85    INT. BARNELL HOME / LIVING ROOM - LATER                                       85\n</b>\n      Gary sits on the sofa as Paul paces.\n\n<b>                                  GARY\n</b>              I thought it might be some weirdo sex thing, ya\n              know?  But you look like a pretty straight arrow.  So\n              then I'm thinking, maybe it's a scam.  Maybe\n              somehow our friend is worth some money to you.\n\n      Paul face lets Gary know he's dead on.\n\n                                  GARY (cont'd)\n              So what'd you collect?\n\n<b>                                  PAUL\n</b>              We, we had a life insurance policy\n              on my brother.  It was for... 100,000 dollars.\n\n<b>                                  GARY\n</b>              You know, it's always you quiet guys.  Here's how it's\n              going to work.  We stay here with your wife, you go\n              get our guy.\n\n<b>                                  PAUL\n</b>              Here?\n\n<b>                                  GARY\n</b>              We even see you or a cop even roll past, she's dead.\n              Plus you'll have to explain\n              how you scammed the insurance people out of their\n              hard earned money.  We'll call you in three days.\n              Have the body and, let's say 50,000 dollars for our\n              trouble.  Screw with us, we start mailing your wife\n              back to you.\n\n      Gary pauses for dramatic effect.\n\n                                  GARY (cont'd)\n              Starting with her feet.\n\n<b>86    INT. KITCHEN - LATER                                                          86\n</b>\n      Gary walks in on Jimbo and Margaret, still gagged.\n\n<b>                                  JIMBO\n</b>              He gone?\n\n      Gary nods, well pleased with himself.\n\n<b>                                  GARY\n</b>              He was scared.  Really scared.\n\n<b>                                  JIMBO\n</b>              You used the feet thing, didn't you?\n\n<b>                                  GARY\n</b>              No.\n\n<b>87    INT. TED'S APARTMENT - NIGHT                                                  87\n</b>\n      Tiffany comes through the door carrying a sack of groceries.\n\n<b>                                  TIFFANY\n</b>              Hey, little help here.  I got Pop Tarts.\n\n      She sees the living room wall -- it's covered with charts, diagrams and\n      theories.  Ted on the floor, remote control in hand, replaying the shots of the\n      body over and over...\n\n                                  TIFFANY (cont'd)\n                        (re: the screen)\n              Don't tell me, \"Sound of Music\"?\n                        (no reaction)\n              Honey?  You OK?\n\n<b>                                  TED\n</b>              Shhhh.  This is the important part.\n\n      Ted rewinds the tape, hits play, rewinds it again as -- Tiffany watches, quietly at\n      first, then with growing frustration.  Finally, she walks over and grabs the\n      remote control.\n\n                                  TED (cont'd)\n              I was watching that.\n\n<b>                                  TIFFANY\n</b>              This stops now.  This case is making me and you\n              crazy, especially you.\n\n      No response.  Tiffany plops on the sofa and starts leafing through Ted's files.\n\n                                  TIFFANY (cont'd)\n              Ya know, I am trying to be supportive.  Leading\n              experts agree that's the number one complaint men\n              have about their mates.\n\n<b>                                  TED\n</b>              I don't have any complaints about my... you.\n\n<b>                                  TIFFANY\n</b>                        (re: the file)\n              Dead guy's got a record?  Cool.\n\n<b>                                  TED\n</b>              Yeah. He beat the hell out of some guy in bar fight.\n              Broke the guy's eye socket.\n\n      Tiffany scans the file, then looks up at the screen.\n\n<b>                                  TIFFANY\n</b>              Honey?\n\n<b>                                  TED\n</b>              Yeah?\n\n<b>                                  TIFFANY\n</b>              I think you should read this again.\n\n      He looks.  She tosses him the file.\n\n<b>88    INT. BARNELL HOME / KITCHEN - NIGHT                                           88\n</b>\n      Margaret, still taped to a chair, sits at the kitchen table.  By the stove, Gary is\n      cooking, an apron tied like a bath towel around his waist.\n\n<b>                                  MARGARET\n</b>              We don't have any money, you know.\n\n<b>                                  GARY\n</b>              Lady.  Please.\n\n<b>                                  MARGARET\n</b>              If you want Raymond's fucking insurance money...\n              we don't have that either.\n\n<b>                                  GARY\n</b>              It's none of your business what we want.\n\n      Gary goes back to his cooking.  Then...\n\n                                  GARY (cont'd)\n              So how come you talk like you do?  I mean, cursing\n              all the time.\n\n<b>                                  MARGARET\n</b>              It's a disease.  It's called Tourette Syndrome.  I can't\n              control what I say.  Turnip.\n\n<b>                                  GARY\n</b>              Really?\n\n<b>                                  MARGARET\n</b>              You've taken a handicapped person hostage.  I hope\n              you're proud of yourself.\n\n<b>                                  GARY\n</b>              I saw this thing on TV where they said people with\n              that don't usually curse.\n\n<b>                                  MARGARET\n</b>              They must have got it wrong.\n\n<b>                                  GARY\n</b>              I don't think so.  It was a movie of the week based on\n              real events.  Don't most of Tourette's people twitch\n              and stuff?\n\n      Margaret just glares.\n\n                                  GARY (cont'd)\n                        (knowingly)\n              Oh, I get it.  You got a spice rack?\n\n<b>                                  MARGARET\n</b>              Over the sink.  And what's that supposed to mean?\n\n<b>                                  GARY\n</b>              Nothing.  Cumin?\n\n<b>                                  MARGARET\n</b>              On the left. (beat)  And I'm not... crazy, it's a physical\n              disease.  Sometimes I can control it, and\n              sometimes --\n\n<b>                                  GARY\n</b>              You can't?  Want to know what I think?  I think this\n              \"syndrome\" is something you\n              read about somewhere and figured, hey, works for\n              me.\n\n<b>                                  MARGARET\n</b>              Ass-rimming ball-sucker.\n\n<b>                                  GARY\n</b>              You can completely abdicate your societal\n              responsibilities, say whatever you want whenever\n              you want, and slough it off on a illness.  Maybe I\n              should catch this thing. \"Gee, sorry Your Honor, I\n              have a disease that makes me rob 7-11s.\"  It's\n              called really need a Slurpee disease.\n\n<b>                                  MARGARET\n</b>              You've never robbed a 7-11 in your life you shit\n              eating fuck-weasel.  What kind of man threatens a\n              woman with a gun, anyway?\n\n<b>                                  GARY\n</b>              You are so faking it.\n\n<b>                                  MARGARET\n</b>              Oh, I'm faking it?  Is this how you get your kicks, you\n              over-compensating pussy little fart sack?\n\n      Gary, suddenly tense, puts down his spoon and picks up his gun.\n\n<b>                                  GARY\n</b>              Hey!  Keep your voice down or the gag goes back.\n\n<b>                                  MARGARET\n</b>              You don't scare me.  If something bad was going to\n              happen, my psychic would have told me.\n\n      Gary awkwardly chambers a round, starts gesturing with the gun, trying to look\n      tough.\n\n                                  MARGARET (cont'd)\n              You put that down now you little bitch, or so help me,\n              I'll start yelling so loud you'll have to shoot me.\n\n      Gary, confused and embarrassed, doesn't know what to do.\n\n<b>89    EXT. BARNELL MOBILE HOME - NIGHT                                              89\n</b>\n      Paul gets out of his car carrying a K-Mart bag.  He looks like he's been\n      CRYING.  Mrs. Wherry waves from her deck.\n\n<b>                                  MRS. WHERRY\n</b>              Paul, sorry to hear about your brother.\n                        (Paul gives a sad smile)\n              You moving in?\n\n<b>                                  PAUL\n</b>              Just for a bit.\n\n<b>                                  MRS. WHERRY\n</b>              She'll come to her senses.  They always do.  Oh, the\n              septic lines are frozen, so you'll have to use the\n              outdoor commode.\n\n      Paul waves as he enters the mobile home, closing the door behind him.  A\n      light goes on.  It starts to snow.\n\n<b>90    INT. BARNELL MOBILE HOME - NIGHT                                              90\n</b>\n      Paul walks in, survey's the interior of the mobile home.\n\n      PAUL'S POV:  A 7 year old time capsule of a party that was never cleaned up;\n      beer bottles, ashtrays and general garbage.\n\n<b>                                  PAUL\n</b>                        (to himself)\n              Would it have killed you to clean up before you left,\n              Raymond?\n\n      Paul picks up a small box from the floor, looks at the label.  Edible Panties.  He\n      puts them on top of a stack of porno mags, neatens the pile, then heads out.\n\n<b>      INT. BEDROOM - LATER\n</b>\n      HIGH ANGLE ON: Paul lying in bed, wide awake, but in the same position\n      we've seen him in when he sleeps with Margaret.  An electric heater glows\n      beside him.\n\n<b>91    EXT. BARNELL MOBILE HOME - CONTINUOUS                                         91\n</b>\n      TIGHT ON: Car tires as they pull to a stop on the main road.  A pair of heavy\n      men's boots get out, start to make their way toward the mobile home.\n\n<b>92    INT. MOBILE HOME - LATE NIGHT                                                 92\n</b>\n      There's a KNOCK on the door.  Paul heads to the door.\n\n<b>                                  PAUL\n</b>              Who is it?\n\n<b>                                  MAN'S VOICE (O.S.)\n</b>              State Police.  Is there a Mr. Barnell here?\n\n<b>                                  PAUL\n</b>                        (as he unlocks it)\n              Yes, is there something wrong--\n\n      As he opens the door a crack, a gloved hand shoves it open.  The force of the\n      blow sends Paul staggering backward, landing in a heap against the wall\n      where a picture of his family tumbles over and shatters on his head.\n      RAYMOND BARNELL (40s), a bear of man, enters, picks up Paul and throws\n      him through the serving kitchen serving hatch.  Raymond leans through the\n      hole.\n\n<b>                                  RAYMOND\n</b>              Hello brother.\n\n      He walks around, takes a copy of \"USA Today\" and throws it at Paul.\n\n<b>                                  PAUL\n</b>              Raymond?  Is that...\n\n<b>                                  RAYMOND\n</b>              Page 16, Paul. That's why I love \"USA Today\", news\n              from every fuckin' state.  Don't you want to read it?  I\n              was eaten by wild fuckin' animals.  But ya know,\n              despite that, I'm feeling pretty God-damned chipper.\n\n      Paul beats a hasty retreat, stumbling through the mobile home with Raymond\n      right on his heels.\n\n<b>                                  PAUL\n</b>              Raymond, let me tell you what happened here.  We\n              all thought you were...\n\n<b>                                  RAYMOND\n</b>              Dead?  Yeah, I got that impression.\n\n<b>                                  PAUL\n</b>              But you had dropped off the face of the earth.\n\n<b>                                  RAYMOND\n</b>              And you just decide to make it permanent?\n\n<b>                                  PAUL\n</b>              But there were no records of you anywhere.  I\n              checked.\n\n      With that, Raymond kicks his brother hard in the ribs.  Paul doubles over,\n      gasping for breath.\n\n<b>                                  RAYMOND\n</b>              In certain lines of quasi-legal employment, using\n              your actual ID can be a hinderance.  But despite the\n              reliance on aliases, it's nice to have your actual birth\n              certificate to fall back on.  Gotta tell ya, Paul, I was\n              pretty pissed.\n\n      Raymond is about to kick him once more, but Paul puts up a hand, begging\n      him to stop.  Raymond, relents, then bends over and helps his brother to a\n      sitting position.\n\n                                  RAYMOND (cont'd)\n              But then I start to think, Paul's no idiot.  He woulda\n              told 'em it's not me.  Unless...\n\n      Paul can only sit there and WHEEZE.  Raymond sits beside him on the floor,\n      pulls out a cigarette and lights it.\n\n                                  RAYMOND (cont'd)\n              So what is it?  Frame job, lawsuit...\n\n<b>                                  PAUL\n</b>              Life insurance.\n\n<b>                                  RAYMOND\n</b>              Figured.  So where's my money?\n\n<b>                                  PAUL\n</b>              Your money?\n                        (a beat)\n              They're still... investigating.\n\n<b>                                  RAYMOND\n</b>              What you get?\n\n      Paul considers whether or not Raymond would even remember.\n\n<b>                                  PAUL\n</b>              Fifty thousand.\n\n<b>                                  RAYMOND\n</b>                        (with a shrug)\n              Almost worth coming back for.  What's the split?  I\n              get half?\n\n<b>                                  PAUL\n</b>                        (not quite trusting him)\n              Okay.  Sure.\n                        (changing the subject)\n              You look good.  Lost some weight?\n\n<b>                                  RAYMOND\n</b>              Gave up carbs.  So what are you doing out here?\n              She not go along with it?\n\n<b>                                  PAUL\n</b>              Who?  Margaret?\n\n<b>                                  RAYMOND\n</b>              How she hold up, anyway?\n\n<b>                                  PAUL\n</b>              She's fine.  Actually, we're not doing so good right\n              now.\n\n<b>                                  RAYMOND\n</b>              Any kids?\n                        (off his look)\n              Still can't get one by the goalie, huh.\n\n<b>93    INT. BARNELL HOME / KITCHEN - LATER                                           93\n</b>\n      Gary and Margaret sit in silence, Gary taking Margaret's pulse.  Jimbo walks in,\n      grocery bag in hand.\n\n<b>                                  JIMBO\n</b>              Hey.\n\n<b>                                  GARY\n</b>                        (snarky)\n              Hey.\n\n<b>                                  JIMBO\n</b>              Talked to our friend.  We're okay for now.  How's\n              everything here?\n\n<b>                                  GARY\n</b>              Oh, just great.\n                        (to Margaret)\n              Seventy six, perfectly normal.  What a shock.\n\n      Gary jumps up and storms into the bathroom just off the kitchen.\n\n<b>                                  MARGARET\n</b>              He's a little over tired.\n\n<b>                                  JIMBO\n</b>              It's been a rough week.\n\n<b>                                  MARGARET\n</b>                        (for Gary's benefit)\n              Really?  Why?  You and your life partner in the shitter\n              having trouble picking a China pattern?\n\n<b>                                  JIMBO\n</b>                        (shocked)\n              Um, um... Gary?\n\n<b>                                  GARY (O.S.)\n</b>              Your turn to deal with it.  If I come out of this\n              bathroom I'll put a bullet in her head, swear to God.\n\n<b>                                  MARGARET\n</b>              I have a psychiatric disorder.\n                        (to Gary, in the bathroom)\n              And so do you!\n\n<b>94    EXT. BARNELL MOBILE HOME / DRIVEWAY - MORNING                                 94\n</b>\n      Paul, looking like a man who recently took a beating, shovels the light snow\n      cover that blankets the drive.  He looks as Ted's car pulls up.  As Ted walks\n      toward him...\n\n<b>                                  PAUL\n</b>              Mr. Watters.  You said on the phone something\n              about a resolution in our claim?\n\n<b>                                  TED\n</b>              Mr. Barnell.  Why are you staying out here?\n\n      Paul thinks about this for a long time.  Then, finally...\n\n<b>                                  PAUL\n</b>              My wife and I, we're having some problems.\n\n<b>                                  TED\n</b>              Kind of understandable I guess.  Seeing as how you\n              killed that man and dumped his body out in the\n              woods.\n\n<b>                                  PAUL\n</b>              You mean Raymond?\n\n<b>                                  TED\n</b>              No.  Not Raymond.  Definitely not Raymond.  I\n              thought it was at first, but that's what was throwing\n              me...\n\n<b>                                  PAUL\n</b>              I'm not sure I appreciate your tone.\n\n<b>                                  TED\n</b>              My tone, Mr. Barnell?  You are going to jail.  I will\n              personally see to that.\n\n<b>                                  PAUL\n</b>              I really think you should go now.\n\n<b>                                  TED\n</b>              You are a liar and thief.\n\n      Paul stabs his shovel into a snow bank, then walks to Ted.\n\n<b>                                  PAUL\n</b>              You know Mr. Watters, I've had a pretty rough night,\n              so if you wouldn't mind just leaving.\n\n      Paul tries to guide Ted away, but slips and falls on the snow.  Ted, rolling his\n      eyes, reaches down to help him up.\n\n<b>                                  TED\n</b>                        (noticing the bruises)\n              Hey.  How'd you get all cut up?\n\n<b>                                  MRS. WHERRY (O.S.)\n</b>              What's say you just move away from him.\n\n      Ted, with his hands still on Paul, turns to see -- Mrs. Wherry, from her porch, a\n      compound bow aimed at his forehead.\n\n                                  MRS. WHERRY (cont'd)\n              You all right there, Paul?\n\n<b>                                  PAUL\n</b>              I'm fine, Mrs. Wherry.  Just go back inside.\n\n<b>                                  MRS. WHERRY\n</b>              I can drop him if you want.\n\n<b>                                  PAUL\n</b>              I'm fine.  Really.\n                        (turning to Watters)\n              I think you'd better go.\n\n      Ted backs to his car, gets in and drives off.  Paul brushes the snow from his\n      jacket, reaches up, touches his bleeding forehead (the fall having reopened the\n      wound).\n\n<b>                                  MRS. WHERRY\n</b>              I've got some fishing line if you want me to stitch that.\n\n      Paul waves her off, then stares at the blood on his fingertips.  An idea slowly\n      takes hold.\n\n<b>95    INT. BARNELL MOBILE HOME - MOMENTS LATER                                      95\n</b>\n      Raymond pours whiskey into a 7-11 specialty cup as Paul  pulls off his coat.\n\n<b>                                  RAYMOND\n</b>              He give you the check?\n\n<b>                                  PAUL\n</b>              No.  He thinks I...  It'll be fine.\n\n<b>                                  RAYMOND\n</b>              Maybe I'll pay him a little visit.  See if we can speed\n              up the process.\n\n<b>                                  PAUL\n</b>              You don't have to... I figured out a way to take care of\n              things.\n\n<b>                                  RAYMOND\n</b>              Yeah, I was watching from the window.\n\n      Paul, agitated, pulls the blinds shut.\n\n<b>                                  PAUL\n</b>              You can't do that, Raymond.  If someone sees you...\n\n<b>                                  RAYMOND\n</b>              Ya know, I been thinking there, Paulie.\n\n<b>                                  PAUL\n</b>              About what?\n\n      Raymond walks over to Paul.  Paul tenses, expecting to be hit.  Raymond\n      moves right by to refill his drink.\n\n<b>                                  RAYMOND\n</b>              After we get her back from these guys who grabbed\n              her, you think your wife'll be able to keep her mouth\n              shut?\n\n<b>                                  PAUL\n</b>              I don't think I...\n\n<b>                                  RAYMOND\n</b>              Crazy people talk a lot.  And I think if you tell your\n              therapist something, they can use it in court.\n\n<b>                                  PAUL\n</b>              She's not...  she doesn't have a therapist.\n\n<b>                                  RAYMOND\n</b>                        (taking a slug)\n              Still, might wanna think about it.\n\n<b>                                  PAUL\n</b>              Think about what?\n\n<b>                                  RAYMOND\n</b>              You crossed over into the bigs now, Paulie.  Fraud.\n              Consorting with felons.  Got to \"cowboy up.\"\n\n<b>                                  PAUL\n</b>              Cowboy up?\n\n<b>                                  RAYMOND\n</b>              Get tough, ya suck-hole.  I'm just saying sometimes\n              a man has to make problematic decisions.  Cull the\n              heard, so to speak.\n                        (off his look)\n              Paul, come on, just kiddin' around, here.  Don't be\n              such a fuckin' stick.\n\n      Raymond, an enigma, looks at Paul, then grins -- just kidding.  Paul relaxes.\n      Raymond tenses -- not really.  Paul's not sure how to read his brother as they\n      shoot looks at one another -- sibling rivalry ad absurdum.\n\n<b>96    EXT. CITY SKYLINE - MORNING                                                   96\n</b>\n      The sky moves from dark grey to light grey, then stops.  A thermometer outside\n      on an office tower shows a brisk minus 20.  Workers bundle themselves\n      against the cold, hurry to work past the drifts piled alongside the road.\n\n<b>97    INT. INSURANCE OFFICE - MORNING                                               97\n</b>\n      Ted walks in, throwing his coat over the wall of his cubicle and is about to sit\n      down when he notices Paul in his boss' office.  Ted moves closer.\n\n<b>                                  PAUL (MUFFLED)\n</b>              I haven't called the police yet, but I'll tell you it was\n              certainly tempting.\n\n      Ted opens the door to his boss' office.  Paul doesn't notice.\n\n                                  PAUL (cont'd)\n              I've had some dealings with, diseases of the mind,\n              and I can tell you he is not well.\n\n      Branch, obviously worried, stands.\n\n<b>                                  BRANCH\n</b>              Watters.  Glad you're... Mr. Barnell was just telling\n              me about the... meeting you two had.\n\n<b>                                  TED\n</b>              I caught that, yes.\n\n<b>                                  BRANCH\n</b>              As you can see... well, Mr. Barnell has some...\n              concerns.\n\n      Paul turns to look at Ted.  He has a large band-aid on his forehead, scratches\n      and bruises on his face.  It takes a second for the dime to drop.\n\n<b>                                  TED\n</b>              You don't think I did this?\n\n      Paul gets up and moves to the other side of the office.\n\n                                  TED (cont'd)\n              Oh come on.  I never laid a hand on him.\n\n<b>                                  BRANCH\n</b>              Ted, his neighbor says... otherwise.\n\n<b>                                  TED\n</b>              Now just hang on here.  Let me show you\n              something...\n\n      Ted digs into his briefcase.  He takes out a video tape, the police file on\n      Raymond and the photo of Raymond Paul dropped in the snow.\n\n<b>98/99 INT. OFFICE - MOMENTS LATER                                                98/99\n</b>\n      Paul and Branch listen intently as Ted paces, the TV/VCR plays shots of the\n      dead body in the background.\n\n<b>                                  TED\n</b>              See?  Where's the birthmark?  Your brother's police\n              report listed it...\n                        (reading from the report)\n              \"...large purple birthmark, upper left thigh...\"\n                        (leaning into the screen)\n              But I don't see it.  Not on this body.  You can see it in\n              the picture.  See?\n\n      Ted points to the photo;  Raymond, in the summer, wearing shorts with a\n      blotchy purple spot clearly visible on his leg.\n\n                                  TED (cont'd)\n              So what, Mr. Barnell?  Did it just disappear?  Did it\n              just... get better.\n\n      Ted grins.  His moment.  Finally.  Seconds feel like minutes.\n\n<b>                                  PAUL\n</b>              It... did get better.\n\n<b>                                  TED\n</b>              Did it now.  Well how in the world did that happen?\n\n<b>                                  PAUL\n</b>              Raymond was always... bothered by it. When he\n              came back from... Florida, he'd\n              had it fixed.  Laser surgery... like removing a tattoo.\n\n      Paul looks at Branch.  It's an excuse Ted hadn't thought of before.\n\n<b>                                  TED\n</b>              He did not.\n\n<b>                                  PAUL\n</b>              You taped my brother's body, in the morgue?\n\n      Paul stands and grabs the photo from off the desk.\n\n                                  PAUL (cont'd)\n              And this?  You stole pictures of my family?  And\n              taped his naked body?  What kind of sick company\n              are you running here?\n\n<b>                                  TED\n</b>              Oh for... he's lying.  It's obvious he...\n\n      Paul, feigning fear, shrinks back into the corner.\n\n                                  TED (cont'd)\n              This is crazy.  All we have to do is dig up the body...\n              check the leg for scars...\n                        (bingo)\n              Dental records!\n\n      Paul goes white.  He hadn't thought about this.\n\n<b>                                  BRANCH\n</b>              That will be just about enough of that. Mr. Barnell, I'm\n              sorry it's all come to this.  We'll have a check brought\n              over to you tomorrow morning.\n\n      Paul nods, stressed and strung out, he hugs the wall as he walks out.  After a\n      moment...\n\n<b>                                  TED\n</b>              Sir, with all due respect, he's --\n\n<b>                                  BRANCH\n</b>              Jesus, we're lucky he's not suing.  Now tomorrow,\n              you deliver the check to Mr. Barnell with a complete\n              apology.\n\n<b>                                  TED\n</b>              Fine, I understand how this looks --\n\n<b>                                  BRANCH\n</b>              It looks like you beat the hell out of one of our policy\n              holders.  Now send Cam in here.\n\n<b>                                  TED\n</b>              Why?\n\n<b>                                  BRANCH\n</b>              Well, while you were off on your little Easter Egg\n              hunt, your junior found us an out on that warehouse\n              robbery.  Head office is bumping him a level.\n\n<b>                                  TED\n</b>                        (fuck me naked)\n              I'll go get him.\n\n<b>                                  BRANCH\n</b>              They're very keen on him.  They want me to feel him\n              out on a transfer --\n\n      Ted has left the office, SLAMMING the door behind him.\n\n<b>100   INT. INSURANCE OFFICE STAIRWELL - MOMENTS LATER                              100\n</b>\n      The door CLANGS shut behind Paul as he dials his cell phone.\n\n<b>                                  PAUL\n</b>              Hello... yes, I'm wondering what city department\n              would be in charge of... sure, I can hold.\n                        (to himself)\n              Hang on Mag Pie, just hang on.\n\n      Paul puts a hand to his chest.  Suddenly dizzy, he drops to his knees and starts\n      to RETCH.  Tears well up in his eyes.  After a few moments, the storm passes.\n      Still on his knees, the person on the line comes back.\n\n                                  PAUL (cont'd)\n              Yeah, hi.   I was wondering if you could.... but I was...\n              sure.\n\n      He sits there, on hold again, waiting...\n\n<b>101   INT. UNDERGROUND PARKING AREA - EVENING                                      101\n</b>\n      Ted walks to his car.  As he opens the door -- WHAM!  A fist to his face drops\n      Ted.  Raymond in a ski mask, picks him up, opens the car door and lays Ted's\n      head on the door jamb.\n\n<b>                                  RAYMOND\n</b>              Listen you little prick, we've had just about enough of\n              this.  You get me?\n\n      Raymond leans onto the door, Ted SCREAMING as his head is squashed in\n      the vice.\n\n                                  RAYMOND (cont'd)\n              So let's just settle this right now, OK?  We want\n              what's coming to us.\n\n      Ted tries to say \"yes.\"  Raymond releases his grip on the door, leans down and\n      grabs Ted's wallet and walks off.\n\n<b>102   OMITTED                                                                      102\n</b>\n<b>103   INT. BARNELL MOBILE HOME - NIGHT                                             103\n</b>\n      Paul walks in on A LOUD PARTY.  Raymond, drunk out of his head, has his\n      arms around two marginal looking HOOKERS.\n\n<b>                                  PAUL\n</b>              Ray -\n\n      Not wanting to use his brother's real name.\n\n                                  PAUL (cont'd)\n              Richard!  What in the blazes are you doing?\n\n<b>                                  RAYMOND\n</b>              Hey Paul.  Took care of our little problem today.  We\n              should see some serious money any time, soon.\n\n<b>                                  PAUL\n</b>              Could... I have a word with you?\n\n<b>104   INT. BARNELL MOBILE HOME / KITCHEN - CONTINUOUS                              104\n</b>\n      Paul pulls the sliding door closed behind Raymond.\n\n<b>                                  PAUL\n</b>                        (whisper)\n              Are those...?\n\n<b>                                  RAYMOND\n</b>                        (serious)\n              Prostitutes?\n                        (laughing)\n              I sure as hell hope so, cause Jehovah's Witnesses\n              won't lick your lolly no matter how much you pay\n              them.\n\n<b>                                  PAUL\n</b>              How did you get them here?\n\n      Raymond pulls out the credit card Paul got for him.\n\n<b>                                  RAYMOND\n</b>              Put it on my plastic.  See, got my name on it and\n              everything.  It's every where I want to be.\n\n<b>                                  PAUL\n</b>              You can't use that.  You're supposed to be dead!\n              They'll track us down.\n\n<b>                                  RAYMOND\n</b>              You think they give a shit who pays the bill?  Think for\n              a minute, will ya?\n\n      Paul turns, trying to compose himself, when he notices  a handgun sitting out\n      on the counter.\n\n<b>                                  PAUL\n</b>              What... Raymond, what is... this?\n\n      Paul pokes at the gun, sending the barrel spinning around to face him.\n      Raymond grabs it and stuffs it into his pants.\n\n<b>                                  RAYMOND\n</b>              That's \"muh gun,\" Paul.\n\n      Paul's cell phone RINGS.\n\n                                  RAYMOND (cont'd)\n              Don't be long.  The little spinner's yours.\n\n      Paul picks up the phone as the party revs back up.\n\n<b>                                  PAUL\n</b>              Yes, hello.  Sorry, what?\n\n<b>105/106 INTERCUT:  BARNELL HOME / KITCHEN - CONTINUOUS                         105/106\n</b>\n      Jimbo is on the wall mounted phone.\n\n<b>                                  JIMBO\n</b>              You having a party, Mr. Barnell?\n                        (embarrassed for Margaret)\n              That's... that's not right.\n\n      Margaret, now gagged, sits where we last saw her.  She tries to talk through\n      the gag.\n\n      Gary's staring at his watch, calling out seconds.\n\n<b>                                  GARY\n</b>              Thirty, sorry, startinnng... Now!\n\n      Paul pulls the kitchen door closed with his free hand.\n\n<b>                                  PAUL\n</b>              There's no party...let me talk to my wife.\n\n<b>                                  JIMBO\n</b>              Hang on.\n\n      He hands the phone to Margaret.  Gary leaps up and stops him.\n\n<b>                                  GARY\n</b>              Twenty-five!\n\n      Jimbo pushes past him, pulls down Margaret's gag and holds the phone to\n      her.\n\n<b>                                  PAUL\n</b>              Why are you counting?\n\n<b>                                  MARGARET\n</b>              Paul?  Are you entertaining?\n\n<b>                                  PAUL\n</b>                        (a wave of relief)\n              Oh God, oh Jesus... Margaret, are you okay?\n\n<b>                                  RAYMOND (O.S.)\n</b>              Paul, we got any more chips?\n\n<b>                                  GARY\n</b>              Fifteen!\n                        (grabs the phone)\n              The body. Have you -- (beat) No, I'm the other guy.\n              Have you got the body?\n\n<b>                                  MARGARET\n</b>                        (shouting)\n              Paul, the carrot little weasly one wants to carrot\n              screw me with his sick carrot little cock.  And he's\n              messing up my kitchen.  Carrotcarrocarrot...\n\n      Jimbo, annoyed, puts the gag back in Margaret's mouth.\n\n<b>                                  PAUL\n</b>              You sick... Don't you hurt her!!\n\n<b>                                  GARY\n</b>              I never said anything like--\n                        (looks at his watch in panic)\n              Yes or no.  Ten seconds.\n\n<b>                                  PAUL\n</b>              Yes! It'll... it'll happen tomorrow.  Put Margaret back\n              on!\n\n<b>                                  RAYMOND (O.S.)\n</b>              Paul!  Chips!!\n\n<b>                                  PAUL\n</b>              Hello?\n\n      Gary lunges for the phone cradle like it's the finish line in the 100 meter dash,\n      slamming the phone down.  A beat.\n\n<b>                                  GARY\n</b>              I think I managed to avoid a trace.\n\n<b>                                  JIMBO\n</b>                        (quietly to Gary)\n              We're staying at his house.\n\n<b>107   (END INTERCUT) INT. BARNELL MOBILE HOME KITCHEN                              107\n</b>\n      Paul goes to the cupboard and pulls out a box of potato chips.  As he turns, he\n      sees one of the HOOKERS (30s) standing in the doorway.  She gives Paul a\n      come hither look.\n\n<b>108   INT. BARNELL GREAT ESCAPES TRAVEL - MORNING                                  108\n</b>\n      A bruised Ted enters, once again the only person in the shop.  He keeps his\n      parka on.  Avis stands to greet him.\n\n<b>                                  AVIS\n</b>              Hello.  Can I help you?\n\n<b>                                  PAUL (O.S.)\n</b>                        (icily)\n              Mr. Watters?\n\n      Paul comes around the corner.  He extends his hand, shocked to see the\n      bruises on Ted's face but knowing exactly where they came from.\n\n<b>                                  TED\n</b>              Mr. Barnell.  I have your check.\n\n<b>                                  PAUL\n</b>              Thank you, I appreciate that.\n                        (an awkward pause)\n              Please, sit.\n\n      Ted sits at Paul desk, reaches into his brief case and pulls out an envelope\n      and several forms.\n\n                                  PAUL (cont'd)\n              Have a little accident, there?\n\n<b>                                  TED\n</b>              I was mugged.  The cops say it was just a random\n              act of violence.  But who knows, right?\n                        (re: documents)\n              You'll have to sign.\n\n      Ted slides the papers across to Paul, then gets up and moves around over\n      Paul's shoulder.\n\n                                  TED (cont'd)\n              Where I've marked it with an X.  And... I'd also like to\n              apologize for my --\n\n<b>                                  PAUL\n</b>              No, please.  You don't have to...\n\n      Paul, at a loss, starts to read the paperwork. He pulls open his desk drawer to\n      grab a pen.  Ted looks down, sees the Sea Shell in the drawer.\n\n<b>                                  TED\n</b>              That's quite the shell.\n\n<b>                                  PAUL\n</b>                        (picking it up)\n              It was a gift from Raymond.  He bought it for me from\n              Florida.  It's all we have to remember him by.\n\n      Paul puts the shell down on the desk.\n\n<b>                                  TED\n</b>              That and a million dollars.  Things really worked out\n              for you, didn't they? lots of cash, newly single guy...\n\n<b>                                  PAUL\n</b>              I'm not single.\n\n<b>                                  TED\n</b>              ...so you gonna head down to Club Med?  See how\n              much fun a big bank roll can buy?\n\n<b>                                  PAUL\n</b>              Mr. Watters, I love my wife.  Very much.\n\n      Ted can't help but look confused by this simple, yet sincere declaration.\n\n<b>                                  TED\n</b>              Can we level with each other for a moment?\n                        (Paul nods)\n              Did you --\n\n      Before he can finish his question, a DELIVERY DRIVER entering the office with\n      a large box.\n\n<b>                                  PAUL\n</b>              Avis!  Avis?\n\n      There's no answer.  She's in the back.\n\n                                  PAUL (cont'd)\n              Will you excuse me?\n\n      Paul gets up to deal with the delivery.  Ted, sullen, picks up the shell and turns\n      it over in his hands.  Avis enter from the back.  She smiles at Ted, then sees\n      the shell.\n\n<b>                                  AVIS\n</b>              Oh, that's where you went.\n\n      She takes the shell and reattaches it to the display for Aloha Air.  Ted,\n      confused, walks over as Avis snaps the shell back into place.\n\n<b>                                  TED\n</b>              That's quite the display.\n\n<b>                                  AVIS\n</b>              They do some very nice in store promotions.\n\n      Paul walks back, shocked to see the shell now back on the display.  Ted just\n      stares at him.\n\n                                  AVIS (cont'd)\n              Here it is Mr. Barnell.\n                        (to Ted)\n              I thought someone might have walked out with it.  It's\n              not the best neighborhood.\n\n      Avis walks back to her desk.  Ted and Paul hold their look.  Finally, Paul walks\n      back to his desk and the paperwork.\n\n<b>                                  PAUL\n</b>              So, right here, by the X.\n\n      Ted nods.  Paul signs.  Ted takes the envelope with the check, hands it to Paul\n      but doesn't let go.  Paul tries to pull it free.  He looks at Ted who looks right\n      through him.  Just then, the lights go out.  They're all in the dark.\n\n                                  PAUL (cont'd)\n              We, uh... Avis?  Call Municipal Light and Power and\n              let them know I'll... stop by in a bit.\n\n      Paul looks at Ted, embarrassed.  Ted finally lets go of the check.\n\n                                  PAUL (cont'd)\n              Thank you.\n\n      Ted shakes his head, gets up and walks out.\n\n<b>109   OMITTED                                                                      109\n</b>\n<b>A109  EXT. \"BARNELL GREAT ESCAPES TRAVEL\" - NIGHT                                 A109\n</b>\n      Paul, seen through the window, sits alone in the dark.  His face lit only by a\n      small flashlight, he is completely still.\n\n<b>110   INT. TED'S APARTMENT - NIGHT                                                 110\n</b>\n      Tiffany on her headset with a customer.  Ted on the sofa, lost in thought and\n      whatever's on the TV.\n\n<b>                                  TIFFANY\n</b>              There's nothing to be embarrassed about.\n                        (a snide glance at Ted)\n              A lot of people find talking to a psychic very\n              therapeutic.  So what's on your mind, Carlos?\n\n<b>111   INTERCUT WITH: \"BARNELL GREAT ESCAPES TRAVEL\" - CONT.                        111\n</b>\n      An overwrought Paul is on the phone with Tiffany, sitting in the dark.  He's got\n      his home phone bill in front of him.\n\n<b>                                  PAUL\n</b>              I have a situation.  My wife...  do you think it's okay to\n              do something kinda bad to someone if you think\n              they're gonna do something really bad to someone\n              else?\n\n<b>                                  TIFFANY\n</b>              Sure.\n\n<b>                                  PAUL\n</b>              What if it's a really bad thing?\n\n<b>                                  TIFFANY\n</b>              Well, you probably shouldn't break the law if you can\n              help it.  Are you really sure they're going to do this\n              other thing?\n\n<b>                                  PAUL\n</b>              I'm... I... I don't know.  He said some things.  He said\n              he was joking, but I... I think he might.\n\n<b>                                  TIFFANY\n</b>              Don't think, know.  How close are you to the other\n              someone else, the one you're trying to protect?\n\n<b>                                  PAUL\n</b>                        (crying)\n              I just, I just...  Have you ever felt like that?  Like your\n              own life didn't even matter, as long as...\n\n<b>                                  TIFFANY\n</b>                        (touched)\n              Listen to me, Carlos.  Your wife is an incredibly lucky\n              woman.  I know, relationships are tough, but you do\n              what you gotta do to keep it together, okay?\n              Remember, love is sacrifice.\n\n      Ted can't help but SNORT at the mention of this familiar phrase as he looks at\n      Tiffany.  Tiffany glares back at him.\n\n<b>                                  PAUL\n</b>                        (sniffling)\n              I guess you're right.\n\n<b>                                  TIFFANY\n</b>              Now you get tough.  And remember, this call is for\n              entertainment purposes only.  Call me back and let\n              me know how it goes.\n\n      Tiffany hangs up and walks out.  Ted tries to catch her eye and let her know he\n      was just kidding.  He can't.  She goes.\n\n<b>112   INT. PAUL'S CAR - LATER                                                      112\n</b>\n      Paul behind the wheel, a strange determined look on his face.  He appears be\n      steeling himself for something.\n\n<b>113   INT. BARNELL MOBILE HOME / MAIN AREA - LATER                                 113\n</b>\n      Paul enters, SLAMMING the door behind him as Raymond looks up from his\n      porno magazine.\n\n<b>                                  PAUL\n</b>                        (blowing by)\n              She's having sex with them.\n\n      And with that, Paul disappears into the back bedroom.\n\n<b>114   INT. BARNELL MOBILE HOME / BACK BEDROOM - MOMENTS LATER                      114\n</b>\n      Paul sits, waiting.  After what seems like forever, Raymond walks in.\n\n<b>                                  RAYMOND\n</b>              Who's doing what?\n\n<b>                                  PAUL\n</b>              Margaret.  You know that Stockholm Syndrome\n              thing?\n\n<b>                                  RAYMOND\n</b>              The movie?\n\n<b>                                  PAUL\n</b>              When you fall in love with your kidnappers.\n\n<b>                                  RAYMOND\n</b>              Get the fuck out of here.\n\n<b>                                  PAUL\n</b>              I went by there.  She was in the bedroom with the big\n              one.\n                        (quietly)\n              Not the first time, either.\n                        (a flash of panic)\n              With other men, not kidnappers.\n\n<b>                                  RAYMOND\n</b>              For real?\n\n<b>                                  PAUL\n</b>              Her therapist.  And some guy she... hardly knew.\n\n<b>                                  RAYMOND\n</b>              Wow.  Sucks to be you.\n\n<b>                                  PAUL\n</b>              Shut up.\n\n      Raymond, a momentary flash of anger, sits on the bed beside his brother.\n      Paul does his best not to flinch.\n\n<b>                                  RAYMOND\n</b>              I always knew she was a fucking tease.\n\n<b>                                  PAUL\n</b>              Yeah.  Guess you were right.\n\n<b>                                  RAYMOND\n</b>              Well, you want my opinion...\n                        (Paul nods)\n              I don't trust her, Paul.  Never did.\n\n<b>                                  PAUL\n</b>              You think she'd... really mess things up?\n\n<b>                                  RAYMOND\n</b>              Only one way to make sure she doesn't.\n\n<b>                                  PAUL\n</b>              Not sure what you're saying?\n\n<b>                                  RAYMOND\n</b>              You remember that pooch Mom had?  Crazy little\n              Jack Russel with the bladder infection?\n\n<b>                                  PAUL\n</b>              Whole basement stank.\n\n<b>                                  RAYMOND\n</b>              Nothing you can do but put the thing out of it's\n              misery.  And yours.\n\n<b>                                  PAUL\n</b>              You... You sure, Ray?\n\n<b>                                  RAYMOND\n</b>              Trust me, Bro'.  Leaky dogs, crazy women.  Two\n              things no man should have to live with.\n\n      As Ray stands to go, Paul nods, his heart ripped apart for any number of\n      reasons.\n\n<b>115   INT. BANK OFFICE - MORNING                                                   115\n</b>\n      Paul sits in the manager's office, signing forms.  A large BANK GUARD stands\n      nearby.  The reason? One million dollars in hundred dollar bills neatly stacked\n      on the desk.\n\n<b>116   INT. OUTDOOR CLOTHING STORE - DAY                                            116\n</b>\n      Paul, with his sack of one million dollars at his feet, is calmly trying on new\n      winter coats with a CLERK.  He feels each one, checking the amount of\n      padding.  He finally settles on a red full-length down parka.\n\n<b>117   INT. \"BARNELL GREAT ESCAPES TRAVEL\" - LATER                                  117\n</b>\n      The lights are back on as Paul, wearing his oversized red parka comes\n      through the front door carrying his sack of cash.  Avis looks up.\n\n<b>                                  AVIS\n</b>              Mr. Barnell?  I didn't expect you back today.  Nice\n              jacket.\n\n<b>                                  PAUL\n</b>              Well... I am.  And Avis?\n\n<b>                                  AVIS\n</b>              Yes?\n\n<b>                                  PAUL\n</b>              You've been with me for five years?  Paul?  Can we\n              make it Paul?\n\n      Paul enters the back room, closes the door.  Avis walks over.\n\n<b>                                  AVIS\n</b>              Sure.  I just thought it was more professional when\n              people were around to call you Mr. Barnell.\n\n<b>                                  PAUL (O.S.)\n</b>              Avis.  There haven't been any people in here for\n              months.  No one comes in here, unless they're\n              looking for pornographic movies or deep fried fish,\n              neither of which we carry.  So you can call me pretty\n              much anything you want and it won't impress the\n              customers at all because we don't have any.\n\n<b>                                  AVIS\n</b>              Are you OK, Paul?\n\n      Paul opens the door.  Avis is surprised to see billowing clouds of down floating\n      in the air behind him.\n\n<b>                                  PAUL\n</b>              No Avis, to be frank I'm a little frazzled right now.\n              Now could you get me some tape, my passport out\n              of the safe and two open-ended tickets to Paraguay.\n\n      Paul shuts the door.  Avis gets to work.\n\n<b>118   INT.  COFFEE ROOM - DAY                                                      118\n</b>\n      ARNITH and BILL, two city workers, sit sipping coffee at a cafeteria table.  The\n      room is white, very clean and fairly new.  The men wear large orange overalls,\n      their white construction safety helmets sit on the table beside them.\n\n<b>                                  ARNITH\n</b>              Trouble is the city keeps cutting us back and cutting\n              us back.\n\n      Raymond and Paul, wearing his big red parka, enter.\n\n<b>                                  PAUL\n</b>              Excuse me, are you Arnith?\n\n      ARNITH sips his coffee, points to his name patch but doesn't look up.\n\n                                  PAUL (cont'd)\n              Great.  I was told to give you this.\n\n      Paul hands Arnith a folded form.  Arnith puts his hand out, forcing Paul to move\n      the form to him.  As Arnith looks at it.\n\n                                  PAUL (cont'd)\n              Disinterment order.  Got it from the coroner's office.\n              My brother didn't want to be buried.\n\n<b>                                  ARNITH\n</b>              How'd you know?\n\n<b>                                  PAUL\n</b>              Know what?\n\n<b>                                  ARNITH\n</b>              That he didn't want to be buried.\n\n<b>                                  RAYMOND\n</b>              He left it in a letter.\n\n<b>                                  ARNITH\n</b>              And you just got it now?\n\n<b>                                  PAUL\n</b>              Ya know, I don't mean to be rude here, but I'm not\n              sure this is any of your business.\n\n<b>                                  ARNITH\n</b>              That's entirely possible.\n\n      Bill stifles a LAUGH.  Raymond is about to tear out Arnith's spine.  Paul holds\n      his brother back.\n\n<b>                                  PAUL\n</b>              I, I don't think this is anything to be flippant about.\n\n<b>                                  ARNITH\n</b>              I appreciate that, Sir.  But I'm on a union specified\n              break right now, which means you are talking to me\n              as a private citizen. Now as a private citizen I can\n              pretty much say whatever I want to. If\n               you talk to me in 15 minutes I can assure you, you\n              will be afforded every courtesy as specified in the\n              workers policy guide and recently ratified in our\n              latest collective agreement dated --\n\n<b>                                  PAUL\n</b>              Sorry.  I'm just --\n\n<b>                                  ARNITH\n</b>              Trying to get your brother out of the ground. We\n              couldn't be more pleased.  You've arranged for\n              transportation of the remains?\n\n<b>                                  RAYMOND\n</b>              We're gonna take him to go.\n\n<b>                                  BILL\n</b>              See, now that's a problem.  We can't release the\n              body into your custody unless you are licensed by\n              the state to convey deceased persons.\n\n<b>                                  ARNITH\n</b>              Good point Bill.  Bill knows exhumation policy.  You\n              can look it up but I'm betting he's right.  You come\n              back with a bonded agent and we'll get right on this.\n\n      Paul thinks for a moment, digs into his pocket pulls out five crisp, new hundred\n      dollar bills and SLAMS them on the table.\n\n<b>                                  PAUL\n</b>              I'll give you five hundred dollars to go get him now.\n\n<b>119   EXT. GRAVEYARD - DAY                                                         119\n</b>\n      A large back hoe TURNS OVER.  The muffler BELCHES a cloud of black\n      smoke into the air.  Arnith is at the controls, expertly maneuvering the shovel\n      end towards the unmarked grave.\n\n<b>120   INT. TRUNK OF PAUL'S CAR                                                     120\n</b>\n      Black.  The trunk lid opens as Bill and Arnith dump a well-wrapped body\n      unceremoniously into the trunk.  Arnith and Bill look at each other.  Bill closes\n      the lid.  Black.\n\n<b>                                  ARNITH (O.S.)\n</b>              There ya go Mr. Barnell.  Snug as a bug in a rug.\n              Anything else we can get you?\n\n<b>121   INT. NICK'S STRIP BAR - NIGHT                                                121\n</b>\n      Ted sits at the bar beside Cam.  Ted, close to being drunk, plays with a book of\n      matches as a STRIPPER struts to Tennessee Ernie Ford's version of \"16\n      Tons.\"\n\n<b>                                  CAM\n</b>              So... Miami, huh?  Can you believe that?  One little\n              case and \"boom\", you're the flavor of the month.\n\n<b>                                  TED\n</b>                        (without a trace of sincerity)\n              Congratulations.  Why are you here?\n\n<b>                                  CAM\n</b>              Say thanks.  I really owe you.  If you hadn't given me\n              a shot on that--\n\n<b>                                  TED\n</b>              Forget it.  I'm trying to.\n\n<b>                                  CAM\n</b>              So we were all kinda wondering... what did happen\n              to your face?\n\n<b>                                  TED\n</b>                        (beat)\n              Car trouble.\n\n      Ted gets up, a little shaky on his feet.\n\n<b>                                  CAM\n</b>              Should you be driving?\n\n<b>                                  TED\n</b>              Absolutely not.\n\n      Ted gets up and walks to the door.\n\n<b>A121  EXT. NICK'S BAR - NIGHT                                                     A121\n</b>\n      Ted exits, a BLAST of Arctic wind and snow hits him in the face.  He closes his\n      eyes, letting the cold run over him.\n\n<b>122   INT. PAUL'S HOUSE - NIGHT                                                    122\n</b>\n      Margaret sits at the dinner table, as Gary puts down an overly large serving\n      plate of tuna casserole.  Jimbo walks in, takes a seat and a scoop full of food.\n\n<b>                                  GARY\n</b>              We set?\n\n<b>                                  JIMBO\n</b>              Yeah.  How you feel about the turnout by Summit Hill\n              where the snowmobilers park?\n\n<b>                                  GARY\n</b>              Fine.\n\n      They all dig in.  Gary looks expectantly.  Just the sound of chewing.  Finally, he\n      can't wait.\n\n                                  GARY (cont'd)\n                        (to Jimbo)\n              You like it?\n\n<b>                                  MARGARET\n</b>              Tastes like a rectal polyp.\n\n      A long, protracted silence.  Then...\n\n<b>                                  JIMBO\n</b>                        (to Gary)\n              How would she know.\n\n      Gary CHUCKLES as he gets up for some ketchup.  Margaret stares at Jimbo,\n      who gives her a \"I'll-say-what-I-need-to-have-peace-in-this-house.\"  Margaret\n      smiles, then discretely slides him the salt.  Jimbo quickly douses his food.\n\n<b>123   EXT.  PAUL'S HOUSE - LATE AT NIGHT                                           123\n</b>\n      Ted pulls up in front of Paul's home.  He stares at something that looks like a\n      tree on the front lawn.  He looks closer -- it's a \"For Sale\" sign.\n\n<b>                                  TED\n</b>              Blowing town, are we, Mr. Barnell?  I don't think so.\n\n      Ted staggers through the snow to the sign and drunkenly pushes it down into\n      the snow.\n\n                                  TED (cont'd)\n              I'm not done yet \"travel man!\"  You hear me?!\n\n      LAUGHING, he takes some matches from his pocket and tries to light the \"For\n      Sale\" sign on fire.  It's no use.  He quits.  He's cold now.  He gets up and\n      staggers back to his car.\n\n<b>124   OMITTED                                                                      124\n</b><b>125   OMITTED                                                                      125\n</b>\n<b>126   INT. BARNELL MOBILE HOME / LIVING ROOM - MOMENTS LATER                       126\n</b>\n      Raymond, half in the bag, sits on the sofa.\n\n<b>                                  RAYMOND\n</b>              See, I could have had her.  We both know that, but I\n              figured, she was such a... I mean, I don't know why...\n              You know why?\n\n<b>                                  PAUL (O.S.)\n</b>              No.  You want a refill?\n\n<b>                                  RAYMOND\n</b>              Does a duck shit under water?\n\n      Paul walks in with two glasses.  He hands Raymond the larger.\n\n                                  RAYMOND (cont'd)\n              Any trouble getting the bank to handle that much\n              cash?\n\n<b>                                  PAUL\n</b>              They said it'd be in tomorrow by --\n\n<b>                                  RAYMOND\n</b>              Right, right, you told me.  Then all we have to do is\n              get her and the thing... Hey, remember that time in\n              school, when I jumped out and scared you, and you\n              fucking pee'd all over yourself?\n\n<b>                                  PAUL\n</b>              Was pretty funny.\n                        (raises his mug)\n              Bottoms up.\n\n<b>                                  RAYMOND\n</b>              Okay, \"Puddles.\"  Remember how they called you\n              that?  Huh, \"Puddles?\"\n                        (about to drink - then)\n              Christ, what time is it?\n\n<b>                                  PAUL\n</b>              It's early.  Come on... ya...\n                        (uncomfortably)\n              ...pussy.\n\n      Raymond LAUGHS, takes the drink.\n\n<b>127   EXT. BARNELL MOBILE HOME - CONTINUOUS                                        127\n</b>\n      A beautiful winter's night, the soft snowy silence broken only by Raymond's\n      drunken shot of...\n\n<b>                                  RAYMOND (O.S.)\n</b>              Pussy!!!\n\n      A startled rabbit scurries across the snow.\n\n<b>128   INT. BARNELL MOBILE HOME / VARIOUS - LATER                                   128\n</b>\n      Raymond is passed out on the sofa.  Paul sits, gun in hand, the barrel pointed\n      at Raymond's forehead.  His finger grazes the trigger...  but it's suddenly all too\n      real.  Paul lowers the gun, takes a deep breath and tries again.  Not wanting to\n      be sprayed by Raymond's gray matter, he half turns his head...  Another idea\n      comes to him.  Paul picks up a plastic picnic plate to use as a shield from the\n      blow back.\n\n      He gets ready to fire again, then makes the mistake of looking at Raymond.\n      Maybe it's the light... maybe it's the small puddle of drool on the cushion, but he\n      looks almost angelic.  Paul stares at his brother.\n\n      In the kitchen, Paul fills a glass with water, empties the pistol's bullets into\n      The cup and hides it on the top shelf.\n\n      Paul puts the gun back.  Not sure of his next move, he spots the beat up clock\n      radio lying next to his brother.\n\n<b>A128  EXT. BARNELL HOME - MORNING                                                 A128\n</b>\n      Establishing.\n\n<b>129   INT. BARNELL HOME / BEDROOM - MORNING                                        129\n</b>\n      Margaret, still tied up, lays on top of the bed covers.\n\n      Gary walks past, looks in, checks his watch, then heads to the bathroom.\n\n      Margaret listens as Gary turns on the jacuzzi tub jets.  As he starts singing,\n      Margaret sits up and scooches over to the phone on the end table.  Her hands\n      tied loosely to her chest, she manages to dial by placing the phone receiver flat\n      on the bed.\n\n<b>                                  JIMBO (O.S.)\n</b>              Gary!  You seen my shirt?\n\n      Margaret looks over to see Jimbo, wearing Paul's pajamas, walking past while\n      shaving with a portable razor.  As the line rings.\n\n                                  JIMBO (O.S.) (cont'd)\n              Aw jeez, again?\n\n<b>                                  GARY (O.S.)\n</b>              It relaxes me.  You know it has twelve different\n              settings?\n\n<b>                                  JIMBO (O.S.)\n</b>              No Gary, I don't know that because every time I\n              thought about using it someone was in it.\n\n<b>                                  GARY (O.S.)\n</b>              Hey, I do a lot around here.\n\n      As they continue to squabble, the phone line connects.\n\n<b>                                  911 RECORDING\n</b>              You have reached 9-11.  All our operators are busy,\n              but your call will be handled in the order in which it\n              was received.  If this is a --\n\n      Margaret, using her nose, hangs up.\n\n<b>132   INT. BARNELL MOBILE HOME / LIVING ROOM                                       132\n</b>\n      Paul, quiet as a mouse and dressed in his money-lined parka, picks up his\n      cell and his car keys, drops them quietly into his pocket.  Just as he finishes...\n\n<b>                                  RAYMOND\n</b>                        (half asleep)\n              What's going on.\n\n<b>                                  PAUL\n</b>              We're out of coffee.  But I'll be right back.  Still early.\n\n      Not to worry.  Raymond has already rolled over.\n\n<b>133   INT. BARNELL HOME / BEDROOM                                                  133\n</b>\n      Margaret has just dialed another number.  It RINGS on the other end... And\n      RINGS... And connects.\n\n<b>                                  MARGARET\n</b>              Paul?\n\n<b>                                  AUTOMATED VOICE (O.S.)\n</b>              The number you have dialed is no longer in service.\n              If you think you have --\n\n      Margaret disconnects the call, then dials again.\n\n<b>134   INT. TED'S APARTMENT - CONTINUOUS                                            134\n</b>\n      A woozy Ted is trying to keep Tiffany's phone from RINGING.\n\n      Finally, he puts on the headset and hits a computer key.  It connects.\n\n<b>                                  TED\n</b>              Yeah?  Hello?  (coughs)  Hello?\n\n      He hits a few keys on the computer keyboard.  The screen pops to life.  The line\n      connects.\n\n<b>                                  MARGARET\n</b>              Oh thank fucking Christ.  Is Tiffany there?\n\n<b>                                  TED\n</b>              No, she's...\n\n      He pulls off a yellow Post It note stuck to the computer.  It reads:  \"Coffee made.\n      Don't touch my computer.  Back in 10.\"\n\n      Unseen on the computer screen beside him, the name \"Margaret Barnell\"\n      pops up, along with all her pertinent information like pet's name, husband,\n      delusions...\n\n                                  TED (cont'd)\n              She'll be back in a few minutes.  You want to try\n              later?\n\n<b>                                  MARGARET\n</b>              Well you should know, fuck-wit.  You know there's a\n              man with a gun in my shower, right now?\n\n      Ted, distracted, turns as he hears the doorknob turning.\n\n<b>                                  TED\n</b>              Hang on, she's on her way --\n\n      Finally he notices the computer screen.  Holy shit.\n\n                                  TED (cont'd)\n                        (tentatively)\n              Mrs. Barnell?\n\n      But before she can answer, Tiffany walks in carrying a laundry basket, pulls the\n      headset off Ted's head and holds it up to her ear.\n\n<b>                                  TIFFANY\n</b>              I'm here, Margaret.  How you feeling today?\n\n<b>                                  TED\n</b>              Give me the headset.\n\n      Ted grabs for the headset, Tiffany resists.\n\n<b>                                  TIFFANY\n</b>                        (to Ted)\n              What is wrong with you?\n\n<b>135   INT. BARNELL HOME / BEDROOM                                                  135\n</b>\n      Margaret sits in the same position on the bed by the phone.  Gary, in the\n      shower, belts out some SHOW TUNE.\n\n<b>                                  MARGARET\n</b>              Christ, where do you want to start?\n\n<b>136   INT. TED'S APARTMENT                                                         136\n</b>\n      Tiffany shoves Ted, who loses his balance and stumbles backward.  She puts\n      on the headset.\n\n<b>                                  TIFFANY\n</b>              Sorry about that.  Mrs. Barnell?  Could you speak up\n              a bit?\n\n      Ted is at her side, trying to listen in by pressing his ear to the outside of the\n      headset.\n\n<b>                                  TED\n</b>              What's she saying?\n\n<b>                                  TIFFANY\n</b>              Something about the gay mafia taking her to a park\n              to kill her.  Can you hand me my Help Line list?\n\n<b>                                  TED\n</b>              What... Wha...\n\n      Ted's throat seizes up again.  He stumbles to the kitchen, gulping water from\n      the faucet. Tiffany watches with some amusement.\n\n<b>                                  TIFFANY\n</b>              Margaret, are you sure these are real people in your\n              house?\n\n<b>                                  TED\n</b>              Find out where she...\n\n      His voice locks up again.  More water.\n\n<b>                                  TIFFANY\n</b>                        (listening to a profane ramble)\n              Well then it's a good thing you called.  Nope, not\n              seeing any problems, but hang on, let me really\n              concentrate.\n\n<b>                                  TED\n</b>              Ask her...\n\n      Ted's not doing much better.\n\n<b>137   INT. BARNELL HOME / BEDROOM                                                  137\n</b>\n      Margaret hears the shower stop running.\n\n<b>                                  MARGARET\n</b>              Shit on toast.\n\n      She hangs up, places the gag back in her mouth and hustles back into place.\n\n<b>138   INT.  TED'S APARTMENT - MOMENTS LATER                                        138\n</b>\n      Ted, pulls on his boots and his jacket.  In his hand, an address scribbled down\n      on a piece of note paper.  Tiffany watches, not happy.\n\n<b>                                  TED\n</b>              You're sure this is it?\n\n<b>                                  TIFFANY\n</b>              She specifically mentioned the cock-sucking turnout\n              up the highway where the snowmobilers hang out.\n\n<b>                                  TED\n</b>              I'll call later.\n\n<b>                                  TIFFANY\n</b>              I won't be here.\n\n<b>                                  TED\n</b>              Excuse me?\n\n      The phone RINGS.  Tiffany lets it.\n\n<b>                                  TIFFANY\n</b>              I know relationships aren't all sunshine and roses,\n              but I'm really not having fun anymore, and I don't\n              think you are either.\n\n<b>                                  TED\n</b>              God, now's so not the time, Tiff.\n\n<b>                                  TIFFANY\n</b>              Maybe you have to be like this right now, and I'm just\n              not in a good space to deal with it.  But...\n\n<b>                                  TED\n</b>              But what?\n\n<b>                                  TIFFANY\n</b>              Maybe we shouldn't be like this together.\n\n      Tiffany gives him that look every man who's ever crossed the line for the last\n      time is all too familiar with.\n\n      Ted stares.  Words fail him.  Finally, his only recourse is to hurry out the door\n      which shuts with a BANG.  Tiffany lets the phone continue to RING as she\n      stares at the door.  Sadly, she hits the computer key that picks it up.\n\n                                  TIFFANY (cont'd)\n              Psychic Buddies.  How are you Mr. Bennett?  I think\n              she'd be fine with you remarrying, but hang on, let\n              me concentrate.\n\n      Ted opens the door, steps back inside.\n\n<b>                                  TED\n</b>              OK.  Come on.\n\n<b>                                  TIFFANY\n</b>                        (to Ted)\n              Really?\n\n<b>                                  TED\n</b>              I've been cutting you out of my life and as a result our\n              normal communication channels have been\n              blocked.  I think you coming with me would... would...\n\n      He's reaching, but Tiffany looks cautiously hopeful.\n\n                                  TED (cont'd)\n              ...further the development of our relationship and\n              allow us to both... realize the potential of our...\n              interpersonalism.\n\n<b>                                  TIFFANY\n</b>              If you're going to be sarcastic.\n\n<b>                                  TED\n</b>              I'm not being anything.  Swear to God.\n\n<b>                                  TIFFANY\n</b>              Okay.  Why do you want me to come?\n\n<b>                                  TED\n</b>                        (total sincerity)\n              Cause if you don't, then I'll have to stay, and I'll be\n              mad at you and eventually we'll break up over it, and\n              as bad as my life is right now, that would make it a\n              million times worse.\n\n      Tiffany smiles, genuinely touched.\n\n<b>                                  TIFFANY\n</b>                        (into the phone)\n              Mr. Bennett, she's totally cool with it.  but listen,\n              you're gonna have to call back... I gotta go help my\n              boyfriend.\n\n<b>139   OMITTED                                                                      139\n</b>\n<b>140   INT. PAUL'S CAR - CONTINUOUS                                                 140\n</b>\n      Paul drives, smiling for the first time in a long time.  He listens to the\n      beautifully wrenching Iz-Kamakawiwo'Ole's version of \"Somewhere Over the Rainbow\"\n      on the radio.  (The music continues over the next two scenes.)\n\n<b>141   EXT. TED'S APARTMENT BUILDING - LATER                                        141\n</b>\n      Ted and Tiffany walk out to their car.  They sneak looks at each other, not\n      entirely sure what emotional sign-post they just passed.\n\n<b>142   INT. BARNELL GARAGE                                                          142\n</b>\n      Gary and Jimbo, with Margaret, hands bound, walk into the garage.  Jodie (the\n      dog) runs out after them.  Margaret looks at Jimbo, who takes the dog and\n      gently puts him back inside.\n\n<b>143   INT.  TED'S CAR / CITY STREETS - LATER                                       143\n</b>\n      Ted and Tiffany drive in silence.  Then...\n\n<b>                                  TIFFANY\n</b>              Okay, it's called the listening game.  You talk, I listen,\n              and I can't interrupt.  Then we switch.\n\n<b>                                  TED\n</b>              Doesn't sound like much of a game, but...  I can talk\n              about anything?\n\n<b>                                  TIFFANY\n</b>              Yes.\n\n      Ted smiles, and launches in...\n\n<b>144   INT. JIMBO'S CAR / CITY STREETS - LATER                                      144\n</b>\n      Gary leans into the backseat and holds a magazine in front of Margaret's face.\n\n<b>                                  GARY\n</b>              See the little box down there?  Lists all the\n              symptoms of that Tourette's thing, and you don't\n              have half of them.\n\n<b>                                  MARGARET\n</b>              And?\n\n<b>                                  GARY\n</b>              And?  And you're faking it.\n\n<b>                                  MARGARET\n</b>              Magazines don't prove anything.\n\n<b>                                  JIMBO\n</b>              Gary, can we just try and get there in peace?\n\n<b>                                  GARY\n</b>              Magazines prove everything!!\n\n<b>145   EXT. BARNELL MOBILE HOME                                                     145\n</b>\n      The residence seen from a distance.\n\n<b>                                  RAYMOND (O.S.)\n</b>              That little prick!!!\n\n      As the camera rushes the mobile home, from inside comes the sounds of a\n      very angry man.  Then, just as we're at the door, it SLAMS OPEN.  Raymond\n      stands in the doorway, a mountain of anger in a hastily pulled on parka.\n\n      He's holding the clock radio by the cord.  He checks his wristwatch, then\n      smashes the clock radio against the trailer.\n\n      Stalking toward his car, he checks the pistol in his side pocket, then, almost as\n      an afterthought, opens the clip.  No bullets.  He smiles.\n\n<b>146   EXT. GLACIER - LATER                                                         146\n</b>\n      A not-well-frequented tourist spot, featuring an expansive, far-as-the-eye-can\n      see carpet of white.  The road from the turnoff is about 200 yards long, leading\n      to a plowed out parking area.  The road is the only way in or out.  Paul's car\n      takes the corner and heads toward the parking area.\n\n<b>147   INT.  JIMBO'S CAR /  HIGHWAY - CONTINUOUS                                    147\n</b>\n      Margaret in the back, Jimbo and Gary in the front.\n\n<b>                                  GARY\n</b>              You can't be serious.\n\n<b>                                  JIMBO\n</b>              I'm still not sleeping.\n\n<b>                                  GARY\n</b>              Jimbo.  Come on.\n\n<b>                                  JIMBO\n</b>              It's a thought, okay.  With hard work, you can live okay\n              as a civilian.\n\n<b>                                  GARY\n</b>              After all this...\n\n<b>                                  JIMBO\n</b>              Yeah, after all this.\n\n<b>                                  GARY\n</b>              Don't you go soft on me, Jimbo.\n\n      Margaret LAUGHS through  her gag in the backseat.  Gary and Jimbo pretend\n      not to hear her.  They drive on in silence.\n\n<b>148   EXT. PARKING AREA - CONTINUOUS                                               148\n</b>\n      Gary and Jimbo's car pulls in, sliding to a stop beside Paul.\n\n<b>149   OMITTED                                                                      149\n</b>\n<b>150   INT. TED'S CAR / HIGHWAY                                                     150\n</b>\n      Tiffany and Ted drive.  Ted has just finished.  Tiffany has been paying rapt\n      attention.\n\n<b>                                  TIFFANY\n</b>              So this is kind of like a really weird \"Law and Order\"\n              episode?\n\n<b>                                  TED\n</b>              Sure.  I guess.\n\n<b>                                  TIFFANY\n</b>              And if Paul Barnell already killed his brother...\n\n<b>                                  TED\n</b>              Maybe his wife is next.\n\n<b>                                  TIFFANY\n</b>              Cool.  My turn?\n                        (Ted nods)\n              Now a healthy relationship is...\n\n<b>                                  TED\n</b>              Hey, here we are.\n\n      Ted takes the turnoff to the parking area.\n\n<b>151   INT. GUN STORE  - MOMENTS LATER                                              151\n</b>\n      A young, bored female CLERK (18) is behind the counter as the door CHIMES\n      go off.  She looks up to see Raymond walking in, gun in hand.  Raymond lays it\n      on the counter.\n\n<b>                                  GIRL\n</b>              Calibre?\n\n<b>152   EXT. PARKING AREA                                                            152\n</b>\n      Ted's car pulls up at the far end of the lot, about 200 yards from where Paul,\n      Gary and Jimbo are parked.  Paul's car is in between Ted's car and Jimbo's.\n\n      Paul gets out of his car, as do Jimbo and Gary.  Paul looks for Margaret in the\n      back of Jimbo's car, but she remains lying down on the backseat.\n\n<b>                                  JIMBO\n</b>              Mr. Barnell.  I'll assume you've got our friend back\n              there?\n\n<b>                                  PAUL\n</b>              Yes.  You can let her go now.\n\n<b>153   INT. TED'S CAR                                                               153\n</b>\n      Ted looks at Paul's car, too far away to see much.   He's about to get out when\n      Tiffany stops him.\n\n<b>                                  TIFFANY\n</b>                        (gently)\n              So, do you have a plan here?\n\n<b>                                  TED\n</b>              I'm gonna go talk to him.  You mind staying here?\n\n<b>                                  TIFFANY\n</b>              I guess.  So when do we call the cops?\n\n<b>                                  TED\n</b>              Soon as I... if he actually is doing... something.  I'll\n              wave, alright?\n\n      Tiffany gives him a quick kiss.\n\n<b>                                  TIFFANY\n</b>              That's a very good plan.\n\n      Ted's about to jump out of the car, but has to pull back his door as another\n      vehicle slides in beside them, the driver locking his brakes and sliding into the\n      snow embankment.\n\n                                  TIFFANY (cont'd)\n              Tourists.\n\n      Ted, a confused look on his face, looks over as Raymond gets out of his\n      vehicle.\n\n                                  TIFFANY (cont'd)\n              What?\n\n<b>                                  TED\n</b>              That was...\n\n<b>                                  TIFFANY\n</b>              Who?\n\n      Ted, too excited, fumbles with his seat belt as he tries to jump out of the car.\n\n<b>154   CORPSE'S POV: FROM PAUL'S OPEN TRUNK                                         154\n</b>\n      Black.  The lid opens.  Jimbo, Gary and Paul look in at the frozen body.  Jimbo\n      recoils at the mangled mess before him.  Gary reaches down and touches the\n      well-chewed body.\n\n<b>                                  GARY\n</b>              How do we know it's him?\n\n<b>                                  PAUL\n</b>              Come on!  Where would I get another one?\n\n      Good point.  Paul hands him the ransom money.\n\n<b>155   OMITTED                                                                      155\n</b>\n<b>156   EXT. PARKING AREA                                                            156\n</b>\n      Ted rushes up beside Raymond.\n\n<b>                                  TED\n</b>              Excuse me.  Aren't you... Raymond Barnell?\n\n<b>                                  RAYMOND\n</b>              I know you?\n\n<b>                                  TED\n</b>                        (confused)\n              You're... You're dead?\n\n      Raymond shoots him a look... Clearly this was taken as a threat.  Ted can't\n      help but step back.\n\n                                  TED (cont'd)\n              That came out so wrong.\n\n      Raymond sizes up Ted, then looks off to Paul's car.\n\n<b>                                  RAYMOND\n</b>              Go away, now.\n\n      Raymond walks on.  Ted, realizing he has no choice, runs and jumps in front of\n      Raymond, blocking his way.\n\n<b>                                  TED\n</b>              Okay, I don't know exactly what's going on here, but if\n              you would come with me to my office, just for a few\n              minutes, it would really help me out with my boss.\n\n      Raymond steps around Ted.  Ted stays with him.\n\n                                  TED (cont'd)\n              Look, I'm not trying to screw with your life at all, but\n              you can't just walk off with a million dollars and\n              expect people to--\n\n<b>                                  RAYMOND\n</b>                        (stops cold)\n              How much?\n\n<b>                                  TED\n</b>              See, your brother has, and I use this term carefully,\n              stolen a million dollars from my insurance company.\n              Now if we--\n\n      Before he can finish, Raymond hits him with an elbow to the temple.  Ted\n      drops to his knees, but even as Raymond tries to walk off, Ted manages to\n      grab his ankle.\n\n<b>157   INT. TED'S CAR                                                               157\n</b>\n      Tiffany is busy fiddling with the radio, missing the fight just outside her window\n      as she tunes in the Beach Boys \"Wouldn't It Be Nice.\"\n\n<b>158   EXT. PARKING AREA / BY PAUL'S CAR                                            158\n</b>\n      At Jimbo's car, Gary is folding the corpse into the trunk as Jimbo pulls Margaret\n      upright from the backseat and tugs down her gag.  She smiles at him as, with\n      great care, he helps her out of the car and presents her to her husband.\n\n<b>                                  PAUL\n</b>              It's all over honey.  It's all over.  Did they hurt you?\n\n<b>                                  MARGARET\n</b>                        (smiling/whisper)\n              Does food poisoning count?  Have you been eating?\n\n<b>                                  PAUL\n</b>              You know me when I get busy.\n\n      She touches the bruise under his eye.\n\n<b>                                  MARGARET\n</b>              Did you fall?\n\n<b>                                  PAUL\n</b>              Just a little.\n                        (to Jimbo)\n              Hey, we're gonna get...\n\n      That's when Paul sees what Jimbo and Gary are watching.\n\n      Raymond kicks Ted in the head, turns, spots Paul and breaks into a run.\n\n      Paul seems frozen, but just for a moment.\n\n<b>                                  JIMBO\n</b>              Who the hell is that?\n\n<b>                                  MARGARET\n</b>              Paul?\n\n      Paul discretely takes off his red parka and drapes it over Margaret's shoulders.\n\n<b>                                  PAUL\n</b>                        (quietly)\n              Honey, I need you to start walking to that hill over\n              there, alright?\n\n<b>                                  MARGARET\n</b>              Why?\n\n<b>                                  PAUL\n</b>              I'll catch up in a bit.  Now, no matter what you hear,\n              just keep going, alright.  And if I'm... late or\n              something, just look in the coat, alright?\n\n      Margaret nods, kisses her husband quickly on the cheek, then starts to walk\n      off.\n\n      Paul, Gary and Jimbo watch, transfixed at the down-parka'd shit-storm that is\n      headed their way.\n\n<b>                                  GARY\n</b>                        (nervous)\n              Jimbo?\n\n<b>                                  RAYMOND\n</b>                        (yelling)\n              A million dollars, Paul!?  You really think you could\n              take me?  Again!\n\n<b>                                  JIMBO\n</b>              What million dollars?\n\n      Gary and Jimbo look over at Paul, somewhat confused. Raymond's ten yards\n      out, and they can now see he's taken out his gun.  He's aiming it at Paul.\n\n      Paul looks over his shoulder at Margaret, who's having some trouble making it\n      up a snow covered hill.\n\n      Gary's hand slips into his pocket, grabbing hold of his gun.  Raymond,\n      oblivious, moves right past.\n\n<b>159   INT. TED'S CAR                                                               159\n</b>\n      Tiffany finally looks over at Ted, who's just getting to his feet.  She bursts out \n      of the car...\n\n<b>160   EXT. PARKING AREA / BY PAUL'S CAR                                            160\n</b>\n      Raymond reaches Paul, takes the gun and points it at the top of his head.\n      Paul's eyes shut tight, expecting the worst.\n\n<b>                                  PAUL\n</b>              Raymond... please.\n\n      But shooting your brother is tougher than it looks. Paul opens his eyes.\n      Raymond tries to pull the trigger again, but can't. He moves the barrel six\n      inches to the right and shoots Margaret in the back.  She drops face first into\n      the snow.\n\n      Paul's world ends.\n\n      Ears RINGING, he rushes toward his wife.\n\n      Jimbo can't believe it as Gary holds him back.\n\n<b>                                  JIMBO\n</b>              Hey!  What the fuck!!\n\n      Raymond, a look of relief on his face, turns to Jimbo.\n\n                                  JIMBO (cont'd)\n              She had nothing to do with this!\n\n<b>                                  RAYMOND\n</b>              And you do?\n\n      But even before Raymond can raise his weapon, Gary pulls his gun and gets it\n      pointed (shakily) at Raymond.\n\n                                  RAYMOND (cont'd)\n              Oh put it down, Nancy.\n\n<b>                                  GARY\n</b>              You first.\n\n<b>                                  JIMBO\n</b>              Gary!  Just --\n\n      Raymond drops his gun to his side.  Gary smiles, too happy he won the face\n      off.\n\n<b>                                  RAYMOND\n</b>              You win, tough guy.\n\n      Gary, trying to be cool, flips the gun to his other hand.  As he does-- BANG!  The\n      bullet rips into the snow about six feet from Raymond's feet.\n\n      Raymond glares at Gary.  So does Jimbo.\n\n<b>                                  GARY\n</b>                        (meek, apologetic)\n              Sorry.\n\n      Jimbo lunges for cover as Raymond FIRES back.  Gary, truly terrified, closes\n      his eyes as he squeezes off shots on the run -- BANGBANGBANGBANG.\n\n      One bullet bounces off Paul's car.  One hits Raymond.  With a quizzical look on\n      his face, he drops to his knees.  A large crimson stain forms on his jacket.\n      Everything goes quiet, except for the sounds coming from...\n\n      Paul, almost crazed with grief, cradles his wife's body.\n\n<b>                                  PAUL\n</b>              Oh God... Oh Jesus...\n\n<b>                                  MARGARET\n</b>                        (muffled)\n              Oh fucking hell... I can't... breath.\n\n      Paul gently turns her over.  Margaret, alive, unharmed but winded, tries to catch\n      her breath.\n\n                                  MARGARET (cont'd)\n              Paul...  Someone kicked me.\n\n      Paul feels around the bullet hole and pulls out a stack of money, now\n      embedded with the slug from the Raymond's gun.  He starts to weep tears of\n      relief.\n\n<b>                                  PAUL\n</b>              Can you stand.\n\n<b>                                  MARGARET\n</b>              Is... The Pope... a...\n\n<b>                                  PAUL\n</b>              Okay, easy...\n\n      Gary is behind the other car with Jimbo.\n\n<b>                                  GARY\n</b>                        (starting to lose it)\n              He just, fell... Oh Jesus, oh God.\n\n      Jimbo gently takes Gary's gun.\n\n<b>                                  JIMBO\n</b>              I know.\n\n      As Jimbo puts an arm around Gary and helps him to the car, he sees Paul,\n      arm around Margaret, coming their way.  Everyone stops.  A look passes, then\n      both couples move off.\n\n<b>161   EXT. PARKING AREA - CONTINUOUS                                               161\n</b>\n      As Jimbo and Gary drive away, Paul brings Margaret to his vehicle.  Spotting\n      Raymond, he walks over, kicks the gun away, then leans down.  Raymond's not\n      dead, but he's close.\n\n      Paul has to turn away.\n\n<b>                                  RAYMOND\n</b>                        (laboured)\n              Look at me, you little...\n\n      Paul turns back, not angry, not frightened, just a little sad.  Raymond, taken\n      aback for a moment, tries for one last verbal shot, but all he can manage is...\n\n                                  RAYMOND (cont'd)\n              Puddles.\n\n      And Raymond dies.\n\n<b>162   EXT. PARKING AREA - CONTINUOUS                                               162\n</b>\n      Paul turns back to his car when he spots a delirious, damaged Ted stumbling\n      toward him with Tiffany desperate to drag him the other way.\n\n<b>                                  TED\n</b>              Where do think you're going?\n\n<b>                                  TIFFANY\n</b>              Ted, leave him alone.\n\n<b>                                  TED\n</b>              No, no, no.  I have been beaten, humiliated, had my\n              head squeezed by a guy... and I am getting some\n              answers, right now.\n\n      Ted, barely able to stay on his feet (concussion) gets in front of Paul, and just\n      stands there and waits.  Paul can't help but feel bad for the guy.\n\n<b>                                  PAUL\n</b>              Okay.\n\n<b>                                  TED\n</b>              Well go ahead.\n                        (re: his left ear)\n              I can still kind of hear out of this one.\n\n<b>                                  PAUL\n</b>                        (a long pause)\n              I love my wife, Mr. Watters.  And when you love\n              someone, I mean, really love someone...\n\n      The punch hits Paul on the top of his head.  He stumbles back, but Ted is on\n      him before he can move out of range.  It's a strange looking fight between the\n      younger (physically spent) and older (emotionally drained).\n\n<b>                                  TED\n</b>                        (between punches)\n              I want a fucking Hallmark card or the lyrics to a\n              Foreigner rock ballad, I'll go to the mall, Mr. Barnell.\n\n      Margaret and Tiffany jump in, trying to pull the two men apart.\n\n<b>163   INT. PAUL'S CAR - LATER                                                      163\n</b>\n      The car is still in the parking area.  Paul and a bloody, beaten Ted sit up front\n      with Margaret and Tiffany in the back.  No one speaks, until...\n\n<b>                                  TIFFANY\n</b>              They call this the listening game.  Mr. Barnell, you\n              get to go first.\n\n      Ted glares at Tiffany, but her look instantly softens him.  Ted looks at Margaret,\n      who looks expectantly at Paul.  Ted shrugs.\n\n<b>                                  TED\n</b>              Knock yourself out.\n\n      Paul starts to talk, and Ted starts to listen...\n\n<b>164   EXT. GRAVEYARD - NOON                                                        164\n</b>\n      Arnith (the grave digger) walks to the side of a casket.  He hits the switch and it\n      starts to drop.  Arnith watches impassively, taking brief note of two people up\n      the hill before returning to his work.\n\n<b>165   EXT. GRAVEYARD HILL - CONTINUOUS                                             165\n</b>\n      It's Gary and Jimbo, dressed in black.  They watch silently as Raymond is laid\n      to rest.\n\n<b>166   EXT.  TROPICAL BEACH - DAY                                                   166\n</b>\n      The sun beats down on a white sand tropical paradise.  The wind is calm, the\n      water azure blue.  Perfection, except for the -- SNOW.  Big pure white flakes,\n      cutting across this idyllic --\n\n      Poster that hangs in a BOOK STORE window.  We are...\n\n<b>167   EXT. STREET / LIBERTY CAPITAL TOWERS - DAY                                   167\n</b>\n      Tiffany stares at her reflection in the window, her face transported to an island\n      paradise.  Ted walks out.\n\n<b>                                  TIFFANY\n</b>              Hey.\n\n<b>                                  TED\n</b>              Hey yourself.\n\n<b>                                  TIFFANY\n</b>              So where you want to go?\n\n<b>                                  TED\n</b>              Somewhere close.  My three o'clock's been moved\n              up.\n\n<b>                                  TIFFANY\n</b>              Cool.  You alright about everything?\n\n<b>                                  TED\n</b>              Yeah.  The life policy was written on his brother, and\n              he did, you know, die.  I may be rationalizing a bit, but\n              ethically I think I'm okay.\n\n<b>                                  TIFFANY\n</b>              Good.  I like it when you're okay.\n\n      The two walk down the street.  Snow keeps falling.  Tiffany shuts her eyes,\n      looks straight up as the gossamer snowflakes land and melt on her face.\n      She's never looked more beautiful.\n\n                                  TIFFANY (cont'd)\n              Don't ya just love this weather?\n\n      Ted stares at her.\n\n<b>                                  TED\n</b>              Learning to.\n\n      Tiffany grabs his hand and pulls him away, disappearing into the whiteness.\n\n<b>168   OMITTED                                                                      168\n</b>\n<b>A168  INT. BARNELL HOME / LIVING ROOM - DAY                                       A168\n</b>\n      Paul, sitting alone, reads a postcard from Margaret.\n\n<b>                                  MARGARET (V.O.)\n</b>              Pauly, know it sounds corny but I miss you so much!\n              Wish you could have come.  Saw some dolphins\n              today.  Frisky little buggers.  They were even playing\n              our song in the bar.  Have been pondering about\n              your question, and I think my answer is \"yes.\"  After\n              all, it's no fun in the sun without...\n\n                                  MARGARET (O.S.) (cont'd)\n              Paul, you ready?\n\n      Paul looks up to see Margaret.  Dressed in a coat, she is standing in the\n      middle of the living room, now empty save for a few boxes and a very ugly floor\n      lamp.\n\n      Paul flips Margaret's letter over, and we now see it is the faded Hawaiian Hilton\n      postcard from the box in his den.\n\n      Paul puts the postcard in a shoe box full of keepsakes, and tucks it under his\n      arm.  Margaret picks up Jodie, whose in his carrying case, and walks over.\n\n      A CAR HORN sounds from outside.  It's their cab.  As they walk to the door...\n\n<b>                                  PAUL\n</b>              How you feeling?\n\n<b>                                  MARGARET\n</b>              Pretty damn good.\n\n<b>                                  PAUL\n</b>              I can tell.\n\n<b>                                  MARGARET\n</b>              Can you?\n\n      Paul takes her hand and gives it a squeeze.  They head out.\n\n<b>169   EXT. AIRPORT TARMAC - DAY                                                    169\n</b>\n      Snowing now, as various PEOPLE walk toward the aircraft and the portable\n      stairs rolled to the door.\n\n      Paul and Margaret among the crowd, exchange nervous but hopeful smiles,\n      then they are lost along with the other pilgrims in the swirling white.\n\n<b>                                                                        FADE TO BLACK.\n</b>\n<b>170   (CODA) EXT. DAVE'S HOUSE - DAY                                               170\n</b>\n      Dave and his WIFE (50s) walk out of their house toward their  car.  They get in,\n      Dave behind the wheel.\n\n<b>171   INT. DAVE'S CAR - CONTINUOUS                                                 171\n</b>\n      As they pull down the driveway.\n\n<b>                                  DAVE\n</b>              Why don't we go there after?\n                        (off her look)\n              Fine.  We'll do it now.\n\n<b>                                  DAVE'S WIFE\n</b>              Watch the curb.\n\n      Dave keeps backing up.  As he takes the corner and bumps over the curb, the\n      momentum sends the half-eaten body (that Gary and Jimbo stuffed into the\n      backseat) to an upright position.\n\n      They drive on, oblivious.\n\n<b>                                  DAVE\n</b>              Looks like weather.\n\n<b>                                                                          FADE TO WHITE.\n</b>\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Big-White,-The.jpg\"/>\n</td><td><h1>Big White, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Collin Friesen\" title=\"Scripts by Collin Friesen\">Collin Friesen</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Big White, The Script.html#comments\" title=\"Big White, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:00:29.142996"}