{"title": "Big", "film_link": "/Movie Scripts/Big Script.html", "script_link": "/scripts/Big.html", "info_raw": "\n\nBig Script\n\n\n\n\nIMSDb opinion  Enjoyable.\nIMSDb rating   (8 out of 10)\nAverage user rating   (8.88 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gary Ross  Anne Spielberg\nGenres  Comedy  Family  Fantasy\nScript Date :  1988\n\nRead \"Big\" Script\n\n\n", "script": "\nBig\nSCENE 1\n\nJOSH\nYou are standing in the cavern of the evil wizard.  All around you are \nthe carcasses of slain ice dwarfs...Melt the wizard.  What do you want \nto melt him with?  What do you think I want to melt him with...(Josh, \ndon't forget to take out the garbage)  Just a second!  Throw \nthe...(Josh, did you hear what your mother said?)  One minute!  (Josh \nBaskin!)  Your hesitancy has cost you dearly.  The wizard, sensing your \napprehension, unleashes a fatal blow from the ice scepter.  With luck, \nyou will thaw in several million years.  Great.\n\nMOM\nC'mon Josh, it's starting to get awfully late!\n\nJOSH\nOkay. Okay. Okay.\n\nSCENE 2\n\nJOSH\nTake the garbage out.  Every day, take the garbage out...Rick Rodin is \non the mound for the Yankees!  He looks into the catcher's mitt, shakes \noff the first signal, takes the turn, wipes the sweat off his brow, \nleans back and fires...\n\nBILLY\nYeah!  Good-bye Mr. Spaulding!  ...Here, here!  Quick!\n\nSCENE 3\n\nJOSH\nGot it.  Need it.  Need it.  Got it.\n\nBILLY\nHey.  Hey.  Hey!  You ever go by Simpson's desk when she's grading \npapers or somethin'?  When she's leaned over, you can see right down \nher shirt.\n\nJOSH\nNo!\n\nBILLY\nSwear to God.\n\nJOSH\nBra?\n\nBILLY\nNo.  No.  She's got one of those undershirt things.  So if you get real \nclose to the board, you can see all the way down to her flowers.\n\nJOSH\nWoah!\n\nBILLY\nYeah.  Give me your gum.\n\nJOSH\nNeed it.  Got it.  Got it.  Need it...\n\nBILLY\nHey.  Hey.  Hey!  Oh my God, it's Cynthia!  How did a geek like Freddy \nBenson get a sister like that?\n\nJOSH\nBeats me.\n\nCYNTHIA\nHi Josh.\n\nBILLY\nHi!...He says hi!...Unbelievable!  God!  She likes you!  I know she \nlikes you!  I'll find out, okay!\n\n\nSCENE 4\n\nBILLY &\nJOSH\nShimmy, shimmy cocoa pop!  Shimmy, shimmy rock!  Shimmy, shimmy cocoa \npop!  Shimmy, shimmy rock!  I met a girlfriend a triscuit!  She said, a \ntriscuit a biscuit!  Ice cream, soda pop, vanilla on the top!  Ooh, \nShelly's out, walking down the street, ten times a week!  I read it!  I \nsaid it!  I stole my momma's credit!  I'm cool!  I'm hot!  Sock me in \nthe stomach three more times!\n\nJOSH\nDon't forget to call me after supper.\n\nBILLY\nOkay.\n\nJOSH\nRemember about Cynthia!\n\nBILLY\nDon't worry!  I'm as interested as you are.\n\nSCENE 5\n\nJOSH\nSo, will you tell me?\n\nBILLY\nYou're in!\n\nJOSH\nWhat do you mean, I'm in?\n\nBILLY\nCynthia Benson!\n\nJOSH\nWhat about her?\n\nBILLY\nYou ready for this?  She doesn't like Barry anymore!\n\nJOSH\nSo?\n\nBILLY\nSo what do you mean so?!  That's it!  She's available!\n\nMOM\nJosh...?\n\nJOSH\nIt doesn't mean...\n\nMOM\nHey, it's after midnight.  Now say goodnight to Billy.\n\nJOSH\nGoodnight Billy.  I've gotta go.\n\nBILLY\nGoodnight Mrs. Baskin!  Sweet dreams.\n\nSCENE 6\n\nDAD\nAre you sure you want to go on this thing, Son?\n\nJOSH\nYeah!\n\nMOM\nNah!  Nah!  I don't know about this one, Bob.  No, this looks too \nscary.\n\nDAD\nIt's okay.\n\nJOSH\nOh my gosh!\n\nMOM\nSee, I told you he doesn't want to go on it.\nDAD\nSon, you know, you don't have to go on this thing if you don't feel \nlike it.\n\nJOSH\nNo!  No!  It's just that I...I want to go on it myself.\n\nMOM\nYou do?\n\nJOSH\nYeah.  I think it's something...yeah, I think it's something I should \ndo.\n\nDAD\nGreat!  Why don't we meet you at the ferris wheel.\n\nJOSH\nHalf hour.\n\nSCENE 7\n\nCYNTHIA\nJosh?\n\nJOSH\nOh, hi!\n\nCYNTHIA\nHi!  Have you been on this before?\n\nJOSH\nThis?\n\nCYNTHIA\nYeah.\n\nJOSH\nYes.\n\nCYNTHIA\nIs it scary?\n\nJOSH\nYes.\n\nCYNTHIA\nAre you here alone?\n\nJOSH\nYes.\n\nCYNTHIA\nLook.  Aren't those your parents?\n\nJOSH\nWhere?\n\nMOM\nHoney!\n\nCYNTHIA\nRight over there.\n\nMOM\nSmile!\n\nJOSH\nWhy, yes.\n\nDARIN\nHey, who's this?\n\nCYNTHIA\nThis is Josh Baskin.\n\nDARIN\nHow ya doin'?\n\nCYNTHIA\nThis is Darin.  He drives.\n\nMAN\nNext!\n\nDARIN\nGo ahead.\n\nMAN\nYo next!\n\nDARIN\nGo ahead!\n\nMAN\nYo next!  Woah!  Read this sign.  You must be at least this big to ride \nthis ride!\n\nCYNTHIA\nWhat?\n\nMAN\nHey, I don't make the rules here.  Next!  Next!\n\nCYNTHIA\nWell, it's a stupid rule.\n\nMAN\nLook, why don't you try the kiddy ride?\n\nSCENE 8\n\nJOSH\nDrop twenty-five cents here.  C'mon!  C'mon!  C'mon!  ...Neat!  ...Make \nmy wish....I wish I were big....Your wish is granted.\n\nSCENE 9\n\nMOM\nJosh!  Josh!  Josh!\n\nJOSH\nWhat?\n\nMOM\nIt's seven-thirty.  Are you up?  ...Come on Sleepy Head!  You're going \nto miss the bus and I can't drive you today! ...What does he do in his \nsleep?  ...Honey?  I put out some clean clothes.  Bring down your \ndungarees and stuff for the laundry, okay?\n\nJOSH\nOkay.\n\nMOM\nAre you getting a cold, Josh?\n\nJOSH\nNo!  Fine!\n\nMOM\nHe's got a cold.  Then Rachel's gonna get a cold and I'm gonna get a \ncold...\n\nJOSH\nOh my God.\n\nMOM\nBreakfast is ready, Josh!\n\nJOSH\nBe right there!\n\nMOM\nJosh!  Hurry up!  Your eggs are getting cold!  ...Bring down Rachel \nwith you, all right?\n\nJOSH\nOkay!\n\nMOM\nYou want orange juice or...What about your breakfast?!\n\nSCENE 10\n\nMOM\nOh, you...don't!  Don't!\n\nJOSH\nI'm sorry! ...Mom, it's me.  It's Josh.  Mom, I'm a grown up!\n\nMOM\nStop it!  Oh God!\nJOSH\nI made a wish last night...I turned into a grown up, Mom!  I made this \nwish on a machine...\n\nMOM\nGo away!  Go away!  Please!\n\nJOSH\n...and it turned me into a grown up!  It was last night at the \ncarnival!  My birthday is November 3rd...I got a B on my history test!\n\nMOM\nHere's my purse!  You can have anything that's in it!  Go away!\n\nJOSH\nMy, my, my baseball team is called the Dukes!  Uh, I made this for you!   \nWho are you calling?  Ah!  I have a birthmark behind my left knee!\n\nMOM\nYou bastard!  What did you do to my son?\n\nJOSH\nI am your son, Mom!\n\nMOM\nWhere is my child?!  Where is my son?!  Police!\n\nSCENE 11\n\nCOACH\nHeads up!  Heads up out there!\n\nBILLY\nI'm open!  Here!  I'm open!\n\nCOACH\nI want you to gather up these balls, go to the locker room and get on \nto your next class!  Wash shirts and shorts!  Billy.  Do us both a \nfavor.  Put the balls in the equipment closet and you practice your lay \nup.\n\nSCENE 12\n\nJOSH\nBilly.\n\nBILLY\nYeah?  What?\n\nJOSH\nIt's me.  It's Josh!\n\nBILLY\nCoach Burns!  Coach Burns!  Coach Burns!\n\nJOSH\nWait a minute!  Shut up!  Shut up!  I'm your best friend, you've gotta \nbelieve me!  I'll prove it to you!  Billy, please!\n\nBILLY\nHelp!  Help!\n\nJOSH\nGod damn it Billy Kopecky!  Look, I know that I don't look like myself, \nokay!  But something really strange happened and I'm really scared and \nI need your help!  You're my best friend!  I can prove it to you!  \n...Ooh!  The spades go, Down!  Down! Baby!  Down!  Down the roller \ncoaster!  Sweet, sweet baby!  Sweet, sweet delectable!  Shimmy, shimmy \ncocoa pop!  Shimmy, shimmy rock!  Shimmy, shimmy cocoa pop!  Shimmy, \nshimmy rock!  I met a girlfriend a triscuit!  She said a triscuit a \nbiscuit!  Ice cream, soda pop, vanilla on the top!  Ooh Shelly, walking \ndown the street, ten times a week!  I met it!  I said it!  I stole my \nmother's credit!  I'm cool!  I'm hot!  Sock me in the stomach three \nmore times!\n\nBILLY\nJosh?  You look terrible.\n\nJOSH\nI know.\nSCENE 13\n\nPOLICE\nThat's right.  We're at the scene right now.  Well, she's pretty upset \nand she's not making any sense at all.  There's no ransom note, no \nprints, there's no nothin.'  Tell you what, file a report and to be on \nthe safe side...\n\nKID#1\nI bet he ran away.  Wish I could.\n\nKID#2\nWant me to pack your bags?\n\nSCENE 14\n\nBILLY\nWe go to the city, we lay low for a couple of days, find that Zoltar \nMachine, make your wish...you'll be home by Thursday!\n\nJOSH\nWell, I'm not supposed to go to New York without my folks!\n\nBILLY\nC'mon!  You'll be fine!  ...Here.\n\nJOSH\nWhere did you get this?!\n\nBILLY\nFrom my Dad's top drawer!\n\nJOSH\nYou stole it?!\n\nBILLY\nIt's his emergency fund!\n\nJOSH\nJesus Billy!\n\nBILLY\nWell what do you call this?!\n\nSCENE 15\n\nWOMAN\nYou lookin' for some fun tonight sweet thing?\n\nJOSH\nNo, thank you.\n\nMAN\nHey man, can you spare some change?\n\nJOSH\nNo, not really.\n\nBILLY\nHey, this looks okay.\n\nJOSH\nNo it doesn't.\n\nBILLY\nSaint James, Josh, it's religious.\n\nSCENE 16\n\nBILLY\nHi.\n\nJOSH\nHi.\n\nMAN\nBurp!\n\nJOSH\nUh, we would like a hotel room, please.\n\nMAN\n$17.50 a night for the room, $10.00 deposit for the sheets....You go \nstraight to the top of the stairs.  It's the last door on the right.  \nNext to the bathroom.  Wait a second, I'll show you.\n\nSCENE 17\n\nBILLY\nIt smells bad.\n\nJOSH\nShh!\n\nMAN\nHave a pleasant stay....Hey Angel!  Get out of that bathroom now!\n\nJOSH\nI don't want to stay here by myself.\n\nBILLY\nI can't help it Josh.  I've gotta be home by ten.  Look, I'll cut \nclasses tomorrow and we'll find that Zoltar thing before you know it, \nokay?  It's just one night.  All right?\n\nJOSH\nAll right.\n\nBILLY\nGood.\n\nJOSH\nWhat if I can't sleep?\n\nBILLY\nIt's probably better if you don't.  See you in the morning.\n\nJOSH\nWell, you mean like what time?\n\nBILLY\n8:30.  I'd use the chain if I were you.\n\nJOSH\nMom...Mom....\n\nSCENE 18\n\nJOSH\nI told you, it's not a video game.\n\nBILLY\nWell, what is it?\n\nJOSH\nWell, it's not a video game.\n\nBILLY\nThis one's got a number on it.  Does yours?\n\nJOSH\nNo.  Oh wait, here's one.\n\nMAN\nHey, what are doing?  What are doing?\n\nJOSH\nDo you have Zoltar?\n\nMAN\nNo.  I told you, I looked back in the back.  I've got Powerhouse, I've \ngot ...\n\nJOSH\nWe really need Zoltar.\n\nMAN\nWell, I haven't got it.\n\nSCENE 19\n\nBILLY\nThis is it.\n\nJOSH\nThey aren't going to have it.\n\nBILLY\nThey'll have it.\n\nMAN\nCan I help you?\n\nJOSH\nYes.  We would like a list of all carnivals and fairs.\n\nBILLY\nAnd arcades.\n\nJOSH\nYeah.\n\nMAN\nCarnivals and fairs...Try Consumer Affairs, down the hall, room 111.\n\nJOSH\nThank you.\n\nSCENE 20\n\nWOMAN\nFill this out in triplicate.  $5.00 filing charge.\n\nBILLY\nSee.\n\nWOMAN\nOne month to process.  You get in six weeks.\n\nJOSH\nSix weeks?\n\nWOMAN\nSometimes longer, but, you could get lucky....Next please!\n\nSCENE 21\n\nJOSH\nI'm gonna be thirty years old for the rest of my life.\n\nBILLY\nWould you come on.  We'll figure something out.  By the way, you may be \nolder than that!\n\nJOSH\nSo now what?\n\nBILLY\nI'll come and see you everyday after school.\n\nJOSH\nHow?\n\nBILLY\nI'll tell them I made the basketball team.\n\nJOSH\nI won't have anything to do.\n\nBILLY\nYou can get a job.\n\nJOSH\nI can't get a job.\n\nBILLY\nWhy?  It can't be any different than school.  What are you good at?\n\nJOSH\nI don't know.  Making spit balls?\n\nSCENE 22\n\nBILLY\nHow about a delivery man?\n\nJOSH\nI don't know how drive.\nBILLY\nOh yeah, right...Cardiological technician, civil engineer...\n\nJOSH\nYou gonna eat your cherry?\n\nBILLY\nGo ahead....Clerical transcriber...\n\nJOSH\nBilly?\n\nBILLY\nYeah....Gross.  God, that's gross!\n\nJOSH\nHey, go on to the next column.\n\nBILLY\nCollection agent, company clerk, computer operator, construction \nengineer...\n\nJOSH\nComputer operator?  Computer operator, read that one.\n\nBILLY\nJosh, would you quit with your stupid computers!\n\nJOSH\nJust read it!\n\nBILLY\nMacmillan Toys...toys!\n\nJOSH\nToys!\n\nSCENE 23\n\nWOMAN\nMacmillan Toys, may I help you?\n\nBILLY\nOkay, what's next?  There.\n\nJOSH\nPrevious employment.\n\nBILLY\nYour paper route.\n\nJOSH\nI can't put that.\n\nBILLY\nPaper route circulation?\n\nJOSH\nYeah!\n\nBILLY\nWhat's he got?  Hey, don't worry about it.\n\nJOSH\nSocial Security number?\n\nBILLY\n32-17-25.\n\nJOSH\nWhat is that?\n\nBILLY\nMy locker combination.\n\nJOSH\nGreat!\n\nWOMAN\nMr. Baskin.  Mr. Baskin?\n\nJOSH\nYes.  Yes.\n\nWOMAN\nThe Personnel Director will see you now....Uh, you son can wait out \nhere.\n\nJOSH\nYeah, okay.  Son, you should sit down and don't give the lady any \ntrouble now.\n\nBILLY\nSure Dad!  ...Don't forget--look him in the eye!\n\nSCENE 24\n\nMAN\nCouple of numbers missing on your Social Security.\n\nJOSH\nOh, uh twelve.\n\nMAN\nOne two.  Says here you've got four years experience.\n\nJOSH\nYes.\n\nMAN\nAll on computers?\n\nJOSH\nYes.\n\nMAN\nWhere did you go to school?\n\nJOSH\nIt was called George Washington.\n\nMAN\nOh, G.W.  My brother-in-law got his doctorate there.  Did you pledge?\n\nJOSH\nYes.  Every morning.\n\nSUSAN\nIt happened again!  David, the girl is absolutely useless!  You've got \nto get me someone who knows what she is doing!  Excuse me.  I'm not \ngetting any of my mail, nothing has been filed!  Ever since she got \nengaged, my life has been a disaster!  \n\nMAN\nYou know, she came so highly recommended.\n\nSUSAN\nShe spent the last three months writing down her married name.  Mrs. \nJudy Hicks.  Mrs. Donald Hicks.  Mrs. Judy Mitchleson Hicks.  Sometimes \nwith a hyphen, sometimes without a hyphen.  Sometimes she spells the \nhyphen!\n\nMAN\nWell, I really don't know where I can put her.\n\nSUSAN\nPut her on unemployment!\n\nMAN\nWhen can you start?\n\nJOSH\nSoon.\n\nSCENE 25\n\nMAN\nI thought we'd start you out with preschoolers.  Should take you a few \ndays.  Give you a chance to find your way around.  Do you smoke?\n\nJOSH\nWell, uh, just once, but...\n\nMAN\nOnly on breaks in the coffee room....Most of that is pretty straight \nforward stuff.  If you have any questions, come to me.  Good luck.\n\nJOSH\nBye!\n\nSCENE 26\n\nSCOTT\nPsst!  Psst!  Hey!  Hey!  I'm Scott Brennan.\n\nJOSH\nUh, I'm Josh Baskin.\n\nSCOTT\nListen, what are you trying to do?  Get us all fired?\n\nJOSH\nHuh?\n\nSCOTT\nYou've gotta slow down.  Pace yourself.  Slowly!  Slowly!\n\nJOSH\nSorry.  Today's my first day.\n\nSCOTT\nI know!\n\nJOSH\nSo how long have you worked here?\n\nSCOTT\nFive years.  Work stinks but the fringe benefits are great!  See that \ngirl over there in the red?  Say hi to her and she'll be yours.  She'll \nwrap her legs around you so tight you'll be begging for mercy!\n\nJOSH\nWell, I'll stay away from her then!\n\nSCOTT\nExcuse me.  Yeah Brennan.  I gave it to you yesterday!  Oh, here it is.  \nI don't have time to xerox it.  Let the new guy do it.\n\nSCENE 27\n\nMR. M\nThat's total bullshit Paul!\n\nPAUL\nLook sir, the favorability rate is...\n\nMR. M\nCome on!  Let's not lie to ourselves!  If a kid likes a toy it sells.  \nThat's all!\n\nSUSAN\nBut every bit of research and focus testing...\n\nMR. M\nIt works with research, it works with focus testing, it just doesn't \nwork with the kids!\n\nJOSH\nSorry!  I'm sorry!\n\nPAUL\nWhy don't you watch where the hell you're going!\n\nSUSAN\nAre you okay!\n\nMR. M\nI'm fine.\n\nPAUL\nYou could kill somebody running around here like that!\n\nMR. M\nIt's all right Paul.  The boss should get knocked on his ass once in a \nwhile.  It's good for him.\n\nPAUL\nI don't know sir, maybe you should see a doctor.\n\nMR. M\nFor crying out loud Paul, I'm fine!  I'm fine!\n\nPAUL\nSorry sir!  Sorry!\nMR. M\nWhere were you going anyway, son?\n\nJOSH\nUh, I was going to the xerox room because they needed these by 5:00.\n\nMR. M\nOh, that's good!  Nothing wrong with a little hustle.  Nothing at all!  \nRight Paul?\n\nPAUL\nWhat does he mean?  I hustle!  Uh sir!  Sir!\n\nSCENE 28\n\nMOM\nHello?  ...Hello?\n\nJOSH\nHello.  Mrs. Baskin?\n\nMOM\nYes.\n\nJOSH\nHow are you?\n\nMOM\nWho is this?\n\nJOSH\nI just wanted you to know that Josh is all right.  He's okay.\n\nMOM\nYou have my boy?\n\nJOSH\nYeah.  And you're gonna get him back, just the way he was.\n\nMOM\nLook, I swear to God--If you do anything to him, if you touch one hair \non his head, I will spend the rest of my life making sure you suffer!\n\nJOSH\nWow!  Thanks!\n\nMOM\nLet me talk to Josh!\n\nJOSH\nOh, he can't come to the phone right now.\n\nMOM\nWhy not?  Why not?  What did you do to him?!\n\nJOSH\nI didn't do anything to him!  I think he's a terrific kid!\n\nMOM\nI want proof that he's all right!\n\nJOSH\nUh, well, all right.  Ask me something that only he would know.  Then \nI'll ask him for you and that way you'll know that he's okay.\n\nMOM\nAsk him what I used to sing to him when he was a little boy.\n\nJOSH\nIsn't there something else that you would rather ask him?\n\nMOM\nAsk him!\n\nJOSH\nOh, I got it!  I got it!  Memories, like the corner of my mind.  Misty \nwater color memories, of the way we were.  Scattered pictures...Look, \nyou're gonna see him again really soon.  I promise.  I cross my heart.  \nWe'll talk about this later.\n\nSCENE 29\n\nMAN\nHarris!  Brennan!  Baskin!\nJOSH\nWhat is this?\n\nSCOTT\nPay day.\n\nJOSH\n$187.00?!  Ha!  Ha!\n\nSCOTT\nYeah.  They really screw you, don't they?\n\nSCENE 30\n\nJOSH\nHi.\n\nWOMAN\nHi.  Okay, so how would you like that?\n\nJOSH\nThree dimes, a hundred dollar bill, and eighty seven ones.\n\nWOMAN\nOne, two, three...\n\nSCENE 31\n\nJOSH\nI'm never eating again.\n\nBILLY\nIt wasn't that bad.\n\nJOSH\nIt was the boat ride that did it.\n\nBILLY\nNo, it was the pork rinds.\n\nJOSH\nPork rinds!  Aghh!  We sure had fun, didn't we?\n\nBILLY\nYeah, we sure did.\n\nSCENE 32\n\nBOY\nGot you!\n\nJOSH\nWhat's your name?\n\nBOY\nJordan, what's yours?\n\nJOSH\nMine's Josh.\n\nBOY\nI'm gonna blow you away Josh!\n\nJOSH\nBut I just got you!\n\nBOY\nNo way!  Get back here!\n\nSCENE 33\n\nMR. M\nYou work for me, don't you?\n\nJOSH\nYes.\n\nMR. M\nI thought so.  What, are you here with your kids?\n\nJOSH\nNo.  I was just looking around.\n\nMR. M\nOh.  Me too.  I come here every Saturday.  Can't see this on a \nmarketing report.\n\nJOSH\nWhat's a marketing report?\n\nMR. M\nExactly.  Come on.  What do you think of that?\n\nJOSH\nThe Championship Hockey?  Oh, I love it.  Only the...\n\nMR. M\nOnly what?\n\nJOSH\nWell, the pieces don't move.\n\nMR. M\nWhat do you mean?\n\nJOSH\nWell, on the old set you could slide the men up and down the ice, and \nnow all they do is spin around.  It was more like real hockey the old \nway.  Why did they change it?\n\nMR. M\nI don't know.\n\nJOSH\nYou see, the Star Fighters are good because you can change all the \npieces.  But I never liked the Galactakons.  You only get one robot, \nand they don't come with a vehicle.  \n\nMR. M\nI see.\n\nJOSH\nPlus you can't take them underwater.  And if you do they...Neat!\n\nMR. M\nOkay, let's check out the...Piano lessons?\n\nJOSH\nThree years.\n\nMR. M\nMe too.  Everyday, after school....Chopsticks....What department did \nyou say you were in?\n\nJOSH\nOh, I'm in computers.\n\nMR. M\nComputers?  You just saved me a trip to the gym Son.\n\nSCENE 34\n\nSUSAN\nVice President in charge of Product Development.\n\nPAUL\nVice President!  He's only been here a week!  Vice President?!\n\nSUSAN\nAnd he came from data processing!\n\nPAUL\nHe's out of his mind!  The old man has finally lost it!\n\nSUSAN\nDid you know they gave him Bob's old office?\n\nPAUL\nBob's office?!  Bob's office is bigger than my office!  There's got to \nbe a reason.  Things like this don't happen unless there's a reason.\n\nSCENE 35\n\nBILLY\nThat means if the president dies you get to take over?\n\nJOSH\nNo. No.  They got a hundred of them.  Are we ready?\n\nWOMAN\nYes Mr. Baskin.\n\nJOSH\nCome on in.\n\nBILLY\nLook at this place!  It's bigger than the principal's office!\n\nJOSH\nHow would you know?\n\nBILLY\nRemember that explosion in science?\n\nJOSH\nOh yes!\n\nBILLY\nTruck-a-Killer!  $59.95?\n\nJOSH\nYou know that only costs 10 bucks to make.\n\nBILLY\nGet out of here! ...What is this?\n\nJOSH\nOh, well, this is just...They just put this in here...it doesn't mean \nanything.\n\nBILLY\nSo what do they make you do for all this?\n\nJOSH\nWell, I play with all of this stuff and then, I go in there and tell \nthem what I think.\n\nBILLY\nThat's it?\n\nJOSH\nYeah.\n\nBILLY\nAnd they pay you for that?\n\nJOSH\nYeah.\n\nBILLY\nSuckers!\n\nJOSH\nOh, thank you Miss Patterson.  Hey!  Miss Patterson.  Could you call \ndown to Media and have them send up a video tape of the Giants Broncos \nSuper Bowl?  And have them edit out all the commercials and talkin' and \nstuff?\n\nWOMAN\nYes Mr. Baskin.\n\nJOSH\nMiss Patterson.\n\nBILLY\nYou're the luckiest guy I know.\n\nSCENE 36\n\nPAUL\nDid you check Mattel?\n\nSUSAN\nNothing.\n\nPAUL\nColleco?\n\nSUSAN\nZero.\n\nPAUL\nHe can't come from nowhere Susan.  He has to come from somewhere.  How \nabout Hasbro?\n\nSUSAN\nYes.  And Fisher Price and Worlds of Wonder.  I have called everywhere.  \nNobody's ever heard of him!\n\nPAUL\nGreat!\n\nSUSAN\nFace it Paul.  The guy comes from data processing.\n\nPAUL\nTerrific.  That is just terrific!  This is just terrific!\n\nSUSAN\nYou're being paranoid Paul.\n\nSCENE 37\n\nPAUL\nThese tests were conducted over a six month period using a double-blind \nformat of eight over-lapping demographic groups.  Every region of the \ncountry was sampled, the focus testing showed a solid base in the 9 to \n11-year old bracket--with a possible carry-over into the 12-year olds.  \nWhen you consider that Nobots and Transformers pull over 37 percent \nmarket share, and that we are targeting the same area, I think that we \nshould see one quarter of that and that is one fifth of the total \nrevenue from all of last year.  Any questions?  Yes?  Yes?\n\nJOSH\nI don't get it.\n\nPAUL\nWhat exactly don't you get?\n\nJOSH\nIt turns from a building into a robot, right?\n\nPAUL\nPrecisely.\n\nJOSH\nWell, what's fun about that?\n\nPAUL\nWell, if you had read your industry breakdown, you would see that our \nsuccess in the action figure area has climbed from 27 percent to 45 \npercent in the last two years.  There, that might help.\n\nJOSH\nOh.\n\nPAUL\nYes?\n\nJOSH\nI still don't get it.\n\nPAUL\nWhat?!\n\nMR. M\nWhat don't you get Josh?\n\nJOSH\nWell, there's a million robots that turn into something.  And this is a \nbuilding that turns into a robot.  So what's so fun about playing with \na building?  That's not any fun!\n\nPAUL\nThis is a skyscraper.\n\nJOSH\nWell, couldn't it be like a robot that turns into something like a bug \nor something?\n\nPAUL\nA bug?\nJOSH\nYeah!  Like a big prehistoric insect with maybe like giant claws that \ncould pick up a car and crush it like that!\n\nMAN\nA prehistoric transformer?\n\nMR. M\nInteresting.\n\nPAUL\nGentlemen!\n\nMAN\nSo the robot turns into a bug.\n\nPAUL\nAh, gentlemen, listen...\n\nMAN\nListen to him.  He's got a very good idea here.  The robot turns into a \nbug.\n\nMAN\nThis is a great idea!\n\nJOSH\nDifferent sizes and things.  And...you could have them wreck \nsomething...\n\nMAN\nA lady bug.  Transformers for girls!\n\nMR. M\nThis is a bug that moves....It's got all kinds of possibilities.\n\nPAUL\nThis doesn't just happen.  This doesn't happen.  You don't just come to \na meeting and say \"bugs.\"\n\nSUSAN\nI, uh....\n\nMR. M\nWell done, Josh.  Well done.\n\nSCENE 38\n\nPAUL\nHo! Ho! Ho!  He is vicious!  \n\nSUSAN\nHe's not vicious.\n\nPAUL\nOh, come on Susan, don't kid yourself.  That man is a killer!\n\nSUSAN\nAll he said was \"I don't get it.\"\n\nPAUL\nI don't get it!  I don't get!  I don't get!  He's going for the throat, \ntrying to eviscerate me!  Did you see the look on Macmillan's face?!\n\nSUSAN\nMmm Hmm.\n\nSCENE 39\n\nREALTOR\nIt's quite a unique space.  The lines are so clean and you don't get \nany of that partition quality.  It has 50-foot ceilings, all hardwood \nfloors, ample closet space, a modern kitchen, a brand new bathroom with \na jet stream jacuzzi.\n\nBILLY\nWe'll take it.\n\nSCENE 40\n\nMAN\nBaskin.  Rental delivery!\n\nJOSH\nDear Mom and Dad.  They said that I could write you and let you know I \nwas okay.  So far, they're treating me fine.  I've got enough to eat \nand I'm perfectly safe.  They say that I'll get out of here in about a \nmonth.  In the mean time, it's a lot like camp!  I watch TV and even \nget outside once in a while.  I know you miss me.  But try not to \nworry.  I think this experience might even be good for me.  I love you \nvery much and I know that I'll see you soon.  Your son, Joshua.  P.S.  \nGive Rachel a kiss from her big brother.\n\nSCENE 41\n\nWOMAN\nIt's very beautiful and I'm having a lovely time.\n\nMR. M\nI'm glad Miss Patterson.\n\nWOMAN\nIt's much better than last year.  I just wanted to tell you that.\n\nMR. M\nI'll have another scotch....Susan.\n\nSUSAN\nLove your tux.\n\nMR. M\nI think it's the same as the maitre's.\n\nSUSAN\nHave you decided what you're doing on the Danberry line?\n\nMR. M\nNo, I haven't.\n\nSUSAN\nWell, uh, I think if you got everyone's input up front, I mean right \nfrom the beginning....\n\nMR. M\nSusan, have a drink.\n\nSUSAN\nWhat?\n\nMR. M\nHave a couple drinks.  It's a party.\n\nSCENE 42\n\nMR. M\nJosh!  Glad you could make it.\n\nMAN\nBet he gets another raise.\n\nMR. M\nNow that's what I call a tuxedo.\n\nJOSH\nI rented it.  This is a real bow tie though.  I tied it myself.  And \nthat's why I was late.\n\nMR. M\nNo, you're not late at all.  Come on, let me show you around.\n\nJOSH\nHey, there's Miss Patterson!  Hi!  There's the guy from the meeting!  \nHi!\n\nSCENE 43\n\nPAUL\nThe guy's a damn knock-off artist.\n\nMAN\nWhat do you mean?\n\nPAUL\nThe Amphibian?  He takes 10,000 G. I. Joes, slaps some gills on them, \nwebs their feet, and packages them in seaweed....So I show him the \nschedule and he says, \"It's not correct accounting procedure!\"  Give me \na goddamn break!\n\nMAN\nBut the toy sold Paul.\n\nSUSAN\nExcuse me.\n\nSCENE 44\n\nSUSAN\nHi.\n\nJOSH\nHi.\n\nSUSAN\nAll the same people having all the same discussion.  It's like they \ncloned some party in 1983 and kept spinning it out again and again and \nagain.  I loved your ideas on the Squeezy Doll line.  \n\nJOSH\nThanks.\n\nSUSAN\nThey were so, incisive.  It's Beluga.  Macmillan orders it every \nyear....You all right?  You okay?  You want a glass of water?  You want \nsomething to drink?\n\nJOSH\nCould I have a milkshake or something?\n\nSUSAN\nI've got a car outside.  You want to get out of here?\n\nJOSH\nUh Huh.\n\nSUSAN\nLet's go.\n\nSCENE 45\n\nSUSAN\nI'm not really a big one for parties.  You know, I like things that are \na little more intimate.  \n\nJOSH\nWow!  Is this your car?\n\nSUSAN\nWell, it's the company's car.\n\nJOSH\nOh, this is the coolest thing I've ever seen!\n\nSUSAN\nI mean, just seeing someone in the office, you don't really get a \nchance to know them.  I mean, just being with you here tonight, I \nreally get a sense of who you are.\n\nJOSH\nAre you gonna eat these fries?\n\nSUSAN\nNo. No....\n\nJOSH\nHey mister?  You want some of these fries?  We're not going to eat \nthem.\n\nDRIVER\nNo, thank you.\n\nSUSAN\nYou see, it's hard in a business situation...I mean there's this \ninvisible line and even you're attracted to someone...What, are you \ngoing to call someone before...?\n\nJOSH\nNo.\n\nSUSAN\nUh, I mean at this point in my life I...Don't...Don't play with the \nradio...Leave the uh...Don't...I'm really vulnerable right now!  You \nknow...I mean, I love my job and I....\n\nJOSH\nEjector seat!  This is great!  Hey!  Come on up!  Hey, that was my \napartment.\n\nSUSAN\nReally?  I'd love to see where you live.\n\nSCENE 46\n\nSUSAN\nSo have you always lived alone?\n\nJOSH\nNo, not always.\n\nSUSAN\nAh.  Is it just recently or...?\n\nJOSH\nYeah.\n\nSUSAN\nGive yourself a couple of days, it'll pass.\n\nJOSH\nWell, they said it was gonna take six weeks.\n\nSUSAN\nWell, it can be painful but, that's what they invented Xanax for, \nright?\n\nJOSH\nWatch your step.\n\nSUSAN\nI'm not sure we should do this yet.\n\nJOSH\nDo what?\n\nSUSAN\nWell, I mean I like you and I want to spend the night with you....\n\nJOSH\nDo you mean sleep over?\n\nSUSAN\nWell,...yeah!\n\nJOSH\nOkay!  But I get to be on top!\n\nSCENE 47\n\nSUSAN\nYou live here?\n\nJOSH\nYeah.  It's nice, isn't it?\n\nSUSAN\nYeah.\n\nJOSH\nYou uh, want a soda?\n\nSUSAN\nHuh?\n\nJOSH\nSoda?  You want one?\n\nSUSAN\nYeah, sure.\n\nJOSH\nThey rigged this up so you don't need any quarters....Don't!  Don't...!\n\nSUSAN\nWhat?\n\nJOSH\nThe glue's not dry.  Sorry.\n\nSUSAN\nSorry.\n\nJOSH\nIt's okay....You wanna play pinball?\n\nSUSAN\nNo.\n\nJOSH\nYou don't need quarters for this either.  It's free.\n\nSUSAN\nNo, thank you.\n\nJOSH\nOkay.\n\nSUSAN\nIs that a trampoline?\n\nJOSH\nYeah.  You wanna try it?\n\nSUSAN\nNo.\n\nJOSH\nYou should.  It's really fun.  It's simple, too.  Come on!  Come on!  \nYou'll like it and it's really easy to do.\n\nSUSAN\nNo, I don't think...\n\nJOSH\nI'm serious...\n\nSUSAN\nDo have some wine?\n\nJOSH\nTake off your shoes...It's really easy....Let me get rid of these \nballs.\n\nSUSAN\nNo, I'm...I'm...I'll watch.\n\nJOSH\nCome on.  It's fun.  I'll do it with you.  Up you go.  Excellent.\n\nSUSAN\nHelp me up?\n\nJOSH\nSure.\n\nSUSAN\nOkay.\n\nJOSH\nOkay.  Jump.  \n\nSUSAN\nYou want me to jump?\n\nJOSH\nYes.\n\nSUSAN\nThere.  Now can we have a drink?\n\nJOSH\nNo!  No!  No!  I mean really jump.  Now get some air between you and \nthe trampoline.\n\nSUSAN\nThere.\n\nJOSH\nOh, come on!  I'll do it with you!  All right?  I'll show you how to do \nit.  You ready?  Come on.  Jump.  See?  There it is.  That's all there \nis to it.  There you go.  There you go.  Yeah!  It's easy!  Anybody \ncould do this!\n\nSCENE 48\n\nJOSH\nHere.  Pick one....It's for you.  It's a glow in the dark compass \nring...so you won't get lost....Goodnight.\n\nSCENE 49\n\nPAUL\nDid you have fun last night?\n\nSUSAN\nSure.  Yeah.\n\nPAUL\nYeah...You left pretty quick.\n\nSUSAN\nI gave him a ride home Paul.\n\nPAUL\nOh, did he enjoy it?\n\nSUSAN\nDon't be ridiculous.\n\nPAUL\nAh, that's me, Mr. Ridiculous.  Just a silly old guy.\n\nSUSAN\nI don't feel like going out tonight.\n\nPAUL\nWhat do you mean?  They're your friends....Come on!  Leave it!  Leave \nit!  Would you quit it!  Do you have to play with everything?\n\nSCENE 50\n\nPAUL\nBaskin?  Baskin!\n\nJOSH\nWouldn't you rather play basketball?  I know how to play that.  We \ncould be like a team for the Macmillan Company.\n\nPAUL\nNo.\n\nJOSH\nI'm not very good at sports, but I'll give it a try.  My best sport is \nvideo hockey.\n\nPAUL\nThat isn't a sport.\n\nJOSH\nWell, it takes eye to hand coordination.\n\nPAUL\nIt's not a sport if you don't sweat!\n\nJOSH\nWhat about golf?  You don't sweat and that's a sport.\n\nPAUL\nYeah, and you're not sittin' there letting some machine do all the \nwork!\n\nJOSH\nWhat about car racing?\n\nPAUL\nAw shut up Baskin!\n\nJOSH\nWhat are the rules again?\n\nPAUL\nI told you.  Over the line to serve.  Yellow is out of bounds.  Play to \n21--ready?\n\nJOSH\nSorry.  Sorry.\n\nPAUL\nOne nothing.  Come on!  Get it!  Get it!  Get it!\n\nJOSH\nOkay.\n\nPAUL\nThatta boy!  Okay, you ready?  All right....Ho ho!  Nice try!  That was \nin!  Two zip.  Just made it.  Two zip.  Ready?  Okay!  Here we \ngo!...19/18.\n\nJOSH\nUh, that was under the line.\n\nPAUL\nWhat?\n\nJOSH\nThat was under the line.  You said it had to be over the line on a \nserve.\n\nPAUL\nNo I didn't.\n\nJOSH\nYeah you did!  You said it had to be over the line on a serve!\n\nPAUL\nNo I did not, now give me the goddamn ball!\n\nJOSH\nWell that's cheating!\n\nPAUL\nGive me the goddamn ball, will ya!\n\nJOSH\nNo!\n\nPAUL\nGive me the ball you little shit!  \n\nJOSH\nIt's my serve.\n\nPAUL\nGive me the ball!  Give me the goddamn ball!  I never said that!\n\nJOSH\nYes you did.\n\nPAUL\nGive me the...Give me the ball!  Give me the ball!\n\nJOSH\nCheater!  You cheat!\n\nPAUL\nI did not cheat!\n\nJOSH\nYou cheat!  You cheat!\n\nPAUL\nGive me the ball!  Give me the ball!  Give me it!  Give me the ball!\n\nSCENE 51\n\nJOSH\nHe didn't have to punch me.\n\nSUSAN\nI know.  He's scared of you.  You don't play his game.\n\nJOSH\nI tried to play his game.  He beat me up.  If he's scared of me then \nwhy did he punch me?\n\nSUSAN\nHe punched you because he's scared of you.\n\nJOSH\nI don't get it.\n\nSUSAN\nIt's just the way he is.  Everything is a fight with him.  Everyone's \nan enemy.  It's not just a job for him, it's a war.  \n\nJOSH\nWell how come you're so nice?\n\nSUSAN\nWhat?\n\nJOSH\nWell, you work just as hard as he does and you're not like that.\n\nSUSAN\nYou don't...you don't know me that well.\n\nJOSH\nYes I do.  You're one of the nicest people I've met.\n\nSUSAN\nHow do you do it?\n\nSCENE 52\n\nPAUL\nWhat's this?\n\nSUSAN\nWhat does it look like?!  Shampoo, razor, toothpaste, two neckties and \nyour exercise tape!  Oh, and I want my keys back!\n\nPAUL\nSure.  It's just some scratches.  He'll get over it.\n\nSUSAN\nOh, it has nothing to do with him.\n\nPAUL\nOh come on Susan!  He's just another link in the chain!  First it was \nTom Caulfield, then Handlen.  Then Golding, then me!  Am I missing \nsomebody?\n\nSUSAN\nIt's not like that anymore!\n\nPAUL\nWhat is so special about Baskin?\n\nSUSAN\nHe's a grown up!\n\nPAUL\nSusan.\n\nSUSAN\nI can't believe you brought up Golding.\n\nSCENE 53\n\nBILLY\nAnd many more!  What are you going to wish for this time?\n\nSCENE 54\n\nBILLY\nI know what we can do!  We can go out and get some beers, some dirty \nmagazines and go back...\n\nJOSH\nUh, I can't Billy.\n\nBILLY\nWhat you mean you can't?  Of course you can!  It's your birthday!\n\nJOSH\nNo, I can't...I have to go somewhere.\n\nBILLY\nWhere?\n\nJOSH\nUm...well, I have to go meet somebody and...\n\nBILLY\nSo, you got all night!\n\nJOSH\nYeah I know, but it's just...well I can't right now okay, but I'll call \nyou, all right?  Okay?  I'll give you a call.  Thanks again Billy, it \nwas fun!\n\nSCENE 55\n\nSUSAN\nHi....Do you want to come in?\n\nJOSH\nSure.\n\nSUSAN\nSit down....Want to go?\n\nJOSH\nYeah!  Yeah!\n\nSCENE 56\n\nJOSH\nWant to go again?!\n\nSCENE 57\n\nJOSH\nSo they have these cars that you can actually drive them except they're \non this rail so you can't get off the road...You have a really big gob \nof mustard right, right...\n\nSUSAN\nWhat?\n\nJOSH\nMustard right....\n\nSUSAN\nWhere?\n\nJOSH\nRight there.\n\nSUSAN\nIs it gone?\n\nJOSH\nWell,....\n\nSUSAN\nIs that...gone?\n\nJOSH\nYeah.\n\nSUSAN\nListen.\n\nJOSH\nWhat?  Music?\n\nSUSAN\nWanna dance?\n\nJOSH\nDance?\n\nSUSAN\nWell we don't have to if you don't want to.\n\nJOSH\nOkay.  Okay.\n\nSUSAN\nAll right.\nJOSH\nOkay....Are you cold?\n\nSUSAN\nMm Mm.\n\nJOSH\nWe could get some hot chocolate....You can wear my jacket if you want.\n\nSCENE 58\n\nSUSAN\nOh, I haven't done this in a long time....What were you like when you \nwere younger?\n\nJOSH\nOh, I wasn't much different.\n\nSUSAN\nI believe that about you....I've been thinking about you a lot....It's \ncrazy....In my car, lying in bed....I've just never gone out with \nsomeone like you....With all the other men there was so much to \nhide....I feel like I can tell you anything.\n\nJOSH\nSusan?  There's something I think I should tell you.\n\nSUSAN\nWhat?\n\nSCENE 59\n\nSUSAN\nYou want the light on?\n\nSCENE 60\n\nJOSH\nHey Frank, how are you?  Good morning everybody!\n\nWOMAN\nGood morning Sir.\n\nJOSH\nI'd like some coffee please Miss Patterson.\n\nWOMAN\nBut you don't drink coffee.\n\nJOSH\nAnd uh, make it black.\n\nSCENE 61\n\nWOMAN\nYou know, you two should come to Vermont.  It is so pretty up there.\n\nMAN\nDid anyone happen to see that great documentary about Columbus on PBS \nthe other night?  \n\nWOMAN\nUh, no.  Was it good?\n\nMAN\nI had no idea he had a fourth ship.\n\nJOSH\nYeah, the Santa Christina.\n\nMAN\nThat's right.\n\nJOSH\nHe only had that on his second trip, though.\n\nMAN\nYou saw it, too.\n\nJOSH\nNo, but I used to study...stuff.\n\nMAN\nReally?\n\nBOY\nDad, I need some help.\n\nMAN\nAll right, but not now Adam.\n\nBOY\nYeah, but Dad you said...\n\nMAN\nAdam we have guests.\n\nWOMAN\nHe's had the roughest time with algebra.  We've tried tutors, \neverything.\n\nJOSH\nAlgebra?  I used to study that, too.\n\nSCENE 62\n\nJOSH\nAll right, let's say Larry Bird is going to score 10 points in the \nfirst quarter.\n\nBOY\nOkay?\n\nJOSH\nHow many is he going to score in the whole game?\n\nBOY\nThat's easy, that's 40 points.\n\nJOSH\nProbably.  Okay.  And that's algebra.\n\nBOY\nRight!  It is?\n\nJOSH\nYeah!  See.  Okay.  One quarter is to ten points that he scores in that \nquarter.  Just as four....\n\nWOMAN\nYou're right.  He's wonderful!\n\nSUSAN\nI know.\n\nSCENE 63\n\nBILLY\nDepartment of Consumer Affairs?  Yeah Buddy it came!\n\nSCENE 64\n\nMAN\nHe's never done this before.\n\nMAN\nKind of like a sweepstakes.\n\nPAUL\nGet the Art Department on the phone.  Get them!\n\nSUSAN\nSend out for some sandwiches.\n\nMR. M\nMaybe next year, all right?  Next year.\n\nSCENE 65\n\nSUSAN\nYou can do it.  I know you can!\n\nJOSH\nI cannot plan a whole line!\n\nSUSAN\nWhy?  Nobody knows more about toys in the entire company!\nJOSH\nSusan, doing that means marketing and strategy and stuff like that!\n\nSUSAN\nAll he wants is a proposal!\n\nJOSH\nI can't!\n\nSUSAN\nLook, you come up with the ideas and I'll handle the marketing.\n\nJOSH\nBut it's....\n\nSUSAN\nCome on.  It'll be neat.\n\nJOSH\nAll right...I don't know...I don't have any new ideas for toys or \nanything.\n\nSUSAN\nYou've got great ideas!\n\nSCENE 66\n\nBILLY\nYeah, well tell him I called again.  Kopecky!  K-O-P...Yeah \nright...well tell him it's important!\n\nSCENE 67\n\nJOSH\nYou see it won't be like these where you just follow the story along.  \nYou would actually make a whole different story appear just by pressing \nthese buttons.\n\nSUSAN\nAn electronic comic book?  That's amazing!\n\nJOSH\nYeah.  An electric comic book.  It's gonna be different every time.\n\nSUSAN\nThis is incredible.  You're brilliant--you know that?\n\nJOSH\nIf you like one you could see it, you know, over and over and over \nagain.\n\nSUSAN\nYou're wonderful.\n\nJOSH\nYou really like it?...You think Mac will like it?  You know, what we \ncould do...We could do like sports comics...or like if you're going to \nsteal second or something like that...You'd have sports \nbooks...baseball, football...really, it work with almost any sport \nthere is.  Hockey!\n\nSUSAN\nWhat...What is it we're doing?  ...What's going on here?  \n\nJOSH\nYou know, we're....Is something wrong?  You don't like it?\n\nSUSAN\nNo!  No!  It's...I mean if it's an affair, that's one thing.  But if \nit's something else...I mean, not that we have to know right now, we \ndon't...but if we think that it could turn into something \nelse...well....How do you feel about all of this?\n\nJOSH\nHow do I feel about what?\n\nSUSAN\nHow do you feel about me?\n\nJOSH\nWhat is that supposed to mean?\n\nSCENE 68\n\nJOSH\nWell, Wednesday would be better than Thursday...\n\nWOMAN\nMr. Baskin can't be disturbed!\n\nJOSH\nYeah, I have the Keating example right here...\n\nBILLY\nWhere've you been?  I've been trying to reach you forever!\n\nJOSH\nShh!  I'm right in the middle of something okay?\n\nBILLY\nThat's the list.  All you've got to do is call!\n\nJOSH\nCan you give me just a minute, please?\n\nBILLY\nWhat are you talking about?  This is the list!\n\nJOSH\nWould you come back at lunch?  All right, I'm a little bit busy right \nnow...Hello?\n\nBILLY\nBusy?!\n\nJOSH\nBilly!\n\nBILLY\nAre you out of your mind?!  \n\nJOSH\nJesus, Billy!  Miss Patterson, could you get them on the phone \nagain....\n\nBILLY\nThis is the list we've been waiting for!\n\nJOSH\nI've got work to do!  Can't you understand that?  I've got a deadline \nto meet.  God!\n\nBILLY\nWho the fuck do you think you are?!\n\nJOSH\nHey!\n\nBILLY\nHey, you're Josh Baskin!  Remember?  You broke your arm on my roof!  \nYou hid in my basement when Robert Diceman was about to rip your head \noff!\n\nJOSH\nYou don't get it, do you?  This is important!\n\nBILLY\nI'm your best friend.  What's more important than that, huh?  I'm three \nmonths older than you are--asshole!\n\nSCENE 69\n\nJOSH\nYou are standing in the cavern of the evil wizard.  All around you are \nthe carcasses of slain ice dwarfs....Melt wizard....What do you want to \nmelt him with?  ...Throw thermal pod.\n\nSUSAN\nJosh, what's wrong?  What is it?\n\nJOSH\nI haven't told you something because if I did, I didn't think you'd \nbelieve me.  And even if you did believe me, I didn't think you were \ngoing to like me anymore, so....\n\nSUSAN\nOh, Honey, come here.  You can tell me anything.  What?\n\nJOSH\nSusan, I'm not what you think I am.\nSUSAN\nWhat do you mean?\n\nJOSH\nBefore I met you I was in little league.  I was in little league and I \nrode my bike to school and I played with my friends and hung out with \nthem and....\n\nSUSAN\nJosh.  Josh.  What are you talking about?\n\nJOSH\nI want to go home.  I miss my family Susan and I want to go home.\n\nSUSAN\nOh my God!  You're married!\n\nJOSH\nNo!  No!\n\nSUSAN\nI knew that this was too good to be true!  I knew that there had to be \nsomething!\n\nJOSH\nNo.  No.  Susan, I'm not married.\n\nSUSAN\nYou're not?\n\nJOSH\nNo.  I'm a child!\n\nSUSAN\nWhat?\n\nJOSH\nI'm a child Susan, and I'm not ready for all this.\n\nSUSAN\nOh that's fine.  That is just great!\n\nJOSH\nWell, you see what happened....\n\nSUSAN\nNo.  I understand.  I'm not ready to make a commitment!\n\nJOSH\nNo!  No!  No!\n\nSUSAN\nI'm not ready to accept responsibility!\n\nJOSH\nNo!  You don't understand!  I mean, I'm thirteen years old!\n\nSUSAN\nOh!  And who isn't?  You think that there isn't a frightened kid inside \nof me, too!\n\nJOSH\nNo!  I mean I really am thirteen!  I went to bed one night and I was a \nkid, and when I woke up the next morning I was a grown up.\n\nSUSAN\nOh right!  And just yesterday I was a school girl with pigtails!  Why \nare you doing this Josh?\n\nJOSH\nThere was this carnival in New Jersey.  I made a wish on this machine.  \nIt was called a Zoltar Machine...\n\nSUSAN\nOh stop it!\n\nJOSH\nIt was called a Zoltar Machine!  It had this bobbing head that looked \njust like a devil and if you got a quarter in the devil's mouth you \ncould make a wish and I did!  So I made a wish to be big!  That is what \nI'm trying to tell you!  I changed into a grown up but I'm really just \na kid!\n\nSUSAN\nFine Josh!  You're a kid!  Look, I really don't know what it is that \nyou're trying to tell me.  But we have a very big presentation to give \ntomorrow, so I'm going to get some sleep.\n\nSCENE 70\n\nBILLY\nJosh?  Josh!  Oh, hi Mrs. Baskin.\n\nMOM\nHi.  I was just looking around and...Your hair is getting longer.\n\nBILLY\nI got it cut yesterday.\n\nMOM\nHe had a birthday.\n\nBILLY\nYeah, I know.  He'll be coming back real soon.  Everything is going to \nbe okay.\n\nMOM\nThanks.\n\nBILLY\nGoodnight.\n\nSCENE 71\n\nBILLY\nRight there.  Sea Point Park, New York!  Well?\n\nJOSH\nYes?\n\nWOMAN\nThey're waiting for you Mr. Baskin.\n\nJOSH\nThanks.\n\nBILLY\nSee you around.\n\nSCENE 72\n\nJOSH\nThere's this flat screen inside with pictures on it and you read it.  \nAnd when you get down to the bottom you have to make a choice of what \nthe character's going to do...Like if he going to go in and fight the \ndragon then you have to push one of the buttons.\n\nPAUL\nExcuse me.\n\nJOSH\nPaul.\n\nPAUL\nI don't get it.\n\nJOSH\nWell, it's a comic book that....\n\nSUSAN\nSee, there's a computer chip inside which stores the choices, so when \nyou reach the end of the page, you decide where the story goes.  That's \nthe point.\n\nMR. M\nTerrific Susan.\n\nSUSAN\nA kid makes his own decision.\n\nMR. M\nThis is really possible?\n\nSUSAN\nYeah.  In fact, it's a very simple program.  Isn't that right?\nMAN\nSo what happens when you run out of choices?\n\nSUSAN\nWell, that's the great thing.  You can just sell different adventures.  \nJust pop in a new disk and you get a whole new set of options.\n\nMAN\nWe could market this on a comic book rack.\n\nJOSH\nI'll be right back.\n\nSCENE 73\n\nMR. M\nHow much would the unit cost?\n\nSUSAN\nWell, our initial figure is around...around $7.00, with a retail cost \nof around $18.95.\n\nPAUL\nYou expect a kid to pay $19.00 for a comic book?\n\nSUSAN\nI think a kid....Would you excuse me?\n\nSCENE 74\n\nSUSAN\nJosh!  Josh!\n\nSCENE 75\n\nJOSH\nWill you take me to Sea Point Park, New York?\n\nBILLY\nSea Point Park?  Josh!....Josh!  Josh!...Yes!\n\nSCENE 76\n\nSUSAN\nExcuse me.  You know him?  You know Josh?\n\nBILLY\nYeah.\n\nSUSAN\nLook, you have to tell me where he went.\n\nBILLY\nWho are you?\n\nSUSAN\nI'm his girlfriend.\n\nBILLY\nBilly Kopecky.\n\nSUSAN\nLook, you have to tell me where he went.  Where did he go?  Please, \ntell me.  Tell me!\n\nSCENE 77\n\nJOSH\nWork!  Damn it!....I wish I was a kid.\n\nSUSAN\nJosh!\n\nJOSH\nSusan!\n\nSUSAN\nYou know, you don't walk out on somebody!  You don't just get up and \nleave and walk out like that!  You don't do that!\n\nJOSH\nI know.  I know.  I'm really sorry.  I'm really sorry but I didn't know \nwhat to do.  I didn't know what to say.\n\nSUSAN\nOh God.  You got your wish.\n\nJOSH\nI tried to tell you.\n\nSUSAN\nI didn't listen, I guess.  I didn't hear you...\n\nJOSH\nI tried to tell you last night.\n\nSUSAN\n...or want to...or how would I have...or even if I did listen, why \nwould I know?  Why would I know that?!\n\nJOSH\nI've been thinking about this and there are a million reasons for me to \ngo home but there is only one reason for me to stay.\n\nSUSAN\nWhat?  What reason is that?\n\nJOSH\nWell, you...Oh, come on.  Don't cry.\n\nSUSAN\nSo, what are you?  15?  16?\n\nJOSH\nI'm 13.\n\nSUSAN\nWell, that explains it.\n\nJOSH\nMaybe you could come with me.\n\nSUSAN\nNo.  No.\n\nJOSH\nWhy not?\n\nSUSAN\nI've been there before.  It's hard enough the first time.  You know \nwhat I mean?  You don't know what I mean....Come on, I'll drive you \nhome.\n\nJOSH\nI'm sorry.\n\nSUSAN\nNo, I'll be okay.  You'll be fine.  In ten years, who knows?  Maybe you \nshould hold on to my number.\n\nSCENE 78\n\nSUSAN\nSo this is where you live.  Which one is it?\n\nJOSH\nThe one right there.\n\nSUSAN\nOh.  It's nice.  I'm gonna miss you.\n\nJOSH\nI'm gonna miss you, too.\n\nSUSAN\nYou won't even remember me.\n\nJOSH\nOh yes I will.\n\nSCENE 79\n\nJOSH\nMom?  Hello!\nMOM\nJosh?  Josh!  Josh!  Oh my God!  Oh, thank God you're home!\n\nJOSH\nOh Ma, I missed you all so much!\n\nSCENE 80\n\nJOSH\nI'm just not good enough.\n\nBILLY\nWhat are you talking about?  You've been hitting the ball over the \nfence almost every time in stick ball.  You just got to get used to a \nfatter bat.\n\nJOSH\nYou really think I could do it?\n\nBILLY\nYeah!\n\nJOSH\nCome on.  We'll hit some after supper.\n\nBILLY\nOkay.  I'll call you.\n1\n\n\n34\n\n\n\n\n\n\n\n\nBig\nWriters :   Gary Ross  Anne Spielberg\nGenres :   Comedy  Family  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:45.246749"}