{"title": "Black Snake Moan", "film_link": "/Movie Scripts/Black Snake Moan Script.html", "script_link": "/scripts/Black-Snake-Moan.html", "info_raw": "\n\nBlack Snake Moan Script\n\n\n\n\nIMSDb opinion  Didn't do much for me.\nIMSDb rating   (5 out of 10)\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Craig Brewer\nGenres  Drama\nMovie Release Date : March 2007\n\nRead \"Black Snake Moan\" Script\n\n\n", "script": "\n\n\n\n\n\n                                     BLACK SNAKE MOAN \n\n\n\n\n                                        Written by\n      \n                                       Craig Brewer\n\n\n\n                \n\n               Only one kind of blues... \n               And that consists between male and female. \n               - Son House\n\n                \n\n               EXT. RONNIE'S TRAILER - EARLY DAWN\n\n               RAE is naked.\n\n               Wrapped around her shoulders is a loose-knit spread that \n               conceals her slender form. She is in her 20's: a strawberry \n               blond, with cinnamon freckles spotted across her pale skin. \n               She is beautiful without trying.\n\n               She stares at the distant trees. This is the South; the small \n               town of FISHERVILLE, TENNESSEE.\n\n               Soon Rae will be alone.\n\n                                                                    CUT TO:\n\n               INT. RONNIE'S TRAILER - EARLY MORNING\n\n               RONNIE is 25 years old. His hair is cropped in a military \n               issue buzz.\n\n               Rae's face is wet with tears as Ronnie gently makes love to \n               her. She touches his face and sobs like a child.\n\n                                                                    CUT TO:\n\n               INT. RONNIE'S TRAILER - LATER THAT MORNING\n\n               RONNIE is dressed in his National Guard fatigues, packing up \n               his gear.\n\n               Rae is now wearing a short jeans skirt and a T-shirt with a \n               gray wolf print ironed on the front. There is a knock at the \n               door. Rae flinches. Ronnie opens the door revealing GILL \n               MORTON, Ronnie's buddy from high school.\n\n                                     GILL\n                         Still need a lift?\n\n                                     RONNIE\n                         Yeah. Transmission's shot.\n\n               Gill and Rae's eyes meet. Gill sees that Rae is crying.\n\n                                     GILL\n                         Gonna have a smoke.\n\n               Ronnie shuts the door and feels a wave of sudden nausea. He \n               rushes past Rae.\n\n                                     RONNIE\n                         Shit...\n\n               INT. RONNIE'S TRAILER - BATHROOM - MORNING\n\n               Ronnie is vomiting into the toilet as Rae rubs his head. \n               Each painful dry heave makes Rae comfort him more.\n\n                                     RAE\n                         Baby...\n\n               EXT. RONNIE'S TRAILER - MORNING\n\n               Ronnie places his duffle bag in Gill's truck. Rae begins to \n               cough.\n\n                                     GILL\n                         You sick?\n\n               Rae doesn't answer.\n\n               Gill backs away, allowing Ronnie and Rae some privacy. The \n               two lovers stare into each others eyes and then embrace.\n\n               Rae peeks over Ronnie's shoulder at Gill with an expression \n               of dread. Anger seizes her.\n\n                                     RAE\n                         This ain't gonna work.\n\n                                     RONNIE\n                         Rae...\n\n                                     RAE\n                         I don't see why we gotta lie 'bout \n                         it when you and I know this ain't \n                         gonna work.\n\n                                     RONNIE\n                              (holds her face in \n                              his hands)\n                         Rae don't do this now...\n\n                                     RAE\n                         It's stupid... It's so fucking stupid!\n\n                                     RONNIE\n                         Rae!\n\n               Silence. Rae melts. Tears stream down her face.\n\n                                     RONNIE\n                              (reaches in his pocket)\n                         Look it. I got somethin' for us. \n                         This is gonna help, okay.\n\n                                     GILL\n                         You gonna miss your bus.\n\n               Ronnie removes a small digital watch and fastens it around \n               her wrist.\n\n                                     RONNIE\n                         This watch here is gonna beep at \n                         midnight. Every night. That's when \n                         it comes up on you the hardest, right?\n\n               Ronnie holds out his own wrist to show her his identical \n               watch.\n\n                                     RONNIE\n                         And wherever I'm at, my watch'll \n                         beep, too. We'll be thinkin' bout \n                         each other at the same time. Wherever \n                         we are.\n\n               Rae is shaking. He grips her by the back of her neck and \n               pushes their faces inches away. Eye to eye.\n\n                                     RONNIE\n                         I gotta believe we can do this or I \n                         ain't gonna make it, Rae.\n\n               Rae sees the fear in his eyes. She swallows her own anxiety \n               and nods.\n\n                                     RAE\n                         Okay... Okay.\n\n               They kiss passionately.\n\n                                     RONNIE\n                         I love you.\n\n               Afraid of his swelling emotion, Ronnie quickly breaks away \n               from her.\n\n               Rae watches as her love leaves in Gill's pick-up. Compelled \n               to follow, she absently walks after the truck, down the gravel \n               drive.\n\n               She stops. Silence. She is alone.\n\n               An intense wave of sorrow hits, like a kick to her gut. She \n               gasps for breath as she struggles to hold back the flood of \n               her tears.\n\n               Rae drops to her knees, right there in the gravel drive. Her \n               hair falls in front of her face, masking her grief.\n\n               Her shoulders shudder.\n\n               Her middle finger begins to scratch at her thigh repeatedly -- \n               a nervous habit that has always accompanied this burning \n               sensation that consumes her.\n\n                                     RAE\n                         Shit.\n\n               Tears come to her. She's not going to be able to stop it.\n\n                                     RAE\n                         Goddammit, Ronnie...\n                              (shouting in \n                              frustration)\n                         GODDAMMIT!\n\n               Rae is gripping the watch around her wrist for comfort. Her \n               breathing is already out of her control. The dizziness is \n               already upon her. The familiar burning.\n\n               She inhales in gasps, rocking back and forth on her knees. \n               The late morning cicadas chirp in an undulating frenzy.\n\n                                     RAE\n                              (shaking her head)\n                         Mm-mm\n                              (meaning \"no\")\n                         Mm-mm... Mm-mm...\n\n               The scratching at her leg leaves a red mark. She is dizzy \n               with anxiety. Her teeth are clenched, her face is flush.\n\n                                     RAE\n                         MM-MM! MM-MM! MMMMMMMMMMMM!\n\n                                                                    CUT TO:\n\n               INT. MOTEL ROOM - AFTERNOON\n\n               TEHRONNE is fucking Rae from behind.\n\n               Tehronne is a muscular, dark-skinned, black male in his late \n               twenties.\n\n               Rae's face is crammed up against the mirror in the small \n               bathroom. Tehronne gets faster and pushes harder -- a stark \n               contrast to her lovemaking with Ronnie.\n\n               Rae comes. A severe coughing fit hits her. She pushes him \n               away with her ass.\n\n                                     RAE\n                         We're done, right?\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE SQUARE - AFTERNOON\n\n               Walking with his hands shoved deep into his pockets, wearing \n               his only suit and tie, is LAZARUS WOODS (LAZ). He is in his \n               late fifties, black, a strong face under his old fedora. He \n               stares across the street into Dunn's Cafe.\n\n               ROSE WOODS, black, early forties, stands in the cafe. She \n               looks confident and resolute in her new green skirt.\n\n               A brown Delta Olds pulls up into a parking space in front of \n               Laz. Stepping out is REVEREND R.L., Laz's longtime friend. \n               He is also black and in his late fifties.\n\n                                     R.L.\n                         You ain't gonna make a fuss, are \n                         you?\n                              (no answer)\n                         Nothing a man can do when a woman \n                         make up her mind.\n\n                                     LAZARUS\n                         I never laid a hand on her in anger. \n                         Not a day. Not even when I's drinkin'. \n                         But this business got me wonderin' \n                         what a good shake and slap would do \n                         for her.\n\n                                     R.L.\n                         That kind of talk is between us. \n                         Don't you go in there with that shit \n                         on your tongue.\n\n                                     LAZARUS\n                         I didn't start this, R.L.\n\n               Laz tries to stop his lip from quivering: the man is hurting.\n\n                                     R.L.\n                         You wanna pray with me 'fore you go \n                         in? Laz?\n                              (R.L. touches Laz's \n                              arm and bows his \n                              head)\n                         Heavenly Father...\n\n                                                                    CUT TO:\n\n               INT. DUNN'S CAFE - AFTERNOON\n\n               R.L.'s prayer is heard as Laz opens the front door to the \n               cafe. He looks ill. Each step is painful.\n\n                                     R.L. (V.O.)\n                         We do not question your divine plan \n                         for us, Oh God. But in these times, \n                         when our spirit lies in shadow. When \n                         we are lost.\n\n               Laz crosses to Rose's booth -- the distance seems to stretch \n               out into eternity.\n\n                                     R.L. (V.O.)\n                         We ask that you give us strength. \n                         Give us strength that surpasses all \n                         understanding. In your name we pray. \n                         Amen.\n\n               Laz sits across from his wife.\n\n                                     ROSE\n                         Can't remember the last time I saw \n                         you in that suit.\n\n                                     LAZARUS\n                         Your mother's funeral. I's a \n                         pallbearer, remember?\n\n               The waitress is kind and twangy as she asks for their order.\n\n                                     WAITRESS\n                         Can I start you both off with some \n                         coffee 'fore I take your order?\n\n                                     ROSE\n                         We won't be stayin' long. Coffee'll \n                         be fine.\n\n               The waitress leaves. The sounds of the cafe fill the silence.\n\n                                     ROSE\n                         We leavin' this weekend. Deke got a \n                         friend in Mobile gonna get him a job \n                         at the water company...\n\n                                     LAZARUS\n                              (interrupting)\n                         If you come to talk about that \n                         muthafucka, I'm gonna get up and \n                         leave you sittin' pretty in that new \n                         suit he bought'cha.\n\n                                     ROSE\n                         Think this about money still, ya old \n                         fool?\n\n                                     LAZARUS\n                         Say what you gotta say, but I ain't \n                         gonna hear you speak his name to me. \n                         Not never. You hear?\n\n                                     ROSE\n                         How many times we been over this, \n                         Laz? How many times?\n\n               The waitress places the coffee between them and leaves.\n\n                                     ROSE\n                         Thought we was gonna be friendly \n                         about this.\n\n                                     LAZARUS\n                         Carryin' on behind my back. Make me \n                         out to look like a fool to all our \n                         people. Tell me, what's friendly \n                         about that?\n\n                                     ROSE\n                         I'm not ready to grow old, Laz. Livin' \n                         with you. I feel it. Like I'm one \n                         foot in the dirt. Saw it happen to \n                         my momma. And that's not gonna happen \n                         to me. I got living to do.\n\n                                     LAZARUS\n                         And you gonna live it with him?\n\n               Rose doesn't answer. Lazarus softens, touching her hand.\n\n                                     LAZARUS\n                         Rose. Folks get sick. But you do \n                         what you can to get on the mend. Our \n                         marriage... it just got sick. That's \n                         all.\n\n                                     ROSE\n                         Talk to me about sick. Ain't been \n                         right since I moved into that drafty \n                         house.\n\n                                     LAZARUS\n                         I keep the heat on.\n\n                                     ROSE\n                         That damned, rusty, radiator, bout \n                         burned the skin off my legs each \n                         time I passed.\n\n                                     LAZARUS\n                         Kept us warm for twelve years.\n\n               It's over. Laz has lost her for good.\n\n                                     ROSE\n                         I deserve better than this.\n\n                                     LAZARUS\n                         Better'n me?\n\n                                     ROSE\n                         Better than what you give.\n\n                                     LAZARUS\n                         Rose... please...\n\n                                     ROSE\n                         Laz... You can't say nothin'...\n\n                                     LAZARUS\n                         If we get with a counselor. At the \n                         church, maybe they's...\n\n                                     ROSE\n                              (the final interruption)\n                         I don't love ya no more.\n\n               The words are daggers. Laz is wounded beyond concealment. \n               Rose picks up her purse, preparing to leave.\n\n                                     ROSE\n                         I'm sorry you hurtin'. But, like I \n                         say, this the only life I got.\n                              (waits for him to \n                              respond)\n                         I said my piece.\n\n               She stands and attempts to walk away. Laz grips her tightly \n               by the wrist.\n\n                                     LAZARUS\n                         God forgive you, for how you done \n                         me...\n\n                                     ROSE\n                         Let go...\n\n                                     LAZARUS\n                         My Daddy told me that a younger woman \n                         would bleed me dry. And that's what \n                         you did. Ya bled me.\n\n                                     ROSE\n                         Let go of my arm...\n\n                                     LAZARUS\n                         Would'a chopped my arm off if you \n                         asked. And this how you do me!\n\n                                     ROSE\n                         LAZ, I said let...!\n\n                                     LAZARUS\n                         You better pray, gal. You better \n                         pray...\n\n                                     ROSE\n                              (yanks free)\n                         Don't you lay a CURSE ON ME!\n\n               The whole cafe is silent. All eyes are on Rose.\n\n                                     ROSE\n                              (to customers)\n                         Yeah, go'on! Look! See if I give a \n                         shit about any of you people!\n\n               And she's gone, right out the front door.\n\n                                                                    CUT TO:\n\n               INT. MOTEL ROOM - AFTERNOON\n\n               Tehronne is taking his time hanging his ice around his neck \n               and wrists as he stands shirtless before the mirror. Rae is \n               lying on the bed.\n\n                                     RAE\n                         You got any money?\n\n                                     TEHRONNE\n                         Thought you had a man for that.\n\n                                     RAE\n                              (a heavy cough)\n                         I said we wasn't gonna talk about \n                         him.\n\n                                     TEHRONNE\n                         What we just did, you askin' for \n                         money, make a man stop. I ain't \n                         callin' you no ho. But I ain't gonna \n                         be played like no trick, neither. \n                         Remember... you called me.\n\n                                     RAE\n                         Save that hustle talk to them field \n                         ballers you sell crack to.\n\n                                     TEHRONNE\n                         What'd I tell you?\n                              (kicks the bed)\n                         I don't do none of that shit no more. \n                         I'm in communications now.\n\n                                     RAE\n                         Stolen phone cards and two-ways is \n                         what you sayin'.\n\n               Rae starts coughing.\n\n                                     TEHRONNE\n                         Mobile technology is the new fix for \n                         these niggaz, I'm tellin' you. I'm \n                         just lookin' ahead.\n                              (takes out his wallet)\n                         Anyways, ain't no money in drugs no \n                         more with these rednecks popping \n                         cough pills like they's Skittles. \n                         Hey, that's what you need, girl. Get \n                         you some cough medicine. What, you \n                         sick?\n\n                                     RAE\n                         Just a cough. Sugar and a spoonful \n                         of Jack'll do it.\n\n                                     TEHRONNE\n                              (takes out money)\n                         Alright. How much you need, ho?\n\n                                     RAE\n                         The hell you call me?\n\n                                     TEHRONNE\n                         Eh, if the bootie fits...\n\n               Tehronne catches Rae's wrist as she goes to slap. He quickly \n               yanks her arm behind her back and bends her backwards, shoving \n               his face close to her own. He grips the money in a fist and \n               cocks it to punch -- all in jest.\n\n                                     TEHRONNE\n                         You gonna get rough? Is that what \n                         you doin'?\n\n               Rae's chest begins to heave with deep breaths. Tehronne looks \n               down at her legs as she anxiously rubs them together.\n\n                                     TEHRONNE\n                              (shakes his head)\n                         I swear, I seen some buck-wild bitches \n                         in my time, but you the illest I \n                         ever seen.\n\n               Rae gets control of the burning. She takes the money.\n\n                                     RAE\n                         Just got a cough.\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE SQUARE - DAY\n\n               Rae is prancing up the walkway on the square. Two young men \n               dressed for construction pass Rae.\n\n                                     MAN\n                         It's already noon, Rae. You think \n                         that skirt should still be on?\n\n                                     RAE\n                              (flips them off)\n                         If it weren't you could kiss my rebel \n                         cootch, ya faggot.\n\n               The men keep walking as Rae coughs. She turns toward the \n               Fisherville Grocery.\n\n                                     SANDY\n                         Cough drops or condoms?\n\n               Rae stops in her tracks, looking up at her estranged mother, \n               SANDY, smoking a cigarette outside the grocery store. Sandy \n               has bleached hair with dark roots. She is in her late-forties: \n               once a sexy girl, now she's lost all her tread.\n\n                                     RAE\n                              (surprised to see her)\n                         Didn't know you was workin' here \n                         now?\n\n                                     SANDY\n                         I just like dressin' up in these \n                         goddamn blue vests.\n                              (takes a drag)\n                         Your money ticket get shipped today?\n\n               Rae walks away -- deeply affected by Sandy's presence.\n\n                                     SANDY\n                              (calling after her)\n                         You let me know if I can be of any \n                         assistance.\n\n                                                                    CUT TO:\n\n               EXT. MELVIN'S FEED STORE - DAY\n\n               Laz drives an old green Ford pick-up. He pulls the truck up \n               to the front of the feed store and kills the engine.\n\n               LINCOLN, a 13-year-old black boy, comes out of the open \n               loading door.\n\n                                     LINCOLN\n                         You won't at the square this mornin'.\n\n                                     LAZARUS\n                         Get me ten bags of mulch.\n\n                                     LINCOLN\n                         Yes'sir.\n\n               Lincoln runs off. Laz yanks off his black tie.\n\n               EXT. MELVIN'S FEED STORE - LATER\n\n               Lincoln slaps the last bag of mulch into the bed of Laz's \n               truck. Laz hands Lincoln a twenty.\n\n                                     LAZARUS\n                         Keep the change on that.\n\n                                     LINCOLN\n                         Naw... I got it, Mr. Lazarus.\n                              (makes change)\n                         You wanna tip me, best do it in butter \n                         beans. Momma say she need a bag 'a \n                         yours, none of that store-bought \n                         junk. That's what she said.\n\n               Laz smiles. He takes the change. Climbs in his truck.\n\n                                     LAZARUS\n                         Alright, Lincoln. You come on by, \n                         I'll load you up.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS'S BARN - LATE DAY\n\n               Lazarus steers his tractor toward his small home in a sea of \n               lush green kudzu. He kills the engine and looks beyond the \n               nose of his tractor. He lights a cigarette. Below the nose \n               is the head of a rose garden with a painted sign under it: \n               Rose's Roses.\n\n               Laz inhales smoke and exhales hate. The tractor lunges \n               forward, trampling the garden, ripping the flowers to shreds.\n\n                                                                    CUT TO:\n\n               INT. BOJO'S - EARLY EVENING\n\n               MAYELLA is a heavy, forty-year-old black woman. Her blue \n               neon tube top matches her short pants stretched across her \n               healthy ass. She is flipping through the juke box selection.\n\n                                     MAYELLA\n                         You gonna put some Luther Vandross \n                         in here? Shit, he black ain't he?\n\n               BOJO is reading a paper behind the bar. He's short and stout, \n               looking like a sad bull dog.\n\n                                     BOJO\n                         He black alright, he just ain't blue.\n\n                                     MAYELLA\n                         Why you stop havin' dancin' on \n                         Saturday? Used to have bands... all \n                         kind's live shit. Like a wake up in \n                         here, now.\n\n                                     BOJO\n                         Folks can dance when they want. Didn't \n                         buy that mirror ball for nothin'.\n\n                                     MAYELLA\n                         You seen my snake-skin shoes?\n\n               Mayella lifts up her leg and stretches it over the bar with \n               a provocative flourish. Her shoe is bright blue.\n\n                                     MAYELLA\n                         They're from New York. My niece gets \n                         'em on the computer.\n\n                                     LAZARUS\n                         They got blue snakes up north?\n\n               Mayella turns to Laz sipping a beer at the end of the bar.\n\n                                     MAYELLA\n                         Naw. They got some blue dye, though. \n                         You think them boots you got on come \n                         from a black cow?\n\n                                     BOJO\n                         Wanna get on somebody 'bout live \n                         music, get on ol' Laz, there. He the \n                         one got this place shakin' back in \n                         the day.\n\n                                     MAYELLA\n                         Don't gotta tell me. Me and my \n                         girlfriends use-ta talk 'bout them \n                         hard fingertips he got pickin' that \n                         guitar.\n\n                                     LAZARUS\n                         Got'em pickin' peas, not strings.\n\n               Mayella moves in close, with the tips of her tits touching \n               his arm.\n\n                                     MAYELLA\n                         They still hard?\n\n                                     LAZARUS\n                         Mayella. It ain't happened yet. Ain't \n                         happenin' tonight.\n\n                                     MAYELLA\n                              (retreating with a \n                              glare)\n                         I know you hurtin', Laz. I got ears, \n                         you know. But you should know more'n \n                         me... ain't no better cure for them \n                         blues than some good pussy.\n\n               Mayella saunters over to the pool table with the others.\n\n                                     BOJO\n                         Whole lotta woman, right there.\n\n                                     LAZARUS\n                         She can still spread it around.\n\n               The door opens behind Laz. Bojo sees the man entering.\n\n                                     BOJO\n                         Laz. We friends and all but... promise \n                         me you'll keep yo cool in my joint.\n\n               Laz turns to see the door shut behind his brother, DEKE WOODS. \n               He is younger than Laz and a bit smaller. Laz turns to Bojo.\n\n                                     LAZARUS\n                         I'm gonna finish my beer.\n\n               Deke slowly approaches Laz at the bar.\n\n                                     DEKE\n                         Mind if I sit?\n                              (no answer)\n                         Rose said... it didn't go too well \n                         this afternoon. See, that's not how \n                         we wanted this to go down. I told \n                         her, I said, Rose, we ain't leavin' \n                         till we make peace with Laz. And \n                         that's God's truth. I laid it down.\n\n                                     LAZARUS\n                         You laid it down.\n\n                                     DEKE\n                         I did.\n\n                                     LAZARUS\n                         Funny. Layin' it down... for my wife.\n\n                                     DEKE\n                         We're not gonna get through this \n                         clean. But it don't need to get dirty. \n                         All this... it just come together \n                         unexpected. You think I want to hurt \n                         you? I... I'd take a bullet for you, \n                         Laz.\n\n               The dry look on Laz's face could cool the sun.\n\n                                     LAZARUS\n                         You wanna give that a try?\n                              (to Bojo)\n                         Bo. You still got that .22 behind \n                         the tap? My little brother say he'd \n                         take a bullet for me.\n                              (into Deke's eyes)\n                         You come here to ease your heart. \n                         Well, I ain't gonna give it to you. \n                         You took her into your bed, now you \n                         gotta lie in it.\n\n               Laz turns back to the bar. Deke begins to turn but stops.\n\n                                     DEKE\n                         I'll always love you, Laz. Till the \n                         end of my...\n\n               In one quick movement, Laz grips Deke by the throat and \n               smashes the bottom of his bottle into jagged shards.\n\n                                     BOJO\n                         LAZ!\n\n               Laz pushes Deke back through the joint and slams him onto \n               the pool table. He grips Deke's throat and holds the broken \n               bottle up to his face.\n\n                                     LAZARUS\n                         Cain slew Able. Slew him out of envy. \n                         And God put his mark on Cain for his \n                         sin. You want that mark, Deke? Give \n                         you that peace you come here for? \n                         I'll give it to you, just say that \n                         shit again. Say you love me. Go'on! \n                         Say YOU LOVE ME, NIGGA!\n\n               Lazarus slams the bottle down on the pool table, shattering \n               it. Laz lifts his hand. His own blood leaks from between his \n               fingers.\n\n               He wipes the blood across Deke's face.\n\n                                     LAZARUS\n                         I'm through wit'cha both.\n\n               Laz releases Deke and exits. Deke calls after him.\n\n                                     DEKE\n                         What'chu gonna do? Nothin'. YOU AIN'T \n                         GONNA DO NOTHIN'!\n\n               Laz slams the door behind him.\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE HIGH SCHOOL - FOOTBALL FIELD - NIGHT\n\n               The bleachers are packed with three generations of fans and \n               family cheering their boys on the high school football field.\n\n               Rae is sitting with her two girlfriends, JESSE and KELL -- \n               two girls who graduated five years ago.\n\n                                     JESSE\n                              (hands Rae a beer)\n                         Ronnie ship out this mornin'?\n\n                                     RAE\n                         It's so stupid. Says to me that he \n                         don't want nothin' to do with no \n                         military career. Says he wants to \n                         move. Open up an auto shop with his \n                         uncle up in Knoxville. I said, okay. \n                         How about now? Let's go.\n\n                                     KELL\n                         He'd be good for that. Shit, Ronnie \n                         knows cars.\n\n                                     RAE\n                         He get stubborn. Starts talkin' 'bout \n                         obligation and duty and all that... \n                         Shit. I just want him to come home... \n                         I swear, if somethin' happens to \n                         him...\n\n                                     KELL\n                         He fixed up that Buick for my uncle \n                         Dale. He say it purrs like a kitten \n                         every morning.\n\n                                     JESSE\n                         Nothing's gonna happen. Not like \n                         everybody over there is in the line \n                         of fire with them Arabs blowin' \n                         themselves up.\n\n                                     RAE\n                         Can't be thinkin' bout him every \n                         second of my day. I'll go outta my \n                         gourd.\n\n                                     JESSE\n                         Why should you waste your life waitin' \n                         and wonderin'. Not like you're \n                         married.\n\n                                     RAE\n                              (takes a healthy swig)\n                         I begged him not to go. And he did.\n\n                                     KELL\n                              (screaming at the \n                              field)\n                         PUNT YOU FUCKERS!\n\n                                                                    CUT TO:\n\n               EXT. CONNER'S HOUSE - THE KEGGER - NIGHT\n\n               Dirty South rap pounds the ears from a hoopty Olds with a \n               backseat full of bass. Rae, Kell, and Jesse are walking up \n               to the rowdy party through the variety of parked cars.\n\n               A girl rushes past the trio, vomiting on herself as a friend \n               comes to her aid.\n\n                                     JESSE\n                         These baby chicks just can't hold \n                         their Jello shots. I'm tellin' ya.\n\n                                                                    CUT TO:\n\n               INT. CONNER'S HOUSE - THE KEGGER - NIGHT\n\n               CONNER is one of the linebackers for the Fisherville Dusters. \n               A wasted girl sits on his lap as Kell rolls a joint.\n\n                                     CONNER\n                         Tennessee Vols gotta practice indoors \n                         just so those Florida State sons-a-\n                         bitches don't spy on their plays \n                         with satellites and shit.\n\n                                     KELL\n                         Satellites... You mean in space?\n\n                                     CONNER\n                         Uh-huh.\n\n                                     KELL\n                         Good thing you can block, Conner, \n                         cuz you're dumb as a sack of shit.\n\n               Jesse notices Rae coughing. She pulls her aside as Conner \n               rambles.\n\n                                     JESSE\n                         You wanna go home?\n\n                                     RAE\n                         It gets worse there. Leavin' me to \n                         my own mind. That's just not good.\n\n                                     JESSE\n                              (pours a shot of vodka)\n                         Here. Pound this and I'll join you.\n\n               Rae and Jesse take a strong shot. It burns.\n\n                                     JESSE\n                         One more. Fuck the chaser.\n\n               As they pound one more, Rae notices Gill, Ronnie's friend, \n               staring at her from across the room.\n\n                                     JESSE\n                         Better?\n\n                                     RAE\n                         Yeah.\n\n               BATSON and MARK approach Jesse and Rae. They are both \n               sophomores, both skinny and harmless.\n\n                                     BATSON\n                         Hey, Jess.\n\n                                     JESSE\n                         Boys.\n\n                                     BATSON\n                         You robotrippin' tonight?\n\n                                     JESSE\n                         I'm just gonna smoke.\n\n               Rae peeks at Gill maneuvering through the room.\n\n                                     BATSON\n                              (rummages in his \n                              pockets)\n                         Got eight packs of DXM. Oxycontin. \n                         Got a shit load of Coricidin if you \n                         want to get out-a-body, n'all.\n\n                                     JESSE\n                         You just trying to get me outta my \n                         clothes.\n\n                                     RAE\n                         Be right back.\n\n               Rae pushes through the crowd of drunken kids to get to Gill.\n\n                                     RAE\n                         It's not like I can't go out and \n                         have fun with my friends.\n\n                                     GILL\n                         You think I'm Ronnie's spy or \n                         somethin'? Come tomorrow that dumb-\n                         ass gonna be halfway round the world \n                         tryin' to keep his head on his \n                         shoulders. You think he's gonna be \n                         thinkin' about you?\n\n                                     RAE\n                         You go to hell.\n\n               Rae pushes through the crowd, back toward the others.\n\n                                     RAE\n                              (to Batson)\n                         How many to fuck me up?\n\n               QUICK CUTS of: Batson popping out five red cough pills. Rae \n               swallowing all five and chasing them with vodka. Conner's \n               girl falls off his lap. Kell laughs. The laughter echoes and \n               grows as we:\n\n                                                                    CUT TO:\n\n               EXT. CONNER'S HOUSE - THE KEGGER - HIS PARENT'S WATERBED - \n               NIGHT\n\n               CLOSE ANGLES: We never quite see the whole of what is implied. \n               Rae's eyes, Jesse's mouth, a boy's shoulder.\n\n               The room is packed with bodies. Rae laughs with pleasure as \n               her eyes attempt to focus. The kid on top of her finishes \n               and rolls off.\n\n                                     JESSE\n                         What's so funny?\n\n               Jesse is straddling a guy in an arm chair, Chinese-eyed and \n               bouncing. Rae tries to respond coherently as another football \n               player rolls her over on all fours and takes her from behind.\n\n                                     RAE\n                              (laughing)\n                         Oh... I'm just on a water bed... And \n                         it's just... so... Goddamn... funny!\n\n               A few coughs. Rae focuses to see a younger guy sitting at \n               her eye level.\n\n                                     RAE\n                         Hi.\n\n                                     BRYAN\n                         Hey.\n\n                                     RAE\n                         You ain't the kicker, are you?\n\n                                     BRYAN\n                         No, ma'am.\n\n                                     RAE\n                         Cuz let me tell you, you boys gotta \n                         run the ball more. You get into a \n                         kicking game, ya'll gonna lose.\n\n                                     BRYAN\n                         Can I put it in your mouth?\n\n                                     RAE\n                         Okay.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS'S HOME - THE BEDROOM - NIGHT\n\n               Laz kills the rest of his whiskey. He squeezes his eyes closed \n               as the liquor burns his throat. He tosses the bottle into a \n               trash bag he is holding.\n\n               Laz continues throwing out all of Rose's make-up and hair \n               products. With one broad sweep, he cleans off her vanity.\n\n               INT. LAZARUS'S HOME - NIGHT\n\n               Laz opens the front door and tosses the two bags outside. \n               Stumbling, he kneels next to the coiled radiator against the \n               wall opposite the door. He talks to it like an old friend.\n\n                                     LAZARUS\n                         Seem like you and me... we drove her \n                         away. That's what we did. Now we...\n                              (singing softly)\n                         Drinkin' muddy water... a'sleep in a \n                         hollow log...\n\n               A thought.\n\n               INT. LAZARUS'S HOME - THE BEDROOM - NIGHT\n\n               Laz pulls out a guitar case from under the bed. He wipes a \n               layer of dust off and opens it.\n\n               INT. LAZARUS'S HOME - KITCHEN - NIGHT\n\n               He gently cradles the guitar in his big hands and sits at \n               his kitchen table. Tunes the strings. He closes his eyes, \n               swimming in drunken sorrow.\n\n                                     LAZARUS\n                         You gonna do this?\n\n               Laz plays the blues, Mississippi, Bentonian style: one guitar, \n               one voice, a mess of pain.\n\n                                     LAZARUS\n                              (singing, his eyes \n                              closed)\n                         Just like a bird without a feather, \n                         you know \n                         I'm lost without your love. \n                         Just like a bird without a feather, \n                         you know \n                         I'm lost without your love. \n                         You know I need your love just like \n                         the angels need heaven above.\n\n               The music continues as we:\n\n                                                                    CUT TO:\n\n               EXT. CONNER'S HOUSE - THE KEGGER - THE WOODS OUT BACK - \n               NIGHT\n\n               Lazarus's blues is all we hear as four guys chase Rae through \n               the woods. She is in her shirt and panties, wearing football \n               shoulder pads.\n\n               She is completely wasted. Lost. The ground rocks back and \n               forth with each step. Trees pass in a slow-motion haze.\n\n                                     LAZARUS\n                              (singing)\n                         Well I sure did shot my baby, but I \n                         did it because she did me wrong. \n                         Well I sure did shot my baby, but I \n                         did it because she did me wrong. \n                         You know the judge called it murder \n                         now the penitentiary is my home.\n\n               Rae grips a tree to steady herself, but a team member tackles \n               her. The woods spin and distort as someone mounts her with \n               ease.\n\n                                     LAZARUS\n                              (singing)\n                         I loved that woman, she said she \n                         didn't love no one but me. \n                         I loved that woman, she said she \n                         didn't love no one but me.\n\n               Rae smiles as she lifts her hand up to the stars, passing \n               the writhing back of the guy on top of her. If she could \n               just grab a star she would feel safe again.\n\n               She tries to snatch one. She can't. Her hand drops as the \n               boy stands and takes off after his friends tossing the \n               football.\n\n               Rae lies motionless on the ground.\n\n                                     LAZARUS\n                              (singing)\n                         Yeah but I caught my baby cheating.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS'S HOME - KITCHEN - NIGHT\n\n               A tear rolls down Laz's cheek.\n\n                                     LAZARUS\n                              (singing)\n                         Now my home ain't where it used to \n                         be.\n\n               His guitar groans its last for the night.\n\n                                                                    CUT TO:\n\n               EXT. CONNER'S HOUSE - THE KEGGER - FRONT YARD - LATER THAT \n               NIGHT\n\n               Rae is wasted. She is still wearing her shirt, panties and \n               shoulder pads as she steps over passed-out teenagers.\n\n                                     RAE\n                         Jes? Jesse?\n                              (trips over a sprinkler)\n                         Oh shit... Wait... Wait... STOP!\n\n                                     GILL\n                         Stop what?\n\n               Rae doesn't look up. The Coricidin is tripping her out.\n\n                                     RAE\n                              (coughing)\n                         The ground is... turnin' upside down. \n                         I'm gonna...\n                              (coughing)\n                         I'm gonna fall off...\n\n               Gill reaches down and pulls off the shoulder pads. The \n               coughing fit passes.\n\n                                     RAE\n                         Oh. That feels so much better.\n\n                                                                    CUT TO:\n\n               EXT. ROAD - NIGHT\n\n               Gill's truck flies down the dark road.\n\n               INT. GILL'S TRUCK - NIGHT\n\n               Rae is looking out the window, drifting in and out.\n\n                                     GILL\n                         Thought you had a skirt earlier.\n\n                                     RAE\n                         I got others.\n\n               Gill pulls to the side of the road and kills the engine. He \n               watches Rae tilt her head from side to side.\n\n                                     GILL\n                         This thing you got... I've heard \n                         people say, you'd fuck a tree if it \n                         was handy. I can see that.\n                              (shakes his head)\n                         But that nigger Tehronne. Thinks \n                         he's some player cuz he hustles dope \n                         and stolen hubcaps. I mean, I can \n                         see a tree. But that piece of shit?\n\n                                     RAE\n                              (lost in hazy sorrow)\n                         I begged him. Don't see why he had \n                         to go...\n\n                                     GILL\n                         I bet you did. Just had to get that \n                         black cock up in you. I swear to \n                         God. What Ronnie sees... you disgust \n                         me.\n\n               Gill grabs her legs and spreads them with no resistance. Her \n               head rolls from side to side on the truck seat as Gill unzips \n               his pants.\n\n               Rae starts giggling.\n\n                                     GILL\n                         The fuck you laughin' at?\n\n                                     RAE\n                              (giggling)\n                         You don't got half what Tehronne \n                         got.\n\n               Gill flinches upright. A rage builds in his eyes.\n\n               EXT. ROAD - NIGHT\n\n               From outside the steamed truck window, we see Gill beat Rae \n               repeatedly.\n\n               Silence.\n\n                                     GILL\n                              (muffled from the \n                              inside)\n                         Get up! I ain't playin'! OPEN YOUR \n                         GODDAMN EYES!\n\n               Silence.\n\n               He opens the truck door, fear in his eyes. Rae isn't moving. \n               Blood is on her face.\n\n                                     GILL\n                         Oh, Jesus...\n\n               A hasty idea. He pushes her out of the truck. She falls to \n               the dark pavement in a tangle of her own limbs.\n\n               The door slams. Gill floors the gas. Rae lies motionless \n               alone under the stars.\n\n               Her watch alarm goes off: Beep-beep. Beep-beep. Beep-beep.\n\n                                                                    CUT TO:\n\n               INT. A BUS - NIGHT\n\n               Ronnie is asleep on the bus, unaware that his watch alarm in \n               beeping at him.\n\n               A Guardsman sitting next to him shakes Ronnie awake.\n\n                                     GUARDSMAN\n                         Hey.\n\n               Ronnie silences the alarm. He regards the watch with sadness \n               and affection.\n\n               EXT. FREEWAY - NIGHT\n\n               The bus roars past. The red brake lights fade into night.\n\n                                                             FADE TO BLACK:\n\n               INT. LAZARUS'S HOME - KITCHEN - EARLY MORNING\n\n               Lazarus has fallen asleep sitting at his kitchen table. His \n               eyes open. Standing is difficult. The guitar falls to the \n               floor.\n\n               The phone rings. Dizziness hits, but he manages to pick up \n               the receiver.\n\n                                     LAZARUS\n                         Huh?\n\n               INT. CHURCH OF GOD / LAZARUS'S HOME - EARLY MORNING\n\n               R.L. is on his cell phone. He is placing hymnals in the back \n               racks of the church pews.\n\n                                     R.L.\n                         Bojo called. Said you got to see \n                         your brother at the long end of a \n                         broken bottle.\n\n                                     LAZARUS\n                         You gonna preach 'bout turnin' the \n                         other cheek?\n\n                                     R.L.\n                         I think you did alright by God under \n                         the circumstances.\n                              (R.L. pauses)\n                         Your people are here for you, Laz. \n                         This is your home. No shame in showing \n                         your face.\n\n                                     LAZARUS\n                         Don't know if God wanna see me.\n\n                                     R.L.\n                         He knows where ya at. Just answer \n                         the door if he come knockin'.\n\n               Laz hangs up the phone.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS'S HOME - LATE MORNING\n\n               Lazarus steps out onto his porch. He picks up the trash bags \n               full of Rose's things and walks down the gravel drive to the \n               road.\n\n               EXT. LAZARUS'S HOME - WHERE THE DRIVE MEETS THE ROAD - LATE \n               MORNING\n\n               Laz tosses the bags inside his trash cans.\n\n               He's really hung over this morning. His eyes squeeze shut, \n               he grips his neck in pain.\n\n                                     LAZARUS\n                         Mmmmmmmmmm... Mm!\n\n               His eyes open. They remain fixed beyond us. The pain in his \n               face is replaced with grave confusion.\n\n               Rae lies on the side of the road.\n\n               Her T-shirt and panties are damp from the early morning mist, \n               her face caked with dried blood. Her skin is deathly white, \n               her mouth open, her eyes shut and swollen.\n\n               Lazarus carefully steps toward her. He leans down over her \n               face.\n\n                                     LAZARUS\n                         Sweet... Jesus...\n\n               Rae coughs. Laz flinches.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - LATE MORNING\n\n               The door slams against the wall as it swings open. Laz is \n               carrying Rae, unconscious and limp, in his arms.\n\n               He lays her down on the couch by the radiator. He pulls a \n               quilt over her cold skin. With a twist of the valve the \n               radiator moans to life.\n\n               Laz takes out his bandana and cleans her face. He tries to \n               wake her.\n\n                                     LAZARUS\n                         Little lady? Miss? You need to open \n                         your eyes for me. Could ya do that?\n\n               Her eyes open slightly -- just slits of white.\n\n                                     LAZARUS\n                         There we go. There we go. Just like \n                         you doin'. Go'on.\n\n               She whispers as she touches her fingers to his cheek.\n\n                                     RAE\n                              (a raspy inhale)\n                         Teh... Tehronne?\n\n                                     LAZARUS\n                         Tehronne? Tehronne done this?\n\n               A labored breath followed by the most pitiful cough fit. Laz \n               tries to calm her as her lungs fight for oxygen. Laz looks \n               scared as the coughing stops in a desperate wheeze followed \n               by silence.\n\n               INT. LAZARUS'S HOME - KITCHEN - MORNING\n\n               Laz pulls the phone off its cradle on the wall and flips \n               through the phone book.\n\n               His fingers scan down the listings and stops on POLICE \n               DEPARTMENT. He dials and listens.\n\n                                     OPERATOR\n                              (a recorded voice)\n                         You've reached the Fisherville Police \n                         Department. Your call will be answered \n                         in the order it was received. If \n                         this is an emergency, please, hang \n                         up and dial 9-1-...\n\n               Slam! Fingers hit the phone cradle. Lazarus dials 911.\n\n               As soon as he places the phone to his ear, he looks over at \n               Rae sprawled out on his couch. Her bare legs can be seen \n               peeking out from under the quilt.\n\n               Fear hits him. He slams the phone down again.\n\n               Laz crosses to the couch and gently touches her head.\n\n                                     LAZARUS\n                              (softly)\n                         I'm'a go into town. Get you some \n                         medicine to fix you up. You just \n                         rest, okay, gal? You just sleep. Get \n                         that chill out'cha.\n\n               Laz touches the radiator. It burns him.\n\n                                     LAZARUS\n                         God... damn...\n\n               EXT. ROAD - AFTERNOON\n\n               Laz's Ford roars down the shaded street towards town.\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE SQUARE - MACON DRUGS - AFTERNOON\n\n               Laz parks his truck in front of MACON DRUGS and heads inside.\n\n               An old black man named RED sits on a bench next to an older \n               white man in his early eighties holding a cane. RED is the \n               paid caretaker of MELVIN.\n\n                                     MELVIN\n                         How's the squash this year?\n\n                                     LAZARUS\n                         It's good, Mister Melvin. I'll bring \n                         ya some.\n\n               Laz rushes inside.\n\n               INT. MACON DRUGS - AFTERNOON\n\n               The variety of cough medicine confuses Laz as he examines \n               them.\n\n               ANGELA approaches Laz. She is dressed in a floral print dress \n               with a white lab coat. Angela has a few extra pounds on her \n               but she wears it well with her caring face and sweet manner.\n\n                                     ANGELA\n                         Lazarus?\n\n                                     LAZARUS\n                              (startled)\n                         Oh! Gave me a start.\n\n                                     ANGELA\n                         I'm sorry. It's these soft shoes I \n                         wear for my back.\n\n                                     LAZARUS\n                         You hurt it?\n\n                                     ANGELA\n                         I'm standing most of my day. They're \n                         for support.\n                              (a smile)\n                         Didn't see you in church this mornin'.\n\n                                     LAZARUS\n                              (tries to lie)\n                         Been on the crop. May need to get \n                         some extra hands if I don't want to \n                         work on Sundays.\n\n                                     ANGELA\n                         Well. It's good to see you.\n\n               Angela wants the conversation to continue but Laz remains \n               silent. She smiles awkwardly.\n\n                                     LAZARUS\n                         Angela?\n\n                                     ANGELA\n                         Yes?\n\n                                     LAZARUS\n                         I need to uh...\n\n                                     ANGELA\n                         Go on, Laz. You can talk to me.\n\n                                     LAZARUS\n                         My little niece... she got this deep \n                         cough.\n\n                                     ANGELA\n                         You take her to a doctor?\n\n                                     LAZARUS\n                              (struggles to lie)\n                         No. No, she can't go. Mean to say... \n                         they's just no money fo'a doctor. \n                         Her daddy left for a job, and uh... \n                         give her to me to look on. I just...\n                              (a pitiful pause)\n                         I don't know what to do.\n\n               Angela thinks for a moment.\n\n                                     ANGELA\n                         You wait right here.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - DAY\n\n               Snot and spittle has run down the side of Rae's face -- her \n               eyelids stick together as she tries to open them.\n\n               There is a creak, followed by another. Rae has become aware \n               that someone is slowly walking up the front porch.\n\n               The door opens. Silhouetted in the day's blinding light is a \n               white man in his 40's. His face is indistinguishable to Rae's \n               affected gaze.\n\n               Is this a dream?\n\n               He stands above her and lights a cigarette. The Zippo lighter \n               clasps shut. The man lowers it to his side where Rae can see \n               it clearly. A bald eagle is printed on the side, a sight \n               that makes Rae's eyes open wide in horror.\n\n               Her breath grows deeper -- a girlish plea. This is no dream -- \n               it's a nightmare.\n\n                                     RAE\n                         Mm-mm... Mm-mm...\n\n               A massive hand slaps down over her mouth. Her crusted eyes \n               peer above the hairy knuckles. He sucks on the cigarette. A \n               red cherry blazes at the end. The man pushes the blanket off \n               of her and grips her panties.\n\n               Rae's eyes close. She knows what is next. In his clenched \n               fist, the panties are ripped off.\n\n                                     RAE\n                         NOOOOO!\n\n               Rae flinches awake from the fever-induced nightmare and falls \n               to the wooden floor, drenched in sweat. Weakened and shaking, \n               she scampers away, finally collapsing in the kitchen. Her \n               hand reaches out and lands on the strings of Laz's guitar on \n               the floor. She grips the steel strings with her trembling \n               fingers.\n\n               A single bass note twangs as she passes out.\n\n                                                                    CUT TO:\n\n               INT. MACON DRUGS - AFTERNOON\n\n               Angela stands between the aisles, motioning Laz to approach, \n               away from the girl at the counter.\n\n                                     ANGELA\n                         Is your niece older than 12?\n\n                                     LAZARUS\n                         Oh, she older than that.\n\n               She hands him a white box with cough syrup inside.\n\n                                     ANGELA\n                         My sister got a bad cough with her \n                         pneumonia. I just copied her \n                         prescription. You don't need to pay \n                         anything... just take it. But if she \n                         gets worse, you give me a call. I \n                         wrote my number on the box.\n\n                                     LAZARUS\n                         This gonna get you in trouble?\n\n                                     ANGELA\n                         Not if no one finds out.\n\n               Laz doesn't know what to say. He puts the box in his pocket.\n\n                                     LAZARUS\n                         Thank you.\n                              (suddenly awkward)\n                         Oh. My wife. She had a card here for \n                         her migraine pills. She ain't gonna \n                         be around no more... So if you...\n\n                                     ANGELA\n                         I already tossed that out.\n                              (takes a step closer)\n                         Somethin' you should'a done to that \n                         woman long ago... how she treated \n                         you. Of course, that's none of my \n                         business.\n\n                                     LAZARUS\n                              (smiles)\n                         Don't make it less true.\n\n               Angela returns the smile.\n\n               EXT. MACON DRUGS - AFTERNOON\n\n               Laz opens his truck door and stops. At the pool-hall across \n               the square, Laz sees a green Cutlass with chrome rims.\n\n                                                                    CUT TO:\n\n               INT. POOL HALL - AFTERNOON\n\n               Laz enters the empty pool hall. Tehronne is playing a game \n               with a skinny playa-wanna-be dressed in flea-market Fubu.\n\n               CHARLIE, the owner, approaches Laz from the bar.\n\n                                     CHARLIE\n                         Hey, Lazarus. We closed up on Sunday.\n\n                                     LAZARUS\n                         Need a word with Tehronne.\n\n                                     CHARLIE\n                              (calling to the back)\n                         Yo, T! Laz wanna holla at cha.\n\n                                     TEHRONNE\n                         Come on back, Cuz.\n\n               Charlie nods Laz on. He crosses to the back pool table as \n               Tehronne sinks the 8. Tehronne looks at his friend.\n\n                                     TEHRONNE\n                         Do you call it a game when only one \n                         man win each time? I think you call \n                         it a damn shame.\n\n                                     LAZARUS\n                         Word wit'cha. In private.\n\n               Tehronne hands his friend the pool cue. The two take a few \n               steps away to talk.\n\n                                     TEHRONNE\n                         You need some weed?\n\n                                     LAZARUS\n                         Been years since I fooled with that.\n                              (tries to find the \n                              words)\n                         You know a white girl? Dirty blond \n                         hair, split down the middle like?\n\n                                     TEHRONNE\n                              (smiles)\n                         That ain't up to me to hook you up. \n                         Naw what I mean? She her own, you \n                         know?\n\n                                     LAZARUS\n                         Huh?\n\n                                     TEHRONNE\n                         I don't pimp that.\n                              (silence)\n                         You talkin' about who I think you \n                         talkin' about, you mean Rae. Rae \n                         Doole. Sexy little split tail, like \n                         you say. I can't hook you up with \n                         that. I got two girls. One ain't in \n                         town, the other one pregnant. So... \n                         you on your own.\n\n                                     LAZARUS\n                         This Rae... you get with her?\n\n                                     TEHRONNE\n                         Shit. Who hasn't?\n\n                                     LAZARUS\n                         Why you say that?\n\n                                     TEHRONNE\n                         She got a spare minute she'll snatch \n                         up anyone... but me, I'm different. \n                         Sometimes she need the real deal, so \n                         she call me up. Girl got an itch. \n                         You know... what's a nigga to do?\n\n                                     LAZARUS\n                         She like it rough? You like beatin' \n                         on her?\n\n                                     TEHRONNE\n                         That ain't my scene. If that's \n                         somethin' you into...\n\n                                     LAZARUS\n                         Now, hold up.\n\n                                     TEHRONNE\n                         See, that girl is in my favor. You \n                         heard me, nigga? You fuck with her \n                         rough, and you got me to fuck wit.\n\n                                     LAZARUS\n                         You collar that dog, boy. I ain't \n                         gonna hurt nobody. Just wanted to \n                         know who she was.\n\n                                     TEHRONNE\n                         Like I say, you wanna hook that up... \n                         I ain't in ya way. That switch of \n                         hers been all over this town. Got \n                         that sickness, you know.\n\n                                     LAZARUS\n                         What'chu sayin'?\n\n                                     TEHRONNE\n                         She a freak. Got what you call a \n                         sexual addiction.\n\n               Lazarus looks at him with a furrowed brow. Confused.\n\n                                     LAZARUS\n                         What'chu sayin'?\n\n                                     TEHRONNE\n                         What I'm tellin' you. Girl gotta get \n                         dick or she go crazy.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - DAY\n\n               Laz opens his own door with caution. He turns to see Rae \n               sprawled in his kitchen in her panties and T-shirt. He rushes \n               to her side.\n\n                                     LAZARUS\n                         Gal? Miss Rae? Rae, you hear me?\n\n               Lazarus lifts her sweaty body off the floor and moves her \n               back to the couch.\n\n               Consciousness briefly returns to Rae in her feverish haze.\n\n                                                                  FLASH TO:\n\n               CLOSE UP - FLASHBACK\n\n               The white-knuckled hand clutched around her mouth.\n\n                                                             FLASH BACK TO:\n\n               INT. LAZARUS' HOME - DAY\n\n               Rae flinches and flails. She falls to the floor.\n\n                                     LAZARUS\n                         Hold on, now. Hold on!\n\n               Rae's eyes are open and filled with fear. She struggles to \n               flee as Laz holds her in place, trying to reassure her.\n\n                                     LAZARUS\n                         Now, I ain't gonna hurt'cha. Calm \n                         down, Miss.\n                              (she fights, coughs)\n                         Listen... Listen... LISTEN NOW, GAL!\n                              (Rae settles in his \n                              grip)\n                         I ain't gonna hurt ya, hear? Gotta \n                         get you well. Now, look me... HEY! \n                         Look me in the eye.\n\n               Rae is too weak to talk or move. Laz clutches her small face \n               in his dark hands.\n\n                                     LAZARUS\n                         Open your eyes. Go'on, now. You need \n                         to see, ain't no harm here. Ain't no \n                         harm.\n                              (Rae calms)\n                         My name is Lazarus Woods. And I ain't \n                         gonna let you die.\n\n               Rae's eyes roll back.\n\n               Lazarus looks terrified as she cranes her head back and \n               forward. Her mouth opens.\n\n               In her sickened state, with the force of something evil and \n               deep inside, Rae clasps her open mouth over Laz's. A shriek \n               sounds in his brain as he holds her tighter, allowing the \n               kiss to grow in intensity. Rae falls to her stomach as Laz \n               abruptly stands and stumbles across the room. What he sees \n               chills him to the bone.\n\n               Rae is writhing on the floor as if she is possessed -- a \n               rant of raspy words pour from her mouth.\n\n                                     RAE\n                         ...you don't... touch me... s'no... \n                         NO! Mm-mm... Mm-MMMMMMMMMMMMM! N-\n                         N'you FUCK!\n\n               Lazarus gets spooked by what he is seeing. He looks to the \n               mantle. His weathered Bible lies in a coat of dust. He picks \n               it up as a wave of the burning hits Rae.\n\n               She clutches her breast and crotch, rolling from side to \n               side.\n\n                                     RAE\n                         Mm-mm... mm-mm... Ma-muh... Ma-MUH!\n                              (sudden anger, shouting)\n                         See... S... See if'I GIVE... GIVE'A... \n                         SHIT...\n\n                                                                  FLASH TO:\n\n               INT. DUNN'S CAFE - MORNING - FLASHBACK\n\n               Rose is shouting at the customers in the cafe. Her eyes are \n               white like Rae's. Her voice is not her own but that of Rae.\n\n                                     ROSE/RAE\n                              (screaming)\n                         'BOUT ANY OF YOU PEOPLE!\n\n                                                             FLASH BACK TO:\n\n               EXT. LAZARUS' HOME - DAY\n\n               Laz runs out of his own home, not even shutting the door \n               behind him. He gets half way down his drive, the Bible still \n               clutched in his hand. He stops.\n\n               In a panic, Laz opens his Bible, places it down on the drive, \n               face up, creating a barrier to evil. He hears a choking cough \n               inside the house. Rae is fighting for breath beyond the dark \n               door.\n\n               Silence. Laz reaches down and picks up his Bible.\n\n               A passage catches his eye. As he reads, the fear vanishes \n               from his face. His back straightens. His jaw tightens. He \n               looks back at his house, his faith is renewed.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS'S HOME - THE BATHROOM - DAY\n\n               The Bible is slammed down on top of the toilet tank. The \n               bathtub faucet coughs as Laz twists the cold water knob.\n\n               INT. LAZARUS' HOME - KITCHEN - DAY\n\n               The freezer door opens. He snatches four trays of ice.\n\n               INT. LAZARUS' HOME - THE BATHROOM - DAY\n\n               The trays crack. The ice cubes bounce into the tub.\n\n               INT. LAZARUS' HOME - DAY\n\n               Rae's lips are dried and split as she pants, lost in dizzying \n               fever. Laz lifts her.\n\n               INT. LAZARUS' HOME - THE BATHROOM - DAY\n\n               Laz kneels on one knee to put her into the tub.\n\n               A horrible cry from Rae as Laz wrestles with her, keeping \n               her submerged in the ice cold water.\n\n                                     LAZARUS\n                         I know, child, I know. Gotta break \n                         that fever now.\n                              (Rae sobs, struggles)\n                         Don't mean to hurt'chu. But I ain't \n                         lettin' you die.\n                              (holding her down)\n                         I AIN'T LETTIN' YOU DIE!\n\n               Rae is motionless. Exhausted. Her eyes are open but blind. \n               Her lip trembles. Her body shakes from the freezing water.\n\n               Laz rubs the hair from her face gently. He reaches over to \n               the Bible on the toilet and opens it to read.\n\n                                     LAZARUS\n                         Put fear of the Devil in me, gal. \n                         Got me spooked like I's a kid, I \n                         tell you.\n                              (flips through the \n                              pages)\n                         But the good Lord, He showed me what \n                         to do. He come knockin' like my man \n                         R.L. say... listen here...\n                              (Rae sobs like a child)\n                         This here Matthew. He talkin' on how \n                         Jesus was healin' the sick. And a \n                         man come up to the disciples and he \n                         say...\n                              (reads deliberately)\n                         Have mercy on my son, for he is a \n                         lunatic, and sore vexed...\n                              (to Rae)\n                         He got the devil in his mind and \n                         sores on his skin.\n                              (reads)\n                         And he brought the boy to the \n                         disciples, but they could NOT cure \n                         him.\n\n               Rae's shivering is abating. Her eyes fight to stay open. Laz \n               touches her forehead to test her temperature.\n\n                                     LAZARUS\n                              (reading)\n                         Then Jesus answered and said, O \n                         faithless and perverse generation... \n                         how long shall I suffer you? Bring \n                         the boy hither to me. And Jesus \n                         rebuked the devil.\n                              (to Rae)\n                         You hear that?\n                              (reads)\n                         Then the disciples say... Why could \n                         not we cast the devil out? And Jesus \n                         said unto them...\n\n               Rae's eyes begin to close. Laz gently touches her head to \n               rile her awake.\n\n                                     LAZARUS\n                         Listen now... This what he sayin' to \n                         us. He say...\n                              (reads)\n                         If ye have faith... if ye have faith \n                         as a grain of mustard seed, ye shall \n                         say unto a mountain, remove hence... \n                         and it... shall... move. And \n                         nothin'... nothin' shall be impossible \n                         to you.\n                              (to Rae)\n                         You hear that? You just need a bit \n                         of faith. You just gotta believe you \n                         gonna get well, like I do.\n\n               He touches her forehead again. Her eyes close.\n\n                                     LAZARUS\n                         That's better. You coolin' down. \n                         Okay. You rest. Okay. You rest.\n\n               Laz leans against the wall, spent.\n\n               EXT. LAZARUS' HOME - SUNSET\n\n               The cicadas sing in a rising chorus as the clouds above fade \n               from copper to crimson.\n\n                                                             FADE TO BLACK.\n\n               INT. LAZARUS' HOME - NIGHT\n\n               The faint echo of Rae's fevered panting.\n\n               She lies on the couch wrapped in a quilt, shivering. Her \n               eyes remain closed, her face drenched with sweat. Laz has \n               cleaned her facial wounds, using a few Band-Aids.\n\n               BOOM!\n\n               An explosion ignites the windows surrounding the cabin. Rae \n               jolts awake, terror pervades her as she gasps at the fire \n               ball outside the window.\n\n               She struggles to her feet and listens. A faint sound can be \n               heard through the roar of the flames. beep beep... beep \n               beep... beep beep... beep beep...\n\n                                     RAE\n                              (a whisper)\n                         Ronnie...\n\n               Rae stumbles to the door, weak and dizzy. She grips the door \n               knob and pulls the door open.\n\n               EXT. LAZARUS' HOME - NIGHT\n\n               Rae races outside, tripping down the front porch steps. She \n               looks off at the blaze in the squash field. She frantically \n               races toward the fire, the beeping increases.\n\n                                     RAE\n                         Ronnie... RONNIE!\n\n               BEEP BEEP... BEEP BEEP... BEEP BEEP... BEEP BEEP...\n\n               At the center of the blaze is an upside down Humvee. To the \n               left of the vehicle, a few soldier's bodies lay scattered. \n               Rae's legs lose all strength, she collapses and crawls across \n               the squash plants.\n\n               A far away voice is heard over the roaring flames.\n\n                                     LAZARUS\n                         Gal? Gal?\n\n               Rae crawls across a fallen soldier, following the sound of \n               Ronnie's alarm. She struggles to breathe, she almost faints.\n\n               She finds a soldier face down. With all her strength she \n               turns him over. It is Ronnie, wide-eyed and lifeless.\n\n               An awful groan comes out of Rae -- crippling sorrow. She \n               pulls on his vest trying to wake him.\n\n                                     RAE\n                              (sobbing)\n                         Nn-nn... Nn-nn... no... N'RONNIE!\n\n                                     LAZARUS\n                         GAL! YOU HEARIN' MY VOICE?\n\n               Rae looks up. The flaming humvee is gone. She is not pulling \n               on Ronnie's vest, but the tangled vines of a squash plant.\n\n               Laz stands at a safe distance, silhouetted in moonlight.\n\n                                     LAZARUS\n                         You travelin' right now, gal. You \n                         asleep and you don't even know it.\n                              (extends his hand)\n                         Now... come on inside with me.\n\n               Rae looks like a terrified child. Her eyes well with tears \n               as she shakes her head. Laz takes a step toward her.\n\n                                     RAE\n                         Mm-mm... Mm-mm...\n\n                                     LAZARUS\n                         Come on, gal...\n\n               She turns and runs away as best she can. Laz chases after \n               her. He's much older than her and a bit slower, but her \n               balance betrays her.\n\n               Laz wraps his arms around her. Rae screams to the sky.\n\n                                     RAE\n                         NO! NOOO! NOOOOOOOOOO!\n\n               And then, stillness. Rae lies limp in Laz's arms, unconscious.\n\n               He reaches down and lifts her wrist to his face. The green \n               screen of the digital watch pulsates with the alarm.\n\n               He pushes the side button. The beeping stops. Silence.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - KITCHEN - NIGHT\n\n               Laz lays Rae back onto his couch. Her eyes open into slits. \n               She can see Laz's form over her like the man in her nightmare.\n\n               Rae grabs Laz's wrist. He flinches with her force.\n\n                                     RAE\n                              (the whisper of a \n                              child)\n                         Is'okay... Is'okay...\n\n               Struggling with exhaustion, Rae moves Laz's hand to her bare \n               stomach. She rubs it slowly up and down her form, \n               suggestively.\n\n               Laz slips his hand away and claps it tight over her eyes. \n               Rae holds her breath, waiting to be molested, her lip \n               quivering.\n\n                                     LAZARUS\n                              (singing deep and \n                              soft)\n                         Goin' over that hill. Goin' over \n                         that hill. Well, I ain't gonna stop \n                         until I reach my God's top. I'm goin' \n                         over the hill. Well I went to the \n                         valley, I didn't go to stay. Soul \n                         got happy, I stayed all day. I'm \n                         goin' over that hill.\n\n               Rae relaxes and falls into a deep sleep.\n\n               Laz backs away from her, a touch of fear in his heart. The \n               voice of Tehronne is heard from earlier in the day.\n\n                                     TEHRONNE (V.O.)\n                         She a freak. Got what you call a \n                         sexual addiction.\n\n                                     LAZARUS (V.O.)\n                         What'chu sayin'?\n\n                                     TEHRONNE (V.O.)\n                         What I'm tellin' you. Girl gotta get \n                         dick or she go crazy.\n\n                                                                  FLASH TO:\n\n               INT. POOL HALL - EARLIER THAT DAY - FLASHBACK\n\n               Lazarus looks at Tehronne with a furrowed brow, confused.\n\n                                     TEHRONNE\n                         First hooked up with that bitch when \n                         she was 16. Girl was fuckin' the \n                         principal and two of her teachers. \n                         You know coach Reynolds?\n\n                                     LAZARUS\n                         Uh-huh.\n\n                                     TEHRONNE\n                         He tapped that.\n\n                                     LAZARUS\n                         Naw!\n\n                                     TEHRONNE\n                         Go ask him.\n\n                                                             FLASH BACK TO:\n\n               INT. LAZARUS'S BARN - NIGHT\n\n               Lazarus opens his barn, slicing through the darkness with \n               his flashlight.\n\n                                     TEHRONNE (V.O.)\n                         She been bumpin' around all her life, \n                         hookin' up with whoever keep her fed \n                         and fucked.\n\n               He crosses to the other side, pulls on a beaded chain turning \n               on the single bulb above his work table.\n\n                                     TEHRONNE (V.O.)\n                         I seen her give it up on park benches, \n                         back of trucks, hoopty hoods, you \n                         name it.\n\n               Laz opens an old wooden box on his work table. He looks \n               inside.\n\n                                                                  FLASH TO:\n\n               INT. POOL HALL - MORNING - FLASHBACK\n\n               Laz looks ill. Tehronne checks his pager briefly.\n\n                                     TEHRONNE\n                         You ever seen a train run on a woman?\n\n                                     LAZARUS\n                         Nuh-uh.\n\n                                     TEHRONNE\n                         Meanin' like a team of fellas go to \n                         work on her and she don't even break \n                         a sweat.\n                              (puts his pager away)\n                         She into football, you know. You got \n                         a letter on your jacket you get that \n                         pussy in ya lap. I ain't playin'.\n\n               Tehronne's friend breaks on the pool table with a sharp crack. \n               Lazarus is genuinely disturbed.\n\n                                     LAZARUS\n                         How a girl get like that?\n\n                                     TEHRONNE\n                         Like I told you.\n\n                                                             FLASH BACK TO:\n\n               INT. LAZARUS'S BARN - NIGHT\n\n               Lazarus reaches inside the box and pulls out the end of an \n               old chain.\n\n                                     TEHRONNE (V.O.)\n                         Girl got a sickness.\n\n               The chain rattles as Laz walks backwards, pulling the long \n               chain from the box. The shouting of his brother can be heard.\n\n                                     DEKE (V.O.)\n                         What'chu gonna do? Huh? Nothin'. YOU \n                         AIN'T GONNA DO NOTHIN'! NOTHIN'!\n\n               The end of the chain snags, yanking the box over.\n\n               CRASH!\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - THE VEGETABLE GARDEN - LATE MORNING\n\n               Lazarus is bent over, harvesting his tomatoes.\n\n                                     LAZARUS\n                              (singing to himself)\n                         Tell me who's that writin'? John the \n                         Revelator. Wrote the book of the \n                         seven seals.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - AFTERNOON\n\n               Laz enters his home. He crosses to the kitchen and pours \n               himself a glass of water.\n\n               Dripping with sweat, he steps back into the room, downing \n               the last of his water. He lowers the glass, noticing Rae \n               looking at him.\n\n                                     LAZARUS\n                         Hey.\n\n               Rae lifts her head off the pillow. Laz comes to her side and \n               helps her sit up.\n\n                                     LAZARUS\n                         Take it easy now. Don't rush it.\n\n                                     RAE\n                              (a scratchy whisper)\n                         How long... how long I been out?\n\n                                     LAZARUS\n                         You been in and out goin' on two... \n                         maybe two days.\n\n                                     RAE\n                              (can't believe it)\n                         Two days?\n\n                                     LAZARUS\n                         After your fever broke, you'd wake \n                         up in spells... long enough to get \n                         that medicine in ya.\n\n               Rae sits up on the couch, the quilt wrapped around her waist. \n               She looks at the cough syrup bottle on the side table.\n\n                                     LAZARUS\n                         Found you on the side of the road. \n                         Someone took to beatin' on you pretty \n                         bad. You know who done that to you?\n\n               Rae touches the cut over her eye. That evening is still a \n               blur.\n\n                                     RAE\n                         Where's Ronnie?\n\n                                     LAZARUS\n                         Well I don't...\n\n                                     RAE\n                              (remembering)\n                         Wait. He left.\n\n               Rae lifts her head, revealing tears in her eyes. She gets \n               mad at herself and wipes them away.\n\n                                     RAE\n                         I don't got any money... for fixin' \n                         me up and all.\n\n                                     LAZARUS\n                         Don't need none.\n\n                                     RAE\n                         Then I better be on my way. Don't \n                         wanna put you out no more.\n\n                                     LAZARUS\n                         Think it'd be best if you stayed put \n                         while we talk.\n\n                                     RAE\n                         Naw'sir... I gotta be on my way.\n\n                                     LAZARUS\n                         Best try gettin' ya wits about you \n                         'fore you try to...\n\n               Rae struggles for balance as she attempts to stand. The quilt \n               falls away as a heavy chain slides off the couch and thuds \n               on the floor by her feet.\n\n               Rae feels a tug.\n\n               She looks down to see a dark chain locked around her thin \n               waist and coiled on the floor. The opposite end is locked \n               around the side coil of the radiator.\n\n               She is chained to the house, a prisoner.\n\n                                     LAZARUS\n                         Let me say somethin' first...\n\n                                     RAE\n                         Why you got me chained?\n\n                                     LAZARUS\n                         Way I see it, it's gonna take a while \n                         for you to get right.\n\n                                     RAE\n                         The fuck you been doin' to me?\n\n                                     LAZARUS\n                         I ain't laid a hand on ya but to \n                         ease yo fever... Remember like I \n                         say, I found you in the road...\n\n                                     RAE\n                              (yanks at the chain \n                              around her waist)\n                         Get this Goddamn thing off me!\n\n               Rae stumbles as she moves away from Laz. Laz tries to reassure \n               her.\n\n                                     LAZARUS\n                         Now, no harm's come to you... and I \n                         aim to keep it that way. Ain't \n                         gonna... gonna run a train over ya... \n                         or however you call it... see... you \n                         was runnin' wild on me... these fever \n                         dreams you was havin'... these fits. \n                         I'd be chasin' you all night.\n\n                                     RAE\n                         Well I'm woke now... you can take \n                         this off.\n\n               Rae waits.\n\n                                     LAZARUS\n                         Gal, you ain't right yet.\n\n                                     RAE\n                         I'm right enough to stand on my own \n                         two feet. Now take this Goddamn chain \n                         off...\n\n                                     LAZARUS\n                         How you let men treat ya like they \n                         do?\n\n                                     RAE\n                         What?\n\n                                     LAZARUS\n                         These men you up under. How you let \n                         them do ya like that?\n\n                                     RAE\n                              (grips the chain)\n                         Do me? Do me like this, you mean? \n                         Like chainin' me up?\n\n                                     LAZARUS\n                         You know what I'm talkin' about.\n                              (beat)\n                         All that mess with ya teachers and... \n                         boys in the backs of trucks.\n\n                                     RAE\n                              (shocked)\n                         The hell you know about me?! You got \n                         no right to talk to me about that \n                         shit! The hell you think you are?\n\n                                     LAZARUS\n                              (interrupting)\n                         I've saved ya life, gal. I can do \n                         and say whatever the fuck I want.\n\n               Rae begins to feel a pang of panic. She goes to the chain \n               locked around the radiator. She yanks on it a few times.\n\n                                     LAZARUS\n                         I give ya enough chain so's you can \n                         get about the house. Get you to the \n                         kitchen. You need the bathroom, it'll \n                         reach.\n\n                                     RAE\n                         What do you want?\n\n                                     LAZARUS\n                         We got everything we need. Plenty of \n                         food. Ya medicine still got a few \n                         good swallows in it...\n\n                                     RAE\n                         WHAT DO YOU WANT FROM ME?!\n                              (Laz can't answer)\n                         WHATEVER YOU GONNA DO TO ME, JUST DO \n                         IT! AND LET ME GO!\n\n                                     LAZARUS\n                         God saw to it to put you in my path. \n                         And I aim to cure ya of your \n                         wickedness.\n\n               This statement terrifies Rae. The fear can be seen in her \n               eyes. She backs away -- the chain scrapes across the floor.\n\n                                     RAE\n                         You some kind'a pervert?\n\n                                     LAZARUS\n                         No ma'am.\n\n                                     RAE\n                         Some crazy Jesus freak, gonna fuck \n                         the spirit into me...\n\n                                     LAZARUS\n                         In my house, you watch that lip...\n\n                                     RAE\n                              (furious, near tears)\n                         Look it, mister... you wanna have \n                         your way, you take it. I'll do \n                         whatever you want. But you gotta let \n                         me go. You can't do this! You can't \n                         KEEP ME HERE!\n\n                                     LAZARUS\n                         You sick. You got a sickness... we \n                         broke that fever... we gonna break \n                         that hold the devil got on ya.\n\n               Rae pushes Laz back and bolts for the door. Laz falls back \n               against the side table by the couch, toppling the lamp.\n\n               EXT. LAZARUS' HOME / INT. LAZARUS' HOME - AFTERNOON\n\n               The door slams against the house as Rae rushes out in her \n               wolf shirt and panties -- the chain trailing behind her.\n\n                                     RAE\n                              (screaming)\n                         HELP!\n\n               Laz watches as the coil unravels and snaps taut, yanking on \n               the old radiator.\n\n               Clank! The chain whips Rae down to the ground. Laz watches \n               as dust flies of the radiator with each tug.\n\n                                     RAE\n                         SOMEBODY!\n\n               CLANK!\n\n               The fear in Laz's face is replaced with a grin as he watches \n               his radiator hold firm.\n\n                                     RAE\n                         SOMEBODY HELP ME!\n\n               Outside, Rae bucks and screams, yanking on the chain like a \n               wild mustang. Her bare feet and legs are soiled with fresh \n               mud and grass as she claws at the ground.\n\n               Laz crosses to the radiator and pats it like a proud parent -- \n               his wedding ring clicks against the iron.\n\n                                     LAZARUS\n                              (to the radiator)\n                         Ain't gonna be moved.\n\n               He steps outside with resolve and strength. He picks up the \n               chain and wraps it around his fist.\n\n                                     LAZARUS\n                         GAL! I ain't gonna be moved on this!\n\n               Laz yanks her back, dragging her towards him. He grips the \n               taut chain with his other hand and yanks her closer.\n\n                                     RAE\n                         LET ME GO!\n\n                                     LAZARUS\n                         You can holla y'self hoarse. Ain't \n                         gonna bend my will.\n                              (pulls her closer)\n                         Right or wrong, you gonna mind me.\n                              (Pulls her again)\n                         Gonna suffer you like Jesus say, to \n                         the FAITHLESS and the PERVERSE \n                         GENERATION.\n\n               Rae is spent. She turns to look at her captor as he wrangles \n               her back to the porch.\n\n                                     LAZARUS\n                         Now you get up! And you get in my \n                         house!\n\n                                     RAE\n                         Or what?\n\n               Rae spits at Laz. Bad idea.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS'S HOME - LATER THAT AFTERNOON\n\n               Rae is screaming and grunting as Laz, standing in his kitchen, \n               tugs on the chain around the door-jam like he's drawing water \n               from a well.\n\n               Outside Rae struggles to hold onto the porch post. Laz pulls \n               hard, lifting her lower torso off the ground.\n\n                                     RAE\n                         Stop it! Stop it! IT HURTS!\n\n                                     LAZARUS\n                         Whose doin' is that?\n\n               Laz yanks. Rae loses her grip and slams onto the porch.\n\n                                     RAE\n                         Okay... OKAY! I'M COMIN' IN! NOW \n                         QUIT IT!\n\n               The pulling stops. Rae picks herself up. Her knees and hands \n               are scraped and bleeding. The two stare at each other.\n\n                                     LAZARUS\n                         Say we talk. Just take a seat on the \n                         sofa. I'll get us somethin' cool to \n                         drink.\n\n               Laz crosses to the kitchen. Rae sits down on the couch, \n               noticing the fallen lamp on the floor.\n\n                                     LAZARUS\n                         You may not remember. But you spent \n                         a whole half day in my tub, tryin' \n                         to cool down. Melted four ice trays.\n\n               He finishes preparing the two waters. He crosses into the \n               front room. Rae is not there.\n\n               CRASH! Rae smashes the lamp on Laz's head. The water glasses \n               shatter as Laz falls to the floor.\n\n               Rae picks up a wooden chair and breaks it over his back. \n               Before she can do any more damage, Laz grabs her by the wrists \n               and throws her to the couch.\n\n               Rae falls to the floor. Laz stumbles on his feet as he \n               clutches his bleeding head. He loses his cool.\n\n                                     LAZARUS\n                         Wicked little bitch... gonna cut \n                         me...\n\n                                     RAE\n                         You gonna get a lot more a'that, you \n                         keep me locked up like this!\n\n               Rae freezes as she sees Laz undo his belt buckle. Her breath \n               starts to quiver as she deeply inhales and exhales.\n\n                                     LAZARUS\n                         Think I'm gonna let you do me like \n                         that...\n\n               Laz whips his belt off and wraps the buckle around his fist.\n\n               He stops in his tracks. Rae is panting and shaking. Her middle \n               finger is scratching at her own thigh.\n\n                                     LAZARUS\n                              (regaining his cool)\n                         Okay, now... I ain't gonna hit'cha.\n                              (the burning is \n                              starting)\n                         Just lost my cool there.\n                              (he throws the belt \n                              away)\n                         Now take that look out'cha eye.\n\n               Her anguished hum can be heard through her clenched teeth as \n               she rocks back and forth. Her hands wander down to her inner \n               thighs.\n\n                                     LAZARUS\n                         No, ma'am. You stop that foolishness.\n\n                                     RAE\n                              (shaking her head)\n                         Hm-mm... Hm-mm...\n\n                                     LAZARUS\n                         I said... STOP!\n\n                                     RAE\n                              (on the verge of crying)\n                         I CAN'T!\n\n               Rae gets dizzy. She rests the top of her head on the floor \n               and sways back and forth. Laz rushes out the front door.\n\n               As the wave hits, Rae twists and turns, wrapping the chain \n               around her. She grips the radiator with both hands and rests \n               her face against the side.\n\n                                     RAE\n                         Hmmmmmm... Stop-it!... STOP-IT!\n\n               The wave is about to build in to a powerful climax. Rae gasps \n               for breath.\n\n               The door slams open. Laz drenches her with a gallon of cold \n               well water from a tin bucket. Rae inhales and freezes. Laz \n               waits and watches.\n\n               The burning is gone.\n\n               Laz kneels next to her and gently frees her bare ankle from \n               the tangled chain.\n\n                                     LAZARUS\n                         You hungry?\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - ON THE PORCH - LATER THAT DAY\n\n               They are both seated on the front porch with paper plates in \n               their laps. Laz watches with amusement as Rae tears into her \n               chicken and gobbles up the vegetables.\n\n                                     LAZARUS\n                         I put some back ache into growin' \n                         them greens. You should slow down \n                         and see how they taste.\n\n               Rae remains under Lazarus' intense gaze as the cicadas sing.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - THE VEGETABLE GARDEN - SUNSET\n\n               Rae stares off at orange clouds and purple sky. She takes a \n               step to her left, walking through the parallel rows of squash.\n\n               The chain gently rattles behind her. Laz has given her about \n               20 feet of slack. He holds the chain tight around his fist.\n\n               Rae grins, standing proud in her wolf shirt and panties.\n\n                                     RAE\n                         You like this? Walkin' me through \n                         this field like I's your mule?\n\n                                     LAZARUS\n                         Can't sit all day on that sofa. Need \n                         to get your legs strong.\n\n                                     RAE\n                              (sassy)\n                         If I break one you gonna shoot me?\n\n               Rae teases Laz by adjusting her panties. She turns back to \n               the sunset and stretches.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - NIGHT\n\n               Rae's smoldering eyes don't leave Laz as he chains her to \n               the radiator. Laz nervously preaches, trying to avoid the \n               sight of her bare legs curled up on his couch.\n\n                                     LAZARUS\n                         My Daddy was one of the first mens \n                         to organize soil conservation in \n                         these parts. That's a group of \n                         farmers, you know, each season they'd \n                         rotate the crop. Know why it's best \n                         to rotate em like that?\n\n                                     RAE\n                         Uh-uh.\n\n               Laz moves in close and starts applying antibacterial cream \n               to the cut above Rae's eye.\n\n                                     LAZARUS\n                         Cuz once in a while soil need a \n                         change. Corn take up a lot of nitrate \n                         in the fertilizer. So next crop what \n                         ya do is plant ya some soy beans. \n                         That give off a lot of nitrate. Change \n                         keeps it all growin' and growin' \n                         strong.\n                              (regarding the eye)\n                         Sting a bit?\n\n                                     RAE\n                         Itches.\n\n                                     LAZARUS\n                         Means ya healin'.\n                              (a nod)\n                         So all this farmin' make me think on \n                         Matthew. Matthew 13. The parable of \n                         the sower? Man toss seed on rock, on \n                         the wayside, some fell in thorns... \n                         you know the story?\n\n                                     RAE\n                         Uh-uh.\n\n               Laz starts putting the cream on her scabbed knees. He rubs \n               them gently.\n\n                                     LAZARUS\n                         The seed that land on good soil is \n                         for them who hear the word of God... \n                         and understand the word of God. Not \n                         enough for you to hear what I'm \n                         sayin', you gotta understand.\n\n                                     RAE\n                         I know. I get it. What's Matthew \n                         doin'?\n\n                                     LAZARUS\n                         Gal... Matthew ain't doin' shit... \n                         this just a story...\n                              (quelling his \n                              frustration)\n                         Look it. I've seen it in nature, \n                         I've seen it in men. Ya got to change \n                         up your crop. Cuz that seed ain't \n                         gettin' in.\n                              (Rae remains silent)\n                         Ya gotta cut this shit out. Got no \n                         cause to be up under these fools, \n                         ruttin' on ya like you a bitch. Like \n                         you somebody's dog. No woman... who \n                         joins in union with Almighty God... \n                         or man... in the sanctity of \n                         marriage... should degrade herself... \n                         and bend to ANOTHER MAN'S WILL!\n\n               Rae is aware that Laz is somewhere else, talking to someone \n               else other than her. There is anger in his tone as he rubs \n               ointment on her bare, scabbed knees.\n\n                                     LAZARUS\n                              (shouting)\n                         My God, gal, don't you got no SENSE? \n                         I ain't sayin' I ain't weak? Shit. \n                         Playin' guitar in the blood-bucket \n                         jukes all ya life... a nigga learn \n                         how to sin, let me tell you!\n                              (grips her by the \n                              legs)\n                         I GOT SIN IN ME! I AIN'T GO'N LIE! \n                         BUT I GOT RESPECT! AND ALL YOU GOT \n                         IS BILE, GAL!\n\n                                     RAE\n                         Let go of me...\n\n                                     LAZARUS\n                         GIVIN' UP THAT SWITCH LIKE A TRAMP! \n                         BEHIND MY BACK AND KILL MY BABY...!\n\n               Rae yanks free of Laz's grip, recoiling on the couch.\n\n                                     RAE\n                         GET OFF ME!\n\n               Laz awakens from his rant. He blinks and stands. A sudden \n               shame overtakes him. He crosses into the kitchen to hide by \n               the sink.\n\n               He pours Rae a glass of water and returns to her side.\n\n                                     LAZARUS\n                              (offering her the \n                              glass)\n                         Didn't mean to go off on a tear like \n                         I did. I just got to thinkin' about \n                         things...\n\n               Rae leans up into his face. The glass of water is touching \n               her chest. Laz remains hypnotized by her eyes.\n\n                                     RAE\n                         Why is it you old men gotta talk so \n                         much? Like little boys, gotta talk \n                         yourself into fuckin' me.\n                              (his knuckles touch \n                              her skin)\n                         We can take our time. I'm grown. I \n                         get it.\n                              (she leans even closer)\n                         You wanna give me 'nother bath?\n\n               Laz stands and backs away. He quickly leaves the room.\n\n               INT. LAZARUS'S HOME - THE BEDROOM - NIGHT\n\n               Laz looks at himself in the reflection of Rose's vanity \n               mirror, listening to Rae stir in the next room.\n\n               INT. LAZARUS' HOME - NIGHT\n\n               The cicadas are screaming outside. Rae is beginning to breathe \n               deep, the burning is coming on.\n\n                                     RAE\n                              (under her breath)\n                         Goddammit.\n\n               She folds her arms over her chest, her middle finger \n               scratching her elbow. The anxiety is too much. She rolls \n               over until the chain pulls taut against the radiator.\n\n               Rae has wrapped herself in a tangle of chain. Her breathing \n               relaxes. Her eyes close. She sleeps.\n\n                                                             FADE TO BLACK.\n\n               EXT. FISHERVILLE SQUARE - EARLY DAWN\n\n               A train rumbles past in the blue hue of dawn.\n\n               Laz pulls his truck next to two other fruit and vegetable \n               vendors: ARCHIE and GENE.\n\n               Archie is an old black man in his early seventies. Gene is a \n               short white man closer to Laz's age.\n\n                                     GENE\n                         There goes our fortune. We been doin' \n                         good for ourselves since you been \n                         away.\n\n               Laz sets up his folding table and uncovers his produce.\n\n                                     LAZARUS\n                         Y'all know when Ella Mae's open up?\n\n                                     ARCHIE\n                         You needin' to buy some pantyhose?\n\n                                     LAZARUS\n                         Just some dresses.\n\n               Gene looks at Archie and shrugs.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - MORNING\n\n               Rae snaps awake. She is wet with sweat from the morning heat.\n\n                                     RAE\n                         Hello? Hey!\n\n               Rae drags the chain behind her as she crosses to the front \n               door and looks outside. No truck.\n\n                                     RAE\n                         I don't believe this shit.\n\n               She folds her arms and looks into the kitchen. There on the \n               table is a covered plate and a small bottle of milk. Rae \n               reads a note on top of the plate: BE BACK FOR SUPPER.\n\n               She pulls off the top plate and finds sausage links, eggs, \n               biscuits, sliced tomatoes, and sliced peaches.\n\n                                     RAE\n                         Enough to choke a Goddamn horse.\n\n               She yanks her chain. It rattles across the floor as she sits.\n\n                                                                    CUT TO:\n\n               INT. ELLA MAE'S WOMEN'S CLOTHING - EARLY AFTERNOON\n\n               Laz looks out of place in his faded overalls surrounded by \n               bright colors of Ella Mae's dress shop.\n\n               ELLA MAE is a wide woman with white hair in her late fifties.\n\n                                     LAZARUS\n                         I'm needin' some women's clothes. A \n                         few dresses. Maybe some shoes. But \n                         they gotta be nice. They gotta be \n                         proper. Clothes a woman would want, \n                         where she could feel and look like a \n                         woman without... you know, lookin' \n                         like a tramp or a hussy or somethin'.\n\n               Ella Mae turns to her assistant, Rhonda. Rhonda is a 19-year-\n               old black girl. She turns back to Laz, unsure how to proceed.\n\n                                     ELLA MAE\n                         And, sir... do you have a size in \n                         mind for what you're lookin' for?\n\n                                     LAZARUS\n                              (points to Rhonda)\n                         That young lady's size, right'cher.\n\n                                     ELLA MAE\n                         Well, that makes it easier.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - THE BATHROOM - AFTERNOON\n\n               Rae sits down in the tub, still wearing her T-shirt and \n               panties. Looking up at the shower head above she turns on \n               the cold water and yanks up on the shower knob.\n\n               Cold water sprays down over her. She gasps and then relaxes, \n               laying back in the tub.\n\n                                                                    CUT TO:\n\n               INT. ELLA MAE'S WOMEN'S CLOTHING - AFTERNOON\n\n               Laz is at the counter. Rhonda is putting the shoes and clothes \n               in two shopping bags while Ella Mae rings him up.\n\n                                     ELLA MAE\n                         Well... I hope these will work for \n                         your niece. She can always come back \n                         in and swap sizes.\n\n               Lazarus points to a small display of fine lotions.\n\n                                     LAZARUS\n                         Mind I ask, what's all this business \n                         here?\n\n                                     ELLA MAE\n                         These are whipped body creams. It's \n                         like a lotion.\n\n                                     LAZARUS\n                         For your hands?\n\n                                     ELLA MAE\n                         Some women prefer not to scent their \n                         bodies with perfume. So now they \n                         have scented creams. They help \n                         moisturize a woman's skin.\n                              (unscrewing a jar)\n                         This one's my favorite. It's called \n                         Ginger Souffle. I recommend... \n                         applying the cream while the skin is \n                         still damp. So... perhaps just after \n                         a shower.\n\n                                     LAZARUS\n                              (likes what he smells)\n                         I'll take a jar of that, too.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - KITCHEN - AFTERNOON\n\n               Rae rattles into the kitchen, her damp clothes clinging to \n               her form. She picks up Laz's guitar off the table and places \n               it in her lap.\n\n               She plucks a few random strings out of boredom and smiles.\n\n                                                                    CUT TO:\n\n               INT. MACON DRUGS - AFTERNOON\n\n               The same apathetic girl is working the front counter as Laz \n               enters the drug store with a basket of arranged vegetables.\n\n                                     LAZARUS\n                         Lookin' for Miss Angela.\n\n                                     GIRL\n                         She in the back.\n\n               Laz makes his way to the back of the store. He spies Angela \n               in the back pharmacy, sorting pills for a pick-up. He watches \n               her work for a moment until, finally, she sees him.\n\n                                     ANGELA\n                         Wait right there.\n\n               Laz waits as Angela rounds the corner.\n\n                                     LAZARUS\n                         I brung you a little basket of \n                         goodies. Fresh squash, tomatoes, \n                         some okra, butter beans.\n\n                                     ANGELA\n                              (taking the basket)\n                         You didn't have to do this.\n\n                                     LAZARUS\n                         Just wanted to say how much I \n                         appreciate you helping me the other \n                         day. My niece, she's cured up, and I \n                         got you to thank.\n\n                                     ANGELA\n                         Well that's good. I'm happy to hear \n                         it.\n\n               Angela smiles. There is tension and attraction between the \n               two.\n\n                                     LAZARUS\n                         Look here. I got somethin' special \n                         for you.\n\n               Angela is flush as Laz moves closer than he has ever been \n               before. He reaches in the basket for the jar of cream.\n\n                                     LAZARUS\n                         This here is a whipped... body cream. \n                         And it's got a smell to it. Tell me \n                         what you think.\n\n               Laz holds the jar up to her nose. Angela closes her eyes and \n               smells. Her expression says enough -- she loves it.\n\n                                     LAZARUS\n                         They call this Ginger Souffle. Best \n                         if it... if it go on your skin just \n                         after you been in a hot tub... or \n                         shower.\n\n               Angela takes the lotion from his hand. She is subtle and \n               demure, but the woman is deeply affected. She smiles.\n\n                                     ANGELA\n                         This was very sweet of you.\n\n                                     LAZARUS\n                         Well. Hope you enjoy it.\n\n               Angela watches Laz as he walks out the door. The apathetic \n               girl moves up behind Angela.\n\n                                     GIRL\n                         Oooooo.\n\n                                     ANGELA\n                         Hush up.\n\n               EXT. FISHERVILLE SQUARE - MACON DRUGS - AFTERNOON\n\n               Laz opens his truck and waves goodbye to Old Red. Melvin is \n               holding a healthy squash.\n\n                                     RED\n                         You gonna be on the square later on?\n\n                                     LAZARUS\n                         Got all my honey-do's done with. I'm \n                         headin' home.\n\n                                     RED\n                         Stay cool. It's a hot one.\n\n               Laz pulls away in his truck and rounds the corner just as \n               R.L. crosses the street. He steps over to talk to Red.\n\n                                     R.L.\n                         Hey, Red. Was that Laz just left?\n\n                                     RED\n                         Yes'sir, Rev'rend.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS'S HOME - KITCHEN - AFTERNOON\n\n               Rae occasionally strums an awful chord as she sings playfully.\n\n                                     RAE\n                              (trying to sing)\n                         You are my sunshine. My only sunshine. \n                         You make me happy when skies are \n                         gray. You'll never know dear how \n                         much I love you. Please don't take \n                         my sunshine away. A voice from outside \n                         spins her around. The guitar barks \n                         as Rae slams it down on the table.\n\n                                     LINCOLN (O.S.)\n                         Mister Lazarus?\n\n               Rae stays hidden as she peeks out the front window. Lincoln \n               is standing before the house holding an old picnic basket. \n               Rae's middle finger begins scraping against the wall.\n\n                                     LINCOLN\n                         Mister Laz... I come for the butter \n                         beans.\n\n               Rae fights her dizziness. She crawls to the radiator as she \n               hears each creak of Lincoln crossing to the front door.\n\n                                                                   FLASH TO\n\n               QUICK CUTS\n\n               The Zippo with the bald eagle closes. A smoldering cigarette.\n\n                                                             FLASH BACK TO:\n\n               Rae flinches and grits her teeth as Lincoln knocks on the \n               door: Knock, knock.\n\n                                     LINCOLN\n                         Ain't seen you on the square. Mister \n                         Laz, can you hear me?\n\n               The burning has started: deep gasps, itching, anxiety.\n\n                                     LINCOLN\n                              (worried now)\n                         Mister Lazarus?\n\n               Rae watches the shadows of Lincoln's shoes under the door. \n               They wait patiently and walk away.\n\n               EXT. LAZARUS' HOME - AFTERNOON\n\n               Lincoln walks down the porch steps and stops. Thinks.\n\n               INT. LAZARUS' HOME - AFTERNOON\n\n               Rae inches upward, pulling herself up the radiator so she \n               can stand. Her panting has waned.\n\n               Suddenly the front door swings open.\n\n                                     LINCOLN\n                         Mister Laz, I'm comin' inside...\n\n               Lincoln can't believe what he sees. Rae is chained around \n               the waist, damp and barely clothed. Her eyes bore into Lincoln \n               like an owl zeroing in on a helpless jackrabbit.\n\n               She rips her shirt off in one tug over her head.\n\n               Lincoln can't move. The picnic basket hits the floor. His \n               mouth hangs open in shock as Rae steps towards him and lays \n               her open mouth on the boy.\n\n               EXT. LAZARUS' HOME - AFTERNOON\n\n               SLAM! Rae shuts the door.\n\n               Laz steers his Ford truck up the drive and parks. He takes \n               his time getting out and removing the shopping bags. He opens \n               the door and goes inside.\n\n               His curses can be heard from outside.\n\n                                     LAZARUS\n                         SHIT BOY! WHAT THE HELL YOU...!\n\n               Lincoln is tossed off the porch, clinging to his overalls.\n\n                                     LAZARUS\n                         CAN'T LEAVE YOU ALONE FOR ONE...\n\n               Tears and fear come to Lincoln as Laz steps out onto the \n               porch, fuming with rage.\n\n               Lincoln backs away expecting a good beating. He starts running \n               up the drive but stops as R.L.'s Olds rolls up the drive.\n\n                                     LAZARUS\n                         Lincoln, come on back.\n\n               Lincoln darts past Laz and runs into the barn, clutching his \n               overalls. R.L. stops the car halfway down the drive and steps \n               out.\n\n                                     R.L.\n                         Was that Lincoln James I seen run \n                         off?\n\n                                     LAZARUS\n                         He's fine. Just had a bad fall.\n\n                                     R.L.\n                         Why's his britches round his knees?\n\n                                     LAZARUS\n                         R.L., you gonna have to get on. I \n                         can't have nobody round my place.\n\n               R.L. starts walking up the drive.\n\n                                     R.L.\n                         You get a call from Rose?\n\n                                     LAZARUS\n                         This ain't got nothin' to do with \n                         that woman. Just don't want nobody \n                         around me now.\n\n                                     R.L.\n                         Somethin' wrong with ya phone? Been \n                         callin' the last few days.\n\n               R.L. stops in his tracks as Lazarus pulls out his hunting \n               rifle from the rack behind his seat in his truck.\n\n                                     R.L.\n                         Goin' dove huntin'?\n\n                                     LAZARUS\n                         You gotta go, R.L.. I ain't foolin' \n                         this time.\n\n                                     R.L.\n                         You sayin' that gun's for me if I \n                         don't?\n\n                                     (LAZ CAN'T ANSWER)\n                         Spell it out, Laz. Man big enough to \n                         pull a gun best have a tongue in his \n                         mouth if he ain't got a brain in his \n                         head.\n\n               Laz is struggling. The rifle feels suddenly strange to him.\n\n                                     LAZARUS\n                         You ain't gonna talk me outta shit \n                         no more. I got my mind made up and I \n                         ain't gonna be moved on this.\n\n                                     R.L.\n                              (amused)\n                         Ain't gonna be moved?\n\n                                     LAZARUS\n                         Got no place for preachin' here. Not \n                         now. So you do as I say...\n\n                                     R.L.\n                              (still stepping closer)\n                         Or what?\n\n                                     LAZARUS\n                         I told you to TURN BACK!\n\n               R.L. pushes his chest up against the rifle and shouts back.\n\n                                     R.L.\n                         YOU GO'ON AND SHOOT ME, KILLA!\n\n               Laz's heart is breaking. He is pointing a gun at his only \n               friend.\n\n               R.L. snatches the rifle out of Laz's hands.\n\n                                     R.L.\n                         Ought'a stomp yo ass pointing this \n                         at me.\n                              (unloads the rifle)\n                         Always gotta bring up the preachin'. \n                         Like you just a sheep in my flock \n                         and all I'm good for is poundin' on \n                         a pulpit.\n                              (gets in Laz's face)\n                         Dammit, Laz... we may not be blood. \n                         But we sucked off the same old nurse \n                         since the day we was slapped on the \n                         ass. And you gonna point a gun at \n                         me?\n\n               A tear rolls down Laz's cheek. The shame is unbearable.\n\n                                     R.L.\n                         If you in some trouble, than WE gonna \n                         figure somethin' out. You and me.\n                              (hands him a bandana)\n                         Wipe your face!\n\n               Laz takes the bandana and wipes the tears away.\n\n                                     R.L.\n                         Now... this got anything to do with \n                         Rose?\n                              (Laz shakes his head)\n                         Then what?\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - AFTERNOON\n\n               The door creaks open. R.L. carefully steps inside. Rae is \n               sitting on the couch, looking out the window.\n\n                                     RAE\n                              (on the verge of tears)\n                         I didn't want to.\n\n               Rae doesn't respond. R.L. quickly steps outside shutting the \n               door behind him.\n\n               EXT. LAZARUS' HOME - AFTERNOON\n\n               R.L. shakes his head as Laz follows him off the porch.\n\n                                     R.L.\n                         Are you outta ya GODDAMN MIND?\n\n                                     LAZARUS\n                         Man like you ought not take the Lord's \n                         name like you just done.\n\n                                     R.L.\n                         A naked woman, chained in ya house?\n\n                                     LAZARUS\n                         I'm tellin' you the truth, dammit. I \n                         found her beat. Left for dead. So I \n                         brung her home.\n\n                                     R.L.\n                         Laz, I know about that girl.\n                              (beat)\n                         Good number of this town's sinners \n                         got my ear, you know.\n                              (shakes his head)\n                         Oh, Laz. She's had a mess of crabs \n                         and them STD's. What'chu thinking?\n\n                                     LAZARUS\n                         I haven't laid a hand. On my life, \n                         R.L., my wick is dry on this.\n\n                                     R.L.\n                         You say she was beat on. You call \n                         the sheriff on that?\n\n                                     LAZARUS\n                         Put yo'self in my shoes. Say you out \n                         here, alone, with a beaten, half \n                         naked, white woman loves to fuck. I \n                         been toe to toe with the law in this \n                         town for no more than being black \n                         and nearby.\n\n                                     R.L.\n                         What's that chain around her for?\n\n               Laz briefly looks off at the barn, knowing Lincoln is there.\n\n                                     LAZARUS\n                         Why don't you go'on and ask her. She \n                         need to talk wit somebody with sense. \n                         Folks been ruttin' and beatin' on \n                         this gal all her days. And this is \n                         how I'm handling it.\n\n                                     R.L.\n                         THIS IS HOW YOU HANDLING IT? THIS IS \n                         HOW YOU HANDLING IT?\n\n               Silence.\n\n                                     LAZARUS\n                         Go in and talk to her. Please.\n\n               R.L. nods. Lazarus smiles.\n\n                                     LAZARUS\n                         Good. Makin' steaks for supper. I \n                         expect you to come.\n\n                                     R.L.\n                         You mean with you and that woman \n                         chained to ya radiator?\n\n                                     LAZARUS\n                         You treat folks special when they \n                         company. It's just supper, R.L., \n                         shit.\n\n                                     R.L.\n                         One thing at a time, Laz.\n\n               Laz walks toward the barn and turns back to R.L..\n\n                                     LAZARUS\n                         Watch y'self in there. That girl'll \n                         jump on ya junk like a grasshopper.\n\n               EXT. LAZARUS' BARN - AFTERNOON\n\n               Laz opens the door to his barn wide, allowing the afternoon \n               light to find Lincoln sitting on an old tire, weeping.\n\n                                     LAZARUS\n                         Did I hurt'chu?\n\n               Lincoln shakes his head. Laz carefully sits next to him.\n\n                                     LAZARUS\n                         What happened in there... that won't \n                         your fault. Ain't a young man alive \n                         could keep they britches on with \n                         that girl being in heat like she is.\n\n                                     LINCOLN\n                         Why she got a chain on her?\n\n                                     LAZARUS\n                         That's between her and me. It's \n                         private. And I don't want you goin' \n                         off and tellin' ya daddy.\n\n                                     LINCOLN\n                              (in a panic)\n                         Please don't tell my daddy.\n\n                                     LAZARUS\n                         My mouth is shut, boy. And that's \n                         how we gonna keep it. Don't go \n                         braggin' to ya buddies, ya heard me?\n\n               Lincoln nods. Laz hands him the bandana R.L. gave him.\n\n                                     LAZARUS\n                         So...\n                              (a bonding smile)\n                         That your first time?\n\n                                     LINCOLN\n                         Yes'sir.\n\n                                     LAZARUS\n                         You struck some gold, didn't ya?\n\n               Lincoln grins as he wipes the snot from his nose.\n\n                                     LAZARUS\n                         Shit. My first time was with my second \n                         cousin behind my uncle's barn. She \n                         weighed two tons, if a pound. Could'a \n                         done a lot better for myself. You \n                         sho'nuf did.\n\n               INT. LAZARUS' HOME - AFTERNOON\n\n               R.L. hands Rae a glass of water. She is seated on the sofa, \n               wrapped in a quilt.\n\n                                     RAE\n                         Thank you.\n\n                                     R.L.\n                              (sits next to her)\n                         I gotta ask you. Why do you think \n                         Laz is keepin' you chained like this?\n\n                                     RAE\n                              (shrugs at first, \n                              then:)\n                         You know how, like they say, you \n                         save someone's life, you responsible \n                         for them. Guess he just don't think \n                         it's safe for me.\n\n                                     R.L.\n                         So he got it into his head that the \n                         only thing gonna keep you from endin' \n                         up bleedin' on the side of the road \n                         again, without a stitch of clothing \n                         on is...\n                              (R.L. yanks on the \n                              chain)\n                         You think he's crazy for thinkin' \n                         that?\n\n               Rae struggles to answer. Something is on her mind.\n\n                                     RAE\n                         You a preacher?\n\n                                     R.L.\n                         That's right.\n\n                                     RAE\n                         Can I ask you a question?\n                              (R.L. nods)\n                         People always say, you gotta get \n                         good with Jesus, if you want not to \n                         go to hell. That you say sorry for \n                         all you done and... and Jesus would \n                         let you go on to heaven.\n\n                                     R.L.\n                         You could put it that way.\n\n                                     RAE\n                         But that's so fuckin' stupid.\n                              (she catches herself)\n                         I'm sorry. Didn't mean to curse.\n\n                                     R.L.\n                         What's on your mind?\n\n                                     RAE\n                         You can't hurt people... and then \n                         just say, I'm sorry, and then \n                         everything just gets washed away. \n                         Why would heaven want people like \n                         that. People who... do what they \n                         want and then... switch.\n\n                                     R.L.\n                         I'm gonna tell you somethin', and \n                         it's just gonna be between you and \n                         me.\n                              (Rae anxiously nods)\n                         I think folks carry on about heaven \n                         too much. Like it's some all-you-can-\n                         eat buffet up in the clouds. And \n                         folks just gonna do as they're told \n                         so they can eat what they want behind \n                         some pearly gates. I can go to \n                         Shoney's for that.\n\n               Rae grins. R.L. leans closer.\n\n                                     R.L.\n                         There's sin in my heart. There's \n                         evil in this world. But when I got \n                         no one... I talk to God. I ask for \n                         strength. I ask for forgiveness. Not \n                         for peace at the end of my days when \n                         there's no more life to live and no \n                         more good to do, but today. Right \n                         now.\n\n               Rae has never had anyone talk to her like this. She is \n               listening. She is understanding.\n\n                                     R.L.\n                         What's your heaven? What gives you \n                         peace?\n\n               Rae looks at her bare feet. She tries to respond but the \n               pain in her chokes back the words. Tears come to her.\n\n                                     RAE\n                              (struggling to speak)\n                         Ronnie.\n\n                                                                    CUT TO:\n\n               EXT. GREYHOUND BUS STATION - LATE AFTERNOON\n\n               A bus stops at the station. The doors swing open. A few \n               passengers exit the bus followed by Ronnie.\n\n               He is not wearing his uniform.\n\n               EXT. GREYHOUND BUS STATION - PHONE BOOTH - LATE AFTERNOON\n\n               He drops his duffle bag and pops a few quarters in the phone. \n               He waits, allows the phone to ring.\n\n                                     RONNIE\n                              (into the phone)\n                         This is Ronnie again. Don't know if \n                         you been gettin' my messages but... \n                         I'm down at the bus station and...\n                              (struggles)\n                         I just need you come get me. You get \n                         this message, I'm on the interstate \n                         headin' downtown toward the square.\n                              (sadness hits)\n                         Rae. I really need you to... come \n                         find me. Please.\n\n               Ronnie hangs up the phone. He remains motionless, fearful \n               and alone.\n\n               He picks up his duffle and walks down the interstate.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - SUNSET\n\n               Lincoln stands over the barbecue spraying lighter fluid over \n               the coals while R.L. peels back the corn husks.\n\n                                     LINCOLN\n                         We gonna eat with her?\n\n                                     R.L.\n                         That's what I was told.\n\n                                     LINCOLN\n                         She still gonna have that chain on?\n\n                                     R.L.\n                         Well... I'm working on that.\n                              (trying to change the \n                              subject)\n                         So... what's goin' on in your life, \n                         Lincoln?\n\n                                     LINCOLN\n                         I ain't no virgin no more?\n\n               Lincoln tosses a match on the coals. They ignite with flame.\n\n               INT. LAZARUS' HOME - KITCHEN - SUNSET\n\n               Laz is humming to himself as he finishes chopping up the \n               potatoes. He wipes his hands and catches Rae standing behind \n               him.\n\n               She looks classic in the floral sundress. She folds her arms, \n               feeling awkward under Laz's approving gaze.\n\n                                     LAZARUS\n                         Now that's sharp. That is sharp. \n                         Chain give you any trouble?\n\n                                     RAE\n                         Uh-uh.\n\n                                     LAZARUS\n                         Good. Now I got the steaks on, \n                         potatoes at a boil, and biscuits \n                         ready to pop in the oven. R.L. and \n                         Lincoln out yonder grillin' up the \n                         corn. What do you know how to make?\n\n                                     RAE\n                         I don't fuckin' cook.\n\n                                     LAZARUS\n                              (a look of \n                              disappointment)\n                         Gal, I been around hard-cursin' folk \n                         all my life. And let me tell you...\n\n                                     RAE\n                         Look it... I put the Goddamn dress \n                         on, didn't I? I think I'm handlin' \n                         myself with some... fuckin' restraint \n                         here... how you got me locked up \n                         like a dog on a...\n\n                                     LAZARUS\n                         If all you got is filth comin' out'cha \n                         mouth... people just gonna tune ya \n                         out.\n                              (interrupting her)\n                         Rae. RAE! I'm not fightin' with ya. \n                         I just know you got more in you than \n                         junk.\n                              (a breath)\n                         Now, you sayin' you don't know how \n                         to cook anything at all?\n                              (Rae shrugs)\n                         You know how to boil water?\n\n                                     RAE\n                         I can handle that.\n\n                                     LAZARUS\n                              (hands Rae a pot)\n                         Well, get to it.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - KITCHEN - AT THE TABLE - NIGHT\n\n               The four of them (Rae, Laz, Lincoln, and R.L.) are all seated \n               at the kitchen table, holding hands as R.L. says grace.\n\n               Rae peeks at the others with their eyes closed tight. She \n               follows their example.\n\n               R.L.  We ask that you bless this meal put before us. May the \n               food nourish our bodies and this fellowship nourish our \n               spirit. In Jesus name we pray. Amen.\n\n                                     LAZARUS & LINCOLN\n                         Amen.\n\n               There is a sudden flurry of activity at the table as the \n               four begin piling up their plates.\n\n                                     R.L.\n                         Pass them potatoes, Lincoln.\n\n                                     LAZARUS\n                         Y'all let me know if these steaks \n                         are too dry.\n\n                                     R.L.\n                         This all looks wonderful.\n\n                                     LINCOLN\n                         I skipped lunch.\n\n                                     LAZARUS\n                         Well, dig in, son. Got plenty to \n                         eat.\n\n               Rae's eyes are fixed on R.L. as he picks up a devilled egg. \n               She looks over at Laz who is aware of her anxiety. He gives \n               her a wink.\n\n               R.L. bites into the egg and moans with delight.\n\n                                     R.L.\n                              (to Laz)\n                         Mm. MM. Now these eggs got some kick \n                         to it. What'chu got in this?\n\n                                     LAZARUS\n                              (motions to Rae)\n                         Ask the chef.\n\n               Everyone looks at Rae, surprised. She feels a sudden rush of \n               fear as she struggles to answer R.L.'s question.\n\n                                     RAE\n                         Cayenne pepper.\n\n                                                                    CUT TO:\n\n               EXT. LAMPLIGHTER BAR - NIGHT\n\n               Ronnie is walking by the bar along the interstate. He stops \n               when he sees Gill's truck.\n\n               INT. LAMPLIGHTER BAR - NIGHT\n\n               Ronnie adjusts his duffle bag over his shoulder as he enters \n               the mid-sized bar.\n\n               Gill is seated at the bar. He turns to Ronnie along with a \n               few other locals, one being HERMAN, age 40.\n\n                                     GILL\n                              (surprised)\n                         Holy shit.\n\n                                     RONNIE\n                              (understanding)\n                         Yeah.\n\n                                     GILL\n                         Sit down, man. Need a beer?\n\n                                     RONNIE\n                         Sure.\n\n                                     GILL\n                              (to the bartender)\n                         Marv, let's get Ronnie set up here.\n\n               Ronnie sits next to Gill. Herman leans in wanting to be a \n               part of the conversation.\n\n                                     RONNIE\n                         Hey, Herman.\n\n                                     HERMAN\n                         They buy you that big chicken dinner?\n\n               Ronnie stiffens. Gill is confused.\n\n                                     GILL\n                         What?\n\n                                     HERMAN\n                         They got little names for everything \n                         in the corps when they trying to get \n                         rid of ya. Don't know what it's like \n                         in the guard. There's what you call \n                         a bad conduct discharge, a BCD... we \n                         all called it the big chicken dinner. \n                         It ain't the brig but it'll fuck ya \n                         for life if you wantin' to work for \n                         the government.\n\n                                     RONNIE\n                         That's not what this is about.\n\n                                     HERMAN\n                         They got another little name called \n                         ad-sep. That sound about right?\n\n               Ronnie looks away. He takes a sip of his beer.\n\n                                     HERMAN\n                         Ad-sep. Administrative separation.\n\n                                     GILL\n                              (to Ronnie)\n                         How do you get one of those?\n\n                                     HERMAN\n                         Blowin' boys in the head, for one.\n\n               Ronnie loses his cool. He lunges at Herman. Gill holds him \n               back.\n\n                                     HERMAN\n                         Whoa, son! I ain't sayin' shit about \n                         you. I'm just talkin'.\n\n                                     RONNIE\n                         Well, you don't know what you're \n                         talking about so why don't you shut \n                         the fuck up?\n\n                                     GILL\n                         Hey, it's alright, man. It's alright.\n                              (to Herman)\n                         Herman. Come on. He just got back.\n\n               Herman gets up to leave with his beer.\n\n                                     HERMAN\n                         To get back ya had to've gone \n                         somewhere.\n\n               Ronnie glares at Herman as he moves to the other side of the \n               bar. Gill moves closer to Ronnie to get the whole story.\n\n                                     GILL\n                         What happened?\n\n                                     RONNIE\n                         They been keepin' a folder on me cuz \n                         of my stomach. Like how it was just \n                         before we'd play ball back in school. \n                         Thought it was just some tic I got, \n                         or ulcers like my daddy had.\n                              (takes a drink)\n                         I can't... shoot. Target practice \n                         I'm a pro. I tag between the numbers \n                         each time but...\n                              (feels a stomach cramp)\n                         But when there's really loud noises \n                         around me... somethin' happens. I \n                         get shaky and... I lose my breath. \n                         They called it anxiety. Severe \n                         anxiety. It can be fixed and all... \n                         just not in time for....\n                              (another drink)\n                         It's a long process but... they sent \n                         me home.\n\n                                     GILL\n                         I guess it could be worse. You could \n                         be comin' back in a body bag.\n\n               Gill doesn't know what to say next.\n\n                                     RONNIE\n                         I can't get Rae on the phone. She's \n                         not at home... none of her friends \n                         seen her anywhere.\n\n                                     GILL\n                         She's around. Always is.\n\n                                     RONNIE\n                         I don't know. She's gettin' crazy, \n                         like she gets. Begged me not to go. \n                         Got real down. I just think somethin's \n                         happened. Like she run off with \n                         someone. You'd tell me if you knew \n                         somethin', right?\n\n                                     GILL\n                         You been home yet?\n\n                                     RONNIE\n                         Uh-uh. I's hitchin' up the interstate \n                         when I seen your truck outside.\n\n                                     GILL\n                         You need a ride?\n\n                                                                    CUT TO:\n\n               EXT. RONNIE'S TRAILER - NIGHT\n\n               Gill's truck rounds the bend and up the gravel drive leading \n               up to Ronnie's trailer.\n\n               The headlights scan across the porch as Gill parks.\n\n               INT. RONNIE'S TRAILER - NIGHT\n\n               Ronnie is the first through the door, calling out for Rae \n               before he can turn on the lights.\n\n                                     RONNIE\n                         Rae?\n\n               Gill enters. He sees that the trailer is the same as it was \n               the day he picked up Ronnie, nothing is different.\n\n                                     RONNIE\n                         This don't feel right. Kitchen looks \n                         just like I left it. I know, cuz I \n                         cleaned it.\n\n                                     GILL\n                         She ever tell you she was thinkin' \n                         of taking off?\n\n                                     RONNIE\n                         I just been so mixed up lately, Gill. \n                         And, you know, with her history, I \n                         can see how she could get scared...\n                              (tears)\n                         ...and run.\n\n               Gill is disturbed by Ronnie's sudden flood of emotion and \n               tears. He crosses to the pantry, already knowing which \n               cupboard to pull the liquor out of.\n\n               He pours two drinks. He hands one to Ronnie.\n\n                                     GILL\n                         Drink. Come on, drink some.\n\n               Ronnie manages a few swallows.\n\n                                     RONNIE\n                         Her momma works down at the grocery, \n                         down on the square. Maybe she seen \n                         her.\n\n               Gill stands over Ronnie, looking down on his pitiful face.\n\n                                     GILL\n                         Ronnie. You can't see cuz you're too \n                         close to it.\n                              (Ronnie waits)\n                         These nervous spells you get. You \n                         never had that shit back in school...\n\n                                     RONNIE\n                         That's not right, really, cuz I...\n\n                                     GILL\n                              (continuing)\n                         You joined up in that monkey troop \n                         cuz you had a plan for yourself. \n                         Army'd pay for school. You were gonna \n                         get a degree, maybe somethin' in \n                         business or agriculture and you were \n                         gonna make somethin' of yourself.\n\n               His words are painful to Ronnie. Gill doesn't hold back.\n\n                                     GILL\n                         And then you had to fall in love \n                         with the school slut.\n\n                                     RONNIE\n                         Now wait...\n\n                                     GILL\n                              (continuing)\n                         With all she was doin'. With all the \n                         shit she kept doing! You stayed stuck \n                         to that bitch's ass and you wouldn't \n                         let go.\n\n                                     RONNIE\n                         I know about how she was like. But \n                         we was different. I's the only person \n                         she talked to about it. How she's \n                         abused. Terrible things, Gill, just \n                         terrible...\n\n               Rage suddenly fills Gill. He grabs Ronnie and throws him \n               against the wall.\n\n                                     GILL\n                         YOU HAD A PLAN! YOU HAD A GODDAMN \n                         LIFE! AND SHE JUST FUCKED THE GUTS \n                         OUT OF YOU!\n\n                                     RONNIE\n                         It's not her fault, Gill. She's had \n                         to take care of me all this time, \n                         cuz I'd just start throwin' up... \n                         choking. Just losin' my grip. And \n                         she listened. She listened to me.\n                              (Gill releases Ronnie \n                              and walks away)\n                         And... I got better. I don't get \n                         nervous like I used to. And since we \n                         been together... she been faithful \n                         to me. Put all that junk behind her...\n\n                                     GILL\n                         The only thing that cunt's had behind \n                         her is me and half the town fuckin' \n                         her.\n                              (Ronnie can't believe \n                              it)\n                         Your first night away, I come over \n                         and drop off the spare keys like you \n                         wanted me to. You weren't gone two \n                         hours and she was aching to get me \n                         inside her. Like she was havin' some \n                         kind'a fit.\n\n               Ronnie can't respond. Tears roll down his face. Gill holds \n               up the whiskey bottle.\n\n                                     GILL\n                              (pours a drink)\n                         Don't you think it's funny how I \n                         know where everything in your house \n                         is?\n                              (moves in close)\n                         I don't care if that hurts you or \n                         not. Truth is I don't know who you \n                         are anymore. So fuck it.\n\n               Gill turns away. Ronnie grips Gill around the neck from \n               behind. He bends him back painfully and throws his head up \n               against the wall.\n\n               EXT. RONNIE'S TRAILER - NIGHT\n\n               The front door burst open as Gill goes flying down the front \n               porch. Ronnie cocks a .45 and shoves it into his belt.\n\n               Ronnie pins Gill's elbow behind his back and retrieves the \n               keys from his front pocket.\n\n                                     GILL\n                         You gonna steal my truck?\n\n                                     RONNIE\n                         Make yourself at home. You done it \n                         already.\n\n               Gill watches Ronnie tear down the drive in his own truck.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - NEAR THE BARN - NIGHT\n\n               Laz and R.L. are smoking. Laz smiles as he watches Lincoln \n               and Rae through the kitchen window as they wash dishes and \n               talk about football.\n\n                                     R.L.\n                         Gotta get that chain off her, Laz. \n                         Somethin' like this gets out, you \n                         could land in a heap of trouble.\n\n                                     LAZARUS\n                         I'm dealin' with what God put before \n                         me.\n\n                                     R.L.\n                         You believe He wants this? A woman \n                         chained to ya radiator?\n\n                                     LAZARUS\n                         Not like that.\n\n                                     R.L.\n                         Then what?\n\n                                     LAZARUS\n                         She's tied to me, R.L.. We tied to \n                         each other.\n\n               Laz is silent.\n\n                                     R.L.\n                         I can't leave unless I get your word.\n\n               Laz looks down at his shoes. He surrenders. He nods.\n\n                                     R.L.\n                         Laz. I got some news you need to \n                         hear. It's about Rose and your \n                         brother.\n                              (this is not easy for \n                              R.L.)\n                         She's pregnant. She gonna have a \n                         baby.\n                              (silence)\n                         Her sister told my wife. You know \n                         how them sewing circles go. Just a \n                         matter of time till you got word. \n                         Thought that's why you been keepin' \n                         to yourself out here.\n                              (Laz conceals his \n                              pain)\n                         I don't know how much of this is to \n                         make her happy or to hurt you. But \n                         it is what it is.\n\n               Laz struggles with his emotions. He turns to R.L. stone faced \n               and cold.\n\n                                     LAZARUS\n                         I'm through with them both.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - THE FRONT DOOR - NIGHT\n\n               Laz and Rae wave to Lincoln as he climbs into R.L.'s car. \n               They pull away, up the drive, and disappear into the night.\n\n               The cicadas sing as the two stand in silence: Rae, at peace, \n               feeling genuine contentment; while Laz looks lost in silent \n               pain.\n\n                                     RAE\n                         They sure liked them devilled eggs.\n\n                                     LAZARUS\n                         You drink whiskey?\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - NIGHT\n\n               A bottle of whiskey is removed from a top cabinet above the \n               refrigerator. Two small glasses each get a healthy swallow.\n\n                                     LAZARUS\n                         You take it straight?\n\n                                     RAE\n                         Sure.\n\n               He hands her a glass. Laz then looks at his as if he struggles \n               with a decision.\n\n                                     LAZARUS\n                              (holding up the glass)\n                         To my baby brother. Gonna be a daddy.\n\n               Rae nods and downs the whiskey with Lazarus.\n\n                                     RAE\n                         Well, that's good news. So you're \n                         gonna be someone's uncle.\n\n               Laz pours another swig for himself and downs it.\n\n                                     LAZARUS\n                         Want another?\n\n                                     RAE\n                         We drinkin' buddies now?\n\n                                     LAZARUS\n                              (pours two more glass)\n                         To freedom.\n\n               Laz pounds back his third shot.\n\n                                     RAE\n                         Still makin' jokes?\n\n                                     LAZARUS\n                              (pulls out his keys)\n                         No joke.\n\n               Laz pulls Rae closer to him by the chain wrapped around her \n               waist. He opens the old lock with a key.\n\n                                     LAZARUS\n                         Not my place to change your mind, or \n                         anybody else's. People gonna do how \n                         they please. You only get one life... \n                         should be lived the way you wanna \n                         live it.\n\n               The chain falls to the floor with a hollow thud. Rae looks \n               confused.\n\n                                     LAZARUS\n                         If you want... I can take you back \n                         to town now.\n\n                                     RAE\n                         I ain't in a hurry.\n\n               The two stare at each other in silence.\n\n                                     RAE\n                         Could you do somethin' for me?\n\n                                     LAZARUS\n                         Anything.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - KITCHEN - NIGHT\n\n               Rae watches with intense curiosity as Laz tunes his guitar, \n               sitting at the table.\n\n                                     LAZARUS\n                              (takes another drink)\n                         Ain't played 'fore nobody in years.\n\n               Laz slides his calloused fingers across the strings, spurring \n               the old guitar into an impressive wail. Rae grips the chair.\n\n                                     LAZARUS\n                              (plays as he remembers)\n                         Funny how a sound just speak to ya \n                         heart.\n\n               A haunting slide guitar riff barks. Rae has a physical \n               reaction to the music. She is fascinated and fearful.\n\n                                     LAZARUS\n                              (thinks)\n                         Wanted me some kids. A whole mess of \n                         'em. But Rose, my wife... chil'ren \n                         was for another time.\n                              (takes a drink)\n                         They's this one spring... I saw a \n                         change in her. Her breasts start \n                         swellin' up. Come a few mornings I \n                         hear her heavin' in the bathroom. I \n                         seen it with women before. I knew.\n\n               Laz thinks for a moment. Continues playing.\n\n                                     LAZARUS\n                         Come a day, Rose say she had to go \n                         visit her folks in Jackson. Didn't \n                         want me to come... so I stayed put.\n                              (remembers)\n                         When she come back...\n                              (hesitates)\n                         They talk about a woman havin' that \n                         glow. Couldn't see it no more. She... \n                         took it away. Cut it out.\n\n               The guitar's song turns dark. Laz slides his fingers up the \n               guitar strings, lingering on low growns.\n\n                                     LAZARUS\n                         One night... While she sleepin'. \n                         Held a pillow in my hands. I could \n                         see myself killin' her. What evil in \n                         my heart make me wanna kill her, I \n                         don't know? It's that voice in me. \n                         Each time I think it's gone, he come \n                         howlin' back. Devil or no, I don't \n                         know. But I am a haunted man.\n\n               Fear spreads across Rae's face. Laz is talking about something \n               all too familiar.\n\n                                     LAZARUS\n                         Calls me when I'm ailing. When I \n                         can't find my home, lost in the pines. \n                         I calls it the Black Snake Moan.\n                              (he closes his eyes \n                              and sings)\n                         Mm-mm... Got no momma now.Mm-mm... \n                         Got no momma now.It's over late last \n                         night, don't need no momma now.\n\n               Laz stops. He sways back and forth with his eyes closed. Rae \n               hears the swell of the cicadas. Her eyes dart to the front \n               door as the familiar creek of footsteps are heard.\n\n                                     RAE\n                         Sing, Lazarus.\n                              (kneels next to him \n                              in fear)\n                         Please keep singin'.\n\n               The door swings open. A white calloused hand appears around \n               Rae's mouth.\n\n               She gasps in terror, clutching Laz's leg. The white hand is \n               gone. Tears come to her. She trembles as Laz sings.\n\n                                     LAZARUS\n                              (singing)\n                         Mm-mm... Black snake crawlin' in my \n                         room.Mm-mm... Black snake crawlin' \n                         in my room.Some pretty momma better \n                         come and get this black snake soon.\n\n               Rae rests her head against his knee.\n\n                                     LAZARUS\n                              (singing)\n                         Black snake is evil, black snake is \n                         all I see.Black snake is evil, black \n                         snake is all I see.Woke up this \n                         mornin', black snake moved in on me.\n\n               Laz concludes the song. Rae raises up to her knees, facing \n               Laz. Tears have run down his dried face. He opens his eyes.\n\n                                     LAZARUS\n                         My life is gone. Only life I was \n                         livin'. And I lost it.\n\n                                     RAE\n                         I'm here with you.\n\n                                     LAZARUS\n                         I had love in my heart. And I gave \n                         it to one woman. And she gone now.\n                              (his lip quivers)\n                         Where am I gonna put all this love?\n\n               Rae gently touches his cheek. The wind picks up outside.\n\n                                     RAE\n                         You can give it to me.\n\n               Rae kisses Laz. He is motionless at first, allowing it to \n               happen. His hand moves from the neck of his guitar to the \n               bend in her neck.\n\n               The passion intensifies as they squeeze the guitar between \n               them.\n\n               Laz pulls his lips away and holds her head in his hands. \n               They are so close, they are breathing into each other's \n               mouths.\n\n                                     RAE\n                         You can't start this and not finish. \n                         Not with me.\n                              (kisses him)\n                         Please...\n\n               The guitar clangs to the floor as Laz lifts Rae in his arms. \n               They kiss, ravenous for each other. He knocks up against the \n               side table, causing his Bible to fall to the floor, face up \n               and open. The wind pushes the front door open, slamming it \n               hard against the wall.\n\n               They turn together, kissing, Laz slowly spinning with Rae in \n               his arms. But Laz is soon distracted by the pages of his \n               Bible fluttering on the floor. The wind is blowing the pages, \n               turning them with an unseen hand.\n\n                                     LAZARUS\n                         Wait... I gotta stop...\n                              (Rae's kisses get \n                              more aggressive)\n                         Rae stop...\n                              (she can't hear, the \n                              burning has her)\n                         Dammit, Rae... GET OFF!\n\n               It takes a considerable effort to pull Rae away. She falls \n               to the floor, dizzy and sucking in air.\n\n                                     LAZARUS\n                         This ain't the way for me. I'm sorry.\n\n               Rae is struggling for breath. She desperately grabs at Laz.\n\n                                     RAE\n                         Not gonna lie to you, Laz...\n                              (labored breath)\n                         This one's a doozy. I don't think... \n                         I don't think I can stop this.\n\n               Her eyes roll back briefly, almost losing consciousness. Laz \n               catches her and holds her tightly.\n\n                                     LAZARUS\n                         Tell me what to do.\n\n                                     RAE\n                              (Barely able to speak)\n                         The... chain helps.\n\n               Laz grips the chain and wraps it around Rae.\n\n               As the burning increases. Laz holds Rae tight across his \n               lap, his back up against the radiator.\n\n                                     RAE\n                         I seen a man die. He couldn't \n                         breathe... his heart was... was givin' \n                         out.\n\n                                     LAZARUS\n                         You just havin' a fit. You ain't \n                         goin' nowhere.\n\n                                     RAE\n                         He told me... get help. I just stood \n                         there and watched him... I watched \n                         him die, Laz. Oh God! GODDAMMIT!\n\n               Her legs itch like they are covered in ants. The wave is \n               hitting her hard. Laz holds her face up to him.\n\n                                     RAE\n                              (like a little girl)\n                         Oh, Laz... he hurt me. He... hurt me \n                         so many times.\n\n                                     LAZARUS\n                         No one's gonna hurt you no more.\n\n                                     RAE\n                         You think God forgives people like \n                         that?\n                              (crying like a child)\n                         You think God forgives people like \n                         me?\n\n               Suddenly aware of the rising burn, Rae grits her teeth.\n\n                                     RAE\n                         Hold me. Oh God...\n\n               Rae turns away as Laz holds her head in his lap. She bites \n               down on his middle finger as his hand moves over her mouth.\n\n               She is gasping, screaming into his hand.\n\n               It hits. Laz holds her.\n\n               Rae's open mouth quivers as the sensation peaks. Her shoulders \n               slump, her chest vibrates. She is crying softly.\n\n                                     LAZARUS\n                         We'll just stay here. Wait till it \n                         passes.\n\n               The pages of the Bible flip to the final pages in the wind.\n\n                                                             FADE TO BLACK.\n\n               EXT. FISHERVILLE SQUARE - MORNING\n\n               Laz's truck pulls into his usual spot on the square. Rae is \n               riding shotgun.\n\n                                     RAE\n                         Where you gonna be?\n\n                                     LAZARUS\n                         Right here. Be here all afternoon.\n                              (waits)\n                         You ready for this?\n\n                                     RAE\n                         I'm gonna just get some girl stuff, \n                         like make-up and... stuff.\n\n               Rae looks out the window, a touch of fear.\n\n                                     LAZARUS\n                         This town ain't goin' nowhere. You \n                         take the time you need.\n\n               They both step out of the truck. Gene and Archie watch Rae's \n               ass as she walks by. They then look back at Laz, incredulous.\n\n                                     LAZARUS\n                         Friend of mine.\n\n                                                                    CUT TO:\n\n               INT. FISHERVILLE GROCERY - MORNING\n\n               Rae enters the modest grocery store holding herself tight. A \n               few harmless shoppers look at her making her feel even more \n               uncomfortable.\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE SQUARE - AFTERNOON\n\n               Laz is selling vegetables to a young woman. He is unaware \n               that Angela has moved up behind him, grinning, carrying a \n               small basket.\n\n                                     ANGELA\n                         I bet you have loyal customers.\n\n                                     LAZARUS\n                              (turns and grins)\n                         You liked what I brung ya?\n\n                                     ANGELA\n                         Been eatin' like a princess all week. \n                         Even got enough for us to take a \n                         picnic under the gazebo.\n\n                                     LAZARUS\n                         That'd be nice.\n\n                                     ANGELA\n                         I put on the lotion you got me. Can \n                         you smell it?\n\n               Angela steps forward and pulls away her hair from her neck. \n               She cranes, offering her neck for Laz to smell.\n\n                                     LAZARUS\n                              (smells)\n                         That's nice, too.\n\n                                                                    CUT TO:\n\n               INT. FISHERVILLE GROCERY - AFTERNOON\n\n               Rae is looking at herself in the provided makeup counter \n               mirror. She looks at the compact in her hand and decides \n               against the purchase.\n\n               She rounds the corner and stops. She sees Sandy on her knees \n               in the center of the aisle, building a display of tuna cans.\n\n               Rae thinks to leave, but stops. She makes a decision to talk \n               to her. She walks up the aisle and stands above her mother.\n\n                                     RAE\n                         Hey.\n\n               Rae kneels down next to her. She's trying to make a \n               connection.\n\n                                     SANDY\n                         What happened to your face?\n\n                                     RAE\n                         Got in a little accident.\n\n                                     SANDY\n                              (not believing her)\n                         Yeah.\n\n               Sandy stands and wipes her brow.\n\n                                     RAE\n                         Since you workin' on the square now, \n                         maybe we could get some coffee in \n                         the morning, if you want.\n\n                                     SANDY\n                         You need money again?\n\n                                     RAE\n                         No. That's not why...\n                              (a frustrated breath)\n                         Why we always gotta do this? I mean, \n                         you and me been at each other as far \n                         back as I can remember. Wasn't no \n                         love between us. And I'm your \n                         daughter. I'm the only family you \n                         got.\n\n                                     SANDY\n                         You never needed nobody. Always made \n                         that clear to me.\n\n                                     RAE\n                         Yeah. I know I did. But...\n                              (struggles with tears)\n                         I'm tryin' to be dif'rent. I'm tryin' \n                         to... get some peace, you know?\n\n                                     SANDY\n                         I'm workin' here, Rae. Can you see \n                         that?\n\n                                     RAE\n                         I just wanted some make-up.\n\n                                     SANDY\n                         All that shit's on aisle 5.\n\n               Rae starts walking away. She quickly turns.\n\n                                     RAE\n                         I just think you should'a kept him \n                         off me, that's all.\n\n                                     SANDY\n                         The hell are you talkin' about?\n\n                                     RAE\n                         Now see? Don't do that. I'll go along \n                         with all you say about me. But that... \n                         you can't pretend no more on that. \n                         Cuz I was just a kid, Momma.\n                              (a terrible silence)\n                         I didn't know about any of that stuff \n                         he was doin' to me.\n                              (tears well up)\n                         And you let him do it. Some big nobody \n                         in your life... and you let him do \n                         as he wanted... with the only SOMEBODY \n                         you had.\n\n               It is clear from Sandy's reserved anguish that Rae is telling \n               the truth.\n\n               Sandy firmly grips her by the arm and walks her out. Rae \n               winces in pain like a toddler being led off to a car for a \n               good whipping.\n\n                                     RAE\n                         I'm sorry... I didn't mean to shout...\n\n                                     SANDY\n                         All my life I been puttin' out your \n                         fires, with you givin' out your snatch \n                         to every waggin' dick in this town. \n                         And you gonna lay the blame at my \n                         feet? Well, I ain't gonna take that.\n\n                                     RAE\n                         But... Momma... just tell me... not \n                         gonna be mad... we can just talk \n                         about it... Be eye to eye on this... \n                         You don't even got to say you're \n                         sorry... Just say how you knew...\n\n                                     SANDY\n                         Only thing I'm sorry for is listenin' \n                         to my parents and having you instead \n                         of doin' what I should'a done.\n\n               Sandy walks back up the aisle returning to her canned tuna.\n\n               And then the rage hits Rae.\n\n               With each breath Rae grits her teeth tighter. She grabs a \n               mop off the side aisle and turns around. Sandy is pricing \n               cans, down on her knees. She doesn't see Rae coming.\n\n                                     RAE\n                         ...tell me you don't know... goddamn \n                         LIAR!\n\n               Rae clocks her over the head, sending Sandy into the display \n               of cans. Rae hits her again with the mop. She is screaming \n               in short anguished breaths.\n\n               Rae grabs everything she can and dumps them onto Sandy: Bags \n               of flour, cans, entire shelves of ketchup.\n\n                                     RAE\n                         SAY IT! JUST FUCKING SAY IT!\n\n               Mark comes running to the aisle followed by two other \n               employees. Stunned customers watch in amazement.\n\n                                     MARK\n                         Rae! Rae! What are you doin'?\n\n                                     RAE\n                              (hysterically screaming \n                              and thrashing the \n                              mop)\n                         GET OFF ME! GET OFF ME! GET... \n                         HIM...OFF!\n\n                                                                    CUT TO:\n\n               EXT. FISHERVILLE SQUARE - AFTERNOON\n\n               Laz and Angela are seated next to each other under the gazebo.\n\n                                     ANGELA\n                         I's thinkin' about singing in the \n                         choir.\n\n                                     LAZARUS\n                         At church?\n\n                                     ANGELA\n                         Mm-hm. I don't know if I got a good \n                         voice or not but... practice is only \n                         on Mondays and Wednesdays, so...\n\n                                     LAZARUS\n                              (grinning)\n                         You gonna sing me somethin'?\n\n                                     ANGELA\n                         When? Now? Oh. No.\n\n                                     LAZARUS\n                         Come on, just a little somethin'. \n                         Right here. Go'on now, don't be shy.\n\n               Angela blushes. She looks around and then leans in close to \n               Laz. She sings softly, sweetly, with all her soul.\n\n                                     ANGELA\n                              (singing)\n                         There is a balm in Gilead to make \n                         the wounded whole.\n\n               Laz is falling in love. She is so beautiful to him, he doesn't \n               see the people running to the front of the grocery store.\n\n                                     ANGELA\n                              (singing)\n                         There is a balm in Gilead to save my \n                         sick, sick soul.\n                              (opens her eyes, speaks)\n                         So. You think I should be in the \n                         choir?\n\n               Laz is grinning from ear to ear. He is about to speak but \n               the commotion outside the grocery catches his attention. His \n               smile fades.\n\n                                     ANGELA\n                         What? What is it?\n\n               Laz bolts toward the grocery as fast as he can.\n\n               INT. FISHERVILLE GROCERY - AFTERNOON\n\n               Laz rushes past the gawking customers at the end of the aisle. \n               A few male workers, including Mark, stand at a distance \n               watching Rae weep on the floor.\n\n               Sandy is being helped up by a co-worker -- her head is \n               bleeding.\n\n               Rae rocks back and forth, her face spotted with flour dust, \n               the mop held tightly in her grip.\n\n               Mark tries to step closer but Rae cries out, thrashing with \n               the mop handle. They retreat.\n\n                                     LAZARUS\n                         RAE? GAL? YOU HEARIN' MY VOICE?\n\n               Rae lifts her eyes.\n\n                                                                  FLASH TO:\n\n               QUICK CUTS\n\n               The chain pulling around Rae's waist. The radiator clanking \n               as it is pulled. Laz's hand holding her head to him as she \n               cries.\n\n                                                             FLASH BACK TO:\n\n               INT. FISHERVILLE GROCERY - AFTERNOON\n\n               Laz slowly crosses to Rae. She lifts her tear-soaked eyes to \n               him. He kneels next to her.\n\n                                     LAZARUS\n                         I'll take you home now.\n\n               He lifts her up in his arms. She sobs into his chest as he \n               carries her through the onlookers.\n\n               Angela is there. She looks confused and shocked.\n\n                                     ANGELA\n                         This your cousin?\n\n               Laz can't lie anymore. His gaze falls to the floor. He leaves \n               the store without saying anything to Angela.\n\n               EXT. FISHERVILLE SQUARE - AFTERNOON\n\n               Ronnie has parked Gill's truck on the square. He starts \n               walking up to the grocery store.\n\n               He sees Laz carrying Rae in his arms. She is sobbing into \n               his chest, blind to all around her. Ronnie freezes in shock \n               as Laz approaches.\n\n                                     LAZARUS\n                         Move, son.\n                              (Ronnie is unable to \n                              move)\n                         Goddammit, kid, get outta my way!\n\n               Laz pushes Ronnie causing him to fall backwards on to the \n               pavement.\n\n               Ronnie watches Laz put Rae in his truck and drive away. A \n               wave of nausea hits. He turns over and heaves.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - SUNSET\n\n               The wooden chimes are deathly still above the porch. The \n               evening cicadas have begun their chorus.\n\n               INT. LAZARUS' HOME - THE BATHROOM - SUNSET\n\n               Rae is holding her knees to her chest in the tub. Laz sits \n               next to her, dipping the sponge in the water, gently washing \n               her back and shoulders.\n\n               Laz moves her head back into the palm of his hand to wash \n               her hair. She stares into his eyes as he squeezes the sponge \n               on her forehead.\n\n                                     RAE\n                         You took care of your wife, like you \n                         do me?\n\n                                     LAZARUS\n                         I tried.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - NIGHT\n\n               Rae is wrapped in the quilt, laying on the couch. She is \n               awake and motionless, helpless to her depression.\n\n               INT. LAZARUS' HOME - THE BEDROOM - NIGHT\n\n               Laz sits on the side of his bed. Something is on his mind.\n\n               We CUT TO him on his stomach searching for something under \n               his bed.\n\n               Another old guitar case comes out, followed by another, then \n               another. Finally, Laz stands, an old maroon case in his grip.\n\n               He opens the latches on the side and lifts the thin lid, \n               revealing a gorgeous cream colored electric guitar.\n\n               INT. LAZARUS' HOME - NIGHT\n\n               Rae has not fallen asleep yet. She turns to see Laz entering \n               the dark room with the maroon guitar case.\n\n                                     LAZARUS\n                         You and me, we night owls. No use \n                         fightin' this shit.\n                              (tosses her a dress)\n                         Get up.\n\n                                                                    CUT TO:\n\n               EXT. BOJO'S - NIGHT\n\n               Laz's truck groans as it bounces into the crowded parking \n               lot of Bojo's.\n\n               Rae steps out, looking beautiful in her sun dress. Laz slams \n               the door to his truck, guitar case in hand.\n\n               They begin walking inside. Rae's watch goes off. She quickly \n               turns it off. But a faint echo of the alarm can be heard \n               behind her. She stops and turns toward the truck. The sound \n               is gone.\n\n                                     LAZARUS\n                         What is it?\n\n                                     RAE\n                         Nothin'.\n\n               They go inside.\n\n               Ronnie's hand appears from under the blue tarp in the back \n               of Laz's truck. He pulls himself out and looks around.\n\n               INT. BOJO'S - NIGHT\n\n               Laz and Rae stand like strangers by the door. The place is \n               wall to wall -- people at the bar, people playing pool.\n\n               Laz sees the culprit of this show. R.L. is gabbing with Bojo, \n               a beer in his hand.\n\n                                     LAZARUS\n                         Get'chu at that table up yonder.\n\n                                     RAE\n                         By myself?\n\n                                     LAZARUS\n                         You can handle it.\n\n               As Rae makes her way through the crowd of people, Laz marches \n               over to R.L.\n\n                                     LAZARUS\n                         The hell is this shit?\n\n                                     R.L.\n                         What? I called Bojo, like you say. \n                         Called up the fellas in the band...\n\n                                     LAZARUS\n                         The fuck are all these people doin' \n                         here? Been drinkin' in this shit \n                         hole for years ain't seen this many \n                         people since I don't know...\n\n                                     BOJO\n                         Shit hole... Hey kiss my ass, Laz.\n\n                                     LAZARUS\n                         Nigga, you go'on kiss my ass. Ya \n                         both called everybody, didn't ya?\n\n               Bojo turns away to another customer. R.L. grins as he removes \n               a flask. He offers it to Laz. Laz snaps it away.\n\n                                     LAZARUS\n                         There you go, preacher man. Get me \n                         drunk so I don't stick my foot up yo \n                         ass.\n\n                                     R.L.\n                         I just know how you get. Good to \n                         know, them butterflies still in ya \n                         gut.\n\n               Laz and R.L. look over at Rae seated alone at a small table \n               near the stage.\n\n                                     R.L.\n                         Heard about this morning.\n\n                                     LAZARUS\n                         We ain't here to talk about that \n                         shit.\n\n               Laz surprises R.L. by walking away and up onto the stage.\n\n               Rae watches as Laz, shakes hands with some of the band \n               members. A few whistles from the crowd.\n\n               Laz sits down at a chair off to the right of a short mic \n               stand.\n\n               He plugs in.\n\n               Rae watches curiously as Laz tunes his guitar -- moans of \n               electric distortion.\n\n               R.L. sits next to her.\n\n                                     R.L.\n                         You in for it, now. He gonna nail it \n                         to the wall tonight. I done pissed \n                         him off.\n\n               The drummer kicks in. Laz tears into the strings. The entire \n               place begins to undulate and bounce as Laz returns to the \n               blues.\n\n                                     LAZARUS\n                              (singing)\n                         I don't know, but I been around, \n                         tell me them women shake 'em on down.\n\n               Cheers. Rae watches in awe. She's never seen anything like \n               it. She is surrounded by couples dancing so close they might \n               as well be naked. But there is also a great sense of safety \n               as Laz controls the room with his music.\n\n                                     LAZARUS\n                              (singing)\n                         Yes, I'm goin' Georgia line. \n                         See if them women sweet like mine.\n\n               HERSHEL, a black man in his 30's, asks Rae to dance.\n\n                                     HERSHEL\n                         You wanna cut it up, baby?\n\n                                     RAE\n                              (shrugging)\n                         Well...\n\n               Rae looks up at Laz. Laz smiles and nods. Rae takes the man's \n               hand and moves out onto the dance floor. R.L. can't be seated \n               anymore. He stands and stomps his foot.\n\n                                     R.L.\n                              (shouting at Laz)\n                         Yeah, you know you home, old man. \n                         You just walked through the door.\n\n                                     LAZARUS\n                              (singing)\n                         I don't know, but I been told, them \n                         Georgia women sweet jelly roll.\n\n               Rae allows Laz's voice and guitar to take hold of her. Her \n               face gets wet with sweat as she moves, making love to the \n               current in the air.\n\n               Men are dancing all around her, but now she is in control. \n               She turns to a young man and shakes, then an old man.\n\n               She is free, herself, and above all, safe.\n\n               Laz smiles, unaware of Ronnie watching from the window behind \n               him. There is rage and confusion in his face as he watches \n               Rae surrounded by dancing limbs.\n\n                                                                    CUT TO:\n\n               EXT. LAZARUS' HOME - KITCHEN - NIGHT\n\n               Both Laz and Rae are drinking water from the sink in tall \n               glasses like they've been stranded in a desert.\n\n                                     RAE\n                         Are you drunk?\n                              (Laz shrugs)\n                         Keep drinkin' water and you won't \n                         get a headache in the mornin'.\n\n                                     LAZARUS\n                         Yeah, gal I been here before.\n\n                                     RAE\n                              (smiling)\n                         I guess you have.\n\n               INT. LAZARUS' HOME - THE BEDROOM - NIGHT\n\n               Laz is taking off his shoes, getting ready to crash for the \n               night. He sits down on the side of his bed and takes off his \n               shirt, leaving his T-shirt on.\n\n               Rae is standing in his doorway.\n\n                                     RAE\n                         Laz? Can I sleep with you tonight?\n\n                                     LAZARUS\n                         Don't think that'd be wise.\n\n                                     RAE\n                         I didn't mean it nothin' dirty.\n\n                                     LAZARUS\n                         I know you didn't. But you a grown \n                         girl. You can handle it. I got to.\n\n               Rae understands. She crosses to Laz and kisses him on the \n               cheek.\n\n               Rae then walks down the hall to her couch in the front room.\n\n               Laz turns off the light.\n\n                                                              CUT TO BLACK:\n\n               INT. BATHROOM - NIGHT - FLASHBACK\n\n               Rae enters the dark bathroom and shuts the door behind her. \n               Her hair is shorter, a shaggy bob, bleached platinum blond.\n\n               ARTY, always behind the door, attempts to enter, but Rae \n               pushes the door closed and locks it.\n\n                                     ARTY\n                         Baby, where you goin'?\n\n                                     RAE\n                         I'm gonna pee. I gotta take a break \n                         and go pee.\n\n                                     ARTY\n                         Now, this isn't fair. You said I \n                         could do it, too.\n\n                                     RAE\n                         Eat shit and die, Arty. A girl can \n                         change her fuckin' mind.\n\n               Rae finds the light switch. She yelps upon seeing Ronnie \n               crouched by the tub.\n\n               Suddenly feeling violated Rae yanks down on her shirt to \n               hide the fact that she's not wearing anything else.\n\n                                     RAE\n                         Hey.\n\n                                     RONNIE\n                         Hey.\n\n                                     RAE\n                         You don't gotta get up but... I gotta \n                         go...\n\n               Ronnie attempts to get up but it's too late, Rae has already \n               squatted on the commode, pinning Ronnie between her and the \n               bathtub.\n\n               Rae is breathing heavy, her focus is scattered. She's coming \n               up or coming down from a big burn.\n\n                                     RAE\n                              (waiting for pee)\n                         I think if I just piss... I'll be \n                         okay.\n\n                                     RONNIE\n                         You feelin' sick?\n\n                                     RAE\n                         I'm just in one of my moods. You \n                         know how I get.\n\n                                     RONNIE\n                         Yeah, I know.\n\n               Ronnie tries to look away, trying to make an awkward moment \n               less awkward. Rae's anxiety is hitting her.\n\n                                     RAE\n                         I think it'd be better if you talk \n                         to me.\n\n                                     RONNIE\n                         Yeah?\n\n                                     RAE\n                         Just about anything, you know. It \n                         can be funny or... not. Just tell me \n                         somethin'.\n\n               Ronnie nervously considers this before agreeing to open his \n               mouth. He points into the tub.\n\n                                     RONNIE\n                         Well. That's my vomit. I came in \n                         here to get sick. I thought I'd make \n                         the toilet but... anyway, I got sick.\n\n                                     RAE\n                         Are you wasted?\n\n                                     RONNIE\n                         No. I just got a messed up stomach.\n\n                                     RAE\n                              (remembering)\n                         Holy shit!\n\n                                     RONNIE\n                         What?\n\n                                     RAE\n                         Holy shit, Ronnie!\n                              (smacks him on the \n                              arm)\n                         You're a fuckin' rock star.\n\n                                     RONNIE\n                         I'm a what?\n\n                                     RAE\n                         All them people shoutin' your name \n                         like they were doing tonight! Shit! \n                         That arm you got'll get'chu on a box \n                         of cereal...\n\n               Ronnie leans over and dry heaves into the tub. It is painful. \n               Rae leans forward and touches his back, comforting him.\n\n                                     RAE\n                         Hey? You okay, Ronnie?\n\n               Ronnie falls back, gripping his stomach, there are tears in \n               his eyes from the dry heaving. Suddenly emotion hits him.\n\n                                     RONNIE\n                              (through tears and \n                              clenched teeth)\n                         Box of cereal... well, Goddamn...\n                              (looks at his trembling \n                              fists)\n                         Everybody keeps sayin' things to me \n                         take make me feel great. But I don't \n                         feel great at all. I feel like I'm \n                         comin' outta my skin. Like I'm losin' \n                         control of my mind.\n                              (looks into Rae's \n                              eyes)\n                         I'm not like this. I'm not usually \n                         so... afraid.\n                              (really starts crying)\n                         I don't know what's... wrong...\n\n               Rae pulls Ronnie to her. He cries into her shoulder. She \n               gently rubs his wet face and sings her words of comfort.\n\n                                     RAE\n                         Is'okay... Is'okay...\n\n               Ronnie begins to calm down. The sobbing abates.\n\n               The metal music from the party outside is muffled through \n               the door. The two hold onto each other in silence.\n\n               Rae pees. They both giggle, a welcome release of tension.\n\n                                     RAE\n                         I feel better. Do you?\n\n                                     RONNIE\n                         Yeah, I do.\n\n               EXT. LAZARUS' BARN - NIGHT\n\n               Ronnie lifts his head from sleep - his memory of Rae has \n               vanished.\n\n               He is leaning against the corner of the barn, his .45 in his \n               grip. His gaze slowly turns toward Laz's darkened house.\n\n               His hand begins to shake.\n\n                                                             FADE TO BLACK.\n\n               EXT. LAZARUS' HOME - EARLY MORNING\n\n               A crow squawks in the rows of corn. A bright morning is \n               coming.\n\n               INT. LAZARUS' HOME - THE BEDROOM - EARLY MORNING\n\n               Laz is still asleep. The sound of clumsy guitar playing, \n               accompanied by a tiny voice, can be heard.\n\n                                     RAE\n                              (plucking, trying to \n                              find the right note)\n                         You... are my... sunshine.\n\n               Laz opens his eyes.\n\n               INT. LAZARUS' HOME - EARLY MORNING\n\n               Laz quietly creeps into the doorway to watch Rae struggle \n               with the guitar playing. He could stay there for hours \n               watching this little girl play his guitar.\n\n               Rae looks up and sees Laz. She stops playing.\n\n                                     RAE\n                         Sorry.\n\n                                     LAZARUS\n                         Looks like you know a song.\n\n                                     RAE\n                         Don't know where I learn't it, but... \n                         it's there in my head.\n\n               Laz sits next to her and takes the guitar from her.\n\n                                     LAZARUS\n                              (playing a tune)\n                         How you feelin' today?\n\n                                     RAE\n                         You know how you feel when you come \n                         out of a bad hangover? Like your \n                         eyes can open a little bit more.\n\n                                     LAZARUS\n                         I know that.\n\n                                     RAE\n                         Woke up real early. Sun was shining. \n                         Just thought I'd mess around, try to \n                         learn a song.\n\n                                     LAZARUS\n                         Go'on and sing it, I'll play.\n\n                                     RAE\n                         No, you do it. I can't sing.\n\n                                     LAZARUS\n                         Stop that foolishness. Just do as I \n                         say and close your eyes.\n                              (Rae closes her eyes)\n                         Close your eyes. And think about... \n                         well, for a song like this, I'd say \n                         you think about what you love.\n\n                                     RAE\n                         What I love.\n\n                                     LAZARUS\n                         Get a good picture in your mind.\n\n               Rae's playful smile turns serious. Laz continues playing.\n\n                                     LAZARUS\n                         Think on that. And sing wit me.\n                              (Laz comes in singing)\n                         You are my sunshine. My only sunshine.\n\n                                     RAE & LAZARUS\n                         You make me happy when skies are \n                         gray. \n                         You'll never know dear, how much I \n                         love you. \n                         Please don't take my sunshine away.\n\n               Rae opens her eyes with a delightful giggle. Laz continues \n               playing.\n\n                                     LAZARUS\n                         Good. I know another. It go like \n                         this.\n                              (sings)\n                         Last night dear, as I lay sleeping. \n                         I dreamed I held you in my arms. \n                         When I awoke dear, I was mistaken. \n                         So I hung my head and I cried.\n                              (to Rae)\n                         Close your eyes Rae... sing it.\n\n               Rae doesn't hesitate to obey. With her eyes closed and Laz \n               playing, neither can see Ronnie creeping up from the kitchen \n               with his gun.\n\n                                     RAE\n                              (singing)\n                         You are my sunshine. My only sunshine. \n                         You make me happy when skies are \n                         gray.\n\n               Ronnie looks sick with pain as he points the barrel at the \n               back of Laz's head.\n\n                                     RAE\n                              (singing)\n                         You'll never know dear, how much I \n                         love you. \n                         Please don't take your sunshine away.\n                              (opens her eyes)\n                         RONNIE!\n\n               Laz spins around knocking away Ronnie's arm. BAM! The gun \n               fires into the wall. The guitar cracks on the floor.\n\n               Rae screams.\n\n                                     RAE\n                         RONNIE STOP! RONNIE!\n\n               Laz lunges at Ronnie but Ronnie is faster. He spins Laz around \n               and slams him to the floor, pushing his gun into Laz's face.\n\n                                     RAE\n                         NO!\n\n               Ronnie looks up at Rae, his eyes red with sorrow and rage. \n               He pushes the gun to the side of Laz's head. Rae cries.\n\n                                     RONNIE\n                         Ain't been a week and you already \n                         some nigger's whore? Gill told me. \n                         Told me how you and he... you and \n                         everybody...\n\n                                     RAE\n                         Ronnie. Please, baby...\n\n                                     RONNIE\n                              (to Laz)\n                         Did 'ya have fun with her? Sweet as \n                         a peach, I bet. Huh? Huh?\n\n               Laz glares back, not saying a word.\n\n                                     RONNIE\n                         Goddamn it, I ask you a question, \n                         you better answer it, or I'm gonna \n                         blast a hole in ya!\n\n                                     RAE\n                         Ronnie...\n\n               Rae moves closer. Ronnie points his gun at her and screams.\n\n                                     RONNIE\n                         YOU SHUT UP!\n\n                                     LAZARUS\n                         Careful how you point that gun, boy.\n\n                                     RONNIE\n                              (points gun back at \n                              Laz)\n                         Or what? OR WHAT?\n\n                                     LAZARUS\n                         Boy? You here to make a point, or \n                         you here to kill somebody?\n\n                                     RONNIE\n                         Ain't gonna be callin' me boy when I \n                         blow your face off.\n\n                                     LAZARUS\n                         You sayin' you'll do what?\n\n                                     RONNIE\n                         You heard me, mother-fucker. I'll \n                         fuckin' kill..\n\n                                     LAZARUS\n                              (cutting him off)\n                         BOY! You so green you couldn't stomp \n                         a baby duck.\n\n               Ronnie can't believe what was just said -- mostly, because \n               it's true. The gun begins to shake in his hand.\n\n                                     RONNIE\n                         You testing me? Huh? You testin' me, \n                         old man?\n\n                                     LAZARUS\n                         Test. Shit. What kind'a test you \n                         thinkin'? You mean like, if you a \n                         man or not? If you a killer? Only \n                         one way to prove that. You just look \n                         me in the eye, boy, and you squeeze \n                         that trigger back.\n\n               Ronnie grips the shaking gun. A severe attack is on the rise \n               as he listens to Laz.\n\n                                     LAZARUS\n                         Ain't that easy, is it? I been in \n                         some scraps, son, I know. First \n                         there's that loud crack. Always louder \n                         than you think. Like it just come-up-\n                         a-cloud and clapped a mess thunder \n                         right in ya hand. BAM!\n\n               Ronnie flinches. He tries to control his breathing.\n\n                                     LAZARUS\n                         White light. Smell of smoke. Taste \n                         of my blood and brains in your mouth, \n                         stingin' ya eyes.\n\n               Ronnie almost vomits, but he holds it back.\n\n                                     RAE\n                         Oh, baby... just let me...\n\n               Rae moves closer to him, wanting to comfort him but she stops \n               as Ronnie points the gun at her. His eyes pleading for her \n               to stay back.\n\n                                     RONNIE\n                         GODDAMMIT, RAE!\n\n                                     LAZARUS\n                         BOY! YOU KEEP THAT GUN POINTED AT \n                         ME!\n                              (Ronnie obeys)\n                         You need to kill a man, all you gotta \n                         have is a good reason.\n                              (watches Ronnie fight \n                              his attack)\n                         You know she been here with me, don't \n                         cha? Been all over town, givin' up \n                         that switch you thought was your \n                         own.\n\n                                     RONNIE\n                         SHUT UP! SHUT UP!\n\n                                     LAZARUS\n                         Put all your love and dreams into \n                         one woman... she turn around and \n                         give it all to another man. That's a \n                         good reason to paint the wall with \n                         me, kid. She'd fear ya then. Cuz \n                         there won't be no more question in \n                         her mind. She with a real man now. A \n                         real KILLER!\n\n               A flood of tears are streaming down Ronnie's face. The gun \n               is shaking furiously in his hand.\n\n                                     RONNIE\n                         Don't... don't say that to me...\n\n                                     LAZARUS\n                              (getting fed up)\n                         Son, I'm grown. Don't got patience \n                         to suffer you children and this monkey \n                         junk. I'm too old to play house...\n                              (looks at Rae and \n                              then back at Ronnie)\n                         ...and cowboys. So let's have it. \n                         End me or get out of my face!\n\n               Ronnie looks like a scared five year old having an asthma \n               attack. Laz barks at him one last time.\n\n                                     LAZARUS\n                         Go'on. Do it.\n                              (silence)\n                         DO IT!\n\n               The last shout from Laz completely destroys Ronnie. His \n               shoulders slump. The gun lowers in his grasp. A low sob is \n               heard as he falls to his knees.\n\n               Laz snatches the gun from his hand and stands.\n\n                                     RAE\n                         Ronnie?\n\n               Rae inches closer to Ronnie as he kneels over and weeps. She \n               gently touches his shoulder. He turns his anguished face to \n               her and tries to speak.\n\n                                     RONNIE\n                         I can't stop... I can't stop... being \n                         scared. What am I gonna do...\n\n               Ronnie hides his face in his hands. Rae throws her arms around \n               him and holds him tight.\n\n                                     RAE\n                         I got you, baby... I got you...\n\n               Laz removes the clip and crosses to the kitchen. He slams \n               the gun on the sink, opens a drawer and removes the wall \n               phone.\n\n                                     RAE\n                              (seeing Laz plug the \n                              phone in)\n                         What are you doing?\n                              (Laz dials a number)\n                         You gonna call the cops? You think \n                         they gonna help this? They ever help \n                         you, Laz? Huh?\n                              (Laz listens on the \n                              phone)\n                         DAMMIT LAZ PUT THE PHONE DOWN?\n\n               Laz looks at Rae. There is hurt in his eyes.\n\n                                     LAZARUS\n                         Thought you knew me better, gal.\n                              (into the phone)\n                         I need you at my house... right now.\n\n                                                                    CUT TO:\n\n               INT. LAZARUS' HOME - NIGHT\n\n               R.L. crosses from the kitchen. He hands a glass of water to \n               Rae seated on the couch. He hands another to Ronnie seated \n               next to her. R.L. sits before them as Laz lingers in the \n               doorway.\n\n                                     R.L.\n                              (to Ronnie)\n                         I imagine there's a lot of good \n                         between you two. But I want you to \n                         tell me what's bad. Go'on. And don't \n                         hold back.\n\n               Ronnie is very uncomfortable. He looks at Rae seated next to \n               him and then back at R.L..\n\n                                     RONNIE\n                         I hate this town. You can't round \n                         the corner without bumping into \n                         someone who's got your number.\n                              (a brief look at Rae)\n                         We did a lot of dreamin', me and \n                         Rae. Makin' plans to get out. I'd do \n                         my tour and... we'd move outta here. \n                         Go to Chattanooga. And I'd work for \n                         my uncle.\n                              (looks down, tears \n                              come to Ronnie)\n                         But... when Rae gets like she does. \n                         And she does the things that she \n                         always done. Makes me feel like she \n                         loves this place more'n me.\n\n               Rae starts shaking her head, tears come to her eyes. R.L. \n               raises a hand to silence her.\n\n                                     R.L.\n                         Go on, Ronnie.\n\n                                     RONNIE\n                         All my life people called me shit \n                         like, sissy and... nervous and... I \n                         got few things in my life that make \n                         me feel like... like...\n\n                                     LAZARUS\n                         Like a man.\n\n                                     RONNIE\n                              (surprised)\n                         Yes. I mean that's it. I wanna feel \n                         like a man with her. I wanna feel \n                         like the only man with her.\n\n               Ronnie wipes the tears from his eyes with his shirt sleeve. \n               R.L. turns to Rae.\n\n                                     R.L.\n                              (looks at Rae)\n                         Now, Rae, we're not here to fix you \n                         or judge you. Only you and the \n                         Almighty can do that. But I want you \n                         to tell me about these spells you \n                         get.\n\n               Rae takes a deep breath. She looks up at Laz. He encourages \n               her with a nod.\n\n                                     RAE\n                         It starts like this... fire... that \n                         spreads. Starts in my head. Then \n                         moves to my stomach. Then it goes \n                         lower. I can stop it sometimes but \n                         mostly I just jump on and ride it \n                         out... then everything'll go back to \n                         normal, you know. Only thing ever \n                         took that feeling away was... was... \n                         when I met Ronnie.\n                              (the emotion really \n                              hits hard)\n                         Cuz I love him so much. He's all I \n                         got in my life that's special. And I \n                         like taking care of him and helping \n                         him when he gets nervous. When I can \n                         do that for him... it's like I'm \n                         givin' somethin' of myself that I \n                         haven't givin' nobody else.\n\n                                     R.L.\n                         Rae, look at Ronnie. And tell him \n                         how you feel.\n\n               Rae turns to Ronnie. Her nose is running as she wipes away \n               her tears.\n\n                                     RAE\n                         I think... I think we're fucked up. \n                         Both of us. I know I am. But... that \n                         don't mean what I feel ain't true. \n                         It don't mean I can't love. And I \n                         know, how I been is... is... REALLY \n                         BAD! So if you want to quit on me... \n                         I understand. But please... please... \n                         don't.\n\n               Ronnie is very moved by Rae's plea. He touches her face and \n               wipes away a tear.\n\n                                     R.L.\n                         So. What'chu two gonna do about this?\n\n                                                                    CUT TO:\n\n               EXT. ANGELA'S HOME - DAY\n\n               The door opens. Angela looks surprised to see Laz. She is \n               dressed in jeans, a T-shirt, wearing rubber gloves from \n               cleaning.\n\n                                     ANGELA\n                         Hey.\n\n                                     LAZARUS\n                         Hey. You wasn't at'cha work but that \n                         nosey gal up at the counter give me \n                         your home address. Hope you don't \n                         mind me comin' over.\n\n                                     ANGELA\n                         What do you need?\n\n                                     LAZARUS\n                         I need ya help again.\n\n               Angela notices Rae and Ronnie seated in Laz's truck.\n\n                                     ANGELA\n                         More cough syrup?\n\n                                     LAZARUS\n                         Can I come in?\n\n               Angela takes a breath and opens the door wider.\n\n               INT. ANGELA'S HOME - DAY\n\n               It is a small house, but tidy. Angela motions for Laz to \n               sit.\n\n                                     LAZARUS\n                         I lied to you. It was wrong. But at \n                         the time... I didn't know what to \n                         do. Imagine you got an earful from \n                         folks about that gal I's carryin'...\n\n                                     ANGELA\n                         Laz... you don't need to explain \n                         yourself to me...\n\n                                     LAZARUS\n                         Yes, I do. Cuz I feel for you. Mean \n                         to say...\n                              (long pause)\n                         I got feelings for you. And I didn't \n                         want you to think... I didn't...\n                              (how to say?)\n                         I don't want you to go away. There's \n                         better ways to say what I'm trying \n                         to say, but... they it is. Don't go \n                         away.\n\n               Angela thinks on this. She rises out of her seat and crosses \n               to Laz, sitting next to him on the love seat.\n\n                                     ANGELA\n                         Laz. I'm gonna put my trust in you. \n                         I'm gonna do it knowin' all too well \n                         I can get hurt like this. And I have \n                         been hurt. Just like you.\n                              (beat)\n                         Woman like me, I got a lot of livin' \n                         to do. But my days are precious to \n                         me. They all I got left. Don't want \n                         no more fuss. I want love in my life. \n                         You understanding me, Laz?\n\n                                     LAZARUS\n                         I do. God's truth. I do.\n\n               They stay locked in each others' sight.\n\n               Then, the slowest, most gentle kiss happens between them. \n               When they separate, Laz is lost in her eyes.\n\n                                     ANGELA\n                         Now what'chu need me to do? Cuz I'm \n                         gonna go do it.\n\n                                                                    CUT TO:\n\n               INT. POOL HALL - MORNING\n\n               Laz enters the pool hall and spots Tehronne. Tehronne motions \n               him back. Next to Tehronne is an old black man named PINETOP.\n\n                                     TEHRONNE\n                         Yo, this here Pinetop. I think he \n                         got what you lookin' for.\n\n               Pinetop grins and produces a black velvet cloth. He opens it \n               gently and spreads it out, revealing a long, thin, gold chain.\n\n               Laz nods, approvingly.\n\n                                     LAZARUS\n                         That'll do.\n\n               EXT. POOL HALL - BACK DOOR - MORNING\n\n               Tehronne leads Laz down the back steps.\n\n               They both round the corner, revealing an old Chevy Caprice. \n               It is light brown except for one door that is gray, however \n               the chrome rims on the car are impressive -- worth more that \n               the entire car by a long shot.\n\n                                     TEHRONNE\n                         It got some miles on it, but my boys \n                         say she run good. Got fresh 22's on \n                         her. Ain't my doin'. That's just how \n                         it came to me. Don't worry. Nobody \n                         gonna come lookin' for it. I got the \n                         pinks... got no problem.\n                              (hands Laz the keys)\n                         Ain't gonna have my girl ridin' no \n                         bus.\n\n                                     LAZARUS\n                              (moved, impressed)\n                         Don't see generosity much these days. \n                         Everything always got a catch. Guess \n                         I'm tryin' to say... thank you.\n\n                                     TEHRONNE\n                         Nobody ever asks me to do shit like \n                         this for people. And you know what? \n                         I'm good at it. Naw what I mean?\n\n               Tehronne walks back into the pool hall, leaving Laz alone.\n\n                                                                    CUT TO:\n\n               INT. ELLA MAE'S WOMEN'S CLOTHING - DAY\n\n               Rhonda has three white dresses over her arm as she hurries \n               past Ronnie, seated next to the back dressing rooms.\n\n               The door doesn't close all the way. He stands and moves in \n               for a peek. Angela pokes her head out and grins.\n\n                                     ANGELA\n                         What are you doing?\n\n                                     RONNIE\n                              (shrugs)\n                         Just wanted to see.\n\n                                     ANGELA\n                         You know the rules.\n                              (vacant look from \n                              Ronnie)\n                         You do know the rules, don't you?\n\n                                     RONNIE\n                         Yeah, I know.\n\n                                     ANGELA\n                         Then start taking them seriously.\n\n                                     RONNIE\n                         Yes, ma'am.\n\n               INT. ELLA MAE'S WOMEN'S CLOTHING - DRESSING ROOM - DAY\n\n               Rae is standing in bra and panties up on a small platform in \n               front of a tri-divided mirror. Ella Mae takes the dresses \n               from Rhonda.\n\n               Angela sees that Rae is nervous.\n\n                                     ANGELA\n                         It's okay to breathe, honey.\n\n                                     RAE\n                         Yes, ma'am.\n\n                                                                    CUT TO:\n\n               EXT. RONNIE'S TRAILER - LATE DAY\n\n               Ronnie is wearing a brown corduroy jacket. He is attempting \n               to tie his neck tie in the side mirror of Laz's truck.\n\n               Lincoln, also wearing his Sunday best, steps up behind him.\n\n                                     LINCOLN\n                         You Ronnie?\n\n                                     RONNIE\n                         Yeah.\n\n                                     LINCOLN\n                         I'm Lincoln. Guess I'm gonna be your \n                         best man.\n\n                                     RONNIE\n                              (ultimately accepting)\n                         Okay.\n\n                                     LINCOLN\n                         You havin' trouble with that tie? \n                         Cuz I'm pretty good at it.\n\n               Ronnie nods. Lincoln steps behind him to tie the tie.\n\n                                     LINCOLN\n                         Gotta do it like this or I get all \n                         turned around.\n\n               INT. RONNIE'S TRAILER - LATE DAY\n\n               Laz is wearing the same suit he wore at the cafe with Rose. \n               He is seated in Ronnie's trailer, outside the back bedroom \n               door.\n\n               Angela steps out from the bedroom with a grin.\n\n                                     ANGELA\n                         She's ready for you.\n\n               INT. RONNIE'S TRAILER - BACK BEDROOM - LATE DAY\n\n               Laz opens the door, carefully looking around the doorjam. He \n               sees her standing before the dresser mirror. She looks \n               beautiful, simple, and elegant.\n\n               Rae desperately searches Laz's eyes for approval.\n\n                                     LAZARUS\n                         Now that's sharp. That's real sharp. \n                         Miss Ella Mae set you up, didn't \n                         she? You like it?\n\n                                     RAE\n                         I've had nice things before but I \n                         always ruined 'em somehow.\n\n                                     LAZARUS\n                         Well, this one's yours now. You ready \n                         to take care of it?\n\n               Rae bows her head. She fights back tears.\n\n                                     RAE\n                         I want to. More'n anything. But I...\n\n               Laz holds her face in his hands. He speaks softly.\n\n                                     LAZARUS\n                         Now... let's stop that.\n                              (smiles)\n                         You and me... we can handle this. \n                         You hear me, gal? We gonna be just \n                         fine. Now live ya life. Pull your \n                         shit together and live your life.\n\n               His words are piercing and true. Rae nods, decides.\n\n                                     RAE\n                         Okay.\n\n               R.L.'s words are heard as Rae wraps her arms around Laz and \n               rests her head on his chest.\n\n                                     RAE\n                         I don't want you to let go.\n\n                                     LAZARUS\n                         Maybe I won't.\n\n                                     R.L. (V.O.)\n                         When I was a child, I talked like a \n                         child. I thought like a child, I \n                         reasoned like a child.\n\n                                                                    CUT TO:\n\n               EXT. RONNIE'S TRAILER - LATE DAY\n\n               Ronnie turns toward the trailer. He is in his suit, standing \n               in his front yard -- Lincoln at his side. R.L. stands to the \n               side with a Bible in his hands.\n\n                                     R.L. (V.O.)\n                         When I became a man, I put childish \n                         ways behind me.\n\n               Ronnie is amazed with what he sees. Laz leads beautiful Rae \n               down the steps as Angela tends to her side.\n\n                                     R.L. (V.O.)\n                         Now we see but a poor reflection as \n                         in the mirror; then we shall see \n                         face to face. I know in part; then I \n                         shall know fully, even as I am fully \n                         known.\n\n               Rae holds firm to Laz's arm as they come together on the \n               green grass to witness and perform this union.\n\n                                     R.L. (V.O.)\n                         And now these three remain: faith, \n                         hope and love. But the greatest of \n                         these is love.\n                              (Looks to Laz)\n                         Who gives this girl in marriage?\n\n                                     LAZARUS\n                         I do.\n\n               Lazarus takes a few steps with Rae, offering her arm to \n               Ronnie. Ronnie and Laz stay locked in each other's gaze.\n\n                                     LAZARUS\n                         You got her now?\n\n               Laz stands next to Angela as Ronnie and Rae face R.L. \n               together.\n\n                                     R.L.\n                         Ronnie. Rae. I want you to look at \n                         each other and listen to me carefully. \n                         Do you understand?\n\n                                     RAE & RONNIE\n                         Yes. Yes, sir.\n\n               They both obey -- each with a serious expression.\n\n                                     R.L.\n                         I require and charge you both as you \n                         stand in the presence of God to \n                         remember that love and loyalty alone \n                         will avail as a foundation of a happy \n                         and enduring home.\n                              (to Lincoln)\n                         Go on, hand it to him.\n\n               Lincoln steps toward Ronnie and holds up the black velvet. \n               Ronnie takes the gold chain and carefully wraps it around \n               Rae's waist.\n\n                                     R.L.\n                         No human ties are more tender. No \n                         vows more sacred than those you now \n                         assume.\n\n               Laz looks on -- a conflicted emotion of joy and loss.\n\n                                     R.L.\n                         If these solemn vows be kept \n                         inviolate, the home which you are \n                         establishing will abide in peace and \n                         your life will be filled with joy.\n\n               Angela reaches over and takes Laz's hand in hers.\n\n                                                                    CUT TO:\n\n               EXT. FREEWAY / INT. RONNIE & RAE'S NEW CAR - DAY\n\n               Ronnie is at the wheel of the Chevy Caprice. Rae sits silently \n               next to him.\n\n               Rae looks out the window as a huge 18 wheeler rolls up on \n               her side. She tries to ignore it and the tension it brings.\n\n               She turns to see that Ronnie is sweating. Another truck is \n               on his side sandwiching them in. An attack is coming over \n               Ronnie.\n\n               His breath is short. His chest tightens. Rae reaches over \n               and gently strokes the back of his neck.\n\n                                     RONNIE\n                         I gotta pull over.\n\n               He breaks. The two trucks zoom ahead as Ronnie breaks to the \n               side. Dust flies as the Chevy skids to a stop on the side of \n               the road.\n\n               Trucks zip by shaking the car, as Ronnie tries to get control \n               of his breathing.\n\n               Rae tries to stay calm, stroking the back of his neck as he \n               struggles for breath. He puts his forehead against the wheel \n               to stave off the building nausea.\n\n                                     RONNIE\n                              (through clenched \n                              teeth)\n                         FUCK!\n\n               Fear comes to Rae's face as she notices her middle finger \n               scratching at the back of Ronnie's neck. She pulls it away \n               and shoves her hand between her thighs.\n\n               Her eyes close as the burning builds. She grips the gold \n               chain around her waist.\n\n                                                                   FLASH TO\n\n               QUICK CUTS\n\n               The chain, tight around Rae as she struggles. Rae panting \n               and sweating on Laz's floor. She reaches out. Her hand lands \n               on the strings of his guitar. A single string is plucked.\n\n                                                             FLASH BACK TO:\n\n               EXT. FREEWAY/ INT. RONNIE & RAE'S NEW CAR - DAY\n\n               Rae opens her eyes -- the low note still sounding in her \n               head. She places her hand back on his neck. And then, soft \n               as a prayer:\n\n                                     RAE\n                              (singing)\n                         You are my sunshine. My only sunshine. \n                         You make me happy, when times are \n                         gray.\n\n               Ronnie slowly turns and looks at Rae, his head still resting \n               on the steering wheel. The panting has slowed. Color starts \n               returning to his cheeks.\n\n                                     RAE\n                              (singing)\n                         You'll never know dear, how much I \n                         love you. \n                         Please don't take, my sunshine away.\n\n               The anxiety is gone. Ronnie takes a breath and looks at Rae, \n               humbled and thankful of her power to soothe him.\n\n                                     RAE\n                         See. We're okay.\n\n               Rae is smiling.\n\n                                                              CUT TO BLACK:\n\n\n\n                                         THE END\n\n\n\n\n\nBlack Snake Moan\nWriters :   Craig Brewer\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:20:58.376375"}