{"title": "Blade: Trinity", "film_link": "/Movie Scripts/Blade: Trinity Script.html", "script_link": "/scripts/Blade-Trinity.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Blade: Trinity Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Blade: Trinity Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/7-stars.gif\"/> (6.77 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David S. Goyer\" title=\"Scripts by David S. Goyer\">David S. Goyer</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Movie Release Date</b> : December 2004<br/>\n<br/>\n<a href=\"/scripts/Blade-Trinity.html\">Read \"Blade: Trinity\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>                              \n<b>                                BLADE : TRINITY\n</b>\n\n        Over darkness a WOMAN'S VOICE speaks to us.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     Italo Calvino once said that myth is the\n                     hidden part of every story, the buried\n                     part, the region that is still unexplored\n                     because there are as yet no words to\n                     enable us to get there.\n                          (beat)\n                     But I was there for the end.  I took part\n                     in it.  And I think my words can help shed\n                     light on what happened.  My name is\n                     Abigail.  This is our story.\n\n\n<b>            FADE IN:\n</b>\n\n<b>            EXT. IRAQI DESERT - DAWN\n</b>\n\n            Harsh sunlight beats down over a bleak, unforgiving stretch of\n            rocky desert.  Amidst this desolation rise the ruins of an\n            ancient Sumerian ziggurat, a massive stepped pyramid of mud\n            brick that was once the center of the city known as Ur.\n\n\n<b>            SUPER TITLE:\tSOUTHEASTERN IRAQ, DHI QAR PROVINCE\n</b>\n\n<b>                                    SIX MONTHS AGO\n</b>\n\n<b>            AN EMACIATED SHEEP HERDER\n</b>\n\n            kneels by the ziggurat, tending to a ragged band of sheep.  He\n            is conducting the first of his daily prayers, listening to a\n            religious broadcast from Baghdad on a tinny RADIO.\n\n\n            Presently, we hear HELICOPTERS.  The sheepherder looks up --\n\n\n<b>            TWO ANERICAN RAH-66 COMANCHE HELICOPTERS\n</b>\n\n            approach from the East.  They touch down near the base of the\n            ziggurat, rotors stirring up clouds of dust.\n\n\n<b>            FOUR FIGURES\n</b>\n\n            disembark, their bodies covered in desert camo-gear.  They\n            wear helmets with polarized face-plates and are armed to the\n            teeth.  To the sheepherder they might as well be aliens.\n\n\n            One of the figures turns to the East.  We can see the rising\n            sun reflected in the face-plate of his helmet -- and a hint of\n            a skull-like under-mask/respirator beneath the face-plate. He\n            raises a gloved hand, gives the \"finger\" to the new day.\n\n\n            Another figure (a woman) waves a hand, urging them onward.\n            They mount the central steps of the ziggurat.\n\n\n<b>            INT. ZIGGURAT - SHRINE - DAY\n</b>\n\n            The shrine is empty.  The woman activates a wearable computing\n            device, calling up a schematic of the ziggurat.\n\n\n            She kneels, studying the floor.  In the corner of the room she\n            identifies a particular brick and presses it.  We hear hidden\n            COUNTER-WEIGHTS shifting and the floor opens up --\n\n\n            -- revealing a stone stairway leading down.\n\n\n<b>            INT. ZIGGURAT - STAIRWAY - DAY\n</b>\n\n            Dark.  Sepulchral.  Spooky.  The figures descend into --\n\n\n<b>            INT. ZIGGURAT - BURIAL VAULT - DAY\n</b>\n\n            -- an empty room with an earthen floor.  The sunlight from\n            above barely penetrates down here.  One of the figures takes\n            out a battery--powered lantern, turning it on, illuminating --\n\n\n            -- walls covered with CUNEIFORM WRITING.  The male figure who\n            flipped off the sun speaks via radio headset.\n\n\n<b>                                MALE FIGURE\n</b>                     That's great. We've got dick.\n                          (turning to the others)\n                     Is there any reason we had to embark on\n                     this cluster-fuck during the day?\n\n\n            The woman removes her helmet.  This is DANICA TALOS.  A\n            vampire.  Intense, appearing to be in her 30s.  Possessing a\n            regal air.  She wears a silver crucifix around her neck.\n\n\n<b>                                DANICA\n</b>                     Night-time's too tricky, Grimwood. You\n                     know that.\n\n\n            One by one, the others remove their helmets.  All vampires:\n\n\n            GRIMWOOD (30s), a hulking vampire with an imposing physique\n            and an even more imposing set of surgical steel teeth/fangs.\n\n\n            ASHER (4Os), a natural-born leader with easygoing charisma.\n\n\n            WOLFE (30s), quiet and deliberative.  Right now he's readying\n            a portable ground-penetrating radar unit.\n\n\n            Grimwood studies the writing on the walls.\n\n\n<b>                                GRIMWOOD\n</b>                     What is this chicken-scratch?\n\n\n<b>                                DANICA\n</b>                     Cuneiform. Dates back about four\n                     thousand years.\n\n\n<b>                                GRIMWOOD\n</b>                     So why here?\n\n\n<b>                                DANICA\n</b>                     Because this was the cradle of\n                     civilization.  He would've been\n                     comfortable here.\n\n\n<b>                                ASHER\n</b>                     I don't know, Dan.  Seems like another\n                     dead-end.\n\n\n<b>                                WOLFE\n</b>                     I'm not so sure --\n\n\n            Wolfe looks at his unit, excited.  The others gather round.\n\n\n<b>                                WOLFE\n</b>                     There's something beneath us.\n\n\n<b>            ON WOLFE'S RADAR UNIT\n</b>\n\n            We see a cross-section image of the soil and subsurface\n            features beneath them.  SOMETHING has been buried down there.\n\n\n<b>                                ASHER\n</b>                     Is that a body --?\n\n\n            Wolfe makes a few adjustments on the unit.  The image resolves\n            further.  It's definitely a BODY.  Then, we hear the low\n            RUMBLING of more hidden counter-weights and --\n\n\n<b>            A SLAB OF STONE\n</b>\n\n            slides down from above the stairs, sealing off the vault.\n\n\n<b>                                GRIMWOOD\n</b>                     What the fuck --?!\n\n\n            Grimwood pounds his fist against the stone.  It's solid.  He\n            tries to find a hand-hold, tries to shoulder it open in some\n            way, but the barrier is unmovable.  They're trapped.\n\n\n<b>                                ASHER\n</b>                     Radio back-up.  See if they can open it\n                     from the other --\n\n\n<b>                                WOLFE (0.S.)\n</b>                     Guys?\n\n\n            Wolfe points at the ground.  A tiny depression has formed,\n            with sand funneling into it.\n\n\n            Wolfe sets his radar unit down and kneels before the hole. \n            The grains of sand are falling faster now, the depression\n            gradually widening.  Curious, Wolfe leans closer --\n\n\n<b>            A CLAWED, ARMORED HAND\n</b>\n\n            suddenly EXPLODES upward from the ground.  It latches onto\n            Wolfe's neck.  dragging him down head-first!\n\n\n            Wolfe THRASHES, his head still buried beneath the sand.  He\n            knocks over the lantern, which FLICKERS, shorting out.\n\n\n            Asher rushes to Wolfe's side.  Then Grimwood.  They grab Wolfe\n            by the shoulders, SCREAMING, trying to pull him back.\n\n\n            Asher is KICKED by Wolfe's thrashing legs.  He flies upward,\n            hits the ceiling, falls back onto the ground, stunned --\n\n\n            Danica joins Grimwood.  Abruptly, they wrest Wolfe free --\n            headless.  BLOOD erupts from the sand.  Then --\n\n\n<b>            A HELLISH CREATURE\n</b>\n\n            unearths itself, ROARING.  It's difficult to make out in the\n            flickering light.  But what we do see is terrifying.  Spiked,\n            demonic armor, clutching a sword.  An elongated, helmeted face\n            with a blood-splattered set of hinged fangs -- hinting at an\n            inhuman physiognomy within.  The hinged jaws open, coming at\n            us.  And just as the lantern goes out for good we --\n\n\n<b>            SUPER TITLE:\tBLADE III\n</b>\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. PHOENIX TOWERS - CORRIDOR - NIGHT\n</b>\n\n            Danica moves down a modern architectural corridor lined in\n            glass and steel.  VAMPIRE SOLDIERS stand ready nearby,\n            outfitted in body armor, clutching automatic rifles.\n\n\n<b>            AT THE END OF THE CORRIDOR\n</b>\n\n            Asher, Grirnwood, and another vampire, HENDRIX are gathered by\n            a titanium door outfitted with a biometric security system.\n\n\n            Danica joins them, studying a VIDEO MONITOR which offers a\n            darkened view of the interior of the vault.  We can just make\n            out a FIGURE sitting there in the shadows.\n\n\n<b>                                DANICA\n</b>                     What's he been doing?\n\n\n<b>                                ASHER\n</b>                     Nothing.  Just sitting there since we\n                     brought him here.\n\n\n<b>                                HENDRIX\n</b>                          (nervously)\n                     Do you think we've got enough security?\n\n\n<b>                                DANICA\n</b>                     Hendrix, if he wanted to out of there -\n                     there isn't an army in the world that\n                     could keep us safe.  We didn't capture\n                     him.  He allowed us to take him in.  You\n                     understand?\n                          (nodding to the door)\n                     Now open up.\n\n\n            The others look at her like she's insane.  Nevertheless,\n            Danica places her hand on the biometric scanner.  Hendrix keys\n            in a series of commands on a nearby computer console.  The\n            vault doors open with a HUM, allowing Danica into --\n\n\n<b>            AN AIRLOCK-STYLE VESTIBULE\n</b>\n\n            She steps inside.  The vault closes behind her.  We hear\n            BLOWERS as the air is cycled.  A SECOND SET OF DOORS open --\n\n\n<b>            INT. VAMPIRE SAFE HOUSE - CELL - NIGHT\n</b>\n\n            Danica steps into a nearly pitch-black \"clean room\".  We hear\n            BREATHING.  Despite her calm demeanor, she's frightened.\n\n\n            From the darkness, SOMEONE SPEAKS -- a voice low and rumbling,\n            laced with an ominous gravity.\n\n\n<b>                                VOICE (O.S.)\n</b>                     Why have you woken me?\n\n\n<b>                                DANICA\n</b>                     Your people need you, Sire.\n\n\n            She kneels, bowing her head.\n\n\n<b>                                VOICE (0.S.)\n</b>                          (mocking)\n                     \"My people\".  You think I'm your messiah?\n                     Your Savior?\n\n\n            We hear MOVEMENT.  A pair of RED EYES pierce the gloom -- and\n            God help us, even though he remains partially shadowed, this\n            guy has to be the scariest mother-fucker we've ever seen.\n\n\n<b>                                VOICE\n</b>                     What makes you think I wanted to be\n                     brought back?\n\n\n            A hand emerges from the darkness, armored.  Danica wants to\n            bolt.  Instead, she fights to keep herself from flinching as a\n            taloned finger brushes her throat.\n\n\n<b>                                DANICA\n</b>                     Times have changed.  Science has made\n                     great strides.  Your blood, the sacrament\n                     you provide -- it can set us free now.\n\n\n<b>                                VOICE\n</b>                     I see.  And the one I killed earlier?  He\n                     was vampire?\n                          (off her nod)\n                     You must forgive me.  It had been\n                     centuries since I last fed.\n\n\n<b>                                DANICA\n</b>                     I understand.\n\n\n<b>                                VOICE\n</b>                     Then offer yourself to me, child --\n                          (lifting her chin)\n                     -- and let me quench my thirst again.\n\n\n<b>            INT. VAMPIRE SAFE HOUSE - CORRIDOR - NIGHT\n</b>\n\n            WHOOSH!  The vault doors open and Danica stumbles out, all but\n            falling into Asher's arms.  She's bone-white and there are\n            fresh BITE MARKS on her throat, BLOOD staining her shirt.\n\n\n<b>                                ASKER\n</b>                     Danica!  Are you alright --?!\n\n\n            She nods, shaking, struggling to recompose herself.\n\n\n<b>                                DANICA\n</b>                     Let him out -- he wants to see what's\n                     become of his world.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            A VIDEO MONITOR\n</b>\n\n            LARRY KING launching into the intro of his show.\n\n\n<b>                                LARRY\n</b>                     Tonight, Dr. Edgar Vance, forensic\n                     psychiatrist and author of the New York\n                     Times best seller \"Human Health: The Whole\n                     Being Breakthrough\".  Also with us is\n                     Martin Vreede, Chief of Police.  They're\n                     here for an hour and they'll take your\n                     calls.  Next on Larry King Live.\n\n\n<b>            INT. LARRY KING LIVE - STUDIO - NIGHT\n</b>\n\n            Taping is underway.  Larry King sits at his desk opposite\n            EDGAR VANCE (40s), a smooth-talking pundit with a magnetic\n            demeanor and movie star good looks.  CHIEF MARTIN VREEDE (50s,\n            square-jawed), joins via remote feed.\n\n\n<b>                                LARRY\n</b>                     Dr. Vance -- you're a psychiatrist and a\n                     biochemist, isn't that right?\n\n\n<b>                                VANCE\n</b>                     Yes.  I've long believed that in order to\n                     achieve true health, we have to reconcile\n                     the body and the mind.  Of course that\n                     also requires letting go of a lot of our\n                     old notions and superstitions, which is\n                     what my work is all about.\n\n\n<b>                                LARRY\n</b>                     Let's talk about that.  How do you account\n                     for the fascination with things that go\n                     bump in the night?  Movies, books,\n                     videogames -- seems like we can't get\n                     enough of our boogeymen?\n\n\n            Vance leans forward, skillfully playing to the cameras.\n\n\n<b>                                VANCE\n</b>                     Monsters provide a means for us to\n                     transfer our more primal and darker urges\n                     into something external.  In the case of\n                     vampires, you're dealing with taboo issues\n                     like predatory rage and sexual sadism. \n                     These are scary subjects for people to own\n                     up to.\n\n\n<b>                                LARRY\n</b>                     So we pass the buck to someone else?\n\n\n<b>                                VANCE\n</b>                     Exactly.  Historically, people suffering\n                     from medical conditions have always been\n                     our psychological scapegoats.  In the\n                     Middle Ages schizophrenia was often\n                     attributed to demonic possession.\n\n\n<b>                                LARRY\n</b>                     And vampires?\n\n\n<b>                                VANCE\n</b>                     Well, there's a hereditary blood disease\n                     known as porphyria that has symptoms\n                     remarkably similar to the classic vampiric\n                     traits.  People suffering from this\n                     disease are anemic, they become sensitive\n                     to sunlight, they can't tolerate garlic --\n\n\n<b>                                LARRY\n</b>                     Which is too bad, since my doctor tells me\n                     that's good for the heart.\n                          (turning to Chief Vreede)\n                     Chief Vreede?  What's your take on all the\n                     recent rumors we've been hearing about\n                     vampires?\n\n\n<b>                                VREEDE\n</b>                     The only vampires I'm worried about are\n                     the ones passing the bar exam.\n                          (laughing)\n                     Seriously, if vampires existed, don't you\n                     think we'd be on to them by now?  The\n                     truth is, our streets have never been\n                     safer.  Homicides, assaults -- violent\n                     crime is down across the board.  If people\n                     want to be concerned, they should focus on\n                     criminals like Blade.\n\n\n<b>                                LARRY\n</b>                     Now who's this?  Tell me about him.\n\n\n<b>                                VREEDE\n</b>                     He's a sociopath we've been pursuing.\n\n\n<b>                                VANCE\n</b>                     Blade is a very disturbed individual. \n                     Even the name he's chosen for himself is\n                     troubling.  According to witnesses, he\n                     operates under the belief that a vast\n                     conspiracy of vampires live amongst us. \n                     You have to look at the psychiatric\n                     underpinnings here.  What does a person\n                     like Blade really want? \n                     Odds are, he's really trying to work out\n                     some kind of inner trauma.  He thinks he's\n                     slaying monsters, but he's really trying\n                     to murder aspects of himself.\n\n\n            The sound of GUNFIRE pre-laps over from the next scene as we --\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. MACHINE SHOP/PARKING LOT - NIGHT\n</b>\n\n            -- a MASSIVE EXPLOSION ripping through an industrial building. \n            Banks of windows BLOW OUTWARDS, FIRE ROlLS, brick walls\n            CRUMBLE, raining debris everywhere.\n\n\n<b>            A SCREAMING, BURNING MAN\n</b>\n\n            goes tumbling into the night air.  Buoyed by the explosion,\n            his body flies upward, trailing fire like a human comet.\n\n\n            MORE MEN (VAMPIRES) race out, some of them on fire.\n\n\n<b>            CLOSER\n</b>\n\n            as a FORMIDABLE FIGURE resolves out of the swirling flames. \n            It's Blade, striding towards us in slow-motion, body bristling\n            with weapons, the exaggerated sounds of his FOOTFALLS ringing\n            out like drums of doom.\n\n\n            He looks like the God of War.  WHOOSH!  We ramp back up to\n            real-time.  Then faster as --\n\n\n            -- a TRIO OF VAMPIRE LOW-LIFES (STONE, GEDGE, and CAMPBELL)\n            run for their lives towards their vehicles.  TWO MODIFIED\n            STREET RACING CARS are pulling out; a Mustang and an Eagle\n            Talon.  Gedge is climbing into the Talon even as it starts to\n            move, pulling the door shut.  At the same time --\n\n\n            -- Stone and Campbell climb atop two stretched and lowered\n            hardtail chopper cycles.  Blade starts forward, drawing two of\n            his custom MACH pistols, but --\n\n\n            --\tthe Mustang comes SCREAMING IN REVERSE TOWARDS him!\n\n\n            Blade makes a SUPER-HUMAN LEAP over the speeding car. \n            Momentarily upside down, he FIRES through the windshield and\n            engine block as he flips.  Within the car, the vampires ASH.\n            The Mustang EXPLODES.  flipping over and --\n\n\n            --\tBlade, now facing frontward again, continues to FIRE as he\n            lands, aiming at --\n\n\n<b>            THE TALON AND THE CHOPPERS,\n</b>\n\n            which haul ass out of the parking lot, swerving into the\n            traffic on the street beyond.\n\n\n            Blade KEEPS FIRING until he's out of bullets.  Then --\n\n\n<b>                                ELLINGSON (O.S.)\n</b>                     No more bullets, Blade?  Guess it's time\n                     for you to fall down and go boom.\n\n\n<b>            FOUR STRANDED VAMPIRES,\n</b>\n\n            from the conflagration, their clothes still smoking, surround\n            Blade.  Call them EMOND, DOH, DENLINGER, and ELLINGSON.\n\n\n            Blade holsters his MACH pistols.  Then reaches for a wicked\n            looking CHAIN-KNIFE strapped to his thigh.  The knife has a\n            button on either side of the hilt.  As Ellingson RUSHES him --\n\n\n            -- Blade triggers the first button.  ZZZING!  The knife-blade\n            ejects from the hilt, trailing outward six feet on a razored\n            chain.  The blade penetrates Ellingson's chest.  He GASPS as\n            he starts to ASH.  But before his disintegration is complete --\n\n\n            -- Blade hits the second button.  The knife-blade retracts,\n            the razored chain WHIRRING back into the knife-hilt.  Blade\n            SPINS, triggers the first button again --\n\n\n            The knife-blade FLIES OUT, the razored chain whipping around\n            Denlinger's throat.  Blade tugs.  The razor chain cuts through\n            Denlinoer's neck, decapitates him. As he ASHES --\n\n\n            -- Blade triggers the knife again.  As it ejects, he whirls it\n            over his head, making a sound like a BULL-ROARER.\n\n\n            Blade drops low, swinging the razored chain.  The chain slices\n            through Emond's legs.  Emond's amputated legs ASH, the rest of\n            him tumbling onto the asphalt.  He SCREAMS.\n\n\n            Blade retracts the knife-blade, whirls, THRUSTS it through\n            Doh's abdomen. who was coming up from behind.  As Doh ASHES,\n            Blade returns to Emond, finishing him off --\n\n\n            -- and Blade is on the move again, RUSHING after the vampires\n            who escaped.\n\n\n<b>            EXT. STREET - OVERPASS - NIGHT\n</b>\n\n            The bike-riding vamps cut across traffic, then SCREAM down an\n            on-ramp to a busy street below.\n\n\n<b>            BACK TO BLADE,\n</b>\n\n            sprinting from the parking lot to the sidewalk.  He touches a\n            hand to his ear.  We SEE a tiny receiver tucked within.\n\n\n<b>                                BLADE\n</b>                     Whistler!  I'm on the Stonebridge\n                     overpass at Clemons --\n\n\n<b>                                WHISTLER'S VOICE\n</b>                     Got it!  Heading eastbound, I'm just\n                     beneath you --\n\n\n            Blade dodges past a HONKING car, stepping onto and over the\n            trunk, then leaps atop the safety rail of the overpass as --\n\n\n<b>            A BIG-RIG CAB\n</b>\n\n            hauling a semi-trailer THUNDERS beneath the overpass, sounding\n            its AIR HORN.  It has safety cables running along the\n            perimeter of the trailer roof, like an aircraft carrier.\n\n\n<b>                                WHISTLER'S VOICE\n</b><b>                     -- GO!!!\n</b>\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            Blade LAUNCHES HIMSELF into the air.  He lands atop the semi,\n            then tumbles, nearly slipping off the edge as he --\n\n\n            -- snags one of the safety cables atop the trailer!  He\n            dangles above the asphalt then SWINGS himself into the open\n            back of the trailer.  We HOLD for a beat, then hear the\n            THUNDERCLAP of a high-performance ENGINE turning over as --\n\n\n<b>            BLADE'S MATTE-BLACK DODGE CHARGER\n</b>\n\n            ROCKETS out of the back of the trailer, sailing right over a\n            car that was tail-gating the semi, heading into three lanes of\n            on-coming traffic at fifty miles an hour!\n\n\n            Blade hits the brakes, sending the battle-scarred muscle car\n            into a spin, clipping other vehicles in the process.\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            As cars continue to brake and COLLIDE around him, Blade puts\n            the pedal to the metal once again.  The Charger accelerates,\n            tachometer red-lining as Blade pulls alongside the cab of the\n            big-rig, catching a glimpse of --\n\n\n<b>            WHISTLER BEHIND THE WHEEL\n</b>\n\n            Whistler grins, gives Blade a little salute and --\n\n\n            --\tBlade reaches between the seats, ACTIVATING the newly\n            installed nitrous oxide fuel-injection system.\n\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            Hyper-speed.  The Charger jets forward as the NOS nitrous\n            system boosts the car's speed by another 300 HP, leaving any\n            and everything in its dust.  In seconds, it has caught up to --\n\n\n<b>            STONE AND CAMPBELL\n</b>\n\n            They draw TEC-9s, FIRING back at Blade.  The bullet-proof\n            windshield holds as do the kevlar body panels protecting the\n            engine -- but the rounds chew the shit out of the bodywork.\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            Blade gives his car another jolt of nitrous.  The Charger\n            SURGES FORWARD as Stone and Campbell fall back, veering to\n            either side.  Now Blade is ahead of them.  He checks their\n            position in his rear-view mirror, then stands on the brakes --\n\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            The Charger drops from a hundred to fifty in a heart beat,\n            causing Stone and Campbell to rear-end Blade.\n\n\n            The vamps are ejected over the handle bars of their bikes like\n            crash-test dummies.  Stone SMASHES through Blade's back\n            windshield, continuing into the front seat--\n\n\n            -- while Campbell tumbles over Blade's roof and across his\n            hood, somehow managing to cling to one of the windshield\n            wipers at the last minute.\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            Blade clutches the wheel.  He's got a HOWLING vampire in the\n            front seat, upside down, covered in windshield fragments and\n            another perched on his hood, obscuring his vision.\n\n\n            Stone tries to right himself, clawing at Blade.  Blade\n            struggles, keeping one hand on the wheel while he --\n\n\n            --\treaches for a shotgun secured between the seats.  He\n            FIRES.  As the vampire ASHES, Blade hits a button on the dash. \n            The passenger door opens, spills Stone onto the road --\n\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            -- right into the path of an oncoming bus!  WHAM!  Stone is\n            ground to paste and --\n\n\n<b>            INT. TOUR BUS - NIGHT\n</b>\n\n            TOURISTS, mostly elderly.  The passengers are jolted in their\n            seats as the wheels of the bus KA-THUMP over Stone's remains --\n\n\n<b>                                OLD WOMAN\n</b>                     I hope that wasn't a dog.\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            -- and we're back in Blade's Charger as Campbell continues to\n            HAMMER away at the windshield.  The windshield spiderwebs. \n            Campbell manages to get a clawed hand through --\n\n\n            Blade swings his shotgun over, shoving it in Campbell's\n            snarling mouth.  He pulls the trigger --\n\n\n            BOOM!  Campbell's CINDER-REMAINS blow over the cracked\n            windshield.  Blade hits the wipers, spritzes window cleaner -\n            but the mess turns to ashen sludge.  making the view worse!\n\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            The Talor is up ahead, weaving in and out of traffic. \n            Fighting to see, Blade accelerates, gaining ground --\n\n\n            The VAMPIRE DRIVER leans out of his own wihdow, looking back\n            at Blade, FIRING an AUTOMATIC PISTOL --\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            Blade's windshield, already weakened by Campbell, SHATTERS,\n            blowing glass fragments all over him.  Undaunted, Blade calmly\n            reaches for his dash, hitting a button labeled \"UV\".\n\n\n<b>            EXT. BUSY STREET/BLADE'S CHARGER - NIGHT\n</b>\n\n            Roof-mounted UV DAYLIGHTS come on, bathing the car ahead and\n\n\n            (more importantly) the vampire driver with UV LIGHT!\n\n\n            The vampire at the wheel SHRIEKS, ASHES, leaving the car\n\n\n            driverless.  Gedge tries to lean over and take the wheel --\n\n\n<b>            INT. BLADE'S CHARGER - NIGHT\n</b>\n\n            BURNING REMAINS blow back at us.  Then the view clears and --\n\n\n<b>            EXT. BUSY STREET - NIGHT\n</b>\n\n            --\tBlade SLAMS his charger into the Talon.  The cars briefly\n            lock, grinding SPARKS.  Then they disengage.  Blade jerks his\n            steering wheel, gives the Talon ANOTHER SLAM.\n\n\n            The Talon hits the curb, riding halfway up onto a sidewalk,\n            PLOWING DOWN newspaper vending machines and table-top displays\n            piled with cheap wares, then a phone booth, a food cart. \n            PEDESTRIANS duck for cover and --\n\n\n            -- the Talon gets some serious air, ROLLING onto its side as\n            it comes back to earth.\n\n\n<b>            EXT. INTERSECTION - NIGHT\n</b>\n\n            --WK-KRUNCH-- the wreck skids to a stop against a streetlight.\n            The streetlight CREAKS, CRASHES DOWN on the wreck.  BYSTANDERS\n            gather, murmuring amongst themselves --\n\n\n            Gedge drags his bleeding body from the wrecked Talon.  He\n            staggers to his feet, clutching a pistol, limps away --\n\n\n<b>            BLADE'S CHARGER\n</b>\n\n            pulls up.  Blade climbs out, shotgun in hand.  The shotgun has\n            an under-mounted stake launcher.  Blade FIRES at --\n\n\n            -- Gedge.  The stake hits him in the back.  KNOCKING him onto\n            the street.  Bystanders SCREAM, falling back, taking cover --\n\n\n            Blade approaches, puzzled.  Gedge is still alive, LAUGHING. \n            He looks at Blade, eyes crazed, flashing his fangs.\n\n\n<b>                                BLADE\n</b>                     Staked you with silver.  Why aren't you\n                     ash?\n\n\n            Gedge coughs blood, struggles to speak:\n\n\n<b>                                GEDGE\n</b>                     Why aren't you smarter?  Not a vampire,\n                     dumbshit -- set your sorry ass up --\n\n\n            Gedge tugs at his fangs.  They're fake, PROSTHETIC.  Gedge is\n            looking past Blade.  Blade turns, looking up --\n\n\n<b>            A ROOFTOP ABOVE\n</b>\n\n            Danica is perched there.  She backs into the shadows.  But\n            Blade doesn't have time to investigate because --\n\n\n            --\tPOLICE SIRENS are drawing near.  Blade retreats to his\n            charger.  He GUNS it, speeding away as we --\n\n\n<b>            CUT TO:\n</b>\n\n<b>            EXT. BLADE AND WHISTLER'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            Blade's Charger pulls up to a boat house at the water's edge. \n            Blade climbs out, disappears inside.\n\n\n<b>                                WHISTLER (O.S.)\n</b>                     What the fuck happened tonight?\n\n\n<b>            INT. BLADE AND WHISTLER'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            New digs.  Built into the decaying boat house, retrofitted for\n            Blade's combat needs.  Blade is taking off his body armor,\n            tossing weapons onto a work table.  He's frustrated.\n\n\n<b>                                BLADE\n</b>                     How should I know?  He was human.\n\n\n            Whistler reaches for a bottle of whiskey, takes a sip.\n\n\n<b>                                WHISTLER\n</b>                     You've been getting careless, Blade.  You\n                     kill a vampire, they ash, don't leave any\n                     proof of their existence.  But something\n                     like this, a human corpse, it's messy --\n                          (shaking his head)\n                     -- you better hope nobody IDed you.\n\n\n<b>            CUT TO:\n</b>\n\n<b>            INT. PHOENIX TOWERS - DANICA'S QUARTERS - NIGHT\n</b>\n\n            CLOSE ON a digital video tape being slipped into a player. \n            PULL BACK to reveal Danica sitting before a monitor.\n\n\n<b>            ON THE MONITOR WE SEE\n</b>\n\n            Footage of Blade confronting Gedge, filmed from a high-angle. \n            Danica smiles and we --\n\n\n<b>            CUT TO:\n</b>\n\n<b>            EXT. FBI REGIONAL HEADQUARTERS - DAY\n</b>\n\n            Establishing.\n\n\n<b>            SUPER TITLE: FBI REGIONAL HEADQUARTERS\n</b>\n\n<b>                                WOMAN'S VOICE\n</b>                     It was horrible.  The one car crashed, and\n                     then the guy in the coat was shooting the\n                     other guy --\n\n\n<b>            INT. FBI REGIONAL HEADQUARTERS - OFFICE - DAY\n</b>\n\n            CLOSE ON a TV screen.  We are watching a news feed.  A\n            REPORTER interviews a WOMAN at the intersection where Blade\n            executed Gedge.  Now the reporter turns to the camera.\n\n\n<b>                                REPORTER\n</b>                          (on-screen)\n                     That was just a taste of the mayhem that\n                     occurred during tonight's brazen shoot-out\n                     that left at least four people dead.  Now\n                     apparently an anonymous citizen captured\n                     the whole event on video --\n\n\n            The IMAGE FREEZES.  We hear the clatter of KEYBOARD KEYS as we\n            pan over to an adjacent computer monitor where a series of\n            VIDEO CAPTURES of the event flash by us in slide-show mode.\n\n\n            AGENT RAY CUMBLERLAND studies the screen.  Ray is a career\n            agent.  Dedicated and dogged to the point of annoyance,\n            utterly humorless.  His office is cramped and institutional,\n            devoid of any personal touches.  It's also overflowing with\n            files, photographs, and charts concerning Blade and Whistler.\n\n\n<b>            A BULLETIN BOARD\n</b>\n\n            features numerous surveillance photos of Blade and Whistler in\n            action, along with various news clippings and two WANTED\n<b>            POSTERS (\"UNLAWFUL FLIGHT TO AVOID PROSECUTION - MURDER,\n</b>            AGGRAVATED KIDNAPPING, ARMED VIOLENCE\").  Most of the photos\n            are blurry and indistinct -- akin to snaps taken of Bigfoot.\n\n\n<b>                                HALE (O.S.)\n</b>                     Ray!  Heard we've got a lead!\n\n\n            WILSON HALE (20s), Ray's subordinate, rushes in, excited.  Ray\n            stands, ripping down a photo of Blade and Whistler.\n\n\n<b>                                CUMBERLAND\n</b>                     Book us a flight, Hale.  Time to take\n                     these cowboys down.\n\n\n<b>            CUT TO:\n</b>\n<b>         \n</b><b>                                WHISTLER (0.S.)\n</b>                     Pack of Reds and some matches.\n\n\n<b>            CUT TO:\n</b>\n\n<b>            INT. CONVENIENCE STORE - DAY\n</b>\n\n            Whistler is buying a pack of cigarettes when he notices\t--\n\n\n<b>            A BLACK AND WHITE TABLOID\n</b>\n\n            on display nearby.  The cover story features a BLURRY PHOTO of\n            Blade's recent melee with the vampires.\n\n\n            Whistler picks up the tabloid, studying it.  Next to the photo\n            is an ARTIST'S SKETCH OF BLADE.  The headline reads: \"GUN\n<b>            TOTING PSYCHOPATH CAPTURED ON FILM!\"\n</b>\n\n            Whistler nods to the CASHIER, hands over some more cash.\n\n\n<b>                                WHISTLER\n</b>                     I'll take this too.\n\n\n<b>            EXT. CONVENIENCE STORE - DAY\n</b>\n\n            Whistler exits the store, perusing the tabloid as he walks. \n            We hear the WHIR of a camera's HIGH-SPEED MOTOR DRIVE and --\n\n\n<b>            A SERIES OF DIGITAL SHOTS\n</b>\n\n            capture Whistler as he moves down the sidewalk.\n\n\n<b>            ANGLE ON AN FBI AGENT\n</b>\n\n            perched on a nearby roof, taking surveillance photos.\n\n\n<b>                                FBI AGENT\n</b>                     Subject is heading West.\n\n\n            WHIP-PAN to a parked CAR, Cumberland and Hale seated within.\n\n\n<b>                                CUMBERLAND\n</b>                     Got him.\n\n\n            Cumberland starts the car, starts following Whistler.\n\n\n<b>                                WHISTLER (0.S.)\n</b>                     Congratulations.  You're famous.  Just\n                     what we needed.\n\n\n<b>            INT. BLADE'S REFUGE - BOAT HOUSE - DAY\n</b>\n\n            CLOSE ON the tabloid as Whistler slaps it down on a workbench. \n            WIDEN to include Whistler and Blade.\n\n\n<b>                                WHISTLER\n</b>                     Somebody screwed us.  Your face is all\n                     over the papers, the television.  Media's\n                     eating it up.\n\n\n<b>                                BLADE\n</b>                     Like I care?\n\n\n<b>                                WHISTLER\n</b>                     You should.  Something like this --\n                          (gesturing to the tabloid)\n                     -- taking out a human, even one working\n                     for the vampires -- far as the rest of the\n                     world's concerned, you're public enemy\n                     number one.\n\n\n<b>                                BLADE\n</b>                     Didn't realize this was a popularity\n                     contest.\n\n\n            Whistler shakes his head, frustrated.\n\n\n<b>                                WHISTLER\n</b>                     Damnit, Blade, don't you see what's\n                     happening?!  The fuckers are finally\n                     getting smart.  They're waging a goddamn\n                     PR campaign.  Now it's not just vampires\n                     we have to worry about, we're gonna have\n                     to take on the rest of the world too.\n                          (beat, adamant)\n                     They've got us on the run.  These last few\n                     months we've barely been staying ahead of\n                     the curve.\n\n\n<b>                                BLADE\n</b>                     You worry too much, old man.\n\n\n<b>                                WHISTLER\n</b>                     I've been doing this since before you were\n                     born, Blade.  The moment you stop\n                     worrying, you're dead.\n\n\n            Then Whistler's face softens for a moment.\n\n\n<b>                                WHISTLER\n</b>                     Since the day I found you, you've been\n                     like a son to me.  I taught you everything\n                     I know.\n                          (beat)\n                     But I'm tired.  You understand?\n\n<b>             EXT. INNER CITY STREET - NIGHT\n</b>\n\n            It's rush hour and the streets are choked with traffic. \n            PEOPLE mill past on the crowded sidewalk.\n\n\n            We move from face to face, capturing brief portraits of\n            working-class desperation -- an OVERWEIGHT GUY, a PAIR OF\n            HOMELESS TEENAGERS, an ASIAN VENDOR, a STREETWALKER.\n\n\n<b>                                VOICE (O.S)\n</b>                     How about that one?\n\n\n<b>                                SECOND VOICE (O.S.)\n</b>                     No fatties.  They taste like Cheetos.\n\n\n<b>                                THIRD VOICE (O.S.)\n</b>                     What about that shrunken apple-head\n                     beeyatch-a-saurus over there?\n\n\n<b>                                VOICE (O.S.)\n</b>                     Fucking blow me, man!\n\n\n            We hear LAUGHTER and we WHIP-PAN over to a grimy office\n            building, ZIPPING UP the face of it to --\n\n\n<b>            A ROOFTOP PARKING STRUCTURE\n</b>\n\n            A SKATE-PUNK (SQUID) gets some air, flipping his board up into\n            a nice Ollie backside grab, then scoots over to --\n\n\n            -- THREE MORE PUNKS perched on a concrete ledge, watching the\n            people below them.  They are: PROOF, FLICK and DINGO.  All in\n            their teens, sporting copious piercings and tattoos.  Flick\n            wears a ratty T-shirt from \"The Lost Boys\" movie.\n\n\n<b>                                DINGO\n</b>                     C'mon, just pick one.\n\n\n<b>                                PROOF\n</b>                     Once you buy a prize, it's yours and\n                     yours to keep.\n\n\n            They keep looking.  Then, Flick suddenly points, excited --\n\n\n<b>                                FLICK\n</b>                     Got it, got it!  Baby on board!\n\n\n<b>            ANGLE ON A MOUSY WOMAN (ABIGAIL)\n</b>\n\n            moving below, her figure camouflaged beneath layers of\n            clothing.  She's in her 20s, lugging a NEWBORN in a BabyBjorn\n            carrier that's strapped to her chest, clutching a bag of\n            groceries in either hand.  She looks a little haggard.\n\n\n            As we watch, she reaches an elevated rail station entrance.\n\n\n<b>            BACK TO THE SKATE-PUNKS\n</b>\n\n            Dingo nods and smiles approvingly.\n\n\n<b>                                DINGO\n</b>                     Looks like we got ourselves a combo meal.\n\n\n<b>            EXT. ELEVATED RAIL STATION - VARIOUS - NIGHT\n</b>\n\n            A series of shots as Abigail makes her way into the station,\n\n\n            passing a few other PEOPLE here and there.\n\n\n<b>            INT. ELEVATED RAIL PLATFORM - NIGHT\n</b>\n\n            A depressing, dimly lit, partially open-air station.  Abigail\n            moves out onto the platform, which is now deserted.  She\n            glances around, a bit nervous, and finally sits on a bench.\n\n\n            Beat.  Just the wind MOANING in the tunnels, across the\n            platform.  Then we hear a RUSTLING SOUND --\n\n\n            Abigail looks right, sees nothing.  We hear ANOTHER SOUND,\n            this time from the left --\n\n\n            Abigail looks up, briefly glimpsing a FIGURE ducking behind a\n            concrete pillar.\n\n\n            Unnerved, she stands, moving a protective hand over her baby. \n            She backs up a few steps, trying to look around the pillar --\n\n\n            -- but no one is there.  Then a SHADOW MOVES behind her.  She\n            SENSES it, spinning --\n\n\n            -- but again, she seems to be alone.  Thoroughly frightened\n            now, Abigail scoops up her grocery bags, turns to exit and --\n\n\n            -- slams right into Dingo and Proof!  She GASPS.\n\n\n<b>                                DINGO\n</b>                     Hey, pretty lady.\n\n\n<b>                                PROOF\n</b>                     Sophisticated mama.\n\n\n            Dingo and Proof reveal their fangs.  Abigail SCREAMS, runs --\n\n\n            -- right into the arms of Flick and Squid!  They grab her,\n            RIPPING the BabyBjorn carrier from her chest, SHOVING her back\n            at Dingo and Proof.\n\n\n            In seconds, Dingo and Proof have Abigail on the floor. \n            They're tearing away at her clothing, LAUGHING.\n\n\n<b>                                DINGO\n</b>                     Scream if this hurts, chica!\n\n\n<b>            ON FLICK,\n</b>\n\n            removing the BABY from its carrier.  He holds the baby up -\n            only it's not a baby.  It's a DOLL with the words \"FUCK YOU!\"\n            written on its chest.  Flick is briefly confused --\n\n\n            -- and then the baby doll EXPLODES, covering Flick's face with\n            a cloud of GARLIC GAS!\n\n\n            Flick recoils, retching, wiping at his burning face --\n\n\n<b>                                FLICK\n</b>                     --aghhk -- it's fucking garlic!\n\n\n<b>            ON DINGO AND PROOF,\n</b>\n\n            looking back, alarmed.  Then Abigail pulls her knee to her\n            chest.  A SILVER SPIKE springs out from the toe of her boot.\n\n\n            She KICKS UP, imbedding the spike up through the underside of\n            Proof's chin.  Proof ASHES.\n\n\n            Before Dingo has a chance to act, Abigail gets him in a\n            leglock, FLIPPING him back onto his ass.\n\n\n<b>            ABIGAIL\n</b>\n\n            jumps to her feet, shedding her coat and hat.  Long tresses of\n            hair spill around her shoulders.  She's not mousy at all.  In\n            fact, she's beautiful.  And cut like an Olympic athlete.  And\n            equipped with a walking arsenal of weapons.\n\n\n            Dingo SNARLS -- CRUNCH!  Abigail plants her heel in his face,\n            SMASHING IN his nose.  She does a cartwheel, KICKS him again.\n            Follows that with flurry of PUNCHES.  He goes down as --\n\n\n            -- Flick and Squid come charging!  Squid gets her in a CHOKE\n            HOLD.  She FLIPS him over her shoulder, KICKING him in the\n            nuts as he lands.  He curls up, GROANING --\n\n\n            Abigail turns back to Flick, ELBOWING him in the throat --\n\n\n            -- then returns to Squid, ejecting a SILVER THROWING KNIFE\n            from a spring-loaded, automated dispenser strapped to her\n            wrist.  She POPs the knife through Squid's chest.  He ASHES --\n\n\n<b>            FOLLOWING ABIGAIL\n</b>\n\n            as she reaches behind her, removing a CRESCENT-SHAPED DEVICE\n            secured to her back.  She holds the crescent in the center,\n            the curve pointing away from her, gives it a twist and --\n\n\n            CHINKT!  The device extends from either end, telescoping\n            outward into a three-foot long metal arc.  Connecting the two\n            ends of the arc is a powerful, BUZZING UV LASER.\n\n\n            Abigail LASHES OUT, lopping off Flick's arm.  His arm falls,\n            ASHING.  Abigail swings the arc around, pushing it forward\n            through Flick's mid-section like a cheese cutter --\n\n\n            Flick literally falls apart, his upper torso sliding from his\n            trunk, ASHING in the foreground, his burning particles falling\n            away to reveal Abigail in the background --\n\n\n            Dingo scrambles to his feet, running for his life.\n\n\n            Abigail gives her UV arc a twist.  It retracts.  She secures\n            it behind her back once again, unholsters a strange-looking\n            \"bloop\" GUN with a large barrel.  She FIRES --\n\n\n            A rapidly-expanding spherule of ANTI-PERSONNEL FOAM splatters\n            against Dingo's legs, hardening instantly, tripping him up --\n\n\n            Dingo goes down again.  He panics, trying to scrape the gunk\n            off his legs, manages to get one of his hands stuck to the\n            hardening mess in the process -- like a mouse in a glue-trap.\n\n\n            Abigail calmly approaches.  She stands over Dingo, staring\n            down at him with a look of cruel indifference.  She holsters\n            her bloop gun, withdraws another SILVER STAKE --\n\n\n<b>                                ABIGAIL\n</b>                     Scream if this hurts, chica.\n\n\n            -- and SLAMS the stake into his chest.\n\n\n<b>            WIDEN OUT\n</b>\n\n            Abigail turns, surveying her work.  The ashen remains of the\n            vampires are popping and crackling like campfire embers.  In\n            thirty-seven seconds she's managed to eliminate them all.\n\n\n            A train approaches, pulls into the station.  PASSENGERS\n            disembark, flood the platform.  They tramp all over the ashes\n            of the vampires, completely unaware of the recent slaughter.\n\n\n            Abigail walks against the stream of traffic, boards the train. \n            She is the sole passenger as the train pulls away.\n\n\n<b>            INT. BLADE'S REFUGE - WHISTLER'S ROOM - NIGHT\t\n</b>\n\n            Whistler sits on a cot, contemplating the tarnished wedding\n            ring on his hand.  He slowly spins it around his finger.\n\n\n<b>            INT. BLADE'S REFUGE - BLADE'S ROOM - NIGHT\n</b>\n\n            Blade sits before a small Buddhist shrine, meditating. \n            Incense burns.  His sword rests in a ceremonial holder.  Near\n            silence punctuated by the intermittent ocean swell outside.\n\n\n<b>            CLOSE ON BLADE'S FACE\n</b>\n\n            We hear the SOUNDS OF VIOLENCE -- ECHOING SCREAMS, GUNSHOTS. \n            These are Blade's thoughts.  The inner demons he is constantly\n            trying to tame.  The sounds CRESCENDO and --\n\n\n            --\tBlade opens his eyes.  He listens.  Something is wrong.\n\n\n<b>            INT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            Blade creeps into the outer room, sword drawn.\n\n\n            NOISE behind him, turns to see --\n\n\n<b>            WHISTLER\n</b>\n\n            standing in the shadows, clutching a handgun.\n\n\n<b>                                WHISTLER\n</b>                     What is it?\n\n\n<b>                                BLADE\n</b>                     What you've been worrying about.\n\n\n            They listen.  Just the sound of the ocean swell.  Then --\n\n\n<b>            A WINDOW SHATTERS\n</b>\n\n            TWO ARMORED SWAT AGENTS lower in on rappelling lines. \n\n\n<b>            TWO MORE AGENTS\n</b>\n\n            CRASH through a bank of windows on either side, swinging in. \n            They FIRE cannisters of TEAR GAS.  As Blade moves to engage\n            them, Whistler RUSHES into the heart of the armory --\n\n\n            A reinforced door EXPLODES inward.  MORE AGENTS storm inside. \n\n\n<b>            FROM THE WATER,\n</b>\n\n            a military Zodiac (inflatable boat) roars up one of the wooden\n            boat ramps, laden with gun-toting AGENTS.  They jump out,\n            fanning all over the boat house.\n\n\n            He hears a\n\n\n<b>                                AGENT\n</b>                     On the floor!  ON THE FLOOR!\n\n\n            Whistler FIRES at them, then makes a run for it.  The agents\n            RETURN FIRE, but Whistler ducks behind a concrete pillar --\n\n\n<b>            EXT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            Cop cruisers, unmarked cars, and SWAT trucks sweep in, SIRENS\n            blaring, disgorging a small army of POLICE and FBI AGENTS.\n            POLICE BOATS are pulling up to the dock.\n\n\n<b>            AGENTS CUMBERLAND AND HALE\n</b>\n\n            emerge from an unmarked, wearing bullet-proof vests,\n            brandishing firearms.  Cumberland barks orders into a radio.\n\n\n<b>                                CUMBERLAND\n</b>                     Lock it down!  Keep them contained!\n\n\n            On the rooftops above, various SWAT SNIPERS take position.\n\n\n<b>            INT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            Blade BRAWLS with a half-dozen agents, sending them flying in\n            all directions.  He grabs one agent, HEAD-BUTTS him, THROWS\n            him into the path of two others --\n\n\n            Then he reaches for another, THROWING him THROUGH a window at\n            the rear, out into the river which runs below --\n\n\n<b>            ON WHISTLER\n</b>\n\n            as he moves with increased urgency.  The armory is filling up\n            with tear gas.  Coughing and half-blind, he hurries to a bank\n            of computers, types in a series of commands --\n\n\n<b>            THE VARIOUS COMPUTER MONITORS\n</b>\n\n            around him synch up, showing the same protocol message:\n\n\n                            Data protection routine enabled\n\n\n                          --\tServer 1 protection enabled...\n\n\n                          --\tServer 2 protection enabled...\n\n\n            In response, a rack of network storage equipment and removable\n            hard drives EXPLODES.  Then a second rack of equipment\n            EXPLODES as well.\n\n\n<b>            EXT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            From their vantage point below, Cumberland and the others can\n            hear the explosions. Cumberland is on his radio, SHOUTING:\n\n\n<b>                                CUMBERLAN D\n</b>                     What's going on in there?\n\n\n<b>                                AGENT'S VOICE\n</b>                          (over radio)\n                     Some kind of self-destruct program!\n                     They're fragging their hard drives!\n\n\n<b>            INT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            Whistler keeps moving.  An agent gets a clear shot at him,\n            FIRES -- Whistler is hit in the chest.\n\n\n            Blade SEES Whistler take the hit, but he's cut off from the\n            old man, being swarmed by agents --\n\n\n<b>                                BLADE\n</b><b>                     WHISTLER!\n</b>\n\n            Whistler staggers, keeps moving.  He makes it to another bank\n            of computers, launches the same protocol.\n\n\n<b>            ON MORE MONITORS\n</b>\n\n            Erasing information, purging themselves.  We see commands:\n\n\n                         --\tWorkstation 1 protection enabled\n\n\n                         --\tWorkstation 2 protection enabled\n\n\n            With each successive command, the workstations themselves\n            begin self-destructing, EXPLODING one after another.\n\n\n            Another agent gets a bead on Whistler, FIRING a round into\n            Whistler's thigh.  Whistler SCREAMS --\n\n\n<b>            ON BLADE,\n</b>\n\n            in anguish as he sees his mentor being slaughtered.  Then two\n            agents are RUSHING HIM, tackling Blade.  As one they fall\n            backwards, into another bank of windows --\n\n\n<b>            EXT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            CRASH!  The three of them come FLYING DOWN in a spray of\n            glass, landing atop one of the police cruisers below.  The\n            roof buckles under their weight, windows SHATTERING --\n\n\n<b>                                CUMBERLAND\n</b>                     Take him down!\n\n\n            An FBI AGENT raises a CODA net gun atop his shoulder, taking\n            aim.  BA-BANG!  Four projectiles expand out from the barrel,\n            carrying a STEEL NET which has been strung between them.\n\n\n            The netting hits Blade, wrapping around him, restricting his\n            movements.  Immediately, a small army of agents DIVE on top of\n            him, PUMMELING AWAY, trying to beat him into submission --\n\n\n<b>            INT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            On the verge of losing consciousness, Whistler props himself\n            against a piece of machinery.  He's bleeding, been shot to\n            hell.  One of his hands is closed, clutching something.\n\n\n            Agents warily close in around him, guns raised.\n\n\n<b>                                AGENT\n</b>                     Move a finger and you're dead.\n\n\n<b>                                WHISTLER\n</b>                          (flipping them off)\n                     How 'bout this one?\n\n\n            Whistler lets his other hand uncurl. He's got a REMOTE in his\n            palm, with a tiny digital timer counting-down.\n\n\n<b>                                AGENT #2\n</b>                     He's got something in his--\n\n\n            00:03.  00:02.  00:01.  The timer reaches zero.\n\n\n<b>            A SERIES OF EXPLOSIONS\n</b>\n\n            rock the workshop, knocking the agents back.\n\n\n<b>            EXT. BLADE'S REFUGE - BOAT HOUSE - NIGHT\n</b>\n\n            CLOUDS OF FIRE and FLAMING DEBRIS MUSHROOM OUTWARD, catching\n            all unawares, sweeping them up off their feet with a hurricane\n            force.  In the midst of the conflagration --\n\n\n            -- Blade briefly manages to tear free of his captors --\n\n\n<b>                                BLADE\n</b><b>                     WHISTLER!!!\n</b>\n\n            -- but the wall of FIRE and LIGHT is rushing onward, sweeping\n            up everything in its path, turning the world to white.\n\n\n<b>            INT. POLICE STATION - INTERROGATION ROOM - NIGHT\n</b>\n\n            FADE IN.  We are CLOSE ON Blade's perspiration-beaded face.\n            His eyelids flutter as he slowly regains consciousness.\n\n\n<b>                                CUMBERLAND (O.S.)\n</b>                     Rise and shine, sleepyhead.\n\n\n            PULL BACK.  We are in a room with a one-way mirrored window. \n            Blade sits, hands cuffed behind him, BRIGHT LIGHTS shining\n            down on him.  He looks disoriented, battered.  Very weak.\n\n\n            Cumberland and Hale are sitting across from Blade.\n\n\n<b>                                BLADE\n</b>                     Who --?\n\n\n<b>                                CUMBERLAND\n</b>                     Special Agents Ray Cumberland and Wilson\n                     Hale, FBI.  We've been tracking you for a\n                     long time.\n\n\n<b>                                BLADE\n</b>                     Whistler --\n\n\n<b>                                HALE\n</b>                     Dead.  Just like all of your victims.\n\n\n            Blade shuts his eyes -- as if he could just wish them away.\n\n\n<b>                                CUMBERLAND\n</b>                     How many people have you killed?  Thirty?\n                     Forty?  A hundred?\n\n\n<b>                                BLADE\n</b>                     Those were familiars -- people who worked\n                     for them --\n\n\n<b>                                CUMBERLAND\n</b>                     And by \"them\" you mean vampires, right?\n                     I suppose next you'll be telling us that\n                     Bigfoot's in on the conspiracy too? So\n                     what kills these bloodsu~kers, tough guy? \n                     Maybe you can give us some pointers.\n                          (counting on his ringers)\n                     You can stake 'em, right?  Then there's\n                     sunlight -- what about crosses, Wilson? \n                     Do those still work?\n\n\n<b>                                HALE\n</b>                     I don't know, Ray.  What if a vampire's\n                     Jewish?\n\n\n<b>                                CUMBERLAND\n</b>                     That's a good point.  And does garlic work\n                     on a Hindu vampire?  Or do you need\n                     saffron or something?\n\n\n            Hale laughs.  Cumberland shakes his head, his smile fading.\n\n\n<b>                                CUMBERLAND\n</b>                     You can keep doing your song and dance as\n                     long as you want, Blade, but it's not\n                     going to play.  You're a stone-cold\n                     killer.  And you're sick as fuck.\n\n\n<b>                                VANCE (O.S.)\n</b>                     Let's leave the diagnosis to the\n                     professionals.\n\n\n<b>            ANGLE ON DR. EDGAR VANCE,\n</b>\n\n            standing in the doorway.  He's the man we saw on Larry King.\n            He takes a seat by Blade, sets a leather case on a table.\n\n\n<b>                                VANCE\n</b>                     Hello, Blade.  My name is Doctor Vance.\n                     I'm with the Department of Mental Health.\n                     I've been charged with conducting a\n                     psychiatric evaluation of you.\n                          (to Cumberland and Hale)\n                     Gentleman, would you mind giving us a few\n                     moments alone?\n\n\n            Cumberland nods.  They rise, exiting the room.  Vance smiles,\n            trying to project a sympathetic air.\n\n\n<b>                                VANCE\n</b>                     I imagine this must be very frightening\n                     for you.  But I want you to know that I'm\n                     here to help.  In order to do that,\n                     however, I need to ask you some questions.\n                          (beat)\n                     Now.  Can you tell me what day it is?\n\n\n            Blade just stares daggers at Vance.\n\n\n<b>                                VANCE\n</b>                     What about the President?  Do you know\n                     who's in the White House at the moment?\n\n\n<b>                                BLADE\n</b>                     An ass-hole.\n\n\n<b>                                VANCE\n</b>                          (sighing)\n                     Alright then, let's talk about vampires --\n                     what can you tell me about that?\n\n\n<b>            INT. POLICE STATION - OBSERVATION ROOM - NIGHT\n</b>\n\n            On the other side of the mirror, Cumberland and Hale have\n            joined Chief Vreede.  We hear Blade and Vance via speakers:\n\n\n<b>                                BLADE\n</b>                     There's nothing to tell.  They exist.\n\n\n<b>                                VANCE\n</b>                     And are you one of them?\n\n\n<b>            INT.\tPOLICE STATION - INTERROGATION ROOM - NIGHT\n</b>\n\n            Vance sits forward, drawing closer.\n\n\n<b>                                VANCE\n</b>                     What about blood?   When you drink it, do\n                     you find yourself sexually aroused?\n\n\n            Blade just glares at Vance.\n\n\n<b>                                VANCE\n</b>                     You see, it strikes me that this business\n                     of vampirism has strong connotations of\n                     sexual confusion.  Bodily fluids being\n                     exchanged, that sort of thing.  You have\n                     to ask where that comes from.  I'm\n                     wondering, for instance, what your\n                     relationship was like with your mother.\n                     Were the two of you close?\n\n\n            Blade glares.  If he escapes, he's going to kill this guy.\n\n\n<b>            INT. POLICE STATION - OBSERVATION ROOM - NIGHT\n</b>\n\n            Dr. Vance steps into the observation room, joining Chief\n            Vreede, Cumberland, and Hale.\n\n\n<b>                                VREEDE\n</b>                     What's your assessment, Doctor?\n\n\n<b>                                VANCE\n</b>                     He's psychotic, with paranoid features,\n                     possessing dangerous levels of sociopathy. \n                     He's exhibiting disorganized behavior.  He\n                     obviously doesn't have a properly formed\n                     conscience --\n                          (spreading his hands)\n                     For his safety and the public's, I'm\n                     recommending that he be transferred to\n                     County Psychiatric for further treatment.\n\n\n<b>                                CUMBERLAND\n</b>                     That's unacceptable.  This man's wanted in\n                     connection with a laundry list of federal\n                     crimes.  I need him on a plane to the\n                     Detention Center in Washington tonight.\n\n\n<b>                                VANCE\n</b>                     Agent Cumberland, that man is in no\n                     condition to undergo prosecution.\n\n\n            Cumberland and Hale look to Vreede with disbelief.\n\n\n<b>                                HALE\n</b>                     Chief, we've got a federal arrest warrant\n                     here that clearly supersedes --\n\n\n<b>                                VREEDE\n</b>                     I don't care about your warrant.  We're in\n                     my jurisdiction now.  You've got an issue\n                     with that, you take it up with the local\n                     magistrate.\n\n\n            Dr. Vance shrugs as if to say he's sorry.\n\n\n<b>                                VANCE\n</b>                     I'm sorry, gentlemen, but the call has\n                     already been made.  A team from the\n                     hospital should be here momentarily to\n                     oversee the transfer.\n\n\n<b>            INT. POLICE STATION - ENTRY WAY - NIGHT\n</b>\n\n            Asher, Danica, and Grimwood enter, followed by FOUR VAMPIRES\n            dressed as orderlies.  The orderlies carry a straightjacket,\n            various restraints, and a collapsible transport gurney.\n\n\n            Danica approaches the DESK SERGEANT, flashing a hospital ID.\n\n\n<b>                                DANICA\n</b>                     Hi.  We're here to transfer a patient to\n                     County General?\n\n\n<b>            INT. POLICE STATION - INTERROGATION ROOM - NIGHT\n</b>\n\n            Vance enters once more.  He opens the leather case on the\n            table, removing a syringe and an ampule of fluid.\n\n\n<b>                                VANCE\n</b>                          (speaking softly now)\n                     Just a little something to keep you\n                     compliant.  The normal dose is two, maybe\n                     three hundred milligrams.  But for a\n                     strapping young hybrid like yourself --\n\n\n            Vance pokes the needle of the syringe into the ampule.\n\n\n<b>                                VANCE\n</b>                     -- I think we'll kick it up to a couple\n                     thousand.\n\n\n            Vance reaches for Blade's arm.  Blade struggles, tries to pull\n            back, but Vance manages to inject him nonetheless.\n\n\n<b>                                VANCE\n</b>                     There.  That wasn't so bad, was it?\n                          (smiling)\n                     You're weak, aren't you?  In need of your\n                     serum.  Who would've guessed a mere human\n                     like myself could overpower you?\n\n\n<b>                                BLADE\n</b>                          (realizing)\n                     You're with them -- a familiar --\n\n\n<b>                                VANCE\n</b>                     Going on five years now.\n\n\n            Vance extends his arm, pulling back his shirt cuff a little to\n            reveal a VAMPIRE GLYPH tattooed on the underside of his wrist. \n            Then he pulls his cuff back down, smiles at Blade.\n\n\n<b>                                VANCE\n</b>                     It's the end-game, Blade.  All their plans\n                     are finally coming to fruition.  So just\n                     sit back and enjoy the show.\n\n\n            Blade looks to the one-way mirror, SCREAMS.\n\n\n<b>                                BLADE\n</b>                     He's one of them!  Damnit, he's working\n                     for them!\n\n\n            Vance looks to the one-way mirror as well and shrugs as if to\n            say -- \"The man's deranged.  What can I do?\"\n\n\n<b>            INT. POLICE STATION - OBSERVATION ROOM - NIGHT\n</b>\n\n            On the other side of the glass, Blade looks like a raging\n            lunatic.  Vance enters.  He extends his hand to Vreede.\n\n\n            They shake.  As they do so, we SEE a vampire GLYPH on the\n            inside of Vreede's wrist as well.  Another familiar.\n\n\n<b>            INT. POLICE STATION - INTERROGATION ROOM - NIGHT\n</b>\n\n            Blade stares at his own reflection in the mirror.  He blinks,\n            trying to focus -- but the drug is starting to kick in.\n\n\n<b>            INT. POLICE STATION - HALLWAY - NIGHT\n</b>\n\n            An elevator door opens.  Asher, Danica, and Grimwood exit,\n            followed by the orderlies who are now wheeling the gurney.  As\n            they move down the corridor, they pass --\n\n\n            -- Cumberland and Hale, who are chasing down Chief Vreede.\n\n\n<b>                                CUMBERLAND\n</b>                     Just hold it right there --\n\n\n            Danica shoves Cumberland aside, hard, keeps moving past him.\n\n\n            Cumberland looks to Hale.  Something isn't right about this.\n\n\n<b>            INT. POLICE STATION - INTERROGATION ROOM - NIGHT\n</b>\n\n            Blade struggles, in the full throes of the drug now.\n\n\n<b>            BLADE'S POV\n</b>\n\n            His vision is blurring, various objects in the room leaving\n            trails as he shifts his head from side to side and --\n\n\n<b>            ASHER, DANICA, AND GRIMWOOD\n</b>\n\n            enter, followed by two of the orderlies.  Despite his\n            incapacitation, Blade attempts to rise.  Danica plants her\n            heel in his chest, shoving him back down.\n\n\n<b>                                DANICA\n</b>                     Easy, lover. You're not going anywhere.\n\n\n            She draws closer, enjoying herself.\n\n\n<b>                                DANICA\n</b>                     We moved the humans around like, pawns,\n                     Blade.  Used them to flush you out.\n\n\n            Blade tries to LUNGE from his chair at her and -- WHACK!\n            Grimwood punches Blade across the jaw.  A brutal blow.\n\n\n<b>                                GRIMWOOD\n</b>                     Don't worry, Captain Sunshine.  Soon as we\n                     get you out of here, you'll get a chance\n                     to play.\n\n\n            Danica motions to the two vampire orderlies.  They step\n            forward with the straight-jacket, start to put it on Blade. \n            Blade THRASHES madly.  Asher LAUGHS, enjoying this.\n\n\n<b>                                DANICA\n</b>                     Don't make this any harder than it has to\n                     be.  You're all alone, Blade.  No one can\n                     help you now.\n\n\n            BA-BOOM!  The one-way mirror SHATTERS, exploding outward in a\n            shower of SLOW-MOTION GLASS FRAGMENTS, carrying with it --\n\n\n            -- a BODY, one of the vampire mental health flunkies --\n\n\n            ASHING in mid-air as he sails into the room!  Seconds later --\n\n\n<b>            A MAN\n</b>\n\n            VAULTS through the blown-out window, simultaneously drawing\n            two high-tech electronic pistols.\n            Meet HANNIBAL KING (30s), an audacious vampire hunter with an\n            irrepressible grin.  Slapped to his chest is a \"Hello, my name\n            is\" sticker with the words \"FUCK YOU\" written where the name\n            should be.\n\n\n<b>                                KING\n</b>                     Why'd the Polish vampire starve to death?\n\n\n            Danica spins, enraged, recognizing King instantly --\n\n\n<b>                                KING\n</b>                     He kept biting his own lip.\n\n\n<b>                                DANICA\n</b>                     King!\n\n\n            The lights go out.  Immediately, backup lights come on,\n            followed by FIRE ALARMS.  In the ensuing confusion ~ both\n            pistols at Asher, who drops, allowing one of the vampire\n            orderlies behind him to take the hit.\n\n\n<b>            THE VAMPIRE ORDERLY ASHES\n</b>\n\n            But unlike Blade's victims, he disintegrates from the inside\n            out.  (The reason is King's signature bullets -- SUN DOGS,\n            explosive rounds that give off concentrated UV light.)\n\n\n            King whips around, FIRING at --\n\n\n            -- Danica, who LEAPS behind the table.  She quickly upends it,\n            using it as a shield, FLINGING it at King.\n\n\n<b>            ON BLADE\n</b>\n\n            He shifts his weight, throwing himself and the chair he's\n            sitting on to the floor.  Then he KICKS OUT AND UP --\n\n\n            -- connecting with Grimwood's mid-section, sending him FLYING\n            BACKWARDS -- straight through the wall into the next room!\n\n\n            King holsters one of his pistols and hauls Blade up.  At the\n            same time, he FIRES on Asher again, missing him --\n\n\n<b>                                KING\n</b>                     Let's FLY, kemosabe!\n\n\n            King drags Blade to the door --\n\n\n<b>            INT. POLICE STATION - HALLWAY - NIGHT\n</b>\n\n            -- into the neighboring corridor.  Cumberland and Hale SEE\n            them.  They reach for their weapons --\n\n\n<b>                                CUMBERLAND\n</b>                     He's getting away!\n\n\n            King FIRES into the room behind him, then pulls a GRENADE\n            secured to a bandolier and tosses it through the doorway --\n\n\n            An EXPLOSION rocks the interrogation room, filling the\n            corridor with smoke, knocking Cumberland and Hale back.\n\n\n            King turns his attention to Blade's handcuffs, FIRING between\n            them, freeing Blade's hands.  Blade collapses against the\n            wall.  He's shaking, close to passing out.\n\n\n<b>                                KING\n</b>                     Don't die on me, you undead motherfucker!\n\n\n            King drags Blade up.  They continue down the corridor to --\n\n\n<b>            ABIGAIL, THE FEMALE VAMPIRE HUNTER\n</b>\n\n            we met earlier.  She's engaged in hand-to-hand combat with a\n            half-dozen UNIFORMED OFFICERS.  Three of them are already\n            down.  In seconds, she finishes off the other three.\n\n\n<b>                                KING\n</b>                     Whistler!  We need that serum NOW!\n\n\n            Whistler?  Abigail spins, dispatching the last officer with a\n            kick to the mid-section while tossing a PNEUMATIC INJECTOR at\n            King.  He snatches it, places it in Blade's hands.\n\n\n            Blade injects himself in the neck.  Moments later, he's\n            reenergized.  He looks to King, clear-eyed.\n\n\n<b>                                KING\n</b>                     Hey Blacula, you ready to shake and bake?\n\n\n            Blade responds by PUNCHING King across the jaw.\n\n\n<b>                                BLADE\n</b>                     Call me that again and I'll give you\n                     fucking brain damage.\n\n\n            King massages his jaw, tossing Blade a pistol even as --\n\n\n            --\tGrimwood rounds the corner, hungry for blood, TWO MORE\n            VAMPIRE ORDERLIES behind him.\n\n\n            Blade FIRES round after round of EXPLOSIVE BULLETS, causing\n            Grimwood and the others to fall back.  Blade and King move,\n            joining Abigail.  MORE SMOKE, darkness, only the emergency\n            lights to illuminate the station.\n\n\n<b>            UP AHEAD,\n</b>\n\n            a group of POLICEMEN spill from a stairwell, armed with bullet\n            proof vests.  They OPEN FIRE --\n\n\n            Blade, King, and Abigail retreat into an alcove.  They're\n            pinned down between the vampires and a group of policemen.\n\n\n<b>                                KING\n</b>                     We're pinned down!\n                          (to Blade)\n                     Can't you do something?!\n\n\n<b>                                BLADE\n</b>                     I can't shoot around corners!\n\n\n<b>                                ABIGAIL\n</b>                     I can.\n\n\n            As King and Blade lay down COVER FIRE, Abigail reaches behind\n            her, withdrawing a device that's been secured there.  She\n            gives it a SNAP and it springs open, taking the shape of a --\n\n\n<b>            FUTURISTIC COMPOUND BOW\n</b>\n\n            Crafted from aluminum, its limbs imbedded in key positions\n            with vibration-dampening modules, this bow is capable of\n            firing an arrow upwards of 300 feet-per-second.\n\n\n            Abigail withdraws a SILVER ARROW with a time-delay explosive\n            tip from her quiver, nocks it in her bow and takes aim at --\n\n\n<b>            A FIRE EXTINGUISHER\n</b>\n\n            mounted at the end of the corridor.  She lets her arrow fly --\n\n\n<b>            MOVING WITH THE ARROW\n</b>\n\n            as it banks off the side of the fire extinguisher, continuing\n            down the side corridor where it embeds itself in --\n\n\n            -- the shoulder of one of the vampires!  The vampire SCREAMS,\n            grabbing the shaft, ripping it out.  Then we --\n\n\n<b>            MACRO-ZOOM ON THE ARROW HEAD\n</b>\n\n            A tiny \"egg-timer\" dial on the arrowhead spins.  It CLICKS in\n            place, a RED LED comes on, and --\n\n\n            --\tthe arrowhead EXPLODES, catching all three vampires with\n            the full force of a UV BLAST.  Grimwood ducks away from the\n            blast as the other two vampires ASH --\n\n\n<b>            BLADE, KING, AND ABIGAIL\n</b>\n\n            come racing out of the alcove.  They reach a stairwell.  Blade\n            RIPS a steel door clear off its hinges, tossing it down the\n            stairwell at a phalanx of COP REINFORCEMENTS who are charging\n            up the stairs.  The cops go down like ten-pins.\n\n\n            Blade and company have an opening.  But as they charge\n            downward --\n\n\n<b>                                BLADE\n</b>                          (as King and Abigail\n                          freeze)\n                     My sword.  They still have it.\n\n\n<b>                                KING\n</b>                          (apoplectic)\n                     Are you insane?!  We're practically home\n                     free!  We can't go hunting for your\n                     fucking butter-knife now!\n\n\n            But Blade is already heading back the way they came and --\n\n\n<b>                                KING\n</b>                     Hey!  HEY!!!  COME BACK HERE!!!  This is\n                     supposed to be a rescue!\n\n\n            -- Abigail grabs King's shoulder, pulling him to the stairs.\n\n\n<b>                                ABIGAIL\n</b>                     Forget it, King.  Let's move.\n\n\n<b>            POLICE STATION - NIGHT\n</b>\n\n            King and Abigail rush outside.  The station is gated. FLASHING\n            POLICE CARS are surging through the mouth of the gate. \n            They're trapped.  Then --\n\n\n<b>            CRASH!\n</b>\n\n            A window on the third floor of the station EXPLODES OUTWARD. \n            Blade drops three stories, landing before King and Abigail in\n            a cat-like crouch.  With his sword in his hand.  He looks at\n            King, grins, flips him off.\n\n\n<b>                                BLADE\n</b>                     Now we can go.\n\n\n<b>                                KING\n</b>                          (nudging Abigail)\n                     Is he epic or what?\n\n\n            The police close in around them, pinning the trio down with\n            FIREPOWER.  Yet King and Abigail seem unconcerned because --\n\n\n<b>            HEADLIGHTS\n</b>\n\n            are washing over them.  A beefed-up, 70s Land Cruiser is\n            SCREAMING up the street.  The Cruiser jumps onto the sidewalk,\n            SMASHES right through the gated wall.  SCREECHES to a stop\n            between our trio and the police cars.\n\n\n<b>            A DRIVER (DEX)\n</b>\n\n            leans out his window, gives a little wave as the rear doors\n            pop open.  Gruff and compact, he looks like a prize-fighter.\n\n\n<b>                                DEX\n</b>                     My name is Dex.  And I'll be saving your\n                     ass this evening.\n\n\n            Blade, King, and Abigail scramble into the back of the Land\n            Cruiser.  Dex reverses, backing out the way he came.\n\n\n            The police from the squad cars are FIRING, but the Land\n            Cruiser is armored and the bullets harmlessly SPARK off.\n\n\n<b>            INT. LAND CRUISER - NIGHT\n</b>\n\n            In the backseat, Abigail looks through the rear windshield --\n\n\n<b>            ABIGAIL'S POV\n</b>\n\n            Grimwood is running after them, actually gaining on the Land\n            Cruiser.  Chewing up the asphalt like a cheetah.\n\n\n<b>            EXT. LAND CRUISER - NIGHT\n</b>\n\n            Abigail leans out the rear window, nocking a non-UV arrow in\n            her bow.  She takes aim at Grimwood, lets the arrow fly --\n\n\n            SHUNKT!  The arrow sinks into Grimwood's eye.  He goes down,\n            his somersaulting figure quickly receding into the background\n            as the Land Cruiser speeds away.\n\n\n<b>            INT. LAND CRUISER - NIGHT\n</b>\n\n            Safe for the moment, King basks in the adrenaline rush of a\n            battle well fought.  Meanwhile, Dex is on a cell phone.\n\n\n<b>                                DEX\n</b>                     We have him.  We'll be there soon.\n\n\n<b>                                KING\n</b>                          (to Blade)\n                     So my entrance back there -- what do you\n                     think?  Too flashy?  Right on the money?\n\n\n            King unhuckles his combat harness, revealing a bullet-proof\n            vest bereath it that's been riddled with imbedded slugs.\n\n\n<b>                                BLADE\n</b>                     Who are you people?\n\n\n<b>                                KING\n</b>                     My name's Hannibal King.  I'm a hunter,\n                     like you.\n                          (re: Abigail)\n                     And this little hellion is Abigail\n                     Whistler.\n\n\n            Abigail just stares back at Blade, silently appraising him.\n\n\n<b>                                KING\n</b>                     That's right, Blade.  You're not hearing\n                     things.  She's Whistler's daughter.  You\n                     see, Abby, Dex, myself -- we're all part\n                     of Whistler's \"contingency plan\".\n\n\n            King reaches into an inner pocket, pulls out a pack of gum. \n            He selects a stick, offers one to Blade.\n\n\n<b>                                KING\n</b>                     Juicyfruit?\n\n\n<b>            EXT. CITY STREETS - NIGHT\n</b>\n\n            The Land Cruiser rockets away, disappearing into the night.\n\n\n<b>            EXT. LUNA PARK - NIGHT\n</b>\n\n            The Land Cruiser moves across an abandoned lot towards the\n            weed-choked ruins of an old amusement park.  We pass by the\n            skeletal remains of a roller-coaster, a tilt-a-whirl, the\n            vandalized and wood-rotted remnants of a carousel.\n\n\n            Finally, the Land Cruiser turns towards a motorized loading\n            door in the side of a large warehouse and disappears inside.\n\n\n<b>            INT. WAREHOUSE/GARAGE - NIGHT\n</b>\n\n            As the door grinds closed, the Land Cruiser stops.  King and\n            Abigail lead Blade through the darkness.  In the gloom we see\n            a half-dozen vehicles in various stages of being retrofitted\n            with armored panels and weaponry, etc.  SURVEILLANCE CAMERAS\n            mounted above track their progress.\n\n\n<b>                                BLADE\n</b>                     I thought the vampires murdered\n                     Whistler's family.\n\n\n<b>                                ABIGAIL\n</b>                     They did.  I'm the product of an earlier\n                     fling of my Dad's, born out of wedlock. \n                     After the murders happened, he kept me\n                     hidden.  He wanted me safe.  Away from all\n                     of this --\n                          (gesturing around them)\n                     -- but I guess hunting just runs in our\n                     blood.\n\n\n            As King and Abigail lead Blade towards a stairway, Blade\n            catches sight of --\n\n\n<b>            A LITTLE GIRL (5)\n</b>\n\n            peering down at him from atop one of the rafters.  As soon as\n            he spots her, she ducks into the shadows.\n\n\n            They reach the stairway.  AUTOMATED GUNS mounted on swivel\n            arms lock on them with infra-red targeting beams.\n\n\n<b>                                ABIGAIL\n</b>                     When I came of age, I tracked my Dad\n                     down, told him I wanted in.\n                          (beat, shrugging)\n                     Been doing it ever since.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            We enter a sprawling industrial facility that is equal parts\n            mechanics shop, firing range, and laboratory.  We glimpse a\n            virtual arsenal of new weaponry and medical equipment,\n            including DNA sequencers, microfuges, and electroporaters.\n\n\n            The new equipment fights for space alongside the old -\n            mountains of mothballed parts from the park's broken thrill\n            rides.  Here and there we see the oversized fiberglass head of\n            a grinning fun-house creature or the mildewed torso of a\n            fortune-telling mannequin, frozen in its upended booth.\n\n\n<b>                                KING\n</b>                     Welcome to the honeycomb hideout.\n\n\n<b>                                BLADE\n</b>                          (looking around)\n                     How do you bankroll this place?\n\n\n<b>                                KING\n</b>                     Internet porn.  See, we're using cock\n                     suckers to pay for the blood-suckers.  \n                          (off Blade's look)\n                     Joke.  Come on, man.  This isn't some\n                     piddly little hoopty-ass operation, Blade. \n                     We take our jobs very seriously.\n\n\n<b>            UP AHEAD,\n</b>\n\n            TWO OTHERS pause in their work as King approaches.  Dex falls\n            in behind them.\n\n\n            HEDGES (20s) is an engineer, always lost in his own world.\n\n\n            SOMMERFIELD (30s) is a frail-looking geneticist.  She's also\n            blind, operating her computers via a voice-synthesis program\n            and Braille keyboard.\n\n\n<b>                                KING\n</b>                     You met Dex.  This is Hedges, Sommerfield--\n\n\n            King gestures to them in turn.  They're all refugees in one\n            way or another, sharing a common guardedness, their lives\n            having been shattered by the vampires.\n\n\n<b>                                KING\n</b>                          (nodding back)\n                     The runt you saw earlier is Sommerfield's\n                     daughter, Zoe.  We call ourselves the\n                     Nightstalkers.\n\n\n<b>                                BLADE\n</b>                     You sound like rejects from a Saturday\n                     morning cartoon.\n\n\n<b>                                KING\n</b>                     We were gonna call ourselves the Super\n                     Friends, but that was taken.\n\n\n            Abigail rids herself of her weapons -- bow, arrows, silver\n            stakes and knives.  She hands her compound bow to Hedges.\n\n\n<b>                                ABIGAIL\n</b>                     Tiller needs adjustment.\n\n\n<b>                                HEDGES\n</b>                     I'll run it through the bow press.\n\n\n            Blade examines some of the equipment being developed.\n\n\n<b>                                BLADE\n</b>                     How many of you are there total?\n\n\n<b>                                KING\n</b>                     Enough.  We operate in sleeper cells. \n                     When one goes down, a new cell activates\n                     to pick up the slack.  Consider us your\n                     reinforcements.\n\n\n<b>                                BLADE\n</b>                     Sorry.  Never been much of a team player.\n\n\n<b>                                SOMMERFIELD\n</b>                     I don't think you understand, Blade.\n                     Whistler meant for us to help you.  When\n                     he died, he activated an emergency\n                     protocol.  All his knowledge --\n\n\n            She gestures to the computer equipment around her.\n\n\n<b>                                SOMMERFIELD\n</b>                     --was transferred to our servers here.\n\n\n<b>                                BLADE\n</b>                     And what makes you think you know so much\n                     about killing vampires?\n\n\n            King reaches for his collar, pulling it down to reveal a\n            telltale mass of scar tissue in the shape of a BITE MARK.\n\n\n<b>                                KING\n</b>                     Well for starters, I used to be one.  \n                          (in a sinister tone)\n                     Do I pass the audition?\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. PHOENIX TOWERS - NIGHT\n</b>\n\n            We soar through the night sky, diving down towards a cluster\n            of gleaming, high-tech spires.  As we isolate a penthouse\n            apartment atop one of them we hear an ANGRY SCREAM.\n\n\n<b>                                DANICA (O.S.)\n</b>                     Fucking Hannibal King!\n\n\n<b>            INT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            An impressively decorated loft bespeaking of money, power, and\n            a certain perverse esthetic.  Danica slams her fist straight\n            through the wall, then spins around, enraged.\n\n\n            Asher and Grimwood are there too, their wounds being treated\n            by Hendrix and a VAMPIRE TECHNICIAN.  At tie moment, they're\n            trying to remove the arrow protruding from Grimwood's eye.\n\n\n            An enormous ROTTWEILER sits nearby, attentively watching. A\n            TRIO OF GUARDS flinch with every act of violence. Danica is\n            strong.  Clearly, no one wants to get in her way.\n\n\n<b>                                DANICA\n</b>                     I should've ripped his ripped his\n                     bleeding heart out when I had the chance!\n                          (pointing at Asher)\n                     And don't you dare tell me \"I told you\n                     so\"!\n\n\n            Asher raises his hands as if to say \"no harm, no foul\". \n            Danica continues her tantrum, SMASHING a statue apart,\n            SHATTERING a heavy glass tabletop.  Finally, she gives it a\n            rest, collapsing into a chair, shoulders sagging.\n\n\n<b>                                ASHER\n</b>                     You through remodeling?\n\n\n<b>                                DANICA\n</b>                     Blow me.\n\n\n<b>                                ASHER\n</b>                     Face it, Dan.  We got caught with our\n                     pants down.  We underestimated the\n                     Nightstalkers.\n\n\n<b>                                GRIMWOOD\n</b>                     Pants down?!  They practically fucking\n                     ass-raped us!\n\n\n            Grimwood GRUNTS in pain as the arrow is removed.  Asher\n            broaches a more serious subject.\n\n\n<b>                                ASHER\n</b>                     Has he been told yet?\n\n\n<b>                                VOICE (O.S.)\n</b>                     About your failure?\n\n\n            A MAN (30s) enters the room.  The same being we glimpsed in\n            the vault.  He has a haunting gaze and a commanding presence.\n            We will learn who he is momentarily.  But for now, it's enough\n            to know that everyone in the room pays him deference.\n\n\n<b>                                MAN\n</b>                     Yes, I've been told.\n\n\n            He places a hand on Danica's shoulder.  She tenses.\n\n\n<b>                                MAN\n</b>                     Perhaps it's time I entered the fray.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            CLOSE ON King buttoning his collar back up.  Blade, Abigail,\n            and Sommerfield are gathered around him.\n\n\n<b>                                KING\n</b>                     You know the kind of woman that just\n                     screams trouble? You see her and every\n                     warning bell in your brain starts going\n                     off but you still ask for her number? \n                     Well that's all I ever hook up with.  But\n                     this betty blew 'em all away in the\n                     shitstorm sweepstakes.\n\n\n            King reaches out to a keyboard, calling up a piece of\n            surveillance footage on a nearby monitor.  The footage\n            features Asher and Danica and Grimwood.  It's been slowed to a\n            near standstill and now advances frame by frame.\n\n\n<b>                                KING\n</b>                     Her name's Danica Talos.  You met her\n                     earlier.  The man on her left is Asher,\n                     her brother.\n\n\n            King types a command.  The image ZOOMS IN, tracking Grimwood.\n\n\n<b>                                KING\n</b>                     The neanderthal behind them is Jarko\n                     Grimwood.\n\n\n            King freezes the footage on Danica's grainy, pixelated face.\n\n\n<b>                                KING\n</b>                     I picked Danica up in a bar, had a one\n                     night stand with her -- then spent the\n                     next five years playing step-and-fetch-it\n                     as her little vampire cabana boy.\n                          (beat)\n                     Eventually Abigail found me.  Sommerfield\n                     here managed to treat me with a cure.  Now\n                     I kill them.\n                          (beat)\n                     That's called turning a frown upside\n                     down.\n\n\n<b>                                ABIGAIL\n</b>                     We need to pool our resources, Blade.\n\n\n<b>                                BLADE\n</b>                     Why?\n\n\n<b>                                ABIGAIL\n</b>                     Because He's come back.\n\n\n            King tosses a TOMB OF DRACULA comic book over to Blade.  Blade\n            glances at the cover, then looks at them, incredulous.\n\n\n<b>                                BLADE\n</b>                     You gotta be kidding me.\n\n\n<b>                                KING\n</b>                     He's real, Blade.  Dig beneath all the\n                     movies and myths.  All the layers of\n                     bullshit that've cluttered our culture for\n                     the last five hundred years and eventually\n                     you'll strike the truth.\n\n\n<b>                                BLADE\n</b>                          (incredulous)\n                     So the movies are true?\n\n\n<b>                                KING\n</b>                          (shaking his head)\n                     The movies are just a comforting\n                     fairytale compared to the real deal. \n                     There's no happy ending with this guy. \n                     Peter Cushing isn't going to run in at the\n                     last second and save the day with a cross\n                     and some holy water.\n                          (re: the comicbook)\n                     See, good old Brain Stoker, he wrote a\n                     nice yarn.  But the events he described in\n                     1897 were only a tiny piece of the mosaic. \n                     The rea1 Dracula's origin goes back much\n                     earlier than that.\n\n\n<b>                                BLADE\n</b>                     How early?\n\n\n<b>                                ABIGAIL\n</b>                     Try six or seven thousand years.\n\n\n            Off Blade's astonished look we --\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. MESOPOTAMIA - NIGHT\n</b>\n\n            FLASH!  We see the man we met earlier (DRACULA/DRAKE) on the\n            banks of the river Euphrates, striding towards us, engaged in\n            fierce battle with UBAIDIAN SOLDIERS.  He's clutching the same\n            sword we saw in the ziggurat, clad in the same armor.\n\n\n<b>                                KING (V.0.)\n</b>                     Dracula's only one of the names he's gone\n                     by.  Now they call him Drake.  If you\n                     believe the legends, he was born in\n                     ancient Sumeria.\n\n\n            As Drake SLASHES his sword downward we CUT BACK TO --\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            -- King continuing his story. As the hunter's monologue\n            progresses we will INTERCUT with Drake's own progression\n            through history.  Brief, violent FLASHBACKS.\n\n\n            (NOTE:  The backgrounds surrounding Drake will be\n            expressionistic, digital composites, constantly shifting.  The\n            focus of the flashes is Drake himself, fighting a shadowy\n            horde, his attire continually evolving through time.)\n\n\n<b>                                KING\n</b>                     Nobody really knows the specifics of his\n                     origin.  But we do know this:  he was the\n                     first of his kind.  The patriarch of the\n                     hominus nocturna.\n\n\n<b>            EXT. EGYPTIAN DESERT - NIGHT\n</b>\n\n            FLASH!  We are in Egypt now, circa 1650 BC.  Drake wages war\n            against the HYKSOS.  He is closer to the camera.  And will\n            continue to move closer with each successive flashback.\n\n\n<b>                                KING (V.0.)\n</b>                     Every single vampire -- every single\n                     monster that's walked the earth since then\n                     -- owes their existence to Him.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            Back to King, holding court before Blade and Abigail.\n\n\n<b>                                KING\n</b>                     He's like the Patient Zero of evil.  The\n                     original Serpent in the Garden of Eden.\n                     And just like the Great White shark, he's\n                     never had to evolve.  This guy was born\n                     perfect.  Scour the history books --\n\n\n<b>            EXT. THRACE - NIGHT\n</b>\n\n            FLASH!  The Peloponnesian War, Southern Thrace, circa 405 BC.\n            We see Dracula battling ATHENIANS.  Even closer now, his face\n            spattered with blood.  At the same time, the SOUNDTRACK is\n            gradually swelling, expanding in complexity and volume.\n\n\n<b>                                KING (V.0.)\n</b>                     -- read between the lines --\n\n\n<b>            EXT. HUNGARIA - NIGHT\n</b>\n\n            FLASH!  5th century AD, battling the GOTHS.  With every swipe\n            of his sword, we WIPE FORWARD into the future.\n\n\n<b>                                KING (V.0.)\n</b>                     -- you'll find countless references to\n                     Him.  Always mentioned, never named.\n\n\n<b>            EXT. EUROPE - NIGHT\n</b>\n\n            FLASH!  8th century AD, the reign of Charlemagne.  Battling\n            the VIKINGS.  The FLASHBACKS come faster now, assaulting us\n            with ever-increasing rapidity.\n\n\n            Drake continues striding forward while the rest of the world\n            evolves around him, centuries whizzing by via computer\n            generated time-lapse photography.\n\n\n<b>                                KING (V.0.)\n</b>                     He's been there --\n\n\n<b>            EXT. VARIOUS - NIGHT\n</b>\n\n            FLASH!  12th century AD, the time of the Crusades.  The\n            violence intensifies.\n\n\n<b>                                KING (V.0.)\n</b>                     -- moving behind the scenes --\n\n\n            FLASH!  17th century France, the time of Louis the XIV.  The\n            pace becomes breathless.\n\n\n<b>                                KING (V.0.)\n</b>                     -- cutting a bloody path through the Ages\n                     until suddenly --\n\n\n            FLASH!  18th century Russia, the time of Peter the Great.  The\n            soundtrack is THUNDEROUS.  Drake has become a bloody blur of\n            bestial rage and unfettered horror and --\n\n\n<b>                                KING (V.0.)\n</b>                     -- just like that --\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            -- King SNAPS his fingers.  We are back in the present.\n\n\n<b>                                KING\n</b>                     -- he up and disappeared.  About a century\n                     ago the trail went cold.  Then we heard a\n                     rumor.  The vampires were searching for\n                     him -- trying to find the place where he'd\n                     retreated.  According to our information,\n                     they found him in Iraq about six months\n                     ago.\n                          (beat)\n                     And he was pissed.\n\n\n<b>            EXT. DOWNTOWN COMMERCIAL DISTRICT - NIGHT\n</b>\n\n            Grime.  Neon.  Near-silence as the cacophonous soundtrack\n            recedes into the background, replaced by the steady drone of\n            inner-city TRAFFIC.\n\n\n<b>            ON DRAKE,\n</b>\n\n            viewed through a long-lens, clad in modern, casual attire,\n            striding in SLOW-MOTION down a PEDESTRIAN-CHOKED sidewalk.\n\n\n            Slower.  A HEARTBEAT.  The pulse of the people.  And over\n            this, intruding, the Doppler effect WAILING of an approaching\n            car as it rushes past us in a SCREEN WIPE until we are --\n\n\n<b>            OUTSIDE A GOTH STORE\n</b>\n\n            Drake studies a window display.  Halloween merchandise. \n            Costumes and monster masks and -- VAMPIRE NOVELTIES.  We see\n            vampire lunchboxes, Dracula plush dolls, plastic fangs, key\n            chains.  Even Dracula bobbleheads.\n\n\n            Drake stands in stark contrast to the mass-marketed caricature\n            on display before him.\n\n\n<b>            INT. GOTH STORE - NIGHT\n</b>\n\n            Drake enters. The store is crowded with low-end junky goods\n            that might appeal to tourists visiting Hollywood Boulevard.\n\n\n            A pallid, Goth-guy CASHIER sits behind a counter, eating from\n            a takeout container.  He's wafer thin, with a detached\n            attitude.  A snot.  Further back is a sultry GOTH VIXEN.\n\n\n            Behind them, on a TV, a cartoon is playing. An animated\n            vampire cavorts -- \"LITTLE BIT\" (like the Hot Stuff devil from\n            Ritchie Rich comicbooks)\n\n\n<b>                                DRAKE\n</b>                     In the window -- you sell vampire\n                     merchandise?\n\n\n            Goth Guy looks up, wiping his mouth with a napkin.  Doesn't\n            want to engage with Drake at all.\n\n\n<b>                                GOTH GUY\n</b>                     Uh, yeah -- look around, we might have a\n                     few things.\n\n\n            He and the Goth Vixen have a snicker at Drake's expense.  Then\n            she tries to be a little more helpful.\n\n\n<b>                                GOTH VIXEN\n</b>                     We've got Dracula lunchboxes.  Did you\n                     see those?  And there're bobbleheads, Pez\n                     dispensers.  We've got just about\n                     anything --\n                          (selecting a vampire-\n                          shaped vibrator, playful)\n                     -- even vampire vibrators.\n\n\n            As Drake looks around, what he sees matches his ascending\n            rage.  Costumes, candles, vampire Christmas ornaments. \n            Posters from different films -- Nosferatu, Lugosi, Lee -- then\n            Love at First Bite and The Little Vampire.\n\n\n<b>                                GOTH VIXEN\n</b>                     Here, check this out --\n\n\n            She reaches into a case, pulling out a soft-drink.  The label\n            reads: \"DRA-COLA\" and has a stylized vampire on it.\n\n\n<b>                                GOTH VIXEN\n</b>                     \"Dracola\".  Makes you want to cry,\n                     doesn't it?\n\n\n            Drake just stares at the can.  His mind seems to have\n            retreated elsewhere.  Back through the ages.\n\n\n<b>                                GOTH VIXEN\n</b>                     Was there something special you needed?\n\n\n            Drake doesn't respond.  A kind of melancholy has settled over\n            him.  He's an outsider now.  The world has moved on.\n\n\n<b>                                GOTH-GUY\n</b>                     Hey, guy, she's talking to you.\n\n\n            Drake looks up as Goth Guy pours a bowl of Count Chocula.\n\n\n<b>            EXT. GOTH STORE - NIGHT\n</b>\n\n            CRASH!  Goth Guy comes flying through the display window, his\n            trajectory taking his body clear across the street and into\n            the display window of the store opposite us.\n\n\n<b>            INT. GOTH STORE - NIGHT\n</b>\n\n            Goth Vixen SCREAMS.  Drake LASHES out.  hauling her over the\n            counter.  He sinks his teeth into her throat, drinking her\n            blood with wild abandon.  He consumes it so quickly that his\n            skin flushes BRIGHT RED.\n\n\n            Then Drake tears his head away, lifting his face upward as he\n            flings the girl aside, unleashing an ear-splitting ROAR.  And\n            for a brief moment, the bones of his face seem to shift, once\n            again hinting at another shape Drake might take.\n\n\n<b>            EXT. THE CITY - VARIOUS\n</b>\n\n            DRAKE's ROAR echoes through the canyons of downtown.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. LUNA PARK - NIGHT/DAY\n</b>\n\n            Time-lapse.  The sun rises over the decrepit amusement park.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - ARMORY - DAWN\n</b>            Sunlight slices down through skylights, bathing Blade, King,\n            Abigail, and Sommerfield in its warmth.  Zoe has joined them. \n            She's still cautious and shy, but she's also curious.\n\n\n<b>                                BLADE\n</b>                     Why wake up Drake now?\n\n\n<b>                                ABIGAIL\n</b>                     That's what we've been trying to figure\n                     out.\n\n\n<b>                                KING\n</b>                     When I was under the fang there used to be\n                     talk about some kind of vampire 'Final\n                     Solution'.  But I could never figure out\n                     why they'd want to destroy their food\n                     source.  I mean, seems stupid, right? \n                     They've always had plans for the human\n                     race.  Seems likely that whatever they're\n                     cooking up, Drake's return is a part of\n                     it.\n\n\n            Blade nods, pensive.\n\n\n<b>                                KING (CONT'D)\n</b>                     Let's face it, Blade -- we're fighting a\n                     losing battle. \n                     So we kill a few hundred of them a year. \n                     Big deal.  There are thousands of them out\n                     there.  Maybe tens of th'usands.  We need\n                     a new tactic.\n\n\n<b>                                BLADE\n</b>                     Like what?\n\n\n<b>                                SOMMERFIELD\n</b>                     A biological weapon.\n\n\n            Sommerfield moves to her Braille keyboard, types.\n\n\n<b>            ON A NEARBY MONITOR\n</b>\n\n            we SEE a real-time magnified view of a virus replicating.\n\n\n<b>                                SOMMERFIELD (CONT' D)\n</b>                     For the last year I've been~working with\n                     synthesized DNA in order to create an\n                     artificial virus targeted specifically at\n                     vampires.  We're calling it DayStar.\n\n\n<b>                                KING\n</b>                     Think about it, Blade.  We could wipe\n                     them all out in a single move.\n\n\n<b>                                BLADE\n</b>                     So what's been holding you back?\n\n\n<b>                                SOMMERFIELD\n</b>                          (sighing)\n                     We've tried it on a number of captive\n                     subjects.  We've got the disease vector\n                     worked out fine -- it's easily\n                     transmittable.  But the lethality in\n                     vampires is still spotty.\n\n\n<b>                                ABIGAIL\n</b>                     Bottom line is, we need a better DNA\n                     sample to work with.\n                          (beat)\n                     We need Dracula's blood.\n\n\n<b>                                SOMMERFIELD\n</b>                     Vampire DNA is a hodge-podge of different\n                     genes, mixed in with all sorts of useless\n                     junk DNA.  Because Dracula's the\n                     progenitor of the vampire race, his DNA is\n                     still pure.  It hasn't been diluted by a\n                     hundred generations of selective mutation. \n                     It still has all the necessary cellular\n                     compounds for the virus to code to.  We\n                     get his blood, we can boost Daystar's\n                     viral efficacy to a hundred percent.\n\n\n<b>                                KING\n</b>                     So.  You want to join our club?  Can we\n                     sign you up for a Nightstalkers secret\n                     decoder ring?\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. PHOENIX TOWERS - DAY\n</b>\n\n            Establishing.  The Sun at it's zenith\n\n\n<b>            INT. PHOENIX TOWERS - DRAKE'S QUARTERS - DAY\n</b>\n\n            A darkened room, relatively austere.  The only source of light\n            are a series of small, slitted skylights in the ceiling above. \n            From these skylights, narrow, blinding white shafts of\n            sunlight knife downward to penetrate the gloom.\n\n\n<b>            DRAKE\n</b>\n\n            sits in a chair, his body partially illuminated by one of the\n            sunlight shafts, his face turned upward into its brilliance.\n\n\n            FOOTSTEPS.  Drake opens his eyes, SEES Danica hovering in the\n            darkness, just on the edge of a shaft of light.\n\n\n<b>                                DRAKE\n</b>                     This world sickens me.  The humans have\n                     soiled it with their filth.\n\n\n<b>                                DANICA\n</b>                     We can raze their cities to the ground.\n                     We can bring the old world back.\n\n\n            Drake just stares at her, not convinced.\n\n\n<b>                                DRAKE\n</b>                     Come closer.\n\n\n<b>                                DANICA\n</b>                          (re: light)\n                     I can't.\n\n\n<b>                                DRAKE\n</b>                     And do you know why?\n                          (off Danica's silence)\n                     Once, all of my kind could brave the day. \n                     We were true predators.  The world was\n                     ours.  And then, somewhere along the way,\n                     the purity of our bloodline became\n                     diluted.  Polluted with human DNA.\n\n\n<b>                                DANICA\n</b>                     That's impossible --\n\n\n<b>                                DRAKE\n</b>                     Is it?\n\n\n            Drake stands, drawing close to Danica.  He grips her wrist --\n\n\n<b>                                DRAKE\n</b>                     You are bastard children.  No longer as\n                     pure as you pride yourselves on being.\n\n\n            -- and pulls her hand towards one of the sunlight shafts.  To\n            her credit, Danica keeps staring at Drake.  She'll be damned\n            if she will give him the satisfaction of seeing her break.\n\n\n            Drake pulls her hand closer to the light -- to the very edge. \n            And the tips of Danica's fingers begin to burn.  She winces,\n            clearly in agony --\n\n\n            -- and Drake releases her hand.  She cradles it against her\n            chest, blinking away tears that have welled up in her eyes.\n\n\n<b>                                DRAKE\n</b>                     My people.  How far you have fallen.\n\n\n            Drake reaches out, brushes a tear from Danica's cheek, then\n            turns and walks away -- through the alternating shafts of\n            sunlight and darkness.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - ARMORY - DAY\n</b>\n\n            Blade, King, and Abigail stand before a table where an\n            assortment of weaponry and ammunition has been laid out on\n            display.  Hedges is there too, assisting them.  Zoe watches.\n\n\n<b>                                HEDGES\n</b>                     We've got a wide assortment of ass-\n                     kickery for your viewing pleasure --\n                          (hefting a pistol)\n                     Electronic pistol.  Comes with a built-in\n                     fingerprint security system.  Fires a\n                     three-shot burst in 1/500th of a second.\n                     Bullets can also be triggered remotely.\n\n\n            King tosses Blade a bullet.  He studies it -- it's more\n            complex than a standard round.\n\n\n<b>                                BLADE\n</b>                     Explosive rounds?\n\n\n<b>                                KING\n</b>                     But with a concentrated burst of UV light\n                     instead of your standard hollow-points.  I\n                     call 'em sun dogs.\n                          (to Hedges)\n                     Hedges -- super-size me, baby!\n\n\n            Hedges tosses King one of the four-barreled firearms.  On the\n            stock is an irreverent decal of the mud-flap girl silhouette.\n\n\n<b>                                KING\n</b>                     This little mamacita -- a modified\n                     version of the Army's Objective\n                     Individual Combat Weapon.  Pick your\n                     poison -- stakes, sun dogs, heat-seeking\n                     mini-rockets.  Whatever gets you hard,\n                     this puppy will pump out.\n                          (gesturing to Blade's\n                          sword, sarcastic)\n                     Of course it doesn't have the range of a\n                     sword but --\n\n\n            Next, Hedges shows Blade the CRESCENT-SHAPED DEVICE that\n            Abigail used.  He gives the device a twist and --\n\n\n<b>                                HEDGES\n</b>                     We call this the UV arc --\n\n\n            CHINKT!  The device extends from either end, telescoping\n            outward.  Connecting the tips is a concentrated UV LASER.\n\n\n<b>                                HEDGES\n</b>                     You hold the arc in the center, curved\n                     away from you.  Connecting the tips is a\n                     powerful UV laser beam.  Because of its\n                     high focus, the laser cuts through vampire\n                     flesh like a knife through butter.\n\n\n<b>                                KING\n</b>                     We're still trying to sort out fact from\n                     fiction when it comes to Dracula.  Turning\n                     into mist?  Kinda doubt it.  But general\n                     shape-shifting?  Maybe.\n\n\n<b>                                HEDGES\n</b>                          (off Blade's look)\n                     Not into a bat or a wolf or anything like\n                     that.  But another human, someone with the\n                     same approximate body mass -- given enough\n                     practice it might be possible.\n\n\n<b>                                BLADE\n</b>                     How?\n\n\n<b>                                HEDGES\n</b>                     He wouldn't have a traditional skeletal\n                     structure.  Probably something more like a\n                     snake, with thousands of tiny bones in the\n                     place of a normal array.  Commensurate\n                     with this would be an exquisite control of\n                     electrical potential across his tissues,\n                     resulting in an ability to effectively\n                     change shape at will --\n\n\n<b>                                KING\n</b>                          (raising his hand)\n                     Question.  Have you ever been laid,\n                     Hedges?\n\n\n<b>            CUT TO:\n</b>\n\n<b>            INT. WAREHOUSE/GARAGE - DAY\n</b>\n\n            Blade, King, and Abigail, newly suited up for war, moving\n            towards the Land Cruiser.\n\n\n<b>                                BLADE\n</b>                     Time to apply some pressure.  The weak\n                     link in the vampire chain of command has\n                     always been their familiars.  Vampires\n                     can't go out in the day, so they get\n                     humans to do their dirty work for them\n                     Blood-running, safe house maintenance,\n                     whatever --\n                          (climbing in the Cruiser)\n                     We bleed the wanna-be vampires, they'll\n                     lead us to the real thing.\n\n\n            Blade starts the ENGINE.\n\n\n<b>            INT. LAND CRUISER - DAY\n</b>\n\n            Blade looks to Abigail, who sits in the back.  She has a\n            laptop on her knees and is assembling an MP3 playlist.\n\n\n<b>                                KING\n</b>                     She's making playlists.  Likes to listen\n                     to MP3s when she hunts.  Her own internal\n                     soundtrack, you know?  Dark-core, trip\n                     hop, whatever kids these days are\n                     listening to.  Me?   I'm more of a Kenny G\n                     fan.\n\n\n            Finished, Abigail slips her earbuds into her ears, turns on\n            her portable MP3 player.  MUSIC CUE.  The smoking bassline of\n            Jurassic 5's 'A Day At The Races' kicks in as --\n\n\n<b>            EXT. CITY STREETS - VARIOUS - DAY\n</b>\n\n            -- Blade, King, and Abigail cruise the streets in a jagged\n            fast-forward montage.\n\n\n<b>            EXT. SEEDY BAR - DAY\n</b>\n\n            The Land Cruiser jumps the curb, SCREECHING to a stop in front\n            of a scuzzy bar.  Amidst a wall covered with graffiti and\n            flyers we see a vampire glyph.\n\n\n<b>            INT. SEEDY BAR - DAY\n</b>\n\n            BANG!  Blade KICKS open the door.  A couple of LOW-LIFES take\n            notice.  Blade moves around the bar, opening a refrigerator -\n            we see packs of REFRIGERATED BLOOD inside.\n\n\n            One of the low-lifes takes off running, back past the\n            bathroom, shouldering a door at the rear --\n\n\n<b>            EXT. SEEDY BAR - REAR ENTRANCE - DAY\n</b>\n\n            --\tSTUMBLING right into Abigail's arms.  She trips him up,\n            swinging him around, pinning an arm behind him.  She pulls the\n            back of his collar down, sees a VAMPIRE GLYPH --\n\n\n            We can't hear what the familiar is saying, but he's squealing,\n            raising his hands in a \"please don't hit me anymore\" manner.\n\n\n<b>            EXT. CITY STREETS - VARIOUS - DAY\n</b>\n\n            The Land Cruiser rockets down the streets.\n\n\n<b>            EXT. VAMPIRE SAFE HOUSES - VARIOUS - DAY\n</b>\n\n            In quick succession we see a half-dozen underworld dives --\n\n\n            -- a pool hall --\n\n\n            -- an internet cafe --\n\n\n            -- an electronics repair shop --\n\n\n            All are fronts for vampire operations, featuring back rooms\n            with refrigerated blood and high-tech coffin-like beds where\n            the vampires can safely sleep through the day unmolested.\n\n\n            In each new location, Blade, King, and Abigail resort to\n            oldfashioned strong-arm tactics:\n\n\n            -- Blade HEAD-BUTTS a familiar.\n\n\n            -- King PUNCHES a familiar across the jaw.\n\n\n            -- Abigail KICKS a familiar in the stomach.\n\n\n            Cut to a flurry of EXTREME CLOSE-UPS of VAMPIRE GLYPHS being\n            exposed on the backs of familiar's necks, one after another --\n\n\n<b>            THEN A MONTAGE OF FACES\n</b>\n\n            as familiars have their heads cainfully SMASHED against --\n\n\n            -- walls --\n\n\n            -- car hoods --\n\n\n            -- pool tables --\n\n\n            -- into windows and doors and garbage cans.\n\n\n            The bullying moves come faster, the shots becoming more and\n\n\n            more abstract until --\n\n\n<b>            EXT. CITY ROOFTOP - DAY\n</b>\n\n            -- WHAM!  Blade tosses HOOP, a skinny familiar, off a roof. \n            It's a four story drop.  Hoop falls, SCREAMING -- but then\n            jerks to a stop about twenty feet down, dangling upside down.\n\n\n            We see now that Hoop has rope tied around one of Hoop's\n            ankles.  And Blade is clutching the other end of the rope.\n\n\n            Blade hauls Hoop back up -- but still keeps him dangling\n            upside down.  King and Abigail look on.\n\n\n<b>                                BLADE\n</b>                     Want another spin, ass-hole?  Eventually,\n                     your head's gonna pop off.\n\n\n<b>                                HOOP\n</b>                     Shit!  Oh Jesus, please, please --\n\n\n<b>                                BLADE\n</b>                     Who's your handler?\n\n\n<b>                                HOOP\n</b>                     I don't know his name, I swear I --\n\n\n            Blade prepares to drop Hoop again --\n\n\n            -- but a CELL PHONE in Hoop's jacket RINGS.  Blade fishes it\n            out.  The screen reads:  EDGAR VANCE, 555-5631.\n\n\n<b>            EXT. CITY STREET - DAY\n</b>\n\n            Dr. Vance, the psychiatrist who gave Blade the mental\n            evaluation, is cruising in his Pacific Blue XKB convertible\n            Jaguar.  He's wearing sunglasses, talking on his cell phone.\n\n\n<b>                                VANCE\n</b>                     This is Dr. Vance.  Did someone page me?\n\n\n<b>            EXT.  CITY ROOFTOP - DAY\n</b>\n\n            Blade ends the call, then looks to Hoop, smiling cruelly.\n\n\n            Blade lets Hoop drop.  The familiar PLUNGES four stories,\n            SCREAMING.  Lands dead-center in a Goodwill box below.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. VANCE INSTITUTE FOR WHOLE BEING - DAY\n</b>\n\n            A high-tech office complex surrounded by meticulously-groomed\n            grounds.  A sign with a swanky \"VANCE INSTITUTE\" logo zooms.\n\n\n            Blade, King, and Abigail approach, taking note of Vance's\n            Jaguar (complete with vanity plate), parked in front.\n\n\n<b>                                KING\n</b>                     Hey, Blade -- why didn't the vampire bite\n                     Mick Jagger?\n                          (off Blade's look)\n                     Cause you can't get blood from a Stone.\n\n\n            As Blade walks off --\n\n\n<b>                                KING (CONT'D)\n</b>                     Hey, they can't all be gems!\n\n\n<b>            INT. VANCE INSTITUTE FOR WHOLE BEING - LOBBY - DAY\n</b>\n\n            The trio enter, drawing stares from a number of PATIENTS\n            gathered in a reception area.  Nearby is a large display with\n            Vance's grinning face.  Beneath it, text reads:\n\n\n<b>                                  EDGAR VANCE, M.D.\n</b>\n\n<b>                      PRESIDENT, VANCE INSTITUTE FOR WHOLE BEING\n</b>\n\n            Nearby is a bank of monitors showing a snazzy video featuring\n            a BEAUTIFUL YOUNG COUPLE marvelling at a sunrise.\n\n\n<b>                                NARRATOR\n</b>                          (on monitors)\n                     Regain control of your life.   Wake to a\n                     new dawn.  At the Vance Institute for\n                     Whole Being we believe in an integrated\n                     approach to human health.\n\n\n            The image cuts to Vance himself, poised on the edge of his\n            desk, smiling.  As Blade and company move through the\n            institute, the video plays counterpoint to their progress.\n\n\n<b>                                VANCE\n</b>                     I'm Dr. Vance.  Welcome to our facility.\n                     As a member of the medical profession I\n                     want to assure you that I will do\n                     everything in my power ro provide you with\n                     the care and compassion that you deserve.\n\n\n            Past the RECEPTION DESK are the elevators with more monitors\n            showing the video greeting.  As Blade, King, and Abigail\n            approach, TWO SECURITY GUARDS move to intercept them.\n\n\n<b>                                SECURITY GUARD\n</b>                     Excuse me, can I help y--\n\n\n            CRACK!  Blade effortlessly tosses the guards aside, sending\n            them CRASHING into the nearest monitors.\n\n\n<b>            INT. VANCE INSTITUTE - HALLWAY - CONTINUOUS\n</b>\n\n            The trio continue.  A DOCTOR steps out of a doorway.  King\n            PUNCHES him in the face.  We see another video monitor.\n\n\n<b>                                VANCE\n</b>                     What does it mean to be human?  Since the\n                     dawn of creation our ancestors have asked\n                     ourselves that question.\n\n\n            They round the corner --\n\n\n<b>            INT. VANCE INSTITUTE - SECOND HALLWAY - CONTINUOUS\n</b>\n\n            -- nearly colliding with TWO MORE SECURITY GUARDS.  Blade\n            takes them both out.  There's another video monitor.\n\n\n<b>                                VANCE\n</b>                     The modern world today is filled with\n                     countless challenges.  In every direction\n                     we look, toxic stressors are impacting\n                     upon our happiness.  We think we're\n                     healthy, but the truth is, our immune\n                     systems are engaged in a life or death\n                     struggle to maintain our well being.\n\n\n<b>            INT. VANCE INSTITUTE - OUTER OFFICE - CONTINUOUS\n</b>\n\n            Blade, King, and Abigail storm in.  An EXECUTIVE ASSISTANT is\n            moving to stop them.\n\n\n<b>                                EXECUTIVE ASSISTANT\n</b>                     I'm sorry but you can't --\n\n\n            Abigail KICKS out the man's knee, then slices her hand into\n            his windpipe, silencing him.\n\n\n<b>                                VANCE\n</b>                     Now, I'd like to take a moment to exolain\n                     how a series of remarkable new\n                     breakthroughs can immeasurably improve the\n                     quality of your life\n\n\n            Blade aims his shotgun at the door leading to Vance's office.\n            He FIRES at the keycard lock, KICKS down the door --\n\n\n<b>            INT. VANCE INSTITUTE - VANCE'S OFFICE - DAY\n</b>\n\n            --\tstartling Dr. Vance himself, who is rising up from behind\n            his desk.  Vance is wiping his mouth, not dressed like a\n            doctor would normally be.  But we hardly notice this as --\n\n\n<b>                                VANCE\n</b>                     What --?\n\n\n<b>                                BLADE\n</b>                     Payback, Vance.\n\n\n            --\tBlade aims his shotgun at Vance's head.  Vance just\n            smiles, seemingly unconcerned as --\n\n\n            --\tAbigail circles around the other side, getting a view\n            behind Vance's desk where --\n\n\n<b>            VANCE'S BODY\n</b>\n\n            lies on the floor.  His throat has been ripped out.  And this\n            body is dressed like a doctor.\n\n\n            King puts it together first, reaching for a silver stake even\n            as we hear the sound of POPPING CARTILAGE coming from beneath\n            the Vance double's flesh --\n\n\n<b>                                KING\n</b>                     Jesus, it's him!  It's Drake!\n\n\n            The Vance double jumps atop the desk and swats the muzzle of\n            Blade's shotgun aside, re-directing the BLAST, which SHATTERS\n            a glass window.  Then he KICKS Blade in the chest, KNOCKING\n            him clear across the office as --\n\n\n            --\tKing advances.  The Vance double's face WARPS, the bones\n            in his head shifting around.  He reaches for King, SLAMS him\n            onto the desk, TWISTS the stake from King's hand and brutally\n            SHOVING it into King's rib cage, pinning him to the desk top.\n\n\n            Then the Vance double whirls around to engage Abigail -- only\n            we see that it's Drake now, having taken Vance's shape.\n\n\n<b>            DRAKE\n</b>\n\n            BACK-HANDS Abigail across the face, a teeth-jarring blow.\n\n\n            She spins, falling --\n\n\n            -- and Drake is moving like a hurricane, LEAPING through the\n            window that was shattered by Blade's shotgun blast.\n\n\n<b>            BLADE\n</b>\n\n            gives chase.  He looks out the window, SEES Drake landing on\n            the ground, some three stories below.\n\n\n<b>            EXT. VANCE INSTITUTE - REAR ENTRANCE - ALLEY - DAY\n</b>\n\n            Drake runs with inhuman speed.  He effortlessly scales a chain\n            link fence, then BARRELS straight through a wooden barricade,\n            sailing over a trash dumpster.  Seconds later, Blade follows,\n            catching sight of Drake rushing out into --\n\n\n<b>            EXT. STREET MARKET - VARIOUS - DAY\n</b>\n\n            -- a crowded urban market.  What unfolds is a foot-chase at\n            super-human velocity.  Vampire and hunter are moving at least\n            twenty miles an hour, BATTERING ASIDE various pedestrians,\n            SMASHING through and over stalls of merchandise.\n\n\n<b>            EXT. BUSY STREET - DAY\n</b>\n\n            Drake emerges onto the sidewalk of a busy street, four lanes\n            of rush-hour traffic WHIZZING PAST.\n\n\n            Abruptly, Drake cuts into the traffic, LEAPING atop the hood\n            of an oncoming car.  The car's HORN sounds, brakes SQUEAL.\n\n\n<b>                                BLADE FOLLOWS,\n</b>                     jumping onto the hood of another car. More\n                     HORNS sound.\n\n\n            In this manner. Drake and Blade race across the flowing\n            traffic itself. using the hoods and roofs of the cars like\n            moving stepping stones.\n\n\n<b>            ON THE OTHER SIDE OF THE STREET\n</b>\n\n            Drake mounts the steps of an older apartment building,\n            THUNDERS his way through the main entrance --\n\n\n<b>            INT. OLDER BUILDING - STAIRWELL/CORRIDOR - DAY\n</b>\n\n            Blade is on Drake like a shadow.  We're internal now, the\n            sound of Blade's LABORED BREATH moving to the foreground of\n            the soundscape.\n\n\n            Chaos.  A BARKING DOG darting from a doorway.  Up ahead, an\n            OLD MAN has been knocked over.  An insane dash up two flights\n            of stairs, then down a corridor, passing MORE TENANTS. \n            Somewhere, a WOMAN SCREAMS.  We hear GLASS BREAKING and --\n\n\n<b>                                WOMAN\n</b>                     My baby\n\n\n            -- there's another open door --\n\n\n<b>            INT. OLDER BUILDING - APARTMENT - DAY\n</b>\n\n            -- Blade tears into an apartment, passing a HYSTERICAL WOMAN,\n            an upended crib.  He SEES a broken window by a fire escape --\n\n\n<b>            EXT. OLDER BUILDING - FIRE ESCAPE - DAY\n</b>\n\n            Cut onto the fire escape.  A glimpse of Drake overhead.\n\n\n            Blade clambers up the fire escape, moving in a near-blur.  One\n            story of steps up the rickety metal ladder --\n\n\n            SMASH!  A LARGE PLANTER comes down from above, nearly striking\n            Blade.  He lets go with one hand, swings outward --\n\n\n            -- then he's climbing again.  A CLOUD OF PIGEONS take wing,\n            flapping frenetically about him, momentarily blinding him.\n\n\n            Another story, a third, a fourth.  As he reaches the top,\n            Blade jumps, catching the edge of the roof above him --\n\n\n<b>            EXT. OLDER BUILDING - ROOFTOP - DAY\n</b>\n\n            -- FLIPPING himself over and onto the roof.  He lands in a cat\n            stance, drawing his sword, quickly scanning the area.\n\n\n<b>                                DRAKE (O.S.)\n</b>                     So you're the hunter they all fear.\n\n\n            Blade spins --\n\n\n<b>            DRAKE\n</b>\n\n            stands on the ledge of the roof, cradling an INFANT in his\n            arms.  In the full glare of the afternoon sun.\n\n\n<b>                                DRAKE\n</b>                          (re: infant)\n                     Just so we understand each other,\n                     Daywalker.\n\n\n            With his free hand, he massages his jaw.  We hear a few more\n            Pieces of POPPING CARTKAGE as the very last of Drake's\n            cermanent features seem to settee into clace.\n\n\n<b>                                BLADE\n</b>                     Why did you kill Vance?\n\n\n<b>                                DRAKE\n</b>                     He'd outlived his purpose.  He'd become a\n                     liabi1ity.\n\n\n            Drake nods at Blade's sword --\n\n\n<b>                                DRAKE\n</b>                     Your sword -- I've seen that hilt before. \n                     Eight or nine centuries ago.  The hunter\n                     who carried it was an accomplished\n                     fighter.\n\n\n<b>            EXT. SEASIDE CLIFF - DAY (THE PAST)\n</b>\n\n            Drake in his armor, head to head with a 14th century VAMPIRE\n            HUNTER.  The hunter has BLADE'S SWORD.  Drake tears the sword\n            from the hunter's grasp, turns it around, thrusts it back\n            through the man's chest.  And as the man GASPS we are --\n\n\n<b>            EXT. OLDER BUILDING - ROOFTOP - DAY (THE PRESENT)\n</b>\n\n            -- back to here and now.\n\n\n<b>                                DRAKE\n</b>                     He was honorable, in his own way.  He\n                     died a good death.\n\n\n<b>                                BLADE\n</b>                     I wouldn't know about that.\n\n\n<b>                                DRAKE\n</b>                     You lie.  You're part of a grand\n                     tradition, Blade.  You hunters have\n                     plagued my people since the day we first\n                     walked the earth.  And I have vanquished\n                     them.  One by one.\n\n\n            Blade pauses, looking for some kind of opening.\n\n\n<b>                                BLADE\n</b>                     How can you exist in the daylight?\n\n\n<b>                                DRAKE\n</b>                     I've always been able to.  Haven't you\n                     read Mr. Stoker's fable?  I was the first\n                     of the vampires.  I am unique.\n\n\n<b>                                BLADE\n</b>                          (realizing)\n                     That's why they brought you back.\n\n\n<b>                                DRAKE\n</b>                     Yes.  My children seek to isolate the\n                     properties in my blood that make me immune\n                     to sunlight.  Through me, they believe\n                     they can all become Daywalkers.\n\n\n            Drake glances down at the street people.  Throngs of PEOPLE\n            are massing there, pointing up at him.\n\n\n<b>                                DRAKE\n</b>                     The world's changed much since I went to\n                     sleep.  How crowded it's become.  Look at\n                     them down there.  Lives brief as\n                     fireflies.  Do you think they can ever\n                     grasp what it means to be immortal like\n                     us?\n\n\n<b>                                BLADE\n</b>                     You're not immortal.  I must've heard a\n                     hundred of you people make the same claim. \n                     And every one of them's seen the end of my\n                     sword.\n\n\n            Drake smiles, intrigued by an obviously worthy opponent.\n\n\n<b>                                DRAKE\n</b>                     Perhaps I will as well, then.  But I think\n                     it's more likely that you will fall before\n                     mine.\n                          (beat)\n                     Catch.\n\n\n            Drake tosses the infant at Blade.  Blade twists around to\n            catch it, scooping it safely up.  But when he looks back --\n\n\n            -- Drake is gone.\n\n\n<b>                                KING (O.S.)\n</b>                     Shit!\n\n\n<b>            INT. VANCE INSTITUTE - VANCE'S OFFICE - DAY\n</b>\n\n            CLOSE ON King being propped up against the wall by Abigail.\n            Blade has joined them.  King is in terrible pain.\n\n\n<b>                                KING\n</b>                     Jesus, it hurts.  I wanna be a vampire\n                     again -- fuck!  Did you see that guy?!\n                     We're gonna lose, man.  We're gonna\n                     fucking lose.\n\n\n            Abigail ignores King, cuts open his shirt.  She removes a\n            small aerosol cannister from her belt.\n\n\n<b>                                BLADE\n</b>                     What's that?\n\n\n<b>                                ABIGAIL\n</b>                     Fibrin sealant foam, it's an elastic\n                     protein.  Help me spread the wound open.\n                     The foam should seal the hemorrhaging in\n                     his body cavity from within --\n\n\n            Together they spread the wound apart.  King is really hurting,\n            breathing hard as he tries to fight back the pain.\n\n\n<b>                                KING\n</b>                     Hey, hey -- what'd the one lesbian\n                     vampire say to the other?\n\n\n<b>                                ABIGAIL\n</b>                     Shut up, King.\n\n\n<b>                                KING\n</b>                     -- see you in twenty-eight days --\n\n\n            King's voice trails off as he passes out.  Abigail triggers\n            the dispenser, spraying a jet of compressed foam into it.  The\n            foam condenses, sealing the wound up.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - DAY\n</b>\n\n            Blade and Abigail enter the HQ, hauling King between them. \n            Dex and Hedges rush to meet them, relieving them of King.\n\n\n            Exhausted and covered in blood, Abigail retires to her\n            quarters, stripping off her clothes.\n\n\n<b>            INT. NIGHTSTALKERS' HEADQUARTERS - SHOWERS - DAY\n</b>\n\n            Abigail stands beneath (he showerhead, turning her face up\n            into the scalding spray, rinsing the blood from her body.\n\n\n            CLOSE ON the drain by her feet, BLOOD swirling down it.  \n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - INFIRMARY - DAY\n</b>\n\n            King drowses on a cot.  His shirt is off and his chest has\n            been bandaged.  He opens his eyes, SEES Blade above him.\n\n\n<b>                                KING\n</b>                     Hey, Blade -- say we're successful.  Say\n                     we wipe the vampires out.  What happens\n                     then?  You ever ask yourself that?\n                          (weakly)\n                     Somehow I don't picture you parked on a\n                     porch with a jigsaw puzzle.\n\n\n            King drifts back into unconsciousness again, leaving Blade\n            left to ponder his words.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - LABORATORY AREA - DAY\n</b>\n\n            Later, Sommerfield and Hedges consult with Blade and Abigail.\n\n\n<b>                                HEDGES\n</b>                     So basically we're in an arms race.\n                     They're using Drake's DNA to build\n                     themselves a better vampire --\n\n\n<b>                                BLADE\n</b>                          (noddin)\n                     -- and we need his blood to kill them.\n                          (to Sommerfield)\n                     How's this weapon of yours coming along?\n\n\n<b>                                SODDERFIELD\n</b>                     We're almost there --\n\n\n            She gestures to a series of ampule-like prototypes.  (We'll\n            see the completed version of this device later on.)\n\n\n<b>                                SOMMERFIELD\n</b>                     The virus is harmless to humans.  So we\n                     decided to go after the vampires' food\n                     source.  The one thing we know for sure\n                     about vampires is that they have to drink\n                     blood. \n                     If we manage to pull this off, we'll be\n                     able to contaminate every blood source on\n                     the planet.  They won't have anyone left\n                     to feed on.\n\n\n<b>                                ABIGAIL\n</b>                     Doesn't do us any good if we don't have\n                     time to finish it.  We can't just sit\n                     here.  We need to take the battle to them.\n\n\n            Sommerfield lowers her head, thinking.\n\n\n<b>                                SOMMERFIELD\n</b>                     If the vampires are trying to isolate the\n                     hereditary factor in Drake that makes him\n                     immune to sunlight, they'll require\n                     certain kinds of laboratory equipment and\n                     provisions.  For instance, there's an\n                     enzyme called Taq Polymerase.  And there\n                     are only a limited number of suppliers.\n                          (beat)\n                     Give me a few hours.  I'll see if I can't\n                     hunt us up some leads.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            Moving towards the mirrored windows we hear LABORED BREATHING.\n\n\n<b>            INT. PHOENIX TOWERS - DRAKE'S QUARTERS - NIGHT\n</b>\n\n            CLOSE ON hands clasped together -- a man and a woman's.\n\n\n            CLOSE ON Danica' s face, covered in sweat, in the throes of\n            passion.  She looks up, eyes glazed --\n\n\n            PULL BACK to reveal Drake, propped above her, thrusting away.\n            Danica has her limbs wrapped around Drake, holding on for dear\n            life.  Both are awash in moonlight.\n\n\n            The two of them climax.  Drake withdraws, studying Danica. \n            She's naked but for the tiny silver crucifix she wears around\n            her neck.  Drake nudges the crucifix with his finger.\n\n\n<b>                                DRAKE\n</b>                     Why do you wear that -- symbol?\n\n\n<b>                                DANICA\n</b>                          (defensive)\n                     Old habits --\n\n\n            She sits up, draping a sheet over her.\n\n\n<b>                                DANICA\n</b>                     I was a good Catholic school girl\tOnce.\n\n\n            Drake nods, his thoughts distant.\n\n\n<b>                                DRAKE\n</b>                     I was there when they crucified him.  He\n                     died -- for their sins, not mine.\n\n\n<b>                                DANICA\n</b>                          (playful1y)\n                     And what are your sins?  Would you care\n                     to confess them?\n\n\n<b>                                DRAKE\n</b>                          (shaking his head)\n                     Too numerous to remember.\n                          (nodding at the crucifix)\n                     Take it off.\n\n\n<b>                                DANICA\n</b>                     Why?\n\n\n<b>                                DRAKE\n</b>                     I'll make you a better one.\n\n\n            Drake draws her in, biting her gently on the neck, sinking his\n            fangs into her flesh.  He pulls his head back.  Two rivulets\n            of BLOOD trickle from the fresh wounds.\n\n\n<b>                                DRAKE\n</b>                     There's an old saying --\n\n\n            Drake reaches for the sheet, pulling it away from Danica's\n            chest.  Then he dips his fingertips into her flowing blood -\n            PAINTING a long streak of it down between her breasts.\n\n\n<b>                                DRAKE\n</b>                     Kill one man, you're a murderer. Kill a\n                     million, a king.\n                          (smiling)\n                     Kill them all, a God.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - STORAGE AREA - NIGHT\n</b>\n\n            CLOSE ON a pneumatic injector.  PULL BACK to reveal Blade\n            injecting himself with his serum.  No pain.  No violent spasms\n            like before.  Blade's body now accepts the serum.\n\n\n<b>            ANGLE ON ZOE,\n</b>\n\n            crouched on an old piece of carny equipment, watching him.\n\n\n<b>                                ZOE\n</b>                     Why do you do that?\n\n\n<b>                                BLADE\n</b>                     There's something bad inside of me.  This\n                     keeps it from getting out.\n\n\n            Zee considers this.\n\n\n<b>                                ZOE\n</b>                     Why can't you just be nice?\n\n\n\n<b>                                BLADE\n</b>                     Good question.\n\n\n<b>                                SOMMERFIELD (0.S.)\n</b>                     I think I've got a lead.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - LABORATORY AREA - NGHT\n</b>\n\n            Sommerfield stands at her computers, reading a tactile Braille\n            display.  Blade and Abigail are nearby.\n\n\n<b>                                SOMMERFIELD\n</b>                     Biomedica Enterprises.  They've been\n                     buying up all sorts of supplies -- Taq\n                     polymerase, bone marrow growth supplement,\n                     genetic sequencing enzymes.\n\n\n<b>                                BLADE\n</b>                     We'll check it out.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            EXT. BIOMEDICA ENTERPRISES - NIGHT\n</b>\n\n            A high-tech research park.\n\n\n<b>            INT. BIOMEDICA ENTERPRISES - LAB - NIGHT\n</b>\n\n            Hendrix, the vampire doctor we saw earlier, sits at a computer\n            workstation.  Chief Vreede confers with him.  We hear a KNOCK\n            at the door.  Hendrix looks to Vreede.  They obviously weren't\n            expecting anyone.\n\n\n            Hendrix moves to the door, checking a surveillance monitor. \n            He can't see anyone outside.  He shrugs, turns to leave and --\n\n\n            CRUNCH!  The door is SMASHED inward, taking much of the door\n            frame with it, flattening Hendrix.\n\n\n            Blade and Abigail step inside.  As Blade hauls Hendrix up from\n            the ground, Abigail points her already drawn gun at --\n\n\n<b>            CHIEF VREEDE\n</b>\n\n            He was reaching into his jacket for his own piece, now thinks\n            better of it.\n\n\n<b>                                BLADE\n</b>                     Doing a little moonlighting, Chief?\n\n\n            Blade nods to Abigail.  She reaches onto Vreede's jacket to\n            disarm him.  Blade grips Hendrix by the shirt collar.\n\n\n<b>                                BLADE\n</b>                     C'mere.  We need to talk.\n\n\n            Blade PUNCHES Hendrix in the face.  Hendrix sags for a moment,\n            stunned.\n\n\n<b>                                BLADE\n</b>                     Now spill it, bite-boy.\n\n\n<b>                                HENDRIX\n</b>                          (wiping a bloody nose)\n                     You know what we're doing.  Drake has come\n                     back to us.  Soon we'll all be Daywalkers.\n                     And when that day comes, the world will\n                     truly be ours.\n\n\n            Blade nods towards the back of the lab where another door -- a\n            very secure one -- is located.\n\n\n<b>                                BLADE\n</b>                     What's back there?\n\n\n            Hendrix shoots a quick look to Vreede.  Then he turns on\n            Blade, all fangs and claws, trying to tear Blade's eyes out --\n\n\n            Abigail FIRES her UV gun with blinding speed and --\n\n\n            -- Hendrix is dead before he knows it.  ASHING all over Blade.\n\n\n            Blade brushes Hendrix' s remains from coat collar, shoots\n            Abigail a look:  \"Did you really have to do that?\"\n\n\n<b>                                BLADE\n</b>                          (dryly)\n                     Thanks.\n\n\n            Abigail cringes.  Mea culpa.\n\n\n            Blade looks to the floor.  Aside from some cinders, all that\n            remains of Hendrix are his glasses and a singed keycard. \n            Blade picks up the keycard, looks to Vreede.\n\n\n<b>                                BLADE\n</b>                     What's behind Door Number One?\n\n\n<b>                                VREEDE\n</b>                     They'll kill me --\n\n\n<b>                                BLADE\n</b>                          (an evil grin)\n                     So will I.  But I'll enjoy it more.\n\n\n            Vreede nods.  They move towards the door.  Blade slides the\n            security card.  An inset light changes from RED to GREEN. \n            Vreede punches in a numeric code.  The doors slide open --\n\n\n<b>            INT. BLOOD FARMING FACILITY - MAIN ROOM - NIGHT\n</b>\n\n            Blade, Abigail, and Vreede emerge into a cavernous room.\n\n\n<b>                                ABIGAIL\n</b>                     God in Heaven --\n\n\n<b>            HUNDREDS OF HUMAN CADAVERS\n</b>\n\n            hang from gantries, preserved in fluid-filled pods, suspended\n            by wires like nightmarish marionettes.  The bodies are hooked\n            up to an elaborate system of biosensor feeds and IVs which are\n            designed to replenish vital nutrients.\n\n\n<b>                                BLADE\n</b>                     What was this place?\n\n\n            Vreede pauses before answering, looking uncomfortable.\n\n\n<b>                                VREEDE\n</b>                     It's a blood farming facility.\n                          (elaborating)\n                     They decided that hunting humans on a\n                     piece-meal basis was too inefficient. \n                     Why kill your prey when you can keep them\n                     alive?  Productive.  Under optimal\n                     conditions a donor can generate anywhere\n                     from fifty to a hundred pints of blood a\n                     year.\n\n\n<b>                                ABIGAIL\n</b>                          (sickened)\n                     But where did you get all these people?\n\n\n<b>                                VREEDE\n</b>                     The streets.  In any given year you've got\n                     two to three million homeless people\n                     wandering around America --\n                          (shrugging)\n                     No one cares about them.  We're doing the\n                     country a service, really.\n\n\n            Blade shakes his head, admiring the horrible efficiency.\n\n\n<b>                                BLADE\n</b>                     The vampire Final Solution.\n\n\n            Abigail moves towards one of the pods, touching her hand to\n            the glass, studyihg the comatose person within.\n\n\n<b>                                ABIGAIL\n</b>                     Are they aware?  Do they feel anything?\n\n\n<b>                                VREEDE\n</b>                          (shaking his head)\n                     They're in a chemical-induced coma.\n                     They're brain-dead, vegetables.\n\n\n            Blade angrily SLAMS Vreede's face against one of the pods.\n\n\n<b>                                BLADE\n</b>                     Look at this!  Is this the future you\n                     want?  You think there's a place for you\n                     in their world?\n\n\n            Vreede starts crying, blubbering.\n\n\n<b>                                VREEDE\n</b>                     We don't have a choice!  They're going to\n                     win, don't you see that?!  He's come back!\n                     There's nothing stopping them now!\n\n\n            Blade pulls Vreede back so they're nose to nose --\n\n\n<b>                                BLADE\n</b>                     There's me.\n\n\n            -- and Blade releases Vreede.\n\n\n<b>                                BLADE\n</b>                     Go.  You've got thirty seconds.\n\n\n            Vreede turns and runs, stumbling towards the door.  Despite\n            his promise, Blade lifts his MACH.  Without even looking in\n            Vreede's direction, Blade FIRES.  We hear Vreede drop.\n\n\n            Blade turns to Abigail.  She can hardly contain herself.\n            Nearby is a control console.  Blade UNLOADS his MACH pistol\n            into it, damaging the interlinked life support systems.\n\n\n            One by one, the vital signs and EKGs on the pods flat-line,\n            their warning tones rising into a collective, PIERCING WAIL.\n\n\n<b>                                BLADE (CONT'D)\n</b>                          (feeling a heavy weight)\n                     Let's go.\n\n\n            Blade and Abigail leave, turning the lights out as they go.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - STORAGE AREA - NIGHT\n</b>\n\n            A basketball hoop has been set up in the back area and Dex and\n            Hedges are engaged in a wicked game of one-on-one.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - LABORATORY AREA - NIGHT\n</b>\n\n            Scm~erfield works, refining the virus.  Because she is blind,\n            she doesn't need light.\n            H er computer's voice synthesis program has been activated and\n            it's currently reading the various statistics that appear on\n            her main monitor.\n\n\n<b>                                COMPUTER\n</b><b>                     CYTOGENETICS AUDIT DATA FROM -- AUGUST\n</b><b>                     FIFTEENTH, TWO-THOUSAND AND FOUR.\n</b>                          (beat)\n<b>                     AMNIOTIC FLUIDS -- INPUT DELAY/ZERO.\n</b><b>                     ABNORMAL SAMPLES/TWO. BANDING\n</b><b>                     QUALITY/SEVEN-POINT-TWO --\n</b>\n\n            At the same time, Sommerfield is reading aloud to Zoe, who\n            sits nearby.  The book is The Emerald City of Oz and it's in\n            Braille.  Sommerfield scans with her fingers.\n\n\n<b>                                SOMMERFIELD\n</b>                     'The reason most people are bad is because\n                     they do not try to be good.  Now, the Nome\n                     King had never tried to be good, so he was\n                     very bad indeed.  Having decided to\n                     conquer the Land of Oz and to destroy the\n                     Emerald City and enslave all its people,\n                     King Roquat the Red kept planning ways to\n                     do this dreadful thing, and the more he\n                     planned the more he believed he would be\n                     able to accomplish it --'\n\n\n<b>                                COMPUTER\n</b><b>                     CYTOGENETICS AUDIT DATA FROM -- AUGUST\n</b><b>                     FIFTEENTH, TWO-THOUSAND AND FOUR.\n</b>\n\n<b>            ANGLE ON A BANK OF SURVEILLANCE MONITORS\n</b>\n\n            We see Whistler approaching through the garage.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            The steel door slides open and Whistler enters.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - INFIRMARY AREA - NIGHT\n</b>\n\n            King drowses on a cot.  He hears a NOISE, opens his eyes.\n            Whistler stands in the doorway.\n\n\n<b>                                KING\n</b>                     You get me those Fruit Roll-ups like I\n                     asked --\n                          (surprised)\n                     Dude.  Aren't you dead?\n\n\n            Whistler doesn't respond.  King tries to sit up -- but\n            Whistler places his hand on King's mouth, shoving him down,\n            starting to smother him.  King struggles, confused.\n\n\n<b>            INT. NGHTSTALKERS HEADQUARTERS - STORAGE AREA - NIGHT\n</b>\n\n            Dex manages to steal the ball from Hedges, makes a shot. \n            Behind them, Whistler enters the makeshift court.\n\n\n<b>    130     INT. NIGHTSTALKERS HEADQUARTERS - LABORATORY AREA - NIGHT130\n</b>\n\n            Abruptly, the sounds of the one-on-one game stop.  We hear a\n            THUD from the back of the warehouse -- like someone falling.\n\n\n<b>                                COMPUTER\n</b><b>                     BLOODS -- INPUT DELAY/ZERO. ABNORMAL\n</b><b>                     SAMPLES/SEVEN. BANDING QUALITY/EIGHT-\n</b><b>                     POINT-ONE --\n</b>\n\n            Sommerfield looks to the storage area.  The silence is\n            unnerving.  She turns off her voice-synthesis program.  Then\n            closes the book.\n\n\n<b>                                SOMMERFIELD\n</b>                     Guys?  You okay --?\n\n\n<b>            ON THE DOORWAY\n</b>\n\n            The basketball comes bouncing out.  It rolls, coming to rest\n            against a workbench.  There are BLOOD SPATTERS on the ball.\n\n\n            Sommefrield reaches for her cane.  She TAP-TAPS her way to the\n            baLl, feels the blood.  Knows what it is.\n\n\n<b>                                SOMMERFIELD\n</b>                     Zoe, go find some place to hide, sweety.\n\n\n            Zoe hesitates.  Sommerfield senses it and lashes out with her\n            cane, BANGING a rack of equipment, startling the girl.\n\n\n<b>                                SOMMERFIELD\n</b>                     Damnit, go!  Get out of here, Zoe!\n\n\n            The girl scurries away.  Sommerfield TAP-TAPS with her cane,\n            moving towards the storage area.  She finds a gun cabinet,\n            feels around with her hands, locates an electronic pistol.\n\n\n<b>            INT. NGHTSTALKERS HEADQUARTERS - STORAGE AREA - NIGHT\n</b>\n\n            Sommerfield enters.  Dex and Hedges are sprawled on the floor\n            before her, having been slaughtered.  Blood is everywnere. \n            She doesn't see them, of course.  But we do.\n\n\n<b>            THE CAMERA SHIFTS AROUND,\n</b>\n\n            revealing Whistler crouched right behind her!\n\n\n            She's unaware of his presence.  And as we watch, his facial\n            features shift.  We hear the sickening sounds of CARTILAGE\n            POPPING and we realize that it's Drake, not Whistler.\n\n\n            With mounting dread, Sommerfield turns towards the sound.  And\n            then Drake is upon her, rushing forward with a GROWL.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - BATHROOM - NIGHT\n</b>\n\n            As Sommerfield's AGONIZED SCREAMS echo through the warehouse,\n            Zoe rushes into the bathroom, looking for a place to hide. She\n            considers the lockers, discounts them.  Then settles on --\n\n\n<b>            A HEATING GRATE\n</b>\n\n            near the floor.  It's about fourteen inches wide -- just\n            barely big enough for her to squeeze into.\n\n\n            Zoe kneels, prying the grate off.  Inside, a heating duct\n            extends four feet before making a ninety-degree turn upward.\n            Zoe climbs into the duct feet first, scooting her body\n            backwards.  Then she reaches for the grate, securing it back\n            on, sealing herself inside.\n\n\n<b>            INT. HEATING DUCT - NIGHT\n</b>\n\n            Zoe waits.  It's cramped and claustrophobic inside the duct. \n            She's managed to force herself all the way back to the ninety\n            degree turn by curling up into a near fetal position.\n\n\n<b>            ZOE'S POV (THROUGH GRATE)\n</b>\n\n            Mostly tile floor and a small portion of the open doorway\n            leading to the hallway outside.\n\n\n            She listens, trying to hear past the sound of her own\n\n\n            BREATHING which has been magnified because of the ducting.\n\n\n            The screams from the outer rooms have stopped.  Then --\n\n\n<b>            ZOE'S POV (THROUGH GRATE)\n</b>\n\n            A pair of boots appear in the doorway -- Drake.\n\n\n            Zoe holds her breath.  We HEAR Drake searching the bathroom,\n            opening the lockers and bathroom stalls.\n\n\n<b>                                ZOE'S POV (THROUGH GRATE)\n</b>                     Drake's boot-clad feet pass by the grate\n                     again, closer, tn~s time. They pause for\n                     an interminable moment --\n\n\n            Zoe shuts her eyes.  She can't stand it.  Finally, we hear\n            Drake's FOOTSTEPS receding away.  Relieved, Zoe takes in a\n            breath and opens her eyes --\n\n\n<b>            ZOE'S POV (THROUGH GRATE)\n</b>\n\n            Drake's face is right there.  pressed up against the other\n            side of the grate, staring at her!\n\n\n            Zoe SCREAMS.  With a ROAR, Drake rips the grate off.  He tries\n            to climb inside, but the width of the duct is too narrow to\n            accommodate the size of his upper body.\n\n\n            Instead, he reaches his right arm in, extending his clawed\n            hand as far as he possibly can.  Zoe WHIMPERS, trying to\n            compress her mass into an even tighter ball --\n\n\n<b>            ON DRAKE'S HAND,\n</b>\n\n            having reached the limits of its extension -- his fingertips\n\n\n            only a few scant inches from Zoe's face.\n\n\n            Zoe's been allowed a moment's reprieve.  He can't reach her!\n\n\n            But then we hear the sound of POPPING CARTILAGE.  Of TINY\n            BONES shifting beneath Drake's flesh.  Drake's fingers are\n            elongating, snake-like Reaching for Zoe's face, rapidly\n            closing the space whici1 separates them --\n\n\n<b>            CUT TO:\n</b>\n\n<b>            EXT. LUNA PARK/GARAGE - NIGHT\n</b>\n\n            The real Blade and Abigail are returning.  The sliding garage\n            door opens and the Land Cruiser glides inside.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - NIGHT\n</b>\n\n            Blade and Abigail enter.  The place is dark.  They know\n            instinctively that somethong is wrong.\n\n\n            Blade tries a nearby light.  The power is out.  They both draw\n            their weapons.  Blade turns on a FLASHLIGHT.  They move onto\n            the darkness --\n\n\n            SHADOWS loom everywhere.  It's like a tornado touched down\n            inside.  Equipment lies smashed, tables and chairs have been\n            overturned.  Sommerfield's lab area has been destroyed.\n\n\n<b>                                ABIGAIL\n</b>                     King --\n\n\n            Blade and Abigail rush to the infirmary area, but King is gone\n            and the place has been trashed.  They move into --\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - STORAGE AREA - NIGHT\n</b>\n\n            -- the back area.  They find Dex and Hedges on the floor,\n            their bodies bled, desecrated.\n\n\n<b>                                ABIGAIL\n</b>                          (realizing)\n                     Zoe -- where's Zoe?\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - VARIOUS - NIGHT\n</b>\n\n            With increased urgency, Blade and Abigail search the\n            headquarters -- the bathroom, the garage, every nook and\n            cranny.  With each moment, Abigail becomes more panicked.\n\n\n<b>                                ABIGAIL\n</b>                     Where is she?!\n\n\n            They can't find her anywhere.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - SHOWER AREA - NIGHT\n</b>\n\n            Blade and Abigail enter.  A thin stream of BLOOD snakes its\n            way across the shower tiles.  Taey follow it, discovering --\n\n\n<b>            SOMMERFIELD,\n</b>\n\n            her body propped up mock-crucifixion style in the showers.  On\n            the wall nearby, someone has written a message in blood:\n\n\n<b>                   \"IMMORTALITY WILL COME TO SUCH AS ARE FIT FOR IT\"\n</b>\n\n<b>            ON BLADE\n</b>\n\n            He knows damn well who left him the message.\n\n\n            As tears streak down Abigail's cheeks, she rushes to\n            Sommmerfield's body.  Together, she and Blade get her down.\n\n\n            Abigail clutches Sommerfield, slowly rocking the body in her\n            arms.  Blade puts a hand on her shoulder.\n\n\n<b>                                BLADE\n</b>                     Use it.\n\n\n            Abigail doesn't respond.  Her whole body is shaking.\n\n\n<b>                                BLADE (CONT'D)\n</b>                          (more firmly)\n                     Use it.\n\n\n            Abigail raises her head, her eyes filled with hatred.  Blade\n            doesn't let up.  He's like a drill instructor, galvanizing her\n            with his words.\n\n\n<b>                                BLADE (CONT'D)\n</b><b>                     USE IT!!!\n</b>\n\n            Abigail lifts her head toward the heavens, letting loose a\n            TORTURED SCREAM that erupts from the very pit of her soul.\n\n\n<b>            CUT TO:\n</b>\n\n<b>            EXT. PHOENIX TOWERS - NIGHT\n</b>\n\n            Abigail's SCREAM ECHOES over the moonlit cityscape.\n\n\n<b>            INT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            CLOSE ON King's bloody face.  A dog is licking it.  King\n            stirs, his eyes fluttering open --\n\n\n<b>            KING'S POV\n</b>\n\n            The rottweiler we saw earlier is slobbering all over him.\n\n\n            PULL BACK to reveal King on his knees, shirtless, both wrists\n            secured behind him in a high-tech pillory.  King tries to\n            twist his head away from the dog.  The rottweiler GROWLS.\n\n\n<b>                                KING\n</b>                     Back off, pooch --\n\n\n            The rottweiler's jaws open, revealing more teeth than any dog\n            should probably have.\n\n\n            Its muzzle splits in two as both sides of the rottweiler\n            mandible fold back on either side of its head, disgorging a\n            hellish and barbed tongue stalk!  The mutant dog ROARS, ready\n            to bite King's face off and --\n\n\n<b>                                KING\n</b>                     Jesus Christ!\n\n\n            -- Grimwood appears from off-screen, LAUGHING, pulling the\n            animal back.  We see Danica and Asher now as well.\n\n\n<b>                                KING\n</b>                     What the fuck?!  WHAT THE FUCK?!?\n\n\n<b>                                ASHER\n</b>                     His name's Beau.  We've been experimenting\n                     with porting the vampire gene over into\n                     other species.\n\n\n            As Asher pets the rottweiler, its muzzle closes back up again. \n            It looks up at him, panting happily, tongue lolling.\n\n\n<b>                                KING\n</b>                     You made a goddamn vampire dog?!\n\n\n<b>                                GRIMWOOD\n</b>                     Yeah.  Cool, huh?\n\n\n<b>                                DANICA\n</b>                     Poor little King.  You look so\n                     distraught.\n\n\n            Danica wipes a little blood from the corner of King's mouth. \n            She touches her fingertips to her tongue, tasting his blood.\n\n\n<b>                                DANICA\n</b>                     You're tasting a little bland, lover.  Not\n                     getting enough fatty acids in your diet? \n                     Have you tried mackerel?  Lake trout?\n\n\n<b>                                KING\n</b>                     How about you take a sugar-frosted fuck\n                     off the end of my dick?\n\n\n<b>                                DANICA\n</b>                     Oh, there'll be time to play doctor later,\n                     believe me.  But for now, we need to have\n                     a little talk.\n                          (beat)\n                     Tell us about this bio-weapon you've been\n                     building.\n\n\n<b>                                KING\n</b>                     I can tell you two things.  Diddly.  And\n                     shit.  And diddly just left the building.\n\n\n            Grimwood steps forward, throttling King for a moment.\n\n\n<b>                                GRINWOOD\n</b>                     Spit it out, you fucking fruitcake!\n\n\n<b>                                KING\n</b>                     Okay, here's the deal with the weapon -\n                     (coughing)\n                     It's a new flavor crystal formula.  Twice\n                     the chocolaty-goodness, half the calories.\n                     Plus, it helps prevent tooth decay --\n\n\n            Grimwood moves in to choke him again, but Danica intervenes.\n\n\n<b>                                DANICA\n</b>                     You're brave, King, I'll give you that.\n                     But underneath all your swagger --\n\n\n            She leans closer, caressing his face.\n\n\n<b>                                DANICA\n</b>                     -- I know what you really fear.   What\n                     would hurt you more than anything else.\n\n\n            King's smile falters for a moment.  Maybe she does know.  She\n            rubs her cheek against his.\n\n\n<b>                                DANICA\n</b>                     You don't want to go back to being one of\n                     us --\n                          (her lips grazing his)\n                     -- do you?\n\n\n            King tries to turn his head away, but Danica grips his chin,\n            turning his head back.  He's sweating now.  Worried.\n\n\n<b>                                DANICA\n</b>                     I'm going to bite you again, King.  And\n                     then I'm going to leave you here while you\n                     turn.  I'm going to watch you, day after\n                     day, while the Thirst keeps building and\n                     building.  And then, when you can't stand\n                     it anymore --\n\n\n            She nods.  Drake appears, holding Zoe.  She's alive. \n            Terrified.  Held firm in Drake's arms.\n\n\n<b>                                DANICA\n</b>                     -- I'm going to bring the little girl\n                     for you to feed on.  Would you like that,\n                     King?  Would you enjoy taking her life?\n\n\n            King shuts his eyes, sickened at the thought.  Danica smiles.\n\n\n<b>                                DANICA\n</b>                     Now we're getting somewhere, my pet.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. NIGHTSTALKERS' HEADQUARTERS - SHOOTING RANGE - NIGHT\n</b>\n\n            Abigail sits in her workshop area, restringing one of her\n            bows.  Nearby is a table with an assortment of equipment -- a\n            bow press, vise stand, string jig, bow scales and wrench sets.\n\n\n            Across the way is a shooting range with a variety of targets\n            set up, a wall of netting behind them to catch stray arrows. \n            There's also a chronograph outfitted with a ballistic computer\n            to measure arrow speed.\n\n\n            CLOSE ON Abigail's hands as she works with a quiet precsion,\n            re-setting the arrow rest, making minor adjustments to the\n            center-shot position and wheel timing, etc.\n\n\n<b>            BLADE\n</b>\n\n            appears in the doorway, watching her.\n\n\n<b>                                BLADE\n</b>                     You alright?\n\n\n<b>                                ABIGAIL\n</b>                          (brusque)\n                     I'll be fine.\n\n\n            Blade nods.  He's going to leave her alone -- but then he\n            hesitates, wrestling to say something.\n\n\n<b>                                BLADE\n</b>                     Don't let it turn inward.\n\n\n            Abigail takes a deep breath, pausing in her work.\n\n\n<b>                                ABIGAIL\n</b>                     It already has.  Since I can remember\n                     I've had this knife of sadness in my\n                     heart.  As long as it stays there, I'm\n                     strong.  I'm untouchable.  But the moment\n                     I pull it out --\n                          (turning back to him)\n                     -- I'll die.\n\n\n            Blade nods.  He understands all too well.  He leaves.\n\n\n<b>            ON ABIGAIL\n</b>\n\n            She stands, moving to the shooting range.  She straps on a\n            quiver, takes aim at\n\n\n<b>            A 3-D HUMAN-SHAPED TARGET\n</b>\n\n            about a hundred feet away.  Just in front of the target is the\n            chronograph, which looks like a miniature set of goal posts.\n\n\n            WHOOSH!  Abigail FIRES an arrow.  It flies through the arms of\n            the chronograph, sinking into the targets s chest.  On the\n            screen of the ballistic computer, the arrow's speed is clocked\n            at 240 feet per second.  We move CLOSER to her now as--\n\n\n            WHOOSH!  Abicail FIRES again. The speed is 242 fps. CLOSER --\n\n\n            WHOOSH!  Now the speed is 269 fps. EVEN CLOSER --\n\n\n            WHOOSH!WHOOSH!WHOOSH!  285 fps.  302 fps.  315 fps!  The arrow\n            speed creeps up and up as we move CLOSER AND CLOSER to Abigail\n            until we --\n\n\n            -- PULL BACK.  Abigail has fired every arrow in her quiver. \n\n\n<b>            ON THE TARGET\n</b>\n\n            The arrows have formed a cross in the target's chest.  One\n            vertical grouping running up, another horizontal grouping\n            bisecting it.\n\n\n<b>            INT. NIGHTSTALKERS HEADQUARTERS - GARAGE - NIGHT\n</b>\n\n            Blade stands at the open entrance.  Abigail steps out.  Looks\n            like she's made peace with herself for the moment.\n\n\n<b>                                ARIGAIL\n</b>                     I'm ready to go.\n\n\n            HEADLIGHTS appear in the distance.  Another Land Cruiser\n            approaches, weaving through the amusement park.  It pulls to a\n            stop in front of them.  The driver's side window rolls down.\n\n\n<b>            A MAN (CAULDER)\n</b>\n\n            sits behind the wheel.  He raises a hand in greeting.\n\n\n<b>                                CAULDER\n</b>                     My name is Caulder.  And I'll be your\n                     driver this evening.\n\n\n<b>            INT. CAULDER'S LAND CRUISER - NIGHT\n</b>\n\n            Caulder's Land Cruiser glides through the streets.\n\n\n<b>                                BLADE\n</b>                     Where are you taking us?\n\n\n<b>                                CAULDER\n</b>                     Another safehouse.\n\n\n<b>                                ABIGAIL\n</b>                     We told you, Blade.  We operate in sleeper\n                     cells.  When one goes down, a new cell\n                     activates to pick up the slack.\n\n\n<b>            EXT. DEEP-SIX AQUARIUM STOCK - NIGHT\n</b>\n\n            Caulder pulls up in front of a fish supply store.\n\n\n<b>            INT. DEEP-SIX AQUARIUM STOCK - NIGHT\n</b>\n\n            Caulder unlocks an accordion security gate, opens the door. \n            He leads Blade and Abigail through the darkened aisles.  There\n            are fish tanks on either side, aerators BUBBLING, aquatic\n            animals of every kind swimming about.\n\n\n<b>            IN THE BACK\n</b>\n\n            is another arsenal/lab area.  This one is smaller than the\n            Nightstalkers' main headquarters.  Caulder moves to a\n            computer, calls up a file.  A dialogue box for a media player\n            opens.  Caulder activates a video file.\n\n\n<b>                                CAULDER\n</b>                     Sommerfield left a video message for you.\n\n\n<b>            ON THE MONITOR\n</b>\n\n            The video plays.  We see Sommerfield's face on the screen. \n            She looks grave, as if she might have been crying.\n\n\n<b>                                SOMMERFIELD\n</b>                          (on video)\n                     If you're watching this, I'm already dead.\n                     If Zoe's still alive, I want you to\n                     promise you'll take care of her.  I've\n                     been reading her The Oz books every night. \n                     We just started The Emerald City of Oz,\n                     the one with the Nome King --\n\n\n            Her voice cracks and she pauses, wiping away a tear.\n\n\n<b>                                SOMMERFIELD\n</b>                     I think I've managed to cultivate a\n                     workable strain of the Daystar virus.  As\n                     a precaution, I transmitted the genetic\n                     sequence to Caulder, in case our main\n                     stock was destroyed.  In order for it to\n                     achieve maximum lethality, you'll need to\n                     interfuse it with Drake's blood.  If it\n                     works, any vampires in the immediate\n                     vicinity should die almost instantly. \n                     After that, it should take only a few\n                     weeks for the virus to spread throughout\n                     the rest of the world.\n\n\n            Zoe hesitates, deciding how to broach the next subject.\n\n\n<b>                                SOMMERFIELD\n</b>                     There's one other thing, Blade.  You need\n                     to know that there's a chance the virus\n                     could destroy you too.  Because you're a\n                     hybrid, I'm not sure whether your immune\n                     system will be able tolerate it.\n                          (beat)\n                     I'm sorry.  We didn't have enough time to\n                     properly test it.\n\n\n            The video cuts to STATIC.  Abigail turns off the monitor,\n            looking to Blade.  God only knows what he's thinking.\n\n\n<b>                                CAULDER\n</b>                     Take a look at the plague arrow.\n\n\n            Caulder reaches for a refrigerated aluminum case, snapping it\n            open.  Inside, resting on a bed of form-fitting foam, is a\n            glass ampule that's been fitted into a stake-like contraption. \n            It looks like the head of a high-tech harpoon.\n\n\n<b>                                CAULDER\n</b>                     I only had time to fabricate a small batch\n                     of Daystar.  I outfitted it with a\n                     compressed gas projectile, so you should\n                     be able to fire it from one of the\n                     fourbarrel rifles or a bow.\n                          (beat)\n                     Just make sure the shot counts, cause we\n                     don't have enough for a second try.\n\n\n<b>            A SERIES OF DISSOLVES\n</b>\n\n            Abigail sits before a laptop, creating another custom MP3\n            playlist.  We watch as she hi-lights songs with her mouse,\n            moves them over to her portable device with a few CLICKS.\n\n\n            Abigail unhooks her MP3 device, slips her earbud headphones\n            into her ears.  The SOUNDS of Fluke's track Atom Bomb fade up,\n            gradually shifting from tinny source music to SOUNDTRACK.\n\n\n<b>            MORE DISSOLVES\n</b>\n\n            Blade and Abigail suit up, arming themselves.  We SEE:\n\n\n            Blade loading rounds into his pistols.\n\n\n            Abigail selecting arrows, checking the range-dials.\n\n\n            Blade sliding silver stakes into his bandoliers.\n\n\n            Abigail working with Caulder, affixing the plague capsule to\n            one of her arrowheads.\n\n\n            Blade polishes his sword.  Finished, he sights down the length\n            of it, takes a practice swing, then secures it in his back\n            scabbard with a flourish.\n\n\n<b>            EXT. DEEP-SIX AQUARIUM STOCK - BACK ALLEY - NIGHT\n</b>\n\n            We hear the RUMBLE of two motorcycles.  Blade emerges from the\n            alley astride his signature Ducati ST2 crotch-rocket.  Abigail\n            appears a moment later on her own customized bike.\n\n\n            Blade revs his engine.  Then the two bikes take off.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. PHOENIX TOWERS - DRAKE'S QUARTERS - NIGHT\n</b>\n\n            Drake sits before Zoe, who has been shackled to the wall, his\n\n\n            right arm encased in one of the armored gauntlets from his\n            burial armor.  The rest of the armor has been propped up on a\n            stand nearby.\n\n\n<b>                                DRAKE\n</b>                     Do you know who I am?\n\n\n<b>                                ZOE\n</b>                     You're the Nome King.\n\n\n            Drake smiles at this.\n\n\n<b>                                DRAKE\n</b>                     The Nome King.  I like that.\n                          (leaning closer)\n                     Tell me, child.  Do you want to die?\n\n\n            Zoe is terrified but tries to remain defiant.\n\n\n<b>                                ZOE\n</b>                     I'm not afraid -- I'll go to Heaven.\n\n\n<b>                                DRAKE\n</b>                     There is no Heaven.  No God.  No angels.\n                     No happy ending for good little girls.\n                     The only thing you have to look forward to\n                     is nothingness.\n\n\n            As Drake talks his pupils seem to widen -- until the darkness\n            nearly occludes the whites of his eyes.  Zoe stares at him. \n            Can't tear her gaze away.  His eyes are hypnotic.\n\n\n<b>                                DRAKE\n</b>                     But what if you could change that?  What\n                     if you could remain a child forever?\n\n\n            He reaches out, running a sharp fingernail over her cheek.\n\n\n<b>                                DRAKE\n</b>                     What if you could keep this little doll-\n                     like face of yours until the sun itself\n                     cooled to a cold, hard rock?\n                          (beat)\n                     Wouldn't you like that?  Wouldn't you\n                     accept that gift?\n\n\n            Zoe reaches out, calmly touches Drake's cheek.\n\n\n<b>                                ZOE\n</b>                     My friends are coming to kill you.\n\n\n<b>            INT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            WHACK!  Grimwood PUNCHES King, whose body sags, weakened from\n            the beatings he has undergone.  Asher and Danica look on.\n\n\n<b>                                KING\n</b>                     -- gonna be sorry you did that --\n\n\n<b>                                ASHER\n</b>                     Nobody's coming for you, King.\n\n\n<b>                                KING\n</b>                     Sure they are.  Left a trail of digital\n                     bread crumbs --\n\n\n<b>                                DANICA\n</b>                     Excuse me?\n\n\n<b>                                KING\n</b>                     One thing you need to know about us\n                     Nightstalkers.  When you join our club,\n                     you get this nifty little tracking node\n                     surgically implanted in your body --\n\n\n<b>                                GRIMWOOD\n</b>                     Bullshit.\n\n\n<b>                                KING\n</b>                     Scout's honor.  One of us gets lost, the\n                     others just dial up the satellite and\n                     presto, instant cavalry.\n\n\n            Grimwood looks to Asher and Danica, unsure.\n\n\n<b>                                AS HER\n</b>                     He's bluffing.\n\n\n<b>                                DANICA\n</b>                          (smiling, playing along)\n                     Okay, King, where did they put this\n                     tracking node of yours?\n\n\n            He motions for her to draw closer, whispering.\n\n\n<b>                                KING\n</b>                     It's in my left ass-cheek --\n\n\n            WHACK!  Danica slaps King's face, making him see stars.\n\n\n<b>                                KING\n</b>                     Alright.  alright, it's in my right ass-\n                     cheek --\n\n\n            WHACK!  Danica slaps King again, this time knocking his head\n            the other way.  He spits out blood --\n\n\n<b>                                KING\n</b>                     No, seriously --\n                          (gasping)\n                     -- it's in the meat of my butt, right\n                     below my Bart Simpson tattoo --\n\n\n            Danica PUNCHES King's mid-section.  He sucks air.  Despite his\n            attempts at humor, he's hurting now.  His body sags --\n\n\n<b>                                KING\n</b>                     -- pull down my tighty-whities -- see for\n                     yourself.\n\n\n<b>                                DANICA\n</b>                     ENOUGH!  It's not funny anymore!\n\n\n            Behind Danica, Grimwood and Asher both COUGH.\n\n\n            King lifts his bruised face, staring up at Danica through\n            blood-shrouded eyes.  For the first time, we get a sense of\n            his true hatred for her.\n\n\n<b>                                KING\n</b>                     No, it's not, you horse-humping bitch --\n                          (wincing as he breathes)\n                     -- but it will be a few seconds from now.\n\n\n<b>                                DANICA\n</b>                          (coughing)\n                     And what happens then, lover?\n\n\n<b>                                KING\n</b>                     Hammer time.\n                          (beat)\n                     See, that tickle in your throat you're\n                     feeling right now?\n\n\n            Danica COUGHS again, blinks repeatedly, as if her eyes were\n            irritated.  She rubs them, looks to the others.  They're\n            feeling the effects too.  And Grimwood's face is smoking!\n\n\n<b>                                KING\n</b>                     That's atomized colloidal silver.\n\n\n            Danica keys into the RUMBLE of the air-conditioning system and\n            a HISSING SOUND beneath that.  She looks up --\n\n\n<b>                                KING\n</b>                     It's being pumped into the building's air\n                     conditioning system.\n\n\n<b>            ANGLE ON THE HEATING REGISTER ABOVE\n</b>\n\n            We GO MACRO, shrinking down until we see a CLOUD OF TINY\n            SILVER PARTICLES blowing into the room.  The particles are\n            dusting the vampires, being unwittingly inhaled by them and --\n\n\n<b>            WE'RE BACK TO NORMAL\n</b>\n\n            as the vampires react en mass, suddenly gagging, their throats\n            and faces on fire.\n\n\n<b>                                KING\n</b>                     Which means that the fat lady should be\n                     singing right about --\n\n\n<b>            GRIMWOOD\n</b>\n\n            has caught the worst of it.  A whole lung-full.  He SHRIEKS as\n            He coughs up blue-tinged FLAMES, the flesh on his face\n            simultaneously burning away and --\n\n\n<b>                                KING\n</b><b>                     -- NOW\n</b>\n\n<b>            THE SKYLIGHT ABOVE THEM\n</b>\n\n            SHATTERS as Blade crashes down.  He lands in a cat-like\n            stance, then flips over into a cartwheel, KICKING Grimwood in\n            the face.  As Grimwood goes down, Asher and Danica scatter --\n\n\n            Blade tackles Grimwood, sending both of them over the railing\n            into the lower level of the penthouse.\n\n\n<b>            INT. PHOENIX TOWERS - HALLWAY - NIGHT\n</b>\n\n            ALARMS are ringing.  Asher and Danica rush down the hall,\n            trying not to breathe the silver-contaminated air.  We SEE\n            other vampires staggering from doorways, COUGHING, GAGGING.\n\n\n<b>            INT. PHOENIX TOWERS - DRAKE'S QUARTERS - NIGHT\n</b>\n\n            Drake hears the ALARMS.  He reaches for his sword, which rests\n            in a nearby stand.  As he heads out, he strides past Zoe,\n            still chained to the wall.\n\n\n<b>            INT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            On the lower level, Blade and Grimwood are going at it.\n\n\n<b>            REINFORCENENTS\n</b>\n\n            flood in from multiple entry ways.  It's an all-out melee. \n            Blade is seriously overwhelmed, but the sheer number of\n            vampires and humans is actually slowing them down.\n\n\n            Blade takes on a half-dozen of them at once, stunning one of\n            the familiars, using him as a human shield, TOSSING him aside\n            to trip up another on-rushing pair.\n\n\n            Then he pauses, instantly calculating the geography of the\n            room, the relative positions of the other combatants,\n            assessing decorations and furniture as possible weapons.  His\n            battle plan ready, Blade engages his enemies once again.\n\n\n<b>            MEANWHILE, ON THE UPPER LEVEL\n</b>\n\n            Abigail appears at the lip of the smashed-in skylight.  She\n            lowers herself down on a rope, rushes to King's side --\n\n\n<b>                                ABIGAIL\n</b>                     You alright?\n\n\n<b>                                KING\n</b>                     Nothing a hot tub full of Bactine won't\n                     fix.\n\n\n            Abigail hits the release switch on the high-tech pillory and\n            the cuffs around his wrists open.  As Abigail helps King out:\n\n\n<b>                                ABIGAIL\n</b>                     Zoe --\n\n\n<b>                                KING\n</b>                     Drake's got her.\n\n\n            Abigail nods, handing King her pistol.  Then she's out the\n            door.  Seconds later, King follows --\n\n\n<b>            INT. PHOENIX TOWERS - HALLWAYS - VARIOUS - NIGHT\n</b>\n\n            Abigail pauses, slipping her earbuds in, turning on her MP3\n            player.  The bumping-strains of Fluke's Absurd track kick in. \n            Abigail uncilps her UV arc, telescopes it outward and --\n\n\n            -- suddenly it's like we're in a first-person shooter video\n            game.  She moves through the corridors with mathematical\n            precision, feeling the MUSIC in her bones, slicing through\n            every vampire she encounters with deadly efficiency.\n\n\n<b>            VAMPIRES AND HUMAN FAMILIARS\n</b>\n\n            are coming out from every doorway.\n\n\n            Abigail PUNCHES one in the solar plexus, DECAPITATES another,\n            finishes off the first.  Then she's moving on, taking down a\n            third, fourth, and fifth vampire with her rapid-fire stake\n            dispenser.  Throwing stakes with blinding speed.\n\n\n            After a half-dozen stakes, her dispenser is empty.  Without\n            missing a beat, she presses a tab on the dispenser, ejects the\n            clip, then reaches to her belt where a back-up is secured and\n            slaps it in place.  The mayhem continues.\n\n\n<b>            INT. PHOENIX TOWERS - PENTHOUSE - LOWER LEVEL - NIGHT\n</b>\n\n            Blade unsheathes his sword.  He parries two combatants with\n            clubs, then whirls around, DEFLECTING a GUNSHOT from a third\n            with the flat of his sword.\n\n\n            Grimwood is furious.  His men are tripping all over\n            themselves.  He grabs an antique battle axe that's secured to\n            the wall.  He sees an opening, SWINGS at Blade's head --\n\n\n            -- Blade drops and the axe slices through one of Grimwood's\n            own men.\n\n\n            In an eye-blink, Blade is up again, advancing.  He cuts down\n            another familiar, pushes forward, cuts oown a second --\n\n\n            Now Blade and Grimwood are face to face.  Grimwood swings his\n            axe again.  Blade hooks his sword beneath it, FLIPPING it from\n            Grimwood's hands.\n\n\n            Blade sweeps his sword around in a wide arc, CUTTING straight\n            through Grimwood's mid-section.  The upper half of Grimwood's\n            body topples away --\n\n\n            -- then he rights himself.  A half-vampire.  He's still alive,\n            running forward on his hands, trailing viscera.  He SPRINGS UP\n            at Blade, all claws and gnashing teeth.\n\n\n            Blade catches Grimwood by the throat, whirls him around --\n\n\n            --  and manages to IMPALE what's left of Grimwood with his\n            sword-point.  Grimwood ASHES in Blade's arms.  The only thing\n            left are his steel teeth, which CLATTER to the floor at\n            Blade's feet.\n\n\n<b>            INT. PHOENIX TOWERS - DRAKE'S QUARTERS - NIGHT\n</b>\n\n            Abigail enters, SEES Zoe.  TWO VAMPIRES GUARDS stand nearby. \n            In a flash, Abigail flings TWO SILVER STAKES at them.  Both\n            stakes hit their mark and the vamps crumple to ASH.\n\n\n            Abigail hurries over, SHOOTS apart the lock on Zoe's shackle.\n            Zoe wraps her arms around Abigail, hugging her tight.  Abigail\n            takes Zoe by the hand, pulling her towards the door.\n\n\n<b>                                ABIGAIL\n</b>                     Come on, hon.  Let's get you out of here.\n\n\n<b>            INT. PHOENIX TOWERS - HALLWAY - NIGHT\n</b>\n\n            King stumbles out into the hallway, pulling his shirt back on. \n            As he limps down the corridor, a GROWL makes him pause --\n\n\n<b>            KING'S POV\n</b>\n\n            Beau, the vampire rottweiler, lopes around the corner.  Then --\n\n\n<b>            TWO MORE ROTTWEILERS\n</b>\n\n            emerge behind Beau.  They're all GROWLING now.\n\n\n<b>                                KING\n</b>                          (under his breath)\n                     Fuck.  Me.  Sideways.\n\n\n            The three of them break, BARKING like crazy, snouts splitting\n            open as their jaws flower apart.\n\n\n<b>            CUT T0:\n</b>\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - UPPER GALLERY - NIGHT\n</b>\n\n            Blade moves into the upper gallery of a vast atrium.\n\n\n<b>            DRAKE\n</b>\n\n            stands before him, waiting, sword in hand.  He extends it,\n            touching the tip to the floor.  A challenge.\n\n\n<b>                                DRAKE\n</b>                     Are you ready to die, Blade?\n\n\n<b>                                BLADE\n</b>                     Been ready since the day I was born,\n                     mother-fucker.\n\n\n<b>                                DRAKE\n</b>                          (with a smile)\n                     Then allow me to accommodate you.\n\n\n            Drake does a back-flip over the balcony.  Forty feet down.\n\n\n            Blade follows, drawing his sword as he LEAPS --\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - GROUND FLOOR - NIGHT\n</b>\n\n            -- and lands.  Now the two warriors face each other, swords\n            raised, eyes locked, their stances frozen.  Like classic\n            samurai.  Whoever moves first, loses.\n\n\n            Beat.  MOVING IN on both men, CIRCLING around them.  Slow the\n            heart.  Slow the breath.  Find the opening.\n\n\n<b>            DRAKE\n</b>\n\n            breaks first, bringing his sword over in less time than it\n            takes to blink an eye.  No one could possibly deflect the\n            blow.  And yet --\n\n\n<b>            BLADE\n</b>\n\n            manages a COUNTER-STROKE with super-human grace.  He advances,\n            parries, his sword CLANGING and SINGING like a blacksmith's\n            hammer on sheet metal.\n\n\n            Cut, thrust, block, diagonal downward slashes.  The moves come\n            faster.  Drake DUCKS, barely avoiding being decapitated. \n            Blade's sword cuts right through a column instead.\n\n\n            Drake retaliates.  Blade locks swords with him.  For a moment,\n            the two warriors are nose to nose.  Then Blade twists his\n            sword free, cutting open Drake's cheek --\n\n\n            Drake GROWLS, back-flipping up onto a ledge.  He touches his\n            fingertips to the cut, tastes his own blood.  Then we hear the\n            telltale sounds of CARTILAGE POPPING.  For a brief moment, his\n            facial features shift, giving us yet another glimpse of his\n            true form.  As his anger increases, Drake begins to devolve.\n\n\n            He DIVES at Blade, HOWLING, raking his CLAWS at Blade's face. \n            He strikes out, KNOCKING Blade across the atrium.  He SPRINGS\n            forward, dragging Blade up by his throat, sinking his fangs\n            into Blade's shoulder.  Blide SCREAMS and we --\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. PHOENIX TOWERS - HALLWAY - NIGHT\n</b>\n\n            -- as King runs.  He hazards a look back.  The vampire dogs\n            are quickly gaining on him.\n\n\n<b>            UP AHEAD\n</b>\n\n            It's a dead-end.  Just plate glass windows and a whole lot of\n            nothing beyond.\n\n\n            The dogs are almost on King when suddenly, King JUMPS,\n            snagging an overhead pipe.  As he swings his body upward --\n\n\n<b>            THE DOGS\n</b>\n\n            skid on the floor, unable to stop their momentum, and CRASH\n            straight through the plate glass window.\n\n\n<b>            EXT. PHOENIX TOWERS - PENTHOUSE - NIGHT\n</b>\n\n            An EXPLOSION OF GLASS as two of the vampire rottweilers tumble\n            into the night.  They fall like stones -- twenty stories down\n            into the traffic-clogged intersection below.\n\n\n<b>            INT. PHOENIX TOWERS - HALLWAY - NIGHT\n</b>\n\n            King drops back to the floor, cackling, pleased with himself. \n            It takes him a second to realize that --\n\n\n<b>            ONE OF THE ROTTWEILERS (BEAU)\n</b>\n\n            -- didn't take a swan dive out the window.  He's right behind\n            King.  And now he's SPRINGING FORWARD --\n\n\n            WHAM!  King is hit in the chest by the SNARLING beast.  He\n            drops the pistol as he's knocked back onto the floor.  The dog\n            LUNGES again --\n\n\n            With one arm, King struggles to keep his face from being bit\n            off, while searching blindly for the discarded pistol.  King\n            locates it, FIRING into the beast's chest --\n\n\n<b>            THE ROTTWEILER\n</b>\n\n            ASHES, disintegrating all over King's face.  King gets a\n            mouthful of the charcoal remains, tries to SPIT them out.\n\n\n<b>                                KING\n</b>                          (making a face)\n                     Bad dog.\n\n\n<b>                                                                  CUT TO:\n</b>\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - UPPER GALLERY - NIGHT\n</b>\n\n            Abigail emerges onto the gallery with Zoe.  She spots an\n            alcove, indicates that Zoe should hide.  Then she slips a\n            silver stake into Zoe's hand.  Just in case.\n\n\n            Abigail rushes to the handrail, looking down at Blade and\n            Drake.  Her view is obscured.  She can't get a good shot.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - GROUND FLOOR - NIGHT\n</b>\n\n            Drake digs his fangs into Blade's shoulder.  Blade struggles,\n            manages to slip a stake from his bandolier --\n\n\n            WHAM!  Blade SLAMS the stake into Drake's ear canal.  The\n            beast SHRIEKS in pain, dropping Blade.  But all the gambit has\n            done is drive Drake into a berserker rage.\n\n\n            Drake swings his fist.  Blade ducks.  Drake's fist goes\n            through the wall, PUNCTURING a steam pipe.  Steam vents --\n\n\n            Drake reaches in, RIPS an eight-foot section of the pipe from\n            the wall, bringing a SPARKING nest of electrical cables along\n            with it.  He swings the pipe section around, WHACKING Blade.\n\n\n            KRUNCH!  Drake swings the makeshift club again.  He's a one\n            man demolition crew, decimating everything in his path.  He's\n            SMASHING holes in the floor, the walls, plowing through\n            partitions of glass and steel.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - UPPER GALLERY - NIGHT\n</b>\n\n            Abigail moves down the gallery, looks up --\n\n\n<b>            A SERIES OF LIGHTING GANTRIES\n</b>\n\n            span the length of the atrium ceiling.\n\n\n            Abigail balances on the handrail, then jumps out into space --\n\n\n            -- catching hold of one of the crosspieces.  Like an acrobat,\n            she monkey-swings her way beneath the gantry.  If she loses\n            her grip, she'll fall more than fifty feet.\n\n\n            BA-BANG!  A bullet strikes just in front of Abigail, showering\n            her with SPARKS.  MORE BULLETS follow.\n\n\n<b>            ANGLE ON PAIR OF VAMPIRES\n</b>\n\n            FIRING from below, trying to pick her off.  Suddenly, UV\n            BULLETS strike each of the vampires.  As they ASH we --\n\n\n<b>            WHIP-PAN BACK TO KING,\n</b>\n\n            having dragged his battered body out onto the upper gallery. \n            He's playing guardian angel to Abigail, laying down cover fire\n            so she can continue.  But then --\n\n\n<b>                                DANICA\n</b><b>                     KING!!!\n</b>\n\n<b>            DANICA\n</b>\n\n            appears behind King.  She TACKLES him, wrestling him to the\n            floor, pummeling his face with her fist.\n\n\n            King tries to ward of f the blows, but he's sorely outmatched.\n            He swings his electronic pistol up --\n\n\n            Danica twists it from his grip, ejecting the clip from the\n            stock.  King's sun dog bullets spill out all over the floor. \n            She tosses the gun aside, reaches for King again --\n\n\n<b>            INT. PHOENIX TOWERS - LIGHTING GANTRY - NIGHT\n</b>\n\n            Back to Abigail.  She's breathing heavily, trying to call up\n            new reserves of strength.  She glances down --\n\n\n            Big mistake.\n\n\n            She forces herself to look back up.  She swings herself\n            pendulum-style, manages to snag yet another crosspiece.  A\n<b>            SHOT RINGS OUT --\n</b>\n\n<b>            ANGLE ON ASHER,\n</b>\n\n            down below, armed with a rifle.  He FIRES again --\n\n\n            -- grazing Abigail's shoulder with the bullet.  Abigail CRIES\n            OUT, nearly losing her grip.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - UPPER GALLERY - NIGHT\n</b>\n\n            King rolls on his side, spits out a bloody tooth.\n\n\n<b>                                KING\n</b>                     No offense, Danica --\n                          (gasping in pain)\n                     -- but I've wanted to kill you since the\n                     moment we slept together.\n\n\n<b>                                DANICA\n</b>                     I was that bad, huh?\n\n\n            King reaches a palsied hand for his discarded pistol, points\n            it vaguely in Danica's direction.  She LAUGHS.\n\n\n<b>                                DANICA\n</b>                     No bullets in your gun, King.\n\n\n<b>                                KING\n</b>                     Yeah, but here's the beauty --\n                          (wiping his bloody mouth)\n                     -- these babies can be triggered remotely.\n\n\n            King pulls the trigger.  The scattered sun dog bullets ERUPT\n            with UV LIGHT.  Danica SHRIEKS, trying to shield her already\n            burning face from the glare.  She runs, horribly wounded.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - GROUND FLOOR - NIGHT\n</b>\n\n            Drake pummels Blade, flinging his body about like a ragdoll. \n            He grabs Blade by his ankle, swings him upwards some thirty\n            feet --\n\n\n            SMASH!  Blade collides with the underside of a massive hanging\n            glass chandelier/lighting fixture.\n\n\n            Blade FALLS back to the ground, stunned, dropping his sword. \n            Drake pounces on him.  Blade can barely fend off Drake's blows\n            anymore.  In desperation he digs his fingers into Drake's\n            eyes.\n\n\n            Drake swings both fists downward, Hulk-style, SHATTERING an\n            entire section of the limestone flooring.\n\n\n            A SHOCK-WAVE ripples out from the point of impact, sending\n            waves of two-foot stone tiles flipping up into the air,\n            knocking Blade off his feet.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - UPPER GALLERY - NIGHT\n</b>\n\n            King loads a sun dog into his pistol, steadies his aim on the\n            railing, and FIRES at Asher --\n\n\n<b>            THE SUN DOG\n</b>\n\n            screams across the atrium, striking dead-center in Asher's\n            open mouth.  The bullet EXPLODES.  UV LIGHT causes Asher's\n            skull to burn up from the inside out.  His headless corpse\n            falls forward over the gallery railing.  Then it too\n            carbonizes and BURNS UP.\n\n\n            Relieved, King sinks to his knees.\n\n\n<b>            BEHIND KING,\n</b>\n\n            we SEE Zoe slip from the alcove.  She makes for the stairs.\n\n\n<b>            INT. PHOENIX TOWERS - LIGHTING GANTRY - NIGHT\n</b>\n\n            King has bought Abigail more time.  She swings her body\n            forward, hooking her legs over the next crosspiece.  Then she\n            lets go with her hands.  Now she is hanging upside down,\n            secured only by the tension in her calves.\n\n\n            Abigail reaches behind her, removes her bow.  BLOOD from her\n            wounded shoulder drips down over her collar bone, reaching her\n            cheek, briefly obscuring her vision.  She wipes it away.  Then\n            she reaches back once more and --\n\n\n            -- because her quiver is pointed downward, a number of arrows\n            slide out. Abigail panics, twisting her body --\n\n\n            -- managing to lust barely snag the ~la~ue arrow as it tumbles\n            Past her!\n\n\n            Beat.  Abigail shuts her eyes, trying to find her center. \n            With her eyes closed, she nocks the arrow and draws the bow\n            back.  Then she opens her eyes.\n\n\n            She's only going to get one shot -- and she's going to have to\n            take it while hanging upside down.\n\n\n168 a       ABIGAIL'S POV                                      168 a  \n\n\n            On Drake and Blade below, locked in combat.  She tracks their\n            progress, waits for Drake to move into a better position --\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - GROUND FLOOR - NIGHT\n</b>\n\n            Drake shoulders a support column, SNAPPING it in two.  An\n            entire section of the gallery walkway above comes CRASHING\n            DOWN, burying Blade in debris --\n\n\n            -- but it's not enough for Drake.  He LEAPS forward, fishing\n            Blade out, hauling him up --\n\n\n            Drake head-butts Blade -- once, twice.  Blade's eyes roll to\n            whites.  Drake looks down, SEES Blade's discarded sword. \n            Drake scoops it up, STRIKES at Blade --\n\n\n            Blade manages to roll to the side, avoiding the blow.\n\n\n            Drake STRIKES again, dealing Blade a glancing blow --\n\n\n<b>            INT. PHOENIX TOWERS - LIGHTING GANTRY - NIGHT\n</b>\n\n            ON ABIGAIL.  Waiting.  More blood has trickled down her neck,\n            into her eyes.  But she can't wipe them anymore.  She's\n            already got her bow drawn.  She's committed to the shot.\n\n\n            We can hear ABIGAIL'S HEARTBEAT as she settles.  She takes a\n            final breath, holds it -- and lets the plague arrow fly.\n\n\n<b>            ON THE PLAGUE ARROW\n</b>\n\n            as it streaks downward, hurtling towards Drake at more than\n            300 feet per second.  Then, at the last possible instant\t--\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - GROUND FLOOR - NIGHT\n</b>\n\n            CHINGG!  Drake deflects the arrow with his sword.  It\n            harmlessly falls to the floor, rolling a few yards away.\n\n\n<b>            ON ABIGAIL,\n</b>\n\n            stunned, her expression melting into despair.\n\n\n<b>            BACK TO DRAKE\n</b>\n\n            swinging Blade's sword around.  PLUNGING it into Blade's side.\n            As he pulls it back out again --\n\n\n<b>            BLADE\n</b>\n\n            GASPS, sinking downward.  He's on his knees now, in shock.\n\n\n            Drake ROARS again shifting, conjuring up seventy centuries of\n            violence and predation.  And the nightmare shape that was only\n            hinted at before, finally takes center-stage.\n\n\n            BLOOD suffuses Drake's flesh, turning his skin crimson.  His\n            canines elongate, his lower jaw distends. \n            Jagged bone spurs erupt all over his body -- like he's growing\n            a suit of razor-sharp thorns.  He doesn't need a sword\n            anymore.  He's become a living weapon.  Drake is gone.  Now he\n            is --\n\n\n<b>            THE BEAST\n</b>\n\n            Drake swings the sword overhead.  He's going to decapitate\n            Blade.  And just as the sword reaches the top of its arc --\n\n\n<b>            ZOE\n</b>\n\n            emerges from the shadows behind Drake, clutching a silver\n            stake.  She SHOVES it into Drake's back,  pushing with all the\n            strength her little body can muster.\n\n\n            Drake staggers.  The blow wasn't lethal, but it hurt all the\n            same.  He turns on Zoe, enraged, his attention distracted for\n            one crucial second --\n\n\n<b>            ON BLADE,\n</b>\n\n            summoning the last of his reserves.  He pitches his body\n            forward, managing to snag the end of the plague arrow.  And\n            before Drake even realizes what is happening --\n\n\n            WHAM!  Blade sinks the plague arrow deep into Drake's chest. \n            Drake drops the sword, turning back to face Blade --\n\n\n            Exhausted beyond measure, Blade sags.\n\n\n<b>            INSIDE DRAKE'S CHEST - MACRO SHOT\n</b>\n\n            as the arrowhead dispense the bio-weapon.  We SEE the virus\n            flooding Drake's internal organs, causing them to blacken as\n            his circulatory system carries it throughout his body.\n\n\n<b>            ON DRAKE'S FACE,\n</b>\n\n            letting loose an INHUMAN SCREAM, vomiting up a spray of blood\n            mist.  His monstrous features begin to melt, reshaping into\n            his more familiar face.  At the same time we --\n\n\n<b>            GO MACR0 ONCE MORE\n</b>\n\n            Shrinking until we are amidst the spray of blood Drake\n            expelled.  We continue shrinking until we are moving with the\n            individual molecules of Drake's breath as the plague virions\n            latch onto them, causing them to blacken and become necrotic. \n            Moving with the twirling molecules until they are inhaled by --\n\n\n<b>            DANICA,\n</b>\n\n            having retreated from her defeat by King.  She clutches her\n            throat.  We can see the virus infiltrating her system as tiny\n            BLACK THREADS expand across her face.  She sways, falling onto\n            the floor.  She reaches a beseeching hand towards King --\n\n\n            -- then dies, a final still-born curse on her lips.\n\n\n<b>            MORE VAMPIRES\n</b>\n\n            are feeling the effects now too.  One by one they drop,\n            choking, going into convulsions.  As they writhe on the floor,\n            we watch the Daystar virus ravaging their bodies.\n\n\n<b>            BACK TO BLADE AND DRAKE\n</b>\n\n            Drake slumps against the wall.  Hero and villain are now\n            separated by only a few feet.  Both at death's door.\n\n\n<b>                                DRAKE\n</b>                     Well done, hunter.  Well done.\n\n\n            Blade stares back.  At this point, he's just trying to remain\n            conscious.  He's lost a ton of blood.\n\n\n<b>                                DRAKE \n</b>                     You fought with honor --\n\n\n            Drake shudders, his breathing becoming increasingly shallow.\n\n\n<b>                                DRAKE\n</b>                     -- as I knew you would.  The humans are\n                     coming for you, you know.  In their eyes,\n                     you and I are the same.\n                     Allow me one last indulgence, then --\n                          (gasping)\n                     -- a parting gift --\n\n\n            Drake grows still, his eyes locked on Blade's.\n\n\n<b>            ABIGAIL AND KING\n</b>\n\n            rush to Blade's side.  Zoe joins them.  Blade is dying, fading\n            fast.  Abigail shakes Blade --\n\n\n<b>                                ABIGAIL\n</b>\n                     Blade!\n\n\n            Her voice sounds distant and muted, overridden by Blade's own\n            HEARTBEAT which is fading up, dominating the soundtrack.\n\n\n<b>                                ABIGAIL\n</b><b>                     BLADE!!!\n</b>\n\n            Blade's eyes can't focus anymore.  They're clouding over.\n\n\n<b>                                BLADE'S POV\n</b>                     We drop away from Abigail and King -- like\n                     we're falling down\n\n\n            a dark tunnel.\t Then the world FADES TO WHITE.\n\n\n<b>            EXT. CITYSCAPE\t- DAWN\n</b>\n\n            FADE IN FROM WHITE.  We see the sky, the burning orb of the\n            rising sun.  A trio of FBI helicopters ride out from the dawn,\n            swooping down over the stirring city.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     It didn't take long for the authorities\n                     to arrive.\n\n\n<b>            INT. LEAD HELICOPTER - DAWN\n</b>\n\n            Cumberland sits in the front passenger seat, Hale behind him.\n\n\n<b>            EXT. PHOENIX TOWERS - PLAZA - DAWN\n</b>\n\n            As the helicopters touch down in the plaza we see a small\n            convoy of POLICE and FBI VEHICLES converging around them.\n\n\n            Cumberland and Hale are among the first out.  They rush\n            towards the Phoenix Towers entrance, guns drawn, DOZENS OF\n            AGENTS and OFFICERS behind them.\n\n\n<b>            INT. PHOENIX TOWERS - ATRIUM - DAWN\n</b>\n\n            The first rays of sun penetrate through the atrium windows\n            setting the scattered vampire corpses ablaze.  Danica, Asher,\n            and the others all ignite.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     When they got there, all of Drake's\n                     people were dead.\n\n\n            By the time Cumberland and his men have entered, fanning out\n            through the atrium, all they find are a series of corpse\n            shaped piles of ash and singe marks.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     In the weeks that followed, the rest of\n                     the world's vampires also perished.\n                          (beat)\n                     We'd finally won.\n\n\n<b>            ON CUMBERLAND,\n</b>\n\n            surveying the scene, frustrated by what he's found.  Then we\n            hear SHOUTS coming from the back of the atrium.\n\n\n<b>            AT THE BACK OF THE ATRIUM\n</b>\n\n            they find Blade.  He's dead, slumped against a wall.  There's\n            no sign of Drake.  The vampire king is gone.\n\n\n<b>            INT. FBI MORGUE - DAY\n</b>\n\n            CLOSE ON Blade's face, his body being wheeled on an autopsy\n            gurney.  PULL BACK to reveal that we are in an FBI morgue.\n            Cumberland and Hale stand nearby, overseeing everything as --\n\n\n<b>            A TRIO OF MEDICAL EXAMINERS\n</b>\n\n            lift Blade's body onto an autopsy table.  They turn on a bank\n            of overhead UV lights.  The lead examiner reaches for a\n            scalpel.  But as he touches the scalpel to Blade's chest --\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     And Blade?  Cumberland and Hale finally\n                     got their body --\n\n\n<b>            BLADE'S FACE\n</b>\n\n            changes.  We hear a series of POPS and CRACKS as subdermal\n            cartilage begins to loosen and shift.  At the same time, the\n            skin begins to lighten as melanin is gradually leached away.\n\n\n<b>                                ABIGAIL (V.0.) (CONT'D)\n</b>                     -- but it wasn't the one they were banking\n                     on.\n\n\n<b>            ON CUMBERLAND AND THE OTHERS\n</b>\n\n            as they react with varying degrees of shock.\n\n\n<b>            BACK TO THE BODY\n</b>\n\n            We realize that it's not Blade lying before them.  It's Drake.\n            Somehow, even in death, the vampire king managed to take\n            Blade's shape and temporarily retain it.\n\n\n<b>                                ABIGAIL (V.O.)\n</b>                     The virus didn't kill Blade.  But the\n                     authorities very well could have.  So in\n                     the end, realizing that own his people\n                     were doomed, Drake decided to give Blade a\n                     gift.\n\n\n            (beat)\n\n\n<b>                                ABIGAIL (CONT Ã\u0083â\u0080\u009dD)\n</b>                     By taking Blade's shape, he bought Blade\n                     enough time to escape.  Offering Blade a\n                     second chance at life - -\n\n\n<b>                                                              DISSOLVE TO:\n</b>\n\n<b>            EXT. SEASIDE CLIFF - DAY\n</b>\n\n            A bright summer day.  Blade stands at the edge of a cliff,\n            looking out over a sun-struck ocean.  For the first time since\n            we've seen him, he's not wearing armor or sunglasses or\n            handguns or rifles.  And were it not for the sword he holds,\n            we might even mistake him for an ordinary man.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     And so Blade took it.\n\n\n            Blade flings his sword over the cliff, into the ocean below. \n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     We never saw him again.\n\n\n<b>            UNDERWATER\n</b>\n\n            We see the sword sinking, reflecting the refracted sunlight\n            from above as it twirls end over end.\n\n\n<b>            BACK TO BLADE\n</b>\n\n            At peace with himself at last.  After a moment's reflection,\n            he turns and walks away.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     He disappeared completely.\n                          (beat)\n                     But that's what heroes do.  They simply\n                     fade out.  And in this way --\n\n\n<b>            A SERIES OF DISSOLVES\n</b>\n\n            as Blade moves further and further away from us, dwindling\n            into the horizon until he disappears entirely.\n\n\n<b>                                ABIGAIL (V.0.)\n</b>                     -- they become legends.\n\n\n<b>                                                            FADE TO BLACK.\n</b>\n\n            Over darkness we hear the sound of TRAFFIC.\n\n\n<b>            EXT. THE SLAUGHTERED LAMB - NIGHT\n</b>\n\n            FADE IN.  We are moving towards a local punk dive wedged into\n            a crowded block in the meat packing district.\n\n\n            A DOORMAN (LUCIUS) stands outside, checking CUSTOMERS' IDs.We\n            hear HILLBILLY THRASH MUSIC coming from within.\n\n\n<b>            ANGLE ON KING AND ABIGAIL\n</b>\n\n            approaching.  King holds his four-barreled rifle.  Abigail\n            peels away, disappearing into an alley as King nears the front\n            door.  The doorman recognizes King, knows he's trouble.\n\n\n<b>                                KING\n</b>                     Evening Lucius.\n\n\n<b>                                LUCIUS\n</b>                     King, what the hell are you doing here?\n\n\n<b>                                KING\n</b>                     Just a little sport hunting.\n\n\n<b>            INT. CLUB CROWBAR - NIGHT\n</b>\n\n            A BAND belts out a cover of Sam and the Shams' Little Red\n            Riding Hood.  The band members look a little lupine.  As King\n            weaves his way through the crowd, Lucius hurries alongside.\n\n\n<b>                                LUCIUS\n</b>                     Ain't no vampires left, King.  So who do\n                     you have to hunt?\n\n\n<b>                                KING\n</b>                     That's an interesting question, my friend. \n                     And I've got a question for you in return.\n\n\n<b>            INT. CLUB CROWBAR - BACK AREA - NIGHT\n</b>\n\n            As King pushes his way through to the bathrooms, we hear an\n            UNEARTHLY ROAR coming from the men's room.\n\n\n<b>                                KING\n</b>                     What do you get when you cross a vampire\n                     with a werewolf?\n\n\n            The door to the men's room EXPLODES OPEN.  Abigail comes\n            flying out.  She hits the far wall of the hallway, slides to\n            th floor.  But she's up in an instant, pulling a knife on --\n\n\n<b>                                KING\n</b>                          (raising his four-barrel)\n                     A fur coat that sticks to your neck.\n\n\n<b>            A HILL-BILLY HIPSTER WERE-CREATURE,\n</b>\n\n            wearing a blood-soaked Stray Cats-style suit.  The ephedrine\n            nightmare creature looks at King, opening his elongated snout\n            to flash a set of razor-sharp canid teeth.\n\n\n<b>                                KING\n</b>                     Don't you know fur is murder?\n\n\n            As King FIRES point-blank into the were-creature we --\n\n\n<b>                                                             CUT TO BLACK.\n</b>\n\n<b>            CUE MUSIC.\n</b>\n\n<b>            END CREDITS ROLL\n</b>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Blade: Trinity</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David S. Goyer\" title=\"Scripts by David S. Goyer\">David S. Goyer</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Blade: Trinity Script.html#comments\" title=\"Blade: Trinity comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:00:41.609431"}