{"title": "Blade", "film_link": "/Movie Scripts/Blade Script.html", "script_link": "/scripts/Blade.html", "info_raw": "\n\nBlade Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.29 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David S. Goyer\nGenres  Action  Horror  Sci-Fi\n\nRead \"Blade\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nBLADE - by David S. Goyer\n\n\n\n\n\n\n\n\n\n\n\n                                BLADE\n                                -----\n\n\n\n\n\n                                  by\n \n                            David S. Goyer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tDarkness, BLOOD-CURDLING SCREAMS. Presentation credits roll as we\n\tFADE UP ON:\n\n\tINT. HOSPITAL, INNER-CITY TRAUMA WARD - NIGHT\n\n\tIt's 1967, the Summer of Love and --\n\n\tBOOM! Entry doors swing open as PARAMEDICS wheel in a FEMALE BLEEDER,\n\tVANESSA (20s, black, nine months pregnant). She's deathly pale,\n\tspewing founts of blood from a savagely slashed throat -- \n\n\tA SHOCK-TRAUMA TEAM swarms over her, inserting a vacutainer into an\n\tartery to draw blood, wrapping a blood pressure cuff around her\n\tarm --\n\n\t\t\t\tNURSE #1\n\t\t\t(with stethoscope)\n\t\tShe's not breathing!\n\n\t\t\t\tSENIOR RESIDENT\n\t\tIntubate her!\n\n\tThe RESPIRATORY THERAPIST feeds an endotracheal tube down the woman's\n\truined throat, attaches that to an Amblu bag --\n\n\t\t\t\tRESIDENT\n\t\tBlood-pressure's forty and falling --\n\n\tThe woman starts spasming violently. It takes three staff members\n\tjust to hold her down.\n\n\t\t\t\tSENIOR RESIDENT\n\t\tJesus, her water's broken --\n\t\t\t(calling for help)\n\t\tShe's going into uterine contractions --\n\n\tCAMERA PUSHES IN on the woman as she bolts upright, SCREAMING to wake\n\tthe dead. We PLUNGE INTO the darkness of her mouth and find\n\tourselves --\n\n\tINSIDE HER BLOODSTREAM\n\n\tThe sound of a HEART BEATING, pounding as we whip-snake through --\n\n\tCORPUSCLES \n\n\tfloating in amber plasma. Erythrocytes, leukocytes, neutrophils and\n\teosinophils. \n\n\tThe rhythmic expansion of the artery walls, pulsing with each\n\tsuccessive surge of blood as the HEART BEATS FASTER AND FASTER,\n\ttaking us --\n\n\tIN UTERO,\n\n\tA CHILD, alive but unborn, shifting in a sea of amniotic fluid,\n\tsurrounded by the white, protective substance known as vernix\n\tcaseosa. The HEARTBEAT races like a locomotive now. The unborn child\n\tshifts, turns its head towards us --\n\n\t-- and opens its eyes.\n\n\tCUT TO:\n\n\tA SWORDBLADE\n\n\tcleaving the darkness, radiant light slicing across gleaming Damascus\n\tsteel. Words acid-etched in the weapon's fine-tempered surface:\n\n\tBLADE\n\n\tMain credits end.\n\n\tEXT. INNER CITY, INDUSTRIAL GHETTO - NIGHT\n\n\tA decaying no man's land populated by condemned buildings and HUNGRY\n\tHOMELESS. Steam rises from manhole covers, drifting across the\n\tlitter- lined streets. Suddenly --\n\n\tA black Mercedes 850 appears over the crest of a hill, ROARING past\n\tus, stereo system belting out FILTER.\n\n\tINT. MERCEDES - NIGHT\n\n\tRaquel, a wasp-wasted woman, sits behind the wheel. 20s, rich,\n\tsickeningly attractive. Hungry eyes. \n\n\tSquirming around in the passenger seat is DENNIS, a model/actor boy-\n\ttoy with a sub-zero IQ and a \"fuck me sideways\" grin. \n\n\t\t\t\tDENNIS\n\t\tSo where we going?\n\n\t\t\t\tRAQUEL\n\t\tIt's a surprise. \n\n\t\t\t\tDENNIS\n\t\tI likes surprises. \n\n\tRaquel eyeballs Dennis -- \"if looks could devour\". \n\n\t\t\t\tRAQUEL\n\t\tWhat do you have down there, little \n\t\tman?\n\n\t\t\t\tDENNIS\n\t\tHeat-seeker.\n\n\t\t\t\tRAQUEL\n\t\tI'll bet.\n\n\tRaquel slides a manicured hand up his thigh, squeezes his groin.\n\tDennis MOANS. She pulls her hand away, downshifts.\n\n\tEXT. VACANT LOT - NIGHT\n\n\tThe 850 threads a narrow alley into a vacant lot, BRAKES hard. Raquel\n\tand Dennis climb out. She leads him into --\n\n\tEXT. MEAT PACKING PLANT - NIGHT\n\n\tIndustry never sleeps, and certainly not this grisly facility. Raquel\n\tleads Dennis around the back of the plant, where a host of WORKERS\n\tare loading refrigerated trucks with product.\n\n\t\t\t\tDENNIS\n\t\tWhat the fuck are we doing here?\n\n\tRaquel just smiles, heads on into the plant via a loading door. The\n\tworkers ignore her.\n\n\tINT. MEAT PACKING PLANT - NIGHT\n\n\tDennis follows Raquel through the bowels of the plant, catching\n\tglimpses here and there of carcasses being rendered or hacked apart. \n\n\tThrough one partially open door we see what might be a line of\n\tBODYBAGS being trundled into the back of a truck via a hook and chain\n\tpulley-system. But Dennis doesn't have enough time to be disturbed by\n\tthe vision, because he's being pulled away by Raquel, led down --\n\n\tA STAIRWELL\n\n\tWe are in the basement now. At the end of the hall is a steel door,\n\twith perhaps, just the faintest HINT OF MUSIC heard coming from\n\tbeyond. Raquel knocks.\n\n\tA \"peep-hole\" slat opens and a BLACK LIGHT shines into Raquel's eyes.\n\tA VOICE behind the door offers a verbal challenge, speaking a\n\tlanguage we've never heard, laced with a devilish cadence. \n\n\tRaquel responds in kind. The door opens. Raquel gives Dennis a\n\tknowing wink, enters. Dennis follows. \n\n\tINT. CLUB - NIGHT\n\n\tRaquel and Dennis move past a hulking DOORMAN, making their way down\n\ta narrow stairway. Dennis is suitably impressed.\n\n\tTHE CLUB \n\n\tis elite, underground -- an \"abattoir-chic\" version of an old-time\n\tjuke joint with a greasy, dangerous vibe. White-tiled walls and\n\tfloors for easy hosing, chromed fittings, run-off gutters, drains. No\n\tbar.\n\n\tBODIES \n\n\twrithe on the strobe-lit dance floor. A heavy S&M scene. Leather.\n\tLatex. Tattoos. Body-piercings.\n\n\tA D.J. wearing head-mounted spotlights orchestrates the tunes on\n\ttwin- decks. MUSIC assaults us -- a beat so heavy it could jar the\n\tfillings from your teeth. Brutal \"DARKCORE\" along the lines of\n\tProdigy or Underground. \n\n\tRaquel pulls Dennis out onto the dance floor. They sway. \n\n\tA lupine-featured GAULTIER GIRL with a streak of white running\n\tthrough her raven hair moves in behind Dennis, pressing up against\n\thim. Rachel Williams as the Angel of Death -- we'll call her MERCURY.\n\n\tMercury flicks her tongue against Dennis' ear -- it's been pierced\n\twith a silver post which clicks against her teeth. Tattooed across\n\ther back in black is a swirling, tribal vortex. \n\n\tDennis is now sandwiched between Raquel and Mercury, the three of\n\tthem dry-humping their way to every man's glory. \n\n\tThe beat gets LOUDER. The action heavier. The atmosphere more\n\tnarcotic. People are stripping off their clothes, sweating like\n\tfiends. It's a virtual orgy.\n\n\tDennis laughs, reveling in the hedonism. Everything rises to a fever\n\tpitch --\n\n\t\t\t\tDENNIS\n\t\t\t(over the music)\n\t\tFuck, I need a drink!!!\n\n\tRaquel just smiles -- then Dennis notices a DROP OF SOMETHING spatter\n\this hand. It looks like blood. Dennis looks up, concerned --\n\n\t-- MORE BLOOD DROPLETS are falling. Raquel's face is sprinkled with\n\tthem now. Dennis stops dancing. What is this? Some kind of fucked up\n\tperformance art?\n\n\tRaquel turns her face toward the ceiling, as if washing herself in a\n\tsummer shower, now the other club goers are looking up too --\n\n\tBLOOD SHOWERS DOWN\n\n\tfrom sprinkler heads in the ceiling, drenching the dancers. The club\n\tgoers love it, thrusting their heads back, mouths open wide to\n\treceive the crimson offering. \n\n\tHorrified, Dennis recoils, turning towards --\n\n\tRAQUEL,\n\n\twhose face morphs into a preternatural snarl. Her canines extend,\n\ttapering to razor-sharp points. Her tongue flicks, lizard-like as\n\tfingernails sharpen into claws. All this while the whites of her eyes\n\tBLEED RED, pupils oscillating hypnotically. \n\n\t\t\t\tRAQUEL\n\t\tWhat's wrong, baby?\n\n\tDennis SCREAMS, pushes away from Raquel, only --\n\n\t-- Mercury has fangs now too. In fact, everyone in the club does,\n\twith the exception of poor Dennis. That's because they're all\n\tvampires.\n\n\tDennis tries to run, but the burly Doorman blocks his exit, brutally\n\tsmashing his fist into Dennis' face. \n\n\tDennis falls, dazed. The club-goers close in around him. They make a\n\tgame of it, shoving him from one person to another, their pale faces\n\tleering like twisted jack-o-lanterns.\n\n\tThe strobe lights quicken to a seizure-inducing intensity. Dennis\n\tspins, tumbling into Raquel's arms. She shoves him forward -- Dennis\n\tlands on the floor, falling at someone's boot-clad feet. He looks up.\n\tA DARK FIGURE sits in the shadows, unnoticed until this moment. The\n\tfigure stands, moves into the light as time screeches to a halt -- \n\n\tA BLACK MAN, \n\n\ttowers above Dennis, wearing dark glasses and a leather longcoat -- a\n\tsneer of cruel contempt etched upon a face tempered by a lifetime of\n\thorror. His name is BLADE.\n\n\tBlade whips open his long coat, shrugging it off, revealing an\n\tarsenal of high-tech weapons strapped to his body: \n\n\t6-point adjustable body armor, a modified CAR-15 assault rifle with\n\tan ultra-violet entry light, two Casull .454 revolvers, a \"Demon\"\n\tautomatic cross-bow, a bandoleer of mahogany stakes, an Indian-style\n\tkatar punching dagger -- and last, but certainly not least, his\n\tnamesake -- a silver sword which is secured in a back-scabbard.\n\n\tCLOSE ON BLADE\n\n\tA gaze as cold and pitiless as a midnight sun. The vampire club-goers\n\tstare back. Nuclear silence. And then --\n\n\tAll hell breaks loose. With a SNARL, Raquel charges at Blade, moving\n\tat superhuman speed, practically a blur -- \n\n\tBlade draws his Casulls, FIRES in multiple directions --\n\n\tMACRO BULLET SHOT \n\n\tas a round roars through the air towards Raquel. A silver-tipped dum-\n\tdum bullet which explodes on contact.\n\n\tWHAM! The round punches a fist-sized hole through Raquel's chest,\n\tcontinuing on into the vamp behind her! Vampire blood fountains. Both\n\tcreatures tumble forward, their bodies liquefying into puddles of\n\tblack oil which go gurgling down the run-off drains.\n\n\tBlade continues FIRING, then -CLICK!- magazines empty. Next. He\n\tholsters the Casulls, swings up his assault rifle, calmly flicks on\n\tthe UV entry light mounted above --\n\n\tMERCURY \n\n\tleaps twenty feet straight up into the air. We've never seen anything\n\tmove so fast. She CRASHES through a glass skylight, disappearing into\n\tthe night just as --\n\n\t-- a shaft of blinding UV \"sunlight\" cuts across the vampires. They\n\trear back, skin smoking from the light's corrosive effects. Blade\n\topens FIRE, pumping round after round of wooden fragmentation bullets\n\tinto the crowd -- vampire genocide.\n\n\tThe strobe lights flicker as the mayhem mounts. Some of the vampires\n\ttry to flee, scurrying up the stairs, but the exit quickly becomes\n\tclogged with liquefying bodies -- \n\n\t-- then Blade's CAR-15 jams. The remaining club-goers see their\n\topening, surge forward en masse -- \n\n\tBlade drops the rifle, reaches over his shoulder and -SCHINGGG!-\n\tunsheathes his sword with a double-handed grip. \n\n\tTHE SWORD\n\n\tFour acid-etched feet of blood-soaked Damascus steel. An edge so\n\tsharp it could cleave a shadow in two.\n\n\tBlade moves like lightning, hacking his way into TWO CHARGING\n\tVAMPIRES. Blade spins again, cuts ANOTHER VAMPIRE clean in half --\n\n\tON THE FAR END OF THE CLUB,\n\n\ta LATEX-CLAD VAMP makes a break for it. Blade flings his sword,\n\tsending it spinning end over end -- THUNK! The sword punches into the\n\tvampire's heart. The hellish creature convulses, dies.\n\n\tBeat. Blade retrieves his sword, then senses --\n\n\tSOMETHING BIG\n\n\trising up behind him. In a flash, Blade swings his sword downward,\n\tcutting off the vampire's right hand at the elbow. The severed limb\n\tfalls to the floor -- \n\n\t-- but it doesn't slow the hulking creature down. It SLAMS into\n\tBlade. Blade flies backwards thirty feet, tumbling over tables,\n\tslamming into the rear wall so hard that plaster rains down from the\n\tceiling. \n\n\tBlade suddenly finds himself wrestling with a feral-faced six-foot-\n\tsomething nightmare named QUINN. The vampire rears back its head,\n\tjaws stretching wide. Every inch of his face is covered with ritual\n\tscarification patterns and Maori-like tribal tattoos. \n\n\tBlade forces an elbow against Quinn's throat, trying to keep him at\n\tbay. With his other hand he reaches to his bandoleer, pulls out a\n\tstake -- CRUNCH! Blade shoves the stake through the vampire's larynx.\n\tQuinn gurgles, clutches at his throat. \n\n\tBlade rolls out from under, unholsters the cross-bow secured to his\n\tleg. With a flick of a switch the arms of the bow -SNAP!- open,\n\tdrawing the bow-string taut. Blade FIRES -- \n\n\tThe bolt hits Quinn in the shoulder, throwing him backwards and\n\tnailing him to the wall. As Quinn reaches over with his other hand to\n\tpull out the stake --\n\n\tBlade FIRES AGAIN. A second bolt slams into Quinn's other arm,\n\teffectively pinning him like a butterfly to a board.\n\n\tUP ABOVE, \n\n\tmounted in one of the corners, is a security camera. Blade fires a\n\tcross-bow bolt straight into the lens. \n\n\tBlade strides over, placing his sword against Quinn's chest.\n\n\t\t\t\tBLADE\n\t\tWhere is Deacon Frost?\n\n\tQuinn glares, trying to speak, gagging on the stake still lodged in\n\this trachea --\n\n\t\t\t\tBLADE\n\t\tGot something in your throat.\n\n\tBlade yanks the stake free. The vampire laughs, air whistling through\n\this ruined larynx. \n\n\t\t\t\tQUINN\n\t\tFuck you, Day-walker, I ain't saying \n\t\tshit --\n\n\t\t\t\tBLADE\n\t\tFrost.\n\n\tQuinn responds with a slew of rapid-fire vampire invectives. Blade\n\tsees he's getting nowhere fast, calmly sheathes his sword. He unclips\n\ta white phosphorous grenade from his combat harness -- \n\n\t\t\t\tQUINN\n\t\tYou won't stop him, Blade. The Tide's \n\t\trising, the Sleeper's gonna --\n\n\tBlade shoves the grenade in Quinn's mouth, pulls the pin. WHOOSH!\n\tQuinn goes up like a roman candle. Blade turns, surveying his work,\n\tignoring the howling pyre behind him:\n\n\tAll evidence of the vampires is gone -- with the exception of a few\n\toily-black puddles. Clothes, jewelry -- it's all been burned away by\n\tthe acidic process of the creatures' accelerated decomposition.\n\n\tDENNIS sits huddled in a corner, having pissed his pants. As Blade\n\tapproaches, he cringes back --\n\n\t\t\t\tDENNIS\n\t\tPlease don't --\n\n\tBlade simply grabs Dennis by the jaw, tilting his head upward,\n\trotating it from side to side -- looking for bite marks. There aren't\n\tany.\n\n\tBlade moves on, leaving Dennis alone amidst the carnage. As Blade\n\tstarts up the stairs, he pauses in mid-step --\n\n\tA COCKROACH\n\n\tscurries out from underfoot. \n\n\tBlade adjusts his footfall, sparing the roach. He continues on up the\n\tstairs, disappearing in the smoky haze. \n\n\tCUT TO:\n\n\tINT. CITY HOSPITAL, AUTOPSY ROOM - NIGHT\n\n\tCAMERA FOLLOWS a bagged corpse as it's rolled into the autopsy room\n\tby an ASSISTANT. \n\n\t\t\t\tASSISTANT\n\t\tBrought you a baked potato, nice\n\t\tand crispy. Still warm, too.\n\n\tCURTIS WEBB, the forensic pathologist (30s, white bread, a little on\n\tthe smarmy side) steps forward, unzips the bag --\n\n\tIt's Quinn, what's left of him, anyway. Burnt to a charcoal\n\tbriquette, limbs twisted horribly, oozing fluids.\n\n\tCurtis turns his head, grimacing, wafting the air.\n\n\t\t\t\tCURTIS\n\t\tJesus, that's rank -- \n\n\tCurtis turns back, makes note of the blackened stump where Quinn's\n\tarm used to be, the ruined throat -- \n\n\t\t\t\tCURTIS\n\t\tWhat's his story?\n\n\t\t\t\tASSISTANT\n\t\tParamedics said he was still screaming \n\t\twhen they found him. Looks like some \n\t\tjoker had stapled him to a wall.\n\n\t\t\t\tCURTIS\n\t\tPretty.\n\n\tCUT TO:\n\n\tINT. HOSPITAL, HEMATOLOGY LAB - NIGHT\n\n\tMICROSCOPE POV\n\n\tof a slide-mounted blood smear stained with Wright stain (blue ink).\n\tWhat we see is a collection of donut-shaped pink things (red blood\n\tcells) intermingled with some small blue specks (platelets) and the\n\toccasional larger, light-blue blobs (white blood cells).\n\n\tKAREN JANSEN (20s), a fine-featured hematologist with a social life\n\tin suspended animation, sits back from the microscope, stumped. Next\n\tto her is JULIE WHITAKER, a cheerful chemtech. \n\n\t\t\t\tKAREN\n\t\tYou took this off a DOA?\n\n\tCurtis sits on a stool nearby, slowly nodding.\n\n\t\t\t\tKAREN\n\t\tThis isn't human blood.\n\n\t\t\t\tCURTIS\n\t\tThen what is it?\n\n\t\t\t\tKAREN\n\t\tI don't know --\n\t\t\t(re: microscope)\n\t\tLook at this blood smear -- \n\n\tCurtis takes a look for himself.\n\n\t\t\t\tKAREN\n\t\tThe red blood cells are biconvex, \n\t\twhich is theoretically impossible. \n\t\tThey're hypochromic, there's virtually \n\t\tno hemoglobin in them. \n\t\t\t(shaking her head)\n\t\tLook at the PMNs, they're binucleated, \n\t\tthey should be mononucleated.\n\n\t\t\t\tCURTIS\n\t\tWhat about the chemistry panel? \n\n\tKaren looks to Julie, who reaches for a computer print-out.\n\n\t\t\t\tJULIE\n\t\tBlood sugar level is three times the \n\t\tnorm, phosphorous and uric acid are \n\t\toff the scales.\n\t\t\t(shrugs)\n\t\tLike the woman said, impossible.\n\n\tKaren removes her glasses, rubbing the bridge of her nose.\n\n\t\t\t\tKAREN\n\t\tCurtis, it's three in the morning. I'm \n\t\treally not in the mood for one of your \n\t\tpractical jokes.\n\n\t\t\t\tCURTIS\n\t\t\t(insistent)\n\t\tIt's not a joke. I've got the stiff \n\t\tsitting in the morgue right now -- \n\t\tlook, just come up and see him, okay? \n\t\tFive minutes, that's all I ask.\n\n\t\t\t\tKAREN\n\t\tI thought you promised to give me some \n\t\tdistance?\n\n\t\t\t\tCURTIS\n\t\tThis is purely professional curiosity, \n\t\tKaren, I swear.\n\n\tKaren rolls her eyes, lets loose a tired sigh.\n\n\t\t\t\tKAREN\n\t\tFive minutes, not a second more. And I \n\t\tdon't want to hear a word about \"us\".\n\n\t\t\t\tCURTIS\n\t\tNo problem.\n\n\tINT. HOSPITAL MORGUE - NIGHT\n\n\tThe dead of night, not a mouse in the house. Curtis and Karen, each\n\tgarbed in a mask, stand on either side of Quinn's body, which now\n\trests on the autopsy table.\n\n\tQUINN'S BODY\n\n\tA preliminary exploratory Y-incision has been made across the chest,\n\tstretching from shoulder to shoulder, then continuing on down the\n\tabdomen. Ribs and cartilage have been cut open to expose the heart\n\tand lungs.\n\n\t\t\t\tKAREN\n\t\tYou haven't started in on the internal \n\t\torgans?\n\n\t\t\t\tCURTIS \n\t\tJust the blood sample from the \n\t\tpericardial sac.\n\n\tCurtis pauses, studying Quinn's disfigured face -- the features seem\n\tmuch less damaged now -- almost as if the corpse were healing itself.\n\n\t\t\t\tCURTIS\n\t\tThat's weird --\n\n\t\t\t\tKAREN\n\t\tWhat?\n\n\t\t\t\tCURTIS\n\t\tHe looks different now, burns are less \n\t\textreme, some of these wounds have \n\t\tclosed up -- \n\n\tCurtis pulls out a penlight, flicks it on. He leans over Quinn,\n\tshining the light into one of his eyes.\n\n\t\t\t\tCURTIS\n\t\tTell me something, honestly, you ever \n\t\thave second thoughts about us?\n\n\t\t\t\tKAREN\n\t\t\t(grudgingly)\n\t\tSometimes --\n\n\tCurtis looks up from the corpse, grinning beneath his mask.\n\n\t\t\t\tKAREN\n\t\t-- but then I remember what an \n\t\tass-hole you were and I'm snapped back \n\t\tto reality. \n\n\t\t\t\tCURTIS\n\t\tJesus, Karen, you're breaking my heart \n\t\there --\n\n\tQuinn suddenly bolts up from the autopsy table, sinking his fangs\n\tinto Curtis' jugular. He snaps the man's neck in two for easier\n\taccess, sucking in blood like a living vacuum. \n\n\tKaren stumbles backwards, sending autopsy tools CLATTERING.\n\n\tQUINN\n\n\trises from the table, flinging Curtis' twitching body aside. He curls\n\this blood-soaked lips back, baring viper-like fangs, emitting a\n\tGUTTURAL GROWL --\n\n\t\t\t\tQUINN\n\t\t\t(crazed by thirst)\n\t\t-- more -- blood --\n\n\tKaren backs into the corpse drawers, but Quinn is upon her in a half-\n\tsecond, wrapping a hand about her throat. His mouth opens/morphs\n\tdisturbingly wide as if to swallow her head whole, caustic saliva\n\tdripping from his canines -- \n\n\tKaren tries to turn her head away, but Quinn's grip is vise-like. She\n\tfinds herself staring into his eyes -- pupils pulsing rapid-fire,\n\topening and closing, hypnotic --\n\n\tAs Quinn sinks the tips of his fangs into Karen's carotid artery and\n\tstarts to nurse --\n\n\tBANG!!! A load of MAHOGANY buckshot chews into Quinn's side. He HOWLS\n\tin pain. Another load catches him full in the face. He drops Karen.\n\tShe falls to the floor -- \n\n\tKAREN'S POV\n\n\tThe sound of RUSHING BLOOD pounding through her skull. Everything\n\tspinning. She struggles to move, turns her head, finds herself eye to\n\teye with Curtis' corpse.\n\n\tON QUINN\n\n\trising, his face torn up, smoking. WHIP PAN TO --\n\n\tBLADE, \n\n\tstanding at the entrance to the morgue, a streetsweeper auto-shotgun\n\tin hand, sizing Quinn up.\n\n\t\t\t\tBLADE\n\t\tNow don't we look dapper?\n\n\tQuinn BELLOWS with rage, ripping one of the heavy steel refrigeration\n\tdoors from its hinges, flinging it at Blade like it was lawn\n\tfurniture --\n\n\tBlade rolls to the side as the door CRASHES against the wall. Quinn\n\truns, moving through the morgue like a human tornado, heading for the\n\twindows at the end of the room --\n\n\tSMASH!!! Out goes Quinn, taking half the wall with him. Blade rushes\n\tto the decimated window, looks down --\n\n\tBLADE'S POV\n\n\tQuinn lands on the roof of an ambulance parked four stories below,\n\tcaving it in. He springs off, loping across the tarmac on three\n\tlimbs, then -SCREECH!-THWUMP!- rolling up onto the hood of an\n\toncoming car, before disappearing into the night --\n\n\tBACK UP ABOVE,\n\n\tBlade spins, SEES Karen bleeding her life away on the floor. She\n\treaches a hand out to him, beseeching --\n\n\tBlade pulls away from her grasp, takes a step towards the exit --\n\tthen hesitates. \n\n\tA flicker of doubt washes across Blade's face. He looks down at Karen\n\tonce more, wrestling with his conscience, finally making a decision.\n\tHe kneels, scoops Karen up into his arms. Just then, \n\n\tTWO POLICEMEN \n\n\trush into the morgue, weapons drawn --\n\n\t\t\t\tUNIFORM #1\n\t\tHold it, ass-hole!\n\n\tBlade ignores them, turning to face the window before him. It's a\n\tgood thirty feet to the roof of the adjacent building, a parking\n\tstructure -- and damned if Blade doesn't seem to be considering the\n\tjump.\n\n\tThe Police close in, agitated. Blade crouches, switches Karen to a\n\tone-handed grip --\n\n\t\t\t\tUNIFORM #1\n\t\tI said hold it!!!\n\n\t-- and jumps.\n\n\tEXT. HOSPITAL/ROOFTOP PARKING STRUCTURE - NIGHT\n\n\tBlade clears the impossible distance -- almost. He snags the ledge of\n\tthe adjacent parking structure with his left hand even as Karen slips\n\tfrom the grasp of his right --\n\n\t-- a last-second save, his fingers clamping around her wrist, is all\n\tthat stands between Karen and street pizza. She SCREAMS anyway,\n\tdangling below him --\n\n\tBlade GRUNTS, swinging Karen like a pendulum, heaving her up and over\n\tthe ledge as if she were a sack of potatoes. She lands on her\n\tshoulder, clutching it in pain --\n\n\tBlade heaves himself up, crouching beside her.\n\n\t\t\t\tKAREN\n\t\t\t(gasping)\n\t\tMy shoulder -- dislocated --\n\n\tBlade places a hand on her shoulder, another around her elbow and\n\twithout any consideration to discomfort -CRACK!- brutally pops it\n\tback in place. Karen SCREAMS again as he scoops her up once more and\n\theads for --\n\n\tHIS '69 OLDSMOBILE 442, \n\n\twhich is parked nearby. Midnight-black. The definitive high-\n\tperformance heavy-metal muscle machine with an engine big enough to\n\tpower an Apollo rocket. \n\n\tINT. BLADE'S OLDS - NIGHT\n\n\tBlade sets Karen down in the passenger seat, climbs behind the wheel,\n\tkeys the ignition. The engine ROARS to life, belching fumes through\n\tthe dual exhaust. Blade floors it, burning serious rubber as the Olds\n\tvanishes from sight. \n\n\tBACK AT THE DEMOLISHED MORGUE WINDOW \n\n\tas the two policemen stare numbly in open-mouthed astonishment.\n\n\tCUT TO:\n\n\tEXT. CITY STREETS - NIGHT\n\n\tBlade pilots the Olds down the streets, moving through a series of\n\tincreasingly degenerating neighborhoods, coming at last to the\n\tsprawling warehouse district.\n\n\tEXT. ABANDONED FACTORY - NIGHT \n\n\tThe Olds approaches a mammoth industrial facility that's been\n\tcordoned off by cyclone fencing and razor wire. Ultra-violet\n\tfloodlights illuminate the area, while an army of security cameras\n\tkeep a watchful eye. \n\n\tINT. BLADE'S OLDS - NIGHT\n\n\tBlade glances at Karen, cursing himself for giving into his emotions.\n\tHe hits a remote secured to the sun visor --\n\n\tEXT. BLADE'S OLDS/ABANDONED FACTORY - NIGHT\n\n\tA gate grinds open. \n\n\tWe follow the Olds as it cruises around the back of the building,\n\theading down a concrete loading ramp. At the bottom of the ramp, a\n\theavy iron door rises. Blade's Olds disappears into the darkness.\n\n\tINT. ABANDONED FACTORY, INDUSTRIAL ELEVATOR - NIGHT\n\n\tMore UV lights flicker on. We're in a massive loading elevator which\n\tHUMS as it ascends, eventually reaching its destination with a\n\tBOOMING CLANG. The doors at the rear glide open. Blade guides the\n\tOlds out.\n\n\tINT. ABANDONED FACTORY, WHISTLER'S WORKSHOP - NIGHT\n\n\tSet up in an old ironworks, the place looks like a cross between an\n\tauto junkyard and an armory. Equipment is strewn everywhere --\n\tlathes, mills, old furnaces, gutted vehicles, an ad hoc surgical\n\ttheater -- all of it jerry-rigged in a brutal, oily-tech.\n\n\tBlade climbs out of the Olds. He opens the passenger door and pulls\n\tKaren out, carries her in his arms. \n\n\t\t\t\tBLADE\n\t\tWhistler!\n\n\t\t\t\tWHISTLER (O.S.)\n\t\tAre we bringing home strays now?\n\n\tABRAHAM WHISTLER (60s)\n\n\thobbles out of the shadows, leaning heavily on a cane. Gimlet-eyed,\n\tbitter, his right leg encased in a metal brace. Though his face is\n\tlined with wrinkles and his hair has long since gone gray, we sense\n\the could kick the living shit out of any man half his age. \n\n\t\t\t\tBLADE\n\t\tShe's been bitten.\n\n\t\t\t\tWHISTLER\n\t\tYou should've killed her, then.\n\n\t\t\t\tBLADE\n\t\tShe hasn't turned yet. \n\t\t\t(pointedly)\n\t\tYou can help her.\n\n\tBlade and Whistler stare each other down. Finally, Whistler turns and\n\theads over to the operating theater.\n\n\t\t\t\tWHISTLER\n\t\tNo promises. You watch her close. She \n\t\tstarts to turn, you finish her off.\n\n\tBlade nods, lays Karen down on the operating table. Whistler turns on\n\tan overhead light. Karen is sheathed in sweat, ashen. She's lost a\n\tlot of blood.\n\n\tWhistler snaps on a pair of surgical gloves, probes the wound in\n\tKaren's neck with an antiseptic swab -- there's capillary damage\n\taround the perimeter of the wound, the tissue looks bruised,\n\tgangrenous. \n\n\t\t\t\tWHISTLER\n\t\tLocalized necrosis. She's borderline. \n\t\tAnother hour and she'd be well into \n\t\tthe change.\n\n\tWhistler cracks open a smelling salt capsule and waves under Karen's\n\tnose. As she starts to stir --\n\n\t\t\t\tWHISTLER\n\t\tCan you hear me, woman? \n\n\tKaren's eyes open wide. She's scared, disoriented --\n\n\t\t\t\tKAREN\n\t\tWhat -- ?\n\n\t\t\t\tWHISTLER\n\t\tYou've been bitten by a vampire. We've \n\t\tgot to try and burn out the venom, \n\t\tjust like a rattlesnake bite --\n\n\tWhistler reaches for a massive syringe filled with caustic-looking\n\tfluid. Karen sees the syringe, resists --\n\n\t\t\t\tWHISTLER\n\t\tHold her. \n\n\tBlade forces Karen back. Whistler readies the syringe.\n\n\t\t\t\tWHISTLER\n\t\t\t(reading her name tag)\n\t\t\"Dr. Karen Jansen\". Listen close, I'm \n\t\tgoing to inject you with an antidote \n\t\tmade from allium setivum -- garlic. \n\t\tThis is going to hurt. A lot. \n\n\tWhistler sinks the needle into Karen's neck and depresses the\n\tplunger. \"Hurt\" doesn't begin to describe what Karen experiences\n\tnext. Imagine undergoing childbirth while someone pumps battery acid\n\tthrough your veins.\n\n\tKaren SHRIEKS, her body going into uncontrolled paroxysms. The wound\n\ton her neck begins to smoke as the antidote attacks the poisonous\n\tvampire venom.\n\n\tKaren clutches at Blade's arms, digging her nails in. She stares up\n\tat him with unflinching intensity, like a child desperately searching\n\tfor assurance. \n\n\tON BLADE,\n\n\tuncomfortable playing the roll of nursemaid. He'd like nothing more\n\tthan to be done with this, but the only thing he can do is hold Karen\n\twhile she rides out the seizures. \n\n\tKAREN'S POV\n\n\tgrowing darker by the moment. The last thing she sees is Blade\n\tstaring down at her -- then the night closes in. \n\n\tINT. HOUSE OF EREBUS, MEETING ROOM - NIGHT\n\n\tCLOSE ON a monitor featuring footage taken at the vampire club\n\tmassacre. Blade turns and stares into the camera, fires his cross-\n\tbow. The screen cuts to static.\n\n\tA WITHERED, CLAWED HAND\n\n\tmoves into frame, holding a remote. With a tap of a button, the\n\tmonitor goes dark. \n\n\tPULL BACK TO REVEAL a large, minimalist conference room -- the House\n\tof Erebus, seat of the vampire race's legislative assembly.\n\n\tGathered around a massive table are the TWELVE VAMPIRE ELDERS,\n\trepresenting a \"rainbow\" of racial colors -- names like PALLINTINE,\n\tVON ESPER, ASHE, BAVA. Two of them, the FAUSTINAS, are identical\n\ttwins -- lethal-looking women with alabaster skin. \n\n\tChilled carafes filled with blood are situated along the table. From\n\ttime to time, a member will pour themselves a glass, or perhaps, help\n\tthemselves to the bowls of human finger bones which serve as snacks.\n\n\tAt the head of the table is GAETANO DRAGONETTI, current vampire\n\t\"Overlord\". Blood-red eyes, parchment skin stretched over skull-like\n\tfeatures. Incalculably ancient, but still deadly and virile as a\n\tviper. \n\n\tDragonetti speaks. He uses the \"secret tongue\" -- the ancient vampire\n\tlanguage which utilizes consonants human vocal chords are incapable\n\tof reproducing. \n\n\t\t\t\tDRAGONETTI \n\t\t\t(subtitled)\n\t\tBlade. Once again, our interests have \n\t\tfallen victim to his ridiculous \n\t\tcrusade. He must be destroyed.\n\n\t\t\t\tFROST (O.S.)\n\t\t\t(in English)\n\t\tYou're wrong, Dragonetti. \n\n\tAll heads turn. Who would dare such impudence?\n\n\tDEACON FROST, \n\n\ta mere \"Underlord\" in the vampire hierarchy, steps forward.\n\tStrikingly handsome, younger, less conservative than his superiors,\n\tfueled with a passionate intensity. Amongst the vampire community\n\the's known as an agitator. He's also the vampire equivalent of a\n\tracial supremacist.\n\n\t\t\t\tFROST\n\t\tThe Day Walker represents a unique \n\t\topportunity. We'd be fools to waste \n\t\tit by killing him. \n\n\t\t\t\tDRAGONETTI\n\t\t\t(subtitled, taking umbrage)\n\t\tDeacon Frost. You refuse to speak our \n\t\tlanguage, you insult the House of \n\t\tErebus by using the humans' \n\t\tgutter-tongue, have you no respect \n\t\tfor tradition? \n\n\t\t\t\tFROST\n\t\tWhy should I respect something which \n\t\thas outlived its purpose?\n\n\tThis causes quite a stir amongst the other vampires. Frost might as\n\twell have slapped Dragonetti in the face.\n\n\t\t\t\tDRAGONETTI\n\t\t\t(simmering)\n\t\tI see. And what would you have us do \n\t\twith this \"half-breed\"?\n\n\t\t\t\tFROST\n\t\tStudy him. Unlock the secrets of his \n\t\tDNA. He's the key we've been looking \n\t\tfor. \n\n\t\t\t\tDRAGONETTI\n\t\tHe is an abomination! \n\n\tDragonetti slams his fist down, toppling a carafe, spilling blood\n\tacross the tabletop. Frost looks to the others --\n\n\t\t\t\tFROST\n\t\tWhy should we spend our lives \n\t\tcringing from the daylight when his \n\t\tblood offers us an alternative? \n\t\tEnough talk. It's time we stepped out \n\t\tof the shadows!\n\n\tDragonetti looks apoplectic. ELDER PALLINTINE, a five-hundred year-\n\told vampire inhabiting the body of a prepubescent boy, interjects.\n\n\t\t\t\tPALLINTINE\n\t\tYou're out of line, Frost.\n\n\t\t\t\tFROST\n\t\tAm I? Or am I just the first to say \n\t\tout loud what we've all been \n\t\tthinking? \n\n\tThe fact that no one answers is telling. Dragonetti glowers at the\n\tother Elders, sensing the tide turning.\n\n\t\t\t\tDRAGONETTI\n\t\tThe shadows suit us, Frost. We've \n\t\texisted this way for thousands of \n\t\tyears. Who are you to challenge our \n\t\tways?\n\n\t\t\t\tFROST\n\t\tSomeone who's sick of living off \n\t\tscraps. The coming age belongs to us, \n\t\tnot the humans! \n\t\t\t(to the others)\n\t\tWhen the final war between our races \n\t\tcomes, who do you want leading the \n\t\tcharge? \n\n\tFrost stabs an accusing finger at the Overlord.\n\n\t\t\t\tFROST\n\t\tSome withered up fossil ready to snap \n\t\tlike a brittle bone at the first sign \n\t\tof change?\n\n\tDragonetti GROWLS like an beast, raking his claws across the tyro\n\tvampire's face, knocking him to the ground. \n\n\t\t\t\tDRAGONETTI\n\t\tGet out!!!\n\n\tFrost picks himself up, touches the gashes on his cheek. Looks at his\n\tfingers, licks the blood from them. \n\n\t\t\t\tFROST\n\t\tCareful, old fang. You might wake up \n\t\tone day and find yourself extinct.\n\n\tFrost smiles at Dragonetti and calmly exits the room.\n\n\tINT. WHISTLER'S WORKSHOP, BLADE'S CELL - DAY\n\n\tON KAREN as she comes to. Her wounds have been bandaged. She rises, a\n\tlittle shaky, takes in her surroundings -- She's in a spartan room,\n\tlike a monk's cell. On the wall is a collection of knives and\n\tdaggers. Some of them wooden, their hilts inscribed with bizarre-\n\tlooking runes. In the center of these weapons rests --\n\n\tBLADE'S SWORD,\n\n\thanging like a cross in a chapel, dominating all else. Karen touches\n\tit. Then her eyes drop to a silver locket which dangles from the hilt\n\tby a tarnished chain. She reaches for it, opens it --\n\n\tThe locket features a photo, old and faded. It's the black woman we\n\tsaw in the prologue, Vanessa, standing in the sunshine. \n\n\tKaren moves towards the door, cautious -- \n\n\tINT. WHISTLER'S WORKSHOP - DAY\n\n\tWe hear VOICES now, coming from beyond a series of black-out\n\tcurtains. Karen pushes one aside and SEES --\n\n\tBLADE\n\n\tstrapped into some kind of Inquisition-esque restraint chair. His\n\tshirt is off, his body slick with sweat. Whistler finishes strapping\n\tBlade in, then stands back, holding up a gas-powered pistol injector,\n\thesitant --\n\n\t\t\t\tWHISTLER \n\t\tI had to increase the dose. You're \n\t\tbuilding up a resistance to the \n\t\tserum --\n\n\t\t\t\tBLADE\n\t\t\t(impatient)\n\t\tJust do it, old man.\n\n\tWhistler nods, fitting Blade with a bite guard. Then he presses the\n\tpistol-injector against Blade's carotid artery. \n\n\tBlade shakes violently, grinding his teeth through the bite guard,\n\tveins cording in his neck. He clutches Whistler's hand, holding it\n\ttightly as he fights his way through the hellish seizure. To his\n\tcredit, Whistler never lets go.\n\n\tMentor and student stare at one another as the mysterious serum runs\n\tits violent course. We understand that these shared moments, oddly\n\tprivate in their horror, are the glue which binds the two vampire\n\thunters together. Finally, Blade slumps forward in his restraints,\n\texhausted. \n\n\tKAREN\n\n\tShe draws back, instinctively knowing that she's just witnessed\n\tsomething she shouldn't have. She looks for an exit, SEES another\n\tdoorway. She makes for it -- \n\n\tINT. WHISTLER'S LAB - TANK ROOM - DAY \n\n\tA dusty, darkened hole of a room, no windows, just shadows, crumbling\n\tconcrete, rust stains, and --\n\n\tA LARGE TANK\n\n\tfilled with swirling blood plasma, choked with electrical leads and\n\tbiomedical sensors. SOMETHING floats within, suspended in the murky\n\tfluid -- a child , two or three years of age, drifting about like a\n\tmedical oddity preserved in formaldehyde -- \n\n\tTHUMP! The child SLAMS up against the glass. Karen backpedals,\n\tstartled. Its eyes are open now, pupils blown. It snarls, revealing a\n\tmouthful of razored fangs, trailing mouth-slime across the glass as\n\tit futilely tries to chew its way through to Karen.\n\n\tKaren stifles a sob, turning and running right into --\n\n\tBLADE,\n\n\twho now blocks the exit, sword in hand. Karen retreats a step,\n\twary --\n\n\t\t\t\tBLADE\n\t\tYou shouldn't be here.\n\n\t\t\t\tKAREN\n\t\tI'm sorry, I --\n\n\t\t\t\tWHISTLER (O.S.)\n\t\tWandered off the beaten path, Doctor?\n\n\tWhistler has entered the room from a second doorway. Karen looks from\n\tWhistler to Blade, trapped between them --\n\n\t\t\t\tKAREN\n\t\tWho are you people?\n\n\t\t\t\tWHISTLER\n\t\tMy name is Abraham Whistler.\n\t\t\t(re: Blade)\n\t\tThis is Blade. As for our little \n\t\thomunculus here --\n\n\tWhistler limps over to the tank, rapping his cane against it. The\n\tcreature snaps at it reflexively, following the silver tip back and\n\tforth like a fish after a lure.\n\n\t\t\t\tBLADE\n\t\t-- he's a vampire.\n\n\t\t\t\tKAREN\n\t\tYou're joking --\n\n\t\t\t\tWHISTLER\n\t\tNot at all. You're looking at a prime \n\t\tspecimen of the homines nocturna. \n\n\tWhistler toys with the feral creature, engaging in a certain amount\n\tof sadistic delight as its efforts grow increasingly more frenzied.\n\tSuddenly, it surges towards the top of the tank, clawing at the\n\tlid --\n\n\tKaren becomes alarmed -- but then a massive ELECTRICAL JOLT shocks\n\tthe creature back into submission. \n\n\t\t\t\tWHISTLER\n\t\tIf Blade hadn't brought you here, you \n\t\twould've wound up like him.\n\n\tKaren brings a hand to her bandaged neck, recalling the events of the\n\tprevious night. She looks to Blade.\n\n\t\t\t\tKAREN\n\t\tWhy did you help me?\n\n\tBlade scowls, his gaze flickering to Whistler.\n\n\t\t\t\tBLADE\n\t\tStupidity.\n\n\t\t\t\tWHISTLER\n\t\t\t(appraising her)\n\t\tMaybe not. I did some checking, she's \n\t\ta hematologist. Knowledge like that \n\t\tmight come in handy.\n\n\t\t\t\tBLADE\n\t\tIt's not worth the risk. We can't \n\t\ttrust her.\n\n\t\t\t\tKAREN\n\t\tWhy?\n\n\t\t\t\tBLADE\n\t\tBecause you're tainted. The venom's \n\t\tstill inside you. You could still \n\t\tturn on us.\n\n\t\t\t\tKAREN\n\t\tWhat happens then?\n\n\tBlade looks to Whistler -- as far as he's concerned, the debate's\n\tover.\n\n\t\t\t\tBLADE\n\t\tThen I have to take you out, just \n\t\tlike any other bloodsucker.\n\n\tBlade turns and exits. Whistler and Karen follow.\n\n\tINT. WHISTLER'S WORKSHOP - DAY\n\n\tBeyond the grimy outer windows, we can see that the day is closing --\n\tlong shadows, amber light. Karen lingers in the doorway, reeling from\n\tinformation overload. \n\n\tBlade begins suiting up for his nightly hunt -- strapping on body\n\tarmor, loading ammunition. He strings the tarnished locket around his\n\tneck as if it were an amulet that could ward off evil, then pauses to\n\tinspect a modified pistol, sighting down the length of it.\n\n\t\t\t\tBLADE\n\t\tWe hunt them, moving from one city to \n\t\tthe next, tracking their migrations. \n\t\tThey're hard to kill. They tend to \n\t\tregenerate.\n\n\tCLACK! Blade pulls the trigger on an empty chamber, then checks his\n\tnext weapon --\n\n\t\t\t\tKAREN\n\t\t\t(sarcastic)\n\t\tSo what do you use, then? A stake?\n\n\t\t\t\tWHISTLER\n\t\t\t(nodding)\n\t\tSome of the old wives' tales are true \n\t\t-- they're severely allergic to \n\t\tsilver, various types of wood. Feed \n\t\tthem garlic and they'll go into \n\t\tanaphylactic shock -- \n\n\tWhistler picks up a customized rifle with a UV entry light, flicking\n\ton the beam.\n\n\t\t\t\tWHISTLER\n\t\t-- and of course there's always \n\t\tsunlight, ultra-violet rays. \n\n\tKaren shakes her head, incredulous -- \n\n\t\t\t\tKAREN\n\t\tAnd you honestly expect me to believe \n\t\tall this?\n\n\t\t\t\tBLADE\n\t\tI don't care what you believe. I \n\t\tsaved your life once, I don't plan on \n\t\tmaking a habit of it. You want my \n\t\tadvice, you'll be out of the city by \n\t\tnightfall. If you're stupid enough to \n\t\tstay, that's your business.\n\n\t\t\t\tKAREN\n\t\tI can't just leave. I have a life \n\t\there, a career --\n\n\t\t\t\tBLADE \n\t\tNot anymore. You've seen one of them. \n\t\tYou won't be allowed to live after \n\t\tthat. \n\n\tKaren stares at Blade. Whistler gestures to the windows --\n\n\t\t\t\tWHISTLER\n\t\tThere's a war going on out there. \n\t\tBlade, myself, a few others -- we've \n\t\ttried to keep it from spilling over \n\t\tonto the streets. \n\t\t\t(beat)\n\t\tSometimes people like yourself get \n\t\tcaught in the cross-fire. \n\n\tWhistler shrugs. As far as he's concerned, there's nothing else to\n\tsay. Karen is still protesting, though. \n\n\t\t\t\tKAREN\n\t\tI can go to the police. I have blood \n\t\tsamples back at the hospital. I can \n\t\tshow them. \n\n\t\t\t\tBLADE\n\t\tDo it. You'll be dead before you can \n\t\tfile the complaint.\n\n\t\t\t\tKAREN\n\t\tThat's ridiculous! No one's that \n\t\tpowerful. \n\n\tWhistler sighs. He doesn't suffer fools gladly.\n\n\t\t\t\tWHISTLER \n\t\tYou're talking about a brotherhood \n\t\tthat predates the Catholic Church by \n\t\tthousands of years. Their survival \n\t\tdepends on their ability to blend in. \n\t\tChances are, you've encountered them \n\t\tand not even known it. On the subway, \n\t\tin a bar --\n\n\tBlade slings his CAR-15 onto his shoulder, impatient. He starts\n\ttowards the Olds, gesturing.\n\n\t\t\t\tBLADE\n\t\tGet in. You\u0092re leaving.\n\n\t\t\t\tWHISTLER\n\t\tWait.\n\n\tWhistler tosses a small metal canister to Karen.\n\n\t\t\t\tWHISTLER\n\t\tConsider it a parting gift. Vampire \n\t\tmace -- silver nitrate, essence of \n\t\tgarlic. \n\n\t\t\t\tKAREN\n\t\t\t(in disbelief)\n\t\tSo that's it? You guys just patch me \n\t\tup and send me on my way?\n\n\t\t\t\tWHISTLER\n\t\tThere is one other thing. I'd buy \n\t\tyourself a gun if I were you. If you \n\t\tstart becoming sensitive to the \n\t\tdaylight, if you start becoming \n\t\tthirsty regardless of much you've had \n\t\tto drink -- then I suggest you take \n\t\tthat gun and use it on yourself. \n\t\tBetter that, than the alternative.\n\n\tKaren stares at Whistler, horrified, as we --\n\n\tCUT TO:\n\n\tINT. THE VAMPIRE ARCHIVES - DAY\n\n\tWe are deep in the narrow stacks of a sepulchral archive. Exactly\n\twhat and where this place is will become more clear later on. \n\n\tBut for now, the CAMERA DRIFTS through the warren of aisles. Along\n\tthe way, we catch a glimpse of a HULKING SILHOUETTE cowering behind a\n\tseries of Japanese shoji screens. Later on, we find --\n\n\tFROST\n\n\ttucked away in a carrel, surrounded by books and scriptures, with\n\tonly the SICKLY GLOW of his laptop to provide light.\n\n\t\t\t\tDRAGONETTI (O.S.)\n\t\tWhat are you doing here?\n\n\tFrost pauses, SEEING Dragonetti emerge from the shadows.\n\n\t\t\t\tDRAGONETTI\n\t\t\t(outraged)\n\t\tThese archives are restricted to \n\t\tmembers of the House of Erebus.\n\n\t\t\t\tFROST\n\t\tPlease. You and the other Elders \n\t\twouldn't know what to do with these \n\t\ttexts if your lives depended on it. \n\t\t\t(cryptically)\n\t\tWhich, of course, they do.\n\n\t\t\t\tDRAGONETTI\n\t\tYou're wasting your time, Frost. Far \n\t\tgreater scholars than you have tried \n\t\tto decipher these words. Whatever \n\t\tsecrets they hold have been lost.\n\n\t\t\t\tFROST\n\t\tPerhaps.\n\n\tFrost studies Dragonetti, a self-satisfied grin on his face. If the\n\tact was intended to unnerve Dragonetti, it succeeded, though the\n\tancient vampire would never admit it.\n\n\t\t\t\tDRAGONETTI\n\t\tWhat are you up to, Frost?\n\n\tFrost shuts the lid on his laptop, rising, drawing intimidatingly\n\tclose to Dragonetti.\n\n\t\t\t\tFROST'S VOICE\n\t\tWouldn't you like to know, Old Fang?\n\n\tA beat as the young turk stares his elder down. Dragonetti is the\n\tfirst to lose his nerve. Frost smiles and exits, leaving the old\n\tvampire to lick his wounds.\n\n\tCAMERA DRIFTS back to the hulking silhouette, which has been\n\teavesdropping on the conversation. It quivers in fear.\n\n\tINT. BLADE'S OLDS (ON KAREN'S STREET CORNER) - DAY\n\n\tBlade brings the car to a stop. Karen looks at him. His eyes are\n\thidden behind his glasses, his expression stone.\n\n\t\t\t\tBLADE\n\t\tRemember what we said. Keep your eyes \n\t\topen. They're everywhere.\n\n\tEXT. KAREN'S APARTMENT BUILDING - DAY\n\n\tAs Karen climbs out, Blade swings the door shut behind her. The Olds\n\tROARS off down the quiet residential street. \n\n\tINT. APARTMENT BUILDING, LOBBY - DAY\n\n\tKaren crosses the lobby, stepping into an elevator. Just as the doors\n\tare closing, a WOMAN and TWO MEN duck in alongside her. \n\n\tINT. ELEVATOR - DAY\n\n\tSilence, the uncomfortableness of an elevator ride magnified tenfold.\n\tKaren can FEEL the eyes of her fellow passengers upon her. Finally\n\tsuccumbing to paranoia, she hazards a glance -- would she be able to\n\ttell if these people weren't human? The woman turns to Karen,\n\tsmiles --\n\n\tKaren surreptitiously fishes the \"vampire mace\" from her pocket,\n\tclutching it -- and now one of the men turns to look at her,\n\tnodding --\n\n\tINT. KAREN'S APARTMENT BUILDING, HALLWAY - DAY\n\n\tThe elevator doors open. Karen hurries out, heads left, finds herself\n\tin a deserted hallway. She looks back --\n\n\t-- then skips a heartbeat as the trio also step out! As Karen raises\n\tthe canister of mace --\n\n\t-- the trio turn and head down to the right. Karen breathes a sigh of\n\trelief, shakes her head.\n\n\tINT. KAREN'S APARTMENT - DAY\n\n\tKaren enters quickly, bolting the door behind her. She picks up the\n\tphone, dials 911 --\n\n\t\t\t\tKAREN\n\t\tI need the police. This is an \n\t\temergency --\n\n\tAs Karen waits to be connected, she moves to the back entrance and\n\tchecks the locks -- then the windows, then the fire escape --\n\tfinally, a VOICE comes on the other end.\n\n\t\t\t\tKAREN\n\t\tHello? My name is Karen Jansen, I was \n\t\twith Curtis Webb at Mid-Town Hospital \n\t\tlast night -- that's right, I \n\t\twitnessed the attack --\n\t\t\t(listening)\n\t\t115 Aurora, apartment 3G. Yes, I'll \n\t\twait here. Please hurry.\n\n\tKaren hangs up the phone and turns -- \n\n\tA SHAFT OF BRIGHT SUNLIGHT\n\n\tstreams in through a window. Karen forces herself to look at it and\n\twinces, shielding her eyes. Again, she brings a hand to the bandaged\n\twound on her neck. She moves to the window, pulling the shade down,\n\tfrightened.\n\n\t\t\t\tKAREN\n\t\tGet a grip on yourself, girl.\n\n\tShe sinks down into a chair to wait, setting Whistler's vampire mace\n\taside. Then she shuts her eyes, massaging her temples. We SEE --\n\n\tA BRIEF FLASH OF\n\n\tQuinn, his mouth opening wide, saliva dripping from his fangs. His\n\tpupils pulsating hypnotically. We rush into his gaping maw and --\n\n\tWHAM! We're back to reality. Karen wakes with a start, looks to the\n\twindows -- time has passed, it's getting dark outside --\n\n\t-- and someone is KNOCKING at the front door. Karen reaches for the\n\tvampire mace, then moves to the door. She looks through the peephole,\n\tcautious --\n\n\t\t\t\tKAREN\n\t\tWho is it? \n\n\tKAREN'S POV (FISH-EYE)\n\n\tA POLICE OFFICER stands in the hallway -- 30s, handsome, a knight in\n\tshining armor as far as she's concerned. \n\n\t\t\t\tGIDEON\n\t\tSergeant Gideon. I'm responding to a \n\t\t911 call. \n\n\tKaren visibly relaxes. She opens the door and steps aside, allowing\n\tGideon to enter.\n\n\t\t\t\tKAREN\n\t\tYes, that was me, I'm Karen Jansen -- \n\n\tGideon smiles, takes a quick glance around the room, then studies\n\tKaren's face, the bandages on her neck.\n\n\t\t\t\tGIDEON\n\t\tAre you all right?\n\t\t\t(off Karen's nod)\n\t\tI'm glad you called, Ms. Jansen, we've \n\t\tbeen anxious to get a hold of you. You \n\t\tdisappeared on us for a while. \n\n\t\t\t\tKAREN\n\t\tI know. Listen -- do you have any idea \n\t\twhat happened to Curtis, the other \n\t\tdoctor?\n\n\t\t\t\tGIDEON\n\t\t\t(matter of fact)\n\t\tOh, he's dead. But I wouldn't worry \n\t\tabout that if I were you.\n\n\t\t\t\tKAREN\n\t\t\t(alarmed)\n\t\tWhy?\n\n\tGideon's smile vanishes as he unholsters his gun. \n\n\t\t\t\tGIDEON\n\t\tBecause you're dead too.\n\n\tKaren GASPS. She has a half-second to act -- in which she triggers a\n\tspray of vampire mace into Gideon's face. Gideon stumbles back,\n\tblinded, cursing, rubbing the heel of his palm against his eyes -- \n\n\tKaren expects pyrotechnics -- but the end result is little more than\n\tan annoyance. A second later, Gideon is simply blinking, sniffing his\n\tfingers, confused --\n\n\t\t\t\tGIDEON\n\t\tGarlic?\n\n\t\t\t\tKAREN\n\t\tHe said it would work against \n\t\tvampires --\n\n\tGideon bursts out laughing.\n\n\t\t\t\tGIDEON\n\t\tWho said I was a vampire? \n\n\tGideon shakes his head, still snickering. He forces Karen against the\n\twall, placing the gun against her head --\n\n\t\t\t\tGIDEON\n\t\tThanks for the laugh. You can shut \n\t\tyour eyes if you want to.\n\n\tCRASH!!! The front door explodes open as Blade comes flying through\n\tit! \n\n\tGideon tries to bring his pistol up -- but Blade grips the man's hand\n\tand squeezes. Gideon SCREAMS as his bones snap like kindling. The\n\tpistol falls from his grasp --\n\n\tBlade fires his fist into Gideon's gut again and again, then flings\n\tthe officer across the room, sending him SMASHING into a glass-cased\n\tcabinet. Bleeding, battered, Gideon struggles to stand --\n\n\tBlade is all over him, kicking the shit out of the rogue cop until he\n\tsinks to the floor in a half-conscious haze.\n\n\tBlade stands over Gideon's limp form, fists clenched, breathing\n\theavily, touching down after his adrenaline high. Finally, he looks\n\tto Karen --\n\n\t\t\t\tBLADE\n\t\tYou okay?\n\n\tKaren nods, glances at Gideon --\n\n\t\t\t\tKAREN\n\t\tHow did you know?\n\n\t\t\t\tBLADE\n\t\tFigured they'd send someone after you. \n\t\tThought I'd wait around and see who \n\t\tshowed up.\n\n\t\t\t\tKAREN\n\t\tYou used me as bait?!\n\n\t\t\t\tBLADE\n\t\tIt worked, didn't it?\n\n\t\t\t\tKAREN\n\t\tBut, he could've --\n\n\t\t\t\tBLADE\n\t\tHe didn't. Get over it.\n\n\tBlade kneels next to Gideon. He turns the man's head, inspects the\n\tneck, the skin behind the ear -- \n\n\t\t\t\tKAREN\n\t\tBut he's a policeman --\n\n\t\t\t\tBLADE\n\t\tHe's a familiar. A human who works for \n\t\tthe vampires. See this mark?\n\n\tBlade pushes aside Gideon's hair, revealing a tiny, cryptic symbol\n\ttattooed into the man's scalp.\n\n\t\t\t\tBLADE\n\t\tThat's a glyph, kind of like a vampire \n\t\tcattle brand. That means Officer \n\t\tFriendly here is someone's property. \n\t\tAny of the other vampire's try to \n\t\tbleed him, they'll have to answer to \n\t\tFriendly's owner --\n\t\t\t(studying the glyph)\n\t\tThis glyph belongs to Deacon Frost. \n\t\tWe've been tracking him for a while \n\t\tnow --\n\n\t\t\t\tKAREN\n\t\tWhy in God's name would anyone want to \n\t\twork for them?\n\n\t\t\t\tBLADE\n\t\tBecause they're vampire wanna-bes. If \n\t\tthey're loyal, if they prove \n\t\tthemselves, then their masters will \n\t\tturn them. \n\n\t\t\t\tKAREN\n\t\tAnd that's a good thing?\n\n\t\t\t\tBLADE\n\t\tFor some. Live forever, never get old. \n\t\tThe ultimate high. \n\n\tJust then, Gideon MOANS. Blade drags the man up so they're eye to\n\teye.\n\n\t\t\t\tBLADE\n\t\tHow 'bout you, Officer? You a good \n\t\tlittle bloodhound?\n\n\tCUT TO:\n\n\tEXT. KAREN'S APARTMENT BUILDING - DUSK\n\n\tBlade and Karen are now standing by Gideon's police cruiser which is\n\tparked outside Karen's apartment. Blade shoves Gideon against the\n\thood of the cruiser. He finds Gideon's keys, moves to the trunk,\n\topens it --\n\n\tIN THE TRUNK --\n\n\tA sophisticated medical cooling unit for transporting organs. Blade\n\topens the unit, coolant vapor hisses out. Inside are plastic bags\n\tcontaining blood. \n\n\t\t\t\tBLADE\n\t\tLooks like our friend was \n\t\tblood-running.\n\t\t\t(to Gideon)\n\t\tWhere were you headed?\n\n\tGideon mumbles through a split lip and chipped teeth --\n\n\t\t\t\tGIDEON\n\t\tMphuck you --\n\n\tWHAM! Blade plants Gideon's face into the hood of the car. Gideon\n\tGROANS, coughs --\n\n\t\t\t\tGIDEON\n\t\tJesus -- 1227 Brookner -- \n\t\tHolliston Clinic --\n\n\tBlade releases him, then reaches for his Casull.\n\n\t\t\t\tKAREN\n\t\tWhat are you doing?!\n\n\t\t\t\tBLADE\n\t\tPreventive medicine.\n\n\tKaren steps in front of Blade, shielding Gideon.\n\n\t\t\t\tKAREN\n\t\tYou can't do this, he's human, it's \n\t\tmurder.\n\n\t\t\t\tBLADE\n\t\tIt's war, now get the fuck out of the \n\t\tway!\n\n\tKaren grabs Blade's arm, wrestling with him, trying to push his hand\n\taway. As the two of them struggle, Gideon makes a break for it,\n\tstumbling across the lawn. Blade pushes Karen aside, takes aim,\n\tFIRES --\n\n\t-- but Gideon ducks into an alley, disappearing from sight. Blade\n\tspins on Karen, enraged --\n\n\t\t\t\tBLADE\n\t\tGod-damnit!!! Do you have any idea \n\t\twhat you just did?! He'll warn them. \n\t\tThey'll be waiting!\n\n\tBut Karen's defiant, she's not backing down.\n\n\t\t\t\tKAREN\n\t\tYou were going to kill him. What was I \n\t\tsupposed to do?! Shut my eyes and \n\t\tpretend I didn't see what I saw? \n\n\tBlade tears off his glasses. Karen gasps --\n\n\tBLADE'S EYES\n\n\taren't human, nor are they vampire. They're something else -- emerald\n\tgreen, laced with swirling flecks of red. \n\n\t\t\t\tBLADE\n\t\tLet me set you straight on something, \n\t\tDoctor. What you've \"seen\" so far is \n\t\tnothing. The world you live in's just \n\t\tthe sugar-coated topping. There's \n\t\tanother world beneath it, the real \n\t\tworld -- and it's a fucking bloodbath. \n\t\tIf you want to survive in it, you'd \n\t\tbetter pull your head out of your ass. \n\n\tBlade slips his glasses back on, leaving Karen shocked into silence.\n\tHe heads for his Olds without looking back, climbs in, guns the\n\tengine. In seconds, he's gone, tearing off down the street in a cloud\n\tof exhaust.\n\n\tEXT. EDGEWOOD TOWERS, PENTHOUSE - DUSK\n\n\tWe are soaring through the air above the gleaming city skyline,\n\tmoving towards the Edgewood Towers whose windows reflect the blood-\n\tred sinking sun.\n\n\tINT. FROST'S PENTHOUSE, POOL - NIGHT\n\n\tSuffused lighting, elegant tile-work featuring evocative mosaics, the\n\tquiet strains of CLASSICAL MUSIC -- \n\n\tMERCURY,\n\n\tthe lupine Gaultier girl from the club, glides beneath the water,\n\tsurfacing at the deep end. We SEE --\n\n\tFROST\n\n\tlounging in a chair, studying a laptop which rests beside him. On the\n\tscreen is a digitized image -- a page taken from an ancient\n\tmanuscript, written in a secret tongue.\n\n\tOfficer Gideon waits nearby, cradling his ruined hand, his battered\n\tface cast downward like a boy who's been called into the Principal's\n\toffice. \n\n\t\t\t\tGIDEON\n\t\tLook, I know you're disappointed --\n\n\t\t\t\tFROST\n\t\tCrestfallen.\n\n\t\t\t\tGIDEON\n\t\tBlade was waiting for me. There wasn't \n\t\tanything I could do.\n\n\tFrost nods, lapsing into brooding contemplation.\n\n\t\t\t\tFROST\n\t\tTell me something, Gideon, what blood \n\t\ttype are you?\n\n\tGideon hesitates. Is this a trick question?\n\n\t\t\t\tGIDEON\n\t\tI don't really know --\n\n\t\t\t\tFROST\n\t\tTake a wild stab. A? B? O, perhaps? \n\t\tI'm interested in the antigens here, \n\t\tthe agglutination reaction --\n\n\tGideon stammers as Frost rises. In the blink of an eye, Frost lifts\n\tGideon from the floor, dangling the Officer over the deep end of the\n\tpool by his throat --\n\n\t\t\t\tFROST\n\t\tI'm going to guess AB positive.\n\n\tGideon GURGLES as Frost's fingernails pierce his flesh, drawing\n\tblood. Then Frost releases him --\n\n\tGideon plunges into the pool. Mercury is on him in a heartbeat,\n\ttearing him apart like a Great White consuming a piece of chum. The\n\twater churns violently around them, clouding with red.\n\n\tWhen it's over, Mercury rises from the pool, dripping wet, covered\n\tfrom head to toe in a crimson sheen. \n\n\tShe kisses Frost hungrily, letting Gideon's blood flow from her mouth\n\tto his. Frost flicks a tongue over his lips.\n\n\t\t\t\tFROST\n\t\tAB positive. Give the man a prize.\n\n\tBelow them, Gideon's lifeless body sinks towards the pool bottom, his\n\tpolice badge twinkling like sunken treasure.\n\n\tCUT TO:\n\n\tEXT. CITY STREET - NIGHT\n\n\tBlade's Olds cruises to a stop. We're in a low-end commercial\n\tdistrict -- junky heaven. Blade climbs out, pulling an automatic\n\trifle from the back seat, then heading into an alleyway. \n\n\tEXT. BACK ALLEY - NIGHT\n\n\tBlade makes his way down the alley, cautious -- he SEES mountains of\n\ttrash, boarded-up windows, overlapping layers of gang graffiti -- a\n\tRAT crouching on a trash dumpster, gnawing on a dead pigeon --\n\n\t-- then a SOUND behind Blade, the scuffle of feet -- \n\n\tBlade whirls, drawing his sword, CHARGING at an approaching shadow,\n\tstopping mere millimeters from decapitating --\n\n\tKAREN,\n\n\twho's been backed up against the wall, her eyes wide with fright.\n\tBlade's sword vibrates from the tension in his forearm, having drawn\n\tjust the slightest taste of blood.\n\n\t\t\t\tBLADE\n\t\tWhat the hell are you doing?! I could \n\t\thave killed you!\n\n\tBlade lowers his sword. Karen remembers to breathe. She slumps,\n\ttracing her fingers over the line where her head almost parted with\n\ther body.\n\n\t\t\t\tKAREN\n\t\tI remembered the address. I followed \n\t\tyou --\n\n\tBlade shakes his head, amazed.\n\n\t\t\t\tBLADE\n\t\tDo you have a death wish or are you \n\t\tjust stupid?\n\n\tKaren pushes away from the wall, angry --\n\n\t\t\t\tKAREN\n\t\tLook, if what you say is true, if \n\t\tthere's a chance I could turn into one \n\t\tof them, then I've got no choice, do \n\t\tI? I have to work with you. I need to \n\t\tlearn everything I can about them. \n\t\tIt's the only way I'll be able to find \n\t\ta cure for myself.\n\n\t\t\t\tBLADE\n\t\tThere is no cure. \n\n\t\t\t\tKAREN\n\t\t\t(defiant)\n\t\tYou don't know that.\n\n\tBlade turns and moves to the end of the alley, studying the graffiti-\n\tcovered wall intently --\n\n\t\t\t\tKAREN\n\t\tWhat are you looking at?\n\n\t\t\t\tBLADE\n\t\t\t(gesturing)\n\t\tWhat do you see here?\n\n\t\t\t\tKAREN\n\t\tGraffiti --\n\n\t\t\t\tBLADE\n\t\tLook closer.\n\n\tBlade indicates a design amongst the various gang-banger tags that\n\tlooks something like a post-modern hieroglyphic.\n\n\t\t\t\tBLADE\n\t\tThis isn't a gang tag, it's a vampire \n\t\tmarking. It means there's a safe-house \n\t\tnearby. \n\t\tA place they can go if dawn is coming. \n\n\tBlade points to a building across the street --\n\n\tTHE HOLLISTON CLINIC,\n\n\tyour basic inner-city blood-barter establishment where desperate\n\ttransients parley their plasma into cash.\n\n\t\t\t\tKAREN\n\t\t\t(recognizing it)\n\t\tI know this place -- it's a blood \n\t\tbank. \n\n\t\t\t\tBLADE\n\t\tOwned by vampires. There's one of \n\t\tthese in every major city, and just \n\t\tlike Domino's, they always deliver.\n\t\t\t(looking to Karen)\n\t\tYou telling me you're ready to walk \n\t\tthrough that door?\n\n\tKaren nods. Blade continues to stare at her, taking her measure --\n\tthere's a strength in this woman's eyes, she has the soul of a\n\tfighter -- and Blade recognizes it. \n\n\t\t\t\tBLADE\n\t\tAll right, then, listen up, Vampire \n\t\tAnatomy 101. Crosses and running water \n\t\tdon't do dick, so forget what you've \n\t\tseen in the movies. \n\n\tBlade enumerates the following on his fingers:\n\n\t\t\t\tBLADE\n\t\tYou use the stake, silver, or \n\t\tsunlight, got it? \n\n\tBlade holds up one of his Casulls. \n\n\t\t\t\tBLADE\n\t\tKnow how to use one of these?\n\n\tKaren takes the weapon from him, eyes all over it.\n\n\t\t\t\tKAREN\n\t\tNo.\n\n\tBlade takes the gun back, snorting derisively.\n\n\t\t\t\tBLADE\n\t\tSafety's off, round's already \n\t\tchambered -- \n\t\t\t(cocking it)\n\t\tSilver hollow-points filled with \n\t\tgarlic. You aim for the heart or the \n\t\thead, anything else is a one-way \n\t\tticket to a pine box.\n\n\tBlade hand it to her again, then starts across the street towards the\n\tclinic. Karen follows --\n\n\tINT. HOLLISTON CLINIC, LOBBY - NIGHT\n\n\tBlade enters, swinging his rifle around for all to see.\n\n\t\t\t\tBLADE\n\t\tGet out. Now.\n\n\tThe POTENTIAL DONORS scramble for the exit. Behind the counter,\n\tTANAKA, a male nurse, reaches for an alarm button. Blade vaults over\n\tthe counter, aiming his rifle. \n\n\t\t\t\tBLADE\n\t\tI know you're blood-running. Who's \n\t\tyour sponsor? \n\n\t\t\t\tTANAKA\n\t\tI don't know what you're --\n\n\tPOW! Blade backhands him across the face hard enough to loosen his\n\tteeth. Karen flinches, stepping forward -- \n\n\t\t\t\tKAREN\n\t\tWhat if you've made a mistake?\n\n\tBlade pins Tanaka's head to the wall, turning it to the side --\n\trevealing the man's glyph. It's different than Gideon's, looking more\n\tlike a Japanese kanji character.\n\n\t\t\t\tBLADE\n\t\tWhat's this? A birthmark?\n\n\tBlade grips Tanaka by his collar, shoving him through a doorway --\n\n\tINT. HOLLISTON CLINIC, SUPPLY ROOM - NIGHT\n\n\tKaren and Blade SEE supply cabinets, cots, a number of locked\n\trefrigeration units. Blade FIRES into the door handle of one of the\n\tunits, tears it open -- the fridge is stacked floor to ceiling with\n\tplastic packets of blood.\n\n\t\t\t\tBLADE\n\t\t\t(to Karen)\n\t\tStill think we might be wrong?\n\t\t\t(to Tanaka)\n\t\tHow much are you shipping?\n\n\t\t\t\tTANAKA\n\t\tBite me!\n\n\tBlade opens FIRE, sweeping his rifle around the room, shooting\n\teverything in sight. Glass cabinetry shatters, ampoules and\n\tvacutainers go flying. Tanaka cowers, arms wrapped about his head.\n\n\tBlade stops shooting. He leans down towards Tanaka, placing the end\n\tof his rifle against the man's forehead. Tanaka looks like he's about\n\tto wet his pants.\n\n\t\t\t\tBLADE\n\t\tI've got a message for your masters -- \n\t\tthe night's no longer safe for their \n\t\tkind.\n\n\tBlade pulls back his rifle, leaving a red indentation mark where the\n\tend of the rifle barrel pressed into Tanaka's skin. He starts towards\n\tthe exit. Karen follows.\n\n\tCUT TO:\n\n\tINT. BLADE'S OLDS - NIGHT\n\n\tBlade and Karen return to the Olds. He keys the ignition, lets the\n\tengine idle. They're parked down the street from the blood clinic.\n\tKaren looks to Blade, confused --\n\n\t\t\t\tKAREN\n\t\tYou let him go -- \n\t\t\t(off Blade's nod)\n\t\tAn hour ago you were ready to kill a \n\t\tman for less, this one didn't even \n\t\ttalk.\n\n\t\t\t\tBLADE\n\t\tHe will.\n\n\tBlade points --\n\n\tTHROUGH THE WINDSHIELD --\n\n\tTanaka rushes from the clinic, climbing behind the wheel of a Mustang\n\tparked nearby. He takes off -- \n\n\tBlade follows the Mustang, CLICKING on a cell-phone scanner mounted\n\ton the dash. Numbers flash on the LCD screen as it searches for a\n\tsignal, then locks onto it. We hear a DIAL TONE, then a number being\n\tdialed --\n\n\t\t\t\tAUTOMATED VOICE\n\t\t\t(filtered, on scanner)\n\t\t\"You've reached a number that is no \n\t\tlonger in service. Please consult your \n\t\toperator and try again\".\n\n\t\t\t\tTANAKA'S VOICE\n\t\t\t(filtered, on scanner)\n\t\tIt's Tanaka, PIN number \n\t\tsixteen-zero-zero-nine --\n\n\tA \"real\" voice comes on the line:\n\n\t\t\t\tVOICE\n\t\t\t(filtered, on scanner)\n\t\tYes?\n\n\tKaren looks to Blade, impressed. \n\n\tINT. TANAKA'S MUSTANG - NIGHT\n\n\tTanaka speeds, shouting into the speaker phone -- \n\n\t\t\t\tTANAKA\n\t\tGet me Pearl! \n\n\t\t\t\tVOICE\n\t\t\t(filtered, on speaker)\n\t\tPearl is feeding --\n\n\t\t\t\tTANAKA\n\t\tLook, I'm not fucking around here! \n\t\tThat hunter Frost has been talking \n\t\tabout? He was just at the clinic. Tore \n\t\tthe goddamn place apart!\n\n\tEXT. THE BLACK PEARL - NIGHT\n\n\tTokyo town. A black edifice, no windows, secured parking, no signage\n\texcept for a purple neon scroll above the entrance -- a FLASHING\n\tKANJI, just like the glyph tattooed on Tanaka's neck.\n\n\tTanaka's Mustang pulls into the parking lot. He climbs out, flagging\n\taway the valets, heads inside --\n\n\tWHIP PAN TO\n\n\tBlade's Olds stopping a few blocks down the street.\n\n\tINT. BLADE'S OLDS - NIGHT\n\n\tBlade kills the engine, studying The Black Pearl.\n\n\t\t\t\tBLADE\n\t\tLooks like we hit pay-dirt. This place \n\t\tis crawling with them.\n\t\t\t(pointing)\n\t\tSee the valets over there? They're \n\t\tvampires. So is the doorman.\n\n\t\t\t\tKAREN\n\t\tHow can you tell?\n\n\t\t\t\tBLADE\n\t\tThe way they move, they way they \n\t\tsmell --\n\n\tBlade continues to scan the area, pointing out a few more likely\n\tcandidates --\n\n\t\t\t\tBLADE\n\t\tThe whore on the corner, she's one \n\t\ttoo. So are the two men standing under \n\t\tthe streetlight.\n\n\tBlade reaches into the back seat, retrieves his sword and a satchel.\n\tHe snaps open his shotgun, loads it. Karen continues to study the\n\tvampires Blade identified.\n\n\t\t\t\tKAREN\n\t\tSo many of them -- I still can't \n\t\tbelieve they're real.\n\n\t\t\t\tBLADE\n\t\tThere are worse things than vampires \n\t\tout there.\n\n\t\t\t\tKAREN\n\t\tLike what?\n\n\t\t\t\tBLADE\n\t\t\t(pumping his shotgun)\n\t\tLike me.\n\n\tBlade reaches for the door --\n\n\tEXT. THE BLACK PEARL - NIGHT\n\n\tBlade and Karen climb out. He lets his shotgun fall within the folds\n\tof his longcoat and starts across the street -- only to be challenged\n\tby a HULKING DOORMAN at the entrance.\n\n\t\t\t\tDOORMAN\n\t\tI'm sorry, sir -- do you have an \n\t\tinvitation?\n\n\tINT. BLACK PEARL - NIGHT\n\n\tCRASH! The front door flies open as the Doorman's body sails through.\n\tBlade enters, Karen at his heels -- \n\n\tThe 'Pearl' is an all-hours strip club cum casino catering\n\texclusively to Japanese zaibatsu clientele. Dimly lit, the air thick\n\twith cigarette smoke, deafening MUSIC. Go boards, pachinko machines,\n\tsexy little MANGA WAIFS in schoolgirl outfits doling out drinks --\n\n\tSTRIPPERS writhe in the circular \"pit\" tables surrounded by HOWLING\n\tgrab-ass men. But that's nothing compared to --\n\n\tThe MAIN ATTRACTION,\n\n\twho's doing a bump and grind down the runway, shaking a body worthy\n\tof a schoolboy's wet dream. Her attire? A leather S&M face mask,\n\tnipple rings, 6-inch spikes, and a pair of panties to hide her\n\tmodesty.\n\n\tBlade scans the room -- just in time to see Tanaka ducking into a\n\tback hallway. Blade pushes towards the rear of the club. Karen\n\tfollows. \n\n\tON THE STRIPPER\n\n\tas she catches sight of Blade and freezes in mid-routine. The\n\tstripper pulls off her hood. Long black hair with a streak of white\n\ttumbles down her back -- it's Mercury. \n\n\tINT. BLACK PEARL, HALLWAY - NIGHT\n\n\tBlade and Karen head past the bathrooms. At the end of the hall is a\n\tdoor marked \"OFFICE\". Just then, the Men's door opens, a DRUNK\n\tCOLLEGE KID steps out, SEES Blade --\n\n\t\t\t\tKID\n\t\tHey --\n\n\tBlade plants a hand over the kid's face, shoving him back into the\n\tbathroom as he kicks open the office door --\n\n\tINT. THE BLACK PEARL, BACK OFFICE - NIGHT\n\n\tTanaka spins around, startled, tries to throw a punch -- \n\n\tBlade traps Tanaka's arm, levering the man up and over. He CRASHES\n\tinto a shelving unit, taking the whole thing down with him. Karen\n\twinces. Blade grabs a handful of Tanaka's hair, yanks his head up --\n\n\t\t\t\tBLADE\n\t\tWhere's the entrance?!\n\n\t\t\t\tTANAKA\n\t\tI can't -- they'll kill me!\n\n\tBlade rips off his glasses and gives Tanaka an eyeful -- his irises\n\tpulse and glow. \n\n\t\t\t\tBLADE\n\t\tI got news for you, butt-boy. You're \n\t\talready dead. \n\n\t\t\t\tTANAKA\n\t\t\t(terrified)\n\t\tOh God, shit -- behind the bookcase --\n\n\tBlade drops Tanaka, moves to the bookcase. He searches the wall a\n\tmoment, then finds a trigger. Hits it -- the bookcase slides aside,\n\trevealing a hidden elevator. As Blade moves to put his sunglasses\n\tback on --\n\n\tBLADE'S POV (IN THE REFLECTION OF HIS SUNGLASSES)\n\n\tWe see Tanaka behind him, pulling a handgun out of a desk drawer,\n\tswinging it up --\n\n\tBlade unholsters one of his Casulls faster than any gunslinger in\n\thistory. He FIRES over his own shoulder, BLOWING Tanaka back against\n\tthe wall. \n\n\tBlade puts his sunglasses back on, motions to the elevator, then nods\n\tto Karen --\n\n\t\t\t\tBLADE\n\t\tAfter you. \n\n\tINT. THE BLACK PEARL, ELEVATOR - NIGHT\n\n\tThe elevator descends. Then a tone CHIMES, signaling the end of the\n\tride. The doors hiss open -- \n\n\tINT. THE VAMPIRE ARCHIVES, HALLWAY - NIGHT\n\n\tBlade and Karen enter the narrow, maze-like \"stacks\" of the vampire\n\tarchives, weaving their way through shelves of climate-controlled,\n\tdigitized records. \n\n\t\t\t\tKAREN\n\t\tWhat is this place?\n\n\t\t\t\tBLADE\n\t\tSome kind of archive --\n\n\t\t\t\tKAREN\n\t\tIsn't this all a little high-tech? I \n\t\tthought vampires were more into \n\t\tcobwebs and coffins.\n\n\t\t\t\tBLADE\n\t\tYou've been watching too much TV. \n\t\tThey've got their claws sunk into \n\t\teverything -- finance, real estate, \n\t\tpolitics. Probably own half of \n\t\tDowntown. \n\n\tBlade pulls a CD-ROM from the shelves, its spine labeled in\n\tindecipherable vampire glyphs.\n\n\t\t\t\tBLADE\n\t\tThis must be where they keep their \n\t\trecords --\n\n\tHe pauses, hearing a DISTANT WHISPER. Blade signals quiet, silently\n\tleading Karen through the stacks towards -- \n\n\tPEARL'S LAIR\n\n\tA vestibule of sorts, leading to a larger bed chamber constructed of\n\trice paper shoji screens and tatami mats. Candles glow within,\n\tilluminating a MONSTROUSLY OBESE SHADOW beyond the translucent rice\n\tpaper walls.\n\n\tThe shadow speaks in a tremulous, bird-like voice -- the secret\n\ttongue. As Blade draws his sword, the massive shadow freezes --\n\n\t\t\t\tPEARL'S VOICE\n\t\t\t(frightened)\n\t\tLorca, is that you?\n\n\tBlade slides open the nearest shoji screen --\n\n\tINT. PEARL'S BED CHAMBER - NIGHT\n\n\tNothing Karen's seen up until this point could prepare her for the\n\tarchive's curator --\n\n\tPEARL,\n\n\ta nine-hundred-pound androgynous vampire of Asian origin, lounging\n\tamidst pillowed rice mats, wearing a communications headset. Think of\n\ta cross between Divine and Jabba The Hutt. Skin the complexion of\n\tbuttermilk, so corpulent he can barely move, so engorged with blood\n\tthat he's actually sweating it from the pores of his skin. \n\n\tPearl is surrounded by a nest of monitors and keyboards which have\n\tbeen affixed to counter-balanced arms -- this way, Pearl can access\n\tinformation without leaving bed.\n\n\tLying next to Pearl, dwarfed by the vampire's massive size, is the\n\tchalk-white body of a recently-drained NAKED BOY. \n\n\tAt the sight of Blade, Pearl's eyes widen in fear --\n\n\t\t\t\tPEARL\n\t\t\t(into a speakerphone)\n\t\tHe's here!\n\n\t\t\t\tFROST'S VOICE\n\t\t\t(over speakerphone)\n\t\tCongratulations, Day-Walker.\n\n\t\t\t\tBLADE\n\t\tFrost?\n\n\tINT. FROST'S PENTHOUSE, POOL - NIGHT\n\n\tFrost paces the length of his pool, wearing a hands-free\n\tcommunications headset, grinning.\n\n\t\t\t\tFROST\n\t\tIn the flesh, Blade. I understand \n\t\tyou've been looking for me. I'm \n\t\tflattered.\n\n\tINT. PEARL'S BEDCHAMBER - NIGHT\n\n\tAs Blade listens, Pearl reaches for his trackball, attempting to\n\tdelete the document currently on his monitors -- but Blade lunges\n\tforward, sinking the tip of his sword into Pearl's fleshy throat.\n\tPearl freezes. \n\n\t\t\t\tBLADE\n\t\t\t(eyeballing Pearl)\n\t\tDon't be. You're another notch on my \n\t\tsword hilt, nothing else.\n\n\tFrost's DEEP LAUGHTER drifts from the speakerphone.\n\n\tINT. FROST'S PENTHOUSE, POOL - NIGHT\n\n\tFrost settles into his chair, enjoying the cat and mouse.\n\n\t\t\t\tFROST\n\t\tYou're quick, Blade, I'll give you \n\t\tthat. In the space of an hour you've \n\t\tcrossed my familiar, destroyed a blood \n\t\tbank --\n\t\t\t(beat)\n\t\tNow here you are in the heart of our \n\t\tarchives, terrorizing our curator.\n\n\t\t\t\tPEARL'S VOICE\n\t\tHe has a knife to my throat, Frost! \n\t\tHe --\n\n\t\t\t\tFROST\n\t\t\t(cutting him off)\n\t\tYou're history, Pearl. Have the good \n\t\tgrace to die with some dignity.\n\t\t\t(beat)\n\t\tRound one to you, Blade.\n\n\tINT. PEARL'S BEDCHAMBER - NIGHT\n\n\tCLICK, the line goes dead. Blade tosses his satchel on the bed, opens\n\tit. Inside is a hand-held UV lamp hooked up to a nine-volt battery.\n\tPearl eyes the device, fearful -- \n\n\t\t\t\tPEARL\n\t\tWhat is that?\n\n\t\t\t\tBLADE\n\t\tA sun lamp. We're gonna play twenty \n\t\tquestions. Depending on your answers, \n\t\tyou might get to have yourself a \n\t\ttanning session. \n\n\tBlade looks to Pearl's monitor and SEES a digitized image, the SAME\n\tMANUSCRIPT Deacon had been studying earlier. \n\n\t\t\t\tBLADE\n\t\tWhat were you in such a big hurry to \n\t\tdelete just now?\n\n\tPearl hesitates. Blade turns on the lamp. Pearl HOWLS as the harsh\n\tlight falls upon him. Blade flicks the light off.\n\n\tPearl cringes, GROWLING, his face smoking profusely. Exposure to the\n\tUV rays, even for one short second, has made his face blister like a\n\tplague victim's.\n\n\t\t\t\tPEARL\n\t\t\t(relenting)\n\t\tIt's an epistle, a letter Frost has \n\t\tbeen translating -- it prophesizes \n\t\tLaMagra's return.\n\n\t\t\t\tBLADE\n\t\tAnd who is LaMagra?\n\n\tPearl hesitates again -- Blade turns on the lamp for a longer time.\n\tPearl thrashes, covering his face. His hands blacken, the skin\n\tsizzling away to expose the finger bones beneath. Karen has to avert\n\ther gaze --\n\n\tBlade turns off the lamp. Pearl SNARLS, his body quivering with\n\tpoisonous rage.\n\n\t\t\t\tPEARL\n\t\tLaMagra is The Sleeper!!! \n\n\tBlade leans in close so he's eye to eye with Pearl.\n\n\t\t\t\tBLADE\n\t\tWhere's the original, Pearl? You must \n\t\thave it around here somewhere.\n\n\tPearl sweats blood, his flaking, slug-like lips quivering. \n\n\t\t\t\tPEARL\n\t\tThe vault --\n\n\tBlade follows Pearl's eyes to an armored door, then he stands back,\n\thanding the UV rig to Karen.\n\n\t\t\t\tBLADE\n\t\tIf he moves, cook him.\n\n\tBlade approaches the vault door, sizing up its locking mechanism. He\n\tpulls an explosive charge from his combat belt and secures it to the\n\tdoor, arming it with a BEEP!\n\n\t\t\t\tPEARL\n\t\tPlease, I'll give you the combination \n\t\t-- you'll damage the documents --\n\n\t\t\t\tBLADE\n\t\tThat's the point.\n\n\tEnraged, Pearl LUNGES from his bed. Karen triggers the UV rig, flash-\n\tfrying him to a blackened crisp. Pearl quivers, his enormous body\n\tsmoking like a piece of charred meat. \n\n\tBlade looks back at Karen with newfound respect. She shrugs.\n\n\t\t\t\tKAREN\n\t\tHe moved.\n\n\tBlade turns back to the vault, setting off the charge. BOOM! Blade\n\tkicks the damaged door in, knocking it clear off its hinges --\n\n\tINSIDE THE VAULT,\n\n\tancient papers flutter through the smoky air like wind-borne leaves.\n\tBlade and Karen SEE a lucite-encased document -- fragments of an\n\tancient, calligraphied papyrus. \n\n\t\t\t\tKAREN\n\t\tWhat are these?\n\n\t\t\t\tQUINN (o.s.)\n\t\tCuriosity killed the cat.\n\n\tBlade and Karen spin --\n\n\t-- QUINN,\n\n\tMercury, and a number of other vampires stand at the entrance to the\n\tvault.\n\n\t\t\t\tQUINN\n\t\t\t(grins)\n\t\tHola, amigo. Remember me?\n\n\tKaren triggers the UV light, but Mercury ducks under it, ripping it\n\tfrom her hands, crushing it. In a split-second, the she-demon has her\n\tclaws around Karen's throat.\n\n\tAs Blade reaches for his rifle, the vampires converge on him like\n\tquicksilver. They drag Karen and Blade out --\n\n\tPEARL'S BEDCHAMBER\n\n\tThe vampires fling Blade against the wall, pinning him. \n\n\t\t\t\tQUINN\n\t\tYou took my arm, Blade. But that's \n\t\tokay, I'm growing a new one --\n\n\tQuinn lifts up his \"arm\". A skeletal forearm has grown from the\n\tstump. It's got cartilage, sinew, and muscle, but no flesh yet. \n\n\t\t\t\tQUINN\n\t\tNice, huh? Think I'll ever play the \n\t\tpiano again?\n\t\t\t(shrugging)\n\t\tYou can slice him, you can dice him, \n\t\tand the man just keeps on coming. \n\n\tBlade struggles violently, but Quinn is upon him, pounding his fist\n\tinto Blade again and again and again -- giving him payback with\n\tcompounded interest. When it's over, Quinn steps back, winded -- \n\n\tBlade's head hangs down. He gasps, wincing, every breath sending a\n\tred hot poker to his gut. Quinn grabs a hold of Blade's jaw, forcing\n\this head up. \n\n\t\t\t\tQUINN\n\t\tStay with me, sweetness, I'm not \n\t\tthrough with you yet.\n\n\tQuinn pulls Blade's jacket open, sees the bandoleer of mahogany\n\tstakes. He tugs one out, admiring it.\n\n\t\t\t\tQUINN\n\t\tTeak. Nice craftsmanship. \n\t\t\t(to the others)\n\t\tNow here's a man who takes his job \n\t\tjust a little too seriously, don't you \n\t\tthink?\n\t\t\t(back to Blade)\n\t\tWhich reminds me, Blade, think I owe \n\t\tyou one --\n\n\tQuinn stabs the stake into Blade's shoulder. Blade CRIES OUT, tries\n\tto pull free. Karen, who's being held by Mercury, averts her gaze.\n\n\t\t\t\tQUINN\n\t\tActually, if you want to get \n\t\ttechnical, I owe you two.\n\n\tAs Quinn reaches for another stake, Blade starts to laugh.\n\n\t\t\t\tQUINN\n\t\tWhat's so funny, bright eyes?\n\n\t\t\t\tBLADE\n\t\tI'm expecting some company.\n\n\tIt's then that Quinn notices the micro ear-coil radio receiver in\n\tBlade's ear. As we MOVE IN on it, we hear a tiny VOICE squawking from\n\tit:\n\n\t\t\t\tVOICE\n\t\t\t(filtered)\n\t\tGet down!\n\n\tBlade kicks his feet out, sending Quinn flying backwards. He tears\n\tfree of the vamps holding him and DIVES forward, knocking Karen to\n\tthe ground just as --\n\n\tBOOM!!! The wall of Pearl's bedchamber EXPLODES INWARD, knocking\n\tQuinn and the rest of his cronies to their feet. \n\n\tWHISTLER\n\n\tstands in the smoking hole where the wall used to be, brandishing his\n\tcane in one hand and an automatic rifle in the other. He balances the\n\trifle against his hip like an over-the-hill gunslinger and OPENS FIRE\n\ton the vampires.\n\n\tBlade rolls, snatching up a fragment of the parchment which has blown\n\tfree from the vault. Seconds later, he and Karen are fleeing after\n\tWhistler, retreating back through his newly created exit.\n\n\tINT. TUNNEL - NIGHT\n\n\tThe three of them find themselves ankle-deep in a flooded sewer\n\ttunnel running parallel to the archives. Whistler pauses, wheezing\n\tfrom overexertion. \n\n\t\t\t\tWHISTLER\n\t\tChrist, I'm too old for this. Somebody \n\t\tget me a goddamn wheelchair.\n\n\tBlade leans against the tunnel wall, GRUNTING as he yanks the stake\n\tfrom his shoulder. He then pulls out a light-stick, snapping it,\n\tilluminating the area in a GREEN GLOW -- disturbing waves of\n\tGLITTERING COCKROACHES. \n\n\tMeanwhile, Whistler pulls another explosive device from his backpack\n\tand sets it against the tunnel wall, arming it.\n\n\t\t\t\tKAREN\n\t\tHow did you find us?!\n\n\tWhistler taps a tiny radio headset curled around his ear.\n\n\t\t\t\tWHISTLER\n\t\tWe keep in radio contact. \n\n\t\t\t\tKAREN\n\t\t\t(incredulous)\n\t\tYou've been listening in the whole \n\t\ttime?\n\n\t\t\t\tWHISTLER\n\t\tYou think I'd let him run loose \n\t\twithout a chaperone? Blade ferrets \n\t\ttheir rat-holes out, I map them. Then \n\t\twe blow them all to kingdom come.\n\n\tWhistler finishes arming the explosive device. It BEEPS. He turns\n\tback to Blade and Karen, referring to a handheld navigation device.\n\n\t\t\t\tWHISTLER\n\t\tThere's a subway line due East of \n\t\there. We'd best make tracks. \n\n\tINT. PEARL'S BEDCHAMBER, ARCHIVES - NIGHT\n\n\tAn EXPLOSION rips through the bedchamber, mushrooming outward --\n\n\tINT. BLACK PEARL - NIGHT\n\n\tThe EXPLOSION continues expanding, sending tables, drinks, and\n\tzaibatsu clientele flying.\n\n\tINT. TUNNEL - NIGHT\n\n\tAs the group splashes through the water, a FIREBALL chases them down\n\tthe tunnel. They duck into an alcove, narrowly avoiding the flames.\n\tWhistler WHOOPS with excitement, loving every minute of it. But his\n\ttriumph is short-lived, for now we hear --\n\n\t-- a deafening chorus of HIGH-PITCHED VAMPIRE WAR CRIES coming from\n\tbehind. Karen hazards a look back --\n\n\tTHE VAMPIRES\n\n\tsurge down the tunnel like a pack of hungry wolves on high-octane.\n\tThere must be a dozen of them now and Quinn is right in the lead.\n\n\tOur trio hustles along, but Whistler stumbles, tumbling and sliding\n\tdown a washout. The steep incline of the washout makes it virtually\n\timpossible for Whistler to climb back up to the main tunnel.\n\n\t\t\t\tKAREN\n\t\tWhistler!\n\n\t\t\t\tWHISTLER\n\t\tGo on, I'll be fine!\n\n\tKaren hesitates, but Blade yanks her down the tunnel --\n\n\t\t\t\tBLADE\n\t\tHe can take care of himself! GO!!!\n\n\tThey race through the twisting warren of tunnels, taking one turn\n\tafter another, the vampires hot on their heels --\n\n\tINT. SUBWAY TUNNEL - NIGHT\n\n\tBlade and Karen stumble out into a larger subway tunnel, which widens\n\tinto a station stop up ahead. We can see the RED TAIL-LIGHTS of a\n\ttrain just pulling away from the platform -- Blade and Karen re-\n\tdouble their efforts, lungs burning, legs pumping like mad. Just as\n\tthe train enters the next tunnel --\n\n\t-- they leap, dragging themselves up onto the back of the rear-\n\tpassenger car. Blade SMASHES his fist through the emergency exit\n\twindow, then lifts Karen up, helping her climb through into the\n\tcar -- \n\n\t-- but the vampires are still coming! Crawling along the tunnel walls\n\ton all fours, limbs a blur, claws striking the concrete and spewing\n\tout sparks. Closing fast. Too fast. \n\n\tQUINN\n\n\tsprings forward, snagging Blade's ankle with his \"good\" hand. The\n\tvampire's weight threatens to haul Blade down. Blade reaches to his\n\tback-scabbard, unsheathes his sword --\n\n\tTHUNK! Blade brings the sword down on Quinn's good arm, cutting it\n\toff at the wrist! Quinn falls to the tracks, tumbling head over heels\n\tback into the darkness --\n\n\tTHE AMPUTATED HAND,\n\n\twhich continues to clutch at Blade's ankle, starts to melt. With a\n\tcry of disgust, Blade kicks the thing away. He turns and climbs\n\tthrough the window --\n\n\tINT. SUBWAY CAR - NIGHT \n\n\tKaren helps Blade inside. He sinks to the floor of the otherwise\n\tdeserted car, exhausted. He's looking ashen now. The whites of his\n\teyes are shot through with red.\n\n\tKaren gets a good look at Blade's wounds -- the front of his jacket\n\tis soaked in blood. She reaches for him --\n\n\t\t\t\tKAREN\n\t\tYou're hurt --\n\n\t\t\t\tBLADE\n\t\tNothing that won't heal by dawn.\n\n\tBlade reaches into his jacket and pulls out the small, gas-powered\n\tpistol-injector we saw Whistler inject him with earlier. He tries to\n\tload one of the ampoules into it, but because of his wounds, he's not\n\thaving much luck -- \n\n\t\t\t\tBLADE\n\t\t\t(frustrated)\n\t\tI need help with this --\n\n\tKaren nods, inserting the ampoule into the gun. Blade shrugs off his\n\tjacket, holds out his arm. Karen pauses --\n\n\t\t\t\tKAREN\n\t\tWhat am I injecting you with?\n\n\t\t\t\tBLADE\n\t\t\t(weakly)\n\t\tSerum -- it's a human hemoglobin \n\t\tsubstitute.\n\n\tKaren locates a vein, presses the injector against it -- Blade\n\ttenses, grits his teeth, fights to keep his body thrashing as the\n\tserum enters his bloodstream. He grips the wall behind him --\n\tactually digs his nails into the metal surface -- the agony he's\n\tgoing through is excruciating, like nothing we could imagine. \n\n\tWhen it's over, he slumps forward, spent, vulnerable, flushed with\n\tsweat. Karen stares at him --\n\n\t\t\t\tKAREN\n\t\tYou're one of them, aren't you?\n\n\tBlade turns away from Karen, filled with self-loathing. \n\n\t\t\t\tBLADE\n\t\tNot quite. I'm a hybrid. Half-human, \n\t\thalf-vampire.\n\n\tOff Karen's surprised reaction, we --\n\n\tCUT TO:\n\n\tINT. WHISTLER'S WORKSHOP - NIGHT\n\n\tThe loading elevator CLANGS to a stop. Blade throws the gate open.\n\tKaren helps him out. Now that they're safely back, the last of\n\tBlade's strength seems to dissipate. \n\n\tWHISTLER\n\n\tis waiting for them, sitting at a workbench. \n\n\t\t\t\tWHISTLER\n\t\tWhat took you so long?\n\n\t\t\t\tBLADE\n\t\tDon't even start, old man.\n\n\tBlade throws his sword aside, then moves off into the shadows,\n\tdisappearing beyond the curtains. Karen looks to Whistler --\n\n\t\t\t\tKAREN\n\t\tWhy didn't you tell me the truth \n\t\tabout him?\n\n\t\t\t\tWHISTLER\n\t\tWe weren't sure we could trust you.\n\n\tWhistler sighs, removing his glasses.\n\n\t\t\t\tWHISTLER\n\t\tBlade's mother was attacked by a \n\t\tvampire while she was pregnant. \n\t\tUltimately, she died, but her unborn \n\t\tchild lived. Unfortunately, he'd \n\t\tundergone certain genetic changes \n\t\twhile in the womb --\n\n\tWhistler reaches for a pack of cigarettes, pulls one out. He thumbs a\n\tmatch, fires up. Takes a long drag --\n\n\t\t\t\tWHISTLER\n\t\tI found Blade when he was thirteen. \n\t\tHe'd been living on the streets, \n\t\tfeeding off the homeless. Apparently \n\t\tthe Thirst manifested itself at \n\t\tpuberty -- \n\t\t\t(beat)\n\t\tI took him for one of them at first, \n\t\talmost killed him, too. But then I \n\t\trealized what he was. \n\n\tCUT TO:\n\n\tEXT. EDGEWOOD TOWERS, PENTHOUSE - NIGHT\n\n\tFrost stands at the window, looking out at the glimmering cityscape\n\tbefore him.\n\n\tINT. FROST'S PENTHOUSE - NIGHT\n\n\tFrost turns away from window. Quinn, Mercury, and the other vampires\n\tfrom the Black Pearl stand before him. Quinn cradles his amputated\n\tstump with his newly grown arm. \n\n\t\t\t\tQUINN\n\t\tHe took my fucking hand! Again!\n\n\t\t\t\tFROST\n\t\tYou seem to be in the habit of losing \n\t\tthem fairly often, Quinn. Maybe the \n\t\tamputee lifestyle just suits you.\n\n\tThe other vampires laugh. Quinn stares them into silence. \n\n\t\t\t\tQUINN\n\t\tWe need to find him, tonight.\n\n\tFrost claps a hand on Quinn's shoulder.\n\n\t\t\t\tFROST\n\t\tDown, boy. Blade's not going anywhere. \n\t\tI promise. Right now, though, we've \n\t\tmore pressing business --\n\t\t\t(off Mercury's look)\n\t\tIt's time Dragonetti paid the piper. \n\n\tCUT TO:\n\n\tINT. WHISTLER'S WORKSHOP - NIGHT\n\n\tWhistler studies Karen, exhaling another lungful of smoke.\n\n\t\t\t\tWHISTLER\n\t\tBlade's unique, you know. A one in a \n\t\tbillion anomaly. He can withstand \n\t\tsunlight, garlic, even silver. But he \n\t\tstill has the Thirst. \n\n\t\t\t\tKAREN\n\t\tWhat happens if he doesn't take the \n\t\tserum?\n\n\t\t\t\tWHISTLER\n\t\tThe Thirst overcomes him, just like \n\t\tthe others. It's not something he can \n\t\tcontrol. \n\t\t\t(sighs)\n\t\tThe problem is, time's running out. \n\t\tHis body's starting to reject the \n\t\tserum. And so far, all my efforts to \n\t\tfind a cure have ended in failure --\n\n\t\t\t\tKAREN\n\t\tNo offense, Whistler, but you're not \n\t\texactly working with state of the art \n\t\tequipment here. You might have missed \n\t\tsomething.\n\n\t\t\t\tWHISTLER\n\t\t\t(pointedly)\n\t\tWhich is why you're here. We could use \n\t\tsomeone with your experience.\n\n\tA beat passes between them and Karen knows where she stands now. In\n\tfor a penny, in for a pound. Whistler reaches for Blade's sword.\n\n\t\t\t\tWHISTLER\n\t\tThis used to be mine, you know. It's \n\t\tbeen passed down through the \n\t\tcenturies, from one hunter to the \n\t\tnext --\n\n\tWhistler extends the sword, sighting down the length of it. He takes\n\ta few practice parries -- it's obvious he used to be quite skilled in\n\tthe art of swordsmanship.\n\n\t\t\t\tKAREN\n\t\tWhy do you hunt them?\n\n\t\t\t\tWHISTLER\n\t\tHabit, mostly, just like this. \n\n\tWhistler gestures with his cigarette. He finally stubs it out, his\n\twistful reverie vanishing like so much smoke.\n\n\t\t\t\tWHISTLER\n\t\tI had a family once -- a wife, three \n\t\tdaughters. Then a drifter named Deacon \n\t\tFrost came calling one evening --\n\n\t\t\t\tKAREN\n\t\tHe killed them?\n\n\t\t\t\tWHISTLER\n\t\tEventually. He toyed with them first. \n\t\tHe made me choose, do you understand? \n\t\tWhich order they would die in --\n\n\tKaren stares at Whistler, horrified.\n\n\t\t\t\tKAREN\n\t\tHow did you escape?\n\n\t\t\t\tWHISTLER\n\t\tI didn't. He was cruel enough to let \n\t\tme live.\n\t\t\t(slapping his brace)\n\t\tEven gave me a souvenir to remember \n\t\thim by.\n\n\tKaren nods -- it's all falling into place for her now.\n\n\t\t\t\tKAREN\n\t\tAnd now you're using Blade to exact \n\t\tyour revenge?\n\n\t\t\t\tWHISTLER\n\t\t\t(pointedly)\n\t\tFrost's bodycount keeps rising, and \n\t\tI'm not getting any younger, am I?\n\n\tJust then, we hear a SCREAM come from Blade's room, sounding more\n\tlike the cry of a beast than a man. Karen takes a step towards\n\tBlade's room --\n\n\t\t\t\tWHISTLER\n\t\tI wouldn't go in there if I were you. \n\t\tIt's best to leave him alone when he's \n\t\tlike this.\n\n\t\t\t\tKAREN\n\t\tI'll take my chances.\n\n\tINT. BLADE'S ROOM - NIGHT\n\n\tKaren enters. It's dark, just a trace of moonlight.\n\n\t\t\t\tKAREN\n\t\tBlade?\n\n\tNo answer. Then Karen SEES him -- crouched in the corner of the room\n\tlike some kind of nocturnal animal.\n\n\t\t\t\tKAREN\n\t\tIt's dark in here.\n\n\t\t\t\tBLADE\n\t\tYou get used to the darkness.\n\n\tKaren takes a step towards him.\n\n\t\t\t\tKAREN\n\t\tWhistler told me about your mother. \n\n\tBlade clutches the silver locket in his hand. It swings back and\n\tforth, like a pendulum.\n\n\t\t\t\tBLADE\n\t\tI can't close my eyes without hearing \n\t\ther scream.\n\n\t\t\t\tKAREN\n\t\tThose aren't real memories. No one has \n\t\tthat kind of recall.\n\n\t\t\t\tBLADE\n\t\tI do. I remember from day one. People \n\t\tstaring at me, sensing I was \n\t\tdifferent. Watching the fear grow in \n\t\ttheir eyes, knowing in their hearts I \n\t\twasn't human.\n\n\t\t\t\tKAREN\n\t\tIf you're not human, then why do you \n\t\tbleed like us? \n\t\tI've seen vampire blood, you don't \n\t\thave it running through your veins.\n\n\tBlade looks at Karen, his lambent eyes glowing in the moonlight.\n\n\t\t\t\tBLADE\n\t\tJust get out of here.\n\n\t\t\t\tKAREN\n\t\tBlade --\n\n\tBlade turns, his eyes glowing with preternatural fury. \n\n\t\t\t\tBLADE\n\t\tI said, GET OUT!!!\n\n\tKaren backs away, startled by Blade's vehemence. She exits, leaving\n\thim alone with his demons. He holds up one of his empty serum\n\tampoules, crushing it in his fist.\n\n\t\t\t\tFROST'S VOICE\n\t\tRise and shine, little wing.\n\n\tEXT. THE BURNING GROUNDS - JUST BEFORE DAWN\n\n\tFADE IN on Dragonetti, his face covered with a black condemned man's\n\thood --\n\n\tFrost stands before him, grinning like the Cheshire Cat. He's dressed\n\tfrom head to toe in a black motorcycle suit -- boots, gloves, a\n\tvisored helmet tucked under one arm. Mercury and Quinn are standing\n\tnearby, similarly attired. \n\n\tWe're on a stretch of rocky coastline, tucked away in a secluded\n\tcove. Dragonetti has been stripped bare, chained like Prometheus to\n\tan ancient standing stone. \n\n\t\t\t\tDRAGONETTI\n\t\t\t(straining)\n\t\tWhat is this? Where am I?!\n\n\tFrost steps forward, pulling Dragonetti's hood off. Dragonetti stares\n\tat his surroundings, horrified.\n\n\t\t\t\tFROST\n\t\tWhen was the last time you stopped to \n\t\tappreciate a sunrise, Dragonetti? \n\t\tThree, four hundred years? \n\n\tFrost checks his watch, then looks to the ocean. On the horizon, a\n\tsliver of gold appears. \n\n\t\t\t\tFROST\n\t\tHow do you like that? Right on time.\n\n\t\t\t\tDRAGONETTI\n\t\t\t(snarling)\n\t\tThe other elders will never let you \n\t\tget away with this!\n\n\tJust then, the TWELVE VAMPIRE ELDERS emerge behind Frost, forming a\n\tcircle around Dragonetti. All wear business suits, gloves, along with\n\thigh-tech \"sun masks\" to protect their faces from the light's lethal\n\trays. \n\n\tThey stare at Dragonetti like a silent jury. His face darkens, anger\n\trising -- but there's a desperation in his eyes now too. He speaks in\n\tthe secret tongue:\n\n\t\t\t\tDRAGONETTI\n\t\t\t(subtitled)\n\t\tDon't you see, you fools?! He'll \n\t\tbetray you too! He's planning on \n\t\tinvoking LaMagra himself!\n\n\tThe vampires just smile and shake their heads.\n\n\t\t\t\tFROST\n\t\tThe wheel turns, old fang. Guess you \n\t\tjust got a little too long in the \n\t\ttooth.\n\n\tDragonetti's cries are cut short as Frost forces the aging vampire's\n\tmouth open, ripping out his fangs with his bare hands. Dragonetti\n\tGURGLES and SHRIEKS, sounding like a dying animal.\n\n\tFrost turns to face the Twelve now, his eyes bright with victory. He\n\tpulls on his motorcycle helmet, as do Mercury and Quinn. \n\n\tBehind them, Dragonetti struggles furiously against his chains to no\n\tavail as the first faint rays of daylight fall upon him, channeled\n\tinward by the natural formation of the cove -- \n\n\tDragonetti HOWLS, his skin beginning sizzle and smoke. Then he\n\tcatches fire like paper beneath a magnifying glass. He thrashes about\n\tas his flesh starts to run from his body.\n\n\tTHE VAMPIRE ELDERS\n\n\twatch, impassive, protected by their masks --\n\n\t-- when suddenly, TWELVE FIGURES rise up behind them, clad in bike\n\thelmets and black leather, just like Frost. The intruders grip each\n\tof the Elders in a strangle hold, ripping their masks off. \n\n\t\t\t\tFROST\n\t\tDragonetti was right. You were fools \n\t\tto trust me.\n\n\tFrost flips down the visor of his helmet even as --\n\n\tTHE RED SUN\n\n\trises in all its fiery glory.\n\n\tOne by one, the vampire Elder's heads catch fire, skullflesh sizzling\n\taway -- burning down the line of them in successively building\n\tintensity until all twelve EXPLODE in a conflagration of BLINDING\n\tWHITE LIGHT.\n\n\tFrost and his compatriots are blown off their feet by the sheer\n\tintensity of the occult blast -- a blast which sends the skeletal\n\tbodies of the Elders SLAMMING into the rock wall.\n\n\tWhen it's over, Frost picks himself back up. We SEE that the only\n\tthing left of Dragonetti and the others are --\n\n\tTHIRTEEN SHADOW SILHOUETTES\n\n\tpermanently etched onto the rock's surface, just like the bombing\n\tvictims of Hiroshima. \n\n\tINT. WHISTLER'S WORKSHOP - DAY\n\n\tKaren stands at a lab table with Whistler, preparing a number of\n\tblood sample vials. They are surrounded by host of new medical\n\tequipment -- from centrifuges to genetic sequencers and beyond.\n\n\tBlade emerges from his room, looks to Karen. As if by silent\n\tagreement, last night's words go unacknowledged. He straps on his\n\tbandoleer of stakes, secures his scabbard.\n\n\t\t\t\tWHISTLER\n\t\tGoing somewhere?\n\n\t\t\t\tBLADE\n\t\tChina Town. I need more serum.\n\t\t\t(re: new equipment)\n\t\tWhat's all this?\n\n\t\t\t\tKAREN\n\t\tI made a trip to the hospital last \n\t\tnight, borrowed some equipment.\n\n\t\t\t\tBLADE\n\t\t\t(sarcastic)\n\t\tFor your miracle cure? \n\n\t\t\t\tWHISTLER\n\t\tShe's been making real progress, \n\t\tBlade.\n\t\t\t(to Karen)\n\t\tShow him --\n\n\tKaren looks to Blade, who shrugs. She opens a refrigerator, removing\n\ta syringe filled with blue fluid.\n\n\t\t\t\tKAREN\n\t\tThis is sodium citrate. It's an \n\t\tanti-coagulant. We use it to treat \n\t\tblood-clots sometimes. Vampire blood \n\t\tis thinner than humans, though. Watch \n\t\twhat happens when I introduce some \n\t\tinto a sample --\n\n\tKaren gestures to the microscope. Blade takes a look --\n\n\tBLADE'S POV\n\n\tVampire blood cells swirling about.\n\n\tKaren injects the contents of the syringe onto the slide of cells --\n\tthe reaction is immediate. The vampire blood turns black, then begins\n\tviolently bubbling.\n\n\tBlade lifts his head away from the microscope just in time -- the\n\tblood on the slide atomizes, exploding outward in a fine mist which\n\tbursts apart the glass lens of the scope. \n\n\tWhistler laughs, thrilled with the results.\n\n\t\t\t\tWHISTLER\n\t\tCan you imagine what a dash of that \n\t\twould do on your sword? \n\n\tWhistler claps his hand on Karen's shoulder in approval, then limps\n\taway, quickly busying himself with another project. Blade moves to\n\tfollow, but Karen stops him --\n\n\t\t\t\tKAREN\n\t\tBefore you go, I'd like to take a \n\t\tsample of your blood.\n\n\tBlade grudgingly rolls up his sleeve. As Karen takes her sample,\n\tBlade looks to Whistler. The older man brings a handkerchief to his\n\tlips, coughing into it. \n\n\t\t\t\tKAREN\n\t\tIs he sick?\n\n\t\t\t\tBLADE\n\t\tCancer.\n\n\tKaren watches as Blade's blood flows into the vacutainer. She fills\n\tthe first, then inserts another. \n\n\t\t\t\tKAREN\n\t\tYou care about him, don't you? \n\n\t\t\t\tBLADE\n\t\tWe've got a good arrangement, that's \n\t\tall. Whistler makes the weapons, I use \n\t\tthem, the vampires die -- end of \n\t\tstory.\n\n\tKaren finishes. Blade rolls up his sleeve.\n\n\t\t\t\tKAREN\n\t\t\t(pointedly)\n\t\tMy mother used to say that a cold \n\t\theart is a dead heart.\n\n\t\t\t\tBLADE\n\t\tYour mother sounds like a Hallmark \n\t\tgreeting card. \n\n\tBlade slips his Casulls into a shoulder holster, then shrugs into his\n\tleather jacket, donning his sunglasses.\n\n\t\t\t\tBLADE\n\t\tI'd wish you luck, Doc, but I never \n\t\tput much stock in optimism.\n\n\tHe heads towards the elevator.\n\n\tEXT. CHINATOWN, STREETS - DAY\n\n\tBlade makes his way down a street lined with vending stalls --\n\tpassing MERCHANTS peddling exotic vegetables and cheap curios,\n\tbutcher shops with rows of roast ducks in the window, tyro GANG-\n\tBANGERS lounging at the entrance to a video arcade.\n\n\tBLADE'S POV\n\n\tEven though the streets are crowded, the people seem to make way for\n\thim, avoiding eye-contact. \n\n\tBlade turns into a dark alley, ducking into the doorway of a hole-in-\n\tthe-wall herbalist shop.\n\n\tINT. HERBALIST SHOP - DAY \n\n\tA bell atop the door JINGLES, announcing Blade's arrival. We're in a\n\tdusty, cave-like room filled with baskets and bottle-lined shelves\n\tfeaturing things like \"Toad Spleen Extract\" and \"Barking Deer Wine\".\n\tJoss sticks burn, sending wispy tendrils of incense into the air. \n\n\tAt the back of the shop, an elderly CHINESE MAN in a cardigan sits in\n\tfront of a battered television, watching a boxing match. He's eating\n\ta bowl of litchi fruit. On the counter nearby, a SPIDER MONKEY\n\twatches attentively. \n\n\t\t\t\tBLADE\n\t\tHow's it going, Kam?\n\n\t\t\t\tKAM\n\t\t\t(re: calendar)\n\t\tYou're a week early.\n\n\t\t\t\tBLADE\n\t\tI was in the neighborhood.\n\n\tKam sets his fruit bowl aside, leads Blade through a curtain into a\n\tback room.\n\n\tINT. HERBALIST SHOP, BACK ROOM - DAY\n\n\tKam hands Blade a leather valise. He opens it -- its lined with tiny\n\tampoules of scarlet-colored serum. Blade pulls one out, holds it up\n\tto the light.\n\n\t\t\t\tBLADE\n\t\tWhistler says I'm building up a \n\t\tresistance to it.\n\n\t\t\t\tKAM\n\t\tI was afraid that might happen.\n\n\t\t\t\tBLADE\n\t\tMaybe it's time to start exploring \n\t\tother alternatives.\n\n\t\t\t\tKAM\n\t\tThere's only one alternative to the \n\t\tserum.\n\n\tBlade nods. They both know what that \"alternative\" is. \n\n\t\t\t\tBLADE\n\t\tYeah. I know.\n\n\tBlade closes the valise and tucks it inside his jacket. \n\n\t\t\t\tBLADE\n\t\tThanks, Kam.\n\t\t\t(thinking)\n\t\tOne other thing. Have you ever heard \n\t\tof a vampire called the Sleeper?\n\n\tKam shakes his head. Blade pulls out the parchment he took from\n\tPearl.\n\n\t\t\t\tBLADE\n\t\tI found this in there archives. I need \n\t\tto find someone who can read their \n\t\tlanguage. \n\n\tKam studies the parchment.\n\n\t\t\t\tKAM\n\t\tI've heard about a woman named \n\t\tMiracia. Some say she's a mayombero, a \n\t\tSanteria witch. Supposedly she lives \n\t\tin that tent community down by the \n\t\tcity dump. I'm told she only sees \n\t\tpeople at night. \n\n\tBlade nods his thanks and heads back through the curtains.\n\n\tEXT. CHINATOWN, STREET - DAY\n\n\tBlade emerges from the alley into the sunlight, then hears his name\n\tWHISPERED on the wind.\n\n\t\t\t\tVOICE (o.s.)\n\t\tBlade.\n\n\tBlade spins, scanning his surroundings -- did he really hear his\n\tname, or was it just the wind?\n\n\t\t\t\tVOICE (o.s.)\n\t\tBlade.\n\n\tAgain, the taunting voice calls him. Blade's gaze finally settles\n\ton --\n\n\tA MAN\n\n\tsitting on a bench in the deep shade, his face obscured by the\n\tChinese newspaper he's reading. There's a LITTLE GIRL sitting stiffly\n\tbeside the man -- a look of pure terror written on her face. \n\n\t\t\t\tMAN\n\t\tAfternoon, Blade.\n\n\tThe man lowers his newspaper. It's Deacon Frost. He's wearing\n\tsunglasses, but otherwise, he's seemingly unprotected by the sun. \n\n\tBlade reaches for his .454 -- \n\n\t\t\t\tFROST\n\t\tEasy.\n\n\tFrost's hand rests on the back of the girl's neck. We see his claws\n\textend, caressing the flesh beneath her chin.\n\n\t\t\t\tFROST\n\t\tWouldn't want our little friend here \n\t\tto wind up on the back of a milk \n\t\tcarton, would we? \n\n\tBlade reluctantly lowers his hand. Frost smiles. He takes in a deep\n\tbreath of air, savoring it. \n\n\t\t\t\tFROST\n\t\tBeautiful day, isn't it? \n\n\t\t\t\tBLADE\n\t\t\t(confused)\n\t\tHow can you be out here?\n\n\t\t\t\tFROST\n\t\tI dabble in pharmaceuticals, medical \n\t\tresearch. We've developed a type of \n\t\tsun-blocker using octyl salicylate, a \n\t\tfew others things. \n\n\tOn closer examination we see that Frost is wearing a translucent\n\tlotion on his face. He touches a finger to his cheek, rubs some of\n\tthe lotion between his fingers.\n\n\t\t\t\tFROST\n\t\tIt's not very effective in direct \n\t\tsunlight, but it's a start. The goal, \n\t\tof course, is to be like you, \"the \n\t\tDay-walker\". \n\n\t\t\t\tBLADE\n\t\tI don't buy it.\n\n\t\t\t\tFROST\n\t\tWhy not? The future of our race runs \n\t\tthrough your bloodstream. You've got \n\t\tthe best of both worlds, Blade. All of \n\t\tour strengths and none of our \n\t\tweaknesses.\n\n\t\t\t\tBLADE\n\t\tMaybe I don't see it that way.\n\n\t\t\t\tFROST\n\t\tOh, so it's back to pretending we're \n\t\thuman again, is it? Spare me the Uncle \n\t\tTom routine. You can't keep denying \n\t\twhat you are. You're one of us, Blade. \n\t\tYou always have been.\n\n\t\t\t\tBLADE\n\t\tYou're wrong.\n\n\t\t\t\tFROST\n\t\tAm I? You think the humans will ever \n\t\taccept a half-breed like you? They \n\t\tcan't. They're afraid of you. \n\t\t\t(pointedly)\n\t\tThe humans fear us because we're \n\t\tsuperior. They fear us because in \n\t\ttheir hearts they know their race has \n\t\tbecome obsolete.\n\n\tFrost watches the marketers stream past, sneering in contempt. \n\n\t\t\t\tFROST\n\t\tLook at them, just an endless stream \n\t\tof cattle in a mad race to the \n\t\tslaughterhouse. \n\n\tFrost lifts a silver flask to his mouth, taking a swig of blood. He\n\tsmacks his lips, sighs contentedly --\n\n\t\t\t\tFROST\n\t\tThe pause that refreshes --\n\t\t\t(offering it to Blade)\n\t\tCare for some? Smells good, doesn't \n\t\tit? Pungent, with just an \n\t\tirrepressible hint of iron. \n\n\t\t\t\tBLADE\n\t\tPass.\n\n\t\t\t\tFROST\n\t\tYou sure now? I bled a newborn for \n\t\tthis. You won't find a drink that's \n\t\tsweeter. \n\n\tIt takes every ounce of Blade's self-control to keep from attacking\n\tFrost -- and Frost senses this, pressing his sharp thumbnail against\n\tthe child's jugular.\n\n\t\t\t\tFROST\n\t\tTell me honestly, do you really get \n\t\tthe same rush from that pasteurized \n\t\tpiss-serum of yours?\n\t\t\t(off Blade's look)\n\t\tYou're surprised I know about your \n\t\tserum? You shouldn't be. I know \n\t\teverything about you. \n\n\tFrost leans forward, grinning.\n\n\t\t\t\tFROST\n\t\tYou can't keep walking the razor's \n\t\tedge, Blade. The day will come -- and \n\t\tsoon, when you'll have to choose \n\t\tbetween our kind and their's. If I \n\t\twere you, I'd take care not to wind up \n\t\ton the wrong end of the fang.\n\n\tA bead of sweat runs down Frost's neck, washing away a minute amount\n\tof the sun-blocking cream. The patch of exposed skin instantly\n\tblackens. Frost gazes upwards at the sun.\n\n\t\t\t\tFROST\n\t\tLove to continue this chat, but it \n\t\tappears I'm melting.\n\n\tFrost rises, taking the little girl by the hand. Blade follows, his\n\thand resting on the butt of his Casull.\n\n\t\t\t\tBLADE\n\t\tYou're not going anywhere.\n\n\t\t\t\tFROST\n\t\t\t(growling)\n\t\tWatch me.\n\n\tFrost's eyes flicker towards the street -- a CITY BUS is rumbling by.\n\tIn a heartbeat, Frost hurls the little girl forward --\n\n\t-- out into the path of the oncoming bus! \n\n\tBlade has a split-second to act. It's Frost or the girl -- and for a\n\tmoment we actually think he's going to go for Frost --\n\n\t-- but then he DIVES forward, scooping the girl into his arms,\n\tthrowing themselves out of the bus' path. The bus misses them by a\n\thair. By the time Blade looks up again --\n\n\t-- Frost is gone. Blade rises, cursing, scanning the street as\n\tmarket-goers gather around him.\n\n\tWHIP PAN TO --\n\n\tSOMEONE sitting astride a motorcycle, watching Blade from the roof of\n\tan elevated parking garage. The rider is clad from head to toe in a\n\thelmet and black leather -- Mercury. \n\n\tEXT. ABANDONED FACTORY - DAY\n\n\tBlade's Olds cruises into the gated grounds. It zips down the ramp\n\tway into the loading elevator.\n\n\tBACK BY THE TRAIN TRACKS --\n\n\tMercury's cycle rolls into frame. She picks up a radio handset and\n\tkeys it.\n\n\t\t\t\tMERCURY\n\t\t\t(into radio)\n\t\tThis is Mercury. Tell Deacon I've \n\t\tfound their hiding place.\n\n\tCUT TO:\n\n\tINT. WHISTLER'S WORKSHOP - DAY\n\n\tBlade enters through the loading elevator, finding Karen and Whistler\n\thard at work. She turns as he approaches -- SEES him back-lit by the\n\tsun. She looks pale, the whites of her eyes are streaked with red.\n\n\t\t\t\tBLADE\n\t\tAny progress?\n\n\t\t\t\tKAREN\n\t\tSome. It's been slow --\n\n\t\t\t\tBLADE\n\t\tYou don't look so good. \n\n\t\t\t\tKAREN\n\t\tI'm just tired, that's all. We've been \n\t\tup all night.\n\n\tBlade nods, not buying her explanation. He shoots a glance to\n\tWhistler, which doesn't go unnoticed by Karen.\n\n\t\t\t\tKAREN\n\t\tExcuse me.\n\n\tKaren turns, heading for the back of the workshop.\n\n\tINT. WORKSHOP - BATHROOM - NIGHT\n\n\tKaren enters a dingy bathroom, turning on the overhead bulb. She\n\tstudies her reflection in the mirror above the sink, then grimaces as\n\tshe peels the dressing from her wound -- the wound is clearly\n\tinfected, gangrenous. \n\n\t\t\t\tBLADE (O.S.)\n\t\tIt's started.\n\n\tKaren spins, startled. Blade stands behind her. He grips her jaw,\n\tturning her head so he can better view the wound.\n\n\t\t\t\tBLADE\n\t\tYou've got another day or two at most.\n\n\tKaren nods, shaken. As she moves to leave, Blade reaches for her arm,\n\tstopping her.\n\n\t\t\t\tBLADE\n\t\tFor what it's worth, I'm sorry.\n\n\t\t\t\tKAREN\n\t\tYou make it sound like I'm already \n\t\tdead.\n\n\tBlade just stares at her. Finally, she pulls away.\n\n\tEXT. WHISTLER'S WORKSHOP - DUSK\n\n\tCLOSE ON Karen as she moves to the grimy outer windows, watching the\n\tsun go down, an unmistakable look of dread creeping over her.\n\n\tCUT TO:\n\n\tEXT. LANDFILL GHETTO - DUSK\n\n\tWindy. Urban desolation. Blade stands on the perimeter of a sprawling\n\tcardboard and plywood squatter's ghetto which has sprung up around\n\tthe city dump. CHILDREN and DOGS forage for salvageable items, while\n\tin the distance, dumptrucks grind over the dunes of refuse.\n\n\tMOMENTS LATER,\n\n\tBlade is winding his way through the maze of makeshift homes and\n\tashcan fires. A CROWD quickly closes in around him, suspicious. A\n\tBRUTISH MAN steps forward, challenging him --\n\n\t\t\t\tMAN\n\t\tExtranjero. ¿Quien es?\n\n\t\t\t\tBLADE\n\t\tI'm here to see Miracia. Kam sent me.\n\n\tThe man turns to his fellow squatters, WHISPERING. After a heated\n\tdebate, a GAUNT WOMAN steps forward, motioning --\n\n\t\t\t\tWOMAN\n\t\tThis way.\n\n\tCUT TO:\n\n\tINT. WHISTLER'S WORKSHOP - NIGHT\n\n\tWhistler and Karen sit at a work table. Karen is looking at a blood\n\tsmear slide through a microscope. \n\n\t\t\t\tKAREN\n\t\tAll right, let's start with the basics \n\t\t-- why do vampires need to drink \n\t\tblood?\n\n\t\t\t\tWHISTLER\n\t\tTheir own blood can't sustain \n\t\themoglobin. \n\n\t\t\t\tKAREN\n\t\tThen vampirism is a genetic defect, \n\t\tjust like Hemolytic anemia?\n\n\tWhistler nods.\n\n\t\t\t\tKAREN\n\t\tSo what about gene therapy?\n\n\tWhistler looks intrigued. Karen continues.\n\n\t\t\t\tKAREN\n\t\tBasically you'd have to re-write the \n\t\tvictim's DNA, alter it so that the DNA \n\t\twill produce proteins capable of \n\t\tgenerating hemoglobin. \n\n\t\t\t\tWHISTLER\n\t\tHow?\n\n\t\t\t\tKAREN\n\t\tWith a retrovirus. It's injected into \n\t\tthe bone marrow cells, it causes the \n\t\thost's DNA to mutate. They've been \n\t\tusing them to treat Sickle-cell \n\t\tanemia. \n\n\tWhistler can hardly believe what he's hearing.\n\n\t\t\t\tWHISTLER\n\t\tYou're serious? You actually think \n\t\tthis could work?\n\n\tKaren pauses -- we can see in her expression that there's something\n\tshe's been holding back.\n\n\t\t\t\tKAREN\n\t\tOn me, yes. On Blade, I'm not so \n\t\tsure -- \n\t\t\t(gravely)\n\t\tThe problem is, Blade didn't contract \n\t\tthe vampire virus from a bite like I \n\t\tdid. He was born with it. The irony \n\t\tis, I could probably cure every \n\t\tvampire but him.\n\n\t\t\t\tWHISTLER\n\t\tThen we're back to square one, aren't \n\t\twe? Sooner or later, the Thirst always \n\t\twins.\n\n\tAt that moment, the lights in the workshop flicker, then go out.\n\tKaren looks around the room, alarmed. \n\n\t\t\t\tKAREN\n\t\tWhat happened to the power?\n\n\t\t\t\tWHISTLER\n\t\t\t(concerned)\n\t\tI don't know, but the back-up \n\t\tgenerator should've kicked in.\n\n\tA few seconds pass. The back-up generator still hasn't activated.\n\tWhistler moves to the window --\n\n\t\t\t\tWHISTLER\n\t\tUV floodlights are down too.\n\n\tAs Whistler reaches for a flashlight we hear the sound of GLASS\n\tSHATTERING coming from the other end of the workshop. Whistler shines\n\tthe flashlight in that direction. We hear more sounds now -- water\n\tdraining, glass tinkling.\n\n\tWhistler raises a finger to his lips, signaling silence. He edges\n\ttowards the black-out curtains, Karen falling in behind him.\n\n\tINT. WHISTLER'S WORKSHOP - TANK ROOM - NIGHT\n\n\tWhistler and Karen enter, cautious --\n\n\tTHE TANK\n\n\tcontaining the vampire child has been smashed open. It's empty now,\n\twith just the steadily draining blood seeping across the floor in a\n\twidening pool -- and a trail of tiny BLOODY FOOTPRINTS leading back\n\tout into the main workshop.\n\n\tINT. WHISTLER'S WORKSHOP - NIGHT\n\n\tKaren scans the shadows, eyes alert. We hear a WHISPER, then a\n\tteasing, childish, GIGGLE.\n\n\tWhistler moves the flashlight in a slow circle, shining the beam over\n\tevery inch of the room. And just as he's about to complete his\n\tcircuit --\n\n\tTHE CHILD\n\n\tleaps from where it had been hiding overhead! Karen SCREAMS.\n\tWhistler is knocked to the floor, the flashlight spinning from his\n\thand --\n\n\tThe feral child lands atop Whistler, HISSING like a cobra. Its\n\tmacrocephalic head seems to morph, twisting into grotesque\n\tproportions. And just as it's about to strike --\n\n\tZZZZING! Whistler withdraws a silver rapier which had been hidden\n\tinside his cane. He lunges forward --\n\n\tWHOOSH! The child takes off like a blue streak, sending test tubes\n\tand medical equipment CRASHING to the floor. It zips past Karen --\n\n\t\t\t\tWHISTLER\n\t\tGet it!!!\n\n\tKaren snatches up the flashlight, chasing after it as Whistler\n\tstruggles to his feet --\n\n\tKaren sweeps the flashlight around, catching only fleeting glimpses\n\tof the child as it darts through the workshop. She reaches a shelving\n\tunit where Whistler's weapons are stored, grabs one of the modified\n\tpistols --\n\n\tKaren tries to draw a bead on the creature. She FIRES, misses, FIRES\n\tagain -- she's getting more unnerved as the seconds tick by and the\n\tcreature is moving closer and --\n\n\t-- suddenly it's right in front of her, flying through the air, fangs\n\tbared! \n\n\tThe child knocks Karen back against the wall. It's at her throat,\n\tsinking its claws into her neck. Karen chokes, forcing Whistler's\n\tpistol under the monstrosity's chin --\n\n\t-- but then the creature morphs again, transforming into a beatific\n\tlittle cherubim of a child -- and Karen hesitates, because the child\n\tseems so goddamned human now and its eyes are luminous, pulsing and\n\thypnotic and --\n\n\t-- suddenly Whistler reaches in from behind, YANKING the vampire\n\tchild's head back, FIRING a pistol into its skull. The creature\n\tslumps --\n\n\tKaren cries out, disgusted, flinging the corpse away from her. As it\n\tcontinues to writhe --\n\n\tTHUNK! Whistler swings his cane-rapier down on the creature, brutally\n\tdecapitating it. Finishing the job. Then he looks to Karen, winded.\n\n\t\t\t\tWHISTLER\n\t\tUnderstand this -- they are monsters. \n\t\tHesitate for even a moment, and you've \n\t\tlost.\n\n\t\t\t\tFROST (O.S.)\n\t\tWords to live by, Whistler.\n\n\tWhistler spins, eyes wide. He knows that voice.\n\n\tDEACON FROST\n\n\tsteps into the pool of illumination thrown off by the flashlight,\n\tfollowed by Mercury and Quinn. \n\n\t\t\t\tFROST\n\t\tIt's been a long time, hasn't it, \"old \n\t\tfriend\"? \n\n\tEXT. LANDFILL GHETTO - MIRACIA'S CABIN - NIGHT\n\n\tBlade is led to a plywood cabin crowded with candle-lit altars --\n\tgarish pictures of Saints and demons abound, alongside bottles of\n\troots and herbs steeped in alcohol, human bones, voodoo dolls. \n\n\tMIRACIA \n\n\tsits on a sagging couch outside, clutching a deck of well-thumbed\n\tBicycle playing cards. She's ancient, with a mouthful of gold-capped\n\tteeth and cataract-clouded eyes. Blind.\n\n\t\t\t\tMIRACIA\n\t\tIs something wrong, my friend?\n\n\t\t\t\tBLADE\n\t\tYou're blind --\n\n\t\t\t\tMIRACIA\n\t\tThere are other ways to see. Sit.\n\n\tBlade approaches, uneasy. Miracia deals out the playing cards on a\n\trickety table, setting them in nine piles which take on a cross\n\tformation. \n\n\t\t\t\tMIRACIA\n\t\tPerhaps you have brought me something \n\t\t-- an offering for the orishas?\n\n\tBlade tosses a handful of bills on the table. Miracia nods, then\n\tflips over the first card in the center pile -- a one-eyed Jack. She\n\tsighs, grave --\n\n\t\t\t\tMIRACIA\n\t\tHold out your hands.\n\n\t\t\t\tBLADE\n\t\tI didn't come here to get my palms \n\t\tread. I need something translated.\n\n\t\t\t\tMIRACIA\n\t\tShow me.\n\n\tBlade removes parchment fragment from his jacket and sets it on the\n\ttable. Miracia traces her fingers over the ancient paper, touching\n\ther fingertips to her lips.\n\n\t\t\t\tMIRACIA\n\t\tSangre. Written in blood. \n\n\tShe runs her hands over each line as if it were written in Braille.\n\tSome of the candles gutter, then extinguish themselves as the wind\n\taround them rises.\n\n\t\t\t\tMIRACIA\n\t\tThis is an old tongue, from an old \n\t\tworld. It concerns LaMagra.\n\n\t\t\t\tBLADE\n\t\tWho is LaMagra?\n\n\t\t\t\tMIRACIA\n\t\tThe vampire God. This speaks of His \n\t\treturn.\n\n\tMiracia's fingers search the parchment again.\n\n\t\t\t\tMIRACIA\n\t\t\"-- there will come a Day Walker.\"\n\t\t\t(reading)\n\t\t\"His blood will call the Sleeper from \n\t\tbeyond the Veil of Tears.\"\n\n\tBlade stares at Miracia, shaken.\n\n\t\t\t\tBLADE\n\t\tHis blood -- ?\n\n\tThe old woman nods, reaching for a smoldering cigarette.\n\n\t\t\t\tMIRACIA\n\t\tThe Day Walker's blood is a disparador \n\t\t-- a trigger, you see? For LaMagra's \n\t\treturn. One need only consume it and \n\t\tthe spirit of his ancestors will \n\t\tsettle upon him.\n\t\t\t(reading)\n\t\t\"And the Sleeper will rise from the \n\t\tshadows anew, cleansing the world in a \n\t\tTide of Blood.\"\n\n\t\t\t\tBLADE\n\t\t\t(recalling the phrase)\n\t\t\"The Blood Tide\".\n\n\t\t\t\tMIRACIA\n\t\t\t(nodding)\n\t\tYes. The vampire apocalypse. It is \n\t\tsaid that all who feel its taint will \n\t\tsuccumb to the Thirst. \n\n\t\t\t\tBLADE\n\t\tHow do I stop it?\n\n\tMiracia shrugs, spreading her hands.\n\n\t\t\t\tMIRACIA\n\t\tThe Great Wheel turns, my friend. The \n\t\tDark is rising. How would you fight a \n\t\tshadow? \n\n\tMiracia sits back, slumping into her chair. The candles have burnt\n\tthemselves down to nothing. \n\n\t\t\t\tMIRACIA\n\t\tI am tired. Dawn is coming. \n\n\t\t\t\tBLADE\n\t\tBut I just got here --\n\n\t\t\t\tMIRACIA\n\t\tYou've been here longer than you \n\t\tthink. \n\n\tBlade rises, looking to the horizon. Incredibly, dawn is coming. As\n\the stands there, mystified, the wind picks up, sweeping the parchment\n\tfragment out of his hand. He tries to snatch it back, but the\n\tfragment is quickly borne away. He watches it disappear into the sky,\n\tthen turns back --\n\n\tMiracia is gone. Blade glances around him, but she's nowhere to be\n\tfound. \n\n\tCAMERA PULLS BACK,\n\n\tisolating Blade amidst the ghostly squalor. From our vantage point,\n\the looks like any other homeless phantom.\n\n\tINT. WHISTLER'S WORKSHOP - DAWN\n\n\tBlade steps out from the elevator into the workshop --\n\n\tThe place has been trashed. It looks like a tornado touched down in\n\this absence. Blade pulls out one of his .454s, cautious --\n\n\t\t\t\tBLADE\n\t\tWHISTLER?!\n\n\t-- and then he stops dead in his tracks.\n\n\tWHISTLER\n\n\thas been strung up by his arms against the far wall, tortured and\n\tleft for dead. In response to Blade's voice, a MOAN escapes the dying\n\tman's lips.\n\n\tBlade rushes to the wall, cutting Whistler down with his sword,\n\tgently lowering him to the floor. As he cradles the old man in his\n\tarms, Blade sees the primary wound -- two ragged puncture marks along\n\tWhistler's throat.\n\n\t\t\t\tBLADE\n\t\tJesus, Whistler, what did they do to \n\t\tyou?\n\n\tWhistler opens his eyes, struggling to speak --\n\n\t\t\t\tWHISTLER\n\t\tFrost took her --\n\n\tWhistler spasms and coughs, wincing from the pain.\n\n\t\t\t\tBLADE\n\t\tDon't try to talk --\n\n\t\t\t\tWHISTLER\n\t\tListen. You have to -- finish me off. \n\t\tYou don't want me coming back.\n\n\t\t\t\tBLADE\n\t\tNo, we can treat the wounds --\n\n\tBut Whistler is shaking his hand.\n\n\t\t\t\tWHISTLER\n\t\tToo far gone, you know that.\n\n\tBlade's at a complete loss.\n\n\t\t\t\tBLADE\n\t\tWhistler, I can't.\n\n\tWhistler clutches at Blade's arm, his eyes burning with conviction.\n\n\t\t\t\tWHISTLER\n\t\tYes you can. Now get on with it. \n\n\tAs much as he'd like to deny it, Blade knows that Whistler is right.\n\tHe pulls a stake from his bandoleer, hesitates.\n\n\t\t\t\tBLADE\n\t\tWhistler, I --\n\n\t\t\t\tWHISTLER\n\t\t\t(cutting him off, more gentle now)\n\t\tI know. \n\t\t\t(forcing a smile)\n\t\tJust be quick about it, will you? Do \n\t\tit right.\n\n\tBlade fights back tears. With a wretched moan, he turns his head and\n\tdrives the stake into Whistler's chest. Whistler GASPS. Blade wraps\n\this arms around the older man, holding him tight as the life runs out\n\tof him, rocking back and forth --\n\n\tAfter a while, the rocking stops and Blade lays Whistler on the\n\tfloor. Then something catches his eye --\n\n\tA SHARP VIEW-CAMCORDER\n\n\tresting nearby, labeled, \"PLAY ME\". Blade reaches for the camcorder,\n\tcues the tape -- Frost's face appears on the tiny built-in screen.\n\n\t\t\t\tFROST\n\t\tHello, Blade. By the time you watch \n\t\tthis, Whistler will no doubt be \n\t\twinging his way to Heaven, thanks to \n\t\tyour capable hands. If it makes any \n\t\tdifference to you, he put up quite a \n\t\tfight.\n\n\tFrost touches a deep gash which runs across his cheek.\n\n\t\t\t\tFROST\n\t\tNow, I'm sure you're wondering about \n\t\tMs. Jansen's well-being. She's alive \n\t\tand kicking -- \"ambulatory\", as they \n\t\tlike to say in the trade. Whether or \n\t\tnot she remains so is entirely up to \n\t\tyou.\n\t\t\t(beat)\n\t\tI'll make this as easy as possible for \n\t\tyou, Blade. You can find us at the \n\t\tEdgewood Towers. We'll be waiting with \n\t\tbaited breath.\n\n\tThe tape cuts to static. Blade throws the camcorder against the wall.\n\tIt shatters into a dozen pieces.\n\n\tBlade turns now, his eyes falling on the medical equipment Karen\n\tbrought from the hospital. He moves to the refrigerator, removing a\n\tcanister labeled \"SODIUM CITRATE\". Then he draws his sword. We can\n\tpractically see the wheels turning within his mind --\n\n\tMOMENTS LATER,\n\n\tBlade stands before the open flames of one of the furnaces, heating\n\this sword in the fire. He withdraws it -- it's molten red.\n\n\tBlade turns, dousing the molten hot sword into the sodium citrate\n\tcanister. The refrigerated liquid reacts with the heat, causing the\n\tsword to STEAM and HISS.\n\n\tWhen Blade withdraws the smoking sword, we SEE that the gleaming\n\tsteel has changed colors, taking on a bluish tinge, just like the\n\tsodium citrate it was immersed in. Blade smiles to himself,\n\tsatisfied.\n\n\tCUT TO:\n\n\tINT. FROST'S PENTHOUSE, INNER CHAMBER - DAY\n\n\tSparse decor in a Neo-Japanese vein. Minimalist lighting. The walls\n\tare glass. Recirculating pumps send a constant stream of water\n\tcascading down them.\n\n\tKaren is escorted into the room by Mercury. She gestures to a chair\n\tat the end of a long table. Karen sits. \n\n\tFROST \n\n\tleans forward out of the shadows, resting his elbows on the table,\n\thands steepled together. \n\n\t\t\t\tFROST\n\t\tWell, here we are, Doctor.\n\n\tA cigarette appears in Frost's hand. In the blink of an eye, the\n\tcigarette is lit, burning. The movements are so quick we barely have\n\ttime to register them. \n\n\t\t\t\tKAREN\n\t\tWhy haven't you killed me yet? \n\n\t\t\t\tMERCURY\n\t\tDeacon likes to play with his food \n\t\tbefore he eats it.\n\n\tFrost laughs. Karen tries to keep calm. The longer she keeps them\n\ttalking, the longer she remains alive.\n\n\t\t\t\tKAREN\n\t\tHow many of you are there?\n\n\t\t\t\tFROST\n\t\tA few thousand scattered about the \n\t\tglobe. In the past, we've had to \n\t\trestrict our numbers for fear of \n\t\tdiscovery. That won't be necessary \n\t\tafter tonight. \n\n\t\t\t\tKAREN\n\t\tWhat happens then?\n\n\t\t\t\tFROST\n\t\tThe Blood Tide. Our long-prophesied \n\t\tholy war against the humans. There's a \n\t\tforce, you see -- a spirit that exists \n\t\tin our blood. I've discovered a way to \n\t\tinvoke it.\n\n\t\t\t\tKAREN\n\t\tLaMagra --\n\n\t\t\t\tFROST\n\t\tThat's right. The answers were there \n\t\tall along, of course, scribbled down \n\t\tin the forgotten languages of my kind. \n\t\tWaiting for someone with the patience \n\t\tto decipher them. \n\t\tMy elders were foolish enough to \n\t\tdismiss them as wives tales. But I \n\t\tknew better. \n\t\t\t(beat)\n\t\tImagine my surprise when Blade turned \n\t\tout to be the key which would set that \n\t\tforce free. \n\n\tFrost sits forward now, impassioned.\n\n\t\t\t\tFROST\n\t\tLaMagra isn't a physical being. He's a \n\t\tspirit, requiring a flesh and blood \n\t\thost in order to manifest himself.\n\n\t\t\t\tKAREN\n\t\tYou.\n\n\t\t\t\tFROST\n\t\tWho better to usher in the Blood Tide? \n\n\tKaren shakes her head, protesting --\n\n\t\t\t\tKAREN\n\t\tThere's no need for any of this. Your \n\t\tcondition can be treated. Whistler and \n\t\tI were working on a cure when --\n\n\t\t\t\tFROST\n\t\tWhat makes you think we want to be \n\t\tcured? Blood is only part of the \n\t\tequation. The hunt, the killing, \n\t\tthat's what the Thirst is really \n\t\tabout.\n\n\t\t\t\tKAREN\n\t\tBut you use blood banks --\n\n\t\t\t\tFROST\n\t\tOnly as a last resort. Preserved blood \n\t\tis inferior. There's no flavor left to \n\t\tit, no life. \n\t\t\t(rising from his seat)\n\t\tFortunately, I've found a way around \n\t\tthat particular obstacle. \n\n\tFrost moves to the end of the room. He pushes a button. With a HUM\n\tthe wall slides open, revealing something Karen wishes she'd never\n\tseen -- living blood banks.\n\n\tTHREE SEDATED HUMANS\n\n\thave been hooked up to IV feeds which replenish various nutrients as\n\ttheir blood is drained from them. Shunts have been implanted in their\n\tforearms which serve as taps. \n\n\t\t\t\tFROST\n\t\tUnder these conditions I can keep a \n\t\tdonor alive for years, producing \n\t\tanywhere from fifty to a hundred pints \n\t\tof blood.\n\t\t\t(admiring his charges)\n\t\tOf course, this is just a pilot \n\t\tprogram, really. Once the Tide comes, \n\t\twe'll need to expand production. So \n\t\tmany more mouths to feed -- \n\n\tKaren turns away, overwhelmed by revulsion. \n\n\t\t\t\tKAREN\n\t\tYou're a monster.\n\n\t\t\t\tFROST\n\t\tWhy? Because we live at another \n\t\tspecies' expense? Your people farm \n\t\tcattle and veal, don't they? Fattening \n\t\tthem up with steroids? It's called \n\t\tevolution, Doctor. Survival of the \n\t\tfittest. \n\n\tFrost stares at Karen with an intense, uncompromising gaze. \n\n\t\t\t\tFROST\n\t\tI have a wake-up call for the human \n\t\trace. You're no longer at the top of \n\t\tthe food chain.\n\n\tEXT. SKYSCRAPER ROOFTOP - DAY\n\n\tBLADE'S POV\n\n\tA telephoto view of Frost's penthouse. The windows are polarized,\n\tblocking out the sun's harsh rays.\n\n\tBlade lowers a pair of binoculars. He's standing on the roof of a\n\tbuilding across the street. He hefts an air-launcher rifle up into\n\tfiring position --\n\n\tBANG! An iron spike trailing a steel cable rockets through the air\n\tbetween the two buildings, sinking into the concrete facade of\n\tFrost's penthouse. Blade secures his end of the rope. He slips a\n\tpulley over the rope, grabs hold of two handles, and leaps off the\n\troof ledge!\n\n\tWHOOSH! Blade slides towards Frost's penthouse, a good twenty stories\n\tabove street level. A second before he reaches the windows, Blade\n\tlets go. Momentum sends him CRASHING through in a shower of glass.\n\n\tINT. FROST'S PENTHOUSE - DAY\n\n\tAn ALARM is ringing. Sunlight streams in through the broken window.\n\tTWO VAMPIRE GUARDS who have been caught in the sudden swath of light\n\tare burning up before our eyes. Blade climbs to his feet --\n\n\tA THIRD VAMPIRE\n\n\tleaps at him. Blade spins, flipping the vampire over his shoulder,\n\tsending him straight through one of the other windows --\n\n\tEXT. FROST'S PENTHOUSE - DAY\n\n\tThe vampire tumbles earthward, SCREAMING as the sun's rays ignite his\n\tbody, falling like a human comet.\n\n\tINT. FROST'S PENTHOUSE - DAY\n\n\tBlade unsheathes his sword and heads out into the hall --\n\n\tINT. FROST'S PENTHOUSE, HALLWAY - DAY\n\n\tTo Blade's right is the inner chamber with the \"waterfall\" walls. As\n\tANOTHER VAMPIRE approaches, Blade readies his sword --\n\n\t\t\t\tVAMPIRE\n\t\tYou think I'm afraid of that toothpick \n\t\tof yours?\n\n\t\t\t\tBLADE\n\t\tYou should be. I've made some \n\t\timprovements.\n\n\tAnd with that, Blade thrusts his blackened sword forward, right\n\tthrough the vampire's chest. \n\n\tThe creature SHRIEKS and atomizes -FWOOSH!- flying apart in a fine-\n\tbeaded spray of blood mist. \n\n\tUp ahead are a set of steel doors with a time-lock mechanism. Blade\n\tdraws a Casull, BLASTS away at the lock, then shoulders the doors\n\topen --\n\n\tINT. FROST'S SLEEPING CHAMBER - DAY\n\n\tWe are in a windowless, vault-like room dominated by a series of\n\thigh-tech STAINLESS STEEL SARCOPHAGI. Think of a hyperbaric coffin, \n\teach unit possessing a small face-plate window through which the \n\tsleeping subject can be viewed.\n\n\tBlade unsheathes his sword. He grabs the lid of the first\n\tsarcophagus, HEAVING upward. With a PNEUMATIC HISS, the lid rises,\n\tbelching out a cloud of condensation mist. \n\n\tAs the mist clears, revealing the occupant within, Blade raises his\n\tsword, ready to plunge it downward -- only it's not Deacon Frost who\n\trests beneath him, it's --\n\n\tVANESSA,\n\n\tBlade's mother!!! Although some thirty years have passed since the\n\tevents of our prologue, Vanessa looks exactly the same -- vibrant,\n\tbeautiful, full of life. Her eyes open.\n\n\t\t\t\tVANESSA\n\t\tJason. \n\n\tBlade gasps, uncomprehending.\n\n\t\t\t\tBLADE\n\t\tMother -- ?!\n\n\tVanessa rises from the sarcophagus, tears staining her cheeks.\n\n\t\t\t\tVANESSA\n\t\tI've missed you so much, Jason. \n\t\t\t(drawing closer)\n\t\tYou have no idea what I've been \n\t\tthrough, how much I've wanted to see \n\t\tyou -- \n\n\tBlade falters, his mind reeling. What he's seeing is incomprehensible\n\t-- his mother is dead. Yet, here she is in the flesh, reaching out to\n\thim and --\n\n\t-- flashing a mouthful of viper-like fangs! She SNARLS and strikes,\n\tbrutally raking her claws across Blade's face, knocking the sword\n\tfrom his grasp --\n\n\tA TRIO OF BLACK-CLAD VAMPIRES\n\n\tled by Mercury step from the shadows where they'd been waiting all\n\talong. They're armed with tasers which they fire en masse --\n\n\tBlade is hit by the taser darts from all sides. He writhes as\n\telectricity courses through him, then collapses in a heap. He labors\n\tto lift his head, looking up at Vanessa -- \n\n\t\t\t\tBLADE\n\t\tBut you -- died --\n\n\t\t\t\tVANESSA\n\t\t\t(a hellish smile)\n\t\tDeacon brought me back. \n\n\t\t\t\tBLADE\n\t\tFight him --\n\n\tAs if on cue, Frost appears at Vanessa's side, wrapping a proprietary\n\tarm about her waist, kissing the nape of her neck. She leans into him\n\t-- an act of practiced intimacy.\n\n\t\t\t\tFROST\n\t\tShe can't. She's one of my thralls \n\t\tnow. She has about as much free will \n\t\tas a puppet on a string.\n\t\t\t(looking at Vanessa)\n\t\tYou love me, don't you, Vanessa? \n\n\t\t\t\tVANESSA\n\t\tYes.\n\n\tFrost kisses Vanessa hungrily. Then he kneels and reaches into\n\tBlade's jacket, retrieving a vial of Blade's serum.\n\n\t\t\t\tFROST\n\t\tWhat do we have here? Your precious \n\t\tserum? I don't think you'll be needing \n\t\tthis anymore.\n\n\tFrost crushes the vial in his fist. Blade struggles to reach Frost,\n\tstretching a palsied hand upwards --\n\n\t\t\t\tBLADE\n\t\tPlease -- \n\n\t\t\t\tVANESSA\n\t\tListen to your father, Jason. It's \n\t\tgoing to be a better world.\n\n\tBlade stares at Vanessa uncomprehending. \n\n\t\t\t\tFROST\n\t\tDon't look so surprised, Blade. You've \n\t\tspent your life looking for the \n\t\tvampire who fathered you. Well you can \n\t\trest easy now, you've found him.\n\t\t\t(gripping Blade's chin)\n\t\tDaddy's here.\n\n\tBlade's eyes widen in shock. Frost simply laughs.\n\n\t\t\t\tFROST\n\t\tIt's true, Blade. You've got my blood \n\t\trunning through your veins.\n\t\t\t(smiling)\n\t\tThirty years ago. A moonlit street, a \n\t\twoman on her way home alone. You were \n\t\tconceived the night I tore my fangs \n\t\tinto your mother's flesh. \n\n\tFrost swings his fist into Blade's skull. Everything goes black. \n\n\tCUT TO:\n\n\tINT. ARMORED TRUCK - NIGHT\n\n\tFADE IN as Blade opens his eyes, still groggy, his face beaded with\n\tsweat. Feverish. His hands have been bound tightly behind his back\n\twith manacles and chains. \n\n\tKAREN\n\n\tsits nearby, watching him. From the steady rocking motion and the\n\tSOUNDS of traffic outside, it's evident that they are in the back of\n\ta moving truck.\n\n\t\t\t\tKAREN\n\t\tAre you all right?\n\n\t\t\t\tBLADE\n\t\t\t(weakly)\n\t\tI've been better --\n\n\t\t\t\tBLADE\n\t\tHow long have we been driving?\n\n\t\t\t\tKAREN\n\t\t\t(shaking her head)\n\t\tI don't know. I woke up just before \n\t\tyou did --\n\n\tAs he struggles to sit up, she crosses over to him. Blade shuts his\n\teyes for a moment, fighting a wave of pain.\n\n\t\t\t\tKAREN\n\t\tIs it bad?\n\n\t\t\t\tBLADE\n\t\t\t(nodding)\n\t\tWe get out of this alive, maybe I'll \n\t\ttake that miracle cure of yours.\n\n\tKaren doesn't respond. Instead she looks away. How in the world is\n\tshe supposed to tell him this?\n\n\t\t\t\tKAREN\n\t\t\t(quietly)\n\t\tIt won't work on you.\n\n\t\t\t\tBLADE\n\t\tWhat are you talking about?\n\n\tKaren forces herself to meet his gaze.\n\n\t\t\t\tKAREN\n\t\tYour condition's congenital, the \n\t\tgenetic mutations occurred in utero. \n\t\tAll the other victims contracted \n\t\tvampirism after birth. \n\n\tBlade stares at Karen, disbelieving. Who could imagine a more\n\thorrifying irony? She's crying now. She can't help it.\n\n\t\t\t\tKAREN\n\t\tI can't cure you, Blade. I can cure \n\t\tmyself, but I can't cure you.\n\t\t\t(beat)\n\t\tI'm so sorry.\n\n\tBlade's head sinks, the last vestiges of hope draining out of him.\n\n\tAnd then, as if the final stake were being pounded in, the truck\n\tlurches to a stop. We hear the ENGINE being killed, then FOOTSTEPS\n\tapproaching, and then a series of BOLTS BEING SHIFTED as --\n\n\t-- the back of the truck is thrown open. Frost stands there,\n\tgrinning, flanked by Mercury, Quinn, Vanessa, and a half-dozen other\n\tVAMPIRE ASSOCIATES. \n\n\t\t\t\tFROST\n\t\tWelcome home, children.\n\n\tEXT. THE BANK OF EREBUS - NIGHT\n\n\tBlade and Karen are dragged from the back of the truck, which is\n\trevealed now to be an armored car. \n\n\tTHE BANK OF EREBUS\n\n\trises up before them. A towering beaux-arts edifice situated in the\n\theart of the city's high-priced financial district -- one of the many\n\tinstitutions owned and operated by the vampire enclave.\n\n\tFrost starts up the marble steps towards a grand, triple-arched\n\tentrance flanked by Corinthian columns. Karen and Blade are dragged\n\talong after him. \n\n\tINT. BANK OF EREBUS - ATRIUM - NIGHT\n\n\tFrost leads his vampires into a high-ceilinged atrium, moving towards\n\ta bank of elevators -- one of the doors of which is outfitted with a\n\thigh-tech hand-key ID system.\n\n\tFrost places his palm on the ID screen. The screen GLOWS GREEN,\n\tacknowledging his identity. In response, the doors HISS open.\n\n\tINT. SECURITY ELEVATOR - NIGHT\n\n\tBlade and Karen are pulled inside the elevator. The control panel\n\tbuttons have vampire glyphs, rather than numbers. Frost presses the\n\tbottom one. The doors close with a WHOOSH and the car descends --\n\tdown, down, down.\n\n\tFrost glances over at Karen, smiling amiably.\n\n\t\t\t\tFROST\n\t\tOn its surface, this building houses \n\t\tone of the city's oldest financial \n\t\tinstitutions -- and for over \n\t\ttwo-hundred years its served our \n\t\tcorporate needs. Look beneath the \n\t\tsurface, however, and you'll discover \n\t\tanother truth entirely --\n\n\tThe elevator CHIMES, having arrived at its destination. The doors\n\tHISS open, revealing \n\n\tINT. THE TEMPLE OF NIGHT \n\n\tA vast, barrel-vaulted chamber lined with recessed tombs stretches\n\tout before us -- an underground cathedral of sorts, wrought from\n\talabaster and marble. Restrained. Elegant. Replete with dark\n\tsplendor.\n\n\t\t\t\tFROST\n\t\tAs above, so below.\n\n\tTorches burn in wall sconces, casting everything in a warm, amber\n\tglow. Frost takes in the beauty of the place.\n\n\t\t\t\tFROST\n\t\tWelcome to our hall of ancients, \n\t\tDoctor. We call it the Temple of \n\t\tNight.\n\n\tBlade and Karen are led to the middle of the room, where a stone\n\taltar rises up from a dais. Blade is roughly thrown to the ground. He\n\tkneels there, eyes cast downward. Broken. His system being assaulted\n\tby the devastating effects of the Thirst. \n\n\tQuinn and Mercury pick their way through Blade's discarded gear.\n\tQuinn picks up the punching dagger, admiring it. \n\n\tFrost turns to Mercury, who's been holding Blade's scabbarded sword.\n\n\t\t\t\tFROST\n\t\tLet's see this sword of his.\n\n\tMercury draws the sword, handing it to Frost. He sights down the\n\tlength of it, testing its weight. With a flick of his wrist, he\n\tlashes out, slashing Blade's cheek open. \n\n\t\t\t\tFROST\n\t\tStill quite sharp, I see.\n\n\tBlade feebly struggles to rise. Frost clubs him on the back of the\n\tneck with the sword pommel. Blade crumples. Karen tries to pull free,\n\tbut Quinn holds her tight.\n\n\t\t\t\tKAREN\n\t\tBlade --\n\n\t\t\t\tFROST\n\t\tYou're wasting your breath, woman. He \n\t\tcan't hear you now. It's the Thirst, \n\t\tyou see? It already has him in its \n\t\tgrip.\n\n\tFrost reaches down, dragging Blade's head up by his hair. Karen\n\twatches on as Frost continues to taunt him.\n\n\t\t\t\tFROST\n\t\tHow long has it been since you had \n\t\tyour serum? Twelve hours? More? You \n\t\tmust be quite thirsty by now.\n\n\tHe crouches down so he's eye to eye with Blade.\n\n\t\t\t\tFROST\n\t\tWhat does it feel like? Is your blood \n\t\ton fire? Are you burning up inside? \n\t\tGive in to the Thirst, Blade. Embrace \n\t\tyour true nature.\n\n\tBlade shivers, grits his teeth, it's like he's going through heroin\n\twithdrawal. \n\n\t\t\t\tBLADE\n\t\t-- go to hell --\n\n\tFrost smiles, his eyes burning with an infernal glow.\n\n\t\t\t\tFROST\n\t\tI've got news for you, Blade. We're \n\t\talready here.\n\n\tFrost turns to the others, motioning.\n\n\t\t\t\tFROST\n\t\tTake him to the sanctuary. It's time \n\t\the was bled.\n\n\tThe other vampires retreat, dragging Blade along with them. Karen is\n\tleft alone with Frost and Quinn.\n\n\t\t\t\tFROST\n\t\tI'd let you watch the proceedings, \n\t\tDoctor, but I'm afraid that privilege \n\t\tis reserved for members of my own \n\t\trace. Don't worry, though, I've made \n\t\talternate arrangements for you.\n\n\tFrost motions and Quinn drags Karen towards --\n\n\tTHE MOUTH OF A PIT\n\n\tsome forty feet deep, its lichen-encrusted stone walls worn smooth\n\tover time. As Frost gestures to the yawning darkness beneath them,\n\tQuinn forces Karen towards the edge. \n\n\t\t\t\tFROST\n\t\tWe call this the Bone Pit. It's where \n\t\twe keep our mistakes, the ones who \n\t\tcouldn't successfully make the \n\t\ttransition from human to vampire. \n\n\tFrost reaches out, caressing Karen's neck, puncturing the soft flesh\n\tbeneath her chin with a razored fingernail.\n\n\t\t\t\tFROST\n\t\tThey'll feed on anything, given the \n\t\tchance -- animals, corpses, even other \n\t\tvampires.\n\n\tFrost nods. Karen struggles against Quinn, but it's no good. In a\n\tmanner of seconds, she's falling --\n\n\tINT. BONE PIT - NIGHT\n\n\t-- making a decidedly rough landing on a heap of bones far below. She\n\tGROANS, taking stock of her battered body.\n\n\tUP ABOVE,\n\n\tDeacon watches from the lip of the pit, amused. \n\n\t\t\t\tFROST\n\t\tOf course, a strapping young woman \n\t\tlike yourself -- well I think you just \n\t\tmight be considered finger food.\n\n\tAnd with that, he's gone, stepping away from the pit.\n\n\tINT. TEMPLE OF NIGHT - BLEEDING CHAMBER - NIGHT\n\n\tWe are in a small, elevated antechamber which is situated above the\n\tmain vampire sanctuary.\n\n\tBLADE, \n\n\tnow weakened to the point of collapse, is being lashed to a rack-like\n\tdevice by iron chains. \n\n\tMercury and her cohorts move efficiently, quickly securing him. When\n\tthey are through, the rack is hoisted up into the air via a series of\n\twinch-driven chains. \n\n\tWith every turn of the winch crank, the chains are drawn tighter,\n\tcausing Blade to CRY OUT, until at last, he is suspended in mid-air,\n\tspread-eagle. \n\n\tFROST\n\n\tapproaches, still carrying Blade's sword.\n\n\t\t\t\tFROST\n\t\tIt's been a long road, hasn't it? Such \n\t\ta pity Whistler led you so far astray. \n\n\tFrost cocks his head to the side, studying Blade's face.\n\n\t\t\t\tFROST\n\t\tI don't blame you, though. I want you \n\t\tto know that. Even after all you've \n\t\tdone. I understand, Blade, I really \n\t\tdo. It's the human side of you which \n\t\thas corrupted your reasoning, made you \n\t\tweak. But we'll take care of that, \n\t\twon't we?\n\n\tBlade struggles to lift his head, forcing himself to match Frost's\n\tgaze, shaking with hatred.\n\n\t\t\t\tBLADE\n\t\tI'd kill myself -- before I turned \n\t\tinto something like you.\n\n\tFrost just smiles and shakes his head.\n\n\t\t\t\tFROST\n\t\tNo you wouldn't. I'm going to bleed \n\t\tyou dry, Blade. All the poison that \n\t\tmakes you human. \n\t\t\t(drawing closer)\n\t\tWhen the Tide comes, you'll be begging \n\t\tme put you through the Change. \n\n\tFrost lifts up Blade's sword, methodically slitting Blade's wrists\n\tone by one. He makes the cuts lengthwise, opening up the cephalic and\n\tbasilic veins with surgical precision.\n\n\tBlood wells up from the fresh wounds, running down Blade's forearms,\n\tcollecting in a cistern beneath his feet. \n\n\tFrost watches the steady, inexorable process, then nods, satisfied.\n\tHe looks to the others who are gathered behind him, watching on with\n\tsilent reverence.\n\n\t\t\t\tFROST\n\t\tIt's done. We should ready ourselves \n\t\tfor the ritual of invocation.\n\n\tFrost leads Mercury, Quinn, and the others from the sanctuary.\n\n\tBlade struggles futilely against his bonds, crying out in\n\tfrustration, his body eventually sagging from exhaustion. \n\n\t\t\t\tVANESSA (O.S.)\n\t\tThere's no use fighting us, Jason. \n\n\tBlade looks up, focusing now on --\n\n\tVANESSA, \n\n\twho has remained behind. Blade stares at her. As terrible as his\n\tphysical torment is, his mother's betrayal is infinitely worse.\n\n\t\t\t\tBLADE\n\t\tHow could you be a part of this?\n\n\t\t\t\tVANESSA\n\t\tThese are my people now. I'm one of \n\t\tthem.\n\n\t\t\t\tBLADE\n\t\tYou don't have to be. \n\n\t\t\t\tVANESSA\n\t\tYou don't understand. I've killed, \n\t\tI've hunted, and I've enjoyed it. \n\n\tShe draws closer, caressing her son's face. There's just a hint of\n\tcreepy eroticism in her action, a dash of incest. \n\n\t\t\t\tVANESSA\n\t\tI wish you could see the world as I \n\t\tdo. Deacon opened my eyes. There's no \n\t\tturning back from that.\n\n\t\t\t\tBLADE\n\t\tI don't believe that.\n\n\t\t\t\tVANESSA\n\t\tYou will. Time is on our side. Sooner \n\t\tor later, the Thirst always wins.\n\n\tVanessa turns away now. Blade cries after her --\n\n\t\t\t\tBLADE\n\t\tMother!\n\n\tVanessa pauses, looking back, smiling cruelly.\n\n\t\t\t\tVANESSA\n\t\tYour mother died the night you\n\t\twere born. \n\n\tAnd with that, she's gone, melting into the shadows. \n\n\tCUT TO:\n\n\tINT. THE BONE PIT - NIGHT \n\n\tKaren rises, wary, taking in her shadowed surroundings. \n\n\tHEAPS OF HUMAN BONES\n\n\tare piled against the pit walls -- skulls, rib-cages, femurs, tibias\n\t-- all picked clean of flesh. Some of the skulls have large, canine-\n\tlike fangs -- the remnants, no doubt, of long-deceased vampires.\n\n\tSuddenly we hear a WHISPER of sorts, the soft CLINKING of bone\n\tfragments grinding together --\n\n\tKaren spins, trying to place the source of the sound. Then she hears\n\tthe SOUND again. Behind her now, closer.\n\n\t\t\t\tREVENANT (O.S.)\n\t\tKarennnnn --\n\n\tKaren looks up with a growing sense of dread.\n\n\tA FACE\n\n\temerges from the darkness. Pallid, cadaverous, shedding its\n\tdesiccated flesh. Lidless eyes like black marbles slick with\n\tVaseline. A mouth like a raw wound. \n\n\t\t\t\tREVENANT\n\t\tKarreennnnnn. I never thought I'd see \n\t\tyou againnnnn.\n\n\tKaren backs away, realizing who she's standing before.\n\n\t\t\t\tKAREN\n\t\tCurtis?!\n\n\tWhat used to be Curtis SNARLS, knocking Karen back into the drift-\n\tpile of bones. It pins her to the ground, kneeling above her,\n\tgurgling through its gutted trachea.\n\n\t\t\t\tCURTIS REVENANT\n\t\tTell, me, Karennn -- ever have second \n\t\tthoughts -- about us?\n\n\tKaren SCREAMS, trying to force the revenant away from her, but it\n\tlunges closer, lolling its distended tongue over her mouth in a\n\tpathetic approximation of a French kiss.\n\n\tShe fumbles behind her, choking, grabbing hold of a human femur,\n\tblindly swinging it upward --\n\n\tCRACK! The blow shatters the Curtis-thing's jaw. It rears back,\n\tfalling to the side. \n\n\tKaren crawls out from under its weight, swinging the femur again and\n\tagain --\n\n\tCRACK! CRACK! CRACK! Karen pummels the howling horror, driving it\n\tback until the femur actually splinters in half. The creature's head\n\thangs at an awkward angle now, its neck broken -- but still it\n\tadvances, dragging itself back up.\n\n\tSobbing, Karen retreats, clutching the splintered femur like a\n\tmakeshift dagger.\n\n\tCurtis charges at her, a blur of slashing claws. At the last moment,\n\tKaren ducks, thrusting the bone dagger up into Curtis' chest --\n\n\tCurtis impales himself, right through the heart. For one split-\n\tsecond, his eyes widen in surprise --\n\n\t-- and then he goes into a death-spasm, vomiting up a spray of\n\tcaustic vampire blood-bile, spattering Karen. She sinks to her knees,\n\tGASPING, as the thing that used to be Curtis shrivels up, melting\n\taway into burbling puddle.\n\n\tAfter a beat, Karen rises and moves to the pit wall, running her\n\thands over the lichen-slick surface, searching for a way out. The\n\tmortar between the brickwork is ancient, crumbling. \n\n\tKaren looks to the ground, reaching for one of the splintered femurs.\n\tShe pounds it into the mortar between two bricks -- and it holds,\n\tworking as a makeshift piton.\n\n\tKaren reaches for another broken femur, lodging it a foot above the\n\tfirst. She hauls her body up now, suspending her weight from the two\n\tmakeshift pitons. Again, they hold.\n\n\tTrembling from exertion, Karen pulls the right piton free, hanging\n\tsolely from her left hand now. Though her handhold is precarious, she\n\tmanages to swing the right hand up again, pounding that piton another\n\tfoot above the left.\n\n\tIn this slow, torturous manner, Karen begins to climb her way up out\n\tof the pit.\n\n\tINT. TEMPLE OF NIGHT - BLEEDING CHAMBER - NIGHT\n\n\tBlade hangs from his chains, head slack, eyes half-lidded and\n\tlusterless. His skin has grown ashen as his life's blood has been\n\tbled away.\n\n\tMercury appears before him, accompanied by Quinn. She bends in close\n\tto kiss Blade lightly on the lips.\n\n\t\t\t\tMERCURY\n\t\tIt won't be long now, lover. \n\n\tQuinn draws alongside her, hefting Blade's punching dagger. He places\n\tit against Blade's throat, slowly applying pressure. At this point,\n\tBlade's too weak to even resist.\n\n\t\t\t\tQUINN\n\t\tWe should finish him off.\n\n\t\t\t\tMERCURY\n\t\t\t(shaking her head)\n\t\tNo. Deacon wants him turned.\n\n\tQuinn releases Blade, disgusted. \n\n\t\t\t\tQUINN\n\t\tFucking waste, if you ask me.\n\n\tAs Mercury and Quinn exit, the CAMERA DROPS DOWN to the cistern\n\tbeneath Blade's feet. We follow the blood which has collected there\n\tas it flows into a crude drain and --\n\n\tINT. SANCTUARY - NIGHT \n\n\t-- emerges from the ceiling of the sanctuary below. The stream of\n\tblood is directed down the channels of a spiral column, where it\n\tfinally pools into a waiting chalice.\n\n\tPULL BACK TO REVEAL\n\n\tthe sanctuary in full. A large circular chamber, the perimeter of\n\twhich is lined with recessed alcoves housing the remains of the\n\tvampire ancients, set into the sanctuary walls like cells in a hive.\n\n\tDEACON FROST\n\n\tstands in the center of the chamber, allowing Vanessa to clothe him\n\tin ceremonial regalia -- gleaming, centuries-old armor. He pauses,\n\tkissing her hungrily.\n\n\tHaving finished suiting up, he turns to face the vampires who have\n\tbeen faithful to his cause -- Mercury, Quinn, a host of others. A\n\thush settles upon them. There's an excitement in the air, a sense\n\tthat something remarkable is about to happen.\n\n\t\t\t\tFROST\n\t\tTonight is the night we've waited our \n\t\tentire lives for. Tonight, the \n\t\tblood-dimmed Tide is loosed upon the \n\t\tworld. Tonight, the Age of Man comes \n\t\tto an end. \n\n\tThe vampires bellow out a CHORUS OF CHEERS, their voices resonating\n\toff the stone walls like thunder. \n\n\tCUT TO:\n\n\tINT. TEMPLE OF NIGHT - BONE PIT - NIGHT\n\n\tKaren's hands appear over the lip of the bone pit. She heaves herself\n\tup, collapsing onto the floor --\n\n\t-- but there's no time to rest. Even now she can hear the VAMPIRES\n\tCHEERING. She drags herself to her feet, letting the voices guide\n\ther.\n\n\tCUT TO:\n\n\tINT. ANTECHAMBER - NIGHT\n\n\tKaren slips around a corner, guarded, searching. She SEES Blade\n\tstrung up before her, seemingly lifeless.\n\n\tKaren studies the chains which bind Blade, following them back to\n\ttheir source at the winch. She releases the brake on the winch crank,\n\tsending the chains RATTLING down through the overhead pulleys which\n\tsuspend them. \n\n\tBlade crumples to the floor, lying still. Karen is at his side in an\n\tinstant --\n\n\t\t\t\tKAREN\n\t\t\t(whispering, urgent)\n\t\tBlade.\n\n\tBlade's eyes flicker open, fixing on her. Inhuman. He's shaking\n\tlike an alcoholic going into delirium tremens.\n\n\tINT. TEMPLE SANCTUARY - NIGHT\n\n\tVanessa hands Frost the chalice containing Blade's blood. He lifts it\n\tup for all to see. The vampires begin to chant en masse, some long-\n\tforgotten invocation in the vampire tongue.\n\n\t\t\t\tFROST\n\t\t\t(grinning, to himself)\n\t\t\"And what rough beast, its hour come \n\t\tround at last, slouches towards \n\t\tBethlehem to be born?\"\n\n\tFrost lifts the chalice to his lips and begins to drink. \n\n\tCUT TO:\n\n\tINT. ANTECHAMBER - NIGHT\n\n\tBlade tries to sit up, gripping Karen's wrist --\n\n\t\t\t\tBLADE\n\t\tGet out of here --\n\n\t\t\t\tKAREN\n\t\tI'm not leaving without you.\n\n\t\t\t\tBLADE\n\t\tYou don't understand. The Thirst --\n\n\tHe clutches his stomach, experiencing phenomenal pain.\n\n\t\t\t\tBLADE\n\t\t\t(gasping)\n\t\t-- tearing me -- apart.\n\n\t\t\t\tKAREN\n\t\tI know. Take some of my blood.\n\n\t\t\t\tBLADE\n\t\tNo --\n\n\t\t\t\tKAREN\n\t\tIt's the only way. You know that. \n\t\tWe'll never get out of here alive if \n\t\tyou don't.\n\n\tBlade suppresses a shudder. Simply keeping himself from attacking her\n\ttakes every ounce of his resolve.\n\n\t\t\t\tBLADE\n\t\tI can't -- I won't be able to stop --\n\n\t\t\t\tKAREN\n\t\tYes you will. The human side of you is \n\t\tstronger. I know it is.\n\n\tKaren matches Blade's gaze, steeling herself. The truth is, she's\n\tterrified. \n\n\tBlade stares back at her. At this moment, he wants what Karen is\n\toffering more than anything he's ever desired. And so he rises --\n\n\tCUT TO:\n\n\tINT. TEMPLE OF NIGHT - SANCTUARY - NIGHT\n\n\tFrost continues drinking down the blood, when suddenly, a force\n\tseizes his body. He throws his head back, eyes rolling to white,\n\tflinging the chalice aside.\n\n\tAnd as the vampire incantation reaches a fevered pitch, we SEE the\n\tstone tomb tablets off the vampire ancestors beginning to judder --\n\tas if some force within were trying to break free --\n\n\tCUT TO:\n\n\tINT. ANTECHAMBER - NIGHT\n\n\tKaren turns her head to the side, baring her neck, offering herself\n\tto Blade. Blade opens his mouth. His canines elongate. He lowers his\n\thead --\n\n\t-- and starts to feed. Karen involuntarily stiffens as Blade's teeth\n\tpuncture her skin and we --\n\n\tCUT TO:\n\n\tINT. TEMPLE SANCTUARY - NIGHT\n\n\tFrost shakes, possessed by an unseen force. A wind picks up from\n\tnowhere, swirling about the chamber, accompanied by a strange\n\tHUMMING. \n\n\tSuddenly, one of the tombs BURSTS OPEN. A WRAITH-LIKE SPIRIT rushes\n\toutward in a fountain of light, penetrating Frost's body.\n\n\tThen ANOTHER TOMB SPLITS APART. Then ANOTHER, and ANOTHER -- until a\n\ttorrent of SPIRIT-WRAITHS are surging into Frost, buffeting him about\n\tlike a scarecrow in a cyclone.\n\n\tMercury, Vanessa, and the other vampires back away, apprehensive,\n\thumbled by what they're witnessing.\n\n\tCUT TO:\n\n\tINT. ANTECHAMBER - NIGHT\n\n\tBlade moans, sinking his teeth deeper. Karen's head rolls back. Her\n\teyes open -- glassy, unseeing -- as a wave of ecstasy overtakes her. \n\n\tShe shudders, her breath quickening, falling into a synchronous\n\trhythm with Blade's. Her fingers dig deep into his back, clawing\n\tdownward, tearing into him -- \n\n\tShe's not Karen anymore -- she's a red blood cell, an erythrocyte,\n\tspinning in a river of plasma, roaring up Blade's femoral artery,\n\tracing towards the pumping chambers of his heart which beats like the\n\tdeafening breath of God, which blots all other sounds out of\n\texistence and we're --\n\n\tCUTTING BACK AND FORTH NOW\n\n\tbetween Frost's transformation and Blade's, each of them growing\n\tstronger by the second, caught in an ever-increasing feedback loop of\n\texpanding energy until --\n\n\t\t\t\tBLADE\n\t\tNO!!!!\n\n\tBlade tears himself from Karen, his pulse racing as -- \n\n\tCUT TO:\n\n\tINT. TEMPLE SANCTUARY - NIGHT\n\n\t-- the invocation of LaMagra reaches critical mass. Frost is consumed\n\tby a hellish force, unable to withstand the onslaught of spirit\n\tenergy any longer. \n\n\tCUT TO:\n\n\tINT. ANTECHAMBER - NIGHT\n\n\t-- Karen clawing at Blade, tears streaming down her cheeks.\n\n\t\t\t\tKAREN\n\t\tDon't stop --\n\n\tBut Blade grips her by her shoulders, shoving her back. Karen stares\n\tat Blade, wide-eyed, as if waking from a trance. She touches the raw\n\twounds on her neck, shaken --\n\n\t\t\t\tKAREN\n\t\tMy God --\n\n\tBlade rises to his full height. His strength has more than returned,\n\tit's been doubled by the infusion of real blood. And there's\n\tsomething else in his gaze now too -- an animal fury that was missing\n\tbefore. Blade has taken one giant step closer to the darkness. \n\n\t\t\t\tKAREN\n\t\t\t(hesitant)\n\t\tAre you -- all right?\n\n\tBlade pulls at the chains manacled to his wrists, SNAPPING them apart\n\tlike toys. He flexes his hands -- fingernails lengthening to tapered\n\tpoints. And he smiles, offering us a view of his canines, which have\n\telongated into fangs.\n\n\t\t\t\tBLADE\n\t\t\t(near-demonic)\n\t\tNever been better.\n\n\tINT. TEMPLE SANCTUARY - NIGHT\n\n\tThe aftermath. Smoke hangs heavy in the air, occluding the area where\n\tFrost had stood. As it dissipates, Mercury and the others creep\n\tforward, apprehensive --\n\n\t\t\t\tMERCURY\n\t\tDeacon?\n\n\tFROST\n\n\tstands with his back to us, his body trailing wisps of occult fumes.\n\tAs he slowly turns, we catch a glimpse of his eyes -- burning with an\n\tawesome, inner fire. \n\n\t\t\t\tFROST\n\t\tNo longer.\n\n\t\t\t\tBLADE (O.S.)\n\t\tFrost!!!\n\n\tAll heads turn --\n\n\tBLADE \n\n\tstands at the balcony overhead, Karen at his side. He leaps from it,\n\tsomersaulting down to the floor below, landing on his feet like a\n\tpredatory cat.\n\n\t\t\t\tBLADE\n\t\tWho dies first?\n\n\t\t\t\tFROST\n\t\t\t(growling, to the others)\n\t\tTake him.\n\n\tQuinn GROWLS, stepping forward, armed with Blade's punching dagger.\n\tHe offers his second \"new hand\" up for view. \n\n\t\t\t\tQUINN\n\t\tGrew another hand for you sweetmeat --\n\t\t\t(tossing the dagger to his new hand)\n\t\t-- and now I'm gonna kill you with it.\n\n\tQuinn charges. Blade meets the vampire head-on, dropping into a low\n\tkick and sweeping the vampire's legs out from under him. He spins\n\tbehind Quinn -- \n\n\t\t\t\tBLADE\n\t\tLet's see if you can grow a new one\n\t\tof these!\n\n\tBlade hooks a finger through the metal ring at the end of his jacket\n\tsleeve, pulling out a retractable strangle-wire which he twists\n\taround Quinn's throat. \n\n\tBlade tightens the wire, decapitating Quinn. The headless body\n\tstaggers about, then drops to the cavern floor. Blade scoops up his\n\tpunching dagger --\n\n\t\t\t\tBLADE\n\t\tNext?\n\n\tMercury and the other faithful vampires charge en masse. Blade\n\tlaunches a spinning wheel kick into the first vamp's face, SNAPPING\n\tits neck --\n\n\tMercury has Blade's .454 Casulls. She aims them at him --\n\n\t\t\t\tMERCURY\n\t\tHave a taste of your own medicine!\n\n\tAs she FIRES, Blade tucks and rolls, knocking one of the guns from\n\ther hand. The guns spins across the floor, where it's scooped up\n\tby --\n\n\tKAREN,\n\n\twho takes aim at an approaching vamp, BLOWING it away.\n\n\tMeanwhile, Blade traps Mercury's other hand, disarming her, flipping\n\ther over his shoulder. He hefts his Casull, BLASTING her into\n\teternity --\n\n\tA bloodbath ensues. Blade moves like speed-personified, FIRING off\n\tone, two, THREE HEADSHOTS with brain-numbing accuracy, cutting down\n\tthe vampires where they stand. \n\n\tIt's an orgy of gunpowder smoke and showering bodily fluids and\n\t-CLICK-CA-CHING-CLICK!- Blade and Karen have spent their bullets\n\tand --\n\n\t\t\t\tFROST (O.S.)\n\t\tEnough!!!\n\n\tBlade turns to face --\n\n\tFROST, \n\n\twho's advancing, clutching Blade's own sword in his hand. He thrusts\n\tthe sword forward --\n\n\tBlade presses the grip-trigger on his punching dagger -CHING!- the\n\ttwo side blades spread out. We hear the RASP and CLANG of metal on\n\tmetal as Blade manages to trap the sword-point between two of the\n\tdagger blades --\n\n\tFor a moment, both men are eye to eye, their weapons locked together,\n\tthen, Frost forces Blade backwards --\n\n\tWhat happens next is the most blindingly-fast sword fight ever\n\texposed to celluloid. Both men, fueled by super-human speed, lunge\n\tand spin across the cavern floor in a blurred ballet of lethal moves.\n\n\tFrost lands a powerful blow on Blade's shoulder, the sword-edge\n\tbiting deep into the flesh. Blade SCREAMS. Frost withdraws the sword\n\tfor another strike --\n\n\t-- until Blade sees an opening and takes it, slicing Frost's left arm\n\toff at the shoulder --\n\n\tThe severed arm releases Blade's sword, but the arm doesn't fall! To\n\tFrost and Blade's mutual surprise the arm floats in mid-air, bleeding\n\tred, quivering like zero-G liquid, then SLURPING back to Frost's arm-\n\tstump to re-attach itself!\n\n\tUndaunted, Blade slices the punching dagger into Frost's mid-section,\n\tmeeting only liquid-like resistance. The moment Blade withdraws his\n\tdagger, Frost's flesh seals itself up again.\n\n\tBlade hesitates now, uncertain -- and Frost laughs, understanding\n\twhat has happened.\n\n\t\t\t\tFROST\n\t\tYou're too late, Blade. I'm already \n\t\tchanging. Don't you see? The Sleeper \n\t\thas awakened. I'm not just Frost \n\t\tanymore. I'm becoming a god now, \n\t\tblood incarnate.\n\n\tEven as Frost utters the words, his body begins to ripple and morph,\n\tbleeding red, taking on the characteristics of liquid. He doesn't\n\twalk so much now as flow. He's become a three-dimensional creature of\n\tanimated blood! A blood demon.\n\n\tON KAREN,\n\n\tas she watches Frost's transformation, wide-eyed. She SEES Blade's\n\tdiscarded sword, reaches for it -- suddenly, a SHADOW moves on the\n\tperiphery of her vision --\n\n\tVANESSA\n\n\trushes at Karen in a near-blur. The SNARLING hellion is upon Karen in\n\tan eye-blink, SLAMMING her down against the temple floor, pinning\n\ther. \n\n\t\t\t\tVANESSA\n\t\tDid you think I'd forgotten you, you \n\t\tlittle whore?\n\n\tBACK TO FROST,\n\n\twho towers above Blade, swaying back and forth in his new, liquid-\n\tlike form.\n\n\t\t\t\tFROST\n\t\tYou can't hurt me anymore. \n\n\tWHOOSH! Frost rises upwards on a spiraling column of blood, HOWLING\n\tWITH LAUGHTER, then just as suddenly --\n\n\t-- splashes back to earth, spreading out in a widening pool. In the\n\tblink of an eye, he streams through Blade's feet, re-solidifying\n\tbehind Blade. Blade spins, swings his dagger --\n\n\tOnce again, Frost morphs into blood-form. He races around Blade in a\n\tseries of spouting arcs, turning from blood-form to solid and back\n\tagain in a series of split-second transformations.\n\n\tBlade whirls, striking with his dagger and missing every time --\n\n\tWHOOSH! Frost suddenly dissipates, SPLASHING away into a million\n\tzero-G blood bubbles, vanishing. Blade spins, unnerved, trying to\n\tpin-point his foe's next manifestation.\n\n\t\t\t\tBLADE\n\t\tWhere are you?!\n\n\tFrost's voice answers from all directions.\n\n\t\t\t\tFROST\n\t\tEverywhere.\n\n\tA DROPLET OF BLOOD\n\n\tspatters the floor at Blade's feet. Blade looks up --\n\n\tA SHOWER OF BLOOD\n\n\trains from above, coalescing into Frost as he sweeps down on Blade\n\tlike a giant bird of prey, crushing him against the temple floor. \n\n\t\t\t\tFROST\n\t\tYou want my blood so much?! Take it!\n\n\tFrost's arms elongate and liquefy, flowing into two snake-like spouts\n\tof blood -- the rest of Frost remains solid. The blood-spouts twist\n\taround Blade's neck, melding together, completely encasing Blade's\n\thead in a bubble of blood.\n\n\tBlade claws at the blood-bubble as if it were a solid object that he\n\tcould dislodge, but his fingers just pass through it!\n\n\tBACK TO VANESSA\n\n\tas she wraps a hand around Karen's throat, choking her.\n\n\tAs Karen struggles, she frees a hand, sliding it down to her hip\n\tpocket, digging something out -- Whistler's vampire mace canister!\n\n\tShe forces it up between them, triggering a jet of TOXIC MIST into\n\tVanessa's face --\n\n\tVanessa recoils, HOWLING, her head smoking as if it were doused with\n\tformic acid, skin sloughing off from her skull. Karen lunges for\n\tBlade's sword --\n\n\tBACK TO FROST AND BLADE\n\n\tBlade is drowning in Frost's blood. His eyes bulge. Oxygen bubbles\n\tstream from his mouth. Frost leans in close, his face a twisted mask\n\tof insanity.\n\n\t\t\t\tFROST\n\t\tI was wrong about you, Blade. You were \n\t\tnever one of us. You're a traitor to \n\t\tyour race. \n\n\t\t\t\tKAREN (O.S.)\n\t\tGet away from him!\n\n\tFrost looks up -- Karen is wielding Blade's sword. She brings it down\n\ton Frost, severing the blood-tendrils which envelope Blade. The\n\tblood-bubble dissolves instantly, flowing away from Blade's face. He\n\tgasps, chokes in air --\n\n\tFrost backs away, horrified. His blood-tendrils don't reform.\n\tInstead, the lay where they fell, solidifying into crystalline\n\tpowder.\n\n\t\t\t\tKAREN\n\t\tBlade!\n\n\tKaren flings the sword at Blade. \n\n\tTHE SWORD \n\n\tspins end over end, its mirrored surface reflecting coruscating\n\tpinwheels of candlelight as Blade catches the weapon by its hilt.\n\n\tBlade rises, advancing on Frost, sword outstretched and Frost\n\tretreats, uncertain now.\n\n\t\t\t\tBLADE\n\t\tGuess you're not quite as invulnerable \n\t\tas you thought.\n\n\t\t\t\tFROST\n\t\tYou're wrong -- a few minutes more, and \n\t\tmy transition will be complete. Even \n\t\tyour sword won't be able to affect me \n\t\tthen.\n\n\t\t\t\tBLADE\n\t\tYou don't have a few minutes, Frost.\n\n\tFrost eyes Blade warily, then lunges towards Vanessa, sweeping behind\n\ther. Blade follows, but even as he raises his sword to strike, Frost\n\tspins Vanessa around, using her body as a shield!\n\n\tBlade hesitates, stopping the sword in mid-strike, catching his\n\tmother's gaze -- her face is monstrous now, scarred by Karen's\n\tpoisonous mace. Piteous, really. \n\n\tFrost smiles, for he's found a final weakness of Blade's to exploit.\n\n\t\t\t\tFROST\n\t\t\t(laughing cruelly)\n\t\tJust as I thought. Still chained to \n\t\tyour mother's breast after all these \n\t\tyears.\n\n\tIn the same instant, Vanessa's features morph, taking on the angelic,\n\tyouthful vibrancy she possessed in the locket photo.\n\n\t\t\t\tFROST\n\t\t\t(gloating)\n\t\tYou're too human, Blade. \n\n\t\t\t\tBLADE\n\t\t\t(steeling himself)\n\t\tIt's because I'm human that I can do \n\t\tthis.\n\n\tFrost's eyes widen in shock, but he has no time to react, for --\n\n\tBlade is already LUNGING forward, driving the sword-point through\n\tVanessa's chest, on into Frost's heart! It strikes the stone behind\n\tthem, SHATTERING and --\n\n\tFrost and Vanessa HOWL AS ONE, their SCREAMS rising to an unendurable\n\tintensity as the two vampires go nova, exploding into an expanding\n\tball of light and ATOMIZING BLOOD.\n\n\tBlade is thrown back off his feet, having to shield his eyes from the\n\tbacklash of occult energy as a near tidal WAVE of blood surges over\n\thim -- \n\n\tEXT. BANK OF EREBUS - CITY STREET - NIGHT\n\n\tEvery door and window of the bank is BLOWN OUTWARD from the force of\n\tthe EXPLOSION. While along the street, manhole covers flip from their\n\tmoorings, spinning up into the air like dimes, being buoyed by\n\tgeysers of blood.\n\n\tINT. TEMPLE SANCTUARY - NIGHT\n\n\tSilence, just the steady DRIP-DRIP of liquid draining. The underworld\n\ttemple gleams with a crimson sheen now. \n\n\tON BLADE \n\n\tas he stirs. He's been blown clear across the sanctuary by the force\n\tof the blast, soaked to the quick by blood. He rises to his feet,\n\tretrieving the hilt of his shattered weapon. At his feet -- \n\n\tTHE SWORDBLADE \n\n\tlies in pieces. Amidst them, we find the singed remains of the locket\n\t-- Vanessa's face barely recognizable beneath the grime. Blade stoops\n\tto pick it up.\n\n\t\t\t\tKAREN (O.S.)\n\t\tBlade?\n\n\tBlade turns. Karen moves to him, searching his eyes. Which side of\n\tBlade's soul has won out? Human or vampire?\n\n\tThen she SEES the tears rimming Blade's eyes, the first he's shed in\n\ta lifetime. Human. \n\n\tThey embrace, holding each other that way for a long, long time. And\n\twe --\n\n\tDISSOLVE TO:\n\n\tEXT. ROOFTOP, BANK OF EREBUS - DAWN\n\n\tBlade and Karen stand on the rooftop, watching as dawn slowly creeps\n\tacross the silent city.\n\n\t\t\t\tKAREN\n\t\tI never imagined I'd be so happy to \n\t\tsee the sun rise --\n\t\t\t(turning to him)\n\t\tIt's over, isn't it?\n\n\t\t\t\tBLADE\n\t\tFor them. But for me --\n\n\tHe lifts his face towards the rising sun, letting its warmth wash\n\tover his upturned face.\n\n\t\t\t\tBLADE\n\t\tI feel like it's finally beginning.\n\n\tAnd on that note we leave them -- TWO FIGURES, silhouetted against\n\tthe new day.\n\n\tFADE TO BLACK.\n\n\tTHE END\n\n\n\n\n\n\n\n\nBlade\nWriters :   David S. Goyer\nGenres :   Action  Horror  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:00.662838"}