{"title": "Bones", "film_link": "/Movie Scripts/Bones Script.html", "script_link": "/scripts/Bones.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Bones Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Bones Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/6-stars.gif\"/> (5.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Adam Simon\" title=\"Scripts by Adam Simon\">Adam Simon</a><br/>  <a href=\"/writer.php?w=Tim Metcalfe\" title=\"Scripts by Tim Metcalfe\">Tim Metcalfe</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/>\n<br/>\n<a href=\"/scripts/Bones.html\">Read \"Bones\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<title>Bones</title>\n<b><!--\n</b>\n<b>/*\n</b>Break-out-of-frames script\nBy Website Abstraction (http://wsabstract.com)\nOver 400+ free scripts here!\nAbove notice MUST stay entact for use\n<b>*/\n</b>\nif (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\n\n\n\n\n<center><a href=\"index.html\">back</a></center>\n\n<pre>\nThis portion of the screenplay is originally pages 14-26.  It is presented \nout of order to reflect the final film.  \n\n<b>\t\t\tEXT. BLACKSTONE AVE. - 2000 - NIGHT\n</b>\n            Dark night.  Most street lights shot out.  Just one or two of\n            the eerie vapor lights left on the block.\n\n            A MIDDLE-AGED AFRICAN-AMERICAN MAN carries his single bag of\n            groceries.  The man listens and watches carefully, as he\n            negotiates the darkness between the few pools of light on the\n            street.\n\n            We won't see his face until he reaches the next pool of\n            light, but he walks with shoulders hunched in fear.\n\n            Moving down the block, all shops abandoned.  Broken windows. \n            Rats.  The man almost trips over a vague shadow passed out\n            and crumpled in an abandoned doorway.  It's the crackhead we\n            saw mumbling himself into the nod-off zone.  He's still\n            faintly singing a part of the bones song as the man passes. \n            He stops in the light.\n\n            And we see it's SHOTGUN: 20 years of fear and loathing etched\n            on his face.  He freezes, listening for a second to the\n            crackheads wheezing mumbles - no - it's something else he's\n            listening for -- and hearing.\n\n            From behind him a low wheezy sound, like some huge panting\n            dog.  He stops.  And it stops.  He walks on and it follows:\n\n            As he hurries to the next pool of light and safety, his ears\n            strain for the nearly silent padding and wheezing steadily\n            following.\n\n            Suddenly, he hears that panting closer and closer until it's\n            nearly right behind him.  He starts running, though he hasn't\n            yet seen anything.  Only heard the mongrel hot on his heels.\n\n<b>            FOLLOW WITH SHOTGUN\n</b>\n            As he stumbles, careens, and wheezes through the streets and\n            alleys, terrified.  Winded, he eventually stops, his hand\n            trembling into his shopping bag, seeking a weapon.\n\n            And we see the building he's paused beside: Bones' place. \n            Pockmarked by age.  Like the face of some furious old man.\n\n            Now he can almost feel the dog's breath on the back of his\n            neck...Shotgun spins, whipping a bottle of milk out of the\n            bag and hurling it into the darkness behind him.\n\n            The bottle smashes against the wall of Bones' building.  For\n            a second, silhouetted against the now whited wall, the tall,\n            too tall, shape of the skinny black dog.\n\n            Without waiting to see what he hit, Shotgun takes off running\n            to reach his building across the street.  The sound of the\n            dog's nails skittering across the street right behind him --\n\n            -- and he just makes it --\n\n<b>            INT. SHOTGUN'S BUILDING - CONTINUOUS\n</b>\n            Inside, safe, panting for breath.  Then starts running up the\n            stairs...\n\n<b>            EXT. SHOTGUN'S BUILDING - CONTINUOUS\n</b>\n            From outside his third floor window, we see Shotgun run into\n            his apartment, slam down his groceries on the counter, grab\n            an old rifle from under his bed and hurry to his open window.\n\n<b>            INT. SHOTGUN'S APARTMENT - CONTINUOUS\n</b>\n            He scan/aims out his window across the street to the now\n            desolate building where Bones once lived.  Finger on the\n            trigger, eyes scanning the shadows for the dog.  Mumbling\n            quotations from the Bible about canines, some of which are\n            handwritten and taped up on his walls and mirrors:\n\n<b>                                SHOTGUN\n</b>                      \"Thou shalt not bring a dog into the\n                      house of the Lord thy God, for they are\n                      an abomination.\"  Deuteronomy.\n\n            Suddenly, something moving on the empty street catches his\n            eye.\n\n<b>            HIS ANGLE ON\n</b>\n            The Black Dog emerging from the shadows in the street.  Our\n            first good look at the beast.  Long clawed paws, all teeth\n            and tongue and a curved bony rib cage like it hasn't eaten in\n            20 years.\n\n            It's long black head seems almost to be throbbing, moving\n            from within, almost subliminally we see a weirder, demonic,\n            more skeletal dog face just beneath the black fur... Or is it\n            just the buzzing light from the vapor lamps?\n\n<b>                                SHOTGUN (CONT'D)\n</b>                          (as he aims his rifle)\n                      \"They return at evening: snarling like\n                      dogs and prowling the city...\" Psalms 59,\n                      vs. 6...\n\n            The dog stands in the pool of light, offering a perfect shot. \n            Shotgun smiles, aims, and then fires, making --\n\n<b>            EXT. BONES BUILDING - CONTINUOUS\n</b>\n            -- a direct hit!  But the dog doesn't move.  Unfazed.  The\n            bullet must have missed.  Or else gone right through him.\n\n            The long-faced dog just looks up at Shotgun like it was\n            laughing at the fool.  And has been for years.\n\n            Shotgun reaches for the spilled groceries on the counter. \n            Shoving aside bread and canned goods and other edible\n            necessitates, and finds a half-dozen boxes of rifle rounds.\n\n            He calmly reloads the rifle.  And the sound of another shot\n            echoes in the night over...\n\n<b>            EXT. AROUND THE CORNER - CONTINUOUS\n</b>\n            Two frat boys, JASON and PALMER, driving a too nice car in a\n            too bad part of town.  Palmer at the wheel while Jason makes\n            a call on the cellular.\n\n<b>                                PALMER\n</b>                      Great.  Gun shots.\n\n<b>                                JASON\n</b>                      Just a backfire.\n\n<b>                                PALMER\n</b>                      Like you'd know.  Face it.  We're lost.\n\n<b>                                JASON\n</b>                      Take a left, no, I mean a right.  Okay,\n                      stop for a second.\n\n            They stop in the middle of a block.  Jason on the phone.\n\n<b>                                JASON (CONT'D)\n</b>                      We're here.  Where the hell are you?\n\n<b>                                STANK\n</b>                          (on phone)\n                      Back here.  At the end of the block.\n\n            He turns around and sees behind them, TWO GUYS standing on\n            the far corner.  One's on the phone.\n\n<b>                                STANK (CONT'D)\n</b>                          (on phone)\n                      You got the cash?\n\n<b>                                JASON\n</b>                      You got the shit?\n\n<b>                                STANK\n</b>                          (on the phone)\n                      Yeah, but you got to come the rest of the\n                      way on foot.  Leave your car and walk\n                      over here.\n\n<b>            EXT. STREET - SAME\n</b>\n            They exit the car, looking all around them with more than a\n            touch of paranoia.\n\n            As they walk nervously down the block, they join the two on\n            the corner.  It's STANK and WEAZE, both 17.\n\n<b>                                JASON\n</b>                      Let me see it.\n\n<b>                                STANK\n</b>                      Let me see it.\n\n<b>                                JASON\n</b>                          (hands him the money)\n                      Where is it?\n\n<b>                                STANK\n</b>                      I can't carry it in my pocket, man.  And\n                      I can't go get it for you cause you might\n                      be a cop.  You gonna have to pick it up\n                      yourself.\n\n            Jason and Palmer aren't sure about this.  By the sphincteral\n            look on his face, Palmer would rather forget about it.\n\n<b>                                STANK (CONT'D)\n</b>                      Don't worry.  It's just round the corner. \n                      Halfway down that block, you can't miss\n                      it.  Top step of the front stairs,\n                      there's a loose stone.  Go on, I ain't\n                      shitting you.\n\n<b>                                JASON\n</b>                      Fuck it.  Alright.\n\n<b>            EXT. BLACKSTONE AVE. - CONTINUOUS\n</b>\n            They walk around the corner and enter a bleak block with at\n            least half the lots burnt out.\n\n<b>                                PALMER\n</b>                      Is it too late for me to officially\n                      register my growing certainty that this\n                      is an extremely bad idea?\n\n            Farther down, in the center of one side of the street, stands\n            a particularly ominous abandoned building.  Bones' building.\n\n            Jason ignites a Zippo, and they see one loose brick.  Jason\n            pulls it out and behind it sees a glint of baggy.\n\n<b>                                JASON\n</b>                      Easy as pie.  And twice as tasty.\n\n            He opens the bag.  It's filled with rock cocaine.\n\n<b>            ANGLE - ACROSS THE STREET\n</b>\n            On the third floor, Shotgun sits in his straight-backed chair\n            in front of the open center window drinking coffee, cradling\n            his rifle on his lap.  Sees the frat boys picking up their\n            shit.  Then he looks out at Bone's 'tomb':\n\n            Dark blank windows staring back at him; the building's front\n            door covered with broken vertical boards with jagged pieces\n            missing, looking almost like a jack-o-lantern's grin.\n\n            Shotgun then looks back down at the boys below.  From behind\n            them they hear their car alarm go off.\n\n<b>                                PALMER\n</b>                      Someone's screwing with the car!\n\n            But from the other way come cops, in a plain wrap car, a hand\n            reaching out and putting the spinning blue light on the roof. \n            No place to run.  No place to hide for the boys.  They reach\n            for the door of the shuttered building -- and it opens!\n\n<b>                                SHOTGUN\n</b>                      Yo.  You two, get the hell away from\n                      there!\n\n            But they ignore him and disappear into the darkness inside\n            the gaping maw of Bones' building.\n\n            Shotgun shakes his head sitting back down, cradling his\n            rifle.\n\n<b>                                SHOTGUN (CONT'D)\n</b>                      Fools.\n\n<b>\tINT. BONES' BUILDING - CONTINUOUS\n</b>\n            Inside, the boys huddle in the darkness behind the door,\n            waiting for the cops to pass.\n\n            The boys look around the decayed Gothic interior lit only by\n            the eerie glow of the sodium vapor lights outside.\n\n            What we last saw as the ornate 70's luxury lobby in Bones'\n            day, is now  a horror show.\n\n            Walls torn and stained.  Mold grows in patches on the wall\n            and ceiling.  Huge cobwebs hang.  The furniture's all broken.\n\n            A gnawing tearing sound makes Palmer spin: a rat sticks its\n            head up through the rotted cushions of the couch.\n\n<b>                                PALMER\n</b>                      Let's get the hell outta here.\n\n            Jason shushes him as the room is filled with the flashing\n            blue light of the cop car trawling slowly down the street.\n\n            From inside they hear the sounds of a car door slamming and\n            cop shoes walking.\n\n<b>                                JASON\n</b>                      Oh fuck, c'mon...\n\n            He gropes his way in the darkness to a staircase.  Palmer is\n            right behind him as they slip upstairs, deeper into the\n            gaping darkness of the abandoned building.\n\n            While below them the door opens and cop lights and cop voices\n            penetrate the gloom.\n\n<b>                                OLDER COP\n</b>                      ...not going in there.  Waste o' time.\n\n<b>                                YOUNGER COP\n</b>                      I saw 'em go in.\n\n            And from the boys' high vantage point up the stairs we see\n            the first cop walk in with flashlight drawn.\n\n<b>            WHILE INSIDE THE COP CAR - CLOSE ANGLE\n</b>\n            All we see are two meaty hands unwrapping a wax-paper covered\n            pork chop sandwich.  The cop, face in shadow, brings the drip\n            ping sandwich up over his huge belly towards his face.\n\n<b>            INSIDE BONES' BUILDING\n</b>\n            The frat boys hold their breath while rats run across their\n            feet.  Jason slamming his hand over Palmer's mouth to keep\n            him from screaming.\n\n<b>            DOWN BELOW\n</b>\n            The young plainsclothes cop steps deeper into the room, and\n            shines his flashlight at the stairwell.\n\n<b>            UPSTAIRS\n</b>\n            Jason pulls the reluctant Palmer further up the stairs, to\n            the third floor as below them they hear the cop coming up.\n\n            Jason pulls Palmer through the nearest door and into:\n\n<b>            INT. JIMMY BONES' OLD PAD - CONTINUOUS\n</b>\n            The rotted remains of what was once Jimmy Bones' master\n            bedroom.  The room he was betrayed and slaughtered in.\n\n<b>            DOWNSTAIRS\n</b>\n            The cop begins to head up the stairs.  Visible behind him,\n            down through the open front door, is the plain wrap car.  The\n            older cop inside, mouth fulla sammich, loudly says:\n\n<b>                                FAT OLDER COP\n</b>                      Forget it!  No way they're in there. \n                      Trust me.  I've been working down here\n                      twenty years.  No one goes in there.\n\n<b>            FROM THE FAT OLDER COP'S POV\n</b>\n            We watch as the younger cop returns to the car, giving up. \n            And when he climbs in, we reverse and reveal who the older\n            cop is: LUPOVICH, the cop who helped kill Bones.\n\n            But he's decayed and expanded into a Hank Quinlan-like\n            mountain of corrupt cop flesh.  Too many pork chop\n            sandwiches.\n\n<b>                                LUPOVICH\n</b>                      Let's get the hell outta here.\n\n<b>            INT. JIMMY'S OLD PAD - SAME\n</b>\n            From upstairs, the boys see the blue light of the cop car\n            recede as the car pulls away down below.\n\n            Palmer reaches for the door.  He wants out.  But in the\n            darkness, he can't find the door.\n\n<b>                                PALMER\n</b>                      Gimme some light.\n\n            Behind Jason we see a shape, a shadow, a tall silhouette, a\n            man-shaped deeper darkness forming within the darkness.\n\n            Jason lights his lighter.  And in the flickering we see\n            behind him that this room now contains a portion of hell:\n\n            It's not just the chipped paint and peeled rotted wall paper,\n            or the cracks and gaps in the broken old ceiling mirror.\n\n            All surfaces seem to be a swirling, shifting pattern in which\n            we can dimly and subliminally make out faces as if people\n            were trapped on the surface of things.  Exactly like the\n            glimpse we had beneath the world when Jimmy died...\n\n            The floor, the walls, the furniture, everything in it -- made\n            out of the wracked and twisted devouring and devoured forms\n            of dead souls.  Their faces, hollow pleading eyes and howling\n            mouths visible like flowing grain in wood.\n\n            And in the center of it all stands the dark silhouette of\n            Bones, impossibly tall and thin, stretching malevolently out\n            across the room like a living shadow.\n\n            But the boys don't see this as they're finding the door.  We\n            see Bones shadow arching towards them while they fumble.\n\n            Palmer finally opens the door to the sound of a deep rumbling\n            growl from the darkness on the other side.  And in the open\n            door stands the black dog.\n\n            They boys jump back.  But breathes easy.\n\n<b>                                PALMER (CONT'D)\n</b>                      Just a dog...\n\n            And the black dog leaps up at them -- teeth flying right for\n            the boys' throats.  And in the flickering ghastly light we\n            see its demon face breaking through.\n\n            The dog sinks his long teeth into Jason's arm.  He flails and\n            drops his lighter, still lit, on the floor.\n\n            As soon as he does, the dog releases Jason, and disappears as\n            fast as it appeared, back into the darkness.\n\n            The two kids panic, Jason shaking and bleeding, looking\n            around, waiting for the dog or something else to attack,\n            seeing back through the doorway into the room from hell.\n\n            Behind them we see that tall man-shaped shadow.  The Bones\n            shadow is oblivious to the two frantic boys, intent only on\n            the small flickering flame of the lighter still burning where\n            it fell against the lower wood paneling of the wall.\n\n            A thin trail of black smoke as the flame barely begins to\n            catch on the chipped lead-filled flammable paint.\n\n<b>            THE BOYS RUN\n</b>\n            And stumble down the hall away from the horror, while back in\n            the room the Bones-shadow watches as the lighter flickers and\n            dies out.  Other than a slightly blackened spot, the wall is\n            unburned.\n\n            The black shadow shudders in rage, arches back and hooooowls\n            in frustration, its mouth abnormally large.  The shadowy head\n            snaps in the direction of the boys -- ready to vent it's\n            wrath, and for a subliminal second we see in the head, the\n            hellish face of Jimmy Bones.\n\n            The boys round the second floor landing and fly down the last\n            flight of stairs. \n            Jason's foot breaks through a rotted floorboard and for a\n            second, it appears as though rotten hands are just below the\n            stairs, grabbing at his foot and leg.\n\n            He yelps in terror, pulling his foot back as they continue\n            towards the front door, the Bones-thing's woofer-busting howl\n            roaring down from the third floor.\n\n<b>            THE SHEER INFINITE ADRENALINE RUSH\n</b>\n            Of pure horror and the desperation to survive drags the boys\n            off the stairs as they tear across the floor and hurl\n            themselves out the front door into the night air... Jason\n            falling and lying on the stoop.\n\n<b>            EXT. BONES' BUILDING - CONTINUOUS\n</b>\n            Across the street, Shotgun sees the boys in the doorway. \n            Then, as a nearly dead vapor light suddenly flickers and\n            comes to life, the shadows created on Bones' building make it\n            look almost like a demonic face.\n\n            Gulping for air, laughing hysterically at their survival, the\n            frat boys pause.  Jason sits back on his butt, checking his\n            wound.  The doorway behind them just a black hole in space.\n\n<b>                                PALMER\n</b>                          (bumping fists together)\n                      Damn, bro.  That was close!\n\n<b>            THEN SUDDENLY\n</b>\n            Something - it happens so fast we're not sure just what grabs\n            sucks-pulls Palmer back into the black doorway hole.\n\n            Jason, still prone, tries to crawl away but whatever got his\n            friend now sucks him in too.  His fingernails scraping along\n            the stoop in frenzied desperation.\n\n<b>            WITH SHOTGUN\n</b>\n            When he hears the boys pitiful screams and whimpers from\n            across the street, he leaps to his feet and tries to see into\n            the dark of the doorway across the street.  But he can only\n            hear what is happening to the unlucky frat fellas:\n\n            Moans and the sound of flesh torn, and swallowed, and their\n            last dying screams.\n\n<b>            UP AND DOWN THE BLOCK\n</b>\n            The screaming reverberates.  Faces appear in some windows. \n            While in others, shades are drawn and the lights go out...\n\n<b>            BACK WITH SHOTGUN\n</b>\n            Mumbling to himself:\n\n<b>                                SHOTGUN\n</b>                      \"For outside are dogs and sorcerers...\"\n                      Revelation 22, vs. 15.\n\n            Tears welling in his eyes that he angrily flicks away.\n\n<b>            LOOKING AT THE BUILDING\n</b>\n            It still has the shadowy look/shape of Jimmy Bones, now\n            shifting again as the vapor light on the street sputters out\n            again, plunging the street into near darkness.  The body of\n            Palmer no longer visible below.\n\n            When he looks back, the building seems just an old building\n            again.  Then there's movement in an upper window, catching\n            his eye.  Shotgun sees the tall, shadowy silhouette.\n\n            The figure is elongated, can't tell if it is a man, or the\n            distorted shadow of a man.  It beckons to Shotgun.\n\n<b>            SHOTGUN\n</b>\n            Just tightens his grip on his rifle and speaks as if the\n            shadowy thing across the street could hear him.\n\n<b>                                SHOTGUN (CONT'D)\n</b>                      You still mad?  Still want me?  Come on\n                      and get me.\n\n<b>            THE SHADOW\n</b>\n            Shakes its head.  As if it can hear him.  And again mutely\n            beckons to him.\n\n<b>            ON SHOTGUN\n</b>\n<b>                                SHOTGUN (CONT'D)\n</b>                      Oh, right.  You can't.  You're trapped\n                      there.  Well ain't that too bad.  Ain't\n                      that just too damn bad.\n<b>\t\t\t\t\t  \n</b> This portion of the screenplay is originally pages 1-2.  It is presented \nout of order to reflect the final film.  \n\n<b>FADE IN:\n</b>\n<b>            EXT. SOUTH SIDE OF TOWN - 1979 - DAY\n</b>\n            In the ghetto.  A thriving street.  Shops and apartments. \n            Storefronts, newsstands.  Life in the hood.\n\n            A sleek black Buick Electra 'deuce and a quarter' floats down\n            the avenue, Curtis Mayfield-style...\n\n<b>            INT. BUICK ELECTRA - DAY\n</b>\n            Behind the fur-covered steering wheel: SHOTGUN, a broke-nosed\n            bodyguard for the man in the back seat:\n\n            JIMMY BONES - 28.  His street.  His world.  Cool, handsome,\n            respected.  Dressed very fly, but not excessive.  Long black\n            coat, black silk shirt, and matching wide-brimmed hat.\n\n            His left hand sports a big diamond ring while his right hand\n            toys with a long silver razor, polished and oiled to\n            perfection so that the long glinting blade can swing back and\n            forth, or lock into position.\n\n<b>            EXT. BLACKSTONE AVE. - DAY\n</b>\n            Bones steps out from the car on to his street like a\n            benevolent feudal lord or a popular Mafia Don.\n\n<b>                                                     QUICK CUTS OF JIMMY:\n</b>\n            -- greeting and soul shaking every man, woman and child on\n            the block: they display a mixture of fear/love and respect.\n\n            -- coolly taking down numbers in a notebook: soothing to the\n            losers, encouraging to the wary, tough with the welchers.\n\n            -- and handing out a rare win to an astonished old man\n            standing in his pajamas in the doorway of an old tenement.:\n\n<b>                                BONES\n</b>                      Don't spend it all in one place.  Spread\n                      it around.  And shop local.\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay is originally pages 13-14.  It is presented \nout of order to reflect the final film.  \n<b>\t\t\t\t\t  \n</b>\t\t\tWe see Pearl standing at the sink, scrubbing the blood stains\n            on her, washing her hands, washing and washing them...\n\n<b>                                                       CREDITS ROLL OVER:\n</b>\n            Her hands, washing becomes time passing.  Years, decades, the\n            building and the surroundings decay... And still the dark,\n            skinny dog prowls the shadows.  Just one more reason we no\n            longer see anyone walk the street at night.\n\n            The 90's end --\n\n            And Bones' building stands worn and naked with burnt-out lots\n            on either side.  And the street feels like a ghost town.\n\n            In the evil colored light of the gaseous street lights,\n            Bones' own shadow stretches and distorts across all three\n            stories.  His shadow face filling a window.  As in and around\n            the building and out in the ruins on either side, the black\n            dog still walks.\n\n<b>            AND FINALLY RETURN TO WEATHERED HANDS STILL WASHING\n</b><b>            THEMSELVES IN HOT WATER --\n</b>\n            To the PRESENT.\n\n            Pull out and reveal Pearl, skin drawn, eyes heavy, now 20\n            years older, washing her hands.  And then drying them.\n\n<b>            CREDITS END\n</b><b>\t\t\t\n</b>This portion of the screenplay is originally pages 26-31.  It is presented \nout of order to reflect the final film.  This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited. \n<b>                                                               CLOSE ON:\n</b>\n<b>            INT. KRUSHED KLUB - NIGHT\n</b>\n            Two raging black screaming skulls engulfed in eye-scorching\n            fluorescent green fire:\n\n            The decals on the front panel of a Gemini Executioner, a hi\n            tech mixer.  Four hands at the controls.  Throbbing, shifting\n            twisted beats.  We're in a Northside dance club:\n\n            Pull out to reveal BILL, 20, and MAURICE, aka Space Cowboy\n            and Intergalactic Gangster of Love, 20.  The two boys DJ-ing. \n            They're accompanied by the crooning voice and dancing body of\n            Bill's step-sister TIA, 29.  Bill's black.  Tia's white.  And\n            Maurice is not of this earth.\n\n            Bill's turntablizing: his hands dance between two competition\n            style direct drive turntables tilted side by side, playing\n            them like an instrument.\n\n            While Maurice plays in and around and out of Bill's rhythm,\n            with his 6 top-loaded computerized CD players, the boys hand\n            the beat back and forth and up and down, building\n            outrageously, till Maurice tips it over the top.\n\n<b>                                MAURICE\n</b>                      Goodness gracious grande bolas del fuego!\n\n            The floor is jammed with underground dance scenesters,\n            college students and spaced-out shoegazers tripping on\n            Ketamine, dancing with their invisible friends.\n\n            The bar's surrounded by a sea of hands waving money,\n            demanding drinks.  Our boys are popular.  And the club is\n            making a lot of green tonight.\n\n            See someone checking out all the money, counting heads:\n            PATRICK, 23, Bill's older brother.  The money man.\n\n<b>            EXT. BACK ON THE SOUTH SIDE - NIGHT\n</b>\n            Stank and Weaze are cruising around in the frat boys BMW,\n            laughing their asses off.\n\n<b>            INT. THE KRUSHED KLUB - PRE-DAWN\n</b>\n            Live show's over.  And a chill mix tape plays while the boys\n            pack their gear.  Across the club, Patrick's arguing with the\n            club owner, MOE.  Just now handing Patrick a couple bills. \n            Patrick's not happy.\n\n<b>            EXT. KRUSHED KLUB - CONTINUOUS\n</b>\n            The guys and Tia stumble out with all their equipment,\n            loading it and themselves into Patrick's over-sized SUV. \n            Patrick right behind them.  They gather around to split their\n            fee.\n\n<b>                                PATRICK\n</b>                      Well, the bad news is we only made 25\n                      bucks each.\n\n<b>                                TIA\n</b>                      How could that be?  The box was packed!\n\n<b>                                PATRICK\n</b>                      Moe's terms.\n\n<b>                                MAURICE\n</b>                      We practically paying him for the\n                      privilege of playing his club.\n\n<b>                                BILL\n</b>                      So what the hell's the good news?\n\n<b>                                PATRICK\n</b>                      I just accelerated my top secret long\n                      term plan for our world domination.\n\n<b>                                MAURICE\n</b>                      Sqweeep.  We innerup this programme to\n                      bring you this special news bulletin --\n                      (human teletype sounds) \"Aliens from\n                      Reticula 3 have hijacked Patrick Peet and\n                      injected moly headcheese into his skull\n                      filling his entire brain cavity with\n                      cosmic slop...\"\n\n<b>                                PATRICK\n</b>                      I was planning on waiting until I got the\n                      place cleaned out, but -- like the man\n                      says, carpe diem.\n\n            Patrick hands Bill and Tia each a flyer:\n\n            The Restaurant Brothers\n\n            Ill Bill and DJ Maurice -- a.k.a. The Space Cowboy\n\n            Playing at Illibent.  Fridays.\n\n<b>                                TIA\n</b>                      Illibent?  Who's club is that?\n\n<b>                                PATRICK\n</b>                      Ours!\n\n<b>                                BILL\n</b>                      What're ya talkin' about, OURS?\n\n            Patrick beckons them into the car.\n\n<b>            EXT. BLACKSTONE - DAY\n</b>\n            Patrick pulls up to the abandoned lot next to Bones'\n            building.  In broad daylight the building looks even\n            stranger.  The lines don't matchup.  Weeds and broken glass,\n            rusted autoparts, and empty abandoned shopping carts in\n            tangled heaps like ruins in the lot beside the building.\n\n<b>                                BILL\n</b>                      Looks like a damn graveyard round here.\n\n<b>                                PATRICK\n</b>                      I'm telling you, this neighborhood is\n                      coming back.\n\n<b>                                MAURICE\n</b>                      Yeah.  But just where the hell has it\n                      been?\n\n            They step up to the front of the building.\n\n<b>                                BILL\n</b>                      Damn.  That is the ugliest building I\n                      have ever seen.\n\n<b>                                PATRICK\n</b>                      Naw.  I think it's... I dunno.  Something\n                      about it just buzzes me.\n\n<b>                                MAURICE\n</b>                      That would be the after effects of that\n                      Reticular inseminoid encounter you had.\n\n            Patrick opens the door and steps inside.\n\n<b>                                PATRICK\n</b>                      Welcome to the Ill Zone.\n\n<b>            INT. THE BUILDING - CONTINUOUS\n</b>\n            The darkness broken only by sunlight streaming through grimy\n            windows reveals the decaying interior of the building.\n\n            We can see now nothing's been moved since the late '70's. \n            Old furniture, carpets, pictures - late '70's Gothic.\n\n<b>                                TIA\n</b>                      Damn it's cold in here!\n\n<b>                                BILL\n</b>                      It's eighty degrees outside.  And it's\n                      gotta be barely fifty in here.\n\n<b>                                MAURICE\n</b>                      And damp, too.  Let's not forget damp.\n\n<b>                                PATRICK\n</b>                      Whattaya think?  Can you picture it? \n                      Over there the bar, and in here -- the\n                      dance floor.\n\n<b>                                BILL\n</b>                      Possible...maybe...could be.\n\n            Patrick leads them to the stairwell going up and down around\n            the old elevator cage/shaft.\n\n<b>                                PATRICK\n</b>                      I got a great deal on it.  They couldn't\n                      give this place away.  Just dead meat\n                      stanking up their books for twenty years.\n\n            They come to the elevator shaft, no elevator in sight.\n\n<b>                                PATRICK (CONT'D)\n</b>                      The last owner on the lease before the\n                      bank was back in '79.  Some dude named\n                      Jimmy Bones.  Empty ever since.\n\n            Maurice looks down the elevator shaft and gets immediately\n            dizzy, almost plunging to his doom - pulled back by Bill.\n\n<b>                                MAURICE\n</b>                      Jimmy Bones?\n\n<b>                                PATRICK\n</b>                      Yeah, you heard of him?\n\n<b>                                MAURICE\n</b>                      You haven't?\n\n<b>                                PATRICK\n</b>                      Not that I remember.\n\n<b>                                MAURICE\n</b>                      He was a local legend back in the '70's. \n                      There was a song, Stagolee kinda deal:\n                      \"This is the ballad of Jimmy Bones/Black\n                      as night and hard as stone...\"\n\n<b>                                PATRICK\n</b>                      I was born near here.  My dad's from\n                      here.  He never mentioned it.\n\n<b>                                BILL\n</b>                      Bones!  How baddass is zat?  This is the\n                      place for us.  Patrick, you get platinum\n                      props, man.  Platinum.\n\n<b>                                MAURICE\n</b>                      Yeah, in the land of the blind the one\n                      eye'd are king.\n\n<b>                                BILL\n</b>                      What's your problem with Crippled Dick?\n\n<b>                                MAURICE\n</b>                      Look around, this place is a dump!  Naw,\n                      it'd have to work to be a dump.\n\n<b>                                PATRICK\n</b>                      You gotta use your imagination.\n\n<b>                                MAURICE\n</b>                      \"This is Patrick...\" \n                          (makes the sound of egg\n                           cracking, the sizzling as it\n                           lands in the skillet)\n                      \"...And this is Patrick on crack.\" \n                      Imagination, my butt.  Even the space\n                      cowboy can't...\n\n<b>                                PATRICK\n</b>                          (interrupting)\n                      Why don't y'all check out the rest?  I'm\n                      going downstairs and see if I can get the\n                      furnace fired up.  Warm this place up,\n                      you'll see.  It has serious potential.\n\n<b>                                MAURICE\n</b>                      Potential toxic dump site.\n<b>\t\t\t\t\t  \n</b><b>           INT. STAIRS - CONTINUOUS\n</b>\n            Mia, Bill and Maurice all climb the stairs as Maurice lights\n            a joint with a little box of stick matches.\n\n<b>                                BILL\n</b>                      Are you nuts?\n\n<b>                                MAURICE\n</b>                      The man said just to use my imagination.  \n                          (takes a huge hit)\n                      Let's see...yeah, I get it.  Potential. \n                      I can see it now.  The first major urban\n                      theme park.  Village Ghetto land. \n                      Kinda like Legoland, but made entirely\n                      from broken glass, hypodermic needles and\n                      crack vials.  Totally E-ticket.\n\n<b>                                BILL\n</b>                      Keep smokin', fool.\n\n            Tia checks out the second floor while Bill and Maurice\n            continue up the stairs to the third floor.  Bones' old crib.\n\n<b>            WITH BILL AND MAURICE\n</b>\n            Behind them, barely subliminal glimpse - a manshaped darker\n            shadow within a shadow.  Bill feels a cold wind from nowhere. \n            And hears a whispery sound seemingly carried in the breeze.\n\n<b>                                HOLLOW ECHOES\n</b>                      It ain't eh money.  It's the big fat\n                      floating what if...\n\n<b>                                BILL\n</b>                      What did you say?\n\n<b>                                MAURICE\n</b>                      I didn't say nothing.\n\n<b>                                HOLLOW ECHOES\n</b>                      Take him down to the storm clear.  Bury\n                      him.\n\n<b>                                BILL\n</b>                      You didn't hear that?  \"Take him... \"\n                      Something.  \"Bury him\" or...\n\n<b>                                MAURICE\n</b>                      Take who where?  What you smokin'?\n\n<b>            BELOW ON THE SECOND FLOOR\n</b>\n            Tia's checking out a bedroom.  Hears a light tinkling in a\n            closet.  She opens it: empty except a row of rusty metal\n            hangers, holding the moldy remains of Bones old suits.\n\n<b>            DOWNSTAIRS IN THE BASEMENT - PATRICK\n</b>\n            Is there a flashlight, poking around.  Trying to find the\n            metal knob to turn on the gas.  Eerie as hell down there.\n\n            Out of the corner of our eyes we see a shadow moving,\n            looming.  A scurrying sound and Patrick turns his flashlight\n            in the other direction: we glimpse a bloated rat.\n\n            Behind him, the shadow we glimpsed grows, elongates.  Patrick\n            notes another door.  This one padlocked.  Sensing someone or\n            something behind him, Patrick turns with the flashlight.\n\n            Nothing there.  But the Bones-shadow is behind him again. \n            Again he feels something and again he turns the flashlight\n            around: nothing.\n\n            Except the Bones-shadow is again...behind him.\n\n            Shaking it off, Patrick heads for the old heater, pulling out\n            matches to light the pilot as Bones-shadow stays behind him.\n\n<b>            BONES POV\n</b>\n            Bones watches as Patrick reaches around the gas heater.  When\n            Patrick strikes a match head, the Bones-shadow moves even\n            closer to him as Patrick reaches in and lights the pilot.\n\n            When Patrick steps back, Bones-shadow grows and stretches,\n            spreading like an ink stain, reaching across to where the\n            pilot flame flickers.\n\n            In profile, the shadow-mouth blows...but no breath comes out. \n            The flame doesn't even flicker.\n\n            Bones tilts his head back and lets loose an eerie bellow of\n            frustration in a subliminal flash we see a howling mouth,\n            bigger than any human mouth, howling within the shadow-face.\n\n            The sound echoes all through the basement rooms as Patrick\n            walks back upstairs.  He slaps a nearby plumbing pipe.\n\n<b>                                PATRICK\n</b>                      Go on old pipes, groan all you like. \n                      Just please don't burst.  That I can't\n                      afford.\n\n<b>            FOLLOW WITH BONES POV\n</b>\n            As disappointed in whatever he hoped blowing out the furnace\n            pilot would do, he steps into the rusted remains of the old\n            elevator and the POV begins to levitate.\n\n<b>            INT. ELEVATOR - CONTINUOUS\n</b>\n            Bones' POV rises straight up as if still in a working\n            elevator.  It rises and we follow up from the basement to the\n            empty first floor, past the second floor to:\n\n<b>            THE THIRD FLOOR\n</b>\n            Where we're still inside, floating in the elevator cage. \n            Then the POV moves through the metal bars and floats towards\n            Bill, who's approaching the door of the room where Jimmy\n            died.\n\n            As Bill reaches to open it, Bones' POV floats closer - and\n            closer - right up on Bill's back now.  Bill feeling the hairs\n            on his neck suddenly rising.  Then he hears:\n\n<b>                                HOLLOW ECHOES\n</b>                      Go on.  It won't kill you.\n\n            Bill turns around to check with Maurice.\n\n<b>                                BILL\n</b>                      You had to hear tha...\n\n            But Maurice is gone.  And he doesn't see the shadow there\n            behind him.  Bill leans in to the door, listening...\n\n<b>                                HOLLOW ECHOES\n</b>                      I ain't gonna be the only one with this\n                      nigger's blood on my hands...\n\n<b>                                BILL\n</b>                      What the f--?\n\n            A hand jolts him from behind.  He spins -- it's just Maurice.\n\n<b>                                MAURICE\n</b>                      'S up?\n\n<b>                                BILL\n</b>                      Nothing.  Contact paranoia.  Must be\n                      buggin' from hanging with you.\n\n            They turn to walk back down.  Maurice stops to re-light his\n            joint when the Bones-shadow reaches out to grab his wrist.\n\n            But it's no good.  The shadow hand passes right through,\n            Maurice pauses for an instant as if he felt something.\n\n            Maurice lights his roach, and the match burns closer and\n            closer to his fingertips.  Then singes them and he drops the\n            match.  Maurice then heads downstairs after Bill.\n\n            The shadow remains behind, staring at the still burning match\n            on the wooden floor.  He bends down, staring intently as if\n            willing it to burn, his hands urging it on, the flame\n            suddenly rising.  But then the match sputters harmlessly out. \n            The shadow turns back towards the boys downstairs.\n\n<b>            WHILE ON THE SECOND FLOOR\n</b>\n            Tia explores the rest of the floor.  Hears a sound, like a\n            whimpering, from behind another door.\n\n            She slowly eases open the door then jumps back -- Inside, the\n            dog.  It growls low and mean, the black fur on the back of\n            it's neck rising.  It's eyes burning too red and bright.\n\n            Tia freezes.\n\n            The dog growls deeply at her.  And as he does we see the\n            Bones shadow rising behind her.  It seems to lean in and over\n            her, and the dog stops growling.\n\n            Tia cautiously holds her hand outstretched with the burger\n            for the dog to smell.\n\n            Bones' shadow from lingers behind her, perhaps simply\n            enjoying the first sight in hellish eons of a beautiful girl.\n\n<b>                                TIA\n</b>                      How'd you get locked in here?  And for\n                      how long?  Poor baby...\n\n            The dog leaps up - but not to rip her throat out.  Instead it\n            snatches the burger and wolfs it down in one gulp.\n\n<b>                                TIA (CONT'D)\n</b>                      Poor boy.  You must be starving.\n\n<b>            INT. FIRST FLOOR - CONTINUOUS\n</b>\n            Bill looks skeptical, Maurice outraged.  Patrick firm.\n\n<b>                                BILL\n</b>                      You want us to move in here?\n\n<b>                                PATRICK\n</b>                      That's the only way we'll get the place\n                      fixed up in time.\n\n<b>                                MAURICE\n</b>                      Yeah right, and which ever of us is still\n                      alive at the end of the week inherits all\n                      Vincent Price's cash.\n\n<b>                                PATRICK\n</b>                      Look, you guys want to play college\n                      radio, high school reunions, and some\n                      fool's club once a week for the rest of\n                      your lives, that's cool.  But I think we\n                      can do better.\n\n<b>                                BILL\n</b>                      You soundin' like the old man now.\n\n<b>                                PATRICK\n</b>                      I believe in you guys.  You are the real\n                      shit.  And you know it.  Now I'm putting\n                      everything I got into this cuz I think we\n                      can make it happen, but you gotta put a\n                      little in too.  Now all I\"m asking is\n                      that everybody do their part.  We'll move\n                      some shit in, and take shifts, or all\n                      crash together here --\n\n<b>                                BILL\n</b>                      Pat's right.  It'll be fun.\n\n<b>                                MAURICE\n</b>                      Yeah, fine.  But Mars Needs Women.  If I\n                      gotta sleep in a spookhouse, surround me\n                      with chicks who are more scared than me. \n                      Speaking of which...\n\n            Tia's coming down the stairs.  Maurice watching her legs\n            appreciatively as she descends.\n\n<b>                                BILL\n</b>                          (rips Maurice's skull)\n                      Tia ain't a chick.  She's family.  And\n                      don't forget it.\n\n<b>                                PATRICK\n</b>                      Let's get going.  Go home, pick up what\n                      we need, then crash here.\n\n<b>                                TIA\n</b>                      Look who I found.\n\n            She comes in with the dog padding silently behind her.\n\n<b>                                MAURICE\n</b>                      Damn, that's the nastiest dog I ever\n                      seen.  Nothin' but skin and bones.\n\n<b>                                TIA\n</b>                      Yeah, call his skinny ass \"Bones.\"\n\n            \"Bones\" grins, all teeth with its tongue hanging out.  They\n            walk out the front door, the dog slipping out with them.\n<b>\t\t\t\n</b><b>            EXT. BLACKSTONE - ACROSS THE STREET - CONTINUOUS\n</b>\n            Shotgun watches from the window as the group exits the\n            building with the dog.  Seeing the cur he instinctively\n            reaches for his gun.  But the dog's surrounded by kids.\n\n<b>                                SHOTGUN\n</b>                      Hey, watcha doing with that dog?\n\n<b>                                BILL\n</b>                      He yours, sir?\n\n<b>                                SHOTGUN\n</b>                      Hell no!\n\n<b>                                BILL\n</b>                      Then what do you care?\n\n<b>                                SHOTGUN\n</b>                      Take my advice.  And shoot that dog.  Or\n                      let me.\n\n<b>                                BILL\n</b>                      Alright.  Yes sir.  Anything you say.\n\n            Tia, Bill and Bones the dog pile into the van as Pearl and\n            her daughter CINNABAR, 21, walk by.\n\n            The daughter's as fine now as her mother was then.  Pearl\n            sees the dog in the van and her head snaps to the gang.\n\n<b>                                PEARL\n</b>                      Don't feed that dog.\n\n<b>                                BILL\n</b>                      You people really don't like dogs.\n\n<b>                                PEARL\n</b>                      Some holes can't be filled.  Some hungers\n                      can't be satisfied.\n\n<b>                                MAURICE\n</b>                          (way under his breath)\n                      And some people need their medication\n                      tweaked.\n\n<b>                                PEARL\n</b>                      I'm not joking boy.  Don't feed it. \n                      It'll only make it hungrier.\n\n            Pearl walks a little faster, trying to draw Cinnabar away\n            from the kids and the dog. \n            But Cinnabar lingers a few paces behind her mother and\n            catches Patrick's eye.  He's stunned, and before he can\n            speak, Maurice speaks for him.\n\n<b>                                MAURICE\n</b>                      Need any help with those bags, Ma'am?\n\n<b>                                PEARL\n</b>                      No thanks.\n\n<b>                                PATRICK\n</b>                      no really, let us help.  We're new in the\n                      neighborhood, gonna be neighbors.\n\n<b>                                CINNABAR\n</b>                      You moved into this block?\n\n<b>                                MAURICE\n</b>                      Not really to live, just to play.\n\n<b>                                PEARL\n</b>                      That building?\n\n<b>                                MAURICE\n</b>                      Gonna be le hot shit.  \n                          (to Pearl)\n                      Pardon my Francais.  Dance club.  The\n                      Resurrection Brothers play there.  Heard\n                      of them?\n\n<b>                                PEARL\n</b>                      Should I?\n\n<b>                                CINNABAR\n</b>                      Are they on the radio?\n\n<b>                                PATRICK\n</b>                      Naw.  But they will be.  They're the\n                      best.\n\n<b>                                CINNABAR\n</b>                      How do you know?\n\n<b>                                PATRICK\n</b>                      I manage them.\n\n<b>                                PEARL\n</b>                      And you bought the building?\n\n            Pearl studies their faces, especially Patrick's.\n\n<b>                                PEARL (CONT'D)\n</b>                      You look mighty familiar to me.  You sure\n                      you're not from around here?\n\n<b>                                PATRICK\n</b>                      I was born near here.  But after my\n                      mother died, my dad moved.  I grew up out\n                      in Rossmore Park.\n\n<b>                                PEARL\n</b>                      You're pretty black to be growing up in\n                      Rossmore Park.\n\n<b>\tEXT. PEARL'S STOREFRONT - DAY\n</b>\n            They stop in front of a storefront - same old palm reading\n            sign.  But the name is different.  Now it's \"SISTER PEARL -\n            READER AND ADVISOR.\"  Pearl enters the building while a\n            lingering Cinnabar catches a look on Patrick's face.\n\n<b>                                CINNABAR\n</b>                      Guess it's not Rossmore Park.  Thanks for\n                      the help.\n\n<b>                                PATRICK\n</b>                      Anytime.  Be seeing you.\n\n            Patrick is still checking her out.  And we can see from a\n            window, Pearl is still checking him out.  While Maurice is\n            checking out the wacky window design.\n\n<b>                                MAURICE\n</b>                      Yeah, well if she got psychic powers, how\n                      come she's working here on Desolation\n                      Row?\n<b>\t\t\t\t\t  \n</b><b>\t\t\tEXT. BLACK CAT POOL CLUB - DAY\n</b>\n            A run-down storefront, fronted by a crude faux-Parisian Black\n            Cat Facade.  A \"private club\", the local boss' HQ.\n\n<b>            INT. BLACK CAT CLUB - CONTINUOUS\n</b>\n            Inside, the lights are dim and clouds of cigarettes and cigar\n            smoke float over worn out old pool tables.\n\n            Most of the tables are empty.  An older man wearing\n            sunglasses lines up a careful shot on a corner table.  It's\n            Eddie Mack.  20 years after doing Bones, he rules the hood. \n            What's left of it, anyway.\n\n            Before he can shoot, Stank and Weaze breeze in, Stank holding\n            some car keys up in his hand.\n\n<b>                                STANK\n</b>                      Say Eddie.\n\n            Distracted, Eddie hits the eightball and scratches.  He snaps\n            the pool cue over his knee.\n\n<b>                                MACK\n</b>                      Goddamnit!  How many times I told you --\n\n<b>                                STANK\n</b>                      We got a gift for you, Eddie.  Fresh new\n<b>                      BMW.\n</b>\n<b>                                MACK\n</b>                      That you stole off those white boys was\n                      down here last night?  Are you crazy? \n                      Everybody from hell to breakfast heard\n                      that screamin' on Blackstone last night!\n\n<b>                                STANK\n</b>                      But --\n\n<b>                                MACK\n</b>                      How many times I told you, no psycho\n                      shit.  There gonna be psycho shit, I'm\n                      the one that does it.\n\n<b>                                WEAZE\n</b>                      We didn't do nothing, Eddie.\n\n<b>                                MACK\n</b>                      You gon tell me you didn't ginsu those\n                      punks and steal their ride?\n\n<b>                                WEAZE\n</b>                      That's all we did, steal their ride.\n\n<b>                                MACK\n</b>                      Get that car the hell away from here,\n                      now!  I spend a lot of money to keep the\n                      cops cool.  But this is the kinda shit\n                      that pisses everybody off.\n\n<b>                                STANK\n</b>                      We just thought...\n\n<b>                                MACK\n</b>                      No more thoughts from your asses.  Or I\n                      will burn your asses and snort the ashes. \n                      Hear me?\n\n<b>            EXT. ROSSMORE PARK - EVENING\n</b>\n            The guarded entrance to the gated community.  Bill and the\n            others roll up to the gate in their van.\n\n            Barney Fife pokes his head in the window and stares at 'em\n            suspiciously.  They all \"smile\" back.\n\n<b>                                GUARD\n</b>                      Okay, go on ahead.\n\n<b>                                BILL\n</b>                      I been living here my whole life, and\n                      that hillbilly still has to check me out\n                      each time.\n\n<b>                                MAURICE\n</b>                      Hey, it's his job.  Keeping indesirables\n                      outta the hood.\n\n<b>            EXT. THE PEET HOUSE - CONTINUOUS\n</b>\n            They pull into the huge multi-car driveway in front of their\n            house.  Not quite a mansion, but damn close.\n\n<b>            INT. KITCHEN - CONTINUOUS\n</b>\n            The kids are all sitting around the kitchen, watching Tia fix\n            some meaty concoction to feed the dog.  The dog stares at her\n            expectantly.  Jaws dripping in anticipation.\n\n            An older, distinguished looking black man walks in.\n\n<b>                                PATRICK\n</b>                      Hey, Dad.\n\n            And we see their father is... Jeremiah.  Though now a\n            prosperous banker, twenty years ago he was the man who set\n            Bones up.  He enters with NANCY, his white second wife, Tia's\n            mother.\n\n<b>                                JEREMIAH\n</b>                      Not only do I have to feed the three\n                      mouths I got, and that bottomless pit\n                      they call Maurice, I gotta feed this\n                      stray, too?\n\n            At the sound of Jeremiah's voice, the dog looks up right at\n            him and unleashes a low, rumbling growl.\n\n<b>                                TIA\n</b>                      Shhh, Bones.  It's not nice to bite the\n                      hand that feeds you.\n\n<b>                                JEREMIAH\n</b>                      What did you call that dog?\n\n<b>                                NANCY\n</b>                          (moving on)\n                      Just what are you feeding him?  I didn't\n                      know we had dog food.\n\n<b>                                TIA\n</b>                      We don't.  I used that meat you had in\n                      the bowl.\n\n<b>                                NANCY\n</b>                      Tia, that was the prime rib I was\n                      marinating for dinner.\n\n            They look at the dog eating enough beef to feed six people.\n<b>\t\n</b>This portion of the screenplay is originally pages 1-4.  It is presented \nout of order to reflect the final film.  \t\t\n<b>\t\t\t\n</b><b>\t\t\tEXT. FURTHER DOWN THE BLOCK - TIME CUT\n</b>\n            Bones is back in the car.  Shotgun rolling on down the street\n            and round the corner.\n\n            Bones sees a young black man leaning into the window of a\n            police car.  It's JEREMIAH PEET, Bones' right-hand man,\n            trying to do business.  And make sure his three year old son\n            keeps from running into the street.  The cop in the car\n            eating a sloppy sauce-drippin' pork chop sandwich, watches.\n\n<b>                                BONES\n</b>                      Hold up S-G.  Give him a toot.\n\n            Jeremiah speaking low and rapid to the cop who says nothing,\n            just wipes his greasy lips on a handkerchief.\n\n            Then Shotgun hits the car horn, which plays a James Brown\n            style trumpet riff.  Jeremiah steps over to Jimmy's car. \n            Jeremiah's son cautiously following.\n\n<b>                                JEREMIAH\n</b>                      'Sup Jimmy B. Shotgun.\n                          (to his son)\n                      Get back on the curb!  Now!\n\n<b>                                BONES\n</b>                      Go easy on Jay Bird.  I can remember when\n                      we was his age...\n\n            The boy makes eye contact with Bones, who motions he's got a\n            dollar for him.  The boy nervously takes it from Bones and\n            then runs back to the curb under his father's harsh eye.\n\n<b>                                JEREMIAH\n</b>                      It's all arranged for tonight.  Eddie\n                      Mack's gonna be there.  And Offisa\n                      Korruptsky, too.\n\n<b>                                BONES\n</b>                      They get about twelve and a half minutes. \n                      Tops.\n\n<b>                                JEREMIAH\n</b>                      Trust me, Jimmy, there's big money behind\n                      this.  Not just big.  BIG.  Like big\n                      business big.  Big corporation big.  Big\n                      government big.  Our little acre alone'll\n                      net hundreds a thousands.  Nothing but\n                      net.\n\n<b>                                BONES\n</b>                      Nothing but net?  Could be a swish.  Or a\n                      muthafucking air ball.\n\n<b>                                JEREMIAH\n</b>                      One simple word, three little letters. \n                      Yes.  That's all it's gonna take and we\n                      could move out of this dump, get the real\n                      deal.  Big houses, legit business...\n\n<b>                                BONES\n</b>                      That's your dream, Homes.  Not mine.  I\n                      don't want to leave this street.  Ever. \n                      The status quo is totally cool with me.\n\n<b>                                PEARL\n</b>                      Maybe I oughtta get there a little early. \n                      For good luck.\n\n<b>                                BONES\n</b>                      Don't need luck tonight.  I'm just\n                      letting 'em have their say before I say\n                      no.\n\n<b>                                PEARL\n</b>                          (worried)\n                      Let me see your hand.\n\n<b>                                BONES\n</b>                      All that shinin' and \"reader and adviser\"\n                      mess.  That was your mama's bag.  I don't\n                      know about the readin' but you both can\n                      sure 'nuff advise.\n\n<b>                                PEARL\n</b>                          (swats his hand)\n                      My mama's bag and my granma's bag, and a\n                      long line of mamas before her.\n\n<b>                                BONES\n</b>                      Sounds like mama needs a brand new bag.\n\n            She takes his hand in hers.\n\n<b>                                PEARL\n</b>                      Such fine hands.  You shoulda been a\n                      musician.  You got the fingers.\n\n            She strokes his hands.\n\n<b>                                PEARL (CONT'D)\n</b>                      Left hand's the past.  Your right's the\n                      present.  And the future.  But it's not\n                      written in stone.  It's written in flesh\n                      and blood.  And flesh and blood will\n                      change.  See?  There's something here, a\n                      new line, right across your life line.\n\n<b>                                BONES\n</b>                      Must be my clothes line.  No?  How bout\n                      my phone line?\n\n<b>                                PEARL\n</b>                      No baby.  I'm serious.  Cancel that\n                      meeting.  I got more fruit that needs\n                      checking.  Come home with me now.\n\n<b>                                BONES\n</b>                      Don't you worry about a thing.  This\n                      hand's gonna be stroking the back of your\n                      neck tonight.\n\n            The car pulls away, the little boy waves good-bye...\n\n<b>                                JEREMIAH\n</b>                          (under his breath)\n                      'Cause you got all the status.  And I got\n                      nothing but quo...\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay is originally pages 48-49.  It is presented \nout of order to reflect the final film. \n\n<b>            EXT. BLACK CAT POOL CLUB - NIGHT\n</b>\n            A cop car pulls up.  Out the passenger side come two skinny\n            legs, followed by a bowling ball gut.  Lupovich...\n\n<b>                                LUPOVICH\n</b>                          (to the cop in the car)\n                      Wait here.  And don't touch my fucking\n                      sandwich.\n\n<b>            INT. BLACK CAT POOL CLUB - CONTINUOUS\n</b>\n            Lupovich makes his entrance and bellies across the club\n            towards Mack.\n\n<b>                                LUPOVICH\n</b>                      Not your style.  Is it Eddie?  Killing\n                      off your customers?\n\n<b>                                MACK\n</b>                      I ain't killed nobody.\n                          (gives a menacing glance to\n                           Stank and Weaze)\n                      Shall I rack 'em?  Play a game, Lupe?\n\n<b>                                LUPOVICH\n</b>                      No time for eightball.  I got your tip.\n\n            He tosses a bag of crack rocks on the pool table.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      Confiscated their whole stash.\n\n            Mack hands him a wad of cash.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      Fair enough for the shit.  But I think a\n                      little bonus is due for knocking out the\n                      competition.\n\n<b>                                MACK\n</b>                      You was just doing your job.\n\n<b>                                LUPOVICH\n</b>                      Last thing you need's for me to start\n                      doing my fucking job.\n\n            Mack hands him another wad of Bills.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      That's more like it.  Cost of doing\n                      business.  Maybe you can deduct it on\n                      your taxes.\n<b>\t\t\t\t\t  \n</b><b>\t\t\tINT. JEREMIAH'S HOUSE - NIGHT\n</b>\n            Patrick talking to the others, Jeremiah asleep by now.\n\n<b>                                PATRICK\n</b>                      When we got a line of hundred paying\n                      guests and another couple hundred inside\n                      dancing, that's when I'll tell him.  And\n                      I can't wait to see the look on his face.\n<b>\t\t\t\t\t  \n</b><b>\t\t\tINT. THE PEET DINING ROOM - LATER\n</b>\n            Around the table, Chinese food containers.  Tia's still\n            sneaking meat to the dog under the table.  The TV on in the\n            corner.\n\n            Jeremiah's topping off his dinner with XANTAC -- high blood\n            pressure medicine.  His normal dyspeptic mood not improved by\n            the conversation the kids are having.\n\n<b>                                PATRICK\n</b>                      And how do you think crack got into the\n                      ghetto?  By magic?  Who flew it in?  Like\n                      the man said \"we don't own that many\n                      planes.\"\n\n            Jeremiah increasingly uncomfortable with the subject matter.\n\n<b>                                JEREMIAH\n</b>                      Don't poison your mind with that ghetto\n                      paranoia.  That's all just ways of people\n                      justifying their own failure.\n\n<b>                                BILL\n</b>                      Dad, the man has been lying to us for a\n                      hundred years.  I mean, where is my forty\n                      acres and a mule?\n\n<b>                                JEREMIAH\n</b>                      You wouldn't know a mule if it bit you in\n                      the ass. \n                      And personally, I don't need a mule.  I\n                      got a Lexus.  And nobody gave it to me --\n\n<b>                                TV ANCHOR\n</b>                          (on TV)\n                      There's a lead tonight in the strange\n                      disappearance of those two State College\n                      fraternity brothers.  There car, a 1999\n                      BMW, was found abandoned this afternoon\n                      in an inner-city neighborhood.\n\n<b>            ON TV\n</b>\n            We see flashes on the news of various streets of the hood,\n            including a shot of Bones block and building.\n<b>\t\t\t\n</b>This portion of the screenplay is originally pages 61-64.  It is presented \nout of order to reflect the final film.  \t\t\t\n<b>\t\t\n</b><b>            INT. SOUTH SIDE SAVINGS AND LOAN - DAY\n</b>\n            Jeremiah swears a painted smile on his face as he shakes the\n            just entered Lupovich's hand.  They seem, for all the world,\n            like old friends as he leads him back to his office.\n\n<b>            INT. JEREMIAH'S OFFICE - CONTINUOUS\n</b>\n            But the minute they are in his office, Jeremiah's friendly\n            demeanor drops like a mask.\n\n<b>                                JEREMIAH\n</b>                      What the hell do you want?\n\n<b>                                LUPOVICH\n</b>                      Just a visit with my old pal, Jay-bird.\n\n<b>                                JEREMIAH\n</b>                      Don't call me that.\n\n            Lupovich looks around the expansive office and paws the\n            photos and knicknacks on Jeremiah's desk.\n\n<b>                                LUPOVICH\n</b>                      You certainly traded up.\n                          (picks up a wedding picture\n                           nearby)\n                      ...the trophy wife.  Nice lookin'.\n\n<b>                                JEREMIAH\n</b>                      Keep your hands to yourself, willya?\n\n<b>                                LUPOVICH\n</b>                      I been watching you.  You done good. \n                      Invested wisely.  Respectable businessman\n                      now.  Just like you always wanted.\n\n<b>                                JEREMIAH\n</b>                      And you?  Still a pig.  Just a much\n                      fatter one.\n\n<b>                                LUPOVICH\n</b>                      No reason to get nasty.  Yeah, I've\n                      stayed in the organization.  But then\n                      again I never got the percentage you did.\n\n<b>                                JEREMIAH\n</b>                      Or you didn't know what to do with it.\n\n<b>                                LUPOVICH\n</b>                      Maybe so.  Maybe so.  But that ain't why\n                      I came to see you.  You sold the\n                      building.\n\n<b>                                JEREMIAH\n</b>                      What building?\n\n<b>                                LUPOVICH\n</b>                      Don't shit a shitter.  Our building. \n                      What did you call it?  His 'tomb'?  We\n                      had an agreement.  You were supposed to\n                      sit on it.  Not sell it --\n\n<b>                                JEREMIAH\n</b>                      I didn't sell it.\n\n<b>                                LUPOVICH\n</b>                      Well, somebody bought it.  That's what I\n                      heard.\n\n            Jeremiah buzzes.\n\n<b>                                JEREMIAH\n</b>                      Claire?  Could you come in here.\n\n            An assistant manager, CLAIRE, enters.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      Did we sell any properties on...\n                      Blackstone recently?\n\n<b>                                CLA\n</b>                      Matter of fact, we did.  5606.\n\n<b>                                JEREMIAH\n</b>                      To who?\n\n<b>                                CLA\n</b>                      I only met with the broker.  The\n                      structure was listed almost worthless and\n                      had never even had a bid, I thought you'd\n                      be pleased to see it sold to someone who\n                      wants to improve the neighborhood. \n                      Anything wrong?\n\n<b>                                JEREMIAH\n</b>                      No, of course not.  Good work.  Thanks a\n                      lot.\n\n            She leaves.  Lupovich is still holding the picture of\n            Jeremiah's wife.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      You're right.  One of my associates sold\n                      the building last month.\n\n<b>                                LUPOVICH\n</b>                      That's a Bozo no-no.  Jay-bird.\n\n<b>                                JEREMIAH\n</b>                      Look, even if anyone found anything\n                      there, it's twenty years ago.  They could\n                      never connect it to us.\n\n<b>                                LUPOVICH\n</b>                      You better hope not.  Cause it's like\n                      they say, four can keep a secret, if\n                      three are dead.\n\n            He puts down the photo with a wink.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      Nice rack.  How old is --\n\n<b>                                JEREMIAH\n</b>                      That's it.  Get out.  Now!\n\n            Jeremiah advancing on Lupovich, who chuckles and walks out.\n\n\n<b>                                BILL\n</b>                      Hey, that's...\n\n            He's stopped by a kick under the table from Patrick.\n\n<b>                                JEREMIAH\n</b>                      That's what?\n\n<b>                                BILL\n</b>                      That's some terrible shit.\n\n<b>                                JEREMIAH\n</b>                      Clean your mouth, or I will.  Those boys\n                      had no business messing down there.  Go\n                      places you're not meant to be -- that's\n                      what you get.\n\n<b>                                BILL\n</b>                      But that's your old hood, Pops.\n\n<b>                                JEREMIAH\n</b>                      Yeah, and it took some doing to get out\n                      of there.  Just be glad I did and you can\n                      start life from here instead of down\n                      there.\n\n<b>                                PATRICK\n</b>                      But maybe we're the ones who should be\n                      down there.  Doing something.  Making it\n                      better.\n\n<b>                                JEREMIAH\n</b>                      Can't be done.  That place already died\n                      and gone to hell.\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay is originally pages 52-54.  It is presented \nout of order to reflect the final film.  \t\n<b>\t\t\t\t\t  \n</b><b>\t\t\tSERIES OF ANGLES - A MONTAGE\n</b>\n            Quick cuts of the moon, the sun, Bones neighborhood, Patrick\n            and the gang cleaning up the building.  And finally, at\n            dusk...\n\n<b>            EXT. BONES' BUILDING - MORNING\n</b>\n            Patrick's on a ladder replacing glass in the upper windows. \n            From down the block, we see Cinnabar heading out of her\n            mother's house, holding her portfolio.  The corners of papers\n            sticking out, splashes of color visible.\n\n            Patrick sees Cinnabar about to walk beneath his ladder.\n\n<b>                                PATRICK\n</b>                      Careful.  That's bad luck.\n\n<b>                                CINNABAR\n</b>                      That place is already bad luck.\n\n<b>                                PATRICK\n</b>                      Why?\n\n<b>                                CINNABAR\n</b>                      No.  It goes way back.  Or so my Momma\n                      says.\n\n<b>                                PATRICK\n</b>                      What else does she say?\n\n<b>                                CINNABAR\n</b>                      Nothing.  You'd think she was crazy.  And\n                      she is a lot of things, not all of them\n                      nice, but crazy Momma's not.\n\n<b>                                PATRICK\n</b>                      Way I figure, everything our parents tell\n                      us is part true and part total B.S.  And\n                      our whole job is figuring out for\n                      ourselves which is which.\n\n<b>                                CINNABAR\n</b>                      My momma says every house is two houses. \n                      Every street, two streets.  There's a\n                      whole city, a whole world, kinda beside,\n                      on top, just below this one.  The city of\n                      the dead.\n\n<b>                                PATRICK\n</b>                      Like right now, there's actually like\n                      hordes of dead people shambling around\n                      us?  Fingers rotting off?\n\n<b>                                CINNABAR\n</b>                      Maybe.  But there's an invisible wall, a\n                      fabric that kinda keeps things separate.\n\n<b>                                PATRICK\n</b>                      Lucky thing.\n\n<b>                                CINNABAR\n</b>                      Yeah.  But when something bad happens,\n                      something really bad -- the wall breaks. \n                      The fabric tears.\n\n<b>                                PATRICK\n</b>                      The dead get out?\n\n<b>                                CINNABAR\n</b>                      Or the living fall in.  Who knows.\n\n<b>                                PATRICK\n</b>                      And you believe her?\n\n<b>                                CINNABAR\n</b>                      If I did, I wouldn't come within fifty\n                      yards of your door.\n\n            She sees her bus pulling up at the corner and runs for it,\n            leaving only her smile with Patrick.\n\n            She passes Maurice and Bill, pulling up.  Bill has to pull\n            Maurice's dog like attention away from the way Cinnabar's\n            bottom moves as she walks down the street to focus at the\n            matter at hand: unloading their shitload of equipment.\n\nThis portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited. \n\n<b>            EXT. BLACKSTONE - LATER\n</b>\n            Maurice and Bill carrying speakers and racks and lights and\n            turntables while Shotgun, in his lawn chair across the\n            street, glares at them.\n\n            After the last equipment is loaded, they lock the car. \n            Shotgun still watching.  Bill pulls out a six pack of beer. \n            He offers one to Shotgun who, after a beat, accepts it.\n\n            Maurice surreptitiously turns on his small hi-7 camera. \n            Holding it under his arm, but it's on.\n\n<b>                                MAURICE\n</b>                      You ever hear of Jimmy Bones, sir?\n\n<b>                                SHOTGUN\n</b>                      What business is it of yours?\n\n<b>                                MAURICE\n</b>                      Just wondered.  We heard he used to live\n                      in our building.\n\n            Shotgun says nothing.\n\n<b>                                BILL\n</b>                      Is it true?\n\n<b>                                SHOTGUN\n</b>                      Yeah.  He lived there.  And died there,\n                      too.\n\n<b>                                BILL\n</b>                      Died there?  How?\n\n<b>                                SHOTGUN\n</b>                      How the hell should I know?\n\n<b>                                MAURICE\n</b>                      What was he like?\n\n<b>                                SHOTGUN\n</b>                      Bones?  He was something.  He could be\n                      cold as ice or warm as blood.  But he\n                      never turned his back for a brother.\n\n            His eyes drift up to the building.\n\n<b>                                SHOTGUN (CONT'D)\n</b>                      Always there.\n\n            Maurice goes in.  Bill lingers behind.\n\n<b>                                SHOTGUN (CONT'D)\n</b>                      Hey, kid.\n\n<b>                                BILL\n</b>                      Yeah?\n\n<b>                                SHOTGUN\n</b>                      Take my advice.  Get the hell out of\n                      there.  It's a bad place.  Always has\n                      been.\n\n<b>            EXT. BLACKSTONE AVE. - DAY\n</b>\n            Bill and Maurice walk around interviewing folks about Bones. \n            Bill with the DAT recorder, Maurice with the vidcam.\n\n            We see this through Maurice's shaky video camera:\n\n            grainy VIDEO SHOTS:\n\n            An OLD WOMAN.\n\n<b>                                OLD WOMAN\n</b>                      ...and every Tuesday, he'd roll by in his\n                      car and drive me with all my laundry to\n                      the laundromat so I wouldn't have to\n                      carry the clothes.\n\n            -- a dude in a wheel chair.  Drinking outta paperbagged\n            bottle with a wino hanging on the corner.\n\n<b>                                WHEELCHAIR MAN\n</b>                      Jimmy Bones?  Yeah, I knew that\n                      motherfucker.  People make out like he\n                      was some kinda damn Robin Hood. \n                      Bullshit.  I saw him cut some muhfucker's\n                      tongue once with that razor of\n                      his...dropped it right into that jar of\n                      dill pickles they used to have on the\n                      counter in the bar.\n\n<b>                                WINO\n</b>                      When I was a kid he used to slip twenties\n                      into my pocket so I could buy toys and\n                      shit.\n                          (now to Maurice/at camera)\n                      Bones was awrright.  He was solid.  And\n                      then one day, he just wasn't around no\n                      more.  Don't pay to ask too many\n                      questions 'round here.\n\n<b>            INT. THE BUILDING - THAT NIGHT\n</b>\n            Upstairs, inside what was once Bones' bedroom.  Beneath the\n            cracked ceiling mirror, Bill lies on the airmattress.  He's\n            listening with headphones to a minidisk player.\n\n            Eyes closed, head nodding to the beat.  Around him, we see\n            something strange.  The room shifts.\n\n            It's the same room.  But changed.  It looks like it did when\n            the frat boys were trapped in here.  Or in the instant after\n            Jimmy's death: all surfaces seem to be a swirling, shifting\n            pattern in which we can dimly make out faces, as if people\n            were trapped on the surface of things.\n\n            Then the faces and bodies begin to step out of their surfaces\n            and into the room.  \n\n            So as Bill, eyes still closed, rocks to the hypnotic beats in\n            his headphones, we see the room around him begin to fill with\n            figures.\n\n            -- all twisted dead human forms emerging out of the surfaces\n            of floor and walls.  We hear a low murmur of ghost voices,\n            different languages.\n\n            And as the track ends, the sound cuts through Bill's\n            headphones and his eyes snap open.\n\n            But the room is empty.  And completely normal.  Bill pulls\n            off his head phones.  Ears strain to listen.\n\n<b>                                BILL\n</b>                      Tia?  Patrick?  That you?\n\n            The sounds return, fainter, and form above.  Bill looks up,\n            and for a fraction of a second in the mirror, Bill sees the\n            crowded eerie hell of the other version of the room.\n\n            Bill jolts out of bed and to the door, whips it open, and\n            someone dark looms right there.  But it's just Patrick.\n\n<b>                                BILL (CONT'D)\n</b>                      Shit.\n\n<b>                                PATRICK\n</b>                      Spooked?\n\n            Bill looks back into the room, normal now.  Glances up at the\n            mirror, just a cracked reflection of the empty room.\n\n<b>                                BILL\n</b>                      No.  Well, yeah.  Maybe just a little.\n\n<b>                                PATRICK\n</b>                      Yeah, there is a strange vibe here.\n\n            He stops.  Both brothers look at each other, waiting for the\n            other to admit he's seen or felt something's here.\n\n<b>                                BILL\n</b>                      Where's the others?\n\n<b>                                PATRICK\n</b>                      Maurice left.  Tia's taking a bath.\n<b>\t\t\t\t\t  \n</b><b>\t\t\tINT. BATHROOM - CONTINUOUS\n</b>\n            The bathroom is entirely wood lined, like some '70's hot tub\n            paradise.  The room dominated by a large two person tub.\n\n            Tia lights four small scented candles on the counter.  The\n            wind through the open window blows the curtains.  She shuts\n            the window and then steps gingerly into the steaming bathtub.\n\n            She lies down in the bath, with her back to the door.  The\n            four candles throwing varying shadows of her.\n\n            Then one of the shadows becomes...the shadow of Bones.  All\n            it's attention is focused on one lit candle.  The one closest\n            to the curtain.\n\n            Slowly the Bones' shadow's fingers start to caress the\n            curtain to make it move, ever so slowly, closer and closer to\n            the candle.  The drapery reaches out, straining, straining\n            towards the candle flame.\n\n            Tia soaks with her eyes closed, enjoying the moist heat.\n\n            Bones' shadow fingers more and more urgently drawing the\n            flame towards the curtain, the curtain towards the flame. \n            And soon the corner of the drape just reaches the little\n            flickering flame.  And in an instant the drape is on fire.\n\n<b>            INT. HALLWAY - CONTINUOUS\n</b>\n            Patrick and Bill still talking in front of the bedroom, down\n            the hall from the bathroom.\n\n<b>                                PATRICK\n</b>                      ...we just been in the damn suburbs too\n                      long.\n\n            Their conversation interrupted by screams from down the\n            hall... from the bathroom!\n\n<b>            INT. BATHROOM - CONTINUOUS\n</b>\n            The drapes are fully ablaze now, flames lick at the wooden\n            walls.  Tia leaps out of the tub, screaming, trying to throw\n            bathwater at the burning drapes.\n\n            Patrick and Bill crash through the door.  Patrick rips the\n            drapes from the wall and throws them into the bathtub.\n\n<b>            INT. LIVING ROOM - LATER\n</b>\n            Tia shivers in her bathrobe.  Bill and Patrick with her.\n\n<b>                                TIA\n</b>                      There wasn't any draft.  That window was\n                      closed.\n\n<b>                                PATRICK\n</b>                      We're all tired.  Everybody makes\n                      mistakes.  Tomorrow in the daylight,\n                      everything's gonna look different.\n\n<b>            INT. BUILDING - DAY\n</b>\n            Ladders, drop-cloths and the beginnings of new paint on the\n            old torn walls.  They're all eating take out burgers.\n\n<b>                                PATRICK\n</b>                      I thought you were bringing the Colonel?\n\n<b>                                MAURICE\n</b>                      The Gangster of Love don't eat no fried\n                      chicken.\n\n<b>                                PATRICK\n</b>                      Why not?  He eats everything else.\n\n<b>                                MAURICE\n</b>                      Just what army do you think the Colonel\n                      was in?\n                          (whistles Dixie)\n                      Everybody knows the whole chicken\n                      distribution network is owned by the\n                      Klan.  \"Special recipe\".  I'm telling\n                      you.  There's something in the batter. \n                      Say it makes a black man sterile.\n\n<b>                                BILL AND TIA\n</b>                      Bull.  Shit.\n\n<b>                                MAURICE\n</b>                      Word.  I saw it on Sixty Minutes.\n\n<b>                                PATRICK\n</b>                      Maurice, even if it was true, what are\n                      you worried about?  Last time I checked,\n                      you weren't black.  I'm not sure what the\n                      hell you are.  But I know you aren't a\n                      black man.\n\n<b>                                MAURICE\n</b>                      I am the future.  I am all colors.  All\n                      races.  All creeds.  I am the melting\n                      pot.  I am the tossed salad.  I am post\n                      racial.\n\n<b>                                PATRICK\n</b>                      Post-toasted's more like it.\n<b> \n</b>This portion of the screenplay is originally pages 44-46.  It is presented \nout of order to reflect the final film.  \t  \n\n<b>\t\t\tEXT. SOUTH SIDE - CONTINUOUS\n</b>\n            Outside, angle on Bones' building down the block.\n\n<b>            CLOSER\n</b>\n            To the building - we can hear sounds coming from inside the\n            house.  Like dim drums, some kind of rhythm.\n\n<b>            INT. SUBURBAN KITCHEN - CONTINUOUS\n</b>\n            Where the dog eats and eats...\n\n<b>            EXT. BONES' BUILDING - CONTINUOUS\n</b>\n            Even CLOSER.  The sound is a little louder, a little more\n            disturbing.\n\n<b>            INT. KITCHEN - CONTINUOUS\n</b>\n            Where the dog eats and eats.\n\n<b>            EXT. BONES' BUILDING - CONTINUOUS\n</b>\n            Standing now right in front of it we hear a rhythmic\n            cacophony from inside, growing louder as the dog eats and we:\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            The sound is deafening.  It's the sound of every door in the\n            empty house swinging maniacally on its hinges.  Beating the\n            air like wings.  Opening and slamming shut again and again.\n\n            Every door except ONE DOOR.  The padlocked door to the sub\n            basement.\n\n<b>            EXT. PEARL'S STOREFRONT - CONTINUOUS\n</b>\n            Some older folks, one very old man with a cane, two old black\n            women, arms linked.  A middle-aged husband and wife.  All\n            enter.\n\n<b>            INT. PEARL'S PARLOR - CONTINUOUS\n</b>\n            Dim light.  Cloth covered table.  Everything set for a\n            seance.\n\n<b>                                PEARL\n</b>                      Welcome, brother.  Welcome, sisters. \n                      Make yourselves comfortable around the\n                      circle.  We'll begin in a minute.\n\n            She walks upstairs to Cinnabar's room.\n\n<b>            INT. CINNABAR'S ROOM - CONTINUOUS\n</b>\n            She enters the room where Cinnabar is drawing a still-life\n            assignment by a window overlooking the fire-escape.\n\n<b>                                PEARL\n</b>                      Aren't you going to join us?\n\n<b>                                CINNABAR\n</b>                      I have to finish this for class.\n\n<b>                                PEARL\n</b>                      You got a vision, girl.  Just like I got. \n                      Just like my momma had.  And the good\n                      Lord didn't give you that vision just for\n                      painting pretty pictures.  That's just\n                      wasted time.\n\n<b>                                CINNABAR\n</b>                      You mean as opposed to your life?\n\n            She regrets it halfway out her mouth.  And a thousand-fold\n            more when she sees the look on her mother's face.\n\n<b>                                CINNABAR (CONT'D)\n</b>                      I'm sorry, Momma.  Maybe next time.\n\n<b>                                PEARL\n</b>                      I don't want you meeting around that\n                      house.  You stay away from those kids. \n                      And away from that dog.\n\n<b>                                CINNABAR\n</b>                      They seemed alright.  Bring a little life\n                      to that old building.\n\n<b>                                PEARL\n</b>                      Nothing but a wide world o' pain locked\n                      in there.\n\n<b>                                CINNABAR\n</b>                      Have you ever been inside?\n\n<b>                                PEARL\n</b>                      Maybe once upon a time.  But that was\n                      long ago.  Back before... before it\n                      became what it is.\n\n<b>                                CINNABAR\n</b>                      And what's that?\n\n<b>                                PEARL\n</b>                      Just a bad place.  And the doorway to\n                      worse.\n\n            Cinnabar, as far too often, not understanding much of what\n            her mother says to her.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited. \n<b>\t\t\t\n</b><b>\t\t\tINT. PEARL'S STOREFRONT - NIGHT\n</b>\n            Pearl reaches into an old bureau drawer and pulls out an old\n            photo: Jimmy Bones with his arm around her.  She sits down at\n            her table with a drink and just looks at the picture of\n            herself and her lover when the world was innocent and young. \n            She downs her glass and wipes her tears away.\n\n<b>            OUTSIDE - DOWN THE BLOCK\n</b>\n            In the upper window of the Bones Building we see his\n            silhouette, staring down the block towards Pearl.\n\n<b>            INT. JEREMIAH'S KITCHEN - CONTINUOUS\n</b>\n            Bones the dog slinks into the kitchen.  Sniffing the air. \n            Still hungry.  Always hungry.\n\n            His big black paw actually opens the refrigerator.  With his\n            long nose he digs into the meat drawer.  Inside he finds\n            plastic wrapped raw hamburger meat.\n\n            He pulls it out and drops it on the floor.  Tears it open and\n            gorges himself on the raw meat.\n\n<b>            EXT. BONES' BUILDING - CONTINUOUS\n</b>\n            The house looms malevolently in the moonlight.\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            Bones' POV again in his rusted elevator cage.  The POV floats\n            down through the house into the basement.\n\n<b>            BASEMENT\n</b>\n            Bones' POV looks at the padlocked door.  Then passes right\n            through it.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            In the deeper darkness of the dirt cellar we see the Bones\n            shadow hovering over a slight mound in the dirt.\n\n<b>            INT. JEREMIAH'S KITCHEN - CONTINUOUS\n</b>\n            The black dog wolfs down the last of the hamburger meat.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            And as he does, the ground seems almost to breathe, or glow. \n            Bones plunges his long shadow-hands right into the earth as\n            if he could touch what was beneath and raise it up.\n\n            He remains like that, shadow hands buried in the dirt, head\n            tilting back and howling.\n\n<b>            EXT. OUT ON THE STREET - CONTINUOUS\n</b>\n            Shotgun up in his window, still, holding his gun.  Hears the\n            howling.  He looks around, expecting to see his nemesis, the\n            black dog.  But only darkness.\n\n<b>            EXT. JEREMIAH'S GATED COMMUNITY - NIGHT\n</b>\n            Jeremiah's mansion stands in the moonlight.  Its faux\n            Gerogian splendor in stark contrast to Bones' building in the\n            old neighborhood.\n\n<b>            INT. PEET HOUSE - CONTINUOUS\n</b>\n            The house is dark and quiet.  All are asleep.  The dog moves\n            silently through the house sniffing at doors.\n\n<b>            INT. MASTER BEDROOM - CONTINUOUS\n</b>\n            The dog silently noses the door open and stealthily enters\n            and pads softly over to Jeremiah's side of the bed.\n\n            Where it stares intently at the sleeping Jeremiah, who begins\n            to toss and turn.  He settles again on his back.  His head\n            tilted back, his soft, vulnerable throat exposed.\n\n            The dog steps closer to the bed.  We can almost feel the\n            dog's hot fetid breath inches away from his throat.\n\n            The dog stares at Jeremiah.  And for just a second the long\n            doggy face wavers and changes: in shifting shades of black, a\n            ragged red demonic face ripples beneath the black fur -- and\n            looks for an instant as if it were about to lunge and rip out\n            Jeremiah's throat!\n\n            But at the last second it freezes.  Head cocks and ear lifts\n            as if hearing something in the wind.  Its master's voice,\n            perhaps.  And then the dog reverts to normal and pads out of\n            the room as silently as it entered.\n<b>\t\t\t\n</b>This portion of the screenplay is originally pages 60-62.  It is presented \nout of order to reflect the final film.  This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited. \n\n<b>\tEXT. BONES' BUILDING - CONTINUOUS\n</b>\n            Cinnabar stops outside the building.  She's about to knock\n            when she instinctively freezes.  We can almost see the hairs\n            standing up on her neck one by one.\n\n            She looks around -- what is it?  A sound, like a moan.  Is it\n            her name?  Or just the wind.\n\n            Suddenly, with a creak, the door swings open.\n\n            She takes a hesitant step into the building.  Suddenly she\n            jumps, as a door to her left flies open.\n\n            It's just Patrick.  She laughs in relief.\n\n<b>                                CINNABAR\n</b>                      Just thought I'd see if you needed any\n                      help.\n\n            Patrick too surprised and tongue-tied to respond, so Tia\n            helps him out.\n\n<b>                                TIA\n</b>                      Good.  We do need help.  First you can\n                      help us eat lunch.\n\n            Cinnabar follows Patrick into the room, with a last tense\n            look over her shoulder -- still the feeling something's\n            there.\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            Tia's feeding the insatiable dog.  Handing quarter-pounders\n            to it, the thing scarfing 'em as fast as she can unwrap them. \n            Then, for a second, it stops.  And looks up.  And just stares\n            at something it knows is there -- but we humans can't see.\n\n<b>                                TIA\n</b>                      Watcha looking at, poochie?\n\n            Cinnabar follows the dog's glance.  She sees nothing...or is\n            there something for a second there in the corner?\n\n<b>            REVERSE - BONES-VISION POV\n</b>\n            Is staring back at her, and at the dog.  Cinnabar pulls her\n            sweater around her shoulders.\n\n<b>                                CINNABAR\n</b>                      I hate it when dogs do that.  Like\n                      they're looking right out of the world.\n\n            The dog continues scarfing down burgers, having him his way. \n            Cinnabar looks warily at the beast.  Who stares right back at\n            her while wolfing down the burgers.\n\n<b>            BONES-VISION/POV\n</b>\n            Steps through the rusted metal into the old elevator shaft\n            and we follow it as it floats down.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            As the dog above eats we again see Bones' shadow form looming\n            over the seeing dirt, the dirt moving ever so subtly, and for\n            a subliminal second the dirt seems to be glowing.\n\n<b>            INT. THE BUILDING - LATER\n</b>\n            They're all painting.  Maurice spins some tunes to accompany\n            them.  It's a funky Tom Sawyer paint party.  The kids defer\n            to Cinnabar, who's got a wild pallette, and a wild brush. \n            The place is coming alive with color.\n<b>\t\t\t\n</b>This portion of the screenplay is originally pages 65-72.  It is presented \nout of order to reflect the final film.  This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited. \t\n\n<b>            INT. BONES' BUILDING - LATER THAT DAY\n</b>\n            In Bones' old room, Patrick rolls over the faded stained old\n            shag carpet with a huge carpet cleaner.\n\n<b>            ANGLE ON\n</b>\n            The transparent tubes of the cleaner fill with disgusting red\n            fluid and carpet fibers.\n\n<b>                                                            TIME CUT TO:\n</b>\n            Patrick stands back and surveys his work.  The carpet looks\n            perfect.  Old, a little faded, but clean.  No stains. \n\n            With a smile of satisfaction he rolls the cleaner out of the\n            room and closes the door behind him.  We remain in the room.\n\n<b>            ANGLE ON\n</b>\n            The now clean carpet.  Suddenly we see glutinous red liquid\n            seeping back up through the shag, until the stain is right\n            where it was.  Wet and fresh.  Then we see it spread and\n            move, in the shape of a body and the path by which it was\n            dragged out of the room.\n\n            The door opens again, and Patrick steps in to show off the\n            freshly painted room clean rug to Cinnabar and the others. \n            He's brought up short by the sight of the stain.\n\n<b>                                PATRICK\n</b>                      Must be something seeping through.  From\n                      the floor.\n\n            They roll the carpet back, thinking there must be something\n            on the floor.  The floor beneath the carpet is wet too, but\n            can't tell if it's from the rug or vice-versa.\n\n            He puts his hand down on the wood.  A low rhythmic rumbling.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Do you feel that?\n\n            The others place their hands on the floor.\n\n<b>                                TIA\n</b>                      Yeah.  It's.  Throbbing.\n\n<b>                                BILL\n</b>                      Like a heartbeat.\n\n<b>                                MAURICE\n</b>                      \"Like a heartbeat/Like a love beat.\" \n                      Listen to the Di Franco twins there. \n                      Just the plumbing or something, fool.\n\n<b>                                PATRICK\n</b>                      Maybe there's a pipe underneath the\n                      floor.  It leaked and stained.\n\n            They just look at him.\n\n<b>                                PATRICK (CONT'D)\n</b>                      You got a better explanation\n\n<b>            INT. BASEMENT - LATER\n</b>\n            Patrick and the others in the basement listening to some very\n            strange sounds: groans, thumps, throbs.\n\n<b>                                MAURICE\n</b>                      Sounds like we got the Invisible Scratch\n                      Piklz hiding in our pipes.\n\n            Patrick traces the piping with the wrench, he comes to a\n            triple corner, where three small pipes all come together.\n\n<b>                                PATRICK\n</b>                      I think these bring the water down from\n                      the bathroom.  Into this...\n\n            A larger pipe that goes down the wall and disappears beneath\n            the floor.  The thumping sounds emanate from here.  He puts\n            his finger along the seam of the joint.  He pulls it away,\n            red.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Check it out.  The same shit that was in\n                      the carpet.  Told you it was from the\n                      plumbing.\n\n            He lifts the wrench to tighten the seal.  The metal groans. \n            Then snaps.  Sending a thick spray of foul smelling red\n            sludge shooting out of the seam, right into Patrick's face.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Damn, I knew these pipes were wacked.\n\n            He turns the wrench the other way, re-tightening.  The sound\n            seems to move now through the piping.  Then the red sludge\n            sprays out of the next three joints, smearing the others.\n\n            The pounding, throbbing sounds begin to bounce around the\n            room, as if something were actually moving through the pipes\n            until it returns to the central large pipe and moves down,\n            disappearing beneath their feet.\n\n            Then a rasping bark calls their attention.  Bones the dog\n            sits by the padlocked door, panting.  Grinning.\n\n            Patrick smashes the old lock with the large wrench and opens\n            the door to reveal another set of stairs leading down into a\n            deeper storm cellar where the sound disappeared.\n\n<b>            INT. STORM CELLAR STAIRS - CONTINUOUS\n</b>\n            As they go, the temperature drops.  A cold, damp sheen\n            appears on their skin.  Then comes a thick glutinous buzzing\n            sound.\n\n<b>                                TIA\n</b>                      What is that?\n\n            Flies.  The stairway walls are thick with furry black flies.\n\n<b>                                MAURICE\n</b>                          (stopping)\n                      Ugh.  Muchos moscos, man.  This is too\n                      much.\n\n<b>                                BILL\n</b>                      Just some flies.\n\n<b>                                MAURICE\n</b>                      Some flies?  I think this qualifies as\n                      way more than \"some.\"\n\n<b>                                CINNABAR\n</b>                      What a smell. \n\n<b>                                MAURICE\n</b>                      Hey, what you expect?  Where there's\n                      smoke there's fire.  And where there's\n                      flies, there's shit.\n\n            The stairs end in a dark, damp dirt cellar and the remnants\n            of the terminus of the old elevator shaft.\n\n<b>                                MAURICE (CONT'D)\n</b>                      Oh yeah, I guess this would be that space\n                      that was so perfect for a recording\n                      studio.\n\n<b>                                BILL\n</b>                      Maurice, man, shut the fuck up.\n\n<b>                                PATRICK\n</b>                      Yeah, well, Maurice is right.  It's gonna\n                      take more work than I thought.  But we\n                      can still do it.  We'll lay a real floor\n                      in here.  Put damping on the walls. \n                      Totally controlled sound.  Be perfect. \n                      No one could hear shit up on the street.\n\n            Behind them the dog is digging in the dirt.  Furiously.\n\n<b>                                MAURICE\n</b>                      Yeah, perfect.  Really excellent.  We can\n                      make our first record where no one can\n                      hear us scream.  Be afraid.\n\n            They're not paying any attention to the dog's incessant\n            digging.  Only Cinnabar is.  She's staring at it.\n\n<b>                                CINNABAR\n</b>                      Oh god...\n\n            And she sees, in the deepening muddy hole at the dog's paws,\n            at first glimpses and then the full view, a rotted human\n            corpse.  Really just a skeleton.  With something sticking out\n            of its chest.  Cinnabar shrieks, while the guys try very hard\n            to act real cool.\n\n<b>                                BILL\n</b>                      Hello.  Who're you?\n\n            Maurice bends and pulls out the now blood rusted razor.\n\n<b>                                MAURICE\n</b>                      Boys and girls, Moms and Dads.  Children\n                      of all ages, I'd like you to meet...\n                      Jimmy Bones.\n\n<b>                                BILL\n</b>                      What the hell you talking about?\n\n<b>                                MAURICE\n</b>                          (singing)\n                      \"This is the story of Jimmy Bones/Black\n                      as night and hard as stones/Gold plated\n                      deuce, like the King of Siam/Got his\n                      switchblade loose, and a diamond on his\n                      hand...\" There's the switchblade and\n                      there's the diamond.  Don't know where\n                      the deuce is parked.\n\n            He points to one of the bony hands.  The left one.  On the\n            third finger is Jimmy's big diamond ring.\n\n<b>                                BILL\n</b>                      You think that's really him?\n\n<b>                                MAURICE\n</b>                      Damn.  It's so...fresh.\n\n            And he's right.  Oddly for an old skeleton, there are strands\n            and bands of wet, raw flesh.  Maurice lifts the hand wearing\n            the ring.  He starts top pull it loose from the finger.\n\n<b>                                TIA\n</b>                      Boy, put that thing down.  You can't take\n                      that.  Might be evidence.\n\n<b>                                PATRICK\n</b>                      Evidence of what?\n\n<b>                                TIA\n</b>                      Somehow I don't think he stabbed himself\n                      in the chest, then buried himself too.\n\n            Cinnabar sees something.  Bright color beneath the body. \n            Bends down to a piece of cloth poking out from beneath the\n            bones.\n\n            The dog growls viciously as she reaches down to the scrap of\n            color poking up.  Tia restrains the hound the best she can.\n\n<b>                                PATRICK\n</b>                      Get your damn dog, girl!\n\n            The cloth is the corner of a dress...the dog suddenly lunges\n            for Cinnabar's hands, ripping at them.  She pulls back.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Shit!  Damn dog.  We gonna have to do\n                      something about you.\n\n<b>                                TIA\n</b>                      What we have to do is call the police.\n\n<b>                                MAURICE\n</b>                      Right.  Call the police.  We'll have no\n                      problem getting our permits then.\n\n<b>                                TIA\n</b>                      We can't just leave it here.\n\n<b>                                PATRICK\n</b>                      Yeah, we can.  Least till after this\n                      weekend.  He ain't going nowhere.  We'll\n                      deal with it then.\n\n<b>                                BILL\n</b>                      Whatever, let's just get the hellout of\n                      here.\n\n            They all start to leave except Maurice and Cinnabar.  He's\n            loitering by the body, eyeing the ring.  She's staring into\n            the dark corner of the sub-basement.\n\n<b>            HER POV IN THE DIM LIGHT\n</b>\n            She sees something wavering, a shadow-mirage, Bones.\n\n<b>                                PATRICK (O.S.)\n</b>                      Cinn?\n\n<b>                                CINNABAR\n</b>                      What?  Oh yeah.  Coming.\n\n            She follows the others upstairs.  Bones watches her form as\n            she climbs the steps, and --\n\n            -- for a second from BONES POV we see her mother, when she\n            was young.\n\n            Bones looks now at Maurice.  Who checks to see if the others\n            are gone.  Then Maurice hurriedly bends down, and while\n            holding his face back away from the stench attempts to pull\n            Bones' ring off his finger.  But it's stuck.\n\n            He tugs again, harder, and rips the corpse's finger off.\n\n<b>                                MAURICE\n</b>                      Oh fuck.\n\n            Oh fuck is right.  Bones' shadow rears as it sees this\n            desecration.  Maurice slips the ring off the finger stump.\n\n<b>                                MAURICE (CONT'D)\n</b>                          (to the corpse)\n                      Sorry, but you wont' be needing this.\n\n            He places the finger back by the hand.  And pockets the ring.\n\n<b>                                MAURICE (CONT'D)\n</b>                      Or this.\n<b>\t\t\t\t\t  \n</b><b>            INT. BUILDING KITCHEN - LATER THAT NIGHT\n</b>\n            Tia fills a bowl with dry dog food.  But Bones the dog turns\n            his head away and just whimpers.\n\n<b>                                TIA\n</b>                      Picky mutt.\n\n            She pulls out a package of raw hamburger, dumps it into the\n            bowl, then leaves.  Behind her, the dog tucks into his chow.\n\n<b>            INT. THE STORM CELLAR GRAVE - CONTINUOUS\n</b>\n            The lock broken, the door stands ajar.  And as the dog gorges\n            upstairs, something very strange is happening down here.\n\n            Flesh is growing on the bones.  Bit by bit, red, wet strips\n            of muscle and flesh appear and spread over the corpse.\n\n            The shadow looks down at his semi-reconstituted corpse.  It\n            almost looks like him, minus the skin.  But it still has a\n            long ways to go.  Still, mere strips of muscle and flesh on\n            the skeleton.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            EXT. PEARL'S STOREFRONT - NIGHT\n</b>\n            Her usual small crowd arrives for her seance, all hoping this\n            will be the night they reach their loved ones' spirits.  From\n            outside, through the window, we see Pearl greet and seat each\n            of them around the table.  She starts lighting candles.\n\n<b>            INT. BONES' PAD - NIGHT\n</b>\n            Patrick and Cinnabar sipping a little Remy in his room. \n            Alone at last.  Awkward.  Intimate.  He refills her glass.\n\n<b>                                CINNABAR\n</b>                      She doesn't want me here.  With you.  In\n                      this house.\n\n<b>                                PATRICK\n</b>                      Believe me, my old man'd rupture his\n                      spleen if he knew we was down here.  All\n                      he talks about is the medal he deserves\n                      for building us a life as far from this\n                      'hood as possible.\n\n<b>                                CINNABAR\n</b>                      He probably thinks he's saving you from\n                      something.  I'm sure that's what my\n                      mother thinks.\n\n<b>                                PATRICK\n</b>                      I'm sure I can make your mother like me. \n                      But then do I gotta worry 'bout your\n                      father?\n\n            Suddenly their banter is dead.  Her face looks stung, like\n            he'd slapped her.\n\n<b>                                CINNABAR\n</b>                      I don't know anything about my father.  I\n                      never met him.  Momma won't talk about\n                      him, either.\n\n            He puts his arms around her, and she melts into him.\n\n<b>            INT. PEARL'S STOREFRONT - NIGHT\n</b>\n            Pearl and the others seated in the dim room around a circular\n            table.  They are holding hands.  Only candle light.\n\n<b>                                PEARL\n</b>                      We should begin with a hymn.\n\n<b>            INT. BONES' BUILDING - NIGHT - UPSTAIRS\n</b>\n            In Bones' old room, the temperature between Cinn and Patrick\n            goes from PG to R.\n\n            The two kiss passionately, deeply -- Cinnabar loses herself\n            for a long beat -- then as if swimming up from the bottom of\n            a deep pool, she pulls herself back.\n\n<b>                                CINNABAR\n</b>                      I can't.  Not yet.\n\n<b>                                PATRICK\n</b>                      It's alright.  If you want to go home...\n\n<b>                                CINNABAR\n</b>                      No, I want to stay with you guys.  But I\n                      can't.  I mean I'm not ready.\n\n<b>                                PATRICK\n</b>                      Don't worry about it.  I'll stay with the\n                      boys.\n\n<b>            EXT. PEARL'S STOREFRONT - NIGHT\n</b>\n            From outside, through the open window, we can hear the\n            strains of singing coming from her window.\n\n<b>            INT. PEARL'S PARLOR - CONTINUOUS\n</b>\n            We float around the members of Pearl's circle.  See objects\n            on the table flickering in the candlelight.\n\n<b>                                PEARL\n</b>                      The spirit world is all around us right\n                      this minute.  And the departed are\n                      pressing in around us.\n\n            Still singing, they all glance about them in darkness as if\n            they can make out the spirits around them.\n\n            Over the low bass of their hymn-singing, her voice cuts in. \n            Uncoiling and rising like smoke in the air: it's a beautiful\n            voice and it does seem to open a window in the air.\n\n<b>            INT. BONES' ROOM - CONTINUOUS\n</b>\n            Cinnabar gets into bed and turns off the light.  Pitch dark\n            in there, can't see a thing.\n\n            As she's drifting off to dreamland, she hears what sounds\n            like the door quietly opening and someone slipping into the\n            darkness of the room, we just stay on her face. \n\n            It's cold in the place.  And spooky.  So she doesn't mind\n            when she feels what she assumes is Patrick slip in bed beside\n            her.  Though we see only a shape sliding under the covers.\n\n<b>                                CINNABAR\n</b>                          (half-asleep)\n                      It's okay, just don't get funny on me. \n                      It's warmer this way.\n\n<b>            INT. PEARL'S PARLOR - CONTINUOUS\n</b>\n            Suddenly, the curtains fly open.  And Pearl's voice suddenly\n            stops... and the flame on the candle shoots up, scorching the\n            ceiling before returning to normal.\n\n<b>                                PEARL\n</b>                      Someone's with us.  Who's joined the\n                      circle?\n\n<b>                                OLD MAN\n</b>                      Lordy...what's that smell?\n\n<b>                                OLD WOMAN\n</b>                      Look.  The flowers.\n\n            The flowers whither.  They retch from some smell.\n\n<b>                                PEARL\n</b>                      Knock once for yes.  And twice for no. \n                      Is there someone who wishes to send a\n                      message?\n\n            Table rocks once.\n\n<b>                                PEARL (CONT'D)\n</b>                      A message for one of us in the circle?\n\n            Table rocks once.\n\n<b>                                PEARL (CONT'D)\n</b>                      Is it for miss Lillian?\n\n            Table rocks twice -- \"no.\"\n\n<b>                                PEARL (CONT'D)\n</b>                      Is it a message for Mr. Abernathy?\n\n            Table rocks twice -- \"No\" again.  She goes around the room,\n            inquiring for each of them.  Each time the table says \"No.\" \n            Until there is only her left.  An eerie pause.\n\n<b>                                PEARL (CONT'D)\n</b>                      Is the message for me?\n\n            The table starts bucking wildly.  And suddenly Pearl's neck\n            SNAPS back like it's been caught in a whip.\n\n            Her mouth opens and a low moan escapes.  But sounds nothing\n            like her voice.  A deep wind through an organ tube with\n            swarming bees and squealing hogs mixed in.\n\n            Everyone around the table just stares at her in alarm.\n\n            As her eyes widen.  Go super close on her eyes and we see a\n            reflection in her pupil, not of the room she is in, but the\n            Jimmy's building twenty years ago.\n\n<b>            INT. BONES' BUILDING - PAST/PRESENT\n</b>\n            INTERCUT with her face back in the seance staring wide\n            mouthed in her trance.\n\n            The sound of her heart pounds like the deepest dub track.\n\n            Total dislocation for her as she sees Jimmy's old room, as it\n            was -- but also sees it as it is now, and with her daughter,\n            Cinnabar, lying underneath the covers of the big, round bed.\n\n            And lying close beside her, another figure beneath the\n            covers.\n\n            Whoever is there snuggles closer to Cinnabar.  She responds\n            as he presses against her, then wakes up.\n\n<b>                                CINNABAR\n</b>                          (laughing low)\n                      Cut it out.\n\n            But he doesn't.  The movement beside her is undulant. \n            Strong, erotic, she almost gives into it.  And still laughs\n            as she says:\n\n<b>                                CINNABAR (CONT'D)\n</b>                      No, no Patrick.  Stop.\n\n            The figure in the bed presses urgently against her, in a\n            rocking movement which catches her up in it.  She can't help\n            it, she begins to respond to the urging behind her.\n\n            Pearl's eyes widen as the whole room shifts and becomes one\n            fetid Necropoliptic texture.  The bed retains its shape but\n            liquefies, seems to become one with the floor and the walls,\n            all made of a kind of thick, bloody-mud in which the trapped\n            faces and distorted limbs of the dead twist and moan.\n\n            Meanwhile, on that strange bed, the figure behind Cinnabar\n            seems to wrap soft limbs around her, locking her in embrace.\n\n<b>                                CINNABAR (CONT'D)\n</b>                      Cut it out.\n\n            But it doesn't cut out.  It builds.  Strong.  Erotic. \n            Insistent.  She almost gives in to it.\n\n<b>                                CINNABAR (CONT'D)\n</b>                      No, no Patrick.  Stop.\n\n            But the movement is more insistent.  And rougher.  She starts\n            to protest louder when she feels a hand, or something, steal\n            across her mouth to muffle her objections.\n\n            Pearl tires to reach across her vision to grab her daughter\n            and help her, but she can't.\n\n<b>            INT. PEARL'S PARLOR - CONTINUOUS\n</b>\n            Back at the seance, Pearl's back is arched like a bass fiddle\n            string bowed, and then drops.  Released.  Back in her chair.\n\n            The instant she's returned to herself she's out of her chair\n            and out the door.\n\n<b>            INT. BONES' PAD - CONTINUOUS\n</b>\n            Cinnabar struggles with something in the bed, the covers\n            pulled tight against her face, she can't scream.  She twists\n            and wrenches herself about, finally striking behind her with\n            a flailing fist, twists her face free and screams:\n\n<b>                                CINNABAR\n</b>                      Patrick!  Stop!!\n\n            Across the room the door suddenly opens -- it's Patrick.\n\n<b>                                PATRICK\n</b>                      What's wrong?\n\n<b>            ANGLE - AT PATRICK'S FEET\n</b>\n            The black silhouette of the DOG slips out the door.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Are you alright?\n\n            Cinnabar looks wildly around the room -- she's alone in the\n            big bed.  No one attacking her.  And she sees Patrick in the\n            doorway.  But then who - or what - was in the bed?\n\n            Suddenly, her mother yells from below.\n\n<b>                                PEARL (O.S.)\n</b>                      Cinnabar!!!\n\n            Cinnabar lurches out of the bed over to the window.  Down\n            below, her mother's going nuts at the entrance, pounding on\n            the door and practically running over Bill who's opening the\n            door.\n\n<b>                                PEARL (CONT'D)\n</b>                      Outta my way, boy.  Cinnabar?  I'm\n                      coming!\n\n<b>                                BILL\n</b>                      Why don't you hang on and I'll see if\n                      she's here.\n\n<b>                                PEARL\n</b>                      I know damn well she's there.\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            Cinnabar races down the stairs with Patrick, bewildered at\n            her heels.\n\n            Cinnabar runs out the door and straight into her mother's\n            arms, burying her face in the protective bosom of her mom.\n\n            Pearl wraps her frightened daughter in her arms and turns her\n            to home.  Pearl looks up at the boys standing stunned in the\n            doorway.\n\n<b>                                PEARL\n</b>                      You might as well just dig down six feet\n                      of muddy earth and sleep in your own\n                      grave than stay another night in that\n                      house.\n\n            She turns back towards her place, still holding the sobbing\n            Cinnabar.  Bill and Patrick stand stunned in the doorway.\n\n<b>                                BILL\n</b>                      You sure got a way with women, bro.  What\n                      happened up there?\n\n<b>                                PATRICK\n</b>                      Damned if I know.\n\n<b>            EXT. BLACKSTONE - DAY\n</b>\n            Up on a ladder, the boys put on the finishing touches and\n            then HANG a new NEON SIGN over the door.  Looks pretty cool.\n\n<b>                                TIA\n</b>                      Yes!  We're in business.\n\n<b>\t\t\tINT. JEREMIAH'S CAR - LATE AFTERNOON\n</b>\n            Heading south on Lake Shore Drive, a tensely smiling Patrick\n            in the front seat with Jeremiah.\n\n<b>                                JEREMIAH\n</b>                      Where are we going?  You know I hate\n                      surprises.\n\n<b>                                PATRICK\n</b>                      A little business move I made.  On my\n                      own.  I think you're gonna approve.\n\n<b>            EXT. CAR - CONTINUOUS\n</b>\n            Heading off the main road into the ghetto.  But as they head\n            further and further south, Jeremiah's getting uneasy.\n\n<b>                                JEREMIAH\n</b>                      What are we doing down here?\n\n<b>                                PATRICK\n</b>                      Like you always said, Pop, look for the\n                      undervalued.\n\n            Now they are on the old street.  As they drive down the\n            street, Jeremiah's getting more and more agitated.\n\n<b>            EXT. BLACKSTONE - CONTINUOUS\n</b>\n            They park and get out.  He looks up and down the street,\n            oddly frightened.\n\n<b>                                PATRICK\n</b>                      I bet you didn't even know your bank\n                      owned the place.  I did it through a\n                      broker so you wouldn't know it was me. \n                      I couldn't wait to see your face when I\n                      fixed it up.\n\n            It's the building.  Freshly painted, with the neon sign.  But\n            Jeremiah's face shows nothing like what Patrick expected. \n            Nothing but a horrified, angry disgust.\n\n<b>                                JEREMIAH\n</b>                      Is this some kind of sick joke?\n\n            Jeremiah's so angry he almost smacks Patrick.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      Listen to me, boy.  I didn't work all my\n                      life to get out of this neighborhood for\n                      you to move right back in!\n\n<b>                                PATRICK\n</b>                      I thought you'd be psyched.  Just trying\n                      to do what you did.  Take nothing and\n                      make something out of it.\n\n<b>                                JEREMIAH\n</b>                      No one'll ever come here.  Shut it down. \n                      Don't worry, the bank'll buy it back. \n                      I'll take care of it.\n\n<b>                                PATRICK\n</b>                      You'll take care of it?  Not this time. \n                      No way.  I bought it fair and square. \n                      And we open tonight.\n\n<b>                                JEREMIAH\n</b>                      Bullshit!  Bullshit!!  You're selling it\n                      back!  That's an order!\n\n            Jeremiah is furious out of all proportions.  Some of the\n            others on the block have stuck their noses out to see what\n            the fuss is.  Then Jeremiah comes eye to eye with Pearl,\n            standing across the street, watching, worried out of her\n            mind.\n<b>\t\t\t\n</b>\t\t\tThen he looks up and sees Shotgun in the window.  Feeling\n            trapped, humiliated.  He wants out of this street.  Out of\n            those glances.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      You all are coming back to the house,\n                      now!\n\n            Nobody moves.  Jeremiah walks back to his car and pulls away. \n            Patrick, frozen, turned to stone by rage and hurt and shame.\n\n            Another car pulls up.  Several young people inside.  They\n            look around a little dubiously.\n\n<b>                                CLUBBER\n</b>                      Man, I think we're lost.  You guys know\n                      where Illibent is?\n\n            They all look at each other.  Silent.  Until Maurice answers\n            by flipping a switch igniting the neon sign for the first\n            time.  \n\n            Illibent shines in brilliant blue gas letters.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            DOWN THE BLOCK - LATER\n</b>\n            The deuce and a quarter stops in front of a storefront.  A\n            young Nefertiti in platforms and dashiki picks fresh fruit\n            and vegetables from the small grocery.  PEARL VAUGHN.\n\n<b>                                BONES\n</b>                      Pull over.  I'll walk the rest.\n\n            Pearl's picking ripe fruit.  Jimmy steps in, catches her\n            hands, and the melon in them, in his hands.\n\n<b>                                BONES (CONT'D)\n</b>                      Naw, all wrong.  First, start at the\n                      belly button.\n\n            He strokes his thumb over the end of the cantaloupe, leaning\n            in to her.\n\n<b>                                BONES (CONT'D)\n</b>                      Gotta be an in-ey and gotta be smooth. \n                      If it's ragged, it was picked too soon. \n                      Won't ever be ripe.  Second, it's got to\n                      have just a little give, here.  \n                          (his hands on her hips)\n                      At the edges.  And last, but not very far\n                      from least...\n                          (now only a breath apart)\n                      You gotta get your nose in it and give it\n                      a gooooood, looooong sniff.\n\n<b>                                PEARL\n</b>                      I don't know whether to chill you and\n                      serve with cottage cheese, or rip you\n                      open and eat you right here.\n\n            She chooses the latter, they kiss.\n\n<b>            EXT. STREET - TIME CUT\n</b>\n            Jimmy's walking Pearl home; an apartment above the storefront\n            of her mother's fortune telling business.\n\n<b>                                BONES\n</b>                      Listen, Baby, I gotta TCB this evening. \n                      So come over 'bout eight.  We should be\n                      finished by then.\n\n<b>            EXT. BONES' BUILDING - LATER\n</b>\n            Jimmy arrives home to be greeted on the steps of his building\n            by soul shakes and black hand fives from the corner boys\n            hanging out front.\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            Follow Bones into the lobby with people waiting to see him\n            for favors, etc.  Rooms on either side, doors open allowing\n            us to glimpse his crew, taking orders over the phones.\n\n            An old fashioned metal cage elevator, with an equally old\n            fashioned operator waits to take Mr. Jimmy up to his pad.  We\n            ride up with him, the king in his castle.\n\n<b>            INT. BONES' PAD - CONTINUOUS\n</b>\n            The elevator lets him out in his main room.  A '70's love\n            pit.  Mirrored ceiling, circular bed.  Thick shag carpeting.\n\n            Jimmy nods at Shotgun, who lowers the needle into classic\n            vinyl groove of some prime Funkadelic (\"Nappy Dug-out\").\n\n            Jimmy splashes cologne on his face and looks contentedly out\n            the window at all his people, at his kingdom below...\n\n<b>            EXT. BONES' BUILDING - LATER - DAY\n</b>\n            The cop we saw with Jeremiah, LUPOVICH, and the wannabe\n            player EDDIE MACK (wearing an old Superfly suit, and sleek\n            black driving gloves) pull up in front of the old stone\n            building.\n\n<b>            INT. BONES' PAD - CONTINUOUS\n</b>\n            Shotgun mixes drinks at the bar and hands them to the just\n            arrived guests, Jeremiah, Officer Lupovich - looking stiff in\n            plain clothes - and Eddie Mack in his purple suit.\n\n<b>                                JEREMIAH\n</b>                      Hey Jimmy, you know Eddie Mack, don't\n                      you?\n\n<b>                                BONES\n</b>                      We met.\n\n<b>                                MACK\n</b>                      Yeah, we used to do the after-school b\n                      ball at Kenwood.  What it is?\n\n<b>                                BONES\n</b>                      What it will be.\n\n<b>                                JEREMIAH\n</b>                      And Officer Lupovich.\n\n            Bones says nothing.  Just nods at the cop.\n\n<b>                                MACK\n</b>                      You got a nice crib here.\n\n<b>                                BONES\n</b>                      I do alright.  Everybody's happy.\n\n<b>                                MACK\n</b>                      But things change.  You gotta think\n                      ahead.\n\n<b>                                LUPOVICH\n</b>                      They got lotteries all over now, Bonesy. \n                      Coming here too, maybe next year.\n\n            Bones' look sez: Bitch, don't call me that again.\n\n<b>                                JEREMIAH\n</b>                      Half our old customers are gonna be\n                      getting their people to cross state lines\n                      to pick up lotto tickets.\n\n<b>                                MACK\n</b>                      Besides, there's more money to be made in\n                      the gin than the juice.  What do anybody\n                      want with numbers anyway?\n\n<b>                                BONES\n</b>                      What else?  Money.\n\n<b>                                MACK\n</b>                      It ain't the money - it's the high.  The\n                      big fat floating 'what if?'  And it's way\n                      more profitable.  Nobody ever wins.  So\n                      you never have to pay out.\n\n<b>                                BONES\n</b>                      But a two dollar bet is cheaper than a\n                      twenty-dollar bag.\n\n<b>                                MACK\n</b>                      Yeah, but I ain't talking horse.  I'm\n                      talking about a five-dollar kick in the\n                      head that's a quick ticket to heaven. \n                      And the fools keep coming back for more.\n\n<b>                                BONES\n</b>                      Those 'fools' are my people.\n\n<b>                                MACK\n</b>                      Ain't no big thang.  It's just a po'\n                      man's free base.  Here, check it out.\n\n            Eddie pulls a little rock of crack out.  Jimmy takes it in\n            his hand and sniffs it.  Then shrugs and hands it back.\n\n<b>                                BONES\n</b>                      I ain't interested.  And if you gonna\n                      sell it, don't sell it round here.\n\n<b>                                MACK\n</b>                      Just try it.\n\n<b>                                BONES\n</b>                      I said, no thanks.\n\n<b>                                MACK\n</b>                      Go on.  It won't kill you.\n\n<b>                                SHOTGUN\n</b>                      Back off, Huggybear...\n\n<b>                                MACK\n</b>                      It's like this, Jimmy.  There's a wave\n                      coming.  A big ass Krakatoa, East of Java\n                      wave.  And either you gonna be on top of\n                      the wave up there in chocolate heaven, or\n                      you gonna be buried 'neath the muddy\n                      undertow.\n\n<b>                                BONES\n</b>                      That's cool.  Totally wide-screen sci-fi. \n                      Forward thinking.  I respect that.  But\n                      that ain't my life.  I'm here and now. \n                      Comfortable as a bed bug on a cold night\n                      in a warm nappy dugout.  I'm maintaining. \n                      That's what it's about for me.  And your\n                      twelve and a half-minutes is up.\n\n            Jimmy just walks away from him.  Meeting over.  Eddie and\n            Lupovich and Jeremiah all look at each other, frustrated.\n\n<b>                                MACK\n</b>                      Fine.  Let's go, Loopy-Lou.  Jimmy ain't\n                      into it.  Gonna skip the money train and\n                      take the bus.  His loss.\n\n            Lupovich turns but then spins back around with a .45 in his\n            hand and it's pointed at Jimmy's forehead.  Jeremiah didn't\n            expect this - or did he?\n\n<b>                                JEREMIAH\n</b>                      Everybody just be cool.  Jimmy, man, I\n                      think you oughtta hear the deal.\n\n<b>                                BONES\n</b>                      I don't need to hear the deal.  I don't\n                      need any partners.  I don't need new\n                      product.  And I sure as hell don't need\n                      this motherfucker's 'mattie in my face.\n\n<b>                                MACK\n</b>                      Just try it, Jimmy.  That's all...\n\n            He hands him the rock.  And a little pipe.\n\n<b>                                LUPOVICH\n</b>                      You heard the man.  Try it.\n\n            Bones keeps his eye on him as he lights the lighter and takes\n            a deep puff.  Then lets out a deep cloud of smoke.\n\n            His eyes go a bit glazed.  And from his POV we see the room\n            start to tilt on its axis as everything goes wobbly.\n\n            Just then, the door opens and Pearl steps in, distracting\n            Lupovich for an instant.\n\n            In one eternal crack fueled fast-and-slo-mo second: Jimmy\n            sees his chance, he pulls his razor, but too slow --\n\n            Lupovich turns, the razor no more than lightly slices his\n            arm, and he pulls the trigger on Jimmy Bones...\n\n            Pumping three shots into Jimmy's abdomen, knocking him to the\n            ground.  Shotgun grabs his gun, but too late.  He's covered.\n\n<b>                                MACK\n</b>                      Ain't worth it, Blood.  Just drop it. \n                      And kick it here.\n\n            Pearl in screaming shock.  Her lover bleeding on the carpet.\n\n<b>                                LUPOVICH\n</b>                      Tell her to stop screaming.\n\n            Bones is bleeding, and still tripping bad.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      I said stop that bitch screaming or I'll\n                      spread her like butter.\n\n            Shotgun gently puts his hand on Pearl's mouth to quiet her.  \n\n<b>            BACK IN BONES' FUCKED-UP POV:\n</b>\n            Looking down he sees his own blood pouring out, a thick\n            divine river of many colors.  Looking up, they all stand\n            wavering above him, hungry demons, their voices distorting.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      Get his razor.  I ain't gonna be the only\n                      one with this nigger's blood on my hands.\n\n            Mack plucks Bone's silver razor right out of his hands.\n\n<b>                                LUPOVICH (CONT'D)\n</b>                      Take the gloves off.  Everybody leaves a\n                      print.  We hang out together.  Or we hang\n                      separately.  Cut him.  And cut him good.\n\n            Eddie pulls his glove off and enjoys himself as he shoves the\n            razor into Jimmy.\n\n<b>                                MACK\n</b>                      What it is?  What it will be, muthafucka.\n\n<b>                                LUPOVICH\n</b>                      Now you.\n\n<b>                                JEREMIAH\n</b>                      No way man...\n\n<b>                                LUPOVICH\n</b>                      You cut him, or I shoot you.  Make your\n                      choice.\n\n            Jeremiah gets down near Bones.  Bones stares right into his\n            eyes, as his life blood pours freely, weakly lifts his arm to\n            his best friend's face.\n\n<b>                                BONES\n</b>                      Jay bird...help me...like brothers.\n\n            Jeremiah feels Lupovich's gun behind his head.  Hears it\n            cocked.\n\n<b>                                JEREMIAH\n</b>                      Sorry, my brother.\n\n<b>                                BONES\n</b>                      Since we was just grasshoppers...\n\n<b>                                JEREMIAH\n</b>                      You always told me, it's a dog eat dog\n                      world.\n\n            And he thrusts Bones' razor right between the ribs.  Bones'\n            eyes tighten, but never lose their lock on Jeremiah's eyes. \n            His mouth moves as if he's trying to speak.  Instead, he\n            spits a bog of blood right into Jeremiah's face.\n\n            A shaken Jeremiah hands the bloody razor to Shotgun.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      Just do it.  He won't even feel it.\n\n            Bones' eyes bore into Shotgun's.  Shotgun hesitates.  Eyeing\n            his gun on the floor, feeling the one on the back of his neck\n            -- calculating his chances.\n\n            Then Shotgun slices him.  Bones flinches, he definitely still\n            feels it.  Shotgun hands the razor back to Eddie.\n\n<b>                                LUPOVICH\n</b>                      Now you, girlie.\n\n<b>                                PEARL\n</b>                      I won't.\n\n<b>                                LUPOVICH\n</b>                      Same deal all around.  Or die with him.\n\n            She takes the razor and slowly kneels beside her dying lover. \n            Her hands trembling.  There's no way she can do it.  Lupovich\n            brings the gun to the back of her head.\n\n<b>                                PEARL\n</b>                      I can't.  I won't.  Go ahead.  Shoot me. \n                      I'll be better off.\n\n            Bones reaches one hand round the back of her neck, weakly\n            storking her there... And with his other hand, Bones takes\n            her wrists and pulls her hand towards him, burying his razor\n            in his heart.  His eyes roll back and his hand falls away and\n            he's gone.\n\n            She drops her hand from the razor which remains sticking out\n            of his chest, a river of blood pouring from around it.\n\n<b>            BONES POV\n</b>\n            As his spirit rises and rises, up to the ceiling, looking\n            down on them as they stand watching his body bleed to death.\n\n            Pearl just stands there completely covered in his blood. \n            Then in a frantic daze tears her dress off.  Jeremiah gently\n            takes her bloody dress.\n\n            From above, Bones can hear them speaking below, but it's as\n            if they were speaking far away.\n\n<b>                                JEREMIAH\n</b>                      Too risky to take him outside.  Take him\n                      down to the storm cellar and bury him. \n                      And get rid of this too.\n                          (tosses Pearl's bloody dress)\n                      Let this whole damn building be his tomb.\n\n            Shotgun and Lupovich drag Bones' body out of the room,\n            leaving behind a deep wet blood stain in the shag carpet.\n\n<b>            BONES POV\n</b>\n            As he stares down in horror at all this.  Above him, it seems\n            he can see right through the ceiling to the night sky, and a\n            swirling light opening above his head.\n\n<b>            NOW HIS POV\n</b>\n            Is floating upward towards the light, but then he looks\n\n<b>                                                               BACK DOWN\n</b>\n            Staring down at the sight of his body in a deep puddle of\n            blood, and his murderers removing his woman's dress covered\n            with is blood.  As he sees this, his (and ours) POV changes,\n            becomes darker, yet clearer; too sharp, razor sharp as some\n            softness, perhaps life itself, drains out of it.  Bones sees\n            his best friend Jeremiah and Lupovich together dragging his\n            body out the door, leaving a thick wet stain behind him.\n\n            We can hear Jimmy's last wail of rage twist and distorts in\n            the air, becoming another deeper voice within the voice...\n            And then he (and we) plunge back down to the ground, right to\n            the dark, wet stain in the carpet...\n\n            Hit it and go down through an instant's glimpse into the\n            black sea beneath the foundation of the world:\n\n            Necropolis.  Where space itself seems to be made of pale\n            bloated, gnawing, writhing things.  Bodies perpetually\n            devouring themselves and each other.\n\n            We see through this dog-eat-dog nightmare, back out through\n            the blood stain as through a key hole slowly closing.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            EXT. CLUB - LATER\n</b>\n            A line out front.\n\n<b>                                PATRICK\n</b>                      Be cool.  Everybody's gonna get in.\n\n            Patrick alternates between tending the crowd and throwing\n            anxious glances down the block towards Cinnabar's home.\n\n            Torn between exhilaration at seeing his dream come true and\n            disappointment that Cinnabar's not there to share it.\n\n            People chomping to get in.  Across the street Shotgun watches\n            with dismay.\n\n            Patrick hears voices down the street.  Looks up to see\n            Cinnabar walking towards the club.  His smile freezes when he\n            sees Pearl right behind her.  Trying to stop Cinn.\n\n<b>                                PEARL\n</b>                      ...I've seen things.  In there.  Last\n                      night.  You did too.  Don't tell me you\n                      didn't.  You were crying like a baby.\n\n<b>                                CINNABAR\n</b>                      You said the vision, the images.  They're\n                      just that.  Just pictures.  They can't\n                      hurt you.  That's what you always said.\n\n<b>                                PEARL\n</b>                      I lied.\n\n<b>                                CINNABAR\n</b>                      All the more reason I should be here.\n\n<b>                                PEARL\n</b>                      Please.  It's for your own good.\n\n<b>                                CINNABAR\n</b>                      You said bad things hurt places.  So\n                      maybe good things heal them.  Good things\n                      are happening here.  Maybe for the first\n                      time ever.  And maybe that's all it\n                      takes.\n\n            Pearl sees she can't stop Cinn.  Any more than her mother\n            could have stopped Pearl when she was her age.\n\n<b>                                PEARL\n</b>                      I hope so, child.  I really hope so.\n\n            She can only watch as Cinnabar gives Patrick a big hug and\n            follows him and the rest of the crowd into the club.\n\n<b>            INT. THE BUILDING/CLUB - CONTINUOUS\n</b>\n            The place is unfinished.  But all the cooler for it.  The bar\n            is crude.  Cheap beer and jug wine.  But the crowd don't\n            mind.  The place is alive.  The boys are on fire.\n\n            A packed floor of dancers move as sound and image break beat,\n            and Maurice's voice erupts in deep dub reverb.\n\n<b>                                MAURICE\n</b>                      The gangsta of love is in the house.\n\n            Hits the reverb and it echoes.\n\n<b>                                ECHO (O.S.)\n</b>                      In the house...house...house...\n\n<b>            ON SCREENS\n</b>\n            Throughout the house, the video interviews the guys did and\n            mixed like audio samples with old blaxploitation clips and\n            other video oddities the boys came up with.\n\n<b>                                MAURICE\n</b>                      Ill Bill is in the house...house...house\n                      ... house.\n\n            And over Maurice's Gothic drum and bass, Bill starts\n            turntabling some seriously dark funk.\n\n<b>            INTERCUT WITH THE BLACK DOG\n</b>\n            coming ominously down the third floor stairs.\n\n<b>                                MAURICE (CONT'D)\n</b>                      Jimmy Bones is in the house...house...\n                      house... \n                      This is the story of Jimmy Bones.  Black\n                      as night and hard as stones.\n\n            The dog now on the second floor stairs.\n\n<b>                                BILL\n</b>                      ...Bones ol' Bones so mean and bad,\n                      whupped his mamma, shot his dad.\n\n<b>                                MAURICE\n</b>                      Saw Bones ol' Bones on top of the hill. \n                      Rolling fat jays outta hundred dollar\n                      bills.\n\n<b>                                TIA\n</b>                      ...Lord he never worked a day and he\n                      never will...\n\n            Bill builds, lets the record spin, then pops the kill button. \n            The tune fades in a distorted way as he start/stops/start/\n            stops it, forcing the sound backwards and forwards...\n\n            ...as Maurice twiddles dials and distorts it all further --\n            it's spooky, but way funky.\n\n<b>            NEW ANGLE - THE BLACK DOG\n</b>\n            Is now in the house too.  Walking through the throbbing\n            crowd, making a path right through them, most of the dancers\n            paying it no mind, it's just another part of the trippy\n            scene.  Or do they even see it?  We can't tell.\n\n<b>            CLOSER ANGLE - ON THE DOG\n</b>\n            And it's single-minded concentration.  Staring straight ahead\n            as it moves through the crowd towards Maurice, who for a\n            second, notices the dog coming but making nothing of it.\n\n<b>            REVERSE - THE DOG'S POV\n</b>\n            What it's staring at.  Bones' old ring on Maurice's finger.\n\n<b>            NEW ANGLE - MAURICE'S POV\n</b>\n            When he looks back, he sees not a dog, but a beautiful black\n            woman, a Dark Lady, who only has eyes for him.\n\n            Dancing seductively, drawing a crowd as she moves, she stares\n            straight ahead at Maurice.\n\n            Maurice's joint droops from the corner of his mouth as he\n            realizes \"YES!\", this world-class beauty is most definitely\n            flirting with him.\n\n            The Dark Lady's still throwing him deep looks as she dances\n            off the floor and then disappears up the stairs, making\n            Maurice lean into Bill.\n\n<b>                                MAURICE\n</b>                      Can you take a little extended solo right\n                      about now, funk soul brotha?\n\n<b>                                BILL\n</b>                      Go for it.\n\n            Maurice heads upstairs, sure that his short DJ career is\n            already paying off big time.\n\n<b>            INT. UPSTAIRS - CONTINUOUS\n</b>\n            Maurice slips into the darkness of the room and closes the\n            door behind him.\n\n<b>                                MAURICE\n</b>                      Hey, baby.  Time for a little meat beat\n                      manifesto.\n\n            In the darkness he can't see where she is.  Just hear a deep\n            breathing, almost panting.\n\n<b>                                MAURICE (CONT'D)\n</b>                      Ahhh, tantric breathing.  I'm in love.\n\n            He can't see her.  Or anything in the dark room.  Finally his\n            eyes adapt to the dark and he sees a dark shape by the bed.\n\n<b>                                MAURICE (CONT'D)\n</b>                      That's it, honey.  Don't need to speak. \n                      Jesuis le Gangsta de l'amour.  El Gaucho\n                      della Cosmos.  We will speak zee\n                      international language of love...\n\n            He pulls out a lighter to light his joint (and see where she\n            is) but when he does it's not her beautiful dark features he\n            sees, but:\n\n            For the blink of an eye, it's totally blank face, except for\n            a HUGE MOUTH with liver lips, pink gums and wolfen teeth. \n            When it exhales, out comes a noxious cloud of tiny insects. \n            And then in the blink it's the raging black dog leaping open\n            jawed at his face.\n\n            Maurice screams and drops his light in fright.  He starts\n            crawling towards the door and the overhead light switch. \n            While trying to fend himself from the wailing teeth and claws\n            of the canine creature...\n\n<b>            INT. THE CLUB - CONTINUOUS\n</b>\n            Maurice's screams are inaudible.  Just another faint part of\n            the complicated mix.  Maurice's voice, a sample loop, is part\n            of the boys' mix.\n\n<b>                                MAURICE (O.S.)\n</b>                          (voice in music mix)\n                      \"Jimmy Bones is in the house...house...\n                      house.\"\n\n<b>            INT. UPSTAIRS - CONTINUOUS\n</b>\n            Furious flashes and glimpses of savage teeth and claws\n            ripping Maurice.\n\n<b>            INT. THE CLUB - CONTINUOUS\n</b>\n            Bill's extended turntablism rocks the house.  Tia replaces\n            Patrick behind the bar while Cinnabar drags him on to the\n            dance floor.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            Bones-vision moves/floats all the way down to the basement. \n            He squats over his own corpse.\n\n            Before our eyes (INTERCUT with flashes of the demon-dog\n            feasting on Maurice upstairs), more and more flesh grows on\n            the bones of Bones.\n\n<b>            INT. DANCE FLOOR - CONTINUOUS\n</b>\n            Bill signals Patrick, calling him over.\n\n<b>                                BILL\n</b>                      Where's the gangsta of love?\n\n<b>                                PATRICK\n</b>                      Probably stoned out of his gourd in some\n                      corner.\n\n<b>                                BILL\n</b>                      Well, go find his lazy ass.  I scratch\n                      any more tonight I'm gonna have carpal\n                      tunnel syndrome.\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            INT. UPSTAIRS - CONTINUOUS\n</b>\n            Patrick walks upstairs - we fear he will be next.\n\n<b>                                PATRICK\n</b>                      Yo.  Maurice.  Where are you?\n\n            He tries a door.  Nothing.  Then he hears noises from the\n            third floor.\n\n<b>            INT. HALLWAY - CONTINUOUS\n</b>\n            Patrick opens the remaining bedroom door on a nightmare\n            tableaux.  Maurice lies in a pool of blood.  His body shakes\n            and shudders spasmodically as the dog feasts on his liver.\n\n            Patrick starts for Maurice but the dog growls to keep him\n            back away from its precious food.  Patrick backs up a step. \n            Almost out of his mind with terror.  He really loses it when\n            the dog, in SLO-MO, looks up and directly at him.  It seems\n            to be wearing Maurice's face and speaks with a twisted\n            version of his (Maurice's) voice:\n\n<b>                                DOG/MAURICE\n</b>                      The gangsta of love don't eat no fried\n                      chicken...\n\n            And before Patrick can even freak, the dog has returned to\n            it's normal dog face, and it lunges at Patrick, taking a\n            sizeable bite out of his arm.\n\n            Patrick leaps back out the door, with only a fast glance back\n            at the thing in the room --\n\n            The dog is not following him.  It's standing.  Over Maurice's\n            remains.  Growling low, it begins to shudder uncontrollably\n            to bulge and ooze.\n\n            The gore covered dog quivers and swells and bulges and\n            finally explodes into a shower of pulsating maggots, flying\n            all over the room and all over Patrick's eyes and in his\n            mouth.\n\n<b>            INT. BASEMENT - CONTINUOUS\n</b>\n            The body is now done.  It looks whole again.  Even strong and\n            young.  If still gray and cold until Bones lies down, curls\n            up into the body filling the rejuvenated corpse with the\n            vital life force of his vengeful rage.\n\n            Bones/The Body opens his eyes, stands up not tottering as\n            before but filled with strength.  He looks as good as new,\n            except for the tattered clothes.\n\n<b>            ON THE DANCE FLOOR - CONTINUOUS\n</b>\n            The dancers can't hear Patrick screaming or running down the\n            stairs.  They're just groovin' along to Ill Bill and the\n            funk.\n\n            Until the maggots start oozing and pouring through the\n            ceiling onto their hair and faces and clothes, into their\n            drinks at the bar and onto their pizza slices.\n\n            Then Patrick comes into the room screaming and all hell\n            breaks loose as the sight of him, plus the maggots, sends\n            everyone tearing for the exits.\n\n            Seeing his brother in terror, Bill slams the tone arm\n            screeching the needle across the record, leaving only the\n            psycho drum and bass playing on the other channels of the\n            mix.\n\n<b>            INT. BASEMENT - CONTINUOUS\n</b>\n            Meanwhile, down below, the freshly embodied Bones studies the\n            gas furnace.  This time when he bends down to blow out the\n            light -- wooosh, he blows it out.  He reaches under the tank\n            and the gas hisses out.\n\n            Then he eyes his old razor on the floor.  With a confident,\n            strong grip, he picks it up and now, finally --\n\n<b>            BONES IS BACK IN BUSINESS.\n</b>\n<b>            INT. DANCE FLOOR - CONTINUOUS\n</b>\n            Hell-maggots still falling onto people, maggots on the floor\n            making people slip and fall as they jam the exits.  Screaming\n            chaos, people trying to break windows to get out faster...\n\n            Patrick looks across the chaotic room and sees Cinnabar and\n            Tia cringing under a table.  Trapped there.  Bill in the\n            doorway trying to get people out.\n\n<b>            INT. BASEMENT - CONTINUOUS\n</b>\n            At the top of the stairs, leading up out of the sub basement,\n            Bones smashes the bulb of the hanging light.  Then flips the\n            light switch -- the spark ignites the gas behind him.  It\n            causes a fiery explosion in the lower basement.\n\n            The fire's light seems the very glow of hellfire behind Bones\n            as he marches up the stairs, razor in his hand.\n\n<b>            INT. DANCE FLOOR - CONTINUOUS\n</b>\n            Patrick, trying to stay low, crawls his way to where his\n            sister and Cinnabar are trapped.\n\n            Fire begins to burn through from the kitchen and up through\n            the floor.  The room is filling with smoke.\n\n            Bill's helping those trampled in the rush to get out.  Bill\n            himself bleeds badly from his neck.\n\n            Patrick runs with Cinnabar and Tia toward the door.  And as\n            the smoke fills the room, through the haze we see:\n\n            Bones step into the room.  His arm raised with the razor. \n            And he flings it out, like a boomerang, the razor flies\n            around the room.\n\n            It swoops down through the smoke at the remaining kids,\n            hacking at them through the smoke, like some savage bird,\n            though it doesn't seem intent on slaughtering them, but\n            rather herding them out.  Bill and Patrick pull Cinnabar and\n            Tia out the door -- they're the last in the room.\n\n            Suddenly the razor stops, freezes in mid-air and zips back\n            into Bones' waiting fist - just like a boomerang.\n\n            Razor held high, Bones advances on them, steadily, cool as\n            ice amidst the now fully burning house.\n\n<b>            EXT. STREET - CONTINUOUS\n</b>\n            Shotgun, Pearl and a few others have run out into the street\n            to watch the fire.  In the distance, sirens already wail. \n            Pearl holds her breath until she sees Cinnabar safe.\n\n            Looking for an instant, they all see Bones as the room is\n            engulfed in flames.  See him raise his fists in a rage.  Or\n            is it in triumph?  Before his figure is obscured by falling\n            debris.\n\n            Sirens wail as fire trucks pull up and the men start\n            unrolling a hose.  But freeze at the cocking of the shotgun.\n\n<b>                                SHOTGUN\n</b>                      Unh-unh.  Let it burn.\n\n            The rising flames illuminate the faces of spectators. \n            Especially shotgun and Pearl, who for the first time in 20\n            years, look each other straight in the eyes.\n\n<b>                                SHOTGUN (CONT'D)\n</b>                      We shoulda done this a long time ago.\n\n<b>                                PEARL\n</b>                      I don't know.\n\n            Her flame-reflecting eyes telling us her fear: this may be a\n            huge mistake.\n\n<b>            INT. BONES' HOUSE - CONTINUOUS\n</b>\n            In the burning room, we see Bones, oblivious to the flames,\n            climbing the stairs.\n\n<b>            INTO HIS HOLD ROOM WHERE\n</b>\n            He comes to what's left of Maurice.  Finds his hand bloodied\n            and barely attached to the wrist, and on it -- Bones' ring.\n\n<b>                                BONES\n</b>                      You won't be needing this.\n\n            Bones slips it onto his stump of a finger.\n\n<b>            INT. POLICE STATION - CONTINUOUS\n</b>\n            Patrick and the others sit ashen-faced under questioning by\n            cops and arson investigators.\n\n<b>                                INVESTIGATOR\n</b>                      Flying razor, big black man, spontaneous\n                      explosion.  I got just one question: what\n                      the hell narcotic were you all on?\n\n<b>                                PATRICK\n</b>                      We never did that.  Only...Maurice was\n                      into it.\n\n<b>                                COP\n</b>                      That's the one you left behind?\n\n<b>                                BILL\n</b>                      Yeah.  My man Maurice.  The Space Cowboy. \n                      The Gangsta of Love.\n\n            He breaks down.  Just then, Jeremiah walks in with a lawyer.\n\n<b>                                JEREMIAH\n</b>                      None of you say another word.\n\n<b>            INT. PEARL'S STOREFRONT - CONTINUOUS\n</b>\n            Cinnabar is crying, Pearl holding her.\n\n<b>                                PEARL\n</b>                      It's alright, baby.\n\n<b>                                CINNABAR\n</b>                      Who was he, Momma?  He tried to kill us.\n\n<b>                                PEARL\n</b>                      If he was trying to kill you, you'd be\n                      dead.\n\n<b>                                CINNABAR\n</b>                      Who?  Who is he?  What is he?\n\n<b>                                PEARL\n</b>                      Your father.  He was your father.\n<b>\t\t\t\t\t  \n</b><b>\t\t\tINT. CAR - LATER THAT NIGHT\n</b>\n            Jeremiah drives his still shocked and silent brood back to\n            safety behind the gates of Rossmore Park.\n\n<b>                                JEREMIAH\n</b>                      I don't want any of you ever back down\n                      there again.  You hear me?  And this time\n                      you'll listen to me.  Or I'll let them\n                      throw your asses in jail.  I mean it.\n\n<b>            INT. PEARL'S STOREFRONT - CONTINUOUS\n</b>\n            Cinnabar, listening to her mother, is told what happened.\n\n<b>                                PEARL\n</b>                      You got his hands.  Beautiful hands.  I\n                      didn't even know.  That night.  When they\n                      - we - killed him, that you were already\n                      alive inside me.  Life's like that. \n                      Grows right out of death.\n\n<b>                                CINNABAR\n</b>                      But if it's him.  If he's really come\n                      back, won't he know us?  Love us?\n\n<b>                                PEARL\n</b>                      Sure, if it was really him.  But it isn't\n                      that simple.  Jimmy's body died a long\n                      time ago.  And his soul is long gone, and\n                      all that's left is that ravening, hungry\n                      spirit in the blood that soaked into the\n                      house itself, I suppose.\n\n<b>                                CINNABAR\n</b>                      But how do you know?  Maybe he just\n                      wanted to see us?  And now he's gone\n                      again.  And you've all killed my father\n                      for the second time.\n\n            Cinnabar runs crying out of the room.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            EXT. BACK ON THE STREET - PRE-DAWN\n</b>\n            The building is finished, just a blackened shell.  Remnants\n            of the staircase lead up to fragments of the upper floors. \n            Smoke still billowing from the empty center of the ruin.\n\n            Silhouetted in the smoke and the low light of the rising sun:\n            a tall, dark figure, not of then, nor quite of now.\n\n            It is Bones.  Taller, thinner, darker and more menacing then\n            ever.  But unmistakably Bones.  He steps out of the rubble. \n            And looks across the street, up at Shotgun's lit window.\n\n<b>            INT. SHOTGUN'S APARTMENT - CONTINUOUS\n</b>\n            Shotgun's hand shakes as he pours another shot.  Then downs\n            it.  He turns to the window and freezes at what he sees.\n\n            Bones face is just outside the window.  The second story\n            window.  Smiling in at him.  Shotgun is petrified.  But then\n            he picks up his gun and shoots at the face in the window.\n\n<b>                                BONES (O.S.)\n</b>                      Free at last, free at last.\n\n            Shotgun whirls and there stands Bones behind him now.\n\n<b>                                SHOTGUN\n</b>                      It wasn't my fault.  I didn't know what\n                      they'd planned.\n\n<b>                                BONES\n</b>                      Shush.  It don't matter now.\n\n<b>                                SHOTGUN\n</b>                      No.  Really, Jimmy.  Remember, man.  It's\n                      me.  I was on your side.  Don't you\n                      remember?\n\n            He just walks towards the terrified Shotgun, closer and\n            closer, leaning right over his shotgun, his face coming just\n            inches from Shotgun's face.\n\n<b>                                BONES\n</b>                      Take a look at what I remember,\n                      brother...\n\n            His big brown eyes fill Shotgun's vision, and in what now\n            seem to be the gigantic pupils in Bones' eyes, Shotgun sees\n            the old apartment, and there it all is again and again.\n\n            Shotgun sees himself hesitating, almost risking it all and\n            instead giving in, stabbing Bones -- he can't look away. \n            Then Bones closes his eyes.  Shotgun sobbing now.\n\n<b>                                SHOTGUN\n</b>                      I had no choice, Jimmy.  What else could\n                      I do?\n\n<b>                                BONES\n</b>                      You coulda died with me.  Died trying.\n\n            Shotgun is cradling his weapon, hands shaking.  He points it\n            at Bones and pulls the trigger.  Bones doesn't even flinch as\n            the pellets rip through him.\n\n<b>                                BONES (CONT'D)\n</b>                      Feel better?\n\n            Bones' impossibly long fingers hold his long rusty razor.  He\n            waves the razor in front of Shotgun, the rusty blade swinging\n            free back and forth, hypnotically, with a rasping sound.\n\n<b>                                BONES (CONT'D)\n</b>                      You gonna be free and clear, Shotgun. \n                      All debts paid...\n\n            And then in one swift motion, on the back stroke, Bones' hand\n            and razor slash across Shotgun's throat.\n\n            Shotgun doesn't even have time to scream, we just hear his\n            breath and blood escaping from the new opening across his\n            neck.\n\n            Bones bends down and cradling his old friend, whispers gently\n            into his ear.  Singing, perhaps.  We can't quite hear.\n\n<b>                                BONES (CONT'D)\n</b>                      See you on the other side, brother.\n\n            Bones gets up and moves around the room, standing before the\n            window and looking down at the neighborhood he used to own.\n\n            For a second he sees the old neighborhood, everybody hanging\n            out.  Then he blinks back to reality.  He looks down the\n            block and sees Pearl's reader and advisor sign.\n\n<b>            INT. JEREMIAH'S HOUSE - DAY\n</b>\n            Bill in a kind of shock can only lie in his bedroom, staring\n            at the ceiling.\n\n            Tia's out in the living room, sitting on the couch weeping in\n            her mother's arms.\n\n            Patrick's in the bathroom tending the bloody scratches on his\n            back and arms.  He's frightened.  And angry.  He storms out\n            of the bathroom, down the hall to his father's office.\n\n<b>            INT. JEREMIAH'S STUDY - CONTINUOUS\n</b>\n            As Patrick slams the door behind him, Jeremiah hides a stack\n            of papers and photos beneath a pile on his desk.\n\n<b>                                PATRICK\n</b>                      Did you do it?\n\n<b>                                JEREMIAH\n</b>                      Sure, son.  I went down there and torched\n                      the place myself.\n\n<b>                                PATRICK\n</b>                      You could have had it done.  You didn't\n                      want us there.\n\n<b>                                JEREMIAH\n</b>                      I wouldn't have risked killing you to get\n                      you out.  I was trying to protect you.\n\n<b>                                PATRICK\n</b>                      From what?\n\n            Jeremiah can't answer.  But Patrick's not leaving it alone.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Why?  Why did you give a shit about the\n                      building?  Why did you care that we were\n                      there of all places?\n\n<b>                                JEREMIAH\n</b>                      It's...it's a bad neighborhood.  As you\n                      can see now.\n\n<b>                                PATRICK\n</b>                      Bullshit, Dad.  Don't front me.  For\n                      once.  Just tell me the truth.  I came\n                      from there, too.\n\n<b>                                JEREMIAH\n</b>                      You were just a kid.\n\n<b>                                PATRICK\n</b>                      I saw your face.  You knew that place. \n                      You knew those people.\n\n<b>                                JEREMIAH\n</b>                      That's the past.  It's dead.\n\n<b>                                PATRICK\n</b>                      Dead?  I don't think your past is dead.  \n                          (points to the bandages)\n                      It's alive.  And it bites.\n\n<b>            EXT. BLACKSTONE STREET - NIGHT\n</b>\n            That night we see a walking shadow.  The long tall black clad\n            Bones.  Heading down his old block.  Alone.\n\n            As he moves, his face changes, at times demonic and intent. \n            But periodically that shifts as if a mask slipping off to\n            reveal a similar but different face below.  More human, lost,\n            pained, confused, and we see why:\n\n<b>            FROM BONES' FUCKED UP UNDEAD POV:\n</b>\n            The dark and desolate street he walks down keeps flashing for\n            brief instants into the street of twenty years ago.\n\n            One moment, people nodding to him, waving, blowing kisses.\n            And then suddenly, it's the empty burnt block it is now.\n\n            Bones' face shifts, cracking, one second the hungry ghost. \n            The next, he's the old Bones who once ruled this 'hood.\n\n            He sees, down the block, the old palmistry sign.  It's\n            Pearl's place.  For a second, the face of the real Jimmy\n            Bones triumphs and he smiles.  Then hears voices behind him.\n\n            Stank and Weaze.  They see a tall, thin figure in some very\n            fine looking, long duster.\n\n<b>                                STANK\n</b>                      Looking to score?\n\n<b>                                BONES\n</b>                      Unh-unh, little brother.  I got a natural\n                      high.  A supernatural high.\n\n<b>                                STANK\n</b>                      Hey, Eddie Mack don't like no wackos on\n                      his street.  Go be Rain Man on some other\n                      bitch's block.\n\n<b>                                BONES\n</b>                          (sorta singing)\n                      Big Bad Eddie Mack?  Got shit for brains\n                      and that's a fack.  Hey-heh...\n\n<b>                                WEAZE\n</b>                      Yeah.  But he got a baaaad coat.  Whataya\n                      say, bro?  I check out your coat?\n\n<b>                                BONES\n</b>                      Sure.  Here it is.\n\n            Suddenly, out from the depths of his shadow, flies the edge\n            of Bones' razor and the blade slashes Stank in the face. \n            Cutting a sideways, smart aleck smile in his cheek.\n\n            Weaze pulls a gun and shoots Bones.  Bones jolts a little as\n            the bullet imbeds itself in his stomach.  But he takes it\n            like a punch and looks up.\n\n<b>                                BONES (CONT'D)\n</b>                      Cut that shit out.\n\n            He grabs one of the boys in each long hand and hoists them up\n            to his height and pins them against the wall.\n\n<b>                                BONES (CONT'D)\n</b>                      You tell my old friend Mackie, I'll be\n                      seeing him.  Soon.  Real soon.\n\n<b>                                STANK\n</b>                      Wh-wh-whooo?\n\n<b>                                BONES\n</b>                      Bones.\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            INT. PEARL'S PARLOR - NIGHT\n</b>\n            Pearl sits alone, drinking.  Maybe crying a little.  Her\n            hands shuffle large tarot cards.  She lays her own spread. \n            First card face down.  Second card face up.\n\n<b>            THE LOVERS.\n</b>\n            And across it the third is laid: the crumbling Tower.\n\n            Then she slips the first card, the down-turned card out and\n            flips it face up.  Death.  Suddenly a long black shadow falls\n            over the table.\n\n<b>                                PEARL\n</b>                          (without looking up)\n                      Welcome back, lover.\n\n            She finally looks up at him.\n\n<b>                                PEARL (CONT'D)\n</b>                      Not so bad.  You're not quite him.  But\n                      you're not the shaggy demon I expected,\n                      neither.\n\n            His face quivers and we see from his POV:\n\n            Pearl - then and now.  Again, then and now.\n\n<b>                                PEARL (CONT'D)\n</b>                      You look confused.  The dead often are. \n                      'Course, so are the living.  Take me.  I\n                      been confused a long time.  Least twenty\n                      years.  Maybe if I hadn'ta walked in at\n                      that moment.  Or maybe if I hadn'ta let\n                      you go at all.  I figure one way or the\n                      other, I killed you.  So it's only fair:\n                      kill me, lover.  I don't mind.  I'll even\n                      help you.  The way you helped me.\n\n            She grabs his hand, tries to stab herself with his razor. \n            But he resists.  Pulls his arm free.\n\n<b>                                PEARL (CONT'D)\n</b>                      No?  That mean there's something more\n                      left of you than just that hungry spirit? \n                      What are you going to do now?  Kill us? \n                      Kill us all?\n\n<b>                                BONES\n</b>                      No.  Not...not you.  You I forgive.\n\n            She hurls herself at him.  Slapping him.  Slamming her fists\n            against his shadowy chest.\n\n<b>                                PEARL\n</b>                      Forgive me?  The hell with you, Jimmy. \n                      Cause I don't forgive you, I don't\n                      forgive you for dying.  And for being so\n                      goddamn stubborn.  Or for haunting my\n                      dreams.  And I don't forgive you for\n                      anything you're about to do.\n\n            He looks down at her.  His face wavering between the true\n            face of Jimmy Bones and the angry Bones ready to kill her.\n\n            Then he wraps his arms around her and they kiss.  She faints,\n            the cards in her fist fluttering to the floor.\n\n            He lays her gently down.  When suddenly Cinnabar throws the\n            door open.\n\n            She and Bones make eye contact.  She sets eyes for the first\n            time on the father she's never known.  And in the blink of\n            her eye, he's gone.  She runs to where her mom lies on the\n            floor.\n\n<b>            EXT. BLACK CAT POOL CLUB - NIGHT\n</b>\n            Stank and Weaze with Eddie Mack, who's getting a manicure\n            from a coke whore.\n\n<b>                                MACK\n</b>                      You boys been hitting the pipe?\n\n<b>                                WEAZE\n</b>                      No, Eddie.  It's just that, I dunno.  He\n                      was tall, and thin, and like a shadow,\n                      his face was just a blur.  All I remember\n                      is the voice.  It was smooth and low and\n                      it didn't seem to be comin' out of his\n                      mouth.\n\n<b>                                MACK\n</b>                      Then how'd you hear it, fool?\n\n<b>                                WEAZE\n</b>                      It was just like in my head.\n\n<b>                                MACK\n</b>                      Maybe I oughta open a couple holes in\n                      that head and let all them voices out. \n                      You'll feel better, I promise.\n\n<b>                                STANK\n</b>                      No, Eddie, man.  Wait.\n\n            But he's not about to shoot him.  He leans over and snorts a\n            line of white powder off the mirrored tray.\n\n<b>                                MACK\n</b>                      I told you not to lie to me.  Now what\n                      the hell happened?\n\n<b>                                COKE WHORE\n</b>                          (needs a hit)\n                      What about me, baby?\n\n<b>                                MACK\n</b>                      Shutup, bitch.  Now what, he just said to\n                      tell you what?  He was back?  Who was\n                      back?\n\n<b>                                STANK\n</b>                      Bones.\n\n            At the very sound of the name, Mack freezes.  Then with\n            sudden coke-fueled ferocity, he whips around and starts\n            smacking the shit out of Stank, breaking his nose.  The coke\n            whore cheering Eddie on.  Wanting to see more action.\n\n<b>                                MACK\n</b>                      Bones?  What the fuck is that supposed to\n                      mean?  Get the fuck out of here.  Both of\n                      you, 'fore you hear my voice up in yo'\n                      head.\n\n<b>            INT. PEARL'S STOREFRONT - NIGHT\n</b>\n            Cinnabar pours some bourbon into a coke for her mother.  But\n            Pearl just grabs the bottle and takes a straight hit.\n\n<b>                                PEARL\n</b>                      He'll kill them.  He'll kill every last\n                      one of them.\n\n<b>                                CINNABAR\n</b>                      Who?\n\n<b>                                PEARL\n</b>                      Eddie Mack, that cop.  And Jeremiah.  And\n                      even when he's done, who knows.  He won't\n                      be satisfied.  Just like that demon dog. \n                      Feed it, and it just grows hungrier. \n                      Feed his hunger for revenge - he just\n                      wants more.  Who knows where it'll stop. \n                      That kind of hunger ain't never\n                      satisfied. \n\n<b>                                CINNABAR\n</b>                      Aren't you gonna do something about it?\n\n<b>                                PEARL\n</b>                      Like what?  I got a little power, sure. \n                      A touch of the shining, a little of the\n                      sight.  But no more than you do.  We're\n                      not witches.  I can't wiggle my nose or\n                      say a magic word and make him go away. \n                      Besides, maybe they deserve it.  Maybe we\n                      all do.\n\n<b>                                CINNABAR\n</b>                      I don't.  Patrick doesn't.  And his\n                      brother and sister don't.  And they're in\n                      the house with him.\n\n<b>                                PEARL\n</b>                          (long beat)\n                      Fine.  Maybe I got nothing to lose. \n                      'Cept you.\n\n<b>            INT. BLACK CAT POOL CLUB - NIGHT\n</b>\n            The lights are low and only the glow of the jukebox and the\n            sounds of Harold Melvin and the Bluenotes as Mack and his\n            manicurist get down on the pooltable, beside an ornate mirror\n            laden with two gold '45s and an ounce of cocaine.  Which they\n            are both doing to excess.\n\n            Mack's wearing nothing but a black hat and black satin briefs\n            (not a pretty sight).  Working now on her blouse.\n\n<b>                                MACK\n</b>                      Bones, my ass.\n                          (sings while unbuttoning the\n                           manicurist's blouse)\n                      \"...if you don't believe he's laid to\n                      rest/You count the holes in his\n                      motherfucking chest...\"\n\n            She laughs and gets up.\n\n<b>                                COKE WHORE\n</b>                      That tickles.  I want to hear that again.\n\n            He watches her sashay to the other room where the juke box\n            is.  Then bends over the mirror to do a new line.\n\n            From the other room, the song changes.  A deep menacing\n            rolling funk number.\n\n<b>                                MACK\n</b>                      That's it, baby.  Gimme the rolling bass\n                      and I'll tickle your tweeter all night\n                      long...\n\n<b>            INT. CLUBROOM - CONTINUOUS\n</b>\n            \"Baby's\" standing wide-eyed next to the jukebox, staring at\n            Bones, his razor pressed against her quivering lips.\n\n<b>            INT. BLACK CAT POOL CLUB - CONTINUOUS\n</b>\n            Mack's wondering where she is.\n\n<b>                                MACK\n</b>                      C'mon, baby!\n\n            He walks doing a little funky Rufus Thomas shuffle to the\n            music.  He steps into the club room.  It's dark, lit only by\n            the jukebox.  But it's empty.\n\n<b>                                MACK (CONT'D)\n</b>                      Bitch.  Nobody walks out on Eddie Mack.\n\n            Then he sees something.  Her legs on the floor, sticking out\n            behind the jukebox.  He walks towards her, slowly...\n\n            Then sees the deepening pool of blood pouring across the\n            floor right towards him.  Whatever happened to her, she's\n            beyond his help now.\n\n<b>                                MACK (CONT'D)\n</b>                      Muthafucka!\n\n            He whips around but can't see anyone.  He strides defiantly\n            back into the pool room.\n\n<b>                                MACK (CONT'D)\n</b>                      C'mon.  I take you all on.\n\n            Mack picks up the two gold plated revolvers off the mirror\n            with coke on it.  Suddenly all the coke moves on its own. \n            The many grams piled there, all merge into one pile.\n\n<b>                                MACK (CONT'D)\n</b>                      What the...?\n\n            He bends down to check it out.  And the coke actually flies\n            straight up off the mirror with the force of a punch and\n            shoots like a fire hose straight up his nose.\n\n            He reels back, choking.  Coughing.  After having probably an\n            ounce fly straight up his snot-locker.  Blood pouring out his\n            nose.  Wobbly now.\n\n            He hears a low echoing laughter through the club, and the\n            sound of the cue ball breaking and sending pool balls\n            spinning 'round the table.\n\n<b>                                MACK (CONT'D)\n</b>                      Who's there?\n\n            Bones stands by the pool table, under the overhanging light. \n            He pulls out his razor and with one savage slice, splinters\n            the pool cue in two.\n\n<b>                                MACK (CONT'D)\n</b>                      Bones?  Jimmy Bones?  That you?  You're\n                      dead.  I killed you and I stuck your dead\n                      ass in a hole in the ground wrapped in\n                      nothing but your bitch's bloody rags. \n                      Now I'll count the holes in your\n                      muthafuckin' chest.  And I'll add a few\n                      more.\n\n            He fires both guns at Bones, while backing away.  Bones don't\n            feel a thing.  He just picks up the mirror and holds it up\n            facing Mack.\n\n<b>                                BONES\n</b>                      This it?  Your big-ass tidal wave.\n\n            Mack sees his own terrified face staring back from the\n            mirror, belling hanging over his briefs, coke and blood\n            clotted on his face.\n\n<b>                                BONES (CONT'D)\n</b>                      Look like the wave's long gone and\n                      nothing but oil scum, dead fish, and yo'\n                      ugly ass left on the beach.\n\n            Mack shoots wildly at Bones.  At the mirror - blasting it\n            into shards.\n\n            But Bones stands unscathed.  And the shards of broken mirror\n            do not fall to the ground.  They remain in the air, forming a\n            living room swarm of razor sharp glass.\n\n            Mack turns and runs, waaaaay too fucking late, as the swarm\n            of glass shards fly like angry wasps right at him\n\n            Eddie's thrown forward by the sheer force of them, and is\n            skewered throughout his body by all the glass fragments. \n            Pinned -- face mashed against the wall.\n\n<b>                                BONES (CONT'D)\n</b>                          (Mack's voice)\n                      \"I'm taking a five dollar kick in the\n                      head that's a quick ticket to heaven.\"\n\n            Mack pinned to the wall.  Bleeding from everywhere.  Snot\n            blood-coke mess drips out his nose.  Bones pulls Mack's head\n            back by his hair and slides his razor into the half inch\n            between his Adam's apple and the wall.\n\n            As the juke box changes song, we hear a liquid slice and a\n            scream slip into a gurgle.\n\n            Bones' long hands drip blood as he ties something to his\n            belt.  We don't quite see what it is, not until we catch the\n            sight of Eddie Mack's headless remains pinned to the wall.\n\n<b>            INT. POLICE STATION - NIGHT\n</b>\n            Lupovich is at his desk, finishing off a huge Polish sausage. \n            Talking on the phone.  A cop named SAL is nearby, tidying up.\n\n<b>                                LUPOVICH\n</b>                      I know it.  The old slaughterhouse.\n                          (hangs up)\n                      Hey, Sal.  That little weasel we popped\n                      today?  He's got something for us.  I\n                      knew he would once he thought about it.\n\n<b>                                SAL\n</b>                      Shit, that was fast.\n\n<b>                                LUPOVICH\n</b>                      12-year olds.  They scare easy.  Anyway,\n                      he's gonna tip their stash.  Come with\n                      me.\n\n<b>                                SAL\n</b>                      I'm on my way home.  Can you handle it\n                      yourself?\n\n<b>                                LUPOVICH\n</b>                      Oh, no.  Please don't make me go by\n                      myself.  I'm scaaaaaaaaaared.\n\n<b>                                SAL\n</b>                      Fuckin' comedian.  See you tomorrow.\n\n<b>            EXT. ALLWAY - NIGHT\n</b>\n            Bones walks the night with a slicing stride.  His legs\n            stretching too far and somehow covering long distance in an\n            instant.  And in slo-motion, like a nightmare, marionette, a\n            walking shadow, or some great black grasshopper.\n\n<b>                                MACK'S SEVERED HEAD (O.S.)\n</b>                          (as if swinging back and forth)\n                      Bones!  Bones, you muthafuckah!  What the\n                      hell you done to me?\n\n            Bones stops for a moment and looks down at his waist and we\n            see Mack's severed head tied to Bones' belt.  Severed, yet\n            seemingly alive.\n\n<b>                                BONES\n</b>                      Not half what I'm planning on...\n\n<b>                                MACK'S SEVERED HEAD\n</b>                      This some sick fucked up shit.  What you\n                      want with my head?\n\n<b>                                BONES\n</b>                      Just using it to carry your soul.\n\n<b>                                MACK'S SEVERED HEAD\n</b>                      My soul?  Fuck you.  Look, I killed you. \n                      You killed me.  Fine.  Now...\n\n            Bones got no time to argue.  He bends and picks up a handful\n            of fetid city garbage.\n\n<b>                                MACK'S SEVERED HEAD (CONT'D)\n</b>                      ...we're even.  No need to get all meta\n                      fucking-phys-i-gack...\n\n            And shoves it into the still talking mouth of Mack.\n\n<b>            EXT. SOUTHWEST SIDE - NIGHT\n</b>\n            Bright, loud summer night.  Blues coming from inside a blues\n            bar, the guy playing \"Killin' Floor\".\n\n            Lupovich heads toward the Armor building.  From a distance,\n            he sees a young runner emerge from a passage on the farside \n            of the building then set off to meet his mark.  Lupovich\n            heads for the passage, the music following him.\n\n            Lupovich looks around to make sure no one is watching.  Then\n            slips into a passageway leading to the old slaughterhouse.\n\n            A scary walk through inky darkness, scattered with broken\n            glass and scurrying rats and lit only by the eerie red light\n            spilling like blood out of the open door into the old\n            slaughterhouse at the end of the way.\n\n            Lupovich reaches the back, right next to the old loading dock\n            where the still-livestock were unloaded.  He enters the door,\n            disappearing into the red darkness.\n\n<b>            INT. SLAUGHTERHOUSE BUILDING - CONTINUOUS\n</b>\n            The room, large and open, soaked in the sodium vapor that\n            streams through the tall windows from the streetlights.\n\n            There are a few blood rusted meat hooks still there, backlit,\n            hanging from the ceiling.  Graffiti covers the walls with\n            arcane tags and symbols.  The floors are caked with a sticky\n            grime turned black in the orange haze.\n\n            In the far corner burn three red votive candles.  Behind the\n            candles lies a crumpled brown paper bag.  The stash.\n\n            Lupovich starts over to the corner, twitching at the gross\n            sound of his shoes sticking to the layers of old coagulated\n            blood on the killing floor.\n\n            Behind him, framed for an instant int he doorway - a tall,\n            sharp shadow, a walking razor - Bones!\n\n            The walk is tense.  Somehow the music has followed him here\n            and is echoing and wailing in the walls around him.  He gets\n            to the corner, and reaching over the candles, opens the top\n            of the paper bag.  Jackpot.  Five ziplocks of the rocks.\n\n            He hears a noise.  Lupovich fumbles for his gun and at the\n            same time reaches to snatch the stash bag.  His wrist touches\n            the candles flame and it burns.\n\n<b>                                LUPOVICH\n</b>                      Shit!  Fuck!\n\n            He hears another noise, a blade scraping on concrete, right\n            behind him.  Now the music blends with the echoing squeals of\n            the hogs once butchered on the cutting line.\n\n            Lupovich hears another noise, a blade scraping on concrete,\n            right behind him.  Now the music blends with the echoing\n            squeals of the hogs once butchered on the cutting line.\n\n            Lupovich turns and there, towering over him, stands Bones. \n            And just as startling, there's Mack's laughing severed head\n            swinging from his belt.\n\n            Lupovich can only choke on his terror, and while his mouth is\n            open, Bones shoves a glass pipe into it.\n\n            Brandishing his razor, Bones packs a rock into the bowl and\n            torches it.  He holds the razor to Lupovich's throat.\n\n<b>                                BONES\n</b>                          (in Mack's voice)\n                      \"Just try it...go ahead...it won't kill\n                      you.\"\n\n            Lupovich, trembling, takes a massive hit of the crack deep\n            into his lungs.  The music and the sounds of the dying pigs\n            attack him as the coke fills his lungs and then his blood and\n            then his brain, his eyes starting to bug.\n\n            Bones then knocks the pipe from his lips and seals his hand\n            over Lupovich's mouth and nose.  He can't exhale.  The sounds\n            get louder, the grafted walls come alive.\n\n            Bones removes his hand revealing Lupovich's nose is fused\n            shut, and his mouth is simply gone, the skin flat where the\n            mouth used to be.\n\n            Lupovich's gotta lung full of crack, and no way to exhale. \n            Severed Mack laughs insanely as he sees Lupovich's eyes bulge\n            as his lungs start to strain under the agony.\n\n            His frenzied suffocation is nothing but pure torture.  While\n            he is still kicking with the fear and the drug rush, Bones\n            drags Lupovich to the middle of the room.\n\n            With one arm, Bones lifts the fat cop up and hooks him to one\n            of the meat hooks above.\n\n<b>                                BONES (CONT'D)\n</b>                          (in Lupovich's voice)\n                      \"I ain't gonna be the only one with this\n                      nigger's blood on my hands...\"\n\n            As Lupovich squirms, Bones takes his blade, and shoves it in\n            just below Lupovich's sternum.  And a spray of blood paints\n            Bones and Mack's hanging head.\n\n            Thick crack smoke emerges from the wound and floats, foglike,\n            out of the chest cavity.  Bones then yanks the blade\n            southward and slices the cop's belly wide open.\n\n            We hear Lupovich's guts spill out on the floor.\n\n<b>                                MACK'S SEVERED HEAD\n</b>                      Was that really necessary?  Can you wipe\n                      my fucking face?  I can't see a goddamned\n                      thing.\n\n            The dope smoke wafts in the room four feet off the floor. \n            The song immolates itself.  Blood drips.  And Bones adds\n            another weight to his belt.\n\n<b>            EXT. ROSSMORE PARK - NIGHT\n</b>\n            Just round the corner from the entrance to the gated suburb. \n            Cinnabar and Pearl.  On foot.\n\n<b>                                PEARL\n</b>                      We'll have to sneak in.\n\n<b>                                CINNABAR\n</b>                      No we won't, Momma.  I'll just have them\n                      call and tell Patrick it's us.\n\n<b>                                PEARL\n</b>                      Girl, they build gates like that to keep\n                      people like us out.\n\n            Cinnabar walks up to the guard at the gate.  He picks up the\n            phone to check.\n\n<b>            INT. PEET HOUSE - CONTINUOUS\n</b>\n            Phone rings.  Patrick grabs it.  But his father's already on\n            the other end.\n\n<b>                                GUARD\n</b>                          (on phone)\n                      A young lady to see you.  A Miss\n                      Vaughn...\n\n<b>                                JEREMIAH\n</b>                      No.  Sorry.  Send her away.\n\n<b>            EXT. ROSSMORE GATE - CONTINUOUS\n</b>\n            The rent-a-cop hangs up the phone and shakes his head.\n\n<b>                                GUARD\n</b>                      Sorry Miss.\n\n<b>                                CINNABAR\n</b>                      Can't I call?  And talk to them.\n\n<b>                                GUARD\n</b>                      Sure.  But not from here.  Nearest public\n                      phone would be back a few miles.  Outside\n                      the mall.\n\n            Cinnabar sees it's useless to argue and walks away.  Shocked\n            and hurt.  Back to where her mother stands in the shadows\n            outside the gates.\n\n<b>                                PEARL\n</b>                      Told you so.  Alright.  We tried.  Let's\n                      go home.\n\n<b>                                CINNABAR\n</b>                      Mother!  No.\n\n            Hear a voice from the other side of the gate.\n\n<b>                                PATRICK\n</b>                      Cinnabar?  Walk around the north side. \n                      There's an opening there.\n\n<b>            EXT. MAIN GATE - CONTINUOUS\n</b>\n            As they sneak around the other side, a dark figure steps\n            right up to the main gates.\n\n            The rent-a-cop wakes up fast when he sees Bones standing in\n            front of him. \n            After all, how often does he come face to face with\n            everything he is there to keep out?  He hitches his belt in\n            best John Wayne style.\n\n<b>                                GUARD\n</b>                      Can I help y--\n\n            ...but then he notices the two-severed heads swinging from\n            Bones' belt.  All three of them smile.\n\n<b>                                MACK'S SEVERED HEAD\n</b>                      Can Jeremiah come out and play?\n\n<b>            EXT. NORTH WOODED SIDE - CONTINUOUS\n</b>\n            The other outer edge of the sub-development.  Patrick leads\n            them in through some bushes and behind some of the pipe and\n            power systems of the subdivision.\n\n<b>                                CINNABAR\n</b>                      Why couldn't you just tell him to let us\n                      in?\n\n<b>                                PATRICK\n</b>                      My old man calls the shots.  He built\n                      that gate and these damn walls.\n\n<b>                                PEARL\n</b>                          (to Cinnabar)\n                      You sure we oughta save him?  Why not\n                      just let see how safe his gates and walls\n                      keep him when his past comes calling?\n\n<b>                                PATRICK\n</b>                      Save him?  What are you talking about?\n\n<b>            INT. JEREMIAH'S STUDY - CONTINUOUS\n</b>\n            Jeremiah locks the door to his study.  Then he pulls out the\n            stack he hid on his desk.  A dusty manila envelope.  Inside\n            photos: the old days.  His first wife.  His first life.  Back\n            in the old neighborhood.  Him and his best friend Jimmy Bones\n            as children, teenagers and as adults.\n\n<b>                                BONES (O.S.)\n</b>                      Hey, brotha!  What it is?\n\n            And Bones stands right behind him.  Severed heads hanging\n            from his belt.\n\n<b>                                BONES (CONT'D)\n</b>                      What it will be.\n\n<b>                                JEREMIAH\n</b>                      How did you get in here?\n\n<b>                                BONES\n</b>                      Time like this, is that what you really\n                      want to know?  How I got the fuck in\n                      here?\n\n<b>            EXT. MAIN GATE - CONTINUOUS\n</b>\n            A car drives up to the gate.  But no guard comes out to check\n            it out.  The driver of the car honks.  But no response.\n\n            Just the aimless squawk of the radio in the booth.  Can't\n            really see into the tooth.  The windows are splattered and\n            obscured by deep red stains.\n\n<b>            INT. PEET HOUSE - CONTINUOUS\n</b>\n            Patrick runs in with Cinnabar and pearl, past a startled\n            Nancy.\n\n<b>                                PATRICK\n</b>                      Where's Dad?\n\n<b>                                NANCY\n</b>                      His study.  Who're your friends?\n\n            But they run right past.  Though Pearl gives a kind of half\n            wave 'hi-hello.'\n\n            Patrick runs down the hall to his father's study.  The door's\n            locked.  From the inside, he pounds on it.\n\n<b>                                PATRICK\n</b>                      Dad?  Open up.  Dad??\n\n            Bill and Tia stick their heads out to see what all the racket\n            is.\n\n<b>                                PATRICK (CONT'D)\n</b>                      C'mon.  We got to get in there.\n\n            Bill and Patrick slam against the door.  Finally it gives way\n            and they both tumble through the broken door into the room.\n\n<b>            INT. JEREMIAH'S STUDY - CONTINUOUS\n</b>\n            But it's empty.  Jeremiah's not there.\n\n<b>            EXT. BONES' BUILDING - NIGHT\n</b>\n            A strange, greenish fog up and down the street emanating from\n            the burnt out shell of the building.\n\n<b>            INT. BONES' BUILDING - CONTINUOUS\n</b>\n            High in the center, where the master bedroom once was, we see\n            a kind of mirage forming.  Another image of the room still\n            there, vaguely, luminescent in the night.\n\n<b>            INT. PEET HOUSE - CONTINUOUS\n</b>\n            They're in shock. \n\n<b>                                BILL\n</b>                      We can't go back there.  Are you crazy? \n                      You saw --\n\n<b>                                PEARL\n</b>                      It's the only way.  It's possible your\n                      father may not be dead yet.\n\n            They look around at the mess in the room.  Over turned chair. \n            Signs of struggle.  Spatters of blood.\n\n<b>                                PEARL (CONT'D)\n</b>                      Your father was his best friend.  He\n                      loved Jeremiah.  So he must hate him the\n                      most of all now.  He'll take his time. \n                      But even if it is too late.  If your\n                      father is dead.  It's not over.  The door\n                      has to be closed.\n\n<b>                                BILL\n</b>                      Well, close the fucking door by all\n                      means.  But don't expect me to go down\n                      there and do it.\n\n<b>                                PEARL\n</b>                      I don't.\n\n            She gets up to go.  Cinnabar stands too.\n\n<b>                                PATRICK\n</b>                      You ain't going down there.  Not alone. \n                      I'll go.\n\n<b>                                BILL\n</b>                      Fine.  But I'm bringing a couple of\n                      friends.\n\n            He steps out of the room and comes back with a gun and a\n            knife in a sheath on his belt.\n\n<b>                                PEARL\n</b>                      They won't do you no good.\n\n            Bill with a defiant \"well, it can't hurt\" look.  Nancy\n            appears in the doorway as they hurry out, seeing Bill with\n            the gun in his hand.\n\n<b>                                NANCY\n</b>                      What are you doing?  I've just called the\n                      police and 911.\n\n<b>                                PATRICK\n</b>                      Then we need to get out of here.  We\n                      can't try to explain this to them.  We'll\n                      be back.  Hopefully with Dad.\n\n            Nancy clings to Tia as the rest of them hurry down the hall.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            INT. BONES' BUILDING/NECROPOLIS VERSION - ETERNAL NIGHT\n</b>\n            It is Bones' old bedroom.  The Necropolois version.  The\n            floor, the walls, the furniture, everything in it -- formed\n            out of the wracked and twisted shapes of dead souls.\n\n            This is that same version of the room we've glimpsed before. \n            And it remains, even when the real room has burnt away.\n\n<b>            INT. BONES' BEDROOM - CONTINUOUS\n</b>\n            Bones there in the flesh, with Jeremiah on his knees.  Bones\n            untying the heads from his belt.\n\n<b>                                BONES\n</b>                      You two bitches were just meat, never had\n                      any idea smarter than getting yourself a\n                      little more.  But my brother Jaybird,\n                      here.  He was smart.  He didn't just want\n                      more.  He wanted more with compound\n                      interest.\n\n            Bones shoves the screaming severed heads through the undead\n            wall of the Necropolis.\n\n<b>            SEVERED HEADS POV\n</b>\n            For only a flashcut moment, we see the heads see coming at\n            them - reaching for them.  Laughing at them.  The undead.\n\n<b>                                BONES (CONT'D)\n</b>                      Time for him to collect his interest. \n                      Jeremiah's gonna have the unique\n                      experience of seeing his reward, tasting\n                      it while he's still alive.\n\n            Bones wraps his long arm around Jeremiah's neck in a\n            brotherly choke hold.  Jeremiah terrified.\n\n<b>            EXT. LAKE SHORE DRIVE - NIGHT\n</b>\n            Pearl, Cinnabar, Bill and Patrick speed south by car.\n\n<b>                                PEARL\n</b>                      ... see there ain't just two parts to a\n                      person.  There's three.  Body-Soul and\n                      Spirit.  The spirit lives in the blood. \n                      It's the wanting that holds body and soul\n                      together, and sometimes, the wanting\n                      lives on.  Jimmy's blood must still be in\n                      the house.\n\n<b>                                PATRICK\n</b>                      But the place burned to the ground.\n\n<b>                                PEARL\n</b>                      The blood is still there.  We just gotta\n                      figure out where.\n\n<b>                                CINNABAR\n</b>                      In his grave there was a cloth or a dress\n                      or something.  Covered with blood.\n\n<b>                                PEARL\n</b>                      My God.  My dress.  We have to find it. \n                      And burn it.  And shut the door.\n\n            Bill and Patrick look at Pearl like she might be crazy.  Then\n            they see Cinnabar next to her, glaring back at them.\n\n<b>\t\t\tINT. BONES' BEDROOM - CONTINUOUS\n</b>\n            Bones has Jeremiah on his feet now, leading him towards the\n            wall of the undead.\n\n            Suddenly, hands shoot out of the wall, only inches away from\n            Jeremiah's face!  He twists and turns to stay away from them,\n            but the long nails on one of the hands claw at his cheek. \n            While hungry mouths open from the palms of hands.\n\n<b>                                BONES\n</b>                          (keeping Jeremiah out from\n                           hands' reach)\n                      I don't understand it.  You were my Man. \n                      Since we was grasshoppas.  I always\n                      looked after you.  You had a piece of\n                      everything I had.\n\n<b>                                JEREMIAH\n</b>                      I didn't want a piece of yours, I wanted\n                      my own.\n\n<b>                                BONES\n</b>                      And the hell everybody else, right?\n\n            Bones pushing Jeremiah's face towards the grasping hands.\n\n<b>                                JEREMIAH\n</b>                      Wait, Jimmy.  Think about it.  You woulda\n                      done the same thing if you was me.\n\n<b>                                BONES\n</b>                      No brother.  I wouldn'ta.  I never done a\n                      man - any man.  Let alone a brother like\n                      that.  Course, as you can see, no good\n                      deed goes unfucked.  Now the question is,\n                      if the good get fucked, what we got saved\n                      up for the bad?  You about to find out.\n\n            Bones rams Jeremiah's head (his eyes closed in fear) through\n            the Necropolis wall.\n\n<b>            INT. NECROPOLIS WALL - CONTINUOUS\n</b>\n            Jeremiah's head inside now.  Eyes still closed, head bobbing\n            in the jelly-like base that holds what he sees when he dares\n            to open his eyes.\n\n            Hideous malformed faces, genetic anomalies, the kinds of\n            faces that wound up in side-shows in less enlightened times. \n            All laughing and leering and glaring at Jeremiah.\n\n<b>            FULL C.U. - LUPOVICH'S FACE AND HEAD\n</b>\n            The skin peeling away like congealed jelly.  Lupovich tries\n            to talk to Jeremiah or to scream but nothing comes out. \n            Except for a hideous wobbling bubble.\n\n            For a subliminal moment, Jeremiah sees a figure trapped\n            inside the bubble.  His own figure, silently screaming to get\n            out.\n\n<b>            NEW ANGLE\n</b>\n            Suddenly, Jeremiah is screaming for real as Bones has just\n            yanked his head back out of the wall.\n\n<b>                                BONES\n</b>                      It's a trip, ain't it?\n\n            Bones sounding almost sympathetic to Jeremiah.  Almost.\n<b>\t\t\t\n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            EXT. BONES NEIGHBORHOOD - NIGHT\n</b>\n            Suddenly, as they round a corner onto Blackstone, they see\n            tendrils of an eerie greenish fog.  It seems to be emanating\n            from the still smoking remains of Bones' house.  Or perhaps\n            it is just the smoke, tinged only by the gaseous street\n            lights.\n\n<b>                                PEARL\n</b>                      We've got to hurry.  We've got to shut\n                      the door.  They're getting out.\n\n            Then there's a shape and a thump!  The real terror of\n            thinking your car just hit a human being.\n\n            Then a face appears in the car window.  Just a homeless guy\n            shaking an angry fist at them.  Quickly, he's gone in the\n            fog.\n\n            Straining to see, Patrick stops, grabbing a flashlight from\n            his glove box.  They all get out.  Making their way through\n            the fog, glimpsing in darkened doorways, eerie shapes,\n            perhaps more of the dead out of Necropolis.\n\n<b>            EXT. BEHIND THE BUILDING - CONTINUOUS\n</b>\n            They arrive at the back side of the ruined building.\n\n<b>                                PATRICK\n</b>                      There was a storm door, to the cellar.\n\n            They search frantically in the dark amongst the tall weeds\n            abandoned junk and burnt rubble.\n\n<b>            INT. BONES' BEDROOM - CONTINUOUS\n</b>\n            Jeremiah still with Bones, looking for a way out.\n\n<b>                                JEREMIAH\n</b>                      What will it take?  What do you want? \n                      Just tell me, Jimmy!\n\n<b>                                BONES\n</b>                      Aw that's easy.  I want my life back. \n                      Can you swing that, my brother?\n\n<b>                                JEREMIAH\n</b>                      You know I can't.\n\n<b>                                BONES\n</b>                      Then fuck it!!!\n\n            In a righteous fury, Bones headlocks Jeremiah again and rams\n            his head through the Necropolis wall.\n\n<b>            OVER JEREMIAH'S SHOULDER - HIS POV\n</b>\n            As he's back inside face to face with living dead mutations,\n            with Lupovich's head coming at him, it's mouth suddenly\n            opening to ten times its normal size, swallowing Jeremiah\n            whole.\n\n<b>            BACK WITH BONES\n</b>\n            Watching with some pity as the rest of Jeremiah, his legs and\n            feet are pulled into the wall and gone.  Accompanied by the\n            disappearing screams of the last of Jeremiah.\n\n<b>                                BONES (CONT'D)\n</b>                          (sadly)\n                      Dog eat dog, brother.  Dog eat dog.\n\n<b>            EXT. BEHIND THE BUILDING - CONTINUOUS\n</b>\n            They search for the cellar door.  The night air is shattered\n            by a scream, at once very close and infinitely far.  Finally:\n\n<b>                                BILL\n</b>                      Here!\n\n            He's found a chipped gray storm door.  Patrick easily kicks\n            in the rotten wood revealing a dark tunnel of stairs leading\n            down beneath the ruins of the building into the sub-basement.\n\n<b>                                PATRICK\n</b>                      It's not safe down there.  The fire\n                      started down there.  The whole thing\n                      could collapse.\n\n<b>                                PEARL\n</b>                      Then your father's a dead man and Jimmy\n                      Bones is gonna be around a long time.\n\n            Patrick steps down into the darkness of the cellar, his\n            flashlight on.\n\n<b>            INT. STORM CELLAR - CONTINUOUS\n</b>\n            The group stoops low as they descend the stairs.  Beneath\n            wood supports, the dirt is reclaiming it, already a constant\n            trickle of dirty falling from between the boards.\n\n            In the dim, Patrick leads them, walking through a mass of\n            spider infested webs and, just ahead, is the sub-basement\n            where they originally found the body.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            Throwing debris aside, they come next through a small door at\n            the bottom of the stairs and enter the sub-basement.  Nearby\n            is the elevator shaft, a gaping hole in the ruins - but\n            recognizable as such.  The ceiling above them is nearly\n            collapsed, and over most of the room, the accumulated debris\n            and ruin from above has simply fallen through.\n\n            And what remains of the ceiling is still shifting, groaning,\n            coming apart.\n\n            Patrick shines his flashlight down to the ground, until:\n\n<b>                                PATRICK\n</b>                      Here.\n\n            He's found the hole that was Bones' hastily dug grave, but\n            there's nothing in it now but swarming white maggots.\n\n<b>                                PEARL\n</b>                      Is it there?\n\n            She gets down on her hands and knees as Patrick shines the\n            light, but after a few frantic moments of digging, it's\n            clear:\n\n<b>                                PEARL (CONT'D)\n</b>                      It's gone.  He got it.\n\n            Just then the sound of tremendous strain and creaking of\n            wood.  And the ceiling starts to give way.  They all scramble\n            for shelter, and then it gives way completely -- completely\n            blocking their way out.  They're trapped.\n\n<b>                                BILL\n</b><b>                      NO!!!!!!\n</b>\n            They all look in every direction for some glimpse of hope -\n            of a way out.  There is none.  Then they hear behind them: a\n            resonant \"DING!\"\n\n<b>            TURNING - THEIR POV\n</b>\n            Where moments before there was a gaping, ruined elevator\n            shaft, there is now a fully functioning elevator just as it\n            was in 1979, the doors opening to them in eerie slo-mo.\n\n            Pearl starts towards the open car.  The others trying to hold\n            her back.\n\n<b>                                PEARL\n</b>                      It's alright.  Let me.\n\n            She walks closer, peering into the dark recesses of the\n            elevator.  Maybe again a flash of visible movement inside.\n\n            Closer ever closer, until Pearl, almost entranced, steps in. \n            And once inside, there's no one, or no thing, there.  Pearl\n            is about to tell them \"It's okay...\" when suddenly the doors\n            of the elevator slide-slam shut.\n\n<b>                                CINNABAR\n</b>                      Mama!!!!!\n\n            Then they hear the elevator chain start to move and the\n            elevator starts to rise.  Cinnabar screaming louder.\n\n<b>            INT. THE ELEVATOR - CONTINUOUS\n</b>\n            Pearl stands there, summoning all her courage for what she\n            knows she's going to have to face.  Watching the elevator\n            arrow as it climbs to the number three.\n\n<b>            INT. SUB-BASEMENT - CONTINUOUS\n</b>\n            Patrick and Bill beat on the door and try to pry it open. \n            Then they try jamming jagged boards into the opening, but\n            still to no avail.\n\n<b>            PEARL'S POV\n</b>\n            As a moment later, the car stops and the doors open onto:\n\n<b>            INT. BONES' PAD - CONTINUOUS\n</b>\n            Down to the last detail, exactly as it was 22 years ago, the\n            night Bones died.  Music playing (the Delfonics \"Didn't I\n            Blow Your Mind This Time...\")  The only new detail are the\n            dozens of candles romantically burning everywhere.\n\n<b>                                BONES (O.S.)\n</b>                      Hey, baby.\n\n            Pearl feels a soft touch on the back of her neck and spins,\n            finds Jimmy right behind, almost nuzzling her.  His face\n            hidden, though, in darkness.  Holding something in his hand,\n            behind his back.\n\n<b>                                PEARL \n</b>                          (still with her back to him)\n                      Jimmy, you've got --\n\n<b>                                BONES\n</b>                      I've got what I want.  Turn around baby,\n                      look at me.  Look at your man.\n\n            She turns slowly, and we don't know what to expect. \n            Something horrible or something beautiful.\n\n            Finally, she's face to face, and it's Jimmy just as he was,\n            22 years ago.  All traces of the demonic are gone.  Pearl\n            melts as the Delfonics swell, Jimmy holding her close.\n\n<b>                                BONES (CONT'D)\n</b>                      I want you to do something for me, baby.\n\n<b>                                PEARL\n</b>                      What?\n\n            We see what he's holding: the dress.  Rotted and blood\n            clotted and ruined.\n\n<b>                                BONES\n</b>                      I always loved you in this dress.\n\n            He holds it up for Pearl to see and from:\n\n<b>            HER POV\n</b>\n            The dress is brand new and beautiful.  She's finally\n            entranced.\n\n<b>            INT. THE SUB-BASEMENT - CONTINUOUS\n</b>\n            Patrick, Bill and Cinnabar have managed now to pry open the\n            elevators outer doors.  They step inside on the soft ashen\n            ground and look up:\n\n<b>            THEIR POV\n</b>\n            The shaft goes all the way into eternity.  But along the\n            tacked walls, they see hand and footholds put there for\n            workers.\n\n<b>                                PATRICK\n</b>                      We can climb out.\n\n<b>                                BILL\n</b>                      Climb out to where?\n\n<b>                                PATRICK\n</b>                      Anywhere but here.\n\n            One by one they start to climb, Bill first.  As they climb,\n            they become aware of light on the first floor level just\n            ahead.\n\n<b>            BACK IN BONES' CRIB\n</b>\n            Pearl steps into the frame to look at herself in a floor\n            length mirror on Bones' closest door.\n\n<b>            PEARL'S POV - IN THE MIRROR\n</b>\n            Not only the dress, but she too looks exactly as she was 22\n            years ago, skin smooth as cocoa butter, eyes free from worry\n            and pain.  \n\n            Roberta Flack's \"Killing Me Softly\" as Jimmy takes her in his\n            arms and starts to slow dance her in the midst of all those\n            candles.\n\n<b>                                PEARL\n</b>                      Where are we, baby?\n\n<b>                                BONES\n</b>                      Where we'll always be...\n\n<b>                                PEARL\n</b>                      But.\n\n<b>                                BONES\n</b>                      Hush, baby.\n\n            Pulls her closer, closer, until her last misgivings are gone. \n            Whatever purpose she came with lost in the power of having\n            the impossible.\n\n<b>            INT. THE ELEVATOR SHAFT - CONTINUOUS\n</b>\n            The three still climbing handhold by handhold, knocking loose\n            dirt in each others' eyes.  Bill is just now reaching the\n            first floor level, trying to force open the outer doors.\n\n            Suddenly, an ominous sound: the chain/mechanism of the\n            elevator as they see it starting to descend towards them. \n            Panicking, Bill tries with all his might.\n\n            As the elevator inches closer and closer --\n\n            Until Bill finally manages to get the doors open.  They all\n            scramble to safety just as the elevator slides by them.\n\n<b>            NEW ANGLE\n</b>\n            After they catch their breath, they look up and around to\n            find themselves -- \n\n<b>            INT. THE NECROPOLIS - CONTINUOUS\n</b>\n            A distorted M.C. Escher-like feel to the place.  Where up\n            seems to be down, down up, and left is right.  Not helped by\n            behind only lit by the eerie flickering gaseous lamps\n            outside, and the moonlight falling through the skylight.\n\n            Then, slowly through the gloom, they begin to perceive that\n            the walls are clotted and congealed, teratomic masses of\n            distorted flesh; faces, limbs, eyes, mouths, all trapped -\n            all contorted in agony.  At first they seem to be frozen in\n            the walls, like the ruins of Herculaneum.  But then we see --\n\n            They are slowly writhing, moving.  Hands grasping, teeth and\n            rotted jaws widening, and worst of all, the eyes staring out.\n\n<b>                                PATRICK\n</b>                      Is this Hell?\n\n<b>                                BILL\n</b>                          (gripping the gun)\n                      Or just Hell-adjacent...\n\n<b>                                CINNABAR\n</b>                      Ain't no Heaven.  Ain't no Hell.  There's\n                      just the world of the dead, my momma\n                      always talked about.  Like she said, the\n                      door is open, and we're seeing right\n                      through our world into this one.  We just\n                      have to remember what was really here. \n                      And follow it.  Those stairs should take\n                      us to the second floor.\n\n            As they approach the stairs they can hear faintly above the\n            drone/moan of the dead, the soft music playing in Bones'\n            crib.\n\n<b>            ANGLE AS\n</b>\n            They start up the stairs into the darkness.  Patrick first,\n            Cinnabar in between him and Bill.  Patrick still holding his\n            flashlight, but it's starting to flicker a little.\n\n            More of the same horror along the stairway walls, eyes\n            looking at them, hands caress Cinnabar's hair, another hand\n            shooting up from the stair floor and grabbing Bill's thigh. \n            Bill stabs the hand with the knife on his belt.  And the\n            hands shoot back down.\n\n<b>            BACK IN BONES' CRIB\n</b>\n            The Munch-like dance of death goes on, Bones stroking the\n            back of her neck.\n\n<b>                                BONES\n</b>                      Just like I told you this morning, I'd be\n                      stroking your neck tonight.\n\n            Pearl absolutely lost.\n\n<b>            BACK ON THE STAIRS\n</b>\n            The three still ascending when Patrick's flashlight suddenly\n            cuts out.  Total darkness.\n\n<b>                                PATRICK\n</b>                      Shit.\n\n            A faint sound: Patrick shaking the flashlight.  Nothing but\n            the sound of breathing, both human and non-human.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Thing worked fine a minute ago. \n                      Batteries were brand new -- \n\n            Then as suddenly as it went out, the flashlight comes back\n            on, illuminating a horrible sight: Maurice.  Standing right\n            there, a few feet in front of them.\n\n<b>                                BILL\n</b>                      Maurice!\n\n            Maurice puts a finger to his lips and beckons them to follow. \n            The boys want it to be Maurice.  But Cinnabar knows better.\n\n<b>                                CINNABAR\n</b>                      That's not Maurice --\n\n            But with the beam of the flickering flashlight, they follow\n            the shadowy figure up the steps.\n\n            Then Maurice gets a bit to far ahead, and they can't see him\n            for a beat.\n\n<b>                                PATRICK\n</b>                      Maurice.  Hold up, man.\n\n            Then after a silent beat, just Maurice's hand appears back\n            out of the darkness, beckoning them onward.  Then the\n            flashlight cuts out again.  They're back in the darkness.\n\n<b>                                PATRICK (CONT'D)\n</b>                          (as he shakes the flashlight)\n                      Okay, we're on the second floor.  I feel\n                      it.  No more steps.\n\n            The sound of Patrick cursing and shaking the batteries around\n            in the torch.  Eventually it comes on again.\n\n            Up ahead, they still barely see Maurice, his back to them,\n            face in one quarter profile, leading them towards the next\n            flight of stairs at the end of the hall.\n\n            They follow.  Closer and closer to the stairs, Maurice going\n            eerily in and out of their vision.  The flashlight dies\n            again.\n\n            Darkness.  Patrick shakes it and it comes back quickly.  Then\n            just as quickly dies again!  A shake and it's lit again --\n            just as Bill is stepping into the corner where Maurice\n            disappeared.\n\n<b>            FLICKERING HORROR\n</b>\n            As the dog leaps at them from the corner, all teeth and\n            slavering jaws!  Everyone scrambles for their lives, and the\n            flashlight falls to the floor.\n\n<b>            LOW ANGLE FROM THE FLOOR - JUST BEHIND THE FLASHLIGHT\n</b>\n            We see the skewed horror: as the dog tears at Bill, as his\n            gun skitters across the floor; as Patrick grabs the gun and\n            fires, and we get a bit more illumination from the exploding\n            gunpowder.  But it does no good.\n\n            Bill screams in terror as he's torn to pieces, and then the\n            flashlight goes out and again, we're in Stygian darkness. \n            The sound of Bill dying and a long silence.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Bill?!  Cinnabar?  Cinnabar?!\n\n            No answer.  At first.  Finally in husky voice:\n\n<b>                                CINNABAR\n</b>                      I'm here.\n\n<b>                                PATRICK\n</b>                      Bill!  Bill?!\n\n<b>                                CINNABAR\n</b>                      Patrick, he's...\n\n<b>                                PATRICK\n</b>                      Okay, okay.  Listen:\n\n            From somewhere comes the sound of the music from Bones' crib.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Here, find my hand.  The stairs are right\n                      near here.  I saw them.  Let's just walk\n                      up there.\n\n<b>                                CINNABAR\n</b>                      I can't find you.\n\n<b>                                PATRICK\n</b>                      Here!\n\n            Silence.  As we expect the worse, expect something else to\n            take her hand.  But then:\n\n<b>                                CINNABAR\n</b>                      Is that you?\n\n            Pause -- the music from Bones' crib still beckons to them.\n\n<b>                                PATRICK\n</b>                      Yeah.  Come on.  Don't let go.\n\n            We're in near total darkness as they climb the stairs, maybe\n            a bit of moonlight now coming in from the roofless third\n            floor they're approaching.  All we can hear is their\n            footsteps and their breathing as they walk the rest of the\n            way up the stairs and emerge into:\n\n<b>            BONES' CRIB - THEIR POV\n</b>\n            Both amazed to see Pearl as young and beautiful as Cinnabar\n            is, clinging to the dashing Jimmy dancing to the spectral\n            sounds of some soul classic from back in the day.  Cinnabar\n            entranced by the vision.\n\n<b>            ANGLE AS\n</b>\n            Pearl opens her dreaming eyes and sees them, smiling and\n            beckoning Cinnabar to come join her.  Cinnabar begins to.\n\n            Patrick watches her until he hears something O.S. calling to\n            him.  It sounds a million miles away and yet right in his\n            ear.  And it sounds like Jeremiah.\n\n<b>                                JEREMIAH\n</b>                      Paaatrick...\n<b>\t\t\t\t\t  \n</b>This portion of the screenplay contains scenes that do not \nappear or occur elsewhere in the final movie.  In order to maintain the \nintegrity of the screenplay, it has not been edited.\n\n<b>            PATRICK'S POV\n</b>\n            He turns and looks at the wall -- subtly surging from beneath\n            the surface of the wall he sees flashes of faces and hands,\n            mouths twisted in torment.  He moves to the wall, drawn by\n            the strange sight and the recurring sound...\n\n<b>                                JEREMIAH (CONT'D)\n</b>                          (as if a million miles away)\n                      Patrick.  Help me.\n\n            It's coming from within the wall. \n\n<b>            INTERCUTTING\n</b>\n            Now, while Cinnabar is advancing towards her mother and\n            father across the room --\n\n            Patrick, at the wall, tries to place his ear near it in order\n            to hear where the voice is coming from.\n\n            While Cinnabar is now within Bones' reach.  Pearl steps back\n            to allow Jimmy to embrace Cinnabar.  They're reunited.\n\n<b>                                BONES\n</b>                      Welcome home, baby girl.\n\n            Pearl watches as Bones caresses his daughter's cheek. \n            Patrick now close to the wall -- trying to hear the faint\n            voice calling to him.\n\n<b>                                JEREMIAH\n</b>                      Please...help me...\n\n<b>                                PATRICK\n</b>                      Dad?\n\n            Suddenly something enormous presses out from the wall. \n            Patrick stumbles back as his father's head and torso press\n            out from the wall, stretched in straining effort.\n\n<b>                                JEREMIAH\n</b>                      Help me.  I'm so sorry.  But please, help\n                      me...\n\n<b>                                PATRICK\n</b>                      Daddy?\n\n            Jeremiah, or what he's become embedded into the wall, his\n            face stretched, mouth huge and hollow eyes dripping bloody\n            tears.\n\n<b>                                JEREMIAH\n</b>                      Please.  Help me.  I'm scared.\n\n            Patrick in anguish.\n\n<b>                                JEREMIAH (CONT'D)\n</b>                      It hurts.  I don't want to spend forever\n                      like this.\n\n            Jeremiah's arm reaches out from the wall, grasping towards\n            Patrick, who reaches out to his father -- \n\n            When suddenly with frightening speed Jeremiah grabs it, and\n            wrenches Patrick to him, pulling Patrick flush up against the\n            wall, even starting to suck him in to the wall.\n\n<b>                                PATRICK\n</b>                      No!!!\n\n            As Patrick struggles and writhes and twists to get free from\n            his father's grasp, he can see back across the room to the\n            others.  He sees the room as it really is - he can see what's\n            really happening.\n\n            Pearl, not in a new dress, but in a horrible tattered, blood\n            encrusted old dress, standing next to a rotting cadaver\n            that's stroking Cinnabar's cheek and holding her close...\n\n            Jeremiah pulling Patrick into the wall, into the Necropolis\n            itself.  Patrick, though, just as concerned with Cinnabar as\n            with himself, yelling at her across the crib.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Cinnabar!  Stop!\n\n            But Cinnabar doesn't even turn her head.  She just steps into\n            her father's embrace.  But Pearl does seem to hear something.\n\n            She looks back at Patrick, beneath the illusion of the room\n            she sees him being pulled into the awful wall, and can hear\n            him more clearly now.\n\n<b>                                PATRICK (CONT'D)\n</b>                      No!  Cinnabar, no!!!!\n\n            Slowly, Pearl turns and looks into the mirror and she gets a\n            full-length view of herself: a woman in ruined tatters of her\n            old, rotted dress.\n\n            Then, coming into her view in the mirror is her only daughter\n            -- dancing with a decayed corpse.\n\n<b>                                PEARL\n</b>                      Noooooo!\n\n            Pearl whirls and rips Cinnabar away from Bones, who at first\n            sort of chuckles to himself.  But he stops laughing when\n            Pearl grabs the nearest candle and presses the flame to her\n            breast.  In a terrible whoosh, the dried old dress and Pearl\n            are engulfed in flames.\n\n<b>                                BONES\n</b><b>                      NOOOOOOOOOO!!!!!\n</b>\n            Bones runs to Pearl and throws his arms around her, trying to\n            smother the flames any way he can.\n\n<b>                                PEARL\n</b>                          (to Patrick and Cinnabar)\n                      Get out!!!  Go!!!\n\n            Cinnabar in a shattered daze on the floor, sees her mother in\n            flames.\n\n            Patrick desperately tries to escape his father's death grip. \n            Finally, with horrible sound, Patrick wrestles free from the\n            wall, and from his father.\n\n            He lurches free from them and makes it over to Cinnabar and\n            drags her out the door just as the room dissolves around\n            them.  As the flames destroy the dress and the last vestiges\n            of Bones' blood on it, the room begins to turn to ash.\n\n            An eerie wind from nowhere begins to howl, blowing the ash\n            and smoke from the dress and from the dissolving walls.\n\n            Cinnabar taking one last glance at the funeral pyre that was\n            her mother and Bones now, too, sees them almost lost in a\n            shroud of flame and ash.\n\n<b>            ANGLE AS\n</b>\n            Patrick and Cinnabar run down the corridor and back down the\n            stairs, the moon overhead and the flames from Bones crib\n            giving everything a flickering hellish cat.\n\n            Everything behind and above them crumbling to dust.  The\n            floor and then the stairs and all the howling bodies trapped\n            inside.  \n\n<b>            ON THE FIRST FLOOR\n</b>\n            They reach the open elevator shaft.\n\n<b>                                PATRICK\n</b>                      We gotta jump!\n\n<b>                                CINNABAR\n</b>                      I can't!\n\n            Everything around them rumbling and crumbling.\n\n<b>                                PATRICK\n</b>                      We have to!\n\n            Patrick jumps and lands in the muddy ashes, dazed but unhurt.\n\n<b>            LOOKING UP\n</b>\n            He sees Cinnabar peering over the edge in fear.  Then, behind\n            her, he can hear a low rumbling growl.  He sees Cinnabar turn\n            and scream --\n\n            Ashes and falling debris then temporarily blind hen he wipes\n            his eyes and looks up, Cinnabar is gone from view.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Cinnabar!  Where are you!?\n\n            He immediately climbs back up the shaft when he sees Cinnabar\n            standing at the edge of the shaft above him.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Cinn!  Jump!!\n\n            And she jumps, landing right next to Patrick, who quickly\n            gets her to her feet.\n\n<b>                                PATRICK (CONT'D)\n</b>                      Let's go!!!\n\n            They run out of the shaft and into the sub-basement just as\n            the elevator and shaft dissolve into ash.\n\n            A hurricane wind blowing down and out of the shaft now. \n            Mixed with the sound of all the screaming, moaning souls in\n            the Necropolis.\n\n            Patrick in a fury to live tears away the boards and debris\n            blocking the exit.  \n\n            He pulls Cinnabar out with him and they walk up the cellar\n            stairs, step into the dawn, weary, beaten down but not dead.\n\n<b>            EXT. BONES' BUILDING - DAY\n</b>\n            They've made it out of the Inferno.  Like Dante said \"Thus we\n            emerged again to see the stars.\"  No stars here, just the\n            glorious dawn.\n\n            Patrick stops, feels the new sun on his face.  Breathes clean\n            air again for the first time.\n\n<b>                                PATRICK\n</b>                      We made it...\n\n            Then from behind or above or somewhere we can hear what might\n            be a low, low chuckle.  Jimmy Bones' chuckle.\n\n<b>                                BONES (O.S.)\n</b>                      Dog eat dog, boy.  Dog eat dog...\n\n            Patrick turns and spins in mounting horror.  There, behind\n            him, right where Cinnabar was standing...\n\n            The black dog.  It leaps right at the camera, filling the\n            frame with huge teeth and bloody red tongue.  WE FREEZE.\n\n<b>                                                          FADE TO BLACK.\n</b><b>\t\t\t\t\t\t\t\t\t\t\t\t\t\t  \n</b><b>\t\t\tEND CREDITS\n</b>\n</pre>\n\n<center><a href=\"index.html\">back</a></center>\n\n\n\n\n<b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Bones</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Adam Simon\" title=\"Scripts by Adam Simon\">Adam Simon</a>  <a href=\"/writer.php?w=Tim Metcalfe\" title=\"Scripts by Tim Metcalfe\">Tim Metcalfe</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Horror\" title=\"Horror Scripts\">Horror</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Bones Script.html#comments\" title=\"Bones comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:00:55.824522"}