{"title": "Bonnie and Clyde", "film_link": "/Movie Scripts/Bonnie and Clyde Script.html", "script_link": "/scripts/Bonnie-and-Clyde.html", "info_raw": "\n\nBonnie and Clyde Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Newman  Robert Benton\nGenres  Crime  Drama  Romance\n\nRead \"Bonnie and Clyde\" Script\n\n\n", "script": "\n\n\n                      \"BONNIE & CLYDE\"\n\n                             by\n\n                David Newman & Robert Benton\n\n\n\n\nFADE IN.\n\nINT. BEDROOM.  CLOSE-UP OF BONNIE PARKER.  DAY\n\nBlonde, somewhat fragile, intelligent in expression.  She is\nputting on make-up with intense concentration and\nappreciation, applying lipstick and eye make-up.  As the\ncamera slowly pulls back from the closeup we see that we\nhave been looking into a mirror.  She is standing before the\nfull-length mirror in her bedroom doing her make-up.  She\noverdoes it in the style of the time: rosebud mouth and so\nforth.  As the film progresses her make-up will be refined\nuntil, at the end, there is none.\n\nThe camera pulls back and continues to move very slowly\nthroughout the first part of this scene.  As the camera\ncontinues to move away, we see, by degrees, that BONNIE is\nnaked.  Her nudity is never blatantly revealed to the\naudience, but implied.  That is, she should be \"covered\" in\nvarious ways from the camera's P.O.V., but the audience must\nbe aware of her exposure to CLYDE later in the scene.  This\nis the only time in the film that she will ever be this\nexposed, in all senses of the word, to the audience.  Her\nattitude and appraisal of herself here are touched with\nnarcissism.\n\nThe bedroom itself is a second-story bedroom in a lower-\nclass frame house in West Dallas, Texas.  The neighborhood\nis low income.  Though the room reveals its shabby\nsurroundings, it also reveals an attempt by BONNIE to fix it\nup.  Small and corny objets d'art are all over the tops of\nthe bureaus, vanity tables, etc. (Little glass figurines and\nporcelain statuettes and the like.)\n\nBONNIE finishes admiring herself.  She walks from the mirror\nand moves slowly across the room, the camera moving with\nher, until she reaches the screened window on the opposite\nwall.  The shade is up.  There are no curtains.  She looks\nout the window, looking down, and the camera looks down with\nher.\n\nEXT. BEDROOM.  BONNIE'S P.O.V.  DAY.\n\nOver her shoulder, we see the driveway leading to the garage\nconnected to the house.  There is an old car parked in the\ndriveway, its windows open.  We see a man walking up the\ndriveway, somewhat furtively.  He is a rather dapper fellow,\ndressed in a dark suit with a vest, a white collar, and a\nstraw boater.  It is CLYDE BARROW.  Obviously, he is about\nto steal the car.  He looks it over, checking around him to\nmake sure no passers-by are coming.  He peers inside the\nfront window to see if the keys are in the ignition.  He\nstudies the dashboard.  BONNIE continues watching, silently.\nFinally she calls out.\n\n                                                            2.\n\n\n                         BONNIE\n            Hey, boy!  What you doin' with my\n            mama's car?\n\nEXT. DRIVEWAY.  DAY.\n\nCLYDE, startled, jumps and looks to see who has caught him.\nObviously frightened, he looks up and his face freezes at\nwhat he sees.\n\nEXT. WINDOW.  CLYDE'S P.O.V.  DAY.\n\nWe now see what he is looking at: at the open window,\nrevealed from the waist up, is the naked BONNIE.  She looks\ndown, an impudent half-smile on her face.  She doesn't move\nor make any attempt to cover herself.\n\nEXT. CLOSE-UP OF CLYDE - DAY -\n\n-- whose face changes from astonishment to an answering\nsmile of impudence.  (Seeing what he has, he realizes that\nthis girl is clearly not going to scream for the police.\nAlready they are in a little game instigated by BONNIE,\nsizing each other up, competing in a kind of playful\narrogance.  Before they speak, they have become\ncoconspirators.)\n\nClose-up of BONNIE, still smiling.  Finally she speaks.\n\n                         BONNIE\n            Wait there!\n\nINT. BEDROOM.  DAY.\n\nRunning from the window, she flings open a closet and grabs\na dress, and shoes.  She slips on the shoes, and flings the\ndress on, running out the door as she does.  The camera\ntracks with her, moving as fast.  As she runs down the\nstairs she buttons up the dress.\n\nEXT. DRIVEWAY.  DAY.\n\nShe flies out the door, slamming it behind her, runs off the\nporch (all this has been one continuous movement since she\nleft the window, in great haste) and continues quickly into\nthe driveway.  Four feet away from CLYDE, she stops on a\ndime.  They stand there, looking at each other, smiling the\nsame challenge.  For a few seconds, no one speaks, then:\n\n                         BONNIE\n                   (putting her on)\n            Ain't you ashamed?  Tryin' to steal\n            an old lady's automobile.\n\n                                                            3.\n\n\n                         CLYDE\n                   (with the same put-on)\n            I been thinkin' about buyin' me one.\n\n                         BONNIE\n            Bull.  You ain't got money for\n            dinner, let alone buy no car.\n\n                         CLYDE\n                   (still the battle of\n                   wits going on)\n            Now I got enough money for cokes,\n            and since it don't look like you're\n            gonna invite me inside--\n\n                         BONNIE\n            You'd steal the dining room table\n            if I did.\n\n                         CLYDE\n                   (he moves from his spot)\n            Come to town with me, then.  How'd\n            that be?\n\n                         BONNIE\n                   (starting to walk\n                   onto the sidewalk)\n            Goin' to work anyway.\n\nEXT. STREET.  MOVING SHOT.  DAY.\n\nThe camera tracks.  It is a hot Texas afternoon, all white\nlight and glare.  As they walk the block to town in this\nscene, their manner of mutual impudence is still pervading.\n\n                         CLYDE\n            Goin' to work, huh?  What do you do?\n\n                         BONNIE\n            None of your business.\n\n                         CLYDE\n                   (pretending to give\n                   it serious thought)\n            I bet you're a...movie star!\n                   (thinks)\n            No...A lady mechanic?...No...A\n            maid?--\n\n                         BONNIE\n                   (really offended by that)\n            What do you think I am?\n\n                                                            4.\n\n\n                         CLYDE\n                   (right on the nose)\n            A waitress.\n\n                         BONNIE\n                   (slightly startled by\n                   his accuracy, anxious\n                   to get back now that\n                   he is temporarily\n                   one-up)\n            What line of work are you in?  When\n            you're not stealin' cars?\n\n                         CLYDE\n                   (mysteriously)\n            I tell you, I'm lookin' for suitable\n            employment right at the moment.\n\n                         BONNIE\n            What did you do before?\n\n                         CLYDE\n                   (coolly, knowing its effect)\n            I was in State Prison.\n\n                         BONNIE\n            State Prison?\n                   (she shows her surprise)\n\n\n                         CLYDE\n            Yeah.\n\n                         BONNIE\n                   (herself again)\n            Guess some little old lady wasn't\n            so nice.\n\n                         CLYDE\n                   (tough)\n            It was armed robbery.\n\n                         BONNIE\n                   (sarcastically)\n            My, my, the things that turn up in\n            the driveway these days.\n\nThey reach the corner and turn.  They are on:\n\nEXT. MAIN STREET.  DAY.\n\n--a small-town street of barber shops, cafes, groceries, etc.\nAt the moment, it is deserted.  They continue walking down\nthe empty street.  CLYDE looks the place over.  Tracking.\n\n                                                            5.\n\n\n                         CLYDE\n            What do y'all do for a good time\n            around here, listen to the grass\n            grow?\n\n                         BONNIE\n            Guess you had a lot more fun up at\n            State Prison, huh?\n\nCLYDE laughs, enjoying her repartee.  They continue walking.\nAt a hydrant, CLYDE stops.\n\n                         CLYDE\n                   (showing off, but seriously)\n            See this foot?\n                   (pointing at his\n                   right foot)\n            I chopped two toes off of it.  With\n            an axe.\n\n                         BONNIE\n                   (shocked)\n            What?  Why?\n\n                         CLYDE\n            To get off the damn work detail,\n            that's why.\n                   (stopping)\n            Want to see?\n\n                         BONNIE\n                   (a lady of some sensitivity)\n            No!...\n                   (turning a cute)\n            I surely don't intend to stand here\n            and look at your dirty feet in the\n            middle of Main Street.\n\nThey continue walking in silence past a few stores, each\nplanning what next to say.\n\n                         BONNIE\n            Boy, did you really do that?\n\n                         CLYDE\n            Yeah.\n\n                         BONNIE\n            You must be crazy.\n\n                                            DISSOLVE TO:\n\n                                                            6.\n\n\nEXT. GAS STATION.  DAY.\n\nGas station up the block.  BONNIE and CLYDE are seen leaning\nagainst the soft drink chest, their profiles silhouetted by\nthe bright sun.  They are drinking cokes.  As they begin to\ntalk, the camera moves in closer to them.  CLYDE takes off\nhis hat and rubs the cold coke bottle across his forehead.\nBONNIE watches him.\n\n                         BONNIE\n            What's it like?\n\n                         CLYDE\n            Prison?\n\n                         BONNIE\n                   (very interested)\n            No, armed robbery.\n\n                         CLYDE\n                   (he thinks it a silly question)\n            It's...I don't know...it isn't like\n            anything.\n\n                         BONNIE\n                   (thinking she's heard\n                   proof that he's a liar)\n            Hah!  I knew you never robbed bo\n            place, you faker.\n\n                         CLYDE\n                   (challenged)\n            Oh, yeah?\n                   (studies her, then\n                   makes up his mind to\n                   show her)\n\n\nClose-up.  Gun.  Day.  He reaches in his jacket and pulls\nout a gun.  The camera moves to a closeup of the gun,\nglinting in the sunlight.\n\nEXT. STREET.  DAY.\n\nThe camera pulls back to show BONNIE looking at it with\nfascination.  The weapon has an immediate effect on her.\nShe touches it in a manner almost sexual, full of repressed\nexcitement.\n\n                         BONNIE\n                   (goading him on)\n            Yeah, well you got one all right, I\n            guess...but you wouldn't have the\n            gumption to use it.\n\n                                                            7.\n\n\n                         CLYDE\n                   (picking up the\n                   challenge, proving himself)\n            You just keep your eyes open.\n\nEXT. LITTLE GROCERY STORE ACROSS THE STREET.  DAY.\n\nThe camera remains just behind BONNIE's shoulder so that\nthroughout the following scene we have BONNIE in the picture,\nlooking at what we look at.\n\nCLYDE goes into the little store.  We remain outside with\nBONNIE watching.  For a minute nothing happens.  We can\nbarely see what is going on in the store.  Then CLYDE comes\nout, walking slowly.  In one hand he holds the gun, in the\nother a fistful of money.  He gets halfway, to BONNIE and\nsmiles broadly at her, a smile of charm and personality.\nShe smiles back.  The moment is intense, as if a spark has\njumped from one to the other.  Their relationship, which\nbegan the minute BONNIE spotted him in the driveway, has now\nreally begun.  CLYDE has shown his stuff and BONNIE is\n\"turned on.\"\n\nSuddenly the old man who runs the grocery store comes\nrunning out into the street, completely dumbfounded.  He\nstands there and says nothing, yet his mouth moves in silent\nprotest.  CLYDE points the gun above him and fires.  It is\nthe first loud noise in the film thus far and it should be a\nshock.  The old man, terrified, runs back into the store as\nfast as he can, CLYDE quickly grabs BONNIE's hand.  The\ncamera swings with them as they turn and begin to run down\nthe street.  A few yards and the stores disappear entirely.\nThe landscape turns into that arid, flat and unrelieved\nwestern plain that begins where the town ends.\n\nEXT. STORE.  AT THE EDGE OF TOWN.  DAY.\n\nA car is parked at the back of the store.  As soon as they\nreach it, CLYDE motions and BONNIE gets in.  CLYDE runs to\nthe front, lifts up the hood and crosses the wires to make\nit start.  As he stands back, BONNIE calls to him:\n\n                         BONNIE\n            Hey, what's your name, anyway?\n\n                         CLYDE\n                   (he slams the hood)\n            Clyde Barrow.\n\nHe runs over to the door, opens it, shoves her over, and\nstarts up the engine.  The entire sequence is played at an\nincredible rapid pace.\n\n                                                            8.\n\n\n                         BONNIE\n                   (loud, to make\n                   herself heard over\n                   the gunning motor)\n            Hi, I'm Bonnie Parker.  Please to\n            meet you.\n\nEXT. ROAD.  DAY.\n\nVROOM!  The car zooms off down the road, doing 90.  The fast\ncountry breakdown music starts up on the sound track, going\njust as fast as the car.\n\nEXT. CAR.  DAY.\n\nThe car, still speeding, further down the road.  We zoom\ndown and look in the rear window.  CLYDE is driving, we see\nfrom behind.  BONNIE is all over him, biting his ear,\nruffling his hair, running her hands all over him--in short,\nmaking passionate love to him while he drives.  The thrill\nof the robbery and the escape has turned her on sexually.\n\nEXT. CAR.  ANOTHER ANGLE.  DAY.\n\nThe camera pulls back and above the car.  The car starts to\ngo crazy in a comical fashion, manifesting to the audience\njust what is happening to the driver controlling it.  The\ncar swerves all over the road.  The car comes to a sudden\nhalt.  The car starts again.  It swerves this time almost\nright off the road before it straightens out.  It jumps and\njerks.  Another car comes down the road the other way and\nCLYDE's car swerves so much as to make the other guy drive\nright off the road into the dirt.  It is almost Mack Sennett\nstuff, but not quite that much.\n\nINT. CAR.  BONNIE AND CLYDE.  DAY.\n\nBONNIE grabs the wheel and turns it sharply.\n\nEXT. CAR.  DAY.\n\nIt hairpins off the road onto a shoulder beneath some trees.\n\nINT. CAR.  BONNIE AND CLYDE.  DAY.\n\n--still settling to a stop.  BONNIE and CLYDE appear to be\nnecking heavily now, punctuated by BONNIE's squeals of\npassion as she squirms and hops about like a flea, trying to\nget to CLYDE.  The floor gear-shift is keeping their bodies\napart, however.  In exasperation, BONNIE takes the gear\nshift and shoves it forward out of their way.  She plunges\nonto CLYDE, burying him from view.\n\n                                                            9.\n\n\n                         BONNIE\n                   (kissing, biting)\n            ...You ready?...\n\n                         CLYDE\n                   (muffled, laughing)\n            ...Hey, wait...\n\n                         BONNIE\n                   (giggling herself)\n            Aren't you ready?  Well, get ready!\n\nBONNIE has obviously touched him.  With savage coquetry she\ntears into her clothes and his.\n\n                         BONNIE\n                   (muffled)\n            C'mon, honey, c'mon, boy...let's\n            go...let's...\n\n                         CLYDE\n                   (muffled)\n            Hey...hey, wait a minute...quit\n            that now, cut it out.\n                   (sharply)\n            I said, cut it out!\n\nHe shoves her rudely away, slamming her into the far car\ndoor.  Suddenly it looks as if they've been fighting.  Both\nunbuttoned and unglued, they stare silently at one another,\nbreathing heavily.  CLYDE gets out of the car, clearly\nshaken.  Despite the fact that he may have encountered this\nsituation many times before, it's one that no twenty-one-\nyear-old boy in 1932 is sophisticated enough to dismiss\neasily with bravado.\n\nBONNIE remains seated in the car.  She seems terribly\nvulnerable.  She fumbles about for a cigarette, too confused\nto figure out what didn't happen.  CLYDE turns back and\nreaches through the car window from the driver's side,\nlighting it for her.  BONNIE casts CLYDE a fishy stare, then\naccepts the light.\n\n                         CLYDE\n                   (trying to be casual,\n                   even insouciant)\n            Look, I don't do that.  It's not\n            that I can't--\n                   (his voice cracks,\n                   the match burns his\n                   fingers, and he bangs\n                   his head onto roof of\n                   car, and he goes\n                   right on)\n            --it's just that I don't see no\n            percentage in it.\n                         (MORE)\n\n                                                           10.\n\n\n                         CLYDE (CONT'D)\n            I mean there's nothin' wrong with\n            me, I don't like boys.\n\nBONNIE doesn't know what she thinks, and CLYDE is trying to\ngauge her reaction--whether she feels rejected or repelled.\nIn fact, it's both--along with a little latent fascination.\n\n                         BONNIE\n                   (finally, spitting\n                   out smoke)\n            Boy...boy...boy...\n\n                         CLYDE\n                   (a little annoyed)\n            Boy, what?\n\n                         BONNIE\n            Your advertising is dandy.  Folks'd\n            just never guess you don't have a\n            thing to sell.\n                   (a little afraid)\n            You better take me home, now.\n\n                         CLYDE\n                   (getting back into car)\n            Wait!\n\n                         BONNIE\n            Don't touch me!\n\nShe gets out of car, leaving CLYDE draped across the front\nseat, reaching after her.\n\n                         CLYDE\n                   (almost shouting)\n            If all you want's stud service,\n            then get on back to West Dallas and\n            stay there the rest of your life!\n\nThis stops her.  Now CLYDE pours it on, with an almost\nmaniacal exuberance that becomes more controlled as he gets\ncontrol of BONNIE.\n\n                         CLYDE\n            But you're worth more'n that, a lot\n            more, and you know it, and that's\n            why you come along with me.  You\n            could find a lover boy on every\n            corner in town and it doesn't make\n            a damn to them whether you're\n            waiting on tables or picking\n            cotton, so long as you cooperate.\n            But it does make a damn to me!\n\n                                                           11.\n\n\n                         BONNIE\n                   (turning, intrigued)\n            Why?\n\n                         CLYDE\n            Why?  Because you're different!\n            You're like me and you want\n            different things.\n\nBONNIE is hooked now.\n\n                         CLYDE\n                   (continuing)\n            You and me travelin' together, we\n            could cut clean acrost this state,\n            and Kansas, too, and maybe dip into\n            Oklahoma, and Missouri or whatnot,\n            and catch ourselves highpockets and\n            a highheeled ol' time.  We can be\n            somethin' we could never be alone.\n            I'll show you...when we walk into\n            the Adolphus Hotel in San Antone',\n            you wearin' a silk dress, they'll\n            be waitin' on you and believe me,\n            sugar, they're gonna know your last\n            name.\n\nHe stops, having begun to woo her to something more intense\nthan a casual, physical coupling.\n\n                         BONNIE\n            When'd you figure that all out?\n\n                         CLYDE\n            First time I saw you.\n\n                         BONNIE\n            How come?\n\n                         CLYDE\n                   (intensely, with real honesty)\n            'Cause you may be the best damn\n            girl in Texas.\n\nClose-up.  BONNIE.\n\n                         BONNIE\n            Who are you, anyway?\n\n                                            CUT TO:\n\n                                                           12.\n\n\nINT. ROADSIDE CAFE.  BONNIE AND CLYDE.  DAY.\n\nBONNIE and CLYDE seated in booth, now C.U. CLYDE.  The sound\ntrack bridges the scene: the question that BONNIE has just\nasked is now suddenly rebutted by CLYDE, as he points a\nfinger at her.\n\n                         CLYDE\n                   (not answering her,\n                   preferring to lead\n                   the conversation)\n            I'll tell you about you.\n\nHe loves doing this and he does it well.  The more he\nenvisions BONNIE's life, the more instinctively accurate he\nbecomes.  She grows more and more fascinated, like a child\nwatching a mind reader.\n\n                         CLYDE\n            Lessee...You were born somewheres\n            around East Texas...got a big old\n            family, right?...You went to\n            school, of course, but you didn't\n            take to it much 'cause you was a\n            lot smarter than everybody else\n            anyway.  So you just quit.  Now...\n                   (thinking, playing it\n                   for all it's worth)\n            ...When you were sixteen...no,\n            seventeen, there was a guy who\n            worked in...uh...\n\nPull back taking in BONNIE, favoring CLYDE.\n\n                         BONNIE\n                   (fascinated)\n            Cement plant--\n\n                         CLYDE\n            Right.  Cement plant.  And you\n            liked him 'cause he thought you was\n            just as nice as you could be.  You\n            almost married that guy, but\n            then...you thought, no, you didn't\n            think you would.  So you got your\n            job in the cafe...\n                   (getting closer to\n                   home now, hitting\n                   them right in there)\n            And every morning you wake up and\n            you hate it.  You just hate it.\n            And you get down there and you put\n            on your white uniform--\n\n                                                           13.\n\n\n                         BONNIE\n                   (enthralled)\n            Pink.\n\n                         CLYDE\n            And the truck drivers come in to\n            eat greasy burgers and they kid you\n            and you kid them back, but they're\n            stupid and dumb, boys with big\n            tattoos all over 'em, and you don't\n            like it...And they ask you for\n            dates and sometimes you go...but\n            you mostly don't, and all they ever\n            try is to get into your pants\n            whether you want to or not...and\n            you go home and sit in your room\n            and think, when and how will I ever\n            get away from this?...And now you\n            know.\n\nBONNIE is half-mesmerized by his talk.  A waitress comes\nwith their food.  A cheap, gaudy dame, she has spit curls on\neach temple in the style of the times.  CLYDE looks at her\nand at BONNIE, who also wears spit curls.  As soon as the\nwaitress leaves:\n\n                         CLYDE\n                   (pointing at her hair)\n            Change that.  I don't like it.\n\nWithout a word of protest, BONNIE immediately reaches in her\nbag and takes out a mirror.  She holds it up and with the\nother hand, brushes back her spit curls into her hair.  She\nnever again wears them.  When she has pushed them back she\nlooks at CLYDE for his approval.  He nods his okay.  She\nsmiles, puts back her mirror and begins to eat her food.\nShe's ravenously hungry and eats with total concentration on\nher plate.  CLYDE doesn't touch his food, just watches\nBONNIE eat for a minute.\n\n                         CLYDE\n            God, you're a knockout.\n\nEXT. ROADSIDE CAFE.  DAY FOR DUSK.\n\nCLYDE and BONNIE emerge from the cafe into the early evening.\nThey move toward the car they have stolen.  Just beyond sits\na newer model car.  BONNIE is surprised to see CLYDE head\ntoward the newer car.\n\n                         BONNIE\n            Hey, that ain't ours.\n\n                                                           14.\n\n\n                         CLYDE\n            Sure it is.\n\n                         BONNIE\n            But we came in this one.\n\n                         CLYDE\n            Don't mean we have to go home in it.\n\nShe walks amazed around the new car and gets in beside him.\nHe turns the key and they pull away from the cafe.\n\nINT. ABANDONED FARM HOUSE.  A WIDE SHOT OF THE PARLOR LIVING\nROOM.  DAY.\n\nThe room is bare.  In the middle BONNIE is waking, having\nslept on a couple of car seats covered with an old piece of\ntattered blanket.  There are windows behind her.  She looks\nabout bewildered.\n\n                         BONNIE\n            Clyde...\n\nShe starts to panic and runs to the window.\n\n                         BONNIE\n                   (continuing)\n            Clyde...\n\nAt another window CLYDE appears.\n\n                         CLYDE\n            Hey, lady.\n\n                         BONNIE\n                   (chagrined at her fear)\n            Where you been keeping yourself?\n\n                         CLYDE\n            Slept out by the car.\n\n                         BONNIE\n            Oh...These accommodations ain't\n            particularly deluxe.\n\n                         CLYDE\n            No...If they're after us, I want\n            the first shot.  Come on, you got\n            some work to do.\n\nBONNIE moves to the door and out of the house.\n\n                                                           15.\n\n\nEXT. FARM HOUSE.  FRONT YARD.  DAY.\n\nOn the door is a sign which reads:\n\nINSERT:\n\nPROPERTY OF MIDLOTHIAN CITIZENS BANK -- TRESPASSERS WILL BE\nPROSECUTED.\n\nWide angle.  Across fence.  Day.  On the dilapidated picket\nfence six old bottles have been placed.  As BONNIE joins\nCLYDE he turns and fires six quick shots.  The bottles\ndisappear.\n\n                         BONNIE\n            You're good.\n\n                         CLYDE\n            The best.\n\n                         BONNIE\n            And modest...\n\n                         CLYDE\n            Come on.  Got you all set up over\n            here.\n\nWider angle.  They move around to the side of the building\nwhere CLYDE points to a tire hanging by a rope from a tree.\nHe means that to be BONNIE's target.  He hands her a gun.\n\n                         CLYDE\n            Set her spinnin'.\n\nBONNIE fires.  She misses.\n\n                         CLYDE\n            Again.  Come down slow with it...\n\nBONNIE fires again and hits the tire.  She smiles and blows\nthe smoke from the barrel in pride and self-mockery.\n\n                         CLYDE\n            Ain't you something?  I tell you\n            I'm going to get you a Smith and\n            Wesson, it'll be easier in your\n            hand.  Now try it again once...\n\nBONNIE sights.  As she is about to fire, a man appears\naround the corner of the building.  A FARMER.  She fires and\nhits the tire.\n\n                         FARMER\n            Heighdo.\n\n                                                           16.\n\n\nCLYDE whirls at the sound.  He grabs gun from BONNIE because\nhis is empty.  He aims at FARMER.\n\n                         FARMER\n                   (frightened)\n            No sir...no sir.  You all go right\n            ahead.\n\nCLYDE watches him warily.\n\n                         FARMER\n                   (continuing)\n            Used to be my place.  Not any more.\n            Bank took it.\n\nCLYDE and BONNIE start to move toward the farmer.  All three\nmove around to the front of the building.  At a distance we\nsee an Okie car loaded with belongings.  A WOMAN with a BABY\nin arms sits in front.  A smaller BOY stands outside the car.\n\n                         FARMER\n            Yessir, moved us off.  Now it\n            belongs to them.\n                   (He points at the\n                   foreclosure sign.)\n\n\n                         BONNIE\n            Well, that's a pitiful shame.\n\nCLYDE shakes his head sympathetically.  He loads the empty\ngun.\n\n                         FARMER\n                   (bitterly)\n            You're damned right, ma'm.\n\nHe looks up to see an OLD NEGRO who has come from a distance\nshack and now stands near CLYDE's car.\n\n                         FARMER\n                   (nodding toward Negro)\n            Me and him put in the years here.\n            Yessir.  So you all go right ahead.\n            We just come by for a last look.\n\nHe stands a moment looking at the house and then turns\naround toward his family in the car.  CLYDE and BONNIE look\nafter him.  CLYDE spins and fires three fast shots into the\nfore-closure sign.  The FARMER stops and turns, looking at\nCLYDE.  CLYDE offers the gun to the farmer.  He looks at it,\nthen accepts it.  He slowly takes aim at the sign and fires.\nIt pleases him.  He looks at CLYDE and BONNIE who smile.\n\n                                                           17.\n\n\n                         FARMER\n            You all mind?\n\nBONNIE and CLYDE are puzzled.\n\n                         FARMER\n            Hey, Davis!  Come on over here.\n\nThe NEGRO moves toward them.  Now BONNIE understands.  She\ntakes the second gun from CLYDE and hands it to DAVIS.\nDAVIS looks from BONNIE to the FARMER and toward the house.\nThe FARMER fires again.  This time at a window.  He nods to\nDAVIS.  DAVIS slowly raises the gun and fires at another\nwindow.  It shatters and they can't keep from laughing.  The\nFARMER returns the gun as does DAVIS.\n\n                         FARMER\n                   (continuing)\n            Much obliged.\n\nHe extends his hand.  CLYDE shakes it.\n\n                         FARMER\n            Otis Harrison.  And this here's\n            Davis.  We worked this place.\n\n                         CLYDE\n                   (formally)\n            Miss Bonnie Parker.  And I'm Clyde\n            Barrow.\n\nAcross farmer's car.  Wide shot.  Day.  The FARMER turns and\nmoves toward his people.  DAVIS moves toward his shack.\nCLYDE and BONNIE in the b.g.\n\nClose angle.  BONNIE and CLYDE.\n\n                         CLYDE\n                   (continuing)\n            We rob banks.\n\nBONNIE turns quickly to look at CLYDE.  He smiles and nods.\n\n                                            FADE OUT.\n\nFADE IN.\n\nEXT. A LONG, COUNTRY ROAD.  DAY.\n\nA car is driving down it.  It is the next day.  BONNIE is\ndriving, CLYDE beside her.\n\n                                                           18.\n\n\nINT. CAR.  DAY.\n\n                         CLYDE\n            You just stay in the car and watch\n            and be ready.\n                   (he is playing it\n                   cool, knowing she is\n                   scared.  He thinks\n                   he's James Cagney)\n            Okay now?\n                   (he hands her a gun\n                   from the glove compartment)\n            You just be ready if I need you.\n\nBONNIE's hands are tense on the wheel.  Her face shows how\nnervous she is now that the time has come.\n\n                         CLYDE\n            Scared?\n\n                         BONNIE\n            No.\n\nThey drive in silence.\n\n                         CLYDE\n            What are you thinkin' about?\n\n                         BONNIE\n            Nothin'.\n\nEXT. BUSINESS STREET OF A LITTLE TOWN.  DAY.\n\nWe are still in the car.  BONNIE pulls over and stops by the\nbank.  CLYDE is frozen in his seat.  We can see that, for\nall his talk, he is scared, too.\n\n                         BONNIE\n            What are you waitin' for?\n\nThat gets him.  CLYDE throws the door open and jumps,\npractically dives out the door.  The camera follows his\nmotion right inside the bank, tracking very fast.\n\nINT. BANK #1.  DAY.\n\nSomething is very screwy here.  The bank is dark, the TELLER\nis half asleep over his books.  CLYDE approaches, thrusts\nthe gun at him.\n\n                                                           19.\n\n\n                         CLYDE\n                   (with a swagger)\n            This is a stickup.  Just take it\n            easy and nothin' will happen to you.\n            Gimme the money.\n\n                         TELLER\n                   (looking up with no\n                   fear, his voice calm\n                   and conversational)\n            Heighdy.\n\n                         CLYDE\n                   (nonplussed at this)\n            Gimme the money!\n\n                         TELLER\n            What money?  There ain't no money\n            here, mister.\n\n                         CLYDE\n                   (totally befuddled at\n                   the turn of events)\n            What do you mean there ain't no\n            money?  This here is a bank, ain't\n            it?\n\nThe camera pans around the bank.  We see that it is empty,\ndusty and shuttered.\n\n                         TELLER\n            This was a bank.  We failed three\n            weeks ago.\n\n                         CLYDE\n                   (furious)\n            What?  What??\n\nIn a rage, he goes behind the partition, grabs the teller\nand pushes him ahead with the gun.  CLYDE is fuming.  He\nforces the teller out the front door.\n\nEXT. BANK #1.  DAY.\n\n--showing BONNIE in the car.  She is terrified as she sees\nCLYDE and the TELLER coming at her.  She doesn't understand\nwhat is happening.\n\n                         CLYDE\n                   (shoving the teller forward)\n            Tell her!  Tell her!\n\n                                                           20.\n\n\n                         TELLER\n                   (acting like a man\n                   who has had his sleep\n                   interrupted by lunatics)\n            As I was tellin' this gentleman,\n            our bank failed last month and\n            ain't no money in it.  I sure am\n            sorry.\n\nBONNIE's reaction is one of hysterical relief and\nappreciation of what's funny in the situation.  She laughs\nuproariously, she can't stop laughing.  This makes CLYDE\nmadder than ever.  He shoves the teller to the ground.\n\nINT. CAR.  DAY.\n\nCompletely humiliated, CLYDE gets in the car, shoving BONNIE\nover.  She is still laughing.  BONNIE starts the car.  CLYDE\npoints his gun out the window.\n\nClose shot.  Bank window--whereon is lettered: ASSETS-$70,000.\n\nINT. CAR.  CLYDE AND BONNIE.  DAY.\n\nAngle to include bank window.  CLYDE aims and puts a bullet\nthrough each of the zeros.  We see each zero shot through.\nThen the entire window hangs there for a second and suddenly\ncrashes.  On the soundtrack, BONNIE's laughter.\n\n                                            CUT TO:\n\nINT. CAR.  DAY.\n\n--still driving.  BONNIE has still not fully recovered from\nher mirth, but is quieting down because she sees that CLYDE\nis really mad and can't be pushed too far.\n\n                         CLYDE\n                   (steaming)\n            We got $1.98 and you're laughin'.\n\nShe tries to stop.\n\nEXT. STREET.  DAY.\n\nThe car pulls down another street of shops in another little\nhick town.  A grocery store ahead.\n\nINT. CAR.\n\n                         CLYDE\n            Keep it running.\n\n                                                           21.\n\n\nINT. GROCERY STORE.  DAY.\n\nThere is an old CLERK behind the counter, and standing in\nthe b.g., almost out of our vision, is a BUTCHER--an enormous\ngiant of a man.  CLYDE steps up to the counter.\n\n                         CLYDE\n            Give me a loaf of bread, a dozen\n            eggs and a quart of milk.\n\nThe CLERK gets the order and puts it in a bag.  He rings\nopen the cash register preparatory to asking CLYDE for the\nmoney.  CLYDE pulls his gun.\n\n                         CLYDE\n            This is a stickup.  I'll take all\n            the money in that drawer now.\n\nHe reaches over the counter into the cash drawer and grabs\nthe bills.  He smiles.  Suddenly looming beside CLYDE is the\nBUTCHER, brandishing a meat cleaver.  Camera looks up at\nthis formidable sight as the cleaver comes crashing down,\nmissing CLYDE and sticking in the wooden counter.  He grabs\nCLYDE around the chest in a bear hug and actually lifts him\noff the ground.  The struggle is in silence.  CLYDE is\nterrified, fighting wildly to get free.  The gun in CLYDE's\nhand is pinned, because the man has CLYDE's arm pinned to\nhis thigh.  CLYDE tries to raise the barrel at an upward\nangle to shoot, finally he is able to do so.  He fires.  The\nbullet enters the BUTCHER's stomach.  The BUTCHER screams,\nbut reacts like a wounded animal, more furious than ever.\nHe still holds CLYDE in a fierce hug, staggering around the\nstore, knocking into shelves and spilling cans.  CLYDE is\nhysterical with fear.  He shoots the BUTCHER again.  The\nBUTCHER falls to his knees, but still he doesn't release\nCLYDE.  In a panic, CLYDE drags the man to the door, trying\nto get out.\n\nEXT. GROCERY STORE.  DAY.\n\nBONNIE sees CLYDE and the BUTCHER holding his legs.  She is\nterrified.  CLYDE drags him out on the street.  The BUTCHER\nwon't let go.  CLYDE, in real panic, aims the gun at his\nhead and fires.  Click.  Out of bullets.  In blind fury, he\npistol-whips the BUTCHER's head with two terrific swipes.\nFinally the BUTCHER lets go.  Hysterical, CLYDE jumps away\nand leaps into the car on the other side.  BONNIE still at\nthe wheel.\n\n                         CLYDE\n            Get the hell out of here!\n\nThey drive-off at top speed.\n\n                                                           22.\n\n\nINT. CAR.  DAY.\n\nCLYDE is shaken.  He speaks haltingly, panting; trying to\nget control of himself.\n\n                         CLYDE\n            Damn him, that big son of a bitch...\n            He tried to kill me... I ain't got\n            eyes in back of my head... I didn't\n            want to hurt him.  It wasn't a real\n            robbery... Some food and a little\n            bit of dough.  I'm not against him.\n            Damn!\n\nEXT. SPEEDING CAR.  DAY.\n\nThe car is speeding down an open road.  Suddenly it begins\nto buck and cough.  There is something wrong with the motor.\n\nCLOSE SHOT.  C.W. MOSS.  EXT. FILLING STATION.\n\nHis cherubic cheeks are puffed up as he blows into the fuel\nlines of CLYDE's car.  There is a distinctly flat sound.\n\nReaction: CLYDE and BONNIE.  CLYDE stands by the hood.\nBONNIE remains seated in the car.  CLYDE is covered with\nsweat and grease--clearly he has gotten in his licks on the\nengine without success.  Neither he nor BONNIE seems\nimpressed by the noise C.W. is making.\n\nAnother angle.  C.W.--as he screws back the fuel line and\nmoves between BONNIE and CLYDE to the ignition, turning the\nengine over.  It purrs beautifully.  CLYDE is astonished.\n\n                         CLYDE\n            What was wrong, anyway?\n\n                         C.W.\n                   (moving back to screw\n                   on gas cap)\n            Air bubble--clogged the fuel line.\n\nC.W. now stands between BONNIE and CLYDE.\n\n                         C.W.\n                   (continuing)\n            I just blowed her away.\n\nCLYDE still can't get over it.\n\n                         CLYDE\n            You just blowed it away.\n\nC.W. belches.  He is embarrassed before BONNIE.\n\n                                                           23.\n\n\n                         C.W.\n            'Scuse me, ma'm... Anythin' else I\n            can do for you?\n\nCLYDE nods vigorously, looking across C.W.'s back to BONNIE.\nBONNIE gets the message.\n\n                         BONNIE\n            Well...I'm not sure...\n                   (she looks around)\n            Say, them little red things there\n            stickin' up?  Are they gas pumps?\n\n                         C.W.\n                   (he's not too bright)\n            Sure.\n\n                         BONNIE\n            Isn't that interesting?  How does\n            that there gasoline get in my\n            little old car?\n\n                         C.W.\n                   (trying to be helpful)\n            Well, y'see, there's this tank\n            underground, and the gas comes up\n            this tube into the pump and into\n            your car, M'am.\n\n                         BONNIE\n            My, you're a smart fellow.  You\n            sure know a lot about automobiles,\n            don't you?\n\n                         C.W.\n                   (he has no idea he's\n                   being toyed with)\n            Yeah, I do.\n\n                         BONNIE\n            Well, would you know what kind of a\n            car this is?\n\n                         C.W.\n                   (touching it)\n            Yeah, it's a Chevrolet 8-cylinder\n            coupe.\n\n                         BONNIE\n            No, no.\n\n                         C.W.\n            Sure it is.\n\n                                                           24.\n\n\n                         BONNIE\n            No, this is a stolen Chevrolet 8-\n            cylinder coupe.\n\nC.W. jerks his hand off it as if he touched a hot stove.\n\n                         CLYDE\n                   (getting in the conversation)\n            You ain't scared, are you?\n                   (to Bonnie)\n            I believe he is.  What a pity.  We\n            sure coulda used a smart boy who\n            knows such a great deal about\n            automobiles.\n                   (suddenly business-\n                   like, to C.W.)\n            You a good driver, boy?\n\n                         C.W.\n                   (getting quite confused)\n            I guess so.\n\n                         CLYDE\n                   (pretending to cool\n                   on him)\n            No, I don't think so.  He's better\n            off here...\n\n                         BONNIE\n            What's your name, boy?\n\n                         C.W.\n            C.W. Moss.\n\n                         BONNIE\n            What's the C.W. for?\n\n                         C.W.\n                   (reluctantly)\n            Clarence Wallace.\n\n                         BONNIE\n            I'm Miss Bonnie Parker and this is\n            Mr. Clyde Barrow.   We... rob...\n            banks.\n                   (C.W. reacts with\n                   wide eyes)\n\n\n                         CLYDE\n                   (swiftly, testing his mettle)\n            Ain't nothing wrong with that, is\n            there, boy?\n\n                                                           25.\n\n\n                         C.W.\n                   (nervously)\n            Uh, nope--\n\n                         BONNIE\n                   (with a put-on sigh)\n            No, he ain't the one.\n\n                         CLYDE\n            Unless, Boy, you think you got\n            enough guts for our line of work?\n\n                         C.W.\n                   (affronted in his\n                   dumb way)\n            What do you mean?  I served a year\n            in the reform school.\n\n                         BONNIE\n            Oh, a man with a record!\n\n                         CLYDE\n                   (laughs)\n            Now look here, I know you got the\n            nerve to short-change old ladies\n            who come in for gas, but what I'm\n            askin' you is have you got what it\n            takes to pull bank jobs with us?\n\n                         BONNIE\n            Mr. C.W. Moss?\n\n                         C.W.\n                   (anxious to prove himself)\n            Sure, I could.  Sure I could.  I\n            ain't scared, if that's what you\n            think.\n\n                         CLYDE\n            Prove it.\n\nC.W. walks away from the car.  Camera remains where it was.\nWe see him walk inside the gas station office, open the cash\ndrawer, close it and come out.  He emerges with a fistful of\nmoney.  He walks over to BONNIE's window, sticks his hand\ninside and drops the money on her lap.  We see the bills\nflutter down.  Not a word is spoken.  BONNIE moves over into\nthe middle.  C.W. opens the door and gets in behind the\nwheel.  For a moment we see them all sitting there, each\nsmiling their little smile.  CLYDE starts to hum a hillbilly\ntune quietly.  The sound track picks it up (banjo and\nviolin, etc.) and as the music swells, they drive off down\nthe road.\n\n                                                           26.\n\n\nINT. HOSPITAL ROOM.  DAY.\n\nA small room with a bed.  On it, covered by a sheet which\nhumps like a mountain over his enormous stomach, is the\nBUTCHER.  His head is propped up on a pillow and he sips a\nliquid through a bent glass straw.  Camera is on the left\nside of the head of the bed, seeing the BUTCHER in a three-\nquarter profile.  On the opposite side of the bed stands a\nuniformed patrolman who is in the act of flashing mug-shot\nphotos for the BUTCHER to identify his assailant.  The\nlawman holds a stack of them in front of them, swiftly\nchanging the cards like a grade-school teacher with her\nflash cards.  At each picture, the BUTCHER grunts negatively\nand goes on sipping from his glass straw.  One picture, two,\nthree go by.  The fourth picture is a mug shot of CLYDE.\nAgain the BUTCHER grunts 'no,' without hesitation.  As the\nnext picture comes into view, we\n\n                                            DISSOLVE TO:\n\nEXT. MOTEL.  NIGHT.\n\n--on a painted wooden sign, lit by one attached light, which\nreads: \"MOTOR COURT\".\n\nINT. ROOM IN MOTOR COURT.  NIGHT.\n\n--in darkness.  Camera is close on BONNIE.  She is awake and\nrestless.  O.S. comes the measured snoring that we will\nthink comes from CLYDE.  BONNIE raises up and kneels over\nClyde.  She needs him.  Clyde seems to snore on.  Camera\ndrops between them and we see that the snoring actually\ncomes from C.W.  BONNIE drops back on her pillow.  We cut\nclose on CLYDE.  He is awake.\n\nINT. CAFE.  DAY.\n\nBONNIE, CLYDE and C.W. seated in a booth in a cafe.  The\nWaitress brings the food and serves everybody.  We see C.W.\nWith great concentration, as he does everything by relating\nto the immediate action he happens to be involved with, he\ntakes the sugar shaker and begins methodically sprinkling\nsugar over all his food.  He sugars the meat, the beans, and\nthe beets.  BONNIE and CLYDE watch this performance with\nfirst, amazement and second, disgust.  They can't believe\nwhat they see.\n\n                         BONNIE\n                   (incredulously)\n            C.W., what are you doing?  Why do\n            you do that?\n\n                                                           27.\n\n\n                         C.W.\n                   (beginning to eat it)\n            Why not?\n\n                         BONNIE\n            It's just disgusting, that's why.\n\n                         C.W.\n                   (chewing)\n            Not to me it ain't.\n\n                         BONNIE\n            But...but it makes everything sweet!\n\n                         C.W.\n            Yeah, I know.\n\nWith a resigned expression, BONNIE turns away and begins to\neat.  Suddenly a look of consternation crosses C.W.'s face.\n\n                         C.W.\n            Damn!  No mayonnaise!\n\nHe gets up and goes down to the counter on the other end of\nthe restaurant, out of our vision, apparently planning to\nput mayonnaise over the sugar.  The minute he is out of\nearshot, BONNIE gets CLYDE's attention.\n\n                         BONNIE\n            Clyde, why does he have to stay in\n            the same room as us?\n\nCLYDE seems not to have heard the question.  He takes up the\nsugar shaker and spreads a thin field of sugar on the dark\ntable surface.  He will sketch his plan in the sugar.\n\n                         CLYDE\n            Lemme show you about tomorrow.\n\n                         BONNIE\n            Why?\n\n                         CLYDE\n            Now C.W.'ll be waitin' right\n            outside in the car.  Here is the\n            teller's cage.  Four of them and\n            over here the desks and what have\n            you...\n\n                         BONNIE\n            Why, Clyde...\n\n                         CLYDE\n            Hmmm??\n\n                                                           28.\n\n\n                         BONNIE\n            In the same room with us?\n\n                         CLYDE\n            Hell, where else?  Ain't gonna\n            spread out all over the state...\n\nThe harshness of his tone concerns him and he recovers with\na smile.\n\n                         CLYDE\n                   (continuing)\n            Not yet, anyway.  Now, the door to\n            the bank is here now.  You cover me\n            from there.\n\n                         BONNIE\n                   (takes his hand to\n                   her face)\n            Just that I love you so much.\n\n                         CLYDE\n            You're the best damn girl in Texas.\n\nC.W. comes back with the mayonnaise; looks at the table.\n\n                         C.W.\n            Hey, you spilled the sugar.\n\nThree shot.\n\n                         CLYDE\n                   (eating)\n            The layout for tomorrow up in\n            Mineola.\n\n                         C.W.\n            Mineola?  Gosh, that's four, five\n            hundred miles from here!\n\n                         CLYDE\n            So what?  We take U.S. 85 to Willis\n            Point, don't you know, and cut over\n            on State Highway 28 at Kaufman,\n            keep on goin' till we hit the farm-\n            to-market road that connects to 105\n            and that's right up by Mineola.  On\n            a Saturday afternoon...\n\nEXT. SMALL KANSAS TOWN.\n\nThe car driving into a small Kansas town.  It is Saturday\nafternoon, sunny.  The streets are filled with people, cars,\nwagons.  C.W.\n\n                                                           29.\n\n\nis driving, BONNIE is in front with him, CLYDE is in the\nback.  C.W. looks scared to death at the idea of robbing a\nbank.  The car pulls up in front of the bank, double-parked.\nBONNIE and CLYDE get out.\n\nEXT. CAR.  DAY.\n\n                         CLYDE\n            Keep it running.\n\nBONNIE and CLYDE enter bank.\n\nINT. BANK #2.  DAY.\n\nCut to the interior of the bank.  BONNIE and CLYDE come in,\nassume the class positions--she at the door where she can\ncover the bank, CLYDE at the first teller's cage.\n\n                         CLYDE\n                   (in a very quiet voice)\n            This is a stickup.\n\n                         TELLER\n            What?\n\n                         CLYDE\n            This is a stickup.\n\nThis time everyone in the bank hears it.  The people gasp\nand pull back.  CLYDE slowly edges toward the door and prods\nBONNIE forward.  She carries a paper sack.  CLYDE motions\nher to go from cage to cage and get all of the money.\nBONNIE begins doing so, while CLYDE keeps his gun trained on\neverybody.  We see BONNIE get the money from the first\nteller, the second teller, then...\n\nEXT. SMALL TOWN STREET.  DAY.\n\nA car parked in a tight spot has just pulled out.\n\nClose-up C.W.  Day--who suddenly looks delighted to see a\nparking space.\n\nEXT. CAR - STREET.  DAY.\n\nImmediately he methodically begins to back in.  It's a tight\nspot and he has to cut the wheel, pull forward, cut some\nmore, pull back and so on.  The scene, for the audience,\nshould be nervous and funny.\n\n                                            CUT TO:\n\n                                                           30.\n\n\nINT. BANK #2.  DAY.\n\nInside the bank, BONNIE and CLYDE have filled the sack.\nThey run out the door, the camera tracks with them.\n\nEXT. SMALL TOWN STREET.  DAY.\n\nThey run for where the car was, but it isn't there.  Then\nthey see C.W. has parked it.\n\nINT. CAR.  DAY.\n\n                         CLYDE\n            Let's go!  Let's go!\n\nC.W. suddenly realizes what a stupid thing he's done.\n\nEXT. CAR.  STREET.  DAY.\n\nC.W. tries to shoot out of the parking spot, but he can't.\nHe has to go through the business of backing up, cutting the\nwheel and all of it.  The scene is one of pure pandemonium\nand chaos.\n\nINT. CAR.\n\n                         CLYDE\n            Come on!  Get it out!\n\nEXT. CAR.  DAY.\n\nA policeman arrives and begins firing at car.  C.W. gets the\ncar halfway out of the spot, scraping fenders in the process,\nand the car is almost out when suddenly a face looms up at\nthe window--a dignified, white-haired, celluloid-collared\nman, obviously a bank official who has leaped onto the\nrunning board.  His screaming can barely by distinguished\nfrom all the noise.\n\n                         MAN\n            Stop!\n\nCLYDE fires through the window.\n\nClose-up (special effects).  The face of the man explodes in\nblood.  Then he drops out of sight.\n\nEXT. CAR.  DAY.\n\nThe car shoots off down the road, doing ninety.  Police are\nfiring at the escaping car; BONNIE and CLYDE are shooting\nout the back window; C.W. is almost having a nervous\nbreakdown at the wheel.\n\n                                                           31.\n\n\nEXT. STREET.  A MOVIE HOUSE.  DAY.\n\nA police car that had been chasing CLYDE and BONNIE's car\ncomes down the street.  It is obvious that the cops have\nlost them.  They are searching the street for a sign of\nCLYDE's car.  They pass a movie house whose marquee reads:\n\"GOLDDIGGERS OF 1933.\"  They slow for a moment, decide that\nis not a probable place to look.  They drive off.\n\nINT. MOVIE HOUSE.  WIDE ACROSS AUDIENCE AT SCREEN.\n\nThe opening musical sequence of \"Golddiggers\" is on the\nscreen.  Ginger Rogers sings \"We're In The Money.\"  Among\nthe audience we cannot make out our three people.  It is a\nsmall audience and thinly dispersed.\n\nTight shot at audience.  Camera pans the audience while on\nthe track we hear the music of the song.  First of our group\nwho becomes visible is C.W.  He is staring at the screen and\neating bites from a candy bar in each hand.  Camera pans\nfurther and we see that CLYDE is in the row behind C.W. and\na few seats to one side.  CLYDE is nervous and keeps watching\nthe entrance doors.  He is in a rage.  He shifts in his seat.\n\n                         CLYDE\n            Boy, you gotta be poor in the head.\n            You...!  Count of you I killed a\n            man.  Murder...you too.\n\nShot from behind CLYDE.  Shooting toward screen.\n\n                         CLYDE\n                   (continuing)\n            Dumb ass stupid.\n\nC.W. turns to CLYDE and nods agreement.  This infuriates\nCLYDE even more.  He slaps the back of C.W.'s head.\n\n                         CLYDE\n            Ever do a dumb thing like that\n            again, I'll kill you boy!\n\nAngle at BONNIE.  She has been watching the movie; is now\ndisturbed by the noise.  She turns back to CLYDE from her\nseat on the aisle.\n\n                         BONNIE\n            Ssshh!  If you boys want to talk\n            why don't you go outside?\n\nShe smiles at her joke and turns back to the screen to the\nmovie which she is obviously enjoying enormously.\n\n                                                           32.\n\n\nINT. CHEAP MOTEL BATHROOM.  CLOSE-UP BONNIE.  DAY.\n\nOn the right of the screen, f.g., BONNIE stands at the sink\nfixing her make-up in the mirror.  The make-up has become\nmore conservative.  On the left, further back, is a bathtub\nand in it sits C.W.  His head and knees peek over the gray,\nsoapy water.  He is engaged with his usual single-minded\nconcentration, in washing himself, carefully scrubbing his\narms, not a thought in his head.  BONNIE finishes her make-\nup and regards herself quizzically, tilting her head to look\nat herself at different angles.  She is smoking a cigarette,\nand really, studying herself.\n\n                         BONNIE\n            What do you think of me, C.W.?\n\n                         C.W.\n            Uh...well, you're just fine, I\n            guess.  Uh, well, course you're a\n            real good shot...and...uh...well,\n            sometimes you look pretty as a\n            painting.\n\nCamera stays with BONNIE during all this, watching her look\nat herself as she listens to C.W.'s evaluation.  She has a\nnarcissistic concern at the moment and as she hears him\nenumerate her values, she thinks about each in turn and\ndecides yes, that's true.\n\n                         C.W.\n            Hey, uh, Bonnie...could you get me\n            that washrag there?\n\nResponding automatically, BONNIE turns and walks to a towel\nrack, pulls the washcloth off and starts toward C.W. when\nsuddenly she stops with a smile on her face and a sudden\nmotion.  Teasingly, she holds the washcloth out at arm's\nlength.\n\n                         BONNIE\n                   (coyly)\n            Why'nt you come get it?\n\n                         C.W.\n                   (not even realizing\n                   what's on her mind)\n            Huh?\n\n                         BONNIE\n                   (wiggling the\n                   washcloth like a\n                   bull-fighter's cape)\n            Whyn't you come get it, C.W.?\n\n                                                           33.\n\n\nSuddenly C.W. looks mortally embarrassed as he realizes what\nthat would entail.\n\n                         C.W.\n            Aw, Bonnie, come on, gimme it.\n\nBONNIE tries another tack.  She begins sauntering over\nslowly, teasingly, still holding out the treasured washcloth.\n\n                         BONNIE\n                   (pertly)\n            All right, I'll bring it myself.\n\nAs she moves closer to the tub, C.W. realizes that she will\nbe able to peer down into the tub and see him and he\nfrantically reaches up with one hand and yanks the washcloth\ninto the tub, causing a great splash.  BONNIE, somewhat the\nvictim of the splash, jumps back and away.  Recovering her\ncomposure, she looks at C.W. who is slunk down in the tub\nlike a gross September Morn.  She has tried him and he has\nfailed; she realizes now that he was no choice for her; no\nreal man, even if he might perform sexually.  He is a lump.\nThis irritates her; his very presence is demeaning to\nherself and CLYDE.\n\n                         BONNIE\n                   (irritated with\n                   herself for even\n                   thinking of such a thing)\n            You simpleton, what would you do if\n            we just pulled out some night while\n            you was asleep?\n\n                         C.W.\n                   (trying to give the\n                   right answer, but\n                   obviously faking it)\n            Oh, I wouldn't know what to do.\n            But you wouldn't do that.  You\n            couldn't now.\n\nBONNIE realizes, with some weariness, the inevitable truth\nof what he's said; thus resigned, she says patronizingly:\n\n                         BONNIE\n            That's right, C.W.  We'll always be\n            around to take care of you.\n\nPointedly, she throws her cigarette in his bath-water,\n\"Sssssssssss.\"  She turns and leaves the bathroom, slamming\nthe door behind her.\n\n                                                           34.\n\n\nINT. BEDROOM.\n\nCamera goes with her into the connecting bedroom.  CLYDE is\nsitting on the edge of the bed cleaning the guns and oiling\nthem.  He is quiet and preoccupied and takes no note of\nBONNIE's present condition.  The moment she enters, he looks\nup.\n\n                         CLYDE\n                   (quietly)\n            Bonnie, I want to talk to you.  Sit\n            down.\n\nBONNIE sits, a little taken off balance by his serious\nmanner.  But she listens quietly.\n\n                         CLYDE\n                   (continuing)\n            This afternoon we killed a man and\n            we were seen.  Now nobody knows who\n            you are yet, but they're going to\n            be after me and anybody who's\n            runnin' with me.  Now that's murder\n            now and it's gonna get rough.\n                   (BONNIE nods.  CLYDE\n                   continues speaking\n                   carefully and gently.)\n            Look, I can't get out, but right\n            now you still can.  You say the\n            word and I'll put you on the bus to\n            go back to your Mother.  'Cause you\n            mean a lot to me, honey, and I\n            ain't going to make you run with me.\n            So if you want, you say the word.\n\nBONNIE, moved by his offer, has tears in her eyes.\n\n                         CLYDE\n                   (as he pauses)\n            Why?  We ain't gonna have a minute's\n            peace.\n\nBONNIE doesn't like him in this mood.  She tries to josh him\nout of it.\n\n                         BONNIE\n            Oh, pshaw.\n\n                         CLYDE\n                   (trying to make her\n                   see the seriousness\n                   of it)\n            Bonnie, we could get killed.\n\n                                                           35.\n\n\n                         BONNIE\n                   (death has no reality\n                   for her)\n            Who'd wanna kill a sweet young\n            thing like me?\n\n                         CLYDE\n                   (amused in spite of himself)\n            I ain't no sweet young thing.\n\n                         BONNIE\n            Oh, Clyde, I can't picture you with\n            a halo, and if you went to the\n            other place you'd rob the Devil\n            blind, so he'd kick you right back\n            to me.\n\nClose-up.  CLYDE--touched deeply, realizes that this was a\nlovely thing to say to him.\n\nINT. MOTEL BEDROOM.\n\nThey kiss.  They are near the bed on which are some guns\nthat CLYDE has been cleaning.  The kiss moves toward real\nlove making.  They are on the bed and push the guns aside.\nSome fall to the floor.  CLYDE breaks the embrace after it\nhas reached a high pitch.  He moves away from the bed toward\nthe window.  BONNIE follows him and embraces him from the\nrear.  They are miserable.  BONNIE frees him and returns to\nthe bed.  She falls on it face down.  A gun presses into her\nface.  CLYDE sits in the window, the light silhouettes him.\nHe turns his face toward the glass and rests his head on the\nwindow pane.  BONNIE turns to him from bed.  She smiles a\ncomforting smile at him.  She rolls over onto her back.  The\ngun is now under her head and moves it.  She sits up and\ngestures to CLYDE.  He remains at the window.  She stares at\nhim.  She looks toward the bathroom.  She looks back at\nCLYDE.  She is moved and pained for him.  She touches her\ncheek with the gun and waits for him to be able to look at\nher.  Finally he does.  Her look eases him and he almost\nsmiles.\n\nINT. BUCK'S CAR.  DAY.\n\nShot of little fuzzy doll tied by a white shoestring to the\nrear-view mirror of a car.  The car is moving; the doll is\nbouncing up and down.  In the front seat are BUCK and\nBLANCHE BARROW.  BUCK is a jovial, simple, big-hearted man.\nA little chubby, given to raucous jokes, knee-slapping and\nbroad reactions.  He is, in many ways, the emotional opposite\nof his brother.  It doesn't take much to make him happy.\nBLANCHE, his wife, is the direct opposite of BONNIE.\n\n                                                           36.\n\n\nShe is a housefrau, no more and no less, not terribly\nbright, not very ambitious, cuddly, simpering, madly in love\nwith BUCK and desirous of keeping their lives on the straight\nand narrow.  As the scene begins we hear and then see BUCK,\ndriving, singing \"The Great Speckled Bird.\"  BLANCHE is\nsitting next to him looking at a movie magazine, appearing\nfairly miserable.\n\n                         BUCK\n                   (singing)\n            \"What a beautiful thought I am\n            thinking\n            Concernin' that great speckled\n            bird,\n            Remember his name is recorded\n            on the pages of God's Holy word...\"\n\n                         BLANCHE\n            All right, now you did foolish\n            things as a young man, honey-love,\n            but you went and paid your debt to\n            society and that was right.  But\n            now you just gettin' back in with\n            the criminal element.\n\n                         BUCK\n            Criminal element!  This is my\n            brother, darlin'.  Shoot, he ain't\n            no more criminal than you are,\n            Blanche.\n\n                         BLANCHE\n            Well, that ain't what I heard.\n\n                         BUCK\n            Now word of mouth just don't go,\n            darlin', you gotta have the facts.\n            Shoot.  Why he and me growed up\n            together, slept and worked side by\n            side.\n                   (laughing)\n            God, what a boy he was!\n\n                         BLANCHE\n            He's a crook.\n\n                         BUCK\n                   (chidingly)\n            Now you stop bad-mouthin' him,\n            Blanche.  We're just gonna have us\n            a little family visit for a few\n            weeks and then we'll go back to\n            Dallas and I'll get me a job\n            somewheres.\n                         (MORE)\n\n                                                           37.\n\n\n                         BUCK (CONT'D)\n            I just ain't gonna work in your\n            Daddy's church--That's final.\n                   (laughing it off, singing)\n            \"What a beautiful thought I am\n            thinking\n            Concernin' that great speckled\n            bird...\"\n\n                                            CUT TO:\n\nEXT. CABIN.  THE FRONT OF THE MOTEL.  DAY.\n\nBUCK's car drives up to the cabin, honking the horn wildly.\nThe door of the cabin opens and CLYDE comes running out.  He\nis overjoyed to see his brother.  BUCK jumps out of the car,\nequally delighted.  They hug each other.\n\n                         CLYDE\n                   (hugging him)\n            Buck!\n\n                         BUCK\n            Clyde!  You son of a bitch!\n\nThey laugh happily and begin sparring with each other,\nfaking punches and blocking punches--an old childhood ritual.\nThere is a great feeling of warmth between the two brothers.\nCLYDE is more outgoing than we have ever seen him before.\n\n                         CLYDE\n            How's ma?  How's sister?\n\n                         BUCK\n            Just fine, just fine.  Send their\n            best to you.\n\n                         CLYDE\n                   (patting Buck's stomach)\n            Hey, you're fillin' out there.\n            Must be that prison food.\n\n                         BUCK\n            Hell no!\n                   (laughing)\n            It's married life.  You know what\n            they say, it's the face powder that\n            gets a man interested, but it's the\n            baking powder that keeps him at\n            home.\n                         (MORE)\n\n                                                           38.\n\n\n                         BUCK (CONT'D)\n                   (he explodes with\n                   laughter and so does\n                   Clyde, who loves\n                   Buck's jokes)\n            Hey! you gotta meet my wife.  Hey,\n            honey, c'mon out here now and meet\n            my baby brother.\n\nCamera swings to car.  We see BLANCHE still sitting there,\nher face obscured by the glint of sun on the windshield.\nSlowly, she gets out of the car, still carrying the movie\nmagazine.\n\n                         BLANCHE\n                   (suspiciously, quite\n                   the grand lady)\n            Howdy-do.\n\n                         CLYDE\n                   (shaking her hand)\n            Howdy-do.  It's real nice to know\n            you.\n\nBUCK beams with pleasure, thinking they must like each other.\nBONNIE comes out of the cabin, standing on the steps.  The\nscreen door slams behind her.\n\nClose-up.  BONNIE.  Day--expressionless, looking it all over.\n\nEXT. CABIN.\n\nBUCK and CLYDE notice nothing of this.  BUCK bounds over to\nBONNIE, all jollity.\n\n                         BUCK\n                   (grabbing her)\n            Well!  You must be Bonnie!  Now I\n            hear you been takin' good care of\n            the baby in the family.  Well sis,\n            I'm real glad to meet you!\n                   (he hugs her; BONNIE\n                   just lets herself be hugged)\n            Say...\n                   (breaking the hug)\n            I'd like you to meet my wife,\n            Blanche.\n\n                         BONNIE\n                   (stiffly)\n            Hello.\n\n                                                           39.\n\n\n                         BLANCHE\n                   (stiffly)\n            Hello.\n\nThere is an awkward pause.  Suddenly the screen door opens\nand C.W. comes out, dressed in his long underwear.  BLANCHE\ncan hardly stand it.\n\n                         CLYDE\n            Everybody, this is C.W. Moss.\n            C.W., my brother Buck and his wife,\n            Blanche.\n\n                         C.W.\n                   (friendly)\n            Heighdy, y'all.\n\nHe pumps BUCK's hand vigorously and then goes to BLANCHE.\nWith his characteristic one-track intensity, he decides to\nact just as friendly as he can with BLANCHE, ignoring the\nfact that he's standing there in his underwear.  BLANCHE,\nhowever, is not ignoring it.\n\n                         C.W.\n            Well how do, Mrs. Barrow.  Or can I\n            call you Blanch?  I sure am pleased\n            to meet you.\n                   (shaking her hand;\n                   Blanche is slowly\n                   going crazy with mortification)\n            Did you have a hard time findin' us\n            here in this neck of the woods?\n            Well, you sure picked a good day\n            for it.  Say, you got a Screenland\n            there!  Any new photos of Myrna Loy?\n            She's my favorite picture star.\n\nBLANCHE is starting to edge over to BUCK in sheer panic at\nthis strange, young man in his BVD's but C.W. takes no\nnotice of it.\n\nBLANCHE finally grabs BUCK's arm.  BONNIE watches it all,\nsmirking.\n\n                         BUCK\n            Hey, lemme get the Kodak!\n\nBUCK goes to his car and gets a folding Brownie camera.\n\n                         CLYDE\n                   (lighting up a cigar)\n            Hey, C.W., go put your pants on.\n            We're gonna take some pictures.\n\n                                                           40.\n\n\n                         BUCK\n            Y'all hear about the guy who\n            thought Western Union was a cowboy's\n            underwear?\n\nBUCK and CLYDE and C.W. laugh heartily.  C.W. goes into the\ncabin.  BUCK pushes BLANCHE and CLYDE together, posing them\nfor a picture.\n\n                         BONNIE\n            Lemme get one of my bride and my\n            brother.\n\n                         BLANCHE\n                   (getting kittenish,\n                   and overdoing it)\n            Buck!  Don't take my picture now.\n            I'm just a mess from driving all day.\n\n                         BUCK\n            Oh honey, now you look real fine.\n\nBONNIE watches BLANCHE's behavior with hardly-veiled disgust.\nBUCK snaps the picture as BLANCHE is just about to move out\nof it.\n\n                         BLANCHE\n                   (with unbecoming\n                   girlish outrage)\n            Did you take my picture?  Oh Buck!\n            I declare--\n\nBUCK laughs and goes to BONNIE, takes her by the arm and\nmoves her next to CLYDE and BLANCHE.  He lines them up,\nsteps back and takes their picture.  CLYDE is the only one\nsmiling.\n\n                         CLYDE\n                   (pulling out his gun\n                   and posing like a\n                   movie tough)\n            Hey, Buck, get one of this.\n\nBUCK does.\n\n                         BUCK\n                   (giving Clyde the camera)\n            Clyde, you do one of me and my\n            missus.\n\nHe puts his arm around BLANCHE.  CLYDE takes the picture.\n\n                                                           41.\n\n\n                         CLYDE\n                   (throwing her a challenge)\n            Let me take on of Bonnie.\n\nBONNIE grins at him and responds with amused arrogance.\n\n                         BONNIE\n                   (she yanks the cigar\n                   from Clyde's mouth,\n                   smokes it and poses)\n            Okay.\n\nCLYDE snaps the picture.  Everyone but BLANCHE laughs.  C.W.\ncomes out dressed.\n\n                         BUCK\n                   (drawing Clyde aside)\n            Hey, brother, let's you and me do a\n            little talkin'.\n\n                         CLYDE\n                   (handing C.W. the camera)\n            Here, C.W., take the girls' picture.\n\nINT. CABIN.  DAY.\n\nThey walk into the cabin.  Camera goes with them.  Bedroom\nis dark, shades pulled down.  There is an aura of boys'\nclubhouse secret camaraderie in the following scene:\n\n                         BUCK\n                   (as soon as the door\n                   is shut; conspiratorially)\n            It was you or him, wasn't it?\n\n                         CLYDE\n            Huh?\n\n                         BUCK\n            That guy you killed.  You had to,\n            didn't ya?\n\n                         CLYDE\n                   (they are protecting\n                   each other)\n            Yeah, he put me in a spot, so I had\n            to.  He didn't have a Chinaman's\n            chance.\n\n                         BUCK\n            But you had to--\n\n                         CLYDE\n            Yeah.  I had to.\n\n                                                           42.\n\n\n                         BUCK\n                   (like two kids\n                   keeping a secret from Mom)\n            Don't say nothin' to Blanche about\n            it.\n\n                         CLYDE\n            Hey, that time you broke out of\n            jail, she talk you into goin' back?\n\n                         BUCK\n                   (it is obvious he had\n                   hoped Clyde hadn't\n                   known about it)\n            Yeah, you hear about that?\n\n                         CLYDE\n            I won't say nothin' to Bonnie about\n            it.\n\n                         BUCK\n            I appreciate it.\n\n                         CLYDE\n            Yeah...say, what d'ya think of\n            Bonnie?\n\n                         BUCK\n            She's a real peach.\n\nThere is now a long pause--a lull in the conversation, as if\nthey asked each other all the questions and are now out of\nthings to say.  It is too much for BUCK, the natural enemy\nof silence, who suddenly claps his hands together and bursts\nout animatedly:\n\n                         BUCK\n            Boy, are we gonna have us a good\n            time!\n\n                         CLYDE\n                   (matching his merriment)\n            We surely are!\n\n                         BUCK\n            Yessir!\n                   (a pause, then:)\n            What are we gonna do?\n\n                         CLYDE\n            Well, how's this--I thought we'd\n            all go to Missouri.  They ain't\n            lookin' for me there.  We'll hole\n            up someplace and have us a regular\n            vacation.  All right?\n\n                                                           43.\n\n\n                         BUCK\n            No trouble, now?\n\n                         CLYDE\n            No trouble.  I ain't lookin' to go\n            back to prison.\n\n                         BUCK\n            Hey, what's this I hear about you\n            cuttin' up your toes, boy?\n\n                         CLYDE\n                   (ironically)\n            That ain't but half of it.  I did\n            it so I could get off work detail--\n            breakin' those damned rocks with a\n            hammer day and night.  Sure enough,\n            next week I got paroled.  I walked\n            out of that god-forsaken jail on\n            crutches.\n\n                         BUCK\n            Shoot--\n\n                         CLYDE\n            Ain't life grand?\n\nEXT. ROAD.  DAY.\n\nWe see the two cars, one behind the other, driving down a\nmain road.\n\nINT. FIRST CAR.  DAY.\n\nCLYDE is driving.  BUCK sits next to him.  No one else is in\nthe car.\n\n                         BUCK\n            And the doc, he takes him aside,\n            says, \"Son, your old mama just\n            gettin' weak and sickly layin'\n            there.  I want you to persuade her\n            to take a little Brandy, y'know, to\n            pick her spirits up.\" \"Why, doc,\"\n            he says, \"you know my mamma is a\n            teetotaler.  She wouldn't touch a\n            drop.\" \"Well, I tell you what,\" the\n            doc says, \"why don't you bring her\n            a fresh quart of milk every day\n            from your farm, 'cept you fix it up\n            so half of it's Brandy and don't\n            let on!\" So he does that, doctors\n            it up with Brandy, and his mamma\n            drinks some of it.\n                         (MORE)\n\n                                                           44.\n\n\n                         BUCK (CONT'D)\n            And the next day he brings it again\n            and she drinks some more--and she\n            keeps it up every day.  Finally,\n            one week later, he brings her the\n            milk and don't you know she just\n            shallows it all down, and looks at\n            her bag and says, \"Son, whatever\n            you do, don't sell that cow!\"\n\nCLYDE and BUCK explode in laughter.\n\nINT. SECOND CAR.  DAY.\n\nAt the top of the laugh, cut to the int. of the second car,\nriding right in back of them.  The atmosphere is completely\nunlike the cozy and jolly scene preceding.  We have dead\nsilence.  BONNIE is driving, smoking a cigarette, grim.\nBLANCHE--seated as far away as she can get from BONNIE\nwithout falling out of the car--makes a face at the cigarette\nsmoke, rolls down the window for air.  C.W.'s in the back\nseat, just staring.\n\n                                            CUT TO:\n\nEXT. GARAGE APARTMENT.  DAY.\n\nA residential street in Joplin, Missouri, showing a garage\napartment above a double garage.  Camera sees BUCK talking\nto a dapper gent with keys in his hand.  BUCK pays him.  The\nman tips his hat and walks off.  BUCK gestures and Clyde\ndrives a car into the driveway.  C.W. follows, driving\nBUCK's car with BLANCHE.  CLYDE stops beside BUCK.  BUCK\nleans into CLYDE's car and says:\n\n                         BUCK\n            I give him a month's rent in\n            advance.  We're all set.  Let's get\n            inside.\n\nCLYDE calls back to C.W. in the following car.\n\n                         CLYDE\n            Pull up and unload the stuff.\n\n                         BUCK\n                   (on the running board\n                   of moving car)\n            Honey-love, I'm taking you into our\n            first home.\n\nBLANCHE giggles.  The two cars pull up before the garage and\nthe people start to descend.\n\n                                                           45.\n\n\nINT. GARAGE APARTMENT.  DAY.\n\nA winded BUCK enters and puts down BLANCHE.  As others\nbehind him carry in their things and disperse throughout\napartment.\n\n                         BLANCHE\n            Oh look, it's so clean, Buck.  And\n            a Frigidaire...not an icebox!\n\n                         BUCK\n            He give me the grocery number.\n\nHe goes to the phone.\n\n                         BUCK\n                   (continuing)\n            Lemme see, eh 4337...Operator...\n            please ma'm, may I have 4337...if\n            you please?\n\n                         BLANCHE\n            Oh...they got linoleum on the\n            counter.  Ain't that clever!\n\n                         BUCK\n            Hello, Smitty's grocery...I'd like\n            to order a mess of groceries.  Oh\n            yeah...eh 143 Hillsdale Street.\n            Lessee, about 8 pounds of porkchops,\n            4 pounds of red beans...a can of\n            Chase and Sandborn...uh.\n\n                         BLANCHE\n            Oh, isn't this something, Daddy!\n\n                         BUCK\n            Sshh.  Uh...quart of milk...uh 8\n            bottles of Dr. Pepper and that's\n            it, I guess.  No...no.  Uh...a box\n            of Rice Krispies...Bye now.\n\n                                            CUT TO:\n\nINT. LIVING ROOM.  DAY.\n\nOpen on BONNIE and CLYDE.  He is cleaning guns.  She is\nwatching something off screen.  We hear a clicking sound.\n\n                         BLANCHE (O.S.)\n            My, you need a haircut, Daddy.  You\n            look like a hillbilly boy.\n\n                                                           46.\n\n\nA look of disgust crosses BONNIE's face.  CLYDE, who has\nbeen watching her, smiles.  The clicking sound increases\nsuddenly.\n\n                         BUCK (O.S.)\n            Gotcha!\n\nBLANCHE whoops.  Camera cuts to see that BUCK and C.W. are\nplaying checkers and BUCK has just beaten him.\n\n                         C.W.\n            Again.\n\n                         BUCK\n            Boy, you ain't never gonna beat me\n            but you keep tryin' now.\n\nHe starts to set up the game again.\n\n                         BLANCHE\n            Jest like an ol' man.  Plays\n            checkers all the time and doesn't\n            pay any attention to his poor\n            lonely wife.\n\nShe ruffles his hair again.\n\n                         BUCK\n            Cut it out now, honey.  I'm gonna\n            teach this boy a lesson he'll never\n            forget.\n\nCamera cuts to BONNIE, watching with disgust.  Then slowly,\na wicked little smile edges across her face.  She watches\nfor a moment more, then she rises and with the most ingenuous\nlook she can muster up, beckons to CLYDE to follow her into\nthe bedroom.  A little puzzled, CLYDE follows.\n\nINT. BEDROOM.\n\nBONNIE closes the door and immediately begins fussing with\nCLYDE's hair, doing a scathing imitation of BLANCHE.  Though\nher miming expresses her irritation at being closeted with\nthe Barrow menage, it is also a peach doing an imitation of\na lemon--and it is disarmingly sensual... Indeed the mimicry\nallows BONNIE to be physically freer with CLYDE, and allows\nCLYDE to respond without anxiety, without self-consciousness.\nWe should have the distinct--if momentary--feeling that\nCLYDE could suddenly make it with BONNIE.\n\n                                                           47.\n\n\n                         BONNIE\n                   (doing an unmerciful imitation)\n            Oh, Daddy, you shore need a haircut.\n            You look just like a little old\n            hillbilly boy, I do declare.\n                   (she has her other\n                   hand toying with the\n                   buttons on his shirt,\n                   her hand slipping\n                   under, fluttering\n                   across his bare chest)\n            Oh mercy me, oh my stars!\n\nCLYDE laughs, and BONNIE tugs at the shirt--she kneels on\nthe bed over CLYDE, who quite easily drapes across it.\n\n                         BONNIE\n                   (a little louder)\n            Oh, Daddy!  Yore such a slowpoke!\n\nShe's letting her hair fall loose, its golden ends brushing\nup and down CLYDE's body.\n\n                         CLYDE\n                   (amused, but cautionary)\n            Hush up a little.  They're in the\n            next room.\n\n                         BONNIE\n                   (a mock-pout, but\n                   with an edge to it)\n            Shoot, there's always somebody in\n            this room, the next room and ever'\n            other kind of room.\n\nCLYDE has his arm around BONNIE, and she's almost draped\nacross him--but in the direction of the length of the bed,\nso their bodies almost form a crooked cross.  She digs an\nelbow into his stomach.\n\n                         CLYDE\n            Oof!...now that ain't no nice way\n            to talk about my brother.\n\n                         BONNIE\n                   (imitating Blanche\n                   again with baby talk)\n            I ain't talking about your brother.\n\nSuddenly BONNIE straightens up to a kneeling position again,\nand cocks her head.  When she speaks now it is with a simple\nplaintiveness.\n\n                                                           48.\n\n\n                         BONNIE\n            Honey, do you ever just want to be\n            alone with Me?\n                   (sensing Clyde's\n                   sensitivity to the\n                   sexual implication)\n            I don't just mean like that...I\n            mean do you ever have the notion of\n            us bein' out together and alone,\n            like at some fancy ball, or, I\n            don't know, where we walk in all\n            dressed and they announce us and\n            it's fancy and in public, but we're\n            alone somehow.  We're separate from\n            everybody else, and they know it.\n\nCLYDE looks up to BONNIE, affectionately.  He runs his hand\ncarelessly down her body.\n\n                         CLYDE\n            I always feel like we're separate\n            from everybody else.\n\n                         BONNIE\n                   (it's terribly\n                   important to her)\n            Do you, baby?\n\nSuddenly there is a ring at the door.  BONNIE and CLYDE\nfreeze.\n\nINT. LIVING ROOM.\n\nBONNIE and CLYDE run out into the living room, camera going\nwith them.\n\n                         BONNIE\n                   (to all)\n            Quiet!  I'll get it.\n\nBONNIE goes down the stairs and reaches the front door.\n\n                         BONNIE\n            Who is it?\n\n                         VOICE\n            Groceries, M'am.\n\nEXT. GARAGE APARTMENT.\n\nShe opens the door.  A young man is there with the two big\nsacks of groceries.\n\n                                                           49.\n\n\n                         BONNIE\n            How much?\n\n                         YOUNG MAN\n            Six dollars and forty-three cents.\n\nBONNIE pays him and goes to take the bags from him.\n\n                         YOUNG MAN\n            Here, M'am, them bags is heavy.\n            Let me carry 'em up for you.\n\n                         BONNIE\n                   (curtly)\n            No thanks, I'll take 'em.\n\nShe takes the heavy bags and hefts them up and turns and\nwalks up the stairs.  They are obviously very heavy for her.\nCloseup the delivery boy's face, looking puzzled at this\nbehavior.  BONNIE reaches the top steps, and voices are heard.\n\n                         BUCK'S VOICE\n            What was it?\n\n                         CLYDE'S VOICE\n            Quiet.  Open the door.\n\n                         BONNIE\n            C'mon, c'mon...\n\nClose-up.  The DELIVERY BOY.  A look of suspicion comes\nacross his face.\n\n                                            DISSOLVE TO:\n\nINT. GARAGE APARTMENT.\n\nClose-up of BONNIE--seated in the living room.\n\n                         BONNIE\n                   (reading from a pad;\n                   in a recital voice)\n            It's called \"The Ballad of Suicide\n            Sal.\"\n                   (she pauses for\n                   effect; then begins:)\n            \"We each of us have a good alibi\n            For being down here in the 'joint';\n            But few of them really are justified\n            If you get right down to the point.\n            You've heard of a woman's glory\n            Being spent on a downright cur'.\"\n\n                                                           50.\n\n\n                         BUCK'S VOICE (O.S.)\n            You write that all by yourself?\n\n                         BONNIE\n            You want to hear this or not?\n\nAs she reads, the camera pans around the room picking out\neveryone's reaction.  CLYDE is looking and listening\nseriously.  BUCK is grinning.  C.W. is blank.  BLANCHE is in\nthe kitchen cooking.\n\n                         BONNIE\n            \"Still you can't always judge the\n            story\n            As true, being told by her.\n            Now 'Sal' was a gal of rare beauty,\n            Though her features were coarse and\n            tough--\"\n\n                         BUCK\n            Yeah, I knew her.  She was cockeyed\n            and had a hare-lip and no teeth!\n\nBONNIE flashes him a look that could kill.  He shuts up fast.\nShe continues:\n\n                         BONNIE\n            \"Now 'Sal' was a gal of rare\n            beauty,\n            Though her features were coarse and\n            tough;\n            She never once faltered from duty\n            To play on the 'up and up'.\"\n\nStill listening, CLYDE gets up from his chair and walks\nslowly past the living room windows.  The camera angled\nslightly above him, sees down the street.  We see two police\ncars quietly pulling up.  One of them parks sideways in the\ndriveway to block escape from the garage, the other stays on\nthe street.  CLYDE turns and looks out the window.\n\n                         BONNIE\n                   (o.s. as we see out\n                   the window)\n            \"Sal told me this tale on the\n            evening\n            Before she was turned out free,\n            And I'll do my best to relate it\n            Just as she told it to me--\"\n\n                         CLYDE\n                   (seeing it)\n            It's the law.\n\n                                                           51.\n\n\nAs soon as CLYDE calls out, BLANCHE drops the frying pan on\nthe floor and begins screaming.  Camera cuts back to the\nliving room.  Everyone else leaps into action.  Guns begin\nblazing from everywhere; we rarely see who is shooting at\nwhom.\n\nEXT. GARAGE APARTMENT.  DAY.\n\nThe police, down the stairs into the garage--we follow them\nwith a hand-held camera tracking rapidly.\n\nEXT. STREET.  DAY.\n\nBLANCHE, however, in utter panic, just runs right out the\nfront door, and begins running down the quiet residential\nstreet, going nowhere, anywhere.\n\nEXT. GARAGE APARTMENT.  DAY.\n\nBUCK, crouching, shooting with one hand, gets the garage\ndoor open.  A policeman fires.  BUCK fires back and the cop\nfalls dead in the street.  BUCK, firing, dashes to the\npolice car blocking their escape and releases the hand brake.\nCLYDE, BONNIE and C.W. leap into their car, gun the motor,\nstill shooting madly.  Two more police fall dead or wounded.\nOne policeman is hurled through a fence by the blast of a\nsawed-off shotgun.  BUCK jumps into the car with the others.\nThey now begin to bump the police car with their car.  The\npolice car picks up speed as they push it and it tears into\nthe street right at the group of firing police.  The gang's\ncar turns into the street toward the running BLANCHE.\nBONNIE and CLYDE are in front; BUCK and C.W. in the back\nseat firing back at police.  The car pulls alongside the\nwildly running BLANCHE; the back door is flung open and in\nalmost the style of a cartoon, two hands reach out and lift\nher off her feet and pull her into the car.  They speed away.\n\n                                            CUT TO:\n\nINT. CAR.  DAY.\n\nThe inside of the car, still speeding.  BLANCHE is hysterical.\nC.W. is still firing out the window.  The pursuing police\ncar's driver is shot and the car crashes into a tree.  The\ngang is not being pursued now, but CLYDE is driving at 90.\nBLANCHE is moaning and crying.  BONNIE, in front, turns\naround furiously.\n\n                         BONNIE\n            Dammit, you almost got us killed!\n\n                                                           52.\n\n\n                         BLANCHE\n                   (crying)\n            What did I do wrong?  I s'pose\n            you'd be happier if I got shot.\n\n                         BONNIE\n                   (at her bitchiest)\n            Yeah, it would of saved us all a\n            lot of trouble.\n\n                         BLANCHE\n            Buck, don't let that woman talk to\n            me like that!\n\n                         BUCK\n                   (caught in the middle\n                   of a bad situation,\n                   knowing Blanche is\n                   wrong, but trying to\n                   soothe her)\n            You shouldn't have done it, Blanche.\n                   (quietly, cont.)\n            It was a dumb thing to do.\n\n                         BLANCHE\n                   (switching tactics)\n            Please, Buck, I didn't marry you to\n            see you shot up!  Please, let's go!\n            Let's get out of here and leave.\n            Make him stop the car and let us out!\n\n                         BUCK\n                   (still quietly)\n            Can't.  I killed a man.  We're in\n            this now.\n\n                         BLANCHE\n                   (loud and shrill)\n            Please!  Please!\n\n                         BONNIE\n                   (exploding)\n            Shut up!  Just shut up your big\n            mouth!  At least do that, will ya,\n            just shut up.\n\n                         CLYDE\n            Cut it out, Bonnie.\n\nBONNIE is affronted.  BLANCHE continues sobbing.\n\n                         BONNIE\n                   (curtly)\n            Stop the car.  I want to talk to you.\n\n                                                           53.\n\n\nWithout a word, CLYDE stops the car.\n\nEXT. ROADSIDE.  DAY.\n\nBONNIE and CLYDE get out and walk fifteen feet away from the\ncar.  Both are irritated and touchy.  Camera follows them.\n\n                         CLYDE\n                   (coldly)\n            What is it?\n\n                         BONNIE\n            Get rid of her.\n\n                         CLYDE\n            Can't do that.  She's Buck's wife.\n\n                         BONNIE\n                   (snapping her words)\n            Get rid of both of them then.\n\n                         CLYDE\n            Why?  What's the matter with you\n            anyway?\n\n                         BONNIE\n            She's what's the matter with me, a\n            damn stupid back country hick\n            without a brain in her head.\n                   (contemptuously)\n            She ain't nothin' but prunes and\n            proverbs.\n\n                         CLYDE\n                   (really pissed-off at Bonnie)\n            What makes you any better?  What\n            makes you so damn special?  You're\n            just a West Dallas waitress who\n            spent half your time pickin' up\n            truck drivers!\n\nThis hits home with BONNIE.  He has said the unforgivable.\n\n                         BONNIE\n                   (raising her voice)\n            You talk to me like that!  Big\n            Clyde Barrow, just the same as your\n            brother, an ignorant uneducated\n            hillbilly.\n                   (with deadly archness)\n            Only special thing about you is\n            your peculiar ideas about\n            lovemakin'--which is no love makin'\n            at all.\n\n                                                           54.\n\n\nCLYDE stiffens.  The two of them stand silent and tense,\nalmost quivering with anger.  They have stripped each other\nraw.  CLYDE turns and looks back at the car.  Everyone is\nwaiting, watching them.  He breathes a deep sigh, like a man\ncounting to 10 to hold his temper.\n\n                         CLYDE\n            Look, Bonnie--\n\nHe can't finish.\n\nClose.  BONNIE.  She drops her head into her hand for a\nmoment, comes up a little more relaxed.  She looks at CLYDE\nand her eyes reflect the realization of the pain she has\ninflicted on him.  She softens.\n\n                         BONNIE\n            Clyde...honey...I didn't mean all\n            that, honey.  Blame it on all that\n            shootin', I just felt so bad...sure\n            enough...Clyde?\n\n                         CLYDE\n            Okay...Okay, hon...let's get\n            movin'...\n\nHe turns and begins walking back to the car.  BONNIE walks\nalongside him.  On the few steps back, she regains all her\ndignity and acts aloof from the others waiting for her.  She\nreaches the car.  CLYDE opens her door for her and she gets\nin like a great lady.  He walks around to his side, gets in,\nand they drive off.\n\nWIDE SHOT.  EXT. CAR.  DAY.\n\nA very wide shot.  We see CLYDE's car driving along a wooded\nroad.  For a moment that is all we see, then we should\nbecome aware that far in the distance another car is\nfollowing CLYDE's.\n\nClose. Rural mail box.  On the opposite side of the road,\nCLYDE's car swings across the road and CLYDE, who is driving,\nsnatches a newspaper which protrudes from the box and hands\nit into the car.  They drive out of the shot.  Camera holds\nand soon the following car enters the shot.  The man driving\nis a Texas ranger.  He drives slowly.  He drives out of the\nshot.\n\nINT. CLYDE'S CAR.\n\nBUCK is reading from the paper.\n\n                                                           55.\n\n\n                         BUCK\n                   (jubilantly)\n            Hey, y'all, listen to this here:\n            Law enforcement officers throughout\n            the Southwest are frankly amazed at\n            the way in which will-of-the-wisp\n            bandit Clyde Barrow and his yellow-\n            haired companion, Bonnie Parker,\n            continue to elude their would-be\n            captors.  Since engaging the police\n            in a gun battle on the streets of\n            Joplin Missouri and slaying three\n            of their number...\n\n                         BLANCHE\n            Oh, Lord...\n\nWe notice CLYDE is wincing.\n\n                         BUCK\n            ...the Barrow gang has been reported\n            as far West as White City, New\n            Mexico, and as far north as Chicago.\n            They have been credited with\n            robbing the Mesquite Bank in the\n            aforementioned White City, the J.J.\n            Landry Oil Refinery in Arp, Texas,\n            the Sanger City National Bank in\n            Denton, Texas on three different\n            occasions.  In addition to these\n            robberies, the fast travelling\n            Barrows have been rumored to have\n            had a hand in the robbing of two\n            Piggly Wiggly stores in Texas, and\n            one A&P store in Missouri, though\n            Chief Percy Hammond, who first\n            identified Clyde Barrow's brother,\n            Buck, as a member of the gang,\n            expressed some doubt that these\n            last robberies were committed by\n            the Barrow Gang alone.\n\n                         BONNIE\n            Go on.\n\n                         C.W.\n                   (finally)\n            Clyde, we ain't goin' to see a\n            restroom for another thirty miles.\n            Why don't you just stop here?\n\nCLYDE looks relieved.\n\n                                                           56.\n\n\nEXT. WOODED AREA.  DAY.\n\nHe pulls the car to a stop, gets out and goes off into the\nwoods.  We watch him vanish behind the trees.\n\nINT. CAR.\n\nBUCK still scanning the newspaper.\n\n                         BUCK\n                   (with a laugh)\n            Hey now, here's something!  Listen\n            here: Lone Cop Arrests Two Officers\n            In Hunt For Barrow.  Police Officer\n            Howard Anderson's heart turned\n            faster than his motorcycle when he\n            forced to the side of the road a\n            roaring black V-8 sedan in which\n            were three men and a blondheaded\n            woman yesterday afternoon.\n\nEverybody laughs.  As BUCK continues to read, his voice\nremaining on the soundtrack.\n\nEXT. CAR.\n\nThe camera goes outside the car and pulls back, way back, to\nreveal a police car quietly driving up behind the car.  The\ncar stops a good distance away and one man gets out, the\nonly occupant of the car.  He is tall, dressed in the\nuniform of the Texas Ranger.  He draws his gun and slowly\napproaches the car from the rear.  On the soundtrack BUCK's\nvoice continues; as we see all this taking place.\n\n                         BUCK\n            When he saw several machine guns in\n            the car he was certain he'd caught\n            Clyde Barrow, Bonnie Parker, and\n            maybe Buck Barrow and the third\n            unidentified member of the gang.\n            It took a lot of telephoning and\n            explaining to convince the\n            motorcycle cop that his captives\n            were two highway patrolmen and a\n            blonde-haired stenographer from the\n            Highway Patrol--.  Haw!  Haw!\n                   (everybody busts up\n                   with laughter)\n\n\nIn the meantime, on screen, the lawman is slowly approaching\nthe back of the car.  Suddenly, cut to shot of CLYDE coming\nout of the woods, behind the lawman.  His gun is tucked in\nhis pants.  In a second, he sees what is happening.\n\n                                                           57.\n\n\nBUCK's voice is continuing:\n\n                         BUCK\n            Anderson was held up as an example\n            for every other Texas peace officer\n            today. \"That was a mighty brave\n            thing,\" explained Highway Patrol\n            Chief L.C. Winston.\n\nCLYDE whips out his gun.  The following scene is played\nexactly like a classic fast-draw in an heroic Western.\n\n                         CLYDE\n            Sheriff!\n\nBRYCE spins around.  Both men fire instanteously, but CLYDE\nhas the draw on him, and the aim.  The gun goes flying from\nthe SHERIFF's hand.  A really razzle-dazzle display of\ngrandstand marksmanship from Clyde.\n\nImmediately the gang leaps from the car and surrounds the\nman, guns drawn.\n\n                         C.W.\n            Boy!  What a shot, Clyde!\n\n                         BUCK\n            Sweet Jesus, I never seen shootin'\n            like that!\n\nThe gang grabs the man and takes his handcuffs from his belt.\nCLYDE makes him lean on the car's hood, arms extended, legs\nspread, while he frisks him.  In general, everyone is\nexcited over the capture.  BONNIE takes the sheriff's gun\nand delicately places it on the radiator grill like an\nobject d'art.\n\n                         CLYDE\n                   (examining the man's\n                   wallet, really surprised)\n            Well, now, getta load of this.  I\n            want y'all to know we are in the\n            custody of Cap'n Frank Bryce, and\n            Frank here is a Texas Ranger.\n\nRev. angle across hood--so BRYCE's face, not visible to\nCLYDE or anyone else behind him, is in foreground.  His\ngnarled, powerful hands tremble slightly on the hood, as tho\nthey might crinkle the metal like so much tissue paper.  His\neyes stare toward camera relentlessly, unblinking, but\nwithout passion.  They are shark's eyes.  They have witnessed\nmuch carnage, devoured it, and are still wide open for more.\n\n                                                           58.\n\n\n                         C.W.\n            Sure 'nough, Clyde?\n\n                         BUCK\n            Say there, peacemaker.  I believe\n            you got your spurs all tangled up.\n            You're in Missouri, you know that?\n\nCLYDE has been going thru the man's  credentials.  Not so\npleasantly:\n\n                         CLYDE\n            You didn't know you was in Missouri?\n\n                         C.W.\n            He's lost, this here Texas Ranger.\n\nCLYDE claps BRYCE's hands behind his back, handcuffs him,\nspins him around.\n\n                         CLYDE\n                   (a little pissed)\n            --he ain't lost...them banks are\n            offerin' extra reward money fer us,\n            and Frank figured on easy pickin's,\n            didn't you?\n                   (he suddenly knocks\n                   Bryce's hat off)\n            Didn't you?\n\nBRYCE flinches involuntarily.  BUCK suddenly grows wary at\nCLYDE's mood.  CLYDE leans into BRYCE, looking up.\n\n                         CLYDE\n            --Now you ain't hardly doin' your\n            job, Texas Ranger.  You oughta be\n            home lookin' after the rights of\n            poor folks, not out chasin' after us.\n\nHe suddenly hefts BRYCE's huge bulk onto the fender.\n\n                         BUCK\n                   (trying to be casual)\n            Easy there, Clyde.  Why take is so\n            personal.\n\n                         CLYDE\n                   (to Bryce)\n            Reg'lar laws is one thing.  But\n            this here bounty hunting, we got to\n            discourage that.\n\nBLANCHE looks very uncomfortable.  She starts to say\nsomething, but BUCK intervenes.\n\n                                                           59.\n\n\n                         BUCK\n            Like how, Clyde?--\n\nA tense moment.  CLYDE can't think of anything right away.\n\n                         C.W.\n                   (trying to be helpful)\n            Shoot him.\n\nBONNIE shoots C.W. an angry glance--it's just what the gang\ndoesn't want.\n\n                         C.W.\n                   (trying again)\n            ...hang him?...\n\nReaction--BONNIE carefully gauging the moment to intervene.\n\n                         BONNIE\n                   (suddenly)\n            --uh-uh.  Take his picture.\n\nCLYDE's not sure he's heard right.  Neither is C.W.\n\n                         C.W.\n            Take his picture?\n\n                         BONNIE\n                   (pointedly ignoring\n                   C.W., brightly)\n            Then we'll let the newspapers have\n            it--so's everyone can see Captain\n            Frank Bryce of the Texas Rangers\n            with the Barrow gang--\n                   (moving demurely to Bryce)\n            --and all bein' just as friendly as\n            pie.\n\n                         BUCK\n                   (grasping\n                   possibilities immediately)\n            ...yeah, yeah...\n\n                         BONNIE\n                   (continuing right on,\n                   coyly picking up\n                   Bryce's gun from grill)\n            --why we 'bout the friendliest\n            folks in the world.  Texas Ranger\n            waves his big ol' gun at us, and we\n            just welcome him like he's one of\n            our own.\n\n                                                           60.\n\n\n                         CLYDE\n                   (grinning widely)\n            Buck, get the Kodak!\n\n                         BUCK\n                   (relieved and excited)\n            Hot dog!\n\n                         CLYDE\n                   (to Bryce)\n            We're mighty proud to have a Texas\n            Ranger in the family.\n\nBRYCE is obviously not pleased with this turn of events.\nFollowing dialogue is overlapped, ad-libbed, etc.  A sense\nof mounting glee at the kind of vengeance they are going to\nexact.\n\nNew angle.  BUCK is fiddling with the camera, setting up the\nshot with CLYDE.  BUCK's following speech should be heard,\nb.g., to CLYDE's speech below it.\n\n                         BUCK\n            ...keep him set on the hood,\n            there...more to the sun, like\n            that...yeah...when all his ranger\n            friends see this...I bet he's gonna\n            wish he was dead!\n\n                         CLYDE\n                   (to Bryce)\n            ...see what come o' your\n            mischief?...not doin' your job?\n            Down in Duncanville last year poor\n            farmers kepts the laws away from us\n            with shot guns...you're s'posed to\n            be protectin' them from us, and\n            they're protectin' us from you.\n                   (giggling)\n            --don't make sense, do it?\n\n                         BUCK\n            C'mon, now, Clyde, you and Bonnie\n            first.  Move into him, right close,\n            right friendly.\n\n                         CLYDE\n            All righty\n                   (to Bryce, whose\n                   hands are tied,\n                   hemmed in by them both)\n            Don't move, now, hear?\n\n                                                           61.\n\n\nCLYDE grandly puts an arm on BRYCE's shoulder, BONNIE,\nlooking up admiringly from the other side.  BUCK takes the\npicture.  BONNIE immediately hops onto the hood, next to\nBRYCE.\n\n                         BONNIE\n            How's this? \"Captain Bryce and new\n            found friend.\"\n\nShe coyly loosens his tie, tousles his hair, and plants a\nbig kiss on him while still ogling camera.\n\n                         CLYDE\n            ...yeah, yeah...quick, Buck, get\n            it...\n\n                         BUCK\n            ...I'm gettin' it, I'm gettin' it.\n\nQuite suddenly BRYCE, whose simmering intensity we should be\nmore sensitive to than the gang is, spits on Bonnie.  BONNIE\nhalf-screams in disgust, but CLYDE is on top of BRYCE in a\nflash, half-strangling on his own fury.  He pulls BRYCE off\nthe fender by the handcuffs, spinning him around crazily\nlike a lasso.  BRYCE is literally ricocheted off the car by\nthe force, and, with CLYDE hanging on by the cuffs, plummets\ndown the embankment to the sandy beach below, both men\nfalling, spinning.  BRYCE rises shakily.  He tries to walk\naway.  CLYDE grabs him again by the handcuffs and hurls him\nout into the water.  BRYCE smacks into a tree stump poking\nout of the shallows and goes down.  CLYDE is on top of him.\n\nMeanwhile, BUCK has rushed down into the water, tries to\npull CLYDE off BRYCE.\n\n                         BUCK\n                   (frantic)\n            I got the picture.  I got the\n            picture...\n\n                         CLYDE\n                   (oblivious)\n            Lemme be, lemme be...\n\nBRYCE reaches the surface and CLYDE tries to throw him into\ndeeper water.  He hitches BRYCE over a moldy skiff, knocking\naside one of the oars.  BUCK upends BRYCE into the skiff and\nkicks it spinning.  CLYDE picks up an oar and hurls it like\na boomerang, ass over end at the skiff.  It kicks up a spray.\n\n                         BUCK\n                   (holding tightly to\n                   Clyde, yelling)\n            I got the PICTURE!\n\n                                                           62.\n\n\nReaction.  CLYDE waist deep, breathing heavily.\n\n                         CLYDE\n            ...All right, all right...\n                   (to Bryce, yelling)\n            WE GOT YOU...HEAR?... REMEMBER...\n            YOU... YOUR FACE...WE GOT IT...WE\n            GOT YOU...WE GOT YOU...WE GOT YOU...\n\nBRYCE, battered and handcuffed, stares back with mindless\nmalice from the lazily spinning skiff to the hysterical\nspectre of CLYDE, screaming his madness across the water.\n\n                                            DISSOLVE:\n\nINT. BANK.\n\nInside the bank.  In contrast to the previous inept bank\nrobbery scene, this one goes admirably well, the gang\nperforming slickly and without a hitch.  As they enter,\ndripping wet, CLYDE makes a general announcement to everyone\nto the bank.\n\n                         CLYDE\n            This is the Barrow gang.\n                   (the people turn and freeze)\n            Everybody just take it easy and\n            nobody will get hurt.\n\nCLYDE covers the door.  BONNIE and BUCK go to the tellers'\ncages and get money.  BUCK goes inside, emptying out the\ncash drawers.  Cut to BONNIE filling the sack.\n\nCut to a close-up of a burglar alarm button.  Slowly a hand\ncrawls up the wall and a finger slowly moves to push the\nbutton.  When the finger is about one inch away, suddenly a\ngun appears in the frame and gently taps the hand away.  The\ncamera pulls back to reveal BUCK smiling at a lady teller.\n\n                         BUCK\n            Don't do nothin' silly now.\n\nCut to CLYDE standing near the door, training his guns on\nthe entire bank.  A farmer stands a few feet away, some\nbills clutched in his hand.\n\n                         CLYDE\n            That your money or the bank's?\n\n                         FARMER\n            Mine.\n\n                         CLYDE\n            Keep it, then.\n\n                                                           63.\n\n\nAcross the floor, the bank guard in the corner takes\nadvantage of CLYDE's distraction to go for his gun.  CLYDE\nspots it and fires a shot that just knocks the bank guard's\nhat off without harming him.\n\n                         CLYDE\n                   (to the guard, who\n                   has practically\n                   frozen in fear)\n            Next time I'll aim a little lower.\n\nThey finish robbing the bank.  They start to exit.  Near the\ndoor stands a guard with his hands raised.  He wears sun\nglasses of the period.  As they leave BUCK snatches the sun\nglasses from the guard's head.\n\n                         BUCK\n            Get a good look at us!  We're the\n            Barrow boys.\n\nEXT. BANK.  DAY.\n\nThe gang runs wildly into the street where the car waits,\nmotor running.  As they leap into car, BUCK throws the sun\nglasses into BLANCHE's lap.\n\n                         BUCK\n            Happy birthday.\n\nThey zoom off.  Shots are heard.  BONNIE, BUCK and CLYDE\nbegin firing at the bank guards who are pursuing them.  The\nguards fire back.\n\nClose-up.  BLANCHE sitting in the back seat with her fingers\nstuck tightly in her ears, eyes shut, trying to overcome her\npanic.  A funny image, but one that also awakens pity.  The\nnext sequence is carried out in cross-cutting.\n\n                                            CUT TO:\n\nThe street in front of the bank.  Police car pulls up and\nthe excited crowd gestures in the direction of the departed\ngang.  The siren starts.\n\n                                            CUT TO:\n\nINT. GANG CAR.  DAY.\n\nThe siren heard now in the far distance.\n\n                         BUCK\n                   (to C.W. at the wheel)\n            Kick it in the pants, C.W.\n\n                                                           64.\n\n\n                         CLYDE\n            We got to make that state line!\n\n                         C.W.\n                   (driving like a wild\n                   man, but adlibing loudly)\n            Can't get more'n this out of a\n            Plymouth!\n\n                                            CUT TO:\n\nINT. BANK.\n\nThe gang has left a legacy of celebrity behind.  We see the\nbank guard whose hat was shot off being interviewed by a\nreporter.  He is seated in a chair, his shirt open at the\ncollar and a woman teller is fanning him.\n\n                         BANK GUARD\n                   (enjoying the limelight)\n            Then he saw me goin' for my gun.\n            Clyde Barrow himself, I mean.  And\n            suddenly I was starin' into the\n            face of death!\n\n                         WOMAN TELLER\n            Tsk, tsk.\n\nA photographer steps in.\n\n                         PHOTOGRAPHER\n            Just look this way, Mr. Hawkins.\n\nThe bank guard hurriedly buttons up his collar and smiles as\nthe flashbulb goes off.\n\n                                            CUT TO:\n\nEXT. GANG CAR.\n\nStill speeding along, the siren more distant.\n\n                                            CUT TO:\n\nINT. BANK.\n\nThe bank president and a policeman are posing for that\nclassic picture where both stand flanking a bullet hole in\nthe wall and point proudly at it.  The flashbulb goes off.\n\n                                            CUT TO:\n\n                                                           65.\n\n\nINT. POLICE CAR.\n\nTwo men in police uniforms following BONNIE and CLYDE.\n\n                         FIRST POLICEMAN\n            Step on it, Randolph.  We gotta\n            catch 'em 'fore they reach the\n            state line!\n\n                                            CUT TO:\n\nINT. BANK.\n\nFARMER is describing BONNIE and CLYDE to passersby who dote\non him as though he'd just had contact with a portion of the\ntrue cross.  FARMER is aware of his position.\n\n                         FARMER\n            Clyde?...he looked like, well he\n            looked real...clean...and Bonnie,\n            she's too much a lady ever to be\n            caught with a cigar in her mouth...I\n            don't care what you heard before.\n            I saw 'em right here, not twenty\n            minutes ago...\n                   (gravely)\n            --and all's I can say is, they did\n            right by me, and I'm bringin' me a\n            mess of flowers to their funeral.\n\n                                            CUT TO:\n\nINT. GANG'S CAR.\n\nCar slows up perceptibly as CLYDE says:\n\n                         CLYDE\n            Okay, relax.  We're in Oklahoma now.\n            Slow down.\n\n                                            CUT TO:\n\nINT. POLICE CAR.\n\n                         FIRST POLICEMAN\n            Turn around.  Don't waste no more\n            gas.\n\n                         SECOND POLICEMAN\n                   (a young eager beaver type)\n            Ain't we gone to catch 'em?\n\n                                                           66.\n\n\n                         FIRST POLICEMAN\n            Hell, they're over the State line.\n            That's out of our jurisdiction.\n\n                         SECOND POLICEMAN\n            Why don't we get 'em anyway?\n\n                         FIRST POLICEMAN\n            I ain't gone to risk my life in\n            Oklahoma.  That's their problem.\n\n                                            CUT TO:\n\nEXT. CAR.\n\nNow the gang's car is seen traveling down a long, narrow\ncountry road surrounded by cornfields.\n\n                                            CUT TO:\n\nEXT. ROADSIDE BY WOODS.  DAY.\n\nThey get out, taking the various bags of money with them,\nand dump the lot on the hood.  There is not an impressive\namount of money.\n\n                         CLYDE\n                   (disappointed)\n            Hell.  That ain't much, is it?\n\n                         BUCK\n                   (commiseratingly)\n            Times is hard,\n\n                         CLYDE\n            Well, let's get to it.\n\nHe begins dealing and splitting the money out on the hood of\nthe car, as they gather around.\n\n                         CLYDE\n            This is Clyde Barrow.\n                   (lays down a bill)\n            Buck Barrow...\n                   (lays down a bill)\n            Bonnie Parker...C.W.\n                   (goes back to the\n                   first again and lays\n                   out another round)\n            Clyde, Buck...Bonnie...C.W. Clyde,\n            Clyde again...Buck...Bonnie...C.W.\n\nBUCK and BLANCHE stand watching.  BLANCHE looks fretful.\nShe nudges BUCK and whispers to him.\n\n                                                           67.\n\n\nBUCK whispers something back to her.  Meanwhile, CLYDE's\ncounting still goes on.\n\n                         CLYDE\n            Bonnie...C.S....Clyde...\n\n                         BUCK\n                   (very ill at east in\n                   this position he has\n                   been forced into)\n            Um...eh...Clyde?\n\n                         CLYDE\n            Hah?\n\nBUCK is clearly embarrassed.\n\n                         BUCK\n            Uh, Clyde...well...what about\n            Blanche?\n\nEveryone reacts with stunned amazement at BLANCHE's nerve in\nwanting to get her cut.\n\n                         BONNIE\n                   (incredulous)\n            WHAT?\n\nBLANCHE sees she has to rise to her own defense, and she\nrises to the occasion with spirit and verve.\n\n                         BLANCHE\n            Well, why not?  Say I earned my\n            share!  Same as everybody.  I\n            coulda got killed same as everybody,\n            and I'm wanted by the law same as\n            everybody.  Besides I coulda got\n            snake bit sleepin' in them woods\n            every night!\n                   (building it up)\n            I'm just a nervous wreck and that's\n            the truth.  And I have to listen to\n            sass from Miss Bonnie Parker all\n            the time.  I deserve mine!\n\nClose.  BUCK.  Day--looking at CLYDE, his face full of weak\nsmiles and embarrassment at his wife.\n\n                         CLYDE\n                   (with a sigh)\n            Okay...okay...hold your horses,\n            Blanche.  You'll get your share.\n\n                                                           68.\n\n\nBONNIE is livid but says nothing.  CLYDE, the leader has\ndecided.  C.W. looks indignant, like a hog who's just been\ngiven a bath.  CLYDE begins counting all over again in near\nsilence.\n\n                         BUCK\n            Married a preacher's daughter and\n            she still thinks she's takin' the\n            collection.\n\nEveryone now laughs, but BLANCHE.  CLYDE continues counting.\n\n                         BUCK\n                   (to Blanche)\n            Well, don't spend it all in one\n            place now, hear?\n\n                         BONNIE\n            She'll be doin' right well to spend\n            it at all.\n\nBONNIE turns and ambles away from the car.  After a moment\nCLYDE stops counting and moves after her.  He's prepared for\na fight, stands behind BONNIE's arched back trying to gauge\nthe degree of hostility there.\n\n                         CLYDE\n            Bonnie?\n\nNo answer.\n\n                         CLYDE\n                   (a little defensive)\n            Look, Bonnie, I've said it and I\n            guess I'll keep sayin' it before\n            we're thru--Blanche is Buck's wife\n            and Buck is family.\n\nHe waits expectantly.\n\n                         BONNIE\n                   (finally, utterly\n                   without malice)\n            --she's such a silly-Billy...\n\nBONNIE looks plaintively to CLYDE.\n\n                         BONNIE\n            My family could use some of that\n            money.\n\n                                                           69.\n\n\n                         CLYDE\n            Them laws have been hangin' round\n            your mamas house 'til all hours,\n            Bonnie.  It's just too risky to go\n            there.\n\n                         BONNIE\n                   (exploding)\n            Well, where can we go?  We rob the\n            damn banks, what else do we do?\n\nCLYDE cannot really answer.  Suddenly C.W. starts yelling:\n\n                         C.W.\n            CLYDE!  CLYDE!  CLYDE!\n\nCLYDE flinches at the sound.  C.W. comes bounding over, as\nrude an assault on their sensibilities as he can be.\n\n                         CLYDE\n                   (wincing as they are\n                   nose to nose)\n            I hear you, C.W.\n\n                         C.W.\n            This ol' heap's gushin' oil!  We\n            got to swipe us another set of\n            wheels right away, or we won't get\n            anywhere.  Look here.\n\nHe reaches down under the pan of the car and scoops a gooey\nhandful of slick black oil which he holds before their faces.\n\n                         C.W.\n            See?\n\nCLYDE nods slowly.  He looks back to BONNIE.  He sees.\n\n                                            DISSOLVE:\n\nEXT. SUBURBAN STREET.\n\nA residential neighborhood on a suburban street.  A rather\nwell-to-do neighborhood.  The camera is up on a porch of a\nwhite frame house, looking toward the street.  On the porch,\nsitting in the swing in the left f.g. are a MAN and a WOMAN.\nShe is about twenty-nine, he is about thirty-six.  He is\nsitting with his back to us, embracing the WOMAN.  They are\nspooning, making low, loving murmurs.\n\n                         WOMAN\n            Oh, now...now, dear...\n\n                                                           70.\n\n\n                         MAN\n            Mmmm...sweet thing...\n\nWe see in the distance two cars parked in front of the house.\nHis and hers.  Suddenly we see another car drive up (BONNIE\nand CLYDE) and somebody gets out.  Then the whole gang gets\nout, ditches the one car and gets in one of the parked cars.\nAll the while the couple on the porch is busy spooning.  The\ncar begins to roll slowly into the street.  The WOMAN notices.\n\n                         WOMAN\n            Say, isn't that your car, Eugene?\n\n                         MAN\n                   (still nuzzling her)\n            Mmmmmm...huh?\n                   (he looks, leaps from\n                   the swing)\n            That's my car!  Hey!\n\nThe MAN and WOMAN run down the front steps and front walk to\nthe second car.  They jump in and take off, giving chase.\n\nINT. CAR.  DAY.\n\nThe WOMAN is driving (it's her car).  The MAN is furious.\n\n                         EUGENE\n            I'll tear 'em apart!  Those punks!\n            Steal a man's car right out from\n            under him!  Wait till I get my\n            hands on those kids, Velma, I'll\n            show 'em!\n\nThey continue driving, furious, the man cursing and muttering.\nWe see through their windshield the other car way in the\ndistance.\n\n                         VELMA\n            What if they have guns, Eugene?\n\n                         EUGENE\n                   (realizing the\n                   possibility, he\n                   suddenly stops being\n                   mad and turns chicken)\n            We'd better get the police and let\n            them handle this.\n\n                         VELMA\n            Right.\n\n                                                           71.\n\n\n                         EUGENE\n            Turn around and let's get back to\n            town.  We'll go get the sheriff.\n\nThey are by now on a narrow dirt road and the WOMAN has to\nexecute a U-turn.  It takes her about seven cuts to turn the\ncar around in the narrow space.  They start back to town.\n\n                                            CUT TO:\n\nINT. BONNIE AND CLYDE'S CAR.\n\nBUCK looks out the rear window.\n\n                         BUCK\n            They stopped chasin' us.  They\n            turned around.\n\nClose-up.  CLYDE grinning mischievously.\n\n                         CLYDE\n            Let's take 'em.\n\nBUCK and C.W. laugh appreciatively at the reversal.  CLYDE\nturns the car around.  He performs the U-turn in the same\nnarrow space in one, swift, smooth, beautiful turn.\n\n                                            CUT TO:\n\nINT. THE OTHER CAR.\n\nVELMA looks in the rear view mirror and sees that now she is\nbeing chased.\n\n                         VELMA\n            Oh, my Lord, they're comin' after us.\n\n                         EUGENE\n                   (in a panic)\n            Step on it, Velma, step on it!\n\nClose-up.  Accelerator.  VELMA jams it down to the floor.\nThe car speeds.\n\nEXT. ROAD.  THE CHASE.  DAY.\n\nBONNIE and CLYDE's car gaining on them, gaining on them,\ngaining on them and finally overtaking them, coming up and\nahead, forcing them to the side of the road.\n\nMed. shot.  The MAN and WOMAN's car.  Terrified, they roll\nup their windows, lock their doors and huddle together.\n\n                                                           72.\n\n\nEXT. ROAD.\n\nThe Barrow gang piles out of their car and walks over,\nhaving a merry time.  They surround the car and press their\nfaces against the window, flattening their features, making\nmenacing gestures at the shaking pair inside.  We see this\nfrom the point of view of the MAN and WOMAN inside the car.\nCLYDE pulls out a gun, makes as if to shoot, but he is\nkidding.  They all laugh uproariously, especially BUCK who\nis delighted with CLYDE's prank.  All of this we see in\npantomime from inside the trapped car.\n\nEXT. CAR.\n\n                         CLYDE\n            C'mon, get out!  Get out of there,\n            I said.\n\nThey come out, hands held high, shaking with fear.  They\nhave practically turned to jelly.\n\n                         CLYDE\n                   (ordering them into\n                   the other car)\n            Get in here.\n\nINT. OTHER CAR.  DAY.\n\nThey get in and the gang gets in.  Seven people are now\njammed inside.  CLYDE drives, BONNIE next to him, C.W. next\nto her.  In back, BLANCHE, then EUGENE with VELMA (of\nnecessity) sitting on his lap, and then BUCK.  As will be\nseen, the reason the Barrows have kidnapped the couple is\nsimply that they wanted company.  Living as they do, seeing\nonly each other day after day, they long for diversion and\nnew faces.  So the atmosphere in the car will shortly change\nto one of friendliness and jollity, and it will get\nprogressively more so in the series of cuts which advance\nthe time.  As the car starts up at the beginning, however,\nthe MAN and WOMAN are terrified.\n\n                         BUCK\n            What's your name?\n\n                         EUGENE\n                   (hesitantly)\n            I'm Eugene Grizzard.\n\n                         VELMA\n            I'm Velma Davis.\n\n                                                           73.\n\n\n                         BUCK\n                   (just as friendly as\n                   he can be)\n            Well, howdy!  We're the Barrow gang.\n            That there is Clyde drivin' and I'm\n            Buck.\n\nThe MAN and WOMAN almost faint from fear; clutch at each\nother.  The gang all laugh at this.  VELMA and EUGENE begin\nto realize that they are not going to get hurt and that the\nBarrows are friendly to them.\n\n                         BONNIE\n            Look, don't be scared, folks.  It\n            ain't like you was the law.  You're\n            just folks like us.\n\n                         EUGENE\n                   (agreeing over-enthusiastically)\n            Yeah, yeah, that's the truth.\n\n                         CLYDE\n            I expect you been readin' about us.\n\nThe MAN and the WOMAN answer simultaneously with what they\nthink is the right thing to say under the circumstances.\n\n                         EUGENE\n            Yes.\n\n                         VELMA\n            No.\n\nThey glare at each other.\n\n                         EUGENE\n                   (meaningfully)\n            Yes, Velma, we have too.\n\n                         BONNIE\n                   (laughing at the contretemps)\n            Well, you two must be in love, I bet.\n\nEUGENE and VELMA blush, get shy for a second.  BONNIE smiles.\n\n                         BUCK\n                   (gleefully, clapping\n                   his hands)\n            Well, when you gonna marry the\n            girl, boy?\n\nEveryone chuckles heartily.\n\n                                            CUT TO:\n\n                                                           74.\n\n\nINT. CAR.  LATER.\n\n--still driving, same positions, but some time has elapsed.\nThe atmosphere is now completely convivial and the captives\nare enjoying their new friends.  As the scene starts, BUCK\nis finishing his joke.\n\n                         BONNIE\n            So then she drinks her milk down\n            again, every drop.  And she looks\n            over at her son and says, \"Son,\n            whatever you do, don't sell that\n            cow!\"\n\nThe couple laughs with great amusement, but everyone else in\nthe car doesn't laugh--this is the tenth time they've heard\nthe joke.\n\n                                            CUT TO:\n\nINT. OF CAR.\n\n--getting on toward evening.  All are thoroughly relaxes and\nchatting.\n\n                         BONNIE\n                   (to Velma)\n            How old are you, honey?\n\n                         VELMA\n            Thirty-three.\n\nA sudden look of surprise registers on EUGENE's face.\n\nINT. OF CAR.  NIGHT.\n\nIt is now night.  Everyone inside the car is eating.\nApparently they stopped somewhere along the way for food.\nIn the crowded interior, it is like a party--food is being\npassed back and forth, laughter and gaiety, increasing\nwarmth between the couple and the Barrows.  The car has\nbecome a little society on wheels, dashing through the black\nnight down the highway.  Inside there is a small world of\nhappiness and fun.\n\nBUCK is unpacking the food and passing sandwiches and drinks\naround the car.\n\n                         VELMA\n            Now I ordered some French fries,\n            didn't I?\n\n                                                           75.\n\n\n                         BUCK\n                   (passing her some)\n            Yeah, here you go.\n\n                         CLYDE\n            Take it easy on those French fries,\n            Velma.  Ain't that right, Eugene?\n\n                         EUGENE\n                   (studying his hamburger)\n            This isn't mine.  I ordered mine\n            well done.  Who's got the other\n            hamburger?\n\nClose-up.  C.W. who has already taken a bite of the other one.\n\n                         C.W.\n            Oh, is this supposed to be yours?\n\nHe extends the bitten burger out to EUGENE.\n\nFull shot.\n\n                         EUGENE\n            That's okay, forget it.\n\nCLYDE laughs at this.\n\n                         BUCK\n                   (chewing)\n            Haw!  I sure am havin' a good time!\n            How 'bout you folks?  Ain't you\n            glad we picked you up?\n\n                         CLYDE\n                   (laughing)\n            Hey, maybe y'all ought to join up\n            with us.\n\nThat idea strikes everyone as being very amusing.\n\n                         EUGENE\n                   (laughing)\n            Ha!  Wouldn't they be surprised\n            back home to hear that?\n\n                         VELMA\n            Yeah.  What would Martha and Bill\n            say if they heard that?\n                   (she roars with laughter)\n                         (MORE)\n\n                                                           76.\n\n\n                         VELMA (CONT'D)\n\n\n                         EUGENE\n            Lordy!  They'd throw a fit!\n                   (roars with laughter)\n\n\n                         BONNIE\n                   (laughing)\n            What do you do, anyway?\n\n                         EUGENE\n                   (as his laugh begins\n                   to fade)\n            I'm an undertaker.\n\nSuddenly everyone freezes.  A shudder, as if the cold hand\nof death had suddenly touched the occupants of the car.  The\natmosphere changes to cold, deadly, fearful silence in\nexactly one second.  It is a premonition of death for the\nBarrows, and they react accordingly, BONNIE especially.\n\nClose-up.  BONNIE.\n\n                         BONNIE\n                   (tautly, in a flat voice)\n            Get them out of here.\n\nEXT. ROAD.  NIGHT.\n\nThe car brakes to a sudden stop.  The rear down is opened,\nthe MAN and WOMAN flung out into the darkness.  The car\ndrives off into the lonely night.\n\nFrom this point on, the audience should realize that death\nis inevitable for the Barrow gang, that it follows them\nalways, that it waits anywhere.  It is no longer a question\nof whether death will come, but when it will.\n\nEXT. WOODS.  MORNING.\n\nMoving with CLYDE he tears through the brush, snagging his\nclothes, calling BONNIE's name.  CLYDE's search is so\ndesperate here that for a moment we might think he is\nfleeing from something rather than looking for something.\n\nIn a moment he emerges onto the road.  The car, with C.W.\ndriving, and BUCK and BLANCHE beside him, is patrolling\nslowly up ahead of him.\n\nCLYDE spots it and runs toward it.  Hold on this angle until\nhe catches up with it and leaps onto the running board.\n\n                                                           77.\n\n\nMoving shot.  Car.  Morning.  CLYDE, now on the running\nboard, his head poked into the car, his face apple red and\nsweating.\n\n                         CLYDE\n                   (breathing heavily)\n            ...see anythin', Buck?\n\nBUCK is shocked at his brother's desperation, but makes no\novert comment on it.\n\n                         BUCK\n            --not yet, boy.\n\n                         CLYDE\n                   (with an edge of\n                   paranoia, as if the\n                   three of them might\n                   be withholding\n                   something from him)\n            --and nobody saw her leave, or\n            heard anythin'\n                   (almost a threat)\n            ...C.W....?\n\nEXT. CAR.  MOVING SHOT.  DAY.\n\nCLYDE gets the point.  For the very first time we see CLYDe,\nthe leader, helpless as he hangs onto the running board.\n\n                         CLYDE\n                   (lamely)\n            ...Well, where do you think she\n            could've gone?...Buck?...Buck?\n\n                         BUCK\n                   (amazed and a little frightened)\n            Jesus, I don't know...\n\nCLYDE looks helplessly at his brother, then drops off the\nrunning board and continues on foot, running along, scanning\nthe fields--the car keeping up beside him as he runs and we\ntruck before both car and CLYDE.\n\nAngle on car through windshield.  Reaction shot.  Day.  BUCK\nturning to BLANCHE, shrugging his shoulders, speechless.\n\nReverse angle through the windshield.  Day--at CLYDE, who\nhas suddenly seen something begins gesticulating wildly,\nalmost--from car's POV, a little comically.\n\n                         CLYDE\n            There!  There!  There!\n\n                                                           78.\n\n\nHe starts running off into a cornfield.\n\nAnother angle--picking up CLYDE as he kicks his way into the\ncornfield, knees pumping high, knocking down the stalks.  He\nstops and picks up the stocking he had spotted, takes it and\nmoves on.\n\nStill another angle as CLYDE has picked up a freshly beaten\ntrail through the cornfield.  He picks up one of BONNIE's\nscarves, now.  As he runs on, he clears a knoll and BONNIE,\nher yellow hair unmistakable even at this distance, comes\ninto view.  She's far off in the cornfield, stalking off,\nlooking neither to right nor left, carrying a brown paper\nsack that has split, from which she has occasionally lost\nclothing.  CLYDE screams, \"BONNIE.\" She apparently doesn't\nhear.\n\nAngle on cornfield.  Day.  As CLYDE gets closer.  BONNIE\nherself suddenly breaks into flight, the paper bag splitting\ncompletely, the remaining clothes spilling out.  There is a\nreal chase where they each try to get the advantage.  CLYDE\nis so exhausted from his run that he has real trouble\ncornering her as they maneuver up and down the rows of corn.\nFinally CLYDE catches up.\n\nExtreme close-up.  BONNIE & CLYDE.  Day.  As they tumble\ninto the stalks of corn, mowing them down.\n\n                         BONNIE\n            Leave me alone!  Leave me alone!\n\n                         CLYDE\n                   (holding her, kissing\n                   her frantically)\n            Hey...hey, hey, baby, hey, Bonnie,\n            hey baby...\n                   (calming her down)\n            ...Hey, hey now...just where did\n            you think you were goin'?...\n\nBONNIE doesn't answer.\n\nUp angle.  POV CLYDE.  As he's momentarily distracted by\nBUCK's laughter as he's in the cornfield picking up BONNIE's\nclothing.  CLYDE waves an impatient it's all-right-wave.  He\nturns back to BONNIE who he still holds tightly.\n\n                         CLYDE\n                   (still frantic)\n            --Huh.  Bonnie?  Where?  Where?\n\n                                                           79.\n\n\n                         BONNIE\n            I don't know!  You're hurting me, I\n            was just scared is all...and my\n            mama's been on my mind, and she's\n            gettin' so old...\n\nBONNIE hesitates, beginning to feel a little foolish now.\n\n                         CLYDE\n            Boy, don't ever leave without\n            sayin' somethin'.  You really\n            scared me, Bonnie.\n\n                         BONNIE\n            But I mean it, though.  I want to\n            see my mama.  Please, Clyde.\n\nTwo shot.  BONNIE and CLYDE.  Day.\n\n                         CLYDE\n                   (enormously relieved,\n                   kissing her)\n            Okay, sweetheart.\n\n                                            DISSOLVE TO:\n\nEXT. SIDE OF A ROAD.  VERY LONG SHOT.  DAY.\n\n--of three or four cars parked on the side of a road in\nTexas.  A light rain is falling.  There are a lot of people\ngathered around, but the sound is an indistinct mixture of\ntalk, laughter, etc.\n\nThere follows a quick montage of cuts which isolate specific\nmoments in the family reunion, thereby implying the entire\ntone of the proceedings.  The sense of family pervades.\n\nMontage.  BONNIE and MOTHER.  BONNIE's mother, an old woman,\ngrabs her and hugs her and cries.\n\nMontage.  BONNIE, CLYDE, MAN.  A man, an uncle perhaps,\nstands with BONNIE and CLYDE, arms around them both, hugging\nthem to his sides tightly.\n\nMontage.  BONNIE and sister.  BONNIE's sister hands them a\nscrapbook of clippings.\n\n                         SISTER\n            Here you are, we been cuttin' and\n            pastin' everything we could find\n            about you in the papers.\n\n                                                           80.\n\n\nCLYDE, BONNIE, BUCK and BLANCHE all look at the scrapbook.\nWe see a page of it, showing newspaper articles with the\nphotographs the gang took back at the motel.\n\n                         BUCK\n            Hey look, here's that one I took of\n            you, Clyde.  That came out just fine!\n\nMontage.  BONNIE, CLYDE, MAN.  BONNIE and CLYDE are posing\nfor a comic snapshot.  A silly looking male relative is\nposing, pointing a gun at them.  They have their hands in\nthe air and are grinning broadly.  (The effect should be\nfunny and simultaneously frightening.)\n\nMontage BUCK, SMALL BOY.  BUCK is sitting with a little\nfour-year-old on his knee, bouncing him up and down and\nsinging.  Both are having a fine time.\n\n                         BUCK\n                   (singing)\n            Oh, Horsey! keep your tail up, keep\n            yer tail up, keep yer tail up, Oh,\n            Horsey! keep yer tail up, Why don't\n            you make it rise.\n\nMontage--C.W.  A hand off camera thrusts a sandwich at C.W.\nHe opens the bread to see what's inside it, then eats it.\n\nMontage--BONNIE & SISTER.  BONNIE sits stock-still while her\nsister gives her a permanent in the back seat of a car.  He\nsister pauses, setting down the curling iron.  She strokes\nBONNIE's yellow head with her hand, as though she were a\nwild animal that had paused long enough to be petted.\nBONNIE turns to see her sister's expression.  They embrace.\n\nMontage--Family picnic--Favoring CLYDE, MOTHER & BONNIE.\nCLYDE, in his best theatrical manner has been playing host\nin the sand pile, perhaps using some sort of towel across\nthe arm or around the middle.  The party is beginning to\nbreak up now as used paper plates and crumpled napkins are\nblowing across the sand and the group is finishing up on\nEskimo pie.\n\n                         BONNIE'S UNCLE\n                   (rising)\n            Where y'all headed from here?\n\n                         CLYDE\n                   (right back)\n            I don't know, what y'all got in\n            mind?  At this point we ain't\n            headin' to anywhere, we're just\n            runnin' from.\n\n                                                           81.\n\n\nCLYDE laughs, in fine spirits.\n\nReaction--BONNIE.  She doesn't.\n\n                         BONNIE'S SISTER'S VOICE\n            C'mon, down, Litte Tom!  We're\n            goin' home.  Little Tom?  Mathew,\n            fetch Little Tom.\n\n                         BONNIE\n            Don't go yet, Mama.\n\n                         UNCLE'S VOICE\n                   (cutting in)\n            C'mere, c'mere you little corn\n            roller.\n\nWide angle.  As Uncle sweeps up the laughing little Tom.\n\nReaction--BONNIE.  BONNIE turns with increased urgency to\nher MOTHER, who, having been hefted to her feet by BONNIE's\nsister, has turned to CLYDE, who gives her a big, boyish hug.\n\n                         MOTHER\n            ...you know, Clyde, I read about\n            y'all in the papers and I'm jes'\n            scared.\n\n                         BONNIE\n                   (to Clyde)\n            Sugar, make mama stay a while yet.\n\n                         CLYDE\n                   (ignoring Bonnie, as\n                   does Mother,\n                   ebulliently, even joshing)\n            Now Mrs. Parker, don't y'all\n            believe what you read in the papers!\n            That's the law talking there.  They\n            want us to look big so's they'll\n            look big when they catch us.\n\nHe knows he's stumbled onto the wrong thing, but he bounces\nright along--it's his style.\n\n                         CLYDE\n            --and they can't do that.  Why, I'm\n            even better at runnin' than robbin'\n            banks--aw shoot, if we done half\n            the stuff they said we did, we'd be\n            millionaires, wouldn't we, old\n            sugar.\n                         (MORE)\n\n                                                           82.\n\n\n                         CLYDE (CONT'D)\n                   (he turns to Bonnie\n                   who continues to\n                   stare at her Mother)\n            And I wouldn't risk Bonnie here\n            just to make money, uncertain as\n            times are.  Why one time I knowed\n            of a job where we could of make\n            $2000 easy, but I saw the law\n            outside and I said to myself, why\n            Bonnie could get hurt here.  So I\n            just drove right on and let that\n            money lay.\n\nHe waits for a response, as does BONNIE.  BONNIE's MOTHER\nsmiles, a little abstractedly.\n\n                         MOTHER\n            ...Maybe you know the way with her,\n            then.  I'm just an old woman and I\n            don't know nothin...\n\nShe trails off, looking nowhere in particular.  CLYDE takes\nher reaction to mean that he's overwhelming her with his\nconfidence, and continues to pour it on.\n\n                         CLYDE\n            We'll be quittin' this just as soon\n            as the hard times is over, Mother\n            Parker, I can tell you that.  Why\n            me and Bonnie were just talkin' the\n            other day and we talked about when\n            we'd settle down and get us a home,\n            and Bonnie said, \"I couldn't bear\n            to live morn'n three miles from my\n            precious mother.\" Now how'd you\n            like that, Mother Parker?\n\nBONNIE's MOTHER has undergone a funny sort of transformation\nduring CLYDE's speech--as if something had suddenly come\ninto focus before the old woman's eyes.\n\n                         MOTHER\n            Don't believe I would.  I surely\n            don't.\n                   (to Bonnie)\n            You try to live three miles from me\n            and you won't live long, honey.\n                   (to Clyde)\n            You'd best keep runnin' and you\n            know it, Clyde Barrow.\n                   (matter of fact)\n            Bye, baby.\n\n                                                           83.\n\n\nShe hugs BONNIE who can barely respond.  We move in for a\ncloseup of BONNIE as her various relatives, young and old\ncome by to squeeze, kiss and hug her with a chirpy little\nchorus of Bye, Bonnie!  Bye, Bonnie, bye, bye, bye.\n\n                                            DISSOLVE:\n\nEXT. PLATTE CITY MOTEL.  PLATTE CITY, IOWA.  DAY.\n\nHold on the outside long enough to see the unusual\nstructures: two little motel cabins connected by two\nidentical garages, an entirely symmetrical structure.\n\nINT. PLATTE CITY MOTEL BEDROOM.  WITH BONNIE.  DAY.\n\n--as she tries, against heavy odds, to file and trim her\nnails in a corner of the room.  The odds are; CLYDE on a\nuke, b.g., BUCK, and BLANCHE--gathered around C.W. who sits\nin the only stuffed chair in the room.  Their o.s.\nraucousness is clearly shattering to BONNIE who, at a key\nmoment in the scene, ends up spearing her cuticle with a\nfile, spurting a little board and a lot of temper.\n\nOther angle.  CLYDE--BUCK--BLANCHE--C.W.  Day.  A naked\nlightbulb (the lampshade has been removed) glares down on\nC.W.'s chest--where a pair of bluebirds have been tattooed\nwith a rocco flourish.  BUCK and BLANCHE are vastly amused--\nrather BLANCHE takes delight in BUCK's delight.\n\n                         BUCK\n            How long have ya had it?\n\n                         C.W.\n                   (like some docile\n                   animal submitting to inspection)\n            --just got it.\n\n                         BUCK\n                   (to Blanche, who\n                   stares fascinated as\n                   one of C.W.'s pectoral\n                   muscles contracts and\n                   the wings flutter)\n            Touch it, honey!  Go on!\n\nBLANCHE squeals with amusement.  BUCK takes BLANCHE's hand\nand places it on the bluebirds.\n\n                         BLANCHE\n                   (titillated with delight)\n            Oh, no, Daddy!  No!\n\nReaction BONNIE.  Day--as the file digs into her cuticle on\nBLANCHE's squeal.  With barely controlled rage:\n\n                                                           84.\n\n\n                         BONNIE\n            What are you all doin'?\n\nINT. MOTEL BEDROOM.  GROUP SHOT.  FAV. BONNIE.  DAY.\n\n                         C.W.\n                   (insensitive to\n                   Bonnie's stare)\n            Playin' with my tattoo, Bonnie.\n\n                         BONNIE\n            Well, why don't you all go play\n            with it somewhere else?\n\nNew angle.  Motel bedroom.  Day.\n\n                         BLANCHE\n            What's bothering her?\n\n                         CLYDE\n                   (sees something coming)\n            Not now, Blanche.\n\n                         BUCK\n                   (who doesn't want to\n                   be victimized by\n                   Bonnie's temperament)\n            What's bothering her, Clyde?\n\n                         BONNIE\n                   (exploding)\n            I said go somewhere else!\n\nShe picks up the first three objects she can find on the\ndresser and hurls them--an ashtray, a Gideon Bible, and a\nflower pot--at the little group.  The pot goes shattering\ninto the wall.  Everyone ducks.\n\n                         CLYDE\n                   (straightening up,\n                   matter-of-fact)\n            Bonnie's hungry, C.W. I saw a\n            chicken place a few miles back.\n            Who all wants to go get some food?\n\nINT. MOTEL BEDROOM.  GROUP SHOT.  DAY.\n\n                         BLANCHE\n                   (rising from her\n                   chair, a little\n                   shaken at Bonnie's outburst)\n            I sure do.  I'm plenty tired of\n            sittin' around here anyway.\n\n                                                           85.\n\n\n                         BUCK\n                   (not making a move to\n                   get up)\n            You can't drive, honeylove.\n\n                         C.W.\n                   (reluctantly)\n            I'll go.\n\nCLYDE makes a face to BONNIE pretending there's something\ngoing on between C.W. and BLANCHE.  BONNIE tries to keep\nfrom being amused.  C.W. moves out with BLANCHE.  BUCK rises\nto go next door.\n\n                         C.W.\n            What's everybody want?\n\n                         CLYDE\n            Just five chicken dinners, and get\n            somethin' for dessert.\n\n                         BUCK\n            See if they got peach ice cream.\n                   (he grins and pats\n                   his stomach)\n\n\nAll finally exit, leaving BONNIE and CLYDE alone.\n\nEXT. CAR AND STREET.  DUSK.\n\nC.W. and BLANCHE go out.  We go with them.  They get in the\ncar and drive off.  BUCK enters his cabin.\n\nINT. MOTEL BEDROOM.  BONNIE AND CLYDE.  DUSK.\n\nCLYDE reaches her, and for a moment both stare with fanatic\nintensity at each other, BONNIE trying desperately to keep a\nstraight face.  They are nose to nose, unblinking.  CLYDE\ngives her a big raspberry, waggling his fingers in his ears\nlike a kid.  She laughs.\n\n                         BONNIE\n            I hate you all.\n\n                         CLYDE\n            I hate y'all, too.\n\n                         BONNIE\n            no, I really hate you.\n\nShe turns away from him, wilts onto the bed.\n\n                                                           86.\n\n\n                         BONNIE\n                   (eyes brimming)\n            Oh, baby, I've got the blues so\n            bad...\n\nCLYDE moves behind her, begins to massage her back.  There\nis something very delicate about the way he touches her; it\nsuggests CLYDE's sensitivity to her mood rather than any\ndegree of physical intimacy.\n\n                         CLYDE\n            Bonnie?...is it your mama, what\n            your mama said?\n\n                         BONNIE\n            What mama?...she's just an old\n            woman now...I have no mama...\n\nBONNIE rolls over on her back, stares up at CLYDE, tears\nsplaying across her face from the move.\n\n                         BONNIE\n                   (quietly)\n            ...so funny...I thought when we\n            first went out, we were really\n            goin' somewhere...but this is it--\n            we're just goin', huh?\n\nShe has addressed this last directly to CLYDE, but there is\nnothing rhetorical about it--it is a real question.  CLYDE\ndoesn't answer for a moment.  Then:\n\n                         CLYDE\n            Do you care about where we're goin'?\n\nBONNIE clearly finds this hard to say:\n\n                         BONNIE\n            Not as long as you care about me.\n\n                         CLYDE\n                   (quite simply)\n            Why I love you, sugar.\n\nIt's the first time he's said it to her, and BONNIE is\noverwhelmed.  She wraps her arms around CLYDE's middle, and\nsnuggles into him, like a child.  Neither we nor CLYDE can\nsee BONNIE's face now, and her voice is muffled by his chest.\n\n                         BONNIE'S VOICE\n            --enough to die with me, baby?...\n            'cause I think that's where we're\n            goin'...I surely do.\n\n                                                           87.\n\n\nCLYDE is both touched and amused by the plea.  He strokes\nher head lightly.  Really meaning it.\n\n                         CLYDE\n            --wherever.\n\n                                            DISSOLVE:\n\nINT. CAR.\n\nBLANCHE, her tense and agitated self growing increasingly\nmore so lately, lights a fresh cigarette off the butt of the\none she has been smoking.\n\n                         C.W.\n                   (conversationally)\n            You sure smokin' all the time lately.\n\n                         BLANCHE\n                   (quick to take\n                   offense, snaps)\n            So what?\n\n                         C.W.\n            Nothin'.\n\nBLANCHE, sick of it all, drops her head in her hand with a\nsigh.\n\n                         BLANCHE\n            Oh, God...\n\nC.W. looks at her, finally decides to say something that\noccurs to him.\n\n                         C.W.\n            Whyn't you go back home to your papa?\n\n                         BLANCHE\n                   (it's been her dream)\n            Oh, if I could!  If I could just do\n            that one thing!  Oh, there's no\n            tellin' why this all happened.  I\n            was a preacher's daughter.\n\n                         C.W.\n            When church is your pa affiliated\n            with?\n\n                                                           88.\n\n\n                         BLANCHE\n                   (much more interested\n                   in talking about herself)\n            Baptist...oh, and he thought the\n            world of Buck, my daddy did, even\n            knowing that Buck was serving time\n            in jail.  He forgave him for that\n            'cause he paid his debt to society.\n\n                         C.W.\n            We were Disciples of Christ.\n\nINT. FRIED CHICKEN CAFE.\n\nThe camera remains stationary in this scene, in this position.\nA lunch counter sweeps down the center of the screen.  We\nare at one end of the counter.  In the f.g., a DEPUTY sits\ndrinking coffee, absorbed in his cup.  In the b.g., at the\nother end of the counter, by the Exit door, BLANCHE and C.W.\nare being handed their order by the counterman.\n\n                         BLANCHE\n            Hey, C.W., I ain't got my money.\n            Give me some, will you?\n\nThe DEPUTY turns his head and looks over there.  C.W. opens\nhis jacket to reach in his pocket for money.  As he opens\nhis coat, his gun is clearly seen tucked in his pants.\nCamera zooms in to tight close-up of gun.\n\nClose shot.  DEPUTY--his face tense.  Sound of door closing\nshut, as C.W. and BLANCHE leave.\n\n                         DEPUTY\n                   (to counterman)\n            Get Sheriff Smoot on the phone.\n\n                                            DISSOLVE TO:\n\nINT. PLATTE CITY MOTEL ROOM - NIGHT.\n\nOn C.W.'s moonlit chest and face, tattooed bluebirds heaving\nand occasionally snoring in the night.  Behind him the room\nis dimly lit by flickering candles that are placed out of\nsight on the floor.  The shapes in the room--the bed is\ngutted and only the box mattress remains--dresser, lamp\nshades, etc., are grotesque in the flickering light.  O.s.\nsounds of BONNIE and CLYDE, BONNIE giggling and CLYDE\nwhispering something we can't quite hear.\n\nMove across the room toward the gutted bed.  Move giggling\nfrom the floor beneath the box mattress--for a moment it\nshould appear as if something perversely sexual may be going\non between BONNIE and CLYDE.\n\n                                                           89.\n\n\n                         BONNIE'S VOICE\n            Ready?\n\n                         CLYDE'S VOICE\n                   (a little embarrassed)\n            Aw Bonnie--\n\n                         BONNIE'S VOICE\n                   (coaxing)\n            C'mon!\n\nCLYDE's arm wielding a Tommy gun, clears the bed.  With the\nmuzzle, CLYDE knocks the swivel mirror on the dresser\noverhead, bringing BONNIE and CLYDE into view.\n\nCloser angle mirror--BONNIE and CLYDE.  Night.  BONNIE lies\nstiff as a statue on the white mattress, impeccably dressed\nfor her funeral.  Candelabras made of empty beer bottles lie\nat her head and feet.  BONNIE's hands and face are powdered\nand painted a waxen white.  She wears a garish silk bow in\nher hair which it, for this occasion, curled like a little\ngirl's.\n\nCLYDE sits up, beer bottle in one hand, Tommy gun in the\nother, derby hat cocked--and just a little unsure of the\nwhole thing.  He takes a swig--BONNIE stops him, trying\nterribly hard not to change her position.\n\n                         BONNIE\n            Lie down now, honey.\n\n                         CLYDE\n            I've done enough!\n\nAngle on mirror--BONNIE and CLYDE.  Night.\n\n                         BONNIE\n                   (with patience, to a child)\n            You have to lie down...it's the\n            only way we can tell what we'll\n            look kike together.\n\nShe giggles again, more than a little gassed herself.  CLYDE\nclamps a big cigar between his teeth and abruptly lies down\nbeside her.  CLYDE is both amused and annoyed.\n\n                         CLYDE\n                   (staring up at\n                   himself talking with\n                   cigar clenched\n                   between his teeth)\n            Whatta you think?\n\n                                                           90.\n\n\n                         BONNIE\n                   (it suddenly strikes her)\n            That's not the right tie!\n\n                         CLYDE\n            What?\n\n                         BONNIE\n                   (rising, weaving a little)\n            You can't wear polka-dots on an\n            occasion like this.\n\n                         CLYDE\n            Well what--\n\n                         BONNIE\n            Stripes.  Don't go away now.\n\nShe weaves her way over to the dresser, takes a swig from a\nbottle there herself, checks her makeup, and returns with\nthe tie.  Holding against his chest to try it out she almost\nfalls into him.  CLYDE steadies her.\n\n                         BONNIE\n            Perfect.\n\nShe tries to tie it for him, and clearly has trouble with\nthe knot.\n\n                         CLYDE\n            OK, o.k.  If we're gonna do this,\n            at least I can tie it myself.  Lie\n            down before you fall down.\n\nINT. MOTEL BEDROOM--BONNIE AND CLYDE.  NIGHT.\n\nShe does, with some play-acting, exaggerated obeisance to\nCLYDE's command--reaching up at the last moment like a\nzombie and snatching an artificial flower from BLANCHE's hat\nwhich still lies on the dresser.  CLYDE lies down now.  They\nlook into the mirror again.\n\n                         CLYDE\n                   (grudgingly)\n            Better?\n\n                         BONNIE\n            Much.\n\nThis tickles CLYDE despite himself and he laughs--BONNIE\nbegins to sing to him--performing for both CLYDe and her own\nimage in the mirror--like some hoydenish vaudevillian.\n\n                                                           91.\n\n\nDuring the course of the song she will rise and take CLYDE\nwith her who finally joins in when they tip-toe over and\nbegin to serenade C.W.\n\n                         BONNIE & CLYDE\n                   (to the lugubrious\n                   strains of the Death March)\n            \"Did you ever think when a hearse\n            went by,\n            That somebody you or I may die?\n            They'll wrap you up in a big white\n            sheet\n            and bury you down just about six\n            feet,\n            The worms crawl in, the worms crawl\n            out,\n            The worms play penuckle on your\n            snout.\n            Your eyes fall in, your teeth fall\n            out,\n            Your face turns green and the pus\n            runs out.\n\nDuring this last they have been hovering over C.W.'s\ntwitching face, like a couple of tipsy ghouls, whisper-\nsinging into his ears.  C.W. finally blinks, doesn't even\nbother to look at them.\n\n                         C.W.\n            I'm gonna die if I don't get some\n            sleep.  Quit singing that.\n\nReaction--BONNIE and CLYDE.  Night.  They smile, go back and\nlie down.  Looking at their images:\n\n                         BONNIE\n            All right, shut your eyes now.\n\n                         CLYDE\n                   (playing along with her)\n            No, you first.\n\n                         BONNIE\n            One for the money.\n\n                         CLYDE\n            Two for the show.\n\n                         BONNIE\n            Three to get ready--\n\n                         CLYDE & BONNIE\n            Four to Go.\n\n                                                           92.\n\n\nAs they approach four we should feel that somehow when they\nshut their eyes, they really will die.  They shut them on\nGO, and screen goes black.\n\nEXT. PLATTE CITY MOTEL.  NIGHT.\n\nRanged across the lawn are six police cars, loaded with\npeace officers.  Four men come out and, guns drawn, walk\ncautiously over to the room on the right--BUCK and BLANCHE's.\n\nINT. PLATTE CITY MOTEL.  BUCK'S CABIN.  NIGHT.\n\nThere is a knock on the door.  They sit bolt upright in bed.\nBefore BUCK can say anything, BLANCHE puts her hand over his\nmouth to shut him up.\n\n                         BLANCHE\n                   (calling out)\n            The men are on the other side.\n\nEXT. PLATTE CITY MOTEL.  NIGHT.\n\nThe four lawmen, among them the DEPUTY from the cafe, edge\ntheir way across the lawn, past the first garage, past the\nsecond.  Before they reach the door of BONNIE and CLYDE's\ncabin, the window smashes and there are blasts of gunfire.\nOne cop is hit and falls, the others run back to the cars\nfor cover.  BONNIE and C.W. are at the window, firing\nsteadily.\n\nCLYDE--running into the garage to get the car.  They must\nescape.  All they can do is escape, and all they have is\nthat one car in the closed garage.\n\nOutside.  Two of the lawmen fall to the ground, shot.  As\nthe remaining two run back for cover, we see a blinding\nlight rolling up in a space between the six cars.  It is an\narmored truck, with mounted guns and and spotlight, advancing\ntoward the cabin.\n\nInside the armored truck.  Two men in the seat.  Sounds of\ngunshots coming from everywhere, piercing light.  From\ninside the truck, we suddenly see the windshield shattered\nfrom bullets fired by BONNIE and C.W.  The driver is hit,\nand he slumps over the wheel.  His body hits the horn, which\nstarts blasting and continues throughout the battle.  The\nother man, quickly, ducks under the dashboard for protection.\n\nInside the garage.  CLYDE standing by the car.  He holds the\nBrowning Automatic.  The garage door is shaking from the\nimpact of bullets, shattering.  His gun already firing\n(automatic clip) before he gets there.  CLYDE in a crouch\nruns to the garage door, flings it up, and runs back inside\nthe car.  Now the door is open and he can get the car out.\n\n                                                           93.\n\n\nOne hand on the wheel, one hand shooting, he rolls the car\nout onto the driveway.  The battle is raging from all sides.\n\nEXT. STREET.\n\nThe car stops.  CLYDE keeps shooting.  The door of the cabin\nflies open and BONNIE and C.W. come charging out, guns\nblazing away.  C.W.  fires the Thompson sub-machine gun,\nBONNIE fires two pistols with automatic clips.  They run in\na crouch, tryingto get inside the car in front of their door.\nThey make it.\n\nCamera pans across the motel to the other door.  It opens,\nBUCK and BLANCHE come out, holding a double bed mattress in\nfront of them for protection.  This makes their running\nawkward--the mattress is heavy.  BLANCHE carries the front\nend, BUCK the back with one hand, the other firing his gun.\nThey get halfway to the car and then BUCK is hit, shot in\nthe head.  He falls to the ground; BLANCHE and the mattress\nfall too since she has lost balance.  Both are under the\nmattress.\n\nCLYDE dashes out of the car and drags BUCK into the back\nseat.  BLANCHE follows, hysterical.  All guns on all sides\nare still firing.  They fling themselves into the car and\nfrom a standing start, the car starts out at 60 mph down the\ndriveway.  One of the lawmen stands blocking the way with a\ndouble-barrele rifle, but the car keeps coming, about to run\nhim down.  He jumps out of the way and fires at the side.\nThe glass cracks and we see BLANCHE fling a hand to her\nface, which is bloody.  A piece of glass has lodged in her\neye.  We hear her scream.  The horn is still blasting.\n\nINT. THE CAR SWERVING MADLY.\n\nCLYDE manages to keep it on the road.  They drive away.\n\nEXT. STREET.\n\nThe police run back to their cars to give chase, calling out\nto each other, unable to believe that the gang could possibly\nhave gotten away.\n\nINT. CAR.  NIGHT.\n\nas it is speeding down the highway.  Crazy, mad hillbilly\nmusic on the soundtrack.  Packed inside this car right now\nis more sheer human misery and horror than could be believed.\nIt is hell in there, hell and suffering and pain.  The car\nis a complete mess.  C.W. is sobbing.  Everyone is hysterical.\nBLANCHE is shrieking with pain and concern for BUCK.  BUCK\nis alternating between groaning and passing out completely.\nBONNIE is yelling at everybody to shut up.\n\n                                                           94.\n\n\nOnly CLYDE, driving with both hands clenched on the wheel,\nis silent.  The car is doing 90.\n\nEXT. SUBURBAN STREET.  NIGHT.\n\nThe car from the outside, a half hour later.  They have\neluded the police.  They are barreling down the road at top\nspeed on a nice suburban street with proper homes.  It is\nthe middle of the night, utter silence.  CLYDE stops the\ncar, points to ca car in a driveway--it is a beautiful,\nshiny new and expensive automobile.  C.W. runs out, runs up\nthe driveway, peers inside, gets in, quietly backs it down\nthe driveway and pulls behind the gang's bullet-riddled\ngetaway car.  Suddenly they both zoom off down the road\ntogether.\n\nINT. OF THE NEW CAR.  NIGHT.\n\nC.W. driving alone.  He is crying, mumbling, wiping his eyes\nand nose with one hand while he controls the wheel with the\nother.\n\nEXT. RING OF FIRS.  NIGHT.\n\nA wide field in the country.  This is Dexter, Iowa.  It is\nquiet.  We see, in a long shot that takes in everything,\nthat this is a meadow surrounded by a ring of trees, a dense\nforest that circles them.  The meadow, however, is large.\n\nThe two cars drive into the middle of the field, headlights\non.  They stop and the Barrow gang gets out.  They are in\nhorrible shape--we can finally have a look at them.  Half-\ndressed in their pajamas, bloody, dirty, in tatters.  Those\nthat can stagger out do so, others are carried.  A far shot\nof all this.\n\nCloser shot.  Moving closer to them, we see CLYDE and C.W.\nlay BUCK down on the ground.  CLYDE begins to administer to\nhis wounds as best he can, mostly just wiping him off.  BUCK\nis semi-conscious.  All are in a semi-daze.  BLANCHE falls\nto her knees, still clutching her eyes.  She is totally\nhysterical.\n\n                         BLANCHE\n            Oh, God, please help us!  Dear\n            Father in Heaven, get us out of\n            this and Buck will never do another\n            bad thing in his life!\n                   (she continues\n                   moaning, praying, sobbing)\n\n\nBONNIE walks over to the group, looking at BUCK, C.W. goes\nover to her.  Two shot--BONNIE and C.W.\n\n                                                           95.\n\n\n                         C.W.\n            He ain't got a chance.  Half his\n            head blown off.\n\nCamera pulls back to take in BLANCHE.\n\n                         BLANCHE\n            My eyes!\n                   (she SCREAMS)\n            God, I think I'm blind.\n                   (in the headlights)\n            ...light hurts so bad...\n\nBONNIE walks over to the car and comes back with the\nsunglasses BUCK had given BLANCHE.  Moving her out of the\nglare, she helps BLANCHE put them on.  BONNIE now has an arm\naround BLANCHE, and BLANCHE shivers into BONNIE gracefully.\nBONNIE is a little repelled by BLANCHE, but comforts her out\nof genuine feeling for her.\n\n                         BLANCHE\n                   (clinging)\n            Please, please get us to a doctor!\n            Tell Clyde to get us to a doctor.\n            We'll die here.\n\n                         BONNIE\n                   (helping with glasses)\n            --here, hon'.\n\nBONNIE looks silently up to CLYDE.  CLYDE is looking dumbly\ndown at his mangled brother.\n\n                         BLANCHE\n                   (going on)\n            Clyde, Clyde, please get us to a\n            doctor.\n\nThough BLANCHE cannot see it, CLYDE has knelt down to the\nside of BUCK, taking BUCK's hand and with his other hand has\nbegun smoothing BUCK's hair back, away from the wound.\n\n                         BLANCHE\n            He's your brother!\n\n                         BONNIE\n                   (gently, knowing\n                   CLYDE will not and\n                   cannot answer BLANCHE)\n            Buck can't be moved, now, hon'.\n\nBLANCHE's answer to this is hysterical sobbing, burying\nherself into BONNIE, mumbling half-coherent, muffled prayers\nbetween the sobs.\n\n                                                           96.\n\n\nWith BUCK and CLYDE.\n\n                         BUCK\n                   (weakly)\n            Clyde?...Clyde?...\n\n                         CLYDE\n            Right here, boy.\n\n                         BUCK\n            I believe I lost my shoes...maybe\n            the dog hid 'em...\n                   (he lapses into\n                   unconsciousness again)\n\n\nCLYDE has begun to cry a little, continues to smooth back\nBUCK's hair with ritualistic regularity.\n\nWide angle.  Night.  Camera pulls away, way back to wide\nshot of the entire field, showing the group in the center of\nthe darkness, lit by the headlights.\n\nMatch dissolve into early dawn, camera still on the wide\nshot.  The field is lighter, though the trees still loom\nblackly around it.  The two cars, one almost a shattered\nwreck, the other bright and shiny and new, are parked in the\ncenter.  The sky is light, but the trees cast a dark shadow\non the field.  The gang is just sitting around.  BLANCHE\nweeping next to BUCK, C.W. sitting on the running board of a\ncar, staring.  BONNIE standing and smoking.  CLYDE still\nwith BUCK.\n\nAll is quiet.\n\nEXT. WOODS.  DAY.\n\nFrom the edge of the woods, a man in a white shirt emerges\nfrom behind a tree.  The camera swings abruptly to get him.\nHe calls out to the gang.\n\n                         MAN\n            Surrender!\n\nIt is a total surprise.  BONNIE, CLYDE and C.W. all grab\ntheir guns and fire several shots; they are not firing the\nbig guns now, but the pistols.  The man lingers there for a\nmoment--he looks strange, white, luminous, like an\napparition--and then he vanishes into the woods.  Silence,\nlong enough to make you think it was perhaps an illusion.\n\nThen there is a volley of gunfire--a noise so large as to be\nalmost an impossible sound--coming from the woods, all\naround, everywhere.\n\n                                                           97.\n\n\nA ring of little white puffs of smoke emerge from the woods;\nfrom every tree a puff of smoke.  The camera pans in a\ncircle.  Behind every tree is a man with a gun.  There are\nat least 150 people out there--peace officers, farmers with\nhunting rifles, kids with squirrel guns, everyone who wanted\nto come along and catch BONNIE and CLYDE.  Their number is\nso large because this time they want no possibility of the\ngang making what seemed by them supernatural escapes.\n\nFrom this point on, the sound of guns is unnaturally muffled\non the sound track.  We hardly hear them at all..it is like\na dream.\n\nWithout a word, all of the gang including the half-dead BUCK\nmaking his final effort, scramble for the nearest car.  They\nrun, throughout this battle, crouched, like animals--their\nonly thought, to get away, to escape.  To fight it out would\nbe ludicrous.\n\nFrom the moment the Barrows start in motion, there is\nshooting again from the edge of the woods.  We see them\nscrambling towards the car, in an extreme long shot,\nsurrounded by the ring of smoke.\n\n                                            CUT TO:\n\nINT. OF THE CAR.\n\nAll of them inside.  CLYDE is at the wheel.\n\n                                            CUT TO:\n\nEXT. CAR.\n\nMed. Long shot of the car moving.  The sound track goes to\ncomplete silence.  We see the car looking for an avenue of\nescape.  It veers towards a tree, a man steps out from\nbehind the tree and fires, the car jerks and veers toward\nanother tree, again a man steps out and fires and so on.\nThe car performs its eccentric dance, all in utter silence\n(no sound of the motor, nothing).  The film should have the\nfeeling of slow motion, as the car swerves and loops along\nthe edge of the woods.  Not once do any of the Barrows fire\nback.  Another man steps out and aims.\n\nINT. CAR.\n\nClose-up.  CLYDE.  At the wheel-shot in the arm.  He grabs\nhis arm in pain, loses control of the wheel.\n\n                                            CUT TO:\n\n                                                           98.\n\n\nEXT. CAR.\n\n--out of control (still silent).  It smashes into a tree\nstump.  The picture stops, freezes for three beats.  We hold\nthe image of the moment of crash, with pieces of metal\ncrumpling and flying into the air, suspended there by the\nstop-film.\n\n                                            CUT TO:\n\nINT. CAR.\n\nSound partly up again, but never at its realistic volume.\nFrom inside the smashed car, we peer out the window across\nthe field and see the other car.  The thought strikes the\naudience at the same time it strikes the gang--they must get\nto that car.\n\nMed. shot of the second car, sitting in the field, shining\nin the sun.  The lawmen also realize what must be done--cut\noff this escape.  Though BONNIE, CLYDE and the others are\nheading toward it, they suddenly train all their fire on the\ncar rather than the gang.\n\nThe car fills the frame of the screen.  Bullets begin to hit\nit.  It starts to quiver under the impact.  For the next\nminute, we see the car die in front of our eyes.  We see the\nbeautiful machine fall to pieces--windows smash, tires torn\napart, body riddled.  The death of the car is as painful to\nwatch as the willful death of a human being.  The execution\nis paced deliberately to show the ritualistic tempo of the\ndestruction.\n\nEXT. WOODS.\n\nThe camera pulls back, way back and slightly above everything\nto reveal the entire field.  On the left of the screen,\nBONNIE, CLYDE and C.W. are scrambling toward the edge of the\nwoods.  In the center BUCK and BLANCHE have taken cover\nbehind a fallen log.  In the foreground, police begin to\nemerge from the woods.  The camera zooms rapidly in with\nthem toward BUCK.  BLANCHE is screaming.\n\n                         BLANCHE\n            Don't kill him!  Don't kill him!\n            He's dying!\n\nBUCK is making a last feeble attempt.  The zoom continues\npast BUCK until it comes tight on his hand, a lawman's foot\nsteps on his hand.  BUCK falls over.  He dies.  BLANCHE\nscreams.\n\n                         BLANCHE\n            Don't die, Daddy.  Don't die!\n\n                                                           99.\n\n\nShe goes berserk.  Five men, one hardly a teen-ager, grab\nher and hold her as she writhes and cries.  She is still\nwearing the sunglasses.\n\n                                            CUT TO:\n\nEXT. WOODS AND STREAM.  BONNIE, CLYDE, AND C.W.  DAY.\n\nThey have reached the edge of the woods.  Camera tracks with\nthem as they run.  From all around come the sounds of the\nposse.  The three get in through the pines and come finally\nto a deep stream.  They jump in and start across, running\nawkwardly in chest-deep water.  They are half way across\nwhen the police appear on the bank behind them, shooting.\n\nClose-up.  BONNIE.  Day--as she is struggling through the\nwater.  A bullet hits her in the shoulder.  We must see this\nbullet clearly, we must see it go in her flesh so that we\ncan feel it.\n\nTight close-up of BONNIE's face as she screams.  It is the\nfirst time she has been hurt, and the scream is pure animal\npain.  She cries out.\n\nEXT. STREAM AND CORNFIELD.  DAY.\n\nCLYDE, who has almost reached the other side, comes back and\ngets her.  He drags her out of the water and into a cornfield\nthat starts growing on the opposite bank, C.W. helping.  He\nhalf-carries half-runs with her into the cornfield, as the\nfield gets deeper and thicker.\n\nThey stop for a second.\n\n                         CLYDE\n                   (panting, to Bonnie)\n            Saw...saw a farm...up ahead...gotta\n            get...a car...\n\nHe starts to give over the wounded BONNIE to C.W.\n\n                         BONNIE\n            Baby, no...\n\nBut CLYDE has not heard this last.  Working on pure\nadrenaline now, he struggles onward.  Camera tilts up\nslightly so we can see CLYDE as he essays his way toward a\nfarmhouse with a car in the distance.  After a few moments\nhe disappears and we can hear only the cracking of the\nstalks as that sound too diminishes,\n\nFull shot.  Cornfield.  Day.  Silence.\n\n                                                          100.\n\n\nClose.  C.W. and BONNIE.  Obviously some time later.  They\nboth lie prostrate in the field, listening.  C.W. licks his\nlips.\n\n                         C.W.\n            Maybe--\n\n                         BONNIE\n            Shhh!\n\nThey wait for another long moment, picking up only the\ntiniest sounds.\n\n                         BONNIE\n                   (finally)\n            Oh, no.\n\n                         C.W.\n                   (nervously)\n            What?  What?\n\n                         BONNIE\n                   (as though it were\n                   the most logical\n                   thing in the world)\n            I can't die without Clyde.  I just\n            can't.\n\nC.W. looks at her as if she's gone crazy.  After another\nmoment the corn begins to tremble, and we hear the o.s.\nsound of an approaching car.\n\nWith C.W. Day--tentatively lifting his head up to clear the\ncorn stalks.  With him we see the car looming larger,\nbearing down on us, splitting the corn stalks.  The car\nfinally comes to a stop a few feet in front of C.W.  BONNIE\nis on her feet, and CLYDE tumbles out of the car, practically\nbefore it's stopped, sweeping BONNIE into him.  For a moment\nboth are in their knees a few feet from the running board of\nthe car, simply holding onto each other and not moving.\n\n                         C.W.\n                   (tugging at both of\n                   them frantically)\n            C'mon!  C'mon!  C'mon!\n\n                                            ABRUPT CUT:\n\nINT. CAR.  ABOUT A HALF HOUR LATER.  DAY.\n\nThey have gotten away, but are still escaping.  C.W. is\ndriving.  He is bare-chested.  CLYDE is beside him in front,\nhis arm bleeding.  He falls in and out of consciousness.\nBONNIE is stretched out in back.\n\n                                                          101.\n\n\nHer shoulder has been bandaged with C.W.'s shirt.  She is\nunconscious.\n\nINT. CAR.  LATE DAY.\n\nCLYDE comes half-awake and looks over at C.W.\n\n                         CLYDE\n            Head out, C.W.\n\n                         C.W.\n                   (determinedly)\n            I'm goin' home to my daddy's farm.\n\n                                            DISSOLVE TO:\n\nEXT. ROAD WITH CAMPSITE.  THE SAME EVENING.\n\nC.W. is driving down the road, hell for leather.  Nearing a\ncampsite, where there are about six Okie cars and pick-up\ntrucks all loaded down, with a number of poor families\nseated around a campfire, cooking.  C.W. jams on the brakes.\nHe gets out, looking totally exhausted.\n\nReaction shot.  The faces of the Okies, looking at this\nsudden presence in their midst.\n\nBack to C.W.\n\n                         C.W.\n                   (about to drop)\n            Can y'all spare me a little water?\n\nEXT. CAMPSITE.  FULL SHOT.\n\nOne man, the leader of the group, dips a cup of water and\napproaches C.W. suspiciously.  He comes close enough to make\nC.W. reach out for the water, but withholds it from him.\n\n                         MAN\n            Who are you, boy?\n\n                         C.W.\n            Name's Moss.\n\nThis seems to be enough for the man, who gives him the water.\nAs C.W. gulps it down, the man begins to circle the car,\npeering into it suspiciously.  Suddenly he starts and his\neyes open wide.\n\n                         MAN\n                   (in really hushed and\n                   reverent tones)\n            It's Bonnie Parker and Clyde Barrow.\n\n                                                          102.\n\n\nHe stands there struck dumb, staring.  Those of the others\nwho have heard him begin to come over.  Without a word they\nmove quietly to the car and stare in.\n\nINT. CAR.\n\nBONNIE is out in the back seat; CLYDE is semi-conscious in\nthe front seat.  He looks up through half-closed eyes.\n\nEXT. CAR.\n\nWe see a woman pour a bowl of soup at the campfire and bring\nit to C.W.  He accepts it.\n\nA man rolls a cigarette and lights it.  Then, very gingerly,\nas if afraid to really touch him, he reaches through the\nwindow and places it in CLYDE's lips.  It hangs there, CLYDE\nunable to drag on it or remove it.\n\nChildren peer through the back window.\n\nC.W. finishes his cup of soup.  He hands it and the cup of\nwater back to a woman in the crowd.\n\nQuietly, moving together, the Okies step back.  C.W. walks\nto the driver's seat, gets in and shuts the door.  He starts\nup the car.\n\nThe people push a bit closer for a last look.  CLYDE, unable\nto do more, nods his head in a barely perceptive gesture by\nway of saying \"thank you\" t ot the people.  The cigarette is\nstill dangling from his lips.\n\nThe car moves off.  A YOUNG BOY pulls on his FATHER's shirt.\n\n                         BOY\n            Who was they, Pa?\n\n                         MAN\n            That was Bonnie and Clyde, the bank\n            robbers.\n\nA woman, nearby, smiles sweetly.\n\n                                            DISSOLVE TO:\n\nEXT. MOSS FARM.  MIDDLE OF THE NIGHT.\n\nThe car pulls up outside the slightly ramshackle farm of\nMALCOLM MOSS, C.W.'s father, in Arcadia, Louisiana.  It\nsits, for a moment, in the dark.  Then C.W. honks the horn.\nA few seconds pass, and the porch light comes on.  OLD MAN\nMOSS comes out in his pajamas and peers into the darkness.\nHe is a fat man with gray hair.\n\n                                                          103.\n\n\n                         MALCOLM\n            Who's there?\n\n                         C.W.\n                   (calling back)\n            Daddy?\n\n                         MALCOLM\n            Who's there?  Who is it?\n\n                         C.W.\n            It's C.W.  It's Clarence.\n\n                         MALCOLM\n            Clarence!\n\nHe runs down the steps, down the path to his son.  They\ngreet each other, hugging for a second, looking each other\nover.\n\n                         MALCOLM\n            God, it's good to see you, boy!\n\nHe holds C.W. at arm's length to study him, and suddenly he\nscowls at something he sees by the light of the porch.\n\n                         MALCOLM\n            What's that on your chest?\n\n                         C.W.\n                   (puzzled)\n            Huh?\n                   (realizing what he means)\n            It's a tattoo...I'm in trouble.\n            I'll tell you about it later.  My\n            friends are hurt.  Help me get 'em\n            in.\n\nMALCOLM goes to car and looks inside for a moment.  He walks\nback to C.W.\n\n                         MALCOLM\n            Jesus, what happened to them?  You\n            in trouble, son?\n\n                         C.W.\n            Yeah.  That's Clyde Barrow and\n            Bonnie Parker.\n                   (reaction from Malcolm)\n            We been shot.  Help me get 'em\n            inside.  We gotta help 'em.\n\nThey go to the car and drag the unconscious BONNIE out and\nbegin carrying her up to the house.\n\n                                                          104.\n\n\n                         MALCOLM\n            Why'd you get yourself marked up?\n            A tattoo!  What in hell made you do\n            a damn fool thing like that?\n\nThey reach the house.\n\n                         C.W.\n            C'mon, Pa, open the door.\n\nINT. SHERIFF'S OFFICE IN DEXTER.  DAY.\n\nAlthough the scene begins with a full-screen close-up of a\nnewspaper clipping with a photo, it is just a blurry-gray,\ncrowded scene of BLANCHE's capture.  Really impossible to\nmake anybody out in the crowd.  Camera stays on photo as we\nhear voice over of two men talking: a sheriff and his deputy.\n\n                         BILLY\n            I was in the bunch that took 'er.\n            See here?  Can you make me out?\n            Here I am, see here, right behind\n            Joe Boyd here.\n\n                         PETE\n            Sure enough, Billy, is that your\n            head there?\n\nCamera pulls away, BILLY, a young deputy--cold, intense,\nhumorless and square, carefully folds up the clipping and\nputs it in his wallet.\n\n                         BILLY\n            Still can't figure how we let them\n            other two get away.\n\n                         PETE\n                   (an older, more\n                   genial type)\n            Yeah, seems as how nobody can get\n            'em somehow.\n\n                         BILLY\n                   (sullen)\n            Yeah...well, maybe this boy'll be\n            the one to do it, this Hamer guy.\n            Boy if he can't do it, Sheriff,\n            ain't nobody but the whole U.S.\n            Army can do it.\n\n                                                          105.\n\n\n                         PETE\n                   (with a new note of\n                   enthusiasm, gets up\n                   and walks to the\n                   window--turning to Billy)\n            You hear he quit the Rangers on\n            account of Texas got that woman\n            governor.  Said he wouldn't work\n            under no woman.\n\n                         BILLY\n                   (respectfully)\n            Yeah, that's somethin' all right.\n            Say, how many they say he shot\n            anyway in his day?\n\n                         PETE\n            Sixty-five they say.\n\n                         BILLY\n            Son of a sea-cook!\n\nThe door opens.  We see, full shot and then fast close-up\nFRANK HAMER.  It should be a complete shock to the audience--\nthis is the man kidnapped by the gang earlier and partially\ndestroyed by BONNIE.\n\nHAMER is dressed in his Ranger outfit and hat, and again he\nhas that quality of sinister frenzy beneath his calm manner.\nHis attitude toward these lawmen is sheer condescension,\nfriendly only out of convention, really superior and\ncontemptuous of lesser workers in his field.\n\n                         HAMER\n                   (with politeness\n                   arising from condescension)\n            Excuse me, am I in the right place?\n            Is this Sheriff Smoot?\n\nPETE and BILLY jump up from the chairs and walk over to\nHAMER, hands extended.  They are quite impressed by meeting\nin the flesh.\n\n                         PETE\n                   (mispronouncing his name)\n            Frank Hammer.  I sure am pleased to\n            meet you!\n                   (shakes his hand)\n\n\n                         HAMER\n            Hamer.\n\n                                                          106.\n\n\nEXT. MOSS FARM.  CLOSE SHOT NEWSPAPER.  DAY.\n\nA coil of rope snaps into and through the paper, splitting\nit and revealing C.W.'s startled face.  CLYDE strides the\nporch angrily, snapping the rope.\n\nBONNIE and MALCOLM are seated along with C.W.  Through\nBONNIE has her arm supported by a sling and CLYDE has his\nshoulder bandagedm it is evident by CLYDE's heady indignation\nand BONNIE's attentiveness that both are well on the way to\nrecovery.\n\n                         CLYDE\n                   (still snapping rope)\n            FLED?  What do they mean, fled?\n            How in the nama God could I leave\n            my brother to die when he was\n            already dead when I left him?\n                   (livid)\n            He was shot in too many pieces to\n            pick off the ground!  Fled...what\n            do they know, the papers or the\n            police?...\n\nSuddenly he moves upon MALCOLM with enormous intent, as if\nby pounding the point home to the one relative stranger\namong them, he will justify it all.  MALCOLM momentarily\nflinches, then listens with intense deference.\n\n                         CLYDE\n            Why, while we were all lyin' around\n            here, near dead, they had us\n            holdin' up the Grand Prairie\n            National Bank!  They hung that one\n            on us just for luck, I guess.\n\nCLYDE shakes his head, still thinking this over.  Abruptly,\nto BONNIE, with deadly seriousness:\n\n                         CLYDE\n            Tell you what.  Soon's we get well,\n            we're gonna take that bank!\n\nHe breaks into a wicked grin, but then reels, catching\nhimself on the porch railing.  He's obviously dizzy from\nexertion and anger.  BONNIE starts--then sees CLYDE is in\ncontrol.\n\n                         CLYDE\n                   (remarking on his own dizziness)\n            Whooooooo, boy...\n                   (kneeling, to Bonnie)\n            They don't know nothin'--do they,\n            sugar?\n\n                                                          107.\n\n\n                         BONNIE\n                   (assuring him)\n            You did all you could, hon'.\n            Nobody coulda done more.\n\nC.W. has been studying hard on the torn paper, b.g.  Suddenly:\n\n                         C.W.\n            Hey.  How come I'm always called\n            the \"Un-identified sus-spect?\"\n\nGroup shot.  Porch.  C.W. has trouble with this last phrase.\nBONNIE laughs.  This picks up CLYDE's spirits once more.\n\n                         CLYDE\n                   (to C.W.)\n            You can just thank your lucky stars\n            that's all you are.  So long's they\n            don't have your last name, you're\n            home safe.\n\n                         MALCOLM\n                   (toadying to Clyde,\n                   talking to Clarence)\n            Mr. Barrow's lookin' out for your\n            interests, boy.\n\n                         C.W.\n                   (impressed)\n            Oh...Hey, Pa, how you like havin' a\n            coupla big deals stayin' with you?\n\n                         MALCOLM\n                   (friendly as can be)\n            Ain't that somethin' for me?\n\n                         CLYDE\n                   (back in good mood, expansive)\n            Well now, you been real nice to us,\n            and I tell you what, let us pay you\n            forty dollars for your hospitality,\n            what do you say?\n\n                         MALCOLM\n                   (protesting vehemently)\n            No, no, no.  I don't want your\n            money.  I'm just pleased to have\n            your company.  Any friend of my\n            boy's...\n\n                         C.W.\n                   (abruptly)\n            Hey, Pa, let's have supper.  I'm\n            hungry.\n\n                                                          108.\n\n\n                         MALCOLM\n                   (smiling)\n            Yeah...okay, Clarence...\n                   (to Clyde)\n            You're welcome here, now you know\n            that.\n\nINT. MOSS HOUSE.\n\nThey go into the house.  Camera goes with them.  As soon as\nthey are out of earshot from BONNIE and CLYDE, MALCOLM turns\non C.W. displaying an entirely different demeanor from the\none he presented outside.\n\n                         MALCOLM\n                   (indicating tatto\n                   which flutters\n                   through C.W.'s open shirt)\n            You look like trash, boy, marked up\n            like that.  Cheap trash.\n\n                         C.W.\n                   (protesting)\n            Bonnie says it looks good.\n\n                         MALCOLM\n            Bonnie, what does she know.  She's\n            just cheap trash herself.  Look\n            what they do to you, and you don't\n            even get your name in the paper--\n            just pictures put on your skin, by\n            \"Bonnie and Clyde\"--\n                   (more to himself)\n            --why they're a coupla kids.\n\n                         C.W.\n            But, Daddy--\n\n                         MALCOLM\n            I'm just glad your ma ain't alive\n            to see that thing.\n\nC.W. peeks at it, peering down at his chest, trying to bring\nthe bluebirds into focus, puzzled.\n\n                         C.W.\n            I don't see what's so bad about it...\n\nINT. HOSPITAL.  MED. SHOT OF THE ROOM.\n\nSeated in a soft chair, looking directly at us, is BLANCHE\nBARROW.  Her eyes are completely covered with a white\nbandage.  She wears a hospital gown.  The room is white and\nbright.\n\n                                                          109.\n\n\nMed. shot.  HAMER in the doorway.  The nurse leaves.  He\nreaches in his pocket and pulls out a white handkerchief.\nHe puts it over his mouth to disguise his voice, afraid she\nwill remember it from the kidnap.  Quietly, almost on\ntiptoes, HAMER walks over to BLANCHE.  He gets inches away\nfrom her face.  She still doesn't know he is there.\n\n                         HAMER\n                   (quietly, but\n                   suddenly, his voice\n                   muffled by the handkerchief)\n            Blanche Barrow.\n\nShe starts to her feet, then adjusts to his presence.  She\nis a bit panicked.  BLANCHE is now a defeated human being.\nHer voice and manner bespeak great weariness, sorrow and\nstill a touch of her old high-strung hysteria.  But most of\nthat is gone now, like everything else that was really vital\nin her life.\n\n                         BLANCHE\n            What?  What?  Who is it?\n\n                         HAMER\n                   (in a monotone, a\n                   relentless questioner)\n            You know your husband's dead.\n\n                         BLANCHE\n                   (her voice flat and expressionless)\n            I know.\n\n                         HAMER\n            You're going to prison.\n\n                         BLANCHE\n            I know it.\n\n                         HAMER\n            Where's the rest of 'em?\n\n                         BLANCHE\n            I don't know.\n\n                         HAMER\n            Where's the rest of 'em?\n\n                         BLANCHE\n            I just don't know.  I don't know.\n\n                         HAMER\n            How'd you get in with them?\n\n                                                          110.\n\n\n                         BLANCHE\n                   (starting slow, but\n                   warming up to the\n                   subject, she begins\n                   to talk and talk for\n                   the sake of airing\n                   her troubles)\n            I didn't mean to.  I didn't.  Buck\n            said we was just goin' to visit, we\n            wouldn't be doin' no robbin' and\n            stealin', and then we went to\n            Joplin and all of a sudden they\n            started shootin'.\n                   (hysteria begins to\n                   creep into her voice\n                   as she relives it all)\n            And we run off, God, I was scared.\n            And then it was run all the time,\n            and I wanted to go, I begged to go,\n            but Clyde and Bonnie and C.W.--\n\n                         HAMER\n                   (seizing on it)\n            C.W.  C.W. who?\n\n                         BLANCHE\n            C.W. Moss.\n\n                                            FADE OUT:\n\nFADE IN:\n\nEXT. CAR ON THE MOSS FARM.  A DIRT PATH NEAR THE BARN.  DAY.\n\nIt is pouring rain, middle of the afternoon, BONNIE and\nCLYDE are inside the car, sitting.  They have lived so much\nin cars that they tend to still spend much of their time in\nit rather than in a room.  There they are themselves.\n\nINT. CAR.\n\nBONNIE is in the back seat, her legs wrapped in a plaid\nblanket, writing poetry.  She looks like Elizabeth Barrett\nBrowning.  With one essential difference--her arm is in a\nsling and she is wearing bandages on the shoulder.  CLYDE is\nin the front seat, reading a newspaper.  He is also partially\nbandaged.  On the dashboard is a box of ginger-snaps which\nhe eats while he reads.  They look domestic.\n\n                         CLYDE\n            Want a ginger-snap, Bonnie?\n\n                                                          111.\n\n\n                         BONNIE\n                   (busy, absorbed)\n            No, hum-umm.\n                   (then she realizes\n                   his nice gesture and\n                   smiles warmly at him)\n            But thanks anyway, Clyde.\n                   (she takes it all in,\n                   her situation, and\n                   looks content and cozy)\n            It's real nice here, just the two\n            of us like this.\n\n                         CLYDE\n                   (more interested in\n                   his paper)\n            Uh-huh.\n                   (something in the\n                   paper catches his interest)\n            Look here, honey, remember this?\n\nHe holds up the paper; there is one of the photos from the\nmotel, the one showing BONNIE smoking.  She looks up at it\nwith mild interest.\n\n                         BONNIE\n            Yeah, at the motel.\n\n                         CLYDE\n                   (studying the picture)\n            You sure don't resemble that no more.\n\nClose-up BONNIE.  She doesn't.  She has become totally\nfragile, the essence of herself.  She is writing on a pad.\n\nCLYDE and BONNIE.\n\n                         CLYDE\n            What you writin' this time?\n\n                         BONNIE\n                   (intensely)\n            I'm writing a poem about us.  I'm\n            writing our story.\n\n                         CLYDE\n                   (this appeals to his ego)\n            Oh, are you?  Let's hear it.  If\n            it's good, I'll mail it in to the\n            Law and it'll be printed in all the\n            papers again.\n\n                         BONNIE\n            Just let me finish this line.\n\n                                                          112.\n\n\nShe does so.  CLYDE munches a cookie.\n\n                         BONNIE\n                   (continuing)\n            Okay, here it is.\n\nClose-up.  BONNIE--as she reads intensely.  At the beginning\nof this montage, the camera remains on her face.  Behind her\nwe see the rain on the window.\n\n                         BONNIE\n                   (reading)\n            \"The Story of Bonnie and Clyde\"\n\n            You've heard the story of Jesse\n            James--\n            Of how he lived and died:\n            If you're still in need\n            Of something to read\n            Here's the story of Bonnie and\n            Clyde.\n\n            Now Bonnie and Clyde are the Barrow\n            Gang\n            I'm sure you all have read\n            How they rob and steal\n            And those who squeal\n            Are usually found dying or dead.\n\n            They call them cold-hearted killers;\n            They say they are heartless and\n            mean;\n            But I say this with pride,\n            That I once knew Clyde\n            When he was honest and upright and\n            clean.\n\n            But the laws fooled around,\n            Kept taking him down\n            And locking him in a cell,\n            Till he said to me,\n            \"I'll never be free\n            So I'll meet a few of them in\n            hell.\"\n\n            The road was so dimly lighted;\n            There were no highway signs to\n            guide;\n            But they made up their minds\n            If all roads were blind,\n            They wouldn't give up till they died.\n\n                                            CUT TO:\n\n                                                          113.\n\n\nINT. POLICE STATION.  DAY.\n\nThe manuscript is lying on the police blotter.  HAMER picks\nit up and continues reading it.  He reads it in a halting\nway:\n\n                         HAMER\n            The road gets dimmer and dimmer;\n            Sometimes you can hardly see;\n            But it's fight man to man,\n            And do all you can,\n            For they know they can never be\n            free.\n\n            From heartbreak some people have\n            suffered;\n            From weariness some people have\n            died;\n            But take it all in all,\n            Our troubles are small,\n            Till we get like Bonnie and Clyde.\n\nClose-up of a newspaper page.  The poem is printed all the\nway down the length of one column.  On the sound track,\nBONNIE's voice picks up the recitation:\n\n                         BONNIE'S VOICE (O.S.)\n            If a policeman is killed in Dallas,\n            And they have no clue or guide;\n            If they can't find a fiend,\n            They just wipe their slate clean\n            And hang it on Bonnie and Clyde.\n\nINT. CAR.  CLOSE-UP OF BONNIE.  DAY.\n\nThe day is sunny and we see it through the car window.  She\ncontinues reading, but now she reads it directly from the\nnewspaper:\n\n                         BONNIE\n            If they try to act like citizens\n            And rent them a nice little flat\n            About the third night\n            They're invited to fight\n            By a sub-gun's rat-tat-tat.\n\n            Some day they'll go down together;\n            They'll bury them side by side;\n            To few it'll be grief--\n            To the law a relief--\n            But it's death for Bonnie and Clyde.\n\n                                                          114.\n\n\nBONNIE finishes the poem, as camera pulls back slightly to\nshow that it is a different day, different clothes and the\nbandages are gone.  As she stops, she has an expectant and\nsomewhat self-satisfied look.\n\nClose-up of CLYDE.  His eyes are wide, his mouth open, his\nface shows surprise and delight and he is on the verge of a\ngiant laugh.\n\n                         CLYDE\n                   (in gleeful wonder)\n            Damn!  That's me!\n\nA great laugh comes bursting from him.  Camera widens to\ntake in BONNIE.  She is both startled and delighted by his\nresponse.\n\n                         CLYDE\n                   (continuing)\n            In that poem!\n\nBONNIE giggles.\n\n                         CLYDE\n                   (continuing; it is\n                   all starting to come\n                   out now--his\n                   realization that he\n                   has made it, that he\n                   is the stuff of\n                   legend, that he is an\n                   important figure)\n            A sub-gun's rat-tat-tat!\n                   (he begins to laugh loudly)\n            Right in the paper!\n\nClose-up BONNIE.  Now laughing too, with a great feeling of\njoy.\n\nTwo shot.  BONNIE and CLYDE.\n\n                         CLYDE\n            Jesse James!  You hear 'bout old\n            Jesse, now you goin' to hear 'bout\n            Clyde!\n\nHe puffs up with air and explodes like a steam valve.\n\n                         CLYDE\n                   (continuing)\n            Pshhhhhh!\n\nHe grabs BONNIE and chuckles delightedly.\n\n                                                          115.\n\n\n                         CLYDE\n                   (continuing)\n            Damn, Bonnie!  You musta been one\n            hell of a waitress!\n\nClose-up.  BONNIE--laughing, her eyes filled with tears.\nCLYDE's hand wipes them away.\n\nTwo shot.\n\n                         CLYDE\n                   (shaking his head\n                   back and forth like a\n                   puppy, just so much\n                   glee in him that he\n                   can't hold it)\n            Oooooh, that Clyde!  That's my boy,\n            that Clyde!\n\nHe looks at her with love and delight, hugs her tightly.\n\n                         CLYDE\n            Bonnie...\n                   (she hugs him back)\n            The Poem of Bonnie and Clyde!\n\n                         BONNIE\n                   (laughing at the\n                   mistake, happy)\n            The Story.\n\n                         CLYDE\n            The Story of Bonnie and Clyde!  Oh,\n            child, you really did tell that\n            story!\n\nHe pulls her to him, his face inches away from hers, about\nto kiss her.  She is waiting, expecting... Suddenly, he lets\nout one wild laugh almost into her mouth.\n\nHe kisses her.  She kisses back.  They are chuckling,\ngiggling.  They grow more ardent; they pull back and laugh\nagain.  They begin to make love.\n\nEXT. ARCADIA STREET.  ICE CREAM PARLOR.  DAY.\n\nBright afternoon.  Camera across the street from an ice\ncream parlor.  Sign about it: \"EVA'S HAND-PACKED ICE CREAM.\"\nA large plate glass window fronts the store, and through it\nwe can see the people inside seated at tables and booths.\nProminent in our vision is MALCOLM MOSS, seated, facing\ncamera.  He is seated across from another man, but we see\nhim from the back.\n\n                                                          116.\n\n\nMALCOLM is obviously doing a lot of talking and then some\nhard listening; gesticulating and looking disturbed.  After\na bit of this, he rises from the table and begins walking\ntoward the door.  The other man rises and turns.  We now see\nthat it is FRANK HAMER.\n\nMALCOLM and HAMER come out onto the sidewalk, squinting in\nthe sunlight.  MALCOLM mimes some social pleasantries by way\nof saying \"goodbye,\" but HAMER's face shows no emotion of\nrecognition of the gesture.  He turns and walks away,\nwalking out of the frame.\n\nMALCOLM stands where he is, in front of the ice cream parlor.\nBy the expression on his face, we can see that he is rather\ndisturbed by what he has heard and that he is still grappling\nwith the problem.\n\n                                            DISSOLVE TO:\n\nBONNIE and CLYDE.  They lie where they were with one\ndifference--they are now wrapped in the blanket.  CLYDE's\npants are wadded up and tangled with his shoes at the base\nof the blanket.\n\n                         CLYDE\n                   (chuckling, apparently\n                   quite pleased)\n            Damn!...damn...damn!\n\nHe casts a sidelong glance to BONNIE, wanting some sort of\novert reaction from her.  She's just smiling slightly.\nCLYDE's underlying anxiety begins to surface.\n\n                         CLYDE\n                   (not looking at her)\n            Hey, listen, Bonnie, how do you feel?\n\n                         BONNIE\n                   (watching him\n                   steadily, her slight\n                   smile growing)\n            Fine.\n\n                         CLYDE\n            I mean you feel like you're s'posed\n            to feel after you've uh...\n\n                         BONNIE\n            Just.\n\n                                                          117.\n\n\n                         CLYDE\n                   (doesn't know what\n                   the fuck to say,\n                   desperately wants her approval)\n            Well, that's good, ain't it.\n            Reason I ask is, I uh... Well, I\n            figger it's a good idea to ask.  I\n            mean how else do I tell if I did it\n            the way...\n\n                         BONNIE\n                   (stopping him, with\n                   great warmth)\n            Hey.  You done just perfect.\n\nCLYDE looks at her for the first time, tremendously relieved.\nHe can see she means it.  Now his buoyancy, utterly,\nunchained breaks through:\n\n                         CLYDE\n            I did, didn't I?  I mean I did, I\n            really did.  I did it, I did, I\n            mean this was my first time and it\n            was just like rollin' off a log\n            when it comes right down to it, it\n            was easy, I mean I didn't even have\n            to try...\n\nLovingly, laughing, altogether overwhelmed with himself,\nCLYDE pulls BONNIE into him.  He kisses her, wants to make\nlove again, but then pulls back and keeps chattering at\nsixty miles a minute.  He's waited twenty-three years to\ntalk about this, and he's got the perfect audience.\n\n                                            DISSOLVE TO:\n\nINT. KITCHEN.  MOSS FARM.  TWILIGHT.\n\nAfter dinner.  There are four empty plates, but only C.W.\nand MALCOLM in the kitchen.  C.W. is scraping the bottom of\na wilted \"EVA'S HAND-PACKED ICE CREAM\" carton.  MALCOLM\nstudies his son's quiet intensity in this direction for a\nmoment, then moves very close, whispers when he speaks.\n\n                         MALCOLM\n                   (whispering)\n            Boy, they expect you to go downtown\n            with 'em tomorrow?\n\n                         C.W.\n                   (out loud, licking\n                   his ice cream)\n            Who?\n\n                                                          118.\n\n\n                         MALCOLM\n                   (raising his own\n                   voice, infuriated by\n                   his son's obtuseness)\n            Bonnie and Clyde!...\n                   (he slaps the carton\n                   out of C.W.'s hands;\n                   whispering again)\n            Bonnie and Clyde.\n\n                         C.W.\n            Sure, I always go with them.\n\nMALCOLM thinks hard about this.\n\n                         MALCOLM\n            ...better go then, you better go,\n            better go...\n                   (forcing C.W. to sit\n                   at table)\n            --but when they get back in the car\n            to come on home, don't get in with\n            them.\n\n                         C.W.\n                   (genuinely puzzled)\n            Why, Daddy?\n\n                         MALCOLM\n            You just listen to your Pa fer once!\n            Cain't you do that?  I'm yore\n            Daddy, I'm your kin, not Clyde.\n\n                         C.W.\n                   (still confused)\n            Well, what should I tell 'em? \"I\n            can't get back in the car with you?\"\n\nMALCOLM is ready to kill--his son's obtuseness and his fear\nof CLYDE is whipping him into a quiet frenzy.\n\n                         MALCOLM\n                   (squeezing C.W.'s arm)\n            No, you tell them nothin', hear?\n                   (hesitates, then)\n            I made a deal and got you off with\n            a coupla years!\n\n                         C.W.\n                   (a piercing treble)\n            Made a deal with who, Daddy?\n\n                                                          119.\n\n\nMALCOLM hauls off and whacks C.W. across the top of his head\nwith the flat of his hand, then momentarily holds his hand\nover C.W's mouth.\n\n                         MALCOLM\n                   (we can see his own fear)\n            ...the law.  Just don't get back in\n            that car.\n                   (eyeball to eyeball)\n            And whatever you do, don't let onto\n            them, hear?\n\nC.W. suddenly smiles, as if he knew something.\n\n                         C.W.\n                   (expletive)\n            Whew!... You think them laws are\n            gonna catch Bonnie and Clyde in town?\n\nC.W. returns to the ice cream carton--MALCOLM lets him,\nfiguring he better find out what he can.\n\n                         MALCOLM\n            What do you think, Clarence?\n\n                         C.W.\n                   (matter of fact)\n            They ain't gonna catch 'em.  Don't\n            matter whether I let on or not.\n\n                         MALCOLM\n                   (playing along)\n            Mebbe.  Just you be off'n the\n            streets of that town when they go\n            to get in their car.\n\n                         C.W.\n                   (looking directly at Malcolm)\n            Nobody catches Clyde.  Clyde's got\n            a sense, don't you know that, Daddy?\n            Nobody catches Clyde.\n\nMALCOLM knows better, but for just a moment he stares at his\nson, fearing that maybe C.W., for all his limitations, has a\nsense about CLYDE's sense.  C.W. has finished with the\ncarton and crumples it, licking the last remnants of cream\noff his fingers.\n\nINT. BEDROOM.  MOSS FARM.  NIGHT.\n\nBONNIE and CLYDE's bedroom, the middle of that night.  Both\nare wide awake, lying on opposite sides of the double bed.\nBoth are staring into the night, disquiet.\n\n                                                          120.\n\n\n                         CLYDE\n                   (suddenly)\n            Bonnie?  Bonnie, will you marry me?\n\nThere is a silent gasp from BONNIE, a barely perceptible\nstiffening.  Then she talks in a voice falsely formal, still\nstaring up at the ceiling.\n\n                         BONNIE\n            How could I do that, Clyde?  You\n            know it's impossible.  We'd have to\n            go to a Justice of the Peace and\n            the Justice of the Peace is a\n            lawman.  We couldn't even take out\n            a license.\n\n                         CLYDE\n                   (with a chuckle)\n            Hey now, you sound like you been\n            givin' it some thought on your own.\n\n                         BONNIE\n                   (with a grim irony,\n                   her voice getting\n                   more and more emotional)\n            Oh no, I never gave it thought.  I\n            haven't thought about it at least\n            ten times a day, I haven't thought\n            about it every minute of my life\n            since I met you.\n                   (suddenly her voice\n                   cracks into tears)\n\n\nShe flings herself violently across the bed and buries\nherself into CLYDE's chest, her knees drawn up, her head\ntucked down into him, her body shaking with sobs.\n\n                         CLYDE\n                   (a bit startled by\n                   this, attempting to\n                   hold her, awkwardly,\n                   and placate her.  He\n                   puts his arm around her)\n            Bonnie...are you crying, honey?\n\nBONNIE nods yes and slowly gets control over her tears.\n\n                         BONNIE\n                   (her face still\n                   buried in CLYDE's\n                   chest, she whispers)\n            Clyde, why do you want to marry me?\n\n                                                          121.\n\n\nCLYDE thinks a minute and then grins.\n\n                         CLYDE\n                   (in an attempt to be humorous)\n            To make an honest woman out of you.\n\nBONNIE is silent.\n\n                         BONNIE\n                   (finally, in a voice\n                   charged with\n                   anticipation and dream)\n            Clyde...what would you do, what\n            would you do it some miracle\n            happened and we could walk out\n            tomorrow morning and start all over\n            again, clean, with no record, with\n            nobody after us?\n\nCLYDE thinks about it a minute.\n\n                         CLYDE\n            Well...I guess I'd do it all\n            different.  First off, I wouldn't\n            live in the same state where we\n            pull our jobs.  We'd live in one\n            state and stay clean there, and\n            when we wanted to take a bank, we'd\n            go to another state...and...\n\nSuddenly he realizes that he has said the worst thing he\ncould have, that it was not the answer BONNIE wanted to hear.\nHe looks down at her, his voice anxious.\n\n                         CLYDE\n                   (continuing)\n            Bonnie?\n\nShe is silent.\n\n                         CLYDE\n            Hey, Bonnie?\n\nBut she does not answer.\n\nEXT. ROADSIDE.  EARLY MORNING.\n\nWe see MALCOLM jacking up the back wheel of his pickup truck\nwhich is parked on the side of the road in a wooded area.\n\n                                            CUT TO:\n\n                                                          122.\n\n\nEXT. ARCADIA STREET.  MID-MORNING.\n\nA street in Arcadia.  The car is parked.  BONNIE and CLYDE\nwalks toward the car carrying big bags of groceries and\nsupplies and put them inside.\n\n                         CLYDE\n                   (looking around)\n            What happened to C.W.?\n\n                         BONNIE\n            He stopped off in that hardware\n            store to get light bulbs for his\n            daddy.\n\nCLYDE opens the door of the driver's seat and sits down.\n\nINT. CAR.  ARCADIA STREET.  DAY.\n\n                         CLYDE\n            Boy, my feet are sweatin'.\n\nHe takes off his shoes.\n\n                         BONNIE\n                   (kidding around)\n            You plannin' to drive with your\n            shoes off?\n\n                         CLYDE\n            Sure, why not?\n\nHe reaches in his shirt pocket and takes out his sunglasses.\nAs he goes to put them on, one of the lenses falls out.\n\n                         CLYDE\n            Damn!\n\nHe puts them on.\n\n                         BONNIE\n                   (laughing)\n            You gonna wear 'em?\n\n                         CLYDE\n            Sure, drive with one eye shut.\n\nBONNIE gets in the car, rummages around in one of the bags\nand pulls out something wrapped in tissue paper.  She\nunwraps it and puts it up on the dashboard, displaying it.\nIt is a little porcelain shepherdess holding a crook in her\nhand, worth about thirty cents.\n\n                                                          123.\n\n\n                         BONNIE\n                   (admiring it)\n            Isn't that the prettiest thing, hon?\n            Just look here, you can see every\n            little fingernail on her hands.\n\nShe shows him.\n\n                         CLYDE\n            It is a pretty thing, honey.\n\nCLYDE turns on the radio and gets some hillbilly music.\nThey are singing \"Little Church in the Valley.\"  He beats\ntime on the steering wheel, getting a little impatient.\nBONNIE puts her shepherdess away and begins looking in the\ngrocery sack.\n\n                         BONNIE\n            We got any peaches?  I sure could\n            go for a peach right now.\n\nShe burrows in the bag and comes out with a peach.  She\ntakes a big bite.  The juice drips down the side of her\nmouth.  She looks beautiful.\n\n                         CLYDE\n                   (he stops drumming\n                   his fingers, suddenly\n                   has an idea)\n            Whyn't we do it tomorrow?\n\n                         BONNIE\n            Do what?\n\n                         CLYDE\n            Tomorrow's Sunday, ain't it?  We\n            could drive all night and be on\n            that golf course tomorrow morning!\n\n                         BONNIE\n            You sure you feel up to it?\n\n                         CLYDE\n                   (enthused)\n            Yeah, why not?\n                   (now feeling anxious\n                   and excited, he is\n                   impatient to move)\n            Where is that boy?  He's gone too\n            long.\n\n                                                          124.\n\n\n                         BONNIE\n                   (humming to the radio)\n            He'll be here.\n                   (holding the peach to him)\n            You take a bite, hon.\n\n                         CLYDE\n                   (getting worried)\n            No, it's takin' too long.  What if\n            something happened?\n\n                         BONNIE\n            Nothin' happened.\n\n                         CLYDE\n                   (more urgently)\n            Go take a look, see what's keepin'\n            him.\n\nNot too delighted with the chore, BONNIE goes off.  We\nremain with CLYDE, getting anxious.  The music plays on.\nBONNIE comes back, hurriedly, now anxious herself.\n\n                         BONNIE\n            He ain't there.\n\nCLYDE jumps into action, slams his door.\n\n                         CLYDE\n            C'mon, let's go.\n\nBONNIE gets in.  They drive off.\n\nINT. STORE.  CLOSE-UP C.W.  DAY.\n\n--hiding inside a store, peering out through a curtained\nwindow at them driving away.  His expression is disturbed;\nhis face half in shadow.\n\nEXT. ROAD.  DAY.\n\nBONNIE and CLYDE's car coming down the road.  Camera sees\nfrom CLYDE's P.O.V.  MALCOLM standing in the road, waving\nhim down.  The pickup truck, its back jacked up, is parked\nbeside him on a shoulder of the road.\n\nINT. CAR.  DAY.\n\n                         BONNIE\n            What's wrong?\n\n                         CLYDE\n            I don't know.\n\n                                                          125.\n\n\nEXT. ROAD.\n\nCLYDE reaches the spot, pulls off the road and stops the car.\nHe gets out.  Camera pulls back.  CLYDE talks to the old\nman, BONNIE stays in the car.  Cut to a shut down the trench\nof the law, tense.\n\nSuddenly, a truck loaded with chickens comes riding down the\nroad from the opposite direction.  HAMER sees it from a long\nway away and realizes that he cannot afford to let anything\npass between him and his quarry.  He decides the time is now.\nHe leaps up from the trench and yells at CLYDE.\n\n                         HAMER\n            Barrow!\n\nThe OLD MAN dives under his truck to hide.  The shooting\nstarts.\n\nWe see the chicken truck.  Two men in the front seat.  They\nsee ahead of them an incredible shooting match and, in\nterror, they jam on the brakes and leap out of the truck.\nThey run as fast as they can into the meadow, away from the\ntrouble.\n\nThe gun fight takes just seconds during which law fires\neight-seven shots at BONNIE and CLYDE, giving them absolutely\nno chance.  The sound is rapid, deafening.\n\nAt no point in the gun fight do we see BONNIE and CLYDE in\nmotion.  We see, instead, two still photographs cut into the\nsequence: one of Clyde, half out of the car, taking careful\ndead aim with his gun, just as he did in the teaching scene:\none of BONNIE, in terror, a pack of cigarettes in her hand\nclutched tight, looking as fragile and beautiful as she can\nbe.\n\nThe noise stops at once.  Utter silence.  It has been a\nmassacre.  BONNIE and CLYDE never had a chance to return the\ngunfire.  We see the car, a complete shambles.  We never see\nBONNIE and CLYDE dead, though for a moment we discern their\nbodies slumped in the car.\n\nThe camera pulls above the car until it is on a level with\nthe opposite side of the road.  Then, slowly, the six lawmen\nstand up in the trench.  On the faces of the five deputies,\nhorror and shock at what they have just done.  HAMER,\nhowever, registers no emotion.  His face is a blank.  He\nlights a cigarette.  Slowly, slowly, the five men begin to\nedge closer to the car to see the result.  Music, the wild\ncountry breakdown music, begins on the sound track.\n\n                                                          126.\n\n\nBefore they reach the car, the camera swings away from them,\npast them, and zooms out and above into the meadow where the\ntwo truck drivers are standing--tiny, distant figures.\n\nThe truck drivers begin to walk toward the camera, coming\nback to the road to see what happened.  They get closer and\ncloser to the camera until they have reached a middle\ndistance and, as they continue to walk at us, it is--\n\n                           THE END\n\n                                            CUT TO BLACK.\n\n \n \n\n\n<!--Ad Banner\nfunction popupPage() {\n var windowopts = \"location=no,scrollbars=no,menubars=no,toolbars=no,resizable=yes,left= 50,top=50,width=490,height=130\";\n\n popup38625 = open('/prohost/banner.html',\"MenuPopup\",windowopts);\n popup38625.focus();\n<b>}\n</b>\npopupPage();\n\n//  Ad Banner-->\n\n\n\n\n\n\nBonnie and Clyde\nWriters :   David Newman  Robert Benton\nGenres :   Crime  Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:22.809305"}