{"title": "Book of Eli, The", "film_link": "/Movie Scripts/Book of Eli, The Script.html", "script_link": "/scripts/Book-of-Eli,-The.html", "info_raw": "\n\nBook of Eli, The Script\n\n\n\n\nIMSDb opinion  Enjoyable enough, but a little hard to stomach for someone who isn't religious.If you see one post-apocalyptic film this year it should be The Road.\nIMSDb rating   (6 out of 10)\nAverage user rating   (8.31 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Gary Whitta\nGenres  Action  Adventure  Drama  Sci-Fi  Thriller  Western\nScript Date : June 2007\nMovie Release Date : January 2010\n\nRead \"Book of Eli, The\" Script\n\n\n", "script": "\n           \n\n\n          \n          \n                                  THE BOOK OF ELI\n          \n          \n          \n                                    Written by\n          \n                                    Gary Whitta\n          \n          \n          \n          \n          \n                                                          June 21, 2007\n          \n          \n          A civilization is destroyed only when its gods are destroyed.\n                                                          -\n          \n                                                           Emil Cioran\n          \n          EXT. FOREST - DAWN\n          \n          Bare as all hell. The trees stripped of their bark and white\n          like ghosts. Some torn violently from their roots and felled.\n          \n          STARK GRAY SUNLIGHT shafts between the trees, clouded by a\n          creeping fog that obscures the true color of everything. A\n          LIGHT SNOW flutters. The world monochrome, lifeless and cold.\n          \n          A CAT prowls across the dead earth. Barely recognizable as\n          the domestic breed it might once have been. Its fur mangy and\n          rank, body rib-thin from starvation. Entirely feral.\n          \n          It moves slowly, cautiously. Sniffing the air, scanning the\n          forest, alert. Trusting nothing of its surroundings. It paces\n          across a leaf-strewn clearing, closing stealthily on:\n          \n          A DEAD MAN, splayed face-down in the earth. His feet bare.\n          Face frozen in a grim death mask. A GAPING GUNSHOT WOUND in\n          his head, the dried blood caked around it matting his hair.\n          \n          As the cat moves closer, approaching warily:\n          \n          P.O.V. FROM ACROSS THE CLEARING\n          \n          About thirty yards away. Someone is watching. Waiting. SLOW,\n          DEEP BREATHS, heard through a GASMASK RESPIRATOR.\n          \n          CLOSE ON A PAIR OF INDUSTRIAL GOGGLES\n          \n          The MIRRORED LENSES reflecting the forest clearing, locked\n          onto the cat. The slow, metered breathing continues.\n          \n          THE CAT slows, but continues pacing toward the corpse. More\n          cautious than ever. It inches forward, sniffing at the body.\n          \n          ON THE WATCHER. Crouched behind the mangled stump of a felled\n          tree. Concealed beneath a camouflaging mesh of leaves, twigs\n          and bracken. A \"ghillie suit\" of the kind used by snipers.\n          \n          THE CAT sniffs at the dead man's hand, frozen by death in a\n          grotesquely contorted claw. The animal still unsure. Looks\n          around again, checking its surroundings for predators.\n          \n          THE WATCHER moves almost imperceptibly. The leaves covering\n          him rustle ever so slightly as we hear - just barely - the\n          familiar creaking sound of a BOW STRING BEING DRAWN TAUT.\n          \n          THE CAT hears it. Looks up, alert. Staring right at the\n          watcher, but he is too well camouflaged to be seen. An\n          interminable, tense BEAT - is the prey going to flee?\n          \n          Finally, the cat turns its attention back to the carcass,\n          nibbling gingerly at the flesh of the man's fingers.\n          \n                                                                  2.\n          \n          \n          THE WATCHER looses the arrow. It sails across the clearing\n          and SKEWERS THE CAT clean through. It drops to the ground.\n          \n          THE WATCHER STANDS, shaking off the ghillie suit, revealing\n          him to us for the first time.\n          \n          He wears a weather-beaten knee-length duster. Hooded sweater\n          with more layers beneath that. Torn pants and scuffed work\n          boots. Everything filthy and battered from years of wear.\n          \n          Along with the goggles, his face remains obscured by a\n          DISPOSABLE PAPER DUST MASK and a CRUDELY-FASHIONED FUR HAT\n          with dangling ear flaps that may once itself have been a cat.\n          \n          Around his neck he wears a silver SAINT CHRISTOPHER PENDANT\n          hanging from a frayed twine cord.\n          \n          His name is ELI.\n          \n          He shoulders the bow and walks across the clearing. Crouches\n          beside the dead cat and pulls out the arrow. Wipes the blood\n          from the shaft, then reaches down to collect the body.\n          \n          Suddenly the cat SCREECHES AND FLAILS WILDLY! Eli recoils,\n          falling backward, stunned, as the cat - MORTALLY WOUNDED BUT\n          FIGHTING TO THE DEATH - bites and claws desperately at him.\n          \n          Eli struggles violently with the cat, wrestling it to the\n          ground and grabbing up a HUNK OF FALLEN BRANCH. He holds the\n          writhing animal down and CLUBS IT until it lays still.\n          \n          He sits back, breathing harder than the dustmask will allow.\n          He yanks it down, revealing the dirty, unshaven face beneath.\n          Impossible to tell his age, but certainly not a young man.\n          \n          For a moment he just sits there. Then bundles up the dead cat\n          and returns to the mangled tree stump. Folds away his ghillie\n          suit into a nearby RUCKSACK which he hauls up onto his back.\n          \n          A canteen dangles from the backpack, a SHOTGUN strapped to\n          its side. Eli reaches down for his final possession - an old\n          SAMURAI SWORD in a scabbard which he slings across his back.\n          \n          He gazes up at the sky. A snowflake drifts down and lands on\n          his cheek. He reaches up and brushes it away, leaving a BLACK\n          SMEAR on his face. Not snow after all, but some kind of ASH.\n          \n          EXT. FOREST ROAD - DAY\n          \n          Eli emerges from the treeline onto the cracked and ruptured\n          asphalt. Lined by more of those ghostly, stripped-bare trees.\n          \n                                                                    3.\n          \n          \n          He sniffs the air, breathing it in. Checks the road in both\n          directions. Deserted. A few yards away is the rusted, burned-\n          out chassis of a CAR. He heads toward it.\n          \n          The car rests half on the road, half in the adjacent ditch.\n          Stripped of its tires and engine. In the driver's seat is a\n          MUMMIFIED BODY. A BULLET HOLE piercing its forehead.\n          \n          Eli regards the body dispassionately. Tries the door handle\n          but it's jammed. He yanks on it harder and eventually\n          wrenches it open. He leans in and checks the man's feet.\n          \n          They're bare. No shoes or socks. Eli curses under his breath.\n          \n          He leaves the car behind and heads on down the road. As he\n          walks away, we see that the sole of one of his boots has worn\n          loose, held in place now only by a rubber band.\n          \n          EXT. ROAD - DAY\n          \n          Eli continues down the road. He ambles along slowly, a man in\n          no hurry. A man who has been walking a long time.\n          \n          The road has since emerged from the forest. Passing now\n          through a wasteland of dead scrub brush and urban junk.\n          \n          The sun beats down from directly overhead. The sky has no\n          color to it, paper-white. The unfiltered sun's stark light\n          leaves everything seeming bleached-out, over-exposed.\n          \n          CRANE UP as Eli walks on. On the horizon is the silhouette of\n          a CITY. Or what was once a city. Columns of BLACK SMOKE rise\n          from within, casting a deathly pall over the skyline. BURNED\n          AND BROKEN SKYSCRAPERS jut out like tombstones.\n          \n          Eli reaches a fork in the road and stops. The road he's on\n          appears to wind off in the direction of the ruined city on\n          the horizon. The other fork continues on into the wasteland.\n          \n          After a brief pause, Eli changes direction and heads off down\n          the other fork, away from the city.\n          \n          EXT. ABANDONED TOWN - DAY\n          \n          Little more than a main street lined with storefronts. Eli\n          walks steadily along, side-stepping rubble and debris.\n          Ignoring the petrified corpses lying in the street.\n          \n          He passes by abandoned stores, every one picked clean. Empty\n          shelves, smashed windows. Looted and burned. He doesn't even\n          look inside, knowing already that he will find nothing.\n          \n          Until he comes to a store that does cause him to stop. An old-\n          fashioned sign squeaks on rusted hinges in the breeze.\n          \n                                                                    4.\n          \n          \n                    ED'S SHOES - GENTLEMEN'S AND LADIES' FOOTWEAR\n          \n          He steps into the doorway and pushes open the door. It swings\n          open on its one remaining hinge before splintering away from\n          the frame and crashing to the floor in a cloud of dust.\n          \n          INT. SHOE STORE - CONTINUOUS\n          \n          Eli steps inside. Like all the others, the store has been\n          cleaned out. Shoe racks and empty boxes strewn over the\n          floor. The whole place reeking of dead, musty air.\n          \n          Eli looks around, just to be sure. Drags his sheathed sword\n          idly along the empty racks as he checks them. Nothing.\n          \n          As he turns back for the door, his foot nudges against a shoe\n          box. It's not empty. He crouches down, flips the lid off\n          hopefully... and pulls out a LADY'S HIGH-HEELED SHOE.\n          \n          He strokes the shoe leather with his hand. Shakes his head\n          grimly, then tosses the shoe back into the box and leaves.\n          \n          EXT. ABANDONED HOUSE - DAY\n          \n          On the outskirts of town. In disrepair - peeling paint,\n          broken windows, damp-stained walls - but habitable.\n          \n          Eli stands in the front yard, surrounded by brownish,\n          overgrown weeds. Thinking it over. Turns to face the setting\n          sun. It will be dark soon. He turns back toward the house.\n          \n          INT. ABANDONED HOUSE - DAY\n          \n          The front door is sent CRASHING OPEN with a hard kick,\n          revealing Eli silhouetted in the fading sunlight. The shotgun\n          unhitched from his pack and held ready. He moves inside.\n          \n          Another dead place. Flies buzzing in the still, dank air.\n          Everything covered in a thick layer of dust but otherwise\n          largely preserved. An eerie snapshot of a world long gone.\n          \n          KITCHEN\n          \n          Every cupboard empty. Eli checks each one, poking around in\n          the dark corners with his sword, but finds nothing but dust.\n          \n          He opens the freezer, checks inside. Empty save for a small\n          ICEBOX. The lid stuck fast with mildew and gunk. Eli digs at\n          it with his grimy fingernails and manages to pry it open.\n          \n          Inside are the wizened, petrified remains of a HUMAN HAND.\n          Floating in slimy, discolored water. The smell vile and thick\n          enough to make Eli retch. He quickly jams the lid back on.\n          \n                                                                  5.\n          \n          \n          BEDROOM\n          \n          A wooden bedframe stripped clean. The dresser drawers have\n          been emptied and lie strewn across the floor. Eli moves\n          toward a large walk-in closet and opens the door.\n          \n          No clothes inside - just the near-fossilized corpse of a MAN\n          HANGING BY A NOOSE. Twisting gently back and forth.\n          \n          Unfazed, Eli crouches down and checks the man's feet. An old\n          pair of Converse All-Stars hang limp from the man's skeletal\n          ankles. Eli calmly sets about unlacing them.\n          \n          He checks the size; they're a fit. He upturns each shoe and\n          shakes the old flakes of mummified flesh from them. Discards\n          his ruined boots and puts on the sneakers, laces them up.\n          \n          He walks around, pacing up and down, getting a feel for the\n          new shoes. They feel good. For the first time, he smiles.\n          \n          LATER\n          \n          Eli sits in the corner, roasting the carcass of the dead cat\n          over a small CAMPFIRE. He cleans the animal's pelts as he\n          watches it cook. Pokes at the meat with a pen-knife, checking\n          it for done-ness. It appears ready to eat.\n          \n          He clasps his hands together in prayer.\n          \n                              ELI\n                    Dear Lord, thank you for your\n                    generosity in providing us today\n                    with this bountiful feast.\n          \n          He speaks QUIETLY, his voice barely above a whisper. Even so,\n          we catch the accent - a RASPY, OLD-WORLD MIDWEST DRAWL, like\n          John Wayne or some other long-forgotten western icon.\n          \n                              ELI\n                    Thank you for the many gifts that\n                    you have given me. Thank you for\n                    your protection and your guidance.\n                    Thank you for bringing me this far.\n                    I know my long journey's end is\n                    near. I ask now only for the\n                    strength and the courage to\n                    complete the task that you in your\n                    infinite wisdom saw fit to bestow\n                    upon me over all men. I won't let\n                    you down. Amen.\n          \n          He signs a cross over himself, then uses the knife to saw off\n          a chunk of meat. Takes a bite, savoring the taste with great\n          relish. To him, it's grade-A filet mignon.\n          \n                                                                  6.\n          \n          \n                              ELI\n                    Hey. You hungry?\n          \n          It appears as though he is talking to himself... until a RAT\n          emerges from his coat pocket, whiskers twitching keenly. Eli\n          offers it some meat. The rat gnaws enthusiastically at it.\n          \n          SUNDOWN\n          \n          The last of the waning sunlight shafts through the bedroom's\n          broken window. Eli rummages through his backpack, pulls out a\n          SMALL PACKAGE wrapped in cloth and tied fast with string.\n          \n          He sits back in his corner and carefully unwraps it. It's an\n          OLD LEATHER-BOUND BOOK. The binding cracked and pages dog-\n          eared, thumbed through a thousand times and more.\n          \n          Eli gazes lovingly at it. Lets his fingers play across the\n          beat-up old leather cover. A cherished thing.\n          \n          He begins to read, half-hidden in the shadows of the fading\n          sunlight. Silently mouthing the words as he reads them.\n          \n          MANY PAGES LATER\n          \n          Eli closes the book and parcels it back up as before.\n          Replaces it in his pack, then reaches in for something else.\n          \n          A CAR BATTERY. Old and streaked with acid stains. Attached to\n          a tangled bunch of ELECTRICAL WIRING and JUMPER CABLES. Eli\n          reaches into his pocket and produces:\n          \n          AN IPOD. Badly beat-up, the case pretty much held together\n          with duct tape. But functional. Eli attaches the battery\n          cable to the iPod and places the headphones in his ears.\n          \n          The music plays. Mozart's Piano Concerto No. 20 in D Minor.\n          Eli rests back against the wall and pushes the volume way up.\n          \n          THE MUSIC SWELLS. Eli's fingers dance and swoop in the air,\n          as though conducting an orchestra, as he is transported by\n          the music to another world, a world far from this one.\n          \n          MORNING\n          \n          Sunlight shafts through the window. Eli sits slumped in the\n          exact same position, headphones still in his ears. Asleep.\n          \n          The rat scurries up Eli's chest and licks his face. Slowly,\n          he wakes, realizing he fell asleep with his music still on.\n          Checks the battery. It's dead, drained overnight. He frowns.\n          \n          He gets to his feet, moves to the window and checks outside.\n          All seems quiet. He loads up his backpack and weapons.\n          \n                                                                  7.\n          \n          \n                              ELI\n                    Come on now.\n          \n          The rat scurries up his leg, onto his duster and disappears\n          into the breast pocket. Eli turns and moves out.\n          \n          EXT. ABANDONED HOUSE - MORNING\n          \n          The gate squeaks shut behind Eli as he exits the front yard.\n          \n          He breathes in the air, turns to feel the warm morning sun on\n          his face. Then turns away from it and walks on down the road.\n          \n          EXT. ROAD - DAY\n          \n          The landscape barren and featureless, road lined with dead\n          trees. Eli walks along the warped and broken asphalt.\n          \n          The road is strewn with burned-out cars and debris from a\n          world long dead. A warped metal sign by the side of the road\n          reads: LITTER REMOVAL NEXT TWO MILES BY: \"CIRCUIT CITY\".\n          \n          Up ahead is a HUNCHED FIGURE by the side of the road. Eli\n          arrives to see that it's a YOUNG WOMAN. Bone-thin, dressed in\n          filthy rags. Skin plagued by an unpleasant rash.\n          \n          The SHOPPING CART she was pushing has overturned into a\n          roadside ditch, spilling its contents. Blankets, tins of\n          food, old clothes. She's on her knees trying to gather it up.\n          \n          She looks up as she sees Eli approaching. Instantly cowers\n          from him, raising her hands to protect herself. Terrified.\n          \n                              YOUNG WOMAN\n                    Oh. Please don't hurt me. Here,\n                    take anything you want. You want\n                    some food? Take it.\n          \n          She offers him a can of pet food with a trembling hand. Eli\n          stands there looking at her. His expression impossible to\n          read behind the mirrored goggles.\n          \n                              ELI\n                    I'm not going to hurt you.\n          \n                              YOUNG WOMAN\n                    That's what the last guys said.\n          \n          Eli bends down and picks up a couple of the cart's spilled\n          contents. Steps forward and offers them to her.\n          \n                              ELI\n                    Here.\n          \n                                                                    8.\n          \n          \n          She blinks. Unsure. Cautiously she reaches out and takes it.\n          \n                              YOUNG WOMAN\n                    Could you help me? The wheel came\n                    off. I can't fix it. Maybe if I\n                    could get it out of the ditch. But\n                    I can't.\n          \n          Eli looks at the cart. It has come to rest in the ditch just\n          inches from a THICK BRACKEN HEDGEROW that lines the road.\n          \n          He looks again at the girl. Her faded blouse is unbuttoned,\n          revealing a little cleavage. Her skirt torn along the leg,\n          showing more than a little thigh. Almost deliberate.\n          \n          He sniffs the air. Watches the hedgerow warily. Just like the\n          cat he hunted, his senses heightened and on alert.\n          \n          Behind the hedge, THREE ROADSIDE BANDITS are crouched,\n          waiting to pounce. Each armed with a crude blunt weapon. They\n          exchange anxious looks.\n          \n          ELI sniffs the air again - then backs away from the girl.\n          \n                              ELI\n                    One good thing about no soap any\n                    more. You can smell the road agents\n                    a mile off.\n          \n          The girl's face falls as Eli backs up. The three bandits\n          EMERGE FROM THE HEDGEROW, brandishing their weapons. A couple\n          of them wear old sunglasses and goggles similar to Eli's.\n          \n          The BANDIT LEADER grabs the girl by a fistful of hair as he\n          passes, yanking her painfully to her feet.\n          \n                              BANDIT LEADER\n                    Dumb bitch. What did we tell you?\n          \n          He pushes her away, she crumples to the road in a heap.\n          \n          Eli backs away, but TWO MORE ARMED BANDITS drop from hiding\n          in the trees behind, cutting off his escape, surrounding him.\n          \n                              BANDIT LEADER\n                    What you got there in the pack?\n          \n                               ELI\n                    Nothing.\n          \n                              BANDIT LEADER\n                    Yeah, that's what they all say. How\n                    about you take it off real slow and\n                    tip it out so's we can take a look?\n          \n                                                                  9.\n          \n          \n          BANDIT #2 notices the shotgun strapped to the pack.\n          \n                              BANDIT #2\n                    He's got a gun.\n          \n                               BANDIT LEADER\n                    Shit, it ain't loaded. They never\n                    are. Ain't that right, old man?\n                        (BEAT)\n                    Open the fucking pack or die.\n          \n                              ELI\n                    I can't do that.\n          \n          The bandit leader steps forward aggressively. Now within\n          striking distance of Eli. He grins, teeth filthy and rotten.\n          \n                              BANDIT LEADER\n                    Want us to do it for you? We can\n                    get it off real easy after we've\n                    hacked your fucking arms off.\n          \n          Eli remains perfectly calm. And though he speaks with a soft,\n          even tone, there is something formidable about his voice.\n          \n                              ELI\n                    It's real important you boys listen\n                    to me and understand. The man I\n                    work for, you do not want to cross\n                    him. See, I'm under his protection.\n                    You stand in my way, you stand in\n                    his. And he will cut you down with\n                    a righteous fury - through me. For\n                    I am his faithful instrument.\n          \n          BEAT. The bandit leader looks at Eli incredulously... and\n          then LAUGHS. The other bandits laugh along nervously.\n          \n                              BANDIT LEADER\n                    What the hell are you, some kinda\n                    preacher?\n          \n                              ELI\n                    Something like that.\n          \n                              BANDIT LEADER\n                    Well I got news for you, preacher\n                    man. Whatever kinda God you reckon\n                    yourself to be working for, he left\n                    these parts a long time ago. He\n                    ain't here to protect your ass. Now\n                    take off the pack and set it on the\n                    ground.\n          \n                                                                 10.\n          \n          \n          Eli doesn't move, doesn't say a word. The bandit leader takes\n          another step forward and shoves him in the shoulder.\n          \n                              BANDIT LEADER\n                    You fucking listening to me?\n          \n                              ELI\n                    I hear you. You lay that hand on me\n                    again and you will not get it back.\n          \n          The other bandits exchange nervous looks. This is not how\n          it's supposed to go.\n          \n                              BANDIT LEADER\n                    All right, I had just about enough\n                    of this shit...\n          \n          He lunges forward, grabs the shoulder strap of Eli's pack.\n          \n          If you blinked, you missed it. But somehow Eli has now drawn\n          his sword. A RIVULET OF BLOOD snakes down along the blade and\n          drips onto the asphalt.\n          \n          Bandit leader's hand is still gripped firmly around Eli's\n          shoulder strap. But it's no longer connected to his arm. The\n          SEVERED HAND hangs there from the strap, dripping blood.\n          \n          Bandit leader staggers backward and raises the bloody stump\n          where his hand once was. Looks at it in shock and horror.\n          \n                              BANDIT LEADER\n                    What... you just... he just cut my\n                    fucking hand off! My fucking hand!\n          \n          Eli pries the hand loose from the strap and tosses it onto\n          the road as bandit leader's legs give out and he slumps to\n          the asphalt. His eyes dart around, as though confused.\n          \n                              BANDIT LEADER\n                    What you standin' around for? Kiss\n                    him!\n          \n                              BANDIT #3\n                    What's he talkin' about, kiss him?\n          \n                              ELI\n                    He's in shock. He means \"kill him\".\n          \n          A tense BEAT. And then the four remaining bandits ATTACK ELI\n          ALL AT ONCE, weapons flailing.\n          \n          Eli flourishes the sword. A BLUR, TOO FAST TO FOLLOW. But\n          it's clear he is possessed of an inhuman level of skill.\n          \n                                                                    11.\n          \n          \n          It is over in moments. The four bandits LAY SLAIN IN THE\n          ROAD, blood pooling out onto the asphalt.\n          \n          The bandit leader crawls toward his severed hand, a few yards\n          away. Eli steps in and kicks it out of his reach.\n          \n                               ELI\n                    I told you you wouldn't be getting\n                    that back.\n          \n          Bandit leader looks up to see the figure of Eli bearing down\n          on him, silhouetted ominously against the sun. He looks for a\n          moment like an avenging angel, something not of this world.\n          \n                              BANDIT LEADER\n                    Who are you?\n          \n                              ELI\n                    My name is Eli.\n          \n          And with that, Eli runs him through with his sword.\n          \n          He turns to see the young woman slumped in the road, sobbing.\n          She cowers again as he approaches, certain that she is next.\n          \n          He WALKS PAST HER. Sheathes his sword, then pulls out the\n          shopping cart from the ditch and rights it. The woman watches\n          incredulously as he gathers up her supplies into the cart.\n          \n                              ELI\n                    Take it and go on your way. And\n                    don't fall in with men like these\n                    again. No good can come.\n          \n          She looks at him, puzzled.\n          \n                              YOUNG WOMAN\n                    Why are you doing this?\n          \n          Eli says nothing. Walks back to the slain bandits, crouches\n          beside them and begins searching their bodies.\n          \n          He takes a scarf from around the neck of one. Finds a Zippo\n          lighter on another, checks that it works and pockets it.\n          \n          LATER\n          \n          The five bodies are lined neatly in the ditch, half-covered\n          with dirt. The best burial they are going to get.\n          \n          Eli stands before them, head bowed in prayer. He speaks\n          quietly and quickly, a speech he has given many times.\n          \n                                                                   12.\n          \n          \n                              ELI\n                    God, the father of mercies, through\n                    the death and resurrection of his\n                    son has reconciled the world to\n                    himself and sent the holy spirit\n                    among us for the forgiveness of\n                    sins.\n          \n          The young woman stands a few yards away, watching him,\n          transfixed. She has never seen anyone like him.\n          \n                              ELI\n                    Through the ministry of the church\n                    may he give you pardon and peace,\n                    and I absolve you from your sins in\n                    the name of the father, and of the\n                    son, and of the holy spirit. Amen.\n          \n          He turns and walks away down the road, passing the woman.\n          \n                              YOUNG WOMAN\n                    Thank you. You're... a good man.\n          \n                              ELI\n                    There are no good men on the road.\n          \n                              YOUNG WOMAN\n                    Where are you going?\n          \n                              ELI\n                    West.\n          \n                              YOUNG WOMAN\n                    Can... can I come with you?\n          \n          He doesn't even turn back to look at her.\n          \n                              ELI\n                    No.\n          \n          He walks on, into the horizon.\n          \n          EXT. FREEWAY OVERPASS - DAY\n          \n          Straddling the desert like a giant, crumbling monument to a\n          long-dead civilization. Eli steadily climbs his way up.\n          \n          He comes to an abrupt stop as we realize suddenly that the\n          overpass has COLLAPSED at mid-point. RUSTED IRON RODS jut out\n          from where the roadway has been severed.\n          \n          Eli just stands there at the edge for a moment, feeling the\n          wind whip around him, his coat fluttering in the breeze.\n          \n                                                                 13.\n          \n          \n          The overpass's collapsed section is now just a MOUNTAINOUS\n          PILE OF RUBBLE that leads down to the road below.\n          \n          Eli steps onto the rubble. About to make his way down when he\n          FREEZES. He hears something. The faintest of sounds. He takes\n          cover, peering down at the road beneath the overpass to see:\n          \n          TWO PEOPLE walking together on the road. We see everything\n          from ELI'S P.O.V. - too far to make out much detail, but\n          apparently it is a MIDDLE-AGED COUPLE.\n          \n          The man pushes along an OLD WHEELBARROW covered by a tarp as\n          the woman, seemingly his wife, walks alongside. The barrow's\n          rusted wheel gives out a plaintive, rhythmic SQUEAK.\n          \n          Eli ducks down again as he hears something else. This time\n          much louder. The menacing growl of MOTORCYCLE ENGINES.\n          \n          FOUR BIKES IN TOTAL. Riding out of the horizon, closing in on\n          the couple. They see the bikes coming and panic. Try\n          desperately to steer the barrow off the road.\n          \n          The bikes screech to a halt and the FOUR RIDERS dismount.\n          Brandishing a variety of weapons. The couple make a run for\n          it but they're quickly chased down and tackled to the ground.\n          \n          The woman SCREAMS and struggles helplessly as the bikers\n          swarm over the man like a pack of predatory animals.\n          \n          The woman is pulled to the ground and the clothes stripped\n          from her. Eli turns away. He knows what comes next.\n          \n          Eli listens as the woman screams and screams. He reaches for\n          his shotgun... hesitates... then withdraws his hand.\n          \n                              ELI\n                    It ain't your concern. Stay on the\n                    path. It ain't your concern. Stay\n                    on the path.\n          \n          Eli repeats it like a mantra. He clearly wants to intervene,\n          but will not permit himself to. Instead, he simply sits and\n          waits grimly as the woman continues to scream for help. And\n          then finally, suddenly, is silenced.\n          \n          Down below, the bodies of the man and woman lay dead and\n          bloodied in the dirt. The bikers tear the tarp from the\n          wheelbarrow, spilling its contents onto the asphalt.\n          \n          They ferret through the items, scavenging a few items - we\n          don't see what - and stuffing them into an old cloth satchel.\n          They leave the rest strewn in the road and ride off in the\n          direction they came, dust pluming in their wake.\n          \n                                                                 14.\n          \n          \n          Eli waits until the sound of the motorcycles has receded into\n          the far distance before emerging from his hiding place.\n          \n          EXT. ROAD BENEATH OVERPASS - DAY\n          \n          Eli crouches on one knee before the murdered couple. He signs\n          a cross over their ravaged bodies as he mutters a prayer\n          under his breath. Then stands and continues on down the road.\n          \n          EXT. ROAD FORK - DAY\n          \n          More desolate wasteland as far as the eye can see. The road\n          forks again here. Eli arrives at the junction and stops.\n          \n          The road Eli is on leads further into the west. The other\n          fork heads toward a SMALL TOWN just visible on the horizon.\n          \n          A HAND-PAINTED SIGN has been driven into the dirt nearby. No\n          words, just a series of CRUDE PICTOGRAMS. A BED. A PLATE OF\n          FOOD. A WATER FAUCET. AN ARROW points toward the town.\n          \n          Eli pauses, thinking it over. Retrieves the iPod from his\n          pocket. Clicks the button, but no response. He sighs.\n          \n          He turns and heads down the other fork, toward town.\n          \n          EXT. DESERT TOWN - OUTSKIRTS - DAY\n          \n          A primitive, sprawling village of tents and barn-like\n          structures. Built from corrugated iron, rotted wood, molded\n          plastic, tarpaulin - materials scavenged from the old world.\n          \n          HUDDLED RESIDENTS are dressed in little more than rags, many\n          wearing goggles like Eli's to shield their eyes from the sun.\n          \n          Eli stands at the edge of town. Reluctant to enter, but he\n          braces himself and walks on in. And as he rounds a corner,\n          entering the center of town, an astonishing sight:\n          \n          EXT. DESERT TOWN - MAIN STREET - CONTINUOUS\n          \n          The broad thoroughfare now all that remains of whatever town\n          once stood here. Many of the old storefronts still largely\n          intact but patched up with salvaged materials. The asphalt\n          street warped and cracked, parking meters bent and smashed.\n          \n          It's a lot like the abandoned town Eli passed through\n          earlier, except VERY MUCH ALIVE - BUSTLING WITH TOWNSFOLK.\n          \n          It's at once a familiar and also a disturbing sight - like an\n          old Norman Rockwell painting of classic small-town America,\n          but filtered through the devastating eye of an apocalypse. An\n          unsettling juxtaposition of the old world and the new.\n          \n                                                                 15.\n          \n          \n          The centerpiece of the town is a GRAND THEATER at the head of\n          the main street. THE PALLADIUM. Like the rest of the town,\n          badly damaged and shoddily fixed-up. But still standing.\n          \n          Eli walks down the street and approaches a BLACKSMITH,\n          hammering out a metal plate over an anvil outside his store.\n          \n                              ELI\n                    You got an engineer or a fuelman\n                    around here?\n          \n          The blacksmith doesn't look up from his work but motions\n          toward a storefront at the far end of the street.\n          \n                              ELI\n                    Thanks.\n          \n          Eli heads down the street. Stopping when he comes across a\n          STATUE erected in the center of the road. A TALL MAN crudely\n          fashioned in clay. One hand placed paternally on the head of\n          a SMALL CHILD, the other outstretched toward the sun.\n          \n          As he observes the statue, Eli notices that passing residents\n          take a moment to PAUSE AND GENUFLECT before it. Worshipping.\n          \n          Curious, Eli reaches up and runs his hand over the statue's\n          face. Then hears SHUFFLING FEET behind him and turns as a\n          PARADE OF EMACIATED MEN AND WOMEN trudges past. Roped\n          together at the waist, each man leading the one behind.\n          \n          Heads shaved, thin from malnutrition. And each one BLIND.\n          They gaze at the ground with pale, dead eyes. They carry\n          picks, shovels and other tools - a sightless CHAIN GANG.\n          \n          Eli watches as the pathetic parade shuffles past, herded like\n          cattle by a brutish CHAIN GANG BOSS who swats at them with a\n          stick to keep them moving and indicate direction.\n          \n                              CHAIN GANG BOSS\n                    Come on, move it!\n          \n          The gang boss glares at Eli as he passes by. Eli doesn't\n          return the look, just continues crossing the street as the\n          blind are herded away. Headed toward a wooden building with a\n          pictogram of a LIGHTNING BOLT suspended above the door.\n          \n          INT. ENGINEER WORKSHOP - CONTINUOUS\n          \n          Whatever this place once was, it's now a kind of POST-\n          APOCALYPTIC RADIO SHACK. Shelves display a variety of goods.\n          Engine parts. Old electrical wiring. Small appliances.\n          \n          An old ELECTRIC GENERATOR rumbles noisily, powering strings\n          of multi-colored CHRISTMAS LIGHTS that hang all around.\n          \n                                                                  16.\n          \n          \n          Behind the main counter a convoluted Rube Goldberg-esque\n          STILL is running. An ENGINEER in a leather apron pours the\n          remnants of a can of motor oil into the still's funnel.\n          \n          Attached to the still is an old MOTORCYCLE MIRROR. In its\n          reflection the engineer sees Eli checking out the store.\n          \n          Without turning around, he reaches surreptitiously behind the\n          counter for something.\n          \n          Eli turns toward the counter - to find the engineer training\n          a PUMP-ACTION SHOTGUN right at him.\n          \n                              ENGINEER\n                    I don't know you.\n          \n          Eli slowly raises his hands.\n          \n                              ELI\n                    I'm not from around here.\n          \n                              ENGINEER\n                    No shit. Who are you?\n          \n                              ELI\n                    I'm just a customer.\n          \n                              ENGINEER\n                    A customer with a shotgun?\n          \n          He nods toward the shotgun visible on Eli's backpack.\n          \n                              ENGINEER\n                    You come in here to rip me off?\n          \n          The engineer's hands tremble, his finger tight on the\n          trigger. This man needs to be talked down carefully.\n          \n                              ELI\n                    No. I'll set it down. Okay?\n          \n                              ENGINEER\n                    Slowly!\n          \n          Eli nods. Unhitches the pack and sets it down, steps away.\n          \n                              ENGINEER\n                    You carry a gun in the outland, you\n                    don't bring one into town less you\n                    live there. Don't you know that?\n          \n                              ELI\n                    I'm sorry, I forgot. I've been on\n                    the road a long time.\n          \n                                                                    17.\n          \n          \n          This seems to make the engineer more suspicious of Eli.\n          \n                              ENGINEER\n                    Show me your hand.\n          \n                                 ELI\n                    I'm not a-\n          \n          The engineer jerks the shotgun at Eli nervously.\n          \n                              ENGINEER\n                    I said show me your fucking hand!\n          \n          Eli raises his hand and holds it outstretched, palm faced\n          downward. The engineer watches it closely for any sign of\n          ticks or tremors, but Eli's hand stays steady as a rock.\n          \n                              ELI\n                    I'm not one of them.\n          \n          The sight of the steady hand seems to reassure the engineer a\n          little. Finally, he lowers the shotgun.\n          \n                              ENGINEER\n                    What do you want?\n          \n                              ELI\n                    I'm just passing through. I need\n                    some help. I can pay.\n          \n                              ENGINEER\n                    What kinda help? And what kinda\n                    pay?\n          \n                              ELI\n                    I'm going to get something out of\n                    my pack. Okay?\n          \n          The engineer raises the shotgun nervously again.\n          \n                              ELI\n                    I know, I know. Slowly.\n          \n          The engineer watches him like a hawk as Eli opens up his pack\n          and pulls out the car battery. When he sees it, he gasps.\n          \n                                 ENGINEER\n                    Holy shit.\n          \n          Eli places it on the counter. The engineer looks it over with\n          awe, like it's a priceless historical artifact.\n          \n                              ENGINEER\n                    Where'd you find this?\n          \n                                                                 18.\n          \n          \n                              ELI\n                    Years ago, in the outland back east\n                    aways.\n          \n                              ENGINEER\n                    Does it work?\n          \n                              ELI\n                    Yeah, it just needs a charge. Can\n                    you do it? I got the cables.\n          \n                              ENGINEER\n                    Depends if you also got the coin.\n          \n          Eli pulls the Zippo lighter from his pocket. The engineer\n          picks it up, sparks the flint, watches the flame flicker.\n          \n                              ENGINEER\n                    It'll take a couple hours. There's\n                    a bar across the street you can\n                    wait, they just opened up.\n          \n                              ELI\n                    I'll wait here.\n          \n                              ENGINEER\n                    You don't trust me?\n          \n                              ELI\n                        (SMILES)\n                    I don't know you.\n          \n          INT. PALLADIUM - AUDITORIUM - DAY\n          \n          This once grand theater have been largely gutted - seats torn\n          out, fixtures and fittings stripped, curtains ripped from the\n          stage. But still, there's a sense of grandeur to this place.\n          \n          Looking out over the stage, a ROYAL BOX - once the most\n          prestigious seat in the house - has been converted into an\n          OFFICE of sorts. Seats removed and replaced by an ORNATE\n          MAHOGANY DESK facing inward, a CHANDELIER suspended above it.\n          \n          The whole set-up is gaudy and ostentatious - the work of\n          someone who wants to project an aura of power and wealth, but\n          has no taste whatsoever.\n          \n          A TALL MAN is seated in a battered leather armchair behind\n          the desk, deeply involved in an OLD PAPERBACK BOOK.\n          \n          The book's cover is faded and partially torn away, the title\n          still just visible: 7 HABITS OF HIGHLY EFFECTIVE PEOPLE.\n          \n                                                                   19.\n          \n          \n          The man is OLDER than most we've seen. His skin weathered by\n          the elements and by a long life's experience. One of the very\n          few people we've seen in this world close to Eli's age - and\n          unlike everyone else we've seen, he appears healthy and well-\n          groomed. A rich mane of hair, full set of teeth.\n          \n          He wears a tattered SUIT AND TIE. None of it matches,\n          everything scavenged from different outfits and eras. But he\n          looks almost civilized. Respectable. His name is CARNEGIE.\n          \n          He looks up from his book at the sound of a POLITE COUGH O.S.\n          \n          REDRIDGE stands before him. Tall, powerfully built.\n          \n                              CARNEGIE\n                    What is it?\n          \n          His accent is like caramel. A RICH, DEEP-SOUTH DRAWL.\n          \n                              REDRIDGE\n                    Survey team just finished up their\n                    inspection. It ain't good.\n          \n          Carnegie lowers his book. Concerned.\n          \n                              CARNEGIE\n                    How bad is it?\n          \n                              REDRIDGE\n                    Pressure is down again, and going\n                    by the new rod they sank levels're\n                    lower than they've ever been.\n          \n          Carnegie stands. Thinking. This is bad news.\n          \n                                CARNEGIE\n                    How long?\n          \n                              REDRIDGE\n                    Hard to say. Six months, maybe. A\n                    little longer if we're careful. But\n                    we're already-\n          \n                              CARNEGIE\n                    Halve the rations.\n          \n                              REDRIDGE\n                    We just halved `em last-\n          \n                              CARNEGIE\n                    So halve them again!\n          \n          BEAT. Carnegie stares Redridge down. Nobody but nobody\n          questions his orders.\n          \n                                                                 20.\n          \n          \n                              REDRIDGE\n                    You're going to have to say\n                    something. Folks were none too\n                    happy last time. Gonna be worse\n                    now, you can count on it.\n          \n          Carnegie sighs, rubs his brow. He knows Redridge is right.\n          \n          EXT. DESERT TOWN - MAIN STREET - DAY\n          \n          A LARGE CROWD OF TOWNSFOLK - several hundred strong - has\n          assembled outside the Palladium theater. AN ARMED CREW OF\n          CARNEGIE'S GOONS keeps watch over the crowd.\n          \n          Carnegie stands on a BALCONY above the theater marquee. He\n          treats the balcony like a pulpit, speaking through a\n          MICROPHONE connected to an old PA SYSTEM that carries his\n          words to the far reaches of the crowd.\n          \n                              CARNEGIE\n                    I want you all to remember how far\n                    we've come together. And how far we\n                    still can go, if only we believe.\n                    When I brought us here to this\n                    oasis - this promised land - we\n                    knew there would be hardships. Knew\n                    there would be sacrifices. But we\n                    also knew that we were creating for\n                    ourselves a world where we could be\n                    safe from the horrors of the\n                    forsaken lands beyond our borders.\n          \n          The crowd listens intently, hanging on Carnegie's every word.\n          He is an incredibly charismatic and persuasive speaker - his\n          cultivated image and inspiring, confident delivery remind us\n          of a TELEVISION EVANGELIST.\n          \n                              CARNEGIE\n                    And I want you all to remember\n                    above all that it is not the water\n                    with which we have been blessed\n                    that is the true lifeblood of this\n                    town... but faith.\n          \n          This sends a MURMUR OF DISCONTENT through the crowd. Many\n          don't like where they suspect this may be going. Carnegie\n          senses this and dials up his rhetoric - delivering it now\n          with the fire-brand passion of an old-time baptist preacher.\n          \n                              CARNEGIE\n                    It is our faith that sustains us,\n                    brothers and sisters! Hallelujah!\n          \n                                                                 21.\n          \n          \n          The crowd is divided. Many return the \"Hallelujah\" with\n          varying levels of conviction. Others are not convinced. But\n          Carnegie continues unabated, selling it harder than ever.\n          \n                              CARNEGIE\n                    And mark me, the ultimate\n                    validation of that faith is coming!\n                    The sacred Word of Our Lord that\n                    formed the world before and will\n                    reform it once again is coming to\n                    this town to bring it succor, bring\n                    it nourishment, bring it new life!\n                    For the Almighty Himself has spoken\n                    unto me and promised it!\n          \n          Carnegie is such an impassioned and inspiring speaker it's\n          almost impossible not to get caught up and swept away by his\n          words. His apparently unshakable belief is infectious.\n          \n                               CARNEGIE\n                    In the meantime, He has asked us\n                    all to be patient. To walk the hard\n                    road of the faithful just a little\n                    longer. And to do that, we must\n                    give just a little more.\n                        (BEAT)\n                    Water rations will be halved until\n                    further notice.\n          \n          This sends a much broader ripple of discontent through the\n          crowd - this news has not been received well at all. Some\n          still \"keep the faith\" but many more are perturbed by this.\n          \n          Carnegie motions for the crowd to settle down.\n          \n                              CARNEGIE\n                    I understand your frustration. The\n                    road to salvation is a difficult\n                    one - but what lies at the end of\n                    that road is a greater glory,\n                    beyond anything you can imagine.\n          \n          A DISCONTENTED VILLAGER steps forward, pushing through the\n          crowd and jabbing his finger angrily up at Carnegie.\n          \n                              DISCONTENTED VILLAGER\n                    We've heard this all before! When\n                    are you going to-\n          \n          Carnegie's goons quickly move in and efficiently SILENCE THE\n          MAN, removing him from the crowd. Dissent is not tolerated\n          here. Carnegie goes on speaking as if nothing had happened.\n          \n                                                                 22.\n          \n          \n                               CARNEGIE\n                    I know each and every one of you\n                    will understand the necessity of\n                    this action. It was faith that\n                    built this town - and faith that\n                    will sustain it even through the\n                    dark times that may lie ahead. But\n                    it is always darkest before dawn -\n                    and the new dawn is coming.\n                        (BEAT)\n                    May God go with you all.\n          \n          Carnegie steps back inside, leaving the crowd to talk among\n          themselves, clearly mixed about what they have heard.\n          \n          As the assembled townsfolk disperse, FOUR MOTORCYCLES roar\n          into town and pull up outside the Palladium.\n          \n          As the riders dismount, one detaches a CLOTH SATCHEL from his\n          bike's cargo rack. The four riders head inside. They each\n          have long, straggly hair and brutish expressions.\n          \n          We recognize them now as the BIKER BANDITS who killed the\n          couple on the road under the freeway overpass.\n          \n          INT. PALLADIUM - SECOND FLOOR - DAY\n          \n          Carnegie emerges into the second-floor hallway from the\n          balcony, mopping his brow. Exhausted and stressed from his\n          grand theatrical display, and from its mixed reception.\n          \n          Redridge climbs the stairs to meet him.\n          \n                               REDRIDGE\n                    One of the road crews just rolled\n                    into town.\n          \n          Carnegie looks at his cracked old wristwatch.\n          \n                              CARNEGIE\n                    Of course they did, the bar's open.\n                    Outlanders, always looking for\n                    answers at the bottom of a bottle.\n          \n                               REDRIDGE\n                    Not these guys.\n                        (BEAT)\n                    These guys say they got something.\n          \n          That gets Carnegie's attention.\n          \n                              CARNEGIE\n                    Get them up here now.\n          \n                                                                 23.\n          \n          \n          INT. PALLADIUM - MAIN LOBBY - DAY\n          \n          What was once a grand, gilded entrance foyer has, like the\n          rest of the theater, been largely gutted. But it's still\n          impressive - a spacious bar area with a grand staircase\n          leading up to a second floor, entrance to balcony seats, etc.\n          FADED OLD THEATER POSTERS still hang from the walls.\n          \n          The place has been shabbily converted into a kind of SALOON.\n          Old ripped-out theater seats arranged around tables. A\n          FIREPLACE sputters dimly.\n          \n          A MANGY TABBY CAT walks across the straw-laden floor. A dozen\n          or so CUSTOMERS in the place, a mixed, rough-looking bunch.\n          \n          Redridge emerges from an upstairs room and nods to a group of\n          his MEN who are holding the bikers at the foot of the stairs.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          Carnegie checks his reflection in a CRACKED HAND MIRROR,\n          licks his palm and slicks his hair back. He adjusts his tie\n          as Redridge's men usher the bikers into his \"office\".\n          \n          Carnegie wheels around and flashes a smile at them. Just as\n          when he gave his balcony address, Carnegie is in performance\n          mode - charismatic and slick like a campaigning politician.\n          \n                              CARNEGIE\n                    Gentlemen! It's truly a delight to\n                    see you again! I understand your\n                    latest excursion into the outland\n                    has been a profitable one?\n          \n          The bikers exchange looks. They understood maybe half the\n          words in that sentence. The lead biker - named HOG - speaks.\n          \n                              HOG\n                    We did good.\n          \n                              CARNEGIE\n                    Well, let's see, shall we?\n          \n          Hog tips the satchel's contents out onto Carnegie's desk.\n          \n          BOOKS. About a dozen different volumes of all shapes and\n          sizes. Carnegie rifles excitedly through the collection.\n          \n          We see various titles as he sorts through them. Treasure\n          Island. The Da Vinci Code. A volume of encyclopedia. The\n          Diary of Anne Frank. Tuesdays with Morrie.\n          \n          In amongst the books are a few MAGAZINES. An old issue of\n          OPRAH magazine. A torn copy of SPORTS ILLUSTRATED...\n          \n                                                                 24.\n          \n          \n          ...And a NEWSWEEK. The cover graphic illustrates OPPOSING\n          NUCLEAR ARSENALS over a world globe. On one side the STARS\n          AND STRIPES, on the other flags indicating a SINO-ISLAMIC\n          ALLIANCE. The headline reads: \"IS THERE NO TURNING BACK?\"\n          \n                              CARNEGIE\n                    No. No. No. No. No.\n          \n          As Carnegie rejects each book with growing disappointment and\n          frustration, it's clear he's looking for a specific volume.\n          \n                              CARNEGIE\n                    It's not here.\n          \n                              HOG\n                    These ain't worth nothin'?\n          \n                              CARNEGIE\n                    When you bring me the book I asked\n                    you for, it'll be worth something.\n          \n          The bikers exchange more looks. An unspoken conversation.\n          \n                              HOG\n                    We been doin' this a long time now.\n                    Had to make a whole lotta corpses\n                    to bring you all these books. You\n                    want us to keep at it, reckon it's\n                    worth more than a few free glasses\n                    of that swill you call liquor.\n          \n          Carnegie's guards bristle, ready for a confrontation.\n          Carnegie just smiles, always ready to smooth things over.\n          \n                              CARNEGIE\n                    Gentlemen, gentlemen. I urge you\n                    once again to take the long view\n                    here. When we find this book - and\n                    believe me, we will find it - we\n                    are going to build a new world. A\n                    world far greater, far more\n                    righteous than this one. And you\n                    and I are going to be perched right\n                    on top of it, looking down upon it,\n                    masters of all creation!\n          \n          As always, his carefully stage-managed rhetoric is delivered\n          with the utmost conviction, every word dripping with passion\n          and persuasion. He's a master salesman, a true huckster.\n          \n                              CARNEGIE\n                    And you know, I think you're\n                    absolutely right.\n                              (MORE)\n          \n                                                                 25.\n          \n                              CARNEGIE (cont'd)\n                    That is worth more than a few\n                    glasses of liquor. A whole lot\n                    more.\n          \n          He steps forward and looks Hog right in the eye. His gaze\n          like a laser beam, utterly disarming.\n          \n                              CARNEGIE\n                    The book I want is out there\n                    somewhere, just waiting to be\n                    found. Once there were millions of\n                    copies - you only need to find one!\n                    Find it and bring it here. And I\n                    promise you, you will be rewarded\n                    beyond anything you can imagine.\n          \n          It's impossible not to be swayed by this guy. He's just so\n          full of fiery passion and infectious belief, you almost want\n          to reach into your pocket and hand over your wallet.\n          \n          Hog snatches up his empty satchel.\n          \n                              HOG\n                    This better not be bullshit.\n          \n          He turns and marches to the door, the other bikers following.\n          The guards escort them out, only Redridge remains.\n          \n          Carnegie slumps back into his chair, frustrated, pissed off.\n          \n                              REDRIDGE\n                    Might help if they knew just what\n                    they were looking for.\n          \n                              CARNEGIE\n                    Not one of them can read. How would\n                    they even know when they found it?\n          \n                              REDRIDGE\n                    So how's about you just tell me?\n          \n          Carnegie and Redridge lock eyes. BEAT.\n          \n                              REDRIDGE\n                    Two years now you been sending\n                    these crews into the outland.\n                    Burning up gas we can barely spare.\n                    For a goddamn book? What the hell\n                    kinda book can be worth all this?\n          \n          Carnegie ignores him. Stands, walks toward the door. Redridge\n          sighs, gestures toward the books piled on Carnegie's desk.\n          \n                                                                 26.\n          \n          \n                              REDRIDGE\n                    What about these?\n          \n                              CARNEGIE\n                    Put them with the others.\n          \n          INT. PALLADIUM - MAIN LOBBY - DAY\n          \n          Redridge stands by the marble fireplace, tossing the books\n          into the fire. The flames flicker and leap around the books\n          as their pages blacken and are consumed by the fire.\n          \n          INT. ENGINEER WORKSHOP - DAY\n          \n          Eli watches as the engineer charges the battery with the gas\n          generator, which chugs noisily.\n          \n          He licks his lips, dry as sand. Unscrews his canteen to take\n          a drink, but it's down to its last few drips.\n          \n                              ELI\n                    What's this place across the\n                    street? They got any water?\n          \n                              ENGINEER\n                    We got our own underground spring\n                    here. Only fresh water in a hundred\n                    miles - if's you can pay for it.\n          \n          Eli thinks a while longer. Then stands and stuffs his shotgun\n          inside his pack, shoulders his gear and makes for the door.\n          \n                              ELI\n                    I'll be back.\n          \n          Eli stops in the doorway and turns back to the engineer.\n          \n                              ELI\n                    If that battery ain't here when I\n                    get back, I will use this gun on\n                    your kneecaps and I will put this\n                    building to the torch and I will\n                    watch it burn to the ground with\n                    you alive inside it. So help me\n                    God.\n          \n          And with that he turns and leaves. The engineer gulps. Not a\n          hint in Eli's voice that he didn't mean every word.\n          \n          INT. PALLADIUM - CARNEGIE'S BEDROOM - DAY\n          \n          This old second-floor DRESSING ROOM has been converted into a\n          bedroom, simply furnished.\n          \n                                                                   27.\n          \n          \n          A WOMAN stands in front of an old DRESSING ROOM MIRROR, the\n          bulbs around the frame burned-out and broken. She washes her\n          face in murky water in an old PORCELAIN BOWL on the dresser.\n          \n          Her name is CLAUDIA. Early 30s, pretty. She gazes into the\n          mirror as she dries her hands, but it's so cracked and warped\n          it's near impossible to see a reflection.\n          \n          The door opens and Carnegie enters. He still looks steamed.\n          Claudia doesn't turn to look at him, keeps facing the mirror.\n          \n                              CLAUDIA\n                    Is that you, honey?\n          \n          Carnegie says nothing. Just paces angrily up and down.\n          Finally Claudia turns to face him.\n          \n                              CLAUDIA\n                    Something wrong?\n          \n                              CARNEGIE\n                    More books came in from the road\n                    today.\n          \n                              CLAUDIA\n                    Oh? It's been a while.\n          \n                              CARNEGIE\n                    And it'll be a while longer. Just\n                    another pile of useless junk. If we\n                    don't find the right one soon - if\n                    I can't give these people what they\n                    want to hear...\n          \n          Carnegie trails off, the thought too awful to contemplate.\n          Claudia adopts a sympathetic expression, supportive.\n          \n                              CLAUDIA\n                    You'll find what you're looking\n                    for. It's out there somewhere. You\n                    just have to have faith.\n          \n          This seems to anger Carnegie. He wheels on her.\n          \n                              CARNEGIE\n                    Faith? Is that what you think we're\n                    missing around here?\n          \n          She detects the aggressive tone in his voice and goes quiet,\n          head bowed. Carnegie moves toward her angrily.\n          \n                              CARNEGIE\n                    My old man used to have faith. He\n                    had it in spades. My mother, too.\n                              (MORE)\n          \n                                                                    28.\n          \n                              CARNEGIE (cont'd)\n                    You know where it got them? You\n                    know where it got me?\n          \n          He's in her face now. Claudia avoids eye contact, submissive.\n          \n                              CARNEGIE\n                    Faith is for the weak. It's for\n                    them out there, the sheep. This\n                    world is what you can see and touch\n                    and taste. It's what you make it.\n                    All these years with me, you still\n                    don't have any grasp of that?\n                    What's wrong with you, woman?\n          \n          He's shouting now, and she's trembling, afraid to speak.\n          \n                                 CLAUDIA\n                    I'm sorry.\n          \n          Carnegie realizes he's frightened her. He softens.\n          \n                              CARNEGIE\n                    No, I'm sorry. I didn't mean to\n                    scare you. Hey. You okay?\n          \n          He lifts her chin up, wipes away a tear.\n          \n                              CARNEGIE\n                    You just get me all riled up with\n                    that kind of talk. It's not what I\n                    need from you right now.\n                        (SMILES)\n                    You know what I need right now?\n          \n          He puts his hands on her lustfully. It's clear she's not in\n          the mood, but she halfheartedly responds anyway. More out of\n          a sense of wifely duty than reciprocated passion.\n          \n          As they kiss, Carnegie pushes her excitedly against the wall\n          and feverishly begins unbuckling his pants.\n          \n          INT. PALLADIUM - MAIN LOBBY - DAY\n          \n          The original customers have now been joined by the four\n          bikers, who sit at their own table drinking a clear and\n          pungent moonshine-type liquor from a shared jar.\n          \n          Eli enters. All eyes are on him immediately, regarding him\n          with guarded interest as he pulls up a stool at the bar.\n          \n          The BARTENDER approaches, looks him up and down. Suspicious.\n          \n                              BARTENDER\n                    Outlander? Let me see-\n          \n                                                                 29.\n          \n          \n          Eli raises his hand as before. Holds it outstretched, steady.\n          \n                              BARTENDER\n                    What'll it be?\n          \n          Eli places the canteen on the bar.\n          \n                              ELI\n                    Water.\n          \n                              BARTENDER\n                    That's the good stuff. Gotta eat\n                    into my own ration to sell it - so\n                    I don't sell it cheap.\n          \n          Eli takes off his scarf and puts it on the bar. The bartender\n          takes it and looks it over. Not particularly impressed.\n          \n                              BARTENDER\n                    That'll get you maybe half-way.\n          \n          The bartender spies Eli's silver Saint Christopher pendant.\n          \n                              BARTENDER\n                    What about that?\n          \n          Eli stuffs the pendant inside his shirt. No way that's for\n          sale. Instead, he reaches into his coat and produces the fur\n          pelts he skinned from the dead cat, lays them out on the bar.\n          \n                              ELI\n                    That's the best I got.\n          \n          The bartender takes a pelt and examines it. The mangy cat\n          leaps up onto the bar and approaches. Sniffs at the pelts\n          with suspicion and HISSES at Eli.\n          \n          Eli shoos the cat off the bar with a wave of his hand. At the\n          biker's table Hog watches this, not happy about this.\n          \n          Satisfied with the pelts, the bartender gathers them up along\n          with the scarf, then turns away toward the back room.\n          \n                              BARTENDER\n                    Solara!\n          \n          A TEENAGE GIRL emerges from the back. No older than 16 or 17.\n          Dressed in unflattering work clothes, face grimy, blonde hair\n          tied back in a ponytail. But even through all this, it's\n          clear she is a strikingly beautiful young woman.\n          \n          The bartender takes Eli's canteen and hands it to Solara\n          along with a RATION CARD he keeps around his neck.\n          \n                                                                 30.\n          \n          \n                              BARTENDER\n                    Take this out back and get it\n                    filled.\n          \n          Solara takes the canteen, pausing for a moment to look Eli up\n          and down. Unsure quite what to make of him, but intrigued.\n          There's something about him she can't put her finger on...\n          \n          He doesn't look back at her. She turns and exits.\n          \n          EXT. DESERT TOWN - MAIN STREET - CONTINUOUS\n          \n          Solara exits via the Palladium's STAGE DOOR and walks across\n          the busy street to where TWO OF CARNEGIE'S ARMED MEN stand\n          guard around an ENCLOSURE OF CHAIN-LINK FENCE TOPPED WITH\n          RAZOR WIRE. TOWNSFOLK wait in line with bowls and buckets.\n          \n          One of the guards recognizes Solara and lets her cut to the\n          front of the line. He punches two holes in her ration card\n          and lets her inside the chain-link enclosure.\n          \n          Inside is an OLD RUSTED SPIGOT attached to a pipe emerging\n          from the earth. Solara cranks hard on the handle - it takes a\n          few pulls before the water comes, and then only at a weak\n          trickle; it will take a while to fill the canteen.\n          \n          INT. PALLADIUM - MAIN LOBBY - CONTINUOUS\n          \n          As Eli sits at the bar, a SHADOW comes into view and looms\n          large over him. Hog is standing behind him, glaring, cutting\n          a menacing figure in his armored cycle leathers.\n          \n          Solara senses trouble brewing and moves off, taking Eli's\n          canteen away into the back room.\n          \n                              HOG\n                    That was my cat.\n          \n          Eli doesn't turn. Just looks straight ahead. Impossible to\n          read him behind those mirrored goggles. Utterly inscrutable.\n          \n                              ELI\n                    Fine specimen.\n          \n                              HOG\n                    I saw you push him off the bar.\n          \n                              ELI\n                    I didn't push him.\n          \n                              HOG\n                    You raised your hand at him.\n          \n                                                                 31.\n          \n          \n                              ELI\n                    Sorry. It won't happen again.\n          \n          The bartender looks at Hog nervously.\n          \n                              BARTENDER\n                    Hey, how about another drink, Hog?\n          \n                              HOG\n                    That cat's been comin' in here for\n                    nigh on two years. It got more\n                    right to be here than you. Who the\n                    fuck do you think you are?\n          \n                              ELI\n                    I don't want any trouble.\n          \n          Hog grabs him by the arm.\n          \n                              HOG\n                    Well, that's too bad, `cause-\n          \n          Blink. Suddenly Hog's head is pinned to the bar by nothing\n          more than Eli's thumb. Pressed deep into a nerve cluster in\n          his neck. Eli leans in close as Hog whimpers, paralyzed.\n          \n                              ELI\n                    I know you. Murderer of innocent\n                    travelers on the road. You're going\n                    to spend eternity drowning in a\n                    lake of fire for the things that\n                    you've done. Did you know that?\n          \n          The other bikers stand and approach, the OTHER CUSTOMERS\n          following suit. Eli senses the trouble gathering behind him.\n          \n                              ELI\n                    You go on back to your table and\n                    I'll be on my way. All right?\n          \n          It's all Hog can do to just barely nod his head. Eli releases\n          his thumb. Hog staggers backward, gasping for breath.\n          \n          Eli stands and makes toward the door, but the bikers and\n          other patrons have moved to block his exit.\n          \n                              BURLY PATRON\n                    You push Hog, you push all of us.\n          \n          Eli sighs, looks down at the floor. He's been pushed one time\n          too many today. For the first time, we see anger in his face.\n          \n                                                                    32.\n          \n          \n                              ELI\n                    Cursed be the ground because of\n                    you. By toil shall you eat of it.\n                    Thorns and thistles shall it sprout\n                    for you. From the ground were you\n                    taken. For dust you are.\n          \n          The patrons look at Eli strangely. Who is this guy?\n          \n          Eli reaches back and draws the samurai sword. Carves a line\n          in the dirt at his feet with the tip of the blade.\n          \n                              ELI\n                    And to dust you shall return.\n          \n          INT. PALLADIUM - CARNEGIE'S BEDROOM - DAY\n          \n          Carnegie has Claudia pinned against the wall, his pants\n          bunched around his ankles, ass bared as he pounds away at\n          her. Not making love. This is mechanical, loveless sex.\n          \n          Claudia stares vacantly over his shoulder into space as\n          Carnegie thrusts into her again and again. Deeply\n          uninterested, just waiting for it to be over.\n          \n          Suddenly, we hear a CRASH O.S. Carnegie stops and listens.\n          \n                              CARNEGIE\n                    Did you hear that? What was that?\n          \n          Claudia sees an opening to get out of this.\n          \n                              CLAUDIA\n                    Maybe you should go check.\n          \n          BEAT. Carnegie keeps listening. Then comes another CRASH.\n          \n                              CARNEGIE\n                    What in the hell is going on?\n          \n          He pulls up his pants, grabbing a RIFLE propped by the door\n          as he rushes out. Claudia just stands there for a moment,\n          then reaches down and pulls up her panties.\n          \n          She moves from the wall and makes her way across the room,\n          feeling her way with her hands, gazing off into nothingness.\n          Only now do we finally realize that she is BLIND.\n          \n          INT. PALLADIUM - MAIN LOBBY - CONTINUOUS\n          \n          Carnegie emerges from the bedroom onto the balcony. Looks\n          down over the railing - and is stunned by what he sees.\n          \n                                                                 33.\n          \n          \n          CHAOS in the bar below. Eli cutting a one-man swath of mayhem\n          through the dozen brawlers. Most already lie dead. TWO MORE\n          MEN ATTACK Eli and are effortlessly felled by his sword.\n          \n          Carnegie rushes hurriedly along the landing, banging loudly\n          on the doors of the upstairs rooms.\n          \n                              CARNEGIE\n                    Get your asses out here!\n          \n          ON ELI. Surrounded by the dead, only one man left standing.\n          Hog. He backs away as Eli circles him like a predator. Sword\n          held ready, the blade glistening with dark red blood.\n          \n          SOLARA re-emerges from the back room with Eli's refilled\n          canteen. She stops and emits a horrified GASP when she sees\n          the bloody carnage laid out in the bar before her.\n          \n          She watches, mortified, as Eli moves toward the helpless,\n          terrified Hog, going in for the kill. Raising his sword...\n          \n          Suddenly, Solara steps forward and CRIES OUT:\n          \n                                 SOLARA\n                    Stop!\n          \n          Eli FREEZES. Sword hanging in the air, poised to strike. He\n          turns his head to where Solara stands behind the bar.\n          \n                              SOLARA\n                    Please don't.\n          \n          BEAT as Eli considers. He looks back at Hog, still completely\n          at his mercy... and then LOWERS THE SWORD.\n          \n                                 ELI\n                    Go.\n          \n                              HOG\n                        (CONFUSED)\n                    ...What?\n          \n                              ELI\n                    It ain't for me to judge you. Your\n                    time for that's gonna come. Believe\n                    me. Now go on. Get out of here.\n          \n          Hog stumbles backward through the door, into the sunlight.\n          Eli moves toward Solara, who stands petrified behind the bar.\n          Reaches out and gently pries the canteen from her loose grip.\n          \n                                 ELI\n                    Thank you.\n          \n                                                                    34.\n          \n          \n          In the exitway, Hog turns back inside, grabbing up a BROKEN\n          BOTTLE from the bloody floor as he goes.\n          \n          Hog rushes Eli from behind. Solara sees him coming and goes\n          to SCREAM - but before any sound can come, Eli flips his\n          sword backward and Hog runs right onto it, SKEWERING HIMSELF.\n          \n          BEAT. Hog just stands there for a moment, eyes wide, frozen\n          in shock. His fingers go limp, dropping the bottle.\n          \n          He slides off the sword and collapses to the floor, dead.\n          \n          Eli wipes the sword clean and sheathes it. Looks around at\n          the bloodied, fallen bodies. Then back at Solara.\n          \n                              ELI\n                    I'm sorry for all the mess.\n          \n          As he turns and heads toward the door:\n          \n                              CARNEGIE (O.S.)\n                    Hold it right there.\n          \n          Accompanied by the sound of MULTIPLE GUNS COCKING.\n          \n          Carnegie is on the landing, training his rifle down at Eli.\n          Alongside him, FIVE GUNMEN do the same. They've got him cold.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          Carnegie sits at his desk, the huge auditorium and stage area\n          visible behind him. Eli stands before him. Around him are the\n          other gunmen, who keep their weapons trained on him.\n          \n          Standing at Carnegie's side are REDRIDGE and CLAUDIA.\n          \n                              CARNEGIE\n                    So, who are you?\n          \n                              ELI\n                    Nobody. A walker in the outland.\n          \n                              CARNEGIE\n                    I've met walkers before. Not a\n                    particularly civilized bunch. Some\n                    have even taken to eating their own\n                    kind, did you know that? You\n                    wouldn't be one of those savages\n                    now, would you?\n          \n          Carnegie's gunmen look him over, inspecting him warily.\n          \n                              CARNEGIE GUNMAN\n                    He ain't got the shakes.\n          \n                                                                  35.\n          \n          \n          Carnegie's confident gaze remains fixed on Eli throughout.\n          \n                              CARNEGIE\n                    Good. This is a civilized town.\n                    Under God. Do you know what that\n                    means?\n          \n          Eli can't help but react at the mention of that word.\n          \n                              CARNEGIE\n                    It means we have laws here. Laws\n                    set down long before any of us ever\n                    walked this earth. And one of them\n                    is, you don't eat the flesh of your\n                    brother. Else you're no better than\n                    an animal. And not welcome here.\n          \n          Eli doesn't respond. Just stands there in Carnegie's gaze.\n          \n                              CARNEGIE\n                    So what's your business here,\n                    friend? Walkers don't usually come\n                    into town less they want something.\n          \n                              ELI\n                    I had a battery needed charging and\n                    a canteen needed filling. I didn't\n                    come here looking for trouble.\n          \n          Barely noticeable, Carnegie gestures to one of the gunmen,\n          who nods in acknowledgement and leaves.\n          \n                              CARNEGIE\n                    Well, you sure as hell found it. Do\n                    you know who I am?\n          \n                              ELI\n                    No.\n          \n                              CARNEGIE\n                    My name's Carnegie. I own this bar.\n                    I own the whole town. You've never\n                    heard of me?\n          \n                              ELI\n                    That's you out there on the street.\n          \n                              CARNEGIE\n                    Remarkable likeness, isn't it?\n                    You'd never guess half the men who\n                    built it were blind. A small\n                    tribute from a grateful people. I\n                    was deeply touched.\n          \n                                                                 36.\n          \n          \n                              ELI\n                    You had slaves build you a monument\n                    to yourself?\n          \n          The mention of that word rankles Carnegie. He walks around\n          the desk toward Eli, waves an admonishing finger at him.\n          \n                              CARNEGIE\n                    Don't call them slaves. That's an\n                    old word. I'm not a slaver. I'm\n                    trying to help these people.\n          \n          Carnegie can't help himself - once again he is in his natural\n          element, spinning the argument his way, pitching. Selling.\n          \n                               CARNEGIE\n                    In the outland the sightless are\n                    preyed upon like sick animals. Here\n                    at least they're protected. They do\n                    the essential work others don't\n                    want. And in return they eat, they\n                    drink, they survive. Last year, a\n                    couple of them even got married -\n                    performed the ceremony myself.\n                        (BEAT)\n                    You see, I'm not exploiting these\n                    people - I'm saving them! Any one\n                    of them is free to leave whenever\n                    they wish. But here they stay. And\n                    they thank me every single day for\n                    their salvation!\n          \n          An impressive, impassioned performance. He sounds just like\n          an old-school TV evangelist. But Eli is unmoved.\n          \n                              ELI\n                    It's none of my business what you\n                    do here. Like you said, it's your\n                    town. I just want to be on my way.\n          \n                              CARNEGIE\n                    What's your name, walker?\n          \n          Eli doesn't respond. Just stands there.\n          \n                              CARNEGIE\n                    All right, I guess we just call you\n                    Walker. Don't see too many folks\n                    your age these days. You lived in\n                    the world before? You can read?\n          \n                              ELI\n                    I read every day.\n          \n                                                37.\n          \n          \n                    CARNEGIE\n          That's good. Good man. We educated\n          folk, we need to stick together, if\n          we're ever going to rebuild this\n          world. People like you and me,\n          we're the future.\n          \n                    ELI\n          What do you want with me?\n          \n                     CARNEGIE\n          Straight to the point. I like that.\n          Fact is, you could be in a lot of\n          trouble. This is a peaceful town.\n          You walk in here, armed, and the\n          next thing a dozen of my good\n          citizens are dead. I've hanged men\n          for less. I could hang you.\n              (BEAT)\n          Or, you could come work for me.\n          \n                    ELI\n          What?\n          \n                    CARNEGIE\n          I never once saw anyone handle\n          themselves the way you did down\n          there in that bar. I don't know\n          where you learned it, but I sure as\n          hell could use it.\n          \n                    ELI\n          I'm not interested.\n          \n                    CARNEGIE\n          People who work for me can live\n          better than any walker ever\n          dreamed. Real beds, clean water,\n          hot food. Women, even. You could do\n          a lot worse, my friend.\n          \n                    ELI\n          I'm not your friend. And I'm not\n          staying. I got someplace I need to\n          be. Out west.\n          \n                    CARNEGIE\n          West? There is nothing west. It's\n          all gone, a long time ago.\n          \n                    ELI\n          I've been told different.\n          \n                                                                    38.\n          \n          \n                              CARNEGIE\n                    By who?\n          \n          Eli doesn't reply. Carnegie smiles, dials up the charm.\n          \n                              CARNEGIE\n                    All right, look. I'm going to make\n                    you an offer of goodwill. Stay the\n                    night, think it over. Try a little\n                    local hospitality. We'll talk again\n                    in the morning. If you're still not\n                    interested, you're free to go. No\n                    hard feelings.\n          \n                              ELI\n                    Thank you for your offer. But I'd\n                    prefer to just leave right now. So\n                    you can either let me out of here,\n                    or I can kill my way out.\n          \n          The gunmen bristle, exchange nervous looks. Carnegie appears\n          unfazed. He smiles. BEAT. He looks to the gunman at the door.\n          \n                              CARNEGIE\n                    Let him go.\n          \n          The gunman opens the door. Eli turns and exits.\n          \n          INT. ENGINEER WORKSHOP - DAY\n          \n          The engineer stands behind the counter, looking worried. His\n          heart sinks when he sees Eli enter.\n          \n                              ENGINEER\n                    Oh, shit...\n          \n                              ELI\n                    How's my battery?\n          \n                              ENGINEER\n                    It's, uh... it's gonna take a\n                    little longer than I thought.\n          \n                              ELI\n                    How much longer?\n          \n                              ENGINEER\n                    It's gotta charge overnight. You,\n                    uh, you can always stay here in\n                    town, pick it up in the morning.\n          \n          Eli leans in a little closer. He smells a rat.\n          \n                                                                    39.\n          \n          \n                              ELI\n                    You remember what I said would\n                    happen if I came back here and you\n                    didn't have my battery?\n          \n                              ENGINEER\n                    It's right here! It's just gonna\n                    take a while longer. I swear.\n          \n          Eli looks at the engineer. Hard to be certain, but he's\n          pretty sure he's lying. Somebody got to him.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          A VIOLENT COMMOTION is heard from down the hall. Suddenly one\n          of Carnegie's henchmen comes flying into view as he is THROWN\n          HARD INTO A WALL and slumps to the floor, unconscious.\n          \n          Eli storms into the box, pissed. MORE GUARDS rush in behind\n          him. Carnegie, seated behind his desk, waves the guards off\n          as he stands to greet Eli, smiling ingratiatingly as ever.\n          \n                              CARNEGIE\n                    I knew you'd reconsider.\n          \n                              ELI\n                    Yeah? How'd you know that?\n          \n                              CARNEGIE\n                    None of the walkers I've seen come\n                    here from the outland were ever\n                    what you'd call smart. I mean all\n                    those years out there alone on the\n                    road, some with their brains half-\n                    fried from eating each other - it's\n                    understandable why you people\n                    aren't the brightest bulbs in the\n                    box. But I never met one so dumb\n                    that he'd turn down a meal and a\n                    bed if it was offered.\n          \n                              ELI\n                    So you didn't send someone across\n                    the street to the engineer?\n          \n                              CARNEGIE\n                    Engineer? I don't know what you're\n                    talking about. If there's something\n                    wrong, maybe I can help.\n          \n          Carnegie is a practiced liar. Much more difficult to read.\n          \n                                                                 40.\n          \n          \n                              CARNEGIE\n                    This is Redridge. He's kind of my\n                    right-hand man around here.\n          \n          Redridge - one of the two men who chased Eli into the room -\n          steps forward. He regards Eli with a distrustful eye.\n          \n                              CARNEGIE\n                    He'll show you to your room.\n          \n          INT. PALLADIUM - GUEST BEDROOM - DUSK\n          \n          Redridge opens the door and ushers Eli inside.\n          \n          It's another of the dressing rooms converted into a bedroom,\n          less well-appointed than Carnegie's own. A threadbare rug.\n          Bed with relatively clean sheets. A sink for washing.\n          \n                              REDRIDGE\n                    Enjoy your stay. There'll be\n                    someone outside your room all\n                    night. If you need anything.\n          \n          Redridge smirks and closes the door, leaving Eli alone. Eli\n          paces across the room. Finally sits down on the creaky old\n          bed. Trying to figure out how he managed to get stuck here.\n          \n          He unshoulders his pack, sets it down. Lies down on the bed.\n          It's been a while since he felt a real bed on his back.\n          \n          A KNOCK at the door. Eli gets quickly to his feet.\n          \n                              ELI\n                    Hello?\n          \n          The door opens and CLAUDIA enters. Carrying a metal tub of\n          water in both hands and, atop that, a dinner tray.\n          \n                              CLAUDIA\n                    I have this for you. Water for\n                    washing and some food.\n          \n          Eli just stands there. Totally unfamiliar with this kind of\n          situation, it's been too long. She smiles, embarrassed.\n          \n                              CLAUDIA\n                    Well... are you going to take it?\n          \n                              ELI\n                    Oh. Thank you.\n          \n          He takes the stuff from her, sets it on the table.\n          \n                                                                 41.\n          \n          \n                              CLAUDIA\n                    You're very welcome.\n          \n          We get the impression that Claudia is as unfamiliar with this\n          kind of polite interaction as Eli. But she likes it.\n          \n                              CLAUDIA\n                    It'll be dark soon.\n          \n          She strikes a match and lights the oil lamp on the table. The\n          room is lit by its flickering glow.\n          \n                              CLAUDIA\n                    Can I get you anything else?\n          \n                              ELI\n                    No, thank you.\n          \n                              CLAUDIA\n                    Well. Have a good night.\n          \n          As she turns for the door:\n          \n                              ELI\n                    You're Carnegie's woman?\n          \n                              CLAUDIA\n                    Why do you ask?\n          \n                              ELI\n                    Just making conversation is all.\n                    Haven't had one of those in a\n                    while. Not a real one, leastways.\n          \n          Claudia smiles. Neither has she.\n          \n                              CLAUDIA\n                    He found me in the outland. I was\n                    sixteen, my family had been...\n                    well, they were gone. There was\n                    just me and my baby.\n          \n                              ELI\n                    You had a baby?\n          \n                              CLAUDIA\n                    I'd met some men on the road. Bad\n                    men. They...\n          \n          BEAT. She trails off, struggling with this unhappy memory.\n          Eli gets it, raises a hand reassuringly.\n          \n                              ELI\n                    It's all right.\n          \n                                                                  42.\n          \n          \n                              CLAUDIA\n                    I was on the road for a year after\n                    that. I couldn't feed myself, let\n                    alone my little girl. And then Bill\n                    found us and he promised he'd take\n                    care of us. He told me he was going\n                    to make a place where we could be\n                    safe. And he did. He did all that.\n                    He built this whole town. He kept\n                    us safe. And he raised that child\n                    like she was his own. He's been so\n                    good to both of us. He saved us,\n                    really.\n          \n          There's a bittersweet quality to Claudia's words. As though\n          there is more to the story than she is telling.\n          \n          Eli pulls out a chair at the table, offers it to her.\n          \n                              ELI\n                    You want to eat some?\n          \n          She smiles and sits. Eli sits across from her.\n          \n                              ELI\n                    When did you go blind? In the war?\n                    You get caught in a flash?\n          \n                              CLAUDIA\n                    No, I was born this way. I think\n                    I'm lucky like that.\n          \n                              ELI\n                    Lucky?\n          \n                              CLAUDIA\n                    It's not like I ever knew what I'm\n                    missing. I was already used to\n                    being like this by the time... by\n                    the time it all happened. So I got\n                    around pretty good even when I was\n                    on my own. And now it's easy. I\n                    know every creaky old floorboard in\n                    here, and it's not like I ever go\n                    any place else. Bill would never\n                    allow it. He worries about me so\n                    much.\n          \n          Again, bittersweet. The sense that Claudia feels trapped.\n          Thinking about it begins to upset her. She gets up.\n          \n                              CLAUDIA\n                    I should go. He'll be wondering\n                    where I am.\n          \n                                                                 43.\n          \n          \n          Eli stands, escorts her to the door and opens it.\n          \n                              CLAUDIA\n                    Thank you. I enjoyed our\n                    conversation.\n          \n                                ELI\n                    So did I.\n          \n          Eli closes the door, then sits back at the table.\n          \n          INT. PALLADIUM - CARNEGIE'S BEDROOM - NIGHT\n          \n          Carnegie washes, looking at himself in the old dressing-room\n          mirror. He sees Claudia enter the room in its dim reflection.\n          \n                              CARNEGIE\n                    You took your time in there. How\n                    long does it take to deliver a\n                    plate of food and some water?\n          \n          A subtly accusing tone. It makes Claudia nervous.\n          \n                              CLAUDIA\n                    He wanted to talk.\n          \n                              CARNEGIE\n                    Oh? What about?\n          \n                              CLAUDIA\n                    Nothing really. He asked me what it\n                    was like to be blind.\n          \n                              CARNEGIE\n                    He tell you anything about him?\n          \n                              CLAUDIA\n                    No. I don't think he likes to talk\n                    about himself much.\n          \n                              CARNEGIE\n                    Yeah, I got that.\n          \n          Claudia moves to the bedside, begins to undress.\n          \n                              CLAUDIA\n                    I don't think he's going to change\n                    his mind by morning. I don't think\n                    he's going to stay.\n          \n                              CARNEGIE\n                    What makes you say that?\n          \n                                                                44.\n          \n          \n                              CLAUDIA\n                    Just strikes me as the kind of man\n                    who's of a mind, is all. Doesn't\n                    seem like the type to go changing\n                    it once it's set.\n          \n                              CARNEGIE\n                    Well, we'll just see about that.\n          \n                              CLAUDIA\n                    You saw him. He's not like the\n                    others. You won't be able to smooth-\n                    talk him and wrap him around your\n                    finger like you usually do.\n          \n                               CARNEGIE\n                    Who said anything about me?\n                        (BEAT)\n                    I'm sending Solara.\n          \n          Claudia reacts suddenly to this. Shocked and angry.\n          \n                              CLAUDIA\n                    You're doing what?\n                              CARNEGIE\n                    You know how often these walkers\n                    get laid? Never. Least not by\n                    anything living or willing. Girl\n                    like her can be very persuasive.\n          \n                              CLAUDIA\n                    You can't send her in there with\n                    him. He's dangerous, he's a killer!\n          \n                              CARNEGIE\n                    You went in there readily enough.\n          \n                              CLAUDIA\n                    That's different. Solara's just a\n                    child, she can't-\n          \n          Carnegie sighs, tiring of this.\n          \n                              CARNEGIE\n                    She's a grown woman now, Claudia.\n                    Sooner or later you're going to\n                    have to accept that. She has to\n                    earn her keep around here, same as\n                    the rest of us.\n          \n                              CLAUDIA\n                    By working as a whore? That's all\n                    you think she's fit for?\n          \n                                                                    45.\n          \n          \n                              CARNEGIE\n                    We've each been given a talent to\n                    help us make our way in this world.\n                    Some people's gift is more evident\n                    than others. Solara's sure as hell\n                    is.\n          \n          Claudia looks at Carnegie in disgust.\n          \n                              CLAUDIA\n                    What kind of a man are you?\n          \n          Now it's Carnegie's turn to get angry. He rounds on her\n          menacingly. She backs off as he approaches.\n          \n                              CARNEGIE\n                    I'm the kind of man who'd pull a\n                    helpless blind girl off the road, a\n                    girl who'd been beaten and raped,\n                    and give her a place where she can\n                    live without fear! Without me you'd\n                    be just another no-eye, lying dead\n                    in the outland, picked clean by the\n                    buzzards, or shoveling dirt down\n                    there with the others. That's the\n                    kind of man I am!\n          \n          He has her against the wall, his face just inches from hers.\n          \n                              CLAUDIA\n                    I don't live without fear. I\n                    haven't for a long time now.\n          \n          Carnegie calms himself, backs off. Claudia goes to leave.\n          \n                              CARNEGIE\n                    Where are you going?\n          \n                              CLAUDIA\n                    I'm not going to let you do this.\n          \n          Carnegie surges forward and pins Claudia to the wall.\n          \n                               CARNEGIE\n                    You're not going to let me?\n                        (BEAT)\n                    Nobody tells me what I can and\n                    can't do in my own town. Nobody. I\n                    built this world, and I am God\n                    here! So don't go thinking about\n                    screwing with my plans. You know\n                    how this works. Solara goes against\n                    me, you get hurt. You go against\n                    me, she gets hurt.\n          \n                                                                 46.\n          \n          \n          He releases his grip on her.\n          \n                              CARNEGIE\n                    So let's not see anybody get hurt.\n                    Okay?\n          \n          He speaks more softly now. As he strokes his hand tenderly\n          through Claudia's hair, a tear runs down her cheek.\n          \n          INT. PALLADIUM - GUEST BEDROOM - NIGHT\n          \n          Dark outside, but the room is brightly lit by the glow of the\n          oil lamp. Eli sits up on his bed, quietly reading the old\n          leather-bound book from his backpack.\n          \n          Another KNOCK at the door. Eli jumps up and hurriedly hides\n          the book inside his shirt.\n          \n                               ELI\n                    Come in.\n          \n          The door opens to reveal Solara. Looking very different than\n          she did before. Cleaned up and wearing a flowery summer\n          dress, blonde hair let down over her shoulders. Stunning.\n          \n          Unlike everyone else we have met, she seems - physically, at\n          least - totally unscarred by the horrors of the times. Far\n          too beautiful a thing to belong in a world like this.\n          \n                              SOLARA\n                    Hi. Can I come in?\n          \n                              ELI\n                    Someone was already here with food\n                    and water. I got everything I need.\n          \n                              SOLARA\n                    You sure about that?\n          \n          She glides into the room, closing the door. She's good. Very\n          seductive. Eli is totally disarmed in her presence.\n          \n                              SOLARA\n                    It's too bright in here. Mind if I\n                    turn it down a little?\n          \n          She doesn't wait for an answer. Moves to the table and turns\n          down the oil lamp. A darker, more seductive lighting scheme.\n          \n                              SOLARA\n                    That's better. I'm Solara. You're\n                    Walker, right?\n          \n                                                                   47.\n          \n          \n                              ELI\n                    No. My name's Eli.\n          \n                              SOLARA\n                    That short for something? Elias?\n          \n                               ELI\n                    Elijah.\n          \n                              SOLARA\n                    Elijah. I never heard that one\n                    before. It's kinda cute.\n          \n          She sits on the bed, kicks her legs playfully. Her light\n          cotton dress revealing in all the right places. The\n          silhouette of her body bathed in the seductive glow of the\n          oil lamp. No red-blooded man on earth could resist her.\n          \n                              ELI\n                    Look, I don't mean to be rude. But\n                    I'm really not interested.\n          \n                              SOLARA\n                    You sure about that? It gets mighty\n                    lonely out there on the road.\n          \n          She leans over on the bed, resting on her elbow. Her hair\n          cascades down. God damn, she looks good.\n          \n                              SOLARA\n                    If you're worried about money, this\n                    is all paid for. The whole night.\n          \n                              ELI\n                    It's not that. You're a very nice\n                    girl. But I'm not that kind of man.\n          \n          She slides off the bed, approaches him. Begins to work the\n          buttons of his shirt.\n          \n                              SOLARA\n                    They're all that kind of man.\n          He moves her hand away. Gently pushes her back a step.\n          \n                               ELI\n                    I'm not.\n          \n          She is stunned. No man has ever turned her down before. And\n          then she seems a little insulted.\n          \n                              SOLARA\n                    They told me you were crazy. Maybe\n                    they were right.\n          \n                                                                 48.\n          \n          \n          Eli opens the door for her.\n          \n                              ELI\n                    I'm sorry. Good night.\n          \n          Suddenly all her other emotions give way to fear. She moves\n          to the door and slams it shut again. Looks Eli in the eye.\n          \n                              SOLARA\n                    Please don't make me leave. I have\n                    to stay the night. If I don't...\n          \n                              ELI\n                    If you don't, what?\n          \n                              SOLARA\n                    He'll hurt my mom.\n          \n                              ELI\n                    Who will? Carnegie?\n          \n          She nods, fighting back a tear. This angers Eli.\n          \n                              ELI\n                    Maybe he and I oughta have words.\n          \n          He goes for the door handle, but she stops him.\n          \n                              SOLARA\n                    No! Please, don't!\n          \n                              ELI\n                    He's hurting you. He's hurting your\n                    mother. He's-\n          \n                              SOLARA\n                    He's my dad.\n          \n          BEAT. Eli moves his hand away from the door.\n          \n                              SOLARA\n                    Look, if you want to help me, just\n                    let me stay here tonight. We don't\n                    have to do anything. I'll sleep on\n                    the floor. Tomorrow you can tell my\n                    dad that we had a good time. I'll\n                    be no trouble, I swear.\n          \n          She looks up at Eli imploringly. Transformed. No longer the\n          teenage sex kitten. Now she's just a frightened little girl.\n          \n                              ELI\n                    You want to have a conversation?\n          \n                                                                 49.\n          \n          \n          She smiles, wiping the tear from her cheek.\n          \n          LATER\n          \n          Eli and Solara sit together on the bed. A silent BEAT. At\n          first, it appears as though they have nothing to say.\n          \n                                ELI\n                      You know, you don't have to be\n                      afraid of me. What happened down\n                      there in the bar...\n          \n                                SOLARA\n                      I'm not afraid of you. I know you\n                      didn't start that trouble. When I\n                      first saw you, I knew you weren't\n                      the type to go looking for it.\n          \n                                ELI\n                      How'd you know that?\n          \n                                 SOLARA\n                      My mom says I'm a good judge of\n                      character. She says I can read\n                      people. That I know a good man when\n                      I see one.\n          \n          She smiles. Eli is surprised to find himself smiling back.\n          \n                                SOLARA\n                      So... you're pretty old, right?\n          \n          Eli smiles, amused by the bluntness of the question.\n          \n                                SOLARA\n                      I'm sorry. I just mean, I haven't\n                      seen too many people your age. How\n                      old are you exactly?\n          \n                                ELI\n                      You know, I don't rightly remember.\n          \n                                SOLARA\n                      But you're old enough. I mean, you\n                      remember what it was like? In the\n                      world before?\n          \n          Eli nods.\n          \n                                SOLARA\n                      What was it like?\n          \n          Eli thinks about this. Dredging through old, old memories.\n          \n                                                                    50.\n          \n          \n                               ELI\n                    Better than this.\n                        (BEAT)\n                    People lived longer back then.\n                    Longer than me. Some were more than\n                    a hundred years old.\n          \n          Solara smiles like she's having her leg pulled.\n          \n                               SOLARA\n                    Come on.\n          \n                              ELI\n                    I swear, it's true. Nowadays it's\n                    not the same. If you're sick or\n                    you're weak or you're old you won't\n                    last long out on the road.\n          \n                              SOLARA\n                    So how come you have?\n          \n          BEAT. Eli thinks. Should he or shouldn't he?\n          \n                              ELI\n                    Can I read you something?\n          \n                              SOLARA\n                    Wait. You can read?\n          \n          Eli pulls the book from his shirt. Solara's eyes widen.\n          \n                              SOLARA\n                    And you have a book?\n                              ELI\n                    Not just any book.\n          \n          For the first time we see that it's a KING JAMES BIBLE. An\n          embossed GOLD CROSS on its old leather cover.\n          \n          Eli opens it up, scans the page with his finger until he\n          finds the passage he's looking for.\n          \n                              ELI\n                    The Lord is my shepherd. I shall\n                    not want. He makes me lie down in\n                    green pastures. He leads me beside\n                    still waters. He restores my soul.\n                    He leads me in the paths of\n                    righteousness.\n          \n          ON SOLARA as she listens to Eli read. Transfixed.\n          \n                                                                  51.\n          \n          \n                              ELI\n                    Though I walk through the valley of\n                    the shadow of death, I will fear no\n                    evil. For you are with me. Your rod\n                    and your staff, they comfort me.\n                    You prepare a table before me in\n                    the presence of my enemies. You\n                    anoint my head with oil. My cup\n                    runs over. Surely goodness and\n                    mercy shall follow me, all the days\n                    of my life. And I will dwell in the\n                    house of the Lord forever.\n          \n                              SOLARA\n                    That's beautiful. Did you write\n                    that?\n          \n                                ELI\n                          (SMILES)\n                    No.\n          \n                              SOLARA\n                    What book is it from? Is it poetry?\n          \n                              ELI\n                    I guess you could think of it that\n                    way. It's from the Holy Bible.\n          \n                              SOLARA\n                    I never heard of it. What's it\n                    about?\n          \n          BEAT as Eli thinks. How on earth to answer that?\n          \n                              ELI\n                    It's about love, and forgiveness,\n                    and life and death, and mercy, and\n                    revenge, and the beginning and the\n                    end of the world. I guess it's\n                    about a little bit of everything.\n          \n                                 SOLARA\n                    Can I see?\n          \n          She reaches out for the book but he snatches it away.\n          \n                              SOLARA\n                    What? I'm not going to do anything.\n          \n                              ELI\n                    I'm sorry. I'm charged to protect\n                    this book. I can't trust it with\n                    anyone. Not even for a while.\n          \n                                                                 52.\n          \n          \n                              SOLARA\n                    What's so special about that book?\n          \n          BEAT. Eli runs his fingers across the embossed gold cross on\n          the beat-up leather cover.\n          \n                              ELI\n                    It's the last one. There are no\n                    other books like this. All the\n                    others are gone - destroyed by the\n                    war or in the burnings that came\n                    after. This is the only one that\n                    survived until now. The last one\n                    anywhere.\n          \n                              SOLARA\n                    How can you know that?\n          \n                               ELI\n                    I just know.\n                        (BEAT)\n                    For a long while after it happened,\n                    I just wandered on the road like\n                    most everybody else. There were\n                    still a lot of people around back\n                    then, in the beginning. I didn't\n                    really know what I should do or\n                    where I was going. I was just\n                    moving from place to place, trying\n                    to stay alive. And then one day I\n                    heard this voice. I don't know how\n                    to explain it, it's like it was\n                    coming from inside me. But I could\n                    hear it, clear as day. Clear as I\n                    can hear you talking to me now.\n          \n                              SOLARA\n                    What did it say?\n          \n                              ELI\n                    It led me to this place, I don't\n                    really know where. And I found this\n                    book buried deep under some rubble.\n                    No way no-one was ever going to\n                    find it if they didn't know exactly\n                    where to look.\n          \n                              SOLARA\n                    But you knew because the voice told\n                    you?\n          \n                              ELI\n                    That's right. And that voice told\n                    me to carry the book west.\n                              (MORE)\n          \n                                                               53.\n          \n                               ELI (cont'd)\n                    It told me that a path would be\n                    laid out before me, that I'd be led\n                    to a place where this book would be\n                    safe. It told me I'd be protected\n                    against anyone or anything that\n                    tried to stand in my way. If only I\n                    would have faith.\n                        (BEAT)\n                    That was twenty-five years ago. And\n                    I've been walking ever since.\n          \n                              SOLARA\n                        (SKEPTICAL)\n                    Because a voice you heard in your\n                    head told you to.\n          \n                              ELI\n                    I'm not crazy. I didn't imagine it.\n                    I know what I heard.\n          \n                              SOLARA\n                    So who was it? The voice?\n          \n          BEAT as Eli considers his answer.\n          \n                              ELI\n                    A very important, very powerful\n                    man.\n          \n                              SOLARA\n                    More powerful than my dad?\n          \n                              ELI\n                        (SMILES)\n                    I should say so, yes.\n          \n          BEAT. The two of them sit in silence for a moment.\n          \n                              SOLARA\n                    Would you teach me to read?\n          \n                              ELI\n                    What?\n          \n                              SOLARA\n                    I never learned. No-one around here\n                    knows how. Only my dad, and he\n                    won't teach me. I think he likes\n                    being the only one who can read. I\n                    think it makes him feel powerful.\n          \n                              ELI\n                    I think you're probably right.\n          \n                                                                 54.\n          \n          \n                              SOLARA\n                    So would you teach me?\n          \n                              ELI\n                    I'm sorry. I'm leaving tomorrow.\n                    And I won't be back this way, ever.\n          \n          She looks down, sad. She likes this guy. She doesn't want him\n          to leave. Eli can sense her sadness.\n          \n                              ELI\n                    Are you hungry?\n          \n                              SOLARA\n                    I guess a little.\n          \n                              ELI\n                    There's some food on the table over\n                    there. Let's eat.\n          \n          She walks over to where the dinner tray is covered by a small\n          cloth. She whips it away - to reveal ELI'S RAT nibbling on a\n          piece of cheese. Solara SHRIEKS and backs away.\n          \n          The rat scurries down the table leg and leaps up onto Eli's\n          shoulder, just as afraid of her as she is of it.\n          \n                              ELI\n                    It's okay, it's okay. He's with me.\n                        (to the rat)\n                    Don't be afraid, pal. This is\n                    Solara. She's our friend.\n          \n          Solara approaches warily. Reaches out and strokes him. The\n          rat scurries up her arm. She almost shrieks again.\n          \n                              ELI\n                    It's okay. It means he likes you.\n          \n                                 SOLARA\n                    It does?\n                              ELI\n                    Trust me, if he didn't like you,\n                    you'd know about it.\n          \n          Solara pets the rat on her shoulder. Then:\n          \n                              SOLARA\n                    Did you really mean that?\n          \n                                 ELI\n                    Mean what?\n          \n                                                                 55.\n          \n          \n                              SOLARA\n                    That I'm your friend.\n          \n          BEAT. Eli finds himself surprised that he admitted such a\n          thing. When is the last time he had someone he could call a\n          friend? He can't even remember.\n          \n                              ELI\n                    Sure.\n          \n          She smiles. Giggles as the rat's whiskers tickle her ear.\n          \n          Eli breaks the cheese in two and gives half to Solara. She's\n          about to eat but stops as Eli clasp his hands in prayer.\n          \n                              ELI\n                    Our father, we thank you for this\n                    meal which you have been so\n                    gracious to place before us.\n          \n          Unsure of what to do, Solara mimics Eli, putting her hands\n          together and bowing her head.\n          \n                               ELI\n                    We thank you for a warm bed and a\n                    roof over our heads on a cold night\n                    such as this.\n                        (BEAT)\n                    And we thank you for the gift of\n                    friendship in these hard times.\n          \n          Solara looks at him, touched by that.\n          \n                               ELI\n                    Amen.\n                        (BEAT)\n                    You say that last part too.\n          \n                              SOLARA\n                    Amen. And now we eat?\n          \n                              ELI\n                    And now we eat.\n          \n          They sit and eat together, sharing the simple meal.\n          \n          PULL OUT from the window as they eat, away from the theater.\n          Away from the town and its flickering points of torchlight.\n          Moving farther and farther away until the entire town is\n          consumed by the darkness of the world.\n          \n          EXT. DESERT TOWN - MAIN STREET - DAWN\n          \n          The pale sun rises over the town. To establish:\n          \n                                                                    56.\n          \n          \n          INT. PALLADIUM - DINING ROOM - MORNING\n          \n          What was once the theater's COSTUME ROOM - OLD MANNEQUINS\n          still stand around in the corners, creating an eerie feel.\n          \n          Carnegie and Claudia sit at a DINING TABLE, eating breakfast\n          in silence. A third place is set, but no-one is seated there.\n          \n          Solara enters and sits down without a word.\n          \n                              CARNEGIE\n                    Good morning, Solara.\n          \n          Solara doesn't say anything.\n          \n                              CARNEGIE\n                    I said good morning, Solara.\n          \n                              SOLARA\n                    Morning, dad.\n          \n                              CARNEGIE\n                    How was your night? Did you sleep\n                    well?\n          \n          Claudia appears perturbed by Carnegie's subtle probing.\n          Solara flashes him a frosty look.\n          \n                              SOLARA\n                    I did like you asked. Isn't that\n                    what you really want to know? Just\n                    come out and say it.\n          \n          Carnegie glares at her sternly.\n          \n                              CARNEGIE\n                    You don't speak to your father like\n                    that. When I ask you a civil\n                    question, I expect a civil answer.\n          \n          Solara lowers her head, scorned. Carnegie continues eating.\n          \n                              CARNEGIE\n                    Did he say anything?\n          \n                              SOLARA\n                    No. We didn't talk much.\n          \n                              CARNEGIE\n                    Well, do you think you managed to\n                    change his mind about staying?\n          \n                              SOLARA\n                    I don't know. He said he had to go.\n          \n                                                                 57.\n          \n          \n          Carnegie puts down his food, looks angrily at her.\n          \n                              CARNEGIE\n                    So he did talk? What else did he\n                    say? Come on, I want all of it!\n          \n                              SOLARA\n                    That's all he said. That he was\n                    going to be leaving this morning.\n          \n                              CARNEGIE\n                    We'll see. This is my town, nobody\n                    leaves until I say they leave.\n          \n          He glances knowingly at Claudia.\n          \n                              CLAUDIA\n                    Solara, honey, eat something.\n          \n          She looks at the food on the plate before her. Then closes\n          her eyes and clasps her hands in prayer.\n          \n                              SOLARA\n                    Our father, thank you for this meal\n                    which you have been so gracious to\n                    place before us.\n          \n          Claudia and Carnegie freeze. Carnegie stares at her, agape.\n          \n                              SOLARA\n                    Thank you for my mother. Please\n                    watch over her and keep her safe.\n          \n                                CARNEGIE\n                    Solara...\n          \n                              SOLARA\n                    Thank you for all the-\n          \n                                CARNEGIE\n                    Solara!\n          She snaps suddenly out of it, looks at her father.\n          \n                              CARNEGIE\n                    What the hell are you doing?\n          \n          She doesn't respond. Looks embarrassed.\n          \n                               CARNEGIE\n                    God didn't put this food on the\n                    table. Do you hear me?\n                        (BEAT)\n                    Who put this food on the table?\n          \n                                                                 58.\n          \n          \n          Solara says nothing, just looks down at the table.\n          \n                              CARNEGIE\n                    I said who put this food on the\n                    table?\n          \n                              SOLARA\n                        (SOFTLY)\n                    You did.\n          \n                              CARNEGIE\n                    Who taught you that?\n          \n                              SOLARA\n                    Eli taught me.\n          \n                              CARNEGIE\n                        (PUZZLED)\n                    Who the hell is Eli?\n          \n                              SOLARA\n                    The walker. That's his name.\n          \n                              CARNEGIE\n                    And he taught you how to say those\n                    words? How did he know them?\n          \n                              SOLARA\n                    He had them written down in a book.\n          \n          This piques Carnegie's interest greatly.\n          \n                              CARNEGIE\n                    What kind of a book?\n          \n          He barks the question at her. Solara is rattled.\n          \n                              SOLARA\n                    I don't remember! It was an old\n                    leather book. It had kind of a...\n                    thing on the front of it.\n          \n                               CARNEGIE\n                    Show me.\n          \n          Solara makes the SIGN OF A CRUCIFIX with her index fingers.\n          Carnegie's eyes widen; he can barely believe it.\n          \n                              CARNEGIE\n                    He had a bible?\n          \n                              SOLARA\n                    That's what it was. A holy bible.\n                    Daddy, what's wrong? Did I...\n          \n                                                                 59.\n          \n          \n          Carnegie BOLTS SUDDENLY FROM THE TABLE, overturning his chair\n          and sending his plate of food crashing to the floor.\n          \n          INT. PALLADIUM - LOBBY BALCONY - CONTINUOUS\n          \n          Carnegie races across the landing, toward the ARMED GUARD\n          posted outside Eli's bedroom. The guard steps aside as\n          Carnegie flings the door open and barges inside.\n          \n          INT. PALLADIUM - GUEST BEDROOM - CONTINUOUS\n          \n          Empty. No sign of Eli or his gear anywhere. The window is\n          WIDE OPEN, the curtains fluttering gently in the breeze.\n          \n          INT. ENGINEER WORKSHOP - CONTINUOUS\n          \n          His hands shaking, the engineer disconnects Eli's battery\n          from the generator and places it on the counter.\n          \n          Eli stands on the other side of the counter with his SHOTGUN\n          TRAINED RIGHT AT THE MAN'S HEAD. He takes the battery from\n          him and stuffs it into his backpack.\n          \n          EXT. PALLADIUM - CONTINUOUS\n          \n          Carnegie races from the lobby entrance and looks up at the\n          open window to Eli's room. He could have easily jumped.\n          \n          Redridge emerges onto the street behind him.\n          \n                              REDRIDGE\n                    Something wrong, boss?\n          \n                              CARNEGIE\n                    Something wrong? Something wrong?\n                    The walker's gone!\n          \n                              REDRIDGE\n                    That can't be. I had a man outside\n                    his room the whole time.\n          \n                              CARNEGIE\n                    He jumped out the window, you\n                    idiot! You didn't think to put a\n                    man outside the fucking window?\n                        (beat; fuming)\n                    Find him. Now!\n          \n                              REDRIDGE\n                    Boss, he could be anywhere. He...\n                        (REALIZATION)\n                    A battery. Didn't he say something\n                    about a battery?\n          \n                                                                  60.\n          \n          \n          They turn to face the engineer's storefront - just as ELI\n          EMERGES ONTO THE STREET, shotgun still in his hand.\n          \n          EVERYBODY FREEZES. Like a wild west stand-off. Redridge's\n          fingers play over the butt of the pistol on his hip.\n          \n          BEAT as time hangs perfectly still for a second... and then\n          ALL HELL BREAKS LOOSE.\n          \n          Redridge draws and FIRES, SHATTERING A PARKING METER just\n          inches from Eli and showering quarters all over the sidewalk.\n          \n          Eli rushes along the sidewalk, RETURNING FIRE. The shot wings\n          Redridge in the shoulder. He goes down, wounded.\n          \n          Carnegie dives for cover as FOUR MORE GUNMEN rush from the\n          theater. Carnegie waves frantically in Eli's direction.\n          \n                              CARNEGIE\n                    Go! Go!\n          \n          They spot Eli sprinting away and rush off in pursuit.\n          \n          Carnegie gets to his feet and storms back inside the theater.\n          \n          INT. PALLADIUM - DINING ROOM - CONTINUOUS\n          \n          Solara and Claudia watch through the window. Turn suddenly\n          when they hear the door slam open behind them.\n          \n          Carnegie stands in the doorway, glaring at them.\n          \n          EXT. DESERT TOWN - MAIN STREET - CONTINUOUS\n          \n          LOCAL RESIDENTS scream and rush to and fro in panic as Eli\n          darts along the boardwalk.\n          \n          CARNEGIE'S GUNMEN pursue, firing their rifles wildly on the\n          run. The bullets splinter wood, pierce barrels and crates,\n          narrowly missing Eli as he dashes, keeping his head down.\n          \n          Eli aims the shotgun and FIRES without even looking. The shot\n          HITS A GUNMAN SQUARE IN THE CHEST, dropping him to the dirt.\n          \n          Eli hits the deck, diving for cover behind a JUNKPILE as more\n          gunfire ricochets all around him. He takes a moment to\n          collect himself, reloads the shotgun.\n          \n          The three remaining gunmen close in on the junkpile warily.\n          \n          Eli signs a cross over himself with the shotgun, looks to the\n          sky and offers up a silent prayer. Then emerges from around\n          the junkpile back into the street. All three gunmen OPEN\n          FIRE, their bullets whipping past on either side of him.\n          \n                                                                 61.\n          \n          \n          In one swift motion Eli raises the shotgun and FIRES. Three\n          shots in quick succession. And then there is silence. Smoke\n          wisps from the shotgun's sawn-off barrel.\n          \n          The three gunmen LIE DEAD IN THE STREET. One hit square in\n          the chest. The other two each have maybe one half of their\n          heads remaining.\n          \n          Eli looks around. He's right at the end of the main road, the\n          perimeter where the town meets the open desert. He's free.\n          \n          And then, A GIRL'S SCREAM. Distant but unmistakable.\n          \n          Eli whips around. In the upstairs window of the theater,\n          Carnegie shoves Solara roughly against the wall. Barking\n          angrily at her, shaking her.\n          \n          Eli looks at the road. Then up at the theater. Then back to\n          the road again.\n          \n                              ELI\n                        (quietly; to himself)\n                    It ain't your concern. Stay on the\n                    path.\n          \n          But he sounds less resolute now than before. Until today this\n          was always a simple decision for him to make. But now...\n          \n                                ELI\n                    Dammit...\n          \n          He marches back toward the theater, stepping over the fallen\n          bodies of the gunmen, re-loading his shotgun as he goes.\n          \n          EXT. PALLADIUM - CONTINUOUS\n          \n          Redridge finally manages to clamber back up to his feet,\n          wincing as he clutches his painful shoulder wound.\n          \n          He looks up just in time to see Eli coming right at him.\n          Without breaking stride, he COLD-COCKS Redridge in the jaw\n          with the shotgun, sending him back to the deck, out cold.\n          \n          INT. PALLADIUM - DINING ROOM - CONTINUOUS\n          \n          Eli kicks the door wide open, finds Carnegie holding Solara\n          against the wall. She sobs, terrified. Eli levels the shotgun\n          at Carnegie's head.\n          \n                              ELI\n                    Let her go.\n          \n                                                                 62.\n          \n          \n                              CARNEGIE\n                    That cannon of yours casts a pretty\n                    wide net. I don't reckon you can\n                    hit me without hitting her.\n          \n                              ELI\n                    I reckon you're right.\n          \n          He holsters the shotgun. Then in the same fluid motion draws\n          a PISTOL from his belt that we never even knew he had.\n          \n                              ELI\n                    This, though? With this I'll shave\n                    the hairs clean off your balls at a\n                    hundred paces. You believe me?\n          \n          Carnegie releases his grip on Solara, steps away, hands up.\n          \n                              CARNEGIE\n                    I believe you. I have to say I'm\n                    surprised to hear that language\n                    coming from you, though. I mean,\n                    you being a holy man and all.\n          \n          BEAT. Eli glances at Solara.\n          \n                               CARNEGIE\n                    She told me all about it. Told me\n                    all about the bible, too.\n                        (BEAT)\n                    Can I see it?\n          \n                              ELI\n                    No.\n          \n          Carnegie takes a small step forward. Suddenly, his whole\n          demeanor changes, and he now looks at Eli imploringly.\n          \n                              CARNEGIE\n                    You know, I've been searching for a\n                    book like that one for years. All\n                    I've ever wanted was to bring the\n                    word of God to these poor\n                    unfortunates here. To shine its\n                    light upon them and give them\n                    something in this wretched world\n                    that they could believe in.\n                    Something to live for! It's why I\n                    built this town, did you know that?\n                    All we've been missing is the word\n                    to show us the way. And now, praise\n                    the Lord, you've brought it to us.\n          \n                                                                 63.\n          \n          \n          Carnegie takes a step closer. He appears entirely sincere -\n          but then he is very good at doing so.\n          \n                              CARNEGIE\n                    It's not right to keep that book\n                    hidden away, all to yourself. The\n                    word is meant to be shared with\n                    others. It's meant to be spread!\n                    Isn't that what you want? I could\n                    help you do that. You and me, we\n                    could do it together.\n          \n          BEAT. Eli seems to be considering what he's heard carefully.\n          \n                              ELI\n                    The Lord himself told me that if I\n                    carried this book west, one day I\n                    would find the place where it was\n                    needed. Where it would be safe.\n                    Where it belonged.\n          \n          Carnegie smiles broadly... and then with a sudden blur of\n          movement Eli PISTOL-WHIPS him to the floor.\n          \n                              ELI\n                    But this ain't it.\n          \n          He turns to Solara and offers her his hand.\n          \n                               ELI\n                    Come on.\n          \n          EXT. PALLADIUM - CONTINUOUS\n          \n          Eli emerges from the theater, leading Solara onto the street.\n          RESIDENTS part before them, staring at Eli with astonishment.\n          \n          Eli passes the statue of Carnegie - and STOPS. Something\n          about that thing is bothering him.\n          \n                              SOLARA\n                    What? What is it?\n          \n                              ELI\n                    You shall not make for yourself any\n                    graven image...\n          \n          He turns, drawing his samurai sword and in the same fluid\n          motion SLICING across the base of the statue.\n          \n          BEAT. And then the STATUE TOPPLES from the neat cut just\n          below the knees, CRASHING DOWN to the ground and SHATTERING.\n          The assembled residents GASP at this defiant display.\n          \n                                                                    64.\n          \n          \n          Eli sheathes his sword and takes Solara by the hand again.\n          \n                              ELI\n                    Now we can go.\n          \n          CRANE UP over the main street as they both head out of town.\n          \n          EXT. ROAD - DAY\n          \n          The town barely visible on the distant horizon behind Eli and\n          Solara. Eli walks as he always has, his pace steady and slow.\n          Still, Solara lags along behind. She's already tired.\n          \n                              SOLARA\n                    Where are we going?\n          \n                              ELI\n                    I told you where I'm going. You're\n                    free to go wherever you want.\n          \n          She stops in the road.\n          \n                              SOLARA\n                    Wait... I'm not coming with you?\n          \n                              ELI\n                    You're only going to slow me down.\n          \n          Eli doesn't stop walking. Solara is forced to catch up.\n          \n                              SOLARA\n                    So what the hell was all that about\n                    back there?\n          \n                              ELI\n                    The man was hurting you. I don't\n                    like that, so I put a stop to it.\n                    Now you're free. He can't hurt you\n                    any more.\n                        (off her stare)\n                    No need to thank me.\n          \n                              SOLARA\n                    Thank you? For what? What am I\n                    supposed to do now?\n          \n                              ELI\n                    Whatever you want. That's what\n                    being free is.\n          \n                              SOLARA\n                    Whatever I want. Except go with\n                    you.\n          \n                                                                   65.\n          \n          \n                              ELI\n                    I have to get where I'm going. I\n                    can't be worrying about someone\n                    else along the way.\n          \n          Solara is incredibly hurt by this. Blinks back a tear.\n          \n                              SOLARA\n                    I thought you were my friend.\n          \n          BEAT. Eli stops and turns back to face her.\n          \n                              ELI\n                    It's dangerous in the outland. I\n                    wouldn't want you to get hurt.\n          \n                              SOLARA\n                    I'll be safe so long as I'm with\n                    you. I know it.\n          \n          Eli sighs. He's not getting through to her. So now comes the\n          harsh truth of it:\n          \n                              ELI\n                    You don't want this life. I gotta\n                    do what I gotta do. Don't have no\n                    choice in it. But you do. And I\n                    can't let you choose this. You\n                    don't want to be like me. You don't\n                    want to spend your life alone.\n          \n          Solara steps closer, her eyes pleading.\n          \n                              SOLARA\n                    If I came with you, I wouldn't be\n                    alone. And neither would you.\n          \n          A long BEAT as Eli considers this. For a moment it appears as\n          though Solara might have won him over. But then:\n          \n                              ELI\n                    I'm sorry. Look, maybe it's best\n                    you just go on back to town.\n          \n          He turns and walks off, leaving her in the road. She stands\n          there, furious, screaming at his back as he walks away.\n          \n                              SOLARA\n                    Fine! I'll do just that! I had a\n                    life there! A family! I didn't ask\n                    you to save me! I didn't ask you\n                    for anything!\n          \n                                                                 66.\n          \n          \n          He doesn't turn or acknowledge her at all. Just keeps walking\n          off into the horizon. Getting smaller all the time.\n          \n          Solara stands there in the road, weeping. All alone.\n          \n                              SOLARA\n                        (SOFTLY)\n                    Fine.\n          \n          She turns and walks back in the direction she came.\n          \n          EXT. DESERT TOWN - BARNYARD - DAY\n          \n          A small, penned-in area to the rear of the Palladium\n          containing an eclectic bunch of farmyard animals. Goats,\n          sheep, geese, pigs. Mostly mangy, sad-looking specimens.\n          \n          Carnegie stands in the yard, tossing handfuls of animal feed\n          from a nearby sack onto the ground. He watches with\n          satisfaction as the animals gather at his feet to feed.\n          \n          Claudia emerges from the theater with an ice-pack.\n          \n                              CARNEGIE\n                    Thank you, darling.\n          \n          Carnegie applies it to his jaw, red and swollen from Eli's\n          pistol-whip. Redridge appears nearby, his arm in a sling.\n          \n                              REDRIDGE\n                    He killed four of my men and walked\n                    out of town without a scratch. They\n                    shot off a hundred rounds at him\n                    and he didn't get hit once. I never\n                    even heard of anything like that.\n          \n          Carnegie doesn't appear to be listening. He is lost in a\n          world of his own as he tends to the farm animals.\n          \n                              CARNEGIE\n                    You know, I always thought of\n                    myself as a shepherd. Bringing\n                    together the wayward and the lost.\n                    Tending to my flock. But all the\n                    things I want to do, I can't do\n                    them on my own. The one thing I've\n                    needed is the one thing that's\n                    always been missing. Then one day\n                    it walks right into town - so close\n                    I can almost touch it - and then\n                    walks right on out again.\n          \n          Carnegie finally looks up from his animals, at Redridge.\n          \n                                                                 67.\n          \n          \n                              CARNEGIE\n                    I want you to put a crew together\n                    and go out after him.\n          \n                              REDRIDGE\n                    He's not going to work for you. I\n                    think he's made that plain.\n          \n                              CARNEGIE\n                    I'm not interested in him any more.\n                    I only want the book he's carrying.\n          \n                              REDRIDGE\n                    If I'm gonna risk my ass hunting\n                    down this maniac in the outland, I\n                    need to know it's gonna be worth\n                    it. I need to know what's so\n                    special about this goddamn book.\n          \n          BEAT as Carnegie considers this.\n          \n                              CARNEGIE\n                    You have no idea. You're too young,\n                    you don't remember the world\n                    before. But I do. I remember.\n          \n          He turns back to his animals, summoning up old memories.\n          \n                               CARNEGIE\n                    When I was a kid my parents used to\n                    read that book every goddamn day.\n                    My mother, she'd read it along with\n                    this smooth-talking preacher on the\n                    TV screen. They used to be able to\n                    beam these guys right into your\n                    house, into every house in the\n                    world, through the air. Like magic.\n                        (BEAT)\n                    She worked two jobs and she sent\n                    every spare penny she had to that\n                    fucking guy on the TV. My old man,\n                    he'd read that book, then he'd get\n                    liquored up and kick my ass, tell\n                    me all about the power and the\n                    glory and how I was going to burn\n                    forever in hell for the sins I was\n                    born with. He made sure he beat it\n                    into me good.\n          \n          He snaps out of his reverie and looks at Redridge.\n          \n                              CARNEGIE\n                    Don't you see? It's not just any\n                    book.\n                              (MORE)\n          \n                                                                 68.\n          \n                               CARNEGIE (cont'd)\n                    It has the power to motivate\n                    people. It can give them hope, it\n                    can terrify them. It can shape\n                    them. Control them.\n                        (BEAT)\n                    Do you remember how I built this\n                    town? It wasn't done with force,\n                    and it wasn't done just with water.\n                    It was done with the power of\n                    words. I created this place out of\n                    nothing, because people believed in\n                    a promise that I sold to them.\n                    Those guys on the TV, they were\n                    richer than you could ever dream,\n                    and it was all built the same way.\n                    With words. With promises. And with\n                    that book.\n                        (BEAT)\n                    That book is a weapon. Aimed right\n                    at the hearts and minds of the weak\n                    and the desperate. Just imagine\n                    what I could do with it.\n          \n                              REDRIDGE\n                    Boss... we're running out of water\n                    and the people are running out of\n                    patience. You're trying to tell me\n                    that a book is going to keep them\n                    in line?\n          \n                              CARNEGIE\n                    Oh, it'll do much more than that.\n                    The water in this town may run dry,\n                    but faith - that springs eternal!\n                    And that faith will help turn this\n                    town into a city. And this city\n                    into a nation. It will help me\n                    build a new world. In my image.\n                    People will come from far and wide\n                    to hear what's inside of it.\n                    They'll follow me anywhere just to\n                    get a taste of it. And they'll do\n                    whatever I tell them.\n          \n          As usual, Carnegie's slick rhetoric has worked - Redridge has\n          totally bought into it. Claudia, however, looks appalled.\n          \n                               REDRIDGE\n                    And what if this book don't work?\n                    What if it don't say what you want\n                    it to say?\n          \n                                                                 69.\n          \n          \n                               CARNEGIE\n                    Oh, it'll say what I want, I can\n                    promise you that. Because I'm going\n                    to rewrite it. I'll keep the parts\n                    that work for me and make the rest\n                    whatever I need it to be.\n                        (BEAT)\n                    A new bible, for a new world.\n          \n          He reaches out and takes Claudia by the hand.\n          \n                              CARNEGIE\n                    What do you think, darling? A whole\n                    new world, to do with as we will.\n                    Won't that be grand?\n          \n          She smiles halfheartedly, but it's clear she is mortified.\n          \n          Carnegie turns back to Redridge.\n          \n                              CARNEGIE\n                    Find that book.\n          \n                              REDRIDGE\n                    He has half a day on us already.\n          \n                              CARNEGIE\n                    So use the motor pool.\n          \n                              REDRIDGE\n                    There ain't much gas in reserve.\n          \n                              CARNEGIE\n                    Whatever there is, use it.\n          \n          Redridge nods and goes to leave.\n          \n                              CLAUDIA\n                    What about Solara?\n          \n          BEAT. In all this excitement about the book, she had been\n          completely forgotten about.\n          \n                              CLAUDIA\n                    She's still out there. With him.\n          \n                              CARNEGIE\n                    Right. Right. Of course. Bring her\n                    back, too, if you can. But-\n          \n                              REDRIDGE\n                    The book. I know.\n          \n                                                                    70.\n          \n          \n          Redridge turns and leaves. Claudia scowls at Carnegie, but he\n          doesn't even notice, just goes back to feeding his animals.\n          \n          EXT. DESOLATE ROAD - DAY\n          \n          Solara wanders the road. She's tired. The sun beats down\n          mercilessly. Nothing but desolation and wasteland all around.\n          \n          She comes to a FORK IN THE ROAD. Stops at the junction,\n          unsure. Was this here before? She doesn't remember.\n          \n          There are no signs. Both paths look the same. Which one is\n          which? She turns and looks back, looks around. She's lost.\n          \n                              SOLARA\n                    Shit. Shit.\n          \n          She alternates her finger between the two paths. Eeny-meeny-\n          miney-moe. Picks a path and follows it, headed down the road.\n          \n          EXT. ROAD - DAY\n          \n          Eli walks on. Slow and steady. His gaze, as ever, fixed\n          firmly on the horizon. Takes a swig from his canteen.\n          \n          Suddenly, he STOPS and stands stock still in the center of\n          the road. Impossible to know what he's thinking.\n          \n          He stands there for a long time.\n          \n          EXT. WASTELAND GAS STATION - DAY\n          \n          Solara comes upon an abandoned CHEVRON STATION. She doesn't\n          remember passing this. Looks back up and down the road.\n          \n                              SOLARA\n                    Where the hell am I?\n          \n          There's a RUSTED CAR parked at one of the pumps. Like every\n          other car we've seen, stripped of its tires and engine.\n          \n          She walks around to the driver's side. A PETRIFIED FEMALE\n          BODY lies on the ground, half-in, half-out of the car.\n          \n          Solara claps her hand to her mouth and recoils, horrified.\n          \n          In the dead woman's hand is a dusty bottle of MINERAL WATER.\n          Solara hesitates. Not wanting to get closer. But so thirsty.\n          \n          She braces herself, grimacing, and tries to take the bottle,\n          but the dead woman's hand is closed tight around it. She\n          pulls harder and wrenches it free. In the process she falls\n          on her butt and flips the corpse over onto its back.\n          \n                                                                  71.\n          \n          \n          In the other woman's arm, she has a SKELETAL BABY cradled to\n          her bosom. It seems to be staring right at Solara.\n          \n          Solara SCREAMS and frantically shuffles backward away from\n          it. Gets to her feet and runs across the forecourt.\n          \n          She stops by the station shop and rests against the wall,\n          hyperventilating, heart pounding. Trying to get it together.\n          \n          She inspects the water in the bottle. It looks clean.\n          Unscrews the cap with shaking hands and takes a sip.\n          \n          She SPITS IT BACK OUT, coughing. It's rank. Undrinkable.\n          \n          INT. WASTELAND GAS STATION - FOOD COURT - DAY\n          \n          Solara enters. Gloomy inside. Comprehensively looted. Empty\n          shelves coated in thick sheets of dust.\n          \n          She moves further in, searching for something, anything. But\n          the place has been gutted. There's nothing. She checks the\n          wall of dead refrigerators. Shattered glass, all empty.\n          \n          She's never known desolation and emptiness like this. It's\n          beginning to scare her. She wheels around in a panic.\n          \n                              FEMALE VOICE (O.S.)\n                    Hello?\n          \n          Distant, calling from outside. Solara hears it and freezes.\n          \n                              FEMALE VOICE (O.S.)\n                    Hello? Can anyone help me?\n          \n          EXT. WASTELAND GAS STATION - CONTINUOUS\n          \n          She runs out across the forecourt, onto the road.\n          \n          A FEMALE FIGURE is hunched by the side of the road about\n          fifty yards up ahead. Hard to see what she's doing from here.\n          \n                              SLUMPED FEMALE\n                    Hello? Is anybody there?\n          \n          Solara starts walking toward her.\n          \n          The woman has her back to Solara. She's on her knees,\n          muttering to herself. Gathering objects up from the road.\n          \n          As Solara moves closer, we see that the woman is struggling\n          with an UPTURNED SHOPPING CART. Stuck in a roadside ditch,\n          its contents spilled out next to a few BRACKEN BUSHES.\n          \n                                                                   72.\n          \n          \n          We see her face now. It's the SAME YOUNG WOMAN from before.\n          The same shopping cart. The same trap.\n          \n                                SOLARA\n                      Are you all right?\n          \n          The woman looks around, sees Solara standing nearby. She's\n          shocked to see that it's a girl.\n          \n                                YOUNG WOMAN\n                      Oh. Yes, I'm fine. Thank you. You\n                      go along, I'll be okay.\n          \n                                SOLARA\n                      You look like you need some help.\n          \n                                YOUNG WOMAN\n                      No, really! I'm fine. Really... I\n                      need a man to help. Not you. You\n                      just keep along. Please.\n          \n          The woman seems anxious to get rid of her. Tries to indicate\n          the threat silently with her eyes, but Solara doesn't get it.\n          \n                                SOLARA\n                      It'll just take a minute.\n          \n          She steps into the ditch and starts to haul the cart out.\n          \n                                YOUNG WOMAN\n                      Really, it's fine! Please!\n          \n          Too   late. THREE ROAD BRIGANDS POUNCE FROM THE BUSHES. Every\n          bit   as brutish and horrifying as the group that Eli killed on\n          the   road in our opening. They grab Solara and drag her from\n          the   road into the desert, screaming and kicking all the way.\n          \n                                YOUNG WOMAN\n                      Let her go! She ain't got nothing!\n          \n          The BRIGAND LEADER looks Solara up and down lustfully.\n          \n                                BRIGAND LEADER\n                      I ain't too sure about that.\n          \n          Solara is reviled by the man. He's filthy, his stench\n          overpowering. One eye missing, just a dark, empty socket. He\n          licks his lips, revealing a mouth almost devoid of teeth.\n          \n                                YOUNG WOMAN\n                      This wasn't the deal!\n          \n          The brigand leader lashes out and grabs her by the throat.\n          \n                                                                    73.\n          \n          \n                              BRIGAND LEADER\n                    Shut your mouth, bitch. You oughta\n                    be grateful you're getting a break.\n          \n          He releases her. She slumps to the dirt, whimpering.\n          \n                              BRIGAND LEADER\n                    Never did care much for that dried-\n                    up old snatch anyhow.\n          \n          He looks back to the struggling Solara.\n          \n                              BRIGAND LEADER\n                    This one, though... this one looks\n                    fresh. You a virgin?\n          \n          She says nothing, just sobs helplessly.\n          \n                              BRIGAND LEADER\n                    Well, let's find out.\n          \n          He unbuckles his pants, lets them drop to his ankles.\n          \n          We hear a sound. It's hard to place. Something like a THHUP.\n          \n          The brigand leader is frozen in shock. His face goes pale,\n          the blood draining from it. The two bandits holding Solara\n          look at their leader in dismay. Staring down at his crotch.\n          \n          A quiet whimper escapes from his lips as he looks down.\n          \n          There is an ARROW IMBEDDED IN HIS CROTCH. What was once down\n          there is now just a bloody mess of mangled meat. More blood\n          streams down his thighs. A real horror show.\n          \n          He staggers backward, shrieking. Hands shaking. Staring down\n          at the awful wound from which the long arrow shaft extends.\n          \n          The two other brigands release Solara and whip around,\n          scanning the horizon. They see nothing. One of them has a\n          RIFLE. He unslings it and aims it frantically around.\n          \n          Then they both see it. Coming right at them. The most\n          terrifying thing either has ever seen.\n          \n          ELI, WALKING TOWARD THEM FROM THE ROAD, OUT OF THE SUN. His\n          silhouette distorted in the rippling heat. An avenging angel.\n          \n          He pulls another arrow and draws it back as the rifle bandit\n          trains his weapon on him, finger tightening on the trigger.\n          \n          Eli SHOOTS. The arrow sails through the air and RIGHT INTO\n          THE RIFLE BARREL. The feathers at the end of the shaft\n          plugging the muzzle tight.\n          \n                                                                  74.\n          \n          \n          Rifle bandit pulls the trigger. The gun EXPLODES, BLOWING HIS\n          HANDS CLEAN OFF. He falls to the ground, screaming.\n          \n          Eli only had two arrows. He shoulders the bow and draws his\n          sword. All the remaining brigand has is a small knife. The\n          two now square off at arm's length. A hopeless mismatch.\n          \n          BEAT. The knife brigand hesitates, trembling. And then RUSHES\n          ELI WITH THE KNIFE. Eli deftly sidesteps, flourishes the\n          sword. So quick it almost seems like he didn't move at all.\n          \n          The knife bandit staggers forward a couple more steps. His\n          hand goes limp and drops the knife.\n          \n          And then his HEAD FALLS BACKWARD like a Pez dispenser. Almost\n          completely decapitated, but not quite. Blood fountains from\n          the neck stump as his body falls to the dirt.\n          \n          Eli moves to the other two bandits who lay horribly wounded\n          on the ground, but still breathing. He stands over their\n          fallen bodies. They stare back up at him, helpless.\n          \n          He crouches down between them in the dust.\n          \n                              ELI\n                    I offer you both one final chance\n                    in this life to seek forgiveness\n                    for your sins so that your souls\n                    may find salvation. Will you say\n                    with me the act of contrition?\n          \n          The brigand leader defiantly spits blood at him.\n          \n                                BRIGAND LEADER\n                    Fuck you.\n          \n          Eli sighs. Stands and looks down on him without pity.\n          \n                              ELI\n                    Some might think it'd be most\n                    fitting to leave you here like\n                    this. Let you die slow in the sun.\n                    But I know better. I know where\n                    you're going. And the sooner you\n                    get there, the sooner you'll get\n                    what's coming to you.\n          \n          He plunges his sword into the bandit leader, finishing him\n          off. Pulls the arrow from his crotch and wipes it clean.\n          \n          He turns to the other man, raising his sword.\n          \n                                RIFLE BANDIT\n                    Wait!\n          \n                                                                   75.\n          \n          \n          Eli pauses, sword hovering over him, poised to strike.\n          \n                              RIFLE BANDIT\n                    I want to say it. I want to be\n                    forgiven.\n          \n          Eli crouches once more by his side.\n          \n                              ELI\n                    Repeat after me. Oh God, I am\n                    heartily sorry for having offended\n                    thee, and I detest all my sins.\n          \n          The bandit follows along with Eli, mouthing the words\n          quietly. The life ebbing from him with each moment.\n          \n                              ELI\n                    I firmly resolve, with the help of\n                    thy grace, to confess my sins, and\n                    do penance, and to amend my life.\n                    Amen.\n          \n                              RIFLE BANDIT\n                    Amen...\n          \n          His eyes roll back as his final breath leaves him. Dead. Eli\n          signs a cross over his body, then stands and walks away.\n          \n          Solara sits on the ground nearby, a wreck. Eli approaches and\n          gathers her up in his arms. She clings on to him tightly.\n          \n                              SOLARA\n                    You came back for me.\n          \n                              ELI\n                    What are friends for?\n          \n          She laughs, a tear rolling down her cheek. Grips him tighter.\n          \n          He helps her up and escorts her back to the road.\n          \n                              ELI\n                    This is the deal. You keep up. You\n                    pull your weight. You fall behind,\n                    I can't help you. Okay?\n          \n                              SOLARA\n                    Okay.\n          \n          She looks back at the young woman still slumped in the dirt.\n          \n                              SOLARA\n                    What about her?\n          \n                                                                    76.\n          \n          \n                              ELI\n                    There's nothing can be done for\n                    her.\n          \n          They walk on down the road.\n          \n          EXT. DESERT TOWN - MAIN STREET - DAY\n          \n          METAL GARAGE DOORS roll back to reveal darkness within.\n          \n          A PAIR OF HEADLIGHTS fires up. Full beam right at us.\n          \n          A VEHICLE roars out of the darkness onto the street. Heavily\n          modified with plate armor and turret-mounted weapons. But its\n          original form still recognizable underneath.\n          \n          It's a HONDA ODYSSEY minivan. Once the #1 choice of soccer\n          moms, transformed now into an armored personnel carrier.\n          \n          Another minivan roars from the garage behind it. A DODGE\n          GRAND CARAVAN, similarly customized and armed to the teeth.\n          \n          THREE MORE CARS follow. As eclectic an assortment as you\n          could imagine. A MINI COOPER. FORD EXPLORER. A PRIUS. Each\n          adorned with plate armor and weapons.\n          \n          In the lead Minivan is REDRIDGE, heavily armed. He nods to\n          the DRIVER, who guns the engine.\n          \n          The fleet of armored vehicles moves out, kicking up a great\n          funnel of dust in their wake as they roar out of town.\n          \n          EXT. DESERT - DAY\n          \n          Late afternoon. The sun hangs low on the horizon. We're far\n          from the road. Nothing but scrub brush and a few PRAIRIE DOG\n          BURROWS dotted around.\n          \n          A PRAIRIE DOG pops its head up, scans the horizon. Sniffing\n          the air, whiskers twitching... and is SKEWERED BY AN ARROW.\n          \n          Thirty yards away, one of the pieces of scrub brush appears\n          to COME ALIVE. And then we realize it is Eli's GHILLIE SUIT,\n          camouflaging both he and Solara beneath it.\n          \n          Eli casts off the camouflage net and walks toward the dead\n          prairie dog. Solara just stands there, appalled.\n          \n                              SOLARA\n                    You killed it! That cute little\n                    thing!\n          \n          Eli picks up the dead animal by the scruff.\n          \n                                                                    77.\n          \n          \n                              ELI\n                    It's good eating, is what it is.\n          \n          He yanks out the bloody arrow. Solara looks away.\n          \n          When she turns back, Eli is standing right there, holding the\n          dead animal in front of her face. She YELPS in surprise and\n          staggers backward, falling on her butt.\n          \n                              SOLARA\n                    That's not funny.\n          \n                              ELI\n                    If you're going to be on the road,\n                    you can't be picky about what you\n                    eat. You eat what's there to eat.\n          \n                              SOLARA\n                    I'm not eating that.\n          \n                              ELI\n                        (SHRUGS)\n                    More for me.\n          \n          EXT. WASTELAND CAVE - DUSK\n          \n          Eli and Solara sit in the mouth of a desert cave, around a\n          flickering campfire. The prairie dog roasts on a spit.\n          \n          Eli digs his knife into the carcass, the blade comes out\n          clean. It's done. He clasps his hands together and gazes down\n          penitently at the ground.\n          \n                              ELI\n                    Father, we thank you for your\n                    generosity in providing us with\n                    this meal. Bless this food to our\n                    use and us to thy service, and keep\n                    us ever mindful of the needs of\n                    others. Amen.\n          \n          Eli carves off a piece of meat. Juicy and succulent. He bites\n          into it, teasing Solara by making a show of how good it\n          tastes. He feeds a piece to the rat perched on his shoulder.\n          \n          Solara tries to appear uninterested, but she's starved.\n          \n                              SOLARA\n                    What does that taste like?\n          \n          He takes another bite, thinks on this as he chews.\n          \n                              ELI\n                    Tastes like chicken.\n          \n                                                                 78.\n          \n          \n          She tries to fight the temptation to try it... but she can't.\n          She reaches out and tears off a piece. Sniffs at it, takes a\n          small bite... then quickly wolfs down the rest. Eli smiles.\n          \n          As she eats, she gestures toward Eli's Saint Christopher.\n          \n                              SOLARA\n                    What is that?\n          \n          Eli reaches up and touches his hand to it.\n          \n                              ELI\n                    It's a Saint Christopher medal.\n          \n                              SOLARA\n                    Who's Saint Christopher? Is he a\n                    character from your book?\n          \n          Eli smiles and shakes his head.\n          \n                              ELI\n                    Christopher was a man who lived a\n                    long time ago. He wanted to be a\n                    good man, he wanted to help people.\n                    So he would stand by a river that\n                    had no bridge and carry people\n                    across. He was a big strong man and\n                    there was no one he couldn't carry.\n          \n          Solara listens, rapt. Eli is a good storyteller.\n          \n                              ELI\n                    Then one day a young child came to\n                    the river and asked to be carried\n                    across. Christopher tried to carry\n                    him but he was too heavy. He was\n                    just a small boy but he was heavier\n                    than any man he had ever carried.\n                    The boy explained that he was the\n                    son of God, and that he was so\n                    heavy because he bore all the sins\n                    of the world. After that,\n                    Christopher was able to carry him\n                    across and when they got to the\n                    other side the boy baptized him in\n                    the river. And that's how he became\n                    a saint. Later on, he was known as\n                    the patron saint of travelers.\n          \n                              SOLARA\n                    What is a saint, anyway?\n          \n                                                                 79.\n          \n          \n                              ELI\n                    It's someone who spent their life\n                    doing good things for others.\n                    Enough that God himself took a\n                    special interest in them.\n          \n          Solara looks at Eli tenderly, with admiration.\n          \n                              SOLARA\n                    Someone like you.\n          \n          Eli looks away, down at the ground. He appears sad.\n          \n                              ELI\n                    No. Not like me. Saints ain't\n                    killers. And I done too much of\n                    that. Spilled too much blood.\n          \n          BEAT. No words, just the flickering firelight.\n          \n                              SOLARA\n                    Will you read me some more from the\n                    book?\n          \n                              ELI\n                    It's late. You should get some\n                    sleep. Maybe tomorrow.\n          \n          LATER - NIGHT\n          \n          The fire down to its last embers. Eli sleeps next to his\n          pack, half-hidden in the looming shadows of the cave. His hat\n          and goggles hung up for the night on the hilt of his sword.\n          \n          Solara sleeps nearby... then opens her eyes. Not asleep after\n          all. She looks over at Eli - his face hidden in shadow and so\n          impossible to tell if he's asleep or awake.\n          \n                              SOLARA\n                    Eli?\n          \n          No response. Quietly, she moves forward, kneeling by his\n          side. She opens his coat and checks the pockets. Empty.\n          \n          She goes deeper, peeling back the layers of clothing,\n          stealthily frisking him. She finds something on his lapel,\n          hidden under several layers, that causes her to stop.\n          \n          It's a RECTANGULAR PLASTIC BADGE. The red, white and blue\n          colors faded and worn. It reads:\n          \n                               WELCOME TO WAL-MART\n                                 MY NAME IS \"ELI\"\n                               HOW MAY I HELP YOU?\n          \n                                                                  80.\n          \n          \n          She stares at it for a moment, not knowing what to make of\n          it. Then moves on, continuing to pat him down.\n          \n          Whatever she's looking for is not here. She turns her\n          attention to the backpack. Slowly, carefully, opens it up.\n          \n          There it is. THE BIBLE, wrapped carefully in its neat little\n          package of cloth and twine. She reaches in for it.\n          \n          Suddenly, ELI'S HAND SHOOTS OUT AND GRABS HER BY THE WRIST.\n          She cries out, startled. Eli sits up, his face just a dark\n          shape in the shadows. For the first time he appears a little\n          scary to Solara.\n          \n                              ELI\n                    What are you doing?\n          \n                              SOLARA\n                    You scared me! I thought you were\n                    asleep.\n          \n                              ELI\n                    On the road you sleep with one eye\n                    open. I asked you what you were\n                    doing.\n          \n                              SOLARA\n                    I just wanted to see the book.\n          \n                              ELI\n                    You want to see the book, you ask\n                    me. Nobody touches it but me. Ever.\n                    Until it gets where it's going. Do\n                    you understand?\n          \n          He's very forceful. She nods, a little afraid of him.\n          \n                              ELI\n                    Tell me you understand!\n          \n          He grips her wrist tighter.\n          \n                              SOLARA\n                    Okay! I understand! Ow!\n          \n          Eli releases her wrist. Takes the pack from her and closes it\n          up. Pulls it closer to him and lies back down.\n          \n                              ELI\n                    It's no use to you anyway. You\n                    don't know how to read it.\n          \n                                                                 81.\n          \n          \n                              SOLARA\n                    Well... now we have the time, maybe\n                    you can teach me.\n          \n                              ELI\n                    Maybe. Get some sleep.\n          \n          She lies back down beside him, but doesn't close her eyes.\n          She just lies there, watching him.\n          \n          EXT. WASTELAND - DAWN\n          \n          The sun rises out of the east. And out of the sun comes the\n          FLEET OF ARMORED VEHICLES. Racing side-by-side down the road.\n          \n          The lead vehicle comes to a halt. A door opens and Redridge\n          gets out. MORE ARMED MEN emerge from the other vehicles and\n          follow him as he marches into the wasteland by the roadside.\n          \n          The DEAD BRIGANDS are splayed out in the dirt where Eli slew\n          them. A FLOCK OF BUZZARDS is picking their bones clean.\n          \n                              REDRIDGE\n                    He's been here.\n          \n          Redridge looks at the footprints in the dirt headed from the\n          bodies and back onto the road. Two sets of tracks.\n          \n                              REDRIDGE\n                    The girl's with him.\n          \n          He moves back to the cars.\n          \n                                REDRIDGE\n                    Move out!\n          \n          The other men hold for a moment, still looking at the half-\n          eaten bodies in the dirt. Redridge turns back.\n          \n                              REDRIDGE\n                    I said move out!\n          \n                              CARNEGIE GUNMAN\n                    I heard this guy's protected\n                    somehow, some... power from up\n                    above. That there ain't nothing on\n                    this earth can touch him.\n          \n                              REDRIDGE\n                    He's just a man. You put a bullet\n                    in him, he'll go down like any\n                    other. I don't want to hear no more\n                    of this superstitious horseshit!\n          \n                                                                 82.\n          \n          \n          Hesitantly, they make their way back to the vehicles. The\n          cars gun their engines and move on down the road, past the\n          abandoned Chevron station. Dust pluming in their wake.\n          \n          EXT. ROAD - DAY\n          \n          Eli and Solara walk together, passing by a few burned-out\n          buildings. It appears we might be headed toward a town.\n          \n          Solara looks up at the sweltering sun. Then around at her\n          surroundings. Nothing but devastation and decay.\n          \n                              SOLARA\n                    You say you've been walking for\n                    twenty-five years. Have you ever\n                    considered that you might be lost?\n          \n                                 ELI\n                    No.\n          \n                              SOLARA\n                    But how can you know? How can you\n                    know this is the right way?\n          \n                              ELI\n                    I told you. My path has been laid\n                    out before me.\n          \n                              SOLARA\n                    Yeah, but laid out by who?\n          \n                              ELI\n                    By Almighty God.\n          \n                              SOLARA\n                    Well if this God guy's so mighty,\n                    how come it's taking you so long to\n                    get where you're going? Doesn't he\n                    know the way?\n          \n          Eli wheels around and jabs a scolding finger at her.\n          \n                              ELI\n                    You want to stay on this road with\n                    me, don't ever let me hear you take\n                    his name in vain like that again.\n          \n          Solara is surprised by the severity of his reaction.\n          \n                                 SOLARA\n                    Sorry.\n          \n          Eli resumes walking.\n          \n                                                                  83.\n          \n          \n                              ELI\n                    God has a reason for everything\n                    being the way it is. It's not\n                    always apparent to us. But it is\n                    his plan nonetheless.\n          \n                              SOLARA\n                    So, is he talking to you right now?\n                    Telling you where to go?\n          \n                              ELI\n                    It's not like that. It's kinda hard\n                    to explain. I'm guided by faith.\n          \n                              SOLARA\n                    I don't know what that word means.\n          \n          BEAT as Eli thinks on how to explain it.\n          \n                              ELI\n                    It means you know something even\n                    though you don't know it.\n          \n          Solara thinks about this, shakes her head.\n          \n                              SOLARA\n                    That doesn't make any sense at all.\n          \n                              ELI\n                    It doesn't have to.\n          \n          They walk on.\n          \n          EXT. HOUSE - DAY\n          \n          On the outskirts of a small town that lies in ruins. Almost\n          every building burned or reduced to rubble.\n          \n          Except for one SMALL HOUSE. The building is damaged and worn\n          but in mostly decent condition. It stands out among its\n          surroundings for being the only structure still intact.\n          \n          The windows are BARRED. The outer structure fortified with\n          SHEET METAL and other custom patch-ups. The whole plot\n          surrounded by a CHAIN-LINK FENCE TOPPED WITH RAZOR WIRE.\n          \n          Eli and Solara crouch behind a pile of rubble nearby.\n          \n                              SOLARA\n                    I don't get it. It looks almost...\n                    normal. Like nothing ever happened.\n                    How can it still be out here?\n          \n                                                                  84.\n          \n          \n                              ELI\n                    I don't know.\n          \n                              SOLARA\n                    Maybe we should look inside. There\n                    might be food.\n          \n          BEAT as Eli considers. Then stands and unhooks his shotgun.\n          \n                              ELI\n                    Stay behind me.\n          \n          They approach the house cautiously. Arrive at the perimeter\n          fence. There's a gate held in place by a PADLOCK.\n          \n          Eli pulls a pair of BOLT-CUTTERS from his belt and snips the\n          padlock free. Swings open the gate with a metallic SQUEAK.\n          \n          They move inside, up the garden path. Though the soil in the\n          yard is dead, it's been carefully raked and tended. WEEDS\n          arranged in thoughtful patterns, like real flowers.\n          \n                              SOLARA\n                    This is weird.\n          \n                              ELI\n                    Yeah.\n          \n          Eli steps forward, his foot planting on a CRACKED PAVING\n          STONE that shifts almost imperceptibly under his feet.\n          Accompanied by a barely audible SOUND. He looks down.\n          \n                              ELI\n                    Shit.\n          \n                              SOLARA\n                    What?\n          \n          A ROPE NOOSE suddenly whips around their feet, tightening at\n          their ankles and YANKING THEM UPSIDE-DOWN INTO THE AIR. Eli\n          drops his shotgun to the ground.\n          \n          They hang there for a moment, twisting in the breeze.\n          \n          The front door to the house SWINGS OPEN to reveal...\n          \n          AN ELDERLY COUPLE. The woman's gray hair tied into a neat\n          bun. The man bald, squinting through wire-frame glasses. They\n          look like the couple from Grant Wood's \"American Gothic.\"\n          \n          Instead of a pitchfork the man holds a 12-GAUGE RIOT SHOTGUN\n          which he keeps trained from the hip on Eli and Solara.\n          \n                                                                 85.\n          \n          \n          They step outside, regarding their new visitors carefully.\n          The man seems more suspicious than his wife. He drags Eli's\n          shotgun toward him with his foot, hands it to his wife.\n          \n                              ELDERLY MAN\n                    Who are you?\n          \n                              ELI\n                    My name is Eli. This is Solara.\n                    We're travelers, that's all. We\n                    don't mean you any harm.\n          \n                              ELDERLY MAN\n                    You cut my padlock. I saw you.\n                    Trying to break into our house.\n          \n                              ELI\n                    I'm sorry. We didn't think anybody\n                    lived here. We thought it was\n                    abandoned, like all the rest.\n          \n          This seems to annoy the man.\n          \n                              ELDERLY MAN\n                    Take a look around you. Look at\n                    this yard. Does it look abandoned\n                    to you?\n          \n          Clearly he's proud of the work he's done with the pitiful\n          means at his disposal.\n          \n                              ELI\n                    No, sir. I... like what you've done\n                    with the place.\n          \n                              ELDERLY MAN\n                    What's your business here?\n          \n                              ELI\n                    No business. We're sorry to have\n                    troubled you. If you'll let us down\n                    we'll happily be on our way.\n          \n          The wife steps forward, she's much warmer, less guarded.\n          \n                              ELDERLY WOMAN\n                    George, look at them! They're not\n                    robbers or road agents! One of\n                    them's just a girl!\n          \n                              ELDERLY MAN\n                    Seen that before. Oldest trick in\n                    the book.\n          \n                                                                   86.\n          \n          \n                              ELDERLY WOMAN\n                    Oh, stop! It's no trick. Let them\n                    down!\n          \n          The woman glares at him. The husband reluctantly accedes and\n          moves to the concealed trap apparatus. Releases the rope,\n          dropping Eli and Solara to the ground in a heap.\n          \n          The old woman helps them to their feet. They shake off the\n          noose from their ankles.\n          \n                                ELDERLY WOMAN\n                    I'm so sorry about my husband. We\n                    so rarely get visitors these days,\n                    he's suspicious of everybody.\n                         (BEAT)\n                    I'm Martha and this is my husband\n                    George. Would you care for some\n                    tea?\n          \n          Eli and Solara exchange a look. What the hell is this?\n          \n          INT. HOUSE - LIVING ROOM - DAY\n          \n          It's like something out of the world before. The interior is\n          almost perfectly preserved. Chintzy couches. A mahogany\n          table. A TV set in the corner. Lace curtains. Unreal.\n          \n          Eli and Solara sit on the couch, feeling self-conscious and\n          looking entirely out of place in this cozy environment.\n          \n          George sits across from them on the couch, scowling at them\n          inhospitably. The shotgun resting across his lap.\n          \n          Martha emerges from the kitchen, carrying a tray laden with a\n          tea pot and old china cups. Cracked and faded, but intact.\n          She places the tray on the coffee table and sits.\n          \n                              MARTHA\n                    I'm afraid we don't have any cake\n                    or biscuits for the tea. They ran\n                    out some time ago.\n          \n          She lifts the tea port and pours into the cups. But it's not\n          tea, only water. Somewhat murky water. Eli and Solara stare\n          at the cups, unsure. Martha gestures toward them.\n          \n                              MARTHA\n                    Please.\n          \n          They raise their cups and take a sip. Martha watches eagerly.\n          It's clearly a thrill for her to be doing something as\n          civilized and elegant as serving \"tea\" to guests.\n          \n                                                                 87.\n          \n          \n                              MARTHA\n                    How do you like it?\n          \n                              ELI\n                    It's.. uh...\n          \n                              SOLARA\n                    It's very good.\n          \n          Martha smiles, delighted. She lifts her own cup to her lips.\n          HER HANDS TREMBLE, the cup rattling against the saucer.\n          \n                              ELI\n                    Have you always lived here?\n          \n                              MARTHA\n                    For almost forty years now. This\n                    home is our pride and joy, isn't\n                    it, George?\n          \n          George just grunts. Not interested in conversation.\n          \n                              MARTHA\n                    We refused to leave, even during\n                    the troubles. We said, didn't we\n                    George, we said if we're going to\n                    die anywhere, we're going to die\n                    right here, in our own home.\n          \n                              ELI\n                    I don't understand how you've\n                    survived out here this long.\n          \n                              MARTHA\n                    Well, George is something of a\n                    handyman, aren't you, dear? He did\n                    a lot of work on the place, making\n                    it safe. We may be old, but we're\n                    resilient. We've had more than a\n                    few who've tried to take this place\n                    from us. Haven't we, George?\n          \n                              GEORGE\n                    Yes. Yes we have.\n          \n          He stands and moves toward the back door. Opens it up and\n          beckons Eli and Solara to come look.\n          \n          EXT. HOUSE - BACK YARD - CONTINUOUS\n          \n          Eli and Solara stand in the doorway, looking out on the yard.\n          Solara is horrified by what she sees.\n          \n                                                                 88.\n          \n          \n          The entire back yard is a GRAVEYARD. Maybe twenty human\n          graves dug shallow into the earth. Some were dug long ago,\n          others look like they're very recent.\n          \n                              SOLARA\n                    Are these... graves?\n          \n                              MARTHA\n                    Of course. It would be uncivilized\n                    not to bury them. We're not\n                    barbarians.\n          \n                              GEORGE\n                    Plus, it's good for the soil.\n          \n                              MARTHA\n                    Come on back inside. I think I\n                    might be able to rustle up some\n                    sandwiches.\n          \n          George and Martha go back inside, leaving Eli and Solara\n          gazing at the little graveyard.\n          \n                              ELI\n                    We have to get out of here.\n          \n                              SOLARA\n                    They look so sweet... I would never\n                    have believed they were killers.\n          \n                              ELI\n                    They're worse than that.\n          \n                                 SOLARA\n                    What?\n          \n                               ELI\n                    They didn't just kill these people.\n                        (BEAT)\n                    They ate them.\n          \n          Solara is stunned.\n          \n                                 SOLARA\n                    They what?\n                              ELI\n                    There's a disease in the outland.\n                    Spread by eating human meat. It\n                    affects the brain. Dementia, loss\n                    of motor function. Did you notice\n                    the old woman's hands shaking?\n                    She's got it. They've both got it.\n          \n                                                                 89.\n          \n          \n                              SOLARA\n                    Oh my God...\n          \n          INT. HOUSE - LIVING ROOM - CONTINUOUS\n          \n          Eli and Solara re-enter. Solara looks at George nervously.\n          He's still carrying that shotgun.\n          \n          Martha's voice drifts in from the nearby KITCHEN.\n          \n                              MARTHA (O.S.)\n                    I found some meat for those\n                    sandwiches! Are you hungry?\n          \n                              SOLARA\n                    No! Thank you!\n          \n                              ELI\n                    We really must be going.\n          \n                               GEORGE\n                    So soon?\n          \n          An unnerving glint in his eye. Eli moves toward the door.\n          \n                              ELI\n                    Yes, I'm afraid so.\n          \n          As he gets to the door, George moves to intercept. Hard to\n          tell if he's blocking his path or moving to open the door for\n          him. A tense BEAT.\n          \n          Martha emerges from the kitchen.\n          \n                              MARTHA\n                    Are you sure you won't stay?\n          \n                              ELI\n                    Yes. Thank you again for the tea.\n          \n          Eli stares George down. Reluctantly, George steps aside. Eli\n          opens the door and escorts Solara outside.\n          \n          EXT. HOUSE - CONTINUOUS\n          \n          Eli and Solara emerge into the sunlight. Walk down the garden\n          path. And FREEZE IN THEIR TRACKS.\n          \n          THE ARMED VEHICLES ARE COMING. Driving toward them out of the\n          horizon in a hazy cloud of dust.\n          \n                              SOLARA\n                    Oh no... it's my dad. It's his men.\n          \n                                                                 90.\n          \n          \n                              ELI\n                    Are you sure?\n          \n                              SOLARA\n                    I recognize the cars.\n          \n                              ELI\n                    Back inside.\n          \n          Eli bundles Solara back into the house. George stands in the\n          doorway, squinting at the approaching convoy.\n          \n          INT. HOUSE - LIVING ROOM - CONTINUOUS\n          \n          George follows them back in, furious.\n          \n                              GEORGE\n                    What did you bring upon us?\n          \n                              MARTHA\n                    George? What's wrong?\n          \n                              GEORGE\n                    A whole convoy of armed\n                    degenerates, that's what's wrong!\n                    Coming here for them! And they led\n                    them right to us!\n          \n          Martha rushes to the window, pulls aside the lace curtain.\n          Outside she sees the armored vehicles SCREECHING TO A HALT.\n          \n          The men spill out from the vehicles and take cover behind\n          them, locking and loading weapons.\n          \n                              MARTHA\n                    Oh no they don't...\n          \n          She rushes across the room, teeth gritted with determination.\n          \n                              GEORGE\n                    Martha, what are you doing?\n          \n                              MARTHA\n                    I finally got this house just the\n                    way I want it. I'm not going to let\n                    anybody tear it apart!\n          \n          She goes to the couch and yanks off the seat cushions.\n          Underneath is a WOODEN LID which she throws open to reveal:\n          \n          A HUGE CACHE OF WEAPONS. Automatic rifles. Shotguns. Pistols.\n          Grenades. And enough ammunition for everything.\n          \n                                                                 91.\n          \n          \n          She pulls out an M-60 MACHINE-GUN, slings the strap over her\n          shoulder and locks in a CHAIN OF BULLETS. She looks like a\n          post-apocalyptic Martha Stewart.\n          \n                              SOLARA\n                    Where did you get all this stuff?\n          \n          George pulls out an AK-47, slots in a magazine.\n          \n                              GEORGE\n                    Took `em off them who came looking\n                    to take the place from us. Built up\n                    quite the stash over the years.\n          \n          He offers a .44 MAGNUM to Solara.\n          \n                              GEORGE\n                    You know how to fire a gun?\n          \n                              SOLARA\n                    My daddy showed me once.\n          \n                              GEORGE\n                    Just like riding a bike.\n          \n                              SOLARA\n                    I never rode a bike.\n          \n          George sighs, turns instead to Eli.\n          \n                              GEORGE\n                    How about you, you know how to-\n          \n          Eli is already reloading his shotgun, checking the barrel.\n          Readying the weapon in the practiced manner of an expert.\n          \n                              GEORGE\n                    Never mind.\n          \n          EXT. HOUSE - CONTINUOUS\n          \n          Redridge steps forward, raises a BULLHORN.\n          \n                              REDRIDGE\n                    We know you're in there! Come on\n                    out with your hands up and your\n                    weapons on the deck and nobody\n                    needs to get hurt.\n          \n          SILENCE. No sign of activity inside the house.\n          \n          Redridge turns back to his men. Their hands trembling. They\n          didn't sign up for this, and they're not ready for it.\n          \n                                                                    92.\n          \n          \n          Redridge turns back to the house. Into the bullhorn:\n          \n                              REDRIDGE\n                    All right, look. I'm gonna make it\n                    easy on y'all. Bring out the girl\n                    with the book.\n          \n          INT. HOUSE - LIVING ROOM - CONTINUOUS\n          \n          Eli is crouched beneath the window. George and Martha have\n          taken up positions at other windows, peering out.\n          \n                              REDRIDGE (O.S.)\n                    That's all we want. The girl and\n                    the book. The rest of you's can go\n                    your way.\n          \n                              SOLARA\n                    What are we going to do?\n          \n          BEAT as Eli thinks.\n          \n                              ELI\n                    Hand me my pack.\n          \n          EXT. HOUSE - DAY\n          \n          Redridge waits. Still no sign of a response. His nervous\n          gunmen exchange worried looks.\n          \n                              CARNEGIE GUNMAN #2\n                    They ain't comin' out. They-\n          \n          Redridge raises his hand to silence him. Looks up as an\n          UPSTAIRS WINDOW slides open.\n          \n          A CLOTH PACKAGE is tossed from the window. It lands in the\n          dirt outside the perimeter fence a few yards from Redridge.\n          \n          Cautiously, he approaches. The package is wrapped in cloth\n          and tied up with twine. It looks like Eli's bible.\n          \n          He picks it up and tugs at the twine, untying it. Folds away\n          the cloth wrapping. Looks for a moment in puzzlement at the\n          object, at the words written on the front of it.\n          \n                                THIS SIDE TO FACE ENEMY\n          \n          It's a MINIATURE CLAYMORE MINE. The small red light on top of\n          the unit ILLUMINATES WITH A BEEP. Armed.\n          \n                              REDRIDGE\n                    Holy shi...\n          \n                                                                    93.\n          \n          \n          He drops the package in the dirt and races for his life back\n          toward the vehicles.\n          \n                                REDRIDGE\n                      Get down! Everybody get down!\n          \n          He dives across the trunk of the Explorer into cover as THE\n          MINE EXPLODES, SHATTERING EVERY WINDOW OF EVERY VEHICLE. The\n          lightweight Mini Cooper takes the main brunt and EXPLODES,\n          cartwheeling through the air, a burning wreck.\n          \n          Redridge looks around. Three men lie dead already. Flaming\n          wreckage all around him. Suddenly, it's a war zone.\n          \n          MACHINE-GUN FIRE ERUPTS FROM THE HOUSE, peppering the\n          vehicles' armor. The gunmen cower behind cover.\n          \n                                REDRIDGE\n                      Damn you, return fire!\n          \n          Redridge aims at the house and OPENS FIRE. Inspired by his\n          example, the others follow. A HAIL OF BULLETS CRISS-CROSS\n          BACK AND FORTH. The house's faded paint facade is shredded.\n          \n          INT. HOUSE - LIVING ROOM - CONTINUOUS\n          \n          Martha continues firing wildly with the M-60. Screaming at\n          the top of her lungs, loving every minute of it.\n          \n                                MARTHA\n                      Come and get it, you god-damn sons\n                      of mother-fucking bitches!\n          \n          George and Eli also open fire from their windows,\n          periodically ducking to take cover from incoming fire.\n          \n          Solara sits across the room, in the corner, sobbing.\n          \n                                ELI\n                      It's all right. We're going to be\n                      all right. Trust me.\n          \n          MORE GUNFIRE splinters the window frame above his head.\n          \n                                ELI\n                      You remember what I told you about\n                      faith?\n          \n          She nods.\n          \n          Eli peeks out and FIRES OUT THE WINDOW, dropping one of the\n          enemy gunmen with a crack shot. Ducks back down as the return\n          fire impacts around him.\n          \n                                                                 94.\n          \n          \n                              ELI\n                    We're going to get out of this\n                    alive. Both of us. I know.\n          \n                              SOLARA\n                    Because God told you?\n          \n                              ELI\n                    Because God told me.\n          \n          Amidst all the chaos and gunfire, George has been listening\n          to this exchange.\n          \n                              GEORGE\n                    What about us?\n          \n          BEAT.\n          \n                              ELI\n                    He didn't mention you.\n          \n          BEAT. George chambers a round and RESUMES FIRING.\n          \n          EXT. HOUSE - CONTINUOUS\n          \n          Redridge's men continue the hail of gunfire. Six of them dead\n          now, six more still standing. No lessening of fire from\n          inside the house. They're losing.\n          \n          Redridge races between the vehicles, ducking from gunfire\n          until he makes it to the back of the Dodge Caravan. Pops the\n          trunk and pulls out a ROCKET-PROPELLED GRENADE LAUNCHER.\n          \n          He sets it on his shoulder, rests on the trunk to steady his\n          aim. And FIRES. The rocket screams toward its target, tearing\n          through the chain fence and TEARING AN ENTIRE CORNER FROM THE\n          HOUSE in a fiery explosion.\n          \n          INT. HOUSE - CONTINUOUS\n          \n          Filled with smoke. The sounds of COUGHING.\n          \n          Dazed, George pushes his way through the smoke, waving his\n          arms to clear it. A BLOODY GASH on his forehead.\n          \n                              GEORGE\n                    Martha? Martha!\n          \n          He finds her lying on the tile floor in what remains of the\n          kitchen. Or at least her top half. The rest of her is gone.\n          \n          George slumps to his knees with tear-filled eyes. Takes his\n          wife tenderly by the hand for a moment.\n          \n                                                                    95.\n          \n          \n          Then the anger returns. He gets up and turns, consumed now by\n          a wild fury. Firing with rage over the torn brick wall. He\n          CLIPS ANOTHER GUNMAN IN THE HEAD, killing him.\n          \n          George moves back toward the LIVING ROOM, firing as he goes.\n          \n          EXT. HOUSE - CONTINUOUS\n          \n          Redridge moves between the cars again, staying behind cover.\n          George's hail of gunfire has them pinned down.\n          \n                              REDRIDGE\n                    We got any more of those RPGs?\n          \n                              CARNEGIE GUNMAN #3\n                    That was it.\n          \n                              REDRIDGE\n                    Screw this.\n          \n          Redridge jumps into the driver's seat of the minivan, turns\n          the key in the ignition. Jams the accelerator down with the\n          butt of his rifle, then shifts the transmission into DRIVE.\n          \n                                 REDRIDGE\n                    Get clear!\n          \n          The gunmen leap clear as the minivan HURTLES TOWARD THE\n          HOUSE, engine roaring. CRASHES THROUGH THE CHAIN FENCE.\n          \n          INT. HOUSE - LIVING ROOM - CONTINUOUS\n          \n          Eli looks up from cover and see the van coming RIGHT AT HIM.\n          He dives clear as the van CRASHES THROUGH THE WALL INTO THE\n          LIVING ROOM. It SMASHES INTO THE FAR WALL, finally coming to\n          a stop.\n          \n          More dust and debris, more coughing. Eli tries to get up, but\n          winces in pain. Puts his hand to his side, it comes back WET\n          WITH BLOOD. A bad wound. He covers it with his coat, stands\n          and moves through the smoke.\n          \n                                 ELI\n                    Solara?\n          \n                                 SOLARA (O.S.)\n                    Eli!\n          \n          He finds her in the smoke. She embraces him.\n          \n                              ELI\n                    Are you all right?\n          \n                                                                 96.\n          \n          \n                                SOLARA\n                    I'm fine.\n          \n          As the smoke clears, Solara sees George PINNED AGAINST THE\n          WALL BY THE MINIVAN. His body crushed. Dead.\n          \n                                SOLARA\n                    Oh God...\n          \n                              ELI\n                    Come on. We're going out the back.\n                    We're running.\n          \n          As he helps her to her feet, we hear the sound of MOVEMENT\n          THROUGH THE RUBBLE.\n          \n          They turn around. The gunmen are ENTERING THE HOUSE, passing\n          through the smoking hole left by the minivan.\n          \n          Eli reaches for his sword. Met by the sound of MULTIPLE GUNS\n          COCKING. Redridge steps out from among the gunmen. Smiles.\n          \n                              REDRIDGE\n                    Go ahead and try it, holy man. You\n                    ain't that fast.\n          \n          EXT. HOUSE - DAY\n          \n          Eli and Solara are shoved out of the house at gunpoint and\n          marched past the torn perimeter fence to the vehicles.\n          \n          Eli has been stripped of his weapons and backpack. Redridge\n          faces him and points a pistol at his head.\n          \n                              REDRIDGE\n                    Where's the book?\n          \n          BEAT. Eli doesn't answer. Redridge cocks the pistol.\n          \n                              REDRIDGE\n                    I ain't playing.\n          \n          Redridge stares him down. Eli just stares right back. Totally\n          unflappable. Redridge motions to his men.\n          \n                              REDRIDGE\n                    Check the pack.\n          \n          The gunman carrying Eli's pack opens it up and tips its\n          contents out onto the ground. The ghillie suit, battery, some\n          old canned goods, other odds and ends. No sign of the book.\n          \n                              CARNEGIE GUNMAN #4\n                    It ain't here.\n          \n                                                                 97.\n          \n          \n                              REDRIDGE\n                    It's gotta be.\n          \n          Redridge holsters his gun and frisks Eli, going through his\n          pockets. Finds nothing. He opens Eli's coat and checks the\n          inside pockets. Digs around deep inside.\n          \n                              REDRIDGE\n                    Hello, what have we here?\n          \n          And then suddenly he SHRIEKS IN PAIN. Yanks his hand out to\n          reveal ELI'S RAT, TEETH SUNK DEEP INTO HIS FLESH.\n          \n          Redridge flails around violently, trying to get the rat off\n          him, but it won't let go. His hand is bleeding badly.\n          \n                              REDRIDGE\n                    Fuck! Get it off! Get it off me!\n          \n          He finally manages to shake it free. It hits the floor dazed.\n          Redridge STOMPS ON IT with his boot, reducing it to a bloody\n          smear in the dirt. Eli lowers his head in sadness.\n          \n          Redridge clutches his bloody hand, glares at Eli furiously.\n          Pulls his gun again and marches right up to him, pressing the\n          muzzle tight against his forehead.\n          \n                              REDRIDGE\n                    If you don't got the book, what\n                    fucking use are you?\n          \n          His finger tightens on the trigger.\n          \n                                SOLARA\n                    Wait!\n          \n          She breaks from the gunmen holding her and rushes toward\n          Redridge. Reaches inside her dress and PRODUCES THE BIBLE.\n          \n                              SOLARA\n                    It's here! I've got it! Please\n                    don't kill him.\n          \n                                ELI\n                    Solara...\n          \n                              SOLARA\n                    It's just a book, Eli. No book is\n                    worth giving up your life for.\n          \n                              ELI\n                    You're wrong.\n          \n                                                                   98.\n          \n          \n          Satisfied, Redridge takes the book. Runs his hand over the\n          leather cover, gazes admiringly at the gold-embossed cross.\n          \n                              REDRIDGE\n                    You did good, sweetheart. Your\n                    daddy would be proud. He knew you'd\n                    come through for him.\n          \n          Solara looks at Eli guiltily. She feels terrible.\n          \n                              SOLARA\n                    He said he would hurt my mom. If I\n                    didn't help him.\n          \n                              REDRIDGE\n                        (SMILING)\n                    Daddy's little girl...\n          \n          Solara stands between him and Eli. Deadly serious now.\n          \n                              SOLARA\n                    I want you to let him go.\n          \n                              REDRIDGE\n                    What?\n          \n                              SOLARA\n                    You've got what you came for. You\n                    don't need him. Let him go.\n          \n                              REDRIDGE\n                    He's killed a dozen of my men.\n          \n                              SOLARA\n                    If you hurt him, I'm not coming\n                    back with you. You'll have to drag\n                    me kicking and screaming.\n          \n          Solara glares at Redridge. He sighs. He can tell she means\n          it. It's not worth the aggravation. He turns back to Eli.\n          \n                              REDRIDGE\n                    Take your shit and get out of here.\n          \n          Eli gathers up his stuff into his pack. Shoulders it and goes\n          to pick up his sword, but Redridge puts his boot on it.\n          \n                              REDRIDGE\n                    No weapons.\n          \n          Eli still has a half-dozen guns trained on him. He turns and\n          walks away, toward the road. As he passes Solara:\n          \n                                                                   99.\n          \n          \n                              ELI\n                    I told you we'd both live. Now do\n                    you have faith?\n          \n          A tear runs down Solara's cheek as she watches him walk away.\n          \n          Redridge grabs her by the arm and pulls her toward the\n          vehicles as his men load up and prepare to move out.\n          \n          IN THE REARMOST VEHICLE\n          \n          Solara sits in the back seat, staring out the rear window as\n          it drives down the road at the tail end of the convoy.\n          \n          She watches as Eli moves away down the road, getting smaller\n          and smaller until he is just a speck on the horizon.\n          \n          She bursts into floods of uncontrollable tears.\n          \n          LATER\n          \n          Solara in the back seat, calmer now. The tears dried on her\n          cheeks. She sits staring blankly at the DRIVER in front.\n          \n          And then she LUNGES VIOLENTLY FORWARD. Clawing and biting at\n          the driver, who struggles to fight her off. His hands come\n          off the wheel and the car FISHTAILS WILDLY.\n          \n          REDRIDGE'S VEHICLE\n          \n          The DRIVER sees something odd in the rear-view mirror.\n          \n                              DRIVER\n                    What the hell...?\n          \n          Redridge turns to see the car behind VEERING ERRATICALLY then\n          SLAMMING ON THE BRAKES, stopping in the middle of the road.\n          \n                              REDRIDGE\n                    Stop, stop!\n          \n          The car screeches to a halt. Redridge watches through the\n          rear window as the driver's side door opens and the driver is\n          KICKED OUT ONTO THE ASPHALT.\n          \n          The door closes again, the engine revs and the car TURNS\n          AROUND, racing back down the road in the direction it came.\n          \n                              REDRIDGE\n                    Shit. Turn around!\n          \n                              DRIVER\n                    We ain't got the gas for it!\n          \n                                                                   100.\n          \n          \n                              REDRIDGE\n                    She's getting away!\n          \n                              DRIVER\n                    We got the book! And we got barely\n                    enough gas to make it back as it\n                    is! We can't go chasin' her!\n          \n          BEAT. Redridge knows he's right.\n          \n                               REDRIDGE\n                    Stupid little bitch...\n                        (BEAT)\n                    Drive on.\n          \n          The car moves on, following the rest of the convoy.\n          \n          EXT. HOUSE - DAY\n          \n          Solara screeches the car to a halt outside the smoking\n          wreckage of the besieged house. She runs from the vehicle to\n          where ELI'S SWORD lies in the dirt and grabs it up.\n          \n          EXT. ROAD - DUSK\n          \n          Solara races down the road in the car, pedal to the metal.\n          \n                              SOLARA\n                    Come on, come on...\n          \n          Eventually, she sees him. At first just a dot on the horizon.\n          But unmistakably Eli. By now, she'd know him anywhere.\n          \n          Suddenly the engine SPLUTTERS. She checks the fuel gauge; the\n          needle deep in the red. She pounds the wheel in frustration.\n          \n                                SOLARA\n                    No... No!\n          \n          The car grinds to a halt, dead. She flings open the door and\n          leaps out of the vehicle, rushing after Eli on foot.\n          \n          ON ELI. As always, his pace steady and slow. The sun directly\n          ahead of him as it sets on the horizon. Headed always west.\n          \n          Solara is running up behind him, a hundred yards back.\n          \n                                SOLARA\n                    Eli! Eli!\n          \n          He doesn't stop or look back. Just keeps on walking.\n          \n          She finally catches up with him, breathing hard, exhausted.\n          \n                                                                  101.\n          \n          \n                                 SOLARA\n                    Eli...\n          \n                              ELI\n                    Thought you'd gone back to town.\n          \n                              SOLARA\n                    I can't go back there. Eli, I'm so\n                    sorry.\n          \n                                 ELI\n                    For what?\n          \n                              SOLARA\n                    For what? I betrayed you! I gave\n                    them the book!\n          \n                              ELI\n                    You did what you believed you had\n                    to.\n          \n                              SOLARA\n                    You're not mad at me?\n          \n          BEAT.\n          \n                              ELI\n                    I forgive you.\n          \n          She continues walking alongside him. Trying to process this.\n          This kind of compassion is totally foreign to her.\n          \n          She holds out the sword, offering it to Eli by way of\n          atonement.\n          \n                               SOLARA\n                    Here. I thought you might still\n                    need this.\n          \n          Eli seems appreciative that she would think to return it to\n          him. He takes it and slings it over his shoulder.\n          \n                                 ELI\n                    Thank you.\n          \n                              SOLARA\n                    What are you going to do now?\n          \n                              ELI\n                    Same as always. Keep heading west.\n          \n                              SOLARA\n                    Why? I mean, you don't have the\n                    book any more.\n          \n                                                                  102.\n          \n          \n                              ELI\n                    But I still have my faith.\n          \n          They walk on together, into the sunset.\n          \n          EXT. NORTHERN CALIFORNIA - MONTAGE - DAY\n          \n          Eli and Solara follow the road through burned-out towns and\n          retail neighborhoods. Gutted and dead, like every place else.\n          \n          But something is different here. Things are greener. Tufts of\n          grass here and there. They attract Solara's attention.\n          \n                              SOLARA\n                    What's that?\n          \n          Eli reaches down and runs his hand through the grass.\n          \n                              ELI\n                    It's grass. It used to grow all\n                    over the place.\n          \n                              SOLARA\n                    How come it's here?\n          \n                              ELI\n                    I don't know. Less poison in the\n                    air this near to the ocean, maybe.\n          \n          They keep walking. Eli groans, clutches his side. Does his\n          best to hide his pain from Solara. She notices anyway.\n          \n                              SOLARA\n                    What's wrong?\n          \n                              ELI\n                    Nothing. Just a cramp.\n          \n          EXT. FREEWAY - NIGHT\n          \n          They walk on through the night. Eli stops and sniffs the air.\n          \n                                 SOLARA\n                    What?\n          \n                              ELI\n                    Do you smell that?\n          \n                              SOLARA\n                    Smell what?\n          \n                              ELI\n                    Salt in the air. We're close to the\n                    ocean. We're almost there.\n          \n                                                                103.\n          \n          \n          EXT. CALIFORNIA ROAD - DAWN\n          \n          They keep on along the road. A shallow uphill incline. They\n          follow it uphill, finally reaching its crest, where they stop\n          and take in the view before them.\n          \n          THE PACIFIC OCEAN. Straddled by the GOLDEN GATE BRIDGE - the\n          once-great structure has partially collapsed from decades of\n          neglect and disrepair. The span sags and hangs low over the\n          ocean, the asphalt cracked and ruptured.\n          \n          On the other side of the bay, SAN FRANCISCO - or the little\n          that remains of it. The city has been almost TOTALLY\n          DESTROYED - entire areas reduced to rubble, the few buildings\n          still standing looking on the verge of collapse.\n          \n          Solara looks at it all in horrified awe. Eli, unperturbed,\n          keeps on moving, still clutching his side.\n          \n                               ELI\n                    Come on.\n          \n          EXT. GOLDEN GATE BRIDGE - DAY\n          \n          Eli and Solara make their way south across the bridge, side-\n          stepping the fractures in the road.\n          \n          EXT. SAN FRANCISCO RUINS - DAY\n          \n          Eli leads Solara through the rubble of what used to be San\n          Francisco. It's like walking through the wreckage of 9/11's\n          Ground Zero, but a hundred times the scale. Horrifying.\n          \n          They pass by the wreckage of a HOTEL, nothing but the lobby\n          still standing. A HILTON sign protruding from the rubble.\n          \n          Eli uses his sheathed sword as a walking stick, poking around\n          ahead of him for loose rubble underfoot. He steps carefully.\n          \n                              ELI\n                    Watch your footing. Step where I\n                    step.\n          \n          EXT. SAN FRANCISCO - FINANCIAL DISTRICT - DAY\n          \n          More buildings are still standing here, but they're nothing\n          more than great dead monoliths. Solara looks up at the\n          blasted skyscrapers - she's never seen anything like it.\n          \n          The buildings loom over her like giant tombstones. It scares\n          her - like walking through the graveyard of a dead world.\n          \n                              SOLARA\n                    This... this is the world before?\n          \n                                                                104.\n          \n          \n                              ELI\n                    What's left of it.\n          \n          They keep walking, passing the TOPPLED TRANSAMERICA PYRAMID.\n          \n          EXT. SAN FRANCISCO - FISHERMAN'S WHARF - DAY\n          \n          Once a bustling oceanside tourist spot, now a ghost town.\n          \n          Eli and Solara walk along the litter-strewn street, passing\n          the old RIPLEY'S BELIEVE-IT-OR-NOT and WAX MUSEUMS. The\n          celebrity mannequins are still in fair condition, but slumped\n          at their feet are CHARRED HUMAN SKELETONS.\n          \n          Eli is struggling now. He looks pale from the blood loss. His\n          breathing labored. Solara takes him by the arm to help him.\n          \n          EXT. SAN FRANCISCO - PIER 39 - DAY\n          \n          A dead, ruined place, like everywhere else. We hear the sound\n          of SEAGULLS nearby - the only sign of life at all.\n          \n          Eli and Solara walk along the pier, until they reach its end.\n          The original end has long since collapsed into the sea, but a\n          RICKETY HAND-MADE ROPE BRIDGE has been affixed to the pier's\n          sheared-off edge.\n          \n          Eli and Solara stand at the pier's end, looking out to sea.\n          \n                              ELI\n                    Do you see that?\n          \n                              SOLARA\n                    I see it. Is that it?\n          \n                                 ELI\n                    That's it.\n          \n          Reveal now that the rope-bridge leads out across the bay to:\n          \n          ALCATRAZ ISLAND\n          \n          Looking much the same as it always has, old and dilapidated.\n          The coastal fog shrouding it gives it an ethereal look. It\n          feels almost like a mythic place - the \"promised land\" Eli\n          has sought for so many years.\n          \n          A tattered STARS AND STRIPES still flutters in the breeze\n          atop the prison lighthouse.\n          \n                                                                  105.\n          \n          \n          EXT. BAY ROPE BRIDGE - DAY\n          \n          Eli and Solara make their way carefully across the bridge. It\n          feels highly unstable and sags low over the bay, the waters\n          below close enough to lap around their ankles.\n          \n          EXT. ALCATRAZ ISLAND - DAY\n          \n          Eli and Solara arrive at the prison gates. Securely locked.\n          As they inspect it for a possible way to enter:\n          \n                              VOICE (O.S.)\n                    Who goes there?\n          \n          They look up. A GUARD in paramilitary fatigues is stationed\n          in one of the perimeter towers. Training a rifle on them.\n          \n                              ALCATRAZ GUARD\n                    Identify yourselves!\n          \n          In the opposite tower ANOTHER GUARD has his rifle trained on\n          them too. Eli looks up, raises his hands.\n          \n                              ELI\n                    My name is Elijah Stone. I have a\n                    message for your boss. I need you\n                    to tell him that I have a King\n                    James Bible in my possession.\n          \n          BEAT.\n          \n                              ALCATRAZ GUARD\n                    Remain where you are! Do not\n                    attempt to move or you will be\n                    fired upon!\n          \n          Keeping the gun trained on them, the tower guard uses his\n          free hand to talk into a WALKIE-TALKIE RADIO. We don't hear\n          the conversation. All Eli and Solara can do is wait.\n          \n          The guard puts away his radio and shouts back down:\n          \n                              ALCATRAZ GUARD\n                    Be prepared to surrender any\n                    weapons at the gate!\n          \n          BEAT. And then the massive front gates SLOWLY OPEN ON\n          MECHANICAL RUNNERS with the low groan of rusted iron.\n          \n          Eli and Solara look at each other, then step gingerly inside.\n          \n                                                                106.\n          \n          \n          INT. ALCATRAZ - MAIN GATES - CONTINUOUS\n          \n          As soon as they step inside they are SURROUNDED BY DOZENS OF\n          HEAVILY-ARMED SOLDIERS. Not U.S. military, more like a semi-\n          official militia. But every bit as deadly.\n          \n          Eli and Solara raise their hands. A pair of SOLDIERS take\n          Eli's pack and sword, pat them both down for other weapons.\n          \n                              SOLDIER\n                    They're clean.\n          \n          The soldiers before them part - to reveal a THIN, BALDING MAN\n          wearing spectacles. He wears Kevlar body armor over his tweed\n          jacket and tie. Professorial, academic.\n          \n          He approaches, shakes Eli's hand vigorously - very excited.\n          \n                              THIN MAN\n                    Welcome, both of you. I'm Professor\n                    Lombardi. I'm the curator here.\n          \n                              ELI\n                    Elijah Stone.\n          \n                                 SOLARA\n                    Solara.\n          \n                              LOMBARDI\n                    Solara. What a delightful name. Is\n                    that by any chance Shakespearean?\n          \n                              SOLARA\n                    I, uh, I think it's Japanese.\n          \n                                 LOMBARDI\n                    Wonderful.\n          \n          He turns back to Eli.\n          \n                              LOMBARDI\n                    Is it true what they tell me? You\n                    have a King James Version?\n          \n                              ELI\n                    Been carrying it with me for twenty-\n                    five years.\n          \n          Solara looks at Eli, puzzled. Lombardi finds it hard to\n          contain his excitement.\n          \n                              LOMBARDI\n                    My goodness. I can't tell you how\n                    exciting this is. Well, come, come!\n                              (MORE)\n          \n                                                                107.\n          \n                              LOMBARDI (cont'd)\n                    I'll give you the nickel tour and\n                    then we can all sit down and take a\n                    look at it.\n          \n          He leads them across the courtyard into the prison buildings.\n          \n          EXT. DESERT TOWN - MAIN STREET - DAY\n          \n          Redridge's remaining vehicles drive back into town and come\n          to a halt outside the theater. Redridge emerges from his car,\n          carrying the bible. Walks up to the Palladium and enters.\n          \n          INT. ALCATRAZ - CELL BLOCK - DAY\n          \n          What was once a cell block is now an IMMENSE LIBRARY. Stacked\n          floor to ceiling with books. Lombardi shows Eli and Solara\n          around. Behind them, a pair of ARMED GUARDS follow closely.\n          \n                              LOMBARDI\n                    Yes, we've been doing this for some\n                    time now. Collected over thirty\n                    thousand volumes from generous\n                    donors all across the nation. We\n                    even have a printing press that we\n                    hope to have operational soon.\n          \n          Solara is stunned as she surveys the endless stacks of books.\n          She's never seen anything like it.\n          \n                              SOLARA\n                    You turned the whole prison into a\n                    library?\n          \n                               LOMBARDI\n                    Well, not exactly. We're more like\n                    a storage facility. We're holding\n                    these books here in trust, if you\n                    like. When society gets back on its\n                    feet and no longer needs us to\n                    preserve these volumes, they'll be\n                    here waiting.\n                        (BEAT)\n                    I must ask you, how did you hear\n                    about us? We've been doing\n                    everything we can to get the word\n                    out, but we always like to know\n                    where our benefactors come from.\n          \n                              ELI\n                    I was sent here by God.\n          \n          Lombardi raises a quizzical eyebrow.\n          \n                                                                 108.\n          \n          \n                               LOMBARDI\n                    Is that right? Well, it's good to\n                    know we're getting such high-\n                    profile referrals these days.\n                        (BEAT)\n                    I must say, I am so excited that we\n                    finally have a King James. You\n                    know, we have a Talmud here, we\n                    have two Korans, we even have that\n                    Scientology book. But never a\n                    Christian bible, until now. I\n                    honestly believed it was the one\n                    book I'd never see again, after\n                    what happened...\n          \n          BEAT. Lombardi appears sad for a moment.\n          \n                              LOMBARDI\n                    May I ask what condition it's in?\n          \n                              ELI\n                    It's a little beat-up. But it'll do\n                    the job.\n          \n                              LOMBARDI\n                    Well, then. What say we take a look\n                    at it?\n          \n          Lombardi looks at Eli with anticipation. So does Solara,\n          interested to know where this is going to go next.\n          \n          Eli winces in pain, puts his hand to his side.\n          \n                              ELI\n                    Is there someplace we could sit?\n          \n                              LOMBARDI\n                    Of course. Right this way.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          Redridge appears. Carnegie looks at him eagerly.\n          \n                              CARNEGIE\n                    Did you get it?\n          \n          Redridge holds the bible up proudly. Carnegie beams.\n          \n                               CARNEGIE\n                    Show me.\n          \n          Redridge hands it over. Carnegie sits back in his chair,\n          running his hand lovingly over the battered leather cover.\n          \n                                                                   109.\n          \n          \n                              CARNEGIE\n                    The new world begins here...\n          \n          He opens the book and looks inside.\n          \n          BEAT. And then he looks up at Redridge, confused.\n          \n                              CARNEGIE\n                    What the fuck is this?\n          \n          INT. ALCATRAZ - CAFETERIA - DAY\n          \n          Eli, Solara and Lombardi sit at one of the long lunch-room\n          tables. The two armed guards keep watch nearby.\n          \n                              ELI\n                    Do you have something you can write\n                    with?\n          \n                              LOMBARDI\n                    Mmm? Oh, yes of course!\n          \n          He pulls a pen from his pocket, motions to one of the guards.\n          \n                              LOMBARDI\n                    Could you please bring us some\n                    writing paper?\n          \n          The guard nods and moves toward the door. As he does so:\n          \n                              ELI\n                    Bring a lot of it.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          Carnegie looks at the open bible, jaw hanging loose, his\n          complexion ashen. Like he's just been slapped in the face.\n          \n                              REDRIDGE\n                    What? What is it?\n          \n          INT. ALCATRAZ - CAFETERIA - DAY\n          \n          The guard brings a THICK SHEAF OF WRITING PAPER to the\n          cafeteria table, sets it down by Lombardi.\n          \n                              ELI\n                    Are you ready?\n          \n                              LOMBARDI\n                    What exactly am I writing?\n          \n                                                                 110.\n          \n          \n                              ELI\n                    Pay close attention and write down\n                    every word exactly as I say it.\n          \n          Eli removes his goggles. Solara can't believe what she sees.\n          \n          His eyes are pale, milky-white, dead. TOTALLY BLIND.\n          \n                              ELI\n                    The First Book of Moses called\n                    Genesis. Chapter one, verse one. In\n                    the beginning God created the\n                    heavens and the earth. Verse two.\n                    The earth was without form, and\n                    void; and darkness was on the face\n                    of the deep. And the spirit of God\n                    was hovering over the face of the\n                    waters. Verse three. And God said,\n                    \"Let there be light,\" and there was\n                    light.\n          \n          Lombardi hurriedly writes down every word.\n          \n          INT. PALLADIUM AUDITORIUM - CARNEGIE'S BOX\n          \n          Carnegie sits at his desk, still in shock. Eli's bible sits\n          open on the desk before him.\n          \n          A BRAILLE BIBLE.\n          \n          Claudia is ushered in by a guard.\n          \n                              CLAUDIA\n                    What's wrong?\n          \n          He rushes forward and thrusts the bible into her hands.\n          \n                              CARNEGIE\n                    You told me once that you know how\n                    to read this. This blind language.\n          \n                              CLAUDIA\n                    Well, a long time ago, when I was a\n                    little girl...\n          \n                              CARNEGIE\n                    You're going to read it for me.\n                    Every word. And I'm going to write\n                    it down. Start at the beginning.\n          \n          As Carnegie hunts on his desk for a paper and pen, Claudia\n          opens the book and trails her fingertips across the raised\n          lettering.\n          \n                                                                111.\n          \n          \n          For a moment there is a glimmer of recognition... a faint\n          smile... but then it fades as Carnegie turns back to her,\n          eagerly clutching the writing materials.\n          \n                               CLAUDIA\n                    I'm sorry. It's been so long. I\n                    don't remember. I don't remember\n                    any of it.\n          \n          Carnegie is aghast. BEAT as the anger swells within him,\n          threatening to explode...\n          \n                              CARNEGIE\n                    God fucking dammit!\n          \n          He swipes violently at the bible, knocking it out of\n          Claudia's hands. He grabs it up and tries to rip it in two,\n          but it's too thick to tear. Red-faced with rage, he tosses it\n          out over the box balcony. It lands somewhere in the dark\n          auditorium below, between the rows of gutted theater seats.\n          \n          As he paces angrily back past Claudia:\n          \n                              CLAUDIA\n                    Bill, is there something-\n          \n                              CARNEGIE\n                    Just go. Just get out of my sight.\n          \n          He slumps in his chair, exhausted and furious. Claudia sadly\n          turns and leaves him alone with his thoughts.\n          \n          INT. ALCATRAZ - CAFETERIA - NIGHT\n          \n          Some considerable time later. Great stacks of paper have been\n          filled with Lombardi's handwriting.\n          \n          Lombardi's pen races across the paper, struggling to keep up\n          with Eli's recitation.\n          \n          Solara is curled up on a nearby bench, asleep. Eli's coat\n          covering her to keep her warm.\n          \n          Eli clutches his wound painfully as he continues to recite.\n          He looks paler now than ever. Close to death.\n          \n                              ELI (V.O.)\n                    Dear Lord, thank you for giving me\n                    the strength and the conviction to\n                    complete the task you entrusted to\n                    me. Thank you for guiding me\n                    straight and true, through the many\n                    obstacles in my path.\n                              (MORE)\n          \n                                                                112.\n          \n                              ELI (V.O.) (cont'd)\n                    And for keeping me resolute when\n                    all around seemed lost.\n          \n          EXT. ALCATRAZ - EXERCISE YARD - PRE-DAWN\n          \n          The prison yard shrouded in the dim light just before dawn.\n          \n          Solara crosses the yard. She looks more mature somehow.\n          Determined and strong. She carries with her ELI'S SWORD - and\n          something else, tucked under her arm.\n          \n                              ELI (V.O.)\n                    Thank you for your protection and\n                    for your many signs along the way.\n          \n          She stops in a nondescript corner of the yard.\n          \n          At her feet is a SHALLOW MOUND OF DIRT. At the head of the\n          mound, a SIMPLE TOMBSTONE.\n          \n          She kneels and places a SINGLE FLOWER on the grave.\n          \n          INT. PALLADIUM - CARNEGIE'S BEDROOM - NIGHT\n          \n          Lit only by the pale moonlight, barely enough to see by.\n          \n          Carnegie sleeps soundly in bed. Next to him lies Claudia,\n          wide awake. She checks that Carnegie is sound asleep, careful\n          not to wake him before she creeps out of bed and exits.\n          \n          INT. PALLADIUM AUDITORIUM - NIGHT\n          \n          Claudia is on her hands and knees in the darkness, searching\n          blindly in the aisles and beneath the theater seats.\n          \n          She finds Eli's bible in some litter strewn on the floor.\n          \n                              ELI (V.O.)\n                    Thank you for the good that I have\n                    done. For whatever light you were\n                    able to shine into the darkness of\n                    this world through me.\n          \n          Sitting in the darkness, Claudia opens the book and runs her\n          fingers across the braille, reading. And though we can barely\n          see in the dim light, we see the smile on her face. The joy.\n          \n          EXT. ALCATRAZ - EXERCISE YARD - DAWN\n          \n          As Solara kneels by the grave, we see now that she wears\n          Eli's SAINT CHRISTOPHER PENDANT around her neck.\n          \n          The tombstone reads:\n          \n                                                                113.\n          \n          \n                               HERE LIES ELIJAH STONE\n                                DIED AUGUST 21, 2048\n                            FAITHFUL SERVANT TO THE LORD\n                                AND FRIEND TO SOLARA\n          \n          She unsheathes Eli's sword, plants it in the ground before\n          his grave. Takes the BOOK from under her arm and opens it up.\n          \n          It's a NEW BIBLE. Crudely typeset from Lombardi's original\n          transcription and printed on the prison press.\n          \n          She opens it up and begins to read a passage from the bible\n          over Eli's grave. We don't hear what she says.\n          \n          As Solara finishes her reading and closes the bible, LOMBARDI\n          appears behind her.\n          \n                              LOMBARDI\n                    You know, you don't have to leave.\n                    You're welcome to stay here with\n                    us. You'll be safe.\n          \n                               SOLARA\n                    Thanks.\n          \n          She stands, pulling Eli's sword from the earth.\n          \n                              SOLARA\n                    But I gotta do what I gotta do.\n          \n                              LOMBARDI\n                    Where will you go?\n          \n          BEAT. Solara looks at the sword, her fingers playing across\n          its hilt. The blade glimmers in the light of the rising sun.\n          \n          There is a determined, purposeful look in her eye.\n          \n                               SOLARA\n                    Home.\n          \n          EXT. ALCATRAZ ISLAND - DAWN\n          \n          The sun rises through the fog on the horizon.\n          \n          The great iron gates grind open. Solara emerges from inside\n          the prison, steps out onto the island rock.\n          \n          She is dressed in a flak jacket, combat pants and boots.\n          Eli's old pack across her back. Hair tied in a neat pony\n          tail. Atop that, Eli's ragged fur hat.\n          \n                              ELI (V.O.)\n                    Thank you for the friend I made.\n          \n                                                                114.\n          \n          \n          In her hand she clutches a copy of the newly-printed bible.\n          Eli's sword slung over her shoulder.\n          \n                              ELI (V.O.)\n                    Please watch over her as you\n                    watched over me.\n          \n          MONTAGE as Solara walks back along Fisherman's Wharf...\n          through the San Francisco rubble... across the Golden Gate\n          bridge...\n          \n                              ELI (V.O.)\n                    Thank you for allowing me finally\n                    to rest. I'm so very tired. The\n                    time of my departure is at hand and\n                    now I surrender my soul into your\n                    care, at peace in knowing that I\n                    have carried out your will. That I\n                    have done right with my time on\n                    this earth.\n          \n          EXT. ROAD - DAY\n          \n          ...and finally back onto a desolate road leading off into the\n          desert wasteland. She looks up and down the road, then turns\n          and heads toward the sun on the horizon. Headed east.\n          \n                              ELI (V.O.)\n                    I have fought the good fight. I\n                    have finished the race.\n          \n          As she walks away into the sun, her lonely silhouette on the\n          road reminds us of Eli as we saw him so many times before.\n          \n                              ELI (V.O.)\n                    I have kept the faith.\n          \n          She grows smaller and smaller as she walks into the distance,\n          until she consumed by the rising sun and we\n          \n                                                          FADE OUT:\n          \n \n\n\n\n\n\nBook of Eli, The\nWriters :   Gary Whitta\nGenres :   Action  Adventure  Drama  Sci-Fi  Thriller  Western\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:25.336587"}