{"title": "Boondock Saints 2: All Saints Day", "film_link": "/Movie Scripts/Boondock Saints 2: All Saints Day Script.html", "script_link": "/scripts/Boondock-Saints-2-All-Saints-Day.html", "info_raw": "\n\nBoondock Saints 2: All Saints Day Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Troy Duffy\nGenres  Action  Crime  Drama  Thriller\nScript Date : September 2007\nMovie Release Date : November 2009\n\nRead \"Boondock Saints 2: All Saints Day\" Script\n\n\n", "script": "\n\n\n \n                                  ALL SAINTS DAY\n\n\n\n                                    Written by\n\n                                    Troy Duffy\n\n          \n\n          \n\n          \n\n                                                         September 1, 2007\n\n          \n\n          \n\n          EXT. BOYLESTON STREET, BOSTON -- MORNING\n\n\n          \n          The boulevard is empty, eerie silence. No cars, no people. A man\n          walks down the middle of the street, long trench, dark shades.\n          Though he does not speak, we hear...\n\n          \n\n                                 MAN V.O.\n                     There's two kinds of people in this\n                     world when you boil it all down. You\n                     got your talkers and you got your\n                     doers.\n\n          \n          We recognize this man as ROCCO. He crosses Copley Square toward the\n          looming dome of the Trinity Church.\n\n          \n\n                                 ROCCO V.O.\n                     Most people are just talkers. All they\n                     got is talk. But when all's said and\n                     done, it is the doers who change the\n                     world. And when they do that, they\n                     change us. That's why we never forget\n                     them...So, which one are you? Do you\n                     just talk about it? Or do you stand up\n                     and do something about it? Because\n                     believe you me all the rest of it is\n                     just coffee house bullshit.\n\n          \n\n          FADE TO BLACK...\n\n          \n\n          EXT. DEEP COUNTRYSIDE -- DAY\n\n\n          \n          SUBTEXT:   \"Ireland\"\n\n          \n          From behind we see two men perched atop a boulder. A flock of sheep\n          encircles them. Their army sacks and shotguns are nearby. They roll\n          their own cigarettes with effortless synchronicity and light up.\n          CONNOR and MURPHY MacMANUS (30's) now have long hair with heavy\n          facial growth. Rugged. Piercing eyes. Looking to the horizon...\n\n          \n\n                                 MURPHY\n                     Looks like a storm's comin'.\n\n          \n\n                                 CONNOR\n                     Aye.\n\n          \n\n          EXT. FIELDS -- LATER\n\n\n          \n          MOODY MUSIC: The brothers drive the flock across jewel green hills.\n          Murphy cuts a sheep from a thicket and sets it off.\n\n          \n\n                                 POPPA M V.O.\n                     Peace, they say, is the enemy of\n                     memory. So it had been for my boys.\n\n          \n\n                                                                           2.\n\n          \n\n          \n          Connor shares some jerky with a sheep dog as the flock surges.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    For some time now, their past had felt\n                    like a dream to them...faded and worn.\n\n          \n          Murphy touches the faded Celtic Cross tattoo on his forearm. Connor\n          sees. The music takes us to a secluded, pioneer-esque ranch.\n\n          \n          CLOSE ON: POPPA M's (58yrs) face as he coughs and watches his sons\n          approach from his rocking chair on the porch.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    And then suddenly, as if not a day had\n                    passed...it was back. I could see it\n                    in their eyes.\n\n          \n\n          INT. FARMHOUSE -- NIGHT\n\n\n          \n          Poppa M and his sons eat a rustic dinner.   It storms outside.\n\n          \n\n                                POPPA M V.O.\n                    I could feel it, heavy in their\n                    presence. Something calling them back.\n\n          \n          Poppa M looks to his boys who just keep eating. DIP TO BLACK...\n\n          \n\n          INT. FARMHOUSE, FRONT PORCH -- NEXT MORNING\n\n\n          \n          Very early dawn, shadowy morning light. Connor and Murphy sip\n          coffees and look out into the rain. Lightening lights up the flock.\n\n          \n          Through the open door behind them, Poppa M stokes a warm fire.\n\n          \n          Connor touch the Celtic Cross tattoo on his forearm. The boys look\n          at each other as the rain suddenly stops and all the \"little sounds\"\n          of morning cease. Something's amiss. Thunder. Ominous music as...\n\n          \n\n          EXT. BOSTON, TRINITY CHURCH -- NIGHT\n\n\n          \n          From behind, we see a man with a CREW CUT, staring at the dome of\n          the Trinity.\n\n          \n          SLO-MO, CLOSE ON: Crew Cut's boots as he paces toward.    The\n          threatening music bleeds over to...\n\n          \n\n          EXT. FARM -- MOMENTS LATER\n\n\n          \n          Just inside the trees, a pack of wolves stalk the sheep flock...\n\n          \n          SLO-MO, CLOSE ON:   A wolf's paws as it paces toward...\n\n          \n          We intercut between BOSTON and IRELAND as chaos erupts...\n\n          \n\n                                                                           3.\n\n          \n\n          \n          BOSTON:    Crew Cut quickly enters the church.\n\n          \n          IRELAND:    The wolves burst from the tree line.\n\n          \n          BOSTON: A frantic priest in his 50's weeps and begs as Crew Cut\n          slams him to his knees with a .9 mm to his head.\n\n          \n          IRELAND:   The wolves savagely attack the screaming sheep.\n\n          \n          BOSTON:    Muzzle flash, blood splatters on the altar.\n\n          \n          IRELAND: BOOM! BOOM! Connor and Murphy blast shotguns at the\n          wolves. One is hit, the rest retreat. The boys perform mercy\n          killings on the wolf and one sheep.\n\n          \n          Everything calms as Poppa M rushes up with a mag light and stops.\n          He coughs roughly. Moody choral music begins...\n\n          \n\n                                  POPPA M V.O.\n                      \"And they cried out, How long O'Lord\n                      dost thou not judge and revenge our\n                      blood upon them that dwell on the\n                      earth?\"\n\n          \n\n          EXT. FIELD -- LATER\n\n\n          \n          The boys toss the wolf carcass onto a bonfire.     It rains again.\n\n          \n\n                                  POPPA M V.O.\n                      And God said, \"All will fear the wrath\n                      of the lamb. For the great day of\n                      their reckoning hath come.\"\n\n          \n          Poppa M looks across the blaze to his sons. Connor and Murphy stare\n          into the fire, bathed in the light of angry flames.\n\n                                  POPPA M\n                      \"And they that holdest my name shall\n                      come with the shaking of the earth and\n                      the roiling of the oceans.\"\n\n          \n\n          EXT. FARM -- NIGHT\n\n\n          \n          Downpour. A rugged old jeep tears through the mud. It stops at the\n          farmhouse. Poppa M and the boys come out onto the porch. A dark\n          figure with a fedora and rain slicker exits the jeep and hurries to\n          the porch. Meet Uncle SIBEAL (62yrs). He wears a priest's collar.\n\n          \n\n                                  SIBEAL\n                      Something's happened.\n\n          \n\n                                                                           4.\n\n          \n\n          \n\n          EXT. CHURCH -- MORNING\n\n\n          \n          Breaking news. REPORTER #1 is live from outside a church.   Squads,\n          coroner's vans, CSI etc. Police hold back crowds.\n\n          \n\n                                REPORTER #1\n                    There is no new information on the\n                    victim found slain this morning inside\n                    Trinity Church. As you can see the\n                    size of the crowd here has increased\n                    substantially over the last couple of\n                    hours. People are demanding answers as\n                    to how a priest could be murdered in a\n                    church. But perhaps more shocking, we\n                    have confirmed that the body was\n                    ritualized with pennies in the eyes.\n                    Many remember this as the grisly\n                    calling card of the prolific vigilante\n                    killers known as the Saints, who went\n                    on a murder spree here in Boston.\n\n          \n          NEWS FOOTAGE:   People scream as they run out of a courthouse.\n\n          \n\n                                REPORTER #1 V.O.\n                    A rampage that ended six years ago,\n                    when the Saints brazenly walked into\n                    open court...\n\n          \n          NEWS FOOTAGE:   A body is wheeled out on a gurney.\n\n          \n\n                                REPORTER #1 V.O. (CONT'D)\n                    ...and executed Mafia Don, Poppa Joe\n                    Yakavetta before a courtroom of\n                    terrified witnesses, then simply\n                    disappeared without a trace.\n          Grainy, unclear security footage of three men walking the court\n          halls, two in heavy black jackets, one in a trench...\n\n          \n\n                                REPORTER #1 V.O. (CONT'D)\n                    The now legendary security camera\n                    footage from that harrowing day, our\n                    singular tiny glimpse of these infamous\n                    and controversial killers.\n\n          \n          We are back with Reporter #1 at the church.\n\n          \n\n                                REPORTER #1\n                    As police have yet to confirm the\n                    Saints' possible involvement, the\n                    ominous question hangs heavy in the\n                    air. \"Are they back?\"\n\n          \n\n                                                                         5.\n\n          \n\n          \n\n          INT. FARMHOUSE -- NIGHT\n\n\n          \n          Sibeal, Poppa M, Connor and Murphy sit around the table.   The boys\n          have a look of controlled anger. Presently...\n\n          \n\n                                  MURPHY\n                    The priest.    Did they release his name?\n\n          \n\n                                SIBEAL\n                    No. But I made a few calls, still got\n                    some friends in the diocese there.\n                    McKinney. Father Douglas McKinney.\n\n          \n          The boys flash with recognition.\n\n          \n\n                                SIBEAL (CONT'D)\n                    You knew him?\n\n          \n\n                                CONNOR\n                    Knew of him. Everybody did. A regular\n                    Mother Theresa. Youth hostels, soup\n                    kitchens. Even made it into the\n                    newspapers sometimes.\n\n          \n          Sibeal considers this.    He genuflects and turns.\n\n          \n\n                                SIBEAL\n                    Listen boys. I think it's best that ya\n                    just stay put and we'll try ta figure\n                    out what...\n\n          \n          Connor and Murphy are out the door and headed for the barn.\n          Confused, Sibeal looks to Poppa M, who just sips his coffee.\n\n          \n\n          INT. BARN -- MOMENTS LATER\n\n          MOODY MUSIC: The boys begin to look more like \"themselves\" as the\n          they cut their hair and beards with sheep sheers.\n\n          \n          The brothers lift a chest from a hole in the barn floor. They load\n          guns and money into black duffel bags and place their signature\n          rosaries around their necks, clasping their hands in prayer...\n\n          \n\n          INT. TRINITY CHURCH, ALTER -- MOMENTS LATER\n\n\n          \n          Detective GREENLY (38yrs) is alone on the alter. Police line all\n          around as Greenly stares at the body like the detective has seen a\n          ghost. He turns and nervously staggers toward the front vestibule.\n\n          \n\n          INT. VESTIBULE -- SAME TIME\n\n\n          \n          Detectives DOLLY and DUFFY are scared.   In hushed tones...\n\n          \n\n                                                                           6.\n\n          \n\n          \n\n                                DUFFY\n                    We need to keep our heads, here.   It's\n                    probably not even them.\n\n          \n\n                                DOLLY\n                    Of course it ain't them but that\n                    doesn't really matter, does it. Our\n                    skeletons just came screaming out of\n                    the closet. We're fucked.\n\n          \n\n                                DUFFY\n                    We're not fucked.\n\n          \n          Greenly enters from the church proper.   Dolly and Duffy turn.\n\n          \n\n                                GREENLY\n                    We are totally fucked!\n\n          \n\n          EXT. RAPID FLASHBACK SEQUENCE, \"ACCESSORY TO MURDER\"\n\n\n          \n          Greenly, disguised as a correctional officer, lets Connor, Murphy\n          and Poppa M out of a paddywagon. FLASH!\n\n          \n          The Saints enter the Suffolk Courthouse, undetected.   FLASH!\n\n          \n          Dolly, dressed as a civilian, pulls the fire alarm.    FLASH!\n\n          \n          The Saints execute Poppa Joe Yakavetta before many terrified\n          witnesses, the alarm blaring in the b.g. FLASH!\n\n          \n\n          INT. BACK TO PRESENT, VESTIBULE -- MOMENTS LATER\n\n\n          \n\n                                GREENLY\n                    ...and not just fucked, like elephant\n                    dick, pounded in the ass, no reach\n                    around, jungle fucked!\n\n                                DUFFY\n                    Now's not the time to panic, Green\n                    beans!\n\n          \n\n                                GREENLY\n                    Oh, I disagree. Now's the perfect time\n                    to panic. We're all Accessories to...\n\n          \n\n                                DOLLY\n                    Don't you fucking say it!\n\n          \n          They all argue over one another. OFFICER #1 peaks his head in the\n          front door. The detectives grind to a halt.\n\n          \n\n                                OFFICER #1\n                    Her E.T.A. is ten minutes.\n\n          \n\n                                                                           7.\n\n          \n\n          \n\n          EXT. GRAVEYARD -- MORNING\n\n\n          \n          CLOSE ON:   a gravestone.   \"Paul M. Smecker,    1956 - 2003\"\n\n          \n          We reveal a pair of sexy female legs, expensive \"Jimmy Choo\" heels.\n          From behind we see the woman rest a rose at Smecker's Grave. \"Legs\"\n          turns and walks toward a waiting squad car in b.g.\n\n          \n\n          EXT. CHURCH -- MOMENTS LATER\n\n\n          \n          Dolly, Duffy and Greenly stand outside in the entry way of the\n          church. Though still on edge, they have calmed.\n\n          \n\n                                  DOLLY\n                      I didn't even know he had a protege.\n                      What is this bullshit?\n\n          \n          Duffy whips out his trusty note pad.\n\n          \n\n                                  DUFFY\n                      Special Agent Eunice Bloom, 32 years\n                      old. Smecker plucked her right out of\n                      class at Quantico.\n\n          \n\n                                  GREENLY\n                      Smecker hand picked her? Aw, man.\n                      This brawd's gonna be a nightmare.\n\n          \n\n                                  DUFFY\n                      She was assigned to OCD two years back.\n                      She can shoot a gun, set three course\n                      records during her training.\n\n          \n\n                                 GREENLY\n                      Great. A bull dike, Annie Oakley wanna-\n                      be. We gotta get rid of her.\n\n                                  DUFFY\n                      She is also an authority on the Saints\n                      case. Which means Smecker must have\n                      walked her through it.\n\n          \n          The cops suddenly flush with fear.\n\n          \n\n                                  DOLLY\n                      And the hits just keep on comin'.\n\n          \n\n          INT. FARMHOUSE -- MOMENTS LATER\n\n\n          \n          Sibeal waits as Poppa M thinks, then shakes his head.\n\n          \n\n                                                                       8.\n\n          \n\n          \n\n                                POPPA M\n                    Naw...I'm in no condition.   I'd just\n                    slow 'em down.\n\n          \n\n                                SIBEAL\n                    Well, are ya at least gonna try ta talk\n                    them out of this?\n\n          \n          Poppa M shakes his head.\n\n          \n\n                                SIBEAL (CONT'D)\n                    We don't even know what this is yet!\n                    Somebody could just be tryin' ta get\n                    away with murder here!\n\n          \n\n                                POPPA M\n                    Aye. Only there's about a thousand\n                    easier ways ta do that. Trust me.\n                    Someone's callin' them out, Sibeal. Ya\n                    kill a priest in a church and make it\n                    look like they did it. Bring 'em back\n                    with a vengeance. Don't know who.\n                    Don't know why. But someone thinks\n                    he's real fuckin' clever. Only one\n                    problem with his little plan.\n\n          \n\n                                  SIBEAL\n                    What's dat?\n\n          \n\n                                  POPPA M\n                    It worked.\n\n          \n          Fear and frustration burst from Sibeal.\n\n          \n\n                                SIBEAL\n                    Jesus Christ! D'er's too much we don't\n                    know and if you're won't at least try\n                    ta talk some sense into them, I will!\n\n          \n          The door opens and in comes Connor and Murphy. Sibeal notes the\n          change in appearance. The boys stand at the kitchen table's\n          opposing end, hands in their pockets. Their resolve fills the room.\n\n          \n          The brothers face off with Poppa M and Sibeal: a bizarre board\n          meeting. Poppa M cocks a brow at Sibeal who clears his throat.\n\n          \n\n                                SIBEAL (CONT'D)\n                    Exactly what do you intend to do?\n\n          \n          Silence. Nobody moves. Connor withdraws a hand from his pocket and\n          looks down. He flips a penny on the table. It clatters to a stop.\n\n          \n\n                                                                          9.\n\n          \n\n          \n\n                                 MURPHY\n                     Every last motherfucker that had\n                     anything to do with it.\n\n          \n\n          EXT. CHURCH -- LATER\n\n\n          \n          A squad pulls up.    Dolly, Duffy and Greenly turn.\n\n          \n\n                                  DOLLY\n                     Game time.   How are we playing this?\n\n          \n\n                                 DUFFY\n                     Feds love to pull the divide and\n                     conquer routine. We hard line her.\n                     Stick together on this. Agreed?\n\n          \n\n                                  DOLLY\n                     Agreed.   We're a brick wall.\n\n          \n          They all nod and stiffen their resolve.\n\n          \n\n                                 GREENLY\n                     Let's rock this bitch.\n\n          \n          Rockin' music fades in as a uniform opens the squad door.\n\n          \n          SLO-MO:   EUNICE BLOOM (32yrs) exits the squad and moves toward.\n\n          \n          She is simply delicious: sexy, blonde hair, a woman's business\n          suit, short skirt, brass rimmed specs. Each detective's face drops.\n          Soon she is before them. Music cuts. She smiles and speaks with a\n          southern drawl a la Doc Holiday.\n\n          \n\n                                 EUNICE\n\n                              (POINTING)\n                     You hafta be Detectives Dolly and\n                     Duffy. Am I right?\n                              (extending hand)\n                     Eunice Bloom. A pleasure.\n\n          \n          Dolly and Duffy shake and manage a nod.    Greenly is still enamored.\n\n          \n\n                                 EUNICE (CONT'D)\n                     And you must be Greenly. Smecker\n                     always said you were the funny one.\n\n          \n\n                                 GREENLY\n                     T'sup...I mean, what? Yeah, well,\n                     funny as in ha ha, though not like\n                     funny as in gay cuz...I'm not...played\n                     high school football.\n\n          \n          She chuckles.   Dolly and Duffy fume.\n\n          \n\n                                                                            10.\n\n          \n\n          \n\n                                DOLLY\n                    Look, with all due respect, Agent\n                    Bloom...\n\n          \n\n                                 EUNICE\n                    Special.\n\n          \n\n                                 DOLLY\n                    Excuse me?\n\n          \n\n                                EUNICE\n                    You see there's a \"special\" before my\n                    \"agent.\" If we are going to address\n                    each other formally, I'd prefer if you\n                    popped it in there. Makes me feel, I\n                    don't know...special. Of course, I'd\n                    hoped we could be a little more\n                    personable. In fact, I'd like you to\n                    call me Eunice.\n\n          \n          The cops are dumbfounded.      Duffy snaps out of it.\n\n          \n\n                                DUFFY\n                    O'kay, Eunice. I don't see why the\n                    fuck the Fed is...\n\n          \n\n                                EUNICE\n                    Whoa, whoa, \"fuck?\" This isn't a\n                    \"fuck\" situation, is it? I can see a\n                    \"God Damn\" or two but why skip all the\n                    way to \"fuck\" right off the bat? Let's\n                    start slow and work our way up to it.\n\n          \n\n                                DUFFY\n                    What is the Fed's interest in this?\n          The detectives harden, brick wall.     Eunice furrows her brow.\n\n          \n\n                                EUNICE\n                    Their interest, Detective, is capturing\n                    the men responsible for the murders of\n                    22 of Boston's finest criminals. Y'see\n                    public perception is that these boys\n                    stepped in, did our jobs for us and\n                    then disappeared into thin air as we\n                    fecklessly searched for them. The FBI\n                    tends to take exception to such things.\n                    They coulda sent anyone. They sent me.\n                    Why do you think that is?\n\n                             (BEAT)\n                    Well, since we've broken the \"Fuck\n                    Barrier,\" allow me to be blunt.\n\n                                (MORE)\n\n          \n\n                                                                         11.\n\n                                EUNICE (CONT'D)\n                    It is because I am so fucking smart\n                    that I make smart people feel like\n                    retards. Now, we seem to be getting\n                    off on the wrong foot here. I'd\n                    appreciate a bit of cooperation. Let's\n                    chalk it up to paying respect to the\n                    memory of a dearly departed mutual\n                    friend. A man who taught me everything\n                    I know.\n\n          \n          After a moment of consideration, the cops concede with nods.\n\n          \n\n                                EUNICE (CONT'D)\n                    Lovely.\n                             (re: crowd)\n                    Now what's with the circus?\n\n          \n\n                                DUFFY\n                    The victim was killed late last night.\n                    When people gathered for morning mass,\n                    they found the front entrance chained\n                    and padlocked. A locksmith came out,\n                    cut the chain and surprise, surprise.\n                    Cell phones. Half of them called the\n                    cops. Half of them called the media.\n                    But regardless...word's out.\n\n          \n          Eunice turns and looks over the crowd.\n\n          \n\n                                EUNICE\n                    And it looks like that's just the way\n                    somebody wanted it. What say we scrape\n                    the shit off this cow's ass, fellas?\n                    Detective Greenly? Escort a lady onto\n                    the crime scene?\n\n          \n\n                                 GREENLY\n                    What?   No, yeah, no.   Of course.\n\n          \n          Greenly escorts her as Dolly and Duffy walk behind, mystified.\n\n          \n\n                                GREENLY (CONT'D)\n                    Do you want a cup of coffee or\n                    something?\n\n          \n\n                                EUNICE\n                    Never touch the stuff.\n\n          \n\n          INT. VESTIBULE -- MOMENTS LATER\n\n\n          \n          Eunice stands, looking down the aisle at the altar. Behind her, the\n          Detectives are curios as Eunice slides on pink latex gloves.\n\n          \n\n                                                                        12.\n\n          \n\n          \n          She puts in ear plugs and all ambient sound ceases.   She starts\n          slowly down the aisle...\n\n          \n          TOTAL SILENCE AS...Eunice inspects the smashed door of a\n          confessional booth. She looks over the body closely then turns from\n          the altar and walks to the detectives. She pulls her earplugs and\n          all sound returns.\n\n          \n\n                                EUNICE\n                    It wasn't them...but I'm sure you boys\n                    already knew that.\n\n          \n          The detectives nod.\n\n          \n\n                                DUFFY\n                    The two \"V's.\" The victim and venue\n                    don't add up.\n\n          \n\n                                EUNICE\n                    Let's go with the venue first. Our\n                    perpetrators are devout. They would\n                    never commit such an act on sacred\n                    ground. And as for the victim?\n\n          \n\n                                DOLLY\n                    All their vics were criminals. Clearly\n                    not the case here. So, it wasn't them\n                    which means this is a local matter and\n                    it falls under our jurisdiction. No\n                    need for Federal involvement so with\n                    all due respect...we'll see you later,\n                    Special Agent Bloom.\n\n          \n          Eunice stands right in front of Dolly.\n\n          \n\n                                EUNICE\n                    Man, I hate it when people say that.\n                    \"With all due respect.\" Because it is\n                    inevitably followed by a disrespectful\n                    remark. I'll give you an example.\n                    With all due respect, Detective, this\n                    matter falls under whatever\n                    jurisdiction I fuckin' say it does.\n\n          \n          Dolly fumes.   Duffy and Greenly share an \"oh shit\" look.\n\n          \n\n                                DUFFY\n                    Uh, so...let's just...what can you tell\n                    us about the shooters?\n\n          \n\n                                                                       13.\n\n          \n\n          \n\n                                EUNICE\n                    Shoo-ter. Singular. And I can tell\n                    you that he is left handed and how\n                    shall I put this delicately...? He's a\n                    short bastard.\n\n          \n\n                                DOLLY\n\n                             (FACETIOUS)\n                    One guy, lefty, short.   Got it.\n\n          \n          Eunice furrows her brow.\n\n          \n\n                                EUNICE\n                    I'll show you what I'm talking about.\n\n          \n\n          INT. CHURCH, ALTAR -- MOMENTS LATER\n\n\n          \n          Close up on Greenly's enraptured face. We pull back and see he is\n          on his knees before Eunice and staring longingly between her legs.\n\n          \n\n                                EUNICE\n                    Detective Greenly, you're the victim.\n\n          \n\n                                 GREENLY\n                    David.   You can call me David.\n\n          \n\n                                EUNICE\n                    Very well, David.\n\n          \n          Duffy and Dolly stand behind Greenly, chest to chest, each mimicking\n          guns to the back of the kneeling cop's head.\n\n          \n\n                                EUNICE (CONT'D)\n                    The Saints' signature stance. Copley\n                    Plaza Hotel four years ago. Two men of\n                    identical height put Yuri Petrova on\n                    his knees and each dropped iron to the\n                    back of his head.\n\n          \n          This is torture for Greenly and he turns his head from Eunice's\n          crotch. She immediately adjusts him back into place.\n\n          \n\n                                EUNICE (CONT'D)\n                    Eyes front, David. The position of the\n                    victim and the angles produced by the\n                    killers' stance created a unique\n                    scenario. The bullets criss crossed in\n                    the skull and exited the eye sockets.\n                    Here, this did not occur. The rounds\n                    moved on a straight trajectory through\n                    the back of the victim's head and out\n                    the front. Which happens when...\n\n          \n\n                                                                       14.\n\n          \n\n          \n          Eunice circles around, positioning herself between Dolly and Duffy.\n          She aims both hands to the back of Greenly's head.\n\n          \n\n                                DUFFY\n                    ...one guy's holding two guns to the\n                    back of your head.\n\n          \n\n                               EUNICE\n                    One guy.\n\n          \n\n          INT. FLASHBACK, CHURCH -- NIGHT BEFORE\n\n\n          \n          Crew Cut holds two guns to the back of the pleading priest's head.\n          He fires and McKinney falls. Crew Cut steps forward and we see his\n          face in the light. Piercing, ice blue, sociopathic eyes. WHIP PAN!\n\n          \n\n          INT. BACK TO PRESENT, CHURCH -- MOMENTS LATER\n\n\n          \n\n                                EUNICE\n                    Now, the victim falls forward.   If you\n                    please, David.\n\n          \n          Greenly lays flat on his stomach.\n\n          \n\n                                EUNICE (CONT'D)\n                    The killer approached the body from the\n                    left side...\n                             (Eunice approaches)\n                    ...and flipped him to the right.\n\n          \n\n                                DUFFY\n                    Left handed.\n\n          \n\n                                EUNICE\n                    Yep, southpaw.\n\n          INT. FLASHBACK, CHURCH -- NIGHT BEFORE\n\n\n          \n          Crew Cut flips the body, showing little respect. He pulls out two\n          pennies and looks at them. He chuckles. WHIP PAN...\n\n          \n\n          INT. BACK TO PRESENT, CHURCH -- MOMENTS LATER\n\n\n          \n\n                                DOLLY\n                    But you said he was wicked short.\n\n          \n\n                                EUNICE\n                    The Saints were later determined to be\n                    five foot eleven inches tall. It's\n                    just dumb luck that the Russian and\n                    McKinney are the exact same height.\n\n          \n          Eunice kneels, putting her pointer fingers just below Greenlys eyes.\n\n          \n\n                                                                          15.\n\n          \n\n          \n\n                                  EUNICE (CONT'D)\n                      The rounds exited Petrova's eye balls.\n                      Here they came out the lower cheek.\n\n          \n          She slides her fingers to Greenly's lower cheeks.    He's putty.\n\n          \n\n                                  EUNICE (CONT'D)\n                      Three, four inches below the eyes.\n\n          \n\n                                  DOLLY\n                      That puts him at five, seven-ish.\n                      That's not uncommonly short.\n\n          \n          Eunice stands and points the a broken down confessional booth door.\n\n          \n\n                                  EUNICE\n                      The killer posed as a late night\n                      confessor. Once the victim entered the\n                      booth the killer had him isolated. No\n                      escape. Short stuff exits his\n                      confessional and kicks in the door of\n                      the priest's chamber...\n\n          \n\n          INT. FLASHBACK, CHURCH -- NIGHT BEFORE\n\n\n          \n          Crew Cut exits his confessional and kicks in the priest's door.       He\n          pulls the terrified cleric out. Close on a gash in the door.\n\n          \n\n                                  EUNICE V.O.\n                      ...leaving a crescent shaped\n                      indentation which indicates that this\n                      cowboy was wearing a boot with a\n                      pronounced heel.\n\n          \n\n          WHIP PAN!\n\n          INT. BACK TO PRESENT, CHURCH -- MOMENTS LATER\n\n\n          \n\n                                  EUNICE\n                      Gave him a couple inches. We're\n                      looking at about five foot five,\n                      gentlemen.\n\n          \n\n                                  GREENLY\n                      That's wicked short.\n\n          \n\n                                 EUNICE\n                      Wicked.\n\n          \n\n          EXT. OPEN SEA -- DAY\n\n\n          \n          We drift over open sea to a huge cargo freighter, the Killian\n          Farris, plodding toward Northeast.\n\n          \n\n                                                                         16.\n\n          \n\n          \n\n          INT. SHIP'S DRY STORAGE LOCK -- MOMENTS LATER\n\n\n          \n          Connor and Murphy stack grain.    A MEXICAN SEAMAN (23yrs) appears...\n\n          \n\n                                DECK HAND\n                    They're brawling in the hold!    Better\n                    get your bets in now!\n\n          \n\n          INT. SHIP'S HOLD -- MOMENTS LATER\n\n\n          \n          Seamen cheer as a large, ruffian GIANT (33yrs) and a Latino fight.\n          David and Goliath. Meet ROMEO (30yrs), pony tail, shorn sides and a\n          perpetual smile. Romeo's hands are chained behind him.\n\n          \n          Romeo bobs, weaves and fakes, avoiding many punches. The Giant\n          spews angry French all the while. The boys step up as money moves\n          and men bet. Connor to the same Mexican Seaman in Spanish.\n\n          \n\n                                CONNOR\n                    Why are his hands chained?\n\n          \n\n                                MEXICAN SEAMAN\n                    Romeo's fast, man. He says the\n                    Frenchman can't lay a hand on him.\n\n          \n\n                                MURPHY\n                    But he can't hit him back.\n\n          \n\n                                MEXICAN SEAMAN\n                    That's the bet. He's got to last five\n                    minutes.\n\n          \n\n                                MURPHY\n                             (to Connor, English)\n                    This guy's fuckin' crazy.\n          The brothers whip out money and give it to the Sailor.\n\n          \n\n                                BOTH\n                    Fifty on the Mexican.\n\n          \n          We track with the fighting. Tattooed across Romeo's back, \"LA\n          RAZA.\" Nearby, French ROUGHNECKS #1 and #2 scream in their native\n          tongue to the Giant and he stops and rests.\n\n          \n\n                                ROMEO\n                    You should never fight a Mexican,\n                    Frenchy. Pound for pound, the toughest\n                    mother fuckers on earth. Know why? We\n                    like pain. We like it, Pierre. I mean\n                    think about it, \"tabasco sauce.\" What\n                    kinda fucked up people would even\n                    invent that shit?\n\n          \n\n                                                                        17.\n\n          \n\n          \n          The Giant swings but Romeo slides under his legs. Cheers! Romeo\n          jumps up, swinging his hands under his feet, still bound but in\n          front of him now.\n\n          \n\n                                ROMEO (CONT'D)\n                    Don't be scared. Remember, I can't hit\n                    you. I ain't gonna hit ya.\n                             (avoiding blows)\n                    Ain't gonna hit ya. Ain't gonna...\n\n          \n          Romeo catches his opponent's wrist and wraps his chain around. A\n          kick in the stomach drops the Giant to his knees. Romeo locks the\n          man's head between his legs, scissor hold.\n\n          \n\n                                  ROMEO (CONT'D)\n                    Ooooo.    Found the loophole, bitch!\n\n          \n          The Giant falls. Romeo keeps his wrist locked as he chokes him out.\n\n          \n\n                                ROMEO (CONT'D)\n                    Aughtta be a lawyer! Got the 'fine\n                    print on y'ass! Pursuant to! Pro\n                    bono! Pari Pasu! I'll knock you out\n                    on contingency, mother fucker.\n\n          \n          The Giant passes out and Romeo stands to cheers.   Roughneck's #1 and\n          #2 fume as Romeo takes a bow. The boys clap.\n\n          \n\n          INT. HATCHWAY -- MOMENTS LATER\n\n\n          \n          Romeo emerges from the head, chains still on. Roughnecks #1 and #2\n          move down the hatchway toward him, wielding metal pipes. He looks\n          at his chains.\n\n          \n\n                                 ROMEO\n                    Oh, shit.   FIRE! FIRE!\n          The brothers emerge from the shadows, cutting them off.\n\n          \n\n                                ROUGHNECK #1\n                    Out of zee way!\n\n          \n          The boys speak French. At first, the Roughnecks are surprised but\n          the argument escalates. The Roughnecks swing their pipes and in a\n          brutal display, the boys dispatch them quickly, leaving one\n          unconscious and the other gasping for air. The boys turn...\n\n          \n\n                                  ROMEO\n                    Whoa!    Uh, merci, uh, si vous plait.\n\n          \n\n                                MURPHY\n                    Just protectin' our investment.   Ya\n                    made us fifty bucks.\n\n          \n\n                                                                          18.\n\n          \n\n          \n\n                                   ROMEO\n                       Oh, thank, God. Irish, huh?   Finally\n                       some class. I'm Romeo.\n\n          \n\n                                   CONNOR\n                                 (shaking hands)\n                       Connor.\n\n          \n\n                                    MURPHY\n                       Murphy.   Why were you yellin' \"fire\"?\n\n          \n\n                                   ROMEO\n                       I heard you were supposed to on t.v.\n\n          \n\n                                   CONNOR\n                       That's if you're gettin' raped.\n\n          \n\n                                   ROMEO\n                       Oh...I'd be more inclined to go with\n                       something like, \"THAT DOESN'T GO THERE,\n\n                       MAN!\"\n\n          \n          They laugh as they move to the semi-conscious Frenchman.\n\n          \n          LOW ANGLE:    looking up at our trio, Romeo is in the middle.\n\n          \n\n                                   ROMEO (CONT'D)\n                       We saved your entire fucking country in\n                       World War Two! Gee...thanks for the\n                       statue!\n\n          \n          Romeo's foot smashes to camera, blacking us out.\n\n          \n\n          INT. VESSEL, BERTH -- NIGHT\n\n\n          \n          The boys slumber, side by side in hammocks.     We pull close on them.\n          Silence. They whisper in unison...\n\n          \n\n                                   BOTH\n                       Quis praesumis profanus apud Dominus?\n\n                                (SUBTITLES)\n                       Who dares trespass in the house of God?\n\n          \n          Their eyes pop open.\n\n          \n\n          INT. BERTH -- LATER\n\n\n          \n          Murphy rigs a needle to an ink pen. Connor clicks on a hot plate.\n          The boys listen intently to a tiny hand radio nearby.\n\n          \n\n                                   RADIO ANNOUNCER V.O.\n                       People are still in shock as Father\n                       McKinney was a beloved local cleric.\n\n                                   (MORE)\n\n          \n\n                                                                        19.\n\n                                RADIO ANNOUNCER V.O. (CONT'D)\n                    His selfless contributions to the\n                    community too numerous to list. In\n                    related news, second generation crime\n                    boss, Concezio Yakavetta has not\n                    commented on whether he fears for his\n                    own safety.\n\n          \n          The boys flash with recognition.\n\n          \n\n                                 BOTH\n                    Yakavetta?\n\n          \n\n          INT. HIGH CLASS HOME, DINING ROOM -- NIGHT\n\n\n          \n          Rich, Italian decor, long table, laden with food. CAPOS 1-6 sit in\n          utter shock, looking to their boss, CONCEZIO YAKAVETTA (37yrs) who\n          heads the table.\n\n          \n\n                                CONCEZIO\n                    So, there it is. I want everyone to\n                    feel free to share their thoughts.\n\n          \n          He returns to eating. A moment of silence then the Capos burst into\n          anger. Capo #1 slams a fist down and stands, silencing the lot.\n\n          \n\n                                CAPO #1\n                    I can't believe none of us were\n                    consulted on this! The disrespect!\n                    We'd have never okay'd such a thing!   A\n                    priest! It's an infamita!\n\n          \n\n                                CAPO #2\n                    Yeah! Are we not Catholics, for Christ\n                    fucking sakes?!\n\n          \n\n                                CAPO #3\n                    And just for simple revenge?! There's\n                    no business in it! You've put us all\n                    at risk here! The cops could be all\n                    over us!\n\n          \n\n                                CAPO #4\n                    Forget the cops! What about these\n                    Saints fuckers?! These guys were long\n                    gone! And now you're trying to bring\n                    the devil right back to our doorstep?!\n\n          \n          Concezio wipes his mouth, stands and adjusts his cuffs.   He slowly\n          circles the table as he speaks.\n\n          \n\n                                                                20.\n\n          \n\n          \n\n                                CONCEZIO\n                    Six years ago, with the backing of an\n                    adoring public, these vigilante fucks\n                    put my father on his knees and executed\n                    him...in public. Mi Patrigno, a blood\n                    relative and benefactor to all of you.\n                    Poppa Joe made you rich and his murder\n                    remains un-revenged...\n\n          \n          A few roll their eyes at this verbal blunder.\n\n          \n\n                                CONCEZIO (CONT'D)\n                    This too, is infamita. These homicidal\n                    maniacs nearly wiped this family out.\n                    It's taken a lot of time to build\n                    ourselves up again, brick by brick.\n                    And now that we've re-acquiesced our\n                    original power, can we really afford to\n                    have these guys pop out of the woodwork\n                    someday and try to finish the job when\n                    we least expect it? Now, for those of\n                    you who have forgotten, let's recap.\n                    These fuckers walk into rooms full of\n                    gangsters...\n                             (denotes surroundings)\n                    Outnumbered, outgunned. They kill\n                    everyone...and leave.\n\n          \n          Some look as if they are starting to get his point.\n\n          \n\n                                CONCEZIO (CONT'D)\n                    You think I don't know that each one of\n                    you's been waking up in night sweats\n                    over this the last couple years? These\n                    sons of bitches prison fucked us with\n                    no lube, wiped their dicks on our\n                    drapes and walked away! And we been\n                    living in silent fear ever since. Oh,\n                    we don't talk about it. Rape victims\n                    often don't. But it's there. Knowing\n                    they're still out there, somewhere.\n                    Thinking...what if?\n\n          \n          Fear and realization.\n\n          \n\n                                CAPO #4\n                    Concezio is right. Pretending you\n                    don't got a problem don't solve\n                    nothing.\n\n          \n          Heads nod in shameful agreement.\n\n          \n\n                                                                        21.\n\n          \n\n          \n\n                                CONCEZIO\n                    Thank you, Doctor Phil. So, let's take\n                    a moment to look at the serendiplious,\n                    diperous, serendip...\n\n                             (FRUSTRATION)\n                    ...type situation we find ourselves in\n                    here. There's a good chance they'll\n                    show. No catching us with our pants\n                    down this time. We can deal with them\n                    proactivitously. The cops were\n                    embarrassed by these guys too. With a\n                    second bite at the apple, they got\n                    every reason in the world to crank up\n                    the heat. And as for their doting\n                    public. I'd imagine they're gonna lose\n                    a few fans.\n\n          \n          Heads nod all around.   Sold.\n\n          \n\n          INT. BERTH -- LATER\n\n\n          \n          Murphy sits, bare chested on a crate. With the rigged pen, he\n          tattoos his brother's back. Connor cooks something, in a pot, on\n          the hot plate. The resin of anger is evident.\n\n          \n          TATTOOS: Murphy's back has the crucified feet of Christ and\n          Connor's shows Christ's downcast head on the cross.\n\n          \n\n                                CONNOR\n                    The prodigal son, huh?   He wants us,\n                    he's fuckin' got us.\n\n          \n\n                                MURPHY\n                    But why would he do something so\n                    public?\n\n                                CONNOR\n                    Think about it. People figure we did\n                    it. Makes it more likely someone will\n                    drop a dime. Way easier to get to us\n                    in prison, isn't it, now.\n\n          \n          The berth door is slightly ajar. In pops a bottle of Whiskey, then\n          Romeo's head. He's expecting a cheer but the brothers have their\n          backs to him. He's instantly taken by their ink.\n\n          \n\n                                MURPHY\n                    But how would anyone recognize us?\n\n          \n\n                                CONNOR\n                    You don't remember those sketches on\n                    the news channel?\n\n          \n\n                                                             22.\n\n          \n\n          \n\n                                MURPHY\n                    Shit. That's right. Y'know, every\n                    time they show those composites on TV\n                    and then they catch the guy, it looks\n                    nothin' like him. But ours?\n\n          \n\n                                CONNOR\n                    Just our luck. We get Leonardo fuckin'\n                    Divinci as a sketch artist.\n\n          \n          Romeo listens with suspicion.\n\n          \n\n                                MURPHY\n                    Maybe we should dye our hair.\n\n          \n\n                                CONNOR\n                    What?\n\n          \n\n                               MURPHY\n                    Yeah. These guys are always dyin'\n                    their hair. You know, like in \"The\n                    Fugitive.\" It's covert and shit.\n\n          \n            Connor smirks privately.\n\n          \n\n                                CONNOR\n                    What color would you dye it?\n\n          \n\n                                MURPHY\n                    I don't know...lighter, I guess.\n\n          \n\n                                CONNOR\n                    Y'mean...blonde?\n\n          \n\n                                MURPHY\n                    I didn't say that!\n\n                                CONNOR\n                    California, surfer boy, gay, gay\n                    blonde?!\n\n          \n\n                                MURPHY\n                    I'm warnin' ya!\n\n          \n\n                                CONNOR\n                    Just keep your hands off my ass back\n                    there and, \"stay gold, Pony Boy.\"\n\n          \n          Connor laughs heartily.\n\n          \n\n                                MURPHY\n                    Fuck you!\n\n          \n\n                                                                         23.\n\n          \n\n          \n          Murphy stabs the ink pen into his brother's shoulder.\n\n          \n\n                                CONNOR\n\n                    AAAAAH!\n\n          \n          Connor bolts up, knocking over the pot. Hot water and pennies\n          spread across the floor. Connor pulls the pen out.\n\n          \n\n                                CONNOR (CONT'D)\n                    You motherfucker!\n\n          \n          Romeo steps inside and sees the pennies.\n\n          \n\n                                MURPHY\n                    Serves ya right!\n\n          \n          The boys are just about to fight when...\n\n          \n\n                                ROMEO\n                    Oh, shit.\n\n          \n          The brothers snap their heads toward.   A stunned Romeo points to\n          them, then the pennies.\n\n          \n\n                                ROMEO (CONT'D)\n                    I know who you are. You guys are the\n                    fuckin'....\n\n          \n\n                                MURPHY\n\n                    SHUT IT!\n\n          \n          Murphy moves behind Romeo, shuts the door and shoves him in.\n\n          \n\n                                ROMEO\n                    Oh, this is so fucking cool, man. I'm\n                    from Boston. I love you guys. Shit,\n                    everybody does! I mean, holy fucking\n                    shit! Maybe I could get in on this,\n                    you know? Bring some La Raza ta this\n                    thing. Spice it up a little. Hey, is\n                    it true you guys say a prayer before\n                    you grease somebody?\n\n          \n          Connor pulls a gun. The boys jump on Romeo and pin him to the\n          floor. Murphy clasps a hand over Romeo's mouth. Connor puts the\n          gun to Romeo's head. Their faces glaze over, religious ecstasy...\n\n          \n\n                                CONNOR\n                    And an awesome wailing was heard\n                    throughout heaven...\n\n          \n          Romeo's eyes go wide and muffled cries of terror are heard.\n\n          \n\n                                                                      24.\n\n          \n\n          \n\n                                MURPHY\n                    ...as the terrible hand of the Lord\n                    struck upon the earth.\n\n          \n\n                                CONNOR\n                    And as Almighty God created you...he\n                    now calleth you home.\n\n          \n          He pulls the trigger - \"click.\"\n\n          \n\n                                CONNOR (CONT'D)\n                    Ooops. Busy signal. We'll hafta\n                    calleth back.\n\n          \n\n                                MURPHY\n                    Let's have a shot while we're waitin'.\n\n          \n          The boys laugh, snatch the bottle.   Romeo is in shock.\n\n          \n\n                                ROMEO\n                    That shit was NOT funny, man!\n\n          \n          The brothers laugh harder. Romeo rolls on his side and slides a\n          hand down the back of his pants. He seems relieved.\n\n          \n\n                                ROMEO (CONT'D)\n                    Oh, thank you, Jesus. Thought I\n                    greased my drawers.\n\n          \n\n          INT. BERTH -- LATER\n\n\n          \n          The boys and Romeo smoke and pass the bottle around.\n\n          \n\n                                CONNOR\n                    No.\n\n                                ROMEO\n                    But I got conex all over Bean Town.\n                    Romeo'll hook you up like a tow truck!\n\n          \n\n                                MURPHY\n                    No.\n\n          \n\n                                ROMEO\n                    Why not?!\n\n          \n\n                                MURPHY\n                    We don't hafta give you reasons.\n                    Forget it.\n\n          \n\n                                ROMEO\n                    It's because I'm Mexican, isn't it!\n\n          \n\n                                                              25.\n\n          \n\n          \n\n                                CONNOR\n                    How dare you, sir, insinuate such a\n                    thing? The fact that you're a greasy\n                    spic's got nothin' ta do with it.\n\n          \n          The boys laugh.\n\n          \n\n                                ROMEO\n                    I'm gonna let you have that one. Look.\n                    I can do this. It's not rocket\n                    science. You two find bad guys doing\n                    bad shit and you kill them, right?\n\n          \n\n                                CONNOR\n                    It's not that simple.\n\n          \n\n                                 MURPHY\n                    Yes it is.\n\n          \n\n                                CONNOR\n                    S'pose you're right. I'd sorta hoped we\n                    were a little more artistic than that.\n\n          \n\n                                ROMEO\n                    Well, you ain't. Can't you guys see\n                    it? This shit's fate, man. Like\n                    preordained type shit. Mea fucking\n                    Culpa! Why do you think you just\n                    happened to be in that hatchway today?\n\n          \n\n                                MURPHY\n                    Oh, don't start gettin' all super\n                    fuckin' natural on us. We saw those\n                    guys goin' in there!\n\n          \n\n                                ROMEO\n                    Ah, ha! That's what you say. I say it's\n                    because Jeeeeesus wanted it that way!\n\n          \n\n                                 CONNOR\n                    Oh, no.\n\n          \n\n                                ROMEO\n                    Fine. Then what exactly do you intend\n                    to do when you hit U.S. soil?\n\n          \n\n                                CONNOR\n                    We'll go after all Yakavetta's people\n                    and operations till we get to the man\n                    himself.\n\n          \n\n                                MURPHY\n                    Yeah, work our way up the food chain.\n\n          \n\n                                                                      26.\n\n          \n\n          \n          The brothers seem pleased with themselves.\n\n          \n\n                                ROMEO\n                    So, what's your first gig?    What's the\n                    first thing you gonna do?\n\n          \n          The boys look to one another.   They're stumped.\n\n          \n\n                                CONNOR\n                    Well, I don't suppose we have a\n                    succinct plan, y'know, per se.\n\n          \n\n                                MURPHY\n                    Yeah. It's not fully developed yet,\n                    y'know, as it were.\n\n          \n          A slow smile splits Romeo's face.\n\n          \n\n                                ROMEO\n                    You two need to chill in the green\n                    room, sip on some Pellegrinos and let\n                    your manager handle the details. And\n                    you better get my Cub Scout badge\n                    ready. Cuz if you want to kick\n                    Yakavetta in the nuts, let him know\n                    you're in town...Romeo's got an ace in\n                    the hole for you.\n\n          \n\n          INT. / EXT. NEWS FOOTAGE, MAN ON THE STREET INTERVIEWS\n\n\n          \n\n                                HOT DOG VENDOR\n                    These guys have gone \"mad dog\" here.\n                    They need to be put down.\n\n          \n\n                                CAB DRIVER\n                    I think it's disgusting.   I wish they'd\n                    have stayed gone.\n\n          \n\n                                PEDESTRIAN\n                    I don't believe it for a second!   No\n                    bleep-in way the Saints did it!\n\n          \n\n          INT. BOSTON P.D., WAR ROOM -- MORNING\n\n\n          \n          The CHIEF (50's) sits, arms folded. The detectives are present.\n          Eunice stands before a wall adorned with crime scene photos,\n          reports, Concezio and his Capos.\n\n          \n\n                                EUNICE\n                    And that's all she wrote. Everything\n                    points in the same direction.\n\n          \n          She taps Yakavetta's picture on the wall.\n\n          \n\n                                                              27.\n\n          \n\n          \n\n                                CHIEF\n                    Why would Yakavetta want them back\n                    here? Him of all people.\n\n          \n\n                                DUFFY\n                    To have them executed. Revenge.\n                    Oldest motive in the book.\n\n          \n\n                                GREENLY\n                    The Saints killed his daddy six years\n                    ago, right? He was inside when that\n                    happened doing a nickel for extortion.\n\n          \n\n                                DOLLY\n                    Yeah. From inside he could only do so\n                    much. Since he got out nine months\n                    ago, the Yakavetta's have regained\n                    their original strength. Looks like\n                    their clearing all their open accounts.\n\n          \n          The Chief rubs his chin.\n\n          \n\n                                CHIEF\n                    Well...it's a theory.\n\n          \n\n                                EUNICE\n                    More than just a theory, Chief.\n\n          \n          She nods to Duffy.\n\n          \n\n                                DUFFY\n                    C.I.'s came back. Cold hits all\n                    around. Concezio Yakavetta and his six\n                    Capo Regime, all blood relatives, have\n                    disappeared.\n\n                               CHIEF\n                    So?\n\n          \n\n                                GREENLY\n                    So, it fits. He's gone to the\n                    mattresses with his top brass. He's\n                    protecting them till this is over.\n\n          \n\n                                EUNICE\n                    And word's been put to all his\n                    lieutenants that the Saints are to be\n                    taken out, on sight.\n\n          \n\n                                DOLLY\n                    That means his resources on the streets\n                    are battening down the hatches, waiting\n                    for them to show.\n\n          \n\n                                                                          28.\n\n          \n\n          \n\n                                CHIEF\n                    Look, I been stone walling the media on\n                    this thing but the Mayor's been riding\n                    me like a rented mule here. I got half\n                    of New England thinking the Saints\n                    whacked a priest and the other half\n                    thinking their innocent. Its a powder\n                    keg. I'm talking riot gear at Celtics\n                    games, here. I could clear them of\n                    this murder, take the piss right out of\n                    this thing, keep the peace in the\n                    Commonwealth. Gimme one good reason\n                    why I shouldn't go public right now.\n\n          \n\n                                EUNICE\n                    Walk with me, Chief.    Let's talk.\n\n          \n          He stands and she takes his arm as they exit.     Duffy quietly closes\n          the door and turns. Hushed tones...\n\n          \n\n                                DUFFY\n                    This is not good.   She's gunning for\n                    the boys hard.\n\n          \n\n                                DOLLY\n                    This brawd, trying to put a feather in\n                    her cap is gonna get us locked up.\n\n          \n\n                                DUFFY\n                    Just calm down.\n\n          \n\n                                GREENLY\n                    And you know they'll send us to the\n                    Hoag. We put half those deranged sex\n                    freaks in there. I hope you guys like\n                    cock sandwiches. Cuz we'll be eating\n                    them for breakfast, lunch and dinner!\n\n          \n\n          INT. PRECINCT HALL -- SAME TIME\n\n\n          \n          The Chief and Eunice walk down the hall.\n\n          \n\n                                EUNICE\n                    I understand you got a job to do,\n                    Chief. But if Yakavetta even sniffs\n                    that we're onto him, he puts a bullet\n                    in Napoleon's head, plants him at the\n                    bottom of the ocean and walks. This\n                    pint sized killer is the only thing\n                    that puts Yakavetta right in the middle\n                    of this. It is imperative that we find\n                    this man.\n\n          \n\n                                                                        29.\n\n          \n\n          \n          The Chief looks as if he is sold.\n\n          \n\n          INT. WAR ROOM -- MOMENTS LATER\n\n\n          \n          In hushed tones.\n\n          \n\n                                DUFFY\n                    We need to figure what we're gonna do\n                    when the boys show and start doin' what\n                    they do best. Cuz that's when the\n                    shit's really gonna hit the fan.\n\n          \n\n                                DOLLY\n                    That's another thing. Everyone's\n                    assuming that they're going to come\n                    back. I mean, we got no way of knowing\n                    that for sure.\n\n          \n\n                                GREENLY\n                             (ray of hope)\n                    Yeah. That could totally happen.    They\n                    could not come back.\n\n          \n\n                                DUFFY\n                    What dream world did you two just slip\n                    into?!\n\n          \n          They argue.   Duffy snaps a photo of the dead priest from the wall.\n\n          \n\n                                DUFFY (CONT'D)\n                    Point blank! We know the boys. Is\n                    there any part of you that thinks\n                    they're are just going to let this\n                    slide? Believe this. They are either\n                    on their way...or they're already here.\n\n          EXT. BOSTON, DOCKS, PARKING LOT -- NIGHT\n\n\n          \n          CLOSE ON: Connor, Murphy and Romeo peaking over a concrete wall.\n          Three sets of eyes.\n\n          \n          Our trio is atop a dumpster, peaking over at the loading dock.\n          Chinese Gangsters supervise unloading of crates onto a flatbed.\n\n          \n\n                                ROMEO\n                    It's been all over the papers the last\n                    two years. Yakavetta's in bed with the\n                    Chinese. They're using international\n                    shipping routes to smuggle it in. This\n                    is Little Yaka's shit.\n\n          \n          Connor and Murphy smile.\n\n          \n\n                                                                     30.\n\n          \n\n          \n\n                                CONNOR\n                    Let's follow 'em down the rabbit hole,\n                    Alice.\n\n          \n          Murphy claps Romeo on the shoulder.\n\n          \n\n                                MURPHY\n                    You just scored a few points, Rome.\n\n          \n\n                                ROMEO\n                    Well, dust off my \"Members Only\"\n                    jacket.\n                             (pulls set of keys)\n                    Cuz the kid has also supplied the ride!\n\n          \n\n          INT. CAR -- LATER\n\n\n          \n          Murphy looks displeased. We hear a stressing motor. Romeo drives,\n          Murphy sits shotgun. Connor is in back, loading guns. Pull back to\n          reveal our trio rides in a '68 VW Bug. It is green with patches of\n          Bondo, exposed engine, low-pro rims, neon runner board lights - a\n          low riding \"work in progress.\"\n\n          \n\n                                MURPHY\n                    I thought you said your car was\n                    inconspicuous.\n\n          \n\n                                ROMEO\n                    I don't like words that got 'spic'\n                    right in the middle. Besides, it\n                    is...where I live.\n\n          \n\n                                MURPHY\n                    Where's that? Pimpville?\n\n          \n\n                                ROMEO\n                    Hey! I hail from a colorful people.\n                    Besides, you wouldn't know style if it\n                    pitched a tent in your ass!\n                             (looks into rear view)\n                    What do you think of the ride, Conman?\n\n          \n\n                                CONNOR\n                    The only way I could be more\n                    embarrassed right now is if I was\n                    ridin' a moped.\n\n          \n\n                                MURPHY\n                    Yeah...while fuckin' a fat girl.\n\n          \n\n                                CONNOR\n                    Yeah...rollin' through the gym at my\n                    high school reunion.\n\n          \n\n                                                                       31.\n\n          \n\n          \n\n                                   ROMEO\n                      All right!   I get the fucking point!\n\n          \n\n          INT. WAREHOUSE -- LATER\n\n\n          \n          CHINESE GANGSTERS #1-#5, shovel mounds of coffee grounds out of\n          crates and pull kilos of white powder. Machinery noise in b.g.\n\n          \n\n          EXT. WAREHOUSE -- SAME TIME\n\n\n          \n          CLOSE ON:   Three sets of eyes peaking over oil drums.\n\n          \n          Our trio watches as a DOCK WORKER (22yrs) drives a forklift,\n          unloading the crates from the flatbed and driving them through the\n          huge open bay doors. The boys and Romeo huddle up.\n\n          \n\n                                  CONNOR\n                      O'kay, here's the plan.\n\n          \n\n          EXT. \"THE PLAN,\" WAREHOUSE -- NIGHT\n\n\n          \n          The \"Queen\" classic, Another One Bites the Dust, presides over this\n          fantasy sequence. The boys, looking more \"quaffed,\" do a pointless\n          slow motion walk toward the forklift, throwing up their collars.\n\n          \n          Romeo, also looking polished, executes a \"Dan Tana\" pistol whipping\n          on the Dock Worker who perfectly out of frame.\n\n          \n          INSIDE WAREHOUSE: The lift pulls to a stop before the gangsters,\n          crate on the forks. Romeo is behind the wheel.\n\n          \n          SLO-MO: Connor and Murphy pop from the crate and fire on their\n          Asian foe, hitting each squarely in the chest.\n\n          \n          SLO-MO: The boys leap down and light cigs as Romeo does the \"one\n          arm action star hang\" off the side of the lift in b.g. WHIP PAN...\n\n          EXT. WAREHOUSE -- MOMENTS LATER\n\n\n          \n\n                                  CONNOR\n                      We skin out, go ta Doc's for a shot of\n                      Irish. We're home in time for tacos.\n\n          \n          Murphy looks unsure.     Connor turns to his brother.\n\n          \n\n                                   CONNOR (CONT'D)\n                      What?\n\n          \n\n                                  MURPHY\n                      Well, it's...uh...you know, it's...\n\n          \n\n                                                                        32.\n\n          \n\n          \n\n                                ROMEO\n                    It's genius. I can even drive an F-\n                    lift, man. Got my class \"D\" license\n                    and everything.\n\n          \n\n                                CONNOR\n                    Now, dat's the spirit.\n\n          \n\n                                ROMEO\n                    I need a gun.\n\n          \n\n                                 CONNOR AND MURPHY\n                    Forget it.\n\n          \n\n                                ROMEO\n                    What the fuck? I'm in on this shit,\n                    man! I'm working here!\n\n          \n          The boys look to each other. Murphy shrugs. Relenting, Connor\n          pulls a metallic object and shoves it in Romeo's hand.\n\n          \n\n                                CONNOR\n                    You can consider yourself a fuckin'\n                    pledge until we say different.\n\n          \n          Romeo holds up the gun in displeasure, a tiny .22 caliber lady's\n          purse pistol. Murphy snickers.\n\n          \n\n                                ROMEO\n                    Can I consider myself your girlfriend,\n                    too?\n\n          \n\n                                CONNOR\n                    That's what you get.   Is there a\n                    problem?\n\n                               ROMEO\n                             (beat, fuming)\n                    It's fine.\n\n          \n          Connor scopes the warehouse.   Murphy claps Romeo on the shoulder.\n\n          \n\n                                MURPHY\n                    Don't worry, Rome.   Shit like this\n                    builds character.\n\n          \n\n                                ROMEO\n                    Yeah, the character of a little bitch.\n\n          \n\n                                MURPHY\n                    Now, dat's just unprofessional.\n\n          \n          He turns and joins his brother as Romeo continues sulking.\n\n          \n\n                                                                       33.\n\n          \n\n          \n\n                                MURPHY (CONT'D)\n                    What do we think?\n\n          \n\n                                CONNOR\n                    I think Yakavetta murdered a good man\n                    just to send us a message.\n\n          \n\n                                MURPHY\n                    Well...let's send him one back.\n\n          \n          As they spirit themselves off.   DISSOLVE TO...\n\n          \n\n          INT. WAREHOUSE -- LATER\n\n\n          \n          CRIME SCENE: Crime scene workers toil. We do not see specifics of\n          the scene, just enough to see the place is trashed and the bodies.\n\n          \n          Greenly prowls the scene with his iPod playing. His musical choice\n          is the 80's Nightranger standby, \"Motoring.\" He riffs on air guitar\n          while assessing. Dolly and Duffy look on...\n\n          \n\n                                DOLLY\n                              (re: Greenly)\n                    Why?\n\n          \n\n                                DUFFY\n                    I don't know.\n\n          \n\n          EXT. WAREHOUSE -- SAME TIME\n\n\n          \n          Eunice walks toward the crime scene with the CHIEF (50's).\n\n          \n\n                                CHIEF\n                    Your boss, John Kuntsler called. Tells\n                    me you got a problem with authority.\n\n                                EUNICE\n                    Absolute horse pucky, Chief.\n                    Unfortunately, authority's developed a\n                    problem with me.\n\n          \n\n                                CHIEF\n                    And what's that?\n\n          \n          They enter the...\n\n          \n\n          INT. WAREHOUSE -- CONTINUOUS\n\n\n          \n\n                                EUNICE\n                    Well, y'see, I am currently in\n                    possession of a vagina.\n\n          \n\n                                                                           34.\n\n          \n\n          \n\n                                CHIEF\n                    Oh, Jeez, that's not...\n\n          \n\n                                EUNICE\n                    So you spoke to Kuntsler.      Anything\n                    else.\n\n          \n          They reach the Detectives.      Greenly, still rockin', doesn't notice.\n\n          \n\n                                CHIEF\n                    If it's confirmed that the Saints are\n                    back and too many bodies start showing\n                    up with pocket change...\n                             (re: his eyes)\n                    ...he's gonna pull you and step in.\n\n          \n\n                                EUNICE\n                    Message delivered, Chief.\n\n          \n\n                                  CHIEF\n                    Listen.    I'll fend him off.    Just work\n                    fast.\n\n          \n          She smiles and nods.   Greenly removes his ear pieces.\n\n          \n\n                                GREENLY\n                    It's not them.\n\n          \n\n          INT. WAREHOUSE -- LATER\n\n\n          \n          Eunice as she kneels at a body.      She stands and pulls her ear plugs.\n\n          \n\n                                 EUNICE\n                    It's them.\n\n          \n          Greenly looks emasculated. Dolly and Duffy smirk at him. Eunice\n          stands and prowls the scene, intense, intrigued, in her own world...\n\n          \n\n                                EUNICE (CONT'D)\n                    A wise man once told me. Where a man's\n                    actions are firmly bound to an\n                    unshakable faith one's worst nightmares\n                    become sudden, terrifying reality.\n\n          \n          Pennies in eyes.    Hands crossed on bodies.\n\n          \n\n                                EUNICE (CONT'D)\n                    Y'can almost smell the brimstone,\n                    can'tcha?\n\n          \n\n                                DOLLY\n                    What do you think happened here?\n\n          \n\n                                                                       35.\n\n          \n\n          \n\n                                EUNICE\n                    Oh, this was a plan that fell to\n                    pieces. A lot here doesn't make sense\n                    which is why it makes perfect sense. I\n                    believe things in our fair little city\n                    just got downright biblical.\n\n          \n\n          EXT. FLASHBACK, WAREHOUSE -- EARLIER\n\n\n          \n          On the flatbed, the brothers shovel coffee out of the final crate\n          which rests on the forks of the lift. Below them stands the Dock\n          Worker holding his bleeding head. Romeo covers him with his 22.\n\n          \n\n                                DOCK WORKER\n                    You didn't have to bash me in the\n                    skull.\n\n          \n\n                                ROMEO\n                    Sorry, man. We got a plan going, here.\n                    Technically, I was supposed to knock\n                    you out.\n\n          \n\n                                DOCK WORKER\n                    Christ! You got a gun. You could have\n                    just pointed it at me and said SCRAM!\n\n          \n          Connor points his gun at the Dock Worker.\n\n          \n\n                                  CONNOR\n\n                    SCRAM!\n\n          \n\n                                  DOCK WORKER\n                    You got it!\n\n          \n          He runs off.   Romeo turns up to them.\n\n                                ROMEO\n                    So, let's not let this one, small\n                    incident get in the way of...\n\n          \n\n                                CONNOR\n                    Shut up and get behind the fuckin'\n                    wheel!\n\n          \n          Romeo hops into the driver's seat.\n\n          \n\n                                MURPHY\n                    Well, at least the plan is off to a\n                    winning start.\n\n          \n\n                                CONNOR\n                    Go fuck y'rself.\n\n          \n\n                                                                          36.\n\n          \n\n          \n          They pull wrapped white kilos.    Connor dips in a finger and tastes.\n\n          \n\n                                CONNOR (CONT'D)\n                    It's heroin.\n\n          \n\n                                MURPHY\n                    How the fuck would you know?\n\n          \n\n                                  CONNOR\n                    Fuck you.    I know shit.\n\n          \n\n          INT. WAREHOUSE -- MOMENTS LATER\n\n\n          \n          Romeo's winging it, jerky moves, grinding gears as the forklift\n          staggers across the mammoth warehouse toward the gangsters at the\n          opposing end. The crate blocks Romeo from view. He's driving blind\n          as the rickety crate jiggles on the forks.\n\n          \n          INSIDE CRATE:   Connor and Murphy are sardined, back to back.\n\n          \n\n                                  MURPHY\n                    Jesus!    What the fuck's he doin'?!\n\n          \n\n                                CONNOR\n                    He can't see where he's goin'!\n\n          \n          Murphy peaks through a crack.\n\n          \n\n                                  MURPHY\n                    Shit!    Tell him to go left, now!\n\n          \n          Connor puts his mouth to a knot hole.\n\n          \n\n                                  CONNOR\n                    Go left!    Go left!\n\n                                 ROMEO\n                    What?!\n\n          \n          Connor sticks his finger out the hole and points. Romeo wrenches\n          the wheel and they narrowly avoid machinery. The crate rocks...\n\n          \n\n                                MURPHY\n                    I can't fuckin' believe I let you talk\n                    me into this! This is a stupid plan!\n\n          \n\n                                CONNOR\n                    I didn't notice you throwin' out any\n                    ideas, ya creative asshole!\n\n          \n\n                                 MURPHY\n                    Fuck you!\n\n          \n\n                                                                        37.\n\n          \n\n          \n          The boys start elbowing each other in a close quarters scrap while\n          hurling obscenities.\n\n          \n\n                                 ROMEO\n                    Hey!   What's goin' on in there?!\n\n          \n          INSIDE CRATE: Murphy suddenly stops, eyes wide as he looks through\n          the crack. They are headed for a \"Mechanic's Well.\"   A long,\n          rectangular cement hole in the floor six feet deep.\n\n          \n\n                                MURPHY\n                    Jesus Christ! Tell him to stop!\n\n          \n          Connor slams his mouth to the knot hole.\n\n          \n\n                                 CONNOR\n\n                    BRAKES!   BRAKES! BRAKES!\n\n          \n          A few of the Chinese turn as Romeo slams on the brakes, screeching\n          to a halt just before the well. The crate slides right off and\n          falls in, disappears from sight. CRASH!\n\n          \n          A large cloud of coffee dust plumes.   A wide eyed Romeo is exposed.\n          The Asian gangsters stare in shock.\n\n          \n          Hard techno music! Suddenly, Romeo whips it in reverse, cranks the\n          wheel guns it and navigates the well. Speeds toward the gangsters.\n\n          \n          MECHANIC'S WELL: (SLO-MO) The brothers burst from the debris,\n          covered in coffee grounds and white powder. They draw their weapons\n          and walk toward the ramp at the well's opposing end.\n\n          \n          The Chinese pull and start firing. Romeo dives off and rolls behind\n          some machines. The lift continues on target.\n\n          \n          The brothers emerge and tear right in, firing at the gangsters.\n          Romeo fires his useless 22. In the ensuing fire fight the brothers\n          kill all but Chinese Gangster #3.\n\n          \n          The forklift crashes through the table with the stacked heroin.\n\n          \n          SLO-MO: The brothers slam the final Gangster to his knees and level\n          to the back of his head and recite the following in synchronicity...\n\n          \n\n                                BROTHERS\n                    And shepherds we shall be, for Thee, my\n                    Lord, for Thee. Power hath descended\n                    forth from Thy hand, that our feet may\n                    swiftly carry out Thy command. So, we\n                    shall flow a river forth to Thee and\n                    teeming with souls shall it ever be.\n\n                                (MORE)\n\n          \n\n                                                                         38.\n\n                                    BROTHERS (CONT'D)\n                        In Nomine Patris, et Filii, et Spiritus\n                        Sancti.\n\n          \n          POP!   POP!    They kill him.   DIP TO BLACK...\n\n          \n\n          INT. WAREHOUSE -- MOMENTS LATER\n\n\n          \n          Haunting music. Black and White film as Connor and Murphy take\n          great care in ritualizing the bodies. They place pennies in eyes\n          and cross hands over chests. WHIP PAN...\n\n          \n\n          EXT. BACK TO PRESENT, WAREHOUSE -- NIGHT\n\n\n          \n          Bodies are wheeled out in the b.g. as Dolly and Greenly talk\n          privately with Eunice.\n\n          \n\n                                    DOLLY\n                        Just got a call from my best snitch.\n                        Never steered me wrong. He says its\n                        this guy.\n                                  (hands Eunice mug)\n                        \"Gorgeous\" George Tuffano. He's\n                        trusted bruglione to Yakavetta but not\n                        blood. He's been left control of the\n                        streets. He's running all of it.\n\n          \n          Eunice looks over the mug shot.\n\n          \n\n                                    GREENLY\n                        They call him \"Gorgeous\" cuz he likes\n                        his silk suits and jewelry. He's even\n                        got the 'out of season' fake bake going\n                        on, a real peacock, this guy.\n\n          \n\n                                    EUNICE\n                        Yeah, I heard of this rodeo clown.\n          Duffy approaches, hands Eunice a tiny bullet in a baggy.\n\n          \n\n                                    DUFFY\n                        Ballistics just dug it out.\n\n          \n          They all look perplexed.\n\n          \n\n                                    EUNICE\n                        A twenty two? You gotta be kidding me.\n                        That's like bringing a knife to a\n                        gunfight.\n\n          \n\n                                    GREENLY\n                        Yeah, or like bringing a really small\n                        gun...to a gunfight.\n\n          \n          They all blank stare Greenly for a moment.        Moving on.\n\n          \n\n                                                                       39.\n\n          \n\n          \n\n                                DUFFY\n                    I don't know. Ballistics is reading\n                    three shooters. This is one of them.\n\n          \n\n                                EUNICE\n                    Well, I'm having a hard time believing\n                    that one of the three most lethal\n                    individuals on the planet just switched\n                    over to bird shot.\n\n          \n\n                                DOLLY\n                    Maybe we're reading it wrong. The\n                    priest was a frame job, right?\n\n          \n\n                                DUFFY\n                    Yeah, maybe somebody's trying to\n                    eliminate some competition here.\n\n          \n          Eunice considers this.   The Detectives seem hopeful.\n\n          \n\n                                EUNICE\n                    No, sir. It's them. But we just might\n                    have ourselves a change in the line up,\n                    here.\n\n          \n          The detectives all look at one another nervously.\n\n          \n\n                                GREENLY\n                    Fine, they're back.   What's the plan?\n\n          \n\n                                EUNICE\n                    Hell, we've just been called up to the\n                    big show. We are tracking multiple\n                    perpetrators, gentlemen. The plan? We\n                    keep our ear to the ground and try to\n                    figure out where Yakavetta's hiding.\n                    Napoleon. We find him and flip him.\n                    And as for the Saints...I'm gonna have\n                    me a face to face with these boys one\n                    way or the other.\n\n          \n          She walks off.   The cops look terrified.\n\n          \n\n                                DOLLY\n                    Holy...fucking...shit.\n\n          \n\n          INT. GREENHOUSE -- NIGHT\n\n\n          \n          We see the hands of an OLD MAN (70) as he mists flowers in this lush\n          environment. He ambles to a shop table, wearing a metal leg brace,\n          circa 1950's and a corrective shoe, Polio. We do not see his face.\n\n          \n\n                                                                            40.\n\n          \n\n          \n          CLOSE ON: small black and white TV on table.     Breaking news.    Live\n          from the crime scene...\n\n          \n\n                                  REPORTER #3\n                      Law enforcement has confirmed the\n                      Saints are back!\n\n          \n          This gives way to...\n\n          \n\n          INT. / EXT. NEWS FOOTAGE\n\n\n          \n          The Saints pencil composites are shown.     From the studio...\n\n          \n\n                                  REPORTER #1 V.O.\n                      It's confirmed. The five drug\n                      traffickers all involved in the heroin\n                      trade were victims of the Saints.\n\n          \n          STATIC!   CHANEL CHANGES!    Bodies are wheeled out...\n\n          \n\n                                  REPORTER #2 V.O.\n                      ...several having close ties to the\n                      Yakavetta Crime Family, confirming the\n                      long suspected merger of the Chinese\n                      Triad and the Mafia.\n\n          \n\n          EXT. ALLEY -- LATER\n\n\n          \n          CLOSE ON:   A metal door opens revealing DOC (60's).\n\n          \n\n                                 DOC\n\n                      BOYS!\n\n          \n          The brothers and Doc hug and greet as he ushers them in with Romeo\n          in tow. The bar is closed, empty.\n\n                                  DOC (CONT'D)\n                      Jesus, Mary and Joseph! I saw da nuh,\n                      nuh, news channel. Are ya boys all\n                      right?!\n\n          \n\n                                  CONNOR\n                      Sound as an Irish pound, Doc.\n\n          \n\n                                  MURPHY\n                      Is it too late for a shot?\n\n          \n\n                                  DOC\n                      Oh, the Lord told me you'd be comin!\n                      He said, \"Doc, they're comin\" and I was\n                      ta get everting ready. So I did.\n                      Everting's ruh, ruh, ruh, it's all set.\n\n          \n\n                                                                      41.\n\n          \n\n          \n\n                                 ROMEO\n                    Uh, hem!\n\n          \n\n                                MURPHY\n                    Oh, this is our Mexican.\n\n          \n\n                                DOC\n                             (shaking hands)\n                    How are ya, lad? They call\n                    me...FUCK!...ASS!\n\n          \n\n                                ROMEO\n                    Nice to meet you, Fuck Ass, I'm Romeo.\n\n          \n\n          INT. UPSTAIRS STORE ROOM -- MOMENTS LATER\n\n\n          \n          Doc turns on the lights and they all enter. There is a far more\n          ornate and ancient bar up here: gothic pool table, dusty boxes,\n          cots set up, blankets, towels, hot-plate etc.\n\n          \n\n                                 THE BROTHERS\n                    Holy shit.\n\n          \n\n                                DOC\n                    The place used ta be an old speak easy\n                    in the forties. I only use it for\n                    storage, now.\n\n          \n          Murphy is already opening a bottle of Irish.\n\n          \n\n                                ROMEO\n                    This is so fucking cool.\n\n          \n\n                                DOC\n                    Nobody even knows it's up here. You'll\n                    be safe.\n\n                             (POINTS)\n                    You can get in and out the fu-fu-fire\n                    escape.\n\n          \n\n                                ROMEO\n                    You know what this is? This is our\n                    hide out, man! We got a hide out!\n\n          \n\n                                CONNOR\n                    What are you, fucking five years old?\n\n          \n\n                                MURPHY\n                    Hey, Rome, we got sheets and\n                    broomsticks. You could build yourself\n                    a fort.\n\n          \n\n                                                                       42.\n\n          \n\n          \n\n                                ROMEO\n                    Fuck the both of you!\n\n          \n\n          INT. \"HIDE OUT PARTY MONTAGE\" -- NIGHT\n\n\n          \n          Festive music. A brisket boils on the hot-plate. Romeo and the\n          boys drink and relate the evening's antics to Doc. Dissolve to...\n\n          \n          Later, they all enjoy an impromptu dinner on the pool table. The\n          eating does not slow their banter and laughter. Dissolve to...\n\n          \n          Later, music fades. Silence as Connor and Doc stare each other down\n          across the pool table. Neither flinches. Murphy and Romeo watch\n          with intrigue as Doc stiffles his urge to pop off.\n\n          \n\n                                DOC\n\n                             (CONCENTRATION)\n                    Not this time, ya little shit.\n\n          \n\n                                CONNOR\n                    We'll see, old man.\n\n          \n          A moment passes and Doc is literally shaking.\n\n          \n\n                                CONNOR (CONT'D)\n                    Would somebody please come over here\n                    and...\n\n          \n\n                               DOC\n\n                    FUCK!\n\n          \n\n                                CONNOR\n                    ...me up the...\n\n          \n\n                               DOC\n\n                    ASS!\n          The boys and Romeo burst into hysterics.   Doc rages.\n\n          \n\n          EXT. / INT. \"BELLA SANTE SALON\" -- MORNING\n\n\n          \n          Eunice enters the swanky salon and moves across the lobby.\n\n          \n\n          INT. MASSAGE ROOM -- MOMENTS LATER\n\n\n          \n          \"Gorgeous\" GEORGE (47yrs) is face down as a female masseuse works\n          his back, incense, mood music. Eunice silently slides in flashing\n          her badge, a finger to her pursed lips.\n\n          \n          Uneasy, the woman continues her work as Eunice lotions her hands.\n          She covertly replaces the masseuse and motions her out of the room.\n          Eunice digs in as the fatted mobster moans with pleasure.\n\n          \n\n                                                                       43.\n\n          \n\n          \n\n                                   GEORGE\n                    Oh, yeah.     Someone's been eating their\n                    Wheaties.     Yeah, get after it, girl.\n\n          \n          Eunice grabs a large massage paddle with rubber fingers. She whips\n          George's towel off, winds up and smacks him on his bare ass, HARD!!\n\n          \n\n                                  GEORGE (CONT'D)\n\n                    AAAAAH!\n\n          \n          George involuntarily jerks and rolls off the table.\n\n          \n\n                                GEORGE (CONT'D)\n\n                    WHAT THE FUCK!?\n\n          \n          He bolts to his feet.\n\n          \n\n                                GEORGE (CONT'D)\n                    You fucking bitch!\n\n          \n          He rounds the massage table, arms outstretched. Eunice draws her\n          side arm and sticks it in his face, halting him dead.\n\n          \n\n                                GEORGE (CONT'D)\n                    Whoa, whoa, whoa.\n\n          \n\n                                EUNICE\n                    What did you just call me?\n\n          \n\n                                GEORGE\n                    Who are you?\n\n          \n\n                                EUNICE\n                    Why, I'm a lady, George. That fact\n                    alone demands a certain amount of...\n                             (cocks hammer back)\n                    ...cordiality.\n\n          \n\n                                GEORGE\n                    I'm, I'm sorry I called you that.\n\n          \n\n                                EUNICE\n                    Well, how courteous of you to\n                    apologize. Courtesy is so important.\n                    Don't you agree?\n\n          \n\n                                GEORGE\n                    Y, yeah...I'm with that.\n\n          \n\n                                 EUNICE\n                    Good.   Now sit your fat ass down.\n\n          \n\n                                                                      44.\n\n          \n\n          \n          George sits. Eunice reholsters, wiggles her skirt straight and sits\n          on the massage table. George looks at her legs as she slowly\n          crosses them. Trepidation as he covers his genitals. Eunice smiles\n          as she flashes her FBI credentials. George relaxes.\n\n          \n\n                                EUNICE (CONT'D)\n                             (with intent)\n                    Where is...Concezio Yakavetta?\n\n          \n\n                                GEORGE\n                    I don't know.\n\n          \n\n                                EUNICE\n                    Yeah. There's a lot of stuff you don't\n                    know, Hoss. For instance, why aren't\n                    you safely tucked away in some ivory\n                    tower with all the other big wigs,\n                    sucking on cannoli and shrimp cocktail?\n                    Why are you the one he left on the\n                    streets, George?\n\n          \n\n                                GEORGE\n                    Someone's gotta run our legitimate\n                    businesses. Someone's gotta make sure\n                    that...\n\n          \n\n                                EUNICE\n                    Someone's gotta chum the waters.\n\n          \n\n                                GEORGE\n                    That's bullshit and I ain't saying\n                    another fucking word to you.\n\n          \n\n                                EUNICE\n                    Good. Then you can just listen. The\n                    jig is up. We know Concezio had that\n                    priest killed.\n\n          \n          George snaps his head to Eunice in shock, then recovers.\n\n          \n\n                                EUNICE (CONT'D)\n                    Oh, surprise, surprise. Another thing\n                    you don't know, I reckon. But why\n                    would he tell you? You and your guys\n                    on the streets, you're his bait. Y'all\n                    just got thrown into a meat grinder.\n\n          \n          Eunice goes to leave but stops and turns back.\n\n          \n\n                                EUNICE (CONT'D)\n                    Gorgeous George, huh? Expendable\n                    George is more like it.\n\n                             (BEAT)\n\n                                (MORE)\n\n          \n\n                                                                      45.\n\n                                EUNICE (CONT'D)\n                    By the by, you got a pretty nice ass\n                    for a fat man.\n\n          \n\n          EXT. ESTABLISHING SHOT, \"EL CAVA\" RESTAURANT -- DAY\n\n\n          \n          A Mexican joint, tucked away down by the docks.\n\n          \n\n                                ROMEO V.O.\n                    You wanna find something in Boston that\n                    don't wanna be found you go to the\n                    Oracle, ese. My Uncle Cesar is hooked\n                    up with the Underground.\n\n          \n\n          INT. RESTAURANT -- SAME TIME\n\n\n          \n          The boys, Romeo and UNCLE CESAR (58yrs) sit in a booth. Cesar is\n          noble looking, silver hair. Silence as he looks them over.\n\n          \n\n                                CESAR\n                    Word is, Yakavetta's gunning for you\n                    boys hard. The whole city's on edge.\n                    I even heard he posted a reward like\n                    Jesse James style and shit. Any of his\n                    guys that take you out gets his palm\n                    crossed, two hundred and fifty grand.\n\n          \n\n                                 ROMEO\n                    Whew.   A quarter of a mill for us?\n\n          \n\n                                CESAR\n                    Us? What the fuck are you talking\n                    about \"us?\"\n\n          \n          They begin to argue in Spanish.\n\n          \n\n                                ROMEO\n                    Uncle, why do you have to disrespect me\n                    in front of them?!\n\n          \n\n                                CESAR\n                    Cool it, Mr. Big Shot! A year ago you\n                    were washing my pots and pans!\n\n          \n\n                                ROMEO\n                    Well, I don't wash fucking pots\n                    anymore! I'm part of this, Uncle!\n\n          \n\n                                CESAR\n                    Hey! This isn't my first bar-b-que!\n                    Now shut up and stop interrupting! Let\n                    me talk to them and I'll figure out\n                    whether your in on this or in your own\n                    fucking fantasy world!\n\n          \n\n                                                                       46.\n\n          \n\n          \n          Romeo swallows his anger.   Murphy speaks Spanish.\n\n          \n\n                                 MURPHY\n                    He's in.   All the way in.\n\n          \n          Cesar looks at Murphy surprised.   In English.\n\n          \n\n                                CESAR\n                    Is my nephew pulling his weight?\n\n          \n          Connor nods while tapping his chest.\n\n          \n\n                                CONNOR\n                    Mucho corazon.\n\n          \n          Cesar looks to his nephew with a new found respect and touches his\n          hand. Romeo is very affected by this. Back to business.\n\n          \n\n                                CESAR\n                    Gorgeous George is running the show for\n                    Little Yaka. Drugs, prostitution,\n                    sharking, the whole cha cha. If\n                    anybody knows where he is, it's that\n                    fat fucking pedico. I'll put it out on\n                    the wire.\n\n          \n\n          INT. THE GREEN MACHINE -- LATER\n\n\n          \n          Romeo quietly weeps as he drives. The brothers are \"highly aware\"\n          and give respectful silence. As Romeo sniffles we show slow motion\n          remembrances of Cesar nodding and giving Romeo a look of respect and\n          then touching his nephew's hand.\n\n          \n          Back in the Green Machine - an excruciating amount of time passes.\n          Murphy tries to break the ice.\n\n                                MURPHY\n                    Hey, uh, maybe we should...\n\n          \n\n                                 CONNOR\n                    Shut up.   Romeo's crying.\n\n          \n          A moment of silence....then all three burst into laughter.\n\n          \n\n                                ROMEO\n                    You fucking assholes!\n\n          \n\n          INT. PRUDENTIAL BUILDING, LUXURY APARTMENT -- DAY\n\n\n          \n          A sprawling high rise apartment, overlooking Boston: buffet table,\n          plasma screen, etc. The Capos are taking advantage of the\n          amenities. Concezio's not here. Capo #5 - #6 fill their plates...\n\n          \n\n                                                                          47.\n\n          \n\n          \n\n                                CAPO #5\n                    That shipment of \"H\" was gonna square\n                    our books for six months. Shit.\n\n          \n\n                                CAPO #6\n                    We always bounce back. Besides, look\n                    at the bright side. Better the chinks\n                    than us, right.\n\n          \n\n                                CAPO #5\n                    I guess.  Like the boss said...\n                             (Concezio impression)\n                    \"This is war. There's gonna be\n                    casuwalities.\"\n\n          \n          They laugh. Suddenly, George enters with an overnight bag.      The\n          Capos are confused. Feigning a capitol mood...\n\n          \n\n                                GEORGE\n                    Oh! Like the Roman Empire in here!\n                    Where's all the concubines and shit?\n\n          \n          George laughs. Nobody else does. He looks at the food table.      We\n          pull close on shrimp cocktail and cannoli. A look of dread.\n\n          \n\n                                  CAPO #3\n                    George.    What gives, here?\n\n          \n\n                                GEORGE\n                    I need to see the Boss, right away.\n\n          \n\n                                CAPO #4\n                    Jimmy the Gofer!\n\n          \n          In hustles JIMMY THE GOFER (20's), skinny, weak looking.\n\n                                CAPO #2\n                             (to Jimmy)\n                    Il cortina.\n\n          \n          Jimmy draws back a large curtain, exposing a steel panic room. Next\n          to the vault door, is a video screen which displays the unamused\n          face of Concezio. His voice booms over loudspeakers.\n\n          \n\n                                CONCEZIO\n                    Get over here!\n\n          \n\n                                 GEORGE\n                    Whoa!\n\n          \n          George hustles over.   He stands before the screen, confused.\n\n          \n\n                                                                       48.\n\n          \n\n          \n\n                                 GEORGE (CONT'D)\n                    Uh.   Hey, Boss! I just came by to...!\n\n          \n\n                                CONCEZIO\n                    Push the talk button, numb nuts.\n\n          \n\n                                GEORGE\n                    Oh.\n                             (he does)\n                    Can you here me? Over.\n\n          \n\n                                CONCEZIO\n                    I can hear you fine, Smokey and the\n                    Bandit. Now, what the fuck are you\n                    doing here?\n\n          \n\n                                GEORGE\n                    Everything's in motion. All our guys\n                    are gunning for these Jesus Freaks. I\n                    figure, no need for me to be on the\n                    streets no more. So, which room do I\n                    take, eh?\n\n          \n\n                                CONCEZIO\n                    You stupid motherfucker! I told you,\n                    you're on the streets till this is\n                    over! Now get the fuck outta here!\n\n          \n          A terrified George hustles for the door.\n\n          \n\n                                CONCEZIO (CONT'D)\n                    And don't come back here till I tell\n                    you to, you fat fucking waste of space!\n\n          \n          George trips over his luggage.   The Capos giggle.\n\n          INT. HOTEL ROOM -- EVENING\n\n\n          \n          Cheap, depressing room. Crew Cut, in his underwear, repairs a\n          broken rosary chain with string and puts it on.He pulls a shoe box\n          from a shopping bag. The brand is \"Hushes.\" Slogan: \"Measure up\n          to your dreams.\"\n\n          \n          He puts on one shoe. Crew Cut stands before the mirror going up and\n          down on the one shoed foot, noting the height that has been added.\n          The shoe has been cleverly constructed to disguise the higher heel.\n\n          \n\n          EXT. AUTO BODY -- EVENING\n\n\n          \n          We are out back, among scrap cars. George talks with JO JO RHAMA\n          (38yrs). Jo Jo is built like a fire plug and clearly a hoodlum.\n\n          \n\n                                                    49.\n\n          \n\n          \n\n                       JO JO\n          A priest.   The sick fuck.\n\n          \n\n                      GEORGE\n          And he leaves all of us on the streets\n          holding the bag while him and his are\n          living it up at the Taj fuckin' Majal,\n          not a care in the world.\n\n          \n\n                      JO JO\n          So, until the Saints get popped, we're\n          all lambs to slaughter?\n\n          \n\n                      GEORGE\n          Yeah! And he don't care how many of us\n          they wipe out in the meantime!\n\n          \n\n                      JO JO\n          What do you need me to do, Skipper?\n\n          \n\n                      GEORGE\n          Spread the word to all the brugliones.\n          No bullshit. From your mouth to their\n          ears.\n\n          \n\n                      JO JO\n          Everyone? North and South?   That could\n          get a little dicey.\n\n          \n\n                      GEORGE\n          Fuck their old grudges. All of them\n          are in this, like it or not. Tell them\n          everything we discussed.\n\n          \n\n                      JO JO\n          Even the panic room thing?\n\n                        GEORGE\n          Sure.\n\n          \n\n                      JO JO\n          Good. That's a nice ice breaker.\n          They'll get a kick outta that. I\n          didn't even know those things were\n          real. I thought they made that shit up\n          for that movie? With that brawd and\n          that kid? With those guys in that\n          house?\n\n          \n\n                        GEORGE\n          Panic Room?\n\n          \n\n                                                                        50.\n\n          \n\n          \n\n                                JO JO\n                    Naw, the other one.\n\n          \n\n                                GEORGE\n                    Stop fuckin' around! This is serious\n                    shit, here! Tell 'em we meet tomorrow\n                    night. I'll call you with the\n                    location.\n\n          \n\n          EXT. AUTO BODY -- MOMENTS LATER\n\n\n          \n          POV of binoculars as we see George exit the front of the auto body.\n\n          \n\n          INT. HOTEL ROOM -- SAME TIME\n\n\n          \n          Crew Cut looks through his binoculars as he continues to bounce up\n          and down on his special shoe. He smiles at the site of George.\n\n          \n\n          INT. BOSTON POLICE DEPARTMENT, WAR ROOM -- NIGHT\n\n\n          \n          A table laden with clip boards, bagged evidence, reports, etc.\n          Eunice finds a baggy with a tiny wooden bead in it. Greenly enters.\n\n          \n\n                                GREENLY\n                    Tap's up and running on George's cell.\n\n          \n\n                                EUNICE\n                             (holds up baggy)\n                    What's this?\n\n          \n\n                                GREENLY\n                    Rosary bead. They found it pushed into\n                    the carpet near the victim. Father\n                    McKinney wasn't wearing a rosary so\n                    it's probably been there a while.\n          Duffy comes in with a stack of papers.   He heaves it down.\n\n          \n\n                                DUFFY\n                    The results on all 864 prints found at\n                    the scene. All match churchgoers or\n                    clergy but one. The partial on the\n                    priest's watch is still unidentified.\n\n          \n          Eunice looks perplexed.   Dolly enters, sipping coffee.\n\n          \n\n                                EUNICE\n                    That's horse shit. Everyone gets\n                    printed nowadays. They're inking up\n                    snotgobblers in kindergarten, now.\n\n          \n\n                                                                         51.\n\n          \n\n          \n\n                                DOLLY\n                    It's a brick wall anyway. We know\n                    Napoleon was wearing gloves. Lab got\n                    zilch off the chain and lock. The\n                    pennies came up clean too.\n\n          \n\n                                EUNICE\n\n                             (FRUSTRATED)\n                    I'm gonna go powder my nose.\n\n          \n          Greenly stares at her ass as she exits.\n\n          \n\n                                GREENLY\n                    Aw, man. Daddy would knock that out\n                    like Mike Tyson.\n\n          \n          Eunice suddenly re-enters the room with emergency.\n\n          \n\n                                 GREENLY (CONT'D)\n                    What?!   I didn't say nothing!\n\n          \n          Eunice is absorbed a photo on the wall of the priest's hand.\n\n          \n\n                                EUNICE\n                    McKinney wore his watch on his left\n                    hand.\n\n          \n          She turns and holds up the baggy.\n\n          \n\n                                EUNICE (CONT'D)\n                    Where was this found exactly?!\n\n          \n          Duffy goes to a mock up of the victim's body position on the wall.\n\n          \n\n                                DUFFY\n                    Right here, off his left elbow.   Where\n                    are you going with this?\n\n          \n\n                                EUNICE\n                    Dolly, get on the phone! Find out\n                    which wrist he wore his rosary on and\n                    if he was wearing it that night!\n                    Duffy, run that partial through DMV!\n                    David put it through INTERpol! Just\n                    get an I.D.! Now! Come on! Vamoose!\n\n          \n          They all dart out. With fire in her eyes, she looks closely at a\n          picture of the priest's wrist watch on the wall.\n\n          \n\n                                EUNICE (CONT'D)\n                    You took your glove off, didn'tcha\n                    Cowboy. Now, why would you go and do a\n                    damn fool thang like that?\n\n          \n\n                                                                       52.\n\n          \n\n          \n\n          INT. FLASHBACK, CHURCH -- NIGHT\n\n\n          \n          Crew Cut finishes ritualizing the priest and looks deeply at his\n          victim. He removes a glove and places his tiny hand next to\n          McKinney's large one. Silent rage. Bare handed, Crew Cut snatches\n          the priest's rosary from about his wrist, breaking the bead chain.\n\n          \n\n          INT. MAUSOLEUM -- MORNING\n\n\n          \n          The brothers and Romeo walk through the Mausoleum. They approach a\n          grave slate with respect. The name reads, \"David Della Rocco.\"\n          There is a picture of him. Murphy narrows his eyes and leans in.\n\n          \n\n                                MURPHY\n                    What the...did they use his mug shot?\n\n          \n\n                                  CONNOR\n                    What?   No.\n\n          \n\n                                MURPHY\n                    You remember how he told us he was\n                    embarrassed cuz the guy had to hold up\n                    all his long hair behind his head?\n\n          \n\n                                  CONNOR\n                    Aye.\n\n          \n\n                                MURPHY\n                    Look at that.\n\n          \n          We see Murphy's finger denote a bad \"airbrush\" job.\n\n          \n\n                                MURPHY (CONT'D)\n                    That's an arm.\n\n          \n          Connor looks close.\n\n                                CONNOR\n                    Oh...that's fuckin' harsh.\n\n          \n          The boys look at one another, then bust out laughing.\n\n          \n\n                                MURPHY\n                    Y'er one of a kind, Roc.\n\n          \n\n                                ROMEO\n                    So, am I as good as this guy, or what?\n\n          \n\n                                CONNOR\n                    You, sir, are no David Della Rocco.\n\n          \n          A sound. Instantly, the boys turn and level weapons. There stands\n          ROY (32yrs) thick glasses, geeky. He drops his flowers.\n\n          \n\n                                                                          53.\n\n          \n\n          \n\n                                ROY\n                    Whoa!  Whoa! Whoa! Holy shit!\n                             (beat, recognition)\n                    HOLY SHIT! You're the Saints! I'm\n                    Roy, it's an honor. Huge fan!\n\n          \n          The boys reholster and look to one another.    Disapproval.\n\n          \n\n                                CONNOR\n                    We're developin' quite the cult\n                    following in the old neighborhood.\n\n          \n          The boys continue to chat with Roy as Romeo answers his cell.\n\n          \n\n                                  ROMEO\n                    Que pasa.\n\n          \n          It's Cesar.\n\n          \n\n                                CESAR\n                    I got that info you wanted, mijo.\n\n          \n\n          INT. TANNING SALON -- NIGHT\n\n\n          \n          The Salon Manager approaches the back door with keys in hand.\n\n          \n\n                                CESAR V.O.\n                    The place is Tropical Tan on Bunker\n                    Hill. It's where the fat fucking juedo\n                    gets his fake bake at. He's got a\n                    secret appointment. Once a week, never\n                    misses. Eight o'clock, tonight.\n\n          \n          The Manager lets George slip in. He steels into a tanning room.A\n          Mexican towel boy has spied George. He picks up a phone...\n\n          INT. MAUSOLEUM -- MOMENTS LATER\n\n\n          \n          Romeo snaps his phone shut and turns to the boys.\n\n          \n\n                                  ROMEO\n                    We got him.\n\n          \n\n                                ROY\n                             (re: Romeo)\n                    Who's this, your new sidekick?\n                             (extends hand)\n                    Pleased to meet you. I'm Roy.\n\n          \n\n                                ROMEO\n                    How would you like me to sidekick you\n                    in the ass, Roy?\n\n          \n\n                                                                       54.\n\n          \n\n          \n\n                                  CONNOR\n\n                                (GIGGLING)\n                    Let's go.\n\n          \n          The three walk for the door, leaving Roy behind.\n\n          \n\n                                ROY\n                    I, I didn't mean to...\n\n          \n\n                                ROMEO\n                    I'm sick of this shit! I've been\n                    breaking my balls, here and I get\n                    second banana billing! I...\n\n          \n\n                                MURPHY\n                    I, I, I. There is no \"I\" in team, ya\n                    selfish prick.\n\n          \n\n                                 ROMEO\n                    Yeah?!   Well, there's an \"I\" in \"Fuck\n                    you!\n\n          \n\n          EXT. GRAVEYARD -- MOMENTS LATER\n\n\n          \n          Moody music as our trio walks through the gravestones.\n\n          \n\n          INT. \"TROPICAL TAN,\" TANNING ROOM -- NIGHT\n\n\n          \n          The brothers and Romeo sneak up to the tanning bed. George sings a\n          Sinatra tune as his fat stomach props the cover up like a half open\n          clamshell. Suddenly, Murphy leaps up and sits on the cover. George\n          is being crushed beneath his weight. Connor kneels.\n\n          \n\n                                CONNOR\n                    Lovely voice. We'd like ya ta sing for\n                    us. What do ya say?\n          George struggles and nods. Murphy hops off. George spills out, hot\n          pink Speedos. On all fours and breathing heavy...\n\n          \n\n                                GEORGE\n                    It's getting hard to be a fucking\n                    gentleman of leisure, here!\n\n          \n          The boys pull weapons and throw him against the wall in a Jesus\n          Christ pose, pinning his hands with their guns.\n\n          \n\n                                MURPHY\n                    We want the shooter you motherfuckers\n                    used on that priest.\n\n          \n\n                                GEORGE\n                    I don't know who it is.\n\n          \n\n                                                                      55.\n\n          \n\n          \n          The boys cock back the hammers on their weapons.\n\n          \n\n                                GEORGE (CONT'D)\n                    It's the truth! Concezio didn't tell\n                    no one what he was doing cuz he knew\n                    nobody would have o'kay'ed it! The\n                    shooter's an independent contractor!\n                    That's all I know!\n\n          \n\n                                CONNOR\n                    Where's Yakavetta hidin'?\n\n          \n\n                                GEORGE\n                    The Prudential! Fortieth floor!   Jesus\n                    Christ!\n\n          \n          A ringing phone is heard. Romeo pulls George's Blackberry from\n          nearby. He tosses it to Connor. Text message, \"WHERE?\"\n\n          \n\n                                CONNOR\n                    You meeting someone tonight, George?\n\n          \n\n                                 GEORGE\n                    Yeah.   The brugliones.\n\n          \n\n                                MURPHY\n                    The what?\n\n          \n\n                                GEORGE\n                    Yakavetta's racket chiefs. Street\n                    guys.\n                             (suddenly brightens)\n                    Your kind of guys. You could take a\n                    real bite outta crime here, huh? I\n                    could help you.\n\n                                CONNOR\n                             (re: phone)\n                    What's this?\n\n          \n\n                                GEORGE\n                    Nobody forgot what you guys did to us\n                    last time. They're staying indoors. I\n                    give out the location an hour before.\n\n          \n\n                                ROMEO\n                    My Uncle's place is closed tonight.    I\n                    got the key.\n\n          \n\n                                MURPHY\n                    It's down by the docks.   Dead as a\n                    doornail at night.\n\n          \n\n                                                                           56.\n\n          \n\n          \n\n                                CONNOR\n                    Yeah. You could set off fourth of July\n                    fireworks in dat place and nobody would\n                    hear. How's Mexican for you, George?\n\n          \n\n                                GEORGE\n                    No difference to me. I think I just\n                    shit my Speedos, anyway.\n\n          \n\n          INT. EUNICE'S MERCEDES -- NIGHT\n\n\n          \n          Eunice drives.   Her cell rings.   She checks the I.D. then...\n\n          \n\n                                EUNICE\n                    How do, David?\n\n          \n          Greenly is at his desk.   Alternating coverage.\n\n          \n\n                                GREENLY\n                    Hey, DMV came up dry on the partial.\n                    INTERpol's still working it. Should\n                    only be another couple of hours.\n\n          \n\n                                 EUNICE\n                    Lovely.   Anything else?\n\n          \n\n                                GREENLY\n                    Yeah. Nothing big. We just dumped a\n                    text message from George's cell. Just\n                    two words. \"El Cava.\" It's a Mexican\n                    joint down by the docks. He sent it to\n                    his enforcer, Jo Jo Rhama. Guess\n                    gangsters gotta eat too, huh?\n\n          \n\n                                EUNICE\n                    I think I'll drop in on their supper,\n                    see if I can shake them up a little.\n\n          \n\n                                GREENLY\n                    You need a body guard?\n\n          \n\n                                EUNICE\n                    No thank you, Mike Tyson.    Bye now.\n\n          \n\n                                GREENLY\n                    Bye.\n\n          \n          She hangs up and we are left with Greenly.   Red handed.\n\n          \n\n                                GREENLY (CONT'D)\n                    Oh, shit.\n\n          \n\n                                                                        57.\n\n          \n\n          \n\n          INT. \"EL CAVA,\" KITCHEN -- LATER\n\n\n          \n          Close up, three shot. George, looking very uncomfortable, is\n          flanked by the brothers. He is positioned to covertly view the\n          restaurant from the kitchen.\n\n          \n          We see NORTHSIDE BRUGLIONEs #1 - #3 and SOUTHSIDE BRUGLIONES #1 and\n          #2 are at the bar.\n\n          \n\n                                GEORGE\n                    Just two more to go. Uh...You guys are\n                    gonna let me go, right?\n\n          \n\n                                MURPHY\n                    We'll see, won't we.\n\n          \n          George grimaces.   Looks as if he'll cry.\n\n          \n\n                                GEORGE\n                    Jesus, this is some embarrassing shit.\n\n          \n          We see the three men from behind. George is still in his Speedos,\n          which now have a pronounced shit stain in back.\n\n          \n\n          INT. EL CAVA, BAR -- MOMENTS LATER\n\n\n          \n          Romeo, frazzled and in a busboy uniform, has got two blenders of\n          margaritas going. The Brugliones mow through appetizers.\n\n          \n          Northside doesn't interact with Southside and there is an empty bar\n          stool between them. N.S. Bruglione #1 slides Romeo a platter.\n\n          \n\n                                N.S. BRUGLIONE #1\n                    Yo, spicaroo. More nachos and mas\n                    salsa, capisce?\n\n                                S.S. BRUGLIONE #1\n                    Hey and I need a refill there, pepe?\n\n          \n\n                                ROMEO\n                    Si, muchachos.\n\n          \n          SOUTHSIDE BRUGLIONE #3 enters behind everyone.   All suddenly turn,\n          going for their guns.\n\n          \n\n                                  S.S. BRUGLIONE #3\n                    Whoa!    Easy...Jesus.\n\n          \n          Everyone calms. S.S. Bruglione #3 gives a respectful nod to the\n          Northside guys but sits with his own.\n\n          \n\n                                                                         58.\n\n          \n\n          \n\n          INT. EL CAVA, KITCHEN -- MOMENTS LATER\n\n\n          \n          We do not see George just below frame as the boys are \"working on\n          him\" in some way, putting on finishing touches. Romeo barrels in.\n\n          \n\n                                ROMEO\n                    These dagos are getting antsy and I'm\n                    getting Spicaroo'd and Pepe'd. The\n                    kid's about to go Poncho fucking Villa\n                    out there!\n\n          \n\n                                CONNOR\n                    Stick it out. Waitin' on one more.\n\n          \n\n          EXT. PARKING LOT -- MOMENTS LATER\n\n\n          \n          Jo Jo exits his Cadillac and walks toward El Cava.   There is a\n          \"closed for private function\" sign on the door.\n\n          \n\n          INT. JACKED UP SUV, NEARBY -- SAME TIME\n\n\n          \n          Crew Cut watches Jo Jo.   He dials his cell.\n\n          \n\n          INT. GREENHOUSE -- MOMENTS LATER\n\n\n          \n          From behind we see the Old Man gardening.    He answers a ringing\n          phone, nearby. We do not see his face.\n\n          \n\n          INT. SUV -- MOMENTS LATER\n\n\n          \n          The following conversation is in Italian.\n\n          \n\n                                CREW CUT\n                    He is not with them.\n\n          \n\n                                OLD MAN\n                    Are you certain?\n\n          \n\n                                CREW CUT\n                    Yes. It is only the sons. They have a\n                    Spaniard with them. They will\n                    slaughter everyone.\n\n          \n\n                                OLD MAN\n                    Let them. If you kill the sons...the\n                    father will come.\n\n          \n          Crew Cut develops a sinister smile.\n\n          \n\n          INT. EL CAVA, KITCHEN -- MOMENTS LATER\n\n\n          \n          Connor watches Jo Jo greet the others.    He turns to Romeo who is\n          angrily cooking up a storm.\n\n          \n\n                                                                       59.\n\n          \n\n          \n\n                                CONNOR\n                    The gang's all here.\n\n          \n          Without missing a beat, Romeo slams the hot pans into a dish sink.\n          He stands fuming with his hands on his hips.\n\n          \n\n                                ROMEO\n                    Gimme my fucking bee bee gun.\n\n          \n\n                                 MURPHY\n                    Naw.   You've earned your stripes, Rome.\n\n          \n          Murphy throws him a .9 mm.   Romeo smiles.\n\n          \n\n          INT. BAR -- MOMENTS LATER\n\n\n          \n\n                                JO JO\n                    So....where's Gorgeous?\n\n          \n          Suddenly, George comes rolling out of the kitchen, unconscious and\n          tied, face down, to a bus cart. There is writing on his back.\n          Everyone pulls their weapons and moves toward.\n\n          \n\n                                N.S. BRUGLIONE #2\n                    What the fuck is going on, here?\n\n          \n\n                                S.S. BRUGLIONE #2\n                    Where's that spic barkeep? Yo, Pepe!\n                    Where you at?!\n\n          \n          As the gangsters achieve the cart, the brothers creep over the bar\n          in the b.g. Brugliones look down on George, painted on his back...\n\n          \n\n                                S.S. BRUGLIONE #3\n                    \"Erin go brah?\" What the hell does\n                    that mean?\n          Connor and Murphy are standing 25 feet behind them.\n\n          \n\n                                MURPHY\n                    It's Irish for \"You're fucked.\"\n\n          \n          Hard core music as the Brugliones turn in horror. Everyone begins\n          firing and we have slow motion gunplay to pulsating music.\n\n          \n          Several are chewed up as chests explode and they are blown into\n          George on the cart, knocking it over. George comes to.\n\n          \n          Romeo appears and tears in, sending several more crashing into the\n          salad bar.\n\n          \n          Murphy, while firing, dives back over the bar as bottles explode.\n          Connor rapid fires as he dives into a booth.\n\n          \n\n                                                                         60.\n\n          \n\n          \n          The boys rise and lay out a second barrage, blasting the rest into\n          buffet tables and a soda fountain. The music cuts.\n\n          \n\n                                ROMEO\n                    Viva La Mejico, bitches!\n\n          \n          George bolts up.    The bus cart is still tied to his fat belly.\n\n          \n\n                                GEORGE\n                    Uh, I've seen the light! You guys have\n                    really turned me around on this! I'm\n                    like born again and shit! I swear!\n\n          \n\n                                MURPHY\n                             (to Connor)\n                    What do ya think? Let him go?\n\n          \n          Connor slips one bullet in a revolver, spins the barrel and snaps it\n          shut. He points it to George's forehead. George weeps in earnest.\n\n          \n\n                                CONNOR\n                    We'll let God decide if you get a\n                    second chance.\n\n          \n          He slowly cocks the hammer back, pulls trigger, \"click.\"\n\n          \n\n                                CONNOR (CONT'D)\n                    Well, praise the Lord.\n\n          \n          The terrified ex-gangster staggers toward an exit while wriggling\n          out of his bonds. Just as he touches the door.\n\n          \n\n                                 CONNOR (CONT'D)\n                    George?\n                             (George turns)\n                    All good boys go to heaven.\n          George nods and exits. Romeo is confused as our trio gathers.\n          Connor tosses the bullet he palmed to Romeo and he nods.\n\n          \n\n                                MURPHY\n                    Now, that was, perhaps the finest\n                    example of spiritual guidance that I\n                    have ever had the good fortune ta\n                    witness.\n\n          \n\n                                CONNOR\n                    Well, thank you very much.     Mysterious\n                    ways. Mysterious ways.\n\n          \n          SLO-MO: Suddenly, Eunice bursts through the kitchen door and levels\n          her weapon at the brothers and Romeo. Romeo levels back.\n\n          \n\n                                                                      61.\n\n          \n\n          \n          Eunice fires as the boys dive on Romeo. Crew Cut is revealed behind\n          our trio, firing from the shadows. Eunice and Crew Cut exchange\n          fire as the boys reload.\n\n          \n          Eunice hits Crew Cut in the side. The assassin has a moment of\n          outrage but persists firing as he makes a hasty exit.\n\n          \n          In the confusion it is a few moments before anyone realizes he is\n          gone. Silence falls. Presently, Romeo and the boys bolt up. Romeo\n          goes for the door and the boys level at Eunice.\n\n          \n\n                                CONNOR (CONT'D)\n                    Drop the gun! Drop it!\n\n          \n          She \"places\" her gun on a nearby table.\n\n          \n\n                                EUNICE\n                    Easy fellas. I'm alone.\n\n          \n          The boys are before her as Romeo returns.\n\n          \n\n                                  ROMEO\n                    He's gone.\n\n          \n\n                                  CONNOR\n                    Who are ya?\n\n          \n\n                                EUNICE\n                    My name is Eunice Bloom...and I'm your\n                    new guardian angel. A torch was passed\n                    to me by a mutual friend, gone but not\n                    forgotten.\n\n          \n          The boys reholster.    She drops her arms.\n\n          \n\n                                MURPHY\n                    We heard about Smecker.    He was a good\n                    man.\n\n          \n\n                                 CONNOR\n                    Aye.   You have our condolences.\n\n          \n\n                                EUNICE\n                    And you have mine.\n\n          \n          They shake.\n\n          \n\n                                  CONNOR\n\n                    CONNOR\n\n          \n\n                                  MURPHY\n                    Murphy.\n\n          \n\n                                                                 62.\n\n          \n\n          \n\n                                EUNICE\n                    Very well...Connor, Murphy.\n\n          \n          The boys nod.   Romeo points to the front door.\n\n          \n\n                                ROMEO\n                    Who the fuck was that guy?!\n\n          \n\n                                EUNICE\n                    That, I suspect, was the shooter you\n                    boys have been looking for.\n\n          \n          The boys look at each other.   Frustration.   Anger.\n\n          \n\n                                ROMEO\n                    Fucking...what the fuck?! Who the fuck\n                    is this brawd?! And what the fuck's\n                    going on, here?!\n\n          \n\n                                EUNICE\n                    Let's speed this up before your new\n                    sidekick's got to dig any deeper into\n                    his impressive vocabulary.\n\n          \n          The boys chuckle.\n\n          \n\n                                ROMEO\n                    Oh, no you didn't.\n\n          \n\n                                EUNICE\n                    I am an FBI agent who is controlling\n                    this investigation from within, in\n                    order to ensure that you gentlemen\n                    never see the inside of a prison cell.\n                    I am conspiring to do this with three\n                    like minded individuals who have aided\n                    you in the past. Though I have yet to\n                    inform them of my agenda because, well,\n                    girl's gotta have her fun.\n\n          \n\n                                MURPHY\n                    Dolly, Duffy and Greenly?\n\n          \n\n                                EUNICE\n                    The very same.\n\n          \n\n                                CONNOR\n                    How are the lads?\n\n          \n\n                                EUNICE\n                    Two of them are scared.   One's just\n                    horny.\n\n          \n\n                                                                         63.\n\n          \n\n          \n\n                                MURPHY\n                    Bet'cha I can guess which one.\n\n          \n\n                                EUNICE\n                    Bet'cha can but let's save it for\n                    group. Right now, we have a big\n                    problem.\n\n          \n\n                                CONNOR\n                    What's that?\n\n          \n          Eunice denotes the bodies.\n\n          \n\n                                EUNICE\n                    This...simply won't do. We made a\n                    deal. The big fish step in if your\n                    body count gets too high and...\n                             (re: carnage)\n                    ...you have been very naughty boys.\n\n          \n          Rockin' music overtakes as we DISSOLVE TO...\n\n          \n\n          INT. EL CAVA -- LATER\n\n\n          \n          With Eunice directing them, the boys and Romeo restage the crime\n          scene. With a squeegee they move pools of blood across the linoleum\n          floor and re-position bodies.\n\n          \n          The boys wrap Jo Jo's body in a tarp and put it in the Green\n          Machine. Romeo creates blood splatter with a turkey baster.\n\n          \n          Romeo and the brothers place the guns they used in the hands of dead\n          gangsters as Eunice drops bullet casings in carefully chosen spots.\n\n          \n          Romeo and the brothers leave with the utensils used to rig the\n          scene. The music fades, leaving Eunice in the center of...\n\n          INT. EL CAVA -- LATER\n\n\n          \n          Silence. She removes her ear plugs and the sound returns. We are\n          on a very different looking scene. CSI, forensics, even Dolly and\n          Duffy wait with baited breath. Greenly is not present.\n\n          \n\n                                 EUNICE\n                    O'kay.   Here's how it all went down.\n\n          \n          Dolly and Duffy open their notepads.\n\n          \n\n          INT. FLASHBACK, EL CAVA -- NEVER\n\n\n          \n          Northside stands facing off with the Southside. All brugliones are\n          frozen in place. Eunice saunters down the middle. Cool music...\n\n          \n\n                                                              64.\n\n          \n\n          \n\n                                EUNICE\n                    A secret gathering of the Brugliones.\n                    The topic of discussion? Weak\n                    leadership and betrayal.\n\n          \n\n                                N.S. BRUGLIONE #1\n                    Yakavetta's hiding from these Jesus\n                    Freaks and making us look like pussies.\n\n          \n\n                                S.S. BRUGLIONE #1\n                    And he's hanging all of us out to dry\n                    to boot.\n\n          \n          A pause as they size each other up.\n\n          \n\n                                 N.S. BRUGLIONE #2\n                    All right.   I'll be the first to say\n                    it.\n\n          \n\n                                EUNICE\n                    The enemy of my enemy is my friend.\n                    So, even with all their old\n                    vendettas...\n\n          \n\n                                N.S. BRUGLIONE #2\n                    ...I say fuck the Yakavettas.\n\n          \n\n                                EUNICE\n                    And there it is. Guess what comes\n                    next.\n\n          \n          Eunice points to men as he moves down the line.\n\n          \n\n                                 EUNICE (CONT'D)\n                    Red Rover.   Red Rover.\n\n                                S.S. BRUGLIONE #2\n                    We're taking over.\n\n          \n\n                                EUNICE\n                    Ah. Easier uttered than accomplished.\n                    The North End and the South End may as\n                    well be the Hetfields and the McCoys.\n                    These fellas...they just don't get on.\n\n          \n          All the Brugliones yell over one another.\n\n          \n\n                                N.S. BRUGLIONE #3\n                    Fuck you! The North End built that\n                    racket from the ground up!\n\n          \n\n                                                                       65.\n\n          \n\n          \n\n                                S.S. BRUGLIONE #3\n                    South End's been carrying your fucking\n                    asses for years!\n\n          \n\n                                N.S. BRUGLIONE #3\n                    15 percent?! In your dreams, asshole!\n\n          \n\n                               S.S. BRUGLIONE #3\n                    Whoa! Just went up to twenty, fuck\n                    stick!\n\n          \n          S.S. Brulione #1 flashes a gun in his waist band.\n\n          \n\n                                S.S. BRUGLIONE #1\n                    You want some of this, you mutt?!\n\n          \n          N.S. Bruglione #1 pulls his weapon.\n\n          \n\n                                N.S. BRUGLIONE #1\n                    Let's see what you got!\n\n          \n          They all pull and level at one another. They freeze in place and\n          all yelling ceases as Eunice walks down the middle.\n\n          \n\n                                EUNICE\n                    Oh, the cliche. A Mexican stand off in\n                    a Mexican restaurant.\n\n          \n          Eunice looks deeply at all the men as she turns a slow circle.\n\n          \n\n                                EUNICE (CONT'D)\n                    They cut each other to pieces...and\n                    nobody walked away. Who knows who\n                    fired first. Could have been any one\n                    of them. But somebody let it loose.\n                             (pointing to men)\n                    And duck, duck, duck...\n\n          \n          Eunice stands before S.S. Brulione #2.\n\n          \n\n                               EUNICE (CONT'D)\n                    Goose.\n\n          \n          BOOM! They all start shooting as Eunice stands in the crossfire\n          unaffected. Men fall dead and we see the relevance of each thing\n          Eunice did to doctor the scene. WHIP PAN...\n\n          \n\n          INT. BACK TO PRESENT, EL CAVA -- LATER\n\n\n          \n\n                                EUNICE\n                    Yakavetta's lost control of the\n                    streets.\n\n                               (MORE)\n\n          \n\n                                                                          66.\n\n                                EUNICE (CONT'D)\n                    They're fighting over his throne.      This\n                    was not the work of the Saints.\n\n          \n          Heads nod agreement.   Greenly enters and flashes a file to Eunice.\n\n          \n\n          EXT. EL CAVA -- MOMENTS LATER\n\n\n          \n          Press clamors for the story in the b.g. Eunice and the detectives\n          are in a private spot. Greenly excitedly hands her the file.\n\n          \n\n                                GREENLY\n                    INTERpol came through.\n\n          \n          Eunice opens the file.   Picture of Crew Cut.    Dolly and Duffy read\n          over her shoulder.\n\n          \n\n                                GREENLY (CONT'D)\n                    You were right. Five foot five.       Gotta\n                    be the shooter.\n\n          \n          Eunice smiles and speaks to Crew Cut's photo...\n\n          \n\n                                EUNICE\n                    Are you ready for your fifteen minutes,\n                    Sweetheart?\n\n          \n\n                                GREENLY\n                    That ain't all. Short stuff's work\n                    visa was signed by a sponsor that\n                    doesn't exist and look at the date.\n                    Two months after Nine Eleven.\n\n          \n\n                                EUNICE\n                    Someone maneuvered it through the\n                    system using false information during\n                    the highest alert in U.S. history.\n\n                                DOLLY\n                    Yakavetta's just a gangster. He ain't\n                    got the juice to pull that off.\n\n          \n\n                                EUNICE\n                    You're darn tootin' he don't.\n\n          \n\n                                GREENLY\n                    INS red flagged it like a motherfucker.\n                    It's a shit storm.\n\n          \n\n                                EUNICE\n                    Something stanks like manure.\n\n          \n          The cops nod.   Eunice turns and starts to move away...\n\n          \n\n                                                                       67.\n\n          \n\n          \n\n                                EUNICE (CONT'D)\n                    We got someplace to be! Let's go!\n\n          \n\n          INT. MERCEDES -- MOMENTS LATER\n\n\n          \n          Eunice drives.    The Detectives look nervous.\n\n          \n\n                                DOLLY\n                    What is this? Where are we going?\n\n          \n\n                                EUNICE\n                    It's time to revisit the scene of the\n                    crime.\n\n          \n\n          EXT. MCGINTY'S PUB -- LATER\n\n\n          \n          Eunice pulls to a stop. At the sight of the place, the cops turn\n          white as a ghost. All exit the vehicle and walk toward.\n\n          \n\n                                GREENLY\n                    It's after hours. I mean, if you\n                    wanted a drink then...\n\n          \n\n                                EUNICE\n                    37 bodies later and we're finally back\n                    where it all began. Y'ever heard of\n                    the southern expression, \"We have an\n                    elephant in the living room?\"\n\n          \n          She knocks on the door.   The cops are mortified.\n\n          \n\n                                EUNICE (CONT'D)\n                    Hope you fellas brought some peanuts.\n\n          \n          Doc opens it and lets them all into...\n\n          INT. MCGINTY'S -- CONTINUOUS\n\n\n          \n          Connor and Murphy are seated at the bar. They turn.   The cops are\n          dumbfounded. Duffy turns to Eunice, mystified.\n\n          \n\n                                DUFFY\n                    You knew all along.\n\n          \n\n                                  CONNOR\n                    What?    Ya don't call.   Ya don't write.\n\n          \n          Dolly actually drops to his knees in abject relief. Greenly laughs\n          and plants a kiss on Eunice's cheek. Doc pours shots. Eunice\n          smiles as all her guys hug and make merry. DISSOLVE TO...\n\n          \n\n                                                                      68.\n\n          \n\n          \n\n          INT. MCGINTY'S -- LATER\n\n\n          \n          Doc smiles from the bar as the group raises for a toast.\n\n          \n\n                                MURPHY\n                    I'm glad we got the band back\n                    together...\n                             (re: Romeo)\n                    ...even though our new bass player's\n                    kind of a retard.\n\n          \n          They all laugh, cheers and drink. Conversations buzz all around.\n          Eunice chats with the boys as she sips a cosmo.\n\n          \n\n                                CONNOR\n                    So, where'd you learn ta shoot like\n                    that?\n\n          \n\n                                EUNICE\n                    My Daddy was an old six gun shooter.      A\n                    real cowboy.\n\n          \n\n                                MURPHY\n                    Guess that makes you a cowgirl, eh?\n                    Thanks. Saved our asses.\n\n          \n\n                                EUNICE\n                    Don't mention it. Now, we have a\n                    little business to go over before you\n                    celebrate in earnest.\n\n          \n          She hands the INTERpol file to the brothers.\n\n          \n\n                                CONNOR\n                    This is the guy?\n\n                                EUNICE\n                    That's the guy. He's a Sicilian\n                    immigrant, name of Ottilio Panza.\n\n          \n\n                                  MURPHY\n                    Five, five?    He's short bastard isn't\n                    he?\n\n          \n\n                                EUNICE\n                    Yes...and well put. He'll be front\n                    page news in the morning but we have to\n                    assume Yakavetta already knows we've\n                    ID'd his guy. We can't give him time\n                    to 'Plan B' us.\n\n          \n\n                                                                 69.\n\n          \n\n          \n\n                                MURPHY\n                    We're hittin' him tomorrow night.   Dat\n                    soon enough?\n\n          \n          Everyone else cuts their conversation and listens.\n\n          \n\n                                 EUNICE\n                    Should be.   Where's it gonna happen?\n\n          \n\n                                 CONNOR\n                    The Pru.\n\n          \n\n                                DOLLY\n                    The Prudential Building?   What are you,\n                    cracked?\n\n          \n\n                                GREENLY\n                    Why don't you just do it on center ice\n                    at a fucking Bruin's game?!\n\n          \n\n                                CONNOR\n                    Dat's where the man is so dat's where\n                    we're goin'. No guts no glory, Green\n                    Beans.\n\n          \n\n                                MURPHY\n                    In fact, we could use a few extra\n                    hands...that is if you fellas can still\n                    get yer Irish on.\n\n          \n\n                                GREENLY\n                    Hey, I got balls for days, pally.   I'm\n                    a fucking sack-o-matic.\n\n          \n          They all chuckle.\n\n                                 DOLLY AND DUFFY\n                    We're in.\n\n          \n\n                                EUNICE\n                             (to all)\n                    Well, you boys have fun. Connor,\n                    Murphy? Escort a lady to the door?\n\n          \n          They each offer an arm and move her toward the door.\n\n          \n\n                                CONNOR\n                    Y'sure you don't wanna hear the plan?\n                    I'm not tryin' ta brag or nothin' but\n                    this one's a real Picasso.\n\n          \n\n                                 MURPHY\n                    Aw, Jesus.\n\n          \n\n                                                                        70.\n\n          \n\n          \n\n                                  CONNOR\n                    Hey.\n\n          \n\n                                EUNICE\n                    School night. Got some homework to do.\n                    Besides, I'd like to critique your\n                    masterpiece with a fresh eye.\n\n          \n          She stops at the door and turns.    Her face shows concern.\n\n          \n\n                                  MURPHY\n                    What is it?\n\n          \n\n                                EUNICE\n                    Something ain't right with this whole\n                    thing. Panza knew you were in there\n                    tonight and he just let it happen.\n                    Didn't lift a finger. I mean, if he's\n                    working for Yakavetta, why would he\n                    stand by and just watch all his guys\n                    get taken out?\n\n          \n\n                                MURPHY\n                    That is...interestin'.\n\n          \n\n                                CONNOR\n                    You think maybe we got another fox in\n                    the hen house here?\n\n          \n\n                                EUNICE\n                    Starting ta look that way. Somebody\n                    pushed that visa through. Could have\n                    ourselves a gen-u-ine 'Ghost in the\n                    Darkness,' here.\n\n          \n\n          INT. GREENHOUSE -- LATER\n\n          Crew Cut lies on the shop table. He's lost a lot of blood and is in\n          shock. Using gardening utensils, the Old Man removes the bullet.\n          We see his face for the first time. Unremarkable. In Italian...\n\n          \n\n                                CREW CUT\n                    They still live...What if he does not\n                    come? What if...\n\n          \n\n                                 OLD MAN\n                    Shhhhh.   He will come.\n\n          \n\n          INT. BASEMENT -- NIGHT\n\n\n          \n          The Irish GUN DEALER (30's) from the first film leads the brothers\n          and Romeo through a basement to a large, steel vault door.\n\n          \n\n                                                                       71.\n\n          \n\n          \n\n                                GUN DEALER\n                    Expanded my operation, since I saw ya\n                    last. Word got out who may or may not\n                    have outfitted ya. Turns out ya got\n                    quite the underground followin'.\n\n          \n          He swings the vault open. Romeo and the boys stand in angelic light\n          at the gates of Heaven. Cheesy music as they enter...\n\n          \n\n          INT. VAULT -- CONTINUOUS\n\n\n          \n          Expanded indeed. Gleaming weapons everywhere. Sheer awe.\n          Something catches Romeo's eye and he moves off. To boys...\n\n          \n\n                                GUN DEALER\n                    Please, gentlemen. Preferred customers\n                    select from my private reserve.\n\n          \n          He withdraws two Mahogany boxes.\n\n          \n\n                                GUN DEALER (CONT'D)\n                    If I may make a suggestion.\n\n          \n          He lifts the lids. In each box is a pair of Desert Eagle .50 cal\n          \"Black Outs\". The triangular barrels have been fitted with matching\n          triangular silencers. The boys are mystified.\n\n          \n\n                                MURPHY\n                    I feel like that kid who found the gold\n                    ticket in the candy bar in \"Willy Wonka\n                    and the Chocolate Factory.\"\n\n          \n\n                                  GUN DEALER\n                    Charlie.\n\n          \n\n                                CONNOR\n                    Yeah...Charlie.\n                             (picks up gun)\n                    And I want an Oompa Loompa now, Daddy,\n                    now.\n\n          \n          He pulls a few duffel bags.\n\n          \n\n                                GUN DEALER\n                    Full accessory packages.      I'm sure\n                    you'll find them useful.\n\n          \n          Romeo suddenly appears and slaps down a metal box.\n\n          \n\n                                ROMEO\n                    I'll take these.\n\n          \n          The boys look to him.    He sniffles.   Red eyes.\n\n          \n\n                                                                       72.\n\n          \n\n          \n\n                                MURPHY\n                    Have you been crying again?\n\n          \n          Romeo snaps to him, eyes wide in challenge.\n\n          \n\n                                ROMEO\n                    Yeah!  Tears of joy!\n                              (to Dealer)\n                    How much?\n\n          \n\n                                GUN DEALER\n                    You guys are on the house.\n\n          \n\n                               MURPHY\n                             (to Romeo)\n                    Let's see.\n\n          \n          Romeo withdraws two gold plated .45's, intricately engraved, pearl\n          handles with a Mexican flag. The boys snicker.\n\n          \n\n                                 ROMEO\n                    What?\n\n          \n\n                                 CONNOR\n                    Nothin'.\n\n          \n\n                                ROMEO\n                    Are you saying I look gay?!\n\n          \n\n                                  MURPHY\n                    No.    You just hail from a colorful...\n\n          \n\n                                ROMEO\n                             (to Dealer)\n                    You don't know me. You think these\n                    make me look gay?\n          Romeo poses.    The Dealer shrugs.\n\n          \n\n                                GUN DEALER\n                    You look like you might have seen one\n                    up close.\n\n          \n\n          EXT. COMMON HOME -- MORNING\n\n\n          \n          This is a common home at the end of a cul de sac. The Old Man picks\n          up the paper on his front stoop and shuts the door.\n\n          \n          He opens the paper with shock. A big picture of Crew Cut on the\n          front, \"SAINTS INNOCENT, NEW SUSPECT IN PRIEST'S MURDER\" He reads\n          frantically. \"New evidence discovered at the crime scene...\"\n\n          \n\n                                                                       73.\n\n          \n\n          \n\n                                 OLD MAN\n                    Evidence?\n\n          \n          He ambles into the house and to a...\n\n          \n\n          INT. BEDROOM -- CONTINUOUS\n\n\n          \n          The Old Man moves to Crew Cut's bedside. He sees the rosary about\n          the slumbering man's neck and rips it off. Crew Cut bolts awake!\n\n          \n\n                                OLD MAN\n                    Foolish, arrogant boy!   What have you\n                    done?!\n\n          \n          He whips Crew Cut with the rosary, until he cowers in the corner,\n          weeping profuse apologies in Italian.\n\n          \n\n          INT. PANIC ROOM -- AFTERNOON\n\n\n          \n          Monitors show angles of the apartment outside. This small space is\n          equipped for single living. Yakavetta is frazzled, baggy eyed in a\n          robe. Jimmy the Gofer sits quietly as Concezio babbles to himself.\n\n          \n\n                                CONCEZIO\n                    That wiley old fox not as clever as we\n                    thought. Or maybe he played me from the\n                    git. Y-you think he played me?\n\n          \n\n                                JIMMY\n                    Uh, Boss. Maybe you aught not to be\n                    telling me this stuff. I'm just...\n\n          \n          Concezio smacks him across the face.\n\n          \n\n                                CONCEZIO\n                    A little sensitivity, huh? You\n                    heartless cocksucker! I need to\n                    vindicate my feelings here! I can't\n                    tell those goombas outside! They'll\n                    serve up my balls over a plate of\n                    fucking spaghetti!\n\n          \n\n          INT. LUXURY APARTMENT -- MOMENTS LATER\n\n\n          \n          The Capos huddle up.   Hushed tones.\n\n          \n\n                                CAPO #4\n                    Fuck that. We got a mutiny on our\n                    hands. Every ten cent wanna be with a\n                    gun is moving on us all over town.\n\n          \n\n                                                                           74.\n\n          \n\n          \n\n                                CAPO #3\n                    Yeah and our fearless leader ain't even\n                    come out of his little pussy room yet.\n\n          \n          With this, the panic room door slides open and Concezio emerges\n          holding a bag. He dumps a bunch of cell phones on the coffee table.\n\n          \n\n                                CONCEZIO\n                    I want each of you to call your top\n                    button man. The best you got. I want\n                    them all here tonight. We rip this\n                    city a new asshole. It's time for us\n                    to reconnoiter our strength on the\n                    streets. We seize the day starting\n                    now...Carpel Tunnel, gentlemen, Carpel\n                    Tunnel.\n\n          \n          All are relieved and words of approval flow.\n\n          \n\n                                CAPO #5\n                    Glad to see you back among the living,\n                    Boss.\n\n          \n          Nearby, Jimmy knocks over a bottle of wine, CRASH! Concezio dives\n          back into the panic room. The door slides shut. DISSOLVE TO...\n\n          \n\n          EXT. THE PRUDENTIAL BUILDING -- NIGHT\n\n\n          \n          Dolly drives a laundry truck into the Pru's loading dock area.\n\n          \n\n          INT. LAUNDRY TRUCK -- NIGHT\n\n\n          \n          Dolly backs it up to the dock and pulls to a stop.   He turns.\n\n          \n\n                                 DOLLY\n                    God speed.\n          Romeo, in a laundry uniform, emerges from the back pushing a loaded\n          laundry cart. He enters a...\n\n          \n\n          INT. UTILITY HALL -- MOMENTS LATER\n\n\n          \n          At the hall's opposing end, two maintenance workers move toward.\n          Romeo sees and quickly puts his head down. Soon, Romeo and the\n          maintenance men converge. They turn, entering opposing elevators.\n\n          \n\n          INT. ROMEO'S ELEVATOR -- CONTINUOUS\n\n\n          \n          As the doors close, Romeo looks into the opposing elevator. The\n          maintenance men are Duffy and Greenly, ball caps, duffel bags.\n\n          \n\n                                                                       75.\n\n          \n\n          \n          As the elevator ascends, Romeo swipes off the laundry, pulls the\n          false top. The brothers pop out in their usual garb. Weapons\n          emerge and they gear up. Romeo looks unsure...\n\n          \n\n                                MURPHY\n                     What.\n\n          \n\n                                ROMEO\n                     Nothing.\n\n          \n\n                                 CONNOR\n                     Out with it! What the hell's the\n                     matter with ya?\n\n          \n\n                                 ROMEO\n                     Nothing! It's just...this is some\n                     heavy shit.\n\n          \n\n                                 CONNOR\n                     Ya did fine at your uncle's place.\n\n          \n\n                                 ROMEO\n                     Yeah, but we're going off a new script\n                     here. I'm just having a...period of\n                     adjustment.\n\n          \n\n                                 MURPHY\n                     You're about to have a period of\n                     gettin' yer ass beat!\n\n          \n\n                                 ROMEO\n                     Hey! You two ain't the only ones\n                     rollin' with no health insurance! Just\n                     let me do my thing. I'm absorbing this.\n\n          \n\n                                 CONNOR\n                     This is not the time for you to be\n                     absorbin' shit! Now, if ya freeze up\n                     when you get in there just point yer\n                     gay guns at 'em and fer Christ sakes,\n                     at least try ta look cool!\n\n          \n\n                                 MURPHY\n                     I thought you were all hot fer dis!\n\n          \n\n                                 ROMEO\n                     Oh, I'm hot! I'm fucking red hot! The\n                     kid's flamin' like Matt Damon in the\n                     Grande Camens!\n\n          \n          Ding!   Romeo has a look of dread.\n\n          \n\n                                                                        76.\n\n          \n\n          \n\n                                CONNOR\n                    This is you. Be on time.\n\n          \n          Romeo firms himself up as the door opens.\n\n          \n\n                                ROMEO\n                    I'll be there.\n\n          \n          Romeo exits with the cart. The boys remain.    The doors close.\n          Connor and Murphy look at each other.\n\n          \n\n                                CONNOR\n                    You ready fer dis shit, my dear\n                    brother?\n\n          \n\n                                MURPHY\n                             (cocking .50 cal)\n                    Let's do some gratuitous violence.\n\n          \n\n          FLASH TO WHITE...\n\n          \n\n          INT. LUXURY APARTMENT -- NIGHT\n\n\n          \n          A demolished environment. The towering windows are blown out,\n          providing a threatening view of the city below. Here, Eunice\n          stands, looking out over the panorama.\n\n          \n\n                                EUNICE\n                             (to herself)\n                    On a sultry Saturday in September the\n                    Saints saved seventeen souls...try\n                    saying that five times fast.\n\n          \n          She turns and walks the marble floor which is like a runway, lined\n          with pulverized statues. A long table of ravaged food extends.\n          Crime scene personnel toil. Ritualized bodies everywhere.   Greenly\n          is by the panic room. He pushes the \"talk\" button.\n\n          \n\n                                GREENLY\n                    Come on. There's nothing to be afraid\n                    of. It's all over.\n\n                             (TURNS)\n                    He won't come out.\n\n          \n          He joins Dolly and Duffy who stand on the periphery. Eunice is dead\n          center, absorbing the scene when suddenly, FBI Agent JOHN KUNTSLER\n          barrels in with his G-MEN #1 - #3.\n\n          \n\n                                KUNTSLER\n                    Special Agent Bloom! You are hereby\n                    relieved of all obligation to this\n                    investigation.\n\n          \n\n                                                                           77.\n\n          \n\n          \n          He holds up his I.D.   A collective groan from crime scene personnel.\n\n          \n\n                                KUNTSLER (CONT'D)\n                    That's right, kids. This crime scene\n                    is now under the full jurisdiction of\n                    your beloved federal government. As of\n                    now, you will all report to me, Special\n                    Agent John Kuntsler.\n\n          \n          The detectives look to Kuntsler's G-men as if squaring off.\n\n          \n\n                                KUNTSLER (CONT'D)\n                    Don't let us interrupt you. Just don't\n                    forget to turn over everything you\n                    find. We have people standing by ready\n                    to take credit for all your hard work.\n\n          \n          He chuckles as all return to work.   Kuntsler turns to Eunice.\n\n          \n\n                                KUNTSLER (CONT'D)\n                    So, how ya doin', Bloomy?\n\n          \n\n                                EUNICE\n                    Just fine...Cunty.\n\n          \n          Kuntsler's shit eating grin disappears.   He leans in.   Hushed tones.\n\n          \n\n                                KUNTSLER\n                    Nice little science project you got\n                    going with these three goofballs.\n                             (re: detectives)\n                    You trying to turn them into your own\n                    little junior G-men? Well, you can put\n                    sprinkles on shit, Bloom, but it's\n                    still shit. So, you and your Keystone\n                    Cops can all go home now and let the\n                    professionals handle this?\n\n          \n\n                                EUNICE\n                    Boy. I'd love to hear a gen-u-wine\n                    professional's assessment of a crime\n                    scene. How 'bout you, detectives?\n\n          \n          Dolly, Duffy and Greenly chorus the affirmative. Kuntsler looks\n          unsure then phonies up some bravado. Looks around...\n\n          \n\n                                KUNTSLER\n                    O'kay. Seems pretty obvious. The door\n                    was broken down. We've got our point\n                    of entry. The assailants fired in this\n                    direction.\n                             (points toward windows)\n\n                                (MORE)\n\n          \n\n                                                              78.\n\n                               KUNTSLER (CONT'D)\n                    Explains the windows. The victims\n                    were...\n\n          \n\n                                EUNICE\n                    There are three inaccuracies in what\n                    you just said. Number one, David.\n\n          \n\n                                GREENLY\n                    If the windows were shattered by\n                    gunfire coming from inside the room,\n                    the glass would have been blown\n                    outward. As you can see, most of it is\n                    on the inside.\n\n          \n          Kuntsler looks.   Sure enough.   His eyes widen.\n\n          \n\n                                EUNICE\n                    Number two, Dolly.\n\n          \n\n                                DOLLY\n                    Blood splatters in the direction of the\n                    rounds fired. If the assailants\n                    discharged toward the windows, the\n                    blood would follow suit. Here, the\n                    majority of splatter is in the opposing\n                    direction.\n\n          \n          Kuntsler looks.   Sure enough.\n\n          \n\n                                EUNICE\n                    Number three, Duffy.\n\n          \n\n                                DUFFY\n                    Trick question. There is no number\n                    three. He only fucked up twice.\n\n          \n\n                                EUNICE\n\n                             (WHISTLES)\n                    Looks like Bloomy aced her science\n                    project.\n\n          \n          Kuntsler's men look embarrassed.\n\n          \n\n                                KUNTSLER\n                    That was just off the...I would have\n                    seen the blood thing...I haven't even\n                    had time to...\n\n          \n\n                                EUNICE\n                    Why don't you let me take a crack at\n                    it, John? Won't cost you nuthin'.\n\n          \n\n                                KUNTSLER\n                    And just why would I do that?\n\n          \n\n                                                                       79.\n\n          \n\n          \n\n                                EUNICE\n                    Cuz, tonight...mamma's right on time.\n\n          \n\n          FLASH TO WHITE...\n\n          \n\n          INT. LUXURY APARTMENT -- EARLIER\n\n\n          \n          Eunice, alone, saunters before the huge windows which are now\n          intact. Concezio holds court nearby. He is shaved and dressed.\n          His Capos sit around in a loose semi-circle. There are six\n          dangerous looking men standing shoulder to shoulder before them.\n\n          \n\n                                EUNICE\n                    This evening's topic of discussion?\n                    Desperate times require desperate\n                    measures.\n\n          \n\n                                CONCEZIO\n                    Desperate times require...some, you\n                    know, some desperate shit. Starting\n                    tonight, every one of you fat fucking\n                    slobs is back on the streets and\n                    earning your daily bread.\n\n          \n          A chorus of protest.\n\n          \n\n                                CONCEZIO (CONT'D)\n                    Shut the fuck up!\n                              (they obey)\n                    We got no choice. You motherfuckers\n                    better get in touch with your 'inner\n                    gangster'. It's time to knock the dust\n                    off your ball bats! You break bones!\n                    You smash heads! You do whatever you\n                    gotta do!\n\n                                EUNICE\n                    Which brings us to the relevance of our\n                    new guests.\n\n          \n\n                                CONCEZIO\n                             (to button men)\n                    Each one of you is to stick to the guy\n                    that called you here like glue. You\n                    arm yourselves to the teeth, pick your\n                    own crews. These bible banging psychos\n                    will make an attempt. It's your job to\n                    blow their souless hearts out of their\n                    chests.\n\n          \n\n                                EUNICE\n                    It's time to reclaim the streets with\n                    an iron fist.\n\n          \n\n                                                                        80.\n\n          \n\n          \n\n                                CONCEZIO\n                    We gotta take back what's ours with\n                    some sincere ironfistery.\n\n          \n\n          WHIP PAN...\n\n          \n\n          EXT. BACK TO PRESENT, ROOF OF PRUDENTIAL -- NIGHT\n\n\n          \n          Eunice walks the roof with Kuntsler et al in tow.\n\n          \n\n                                EUNICE\n                    Let's explain the glass, now.   Why is\n                    most of it inside the room?\n\n          \n          They halt before a window washing scaffold.\n\n          \n\n                                EUNICE (CONT'D)\n                    Here's why...or it will be \"why\" in a\n                    moment. Y'see, these boys. Well, to\n                    put it simply, they tend to get\n                    reeeeal...\n\n          \n\n          FLASH TO WHITE...\n\n          \n\n          EXT. FLASHBACK, SCAFFOLD -- NIGHT\n\n\n          \n\n                                 CONNOR\n                    Creative!   It's a creative plan!\n\n          \n          Duffy, Greenly and the boys descend the tower. Greenly works the\n          controls as Duffy helps the boys tie on harnesses.\n\n          \n\n                                MURPHY\n                    It's ridiculous! Probably based on\n                    some stupid shit ya saw in a movie!\n                    And here I am AGAIN all tyin' myself up\n                    with rope! What is the deal with you\n                    and rope?! Honestly!\n\n          \n\n                                CONNOR\n                    It happens ta be a useful thing!\n\n          \n          The boys start yelling over each other.   Duffy turns to Connor.\n\n          \n\n                                DUFFY\n                    You didn't get this from a movie...did\n                    you?\n\n          \n          Murphy regards his brother, \"well?\"   Pause.\n\n          \n\n                                                                      81.\n\n          \n\n          \n\n                                CONNOR\n                    The \"Eiger Sanction,\" Clint Eastwood!\n                    And it worked like a fucking charm for\n                    him!\n\n          \n\n          INT. JANITOR CLOSET -- SAME TIME\n\n\n          \n          Romeo peeks out a cracked door at a Mafioso guard. LLOYD (33yrs), a\n          janitor, gagged and duct taped to a hand truck. He has a shiner.\n          Romeo looks through his wallet.\n\n          \n\n                                ROMEO\n                    O'kay Lloyd Cranston of 135 Liberty\n                    Lane, apartment 3C.\n                             (shows him wallet pic)\n                    Lovely wife and kids. How old are\n                    they? Nevermind. Here's the\n                    situation, Lloyd. Me and a couple of\n                    friends of mine are fittin' to do some\n                    killin' here tonight. I'm talking\n                    bullets and blood, custom-wholesale\n                    slaughter. You following me, Lloyd-O?\n                             (Lloyd nods)\n                    Good. Now, I've run into a little\n                    snag. I need to figure out a tag line.\n                    You know, something cool to say when\n                    it's all over like...\"I'll be back,\"\n                    but mine, y'know? I need to own this\n                    one. I think this'll help me get\n                    through the quote, unquote event. I'm\n                    going to take your gag off and you and\n                    me are going to riff a little, o'kay?\n                    Let's have fun with this.\n\n          \n          Lloyd nods and Romeo rips off his gag.\n\n                                LLOYD\n                    I can't believe you! I'm a fucking\n                    janitor. What do I know about bullets\n                    and slaughter and shit?\n\n          \n\n                                ROMEO\n                    Not riffing, Lloyd! Now, I need an\n                    \"Hasta La Vista\" line, toute fucking\n                    suite and you're gonna help me think of\n                    one!\n\n          \n\n          EXT. SCAFFOLD -- LATER\n\n\n          \n          Eunice stands alone on the end of the scaffold.\n\n          \n\n                                                                       82.\n\n          \n\n          \n\n                                EUNICE\n                    And you can count on it like the U.S.\n                    mail. Through rain, sleet, hail or\n                    snow...something always seems to go\n                    wrong for these poor sons o' guns.\n\n          \n          The scaffold suddenly stops.\n\n          \n\n                                CONNOR\n                    What the fuck?\n\n          \n\n                                GREENLY\n                             (hitting controls)\n                    I don't know! It just stopped!\n\n          \n\n                                MURPHY\n                    Well, get it fuckin' goin' again!\n\n          \n\n                                GREENLY\n                    It won't turn back on!     It just died!\n\n          \n\n                                BROTHERS\n\n                    OH, SHIT!\n\n          \n          The boys look over the edge.     Long way down.\n\n          \n\n                                CONNOR\n                    How much time?!\n\n          \n\n                                DUFFY\n                             (looks at watch)\n                    Sixty Seconds!\n\n          \n\n                                MURPHY\n                    We gotta go now!\n\n                                DUFFY\n                    What are you talking about!?\n\n          \n\n                                CONNOR\n                    If we're even a few seconds late,\n                    Romeo's dead! We gotta go!\n                             (looking up)\n                    We're down thirteen stories!\n\n          \n\n                                MURPHY\n                    Eleven more to go!     Ball park it!\n\n          \n          They start counting out lengths of rope by feeding them through\n          their hands and extending their arms out to the sides.\n\n          \n\n                                BROTHERS\n                    One floor, two, three...\n\n          \n\n                                                                          83.\n\n          \n\n          \n\n                                MURPHY\n\n                             (MIFFED)\n                    The fuckin' Eiger Sanction.\n\n          \n\n          INT. JANITOR CLOSET -- SAME TIME\n\n\n          \n          Lloyd struggles to think.\n\n          \n\n                                LLOYD\n                    Uh...\"Take that, suckers!\"\n\n          \n\n                                ROMEO\n                    Not cool enough.\n\n          \n\n                                LLOYD\n                    Uh, \"Merry Christmas, mother fuckers!\"\n\n          \n\n                                ROMEO\n                    Too sacrilegious.\n\n          \n\n                                LLOYD\n                    Oh God, uh, how about \"Eat it!\"\n\n          \n\n                                ROMEO\n                    What are we at, a buffet, now?\n\n          \n\n                                LLOYD\n                    Good God, man! I'm a...\n\n          \n\n                                ROMEO\n                    Hang on, you might be onto something\n                    with the buffet thing, like with food,\n                    y'know? Let's brainstorm on that idea\n                    for a minute.\n\n          \n\n          EXT. SCAFFOLD -- SAME TIME\n\n          The boys' ropes are secured and they each pull a Rambo knife.\n\n          \n\n                               MURPHY\n\n                    TIME?!\n\n          \n\n                                DUFFY\n\n                    JESUS CHRIST! SEVEN SECONDS...SIX...\n\n                    FIVE...\n\n          \n\n          INT. HALLWAY -- SAME TIME\n\n\n          \n          Romeo, pushing his cart, jives down the hall toward the guard,\n          singing \"La Couca Racha.\" The guard puts out a halting hand.\n\n          \n\n                                DUFFY V.O.\n\n                    FOUR...THREE!...TWO!...\n\n          \n\n                                                                         84.\n\n          \n\n          \n\n          WHIP PAN...\n\n          \n\n          INT. BACK TO PRESENT, LUXURY APARTMENT -- NIGHT\n\n\n          \n\n                                  EUNICE\n                      One...thing has always amazed me.\n\n          \n          Eunice stands dead center.   Everyone watches...\n\n          \n\n                                  EUNICE (CONT'D)\n                      How quiet it gets. You ever noticed\n                      that? It's hard to imagine that just a\n                      few hours ago, it was the God damn O.K.\n                      coral in here.\n\n          \n\n          FLASH TO WHITE...\n\n          \n          FANTASY SEQUENCE:   Cool Country Western music!\n\n          \n          CLOSE ON:   A pair of cowboy boots pacing toward.\n\n          \n          Eunice stands before the looming windows.    The immaculate food table\n          stretches before her.\n\n          \n          She is now in full cowgirl regalia: Leather chaps, rawhide coat,\n          boots, cowboy hat and a pair of gleaming six guns on her hips.\n\n          \n          With the brim of her hat slung low, Eunice bursts into twirling\n          gunplay with her Colts. She spins them all around, flipping them,\n          catching them, etc. She holsters and stops.\n\n          \n\n                                  EUNICE (CONT'D)\n                      One thang I'm gon guarantee ya...\n\n          \n\n          EXT. SCAFFOLD -- SAME TIME\n\n          First, Connor jumps off, then Murphy.    They fall down and out in\n          slow motion, knives in hand.\n\n          \n\n          INT. LUXURY APARTMENT -- MOMENTS LATER\n\n\n          \n          Eunice rolls the chamber of one of her Colts along her arm.\n\n          \n\n                                  EUNICE\n                      We gon have us a good time...\n\n          \n\n          INT. OUTSIDE WINDOWS -- SAME TIME\n\n\n          \n          The boys snap to a stop and swing in, toward the building.    With\n          their free hand they each pull a .50 cal.\n\n          \n\n                                                                         85.\n\n          \n\n          \n\n          INT. LUXURY APARTMENT -- MOMENTS LATER\n\n\n          \n\n                                 EUNICE\n                     ...in the old barn tonight!\n\n          \n          The Country Western music goes hard core!\n\n          \n          SLO-MO: Two bullet holes pierce the windows behind Eunice as she\n          levels her Colts. The mammoth panes shatter but stay in the frame.\n\n          \n          SLO-MO: All gangsters bolt upright as their plasma screen explodes\n          with the boys' rounds. Some pull weapons.\n\n          \n\n          INT. HALL -- SAME TIME\n\n\n          \n          Romeo pulls his .45's and takes out the guard.   He kicks in the door\n          and rushes in...\n\n          \n\n          INT. LUXURY APARTMENT -- MOMENTS LATER\n\n\n          \n          SLO-MO: The brothers smash through the glass.    They fire as they\n          swing over Eunice's head.\n\n          \n          SLO-MO: Eunice leaps onto the table as the boys cut their ropes in\n          mid air with the Rambo knives. The brothers land on their knees.\n          Their momentum carries them, sliding on either side of the table.\n\n          \n          SLO-MO: Eunice runs along the table top, crushing food and keeping\n          pace with the boys as all three let the led out.\n\n          \n          SLO-MO:   The gangsters and button men return fire in chaos.\n\n          \n          SLO-MO: Gangsters are torn up as they are blown over furniture,\n          into walls. Romeo blasts. Slow motion gun battle.\n\n          \n          SLO-MO: Yakavetta runs toward his panic room. At the last second,\n          Jimmy the Gofer hip-checks him and dives in. The door slides shut.\n\n          \n          For a few moments the gun battle rages around Eunice who stands in\n          the center rapid firing at the gangsters.\n\n          \n\n                                 EUNICE\n\n                     YEEEEEEE HAAAAAAAW!!!\n\n          \n          Soon it is over. The brothers slam Concezio to his knees and level\n          to the back of his head. As he begs for his life...\n\n          \n\n                                 BOTH\n                     And shepherds we shall be, for Thee, my\n                     Lord, for Thee. Power hath descended\n                     forth from Thy hand, that our feet may\n                     swiftly carry out Thy command.\n\n                                 (MORE)\n\n          \n\n                                                                            86.\n\n                                BOTH (CONT'D)\n                     So, we shall flow a river forth to Thee\n                     and teeming with souls shall it ever\n                     be.\n\n          \n          Romeo watches in awe.\n\n          \n\n                                 BOTH (CONT'D)\n                     In Nomine Patris, e Filii, e Spiritus\n                     Sancti.\n\n          \n          Boom.   Concezio drops.   Romeo's been waiting, guns up and...\n\n          \n\n                                 ROMEO\n                     \"Who ordered the whup ass fajita!?\"\n\n          \n\n                                  MURPHY\n                     What?\n\n          \n\n                                 CONNOR\n                     Whup ass fajita?\n\n          \n          The brothers turn to each other.\n\n          \n\n                                 CONNOR AND MURPHY\n                     That's fuckin' stupid.\n\n          \n          Eunice whistles in sympathy as she lifts her brim with a Colt.\n\n          \n\n                                 EUNICE\n                     Hold up, now.\n\n          \n          Everything freezes in place.     Eunice shuffles over to Romeo.\n\n          \n\n                                 EUNICE (CONT'D)\n                     Was that the best you could do?\n\n          \n\n                                 ROMEO\n                     It's just...I couldn't think...I\n\n          \n\n                                  EUNICE\n                     Shhhhhh.\n                              (whispers in ear)\n                     Ya broke down the door, didn'tcha?\n\n          \n          Romeo snaps his head toward the entry with inspiration in his eyes.\n          QUICK CUT: He breaks down the door. QUICK CUT: The brothers shoot\n          Yakavetta. QUICK CUT: Romeo, guns up and once more with feeling...\n\n          \n\n                                 ROMEO\n                     Ding dong, motherfucker, diiiing dong!\n\n          \n          The brothers look at Romeo, then to each other.\n\n          \n\n                                                                       87.\n\n          \n\n          \n\n                                 MURPHY\n                    Exactly.\n\n          \n\n                                CONNOR\n                    You said it.\n\n          \n\n          WHIP PAN...\n\n          \n\n          INT. BACK TO PRESENT, LUXURY APARTMENT -- LATER\n\n\n          \n          Eunice stands before the panic room door.   She is totally\n          disheveled. She swipes her hair back.\n\n          \n\n                                EUNICE\n                    And that, gentlemen...is the sound of\n                    the fat lady singin'.\n\n          \n          Everyone stands in shock, Kuntsler, his G-men, the detectives even\n          crime scene workers. Greenly whispers to Duffy...\n\n          \n\n                                GREENLY\n                    Should we...clap or something?\n\n          \n\n                                 DUFFY\n                    Shut up.\n\n          \n          Suddenly, the panic room door slides open and Jimmy yanks Eunice\n          inside. The door shuts. Everyone rushes toward.\n\n          \n\n                                 KUNTSLER\n                    Hey!\n\n          \n          Duffy bangs on the door.\n\n          \n\n                                  DUFFY\n                    Eunice!    Oh, shit!    Eunice!\n          Greenly slams the talk button.\n\n          \n\n                                GREENLY\n                    If you hurt her, you piece of shit, I\n                    will kill you! Do you fucking hear,\n                    me? I'll kill you!\n\n          \n          Greenly wheels around, facing Kuntsler.\n\n          \n\n                                GREENLY (CONT'D)\n                    Get a hostage negotiator down here and\n                    put some stank on it! He could be in\n                    there all...touching her and shit!\n\n          \n\n                                                                        88.\n\n          \n\n          \n\n          INT. PANIC ROOM -- CONTINUOUS\n\n\n          \n          Eunice has Jimmy pinned face down to the couch, arm twisted behind.\n\n          \n\n                                 JIMMY\n                    I'm sorry!   I'm sorry!   I wasn't gonna\n                    hurt you!\n\n          \n\n                                EUNICE\n                    You bet your ass you weren't.\n\n          \n\n                                JIMMY\n                    Just lemme explain. I have\n                    information, like pertinent\n                    information. Ouch! Look, I was\n                    listening to you out there and that's,\n                    like, exactly what happened. That's\n                    what made me think you were the person\n                    to talk to.\n\n          \n          Eunice lets him go and stands.   Jimmy sits up.\n\n          \n\n                                EUNICE\n                    Yakavetta had a partner, didn't he.\n\n          \n          Jimmy looks scared.\n\n          \n\n                                 JIMMY\n                    Yeah.\n\n          \n\n                                EUNICE\n                    You saw this fella?\n\n          \n\n                                JIMMY\n                    Yeah. It was only one time and just\n                    for a second but I think I could ID\n                    him. I don't know his name, though.\n                    Concezio always called him the \"Old\n                    Man\" accept one time when he called him\n                    something else, like he fucked up and I\n                    wasn't supposed ta hear it.\n\n          \n\n                                EUNICE\n                    What was it?\n\n          \n\n                                JIMMY\n                    He called him...the Roman.\n\n          \n\n          EXT. LUXURY APARTMENT -- MOMENTS LATER\n\n\n          \n          Panic room door opens and Eunice emerges with Jimmy in tow.\n\n          \n\n                                                                       89.\n\n          \n\n          \n\n                                GREENLY\n                             (re: Jimmy)\n                    Did this little motherfucker...?\n\n          \n\n                                EUNICE\n                    Easy, David. I'm fine. C'mon gents,\n                    we're leaving. This is the Fed's\n                    problem, now.\n\n          \n\n                                KUNTSLER\n                    Hey! What happened in there?      What was\n                    said to you, Agent?\n\n          \n          Jimmy is cuffed by two uniforms.\n\n          \n\n                                EUNICE\n                    You got him in custody. Ask him\n                    yourself. You're the professional.\n\n          \n          She walks out and the detectives follow.\n\n          \n\n                                DOLLY\n                    Yeah, professional moron.\n\n          \n\n          EXT. PRUDENTIAL BUILDING, GROUND PLAZA -- NIGHT\n\n\n          \n          There are coroner vans and moderate police activity here as Eunice\n          talks with the detectives who all seem perplexed.\n\n          \n\n                                DUFFY\n                    I got no idea. That's just weird. The\n                    Roman? What do you think it means?\n\n          \n\n                                EUNICE\n                    Feels like our ghost ta me.\n\n                                DOLLY\n                    What do we do now? I mean, the\n                    brothers ain't goin' nowhere until we\n                    get Panza or they do.\n\n          \n\n                                EUNICE\n                    We've all had enough excitement for one\n                    night. Let's sleep on it.\n\n          \n\n          EXT. ALLEY ACROSS FROM PLAZA -- SAME TIME\n\n\n          \n          Crew Cut watches Eunice and the detectives from the dark alley.    He\n          has shaved his head bald, giving him a sinister look.\n\n          \n\n                                                                        90.\n\n          \n\n          \n\n          INT. MCGINTY'S -- LATER\n\n\n          \n          The place is empty except for Connor and Murphy having a celebratory\n          shot at the bar and cleaning their weapons.\n\n          \n\n                                MURPHY\n                    When's Romeo returnin' to the \"hide\n                    out?'\n\n          \n\n                                CONNOR\n                    Soon as he's done apologizin' to his\n                    uncle for wreckin' his restaurant.\n\n          \n\n                                MURPHY\n                    And he should be sorry.   The\n                    disrespect.\n\n          \n          They chuckle as a loud knocking is heard.   As Doc peeps through the\n          spy hole and unchains the front doors...\n\n          \n\n                                DOC\n                    Hold your damn horses!\n\n          \n          He lets Greenly in and locks it behind him. Greenly takes a few\n          steps in, stops and grabs his crotch with both hands.\n\n          \n\n                                GREENLY\n                    Sack-o-matic, I said!\n\n          \n          As the boys guffaw, BOOM! A shotgun blast through the door sends\n          Greenly to the floor with a gaping wound in his back.\n\n          \n          Crew Cut bursts in with a smoking pig nose shotgun hanging from a\n          shoulder strap. He pulls two Sigs and rapid fires at the brothers.\n\n          \n          The boys jump over the bar frantically try to reassemble their\n          weapons. Connor and Murphy check their clips.\n\n          \n\n                                MURPHY\n                    I got nothin'!\n\n          \n          Connor racks his .50 cal and looks in the chamber.\n\n          \n\n                                CONNOR\n                    One in the hole.\n\n          \n          They see a shotgun behind the bar. Murphy grabs it.   Just as they\n          are about to stand, they hear Doc cry out.\n\n          \n\n                               DOC\n                    Boys!\n\n          \n\n                                                                       91.\n\n          \n\n          \n          They stand and level. Crew Cut has Doc from behind, .9mm to his\n          temple. Thick accent...\n\n          \n\n                                CREW CUT\n                    Put dem down! Throw dem over!\n\n          \n          The boys do not flinch. Crew Cut pushes his gun into Doc's temple\n          hard. He cries out in pain.\n\n          \n\n                                CREW CUT (CONT'D)\n                    Throw dem over!\n\n          \n          The boys toss their guns over the bar. Crew Cut levels toward them,\n          holding Doc in place. He whispers in Doc's ear.\n\n          \n\n                                CREW CUT (CONT'D)\n                    Brothers, eh? Which one first?      This\n                    one?\n                             (re: Murphy)\n                    Dee other, eh?\n\n          \n          He cocks back his hammer. A silence POP! rings out from the\n          shadows. Crew Cut's hand is hit. He drops, crying out in pain.\n\n          \n          SLO-MO: Poppa M emerges from the shadows and moves to Crew Cut with\n          a smoking, silenced Walther pistol in hand.\n\n          \n          The brothers have just a moment of shock before Greenly chokes up\n          some blood. They jump the bar and rush to him.\n\n          \n\n                                MURPHY\n                    Jesus Christ!\n\n          \n\n                                 CONNOR\n                    Doc!   Call da fuckin' ambulance!\n          As they hold Greenly and beg him to hold on, we move to Poppa M\n          standing over Crew Cut. Crew Cut looks up at him in awe.\n\n          \n\n                                CREW CUT\n                    You.\n\n          \n\n                                POPPA M\n                    Where is the Old Man?\n\n          \n\n                                CREW CUT\n                    Never.\n\n          \n          Poppa M pulls two .38 revolvers. He snaps the rotary chambers out,\n          puts one bullet in each gun, spins the chambers and snaps them shut.\n          He holds them out to Crew Cut. The boys weep, oblivious to this.\n\n          \n\n                                                                         92.\n\n          \n\n          \n\n                                MURPHY\n                    Just hold on.\n\n          \n\n                                CONNOR\n                    Hang in there, brother.     They're\n                    comin'.\n\n          \n          Greenly struggles to speak.\n\n          \n\n                                GREENLY\n                    Naw, boys...it's over. Don't\n                    worry...proudest day of my life.\n\n          \n          He seizes violently and dies. The brothers are in anguish. Crew\n          Cut picks a .38 and stands. He and Poppa M level to each other's\n          foreheads. Crew Cut is excited. Poppa M is calm, tranquil. The\n          brothers bolt up in shock.\n\n          \n\n                                  BROTHERS\n                    Da!\n\n          \n\n                                  POPPA M\n                    Easy, boys.\n\n          \n          The boys watch in horror, trying to figure it out. Poppa M motions\n          for his opponent to go first. Crew Cut cocks his hammer back with a\n          \"click.\" The brother's eyes go wide.\n\n          \n\n                                MURPHY\n                    What the fuck's he doin'?\n\n          \n          Crew Cut pulls the trigger, \"click!\"\n\n          \n\n                                BROTHERS\n\n                    JESUS CHRIST!\n          Connor rushes over and grabs up the shotgun.\n\n          \n\n                                CONNOR\n                    I'm gonna blow this mother fucker's\n                    brains out, right now!\n\n          \n          He cocks it and levels to Crew Cut's head.\n\n          \n\n                                  POPPA M\n\n                    CONNOR!\n\n          \n          Connor stops.   Poppa M holds out his free hand.   Halt.\n\n          \n\n                                POPPA M (CONT'D)\n                    Son...Daddy's workin'.\n\n          \n          Connor lowers the gun.    Poppa M pulls back the hammer, \"click.\"\n\n          \n\n                                                                           93.\n\n          \n\n          \n\n                                 POPPA M (CONT'D)\n                     Where is he?\n\n          \n          Crew Cut is unsure of himself. He thinks. Shakes his head.       The\n          brothers focus on Poppa M's gun as he tenses on the trigger.\n\n          \n\n                                  CONNOR AND MURPHY\n\n                                (WHISPER)\n                     Come on.\n\n          \n          Crew Cut clenches up, bracing for impact. Poppa M pulls, \"click.\"\n          The brothers drop to their knees and pray hard. Crew Cut recovers.\n          He smiles, pulls back the hammer. In Italian...\n\n          \n\n                                 CREW CUT\n                     Make me famous.\n\n          \n          \"Click!\"   Crew Cut's eyes widen in fear.\n\n          \n\n                                  POPPA M\n                                (pulling back hammer)\n                     Where?\n\n          \n          The brothers pray faster as Crew Cut thinks in horror.\n\n          \n\n                                   CREW CUT\n\n                     FUCK YOU!!!\n\n          \n          BOOM!   Crew Cut falls dead.\n\n          \n\n          INT. UNCLE CESAR'S HOUSE, KITCHEN -- LATER\n\n\n          \n          The boys sit at the kitchen table with Poppa M.      Romeo is propped up\n          on a counter, nearby. Cesar sets out coffee.\n\n          \n\n                                 POPPA M\n                     I'm so sorry, boys.      This is all my\n                     fault.\n\n          \n          Cesar takes Romeo and leaves, giving them some privacy.\n\n          \n\n                                 MURPHY\n                     What are ya talkin' about, Da?\n\n          \n          Poppa M strokes the faded \"butterfly\" tattoo on the back of his\n          hand. Presently...\n\n          \n\n                                 POPPA M\n                     I was an immigrant to the U.S. in 1958.\n                     I was sixteen. I came to New York\n                     where my father, Jacob MacManus, was a\n                     cobbler.\n\n                                 (MORE)\n\n          \n\n                                                                       94.\n\n                                POPPA M (CONT'D)\n                    Had a little shop and I was to learn\n                    the family business. Mafia was\n                    everywhere in those days.\n\n          \n\n          INT. FLASHBACK, COBBLER SHOP -- DAY\n\n\n          \n          Italian THUGS #1-4 talk to JACOB MacManus (43yrs). In these\n          flashbacks we will refer to young Poppa M as \"Noah.\" NOAH (16)\n          works in back but watches.\n\n          \n\n                                POPPA M V.O.\n                    Simple extortion...protection money.\n                    But your grandfather was proud.\n\n          \n\n                                JACOB\n                    I can't help ya with dat, lads. Ya got\n                    problems with your shoes, I'd be happy\n                    to have a look, got fair prices.\n\n          \n\n                                POPPA M V.O.\n                    I just...watched.\n\n          \n          Noah stands shaking as he watches his father beat to death. We fade\n          into later as he holds his father's body, wailing. An Italian kid\n          with a leg brace, LOUIE (18yrs), staggers in and hobbles to Noah.\n\n          \n\n                                LOUIE\n                    Il ochio de dio! We gotta call the\n                    polizia, Noah! We gotta call somebody!\n\n          \n\n          EXT. FUNERAL -- MORNING\n\n\n          \n          Noah, Louie and a priest are the only ones present at this modest\n          affair. Louie weeps. Noah is emotionless.\n\n          \n\n                                POPPA M V.O.\n                    I buried my father, then I buried the\n                    men who killed him. Louie, my best\n                    friend, helped me...\n\n          \n\n          INT. KITCHEN -- NIGHT\n\n\n          \n          Noah holds a knife to Thug #1's throat at a card table. He has THUG\n          #2's head pinned to the table top with a .38 cal. Nearby, Louie\n          holds a large .44 magnum with shaking hands. Seated Thugs #3 and #4\n          hands raised, are scared as they look at Noah's dead eyes.\n\n          \n\n                                THUG #3\n                    Come on, kid. It was an accident.\n                    We can work dis out. Whatever you want.\n\n          \n\n                                                                         95.\n\n          \n\n          \n\n                                THUG #4\n                    He ain't gonna do shit.\n                             (to Thug #3)\n                    I'll take two.\n\n          \n\n                                THUG #3\n                    What da fuck's da matter with you?\n                    Can't you see...\n\n          \n\n                                THUG #4\n                    I see just fine. Deal.\n\n          \n\n                                THUG #1\n                             (in Italian, to Louie)\n                    You're Italian, kid. Help us out here.\n                    Put one in the back of his head and you\n                    get anything you want!\n\n          \n\n                                LOUIE\n                    I, I, I...am his friend.\n\n          \n\n                                THUG #4\n                    Fuck him and fuck his friend. Deal the\n                    cards! He ain't got the balls.\n\n          \n          Noah shoots Thug #2 then cuts Thug #1's throat. The other Mafiosi\n          scream in horror. Louie kneels and weeps. Noah shoots Thug #3 in\n          the heart and calmly takes aim at Thug #4. He shoots him in the\n          throat and he is blown to the floor, grasping his bleeding neck.\n\n          \n          Noah rounds the table and takes aim. The man is choking on his own\n          blood. Noah slowly lowers his gun and just watches.\n\n          \n\n          INT. COBBLER SHOP -- AFTERNOON\n\n\n          \n          Louie works on a pair of shoes.   They are both a bit older.\n\n                                POPPA M V.O.\n                    It started out slowly. Just the ones\n                    who were a threat to us.\n\n          \n          MAFIOSO #1 and #2 talk to the stoic Noah.\n\n          \n\n                                MAFIOSO #1\n                    Come on, kid. It's good for you, good\n                    for us. We'll move it right out the\n                    back of the place.\n\n          \n\n                                MAFIOSO #2\n                    It'll never touch you. You got the\n                    word of the Bonnavese family on that.\n\n          \n          No response from Noah.   Dead eyes.\n\n          \n\n                                                                           96.\n\n          \n\n          \n\n                                MAFIOSO #1\n                    What's da matter with you, eh?\n\n          \n          We see Louie peeking through the curtains.\n\n          \n\n                                LOUIE\n\n                             (WHISPERING)\n                    Easy, Noah...easy friend.\n\n          \n\n                                MAFIOSO #2\n                    What are you, stupid or something?\n\n          \n          He smacks Noah across the face.\n\n          \n\n                                                          CUT TO:\n\n          \n\n          EXT. WOODS -- NIGHT\n\n\n          \n          Noah and Louie bury the bodies of Mafioso #1 and #2.      Louie stops\n          and rests. He watches Noah and thinks.\n\n          \n\n          INT. COBBLER SHOP -- DAY\n\n\n          \n          \"CLOSED\" sign in the door.   Noah and Louie eat sandwiches.\n\n          \n\n                                POPPA M\n                    Then one day...\n\n          \n\n                                LOUIE\n                    Why should we not help others who\n                    suffer these Mafia thugs?\n\n          \n          Noah puts down his sandwich. Louie talks to Noah with passion,\n          m.o.s. and he listens while nodding his head.\n\n          \n\n                                POPPA M V.O.\n                    Then it began.\n\n          \n          Over dialogue and music we see the following images...\n\n          \n          Noah cuts out a chalk sketch on a large sheet of shoe leather.\n\n          \n          Louie helps Noah make a \"serious looking\" leather vest.\n\n          \n          Louie hobbles in with a sack.   He dumps a bevy of handguns on a\n          table. All different makes.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    Louie would pick the marks and plan\n                    everything in detail.\n\n          \n          Louie draws a map on a note pad and speaks m.o.s.\n\n          \n\n                                                                       97.\n\n          \n\n          \n          Holsters and bullet belts are sewn into the vest.\n\n          \n          Noah loads the vest with guns as Louie tightens the buckles, stands\n          back and looks Noah over. Ominous.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    And I would go in and do the jobs.\n\n          \n          A mob boss and two body guards wait for an elevator. The doors\n          open. Insides is Noah, dark jacket, English Mac (hat). He opens\n          his coat, revealing the vest. He draws two weapons, executes them\n          all and calmly hits a button. The doors close.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    I would execute, over and over again,\n                    those who had taken my father from me.\n\n          \n          We do a montage of Noah killing Mafiosi in many different ways.\n\n          \n\n                                POPPA M V.O. (CONT'D)\n                    So it went for years.\n\n          \n\n          EXT. BACK TO PRESENT, KITCHEN -- LATER\n\n\n          \n          We pan to the gaping mouthed brothers.\n\n          \n\n                                  MURPHY\n                    Jesus.\n\n          \n\n                                CONNOR\n                    So...how'd ya end up inside, Da?\n\n          \n\n                                POPPA M\n                    Back in '75, I did a hit, came out and\n                    the police were waitin' for me. He set\n                    me up, 25 to life.\n\n                                MURPHY\n                    Wait...why did he set you up?\n\n          \n\n                                POPPA M\n                    Can't wait ta ask him.\n\n          \n\n                                CONNOR\n                    Why didn't ya flip on him? Cut down\n                    yer time? The guy fucked ya.\n\n          \n\n                                  POPPA M\n                    I couldn't.\n\n          \n\n                                CONNOR\n                    Why the hell not?\n\n          \n\n                                                                          98.\n\n          \n\n          \n\n          INT. FLASHBACK, PRISON PHONE VISITING AREA -- NIGHT\n\n\n          \n          A picture of a woman with two babies is slammed to the glass.\n\n          \n\n          EXT. BACK TO PRESENT, KITCHEN -- MOMENTS LATER\n\n\n          \n\n                                  POPPA M\n                      He'd learned of the birth of my sons.\n\n          \n          Connor and Murphy hang their heads.      Connor looks up.\n\n          \n\n                                  CONNOR\n                      Do you know Louie's full name?\n\n          \n\n                                  POPPA M\n                      Aye.\n\n          \n          The boys look at each other.\n\n          \n\n          EXT. SIDE WALK OUTSIDE MCGINTY'S -- SAME TIME\n\n\n          \n          Greenly's bagged body is about to be loaded into an ambulance.\n          Eunice stops the EMTs, unzips it and touches his face. She weeps\n          and then crushes into Dolly's chest.\n\n          \n          He holds her and cries too as Duffy watches in anguish. Eunice's\n          cell rings. She ignores it and Dolly pulls it from her pocket and\n          tosses it to Duffy, never letting go of Eunice.\n\n          \n\n                                  DUFFY\n                      Hello.\n\n          \n          Alternating coverage.\n\n          \n\n                                   CONNOR\n                      It's me.   Put Eunice on.\n          Connor hands the phone to Poppa M.      DISSOLVE TO...\n\n          \n\n          INT. POLICE STATION -- LATER\n\n\n          \n          Eyes still red from crying, Eunice covertly works at a computer.\n          She types. Soon a picture of the Roman comes on up. Eunice looks\n          at his face with trepidation and then...\n\n          \n\n                                  EUNICE\n                      I hope they do it slow...you piece of\n                      shit.\n\n          \n\n          INT. ILLEGAL BOOK -- LATER\n\n\n          \n          CLOSE ON:   An old time phone being carried to a rear table.\n\n          \n\n                                                                           99.\n\n          \n\n          \n          We drift by a poker game and young Italian thugs, betting horses and\n          sports. T.V.s and smoke are abundant.\n\n          \n          The phone is set on a back table. PATRONAZZI (75yrs), an ancient\n          Italian man drinking espresso picks up.\n\n          \n\n                                  PATRONAZZI\n                    Si.\n\n          \n          It's the Old Man.    In Italian, alternating coverage...\n\n          \n\n                                OLD MAN\n                    Hello, old friend.\n\n          \n\n                                  PATRONAZZI\n                    Many years.    Are you in need?\n\n          \n\n                                OLD MAN\n                    Yes. I am making marinara and alas, I\n                    have run out of tomatoes. To help an\n                    old friend...how many can you spare?\n\n          \n          Patronazzi looks up.    Slowly, many of the young thugs turn.\n\n          \n\n                                PATRONAZZI\n                    I am in good supply of tomatoes.\n\n          \n\n          INT. UNCLE CESAR'S HOUSE, LIVING ROOM -- NIGHT\n\n\n          \n          The boys slumber. We push in on their staggered profiles.       They\n          simultaneously take a deep breath. FLASH TO WHITE...\n\n          \n\n          INT. DREAM SEQUENCE, FENWAY PARK -- DAY\n\n\n          \n          The boys stand in a huge cement access corridor of Fenway Park.        It\n          is empty and quiet as a church. A man walks toward them. They\n          struggle to see. Presently, we reveal ROCCO. He passes them.\n\n          \n\n                                   ROCCO\n                    Come on.     The game's starting.\n\n          \n          The brothers follow him.    Red Sox emblems are abundant.\n\n          \n\n                                ROCCO (CONT'D)\n                    Funny thing about the Red Sox. We\n                    never gave up hope, y'know? It's what\n                    kept us going all those years. And\n                    they did it. They finally fuckin' did\n                    it. What are we all gonna do now, huh?\n\n          \n          They emerge into the stands.    Perfect baseball field, empty park.\n\n          \n\n                                                                       100.\n\n          \n\n          \n\n                                ROCCO (CONT'D)\n                    I lost a lot of money on 'em. But I\n                    gotta admit. Always felt\n                    better...betting the underdogs.\n\n          \n          Rocco walks on.   The boys follow.\n\n          \n\n          EXT. BASEBALL DIAMOND -- MOMENTS LATER\n\n\n          \n          The boys stand on the mound.   Rocco walks a circle around it.\n\n          \n\n                                ROCCO\n                    So, how's things going?\n\n          \n          The boys drop their heads.\n\n          \n\n                                ROCCO (CONT'D)\n                    Yeah. I know. It's rough having your\n                    faith shaken.\n\n          \n          The brothers have a pained expression.\n\n          \n\n                                ROCCO (CONT'D)\n                    But it happens to all of us.\n\n                             (BEAT)\n                    You know what's always tripped me out?\n                    How hundreds of years ago, a bunch of\n                    desperate gamblers in leaky ass ships,\n                    crossed the ocean blue. They had no\n                    clue what was on the other side of it.\n                    Took real balls. But they sailed into\n                    infinity and made it all the way to the\n                    shores of the New fucking World...\n                             (re: surroundings)\n                    ...and all they had was their faith.\n                    I'm always surprised how so many people\n                    miss the simple fact that faith...is\n                    the reason all of us are even here.\n                    You can't underestimate the power of\n                    it. Shit, you were the ones that\n                    taught me that.\n\n          \n          Rocco looks to his left and right.   Secretly.\n\n          \n\n                                ROCCO (CONT'D)\n                    Listen, your my boys so I'm gonna give\n                    you some inside. The Sox are gonna do\n                    it again this year. The line in Vegas\n                    is huge. Put everything you got on it.\n\n          \n          The boys look to each other.   Eyes wide.\n\n          \n\n                                                                       101.\n\n          \n\n          \n\n                                MURPHY\n                    Maybe we should.\n\n          \n\n                                CONNOR\n                    You're sure, Roc? You know this?\n\n          \n          Rocco smiles.\n\n          \n\n                                  ROCCO\n                    No...I   just have faith. And for a\n                    second   there, you almost did too.\n                    Y'see,   it's contagious. And if enough\n                    people   catch it...look out, baby.\n\n          \n          A roaring cheer arises, shaking the very foundations of the arena.\n          The boys turn in awe. The stands are still empty.\n\n          \n\n          INT. LIVING ROOM -- LATER\n\n\n          \n          They jolt awake and look to each other.\n\n          \n\n                                CONNOR\n                    While the wicked stand confounded...\n\n          \n\n                                MURPHY\n                    ...call me with Thy Saints surrounded.\n\n          \n\n          EXT. BOSTON COMMONS, JOGGING TUNNEL -- MORNING\n\n\n          \n          Poppa M stands before Eunice.   She hands him an envelope.\n\n          \n\n                                EUNICE\n                    He lives in York Maine. About 30\n                    minutes from here. Better go quick. I\n                    logged on to an FBI database to get the\n                    info. Homeland Security does internal\n                    monitoring now. Only a matter of time\n                    before they flag it.\n\n          \n\n                                POPPA M\n                    Will they know it's you?\n                             (she nods)\n                    Will you be all right, dear?\n\n          \n\n                                EUNICE\n                    I hear Costa Rica's nice.\n\n          \n          She looks at him as her eyes well up with tears.\n\n          \n\n                                EUNICE (CONT'D)\n                    I never thought I'd ask this of another\n                    human being but please...kill this man.\n\n          \n\n                                                                        102.\n\n          \n\n          \n          She is overcome and weeps.   Poppa M holds her.\n\n          \n\n                                POPPA M\n                    It ends taday.\n\n          \n\n          INT. FBI HEAD QUARTERS, BOSTON BRANCH, KITCHENETTE -- LATER\n\n\n          \n          Kuntsler pours a coffee. G-man #2 comes in holding a piece of paper.\n\n          \n\n                                KUNTSLER\n                    Anybody word from Bloom, yet?\n\n          \n\n                               G-MAN #2\n                    Nothing.\n\n          \n\n                                KUNTSLER\n                    I want that little Bayou Bitch in here.\n                    Something stinks about this whole\n                    thing.\n\n          \n\n                                G-MAN #2\n                    I'm having D.H.S. dump her IP and check\n                    for flags. See if she's been poking\n                    around.\n\n          \n\n          INT. TRINITY CHURCH -- LATER\n\n\n          \n          Poppa M, the brothers and Romeo walk kneel at the altar before a\n          memorial to McKinney: Candles, pictures, cards, flowers etc.\n\n          \n          As they pray, a dozen or so church patrons who are in the pews begin\n          to realize who they are. Our foursome stands and walks back down\n          the aisle. They make eye contact with a few people.\n\n          \n          When the Saints are gone, the churchgoers gather in the aisle and\n          stare at the front door in disbelief. Excited whisperings. One guy\n          opens his cell phone. Then he thinks...and closes it.\n\n          \n\n          INT. FBI HEAD QUARTERS -- MOMENTS LATER\n\n\n          \n          G-man #2 excitedly gives Kuntsler a file.   His eyes widen.\n\n          \n\n          INT. INTERROGATION ROOM -- MOMENTS LATER\n\n\n          \n          Kuntsler slaps the file down in front of Jimmy who is cuffed to a\n          metal table. He looks at a picture of the Roman. Fear.\n\n          \n\n          INT. SUV -- MOMENTS LATER\n\n\n          \n          Kuntsler and his men speed along sirens blaring.    Into walkie...\n\n          \n\n                                                                      103.\n\n          \n\n          \n\n                                KUNTSLER\n                    This is S.A.I.C., Jonathan Buford\n                    Kuntsler! Security code A4153B! I\n                    need an immediate R2 law enforcement\n                    override clearance!\n\n          \n\n                                FEDERAL OPERATOR V.O.\n                    What is your specific request, Agent?\n\n          \n\n                                KUNTSLER\n                    Everyone in the tri-state area with a\n                    gun!\n\n          \n\n          INT. DEAD END STREET -- SAME TIME\n\n\n          \n          The Roman's common, two story home looms in the b.g. at the end of a\n          cul-de-sac. Walking down the middle of the street, is Poppa M:\n          black trench, hat, dark shades. He opens the door and enters the...\n\n          \n\n          INT. COMMON HOME -- CONTINUOUS\n\n\n          \n          Poppa M listens, far off scratchy music. He moves quietly through\n          the house, stopping at the foot of the stairs...listens. He removes\n          his rosary, hangs it on the banister and moves on, pulling a weapon.\n\n          \n\n          INT. GREENHOUSE -- SAME TIME\n\n\n          \n          The Roman, swirls a tomato in a plate of salt and bites into it.\n          Beside him, a horned phonograph plays 40's Jazz. Behind him, we see\n          that the greenhouse is merely an extension of the home.\n\n          \n          The Roman sits in front of a sunken fire pit at a low flame. Across\n          the pit, an empty chair. Extended before him is a stunning garden,\n          standing in stark contrast to the common house: vines, flowers,\n          cobblestone walks, fountains. The center piece is a Turkish pool\n          with pure white Lillys afloat.\n          Poppa M slowly approaches the Roman from behind. He holsters his\n          weapon and sits. The Roman halts the phonograph.\n\n          \n\n                                POPPA M\n                    Hello, Louie.\n\n          \n\n                               ROMAN\n                    Noah.\n\n          \n          Long pause.\n\n          \n\n                                POPPA M\n                    We haven't much time.\n\n          \n          The Roman smiles and gestures the surroundings.\n\n          \n\n                                                                        104.\n\n          \n\n          \n\n                                ROMAN\n                    My garden. She is beautiful, yes?     Ah,\n                    but you. You are blind to beauty.     You\n                    are a destroyer, Noah.\n\n          \n\n                                POPPA M\n                    You know my reasons.   You know why I\n                    did what I did.\n\n          \n\n                                ROMAN\n                    But do you? You think it was for your\n                    father? No. You were born a killer.\n                    Death...is in the very blood that runs\n                    through your veins.\n\n          \n\n                                POPPA M\n                    No.\n\n          \n\n                                ROMAN\n                    Then explain this.\n\n          \n          The Roman flicks a photo over. It lands in Poppa M's lap.    It is\n          the picture we saw earlier. A woman holding two babies.\n\n          \n\n                                ROMAN (CONT'D)\n                    You were not there to raise them. Not\n                    a single day. Yet, how closely they\n                    follow in the footsteps of their\n                    father. They have inherited your\n                    blood, Noah...your anger.\n\n          \n          Poppa M looks at the photo deeply.\n\n          \n\n          EXT. BEHIND GREENHOUSE -- SAME TIME\n\n\n          \n          Outside, back wall of greenhouse.    THUGs 1-5 from Patronazzi, hunker\n          down here. They are all armed.\n\n          \n\n                                THUG #1\n                             (whispered into walkie)\n                    Remember, not a scratch on the Old Man.\n\n          \n\n          INT. PARLOR, UPSTAIRS -- SAME TIME\n\n\n          \n          We look out the bay windows. It is a straight shot down the slanted\n          roof to the roof of the greenhouse. THUGS 6-8 stand quietly inside.\n\n          \n\n                                 THUG #6\n                    Got it.   Wait for the signal.\n\n          \n\n                                                                        105.\n\n          \n\n          \n\n          INT. HOUSE -- MOMENTS LATER\n\n\n          \n          A gloved hand grabs up Poppa M's rosary.    Connor pockets it as he\n          and Murphy silently climb the stairs.\n\n          \n\n          INT. / EXT. VARIOUS LOCATIONS -- SAME TIME\n\n\n          \n          S.W.A.T. teams load into vans.   Squad cars speed through traffic.\n\n          \n\n          INT. GREENHOUSE -- MOMENTS LATER\n\n\n          \n          Poppa M tosses the picture into the fire.\n\n          \n\n                                 POPPA M\n                    And you?   What are you?\n\n          \n          The Roman denotes his garden.\n\n          \n\n                                ROMAN\n                    I am a creator. You see? Our very\n                    natures stood in opposition as old as\n                    the story of the scorpion and the frog.\n\n          \n\n                                POPPA M\n                    Why...did you sell me out, Louie?\n\n          \n\n                                ROMAN\n                    You can never understand.\n\n          \n\n                                POPPA M\n                    25 years....try me.\n\n          \n\n                                ROMAN\n                    I wanted to join with them. They were\n                    building an empire. Creating something\n                    and I was helping them! I used you,\n                    Noah, to eliminate their problems, to\n                    destroy their competition, to cut out\n                    their cancers. I earned my place among\n                    them.\n\n          \n          Poppa M looks around.\n\n          \n\n                                POPPA M\n                    Is this your place among them? Because\n                    all I see is a an old man, sitting in a\n                    garden.\n\n          \n\n                                ROMAN\n                    Alas, the scorpion and the frog both\n                    lost everything, yes? I should have\n                    paid more attention to the story.\n\n                                (MORE)\n\n          \n\n                                                                         106.\n\n                                ROMAN (CONT'D)\n                    Without you...I was no longer useful to\n                    them. They cast me out!\n\n          \n\n          INT. SUV -- MOMENTS LATER\n\n\n          \n          Kuntsler barks into a walkie...\n\n          \n\n                                KUNTSLER\n                    The location is to be surrounded and\n                    secured upon arrival! Nobody goes in!\n\n          \n          He suddenly looks out his window to the sky.    In the distance, two\n          other copters fly in the same direction.\n\n          \n\n                                KUNTSLER (CONT'D)\n                    Are those fucking news choppers?!\n\n          \n\n          INT. GREENHOUSE -- MOMENTS LATER\n\n\n          \n\n                                POPPA M\n                    Why the priest, Louie?     Why all this?\n                    Why, now?\n\n          \n\n                                ROMAN\n                    Because I knew it would bring you and\n                    your sons. You would destroy the\n                    Yakavettas and clear my way. This\n                    time, I will take what is rightfully\n                    mine. Just a little piece, for my old\n                    age. After all, I have never been a\n                    greedy man.\n\n          \n          The Roman puts the needle back on the record.    Jazz plays.\n\n          \n\n          INT. PARLOR, UPSTAIRS -- SAME TIME\n\n\n          \n\n                                 THUG #6\n                    That's it!   Move!\n\n          \n          Another Thug opens the bay windows.    Thundering music!\n\n          \n\n          INT. NEIGHBORING ROOM -- SAME TIME\n\n\n          \n          BIRD'S EYE VIEW: Looking down on Connor and Murphy.    They rapid\n          fire their huge .50 cals through the wall.\n\n          \n\n          INT. PARLOR -- SAME TIME\n\n\n          \n          SLO-MO: The heavy rounds blast through the wall and massacre the\n          three Thugs as they are about to exit.\n\n          \n\n          INT. BACK OF GREENHOUSE -- SAME TIME\n\n\n          \n          All following visuals in slo-mo with slamming music...\n\n          \n\n                                                                       107.\n\n          \n\n          \n          Poppa \"M\" stands, throwing open his trench and revealing his leather\n          vest, a six gun rig in the front. The Roman in awe.\n\n          \n          The double doors crash in and men barrel through as Poppa M turns,\n          pulls two weapons and fires upon them, hitting one.\n\n          \n          The boys crash through the glass ceiling of the greenhouse on either\n          side of Poppa M. They fire as they fall, hit the ground and roll.\n\n          \n          Romeo bursts into the fray from inside the house, blasting away with\n          his gold .45's, a shotgun hanging on his back.\n\n          \n          The garden is being torn apart as the brothers, Poppa M and Romeo\n          hit their marks and the hit squad returns fire. The boys dive\n          behind fountains which are then pulverized.\n\n          \n          The gun battle rages around the Roman who remains seated in the very\n          mouth of madness. His heart breaks as his sanctuary is shredded.\n\n          \n          Romeo fires as a large rack of wine behind him is torn apart.\n\n          \n          Murphy fires over a statue and bodies crash into the pool.\n\n          \n          Connor stands, firing in a Jesus Christ pose.\n\n          \n          Poppa M drops his empty weapons and pulls two more, laying down a\n          second barrage.\n\n          \n          Romeo is simultaneously hit in the leg and shoulder. He falls,\n          dropping his .45s. He struggles to fire the shotgun.\n\n          \n          Poppa M takes one in the chest.\n\n          \n          Connor is wounded in the shoulder but continues firing.\n\n          \n          Murphy is hit in the leg but continues firing.\n          The boys and Romeo manage to take out the last of the Thugs, who are\n          blasted into the Turkish pool. It is over. The music fades...\n\n          \n\n          EXT. FRONT OF HOME -- MOMENTS LATER\n\n\n          \n          Squad cars screech to a halt as the chopper lands behind them.\n          Kuntsler exits, shouting orders. Many officers level over their\n          hoods as S.W.A.T. piles out and moves toward.\n\n          \n\n          INT. GREENHOUSE -- MOMENTS LATER\n\n\n          \n          The Roman looks around, tears in his eyes.   The boys hobble to their\n          failing father who is on his knees.\n\n          \n\n                               CONNOR AND MURPHY\n                    Da?\n\n          \n\n                                                                        108.\n\n          \n\n          \n\n                                   POPPA M\n                     Boys.    Help me up.\n\n          \n          They get him to his feet. Poppa M turns to the Roman. He levels a\n          revolver toward the seated man. With his last bit of strength...\n\n          \n\n                                 POPPA M (CONT'D)\n                     I'll see you in a minute, Louie.\n\n          \n          Poppa M fires one right between the Roman's eyes.    Poppa M crumbles.\n          His sons lay him down.\n\n          \n\n                                 CONNOR\n                     Oh, no, no, no.\n\n          \n          Poppa M smiles as he looks up at the sun through the blown out glass\n          ceiling. A plume of butterflies escape.\n\n          \n\n                                 POPPA M\n                     It's a beautiful day.\n\n          \n\n                                   MURPHY\n                     Aye.    It is...it is, Da.\n\n          \n          He dies. The brothers weep. Nearby, Romeo is slumped and bleeding,\n          on the edge of consciousness. A strange calm comes over the\n          brothers as they stand and look to one another.\n\n          \n          S.W.A.T. can be heard surrounding the perimeter. The boys look to\n          Romeo. He smiles at them and nods. The brothers turn and walk into\n          the house. The echoed voice of Poppa M.\n\n          \n\n                                 POPPA M V.O.\n                     And shepherds we shall be...\n\n          \n\n          EXT. STREET -- MOMENTS LATER\n\n          Cops level over their squads.      Media descends.\n\n          \n\n                                 POPPA M V.O.\n                     ...for Thee, my Lord, for Thee...\n\n          \n\n          INT. HOUSE -- MOMENTS LATER\n\n\n          \n          SLO-MO:   the boys move toward the front door.\n\n          \n\n                                 POPPA M V.O.\n                     Power hath descended forth from Thy\n                     hand...\n\n          \n\n                                                                          109.\n\n          \n\n          \n\n          INT. VARIOUS LOCATIONS -- SAME TIME\n\n\n          \n          We cut to people around the country glued to their t.v.s      Crowds\n          hush in bars, airports, stores.\n\n          \n\n                                  POPPA M V.O.\n                      ...that our feet may swiftly carry out\n                      thy command...\n\n          \n\n          EXT. FRONT OF HOUSE -- MOMENTS LATER\n\n\n          \n          The door opens and the boys walk out, guns down.\n\n          \n\n                                  POPPA M V.O.\n                      So, we shall flow a river forth to\n                      Thee...\n\n          \n\n          INT. GREENHOUSE -- MOMENTS LATER\n\n\n          \n          Romeo raises a weak hand as S.W.A.T. moves cautiously through a\n          battle field of dead bodies.\n\n          \n\n                                  POPPA M V.O.\n                      ...and teeming with souls shall it ever\n                      be...\n\n          \n\n          EXT. FRONT LAWN -- MOMENTS LATER\n\n\n          \n          SLO-MO: The boys stop in the middle of the lawn and look out over\n          the massive presence. A policeman yells in his bullhorn, m.o.s.\n\n          \n          SLO-MO, CLOSE ON:    The brothers' guns fall to the grass.\n\n          \n\n                                  POPPA M V.O.\n                      In Nomini Patri...\n          SLO-MO:    The brothers drop to their knees.\n\n          \n\n                                  CONNOR\n                      ...e fili...\n\n          \n          SLO-MO:    The brothers put their hands behind their heads.\n\n          \n\n                                  MURPHY\n                      ...e Spiritu Sancti.\n\n          \n          DIP TO BLACK.    The music fades...\n\n          \n          SUBTEXT:    \"Seven days Later\"\n\n          \n\n          INT. / EXT. NEWS FOOTAGE\n\n\n          \n\n          STATIC!    CHANNEL CHANGE!\n\n          \n\n                                                                       110.\n\n          \n\n          \n          Crowds flood a cemetery.    Poppa M's casket is lowered...\n\n          \n\n                                   REPORTER #2\n                       ...hundreds took off work today to say\n                       good bye to the man Boston is calling\n                       simply, \"The Father.\"\n\n          \n\n          STATIC!   CHANNEL CHANGE!\n\n          \n          News desk.    Insert of Romeo.\n\n          \n\n                                   SALLY MCBRIDE\n                       ...still in a coma. The condition of\n                       Romeo Mata, the young Hispanic American\n                       allegedly operating with the Saints\n                       remains critical.\n\n          \n\n          STATIC!   CHANNEL CHANGE!\n\n          \n          Outside Eunice's home.\n\n          \n\n                                   REPORTER #2\n                       ...the search continues for missing\n                       Special Agent Eunice Bloom. As of yet,\n                       law enforcement has turned up nothing\n                       but have not ruled out foul play.\n\n          \n\n          STATIC!   CHANNEL CHANGE!\n\n          \n          New footage of the aftermath at the Roman's home.\n\n          \n\n                                   REPORTER #3\n                       The young men, who's names Police are\n                       not releasing to the public have yet to\n                       utter a word since their capture. Even\n                       to their court appointed attorneys.\n\n          STATIC!   CHANNEL CHANGE!\n\n          \n          A mob of protesters chant, \"Set them free.\"\n\n          \n\n          INT. T.V. TALK SHOW, \"BOSTON BANTER\" -- DAY\n\n\n          \n          Five guests, BALLPLAYER, COMEDIAN, ACTOR, POLITICIAN and a HOST are\n          seated in the midst of an \"audience in the round.\" The format is\n          similar to \"Politically Incorrect.\"\n\n          \n\n                                   BALLPLAYER\n                       It doesn't change anything. What they\n                       did is still more important. It's\n                       still the issue.\n\n          \n\n                                                                       111.\n\n          \n\n          \n\n                                COMEDIAN\n                    They deserve medals.\n\n          \n\n                                POLITICIAN\n                    They deserve the death penalty.\n\n          \n          Arguments erupt.\n\n          \n\n          INT. PRISON HOSPITAL -- DAY\n\n\n          \n          The arguments are heard as the boys awaken in their hospital beds at\n          the same moment.\n\n          \n\n                                PRIEST V.O.\n                    Only God can judge!\n\n          \n\n                                ACTOR V.O.\n                    Oh, save it for group, father!\n\n          \n          They are bandaged and hooked to machinery.\n\n          \n\n                                BALLPLAYER\n                    Well, I know this! They certainly\n                    don't belong in prison.\n\n          \n          The boys turn and look out the windows at a group of cons in the\n          yard, staring up at them.\n\n          \n\n                                HOST V.O.\n                    Oh, I don't know.\n\n          \n          Connor and Murphy's faces split with evil grins.   They mimic guns at\n          the cons and gesture as if shooting them.\n\n          \n\n                                HOST V.O. (CONT'D)\n                    Maybe that's just the place for them.\n\n          FADE TO BLACK...\n\n\n\n\n\n\nBoondock Saints 2: All Saints Day\nWriters :   Troy Duffy\nGenres :   Action  Crime  Drama  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:26.501422"}