{"title": "Bounty Hunter, The", "film_link": "/Movie Scripts/Bounty Hunter, The Script.html", "script_link": "/scripts/Bounty-Hunter,-The.html", "info_raw": "\n\nBounty Hunter, The Script\n\n\n\n\nIMSDb opinion  Ehh, the colored shirt was pretty funny.\nIMSDb rating   (6 out of 10)\nAverage user rating   (6.67 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Sarah Thorp\nGenres  Action  Comedy  Crime  Romance\nScript Date : September 2007\nMovie Release Date : March 2010\n\nRead \"Bounty Hunter, The\" Script\n\n\n", "script": "\n\n\n\n                            THE BOUNTY HUNTER\n\n\n\n                                Written by\n          \n                               Sarah Thorp\n          \n          \n          \n          \n\n                                                        Sept 28, 2007\n\n                                                          First Draft\n\n\n          EXT JERSEY CITY- DAY\n          \n          Dec 21st. Clear sky, snow on the ground. Cold as fuck. With\n          the sounds of laughter and music, we MOVE IN ON:\n          \n          \n          INT NEWSPAPER OFFICE- DAY\n          \n          An office Xmas party in progress, not a pretty sight: tipsy\n          receptionists laugh and spill drinks on the rug, red-faced\n          reporters loosen their belts and burp cocktail weiners...\n          \n          MOVING QUICKLY THROUGH THE PARTY TO AN OPEN OFFICE DOOR.\n          Arriving just in time for the door to SLAM in our face.\n          \n          \n          INT OFFICE- DAY\n          \n          A woman stomps back over to her desk and picks up her pen.\n          MEET CASSIDY DALEY (dirty blond, striking, manic energy). Ink-\n          stained fingers, notepads in every pocket: Cass doesn't have\n          time for office parties, she's working.\n          \n          Her door cracks open and STEWART (almost as good looking as\n          he thinks he is) appears, holding a Kahlua bottle.\n          \n                              CASS\n                    I'm working, Stewart.\n          \n                              STEWART\n                    Come on, take a break. (enticing)\n                    I've got Kahlua...\n          \n          Cass picks up a stapler and LAUNCHES it at Stewart's head.\n          Stewart DUCKS OUT just in time. The phone rings. Answering:\n          \n                              CASS\n                    Cassidy Daley. Talk to me.\n          \n                              JIMMY (O.S.)\n                    It's Jimmy. Tell me you love me.\n          \n                              CASS\n                    Depends on what you got.\n          \n                              JIMMY (O.S.)\n                    I've got a confirmed place and\n                    time.\n          \n          Cass is on her feet, excited.\n          \n                              CASS\n                    I love you! So, when? Where?\n          \n                                                                   2.\n          \n          \n                              JIMMY (O.S.)\n                    You think I'm gonna say this shit\n                    over the phone? I could get killed.\n                    Just meet me at the usual place.\n                    Oh, and Cass? This one's gonna cost\n                    an extra hundred.\n          \n          CLICK. He hangs up. Cass drops the phone, grabs her stuff.\n          \n          \n          INT NEWSPAPER OFFICE- DAY\n          \n          Cass races for the elevator, Stewart hot on her heels:\n          \n                              STEWART\n                    Where ya going?\n          \n                              CASS\n                    Hooters. I go there for the hot\n                    wings.\n          \n                              STEWART\n                    Please. Nobody goes there for the\n                    hot wings. You got a tip.\n          \n                              CASS\n                    You got a hundred bucks on you?\n          \n          Stewart considers this, then hands her 5 20's.\n          \n                              STEWART\n                    Now are you gonna let me in on it?\n          \n                               CASS\n                    Sorry. No can do. I have to protect\n                    my source.\n          \n                              STEWART\n                    You know what? We need to talk\n                    about our relationship.\n          \n                              CASS\n                    We don't have a relationship. We\n                    made out 3 years ago in the copy\n                    room. I was drunk. I was broken-\n                    hearted. I would have made out with\n                    the xerox machine.\n          \n                              STEWART\n                    Yes, but you made out with me.\n          \n                              CASS\n                    I have to go.\n          \n                                                                   3.\n          \n          \n          She exits. He shouts after her:\n          \n                              STEWART\n                    I want in on that story!\n          \n          \n          EXT STREET/JERSEY CITY- DAY\n          \n          Cass driving like a maniac, doing the one thing she loves:\n          TRACKING A STORY...\n          \n          \n          EXT DUNKING DONUTS PARKING LOT- DAY\n          \n          MOVING IN ON- A BEAT-UP HONDA CIVIC (JIMMY'S CAR) IN THE BACK\n          CORNER OF THE LOT...\n          \n          INT JIMMY'S CAR- DAY\n          \n          JIMMY (20's, goatee, Mets baseball hat, nervous) sits in his\n          car, rolling a cigarette while he waits for Cass.\n          \n          Jimmy puts the cigarette in his mouth and pulls out a\n          lighter. Just as he flips the lighter open, HIS FRONT\n          WINDSHIELD EXPLODES. A MAN HOLDING A TIRE IRON (MAHLER,\n          heavyset, crew-cut, rarely speaks, all business) reaches\n          through the broken window, AND DRAGS JIMMY OUT OF THE CAR...\n          \n          \n          EXT DUNKING DONUTS PARKING LOT- DAY\n          \n          Cass drives into the lot and pulls up next to Jimmy's car.\n          \n                              CASS\n                    Hey, Jimmy, I...\n          \n          She realizes he is not in the car. THEN SHE SEES THE BROKEN\n          GLASS ALL OVER THE DRIVER'S SEAT.\n          \n                                 CASS\n                    Jimmy?\n          \n          SCREECHING TIRES behind her. Cass glances up and sees JIMMY'S\n          BASEBALL HAT IN THE BACK WINDOW OF A GREY CHEVY. The Chevy is\n          racing out into traffic. Cass throws her car into reverse...\n          \n          \n          INT CASS' CAR- DAY\n          \n          Cass tries to follow the grey Chevy, but GETS STUCK AT A RED\n          LIGHT. Shit. She looks around, decides fuck it, and HITS THE\n          GAS. Her car leaps into the intersection. SIRENS.\n          \n                                                                   4.\n          \n          \n          Cass looks into her rearview mirror: A PATROL CAR IS RIGHT\n          BEHIND HER, signalling for her to pull over. Up ahead, the\n          Chevy is getting away.\n          \n          Cass debates: pull over? Or follow the story? No contest. SHE\n          SLAMS ON THE GAS AND HER CAR SURGES OUT OF FRAME...\n          \n          \n          EXT STREET- DAY\n          \n          Cass' car SPEEDS down the street, A COP CAR IN CLOSE\n          PURSUIT...\n          \n          \n          INT CASS' CAR- DAY\n          \n          Cass is losing sight of the Chevy. She races around traffic\n          and is suddenly HEADED STRAIGHT FOR THE SIDE OF A MOVING VAN.\n          She panics, WRENCHING the wheel to the right...\n          \n          \n          EXT STREET- DAY\n          \n          CASS' CAR JUMPS THE CURB, CROSSES A LAWN, AND SKIDS TO A HALT\n          ON THE FRONT STEPS OF A CHURCH. THE COP CAR RACES UP AND\n          BLOCKS HER IN.\n          \n          \n          EXT CHURCH- MOMENTS LATER\n          \n          Cass is out of her car now, arguing with a cop who has her by\n          the arm:\n          \n                              CASS\n                    Let go of me, I'm a reporter, I'm\n                    warning you...\n          \n          The cop pulls her towards his squad car. Cass leans over and\n          SINKS HER TEETH INTO THE COP'S HAND. The cop screams.\n          \n          FREEZE FRAME.\n          \n          CHIRON: \"24 HOURS LATER\"\n          \n          CLOSE ON- A NEWSPAPER COLUMN WITH CASS' PHOTO: windswept\n          hair, head tilted coyly, smile that says \"I'm on top of the\n          world. Beneath the photo, the byline: \"CASSIDY DALEY\".\n          \n          Someone whistles \"We Wish You a Merry Xmas\" as a MARKER\n          improves on the photo: MOUSTACHE, BUCK-TEETH, PIMPLES. Then a\n          MATCH enters frame, and SETS THE PHOTO ON FIRE.\n          \n                               VOICE\n                    Milo!\n          \n                                                                     5.\n          \n          \n          PULL BACK TO REVEAL:\n          \n          INT CRYSTAL'S BAR/JERSEY CITY- LATE AFTERNOON\n          \n          Holding the flaming photo, MEET MILO: rumpled shirt, messy\n          hair, looks like he slept on the floor. The bartender\n          (CRYSTAL, 50's, Eastern European) scowls at him:\n          \n                              CRYSTAL\n                    What did I say about the fires?\n          \n                              MILO\n                    You said \"please set fires in my\n                    bar\". Wait, no, that's not right.\n                    \"Please don't set fires in my bar\".\n                    (off her look) Ok, jeez, you try to\n                    get in the holiday spirit...\n          \n          He drops the flaming photo to the floor, pours his drink on\n          it, then GRINDS IT TO PIECES WITH HIS SHOE.\n          \n                              CRYSTAL\n                    Shouldn't you be working?\n          \n                              MILO\n                    That's the beauty of my job,\n                    Crystal. Tracking down idiots is\n                    something you can do pretty much\n                    anywhere. See, there's one...\n          \n          He points to A DRUNK DRAPED OVER THE JUKEBOX, MOURNFULLY\n          SINGING ALONG TO CHRISTINA AQUILLERA'S \"I AM BEAUTIFUL\".\n          \n                              MILO\n                    And there's another one...\n          \n          Pointing to A WOMAN TRYING TO RIP A PAY PHONE FROM THE WALL.\n          \n                              MILO\n                    And there's...\n          \n          Glances at the TV, which is showing LIVE FOOTAGE OF AN XMAS\n          PARADE. Looks closer, recognizes someone, groans:\n          \n                              MILO\n                    I don't believe it. That idiot. (to\n                    Crystal) Save my seat.\n          \n          Tosses back his drink and SPLITS.\n          \n                                                                      6.\n          \n          \n          EXT CRYSTAL'S BAR- LATE AFTERNOON\n          \n          Milo climbs into a Cadillac: dents, patches of rust, cracked\n          windshield, bumper askew.\n          \n          RACK TO: half a block away, A DARK SEDAN IDLES AT THE CURB.\n          \n          \n          INT DARK SEDAN- LATE AFTERNOON\n          \n          The man behind the wheel (DWIGHT, large, babyfaced, Metallica\n          t-shirt) eats a hoagie as he watches Milo get into his car.\n          \n                              DWIGHT\n                    There you are, you dipshit.\n          \n          He takes a last bite then tosses the sandwich and pulls away\n          from the curb, tailing the Cadillac.\n          \n          \n          EXT JERSEY CITY- LATE AFTERNOON\n          \n          MOVE IN ON- the parade we just saw on TV. Baton twirlers in\n          Santa Hats. Men dressed like reindeer, pulling a sleigh. A\n          boys choir singing \"Joy to the World\", the kids dressed like\n          orphans that escaped a Broadway musical.\n          \n          A beautiful scene, if you like that sort of thing.\n          \n          RACK TO- the Cadillac, half a block away, cruising sideways\n          into a spot just beneath a \"TEMPORARY TOW-AWAY\" sign. MILO\n          climbs out of the car. Shoves his way through the crowd to\n          the curb, cracking open a can of Pabst.\n          \n          Milo does not like this sort of thing. He scans the crowd\n          impatiently.\n          \n          Meanwhile, THE CAR THAT WAS FOLLOWING HIM parks half a block\n          away. DWIGHT emerges and heads for:\n          \n          MILO, who has just found what he's looking for. The reindeer\n          are passing him and he makes eye contact with RUDOLPH, who\n          does a double-take.\n          \n                              MILO\n                    Yeah, you. Rudolph. Come here, you\n                    fucking ding-dong.\n          \n          Milo takes a step towards Rudolph and DWIGHT APPEARS IN\n          MILO'S PATH, BLOCKING HIM.\n          \n                              DWIGHT\n                    We have to stop meeting this way.\n          \n                                                                      7.\n          \n          \n                              MILO\n                    Not now, Dwight.\n          \n                              DWIGHT\n                    You owe my boss money.\n          \n                              MILO\n                        (LAUGHING)\n                    Hey, I owe everybody money.\n          \n          Suddenly, DWIGHT PUNCHES MILO IN THE GUT. Milo doubles-up,\n          gasping, then BRINGS HIS HEAD UP QUICK, CATCHING DWIGHT ON\n          THE CHIN. Dwight goes flying sideways and MEETS A POLICE\n          BARRIER FACE-FIRST. Ouch.\n          \n          The barrier tips over, knocking over the one next to it. THE\n          REST GO LIKE DOMINOS. Milo turns to see that RUDOLPH HAS\n          DISAPPEARED. Then he catches sight of the ANTLERS, working\n          their way through the crowd. Milo lunges after him and\n          Rudolph drags other reindeer with him as he tries to avoid\n          Milo. THE SLEIGH FLIPS. Santa tumbles from the sled. PACKAGES\n          RAIN DOWN ON REINDEER LIKE SHRAPNEL.\n          \n          All of a sudden, IT'S THE XMAS FROM HELL: BLOODY REINDEER\n          STUMBLING AROUND, SANTA UNCONSCIOUS IN THE GUTTER, KIDS\n          SCREAMING, PARENTS PANICKING. Meanwhile, MILO IS GAINING ON\n          RUDOLPH, who picks up one of the packages and throws it. IT\n          CRACKS MILO IN THE HEAD. Just what Milo has been waiting for:\n          \n                              MILO\n                        (BEAMING)\n                    I am so happy you did that.\n          \n          Milo TACKLES RUDOLPH TO THE GROUND. Around them, people\n          scream and scatter. One boy bursts into tears:\n          \n                              BOY\n                    That man is killing Rudolph!\n          \n          SIRENS. Uh-oh. Cops SWARM the scene, surrounding Milo and\n          Rudolph, GUNS DRAWN. The LEAD COP (GELMAN, short, over-\n          zealous) steps forward:\n          \n                              GELMAN\n                    Release the reindeer!\n          \n          Release the reindeer? Milo looks around. He's got 8 or so\n          guns pointed his way and Rudolph gasping at his feet. MILO\n          STARTS TO LAUGH. Gelman bristles:\n          \n                              GELMAN\n                    Hands behind your head, asshole!\n          \n                                                                     8.\n          \n          \n                              MILO\n                    Take it easy, skippy, I'm just\n                    doing my job.\n          \n          Milo flashes his ID. Gelman inspects it, rolls his eyes.\n          \n                              GELMAN\n                    Bounty hunter. Figures. Why don't\n                    you get a real job?\n          \n                              MILO\n                    So I can be like you patrol boys\n                    and sit around all day with my\n                    thumb up my ass?\n          \n          Gelman turns bright red.\n          \n                              GELMAN\n                    What did you just say?\n          \n          Suddenly, a sergeant (BOBBY, late 30's, obnoxious but\n          likeable, Milo's ex-partner) marches onto the scene, takes\n          one look at Milo and laughs.\n          \n                              BOBBY\n                    Milo Boyd. I shoulda known.\n          \n                              GELMAN\n                    Sarg, you know this asshole?\n          \n                              BOBBY\n                    Yeah. I know this asshole. Guy used\n                    to be one of us.\n          \n          RACK TO- DWIGHT, NOSE BLEEDING, MELTING BACK INTO SHADOW...\n          \n          \n          EXT STREET- MOMENTS LATER\n          \n          Milo drags Rudolph through the crowd towards his car. Bobby\n          follows, shaking his head, bemused expression on his face.\n          \n                              BOBBY\n                    Look, Milo, I know this is a tough\n                    time of year for you...\n          \n                              MILO\n                    This isn't a tough time of year for\n                    me. It's Christmas. Who doesn't\n                    love Christmas?\n          \n                              BOBBY\n                    ...and I try to be sensitive to\n                    your situation...\n          \n                                                                    9.\n          \n          \n                              MILO\n                    What situation? Being a man who\n                    works his own hours and has his\n                    freedom and lives the high life?\n          \n                              BOBBY\n                    ...because I realize you're\n                    unhappy.\n          \n                              MILO\n                    Unhappy? Are you kidding me, Bob?\n                    Look at me: I'm the happiest man\n                    alive.\n          \n          Just then, they come to where Milo left his car. IT'S GONE.\n          Bobby squints at the huge \"TOW-AWAY\" sign:\n          \n                              BOBBY\n                    That sign is pretty hard to see.\n          \n          And with that, Milo loses it:\n          \n                              MILO\n                    AAAHHH!\n          \n          He rips the sign off the pole. Stomps on it. Kicks it. Tries\n          to shred it with his teeth. Hmm. He doesn't really seem like\n          the happiest man alive. Rudolph, to Bobby:\n          \n                              RUDOLPH\n                    Take me to jail. Please?\n          \n          \n          INT BOBBY'S CAR- EARLY EVENING\n          \n          Bobby's car is decorated with photos of his many children,\n          all of whom look exactly like him, even the girls, poor kids.\n          \n          Milo's in front by Bobby, Rudolph's handcuffed in the back.\n          \n                              BOBBY\n                    Ok, I got one for ya: why doesn't\n                    Santa have any children? Cause he\n                    only comes once a year and when he\n                    does, it's down a chimney.\n          \n          Rudolph snickers. Milo does not. Bobby glances at Milo.\n          \n                              BOBBY\n                    So. Have you talked to her lately?\n          \n                              MILO\n                    Talked to who?\n          \n                                                                  10.\n          \n          \n                               BOBBY\n                    Katie Couric, motherfucker, who do\n                    you think?\n          \n                              MILO\n                    I haven't talked to her in three\n                    years, why would I talk to her now?\n          \n                              BOBBY\n                    Well, for one thing, so you can\n                    stop taking out your rage on\n                    innocent bystanders.\n          \n                              RUDOLPH\n                        (piping up from the back)\n                    Talk to her, man. For real.\n          \n          Milo reaches back, gags Rudolph with his own scarf.\n          \n                              BOBBY\n                    Do what you want. But this kind of\n                    shit will eat a hole in your\n                    intestines, you don't deal with it.\n          \n          \n          EXT POLICE STATION/JERSEY CITY- EARLY EVENING\n          \n          They pull up. Milo exits the car, pulls Rudolph from the\n          back. Bobby leans out.\n          \n                              BOBBY\n                    Hey, why don't you come by the\n                    precinct tomorrow for our Xmas\n                    bash?\n          \n                              MILO\n                    I'm not invited. I'm not a cop\n                    anymore, remember?\n          \n                              BOBBY\n                    Fuck that, I'm inviting you.\n          \n                              MILO\n                    I don't know, Bob. I'm sorta busy.\n          \n                              BOBBY\n                    That's what I'm worried about.\n                    (sighing) Just...take it easy, Ok?\n          \n          Bobby really seems worried, but Milo waves him off. Bobby\n          drives over, parks by other cop cars. Gets out, mingles with\n          some cops. Laughter, inside jokes. Milo watches from afar.\n          \n                                                                   11.\n          \n          \n                              RUDOLPH\n                    You should go to that party, man.\n                    Seriously. You need it.\n          \n                              MILO\n                    Do I look like I need advice from a\n                    grown man in antlers?\n          \n          Milo gags Rudolph and drags him into the station.\n          \n          FADE TO BLACK. OVER BLACK:\n          \n                              VOICE\n                    Milo. Hey. Princess...\n          \n          INT SID'S BAIL BONDS/JERSEY CITY- MORNING\n          \n          Hazy pieces: a tilting clock on the wall. A battered metal\n          desk. Filing cabinets, spitting up papers. A man, SID (wound\n          sorta tight, Milo's best friend) peers down at us:\n          \n                              SID\n                    You're drooling on my sofa.\n          \n          Milo unsticks his face from the leather couch, wobbles\n          upright. Are the walls throbbing, or is it just him?\n          \n                              SID\n                    You do have an apartment, don't\n                    you? With a bed of some kind?\n          \n          Milo grunts. Sid hands him a coffee.\n          \n                              SID\n                    Heard you shut down 5th Street\n                    yesterday. Gave every kid in the\n                    county the gift of nightmares.\n          \n                              MILO\n                    Hey, I'm a giving kind of guy.\n                    Anyway, what do you care? I brought\n                    your guy in, right?\n          \n          Milo holds out his hand, palm up. Sid COUNTS MONEY INTO HIS\n          PALM.\n          \n          \n          EXT SID'S BAIL BONDS/JERSEY CITY- MORNING\n          \n          Swearing under his breath, Sid is trying to stuff a Xmas tree\n          into the back of a station wagon. At least half of the tree\n          is hanging out of the back. Milo drinks a beer and watches.\n          \n                                                                 12.\n          \n          \n                              SID\n                    You gonna give me a hand, or just\n                    stand there killing your liver?\n          \n                              MILO\n                    Is that a trick question?\n          \n          Sid glares at him. Milo sighs, puts down his beer, and grabs\n          part of the tree.\n          \n                              SID\n                    So I told her, fine, I'd handle\n                    Xmas this year. I mean, what's to\n                    handle? You buy a tree, some gifts,\n                    cook a ham, hang some lights. An\n                    idiot could do it.\n          \n                              MILO\n                    Well, we'll soon find out.\n          \n          Sid checks him out.\n          \n                              SID\n                    You have plans for the holiday?\n          \n                                 MILO\n                    The usual.\n          \n                              SID\n                    Gonna drink some cheap whiskey and\n                    put your fist through a wall?\n          \n                                 MILO\n                    Jealous?\n          \n          The tree is definitely not going to fit. They let it go, and\n          Sid pulls out a small hand saw.\n          \n                              SID\n                    Then forget it.\n          \n                              MILO\n                    Forget what?\n          \n                              SID\n                    I've got an open bond, but your\n                    thing sounds like more fun. I'll\n                    give it to Doug instead.\n          \n          Sid starts hacking away at the tree.\n          \n                                                                 13.\n          \n          \n                              MILO\n                    Whoa. Hold up, Heidi. What the\n                    fuck. I want the job, I'm in the\n                    hole.\n          \n                              SID\n                    You're always in the hole.\n          \n                              MILO\n                    What's your point?\n          \n                              SID\n                        (SIGHING)\n                    The truth is, I'm not sure you're\n                    the right person for this job. It\n                    could be a total disaster. On the\n                    other hand, when one friend sees\n                    another friend stagnating in his\n                    own filth, he has to do something,\n                    right?\n          \n                              MILO\n                    Hey. I just woke up. I was gonna\n                    shower.\n          \n          Sid drops the saw. With one final shove, the tree is in.\n          Phew. Sid slams the back shut.\n          \n                              SID\n                    Ok. But remember: you asked for it.\n          \n          He reaches into his pocket and extracts A FOLDED PIECE OF\n          PAPER. Hands it to Milo. Milo unfolds it, gives it a quick\n          look. A second look. A third.\n          \n          TIME STOPS. THE WHOLE STREET GOES SILENT.\n          \n                              MILO\n                    No.\n          \n                              SID\n                    Yes.\n          \n                              MILO\n                    No.\n          \n                              SID\n                    Yes.\n          \n                              MILO\n                    No.\n          \n                              SID\n                    Are we done yet?\n          \n                                                          14.\n          \n          \n                              MILO\n                    Is this a joke? Because if it is,\n                    I'm gonna have to kill you.\n          \n                              SID\n                    It's not a joke.\n          \n                              MILO\n                    She got arrested? And then she\n                    jumped bail?\n          \n                              SID\n                    Apparently the whole thing started\n                    with some reckless driving, and\n                    ended with her assaulting a police\n                    officer.\n          \n          Milo gives him a questioning look.\n          \n                              SID\n                        (EXPLAINING)\n                    She bit him.\n          \n          Milo snorts.\n          \n                              MILO\n                    Yeah. That sounds like her.\n                    But here's my question: why the\n                    hell did you post her bail?\n          \n                              SID\n                    Hey, I know she dumped you...\n          \n                              MILO\n                    Whoa. She did not \"dump me\".\n          \n                              SID\n                        (QUICKLY)\n                    Ok, whatever, I...\n          \n                              MILO\n                    No, not \"whatever\". I dumped her.\n          \n                              SID\n                    The point is, I'm aware you guys\n                    have issues, but I'm running a\n                    business here. A person needs bail,\n                    I don't have time to check with you\n                    first.\n          \n                              MILO\n                    Well, had you checked with me\n                    first, you wouldn't be out of a\n                    bond right now.\n          \n                                                                   15.\n          \n          \n                              SID\n                    I'm not out of a bond if you go\n                    pick her up. It's five grand to\n                    bring her back by 9am, Xmas day.\n          \n                              MILO\n                        (SLOWLY)\n                    You're telling me it's five grand\n                    to go pick up my ex-wife and bring\n                    her to jail. (beat) On Xmas.\n          \n                              SID\n                    You're a good listener.\n          \n          Milo takes a deep, calming breath. Then he EXPLODES into\n          whoops and hollers. He throws himself into a snow bank and\n          thrashes around. He does a Fred Astaire around a lamp post.\n          \n                              SID\n                    I take it you're interested.\n          \n          Milo grabs Sid and pulls him into a crushing bear hug.\n          \n                              MILO\n                    I love you! You're the best friend\n                    a guy could ever have!\n          \n                              SID\n                    Ok, take it easy...\n          \n          TERESA (mid 40's, overly made-up, popping gum) pokes her head\n          out the front door:\n          \n                              TERESA\n                    Sid, you got a DUI on line one.\n                    (off their looks) What's going on?\n          \n          Milo drops Sid, grabs Teresa, and gives HER A LONG, INTENSE\n          KISS. He releases her. She stumbles back a bit.\n          \n                              TERESA\n                    Ok. (beat) Can I have my gum back?\n          \n                              MILO\n                    Right. Sorry.\n          \n          He reaches into his mouth, extracts her gum and hands it to\n          her. She retreats back inside. Milo beams at Sid.\n          \n                              MILO\n                    You know what this is, don't you?\n                    Karma! Payback! You know how they\n                    say \"What goes around comes\n                    around\"? Turns out it's true!\n                              (MORE)\n          \n                                                                    16.\n                              MILO (cont'd)\n                    (checking the paper) That middle\n                    initial stands for Rhonda, by the\n                    way. She tells people it stands for\n                    \"Rachel\", but that's a lie.\n          \n          Sid shakes his head.\n          \n                              SID\n                    I can't believe you guys broke up\n                    over a stupid article.\n          \n                              MILO\n                    We didn't break up over a stupid\n                    article. We broke up because she is\n                    a cheating, manipulative liar.\n          \n                              SID\n                    Are you sure you can handle this?\n          \n                              MILO\n                    Why wouldn't I be able to handle\n                    this?\n          \n                              SID\n                    Let's face it: you're not exactly\n                    rational around her. I mean, if I\n                    was a cop working a case and some\n                    reporter came snooping around, I'd\n                    say \"no comment\". Not \"no comment,\n                    but care for a cocktail\"? And then\n                    a month later, running off to some\n                    love shack called \"Caveman's Cabin\"\n                    and tying the knot? Who does that?\n          \n                              MILO\n                    That's not even close to what\n                    happened. For one thing, it was\n                    called \"Cupid's Cabin\". And for\n                    another, that was before I knew how\n                    conniving she was. Now I know. So\n                    all I have to do is track her down,\n                    cuff her up, and bring her in.\n                    (checking his watch) And I've got,\n                    what, two days? Shit, man. Easy as\n                    pie.\n          \n          Famous last words. Sid is regretting his decision as he\n          watches Milo go dancing down the street...\n          \n          CHRIRON: \"DEC 23RD. 9:00AM. 48 HOURS TO GO.\"\n          \n          With the sound of multiple ringing phones, cut to:\n          \n                                                                    17.\n          \n          \n          INT WAREHOUSE/ATLANTIC CITY- DAY\n          \n          QUICK TRACKING SHOT OF LORRAINE (50's, bleached blond, built\n          like a trucker), as she talks on the phone and paces the\n          room, giving us glimpses of a major illegal bookie operation:\n          TV screens everywhere, a huge blackboard posting odds, men on\n          computers, several heavily armed private security guards...\n          \n                               LORRAINE\n                         (into phone)\n                     You tell him I know where he lives.\n                     I know where his bimbo wife takes\n                     her yoga classes, I know where his\n                     idiot son shoplifts after school,\n                     so he can pay me my money or...\n          \n          She comes to a sudden stop at:\n          \n                               LORRAINE\n                     What the hell happened to you?\n          \n          REVEAL DWIGHT, the guy who tried to collect from Milo,\n          SPORTING TWO BLACK EYES AND A BROKEN NOSE.\n          \n                               DWIGHT\n                     Milo Boyd. Fucker head-butted me.\n          \n                               LORRAINE\n                         (not interested)\n                     Yeah? Did you get the money?\n          \n          He did not. Lorraine scowls. \"LUCK BE A LADY\" KICKS IN:\n          \n          \n          EXT- DAY\n          \n          Milo gets his car out of impound.\n          \n          \n          INT BARBERSHOP- DAY\n          \n          Milo gets a cut and a shave.\n          \n          \n          EXT BARBERSHOP- DAY\n          \n          Milo gets his shoes shined.\n          \n          \n          INT MILO'S APT- DAY\n          \n          A freshly showered and shaved Milo packs for the job, singing\n          at the top of his lungs:\n          \n                                                                    18.\n          \n          \n                              MILO\n                    Luck be a lady...\n          \n          He puts an empty duffle on the bed and starts filling it:\n          MACE, PEPPER SPRAY, TASER GUN, HANDCUFFS...\n          \n                              MILO\n                    Toooo....NIIIIIGHT!\n          \n          He stares at his collection and smiles:\n          \n                              MILO\n                        (to his weapons)\n                    I told you this day would come.\n          \n          Milo zips up the bag.\n          \n          \n          EXT MILO'S APT- DAY\n          \n          Milo tosses the duffle in the backseat. He pulls out the job\n          sheet and inspects it. CASS' CELL PHONE NUMBER IS LISTED.\n          Pulls out his cell phone, then hesitates. He glances around\n          and sees a PAY PHONE ACROSS THE WAY.\n          \n          Pockets his cell phone and crosses to the pay phone.\n          \n          \n          EXT STREET- DAY\n          \n          CASS, expensive leather jacket, boots, dark glasses, trying\n          to be incognito. Hurrying towards her car when she sees SOME\n          COPS EXIT A DINER up ahead. She slips into a doorway, waiting\n          for them to pass, when her phone rings.\n          \n          She checks it (\"PAY PHONE\") and answers:\n          \n                                CASS\n                    Jimmy?\n          \n          SPLIT-SCREEN\n          \n          Nope, NOT JIMMY. Milo doesn't speak. Cass listens for a\n          moment. She can hear breathing. What the fuck? An evil grin\n          crosses Milo's face. Cass goes pale.\n          \n          Milo takes a step forward. Cass takes a step back. Milo\n          LUNGES and CASS DROPS HER PHONE AND BOLTS OUT OF FRAME.\n          \n          \n          EXT PAY PHONE- DAY\n          \n          Milo smirks at the receiver.\n          \n                                                                   19.\n          \n          \n                              MILO\n                    You better run, you crazy bitch.\n          \n          \n          INT SID'S BAIL BOND'S- DAY\n          \n          Sid shuts his door, then speaks into his phone, low:\n          \n                              SID\n                    Yeah. He took the job. But if this\n                    thing goes bad, I'm blaming you.\n          \n          He hangs up.\n          \n          \n          EXT STREET- DAY\n          \n          Milo sips from a coffee cup and watches:\n          \n          MILO'S POV- THE FRONT DOOR OF A FANCY BROWNSTONE. A woman\n          with a toy poodle emerges from the building, struggling with\n          the heavy door..\n          \n          \n          EXT BROWNSTONE- DAY\n          \n          Milo appears next to the woman and holds the door for her:\n          \n                              MILO\n                    Nice dog. Very compact.\n          \n          The woman exits and Milo enters.\n          \n          CLOSE ON- PANNING SHOT PAST DOORS: 301, 302, 303...\n          \n          INT APT HALLWAY- DAY\n          \n          Milo stops in front of 303, and knocks on the door.\n          \n                                 MILO\n                    Candygram.\n          \n          No answer. Milo glances around, then works the lock...\n          \n          \n          INT APARTMENT/LIVING-ROOM- CONTINUOUS\n          \n          Milo slips inside, pulling the door shut behind him. It's\n          dark and quiet. He glides through the room, scoping it out.\n          The place is huge, white rug and couch, flat screen TV.\n          \n          And lining the bookshelves are FRAMED ARTICLES, AWARDS,\n          PHOTOS OF CASS WITH VARIOUS PUBLIC FIGURES: the home of a\n          successful and dedicated journalist.\n          \n                                                                    20.\n          \n          \n          Milo is halfway across the room when he realizes he has left\n          a set of MUDDY PRINTS across the formerly pristine white rug.\n          \n                              MILO\n                    Whoops.\n          \n          \n          EXT APARTMENT/BACK DOOR- DAY\n          \n          Cass enters frame. Nervous looks all around as she tries the\n          knob. Surprise: THE DOOR SWINGS OPEN. She hesitates.\n          \n          \n          INT APARTMENT/LIVING-ROOM- DAY\n          \n          NOW THERE ARE FOOTPRINTS CRISS-CROSSING THE FLOOR, RUNNING UP\n          OVER THE COUCH, ETC. Looks like Milo had a little field day\n          here. He is taking a closer look at the shelves: no photos of\n          a boyfriend, family, pets: IT'S ALL WORK.\n          \n          He picks up one of the framed articles with the headline\n          \"LOCAL REPORTER WINS AWARD FOR BREAKING UP 13TH STREET DRUG\n          RING\". There's a photo of CASS SHAKING HANDS WITH THE AN\n          IMPORTANT-LOOKING OFFICIAL.\n          \n          Milo's face clouds over.\n          \n          \n          INT APARTMENT/KITCHEN- SIMULTANEOUS\n          \n          Cass slips inside and the door swings shut behind her with a\n          soft CLICK.\n          \n          \n          INT APARTMENT/LIVING-ROOM- DAY\n          \n          Milo's head whips around. SOMEONE'S IN THE KITCHEN. Big grin\n          as he replaces the frame and draws his gun. A couple careful\n          steps across the room and a floorboard CREAKS.\n          \n          \n          INT APARTMENT/KITCHEN- SIMULTANEOUS\n          \n          Cass startles. SOMEONE'S IN THE LIVING-ROOM. Grabs a heavy\n          saucepan off the stove. Grips it like a weapon, soft-foots it\n          towards the hallway...\n          \n          \n          INT APARTMENT/LIVING-ROOM- DAY\n          \n          Milo reaches the hallway entrance. Positions himself up\n          against the wall, waiting...\n          \n                                                                    21.\n          \n          \n          INT APARTMENT/HALLWAY- SIMULTANEOUS\n          \n          Cass tiptoes down the hallway, saucepan at the ready...\n          \n          \n          INT APARTMENT/LIVING-ROOM- DAY\n          \n          Milo holds his breath. A SHADOWY FIGURE STEPS INTO THE ROOM.\n          Milo puts his gun to their head:\n          \n                              MILO\n                    `Allo, love.\n          \n          RACK TO- THE PERSON'S FACE. IT'S NOT CASS, IT'S STEWART.\n          \n          \n          INT APARTMENT/HALLWAY- SIMULTANEOUS\n          \n          Cass takes a breath and LUNGES...\n          \n          \n          INT APARTMENT/LIVING-ROOM- DAY\n          \n          ...SWINGING THE PAN, SCREAMING LIKE A BANSHEE:\n          \n                              CASS\n                    HIIIII-YAAAA!!!\n          \n          THE PAN CONNECTS SOLIDLY WITH A CAT. Cat goes flying, bounces\n          off wall, lands on the coffee table, fangs bared.\n          \n                              CASS\n                    Whoops.\n          \n          So, if we didn't know already: CASS AND MILO ARE IN DIFFERENT\n          APARTMENTS.\n          \n          \n          INT CASS' APARTMENT/LIVING-ROOM- DAY\n          \n          Stewart is trying to explain himself to a skeptical Milo:\n          \n                              STEWART\n                        (poor liar)\n                    ...so, I heard a noise in here and\n                    became concerned...\n          \n                              MILO\n                    Wrong. Try again.\n          \n                              STEWART\n                    Ok, the truth is she asked me to\n                    pick up her dry-cleaning...\n          \n                                                                 22.\n          \n          \n          Milo just waits.\n          \n                              STEWART\n                        (CRACKING)\n                    Ok, Ok, look, she's working a big\n                    story that was supposed to be mine,\n                    and I want it back.\n          \n          Milo considers this.\n          \n                              MILO\n                    You sleeping with her, Stu?\n          \n                              STEWART\n                        (turning red)\n                    You mean, like, at this moment?\n          \n                              MILO\n                    Yeah, that's what I mean. Are you\n                    sleeping with her at this very\n                    moment?\n          \n                              STEWART\n                    We have a history, yes.\n          \n                              MILO\n                    A \"history\", huh? (snorting) Good\n                    luck with that.\n          \n          \n          INT JIMMY'S APARTMENT/LIVING-ROOM- DAY\n          \n          Cass tries to coax the terrified cat out from under the sofa:\n          \n                              CASS\n                    Here, kitty kitty...\n          \n          Suddenly the LANDLADY (as wide as she is tall) pops her head\n          in the door, startling Cass:\n          \n                                 CASS\n                    Aahh!\n          \n                              LANDLADY\n                    You're not Jimmy.\n          \n                              CASS\n                        (recovering quickly)\n                    Oh. No. I'm looking for him.\n          \n                              LANDLADY\n                    Under the sofa?\n          \n                                                          23.\n          \n          \n                              CASS\n                    Maybe you can help. I'm his\n                    girlfriend.\n          \n                              LANDLADY\n                        (SKEPTICAL)\n                    You're LaKeesha?\n          \n          Oh. Whoops.\n          \n                              CASS\n                    Yes. That's my name. LaKeesha.\n          \n                              LANDLADY\n                    Maybe I should call the cops.\n          \n                              CASS\n                    Wait! Ok, look: Jimmy's in trouble.\n          \n                              LANDLADY\n                    What kind of trouble? Money\n                    trouble? Drug trouble? (lower) Sex-\n                    change trouble?\n          \n          \"Sex-change trouble\"?\n          \n                              CASS\n                    Something like that. All I know is,\n                    he's missing.\n          \n                              LANDLADY\n                    I've had a lousy week, too. My\n                    cousin Linda fell off a cruise\n                    ship.\n          \n                              CASS\n                    Oh. I'm sorry.\n          \n                              LANDLADY\n                    Hey. A grown woman outta know how\n                    to swim.\n          \n                              CASS\n                    I hear ya. Anyway. Mind if I take a\n                    quick look around?\n          \n          The landlady thinks this over.\n          \n                              LANDLADY\n                    Jimmy's behind on his rent. I bet\n                    his girlfriend would want to take\n                    care of that.\n          \n          ON CASS- Dammit.\n          \n                                                                  24.\n          \n          \n                              CASS\n                    I bet she would.\n          \n          \n          INT CASS' APARTMENT/LIVING-ROOM- DAY\n          \n          Milo explains, as he pokes around:\n          \n                              MILO\n                    The thing is, Stu, she'll make you\n                    think she's interested in you, when\n                    really all she's interested in is\n                    the case you're working on, because\n                    she wants to launch her big hot-\n                    shot career.\n          \n          It is just dawning on Stewart:\n          \n                              STEWART\n                    Wait a second: you're Milo. She\n                    talks about you all the time.\n          \n                              MILO\n                        (immediately interested)\n                    Really?\n          \n                              STEWART\n                    Oh yeah, dude. She hates you.\n          \n          Milo turns an angry red.\n          \n                              MILO\n                    Oh, she hates me?\n          \n                              STEWART\n                    Yeah. She says you're the most\n                    selfish, immature, stubborn...\n          \n                              MILO\n                        (INTERRUPTING)\n                    I'm selfish? I'm immature? You know\n                    what? Forget it. I'm not even gonna\n                    dignify this with...whatever.\n          \n                              STEWART\n                    Hey, man, I'm on your team.\n          \n                              MILO\n                    No you're not, Geraldo. I don't\n                    allow reporters on my team.\n          \n          Milo tosses some papers around on her desk furiously.\n          \n                                                                   25.\n          \n          \n                              MILO\n                    And for the record: I'm the one who\n                    hates her. Just so that's clear.\n          \n          He picks up the phone and checks the last dialed number: it\n          comes up \"CAESAR'S CASINO\". Milo smiles.\n          \n                              MILO\n                        (to himself)\n                    That figures. Run home to mommy.\n          \n          Milo erases the number, then heads for the door.\n          \n                              MILO\n                    Well, nice meeting ya, Stu.\n          \n                              STEWART\n                    Wait, where are you going?\n          \n                              MILO\n                    I'm going to pick up your\n                    girlfriend. But don't worry, if she\n                    ever gets out of jail, I'm sure\n                    you'll be very happy together.\n          \n          Milo exits. Stewart hurries to the phone and checks it, but\n          Milo erased the number. Shit. Stewart RACES to the window.\n          \n          STEWART'S POV: MILO EXITING THE BUILDING, HEADED FOR HIS CAR.\n          \n          \n          INT JIMMY'S APARTMENT- DAY\n          \n          Cass is about to give up when she spots, peeking out from the\n          bookshelf, A PLAIN ENVELOPE MARKED \"CASSIDY DALEY\". She slips\n          the envelope into her pocket just as the landlady appears:\n          \n                              LANDLADY\n                    Time's up. Find anything?\n          \n                              CASS\n                    Nope. Not a thing.\n          \n                              LANDLADY\n                    Oh, well. Don't worry, hon. He\n                    probably just went away for the\n                    holidays.\n          \n          \n          EXT ATLANTIC CITY- DAY\n          \n          The sun sparkles off the casino windows. It looks fun.\n          Exciting. A great place for the holidays.\n          \n                                                                  26.\n          \n          \n          SUDDENLY, THE WHOLE SCENE TURNS UPSIDE-DOWN, AND A MAN STARTS\n          TO SCREAM...\n          \n          \n          EXT TRUMP CASINO HOTEL ROOM- DAY\n          \n          IT'S JIMMY, being dangled off a 25th floor balcony by Mahler,\n          who barely breaks a sweat.\n          \n                              JIMMY\n                        (PANICKING)\n                    Ok, ok, I told one person about the\n                    Xmas Eve job, but she doesn't even\n                    have all the details, I swear!\n          \n          Mahler lets go of one of Jimmy's feet. Now Jimmy is hanging\n          by one ankle. He starts to scream again.\n          \n                              MAHLER\n                    Gimme a name.\n          \n          \n          INT CADILLAC/JERSEY CITY- DAY\n          \n          Milo gets in, on the phone with Sid:\n          \n                              MILO\n                    ...and this loser she's dating\n                    looks like he buys his clothes from\n                    Kmart.\n          \n          \n          SPLIT-SCREEN:\n          \n          Sid is at home, trying to get the hacked up Xmas tree to\n          stand up straight. His 5 and 6 year old sons beat on each\n          other in the background.\n          \n                              SID\n                    Why do you care?\n          \n                              MILO\n                    I don't. I just think it's funny.\n          \n                              SID\n                    Hilarious. Listen to me: you guys\n                    made a terrible couple.\n          \n                              MILO\n                    I know that. You don't have to tell\n                    me that.\n          \n                                                                 27.\n          \n          \n                              SID\n                    Relationships aren't about\n                    competition, they're about\n                    compromise.\n          \n                              MILO\n                    You mean like when your wife wants\n                    to do one thing, and you want to do\n                    another, and you compromise by\n                    doing what she wants?\n          \n                              SID\n                    Exactly. Now just get her here.\n                    Cause I can't afford to lose this\n                    bond.\n          \n                              MILO\n                    No worries. In fact, I already know\n                    where she is and I'm gonna go pick\n                    her up right now.\n          \n          \n          EXT CADILLAC- DAY\n          \n          The cadillac pulls away from the curb.\n          \n          RACK TO- A SKY-BLUE HYUNDAI, STEWART CROUCHED AT THE WHEEL.\n          Stewart pulls into traffic, FOLLOWING THE CADILLAC.\n          \n          \n          EXT HIGHWAY- AFTERNOON\n          \n          The Cadillac on route to Atlantic City, the Hyundai not far\n          behind.\n          \n                              VOICE\n                    Milo Boyd. Ex-cop, current bounty\n                    hunter...\n          \n          \n          INT WAREHOUSE/ATLANTIC CITY- AFTERNOON\n          \n          RAY (small, wiry, slightly demented-looking) reads from his\n          laptop while Lorraine paces behind him, swinging a golf club.\n          \n                              RAY\n                    ...lives in Jersey City, drives a\n                    68 Caddy. Been in the hole on and\n                    off with us the past 3 years. We\n                    checked his place, his hangouts, no\n                    luck.\n          \n                                                                   28.\n          \n          \n                              LORRAINE\n                    This is no good. We let this guy\n                    slide, suddenly everybody thinks,\n                    hey, it's the holidays! All debts\n                    are cancelled! Get the word out, I\n                    want this guy brought here so he\n                    can pay what he owes us, Dwight can\n                    break something of his, and we can\n                    all enjoy our Xmas.\n          \n          Ray nods and picks up the phone.\n          \n          PUSH THOUGH THE WINDOW, ACROSS THE CITY, AND DOWN TO:\n          \n          EXT CAESAR'S CASINO PARKING LOT- AFTERNOON\n          \n          A HALF MILE AWAY AT CAESAR'S, Milo is pulling into the\n          crowded parking lot.\n          \n          CHIRON: \"1:00PM. ATLANTIC CITY. 44 HOURS TO GO.\"\n          \n          Milo exits his car and heads inside. STEWART, feeling super\n          sly, pulls up to a space near Milo's car, but another car\n          slips into the spot.\n          \n                              STEWART\n                    That's my space, you asshole!\n          \n          \n          EXT CAESAR'S CASINO DRESSING ROOM- AFTERNOON\n          \n          Milo knocks on the door. A woman in heavy makeup (LOIS, Cass'\n          mother) opens the door, takes one look at Milo, SLAMS the\n          door shut. Milo waits. After a moment, Lois opens it again.\n          \n                              MILO\n                    Happy to see you, too.\n          \n                              LOIS\n                    How dare you...after what you did\n                    to my baby...\n          \n          Lois bursts into tears and collapses into Milo's arms.\n          \n                              MILO\n                    Ok. What say we do this inside?\n          \n          \n          INT CAESAR'S CASINO DRESSING ROOM- MOMENTS LATER\n          \n          Men running around in gowns and feather boas. A completely\n          recovered Lois sits by a make-up mirror, adjusting a wig.\n          Stuck to her mirror is a PHOTO OF MILO AND CASS, ARMS AROUND\n          EACH OTHER, SMILING. Milo gives the photo a dirty look.\n          \n                                                                 29.\n          \n          \n                              MILO\n                    What happened to the pirate show?\n          \n                              LOIS\n                    I got sick of it. Now I'm a female\n                    impersonator.\n          \n                              MILO\n                    But...you are female.\n          \n                              LOIS\n                    That's why I'm so good at it. Help\n                    me with this.\n          \n          She stands and wiggles into an evening gown. Milo struggles\n          with the zipper.\n          \n                              MILO\n                    Where is she, Lois? I need to talk\n                    to her.\n          \n                              LOIS\n                    Oh, Milo, where did it all go\n                    wrong? Do you have any idea what it\n                    means to waste a woman's child-\n                    bearing years? It's criminal. Every\n                    month her eggs are jumping out of\n                    her ovaries like sailors abandoning\n                    a sinking ship. I mean, I know you\n                    were mad about that article...\n          \n                              MILO\n                    I wasn't mad about that article. In\n                    fact: what article?\n          \n                              LOIS\n                    Listen to me, Milo: Cassidy may be\n                    a strong independent woman on the\n                    outside, but on the inside she's\n                    just a girl who wants to be\n                    protected and loved by her man.\n                    What happened between the two of\n                    you devastated her.\n          \n                              MILO\n                    Devastated her right to the top.\n          \n                              LOIS\n                        (BEAMING)\n                    She has done well, hasn't she?\n                              (MORE)\n          \n                                                                  30.\n                              LOIS (cont'd)\n                    I must admit, it makes me proud to\n                    think that my little girl, whose\n                    only friend growing up was an\n                    imaginary orphan with a tin leg\n                    named Leslie, now gets invited to\n                    tour the White House...\n          \n          Milo's jaw hits the floor.\n          \n                              MILO\n                    She got to tour the White House?\n          \n          Now he really wants to take Cass to jail.\n          \n                              MILO\n                    Tell me where she is, Lois.\n          \n                              LOIS\n                    Oh, who knows. She was running\n                    around like a chicken with its head\n                    cut off, said she was on the\n                    biggest story of her career. Said\n                    she was going somewhere to think.\n          \n          Milo thinks this over, then a grin breaks out on his face.\n          \n          \n          EXT CAESAR'S CASINO PARKING LOT- AFTERNOON\n          \n          Stewart has finally found a parking space, and is exiting his\n          car when he sees Milo come out and jump into the Cadillac.\n          \n                              STEWART\n                    Dammit.\n          \n          Stewart hurries back into his car.\n          \n          \n          EXT ATLANTIC CITY RACETRACK- AFTERNOON\n          \n          Stands mobbed with people, horses galloping down the track,\n          dust rising in their wake. MOVING IN ON...\n          \n          \n          EXT STANDS- AFTERNOON\n          \n          Surrounded by people cheering, CASS IS HARD AT WORK. Notebook\n          open, phone to ear, lap holding the plain envelope, ripped\n          open, contents exposed: A PIECE OF PAPER THAT SAYS: \"ATLANTIC\n          CITY. XMAS EVE. SPARROW.\"\n          \n          She has underlined \"Sparrow\" and made a list: \"Person's name?\n          Company? Hotel? Casino?\"\n          \n                                                                   31.\n          \n          \n                              CASS\n                        (into phone)\n                    No one with that name? What about a\n                    casino? Nothing? Thanks.\n          \n          She clicks over to an incoming call, \"PRIVATE CALLER\":\n          \n                              CASS\n                    Jimmy?\n          \n          \n          SPLIT-SCREEN:\n          \n          STEWART, at the mobbed track entrance, lost and frustrated:\n          \n                              STEWART\n                    No, who's Jimmy?\n          \n                              CASS\n                    Look, Stewart, I'm busy.\n          \n                              STEWART\n                    Ok. (casually) Where are you, by\n                    the way? I mean, exactly.\n          \n                              CASS\n                    I'm in Miami, if you must know. I'm\n                    on the beach building a sand castle\n                    and drinking from a coconut...\n          \n          Someone taps her shoulder. She glances up and sees: MILO,\n          SITTING RIGHT NEXT TO HER, GRINNING. She slowly closes her\n          phone, not bothering to say goodbye.\n          \n                              MILO\n                    Hello, Cass.\n          \n                              CASS\n                    Hello, Milo.\n          \n          A MILLION DIFFERENT EMOTIONS CROSS CASS' FACE. Surprise,\n          anger, anxiousness. All the mixed emotions you have when you\n          suddenly run into THE MAN WHO BROKE YOUR HEART.\n          \n                              MILO\n                    Fancy meeting you here.\n          \n                              CASS\n                    Yeah. Fancy that.\n          \n          Strange, charged moment as they look at each other. Then they\n          have a casual contest:\n          \n                                                               32.\n          \n          \n                              MILO\n                    How are you?\n          \n                                 CASS\n                    Fine. You?\n          \n                              MILO\n                    Swell. Nice day.\n          \n                                 CASS\n                    Bright.\n          \n                                 MILO\n                    Brisk.\n          \n                                 CASS\n                    Crisp.\n          \n                              MILO\n                    Invigorating.\n          \n                              CASS\n                        (can't hold out anymore)\n                    What are you doing here?\n          \n          Milo smirks.\n          \n                              MILO\n                    \"Building a sand castle, drinking\n                    from a coconut\". Man, once a liar,\n                    always a liar.\n          \n          Cass immediately stands.\n          \n                              CASS\n                    You know what? I don't have time\n                    for this, I'm working.\n          \n          She grabs her stuff. Milo blocks her with his leg.\n          \n                              MILO\n                    Working? Hey, me too.\n          \n                              CASS\n                    Congratulations. Move your leg.\n          \n          Milo doesn't budge. Spelling it out for her:\n          \n                              MILO\n                    What I do is, I track down\n                    criminals. People who jumped bail.\n                    Idiots who decided to go on the run\n                    after biting police officers. I\n                    find them, and I take them to jail.\n          \n                                                                  33.\n          \n          \n          Cass stares at him, eyes wide:\n          \n                              CASS\n                    Now, hold on just a second, Milo...\n          \n                              MILO\n                    Tell you what: I'll give you more\n                    than a second. I'll give you 10.\n                    For old times sake.\n          \n          Milo moves his leg, kicks back, starts to count.\n          \n                              MILO\n                    10...9...8...\n          \n          Cass stares at him, her jaw working, trying to decide what to\n          do. Then, all of a sudden, she BOLTS. Milo smiles. THE\n          LOUDSPEAKERS ANNOUNCE: \"AND THEY'RE OFF!\"\n          \n          \n          EXT RACETRACK PARKING LOT- AFTERNOON\n          \n          Cass jumps into her car and turns the key. NOTHING. She tries\n          again, then hears soft laughter. MILO IS SEVERAL YARDS AWAY,\n          HER BATTERY IN HIS HAND.\n          \n                              MILO\n                    Strike one.\n          \n          Cass leaps from the car and runs.\n          \n          \n          INT STADIUM- AFTERNOON\n          \n          Cass runs for the elevator. It opens and people exit,\n          REVEALING MILO:\n          \n                              MILO\n                    Strike two.\n          \n          Cass turns heel and bolts.\n          \n          \n          EXT STADIUM- AFTERNOON\n          \n          Cass races out, flagging a taxi. Milo pulls up:\n          \n                              MILO\n                    Strike three. Get in.\n          \n                              CASS\n                    I'm not going to jail, Milo.\n          \n                                                                     34.\n          \n          \n                              MILO\n                    I beg to differ.\n          \n          She heads for the cabs. Milo exits his car, GUN IN HAND.\n          \n                              CASS\n                    Oh please. Like you're gonna shoot\n                    me.\n          \n                              MILO\n                    Nope. (loudly) I'm gonna shoot a\n                    cab driver.\n          \n          Head whip around in his direction. THEN EVERY CAB IN THE\n          PLACE GOES OFF-DUTY. Cass stomps her foot, furious.\n          \n                              CASS\n                    Chicken shits.\n          \n          Cass marches back over to Milo.\n          \n                              CASS\n                    Ok, look: let's talk about this.\n          \n                               MILO\n                    Ok.\n          \n          With that, Milo sweeps her up into his arms. AND THEY FIND\n          THEMSELVES FACE TO FACE. BREATHING ON EACH OTHER. THEIR LIPS\n          INCHES APART.\n          \n          Cass stares at Milo. Is he gonna kiss her? Again, she feels\n          weird. Confused.\n          \n                              CASS\n                        (UNCOMFORTABLE)\n                    Listen, Milo, I'm not sure we\n                    should...\n          \n          Suddenly, MILO DUMPS HER IN THE TRUNK OF HIS CAR.\n          \n                              CASS\n                    Hey, wait a minute!\n          \n          He smiles at her, waves, then SLAMS down the lid.\n          \n          CUT TO BLACK. Well, now she knows exactly how she feels:\n          FURIOUS:\n          \n                               CASS (O.S.)\n                    Bastard.\n          \n          CHIRON: \"2:00 PM. ROUTE 9 NORTH. 43 HOURS TO GO\".\n          \n                                                                 35.\n          \n          \n          And immediately: A PHONE RINGS.\n          \n                              CASS (O.S.)\n                    Great. Perfect timing.\n          \n          A match is struck, illuminating the trunk as Cass scrambles\n          for her phone. Trying to sound professional:\n          \n                              CASS\n                    Cassidy Daley.\n          \n          \n          SPLIT-SCREEN:\n          \n          CLOSE ON- JIMMY, head tilted back, tense smile on his face.\n          PULL BACK a little to reveal the GUN MAHLER IS HOLDING UNDER\n          HIS CHIN.\n          \n                              JIMMY\n                    It's me. Jimmy.\n          \n                              CASS\n                        (exhaling with relief)\n                    Shit, Jimmy, I thought you were\n                    dead.\n          \n                              JIMMY\n                    Don't be silly. (hurrying on)\n                    Listen: you didn't happen to go to\n                    my place and find that envelope I\n                    left, did you?\n          \n                              CASS\n                    I did, but I don't really get it,\n                    what's \"Sparrow\"?\n          \n                              JIMMY\n                    It doesn't matter. Did you tell\n                    anyone else about this story?\n          \n                              CASS\n                    Are you kidding? You think I want\n                    to share a story like this?\n          \n                              JIMMY\n                    Ok. Good. Cause the truth is, there\n                    is no story. I made the whole thing\n                    up. So you should just drop it...\n          \n                              CASS\n                    Uh-uh, no way are you backing out\n                    on me now, Jimmy. This story is way\n                    too good...\n          \n                                                                 36.\n          \n          \n          Mahler nudges Jimmy.\n          \n                              JIMMY\n                        (QUICKLY)\n                    Where are you?\n          \n                              CASS\n                    I'm at the Atlantic City Boardwalk.\n                    Actually, I'm in the trunk of my ex-\n                    husband's car. Long story. More\n                    importantly, where are you?\n          \n                                 JIMMY\n                    I'm...\n          \n          CLICK. MAHLER DISCONNECTS THE PHONE.\n          \n          ON CASS- she stares at her phone. Uh-oh:\n          \n                              CASS\n                    Jimmy? Hello?\n          \n          Suddenly, MUSIC KICKS IN and we hear MILO SINGING AT THE TOP\n          OF HIS LUNGS:\n          \n                              MILO (O.S.)\n                    Deck the halls with boughs of\n                    holly, fa la la la laaaa...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          Now Milo really is the happiest man alive. He pulls out his\n          cell phone, dials:\n          \n          SPLIT-SCREEN:\n          \n          Teresa removes her gum, sticks it on her mouse-pad, answers:\n          \n                              TERESA\n                    Sid's Bail Bonds.\n          \n                              MILO\n                    Guess who's in my trunk?\n          \n                              TERESA\n                    Is that some sort of perverted\n                    innuendo? Who is this?\n          \n                              MILO\n                    Aw, come on, Teresa, you know it's\n                    me. Put Sid on.\n          \n                                                                 37.\n          \n          \n                              TERESA\n                    Sid's busy shopping. (snorts) He\n                    thinks he can handle Xmas.\n          \n                              MILO\n                    Ok, just tell him I got her and\n                    I'll be back in 2 hours. I want a\n                    bonus for bringing her in so quick.\n          \n                              TERESA\n                    Yeah? I want a bonus for getting\n                    through the holidays without\n                    stabbing anyone with a fork.\n          \n                              MILO\n                    Don't be such a pessimist. You\n                    still have time.\n          \n          His phone beeps. IT'S CASS CALLING FROM THE TRUNK.\n          \n                              MILO\n                    Gotta go. I got another call.\n          \n          He clicks over.\n          \n                              MILO\n                    Tina's Thai massage! Where every\n                    ending is a happy one!\n          \n          SPLIT-SCREEN:\n          \n          Cass rolls her eyes.\n          \n                               CASS\n                    You're disgusting. Let me out of\n                    the trunk.\n          \n                              MILO\n                    Hmm. Nope. By the way, your\n                    boyfriend Stewart's been following\n                    me. Unfortunately, I had to ditch\n                    him at the track.\n          \n                              CASS\n                    Why is Stewart..? (realizing) And\n                    wait: who said he's my boyfriend?\n          \n                              MILO\n                    Aw, don't be embarrassed. These\n                    things happen. You were drunk when\n                    you guys hooked up, right?\n          \n          Cass turns bright red. She was drunk when they hooked up.\n          Changing tactics, she tries to flatter him:\n          \n                                                                  38.\n          \n          \n                              CASS\n                    You know what, Milo? I shouldn't\n                    have run from you like that. I\n                    was...I don't know. You caught me\n                    off-guard. The truth is, I'm kind\n                    of in some trouble and I could\n                    really use your help.\n          \n                              MILO\n                    Bad news for you, then. I wouldn't\n                    help you if you were the very last\n                    baby sea turtle in the world,\n                    dragging its tiny weak body across\n                    the burning hot sand while sea\n                    gulls circled overhead. I'd just\n                    pull up a chair, sip a pina colada,\n                    and let nature take its course.\n          \n          Long beat. Suddenly, CASS STARTS TO SOB. LOUD, HYSTERICAL\n          SOBS. Milo listens for a moment, out of a purely clinical\n          interest, then:\n          \n                              MILO\n                    Hey, I used to be a sucker, but no\n                    more. You can cry til the cows come\n                    home, for all I care.\n          \n          Cass instantly stops crying and slams her phone shut.\n          \n          CUT TO BLACK. Then, the sound of a trunk opening, and WE ARE\n          INSIDE A CAR TRUNK, LOOKING UP AT: MAHLER.\n          \n          \n          EXT TRUMP CASINO PARKING LOT- AFTERNOON\n          \n          Mahler reaches into his trunk and REMOVES HIS HANDGUN. Checks\n          the cartridge, pockets the gun. Slams the trunk shut.\n          \n          He climbs into his front seat, and as he pulls out of the\n          lot, we see CASS' NEWSPAPER PHOTO THAT HAS BEEN RIPPED FROM\n          THE PAPER, on the passenger seat.\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          Milo drives along happily humming when, suddenly, A SMALL\n          TRAIL OF SMOKE drifts over his shoulder. What the hell...? He\n          glances into the rearview mirror and:\n          \n          SMOKE IS POURING OUT OF THE TRUNK!\n          \n                              MILO\n                    Holy shit! (calling out) Hey, um,\n                    Cass? (no response) Cassidy?\n          \n                                                                  39.\n          \n          \n          Still nothing. Milo jerks the car to the right, and SLAMS on\n          the brakes.\n          \n          \n          EXT CADILLAC- AFTERNOON\n          \n          The car screeches to a halt on the embankment. Milo leaps out\n          of the driver's door and races to back, fumbling with his\n          keys. SMOKE CONTINUES TO POUR OUT OF THE TRUNK.\n          \n                              MILO\n                    It's Ok, hang on, I'm coming...\n          \n          Gets the key in, pops the lid and sees: CASS, HANDKERCHIEF\n          OVER HER NOSE, PACK OF FLAMING MATCHES IN HAND. Cass tosses\n          the matches and handkerchief, AND PUNCHES MILO IN THE BALLS.\n          \n          Milo groans and crumbles to the ground. Cass jumps out of the\n          trunk and stands over him:\n          \n                              CASS\n                    You know something, Milo? You're\n                    one of the most gullible...\n          \n          BAM, Milo grabs her ankle and JERKS and Cass hits the ground.\n          Next thing you know, IT'S WWF TIME, THE TWO OF THEM ROLLING\n          IN THE DIRT.\n          \n          Milo gets her pinned, but Cass grabs his ear and TWISTS:\n          \n                                 MILO\n                    AAAAHHH...\n          \n          He pulls her arm behind her back...\n          \n                              CASS\n                    Ow ow ow...\n          \n          ...and she jerks her head back, SMACKING him in the nose.\n          \n                              MILO\n                    Son of a...\n          \n          He gets her in a BEAR HUG...\n          \n                                 CASS\n                    AAGH...\n          \n          ...and she BITES him.\n          \n                                 MILO\n                    OW...\n          \n                                                                  40.\n          \n          \n          Finally, he has her on her back, TRAPPED. He gets his face\n          right over hers and STARTS TO LET A GLOB OF SALIVA FALL FROM\n          HIS MOUTH TOWARDS HER FACE.\n          \n                              CASS\n                    NOOOO! Uncle, uncle, uncle!\n          \n          Milo collapses onto the ground next to her, laughing. She\n          looks at him and she starts laughing too.\n          \n                              CASS\n                    Dirty fighter.\n          \n                              MILO\n                    Me? I'm the dirty fighter?\n          \n          They both laugh harder. Then Milo stands and offers her a\n          hand. She takes it, and he helps her up. Awkward pause as\n          they look at each other.\n          \n                               CASS\n                    Should we...I don't know...hug, or\n                    something?\n          \n                              MILO\n                    Sure. What the hell.\n          \n          He opens his arms. She moves closer. They hug. Milo feels her\n          hands moving towards the gun in his belt. He smirks. CLICK.\n          HE SNAPS SOME HANDCUFFS ONTO HER WRISTS.\n          \n                              CASS\n                    Hey. I had to try, right?\n          \n                              MILO\n                    Get in the car.\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          They are driving along, both a little dishevelled, ONE OF\n          CASS' HANDS CUFFED TO THE PASSENGER DOOR. They pass casinos\n          as they head out of Atlantic City.\n          \n                              CASS\n                    Your windshield's cracked.\n          \n                              MILO\n                    Thanks, Captain Obvious.\n          \n          Cass turns to inspect him more closely.\n          \n                                                                  41.\n          \n          \n                               CASS\n                    And you look like shit, Milo. What\n                    have you been doing, sleeping on\n                    the floor?\n          \n          Milo has been sleeping on the floor.\n          \n                              MILO\n                    I enjoy sleeping on the floor.\n                    Matter of fact, I love sleeping on\n                    the floor. I love everything about\n                    my life. Great job, good friends,\n                    hot girlfriend...\n          \n                              CASS\n                    You have a girlfriend?\n          \n                              MILO\n                        (he does not)\n                    Yes I do.\n          \n          Cass is skeptical:\n          \n                              CASS\n                    Really? What's her name?\n          \n                              MILO\n                        (the first name that pops\n                         into his head:)\n                    Teresa. Rocking hot body. Likes to\n                    cook pasta for me and perform strip-\n                    teases.\n          \n                              CASS\n                    Wow. Is she missing a chromosome?\n          \n                              MILO\n                    Oh, she has all her chromosomes,\n                    believe you me.\n          \n          Cass thinks this over, then counters:\n          \n                              CASS\n                    Well, my life is great, too.\n          \n                              MILO\n                    I can tell. You and Stewart make a\n                    great couple, by the way. You and\n                    me made a terrible couple. But you\n                    two? Like peas in a pod.\n          \n          About to deny that she and Stewart are a couple, it occurs to\n          Cass: Milo seems a little JEALOUS. She jumps on this:\n          \n                                                                  42.\n          \n          \n                              CASS\n                    You know what I like about Stewart?\n          \n                              MILO\n                    I can't imagine.\n          \n                              CASS\n                    He's not you.\n          \n                              MILO\n                    Not even on his best day.\n          \n                              CASS\n                    Or his worst.\n          \n                              MILO\n                    I'll bet he has a lot of those.\n          \n                              CASS\n                    Still betting, huh?\n          \n                              MILO\n                    You can't win if you don't play.\n          \n                              CASS\n                    Or, in your case, even if you do.\n          \n          He shoots her a sharp look. She stares back, waiting.\n          \n                              MILO\n                    I win all the time.\n          \n                              CASS\n                    Really? I hadn't noticed.\n          \n          Ok. That is definitely a challenge.\n          \n                              MILO\n                    You know what? Seeing as how I'm\n                    about to come into five grand...\n          \n          Milo makes a SUDDEN TURN OFF THE HIGHWAY and pulls into the\n          parking lot of BALLY'S CASINO.\n          \n                               MILO\n                    I think I'll do a little betting\n                    right now.\n          \n                              CASS\n                    Don't you have to take me back?\n          \n                              MILO\n                    Please. I have two days. A monkey\n                    could get you back in two days.\n          \n                                                                 43.\n          \n          \n          Again: famous last words. Milo exits the car. Cass smiles to\n          herself. This is obviously what she hoped would happen. She\n          glances around, spots THE DUFFLE in the back seat. PEEKING\n          OUT OF THE TOP OF THE DUFFLE IS THE TASER GUN. Hmm...\n          \n          \n          EXT CADILLAC- AFTERNOON\n          \n          Milo opens her door.\n          \n                              CASS\n                    Aren't you afraid I'll get away?\n          \n                                 MILO\n                    Nope.\n          \n          He uncuffs her from the door, CUFFS HER TO HIS OWN WRIST.\n          \n          \n          EXT HIGHWAY- AFTERNOON\n          \n          Stewart is heading back to the city, cursing his bad luck,\n          when he happens to glance over and see MILO AND CASS HEADING\n          INTO BALLY'S CASINO.\n          \n                              STEWART\n                    Damn, I'm good!\n          \n          He makes a quick turn off the highway and into the Bally's\n          parking lot.\n          \n          \n          INT BALLY'S CASINO- AFTERNOON\n          \n          The clerk at the chips cage recognizes Milo as he and Cass\n          APPROACH:\n          \n                              CLERK\n                    Merry Xmas, Mr Boyd!\n          \n          Behind the clerk, a FEMALE CLERK perks up at this name...\n          \n                              CLERK\n                    What a nice surprise! Let's hope\n                    your luck is better today.\n          \n          Milo glances at Cass.\n          \n                              MILO\n                        (QUICKLY)\n                    Sure, if there's such a thing as\n                    better than great, which is how my\n                    luck has been lately. Great.\n          \n                                                                  44.\n          \n          \n                              CLERK\n                        (AWKWARD)\n                    Oh. Yes sir. Of course. My mistake.\n          \n          While the clerk is counting out chips, WE NOTICE BEHIND HIM\n          THE FEMALE CLERK PICKING UP THE PHONE...\n          \n          \n          INT WAREHOUSE- LATE AFTERNOON\n          \n          Lorraine on the phone, listening intently. Then she hangs up,\n          grinning.\n          \n                              LORRAINE\n                    The idiot just showed up at\n                    Bally's.\n          \n                               DWIGHT\n                        (QUICKLY)\n                    I'm on it.\n          \n                              LORRAINE\n                    Uh-uh. Not you. (calling out) RAY.\n          \n          RAY appears next to her.\n          \n                              LORRAINE\n                    Go get this asshole.\n          \n          Ray cracks his knuckles, smirks at Dwight, and exits.\n          \n          \n          INT BALLY'S BLACKJACK TABLE- LATE AFTERNOON\n          \n          Milo sits at a blackjack table, pulling Cass into a seat next\n          to him.\n          \n                              MILO\n                    Prepare to observe the master.\n          \n          He bets while Cass sits next to him, scheming:\n          \n                              CASS\n                    Ok, how about this:\n          \n          She uses her free hand to pull out her wallet:\n          \n                              CASS\n                    If I give you all the cash in my\n                    wallet, will you let me go?\n          \n                              MILO\n                    Hmm. Lemme see...\n          \n                                                                 45.\n          \n          \n          He takes the cash from her and thinks for a moment.\n          \n                              MILO\n                    Nope. Guess not.\n          \n          Milo adds her cash to his bet on the table.\n          \n                              MILO\n                        (to the dealer)\n                    Hit me.\n          \n                              CASS\n                    I'd really like to.\n          \n          The dealer deals the cards.\n          \n                              DEALER\n                    Dealer wins.\n          \n                              CASS\n                    Nice going, master.\n          \n          Milo quickly lays out some more money. A WAITRESS (smells\n          like an ashtray) appears:\n          \n                              WAITRESS\n                    And for the couple over here?\n          \n                              MILO\n                        (QUICKLY)\n                    We're not a couple.\n          \n                              CASS\n                        (just as quick)\n                    Why would you think we were a\n                    couple?\n          \n                              MILO\n                    We used to be together. Back when I\n                    was young and foolish.\n          \n                              CASS\n                    And I was confused.\n          \n                              MILO\n                    And I was slumming.\n          \n                              CASS\n                    And I was drunk.\n          \n          The waitress looks back and forth between them.\n          \n                                                                 46.\n          \n          \n                              WAITRESS\n                        (BORED)\n                    Great story. I have to get back to\n                    work now.\n          \n                              MILO\n                    Wait. Champagne! I'm celebrating.\n          \n          The waitress rolls her eyes and leaves. Milo turns to see he\n          has lost more money.\n          \n                              MILO\n                        (under his breath)\n                    Son of a bitch.\n          \n          Ok. Cass has had enough of this. She leans closer:\n          \n                              CASS\n                    Look, Milo, the truth is...my Mom\n                    is in the hospital.\n          \n          Milo perks up.\n          \n                              MILO\n                    Oh? Old Lois not feeling up to par?\n          \n                              CASS\n                    She might be really sick. That's\n                    why I had to jump bail.\n          \n                              MILO\n                        (overly sincere)\n                    Taking care of her, huh? Putting\n                    aside your career for a loved one?\n                    Golly, that's so you.\n          \n          \"Golly\"? Cass stares at him, realizing:\n          \n                              CASS\n                    You've already been to see her.\n          \n                              MILO\n                    Impressive. No wonder you got all\n                    those awards. So lemme guess: the\n                    real reason you jumped bail is\n                    cause you're on a story.\n          \n          Cass narrows her eyes:\n          \n                              CASS\n                    Stewart. Stewart told you.\n          \n                                                                 47.\n          \n          \n                              MILO\n                        (CAUGHT)\n                    I would have figured it out on my\n                    own, trust me.\n          \n                              CASS\n                    I wouldn't trust you if you were\n                    the last man alive.\n          \n                              MILO\n                    You think about that much? Me being\n                    the last man alive? Am I naked in\n                    this fantasy?\n          \n          Cass takes a deep breath. This is getting her nowhere. But\n          she is clearly hesitant to give him the real story.\n          \n                              CASS\n                    Ok, you're right. I'm on a story.\n                    A very important story. It just so\n                    happens that I'm possibly about to\n                    uncover a whole ring of dirty cops.\n          \n          Milo snorts.\n          \n                                CASS\n                    What?\n          \n                              MILO\n                    Please. Isn't the whole \"dirty cop\"\n                    thing kind of old? Maybe you should\n                    do a story about something people\n                    are interested in. Like internet\n                    porn. Or lesbians.\n          \n                              CASS\n                    I'm serious, Milo. This is gonna be\n                    big. And here's what I'm willing to\n                    do (magnanimous): I'm willing to\n                    credit you in the article.\n          \n                              MILO\n                    Oh, sure, like you credited me in\n                    the 13th Street Article?\n          \n          Cass stares at him.\n          \n                              CASS\n                    Why on earth would I have credited\n                    you? I worked my ass off for that\n                    story.\n          \n                              MILO\n                    That's one way of putting it.\n          \n                                                                48.\n          \n          \n                              CASS\n                    What's that supposed to mean?\n          \n                              MILO\n                    Forget it. I don't want to be in\n                    your article. In fact, I would\n                    rather eat a bowl of broken glass\n                    than have my name in any way\n                    associated with one of your lousy\n                    articles...\n          \n                              CASS\n                    Fine. Forget I mentioned it.\n          \n                              MILO\n                    I already have.\n          \n                              CASS\n                    I mean, you're not a cop anymore,\n                    right? What do you care if people\n                    were murdered?\n          \n                              MILO\n                    Please. Nobody was murdered.\n          \n                              CASS\n                    Just my source.\n          \n                              MILO\n                        (SUSPICIOUS)\n                    Oh yeah? How? Bullet to the back of\n                    the head?\n          \n                              CASS\n                    Well...\n          \n                              MILO\n                    Dumped in a reservoir?\n          \n                              CASS\n                        (FLUSTERED)\n                    I don't know.\n          \n                              MILO\n                    Car accident?\n          \n                              CASS\n                    Ok, ok, maybe he wasn't murdered\n                    yet. But I wouldn't be surprised\n                    if...\n          \n          Milo breaks out into loud guffaws. Cass is furious.\n          \n                                                                   49.\n          \n          \n                              CASS\n                    Maybe this whole thing sounds like\n                    no big deal to you...\n          \n                              MILO\n                    You know what it sounds like? It\n                    sounds like you're going to jail.\n          \n          Cass can't believe this.\n          \n                              CASS\n                    Milo, listen, you have to believe\n                    me, come on, you know me...\n          \n                              MILO\n                        (getting red)\n                    Exactly! I do know you. Which means\n                    I know you are a deceptive, cold-\n                    hearted bitch who is going to jail\n                    where she belongs.\n          \n          Wow. That was pretty harsh. Cass looks at him, stunned. They\n          stare at each other in silence.\n          \n          The waitress arrives with the drinks:\n          \n                              WAITRESS\n                    Champagne. So. What are we\n                    celebrating?\n          \n                              CASS\n                        (GRIMLY)\n                    I have to use the bathroom.\n          \n                              WAITRESS\n                    Alrightee, then. Cheers.\n          \n          \n          EXT BALLY'S CASINO PARKING LOT- LATE AFTERNOON\n          \n          Stewart taps his steering wheel restlessly, watching the door\n          of the casino for signs of Cass and Milo. Waiting in this\n          parking lot is boring. Finally, he exits his car. Sidles over\n          to Milo's car. Checks the door handle.\n          \n          IT'S UNLOCKED. Stewart glances around, then climbs in.\n          \n          \n          INT BALLY'S CASINO BATHROOM- LATE AFTERNOON\n          \n          Cass enters and Milo follows:\n          \n                              CASS\n                    Can I have some privacy, please?\n          \n                                                                  50.\n          \n          \n          Milo checks the room. Looks like there is no escape from\n          here. He UNCUFFS HER, but then:\n          \n                              MILO\n                    I'm gonna have to frisk you.\n          \n                              CASS\n                    Get it over with, then.\n          \n          Milo checks her pockets. Her ankles. Her legs. He goes behind\n          her and checks her shoulders. Her back. He reaches around and\n          checks her belly.\n          \n                              MILO\n                    You gain a little weight?\n          \n                              CASS\n                        (snapping back)\n                    You lose a little hair?\n          \n          Milo reaches higher and:\n          \n                              CASS\n                    Yeah. Right. I'm hiding a weapon in\n                    my breasts.\n          \n          Milo backs off, turning red.\n          \n                              MILO\n                    Make it quick.\n          \n          He exits. As soon as he is gone, CASS PULLS MILO'S TASER GUN\n          FROM HER CLEAVAGE.\n          \n          \n          INT CADILLAC- LATE AFTERNOON\n          \n          Stewart is rummaging around inside Milo's car when he looks\n          up and sees: RAY, standing there, smiling at him.\n          \n                              STEWART\n                    Shit, man, you startled me. (beat)\n                    Can I help you?\n          \n                              RAY\n                    Night-night.\n          \n          Suddenly, Ray GRABS STEWART'S HEAD AND SMASHES IT INTO THE\n          STEERING WHEEL, KNOCKING HIM OUT COLD.\n          \n          \n          EXT CASINO BATHROOM- LATE AFTERNOON\n          \n          Milo checks his watch, then raps on the door.\n          \n                                                                    51.\n          \n          \n                              MILO\n                    You almost done in there?\n          \n          \n          INT CASINO BATHROOM- LATE AFTERNOON\n          \n          Cass squints at the taser gun, trying to read the tiny\n          instruction label on the side:\n          \n                              CASS\n                    \"Put open end in direct contact\n                    with skin. Press button...\"\n          \n                              MILO (O.S.)\n                    Hello? Ok, that's long enough, I'm\n                    coming in...\n          \n          He comes in and SHE JAMS THE TASER GUN INTO HIS NECK AND HITS\n          THE BUTTON. HE SCREAMS AND HITS THE FLOOR. SHE SCREAMS, DROPS\n          THE TASER GUN, AND FLEES.\n          \n          \n          EXT CASINO- LATE AFTERNOON\n          \n          CASS RUNS OUT, BANGS INTO SOMEONE...\n          \n                               CASS\n                    Sorry...\n          \n          ...and keeps going. She hurries to the curb and tries to flag\n          down a ride.\n          \n          RACK TO- SEVERAL YARDS AWAY, THE PERSON SHE BUMPED INTO IS\n          STARING AFTER HER. IT'S MAHLER. Mahler compares her to the\n          newspaper photo he is holding. Yup: THAT'S HER.\n          \n          Cass glances around, keeping an eye out for Milo, and SPOTS\n          MAHLER STARING AT HER. Suddenly, he starts heading towards\n          her. Cass backs up slightly, nervous. WHO IS THAT GUY?\n          \n                              VOICE\n                    Need a lift?\n          \n          Cass looks around. A trucker has pulled up next to her.\n          Relieved, she quickly climbs on board.\n          \n          RACK TO- MAHLER, WATCHING THE TRUCK PULL AWAY. He doesn't\n          seem worried. He turns and heads for his car.\n          \n          \n          INT TRUCK- LATE AFTERNOON\n          \n          Cass is fixing her hair, pulling herself together.\n          \n                                                                  52.\n          \n          \n                              CASS\n                    He says we made a terrible couple.\n                    Which is true. I know that. I'm the\n                    one who thought that first. I'm the\n                    one who came up with that. The fact\n                    is, I don't want to be with someone\n                    who can't admit he was wrong.\n          \n                              DRIVER\n                    So you're available.\n          \n          Cass looks at him. He smiles coyly.\n          \n                              CASS\n                    Available for what?\n          \n                              DRIVER\n                    I have a waterbed in my trailer.\n          \n                              CASS\n                    I hope you don't think you're\n                    telling me something that interests\n                    me.\n          \n                              DRIVER\n                    You know what I want for Xmas?\n          \n          The driver mouths something at her we can't see. Cass leans\n          over and SMACKS HIM AS HARD AS SHE CAN.\n          \n          \n          EXT HIGHWAY- LATE AFTERNOON\n          \n          The truck SCREECHES to a halt by the side of the road. Cass\n          gets booted out the passenger door. The door is slammed shut\n          behind her. Cass gives the guy the finger as he drives off.\n          \n          She turns to see a car headed her way. She starts flagging it\n          down. But wait... Yup, IT'S MILO. Shit. She looks around, but\n          where's she gonna go? Meanwhile, as Milo nears, HE SEEMS TO\n          BE SPEEDING UP. Cass stares. He keeps coming, an evil look on\n          his face. IT LOOKS LIKE HE IS GOING TO RUN HER OVER.\n          \n          She turns and STARTS TO RUN.\n          \n          \n          INT CADILLAC- LATE AFTERNOON\n          \n          Milo is laughing.\n          \n                              MILO\n                    You better run.\n          \n                                                                  53.\n          \n          \n          EXT FIELD- LATE AFTERNOON\n          \n          Cass runs into a field. Milo drives off the road and follows.\n          He gets her cornered by a pen. He looks triumphant. She\n          scowls. Then she throws open the pen, REVEALING A HUGE BULL.\n          Now she looks triumphant. He scowls.\n          \n          CUT TO- BULL RAMS INTO MILO'S CAR, SLAMMING MILO'S FACE INTO\n          THE STEERING WHEEL. CASS LAUGHS. THE BULL TURNS AND NOTICES\n          CASS FOR THE FIRST TIME.\n          \n          CUT TO- BULL CHASES CASS. MILO LAUGHS. CASS RUNS FOR THE CAR.\n          MILO LOCKS THE DOORS.\n          \n                              CASS\n                    Hey, it's locked!\n          \n                              MILO\n                        (GRINNING)\n                    I know.\n          \n          THE BULL IS SPEEDING THEIR WAY:\n          \n                              CASS\n                    Open the door, you son of a bitch!\n          \n          Finally, Milo opens it. She DIVES INTO THE CAR AND SLAMS THE\n          DOOR just before the BULL RAMS INTO THE SIDE OF THE CAR.\n          \n          Cass and Milo watch, stunned, as the bull looks at them for a\n          moment, THEN TOPPLES OVER, UNCONSCIOUS. Milo and Cass hear a\n          strange sound, and look over to see A SMALL HERD OF BULLS,\n          GETTING READY TO CHARGE.\n          \n                               CASS\n                    Uh-oh...\n          \n          MILO HITS THE GAS AND THEY FLEE THE SCENE, THE HERD OF BULLS\n          IN MAD PURSUIT. CASS AND MILO ARE BOTH NOW LAUGHING\n          HYSTERICALLY...\n          \n          CHIRON: \"5:00 PM. ROUTE 9 ADJACENT. 40 HOURS TO GO.\"\n          \n          \n          INT WAREHOUSE- EARLY EVENING\n          \n          Lorraine waves Dwight over.\n          \n                              LORRAINE\n                    Ray's got something to show you.\n          \n                              RAY\n                    Merry Xmas.\n          \n                                                                  54.\n          \n          \n          Ray THROWS open the bathroom door to reveal: A VERY\n          DISGRUNTLED STEWART, HANDCUFFED TO THE TOILET. Stewart blinks\n          up at them, disoriented.\n          \n          Lorraine hands Dwight THE GOLF CLUB.\n          \n                              LORRAINE\n                    Pick something and break it.\n          \n                              STEWART\n                    Whoa, wait just a minute...\n          \n          DWIGHT WHACKS STEWART IN THE SHIN WITH THE CLUB. STEWART\n          SCREAMS.\n          \n                              LORRAINE\n                    Feel better?\n          \n                              DWIGHT\n                    You know, I do feel better. (beat)\n                    Who is this guy, anyway?\n          \n          Lorraine and Ray stare at him.\n          \n                                 LORRAINE\n                    Milo Boyd.\n          \n                              DWIGHT\n                    That's not Milo Boyd.\n          \n                              RAY\n                    He was in Milo Boyd's Cadillac.\n          \n          They all look at Stewart, who moans in pain.\n          \n                              LORRAINE\n                    Both of you go this time, and make\n                    sure you get the right guy. I don't\n                    have time for this shit.\n          \n          RAY AND DWIGHT EXIT.\n          \n                              STEWART\n                    What about me?\n          \n          Lorraine considers him for a moment, then SLAMS the bathroom\n          door in his face.\n          \n          \n          INT CADILLAC- EARLY EVENING\n          \n          Milo and Cass are back on the highway, both looking a little\n          worse for wear. Milo's nose is swollen, Cass' clothes are\n          muddy.\n          \n                                                                 55.\n          \n          \n          Milo MOVES HIS WEAPONS FROM THE DUFFLE INTO HIS OWN JACKET\n          WHILE HE DRIVES. He smirks at Cass.\n          \n                              CASS\n                    Clever. (noting all the weapons)\n                    Wow. You were gonna use all that\n                    stuff on me?\n          \n                              MILO\n                    A guy can dream, can't he?\n          \n          NOW HIS JACKET IS FULL OF WEAPONS. He turns his attention\n          back to the road. Cass studies his profile.\n          \n                              CASS\n                    Ok, look, Milo, let's just clear\n                    the air, Ok? So maybe it was a\n                    mistake, thinking we could be\n                    involved while working on the same\n                    case...\n          \n                              MILO\n                    Hey, I know it was a mistake. Don't\n                    think you're telling me something I\n                    don't know, cause you're not.\n          \n                              CASS\n                        (deep breath)\n                    Ok. Fine. But can we just put aside\n                    our differences for two seconds?\n                    Because back at the casino, I think\n                    I saw someone following me.\n          \n                              MILO\n                    Sure that wasn't me?\n          \n                              CASS\n                    I don't think so. This guy was\n                    lacking your trademark smell of\n                    booze and KFC.\n          \n                              MILO\n                    Ha ha.\n          \n          Milo surreptitiously sniffs himself.\n          \n                              CASS\n                    Anywho. If these dirty cops have my\n                    source hostage somewhere...\n          \n          Milo starts to laugh. Cass flushes:\n          \n                              CASS\n                    What's so funny?\n          \n                                                                  56.\n          \n          \n                              MILO\n                    You think dirty cops are trying to\n                    kill you? Look, I know you think\n                    you're hot shit and everything, but\n                    I'm pretty sure the only one around\n                    here who might want to kill you is\n                    me.\n          \n          Cass SEES A DARK CHEVY in the rearview mirror, gets a look at\n          the driver and goes pale.\n          \n                              CASS\n                    Oh no.\n          \n                              MILO\n                    What?\n          \n                              CASS\n                    Behind us. It's him. The guy I saw\n                    back at the casino.\n          \n          Milo glances into the mirror, checking the guy out.\n          \n                              MILO\n                    Yeah? He doesn't look like a cop to\n                    me.\n          \n                              CASS\n                        (freaking out)\n                    Speed up!\n          \n                              MILO\n                    Would you just calm down for a\n                    second and...\n          \n                              CASS\n                    NO!!\n          \n          Cass kicks a leg over and SLAMS HER FOOT ONTO THE GAS. The\n          car LEAPS forward...\n          \n                              MILO\n                    Jesus christ...\n          \n          Milo tries to push her foot off the gas while they wrestle\n          for the wheel. THE CAR DOES A CRAZY ZIG-ZAG BACK AND FORTH...\n          \n                              MILO\n                    LISTEN, YOU MANIAC...\n          \n                              CASS\n                    MILO...\n          \n                                                                   57.\n          \n          \n                              MILO\n                    ...LET GO...\n          \n                              CASS\n                    MILO...\n          \n                              MILO\n                    ...NO ONE IS TRYING TO KILL YOU...\n          \n                              CASS\n                    MILO!!!\n          \n          She points past him. Milo turns to see MAHLER DRIVING BESIDE\n          THEM, GUN POINTED AT MILO'S HEAD.\n          \n                              MILO\n                    SHIT!!!\n          \n          They both duck as Mahler starts firing. GLASS SHATTERS ALL\n          AROUND THEM. MILO PULLS OUT HIS GUN and STARTS FIRING BACK...\n          \n          \n          EXT HIGHWAY- EARLY EVENING\n          \n          BOTH CARS VEER WILDLY FROM LANE TO LANE AS MILO AND MAHLER\n          FIRE AT EACH OTHER...\n          \n          CLOSE ON- THE CADILLAC'S REAR TIRE, AS IT GOES FLAT FROM A\n          BULLET...\n          \n          \n          INT CADILLAC- EARLY EVENING\n          \n          MILO GRIPS THE WHEEL AS THE CAR STARTS TO DRAG AND LOSE\n          GROUND. Cass is hunched over in the passenger seat, excited\n          and frightened at the same time.\n          \n          Mahler pulls alongside them again and Milo WRENCHES the wheel\n          to the left, SLAMMING THE CADILLAC INTO MAHLER'S CAR.\n          Mahler's car goes skidding across the road, hits a ditch and\n          FLIPS ONTO ITS SIDE.\n          \n          \n          EXT HIGHWAY- EARLY EVENING\n          \n          The cadillac SPEEDS away, leaving Mahler's car behind.\n          \n          \n          EXT HIGHWAY- EARLY EVENING\n          \n          The Cadillac is parked on the shoulder, Milo changing the\n          tire, Cass standing by the passenger door, still handcuffed,\n          EXCITED:\n          \n                                                                  58.\n          \n          \n                              CASS\n                    I told you they were trying to kill\n                    me!\n          \n                              MILO\n                    Yeah, well, no one's killing you\n                    until I get you to jail.\n          \n          Cass whips her head around to look at him:\n          \n                              CASS\n                    You're still taking me to jail? But\n                    it's the cops who are after me.\n          \n                              MILO\n                    First of all: that guy was not a\n                    cop. Second of all, we just left\n                    him unconscious in a ditch. You'll\n                    be fine.\n          \n                              CASS\n                    But...this is important! This is my\n                    job!\n          \n                               MILO\n                    And this...(pointing between them)\n                    is my job.\n          \n                              CASS\n                    Milo, you don't understand what's\n                    going on!\n          \n          Milo rolls his eyes and straightens up.\n          \n                              MILO\n                    I'll lay it out for you: some loser\n                    with a minor sheet calls you up and\n                    says, hey, I've got a big story for\n                    you, you interested? It'll only\n                    cost you a couple hundred bucks,\n                    and I'll tip you onto some criminal\n                    activity, it's your chance to\n                    expose some bad guys and write the\n                    story of your life. Then the moron\n                    gets himself caught, he's probably\n                    in cold storage somewhere, and now\n                    you think the bad guys are after\n                    you. (beat) See? I get it. I just\n                    don't care.\n          \n          Milo finishes with the tire, throws the jack in the back, and\n          heads back around to the driver's seat.\n          \n                                                                 59.\n          \n          \n          Cass watches him closely, getting an idea. She reaches into\n          her pocket and pulls out the paper from Jimmy.\n          \n                               CASS\n                         (CASUALLY)\n                    If only I knew exactly when and\n                    where this deal was going down.\n                    Course, if I can't figure out that\n                    part, then you definitely can't\n                    figure out that part, because we\n                    both know I'm much smarter than\n                    you.\n          \n          Milo flinches, then forces a laugh.\n          \n                              MILO\n                    Please. My brain can dance circles\n                    around your brain.\n          \n                              CASS\n                    I don't even know what that means.\n          \n                              MILO\n                    Case closed.\n          \n                              CASS\n                        (SHRUGGING)\n                    Fine. Guess we'll never know.\n          \n          Milo hesitates. Then decides: fuck it. He strides around the\n          car and SNATCHES the paper from her hand. He reads:\n          \n                              MILO\n                    \"Atlantic City. Xmas Eve. Sparrow.\"\n                    What's \"Sparrow\"?\n          \n                              CASS\n                    I knew you couldn't figure it out.\n          \n                              MILO\n                        (QUICKLY)\n                    It's a business.\n          \n                                CASS\n                    No.\n          \n                                MILO\n                    Casino.\n          \n                                CASS\n                    Nope.\n          \n                                MILO\n                    Stripper?\n          \n                                                                 60.\n          \n          \n                              CASS\n                    I don't think so. What kind of\n                    strip bars have you been going to,\n                    anyway?\n          \n          Milo stares at the paper, wracking his brain. Cass sighs\n          loudly and SNATCHES the paper back.\n          \n                              CASS\n                    Oh, well, forget it, I knew you\n                    couldn't do it.\n          \n                              MILO\n                    Please. I could crack that story\n                    and still get you to jail on time.\n          \n                                 CASS\n                    Oh yeah?\n          \n          Cass stares him in the eye and says the magic words:\n          \n                                 CASS\n                    Wanna bet?\n          \n          Milo stares at her. She stares back. Long beat. Milo's face\n          is red. He clenches his fists. He unclenches them. Fuck. He\n          thrusts out his hand:\n          \n                                 MILO\n                    You're on.\n          \n          They shake.\n          \n                              MILO\n                    I have to make a call.\n          \n          He starts to walk away.\n          \n                              CASS\n                    Hey. Aren't you going to uncuff me?\n          \n                              MILO\n                    Why? You going somewhere?\n          \n                                 CASS\n                    Um...no.\n          \n                              MILO\n                    Then you don't need to be uncuffed.\n          \n                                                                  61.\n          \n          \n          INT CADILLAC- MOMENTS LATER\n          \n          Cass sits in the passenger seat and watches in the rearview\n          mirror while Milo paces behind the car, on the phone.\n          \n                              CASS\n                        (to herself)\n                    Asshole.\n          \n          \n          EXT CADILLAC- EARLY EVENING\n          \n          Milo is talking to Sid:\n          \n                              MILO\n                    So there's just gonna be a little\n                    delay...\n          \n          SPLIT-SCREEN:\n          \n          INT MALL- EARLY EVENING\n          \n          Sid's at the mall. On Dec 23rd. With all the other desperate,\n          last-minute shoppers. In other words, HE'S IN HELL.\n          \n                              SID\n                    I don't get it. Why are you helping\n                    her?\n          \n                              MILO\n                    But that's the beauty of it, Sid,\n                    I'm not helping her, she only\n                    thinks I'm helping her.\n          \n                              SID\n                    Yeah? If you're not helping her,\n                    what are you doing?\n          \n          Milo notices Cass watching him and turns his back slightly.\n          \n          \n          INT CADILLAC- EARLY EVENING\n          \n          Cass narrows her eyes:\n          \n                              CASS\n                        (to herself)\n                    What is he up to?\n          \n          \n          EXT CADILLAC- EARLY EVENING\n          \n          Milo is making this up as he goes along:\n          \n                                                                  62.\n          \n          \n                              MILO\n                    I'll tell you what I'm doing: I'm\n                    gonna crack this case first, and\n                    I'm gonna take all the credit. Who\n                    knows, maybe I'll even get my job\n                    back....\n          \n                              SID\n                    You are so full of shit. You don't\n                    want your job back. You just want\n                    to prove you're smarter than she\n                    is.\n          \n                              MILO\n                        (instantly heated)\n                    I am smarter than she is. I would\n                    have cracked that 13th Street case\n                    way before she did if she hadn't...\n          \n                              SID\n                    ...cheated, right, I know, you've\n                    told me a million times. Did it\n                    ever occur to you that a normal\n                    couple wouldn't compete the way you\n                    guys do in the first place?\n          \n          Sid spots what he is looking for. So does another last-minute\n          shopper. They both reach for the toy.\n          \n                              MILO\n                    This from the man currently trying\n                    to prove to his wife he can handle\n                    Xmas.\n          \n                              SID\n                        (instantly heated)\n                    I can handle Xmas!\n          \n          Sid WRENCHES the toy from the other shopper.\n          \n                              MILO\n                    Just..trust me, Ok?\n          \n                              SID\n                    Do I have a choice?\n          \n                              MILO\n                    Nope.\n          \n          Milo hangs up and gets in the car.\n          \n                                                                 63.\n          \n          \n          EXT CADILLAC- EARLY EVENING\n          \n          The cadillac pulls a U-turn and HEADS BACK TOWARDS ATLANTIC\n          CITY.\n          \n          CHIRON: \"6:00 PM. ROUTE 9 SOUTH. 39 HOURS TO GO.\"\n          \n                              MILO (O.S.)\n                    So. Atlantic City. Xmas Eve...\n          \n          \n          EXT HOTDOG STAND- EVENING\n          \n          Milo buys a chili dog while talking to Cass who stands next\n          to him, handcuffed.\n          \n                              MILO\n                    ...so what exactly are these dirty\n                    cops supposed to be doing?\n          \n                              CASS\n                    Stealing evidence from property\n                    rooms. Then destroying it, for the\n                    right price.\n          \n          Milo stares.\n          \n                              CASS\n                    What?\n          \n                              MILO\n                    Nothing. It's just...it's a good\n                    idea. If it weren't, you know.\n                    Wrong. (continuing) So. Your plan\n                    is to catch them red-handed before\n                    they can destroy the evidence, then\n                    write an expose for the paper and\n                    win yourself another big award.\n          \n                              CASS\n                    Something like that.\n          \n                              MILO\n                    Only, you don't know what Sparrow\n                    is. (thinking) Could be a nickname.\n                    Or the place where the evidence is\n                    stashed. Or a code word of some\n                    kind. But the guy who knows has\n                    gone missing, and you think the\n                    dirty cops got a hold of him.\n          \n                                                                  64.\n          \n          \n                              CASS\n                        (NODDING)\n                    When Jimmy called earlier, someone\n                    else was there. And they\n                    disconnected the call.\n          \n          Milo is staring at her.\n          \n                              MILO\n                    So we find your source, we find the\n                    dirty cops. Gimme your phone.\n          \n          She hands it to him. Milo checks the record of incoming calls\n          and smiles.\n          \n                                CASS\n                    What?\n          \n                              BOBBY (O.S.)\n                    Milo! Merry Xmas!\n          \n          SPLIT-SCREEN:\n          \n          EXT PADDY WAGON- EVENING\n          \n          Bobby talks into his cell phone while supervising a parade of\n          hookers being loaded into a van:\n          \n                              BOBBY\n                    Here's one: why did the snowman\n                    pull down his pants? Cause he heard\n                    the snowblower was coming!\n          \n                              MILO\n                    Funny. Listen, Bob, I need a favor.\n          \n                                BOBBY\n                    Anything.\n          \n                              MILO\n                    I need an address to go with a\n                    phone number. But I need it ASAP.\n                    Kinda got a guy on my tail...\n          \n          \n          EXT GARAGE- EVENING\n          \n          A tow truck is pulling up, towing Mahler's car. The tow truck\n          driver turns to Mahler, who is in the passenger seat:\n          \n                              TOW TRUCK DRIVER\n                    The garage is closed for the night.\n                    Guess you'll have to wait til\n                    tomorrow.\n          \n                                                                 65.\n          \n          \n          Mahler thinks this over, then SMACKS THE DRIVER ACROSS THE\n          FACE WITH THE BUTT OF HIS GUN. The driver crumples in his\n          seat.\n          \n                                 MAHLER\n                    Guess not.\n          \n          Mahler leans across him, opens the driver's side door, and\n          BOOTS him out of the cab.\n          \n          \n          EXT HIGHWAY- EVENING\n          \n          The tow truck is driving away from the garage.\n          \n          \n          INT CADILLAC- EVENING\n          \n          Milo climbs back into the car, holding a piece of paper with\n          the words \"Trump Casino, room 2504\" on it. He grins at Cass.\n          \n                              CASS\n                    Pretty proud of yourself, ey?\n          \n                              MILO\n                    Hey. You're a reporter. Great. But\n                    I used to be a cop. Let's face it:\n                    I'm naturally gonna be one step\n                    ahead of you.\n          \n                              CASS\n                        (under her breath)\n                    You weren't last time.\n          \n          Milo whips his head around:\n          \n                              MILO\n                    What did you say?\n          \n                              CASS\n                    I said you're doing a great job.\n          \n          \n          EXT HIGHWAY- EVENING\n          \n          The Trump Casino on the strip, coming into view...\n          \n          \n          EXT TRUMP CASINO- EVENING\n          \n          Milo pulls into the crowded parking lot and checks the\n          cartridge of his gun. Beside him, Cass is bubbling over with\n          excited energy:\n          \n                                                                  66.\n          \n          \n                              CASS\n                    Ok, here's what I think we should\n                    do: I'll go up first, Jimmy knows\n                    me, so if anything's wrong I'm sure\n                    he'll give me a sign...\n          \n                              MILO\n                    Excellent plan. Oh, except you're\n                    staying in the car.\n          \n          Milo exits the car.\n          \n                              CASS\n                        (shouting after him)\n                    But...it's my story!\n          \n          But he is already headed for the casino entrance. He waves at\n          her and disappears inside.\n          \n                                CASS\n                    Asshole.\n          \n          \n          INT TRUMP CASINO- EVENING\n          \n          Milo glides through the casino, past the blinking lights of\n          the slot machines, headed for the elevators. A DRUNK GUY in a\n          Hawaiian shirt is coming towards him and HE AND MILO\n          COLLIDE...\n          \n                              MILO\n                        (steadying the guy)\n                    You Ok? My bad.\n          \n                              DRUNK GUY\n                    Watch where you're going. (under\n                    his breath) Prick.\n          \n          The drunk guy continues past. Milo holds up THE ROOM CARD KEY\n          HE HAS JUST SWIPED FROM THE GUY:\n          \n                              MILO\n                        (calling after him)\n                    Merry Xmas to you, too!\n          \n          \n          INT TRUMP CASINO 25TH FLOOR- EVENING\n          \n          The elevator dings and Milo exits. He turns a corner and\n          heads down the hall. Another elevator DINGS behind him.\n          \n          Milo continues down the hall. Suddenly, he STOPS and looks\n          behind him. No one is there.\n          \n                                                                    67.\n          \n          \n          He turns another corner and FINDS 2504. There is a \"DO NOT\n          DISTURB\" sign on the door. HE GOES PAST IT AND TAPS LIGHTLY\n          ON 2505.\n          \n                              MILO\n                    Room service.\n          \n          No answer. He glances down the hall and sees a slight\n          movement. SOMEONE IS WATCHING HIM. He moves away from the\n          door, continues down the hall, THEN SLIPS INTO THE ICE\n          MACHINE ROOM...\n          \n          \n          INT ICE MACHINE ROOM- CONTINUOUS\n          \n          Milo hits the light switch off and waits just inside the\n          door. Someone steps in, and MILO GRABS THEM AND THROWS THEM\n          AGAINST THE WALL. The person SCREAMS. Milo slaps a hand\n          across the person's mouth and switches on the light. And\n          finds himself face to face with:\n          \n          CASS.\n          \n                              MILO\n                    What the...?\n          \n          He looks at the handcuff dangling from her wrist, STILL\n          ATTACHED TO THE CAR DOOR ARM REST.\n          \n                              MILO\n                        (loud whisper)\n                    What the hell are you doing?\n          \n                               CASS\n                        (SAME)\n                    It's my story, I don't break\n                    stories by staying in the car!\n          \n                              MILO\n                    Yeah, well, (re: the armrest)\n                    you're paying for that.\n          \n                              CASS\n                    Oh, ok. Here's a nickle.\n          \n          Suddenly, Milo goes still. THERE IS A CREAKING SOUND as\n          someone creeps down the hall. Milo puts a finger to Cass'\n          lips.\n          \n          Then he peeks out the door.\n          \n          MILO'S POV- THE CLEANING CART BEING SLOWLY WHEELED DOWN THE\n          HALL BY THE MAID. The maid stops by a room and enters.\n          \n                                                                  68.\n          \n          \n                              MILO\n                    Perfect. (to Cass) Play along.\n          \n          \n          INT HALLWAY- EVENING\n          \n          Milo passes the maid's cart, glancing at her ROOM RECORD\n          SHEET, then continues on to room 2505. He uses the CARD HE\n          SWIPED on the door. Of course, IT DOESN'T WORK.\n          \n                               MILO\n                        (LOUD)\n                    Godammit. Son of a bitch.\n          \n          The maid peeks out into the hall.\n          \n                              MILO\n                        (to Cass)\n                    This is like the third card they've\n                    given me...\n          \n                              CASS\n                        (playing along)\n                    Take it easy, honey...\n          \n                              MILO\n                    Don't tell me to take it easy, now\n                    we have to go all the way\n                    downstairs again...\n          \n          Cass looks pleadingly at the maid.\n          \n                              MAID\n                    What's the name?\n          \n                              MILO\n                    Davenport. Room 2505.\n          \n          The maid checks her chart, then crosses the hall and USES HER\n          PASS KEY TO OPEN THE DOOR.\n          \n                              MILO\n                    You're an angel.\n          \n          Milo and Cass go inside.\n          \n          \n          INT ROOM 2505- EVENING\n          \n          Milo closes the door carefully behind them, then tiptoes\n          across the room to the connecting door, Cass close on his\n          heels. All is silent.\n          \n                                                                    69.\n          \n          \n                              CASS\n                        (WHISPERING)\n                    Wait a second: where's my gun?\n          \n                               MILO\n                        (SAME)\n                    I don't know. Where is your gun?\n          \n                              CASS\n                    I don't have one.\n          \n                              MILO\n                    Then you've answered your own\n                    question.\n          \n          Milo tiptoes closer to the door. Cass pulls on his sleeve.\n          \n                              CASS\n                    Come on, give me something. You've\n                    got, like, a million weapons in the\n                    jacket.\n          \n          She reaches for his jacket, and Milo pulls away.\n          \n                              MILO\n                    Hey. These are not toys. You can't\n                    just give them to someone and have\n                    them know how to use them.\n          \n                              CASS\n                    I seem to remember doing just fine\n                    with your taser gun.\n          \n          They are at the door. Milo puts a finger to his lips and\n          tries the doorknob: LOCKED. He is about to work the lock when\n          THEY HEAR SCREAMS COMING FROM THE LOCKED ROOM.\n          \n          No time to do this quietly. MILO TAKES A STEP BACK, THEN\n          KICKS THE DOOR IN...\n          \n          \n          INT HALLWAY- EVENING\n          \n          Halfway down the hallway, THE MAID HEARS THE DOOR BEING\n          KICKED IN. Nervous, she backs away, headed for the\n          elevators...\n          \n          \n          INT ROOM 2504- CONTINUOUS\n          \n          Milo QUICKLY ENTERS THE ROOM, GUN RAISED. THE SCREAMING IS\n          COMING FROM THE TV. Milo clicks it off and checks the room.\n          The place appears to be deserted. He crosses to the bathroom\n          and peers in: EMPTY.\n          \n                                                                 70.\n          \n          \n          Meanwhile, Cass has cautiously entered the room and sees\n          spots on the rug:\n          \n                              CASS\n                    Oh, god, is that blood?\n          \n                              MILO\n                    Hey. Columbo. Wait by the door.\n          \n                              CASS\n                    I'm just trying to...\n          \n                              MILO\n                    This could be a crime scene. There\n                    are clues all over this room that\n                    only a trained eye can find. And as\n                    I seem to recall, you were the one\n                    who was unable to figure this out\n                    by herself.\n          \n          Oooh. Cass grits her teeth.\n          \n                              CASS\n                        (under her breath)\n                    He is unbelievable.\n          \n                              MILO\n                    Who are you talking to, your\n                    imaginary friend Leslie?\n          \n                              CASS\n                        (BLUSHING)\n                    Hey. Lots of kids have imaginary\n                    friends, despite what my mother\n                    believes.\n          \n                              MILO\n                    Whatever. You wait by the door. And\n                    I'll handle this.\n          \n                              CASS\n                        (PISSED)\n                    Fine.\n          \n          She moves back to the door. As she does, she notices a\n          matchbook on the floor: IT'S A GREEN MATCHBOOK WITH A BLACK\n          SILHOUETTE OF A HORSE.\n          \n                              CASS\n                    So you're saying you don't want my\n                    help.\n          \n                              MILO\n                    I'm saying I don't need your help.\n          \n                                                                 71.\n          \n          \n                                CASS\n                          (SHRUGGING)\n                    Ok.\n          \n          As he turns away, SHE SLIPS THE MATCHBOOK INTO HER PURSE.\n          Milo catches this movement out of the corner of his eye and\n          glances back:\n          \n                              MILO\n                    What was that?\n          \n                              CASS\n                        (INNOCENTLY)\n                    What was what?\n          \n                              MILO\n                    Did you find something?\n          \n                              CASS\n                    How could I find anything? I'm not\n                    the detective.\n          \n                              MILO\n                    Lemme see your purse...\n          \n          Milo takes a step closer to her, but:\n          \n                                VOICE\n                    FREEZE!\n          \n          Cass and Milo turn to see A HOTEL SECURITY GUARD IN THE\n          DOORWAY, EXCITEDLY POINTING HIS GUN AT THEM. Milo rolls his\n          eyes.\n          \n                              GUARD\n                    Hotel security! Stay where you are!\n          \n                              MILO\n                    Ok, Ok, no problem. You're probably\n                    gonna want this.\n          \n          Milo holds up HIS GUN.\n          \n                              GUARD\n                        (PANICKED)\n                    DROP THE WEAPON, NOW!\n          \n                              MILO\n                    Take it easy. I'm just gonna unload\n                    it.\n          \n          Milo drops the cartridge, then TOSSES THE GUN RIGHT AT THE\n          GUARD'S FACE.\n          \n                                                                   72.\n          \n          \n          The guard instinctively raises his hands and Milo CHARGES\n          him, tackling him to the ground, then handcuffing him to the\n          table.\n          \n          Milo GRABS Cass hand and races from the room.\n          \n          \n          INT HALLWAY- EVENING\n          \n          Cass and Milo run up to the elevators. ALL CARS ARE RISING:\n          BACK-UP IS ON THE WAY. Milo hits the fire alarm and pulls\n          Cass into the stairwell...\n          \n          \n          INT STAIRWELL- EVENING\n          \n          Milo and Cass are almost to the bottom, WHEN SECURITY APPEARS\n          IN THE STAIRWELL BENEATH THEM. Milo looks up. SECURITY IS\n          COMING FROM ABOVE, AS WELL. Shit. Milo cracks the stairwell\n          window and peers out: THEY ARE 4 STORIES UP.\n          \n                              MILO\n                    You're gonna have to jump.\n          \n                                 CASS\n                    I can't.\n          \n          Milo considers this, then picks her up and TOSSES HER OUT THE\n          WINDOW.\n          \n          \n          EXT TRUMP CASINO- EVENING\n          \n          Cass screams as she falls. Milo falls next to her. They fall\n          and fall and BOOSH: THEY LAND IN A SNOW BANK AND TUMBLE TO\n          THE GROUND.\n          \n          Seconds later, they are on their feet, RUNNING FOR THE CAR.\n          \n                              BOBBY (O.S.)\n                    Ok, so some guy you're looking for\n                    has disappeared. You want me to put\n                    out an all-points on him?\n          \n          \n          INT CADILLAC- EVENING\n          \n          Milo and Cass are speeding away from the Trump Casino.\n          \n                              MILO\n                        (into phone)\n                    The thing is, Bob: Cass thinks\n                    dirty cops might be involved.\n          \n                                                                 73.\n          \n          \n          SPLIT-SCREEN:\n          \n          INT POLICE STATION- EVENING\n          \n          Bobby is in his office. His door opens onto the squad room,\n          busy with police activity. Bobby sits up straighter in his\n          chair.\n          \n                              BOBBY\n                    Whoa, whoa, whoa. You're with\n                    Cassidy? Shit, Milo, you know when\n                    you're around her your brain turns\n                    to mush.\n          \n                              MILO\n                    Yeah, well, that doesn't change the\n                    fact that someone took a couple\n                    shots at us.\n          \n          Beat.\n          \n                              BOBBY\n                    You get a plate number?\n          \n                              MILO\n                    Happened too quick. But it was a\n                    dark 4-door Chevy, blue or grey,\n                    New Jersey plates, and the car was\n                    wrecked, I know that.\n          \n          Bobby thinks this over.\n          \n                              BOBBY\n                    Ok. Lemme look into it. See what I\n                    can find. Just hold tight, Ok?\n          \n          Milo checks his watch.\n          \n                              MILO\n                    Ok. But we're kinda on a clock\n                    here.\n          \n                              BOBBY\n                    Milo, don't fuck around with this.\n                    If there are dirty cops in the\n                    house, we all have a problem. So do\n                    me a favor: get off the strip, find\n                    somewhere to lie low and wait for\n                    my call.\n          \n                                                                   74.\n          \n          \n          EXT BACK OF TRUMP CASINO- EVENING\n          \n          The scene has calmed down a little. A DARK SEDAN appears and\n          RAY AND DWIGHT exit the car, looking like a an ugly,\n          dangerous Odd Couple.\n          \n          An employee slips out the back door and hands Ray a PHOTO\n          FROM SECURITY OF MILO AND CASS IN THE CASINO PARKING LOT.\n          Dwight snatches the photo from Ray.\n          \n                              DWIGHT\n                    Yeah, that's him.\n          \n                              RAY\n                    Who's the chick?\n          \n                              DWIGHT\n                    Who gives a fuck? Anyway, they\n                    can't be far.\n          \n          It's true. They aren't too far. They are:\n          \n          \n          EXT OFF ROUTE 9- EVENING\n          \n          A LUXURIOUS, ROMANTIC B&B. Xmas lights winking on the trees,\n          \"Come All Ye Faithful\" gently wafting out the oak front door.\n          \n          CHIRON: \"9:00 PM. ROUTE 9 SOUTH. 36 HOURS TO GO.\"\n          \n          The whole scene looks beautiful, peaceful, romantic...\n          \n                              CASS (O.S.)\n                    Ok. Kill me now.\n          \n          PULL BACK TO REVEAL MILO AND CASS, parked in front. REVEAL\n          THE SIGN NEXT TO THEM: \"WELCOME TO CUPID'S CABIN\". Yup. The\n          place Milo and Cass ran off to and got married 3 years ago.\n          \n                              MILO\n                    I'm sorry, it's the only place I\n                    know off the strip.\n          \n                              CASS\n                    I'm not going in. What if they\n                    remember us?\n          \n                              MILO\n                    They won't remember us. Why would\n                    they remember us? Just...try to act\n                    normal.\n          \n                                                                    75.\n          \n          \n          INT LUXURY B&B- EVENING\n          \n          A small, family-run, luxury bed and breakfast. The kind of\n          place that prides itself on its service. DAWN (long, graying\n          hair, glasses, moccasins) greets them with a smile:\n          \n                              DAWN\n                    Can I help you? (realizing) Wait,\n                    it can't be...\n          \n          She looks behind her at a bulletin board. At photos of all\n          the happy couples who have passed through her. And finds: A\n          PHOTO OF MILO AND CASS, ARMS AROUND EACH OTHER, DRINKING\n          CHAMPAGNE, CASS SHOWING OFF AN ENGAGEMENT RING.\n          \n                              DAWN\n                        (to the back room)\n                    Edmund, come quick!\n          \n          A balding man in flannel comes out, takes one look, and\n          clasps both hands to his chest.\n          \n                              EDMUND\n                    Be still my beating heart.\n          \n                              MILO\n                        (LOW)\n                    Looks like they remember us.\n          \n                                 CASS\n                        (SAME)\n                    Ya think?\n          \n                              EDMUND\n                    What a lovely surprise. It's been,\n                    what, 3 years?\n          \n          Milo and Cass both try to downplay:\n          \n                                 MILO\n                    Has it?\n          \n                              CASS\n                    I don't really remember...\n          \n                              DAWN\n                        (REALIZING)\n                    And you came back! To celebrate\n                    your anniversary!\n          \n                              CASS\n                    Oh, no. No, no...\n          \n                                                                  76.\n          \n          \n                              EDMUND\n                    What an honor for us!\n          \n                              CASS\n                    Actually, we're not...\n          \n                               DAWN\n                    You know what? In light of this\n                    special special occasion: it's on\n                    the house!\n          \n          Before Cass can protest more, MILO GRABS HER ARM.\n          \n                              MILO\n                    Honey? Can I talk to you?\n          \n          He pulls her slightly aside.\n          \n                              MILO\n                        (LOW)\n                    You have any money?\n          \n                               CASS\n                        (SAME)\n                    No, as you recall, I gave you all\n                    my money at the blackjack table...\n                    (realizing) You blew all the money!\n          \n                              MILO\n                    Hey! I would have won it back if\n                    someone hadn't tasered me in the\n                    bathroom!\n          \n                              CASS\n                    So. Use a credit card.\n          \n                              MILO\n                    Mine's max'd. Lemme have yours.\n          \n                              CASS\n                    Mine's max'd too. (off his look)\n                    What, I like to shop.\n          \n          They give each other a horrified look as they both realize\n          what this means. Then they turn back to the couple, put their\n          arms around each other, and smile:\n          \n                              MILO/CASS\n                    It's our third anniversary!\n          \n                              DAWN/EDMUND\n                    Congratulations!\n          \n                                                                  77.\n          \n          \n                                 MILO/CASS\n                    Thanks!\n          \n          Milo and Cass snuggle closer. He surreptitiously squeezes her\n          ass. She surreptitiously STOMPS on his foot.\n          \n          \n          INT LUXURY B&B DINING-ROOM- EVENING\n          \n          Full of couples in love. Young couples, old couples, gay\n          couples, straight couples. Even a dog couple snuggled up by\n          the fire.\n          \n          And then there's Milo and Cass, bruised and dishevelled,\n          being served an elaborate romantic meal. They smile\n          uncomfortably as Edmund arrives with a tray of oysters:\n          \n                              EDMUND\n                    To begin: a little aphrodisiac!\n          \n          He gives them both a broad wink.\n          \n                                 MILO\n                           (GRIMLY)\n                    Wow.\n          \n                                 CASS\n                        (SAME)\n                    Great.\n          \n                              EDMUND\n                    So tell me: how have you managed to\n                    keep the romance alive all this\n                    time?\n          \n                              MILO\n                    Well, I'll tell you, Edmund.\n                    The secret to our success is that\n                    the little woman here knows her\n                    place. She cleans for me, cooks for\n                    me, and every night when I come\n                    home she gets down on her knees and\n                    massages my feet.\n          \n          He beams at Cass. Cass grins through her teeth.\n          \n                              CASS\n                    Yes, Edmund, it's true. I massage\n                    his feet to help him feel like a\n                    man. It's important, especially\n                    when your husband has such a teeny\n                    tiny...\n          \n          Just then, Dawn hustles over, interrupting:\n          \n                                                                 78.\n          \n          \n                              DAWN\n                    How is everything? Is it like that\n                    magical night 3 years ago?\n          \n                              CASS\n                    Uh-huh.\n          \n                              MILO\n                    Yup. You betcha.\n          \n                              DAWN\n                    This calls for a toast!\n          \n          She raises a glass, tapping it with a spoon. Milo and Cass\n          both groan under their breath.\n          \n                              DAWN\n                        (to the room)\n                    May I have your attention please?\n                    Edmund and I would like to share\n                    with you the most romantic moment\n                    we have ever seen. It was three\n                    years ago today, in this very\n                    restaurant, when this lovely young\n                    man here, right in the middle of\n                    the meal, threw down his napkin,\n                    got down on one knee, and said\n                    marry me, right now, right this\n                    second, I want to go to sleep\n                    tonight knowing you're my wife!\n          \n                              EDMUND\n                        (jumping in)\n                    And she said yes, with tears in her\n                    eyes and a tremble in her hand,\n                    let's get married, and they ran out\n                    to the all night chapel and came\n                    back an hour later, man and wife!\n          \n          The whole restaurant starts clapping. Milo turns to Edmund:\n          \n                              MILO\n                    Can I get a whiskey?\n          \n                              CASS\n                    Make that two.\n          \n          \n          INT LUXURY B&B HALLWAY- NIGHT\n          \n          Milo and Cass stumble down the hall, laughing hysterically,\n          falling down drunk.\n          \n                                                                  79.\n          \n          \n                              MILO\n                    After we broke up, I was so mad at\n                    you, I told everyone I know you\n                    have herpes.\n          \n                               CASS\n                    I told everyone you flunked out of\n                    3rd grade.\n          \n                               MILO\n                    I told everyone you have a\n                    moustache.\n          \n                              CASS\n                    I told everyone you like to wear my\n                    panties.\n          \n                              MILO\n                    Hey!\n          \n          This one is obviously true. Both laugh harder.\n          \n          \n          INT LUXURY B&B HONEYMOON SUITE- NIGHT\n          \n          Milo and Cass stagger in, blinking hazily at their new\n          surroundings. A heart-shaped bed. Champagne. A bubble bath. A\n          fireplace. The works. Like Cupid threw up in here.\n          \n          The laughter slowly fades. Long beat. Then:\n          \n                              CASS\n                    Wow. This would be really awkward\n                    if we still had feelings for each\n                    other. Which we don't...\n          \n                              MILO\n                    That's right. Luckily, we're\n                    different people now. We don't feel\n                    the way we used to.\n          \n                              CASS\n                    Right. We've moved on.\n          \n                              MILO\n                    We have no feelings about each\n                    other whatsoever.\n          \n                              MILO\n                    Just two people who used to know\n                    each other.\n          \n                              CASS\n                    Two casual acquaintances.\n          \n                                                                 80.\n          \n          \n                                 MILO\n                       Feels good, doesn't it?\n          \n                                 CASS\n                       Feels fantastic.\n          \n                                 MILO\n                       A platonic relationship. Working\n                       together.\n          \n                                 CASS\n                       Helping each other.\n          \n                                 MILO\n                       Trusting each other.\n          \n          Which reminds them: THEY DON'T TRUST EACH OTHER. Awkward\n          pause. Then:\n          \n                                 CASS\n                       Well. Mind if I shower?\n          \n                                 MILO\n                       Ladies first.\n          \n          Cass disappears into the bathroom, closing the door behind\n          her. Beat. Then MILO HURRIES OVER TO THE DOOR AND LISTENS.\n          \n          \n          INT LUXURY B&B BATHROOM- NIGHT\n          \n          CASS IS PRESSED ON HER SIDE OF THE DOOR, ALSO LISTENING. She\n          reaches over and turns on the shower.\n          \n          \n          INT LUXURY B&B HONEYMOON SUITE- NIGHT\n          \n          As soon as Milo hears the water, HE HURRIES OVER TO THE BED\n          WHERE CASS LEFT HER PURSE. HE STARTS DIGGING THROUGH IT.\n          \n          MEANWHILE:\n          \n          \n          INT LUXURY B&B BATHROOM- NIGHT\n          \n          Cass is seated on the toilet lid, HUNCHED OVER HER PHONE:\n          \n                                 CASS\n                           (LOW)\n                       Hey. It's me.\n          \n                                 MOM (O.S.)\n                       Sheryl?\n          \n                                                                    81.\n          \n          \n          SPLIT-SCREEN\n          \n          Mom is at a gay bar, having a cocktail.\n          \n                                 CASS\n                       No, not Sheryl. Cass. (beat) Your\n                       daughter.\n          \n                                 MOM\n                       Jesus Christ, where the hell are\n                       ya, Niagara Falls?\n          \n                                 CASS\n                       No. You're not gonna believe this,\n                       but: I'm at Cupid's Cabin with\n                       Milo.\n          \n                                 MOM\n                           (GASPING)\n                       Oh my god...\n          \n                                 CASS\n                       Mom...\n          \n                                 MOM\n                       I always knew you two would...\n          \n                                 CASS\n                       Mom. We're not back together.\n          \n          Long beat.\n          \n                                 MOM\n                       Why the hell not?\n          \n          \n          INT LUXURY B&B HONEYMOON SUITE- NIGHT\n          \n          Milo is looking through Cass' purse. HE KNOWS SHE WAS HIDING\n          SOMETHING FROM HIM AT THE CASINO. While searching through her\n          wallet, he suddenly stumbles across A WEDDING PHOTO OF\n          HIMSELF AND CASS.\n          \n          Huh. He glances at the bathroom door. She carries their\n          wedding photo around?\n          \n          \n          INT LUXURY B&B BATHROOM- NIGHT\n          \n          Cass listens while Mom rants:\n          \n                                                                  82.\n          \n          \n                              MOM\n                    I mean, I just don't get it, you're\n                    in this romantic place, you have a\n                    perfect opportunity to win him\n                    back...\n          \n                              CASS\n                    Why should I have to win him back?\n                    He should have to win me back! And\n                    who says I want him back, anyway?\n          \n                              MOM\n                    I have never understood this\n                    competitive streak of yours...\n          \n                              CASS\n                        (losing her patience)\n                    Look, the reason I called: I\n                    remember you worked at this one\n                    place where they had these bright\n                    green matches with, like, this\n                    silhouette of a horse on them?\n          \n                              MOM\n                        (immediately defensive)\n                    That was a long time ago! And all I\n                    did was serve drinks...\n          \n                              CASS\n                    I just need to know the name of the\n                    place.\n          \n                              MOM\n                    Charley's. And Ok, I admit, maybe I\n                    did a little dancing, but how often\n                    do you make 200 an hour in tips?\n          \n                              CASS\n                    I gotta go.\n          \n                              MOM\n                    I want grandkids!\n          \n          Cass hangs up. She sits for a moment, staring at her phone.\n          Is her mother right? Is she making a mistake right now? She\n          looks around the bathroom. Candles, flowers, thick robes.\n          \n          A bottle of champagne chilling by the heart-shaped tub. She\n          slowly stands and checks herself out in the mirror, brushing\n          back her hair with her hands.\n          \n          Suddenly, on impulse, she grabs the bottle of champagne and\n          two glasses. WHAT THE HELL, WHY NOT?\n          \n                                                                    83.\n          \n          \n          They're here, maybe they should seize the moment. She peeks\n          out the bathroom door and sees...\n          \n          \n          INT LUXURY B&B SUITE- NIGHT\n          \n          MILO, DIGGING THROUGH HER PURSE, FINDING THE MATCHES...\n          \n                              MILO\n                        (to himself)\n                    Sneaky bitch.\n          \n          \n          INT BATHROOM- NIGHT\n          \n          Cass is disappointed and vindicated all at once. She puts the\n          champagne back.\n          \n                              CASS\n                        (to herself)\n                    Sneaky bastard.\n          \n          \n          INT LUXURY B&B SUITE- NIGHT\n          \n          Milo hears the water go off. HE POCKETS THE MATCHES, tosses\n          the purse away and lies on the bed, striking a casual pose.\n          \n          Cass emerges.\n          \n                              MILO\n                    Good shower?\n          \n                                CASS\n                    The best.\n          \n                                MILO\n                    Great.\n          \n                              CASS\n                    You know what's great? Trusting\n                    each other.\n          \n                                MILO\n                    I agree.\n          \n          He holds up the handcuffs:\n          \n                              MILO\n                    Time for bed!\n          \n          MUSIC KICKS IN: \"Silent Night\".\n          \n                                                                  84.\n          \n          \n          INT LUXURY B&B SUITE- NIGHT\n          \n          SNOW IS FALLING OUTSIDE. PAN FROM THE WINDOW, ACROSS THE ROOM\n          TO THE BED, ACROSS A SNORING MILO TO CASS, EYES CLOSED, HAND\n          CUFFED TO THE HEADBOARD.\n          \n          Suddenly, CASS' EYES SNAP OPEN. She sits up a little and\n          glances over at MILO'S NIGHT TABLE WHERE HE LEFT THE KEYS AND\n          GUN IN PLAIN VIEW. She smiles...\n          \n          \n          INT LUXURY B&B SUITE- TEN MINUTES LATER\n          \n          Cass is doing a slow, careful, ACROBATIC CLIMB ACROSS MILO'S\n          BODY in an attempt to reach the gun without waking Milo up.\n          She puts a hand on the headboard. She is lifting her knee\n          over him, when he stirs.\n          \n          She freezes, waiting for him to settle. It's like playing\n          Twister, only if the person you're playing with finds out,\n          HE'S GOING TO KILL YOU.\n          \n          She manages to get herself STRADDLING HIM, arms stretched,\n          THE GUN ALMOST WITHIN REACH, when:\n          \n                                 MILO\n                    Excuse me.\n          \n          Cass FREEZES.\n          \n                              MILO\n                    What are you doing?\n          \n          She looks down. Milo is watching her, wide awake. Hmm. This\n          is going to be a tough one to explain.\n          \n                                 CASS\n                    Um...\n          \n                              MILO\n                    Are you trying to seduce me?\n          \n                              CASS\n                        (SWALLOWING)\n                    Yes. Yes I am.\n          \n          She tries to reach for the gun while they talk.\n          \n                              MILO\n                        (INNOCENTLY)\n                    I didn't know you were still so\n                    attracted to me. I mean, I remember\n                    how you used to like to greet me at\n                    the door in nothing but a...\n          \n                                                                    85.\n          \n          \n                              CASS\n                        (INTERRUPTING)\n                    Yes, it's true, I'm still attracted\n                    to you.\n          \n          Her hand is groping around blindly, where the fuck is it? She\n          stretches more, bringing her face even closer to Milo's.\n          \n                               MILO\n                    Really? Wow. That's great news. You\n                    know what would be really sexy\n                    right now?\n          \n          Uh-oh.\n          \n                              CASS\n                    If we both just went to sleep?\n          \n                              MILO\n                    No. If you talked dirty to me.\n          \n          The gun seems to be getting father away. THEIR LIPS ARE\n          ALMOST TOUCHING NOW...\n          \n                              CASS\n                    Ok. (in a sexy voice) Sewage. Mold.\n                    Rotting carcass...\n          \n                              MILO\n                    No, I mean, tell me about your\n                    attraction to me.\n          \n                              CASS\n                    Um...I can't stop thinking about\n                    you.\n          \n                              MILO\n                    Really? What part of me?\n          \n                              CASS\n                    Just...all of you.\n          \n                              MILO\n                    Be specific.\n          \n          Cass blushes fiercely. If she didn't want that gun so bad...\n          \n                              MILO\n                        (HELPFULLY)\n                    My great hair? My chest?\n                    Or...something lower like...\n          \n          He reaches down and WHIPS OUT:\n          \n                                                                 86.\n          \n          \n                                MILO\n                    My gun?\n          \n          THE GUN IS IN HIS HAND. That's why she couldn't reach it. HE\n          KNEW WHAT SHE WAS UP TO THIS WHOLE TIME. She flips off him\n          and back onto her side. Milo sits up, flipping on the lights.\n          \n                              MILO\n                    I knew I couldn't trust you!\n          \n                              CASS\n                    I knew I couldn't trust you!\n          \n                              MILO\n                    When were you gonna tell me about\n                    the matches you found back there in\n                    the hotel room?\n          \n                              CASS\n                    When were you gonna tell me you\n                    have no intention of helping me\n                    with my story?\n          \n                              MILO\n                        (SHRUGGING)\n                    You're right. I'm not helping you.\n                    This is my story now. This time I\n                    get to come out on top! Karma,\n                    babe. K-a-r-m-a. Karma....\n          \n                              CASS\n                    Oh my god, would you get over it\n                    already! So I cracked the case\n                    before you did, it was 3 years ago,\n                    it happened, stop being such a baby\n                    and move on!\n          \n                               MILO\n                    Oh I'm moving on. You know how I'm\n                    moving on? By cracking this case\n                    before you, then taking you in so\n                    you can spend this Xmas in jail,\n                    all alone.\n          \n          He rolls over, turning his back to her. Cass stares at the\n          ceiling, fuming.\n          \n          \n          EXT CHARLEY'S- DAWN\n          \n          A strip club on the boardwalk. MOVING IN ON THE BACK DOOR...\n          \n                                                                   87.\n          \n          \n          INT CHARLEY'S STORAGE ROOM- NIGHT\n          \n          Jimmy, tied to a chair, watches nervously as MAHLER TAKES\n          EVIDENCE BOXES THAT ARE STACKED ALONG THE WALLS AND MOVES\n          THEM ONTO A MOVER'S DOLLY.\n          \n                              JIMMY\n                    So this is your place, huh? Nice.\n                    Cozy. Probably more fun to sit\n                    where you can actually see the\n                    dancers, but...\n          \n          Mahler has all the boxes loaded up. He grabs a rag and\n          approaches Jimmy.\n          \n                              JIMMY\n                    Oh. Hey, listen, no need for that,\n                    I swear I'll be as quiet as a\n                    mouse.\n          \n          Mahler gags him, THEN PUNCHES HIM IN THE FACE. JIMMY SLUMPS\n          OVER.\n          \n                              MAHLER\n                    I know you will.\n          \n          Mahler grabs the dolly, flicks off the lights, and EXITS OUT\n          THE BACK DOOR.\n          \n          \n          INT LUXURY B&B DINING ROOM- DAY\n          \n          CHIRON: \"2:00PM. ROUTE 9 NORTH. 19 HOURS TO GO.\"\n          \n          Cass is in a booth, handcuffed, her mouth set, her face grim.\n          No more Mr Nice Guy. She is scheming her way out.\n          \n          RACK TO MILO, SEVERAL PACES AWAY, ON THE PHONE WITH TERESA,\n          keeping one eye on Cass:\n          \n                              MILO\n                    I'm just curious.\n          \n          SPLIT-SCREEN:\n          \n          Teresa at her desk, sipping eggnog.\n          \n                               TERESA\n                    No, I do not keep my ex's photo in\n                    my wallet.\n          \n          Sid passes through, kids in tow, and carrying A HUGE, TANGLED\n          BALL OF XMAS LIGHTS. Sid looks like he wants to put a bullet\n          through his brain.\n          \n                                                                    88.\n          \n          \n          Teresa mouths \"Milo\". Sid picks up the other extension.\n          \n                              SID\n                    What's the problem now?\n          \n                              MILO\n                    No problem...\n          \n                              TERESA\n                    She keeps their wedding photo in\n                    her wallet. He wants to know what\n                    that means.\n          \n                              SID\n                    It means she's madly in love with\n                    you.\n          \n                              MILO\n                    Really?\n          \n                              SID\n                    No, you idiot, it means she hasn't\n                    cleaned out her wallet in 3 years.\n                    I'm pretty sure I'm still carrying\n                    around a condom from 1987. (to one\n                    of the kids) Son of a bitch,\n                    Jeremy, don't eat things you find\n                    on the floor.\n          \n                              TERESA\n                    I think it means she loves him.\n          \n                              MILO\n                    Really? Cause it did make me\n                    wonder...\n          \n                              SID\n                    Why do you care? Listen to me: you\n                    hate this girl, remember? You drank\n                    yourself out of a job over this\n                    girl.\n          \n                              MILO\n                    I quit my job.\n          \n                              SID\n                    You were fired.\n          \n                              MILO\n                    I quit by getting myself fired.\n          \n                              TERESA\n                    Are you sleeping with her?\n          \n                                                                  89.\n          \n          \n                              SID\n                    Teresa, get off the line. I knew I\n                    should have sent Doug. Milo, do me\n                    a favor. Don't call me again until\n                    you get her to jail.\n          \n          CLICK. Sid hangs up. Milo turns to see Cass CONFERRING WITH\n          DAWN.\n          \n                              MILO\n                        (to himself)\n                    Shit.\n          \n          \n          INT BOOTH- LATE MORNING\n          \n          Milo joins Cass. Re: Dawn:\n          \n                              MILO\n                    What was that about?\n          \n                              CASS\n                    Nothing. I had her add mayo to your\n                    burger. I remember you like that.\n          \n          Milo glances at Dawn and she nods in confirmation.\n          \n                              MILO\n                    Oh. (surprised) Thanks.\n          \n          Milo takes a bite from his burger and considers Cass.\n          \n                              MILO\n                    Ok, look: I know you're probably\n                    upset that you're not gonna get the\n                    story. But a person can't win every\n                    time, right?\n          \n                              CASS\n                    Depends on the person.\n          \n                              MILO\n                    Whadya mean?\n          \n                              CASS\n                    Well, if the person you're\n                    referring to is you, I agree: you\n                    can't win every time.\n          \n          Suddenly, MILO GETS A FUNNY LOOK ON HIS FACE.\n          \n                              CASS\n                        (INNOCENTLY)\n                    What's wrong?\n          \n                                                                    90.\n          \n          \n                              MILO\n                        (choking a little)\n                    This burger...\n          \n                              CASS\n                    One day stuff like that is gonna\n                    kill ya. (pause) Who knows? Maybe\n                    even today.\n          \n                              MILO\n                    My tug...is thwelling...(gasping)\n                    I tink dere might be sesame...\n          \n                              CASS\n                    Yeah, I had her add that with the\n                    mayo. Is that bad? Oh wait, you're\n                    violently allergic to sesame.\n                    Whoops. My bad.\n          \n          MILO'S FACE IS TURNING BRIGHT RED. HE GASPS FOR AIR. HE\n          SLOWLY SLIDES OFF HIS CHAIR ONTO THE FLOOR. Cass calmly\n          reaches across the table, taking his keys and unhandcuffing\n          herself.\n          \n          Car keys in hand, she bends down to whisper in his ear:\n          \n                              CASS\n                    You know what that is? \"Karma\". Oh,\n                    and, I'll get the story. Watch me.\n          \n          ...and heads for the door.\n          \n                              CASS\n                        (into her phone)\n                    911? Yeah, there's a guy here about\n                    to go into anaphylactic shock.\n                    Better hurry.\n          \n          \n          INT CADILLAC- DAY\n          \n          Cass drives along, on the phone with 411:\n          \n                              CASS\n                    Yeah, \"Charley's\". (listening) On\n                    the boardwalk? Great. Thanks.\n          \n          \n          INT LUXURY B&B PARKING LOT- DAY\n          \n          Next to an ambulance, Milo is unconscious on a stretcher. An\n          EMT prepares a HUGE SYRINGE, picks a spot on Milo's chest,\n          then PLUNGES THE NEEDLE INTO IT.\n          \n                                                                  91.\n          \n          \n          Milo JERKS up on a gurney, gasping for air.\n          \n                              EMT\n                    Relax. That was an adrenaline shot.\n          \n                              MILO\n                    I don't believe it. She tried to\n                    kill me.\n          \n          The EMT exchanges a look with the ambulance driver, then\n          helps Milo off the stretcher.\n          \n                              EMT\n                    No one tried to kill you, buddy.\n                    You just need to be more careful\n                    about what you eat.\n          \n                              MILO\n                    Thanks. Great tip.\n          \n          He checks his watch, then pulls out the GREEN MATCHBOOK:\n          \n                              MILO\n                    Know where this place is?\n          \n                              EMT\n                    Sure. Charley's, on the boardwalk.\n                    And just FYI: when they say \"don't\n                    touch\" the dancers, they mean with\n                    with any part of your body, not\n                    just your hands.\n          \n          The EMT folds the stretcher, loads it into the ambulance, and\n          THEY DRIVE AWAY, leaving Milo in the parking lot.\n          \n                              MILO\n                        (calling after them,\n                         SARCASTIC)\n                    Thanks for the ride, by the way.\n          \n          Milo starts trying handles of parked cars until he finds one\n          that's open and SLIPS INSIDE.\n          \n          \n          EXT ATLANTIC CITY BOARDWALK- AFTERNOON\n          \n          Cass pulls up, parks in a lot, and instantly spots CHARLEY'S\n          GREEN SIGN WITH THE BLACK HORSE SILHOUETTE, squeezed between\n          a burger place and a souvenir shop. She slips out of the car,\n          takes a careful look around, then works her way towards the\n          club.\n          \n                                                                     92.\n          \n          \n          INT CHARLEY'S- AFTERNOON\n          \n          POV OF THE FRONT DOOR, OPENING A CRACK, CASS PEEKING IN.\n          \n          CASS' POV- WOMEN DANCING, MEN DRINKING. Seedy and cheesy at\n          the same time. Cass thinks this over, then slowly lets the\n          door swing closed.\n          \n          \n          EXT BACK OF CHARLEY'S- AFTERNOON\n          \n          Cass finds the back entrance. THE DOOR IS BOLTED. She is\n          looking for a window to climb into, when she spots JIMMY'S\n          METS' HAT ON THE GROUND.\n          \n          Shit. Cass stares at the hat: JIMMY IS HERE SOMEWHERE. She\n          presses her ear up against the back door:\n          \n                              CASS\n                        (SOFTLY)\n                    Jimmy?\n          \n          Suddenly, SHE HEARS GROANING COMING FROM INSIDE. Or grunting.\n          LIKE SOMEONE TRYING TO CALL OUT THROUGH A GAG. She looks\n          around. There is a window higher up on the wall. Cass drags a\n          trash can beneath the window, stacks another one on top of\n          it, and cautiously climbs up.\n          \n          The window is locked and she can't see through it. Hmm. Fuck\n          it. She takes her purse and SMASHES a pane of glass.\n          \n          She wobbles on trash cans and GRABS THE WINDOWSILL JUST AS\n          THE CANS FALL AWAY, LEAVING HER DANGLING.\n          \n          \n          INT CHARLEY'S STORAGE ROOM- AFTERNOON\n          \n          Jimmy is staring nervously up at the broken window. He can\n          see hands and can hear someone cursing under their breath.\n          The top of a head appears, then a face: IT'S CASS.\n          \n          Relieved, Jimmy starts gesturing excitedly for her to come\n          in. Cass climbs in, drops to the floor, hurries over to Jimmy\n          and ungags him.\n          \n                              JIMMY\n                    Untie me, quick, that psychopath is\n                    gonna be back here any second...\n          \n          \n          EXT BACK OF CHARLEY'S- MOMENTS LATER\n          \n          Cass peeks out the door, then gestures for Jimmy to follow.\n          \n                                                                     93.\n          \n          \n          EXT ATLANTIC CITY BOARDWALK- AFTERNOON\n          \n          Cass and Jimmy are hurrying to the Cadillac...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          Cass and Jimmy climb in...\n          \n                              CASS\n                    So what the hell is \"Sparrow\"?\n          \n          ...but before Jimmy can answer:\n          \n                              DWIGHT (O.S.)\n                    I have a better question...\n          \n          Cass looks in the rearview mirror. SHIT: DWIGHT AND RAY ARE\n          IN THE BACKSEAT, POINTING GUNS AT THE BACK OF THEIR HEADS.\n          \n                              DWIGHT\n                    Where the fuck is Milo?\n          \n          Jimmy almost bursts into tears.\n          \n                              JIMMY\n                    You know what? I think I'll get a\n                    real job. Work at Kinko's. Or\n                    Burger King. That doesn't sound so\n                    bad anymore...\n          \n                              RAY\n                        (INTERRUPTING)\n                    Hey. Who the fuck are you?\n          \n                              JIMMY\n                    Nobody.\n          \n                              RAY\n                    Right. So what the fuck are you\n                    doing in this car?\n          \n          Jimmy glances back at them. Do they mean he can just...?\n          \n                              DWIGHT\n                        (spelling it out)\n                    Run, you jackass.\n          \n          Jimmy gives Cass a quick look (\"sorry\"), then exits the car\n          and TAKES OFF RUNNING DOWN THE BOARDWALK. CASS CAN'T BELIEVE\n          IT. She drops her forehead into the steering wheel in\n          despair.\n          \n                                                                  94.\n          \n          \n          EXT HIGHWAY- AFTERNOON\n          \n          Milo is driving along in a stolen Volvo, cables hanging under\n          the steering wheel from where he hot-wired it. He is just\n          coming up on the boardwalk when his phone rings.\n          \n                              MILO\n                        (ANSWERING)\n                    What do you want, you crazy bitch?\n          \n          \n          INT CHARLEY'S- AFTERNOON\n          \n          Cass is seated in a booth with Dwight and Ray. Into phone:\n          \n                              CASS\n                    What kind of asshole runs up a\n                    gambling debt with a bunch of\n                    Neanderthals...\n          \n                              RAY\n                    That's not what I told you to say.\n          \n          Ray grabs the phone away from her. Into phone:\n          \n                              RAY\n                    As you can see: we have your\n                    girlfriend.\n          \n                              CASS\n                        (LOUDLY)\n                    And I'm not his girlfriend.\n          \n                              MILO\n                    Oh, she's my girlfriend alright.\n                    But fair is fair: you guys can keep\n                    her.\n          \n          CLICK. Ray stares at the phone. In disbelief:\n          \n                              RAY\n                    I think he hung up.\n          \n                               CASS\n                    He what?\n          \n                              DWIGHT\n                        (grabbing the phone)\n                    Gimme that.\n          \n                                                                    95.\n          \n          \n          EXT ATLANTIC CITY BOARDWALK- AFTERNOON\n          \n          Milo is pulling up. Sees Charley's. Then SEES HIS OWN CAR. He\n          glances around: CASS MUST BE AROUND HERE SOMEWHERE.\n          \n          His phone rings again.\n          \n                              MILO\n                    Hello, Lucky's Libations!\n          \n          \n          SPLIT-SCREEN:\n          \n          Dwight tries to explain:\n          \n                              DWIGHT\n                    Look, Milo, I don't think you\n                    understand: we're gonna hurt her.\n          \n          Milo hears MUSIC COMING FROM DWIGHT'S END. DANCE MUSIC.\n          SLEAZY MUSIC. UNMISTAKABLY STRIP-CLUB MUSIC.\n          \n          He heads for CHARLEY'S. Into phone:\n          \n                              MILO\n                    Oh, I understand, alright, and I\n                    don't blame ya. I want to hurt her\n                    all the time.\n          \n          Cass grabs the phone from Dwight. Into phone:\n          \n                              CASS\n                    Milo, listen, they're not kidding,\n                    Ok?\n          \n          \n          INT CHARLEY'S- CONTINUOUS\n          \n          Milo slips inside and scans the room. HE SEES CASS IN A BOOTH\n          ACROSS THE ROOM WITH DWIGHT AND RAY. Into phone:\n          \n                              MILO\n                    Ok. Fine. Say you were wrong.\n          \n          Cass hesitates. Into phone:\n          \n                                CASS\n                    For what?\n          \n                              MILO\n                    For what? For poisoning me with\n                    sesame and almost killing me!\n          \n          Beat.\n          \n                                                               96.\n          \n          \n                              CASS\n                    Ok. Maybe that was not the best...\n          \n                              MILO\n                    Say you were wrong.\n          \n                              CASS\n                    I could have found a more mature...\n          \n                              MILO\n                    Say you were wrong.\n          \n                              CASS\n                    I was possibly out of line...\n          \n                              MILO\n                    Say you were wrong.\n          \n                              CASS\n                        (blurting out)\n                    Ok, ok, I was wrong!\n          \n                              MILO\n                    Ok. Now. Admit that the only reason\n                    you were able to crack that case\n                    three years ago was because you\n                    looked through my files.\n          \n          Long pause.\n          \n                                CASS\n                    What?\n          \n                              MILO\n                    I think I'll hang up now...\n          \n                              CASS\n                        (QUICKLY)\n                    Ok, Ok. I looked through your\n                    files. Are you happy?\n          \n                              MILO\n                    Thrilled. Now tell them I'll be\n                    there in 20 minutes. Meanwhile,\n                    stop shifting in your seat like\n                    that and just tell them you have to\n                    use the bathroom.\n          \n          Cass sits up straighter. Wait a second, he's here?\n          \n                              MILO\n                    Don't look around. Just do it.\n          \n          CLICK. He hangs up.\n          \n                                                                    97.\n          \n          \n          CLOSE ON- THE BOOTH.\n          \n                              CASS\n                    You boys mind if I use the ladies\n                    room?\n          \n          \n          INT BATHROOM- MOMENTS LATER\n          \n          Cass enters. Milo is behind the door. He SLAMS the door\n          closed after she is in, and blocks her escape.\n          \n                              MILO\n                    You know what my mistake was? I\n                    never should have let you out of\n                    the trunk. I'm fine, by the way.\n                    The doctor said I may have been\n                    technically dead for a few seconds,\n                    but I'm fine now.\n          \n          Cass is not impressed. She stares at him coldly.\n          \n                              CASS\n                    So that's what you really think?\n                    That I stole information from you?\n          \n                              MILO\n                    It's not what I think, it's what I\n                    know. How else did you beat me?\n          \n                              CASS\n                        (as though to a 5 yr old)\n                    Did it ever occur to you that I\n                    just might be good at my job?\n          \n          Milo stares at her. Huh. It actually didn't occur to him...\n          \n                              CASS\n                    That's what I thought. You know\n                    what, Milo? You're an even bigger\n                    asshole than I previously\n                    suspected, and you deserve\n                    everything that's happened to you.\n                    (beat) And everything that's about\n                    to happen to you.\n          \n          \"About to happen\"? Milo is just starting to realize...\n          \n                              MILO\n                    You wouldn't...\n          \n                              CASS\n                        (SCREAMING)\n                    MILO BOYD IS IN HERE!\n          \n                                                                  98.\n          \n          \n          Son of a bitch. The bathroom door SHOOTS open and DWIGHT AND\n          RAY ENTER. They back Milo into a corner. Cass smiles at Milo,\n          waves, and exits.\n          \n          \n          EXT CHARLEY'S- AFTERNOON\n          \n          Cass comes flying out of the club and runs right into:\n          MAHLER. HE TAKES ONE LOOKS AT HER AND PUSHES HER BACK INSIDE.\n          \n          \n          INT BATHROOM- AFTERNOON\n          \n          Dwight and Ray are frisking Milo, taking away his array of\n          weapons.\n          \n                              DWIGHT\n                    Wow. You always carry this much\n                    gear?\n          \n                              MILO\n                    Only during the holidays.\n          \n          \n          INT CHARLEY'S- CONTINUOUS\n          \n          Milo is pushed out of the bathroom, and comes face to face\n          with CASS. MAHLER APPEARS FROM BEHIND HER, TAKES ONE LOOK AT\n          MILO AND POINTS HIS GUN AT MILO'S HEAD.\n          \n                              MAHLER\n                    Remember me?\n          \n                              DWIGHT\n                    What the fuck?\n          \n          Dwight steps forward from behind Milo, AND POINTS HIS GUN AT\n          MAHLER. MAHLER REACTS, SHIFTING THE GUN TO DWIGHT. RAY STEPS\n          UP, GUN POINTED AT MAHLER.\n          \n          Momentary stand-off. Stuck between the bad guys, MILO AND\n          CASS GIVE EACH OTHER EVIL LOOKS.\n          \n          A half-naked dancer appears:\n          \n                                DANCER\n                    Lapdance?\n          \n          Everyone looks at her. She is just realizing...\n          \n                              DANCER\n                    Maybe I should come back later...\n          \n                                                                    99.\n          \n          \n          ...WHEN MILO AND CASS SIMULTANEOUSLY MAKE THEIR MOVES, CASS\n          STOMPING ON MAHLER'S FOOT, CAUSING HIM TO LOOSEN HIS HOLD ON\n          HER, MILO SLAMMING HIS ELBOW BACK ONTO RAY'S ABDOMEN.\n          \n          RAY'S GUN GOES OFF AS CASS AND MILO BOTH HIT THE FLOOR.\n          MAHLER REACTS, FIRING AT RAY. DWIGHT FIRES AT MAHLER...\n          \n          TOTAL PANDEMONIUM. Girls screaming, patrons running for the\n          exit.\n          \n          MAHLER AND DWIGHT BOTH GET HIT. Milo crawls over to a moaning\n          Dwight and recovers his gun. He looks up in time to see CASS\n          DISAPPEARING OUT THE FRONT DOOR.\n          \n          \n          EXT BOARDWALK- AFTERNOON\n          \n          Milo comes out. THE BOARDWALK IS PACKED, CASS IS LOST IN THE\n          CROWD. Milo raises his gun in the air and FIRES. People duck\n          and scatter REVEALING CASS, climbing into the Cadillac.\n          \n          SIRENS...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          Cass jumps into the car and hits the gas. She is pulling\n          away, victorious, WHEN THERE IS A SOUND ON THE ROOF.\n          \n          MILO'S FACE APPEARS, UPSIDE-DOWN, IN THE WINDSHIELD,\n          GRINNING.\n          \n                                CASS\n                      Get off the car, Milo.\n          \n          He gives her the finger.\n          \n                                CASS\n                      Get off the car, you psychopath.\n          \n                                MILO\n                      Oh, I am a psychopath, and you know\n                      why? Cause you made me that way.\n                      And if I'm going crazy, I'm taking\n                      you with me.\n          \n          He reaches a hand through the driver's window, grabbing at\n          her. Cass SCREAMS, squeezes her eyes shut and HITS THE GAS.\n          \n          MORE SIRENS, RAPIDLY APPROACHING...\n          \n                                                                    100.\n          \n          \n          EXT HIGHWAY- AFTERNOON\n          \n          THE CAR IS WEAVING CRAZILY, MILO SLIDING BACK AND FORTH\n          ACROSS THE ROOF...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          Cass opens her eyes. MILO IS HALFWAY IN THE PASSENGER WINDOW.\n          \n                                 CASS\n                     AAHHH!!\n          \n                                 MILO\n                     AAHHH!!\n          \n          Milo falls into the car, grabbing at the wheel. They fight\n          for control of the car as it goes spinning off the road...\n          \n          \n          EXT TREES- AFTERNOON\n          \n          The Cadillac skids wildly, COMPLETELY OUT OF CONTROL...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          THEY WRESTLE FOR CONTROL...\n          \n                                 MILO\n                     LET GO...\n          \n                               CASS\n                     NO, YOU LET GO...\n          \n          \n          INT CADILLAC- AFTERNOON\n          \n          TREES...ROCKS...SNOWBANKS...DITCHES...FINALLY, MILO MANAGES\n          TO SLAM ON THE BRAKES AND THE CAR SKIDS TO A HALT JUST INCHES\n          FROM A CLIFF.\n          \n          Silence.\n          \n          \n          EXT BOARDWALK- EARLY EVENING\n          \n          Cops everywhere, Dwight and Ray leaning over the hood of a\n          squad car, being handcuffed, MAHLER UNCONSCIOUS ON A\n          STRETCHER.\n          \n          A BYSTANDER IS TALKING TO A COP, DESCRIBING:\n          \n                                                                   101.\n          \n          \n                              BYSTANDER\n                    It was an old Cadillac, this crazy\n                    girl driving, and the guy was like,\n                    on the roof...\n          \n          \n          INT CADILLAC- EARLY EVENING\n          \n          CHIRON: \"6:00 PM. ABOVE THE ATLANTIC OCEAN. 13 HOURS TO GO\".\n          \n          Cass and Milo both just sit there breathing for a moment.\n          Then Milo turns and glares at Cass, and THE LOOK ON HER FACE\n          SAYS SHE KNOWS EXACTLY WHAT'S COMING NEXT:\n          \n          \n          EXT TRUNK- EARLY EVENING\n          \n          CASS IS BACK IN THE TRUNK. Milo waves goodbye and SLAMS shut\n          the lid.\n          \n          IMMEDIATELY, HIS CELL PHONE RINGS. Milo glances at it, then\n          reluctantly answers:\n          \n                              MILO\n                    Yeah?\n          \n          \n          SPLIT-SCREEN:\n          \n          Bobby, ocean in the background, furious:\n          \n                              BOBBY\n                    What the fuck are you doing? I\n                    thought I told you to lie low.\n          \n                              MILO\n                    I was lying low...\n          \n                              BOBBY\n                    Yeah? Then how is it that a\n                    statewide all-points was just put\n                    out on the two of you?\n          \n                              MILO\n                        (SIGHING)\n                    It's a long story.\n          \n                              BOBBY\n                    Ok, look, you guys better come to\n                    me, I'll protect you til we figure\n                    this out. Can you get to Pier 19?\n          \n          Milo looks around. He can just make out Pier 19 in the\n          distance, a mile or two away.\n          \n                                                                 102.\n          \n          \n                                 MILO\n                       Yeah.\n          \n          \n          EXT PIER 19- EVENING\n          \n          Milo and Cass drive up in the Cadillac and park out of sight.\n          They exit the car and look around. The pier seems to be\n          deserted. Then they hear a soft motor, and BOBBY APPEARS IN A\n          MOTORBOAT.\n          \n                                 BOBBY\n                       Get in.\n          \n          \n          EXT OCEAN- EARLY EVENING\n          \n          The sound of a motorboat chugging along.\n          \n          \n          INT MOTORBOAT- EVENING\n          \n          Bobby is at the back of the boat, steering. Cass and Milo are\n          up front, explaining:\n          \n                                 CASS\n                       So, these guys have a bunch of\n                       stolen evidence stashed somewhere\n                       in Atlantic City...\n          \n                                 MILO\n                       And we think they're ditching it\n                       tonight.\n          \n          A SMALL YACHT APPEARS ON THE HORIZON. Bobby steers the\n          motorboat towards it. MILO AND CASS TURN TO LOOK AS THE YACHT\n          COMES INTO VIEW. AND AT THE SAME MOMENT, CASS AND MILO MAKE\n          OUT THE NAME ON THE SIDE OF THE BOAT:\n          \n          \"SPARROW\".\n          \n                                 BOBBY\n                           (CASUALLY)\n                       You know, if I was them, I'd store\n                       the evidence on a boat, drive the\n                       boat about 30 miles out, and blow\n                       the whole thing up.\n          \n          Cass and Milo both slowly turn to find BOBBY POINTING A GUN\n          AT THE TWO OF THEM. Off Milo's disappointed look:\n          \n                                 BOBBY\n                       Hey, man. I got mouths to feed.\n          \n                                                                 103.\n          \n          \n                              MILO\n                    Aw. That's what all the dirty cops\n                    say.\n          \n          Bobby quickly frisks Cass, and frisks and disarms Milo. He\n          steers the boat one-handed up next to the yacht and cuts the\n          motorboats engine.\n          \n          Milo makes a sudden LUNGE for Bobby and BOBBY CRACKS HIM OVER\n          THE BACK OF THE HEAD WITH THE BUTT OF THE GUN, SENDING MILO\n          SPRAWLING TO THE BACK OF THE BOAT, RIGHT ON TOP OF THE MOTOR.\n          \n          Milo struggles back up to a seated position.\n          \n                              BOBBY\n                    You've always been such a stubborn\n                    asshole, Milo. You just don't\n                    listen. All you had to do was stay\n                    where I told you and none of this\n                    would have happen. Now the two of\n                    you are gonna have to go down with\n                    the boat.\n          \n          \n          INT HULL OF YACHT- EVENING\n          \n          CHIRON: \"11:00 PM. ATLANTIC OCEAN. 10 HOURS TO GO\".\n          \n          PAN PAST PILES OF EVIDENCE BOXES FULL OF EVERYTHING\n          IMAGINABLE: GUNS, VIDEOTAPES, DRUGS, ETC...\n          \n          PAN PAST A PILE OF EXPLOSIVES WRAPPED WITH CABLE AND ATTACHED\n          TO A TIMER, COUNTING DOWN: \"1:59, 1:58, 1:57...\"\n          \n          PAN TO MILO AND CASS SEATED ON THE FLOOR, TIED TOGETHER, BACK\n          TO BACK, ARMS STRAPPED TO THEIR SIDES.\n          \n          PAN TO THE DOORWAY, where Bobby stands, inspecting the room.\n          \n                              BOBBY\n                    Ok. Guess that's it. Gotta go.\n                    (checking them out) You know what?\n                    You guys make a great couple.\n          \n          Bobby exits and Cass and Milo are alone.\n          \n          Suddenly, CASS STARTS GIGGLING.\n          \n                              MILO\n                    What's so funny?\n          \n                              CASS\n                    My mom was worried I wouldn't have\n                    plans for Xmas Eve.\n          \n                                                                    104.\n          \n          \n          Cass is laughing harder and harder until MILO REALIZES:\n          \n                              MILO\n                    Hey, are you crying?\n          \n                              CASS\n                        (SOBBING)\n                    No. I'm not...\n          \n          Milo doesn't know what to do. His hands are trapped in front\n          of him, he can't even pat her on the shoulder.\n          \n                              MILO\n                    Ok, just don't...\n          \n                              CASS\n                    I'm not crying.\n          \n                              MILO\n                    I know you're not.\n          \n                              CASS\n                    I just...(miserable) I can't\n                    believe I going to die by being\n                    blown up and sinking to the bottom\n                    of the ocean with someone who\n                    thinks I'm a total liar.\n          \n                              MILO\n                    We're not gonna die.\n          \n                              CASS\n                    Oh yeah? What's the plan?\n          \n                              MILO\n                        (THINKING)\n                    Well...\n          \n          Milo looks around. There is a SMALL PORTHOLE IN ONE WALL.\n          Milo assumes a take-charge manner:\n          \n                              MILO\n                    Ok. Here's what we do. We're going\n                    to synchronize our efforts in order\n                    to cross the room and manipulate\n                    the bomb out of the room and into\n                    the water in order to diffuse the\n                    explosive impact.\n          \n          Beat.\n          \n                              CASS\n                    You mean we're going to throw the\n                    bomb out the window?\n          \n                                                                105.\n          \n          \n                              MILO\n                    Uh, yeah. Or we can just wait to\n                    get blown up.\n          \n          CLOSE ON- THE TIMER: \"1:19, 1:18, 1:17...\"\n          \n                              CASS\n                        (QUICKLY)\n                    I'm with you. Go, team, go.\n          \n                              MILO\n                    That's the spirit. Ok, first we're\n                    going sideways: to the left...\n          \n          Milo leans one way, Cass leans the other: THEY DON'T MOVE.\n          \n                              MILO\n                    Ok. My left this time...\n          \n          They both lean to the left and topple over. Milo is facing\n          the direction of the bomb.\n          \n                              MILO\n                    Now we're gonna work our way over\n                    to the bomb.\n          \n          They start moving like a sideways inchworm, creeping along.\n          \n                              MILO\n                    And I don't think you're a total\n                    liar, but in my own defense, I was\n                    one of the top detectives in my\n                    division, I had been working that\n                    case for months, and then you just\n                    waltzed in and solved it.\n          \n                              CASS\n                    I didn't just \"waltz in\". You know\n                    I had been working it for months,\n                    too. Isn't it possible that we're\n                    both good at our jobs, and I just\n                    happened to come out ahead?\n          \n          Beat.\n          \n                              MILO\n                        (FUMBLING)\n                    Oh. Well, I...(blurting out) Look,\n                    I was confused, I had never been in\n                    love before!\n          \n                              CASS\n                    Well, neither had I!\n          \n                                                                    106.\n          \n          \n          Milo seems surprised to hear this. But before he can respond,\n          THE BOAT ROCKS ON A WAVE AND THEY ARE SENT ROLLING IN CASS'\n          DIRECTION. AS THEY ROLL:\n          \n                                CASS\n                    Ow...\n          \n                                MILO\n                    Shit..\n          \n                                CASS\n                    Dammit...\n          \n          They are stopped when MILO'S FACE IS SLAMMED INTO THE SIDE OF\n          THE BOAT. Milo lets out a grunt. Beat.\n          \n                                CASS\n                    Milo?\n          \n                              MILO\n                        (MUFFLED)\n                    I'm Ok. Ok, we need to turn to the\n                    right, and wait for the next wave.\n          \n          They both start turning separate ways:\n          \n                                MILO\n                    My right.\n          \n          They turn to the right and wait. After a moment:\n          \n                              MILO\n                    So. You were in love with me?\n          \n                              CASS\n                    Of course I was in love with you,\n                    why do you think I married you?\n          \n          No response. Behind her back, Milo looks sheepish. Cass\n          REALIZES:\n          \n                              CASS\n                    Oh. My. God. You think I married\n                    you so I could get info on the\n                    case? Who am I, Mata Hari?\n          \n          Milo looks confused. He is trying to figure out...\n          \n                              CASS\n                    She's a spy, Milo.\n          \n          Aaah.\n          \n                                                                 107.\n          \n          \n                              MILO\n                        (QUICKLY)\n                    I know that. Everybody knows that.\n                    Mata Hari the spy.\n          \n          Beat. Milo clears his throat.\n          \n                              MILO\n                    Well. It might be a little late for\n                    this. But...nice job on the\n                    article.\n          \n                              CASS\n                    You know, if I had something sharp\n                    right now, I would stab you.\n          \n                              MILO\n                    No, really, I mean, it was well-\n                    written and...\n          \n                              CASS\n                    Can you just get us out of here,\n                    please?\n          \n          Suddenly, A WAVE HITS THE BOAT, AND THEY GO ROLLING TOWARDS\n          THE BOMB. AS THEY ROLL:\n          \n                              CASS\n                    Umph...\n          \n                              MILO\n                    Ughh...\n          \n                              CASS\n                    Son of a...\n          \n                              MILO\n                    Ow...\n          \n          And they come to a stop, MILO'S FACE PRESSED RIGHT UP TO THE\n          BOMB. He watches the timer: \"00:44, 00:43, 00:42...\"\n          \n                              CASS\n                    Can you see the bomb?\n          \n                               MILO\n                    Uh, yeah. I can see the bomb. Now\n                    we get up.\n          \n          MILO GRABS THE BOMB AND HOLDS IT AGAINST HIS BELLY. Cass and\n          Milo push against each other, and struggle up to a standing\n          position.\n          \n          Great. So far, so good.\n          \n                                                                 108.\n          \n          \n          Only, MILO CAN'T RAISE HIS ARMS. AND THE PORTHOLE IS SIX FEET\n          ABOVE THE GROUND. NOW WHAT?\n          \n                              CASS\n                    Did you throw it?\n          \n                              MILO\n                    Not exactly.\n          \n                              CASS\n                    Well, what are you waiting for?\n          \n                              MILO\n                    I'm waiting for a pig to fly in\n                    here and grab it.\n          \n                              CASS\n                        (starting to panic again)\n                    Milo...\n          \n                              MILO\n                    Ok, Ok. Um, on 3, I need you to\n                    jump.\n          \n          Beat.\n          \n                              CASS\n                    What?\n          \n                              MILO\n                    You know: \"jump, jump, jump around,\n                    jump.\"\n          \n                              CASS\n                    Are you serious?\n          \n                              MILO\n                    No. I'm fucking with you. For fun.\n                    Just for my own personal\n                    enjoyment...\n          \n                              CASS\n                    Ok, Ok.\n          \n                              MILO\n                    Ok: 1, 2, 3...\n          \n          \n          EXT PORTHOLE- EVENING\n          \n          We see MILO'S HEAD POP INTO VIEW, THEN DISAPPEAR.\n          \n          CLOSE ON- THE TIMER \"00:11, 00:10, 00:09...\"\n          \n                                                                 109.\n          \n          \n          MILO'S HEAD POPS UP HIGHER...\n          \n          CLOSE ON- THE TIMER \"00:06, 00:05, 00:04...\"\n          \n          This time, MILO POPS UP HIGH ENOUGH THAT WE SEE HIS HANDS...\n          \n          CLOSE ON- THE TIMER \"00:03, 00:02, 00:01...\"\n          \n          And finally, MILO IS HIGH ENOUGH THAT HE CAN THRUST THE BOMB\n          OUT THE WINDOW...\n          \n          CLOSE ON THE BOMB AS IT CRASHES INTO THE WATER...\n          \n          \n          INT HULL OF BOAT- EVENING\n          \n          Milo and Cass, both a little out of breath, stand still,\n          listening. Silence.\n          \n                              CASS\n                    Think the water defused it?\n          \n                              MILO\n                    Lemme ask you this? Has anything\n                    gone our way yet?\n          \n          SUDDENLY, A LOW ROAR FROM BENEATH GROWS AND RISES UP BENEATH\n          THE BOAT, ROCKING IT WILDLY AS WATER EXPLODES ON ALL SIDES.\n          \n          Cass and Milo get drenched, BUT ARE SAFE.\n          \n                                CASS\n                    Nice job.\n          \n                              MILO\n                    Hey. You, too.\n          \n                                CASS\n                    Thanks.\n          \n                              MILO\n                    Now lets find something to cut\n                    these ropes off...\n          \n                              CASS\n                    Think we can catch that cop?\n          \n                              MILO\n                    Trust me: we can definitely catch\n                    that cop.\n          \n          Because at this very moment...\n          \n                                                                    110.\n          \n          \n          INT MOTORBOAT- NIGHT\n          \n          ...Bobby is paddling frantically, pausing every once in a\n          while to curse the motor, WHICH FOR SOME REASON REFUSES TO\n          START. He see the lights of another boat coming up behind\n          him, and he paddles faster.\n          \n          \n          EXT DECK OF YACHT- NIGHT\n          \n          Milo steers the yacht right up behind Bobby, dwarfing the\n          motorboat. Calling out:\n          \n                              MILO\n                    Hey, Bobby. I got one for ya...\n          \n          Bobby looks up to see MILO POINTING AN ASSAULT RIFLE HE\n          GRABBED FROM THE EVIDENCE BOXES:\n          \n                              MILO\n                    What's the difference between a\n                    snowman and a snowwoman? (holding\n                    something up) The spark plug.\n          \n          Bobby checks the motor: SO THAT'S WHY IT WON'T RUN. MILO\n          GRABBED THE SPARK PLUG. Milo and Cass grin down at Bobby\n          while he kicks the motor and swears.\n          \n          \n          EXT PIER 19- DAWN\n          \n          CHIRON: \"6:00 AM. PIER 19. 3 HOURS TO GO.\"\n          \n          Cops are everywhere. Cass and Milo are seated on a bench,\n          exhausted, watching as THE COPS UNLOAD BOXES OF STOLEN\n          EVIDENCE FROM THE YACHT. Bobby is cuffed in the back of a\n          squad car.\n          \n          After a moment:\n          \n                              MILO\n                    Merry Xmas. I got you this.\n          \n          Milo hands Cass some seaweed.\n          \n                              CASS\n                    You shouldn't have.\n          \n          Milo checks his watch.\n          \n                              MILO\n                    Hey. I've still got three hours to\n                    get you to jail. Looks like I'm\n                    gonna win that bet after all.\n          \n                                                                  111.\n          \n          \n          Cass' eyes go wide. Suddenly, she JUMPS UP and BOLTS.\n          \n                              MILO\n                        (to himself)\n                    You have got to be kidding me.\n          \n          \n          EXT BEACH- DAWN\n          \n          Like an action sequence in slo-mo, Cass stumbles across the\n          sand, exhausted, Milo at her heels. Finally, he makes one\n          last effort, LUNGES for her, brings her down and SNAPS on the\n          cuffs.\n          \n                               CASS\n                        (muffled, face in the\n                         SAND)\n                    I'm not going without a fight.\n          \n                              MILO\n                    Yeah. I'm getting that.\n          \n          He pulls her to her feet.\n          \n          INT JERSEY CITY POLICE STATION- MORNING\n          \n          Milo leads Cass up to the clerk, both of them looking like a\n          mess. He checks his watch:\n          \n                              MILO\n                    9am. See? Easy as pie.(nudging\n                    Cass) Go on, say it.\n          \n                              CASS\n                        (to the clerk)\n                    I'd like to turn myself in. (can't\n                    resist) Though I didn't do anything\n                    wrong...\n          \n                              MILO\n                    Stop talking.\n          \n                              CASS\n                    ...and I was unjustly arrested...\n          \n          To shut her up, Milo GRABS HER AND KISSES HER. THEN SHE IS\n          KISSING HIM BACK. TIME STOPS FOR A MOMENT.\n          \n          Then Milo hands her over to the clerk.\n          \n                              MILO\n                        (to Cass)\n                    See ya.\n          \n                                                                 112.\n          \n          \n                              CASS\n                        (a little disoriented)\n                    Oh. Ok.\n          \n          The clerk leads her into the jail.\n          \n          \n          EXT POLICE STATION- MORNING\n          \n          Milo exits. He passes some cops on their way in. ONE GELMAN,\n          THE COP HE INSULTED IN THE BEGINNING.\n          \n                              GELMAN\n                    Hey. It's that jerk-off bounty\n                    hunter.\n          \n          Milo stops in his tracks. Mentally weighs the pros and cons.\n          DECIDES:\n          \n                              MILO\n                    Ah, what the hell.\n          \n          He turns around, walks back to Gelman, AND SMASHES HIM IN THE\n          FACE WITH HIS FIST.\n          \n          \n          INT HOLDING CELL- MORNING\n          \n          Cass is trying to find a clean place to sit down, when MILO\n          GETS THROWN INTO THE HOLDING CELL NEXT TO HERS.\n          \n                              CASS\n                    Oh my god, what happened?\n          \n                              MILO\n                    Hey. I couldn't let you spend Xmas\n                    alone. Besides, I didn't really\n                    have any plans other than drinking\n                    some cheap whiskey and putting my\n                    fist through a wall.\n          \n                              CASS\n                    I'm touched that you would give\n                    that up for me.\n          \n                              MILO\n                    Hey. It's the kind of guy I am.\n          \n          Cass grins. WEDDING MUSIC KICKS IN:\n          \n                              SID (O.S.)\n                    Well, you were right.\n          \n                                                                113.\n          \n          \n          INT WEDDING CHAPEL- DAY\n          \n          Sid and Lois are watching as MILO AND CASS GET REMARRIED.\n          \n                               LOIS\n                     Of course I was right. I knew\n                     they'd get back together if they\n                     were just stuck together long\n                     enough. And thank god. Better she\n                     drives him crazy than me.\n          \n                                  SID\n                     I hear ya.\n          \n          CLOSE ON- MILO AND CASS, WHISPERING TO EACH OTHER UNDER THE\n          PRIEST'S BLESSING:\n          \n                               CASS\n                         (LOW)\n                     I love you.\n          \n                               MILO\n                     I love you more.\n          \n          Cass smiles. Beat. Then:\n          \n                               CASS\n                     Well, I doubt you love me more.\n          \n                               MILO\n                     I'm just saying I love you a lot.\n          \n                               CASS\n                     Right. I know. I love you a lot,\n                     too. Let's just say you love me and\n                     leave it at that.\n          \n                               MILO\n                     Fine. I love you.\n          \n                               CASS\n                     Fine. (beat) Cause I love you more.\n          \n                               MILO\n                     Oh yeah? (glancing at her) Wanna\n                     bet?\n          \n          BLACKOUT\n\n\n\n\n\nBounty Hunter, The\nWriters :   Sarah Thorp\nGenres :   Action  Comedy  Crime  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:30.462967"}