{"title": "Bringing Out the Dead", "film_link": "/Movie Scripts/Bringing Out the Dead Script.html", "script_link": "/scripts/Bringing-Out-the-Dead.html", "info_raw": "\n\nBringing Out the Dead Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Paul Schrader\nGenres  Drama\nScript Date : November 1997\n\nRead \"Bringing Out the Dead\" Script\n\n\n", "script": "\n\n\n\n   \"Bringing Out The Dead\", early draft, by Paul Schrader\n\n\n\n   \n\n\n\n\n\n\n\n                    BRINGING OUT THE DEAD\n\n\n\n\n\n\n\n                                             First draft (11/7/97)\n\n                                             Paul Schrader\n\n                                             From the novel by\n                                             Joseph Connelly\n\n\n\n\n\n\n\n          After World War One it was called\n          Shell Shock.\n\n          After World War Two it was called\n          Battle Fatigue.\n\n          After Vietnam it was called\n          Post Traumatic Stress Disorder.\n\n          Frank Pierce, 28, drives an EMS vehicle for\n          Our Lady of Mercy Hospital, New York City.\n          He has been a paramedic for five years.\n\n\n\n     EXT. NEW YORK STREETS--NIGHT\n\n     An EMS \"bus\" careens around a corner, tires squealing, lights\n     flashing, siren whoop-whooping, swooping through Stygian\n     canyons of New York.\n\n     FRANK PIERCE, 28, drives. He wears dark cargo pants, black\n     boots, a white shirt with the paramedic badge, \"EMS\" gold \n     logo on one collar, \"OLM\" on the other. \"Our Lady of Mercy \n     Paramedic\" is inscribed in white across the back of his\n     navy jacket. On his belt: two-way radio, leather gloves,\n     beeper, drug kit, multi-purpose tool kit, mini-flashlight,\n     collapsible baton.\n\n     LARRY, 35, overweight, his partner for the night, rides techie\n     (shotgun), both hands clutching the dash.\n\n     Frank scans the blurring cityscape for hidden danger. He is\n     a young man of slight frame and open face--his life, his\n     possible futures, still before him: behind those open eyes,\n     beneath those dark shadows: hollowness beckons.\n\n     Dispatcher's voice crackles through the cab static: \"Ladder \n     4, respond to a 10-22, four flight residential, 417 East 32. \n     13 Boy, men's room Grand Central, man set his pants on fire.\n     Bad burns. 17 David, at 177 East 24, there's a\n     woman who says a roach crawled in her ear. Can't get it out,\n     says she's going into cardiac arrest ...\"\n\n     Frank's detached voice speaks over the urban landscape:\n\n                           FRANK (V.O.)\n               Thursday started out with a bang: a\n               gunshot to the chest on a drug deal\n               gone bad. Heat, humidity, moonlight--\n               all the elements in place for a long\n               weekend. I was good at my job: there\n               were periods when my hands moved\n               with a speed and skill beyond me and\n               my mind worked with a cool authority\n               I had never known. But in the last\n               year I had started to lose that\n               control. Things had turned bad. I\n               hadn't saved anyone for months. I\n               just needed a few slow nights, a\n               week without tragedy followed by a\n               couple of days off.\n\n     The radio continues: \"Zebra, 13Z, 524 East 17--\"\n\n                           LARRY\n                    (on radio)\n               We're there.\n\n     The ambulance breaks to a halt in front of a row of vintage\n     walk-ups. Frank and Larry jump out: Frank lugs the EKG monitor\n     and airway bag, Larry the drug box, yellow oxygen\n     pack slung over his shoulder. Neighbors crowd around.\n\n                           OLD WOMAN\n               Which apartment? Which apartment?\n\n                           FRANK\n               Move back. Where's the stairs? 5A.\n\n                           OLD WOMAN\n               Oh Jesus, it's Mr. Burke.\n\n     The front door opens, a young boy holding it.\n\n     Author's note: in emergency situations, either on the street \n     or in the hospital, it is assumed there is continual\n     background noise--voices, sirens, cries, questions, etc.\n\n                                                          CUT TO:\n\n     INT. TENEMENT STAIRWELL--NIGHT\n\n     Four flights up: Frank and Larry climbing rotting steps, \n     gray-yellow painted walls, red doors with three locks each,\n     Larry, out of breath, his stomach rolling around like a\n     bowling ball in a bag.\n                                                               \n                                                          CUT TO:\n\n     INT. BURKE APARTMENT--NIGHT\n\n     They enter 5A. MRS. BURKE, 55, her eyes run dry, standing in\n     the center of the room, surrounded by neighbors. Someone\n     leads them to the BEDROOM where Mr. Burke, 60, lies unmoving,\n     stretched on the bed. A young woman, MARY BURKE, 24, kneels \n     over the old man, pressing her lips to his flaccid mouth.\n\n     JOHN BURKE, 30, grabs Franks arm:\n\n                           JOHN\n               We were just watching TV and Dad\n               yelled out and started punching his\n               chest, next thing he locked himself\n               in the bathroom. I said we were gonna\n               call you guys and he said not to.\n               He was crying, I never heard him \n               crying before, then he sorta stopped.\n               We pulled him out and put him on the\n               bed.\n\n     Frank and Larry moving the body to the floor:\n\n                           FRANK\n               How long ago did he stop breathing?\n\n                           JOHN\n               Maybe ten minutes. Woman on the phone\n               tried to tell us how to do CPR.\n               Please, you gotta do something.\n\n                           FRANK\n               We'll do all we can.\n\n     Larry ripping open Mr. Burke's shirt, prepping electrode \n     patches, hooking wires, Frank opening Burke's mouth, feeling \n     a puff of gas escape; Larry calling for backup. Burke's EKG \n     rhythm on the monitor a flat green line.\n\n     Frank's training takes over: he injects the long steel \n     laryngoscope down Burke's throat, he finds a vein, injects \n     epinephrine, followed by atrophine, followed by another epi:\n     no response on the monitor. Larry pulls out the paddles:\n\n                           FRANK (CONT'D)\n               Clear! Clear!\n\n     Larry activates defibrillator, shock--Burke's body heaves.\n     Sweat drips from Larry's nose onto Burke's chest.\n\n                           MARY\n               No more, please don't!\n\n     They shock him again. This time the body moves less. Frank \n     glances up: Mr. and Mrs. Burke's wedding photo sits on the \n     nightstand. Other pictures: a day at the beach, a young \n     serviceman, happy parents. Frank's mind drifts:\n\n                           FRANK (V.O.)\n               In the last year I had come to believe \n               in such things as spirits leaving \n               the body and not wanting to be put \n               back, spirits angry at the awkward \n               places death had left them.  I \n               understood how crazy it was to think \n               this way, but I was convinced if I \n               turned around, I'd see Old Man Burke \n               standing at the window, watching, \n               waiting for us to finish.\n\n     Frank feels Burke's heart beneath cracked ribs. The EEG \n     remains flat. He's dead. It's time to quit.\n\n                           FRANK (CONT'D)\n                    (to Larry)\n               I'll take over. Call ER and ask for \n               an eighty-three.\n                    (to Mrs. Burke)\n               Sorry.\n\n     Larry stands, breathing heavy, looks for a phone. Frank turns \n     to notice relatives and neighbors standing around.\n\n                           FRANK (CONT'D)\n               Do you have any music?\n\n                           MARY\n               What?\n\n                           FRANK\n               Music. I think it helps if you play \n               something he liked.\n\n                           MARY\n               John, play the Sinatra.\n\n     John enters crying. Mary repeats softly:\n\n                           MARY\n               Play the Sinatra.\n\n     John exits. Frank notices Mary for the first time: blond \n     hair dyed black, cut short, loose fitting tank dress, black \n     makeup running down her cheeks. He notices her prom picture, \n     glances back to Mary: it seems she hasn't smiled since that \n     day eight years before. Something special about her, that \n     something that hits you right away.\n\n     \"September of My Years\" plays from the other room. Frank \n     continues massaging Mr. Burke's chest (now to Sinatra beat), \n     even though it's hopeless. Larry returns:\n\n                           LARRY\n               It's OK, Frank. We can call it. Eighty-\n               three.\n\n     Frank feels something strange, looks into Burke's pupils, \n     checks his neck pulse, wrist pulse. His eyes go to Larry:\n\n                           FRANK\n               No we can't. He's got a pulse.\n\n                           LARRY\n               No shit.\n\n     Larry checks the monitor: the green line up and down. Mary \n     senses a change in status:\n\n                           MARY\n               Is he going to be alright?\n\n                           FRANK\n                    (not encouraging)\n               His heart's beating.\n\n     A distant siren signals the arrival of backup. Frank turns \n     to Larry:\n\n                           FRANK (CONT'D)\n               Have 'em bring up a stretcher.\n\n     He looks from Mary back to Mr. Burke--breathing but comatose.\n\n                                                          CUT TO:\n\n     INT. AMBULANCE--NIGHT\n\n     Larry climbing through the back doors, sitting in the jumpseat \n     at the stretcher's head as Frank hangs IV bags, replugs EKG \n     wires that have come loose.\n\n     Frank looks up, sees Mary entering; he takes her arm, turns \n     her toward the rear doors:\n\n                           FRANK\n               Help your family. Ride with your \n               mother and brother.\n                    (she hesitates)\n               Help your family. They need you more.   \n               Help yourself.\n\n     Mary steps out, stands in the red flashing light as Larry \n     closes the door, Frank climbs in the driver's seat.\n\n                                                          CUT TO:\n\n     EXT. SECOND AVENUE--NIGHT\n\n     The EMS bus cruises up Second. Frank checks the side mirror: \n     John, Mary and Mrs. Burke pull behind in a black Ford. Seeing \n     their faces, Frank flips the lights and siren on. It's too \n     late to help Mr. Burke, but it's important to the family \n     that it look urgent. Frank watches passing lights, cars, \n     faces:\n\n                           FRANK (V.O.)\n               I needed to concentrate because my \n               mind tended to wander on these short \n               trips. It was the neighborhood I \n               grew up in and where I had worked \n               most as a paramedic, and it held \n               more ghosts per square foot than any \n               other.\n\n                                                          CUT TO:\n\n     EXT. OUR LADY OF MERCY--NIGHT\n\n     Larry and Frank's 13 Zebra ambulance lined up beside two \n     others outside a blazing \"Emergency\" sign on the crowded \n     side street.\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     Every large city has a hospital Emergency Room so replete \n     with trauma, violence and suffering it picks up the sobriquet \n     \"Knife and Gun Club.\" On Manhattan's Lower East Side it's \n     our Lady Of Mercy, aka, Our Lady of Misery.\n\n     ER: a white-lit cement box painted yellow and decorated with \n     old framed Playbills. Four rows of six plastic chairs face a\n     TV bolted and chained to the ceiling. The seats are filled \n     with backed-up drunks, assault victims and \"regulars,\"\n     bleeding and spilling over against the walls and the floor, \n     getting up to ask their status or going out to throw up and \n     have a smoke.\n\n     Larry and Frank wheeling Burke in, two IV lines, each \n     connected to an elbow, tangled in EKG cables. Two LACERATED \n     RUSSIANS scramble out of their way as they approach GRISS, \n     the large black sunglassed security guard. He looks up from \n     his television guide:\n\n                           GRISS\n               Hey partner. Your man does not look\n               well. They're not gonna appreciate\n               you inside.\n\n                           FRANK\n                    (pumping Ambu-bag)\n               Griss, let us in.\n\n                           GRISS\n               Things are backing up.\n\n     Griss pushes a button, activating the automatic door, striking \n     the bandaged leg of a man lying down on a stretcher in the \n     hall. Larry and Frank wheel Burke inside. A pleading family \n     tries to follow. Griss stretches out his hand:\n\n                           GRISS (CONT'D)\n               You can't go in there, folks.\n\n     Mary, John and Mrs. Burke rush in from the street, hoping \n     some miracle has occurred during the drive to the hospital, \n     approach the sign-in desk.\n\n     Frank and Larry pass four stretchers lined against the wall--\n     a passage nicknamed \"Skid Row\" leading past triage NURSE \n     CONSTANCE's station.\n\n                           NURSE CONSTANCE\n               Just keep moving. Don't even slow \n               down.\n\n     Nurse Constance turns back to the nervous man seated beside \n     her:\n\n                           NURSE CONSTANCE (CONT'D)\n               Sir, you say you've been snorting \n               cocaine for three days and now you \n               feel your heart is beating too fast \n               and you would like us to help you. \n               To tell the truth, I don't see why I \n               should. If I'm mistaken, correct me. \n               Did we sell you the cocaine? Did we \n               push it up your nose?\n\n     Larry and Frank slow at the last Skid Row stretchers. On \n     one, NOEL, a young dark-skinned man with chaotic mess of \n     dreadlocks, pulls feverishly at his restraints:\n\n                           NOEL\n               For God's sake, give me some water.\n\n     From the next stretcher a man with feet swollen purple like \n     prize eggplants replies:\n\n                           BIG FEET\n               Shut up! Goddamn civilians.\n\n                           NOEL\n               Give me some water!\n\n     NURSE CRUPP stops Frank and Larry as they approach the \n     Critical care room. inside, the staff appears as if under \n     siege by a battalion of shriveled men and women lying on a \n     field of white sheets.\n\n                           NURSE CRUPP\n               Don't take another step. We're on \n               diversion. Can't accept any more \n               patients. Your dispatcher should \n               have told you.\n\n                           FRANK\n               We got him at Eighteen and Second. \n               You're closest.\n\n                           NURSE CRUPP\n               Where will I put him, Frank? Look. \n               Tell me.\n\n                           FRANK\n               He wanted to come here. Said the \n               nurses at Misery were the best.\n\n                           NURSE CRUPP\n                    (acquiesces)\n               All right, give me a minute. I'll \n               kick someone out of slot three.\n\n     Larry unravels himself from the IV lines as nurse walks over, \n     takes Burke's pulse.\n\n                           NOEL\n                    (to Frank)\n               Excuse me. You are a very kind man. \n               I can see that. A man like you could \n               not refuse a poor sick dying helpless \n               man a small cup of water.\n\n                           FRANK\n               I can't. I have to stay with my \n               patient.\n\n                           BIG FEET\n               Shut the fuck up! If it wasn't for \n               these dun feet I'd get up and kick \n               your ass!\n\n     DR. HAZMAT, 30, steps over.\n\n                           HAZMAT\n               Godammit, guys, what are you doing \n               to me? We're all backed up in here. \n               Christ, would you look at him? He's \n               gonna need the works. What's wrong \n               with him?\n\n                           LARRY\n               You should know. You pronounced him.\n\n                           HAZMAT\n               You told me he was dead. Flatline.\n\n                           FRANK\n               He got better.\n\n                           HAZMAT\n               I hate pronouncing people dead over \n               the phone.\n                    (flashes light in \n                    Burke's eyes)\n               Better, huh? They're fixed and \n               dilated. He's plant food.\n\n                           NURSE CRUPP\n                    (returning)\n               We stole a stretcher from X-ray. No \n               pad on it, but I don't think he'll \n               mind. Put him in three, next to the \n               overdose.\n\n                           HAZMAT\n               He's our lowest priority now. He \n               shouldn't even be here. All this \n               technology. What a waste.\n\n     Back at SECURITY, the Burkes confront Griss.\n\n                           GRISS\n               Please folks, step back.\n                    (they hesitate)\n               Don't make me take off my sunglasses.\n\n     In CRITICAL CARE, Larry wheels Burke into unit three as Dr. \n     Hazmat turns Frank to face the room, explaining:\n\n                           HAZMAT\n               First-time heart attack, age 45. \n               Should have gone to the CCU ten hours \n               ago. There's three bodies up there \n               Mike the one you just brought in. \n               over there, two AIDS patients, one \n               in twelve filling up with liquid. \n               I'm gonna hafta intubate because the \n               kid's mother won't sign the Do Not\n               Resuscitate. Mercy killing doesn't \n               translate well in Spanish. It's a \n               sin to tube this kid. Three more ODs \n               from some new killer junk. They call \n               it Red Death.\n\n     Hazmat pulls out a vial marked with a red skull and \n     crossbones, shows it to Frank.\n\n                           NOEL\n               Water, water, water, doctor man, \n               water.\n\n                           HAZMAT\n               A mix of heroin and I don't know \n               what else, some kind of amino acid \n               maybe. Stuff so strong they're \n               drinking it with grain alcohol. You \n               have to use ten times the usual amount \n               of Narcan and watch out when they \n               wake up, liable to go nuts on you.\n\n                           FRANK\n                    (about Noel)\n               He one of them?\n\n                           HAZMAT\n               No, that's Noel. Used to be a regular \n               off and on, hasn't been in in a while. \n               He seized and almost coded--I gave \n               him a hypertonic solution. He drank \n               so much the kidneys were taking out \n               salt. One for the textbooks.\n\n                           NOEL\n               Oh doctor, you are the greatest. You \n               must help me.\n\n                           BIG FEET\n               For God's sake, give him a drink of \n               water.\n\n                           HAZMAT\n               I am helping you, Noel. You could \n               die if you drink more water.\n\n     Nurse Crupp pulls on Hazmat's arm.\n\n                           HAZMAT (CONT'D)\n               What is it?\n\n     She points to Burke. His monitor is ringing like a fire alarm. \n     Hazmat and Crupp rush over, wave to others:\n\n                           HAZMAT (CONT'D)\n               Crupp, start CPR. Milagros, get me \n               an epi. Odette wake up Dr. Stark. \n               Tell him I need a blood gas, stat.\n\n     As the staff crowds around Burke, pulling the paddles from \n     off the monitor, Frank, pushing his stretcher away, notices \n     Big Feet climb onto his infected feet, hobble over, work to \n     untie Noel.\n\n                           NOEL\n               Bless you sir, bless you.\n\n                           BIG FEET\n               Shut up.\n\n     Frank heads down Skid Row pushing the stretcher, passing \n     Nurse Constance speaking with a man with a gash over his \n     eye:\n\n                           NURSE CONSTANCE\n               ... so you get drunk every day and \n               you fall down. Tell me why we should \n               help you when you're going to get \n               drunk tomorrow and fall down again?\n\n     Frank pushes the automatic door button--and is suddenly hit \n     from behind by Noel. The stretcher spins sideways. Noel \n     dives out the doors for the water fountain, snorting up water \n     like a bull. Mary Burke, standing with her family, looks at \n     Frank.\n\n                           FRANK\n                    (stock reply)\n               He's very very sick.\n\n                           MARY\n               I know him. That's Noel.\n\n                           FRANK\n               We'd better go outside. Quickly.\n\n     Frank and Mary step out into the humid night.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Checking behind then, Frank stops. Mary pauses before she \n     speaks:\n\n                           MARY\n               Is there any chance?\n\n                           FRANK\n                    (shakes head)\n               I guess there's always a chance.\n\n     The doors break open. Noel comes flying out, bounces on the \n     sidewalk. Griss, in the doorway, closes the doors.\n\n     Mary goes over to Noel:\n\n                           MARY\n               Noel, Noel, it's me, Mary. From 17th \n               Street.\n\n                           NOEL\n               Mary, Mary, Mary. I'm so thirsty. \n               They won't give me anything to drink. \n               Please, Mary.\n\n                           MARY\n                    (heading inside)\n               I'll get you some.\n\n     Frank watches: Mary returns with a cup of water, gives it to \n     a grateful Noel.\n\n                           FRANK\n               I wouldn't do that.\n                    (Noel drinks)\n               The doctor seems to think he's \n               suffering from some rare disorder.\n\n                           MARY\n               It's not so rare. He grew up on our \n               street. He's had a rough life and \n               he's a little crazy from it, but \n               that's no excuse for not giving \n               someone a lousy cup of water.\n\n     Mary starts to cry. Frank fumbles in his pocket, finds a \n     tissue, gives it to her.\n\n                           MARY (CONT'D)\n               My father's dying, Noel.\n\n                           NOEL\n               Oh Mary, Mary, Mary.\n\n     Noel hugs her clumsily, his shoulders bobbing. Frank watches, \n     realizing this is what he should have done for her.\n\n                                                          CUT TO:\n\n     EXT. EAST SIDE STREETS--NIGHT\n\n     13 Zebra cruising down Avenue C, Frank at the wheel, Larry \n     shotgun.\n\n                           LARRY\n               The Chinese close in five minutes.\n               Beef lo mein. It's  been on my\n               mind since I woke. Whatjathink?\n\n                           FRANK\n               I think the moment that food hits \n               your mouth we'll get a job.\n\n                           LARRY\n               Turn here. You missed it. The Chink \n               is on 3rd.\n\n     Franks turns, gets jammed up behind a pimp car at Second and \n     Avenue B, a corner populated by pushers and hookers. TWO \n     WHORES stand in front of an abandoned building. Frank turns \n     to look.\n\n                           WHORE #1\n                Hey ambulance man. What you looking \n                at?\n\n     The second whore, wearing a yellow vinyl coat, turns. She \n     has a face that instantly freezes Frank: the Rose face. \n     Pregnant, she gestures to her belly:\n\n                           WHORE #2\n               Pretty soon you'll be coming for me.\n\n                           LARRY\n               Some partner you are Frank. I coulda \n               walked there faster. I'm starving \n               and you stop to talk to hookers. \n               You're making me nuts. Is that what \n               you're trying to do, drag me down \n               with you to nutsville?\n\n     Frank hits the whoop-whoop siren. The pimps in the black BMW \n     jump, look back, realize its only an ambulance, and pull \n     away.\n\n                           LARRY (CONT'D)\n                    (slams dashboard)\n               Oh no!--I just remembered.\n\n                           FRANK\n               What?\n\n                           LARRY\n               I'm so stupid. I had beef lo mein \n               last night. I can't eat the same \n               thing two nights in a row. It's almost \n               two o'clock, what the hell am I gonna \n               do? What you getting?\n\n                           FRANK\n               I'm not hungry.\n\n                           LARRY\n               Oh yeah, you don't eat food.\n\n                           FRANK\n               I eat. I just haven't had coffee \n               yet.\n\n                           LARRY\n               Coffee and whiskey, lucky you ain't \n               dead with that diet. Wait, I've got \n               it. Half fried chicken with fries. \n               Let's go, hurry up. Come on.\n\n     Frank speeds up Avenue B. Noel, wearing generic homeless \n     combat fatigues, muttering to his friends in Hell, passes on \n     the sidewalk. Frank notices another hooker, catches her face: \n     the same face as the pregnant Whore #2. The Rose face. His \n     mind drifts:\n\n                           FRANK (V.O.)\n               Rose was getting closer. Ever since \n               the call a month before, when I'd \n               lost her, she seemed like all the \n               girls in the neighborhood. One of \n               the first things you learn is to \n               avoid bad memories. I used to be an \n               expert, but lately I'd found some \n               holes. Anything could trigger it. \n               The last month belonged to Rose, but \n               there were a hundred more ready to \n               come out.\n\n                                                          CUT TO:\n\n     EXT. CHICKEN TAKE-OUT--NIGHT\n\n     The EMS vehicle is stopped at a fast food joint. Larry orders, \n     waits.\n\n                           FRANK (V.O.)\n               These spirits were part of the job. \n               It was impossible to pass a building \n               that didn't bold the spirit of \n               something: the eyes of a corpse, the \n               screams of a loved one. All bodies \n               leave their mark. You cannot be near \n               the new dead without feeling it.\n\n     Larry gets his chicken, chats with counter clerk, returns.\n\n                           FRANK (V.O.) (CONT'D)\n               I could handle that. What haunted me \n               now was more savage: spirits born \n               half-finished, homicides, suicides, \n               overdoses, innocent or not, accusing \n               me of being there, witnessing a \n               humiliation which they could never \n               forgive.\n\n     Larry climbs in, sets his take-out on the dash, hands Frank \n     a coffee. A police walkie-talkie is in the front tray.\n\n                           LARRY\n               Turn it off.\n\n                           FRANK\n               What?\n\n                           LARRY\n               You know what. The radio.\n\n                           POLICE DISPATCH\n               Ladder Four, respond to a 10-22 four \n               flight residential, 317 East 32nd.\n\n                           LARRY\n               Let's do it. It might be a good one.\n\n                           FRANK\n               You wanted it turned off. There's no \n               such thing as a good fire. People \n               get burned up. They can't breathe.\n\n                           LARRY\n               That's what we're here for. Come on, \n               Frank.\n\n                           FRANK\n               Don't push it, Larry.\n\n                           LARRY\n               You're burned out.\n\n                           RADIO DISPATCHER\n               One-three Zebra. Zebra three, I need \n               you.\n\n                           LARRY\n               You see, he's giving it to us anyway.\n\n                           RADIO DISPATCHER\n               Zebra, are you there? I'm holding an \n               unconscious at First and St. Marks.\n\n                           LARRY\n                    (screams)\n               No! It's three o'clock. That can \n               only mean one thing.\n\n                           FRANK\n               Mr. Oh.\n\n                           LARRY\n               It's Mr. Oh. I'm not answering it.\n\n                           RADIO DISPATCHER\n               Answer the radio Zebra. You know \n               it's that time.\n\n                           LARRY\n               Four times this week I've had him. \n               Aren't there any other units out \n               there?  Don't answer the radio. \n               They'll give it to someone else.\n\n                           RADIO DISPATCHER\n               Thirteen Zebra. One-Three Zebra. \n               You're going out of service in two \n               seconds.\n\n     Pause. Neither moves.\n\n                           LARRY\n               Look, Frank, when I say don't answer \n               it, that means answer it. \n                    (picks up the mike)\n               You can do that for me at least.\n                    (keys mike)\n               Three Zebra.\n\n                           RADIO DISPATCHER\n               Yes, Zebra. You'll be driving to the \n               man who needs no introduction, chronic \n               caller of the year three straight \n               and shooting for number four. The \n               duke of drunk, the king of stink, \n               our most frequent flier, Mr. Oh.\n\n                           LARRY\n               Ten-four.\n                    (Frank starts the \n                    engine)\n               Don't go. Not this time.\n\n                           FRANK\n                    (driving off)\n               Relax, it's a street job, easy except \n               for the smell. We'll just throw him \n               in back and zip over to Mercy--no \n               blood, no dying, that's how I look \n               at it. He's just a drunk.\n\n                           LARRY\n               It's not our job to taxi drunks \n               around.\n\n                           FRANK\n               They'll just keep calling.\n\n                           LARRY\n               Someone's gonna die someday causa \n               that bum, going to have a cardiac\n               and the only medics will be taking \n               care of Mr. Oh.\n\n                                                          CUT TO:\n\n     EXT. FIRST & ST. MARKS--NIGHT\n\n     Frank and Larry standing over Mr. Oh, 40, surrounded by street \n     people. Oh lays curled up beside his wheelchair, wearing a \n     black garbage bag with holes cut out for his arms, his pants \n     around his knees.\n\n                           MALE STREET PERSON #1\n               He's bad mister. He ain't eaten nuthin \n               all day, he's seizing and throwing \n               up.\n\n                           LARRY\n                    (hand over nose)\n               So what's different?\n\n                           MALE STREET PERSON #1\n               He says his feet hurt.\n\n                           FRANK\n               Well why didn't you say so?\n\n                           LARRY\n               He's drunk.\n\n                           MALE STREET PERSON #2\n               He's sick. You gotta help him.\n\n                           LARRY\n               He's fine. He can walk to the \n               hospital.\n\n                           FEMALE STREET PERSON\n               Walk? You crazy? He's in a wheelchair.\n\n                           LARRY\n               Don't start that. I've seen him walk. \n               He walks better than me.\n\n     Frank crouches over Oh, tries to pull Oh's pants over his \n     white, dirt-stained ass. Oh moans:\n\n                           MR. OH\n               Oh, oh, oh.\n\n                           LARRY\n               That's him, Mr. Oh.\n                    (pulls at his arm)\n               Get up.\n\n     Larry and Frank get Oh to his feet only to have him stumble \n     over his lowered trousers. This time Frank lifts him, sets \n     his white ass cheeks into the wheelchair. They push him toward \n     the ambulance.\n\n                           CROWD\n               Good luck! Get better!\n\n                                                          CUT TO:\n\n     EXT. FIRST AVE--NIGHT\n\n     13 Zebra heads up First, double Caduceus symbols shining \n     from the back of the van.\n\n     Inside the cab, Larry and Frank lean out the front windows \n     to avoid the king of stink:\n\n                           LARRY\n               Faster! God!\n\n                           FRANK\n                    (flips on top lights)\n               Faster!\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     Griss holding up his hand:\n\n                           GRISS\n               Get that stinky-assed motherfucking\n               bug-ridden skell out of my face.\n\n     Frank and Larry stand beside Oh slumped in his wheelchair. \n     Fellow drunks welcome their comrade from plastic chairs. \n     Nurse Constance escorts a young man from the triage area:\n\n                           NURSE CONSTANCE\n               I would have to register you to give \n               you something to eat and my conscience \n               just will not allow that. Griss, \n               the gentleman wants to leave.\n                    (looks at Oh)\n               He looks pale. You're not eating \n               enough. You need more fiber.\n\n     Griss shows young man the door.\n\n                           LARRY\n                    (holds up his report)\n               He's wasted. That's my diagnosis: \n               shit-faced.\n\n                           NURSE CONSTANCE\n               He just needs a bath and some food. \n               Take him in back and see if you can \n               find a stretcher.\n\n                           LARRY\n                    (to Frank)\n               She's nuts. That's why he comes here. \n               She encourages him.\n\n     Griss returns as Crupp calls from critical care area:\n\n                           NURSE CRUPP\n               Don't you dare! That's my last \n               stretcher. This is not a homeless \n               shelter. He'll have to wait in the \n               lobby.\n\n                           GRISS\n               No way man. Not even in the corner. \n               Griss cannot abide the funk tonight.\n\n     Larry and Frank turn, secretly pleased, and wheel Mr. Oh \n     outside.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Larry setting Oh outside the entrance, heading towards the \n     all night deli. Frank takes out a cigarette.\n\n     Mary Burke walks up the drive opening a pack of cigs. Frank \n     offers her a light. She inhales, exhales:\n\n                           MARY\n               It's my first cigarette in over a \n               year.\n\n                           FRANK\n               The first is always the best.\n\n                           MARY\n               It's the waiting that's killing me, \n               not knowing, you know? It's really \n               hard on my mother. The doctor doesn't \n               think my father'll make it. He says \n               he was dead too long, after six \n               minutes the brain starts to die and \n               once that goes, close the door.\n\n                           FRANK\n               You never know.\n\n                           MARY\n               I mean if he was dead, I could handle \n               that.\n\n                           FRANK\n               At least he's got people around him.\n\n                           MARY\n               I'm not so sure. My father and I \n               haven't spoken in three years. When \n               my brother called to say my father \n               was having a heart attack, that he'd \n               locked himself in the bathroom, all \n               the way going over I was thinking \n               how I was gonna tell him what a \n               bastard he was. Then when I got up \n               the stairs and we moved him onto the \n               bed, I thought of all these other \n               things I wanted to say.\n\n                           FRANK\n               Even when you say the things, there's \n               always more things.\n\n                           MARY\n               Right now, I'm more worried about my \n               mother than anything. They won't let \n               her see my father.\n\n                           FRANK\n               Go home. Take her home. Get some \n               rest. Not going to find anything out \n               now.\n\n                           MARY\n               That's what I told her. If she could \n               just see him a second, then I could \n               take her home.\n\n     Larry walks back with a coffee for himself and a brown bag \n     beer for Frank.\n\n                           LARRY\n               Time to switch. I wheel, you heal.\n\n                                                          CUT TO:\n\n     EXT. LOWER EAST SIDE--NIGHT\n\n     4:00am.  The EMS vehicle drives downtown. The city has \n     transformed: a deserted city, inhabited by the hardcore: \n     hardcore night-shift employees, hardcore party-goers, hardcore  \n     druggies, hardcore homeless, people with something special \n     to do or nowhere to go.\n\n                           RADIO DISPATCHER\n               12 David on the corner of Thirty-\n               eight and Two you'll find a three-\n               car accident, two taxis and a taxi. \n               One-two Henry, 427 East Two-two, \n               report of a very bad smell. No further \n               information ...\n\n     Larry driving at a good clip, riding both the gas and the \n     break pedals, enjoying the newfound freedom of movement.\n\n                           FRANK\n               Larry, swing over on Eighth. We're \n               gonna hafta run one of these calls.\n\n                           LARRY\n               Relax, will you.\n\n     Frank places both hands on the dash as Larry squeals around \n     a corner.\n\n                           FRANK (V.O.)\n               The biggest problem with not driving \n               is that whenever there's a patient \n               in back you're also in the back.  \n               The doors close, you're trapped. \n               Four in the morning is always the \n               worst time for me, just before dawn, \n               just when you've been lulled into \n               thinking it might be safe to close \n               your eyes for one minute. That's \n               when I first found Rose ...\n\n     Larry slows down on a side street. Frank turns to watch a \n     homeless man. The man looks back: it's Rose. The Rose face.\n\n                           FRANK (V.O.) (CONT'D)\n               She was on the sidewalk, not \n               breathing.\n\n     Frank turns to Larry:\n\n                           FRANK (CONT'D)\n               I'm not feeling very well, Larry. I \n               say we go back to the hospital and \n               call it a night.\n\n                           LARRY\n               You have no sick time, Frank. No \n               time of any kind. Everyone knows \n               that.\n\n                           FRANK\n               Take me back, put me to bed; I \n               surrender. We've done enough damage \n               tonight.\n\n                           LARRY\n               You take things too seriously. Look \n               at us, we're cruising around, talking, \n               taking some quiet time, getting paid \n               for it. We've got a good job here.\n\n                           FRANK\n               Yeah, you're right.\n\n     Larry pulls into the Jacob Riis projects by the river, slows \n     to a stop.  Larry cuts the lights, not bothering to inform \n     his partner what his partner already knows: they're taking \n     a rest.\n\n                                                          CUT TO:\n\n     EXT. RIIS PROJECTS--NIGHT\n\n     13 Zebra sits in the quiet dark. Larry puffs a cigarette.\n\n                           FRANK\n               Tell me, you ever think of doing\n               anything else?\n\n                           LARRY\n               Sure, I'm taking the captain's exam \n               next year. After the kids are in \n               school, Louise can go back to the \n               post office and, I thought, what the \n               hell, I'll start my own medic service. \n               Out on the Island the volunteers are \n               becoming salaried municipal. It's \n               just a matter of time and who you \n               know. Someday it's going to be Chief \n               Larry calling the shots.\n\n     Larry tosses the cigarette out the window, leans against the \n     door jab, closes his eyes. In a second he's asleep.\n\n     Frank turns down the radio volume: the calls are fewer and \n     further between now. Frank leans back, tries to rest:\n\n                           FRANK (V.O.)\n               I'd always had nightmares, but now \n               the ghosts didn't wait for me to \n               sleep. I drank every day. Help others \n               and you help yourself, that was my \n               motto, but I hadn't saved anyone in \n               months. It seemed all my patients \n               were dying. I'd waited, sure the \n               sickness would break, tomorrow night, \n               the next call, the feeling would \n               drop away. More than anything else I \n               wanted to sleep like that, close my \n               eyes and drift away ...\n\n     TIMECUT: radio wakes Frank from his reverie.\n\n                           RADIO DISPATCHER\n               Zebra. One-three Zebra.\n                    (Frank opens eyes)\n               Zebra, answer the radio. Come on, \n               I've got one for you. Pick up the \n               radio and push the button on the \n               side and speak into the front.\n\n                           FRANK\n                    (answering call)\n               Zebra.   \n\n                           RADIO DISPATCHER\n               Male bleeding, corner of Houston and \n               One. No further information.\n\n                           FRANK\n               Ten-four.\n\n     Frank hangs up, bangs Larry's steering wheel:\n\n                           FRANK (CONT'D)\n               We have a call Chief. Somebody's \n               bleeding, Houston and First.\n\n     Larry instinctively reaches for the ignition key, starts the \n     engine, drops the ambulance into gear, hits lights, jerks \n     the EMS bus away, still half asleep.\n\n                                                          CUT TO:\n\n     EXT. HOUSTON & FIRST--NIGHT\n\n     13 Zebra coming to a bone jarring stop at the corner. Getting \n     out of the techie seat, Frank sees Noel, his face bloody, \n     charging at him.\n\n                           NOEL\n               Kill me!\n\n     Noel has sliced up a tire and fastened the pieces with string \n     over his shoulders. Tin cans circle his wrists and ankles.  \n     One hand carries a broken bottle, the other a stringless \n     violin.\n\n     Frank jumps back inside as Noel rams the window, leaving \n     stains from his blood-matted dreadlocks. Larry calls for \n     backup: medics, police, firemen, anybody.\n\n     The side window glass bends as Noel rams his head against \n     it. Frank reaches for the short club between the seats; Noel \n     holds the jagged bottle to his neck.\n\n                           FRANK\n               Noel, don't!\n\n     Noel drops the bottle. Frank rolls down the window.\n\n                           LARRY\n               He's crazy.\n\n                           FRANK\n               You really think so?\n\n                           NOEL\n               See, I can't do it. I came out of \n               the desert.\n\n                           FRANK\n               You came out of the hospital. You \n               were tied down and hallucinating. \n               You got some bad chemicals in your \n               head, Noel. There's some medicine at \n               the hospital that will fix that.\n\n                           NOEL\n               No, no medicine!\n\n     Noel swings his bloody dreadlocks: Frank ducking, getting \n     splattered anyway, rolling up the window.\n\n                           LARRY\n               He got you.\n\n     A BLACK PUNK calls from the crowd:\n\n                           BLACK PUNK\n               Do it! Man wants to die. Take him \n               out! I know how to kill that mother.\n                    (points a finger)\n               Pop, pop.\n\n     Noel, spraying blood, chases the Punk. The crowd scatters. \n     Noel trips, falls to the sidewalk. Frank, carrying the short \n     bat, gets out, walks over, hunches beside Noel:\n\n                           FRANK\n               Noel, you didn't let me finish. We \n               have rules against killing people on \n               the street. Looks bad, but there's a \n               special room at the hospital for \n               terminating. A nice quiet room with \n               a big bed.\n\n                           NOEL\n               Oh man, do you mean that?\n                    (smiles)\n               Thank you man, thank you. How?\n\n                           FRANK\n               Well, you have your choice: pills, \n               injection, gas.\n\n     A siren draws closer, Noel gets to his feet as Larry opens \n     the rear doors.\n\n                           NOEL\n               I think pills. Yes, pills, definitely.\n\n     A second ambulance skids to a stop. TOM WALLS, 35, a 220 \n     pound bald-headed bruiser, gets out.\n\n                           LARRY\n               Jesus, Tom Walls, that crazy \n               motherfucker.\n\n                           FRANK\n               Used to be my partner.\n\n                           WALLS\n               Frank, this the guy you called about? \n               I know him.\n                    (pushes Noel)\n               You give my friend here any trouble \n               and I'll kill you.\n\n                           NOEL\n               Yes, at the hospital.\n\n                           WALLS\n               This looks like a very bad man I \n               took in a couple weeks ago, a man \n               who'd been holding two priests hostage \n               with a screwdriver. I told him if I \n               ever caught him making trouble again \n               I'd kick the murdering life outta \n               him.\n\n                           FRANK\n               It's not worth it, Tom. He's \n               surrendering.\n\n                           WALLS\n               No prisoners. Don't worry, Frank, \n               just a little psychological first \n               aid.\n\n     Walls hauls back, swings at Noel; Noel ducks.\n\n                           WALLS (CONT'D)\n               Stay still, dammit!\n\n     Walls throws Noel against the bus, knocks him down, sets to \n     kicking him.\n\n                           FRANK\n               Don't do it, Tom!\n\n     Noel moans. Larry sticks his head out the back of the bus:\n\n                           LARRY\n               There's a double shooting three blocks-\n               up. First and Third. confirmed.\n\n                           WALLS\n                    (looking up)\n               We'll do it.\n\n     Walls releasing Noel as Noel scrambles into the bus, Frank \n     stepping over him, Larry climbing into the driver's seat, \n     Frank closing the doors. Noel trembles:\n\n                           NOEL\n               At the hospital. You told me at the \n               hospital.\n\n     Larry squeals off full gun, all sirens blaring: the Wah, the \n     Yelp, the Super Yelp. Strobe bar, side strobes, quarter panel \n     strobes. Rock n' roll.\n\n                                                          CUT TO:\n\n     EXT. FIRST & THIRD--NIGHT\n\n     Both EMS buses breaking to a stop at the crime scene, cops \n     holding the crowd back; Walls, Frank, Larry, Walls' partner \n     moving through the crowd.\n\n                           FRANK & WALLS\n               EMS. Move it!\n\n                           BYSTANDER\n               Man just walked up and shot 'em. Not \n               a word. Man, that was cold.\n\n     Two boys, DRUG DEALERS, lie bleeding on the sidewalk. Frank \n     drops to his knees beside one, Walls the other. Larry wheels \n     out the stretcher.\n\n                           FRANK\n                    (to Drug Dealer)\n               Where you hit?\n\n                           VOICE IN CROWD\n               Outlaw did this. He works for Cy.\n\n     Two white vials roll out of the Drug Dealer's shirt: marked \n     with red skull and crossbones. Frank looks over--they're \n     gone, swiped by eager hands.\n\n     Listening for a heartbeat, Frank calls to Walls:\n\n                           FRANK\n               Major Tom, I'm going to Misery. You \n               take yours to Bellvue.\n\n                                                          CUT TO:\n\n     INT. 13 ZEBRA EMS VEHICLE--NIGHT\n\n     Larry charging through the night while, in back, Frank, \n     stethoscope in his ears, wrapping a tourniquet around the \n     Drug Dealer's arm: he's dying fast.\n\n                           FRANK\n               You're gonna feel a stick in your \n               arm. Don't move.\n\n                           DRUG DEALER\n               I don't want to die.\n\n                           NOEL\n               I want to die. I'm the one.\n\n                           DRUG DEALER\n               Oh Jesus, I don't want to die.\n\n                           FRANK\n               You're not going to die.\n\n                           NOEL\n               What did you say?\n\n                           FRANK\n                    (to Noel)\n               Shut up. You're going to die and \n               he's not. Got it.\n\n                           DRUG DEALER\n                    (weak)\n               Hold my hand.\n\n                           FRANK\n               I can't. I got to do the other arm.\n\n                           DRUG DEALER\n               Please.\n\n                           FRANK\n                    (to Noel)\n               Hold this--right there. If you let \n               go, I swear, I won't kill you.\n\n     Noel holds IV bag as Frank searches for a vein, inserts second \n     IV needle.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Larry pulls into Our Lady of Mercy Emergency. Frank says to \n     the boy:\n\n                           FRANK\n               It's all right. We're here.\n\n     No answer. Frank feels for a pulse, listens with the \n     stethoscope: nothing. Larry opens the doors.\n\n                           LARRY\n               Noel, let's go.\n\n     Frank turns to his partner:\n\n                           FRANK\n               He's not breathing. Call a code.\n\n     Larry and Frank pull the dead boy out of the bus.\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     Frank finishes his report, hands a copy to the clerk, looks \n     around the now almost empty waiting area. John Burke sleeps \n     slumped in one of the chairs. Griss stands at his post.\n\n     Pulling out a pack of cigarettes, Frank steps outside.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Frank exits, lights up. The sky is going blue. Inside the \n     open rear doors of 13 Zebra, Larry mops up bloody floor.\n\n     Mary Burke, weary, steps beside Frank.\n\n                           MARY\n               Hello again.\n\n     He offers a cigarette. She accepts:\n\n                           MARY (CONT'D)\n               You shouldn't smoke.\n\n                           FRANK\n               It's okay. They're prescription.\n                    (beat)\n               Works better with a little whiskey.\n\n                           MARY\n               That's my brother's problem. He's \n               passed out inside.\n\n     Larry jumps theatrically out of the ambulance, swings the \n     mop wildly over his head:\n\n                           LARRY\n               That's it! I can't do it anymore!\n\n     Mary laughs once, less than a second. She notices blood stains \n     on Frank's shirt:\n\n                           MARY\n               That boy you brought in, he was shot, \n               wasn't he?\n\n                           FRANK\n               Yes.\n\n                           MARY\n               He's dead, huh?\n\n                           FRANK\n               Yes.\n\n                           MARY\n                    (pause)\n               I think this place stinks.\n\n                           FRANK\n               Our Lady of Misery.\n\n                           MARY\n               Did you see my father?\n\n                           FRANK\n               No.\n\n                           MARY\n               It's crazy in there. What's wrong \n               with that doctor? He keeps mumbling, \n               poking himself in the eye when he \n               talks to me.\n\n                           FRANK\n               He's working a double shift.\n\n                           MARY\n               Thing is, I'm supposed to be the \n               fuckup. The one on the stretcher in \n               there--that's supposed to be me. \n               With my parents crying out here. I \n               got a lot of guilt, you know what I \n               mean?\n\n     He does.\n\n                           MARY (CONT'D)\n               My father's in a coma, now my mother's \n               going crazy. It's like she's in a \n               trance.\n\n                           FRANK\n               She should go home.\n\n                           MARY\n               I'd take her, but then who would \n               stay here?\n\n     Frank looks at her, trying to say the right thing. He notices \n     Mrs. Burke coming from inside.\n\n                           FRANK\n               Here she is.\n\n     Mrs. Burke, dazed, steps out. They join her.\n\n                           MRS. BURKE\n               It wasn't him.\n\n                           MARY\n               You saw him?\n\n                           MRS. BURKE\n               They showed me someone. It wasn't \n               him. It wasn't my husband.\n\n                           FRANK\n               Mrs. Burke, please, they'll take \n               care of him. You should go home now.\n\n                           MRS. BURKE\n               I should know my own husband. They \n               wouldn't let me see him.\n\n     She drifts away. Frank speaks to Mary:\n\n                           FRANK\n               Larry and I'll drop her back home. \n               Help me get her to the ambulance.\n\n                           MRS. BURKE\n               You want some coffee? I have some \n               apple sauce cake too.\n\n     They walk Mrs. Burke to 13 Zebra.\n\n                           MARY\n               Thank you.\n\n     Mary watches as Larry backs up the EMS vehicle, Frank sitting \n     in the back with her mother, pulls into first light.\n\n                                                     DISSOLVE TO:\n\n     EXT. 12TH STREET--EARLY MORNING\n\n     Larry dropping Frank off at the corner of First and Sixteenth, \n     driving on.\n\n     It is as if the sun has risen on a different city, different \n     from the one which Frank drove through the night before: a \n     city of crumbling neighborhoods laid bare by sunlight; a \n     city of day people, getting up, having breakfast, going to \n     work.\n\n                                                          CUT TO:\n\n     INT. FRANK'S APARTMENT--DAY\n\n     Frank's studio apartment betrays a minimal existence: single \n     bed, table, fridge and stove, loveseat, bookshelf, television.  \n     The bookshelf contains a CD player, medical texts, old \n     schoolbooks (\"Romantic Poetry\"), paperback novels and, \n     incongruously, a picture book of women's fashion.\n\n     A framed commendation from the New York Fire Department hangs \n     beside and open closet of work clothes, corduroy jacket, two\n     ties on a hook. Remnants of a fast food breakfast on the \n     table. Aluminum foil covers the windows, blocking out the \n     sunlight.\n\n     Frank stands bareback at the single open window, smoking, \n     drinking from a glass of whiskey, looking across the gray \n     cityscape of high rises and water tanks: winding down from \n     the night's work:\n\n                           FRANK (V.O.)\n               Saving someone's life is like falling \n               in love, the best drug in the world. \n               For days, sometimes weeks afterwards, \n               you walk the street making infinite \n               whatever you see. Once, for weeks I \n               couldn't feel the earth. Everything \n               I touched became light. Horns played \n               in my shoes; flowers fell from my \n               pockets ...\n\n     TIME DISSOLVES: Frank paces the room. Pours himself another \n     drink.\n\n                           FRANK (V.O.) (CONT'D)\n               You wonder if you've become immortal, \n               as if you saved your own life as \n               well. What was once criminal and \n               happenstance suddenly makes sense. \n               God has passed through you, why deny \n               it, that for a moment there, God was \n               you.\n\n     TIME DISSOLVE: window is closed. Frank tosses in his sleep.\n\n     Nightstand alarm buzzes. Frank sits up, looks at the clock. \n     Stretching his neck, he walks over to the sink, runs water \n     on his hands and face.\n\n                                                          CUT TO:\n\n     EXT. EMS GARAGE--NIGHT\n\n     The maintenance garage and dispatch office adjacent to our \n     Lady of Mercy.\n\n                                                          CUT TO:\n\n     INT. EMS GARAGE OFFICE--NIGHT\n\n     Frank standing on one foot before the desk of CAPTAIN BARNEY, \n     50, ex-paramedic and lifetime civil servant.\n\n                           FRANK\n               Good morning, Captain.\n\n     Capt. Barney looks over to MISS WILLIAMS, his secretary, \n     seated at a desk perpendicular to his:\n\n                           CAPT. BARNEY\n               What am I going to to do with this \n               guy?\n                    (to Frank)\n               Pierce, I was just on the phone with \n               Borough Command. Out of twelve shifts \n               this month, you've been late for \n               nine, sick four and that includes \n               the shift where you came late and \n               went home early.\n\n                           FRANK\n               I'm sick. That's what I've been \n               telling you.\n\n                           CAPT. BARNEY\n               You're killing me, you know that? \n               You got no sick time according to \n               Command. I've been told to terminate.\n\n                           FRANK\n               It's okay. I'll just get my things \n               out of the locker.\n\n                           CAPT. BARNEY\n               I've never fired anyone in my life.\n\n                           FRANK\n               I'm sorry Captain. Don't take it too \n               hard.\n\n                           CAPT. BARNEY\n               Nobody tells me to fire anyone. I \n               told them: shove it up the big one.\n                    (looks at Miss Williams)\n               Sorry.\n                    (back to Frank)\n               I said, you want to fire him, come \n               over and do it yourself.\n\n                           FRANK\n               You know they won't do it. It's up \n               to you. You gotta be strong.\n\n                           CAPT. BARNEY\n               I feel for you, but we got an \n               emergency here. It's a weekend of \n               full moons.  Everyone's called in \n               sick. Larry, Veeber, Stanley too.    \n               We need bodies out there. I had to \n               put Marcus on Twelve Young. You know \n               he's not supposed to work two nights \n               in a row.\n\n                           FRANK\n               You swore you'd fire me if I came in \n               late again.\n\n                           CAPT. BARNEY\n               I'll fire you tomorrow. Hell, better \n               than that, I'll forward you some \n               sick time. A week, two weeks off--\n               how about that?\n\n                           FRANK\n               I don't think a week's gonna do it.\n\n                           CAPT. BARNEY\n               I'm sorry, Pierce.\n                    (hands Frank keys)\n               You're going out with Marcus. Duty \n               calls. The City needs you.\n\n                                                          CUT TO:\n\n     EXT. SECOND AVENUE--NIGHT\n\n     12 Young heading downtown, lights off, slowing down for cross \n     streets. At the wheel: MARCUS, 45, black, reserved, chin \n     erect, seeming too old for the job. Frank rides techie.\n\n                           MARCUS\n               My Lord mother man, you look like \n               hell. What were you drinking?\n\n                           FRANK\n               The captain almost fired me tonight. \n               I'm on my way out. Anytime now.\n\n                           MARCUS\n               Nobody gets fired. Look at me. Only \n               thing they might do is transfer you \n               to the Bronx. You look like you aged \n               ten years since I rode with you last.\n\n                           FRANK\n               The ghosts--\n\n                           MARCUS\n               You ever notice people who see shit \n               always, are crazy?\n\n                           FRANK\n               I think the worst is over.\n\n                           MARCUS\n               It can always get worse. You can't \n               change what's out there, only where \n               you're coming from. You got to let \n               the Lord take over, in here.\n                    (points to Frank's \n                    chest)\n\n     LOVE, a black, tough-talking female dispatcher, comes on the \n     radio:\n\n                           DISPATCHER LOVE\n               Twelve Young.\n                    (beat)\n               Let's go, Twelve Young. Answer the \n               radio.\n\n                           FRANK\n               Hey, Marcus, it's Love. I haven't \n               heard her in months.\n\n                           MARCUS\n               She only works when I'm on. I make \n               her wait and it drives her crazy.\n\n                           FRANK\n               Is it true that you and Love went on \n               a blind date?\n                    (Marcus looks away)\n               She hit you with a bottle?\n\n                           MARCUS\n               She loves me the way no woman ever \n               has.\n\n                           DISPATCHER LOVE\n               Twelve Young, I don't have time for \n               your games. Now answer me or do I \n               have to come out there myself?\n\n                           MARCUS\n               I usually don't do calls before \n               coffee. But I think it might do you \n               some good.\n                    (picks up mike)\n               Twelve Young is here and I'm gonna \n               take care of you, baby. Don't you \n               worry about a thing, yahear, cause \n               Marcus is alive and on arrival.\n\n                           DISPATCHER LOVE\n               I'm not your baby, Young, I'm not \n               your mother either. You're going to \n               a cardiac arrest, Avenue C and Ninth, \n               northeast corner. It's a club. Take \n               the side entrance.\n\n                           MARCUS\n               Ten-four, hon.\n                    (to Frank)\n               This is for you.\n\n     Marcus flips on the lights and siren.\n\n                                                          CUT TO:\n\n     EXT. NINTH & AVENUE C--NIGHT\n\n     Marcus grabs the yellow airway bag, leaving Frank to lug the \n     three heavier pieces as they push their way through the crowd \n     toward a black jacketed DOORMAN holding a walkie-talkie:\n\n                           MARCUS\n                    (to crowd)\n               I hope we're not late from you guys \n               holding us up here.\n\n                                                          CUT TO:\n\n     INT. CLUB BACKSTAGE--NIGHT\n\n     The Doorman leads Frank and Marcus through the smoky graffiti-\n     covered backstage ante-rooms to a cubicle where a knot of \n     club types and band members hover around IB BANGIN, 18 year-\n     old white rapper, face up, blank-eyed and breathless on dirt-\n     impacted carpet. Hip-hop music echoes from the club PA.\n\n     Frank kneels beside IB Bangin, taking a pulse, realizing \n     it's the gray and black stage makeup making him seem DOA. He \n     pulls up IB Bangin's eyelid, shines a light into the pupil.\n\n                           MARCUS\n               Okay, what happened?\n\n                           DRUMMER\n               He's going to be all right, right?\n\n                           MARCUS\n               No. He's dead.\n\n                           DRUMMER\n               No way, man.\n\n                           MARCUS\n               He's dead and there's nothing we can \n               do. Come on, Frank, that's it.\n\n                           FRANK\n                    (whispers)\n               He's not dead. It's a heroin overdose. \n               Break out the Narcon.\n\n                           MARCUS\n                    (announcing)\n               He's dead unless you folks want to \n               stop bullshitting me and tell it \n               straight. Then, Lord willing, we'll \n               try to bring him back.\n\n                           BYSTANDER\n               He broke up with his old lady.\n\n                           GIRLFRIEND\n               We didn't break up. We were just \n               seeing other people.\n\n                           MARCUS\n               I'm still waiting and this young man \n               is still dead.\n\n                           BYSTANDER\n               She broke his heart.\n\n     The Girlfriend shoots a look at the Bystander. Marcus just \n     stands, hands on hips, silent. Frank opens the drug box.\n\n     The Drummer relents:\n\n                           DRUMMER\n               All right, all right, he's been \n               snorting that Red Death stuff. Been \n               going for four days.\n\n                           MARCUS\n                    (brings hands together)\n               What's his name?\n\n                           DRUMMER\n               IB Bangin.\n\n                           MARCUS\n               What'd you mean IB Bangin? What kind \n               of name is IB Bangin?\n\n                           GIRLFRIEND\n                    (Hesitant)\n               It's Frederick. Frederick Smith.\n\n                           MARCUS\n                    (to body)\n               Okay, Freddy.\n\n                           GIRLFRIEND\n               It's Frederick.\n\n                           MARCUS\n               Okay, IB Bangin, we're gonna bring \n               you back. Every person here grab the \n               hand of the person next to you.\n\n     Marcus assists them as Frank breaks the cellophane off a \n     syringe, locates a vial of Narcon. Frank gives Marcus the \n     high sign--Marcus raises his hands:\n\n                           MARCUS (CONT'D)\n               Oh Lord, here I am again to ask one \n               more chance for a sinner. Bring back \n               IB Bangin, Lord. You have the power, \n               the might, the super light, to spare \n               this worthless man.\n\n     Frank injects IB Bangin: he responds to the Narcon with a \n     jolt, opening his eyes, raising his hands.\n\n                           GIRLFRIEND\n                    (kneeling)\n               Frederick!\n\n                           BYSTANDER\n               Oh wow, man. Oh wow.\n\n                           IB BANGIN\n                    (sick)\n               What happened?\n\n                           GIRLFRIEND\n               You died, you stupid bastard. I warned \n               you.\n\n                           DRUMMER\n               You guys are awesome.\n\n                           FRANK\n                    (to IB Bangin)\n               C'mon.\n\n     Frank and the Girlfriend guide IB Bangin to the door as Marcus \n     collects the gear.\n\n                           MARCUS\n               Not us. The first step is Love. The \n               second is Mercy.\n\n     He follows Frank, IB Bangin and Girlfriend out, calling for \n     the crowd to clear.\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     IB Bangin sitting with Nurse Constance in triage. Past Griss, \n     Frank talks with Dr. Hazmat:\n\n                           FRANK\n               That guy I brought in yesterday, \n               post-cardiac arrest. He's gone.\n\n                           HAZMAT\n               Burke. You won't believe it. He's \n               showing cognitive signs. He started \n               with spontaneous respiration, now \n               he's fighting to pull out the tube. \n               Had to sedate him. He's in a CAT \n               scan. I'm giving him every test I \n               can: thromboytics, steroids, \n               nitrodrips, heparin.\n\n                           FRANK\n               What do you think?\n\n                           HAZMAT\n               Who knows? It's all lower-brain-stem-\n               activity. The heart refuses to \n               stabilize--he's coded eleven times \n               since he got here. This guy's a \n               fighter. Every time the Valium wears \n               off he starts yanking those \n               restraints.\n\n                           FRANK\n               The family know?\n\n                           HAZMAT\n               I wanted to bring them in, to see if \n               he'd respond to voices, but they \n               weren't in the waiting room. The \n               guy's daughter was in my face all \n               last night and when I finally have \n               something positive to tell her, she's \n               gone.\n\n     Frank nods, walks down Skid Row, passing Nurse Constance \n     lecturing IB Bangin:\n\n                           NURSE CONSTANCE\n               ... you put poison in your veins and \n               now that you're breathing again you \n               can't wait to say thank you and go \n               back to poison shopping. Well, since \n               we saved your life, maybe you could \n               do us a favor and stop breathing in \n               another city next time ...\n\n                                                          CUT TO:\n\n     EXT. FIRST AVE--NIGHT\n\n     12 Young heading up the avenue.\n\n                           MARCUS\n               I ever tell you about the time years \n               ago I was on this ledge uptown, trying \n               to talk this psycho inside?\n\n                           FRANK\n               Where the guy jumped and you almost \n               fell. No, you never told me that \n               story.\n\n                           MARCUS\n               No, you never listened. I was going, \n               man, if someone on high hadn't pulled \n               me in. I had put all I had into saving \n               this dumbass lowlife suicidal that\n               when he went down, there was a part \n               of me that wanted to go with him.\n\n                           FRANK\n               Make a left here. I want to stop.\n\n                                                          CUT TO:\n\n     EXT. BURKE APT. BUILDING--NIGHT\n\n     Marcus stops the ambulance on 17th Street.\n\n                           FRANK\n               I'll be right back.\n\n     Frank gets out, walks over to the intercom, pushes the button \n     for 5A. Mary answers:\n\n                           MARY (V.O.)\n               Yes?\n\n                           FRANK\n               Hello, I'm Frank Pierce, from the \n               ambulance last night. I brought your \n               father into the hospital and I just \n               learned some news.\n\n                           MARY (V.O.)\n               I'll be right down.\n\n     Mary appears in a white sweater and simple gray skirt like \n     schoolgirls wear. The dark makeup is gone. She looks happy.\n\n                           MARY (CONT'D)\n               He's better, isn't he?\n\n                           FRANK\n               Well, the doctor says he's showing \n               some movement. It's still early, it \n               might mean nothing, but I thought \n               you'd want to know.\n\n                           MARY\n               I knew. I sensed it when I heard \n               your voice.\n\n                           FRANK\n               You look so different.\n\n                           MARY\n               I know. It's awful, isn't it? Night \n               of the Living Cheerleaders.\n\n                           FRANK\n               I think it looks good.\n\n                           MARY\n               I was going nuts in that waiting \n               room so I came back to check on my \n               mom.\n\n                           FRANK\n               How is she?\n\n                           MARY\n               Sleeping.\n\n                           FRANK\n               I was just going to get some food. \n               Pizza. Maybe we could.\n\n                           MARY\n               You can't kill my father that easy. \n               He'll fight forever. Like with me: \n               hasn't talked to me in three years. \n               But it's okay. Sometimes you have to \n               put things behind you.\n\n     Mary steps to the curb, raises her hand for a taxi. None in \n     sight.\n\n                           FRANK\n               Be tough to get a taxi here. We can \n               give you a ride if you like.\n\n                           MARY\n                    (looks at him)\n               Okay.\n\n     Frank opens the back doors of the bus, climbs in behind Mary. \n     They sit on the bench opposite the stretcher.\n\n                           MARCUS\n               Who's that?\n\n                           FRANK\n               She's the daughter of a cardiac arrest \n               I brought in last night. I told her \n               we'd give her a ride back to Misery. \n               Her father's showing signs of \n               improving.\n\n                           MARCUS\n               Oh, Frank, you've got it bad, so \n               much worse than I thought.\n\n                           FRANK\n               I'm hungry too. We gotta get some \n               food after this.\n\n                           MARCUS\n               God help us, he's hungry too.\n\n     Marcus turns on the radio, an old song from the sixties, as \n     they head uptown.\n\n                                                          CUT TO:\n\n     INT. MERCY CRITICAL CARE--NIGHT\n\n     Frank and Mary walking past the triage station toward the \n     curtained corner where her father lies. Next to Burke, Dr. \n     Hazmat assists an AIDS patient amid a forest of IV tubing.\n\n     Mr. Burke lies prone, two IV lines hung from poles, intubated \n     by a hose running to the ventilator, a NG tube covering his \n     nose. His eyes are permanently half open. Burke's hands and \n     feet are tied by white nylon restraints. Mary takes her \n     father's hand as Frank pulls the curtain.\n\n                           MARY\n               Dad, can you hear me?\n                    (beat)\n               Open your eyes if you can hear me.\n\n     A nearby patient SCREAMS. Mary Burke SCREAMS too:\n\n                           MARY (CONT'D)\n               He squeezed my hand!\n\n     Dr. Hazmat and MILAGROS, an intern, walk over.\n\n                           MARY (CONT'D)\n               He's moving, Doctor. He grabbed my \n               hand. Move your hand, Dad, one more \n               time.   \n                    (Burke's hand twitches))\n               See. See.\n\n                           HAZMAT\n               I'll be damned.\n                    (check's Burke's pupils)\n               It's movement, but I'm not sure how \n               voluntary.\n\n                           MARY\n               He hears me. Open your eyes, Dad.\n\n     Burke's eyes fully open. His cheeks ripple and his lips smack \n     against the tube between them. His back arches, his body \n     shakes, his arms yank at their restraints as if reaching to \n     pull out the wires and tubes. Green lights dance across the \n     EKG screen, ALARMS sound: first the cardiac monitor, next \n     the ventilator.\n\n                           HAZMAT\n               Nurse Crupp, I need ten milligrams \n               of Valium.\n\n     Hazmat and Milagros hold down Burke's arms as Crupp prepares \n     the Valium. Mary backs away.\n\n                           FRANK\n               Why don't we go outside for a little \n               while, wait until this passes.\n\n     They step away.\n\n                                                          CUT TO:\n\n     INT. LOCKER ROOM--NIGHT\n\n     Passing Griss (reading anti-white agitprop) and waiting room \n     regulars, Frank leads Mary to a small rectangular paramedic \n     locker area: sofa, desk, two banks of gray lockers, walls \n     decorated with hospital rules and regulations.\n\n                           FRANK\n               He wants to pull that tube out. It's \n               pretty painful--that's why they keep \n               him sedated--but it's a good sign.\n\n                           MARY\n               You sure? I know my father would \n               hate to be tied down. He wouldn't \n               even go to the dentist.\n\n     He sits across from her, wishing he could be in three seats \n     at once, each to watch her from a different angle.\n\n                           FRANK\n               That's how it's done. You have to \n               keep the body going until the brain \n               and heart recover enough to go on \n               their own.\n\n                           MARY\n               He's better, though, right?\n\n                           FRANK\n                    (reluctant)\n               He's better.\n\n                           MARY\n               Look, I'm sorry, but it's important \n               to me. I mean, a week ago I was \n               wishing he was dead. And now I want \n               hear his voice again, just once more--\n               you know what I mean?\n\n     Marcus enters with a small pizza and two cokes.\n\n                           MARCUS\n               Went over to Sal's got this. There \n               must be some place in Hell for a guy \n               who sells a dollar-fifty a slice. I \n               call you if anything comes up.\n\n                           FRANK\n               Thanks.\n\n     Marcus exits.\n\n                           MARY\n               I'm not really hungry.\n\n     She says as she picks up a slice of cheese pizza.\n\n                           MARY (CONT'D)\n               My father was a great man, you know. \n               There was nobody he wouldn't help. \n               You know that crazy guy Noel who I \n               gave water to last night? He lived \n               in our house for almost a year. A \n               total stranger he'd do anything for, \n               his own family though ...\n\n                           FRANK\n               It's best not to ...\n                    (off her look)\n               It's good pizza, huh?\n\n                           MARY\n               Not as good as Nino's.\n\n                           FRANK\n               You remember that pizza place, Joe's \n               on Tenth Street maybe fifteen years \n               ago?  When you ordered a pie it came \n               with a little plastic madonna in the \n               middle?\n\n                           MARY\n               Yeah, or Saint Anthony. You from the \n               neighborhood?\n\n                           FRANK\n               I grew up on Elizabeth. I went to \n               Blessed Sacrament.\n\n                           MARY\n               On yeah? I went to Holy Name. Where'd \n               you go to high school?\n\n                           FRANK\n               We moved out after that. Upstate.\n\n                           MARY\n               Like everybody else--except us. Always \n               standing on the sidewalk waving \n               goodbye to moving trucks. Your parents \n               ... ?\n\n                           FRANK\n               They're fine. My old man was a bus \n               driver, mom a nurse--I was sort of \n               born to it, I guess.\n\n                           MARY\n               You married?\n\n                           FRANK\n               Ah, no. I was.\n                    (beat)\n               It's hard to explain. She had a hard \n               time adjusting to, well, maybe it \n               was my fault too.\n\n     Pause.   This thought hangs in the air. From outside: a \n     BELLICOSE DRUNK is escorted into the ER.\n\n                           DRUNK (O.S.)\n               White cocksuckers! Get your--Ow!\n\n                           MARY\n               Is it always this bad in here? I \n               mean, how does anyone survive?\n\n                           FRANK\n               It's been bad lately, but it's always \n               bad.\n\n                           MARY\n               How long you been doing this?\n\n                           FRANK\n               Five years.\n\n                           MARY\n               Wow, you musta seen some things, \n               huh? What's the worst thing you ever \n               seen?\n\n                           FRANK\n               You learn to sort of block it out, \n               you know, like cops fence off a crime \n               scene. But then something good will \n               happen and everything will just glow.\n\n                           MARY\n               You must get a lot of overdoses. I \n               bet you picked me up a couple of \n               times.\n\n                           FRANK\n               I think I'd remember that.\n\n                           MARY\n               Maybe not. I was a different person \n               then. Does everybody you meet spill \n               their problems on you like this?\n\n                           FRANK\n               Mostly. It must be my face. My mother \n               always said I looked like a priest.\n\n                           MARY\n                    (wipes her mouth)\n               I better go check on my father. Thanks \n               for the pizza. I owe you one. Maybe \n               when he gets better, you know, when \n               we're done with all this.\n\n                           FRANK\n               Sure.\n\n     Frank puts his hand out but she's already on her feet. He \n     grabs the last slice of pizza, hands it to Griss as she heads \n     back to Critical Care.\n\n                           FRANK (CONT'D)\n               Look after her, Griss, okay?\n\n     Griss nods.\n\n                                                          CUT TO:\n\n     EXT. CANAL STREET--NIGHT\n\n     12 Young back on the job, moving with traffic.\n\n                           MARCUS\n               Rule number one: Don't get involved \n               with patients. Rule number two: Don't \n               get involved with patient's daughters. \n               You understand?\n\n                           FRANK\n               What about rule number three: Don't \n               get involved with dispatchers named \n               Love.\n\n                           MARCUS\n               You don't know the first thing about \n               rule number three, cannot begin to \n               understand the complexities of that \n               rule. Come on, let's go look at some \n               hookers. The Kit Kat will be letting \n               out. \n                    (relevant to nothing)\n               Don't ever call a junkie whore a \n               crackhead. They get real mad.\n\n     Marcus swings up First Ave:\n\n                           MARCUS (CONT'D)\n               Look at these women. You can't even \n               tell who's a hooker anymore. Whatever \n               happened to go-go boots and hot pants?  \n               They wear anything now, walk outta \n               the house with whatever they got \n               on ...\n\n     Frank watches night tableaus (police cars flashing, lovers \n     kissing, woman crying hysterically, drunken slugfest) as his \n     mind wanders:\n\n                           FRANK (V.O.)\n               The street is so much more \n               unpredictable than the ER and to \n               prepare for the unexpected I was \n               taught to act without thinking, like \n               an army private who can take apart \n               and reassemble a gun blindfolded ...\n\n     Frank notices another EMS bus: Tom Walls wheeling a stretcher--\n     Noel, face bloodied, lies restrained as Walls' partner opens \n     the rear doors.\n\n                           FRANK (V.O.) (CONT'D)\n               I realized that my training was useful \n               in less than ten percent of the calls \n               and saving someone's life was rarer \n               than that. As the years went by I \n               grew to understand that my role was \n               less about saving lives than about \n               bearing witness. I was a grief mop \n               and much of my job was to remove, if \n               even for a short time, the grief \n               starter or the grief product. It was \n               enough I simply showed up.\n\n     Marcus continues as if uninterrupted:\n\n                           MARCUS\n               ... look at her. Leaves you no idea \n               what's underneath, not even a \n               suggestion. Could be a skeleton for \n               all you know.\n\n     They pass a working girl in a rain slicker who pulls off her \n     hood to look at them: a familiar face.\n\n                           MARCUS (CONT'D)\n               Nice though, pulling back her hood \n               as we drive by. There's a mystery to \n               it, then she shows you.\n\n                           FRANK\n               She's no whore, Marcus.\n\n                           MARCUS\n               We're all whores, Frank. You know \n               what I'm talking about, the way she \n               looked at me.\n\n                           FRANK\n               She wasn't looking at you, man, she \n               was looking at me.\n\n     Frank, looking back at the Rose face, hears her faintly say:\n\n                           \"ROSE\"\n               Why did you kill me, Frank?\n\n                           FRANK\n               I didn't kill you.\n\n     Marcus, not hearing \"Rose's\" voice, replies:\n\n                           MARCUS\n               No, you didn't, Frank, thank you.\n               But there's still a couple hours \n               left on the shift.\n\n                           FRANK\n               I need a drink, that's all.\n\n     Dispatcher Love's voice cuts through:\n\n                           DISPATCHER LOVE\n               Twelve Young, answer the radio. I \n               have a call for you.\n\n                           MARCUS\n               She said to me, I love the way you \n               talk on the radio.\n\n                           DISPATCHER LOVE\n               I can't wait all night, Young. I'm \n               holding a priority and if you don't \n               answer I'm going to knock you out of \n               service.\n\n                           MARCUS\n                    (keys radio)\n               Don't worry, hon. Young is here and \n               he's gonna help out--just remember, \n               you owe me.\n\n                           DISPATCHER LOVE\n               You're going to three-four Avenue C, \n               17 year-old female cardiac arrest, \n               no further information.\n\n                           MARCUS\n               Ten-four, hon.\n\n     Marcus hits the siren.\n\n                                                          CUT TO:\n\n     INT. RUNDOWN TENEMENT--NIGHT\n\n     Frank and Marcus standing in a no-income apartment with their \n     cardiac equipment. MARIA, a 17 year-old Hispanic girl, lies \n     moaning and breathing shallow on a ratty sofa. CARLOS, her \n     equally young boyfriend, watches anxiously, holding a candle \n     for light.\n\n                           MARCUS\n               Look at that. A fat junkie. That's a \n               first.\n\n                           FRANK\n                    (to Maria)\n               What's wrong.\n\n     Carlos speaks broken English:\n\n                           CARLOS\n               No English. She has terrible pain in \n               her belly.\n\n                           FRANK\n                    (hands on stomach)\n               Pregnant.\n\n                           CARLOS\n               No, no, that's impossible.\n\n                           FRANK\n               Are you pregnant? Estas embarazada?\n\n     Maria shakes her head, looks away.\n\n                           FRANK (CONT'D)\n               Can you walk? Puedes caminar?\n\n                           CARLOS\n               She say she in great pain.\n\n                           FRANK\n               Thanks for the translation.\n                    (to Maria)\n               What's your name? Nombre?\n\n                           MARIA\n               Maria.\n\n                           FRANK\n               Let's have a look.\n\n                           MARCUS\n                    (to Carlos)\n               You know each other a long time?\n\n                           CARLOS\n               Two years. Ever since we left island.\n\n                           MARCUS\n               In that time, you ever have sex?\n\n                           CARLOS\n               Never. No cigarettes, no drugs, no \n               booze.\n\n                           MARCUS\n               No underwear?\n\n                           CARLOS\n               We are virgins.\n\n                           FRANK\n                    (inspecting Maria)\n               Oh Jesus, we'd better go. Call for \n               backup.\n\n     Marcus radioing for assistance.\n\n                           FRANK (CONT'D)\n               It's coming.\n                    (to Carlos)\n               Hold her down.\n\n                           MARCUS\n               What's that, Frank?\n\n                           FRANK\n               Three legs.\n\n                           MARCUS\n               That's too many.\n\n                           FRANK\n               Backup?\n\n                           MARCUS\n               It's coming.\n\n                           CARLOS\n               Is she dying?\n\n                           FRANK\n               She's having a baby. Twins.\n\n                           CARLOS\n               Es impossible.\n\n                           FRANK\n               You can trust me on this one.\n\n                           CARLOS\n               It's a miracle.\n\n     Maria SCREAMS. Marcus kneels beside Frank as a distant EMS\n     siren grows louder.\n\n                           FRANK\n               You take the first one.\n\n     Frank looks up at the screaming mother: it's not her face. \n     It's Rose. The Rose face.\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     Frank rushing past Nurse Constance, carrying a newborn in \n     thermal wrap, passing Noel restrained on a gurney:\n\n                           FRANK\n               She had a pulse.\n\n                           NURSE CONSTANCE\n               Code! Code Blue!\n\n     Hazmat rushing over:\n\n                           HAZMAT\n               Oh Jesus, put her on the monitor. \n               Where's the pediatric code cart?\n                    (Odette arriving with \n                    cart)\n               Odette give me that tube. All right, \n               flatline--let's do CPR. step back, \n               Frank. How many months?\n\n                           FRANK\n               Can't tell. It was a breech, twins. \n               The other one seems okay, though. \n               Marcus is taking him and the mother \n               to Maternity.\n\n     Across the room an obscenity-spouting FEMALE CRACKHEAD being \n     restrained by a patrolman and hospital security--adding to \n     the sense of emergency and chaos. DR. MISHRA, 50, Pediatric \n     MD, and nurses squeeze toward newborn edging Frank back. \n     Mishra takes an osteocatheter out of the cart, forces it \n     into the now obscured baby as Nurse Constance massages the \n     infant's chest.\n\n     Hazmat steps over to the now restrained Crackhead.\n\n                           CRACKHEAD\n               I'm a mother! I got a daughter! I \n               got rights!\n\n                           HAZMAT\n                    (to nurse)\n               10 mil Valium, stat.\n\n     Mishra, worried, checks with Nurse Constance--they're losing \n     the newborn:\n\n                           MISHRA\n               Status.\n\n                           NURSE CONSTANCE\n               I think there's a pulse. I think.\n\n     Frank looking at the EKG monitor--a green flatline--backs \n     away.\n\n                           MISHRA\n               Fuck.\n\n                           NURSE CONSTANCE\n               Nothing.\n\n     Frank walking away, not looking where he's going, backs into \n     Noel's gurney.\n\n                           NOEL\n               Excuse me, sir, excuse me, I would \n               please trouble you for one cup of \n               water. The smallest thing in the \n               world to ask for, water. A man is \n               dying and that is me.\n\n     Noel, his face battered from his encounter with Walls, pulls \n     at his restraints, howls:\n\n                           NOEL (CONT'D)\n               For days I've eaten nothing but sand, \n               O Lord, I waited so long.\n\n     Hazmat looks over:\n\n                           HAZMAT\n               Christ. Who the hell woke him up?\n\n                                                          CUT TO:\n\n     EXT. CANAL STREET--NIGHT\n\n     12 Young on the road again, sky turning blue.\n\n                           FRANK\n               Don't give me that look.\n\n                           MARCUS\n               What look?\n\n                           FRANK\n               You know what I'm talking about. \n               It's all over your face. That I-just-\n               saved-a-little-baby-boy look.\n\n                           MARCUS\n               We just saved a little baby boy. \n               Think of it that way.\n\n                           FRANK\n               I don't want to hear about it, okay? \n               That's three jobs for the night. \n               It's over. Three jobs and time for a \n               drink. Six am, the cocktail hour. \n               Pass the bottle; I know you're \n               holding.\n\n     Marcus reaches under the seat, pulls a pint of vodka, a quart \n     of orange juice and two cups out of an old gym bag, passes \n     them to Frank.\n\n                           MARCUS\n               The bar is now open.\n\n     Frank mixes a screwdriver for Marcus, straight vodka for \n     himself.\n\n                           FRANK\n               I hate vodka.\n\n                           MARCUS\n               Please, a little decorum if you will. \n               What I was going to say is, is that \n               holding that baby in my arms, I felt \n               like I was twenty-one again. A call \n               like that makes me think of going \n               back to three nights a week, not \n               two, start running again, cut down \n               on the drinking.\n\n                           FRANK\n                    (pours drink)\n               I'll drink to that.\n\n                           MARCUS\n                    (raises cup)\n               Here's to the greatest job in the \n               world.\n\n                           FRANK\n                    (knocks vodka back)\n               Greatest job in the world.\n\n                           DISPATCHER LOVE\n               Twelve Young, I have priorities \n               holding. Pick up the radio.\n\n                           FRANK\n               Don't do it, Marcus. Tell her the \n               bus died, our radio's not working, \n               our backs are out. Tell her we're \n               too drunk to take any more calls.\n\n                           MARCUS\n               Let's do it!\n                    (keys mike)\n               It's Marcus, Love, only for you.\n\n                           DISPATCHER LOVE\n               Male diff breather, approximately \n               30, Houston and A.\n\n                           MARCUS\n               Ten-four.\n\n     Marcus hits the sirens and lights, accelerates to full speed. \n     The vodka spills; Frank grabs the dash.\n\n                           MARCUS (CONT'D)\n               I'm coming, Love! I'm coming!\n\n     Marcus swings the bus wildly to avoid a cab, SKIDS into a \n     turn--and smack toward a parked truck. Frank covers his face \n     and screams.\n\n     CRASH! The back of the ambulance rams into the truck, the \n     rear windows shatter.\n\n                           MARCUS (CONT'D)\n               Shit.\n\n     Frank looks around, realizes no one is hurt. He climbs out:\n\n                           MARCUS (CONT'D)\n               Where you going?\n\n                           FRANK\n               I quit! I'm through!\n\n                           MARCUS\n               You can't leave me now.\n\n     Frank walks up Avenue A, leaving Marcus and the disabled \n     vehicle. The first rays of sun strike the buildings ahead.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--DAYBREAK\n\n     Frank turning the corner, checking his watch, about to enter \n     the Dark Bar across the corner from the hospital, watching \n     Noel run past him and away, skipping from one foot to the \n     other.\n\n                           FRANK\n               So long, Noel.\n\n     The Emergency doors open: Mary Burke, head down, looking \n     neither direction, walks away from Frank. Griss steps out \n     after her. Frank joins him:\n\n                           FRANK (CONT'D)\n               What's going on, Griss?\n\n                           GRISS\n               Your friend there just untied the \n               water beggar. Griss was coming out \n               to thank her. Probably saved Griss a \n               murder charge.\n                    (about Mary)\n               Having a tough time of it.\n\n     Mary starts to run. Frank follows. She pushes her way through \n     a group of high schoolers; Frank does likewise, keeping his \n     distance.\n\n     Five blocks later, Mary hesitates at a plaza outside the \n     Stuyvesant Town projects,\n\n                                                          CUT TO:\n\n     EXT. STUYVESANT TOWN--MORNING\n\n     Frank stops a few steps away from Mary; Mary turns.\n\n                           FRANK\n               Excuse me. You seemed like you were \n               in trouble.\n\n                           MARY\n                    (steps over)\n               I'm all right. I just can't stand to \n               see people tied up.  I'm in the \n               waiting room for hours, listening to \n               Noel screaming. The only reason he's \n               screaming is 'cause he's tied up.\n\n                           FRANK\n               Don't seem so bad to me.\n\n                           MARY\n               Don't say that. I wanted to cut my \n               father loose too. They told me he \n               almost died and five minutes later \n               they say he's better and I go in. \n               It's killing me seeing him fighting \n               like that.\n                    (gazes up building)\n               Look, since you're here, maybe you \n               could do me a favor. I need you to \n               wait for me outside this building, \n               okay? I have to visit a friend who's \n               sick.\n\n                           FRANK\n               Okay.\n\n     Mary takes a few steps, turns back.\n\n                           MARY\n               I'm only asking because it's a \n               dangerous building. There's been \n               some robberies, a woman was raped \n               not long ago. This woman I'm seeing, \n               she'll want to talk to me all day, \n               but if I can point to you out the \n               window and say you're waiting, I can \n               be out quick. if anything happens, \n               I'll be in apartment 16M.\n\n                           FRANK\n               Maybe I should come up with you.\n\n                           MARY\n               If I'm not back in fifteen minutes, \n               hit the buzzer. That way she'll let \n               me go.\n\n                           FRANK\n               Nothing's going to happen. I'll come \n               with you.\n\n                           MARY\n               No, I'll be fine. I'm just visiting \n               a sick friend.\n\n     She walks into the building. He follows.\n\n                                                          CUT TO:\n\n     INT. ELEVATOR--DAY\n\n     The dinged metal doors shudder shut as Frank follows Mary \n     into the graffittied elevator. It jumps three feet upwards, \n     stops, then continues, metal scraping concrete at each passing \n     floor.\n\n                           MARY\n               I shouldn't have asked you to come.\n\n                           FRANK\n               You asked me not to come.\n\n                           MARY\n               Promise you won't go inside.\n\n                           FRANK\n               Fifteen minutes.\n\n                           MARY\n               I just have to relax a little. Not \n               feel so guilty all the time.\n\n                           FRANK\n               We can still go back. I'll walk you \n               home. You sleep a couple of hours, \n               watch some TV, take a bath.\n\n                           MARY\n               Don't be a cop. If you have any doubts \n               about this, it's my fault.\n\n     The elevator jerks to a stop; the doors open.\n\n                                                          CUT TO:\n\n     INT. SIXTEENTH FLOOR--MORNING\n\n     Mary turns to Frank:\n\n                           MARY\n               You go on home, okay. I'm fine, \n               really. I don't need you. Thanks.\n\n     Mary pushes the bell at 16M. KANITA, 25, wearing a paisley \n     robe, opens the doors and says:\n\n                           KANITA\n               Hey Cy, guess who's here?\n\n                           COATES (O.S.)\n               Mary ...\n\n     The elevator doors close on Frank.\n\n                                                          CUT TO:\n\n     INT. LOBBY--MORNING\n\n     Frank paces past the sleeping security guard, checks his \n     watch.\n\n     He presses the elevator button.\n\n                                                          CUT TO:\n\n     INT. THE OASIS--MORNING\n\n     The door to 16M opens:\n\n                           KANITA\n               Can I help you?\n\n                           FRANK\n               Mary Burke. She's a friend.\n\n                           KANITA\n               She's not here.\n\n     Frank pushes past her.\n\n                           KANITA (CONT'D)\n               Wait a minute. You can't go in.\n\n     CY COATES, 45, light-skinned black, stands in the smoky room. \n     Dark curtained windows block the sunlight; a dirty fish tank \n     casts a green glow across the beat-up furniture.\n\n     A large framed photo of a volcano hangs over the couch.\n\n                           COATES\n               It's okay, Kanita. Come on in.\n\n                           KANITA\n               He looks like a cop.\n\n                           COATES\n               He's not a cop, he's a medic.\n                    (extends hand)\n               I'm CY Coates.\n\n                           FRANK\n               Frank Pierce.\n\n                           COATES\n               Mary said you might be coming.\n\n                           FRANK\n               Where is she?\n\n                           COATES\n               Sleeping in the back.\n\n                           FRANK\n               She asked me to pick her up.\n\n                           COATES\n               I know, but she told me to tell you \n               she wants to crash here a few hours. \n               Terrible about her father, isn't it?\n\n                           FRANK\n               I better just go in and see her.\n\n     Kanita sits on the sofa next to an unshaven sleeping man. \n     Coates gestures:\n\n                           COATES\n               I call this the Oasis. Refuge from \n               the world out there. Did you know \n               two people were shot in this building \n               last week?\n\n     Frank heads down the hall toward the rear of the apartment; \n     Coates follows. They pass an open door where inside TIGER, a \n     fat man with dried blood running down the corner of his mouth, \n     sits punching computer keys at a desk.\n\n                           COATES (CONT'D)\n               Careful. That's the Tiger. The lady's \n               down the hall. Welcome to Sunrise \n               Enterprises, Frank, the stress-free \n               factory.\n\n     In the NEXT ROOM Mary lies on a mattress on the floor, yellow \n     sheet pulled up to her neck. Frank leans over her:\n\n                           FRANK\n               Mary. Mary, we've got to get going.\n\n                           MARY\n                    (groggy)\n               No, no.\n\n                           COATES\n               She wanted something to help her \n               sleep.\n\n                           FRANK\n               Mary, we really have to go.\n\n     Mary blindly swings her fist at him, collapses unconscious \n     back to the mattress.\n\n                           COATES\n               Frank, she's suffered enough. She's \n               okay, I promise.\n                    (puts hand on Frank's \n                    shoulder)\n               C'mon, Frank.\n\n     Coates escorts Frank back to the LIVING ROOM.\n\n                           COATES (CONT'D)\n               I'm always interested in people in \n               stressful occupations and being a \n               paramedic is about as stressful as I \n               can imagine. Here, sit down. What's \n               it like? Tell me some war stories.\n\n                           FRANK\n                    (sits)\n               Got a beer?\n\n     Cy sits across from him, pulls out a pin-sized joint, lights \n     it:\n\n                           COATES\n               That shit is poison, Frank. We don't \n               drink alcohol here. What you need is \n               one of these.\n\n                           FRANK\n               Did you give Mary something called \n               Red Death?\n\n                           COATES\n               Red Death?\n                    (passes joint to Kanita)\n               Tell me something, Frank--does killing \n               your clients make good business sense \n               to you? The kids selling that shit \n               have no sense. They'll be taken care \n               of, don't worry about that.\n\n                           FRANK\n               I should be going. I just quit.\n\n                           COATES\n               Sleep is all stress reduction. Here.\n                    (offers white pill)\n               You take one of these, sleep two \n               hours, that's all you need.\n                    (Frank hesitates)\n               Why do you think I'm telling you \n               this, Frank--for my health?  You \n               ought to look at yourself in the \n               mirror, man. Kanita, get him a glass \n               of water.\n\n     Frank watches as Kanita gets up, walks to the kitchen. Coates \n     places the pill in his hand.\n\n                           FRANK\n               Is this what you gave Mary?\n\n                           COATES\n               That's the stuff. I call it the Red \n               Lion. Very king-of-the-jungle.\n\n     No language, only brute power. You can't believe how relaxing \n     it is.\n\n     Kanita returns with a glass of water, gives it to Frank; \n     Coates stands, feeds the fish.\n\n                           COATES (CONT'D)\n               Frank, I'm trying to help you.  Drink \n               up.\n\n     Frank swallows the white pill, drinks the water. He places \n     his arms on the chair:\n\n                           FRANK\n               I guess I'll be going.\n\n                           COATES\n               Just take it easy.\n\n     Frank looks around the smoke-filled room. Kanita walks over, \n     extends her hand.\n\n                           KANITA\n               Take my pulse.\n                    (he does)\n               It's good, isn't it?\n\n                           FRANK\n               Perfect.\n\n                           KANITA\n               I knew it. I was wrong about you.  \n               You're not so bad.\n\n     Kanita runs her hand across his shoulders. Frank starts to \n     nod. The room getting warm and dark. His eyelids lower: sleep, \n     precious sleep.\n\n                                                          CUT TO:\n\n     FRANK'S ROSE DREAM\n\n     Voices and sounds echo through the purple haze as Frank's \n     mind drifts in time and space. Action and sounds slow, speed \n     up, distort--intermix with the Oasis--as Frank goes back:\n\n     This is how it begins: the last time, the first time ...\n\n     Larry exits 13 Zebra as Rose, 18, wearing a yellow rain \n     slicker, falls to her knees in the miasmic dream stank, onto \n     the sidewalk, then onto her back. From forty feet away Frank, \n     seeing her reach for a parking meter, grabbing the tube kit, \n     running.\n\n     Rose gasping for breath, Frank falling to his knees, lifting \n     her tongue, prying her teeth apart, slipping the blade between \n     her lips--Rose not breathing: waiting for her to inhale, \n     shooting the tube down her vocal cords. Larry listening to \n     lung sounds, belly sounds:\n\n                           LARRY\n               You're in the stomach!\n\n                           FRANK\n               You sure?\n\n                           ROSE\n               Rose!\n\n                           FRANK\n               Huh?\n\n                           ROSE\n               My name. Rose.\n\n                           LARRY\n               You're in the stomach, man.\n\n     Frank pulling the tube out, trying again.\n\n     Somewhere: CY Coates laughs.\n\n                           LARRY (CONT'D)\n               You're in the stomach! Let me try.\n\n                           FRANK\n               One more time!\n\n     Rose going blue, pulse rate dropping, EKG Slowing: Jim \n     Morrison singing.\n\n                           LARRY\n               Stomach again.\n\n                           FRANK\n               No way!\n\n     Larry ripping the tube from Frank's hands, taking over, \n     pushing Frank aside, trying CPR, intubating Rose, air moving \n     into her lungs--it doesn't matter. Rose is gone.\n\n     Frank hears a SCREAM: it's his own voice.\n\n                                                          CUT TO:\n\n     INT. THE OASIS--DAY\n\n     Frank standing screaming in the living room. CY walking over, \n     Kanita standing, the sleeping man awaking.\n\n                           COATES\n               Frank, take it easy. what happened?\n\n                           KANITA\n               He flipped out.\n\n     Frank bends over in pain.\n\n                           COATES\n               Be cool, man. You're having a \n               paradoxical reaction. It can happen.\n                    (to Kanita)\n               Didn't I tell you this guy was \n               stressed out?\n\n                           KANITA\n               Stressed? He's psycho.\n\n     Frank heads to where Mary sleeps.\n\n                           COATES\n               Frank, where you going?\n\n     In the BACK BEDROOM, Frank picks up Mary, hoists her over \n     his shoulder fireman-style and heads out.\n\n                           COATES (CONT'D)\n               You're making a mistake. Sit down \n               and relax a minute.\n\n     Frank opens the front door--no one stops him--exits.\n\n                           COATES (CONT'D)\n                    (calling)\n               She'll be back. And, by the way, you \n               owe me ten bucks.\n\n                                                          CUT TO:\n\n     INT. STUYVESANT LOBBY--DAY\n\n     The elevator doors open. Frank sets Mary on her feet.\n\n                           MARY\n               I can walk.\n\n     She says weaving out of the front doors.\n\n                                                          CUT TO:\n\n     EXT. STUYVESANT TOWN--DAY\n\n     Mary walks a Few steps into the plaza, stumbles; Frank catches \n     her.\n\n                           MARY\n               Let go of me.\n                    (he relaxes)\n               You shouldn't have come up. I told \n               you not to. You could have gotten us \n               both killed.\n\n     Mary heads up the avenue: past baby strollers, postal workers, \n     deliverymen.\n\n                           MARY (CONT'D)\n               You and CY have a nice talk? He tell \n               you about Sunrise Enterprises, helping \n               people? Well, I've seen him hurt \n               people. Why are you following me?\n\n                           FRANK\n               Because you can barely walk.\n\n     Frank walking slightly beside and behind, lights a cigarette.\n\n                           MARY\n               You remember Noel, from the other \n               night, how Noel is now? He wasn't \n               always like that. He was my brother's \n               best friend. Cy or Tiger or one of \n               those other goons put a bullet in \n               Noel's head. He was in a coma three \n               months. Crazy ever since.\n\n     They stop at a three-story brick apartment building.\n\n                           MARY (CONT'D)\n               This is my place.\n\n     She unlocks the door. He follows her in.\n\n                                                          CUT TO:\n\n     INT. MARY'S APT. BUILDING--DAY\n\n     Mary grabs the railing, heads up the stairs.\n\n                           MARY\n               What is it? You want to help me, you \n               feel sorry for me? Keep it to \n               yourself.\n\n                           FRANK\n               I need to sit down a minute.\n\n                           MARY\n               Or maybe you wanna fuck me? Everyone \n               else has.\n\n     Mary opens the door to her first floor apartment; Frank \n     follows. The room is clean and feminine. Unframed water colors \n     stacked against the wall atop a desk. A black lab greets \n     Mary, she pets him. Frank slumps on the sofa.\n\n                           MARY (CONT'D)\n               I've been clean two years now. I got \n               a job. I paint when I'm home. Don't \n               bother anybody. Then all this shit \n               happens.\n\n     Frank keels over onto his side, his head hitting a cushion, \n     eyes closed, dog licking his cheek.\n\n                           MARY (CONT'D)\n               Oh no you don't. You can't stay here.\n\n     He's asleep, the sound of her crying fading in his head.\n\n                                                        FADE OUT:\n\n     INT. MARY'S APT.--NIGHT\n\n     FADE IN: a passing siren wakes Frank. He thinks back, looking \n     around the darkened room, realizes where he is. The dog comes \n     over, licks his hand.\n\n                           FRANK\n               Hello, I'm Frank. Mary's friend. A \n               very close friend who loves animals.\n\n     He removes the blanket Mary has laid over him, stands:\n\n                           FRANK (CONT'D)\n               Hello?\n\n     Frank walks cautiously through the dark, finds a bathroom \n     lit by a glowing Mickey Mouse switch. He flips on the switch: \n     a string of green and red Christmas lights glow. Three types \n     of soap sit on the sink. He turns on the faucet:\n\n                           FRANK (V.O.) (CONT'D)\n               I washed my face with three kinds of \n               soap, each smelling like a different \n               season. It felt good to be in a \n               woman's room again, especially a \n               woman who wasn't comatose or severely \n               disabled. I felt that perhaps I had \n               turned a corner, like I saved someone, \n               though I didn't know who.\n\n                                                          CUT TO:\n\n     INT. EMS GARAGE OFFICE--NIGHT\n\n     Frank standing at Captain Barney's desk.\n\n                           CAPT. BARNEY\n               You're late, Pierce. I know, but I \n               can't fire you. I've got nobody to \n               work sixteen XRay with Walls.\n\n                           FRANK\n               No ...\n\n                           CAPT. BARNEY\n               I got some forms here to fill out \n               about that accident when you get the \n               time.\n                    (hands him keys)\n               I'll fire you tomorrow. I promise.\n\n                           FRANK\n               What if there is no tomorrow?\n\n                           CAPT. BARNEY\n               Go on, get outta here, Pierce, before \n               I give you a big hug.\n                    (to Miss Williams)\n               I love this guy.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Frank walks toward Sixteen XRay as Walls gets out of the \n     front seat. The EMS vehicle is dented and rusted, a relic of \n     wars and a hodgepodge of parts.\n\n                           WALLS\n               Frank, what do you know. It's you \n               and me again tonight, the Rough \n               Riders, tearing up the streets just \n               like old times.\n                    (kicks the front tire)\n               This old bus is a warrior, Frank, \n               just like us. I have tried to kill \n               him and he will not die. I have a \n               great respect for that.\n\n     Frank makes a \"be right back\" gesture, walks into ER.\n\n                                                          CUT TO:\n\n     INT. MERCY ER--NIGHT\n\n     Saturday night at the Knife and Gun Club: the joint is \n     hopping, the sound system blaring.\n\n     Frank passing Griss holding back an angry Hispanic man with \n     a bleeding arm:\n\n                           GRISS\n               Don't make me take off my sunglasses.\n\n                           FRANK\n               Morning, Griss.\n\n                           NURSE CONSTANCE\n               We're full up tonight, Frank.\n\n     Frank walks over to unit three, Mr. Burke's cubicle, pulls \n     back the curtain. Burke lies sedated, wired and tubed. Frank \n     leans over, feels Burke's pulse.\n\n     Frank's expression changes--he looks at the EKG monitor: \n     green lines seem to be at war, normal beats marching in \n     formation against wild-looking rhythms, the heart working \n     hard and not getting much done.\n\n     Burke's face twitches. Burke's voice speaks in Frank's head:\n\n                           BURKE'S VOICE\n               Go to the bank, boy, take out \n               everything you can.\n\n     Frank turns up the EKG amplitude:\n\n                           FRANK\n               Mr. Burke?\n\n                           BURKE'S VOICE\n               I'm going. I've had enough.\n\n     The alarms start to ring: EKG first, followed by the bells \n     off the oxygen saturation monitor and low drone of ventilator.\n\n     Intern Milagros pulling open the curtain behind Frank, shaking \n     her head, reaching for the defribilator paddles, handing \n     them to Frank. He steps back:\n\n                           FRANK\n                 You do it.\n\n                           MILAGROS\n                 Can't reach. You're taller.\n\n                           BURKE'S VOICE\n                 Don't do it.\n\n                           FRANK\n                 I thought he was getting better.\n\n                           MILAGROS\n                 Technically, yeah. I suppose. It \n                 doesn't matter.\n\n                           FRANK\n                 Why not?\n\n                           MILAGROS\n                 Tha family wants us to do everything \n                 to save him--so, that's it. They \n                 want to keep him alive, they want to \n                 believe in miracles, we keep him \n                 alive. Shock him, Frank. He'll come \n                 back. He always comes back.\n\n                           FRANK\n                    (takes paddles)\n                 Clear!\n\n     Frank shocks Burke: his body convulses.\n\n                           BURKE'S VOICE\n                 Ow!\n\n     The heartbeats on monitor return to regular formation.\n\n                           BURKE'S VOICE (CONT'D)\n                 You son of a bitch.\n\n                           MILAGROS\n                 Should I increase the lidocaine?\n\n     Frank, despondent, not listening, walks away.\n\n                                                          CUT TO:\n\n     EXT. AVENUE A--NIGHT\n\n     16 XRay driving past a strip of night clubs and restaurants: \n     the sidewalks full of young people laughing, jostling, \n     embracing.\n\n     Walls driving. In addition to the EMS two-way and AM radio, \n     Walls keeps a police band walkie-talkie open. He looks into \n     the back of the bus:\n\n                           WALLS\n               Frank, what you doing back there?\n\n     Frank places an open drug box on the stretcher, pulls out an \n     IV set, wraps a tourniquet around his left bicep.\n\n                           FRANK\n               I'm sick, Tom. I need a cure.\n                    (injects himself)\n               Vitamin B cocktail, followed by an \n               amp of glucose and a drop of \n               adrenaline. Not as good as beer, but \n               all I got.\n\n                           WALLS\n               Come on, Frank. There's blood spilling \n               in the streets.\n\n     Frank crawls back in front carrying the IV bag, puts on the \n     oxygen mask, turns on the main tanks, takes a deep hit.\n\n                           FRANK\n                    (pulls off mask)\n               These are hard times, Tom.\n\n                           WALLS\n               Yeah. Great, isn't it?\n\n                           FRANK\n               Great to be drunk. Sobriety's killing \n               me.\n\n                           WALLS\n               Look up, Frank. Full moon. The blood's \n               gonna run tonight. I can feel it. \n               Our mission: to save lives.\n\n                           FRANK\n               Our mission is coffee, Tom. A shot \n               of the bull, Puerto Rican espresso.\n\n                           WALLS\n               Ten-four. El Toro de Oro. Blast off.\n\n     Walls hits the sirens, accelerates.\n\n                           FRANK\n               The cure's not working, Tom. Maybe \n               we should go back to the hospital.\n\n                           WALLS\n               Don't worry, kid. Tom'll take care \n               of you. Put your head out the window, \n               get some of that summer air. Listen \n               to the music. El Toro de Oro. Andale. \n               Pronto.\n\n     Walls turns up the radio, drums his hands against the wheel.\n\n                           DISPATCHER\n               Okay, units, it's suicide hour. \n               Fourteen Boy, I show you in the \n               hospital sixty minutes but I know\n               you're in the diner on 14th. Put \n               down the burger, I got a call for \n               you around the corner, 14 and 3rd, a \n               man with a noose around his neck and \n               nothing to hang it on. Sixteen XRay, \n               don't even think about getting coffee, \n               I have a call for you too.\n\n                           WALLS\n                    (on radio)\n               Sixteen XTerminator here. We like \n               our coffee bloody. Make it good--my \n               partner's dying to help someone.\n\n                           DISPATCHER\n               You're in luck, X: your patient awaits \n               you with bleeding wrists on Avenue C \n               and Fourth.\n\n     Frank pulls the IV needle out of his arm, searches the glove \n     compartment:\n\n                           FRANK\n               Tom, where are the Band-aids? This \n               is an ambulance, isn't it?\n\n                           WALLS\n                    (hitting the gas)\n               Look out!\n\n     16 XRay lurches forward.\n\n                                                          CUT TO:\n\n     EXT. AVENUE C AND 4TH--NIGHT\n\n     16 XRay brakes to a stop before a duster of derelicts, junkies \n     and night people. Two DRUNKS are trying to help a friend \n     with CUT WRISTS.\n\n                           WALLS\n               What the hell's going on?\n\n                           DRUNK #1\n               You've gotta take him to the hospital. \n               He tried to kill himself. Show him \n               your wrist. Show A.\n\n     Cut Wrists gets up, leans against the ambulance, shaking.\n\n                           DRUNK #1 (CONT'D)\n               See, he ain't right.\n\n                           WALLS\n               Hold it. I will not take anyone\n               anywhere against his will. This is\n               America. People have rights.\n\n                           DRUNK #2\n               He was bleeding before. He kept \n               spilling his beer. I gave him mouth-\n               to-mouth.\n\n                           WALLS\n               You're lucky you didn't kill him.\n                    (to Cut Wrists)\n               We're going to hear it straight from \n               the loony's mouth. Are you crazy? \n               Did you try to bump yourself off?\n\n                           CUT WRISTS\n                    (salivatory)\n               Yesssss.\n\n                           WALLS\n               Why didn't you say so.\n\n     Walls escorts Cut Wrists into the back of the bus, pulls a \n     plastic electric patch off the EKG monitor. Frank joins them.\n\n                           WALLS (CONT'D)\n               Sir, I am going to give you some \n               medicine that is still very \n               experimental. It's from NASA, and \n               although the astronauts have been \n               using it for years, we are the first \n               service to try it. I will put this \n               patch on your forehead like this, \n               and in about a minute you will have \n               to relax.\n                    (places patch)\n               You will forget all your suicidal \n               feelings. It's very important that \n               you wear this for a least twenty-\n               four hours and keep checking the \n               mirror. If the patch turns green you \n               have to see the doctor immediately. \n               The side effects could be fatal.\n\n     Cut Wrists nods.\n\n                           FRANK\n               This is the worst suicide attempt \n               I've ever seen. You feel the pulse? \n               Here. That's where you cut, and it's \n               not across, it's down like so.\n                    (takes out his knife)\n               Here take it.\n\n                           CUT WRISTS\n                    (shaking)\n               I can't.\n\n                           FRANK\n               With all the poor people of this \n               city who wanted only to live and \n               were viciously murdered, you have \n               the nerve to sit here waiting to die \n               and not go through with it. You make \n               me sick. Take it.\n\n     Cut Wrists bolts out of the back of the bus, trips as he \n     hits the ground, runs down the street, turning the corner \n     still holding the patch to his forehead.\n\n                           WALLS\n               We cured him, Frank. When we work \n               together there's nothing we can't \n               fix.\n\n                                                          CUT TO:\n\n     EXT. EL TORO DE ORO--NIGHT\n\n     16 XRay parked outside a fluorescent chrome and plastic coffee \n     shop.\n\n                                                          CUT TO:\n\n     INT. EL TORO DE ORO--NIGHT\n\n     Frank smoking at a formica table, his walkie-talkie upright \n     next to an ashtray. Walls returns with two espressos as the \n     Dispatcher rattles on.\n\n                           WALLS\n                    (sits)\n               Sounds like they're trying to clean \n               up the bus terminal tonight,\n\n     Frank doesn't answer. Tom shines his mini-flashlight in \n     Frank's eyes:\n\n                           WALLS (CONT'D)\n               Hello, hello. Major Tom to Frank, \n               time to come home.\n\n     Frank watches a hooker on the sidewalk. Two street punks \n     dripping gold and attitude head the opposite direction: one \n     turns his head, looks at Frank--it's Rose. The Rose face.\n\n     Frank getting up, grabbing his walkie and coffee, heading \n     out.\n\n                           WALLS (CONT'D)\n               Where you going?\n\n                           FRANK\n               C'mon, Tom. The city's burning.\n\n                                                          CUT TO:\n\n     EXT. HOUSTON--NIGHT\n\n     Frank at the wheel, driving high speed: radio full volume.\n\n                           WALLS\n               Whatja doing?\n\n                           FRANK\n               I feel the need, the need for speed. \n               I'm driving out of myself.\n\n                           WALLS\n               The brakes are shot.\n\n                           FRANK\n               I've taken that into consideration.\n\n                           WALLS\n               You okay?\n\n                           FRANK\n               I never felt better in my life.\n\n                           DISPATCHER\n               Sixteen XRay, XRay.\n\n                           FRANK\n                    (keys radio)\n               X.\n\n                           DISPATCHER\n               First of all, I want you to know how \n               sorry I am about this. I've always \n               liked you two. A unit above none, a \n               legend in its own lunchtime, so it \n               hurts me deeply to do this but I \n               have no choice. You must go to Second \n               and St. Marks. In front of a liquor \n               store you'll find a forty year-old \n               male, unconscious, lying next to his \n               wheelchair. Do I have to say more?\n\n                           FRANK\n                    (to radio)\n               You've said too much already.\n\n                           WALLS\n               Mr. Oh.\n\n                           FRANK\n               It's early for him.\n\n                           WALLS\n               That's all right, we're not meant to \n               do Oh tonight. Something is going to \n               happen. I can feel it.\n\n     Tom hears something on the police band: a call for units to \n     Stuyvesant Town.\n\n                           WALLS (CONT'D)\n               Bingo.\n                    (keys police walkie)\n               EMS to Central. What was that call?\n\n                           POLICE DISPATCH\n               A jumper. Stuyvesant Town.\n\n                           WALLS\n               Ten-four.   One minute out.\n\n                           DISPATCHER\n               Sixteen, Sixteen XRay. Level One \n               Emergency.\n\n     But they're not listening--Frank's off to Stuyvesant Town.\n\n                                                          CUT TO:\n\n     EXT. STUYVESANT TOWN--NIGHT\n\n     Police cars, fire engines, a massive Emergency Service rescue \n     truck all flashing dome lights on the street, on the plaza \n     surrounding Cy Coates' building: cops, Swat team, spotlights, \n     onlookers.\n\n     Frank and Tom, getting out, looking up: the spotlit figure \n     of Cy Coates, thirteen floors above, suspended on a railing, \n     legs dangling.\n\n                           WALLS\n               Whadda we bring?\n\n                           FRANK\n               Better bring it all.\n\n                                                          CUT TO:\n\n     INT. LOBBY--NIGHT\n\n     Frank and Tom, lugging their equipment, meet up with cops, \n     firemen and their rescue equipment.\n\n                           FRANK\n               The elevator's fucked. We'd never \n               all fit anyway. Let's go.\n\n                           FIREMAN\n               That's thirteen flights.\n\n                           WALLS\n               The news guys just pulled up.\n\n                           POLICE SERGEANT\n               The stairs, men, the stairs.\n\n     The Sergeant leads a half dozen cops and firemen up the stairs \n     as the elevator doors open. Tom, Frank and two COPS squeeze \n     inside.\n\n                           WALLS\n               This guy a jumper?\n\n                           COP\n               We got a call for shots fired on\n               the sixteenth floor. The jumper\n               called right after.\n\n                           FRANK\n                    (to Walls)\n               I'm going to sixteen.\n\n     As the elevator doors close.\n\n                                                          CUT TO:\n\n     INT. THE OASIS--NIGHT\n\n     Frank steps out with the officers. The door to 16M is open: \n     Kanita lies half in, half out the door, a perfectly round \n     hole above her eye, splinters of bone and blood down the \n     side of her nose.\n\n     The carpet is soaked with water; shards of glass lie amid \n     dying fish. A cop returns from the rear hall of the apartment, \n     stands before photo of volcano:\n\n                           COP\n               That's it, nobody else home.\n\n     Frank, looking over the balcony, sees Cy three floors below.\n\n                           FRANK\n               I'm going to thirteen.\n\n     Frank heads clown the stairs.\n\n                                                          CUT TO:\n\n     INT. THIRTEENTH FLOOR--NIGHT\n\n     Frank emerges on thirteen: Walls, the panting Police Sergeant \n     and team have overturned the furniture in 13M: the absent \n     owners would have trouble recognizing it. The floor is covered \n     with gas-powered metal cutters, acetylene torches, ropes, \n     harnesses.\n\n     A trail of blood leads to where Walls stands, Tiger's prone \n     body behind him:\n\n                           WALLS\n               Get this, Frank--we got two patients. \n               Number one, the scarecrow outside. \n               Number two misses the railing but \n               breaks both legs on the balcony, \n               then throws himself through a glass\n               window, heads to the bedroom, where \n               he's now passed out.\n\n                           FRANK\n                    (about Coates)\n               Well, he's the steakhead of the night, \n               then.\n\n                           WALLS\n               I don't think the fire people can \n               touch him out there.\n\n                           FRANK\n               How's he doing?\n\n                           WALLS\n               I haven't had a chance to see him \n               yet. I'm going to take care of \n               sleeping beauty.\n\n     Frank goes over to Coates as two cops strap on harnesses. CY \n     hangs impaled on the railing, a steel spike passing through \n     his hip. Glowing in spotlights from thirteen floors below, \n     Frank takes Coates' vital signs, gently presses his abdomen:\n\n                           FRANK\n               Does that hurt?\n\n                           COATES\n                    (screams)\n               No!\n\n     Frank, IV bag in his teeth, putting an oxygen mask on Coates:\n\n                           FRANK\n               I don't think you've hurt any major \n               organs.\n                    (sets IV line)\n               We got to get you off this thing \n               without setting off bleeding.\n\n     Cops behind click on harnesses (\"You in?\" \"Yeah\" \"You in?\") \n     attach straps to pitons they've hammered into the brick wall, \n     bring out metal cutters and torches.\n\n                           FRANK (CONT'D)\n               They're gonna torch the fence. You're \n               gonna feel the metal getting warm, \n               maybe very warm.\n\n                           COATES\n               I can't hold up my head anymore.\n\n     Frank passes the IV bag to one of the cops, holds Coates, \n     head. CY relaxes his neck as SPARKS splay like fireworks \n     beneath him, fall to the concrete.\n\n                           COATES (CONT'D)\n               So, Frank, am I going to live?\n\n                           FRANK\n               You're going to live.\n\n                           COATES\n               I've been thinking about things. \n               Meditating on my financial future. \n               You guys gave me plenty of time to \n               meditate on the future. Whatja do, \n               stop for Chinese on the way over?  \n               There's plenty of food in my place.\n\n                           FRANK\n               I was tired. I needed a coffee.\n\n                           COATES\n               What about Kanita?\n\n                           FRANK\n               Dead.\n\n                           COATES\n               That's too bad. Get some money, a \n               nice looking girl on your arm, and \n               everyone wants to take a piece. Some \n               kid I wouldn't let wash my Mercedes \n               is in my house, shooting at me. Damn, \n               I thought I could make it onto the \n               balcony like Tiger. He's fat, that's \n               why, falls faster. I'm trying to \n               watch my weight, and look what \n               happens. Am I shot, Frank?\n\n                           FRANK\n               No.\n\n                           COATES\n               Boy can't shoot for shit, either. \n               Goddamn that's hot.\n\n     Frank looks: the spike in Coates' hip starting to glow red. \n     CY stretches his hand toward the skyline, his face backlit \n     by raining acetylene sparks:\n\n                           COATES (CONT'D)\n               Isn't it beautiful? When the fires \n               start to fall, then the strongest \n               rule it all. I love this city.\n\n     The torch breaks the spike free: Frank and Coates FREE FALL \n     three feet, jerk to a stop. Cy yelps. The crowd cheers from \n     below.\n\n     Frank now grabbing, holding Coates tightly--Frank's hands \n     the only thing keeping Coates from falling--as the cops hoist \n     them up.\n\n                           COP\n                    (to Frank)\n               Good thing we buckled you in, huh?\n\n                           COATES\n               What about me? Who's supposed to \n               buckle me?\n\n                           COP\n                    (to 2nd cop)\n               I thought you did.\n\n                           2ND COP\n               I thought you did.\n\n                           COP\n                    (to Coates)\n               I'm so sorry, sir.\n\n     The cops lift Frank and Coates onto the balcony.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     16 XRay parked in front.\n\n                                                          CUT TO:\n\n     INT. MERCY CRITICAL CARE--NIGHT\n\n     Frank walking out of the restroom wiping water off his face, \n     looking at the gurney where Coates lies on his side, metal \n     spike still sticking through his hip, IV line running to his \n     arm, eyes closed. Nurses walk past Coates: he's stabilized, \n     waiting his turn. CY, take a number.\n\n     Frank spots Hazmat at Burke's cubicle, walks over.\n\n                           HAZMAT\n               Nurse Crupp, we're going to need \n               some Valium here. He's waking up \n               again.\n\n     The ventilator alarm goes off as Burke pulls at his \n     restraints.\n\n                           HAZMAT (CONT'D)\n                    (urgent)\n               Where's that Valium?\n\n     Nurse Crupp walks briskly over, injects needle into one of \n     Burke's IV bags.\n\n     Burke's voice speaks in Frank's head:\n\n                           BURKE'S VOICE\n               Don't. Don't do it.\n\n                           HAZMAT\n               Give me a hand, Frank. I've got to \n               get something between those teeth.\n\n     Frank helps Hazmat force in a bite stick. The monitor alarm \n     cuts off, the ventilator starts up again, pumping air in, \n     pulling air out.\n\n                           HAZMAT (CONT'D)\n               You can't believe how much he's \n               improved.\n\n                           FRANK\n               How many times have you shocked him \n               tonight?\n\n                           HAZMAT\n               Fourteen. We finally got him a room \n               upstairs. Should be up there in a \n               couple of hours.\n\n                           FRANK\n               What do you do, just have someone \n               follow him around with a defribilator?\n\n                           HAZMAT\n                    (laughs)\n               That's good, Frank. No, but they \n               might surgically implant one, about \n               the size of my thumb. It goes near \n               the shoulder here, with two electrodes \n               connected to the heart. It sends a \n               shock whenever it senses a drop in \n               blood flow. Amazing, isn't it?\n\n                           FRANK\n               A medical miracle.\n\n                                                          CUT TO:\n\n     INT. MERCY WAITING ROOM--NIGHT\n\n     Frank notices Mary Burke in waiting area with her brother, \n     mother and several others. Gone is the lost daughter, the \n     scared junkie. Tonight she's dressed for strength: leather \n     jacket, blue jeans, black work boots.\n\n                           MARY\n               Everyone, this is the medic who \n               brought my father in. Frank, these \n               are some of my father's friends.\n\n     Frank greets them.\n\n                           FAMILY FRIEND\n               We live out an the Island now, but \n               we used to live right down the block\n               from Pat. He was like a saint to us. \n               Came as soon as we heard.\n\n                           FRANK\n                    (to Mary)\n               I'm going out for a smoke.\n\n     Mary whispers something to her mother, joins him.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--NIGHT\n\n     Frank offers her a cigarette. Walls waits in 16 XRay, now \n     parked at the curb.\n\n                           MARY\n               I heard CY Coates was brought in. He \n               looked pretty bad.\n\n                           FRANK\n               He'll be all right.\n\n                           MARY\n               Too bad. He called me up today, can \n               you believe that? I don't know how \n               he got my number. He asks me do I \n               want to come over and see him, I \n               tell him I'd rather go to a leper \n               colony. He says there's a new gang \n               that wants to kill him, take over \n               the business. I told him I hope he's \n               right. That they kill him. That's \n               what I told him.\n\n                           FRANK\n               It'll be a while before he's up and \n               running again.\n\n                           MARY\n               OK, last night I was weak. it won't \n               happen again. And all that shit I \n               said--it was just because I was \n               stoned. Forget it.\n\n                           FRANK\n               No problem. Thanks for letting me \n               crash. It was the best sleep I've \n               had in months. I used some of your \n               soap.\n\n                           MARY\n               I wish these people would leave \n               already. I can't listen to another \n               story. Did you see him?\n                    (Frank doesn't answer)\n               That doctor says the brain is coming \n               around. They're waiting for the heart \n               to stabilize. I don't know who to \n               believe. He says they still have to \n               keep him tied up.\n\n                           FRANK\n               Can I bring you something back to \n               eat--a falafal, some pizza?\n\n                           MARY\n               No, we just ate. I only remember how \n               tough my father was. Now I know he \n               had to be like that, to make us tough. \n               This city'll kill you if you aren't \n               strong enough.\n\n                           FRANK\n               No, the city doesn't discriminate. \n               It gets everybody.\n\n     Walls flashes 16 XRay's headlights, hits the horns.\n\n                           FRANK (CONT'D)\n               I gotta go. Another call.\n\n     Frank, his heart pounding, steps closer to her.\n\n                           FRANK (CONT'D)\n               We're all dying, Mary Burke.\n\n     He leans as if to kiss her.\n\n                           MARY\n               This is not a good time.\n\n                           FRANK\n               There's no time.\n\n     He places his hand on her shoulder, kisses her lightly, walks \n     toward Walls and the waiting ambulance.\n\n                                                          CUT TO:\n\n     EXT. FIRST AVE--NIGHT\n\n     16 XRay is cooking now--Walls at the wheel, Frank shotgun, \n     passing a pint of whiskey back and forth: radio blasting--\n     INXS: \"The Devil Inside.\"\n\n                           WALLS\n               Get ready, Frank. Missed a drug \n               shooting while you were dicking around \n               in there. There's gonna be trauma \n               tonight!\n\n                           FRANK\n               As long as we keep moving. No standing \n               still.\n\n                           WALLS\n                    (keys mike)\n               C'mon, look at your screen. Give up \n               some blood!\n\n                           DISPATCHER\n               Sixteen XRay, a man at the bus \n               terminal shot three years ago says \n               his arm hurts.\n\n     Frank looks at a group of girls exiting an after-hours club: \n     every one a Rose. Rose faces.\n\n                           FRANK\n               C'mon, Tom, pick up a job.\n\n                           WALLS\n               You want some bum in the bus terminal? \n               We'll wait for a real call.\n\n                           FRANK\n               Let's get in a fight, then.\n\n                           WALLS\n               Who with?\n\n                           FRANK\n               That's your job. Just keep driving, \n               keep moving. No stopping. We're \n               sharks. We stop too long, we die.\n\n     Walls hits the accelerator: the old bus jerks forward:\n\n                           FRANK (CONT'D)\n               Let's break something, Tom. Let's \n               bust something, bomb something.\n\n                           WALLS\n               What do you want to break?\n\n                           FRANK\n                    (taking a drink)\n               I don't know--let's break some\n               windows.\n\n                           WALLS\n               Why?\n\n                           FRANK\n               Destruction, distraction. I feel the \n               need.\n\n                           WALLS\n               You need a reason, Frank. You don't \n               just go around breaking people's \n               windows. That's anarchy.\n\n                           FRANK\n               What's the reason? Give me a reason, \n               Tom.\n\n                           WALLS\n               Let me think.\n\n     Tom hits the siren as he swings wildly around a stopped cab \n     and its turban-headed driver:\n\n                           WALLS (CONT'D)\n               Classic cabbie move.\n                    (to driver)\n               Hey, swammy, that's called a \n               crosswalk. You stop before it, not \n               on it!\n\n     Walls turns onto a cross street, spots Noel standing by a \n     Mustang, baseball bat on his shoulder. He wears yesterday's \n     blood-stained clothes, cut tires tied to his shoulders and \n     elbows, chest and belly wrapped with steel wire.\n\n                           WALLS (CONT'D)\n               I know who to work over. Him.\n\n     Walls slows as Noel lifts the bat, swings it into the \n     Mustang's front window, shattering it, puts the bat down, \n     using it like a cane as he walks to the next parked car.\n\n                           WALLS (CONT'D)\n               This guy's been terrorizing the \n               neighborhood for weeks, ever since \n               he got outta jail, wreaking general \n               havoc, contributing to the bad name \n               of the place. The term \"menace to \n               society\" was made up for him.\n\n                           FRANK\n               He's crazy. He can't help it.\n\n                           WALLS\n                    (stops ambulance)\n               Well, why don't they put him away? \n               Prisons don't want him. I took him \n               to the hospital yesterday and here \n               he is again.\n\n     Noel reaches the next car, a Bronco, carefully hefts the \n     bat, smashes it through the windshield.\n\n                           WALLS (CONT'D)\n               Look at that. Tell me that's a crazy \n               person. Every move is calculated. He \n               knows exactly what he's doing. This \n               is the guy. I've been after him for \n               weeks. He's quick, runs like a rat, \n               tough for one person, but with two \n               of us--\n\n                           FRANK\n               Okay, whatta I do?\n\n                           WALLS\n               If he sees me, he'll run, so I'll \n               get out here. You start talking to \n               him about baseball or something while \n               I sneak around behind and get down \n               and you push him. When he falls we \n               get him.\n\n                           FRANK\n               That's ridiculous.\n\n                           WALLS\n               Believe me, it always works. The \n               simpler, the better.\n\n                           FRANK\n               You learn that in the army?\n\n                           FRANK (CONT'D)\n               Flatbush.\n\n     Walls slips out, crouches beside the bus. Frank, stepping \n     out, walks over to Noel as he whacks the bat through the \n     hatch of a Pinto.\n\n                           FRANK (CONT'D)\n               That's a hell of a swing you got \n               there, Noel. I'm thinking Strawberry \n               in his prime.\n\n                           NOEL\n               Strawberry ain't shit. Drug pussy.\n                    (heads for the next \n                    car)\n               Me.  I swing like Reggie. Mr.  \n               October. Number three, game six, \n               World Series.\n\n     Noel hauls back, lays into a Volvo: glass shatters. Noel \n     holds the bat out, extends handle towards Frank:\n\n                           NOEL (CONT'D)\n               Here, you try.\n\n                           FRANK\n               No, I'd better not.\n\n                           NOEL\n               Sure, sure, give go.\n\n                           FRANK\n               Yeah?\n\n     Frank, intrigued by Noel's suggestion, has forgotten Walls'\n     plan. He takes the bat as Tom sneaks behind Noel, crouching.\n\n                           FRANK (CONT'D)\n               What the hell.\n                    (spits into hands)\n               The next year, tiebreaker for the \n               division, in Boston, Yanks down two \n               to nothing, Bucky Dent steps to the \n               plate.\n\n                           NOEL\n               Oh man, Bucky.\n\n                           FRANK\n               The pitch, high heater. Bucky knows \n               what's coming. He steps in, smash, \n               over the green monster.\n\n     Frank cocks the baseball bat, relishing every moment, swings \n     into the Volvo's side window. Shattered glass flies on his \n     hands and clothes.\n\n     Walls, fed up with this, stands:\n\n                           WALLS\n               Frank, what the hell are you doing?\n\n     Noel, seeing Walls, grabs the bat, flees down an alley.\n\n                           WALLS (CONT'D)\n               You go down those stairs there. Meet \n               me back here if you can't find him \n               in ten minutes. Call out if you see \n               him. Get with the program, Frank.\n\n     Walls takes off after Noel. Frank, taking out his flashlight, \n     enters second alley, walks down dark stairs which hopefully \n     circle around to Noel.\n\n                                                          CUT TO:\n\n     INT. ALLEY--NIGHT\n\n     Mini-flashlight leading the way, Frank steps gingerly down \n     the refuse-strewn alley. Ahead: footsteps.\n\n     He kicks something, thinking it's trash, looks down; a body \n     rustles, pair of sleeping eyes look up.\n\n     Suddenly everything seems silent. He passes a row of glowing \n     red doors. Shadows flash in the distance. He hears a woman \n     crying, shoots his flashlight her direction: nothing.\n\n     Frank hears the voice again: Rose's voice:\n\n                           ROSE'S VOICE\n               Why did you kill me, Frank?\n\n                           FRANK\n               I didn't mean to.\n\n                           ROSE'S VOICE\n               You should have helped me.\n\n                           FRANK\n               I tried to help. I wanted to.\n\n     Shadows like hands extend against the wall ahead.\n\n                           ROSE'S VOICE\n               Don't you love me?\n\n     Frank moves toward the reaching arms. The shadows swing like \n     baseball bats. Noel SCREAMS.\n\n     Suddenly, before him, a blurry mass of bloody dreadlocks--\n     Noel goes flying to the ground, Walls standing over him \n     swinging the bat, hitting him, killing him.\n\n                           WALLS\n               I got him, Frank!\n\n     Frank stands back, watching Walls and Noel like some static \n     black and white TV screen from his childhood. Noel, trying \n     to protect himself, cries out.\n\n                           WALLS (CONT'D)\n                    (swinging bat)\n               To the moon, Alice! You little \n               motherfucker!\n\n     Frank charges forward into Walls, sending Tom, the baseball \n     bat flying. Walls on the ground. Frank bends over Noel: Noel's \n     face covered with blood, gasping for air, blowing red bubbles, \n     convulsing.\n\n                           FRANK\n                    (to Walls)\n               Get the kit! We're gonna tube him!\n\n                           WALLS\n               Frank!\n\n                           FRANK\n               Do it!\n\n                           WALLS\n                    (standing)\n               Frank!\n\n                           FRANK\n                    (to Noel)\n               We're gonna save you, Noel. You're \n               gonna be all right.\n                    (to Walls)\n               Do it, Tom! I'll call for fucking \n               backup, I swear!\n\n                           WALLS\n               You're crazy.\n\n      Noel unconscious: Tom hurries down the alley toward the \n      ambulance as Frank opens Noel's mouth.\n\n                           FRANK\n               You're going to make it! You're going \n               to make it!\n\n      Pressing Noel's chest, Frank lowers his mouth, starts CPR. \n      His mouth to Noel's. In the distance: Walls' footsteps \n      returning.\n\n                                                          CUT TO:\n\n      EXT. MERCY EMERGENCY--NIGHT\n\n      16 XRay parked out front: the sky is going blue.\n\n                                                          CUT TO:\n\n      INT. MERCY ER--NIGHT\n\n      Frank and Tom, their shirts blood-stained, pushing Noel down \n      Skid Row, past Griss, past Nurse Constance. Tom wheels, Frank \n      carries the IV bag.\n\n                           NURSE CONSTANCE\n               Take him straight through.\n\n                           GRISS\n               Who got that funky motherfucker this \n               time?\n\n                           FRANK\n                    (to Nurse Constance)\n               Last show of the night.\n\n                           HAZMAT\n                    (arriving)\n               Jesus Christ. Nurse Crupp!\n                    (to Frank)\n               Anybody else hurt?\n\n                           FRANK\n               No.\n\n                           HAZMAT\n               Crazy fucker.\n\n     Walls pushes Noel into unit one. Frank looks over to unit \n     three--Burke's cubicle is empty.\n\n                           FRANK\n               Where's Burke?\n\n                           HAZMAT\n               Upstairs. 212. Had to shock him twice \n               more.\n\n     Frank nods, walks out. Behind, Walls helps Hazmat and Crupp \n     place Noel on a bed.\n\n                                                          CUT TO:\n\n     INT. ROOM 212--NIGHT\n\n     Frank Pierce walks down the hospital corridor, steps into \n     room 212.\n\n     Burke lies, tubed, wired and tied to life support. Blue light \n     comes through the window. On the EKG monitor: a slow steady \n     green endless line: up, down.\n\n     Frank takes a moment, exhales.\n\n     One by one, Frank flips off the machines. The clanging EKG \n     ALARM is followed by the bass honking of the respirator alarm \n     and two tweetering IV-drip alarms.\n\n     Frank, holding Burke's pulse, watches the life go out of \n     him. Hearing commotion outside, Frank flips the machines \n     back on: the EKG monitor is flatline.\n\n     A FLOOR NURSE rushes in, feels for Burke's pulse.\n\n                           FLOOR NURSE\n               What happened?\n                    (calling out)\n               Code!\n\n     Frank steps back as the Nurse hits the emergency switch.\n\n                           FLOOR NURSE (CONT'D)\n               Are we doing CPR?\n\n     Dr. Hazmat, out of breath, enters:\n\n                           FLOOR NURSE (CONT'D)\n               He coded.\n\n                           HAZMAT\n               Christ, what a way to start the day. \n               He's in V-fib. Shock him.\n\n     Frank pulls out the paddles, applies them to Burke's chest:\n\n                           FLOOR NURSE\n               Clear!\n\n     Frank, knowing it's futile, shocks Burke: no result.\n\n                           HAZMAT\n               Zap him again.\n\n     Frank goes through the motions, pretending to shock Burke. \n     The flatline doesn't waver.\n\n                           HAZMAT (CONT'D)\n               Nothing. Get the cart, start \n               compressions, get an epinephrine in.\n\n     Frank backs out the door as a nurse and intern enter.\n\n     In the corridor Frank listens as the activity becomes less \n     urgent.\n\n     Hazmat steps out:\n\n                           HAZMAT (CONT'D)\n               That's enough. I called it. Let's \n               get some coffee.\n                    (to Frank)\n               You gonna tell the family?\n\n     Frank nods.\n\n                                                          CUT TO:\n\n     EXT. MERCY EMERGENCY--DAYBREAK\n\n     Frank walks out of Our Lady of Mercy, heads down the side \n     street. He passes Tom Walls wielding a giant flashlight, \n     smashing Sixteen XRay's headlights, denting the hood and \n     side windows.\n\n                           WALLS\n               Die!\n\n                                                          CUT TO:\n\n     EXT. MARY'S APT. BUILDING--DAY\n\n     Frank rings the buzzer. Mary, sleepy-voiced, answers:\n\n                           MARY (O.S.)\n               Who is it?\n\n                           FRANK\n               Frank.\n\n                           MARY (O.S.)\n               Come on up.\n\n                                                          CUT TO:\n\n     INT. FIRST FLOOR--DAY\n\n     Mary, wearing a burgundy robe, opens the door. Frank says \n     nothing. Her expression darkens.\n\n     Frank looks at her again: it's not Mary, it's Rose. Mary has \n     Rose's face.\n\n                           FRANK\n               He's dead, Rose. Your father passed.\n\n                           ROSE/MARY\n               How can that be? He was getting \n               better.\n\n                           FRANK\n               He coded. They shocked him one too \n               many times. I'm sorry.\n\n                           ROSE/MARY\n               He was tough. You did all you could.\n\n                           FRANK\n               I'm sorry.\n\n                           ROSE/MARY\n               You have to keep the body going until \n               the brain and heart recover enough \n               to go on their own.\n\n     Frank nods.\n\n                           ROSE/MARY (CONT'D)\n               Would you like to come in?\n\n                           FRANK\n               Yes.\n\n     Rose/Mary opens the door wider, closes it behind Frank.\n\n                                                          CUT TO:\n\n     INT. MARY'S BEDROOM--DAY\n\n     Rose is Mary again: she and Frank lie clothed on her bed. He \n     leans his head against her breast as she holds him. His eyes \n     close: sleep.\n\n                                                          THE END\n\n\n   \n\n\n\n\n\n\n\nBringing Out the Dead\nWriters :   Paul Schrader\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:21:46.302573"}