{"title": "Burning Annie", "film_link": "/Movie Scripts/Burning Annie Script.html", "script_link": "/scripts/Burning-Annie.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Burning Annie Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Burning-Annie.jpg\" title=\"Burning Annie Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Zack Ordynans\" title=\"Scripts by Zack Ordynans\">Zack Ordynans</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/>\n<b>Script Date</b> : January 2002<br/>\n<b>Movie Release Date</b> : February 2007<br/>\n<br/>\n<a href=\"/scripts/Burning-Annie.html\">Read \"Burning Annie\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n<b>                           BURNING ANNIE\r\n</b>                         \r\n           art imitates life imitates art imitates life\r\n\r\n\r\n\r\n\r\n                         \r\n                            Written by\r\n\r\n                          Zack Ordynans\r\n                         \r\n                         \r\n                         \r\n                         \r\n<b>                                                      PRODUCTION DRAFT\r\n</b><b>                                                               1-12-02\r\n</b>                         \r\n                         \r\n<b>                          FADE IN:\r\n</b>                         \r\n           Abrupt CLOSE UP on MAX, a plain wall behind him.\r\n                         \r\n<b>          1 INT. LIMBO RADIO 1\r\n</b>                         \r\n           He is 20, normal looking, not too nebbish, punkish, bookish,\r\n           or stylish. He is a high-strung guy, enjoying a rare moment\r\n           of un-self-consciousness.\r\n                         \r\n<b>                          MAX\r\n</b>           There's an old joke. It comes from \"The\r\n           Iliad,\" but I think it was popularized by\r\n           Oscar Wilde. It goes like this:\r\n           ...A bear's taking a shit, like, out in the\r\n           woods one day. And he sees this rabbit,\r\n           also taking a shit. The rabbit, wait, I\r\n           mean, the bear, he's shitting up a storm,\r\n           cuz he's been eating Mexican. The\r\n           wiping's taking forever, and his shit\r\n           keeps sticking to his fur. Wait, what\r\n           happens next? Oh, right-- he asks the\r\n           rabbit if he ever has trouble wiping. The\r\n           rabbit says no, shit just slides right\r\n           off him. So the bear picks the rabbit up\r\n           and wipes his ass with him.\r\n           (pause, as if for applause)\r\n           Well, I never said it was a good joke.\r\n           And see, that makes it perfect, because\r\n           it's pretty much the story of my life.\r\n                         \r\n           We can now see that he's perched on a stool, wearing a REM t-\r\n           shirt and old jeans. He gesticulates vaguely as he talks.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Growing up, my parents were huge Woody\r\n           Allen fans. Still are. Personally, I hate\r\n           him. Same thing with the Beatles, such a\r\n           part of my background that I must have\r\n           been about 16 by the time I realized how\r\n           useless it was to rebel by ignoring the\r\n           Beatles or any other cultural artifact of\r\n           their generation. Even if I did spend my\r\n           childhood hearing my father go on and on\r\n           about how, like, Nirvana would never mean\r\n           anything because they're not the Beatles,\r\n           blah-blah. I don't know, this is all\r\n           starting to sound a little bit too\r\n           angsty, you know, and that's about the\r\n           last thing I'm going for here... Shit, I\r\n           really got off track there, didn't I?\r\n                         \r\n           As Max shakes his head, a hanging RADIO MIKE comes into view.\r\n           It has the call letters of a college radio station on it.\r\n<b>           2.\r\n</b>                         \r\n                         \r\n           High on the wall behind him, a glowing \"ON AIR\" light is\r\n           revealed. The perspective is skewed, the studio appears\r\n           cavernous and completely barren.\r\n                         \r\n<b>          2 INT. MAX'S CHILDHOOD HOME ­ FLASHBACK ­ DAY 2\r\n</b>                         \r\n           YOUNG MAX, about five, sits on the floor and watches BANANAS\r\n           with his FATHER, a large, relaxed man with a mustache who\r\n           reclines in a tacky 80's chair and smokes a cigar.\r\n                         \r\n<b>           MAX (O.S.)\r\n</b>           Anyway, like the Beatles thing­ and this\r\n           is the point of that whole long-winded\r\n           example­ I was force-fed Woody Allen from\r\n           a young age. I remember watching Bananas\r\n           when I was about five. Of course, I hated\r\n           it.\r\n                         \r\n           Young Max is laughing hysterically at the screen.\r\n                         \r\n           Max stands to the side, watching his younger self and his\r\n           father. The radio mike hangs in front of him.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           This is my old house. We lived here, in a\r\n           dull suburb of New York, until I was ten,\r\n           when we moved to a different house in a\r\n           different dull suburb of New York.\r\n                         \r\n           On TV, a woman is bit in the breast by a snake and is chased\r\n           by a group of soldiers.\r\n                         \r\n<b>                          YOUNG MAX\r\n</b>           Daddy, why are they running after her?\r\n                         \r\n<b>                          FATHER\r\n</b><b>                          (KINDLY)\r\n</b>           Someday, you'll understand. Pay\r\n           attention, you'll learn something.\r\n                         \r\n           Young Max turns back to the screen, wide-eyed.\r\n                         \r\n<b>          3 INT. MAX'S SECOND HOME ­ FLASHBACK 3\r\n</b>                         \r\n           In pajamas, ADOLESCENT MAX, 16, watches a newer TV in an\r\n           identical family room. This time, ANNIE HALL is playing.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           Oh yeah. This wasn't the first time I saw\r\n           Annie Hall, but it was the first time I\r\n           actually appreciated it. I was flipping\r\n           channels on a Saturday afternoon, and\r\n           there it was, and I was stunned to find I\r\n           loved it, more stunned to find that my\r\n           parents may have had a point all along.\r\n<b>                          [MORE]\r\n</b><b>           3.\r\n</b>                         \r\n           MAX (V.O.) (cont'd)\r\n           Although, they were definitely wrong\r\n           about Bananas.\r\n                         \r\n           CLOSE ON: Adolescent Max, totally engrossed in the film.\r\n                         \r\n<b>          4 INT. HIGH SCHOOL HALLWAY ­ FLASHBACK 4\r\n</b>                         \r\n           Adolescent Max walks alone to class. Other students rush by\r\n           in groups. He looks a little lost.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           Oh God, high school. I hated this place.\r\n           I was a Junior when I gave up trying to\r\n           fit in. Fortunately, being a social\r\n           outcast is a lot easier when your school\r\n           is filled with idiots.\r\n                         \r\n           A pair of GOTH POSERS pass. Max keeps his distance. From the\r\n           other direction, a 6 FOOT TALL GIRL makes eyes at Max. He\r\n           walks into a water fountain, drops his books.\r\n                         \r\n<b>          5 INT. HIGH SCHOOL GYM ­ FLASHBACK 5\r\n</b>                         \r\n           Adolescent Max gets hit in the face with a volleyball.\r\n           Everyone laughs at him, including the COACH.\r\n                         \r\n           Max stands to the side and winces.\r\n                         \r\n<b>                          MAX\r\n</b>           There was something in Annie Hall I\r\n           identified with. Maybe it was the style\r\n           of humor, or the defeatist attitude, I\r\n           don't know. All I know is, I kept going\r\n           back. Different people are inspired by\r\n           different things, and my source of\r\n           inspiration became a 20-year-old movie\r\n           about a failed relationship.\r\n                         \r\n           The volleyball rolls over and he picks it up.\r\n                         \r\n<b>          6 INT. RADIO STATION -- PRESENT 6\r\n</b>                         \r\n           From behind Max, we see the station as it really is: small,\r\n           dark, cramped, and totally filled with crap. Max wears\r\n           headphones, sits before a large console and audio gear.\r\n                         \r\n           He now holds a volleyball.\r\n                         \r\n<b>                          MAX\r\n</b>           So after high school I ended up here.\r\n           There was never really any choice, not\r\n           going to college was not an option. Of\r\n           course, I brought Annie with me. Good\r\n           thing, too.\r\n<b>                          [MORE]\r\n</b><b>           4.\r\n</b>                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Watching it quickly became about the only\r\n           thing I could count on to go right.\r\n                         \r\n<b>          7 INT. JEN'S ROOM ­ FLASHBACK ­ NIGHT 7\r\n</b>                         \r\n           Max is with five friends in the double, and they all have\r\n           lingering style-baggage from high school (eg. bad haircuts).\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (TO CAMERA)\r\n</b>           It was freshmen year when we started\r\n           watching Annie Hall as a tradition.\r\n<b>                          (LOOKING AROUND)\r\n</b>           Jeez, this must have been the very first\r\n           time. What's Amy doing here? I'm pretty\r\n           sure Amy wasn't here.\r\n                         \r\n           AMY is attractive, bookish, and sitting on Max's bed.\r\n           CHARLES, a skinny guy in a large chair, tries to get her\r\n           attention by wiggling his eyebrows seductively.\r\n                         \r\n           Max puts the tape in the VCR, hits rewind, and moves to sit\r\n           on his bed. He pauses when he sees how close he'll come to\r\n           Amy. Finally, he climbs over her and awkwardly sits at the\r\n           far end.\r\n                         \r\n           Amy watches, rolls her eyes, and looks at BETH, who shakes\r\n           her head sadly. Beth is pretty in an earthy way, spunky and\r\n           sad at the same time. She looks sympathetically at Max, who\r\n           is trying not to act nervous (and failing).\r\n                         \r\n           The couple is SAM, who's short and charismatic, with a cool,\r\n           slightly punkish personal style; and JEN, same height, cute\r\n           and serious, conservative dress. They lie on the floor\r\n           together.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b><b>                          (TO CAMERA)\r\n</b>           That's Sam and Jen. Sam was the alpha-\r\n           male of our group, which tends to consist\r\n           mostly of zeta-males. He had been going\r\n           out with Jen a couple weeks and we were\r\n           all waiting to see if she would change\r\n           him...\r\n                         \r\n           Sam slides a pillow under her.\r\n                         \r\n<b>                          SAM\r\n</b>           Are you comfortable, honey?\r\n                         \r\n<b>                          JEN\r\n</b>           I'm fine, Sam. I was worried about you.\r\n           Sure you don't want me to move over?\r\n<b>           5.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SAM\r\n</b>           Oh no, no, Jen, if you're happy, I'm\r\n           happy.\r\n                         \r\n           Max and Charles exchange a look-- there they go again. Max\r\n           makes a show of putting a pillow under a large Darth Vader\r\n           doll. Beth laughs, Amy is amused. Sam looks back and is\r\n           embarrassed. Jen rolls her eyes and gives Sam a look.\r\n                         \r\n<b>                          JEN\r\n</b>           Are we gonna watch this movie or what?\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n<b>          8 INT. JEN'S ROOM ­ FLASHBACK ­ LATER 8\r\n</b>                         \r\n           Annie Hall's credits roll. Sam snaps on the lights.\r\n                         \r\n<b>                          SAM\r\n</b>           Wow, what a good movie.\r\n                         \r\n<b>                          AMY\r\n</b>           Oh, that was so sad! Relationships don't\r\n           have to be like that!\r\n<b>                          (TO MAX)\r\n</b>           I can see why you like this so much. It\r\n           reminded me of you.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, thanks, I guess. Does that mean you\r\n           liked it?\r\n                         \r\n           Max and Amy stand and face each other as the lights fade to\r\n           black around everyone else.\r\n                         \r\n<b>                          AMY\r\n</b>           I didn't say I liked it, I said it\r\n           reminded me of you. It reminded me of\r\n           what I didn't like about you, the\r\n           cynicism, the neurotic insecurity, and oh\r\n           yeah, when you started calling me every\r\n           day. All the reasons we were never more\r\n           than friends.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, at least you're being honest.\r\n                         \r\n<b>                          AMY\r\n</b>           Of course I'm being honest. This is a\r\n           fantasy extrapolated from a flashback.\r\n           How could I lie to you?\r\n<b>           6.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b><b>                          (TO CAMERA)\r\n</b>           I'm the only person I know who gets\r\n           insulted in his own fantasies.\r\n                         \r\n           Charles walks by, Amy takes his arm, and they disappear into\r\n           the surrounding darkness, which DISSOLVES TO:\r\n                         \r\n<b>          9 INT. LIMBO RADIO - PRESENT 9\r\n</b>                         \r\n           and again Max is alone.\r\n                         \r\n<b>                          MAX\r\n</b>           Anyway, Amy set the tone for the rest of\r\n           college...\r\n                         \r\n<b>          10 INT. THEATER LOBBY -- NIGHT -- FLASHBACK 10\r\n</b>                         \r\n           The movie is Annie Hall. The theater is emptying. Suddenly,\r\n           ERICA bursts through the crowd. Erica is mad. Max follows\r\n           behind her, placating.\r\n                         \r\n<b>                          ERICA\r\n</b><b>           AND WHAT IS IT WITH JEWISH MEN AND THEIR\r\n</b><b>           PENIS ISSUES?!\r\n</b>                         \r\n           Max freezes in place. The entire crowd of students turns to\r\n           look at him. He manages a weak smile and turns back to Erica,\r\n           but she's gone, out the doors into the night.\r\n                         \r\n           Max turns back to the crowd and shrugs, but the crowd turns\r\n           away. Max suddenly sees someone: Beth, looking at him. He\r\n           blushes, self-conscious, and hurries away.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           And even when it went right, it didn't.\r\n                         \r\n<b>          11 INT. STACY'S ROOM -- NIGHT -- FLASHBACK 11\r\n</b>                         \r\n           Max and STACY stumble in, inebriated, laughing.\r\n                         \r\n<b>                          MAX\r\n</b>           ...And then I, then I, after I called the\r\n           pizza place, I called an ambulance, and\r\n           timed them.\r\n                         \r\n<b>                          STACY\r\n</b>           Who won?\r\n                         \r\n<b>                          MAX\r\n</b>           The pizza, of course. The paramedics took\r\n           35 minutes to arrive.\r\n<b>           7.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          STACY\r\n</b>           I can't believe you! Did you get in\r\n           trouble?\r\n                         \r\n<b>                          MAX\r\n</b>           The Station Manager said I couldn't go on\r\n           the air ever again.\r\n                         \r\n<b>                          STACY\r\n</b>           So what'd you do?!\r\n                         \r\n<b>                          MAX\r\n</b>           I gave him the pizza!\r\n                         \r\n           They collapse on the bed, laughing. Stacy rolls over and\r\n           kisses Max on the lips. His eyes go wide and he frantically\r\n           crawls backwards.\r\n                         \r\n<b>                          STACY\r\n</b>           What? Don't you like me?\r\n                         \r\n<b>                          MAX\r\n</b>           It would never work.\r\n                         \r\n<b>                          STACY\r\n</b>           How would you know?\r\n                         \r\n<b>                          MAX\r\n</b>           I know. I have a sixth sense.\r\n                         \r\n<b>                          STACY\r\n</b>           You see dead people?\r\n                         \r\n<b>                          MAX\r\n</b>           I see dead relationships.\r\n                         \r\n           Stacy sits up, frustrated, the mood ruined.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b><b>                          (TO CAMERA)\r\n</b>           That was all true, but there was\r\n           something else, though. I mean, there I\r\n           was, drunk, in a girl's bedroom, and the\r\n           only thought running through my mind was...\r\n                         \r\n<b>          12 EXT. CAMPUS QUAD ­ DAY ­ FLASHBACK 12\r\n</b>                         \r\n           Max speaks to someone O.S.\r\n                         \r\n<b>                          MAX\r\n</b>           ...\"What about Beth?\"\r\n                         \r\n           Max is talking to Beth. It's a beautiful Spring day.\r\n<b>           8.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           I mean, I know we're just friends, but\r\n           you really mean a lot to me and we've\r\n           been spending a lot of time together\r\n           lately, and maybe... I guess what I'm\r\n           saying is, maybe we could try going out\r\n           on a date or something?\r\n                         \r\n<b>                          BETH\r\n</b>           Max...\r\n                         \r\n<b>                          MAX\r\n</b>           I mean, it wouldn't have to be, uh...\r\n                         \r\n<b>                          BETH\r\n</b>           Sure.\r\n                         \r\n<b>                          MAX\r\n</b>           We wouldn't have to... What?\r\n                         \r\n<b>                          BETH\r\n</b>           I'd love to. How's tomorrow night?\r\n                         \r\n<b>                          MAX\r\n</b>           Um, yeah, it would have to be after, or\r\n           maybe... Yeah, tomorrow, uh, tomorrow\r\n           night's fine.\r\n                         \r\n<b>                          BETH\r\n</b>           Great. I know the perfect thing.\r\n                         \r\n           She splits, leaving Max befuddled at his change of fortune.\r\n                         \r\n<b>          13 EXT. LIBRARY -- NIGHT 13\r\n</b>                         \r\n           Max and Beth are walking through the night in overcoats.\r\n                         \r\n<b>                          BETH\r\n</b>           Never?\r\n                         \r\n<b>                          MAX\r\n</b>           Not until Sam and Jen.\r\n                         \r\n<b>                          BETH\r\n</b>           A perfect record. Wow.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't get what the fuss is. I knew you\r\n           and that Chris guy wouldn't last a week\r\n           as soon as I saw you together.\r\n                         \r\n<b>                          BETH\r\n</b>           But you can tell with everybody? I don't\r\n           know if that's sad or incredible.\r\n<b>           9.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Or incredibly sad. I'm amazed I'm the\r\n           only one who can tell. Take any couple.\r\n           If it's not incompatible lifestyles, it's\r\n           conflicting priorities. If it's not that,\r\n           it's usually clashing levels of self-\r\n           esteem. It's always something.\r\n                         \r\n<b>                          BETH\r\n</b>           Living with you would be a nightmare. I'd\r\n           be afraid to bring any boyfriends home.\r\n           Oh, uh, sorry.\r\n                         \r\n          Awkward pause.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, just because I see it, doesn't mean\r\n           I talk about it. I don't say a word to my\r\n           suitemates.\r\n                         \r\n<b>                          BETH\r\n</b>           You guys never talk about anything\r\n           important anyway.\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, come on, we have philosophical\r\n           discussions all the time.\r\n                         \r\n<b>                          BETH\r\n</b>           Like whether Voltron could kill the\r\n           Transformers?\r\n                         \r\n<b>                          MAX\r\n</b>           To name one hot-button issue, yes. You\r\n           want us to talk about girls? Sam is\r\n           nearly married to Jen, Charles doesn't\r\n           want his relationships to last, Tommy's\r\n           girlfriends are located in online\r\n           chatrooms across the country, and Scott,\r\n           well... you know.\r\n                         \r\n<b>                          BETH\r\n</b>           For such \"close\" friends, it just seems\r\n           weird, that's all. I must admit, I'm a\r\n           lot closer to you than any of them.\r\n                         \r\n          They are at the Library.\r\n                         \r\n<b>                          MAX\r\n</b>           What are doing here?\r\n<b>           10.\r\n</b>                         \r\n                         \r\n<b>          14 INT. LIBRARY LOBBY 14\r\n</b>                         \r\n           Max and Beth remove their coats, revealing formal wear. OTHER\r\n           STUDENTS give them looks. An older female LIBRARIAN\r\n           approaches.\r\n                         \r\n<b>                          LIBRARIAN\r\n</b>           Ah, you must have the reservation for\r\n           booth seven.\r\n                         \r\n<b>                          BETH\r\n</b>           Yes, that's us.\r\n                         \r\n<b>                          MAX\r\n</b>           What?\r\n                         \r\n<b>                          LIBRARIAN\r\n</b>           Right this way, then.\r\n                         \r\n<b>                          MAX\r\n</b>           \"Reservation\"?\r\n                         \r\n<b>                          LIBRARIAN\r\n</b>           You'd be surprised how many of you\r\n           lovebirds we get in here.\r\n                         \r\n           She winks and leads them to the elevator. Beth smiles shyly\r\n           and looks at Max, but he is merely embarrassed. Her smile\r\n           fades.\r\n                         \r\n<b>          15 INT. LIBRARY MEDIA ROOM 15\r\n</b>                         \r\n           Max and Beth are watching the opening credits of Annie Hall\r\n           on a tiny TV in a cubicle. They are surrounded by other\r\n           students in cubicles.\r\n                         \r\n<b>                          BETH\r\n</b>           Isn't this great?\r\n                         \r\n<b>                          MAX\r\n</b>           Well, this isn't exactly what I had in\r\n           mind.\r\n                         \r\n<b>                          BETH\r\n</b>           What do you mean?\r\n                         \r\n<b>                          MAX\r\n</b>           For starters, I have a serious problem\r\n           with spending any time in the library\r\n           when I don't have to. I'm here once or\r\n           twice a year as it is. Plus...\r\n           (holds up headphones)\r\n           What's the point of seeing this together\r\n           if we're wearing headphones?\r\n<b>                          [MORE]\r\n</b><b>           11.\r\n</b>                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Why not be with a life-sized cardboard\r\n           cut-out? That way you can be with someone\r\n           famous, even a dead person. Wouldn't you\r\n           rather be with Elvis?\r\n                         \r\n<b>                          BETH\r\n</b>           Oh, shhh...!\r\n                         \r\n<b>                          MAX\r\n</b>           Or Batman?\r\n                         \r\n<b>                          BETH\r\n</b>           Can't you just enjoy the moment?\r\n                         \r\n<b>                          MAX\r\n</b>           I'm sorry, I'm sorry.\r\n<b>                          (SIGHS)\r\n</b>           I'm a little nervous. It's like, our\r\n           first date and everything.\r\n                         \r\n<b>                          BETH\r\n</b>           Oh. Yeah.\r\n                         \r\n<b>          16 EXT. LIBRARY ­ NIGHT 16\r\n</b>                         \r\n           Max and Beth leave the library. Their dispositions have\r\n           switched: Max is perky while Beth is subdued.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't believe how many great lines\r\n           there are. Even the little throwaways,\r\n           like when she parks and he's like,\r\n           \"That's okay, we can walk to the curb\r\n           from here.\"\r\n                         \r\n<b>                          BETH\r\n</b>           Yeah. I loved it, I'm serious. I'm so\r\n           glad we did this.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, me too.\r\n                         \r\n<b>                          BETH\r\n</b>           But man, relationships are a lot of work,\r\n           aren't they?\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, sure, sometimes...\r\n                         \r\n           Beth stops him, and they sit on a bench. The night is cold.\r\n           They sit close and lean in, speaking in hushed tones.\r\n<b>           12.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          BETH\r\n</b>           If I'm going to jump into anything with\r\n           you, Max, I need some sign that you're\r\n           serious about it. About me.\r\n                         \r\n<b>                          MAX\r\n</b>           What? You want me to get a tattoo or\r\n           something?\r\n                         \r\n<b>                          BETH\r\n</b>           Look, you've gotta admit, you're the most\r\n           pessimistic person in the world.\r\n                         \r\n<b>                          MAX\r\n</b>           Obviously you've never met my mother.\r\n                         \r\n<b>                          BETH\r\n</b>           Can you be serious for a second?\r\n                         \r\n<b>                          MAX\r\n</b>           I guess you really haven't met my mother...\r\n                         \r\n          Beth isn't laughing.\r\n                         \r\n<b>                          BETH\r\n</b>           Look, Max, this isn't going to work.\r\n                         \r\n<b>                          MAX\r\n</b>           Wait a second.\r\n                         \r\n<b>                          BETH\r\n</b>           Okay. No more jokes. Now. Tell me how you\r\n           feel.\r\n                         \r\n<b>                          MAX\r\n</b>           About what?\r\n                         \r\n<b>                          BETH\r\n</b>           About me.\r\n                         \r\n<b>                          MAX\r\n</b><b>           I, I...\r\n</b><b>                          (EXASPERATED)\r\n</b>           Why are you doing this? Since when have\r\n           you gotten \"serious\" about relationships?\r\n           Your last boyfriend dumped you after four\r\n           days.\r\n                         \r\n          Beth sits up, pulls her jacket closed.\r\n                         \r\n<b>                          BETH\r\n</b>           Well, that was intimate. Thanks, Max.\r\n<b>           13.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           No wait, I'm sorry, I'm sorry, hold on.\r\n                         \r\n<b>                          BETH\r\n</b>           Max, I don't think this is such a good\r\n           idea. I mean, it would be really foolish\r\n           to jeopardize our friendship.\r\n                         \r\n<b>                          MAX\r\n</b>           No, it wouldn't!\r\n                         \r\n<b>                          BETH\r\n</b>           We shouldn't have rushed into this. I'm\r\n           sure you know it wouldn't have worked\r\n           out.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't know that.\r\n                         \r\n<b>                          BETH\r\n</b>           Please tell me we haven't hurt our\r\n           friendship. You don't even know how much\r\n           you mean to me.\r\n                         \r\n<b>                          MAX\r\n</b>           I'm starting to get the idea.\r\n                         \r\n           He's dazed, slightly ill. Beth touches his arm gently and\r\n           walks away. Max turns to us. A radio mike swings into view.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Things weren't the same after. We quickly\r\n           became the kind of friends who say Hi on\r\n           the paths but don't stop walking. Then,\r\n           she moved across campus and changed\r\n           majors, and basically, except for the\r\n           random phone call, I haven't seen her in\r\n           ages.\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n           MAX, thoughtful. PULL BACK TO REVEAL:\r\n                         \r\n<b>          17 INT. LIMBO RADIO 17\r\n</b>                         \r\n           Max, speaking in the empty station, suddenly gets intense.\r\n                         \r\n<b>                          MAX\r\n</b>           All these dates had one thing in common!\r\n           And it took Charles, of all people, to\r\n           point it out to me.\r\n<b>           14.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          18 EXT. CAMPUS QUAD ­ TODAY -- FLASHBACK 18\r\n</b>                         \r\n           It's late January and the campus is showing signs of a\r\n           temperamental winter.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           This morning, we were skipping class.\r\n                         \r\n           Max and Charles walk across the quad towards us. At first,\r\n           they are only specks in the distance.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Max, you're insane.\r\n                         \r\n<b>                          MAX\r\n</b>           It's ridiculous that even at a liberal\r\n           school like this, I have to put up with\r\n           anti-Semitism.\r\n                         \r\n<b>                          CHARLES\r\n</b>           So you got a C minus! Don't you think\r\n           you're getting carried away?\r\n                         \r\n<b>                          MAX\r\n</b>           He couldn't just fail me, think about it.\r\n           The paper was about my grandparents'\r\n           experience in the Holocaust.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Your paranoia has always been out of\r\n           control, but this is absurd.\r\n                         \r\n<b>                          MAX\r\n</b>           You don't understand, you're not Jewish.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Neither are you!\r\n                         \r\n<b>                          MAX\r\n</b>           But the professor probably thinks I am.\r\n                         \r\n<b>                          CHARLES\r\n</b>           And wasn't that the paper that you handed\r\n           in two weeks late?\r\n                         \r\n<b>                          MAX\r\n</b>           You know what else? I think he might be\r\n           German.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Professor Wang? Will you stop it...\r\n                         \r\n           We can now see that Charles has a fedora cocked back on his\r\n           head, and is wearing incongruous \"Vegas\" clothes.\r\n<b>           15.\r\n</b>                         \r\n                         \r\n                         \r\n           They walk past and into the University Center.\r\n                         \r\n<b>          19 INT. UNIVERSITY CENTER -- CONTINUOUS 19\r\n</b>                         \r\n           It's a low-traffic time of day.\r\n                         \r\n<b>                          CHARLES\r\n</b>           So what do you want to do tonight?\r\n                         \r\n<b>                          MAX\r\n</b>           I'm not sure. It is the beginning of the\r\n           semester, it's time for our Annie Hall\r\n           night.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Have you ever noticed that the more Annie\r\n           Hall you watch, the less successful you\r\n           are romantically? I think we'd do much\r\n           better if we watched, say, Ocean's 11.\r\n                         \r\n<b>                          MAX\r\n</b>           What are you talking about? If you're\r\n           sick of Annie Hall, that's one thing, but\r\n           don't blame our sad little lives on it.\r\n                         \r\n<b>          20 INT. GENERAL STORE -- CONTINUOUS 20\r\n</b>                         \r\n           Charles picks out breath mints.\r\n                         \r\n<b>                          CHARLES\r\n</b>           No, I'm telling you, I was thinking about\r\n           this over break. Ever since we started\r\n           watching it, what has your love life been\r\n           like? And mine? Every semester, we watch\r\n           this movie, and then spend the semester\r\n           alone.\r\n                         \r\n<b>                          MAX\r\n</b>           Alone? Last semester you hooked up with\r\n           like a dozen women.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You know actresses don't count.\r\n<b>                          (POIGNANTLY)\r\n</b>           I'm looking for a meaningful,\r\n           sophisticated relationship. Like Frank\r\n           and Ava. No more shallow dames for this\r\n           cat.\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (AGITATED)\r\n</b>           Where did you get this grudge against my\r\n           favorite film?\r\n<b>           16.\r\n</b>                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           I'm just kidding around, Max. We'll watch\r\n           it tomorrow. Tonight, there's a party.\r\n                         \r\n<b>                          MAX\r\n</b>           And anyway, your theory fails to account\r\n           for our collective dorkiness and bad\r\n           haircuts. Plus, look at Sam.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Sam hasn't seen Annie Hall since freshman\r\n           year, and he's in his third year with\r\n           Jen.\r\n                         \r\n<b>                          MAX\r\n</b>           So look at what not watching can do to\r\n           you.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ouch. Why are you still on this? I said I\r\n           was kidding.\r\n                         \r\n<b>          21 INT. RADIO STATION -- PRESENT 21\r\n</b>                         \r\n<b>                          MAX\r\n</b>           What a nightmare. I dunno why I can't\r\n           stop thinking about these things. I guess\r\n           I've been a little restless lately, since\r\n           getting back from winter break.\r\n           Everything's been kind of weird lately.\r\n                         \r\n           He grabs a CD from a rack.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Hope you enjoyed this week's Reggae\r\n           Revelry Hour. This is Max filling in for\r\n           Rasta Ronnie, taking you out with a\r\n           little Bad Religion.\r\n                         \r\n           He puts in the CD, hits \"Shuffle/Repeat,\" and leaves. The\r\n           caller request lines blink furiously.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"SUNDAY\"\r\n                         \r\n<b>          22 INT. COMMON ROOM -- MAX'S SUITE - EVENING 22\r\n</b>                         \r\n           Max's dormitory suite: four bedrooms off a common room, which\r\n           has three battered couches, a coffee table, and in a corner,\r\n           several small fridges and two televisions in a pile.\r\n                         \r\n           Christmas lights are still up. A neon `Guinness' sign dwarfs\r\n           it all.\r\n<b>           17.\r\n</b>                         \r\n                         \r\n                         \r\n          Max and Charles are here, standing, while Sam and Jen sit on\r\n          one couch and SCOTT and AMANDA sit on the other.\r\n                         \r\n          Charles puts on his gloves and coat.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Max, you're coming and that's the end of\r\n           it. When's the last time you went to a\r\n           party?\r\n                         \r\n<b>                          MAX\r\n</b>           Who cares? It's unnatural. If I went into\r\n           a stranger's house and ate their food\r\n           under any other circumstance, I'd be\r\n           arrested.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I'm not taking no. With Sam on board,\r\n           it's gonna be like old times.\r\n                         \r\n          He gestures at Sam, who stands. Unlike the hipster from\r\n          freshman year, Sam now resembles a middle-aged accountant.\r\n          There are bags under his eyes and square clothes on his back.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah, I haven't been out with you guys in\r\n           ages.\r\n                         \r\n          Jen looks up from her magazine with disapproval.\r\n                         \r\n<b>                          JEN\r\n</b>           You're going out?\r\n                         \r\n<b>                          SAM\r\n</b>           Aw, honey, just for a little while.\r\n                         \r\n<b>                          JEN\r\n</b>           You know I have to work until midnight.\r\n           It's not my fault the supervisor won't\r\n           let me out of it.\r\n                         \r\n          She glares. He teeters between his friends and his\r\n          girlfriend. His girlfriend wins. He sits back down, trying to\r\n          hide his disappointment.\r\n                         \r\n<b>                          SAM\r\n</b>           She has a point, guys. I should catch up\r\n           on my chemistry reading anyway.\r\n                         \r\n          The guys roll their eyes, let down but unsurprised.\r\n                         \r\n          Across the room are SCOTT, perpetually poker-faced and\r\n          reserved, and AMANDA, understated, with the subdued manner of\r\n          a long-suffering wallflower.\r\n<b>           18.\r\n</b>                         \r\n                         \r\n                         \r\n           She sits off to the side, sneaking looks at Scott. He's\r\n           watching a golf-related infomercial.\r\n                         \r\n<b>                          AMANDA\r\n</b>           So Scott... How come you're not going out\r\n           with Charles and Max?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Can't go. Graphic design work.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Oh really? I have work, too, but it's\r\n           okay, I got a lot done today. What do you\r\n           have to do?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Graphic design work.\r\n                         \r\n           TOMMY enters. He's preppier than anyone else, conservative\r\n           clothes capped off by a goofy smile and thick glasses.\r\n                         \r\n<b>                          TOMMY\r\n</b>           What's up, all?\r\n                         \r\n<b>                          MAX\r\n</b>           Tommy, at last. Save me from this lounge\r\n           lizard.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Yeah, what are you doing tonight?\r\n                         \r\n<b>                          TOMMY\r\n</b>           Physics lab. Fortunately, the semester's\r\n           just begun, so before the work piles up,\r\n           I can party. That's why the beginning of\r\n           the semester rules.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Great, so come party with me.\r\n                         \r\n<b>                          TOMMY\r\n</b>           I can't, I have physics work.\r\n                         \r\n           He disappears into his room. Charles takes Max's hat from a\r\n           hook, jams it on his head, and shoves him towards the door.\r\n                         \r\n<b>          23 INT. COLLEGE APARTMENT ­ LATER 23\r\n</b>                         \r\n           A typically lame college party, still early in the night. The\r\n           furniture is \"student budget modern\" type. A jazz record\r\n           plays quietly, while pretentiously-dressed PARTY-GOERS sip\r\n           wine and eat cheese and crackers.\r\n                         \r\n           Max and Charles survey the room, drinks in hand.\r\n<b>           19.\r\n</b>                         \r\n                         \r\n<b>                          MAX\r\n</b>           Cheers to a new semester, full of\r\n           potential that will surely go to waste.\r\n                         \r\n          They toast.\r\n                         \r\n<b>                          CHARLES\r\n</b>           This is it, I'm telling you. This is the\r\n           semester I pass all my classes and meet\r\n           the dame of my dreams.\r\n                         \r\n<b>                          MAX\r\n</b>           Good luck, and may she have a sister.\r\n                         \r\n<b>                          CHARLES\r\n</b>           More importantly, may she grant us our\r\n           occasional freedom.\r\n                         \r\n<b>                          MAX\r\n</b>           Ah, forget about Sam. I don't like it any\r\n           more than you.\r\n                         \r\n<b>                          CHARLES\r\n</b>           He's become a total non-entity. Freshman\r\n           year, we were like Frank and Deano. Now\r\n           it's like Frank and freakin' Peter\r\n           Lawford.\r\n                         \r\n<b>                          MAX\r\n</b>           Hey, he was one of my best friends. Now\r\n           we share a room and he's like a stranger.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Hottie at 3 o'clock. Keep an eye on her\r\n           for me so it doesn't look like I'm\r\n           interested.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, right, then if you fail to sodomize\r\n           her, you'll blame me. Me, or Annie Hall.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Look, all I said was, it would explain\r\n           our lives.\r\n                         \r\n<b>                          MAX\r\n</b>           The problem is, every crazy theory\r\n           explains something. I took a class last\r\n           semester with a professor who claimed\r\n           that the planet is being destroyed by\r\n           white, male, meat-eating capitalists.\r\n                         \r\n<b>                          CHARLES\r\n</b>           So? Everybody knows that.\r\n<b>           20.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           But she had a theory that explained how:\r\n           apparently racism, sexism, socialism,\r\n           environmentalism, and vegetarianism are\r\n           all inherently linked. I brought a Big\r\n           Mac to the first class, and I thought I\r\n           was going to be the victim of a vegan-\r\n           socialist uprising.\r\n                         \r\n          Sam walks in and makes a beeline for the guys. Excitement.\r\n                         \r\n<b>                          SAM\r\n</b>           Hey! I made it!\r\n                         \r\n<b>                          CHARLES\r\n</b>           I can't believe it.\r\n                         \r\n<b>                          MAX\r\n</b>           Wow, the laws of nature have stopped\r\n           working. Maybe I should try to meet some\r\n           chicks after all.\r\n                         \r\n<b>                          CHARLES\r\n</b>           How'd you get away?\r\n                         \r\n<b>                          SAM\r\n</b>           I told her I was going to the lab. She\r\n           doesn't mind if I'm working while she is.\r\n           How's the party?\r\n                         \r\n<b>                          MAX\r\n</b>           Sucks. Who are they trying to be, with\r\n           this wine and cheese? What kind of party\r\n           doesn't even have beer?\r\n                         \r\n<b>                          CHARLES\r\n</b>           I can get into this. It's better than\r\n           those frat parties. Check out the fox in\r\n           the beret.\r\n                         \r\n<b>                          SAM\r\n</b>           Man, it's so good to be out. Between Jen,\r\n           homework, and labs, I hardly have time\r\n           for anything.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You could always change your major. You'd\r\n           have a lot more free time.\r\n                         \r\n<b>                          SAM\r\n</b>           I feel the same way about science that I\r\n           do about Jen. It's a lot of work, but\r\n           it's worth it.\r\n<b>                          [MORE]\r\n</b><b>           21.\r\n</b>                         \r\n<b>                          SAM (CONT'D)\r\n</b>           I have doubts about both, actually. But\r\n           still, what could be dumber than changing\r\n           your major for a girl?\r\n                         \r\n<b>                          MAX\r\n</b>           Changing your girl for a major.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Would you do it?\r\n                         \r\n<b>                          MAX\r\n</b>           It wouldn't be an issue.\r\n                         \r\n<b>                          SAM\r\n</b>           Of course not, when has studying ever\r\n           interfered with what's important, like\r\n           video hockey or your radio show that\r\n           nobody listens to.\r\n                         \r\n<b>                          MAX\r\n</b>           I meant, I'd have to have a girl first.\r\n           And lay off the radio show. There's a\r\n           reason I took the 3am slot.\r\n                         \r\n<b>                          SAM\r\n</b>           And every time I see you doing homework,\r\n           you're taking a break. You're the best\r\n           I've ever seen when it comes to\r\n           procrastinating.\r\n                         \r\n<b>                          MAX\r\n</b>           I should be, procrastination is one of my\r\n           favorite hobbies. Isn't it funny that my\r\n           two favorite hobbies rhyme?\r\n                         \r\n          Charles' expression turns sour as he looks across the room.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Oh, shit, Sara's here.\r\n                         \r\n          SARA, good-looking and excitable, arrives with a theatrical\r\n          flourish. Her age and manner indicate, among other things,\r\n          that she is a freshman.\r\n                         \r\n<b>                          SARA\r\n</b>           Ta-daaa! Hey guys, what's going on?\r\n                         \r\n<b>                          SAM\r\n</b><b>                          (DEADPAN)\r\n</b>           We were just talking about the mediocre\r\n           resonations of sub-hybrid fields.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't believe you think they're\r\n           mediocre. Those guys rock.\r\n<b>           22.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SARA\r\n</b>           (doesn't get it, doesn't care)\r\n           Oh. Well, I just wanted to stop by and\r\n           say \"hey\" to my favorite guys. So hey!\r\n           How was everyone's break?\r\n                         \r\n          She is clearly talking to Charles, who is scanning the room\r\n          over her shoulder.\r\n                         \r\n<b>                          SAM\r\n</b>           Good.\r\n                         \r\n<b>                          MAX\r\n</b>           It could have been better but it could\r\n           have been worse. For me, that's good.\r\n                         \r\n<b>                          SARA\r\n</b>           Mine was great! I partied with my best\r\n           friend Melanie, who I haven't seen in\r\n           ages. Aren't these parties just the best?\r\n           So much better than the theater group\r\n           parties.\r\n                         \r\n<b>                          MAX\r\n</b>           I dunno, it's a bunch of 21-year-olds who\r\n           want the 18-year-olds to know how mature\r\n           they are.\r\n                         \r\n<b>                          SARA\r\n</b>           Hey, Charles, you going to the fraternity\r\n           party after this?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ugh, no.\r\n                         \r\n<b>                          SARA\r\n</b>           You gonna be back at your suite then?\r\n           Maybe I'll stop by.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Uh, yeah, we should be back in, uh, many\r\n           many hours.\r\n                         \r\n<b>                          SARA\r\n</b>           Okay then, I'll catch up with you guys\r\n           later.\r\n                         \r\n          She tugs on Charles's shirt.\r\n                         \r\n<b>                          SARA (CONT'D)\r\n</b><b>                          (STAGE WHISPER)\r\n</b>           I missed you.\r\n                         \r\n          She leaves.\r\n<b>           23.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Shit, I was hoping to avoid her for at\r\n           least a few more days.\r\n                         \r\n<b>                          SAM\r\n</b>           What do you have against her? She seems\r\n           nice.\r\n                         \r\n<b>                          CHARLES\r\n</b>           First, she makes my skin crawl. Second,\r\n           if word gets out, it'll ruin my\r\n           reputation in the freshman dorms.\r\n                         \r\n          Sam looks to Max for the real story.\r\n                         \r\n<b>                          MAX\r\n</b>           Never hook up with people in your cast.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I am a world-class knucklehead.\r\n                         \r\n          A pretty girl approaches.\r\n                         \r\n<b>                          JULIE\r\n</b>           I'm sorry to interrupt, I thought I heard\r\n           one of you say \"Max.\"\r\n                         \r\n<b>                          CHARLES\r\n</b>           One of us is Max.\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (TO CHARLES)\r\n</b>           Oh, great, just as I hoped. I just wanted\r\n           to say, I heard your radio show last week\r\n           and I thought it was great. Thoughtful\r\n           and poignant and funny, too. You know,\r\n           you look just like I imagined, too.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Thanks.\r\n                         \r\n<b>                          MAX\r\n</b>           I'm Max.\r\n                         \r\n<b>                          JULIE\r\n</b>           Huh?\r\n                         \r\n<b>                          MAX\r\n</b>           I'm Max.\r\n<b>                          (SUDDENLY STRUCK)\r\n</b>           Oh my God, you heard my show?\r\n                         \r\n<b>                          JULIE\r\n</b>           You're Max? Then who are you?\r\n<b>           24.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Charles. I'm an actor.\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (TO MAX)\r\n</b>           You okay? You look like you're in pain.\r\n                         \r\n<b>                          MAX\r\n</b>           You don't get it, I can't do my show if I\r\n           even suspect someone is listening. Now I\r\n           have to change time slots. Again.\r\n                         \r\n<b>                          JULIE\r\n</b>           I'm sorry, I didn't realize I wasn't\r\n           supposed to listen.\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (INCONSOLABLE)\r\n</b>           No, it's no good, the whole episode is\r\n           ruined. This is a disaster.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I work in theater a lot.\r\n                         \r\n<b>                          JULIE\r\n</b>           Alright, listen. I was kidding. Your show\r\n           actually kind of sucked.\r\n                         \r\n<b>                          MAX\r\n</b>           What?!\r\n                         \r\n<b>                          JULIE\r\n</b>           Just kidding! It was awesome.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I also direct.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, when did you tune in? I need to know\r\n           which episode you ruined.\r\n                         \r\n<b>                          JULIE\r\n</b>           At one point you dialed a phone sex line.\r\n           It was hilarious. It's not every day\r\n           someone calls 1-900-4RIMJOBS to discuss\r\n           politics.\r\n                         \r\n          Sam quickly pulls Charles away as he starts to comment.\r\n                         \r\n<b>                          MAX\r\n</b>           And she hung up. \"This isn't the place\r\n           for that kind of talk...\"\r\n<b>           25.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Yeah, it's like, for four dollars a\r\n           minute, you should talk about whatever\r\n           you want. You know the country's in\r\n           trouble when a phone sex operator thinks\r\n           talking politics is beneath her.\r\n                         \r\n<b>                          MAX\r\n</b>           Perhaps she'd been screwed by\r\n           politicians. Phone sex is just pretend\r\n           but politics... I know my ass is still\r\n           sore.\r\n                         \r\n          He catches himself and falters. Julie notices something.\r\n                         \r\n<b>                          JULIE\r\n</b>           Listen, I'm being flagged down by my over-\r\n           protective friends. It was nice meeting\r\n           you, though.\r\n                         \r\n<b>                          MAX\r\n</b>           Wait, wait. How did you know about my\r\n           show?\r\n                         \r\n<b>                          JULIE\r\n</b>           Someone mentioned you.\r\n                         \r\n<b>                          MAX\r\n</b>           Anybody I know? Oh, duh, I guess it would\r\n           have to be someone I know.\r\n                         \r\n<b>                          JULIE\r\n</b>           It was from a good source. I was told I'd\r\n           like you, but to really know you, I\r\n           should hear your show.\r\n                         \r\n<b>                          MAX\r\n</b>           What, really?\r\n                         \r\n          She appraises him for a beat.\r\n                         \r\n<b>                          JULIE\r\n</b>           It was Beth.\r\n                         \r\n          And with that, she leaves. Max watches her, loses her in the\r\n          crowd. Something catches his eye across the room.\r\n                         \r\n          MAX'S POV: Sam is in a corner, trapped by an upset Jen. From\r\n          his gestures, he is on the defensive.\r\n                         \r\n          Charles moseys over.\r\n<b>           26.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Check it. Jen traded shifts and got out\r\n           of work, so she went to the lab to\r\n           surprise Sam. He wasn't there, and\r\n           then Tommy gave away that he was here.\r\n                         \r\n<b>                          MAX\r\n</b>           Busted.\r\n                         \r\n<b>                          CHARLES\r\n</b>           And how. Let's bail before the beheadings\r\n           begin. Plus, The Rat Pack's on HBO later.\r\n                         \r\n           They put on their coats.\r\n                         \r\n<b>                          MAX\r\n</b>           How can you stand that show?\r\n                         \r\n<b>                          CHARLES\r\n</b>           I told you, it's research. It's why I got\r\n           three phone numbers, Max, while you were\r\n           talking to that cutie.\r\n                         \r\n<b>          24 INT. COLLEGE APARTMENT STAIRWELL 24\r\n</b>                         \r\n<b>                          MAX\r\n</b>           \"Cutie\"?\r\n                         \r\n<b>                          CHARLES\r\n</b>           That's right. You get her name?\r\n                         \r\n<b>                          MAX\r\n</b>           We just met. I was working up to it.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Man, you're worse at picking up chicks\r\n           than me. We are one sad couple of bozos.\r\n                         \r\n           Max looks at him like he's insane.\r\n                         \r\n<b>          25 INT. MAX AND SAM'S ROOM ­ LATER 25\r\n</b>                         \r\n           Alone, he kicks snow off his boots as he sheds his winter\r\n           layers. He taps the answering machine.\r\n                         \r\n<b>                          BETH\r\n</b><b>                          (ON MACHINE)\r\n</b>           Uh, hi, Max. Guess who? It's Beth. Been a\r\n           while, huh? Since that lunch last August\r\n           that somehow never happened. Anyway, uh,\r\n           just checking in, I guess. Hope your\r\n           break was okay. Uh, and----\r\n<b>           27.\r\n</b>                         \r\n                         \r\n                         \r\n           BEEEEEEEP. The machine cuts her off. Max sighs, picks up the\r\n           phone, dials.\r\n                         \r\n<b>                          MAX\r\n</b>           Hello? Beth?... Sorry... Hello...? Hey, how's\r\n           it going?... Yeah, in person... Too long... So\r\n           anyway, I just wanted to say hi, and\r\n           also, stop telling people to listen to my\r\n           show... Of course I'm serious... Stop\r\n           laughing... Of course I haven't changed...\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"MONDAY\"\r\n                         \r\n<b>          26 INT. COMMON ROOM -- THE NEXT MORNING 26\r\n</b>                         \r\n           Sara sleeps on a couch. Charles, wearing only boxers, hung\r\n           over and mostly asleep, passes through the living room. He\r\n           stubs his toe and crashes into the wall.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ow! Shit! Ow!\r\n                         \r\n           He continues into the bathroom. Sara wakes up and looks\r\n           around groggily. A FLUSH. Charles walks out of the bathroom\r\n           and blinks at Sara with surprise.\r\n                         \r\n<b>                          CHARLES (CONT'D)\r\n</b>           Jeeezzus! Shit, sorry you um...\r\n                         \r\n<b>                          SARA\r\n</b>           It's all right, this isn't the first time\r\n           this has happened. At least this time I'm\r\n           not the naked one.\r\n                         \r\n<b>                          CHARLES\r\n</b>           It's just that, I mean, I'm just\r\n           surprised to see you here.\r\n                         \r\n<b>                          SARA\r\n</b>           Hmm, yeah, I must have shown up after you\r\n           came back, or something. I was planning\r\n           to go home, but I guess I fell asleep.\r\n                         \r\n           She waits for something from Charles. He doesn't respond. She\r\n           reluctantly gets to her feet.\r\n                         \r\n<b>                          SARA (CONT'D)\r\n</b>           Anyway, I, uh, I've got a bunch of stuff\r\n           to do. I'll see you later.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Bye.\r\n<b>           28.\r\n</b>                         \r\n                         \r\n                         \r\n          As she leaves, Max comes in, still in last night's clothes.\r\n                         \r\n<b>                          MAX\r\n</b>           You all right?\r\n                         \r\n<b>                          CHARLES\r\n</b>           She's around all the time! I chose to\r\n           live with my hombres, not her. She's got\r\n           to realize that we're not right for each\r\n           other and get on with her life.\r\n                         \r\n<b>                          MAX\r\n</b>           No, I mean, I thought I heard you fall or\r\n           something.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Oh, what? I just stubbed my toe.\r\n                         \r\n<b>                          MAX\r\n</b>           That sucks. Bad way to start the day.\r\n                         \r\n<b>                          CHARLES\r\n</b>           The toe's the least of it.\r\n                         \r\n<b>                          MAX\r\n</b>           This is funny, in a way. Yesterday you\r\n           were complaining about not having any\r\n           girls. Now you're complaining because you\r\n           have one.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I know. It's a shame. And I was attracted\r\n           to her once, too. What happened?\r\n                         \r\n<b>                          MAX\r\n</b>           Want me to tell you?\r\n                         \r\n<b>                          CHARLES\r\n</b>           No! I think I've heard enough from the\r\n           Nostradamus of failed relationships to\r\n           last a lifetime.\r\n                         \r\n<b>                          MAX\r\n</b>           Speaking of failed relationships, I was\r\n           thinking about your Annie Hall theory.\r\n           Specifically, I was thinking that you're\r\n           insane.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I said I was joking, so why do you keep\r\n           bringing it up?\r\n<b>           29.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           It's like you insulted my religion. Like,\r\n           \"Hey, Cardinal, I think Jesus might be\r\n           why you're not getting laid...\"\r\n                         \r\n<b>                          CHARLES\r\n</b>           Your attitude's too dour. You've gotta be\r\n           more fun.\r\n                         \r\n<b>                          MAX\r\n</b>           It's not my fault Annie Hall's honest\r\n           about the futility of romance.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You're just a wuss. The very thought of\r\n           not seeing that movie scares you. You're\r\n           like a junkie, you need movie methadone.\r\n           Like, from now on you can only see\r\n           Manhattan.\r\n                         \r\n<b>                          MAX\r\n</b>           Forget it, I hate Manhattan.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You think addicts like Methadone?\r\n                         \r\n<b>                          MAX\r\n</b>           My Uncle Harry didn't seem to mind.\r\n                         \r\n<b>                          CHARLES\r\n</b>           So what are we doing for lunch?\r\n                         \r\n           Scott enters.\r\n                         \r\n<b>                          SCOTT\r\n</b>           You mean breakfast.\r\n                         \r\n<b>                          MAX\r\n</b>           Actually, I'm supposed to eat with Beth.\r\n                         \r\n           He doesn't look excited at the prospect, but Charles does.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Beth? Wow. She hasn't been around in\r\n           ages. Say hi for me.\r\n                         \r\n<b>          27 EXT. FRANNIE'S ­ DAY 27\r\n</b>                         \r\n           Max walks with Beth down the city street. She carries an\r\n           umbrella and scans the skies.\r\n                         \r\n<b>                          BETH\r\n</b>           Wasn't it supposed to rain?\r\n<b>           30.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           I dunno.\r\n                         \r\n<b>                          BETH\r\n</b>           Max, it's been ten minutes and we're\r\n           still discussing the weather.\r\n                         \r\n<b>                          MAX\r\n</b>           So? Think of all the people who've died\r\n           in hurricanes. I bet they think it's a\r\n           worthy issue.\r\n                         \r\n<b>                          BETH\r\n</b>           I just feel like there are other things\r\n           we could be talking about. You're the one\r\n           person I could rely on to say something\r\n           original.\r\n                         \r\n<b>                          MAX\r\n</b>           Okay, okay.\r\n<b>                          (BEAT)\r\n</b>           So, what classes are you taking?\r\n                         \r\n<b>                          BETH\r\n</b>           This was a mistake, wasn't it?\r\n                         \r\n<b>                          MAX\r\n</b>           What? No.\r\n                         \r\n           They stop in front of Frannie's, a small greasy spoon.\r\n                         \r\n<b>                          BETH\r\n</b>           Look, let's just call it a day. I was\r\n           excited to hear from you, but I can't\r\n           take you like this.\r\n                         \r\n           A COUPLE exit, the guy holds the door for them. They\r\n           hesitate. Suddenly, from inside:\r\n                         \r\n<b>           CHARLES (O.S.)\r\n</b>           Max! Beth! Come sit with us!\r\n                         \r\n<b>                          MAX\r\n</b>           No, I'm sorry. Don't worry about it. To\r\n           be honest, it's nice being with someone\r\n           besides my suitemates for a change.\r\n                         \r\n           They look in and see...\r\n                         \r\n<b>          28 INT. FRANNIE'S ­ CONTINUOUS 28\r\n</b>                         \r\n           ...Charles, Scott, Amanda, Sam and Jen, seated around a huge\r\n           table. They are waving them in. Beth enters, Max reluctantly\r\n           follows.\r\n<b>           31.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JEN\r\n</b>           Oh my, God, Beth! It's great to see you!\r\n                         \r\n<b>                          AMANDA\r\n</b>           It's been so long!\r\n                         \r\n          Everyone scoots over to make room. Max is still stunned but\r\n          has no choice. He sits.\r\n                         \r\n<b>                          JEN\r\n</b>           How did we ever fall out of touch? We\r\n           shouldn't let that happen again.\r\n                         \r\n<b>                          BETH\r\n</b>           I know! I even miss this place. I live on\r\n           the wrong side of campus now. You guys\r\n           still come here? It's so dark and the\r\n           menu is tiny.\r\n                         \r\n<b>                          CHARLES\r\n</b>           It never changes, that's why.\r\n                         \r\n<b>                          SAM\r\n</b><b>                          (TO JEN)\r\n</b>           What are you gonna get?\r\n                         \r\n<b>                          JEN\r\n</b>           Maybe an omelet.\r\n                         \r\n<b>                          MAX\r\n</b>           Do you have to get eggs? I'm allergic.\r\n                         \r\n<b>                          JEN\r\n</b>           So don't get the eggs.\r\n                         \r\n<b>                          MAX\r\n</b>           It's just that, it's the smell. It's the\r\n           smell that bothers me.\r\n                         \r\n<b>                          JEN\r\n</b>           Are you serious? How can you be allergic\r\n           to the smell of my eggs?\r\n                         \r\n<b>                          BETH\r\n</b>           Don't worry about it, Jen. He's just\r\n           incredibly picky about food.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Even other people's.\r\n                         \r\n<b>                          MAX\r\n</b>           Look, if you're going to have eggs, let\r\n           me at least switch seats with Sam, so\r\n           I'll be farther away from it.\r\n<b>           32.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SAM\r\n</b>           Max, what's up with you today? Join a\r\n           support group.\r\n                         \r\n<b>                          CHARLES\r\n</b>           If it really bothers you, why don't you\r\n           and Beth switch?\r\n                         \r\n           This would put Beth next to Charles. She looks at him and he\r\n           smiles. Unable to help herself, she smiles back.\r\n                         \r\n<b>                          SAM\r\n</b>           What about people at other tables? Should\r\n           we ask the management to stop serving egg-\r\n           products to people upwind of you?\r\n                         \r\n<b>                          JEN\r\n</b>           Why can't you just get along with\r\n           everyone for once?\r\n                         \r\n<b>                          MAX\r\n</b>           Alright, alright, you win, we'll switch.\r\n           Come on, Beth, get up.\r\n                         \r\n<b>                          BETH\r\n</b><b>                          (JOKINGLY)\r\n</b>           What makes you so sure I'm gonna switch?\r\n           I don't think I'm gonna move.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Don't give in, Beth. I've got your back.\r\n                         \r\n<b>                          MAX\r\n</b>           You owe me. Remember when you threw that\r\n           egg at me in the dining hall?\r\n                         \r\n<b>                          BETH\r\n</b>           Okay, I'll get up. But I'm ordering an\r\n           omelet.\r\n                         \r\n           She sits down next to Charles and they smile at each other.\r\n                         \r\n<b>          29 EXT. ATM NEAR THEATER ­ LATER 29\r\n</b>                         \r\n           Max walks down the street toward an ATM, where a long line of\r\n           college students has formed. Next to the ATM is an arthouse\r\n           theater. The marquee reads \"Thru Valentine's Day: ANNIE HALL\r\n           and CASABLANCA.\"\r\n                         \r\n           He joins the ATM line. A moment later, Julie walks by. She\r\n           notices him and stops.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hi. Look at this line.\r\n<b>           33.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Oh, hey. Yeah, I hate coming here this\r\n           time of day, but I need money. You know,\r\n           gambling debts and all.\r\n                         \r\n<b>                          JULIE\r\n</b>           Aren't ATMs great? They save so much\r\n           time. Think about what life must have\r\n           been like before them.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't support an acronym without\r\n           knowing what it stands for. I once joined\r\n           NAMBLA because I thought it was an animal\r\n           rights group.\r\n                         \r\n          She laughs.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           So, are you a junior, too?\r\n                         \r\n<b>                          JULIE\r\n</b>           I'm listed as a sophomore, but I've taken\r\n           some time off.\r\n                         \r\n<b>                          MAX\r\n</b>           What're you majoring in?\r\n                         \r\n<b>                          JULIE\r\n</b>           Why is that always the first question?\r\n                         \r\n<b>                          MAX\r\n</b>           It was my second question.\r\n                         \r\n<b>                          JULIE\r\n</b>           And how would you answer it?\r\n                         \r\n<b>                          MAX\r\n</b>           I'd be honest. Oh, wait. Media Studies.\r\n           This week, I'm majoring in Media Studies.\r\n           I used to be a double-major, Renaissance\r\n           Footwear and Neurosurgery, but, ya know,\r\n           it was just too hard to get course credit\r\n           for watching movies.\r\n                         \r\n<b>                          JULIE\r\n</b>           I bet. Me, I'm in Soc., but I'm leaning\r\n           toward Business, or Psych. Or Art\r\n           History.\r\n                         \r\n<b>                          MAX\r\n</b>           Why don't you just be undeclared?\r\n<b>           34.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Not my style.\r\n                         \r\n           Max's turn-- but he spots ANNIE HALL on the marquee.\r\n           Impulsively, he turns Julie to face him, so that her back is\r\n           to it. In doing so, he steps away from the ATM.\r\n                         \r\n<b>                          JULIE (CONT'D)\r\n</b>           Are you okay? I thought you needed money.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, I forgot, my bookie takes checks now.\r\n                         \r\n<b>                          JULIE\r\n</b>           Seriously, is everything okay?\r\n                         \r\n<b>                          MAX\r\n</b>           Actually, yes. But I need something from\r\n           you.\r\n                         \r\n<b>                          JULIE\r\n</b>           What?\r\n                         \r\n<b>                          MAX\r\n</b>           Your name.\r\n                         \r\n<b>                          JULIE\r\n</b>           It's Julie, no nickname. Don't even think\r\n           of calling me \"Jewel.\"\r\n                         \r\n<b>                          MAX\r\n</b>           Okay, Julie with no nickname, I, um, I'll\r\n           see you around?\r\n                         \r\n<b>                          JULIE\r\n</b>           Probably.\r\n                         \r\n           She leaves. Max goes back to the end of the line.\r\n                         \r\n<b>          30 INT. COMMON ROOM -- NIGHT 30\r\n</b>                         \r\n           Lounging are Max and Charles, Sam and Tommy, and Scott and\r\n           Amanda.\r\n                         \r\n           Charles pulls a bottle of vodka from a newsbox.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Come on, which of you cats is in?\r\n                         \r\n<b>                          MAX\r\n</b>           It's only Monday.\r\n<b>           35.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Shit, it's only Monday? Now I really need\r\n           a drink.\r\n                         \r\n<b>                          SAM\r\n</b>           I'm in.\r\n                         \r\n          Charles takes two mugs off the floor, throws their contents\r\n          into a plant, and pours.\r\n                         \r\n          Tommy is on one end of a couch, sneaking looks at Amanda, in\r\n          the middle, who is sneaking looks at Scott, on the other end.\r\n                         \r\n<b>                          AMANDA\r\n</b><b>                          (TO SCOTT)\r\n</b>           How was your day?\r\n                         \r\n<b>                          TOMMY\r\n</b><b>                          (ANSWERING HER)\r\n</b>           My day sucked. I spent six hours in the\r\n           lab and four hours in class. And tonight,\r\n           I have to study for two tests.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ouch.\r\n                         \r\n<b>                          TOMMY\r\n</b>           It better be worth it when I get into\r\n           grad school.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Scott, how's the design project coming?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Slowly. There are a couple problems.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Huh.\r\n                         \r\n          Scott gets up and leaves the room.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Listen, I have an extra ticket to this\r\n           concert tomorrow night.\r\n                         \r\n          Charles, Sam, and Max look on with alarm: is he really going\r\n          through with this, here, now? Amanda takes the bait.\r\n                         \r\n<b>                          AMANDA\r\n</b>           The Ani DiFranco show? Awesome!\r\n           That's been sold out for weeks!\r\n<b>           36.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          TOMMY\r\n</b>           It's not Ani DiFranco, it's better-- two,\r\n           front row seats at the Campus Choir\r\n           charity show.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Oh.\r\n                         \r\n<b>                          TOMMY\r\n</b>           So do ya wanna go?\r\n                         \r\n<b>                          AMANDA\r\n</b>           I dunno. Why don't you call me tomorrow\r\n           during the day.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Okay, great.\r\n                         \r\n<b>                          AMANDA\r\n</b>           It's getting late. See you guys later.\r\n                         \r\n<b>           SAM - MAX - CHARLES\r\n</b>           Bye.\r\n                         \r\n<b>                          TOMMY\r\n</b>           See you tomorrow.\r\n                         \r\n          Amanda exits.\r\n                         \r\n<b>                          TOMMY (CONT'D)\r\n</b>           Wow, that went pretty good.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Using Ani DiFranco to get laid. I've\r\n           gotta try that.\r\n                         \r\n<b>                          SAM\r\n</b>           She'll never give up on Scott.\r\n                         \r\n<b>                          TOMMY\r\n</b>           It's not like I expect anything, I just\r\n           like to spend time with her.\r\n                         \r\n          Scott wanders back in with a copy of Wired magazine. Tommy\r\n          stands.\r\n                         \r\n<b>                          TOMMY (CONT'D)\r\n</b>           Scott, do you mind if I take Amanda to a\r\n           concert tomorrow night?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Why would I?\r\n<b>           37.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          TOMMY\r\n</b>           I didn't think so, but not asking would\r\n           be wrong.\r\n                         \r\n<b>                          SCOTT\r\n</b>           No, it wouldn't.\r\n                         \r\n<b>                          TOMMY\r\n</b>           But...\r\n                         \r\n<b>                          SAM\r\n</b>           It's not even a date.\r\n                         \r\n<b>                          TOMMY\r\n</b>           It's nothing serious, but it is a date.\r\n                         \r\n<b>                          CHARLES\r\n</b>           But they're going as friends.\r\n                         \r\n<b>                          SAM\r\n</b>           They are friends.\r\n                         \r\n<b>                          MAX\r\n</b>           She probably won't even go.\r\n                         \r\n          Scott sits and reads his magazine. Tommy drops heavily into a\r\n          chair.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Whenever you're done, someone please give\r\n           me an update on my sex life.\r\n                         \r\n<b>                          CHARLES\r\n</b>           How does \"sex life\" enter, if she might\r\n           not be going, and if she does, it's just\r\n           as friends?\r\n                         \r\n<b>                          SAM\r\n</b>           Wait, can you be on a date with someone\r\n           you're not dating?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Yes. No.\r\n                         \r\n<b>                          TOMMY\r\n</b>           I didn't think it was such a big deal!\r\n<b>                          (TO SCOTT)\r\n</b>           I just wanted to make sure it didn't\r\n           bother you.\r\n                         \r\n          Scott looks at him like, Are you kidding? and goes back to\r\n          his magazine. Tommy looks frustrated.\r\n<b>           38.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           This conversation is starting to bother\r\n           me.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"TUESDAY\"\r\n                         \r\n<b>          31 INT. DARK ROOM ­ THE NEXT DAY 31\r\n</b>                         \r\n           Max shakes a tumbler as Amanda keeps time.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Tired yet?\r\n                         \r\n<b>                          MAX\r\n</b>           This is ridiculous. What other art form\r\n           involves industrial toxins and complex\r\n           chemical reactions? Nobody ever got\r\n           cancer from dancing.\r\n                         \r\n<b>                          AMANDA\r\n</b>           You're so paranoid.\r\n                         \r\n<b>                          MAX\r\n</b>           I'm serious. Chemicals make me very\r\n           nervous. Isn't this how the Unabomber got\r\n           started?\r\n                         \r\n           He continues shaking.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Max, do I bother Scott when I'm around?\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, boy, this fixer smells delicious...\r\n                         \r\n<b>                          AMANDA\r\n</b>           `Cuz, sometimes it seems like I do. I\r\n           know he's not, like, interested, but\r\n           then, sometimes it seems like he is. I\r\n           just don't want it to be awkward. Please,\r\n           tell me the truth.\r\n                         \r\n<b>                          MAX\r\n</b>           I, uh, I mean, the truth is, it's not a\r\n           topic. It doesn't bother him, or us. Or I\r\n           mean, he doesn't talk about it.\r\n                         \r\n<b>                          AMANDA\r\n</b>           So he never talks about me?\r\n                         \r\n<b>                          MAX\r\n</b>           Yes, I mean, no, not with us, anyway.\r\n<b>           39.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          AMANDA\r\n</b>           I knew it.\r\n                         \r\n<b>                          MAX\r\n</b>           Listen. All I'm trying to say is, you're\r\n           not a topic that comes up very often.\r\n                         \r\n<b>                          AMANDA\r\n</b>           So with all the time we spend together,\r\n           none of you have any opinion of me?!\r\n                         \r\n          Amanda storms out of the room.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, that's not... what I meant. Oy.\r\n                         \r\n          Amanda returns, still upset.\r\n                         \r\n<b>                          AMANDA\r\n</b>           It's time! To unroll the film.\r\n                         \r\n          Max, startled, fumbles open the tumbler.\r\n                         \r\n<b>                          MAX\r\n</b>           Listen, Amanda. Scott likes you as much\r\n           as we all do, so it doesn't leave much\r\n           room for discussion. We mostly only talk\r\n           about what we hate.\r\n                         \r\n<b>                          AMANDA\r\n</b>           I know. It's just sometimes, I wish...\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, I know.\r\n                         \r\n          Amanda takes the negatives, opens the door to a closet, hangs\r\n          them from a clothespin, and leaves. Max takes his, selects a\r\n          clothespin, and knocks several others to the floor. He tries\r\n          to pick them up, and manages to step on them.\r\n                         \r\n<b>           AMANDA (O.S.)\r\n</b>           Max? Are you coming?\r\n                         \r\n          He throws the crumpled negatives in the closet and grabs his\r\n          bag. At the door, he notices one stuck to his shoe.\r\n                         \r\n<b>                          MAX\r\n</b>           Shit!\r\n                         \r\n          He takes the negative off his shoe, almost knocking himself\r\n          over, and hurries out.\r\n<b>           40.\r\n</b>                         \r\n                         \r\n                         \r\n<b>           AMANDA (O.S.)\r\n</b>           Why does it always take you so long in\r\n           there?\r\n                         \r\n<b>          32 INT. COMMON ROOM -- LATER 32\r\n</b>                         \r\n           Max enters to find Sam playing video hockey.\r\n                         \r\n<b>                          MAX\r\n</b>           Hey, remember the scene in Swingers when\r\n           they play this? That was awesome. I love\r\n           movie scenes I can relate to.\r\n                         \r\n           He sits down next to him.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah. Wasn't there also a video hockey\r\n           scene in Mallrats?\r\n                         \r\n<b>                          MAX\r\n</b>           No, you're thinking of Chasing Amy.\r\n                         \r\n<b>                          SAM\r\n</b>           Which one had all the comic book stuff?\r\n                         \r\n<b>                          MAX\r\n</b>           They both did.\r\n                         \r\n<b>                          SAM\r\n</b>           What about the Star Wars stuff?\r\n                         \r\n<b>                          MAX\r\n</b>           Mallrats, Clerks, and Dogma.\r\n                         \r\n<b>                          SAM\r\n</b>           What about the last one?\r\n                         \r\n<b>                          MAX\r\n</b>           Doesn't count, it was just an ad for all\r\n           his other films.\r\n                         \r\n<b>                          SAM\r\n</b>           You gotta admit, it's fucking cheap for a\r\n           movie to refer to other movies.\r\n                         \r\n<b>                          MAX\r\n</b>           Why? We do it real life. We're doing it\r\n           right now. What you're saying is, if this\r\n           was a movie, it wouldn't be any good.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah. Our lives would make an awful\r\n           movie.\r\n<b>           41.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           But if our lives were a movie, you'd\r\n           never be able to say that. You'd be\r\n           giving the critics the perfect quote to\r\n           pan it with.\r\n                         \r\n<b>                          SAM\r\n</b>           So fucking what? It's a shitty movie!\r\n                         \r\n           Sam drops his controller and gets up.\r\n                         \r\n<b>                          MAX\r\n</b>           Are you okay?\r\n                         \r\n<b>                          SAM\r\n</b>           How come you only play this one video\r\n           game?\r\n                         \r\n<b>                          MAX\r\n</b>           Video hockey is my game. Like a swan, I\r\n           mate for life.\r\n                         \r\n<b>                          SAM\r\n</b>           More like the loon.\r\n                         \r\n           Max looks him over.\r\n                         \r\n<b>                          MAX\r\n</b>           Holy shit, you and Jen broke up.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah. Your prediction finally came true.\r\n           Come on, let's hit the bar. I need a\r\n           drink.\r\n                         \r\n<b>          33 INT. COFFEE BAR ­ DAY 33\r\n</b>                         \r\n           A crummy collegiate dive. Sam and Max drink coffees.\r\n                         \r\n<b>                          MAX\r\n</b>           Okay, so what happened?\r\n                         \r\n<b>                          SAM\r\n</b>           We were just hanging out, and she told me\r\n           she loves me. Completely out of the blue.\r\n           She says things like that sometimes,\r\n           things like \"I love that you're my\r\n           boyfriend,\" ya know? But usually when\r\n           we're in bed or something. But this time\r\n           it was different, all we were doing was\r\n           watching TV.\r\n                         \r\n<b>                          MAX\r\n</b>           Porn?\r\n<b>           42.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SAM\r\n</b>           Almost. It was \"our\" show, the one we\r\n           like to get romantic to...\r\n                         \r\n<b>          34 INT. JEN'S DORM ROOM ­ SAM'S FLASHBACK 34\r\n</b>                         \r\n           Sam and Jen watch \"The X-Files.\" Max stands, observing. Jen\r\n           can't see him.\r\n                         \r\n<b>                          SAM\r\n</b><b>                          (TO MAX)\r\n</b>           I was just tired of trying to tell her\r\n           what she wanted to hear all the time, so\r\n           I tried to be honest.\r\n<b>                          (TO JEN)\r\n</b>           We've been together a long time and I\r\n           really care about you, but I don't know\r\n           if I love you. This is tough to say, but\r\n           I think something might be missing from\r\n           our relationship.\r\n                         \r\n<b>                          JEN\r\n</b>           Something's missing?\r\n                         \r\n<b>                          SAM\r\n</b>           Well, not completely... I don't know if I\r\n           can explain it. See...\r\n<b>                          (FUMBLING)\r\n</b>           There are three things I look for in a\r\n           girl: heart, body, and mind. And well,\r\n           you've got the body.\r\n                         \r\n           Max is stunned and laughs. Jen is stunned, too, and runs out.\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (TO CAMERA)\r\n</b>           Jesus. You think you know someone pretty\r\n           well and then they do something like\r\n           this.\r\n                         \r\n<b>                          SAM\r\n</b>           When she comes back, she slaps me in the\r\n           face and makes me leave. Then she calls,\r\n           crying, and asks me to come over. When I\r\n           go back, she kicks me out and says she\r\n           never wants to see me again.\r\n                         \r\n<b>                          MAX\r\n</b>           Fifty bucks says there's a message on the\r\n           machine when we get back.\r\n                         \r\n           Max sits, and the background DISSOLVES back TO:\r\n<b>           43.\r\n</b>                         \r\n                         \r\n<b>          35 INT. COFFEE BAR ­ PRESENT 35\r\n</b>                         \r\n<b>                          SAM\r\n</b>           Is it really so bad? I couldn't lie to\r\n           her.\r\n                         \r\n<b>                          MAX\r\n</b>           Don't you know that no matter how often\r\n           girls tell you they want honesty, they\r\n           never really mean it? Nobody does!\r\n                         \r\n<b>                          SAM\r\n</b>           Look, I fucked up, alright? I didn't know\r\n           what to say.\r\n                         \r\n<b>                          MAX\r\n</b>           It's too bad it ended like this. I'm\r\n           really sorry.\r\n                         \r\n<b>                          SAM\r\n</b>           Me too. It'll be hard to get used to, but\r\n           at least we ended it early.\r\n                         \r\n           Sam throws some money on the table and they get up.\r\n                         \r\n<b>                          SAM (CONT'D)\r\n</b>           Hey, you know what I'm in the mood for?\r\n           Annie Hall.\r\n                         \r\n<b>                          MAX\r\n</b>           Jesus, that film...-- Have you heard\r\n           Charles' theory?\r\n                         \r\n<b>                          SAM\r\n</b>           Come on, Max, I can only deal with one\r\n           mid-life crisis at a time.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't believe you said that to her.\r\n           That's so cool.\r\n                         \r\n<b>                          SAM\r\n</b>           You think?\r\n                         \r\n<b>                          MAX\r\n</b>           No.\r\n                         \r\n<b>                          SAM\r\n</b>           Gee, at least I can hang out with my\r\n           friends again.\r\n<b>           44.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          36 INT. THE PUB ­ LATER THAT NIGHT 36\r\n</b>                         \r\n           \"New wave dance party\" in The Pub, the small, grungy club on\r\n           campus. A DJ plays something obscure from the 80s. Some\r\n           people dance, while the rest, including Max, Charles, and\r\n           Scott, sit at tables by the coffee bar in the back.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I was talking to Amanda the other day.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Was that Thursday? Because there was that\r\n           half hour when she didn't call or visit.\r\n                         \r\n<b>                          MAX\r\n</b>           Scott, why don't you go for her? You seem\r\n           to get along well.\r\n                         \r\n<b>                          SCOTT\r\n</b>           She follows me around now. If we slept\r\n           together, I'd never get rid of her.\r\n                         \r\n<b>                          MAX\r\n</b>           You're exaggerating.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Look at Sam and Jen.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ouch.\r\n                         \r\n<b>                          MAX\r\n</b>           Bad example: it could never get that bad.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ouch.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Then look at Charles and Sara.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Okay, ouch for real this time.\r\n                         \r\n           Max looks O.S. and goes pale.\r\n                         \r\n<b>                          MAX\r\n</b>           Shit, she's here.\r\n                         \r\n           Julie walks through the crowd in their direction, but stops\r\n           at another table, talking to friends. Max exhales slowly.\r\n                         \r\n<b>                          CHARLES\r\n</b>           That dame from History class?\r\n<b>           45.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           No. She's, she's just a girl. I shouldn't\r\n           have mentioned it.\r\n                         \r\n<b>                          SCOTT\r\n</b>           But you did mention it.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Ohhh, that's the one from the party.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Get her name yet?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, it's \"Julie\"... Julie. She's cute,\r\n           and she seems interesting, but I'm sure\r\n           she has all kinds of horrible flaws I\r\n           don't know about.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Uh-oh. This is bad.\r\n                         \r\n<b>                          MAX\r\n</b>           What do you mean?\r\n                         \r\n<b>                          CHARLES\r\n</b>           You're thinking about her. You're already\r\n           making yourself nervous and you barely\r\n           know her. You do this every time!\r\n                         \r\n<b>                          MAX\r\n</b>           I wonder if maybe I should go say hi.\r\n                         \r\n<b>                          CHARLES\r\n</b>           See, this is what I'm talking about.\r\n           If you don't go hit on her, I will.\r\n                         \r\n<b>                          MAX\r\n</b>           Do you know the guys she's talking to?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Yeah. The guy in the jacket is annoying.\r\n                         \r\n          Julie sees him. He freezes like a deer in headlights.\r\n                         \r\n<b>                          MAX\r\n</b>           Shit, shit, shit, she's looking this way.\r\n           Fuck. What should I...?\r\n<b>           46.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           You have no choice. If you back away now,\r\n           she'll never get to see the rest of your\r\n           annoying personality traits.\r\n                         \r\n<b>                          MAX\r\n</b>           You're right. I can't deprive her of\r\n           that.\r\n                         \r\n<b>          37 INT. THE PUB -- JULIE'S TABLE 37\r\n</b>                         \r\n           Julie is with ANDY and MARK. Andy is your basic hippie,\r\n           resplendent in a ridiculous green shag jacket. Mark has a cap\r\n           and is wearing a J Crew long-sleeve shirt over a Dave\r\n           Matthews Band t-shirt.\r\n                         \r\n           Max approaches.\r\n                         \r\n<b>                          JULIE\r\n</b>           Max! What's going on?\r\n                         \r\n<b>                          MAX\r\n</b>           Hey.\r\n                         \r\n<b>                          JULIE\r\n</b>           Do you guys know Max? This is Mark...\r\n                         \r\n<b>                          MARK\r\n</b>           Wassup.\r\n                         \r\n<b>                          JULIE\r\n</b>           ...And Andy.\r\n                         \r\n<b>                          ANDY\r\n</b>           Hey Max, how's it hanging, bud?\r\n                         \r\n<b>                          MAX\r\n</b>           Fine. I, uh, really like your jacket. Is\r\n           that real carpet?\r\n                         \r\n<b>                          ANDY\r\n</b>           Yeah, man. I couldn't believe my luck\r\n           when I saw it. This shade of shag is,\r\n           like, so rare. I was like, woah...\r\n                         \r\n<b>                          MARK\r\n</b>           Hey, are we gonna burn this or what?\r\n                         \r\n<b>                          ANDY\r\n</b>           Yeah, man. Hey, you guys are like all\r\n           invited, if you can handle some kind bud...\r\n           \"Maui wowey,\" you know?\r\n<b>           47.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Aloha?\r\n                         \r\n<b>          38 INT. ANDY'S APARTMENT ­ A LITTLE LATER 38\r\n</b>                         \r\n           Mark, Julie, and Max sit around a wooden table in a small\r\n           apartment's kitchen. Andy puts on a CD.\r\n                         \r\n<b>                          ANDY\r\n</b>           Hey man, you like Zappa?\r\n                         \r\n<b>                          MAX\r\n</b>           Dweezil or Moon Unit?\r\n                         \r\n<b>                          ANDY\r\n</b>           Frank.\r\n           (then gets it, laughs)\r\n           Man, that isn't even funny. You should\r\n           check out \"Apostrophe\" some time.\r\n                         \r\n<b>                          MAX\r\n</b>           \"Apostrophe\"?\r\n                         \r\n<b>                          MARK\r\n</b>           It's an album.\r\n                         \r\n<b>                          MAX\r\n</b>           I thought he was correcting my grammar.\r\n                         \r\n<b>                          MARK\r\n</b>           Can I get anyone beers? Julie?\r\n                         \r\n<b>                          JULIE\r\n</b>           Sure.\r\n                         \r\n<b>                          ANDY\r\n</b>           You know it.\r\n                         \r\n<b>                          MAX\r\n</b>           Okay.\r\n                         \r\n           Mark distributes beers to everyone but Max.\r\n                         \r\n<b>                          MARK\r\n</b>           Sorry, Max, we don't have enough.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, yeah, sure.\r\n                         \r\n<b>                          JULIE\r\n</b>           You want mine?\r\n<b>           48.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           No thanks. I'm kinda picky about beer.\r\n           I'm more into stuff like Guinness, Bass,\r\n           Killians.\r\n                         \r\n<b>                          MARK\r\n</b><b>                          (DISDAINFUL)\r\n</b>           That's so... British.\r\n                         \r\n<b>                          MAX\r\n</b>           It's a coincidence, I swear.\r\n                         \r\n          Julie has trouble opening her beer. Mark rushes over with his\r\n          keychain.\r\n                         \r\n<b>                          MARK\r\n</b>           I thought Guinness was going to be cool,\r\n           but it sucks. Made me nauseous.\r\n                         \r\n<b>                          ANDY\r\n</b>           Dude, puking blows. That's why I smoke\r\n           weed. You get high right away and no\r\n           hangover!\r\n                         \r\n          Andy pulls out a baggie of marijuana, and rummages through\r\n          the closet.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, I don't know. Giving me pot is like\r\n           letting Richard Simmons smoke crack. I'm\r\n           paranoid enough as it is.\r\n                         \r\n<b>                          MARK\r\n</b>           Yeah, well, some people just can't handle\r\n           their bud.\r\n                         \r\n          Mark glares disparagingly at him while Max pretends to\r\n          examine the ceiling. Julie pulls out cigarettes, lights up.\r\n                         \r\n<b>                          JULIE\r\n</b>           Andy, what are you looking for?\r\n                         \r\n          Andy finds it: a gigantic bong made from a vacuum cleaner. He\r\n          sets it up on the counter.\r\n                         \r\n<b>                          MAX\r\n</b>           Wow. I bet you could use that for yard\r\n           work.\r\n                         \r\n<b>                          ANDY\r\n</b>           Julie, you don't smoke either, right?\r\n                         \r\n<b>                          MARK\r\n</b>           Really?\r\n<b>           49.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>          Yeah. I used to, but when it became my\r\n          social life I knew I needed to stop.\r\n                         \r\n<b>                          MAX\r\n</b>          Kind of like why I stopped playing\r\n          Dungeons and Dragons. It was, uh, in\r\n          sixth grade, but it was kind of similar.\r\n                         \r\n<b>                          MARK\r\n</b>          Why don't we go smoke in the living room?\r\n                         \r\n<b>                          ANDY\r\n</b>          Oh, Ampersand's crashing on the couch\r\n          tonight.\r\n                         \r\n<b>                          MAX\r\n</b>          \"Ampersand\"? What kind of name is that,\r\n          Esperanto?\r\n                         \r\n<b>                          ANDY\r\n</b>          Well, his name was Mike, but he couldn't\r\n          cope. He thought it was, like, too\r\n          square. He wanted a name that would tell\r\n          people, here is a person that only the\r\n          brave will understand! Here is a person\r\n          living beyond the walls!\r\n                         \r\n<b>                          MAX\r\n</b>          He must have been listening to\r\n          \"Apostrophe\" at the time.\r\n                         \r\n<b>                          ANDY\r\n</b>          Or Prince, cuz, like, Prince's name was a\r\n          squiggly-thing. But Mike wanted something\r\n          powerful, meaningful, and above all,\r\n          something you could type. Therefore,\r\n          \"Ampersand.\" It's already on the keyboard\r\n          and everything.\r\n                         \r\n<b>                          MAX\r\n</b>          How much did that cost? Because I have a\r\n          friend who wants to change his name to\r\n          Not Bill.\r\n                         \r\n<b>                          JULIE\r\n</b>          Is his name Bill?\r\n                         \r\n<b>                          MAX\r\n</b>          No, Not Bill.\r\n                         \r\n<b>                          JULIE\r\n</b>          What about originally?\r\n<b>           50.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Originally he wanted to change it to\r\n           something else.\r\n                         \r\n          Mark steps forward and pushes up a sleeve.\r\n                         \r\n<b>                          MARK\r\n</b>           Hey Julie, check out my new tattoo.\r\n                         \r\n          He's got an anchor on his right biceps. Max snickers.\r\n                         \r\n<b>                          JULIE\r\n</b>           Gee, Mark, that's really cool.\r\n                         \r\n<b>                          MARK\r\n</b>           I know it's not what you suggested, but I\r\n           needed something more... masculine.\r\n                         \r\n          Max quietly whistles \"Popeye the Sailor Man.\"\r\n                         \r\n<b>                          MARK (CONT'D)\r\n</b>           You think you're pretty funny, huh?\r\n                         \r\n<b>                          MAX\r\n</b>           C'mon, I thought hippies were mellow.\r\n                         \r\n<b>                          MARK\r\n</b>           You just call me a hippie?\r\n                         \r\n<b>                          MAX\r\n</b>           Sorry, Popeye, I guess I was thrown by\r\n           the Dave Matthews merchandise.\r\n                         \r\n<b>                          MARK\r\n</b>           I'm in a frat, geek.\r\n                         \r\n<b>                          MAX\r\n</b>           Well shouldn't you be back there date-\r\n           raping someone?\r\n                         \r\n<b>                          MARK\r\n</b>           Julie, where did you find this creep?\r\n                         \r\n          Max and Mark both look to Julie-- she must pick a side.\r\n          She pulls on her cigarette, then turns to Mark.\r\n                         \r\n<b>                          JULIE\r\n</b>           Mark, lay off. Go take a hit off the\r\n           Hoover and mellow out.\r\n           (turning to Max)\r\n           Max, I'm sorry.\r\n                         \r\n<b>                          MAX\r\n</b>           Hey, it's okay. I'm cool.\r\n<b>           51.\r\n</b>                         \r\n                         \r\n                         \r\n           He takes a beer from the table, fumbles, and drops it.\r\n                         \r\n<b>                          JULIE\r\n</b>           Nah, it's time. It's getting late anyway.\r\n                         \r\n           She puts out her cigarette and grabs her coat.\r\n                         \r\n<b>          39 EXT. JULIE'S DORM ­ NIGHT 39\r\n</b>                         \r\n           Max and Julie approach Shelly Hall.\r\n                         \r\n<b>                          MAX\r\n</b>           So you live here, huh? Does it bother you\r\n           to be in an all-female dorm?\r\n                         \r\n<b>                          JULIE\r\n</b>           No, well, a little, sure. But there are\r\n           always men around. During fire drills,\r\n           more guys come out than girls. Never the\r\n           same ones either. They come and go.\r\n                         \r\n<b>                          MAX\r\n</b>           I bet they do.\r\n                         \r\n           Julie catches herself and laughs. Max shares a smile with her\r\n           in the doorway.\r\n                         \r\n<b>                          JULIE\r\n</b>           I had a good time tonight, but next time,\r\n           let's have some real fun.\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, fine, uh, next time I'll bring Jack\r\n           Nicholson and a case of Schnapps.\r\n                         \r\n<b>                          JULIE\r\n</b>           Good night, Max.\r\n                         \r\n           Julie enters the dorm. Max watches her through the glass.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"WEDNESDAY\"\r\n                         \r\n<b>           MATCH DISSOLVE TO:\r\n</b>                         \r\n           CLOSE UP of a schedule's column heading: \"Wednesday\"\r\n                         \r\n<b>           PULL BACK TO REVEAL:\r\n</b><b>           52.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          40 INT. HALLWAY OUTSIDE THE RADIO STATION ­ DAY 40\r\n</b>                         \r\n           Max reads the schedule on the door. His watch says 11am; he\r\n           finds Wednesday 11am: \"Julio's Death Metal Jamboree.\" He\r\n           peeks behind the door-- the station is empty.\r\n                         \r\n           He starts to slip inside when...\r\n                         \r\n<b>           BETH (O.S.)\r\n</b>           Max!\r\n                         \r\n           He whirls, closing the door guiltily. Beth comes down the\r\n           hall, laden with books.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, hi...\r\n                         \r\n<b>                          BETH\r\n</b>           It was great running into your friends,\r\n           but... you know... I feel bad about what I\r\n           said. Do you want to get together later?\r\n                         \r\n<b>                          MAX\r\n</b>           I don't know, I'm sure I have something\r\n           to do that I've forgotten.\r\n                         \r\n<b>                          BETH\r\n</b>           Come on, it's bad enough we fell out of\r\n           touch, but we can't even have lunch?\r\n                         \r\n<b>                          MAX\r\n</b>           We had breakfast.\r\n                         \r\n<b>                          BETH\r\n</b>           Every time we try to do anything, you\r\n           have an excuse, or forget to show up, or\r\n           you cancel.\r\n                         \r\n<b>                          MAX\r\n</b>           You cancel on me, too.\r\n                         \r\n<b>                          BETH\r\n</b>           I'm sorry. Things have been a little, you\r\n           know, awkward.\r\n                         \r\n<b>                          MAX\r\n</b>           Look, the whole thing was my fault. Let's\r\n           drop it, okay?\r\n                         \r\n           Beth throws up her hands, turns away.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Okay, lunch, you win.\r\n<b>           53.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          BETH\r\n</b>           Now you're only going because I gave you\r\n           a hard time.\r\n                         \r\n<b>                          MAX\r\n</b>           Guilt is a powerful force. Just be glad\r\n           it's on our side for once.\r\n                         \r\n<b>                          BETH\r\n</b>           Okay, how is the Kidney Bean at noon?\r\n                         \r\n<b>                          MAX\r\n</b>           Awful, just like every other time of day.\r\n           Their food is just birdseed prepared\r\n           fancy.\r\n                         \r\n<b>                          BETH\r\n</b>           The Fabulous Diner, then. Friday at noon?\r\n                         \r\n<b>                          MAX\r\n</b>           Fine.\r\n                         \r\n           She leaves. Max finds his old slot on the schedule and\r\n           crosses it out. Then he slips into the station.\r\n                         \r\n<b>          41 EXT. CVS 41\r\n</b>                         \r\n           A shitbox pulls up. Sam drives, Max rides shotgun. Scott and\r\n           Amanda are in back.\r\n                         \r\n<b>                          AMANDA\r\n</b>           And then I got to thinking, you know, I\r\n           really think I like vanilla.\r\n                         \r\n           Sam turns off the car.\r\n                         \r\n<b>                          SAM\r\n</b>           I'll be right back.\r\n                         \r\n<b>                          MAX\r\n</b>           Me too.\r\n                         \r\n           They get out and go into the store.\r\n                         \r\n<b>          42 INT. CVS 42\r\n</b>                         \r\n           They enter an aisle and Sam grabs various items as he talks.\r\n                         \r\n<b>                          SAM\r\n</b>           Jen called yesterday, while we were at\r\n           the bar.\r\n                         \r\n<b>                          MAX\r\n</b>           You call her back?\r\n<b>           54.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SAM\r\n</b>           Yeah. I went over there to talk again\r\n           today. She's taking it hard.\r\n                         \r\n<b>                          MAX\r\n</b>           Imagine that.\r\n                         \r\n<b>                          SAM\r\n</b>           We're having dinner tonight. Wanna come?\r\n                         \r\n<b>                          MAX\r\n</b>           Don't put me in the middle of this. Are\r\n           you definitely broken up? Because it\r\n           seems a little up in the air.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah, we're definitely broken up. I guess\r\n           sometimes it seems like we're sliding\r\n           back into our old patterns.\r\n                         \r\n          He takes some Vaseline from a shelf. Max looks horrified.\r\n                         \r\n<b>                          SAM (CONT'D)\r\n</b>           It's not what you think. I need a\r\n           petroleum jelly for the polymers class\r\n           I'm TA-ing.\r\n                         \r\n          Suddenly a rack of condoms catches his eye. Max sees it too.\r\n                         \r\n<b>                          MAX\r\n</b>           Don't even think of it.\r\n                         \r\n<b>                          SAM\r\n</b>           What-the-heck.\r\n                         \r\n          He takes a box. His arms are totally full now.\r\n                         \r\n<b>                          SAM (CONT'D)\r\n</b>           I need a basket. Hold this.\r\n                         \r\n          He dumps his pile of stuff into Max's arms, the Vaseline and\r\n          condoms on top, and disappears around a corner. Max sighs,\r\n          turns around... and bumps into Julie.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hello... Big night?\r\n                         \r\n<b>                          MAX\r\n</b>           Um, it's for a friend.\r\n                         \r\n<b>                          JULIE\r\n</b>           I would hope so.\r\n<b>           55.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           No, seriously, I just got a job at a\r\n           petting zoo.\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (LAUGHING)\r\n</b>           Oh, of course.\r\n                         \r\n<b>                          MAX\r\n</b>           And the best part is, it's work study. I\r\n           think the Psych. department's involved.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hey, that's my new major. I got so sick\r\n           of Soc.\r\n                         \r\n<b>                          MAX\r\n</b>           So, uh, got any plans tonight?\r\n                         \r\n<b>                          JULIE\r\n</b>           Well, there's a great local band playing\r\n           the Pub. You should come.\r\n                         \r\n<b>                          MAX\r\n</b>           Um, sure. Might be cool to catch a band\r\n           before success ruins them.\r\n                         \r\n<b>                          JULIE\r\n</b>           Great. I'll see you there.\r\n                         \r\n          She leaves with a wave. Sam turns the other corner.\r\n                         \r\n<b>                          SAM\r\n</b>           No baskets.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't believe what you just did to me!\r\n                         \r\n<b>                          SAM\r\n</b>           What?\r\n                         \r\n<b>                          MAX\r\n</b>           Julie was just here!\r\n                         \r\n<b>                          SAM\r\n</b>           Who's Julie?\r\n                         \r\n          Suddenly, Scott arrives.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Hi. I need socks.\r\n<b>           56.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           What were you doing sitting in the car\r\n           then?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Nothing.\r\n                         \r\n<b>          43 EXT. CVS ­ FLASHBACK 43\r\n</b>                         \r\n           The car pulls up.\r\n                         \r\n<b>                          SAM\r\n</b>           I'll be right back.\r\n                         \r\n<b>                          MAX\r\n</b>           Me too.\r\n                         \r\n           They leave.\r\n                         \r\n           Amanda and Scott are alone in the back. Amanda looks tense.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Scott, can I ask you something?\r\n                         \r\n<b>                          SCOTT\r\n</b>           Okay.\r\n                         \r\n<b>                          AMANDA\r\n</b>           It's just that, sometimes, you're really\r\n           cool and other times you act like I'm not\r\n           even here. Or like you don't want me\r\n           around.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Yeah.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Well, I was wondering if... never mind.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Okay.\r\n                         \r\n           A moment passes.\r\n                         \r\n<b>                          AMANDA\r\n</b>           All right, look, I'm just going to come\r\n           right out with it. I think I like you. I\r\n           think I, I really like you.\r\n                         \r\n<b>                          SCOTT\r\n</b>           I know.\r\n                         \r\n           As she opens her mouth, Scott opens the car door and exits.\r\n<b>           57.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          44 INT. CVS ­ PRESENT 44\r\n</b>                         \r\n<b>                          SCOTT\r\n</b>           So where are the socks?\r\n                         \r\n<b>          45 INT. PUB ­ THAT NIGHT 45\r\n</b>                         \r\n           An absurd metal band plays on-stage. The room is packed, and\r\n           the crowd is mostly one big mosh pit.\r\n                         \r\n           Max wades through the slamdancers, freaked. He makes it to\r\n           the coffee bar. Julie soon appears, sweaty. She's been here\r\n           awhile.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hey!\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, hey! It's good to see you.\r\n                         \r\n           The surging crowd shoves Max into Julie. They fall against\r\n           each other. Max is near panic but Julie's laughing, getting\r\n           off on the energy of the room.\r\n                         \r\n           The SINGER smashes the mic against the wall, then brandishes\r\n           the stand menacingly at the crowd, who step back in alarm.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Who are these guys?\r\n                         \r\n<b>                          JULIE\r\n</b>           They're Anhedonia. They're \"sludge-core.\"\r\n                         \r\n<b>                          SINGER\r\n</b>           You're all a part of the conspiracy!\r\n           You're all human! Every one of you wore\r\n           diapers! You're all full of shit!\r\n                         \r\n           The singer storms off. The band follows. The crowd applauds\r\n           with some confusion. Julie whistles loudly and claps.\r\n                         \r\n<b>                          JULIE\r\n</b>           That's their trademark. They insult the\r\n           crowd at the end of the set. Sometimes he\r\n           breaks the mike two songs in. We were\r\n           lucky: they played for almost 40 minutes.\r\n                         \r\n<b>                          MAX\r\n</b>           Luck had nothing to do with it.\r\n<b>           58.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Look, the mike's not even broken. They\r\n           were just tired of playing, but they\r\n           wanted to give us something to remember.\r\n           Now that's showmanship.\r\n                         \r\n<b>                          MAX\r\n</b>           You have to wonder about any band whose\r\n           highlight is their exit.\r\n                         \r\n<b>                          JULIE\r\n</b>           It worked for The Who.\r\n                         \r\n<b>                          MAX\r\n</b>           I'm sorry, the who?\r\n                         \r\n<b>                          JULIE\r\n</b>           Ha ha. Come on, is that the kind of a\r\n           joke a celebrity DJ would make?\r\n                         \r\n<b>                          MAX\r\n</b>           I still can't believe you tuned in. It's\r\n           like an invasion of privacy.\r\n                         \r\n<b>                          JULIE\r\n</b>           You're a riot. Let's get out of here.\r\n                         \r\n           She pulls him away.\r\n                         \r\n<b>          46 INT. STUDY LOUNGE ­ UNIVERSITY CENTER ­ MINUTES LATER 46\r\n</b>                         \r\n           The lounge is empty. Julie sits on a couch. Max sits next to\r\n           her, but seems uptight about getting too close.\r\n                         \r\n<b>                          MAX\r\n</b>           So, uh, I'm sorry about that thing with,\r\n           uh, Chip was it?\r\n                         \r\n<b>                          JULIE\r\n</b>           Oh, Mark. He's been following me around\r\n           for years. He's easily threatened.\r\n                         \r\n<b>                          MAX\r\n</b>           He's lucky, I, uh, almost pulled a Jackie\r\n           Chan on his ass, but, you know, my kung-\r\n           fu's gotten rusty since I left the Hong\r\n           Kong military.\r\n                         \r\n<b>                          JULIE\r\n</b>           Don't worry about him, he isn't a threat.\r\n           You're far more interesting.\r\n<b>           59.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Right. Asking me not to worry is like\r\n           asking a bear to use toilet paper.\r\n           There's this joke that sums it up for me...\r\n                         \r\n          Julie leans in and looks at him with intensity.\r\n                         \r\n<b>                          JULIE\r\n</b>           You're not fooling me, you know. I can\r\n           see right through this aloof image.\r\n                         \r\n<b>                          MAX\r\n</b>           What?\r\n                         \r\n<b>                          JULIE\r\n</b>           It's not an insult. I get the sense that\r\n           there's this whole other side of your\r\n           personality.\r\n                         \r\n<b>                          MAX\r\n</b>           I hope he's a better dancer.\r\n                         \r\n<b>                          JULIE\r\n</b>           See, this is the side you show, playing\r\n           everything off as a joke whenever things\r\n           gets serious. But there's more to you.\r\n                         \r\n<b>                          MAX\r\n</b>           Did I ever tell you about the bear and\r\n           the rabbit in the woods--?\r\n                         \r\n<b>                          JULIE\r\n</b>           Quick. Now. Tell me something about\r\n           yourself, something I never would have\r\n           guessed. And don't even try to come up\r\n           with some witty retort.\r\n                         \r\n          Max, agape, is on the spot, helpless. Julie grabs her coat.\r\n                         \r\n<b>                          JULIE (CONT'D)\r\n</b>           I should get going.\r\n                         \r\n          She stands.\r\n                         \r\n<b>                          MAX\r\n</b>           Wait.\r\n                         \r\n          She sits.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Okay. Okay.\r\n           (a deep breath)\r\n           We barely know each other, but you're all\r\n           I think about.\r\n<b>           60.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           (off-balance, covering)\r\n          I said something I never would have\r\n          guessed.\r\n                         \r\n<b>                          MAX\r\n</b>          Oh, thanks. I bare my soul and now you're\r\n          the funny one.\r\n                         \r\n<b>                          JULIE\r\n</b>          Sorry. That wasn't quite what I was\r\n          looking for.\r\n                         \r\n<b>                          MAX\r\n</b>          Now it's your turn, right?\r\n                         \r\n<b>                          JULIE\r\n</b>          Let's see. Okay, here's one: I have a\r\n          boyfriend.\r\n                         \r\n<b>                          MAX\r\n</b>          Fuck. I sure hadn't guessed that.\r\n                         \r\n<b>                          JULIE\r\n</b>          Okay, well, not anymore. Eric and I were\r\n          together in high school, but we broke up\r\n          over break.\r\n                         \r\n<b>                          MAX\r\n</b>          Since high school, wow.\r\n                         \r\n<b>                          JULIE\r\n</b>          Yeah. He's kind of a jerk. It was all a\r\n          waste of time. Sometimes I, I, I don't\r\n          know, Max, why don't you have a\r\n          girlfriend?\r\n                         \r\n<b>                          MAX\r\n</b>           (on the spot)\r\n          Uh, I have a friend who says it's because\r\n          I watch Annie Hall too much.\r\n                         \r\n<b>                          JULIE\r\n</b>          That's crazy.\r\n                         \r\n<b>                          MAX\r\n</b>          Exactly. That film practically raised me.\r\n                         \r\n<b>                          JULIE\r\n</b>          And it has a very positive message, too.\r\n          I wish more guys were into it.\r\n                         \r\n<b>                          MAX\r\n</b>          Be careful what you wish for.\r\n<b>           61.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           You don't know what I'm wishing for.\r\n                         \r\n<b>                          MAX\r\n</b>           Snowtires?\r\n                         \r\n<b>                          JULIE\r\n</b>           Max, there are a lot of girls that would\r\n           go for a guy like you.\r\n                         \r\n<b>                          MAX\r\n</b>           Know any?\r\n                         \r\n<b>                          JULIE\r\n</b>           This is one of those moments, in a movie,\r\n           when a character has a chance to say\r\n           something, and of course they do, and\r\n           it's perfect, and it becomes a movie\r\n           moment.\r\n                         \r\n           Julie starts to lean in. Suddenly, the BUILDING MANAGER walks\r\n           in. He's a dead ringer for Woody Allen. Max starts violently.\r\n                         \r\n<b>                          MANAGER\r\n</b>           Building's closing. Everyone out.\r\n                         \r\n           He exits. Max is beside himself. Julie sees that the moment's\r\n           over and gets up.\r\n                         \r\n<b>                          JULIE\r\n</b>           Are you hungry at all?\r\n                         \r\n<b>                          MAX\r\n</b>           Sure. I know this place. Their food is\r\n           bad, but they compensate by being\r\n           overpriced.\r\n                         \r\n<b>                          JULIE\r\n</b>           Sounds perfect.\r\n                         \r\n           They walk out.\r\n                         \r\n<b>                          MAX\r\n</b>           Say, did that guy look like...?\r\n                         \r\n<b>                          JULIE\r\n</b>           Ernest Borgnine? Yeah, I noticed that\r\n           too.\r\n                         \r\n<b>          47 INT. JULIE'S CAR -- NIGHT 47\r\n</b>                         \r\n           Max is relaxed and chatting while Julie drives.\r\n<b>           62.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           I've been able to do it since high\r\n           school.\r\n                         \r\n<b>                          JULIE\r\n</b>           That's a scary gift. I mean, even if\r\n           people are destined to break up, the will\r\n           to stay together is very powerful.\r\n                         \r\n<b>                          MAX\r\n</b>           That's the real tragedy. Look at all the\r\n           unhappy couples in the world.\r\n                         \r\n<b>                          JULIE\r\n</b>           I don't know if your gift is really that\r\n           special, Max. I mean, we break up with\r\n           everyone we ever date... Until the one we\r\n           stay with forever.\r\n                         \r\n<b>                          MAX\r\n</b>           See how ridiculous dating is?\r\n                         \r\n<b>                          JULIE\r\n</b>           How did you get this attitude if you love\r\n           Annie Hall?\r\n                         \r\n<b>                          MAX\r\n</b>           What do you mean? That's what Annie's all\r\n           about.\r\n                         \r\n          Julie looks dubious. Max flicks on the radio.\r\n                         \r\n<b>                          DJ\r\n</b>           ...\"college radio for the masses,\" and\r\n           that's it for me.\r\n           (sound of CDs falling)\r\n           Whoops! Anyway, next up is Verbal\r\n           Diarrhea, with Todd Duke.\r\n                         \r\n<b>                          MAX\r\n</b>           Why is your radio set to the campus\r\n           station?\r\n                         \r\n<b>                          JULIE\r\n</b>           Actually, it's stuck on it. It's how I\r\n           first heard your show.\r\n                         \r\n<b>                          MAX\r\n</b>           I thought Beth told you about me.\r\n                         \r\n<b>                          JULIE\r\n</b>           It doesn't matter, Max. Now that I've met\r\n           you, your show's not important.\r\n<b>           63.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          48 INT. PRETENTIOUS CAFE ­ A LITTLE LATER 48\r\n</b>                         \r\n           The kind of place that's perfect for Parents Weekend. At this\r\n           late hour, it is filled with young professionals. There's a\r\n           dance floor, where couples dance to the standards. Max and\r\n           Julie are at a table in the corner, looking out of place.\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (SMIRKING)\r\n</b>           This is a nice place. Ritzy. Interesting\r\n           mix of people here, you've got these men\r\n           with their suits, taking their waitress\r\n           girlfriends out to impress them into bed,\r\n           because they can't get them any other\r\n           way. Really, as if a fast car can ever\r\n           make up for a small dick.\r\n                         \r\n<b>                          MAX\r\n</b>           If it did, do you think I'd be here? I'd\r\n           be down at the Porsche dealer with a ski\r\n           mask and an Uzi.\r\n                         \r\n<b>                          JULIE\r\n</b>           Guys, always obsessed with dick size.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, sure, there's that, but it would\r\n           also be nice to have a car with a heater.\r\n                         \r\n<b>                          JULIE\r\n</b>           Let's guess which couples are destined to\r\n           break up. How about them?\r\n                         \r\n           Indicates a COUPLE dancing.\r\n                         \r\n<b>                          MAX\r\n</b>           No, I can't tell just by looking. I need\r\n           some info.\r\n                         \r\n           Their waitress, DONNA, arrives.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hi! Do you have a boyfriend?\r\n                         \r\n           Max is aghast. Donna stares a beat.\r\n                         \r\n<b>                          DONNA\r\n</b>           Yeah.\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (TO MAX)\r\n</b>           What do you need to know?\r\n<b>           64.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Uh, just a description.\r\n                         \r\n<b>                          JULIE\r\n</b>           Describe him for us. It's okay, I'm a\r\n           psyche major.\r\n                         \r\n<b>                          DONNA\r\n</b>           Well, he's tall... ish. Brown hair. Funny.\r\n           Very friendly. Fixes cars. Close with his\r\n           brother. Uh, what else? Believes in God.\r\n           Has a sweet tooth. Uh...\r\n                         \r\n<b>                          MAX\r\n</b>           That's plenty.\r\n                         \r\n<b>                          DONNA\r\n</b>           So can I take your order?\r\n                         \r\n<b>                          JULIE\r\n</b>           We're not ready, thanks.\r\n                         \r\n          Donna puts her pad away.\r\n                         \r\n<b>                          DONNA\r\n</b>           So what was that all about then?\r\n                         \r\n<b>                          JULIE\r\n</b>           Max here thinks you're going to break up\r\n           with your boyfriend.\r\n                         \r\n<b>                          DONNA\r\n</b>           What?\r\n                         \r\n<b>                          MAX\r\n</b>           Sorry. It's all in there. You qualified\r\n           \"tall\" so as not to make him appear too\r\n           handsome, said \"friendly\" like a\r\n           euphemism, chose \"fixes cars\" instead of\r\n           the more dignified \"auto mechanic,\" and\r\n           finally, mentioned his brother á propos\r\n           of nothing, like you're threatened by\r\n           him.\r\n                         \r\n          The waitress looks like she's been slapped. After a pause,\r\n          she turns her back and walks away.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hey! Don't shoot the messenger!\r\n                         \r\n<b>                          MAX\r\n</b>           I'm such an idiot. She's going to shit in\r\n           our food now. I can't believe you asked\r\n           her that.\r\n<b>           65.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Hey, we're all people here, right? If you\r\n           want to talk to someone, talk to them. I\r\n           don't spend my time trying to justify\r\n           talking to people or whatever. You limit\r\n           yourself if you do that. If you spend too\r\n           much time worrying, you don't spend\r\n           enough time living, right?\r\n                         \r\n<b>                          MAX\r\n</b>           What are you, a fortune cookie?\r\n                         \r\n<b>                          JULIE\r\n</b>           You have to keep yourself open to\r\n           possibilities in life. I'm the first one\r\n           in my family to go to college. Sometimes\r\n           I can't believe I'm here, at a semi-\r\n           prestigious university getting a halfway-\r\n           decent education-- this has always been\r\n           my dream. How did you end up here?\r\n                         \r\n<b>                          MAX\r\n</b>           I had a coupon.\r\n                         \r\n<b>                          JULIE\r\n</b>           I know what you mean, financial aid is a\r\n           bitch. And the university experience\r\n           itself is kind of disappointing. All\r\n           those rich students with no idea how\r\n           lucky they are. But I don't think about\r\n           them. I think about me, I think about\r\n           where I want to be someday: a world\r\n           traveler, running some huge company, or,\r\n           you know, doing some fantastically\r\n           important work. And when the day comes\r\n           that I can relax, I'm going to charter a\r\n           boat, sail around the world, and see the\r\n           Seven Wonders.\r\n                         \r\n<b>                          MAX\r\n</b>           I thought they broke up when Stevie left.\r\n                         \r\n<b>                          JULIE\r\n</b>           Come on, aren't you curious about the\r\n           world? Doesn't the sheer scope of life\r\n           fill you with wonder?\r\n                         \r\n<b>                          MAX\r\n</b>           Wonder, horror, it's such a fine line...\r\n                         \r\n<b>                          JULIE\r\n</b>           Ah, Max...\r\n                         \r\n          But she's smiling at him, and he can't help but return it.\r\n<b>           66.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          49 INT. COMMON ROOM -- NIGHT 49\r\n</b>                         \r\n           Tommy sleeps while the TV proclaims golf products. Max comes\r\n           in and quietly shuts it off. Tommy gurgles and rolls over.\r\n                         \r\n<b>                          TOMMY\r\n</b>           ...swallowed a bug...\r\n                         \r\n           Max goes to his room. Sam's bed is empty. He shakes his head,\r\n           picks up a key from his desk, and leaves.\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n<b>          50 INT. LIMBO RADIO 50\r\n</b>                         \r\n           Max sits on a stool, as in the beginning, but this time we\r\n           are PUSHING IN...\r\n                         \r\n<b>                          MAX\r\n</b>           Sometimes I look around and wonder where\r\n           the hell my friends came from.\r\n                         \r\n<b>          51 INT. COMMON ROOM -- FLASHBACK 51\r\n</b>                         \r\n           Tommy and Sam are in each other's faces, yelling. Tommy waves\r\n           a book and Sam waves a newspaper.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           Like, the other night Tommy and Sam\r\n           nearly got into a fistfight over whether\r\n           the X-Files is based on a true story.\r\n                         \r\n<b>          52 INT. BATHROOM -- FLASHBACK 52\r\n</b>                         \r\n           Charles makes out with a GIRL in a stall covered in colored\r\n           paper. She has a cigarette on a black holding stem, which\r\n           brushes the paper.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           Before that, Scott covered the entire\r\n           bathroom in multi-colored post-it notes,\r\n           which Charles somehow set on fire, nearly\r\n           getting us kicked out of housing.\r\n                         \r\n<b>          53 INT. COMMON ROOM -- FLASHBACK 53\r\n</b>                         \r\n           Max, Sam, Scott, and Tommy are there, reading fanclub\r\n           newsletters: X-philes, Font-ain of Youth, Men Are From Mars\r\n           Women From Venus. Charles walks in, arm in arm with a woman\r\n           who is obviously a PROFESSOR, and escorts her to his room.\r\n                         \r\n<b>           MAX (V.O.)\r\n</b>           They're great friends. I feel safer among\r\n           them than among my own family.\r\n<b>                          [MORE]\r\n</b><b>           67.\r\n</b>                         \r\n           MAX (V.O.) (cont'd)\r\n           They always know what not to say, how not\r\n           to make things uncomfortable.\r\n                         \r\n           After a beat, the group resumes reading like nothing\r\n           happened... except Max, who can't believe what he just saw.\r\n                         \r\n<b>          54 INT. RADIO STATION (LIMBO) 54\r\n</b>                         \r\n           Max in CLOSE-UP. Over his shoulder, images of Beth arguing\r\n           with him from various moments in their history.\r\n                         \r\n<b>                          MAX\r\n</b>           Even when Beth was part of the group, she\r\n           didn't fit in. Like, she never just lets\r\n           things be. She always has to know exactly\r\n           what I'm thinking. It was sort of cute\r\n           when we were friends, but now it's like a\r\n           proctology exam.\r\n<b>                          (SIGHS)\r\n</b>           Hard to imagine a friendship going more\r\n           wrong.\r\n                         \r\n           The image of Beth STOPS on a shot of her looking at him with\r\n           undisguised disappointment. She DISSOLVES into a image of\r\n           Julie, beaming.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Ah, but Julie. Juliejuliejulie. She's\r\n           smart, she's funny, isn't constantly\r\n           hassling me. How she can stay such a\r\n           dreamer is beyond me... Hey, I wonder if\r\n           she's listening now.\r\n                         \r\n           The thought stops him cold. The image over his shoulder\r\n           VANISHES, replaced with a plain cement wall.\r\n                         \r\n<b>          55 INT. RADIO STATION 55\r\n</b>                         \r\n           We ZOOM OUT fast. Max is back in reality, the station crowded\r\n           and claustrophobic. He tries to regroup.\r\n                         \r\n<b>                          MAX\r\n</b>           (taps the mike)\r\n           Hello? Uh, Julie...?\r\n           (clears his throat)\r\n           So, uh, as I was saying... Um. My friends.\r\n           Yeah. My friends are weird. Shit.\r\n<b>                          (LONG PAUSE)\r\n</b>           I think it's time for some music.\r\n                         \r\n           He grabs for a CD.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"THURSDAY\"\r\n<b>           68.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          56 INT. U.C. GENERAL STORE 56\r\n</b>                         \r\n           Max and Charles stir their coffee.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Fuckin' hate this flavored shit. Anyway,\r\n           I can't believe the cat in the shag\r\n           jacket was Andy.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't want to talk about it.\r\n                         \r\n<b>                          CHARLES\r\n</b>           When I knew him as a freshman, he was pre-\r\n           law... Whew. Anyway, it sounds like things\r\n           are going well between you and Julie.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah. This is a real change of pace.\r\n           Staying away from Annie Hall is like some\r\n           kind of magic trick.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I was wondering about that. You seem\r\n           different lately.\r\n                         \r\n<b>                          MAX\r\n</b>           You know how when things are going badly,\r\n           there are certain parts I like to watch?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Like how you spent your whole sophomore\r\n           year watching that lobster scene on\r\n           repeat?\r\n                         \r\n<b>                          MAX\r\n</b>           I realized that I don't know what part to\r\n           watch when things are going well.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You know, I actually regret mentioning\r\n           that theory. In fact, Sam and I were\r\n           thinking of watching it tonight. You in?\r\n                         \r\n<b>                          MAX\r\n</b>           Are you on crack? I meet a girl I really\r\n           like, that I may actually have a chance\r\n           with, and you want me to put it all in\r\n           jeopardy?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Come on. Watching it without you would be\r\n           weird. Unnatural. That film is you, Max,\r\n           face it.\r\n<b>           69.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           But it's ruining my life.\r\n                         \r\n          Charles drinks his coffee and shakes his head.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Listen, Max. I have to tell you\r\n           something. I scored last night.\r\n                         \r\n<b>                          MAX\r\n</b>           See? The theory works for you, too.\r\n                         \r\n<b>                          CHARLES\r\n</b>           With Beth.\r\n                         \r\n          Max drops his coffee, thunderstruck.\r\n                         \r\n<b>                          MAX\r\n</b>           What?!\r\n                         \r\n<b>                          CHARLES\r\n</b>           It wasn't premeditated.\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (ANGRY)\r\n</b>           How could you sleep with Beth?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Look, nobody knows about it. It won't\r\n           happen again.\r\n                         \r\n<b>                          MAX\r\n</b>           Happen again? Of course not! That might\r\n           constitute a relationship!\r\n                         \r\n          Max is at a loss. The CASHIER looks over suspiciously.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I'm sorry, Max. I wasn't sure if you'd\r\n           care.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't care! Oh God, this is my fault!\r\n           If only I hadn't called her...\r\n                         \r\n<b>                          CHARLES\r\n</b>           What do you want me to say? I'm sorry,\r\n           man. Let me pay for your coffee.\r\n                         \r\n<b>                          MAX\r\n</b>           You've gotta be kidding.\r\n                         \r\n          He starts to leave.\r\n<b>           70.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Going back to the suite?\r\n                         \r\n<b>                          MAX\r\n</b>           I dunno where I'm going.\r\n                         \r\n<b>          57 EXT. CAMPUS THEATER ­ DAY 57\r\n</b>                         \r\n           Max, distressed, passes the campus theater, where someone is\r\n           tacking up a poster for Annie Hall. Max sees it and averts\r\n           his eyes.\r\n                         \r\n<b>          58 EXT. KIDNEY BEAN -- DAY 58\r\n</b>                         \r\n           He walks past the Kidney Bean. Something catches his eye\r\n           through the window. He changes direction and enters.\r\n                         \r\n<b>          59 INT. KIDNEY BEAN -- DAY 59\r\n</b>                         \r\n           Max sees Beth eating alone at a table, reading a Tom Robbins\r\n           book. He walks over. Beth isn't thrilled to see him.\r\n                         \r\n<b>                          BETH\r\n</b>           Max? What are you doing here? A sudden\r\n           craving for bird-seed?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah. I figured I'd had enough actual\r\n           food this week.\r\n                         \r\n<b>                          BETH\r\n</b>           Well, be careful, someone in the corner\r\n           is eating egg salad.\r\n                         \r\n           Max sits down across from her. After an awkward pause:\r\n                         \r\n<b>                          BETH (CONT'D)\r\n</b>           Are you okay?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, why?\r\n                         \r\n<b>                          BETH\r\n</b>           No reason. Something about you sounded\r\n           different.\r\n                         \r\n<b>                          MAX\r\n</b>           What? Now?\r\n                         \r\n<b>                          BETH\r\n</b>           No, actually, last night on the... Oh no,\r\n           he's here.\r\n<b>           71.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           But I just left him in the General Store...\r\n                         \r\n          But she isn't talking about Charles: she's looking across the\r\n          room at STEVE, a good-looking guy who is talking to a GIRL.\r\n                         \r\n<b>                          BETH\r\n</b>           Who is he with? He never calls me\r\n           anymore. I think he might be seeing\r\n           someone. Have you heard anything?\r\n                         \r\n<b>                          MAX\r\n</b>           I don't even know him. What's so special\r\n           about this guy, anyway? I mean, are you\r\n           and he...?\r\n                         \r\n<b>                          BETH\r\n</b>           Sort of. Well, no, I guess not.\r\n<b>                          (DISTRACTED)\r\n</b>           I know something's going on. I'm such a\r\n           fool. Why are we always attracted to\r\n           people that are completely wrong for us?\r\n           Is it because they excite us?\r\n                         \r\n<b>                          MAX\r\n</b>           I guess so. You know, we should try to be\r\n           more exciting. Like the other day, I\r\n           waited until the last minute before\r\n           returning a video. And next time, I swear\r\n           I'm not going to rewind.\r\n                         \r\n<b>                          BETH\r\n</b>           I can be a rebel too. The other day I\r\n           went to bed without flossing.\r\n                         \r\n<b>                          MAX\r\n</b>           Boy, are we pathetic.\r\n                         \r\n<b>                          BETH\r\n</b>           Okay, it's pathetic, but we're okay, you\r\n           know? But sometimes, I feel like...\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah. Me too.\r\n                         \r\n          She puts on her coat and gathers her things on her tray.\r\n                         \r\n<b>                          BETH\r\n</b>           I'm glad you're here, Max. I didn't\r\n           realize how much I missed you.\r\n<b>           72.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           I feel the same way about the Sex\r\n           Pistols. Missing them is far cooler than\r\n           having them around.\r\n                         \r\n<b>                          BETH\r\n</b>           That's not what I meant, Max.\r\n                         \r\n           She heads for the exit.\r\n                         \r\n<b>          60 INT. COMMON ROOM -- EVENING 60\r\n</b>                         \r\n           Sam looks dubiously at Max, who waves his arms and shouts.\r\n                         \r\n<b>                          MAX\r\n</b>           What do you mean, you saw Julie with\r\n           someone?\r\n                         \r\n<b>                          SAM\r\n</b>           Just that. Nothing more.\r\n                         \r\n<b>                          MAX\r\n</b>           So what are you saying?\r\n                         \r\n<b>                          SAM\r\n</b>           Nothing. They were having lunch.\r\n                         \r\n<b>                          MAX\r\n</b>           Who was he? What did he look like?\r\n                         \r\n<b>                          SAM\r\n</b>           You're over-reacting.\r\n                         \r\n<b>                          MAX\r\n</b>           How could she see someone else?\r\n                         \r\n<b>                          SAM\r\n</b>           You're not even dating!\r\n                         \r\n<b>                          MAX\r\n</b>           But we might be! I can't handle\r\n           competition, Sam, I'm not the competitive\r\n           type.\r\n                         \r\n<b>                          SAM\r\n</b>           It was just lunch in the cafeteria. He\r\n           looked completely normal.\r\n                         \r\n<b>                          MAX\r\n</b>           I can't compete with that!\r\n           (he fumbles with his coat)\r\n           Man, it's all gone so wrong, so fast.\r\n                         \r\n           He rushes out the door.\r\n<b>           73.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          61 INT. DORM HALLWAY ­ SHELLY HALL 61\r\n</b>                         \r\n           Max knocks on the door to Julie's suite. Nothing. He paces,\r\n           frustrated. Suddenly, JUDY comes out of a stairwell.\r\n                         \r\n<b>                          JUDY\r\n</b>           Hello? Can I help you?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, do you know where Julie is?\r\n                         \r\n<b>                          JUDY\r\n</b>           Hey! Are you Max?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah...\r\n                         \r\n<b>                          JUDY\r\n</b>           Oh wow! You're just like she described.\r\n           Hi, I'm Judy. I'm sure she mentions me\r\n           all the time.\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, yeah, Judy. Right.\r\n                         \r\n           Judy unlocks the door and holds it open.\r\n                         \r\n<b>                          JUDY\r\n</b>           Come in, come in. Make yourself at home.\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, thanks.\r\n                         \r\n<b>          62 INT. JULIE'S SUITE 62\r\n</b>                         \r\n           Max enters cautiously. The common room couldn't be more\r\n           different than his own, clean and tasteful.\r\n                         \r\n           Judy hangs her coat up.\r\n                         \r\n<b>                          JUDY\r\n</b>           This may be completely inappropriate, but\r\n           can I ask you something? The tattoo­ did\r\n           it hurt?\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (THINKING FAST)\r\n</b>           Uhhhh... No! I mean, not much.\r\n                         \r\n<b>                          JUDY\r\n</b>           Why didn't you use your frat's logo?\r\n<b>           74.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Well, uh, the guy said it's too hard to\r\n           draw two grown men kissing. Say, which\r\n           one is Julie's room?\r\n                         \r\n<b>                          JUDY\r\n</b>           On the left. She's got the single.\r\n                         \r\n          Max pushes Julie's door open with one hand while keeping an\r\n          eye on the front door.\r\n                         \r\n<b>                          MAX\r\n</b>           So...! Uh, do I come here often, would you\r\n           say?\r\n                         \r\n<b>           JUDY (O.S.)\r\n</b>           What?\r\n                         \r\n          The front door opens and Julie enters.\r\n                         \r\n<b>                          JULIE\r\n</b>           Max! What are you doing here?\r\n                         \r\n<b>                          MAX\r\n</b>           Judy let me in!\r\n                         \r\n          Judy comes out of her room.\r\n                         \r\n<b>                          JUDY\r\n</b>           You know, I think I'm going to get a\r\n           tattoo, too.\r\n                         \r\n<b>                          JULIE\r\n</b>           Judy, Mark has the tattoo. This is Max.\r\n                         \r\n<b>                          JUDY\r\n</b>           What? You're Max?\r\n                         \r\n<b>                          JULIE\r\n</b>           Yeah, isn't he great?\r\n                         \r\n<b>                          JUDY\r\n</b>           Sure.\r\n                         \r\n          Glaring at him, she goes into her room and closes the door.\r\n                         \r\n<b>                          JULIE\r\n</b>           What a surprise! What brings you here?\r\n                         \r\n<b>                          MAX\r\n</b>           I was, uh, in the area and thought I'd\r\n           pop in. Find out how your day went.\r\n<b>           75.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           It was excellent, how was yours?\r\n                         \r\n<b>                          MAX\r\n</b>           Great. I had lunch with a dear, dear\r\n           friend.\r\n                         \r\n<b>                          JULIE\r\n</b>           Yeah? Anyone I know?\r\n                         \r\n<b>                          MAX\r\n</b>           Probably not. She's a foreign exchange\r\n           student. Spends a lot of time modeling.\r\n                         \r\n<b>                          JULIE\r\n</b>           Really?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, the agencies won't leave her alone.\r\n           We had, uh, quite a lunch. Lots of\r\n           shellfish, and wine. And, uh, rhino's\r\n           horn.\r\n                         \r\n<b>                          JULIE\r\n</b>           For lunch?\r\n                         \r\n<b>                          MAX\r\n</b>           Well, yeah, uh, she's on the kosher meal\r\n           plan. Look, I gotta go. Nice seeing you\r\n           again.\r\n                         \r\n           He splits, leaving Julie wondering what that was all about.\r\n                         \r\n<b>          63 EXT. JULIE'S DORM ­ NIGHT 63\r\n</b>                         \r\n           Outside, Max beats himself in the forehead several times.\r\n           Then, a picture of misery, he trudges off--\r\n                         \r\n<b>          64 INT. RADIO STATION 64\r\n</b>                         \r\n           He walks in on someone doing a show. He leaves dejectedly.\r\n                         \r\n<b>          65 INT. COMMON ROOM 65\r\n</b>                         \r\n           He goes back to his suite, where Sam and Jen sit like\r\n           statues, watching \"The X-Files.\" He makes a quick exit.\r\n                         \r\n<b>          66 EXT. JULIE'S DORM ­ NIGHT 66\r\n</b>                         \r\n           Passes by Julie's dorm again.\r\n                         \r\n<b>          67 EXT. UNIVERSITY CENTER ­ NIGHT 67\r\n</b>                         \r\n           Eventually finds himself approaching the University Center.\r\n<b>           76.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          68 INT. THE PUB ­ NIGHT 68\r\n</b>                         \r\n           A ska band plays \"These Boots Were Made For Walking\" before\r\n           two small lines of skanking rude boys.\r\n                         \r\n           Charles is alone at the bar. Max sits down beside him.\r\n                         \r\n<b>                          MAX\r\n</b>           I just made an ass of myself.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Oh, is it the weekend already?\r\n                         \r\n<b>                          MAX\r\n</b>           Ha-ha.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Don't worry about it. Your troubles don't\r\n           compare. Sara blew up at Stacy and nearly\r\n           destroyed our first rehearsal.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, you've got real problems. Do you\r\n           have time to talk?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Uh-oh, here she comes.\r\n                         \r\n<b>                          SARA\r\n</b>           Charles! Can you believe Stacy at\r\n           rehearsal?!\r\n                         \r\n           She jumps on the stool next to him. Charles turns to Max for\r\n           help but he's already gone.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n           TITLE CARD: white on black: \"FRIDAY\"\r\n                         \r\n<b>          69 INT. COMMON ROOM -- THE NEXT MORNING 69\r\n</b>                         \r\n           Max plays video hockey. Charles comes in.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Studying for a test?\r\n                         \r\n<b>                          MAX\r\n</b>           You shouldn't talk, theater major.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Hey, I have a test on lighting next week\r\n           that'll make your hair go grey.\r\n                         \r\n           He sprawls on the couch.\r\n<b>           77.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES (CONT'D)\r\n</b>           Thanks for bailing on me last night. I\r\n           had to hear Sara gab for an hour.\r\n                         \r\n<b>                          MAX\r\n</b>           Why didn't you just leave? At least you\r\n           can escape your problems.\r\n                         \r\n<b>                          CHARLES\r\n</b>           What do you mean?\r\n                         \r\n<b>                          MAX\r\n</b>           I just got my textbooks for this term.\r\n                         \r\n          Max holds up a thick book, Post-Modern Semiology. The entire\r\n          cover is a still from Annie Hall.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Holy shit.\r\n                         \r\n<b>                          MAX\r\n</b>           When the gods give you a sign like that,\r\n           there's only one thing to do.\r\n                         \r\n          He passes a controller to Charles and they play.\r\n                         \r\n<b>                          CHARLES\r\n</b>           By the way, I saw Julie last night.\r\n                         \r\n<b>                          MAX\r\n</b>           Was she alone?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Not if you count this huge purse she had.\r\n           She was rummaging through it and finally\r\n           had to dump the thing out. I swear, I'm\r\n           surprised Kennedy's brain didn't fall out\r\n           of that thing. Anyway, it made me think\r\n           of Annie Hall.\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, great.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Although Julie dresses better.\r\n                         \r\n          Max slowly lowers his controller.\r\n                         \r\n<b>                          MAX\r\n</b>           What are you saying, I like her because\r\n           she's like Annie Hall?\r\n                         \r\n<b>                          CHARLES\r\n</b>           I didn't say that.\r\n<b>           78.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Oh my God, I think you're right.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I didn't say that.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't want to like someone because she\r\n           reminds me of someone in a movie. Now I'm\r\n           wondering why I like her. Maybe I don't.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Good Lord, Max. Take some harder classes.\r\n                         \r\n           Sam returns, sees what they are playing.\r\n                         \r\n<b>                          SAM\r\n</b>           Look at you two. Wouldn't something else\r\n           be fun for a change? How about Goldeneye?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Great game.\r\n                         \r\n<b>                          MAX\r\n</b>           No. I don't know how to play it.\r\n                         \r\n<b>                          SAM\r\n</b>           Lucky for you, I actually have time to\r\n           teach you. Normally I would be having\r\n           lunch with Jen.\r\n                         \r\n<b>                          MAX\r\n</b>           Oh, shit, I forgot about lunch!\r\n                         \r\n           Max gets up and runs out. Charles and Sam exchange a look.\r\n                         \r\n<b>                          SAM\r\n</b>           Man, he'll do anything to avoid change,\r\n           won't he?\r\n                         \r\n<b>          70 INT. THE FABULOUS DINER ­ DAY 70\r\n</b>                         \r\n           Beth is alone, working on a salad. Max runs up and jumps into\r\n           the booth.\r\n                         \r\n<b>                          BETH\r\n</b>           (not looking up)\r\n           So glad you could make it.\r\n                         \r\n<b>                          MAX\r\n</b>           Hey, I'm here, right?\r\n                         \r\n<b>                          BETH\r\n</b>           Thank God for small favors.\r\n<b>           79.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           I'm sorry. Are you still upset about the\r\n           thing with Steve?\r\n                         \r\n<b>                          BETH\r\n</b>           Yeah, a little. This semester isn't\r\n           shaping up too well. It's tough getting\r\n           back into the groove of things and, you\r\n           know, being on campus. Yourself?\r\n                         \r\n<b>                          MAX\r\n</b>           Well, you know. Nothing even worth\r\n           mentioning.\r\n                         \r\n<b>                          BETH\r\n</b>           But there's something? Really?\r\n                         \r\n<b>                          MAX\r\n</b>           It's nothing.\r\n                         \r\n<b>                          BETH\r\n</b>           Who is it? Do I know her?\r\n                         \r\n<b>                          MAX\r\n</b>           Actually, um, yeah, it's Julie.\r\n                         \r\n<b>                          BETH\r\n</b>           Julie! She's great. Why aren't you\r\n           thrilled?\r\n                         \r\n<b>                          MAX\r\n</b>           Well, I'm not sure I'm that into her.\r\n                         \r\n<b>                          BETH\r\n</b>           This I gotta hear.\r\n                         \r\n<b>                          MAX\r\n</b>           She reminds everyone of Annie Hall.\r\n                         \r\n<b>                          BETH\r\n</b>           Well, of course, why do you think I sent\r\n           her to you?\r\n                         \r\n<b>                          MAX\r\n</b>           God, I'm such an idiot! That film is\r\n           finding more and more ways to ruin my\r\n           life.\r\n                         \r\n          Max pounds his head against the table but Beth is amused.\r\n                         \r\n<b>                          BETH\r\n</b>           What're you talking about?\r\n<b>           80.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Look at my life. Look at this thing with\r\n           Julie.\r\n                         \r\n<b>                          BETH\r\n</b>           Jeez, she's not like Annie when the film\r\n           starts, she's like Annie at the end. Or\r\n           maybe, the Millennium Edition.\r\n                         \r\n<b>                          MAX\r\n</b>           The worst part is, maybe I knew this all\r\n           along.\r\n                         \r\n<b>                          BETH\r\n</b>           Max, what's really the problem here?\r\n                         \r\n<b>                          MAX\r\n</b>           And Annie Hall's not even my type.\r\n                         \r\n<b>                          BETH\r\n</b>           You have a type?\r\n                         \r\n<b>                          MAX\r\n</b>           I'm into bipeds with most of their teeth.\r\n           No Lutherans or fictional characters.\r\n                         \r\n<b>                          BETH\r\n</b>           Who would you rather sleep with, Julie or\r\n           Annie Hall?\r\n                         \r\n<b>                          MAX\r\n</b>           That's not two choices, that's one.\r\n                         \r\n<b>                          BETH\r\n</b>           Okay, Annie Hall or me?\r\n                         \r\n          Max knocks over her soda.\r\n                         \r\n<b>                          BETH (CONT'D)\r\n</b>           Stop delaying. This is a serious\r\n           hypothetical question.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, I must admit, it would be... Annie\r\n           Hall.\r\n                         \r\n          Beth snorts, then laughs.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Don't feel bad, you came in second.\r\n                         \r\n<b>                          BETH\r\n</b>           I'll take what I can get.\r\n<b>           81.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           It's only because you'd laugh at more of\r\n           my jokes in bed. It adds a whole other\r\n           dimension-- you'd be laughing with me in\r\n           addition to at me.\r\n                         \r\n<b>                          BETH\r\n</b>           You joke while you're in bed?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah.\r\n                         \r\n<b>                          BETH\r\n</b>           That's so weird.\r\n                         \r\n<b>                          MAX\r\n</b>           I'm weird.\r\n                         \r\n<b>                          BETH\r\n</b>           No, it's weird because I do the same\r\n           thing. Guys find it annoying.\r\n                         \r\n<b>                          MAX\r\n</b>           Girls think I'm a loser.\r\n                         \r\n<b>                          BETH\r\n</b>           Julie doesn't. And you really like her.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah. It's corny, but there's something\r\n           about her that brings me happiness.\r\n                         \r\n<b>                          BETH\r\n</b>           Happiness? Max, you wouldn't know what to\r\n           do with it if you had it.\r\n                         \r\n<b>          71 INT. COMMON ROOM -- NIGHT 71\r\n</b>                         \r\n           Max frantically cleans up all the pizza boxes, wrappers, and\r\n           empties. Charles leans on the wall, arms crossed.\r\n                         \r\n<b>                          CHARLES\r\n</b>           You've gotta be kidding.\r\n                         \r\n<b>                          MAX\r\n</b>           Look, either go somewhere else, or stay\r\n           in your room.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Can't I even meet her?\r\n                         \r\n<b>                          MAX\r\n</b>           You already did.\r\n<b>           82.\r\n</b>                         \r\n                         \r\n                         \r\n           Max stuff the trash with paper, squirts lighter fluid all\r\n           over it, and takes Annie Hall from the shelf.\r\n                         \r\n<b>                          CHARLES\r\n</b>           What are you doing?\r\n                         \r\n<b>                          MAX\r\n</b>           Julie's coming over to watch a movie. I\r\n           don't want to take any chances.\r\n                         \r\n           He carries the tape over the trash but Charles snatches it\r\n           from him.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Dude, Sam and I were gonna watch that.\r\n                         \r\n           Annoyed, he puts it back on the shelf and goes to his room.\r\n                         \r\n           The doorbell RINGS. Max smooths his hair one last time...\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n<b>          72 INT. COMMON ROOM -- NIGHT -- LATER 72\r\n</b>                         \r\n           Max and Julie browse a shelf full of videos.\r\n                         \r\n<b>                          MAX\r\n</b>           Since Scott joined a video club, we've\r\n           got a lot of shitty movies you'll ever\r\n           Oo, here's Buffalo `66, that's a\r\n           need.\r\n           great flick.\r\n                         \r\n<b>                          JULIE\r\n</b>           It is, but I saw it a couple of weeks\r\n           ago. I don't think I can sit through it\r\n           again. You mentioned something about\r\n           Annie Hall the other night. Do you have\r\n           that lying around?\r\n                         \r\n<b>                          MAX\r\n</b>           Ummm, no.\r\n                         \r\n<b>                          JULIE\r\n</b>           Isn't that it on the end there?\r\n                         \r\n<b>                          MAX\r\n</b>           No.\r\n                         \r\n<b>                          JULIE\r\n</b>           Sure it is.\r\n                         \r\n<b>                          MAX\r\n</b>           Um, no, it's just the box. The tape\r\n           inside is wrestling.\r\n<b>           83.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           No, it isn't.\r\n                         \r\n<b>                          MAX\r\n</b>           Um, it's been recorded over...\r\n                         \r\n<b>                          JULIE\r\n</b>           You don't believe your friend's theory,\r\n           right?\r\n                         \r\n<b>                          MAX\r\n</b>           No, of course not.\r\n                         \r\n<b>                          JULIE\r\n</b>           Because it's insulting. A cop-out.\r\n                         \r\n<b>                          MAX\r\n</b>           I, I know, it's just, I watched it last\r\n           week. How about Airplane?\r\n                         \r\n<b>                          JULIE\r\n</b>           Oh, good idea. But next time, Annie Hall.\r\n                         \r\n           Max puts in Airplane. Julie and Max sit on a couch together.\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n<b>          73 INT. COMMON ROOM -- NIGHT -- LATER 73\r\n</b>                         \r\n           Airplane plays. Julie and Max share a blanket. Max turns\r\n           toward Julie just as she turns toward him, and their lips end\r\n           up in the same place. Julie pulls back.\r\n                         \r\n<b>                          JULIE\r\n</b>           What are you­?\r\n                         \r\n<b>                          MAX\r\n</b>           Huh?\r\n                         \r\n<b>                          JULIE\r\n</b>           Why did you back away?\r\n                         \r\n<b>                          MAX\r\n</b>           Why did you?\r\n                         \r\n<b>                          JULIE\r\n</b>           It wasn't me, I wouldn't have backed\r\n           away.\r\n                         \r\n<b>                          MAX\r\n</b>           Really? I'll, I'll have to remember that\r\n           later.\r\n<b>           84.\r\n</b>                         \r\n                         \r\n                         \r\n          Max turns back to the movie. A beat passes. Julie looks at\r\n          him, amused.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Actually, my memory's not what it used to\r\n           be. If I don't act on this information\r\n           now...\r\n                         \r\n          They kiss. Max pulls the blanket up over them. The sound of\r\n          KISSING. Then:\r\n                         \r\n<b>                          JULIE\r\n</b>           Ow.\r\n                         \r\n<b>                          MAX\r\n</b>           Sorry.\r\n                         \r\n<b>                          JULIE\r\n</b>           No, it's okay.\r\n                         \r\n          More KISSING.\r\n                         \r\n<b>                          MAX\r\n</b>           Are you comfortable, I mean, is this\r\n           okay?\r\n                         \r\n<b>                          JULIE\r\n</b>           It's okay. Shut up already.\r\n                         \r\n          Suddenly, the sound of a LOCK TURNING. Max and Julie quickly\r\n          get out from under the covers. Sam and Tommy enter, oblivious\r\n          to the quick recovery of innocence on the couch.\r\n                         \r\n<b>                          TOMMY\r\n</b>           You're crazy! You know how important your\r\n           sense of smell is?\r\n                         \r\n<b>                          SAM\r\n</b>           Come on! What about touch? Missing the\r\n           smell of rotting milk is hardly equal to\r\n           not being able to enjoy sex.\r\n<b>                          (SEEING THEM)\r\n</b>           Oh, hey, Max.\r\n                         \r\n<b>                          MAX\r\n</b>           Hey. Guys, um, this is Julie. Julie, this\r\n           is my roommate Sam, and that's Tommy, who\r\n           also lives here.\r\n                         \r\n<b>                          JULIE\r\n</b>           Nice to meet you guys, but I was just\r\n           leaving.\r\n<b>           85.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           What?\r\n                         \r\n<b>                          JULIE\r\n</b>           I have work to do before class tomorrow.\r\n                         \r\n<b>                          MAX\r\n</b>           But the movie is... Okay. Do you want me to\r\n           walk you home?\r\n                         \r\n<b>                          JULIE\r\n</b>           Sure, all right. Boys, nice to meet you.\r\n                         \r\n           Max leaves with Julie.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Bye.\r\n<b>                          (TO SAM)\r\n</b>           Okay, so what about body odor, then?\r\n                         \r\n<b>          74 INT. JULIE'S ROOM 74\r\n</b>                         \r\n           Max and Julie collapse onto the pillows, exhausted from sex.\r\n           Her room is extremely disorganized, decorated in an\r\n           idiosyncratic mix of punk rock icons and nature scenery.\r\n                         \r\n<b>                          JULIE\r\n</b>           I wish I had a cigarette.\r\n                         \r\n<b>                          MAX\r\n</b>           I wish I smoked.\r\n                         \r\n<b>                          JULIE\r\n</b>           Me too. It's strangely sexy when guys\r\n           smoke.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, and it's the only thing between me\r\n           and my dream of becoming Steve McQueen.\r\n                         \r\n           They lie in each other's warmth, under the blanket.\r\n                         \r\n<b>                          JULIE\r\n</b>           So. You and Beth are pretty close, huh?\r\n                         \r\n<b>                          MAX\r\n</b>           You call that pillow talk?\r\n<b>                          (SHRUGS)\r\n</b>           We used to be. There were times I would\r\n           have been lost without her. Other times,\r\n           it was like the lost leading the lost.\r\n                         \r\n<b>                          JULIE\r\n</b>           She really cares about you.\r\n<b>           86.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           We tried something once, but it was a\r\n           disaster.\r\n                         \r\n<b>                          JULIE\r\n</b>           It's great that you're still friends.\r\n                         \r\n<b>                          MAX\r\n</b>           Sometimes I'm not sure if I have a say in\r\n           it. On a campus this small, it's like\r\n           she's everywhere.\r\n                         \r\n<b>                          JULIE\r\n</b>           Sometimes this place annoys me. There's\r\n           so much bullshit. My semester off was the\r\n           right idea. What happened to old-\r\n           fashioned hard work?\r\n                         \r\n<b>                          MAX\r\n</b>           That's what summers are for. The school\r\n           year is for reckless debauchery.\r\n                         \r\n          Max looks at the clock.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Jesus, I have to get going. I'll never\r\n           get my homework done if I sleep all\r\n           weekend. Ah, fuck it, who cares.\r\n                         \r\n<b>                          JULIE\r\n</b>           Why not just set your tuition on fire?\r\n                         \r\n<b>                          MAX\r\n</b>           This, coming from the girl who thinks\r\n           college is bullshit.\r\n                         \r\n          Max just lies there, comfortably resting with a small smile.\r\n                         \r\n<b>                          JULIE\r\n</b>           So, get on up, lazy.\r\n                         \r\n          Max sits up and puts one foot on the floor before realizing\r\n          he'll be naked if he stands. He tries to grab his jeans with\r\n          his toes. Julie observes him dryly.\r\n                         \r\n<b>                          JULIE (CONT'D)\r\n</b>           How can you be shy, after, you know...?\r\n                         \r\n<b>                          MAX\r\n</b>           It's different. Some things aren't quite\r\n           as impressive in the light of day.\r\n                         \r\n<b>                          JULIE\r\n</b>           You have a problem with nudity.\r\n<b>           87.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Of course not. I'm a big fan of it.\r\n                         \r\n           Max picks up his pants. Julie taps him on the shoulder and\r\n           flicks the sheet up to flash him. He starts and drops them.\r\n           She laughs.\r\n                         \r\n<b>                          JULIE\r\n</b>           It's too easy.\r\n                         \r\n           Max puts his jeans on, shoves his underwear and socks in his\r\n           pocket.\r\n                         \r\n<b>                          MAX\r\n</b>           What are you doing tomorrow?\r\n                         \r\n<b>                          JULIE\r\n</b>           A double-shift, I get out at five. This\r\n           week's gonna suck. I have homework that\r\n           can't be avoided.\r\n                         \r\n<b>                          MAX\r\n</b>           The worst kind.\r\n                         \r\n           Max is dressed. They smooch. Max leaves. Julie lies in bed,\r\n           thoughtful.\r\n                         \r\n           Nick Cave begins to croon \"Into My Arms\"...\r\n                         \r\n<b>          75 EXT. JULIE'S DORM -- SUNRISE 75\r\n</b>                         \r\n           Max leaves the building and stops to look at the winter\r\n           sunrise.\r\n                         \r\n           SUPER: black on white: \"SATURDAY\"\r\n                         \r\n           I don't believe\r\n           In an interventionist God\r\n           But I know, darling\r\n           That you do\r\n                         \r\n<b>          76 EXT. LIBRARY -- SUNRISE 76\r\n</b>                         \r\n           Students work in the library as light refracts through\r\n           icicles in the window.\r\n                         \r\n           But if I did\r\n           I would kneel down and ask Him\r\n           Not to intervene\r\n           When it came to you\r\n<b>           88.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          77 EXT. STREET -- SUNRISE 77\r\n</b>                         \r\n           A boy and a girl hold hands as they cross an icy street.\r\n                         \r\n<b>          78 EXT. QUAD -- SUNRISE 78\r\n</b>                         \r\n           Squirrels play in the light.\r\n                         \r\n<b>          79 EXT. UNIVERSITY CENTER -- SUNRISE 79\r\n</b>                         \r\n           The sun reflects off the University Center windows and back\r\n           onto the snow.\r\n                         \r\n           Not to touch a hair on your head\r\n           To leave you as you are\r\n           But if He felt He had to direct you\r\n           Direct you into my arms...\r\n                         \r\n<b>          80 INT. RADIO STATION 80\r\n</b>                         \r\n           The lights are low. Max is at the console, staring into\r\n           space. Nick Cave is playing softly on the monitors.\r\n                         \r\n           Into my arms... oh Lord...\r\n           Into my arms... oh Lord...\r\n                         \r\n           The phone RINGS. Max snaps out of his reverie and stares at\r\n           it in horror. After several rings, he answers it.\r\n                         \r\n<b>                          MAX\r\n</b>           Hello. Nobody is here right now. Please\r\n           leave a message. BEEEEEEEP.\r\n                         \r\n           SPLIT SCREEN between Max and\r\n                         \r\n<b>          81 INT. JULIE'S ROOM 81\r\n</b>                         \r\n           Julie, in bed, smoking.\r\n                         \r\n<b>                          JULIE\r\n</b>           Nice try, Max. I thought you had homework\r\n           and stuff, you liar. Great song, by the\r\n           way.\r\n                         \r\n<b>                          MAX\r\n</b>           You're listening? I told you not to\r\n           listen!\r\n                         \r\n<b>                          JULIE\r\n</b>           Come on, you're funny, you have good\r\n           taste in music...\r\n                         \r\n<b>                          MAX\r\n</b>           Hey, where'd the music go?\r\n<b>           89.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          82 INT. DORM ROOM -- CONTINUOUS 82\r\n</b>                         \r\n           Two STUDENTS, lying in bed together, listen to the radio.\r\n                         \r\n<b>           JULIE (O.S.)\r\n</b>           (on the radio)\r\n           I don't know.\r\n                         \r\n<b>           MAX (O.S.)\r\n</b>           (on the radio)\r\n           I don't get it, it stopped when I picked\r\n           up the phone.\r\n                         \r\n<b>          83 INT. RADIO STATION -- CONTINUOUS 83\r\n</b>                         \r\n           Max pushes up a slider and hears the following coming out\r\n           over the monitors:\r\n                         \r\n<b>           JULIE (O.S.)\r\n</b>           I'm just calling to say that you left\r\n           your underpants and took mine.\r\n                         \r\n           Max reacts, then SCREECHING FEEDBACK rips over the airwaves.\r\n                         \r\n<b>                          MAX\r\n</b>           Woah!\r\n                         \r\n           Continue SPLIT SCREEN with\r\n                         \r\n<b>          84 INT. JULIE'S ROOM 84\r\n</b>                         \r\n           Where Julie is frantically pulling the chord out of the back\r\n           of her radio.\r\n                         \r\n           Max fades the phone out, the music up.\r\n                         \r\n<b>                          MAX\r\n</b>           Don't be too proud of your five seconds\r\n           of fame. More people would hear us if we\r\n           shouted out the window.\r\n                         \r\n<b>                          JULIE\r\n</b>           My radio days are over, I'm now deaf.\r\n                         \r\n<b>                          MAX\r\n</b>           Didn't I tell you not to listen to my\r\n           show?\r\n                         \r\n<b>                          JULIE\r\n</b>           You were only playing music.\r\n                         \r\n<b>                          MAX\r\n</b>           Well, all these songs are about you.\r\n<b>           90.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Wow... You're a real piece of work, you\r\n           know that, Max?\r\n                         \r\n<b>          85 INT. MAX AND SAM'S ROOM ­ MORNING 85\r\n</b>                         \r\n           Max enters and takes off his coat. Sam sits up, annoyed.\r\n                         \r\n<b>                          MAX\r\n</b>           Man, I'm sorry. Go back to sleep.\r\n                         \r\n<b>                          SAM\r\n</b>           What's the point? I have to be up in 15\r\n           minutes anyway. Not that I could sleep.\r\n                         \r\n<b>                          MAX\r\n</b>           I didn't sleep either, but for some\r\n           reason I'm still refreshed. I feel great.\r\n                         \r\n           Sam stares at him.\r\n                         \r\n<b>                          SAM\r\n</b>           What the fuck is your problem?\r\n                         \r\n<b>                          MAX\r\n</b>           It's Julie. Last night we officially\r\n           became a couple.\r\n                         \r\n<b>                          SAM\r\n</b>           Officially?\r\n                         \r\n<b>                          MAX\r\n</b>           We hooked up.\r\n                         \r\n<b>                          SAM\r\n</b>           That doesn't mean anything.\r\n                         \r\n<b>                          MAX\r\n</b>           It meant something to me.\r\n                         \r\n           Sam considers him.\r\n                         \r\n<b>                          SAM\r\n</b>           I don't believe you. Just last week you\r\n           told me the happy should be quarantined.\r\n           I don't know you anymore.\r\n                         \r\n<b>                          MAX\r\n</b>           Still down about Jen, huh?\r\n                         \r\n<b>                          SAM\r\n</b>           We broke up for good last night.\r\n                         \r\n           He gets out of bed and starts dressing.\r\n<b>           91.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Oh, man, I'm sorry.\r\n                         \r\n<b>                          SAM\r\n</b>           I thought I knew what I was doing. Ever\r\n           since she became my girlfriend, I've felt\r\n           more and more constricted. Like I was\r\n           trapped under the weight of the label.\r\n           \"My girlfriend.\" \"Her boyfriend.\"\r\n                         \r\n<b>                          MAX\r\n</b>           You guys were together a long time.\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah, we were.\r\n                         \r\n<b>                          MAX\r\n</b>           Have fun in Saturday lab.\r\n                         \r\n<b>                          SAM\r\n</b>           Ah, eat shit and die.\r\n                         \r\n<b>          86 INT. COMMON ROOM -- HOURS LATER 86\r\n</b>                         \r\n           Max is alone, playing \"Goldeneye\" with a dopey smile on his\r\n           face. Charles comes in, rolls of blueprints under his arm.\r\n                         \r\n<b>                          CHARLES\r\n</b>           What's this, \"Goldeneye\"?\r\n                         \r\n           Charles sits and they play against each other.\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah...\r\n                         \r\n<b>                          CHARLES\r\n</b>           Have you been here all day?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, this game's so much fun.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Max, gotta tell you, you're really\r\n           creeping me out.\r\n                         \r\n           Tommy comes out of his room, dressed in a shirt and tie.\r\n                         \r\n<b>                          MAX\r\n</b>           Sam said the same thing. He's still\r\n           depressed.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Still can't believe he broke up with Jen.\r\n           I saw her yesterday and she looked sad.\r\n<b>                          [MORE]\r\n</b><b>           92.\r\n</b>                         \r\n<b>                          CHARLES (CONT'D)\r\n</b>           I asked her how she was doing, and she\r\n           said \"Fine,\" and asked me why I was\r\n           asking.\r\n                         \r\n<b>                          MAX\r\n</b>           A non-denial denial. I invented that.\r\n           She's learned from the best.\r\n                         \r\n<b>                          TOMMY\r\n</b>           I saw her, too. She didn't seem upset to\r\n           me.\r\n                         \r\n          Charles kills Max with a rocket launcher.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I was hanging with Sara. That girl pisses\r\n           me off! She'll say the dumbest things,\r\n           like, the Breeders are better than the\r\n           Beatles.\r\n                         \r\n<b>                          MAX\r\n</b>           Happiness is a warm gun.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I wouldn't go that far. She's just a\r\n           daffy dame, that's all. Now, Stacy's\r\n           foxy, but she's too serious.\r\n                         \r\n<b>                          MAX\r\n</b>           What about Beth?\r\n                         \r\n<b>                          CHARLES\r\n</b>           What about her?\r\n                         \r\n          Sam comes in, totally morose. Silently, he joins them in\r\n          three-player mode, then quickly kills himself with a rocket\r\n          launcher.\r\n                         \r\n<b>                          MAX\r\n</b>           You just came from Jen's, huh?\r\n                         \r\n<b>                          SAM\r\n</b>           Yeah, we just broke up for good.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Oh, man, I'm sorry. Was it you or her?\r\n                         \r\n<b>                          SAM\r\n</b>           Me. Us. Both. It was just time, I guess.\r\n           (puts down the joystick)\r\n           I have to go, uh, mail a letter or\r\n           something.\r\n                         \r\n          He puts on his coat and leaves. Charles, Tommy, and Max\r\n          exchange looks. Max turns off the game.\r\n<b>           93.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Well, that took the wind out of my sails.\r\n                         \r\n<b>                          CHARLES\r\n</b><b>                          (NOTICING TOMMY)\r\n</b>           What's up with you? Got another date with\r\n           Amanda?\r\n                         \r\n<b>                          TOMMY\r\n</b>           It wasn't a date.\r\n                         \r\n<b>                          CHARLES\r\n</b>           A no-show, huh?\r\n                         \r\n<b>                          TOMMY\r\n</b>           Yeah, but it's okay. Today's her\r\n           birthday, and she invited me out for\r\n           dinner at a nice restaurant.\r\n                         \r\n<b>                          CHARLES\r\n</b>           She invited all of us.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Oh? Well, that's cool, too.\r\n                         \r\n<b>                          MAX\r\n</b>           It's barely lunch, why are you dressed\r\n           up?\r\n                         \r\n<b>                          TOMMY\r\n</b>           I don't want to wait til the last minute\r\n           to pick out my clothes.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Are you really wearing that tie?\r\n                         \r\n<b>                          TOMMY\r\n</b>           Damn, I knew this was the wrong one!\r\n                         \r\n           He runs into his room. Charles laughs at him.\r\n                         \r\n<b>                          MAX\r\n</b>           I don't wanna go to a birthday party. I'm\r\n           broke, and I wanna hang out with Julie.\r\n                         \r\n<b>                          CHARLES\r\n</b>           So take her. And pray Sara's not there.\r\n                         \r\n<b>          87 EXT. CAMPUS PARKING LOT ­ EVENING 87\r\n</b>                         \r\n           Max and Julie walk through the snow together, toward a\r\n           parking lot. She's taking deep drags off a cigarette.\r\n<b>           94.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           This has been some crazy week. I still\r\n           have a six page paper due Monday.\r\n                         \r\n<b>                          MAX\r\n</b>           Six pages? That's nothing. Triple spaced,\r\n           in 14 point type, that's only like 500\r\n           words. If a picture's worth a thousand\r\n           words, that's like a bad photocopy.\r\n                         \r\n<b>                          JULIE\r\n</b>           Don't worry about it, I needed a break.\r\n           Good to get out and enjoy the weather.\r\n                         \r\n<b>                          MAX\r\n</b>           What are you, from Maine?\r\n                         \r\n<b>                          JULIE\r\n</b>           No.\r\n                         \r\n<b>                          MAX\r\n</b>           Phew, because I don't know if I'd be able\r\n           to handle something like that. That's a\r\n           hard thing to drop on a person.\r\n                         \r\n<b>                          JULIE\r\n</b>           I'm from northern Vermont. Not too far\r\n           from Canada.\r\n                         \r\n<b>                          MAX\r\n</b>           Shit, I'm sorry.\r\n                         \r\n<b>                          JULIE\r\n</b>           It sucked but I managed. Read a lot. Had\r\n           a few close friends. That's all you need.\r\n           It's quiet up there, dull but nice.\r\n                         \r\n<b>                          MAX\r\n</b>           It sounds it.\r\n                         \r\n           They get to her car, and he surprises her by kissing her. She\r\n           responds, after a hesitation.\r\n                         \r\n<b>          88 INT. JULIE'S CAR ­ EVENING 88\r\n</b>                         \r\n           Max sits tensely in the passenger seat.\r\n                         \r\n<b>                          MAX\r\n</b>           Look out for that truck!\r\n                         \r\n           The truck's about two blocks away.\r\n                         \r\n<b>                          JULIE\r\n</b>           Will you relax? I know how to drive.\r\n<b>           95.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           Watch the driveway!\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (ANNOYED)\r\n</b>           I've got it under control, Max!\r\n                         \r\n<b>                          MAX\r\n</b>           Anyway, everyone's dying to meet you.\r\n                         \r\n<b>                          JULIE\r\n</b>           Oh, yeah?\r\n                         \r\n           She drags on her cigarette.\r\n                         \r\n<b>                          MAX\r\n</b>           This is going to be fun. All my friends,\r\n           meeting my girlfriend. It's going to be\r\n           great.\r\n                         \r\n<b>                          JULIE\r\n</b>           Did you just call me your girlfriend?\r\n                         \r\n<b>                          MAX\r\n</b>           Uh, yeah...\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (CONSIDERS)\r\n</b>           Ah well, I guess that's alright.\r\n           Boyfriend.\r\n                         \r\n           She looks at Max and smiles.\r\n                         \r\n<b>          89 INT. PRETENTIOUS CAFE -- EVENING 89\r\n</b>                         \r\n           We PAN around a long table: Beth at one end, then Jen and\r\n           Sam, Charles (looking annoyed) and Sara, Tommy at the other\r\n           end, then Scott and Amanda, and two chairs. Everyone's\r\n           talking and looking at menus.\r\n                         \r\n           Max and Julie enter. Max looks around, paranoid. He sees\r\n           Donna the waitress glaring at him, and hurries after Julie,\r\n           who is already at the table introducing herself.\r\n                         \r\n<b>                          AMANDA\r\n</b>           Beth, I can't believe you're graduating\r\n           so early.\r\n                         \r\n<b>                          MAX\r\n</b>           What, really?\r\n<b>           96.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          BETH\r\n</b>           Yeah. I've spent my life learning how to\r\n           be a student, and at the end of the\r\n           semester it will all be useless.\r\n           Everybody already wants to know what I'm\r\n           going to do, and I have no idea. I\r\n           started making up stories to tell people.\r\n           An aunt asked me if I'm excited about\r\n           Chicago, and I couldn't remember if I'd\r\n           said I was moving to the city or going to\r\n           see the band.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Something similar once happened to me,\r\n           except I didn't know Nashville Pussy was\r\n           a band.\r\n                         \r\n          Tommy laughs and blows tea out his nose.\r\n                         \r\n<b>                          BETH\r\n</b>           I can't believe I'm graduating. My whole\r\n           life, I've known what was next. But when\r\n           I graduate, the next step is... something?\r\n                         \r\n<b>                          JULIE\r\n</b>           Something that pays the bills.\r\n                         \r\n<b>                          MAX\r\n</b>           My grandfather once told me that if you\r\n           love your job, you'll never work a day in\r\n           your life. He's 98 years old, addicted to\r\n           C-SPAN, and had to be removed from a\r\n           supermarket recently for shouting about\r\n           Republicans.\r\n                         \r\n<b>                          JULIE\r\n</b>           Now I know where you get it from.\r\n                         \r\n<b>                          AMANDA\r\n</b>           You should do whatever makes you happy.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Grad school baby. Stay out of the real\r\n           world as long as possible.\r\n                         \r\n          Sam and Jen sit close together and are both subdued.\r\n                         \r\n<b>                          SAM\r\n</b>           I can't believe I'm graduating next year.\r\n           I already have a recurring nightmare\r\n           about it.\r\n                         \r\n<b>                          JEN\r\n</b>           You have plenty of time, dear.\r\n<b>           97.\r\n</b>                         \r\n                         \r\n                         \r\n          She rubs his arm soothingly. Behind her back, Charles rolls\r\n          his eyes and sticks his finger down his throat. Sara sees it.\r\n                         \r\n<b>                          SARA\r\n</b>           Come on, Charles, show a little dignity.\r\n                         \r\n          He whirls on her.\r\n                         \r\n<b>                          CHARLES\r\n</b>           Dignity? You've been following me around\r\n           like a lost dog since break, and you're\r\n           talking about dignity?! You're always in\r\n           my way, I can't get away from you!\r\n                         \r\n<b>                          SARA\r\n</b>           What are you talking about?!\r\n                         \r\n<b>                          CHARLES\r\n</b>           If they're making me sick, that's my\r\n           business! Leave me alone already!\r\n                         \r\n<b>                          SARA\r\n</b>           Fine!\r\n                         \r\n          She storms out. The table is aghast. Julie averts her eyes\r\n          politely. Beth pokes Max, urging him to do something.\r\n                         \r\n<b>                          JEN\r\n</b>           We make you sick? Sam, say something to\r\n           him!\r\n                         \r\n<b>                          SAM\r\n</b>           Why should I? We've made him sick for\r\n           years.\r\n                         \r\n<b>                          JEN\r\n</b>           How dare you!\r\n                         \r\n<b>                          SAM\r\n</b>           It's true!\r\n                         \r\n          Beth smacks Max's leg: Do something! He begs off.\r\n                         \r\n<b>                          JEN\r\n</b>           You think everything's okay if it's true,\r\n           but some things are true and not okay!\r\n                         \r\n<b>                          SAM\r\n</b>           When are you going to realize I'm a\r\n           different person and entitled to my\r\n           opinion? It's my goddamn life!\r\n                         \r\n          Jen turns away, glaring. Max anxiously looks at Julie, who\r\n          stares above her menu.\r\n<b>           98.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          AMANDA\r\n</b>           Please, guys, it's my birthday. We're\r\n           here to celebrate.\r\n                         \r\n<b>                          SCOTT\r\n</b><b>                          (AS \"CARTMAN\")\r\n</b>           \"Can't we all just get along?\"\r\n                         \r\n<b>                          AMANDA\r\n</b>           Goddamn it, Scott, I am so sick of you\r\n           making fun of me! You are the meanest\r\n           person I've ever met and I don't know why\r\n           anybody even talks to you! You are such\r\n           an asshole!\r\n                         \r\n          They lock gazes for a beat.\r\n                         \r\n<b>                          SCOTT\r\n</b>           Sorry.\r\n                         \r\n          Sara comes back in and sits down, sullen. There is a long,\r\n          uncomfortable silence.\r\n                         \r\n          A WAITER arrives.\r\n                         \r\n<b>                          WAITER\r\n</b>           Are you ready to order?\r\n                         \r\n<b>                          JEN SAM\r\n</b>           No. Yes.\r\n                         \r\n          Unsure, he turns to the next couple.\r\n                         \r\n<b>                          CHARLES SARA\r\n</b>           Yes. No.\r\n                         \r\n          The waiter looks around, notices the tension.\r\n                         \r\n<b>                          WAITER\r\n</b>           Why don't I come back?\r\n                         \r\n          He leaves. Awkward silence.\r\n                         \r\n<b>                          BETH\r\n</b><b>                          (CLEARS THROAT)\r\n</b>           Ah... So... Julie. I heard you switched\r\n           majors.\r\n                         \r\n<b>                          JULIE\r\n</b>           Yes, I'm Psych now. I didn't like Soc.\r\n                         \r\n<b>                          JEN\r\n</b>           I'm a Soc. major.\r\n<b>           99.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Oh sorry, I just meant, I needed\r\n           something more, ya know, relevant.\r\n                         \r\n<b>                          SAM\r\n</b>           Psych is relevant?\r\n                         \r\n<b>                          JULIE\r\n</b><b>                          (SLIGHTLY DEFENSIVE)\r\n</b>           Well, look, I'm only in college for the\r\n           degree. Most of the stuff they teach us\r\n           is pointless anyway.\r\n                         \r\n          Julie looks at Max: Say something.\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (FEEBLY)\r\n</b>           Heheh, I bet that's why they call it\r\n           \"academic.\"\r\n                         \r\n<b>                          JEN\r\n</b>           College is a great opportunity. It's\r\n           about more than getting a job.\r\n                         \r\n<b>                          JULIE\r\n</b>           Yeah, it's about avoiding the real world\r\n           for as long as possible.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I work in theater, so this is great\r\n           training for me.\r\n                         \r\n<b>                          JULIE\r\n</b>           You call theater the real world?\r\n                         \r\n<b>                          SARA\r\n</b>           Hey!\r\n                         \r\n          Now Julie is hitting Max's leg: Help me out here! But Max is\r\n          petrified, watching his worst nightmare unfold.\r\n                         \r\n<b>                          JEN\r\n</b>           Some of us work really hard to get\r\n           through school.\r\n                         \r\n<b>                          JULIE\r\n</b>           Look, my parents worked their whole lives\r\n           to give me the opportunity to be here.\r\n           But the truth is, private schools like\r\n           ours make money by showing students a\r\n           good time for four years. It's bullshit.\r\n                         \r\n<b>                          AMANDA\r\n</b>           You think social work is bullshit?\r\n<b>           100.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           That's not what I--\r\n                         \r\n<b>                          CHARLES\r\n</b>           This \"bullshit\" is going to put me in\r\n           debt for the next forty years.\r\n                         \r\n           Julie punches Max in the thigh. He jumps, blinks.\r\n                         \r\n<b>                          JEN\r\n</b>           Why don't you just drop out if\r\n           everything's such bullshit?\r\n                         \r\n<b>                          MAX\r\n</b>           So what's everybody going to order then?\r\n                         \r\n<b>                          JULIE\r\n</b>           God. What a bunch of spoiled, whiny\r\n           college brats.\r\n                         \r\n           Nobody has anything more to say. Everyone looks away. Max is\r\n           shell-shocked.\r\n                         \r\n<b>                          TOMMY\r\n</b>           I'm gonna work for NASA!\r\n                         \r\n<b>          90 EXT. STREET OUTSIDE MAX'S DORM -- NIGHT 90\r\n</b>                         \r\n           Julie's car pulls up. Her bumper sticker: \"EAT ANIMALS, DON'T\r\n<b>                          `LOVE' THEM\"\r\n</b>                         \r\n           Max opens the door, gets halfway out, turns back.\r\n                         \r\n<b>                          MAX\r\n</b>           Are you sure?\r\n                         \r\n<b>                          JULIE\r\n</b>           No, it's okay. I just need a few hours to\r\n           work.\r\n                         \r\n<b>                          MAX\r\n</b>           It'll be fun, just the two of us.\r\n                         \r\n           Julie lights a cigarette off her old one.\r\n                         \r\n<b>                          JULIE\r\n</b>           Okay, see you later.\r\n                         \r\n           She peels out.\r\n                         \r\n<b>          91 INT. COMMON ROOM -- NIGHT 91\r\n</b>                         \r\n           Max straightens up. Scott comes out of his bedroom.\r\n<b>           101.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          SCOTT\r\n</b>           If she stands you up, are we still not\r\n           allowed in here? It's my time to watch\r\n           \"South Park.\"\r\n                         \r\n<b>                          MAX\r\n</b>           Why would she do that?\r\n                         \r\n<b>                          SCOTT\r\n</b><b>                          (SHRUGS)\r\n</b>           It's already past eleven.\r\n                         \r\n           There's a KNOCK on the door.\r\n                         \r\n<b>                          MAX\r\n</b>           See?\r\n                         \r\n           Max gets the door. Scott exits, disappointed. Julie enters,\r\n           smoking.\r\n                         \r\n<b>                          JULIE\r\n</b>           Hey. Sorry I'm late. You wouldn't believe\r\n           what cross-campus traffic was like.\r\n                         \r\n<b>                          MAX\r\n</b>           That's the worst excuse I ever heard. I\r\n           mean it. So... you wanna hit the video\r\n           store?\r\n                         \r\n<b>                          JULIE\r\n</b>           No, you've got something here that I've\r\n           been looking forward to all week.\r\n                         \r\n           She grabs Annie Hall from the shelf.\r\n                         \r\n<b>                          MAX\r\n</b>           Ah, shit, no.\r\n                         \r\n<b>                          JULIE\r\n</b>           You must face your fears. Relax, it's a\r\n           very positive film. You just have to know\r\n           how to look at it. It's really\r\n           refreshingly positive.\r\n                         \r\n<b>                          DISSOLVE TO:\r\n</b>                         \r\n<b>          92 INT. COMMON ROOM -- 98 MINUTES LATER 92\r\n</b>                         \r\n           The closing credits are rolling. Max and Julie look somewhat\r\n           disconcerted.\r\n                         \r\n<b>                          MAX\r\n</b>           Boy, what an uplifting movie. Such a\r\n           refreshingly positive message.\r\n<b>           102.\r\n</b>                         \r\n                         \r\n                         \r\n          She doesn't respond.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           Right?\r\n                         \r\n<b>                          JULIE\r\n</b>           You know, I think I prefer Manhattan.\r\n                         \r\n<b>                          MAX\r\n</b>           How can you say that? Annie Hall is so\r\n           uplifting!\r\n                         \r\n<b>                          JULIE\r\n</b>           It's just deeper, more sophisticated, I\r\n           guess. Listen, thanks for dinner and the\r\n           movie tonight, but I should get going.\r\n                         \r\n<b>                          MAX\r\n</b>           But it's still early.\r\n                         \r\n          Julie goes to the door. Max follows. He tries to kiss her.\r\n          She pulls back.\r\n                         \r\n<b>                          JULIE\r\n</b>           I don't know if this is a good idea right\r\n           now.\r\n                         \r\n<b>                          MAX\r\n</b>           Okay, how about right... now?\r\n                         \r\n          He tries to kiss her again. She ducks it, comes back into the\r\n          room, sits down. Max stands, tense.\r\n                         \r\n<b>                          JULIE\r\n</b>           Listen, since the other night, I've been\r\n           doing some thinking...\r\n                         \r\n<b>                          MAX\r\n</b>           There's your mistake. Mindless happiness\r\n           is always better than thoughtful\r\n           reservation. Unless you're talking about\r\n           nude bungee jumping.\r\n                         \r\n<b>                          JULIE\r\n</b>           I don't think that this is a good time\r\n           for us to jump, or leap, or whatever, you\r\n           know, together. Into a relationship.\r\n                         \r\n<b>                          MAX\r\n</b>           But, but... we just saw a movie about how\r\n           relationships are worth it, no matter\r\n           what happens.\r\n<b>           103.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           Did we?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, I guess we really did.\r\n                         \r\n<b>                          JULIE\r\n</b>           Well, you're right, Max, and this\r\n           relationship was worth it.\r\n                         \r\n<b>                          MAX\r\n</b>           Was? Is. Wait... Oh, shit!\r\n                         \r\n          Max covers his face, breathes deep.\r\n                         \r\n<b>                          JULIE\r\n</b>           Are you okay? Will you please calm down?\r\n           I like you very much, but I told you, I\r\n           just got out of a serious relationship,\r\n           and it ended really badly. We saw each\r\n           other almost every day at the beginning,\r\n           but by the end of the semester, I hadn't\r\n           seen him in a month. He stopped returning\r\n           my calls and stuff, and I mean, he\r\n           basically avoided me, then I heard he was\r\n           seeing one of my friends.\r\n                         \r\n<b>                          MAX\r\n</b>           But that was him, not me.\r\n                         \r\n<b>                          JULIE\r\n</b>           It's nobody's fault, I know. I mean, I've\r\n           been trying but it's hard. Relationships\r\n           are very difficult to maintain. There are\r\n           so few successful couples.\r\n                         \r\n<b>                          MAX\r\n</b>           What's successful? Like, my parents have\r\n           been married thirty years, but--\r\n                         \r\n<b>                          JULIE\r\n</b>           My parents are divorced.\r\n                         \r\n<b>                          MAX\r\n</b>           Okay, bad example. But why think ahead?\r\n           We're here, now. Can't we just enjoy our\r\n           time together?\r\n                         \r\n<b>                          JULIE\r\n</b>           Max, I did, believe me.\r\n                         \r\n<b>                          MAX\r\n</b>           What was all this, I mean, was any of it­\r\n<b>           104.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          JULIE\r\n</b>           I don't know what I was doing. I didn't\r\n           think about where this might lead until\r\n           it was too late.\r\n                         \r\n<b>                          MAX\r\n</b>           But it might lead to... happiness.\r\n                         \r\n          Tommy walks in, half asleep, in his pajamas. He turns on the\r\n          TV and sits down. Max stares at him. Tommy suddenly realizes\r\n          he isn't alone.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Uh, re-run.\r\n                         \r\n          He turns it off and quickly exits. Max tries to pull himself\r\n          together.\r\n                         \r\n<b>                          JULIE\r\n</b>           Say something. Are you okay?\r\n                         \r\n<b>                          MAX\r\n</b>           I knew that damn film was cursed! Why did\r\n           I listen to Charles instead of Annie?\r\n                         \r\n<b>                          JULIE\r\n</b>           Jesus, Max. It's not an anti-relationship\r\n           movie.\r\n                         \r\n<b>                          MAX\r\n</b>           What are you talking about? It's a\r\n           fucking textbook.\r\n                         \r\n          She stands.\r\n                         \r\n<b>                          JULIE\r\n</b>           You're not listening to me, Max. Just\r\n           like you're not listening to Annie. No\r\n           matter what you think right now, this was\r\n           worth it. Because I got to meet you, and\r\n           got to be close to you.\r\n                         \r\n<b>                          MAX\r\n</b>           I know. I don't know. I mean... Good-bye.\r\n                         \r\n          Julie leaves. The VCR whirs to a stop and Annie Hall ejects.\r\n          Max stares at it, upset and thoughtful.\r\n                         \r\n<b>                          CUT TO:\r\n</b>                         \r\n          TITLE CARD: white on black: \"SUNDAY\"\r\n<b>           105.\r\n</b>                         \r\n                         \r\n                         \r\n<b>          93 INT. COMMON ROOM -- LATE AFTERNOON 93\r\n</b>                         \r\n           PAN left to right across people's chests: an X-Files shirt, a\r\n           lounge shirt with a wide collar, a Stephen Hawking shirt, an\r\n           Ani DiFranco shirt...\r\n                         \r\n           PULL BACK to reveal, l to r, Sam, Charles, Tommy and Amanda,\r\n           sprawled on the couches, from Max's POV in the doorway.\r\n                         \r\n           They're drinking vodka out of coffee mugs. The TV is on but\r\n           the sound is off. Everyone looks tired and sad.\r\n                         \r\n           Max sits. Sam thumbs a copy of Scientific American.\r\n                         \r\n<b>                          SAM\r\n</b>           Why are humans smarter than chimps if we\r\n           have 99% of the same genetic material?\r\n                         \r\n<b>                          MAX\r\n</b>           Who says we're smarter?\r\n                         \r\n<b>                          SAM\r\n</b>           Look who I'm asking. You think a red\r\n           blood cell is a prison for a gang member.\r\n                         \r\n<b>                          MAX\r\n</b>           Very funny, Mr. Wizard. If I learned\r\n           anything useful in my classes, I'd be\r\n           rubbing it in your face.\r\n                         \r\n           In Scott's usual spot is Amanda and Tommy.\r\n                         \r\n<b>                          TOMMY\r\n</b>           So Amanda. Have a good weekend?\r\n                         \r\n<b>                          AMANDA\r\n</b>           Yeah.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Mine was good too. Get any good birthday\r\n           presents?\r\n                         \r\n<b>                          AMANDA\r\n</b>           Yeah.\r\n                         \r\n           She gets up and leaves the room.\r\n                         \r\n<b>                          SAM\r\n</b>           By the way, Max, what ever happened with\r\n           that girl you were seeing?\r\n                         \r\n<b>                          MAX\r\n</b>           She just ended a long relationship and\r\n           she doesn't want anything serious.\r\n<b>           106.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          CHARLES\r\n</b>           Can't you have something that's not so\r\n           serious?\r\n                         \r\n<b>                          MAX\r\n</b>           No, it's dead. And the thing I don't get\r\n           is, it was all going so well. There was a\r\n           moment when we kissed, when it was more\r\n           than a kiss...\r\n                         \r\n          His openness is making the other guys uncomfortable.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           It was like we broke through all our\r\n           layers, you know, all the manners and\r\n           defense mechanisms and daily crap, and I\r\n           saw a flash of something, a glimmer of\r\n           hope or happiness or whatever, something\r\n           I inspired in her. But now it's over and\r\n           I'll never see that part of her again.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I think you're upset about not seeing\r\n           some other parts of her again.\r\n                         \r\n          The joke is half-hearted-- Max has made everyone reflective.\r\n                         \r\n<b>                          CHARLES (CONT'D)\r\n</b>           She's a girl, Max. They'll always be a\r\n           mystery. You'll never know why they love\r\n           you and you'll never know why they don't.\r\n                         \r\n<b>                          SAM\r\n</b>           Relationships are incredibly complicated.\r\n           Like polypeptide strings. There's an\r\n           attraction at first, but if the bonds\r\n           don't form right away, nothing can make\r\n           the connection work.\r\n                         \r\n<b>                          MAX\r\n</b>           There's a metaphor we can all relate to.\r\n                         \r\n<b>                          SAM\r\n</b>           It was like with Jen and I. But I know it\r\n           was for the best.\r\n                         \r\n<b>                          CHARLES\r\n</b>           I finally dropped out of the play I was\r\n           directing, just to get rid of Sara. God,\r\n           my career is in shambles.\r\n                         \r\n<b>                          TOMMY\r\n</b>           Tough week all around, huh? How about\r\n           some video hockey?\r\n<b>           107.\r\n</b>                         \r\n                         \r\n                         \r\n           Max gets up and puts on his coat.\r\n                         \r\n<b>                          MAX\r\n</b>           I think I prefer Goldeneye.\r\n                         \r\n           He leaves. Sam sighs and picks up the remote.\r\n                         \r\n<b>                          SAM\r\n</b>           Wanna watch Sports Center?\r\n                         \r\n<b>                          CHARLES\r\n</b>           Nah. I think I'm gonna call Sara...\r\n                         \r\n           He gets up and leaves as Sam registers this news. He puts the\r\n           remote down.\r\n                         \r\n<b>          94 EXT. CAMPUS GREEN ­ DUSK 94\r\n</b>                         \r\n           It is moist and foggy as Max trudges across the deserted\r\n           campus.\r\n                         \r\n<b>           BETH (O.S.)\r\n</b>           Max!\r\n                         \r\n           Max stops in the middle of a path as Beth walks up.\r\n                         \r\n<b>                          BETH (CONT'D)\r\n</b>           Hi there. Happy Valentine's Day.\r\n                         \r\n<b>                          MAX\r\n</b>           Oo, witty.\r\n                         \r\n<b>                          BETH\r\n</b>           Yeah, I hate Valentine's Day, too. If\r\n           you're in love, you're in love. And if\r\n           you're not, who wants to think about it?\r\n           I want to be in love so badly, don't you?\r\n                         \r\n<b>                          MAX\r\n</b>           You know, there's this joke...\r\n                         \r\n<b>                          BETH\r\n</b>           Ah, forget it, Max.\r\n                         \r\n<b>                          MAX\r\n</b>           You know the joke?\r\n                         \r\n<b>                          BETH\r\n</b>           Does a bear shit in the woods?\r\n                         \r\n<b>                          MAX\r\n</b>           Yeah, that's the one.\r\n<b>           108.\r\n</b>                         \r\n                         \r\n<b>                          BETH\r\n</b>           You told it the night of our date. I hate\r\n           that joke, Max. It's not a philosophy.\r\n                         \r\n<b>                          MAX\r\n</b>           But I think I know what it means now.\r\n                         \r\n<b>                          BETH\r\n</b>           Yeah, and it's dreary and depressing,\r\n           right?\r\n                         \r\n<b>                          MAX\r\n</b>           Not this time.\r\n                         \r\n<b>                          BETH\r\n</b>           No?\r\n                         \r\n<b>                          MAX\r\n</b><b>                          (INTIMATELY)\r\n</b>           Beth, I just want to say, before it's all\r\n           over and I don't have the chance, that\r\n           I'm sorry. For everything. Last semester\r\n           and last year.\r\n                         \r\n          Beth is speechless; she never though she'd ever hear that.\r\n                         \r\n<b>                          MAX (CONT'D)\r\n</b>           You mean the world to me, and I was an\r\n           idiot to throw it away. You were right:\r\n           if I can't be a friend to you, how could\r\n           I be a boyfriend? I've done a lot of\r\n           things wrong, and I've been confused as\r\n           hell, but I think it's time for a change.\r\n                         \r\n          Beth looks him over, as if for the first time.\r\n                         \r\n<b>                          BETH\r\n</b>           Really?\r\n                         \r\n<b>                          MAX\r\n</b>           Really.\r\n                         \r\n<b>                          BETH\r\n</b>           Then allow me to recommend a movie that\r\n           you've never seen before. It's called\r\n           Annie Hall.\r\n                         \r\n<b>                          MAX\r\n</b>           I was going to see it tonight. Do you\r\n           want to join me?\r\n                         \r\n<b>                          BETH\r\n</b>           I would love to, but I think you need to\r\n           do this alone.\r\n<b>           109.\r\n</b>                         \r\n                         \r\n                         \r\n<b>                          MAX\r\n</b>           No, you're right.\r\n                         \r\n<b>                          BETH\r\n</b>           But I'll see you later?\r\n                         \r\n<b>                          MAX\r\n</b>           Sure. After the movie, I'm doing my last\r\n           radio show. It's going to be all\r\n           requests. You should tune in.\r\n                         \r\n<b>                          BETH\r\n</b>           The end of an era.\r\n                         \r\n<b>                          MAX\r\n</b>           The start of a new one.\r\n                         \r\n          He smiles and walks away. The fog begins to obscure him.\r\n                         \r\n          Beth opens her backpack and removes a Walkman. She hits POWER\r\n          and the LED changes from TAPE to RADIO.\r\n                         \r\n           MAX (V.O.) (cont'd)\r\n           And that's how I let go of her. Although,\r\n           it's probably more honest to say that she\r\n           let go of me. Julie, Beth, and Annie.\r\n           Three women in my life and I was\r\n           desperate for one.\r\n                         \r\n          REVERSE ANGLE. Beth stands alone, watching him go. She snaps\r\n          the headphones over her ears.\r\n                         \r\n           MAX (V.O.) (cont'd)\r\n           Of course, I saw her again. It's a small\r\n           campus. The last time was at a film\r\n           festival. We're better friends now then\r\n           ever, and there's always a chance we can\r\n           have some kind of future together. So\r\n           far, so good.\r\n                         \r\n          Finally, Beth turns and walks away.\r\n                         \r\n          CUT BACK TO: Max still walking, getting smaller and smaller.\r\n          Soon all we see is fog.\r\n                         \r\n           MAX (V.O.) (cont'd)\r\n           She'll always mean a lot to me, and it's\r\n           nice to run into her and reminisce about\r\n           what we, ya know, went through. It was a\r\n           weird period of my life. I mean, shit, I\r\n           really got off track there, didn't I?\r\n                         \r\n<b>           FADE TO BLACK\r\n</b><b>                          \r\n</b>\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Burning-Annie.jpg\"/>\n</td><td><h1>Burning Annie</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Zack Ordynans\" title=\"Scripts by Zack Ordynans\">Zack Ordynans</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Romance\" title=\"Romance Scripts\">Romance</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Burning Annie Script.html#comments\" title=\"Burning Annie comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:01:35.703106"}