{"title": "Butterfly Effect, The", "film_link": "/Movie Scripts/Butterfly Effect, The Script.html", "script_link": "/scripts/Butterfly-Effect,-The.html", "info_raw": "\n\nButterfly Effect, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.13 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  J. Mackye Gruber  Eric Bress\nGenres  Drama  Thriller  Fantasy\nMovie Release Date : January 2004\n\nRead \"Butterfly Effect, The\" Script\n\n\n", "script": "\n                                  \"THE BUTTERFLY EFFECT\"\n\n                                      Screenplay by\n\n                              J. Mackye Gruber & Eric Bress\n\n                                      SHOOTING DRAFT\n\n                \n\n               INT. SUNNYVALE - DOCTOR'S OFFICE - NIGHT - 2002\n\n               EVAN, 20, good-looking but with dark haunted eyes, frantically \n               hides himself in an unlit Doctor's office. His face and chest \n               are covered in blood. He holds his forehead in pain.\n\n               FLASHLIGHT BEAMS stab through the darkened corridor hunting \n               for him. ALARMS SOUND. GUARDS are heard shouting to each \n               other. Evan grabs a cardboard box and hides under a doctor's \n               desk. He grabs some paper and begins writing in shorthand.\n\n                                     EVAN\n                              (as he writes)\n                         If anyone finds this, then I guess \n                         my plan didn't work and I'm already \n                         dead...\n\n               He takes a deep breath.\n\n                                     EVAN\n                         But if I can just go back to the \n                         beginning of all this, I still might \n                         be able to save her.\n\n               Fatigue overwhelms him, but he continues writing...\n\n               INT. BUSY HOSPITAL CORRIDOR - DAY - 1982\n\n               TITLE: TWENTY YEARS EARLIER\n\n               ANDREA TREBORN, twenty-five, an attractive pregnant woman \n               strapped to a gurney, is rolled down a busy hospital corridor. \n               She is clearly ready to give birth, and as she flails her \n               arms, she knocks another patient's IV bottle into the wall.\n\n               INT. BUSY HOSPITAL - RECOVERY ROOM - SUPER 8 FOOTAGE - 1982\n\n               A tearful Andrea holds newborn EVAN in her hands.\n\n               TITLE SEQUENCE OVER SUPER-8 MONTAGE INCLUDING:\n\n               INT. BUSY HOSPITAL - RECOVERY ROOM - DAY - 1982\n\n               Smiling Andrea holds baby Evan up to the camera, then places \n               him in a crib.\n\n               EXT. PLAYGROUND - DAY - 1983\n\n               A playground. Evan's father, JASON (23), puts a 1-year old \n               on a slide.\n\n               EXT. LENNY'S HOUSE - DAY - 1987\n\n               A birthday party for LENNY, 5, a chubby kid with only a few \n               friends. Evan, now 5, is gently prodded by Andrea toward \n               KAYLEIGH, 5, a quiet sweet-looking girl with beautiful hair.\n\n               Evan clumsily shakes her hand and she quickly leans over and \n               kisses his cheek.\n\n               He blushes and runs to hug his mother's leg.\n\n               END MONTAGE & TITLES.\n\n               EXT. ANDREA'S HOUSE - EARLY MORNING - 1989\n\n               In the driveway, 7-year old Evan plays with CRICKETT, a frisky \n               cocker spaniel puppy.\n\n               Andrea, wearing a mechanic's jumpsuit, works impatiently on \n               the carburetor of a Toyota Celica. Evan pets the dog as he \n               watches his mother work.\n\n                                     ANDREA\n                         Okay, okay... what now?\n\n               Evan quickly eyes the situation and grabs the 5/16\" wrench \n               from the toolbox.\n\n                                     EVAN\n                         We're gonna be late again.\n\n                                     ANDREA\n                         When did you ever care about getting \n                         to school on time?\n\n                                     EVAN\n                         We're putting up pictures for Parent's \n                         Night.\n\n               Evan impatiently watches Andrea turn the bolt.\n\n                                     EVAN\n                         Righty-tighty, lefty-lucy.\n\n                                     ANDREA\n                         Thanks. Don't worry Evan, you'll \n                         have plenty of time.\n\n               The carburetor will not set properly. She bangs on it with \n               the wrench.\n\n                                     ANDREA\n                              (re: carb)\n                         Darn it!\n\n                                     EVAN\n                         Um... can dad come this time?\n\n                                     ANDREA\n                              (getting impatient)\n                         You know the answer to that.\n\n                                     EVAN\n                         Can't he come out for one day?\n\n                                     ANDREA\n                         We've been over this a hundred times. \n                         It's too dangerous for him.\n\n                                     EVAN\n                         But Lenny said that his dad's \n                         coming... and Tommy and Kayleigh's \n                         dad...\n\n               Andrea hands the wrench to Evan.\n\n                                     ANDREA\n                         Here, Ev... Finish this up for me.\n\n               Evan beams as he climbs onto the bumper and screws the carb \n               back together.\n\n               Andrea, meanwhile, strips off her coveralls, revealing a \n               spotless nurse's uniform underneath.\n\n                                     EVAN\n                         All the dads are gonna be there.\n\n                                     ANDREA\n                         I get the point, kiddo. But I'm not \n                         so bad, am I?\n\n                                     EVAN\n                         No.\n\n                                     ANDREA\n                         Good. Because I've been waiting to \n                         see your art projects all week and \n                         I'd feel terrible if all you thought \n                         about was your father not being there.\n\n               Evan, disappointed, passes the wrench back to Andrea.\n\n                                     EVAN\n                              (beat)\n                         Done. Try it.\n\n               Andrea gets behind the wheel. She turns the ignition and the \n               engine roars to life. Evan wears a proud smile.\n\n                                     ANDREA\n                         You're amazing, kiddo.\n\n               EXT. SCHOOL PARKING LOT - MORNING - 1989\n\n               Andrea races through the school zone and heads for the main \n               doors. Evan's already got the car door open and his foot on \n               the ground by the time the car skids to a halt. Andrea checks \n               her watch.\n\n                                     ANDREA\n                         Okay have a great day I love you \n                         I'll pick you up later gotta go...\n\n               Evan blows Andrea a kiss goodbye and runs into the school. \n               As Andrea pulls away, MRS. BOSWELL, 35, taps the car window.\n\n                                     MRS. BOSWELL\n                         Mrs. Treborn! I need to speak with \n                         you!\n\n                                     ANDREA\n                         I'm sorry, but can it wait til \n                         tonight? I'm already late for work --\n\n               Mrs. Boswell's morbid expression stops Andrea.\n\n                                     MRS. BOSWELL\n                         I think you really need to see this.\n\n               INT. ELEMENTARY SCHOOL - CLASSROOM - MOMENTS LATER\n\n               The classroom is filled with screaming, running children. \n               Mrs. Boswell enters the classroom with Andrea and immediately \n               calls out to TOMMY, a tough seven-year old kid who swings a \n               whiffle bat at LENNY, now seven, a sniffling, chubby kid.\n\n                                     MRS. BOSWELL\n                         TOMMY! LEAVE LENNY ALONE! DON'T MAKE \n                         ME SEND YOU TO MR. VOYTEK'S OFFICE!\n\n               Evan is surprised to see his mother enter with Mrs. Boswell, \n               but continues playing with Kayleigh, now seven, a quiet, \n               sweet-looking girl.\n\n               Mrs. Boswell leads Andrea over to the teacher's desk.\n\n                                     MRS. BOSWELL\n                         I was going to show this to the \n                         principal, but I wanted to talk to \n                         you first.\n\n                                     ANDREA\n                         What is it?\n\n                                     MRS. BOSWELL\n                         Yesterday I had all the children \n                         draw pictures of what they wanted to \n                         be when they grew up. Most of them \n                         made drawings of what their parents \n                         did, but this...\n\n               Mrs. Boswell opens the bottom drawer of her desk and pulls \n               out a drawing. Andrea turns to stone when she sees it.\n\n                                     ANDREA\n                         I don't understand... Evan did this?\n\n               The drawing shows a child holding a bloody knife while \n               standing on a heap of dead bodies. It's extremely \n               sophisticated for a seven-year old. Some of the corpses have \n               been cut open and the insides are surprisingly anatomically \n               correct.\n\n               Andrea sees Evan playing with Lenny, harmless as a bunny, \n               and struggles to control her concern.\n\n                                     ANDREA\n                         Thank you for showing it to me first. \n                         I'll... I'll take care of it. Can I \n                         have the picture?\n\n                                     MRS. BOSWELL\n                         Of course. There is one more thing, \n                         Mrs. Treborn. And I feel bad for \n                         mentioning it...\n\n                                     ANDREA\n                         What?\n\n                                     MRS. BOSWELL\n                         When I asked Evan about his drawing, \n                         well, he didn't remember doing it.\n\n               Andrea is visibly shaken now.\n\n                                     ANDREA\n                         I have to go.\n\n               EXT. SCHOOL PARKING LOT - LATER\n\n               Andrea seems so impacted by this revelation that she cannot \n               even start the car.\n\n               INT. ELEMENTARY SCHOOL - LATER\n\n               The children hang artwork on the walls in prep for Parent's \n               Night. Each child has a picture of his or her family made \n               from colored construction paper and macaroni. Evan's picture \n               (no longer sophisticated) depicts his mother, Crockett and \n               himself on a green hill. Tommy and Kayleigh's pictures each \n               show two kids and a single father. And their 'mother' is \n               stuck to the far end of page.\n\n               Lenny beams as he pins-up his picture of an ideal nuclear \n               family. He looks at Tommy's picture and is confused.\n\n                                     LENNY\n                         You put the mommy too far away. Mrs. \n                         Boswell has macaroni and glue if you \n                         wanna fix it.  \n\n                                     TOMMY\n                         You're such a retard!\n\n                                     KAYLEIGH\n                         Mommy lives far away but she comes \n                         and visits.\n\n                                     LENNY\n                              (to Tommy)\n                         If I'm retarded, why didn't my mommy \n                         move away from me?\n\n               Tommy gets upset. He swipes his hand down Lenny's picture \n               and his macaroni \"mother\" crumbles to the floor. Lenny begins \n               to cry.\n\n                                     EVAN\n                         Hey, what'd you do that for?\n\n                                     TOMMY\n                         Fat little baby, crying for mommy.\n\n               Evan takes the ruined picture and leans down next to Lenny.\n\n                                     EVAN\n                         Come on, Lenny. It's not that bad. \n                         You can still see your mom a little.\n\n               Lenny, unable to stop crying, begins hyperventilating out of \n               control. His desperate gasps for breath are frightening.\n\n               Evan, scared, looks around for Mrs. Boswell, but cannot find \n               her. He reaches up to his own picture and quickly tears his \n               own macaroni \"mother\" apart and places it over Lenny's \n               picture. It's a nuclear family again. Lenny slowly is able \n               to catch his breath.\n\n                                     LENNY\n                              (grateful)\n                         Can... can... Can I have this?\n\n                                     EVAN\n                         Sure. I was gonna make a new one, \n                         anyway.\n\n               Kayleigh helps Lenny glue a new \"mother\" in place and she \n               smiles gratefully at Evan.\n\n               As Evan smiles back at Kayleigh, Mrs. Boswell calmly enters \n               the room in time to see Evan tacking up his butchered family \n               portrait. She shivers.\n\n               EXT. SUNNYVALE INSTITUTION - DAY - 1989\n\n               Gothic. Imposing. Andrea runs up the stairs.\n\n               INT. SUNNYVALE - DR. REDFIELD'S OFFICE - CONTINUOUS\n\n               DR. HARLON REDFIELD, 40, a handsome and extremely genial \n               man, scrutinizes a disturbing drawing.\n\n                                     DR. REDFIELD\n                         And you say he doesn't remember any \n                         of it?\n\n                                     ANDREA\n                              (anxious)\n                         Not according to his teacher. It \n                         just got me thinking about Jason and \n                         what if Evan's inherited his father's \n                         condition?\n\n                                     DR. REDFIELD\n                         Hold it, hold it, Andrea. Let's not \n                         jump to conclusions. I'll run some \n                         preliminary tests, see what we can \n                         rule out.\n\n               Andrea nods and forces a thankful smile.\n\n                                     DR. REDFIELD\n                         Tell you what, bring Evan here tonight \n                         and we'll run a CAT-scan series.\n\n               EXT. SUNNYVALE INSTITUTION - NIGHT\n\n               The looming building looks even more frightening at night. \n               Andrea and Evan head up the stairs.\n\n                                     EVAN\n                         I don't like this place, Mom. It's \n                         creepy. Please can we go? I promise \n                         I won't make any more bad pictures!\n\n                                     ANDREA\n                              (lighthearted)\n                         You'll be fine. Dr. Redfield just \n                         wants to give you some tests. You'll \n                         like him.\n\n               INT. SUNNYVALE INSTITUTION - NIGHT\n\n               Andrea leads Evan into Dr. Redfield's office. Dr. Redfield \n               warmly greets Evan at the door.\n\n                                     DR. REDFIELD\n                         Hello, Evan. It's very nice to meet \n                         you.\n                              (to Andrea)\n                         He's as handsome as his father.\n\n                                     EVAN\n                              (stunned)\n                         You know my father?\n\n               Before Dr. Redfield can answer, Andrea cuts him off.\n\n                                     ANDREA\n                         That's why I wanted you to come here, \n                         Evan. Dr. Redfield already has a \n                         background in memory loss.\n\n                                     EVAN\n                         My father has a bad memory, too?\n\n                                     DR. REDFIELD\n                              (off Andrea's look)\n                         Uh, tell you what, Evan. If it's \n                         okay with your mother, I'd like to \n                         run some tests. Nothing scary.\n\n               Evan raises an eyebrow at the doctor.\n\n                                     DR. REDFIELD\n                         Okay, it might be a little scary...\n\n               INT. LABORATORY - MOMENTS LATER\n\n               Evan looks terrified as he lies on a medical platform as a \n               series of CAT-scan images are taken. In another part of the \n               room, a distressed Andrea speaks quietly with Dr. Redfield.\n\n                                     ANDREA\n                         Just tell me that Evan doesn't have \n                         Jason's illness...\n\n                                     DR. REDFIELD\n                         Look, Andrea, I'm sure he'll test \n                         negative for brain disorders. But \n                         there's something else you can try \n                         to monitor his memory.\n\n                                     ANDREA\n                         Anything.\n\n                                     DR. REDFIELD\n                         A journal. Just have him write down \n                         everything he does.\n\n                                     ANDREA\n                         Why? What for?\n\n                                     DR. REDFIELD\n                         It could be extremely useful to jog \n                         his memory. See if he remembers \n                         anything new the next day. And I'll \n                         have the test results back in a few \n                         days.\n\n               INT. ANDREA'S HOUSE - KITCHEN - MORNING\n\n               The next morning. Evan busily writes in his new black-marble \n               mead comp book:\n\n               EVAN'S DIARY\n\n               \"Today Mommy is taking me to play with Kayley and Tommy. I \n               will mete there father and see what a real dad is like. Maybe \n               one day I will mete my Dad.\"\n\n               Andrea, meanwhile, speaks into the phone as she pours Lucky \n               Charms into a cereal bowl for Evan.\n\n                                     ANDREA\n                         Thanks, George. I really appreciate \n                         you watching him, he won't be any \n                         trouble at all.\n\n               Evan puts down the journal and eats breakfast. He separates \n               the green clovers from the cereal and drops them to the floor \n               for Crockett to nibble.\n\n                                     EVAN\n                         These'll bring you luck, Crockett.\n\n                                     ANDREA\n                              (into phone)\n                         Great. I'll see you soon.\n\n               Andrea hangs up the phone and walks into the next room.\n\n               INT. HOUSE - DAY\n\n               Andrea grabs the pocket book off the coffee table and heads \n               back into the kitchen. She drops her purse in shock when she \n               sees: Evan, in doorway, expressionless and holding a large \n               BUTCHER KNIFE by his side.\n\n                                     ANDREA\n                         Evan?\n\n               Evan sees her but remains expressionless.\n\n                                     ANDREA\n                         Evan? What are you doing with that \n                         knife?\n\n               Life suddenly springs into Evan's face. He seems stunned to \n               find himself holding the knife and drops it.\n\n                                     EVAN\n                              (scared)\n                         What happened?\n\n                                     ANDREA\n                         Honey. What were you doing with that?\n\n                                     EVAN\n                              (tears welling)\n                         I... I don't remember.\n\n               EXT. MILLER HOUSE - MORNING\n\n               Andrea, still shaken, drops Evan off at the house of GEORGE \n               MILLER, 35, a handsome athletic man with an infectious smile. \n               He approaches the car and opens the door for Evan.\n\n                                     MR. MILLER\n                         Hey, Andrea.\n                              (to Evan)\n                         Hello little man.\n\n               Andrea writes nervously on a piece of paper as Evan gets \n               out.\n\n                                     ANDREA\n                         Thanks a lot George. Here's my work \n                         number in case there are any problems.\n\n                                     MR. MILLER\n                              (lighthearted laughter)\n                         Whaddaya kidding? We're going to \n                         have a great time today, right Evan?\n\n               Andrea nods thanks and nervously drives away. Evan walks up \n               to Mr. Miller and momentarily reaches for his hand. Mr. Miller \n               flinches his hand away and chuckles at Evan.\n\n                                     MR. MILLER\n                         You waiting for an invitation? The \n                         kids are inside.\n\n               Evan appears confused for a moment at Mr. Miller's unexpected \n               rudeness, but walks inside.\n\n               INT. MILLER'S HOUSE - DAY\n\n               Evan enters the well-kept middle class home and sees his \n               classmates Kayleigh and Tommy. Kayleigh is dressed in a make-\n               shift Medieval gown and Tommy is also dressed in a period \n               costume.\n\n                                     KAYLEIGH\n                              (excited to see Evan)\n                         Evan, guess what? Dad got a new video \n                         camera and we're all gonna be in a \n                         movie.\n\n                                     TOMMY\n                         I don't think Evan gets to be in it --\n\n                                     KAYLEIGH\n                         Quit it, Tommy. Evan gets to be Robin \n                         Hood. I'm gonna be Maid Marian, and \n                         you're the Sheriff of Nottingham!\n\n                                     TOMMY\n                         I thought I was the bad guy!\n\n                                     KAYLEIGH\n                         You are, silly. He's a bad sheriff.\n\n               Mr. Miller, holding a full glass of scotch in one hand, sets \n               the circa-80's bulky video camera on a tripod and plugs it \n               into the porta-deck.\n\n                                     EVAN\n                         We're really gonna be in a movie!?\n\n                                     MR. MILLER\n                         That's right, Evan, and you get to \n                         be the star.\n\n                                     TOMMY\n                         I thought I was the star.\n\n                                     MR. MILLER\n                         Shut up, moron. Now get in your \n                         costume, Evan. And you have to \n                         promise, your bestest super-duper \n                         promise, that this will be our little \n                         secret. Think you can do that?\n\n               Evan nods and sticks his arms straight up in the air. Mr. \n               Miller downs his drink and helps Evan off with his clothes. \n               Suddenly --\n\n                                                               HARD CUT TO:\n\n               INT. MILLER'S HOUSE - BASEMENT - DAY\n\n               Evan comes to in an unfamiliar place. The rec-room/basement. \n               Evan's eyes dart from the fireplace to Mr. Miller's camera \n               lens and finally to Kayleigh, whose ashen face trembles \n               slightly.\n\n               Panic spreads across Evan's face.\n\n                                     EVAN\n                         Where am I? What happened? Where did \n                         we all go?\n\n                                     MR. MILLER\n                         Calm down, kid. Stand still.\n\n               Evan backs up and awkwardly scurries around the basement, \n               grabbing his clothes.\n\n               Panicking.\n\n                                     EVAN\n                         I was just somewhere else -- how did \n                         I get here?\n\n                                     MR. MILLER\n                         Quit acting like some retard or I'll \n                         call your mother and tell her what a \n                         naughty little shit you've been.\n\n                                     EVAN\n                         Kayleigh? What happened?\n\n               Kayleigh's eyes are unable to leave the floor. She begins \n               adjusting her disheveled clothing. Evan trembles.\n\n                                     EVAN\n                         What's wrong with me?\n\n               Tommy silently watches from the top of the basement stairs, \n               absently wringing the head off one of his sister's dolls.\n\n               INT. SUNNYVALE INSTITUTION - DAY\n\n               Dr. Redfield places Evan's CAT-scan slides on the light box. \n               Andrea squints, unable to interpret them.\n\n                                     DR. REDFIELD\n                         Well, the good news is that the \n                         results are negative. I've found no \n                         evidence in the way of lesions, \n                         hemorrhaging, tumors...\n\n                                     ANDREA\n                         And the bad news?\n\n                                     DR. REDFIELD\n                         Unfortunately, we've got nothing to \n                         work with. It's harder playing \n                         detective now.\n\n                                     ANDREA\n                         But you must have something to go \n                         on?\n\n                                     DR. REDFIELD\n                         If I had to guess, I'd say the \n                         blackouts are stress related.\n\n                                     ANDREA\n                         But he's seven. What kind of stress \n                         can he have?\n\n                                     DR. REDFIELD\n                         Plenty. Who knows? Maybe he's got \n                         severe coping problems about not \n                         having a father. Did you say the \n                         last blackout occurred when he was \n                         with his friend's dad.\n\n                                     ANDREA\n                         Come on, I doubt the answer's that \n                         simple.\n\n                                     DR. REDFIELD\n                         You'd be surprised how often they \n                         are.\n\n                                     ANDREA\n                         Well, he has been pushing me to meet \n                         his father, but I've been putting it \n                         off.\n\n                                     DR. REDFIELD\n                         It's worth a shot. I can arrange a \n                         controlled meeting. A careful dose \n                         of sedatives for Jason, some security, \n                         you and I monitoring. Evan comes in \n                         for a quick visit and with any luck, \n                         no more missing father complex.\n\n                                     ANDREA\n                         How soon?...\n\n               INT. ANDREA'S CAR - COUNTRY ROAD - DAY\n\n               Evan, dressed in his Sunday best, writes copiously in a \n               journal marked \"AGE 7.\"\n\n               EVAN'S DIARY\n\n               \"April 15. Today I get to mete my father. His name is Jason \n               and he is crazy. I hope he lets me call him dad.\"\n\n               INT. SUNNYVALE INSTITUTION - DAY\n\n               Andrea tightly grips Evan's hand as the pair follow Dr. \n               Redfield down a corridor. Evan's enthusiasm is dampened by \n               the sounds of distant screams and bloodcurdling laughter.\n\n                                     EVAN\n                         Dad lives here?\n\n                                     DR. REDFIELD\n                         Not in this wing, actually. No.\n\n                                     ANDREA\n                         Now your father may seem sleepy to \n                         you, but that's just because of his \n                         medicine, okay?\n\n                                     EVAN\n                         Okay.\n\n               They walk to the end of the corridor and come to a \"Visitor's \n               Chamber\".\n\n               Dr.Redfield leads Evan inside. Andrea begins to follow, but \n               the doctor gestures that she stay outside.\n\n               INT. SUNNYVALE - VISITOR'S CHAMBER - CONTINUOUS\n\n               Evan takes a seat at a long rectangular table. His eyes are \n               fixated on the door on the other side of the room. Finally, \n               a dark figure can be seen through the opaque glass.\n\n               JASON, thirty and haggard looking, enters the room. His eyes \n               want to sparkle at seeing his son for the first time. But \n               tranquilizers have dulled the effect.\n\n               Evan's eyes fixate on the leg-restraints and handcuffs that \n               hinder Jason's movement. Finally Jason sits.\n\n               He smiles warmly and speaks in over-enunciated tones.\n\n                                     JASON\n                         It's okay. I won't bite. You've seen \n                         pictures of me, right?\n\n                                     EVAN\n                         Uh-huh. Mom says I have your eyes \n                         and your --\n\n                                                              SMASH CUT TO:\n\n               INT. SUNNYVALE - VISITOR'S CHAMBER - DAY\n\n               Evan \"comes to\" in another unfamiliar place. Rather than \n               seeing his father across a table, he's looking up at a \n               ceiling.\n\n               Blocking his view of the ceiling is Jason, whose face is now \n               monstrous with rage, and whose cuffed hands are wrapped around \n               Evan's throat, choking the life out of him.\n\n                                     JASON\n                              (through clenched \n                              teeth)\n                         I... love... you.\n\n               Suddenly, ORDERLIES tackle Jason from both sides and wedge a \n               baton under his jaw to wrench him away. Andrea frantically \n               struggles to rescue Evan from Jason's clutches.\n\n                                     JASON\n                              (panicking)\n                         He has to die! You don't understand! \n                         It's the only way to stop it!\n\n               Jason wrestles the baton from under his chin, hits an orderly \n               in the kneecap and comes for Evan with the baton!\n\n               Orderly #2 acts quickly, beating Jason with his baton. As \n               Jason makes another desperate grab for Evan, Orderly #2 is \n               forced to bash him in the skull. Down for the count.\n\n               Andrea hugs Evan, now in shock.\n\n                                     ANDREA\n                         I'm sorry, Evan. I'm sorry.\n\n               And ALARM sounds and Andrea tries to cover Evan's eyes, but \n               through her fingers he can see a quick blur of a pool of \n               blood spreading from Jason's head.\n\n                                                             FADE TO BLACK:\n\n               FADE IN:\n\n               EXT. CEMETERY - DAY - 1989\n\n               Dressed in black, Andrea and Evan watch Jason's casket being \n               lowered into the ground. Andrea's tears soak through her \n               veil. A few feet back, Kayleigh stands behind Evan.\n\n                                     PRIEST\n                         Ashes to ashes... dust to dust.\n\n               Evan watches the coffin descend, disappearing from sight. \n               Kayleigh steps up to Evan and takes his hand. A moment. And \n               she softly whispers in Evan's ear.\n\n                                     KAYLEIGH\n                         You're better off anyway.\n\n               A rumble of thunder. Evan looks up at the brooding dark \n               clouds.\n\n               EXT. CEMETERY - DUSK\n\n               Gray skies. Andrea drives the children home. Evan stares at \n               the passing tombstones that flutter by like a white picket \n               fence. The flickering strobe effect that intensifies into a \n               white blur is hypnotic.\n\n                                                        SLOWLY DISSOLVE TO:\n\n               EXT. MILLER'S HOUSE - DAY - 1995\n\n               Bright and sunny. The lawn freshly cut. A Toro lawnmower has \n               been carelessly left in the grass-strewn driveway.\n\n               TITLE: SIX YEARS LATER\n\n               CRANE DOWN to the window of the --\n\n               INT. MILLER'S HOUSE - BASEMENT\n\n               Evan, Kayleigh, Tommy and Lenny are now THIRTEEN. Evan exhales \n               cigarette smoke, taps his ash and finishes sketching a \n               portrait of Kayleigh in his journal.\n\n               Tommy wears a leather jacket and now has traces of peach \n               fuzz on his upper lip.\n\n               Kayleigh's hair is longer now, albeit stringy and unkempt.\n\n               Evan closes his journal and coolly ignites a STRIKE-ANYWHERE \n               MATCH with his thumb and lights Kayleigh's cigarette. Everyone \n               but Lenny smokes in the basement.\n\n               Tommy, now with longer hair, ransacks his father's army locker \n               looking for something.\n\n                                     EVAN\n                         Tommy, I'm bored shitless over here. \n                         What's up already?\n\n                                     TOMMY\n                         Hold your horses, man. It's here \n                         somewhere. I saw it when I was a \n                         kid.\n\n               Tommy absently chucks an old Playboy toward Lenny. Kayleigh \n               seems uncomfortable by the sight of it.\n\n                                     KAYLEIGH\n                              (to Tommy)\n                         We should go soon. If Dad catches us \n                         smoking down here, we're dead.\n\n                                     EVAN\n                         So let's go. This place creeps me \n                         out.\n\n               Evan claps his hands and stands up, Lenny and Kayleigh join \n               him. Finally, Tommy shakes an old army thermos and hears \n               something rattling inside.\n\n                                     TOMMY\n                         I knew it had something to do with \n                         the army.\n\n               Tommy opens the thermos, tips it over and a blockbuster (1/4 \n               stick of dynamite) spills out. Tommy grins mischievously.\n\n                                     TOMMY\n                         Let's blow the shit out of something!\n\n               EXT. HALPERNS' FOREST - DAY\n\n               Tommy leads Evan, Kayleigh and Lenny on a mission through \n               the woods. Everyone smokes except Lenny, yet he's the only \n               one who's wheezing. He pulls out an inhaler and takes a puff.\n\n                                     LENNY\n                         Guys, slow up, would you?\n\n                                     KAYLEIGH\n                         Evan, did I tell you? My mother said \n                         I might be able to visit her this \n                         summer in Orlando with her new family.\n\n                                     TOMMY\n                         What did I say about mentioning that \n                         bitch?\n\n                                     KAYLEIGH\n                              (uncomfortable)\n                         Where the hell are you taking us \n                         anyway? Just blow something up \n                         already.\n\n                                     TOMMY\n                         Just blow something up? Are you nuts? \n                         There's an art to mass destruction. \n                         Would you just paint the Mona Lisa? \n                         No. Besides, we're here already.\n\n               Now at the edge of the woods, Tommy spots:\n\n               EXT. MRS. HALPERN'S HOME - CONTINUOUS\n\n               A MAILBOX sits at the end of the driveway. It's exquisite. \n               An exact replica of a Colonial home it serves.\n\n               Across the street, Tommy hands the blockbuster to Lenny.\n\n                                     TOMMY\n                         Here you go, buddy.\n\n                                     LENNY\n                              (recoiling)\n                         What? No frigging way, man. I'm not \n                         touching that thing.\n\n                                     TOMMY\n                         The hell you aren't. Anyone of us \n                         does it, you'll puss out and narc \n                         for sure.\n\n                                     LENNY\n                         Ain't gonna work this time, buddy. \n                         Look how small that fuse is! I'll \n                         get killed.\n\n                                     EVAN\n                         Not necessarily.\n\n               All eyes turn to Evan as he takes his lit cigarette, breaks \n               off the filter and jams the fuse into the unlit end.\n\n                                     EVAN\n                         That should buy you ten minutes at \n                         least.\n\n                                     LENNY\n                         Gee, thanks friend.\n\n               EXT. MRS. HALPERN'S HOME - CONTINUOUS\n\n               Lenny paces back and forth next to the three-story mailbox, \n               desperately trying to appear nonchalant. He pretends to notice \n               his shoe's untied and bends down to tie it. From the woods, \n               the other kids watch anxiously.\n\n                                     TOMMY\n                         Oh, for Christ's sake, just do it, \n                         Lenny.\n\n               Finally, Lenny throws the bomb in the mailbox. Then sprints \n               like hell to the woods. Kayleigh shakes Lenny's inhaler and \n               hands it to him when he gets back.\n\n                                     LENNY\n                              (taking puff)\n                         Thanks.\n\n               Evan pats Lenny on the back.\n\n                                     EVAN\n                         You got balls, man.\n\n               The four watch the mailbox in intense anticipation. Evan \n               smiles with the cigarette pressed tightly between his lips \n               and places his hands over Kayleigh's ears. She smiles back \n               at him and presses his hands against her head. Tommy catches \n               this and seems disturbed, and quickly turns back to --\n\n               The mailbox. Tick-tock... tick-tock... It's like a staring \n               contest...\n\n                                                              SMASH CUT TO:\n\n               EXT. HALPERNS' FOREST - DAY\n\n               Evan, running full speed, comes to in an unfamiliar place. \n               He instantly loses his footing and falls to the ground. Lenny, \n               falling on top of him.\n\n                                     TOMMY\n                         Hurry! Let's go! Get him up, Evan! \n                         Come on!\n\n                                     EVAN\n                              (frantic)\n                         What happened?? Where are we?!\n\n               Evan gets up and starts running, then realizes he's not being \n               followed. Kayleigh and Tommy are helping Lenny up and carrying \n               him. Evan realizes that Lenny's completely dazed. Evan doubles \n               back, grabs Lenny's arm and he and Tommy drag Lenny through \n               the woods as fast as they can.\n\n                                     KAYLEIGH\n                              (crying)\n                         Oh God... what did we do?\n\n                                     EVAN\n                         Shit, Lenny. What's happened to you! \n                         We've gotta get help!\n\n                                                              SMASH CUT TO:\n\n               EXT. LENNY'S HOUSE - DRIVEWAY - DAY\n\n               Andrea's car screeches to the curb of Lenny's house. Lenny's \n               mother, Mrs. Kagan, frantically loads Lenny into an ambulance.\n\n               As Andrea rushes up to the ambulance, Mrs. Kagan gives her \n               an icy glare and slams the ambulance door in Andrea's face. \n               Andrea turns to Evan, now trembling on the front stoop.\n\n                                     ANDREA\n                         What is it? What happened?\n\n                                     TOMMY\n                              (staring menacingly \n                              at the others)\n                         We were just building a fort in the \n                         woods when Lenny freaked out. One \n                         minute he was fine, then he just \n                         froze up. Right guys?\n\n                                     ANDREA\n                         What happened, Evan? The truth.\n\n                                     EVAN\n                         I don't know... I don't remember.\n\n                                     ANDREA\n                         Something must've happened! What set \n                         him off?\n\n                                     EVAN\n                         I... I blacked out.\n\n                                     ANDREA\n                              (building frustration)\n                         Don't try to use your blackouts to \n                         get out of this one!\n\n               Evan looks helpless.\n\n                                     ANDREA\n                         You're not making this up, are you?\n\n               Evan shakes his head \"no\". Almost ashamed...\n\n                                                               DISSOLVE TO:\n\n               INT. DR. REDFIELD'S OFFCIE - DAY\n\n               Evan lies on a couch.\n\n                                     DR. REDFIELD\n                         With every breath you exhale, you \n                         can feel all of the tension draining \n                         from your body like water through a \n                         faucet. Nine, ten, and you're \n                         completely asleep. Relaxed.\n\n               Evan breathes slowly. Deeply. Andrea watches nervously from \n               the far side of the room.\n\n                                     DR. REDFIELD\n                         Now I want you to go back to the \n                         time you were in the woods with Lenny. \n                         Think of it like a movie. You can \n                         pause, rewind, or slow down any \n                         details you wish. Understand?\n\n                                     EVAN\n                         Yes.\n\n                                     DR. REDFIELD\n                         Where are you now?\n\n                                     EVAN\n                         I'm standing next to Kayleigh, my \n                         hands are over her ears.\n\n                                     DR. REDFIELD\n                         Are you hurting her?\n\n                                     EVAN\n                         No, protecting her.\n\n               Andrea suppresses the tiniest of proud smiles.\n\n                                     DR. REDFIELD\n                         Okay. Then go a little forward in \n                         time. What do you see now?\n\n                                     EVAN\n                         I see a car.\n\n               Evan's eyes suddenly roll back in his head.\n\n                                     DR. REDFIELD\n                         Yes, tell me about the car.\n\n               Evan moans and begins shaking.\n\n                                     DR. REDFIELD\n                         Go on. Nothing can hurt you. Remember, \n                         this is only a movie. You're \n                         completely safe.\n\n                                     EVAN\n                              (moaning)\n                         I can't... the car vanishes and all \n                         of a sudden I'm on the ground in the \n                         woods.\n\n                                     DR. REDFIELD\n                         The car doesn't vanish Evan. The \n                         movie in your head has broken, that's \n                         all. But now I've re-spliced it and \n                         I want you to tell me about the car.\n\n                                     EVAN\n                         It's coming... argh! I can't!\n\n               Evan moans and shakes on the couch.\n\n                                     DR. REDFIELD\n                         Fight it Evan. Hurry. It's coming!\n\n               Blood begins to trickle from Evan's nose as a guttural sound \n               is uttered from deep within him. Dr. Redfield bolts upright \n               in his chair and redirects the session.\n\n                                     DR. REDFIELD\n                         Okay, Evan. Listen to my voice! On \n                         the count of ten, you're going to \n                         wake up. Feeling refreshed and \n                         remembering everything we talked \n                         about.  \n\n               Evan moans in agony. Andrea darts into the room.\n\n                                     ANDREA\n                         What's happening to him?? Make it \n                         stop!\n\n               Dr. Redfield waves her away and concentrates on Evan.\n\n                                     DR. REDFIELD\n                         One. You're feeling more awake now. \n                         Two, your eyes no longer feel heavy.\n\n               Andrea moves to stop the blood flowing from Evan's nose. She \n               lifts Evan's eyelids and sees only the whites of his eyes.\n\n                                     DR. REDFIELD\n                         Five. Six. Refreshed and awake! Seven, \n                         eight. Come on, Evan, wake up, dammit!\n\n               Evan is completely non-responsive.\n\n                                     ANDREA\n                         Evan wake up, oh please wake up!\n\n                                     DR. REDFIELD\n                         Nine, ten. And you're awake! Open \n                         your eyes, dammit!\n\n               Nothing but moans and blood. Dr. Redfield frantically opens \n               some desk drawers until he finds smelling salts. He breaks a \n               small capsule under evan's mouth, pinches his bleeding nose \n               closed and lets Evan inhale the vapor through his mouth.\n\n               Evan lurches forward on the couch and falls off. Holding his \n               bloody nose.\n\n                                     EVAN\n                         What happened? Did it work?\n\n               Evan deduces the answer from everyone's horrified faces.\n\n               EXT. MULTIPLEX THEATER - PARKING LOT - DUSK\n\n               Andrea drops off Evan, Kayleigh and Tommy outside the complex. \n               Kayleigh, looking morose, shuts the car door and Andrea drives \n               off. They walk through the parking lot.\n\n                                     TOMMY\n                              (to Kayleigh)\n                         Wipe that sad-assed look off your \n                         face before you get us all busted. \n                         You see the way Evan's mom was looking \n                         at you?\n\n                                     KAYLEIGH\n                         I'm sorry.\n\n                                     EVAN\n                         Would someone just tell me already \n                         what the hell happened in the mailbox?\n\n               On \"mailbox\", Tommy suddenly grabs Evan's jacket and SHOVES \n               him against a parked car. Tommy looks around to make sure \n               nobody heard anything.\n\n                                     TOMMY\n                         Don't ever bring that shit up again. \n                         Not ever. Not to me, not to Kayleigh, \n                         or even Lenny. The stupid fuck if he \n                         ever learns to talk again. Understand?\n\n               Evan nods, scared. Tommy gives a final shove.\n\n                                     TOMMY\n                         Ever.\n                              (re: Kayleigh)\n                         She don't want to talk about it, \n                         anyway. Do you Kayleigh?\n\n               Tommy's right. Kayleigh clearly doesn't.\n\n               INT. MULTIPLEX THEATER LOBBY - DUSK\n\n               Kayleigh shuffles behind Evan and Tommy as they head toward \n               the theatre. Evan drops back.\n\n                                     EVAN\n                         Are you okay?\n\n               Kayleigh says nothing as Tommy sees the theatre playing SEVEN \n               and whispers.\n\n                                     TOMMY\n                         There it is. Let's go.\n\n               INT. ANDREA'S HOUSE - KITCHEN - NIGHT\n\n               Andrea does the dishes as the TV plays a NEWSCAST in the \n               b.g.\n\n                                     ANCHOR\n                              (on TV)\n                         ...was the grizzly aftermath of what \n                         police officials of upstate New York \n                         are calling a horrible act of \n                         vandalism gone awry.\n\n               Andrea turns to the TV, blocking our view. We can only hear \n               the report as she watches intensely.\n\n                                     ANCHOR\n                         The powerful explosion is believed \n                         to have been caused by a small \n                         quantity of dynamite.\n\n               Andrea's face looks haunted by the on-screen images. She \n               shakes her head in terror and grabs the remote.\n\n                                     ANCHOR\n                         Police thus far have no leads as to \n                         the suspects...\n\n               She clicks off the TV, trembling.\n\n               INT. MULTIPLEX THEATER - NIGHT\n\n               The movie's in progress. Evan and Kayleigh sit behind Tommy.\n\n                                     TOMMY\n                         Holy shit! Look at that fat fuck! \n                         You'd have to wipe his ass with a \n                         forklift!\n\n               Some crowd members TURN around and give Tommy a SHUSH. Tommy \n               whips M&Ms at them.\n\n                                     TOMMY\n                         Shut up, faggot. No one's talking to \n                         you!\n\n               Kayleigh, repulsed, suddenly darts from the aisle and runs \n               out. Evan follows.\n\n               INT. LOBBY - CONTINUOUS\n\n               Evan follows her to a small alcove.\n\n                                     EVAN\n                         I'm sorry Kayleigh. This was a bad \n                         idea.\n\n                                     KAYLEIGH\n                         You really don't remember anything \n                         that happened?\n\n               Evan shakes his head \"no\". She looks devastated.\n\n                                     KAYLEIGH\n                         You're so lucky.\n\n               She begins to cry. Evan makes sure no one's staring.\n\n                                     EVAN\n                         It's going to be okay. Lenny'll be \n                         fine. You'll see.\n\n               He reaches to comfort her. But she winces.\n\n                                     KAYLEIGH\n                         Ouch.\n\n                                     EVAN\n                         I'm sorry.\n\n               She pulls her sleeve up, revealing a large bruise.\n\n                                     KAYLEIGH\n                         It's not your fault. Mrs. Kagan called \n                         dad and blamed us for what happened \n                         to Lenny.\n\n                                     EVAN\n                         Damn. Your dad did this?\n\n               Kayleigh pulls back her shirt collar to show an even larger, \n               darker bruise.\n\n                                     KAYLEIGH\n                              (looking down)\n                         I deserve a lot worse.\n\n                                     EVAN\n                         What are you talking about? What you \n                         deserve is a better brother and \n                         father. All they do is make you feel \n                         like shit.\n\n               She looks into his eyes.\n\n                                     EVAN\n                         You really have no clue how beautiful \n                         you are, do you?\n\n               She searches his eyes for sincerity. And finds it. They lean \n               into each other for a TENDER KISS. After a moment, a ROAR \n               from nearby.\n\n                                     TOMMY (O.S.)\n                         What the fuck are you doing??\n\n               They jerk back to see Tommy, shocked and betrayed, staring \n               at them from across a small crowd. By now, some teens chuckle \n               at Tommy.\n\n                                     TEEN PUNK (O.S.)\n                         Buying popcorn, what the fuck are \n                         you doing?\n\n               Tommy rushes through the small crowd at Evan. His hands in \n               fists. Suddenly a FOOT reaches out and trips Tommy. Tommy \n               falls to the floor and the crowd cackles at him.\n\n               Tommy slowly gets up, locks eyes with Evan. Hatred oozing.\n\n               Evan looks guilty, weakly shaking his head, it's not what \n               you're thinking.\n\n               Tommy suddenly lunges at the TEEN PUNK who must be at least \n               a foot taller than he is. Tommy lands a flurry of punches \n               before the Teen Punk can even defend himself, frequently \n               taking opportunities to eyeball Evan.\n\n               Evan, Kayleigh and even the punk's FRIENDS look on helplessly \n               when TWO SECURITY GUARDS SEIZE TOMMY. Tommy valiantly \n               struggles against them at first. But the moment he realizes \n               it's hopeless, he allows his body to go slack.\n\n               As Tommy is being dragged away, he turns to Evan, a sick \n               smile on his face.  Evan and Kayleigh look back, speechless.\n\n               INT. ANDREA'S CAR - NIGHT\n\n               Andrea drives through the winding roads.\n\n               CLOSE UP\n\n               Andrea's eyes. Tormented.\n\n               REVEAL she's driving Evan and Kayleigh home. Evan's up front \n               and Kayleigh sits behind them. Everyone silent.\n\n               Andrea stares through the rearview mirror into Kayleigh's \n               eyes. Probing. Searching.\n\n                                     ANDREA\n                         So how was the movie?\n\n                                     KAYLEIGH\n                         Okay.\n\n               Andrea watches Kayleigh. A calculated beat.\n\n                                     ANDREA\n                         Any exploding mailboxes?\n\n               Kayleigh flinches at the question. And Andrea catches it. \n               Evan can't help but look back at Kayleigh. Oh my god, she \n               knows.\n\n                                     KAYLEIGH\n                              (faking poorly)\n                         What do you mean?\n\n               Andrea pulls the car over and stops. After a moment, Kayleigh \n               realizes she's at her house. She exits the car in a hurry.\n\n                                     ANDREA\n                         Goodnight.\n\n               Andrea stares at Evan, who keeps his eyes facing dead ahead. \n               She finally shifts the car into gear.\n\n                                     ANDREA\n                         We're moving.\n\n               Evan says nothing.\n\n                                                             FADE TO BLACK:\n\n               EXT. ANDREA'S HOUSE - MORNING\n\n               A \"For Sale\" sign is now planted on the front lawn. Andrea, \n               in her nurse uniform, exits the house to her car.\n\n               INT. ANDREA'S LIVING ROOM - CONTINUOUS\n\n               Evan discreetly watches her leave through the window. Grabs \n               his coat and exits frame.\n\n               EXT. LENNY'S HOUSE - DAY\n\n               Kayleigh and Evan walk down toward the house.\n\n                                     EVAN\n                         I can't believe Tommy's still pissed \n                         at me. He knows I'm moving away, \n                         right?\n\n                                     KAYLEIGH\n                         He's been acting real strange lately. \n                         He won't even look me in the eyes \n                         anymore.\n\n                                     EVAN\n                         Duck, here they come.\n\n               As a station wagon rolls up the street, Evan and Kayleigh \n               duck in nearby bushes.\n\n                                     KAYLEIGH\n                         Did your mom say if Lenny was... \n                         okay?\n\n                                     EVAN\n                         He must be. They're letting him go, \n                         right?\n\n               The station wagon finally heads into the driveway. Evan puts \n               on a smile and charges the car, pounding the window.\n\n                                     EVAN\n                         Welcome home, Lenny!\n\n               Inside the car, Lenny jerks back in horror. Mrs. Kagan looks \n               angry as she rolls the window down.\n\n                                     MRS. KAGAN\n                         I think your little homecoming's in \n                         bad taste.\n\n               The smile fades from Evan's face. Kayleigh hangs back.\n\n                                     EVAN\n                         Sorry?\n\n                                     MRS. KAGAN\n                              (acidic)\n                         Lenny's been through a hell of an \n                         ordeal no thanks to you.\n\n               Evan and Kayleigh look guilty as the garage door opens up \n               and Mrs. Kagan continues into the garage.\n\n               INT. LENNY'S BEDROOM - CONTINUOUS\n\n               Alone, Lenny concentrates on a MODEL AIRPLANE. There is a \n               sudden KNOCK at the window. Lenny's head jerks around to see \n               Evan and Kayleigh smiling through the window.\n\n               EXT. LENNY'S WINDOW - CONTINUOUS\n\n               Evan and Kayleigh stand on the ivy-covered trellis.\n\n                                     EVAN\n                              (quietly)\n                         Welcome home. Thought you might like \n                         some fresh air for a change.\n\n                                     KAYLEIGH\n                         Hi, Lenny.\n\n               Lenny twitches ever-so-slightly.\n\n                                     LENNY\n                         Is Tommy with you guys?\n\n               Evan shakes his head \"no\".\n\n                                     EVAN\n                         It's cool.\n\n               Lenny looks back at the model airplane. Needs to think.\n\n               EXT. JUNKYARD WOODS - DAY\n\n               Evan, Lenny and Kayleigh pass a junk pile in the woods.\n\n                                     KAYLEIGH\n                              (to Lenny)\n                         So what did you do in there?\n\n                                     LENNY\n                         It was awful. You can't sleep 'cause \n                         everyone's screaming all night long. \n                         I never want to go back.\n\n               As Evan and Kayleigh absorb this in silence, they see a column \n               of smoke billowing in the horizon.\n\n                                     KAYLEIGH\n                         Do you see that?\n\n               Evan and Kayleigh run toward the smoke. Lenny nervously \n               follows behind.\n\n               They exit the woods to find:\n\n               EXT. JUNKYARD - CONTINUOUS\n\n               Tommy has stuffed a dog into a gunny sack which he douses \n               with lighter fluid.\n\n               Next to a campfire.\n\n                                     EVAN\n                         Crockett!!\n\n               Evan and Kayleigh rush toward the trapped, helpless dog. \n               Tommy is ready for them. He drops the lighter fluid, picks \n               up a wooden plank and SWINGS! Evan ducks back at the last \n               minute and Tommy accidentally connects with Kayleigh's head.\n\n               Knocking her unconscious.\n\n                                     TOMMY\n                         Look what you made me do!\n\n                                     EVAN\n                         What's wrong with you?!\n\n               Tommy, enraged, fakes a high swing, then goes for Evan's \n               knee cap. BASH! Evan doubles over in pain and falls to the \n               ground, clutching his knee. Tommy moves to the fire, Crockett \n               squirming inside the bag and picks up the lighter fluid.\n\n               Evan painfully looks up from the ground and his eyes dart \n               from the sight of Kayleigh, unconscious, to Crockett, trapped \n               in the tied gunny sack.\n\n                                     EVAN\n                         Kayleigh! Wake up!\n\n               No response.\n\n                                     TOMMY\n                         Why don't you fucking kiss her, Prince \n                         Charming!\n\n               Tommy squeezes the bottle hard, creating a flaming fuse from \n               the campfire to the fluid soaked dog.\n\n               As the flames near Crockett, Evan, seething with rage, stands \n               up with clenched fists and CHARGES Tommy at FULL SPEED --\n\n                                                              SMASH CUT TO:\n\n               EXT. JUNKYARD - DAY\n\n               Evan comes to in an unfamiliar place. Still in running mode. \n               His body contorts spastically like a fish on land, since he \n               is now lying face down on the ground.\n\n               Evan regains himself and sits up painfully. His face is badly \n               bruised and he clutches his battered ribs.\n\n                                     EVAN\n                         How long was I out?\n\n               He gets no answer from Lenny, who stands in the exact same \n               spot. Tommy is nowhere in sight and the sound is of Kayleigh \n               weeping. Evan spins to face her.\n\n                                     EVAN\n                         Kayleigh?! Are you okay? Where's \n                         Crockett?\n\n               Kayleigh, her knees drawn tightly to her chest, is unable to \n               answer through her tears. Evan struggles to rise but he \n               becomes dizzy and falls back to the ground.\n\n               Evan takes a quick glance toward the gunny sack, smouldering \n               then moans and buries his head in his hands.\n\n               EXT. LENNY'S HOUSE - DAY\n\n               A small neighborhood CROWD has gathered to watch an ambulance \n               with the SUNNYVALE insignia take an entranced Lenny away. \n               Mrs. Kagan is about to climb in the rear when she stops and \n               turns to Evan.\n\n                                     MRS. KAGAN\n                              (ice cold)\n                         Do you know what you are? A monster.\n\n               Evan stands there, speechless.\n\n               EXT. ANDREA'S HOUSE - DAY\n\n               A packed U-HAUL sits in front of Evan's house. Andrea shifts \n               the small truck into gear and slowly pulls out.\n\n               Outside the truck, Kayleigh waves to Evan, tears spilling \n               shamelessly down her cheeks. Evan reaches behind his seat \n               and opens a large cardboard box. It is filled with past \n               journals. He finds the most recent journal, uncaps a pen and \n               writes something.\n\n               Finished he presses the journal to the window.\n\n               EVAN'S DIARY\n\n               \"I'll come back for you.\"\n\n               Evan waves back to her, trying nonchalantly to wipe away his \n               own tears as she fades into the distance.\n\n               When Kayleigh disappears from sight, Andrea looks over to \n               see what he's written.\n\n                                     ANDREA\n                         I'm sorry.\n\n               Evan returns the journal and begins writing furiously.\n\n                                                          SLOW DISSOLVE TO:\n\n               INT. COLLEGE CLASSROOM - DAY - 2002\n\n               TITLE: SEVEN YEARS LATER\n\n               Evan, twenty now, continues writing in a college Blue Book. \n               He is older, dressed down in worn jeans, T-shirt and plaid \n               flannel. He closes the Blue Book with a cocky grin just as \n               PROFESSOR CARTER, 40, calls out to the class:\n\n                                     PROFESSOR CARTER\n                         Time! Please place your blue books \n                         on my desk before you leave.\n\n               Evan grabs his psychology textbook from under his seat, gets \n               up and turns in his exam.\n\n                                     PROFESSOR CARTER\n                         How'd you do, Evan?\n\n               Evan flashes a confident smile.\n\n                                     EVAN\n                         I'm not sure. I might have gotten \n                         some stories mixed up. Did Pavlov \n                         condition his dogs to lick his nuts?\n\n                                     PROFESSOR CARTER\n                              (laughing)\n                         Typical psych major. A complete wise \n                         ass. And how's your project coming? \n                         Still planning to change the way we \n                         humble scientists view memory \n                         assimilation?\n\n                                     EVAN\n                              (shrugging)\n                         Hey, I got no choice.\n\n               Professor Carter nods solemnly, obviously in the know.\n\n               EXT. COLLEGE - QUAD - DAY\n\n               Evan bikes past students.\n\n               EXT. COLLEGE - FRAT HOUSE - DAY\n\n               Evan bikes past some obnoxious GREEKS.\n\n               EXT. COLLEGE - EVAN'S DORM - DAY\n\n               Evan docks his bike and carries his knapsack inside.\n\n               INT. EVAN'S DORM - MOMENTS LATER\n\n               Evan's dorm is cluttered \"double\" whose walls are adorned \n               with head-shop posters of Gothic rock bands.\n\n               By Evan's bed is a bookshelf filled with books on amnesia, \n               memory loss, fugues, hypnotism and other related bands.\n\n               Evan's roommate, THUMPER, 19, is a completely punked out \n               Gothic boy who weighs 300 pounds. He currently hands a black \n               lacy dress to CRICKET, 17, a pierced Goth co-ed. She slips \n               the tattered dress on as Thumper wipes his post-coital self \n               off with a black tee-shirt.\n\n               Evan barges through the door, throwing his pscyh books on \n               the bed and politely looking away from the half-naked girl.\n\n                                     EVAN\n                         Whoa. Smells like patchouli and... \n                         ass.\n\n               Evan opens the window and checks out his Psych project: a \n               small maze has several flatworms at one end and a bowl of \n               cornflakes at the other.\n\n                                     THUMPER\n                         Cricket, meet my well-mannered \n                         roommate, Evan.\n\n               Cricket puts on her Doc Martens as Evan watches the worms.\n\n                                     CRICKET\n                         Yeah, you're the one who fucked up \n                         the bell-curve on my Anthropology \n                         final. Later, Thumper.\n\n                                     EVAN\n                         Nice to meet you, too.\n\n               As she leaves, Thumper takes the black T-shirt by his wallet \n               and throws it on Evan's bed.\n\n                                     THUMPER\n                         Here, bro. Found your T-shirt.\n\n               Evan nods thanks, picks up his journal. Reads something and \n               smiles.\n\n                                     EVAN\n                         Get dressed, Thumper, you're taking \n                         me out for my birthday.\n\n                                     THUMPER\n                         I thought you were a December baby.\n\n                                     EVAN\n                         This is bigger. Seven years to the \n                         day. No blackouts.\n\n               Thumper pulls out a bong.\n\n                                     THUMPER\n                         Let's do this.\n\n               EXT. DIRTY HANK'S BAR - DAY\n\n               INT. DIRTY HANK'S BAR - CONTINUOUS\n\n               A popular watering hole. A dark rustic interior, blasting \n               alternative rock.\n\n               Plenty of underage students carry pitchers of beer to their \n               tables.\n\n               Evan and Thumper play pool against two young women. HEIDI, \n               beautiful, wears ripped jeans, no make up. She sinks the \n               eleven ball off the rail. KRISTEN coolly smokes a cigarette, \n               confident that she and Heidi will hold the table.\n\n                                     KRISTEN\n                         So... which one of you has a pet \n                         worm?\n\n               Thumper proudly steps forward.\n\n                                     THUMPER\n                         Worms, plural.\n\n                                     KRISTEN\n                         That's so gross.\n\n               Thumper steps back, points to Evan.\n\n                                     THUMPER\n                         Talk to him about it, he's got the \n                         fetish.\n\n               Heidi sinks another ball and looks up at Evan strangely.\n\n                                     EVAN\n                         Actually, they're for a psych project. \n                         A study on memory.\n\n               Heidi misses her shot and passes the cue to Evan.\n\n                                     HEIDI\n                              (stifling a yawn)\n                         Shit, better explain before all the \n                         excitement gives me a heart attack.\n\n               Evan speaks as he knocks the one-ball in the corner pocket. \n               As he talks, at a table behind them, some obnoxious Greeks, \n               including HUNTER, SPENCER, and GWEN make fun of Thumper.\n\n                                     EVAN\n                         It's an experiment with flatworms \n                         and a maze. You take a flatworm and \n                         run it through the maze until he's \n                         memorized it. Then you put a new \n                         flatworm in the maze. He's clueless. \n                         Banging into walls, getting lost, \n                         whatever.\n\n                                     THUMPER\n                              (thoughtfully)\n                         Like Ozzy.\n\n               Gwen giggles as Spencer throws popcorn at Thumper's head.\n\n                                     SPENCER\n                         Ten bucks says he eats it off the \n                         floor.\n\n               Thumper seems oblivious to their taunts as Evan knocks the \n               three-ball in the side.\n\n                                     EVAN\n                         You chop up the smart flatworm and \n                         feed it to the dumb one and presto, \n                         the dumb one suddenly knows the maze \n                         inside and out.\n\n               Evan walks past Heidi, putting his hand on her shoulder to \n               squeeze by. The hand lingers longer than necessary and Heidi \n               doesn't mind. He sinks another ball.\n\n                                     EVAN\n                         Just by absorbing the first worm \n                         into its cellular structure, it gets \n                         all of the worm's memories.\n\n                                     THUMPER\n                              (thoughtfully)\n                         That's probably why Hannibal Lecter's \n                         so smart.\n\n               A handful of popcorn hits Thumper's face. They all try to \n               ignore Hunter and Spencer's jeers.\n\n                                     HEIDI\n                         So what's the point?\n\n                                     EVAN\n                              (setting up the eight)\n                         Maybe if I can figure out how the \n                         memories of a simple worm function, \n                         it'll help me understand the \n                         complexities of the human brain.\n\n               Another barrage of popcorn hits Thumper's jacket. Although \n               his hand clenches on the cue. He meekly shuffles away to the \n               opposite side of the pool table from the cackling Greeks.\n\n                                     HEIDI\n                              (intrigued)\n                         So are you planning on becoming a \n                         doctor or something?\n\n               Thumper casually takes the pool cue from Evan.\n\n                                     EVAN\n                         No, I just don't want to lose my \n                         mind.\n\n               As Heidi digests this, Thumper carefully lines up his shot... \n               The eight ball.\n\n               CRASH!!! The cue ball intentionally jumps the table, rocketing \n               into the pitcher of beer on the Greek's table. They're all \n               soaked with beer and debris.\n\n               Just as they begin to rise, Thumper smashes the cue stick on \n               the table, WHISTLING innocently (while now brandishing a \n               spear). They sit the fuck down.\n\n               Kristin, impressed, casually wraps her arm around Thumper's \n               waist. He smiles coolly, it's nothing.\n\n                                     EVAN\n                              (to Heidi)\n                         I think that's your game.\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan and Heidi, making out, burst through the door and fall \n               on the bed. Evan's shirt is unbuttoned and Heidi strokes his \n               chest. Suddenly Heidi stops and sniffs the air.\n\n                                     HEIDI\n                         Smells like sex in here.\n\n                                     EVAN\n                         Thumper had a busy afternoon.\n\n                                     HEIDI\n                         You're kidding. He's so... big.\n\n               Evan drunkenly crosses the room, grabs two beers from the \n               mini-fridge.\n\n                                     EVAN\n                         Charisma and eyeliner go a long way, \n                         I guess. Wanna beer?\n\n               Heidi takes one. Looks under the bed.\n\n                                     HEIDI\n                         Most guys tuck their porn under here, \n                         but all you have are... comp books.\n\n                                     EVAN\n                         Yeah. I've been keeping journals \n                         since I was seven.\n\n                                     HEIDI\n                              (respectfully)\n                         Wow... read something.\n\n               Evan chugs his beer and sits next to her on the bed and puts \n               his arm around her. Very drunk.\n\n                                     EVAN\n                         No way, I'd be too embarrassed.\n\n               Heidi teasingly runs her fingers over his smooth torso.\n\n                                     HEIDI\n                         Then keep drinking, worm-boy. You're \n                         too uptight.\n\n               Evan stops short.\n\n                                     EVAN\n                         Freeze! No \"worm-boy\". No \"Mr. Worm,\" \n                         and no \"Worm-Master-General!\" Once \n                         you get a nickname like that you \n                         can't shake it. And I don't want \n                         everyone thinking I've got tapeworms \n                         coming out of my ass or something, \n                         okay?\n\n                                     HEIDI\n                              (laughing)\n                         Deal. Now read me something.\n\n               Heidi hands him a book marked \"AGE 13\". He flips it open to \n               a random place and takes the beer from her hand.\n\n                                     EVAN\n                              (re: her beer)\n                         For courage.\n\n               Evan takes and finishes her beer and begins reading. As he \n               reads, he seems more and more on the verge of passing out.\n\n                                     EVAN\n                         It's like my mind refused to believe \n                         what it was seeing. Hearing Crockett \n                         make those awful screams... Just \n                         writing about it gives me the shivers.\n\n               Color drains from Evan's face as he realizes what he's \n               reading. He looks over at Heidi, who kisses him.\n\n                                     HEIDI\n                         Come on, go on...\n\n                                     EVAN\n                         It was like Tommy was possessed or \n                         something. There was a hate in his \n                         eyes that I couldn't really call \n                         human.\n\n               As Evan reads, the world seems to ALMOST IMPERCEPTIBLY VIBRATE \n               around him LIKE A TUNING FORK. His voice becomes distant and \n               SOUNDS ECHO around him like distant memories resurrecting \n               themselves...\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               EXT. JUNKYARD - DAY - 1995\n\n               Evan is THIRTEEN again. The scene begins exactly where Evan's \n               blackout occurred as a child. Tommy has just knocked Kayleigh \n               unconscious with a wooden plank, Lenny is frozen at the sight \n               of Crockett in the fluid-soaked gunny sack. And Evan, seething \n               with rage, stands up with clenched fists and CHARGES Tommy \n               at full speed.\n\n               Evan looks around, utterly confused by his surroundings.\n\n                                     EVAN\n                         What the hell is going on?\n\n               Before an answer comes, Tommy smiles at his good fortune and \n               swings the plank, hitting Evan's head. Evan is sent sprawling \n               backwards, his forehead bleeding freely.\n\n               Tommy knocks Evan hard in the ribs with his boots. Evan \n               writhes in agony, his face against the ground. Lenny moves \n               toward the gunny sack, lifts it and tugs desperately on the \n               rope that traps Crockett inside.\n\n                                     LENNY\n                         I can't undo the rope!\n\n               Tommy spins around and flashes an evil smile.\n\n                                     TOMMY\n                         Drop it or I'll slit your mother's \n                         throat in her sleep.\n\n               As if on cue, Lenny does exactly as he's told. His eyes begin \n               to glaze over.\n\n               Evan, beaten and bloody, reaches out with his last bit of \n               strength, grabs Tommy's foot and holds on.\n\n                                     EVAN\n                         I got him, Lenny. Help Crockett!\n\n               Lenny remains frozen in place. Tommy yanks his leg back, \n               breaking Evan's grip.\n\n               Evan groans on the ground in a writhing heap.\n\n               Tommy's voice hitches. His eyes water from pent up \n               frustration.\n\n                                     TOMMY\n                         Listen to me good, Evan. There's a \n                         million other sisters in the world. \n                         You didn't have to fuck with mine.\n\n               Tommy smiles viciously at Lenny, traumatized to watch Tommy \n               pick up the lighter fluid and spray a liquid fuse from the \n               campfire to the soaked gunny sack.\n\n               WHOOSH OF FLAMES\n\n               And Evan passes out.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S DORM - NIGHT - 2002\n\n               Evan comes to with Heidi slapping him awake.\n\n                                     EVAN\n                         Oh my God! No! No!\n\n               Heidi rolls her eyes.\n\n                                     HEIDI\n                         Wake up, idiot. It was just a dream.\n\n               She stands and angrily puts on her jacket.\n\n                                     EVAN\n                              (freaked out)\n                         It didn't feel like a dream.\n\n                                     HEIDI\n                         Maybe because they never do.\n                              (sarcastic)\n                         So Don Juan, you pass out on all \n                         your dates?\n\n               Evan doesn't even hear her. After getting his bearings, he \n               grabs his jacket and exits, leaving her dumbfounded.\n\n               INT. EVAN'S CAR - SUNRISE\n\n               Evan drives...\n\n               EXT. LENNY'S HOUSE - DAY\n\n               Evan, exhausted, finally pulls into Lenny's driveway. Very \n               little has changed in the past seven years.\n\n               INT. LENNY'S ROOM - CONTINUOUS\n\n               ANGLE ON LENNY\n\n               Now 20, making a model airplane. He's still overweight and \n               looks like his mother dresses him.\n\n               PULL BACK TO REVEAL\n\n               The room is filled with model airplanes. Hundreds of them.\n\n               A KNOCK on Lenny's bedroom door. Mrs. Kagan, grayer, fatter, \n               opens the door and escorts Evan inside. She glares at Evan \n               while pretending to be cheerful.\n\n                                     MRS. KAGAN\n                         I've got a surprise for you, Lenny. \n                         You'll never guess who's here.\n\n               Lenny looks up to see Evan, his jaw drops.\n\n               ANGLE ON EVAN\n\n               Looking around, shocked to see:\n\n               PAN ALL THE WAY AROUND THE ROOM.\n\n               Nothing has changed in the past seven years. \n\n               The same kids' toys, posters and comic books.\n\n               AS WE PAN ALL THE WAY AROUND TO LENNY\n\n               We see he's working on the model again, in his own world. \n               The window of opportunity for conversation has closed.\n\n                                     EVAN\n                         Hey, uh, it's me. Evan.\n\n               Silence. Lenny frowns.\n\n                                     EVAN\n                         What's that you're working on? A \n                         model?\n\n               Nothing.\n\n                                     EVAN\n                         Well, you look busy, so maybe I should \n                         make this quick. I'd totally \n                         understand if you didn't want to get \n                         into this right now, but that day at \n                         the junkyard, could you help me \n                         remember what happened? Any details?\n\n               No response. Evan picks up a model airplane from the desk.\n\n                                     LENNY\n                         I couldn't cut the rope.\n\n                                     EVAN\n                              (containing excitement)\n                         Yeah, good, what else do you remember?\n\n                                     LENNY\n                         Drop it or I'll slit your mother's \n                         throat in her sleep.\n\n               Evan, startled, drops the model on the desk. An epiphany.\n\n                                     EVAN\n                         Jesus Christ. It really happened.\n\n               Lenny stares out the window.\n\n                                     EVAN\n                         What if I can get back all my lost \n                         memories with my journals.\n\n               With lightning speed, Lenny jumps from his desk and \n               unexpectedly shoves EVAN IN TO THE WALL. Squadrons of hanging \n               planes crash to the floor. Lenny digs his fingers into Evan's \n               shoulder.\n\n                                     LENNY\n                         Make one peep and I swear it'll be \n                         your last, motherfucker.\n\n               Evan is terrified. Then Lenny suddenly moves back and begins \n               working on the model again, his eyes a million miles away. \n               Evan is speechless.\n\n               The door bursts open. Mrs. Kagan looks at the smashed model \n               airplanes by Evan's feet. Evan ignores her accusing stare.\n\n                                     EVAN\n                         Well, thanks for seeing me, man. I \n                         shouldn't have waited so long.\n\n               When Lenny doesn't respond, Mrs. Kagan hustles Evan back \n               into the hallway.\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan pulls a dozen journals from beneath his bed and begins \n               pouring over them.\n\n               Nearby, Thumper empties a can of hairspray into his Mohawk.\n\n                                     THUMPER\n                         You really think he wanted to kill \n                         you?\n\n                                     EVAN\n                         All I know is that I might be able \n                         to unblock some of my repressed \n                         memories.\n\n               He finds something he's looking for, marks the page with a \n               yellow post-it note marked, BLACKOUT and sets the book in a \n               separate pile.\n\n               As he sets the next journal on the bed, it automatically \n               opens up to a place where the spine was bent. Staring up at \n               him is the message:\n\n               EVAN'S DIARY\n\n               \"I will come back for you.\"\n\n               Evan looks overcome by guilt.\n\n               Later that evening:\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan has now organized a pile of five journals. He selects \n               an entry, begins reading and suddenly closes the journal. \n               Fear covers his face. He holds one of his hands up and isn't \n               surprised to see it trembling.\n\n               He opens his journal again and reads out loud.\n\n                                     EVAN\n                              (reading aloud)\n                         The last thing I remember before the \n                         blackout was holding my hands over \n                         Kayleigh's ears...\n                              (his voice slowly \n                              fades)\n                         I think I was more focused on her \n                         hands on mine than the mailbox across \n                         the street...\n\n               His own words grow reverberant, distant. Furthermore, the \n               walls behind him vibrate, slightly worse than before.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               EXT. MRS. HALPERN'S HOME - DAY - 1995\n\n               Evan, Kayleigh, Lenny and Tommy, all thirteen, watch the \n               mailbox across the street with intense anticipation.\n\n               When Evan comes to in this memory, the lit cigarette absently \n               drops from his mouth and nestles into the folds of his shirt, \n               SMOLDERING.\n\n               The mailbox... tick-tock, tick-tock... Like a staring contest.\n\n                                     LENNY\n                         Maybe it went out. Should someone \n                         check it?\n\n                                     TOMMY\n                         Yeah, you do that, Lenny.\n\n               Suddenly a car appears from down the street and slowly pulls \n               into the driveway.\n\n               MRS. HALPERN, 24, an attractive young mother, gets out of \n               the car and walks to the mailbox.\n\n               Across the street, Tommy digs his fingers into the nerves of \n               Lenny's shoulder.\n\n                                     TOMMY\n                         Make one peep and I swear it'll be \n                         your last, motherfucker.\n\n               Tommy's words make Evan flinch. From inside the car, a BABY \n               begins to cry. Mrs. Halpern walks back to the car.\n\n               Evan looks on in horror and suddenly clenches his teeth in \n               pain and silently swipes the front of his shirt, sending the \n               lit cigarette to the ground. He pulls up his shirt revealing \n               a fresh BURN MARK on his stomach.\n\n                                     MRS. HALPERN\n                         How's my sweet girl? Awww, you need \n                         a change, don't you honey?\n\n               Mrs. Halpern picks her up and carries her to the house. As \n               the mother unlocks the front door to the house, the kids \n               break into wide smiles of relief. But wait...\n\n               The mother remembers the mail and carries the baby back to \n               the mailbox. Now Tommy is the only one left still smiling.\n\n                                     MRS. HALPERN\n                         You want to open the door, honey?\n\n               The baby fumbles with the mailbox's door handle for a moment --\n\n               ANGLE ON KIDS' FACES\n\n               BOOM!!!\n\n               The blast is deafening. Evan, Kayleigh and Lenny watch the \n               results in stunned horror.\n\n                                     TOMMY\n                         C'mon! Run!!\n\n               Evan and Kayleigh slowly back away in shock and begin to run \n               a few steps when they realize that Lenny isn't with them.\n\n                                     TOMMY\n                         Lenny? Come on!\n\n                                     KAYLEIGH\n                         Oh my God oh my God...\n\n               Lenny doesn't seem to hear, his eyes fixated on the crimson \n               road. Evan and Tommy double back and grab him. They try to \n               make him break out into a run, but Lenny's feet drag limply \n               against the ground. Both Tommy and Evan grab an arm and begin \n               to run with Lenny through the woods.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan comes to. Lurches his body over the bed and vomits.\n\n               Sounds of squeaky bed springs fill the room. Looking sick \n               and pale, he lifts his shirt to see a NEW SCAR from the \n               cigarette burn.\n\n                                     EVAN\n                         What the hell?\n\n               In the next bed, Thumper's head, wrapped in a blanket, pops \n               up from above a NAKED GESELA'S waist.\n\n                                     THUMPER\n                         Christ, man. You wanna clean that up \n                         before I lose my appetite here?\n\n               Evan sits upright in bed and begins writing in the margins \n               of the journal.\n\n               INT. DORM LOBBY - DAY\n\n               The lobby is decorated with colorful streamers, balloons, \n               posters and banners announcing PARENTS' WEEKEND.\n\n               Carefree STUDENTS and their parents carry shopping bags toward \n               the bustling elevators. Evan leans against the side of a pay \n               phone, holding his ear to drawn out the noise.\n\n                                     EVAN\n                         Yes, hello, uh, Mrs. Kagan, this is \n                         Evan Treborn.\n                              (rolling eyes)\n                         I know. I'm sorry about that. But I \n                         really need to speak with him.\n\n               She's obviously hung up on him. Suddenly, a HAND grabs his \n               shoulder. It's PROFESSOR CARTER.\n\n                                     PROFESSOR CARTER\n                         Whoa! Didn't mean to scare you, Evan. \n                         Just wanted to know how the flatworms \n                         project was coming.\n\n                                     EVAN\n                         Oh, fine I guess. It's been kind of \n                         crazy lately with my mom coming up, \n                         so I haven't...\n\n                                     PROFESSOR CARTER\n                         I know, I know. Who can think of \n                         worms when your libido's in full \n                         swing, right?\n\n               Evan shrugs and forces a smile.\n\n                                     PROFESSOR CARTER\n                         Just don't drop the ball, okay?\n\n                                     EVAN\n                         I won't let you down, Professor \n                         Carter.\n\n               Carter waves to another student and her parents and walks \n               away.\n\n               INT. FANCY RESTAURANT - NIGHT\n\n               A waiter clears the dishes away from Evan and Andrea's table.\n\n               REVEAL ANDREA\n\n               Her hair now has gray streaks. As she signs for the bill, \n               she leans over and kisses Evan on the cheek.\n\n                                     EVAN\n                         Please, mom. People will talk.\n\n                                     ANDREA\n                         I can't help it. I'm just so proud \n                         of you. You've got the highest grades \n                         in all of your classes.\n\n                                     EVAN\n                         Did Da -- Jason --- get good grades?\n\n                                     ANDREA\n                              (smiling)\n                         Please. He got straight A's without \n                         ever touching a book. That was the \n                         one area where his memory never failed \n                         him.\n\n                                     EVAN\n                         Ma? Did he ever say that he figured \n                         out a way to recall a lost memory \n                         years after he blacked it out for \n                         the first time?\n\n               Andrea's smile fades.\n\n                                     ANDREA\n                         Why do you ask?\n\n                                     EVAN\n                         No, it's just weird with him being \n                         such a brain and all, I just wondered \n                         if he was ever able to remember stuff \n                         he'd forgotten.\n\n                                     ANDREA\n                         When he was around your age... almost \n                         exactly your age. He said he figured \n                         out a trick to remember the past.\n\n               Evan tries not to react.\n\n                                     ANDREA\n                         I couldn't tell if they were real \n                         memories or just phantoms. You know, \n                         he might only have thought he actually \n                         remembered them...\n\n                                     EVAN\n                         Sure...\n\n                                     ANDREA\n                         And then, just before it got so bad \n                         that he had to be committed, he said \n                         that he could...\n\n                                     EVAN\n                         What? What could he do?\n\n               Andrea shakes her head.\n\n                                     ANDREA\n                         Forget it. It's nothing. He was far \n                         too sick by then.\n\n               Evan nods, but something gnaws beneath the surface.\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan hastily hunts through his journals, tearing up the room \n               looking for a certain book. Thumper, lying on his bed, quietly \n               watches Evan with growing concern.\n\n                                     EVAN\n                              (reading aloud)\n                         I never wanted to be in the movie \n                         anyway and it was cold so I wanted \n                         to wear my clothes but Mr. Miller \n                         took his shirt off --\n\n                                     THUMPER\n                         What the fuck are you doing?\n\n                                     EVAN\n                         Shhh! I need quiet for this.\n\n               Thumper jumps off the bed and snatches the journal away.\n\n                                     THUMPER\n                         Are you stupid or what?\n\n                                     EVAN\n                         What?\n\n                                     THUMPER\n                         Shucks, I dunno. But maybe there's a \n                         reason why you've repressed the one \n                         day when some old lecher had you in \n                         your tighty whities, dammit!\n\n               Thumper begins scanning the journal entry. A bitter laugh.\n\n                                     THUMPER\n                         Yeah, man. I'd think twice about \n                         this. You could wake up a lot more \n                         fucked up than you are now.\n\n               He hands the journal back to Evan. Evan opens it and begins \n               reading it silently.\n\n               His hands begin to tremble and he slams the book shut in \n               defeat.\n\n               INT. EVAN'S CAR - COUNTRYSIDE - DAY\n\n               Evan, looking haggard and frail, wipes the greasy hair from \n               his eyes and punches the accelerator. His teeth are clenched \n               and he hammers his fist on the dashboard.\n\n                                                               DISSOLVE TO:\n\n               EXT. RIDGEWOOD DINER - EVENING\n\n               Evan pulls into a parking lot of a country diner. He eyes a \n               piece of paper with an address scrawled on it and gets out.\n\n               INT. RIDGEWOOD DINER - CONTINUOUS\n\n               A run-down greasy spoon. Filled with a number of TOWNIES and \n               TRUCKERS. The place is stale with cigarette smoke and appears \n               decorated in grime motif.\n\n               Evan is about to enter when he spots Kayleigh coming out of \n               the kitchen with a tray full of food.\n\n               Kayleigh, now twenty, looks pale and sickly thin. She bangs \n               her hip on the swinging door and an order of food crashes to \n               the floor. Her BOSS stares back in aggravation.\n\n                                     BOSS\n                         Can we get through one goddamned day \n                         without you breaking something?\n\n               Kayleigh's face turns beet red as she bends down to clean up \n               the order. She is humiliated and Evan leans back against a \n               pay phone so that she can't see him watching her.\n\n               As she brings the mess inside the kitchen, a CUSTOMER pinches \n               her ass. Evan closely studies her reaction to the offense. \n               She flinches uncomfortably but then composes a smile for the \n               customer. Evan backs out uncomfortably.\n\n               EXT. RIDGEWOOD DINER - NIGHT\n\n               Kayleigh struggles with the zipper of a shabby coat as she \n               exits. Evan steps out of the shadows. She's startled at first, \n               but eventually recognizes him. A smile flickers across her \n               face and she allows herself to be hugged.\n\n                                     KAYLEIGH\n                         God, Evan! I never thought I'd see \n                         you again. How've you been?\n\n                                     EVAN\n                         Oh, comme si, comme ca, you know...\n\n                                     KAYLEIGH\n                         No, Evan. I don't know. It's been a \n                         long time. Fill me in.\n\n                                     EVAN\n                         I'm going to State now. Things are \n                         going okay. I guess. Mom's good...\n\n               Kayleigh nods and they walk down the street. She reaches \n               into her pocket, pulls out a pack of smokes.\n\n                                     EVAN\n                              (declining)\n                         Not since we were kids.\n\n                                     KAYLEIGH\n                         I've stopped a hundred times.\n\n                                     EVAN\n                         So how's Tommy?\n\n                                     KAYLEIGH\n                              (takes a long drag)\n                         They kept him in juvy for a few years. \n                         Now he works over at Dale's Autobody.\n\n               Evan nods and scrutinizes her face with his next question.\n\n                                     EVAN\n                         You still live with your dad?\n\n               Her face is betrayed by a slight tick.\n\n                                     KAYLEIGH\n                         No. I emancipated myself when I was \n                         fifteen.\n\n                                     EVAN\n                         Wow. That must've taken some courage.\n\n                                     KAYLEIGH\n                         Not if you remember my dad.\n\n                                     EVAN\n                         Couldn't you have moved in with your \n                         mom?\n\n                                     KAYLEIGH\n                              (shaking her head)\n                         She had a new family. Not enough \n                         space for me. Said I should have \n                         moved in with her when we were kids. \n                         But... whatever.\n\n               They walk in silence for a moment.\n\n                                     EVAN\n                         Actually, Kayleigh, the reason I \n                         came back to town was to talk to \n                         you.\n\n                                     KAYLEIGH\n                              (brightening)\n                         Me? Are you kidding? Why?\n\n                                     EVAN\n                         Remember when I was a kid I had all \n                         these blackouts?\n\n                                     KAYLEIGH\n                         Of course.\n\n                                     EVAN\n                         Well, lately some of the memories \n                         have begun to come back and I'd kinda \n                         like to talk to you about one of \n                         them in particular. It'd be a big \n                         help.\n\n                                     KAYLEIGH\n                         Well, sure. I'll try to remember. \n                         Shoot.\n\n                                     EVAN\n                         When we were kids. Your dad was making \n                         a movie. Robin Hood or something?\n\n                                     KAYLEIGH\n                              (cold)\n                         What do you want to know, Evan?\n\n                                     EVAN\n                         It's just... did he... what happened \n                         in the basement?\n\n                                     KAYLEIGH\n                         It was a long time ago.\n\n                                     EVAN\n                         I know, but...\n\n                                     KAYLEIGH\n                              (cold)\n                         Is that why you came all the way \n                         back? To ask a lot of stupid questions \n                         about Robin Hood?\n\n                                     EVAN\n                         No, but I think something really bad \n                         might've happened to us.\n\n               Kayleigh stops walking and crushes her cigarette.\n\n                                     KAYLEIGH\n                         Is there a point to any of this?\n\n               Evan's features shift from inquisitory to tenderness. He \n               steps closer to Kayleigh and softly strokes her face. She \n               flinches at first, but remains in the same spot.\n\n                                     EVAN\n                         Whatever happened, it wasn't our \n                         fault. You know we couldn't have \n                         stopped it.\n\n               Kayleigh begins to tremble. Tears flow.\n\n                                     EVAN\n                         Look, Kayleigh. This may sound like \n                         bullshit coming from a guy who hasn't \n                         spoken to you in seven years...\n\n               She moves her face away from his hand.\n\n                                     EVAN\n                         But you were seven years old and \n                         there's nothing you could've done to \n                         deserve...\n\n               Her face collapses and she turns away.\n\n                                     KAYLEIGH\n                              (defeated)\n                         Just shut up, Evan. You're wasting \n                         your breath.\n\n                                     EVAN\n                         You can't hate yourself just because \n                         your dad's a twisted freak.\n\n                                     KAYLEIGH\n                         Who are you trying to convince, Evan?! \n                         You come all the way out here to \n                         stir up my shit just because you had \n                         a bad memory!? You want me to cry on \n                         your shoulder and tell you that \n                         everything's all better now? Well \n                         fuck you, Evan! Nothing's gonna be \n                         all better! Okay?! Nothing ever gets \n                         better!\n\n               Kayleigh runs, stops and turns back to Evan.\n\n                                     KAYLEIGH\n                         If I was so wonderful, Evan, why \n                         didn't you ever call me? Why'd you \n                         leave me here to rot?!\n\n               She turns and runs away. Evan looks sick with guilt.\n\n               EXT. COLLEGE CAMPUS - QUAD - DAY - 2002\n\n               A few GREEKS play frisbee and talk trash. Evan, tired and \n               depressed, sits on the lawn nearby, fingering the new burn \n               scar on his belly. Contemplating...\n\n               INT. EVAN'S DORM - NIGHT\n\n               Evan enters his dorm. He ignores Thumper, who sits on Evan's \n               bed sucking furiously from a gurgling bong. He chokes out a \n               message.\n\n                                     THUMPER\n                         Some dude left a message for you.\n\n               Evan puts a towel under the door.\n\n                                     EVAN\n                         You can smell it all the way in the \n                         bathroom.\n\n               Evan hits \"play\" on the answering machine.\n\n                                     ANSWERING MACHINE\n                              (male voice)\n                         Hi, Evan, this is Professor Carter. \n                         Just wondered why you didn't hand in \n                         your essay this afternoon. I was a \n                         bit concerned. Call me to schedule a \n                         make-up.\n\n               BEEP. Thumper offers Evan a magnified frown of disapproval.\n\n                                     ANSWERING MACHINE\n                              (male voice)\n                         What did you say to my sister \n                         motherfucker?! Last night she cried \n                         on the phone for over an hour to me.\n                              (enraged breathing)\n                         She said you came and saw her last \n                         night.\n\n               Thumper coughs accidentally, tips the bong over on Evan's \n               bed. Reacting quickly, he grabs a towel from under the door \n               and wipes off Evan's comforter.\n\n                                     ANSWERING MACHINE\n                              (Tommy; cont'd)\n                         She... she fucking killed herself \n                         tonight. She's dead.\n                              (beat)\n                         And so are you.\n\n               BEEP. Evan stares dumbstruck at the machine.\n\n                                     THUMPER\n                         Whoa, bad news, bro. I don't think \n                         this is gonna come out.\n\n                                                               DISSOLVE TO:\n\n               EXT. CEMETERY - DAY\n\n               Evan, dressed in black, gets out of his car at the edge of \n               the cemetery. A small cluster of friends and family gather \n               at the grave. Evan grabs a bouquet of roses and begins walking \n               to the grave. When he suddenly spots Mr. Miller and Tommy.  \n               Evan's hands tense up into fists. He becomes weak in the \n               knees and stops walking. After an uncomfortable moment of \n               standing still, he retreats to his car and watches the \n               ceremony from the driver's seat.\n\n                                                               DISSOLVE TO:\n\n               EXT. CEMETERY - DAY\n\n               The last of the mourners are filing away. Evan exits his car \n               and walks to the deserted grave. He drops the roses on the \n               casket and turns to make sure nobody is watching.\n\n               Evan reaches into his pocket and pulls out a sheet of paper. \n               He unfolds it and leaves it on her gravesite:\n\n               EVAN'S DIARY\n\n               \"I'll come back for you.\"\n\n               INT. EVAN'S DORM - NIGHT\n\n               He makes a weighty decision and gets up. He hastily hunts \n               through his journals, looking for a certain book.\n\n               Evan opens his journal marked \"Age 7\". He plops on his bed \n               and starts writing sideways in the margins.\n\n                                     EVAN (V.O.)\n                         It's been said that a person's life \n                         is little more than the sum of his \n                         experiences. If that's true, then \n                         I'm not sure I know who I am anymore.\n                              (beat)\n                         I definitely never knew Kayleigh.\n\n               He turns the page and begins reading the journal. As he mouths \n               the entry to himself, the resonance of an older man's voice \n               seems to REVERBERATE throughout the room and the WORLD behind \n               his head FAINTLY VIBRATES.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. MILLER'S HOUSE - LIVING ROOM - DAY - 1989\n\n               Mr. Miller plays with his camera and the kids are excited \n               about playing Robin Hood in a movie.\n\n                                     MR. MILLER\n                         Shut up moron. Now get in your costume \n                         Evan.\n\n               Evan slowly nods and begins to strip out of his clothes. Mr. \n               Miller takes a quick peek at him.\n\n                                     MR. MILLER\n                         I've got an idea. Let's go downstairs, \n                         it'll look more like a dungeon down \n                         there.\n\n               INT. MILLER'S BASEMENT - DAY - 1989\n\n               Mr. Miller puts the camera on a tripod in the basement. \n               Kayleigh and Evan sit on folding chairs in front of the \n               camera. Tommy stands at the top of the basement stairs, \n               looking down.\n\n                                     MR. MILLER\n                              (to Tommy)\n                         What did I say about keeping that \n                         door closed, stupid?\n\n                                     TOMMY\n                         But I wanna see!\n\n                                     MR. MILLER\n                         You're gonna see my fist in about \n                         two seconds unless you do what I \n                         tell you.\n\n               Tommy sulks and closes the door. Mr. Miller lowers his voice \n               and speaks to Evan and Kayleigh.\n\n                                     MR. MILLER\n                         Now in this part of the story, Robin \n                         Hood just married Maid Marian and \n                         they have to kiss and stuff like \n                         grown-ups do.\n\n               Kayleigh giggles and covers her mouth with her hand. Evan \n               looks skeptical.\n\n                                     MR. MILLER\n                         So take your clothes off Kayleigh.\n\n               Kayleigh stops giggling. Evan says nothing.\n\n                                     MR. MILLER\n                         Come on, like when you take a bath. \n                         Don't make a deal out of it. You \n                         too, Evan.\n\n               Mr. Miller gets behind the lens. The room is dead silent.\n\n                                     MR. MILLER\n                         Let's go.\n\n               ANGLE ON TOMMY\n\n               Who silently opens the door at the top of the basement stairs \n               and watches with horror.\n\n               Evan's face is flushed with rage. He walks behind Kayleigh \n               and cups his hands tightly around her ears. She can't hear \n               anything now.\n\n                                     EVAN\n                         What time is it?\n\n                                     MR. MILLER\n                         It's time for you to stand where the \n                         hell I told you.\n\n                                     EVAN\n                         Wrong answer, fuckbag. This is the \n                         very moment of your reckoning. In \n                         the next thirty seconds you're going \n                         to open one of two doors. The first \n                         door will forever traumatize your \n                         own flesh and blood.\n\n               The mature speech seems completely surreal coming from a \n               seven-year old. Mr. Miller looks around the room as if he's \n               the butt of some sick joke.\n\n                                     MR. MILLER\n                              (stunned disbelief)\n                         What's happened to -- How are you \n                         doing that?\n\n                                     EVAN\n                              (voice rising)\n                         It'll change your daughter from a \n                         beautiful child into an empty shell \n                         whose only concept of trust was \n                         betrayed by her own sick pedophile \n                         father. Ultimately, it'll lead to \n                         her suicide. Nice work, daddy.\n\n                                     MR. MILLER\n                              (hoarse whisper)\n                         Who -- who are you?\n\n               Evan impatiently waves the question.\n\n                                     EVAN\n                         Let's just say you're being closely \n                         watched, George. Your other option \n                         is to get your porn off the rack and \n                         treat Kayleigh like... oh, let's say \n                         like how a loving father treats his \n                         daughter. Sound okay to you, Papa?\n\n                                     MR. MILLER\n                              (choking)\n                         ...yes.\n\n                                     EVAN\n                         Listen close then, fuckbag. You screw \n                         up again and I swear I'll flat out \n                         castrate you.\n\n               The impact of the last sentence isn't lost on Mr. Miller.\n\n                                     EVAN\n                         One last thing.\n\n               Evan leans over to whisper in Kayleigh's ear. Kayleigh stares \n               at the floor, then looks up at her father and shivers.\n\n               Kayleigh looks into Evan's eyes for support. Evan nods go \n               on. His confidence brings a boldness to her lips.\n\n                                     KAYLEIGH\n                         Don't you ever touch me again.\n\n                                     MR. MILLER\n                         I -- I won't.\n\n               Kayleigh summons her own new courage.\n\n                                     KAYLEIGH\n                         I'm cold. And I'm putting on my \n                         clothes.\n\n               As he leaves to pick up her clothes, Evan grins.\n\n                                     EVAN\n                         What you need to do is discipline \n                         your son Tommy, because the kid's \n                         one sadistic pup.\n\n               Hiding at the top of the basement stairs, Tommy recoils in \n               horror and picks up one of his sister's dolls and begins \n               twisting the head back and forth...\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. SORORITY BEDROOM - MORNING - 2002\n\n               A broad smile lines Evan's face as he slowly wakes up from \n               his slumber. He suddenly grabs his head as if suffering from \n               a pounding migraine.\n\n               MONTAGE OF SWIRLING MEMORIES\n\n               Quick cuts and flashes of Evan and Kayleigh growing older -- \n               she seems more carefree now, full of life and less self- \n               conscious.\n\n               EXT. ANDREA'S HOUSE - DAY - 1989\n\n               Evan pulls Kayleigh around in a little red wagon.\n\n               INT. FAMILY RESTAURANT - DAY - 1989\n\n               Evan and Kayleigh play in a tub of balls in the playroom.\n\n               EXT. PLAYGROUND - DAY - 1989\n\n               Kayleigh pushes Evan on a tire swing.\n\n               INT. MULTIPLEX THEATER - NIGHT - 1995\n\n               Tommy, glaring at Evan, thrashes the Teen Punk.\n\n               EXT. JUNKYARD - DAY - 1995\n\n               Burning sack in flames.\n\n               EXT. ANDREA'S HOUSE - STREET - 1995\n\n               QUICK FLASH of the U-Haul driving away.\n\n               EXT. BUS STATION - DAY - 1995\n\n               At thirteen, Kayleigh spunkily hops off a GREYHOUND BUS and \n               runs into Evan's arms.\n\n               EXT. ANDREA'S NEW HOUSE - DAY - 1995\n\n               Still thirteen, Evan peddles his bike by his new house, \n               Kayleigh riding on the handlebars.\n\n               More memory flashes of Evan and Kayleigh throughout the teen \n               years, they grow up as lovers now:\n\n               EXT. LAKE - DAY - 1997\n\n               Evan and Kayleigh have romantic picnic on a rowboat.\n\n               EXT. HIGH SCHOOL FOOTBALL FIELD - SUNRISE - 2002\n\n               Evan and Kayleigh watch the sunrise after senior prom.\n\n                                                                   BACK TO:\n\n               INT. SORORITY BEDROOM - MORNING - 2002\n\n               Finally the memory assault is over. Evan groans in pain as \n               blood trickles from his nose.\n\n               An arm reaches over and touches his shoulder.\n\n                                     KAYLEIGH (O.S.)\n                         Honey, are you all right?\n\n               Evan whips around to see Kayleigh watching him. Not only is \n               Kayleigh alive, but she's a ravishing beauty. Evan lurches \n               back from the shock of seeing Kayleigh and falls to the floor. \n               She sees Evan's nose bleed and her eyes go wide.\n\n                                     KAYLEIGH\n                         Oh my God, Evan. You're bleeding! \n                         Look at you!\n\n               Evan, still stunned, can do little but stare from the floor.\n\n                                     EVAN\n                              (transfixed by her)\n                         Jesus, Kayleigh, you're...\n                              (looks around)\n                         Incredible.\n\n                                     KAYLEIGH\n                              (purring)\n                         Mmmm... You give good compliment. \n                         Clean up and come back to bed.\n\n               He stands in the middle of her bedroom, surrounded by sorority \n               plaques and pink preppy decor.\n\n               Evan, hardly able to take his eyes off her as she hands him \n               a tissue. He reaches for his clothes at the foot of the bed \n               and comes up with a Greek-lettered fraternity sweatshirt and \n               brown suede jacket.\n\n                                     EVAN\n                         Where... where are my clothes?\n\n                                     KAYLEIGH\n                         Those are your clothes, silly.\n\n               Evan frowns with distaste, grabs a towel and heads out.\n\n               WE FOLLOW HIM INTO:\n\n               INT. SORORITY BATHROOM - MORNING\n\n               At the sink, Evan washes the blood off his face and looks at \n               his reflection in the mirror. A nearby shower SHUTS OFF.\n\n                                     EVAN\n                         This is too amazing! Un-fucking-real!\n\n                                     WOMAN'S VOICE (O.S.)\n                         I wish I could get so excited about \n                         a nose bleed.\n\n               Evan turns around and sees Gwen, one of the sorority brats \n               from the bar, exit the shower naked.\n\n                                     EVAN\n                         Whoops. Sorry. My bad.\n\n               Evan blushes and turns back to the mirror through which Gwen \n               dries herself with a towel while staring flirtatiously back \n               at Evan.\n\n                                     EVAN\n                         Hey, you were with those assholes \n                         who threw popcorn at Thumper.\n\n               Evan holds his temple in pain as another memory comes to \n               him.\n\n                                     EVAN\n                         And your name is... Gwen!\n\n                                     GWEN\n                         Seriously, Evan. Lay off the blow.\n\n               She pats his ass and exits the bathroom.\n\n               EXT. COLLEGE - QUAD - DAY - 2002\n\n               Kayleigh, wearing a long skirt and tight red sweater, catches \n               the eye of every guy on campus. She and Evan stroll arm in \n               arm through the quad.\n\n               Somehow, the world seems brighter now. Even the colors seem \n               more vibrant when compared to the somewhat grimmer world \n               we've known.\n\n               MANY STUDENTS wave to Evan and call his name. He can't \n               remember all their names but it's kinda cool being the BMOC.\n\n               Evan takes a long look at her and becomes curious.\n\n                                     EVAN\n                         Hey, uh, don't go freaking out on me \n                         over this, but do you remember when \n                         your dad first got his video camera? \n\n                                     KAYLEIGH\n                         Well I remember he had one... but \n                         he, like, put it away after the first \n                         day. Why would that freak me out?\n\n                                     EVAN\n                         I dunno.\n                              (goofy smile)\n                         Just being weird.\n\n               Kayleigh playfully sweeps her leg around to kick him on the \n               ass, then smiles as if a ghost must have done it.\n\n                                     KAYLEIGH\n                         Such a goofus. See you tonight.\n\n               Kayleigh gives him a big unexpected kiss and walks away. \n               After a moment of wow, Evan runs off to class himself.\n\n               INT. DORM LOBBY - DAY\n\n               Evan inserts his last quarter into the lobby pay phone and \n               dials a telephone number.\n\n                                     EVAN\n                              (to himself)\n                         Come on, Mom, be there!\n\n                                     ANSWERING MACHINE\n                              (Andrea's voice)\n                         Andrea,\n                              (Evan's voice)\n                         Evan,\n                              (a strange, older \n                              man's voice)\n                         And Chuck,\n                              (all three)\n                         Aren't home right now. You know what \n                         to do.\n\n                                     EVAN\n                              (off-guard)\n                         Hi, Mom and, uh, Chuck. Just calling \n                         to say hi and well, call me.\n\n               Evan hangs up the phone, then checks his watch. No, wrist. \n               At that moment, Thumper passes Evan in the lobby.\n\n                                     EVAN\n                         Thumper! What time is it, man?\n\n               Thumper eyes this strange preppy kid with distaste.\n\n                                     THUMPER\n                         Whasamatter? Lost your Rolex?\n\n                                     EVAN\n                         Huh?\n\n                                     THUMPER\n                         Fuck off, frat boy.\n\n               Thumper walks away, leaving Evan dumbfounded.\n\n               INT. COLLEGE CLASSROOM - DAY\n\n               Evan runs into the lecture hall and gets in line behind other \n               STUDENTS who are taking No. 2 pencils from a box on Professor \n               Carter's desk.\n\n               Evan hears PEOPLE he cannot see calling his name. Somehow, \n               it's more creepy than cool. The Professor makes a loud \n               announcement.\n\n                                     PROFESSOR CARTER\n                         Remember, everyone! Only two weeks \n                         until your science projects are due.\n\n                                     EVAN\n                              (quietly)\n                         I still owe you an essay from last \n                         week. Is there any way I could get \n                         an extension?\n\n                                     PROFESSOR CARTER\n                         And you are...?\n\n                                     EVAN\n                              (disappointed)\n                         Evan Treborn.\n\n                                     PROFESSOR CARTER\n                         The answer's 'no', Mr. Treborn. Now \n                         take a seat. The exam's about to \n                         begin.\n\n               Evan walks up the aisle and takes a seat. As he sits down, \n               someone puts his ARM menacingly around Evan's throat.\n\n               Evan flinches, turns around and sees Hunter, the frat guy \n               Thumper assaulted the other night at Dirty Hank's bar.\n\n                                     EVAN\n                         Leave me alone, asshole. I didn't \n                         lay a hand on you, okay?\n\n               Hunter bursts out laughing.\n\n                                     HUNTER\n                         Evan, you're hysterical. You study \n                         for this?\n\n                                     EVAN\n                              (awkward)\n                         We'll find out soon enough.\n\n                                     HUNTER\n                              (laughing)\n                         Me neither.\n\n               Hunter surreptitiously hands Evan a cheat-sheet to the exam. \n               Evan's face brightens.\n\n                                     EVAN\n                         You're kidding. Are these the \n                         answers?!\n\n                                     HUNTER\n                         Damn, Evan, on the D.L.\n\n                                     EVAN\n                              (holding it lower)\n                         Thanks. Wow. Hey, I want to do \n                         something really special for Kayleigh \n                         tomorrow. If I said I needed some \n                         help from you and the brothers...\n\n                                     HUNTER\n                         I'd say blow me. Get the pledges to \n                         do it.\n\n               Evan nods and smiles as exams are passed down his row.\n\n               INT. SORORITY BEDROOM - NIGHT\n\n               Evan and Kayleigh have just finished having sex. She seems \n               incredibly satisfied, but he looks slightly uncomfortable.\n\n                                     KAYLEIGH\n                         Oh my God, that was good. Where'd \n                         you learn all those new tricks?\n\n                                     EVAN\n                         So it didn't feel... weird?\n\n                                     KAYLEIGH\n                         Yeah, if you call multiple orgasms \n                         weird.\n\n               She giggles and snuggles into him. He's grateful for her \n               affection, but still looks uneasy. The PHONE RINGS and he \n               automatically answers it.\n\n                                     EVAN\n                         Yellow.\n\n               Silence on the other end. More silence.\n\n                                     KAYLEIGH\n                         Fuck 'em.\n\n               As Evan hangs up, he and Kayleigh share a giggle and he \n               resumes snuggle position.\n\n                                     EVAN\n                         What do you think it is about us \n                         that makes us so perfect? Like, \n                         looking back, whatever gave you the \n                         nerve to sneak out and visit me after \n                         I moved away?\n\n                                     KAYLEIGH\n                              (laughs)\n                         As if my dad could've stopped me \n                         from seeing you. What's he gonna do \n                         to me?\n\n               Evan smiles to himself. And hugs her tighter.\n\n                                     EVAN\n                         You think we'll always be together?\n\n               For the first time she looks at him with concern.\n\n                                     KAYLEIGH\n                         That is the plan, right? Hell or \n                         high water?\n\n               He's in heaven, but plays it cool.\n\n                                     EVAN\n                         Just making sure.\n\n                                                               DISSOLVE TO:\n\n               EXT. FRAT HOUSE - FRONT LAWN - DAY\n\n               The pledges of Theta Chi busily gather around Evan, their \n               clothes covered in dirt, food and what might be vomit.\n\n               Evan, now dressed like his usual self, bangs a wooden spoon \n               on a metal salad bowl that a poor THETA CHI PLEDGE wears as \n               a hat.\n\n                                     EVAN\n                         Order, order. So all you rushes know \n                         what you've got to do for me?\n\n                                     THETA CHI PLEDGE\n                              (correcting him)\n                         Pledges, Sir Brother Evan, Sir.\n\n                                     EVAN\n                         Pledges, rushees, same difference. \n                         Now this is a one-time deal. You do \n                         all this for me and I'll never give \n                         you shit again. Promise.\n\n               A buzz of excitement runs through the pledges.\n\n                                                               DISSOLVE TO:\n\n               INT. FRAT HOUSE - ATTIC HALL - NIGHT\n\n               It's peaceful now. Evan covers Kayleigh's eyes with his hands \n               as he leads her through the attic hallways. Both are dressed \n               to the nines.\n\n                                     KAYLEIGH\n                         I don't understand, where are you \n                         taking me?\n\n                                     EVAN\n                         You'll see.\n\n               EXT. FRAT HOUSE - ROOF - CONTINUOUS\n\n               The wooden door to the rooftop swings open, revealing Kayleigh \n               and Evan. Kayleigh is dazzled by what she sees:\n\n               The entire roof is decorated with fairy-lights, Chinese \n               lanterns and hundreds upon hundreds of candles. And elegant \n               romantic table for two awaits them, flanked by twelve FORMALLY \n               DRESSED SERVANTS (previously seen pledges) who respectfully \n               stare ahead with the utmost class.\n\n               Two pledges immediately pull out two chairs and stand by. \n               Kayleigh applauds and laughs with delight.\n\n                                     KAYLEIGH\n                         I don't know what to say. It's \n                         beautiful.\n\n                                     EVAN\n                         Go on. Sit down.\n\n               As she takes a step toward the table -- FLOWER PETALS shower \n               down on her. She looks up to see TWO MORE PLEDGES standing \n               on ladders, delicately tossing pedals.\n\n               Kayleigh looks overwhelmed as she sits down.\n\n                                     KAYLEIGH\n                         Why are you doing all this for me?\n\n                                     EVAN\n                         Simple math. When I woke up this \n                         morning and saw your smile... I knew \n                         that I wanted to spend the rest of \n                         my life with you.\n\n               Her hand reaches out to his and grabs it fiercely. Her eyes \n               tell him she feels the same way. A magical moment.\n\n               And they lean into each other for a kiss so enchanted it \n               might as well be their first ever --\n\n               Hunter bolts up the stairs, two at a time.\n\n                                     HUNTER\n                         We been lookin' all over for you, \n                         man.\n\n                                     SENIOR BROTHER\n                         Someone trashed your car.\n\n               The moment's gone. Evan and Kayleigh exchange worried looks.\n\n               EXT. FRAT HOUSE - PARKING LOT - CONTINUOUS\n\n               Evan runs down the front lawn to his car, the Honda parked \n               at the bottom of the hill. His face collapses.\n\n               Evan's car has been trashed and is surrounded by broken glass. \n               The seats and tires have been slashed, the hood has been \n               mysteriously yanked off and the steering wheel sits on the \n               roof.\n\n               The most unnerving thing, however, is a SPIKED LEATHER DOG \n               COLLAR hangs off the rearview mirror.\n\n               By now a crowd has gathered. Evan runs up to people.\n\n                                     EVAN\n                              (panicked)\n                         Did you see who did this? You see \n                         anyone?\n\n               No one will answer with anything more than a shrug.\n\n                                     HUNTER\n                         Probably them Pika fuckers.\n\n               But Kayleigh knows better. She stares at the collar.\n\n                                     EVAN\n                         How could he get away with this? \n                         Right in front of the goddamn frat \n                         house!\n\n               A SENIOR BROTHER angrily calls him from the lawn.\n\n                                     SENIOR BROTHER\n                         Frat house? Hey man, would you call \n                         your \"country\" a \"cunt\"?\n\n               Kayleigh shudders and Evan puts his arms around her.\n\n                                     KAYLEIGH\n                         Don't. He's probably watching.\n\n               INT. FRAT HOUSE - EVAN'S BEDROOM - NIGHT\n\n               Evan leads Kayleigh into his bedroom and shuts the door. \n               Evan can't help but look under the bed. No one. He then locks \n               the door, reaches into his desk and finds a tiny canister of \n               Pepper Spray.\n\n                                     KAYLEIGH\n                         It's my fault. I should have told \n                         you he was released a few weeks ago.\n\n                                     EVAN\n                         Might'a been nice.\n                              (re: pepper spray)\n                         Like this is gonna do any good. Maybe \n                         one of the frat guys has a gun.\n\n                                     KAYLEIGH\n                         Please, Evan. Don't even joke. He \n                         wouldn't hurt you. He's just trying \n                         to scare you away from me.\n\n                                     EVAN\n                              (shaking the cannister)\n                         Yeah, right. Tell that to Crockett.\n\n                                     KAYLEIGH\n                              (quietly)\n                         It's not his fault, Evan. You knew \n                         how bad he had it when we were kids.\n\n                                     EVAN\n                         Don't give me this Oprah-book club \n                         bad upbringing shit, because you \n                         turned out fine.\n\n                                     KAYLEIGH\n                              (quietly)\n                         My father never laid a hand on me. \n                         It's like the prick saved it all up \n                         for Tommy.\n\n               Evan sits in silence for a moment, contemplating this. \n               Kayleigh's eyes plead for him to have compassion.\n\n                                     EVAN\n                         Fine, then. We'll let campus security \n                         deal with him.\n\n               EXT. COLLEGE QUAD - NIGHT\n\n               Kayleigh and Evan walk through the all-but-deserted campus. \n               Evan seems especially paranoid. In the distance, some guy \n               vomits loudly.\n\n                                     KAYLEIGH\n                         Are you okay?\n\n                                     EVAN\n                         What do you mean?\n\n                                     KAYLEIGH\n                         It's just... you've been acting kinda \n                         strange, you know?\n\n                                     EVAN\n                         Like how?\n\n                                     KAYLEIGH\n                         I don't know. You seem... different. \n                         You make weird jokes. Your accents \n                         changed. You don't even walk the \n                         same.\n\n                                     EVAN\n                         I walk differently?\n\n                                     KAYLEIGH\n                         I can't put my finger on it, but \n                         everything's a bit off. Even the \n                         dinner tonight. It was beautiful, \n                         but...\n\n                                     EVAN\n                         I know I've been actin strange lately. \n                         It's just that... I don't want \n                         anything to happen to us.\n\n               The guy along the path gags loudly into the bushes. Kayleigh \n               and Evan instinctively avert their eyes. Suddenly, Kayleigh's \n               ears perk and she stops walking mid-stride.\n\n                                     KAYLEIGH\n                         Wait. Something's not right. Isn't \n                         that your jacket?\n\n                                     EVAN\n                         What?\n\n               The guy, wearing Evan's brown suede jacket, suddenly springs \n               to his feet, revealing his face for the first time.\n\n                                     KAYLEIGH\n                         Tommy.\n\n               Tommy has grown in the last seven years. He has long, greasy \n               hair and some tattoos. He holds a TIRE THUMPER (a short, \n               steel bat for truckers) menacingly in his right hand.\n\n               Evan stands frozen in fear, his hands rooted in his coat \n               pockets.\n\n                                     EVAN\n                         Leave us alone you sick fuck!\n\n                                     TOMMY\n                         Get this \"us\" shit. As if I was gonna \n                         lay a hand on my own sister. You've \n                         done nicely for yourself, Evan. Nice \n                         friends, nice life, not to mention \n                         you're fucking my sister. Not a bad \n                         piece of ass if I say so myself.\n\n                                     KAYLEIGH\n                         Shut up, Tommy!\n\n                                     TOMMY\n                         Aw, hey now, that was a compliment.\n\n               Tommy takes a few practice swings with the tire thumper.\n\n                                     EVAN\n                         What the hell are you doing?\n\n                                     TOMMY\n                         It wasn't enough that the whole world \n                         loves you, but you had to take away \n                         the last person on earth who didn't \n                         think I was a piece of shit.\n\n                                     EVAN\n                              (suppressing panic)\n                         No one thinks you're a piece of shit, \n                         Tommy.\n\n                                     TOMMY\n                         Right, Evan. I believe you just said \n                         \"sick fuck.\"\n\n               Tommy rushes Evan and bashes him with the tire thumper in \n               the shoulder and ribs.\n\n               Evan goes down. As Tommy prepares to bash his brains in, \n               Evan whips out the Pepper Spray and nails Tommy in the face.\n\n               Tommy reels back in pain, covering his eyes with this free \n               hand. Evan struggles to his feet and circles around Tommy, \n               keeping a distance as he douses Tommy with Pepper Spray. \n               Kayleigh screams. Tommy blindly stumbles around, madly \n               swinging the tire thumper. Evan charges forward in an \n               uncontrollable rage, rips the weapon out of Tommy's hands \n               and sprays a lethal dose of pepper spray into Tommy's open \n               mouth.\n\n                                     KAYLEIGH\n                         Evan, stop! You're gonna kill him!\n\n                                     EVAN\n                         He's a fucking maniac!\n\n               Evan knocks Tommy down with the tire thumper. Kayleigh screams \n               and tries to hold Evan back, but he easily wrestles free of \n               her. She runs to a blue streetlight on the quad.\n\n                                     EVAN\n                         He ruined Lenny's life --\n\n               Evan kicks Tommy hard in the ribs. Kayleigh pushes a button \n               on the \"Blue Light\" lamp post and an ALARM WAILS.\n\n                                     EVAN\n                         He killed Crockett --\n                              (kicks him)\n                         Murdered that woman and her baby!\n                              (kicks again)\n                         And he's trying to kill me, Kayleigh! \n                         He's trying to fucking kill me!\n\n               Evan raises the tire thumper for a final attack and swings \n               down OFF CAMERA.\n\n               CRUNCH!\n\n               Evan sees what he's done and drops the weapon, horrified. \n               Kayleigh sees what Evan's done to her brother. And stops \n               cold when she sees the damage to Tommy.\n\n               Evan rushes toward her and she stumbles backwards, still \n               terrified by his rage, and skitters away from him in a \n               crablike fashion.\n\n               SIRENS come racing to the quad. Evan looks away from Tommy's \n               limp body.\n\n               Collapses to the ground and begins to weep.\n\n                                                               DISSOLVE TO:\n\n               EXT. MAVIS PENITENTIARY - DAY\n\n               A SECURITY VEHICLE pulls through the ominous metal gates of \n               the large state prison. The vehicle stops and Evan, along \n               with nine other convicts, exit in leg and hand restraints.\n\n               INT. MAVIS PENITENTIARY - DAY\n\n               Evan, now wearing his standard issue inmate uniform, enters \n               the General Population area of the prison. PRISONERS begin \n               screaming vicious taunts and catcalls at the fresh batch of \n               new inmates. Evan tries to keep composed and walks toward \n               his cell. Evan looks up to see one of the men leaning over \n               the second tier, KARL, a huge muscular con with tattoos of \n               swastikas and other Nazi symbols on his arm, blows a kiss at \n               Evan and winks.\n\n               INT. EVAN'S CELL - DAY\n\n               Evan enters a dimly lit cell plastered with pictures of Jesus \n               Christ and various Saints. Burning flames on open cans of \n               shoe polish serve as candles to the large shrine.\n\n               There is a stained bare mattress on the top bunk. Sitting on \n               the bottom bunk is CARLOS, 30s, a massive Hispanic convict \n               covered with faded Indian ink jail tats of Christ in agony.\n\n               Carlos stares at Evan disinterestedly as Evan makes up his \n               bed on the top bunk.\n\n                                     CARLOS\n                         First time?\n\n               Evan nods glumly.\n\n                                     CARLOS\n                         Best not bitch up. Wind up someone's \n                         luggage that way.\n\n                                     EVAN\n                              (desperate)\n                         Can you protect me?\n\n                                     CARLOS\n                         Jesus himself couldn't make me take \n                         on the Brotherhood. When they come, \n                         just put your mind in another place, \n                         man. Be somewhere else.\n\n               A BUZZER SOUNDS. Carlos leaves the cell without another word.\n\n               INT. PRISON CAFETERIA - EVENING\n\n               Evan sets his tray down at a table filled with Carlos and \n               some other INMATES. No sooner has he sat down to eat, do \n               eager forks reach onto his tray and steal his food. Carlos \n               shrugs at Evan and offers him a roll.\n\n               INT. MAVIS VISITING CHAMBER - DAY\n\n               Andrea sits across from Evan in the visitor's chamber. Her \n               hair is now bottle-blonde. Four inches of Plexiglas separate \n               the two and they talk on monitored phones. Andrea, frazzled, \n               twirls an unlit cigarette.\n\n                                     ANDREA\n                         ...I spoke to your new lawyer about \n                         the appeal. He's sure he can get you \n                         off on self-defense, so if you're \n                         patient.\n\n                                     EVAN\n                         How long will I be in here?\n\n                                     ANDREA\n                         I don't know. These things take time.\n\n                                     EVAN\n                         How's Kayleigh doing? She all right?\n\n               Andrea's look tells him to look for hope elsewhere.\n\n                                     EVAN\n                         What about my journals, Mom? Did you \n                         bring the ones I asked for?\n\n               Andrea nods, holding up two comp books. \"AGE 7\" and \"AGE \n               13\".\n\n                                     ANDREA\n                         I found these. The others are still \n                         in storage.\n\n                                     EVAN\n                         Damn it, Mom. I told you I need them \n                         all!\n\n                                     ANDREA\n                         Fine. You'll get them, Evan. But I \n                         think it's far more important to \n                         focus on your case right now.\n\n               Evan looks as if he's about to disagree with her, but he \n               closes his mouth and placates her.\n\n                                     EVAN\n                         Sure, Mom. You're right. Just try to \n                         tell Kayleigh I'm sorry.\n\n               And officer signals Evan and points to his watch.\n\n                                     ANDREA\n                         I'm not gonna lose you, kiddo. Promise \n                         me you'll hang on, Ev.\n\n               They look at each other and Evan slowly lowers the phone. He \n               hangs up, Andrea still pressing her phone to her ear.\n\n               INT. MAVIS PENITENTIARY - DAY\n\n               Evan walks closely behind Carlos through a corridor, clutching \n               his journals. As he passes Karl, the Neo-Nazi, Karl reaches \n               over and firmly grabs Evan's crotch.\n\n               Evan, totally violated, turns white with rage.\n\n                                     KARL\n                         Shit on my dick or blood on my knife.\n\n               Evan stands there, stunned, unable to react when --\n\n               Another Neo-Nazi, RICK, swats Evan's journals out of his \n               hands and onto the floor. Life springs back into Evan as he \n               rushes for the journals. He and Rick grab the journals at \n               the same time. A minor tug of war.\n\n                                     EVAN\n                         Let go! They're mine!\n\n               Rick tears them away, Evan coming up with only a few torn \n               pages. Evan sees the damage and goes mental.\n\n                                     EVAN\n                         Motherfucker!\n\n               Evan swings at Rick and misses. INMATES CHEER! It's on! Rick \n               lunges for Evan, a brief and painful scuffle ensues, the \n               journals getting trampled. Suddenly -- The sounds of COCKED \n               RIFLES echo through the air. The fight stops instantly as \n               Rick and Evan look up to see --\n\n               ANGLE ON\n\n               OFFICER STATION. Officers aim rifles at the pair. From an \n               upper tier, even more officers with more rifles.\n\n               Their barrels sight directly at Evan. Rick steps away, quick \n               to maliciously scoop up Evan's torn journals.\n\n                                     KARL\n                         We'll be comin' for you tonight, \n                         sister.\n\n               Evan catches his breath, then looks at the remaining few \n               pages on the floor.\n\n               INT. EVAN'S CELL - DAY\n\n               Evan enters the cell with a few entry pages. He looks through \n               them. Nothing there.\n\n               Evan nods depressed, then sees the page from his \"Age 7\" \n               journal, grabs Carlos' duct tape and tapes the page over his \n               bed.\n\n               INT. PRISON CORRIDOR - DAY\n\n               Evan, walking toward some White Supremacists, flinches \n               whenever the occasional INMATE brushes against him. Evan is \n               completely paranoid, waiting for an inevitable attack. Karl \n               makes himself visible among them, holding a journal. He reads:\n\n                                     KARL\n                              (from Evan's journal)\n                         Today I found my grandfather's death \n                         certificate. He died in a nut house, \n                         just like my father. Mom denies it, \n                         but she thinks I'm gonna end up the \n                         same way...\n\n               The other Supremacists start laughing and calling \"looney\" \n               and \"nut job.\" Evan rushes past them and they make chicken \n               clucks at him.\n\n               EXT. PRISON YARD - DAY\n\n               Evan and Carlos sit on BLEACHERS that overlook the other \n               prisoners working out.\n\n               Evan closely watches Karl and Rick who stare daggers at him \n               from across the yard. A SKINHEAD PASSES SOMETHING with a \n               white-taped handle to Karl but no officers seem to notice.\n\n               Evan slides closer to Carlos and stares at the Jesus Christ \n               tattoos all over Carlos' back.\n\n                                     EVAN\n                         You're religious Carlos, you believe \n                         that bit about \"the Lord works in \n                         mysterious ways?\"\n\n                                     CARLOS\n                         Straight up.\n\n                                     EVAN\n                         Because I think he sent me to your \n                         cell on purpose. For you to help me.\n\n                                     CARLOS\n                         Shit. I knew you were crazy.\n\n                                     EVAN\n                         I ain't bullshitting. Jesus speaks \n                         to me in my dreams.\n\n               Carlos scoffs whatever.\n\n                                     EVAN\n                         Pack of smokes says I can prove it \n                         to you.\n\n               Carlos is suddenly interested.\n\n               INT. EVAN'S CELL - LATER\n\n               Evan holds a tattered journal entry in his hand and finishes \n               up a conversation.\n\n               Carlos looks dumbfounded.\n\n                                     EVAN\n                         So when I'm out, I need you to watch \n                         my face and hands closely.\n\n                                     CARLOS\n                         You need to see the prison shrink, \n                         man.\n\n               Their conversation stops when a convict rolls a mail cart \n               by, Evan looking up expectantly.\n\n                                     EVAN\n                         Anything today?\n\n                                     CONVICT\n                         Yep. Just not for you.\n\n               Disappointed, Evan turns back to Carlos. Holds up his journal \n               entry.\n\n                                     EVAN\n                         Just tell me if anything weird \n                         happens.\n\n                                     CARLOS\n                         Weirder than this?\n\n                                     EVAN\n                         Marks, scars, I dunno. Anything could \n                         happen I guess.\n\n               Evan studies the page.\n\n               JOURNAL ENTRY\n\n               \"On Wednesday I got in trouble for a drawing that I didn't \n               do. Mommy wont let me see it.\"\n\n               Then as he starts reading it to himself, the bars behind him \n               almost imperceptibly VIBRATE --\n\n                                                              SMASH CUT TO:\n\n               INT. FIRST GRADE CLASSROOM - DAY - 1989\n\n               Evan, seven, COMES TO in an old familiar place. WE are back \n               in Mrs. Boswell's first grade class. All of the children \n               draw colorful pictures. Evan sees some paper spindles sitting \n               on Mrs. Boswell's desk. As he heads over to them, Mrs. Boswell \n               firmly grabs his shoulders and steers him back to his own \n               desk.\n\n                                     MRS. BOSWELL\n                         No monkey business, Evan. Sit still \n                         and finish your drawing.\n\n               Evan, defeated, looks over at his blank piece of paper. He \n               smiles mischievously, and grabs some colored pencils.\n\n                                     MRS. BOSWELL\n                         That's great everyone! Just imagine \n                         anything you want to be. There are \n                         no limits.\n\n               Soon enough, an image emerges: Evan holding a knife, stands \n               over a heap of several dead inmates Karl and Rick.\n\n               When done, he sneaks over to Mrs. Boswell's desk, where the \n               two paper spindles sit. The metal needles reach up and skewer \n               a number of paper notes and messages.\n\n               Evan looks over to see Mrs. Boswell holding up his drawing, \n               horrified.\n\n                                     EVAN\n                              (musically)\n                         Oh, Mrs. Boswelllllllll?\n\n               She looks over in time to see Evan using all of his seven-\n               year old strength to WHIP his hands down toward the spindles!\n\n               The moment before his palms reach them there's a brief instant \n               where SOUNDSCAPES COLLIDE and the world behind him VIBRATES.\n\n                                                         AND WE'RE BACK TO:\n\n               INT. EVAN'S PRISON CELL - DAY - 2002\n\n               Evan comes to as ECHOES OF SCREAMING CHILDREN FADE. Alertness \n               slowly creeps back up on him as he hears:\n\n                                     CARLOS\n                         Oh sweet Jesus. It's true. It's a \n                         miracle! A miracle!\n\n               Evan looks up to see Carlos staring at him with reverence.\n\n                                     CARLOS\n                         Your hands. The stigmata!\n\n               Evan looks to see two scars in the center of each palm.\n\n                                     EVAN\n                         What did you see? What did it look \n                         like?\n\n                                     CARLOS\n                              (laughing)\n                         Signs of the Lord. They just appeared \n                         out of nowhere. I thought you were \n                         loco!\n\n                                     EVAN\n                         So you believe me?\n\n               Carlos simply stares at him, awestruck, and hands over a box \n               of cigarettes.\n\n               INT. KARL'S CELL - CONTINUOUS\n\n               Evan nervously approaches. A CREW of Aryans block his path.\n\n                                     EVAN\n                         I want to make a deal.\n\n               The Aryans laugh, make discrete eye contact with Karl, who \n               grins and signals to let Evan pass.\n\n               INT. KARL'S CELL - CONTINUOUS\n\n               Karl and Rick wait expectantly as Evan nervously enters. \n               They say nothing, relishing the fearful silence.\n\n                                     EVAN\n                         Look. I'm new to all this but I think \n                         I get how things work. You gotta \n                         join a gang or else end up dead meat.\n\n               They continue to stare.\n\n                                     EVAN\n                         Well it sure ain't gonna fucking be \n                         with no niggers or spics. So how do \n                         we do this? You gotta work your way \n                         up, and I'm the new guy.\n                              (looking ill)\n                         So... should I... I mean, do I suck \n                         your dicks right now?\n\n               Karl and Rick exchange looks.\n\n                                     KARL\n                         Is your blood pure?\n\n                                     EVAN\n                              (angry)\n                         I ain't no fucking kike if that's \n                         what you mean.\n\n               Rick stands. All muscle.\n\n                                     RICK\n                         Let's see what you got. And watch \n                         the fucking teeth or you'll be leaving \n                         without 'em.\n\n               Evan nods reluctantly and peacefully drops to his knees. \n               Karl and Rick lower their pants to their ankles. Evan looks \n               miserable, about to do the deed when -- CARLOS bulldozes \n               past the Aryans into the room, slamming Karl into the wall \n               and jamming a shank into Karl's crotch!\n\n               Rick instantly charges Carlos, but trips on the pants around \n               his ankles. Evan, anticipating Rick's fall, stomps Rick's \n               face before snatching his journals from Karl's shelf.\n\n               Evan frantically flips through them, hunting for something, \n               as the other WHITE SUPREMACISTS charge the cell.\n\n                                     EVAN\n                         Carlos!\n\n               Carlos drops Karl's writhing body to the floor and presses \n               his girth against the cell door.\n\n               Evan locates an entry and concentrates on the words just as \n               the other supremacists force the door open -- Evan focuses \n               on the words. Chanting quickly.\n\n                                     EVAN\n                         We took the woods behind the junkyard \n                         just to make sure we wouldn't bump \n                         into Tommy. We hadn't seen the smoke \n                         yet.\n\n               WORDS from the entry begin to SHIMMER. REVERBERANT SOUNDS OF \n               BARKING break the sound barrier and the image of Aryans \n               storming the cell behind him become a FRENETIC BLUR\n\n                                                              SMASH CUT TO:\n\n               EXT. JUNKYARD WOODS - DAY - 1995\n\n               Evan, thirteen again, comes to in the woods. Evan stumbles \n               at first, then rights himself. He seems strangely exhilarated. \n               A sinister victory smile.\n\n                                     EVAN\n                         Rot in hell you fucking animals.\n\n               Kayleigh and Lenny, walking by his side, do a double take. \n               Evan shrugs \"just kidding\" and looks around, getting his \n               bearings. He whips his hand out and stops them.\n\n                                     EVAN\n                         Wait. Before we --\n\n               He suddenly notices Kayleigh who now no longer looks an \n               awkward and unkempt tomboy, but rather a vibrant and feminine \n               young girl. Whereas her clothes were loose and unflattering \n               before, she is now radiant and wears fashionable styles.  \n               Evan remembers his mission and darts over to a JUNK PILE.\n\n                                     EVAN\n                         We need something to cut open the \n                         sack!\n\n               Kayleigh and Lenny stare at him, concerned for his sanity.\n\n               Evan roots through the trash until he finds something: a \n               razor sharp piece of metal about two feet long. Evan offers \n               it to Lenny.\n\n                                     EVAN\n                         I want you to take this, Lenny. \n                         Today's your day of atonement. I \n                         know how guilty you feel about that \n                         woman and her baby --\n\n                                     KAYLEIGH\n                         Evan. Stop it. It's not the time.\n\n                                     EVAN\n                              (frantic)\n                         Now's the only time!\n                              (to Lenny)\n                         Today you get a chance to redeem \n                         yourself. Start over with a clean \n                         slate. Tabula rasa --\n\n                                     LENNY\n                         What are you talking about?\n\n                                     KAYLEIGH\n                         You're acting crazy!\n\n                                     EVAN\n                              (desperate; to Lenny)\n                         Please. If you've ever trusted me \n                         before, trust me on this one.\n\n               Evan places the metal shard in Lenny's hand.\n\n                                     EVAN\n                         Cut the rope.\n\n               Lenny slowly follows Evan as he bolts away.\n\n               EXT. JUNKYARD - LATER\n\n               Evan groans on the ground, writhing. Tommy's voice hitches, \n               eyes watering from pent up frustration.\n\n                                     TOMMY\n                         Listen to me good, Evan...\n\n                                     EVAN\n                         I'll do whatever you want. You don't \n                         want me to ever see Kayleigh again, \n                         fine. Just let Crockett go. Besides, \n                         you kill him now and they'll stick \n                         you in juvy for sure. And I know \n                         you'd never leave your sister alone \n                         with your father.\n\n               Evan's words hit home and Tommy's anger slowly dissipates. A \n               look of understanding passes between them. Gratitude, even.\n\n               Tommy looks at the sack and begins to untie it. Lenny comes \n               screaming from nowhere like a bat out of hell! With all of \n               the force he can muster, he jams the metal shard all the way \n               through Tommy's throat!\n\n               Tommy clutches his throat, gagging in blood. Evan surveys \n               the scene in shock:\n\n                                     EVAN\n                         Oh fuck, Lenny, no!\n\n               Lenny drops to the floor, Indian style, wipes the dirt in \n               his hands and freezes up completely. Kayleigh wakes up and \n               SCREAMS when she sees blood spurt from Tommy's throat.\n\n               Meanwhile, Crockett escapes from the sack.\n\n               EVAN'S POV\n\n               Lenny, silhouetted by the sky, seems to vibrate violently as \n               if operating a jack-hammer.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. COLLEGE - EVAN'S DORM - NIGHT - 2002\n\n               Evan comes to in a familiar place. His original college dorm - \n               ONLY BACKWARDS.\n\n                                     EVAN\n                         Christ. Help me.\n\n               He sits upright in bed and takes in his surroundings. When \n               suddenly, Evan clutches his head in severe pain.\n\n               A MONTAGE OF IMAGES ASSAULT HIM:\n\n               INT. SORORITY BEDROOM - DAY\n\n               Color memories of Kayleigh's sorority fade to BLACK and WHITE \n               and dissipate.\n\n               EXT. FRAT HOUSE - NIGHT - 2002\n\n               Memories of Evan's vandalized car fade to BLACK and WHITE \n               and dissipate.\n\n               INT. PENITENTIARY - DAY - 2002\n\n               The faces of Karl and Rick all turn grainy...\n\n               INT. COLLEGE - EVAN'S DORM - DAY - 2002\n\n               As new images of THUMPER become more BRILLIANT.\n\n               INT. SUNNYVALE - PADDED ROOM - DAY - 2005\n\n               A new image overwhelms the others: Lenny, 13, with dark, \n               soulless eyes wearing a straight-jacket in a padded room.\n\n               BACK TO EVAN:\n\n               INT. EVAN'S DORM - DAY - 2002\n\n               Evan's eyes roll back in his head. He shakes uncontrollably \n               and blood pours from his nose.\n\n               Thumper opens the door, sees Evan convulsing and jumps back \n               in horror. He scans the hallways for assistance.\n\n                                     THUMPER\n                         Someone call 9-1-1!\n\n               INT. SUNNYVALE LABORATORY - DAY\n\n               Evan lies on an examining table undergoing another series of \n               CAT-scans. The machines are now state of the art and the lab \n               room has been redecorated.\n\n               INT. DR. REDFIELD'S OFFICE - DAY\n\n               Andrea nervously chews her fingernails as she watches Dr. \n               Redfield post CAT-scan results on the light box. A young \n               nurse pushes Evan, in a wheelchair, into the doctor's office.\n\n                                     EVAN\n                         Okay, doc. What's the damage? How \n                         much time have I got?\n\n                                     ANDREA\n                         Cute, Evan.\n\n                                     DR. REDFIELD\n                         It's a little complicated. I haven't \n                         seen results exactly like these \n                         before.\n\n                                     EVAN\n                         Are you sure? Not even with my father?\n\n               Dr. Redfield and Andrea exchange looks.\n\n                                     DR. REDFIELD\n                         Actually, these tests weren't \n                         available twenty years ago.\n\n                                     ANDREA\n                         So what did you find.\n\n               Dr. Redfield points to the CAT-scan slides, specifically, to \n               the outer lining of Evan's brain.\n\n                                     DR. REDFIELD\n                         This is where we're finding most of \n                         the hemorrhaging. The outer lining \n                         of the cerebral cortex.\n\n                                     EVAN\n                              (nonplussed)\n                         Lemme guess. Would that be where the \n                         memories are stored?\n\n               Dr. Redfield stares ahead. Transfixed by the slides.\n\n                                     DR. REDFIELD\n                         I've never seen anything like this. \n                         I've compared these to the ones taken \n                         last year, and there's evidence of \n                         severe hemorrhaging and massive neural \n                         reconstruction.\n\n               Andrea stares at him blankly. Evan impatiently \"pops wheelies\" \n               in the wheel chair.\n\n                                     ANDREA\n                         What does that mean for Evan?\n\n                                     EVAN\n                              (to Andrea)\n                         He's saying it's like forty years \n                         worth of new memories have been jammed \n                         in my brain since last year. Overload \n                         city. 'Sat about the gist of it, \n                         doc?\n\n               Dr. Redfield nods, awed by Evan's effortless interpretation. \n               Evan springs out of the wheelchair and stretches his legs.\n\n                                     EVAN\n                              (to Andrea)\n                         Mind if I wait in the car? The \n                         lighting here bugs my eyes.\n\n               Andrea nods. Evan shakes Dr. Redfield's hand.\n\n                                     EVAN\n                         Well, it's nice seeing you again. \n                         But you know, people to see, things \n                         to read...\n\n               Andrea shoots Dr. Redfield an apologetic look. Evan heads \n               out the door, accidentally knocking Dr. Redfield's jacket to \n               the floor. He shrugs apologetically and re-hangs it.\n\n               INT. SUNNYVALE CORRIDOR - CONTINUOUS\n\n               Outside the office, Evan inspects Dr. Redfield's KEYS and \n               attached SECURITY CARD and smiles. Evan covertly winds himself \n               through the maze of corridors, careful not to be seen by the \n               staff.\n\n               He finally sees a wing marked \"CRIMINALLY INSANE\". Evan looks \n               around to make certain he's not being watched, then uses the \n               security card to open the door. He looks in every room of \n               the wing until he finds --\n\n               INT. SUNNYVALE - LENNY'S ROOM - CONTINUOUS\n\n               Evan unlocks the door and is moved by what he sees.\n\n               Lenny is strapped onto a metal bed, his arms and legs in \n               tight leather restraints. The dark five o'clock shadow and \n               his malicious grin radiate evil.\n\n               His black and haunting eyes personify hate and murderous \n               intent.\n\n               Lenny seems neither surprised or happy to see Evan. That is, \n               if he's aware of Evan's presence at all...\n\n                                     EVAN\n                         Is there anything you need? Anything \n                         I can get you?\n\n               Nothing from Lenny.\n\n                                     EVAN\n                         What about the models, man? Bet I \n                         can get you a shitload of models up \n                         in here.\n\n               Still nothing. Not even a glance in his direction. Evan sighs \n               and gives up.\n\n                                     EVAN\n                         Okay, Lenny. Just wanted to say \"hi\".\n\n               Evan turns around to leave.\n\n                                     LENNY\n                         You knew the whole time, didn't you?\n                              (Evan spins around)\n                         When you put the blade in my hand, \n                         you knew something big was going to \n                         happen. Didn't you?!\n\n                                     EVAN\n                              (jaw dropped)\n                         Y... yes. I guess I did.\n\n               Lenny's eyes seethe with hate.\n\n                                     LENNY\n                         Then you should be where I am. You \n                         should be where I am.\n\n               Evan backs away, face guilt-stricken.\n\n               INT. EVAN'S DORM - DAY\n\n               Evan enters his dormroom (where everything's backwards), \n               reaches under his bed and is relieved to find the journal \n               marked \"AGE 7\".\n\n               EXT. COLLEGE QUAD - DAY\n\n               Evan is ignored by several Theta Chi pledges as he plops \n               himself by a tree and hunts through his journal to find the \n               entry from when he was seven and visited Jason at Sunnyvale.\n\n               JOURNAL ENTRY\n\n               \"Today I get to mete my father. His name is Jason and he is \n               crazy. I hope he lets me call him dad.\"\n\n               Evan takes a calming breath and begins reading.\n\n                                     EVAN\n                              (as if reciting a \n                              mantra)\n                         Today I get to meet my father. His \n                         name is Jason and he is crazy...\n\n               Evan gets some strange looks, but continues. As he does, the \n               trees and frisbee-playing students behind him VIBRATE and \n               SHUDDER.\n\n                                                              SMASH CUT TO:\n\n               INT. SUNNYVALE VISITOR'S CHAMBER - DAY - 1989\n\n               Seven-year old Evan comes to during the time he first met \n               his father, Jason.\n\n               Jason waits patiently for young Evan to finish his sentence.\n\n                                     JASON\n                         Are you okay? You looked like you \n                         were somewhere else for a second \n                         there.\n\n                                     EVAN\n                         Look, Jason, I need some fast answers \n                         if I'm ever gonna fix what I've done.\n\n               Jason is completely thrown.\n\n                                     JASON\n                         I was praying this curse would have \n                         ended with me.\n\n                                     EVAN\n                         But it didn't. And now I need info \n                         to make things right again and you're \n                         the only one who can give it to me.\n\n                                     JASON\n                              (frustrated)\n                         There is no \"right\". When you change \n                         who people are, you destroy who they \n                         were.\n\n                                     EVAN\n                         Who's to say you can't make things \n                         better?\n\n               Jason seems extremely upset to hear Evan say this.\n\n                                     JASON\n                         You can't play God, son. It must end \n                         with me. Just by being here, you may \n                         be killing your mother.\n\n                                     EVAN\n                         Bullshit. I'll send you a postcard \n                         when I've made everything perfect \n                         again.\n\n               Jason launches himself across the table, shackles and all, \n               and grabs hold of Evan's throat.\n\n               EVAN'S POV\n\n               As Jason looks down at us, frothing at the mouth, there's a \n               trick of the light where Jason's head seems to VIBRATE against \n               the ceiling.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               EXT. COLLEGE QUAD - DAY - 2002\n\n               Evan's hands instinctively reach for his throat, then he \n               realizes his surroundings. Heartbroken, he shuts the journal \n               and stands up shakily.\n\n               INT. RIDGEWOOD DINER - EARLY EVENING\n\n               Evan eats in the same diner where Kayleigh used to work. As \n               he eats, his arm sits in front of his plate, protectively. \n               Guarding his food.\n\n                                     WAITRESS\n                         Just get out, didja?\n\n                                     EVAN\n                         Huh?\n\n                                     WAITRESS\n                              (re: his arm)\n                         Nothing. Just that my brother did a \n                         stint in the pen and he used to eat \n                         like that.\n\n                                     EVAN\n                              (defensively)\n                         I come from a big family.\n\n                                     WAITRESS\n                         Meant no offense.\n\n                                     EVAN\n                         None taken. Hey, uh, does Kayleigh \n                         Miller still work here?\n\n                                     WAITRESS\n                              (confused)\n                         Sorry. Never heard of her.\n\n               EXT. MILLER HOUSE - EVENING\n\n               Evan slowly walks up the driveway, which is now a dilapidated \n               mess. Garbage litters the front lawn and paint chips rot off \n               the sides of the house. Inside, Mr. Miller yells at someone.\n\n                                     MR. MILLER\n                         Just shut the hell up already! Can't \n                         a man get a little goddman peace in \n                         his own home!\n                              (Evan rings doorbell)\n                         Oh, for Christ's sake, now what?\n\n               Mr. Miller opens the door and sees Evan.\n\n                                     MR. MILLER\n                         Don't suppose you're here to sell \n                         cookies?\n\n               In a blur, Evan grabs Mr. Miller's shirt and violently shoves \n               him through the house and into a wall.\n\n                                     EVAN\n                         Good guess, fuckbag.\n                              (off Miller's startled \n                              face)\n                         Remember me now? We had a great chat \n                         once when I was seven.\n\n               Mr. Miller goes slack, his eyes wide with horror.\n\n                                     EVAN\n                         One question, fuckbag. Where can I \n                         find your daughter?\n\n               EXT. SEEDY HOTEL - NIGHT\n\n               Evan walks past some junkies and enters.\n\n               INT. SEEDY HOTEL - CONTINUOUS\n\n               Evan steps over some passed out bodies that litter the hallway \n               of an incredibly seedy motel. The kind with hourly rates. He \n               knocks on a door.\n\n               Kayleigh, now haggard, strung-out junkie, opens the door and \n               immediately the contempt for Evan grows in her eyes. She \n               puts out an expression of disappointment.\n\n                                     KAYLEIGH\n                         Oh, I thought you were my eight \n                         o'clock. Make it fast, I'm expecting \n                         someone.\n\n                                     EVAN\n                         Nice to see you, too. Can I come in?\n\n               She looks around, waves him in.\n\n                                     KAYLEIGH\n                         If I knew you were coming I'd have \n                         cleaned the stains off the sheets.\n\n               INT. KAYLEIGH'S SEEDY HOTEL ROOM - CONTINUOUS\n\n               The room is dirty and sparse, excepting charred-bottom spoons, \n               yellowed cotton balls and brown-spotted squares of tin foil. \n               Evan doesn't hesitate to sit on the \"soiled\" bed.\n\n                                     KAYLEIGH\n                         What do you want?\n\n               Evan can't speak. His eyes begin to water.\n\n                                     EVAN\n                         I just needed to see... a friendly \n                         face.\n\n               His sincerity touches her.\n\n                                     KAYLEIGH\n                         Well, time is money, Evan. So you...\n\n               Evan reaches for his wallet and throws it on her dresser. \n               Kayleigh eyes the wallet. But makes no move to pick it up.\n\n                                     KAYLEIGH\n                         Well, I guess I can spare ten minutes \n                         for an old friend, right?\n\n               Tears fall freely from Evan's eyes.\n\n                                     KAYLEIGH\n                         So how's tricks? Sorry, occupational \n                         humor.\n\n                                     EVAN\n                         I get it. You can drop it now.\n\n                                     KAYLEIGH\n                              (angry again)\n                         Oh, I'm sorry. Does my line of work \n                         make you uncomfortable, precious?\n\n                                     EVAN\n                         No. Just that you need to hurt me \n                         with it. I've been where you've been.\n\n                                     KAYLEIGH\n                         Ha! Where's that?\n\n                                     EVAN\n                         The bottom. When you're just a piece \n                         of meat waiting for the next attack.\n\n               Kayleigh watches Evan silently.\n\n                                     KAYLEIGH\n                         What's happened to you?\n\n                                     EVAN\n                         You wouldn't believe me. I mean, \n                         people always say, \"You wouldn't \n                         believe me\", but in this case, it's \n                         not even worth trying.\n\n                                     KAYLEIGH\n                         I've seen some sickening shit. I \n                         don't blink twice anymore, especially \n                         in your case.\n\n                                     EVAN\n                         Why's that?\n\n                                     KAYLEIGH\n                         Because you're... different.\n\n                                     EVAN\n                         Different? How?\n\n                                     KAYLEIGH\n                         Let me ask you a question. Just a \n                         little one that's been gnawing at me \n                         for years.\n\n                                     EVAN\n                         Yeah?\n\n                                     KAYLEIGH\n                         On the bridge. How did you know that \n                         Tommy had your dog? That was no \n                         fucking hunch.\n\n                                     EVAN\n                         Do you remember when I was a kid and \n                         I had those blackouts?\n\n               Evan continues and Kayleigh listens with a mixture of intense \n               interest and matched skepticism.\n\n                                                         DISSOLVE TO LATER:\n\n               INT. DINER - NIGHT\n\n               Kayleigh finishes a plateful of food at a busy diner. She \n               lights up an after-dinner smoke.\n\n                                     KAYLEIGH\n                         You're right, Evan, I don't believe \n                         you.\n\n                                     EVAN\n                         I never thought you would. That's \n                         why I've never bothered to tell a \n                         soul until now, and why I never will \n                         again.\n\n                                     KAYLEIGH\n                         I'm the only person you've told? \n                         That's a great line. Does that make \n                         other girls swoon? Do they actually \n                         eat up this bullshit?\n\n                                     EVAN\n                         I couldn't give a shit if you believe \n                         me or not, and frankly I'm too tired \n                         to prove it to you.\n\n                                     KAYLEIGH\n                         Oh? There's proof now?\n\n                                     EVAN\n                              (tired)\n                         Shit. I dunno. How would I know about \n                         the twin moles on your inner thigh?\n\n                                     KAYLEIGH\n                         Anyone with fifty bucks could tell \n                         you that.\n\n                                     EVAN\n                         Then forget that. How about... you \n                         prefer the smell of a skunk to \n                         flowers, you hate cilantro because \n                         for reasons unknown to you, it reminds \n                         you of your step-sister.\n\n               Kayleigh's jaw drops.\n\n                                     EVAN\n                         Oh! And when you orgasm, your toes \n                         go numb. I'm sure your clientele \n                         aren't privy to that one.\n\n               Kayleigh tries to conceal the surprise in her eyes.\n\n                                     EVAN\n                         I just thought you should know.\n\n                                     KAYLEIGH\n                         Know what?\n\n                                     EVAN\n                         That I didn't leave you there to \n                         rot.\n\n               Kayleigh flinches as if her should had been invaded, then \n               her eyes fill with distrust and contempt.\n\n                                     KAYLEIGH\n                         There's one major hole in your story.\n\n                                     EVAN\n                         Which is?\n\n                                     KAYLEIGH\n                         There is no fuckin' way on this planet \n                         or any other that I was in some \n                         fuckin' sorority.\n\n               She opens Evan's wallet and leaves a twenty on the table.\n\n                                     KAYLEIGH\n                         Sure you don't want your wallet?\n\n                                     EVAN\n                         Don't think I'll need it where I'm \n                         going.\n\n                                     KAYLEIGH\n                         Off to change everyone's life again, \n                         is that it? Maybe this time you'll \n                         pop up in some mansion while I wind \n                         up in Tijuana doing the donkey act.\n\n                                     EVAN\n                         I'm over it. Whenever I try to help \n                         anyone it all turns to shit.\n\n                                     KAYLEIGH\n                         Well, don't give up now, Slick. You've \n                         already done so much for me. Hell, \n                         why don't you go back in time and \n                         save Mrs. Halpern and her baby. Then \n                         maybe Lenny wouldn't freak out and \n                         ruin my family.\n\n               She gets up and puts on her coat.\n\n                                     KAYLEIGH\n                         Oh, here's one! Go back when I'm \n                         seven and fuck me in front of Daddy's \n                         handicam, you know, straighten me \n                         out a bit...\n\n               She tosses his wallet over her shoulder at him and leaves.\n\n               INT. EVAN'S DORM - DAY\n\n               Evan enters his familiar looking dorm and hears the familiar \n               sounds of Thumper having sex with another naked GOTHIC CO-\n               ED. On Evan's bed.\n\n                                     EVAN\n                         Get out. Both of you.\n\n                                     THUMPER\n                         Sorry, dude. Just figured it'd be \n                         okay with you bein' sick and all.\n\n               Evan's temper flares and he picks up a chair and SMASHES it \n               against a wall above Thumper's head.\n\n                                     EVAN\n                         I'm not saying it again.\n\n               Thumper and the co-ed quickly cover themselves in the blankets \n               and leave. Alone in the room, Evan looks under his bed and \n               breathes a sigh of relief to see all of his journals are \n               intact. He sifts through them again. He finally finds the \n               passage he needs. Something catches the corner of Evan's \n               eyes and he turns to examine it.\n\n               To the left of Thumper's Buddha statuette sits a large VOTIVE \n               CANDLE that bears a portrait of Jesus Christ.\n\n                                     EVAN\n                              (humble)\n                         Lord give me the strength and guidance \n                         I need to set things right.\n\n               As he begins reading a passage to himself, SOUNDS ECHO \n               backward at us from another time and place. And the entire \n               ROOM SHIMMERS around him --\n\n                                                              SMASH CUT TO:\n\n               EXT. MRS. HALPERN'S HOUSE - DAY - 1995\n\n               Evan comes to as he, Kayleigh, Lenny and Tommy -- all thirteen -- \n               watch Mrs. Halpern carry her baby back to the mailbox across \n               the street with intense anticipation. Evan suddenly comes to \n               life and makes himself visible, running across the street \n               shouting.\n\n                                     EVAN\n                         Lady, stay back! Don't go near the \n                         mailbox!\n\n               Mrs. Halpern, startled, stares at the young kid skeptically \n               as she absently continues toward the mailbox.\n\n                                     EVAN\n                         I mean it, woman! Get the hell back!\n\n               Lenny comes running across the street to Evan's aid, and \n               Tommy shrugs and follows after him.\n\n                                     LENNY\n                         There's a bomb in the mailbox. Get \n                         away!\n\n               Tommy, still running, cringes to hear Lenny's stupid \n               confession and rolls his eyes at the situation. Evan positions \n               himself between Mrs. Halpern and the mailbox, frantically \n               waving his hand at her to stay back, because she's STILL \n               COMING.\n\n                                     TOMMY\n                         I'll save you lady!\n\n               Tommy takes a running dive at Mrs. Halpern, perhaps a bit \n               too hard, and sends her and the baby to the pavement, hurt, \n               but no major injuries.\n\n               Seeing things are safe, Evan backs away from the mail --\n\n               BOOM!\n\n               The blast is deafening! Evan's body is hurled backwards \n               dramatically.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S DORM - DAY - 2002\n\n               Evan comes to back in his dorm, the same posters are on the \n               wall, the sheets are the same. Even the familiar sounds of \n               Thumper having sex under the covers.\n\n                                     EVAN\n                         I thought I told you two to beat it.\n\n               Evan's face falls as he hears a familiar voice, but not \n               Thumper's.\n\n                                     LENNY\n                         What? Hey, sorry, man. We wake you \n                         up?\n\n               Evan is confused by Lenny's presence, but smiles to himself \n               and shakes his head \"no\".\n\n                                     EVAN\n                         No, it's cool.\n                              (re: Lenny's okay)\n                         Really cool.\n\n               Evan yawns, bringing his hand to his mouth, but there's no \n               hand. No arm, really, either. Just two FLESHY STUMPS!\n\n               Evan bolts upright in bed and stares down at his amputations.\n\n               A FLOOD OF MEMORIES ASSAULT HIM:\n\n               We see countless and brief image flashes of Evan growing up \n               from the age of thirteen with NO ARMS, and requiring a \n               WHEELCHAIR.\n\n               INT. MULTIPLEX THEATER LOBBY - DAY - 1995\n\n               Tommy and Kayleigh load popcorn and drinks onto Evan's lap \n               as Lenny pushes the wheelchair.\n\n               INT. ANDREA'S HOUSE - KITCHEN - DAY - 1995\n\n               Evan celebrates his 14th birthday and blows out the candles. \n               Andrea, Kayleigh, Tommy and Lenny all clap.\n\n               EXT. CHURCH - DAY - 1995\n\n               Tommy pushes Evan to church.\n\n               INT. EVAN'S DORM - DAY - 2002\n\n               Evan screams as blood pours from his nose. Lenny is out of \n               bed at once to help him... as is KAYLEIGH! (Now beautiful \n               and natural looking).\n\n               QUICK SERIES OF FLASHES:\n\n               EXT. LAKE - DAY - 1999\n\n               Lenny and Kayleigh, as teens, sit together with Evan at the \n               far end of the boat.\n\n               INT. HIGH SCHOOL - DAY - 1999\n\n               Evan looks on longingly as Lenny and Kayleigh become lovers \n               in high school.\n\n               EXT. WOODS - NIGHT - 1999\n\n               A campfire. Evan sips from a BEER CAP as Lenny and Kayleigh \n               make out in plain sight with Tommy's bashful approval.\n\n               BACK TO EVAN:\n\n               INT. DORM HALLWAY - DAY - 2002\n\n               Evan's in agony as Kayleigh opens a series of dorm doors and \n               Lenny rushes Evan's wheelchair through. Kayleigh carries a \n               pair of prosthetic arms in her hands.\n\n               Evan moans and tries to rub his temple with his stump.\n\n                                     EVAN\n                         Where are we going?\n\n                                     KAYLEIGH\n                         We have to get you to Sunnyvale. \n                         You're having one of your famous \n                         hemorrhages.\n\n                                     EVAN\n                         Stop! Take me back!\n\n                                     LENNY\n                         Sorry, tough guy, no can do. Your \n                         mother would kill me.\n\n               Evan launches his body forward and spills clumsily out of \n               the wheelchair. Lenny must halt in order not to crush Evan. \n               As Evan writhes about on the floor, his legs paralyzed, a \n               CROWD GATHERS.\n\n               Evan focuses on Lenny, but it's hard to ignore the crowd \n               that titters and snickers in the background.\n\n                                     EVAN\n                         Take me back, Lenny!\n                              (teeth clenched)\n                         You owe me that much.\n\n               Kayleigh turns to face the jeering crowd.\n\n                                     KAYLEIGH\n                         What are you geeks looking at? Must \n                         be nice to be so goddamned perfect, \n                         huh? Fucking losers.\n\n               The crowd breaks up and leaves.\n\n               EXT. COLLEGE QUAD - DAY\n\n               It's calm now. Lenny and Kayleigh push Evan's wheelchair \n               around the quad. Evan now wears prosthetic arms. Random PEOPLE \n               call out to Lenny. He's extremely popular in this world.\n\n                                     LENNY\n                         'Sup, Sheila! We missed you at the \n                         party! Don't even think I'm giving \n                         you my lab notes either! Think I \n                         like getting up for \"eight thirty's\"?\n\n               Lenny pushes Evan past Thumper and Cricket. Their conversation \n               stops and they stare at their feet as Evan gets wheeled by. \n               Evan boils to be treated as if he were non-existent.\n\n                                     LENNY\n                         Hey, there's Tommy.\n\n               Evan spins around in fear. He sees Tommy, clean-cut, and \n               handing out flyers in front of a banner that reads \"Campus \n               Crusade for Christ.\" Tommy seems good-natured now, working \n               hard and soliciting names for his list. He looks up as Evan \n               rolls along and his eyes brighten to see Evan.\n\n                                     TOMMY\n                         I did what you said, man! We're \n                         pooling our student funds with Hillel \n                         House and we're going to have an \n                         Awareness Dance.\n\n                                     EVAN\n                         Oh goody, nothing like spinning my \n                         chair around to a techno mix of Hava \n                         Nagila til I puke.\n\n               Tommy frowns and exchanges glances with Lenny, who shrugs \n               and nods back to him.\n\n                                     LENNY\n                         Uh, we should be getting to class \n                         now.\n\n                                     EVAN\n                         Forget it. What's the point of Psych \n                         now? Tomorrow I could wake up as \n                         some dirt farmer in Bangladesh.\n\n               Another exchanged glance. Kayleigh looks at Evan.\n\n                                     KAYLEIGH\n                         Let's go for a stroll.\n\n               Evan allows Kayleigh to roll him away from the others. To \n               the very spot where Evan once killed Tommy.\n\n               Evan stares at his prosthetic hand which he can \"magically\" \n               will to open, close, open, close...\n\n                                     EVAN\n                         So Tommy's really into this Jesus \n                         kick, huh?\n\n               Kayleigh looks at him curiously.\n\n                                     KAYLEIGH\n                         You know how spiritual he's gotten \n                         ever since he saved Mrs. Halpern and \n                         Katie.\n\n                                     EVAN\n                         He saved Mrs. Halpern? Please, the \n                         twisted fuck.\n\n               Kayleigh, now by a bench. Stops and sits. As she casually \n               uses her foot to turn his chair to face her, she pulls out a \n               granola bar and hands it to him.\n\n               His prosthetic hand crushes it. It crumbles to dust. She \n               seems more confused.\n\n                                     KAYLEIGH\n                         Is something the matter?\n\n                                     EVAN\n                              (re: prosthetic arms)\n                         Yeah, I think I gotta get these fixed \n                         or something.\n\n               She leans into him, gently feeding him her remaining bar.\n\n                                     EVAN\n                         Kayleigh? Do you ever think about \n                         \"us?\" I mean, wonder if it could \n                         ever have been different between the \n                         two of us?\n\n                                     KAYLEIGH\n                         Sure, Evan, why not? You were the \n                         first person I really ever cared \n                         about.\n\n                                     EVAN\n                         I was?\n\n                                     KAYLEIGH\n                         That's why when I was little I never \n                         went to live with my mother.\n\n                                     EVAN\n                         I don't get it.\n\n                                     KAYLEIGH\n                              (feeding another bite)\n                         When my folks split, they gave me \n                         and Tommy a choice who we wanted to \n                         live with. I couldn't stand my dad, \n                         but I knew if I moved to my mom's \n                         I'd never see you again.\n\n                                     EVAN\n                         I never knew that. So then you still \n                         sometimes think of us... together?\n\n                                     KAYLEIGH\n                         It's crossed my mind from time to \n                         time.\n\n                                     EVAN\n                              (hopeful)\n                         And...?\n\n                                     KAYLEIGH\n                         Well a lot of things cross my mind. \n                         I've always been a fast thinker, Ev. \n                         I can play out the movie of our entire \n                         lives in under a second. Boom -- we \n                         fall in love -- get married -- two \n                         kids, your keen analytical insight \n                         matched to my generous nature -- \n                         kids grow old as do we, relatively \n                         stable relationships, matching burial \n                         plots, the whole bit. It took a lot \n                         longer to spit out than to imagine.\n\n                                     EVAN\n                         Then you think it might have worked \n                         out?\n\n                                     KAYLEIGH\n                         Why not? But that's not how things \n                         wound up. I'm with Lenny, Lenny's \n                         your friend. And there it ends.\n\n               She looks into his eyes and shrugs almost apologetically. \n               Tears streak down Evan's face as he speaks in a pleading \n               tone.\n\n                                     EVAN\n                         Would it make any difference if I \n                         told you that no one could possibly \n                         love anyone as much as I love you?\n\n               Kayleigh shakes her head sadly, then suddenly looks up. Evan \n               turns to see Lenny waving her over. She puts her hand on \n               Evan's shoulder, stands and goes to Lenny.\n\n               Evan can't take his eyes off her.\n\n               ANGLE ON\n\n               Lenny kissing Kayleigh. In painful slo-mo. Evan turns away, \n               utterly heartbroken.\n\n               INT. HANDICAPPED BATHROOM - DAY\n\n               CLOSE UP\n\n               Evan's stump turns on a BATHTUB FAUCET.\n\n               REVEAL:\n\n               Evan, fully clothed, lies in a bathtub that's filling with \n               water. Beside the tub, the wheelchair has been tipped over.\n\n               The water rises past his mouth, to his nostrils -- Evan makes \n               his peace and takes a final breath.\n\n               And the water spills over the side of the tub. All Evan can \n               do is watch it, still breathing easily through his nose.\n\n               A beat. Then the door opens.\n\n               TOMMY ENTERS. Immediately sizing up the situation.\n\n                                     TOMMY\n                         You forgot to put the toaster on the \n                         edge.\n\n               Tommy casually turns off the water, then pops open the DRAIN. \n               The water level lowers to Evan's mouth.\n\n                                     EVAN\n                         But you, Kayleigh and Lenny like \n                         toast. And that's really all that \n                         matters now.\n\n               Tommy feels Evan's anguish and plops his ass on the wet floor \n               by the tub. He lays his head onto Evan's shoulder.\n\n               Evan bristles at first, but finally gives in to his hatred, \n               ultimately resting his own head against Tommy's. Taking the \n               comfort offered.\n\n                                     TOMMY\n                         I'll get you changed. Visiting hours \n                         are almost up.\n\n               INT. ST. VINCENT'S HOSPITAL - EVENING\n\n               Tommy rolls Evan through a quiet hospital corridor.\n\n                                     EVAN\n                              (looking around)\n                         What, did mom get transferred again?\n\n               Tommy frowns, confused, then rolls Evan into --\n\n               INT. ANDREA'S ROOM - CONTINUOUS\n\n               Evan is startled to see Andrea hooked up to several IV's, an \n               oxygen tank and a respirator. Several oxygen hoses connect \n               to a tracheotomy tube.\n\n               Tommy smiles and kisses Andrea on the cheek. She tousles his \n               hair in return.\n\n               Evan can hardly speak. As Tommy begins to wheel Evan's chair \n               closer to Andrea's bedside, Andrea utters a faint whisper.\n\n                                     ANDREA\n                         Looking. Good. Kiddo.\n\n               Evan eyes her MEDICAL CLIPBOARD as he's wheeled by.\n\n                                     EVAN\n                              (reading)\n                         Lung cancer?\n\n                                     TOMMY\n                         Sorry, Mrs. T. He's been out of sorts \n                         lately.\n\n               Andrea flinches to hear this. Evan stares at her, eyes wide.\n\n                                     EVAN\n                         Right... You started chain smoking \n                         after I blew myself up.\n\n               Evan suddenly seems sick with guilt.\n\n                                     EVAN\n                         There must be a way to fix this.\n\n                                     ANDREA\n                         Fix?\n\n                                     EVAN\n                         I just need the entry about the \n                         blockbuster. Wait, shit, no arms. I \n                         never even got the chance to write \n                         it.\n\n               A flicker of recognition registers in her eyes.\n\n                                     ANDREA\n                         Is Evan... different?\n\n                                     TOMMY\n                         He's just going through some tough \n                         times.\n\n                                     EVAN\n                         Mom. Don't cry. I can change this.\n\n                                     TOMMY\n                         I think I'll go check out the chapel.\n\n                                     ANDREA\n                         You're. Acting. Like your father.\n\n                                     EVAN\n                         Come on, Mom. Just 'cause Dad was my \n                         age when he started going crazy \n                         doesn't mean that I'm nuts.\n\n               Andrea is shocked.\n\n                                     ANDREA\n                         How. Did you. Know that?\n\n                                     EVAN\n                         You told me that on Parents' Weekend. \n                         Remember? Wait, that wasn't me. Or \n                         you.\n\n               She uses her left hand to pinch off the air to her oxygen \n               tube and forces herself to speak in a sick, GRAVELY manner.\n\n                                     ANDREA\n                         Just. Like. Jason.\n\n                                     EVAN\n                         Don't worry. I'm gonna get you out \n                         of here.\n\n               He pushes a lever and the mechanical wheelchair rolls itself \n               out of the room.\n\n               Andrea forces her loudest raspy scream.\n\n                                     ANDREA\n                         Stop him. Stop him. Stop him...\n\n               INT. EVAN'S DORM - NIGHT\n\n               Lenny tears through old cardboard boxes in Evan's closet. \n               Evan watches nearby.\n\n                                     LENNY\n                         Are you sure you even packed it?\n\n                                     EVAN\n                         My mom packed for me. I think she \n                         sent everything I ever owned. So \n                         we'll see.\n\n               Evan watches Lenny eagerly as he dumps tons of Evan's junk \n               on the floor. Old report cards, books, toys and photo albums \n               fall on the floor.\n\n                                     LENNY\n                         Is this it?\n\n               Evan beams when he sees Lenny holding his old journal. AGE \n               7.\n\n                                     LENNY\n                         What do you need it for? I don't get \n                         you lately.\n\n                                     EVAN\n                         Duly noted. Now I'm gonna ask you \n                         for one last favor.\n\n                                     LENNY\n                         What?\n\n                                     EVAN\n                         Shhh. I need to concentrate on the \n                         blockbuster if I'm gonna destroy it.\n\n                                     LENNY\n                              (concerned)\n                         Destroy it?\n\n                                     EVAN\n                         If I hadn't blown my arms off, Mom \n                         never woulda started smoking in the \n                         first place. Now shhhh.\n\n               Lenny, utterly baffled, sits back in silence and watches \n               Evan begin reading his journal to himself for a beat.\n\n               ON EVAN\n\n               As new sounds ECHO BACKWARD. There's a --\n\n               SHIMMER!\n\n                                                              SMASH CUT TO:\n\n               INT. ANDREA'S HOUSE - KITCHEN - MORNING - 1989\n\n               Evan comes to in his childhood kitchen. He is only seven \n               years old. He coughs up Lucky Charms that have \"magically\" \n               appeared in his mouth. On a journal before him is the recently \n               written passage:\n\n               JOURNAL ENTRY\n\n               \"Today Mommy is taking me to play with Kayley and Tommy. I \n               will mete there father and see what a real dad is like.\"\n\n               Andrea is nowhere in sight. Evan springs to his feet and \n               flexes his real hands triumphantly.\n\n                                     EVAN\n                         Yes. Now how do I destroy the \n                         blockbuster?\n\n               He rummages through the utensil drawer and pulls out a large \n               butcher knife and grabs it. He tucks it into his sock but it \n               won't fit. He's still debating what to do when:\n\n               ANDREA WALKS IN and is startled by the unexpected sight of \n               Evan holding a huge knife.\n\n               Evan sees her but remains expressionless. Andrea's face \n               blanches.\n\n                                     ANDREA\n                         Evan? What are you doing with that \n                         knife?\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S DORM - NIGHT - 2002\n\n               Evan comes to to find Lenny still staring at him. Waiting \n               for something big to happen.\n\n                                     EVAN\n                         Well, that didn't work...\n\n               Evan flips a single page of his journal and tries again. He \n               reads to himself, then relaxes his head --\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. MILLER'S BASEMENT - DAY - 1989\n\n               Evan, seven again, stands in the basement dressed in his \n               Robin Hood costume as Mr. Miller prepares for the sex scene.\n\n                                     MR. MILLER\n                         Now in this part of the story, Robin \n                         Hood just married Maid Marian and \n                         they have to kiss and stuff like \n                         grown-ups do.\n\n               Kayleigh giggles. There seems to be a new glint of \n               intelligence in Evan's eyes as he adjusts to his new \n               surroundings.\n\n                                     EVAN\n                         Wait! I need my belt!\n\n               Mr. Miller is puzzled, but watches Evan SKIP to the fireplace.\n\n                                     EVAN\n                              (overly childlike)\n                         Loo loo, skip to my loo. Loo loo, \n                         skip to my loo.\n\n               Mr. Miller puts his eye back to the viewfinder as Evan quickly \n               finds Mr. Miller's old army thermos in the bottom drawer of \n               the dresser, opens it and shakes out the blockbuster.\n\n                                     EVAN\n                         Loo, loo, skip to my loo.\n\n               He tries to crack it with his own hands, but his seven-year \n               old body is too weak.\n\n                                     MR. MILLER\n                         Hey kid, don't bother with the belt.\n\n               Mr. Miller finally turns around and sees Evan banging the \n               blockbuster on the table. Shock registers in Mr. Miller's \n               eyes and he takes a step towards Evan.\n\n                                     EVAN\n                         Back off, fuckbag!\n\n               Mr. Miller freezes on that, and Evan smiles at him.\n\n                                     EVAN\n                         Amazing. That word never fails to \n                         make an impression with you...\n\n               Mr. Miller takes a slow, non-threatening step toward Evan.\n\n                                     MR. MILLER\n                         Easy does it, Evan! Don't be a bad \n                         boy or I'll tell mommy you were \n                         naughty.\n\n                                     EVAN\n                         And I'll tell the Child Protective \n                         Services about your kiddie porn \n                         endeavors. One step closer and I'll \n                         shove this up your ass!\n\n               Kayleigh's mouth hangs open with utter amazement at the scene. \n               Tommy, hiding at the top of the stairs, slowly creeps down \n               to get a better view.\n\n               Evan rummages in the bureau and finds the wooden \"strike \n               anywhere\" matches used at thirteen to light his cigarettes.\n\n                                     MR. MILLER\n                         That's dangerous! You could blow \n                         your hands off!\n\n                                     EVAN\n                         Been there, done that.\n\n               Evan, standing near the fireplace, defiantly strikes the \n               match with this thumb and lowers the flame to the short fuse.\n\n               Mr. Miller charges Evan just as the fuse is lit! Mr. Miller \n               knocks the blockbuster from Evan's hand and it rolls towards \n               the other side of the room, resting peacefully against the \n               video camera.\n\n               Kayleigh's eyes are dazzled by the sparkling fuse and she \n               bends down to pick it up --\n\n                                     MR. MILLER/TOMMY/EVAN\n                         Kayleigh! NOOOOOooooo!\n\n               EXT. MILLER'S HOUSE - DAY - 1989\n\n               BOOM! The blast is deafening.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. SUNNYVALE - EVAN'S ROOM - DAY - 2002\n\n               Evan, twenty, wakes up with a bloody nose.\n\n                                     EVAN\n                         Oh God, Kayleigh...\n\n               Evan gets a new series of QUICK IMAGES and FLASHED FACES.\n\n               INT. FAMILY COURTROOM - DAY - 1989\n\n               Evan (now seven) is institutionalized before a judge.\n\n               INT. SUNNYVALE INSTITUTION - DAY - 1989-1994\n\n               Evan (seven through twelve) GROWS UP in an institution.\n\n               INT. DR. REDFIELD'S OFFICE - DAY - 1989-1994\n\n               Evan undergoes years of therapy under Redfield's care.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S ROOM - SUNNYVALE - DAY - 2002\n\n               Evan lies in a room, same posters from college adorn the \n               walls. Blood flows freely now.\n\n                                     EVAN\n                              (sobbing uncontrollably)\n                         Kayleigh... no! You can't die again! \n                         I won't let this happen. I won't!\n\n               Evan fights off the pain and looks under his bed for \n               something.\n\n                                     EVAN\n                         Where are they?!\n\n               His journals are missing! He runs from the room.\n\n               INT. DR. REDFIELD'S OFFCIE - DAY\n\n               Evan runs into Dr. Redfield's office just as another patient \n               is leaving.\n\n                                     DR. REDFIELD\n                         Hey, Evan. What's the big rush? We \n                         don't meet for another hour.\n\n                                     EVAN\n                         Where are my goddamn books?\n\n                                     DR. REDFIELD\n                         Books?\n\n                                     EVAN\n                         My journals! Where are they?\n\n               The doctor looks heartbroken, as if Evan has had a relapse.\n\n                                     DR. REDFIELD\n                         It kills me to have to go through \n                         this again. There are no journals. \n                         There never were. It's part of this \n                         fantasy world your mind created to \n                         cope with the guilt of killing...\n\n               Evan looks stunned. Refusing to believe it.\n\n                                     DR. REDFIELD\n                         Think Evan. You've invented a disease \n                         that doesn't exist. Alternate \n                         universes with colleges, prisons, \n                         paraplegia...\n\n                                     EVAN\n                         But I... I need those books.\n\n                                     DR. REDFIELD\n                         You remind me of your father. He \n                         always screamed for a photo album \n                         even though he never had one.\n\n                                     EVAN\n                         Photos?\n\n               Evan's eyes roll back and he collapses lifelessly to the \n               floor.\n\n               INT. SUNNYVALE LABORATORY - DAY\n\n               Evan lies on a platform and gets another series of CAT-scans.\n\n               INT. EVAN'S ROOM - NIGHT\n\n               Evan, no longer incapacitated, stares out the window into \n               the darkness. Alone.\n\n               Trapped. Hopeless.\n\n               INT. DR. REDFIELD'S OFFICE - DAY\n\n               Later that day, Dr. Redfield posts the new CAT-scan slides \n               on the light box and shudders when he sees the results. Andrea \n               looks on anxiously.\n\n                                     DR. REDFIELD\n                         Jesus, no.\n\n               Andrea, biting her nails, is unable to conceal her fear.\n\n                                     ANDREA\n                         No dances, just tell me.\n\n                                     DR. REDFIELD\n                              (devastated)\n                         The hemorrhaging... the neural damage \n                         is irreparable. I'm frankly surprised \n                         he still has use of his motor \n                         functions.\n\n               Andrea begins to break down in tears. Evan secretly listens \n               in from the hallway.\n\n               His gaunt face looks deep in thought. He takes a breath and \n               enters the lab, making sure not to look directly at his \n               weeping mother.\n\n                                     EVAN\n                         Hey, Mom, didja remember to bring \n                         those goofy old home movies we used \n                         to make?\n\n               Andrea wipes tears away, nodding in advance.\n\n               INT. DR. REDFIELD'S CORRIDOR - NIGHT\n\n               Evan sees no one is watching him in the institution corridor \n               as he throws his weight into the door of the doctor's office, \n               breaking it open.\n\n               Sporadically, severe VIBRATIONS invade Evan's environment, \n               threatening to distract him from his mission.\n\n               INT. DR. REDFIELD'S OFFICE - NIGHT\n\n               Evan enters the office and tears the file cabinets apart, \n               looking for something.\n\n               His nose bleeds profusely and he repeatedly wipes the blood \n               off his face with irritation.\n\n               Evan sees a cardboard marked TREBORN, E. Grabs it and hides \n               under the doctor's desk.\n\n               INT. DR. REDFIELD'S CORRIDOR - CONTINUOUS\n\n               FLASHLIGHT BEAMS stab through the darkened corridor hunting \n               for him. An ALARM SOUNDS. GUARDS are shouting.\n\n               INT. DR. REDFIELD'S OFFICE - CONTINUOUS\n\n               Evan, under the doctor's desk, grabs some paper and begins \n               writing in shorthand.\n\n                                     EVAN\n                         If anyone finds this, then I guess \n                         my plan didn't work and I'm already \n                         dead.\n\n               Again, the world flutters as if it were attached to a paint-\n               shaker. He takes a deep breath.\n\n                                     EVAN\n                         But I -- I can just go back to the \n                         beginning of all this, I might be \n                         able to save her.\n\n               Fatigue overwhelms him, but he continues writing...\n\n               INT. DR. REDFIELD'S CORRIDOR - CONTINUOUS\n\n               Dr. Redfield catches up with the rest of the guards.\n\n                                     DR. REDFIELD\n                         He's not in his room. Search the \n                         grounds.\n\n               INT. DR. REDFIELD'S OFFICE - CONTINUOUS\n\n               The cardboard box is overturned. Evan finishes threading a \n               SUPER-8 film projector and turns it on. Careful not to let \n               any light spill against the wall, Evan projects it at the \n               underside of the desk.\n\n               We see familiar home movie footage from his childhood: Lenny, \n               5, has a birthday party. Kayleigh is there.\n\n               ANGLE ON EVAN'S EYES\n\n               Getting lost in the memory.\n\n               CHAOTIC NOISES of CHILDREN'S PARTY bleed into Evan's reality. \n               The world SHUDDERS UNCONTROLLABLY.\n\n                                                              SMASH CUT TO:\n\n               EXT. LENNY'S BACKYARD - DAY - 1987\n\n               Evan, 5, comes to at a birthday party. He's unexpectedly \n               gently prodded forward by Andrea.\n\n                                     ANDREA\n                         Go on, Evan. Introduce yourself.\n\n               Evan slowly approaches Kayleigh, only five. She smiles \n               bashfully at him. An old memory comes back to him.\n\n                                     KAYLEIGH (V.O.)\n                         When my folks split, they gave me \n                         and Tommy a choice who we wanted to \n                         live with. I couldn't stand my dad, \n                         but I knew if I lived with my mom, \n                         I'd never see you again...\n\n               Evan slowly looks around the yard, taking in the reality of \n               this distant memory.\n\n               He even inhales the aroma of the place. Savoring the moment. \n               He locks eyes with Kayleigh.\n\n                                     ANDREA (O.S.)\n                         He's not usually this shy.\n\n               It's time. Evan leans over to Kayleigh as if he's about to \n               kiss her. Then whispers in her ear:\n\n                                     EVAN\n                         I hate you. If you ever come near me \n                         again, I'll kill you and your whole \n                         family.\n\n               Kayleigh reacts predictably. Bursting into tears and runs \n               into Kayleigh's mother's arms.\n\n                                     KAYLEIGH'S MOTHER\n                         What did you say to her? What \n                         happened?!\n\n               Evan ignores them. He can't take his eyes off Kayleigh.\n\n                                     EVAN\n                         Goodbye.\n\n               His eyes well up.\n\n               FLASH!\n\n                                                              SMASH CUT TO:\n\n               INT. EVAN'S DORM - DAY - 2002\n\n               Evan wakes up with a bloody nose. He grabs a pillow and covers \n               his head with it as a flood of memories seizes him.\n\n               Lenny (looking fit) grabs a towel from atop an award-winning \n               flatworms project and hands it to Evan.\n\n                                     LENNY (O.S.)\n                         You alright? Should I call the doctor?\n\n               Evan groans and shakes his head \"no\". He rides out the pain \n               like a seasoned pro.\n\n               When it finally subsides, he lowers the pillow and smiles \n               feebly.\n\n                                     EVAN\n                         I'll think I'll be alright this time.\n                              (a new hope)\n                         I really do.\n\n               Lenny nods, still concerned.\n\n               INT. COLLEGE - INCINERATOR ROOM - LATER\n\n               Evan opens the door to a concrete room with a large furnace. \n               He and Lenny carry cardboard boxes.\n\n                                     LENNY\n                         You sure about this?\n\n               Evan nods. They silently dump tons of journals into the fire. \n               Evan steps outside and returns with a box of home movies, \n               photo albums, old report cards, etc. In they go.\n\n               CLOSE ON\n\n               Burning journals.\n\n                                                               DISSOLVE TO:\n\n               EXT. CITY STREET - DAY - 2010\n\n               Evan, a suit now, walks down a city street cradling a cell \n               phone to his ear.\n\n               TITLE CARD: YEARS LATER\n\n                                     EVAN\n                              (into phone)\n                         Yeah, Ma. I'm running a little late \n                         for lunch. One of my patients had a \n                         breakdown. Anyway, order some soup \n                         in the meantime. See ya soon.\n\n               As he clicks off, an attractive woman wearing a power suit \n               approaches from the other direction. Evan has to look closely, \n               but it's Kayleigh. A mature woman, now.\n\n               He stumbles slightly, caught off guard. As she passes, her \n               eyes linger on his a little longer than necessary, but there's \n               no recognition. Evan watches her continue past him and down \n               the sidewalk.\n\n               After a hesitant beat, he takes a breath, turns around and \n               follows her.\n\n               FADE TO BLACK.\n\n               Roll credits...\n\n                                         THE END\n\n\n\n\nButterfly Effect, The\nWriters :   J. Mackye Gruber  Eric Bress\nGenres :   Drama  Thriller  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:00.193948"}