{"title": "Cable Guy", "film_link": "/Movie Scripts/Cable Guy Script.html", "script_link": "/scripts/Cable-Guy.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Cable Guy Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Cable Guy Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (8.06 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Lou Holtz Jr.\" title=\"Scripts by Lou Holtz Jr.\">Lou Holtz Jr.</a><br/>  <a href=\"/writer.php?w=Judd Apatow\" title=\"Scripts by Judd Apatow\">Judd Apatow</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : October 1996<br/>\n<br/>\n<a href=\"/scripts/Cable-Guy.html\">Read \"Cable Guy\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>The Cable Guy\n\nby Judd Apatow\nBased on a Screenplay by\nLou Holtz Jr.\n\nShooting Script October 31, 1995 (White)\nRevised Pages November 13, 1995 (Blue)\nRevised Pages November 14, 1995 (Pink)\n\n<b>1\tFULL FRAME - WHITE NOISE\n</b>\nCredits begin. The entire frame is filled with white noise within which one can make out thefaint \nimage of a television program. Every few moments the channel changes, revealing a new ghostly \nimage.\n\nThe camera pulls back very slowly. We reveal that this image is coming from a twenty seven inch \ntelevision.\n\nThe camera pulls back some more and we see a man's hand enter frame holding a remote\ncontrol. The hand changes channels frantically.\n\nThe camera pulls back into its final position and we see STEVEN BARTOWSKY, thirty\nyears old, sitting on his couch. He is trying to find a channel with viewable reception.\nUnfortunately for him \u0096 his cable is not hooked up.\n\n<b>STEVE\n</b>(looks at watch)\nJesus, where's the cable guy already?\n\n<b>END OF CREDIT SEQUENCE\n</b>\n<b>1A\tINT. STEVEN'S APARTMENT - CONTINUOUS\n</b>\nIt is a stylish old apartment. There are half unpacked boxes strewn about the floor. Steven has just \nmoved in. The phone rings.\n\n<b>STEVEN\n</b>(into the phone)\nHello.\n\n<b>2\tNEWSROOM - CONTINUOUS\n</b>\nWe see Steven's best friend RICK standing in the middle of a busy newsroom. He is a rough \nlooking, cynical local news cameraman. In the background, hanging from the ceiling is a television \nset.\n\nON THE TV - An anchorman sits at his desk fixing his hair as he waits to go on the air. A graphic \non the screen says \"Sam Sweet Trial Update.\"\n\n<b>RICK\n</b>How's the move going?\n\n<b>3\tINT. STEVEN'S APARTMENT - CONTINUOUS\n</b>\nSteven unpacks as they speak. The phone call intercuts between the two locations.\n\n<b>STEVEN\n</b>Horrible. The cable guy is missing in\naction. Apparently he's going to be here\nsometime between eight AM and my death.\n\n<b>RICK\n</b>You haven't called Robin have you?\nPlease tell me you didn't call her.\n\n<b>STEVEN\n</b>(sarcastically)\nNo, I'm giving her space.\n(beat)\nI can't believe she's doing this.\n\n<b>RICK\n</b>You never should have asked her to marry\nyou. You're the mad smotherer.\n\n<b>STEVEN\n</b>All she had to do was say no. She didn't\nhave to kick me out. I feel like Felix\nUnger.\n\n<b>RICK\n</b>You forced her to evaluate the\nrelationship. If you didn't propose she\nwould never have realized how unhappy she\nwas.\n\n<b>STEVE\n</b>I don't want to talk about it.\nSo what time are you going to come by?\n\n<b>RICK\n</b>I can't. I'm working double shifts the\nrest of the week.\n\n<b>STEVEN\n</b>It's my first night here. Don't do this\nto me.\n\n<b>RICK\n</b>The other camera guy pulled out his back.\nBesides, I spent the last two weeks with\nyou on my couch. Isn't that enough?\n\n<b>STEVEN\n</b>Fine, fine.\n\n<b>RICK\n</b>One piece of advice. Slip the cable guy\nfifty bucks, he'll give you all the movie\nchannels for free. Even the dirty ones.\n\n<b>STEVEN\n</b>I couldn't. I'm not good at that stuff.\nWhat if he says no? I'll feel like an\nidiot.\n\n<b>RICK\n</b>None of them say no, believe me. I'll\ntalk to you later.\n\nSteven hangs up, and waits.\n\n<b>DISSOLVE TO:\n</b>\n<b>4\tINT. STEVEN'S LIVING ROOM - LATER\n</b>\nSteven continues unpacking. He is very neat. He opens a box and finds a pictures of him with his \nex-girlfriend. He looks at one sadly, considering whether or not to put it on display. He puts it \nback in the box.\n\n<b>4A\tEXT. STEVEN'S APARTMENT BUILDING - DAY\n</b>\nEstablishing shot of a renovated apartment building built in the nineteen twenties. A moving truck \npulls into a gated side garage.\n\n<b>5\tINT. STEVEN'S APARTMENT - LATER\n</b>\nMovers deliver a small breakfast table and chairs. Steven directs them as to where to put them.\n\n<b>CLOSE UP OF CLOCK - 3:52 P.M.\n</b>\n<b>6\tINT. STEVEN'S APARTMENT - LATER\n</b>\nSteven puts a few feet of tin foil on his antenna to help the reception. He changes channels. Still \nnothing. He pulls it off frustrated.\n\n<b>7\tINT. STEVEN'S LIVING ROOM - LATER\n</b>\nMany of the boxes are gone. Steven lies on the couch, staring at the ceiling, fidgeting. He is unable \nto fill his day without cable.\n\n<b>STEVEN\n</b>Where the hell is he?\n\n<b>8\tINT. STEVEN'S APARTMENT - LATER\n</b>\nSteven paces back and forth across the room. He stares at his watch frequently.\n\n<b>CLOSE UP OF CLOCK - 5:12 P.M.\n</b>\n<b>9\tINT. STEVEN'S APARTMENT - LATER\n</b>\nSteven slowly eats a sandwich in his empty kitchen. He looks at the clock. It says five-thirty. He \npicks up the phone and dials. A machine picks up.\n\n<b>ROBIN (VO)\n</b>Hi, this is Robin. Leave a message. If\nyou are trying to reach Steven he can now\nbe reached at 555-3837.\n\nSteven hangs up.\n\n<b>10\tINT. STEVEN'S APARTMENT - SUNSET\n</b>\nSteven does sit ups. He looks at the clock.\n\n<b>CLOSE UP OF THE CLOCK - 6:48 P.M.\n</b>\n<b>STEVEN\n</b>(to himself)\nForget it. Idiots.\n\nHe gets up, and walks into the bathroom.\n\n<b>11\tINT. BATHROOM - MOMENTS LATER\n</b>\nSteven gets undressed. He turns on the shower, adjusts the heat, then gets in. He tries to lose his \ntension by letting the hot water engulf him. He takes some shampoo, and lathers up his hair.\n\n<b>THE DOORBELL RINGS\n</b><b>STEVEN\n</b>(annoyed)\nOh great.\n\n<b>THE DOORBELL RINGS SEVERAL TIMES\n</b>\nSteven jumps out of the shower, soaking wet, throws on a bathrobe and runs to the door.\n\n<b>STEVEN\n</b>Don't leave! I'm here! I'm here!\n\n<b>12\tINT. STEVEN'S LIVING ROOM - CONTINUOUS\n</b>\nSteven runs to the door.\n\n<b>CABLE GUY (OS)\n</b>Hello! Cable Guy!\n\nSteven reaches the door, and looks through the peep-hole.\n\n<b>P.O.V. THROUGH THE PEEPHOLE\n</b>\nThe CABLE GUY is walking away.\n\n<b>INT. STEVEN'S LIVING ROOM/HALLWAY - DAY\n</b>\nSteven opens the door and yells to the Cable Guy.\n\n(Revised 11/14/95 - Pink)\n\n<b>STEVEN\n</b>Hey, wait!\n\nThe Cable Guy turns back.\n\n<b>CABLE GUY\n</b>Well, look who decided to show up. I was\njust gonna go collect my retirement\npension.\n\nThe Cable Guy wears a clean white jump suit, and is extremely confident despite the fact that he \nspeaks with a slight lisp. This lisp gives him a child-like quality.\n\n<b>STEVEN\n</b>You were supposed to be here four hours\nago.\n\n<b>CABLE GUY\n</b>Was I? So I'm the tardy one. Good to\nknow.\n\n<b>STEVEN\n</b>Yes. I had to go to the Bed 'n Bath\nplace, but now it's closed.\n<b>CABLE GUY\n</b>\n(turns to leave)\nMaybe I shouldn't have come at all \u0096 jerk\noff!\n(turns back smiling)\nI'm just joking. Let's do this.\n(looks around)\nOh, the old McNair place. I never thought\nthey'd get the floors clean after what\nhappened here.\n\n<b>STEVEN\n</b>What happened?\n\n<b>CABLE GUY\n</b>(long beat)\nThey had a lot of cats.\n\nThey walk into Steven's living room.\n\n<b>CABLE GUY\n</b>Hey, this could be a cool pad. Here is a\ncomment card.\n\nHe pulls out a card, and hands it to Steven without turning back to look at him.\n\n<b>CABLE GUY\n</b>Please mail it in when I am done.\n\n<b>STEVEN\n</b>These go to your boss?\n\n<b>CABLE GUY\n</b>No, they go to me. I'm a\nperfectioniss\u0085 perfectioniss\u0085\n(he strains to lose his lisp)\nperfectioniss\u0085t.\nNow let's take a look at what we're\ndealing with.\n\nThe Cable Guy walks around the room with his hands out, sensing the space.\n\n<b>CABLE GUY\n</b>Come on baby. Come on baby. Talk to me\nbaby. Tell me where you like it. That's\nit baby.\n\nHe zones in on one wall. He fells the wall in a sensuous manner.\n\n<b>CABLE GUY\n</b>Here's your sweet spot.\n\nHe pulls out his drill, and begins drilling.\n\n<b>CABLE GUY\n</b>So your lady kicked you out.\n\n<b>STEVEN\n</b>What?\n\n<b>CABLE GUY\n</b>In preparing your service I noticed you\nwere previously wired across town at 1268\nand a half Chestnut. Last week the\nbilling was transferred to one Robin\nHarris. Smells like heartbreak to me.\n\n<b>STEVEN\n</b>I really don't want to talk about it with\nyou. Could you please just install my\ncable? I'm going to get dressed.\n\n<b>CABLE GUY\n</b>No sweat.\n\nSteven walks away, into the hallway. A moment later the Cable Guy runs to him.\n\n<b>CABLE GUY\n</b>Hey, I'm going to go to the hallway so I\ncan access the floorboards. Don't be\nspooked if you hear someone crawling\nunderneath you.\n\n<b>STEVEN\n</b>Okay, whatever.\n\nSteven walks toward his bedroom.\n\n<b>CABLE GUY\n</b>Put on your bathing suit 'cause you'll be\nchannel surfing in no time.\n\nThe Cable Guy pulls the trigger on his drill twice to punctuate his joke.\n\n<b>13\tINT. - STEVEN'S LIVING ROOM - LATER\n</b>\n<b>CLOSE UP - THE TELEVISION\n</b>\nRIKKI KLIEMAN from COURT TV broadcasts from their studio.\n\n<b>RIKKI KLIEMAN\n</b>(to camera)\nSo ends day fifty-four of the trial of\nformer child star Sam Sweet who has been\naccused of shooting his twin brother,\nStan, in cold blood. The twins were\nstars of the hit sitcom \"Double Trouble\"\nwhich aired from nineteen seventy-seven\ntill nineteen eighty-four.\n\nA video package rolls in - We see several photographs of Sam Sweet and his twin brother at \nvarious ages. Included is the cast photo of \"Double Trouble.\" Pictured in the photo are eight-year-\nold Stan and Sam and Conrad Janis as their single dad.\n\nWe see a brief clip from \"Double Trouble,\" starring the two eight-year-old boys, then a shot of \nSam Sweet being taken out of a police car in handcuffs.\n\n<b>RIKKI KLIEMAN\n</b>(to camera)\nLife wasn't so sweet after the cancellation\nof their program. Hollywood chewed them\nup and spit them out. A frustrated Sam\nturned to petty larceny, while his more\nimpressionable brother, Stan, fell in\nwith a fringe cult called \"The\nBrotherhood of Friends.\" Reduced to\ntabloid fodder a fury was growing inside\nof Sam. A burning need to be recognized\nas an individual, not a person famous for\nhaving an identical twin. A need that\ntook the form of four shotgun blasts on\nthe night of November fourteenth. And so\ntoday his attorneys continue the unusual\ndefense of \"Twin Envy.\"\n\n<b>ANGLE ON\n</b>\nSteven re-enters the room. The Cable Guy is watching television.\n\n<b>STEVEN\n</b>How's it going?\n\nThe Cable Guy holds up one finger as if to say \"quiet.\" His eyes never leave the TV.\n\n<b>CABLE GUY\n</b>Guilty, guilty, guilt-freakin-tee. I\nhope they fry this bastard.\n\nSteven sees that the Cable Guy has completely redecorated the room in a fashion which makes the \nroom impractical for anything other than watching television. The TV is now on the stairs \nblocking the entrance into the living room. All furniture faces the TV, making conversation \nimpossible.\n\n<b>STEVEN\n</b>(looks around)\nWhat happened?\n\n<b>CABLE GUY\n</b>(jumps to his feet)\nThe arrangement of your major appliances\nand your furniture was causing some noisy\npics and hum bars in your reception. I\nmoved a few things. Cleared it right up.\nIs that cool?\n\n<b>STEVEN\n</b>(non-confrontational)\nI\u0085 guess so.\n\n<b>CABLE GUY\n</b>You programmed?\n(off of Steven's look)\nThen let me slave your remotes.\n\nHe picks up Steven's remotes, punches in a complicated series of commands, then points them at \neach other. As he holds them together he makes a face as if their power is surging through him.\n\n<b>CABLE GUY\n</b>Ooh, maybe we should leave these two\nalone.\n\n<b>STEVEN\n</b>So after this I'll only need one remote\nfor everything?\n\n<b>CABLE GUY\n</b>You know you're pretty good at this. You\ncould be a cable guy yourself.\n(he finishes)\nNow let me check your levels.\n\nWith amazing alacrity he adjusts color setting, sound controls, closed captioned, etc. Then he \nclicks through the channels. A music video, documentary on Hitler, Oprah Winfrey Show, starving \nkids, Barney, court TV. The Cable Guy watches emotionless.\n\n<b>CABLE GUY\n</b>All right. That about does it. I just\nhave some paperwork for you to fill out.\nSign here.\n\nSteven does.\n\n<b>CABLE GUY\n</b>That gave me power of attorney over you.\n(beat)\nJoking.\n\nSteven laughs. The Cable Guy joins him, but then continues to laugh way too hard for way too \nlong. As the laugh ends it quickly turns into an awkward moment. The Cable Guy does not want \nto leave.\n\n<b>CABLE GUY\n</b>I'm about finished here.\n(beat)\nOkay. I feel good about this.\n\nCable Guy walks to the door.\n\n<b>STEVEN\n</b>One thing.\n\n<b>CABLE GUY\n</b>(turns back immediately)\nYeah!\n\n<b>STEVEN\n</b>I\u0085 uh\u0085 I have this friend and he said\nhe gave his cable guy fifty bucks and he\ngot free movie channels. Have you ever\nheard of anything like that?\n\n<b>CABLE GUY\n</b>(deadly serious)\nYou mean illegal cable?\n\n<b>STEVEN\n</b>Uh\u0085 yes.\n\n<b>CABLE GUY\n</b>Who told you that? I want his name.\n\n<b>STEVEN\n</b>Forget it.\n\n<b>CABLE GUY\n</b>You're offering me a bribe? What you\nhave just done is illegal, and in this\nstate if convicted, you could be fined\nfive-thousand dollars or spend six months\nin a correctional facility.\n\n<b>STEVEN\n</b>Please\u0085 that was dumb. I was just\nmaking conversation \u0096\n\n<b>CABLE GUY\n</b>(laughs)\nI'm just jerking your chain. Wake up\nlittle snoozy. I'll juice you up. All\nit is is a push of a button.\n\nHe puts his arm around Steven and walks him toward the front door.\n\n<b>STEVEN\n</b>Oh, great. How much?\n\n<b>CABLE GUY\n</b>Don't worry about it. I couldn't charge\nyou. Your girl just booted you.\nConsider it one guy doing another guy a\nsolid.\n\n<b>STEVEN\n</b>That is so nice.\n\n<b>CABLE GUY\n</b>Hey, you're a 'nice' guy. You'd be\nsurprised how many customers treat you\nlike shit, like I'm a god damn plumber or\nsomething.\n(hands him a card)\nHere is my personal beeper number. It's\njust for my preferred customers. Never\ncall the company, they'll just put you on\nhold.\n\n<b>STEVEN\n</b>Thanks. Really.\n(holds up comment card - jokes)\nYou're gonna get some good marks here.\n\n<b>CABLE GUY\n</b>Maybe some day I'll take you out to the\nsatellite and show you how all this stuff\nworks. It's really incredible.\n\n<b>STEVEN\n</b>Sure. We should do that one day.\n\n<b>CABLE GUY\n</b>How 'bout tomorrow?\n\n<b>STEVEN\n</b>Tomorrow? Tomorrow's not good.\n\n<b>CABLE GUY\n</b>What are you going to do, sit home and\nstew about your ex?\n\n<b>STEVEN\n</b>No.\n\n<b>CABLE GUY\n</b>(insulted)\nOh, okay. I guess I crossed the line.\nSorry.\n\n<b>STEVEN\n</b>(guilty)\nYou didn't cross the line.\n\n<b>CABLE GUY\n</b>No? Cool. I'll pick you up at six-thirty.\nOn the flip side.\n\nThe Cable Guy leaves before Steven can reconsider. Steven cannot believe he just got roped into \nthat.\n\n(End Revision - Pink)\n\n<b>14\tINT. CITYWIDE LAND DEVELOPERS - CONFERENCE ROOM - DAY\n</b>\nSteven is in the middle of a presentation to his co-workers. His boss, HAL DANIELS, looks \nimpressed.\n\nSteven pulls a sheet off of an architect's model of a condominium complex.\n\n<b>STEVEN\n</b>\u0085There are twenty-four classrooms; each\ncan be converted into a 1400 square foot\nhome. The facility has two tennis courts,\nan Olympic size pool and full gym, with a\nstage if the residents decide they want\nto perform \"Oklahoma.\"\n\nEveryone laughs. Steven is very good at his job.\n\n<b>STEVEN\n</b>The kitsch appeal of living in an old\nschoolhouse should be very attractive to\nyoung, upwardly mobile home buyers. And\nmost important, the structure is\navailable in foreclosure. If we put down\na cash bid, we're going to steal this\nthing.\n\nThere is a pause, then everyone applauds. Mr. Daniels walks over to Steven and puts a proud arm \naround him. They speak as the meeting breaks up.\n\n<b>MR. DANIELS\n</b>Great work Steve-o. So you're feeling\ngood?\n\n<b>STEVE\n</b>Yeah.\n\n<b>MR. DANIELS\n</b>Did I hear something about you having\nsome troubles at home?\n\n<b>STEVE\n</b>Robin and I have been having a difficult\ntime. I moved out, but I really think\nit's only temporary.\n\n<b>MR. DANIELS\n</b>Gotcha. I love this project, but it's a\nbig mother. Know what I mean? If it\nfails, corporate's going to have my ass.\nI've got confidence in you, but you hear\nwhere I'm coming from, bro?\n\n<b>STEVEN\n</b>Absolutely. Now I've got more time than\never. It's a good thing.\n(laughs)\nI know I can pull this thing off.\n\n<b>MR. DANIELS\n</b>(playfully)\nThen what are you doing talking to me?\nYou've got a lot of work to do. Get to\nit!\n\n<b>STEVEN\n</b>Thank you. I will.\n\nHal goes down the stairs to his office. Steven watches him disappear, then turns to his secretary, \n<b>JOAN.\n</b>\n<b>STEVEN\n</b>I'll be right back.\n\n<b>14A\tINT. SASSY MAGAZINE OFFICES - DAY\n</b>\nSteven walks through the halls looking for Robin's office.\n\n<b>15\tOMITTED\n</b>\n<b>16\tINT. ROBIN'S OFFICE AT SASSY MAGAZINE - DAY\n</b>\nROBIN HARRIS, an attractive woman in her late twenties, sits at her desk at \"Sassy Magazine.\" \nHer office is fairly nice, but she is definitely not at the upper level of the company yet. There are \npapers spread all over her desk. On her walls are pictures from the magazine, and articles she has \nwritten.\n\nSteven peeks his head in her door.\n\n<b>STEVEN\n</b>Hello.\n\nRobin's face drops.\n\n<b>ROBIN\n</b>Steven, what are you doing here?\n\n<b>STEVEN\n</b>I was just in the area. Thought I'd pop\nby. How's work? How'd the big teen crush\narticle come out?\n\n(Revised 11/13/95 - Blue)\n\n<b>ROBIN\n</b>They liked it.\n(beat)\nI thought we agreed we weren't going to\nsee each other for a month.\n\n<b>STEVEN\n</b>I know, it's just Daniels accepted my\nproposal to renovate the old schoolhouse.\n\n<b>ROBIN\n</b>That's wonderful, congratulations.\n\n<b>STEVEN\n</b>I know I'm breaking the rules, but come\nhave dinner with me tonight to celebrate.\n\n<b>ROBIN\n</b>I don't think we should.\n\n<b>STEVEN\n</b>Come on, this is the biggest day of my\ncareer.\n\n<b>ROBIN\n</b>Don't put me in this position.\n\n<b>STEVEN\n</b>What position? I want to share this with\nyou.\n\n<b>ROBIN\n</b>(feeling pressured)\nI love you, but I need to take some time\non my own to see how I feel. You agreed\nto this. I mean\u0085 this is exactly why we\nbroke up, because you never listen to me.\n\n<b>STEVE\n</b>What? Now we're broken up? What\nhappened to 'trial separation?'\n\n<b>ROBIN\n</b>I can't get into this now. If you haven't\nnoticed, I'm at work.\n\n<b>STEVE\n</b>Sorry to disturb you.\n\nHe turns to leave.\n\n(Revised 11/14/95 - Pink)\n\n<b>ROBIN\n</b>(sincerely)\nSteven. Congratulations. I know how\nmuch this means to you. You deserve it.\n\n<b>STEVEN\n</b>Thanks.\n\nHe leaves.\n\n<b>17\tOMITTED\n</b>\n<b>17A\tINT. STEVEN'S APARTMENT - SIX-THIRTY P.M.\n</b>\nSteven is watching television. He looks lonely and depressed. He clicks around in a daze, never \nstopping for more than a second.\n\nHe hears a horn honking outside.\n\n<b>CABLE GUY (OS)\n</b>Steven!!!! Stev-ey!!!! Let's go!!!!\n\nON THE TV - A commercial for Medieval Times Restaurant.\n\nSteven walks over to the window and sees The Cable Guy standing in front of his van, leaning in \nhis window honking the horn.\n\n<b>CABLE GUY\n</b>Steven!!!!\n(waves)\nHey buddy!!! Come on down!!!\n\nSteven waves and then steps back from the window. He doesn't know what to do. He looks at the \ntelevision.\n\nON THE TV - The local news.\n\n<b>REPORTER\n</b>Coming up next a special report,\n\"Loneliness, America's Silent Killer.\"\n\nSteven looks back out the window and sees the Cable Guy smiling and waving for him to come \ndown.\n\n<b>STEVEN\n</b>(begins walking to the door)\nWhat the hell.\n\n<b>18\tEXT. STEVEN'S APARTMENT BUILDING - DUSK\n</b>\nSteven walks from his apartment to the customized van. On the side of the white van it says, \"The \nCable Company - Get Wired Today.\"\n\n<b>STEVEN\n</b>How's it going?\n\n<b>CABLE GUY\n</b>Howdy partner. Climb aboard.\n\nSteven gets in.\n\n<b>19\tINT. VAN - CONTINUOUS\n</b>\nThe van drives onto the main boulevard.\n\n<b>CABLE GUY\n</b>Thanks for coming out. You know most\npeople think cable is just a simple co-ax\nthat comes out of the wall. They never\ntake the time to understand how it works.\n\n<b>STEVEN\n</b>Where exactly are we goin?\n\n<b>CABLE GUY\n</b>We're going to take a ride on the\ninformation superhighway.\n\n<b>20\tEXT. CITY - DUSK\n</b>\nBirds eye P.O.V., shot follows the Cable Guy's van as it drives through the city.\n\n<b>CABLE GUY\n</b>\u0085It all started in Lansford,\nPennsylvania where Panther Valley\nTelevision, with the assistance of Jerrod\nElectronics, created the first cable\ntelevision system.\n\nThe van drives up into the hills, finally revealing a huge satellite dish on top of a small mountain, \noverlooking the entire city.\n\n<b>CABLE GUY\n</b>I went to Lansford once. It's the Cable\nGuy's Mecca. It was very emotional.\n\n<b>21\tEXT. WOODED AREA - DUSK\n</b>\nSteven and the Cable Guy get out of the van, and walk down a trail.\n\n<b>CABLE GUY\n</b>I come here to think sometimes. To clear\nmy head.\n\nThey turn a corner and the satellite dish is right in front of them. It is enormous. Next to it is a \none-hundred and fifty foot antenna. Next to that is a small fenced-in shack where the satellite's \ncontrols are located.\n\n<b>CABLE GUY\n</b>There she is. Right now she's sending\nentertainment and information to millions\nof satisfied citizens.\n\n<b>STEVEN\n</b>That's pretty impressive.\n\n<b>CABLE GUY\n</b>See, I knew the moment I met you that\nyou would appreciate this.\n\nThe Cable Guy runs to the dish. A few seconds later he appears inside of it.\n\n<b>CABLE GUY\n</b>(with wonder)\nThe future is now. Soon every American\nhome will integrate their television,\nphone, and computer. You'll be able to\nvisit the Louvre on one channel, and\nwatch female mud wrestling on\nanother. You can do your shopping at\nhome, or play Mortal Kombat with a friend\nin Vietnam. There's no end to the\npossibilities.\n(waves to Steven)\nCome on up! What are you waiting for?!\n\n<b>22\tINT. SATELLITE DISH - NIGHT\n</b>\nThe Cable Guy and Steven are lying in the middle of the dish, looking up at the night sky.\n\n<b>CABLE GUY\n</b>Sometimes I'll sit here and imagine that\nthere are billions of bits of information\nsurging through me.\n\n<b>STEVEN\n</b>I've watched a lot of TV in my life. I\nguess I've always taken it for granted.\n\n<b>CABLE GUY\n</b>When I was a kid my mom worked nights.\nNever met dad. But the old TV was always\nthere for me.\n\n<b>STEVEN\n</b>I know what you mean. My dad was there,\nbut he might as well have been gone. My\nmom is a stewardess. She was always out\nof town.\n\n<b>CABLE GUY\n</b>(moved)\nThat's tough. You must have a lot of\nabandonment issues. Reality isn't \"Father\nKnows Best,\" it's a kick in the face on\nSaturday night. But what doesn't kill us\nmakes us stronger, right?\n\n<b>STEVEN\n</b>(tentative)\nYou know my brother's a speech therapist.\n\nThe Cable Guy sits up. He looks angry.\n\n<b>CABLE GUY\n</b>So?\n\nThere is a long silence. Steven doesn't know how to react.\n\n<b>STEVEN\n</b>Never mind.\n\nThe Cable Guy sits back down and pretends Steven never mentioned it.\n\n<b>CABLE GUY\n</b>(beat)\nSo, you're pretty love struck about your\nlady, huh?\n\n<b>STEVEN\n</b>I miss her. I asked her to marry me, and\nshe asked me to move out.\n\n<b>CABLE GUY\n</b>I hate that.\n\n<b>STEVEN\n</b>She said she felt pressured. Can you\nbelieve that?\n\n<b>CABLE GUY\n</b>Women are a labyrinth. Can I be frank? I\ndon't think you listen to her. I think\nyou try to tell her what she wants to\nhear. She wants you to thirst for\nknowledge about who she is. All the\ncomplicated splendor that is woman. When\nyour love is truly giving, it will come\nback to you ten-fold.\n\n<b>STEVEN\n</b>You're right. That is remarkably\ninsightful.\n\n<b>CABLE GUY\n</b>Yeah, it was Jerry Springer's final\nthought on Friday's show.\n\n<b>23\tEXT. STEVEN'S APARTMENT BUILDING - LATER\n</b>\nThe van pulls up in front of Steven's apartment building.\n\n<b>CABLE GUY\n</b>You know what? Women are suckers for\n\"Sleepless in Seattle.\" It's on HBO this\nmonth. That's your bait right there.\n\n<b>STEVEN\n</b>Robin loves that movie.\n\n<b>CABLE GUY\n</b>They all do. Next time you talk to her\ntell her you're cooking yourself dinner,\nand watching it by yourself. Sound like\nyou're happier than a pig in shit.\nShe'll come running. Betcha. Then just\nplay it cool.\n\n<b>STEVEN\n</b>Maybe I will.\n\nSteven gets out of the car.\n\n<b>STEVEN\n</b>Thanks a lot. I'm embarrassed to say\nthis, but I don't know your name. What\nis it?\n\n<b>CABLE GUY\n</b>(touched)\nYou really want to know my name? You do?\nReally? It's Ernie Douglas. But my\nfriends call me Chip.\n\n<b>STEVEN\n</b>I'll see ya' Chip.\n\nBefore he can exit the van, the Cable Guy is staring him in the eyes.\n\n<b>CABLE GUY\n</b>Let's just remember right now. You know\nsome people walk through their entire\nlives and never find a true friend.\n(long pause)\nI guess we're the lucky ones.\n\n(End Revised - Pink)\n\nSTEVEN'S P.O.V. - The Cable Guy is in slow motion. He blinks once.\n\n<b>STEVEN\n</b>Uh\u0085 good-bye.\n\n<b>CABLE GUY\n</b>Later buddy. I'll catch ya' on the\nflip side.\n\nSteven exits the van feeling a little uncomfortable.\n\n<b>24\tINT. COFFEEHOUSE - NEXT DAY\n</b>\nSteven and Robin are talking. Robin does not look happy to see him.\n\n<b>STEVEN\n</b>I don't listen to you. I pretend to\nunderstand but I'm really just saying\nwhat I think you want to hear. So from\nnow on I'm going to try my best to listen\nmore because I do love you and am\ninterested in learning about every detail\nabout the complicated splendor that is\nyou.\n\nRobin looks at him, somewhat shocked.\n\n<b>ROBIN\n</b>Oh.\n\n<b>STEVEN\n</b>I want us to get back together, but I can\nsee why taking this time might be good\nfor us. So, I'm not mad.\n\nAfter a long beat, Robin smiles.\n\n<b>ROBIN\n</b>Sometimes time apart is healthy.\n\n<b>STEVEN\n</b>You're right. Well, that's what I came\nhere to say. Look, I've got to get back\nto the office.\n\nHe starts getting up.\n\n<b>ROBIN\n</b>So, are you doing anything tomorrow?\n\n<b>STEVEN\n</b>I'm just going to cook myself dinner and\nwatch a movie. \"Sleepless in Seattle\" is\non cable.\n\n<b>ROBIN\n</b>Really?\n\n<b>STEVEN\n</b>If you're around you should drop by and\ncheck out the new apartment.\n\n<b>ROBIN\n</b>Okay, maybe I will.\n\nHe exits the room. As he does we see a television broadcasting the Sweet case.\n\nON MTV - Sam Sweet sits behind the defendant's table. TABITHA SOREN is giving the news \nupdate.\n\n<b>TABITHA SOREN\n</b>Today in the Sam Sweet case the\nprosecution played the 911 call that Sam\nSweet made the night he murdered his\nbrother. Keep in mind, he confessed one\nmonth later.\n\nThe courtroom listens to a 911 phone call. The transcription is seen on the screen.\n\n<b>SAM SWEET V ON THE TAPE\n</b>(crying and babbling)\nHello, please send help. My twin brother\nhas been shot.\n\n<b>911 OPERATOR\n</b>Slow down sir. What happened?\n\n<b>SAM SWEET\n</b>Oh my god, they shot him with a shot gun\nfour times. I mean I think it was a\nshotgun. Who would do such a thing?! I\nthink it was an Asian gang or something.\nThey were speaking some other language.\n\nSam leans over and whispers something in his lawyer's ear.\n\n<b>TABITHA SOREN\n</b>Hmm. Who indeed? Coming up next, a rare\ninterview with Michael Jackson's zoo-\nkeeper.\n\n<b>25\tINT. HIGH SCHOOL GYM - DAY\n</b>\nSteven is playing a pick-up, full court basketball game with some of his friends. It is a competitive, \nbut friendly game. Steven is on skins, Rick is on shirts.\n\n<b>STEVEN\n</b>Here, here, here.\n\nA player passes to Steven. Rick is covering him. Steven drives to the basket and puts in a lay up.\n\n<b>RICK\n</b>(to himself)\nShit! My fault! My fault!\n\n<b>STEVEN\n</b>Not your fault. I'm in the zone. There\nis no stopping me today.\n\nPlay begins again. A player named JEFF takes the ball out, then passes to a heavy-set player who \ncatches the ball, then drives to the basket. When he does he twists his ankle, dropping the ball. The \nball rolls out of bounds into a dark corner of the gym. We follow it as it rolls on the ground until it \nhits a man's sneaker. A pair of hands pick up the ball. The camera tilts up the man's body. It is the \nCable Guy. He is holding another ball. He starts dribbling the two balls in a circular pattern.\n\n<b>CABLE GUY\n</b>Hey, you guys play here, too? Cool. I\nwas just in the neighborhood. Thought I'd\nrun the court for a couple of innings.\n\n<b>RICK\n</b>(gestures to injured player)\nGreat. We need another man.\n\n<b>STEVEN\n</b>This is\u0085 Chip Douglas\u0085 my cable guy.\n\nRick smiles in recognition.\n\n<b>CABLE GUY\n</b>We met about a week ago during a routine\ninstallation, but I feel like I've known\nhim my whole life.\n\nSteven can't believe this is happening.\n\n<b>RICK\n</b>Oh really. That's sweet. All right Chip\nDouglas, you're on shirts. Let's play.\n\n<b>CABLE GUY\n</b>No, I want to be on Steven's team. I'm\nskins.\n\nThe Cable Guy quickly takes off his shirt. Steven looks shocked because underneath his clothes he \nis rippled with muscles. The dichotomy between his nerdy face, and his awesome physique is \nscary.\n\n<b>JEFF\n</b>I don't care, I'll be shirts. Let's just\nplay.\n\n<b>CABLE GUY\n</b>Wait a sec'. I've got to warm up.\n\nThe Cable Guy starts running wind sprints across the court, touching all the main lines. Everyone \nstares at him until he finishes.\n\n<b>CABLE GUY\n</b>Let's get it on!\n\n<b>STEVEN\n</b>Are you any good?\n\n<b>CABLE GUY\n</b>Feed me under the boards and you'll find\nout.\n\nPlay begins. The shirts inbound to Jeff. The Cable Guy is all over him, covering him as tightly as \nhumanly possible. He keeps his hands near Jeff's face, whacks him in the back as he dribbles, etc. \nHe couldn't be more annoying. Jeff passes to Rick who drives to the basket and puts up a shot \nwhich goes in. Rick and Jeff slap hands.\n\n<b>CABLE GUY\n</b>(doing the traveling hand signal)\nTraveling! That's traveling!\n\n<b>RICK\n</b>Yeah, whatever you say Chip.\n\nEveryone runs down the court, ignoring him.\n\n<b>CABLE GUY\n</b>All right, so we're playing that type of\ngame. Prison rules. I get it.\n\nSteven takes the ball out. The cable Guy runs around the court, attempting to get open. He criss \ncrosses all over the court.\n\n<b>CABLE GUY\n</b>Feed me the rock! Feed me the rock! I'm\nopen!\n\nSteven passes to the Cable Guy, who drives to the basket, pushing Jeff out of the way in the \nprocess. The ball goes in.\n\n<b>CABLE GUY\n</b>(does the foul hand signal)\nAnd one! That's definitely a foul!\n(to Jeff)\nYou want to mug me, my wallet is in my\nother pants.\n\n<b>STEVEN\n</b>(to Cable Guy)\nWhat are you doing?\n\n<b>CABLE GUY\n</b>Don't play from fear Steven. We can take\nthese guys.\n\n<b>MUSIC UP - SLOW MOTION - STEVEN'S P.O.V.\n</b>\na. The shirts put a shot which doesn't go in. The Cable Guy swings his elbows wildly as he pulls it \ndown.\nb. The Cable Guy drives to the basket in slow motion violently taking down two men, including \nRick.\nc. Rick drives to the basket. On his way he fakes out Steven who falls to the floor. Rick scores. \nThe Cable guy helps Steven up. As the Cable Guy walks across the court he bangs shoulders \nwith Rick.\nd. The cable Guy passes the ball to Steven, then sets a nasty pick against Rick, who goes down \nhard.\n\n<b>CABLE GUY\n</b>Take it to the hole!\n\nSteven is so un-nerved by the Cable Guy's behavior that he misses a simple lay up. Steven grabs \nhis own rebound. When he puts up a second shot, Rick gently fouls him. Steven stumbles to the \nground. The ball does not go in.\n\n<b>CABLE GUY\n</b>Hey, are you okay?\n\nHe pulls Steven up.\n\n<b>STEVEN\n</b>Yeah. I'm fine.\n\n<b>CABLE GUY\n</b>Let's switch. I'll cover Rick.\n\nThe cable Guy gets in Rick's face and gives him a death stare.\n\nSteven takes out the ball. He passes to a teammate who passes it to the Cable Guy who drives to \nthe basket, then literally steps on Rick's back and leaps into the air and dunks the ball.\n\n<b>RICK\n</b>(enraged)\nWhat the hell was that? That's it. I've\nhad enough.\n\nEveryone begins to exit the court.\n\n<b>JEFF\n</b>Thanks for bringing your \"friend\".\n\nThe Cable Guy runs up to Rick.\n\n<b>CABLE GUY\n</b>Good game.\n(slaps Rick on the butt)\nYou were tough out there. Your play\nbrought me up to a higher level. I mean\nthat.\n\n<b>RICK\n</b>(dismissive)\nYeah.\n\nHe shakes his head and exits with the rest of the players.\n\n<b>STEVEN\n</b>What are you doing?\n\n<b>CABLE GUY\n</b>It was payback time. I was protecting\nyou.\n\n(Revised 11/14/95 - Pink)\n\n<b>STEVEN\n</b>You ruined the game.\n\n<b>CABLE GUY\n</b>I don't appreciate your tone Steven.\nThat's not the way friends speak to each\nother.\n\n<b>STEVEN\n</b>What are you talking about? I don't even\nknow you!\n\n<b>CABLE GUY\n</b>Well let's fix that. Let me buy you a\nHeineken?\n\n<b>STEVEN\n</b>No, I'm going home.\n\nSteven turns to leave.\n\n<b>CABLE GUY\n</b>Well, uh, I guess we'll talk later. I've\ngot to go shower up and do some stuff.\nI'll call you if I get a chance. Or you\ncall me\u0085 or something.\n\nThe Cable guy puts his hand up for Steven to high five. Steven slaps it halfheartedly. Then the \ncable guy extends his palm out low by his knee.\n\n<b>CABLE GUY\n</b>And down low.\n\nSteven stares at it for a beat. The cable Guy waits. He'll wait as long as it takes. Finally Steven \ngives him a low five just so he can leave.\n\n<b>CABLE GUY\n</b>(pulls his hand away so Steven misses it)\nToo slow. Have a good one.\n\n<b>STEVEN\n</b>(as he walks away)\nYeah, have a good one.\n\n<b>26\tINT. STEVEN'S APARTMENT - NEXT NIGHT\n</b>\nSteven runs in with a small bag of groceries. He is dressed for a date. He pulls out a bottle of \nwine. He opens the oven, and checks on dinner. It is almost ready. Then he checks his message \nmachine as he prepares the meal. He begins chopping an onion.\n\n(Revised 11/13/95 - Blue)\n\n<b>MESSAGE VOICE\n</b>You have eleven messages.\n\n<b>STEVEN'S MOTHER\n</b><b>(ON THE MACHINE)\n</b>Steven, it's mom. Give me a call. I'm\nstill your mother.\n\n<b>STEVEN'S FATHER\n</b><b>(ON THE MACHINE)\n</b>I'm getting on. Steven call your mother.\n\n<b>CABLE GUY\n</b><b>(ON THE MACHINE)\n</b>Hey Steven. Just checking in. Give me a\nring. I'm at 555-4329.\n(beep)\nWhat's up Steven? I'm at a pay phone. If\nyou're there pick up. Pick up. Pick up.\nOkay, I'll be home later. I'll talk to\nyou then.\n\nSteven stops chopping.\n\n<b>CABLE GUY\n</b><b>(ON THE MACHINE)\n</b>(beep)\nOkay I'm home now. Give me a buzz when\nyou get in. I'll be here pretty much all\nnight. Bye.\n(beep tone)\nHey Steven. Quick question, give me a\ncall when you get a chance.\n(beep tone)\nI was just taking a whiz, thought you\nmight have called. Okay later.\n(beep tone)\nSorry, I had call waiting, didn't get to\nit, thought it might have been you. All\nright, bye.\n\nSteven is beginning to get a little wigged out by this. He fast forwards through a sampling of the \nrest of the calls.\n\n<b>CABLE GUY\n</b>(fast forwards)\n\u0085We're having ourselves quite a little\ngame of phone tag here. You're it!\n(fast forwards)\n\u0085I was just blow drying my hair and I\nthought I heard the phone ringing.\n(fast forwards)\n\u0085you're a tough man to reach.\n(fast forwards)\nI guess you're too busy to call your\nfriends.\n\n(Revision Ends - Blue)\n\nSteven fast forwards the machine. All he hears is sighing. Then \u0096\n\n<b>CABLE GUY\n</b><b>(ON THE MACHINE)\n</b>(long beat - then quiet and distant)\nShit.\n\nThe doorbell rings. Steven takes a deep breath then opens the door. It is Robin. She is dressed \ncasually, but looks beautiful.\n\n<b>STEVEN\n</b>Hey, good to see you.\n\nThere is an awkward moment where Steven intentionally doesn't kiss her hello.\n\n<b>STEVEN\n</b>Come on in. What do you think of the\nplace?\n\nShe looks at the odd placement of furniture.\n\n<b>ROBIN\n</b>You made some interesting choices laying\nout the room.\n\n<b>STEVEN\n</b>(embarrassed)\nThat's actually where the movers put the\nfurniture. I'm gonna change it, very \nsoon.\n\n<b>ROBIN\n</b>No, I like it.\n\n<b>27\tINT. STEVEN'S LIVING ROOM - LATER\n</b>\nThe food is all eaten. Steven and Robin are sitting on the couch having an awkward conversation.\n\n<b>ROBIN\n</b>So how's work?\n\n<b>STEVEN\n</b>Work's good.\n\n<b>ROBIN\n</b>How's Hal?\n\n<b>STEVEN\n</b>Don't get me started. That guy has no\nvision. It's like working for Mr. MaGoo.\nHe's just worthless.\n\n<b>ROBIN\n</b>It's just great that you're getting to do\nit. It's a real step up.\n\n<b>STEVEN\n</b>I know. Now if only someone at corporate\nsmartened up enough to dump Hal, then I\ncould really get some stuff done.\n\n<b>ROBIN\n</b>It's nice to see you doing so well.\n\n<b>STEVEN\n</b>Well, it's nice just to see you.\n(looks at his watch)\nHey, it should be starting.\n\nThey sit on the couch. Robin moves to sit in closer to Steven. Steven turns on the television. The \nscreen is filled with white noise. The sound is loud static. He changes channels looking for the \nsignal. Then fumbles with the remote control as he attempts to lower the volume.\n\n<b>STEVEN\n</b>Damn cable is out. Son of a bitch.\n\n<b>ROBIN\n</b>It's alright. We can watch it another\nnight.\n\n<b>STEVEN\n</b>No, no. We really should see it now.\nNow's a good time.\n\nHe plays with the remote, hoping it will magically come back. It doesn't.\n\n<b>STEVEN\n</b>Wait, wait. I know what to do.\n\nHe walks over to the phone, then pulls the Cable Guy's beeper number out of his wallet. He dials \nit, then presses the number in.\n\n<b>STEVEN\n</b>The Cable Guy's a friend of mine. I'll\njust page him. We'll have this fixed in\nno time.\n\n(Revised 11/14/95 - Pink)\n\nSteven dials the Cable Guy's beeper number into the phone. The moment he is finished dialing \u0096\n\n<b>THERE IS A KNOCK - THE CAMERA WHIP PANS TO THE DOOR\n</b>\nSteven walks to the door and opens it. Standing there is the Cable Guy looking dark and \ndisturbed, different than we've ever seen him before. Steven is startled.\n\n<b>STEVEN\n</b>That was\u0085 fast.\n\n<b>CABLE GUY\n</b>Is there a problem with your service?\n\n<b>STEVEN\n</b>Yeah\u0085 my cable went out.\n\nSteven pushes him out into the hall.\n\n<b>CABLE GUY\n</b>Really?\n\nThe Cable Guy holds up a cut cable cord.\n\n<b>CABLE GUY\n</b>So you called me. Interesting how you\ncall when you need something. Is that how\nyou treat people?\n\n<b>STEVEN\n</b>I've been really busy. You've got to get\nmy cable going, Robin is here. This is\nreally important.\n\nHe peeks in to get a look at Robin. They make momentary eye contact. Steven pushes him back \nout.\n\n<b>CABLE GUY\n</b>But calling me back isn't?\n\n<b>STEVEN\n</b>I'm sorry. Please, you've got to help me.\n\n<b>CABLE GUY\n</b>Why should I help you? I gave you free\ncable. What have you ever done for me?\n\n<b>STEVEN\n</b>Anything you want. Name it \u0096 quickly.\n\n<b>CABLE GUY\n</b>Tomorrow night, we hang out.\n\n<b>STEVEN\n</b>Fine, whatever you want.\n\n<b>CABLE GUY\n</b>God bless you. You're too good to me.\n\nThe Cable Guy walks over to a fuse type box, turns one knob, then walks back to Steven.\n\n<b>CABLE GUY\n</b>(loud-normally)\nAll set.\n\n<b>STEVEN\n</b>So what's with the cut cord?\n\n<b>CABLE GUY\n</b>(nonchalantly)\nThat's for effect. See ya' tomorrow\nSteven.\n(conspiratorially)\nShe's pretty. And don't kiss her. Don't\neven touch her. Fight the urge at all\ncosts. It will pay off later with\u0085\n\nHe makes a motion which implies sex.\n\n<b>CABLE GUY\n</b>Enjoy the flick.\n\nThe Cable Guy walks away. Steven walks back inside.\n\n<b>ROBIN\n</b>Who was that?\n\n<b>STEVEN\n</b>Nobody.\n\nSteven sits down next to Robin. Robin moves next to him. Steven looks very happy.\n\n<b>28\tON THE TV\n</b>\nA scene from the film \"Sleepless in Seattle.\"\n\nThe camera pulls out and reveals the Cable Guy watching the film in the back of his van \u0096 alone. \nWe cannot see much of the inside of the van because the only light is that of the television, but we \ncan tell that he lives there.\n\n<b>29\t(SCENE 29 OMITTED)\n</b>\n<b>30\tEXT. PARKING LOT - DUSK\n</b>\nThe Cable Guy and Steven walk across a parking lot. Steven has his eyes closed.\n\n<b>CABLE GUY\n</b>Sorry about yesterday. I was in kind of\na weird mood. How'd things go with you?\nKeep 'em closed.\n\n<b>STEVEN\n</b>Pretty well. We'll see. Look, about the\nother night. I didn't appreciate you --\n\n<b>CABLE GUY\n</b>Don't peek. I want this to be a\nsurprise.\n\n<b>STEVEN\n</b>I really don't need to be surprised.\nWhere are we going?\n\n<b>CABLE GUY\n</b>Only the best restaurant in town.\n\nThey walk around a corner.\n\n<b>CABLE GUY\n</b>Okay, here we are. Open sesame.\n\nSteven opens his eyes.\n\nThe camera moves behind then and reveals an enormous faux castle with a big sign on it which \nsays \"MEDIEVAL TIMES RESTAURANT.\"\n\n<b>STEVEN\n</b>Medieval Times?\n\n<b>CABLE GUY\n</b>I know what you're thinking. Don't\nworry, I'm buying.\n\n<b>31\tINT. MEDIEVAL TIMES - LATER\n</b>\nThe Cable Guy and Steven are walking to their table. All the seating overlooks a large, circular \narena, the kind a rodeo is held in. The entire restaurant/arena is designed in Medieval themed \ndecor. All of the staff are dressed as knights, sorcerers, royalty, etc.\n\n(Revision Ends - Pink)\n\n<b>STEVEN\n</b>Funny. I never thought I would ever\ncome here.\n\n<b>CABLE GUY\n</b>I love this place. I come here twice a\nweek.\n\nA Hispanic woman with a large butt walks by. The Cable Guy is transfixed.\n\n<b>CABLE GUY\n</b>Oh man, that's my look. I love big\nbutts. Ow, that hurts.\n\nHe grabs his crotch and squeezes, as if it's the only way he can control himself.\n\n<b>CABLE GUY\n</b>There oughta be a law. Man she is hot.\nIt's just not fair.\n\n<b>STEVEN\n</b>(gestures to him squeezing his crotch)\nPlease don't.\n\n<b>CABLE GUY\n</b>You know what I need right now? Pooooon\ntang. And I'm not talking about the\nplace in Vietnam.\n\n<b>STEVEN\n</b>Good to know.\n\nThey sit down. The WAITRESS walks over. She is dressed in peroid clothes, but is not \nenthusiastic about her job.\n\n<b>WAITRESS\n</b>(flatly)\nWelcome to Medieval Times. My name is\nMelinda. I'll be your serving wench.\nMay I get you something from the bar\nkeep?\n\n<b>CABLE GUY\n</b>(too into it)\nDost thou have a mug of ale for me\nand me mate? He has been pitched in\nbattle for a fortnight an has a King's\nthirst for the beer thust thou might have\nfor thust.\n\n<b>WAITRESS\n</b>(uninspired)\nI'll be right back my lord.\n\nThe Cable Guy puts something together.\n\n<b>CABLE GUY\n</b>There you go.\n\nHe hands Steven a paper crown. They both put theirs on.\n\n<b>STEVEN\n</b>Thanks for the help.\n\nThe Cable Guy sees something. His eyes widen.\n\n<b>CABLE GUY\n</b>Steven, don't turn around, but there is a\nwoman eyeing you like you are a piece of\nmeat and she hasn't eaten in a week.\n\nSteven acts like he isn't interested, but he is.\n\n<b>STEVEN\n</b>Really? What does she look like?\n\n<b>CABLE GUY\n</b>Shoe's a hottie. I wish she was checking\nme out. Man -- she is on fire! Total\nrobo-babe.\n\n<b>STEVEN\n</b>Are you serious?\n\n<b>CABLE GUY\n</b>Don't look.\n\n<b>STEVEN\n</b>I've got to look.\n\n<b>CABLE GUY\n</b>Okay, but play it cool. Just turn like\nyou are looking for the waitress.\n\nSteven puts up his hand, and turns as if he's going to call for the waitress. He sees the woman. She \nis in her sixties, and probably wasn't attractive at any stage of her life. Steven turns back to the \ncable Guy, annoyed.\n\n<b>CABLE GUY\n</b>Ha-ha. I'm just messing with your mind.\nBut you fell for it man. You are one\nhorny Indian Chief.\n\n<b>STEVEN\n</b>(not laughing)\nYou got me.\n\n<b>CABLE GUY\n</b>So what did you want to rap about?\n\nThe trumpets go off, the lights go down and the show begins.\n\n<b>CABLE GUY\n</b>Hold that thought. Show's on.\n\nThe Cable Guy turns and looks at a stage that stands at one end above the arena.\n\n<b>32\tON THE STAGE - A MAN WHO LOOKS LIKE ALAN RICKMAN IN \"ROBIN \n</b><b>HOOD\" SPEAKS TO THE CROWD\n</b>\n<b>HOST\n</b>Welcome to a magnificent journey into the\npast. This is Medieval Times!\n\nThe entire crowd, filled completely with white trash tourists, applauds.\n\n<b>HOST\n</b>Are you prepapred for a night of feasting\nand sport the likes of which ye will\nnever forget?!\n\nThe audience applauds.\n\n<b>HOST\n</b>I charge you to stand up on your feet and\ncheer for your section's knight!\n\nON THE STANDS - Each section of the crowd is painted a color that corresponds with a knight. \nThe Cable Guy stands up and cheers like he is at a wrestling match. Steven remains seated.\n\n<b>CABLE GUY\n</b>Let the games begin! The Red Knight\nrules! Blue Knight! You're going down!\nGoing down!\n\nAn embarrassed Steven applauds politely. The Cable Guy sits down.\n\n<b>33\tINT. MEDIEVAL TIMES - LATER\n</b>\nON THE FLOOR - In the center of the room two Knights are fighting with swords while on \nhorseback.\n\nON STEVEN AND THE CABLE GUY - They are eating whole chickens with their bare hands \nwhile watching the show.\n\n<b>STEVEN\n</b>(to the Watiress)\nCould I get a knife and fork?\n\n<b>WAITRESS\n</b>There were no utensils in Medieval Times,\nso there are no utensils at 'Medieval\nTimes.' Do you want a refill on that\nPepsi?\n\n<b>STEVEN\n</b>There were no utensils, but there was\nPepsi?\n\n<b>WAITRESS\n</b>Look, I have a lot of tables to get to.\n\nThe waitress exits.\n\n<b>CABLE GUY\n</b>(stands up - yells to the competitors)\nSpill his blood! Take his kead! Show no\nmercy!\n\nThe two knights fight with swords. After a few moments of battle the Red Knight wins.\n\nThe crowd erupts. The Cable Guy goes crazy.\n\n<b>CABLE GUY\n</b>(to Steven)\nCome on, get into it, we won!\n\nReleuctantly, Steven stands up and applauds.\n\n<b>STEVEN\n</b>(halfheartedly)\nWay to go Red Knight. Good job of\nkilling. Good work.\n\nSteven and the Cable Guy sit down.\n\n<b>CABLE GUY\n</b>So, what were you saying before?\n\n<b>STEVEN\n</b>(tentatively)\nHow do I put this? I've really enjoyed\nhanging out with you, but...\n\n<b>CABLE GUY\n</b>That's why I became a cable guy. To make\nfriends like you. Every time I walk up to\na new door, that door is a possibility\nfor friendship. When I walked in your\napartment I knew there was something\nthere. I just knew it.\n\n<b>STEVEN\n</b>(sotto)\nOh lord.\n(tries to get back on track)\nI want you to know --\n\nThe lights change. Trumpets play a fanfare. The host walks out onto the stage, interrupting \nSteven.\n\n<b>HOST\n</b>We have reached the climax of our\ncompetition good people! Now, two noble\nmen from our audience will battle to the\ndeath to resolve a grievance. Will a\nMaster...\n(looks at his clipboard)\nSteven M. Bartowsky and Lord Ernie\nDouglas make you way to the fighting\npit!\n\nA spotlight shines on them. Steven is shocked.\n\n<b>STEVEN\n</b>What's going on?\n\n<b>CABLE GUY\n</b>We're going to do battle. It'll be fun.\n\n<b>STEVEN\n</b>Is this a normal part of the show?\n\n<b>CABLE GUY\n</b>No, but I give all the Knights free\ncable. They said it would be cool if we\njust went at it for a little while.\n\nTwo PIMPLY FACED SERFS from the show come and lead them away.\n\n<b>STEVEN\n</b>Is this safe?\n\n<b>CABLE GUY\n</b>That's what the armor's for.\n\n<b>34\tINT. FIGHTING PIT - LATER\n</b>\nSteven and the Cable Guy are being dressed in armor by the two serfs. The Cable Guy could not \nbe happier. Steven is freaked out.\n\n<b>STEVEN\n</b>What are we supposed to do? We've got to\nbe careful we don't hurt each other.\n\nThe Cable Guy doesn't answer him. He has his game face on.\n\n<b>CABLE GUY\n</b>I cannot listen to any of your\ninstructions for you are my sworn enemy,\nand are about to meet your demise.\n\nBefore Steven can answer him the trumpets blare.\n\n<b>HOST\n</b>Let the battle begin. Come now people,\nlet me hear your voices!\n\nThe crowd cheers. Music plays. The serfs hand them each a sword and shield, then walk them to \nthe center of the pit.\n\nThe Cable Guy crouches in a war-like position. He begins to circle Steven like a cat. Steven \nmirrors him, not sure of what to do.\n\n<b>STEVEN\n</b>Just take it easy.\n\nThe Cable Guy runs at Steven, and swings his sword. In fear, Steven puts his shield over his head. \nThe sword smashes into it sending sparks into the air. The Cable Guy darts toward Steven and \npokes him several times with his sword. Each time Steven blocks it with either his sword or his \nshield.\n\n<b>STEVEN\n</b>(enraged)\nWhat are you doing?!\n\n<b>CABLE GUY\n</b>(matter of fact)\nI'm trying to kill you.\n\nThe Cable Guy grabs a mace (a stick with a chain and ball attached to it) off of a weapon filled \nwall and runs at Steven, swinging with abandon. Steven blocks the deadly mace with his shield.\n\n<b>STEVEN\n</b>Hey, watch it!\n\nThe Cable Guy leaps onto Steven. Then he speaks into his ear as he pushes him down onto the \nground.\n\n<b>CABLE GUY\n</b>This is just like when Spock had to fight\nKirk on 'Star Trek.' Best friends forced\nto do battle.\n\nSteven gets angry and pushes the Cable Guy off of him. He swings at the Cable Guy with his \nsword, just missing him. The Cable Guy rolls on the ground and pops back up in the air.\n\n<b>CABLE GUY\n</b>That's the spirit. Let's give 'em a good\nshow.\n\nSteven charges at the Cable Guy, swinging wildly. It is a real battle now. He bangs away at the \nCable Guy's mace until he knocks it out of his hands. The Cable Guy runs backwards, then falls on \nthe ground.\n\nBy the look in his eyes we can tell that the Cable Guy's feelings are hurt.\n\n<b>CABLE GUY\n</b>So that's how it's gonna be, huh? All\nright. If you want to play rought, Daddy\ncan play rough.\n\nThe Cable Guy charges at Steven with his shield. He upper cuts the shield to Steven's face, \nsending him to the ground.\n\nThe Cable Guy runs to the wall and grabs a huge battle ax, a four foot long stick with a fancy \nsilver blade on the end of it. He swings it in circles like a Japanese master. Steven grabs a similar \nweapon, and then begin to circle each other.\n\n<b>STEVEN\n</b>Chip, this isn't funny! Will you stop\nit!\n\n<b>CABLE GUY\n</b>The name is Spock. If we don't battle to\nthe death, they'll kill us both. Good-bye\nJim.\n\nHe swings his sword, and they battle 'Star Trek' style. The Cable Guy begins to sing the \"Star Trek \nBattle Music\" as they fight.\n\n<b>STEVEN\n</b>This isn't 'Star Trek!'\n\n<b>MUSIC UP: STAR TREK BATTLE MUSIC\n</b>\nThey bang the handles of their battle axes together, jockeying for position. The Cable Guy pushes \nSteven away from him, then takes a huge swing, but Steven leaps in the air over the blade. The \nCable Guy swings over his head, and Steven blocks it with his ax handle. They continue to swing \nand roll in a vicious battle.\n\nThen the Cable Guy takes a swing which Steven is unable to block. The battle ax cuts through part \nof Steven's protection.\n<b>STEVEN\n</b>(looking down)\nJesus.\n\nThe Cable Guy runs to a horses' entrance. There is a long pause, and then we hear the sound of \npounding horse hooves. A moment later the Cable Guy rides out on a horse holding a jousting \nstick.\n\nThe show's host runs up to Steven.\n\n<b>HOST\n</b>Quickly, muster a top your steed.\n(Steven doesn't move - the host drops character)\nGet on the god damn horse! I don't think\nhe's kidding!\n\nLeft with no choice, Steven jumps on a horse and grabs a joust. The host smacks Steven's horse \nsending it straight toward the charging Cable Guy.\n<b>STEVEN\n</b>Don't do this!\n<b>CABLE GUY\n</b>Jim, we have no choice!\n<b>STEVEN\n</b>Oh my god.\n\nThey run toward each other. A horrible game of chicken. Neither gives in. When they reach one \nanother Steven knocks the Cable Guy off his horse with his jousting stick.\nThe Cable Guy flies through the air, lands on his back. Steven rides to him. Jumps off his horse, \nthrows off his helmet.\n<b>STEVEN\n</b>(concerned)\nAre you okay?\n\nThe Cable Guy sits up and smile at him.\n<b>CABLE GUY\n</b>Well done good sir. You are the victor,\nbut we shall meet again.\n\nThe two serfs put Steven on a chair connected to two poles. They carry him to the center of the \narena in victory. The crowd cheers wildly. Steven feels the adrenaline rush. He holds up his arms \nin triumph, and smiles.\n<b>DISSOLVE TO LATER:\n</b><b>35\tINT. STEVEN'S APARTMENT BUILDING - NIGHT\n</b>They are walking up the stairs.\n<b>CABLE GUY\n</b>You've got a real warrior's instinct.\n<b>STEVEN\n</b>I've got to admit there's a real feeling\nof power holding that jousting stick.\n<b>CABLE GUY\n</b>If Robin saw you tonight, she would be\nbegging you to take her back. I'm\ntelling you these knights get laid all\nthe time.\n<b>STEVEN\n</b>We should go again next week.\n<b>CABLE GUY\n</b>Easy there Lancelot.\n\nSteven opens the door to his apartment.\n<b>36\tINT. STEVEN'S APARTMENT - CONTINUOUS\n</b>Steven pops into the kitchen and hits a button on his answering machine.\n<b>MACHINE\n</b>You have zero messages.\n<b>CABLE GUY\n</b>Nobody loves ya.\n(grabs a beer from the fridge)\nHey, I think I left my staple gun in the\nliving room the other day. Could you be\na pal?\n\nSteven walks to the living room.\n<b>36AA\tINT. LIVING ROOM - CONTINUOUS\n</b>Steven turns on the lights.\n<b>CABLE GUY\n</b>What do you think?\n\nSteven's entire stereo system and TV have been replaced with a sixty-five inch television, laser disc \nplayer, karaoke machine and a brand new stereo system. All top of the line.\n<b>STEVEN\n</b>What is this?\n<b>CABLE GUY\n</b>I took the liberty of updating your in\nhome entertainment system. I got you the\nbig screen, plus THX quality sound that\nwould make George Lucas cream in his\npants.\n<b>STEVEN\n</b>You went in my house when I wasn't home?\n<b>CABLE GUY\n</b>How else was I supposed to get the stuff\nin here? Magic?\n<b>STEVEN\n</b>How much did this cost?\n<b>CABLE GUY\n</b>Practically nothing. I have a connection.\nPreferred customer. I hook him up, he\nhooks me up.\n<b>STEVEN\n</b>Look, I can't accept this. I wouldn't\nfeel right.\n<b>CABLE GUY\n</b>Yes but you give me something so much\nmore valuable\u0085 friendship.\n<b>STEVEN\n</b>And you've given me friendship, so we're\neven.\n(beat)\nReally, don't take it personally, but\nyou've got to take it back.\n<b>CABLE GUY\n</b>(sadly)\nWell, my buddy with the pick-up truck\nworks all week. Is it all right if I\nleave it here till Saturday?\n<b>STEVEN\n</b>(guilty)\nSure, no problem. And don't get me\nwrong. I really appreciate the gesture.\n<b>CABLE GUY\n</b>Mm-hmm.\n(beat)\nStaple gun?\n<b>STEVEN\n</b>Oh, right.\n\nSteven picks up the staple gun. The Cable Guy pulls out a leather pouch. Steven drops the staple \ngun in the pouch. The Cable Guy never touches it.\n<b>36A\tINT. STEVEN'S OFFICE - NEXT DAY\n</b>Steven dials the phone. On his computer screen a graphic reads \"HELLO STEVEN - HAVE A \n<b>WONDERFUL DAY.\"\n</b><b>STEVEN\n</b>(into the phone)\nRobin, it's Steven again. I'm still\ntrying to reach you. Okay, I'm at work.\nCall me.\n\nHe hangs up. He is getting frustrated. The door opens. Hal Daniels sticks his head in, but does not \nenter.\n<b>MR. DANIELS\n</b>How's it going?\n<b>STEVEN\n</b>Good.\n<b>MR. DANIELS\n</b>(long beat)\nGood good?\n<b>STEVEN\n</b>Great.\n<b>MR. DANIELS\n</b>Good. Keep it up.\n\nHe leaves. The phone rings.\n<b>SECRETARY\n</b>(through the intercom)\nRobin on line two.\n\nSteven lights up. He takes a deep breath, then answers the phone.\n<b>STEVEN\n</b>Hey, I had the best time the other night.\nWhen am I going to get you on my couch\nagain?\n\n<b>36B\tINT. VAN - DAY\n</b>The Cable Guy is driving around. He speaks on a cellular phone.\n<b>CABLE GUY\n</b>Well tonight's not looking too good. How\nabout tomorrow?\n<b>STEVEN\n</b>Chip?\n<b>CABLE GUY\n</b>I knew I'd get you on the phone that way.\nListen, that equipment will be history\nthe day after tomorrow. It sure would be\na pity to leave that karaoke machine a\nvirgin.\n<b>STEVEN\n</b>What do you mean?\n<b>CABLE GUY\n</b>Tomorrow night, you are having a karaoke\njam. No ifs ands or buts. Well maybe a\nfew butts. Later gator.\n\n<b>37\tINT. STEVEN'S APARTMENT - SATURDAY NIGHT\n</b><b>CLOSE UP - AN OLD MAN'S FACE INTENSELY SINGING \"AMERICAN WOMAN.\"\n</b>We pull out to reveal we are in Steven's living room. It is populated with about twenty odd \nlooking misfits mingling and dancing to the music. Among them we see Rick looking very \nuncomfortable.\n<b>37AA\tINT. KITCHEN - CONTINUOUS\n</b>Steven is on the phone. He is dressed up. Occasionally a misfit enters and grabs a drink from the \nfridge.\n<b>STEVEN\n</b>Hey Robin. What's up? Did you get my\nmessage?\n\n<b>37A\tINT. - ROBIN'S APARTMENT - INTERCUT\n</b>The scene intercuts between the two locations. Robin is dressed up, and on her way out.\n<b>ROBIN\n</b>Yes. You left me five messages. It king\nof freaked me out.\n<b>STEVEN\n</b>Sorry. I've been trying to reach you\n'cause I'm having a party.\nYou've got to come over.\n<b>ROBIN\n</b>(listens for a beat)\nI can't. I'm going to dinner with\nsomeone.\n<b>STEVEN\n</b>Dinner? What, like a date?\n<b>ROBIN\n</b>Not really a date.\n<b>STEVEN\n</b>You've got a date?! I thought things\nwere going well between us.\n<b>ROBIN\n</b>They are.\n<b>STEVEN\n</b>So why are you going out on a date?\n<b>ROBIN\n</b>I made it before we got together the\nother night. I knew you would freak out.\n<b>STEVEN\n</b>I'm not freaking out.\n<b>ROBIN\n</b>Yes, you are freaking out.\n<b>STEVEN\n</b>I'm not. I just can't believe you would\ndo this.\n<b>ROBIN\n</b>I'm not doing anything wrong. I'm allowed\nto date. It's not like we're back\ntogether. We had a good time the other\nnight, and you're already pressuring me.\n<b>STEVEN\n</b>(pissy)\nFine, enjoy yourself. Have fun.\n<b>ROBIN\n</b>I will.\n<b>STEVEN\n</b>Fine. Bye.\n\nSteven hangs up the phone. The Cable Guy appears, and hands him a beer.\n<b>CABLE GUY\n</b>This is just a sign that you need to live\na little. She's having fun, and you\nshould too.\n\n(Revised 11/13/95 - Blue)\n<b>STEVEN\n</b>You're probably right.\n<b>CABLE GUY\n</b>Damn right I'm right.\n<b>STEVEN\n</b>Oh, I got you a little something.\n\nHe hands a box to the Cable Guy.\n<b>CABLE GUY\n</b>I thought you said we were even. You're\nbreaking the rules.\n<b>STEVEN\n</b>So shoot me.\n\nHe opens it. The box says, \"Lose Your Lisp in Thirty Days.\" The Cable Guy is so moved he \ncannot speak.\n<b>STEVEN\n</b>My brother said it might help with your\nlisp.\n\nThe Cable Guy looks Steven in the eye for a long beat, then hugs him hard.\n<b>CABLE GUY\n</b>Words cannot express\u0085\n(he is too moved to finish his sentence)\n<b>STEVEN\n</b>It's no big deal.\n<b>CABLE GUY\n</b>Yes it is.\n\nHe stares at Steven until it makes him uncomfortable.\n<b>CABLE GUY\n</b>Now I'm on a mission. This has got to be\nthe best party ever! Let's rock.\n\n<b>37B\tINT. LIVING ROOM - CONTINUOUS\n</b>They walk into the living room. A sad looking OLDER MAN is singing \"Superfreak.\" Everyone's \nhaving fun. We see a couple of off duty policemen in uniform mingling with the crowd.\n(Revision Ends - Blue)\n<b>STEVEN\n</b>You've got plenty of friends.\n<b>CABLE GUY\n</b>These people are acquaintances. They're\nnot ride to the airport friends, like us.\n(sees something)\nWhoa, chick alert at three o'clock. A\nreal barn burner. Don't look.\n<b>STEVEN\n</b>You're playing with me again.\n<b>CABLE GUY\n</b>No sirree Steven. This woman is all over\nyou like a lamp-shade.\n<b>STEVEN\n</b>Shut up.\n\nHe turns and sees a stunning woman standing in the middle of a group of male and female misfits. \nWhen he looks at her, she smiles. He quickly turns back.\n<b>CABLE GUY\n</b>Did it just get hotter in here?\n(grabs his crotch)\nOh, that hurts.\n<b>STEVEN\n</b>Who'd she come with?\n<b>CABLE GUY\n</b>I don't know, but she looks pretty\navailable to me. I'd strike while the\niron is hot. He who hesitates,\nmasturbates, know what I'm saying?\n\n<b>ANGLE ON\n</b>A nerdy, balding man walks over to Rick.\n<b>ODD MAN\n</b>He sure can throw a party. Chip's an\nincredible man. I really admire him.\n<b>RICK\n</b>Where do you know him from?\n<b>ODD MAN\n</b>He hooked up my cable. Didn't charge me\neither. That's the kind of guy he is.\n\n(Revised 11/13/95 - Blue)\n<b>ANGLE ON\n</b>Steven slowly walks over to the pretty woman.\n<b>STEVEN\n</b>Hey. I'm Steven.\n<b>WOMAN\n</b>Heather.\n<b>STEVEN\n</b>Can I get you something to drink?\n<b>HEATHER\n</b>Sure. I'll have a shot of tequila if you\nwill.\n<b>STEVEN\n</b>Coming right up.\n\n<b>37C\tINT. LIVING ROOM - LATER\n</b>AT THE KARAOKE AREA - Steven and Heather are singing \"You're the One that I Want\" from \n\"Grease.\" They are both drunk, and having a great time.\nThe Cable Guy walks over to Rick.\n<b>CABLE GUY\n</b>I'm glad you accepted my invitation.\n<b>RICK\n</b>Steven invited me.\n\nThe Cable Guy looks at Steven and Heather.\n<b>CABLE GUY\n</b>Look at him. Have you ever seen him so\nalive? He's changing, Rick. You've got\nto learn to live with that.\n<b>RICK\n</b>I don't know what your story is \"Chip\nDouglas,\" but I'm going to find out.\n<b>CABLE GUY\n</b>Oooh. How dramatic.\n\nThe song ends. Rick walks away. He waves to Steven as he heads out. Steven runs over to him.\n<b>RICK\n</b>I'm getting out of here.\n<b>STEVEN\n</b>(drunk)\nWhy? This is a great party. This girl\nis really into me.\n<b>RICK\n</b>You're whacked man. That guy is bad\nnews.\n<b>STEVEN\n</b>You don't even know him. You're just mad\n'cause he kicked your ass in basketball.\n<b>RICK\n</b>I can't even deal. I'm outta here.\n\nON THE CABLE GUY - At the karaoke area. He speaks into the microphone.\n\n<b>CABLE GUY\n</b>Hello everyone. First of all I'd like to\nthank Steven for being such a terific\nhost.\n\nSteven smiles, and does a half wave to everyone as they applaud.\n\n<b>CABLE GUY\n</b>Don't forget to kick in some spinach for\nthe beer. Steven ain't made of money.\nAnd I expect some of you to join in the\nclean up crew.\n\n<b>OFF DUTY COP\n</b>Sing something! Do a song!\n\n<b>CABLE GUY\n</b>(false coyness)\nNo\u0085 I really couldn't.\n\n<b>ODD MAN\n</b>Come on! Do your song!\n\n<b>CABLE GUY\n</b>Okay, just to stop that guy from begging.\nThis number is dedicated to all of the\nladies in the house.\n\nHe puts on a Janet Jackson type microphone, then breaks into a fast paced rap of the song \"Bust A \nMove,\" accompanied by elaborate dance moves.\n\n<b>CABLE GUY\n</b>(rapping)\n(Lyrics to \"Bust A Move.\")\n\nDuring the musical break the Cable Guy begins to break dance. He knows all the moves. The \nrobot, the spider, the crab. He looks like a deranged cast member or \"Electric Boogaloo.\" The \nguests go crazy.\n\n<b>ANGLE ON STEVEN AND HEATHER\n</b>\n<b>STEVEN\n</b>You sounded just like Olivia Newton John.\n\n<b>HEATHER\n</b>I've been practicing for years.\n\n<b>STEVEN\n</b>(laughs)\nSo what do you do?\n\n<b>HEATHER\n</b>I can barely hear you. Do you want to\ntalk in the other room?\n\n<b>STEVEN\n</b>Oh\u0085 okay.\n\nThey walk into Steven's bedroom.\n\n<b>ON THE CABLE GUY\n</b>\n<b>CABLE GUY\n</b>(Lyrics to \"Bust A Move.\")\n\n<b>38\tINT. BEDROOM - CONTINUOUS\n</b>\nSteven and Heather are sitting on the bed talking.\n\n<b>STEVEN\n</b>She says she wants a break, and that's\nfine with me. I think I needed some time\nalso.\n\n<b>HEATHER\n</b>Yeah. I know what you mean.\n\nShe leans in and kisses him.\n\n<b>39\tINT. LIVING ROOM - CONTINUOUS\n</b>\nThe cable Guy has got all of the guests in a frenzy.\n\n<b>CABLE GUY\n</b>(Lyrics to \"Bust A Move.\")\n\n<b>40\tINT. STEVEN'S BEDROOM - CONTINUOUS\n</b>\nSteven and Heather are kissing passionately. Suddenly the door flies open, and the Cable Guy \ndances into the room, takes out a Polaroid instamatic camera and FLASHES A PICTURE of \nthem. Steven is disoriented. Behind the Cable Guy in the hallway is everyone from the party.\n\n<b>CABLE GUY\n</b>(Lyrics to \"Bust A Move.\")\n\nHe continues to rap, dance and flash pictures of everyone as he dances out of the room.\n\n<b>41\tINT. STEVEN'S APARTMENT - NEXT MORNING\n</b>\nSteven walks into the living room looking a little disheveled. The Cable Guy is cooking him \nbreakfast.\n\n<b>CABLE GUY\n</b>Good morning sleepy head. I hope you\ndon't mind, I crashed on the couch.\nBacon and eggs coming up.\n\n<b>STEVEN\n</b>Where did Heather go?\n\n<b>CABLE GUY\n</b>I heard her slip out early this morning.\n\n<b>STEVEN\n</b>What a night. That was just what I\nneeded.\n\n(Revision Ends - Blue)\n\n<b>CABLE GUY\n</b>You look like a new man.\n\n<b>STEVEN\n</b>I feel like a new man. I was getting so\nused to being rejected. I really liked\nher.\n\n<b>CABLE GUY\n</b>Hey, it was my treat.\n\n<b>STEVEN\n</b>(taken aback)\nWhat do you mean it was \"your treat?\"\n\n<b>CABLE GUY\n</b>You know, I bought this time, you buy\nnext time.\n\n<b>STEVEN\n</b>(getting concerned)\nBuy what?\n\n<b>CABLE GUY\n</b>You know, the women.\n\n<b>STEVEN\n</b>You mean Heather is a prostitute?\n\n<b>CABLE GUY\n</b>Of course she is. Do you think a woman\nlike that would hang out with us if we\nweren't paying? Don't tell me you didn't\nknow.\n\n<b>STEVEN\n</b>I can't believe this.\n\nHe sits in a chair, and leans over in pain.\n\n<b>CABLE GUY\n</b>She's clean I assure you. I tried her out\nlast week to make sure she was top\nquality, and I'm as healthy as a horse. Not\na drip. She's the best, ask any of my\nfriends.\n\nSteven cringes.\n\n<b>STEVE\n</b>You've got to be kidding? Please tell me\nshe's a friend of yours. You're just\nplaying with my mind again, right?\n\n<b>CABLE GUY\n</b>I wish I had friends like that.\n\n<b>STEVEN\n</b>Get out of my house!\n\n<b>CABLE GUY\n</b>Don't be ashamed of yourself. I know she\nwas a working girl, but she kind of liked\nyou. You might have been able to\nget a freebie.\n\n<b>STEVEN\n</b>Out, now! I don't ever want to see you\nagain.\n(to himself)\nRobin is never going to forgive me.\n\n<b>CABLE GUY\n</b>I'll tell you how to handle that. Don't\ntell her. You want to get her back, I'll\nhelp you get her back.\n\n<b>STEVEN\n</b>I don't want your help. I want you to\nleave.\n(gestures to the TV)\nAnd take that stuff out of here.\n\n<b>CABLE GUY\n</b>(calmly)\nWhatever. I can take a hint. I'll see\nya'.\n\nThe Cable Guy exits.\n\n<b>42\tOMITTED\n</b>\n<b>43\tEXT. FANCY RESTAURANT - NIGHT\n</b>\nP.O.V. Shot - Robin and a date enter the restaurant.\n\nWe move to reveal the Cable Guy driving up in his van. He watches them from across the street. A \nmoment later he heads inside.\n\n<b>44\tINT. FANCY RESTAURANT - NIGHT\n</b>\nThe Cable Guy enters the restaurant. The HOSTESS walks over to him.\n\n<b>HOSTESS\n</b>May I help you?\n\n<b>CABLE GUY\n</b>No, I'm meeting someone here.\n\nHe looks around the restaurant, then spots Robin and a handsome, chiseled man at a table. They \nare on a date. The Cable Guy looks angry. He walks to the restroom.\n\n<b>45\tINT. RESTROOM - NIGHT\n</b>\nAn OLDER BATHROOM ATTENDANT stands in front of the sinks. On the counter sits a \nvariety of toiletries. A MAN washes his hands. The bathroom attendant hands him some paper \ntowels. The man puts a tip in the basket, and exits.\n\n<b>BATHROOM ATTENDANT\n</b>Most appreciated.\n\nThe Cable Guy walks over to the bathroom attendant. He dramatically whips out a twenty dollar \nbill, and puts it in front of the bathroom attendant's nose.\n\n<b>CABLE GUY\n</b>You've been working hard. Take a break.\n\n<b>46\tINT. RESTAURANT - A LITTLE LATER\n</b>\nRobin is talking to her date RAY. He is handsome, and somewhat goofy. They have empty salad \nplates in front of them.\n\n<b>RAY\n</b>My brother and I wanna start our own sun\nblock company. But the twist is, it's\nonly for skiing. SkiBlock. Or SunSki.\nWe haven't decided yet. Maybe BlockSki.\nDo you think that sounds good?\n\n<b>ROBIN\n</b>BlockSki? That sounds right.\n\n<b>RAY\n</b>So, Gail told me you're just coming off a\nrelationship.\n\n<b>ROBIN\n</b>Well, not really. We're kind of in a\nholding pattern. He wants more of a\ncommitment, but I don't think I'm ready.\nI just want to have a good time for a\nwhile.\n\n<b>RAY\n</b>Then we got to get you on a Skidoo!\n\n<b>ROBIN\n</b>Skidoo?\n\n<b>RAY\n</b>High powered snow mobile. It'll blow\nyour mind. It flies over powder like\nit's glass.\n\nTheir waitress passes by.\n\n<b>RAY\n</b>(impatiently)\nHey, how are you doing on that chicken?\nHave the eggs hatched yet? Thanks.\n\nRobin is mortified by his behavior.\n\n<b>RAY\n</b>So, how's your work going?\n\n<b>ROBIN\n</b>It's been crazy. They just hired a \u0096\n\n<b>RAY\n</b>Hold that thought. I have to use the rest\nroom. Be right back.\n\nHe leaves. Robin looks relieved to have a break.\n\n<b>47\tINT. RESTROOM - MOMENTS LATER\n</b>\nRay enters the restroom. The Cable Guy is now wearing the bathroom attendant's blue shirt white \npants and a thin fake moustache. A DISTINGUISHED MAN walks over and washes his hands.\n\n<b>MAN\n</b>(to Cable guy)\nTowel please.\n\n<b>CABLE GUY\n</b>My pleasure.\n\nThe man puts out his hand to take the paper towel, but the Cable Guy doesn't hand it to him, he \ngrabs the man's hands and surrounds them with several paper towels, and begins drying them \nfuriously. When he's done, he takes a beat and wipes them over and over, just to make sure they're \ndry. The man is aghast.\n\n<b>CABLE GUY\n</b>Enjoy your meal\n\nThe man exits. Ray walks toward the stalls.\n\n<b>CABLE GUY\n</b>Good evening sir. Pleasant night, isn't\nit?\n\n<b>RAY\n</b>(curt)\nYeah.\n\n<b>CABLE GUY\n</b>But I guess the weather's always pleasant\nin here. The winters are remarkably mild.\n\nHe laughs at his own joke. Ray walks into the handicapped stall.\n\n<b>CABLE GUY (OS)\n</b>If you need anything, just let me know.\nAnything at all.\n\n<b>RAY\n</b>(getting annoyed)\nI think I can handle it.\n\nRay unzips his fly, and prepares to pee standing up. Suddenly, as if out of thin air, the Cable Guy \nis standing right behind him. He speaks into Ray's ear, startling him.\n\n<b>CABLE GUY\n</b>I'm here to serve you.\n\n<b>RAY\n</b>Jesus! Get out of here!\n\n<b>CABLE GUY\n</b>Most people never bother to take\nadvantage of all my services, for\ninstance \u0096\n\nThe Cable Guy grabs the back of Ray's shirt, kicks his feet out from under him, and slams his face \ninto the toilet bowl, sloshing it around. Ray struggles, but the Cable Guy is too strong.\n\n<b>CABLE GUY\n</b>I can help you wash up. Cleanliness is\nso very important.\n\nHe pulls his face out.\n<b>CABLE GUY\n</b>Then once you're done I have a variety of\nskin care products which can make you\nlook years younger.\n\nThe Cable Guy kicks the door open, and pulls Ray toward the counter. He grabs a bottle of lotion.\n\n<b>CABLE GUY\n</b>This lotion is superb at removing liver\nspots.\n\nHe slaps it onto Ray's face.\n\n<b>CABLE GUY\n</b>This one is an excellent moisturizer.\n\nThe Cable Guy pours some after cologne into his hands, and rubs his hands together as if he's \nabout to put it on Ray's face.\n\n<b>CABLE GUY\n</b>And one can never underestimate the\neffects of a good cologne.\n\nThe Cable Guy rears back and slaps Ray across the face.\n\n<b>CABLE GUY\n</b>(sniffs)\nMm\u0085 High Karate. And now a touch of\npowder.\n\nHe takes a large powder puff, and smashes it into Ray's face temporarily blinding him.\n\n<b>CABLE GUY\n</b>(grabs a tweezer)\nOoh, I almost forget, it's oh so very\nimportant to be properly tweezed.\n\nThe Cable Guy plucks several hairs out from between Ray's eyebrows.\n\n<b>CABLE GUY\n</b>You're on a big date, you'll need fresh\nbreath.\n\nHe takes a clear jar of combs, and pours the blue fluid and the combs into Ray's mouth.\n\n<b>CABLE GUY\n</b>Whoops, that's not mouth wash. But that\nreminds me. Proper hair care is a must.\n\nThe Cable Guy combs his soaking wet hair into a very goofy looking side part.\n\n<b>CABLE GUY\n</b>Looking good, now let's dry you off.\n\nHe runs Ray face first into the starting button of an automatic hand dryer. It turns on. The Cable \nGuy puts his face right up next to the air.\n\n<b>CABLE GUY\n</b>Now suck it. Suck the air!\n\nRay hesitantly puts his mouth around the nozzle, and his cheeks start fluttering like an astronaut \nexperiencing heavy G-Force.\n\n<b>CABLE GUY\n</b>from this angle you look just like Neil\nArmstrong experiencing G-Force. I\nbelieve you have the \"right stuff.\"\n\nThe Cable Guy pulls him away, and smashes his face into the tip basket.\n\n<b>CABLE GUY\n</b>Don't worry about the tip. But I've got\none for you.\n(whispers into his ear)\nStay away from Robin. She's taken.\n\nHe tosses him out the door.\n\n<b>47A\tINT. RESTAURANT - CONTINUOUS\n</b>\nThe door opens, and Ray falls to the floor.\n\n<b>47B\tINT. RESTAURANT - CONTINUOUS\n</b>\nRobin sits alone at her table. She looks at her watch. In the background the Cable Guy slips out.\n\n<b>48\tOMITTED\n</b>\n<b>49\tINT. STEVEN'S LIVING ROOM - NIGHT\n</b>\nSteven is watching television while eating a TV dinner.\n\n<b>ON THE TV - LOCAL TELEVISION NEWS\n</b>\n<b>ANCHOR MAN\n</b>Here's a bizarre story from downtown,\nwhere a man was beaten in a restroom by\nan assailant disguised as a bathroom\nattendant. The victim has been unable to\nspeak since the unmotivated attack.\n\nWe see the image of a shaken up RAY being led out of the restaurant by two police officers.\n\n<b>ANCHOR MAN\n</b>A police sketch artist put together this\ndrawing from witnesses' descriptions.\n\nWe see a drawing which looks a little like the Cable Guy. In it he has a moustache and appears to \nbe Hispanic. Steven looks carefully. Does he know that man? Nah. He changes the channel.\n\nON THE TV - the FOX logo flies up, followed by a slick promo for a FOX Movie-of-the-Week \non the Sam Sweet trial.\n\n<b>ANOUNCER (V.O.)\n</b>Tonight on Fox, the true story behind the\ntrial that's captured the nation.\n\nWe see ERIC ROBERTS holding a shotgun, pointed at another scared ERIC ROBERTS.\n\n<b>ANNOUNCER (V.O.)\n</b>The jury may still be out, but the\nchilling facts are in. Eric Roberts, in\nhis dramatic debut is Sam and Stan Sweet.\n\"Brother, Sweet Brother: The Killing of\nStanton Sweet.\" Tonight on Fox.\n\n<b>49A\tEXT. ROBIN'S APARTMENT - DAY\n</b>\nThe Cable Guy walks over to a FEMALE NEIGHBOR.\n\n<b>CABLE GUY\n</b>Excuse me, apartment 202 is Robin Harris?\n\n<b>FEMALE NEIGHBOR\n</b>(points)\nIt's right upstairs.\n\n<b>50\tINT. ROBIN'S HOME - NEXT DAY\n</b>\nThere is a LOUD KNOCK. Robin walks to the door and opens it without undoing the chain.\n\n<b>ROBIN\n</b>Who is it?\n\nThe Cable Guy sticks his face as far into the crack of the door as possible.\n\n<b>CABLE GUY\n</b>It's the Cable Guy.\n\n<b>ROBIN\n</b>There's no problem with my cable.\n\n<b>CABLE GUY\n</b>I've got an upgrade order for one Robin\nHarris. The Rainbow package, that's every\npay channel available.\n\n<b>ROBIN\n</b>I didn't order this.\n\n<b>CABLE GUY\n</b>Apparently you've got a secret admirer.\n\nShe unlocks the chain, and the Cable Guy quickly steps inside.\n\n<b>ROBIN\n</b>Was it a man named Steven?\n\n<b>CABLE GUY\n</b>I can't tell you.\n\n<b>ROBIN\n</b>Come on.\n\n<b>CABLE GUY\n</b>No, I promised Steven I wouldn't say.\n\nHe gave it away on purpose. They both laugh.\n\n<b>CABLE GUY\n</b>Whoops, I slipped. Well you didn't hear\nit from me.\n\n<b>51\tINT. AIR DUCT - LATER\n</b>\nThe Cable Guy is in the air duct. He is pulling cord. He reaches an area of the duct which opens \nup to a vent. He looks through and sees Robin changing in the bedroom. He tries not to look at \nRobin undress. He turns away.\n\n<b>CABLE GUY\n</b>I'm sorry Steven. I'm just a man.\n\nHe turns back and looks at her. He notices a birthmark on her back.\n\n<b>52\tINT. APARTMENT - LATER\n</b>\nThe Cable Guy is on his way out.\n\n<b>CABLE GUY\n</b>That about does it. Enjoy.\n\n<b>ROBIN\n</b>So, are you a friend of Steven's?\n\n<b>CABLE GUY\n</b>I'm proud to say I am. I installed his\ncable recently, and we just hit it off.\n\n<b>ROBIN\n</b>That's right. You fixed his cable the\nother night.\n(suspicious)\nSo you guys are going out a lot?\n\n<b>CABLE GUY\n</b>Not really. That man is devoted to you.\nYou know I'm probably crossing a boundary\ntelling you this, but he's really crazy\nabout you.\n\n<b>ROBIN\n</b>Did he say that?\n\n<b>CABLE GUY\n</b>Only every five minutes. Quite frankly,\nI'm sick of hearing it. No, I'm just\nkidding with you.\n(looks her deeply in the eyes)\nHe's a good man. He mentioned that you\nguys have had some problems.\n\n<b>ROBIN\n</b>Well, it's a little complicated.\n\n<b>CABLE GUY\n</b>It always is. You know I asked a woman to\nmarry me once. She said she wanted to\nthink about it. We agreed to take some\ntime apart to re-assess our feelings. To\ngive each other\u0085\n(mockingly)\nspace.\n(chokes up)\nWell, she is no longer with us.\n\n<b>ROBIN\n</b>I'm so sorry.\n\n<b>CABLE GUY\n</b>Sometimes you don't have the time you\nthink you have. Just promise me you'll\nnever go bungee jumping in Mexico.\n\n<b>ROBIN\n</b>I promise.\n\n<b>CABLE GUY\n</b>(embarrassed that he spoke too much)\nAnyway, I've got to go.\n\nHe quickly departs. We hold on Robin for a beat.\n\n<b>53\tEXT. ROBIN'S APARTMENT - CONTINUOUS\n</b>\nThe Cable Guy smiles, proud of himself.\n\n<b>53A\tEXT. RENOVATION SITE - DUSK\n</b>\nEstablishing shot of the building. We hear Steven's cellular phone ring.\n\n<b>53B\tINT. RENOVATION SITE - DUSK - INTERCUT\n</b>\nSteven holds on a cellular phone as he walks down the long Gothic hallway of a half renovated \nschool house. Around him construction workers go about their business.\n\n<b>STEVEN\n</b>Hello?\n\n<b>ROBIN (VO)\n</b>I love you.\n\n<b>STEVEN\n</b>Robin?\n\n<b>54\tINT. ROBIN'S APARTMENT - INTERCUT\n</b>\nRobin is on the phone.\n\n<b>ROBIN\n</b>Yes.\n\n<b>STEVEN\n</b>(surprised)\nI\u0085 love you too.\n\n<b>ROBIN\n</b>That was so sweet of you.\n\n<b>STEVEN\n</b>(playing along)\nOh\u0085 well\u0085\n\n<b>ROBIN\n</b>You didn't have to do that.\n\n<b>STEVEN\n</b>I\u0085 wanted to.\n\n<b>ROBIN\n</b>Giving me free cable. Only you would do\nthat.\n\n<b>STEVEN\n</b>You got it? Great.\n\n<b>ROBIN\n</b>Yes, your friend came by.\n\n<b>STEVEN\n</b>My friend?\n\n<b>ROBIN\n</b>The Cable Guy. I liked him. He was kind\nof goofy, but nice. Thank you so much\nfor doing that.\n\n<b>STEVEN\n</b>I'm\u0085 glad you liked it. I've wanted to\ndo something nice for you, but I've been\ntrying to give you your space.\n\n<b>ROBIN\n</b>Well, I don't think we should make rules\nanymore.\n\n<b>STEVE\n</b>Okay.\n\n(Revised 11/13/95 - Blue)\n\n<b>ROBIN\n</b>Call me later if you're around?\n\n<b>STEVEN\n</b>Sure. I'll call you as son as I get\nhome. Bye.\n\nSteven is elated. He can barely contain himself.\n\n<b>RICK (O.S.)\n</b>Steven, are you ready to go?\n\nSteven turns and sees Rick wearing a \"Soundgarden\" T-shirt.\n\n<b>STEVEN\n</b>(pained)\nThe concert. Oh Jesus.\n\n<b>RICK\n</b>What?\n\n<b>STEVEN\n</b>Robin just called. I think we're getting\nback together.\n\n<b>RICK\n</b>(pissed)\nSo you're blowing me off? I can't\nbelieve this.\n\n<b>STEVEN\n</b>This is the first time she asked to get\nback together.\n\n<b>RICK\n</b>You do this every time. You only call me\nafter a girl breaks your heart. \"Oh Rick\ncan I stay on your couch? Let's talk all\nnight about how mean girls are.\" Then as\nsoon as a relationship starts again\nit's bye-bye Rick. I don't know why I\nfall for it anymore.\n\n<b>55\tOMITTED\n</b>\n<b>56\tEXT. STEVEN'S APARTMENT - NIGHT\n</b>\nIt is raining. Rick pulls up, and drops Steven off.\n\n<b>STEVEN\n</b>Can't you get someone else\nto go?\n\n(Revision Ends - Blue)\n\n<b>RICK\n</b>Maybe I'll take MY cable guy.\n\nSteven gets out of the car. Rick drives off. Steven walks up the steps to his apartment. The Cable \nGuy appears from behind a corner.\n\n<b>CABLE GUY\n</b>Pretty smooth work. I set 'em up, you\nknock 'em down.\n\n<b>STEVEN\n</b>What?\n\n<b>CABLE GUY\n</b>Robin. I got her back for you. I juiced\nher up.\n\n<b>STEVEN\n</b>How do you know we're back together?\n\n<b>CABLE GUY\n</b>Free cable is the ultimate aphrodisiac.\n\n<b>STEVEN\n</b>I don't want you messing around with my\nlife. You've caused enough trouble as it\nis.\n\n<b>CABLE GUY\n</b>I know. I felt bad about the other night,\nso I wanted to make it up to you. So\nwhat are you doing? Do you want to catch\na bite?\n\nSteve looks the Cable Guy in the eye.\n\n<b>STEVEN\n</b>(sincerely yet curt)\nLook, I appreciate you helping me out\nwith Robin. But you have to understand,\nI'm going to have to work extra hard to\nnot screw this relationship up again.\nYou're a great guy, but I just don't have\nany room in my life for a new friend. Do\nyou understand?\n\n<b>CABLE GUY\n</b>I appreciate your honesty. You're a real\nstraight shooter.\n\n(Revised 11/13/95 - Blue)\n\n<b>STEVEN\n</b>So, you're okay?\n\n<b>CABLE GUY\n</b>Hey, I'm a big boy. It's no big deal.\nWhatever.\n\n<b>STEVEN\n</b>All right\u0085 well, take care.\n\n<b>CABLE GUY\n</b>Have a good one.\n\nThe Cable Guy walks away. Steven stands there feeling a little guilty about what he just did. \n<b>MUSIC UP.\n</b>\n<b>57\tINT. STEVEN'S APARTMENT - NIGHT\n</b>\nON THE TV - Conan O'Brien is doing a monologue joke about Sam Sweet.\n\nSteven and Robin are kissing. Outside it is raining. There is occasional lightning and thunder. In \nthe middle of kissing, lightning flashes. Steven looks up and sees a flash of the Cable Guy staring \ndown at them, his faced pressed against the skylight. In the next flash he is gone. Was it real? \nSteven looks scared.\n\n<b>ROBIN\n</b>Are you alright?\n\n<b>STEVEN\n</b>I'm fine.\n\nThey go back to kissing.\n\n<b>57A\tEXT. TELEPHONE POLE/INT. ROBIN'S OFFICE - DAY\n</b>\nThe Cable Guy and Robin are speaking on the phone. As the conversation continues we slowly \npull back and reveal that the Cable Guy is standing on the top of a telephone pole, dressed as a \nphone company employee. He speaks into a repairman's phone which is illegally hooked into the \ntelephone pole.\n\n<b>CABLE GUY\n</b>Hey, it's Chip Douglas.\n\n<b>ROBIN\n</b>Chip Douglas?\n\n<b>CABLE GUY\n</b>Your cable guy.\n\n(Revision Ends - Blue)\n\n<b>ROBIN\n</b>(surprised to hear from him)\nOh, hi. What's up?\n\n<b>CABLE GUY\n</b>I feel kind of weird calling you. It's\njust\u0085 I'm worried about Steven.\n\n<b>ROBIN\n</b>What is it?\n\n<b>CABLE GUY\n</b>Something isn't right. He hasn't been\nhimself lately. Have you noticed\nanything?\n\n<b>ROBIN\n</b>No, things are actually going really\nwell.\n\n<b>CABLE GUY\n</b>Good.\n\n<b>ROBIN\n</b>Should I be worried?\n\n<b>CABLE GUY\n</b>Nope. I'm probably just being a nervous\nnellie. Let's just keep our eyes open.\n\n<b>ROBIN\n</b>(nervous)\nI will. Good-bye.\n\nShe hangs up, then dials Steven's number.\n\n<b>ROBIN\n</b>Steven Bartowsky please.\n\n<b>57B\tINT. STEVEN'S SECRETARY'S DESK - CONTINUOUS\n</b>\nHis secretary, JOAN, answers the phone.\n\n<b>JOAN\n</b>Sorry Robin. He's in a meeting.\n\n<b>58\tINT. CONFERENCE ROOM - DAY\n</b>\nA dozen of the top employees of the company Steven works for are having a meeting. Steven \nlistens intently as a SALES MANAGER speaks to the group.\n\n<b>SALES MANAGER\n</b>The response to our initial offering has\nbeen remarkable. A local investment\ngroup has decided to buy the entire\ncomplex and turn them into rentals. In\nretrospect I must admit we made one big\nmistake.\n\nEveryone hangs on his every word.\n\n<b>SALES MANAGER\n</b>We should have asked for more money.\n\nThe entire room laughs. Mr. Daniels stands up.\n\n<b>MR. DANIELS\n</b>I just want to put this out there,\nStevey. You did it bro. You laid your\ncajones, and mine, out on the table, and\nyou slam dunked it. Way to go.\n(nervously jokes)\nNow watch, they'll kick you upstairs\nahead of me. All right, in other\nbusiness\u0085\n\nAs Mr. Daniels speaks, Joan tries to get Steven's attention from a crack in the door.\n\n<b>JOAN\n</b>(quietly)\nPssst. Steven.\n\nSteven turns and sees her. She waves for him to come to her. He waves her off.\n\n<b>JOAN\n</b>(more urgently-quietly)\nI really need to speak with you.\n\nSome people are beginning to notice this exchange.\n\n<b>STEVEN\n</b>(curtly)\nIt can wait.\n\nRight then two POLICE OFFICERS storm into the room. Joan stands behind them looking \nconcerned.\n\n<b>POLICE OFFICER\n</b>Is there a Steven Bartowsky here?\n\n<b>STEVEN\n</b>Uh\u0085 I'm Steven Bartowsky. What's going\non?\n\n<b>POLICE OFFICER\n</b>You are under arrest.\n\n<b>MR. DANIELS\n</b>On what charge?\n\n<b>POLICE OFFICER\n</b>Receipt of stolen merchandise.\n\n<b>STEVEN\n</b>What? I never \u0096\n\n<b>POLICE OFFICER\n</b>Please put our hands on the table.\n\nSteven moves a sudden move toward the Police Officer. The Officer jabs him in the ribs with his \nclub. Steven groans, then leans over in pain.\n\n<b>POLICE OFFICER\n</b>Please follow my instructions. Hands\non the table.\n\nSteven puts his hands on the table. The Officer kicks his legs apart, then frisks him in front of \neveryone. It is pure humiliation.\n\n<b>POLICE OFFICER\n</b>Hands behind your back.\n\nThe other Officer cuffs him, then turns him around.\n\n<b>POLICE OFFICER #2\n</b>You have the right to remain silent.\nAnything you say may be used against you\nin a court of law. You have the right to\nan attorney. If you cannot afford an\nattorney one will be provided for you.\nDo you understand?\n\n<b>STEVE\n</b>This is all a mistake. I didn't accept\nany stolen goods.\n\nJust then it hits him. He hears the Cable Guy's voice in his head.\n\n<b>CABLE GUY (V.O.)\n</b>(with echo)\n\u0085you're getting THX quality sound that\nwould make George Lucas cream in his\npants \u0096 cream in his pants.\n\nHe pushes him toward the door. Steven looks at everyone's horrified faces as he is taken away. He \ntries to break the tension with a joke.\n\n<b>STEVEN\n</b>Hey, relax. I'm the one who's going to\njail.\n\nNobody laughs. He exits.\n\n<b>59\tEXT. OFFICE TOWER - MOMENTS LATER\n</b>\nSteven is walked to a police car, and put inside.\n\nWe slowly reveal a man across the street at an auto shop. He is looking under the hood of his car. \nApparently it has broken down. The man turns and we see that it is the Cable Guy covertly \nwatching Steven's humiliation. As the policeman pushes Steven into the car he looks at the Cable \nguy and touches his nose. The Cable Guy touches his nose.\n\n<b>60\tINT. POLICE STATION - LATER\n</b>\nSteven is chained to a bench. He is speaking to his father EARL, a stout man of sixty, and his \n<b>LAWYER.\n</b>\n<b>EARL\n</b>I can't believe you did this.\n\n<b>STEVEN\n</b>I didn't do anything. My cable guy gave\nme all that stuff as a present.\n\n<b>EARL\n</b>A stereo system and a big screen TV as a\npresent? You expect me to believe that?\nYou know you're killing your mother with\nthis.\n\n<b>STEVEN\n</b>I swear it's true.\n\n<b>EARL\n</b>Why would you accept such extravagant\ngifts?\n\n(Revised 11/13/95 - Blue)\n\n<b>STEVEN\n</b>I don't know. I shouldn't have.\n\n<b>EARL\n</b>What is really going on here Steven? Are\nyou on something?\n\n<b>STEVEN\n</b>I'm fine! I didn't do anything! Please\ncall my cable guy, his name is Ernie\nDouglas.\n\n<b>LAWYER\n</b>Steven, the police looked into it, nobody\nnamed Ernie Douglas works for 'The Cable\nCompany.'\n\n<b>EARL\n</b>You want to tell us the truth now\n\n<b>STEVEN\n</b>(falling apart)\nThat's got to be a mistake. Oh, this\nis not happening.\n\n<b>EARL\n</b>Yes it is, and it's killing your mother.\nDid you deliberately want to ruin our\nfortieth anniversary party on Monday,\nSteven?\n\n<b>STEVEN\n</b>Yeah, Dad, I did. It's all a big plan.\n(to the lawyer)\nWhen can you get me out of here?\n\n<b>LAWYER\n</b>Unfortunately it's too late to get a bail\nhearing today. You're going to have to\nspend the weekend in county lock up.\n\n<b>STEVEN\n</b>The entire weekend?\n\n<b>61\tOMITTED\n</b>\n(Revision Ends - Blue)\n\n<b>62\tINT. PRISON - LATER\n</b>\nSteven is now wearing prison blues. He holds a pillow and a set of sheets as he walks down the \nlong corridor to his cell. Lining each side are cells filled with angry prisoners who throw things at \nSteven, and taunt him as he walks by. It is a nightmare.\n\n<b>PRISONER #1\n</b>New meat! Look at the pretty boy!\n\n<b>PRISONER #2\n</b>Nobody touches him, he's mine! You touch\nhim, you're dead!\n\n<b>PRISONER #3\n</b>Is baby scared? Don't cry baby!\n\nThey all laugh and scream at him until he reaches his cell. A guard opens the door. Steven enters \nhis cell. He turns and inside is an angry looking prisoner. The door is locked behind him.\n\n<b>ANGRY PRISONER\n</b>Ooh, looks like I won the lottery.\n\n<b>63\tOMITTED\n</b>\n<b>64\tINT. VISITORS ROOM - MORNING\n</b>\nA guard walks Steven in. His lawyer sits on the other side of the glass with his back to Steven. \nSteven sits down and picks up the phone, excited to hear any news.\n\n<b>STEVEN\n</b>What did you hear? What did you hear?\n\nThe man turns around. It is not Steven's lawyer, it is the\nCable Guy dressed in an expensive suit.\n\n<b>CABLE GUY\n</b>Hello Steven. I came as soon as I heard.\n\nSteven's head sinks.\n\n<b>STEVEN\n</b>Who are you?! What's your real name?!\n\n<b>CABLE GUY\n</b>So many questions.\n\n<b>STEVEN\n</b>Why are you doing this to me?\n\n<b>CABLE GUY\n</b>I didn't do this to you, you did this to\nyou. You need to learn who your friends\nare.\n\n<b>STEVEN\n</b>You set me up.\n\n<b>CABLE GUY\n</b>I taught you a lesson. I can be your best\nfriend, or your worst enemy. I hope\nyou'll choose the latter\u0085 I mean, the\nformer. You know what I mean.\n\n<b>STEVEN\n</b>I'll never be your friend. You need help.\n\nThe Cable Guy absorbs the blow, then goes on the offensive.\n\n<b>CABLE GUY\n</b>Right now I think you're the one who\nneeds help. I'm here to give you comfort.\n\nThe Cable Guy huts his hand up to the glass.\n\n<b>CABLE GUY\n</b>Come on, touch it.\n\nSteven just stares at him.\n\n<b>CABLE GUY\n</b>Come on. You need human contact. Touch\nit.\n\n<b>STEVEN\n</b>I will not touch it.\n\nThe Cable Guy stands up, and begins unbuttoning his shirt.\n\n<b>STEVEN\n</b>What are you doing? Stop it.\n\nSteven looks around frantically.\n\n<b>CABLE GUY\n</b>I know how you're feeling right now.\n\nThe Cable Guy pushes his naked breast against the glass. Other prisoners are beginning to stare.\n\n<b>STEVEN\n</b>(smacking the glass)\nStop it! Stop it!\n\n<b>CABLE GUY\n</b>I'm here for you.\n\n<b>STEVEN\n</b>(smacks the glass three times)\nGet off there! Are you trying to get me\nkilled?\n\nThe Cable Guy begins to laugh.\n\n<b>CABLE GUY\n</b>(as he buttons his shirt)\nI was just messing with your mind. That\nwas from 'Midnight Express.' Awesome\nfilm. Oliver Stone won the Academy Award\nfor the screenplay.\n\n<b>STEVEN\n</b>Guard! Guard!\n\n<b>CABLE GUY\n</b>Don't you worry about Robin, I'll make\nsure she's well taken care of.\n\n<b>STEVEN\n</b>You go near her, I'll kill you.\n\nSteven lunges at the glass. Steven's guard pulls Steven out of the room toward the exit.\n\n<b>STEVEN\n</b>Hey, this is the guy who framed me!\n\nThe Cable Guy walks to his door. He turns to the guard at the door.\n\n<b>CABLE GUY\n</b>(warmly)\nLouis, how'd you like that Tyson fight on\nPay Per View? I told you it's more fun\nwhen it's Free Per View.\n\nThey both laugh. The door closes behind them.\n\n<b>65\tEXT. OUTDOOR CAFÉ - DAY\n</b>\nThe Cable Guy is sitting at a table wearing a Walkman. People look at him funny as he speaks out \nloud to his lisp tape.\n\n(Revision 11/13/95 - Blue)\n\n<b>CABLE GUY\n</b>(over-pronouncing)\nSea shells. Sea shells. Salmon. Salmon.\nSilverware. Silverware. Suspicious.\nSuspicious. Sensational. Sensational.\n\nRobin is brought over to the table by a hostess. The Cable Guy takes off his Walkman, and stands \nup to be polite. He sits down in perfect synch with her.\n\n<b>ROBIN\n</b>Hello.\n\n<b>CABLE GUY\n</b>Hello. I'm sorry we have to meet under\nthese circumstances.\n\n<b>ROBIN\n</b>Me too. Believe me.\n\n<b>CABLE GUY\n</b>I know we don't know each other very\nwell, but we do have one thing in common, \nour concern for Steven.\n\n<b>ROBIN\n</b>Well, you were right. Something's\nhappening with him and he won't even\nacknowledge it.\n\n<b>CABLE GUY\n</b>If he refuses to admit he has a problem,\nwe may have to let him hit bottom. He's\ngonna need some tough love.\n\n<b>ROBIN\n</b>(tentatively)\nYou know his lawyer said that nobody\nnamed Ernie Douglas works for the Cable\nCompany.\n\n<b>CABLE GUY\n</b>(chuckles)\nDid he do a name search? 'Cause I work\nunder a pseudonym so the customers won't\nharass me at home. Kind of like a\nstripper. My real name is Larry, Larry\nTate.\n\n<b>ROBIN\n</b>And he's saying he received all the\nstereo equipment from you.\n\n<b>CABLE GUY\n</b>(I know, and I'm not mad. He's been\ncornered, so he's telling some wives\ntales. He doesn't mean to hurt me.\n\n<b>ROBIN\n</b>I just feel like I triggered this with\nhim. It's not that I don't want to get\nmarried, it's just I felt like he wanted\nto get married just to get married. I\ndon't deal well with pressure.\n\n<b>CABLE GUY\n</b>Hey, welcome to the human race. We're\nnot perfect. We all think we have to\nlook like a 'Baywatch' babe and be as\nwitty as 'Seinfeld.' Give yourself a\nbreak.\n\n<b>ROBIN\n</b>God I could go for turkey and mashed\npotatoes now.\n\n<b>CABLE GUY\n</b>Comfort food. Bring it on.\n\n<b>ROBIN\n</b>Exactly.\n\nShe laughs.\n\n<b>CABLE GUY\n</b>You've got a great laugh. Can I make a\nsmall request? I'd like to hear it a little\nmore often.\n\nShe blushes.\n\n<b>66\tINT. PRISON ADMINISTRATION - NEXT DAY\n</b>\nON THE TV - Hard Copy's BARRY NOLAN, sits behind his desk giving a news update.\n\n<b>BARRY NOLAN\n</b>The Sam Sweet trial has been thrown into\nchaos as a result of a videotape made a\nmonth after the killing. In this \"Hard\nCopy\" exclusive an apparently intoxicated\nSam Sweet puts on a macabre show for his\nfriends at a party. The judge has not\ndecided whether this tape is admissible\nas evidence.\n\nWe see a videotape of Sam Sweet at a party. The date and time are seen in the corner. Sam stands \nnext to the corner of a wall which is completely covered with a mirror. Sam gestures with a beer \nbottle as he looks at his reflection in the mirror.\n\n<b>SAM SWEET\n</b>(to camera)\nHey everyone. Look it's me and\u0085\n(gestures to his reflection)\nmy brother Stan.\n(waves at reflection)\nHi Stan. It's so nice to see you. How\nare you feeling?\n(to camera)\nLook, he's alive.\n\nSam punches the mirror, shattering it.\n\n<b>SAM SWEET\n</b>(angry)\nNow he's dead.\n\nRealizing he's revealed too much, he forces a smile.\n\n<b>SAM SWEET\n</b>What? I'm just goofing around.\n\nWe pull back and reveal a group of police officers watching this on television.\n\nWe pan over to Steven's father EARL paying bail.\n\n<b>STEVEN\n</b>I'm sorry dad.\n\n<b>EARL\n</b>I don't want to hear it. Do you know the\npain you out your mother through? You're\nlucky she didn't die of a heart attack.\n\n<b>STEVEN\n</b>I didn't do anything.\n\n<b>EARL\n</b>Just like you said you didn't steal that\n'X-Men' comic book when you were eight.\nThen I found it in your underwear drawer.\n\n<b>STEVEN\n</b>Will you ever stop mentioning that?\n\n<b>EARL\n</b>This cost me a lot of money. You jump\nbail, and I swear I'll hire a bounty\nhunter to hunt you down.\n\n<b>67\tINT. STEVEN'S APARTMENT - DAY\n</b>\nSteven walks into his apartment, exhausted from his jail experience. He walks into the living room \nand sees several new frames on the wall. They are four foot blow ups of Polaroid photographs of \nSteven with his arm around the Cable Guy at the karaoke jam. The photos have been tinted in a \nstylish fashion.\n\nSteven angrily runs to the wall and takes them down.\n\n<b>68\tOMITTED\n</b>\n<b>69\tEXT. STEVEN'S PARENTS' HOME - NIGHT\n</b>\nSteven and Robin are walking up the stairs to the front door. They are dressed up for his parents' \nanniversary party.\n\n(Revision Ends - Blue)\n\n<b>ROBIN\n</b>Are you sure you're okay?\n\n<b>STEVEN\n</b>I'm fine.\n\n<b>ROBIN\n</b>You're not fine. When you say you're\nfine, I know you're not fine.\n\n<b>STEVEN\n</b>I just want to get this over with so I\ncan go home and get some rest.\n\n<b>ROBIN\n</b>I wanted you to know I invited your\nfriend. He was concerned about you.\n\n<b>STEVEN\n</b>Great. I feel. Bad. I've been kind of\nblowing Rick off lately.\n\nHe rings the doorbell.\n\n<b>ROBIN\n</b>Not Rick.\n\nThe door opens. Standing there, dressed to kill, is the Cable Guy.\n\n<b>CABLE GUY\n</b>You can only come in if you came to rage.\n\nSteven is shocked. Robin walks in. When Steven walks in, the Cable Guy stops him.\n\n<b>CABLE GUY\n</b>(to Robin)\nIs this guy cool?\n(to Steven)\nI'm just joshing. Come on in.\n\nThey walk inside.\n\n<b>70\tINT. STEVEN'S FATHER'S HOME\n</b>\nSteven turns to Robin.\n\n<b>STEVEN\n</b>(enraged)\nWhat is he doing here?\n\n<b>ROBIN\n</b>I invited him.\n\n<b>STEVEN\n</b>When did you invite him?\n\n<b>ROBIN\n</b>At lunch the other day.\n\n<b>STEVEN\n</b>At lunch? You had lunch with him?\n\nThe Cable Guy walks over.\n\n<b>ROBIN\n</b>Hello. You look great.\n\nShe gives him a peck on the cheek. Steven winces.\n\n<b>CABLE GUY\n</b>And you are a vision. Hello Steven.\nYou're looking rested.\n\n<b>STEVEN\n</b>Come here.\n\nHe pulls the Cable Guy aside.\n\n<b>CABLE GUY\n</b>Steven, what's with you tonight? I'm\ngetting some really weird energy from\nyou.\n\n<b>STEVEN\n</b>Maybe it's because I just got out of\nprison, where you sent me. I should just\ndrag you to the police right now.\n\n<b>CABLE GUY\n</b>You can if you like, but I'd hate to have\nto show Robin this.\n\nHe takes out a Polaroid of Steven kissing the hooker.\n\n<b>STEVEN\n</b>You son of a bitch.\n\nThe Cable Gut quickly puts it away.\n\n<b>CABLE GUY\n</b>Come on Steven, let's just have a good\ntime tonight.\n\n(Revised 11/13/95 - Blue)\n\nRobin, Earl and Steven's mother walk over.\n\n<b>EARL\n</b>Steven, your mother and I had a long talk\nwith your friend Larry here when he came\nover to screw in the cable.\n\n<b>STEVEN'S MOTHER\n</b>(to the Cable Guy)\nThank you again for that.\n\n<b>EARL\n</b>(beat)\nWe owe you an apology. I didn't realize\nthe seriousness of your problems. You're\nobviously going through some kind of\npersonal hell and I need to be more\nunderstanding. We didn't get involved\nwith things like that when I was your\nage.\n\nSteven cannot figure out what kind of lie the Cable Guy has told them.\n\n<b>EARL\n</b>I know we haven't been there for you\nlately but we're going to see you through\nthis, 'cause we are a family. I love\nyou.\n\nHe gives him a big hug. Steven grimaces.\n\n<b>STEVEN'S MOTHER\n</b>You've got a good friend here.\n\nThey walk into the next room where the entire family is gathered for pre-dinner cocktails.\n\nSteven's brother PETE walks over to Steven. He carries a baby in a pouch.\n\n<b>PETE\n</b>(winks)\nHey buddy, we're with you. Keep your\nchin up.\n\n<b>71\tINT. DINING ROOM - LATER\n</b>\nAs the Cable Guy charms Steven's family we pan across all of the guests laughing, and enjoying \ndinner.\n\n<b>CABLE GUY\n</b>So Steven is carrying this battle ax, and\nhe's chasing me, swinging like a mad\nman. I'm yelling at him,\n'hey, it's just a show!'\n\n(Revision Ends - Blue)\n\n<b>STEVEN'S SISTER\n</b>He always takes things too seriously.\n\n<b>CABLE GUY\n</b>Tell me something I don't know. This guy\nalmost took my head off.\n\nEverybody laughs.\n\nThe camera moves to Steven. He stares at the Cable Guy, his eyes filled with rage.\n\n<b>STEVEN'S P.O.V.\n</b>\nThe Cable Guy is talking and eating in SLOW-MOTION.\n\nON STEVEN - watching him. He is in normal motion.\n\nON THE CABLE GUY - eating in SLOW-MOTION\n\nON STEVEN - getting very irritated.\n\n<b>STEVEN\n</b>What are you doing?\n\n<b>ON THE CABLE GUY\n</b>\nAs he talks we realize he has not been in slow motion, he's just been pretending he's in slow \nmotion.\n\n<b>CABLE GUY\n</b>It's from \"Goodfellas.\" Remember the\nintro scene at the bar. I'm Johnny Two\nTimes.\n\nHe moves in slow motion some more. Everyone laughs.\n\nTONY, Steven's six year old nephew, runs to the Cable Guy with a toy gun.\n\n<b>TONY/CABLE GUY\n</b>Pow, pow, pow. You're under arrest.\n\nEveryone laughs. The Cable Guy starts running around the table. Tony makes chase, laughing all \nthe way.\n\n<b>CABLE GUY\n</b>You'll never catch me copper.\n\nThe Cable Guy stops, grabs a piece of asparagus and puts it between his lip and nose, and pretends \nit's a moustache.\n\n<b>CABLE GUY\n</b>I'm gonna wear a disguise.\n\nSteven looks at the Cable Guy and remembers something.\n\nSTEVEN'S P.O.V. - He sees the Cable Guy. The artist's rendering of the man who beat up Robin's \ndate appears in front of the Cable Guy's face. Steven realizes that they are the same person.\n\nSteven gets a frightened look on his face.\n\nThe kid points his gun at the Cable Guy and yells \"pow.\" The Cable Guy drops to the floor like \nhe's been shot.\n\n<b>CABLE GUY\n</b>Oh, you got me.\n\nThe Cable Guy plays dead. The kid walks over to him. When he gets close, the Cable Guy lunges \nto grab him.\n\n<b>CABLE GUY\n</b>(devil voice)\nAaah!!! Nobody messes with me and lives!\n\nThe kid screams with laughter and runs away. The Cable Guy chases him around the table and out \nof the room. Steven instantly fears for Tony's safety. He follows them.\n\n<b>72-75\tOMITTED\n</b>\n<b>75A\tINT. LIBRARY - A MOMENT LATER\n</b>\nSteven walks around looking for Tony. Suddenly from behind a couch Tony and the Cable Guy \npop out.\n\n<b>TONY/CABLE GUY\n</b>Booo!\n\nSteven flies back, scared out of his wits. Tony and the Cable Guy start laughing hysterically. They \nhave a grand 'ol time enjoying their little prank.\n\n<b>CABLE GUY\n</b>Oh man, you should have seen your face.\nIt was classic.\n\n<b>STEVEN\n</b>Very funny. Tony, go to your mother!\n\nTony immediately starts crying. He leaves.\n\n<b>CABLE GUY\n</b>Look what you've done.\n\n<b>STEVEN\n</b>I know you beat up Robin's date.\n\nThe Cable Guy's laughter stops on a dime.\n\n<b>CABLE GUY\n</b>I guess I did what you didn't have the\nguts to do.\n\n<b>STEVEN\n</b>You stay away from Robin.\n\n<b>CABLE GUY\n</b>(disturbed)\nDon't mess with me. I'm feeling like a\npart of the family, and I like it. You\nshould try it sometime.\n\nSteven's mother enters.\n\n<b>STEVEN'S MOTHER\n</b>(looks at them)\nMy, you two look like brothers. Come on\nback, we're all having coffee in the\nliving room.\n\nCable Guy quickly starts walking back to the dining room.\n\n<b>CABLE GUY\n</b>(happily)\nAre you guys trying to fatten me up?\n'Cause if you are, you're doing a damn\ngood job of it.\n\nHe laughs, and exits. Steven slowly follows.\n\n<b>76-78 OMITTED\n</b>\n<b>79\tINT. LIVING AREA - LATER\n</b>\nEveryone is sitting around having coffee. The Cable Guy is writing words on torn up pieces of \npaper.\n\n<b>CABLE GUY\n</b>You guys have never played \"Porno\nPassword?\"\n\n<b>EARL\n</b>No, but I like the sound of it.\n\n<b>CABLE GUY\n</b>It's the adult version of the popular\ntelevision game show. Robin you're on my\nteam. Steven, you're with mom.\n(to everyone else)\nYou're the audience.\n\nThe Cable Guy sits next to Robin. Steven and his mother sit across from them.\n\nThe Cable Guy looks at the word, then shows it to the family so none of the contestants can see it. \nHe whispers it in Steven's ear.\n\n<b>CABLE GUY\n</b>(whispers)\nThe password is\u0085 vagina.\n\nSteven winces.\n\n<b>STEVEN\n</b>I really don't want to play this game.\n(looks to his mother)\nWoman. Woman.\n\n<b>STEVEN'S MOTHER\n</b>Uh\u0085 man?\n\n<b>STEVEN\n</b>No.\n\n<b>CABLE GUY\n</b>(to Robin)\nPe-nis. Pe-nis. Pe-nis.\n\nRobin concentrates hard, but she can't figure it out.\n\n<b>CABLE GUY\n</b>Peeee-nis. Peeee-nis.\n\n<b>ROBIN\n</b>Vagina?\n\n<b>CABLE GUY\n</b>(pumps his fist)\nYes!\n\nHe high fives Robin. Everyone laughs.\n\n<b>EARL\n</b>(blurts out)\nI thought it was going to be schlong!\n(covers his mouth - embarrassed)\nWhoops.\n\nEveryone laughs. They are all having a great time, except Steven. The Cable Guy looks at the next \nword, shows it to the family privately, then whipsers to Steven.\n\n<b>CABLE GUY\n</b>The password is\u0085 nipple.\n\n<b>STEVEN\n</b>Can I pass?\n\n<b>EARL\n</b>Come on Steven, don't be a stick in the\nmud.\n\n<b>STEVEN\n</b>Breast. Breast.\n\n<b>STEVEN'S MOTHER\n</b>Tit?\n\nEveryone laughs. Steven's face is red.\n\n<b>CABLE GUY\n</b>Hard\u0085\n(gestures like there is another word after it)\nHard\u0085\n\n<b>ROBIN\n</b>Erection?\n\nEveryone laughs. Steven looks like he might kill the Cable Guy.\n\n<b>STEVEN\n</b>Center. Center.\n\n<b>STEVEN'S MOTHER\n</b>Nipple?\n\nEveryone cheers.\n\n<b>STEVEN'S MOTHER\n</b>I can't believe I got it. I was going to\nsay areola.\n\nEveryone laughs except Steven, who is mortified.\n\n<b>CABLE GUY\n</b>I wish you did, 'cause we'd be ahead.\n\nThe Cable Guy shows the word to everyone, then whispers in Steven's ear.\n\n<b>CABLE GUY\n</b>The password is\u0085 I'm not sure how to\npronounce this, it's either clitoris, or\nclit-oris.\n\n<b>STEVEN\n</b>(snaps)\nI can't say that to my mother!\n\n<b>EARL\n</b>Hey, she's a grown woman. She can handle\nit.\n\n<b>ROBIN\n</b>Come on Steven. We're just having fun.\n\n<b>STEVEN\n</b>No, I've had enough. I can't do this.\nThis guy is ruining my life, I won't sit\nhere and play X-rated party games with\nhim.\n\n<b>EARL\n</b>Steven, I really think you're over-\nreacting.\n\n<b>STEVEN\n</b>I am not over-reacting. You're all being\nfooled by this guy! He's a felon for\nChrist sake!\n(to the Cable Guy)\nI hate you! Get out of my life!\n\n<b>CABLE GUY\n</b>I'm sorry everyone. If I am a nuisance,\nI will leave. I would never stay where I\nam not wanted.\n\n<b>ROBIN\n</b>(to the Cable Guy)\nYou're not a nuisance. Please don't go.\n(to Steven)\nSteven, you're being an asshole.\n\n<b>EARL\n</b>Yeah, Steven it seems like you're the one\nwith the problem.\n\n<b>STEVEN\n</b>What? You have no idea what this guy is\nreally like.\n\n<b>CABLE GUY\n</b>I'll just go.\n\n<b>STEVEN\n</b>See what I mean!\n\n<b>CABLE GUY\n</b>Steven, what's with you tonight?\n(gets close to Steven and whispers)\nRobin showed me that birthmark on her\nleft shoulder. It's very sexy.\n\nSteven punches the Cable Guy in the facem sending him to the floor. All of the women, including \nRobin run to help him.\n\n<b>ROBIN\n</b>(to Steven)\nI can't believe you.\n\nThe Cable Guy gets up.\n\n<b>CABLE GUY\n</b>I'm fine. Thank you for a delightful\nevening.\n(to Steven)\nI forgive you.\n\nHe exits. Everyone looks at Steven like he is the devil.\n\n<b>STEVEN\n</b>You don't understand.\n\nEveryone walks away from Steven. The party is over.\n\n<b>80\tEXT. DRIVEWAY - LATER\n</b>\nRobin is venting her anger at Steven as they walk to the car.\n\n<b>ROBIN\n</b>I just think you were completely out of\nline. I don't know what's happening to\nyou these days.\n\nSteven gets fed up.\n\n<b>STEVEN\n</b>Robin, this guy is a sociopath. He\nleaves messages on my machine night and\nday. He shows up wherever I go. He\nwon't leave me alone.\n\n<b>ROBIN\n</b>Sounds familiar.\n\n<b>STEVEN\n</b>You know he was the one who beat up your\ndate at that restaurant. That's right.\nAnd he gave you the free cable. It wasn't\nme.\n\n<b>ROBIN\n</b>But you took the credit for it?\n\n<b>STEVEN\n</b>That's what he wanted. He was\nmanipulating me. It feels so good to be\nhonest about this. We're finally\ncommunicating. I've been wanting to tell\nyou for so long, but he's been\nblackmailing me.\n\n<b>ROBIN\n</b>Blackmailing you? How?\n\n<b>STEVEN\n</b>With a photograph.\n\n<b>ROBIN\n</b>Of what?\n\n<b>STEVEN\n</b>Me with a... prostitute.\n\n<b>ROBIN\n</b>What?!\n\n<b>STEVEN\n</b>He set it up. He invited this woman to\nmy party and didn't tell me she was a\nprostitute. I'm so glad we can talk\nabout this.\n\n<b>ROBIN\n</b>When did you have a party?\n\n<b>STEVEN\n</b>When we weren't communicating. I invited\nyou. You were out on a date.\n\n<b>ROBIN\n</b>And you were with a prostitute.\n\n<b>STEVEN\n</b>She seduced me. That's what they do.\nThey're professionals. And I didn't even\nknow she was a prostitute.\n\n<b>ROBIN\n</b>So that makes it better?\n\n<b>STEVEN\n</b>That's not the point. The point is this\nguy has been setting me up. He's\nresponsible.\n\n<b>ROBIN\n</b>He didn't have sex with a whore. You\ndid.\n\n<b>STEVEN\n</b>Robin you don't --\n\n<b>ROBIN\n</b>I don't want to hear it. Breaking up was\nthe best thing we ever did. You have\nsome serious problems, and it's not my\nresponsibility to help you. I am only\nresponsible for my own happiness.\n\n<b>STEVEN\n</b>Where did that come from?\n\n<b>ROBIN\n</b>It was Jerry Springer's \"final thought.\"\n\nShe exits.\n\n<b>80A\tINT. NEWSROOM - NIGHT\n</b>\nRick is running to an editing bay. Steven follows him.\n\n<b>STEVEN\n</b>I'm sorry I've been blowing you off.\n\n<b>RICK\n</b>You bet your ass you've been blowing me\noff.\n\n<b>STEVEN\n</b>It's just, this guy is really doing a\nnumber on me.\n\n<b>RICK\n</b>I told you not to hang out with him.\n\n<b>STEVEN\n</b>You're the one who told me to offer him\nmoney so I could get free cable.\n\n<b>RICK\n</b>You didn't tell me he was a psychopath.\n(beat)\nI'll see if I can get my friend in\nresearch to track him down. What's his\nname again?\n\n<b>STEVEN\n</b>Ernie Douglas.\n\n<b>RICK\n</b>Ernie Douglas? Ernie Douglas? Why does\nthat sound so familiar?\n\n<b>81\tINT. STEVEN'S OFFICE - NEXT DAY\n</b>\nSteven's secretary Joan is watching a news report about the Sam Sweet trial on a mini television.\n\nOn the TV - a Female Prosecutor gestures with a shotgun as she questions a policeman.\n\nJoan changes channels. The image changes to LARRY KING interviewing ALAN \nDERSHOWITZ regarding \"the abuse excuse.\"\n\n<b>BACK TO SCENE\n</b>\nSteven walks over to Joan.\n\n<b>STEVEN\n</b>(to his secretary)\nDid anyone notice I'm late?\n\n<b>JOAN\n</b>What are you talking about, you've been\nhere for an hour.\n\n<b>STEVEN\n</b>Thank you.\n\nSteven walks to his office.\n\n<b>81A\tINT. STEVEN'S OFFICE - CONTINUOUS\n</b>\nSteven walks behind his desk. He notices something which disturbs him. His computer is on. He \nclicks a button and a message comes on the screen.\n\n<b>ON THE SCREEN - \"GOOD MORNING STEVEN. HAVE A WONDERFUL DAY. HERE'S \n</b><b>AN EXTRA SPECIAL SURPRISE.\"\n</b>\nThen an image comes on the screen. It is black and white surveillance video, digitized to the \ncomputer format. The video is of Robin and Steven talking. It is the conversation they had before \nthey watched \"Sleepless in Seattle.\"\n\n<b>STEVEN\n</b>Work's good.\n\n<b>ROBIN\n</b>How's Hal?\n\n<b>STEVEN\n</b>Don't get me started. That guy has no\nvision. It's like working for Mr. MaGoo.\nHe's just worthless.\n\n<b>ROBIN\n</b>It's just great that you're getting to do\nit. It's a real step up.\n\n<b>STEVEN\n</b>I know. Now if only someone at corporate\nsmartened up enough to dump Hal, then I\ncould really get some stuff done.\n\nThe sccene starts again. It is on a loop. Steven is aghast. He looks up and sees the scene is playing \non every computer in the office. He gets a panicked look on his face. Is Hal seeing this? He runs \nout of his office to prevent Hal from viewing this.\n\n<b>81B\tOFFICE BULLPEN - CONTINUOUS\n</b>\nSteven runs to the edge of the stairs and looks down.\n\nSTEVEN'S P.O.V. - He sees Hal downstairs, walking into his office.\n\nBACK TO STEVEN - He runs down the stairs towards Hal's office as fast as he can.\n\n<b>81C\tINT. HAL'S OFFICE\n</b>\nSteven walks in. Hal is sitting behind his desk staring angrily at the computer. He looks up and \nsees Steven.\n\n<b>HAL\n</b>Don't worry. I didn't see it --- 'cause I\nhave no vision.\n\nSteven knows what's coming.\n\n<b>82\tOMITTED\n</b>\n<b>82A\tOMITTED\n</b>\n<b>82B\tOMITTED\n</b>\n<b>82C\tINT. PARKING GARAGE - LATER\n</b>\nSteven walks to his car carrying a box filled with his belongings. He has been fired. Suddenly a car \nalarm beeps. It's headlights flash. Then another, and another. Soon he is surrounded by screaming \ncar alarms, and flashing headlights. He looks around in fear.\n\n<b>STEVEN\n</b>Chip! Chip, this isn't funny! Where are\nyou?!!!\n\nSuddenly they all stop simultaneously, and then the only sound is a miniacle laugh echoing through \nthe garage.\n\nSteven runs to his car, and gets in. He drives up the ramp in a panic. From out of nowhere the \nCable Guy steps into the beam of his headlights. He cannot stop in time. The Cable Guy is thrown \ninto the air, then lands on the back of the roof of the car. Before he falls off he grabs on to the bar \nof the luggage rack.\n\nSteven looks through his rear view window and sees the Cable Guy staring at him.\n\nAs Steven continues to drive the Cable Guy climbs on to the roof of the car, then jumps on the \nhood, and stares at Steven through the windshield. Steven swerves around, almost losing control \nof the car.\n\n<b>STEVEN\n</b>Leave me alone! I have no job, no\ngirlfriend, no family anymore! It's\nover! You won!\n\n(Revised 11/13/95 - Blue)\n\n<b>CABLE GUY\n</b>(menacingly)\nOh no. It's not over. It's just gettin'\nstarted.\n\nHe turns a corner very sharply throwing the Cable Guy off his car. The Cable Guy falls to the \nground, rolling many times, then leaps to his feet using the momentum of the roll, and runs off, \nscampering like a supernatural bug.\n\n<b>83-94\tOMITTED\n</b>\n<b>95\tOMITTED\n</b>\n<b>95A\tINT. NEWSROOM - NIGHT\n</b>\nON THE TV - The local news.\n\n<b>MARK THOMPSON\n</b>The jury has notified the judge that they\nare very close to reaching a verdict, and\nwould like to keep deliberating into the\nevening hours.\n\nRick is sitting at his desk. A FEMALE RESEARCHER walks over, and sits down.\n\n<b>RESEARCHER\n</b>There are five people named Ernie Douglas\nin this county. Two are African\nAmerican. One is eighty-five years old.\nOne is eleven years old, and the last one\nis in a wheelchair.\n\n<b>RICK\n</b>So we're nowhere. Ernie Douglas? Ernie\nDouglas?\n\nShe begins tapping her foot nervously.\n\n<b>RICK\n</b>Could you stop that?\n\n<b>RESEARCHER\n</b>Don't snap at me. I'm doing this as a\nfavor.\n\nHe continues staring at her two-tone wing tipped style shoe.\n\n<b>RICK\n</b>(has an epiphany)\nWait, could you start that again? Start\ntapping your foot again.\n\nShe begins tapping. Rick begins humming the theme to \"My Three Sons.\" She joins him. They sing \nlouder and louder. They've broken the code.\n\n(Revision Ends - Blue)\n\n<b>96\tINT. STEVEN'S KITCHEN - NIGHT\n</b>\nThe PHONE RINGS. Steven runs in the front door, and picks up the phone.\n\n<b>STEVEN\n</b>Hello.\n\n<b>RICK (VO)\n</b>Bingo. \"My Three Sons.\"\n\n<b>STEVEN\n</b>Chip and Ernie Douglas.\n\n<b>97\tINT. NEWSROOM - CONTINUOUS - INTERCUT\n</b>\nRick sits at his desk. The researcher is at his side.\n\n<b>RICK\n</b>I've got a list of every cable installer\nfired in the last four years. Every one\nof these guys has the same physical\ndescription as our friend.\n(reads from the list)\nMurray Slaughter, Brendan Walsh, Sam\nMalone, Alex Reiger. There was even a\nguy who liked to be called 'the big\nRagu.'\n\n<b>97AA\tINT. STEVEN'S LIVING ROOM - CONTINUOUS\n</b>\nSteven walks in and looks for the Cable Guy's hidden camera as he speaks on the phone.\n\n<b>STEVEN\n</b>Carmine from \"Laverne and Shirley.\"\n\n<b>RICK\n</b>That's so sad that you know that.\nAnyway, the cable company in town fired a\nguy six months ago named Darren Stevens.\nHe stole the truck and disappeared.\nThat's our guy.\n\nSteven finds a small camera in one of the television speakers. He rips it out.\n\n<b>STEVEN\n</b>So he doesn't even work for the Cable\nCompany?\n\n<b>97A\tINT. STEVEN'S APARTMENT - NIGHT\n</b>\nQuick cuts of Steven bolting doors, and locking windows.\n\n<b>RICK (VO)\n</b>He was fired for beating up a customer\nwho yelled at him for being late. A\ncompany in Denver thinks they might have\na lead on who he really is.\nIf I were you I'd lock down tonight.\nI'll call you when I get some more info.\n\n<b>98\tINT. STEVEN'S BEDROOM - NIGHT\n</b>\nSteven is watching television. He struggles to stay awake.\n\nON THE TV - Court TV. The prosecutor in the Sam Sweet trial is speaking.\n\n<b>PROSECUTOR (ON TV)\n</b>Don't let your memories of these cute\ntwins distract you from the fact that\nthis funny star of a situation comedy\nkilled his own brother in cold blood,\nthen called the police and said he was\nkilled by an Asian gang. There was no\nlaugh-track on that night.\n\nThe prosecutor's words turn into gibberish as Steven's eyes go heavy and he falls asleep.\n\n<b>99\tON STEVEN - HE IS ASLEEP\tHE SLOWLY WAKES UP.\n</b>\nThe gibberish turns into clearly spoken words, only this time the voice sounds more familiar.\n\nON THE TV - We see the Sam Sweet trial. A prosecutor makes a passionate final summation. We \nreveal that it is the Cable Guy.\n\n<b>CABLE GUY\n</b>This man killed his own brother. Some\npeople don't even have a brother...\n\nThe camera pushes in on the Cable Guy's face. He looks to camera.\n\n<b>CABLE GUY\n</b>...do they Steven? Are you listening to\nme? Don't shut it off. Don't shut it --\n\nON STEVEN - He shuts off the TV, and walks out of the room.\n\n<b>100\tINT. STEVEN'S HALLWAY - CONTINUOUS\n</b>\nThe entire apartment appears much larger. Steven walks down the hallway. He looks into the \nliving room and sees Rick.\n\n<b>RICK\n</b>Why do you keep icing me man?\n\n<b>100A\tINT. ELONGATED BATHROOM - CONTINUOUS\n</b>\nHe opens up a door and sees an elongated version of his bathroom. The shower is steaming. The \ntwo eight year old Sweet twins stand in front of it looking very spooky. He quickly closes the \ndoor.\n\n<b>100B\tINT. HALLWAY - CONTINUOUS\n</b>\nHe continues down the hallway and opens the door to the dining room, but when he opens it he \nsees Robin's bedroom.\n\n<b>100C\tINT. ROIN'S BEDROOM - CONTINUOUS\n</b>\nRobin is in bed. A man wearing a cable installer's uniform is smothering her with a pillow. The \nman turns -- it is Steven. He quickly closes the door.\n\n<b>100D\tINT. HALLWAY - CONTINUOUS\n</b>\nHe hears someone pounding on the front door. He opens the door. Nobody is there. Then the \nCable Guy pops into frame holding a cut cord.\n\n<b>CABLE GUY\n</b>You owe me!\n\nSteven slams the door. Then looks through the peep hole.\n\n<b>101\tP.O.V. THROUGH THE PEEPHOLE\n</b>\nThe Cable Guy begins to run full speed at the door. As he does he gets bigger and bigger, and \nmore distorted as he come closer to the peephole. BANG! He hits the door. Then disappears from \nframe. A moment later he stumbles back into frame, then walks to the far end of the hall, and runs \nagain to the door even faster. BANG! He staggers back into position again. He runs toward the \ndoor.\n\n<b>102\tINT. STEVEN'S HALLWAY - CONTINUOUS\n</b>\nSteven runs away from the front door. The door smashes open, and the Cable Guy runs after him.\n\nSteven runs away down the hallway. The hallway appears to be a mile long. He tries to run fast \nbut appears to move in almost slow motion. Every time he looks over his shoulder he sees the \nCable Guy running at an alarmingly fast rate of speed toward him, grunting like a wolf. He looks \nback another time and the Cable Guy is gone.\n\nHe keeps running, and the hallway starts getting smaller and smaller, till he can barely fit through. \nHe becomes trapped at the end of the hall. Arms come out of the window behind him and grab \nhim. Fifty Cable Guy faces pop out of the wall on both sides.\n\n<b>CABLE GUY\n</b>I just want to hang out. No big deal.\n\nSteven breaks free of the hands and runs into his living room.\n\n<b>103\tOMITTED\n</b>\n<b>104\tINT. LIVING ROOM - CONTINUOUS\n</b>\nSteven runs in. The television is on. He sits on the edge of the couch not sure what to do.\n\nHe puts his head down. When he looks up, he sees the Cable Guy's face on the television set. The \nCable Guy's face stretches out from the television, getting larger and larger.\n\n<b>CABLE GUY\n</b>Steven, you're just like me. We're cut\nfrom the same cloth. We're one and the\nsame!\n\nThen it opens its mouth, and swallows Steven pulling him into the television.\n\n<b>105\tINT. STEVEN'S LIVING ROOM - NIGHT\n</b>\nSteven wakes up in a cold sweat.\n\n<b>STEVEN\n</b>(panting)\nOh my god. She's right. I am a\nsmotherer. I'm just like him.\n\nThe phone rings.\n\n<b>STEVEN\n</b>Hello.\n\n<b>CABLE GUY (VO)\n</b>It didn't have to come to this Steven.\nWe could have been blood brothers.\n\n<b>STEVEN\n</b>Rick told me you were fired from The\nCable Company. You're not even a real\ncable guy.\n\n<b>106\tINT. SOMEWHERE - CONTINUOUS\n</b>\nClose up of the Cable Guy's face.\n\n<b>CABLE GUY\n</b>Do you feel good now that you've hurt me?\nWell now I'm going to have to hurt you.\nI'm going to take away what you hold\ndearest in the world.\n\n<b>STEVEN (VO)\n</b>I swear to God, if you touch --\n\n<b>CABLE GUY\n</b>Could you hold on a second, I've got call\nwaiting. It'll just be a sec.\n\nHe clicks over. Steven just sits there, waiting. Waiting some more. Then the Cable Guy clicks \nback.\n\n<b>CABLE GUY\n</b>Sorry about that. Where was I? Oh yeah.\nYou're going to feel my wrath.\n\n<b>107\tINT. STEVEN'S BEDROOM - CONTINUOUS\n</b>\n<b>STEVEN\n</b>(pleading)\nDon't do this. There must be some way\nfor us to work this out.\n\n<b>108\tINT. SOMEWHERE - CONTINUOUS\n</b>\n<b>CABLE GUY\n</b>I wish there was.\n(losing it)\nOh Steven, I'm just so tired. So very\ntired.\n\n<b>STEVEN\n</b>Let's talk in person. Where are you?\n\n(Revised 11/13/95 - Blue)\n\n<b>CABLE GUY\n</b>I'm close. So very close.\n\nThe camera rotates and reveals that the Cable Guy is actually lying down. Then the camera rises \nup and reveals that the Cable Guy is lying in the floorboards right underneath Steven. A single \nbeam of light shines across his face. As he speaks a large daddy long legs spider crawls across his \nface. He never acknowledges it.\n\n<b>CABLE GUY\n</b>You know, I don't think you're right for\nRobin. She needs someone who can be\nsensitive to her needs. Someone who\nunderstands her soul.\n\n<b>STEVEN\n</b>You stay away from her.\n\n<b>CABLE GUY\n</b>Aren't we the control freak. Looks like\nyou're starting to sweat.\n\n<b>STEVEN\n</b>I got the camera. You can't see me.\n\nSteven begins to pick his face.\n\n<b>CABLE GUY\n</b>Oh yeah? Then why are you picking your\nface?\n\nSteven throws the phone. When it lands we see the speaker phone light is on. He begins looking \nfor the camera. He smashes his TV.\n\nJUMP CUTS - Steven tearing through everything in his apartment.\n\n<b>CABLE GUY\n</b>You're getting closer.\n\nSteven overturns a CD rack.\n\n<b>CABLE GUY\n</b>Pity, such a nice CD rack. You know\nsometimes the answer is right under your\nnose.\n\nSteven lloks at the floorboards, then runs out of the room, and returns a moment later with an ax. \nHe starts chopping at the floorboards, tearing the out.\n\nHe looks down into the hole, he sees nothing. Then a hand grabs him by the shirt and pulls his face \ninto the space in the floor. The Cable Guy's face appears in front of him, screaming like a mad \nman. He licks Steven's face quickly, then disappears back into the hole. Steven falls back. He hears \nthe Cable Guy scuttle away.\n\nSteven sticks his head back down into the hole only to see the dust in the floorboards swirl in the \naftermath of the Cable Guy's exit. He hears the Cable Guy crawling through the walls above him, \nthen through the side walls, and away into the distance. When it clears he discovers a small \nmakeshift observation room has been set up in the crawlspace.\n\nThere are a few photos pasted to the floorboards. One shows the Cable Guy as a child standing \nnext to his mother. Steven's picture has been pasted into those photos making him look like the \nCable Guy's brother. The only other photo is of Jerry Springer. Steven sees a small television \nmonitor and a set of headphones from which the Cable Guy has been watching him. He looks at a \ncellular phone. Every speed dial on the back of the phone says \"Steven\" next to it.\n\nSteven gets up, and runs out of his front door.\n\n<b>108A\tEXT. STEVEN'S APARTMENT BUILDING - NIGHT\n</b>\nIt is raining lightly outside. Steven is in his car. He pulls away quickly.\n\n<b>109\tINT. RICK'S NEWSROOM - NIGHT\n</b>\nRick sits at his desk. The PHONE RINGS.\n\n<b>RICK\n</b>Hello.\n\n<b>109AA\tINT. MOVING VEHICLE - NIGHT\n</b>\nSuper Close Up - What the audience will think is Steven's mouth (actually the Cable Guy) \nspeaking on a cellular phone.\n\n<b>STEVEN\n</b>Hey Rick. I need to meet with you right\naway. I've got some information about\nthis crazy cable guy.\n\n<b>RICK\n</b>Me too. I've got the whole story.\n\n<b>STEVEN\n</b>That's great. Let's meet at the old\nschool at nine-thirty.\n\n<b>RICK\n</b>Why all the way out there?\n\n<b>STEVEN\n</b>I think he's been following me. Don't be\nlate, buddy.\n\n<b>109AB\tEXT. ROBIN'S APARTMENT - NIGHT\n</b>\nSteven's car screeches to a stop. He runs up to Robin's door and starts knocking. Her FEMALE \nNEIGHBOOR opens her door.\n\n<b>STEVEN\n</b>Be home! Be home!\n\n<b>FEMALE NEIGHBOOR\n</b>Go away! I remember you. You're her\nobsessive boyfriend. She said you might\ncome here. I'm calling the police.\n\nShe closers her door. He runs off.\n\n<b>109A\tEXT. HALF RENOVATED SCHOOL - NIGHT\n</b>\nRick drives up, then walks into the building.\n\n<b>110\tINT. HALF RENOVATED SCHOOL - CONTINUOUS\n</b>\nRick walks through the school looking for Steven.\n\n<b>RICK\n</b>Steven? Steven?\n\nIn the distance he sees Steven standing in the shadows.\n\n<b>STEVEN\n</b>Hey Rick. I'm really excited to hear\nwhat you found out about this nut.\n\n<b>RICK\n</b>I hit the Holy Grail. This guy is deeply\ntroubled. Only child. His mother was\narrested for prostitution, and phone\nsolicitation. Apparently she was some\nphone sex pioneer.\n\n<b>STEVEN\n</b>No way.\n\n<b>RICK\n</b>And get this, he was discharged from the\nMarines. He got mad at his Sergeant so\nhe sent a weapons silo to Defcon Two\nusing a Radio Shack computer. And that's\nnot the half of it.\n\nAs Rick gets closer Steven steps forward out of the shadows, and we reveal that it is not Steven, \nbut the Cable Guy, dressed like Steven, doing a perfect impression (actually the real voice of \nSteven looped into the Cable Guy's mouth - with a very slight lisp).\n\n<b>CABLE GUY\n</b>Really? Tell me more.\n\nRick's face turns white. He stumbles backwards, trying to get away.\n\n<b>CABLE GUY\n</b>I'm very interested in learning\neverything I can about that wacked out\ncable installer.\n\nHe turns and runs. He is fifteen feet away from the Cable Guy.\n\nThe camera pushes in on the Cable Guy. He pulls out a staple gun, and fires. We hear but do not \nsee Rick yelp, and fall.\n\n<b>CABLE GUY\n</b>It sounds like he might hurt somebody.\n\n<b>110A\tINT. STEVEN'S CAR - NIGHT\n</b>\nSteven is driving in his car. His cellular phone rings. He picks it up.\n\n<b>STEVEN\n</b>(panicked)\nHello.\n\n<b>CABLE GUY (VO)\n</b>(talks like a game show host)\nNosey friends for two hundred. This\nsupposed pal of Steven's is currently\nresiding in the intensive care unit of\nGood Samaritan Hospital.\n\n<b>STEVEN\n</b>Rick.\n\n<b>CABLE GUY (VO)\n</b>I'm sorry, you didn't answer in the form\nof a question.\n\nHe hangs up.\n\n<b>111\tOMITTED\n</b>\n<b>111A\tEXT. HOSPITAL - NIGHT\n</b>\nSteven's car pulls up. He gets out, and runs toward the hospital.\n\n<b>112\tINT. HOSPITAL - NIGHT\n</b>\nSteven flies through the swinging doors, and runs through the hallway of the hospital. He walks up \nto a DOCTOR.\n\n<b>STEVEN\n</b>(rapid fire)\nRick Legatos. He's a friend of mine.\nWhere is he?\n\n<b>DOCTOR\n</b>Room 205.\n\n<b>STEVEN\n</b>Can I see him?\n\n<b>DOCTOR\n</b>Yes. But he can't speak. He's in shock.\n\n<b>113\tINT. HOSPITAL ROOM - MOMENTS LATER\n</b>\nSteven enters the room. The camera pulls back to reveal Rick laying in full traction, face down, his \nrear end heavily bandaged. He is unconscious.\n\nSteven tentatively walks over to Rick's rear end. He pulls back a small portion of the bandage and \nsees that his butt is covered with staples. The staples form the shape of a television with an \nantenna. Inside the TV is the word \"RING.\"\n\n<b>STEVE\n</b>(perplexed)\nRing?\n\nThe phone rings. Steven jumps, then picks up the phone.\n\n<b>STEVEN\n</b>Hello.\n\n<b>CABLE GUY (VO)\n</b>Poor Rick. Seems he had a little\naccident with the business end of a\nstaple gun.\n\n(Revision Ends - Blue)\n\n<b>STEVEN\n</b>You're not going to get away with this.\n\n<b>CABLE GUY\n</b>The question is, are you going to get\naway with it? Apparently there was an\nanonymous tip placed to the police\nleading them to a staple gun at the crime\nscene with your fingerprints all over it.\n\n<b>ROBIN\n</b><b>(VO)\n</b>All right, I'm ready.\n\n<b>114-6\tOMITTED (NOW A PART OF SCENE 106)\n</b>\n<b>116A\tINT. ROBIN'S APARTMENT - CONTINUOUS - INTERCUT\n</b>\nWe reveal that the Cable Guy is at Robin's apartment. They are getting ready to go out.\n\n<b>CABLE GUY\n</b>(non psychotic voice)\nBe right there.\n\n<b>STEVEN\n</b>Was that Robin?\n\n<b>CABLE GUY\n</b>(psychotic again)\nI've got to go. We're going to take a\nromantic stroll on the information\nsuperhighway.\n\nSteven drops the phone, and runs out of the room.\n\n<b>116B\tINT. HOSPITAL HALLWAY - CONTINUOUS\n</b>\nSteven runs down the hall to the elevator. Before he reaches it the doors open, and the two \npolicemen who arrested him at work walk out. Steven quickly turns left, but the policemen see \nhim, and make chase.\n\n<b>OFFICER\n</b>Hey, hold it!\n\n<b>116C\tEXT. HOSPITAL - NIGHT\n</b>\nSteven runs out of the hospital. The two policemen run after him, about twenty feet behind. \nSteven jumps in his car, and takes off. The police follow in their car.\n\n(Revised 11/13/95 - Blue)\n\n<b>116D\tEXT. CITY STREET - NIGHT\n</b>\nSteven's car turns a corner, and flies down a busy boulevard. A second later the police cars follow \nwith sirens blaring.\n\n<b>116E\tEXT. SATELLITE DISH - NIGHT\n</b>\nThe Cable Guy and Robin are at the dish. He gives her the same tour he gave Steven earlier in the \nfilm.\n\n<b>CABLE GUY\n</b>...it all started in Lansford,\nPennsylvania where Panther Valley\nTelevision, with the assistance of Jerrod\nElectronics, created the first cable\ntelevision system.\n\n<b>116F\tEXT. CITY STREET - NIGHT\n</b>\nThe chase continues.\n\n<b>116G\tEXT. SATELLITE DISH - NIGHT\n</b>\nThe Cable Guy and Robin are now standing on the edge of the dish.\n\n<b>CABLE GUY\n</b>The future is now. Soon every American\nhome will integrate their television,\nphone, and computer. You'll be able to\nvisit the Louvre on one channel, and\nwatch female mud wrestling on another.\nYou can do your shopping at home, or play\na game of Mortal Kombat with a friend in\nVietnam.\n\n<b>117\tEXT. CITY STREET - NIGHT\n</b>\nThe chase continues.\n\nSteven slams on the gas, until he is driving one-hundred miles-per-hour. He weaves in and out of \ntraffic, running stop lights, and avoiding obstacles. The police cars disappear behind him. On a \ndime, Steven turns left onto a residential street and shuts off his lights. A moment later all of the \npolice cars pass by. Steven pulls out and heads the other way.\n\n<b>117A\tEXT. SATELLITE DISH - NIGHT\n</b>\n<b>ROBIN\n</b>This is really fascinating, but I really\nthink we ought to go now.\n\n<b>CABLE GUY\n</b>I knew you'd appreciate it. I took\nSteven here once, and he didn't give a\nrats ass about my interests.\n\n<b>ROBIN\n</b>I'm worried about Steven.\n\n<b>CABLE GUY\n</b>Maybe Steven should be worried about you.\n(beat)\nSo, where was I?\n\n<b>118\tOMITTED (NOW PART OF SCENE 109AB)\n</b>\n<b>119\tOMITTED\n</b>\n<b>120\tOMITTED\n</b>\n<b>121\tOMITTED\n</b>\n<b>122\tEXT. DIRT ROAD - NIGHT\n</b>\nSteven drives his car up the muddy dirt road. It gets stuck in the mud. He gets out of the car, and \nbegins walking to the satellite dish which is surrounded by a chain link fence. He hears the sounds \nof horse hooves coming closer, and closer. The  he sees a headless man on a horse ride straight \ntoward the fence. The horse has the coat of arms from Medieval Times. When he reaches it he \nsmashes off the chain with a sword, then rides through. The horse rears back on its hind legs.\n\nThe horse runs full speed directly at Steven. At the last possible moment the horse jumps over \nSteven. When the horse stops, the Cable Guy pops his head through the top of his coat.\n\n<b>CABLE GUY\n</b>(chuckles)\nIchabod Crane! The Disney Channel showed\nit all last month.\n\nThe Cable Guy rides toward him again.\n\n<b>CABLE GUY\n</b>(like the Vegas announcer)\nLet's get ready to ruuuuuummmmbbble!!!!\n\n(Revision Ends - Blue)\n\nThis time when he gets near Steven, he leaps off the horse, onto him. They both slam into a puddle \nof mud. The Cable Guy punches him in the stomach, and then the face.\n\n<b>STEVEN\n</b>Where's Robin?!\n\n<b>CABLE GUY\n</b>This isn't about Robin, this is about you\nand me.\n\nSteven charges directly at the Cable Guy.\n\n<b>STEVEN\n</b>Where's Robin?!!!\n\nSteven tackles him to the ground, and begins hitting him. They are both covered in mud like \nwarriors from the rain forest. Steven grabs a large rock and holds it over his head.\n\n<b>STEVEN\n</b>Tell me!\n\n<b>CABLE GUY\n</b>(nonchalantly)\nI'm sorry, I didn't catch the question?\n\nSteven brings down the rock. At the last moment the Cable Guy moves his head. The rock slams \ninto the ground.\n\n<b>CABLE GUY\n</b>Steven you've changed.\n(beat - then impressed)\nI like it.\n\nThe Cable Guy convulses his body, pushing Steven off him.\n\nThey wrestle on the ground. The Cable Guy gets on top of Steven, then pulls a power drill out of \nhis belt and turns it on.\n\n<b>CABLE GUY\n</b>I think it's time to make you cable ready.\n\nHe slowly brings the drill down to Steven. Steven blindly reaches behind him. He grasps a large \nbranch and bats the Cable Guy off him.\n\nThe Cable Guy grabs a large tree brance and runs towards Steven. They begin fighting in a fashion \nwhich mirrors their Medieval Times swordfight.\n\n<b>CABLE GUY\n</b>Last time we fought I let you win! Best\ntwo out of three!\n\nMUSIC UP: Ominous version of the 'Star Trek' battle music.\n\n<b>CABLE GUY\n</b>(crazed)\nYou treat me like the TV! You use me, but\nyou can't live without me!\n\nThe Cable Guy smashes Steven in the knee with his branch.\n\n<b>CABLE GUY\n</b>You can't shut me off with your remote\ncontrol!!!! I'm not like Robin and Rick\nand Mommy and Daddy and brother and\nsister and cousin --\n\nSteven smashes him in the head with the branch.\n\n<b>STEVEN\n</b>I got the point.\n\nThe Cable Guy goes down. He appears to be unconscious.\n\n<b>ROBIN\n</b>(in the distance)\nSteven.\n\nHe looks to the dish, but cannot see her.\n\n<b>123\tEXT. SATELLITE DISH - MOMENTS LATER\n</b>\nSteven climbs over the edge into the dish. Below him he sees that the bottom of the dish is filled \nwith several feet of rain water.\n\nThree wires go from the points on the edge of the dish, and meet at a point at the center of the \nsatellite, thirty feet above the floor of the dish. ROBIN is hanging by her bound hands from the \ncenter of where those wires meet.\n\nSteven climbs down towrd the bottom of the dish.\n\n<b>ROBIN\n</b>Help me Steven!\n\nIn the background we see the blurry image of the Cable Guy climbing through an entry hatch at \nthe top of the dish. Robin's eyes fill with terror.\n\n<b>ROBIN\n</b>Steven! Look out!\n\n<b>CABLE GUY\n</b>(mimics her)\nYeah Steven. Look out!\n\nThe Cable Guy leaps out of the hatch like a jack-in-the-box. He slides down the dish, knocking \nSteven down. The two tumble down the slope of the dish, and tumble all the way down into the \nwater.\n\n<b>CABLE GUY\n</b>(sweetly, like a girl)\nI've missed you.\n\nThe Cable Guy immediately punches Steven, sending him back into the water. The Cable Guy \ndives on top of him. A moment later the Cable Guy pulls Steven up, then grabs his collar and \nspeaks right into his face.\n\n<b>CABLE GUY\n</b>(dramatically)\n\"Dry land is not a myth, I've seen it.\"\nKevin Costner from Waterworld. I don't\nknow what the fuss was about, the movie\nruled, I saw it six times.\n\nHe pulls Steven under the water, and tries to hold him there. He pulls him up after a few moments.\n\n<b>CABLE GUY\n</b>Isn't it weird that we'vve wound up in\nthis position?\n\nHe pushes him under the water again. After a moment he pulls him back up. Steven gasps for air.\n\n<b>CABLE GUY\n</b>Who would have thunk it?\n\nEnraged, Steven punches him in the mouth with such tremendous force that it appears to have \nknocked his jaw out of alignment.\n\n<b>CABLE GUY\n</b>(without any lisp)\nYou're gonna have to do better than that\nSteven.\n(realizing his lisp is gone)\nSteven. Hey, my lisp is gone.\n\nSteven hits him again, this time on the other side of the face.\n\n<b>CABLE GUY\n</b>(lisping again)\nYou stupid son of a bitch.\n\nThe Cable Guy falls unconscious.\n\n<b>ROBIN\n</b>Steven!\n\nSteven runs to her.\n\n<b>124\tEXT. SATELLITE DISH - LATER\n</b>\nHe runs to the side of the dish. He realizes he must climb up to release her. He climbs onto the \nWIRE and begins tightrope walking toward her. He walks very slowly, almost losing his balance \nseveral times.\n\n<b>STEVEN\n</b>Hang on.\n\nCLOSE ON: The opposite wire. The Cable Guy's muddy hands slam onto it. He pulls himself up.\n\n<b>CABLE GUY\n</b>(laughs maniacally)\nI know what your saying. Who does this\nguy think he is, Jason?\n\n<b>STEVEN\n</b>Stay away from her!\n\nSuddenly, the Cable Guy does a front flip, and lands perfectly on the wire.\n\n<b>CABLE GUY\n</b>I saw that in Trapeze, starring Tony\nCurtis. He was just on \"Life-styles of\nthe Rich and Famous.\" He still looks\nterrific.\n\nSteven is about ten feet from the dangling Robin, but the reverberation from the Cable Guy's \nlanding makes Steven lose his balance. He falls over, but catches ont the wire. He is left hanging \nthere.\n\nThe Cable Guy sees this, and begins to run incredibly fast toward Robin.\n\n<b>CABLE GUY\n</b>And the race is on.\n\nHe does a cartwheel on the strut, hops on one leg, then takes off toward her, running at full speed.\n\nSteven, left with no other option, simply bounces up and down on the wire. Robin sees this and \njoins him.\n\nThe Cable Guy begins to lose his balance.\n\n<b>CABLE GUY\n</b>(knows he's about to fall)\nThis is such an anti-climactic way to end\nthis.\n\nThe Cable Guy loses his balance and falls to the water below. The Cable Guy has surely met his \ndemise.\n\n<b>125\tEXT. SATELLITTE DISH - LATER\n</b>\nSteven and Robin are sitting in the dish, a few feet from where the water begins. They are \nexhausted from their ordeal. They hold each other close.\n\n<b>ROBIN\n</b>I'm sorry I didn't believe you. I love\nyou.\n\n<b>STEVEN\n</b>I love you too. You're right. We\nshouldn't get married. I've got a lot of\nproblems to work out which have\nabsolutely nothing to do with you.\n\n<b>ROBIN\n</b>We'll work them out together.\n\nThey kiss. Suddenly the Cable Guy pops up from underwater. He looks frightening. Then he starts \ncoughing uncontrollably. He looks like a small boy who has swallowed too much water.\n\n<b>CABLE GUY\n</b>(between coughs)\nWhat just happened? Where am I?\n(remembers)\nOh yeah, I was trying to kill you.\n\nHe leaps at Steven, and puts him in a head-lock. He squeezes until Steven passes out. The he lays \nhim on the ground.\n\n<b>CABLE GUY\n</b>(to Robin)\nIt's a sleeper hold. Hulk Hogan used it\non Sly Stallone in \"Rocky Three.\" He\nshould wake up in thirty seconds, so\nlet's get going.\n\nHe holds her around the neck, and puts a staple gun to her head, then walks her out of the dish.\n\nSteven slowly wakes up. He looks and sees the Cable Guy and Robin beginning to climb up the \nrdio antenna. He quickly gets up to follow them.\n\n<b>126 EXT. ANTENNA - NIGHT\n</b>\nThe Cable Guy and Robin climb the antenna. Steven follows them up from a distance.\n\nThe Cable Guy and Robin reach a platform at the top of the antenna. The Cable Guy holds Robin \nwith one hand, and holds a staple gun to her temple with the other hand. Steven climbs onto the \nplatform.\n\n<b>STEVEN\n</b>Easy.\n\nHe walks with Robin to the edge of the platform. There is a one-hundred foot drop to the dish \nbelow. A police helicopter hovers in the air around them.\n\n<b>CABLE GUY\n</b>It didn't have to be this way Steven. I'm\njust trying to show you the kind of\nthings that can happen when you mistreat\npeople.\n\n<b>STEVEN\n</b>Don't do anything stupid.\n\n<b>CABLE GUY\n</b>You know this is just like that secen in\nthat Clint Eastwood movie \"Dirty Harry\" --\n\n<b>STEVEN\n</b>(snaps)\nNo! This is not like anything! This is\nnot a movie! We're real people! You're\nhurting us! This is reality!\n\nThe Cable Guy's eyes turn sad. This hits the Cable Guy like a sucker punch. Dazed, he lets go of \nRobin. She runs to Steven's arms.\n\nFrom below we hear the sound of sirens. A pack of police cars pull up and surround the antenna. \nThe Cable Guy's expression changes. He begins to look like a scared little boy.\n\n<b>CABLE GUY\n</b>If this is reality...\n(he climbs onto the guard railing)\n...I am outta here.\n\nThe Cable Guy slowly falls backward off the antenna.\n\n<b>STEVEN\n</b>Nooo!\n\nSteven lunges for the Cable Guy, grabbing his forearm, then grabbing the antenna with the other \nhand.\n\n<b>STEVEN\n</b>You're not going anywhere.\n\nThe Cable Guy hangs high above the satellite dish. Steven tries to pull the Cable Guy back onto \nthe platform, but the Cable Guy does not want to be saved.\n\n<b>STEVEN\n</b>Don't do this. You just need help. We all\nget lonely.\n\n<b>CABLE GUY\n</b>Yeah, but I get really lonely.\n(beat)\nI mean, look at me.\n\n<b>STEVEN\n</b>You're gonna be fine. Just come on up.\n\n<b>CABLE GUY\n</b>(a long beat)\nSteven, I think I sat too close to the\ntelevision. Mommy was right.\n\nSteven can't hold onto his forearm any longer. The Cable Guy's arm slips and Steven grabs onto \nhis hand at the last possible second.\n\n<b>CABLE GUY\n</b>It's too late for me, but there's a lot\nof little Cable Boys out there who still\nhave a chance. Say good-bye to the baby-\nsitter.\n\n(Revised 11/13/95 - Blue)\n\nThe Cable Guy stops holding onto Steven's hand. He begins falling toward the dish below.\n\n<b>126A\tEXT. ANTENNA - NIGHT\n</b>\nLONG WIDE SHOT of the entire antenna.\n\nThe Cable Guy falls backward toward the satellite.\n\n<b>127\tINT. SUBURBAN HOME - NIGHT\n</b>\nA nuclear family is watching court TV.\n\nOn the TV - A REPORTER speaks to the camera from the courthouse.\n\n<b>REPORTER\n</b>This is the moment America has been\nwaiting for. We've just been told the\njury is ready to render their decision.\n\n<b>128\tEXT. ANTENNA - CINTINUOUS\n</b>\nThe Cable Guy sails through the air. As he falls he looks almost peaceful. Totally comfortable with \nwhat he is doing.\n\n<b>128AA\tINT. COUCH POTATO APARTMENT - CONTINUOUS\n</b>\nA COUCH POTATO sits on a fold out bed, his eyes glued on the television.\n\nON THE TV - The COURT CLERK is about to read the jury's decision.\n\n<b>COURT CLERK\n</b>By unanimous vote the defendant Sam\nSweet...\n\n<b>128AB\tEXT. SATELLITE DISH - CONTINUOUS\n</b>\nCLOSE ON - The Cable Guy plummeting toward the dish, about to hit.\n\n<b>128AC\tINT. NEIGHBORHOOD BAR - CONTINUOUS\n</b>\nThe camera flies through the crowd at the same speed as the Cable Guy straight into a close up of \nthe television.\n\n<b>COURT CLERK\n</b>...has been found --\n\nWe hear a loud thud. The screen turns to white noise.\n\n(Revised 11/14/95 - Pink)\n\nWe hear a loud thud. The screen turns to white noise.\n\n<b>128A\tEXT. TOP OF THE ANTENNA - CONTINUOUS\n</b>\nSteven and Robin gasp.\n\n<b>128B\tEXT. SATELLITE DISH - CONTINUOUS\n</b>\nFrom below we see the Cable Guy's silhouette motionless on the struts of the satellite dish.\n\n<b>128C\tEXT. THE CITY - CONTINUOUS\n</b>\nA wide panorama of the city. All of the color televisions which can be seen through the many \nwindows of apartments and houses turn to white noise.\n\n<b>128D\tINT. NEIGHBORHOOD BAR - CONTINUOUS\n</b>\nThe television shows white noise. Everyone screams at the TV.\n\n<b>129\tOMITTED\n</b>\n<b>130\tOMITTED\n</b>\n<b>131\tEXT. SATELLITE DISH - CONTINUOUS\n</b>\nThe Cable Guy appears dead. The needle of the antenna sticks through his mid-section. A red light \nblinks at the tip of the needle. Then, the Cable Guy's eyes open.\n\n<b>CABLE GUY\n</b>Damn, that hurt like a mother. What the\nhell was I thinking?\n(looks at the needle)\nOh man, that stings.\n\nSteven and Robin look relieved.\n\n<b>CABLE GUY\n</b>A little help here!\n\n<b>132\tOMITTED\n</b>\n<b>133\tOMITTED\n</b>\n<b>134\tINT. COUCH POTATO APARTMENT - NIGHT\n</b>\nA pasty white couch potato stares at the white noise, not sure what to do. He turns and picks up a \nbook. As music crescendos he begins to read.\n\n<b>135\tEXT. SATELLITE DISH - LATER\n</b>\nThe Cable Guy is being taken away on a stretcher toward an emergency helicopter. Steven and \nRobin are covered in police blankets. Steven calls to a paramedic.\n\n<b>STEVEN\n</b>Is he going to be all right?\n\n<b>PARAMEDIC\n</b>I don't know. It's in God's hands.\n\nThe paramedics put the Cable Guy on the helicopter. The helicopter flies away.\n\nP.O.V. SHOT - From the helicopter looking down on Steven and Robin holding each other, \ngetting smaller and smaller until they disappear.\n\n<b>136\tINT. HELICOPTER - CONTINUOUS\n</b>\nThe Cable Guy lies in a stretcher next to the paramedic. He is barely conscious, struggling for \nsurvival.\n\n<b>PARAMEDIC\n</b>Hang in there buddy. Stay with me. Just\nstay with me.\n\nThe Cable Guy's eyes slowly open. He motions for the paramedic to come closer.\n\n<b>CABLE GUY\n</b>Am I really your buddy?\n\n<b>137\tEXT. SKY - DAWN\n</b>\nThe helicopter flies away.\n\n<b>THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Cable Guy</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Lou Holtz Jr.\" title=\"Scripts by Lou Holtz Jr.\">Lou Holtz Jr.</a>  <a href=\"/writer.php?w=Judd Apatow\" title=\"Scripts by Judd Apatow\">Judd Apatow</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Cable Guy Script.html#comments\" title=\"Cable Guy comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:01:38.069870"}