{"title": "Cell, The", "film_link": "/Movie Scripts/Cell, The Script.html", "script_link": "/scripts/Cell,-The.html", "info_raw": "\n\nCell, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Mark Protosevich\nGenres  Horror  Sci-Fi  Thriller\n\nRead \"Cell, The\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nThe Cell\n\n\n\n\n\tFADE IN:\n\n\tA SPECK OF DUST\n\n\tGrains of sand dance in the wind.  As we glide over a VAST\n\tDESERT, the speck of dust becomes a HORSE AND RIDER. \n\tCATHERINE YOUNG straddles the beautiful black animal, her\n\tmesmerizing eyes scanning the horizon.  A curious breeze\n\tblows across her exquisite face and she drinks it in, as if\n\tthe wind itself were telling something to her...\n\n\tCatherine sees a FLICKERING LIGHT in the sand.  She pulls the\n\treins and the horse stops moments before the dune drops into\n\tnothingness.  She dismounts, affectionately scratches the\n\thorse's neck, and follows the LIGHT.  When she looks over her\n\tshoulder, the Arabian is now a child's WOODEN HOBBY HORSE. \n\tNot surprised, Catherine smiles and walks down a dune, sand\n\tsliding beneath her feet...\n\n\tShe finds herself in a valley of dead trees whose decayed,\n\tgnarled limbs appear to form hands.  The light dances across\n\ther face.  She shades her eyes and pinpoints the source...\n\n\tA SMALL MIRROR reflecting rays of bright sun, housed within a\n\tlocket and chain.  It's held by EDWARD, a haunted-looking boy\n\tof seven with a precocious grin and piercing eyes.  He sits\n\ton a fallen tree trunk, patiently waiting for her arrival.\n\n\t\t\t\tCATHERINE\n\t\tThanks for the horse.\n\n\tHe's a shy child, yet comfortable with Catherine.\n\n\t\t\t\tEDWARD\n\t\tYou liked him?\n\n\t\t\t\tCATHERINE\n\t\tHe's beautiful...\n\n\tEdward smiles, delighted he made her happy.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tBut I thought we were going sailing.\n\n\tThe boy frowns.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tYou promised.\n\n\tA devilish glint in his eye, Edward redirects the mirror. \n\tCatherine follows the flicker to a TOY BOAT in the sand.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWe can't fit into that!\n\n\tEdward shines light in her eyes, momentarily blinding her,\n\tthen snaps the locket shut.  When her vision clears,\n\tCatherine sees a GIANT SHIP perched among the dunes.  A craft\n\tweighing hundreds of tons just sitting there in the desert.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tThat'll do.\n\n\tShe walks toward it, but Edward doesn't follow.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\t\t(coaxing him)\n\t\tCome on, Mister E.\n\n\tShe extends her hand, but he adamantly shakes his head no.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat now?\n\n\t\t\t\tEDWARD\n\t\t\t(nods at the ship)\n\t\t's broken.\n\n\tUndaunted, she... finds herself standing on the DECK.\n\n\t\t\t\tCATHERINE\n\t\t\t(calling to him)\n\t\tWho says?\n\n\t\t\t\tEDWARD\n\t\tMocky-Lock.\n\n\t\t\t\tCATHERINE\n\t\tOh no... No you don't.\n\n\t\t\t\tEDWARD\n\t\t\"Mocky-Lock is the bogeyman.  Mocky-Lock\n\t\twants me where I am.\"\n\n\t\t\t\tCATHERINE\n\t\tI bet we can fix it.\n\n\tShe opens a rusted iron DOOR.  It makes an HORRIFIC\n\tSCREECHING SOUND.  Similar to metal-on-metal, but more\n\tpiercing, more pained.  As if made by a living thing.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\t\t(familiar with the noise, a\n\t\t\twarning to him)\n\t\tEd-ward...\n\n\tThe boy's FACE CONTORTS, turning into something half-human,\n\thalf-animal.  A monster.  Mocky-Lock.  He SCREECHES, trying\n\tto frighten Catherine, but she cocks her head...\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWe agreed.  No more Mocky-Lock.\n\n\tThe creature sticks its tongue out and DIVES.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tEdward!\n\n\tBut it's too late!  Edward/Mocky Lock slithers into the sand\n\tand disappears.  Resigning herself to a failure, she opens\n\tthe palm of her left hand, revealing a SMALL BUMP in the\n\tflesh between thumb and forefinger.  She presses hard and...\n\n\tPICTURE AND SOUND DISTORT AND CHANGE\n\n\tINT. LABORATORY - DAY\n\n\tWe are looking at a large SCREEN showing an electronically\n\tgenerated three-dimensional view of a human brain featuring\n\tcolor-coded neurological activity.  In a specific section of\n\tthe image, cells flash from yellow to red...\n\n\tPULL BACK TO REVEAL HENRY WEST surrounded by computers,\n\tmonitors, electronics, and keyboards.  DR. MIRIAM KENT stands\n\tbefore a peculiar diagnostic machine scrutinizing data and\n\timages.  Both wear garb favored by surgeons or microchip\n\tassemblers.  The impressive, weird computer system HUMS as it\n\tshifts programs, the unusual brain image changing colors.  \n\n\tTHROUGH A LARGE WINDOW, we see into an ADJOINING ROOM within\n\twhich a HUMAN FIGURE hangs suspended in mid-air by a series\n\tof cables designed to simulate flotation.\n\n\tAT THE CONSOLE, Miriam uses a pen to hit specific areas of\n\tthe touch-sensitive screen, changing the complex CHEMICAL\n\tSYMBOLS displayed there.\n\n\tIN THE PROCEDURE ROOM, a series of pharmaceuticals are\n\tinjected into an intravenous tube feeding the sleeve/arm of\n\tthe figure.  A featherweight cloth MASK electronically rises,\n\trevealing the sleeping face of Catherine.\n\n\tAT THE CONSOLE, Miriam hits a button and speaks into an\n\tintercom microphone.\n\n\t\t\t\tMIRIAM\n\t\tSing a song of sixpence...\n\n\tIN THE PROCEDURE ROOM, there is no reaction from Catherine.\n\n\t\t\t\tMIRIAM (O.S.) (CONT'D)\n\t\tSing a song of sixpence...\n\n\t\t\t\tCATHERINE\n\t\t\t(hoarse, groggy)\n\t\tA pocketful of rye...\n\n\t\t\t\tMIRIAM (O.S.)\n\t\tFour-and-twenty blackbirds.\n\n\tCatherine's eyes open.\n\n\t\t\t\tCATHERINE\n\t\tBaked in a pie...\n\n\tIN THE CONTROL ROOM, Henry hits a switch and Catherine is\n\tlowered to the pedestal.  Miriam checks Monitors displaying\n\tCatherine's vital signs and continuing what must be a\n\troutine, presses numbers on a keypad to open the PRESSURIZED\n\tAIRTIGHT DOOR separating the two areas.\n\n\tIN THE PROCEDURE ROOM, lights come on and Miriam eases\n\tCatherine out of the apparatus.  She checks her pupil\n\tdilation, pulse, throat, and reflexes.  She pokes and prods\n\twith a familiarity that would seem rude to an outside\n\tobserver, but is nothing to them.  Getting to her feet, we\n\tsee that Catherine's BODYSUIT is made of an unusual dark\n\tfabric almost liquid in consistency.\n\n\tAT THE CONSOLE, Henry moves to another section and for the\n\tfirst time, we see there are two elaborate neural monitors. \n\tAnd the \"brain\" pictured here is smaller.  Younger...\n\n\t\t\t\tHENRY\n\t\t\"Mister E.\" is doing fine.\n\n\tREVEAL A SECOND FIGURE suspended from the ceiling in the\n\tPROCEDURE ROOM.  A SMALL BOY is lowered to the pedestal and\n\tas Miriam records data, Catherine removes the child's \"mask,\"\n\tdisplaying the haunted face of Edward.  Clearly, the boy is\n\tin some kind of catatonic state.\n\n\t\t\t\tMIRIAM\n\t\tDid we go sailing?\n\n\t\t\t\tCATHERINE\n\t\tAlmost.  Mocky-Lock showed up.\n\n\t\t\t\tMIRIAM\n\t\t\"Mocky-Lock is the bogeyman, Mocky-Lock\n\t\twants me where I am.\"\n\n\t\t\t\tCATHERINE\n\t\tMocky-Lock is a pain in the ass.\n\n\tHenry communicates with them via the intercom.\n\n\t\t\t\tHENRY\n\t\tWhere did that come from again?\n\n\tCatherine looks annoyed - How could he forget?\n\n\t\t\t\tCATHERINE\n\t\tA nursery rhyme.\n\n\tCatherine detaches the cables and eases Edward's frail body\n\tinto a waiting wheelchair.  Miriam takes a penlight and\n\texamines the boy's eyes... An emotionless void, oddly\n\tbeautiful.\n\n\t\t\t\tMIRIAM\n\t\t\t(thinking aloud)\n\t\tNursery rhymes, fairy tales, the\n\t\tbogeyman... All preparation for the\n\t\thorrors of the real world.\n\n\tMaking certain the child is comfortable, Catherine covers him\n\twith a blanket, rests a teddy bear on his lap, and pushes him\n\tinto the CONTROL ROOM, accompanied by Miriam.  Henry types in\n\ta command and moves to join them.\n\n\t\t\t\tHENRY\n\t\tAnybody hungry?  I'm hungry...\n\n\tA BUZZER sounds and ANOTHER DOOR HISSES OPEN... A constantly\n\tfretting administrator, BARRY COOPERMAN, is waiting for them\n\tin the corridor.\n\n\t\t\t\tCOOPERMAN\n\t\tEdward's parents are here.\n\n\tWe can see it in Catherine's face - this isn't good news.\n\n\tEXT. CAMPBELL CENTER - DAY\n\n\tSituated in a corporate/industrial area north of San Diego,\n\tCalifornia, a series of well-secured buildings form a mini\n\tcompound.  A sign near the gate reads CAMPBELL CENTER - A\n\tDIVISION OF SUNERSET INDUSTRIES.\n\n\tINT. CAMPBELL CENTER - EDWARD'S ROOM - DAY\n\n\tAlthough this is a hospital room filled with medical\n\tequipment, its sterility has been camouflaged with toys,\n\tposters, photographs, and drawings to make it more \"homey.\" \n\t(Some hint at aspects of Edward's fantasy world).  Every\n\tcomfort has been provided and no expense spared.\n\n\tHenry, Miriam, and Catherine, now wearing funky/casual\n\tclothes under a lab coat, stand opposite Cooperman.  Sitting\n\ton the bed with Edward is ELLA BAINES, an elegantly dressed\n\twoman in her mid-40's.  There is a soulfulness to her, but\n\tthe husband, LUCIEN BAINES, 60's, possesses the icy demeanor\n\tof a corporate tycoon.  One might write him off as cold, but\n\twe sense a genuine love for his wife and child.  Ella smiles\n\tand caresses Edward's hair.\n\n\t\t\t\tELLA\n\t\tHe needs a haircut.\n\n\t\t\t\tCATHERINE\n\t\tI'll tell the nurse.\n\t\t\t(sensing something in Edward)\n\t\tGod, he loves when you visit.\n\n\t\t\t\tELLA\n\t\tMy husband wonders if that's true.\n\t\t\t(delivering bad news)\n\t\tHe wants to place Edward in a hospital.\n\n\tSeeing an unfunded future, Henry's ready to disassociate\n\thimself from Miriam and Catherine...\n\n\t\t\t\tHENRY\n\t\tThere are other applications for the\n\t\tscanner, Mr. Baines...\n\n\t\t\t\tLUCIEN\n\t\tI realize that, Henry...\n\t\t\t(to Miriam)\n\t\tAnd I know your work, Dr. Kent, is\n\t\tinvaluable to this company...\n\n\t\t\t\tCATHERINE\n\t\tYou don't know about me, though, do you?\n\n\t\t\t\tLUCIEN\n\t\tCatherine, we've waited eighteen months\n\t\tfor signs of progress...\n\n\t\t\t\tCATHERINE\n\t\tThere's been progress.\n\n\t\t\t\tLUCIEN\n\t\tYes, but there is no proof the procedure\n\t\tworks.  All I have is a belief that your\n\t\tinteraction with my son is not a\n\t\thallucination.\n\n\tCatherine is hurt and vulnerable due to exhaustion and the\n\tintensity of her experience with Edward, but feels she must\n\tdefend herself.\n\n\t\t\t\tCATHERINE\n\t\t\t(to Cooperman, Miriam, Henry)\n\t\tYou picked me, remember?  And I took the\n\t\tjob.  Gladly.  This is the next wave and\n\t\tI want to be part of it...\n\n\t\t\t\tCOOPERMAN\n\t\tNo one is doubting your ability.\n\n\t\t\t\tCATHERINE\n\t\tThen what is it?\n\n\tIntrospective and solemn-eyed, Lucien takes a moment, then:\n\n\t\t\t\tLUCIEN\n\t\tI've invested millions of dollars in\n\t\tthis study... And I've convinced others\n\t\tto do the same.  I suppose I should feel\n\t\tresponsible to them, but I don't.  I\n\t\tcould care less if they see a profit. \n\t\tI'm responsible to my boy, that's all\n\t\tthat matters.\n\t\t\t(looks her in the eye)\n\t\tYou tell me... Am I doing the right\n\t\tthing?\n\n\tOFF CATHERINE'S FACE...\n\n\tINT. WHITE ROOM - DAY\n\n\tAt first, we're not sure where we are or what's happening. \n\tIt's too bright, the space confining.  As our eyes adjust, we\n\tseem to be in a bathroom or shower stall.  We HEAR a WOMAN\n\tCRYING and the camera finds ANNE VICKSEY.  Dark circles\n\tbeneath eyes red and puffy from crying.  Hair wet and ratted. \n\tSweater and pants damp and stained.  Barefoot, she shivers\n\tfrom cold and fear...\n\n\tPULL BACK to show more of her surroundings.  The white-tiled\n\t10' x 8' room features a SHOWER HEAD, TOILET, and a push\n\tbutton SPIGOT for drinking water.  Two walls are SOLID, the\n\tother two MIRRORED, the glass covered by thick clear plastic.\n\n\tThe floor is littered with empty food wrappers - candy bars,\n\tjuice boxes.  In the center of the floor is a DRAIN and above\n\ther, on the ceiling, a FLUORESCENT LAMP, also encased in\n\tclear plastic.\n\n\tThere is no door.\n\n\tA mechanism CLICKS. Then a RUMBLING... Anne seems to know\n\twhat's coming.  She presses against the wall, removes her\n\tarms from the sleeves of the sweater, hunches down, and\n\traises the garment over her head, forming a tent.\n\n\tWATER ERUPTS from the shower head.  There is no steam, so\n\tthis water must be cold.  Shaking, Anne whispers a count to\n\therself - \"One-one thousand, two-one thousand, three...\" and\n\tso on.  The spray hits everything in the room - mirror,\n\ttoilet, floor - and a food wrapper drifts toward the drain.\n\n\t\t\t\tANNE\n\t\tThirty.\n\n\tShe peeks up from the tent, but the water has not stopped,\n\tand that isn't what she expected.  We hear a soft SUCKING\n\tNOISE and a CLICK.  The wrapper rises on a puddle of water. \n\tAnne POUNDS her fist on the wall.\n\n\t\t\t\tANNE (CONT'D)\n\t\t\t(angry, scared)\n\t\tTHIRTY!\n\n\tA puddle forms around her feet and she realizes the drain has\n\tsomehow been sealed shut.  Her panic intensifies as we hear\n\tanother CLICK and the water pressure increases.\n\n\tINT. CAMPBELL CENTER - LABORATORY - DAY\n\n\tIn the darkened procedure room, Miriam finds Catherine\n\tstanding between the two suspension devices, alone.\n\n\t\t\t\tMIRIAM\n\t\tYou okay?\n\n\tCatherine turns, nods, and tries to smile.  Has she been\n\tcrying?  Miriam steps further into the room.\n\n\t\t\t\tCATHERINE\n\t\tHe hates me.\n\n\t\t\t\tMIRIAM\n\t\tLucien Baines?\n\n\tCatherine nods.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tI wouldn't say \"hates.\"  Dislikes,\n\t\tdistrusts, maybe.\n\n\tCatherine laughs.  Exactly what Miriam wanted.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tShe adores you.\n\n\t\t\t\tCATHERINE\n\t\tShe thinks I can bring Edward back.\n\n\t\t\t\tMIRIAM\n\t\tSomeday you can.  We all believe that...\n\n\tCatherine halfheartedly nods, but her mind is elsewhere,\n\tfocused on the two apparatuses.\n\n\t\t\t\tCATHERINE\n\t\tI want to try it.  Please.\n\n\tMiriam knows what this is about.\n\n\t\t\t\tMIRIAM\n\t\tWe've been over this a dozen times.  No.\n\n\t\t\t\tCATHERINE\n\t\tWhy not?  Just once.  A trial run.  What\n\t\tharm could it do?\n\n\t\t\t\tMIRIAM\n\t\tI don't want to find out.\n\n\tEver the doctor, Miriam finds herself surreptitiously\n\texamining Catherine's eyes, flesh tone, a slight trembling in\n\ther fingertips.\n\n\t\t\t\tCATHERINE\n\t\tWhy is it taking so long for us to reach\n\t\thim?  Because we've been reactive,\n\t\tthat's why.  And we need to be active.\n\n\tMiriam reaches for Catherine's wrist and takes her pulse.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\t\t(annoyed)\n\t\tMiriam...\n\n\t\t\t\tMIRIAM\n\t\tShush.\n\n\tAs Miriam examines her, Catherine continues:\n\n\t\t\t\tCATHERINE\n\t\tHe creates the obstacles, he decides\n\t\twhich games to play.\n\n\t\t\t\tMIRIAM\n\t\tI've heard this argument before.  It's\n\t\tnot happening.\n\n\t\t\t\tCATHERINE\n\t\t\t(frustrated)\n\t\tIt could take years for me to get past\n\t\tthe barriers he's created.\n\n\t\t\t\tMIRIAM\n\t\tIf we reverse the feed and bring Edward\n\t\tinto your mind, it could be devastating\n\t\tfor him.  Imagine the shock of suddenly\n\t\texisting in a whole other world.\n\n\t\t\t\tCATHERINE\n\t\tI do it all the time!\n\n\t\t\t\tMIRIAM\n\t\tYes, but, you're a willing participant. \n\t\tPicture Edward in a strange place, lost,\n\t\tfrightened...\n\n\t\t\t\tCATHERINE\n\t\tI'd be there for him.\n\n\t\t\t\tMIRIAM\n\t\tAnd he might blame you for terrifying\n\t\thim.  That one moment could erase all\n\t\tyou've accomplished.  And if that\n\t\thappened, the trust he has in you is\n\t\tgone.\n\n\t\t\t\tCATHERINE\n\t\t\t(defeated)\n\t\tOkay, okay...\n\n\tMiriam takes a penlight and examines Catherine's eyes.\n\n\t\t\t\tMIRIAM\n\t\tBesides, I don't know what it might do\n\t\tto you.  You're already exhausted.\n\t\t\t(concerned)\n\t\tHave you been sleeping?\n\n\tCatherine nods.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tI can prescribe something...\n\n\tCatherine shakes her head no.  Miriam shuts off the penlight\n\tand looks at Catherine with professional and personal\n\tconcern.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tYou're sure?  Any more nightmares?\n\n\t\t\t\tCATHERINE\n\t\t\t(defensively)\n\t\tNo.\n\n\t\t\t\tMIRIAM\n\t\tGood.  We need you healthy and relaxed. \n\t\tYou're going to eat well, meditate,\n\t\texercise, and watch mindless television.\n\n\t\t\t\tCATHERINE\n\t\tYes mother.\n\n\t\t\t\tMIRIAM\n\t\tI don't want you up all night reading\n\t\tEdward's case file of the nine millionth\n\t\ttime.  Balance, dear girl, is the key. \n\t\tLeave the work here.\n\n\tShe taps Catherine's head.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tDon't bring it home in this.\n\n\t\t\t\tCATHERINE\n\t\tOkay.\n\n\tMiriam gathers her belongings.\n\n\t\t\t\tMIRIAM\n\t\tHenry wants me to try this Vietnamese\n\t\tplace he's wild about.  Want to come?\n\n\t\t\t\tCATHERINE\n\t\t\t(declining)\n\t\tI've got to feed my cat.  Besides, I\n\t\twant to get to bed early.\n\n\t\t\t\tMIRIAM\n\t\tThat's my girl.\n\n\tMiriam exits, but Catherine remains, still curious what could\n\thappen if things were reversed.\n\n\tINT. CAMPBELL CENTER - HALLWAY - DAY\n\n\tThe corridors are dark and most everyone has gone home.  At\n\tthe NURSES STATION, a staff member observes the child on a\n\tclosed-circuit monitor.  Further down the hall, Miriam and\n\tHenry exit.  Wearing a (chic) thrift store coat and lugging a\n\tworn book bag, Catherine stands outside Edward's room,\n\twatching him sleep.\n\n\t\t\t\tCATHERINE\n\t\tPleasant dreams, Mister E.\n\n\tEXT. RURAL HIGHWAY - DAY\n\n\tA GREEN FORD PICK-UP TRUCK cruises down this deserted stretch\n\tof two-lane blacktop, the driver carefully maintaining the\n\tspeed limit.  He signals and exits...\n\n\tEXT. COUNTRY ROAD - DAY\n\n\tThe truck rumbles along a stretch of bumpy, unpaved road. \n\tThe area is desolate, depressing, and deserted.  It feels\n\tlike no one's been anywhere near here for years.  The pick-up\n\tstops at a RUSTED GATE and the DRIVER, a tall, lean, sinewy\n\tfellow undoes a combination lock-and-chain.  We do not yet\n\tsee his face.\n\n\tEXT. ABANDONED FARM HOUSE - DAY\n\n\tThe truck parks inside a charred barn, now hidden from view,\n\tand the driver steps out, followed by his DOG.\n\n\tA magnificent WHITE GERMAN SHEPHERD.  We notice a GLINT in\n\tits BLUE EYES - the animal's an albino.  The driver points\n\tand whistles.  Well-trained, the Shepard sprints to the gate\n\tand waits, keeping a watchful eye on the road.\n\n\tINT. THE CELL - OBSERVATION ROOM - DAY\n\n\tFrom the outside, a passerby would never know this sanctuary\n\texisted.  Within the foundation of a farm building never\n\tcompleted, we find a small room in the center of a much\n\tlarger space.  The cell.  We hear the WHIR of ELECTRONIC\n\tEQUIPMENT and notice VIDEO CAMERAS mounted on tripods pointed\n\tat the two-way glass.  We follow CABLES to a massive VIDEO\n\tRECORDER - the type used in surveillance, able to record for\n\tdays without maintenance, and an elaborate TIMING DEVICE\n\tconnected to a series of VALVES and SWITCHES.\n\n\tAs if in a beatific trance, the driver moves to the window\n\tand gently rests his palm on the glass.  ANNE MOVES!  Arms\n\tflailing, mouth gasping, eyes filled with dread.  The last\n\tspark of life... The driver JUMPS, startled and frightened.\n\n\tAlmost shamefully, he turns and hides, unable to look at her. \n\tSuddenly, his body tenses and writhes, as if seized by\n\ttorturous pain.  He opens his mouth in a silent scream.\n\n\tAnd then, quickly as it came, the pain subsides.  Hidden in\n\tshadow, he breathes deeply, regaining self-control.  He\n\twaits, then moves back to the glass.  Anne's dead face floats\n\tpast him.  Almost angelic.  He watches her and leans his head\n\tagainst the window, closer.  And the driver catches his own\n\treflection in the mirror.\n\n\tMeet CARL STARGHER.\n\n\tEXT. CATHERINE'S HOUSE - NIGHT\n\n\tSmall and isolated, the nearest neighbor a block away.\n\n\tINT. CATHERINE'S HOUSE - NIGHT\n\n\tThe place is a mess.  Computer print-outs, dirty dishes,\n\tunopened mail, videotapes, and notepads cover tables, chairs\n\tand floor.  On the crammed bookshelves, psychology texts sit\n\tnext to volumes on mythology, religion, and the occult. \n\tTotems, figurines and artifacts (Central and South American\n\tin origin) adorn the walls and tables.\n\n\tAs Portishead plays on the stereo, we find Catherine\n\tsuffering from insomnia, wearing goofy-yet-hip eyeglasses,\n\tsweatpants and a UCSD T-shirt, sharing a late-night snack\n\twith her pet CAT.  She shuts the refrigerator door and we\n\tlinger on an odd POSTCARD taped to the surface.  A kitschy\n\tpostcard of a warrior/goddess.\n\n\tINT. BASEMENT - NIGHT\n\n\tWe MOVE out of shadow, toward a bright focused light,\n\tfollowing the albino German Shepherd - VALENTINE - as it\n\tenters a VAST SUBTERRANEAN ROOM.  Most of the walls have been\n\tknocked down, leaving only thick support posts.  Valentine\n\tfinds Stargher in a DUGOUT PIT - about five feet deeper than\n\tthe rest of the room - polishing a stainless steel table.  A\n\tbright tungsten work light hangs above, and near it is the\n\tchain, cables and hooks of a customized MECHANICAL HOIST.\n\n\tThe dog picks up an unpleasant scent and follows it to a far\n\tcorner where there are empty jugs of BLEACH sitting next to a\n\tlong, deep cast iron TUB.  Stargher WHISTLES and Valentine\n\tobediently retreats to a KENNEL CAGE.  Stargher gives him a\n\tchew toy and locks the dog inside before moving to the tub.\n\n\tSoaking in the bleach is the nude corpse of Anne Vicksey. \n\tThe interior of the tub is glazed with gleaming porcelain and\n\tthe whiteness of her flesh makes it appear as though she is\n\tfloating in nothingness, but what hypnotizes and appalls are\n\ther eyes.  Wide open, transformed by the chlorine into\n\tsomething ghostly, they are unforgettable.\n\n\tAs the bleach gurgles down the drain, Stargher lifts Anne\n\tfrom the tub and carries her to the table.  He places her\n\tface up and dries her with a clean white towel.  He moves her\n\tlimbs, lips, hips, and hands into desired positions then\n\tretreats into shadow.  In the harsh light, against the shiny\n\ttable, the bleached body has the quality of an apparition and\n\twe almost expect her to move...\n\n\tWe HEAR Stargher remove his clothes and he steps into the\n\tpool of light.  Nude, we see that his lean, muscular frame is\n\tlaced with some rough tatoos.  When he turns his back to us,\n\twe find EIGHT METAL RINGS, thick and strong, PIERCED through\n\this flesh.  Two columns of four on either side of the spine,\n\trunning from shoulder blade to just below the waist.  What in\n\tGod's name are they for?\n\n\tStargher shuts off the work light and moves to an area where\n\the keeps TELEVISION MONITORS and VCRs.  He inserts a\n\tvideocassette taken from the surveillance deck and watches\n\tthe screen.\n\n\tIn BLACK AND WHITE, we see Anne awaken in the cell.  Her\n\tfirst moments inside.  Disoriented, terrified, trapped, she\n\texamines her surroundings.\n\n\tStargher is mesmerized by her fear.  Fast-forwarding to her\n\tdeath, he presses a remote and we get SOUND.  Anne screaming,\n\tbegging for her life.  Aroused, stimulated, Stargher drinks\n\tit in like a symphony.  Valentine cowers in the back of his\n\tcage, hating this.\n\n\tINT. CATHERINE'S HOUSE - BEDROOM - NIGHT\n\n\tLying on her bed (a waterbed), Catherine sleepily stares at\n\tthe ceiling, rolls onto her side, and feels herself drawn\n\tinto the comforter.  The folds of the fabric become ripples. \n\tRipples become dunes.\n\n\tEXT. EDWARD'S WORLD - DAY\n\n\tAnd we find ourselves in the DESERT of EDWARD'S WORLD.\n\n\tWe fly over dunes and come up behind Catherine as she\n\tstruggles through waves of sand.  The tree trunk is up ahead\n\tand we glimpse someone hiding inside.\n\n\tCatherine reaches.  MOCKEY-LOCK ERUPTS FROM WITHIN THE TREE\n\tTRUNK!  SNARLING!  Catherine retreats, silently screaming.\n\n\tINT. CATHERINE'S HOUSE - BEDROOM - DAWN\n\n\tIN HER OWN BED, Catherine's eyes are open.  In sharp contrast\n\tto a typical reaction to a nightmare, she remains calm.  No\n\tsweaty face, no gasp, no reaction at all, really.  She might\n\tas well have been dreaming of puppy dogs.  Wide awake, her\n\teyes return their gaze to the ceiling.\n\n\t\t\t\tCATHERINE\n\t\tGo.  To.  Sleep.\n\n\tINT. STARGHER HOUSE - BASEMENT - NIGHT\n\n\tCHAINS attached to bizarre HOOKS dangle from the ceiling. \n\tAdmiring Anne's body, Stargher links the hooks to the rings\n\tin his back.  He presses a remote unit and up in the rafters,\n\ta series of GEARS click into motion.  The sound is torturous\n\tas the mechanical hoist LIFTS Stargher off the ground,\n\tpulling at the rings, strips of flesh rising.  Stargher\n\tgrimaces, but clearly he wants the pain, needs it.  As the\n\thoist clicks into another gear, it carries Stargher over the\n\ttable until his body is perfectly positioned above Anne's.\n\n\tIn the flickering weird light of the television screen,\n\tStargher resembles something from the twisted imagination of\n\tWilliam Blake - a levitating demon ready to debauch an\n\tinnocent angel.  With his free hand, he touches himself,\n\tchains clinking and swaying.\n\n\tEXT. RIVER BANK - DAY\n\n\tA railroad bridge and highway span an almost-bone-dry creek\n\tbed.  Gathered beneath the overpass are the POLICE, CORONER,\n\tCRIMINIALISTS, AND A LOCAL FBI.  A SEDAN travels down a\n\tservice road and stops nearby.  TWO MEN exit, identify\n\tthemselves as FBI and move to the crime scene.\n\n\tSpecial Agent GORDON RAMSEY is well-groomed, prides himself\n\ton professionalism, and follows the Bureau party line. \n\tSpecial Agent PETER NOVAK is rough around the edges,\n\tintrospective, and intense.  A loner who marches to the tune\n\tof a peculiar drummer, he's unconventionally handsome with\n\tprobing eyes.  He moves slowly, observing the scene - the\n\tworld, for that matter - from a unique perspective.\n\n\tAs Ramsey finds the FBI's local liaison - AGENT COLE - Novak\n\toblivious to the people around him, touches dirt, smells the\n\tair, and examines road, river, bridge and sky.\n\n\t\t\t\tRAMSEY\n\t\tWho found her?\n\n\tCole nods at a visibly shaken WORKMAN seated in a patrol car.\n\n\t\t\t\tCOLE\n\t\tSurveyor for the railroad... 'Bout six\n\t\tthis morning.\n\n\tNovak sees a FEMALE BODY wrapped in plastic and bound by\n\twire.  Supervising the examination of the woman is FBI\n\tPATHOLOGIST DR. THEODORE \"TEDDY\" LEE, a polite, dapper\n\tsouthern gentleman.\n\n\t\t\t\tNOVAK\n\t\tThanks for waiting, Teddy.\n\n\tTeddy gives Novak a friendly, respectful salute - \"My\n\tpleasure.\"  Novak dons gloves, nods to an FBI PHOTOGRAPHER\n\tand assists Teddy Lee in snipping wire and peeling back thick\n\tclear plastic.  As the photographer reacts to a strong smell,\n\tTeddy comments.\n\n\t\t\t\tTEDDY LEE\n\t\tBleach.\n\n\tAs the man snaps pictures, Ramsey and Cole join them.  Sadly,\n\tNovak recognizes the face.\n\n\t\t\t\tNOVAK\n\t\tAnne Marie Vicksey.\n\n\tWe recognize her, too.\n\n\t\t\t\tCOLE\n\t\tShe the one from Santa Cruz?\n\n\t\t\t\tNOVAK\n\t\tJust graduated law school.  Single mom. \n\t\tHad a two-year-old daughter.\n\n\tHe and Teddy expose the bleached flesh of her torso, neither\n\tman surprised.  Coldly thorough, Novak finds another of the\n\tkiller's tell-tale signs.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\t\t(instructing the photographer)\n\t\tThe semen on her legs and abdomen.\n\n\tFLASH! Photos are taken.\n\n\t\t\t\tTEDDY LEE\n\t\tSomeone looking after her little girl?\n\n\t\t\t\tNOVAK\n\t\tGrandparents.  Live over in Davis.\n\n\tNovak looks into the dead white eyes of Anne Vicksey, trying\n\tto imagine the horrors she beheld.  He moves to the creek and\n\tsees only a few inches of water.  His eyes move from the drop\n\tsite to the highway above.\n\n\t\t\t\tTEDDY LEE\n\t\tThe poor thing.\n\n\tFLASH!  We're up there now, ON THE OVERPASS, with the\n\tphotographer and Novak, examining TIRE TRACKS in the soft\n\tshoulder.  Novak peers over the edge at the crime scene,\n\tsteps back, and focuses on the highway - imagining the\n\tkiller's truck as it disappeared into the night.\n\t\n\t\n\t\n\tEXT. OFFICE PLAZA - DAY\n\n\t A PRETTY YOUNG WOMAN, JULIA HICKSON, shares lunch with her\n\tfiancee, JOHN TRACY.  They talk, laugh and kiss, not a care\n\tin the world.\n\n\tINT. PICK-UP TRUCK - ACROSS THE STREET - DAY\n\n\tAs TALK RADIO plays, Carl Stargher watches them, specifically\n\tJulia, his eyes never off her for too long as his hands work\n\ton something banal but unseen.\n\n\t\t\t\tTALK RADIO HOST\n\t\t...complaining about government\n\t\tsubsidies for farmers...\n\n\tThe voice on the radio becomes DISTORTED as we hear it\n\tthrough Stargher's ears...\n\n\t\t\t\tTALK RADIO HOST (CONT'D)\n\t\t...but without subsidies, families will\n\t\tstarve, and I'm nodd\n\t\texagggeerrrrr....ayding.  Iff id werrrr\n\t\tup tooooo meeeee.....\n\n\tThe host's voice fades into a guttural, monstrous groan.\n\n\t\t\t\tTALK RADIO HOST (CONT'D)\n\t\tMeeeee gawwwwwdd Caaaarrrrlll.  Mee god\n\t\tcum...\n\t\t\t(returning to normal)\n\t\tMeeeee....wwuuuuuddunnnnttttt... be\n\t\tspending billions on other countries\n\t\twhen we've got problems right here.\n\n\tHe opens his eyes and watches John kiss Julia goodbye as she\n\treturns to work.  Stargher looks down and we see what he's\n\tbeen working on - A TOY DOLL.  Female.  Stripped of its\n\tclothes, a single metal ring stuck through its plastic neck.\n\n\tINT. COFFEE SHOP - DAY\n\n\tHis lunch finished, Ramsey is on a cell-phone talking to his\n\twife.  Chain-drinking coffee, Novak scrutinizes photos of the\n\ttire tracks.\n\n\t\t\t\tRAMSEY\n\t\tWell, honey, what's worse?  Doing it\n\t\tyourself or asking your mother for help?\n\t\t\t(gets his answer)\n\t\tCan it wait 'til I get back/\n\t\t\t(listens, answers)\n\t\tI have no idea, Jeannie.\n\n\tNovak checks his watch and the street.  Clearly waiting for\n\tsomeone or something.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tWell all right.  Good luck with the\n\t\tMonster.  I love you too.  Bye-bye.\n\n\tRamsey snaps shut the cell-phone.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tWe call Jeannie's mother \"The Monster\"\n\t\tbecause, well... she just is.\n\n\tNovak is oblivious, pouring over tire-related info.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tI know you could care less about my\n\t\tpersonal life, Peter, but I do\n\t\tappreciate the occasional, \"How's your\n\t\twife, Gordon?\"\n\n\tHe waits.  Novak obliges:\n\n\t\t\t\tNOVAK\n\t\tHow is she?\n\n\t\t\t\tRAMSEY\n\t\tPregnant.  Thanks for asking.\n\n\tNovak is distracted by Teddy Lee entering the diner.\n\n\t\t\t\tNOVAK\n\t\tHere he is.\n\n\t\t\t\tRAMSEY\n\t\tDamn, man, I give up.  Your partner\n\t\ttells you his wife's gonna have a baby,\n\t\tand all you care about is a coroner's\n\t\treport!\n\n\tRamsey assesses the exhausted, lonely, intense man sitting\n\tacross from him.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tI feel for those girls too, Pete.  And\n\t\ttheir families.  But it's just a job. \n\t\tSomeday it'll be over.  And then what'll\n\t\tyou have?\n\n\tMuch to Novak's appreciation, Teddy Lee's arrival provides an\n\tescape from answering the question.\n\n\t\t\t\tTEDDY LEE\n\t\tHot off the presses.\n\n\tHe gives them copies of the AUTOPSY REPORT and FORENSIC\n\tANALYSIS of Anne Marie Vicksey.  The WAITRESS sees Teddy,\n\tapproaches, and offers a menu.\n\n\t\t\t\tTEDDY LEE (CONT'D)\n\t\t\t(doesn't need it)\n\t\tChicken fried steak, mashed potatoes,\n\t\tgarden salad with Thousand Island\n\t\tdressing and an iced-tea.  Thank you\n\t\tdarlin'.\n\n\tShe nods and moves to the kitchen.  Novak and Ramsey flip\n\tthrough the documents.\n\n\t\t\t\tTEDDY LEE (CONT'D)\n\t\tWater in her lungs.  Same brand of\n\t\tbleach.  Match on the semen.  Lots of\n\t\thair.\n\n\t\t\t\tRAMSEY\n\t\t\t(unenthused)\n\t\tMore hair.  I could knit this guy a\n\t\ttoupee.\n\n\tNovak finds something in the report that catches him by\n\tsurprise.  He double-checks and shows the item to Teddy.\n\n\t\t\t\tTEDDY LEE\n\t\t\t(reading)\n\t\tSo?\n\n\t\t\t\tNOVAK\n\t\tAnne Vicksey didn't own a dog.\n\n\tRamsey checks his copy.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tI need it.\n\n\t\t\t\tTEDDY LEE\n\t\tNow?\n\n\t\t\t\tNOVAK\n\t\tNow.\n\n\tINT. FORENSIC LABORATORY - DAY\n\n\tA MONITOR shows a SINGLE HAIR under a video microscope. \n\tTeddy Lee plays with the dials and gets a spectral view.\n\n\t\t\t\tTEDDY LEE\n\t\tComplete absence of melanin.\n\n\tNovak and Ramsey stand over his shoulder.\n\n\t\t\t\tRAMSEY\n\t\tAnd that means?\n\n\tTeddy moves aside and takes another bite of his lunch\n\t(chicken fried steak now carry-out).\n\n\t\t\t\tNOVAK\n\t\tThe dog's an albino.\n\t\t\t(pictures it)\n\t\tHe'd love an animal like that.\n\n\t\t\t\tTEDDY LEE\n\t\tGentlemen, I believe an albino dog is\n\t\trare indeed.\n\n\tINT. PARKING GARAGE - NIGHT\n\n\tExiting an elevator, Julia heads for her little Toyota. \n\tSmart girl that she is, her eyes scan the area and her\n\tfingers hold a can of mace.\n\n\tINT. TOYOTA - NIGHT\n\n\tJulia climbs in, checks her mirror and backs up.  WHAM!  Did\n\tshe hit something??  She brakes, puts the car in park, and\n\tchecks her sideview mirror.\n\n\tReflected there is a WOUNDED DOG.  A white German Shepherd. \n\tShe rolls down her window and can hear the poor thing\n\twhimpering.\n\n\t\t\t\tJULIA\n\t\tOh no...\n\n\tINT. PARKING GARAGE - NIGHT\n\n\tJulia exits her car and kneels next to Valentine, who appears\n\tto be in terrible pain.\n\n\t\t\t\tJULIA\n\t\tGod... I didn't see you.\n\n\tSTARGHER'S HANDS COME AT HER FROM BEHIND!  One grabs her hair\n\tand the other covers her face with a chloroform-soaked towel. \n\tHe presses so hard, she cannot scream, cannot move.  After a\n\tbrief struggle, he SHOVES her into her car and holds her\n\tuntil she passes out.  Stargher pushes Julia into the\n\tpassenger seat and starts the car.  Pulls a dog treat from\n\this pocket and WHISTLES.  The Shepherd instantly perks up. \n\tPerfectly healthy.  And jumps into the car.\n\n\t\t\t\tSTARGHER\n\t\t\t(feeds him a treat)\n\t\tGood boy.\n\n\tINT. RIVERSIDE COUNTY SHERIFF'S STATION - DAY\n\n\tIn a BRIEFING ROOM we find Teddy Lee, Ramsey, Cole and local\n\tcops.  All in need of caffeine.  They complain, gossip, and\n\tshoot the shit.  Resembling a demanding professor, Novak\n\tenters and through presence alone, lacking any self\n\tconsciousness about his dishevelled appearance, takes control\n\tof the room by holding up a PHOTOGRAPH of a young woman.\n\n\t\t\t\tNOVAK\n\t\tDonna Krozin.\n\t\t\t(a new picture every time)\n\t\tHelen Francis, Teresa Manicki...\n\n\tThe chatter dies.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tAntoinette Simms, Natalie Pagels, Grace\n\t\tCassatt... Anne Vicksey.\n\n\tEvery person is solemn and focused.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tSmart, gentle, attractive young women. \n\t\tJust starting out in life. \n\t\tEmbarking on careers, going to school,\n\t\tgetting married...\n\n\tHe's hooked them.  The victims, these women, now mean\n\tsomething to them.  With great effect, he holds up grisly\n\tpost-mortem photos.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tThey were killed.  Kidnapped, tortured,\n\t\tand murdered.  By a white male.  About\n\t\t30-years old.\n\t\t\t(significantly)\n\t\tWho owns an albino dog./\n\n\tEveryone knows this is a real clue and awareness is\n\theightened.  Ramsey chimes in.\n\n\t\t\t\tRAMSEY\n\t\tA purebred German Shepherd.\n\n\tNovak shows them a picture of a WHITE GERMAN SHEPHERD taken\n\tfrom a resource on the Internet.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tBreeders typically destroy albino pups,\n\t\tso this animal is truly unique.\n\n\t\t\t\tNOVAK\n\t\tNicole Labetzki.  Victim seven. \n\t\tForensics found dog hair in her car, but\n\t\tthey had a K-9 unit at the scene and\n\t\tnever had it checked.\n\n\t\t\t\tTEDDY LEE\n\t\tThe Phoenix office tested that hair\n\t\tthirty minutes ago.  And we got the\n\t\tmatch.\n\n\t\t\t\tNOVAK\n\t\tIt's his dog.\n\n\tRamsey holds up a thick list.\n\n\t\t\t\tRAMSEY\n\t\tRegistered breeders of German Shepherds.\n\n\tThe list is long and a few of the cops GROAN.  Novak silences\n\tthem with a fierce look that says, \"I will not rest until\n\tthis man is found and neither should you.\"\n\n\t\t\t\tNOVAK\n\t\tBe thorough, but be fast.  This guy's\n\t\taccelerating. \n\t\tHe only waited six days this last time. \n\t\tWhen he started, two months could pass.\n\n\tA DESK SEARGENT enters the room and hands a FAX to Ramsey. \n\tNovak is curious about it, but continues.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tThis can mean different things.  He\n\t\tthinks we're stupid and can't catch him. \n\t\tHe's having fun and needs more.  Or...\n\t\t\t(thinking it through)\n\t\tThis dog hair thing is sloppy.  The body\n\t\tthis morning was found in less than\n\t\tthree inches of water.  He knew we'd\n\t\tfind her.  He wants to be caught.  But\n\t\tif we can't stop him...\n\n\tGravely concerned, Ramsey moves across the room.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\t\t(dreading what's on that fax)\n\t\t...he can't stop himself.\n\n\tINT. STARGHER HOUSE - BATHROOM - DAY\n\n\tStargher, the awful PAIN eating away at his skull.  He\n\tsearches the medicine chest.\n\n\t\t\t\tDISTORTED VOICE\n\t\tMe god feed on pain.\n\n\tThe VOICE echoing inside his skull.\n\n\t\t\t\tDISTORTED VOICE (CONT'D)\n\t\tPain good.  Cumm home to meee...\n\n\tINT. STARGHER HOUSE - KITCHEN - DAY\n\n\tStruggling to stay on his feet, he moves to the KITCHEN. \n\tValentine paces nervously, whimpering concern.  Stargher\n\treaches for a bottle of vodka but falls to the floor. \n\tValentine BARKS, but gets no reaction from master.  We MOVE\n\tIN on Stargher's unblinking eyes.\n\n\t\t\t\tDISTORTED VOICE\n\t\tGo sleep Carl.  Me god wake up now.\n\n\tINT. THE CELL - DAY\n\n\tJulia Hickson finds the snack foods, drinking spigot, toilet,\n\tshower, and drain.  Her bare feet try to adjust to the tile\n\tfloor, but it's fucking cold.  She glimpses herself in the\n\tmirror and is startled by what she sees - a terrified girl.\n\n\tINT. SUBURBAN HOUSE - DAY\n\n\tA TAN SEDAN sits in the driveway of this modest middle-class\n\thome.  A VENTURA COUNTY SHERIFF'S CAR sits nearby, a deputy\n\tkeeping watch.\n\n\tINT. SUBURBAN HOUSE - DAY\n\n\tA distraught middle-aged couple, MR. AND MRS. HICKSON, sit on\n\tthe couch of their living room.  FAMILY PHOTOS show them with\n\tJulia, whose fiancee, John, does his best to comfort the\n\tmother.  Novak and Ramsey have the unfortunate task of\n\tinterviewing them about their daughter's disappearance.\n\n\t\t\t\tRAMSEY\n\t\tShe was still living at home?\n\n\t\t\t\tMR. HICKSON\n\t\tYes, sir.\n\n\t\t\t\tJOHN\n\t\tWe were looking at apartments.\n\n\t\t\t\tMR. HICKSON\n\t\t\t(important they know)\n\t\tBut nobody was moving in together 'til\n\t\tafter the wedding.\n\n\tNovak hasn't said much.  Instead, he looks at something in\n\this hands - a plastic evidence bag containing the TOY DOLL.\n\n\t\t\t\tRAMSEY\n\t\tJohn, you came to pick her up when?\n\n\t\t\t\tJOHN\n\t\tEight o'clock.  We were going out for my\n\t\tbirthday.\n\n\t\t\t\tMR. HICKSON\n\t\tMaybe you made a mistake.  Maybe she...\n\t\tshe...\n\n\tNovak hides the doll.\n\n\t\t\t\tRAMSEY\n\t\tNo sir.  I'm sorry.\n\n\tRamsey's cell-phone rings and he excuses himself to a corner\n\tof the room, leaving Novak alone to deal with this\n\tuncomfortable, sad situation, no one saying a word until an\n\temotionally shattered Mrs. Hickson, fingering a rosary, feels\n\tcompelled to tell him.\n\n\t\t\t\tNOVAK\n\t\tAfter three years she remembers what the\n\t\tguy drove?\n\n\t\t\t\tRAMSEY\n\t\tShe remembers because it was her \"dream\n\t\ttruck.\"  Wanted one just like it.\n\n\tEXT. SMALL AIRPORT - DAY\n\n\tRamsey and Novak exit a small jet and are met by FBI Agent\n\tSTOCKWELL.\n\n\t\t\t\tSTOCKWELL\n\t\tRamsey, Novak?\n\n\tThey nod and he directs them to a waiting GMC SUBURBAN.\n\n\t\t\t\tSTOCKWELL (CONT'D)\n\t\tAgent Stockwell.\n\n\t\t\t\tNOVAK\n\t\tWhere is he?\n\n\t\t\t\tSTOCKWELL\n\t\tEdison.  Just east of Loma Park.  SWAT's\n\t\thad the house under surveillance for\n\t\tabout twenty minutes.\n\t\t\t(info memorized)\n\t\tSuspect is Carl Rudolph Stargher.  No\n\t\tregistered weapons, no priors.  Got a\n\t\tlicense for his dog, though.  Named him\n\t\tValentine...\n\n\tINT. GMC SUBURBAN - DAY\n\n\tStockwell is behind the wheel, racing down the highway. \n\tRamsey's in the passenger seat, Novak in back.  Shotguns and\n\tbody armor line the cargo area.  Novak's eyes target the FAX,\n\ta copy of Stargher's license and registration, and the grainy\n\tdot-matrix image of the suspect's face.  And Novak knows he's\n\tfound him.\n\n\t\t\t\tNOVAK\n\t\tYou're the bad man, aren't you, Carl?\n\n\tEXT. STARGHER HOUSE/NEIGHBORHOOD - DAY\n\n\tA sparsely populated lower-middle class neighborhood.  A half\n\tdozen plain houses at the end of a cul-de-sac.  Bare trees. \n\tBrown lawns.  Crows in the air.\n\n\tThe house furthest from the main road has a white Ford F250\n\tpick-up in the driveway.  Green trim.\n\n\tTHE SUBURBAN, hidden from Stargher's house, four-wheels it\n\tthrough a prairie and stops outside the backyard of a\n\tPRESCHOOL, where two more Suburbans and a van already wait.\n\n\tINT. PRESCHOOL - DAY\n\n\tStockwell introduces Ramsey and Novak to BROCK, leader of the\n\tFBI Tactical Unit, a calm, confident ex-Marine wearing a\n\tblack uniform and body armor.\n\n\t\t\t\tBROCK\n\t\tGlad you could make it.  We lose the sun\n\t\tin half an hour.\n\n\tNovak and Ramsey join him at the shaded window to observe\n\tStargher's house.  Children's drawings fill the wall.  As\n\tBrock explains, Novak checks with binoculars.\n\n\t\t\t\tBROCK (CONT'D)\n\t\tPerimeter's two-hundred yards around the\n\t\thouse.  Three men at the rear, two on\n\t\teach side, four up front.  I've got two\n\t\tmarksmen on the roof.\n\n\t\t\t\tNOVAK\n\t\tHave they seen him?\n\n\t\t\t\tBROCK\n\t\tNo.  There's been movement in the\n\t\tkitchen.  But it could be the dog.\n\t\t\t(important)\n\t\tYou think she's in there?\n\n\tNovak is careful with his answer.\n\n\t\t\t\tNOVAK\n\t\tWe proceed assuming she is.\n\n\t\t\t\tRAMSEY\n\t\tLet's give old Carl a call.  Tell him\n\t\the's got company.\n\n\t\t\t\tNOVAK\n\t\tNo.\n\t\t\t(to Brock)\n\t\tCan you get a man close?\n\n\tEXT. STARGHER HOUSE - DAY\n\n\tQuiet.  Calm.  And then we catch a glimpse of a FIGURE\n\tadvancing, using any cover he can, until he is right outside\n\tthe house.  The sneaky SWAT team member, ERICSON, whispers\n\tinto his throat mic.\n\n\t\t\t\tERICSON\n\t\tI'm at the back door.\n\n\t\t\t\tBROCK (V.O.)\n\t\t\t(in Ericson's earpiece)\n\t\tCheck the kitchen.\n\n\tEricson maneuvers his way to the kitchen window and uses a\n\tMIRROR to sneak a peek.  In the REFLECTION we see a\n\tmotionless man lying on the floor.\n\n\t\t\t\tERICSON\n\t\tI have a man down.  Repeat, man down.\n\n\t\t\t\tBROCK (V.O.)\n\t\tStargher?\n\n\tEricson chances a quick visual check and pops his head up\n\tbefore reporting.\n\n\t\t\t\tERICSON\n\t\tCan't see his face.\n\n\tINT. PRESCHOOL - DAY\n\n\tBrock looks to Novak, urgency and tension mounting.  Novak\n\tknows how much is riding on this specific moment.  All the\n\tvarious outcomes.  And decides.\n\n\t\t\t\tNOVAK\n\t\tGo.\n\n\tEXT. STARGHER HOUSE - DAY\n\n\tThe SWAT TEAM SWARMS towards the house.\n\n\tINT. STARGHER HOUSE - DAY\n\n\tERICSON KICKS IN THE BACK DOOR.  GUN READY!\n\n\t\t\t\tERICSON\n\t\tFBI!\n\n\tHe and THREE OTHERS rush inside!\n\n\tBAM!  FOUR MEN KICK in and proceed through the FRONT DOOR!\n\n\t\t\t\tSWAT TEAM MEMBER\n\t\tFBI!\n\n\tAn odd quiet is all they encounter.  IN THE BACK, Ericson\n\tmoves through a LAUNDRY ROOM and finds VALENTINE hiding\n\tbehind a pile of dirty clothes, frightened by these masked\n\tfigures in black.\n\n\t\t\t\tERICSON\n\t\t\t(into throat mic)\n\t\tI've got the dog!\n\n\tHe points for someone to secure the animal and MOVES into the\n\tKITCHEN, aiming his gun at the man on the floor, finally\n\tgetting a look at his face.\n\n\t\t\t\tERICSON (CONT'D)\n\t\t\t(recognizing him)\n\t\tCarl Stargher!  Do not move!\n\n\tNo problem there.  Stargher appears lifeless.  As various\n\tSWAT team members secure the house, Ericson removes his mask\n\tand CUFFS Stargher, startled at the sight of the horrible\n\tRINGS piercing his back.\n\n\t\t\t\tERICSON (CONT'D)\n\t\tJesus Christ...\n\n\tEXT. PRESCHOOL/STARGHER'S HOUSE - DAY\n\n\tAs an AMBULANCE emerges from a hiding place behind another\n\tgarage, we FOLLOW NOVAK and RAMSEY as they run from the\n\tpreschool into the house.\n\n\tINT. STARGHER HOUSE\n\n\tAs a K-9 UNIT secures Valentine, Novak storms into the\n\tkitchen, checks Stargher for a pulse and barks at SWAT>\n\n\t\t\t\tNOVAK\n\t\tParamedics.  NOW.\n\n\tRamsey pushes through and Novak informs him.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tHe's alive.\n\n\tEXT. STARGHER HOUSE - DAY\n\n\tFBI AGENTS and local police cordon off the area.\n\n\tINT. STARGHER HOUSE - KITCHEN - DAY\n\n\tValentine is muzzled and led away as the PARAMEDICS load\n\tStargher onto a stretcher.  Agent Stockwell turns to a\n\tworried Novak.\n\n\t\t\t\tSTOCKWELL\n\t\tThey'll take him to County General. \n\t\tReid's already there.\n\n\t\t\t\tNOVAK\n\t\tMake sure he stays cuffed.  Two men on\n\t\thim at all times.  I don't want anyone\n\t\ttreating him but Reid.  Not so much as a\n\t\tthermometer up his ass.  Understand?\n\n\tStockwell nods and follows the stretcher outside.  A stoic\n\tRamsey enters from the living room and Novak can see the\n\tdisappointment in his eyes.\n\n\t\t\t\tRAMSEY\n\t\tShe's not here.\n\n\tNovak would give anything for that not to be true.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\t\t(it gets worse)\n\t\tYou should come downstairs.\n\n\tINT. STARGHER HOUSE - BASEMENT - DAY\n\n\tRamsey leads Novak into Stargher's \"workroom.\"  It's all\n\there, the table, the piercing supplies, the bleach.  An odd,\n\tgrisly collection of DOLLS fills cubby holes in a wooden\n\tstorage/shelf unit.  Novak's eyes are like a camera,\n\tdocumenting and storing as much information as possible, but\n\tit's overwhelming.\n\n\tHe moves through the basement.  Careful not to touch\n\tanything.  He stops and focuses on the hoist and eight hooks\n\tsituated over the stainless steel table.  (NOTE: ON THE\n\tWINCH'S MOTOR IS A WORN PLAQUE READING \"CARVER INDUSTRIAL\n\tEQUIPMENT\" with a logo).\n\n\tRamsey switches on the video monitor and the screen fills\n\twith images of Anne dying in the cell.\n\n\tNovak is painfully, tragically drawn to this.  Although he's\n\tseen his share of horrific things, Novak is truly disturbed\n\tby the sight of Anne, desperate to escape, drowning, slowly\n\tdying, and he knows: This is what will happen to Julia\n\tHickson unless he finds her.\n\n\tINT. THE CELL - NIGHT\n\n\tCLICK.  WATER SPRAYS FROM THE SHOWER.  Caught by surprise,\n\tJulia blocks the spray with her hands and searches for a shut\n\toff valve.  Of course, there is none.  Thirty seconds later,\n\tthe water stops.  Like an animal caught in a trap, Julia's\n\teyes dart around her \"cage.\"  What kind of hell is this? \n\tShivering, she catches herself in the mirror and looks deeply\n\tinto it.  Something's odd about the glass.  Is someone\n\twatching her?  She bangs on it with her fist.\n\n\t\t\t\tJULIA\n\t\tHey!\n\n\tPOUND, POUND, POUND!\n\n\t\t\t\tJULIA (CONT'D)\n\t\tLET ME OUT!!!\n\n\tBut there's no response.  Only her reflection.\n\n\tINT. KERN COUNTY HOSPITAL - EXAMINATION ROOM - NIGHT\n\n\tA HUMAN EYE.  No movement, no deviation of the iris.  A fixed\n\tstare.  The catatonic Stargher lies in a hospital bed, wrists\n\tcuffed to the frame.  An IV feeds him fluids and monitors\n\treport his vital signs.  As a nervous NURSE exits, we see TWO\n\tPOLICEMEN standing guard in the outer hallway.  Novak, Ramsey\n\tand Teddy Lee stand by as the killer is examined by DR.\n\tMILTON REID, a brilliant forensic M.D. currently shining an\n\topthalmoscope into Stargher's eyes.  He pulls away and checks\n\tthe ELECTROENCENPHELOGRAM already on a lightbox.\n\n\t\t\t\tREID\n\t\tMinimal activity in the dorsolateral\n\t\tprefrontal cortex.  And here, the\n\t\tanterior cingulate cortex.\n\t\t\t(to Novak and Ramsey)\n\t\tIt's what helps distinguish between\n\t\texternal and internal stimuli.\n\n\t\t\t\tRAMSEY\n\t\tWhat the hell does that mean?\n\n\t\t\t\tTEDDY LEE\n\t\t\t(answering for Reid)\n\t\tHe's schizophrenic.\n\n\tNovak doesn't like this.  Not one bit.\n\n\t\t\t\tRAMSEY\n\t\tWhat're you doing here, Reid?  Paving\n\t\tthe way for his insanity defense?\n\n\t\t\t\tREID\n\t\tNo need.  There won't be a trial.  This\n\t\tis no act.  The coma is real.\n\n\t\t\t\tRAMSEY\n\t\tWhoa.  Wait a minute.\n\n\t\t\t\tREID\n\t\tYou ever hear of Whalen's Infraction?\n\n\tClearly not.\n\n\t\t\t\tREID (CONT'D)\n\t\t\t(re: the EEG)\n\t\tIn any schizophrenic, these areas would\n\t\tbe affected.  But in someone with\n\t\tWhalen's, they're hit hard and hit fast.\n\n\tNovak's worry intensifies.\n\n\t\t\t\tREID (CONT'D)\n\t\tStargher's neurological system was\n\t\tinfected by a virus in utero.  It lay\n\t\tdormant.  In his case for about...\n\t\t\t(guesses at Stargher's age)\n\t\t...thirty years.  Most likely, he's\n\t\texhibited symptoms for awhile now, but\n\t\tthe infraction - the breach - didn't\n\t\toccur 'til today.  You never know when\n\t\tit'll happen, at what age, or why.  The\n\t\ttriggers vary, but the results don't.\n\t\t\t(fascinated by Stargher)\n\t\tHe has no ties to reality.  No awareness\n\t\tof this world or the people in it.\n\n\t\t\t\tTEDDY LEE\n\t\tWhat about Thorazine? Or... Desoxyn?\n\n\t\t\t\tREID\n\t\tThe normal psychotropics don't work. \n\t\tHe's not just catatonic, he's...\n\t\tdisappeared.  Like having a dream and\n\t\tnever waking up.\n\n\t\t\t\tNOVAK\n\t\tThis girl.  Julia Hickson.  Only he\n\t\tknows where she is.\n\n\t\t\t\tREID\n\t\tThen I'm sorry.  For her and for you.\n\n\tNovak is past angry.  He's bordering on devastation.  Ramsey\n\tattempts to placate him.\n\n\t\t\t\tRAMSEY\n\t\tWe'll go back to his house, Pete. \n\t\tThere's still a lot to do.  Analyze the\n\t\tvideos, track sales of the bleach, go\n\t\tthrough his records.  Maybe he owns\n\t\tproperty somewhere.\n\n\t\t\t\tNOVAK\n\t\tThey're in that fucking thing for forty\n\t\thours, Gordon.  Four-oh.  He got Julia\n\t\tat seven-thirty last night.  You know\n\t\twhat time it is now...?!\n\n\tRamsey backs off, knowing his partner is on the verge of\n\treally losing it.  Reid thinks perhaps he shouldn't, but\n\tsensitive to Novak's pain and anger, mentions it anyway - if\n\tonly to keep his friend from true hopelessness.\n\n\t\t\t\tREID\n\t\tPeter?  This is a longshot.  I mean a\n\t\treal long shot.  You're gonna think I'm\n\t\tcrazy...\n\n\tEXT. EDWARD'S WORLD - DAY\n\n\tThe ship's engine ROARS TO LIFE and the PROPELLER spins\n\tthrough sand.\n\n\t\t\t\tCATHERINE (O.S.)\n\t\tIt's fixed!\n\n\tAT THE TREE TRUNK, Catherine extends her hand and suddenly\n\tEdward is there, quite close, reaching out.  Catherine's hand\n\ttrembles.  The boy is startled.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\t\t(surprised, to herself)\n\t\tI'm not signalling...\n\n\tHer hand tenses and shakes uncontrollably.\n\n\t\t\t\tVOICE (O.S.)\n\t\tSing a song of sixpence...\n\n\t\t\t\tCATHERINE\n\t\t\t(angry, to the heavens)\n\t\tI'm not signalling!\n\n\tEdward is frightened by what's happening and runs away. \n\tCatherine tries to call out, but her throat constricts,\n\tmaking speech difficult.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tI'm not...\n\t\t\t\n\t\t\t\n\t\t\t\n\t\t\tINT. CAMPBELL CENTER - LABORATORY - DAY\n\n\tCatherine's face is covered by a cloth floating down from the\n\tsky.  The sky is replaced by the ceiling and overhead lights\n\tof the LABORATORY, but Miriam's face remains constant.  Now\n\tconscious, Catherine finds herself in the lab at the Campbell\n\tCenter, the suspension device lowering.\n\n\t\t\t\tMIRIAM\n\t\t\t(on intercom)\n\t\tSing a song of sixpence.\n\n\t\t\t\tCATHERINE\n\t\t\t(hoarse)\n\t\tA pocketful of fucking rye.\n\t\t\t(worried)\n\t\tWhat's wrong?\n\n\t\t\t\tMIRIAM\n\t\t\t(cagey)\n\t\tNothing.\n\n\t\t\t\tCATHERINE\n\t\t\t(disappointed)\n\t\tWhy did we stop?\n\n\tCooperman appears in the window and explains.\n\n\t\t\t\tCOOPERMAN\n\t\t\t(on intercom)\n\t\tI asked them to.\n\t\t\t(with gravity)\n\t\tWe have a situation.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM - DAY\n\n\tA SMALL TV SCREEN shows footage of Anne drowning in the cell. \n\tCatherine, Cooperman, Henry, and Miriam watch with curiosity,\n\tdisgust, pity.  Novak and Ramsey flank the portable\n\tmonitor/VCR, knowing this is a disturbing but powerful tool. \n\tThere's someone else in the room.  John Tracy.  He cannot\n\twatch the video, not again.  Catherine glances at him,\n\tuncomfortable with his presence.\n\n\t\t\t\tMIRIAM\n\t\tWhen did he lapse into the coma?\n\n\t\t\t\tNOVAK\n\t\tSometime yesterday morning.\n\n\tJohn tries to keep his composure, but Novak's making this\n\ttough for him.  Novak wants the scientists to see, to\n\tunderstand the boy's pain.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tEach tape is the same.  He provides\n\t\tfood, drinking water, a toilet. \n\t\tPeriodically, a shower starts.  It's on\n\t\tsome kind of timer - he's clever with\n\t\tmachines, building things.  I think he\n\t\twants them to believe this is a simple\n\t\tkidnapping.  That there's a possibility\n\t\tof rescue.  Of survival.  But it's just\n\t\ta form of torture.  At the end of the\n\t\tfortieth hour, the drain shuts.  The\n\t\twater starts and doesn't stop.\n\t\t\t(gravely)\n\t\tWe've already lost more than a day.  If\n\t\tshe isn't found tonight.  She dies like\n\t\tthe rest.\n\n\t\t\t\tCOOPERMAN\n\t\t\t(to Miriam, Henry and\n\t\t\tCatherine)\n\t\tJohn and Ella Baines - as well as the\n\t\tSunerset Board of Directors - have given\n\t\ttheir approval, but the decision is\n\t\tyours.\n\n\t\t\t\tMIRIAM\n\t\tWhat about the legalities of this...?\n\n\t\t\t\tNOVAK\n\t\tStargher is in custody.  The functional\n\t\tequivalent of being under arrest. \n\t\tNormally, we'd Mirandize him, and if he\n\t\tdidn't lawyer up, we'd interrogate him. \n\t\tBut because of his condition, he doesn't\n\t\thave the capacity to waive those rights.\n\n\t\t\t\tHENRY\n\t\tSo what you're asking us to do is\n\t\tillegal?\n\n\t\t\t\tNOVAK\n\t\tNo, not at all.\n\t\t\t(explains)\n\t\tWe're dealing with exigent\n\t\tcircumstances.  Somewhere there's a\n\t\tkidnapped woman still alive.  If we\n\t\tweigh the suspect's Constitutional\n\t\tRights against the public safety. \n\t\tThe Law favors the victim and gives us a\n\t\tlot of leeway.  It's called the Public\n\t\tSafety Exception.\n\n\t\t\t\tCOOPERMAN\n\t\tSo what can you do?\n\n\t\t\t\tNOVAK\n\t\tPretty much anything we want.  There's a\n\t\tchance to save a human life.  Because of\n\t\tthat, Stargher has no reasonable\n\t\texpectation of privacy.\n\n\tMiriam, Henry and Cooperman appear to be onboard.  Novak's\n\tmade a persuasive, heartfelt argument.  Only one person still\n\tremains uncertain.\n\n\t\t\t\tCATHERINE\n\t\tWhat if...?\n\n\tAll eyes turn to her.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat if he wasn't like this?  What if he\n\t\twas \"normal?\"  Conscious.  How far would\n\t\tyou go?\n\n\t\t\t\tNOVAK\n\t\tAs far as I needed.\n\n\tCatherine nods, analyzes Novak's eyes, gestures, body\n\tlanguage, and \"interrogates\" him.\n\n\t\t\t\tCATHERINE\n\t\tDo you think he'd tell you what you need\n\t\tto know?\n\n\tJohn's discomfort is increasing and Novak is sensitive to it.\n\n\t\t\t\tNOVAK\n\t\tThere's always a chance they'll confess.\n\n\t\t\t\tCATHERINE\n\t\tReally?  I don't work with violent\n\t\tcases, I work with children.  But even a\n\t\tkid lies.  They love it when they get\n\t\tyou to believe something that isn't\n\t\ttrue.  Don't you think Stargher would do\n\t\tthe same?\n\n\t\t\t\tNOVAK\n\t\tSometimes... Once they've been caught\n\t\tthey feel a need for disclosure.  They\n\t\thave so much they want to tell. \n\t\tBut they've never had a sympathetic ear. \n\t\tThey need someone to understand why.\n\t\t\t(focusing on Catherine)\n\t\tStargher used to hide the bodies very\n\t\tcarefully.  It was part of the ritual. \n\t\tSome weren't found for weeks and any\n\t\tphysical evidence had been meticulously\n\t\twiped clean.  But these last three...\n\t\tThey were still in water - always in\n\t\twater - but\n\t\t\t(clarifies)\n\t\tListen, he wasn't just careless.  It\n\t\twent beyond that...\n\n\t\t\t\tCATHERINE\n\t\tOkay.  Let's assume he wanted you to\n\t\tfind him, that some part of him hated\n\t\twhat he was doing... Most likely, that\n\t\tpart is dead.  Schizophrenics with\n\t\tWhalen's Infraction sever all ties with\n\t\tthe real world.  I'm sorry, I really am.\n\n\t\t\t\tRAMSEY\n\t\tIs it possible?\n\n\t\t\t\tCATHERINE\n\t\tIf he came to trust me, yes, but it\n\t\ttakes months to build that kind of\n\t\ttrust.  Someone like Stargher can't\n\t\tdistinguish between fantasy and reality. \n\t\tIt's all the same.  He might tell me\n\t\tshe's in Timbuktu and absolutely, one\n\t\thundred percent believe it to be true,\n\t\tbut she's...\n\n\t\t\t\tJOHN (O.S.)\n\t\tJulia.\n\n\tThey turn to John Tracy.  His vulnerable, barely audible\n\tvoice forcing everyone to listen.\n\n\t\t\t\tJOHN (CONT'D)\n\t\tNot \"she.\"  Julia.  Not thing, or it, or\n\t\ther.  Do you know anything about her? \n\t\tDo you know what we've been through? \n\t\tJulia is everything to me.  Can you say\n\t\tthat about anyone?  \n\n\tCatherine hangs her head.  And finds herself looking at\n\tphotograph of the girl in question.  A smiling Julia Hickson\n\tlooking right at her.\n\n\tWHOOP-WHOOP-WHOOP-WHOOP.  POUNDING REVERBERATIONS...\n\n\tEXT. CAMPBELL CENTER - DAY\n\n\tWHOOP-WHOOP-WHOOP-WHOOP.  A HELICOPTER descends onto the pad. \n\tA stretcher is removed from the side door of the helicopter.\n\n\tINT. CAMPBELL CENTER - VARIOUS/TRAVELLING - DAY\n\n\tThe STAFF watches with a mixture of fear and curiosity as a\n\tstretcher bearing the catatonic Stargher is wheeled FAST\n\tthrough the corridors by an FBI escort team.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM - DAY\n\n\tHundreds of photographs, drawings, diagrams, maps,\n\tblueprints, and documents - Novak's case material - cover\n\tevery inch of wallspace.  The table is littered with\n\treference books, atlases, telephones, a fax machine, short\n\twave radio, and computer/Internet terminal.  An FBI\n\tTECHNICIAN completes the electronics work and points out the\n\t\"speed dial\" functions to Novak and Ramsey.\n\n\t\t\t\tFBI TECH\n\t\t\t(listing them)\n\t\tQuantico.  San Diego Field Office. \n\t\tS.D., L.A., and San Francisco P.D. \n\t\tCalifornia, Arizona, Nevada State\n\t\tPolice.  Nine and ten are open lines.\n\t\t\t(re: radio set up)\n\t\tDirect link to the chopper.\n\t\t\t(re: the computer)\n\t\tThat gets you into the Bureau Database.\n\n\t\t\t\tNOVAK\n\t\tThanks.\n\n\tOnce he's gone, Ramsey takes this moment \"alone\" to question\n\this partner.\n\n\t\t\t\tRAMSEY\n\t\tYou sure you want to go through with\n\t\tthis?\n\n\t\t\t\tNOVAK\n\t\tWhat else do we do?!\n\n\t\t\t\tRAMSEY\n\t\tI don't know, Pete, but for god's\n\t\tsake... This is nuts.  Do you really\n\t\tunderstand what they're going to do?\n\n\t\t\t\tNOVAK\n\t\tI don't have to.\n\n\t\t\t\tRAMSEY\n\t\tWhy jeopardize what we've already done? \n\t\tWe caught the sonofabitch.  Carl\n\t\tStargher.  That's going to be like\n\t\tBundy, Gacy, Dahmer.  A case that makes\n\t\tcareers.  But if we push our luck.  If\n\t\tthis is all bullshit and we come out\n\t\tsmelling like it.\n\n\t\t\t\tNOVAK\n\t\tTell you what.  If this thing burns us,\n\t\tI take that heat.  I give you permission\n\t\tto point your finger at me and say \"It\n\t\twas all his idea.\"\n\n\t\t\t\tRAMSEY\n\t\t\t(offended)\n\t\tThat's not what I'm talking about, Pete. \n\t\tI'm talking about waking up and\n\t\trealizing this girl's gonna die.\n\n\tThe words are anathema to Novak.\n\n\t\t\t\tNOVAK\n\t\tThat won't happen.\n\n\tCooperman appears in the doorway and informs them...\n\n\t\t\t\tCOOPERMAN\n\t\tThey're ready.\n\n\tRamsey looks to his partner, but Novak is already on\n\tCooperman's heels.  Resignedly, Ramsey follows.\n\n\tINT. CAMPBELL CENTER - LABORATORY - DAY\n\n\tCooperman guides Novak and Ramsey into the lab.  The FBI men\n\tare impressed, but neither is quite sure what to make it all. \n\tThe FBI escort team leader gets Ramsey's signature and Novak\n\tundoes the cuffs from Stargher's wrists and ankles. \n\tFollowing Miriam's direction, the escorts guide the gurney\n\tcarrying Stargher into the procedure room.  As Cooperman\n\tshows them out, Henry seals shut the door.  Miriam assumes\n\tresponsibility for Stargher's care and checks his pulse, IV,\n\tpupil dilation, and vital signs...\n\n\t\t\t\tHENRY\n\t\tShouldn't we get a catheter in him?\n\n\t\t\t\tMIRIAM\n\t\tThey took care of that, thank you,\n\t\tHenry.\n\t\t\t(getting him out of her hair)\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tWhy don't you give our guests a little\n\t\ttour?\n\n\tProud of his computer, but uncomfortable around strangers,\n\tHenry directs Novak and Ramsey to the console.\n\n\t\t\t\tHENRY\n\t\tGentlemen, you stand before the one and\n\t\tonly Neurological Cartography and\n\t\tSynaptic Transfer System.\n\n\tAlthough he's listening, Novak's eyes never really stray from\n\this prisoner as Miriam uses safety scissors to cut away\n\tStargher's clothes.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tIt provides a highly detailed map of the\n\t\thuman mind.  Not the brain - any MRI can\n\t\tdo that.  The mind.\n\t\t\t(self-impressed)\n\t\tIt reads and processes electronically\n\t\tallowing information to be transferred\n\t\tand interrupted.\n\t\t\t(for the laymen)\n\t\tLet's say your thoughts could be stored\n\t\ton DVD.  If someone had the right kind\n\t\tof player, they could watch and listen\n\t\tto what you're thinking.\n\n\tNovak observes Miriam as she \"undresses\" Stargher and Ramsey\n\tpokes around the lab.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tBut we can't record or store the data. \n\t\tThe connections between nerve cells are\n\t\tconstantly being modified.\n\n\tMiriam needs a moment to fully take in the scars.  Henry\n\tcontinues, eager to focus attention back to him, but even he\n\tis fascinated by Stargher's skin.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tIt's like the early days of television. \n\t\tThe subject sends out a live feed and\n\t\tyou receive it during time of broadcast. \n\t\tWhatever happens, happens.  All you have\n\t\tto do is \"tune in.\"\n\n\tMiriam gives Stargher an alcohol bath, the clinical procedure\n\ttaking on the quality of ritual.  Her wash cloth moves under\n\tStargher's chin and over his face.  She's careful around the\n\teyes and finds herself unable to look at them for long.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tBut you do more than tune in... You\n\t\tbecome part of the snow.\n\n\tCatherine enters from a dressing area wearing the bodysuit. \n\tFilled with curiosity, Novak watches Miriam and Catherine fit\n\tStargher into his suit.\n\n\t\t\t\tNOVAK\n\t\tI still don't understand why I can't do\n\t\tthis... This isn't some \"troubled kid\"\n\t\tyou're dealing with.\n\n\t\t\t\tCATHERINE\n\t\tI realize that...\n\n\t\t\t\tNOVAK\n\t\tHow hard could it be...?\n\n\tCatherine and Miriam try to hide their laughter.\n\n\t\t\t\tCATHERINE\n\t\tThe first... What?  Six or seven times I\n\t\twent in.   Remember what happened?\n\n\t\t\t\tMIRIAM\n\t\tDisorientation, nausea, migraines,\n\t\thallucinations, insomnia, paranoia.\n\n\t\t\t\tCATHERINE\n\t\tLike a New Year's Day hangover.\n\n\t\t\t\tMIRIAM\n\t\tHe needs to be turned over.\n\n\tNovak and Catherine roll Stargher onto his stomach.\n\n\t\t\t\tNOVAK\n\t\tThis man is deeply disturbed, he...\n\n\t\t\t\tCATHERINE\n\t\tYou don't know the procedure.\n\n\t\t\t\tNOVAK\n\t\tI know him.\n\n\t\t\t\tMIRIAM\n\t\tThat may be true, but you don't have\n\t\tCatherine's gift.  She...\n\t\t\t(distracted by Stargher's back)\n\t\tWhat happened here?\n\n\tWe see a series of EIGHT BANDAGES.\n\n\t\t\t\tRAMSEY\n\t\tWe removed eight metal rings.\n\n\tMiriam peels away a bandage and examines the flesh.\n\n\t\t\t\tCATHERINE\n\t\tThen he should like this.\n\n\tCatherine connects Stargher to the SUSPENSION APPARATUS and\n\tit HOISTS him off the table.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tThey're comforted by the feeling of\n\t\tweightlessness.  Like floating in water.\n\n\tHenry catches Ramsey poking his nose near a THIRD SUIT AND\n\tAPPARATUS in the dressing area.\n\n\t\t\t\tHENRY\n\t\tDon't touch that, please.\n\n\t\t\t\tRAMSEY\n\t\tSorry.\n\n\tMiriam prepares a series of CHEMICAL CARTRIDGES and loads\n\tthem into a container connected to the IV-like tubes linked\n\tto the suspension device.\n\n\t\t\t\tMIRIAM\n\t\t\t(intimate, quiet)\n\t\tThis isn't your responsibility. \n\t\tRemember that.  Don't let them use guilt\n\t\tas a tool.  If you want to stop, say so.\n\n\t\t\t\tCATHERINE\n\t\tI'll be fine.\n\n\t\t\t\tMIRIAM\n\t\tShe said convincingly.\n\n\tCatherine focuses on the procedure and makes the necessary\n\tconnections.  Reluctantly, Miriam retreats to the monitoring\n\tstation.  She \"locks down\" the procedure room and joins\n\tHenry, Novak, and Ramsey at the console.\n\n\t\t\t\tNOVAK\n\t\t\t(eyes on the chemical/drug\n\t\t\tmonitors)\n\t\tThat's the stuff?\n\n\t\t\t\tHENRY\n\t\tAbout twelve years of research, right\n\t\tMiriam?\n\n\t\t\t\tMIRIAM\n\t\tDon't remind me.\n\n\t\t\t\tRAMSEY\n\t\tWhat is it - are they - exactly?\n\n\tThat's like asking her to explain the rules of cricket.\n\n\t\t\t\tMIRIAM\n\t\tPsychostimulants, serotonin,\n\t\tstabilizers, meprobamate, Neurontin,\n\t\tlithium carbonate.  And my baby.  It\n\t\tduplicates and expands upon the effects\n\t\tof a chemical called oxytocin, forcing a\n\t\tbreak in the neuron connections that\n\t\thold experience.  So new experience can\n\t\tform.\n\n\tRamsey is utterly lost and just sort of nods, but Novak is\n\tfascinated.  Catherine presses the bump on her hand.  A RED\n\tINDICATOR LIGHT flashes on.\n\n\t\t\t\tHENRY\n\t\tThere's a touch-sensitive microchip\n\t\timplanted in her hand.  If she becomes\n\t\tfrightened, disoriented, or simply wants\n\t\tto end the session, she signals us to\n\t\tabort.\n\n\tCatherine presses again and the red light shuts off.\n\n\t\t\t\tMIRIAM\n\t\tAlthough none of what she experiences is\n\t\treal, she can be tricked into thinking\n\t\tit is.  The mind is awfully gullible, so\n\t\tshe needs to monitor herself.\n\n\tCatherine and Stargher are suspended from the ceiling.  Henry\n\ttypes and the lights dim to a more somber, tranquil level. \n\tVarious screens flicker to life, displaying the vital signs\n\tof both \"feed\" and receive.\"  Miriam initiates the injection\n\tprogram.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tCatherine?  I'm about to start.  If you\n\t\twant me to wait, or...\n\n\t\t\t\tCATHERINE\n\t\tNo.  No.\n\n\tIN THE PROCEDURE ROOM, we see chemicals mix with her blood,\n\tthen feed the IV.  AT THE CONSOLE, as Henry types furiously\n\tat the computer keyboard, Novak asks Miriam:\n\n\t\t\t\tNOVAK\n\t\tYou said she has a \"gift.\"\n\n\tOverhearing, Henry interrupts, pointing at a section of\n\tCatherine's \"mind map.\"\n\n\t\t\t\tHENRY\n\t\tNot a gift.  A highly evolved area in\n\t\ther cerebral cortex, that's all.  A\n\t\tgenetic fluke.\n\n\t\t\t\tMIRIAM\n\t\tCatherine has a tremendous capacity for\n\t\tempathy.\n\t\t\t(clarifies)\n\t\tWhen we started, there were a number of\n\t\ttest subjects - other therapists - who\n\t\tacted as \"receivers.\"  All they did was\n\t\tobserve and report.  Nothing more.  But\n\t\tCatherine, she had the ability to feel\n\t\twhat was happening.  She understood. \n\t\tAnd the patient responded.  Edward\n\t\tengaged her in dialogue, took her\n\t\tplaces, showed her things.  He knew she\n\t\tcared.\n\n\tA hopeful, solemn Novak gazes through the window, watching\n\tCatherine's body as it becomes parallel to Stargher's...\n\n\tIN THE PROCEDURE ROOM, Catherine takes a deep breath and as\n\tthe drugs take effect, feels herself losing consciousness. \n\tShe glances at Stargher, a man who tortures and kills women,\n\tthen looks up as the CLOTH MASK descends from the ceiling.\n\n\t\t\t\tMIRIAM (O.S.) (CONT'D)\n\t\tIntravenous administration complete.\n\n\t\t\t\tHENRY (O.S.)\n\t\tInitiating connection.\n\n\tWe follow fibrous wires running from Catherine's mask to\n\tStargher's.  Their blood mixing with chemicals in the IV-like\n\tcontainers.  The computer system humming.\n\n\t\t\t\tHENRY (O.S.) (CONT'D)\n\t\tTransfer begins 1100 hours, 34 minutes,\n\t\t12 seconds.\n\n\tCatherine's eye focuses on the mask.  As it comes closer, we\n\tsee the lining is laced with thread-like wires and microchips\n\tforming hyper-miniature circuit boards.  Catherine's eye\n\tblinks.  The mask covers her face.  Catherine's eye shuts.\n\n\tVision fades.  Darkness.  A faint light.  Microscopic veins\n\tin the eyelid become wires connected to chips.  And we're\n\tMOVING, into the circuitry.\n\n\tENTRANCE ONE\n\n\tINT. STARGHER'S WORLD\n\n\tThe pattern of the electronics grows into something more\n\torganic, textured, concrete.  Evolving into a world.  Black\n\tand shadow-filled, it resembles a labyrinthine complex of\n\tvertical walls with cubicle like rooms carved deep into its\n\tcore.\n\n\tOur journey into this bleak, grim place continues and we\n\toccasionally glimpse brief images of a boy's baptism.\n\n\tINTERCUT with this journey are sections of cloudy blackness\n\tand fragmented visions of CATHERINE connected to the\n\tapparatus, face masked, DESCENDING into this world.\n\n\tThere is an abrupt SHIFT from still images to regular motion\n\tand we find ourselves gliding over a tidepool filled with\n\ttiny fish and tadpoles.  At water's edge, lying on rough,\n\tpebble-strewn ground, is a HAND.\n\n\tCatherine's hand.  We sense MOVEMENT, but she remains still. \n\tFrom the darkness comes a DOG.  Black in color and\n\tfeatureless, it sniffs Catherine, dismisses her, and meanders\n\tinto a cubicle opposite her, disappearing from view.  After a\n\tmoment of odd quiet, a DROP OF BLOOD hits the mask and we\n\tfollow Catherine's hand as it moves to the cloth and removes\n\tit from her own face.\n\n\tIN MACROSCOPIC SUPER SLOW-MOTIONS, another BLOOD DROPLET\n\tsails 64 into the air and comes crashing down, hitting a RED\n\tANT, catapulting it onto what looks like a tree, but is just\n\ta TWIG.  As the insect scurries away, MORE DROPS pound the\n\tearth, splatter against \"twig trees,\" and explode into pools\n\tof stagnant water...\n\n\tAs we begin to realize that this miniature landscape is the\n\tworld into which Catherine descended.\n\n\tShe sits up, shivering, and breathes deeply, acclimating to\n\ther surroundings.  The \"floor\" is covered with filth, ash,\n\tpebbles, and insects.  Water is present in many forms,\n\tpuddles, moisture, dripping ceilings.\n\n\tEyes focusing, queasy, not fully \"awake,\" Catherine notices\n\tthe crimson stain on the cloth mask and the blood droplets\n\tshowering the air.  She turns and finds the source.\n\n\tTHE BLACK DOG stands in the opposite room next to a tub full\n\tof BLOOD, shaking himself dry after his \"bath.\"  Satisfied,\n\tthe animal stops and trots away.  Still adjusting to this\n\tnightmarish realm, Catherine at first doesn't hear it, but\n\tthen realizes that somewhere, a child is CRYING.  She looks\n\taround, then through a crack in the \"floor,\" briefly catches\n\tsight of a BOY beneath her, on a level lower than hers.  As\n\the disappears into corridor ending in \"nothing,\" we PULL BACK\n\tto show a MASSIVE LANDSCAPE of blocks, cubicles, crawlspace,\n\twalls, stairs, and ladders.  Leading everywhere and nowhere.\n\n\tCatherine spots the boy as he crawls into a specific \"room.\" \n\tShortly after, a LIGHT comes on within the cubicle and she\n\tmoves to it.  We feel as though we're looking at a series of\n\tinterlocked tenement rooms, some walls of which have been\n\ttorn away to expose rooms within, rooms with no windows or\n\tdoors.  Following a path of fragile steps, Catherine makes\n\ther way to the LIGHTED ROOM and enters.\n\n\tINT. STARGHER'S WORLD - LIGHTED ROOM\n\n\tA mottled HORSE stands with its head down, nose kissing the\n\tfloor, allowing the BOY to caress its neck.  This sweet\n\tanimal is an incrongruous vision in this hellish world and\n\tCatherine approaches with respect.\n\n\t\t\t\tCATHERINE\n\t\tHello?\n\n\tThe frightened child retreats into a corner of the\n\tclaustrophobic room, but the horse does not startle. \n\tSurprisingly - to the boy - the horse takes an affectionate\n\tstep toward Catherine, inviting her to take over.  Catherine\n\tallows the mare to smell her, then vigorously scratches along\n\tthe mane and shoulder, much to the horse's delight.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tYeah, you like that, don't you?\n\n\tShe can see the boy hiding in the corner, stealing glances at\n\ther from the shadows.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tIs your name Carl?\n\n\tThe boy - YOUNG STARGHER - is startled and intrigued by the\n\tquestion - How did she know that?! - but says nothing.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tAnother little boy I know, he has a\n\t\thorse, too.\n\n\tThe boy reacts to an unusual SOUND coming from the CEILING.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tHis name's Edward.  The boy, not the\n\t\thorse...\n\n\tThe boy takes a few steps toward her, out of the shadows, but\n\the seems more concerned about something in the ceiling than\n\t\"connecting\" with Catherine.  Very anxiously, he looks at the\n\twall behind Catherine and watches an old wind-up kitchen\n\tTIMER click down.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat's the matter, Carl?\n\n\tAgain, a sharp SOUND from the ceiling.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat's wro---?\n\n\tYoung Stargher RUNS at her and SHOVES her hard!  Catherine\n\tFALLS BACK just as EIGHT SHEETS OF GLASS drop from the\n\tceiling!  Like oversize razor blades, they slice the horse\n\tinto four clean sections.  They separate and compact the\n\tquadrants until four glass-contained sections of dissected\n\thorse stand within the room.  Catherine SCREAMS, but the mare\n\tbarely acknowledged what happened.  Betraying no emotion, the\n\tboy runs.  The shaken Catherine takes a moment to collect\n\therself, then gives chase.\n\n\tINT. STARGHER'S WORLD - THE LABYRINTH\n\n\tYoung Stargher knows his way around the landscape, but\n\tCatherine has difficulty simply keeping him in sight.  She\n\truns, climbs and crawls.  Until she's utterly lost and\n\tdisoriented.  Tired and having difficulty breathing, she\n\tdrops to her knees and \"cools down.\"  She hears a NOISE\n\tnearby, gets to her feet, and finds a GEARED MECHANISM\n\tconnected to some kind of SHUTTERED DOOR composed of an\n\talmost metallic-looking glass.  Curious yet cautious, she\n\texamines the nearby walls, floor, and ceiling for any signs\n\tof \"traps\" akin to the glass blades.  Finding none, she pulls\n\tthe mechanism and quickly steps back.\n\n\tThe shutter opens and Catherine knows there's something alive\n\tin the tiny cubicle beyond.  She retreats into shadow,\n\thiding.  Released from the chamber is a WOMAN.  As she moves\n\tout of a darkness, we see VICTIM ONE.\n\n\tGhostly pale and adorned in eerie fetish garb, she appears to\n\t\"sense\" the presence of a stranger, targets Catherine in the\n\tshadows, and ATTACKS!\n\n\tCatherine's had enough and moves to press the implant, BUT\n\tTHE VICTIM IS ALREADY THERE! \n\tShe brutally grabs Catherine, THROWS her against the wall and\n\tSMACKS her head against it.  Catherine drops to the floor\n\tlike a rag doll.\n\n\tVictim One hefts Catherine onto her shoulder and with great\n\tpurpose, carries her deep into the labyrinth, toward the\n\tcore.  Passing in and out of consciousness, between darkness\n\tand light, a dazed Catherine is taken on a \"tour\" of\n\tStargher's world.  Passing mausoleum-like chambers filled\n\twith IMAGES of unspeakable horror and/or disturbing\n\tintensity.  At one of the rooms, we think we see Young\n\tStargher silently observing...\n\n\tSitting of standing in individual cubicles are STARGHER'S\n\tOTHER VICTIMS (TWO thru SIX), each woman resembling the\n\tgrotesque porcelain dolls glimpsed in the cubbyholes in\n\tStargher's basement.  Dressed by a fetishistic sadist (Nine\n\tInch Nails meets the Brides of Dracula), they resemble bored\n\thousewives, barely acknowledging the new member of the\n\t\"harem.\"\n\t\n\t\n\tINT. STARGHER'S WORLD - THE CORE\n\n\tVICTIM ONE drops Catherine in the center of the room and, job\n\tdone, crawls away.\n\n\tGroggy, feeling sick, Catherine sits up.  Unbeknownst to her,\n\tshe is sitting at the base of a pedestal with her back to the\n\tkind of THRONE.  And someone is there.  In the dim pool of\n\tlight above the pedestal, we see a MAN rise from the throne. \n\tThe wall behind him is covered in BLOOD RED CLOTH, and as he\n\tdescends, we realize it is a CAPE connected to EIGHT METAL\n\tRINGS pierced through the flesh of his back.  In a fluid\n\tmotion, waves of red give way to harshly textured concrete as\n\tthe man reaches the floor.  Catherine knows he is there. \n\tUnable to stop herself, she turns.  And sees the terrifying\n\tface of STARGHER.  But no the same Stargher.\n\n\tThis is STARGHER KING.\n\n\t\t\t\tSTARGHER KING\n\t\t\t(primitive, guttural)\n\t\tWhere you come from priddy thing?\n\n\tIn a split second, Catherine presses the implant on her hand.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM - DAY\n\n\tApparently capable of staying awake if properly caffeinated,\n\tNovak sits cross-legged on the floor, shoes off, analyzing\n\tRECENT PHOTOS AND DOCUMENTS sent to him via courier. \n\tIgnoring a snoring Ramsey napping on a nearby cot, Novak\n\tlooks at blow-ups from the videos, blueprints of Stargher's\n\thouse, detailed shots of the basement, and a draftsman's\n\tconceptual drawing of the cell itself.\n\n\t\t\t\tHENRY (V.O.)\n\t\tGentlemen?\n\n\tNovak looks at an INTERCOM SPEAKER.\n\n\t\t\t\tHENRY (V.O.) (CONT'D)\n\t\tShe's back.\n\n\tNovak doesn't wait for his just-stirring partner and moves.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tAs he enters, Novak sees a concerned Henry checking a print\n\tout of the procedure.\n\n\t\t\t\tNOVAK\n\t\tWhat happened?\n\n\t\t\t\tHENRY\n\t\tMust've been rather unusual.\n\n\tNoting Novak's confusion, Henry points to a CENTRAL MONITOR\n\tresembling a futuristic V.U. meter, gradiated in sections of\n\twhite, yellow, orange, and red.\n\n\t\t\t\tHENRY (CONT'D)\n\t\t\t(re: white/yellow area)\n\t\tIf her neural activity stays within this\n\t\trange, I know she's self-cognitive.\n\t\t\t(clarifies)\n\t\tAs if she were having a dream, but she\n\t\tknows she's dreaming.  She can \"wake up\"\n\t\tany time she wants to...\n\n\tAs Ramsey joins them, Novak nods, understanding, but his eyes\n\tare on Catherine, who's just coming back to consciousness.\n\n\t\t\t\tHENRY (CONT'D)\n\t\t\t(re: orange section)\n\t\tHowever, if her level of involvement is\n\t\trather intense, as it was just now, she\n\t\tcan perceive things as true.  It's\n\t\tdifficult to keep perspective.\n\n\tAs Novak lingers on that question, Ramsey gestures at the red\n\tsection.\n\n\t\t\t\tRAMSEY\n\t\tWhat happens here?\n\n\t\t\t\tHENRY\n\t\tWe don't talk about that.\n\n\t\t\t\tNOVAK\n\t\tWhat happens?\n\n\t\t\t\tHENRY\n\t\tWell, Theoretically, while she's inside. \n\t\tIf she came to believe that Stargher's\n\t\tworld is her world, her mind has the\n\t\tpower to convince the body that anything\n\t\tdone to it is, um, actually done.\n\n\tNovak doesn't like the sound of that.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tThat's why we monitor the use of the\n\t\tdrugs so closely.  We don't want her\n\t\tgetting to that degree of perceptual\n\t\tdisorientation.\n\n\t\t\t\tMIRIAM\n\t\tPump in two liters of pure oxygen,\n\t\tplease Henry.\n\n\tHenry types a command and Novak speaks into the intercom.\n\n\t\t\t\tNOVAK\n\t\tDr. Kent?\n\n\tIN THE PROCEDURE ROOM, Miriam eases Catherine back to\n\tconsciousness.\n\n\t\t\t\tMIRIAM\n\t\tDeep breaths.\n\n\tWhen she sees Stargher, Catherine's flesh crawls.\n\n\t\t\t\tCATHERINE\n\t\tIs it cold in here?\n\n\t\t\t\tMIRIAM\n\t\tWhat happened?\n\n\tNo response.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tWhat's wrong?\n\n\tIncapable of being in the same room as him, Catherine tears\n\tout of the apparatus and anxiously exits.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tCatherine!\n\n\tIN THE PROCEDURE ROOM:\n\n\t\t\t\tNOVAK\n\t\tI'll get her...\n\n\tINT. CAMPBELL CENTER - DAY\n\n\tA worried Novak searches the halls of the Campbell Center. \n\tHe's about to ask the staff for help, but stops when he sees\n\tthrough the window to Edward's room.\n\n\tINT. CAMPBELL CENTER - EDWARD'S ROOM\n\n\tCatherine sits next to the boy's bed, holding Edward's hand,\n\tsoftly singing a lullaby (to him, to herself).  Feeling that\n\the must speak to her, Novak intervenes.\n\n\t\t\t\tNOVAK\n\t\tEdward Baines, I presume.\n\t\t\t(to the catatonic child)\n\t\tHi, Ed.  I'm Pete.\n\n\t\t\t\tCATHERINE\n\t\tDo you think that's funny?\n\n\t\t\t\tNOVAK\n\t\tNo.  Not at all.  From what I\n\t\tunderstand, he knows I\"m here, isn't\n\t\tthat right?\n\n\tCatherine nods.  Novak picks up Edward's fallen teddy bear\n\tand rests it in the crook of the child's arm.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tI read about a woman in TExas who was in\n\t\ta coma for seven years.  Every time her\n\t\thusband came to visit, her heart would\n\t\tbeat faster.  Isn't that something?  I\n\t\tdon't know what name scientists have for\n\t\tsomething like that...\n\n\t\t\t\tCATHERINE\n\t\tIt doesn't have much to do with science.\n\n\t\t\t\tNOVAK\n\t\tWhat then?\n\n\t\t\t\tCATHERINE\n\t\tThe soul.  The spirit.  Whatever you\n\t\twant to call it.\n\n\t\t\t\tNOVAK\n\t\tAh, the part of us that can't be\n\t\texplained.\n\n\tShe appreciates his understanding.  And finds herself\n\tcomforted by his presence.  Catherine scrutinizes Novak, his\n\tintensity, his honesty, his complexity.  And asks:\n\n\t\t\t\tCATHERINE\n\t\tAgent Novak?\n\n\t\t\t\tNOVAK\n\t\tPeter, okay?\n\n\t\t\t\tCATHERINE\n\t\tDo you feel there's a side of yourself\n\t\tyou don't show people?\n\n\tThe question catches Novak off-guard, but he's willing to\n\tanswer.  Anything to get her talking.\n\n\t\t\t\tNOVAK\n\t\tAbsolutely.\n\t\t\t(realizing it's too personal)\n\t\tI suppose everyone does.\n\n\t\t\t\tCATHERINE\n\t\tJust like we all have fantasies, right? \n\t\tThings only we know, that we don't\n\t\tshare.\n\n\t\t\t\tNOVAK\n\t\tThat's what therapists are for, right?\n\n\tCatherine laughs.  It helps her relax.  If only slightly.\n\n\t\t\t\tCATHERINE\n\t\tDuring the sessions.  When I'm inside. \n\t\tI see those things.  What a person\n\t\thides, what they despite, what they want\n\t\tto control.  With Stargher...\n\n\tThis is difficult for her.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWith Stargher I saw things...\n\n\t\t\t\tNOVAK\n\t\tWhat did you see?\n\n\t\t\t\tCATHERINE\n\t\t\t(professionally)\n\t\tA kingdom.  His utopia. \n\t\tLife without consequence or restriction. \n\t\tHe's not even Carl Stargher anymore. \n\t\tHe's this... idealized version of\n\t\thimself who can do anything he\n\t\tpleases... Without fear.  A horrible\n\t\tprimitive ugly thing.\n\t\t\t(uncomfortable; re: Edward)\n\t\tI don't want to talk in here.\n\n\tShe kisses Edward's forehead and exits.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM/COURTYARD - DAY\n\n\tCatherine and Novak sit on a bench in the center of the\n\tcourtyard.  John Tracy is visible in the reception area,\n\tunable to sleep, desperately trying to fight frustration.\n\n\t\t\t\tCATHERINE\n\t\tWhy'd you bring him here?\n\n\t\t\t\tNOVAK\n\t\tYou're the shrink, you tell me.\n\n\t\t\t\tCATHERINE\n\t\t\t(already knows)\n\t\tAs soon as I met him, you knew I'd say\n\t\tyes.  He makes Julia real for me.\n\n\tNovak nods.  Guilty.\n\n\t\t\t\tNOVAK\n\t\tIt's an old lawyer trick.  Target the\n\t\temotions.  Do it right, you get a\n\t\treluctant witness to testify, a scared\n\t\tkid to confess.\n\n\tCatherine looks at him with disbelief.  \"You?!\"\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tBefore I was with the Bureau, I was an\n\t\tattorney, a prosecutor.  Mr. Law and\n\t\tOrder.  And then... I had a murder case\n\t\tin North Carolina.  Charles Gish. \n\t\tButchered seventeen people in three\n\t\tdays.  And because of one tiny piece of\n\t\ttainted evidence, he walked.\n\t\t\t(no regrets)\n\t\tThat's when I quit the DA's office and\n\t\tjoined the FBI.\n\n\tCatherine can see the pain and frustration in Novak's eyes. \n\tShe gives him a moment and asks:\n\n\t\t\t\tCATHERINE\n\t\tYou thought Stargher wanted to be\n\t\tcaught.\n\n\t\t\t\tNOVAK\n\t\tI did, yeah.\n\n\t\t\t\tCATHERINE\n\t\tYou were right.  There's a part of him\n\t\tthat knows the truth.  About what he\n\t\tdid, about himself.\n\n\tNovak's curiosity is piqued.\n\n\t\t\t\tNOVAK\n\t\tWhat about Julia?\n\n\t\t\t\tCATHERINE\n\t\tThis is going to sound terrible, but...\n\t\tI don't think she matters anymore.  Not\n\t\tto him.  He never finished her.  The\n\t\tothers...he was able to make them his.\n\n\t\t\t\tNOVAK\n\t\tYou think you can do this, don't you?\n\n\t\t\t\tCATHERINE\n\t\tHe might tell me about Julia.  The part\n\t\tof him that wants to help, that feels\n\t\tshame and remorse.  Who wants to be\n\t\tredeemed.\n\n\t\t\t\tNOVAK\n\t\t\t(skeptically)\n\t\tThis is Stargher we're talking about?\n\n\t\t\t\tCATHERINE\n\t\tNot Stargher, not really.  He's split\n\t\thimself right down the middle. \n\t\tGood/evil, right/wrong, merciful/cruel. \n\t\tA monster.  And an innocent child.  If I\n\t\tcould reach the boy.\n\n\t\t\t\tNOVAK\n\t\tWhoa.  Hold on.  Aren't they the same\n\t\tguy?\n\n\t\t\t\tCATHERINE\n\t\tDon't you feel there are different sides\n\t\tto every personality?  Maybe even the\n\t\tworst of us is capable of one decent\n\t\tact.  We're all human.\n\n\t\t\t\tNOVAK\n\t\tIt's hard for me to see Stargher as\n\t\thuman, capable of something like\n\t\t\"remorse.\"\n\n\t\t\t\tCATHERINE\n\t\tThen what is he?\n\n\t\t\t\tNOVAK\n\t\tEvil.\n\n\t\t\t\tCATHERINE\n\t\tIf you believe that.\n\n\t\t\t\tNOVAK\n\t\tMaybe this is a big fucking waste of\n\t\ttime.\n\n\t\t\t\tCATHERINE\n\t\t\t(sensing something)\n\t\tWhat happened to Charles Gish?\n\n\tNovak doesn't respond.  She prods him.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat happened?\n\n\t\t\t\tNOVAK\n\t\tWhat difference does it make...?\n\n\t\t\t\tCATHERINE\n\t\tTell me.\n\n\tGod, he does not want to do this.\n\n\t\t\t\tNOVAK\n\t\tRight after the trial, the night after\n\t\the was released.  Mr. and Mrs. Frank\n\t\tSimmons found Charlie sitting in their\n\t\tliving room watching TV with their\n\t\ttwelve-year old daughter Margaret.  He'd\n\t\tcut her right down the middle with a\n\t\tcarving knife.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tFound the girl's heart in the freezer -\n\t\the thought they might want to keep it.\n\t\t\t(grim humor)\n\t\tLuckily, the next thing he did was slit\n\t\this own throat.\n\t\t\t(bleakly)\n\t\tI am convinced of one thing. \n\t\tCharles Gish could've been raised by\n\t\tOzzie and Harriet and the same thing\n\t\twould've happened.\n\n\tHe can see Catherine doesn't accept that.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tA child can experience abuse worse than\n\t\tCharlie's.  And grow up to be someone\n\t\twho would never, ever hurt another\n\t\tliving thing.\n\n\t\t\t\tCATHERINE\n\t\tYou're sure of that?\n\n\t\t\t\tNOVAK\n\t\tYes.  I am.\n\n\tCatherine realizes that was a confession.\n\n\t\t\t\tRAMSEY (O.S.)\n\t\tWhere the hell you been?\n\n\tThey turn to see Ramsey.\n\n\t\t\t\tNOVAK\n\t\tRight here.\n\n\t\t\t\tRAMSEY\n\t\tNext time, tell me, okay?\n\n\t\t\t\tNOVAK\n\t\tBut you looked so cute.  All sleepy...\n\n\tRamsey shoots him a murderous look, then asks Catherine.\n\n\t\t\t\tRAMSEY\n\t\tYour colleagues want to know what to do\n\t\twith Stargher.\n\n\tNovak looks to Catherine for the answer.  Through the window\n\tblinds, she watches John Tracy lower his head.\n\n\t\t\t\tCATHERINE\n\t\tTell them to prep him.  And that I'll be\n\t\tright there.\n\n\tRamsey nods and heads back to the lab.\n\n\t\t\t\tNOVAK\n\t\tThank you.\n\n\tBriefly, he touches her hand.  Catherine looks away from John\n\tto Novak's hand, to the photographs on the wall.  Stargher's\n\thouse, Valentine, the pick-up truck.  Valentine...\n\n\t\t\t\tCATHERINE\n\t\tI need something.\n\n\tINT. CAMPBELL CENTER - CORRIDOR - DAY\n\n\tA K-9 UNIT FBI AGENT escorts VALENTINE to the lab.\n\n\tINT. CAMPBELL CENTER - LABORATORY - DAY\n\n\tAs the agent brings the frightened animal into the monitoring\n\tarea, Catherine and Valentine share a moment of \"connection.\" \n\tSlowly, confidently, she approaches the Shepherd, kneels, and\n\tremoves his leash and muzzle.  She strokes him and the dog\n\tinstantly warms up to her.\n\n\t\t\t\tFBI K-9 AGENT\n\t\tSure wasn't like that with me.\n\n\tNovak signs a document and the K-9 Agent exits.\n\n\t\t\t\tCATHERINE\n\t\tYou're a good boy, aren't you,\n\t\tValentine?\n\n\tThe dog picks up a scent from the procedure room and moves\n\tit, Catherine and Novak following.\n\n\tIN THE PROCEDURE ROOM, Stargher lies face down on a gurney. \n\tNow taped to the wall near Stargher are PICTURES from the\n\tbasement - his dolls, the hoist, etc.  Miriam (in surgical\n\tmask and gloves) carefully re-inserts the METAL RINGS (taken\n\tfrom an FBI EVIDENCE BAG) into the eight straps of flesh on\n\this back.  When he sees this, Valentine whimpers and hides. \n\tCatherine comforts him.  Miriam finishes her task and removes\n\ther mask.\n\n\t\t\t\tMIRIAM\n\t\tI hate to admit it, but there's\n\t\tsomething perversely satisfying about\n\t\tthis.\n\n\t\t\t\tHENRY\n\t\tI think that's the whole point.\n\n\tValentine runs to his \"sleeping\" master and barks at\n\tCatherine as if asking for help.  She encourages the animal\n\tto lick and sniff Stargher's face and hands.\n\n\t\t\t\tHENRY (O.S.) (CONT'D)\n\t\tThat's interesting.\n\n\tIN THE CONTROL ROOM, he scrutinizes the monitor showing the\n\tdetailed \"map\" of Stargher's brain.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tIncreased neural activity in the frontal\n\t\tlobes.  Rising dopamine levels in the\n\t\tbasal ganglia.  Ever since the dog\n\t\twalked in.\n\n\tIN THE PROCEDURE ROOM, Catherine readies herself in the\n\t\"receive\" apparatus.  As Stargher is lifted off the pedestal,\n\tthe doors HISS shut and Valentine curls up on the floor\n\tbeneath his master.  As Catherine is lifted, she smiles at\n\tthe animal, then looks to Stargher.\n\n\t\t\t\tNOVAK\n\t\t\t(comforting and coaching her)\n\t\tRemember, Julia Hickson is priority\n\t\tnumber one.  Nothing else matters.  Find\n\t\tout where she is.\n\n\t\t\t\tCATHERINE\n\t\tOkay, okay...\n\n\tLIGHTS FLICKER.  Catherine's eyes shut.  FADE TO BLACK...\n\n\t\t\t\tHENRY (O.S.)\n\t\tUh-oh...\n\n\tLIGHTS FLICKER.  We hear an ELECTRICAL HUM rise and fall. \n\tCatherine opens her eyes and the LIGHTS blink on and off in a\n\tweird pattern, making it difficult to see clearly.\n\n\t\t\t\tCATHERINE\n\t\tDon't kid around, Henry...\n\n\tHer suspension apparatus DESCENDS on the floor.\n\n\t\t\t\tHENRY (O.S.)\n\t\tI'm not.  It's a power problem.  I need\n\t\tyou to go to the circuit breaker and\n\t\tcheck switches six through twelve.\n\n\tCatherine moves toward the electrical panel.\n\n\t\t\t\tHENRY (O.S.) (CONT'D)\n\t\tTry to stay awake, okay?\n\n\t\t\t\tCATHERINE\n\t\tYeah, yeah, yeah.  I'm not sleepy.\n\n\tAs she moves toward the panel, everything becomes larger.  By\n\tthe time Catherine reaches the circuit breaker, it is the\n\tsize of a garage door.  Curiouser and curiouser...\n\n\tShe turns around to see the LABORATORY IS EMPTY and DEAD\n\tQUIET.  And she sees herself - Catherine as small as a mouse\n\ttrapped in a giant walled space.\n\n\tAT THE CONSOLE, Novak, Miriam and Henry observe the procedure\n\troom.  And Catherine.  Suspended in the apparatus. \n\tMotionless...\n\n\tENTRANCE TWO\n\n\tINT. STARGHER'S WORLD\n\n\tCatherine turns to see... Catherine lying in the fetal\n\tposition, locked in a BOX made of thick clean glass.  The\n\telectronic HUM becomes RHYTHMIC, AMBIENT NOISE.. INSIDE THE\n\tBOX, staying calm, she searches for and finds a TRAP DOOR on\n\tthe floor.  She pushes out.  The camera executes a complete\n\t180-degree perspective change.\n\n\tCatherine plummets.  She tries to reach out, to stop her\n\tdescent, but cannot.\n\n\tCatherine falls through a dark CAVERNOUS ROOM resembling a\n\tmammoth hollowed-out rib cage.  Below her is a DOME-LIKE\n\tSTRUCTURE \"growing\" out of the floor, a HOLE in the center of\n\tits crest.  Dozens of other such domes are visible in the\n\tmurky hell-hole, but Catherine has no choice.  She's dropping\n\tinto this one.\n\n\tOnce she passes through the hole, INSIDE THE DOME,\n\tCatherine's body looks as though it's moving through water,\n\tbut there is no water.  Like an aerial artist, she reverses\n\ther position so she's \"heads up.\"  Standing, stable, on the\n\tfloor.  Sensing something with her.  And knows it is...\n\n\t\t\t\tCATHERINE\n\t\tValentine?\n\n\tOut from the darkness, moving in normal motion, comes the\n\twhite German Shepherd, but in the thick haze, his face is\n\tindistinct and ghostly.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tHi sweetie...\n\n\tAnd as she steps toward him, his face DISSOLVES into a STARK\n\tLANDSCAPE.  An ear becomes a hill, the nose a stone, mouth a\n\tpath, and the eye a HOUSE. \n\tYOUNG STARGHER retreats towards the bleak structure as\n\tCATHERINE ENTERS FRAME.  Seeing the invitation, she presses\n\ton.\n\n\tINT. STARGHER'S WORLD - BOYHOOD HOME - KITCHEN\n\n\tYoung Stargher is at the sink WASHING DISHES, an anxious eye\n\ton the clock.\n\n\t\t\t\tCATHERINE\n\t\tNeed some help?\n\n\tAs Catherine enters the claustrophobic house, the boy\n\thesitantly pushes a towel toward her, but doesn't look.  She\n\treaches the counter and starts to dry, much to Young\n\tStargher's relief.  As he washes, Catherine hands him a\n\tMIRROR LOCKET just like Edward's.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tCarl, I want to give you a present.\n\n\tHe's hypnotized by the thing, his eyes lighting up.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tIf you need me, or if you feel that I'm\n\t\taround but can't find me, just shine it,\n\t\tlike this.\n\n\tShe shines reflected light onto the walls.  Carl hands\n\tCatherine the wet plate and takes the locket.  The dish slips\n\tfrom her fingers and SHATTERS on the floor.  The boy's eyes\n\tfill with dread.  The kitchen clock reads 5:30.  He PUSHES\n\tCatherine toward a broom closet and shoves her inside.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWhat's wrong honey?\n\n\tWith a finger to his lips, he pockets the locket and shuts\n\tthe door.  FROM WITHIN THE CLOSET, she watches the terrified\n\tchild through a CRACK in the door.  IN THE KITCHEN, Young\n\tStargher desperately tries to hide the broken plate. \n\tStartlingly, his father, Martin Stargher, is already in the\n\troom.  Cruel, imposing, manipulative man.\n\n\t\t\t\tMARTIN\n\t\tWhat did you do know?  You make a mess? \n\t\tI hate a mess.\n\n\tYoung Stargher backs into a corner, fearing what will come.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tDon't lie, now, Carl.\n\n\tIN THE CLOSET, Catherine pushes, but the door won't budge. \n\tShe POUNDS.  IN THE KITCHEN, we hear no sound.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tRemember what I said about liars?  Liars\n\t\twill be punished.\n\n\tINT. CLOSET - CONTINUOUS\n\n\tCatherine hears the child SCREAM.  But the scream comes from\n\tbehind and she spins around.\n\n\tINT. STARGHER'S WORLD - LIVING ROOM\n\n\tYoung Stargher is forced to sit on the lap of an ugly MIDDLE\n\tAGED WOMAN barely wearing a man's robe.  On a nearby table\n\tare whisky, tumblers, and an ashtray filled with butts.\n\n\t\t\t\tWOMAN\n\t\tI got you a present, cutie-pie.\n\n\tShe gives him a TOY DOLL.  Drunk, she hugs and kisses him. \n\tEmbarrassed, the boy tries to squirm away.\n\n\t\t\t\tWOMAN (CONT'D)\n\t\tOh no.  You're not going anywhere.\n\n\tMartin enters and sneers at the boy.\n\n\t\t\t\tMARTIN\n\t\tGo back to bed, worm.\n\n\t\t\t\tWOMAN\n\t\tIt's okay, we was just.\n\n\t\t\t\tMARTIN\n\t\tShut up, cunt.\n\n\tThe woman cowers, familiar with his violent moods.  The boy\n\thurries to his room, but Martin grabs him by the collar.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tWhat is that?\n\n\tHe pulls the doll from the child's hands, turns to the woman,\n\tand SMACKS her across the face with it, gashing her cheek.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tYou give him nothing.  Whore.  Are you\n\t\this mother?  ARE YOU?\n\n\tTerrified, she shakes her head \"no.\"  Martin sees Young\n\tStargher quietly crawling away, hoping to escape. \n\tMartin lifts the boy off the floor with one hand and holds\n\thim in front of the woman.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tYou see that?  SEE IT?  You slithered\n\t\tout one of them.  But where is she now,\n\t\tCarl?  As far from you as she could get,\n\t\tthat's where.\n\t\t\t(shoves him at the woman)\n\t\tYou want a mommy?  Is that what you\n\t\twant?\n\n\tThe poor boy trembles with fear.  And Martin notices a puddle\n\tof urine on the floor.  He drops the boy and laughs.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tLittle worm pissed his pants.\n\n\tHumiliated, Carl covers himself and hides in a corner. \n\tMartin and the woman LAUGH AND LAUGH, delighting in the boy's\n\thumiliation.\n\n\tINT. CLOSET\n\n\tFeeling the boy's shame, Catherine turns and finds a FADED\n\tPOSTCARD taped to the wall.\n\n\tINT. STARGHER'S WORLD - BEDROOM\n\n\tMartin has discovered his son's secret hiding place - a\n\tcamouflaged corner of the attic.  Arranged in deliberate,\n\tartistic fashion are scavenged DOLLS.  Heads, limbs and\n\ttorsos held together with twine, tape and wire.  Some wrapped\n\tin filthy plastic.  Faded photographs (including one of his\n\tMOTHER), mementos, and most disturbingly, the feathers and\n\tbones of dead birds, insect carcasses, and dissected,\n\tdesiccated mice.  There's something peculiarly beautiful\n\there, but Martin doesn't see it.  Not at all.\n\n\t\t\t\tMARTIN\n\t\tOnly girls play with dolls...\n\n\tHe turns and we see Carl is bound to a wooden support beam, a\n\tpiece of tape covering his mouth.  The boy is stripped to the\n\twaste, barely conscious, face streaked with tears and sweat.\n\n\t\t\t\tMARTIN (CONT'D)\n\t\tWhat kind of thing are you?\n\n\tINT. CLOSET\n\n\tA WEIRD NOISE snaps Catherine back to \"reality.\"  She turns\n\tjust as a door opens behind her.  Responding to the\n\t\"invitation,\" she moves through it.\n\n\tINT. STARGHER'S WORLD - BATHROOM\n\n\tThe adult Carl Stargher sits at the edge of the tub, his back\n\tto us, smoking a cigarette.  A white German Shepherd PUPPY\n\tclicks across the tile floor and YIPS at Catherine.  She\n\tagain hears the WEIRD NOISE.  A STAINLESS STEEL BOWL wobbles\n\tas Stargher's bloody rubber-gloved hands fill it with\n\tsomething.  Stargher knows she's there and isn't surprised by\n\ther presence, but he's not sure what to make of her.  What to\n\tdo with her.  He rises and walks past her to the sink.  He\n\tpulls off the gloves and washes his hands, glancing at her in\n\tthe mirror.\n\n\tCatherine cannot resist looking in the tub.  She sees a dead\n\tgirl, her torso sliced open.  Disgusted and mortified, she\n\tpulls back.\n\n\t\t\t\tSTARGHER (O.S.)\n\t\tShe was the first...\n\n\tShe turns, and Stargher is no longer at the sink.\n\n\t\t\t\tSTARGHER (O.S.) (CONT'D)\n\t\tDidn't know what I was doing...\n\n\tShe turns, where's this voice coming from?!  She steps back.\n\n\t\t\t\tSTARGHER (O.S.) (CONT'D)\n\t\tBe careful...\n\n\tThe bumps into the stainless steel bowl and it topples to the\n\tfloor, spilling its contents of human organs.  Wobble-wobble\n\twobble.  The bowl makes its now-familiar noise.\n\n\t\t\t\tSTARGHER (O.S.) (CONT'D)\n\t\tWhat did you do now?  You make a mess?\n\n\tAnd she can see him coming out of the shadows.  Catherine\n\tbacks into a corner, fearing what will come.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tI hate a mess.\n\n\tStargher steps into a pool of light, shooshes the puppy into\n\tthe hall, shuts the bathroom door, and looks right at\n\tCatherine.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tWhy are you here?\n\n\tGod almighty, what does she say?  What does she tell him?!\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tDon't lie, now...\n\n\tSCRITCH-SCRITCH-SCRITCH.  The puppy scratches at the door and\n\twhimpers, but Stargher's not about to let him back in. \n\tMoving slowly, carefully, he approaches Catherine.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tLiars will be punished.  \n\n\tCatherine makes a break for the door.  \"Playfully,\" Stargher\n\tmakes a half-hearted attempt to block her, but she evades him\n\tand reaches for the knob.  But the door's not there.  SCRITCH\n\tSCRITCH-SCRITCH.  She can still hear the dog, but there's no\n\tdamn door.  She turns:\n\n\tNo door.  No window.  The girl's body and bloody remains have\n\tvanished.  An OVERHEAD LIGHT flickers on, giving the room the\n\tlook and feel of the cell.\n\n\t\t\t\tSTARGHER (O.S.) (CONT'D)\n\t\tWhere do you think you're going?\n\n\tCatherine turns, back to the wall, calm and intimidating,\n\tStargher stands in the center regarding her with great\n\tcuriosity.  Catherine's ready to press the sensor.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tDon't do that.\n\n\tShe hesitates.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tIf you go away, you'll never find her.\n\n\tHow did he know?\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tIf you never find her, she dies.  Like\n\t\tthe rest.\n\n\tCatherine stops and listens.  She can't leave now.  The path\n\tto Julia has appeared.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tI mean, that's why you're here, right? \n\t\tWhy you came to my happy little home?\n\n\tHe reaches for her and she flinches.  Expecting such\n\tbehavior, Stargher grins.\n\n\t\t\t\tSTARGHER (CONT'D)\n\t\tYou're pretty.  A pretty, pretty thing.\n\n\tCatherine cannot show her fear, not now.  She composes\n\therself and approaches him.\n\n\t\t\t\tCATHERINE\n\t\tI want to help you, Carl.\n\n\tHis grin broadens to a smile and he almost laughs.\n\n\t\t\t\tSTARGHER\n\t\tHelp me?  That's good.  That's a good\n\t\tone.\n\t\t\t(malevolent)\n\t\tLiar.  Whore.  Cunt.\n\n\tCatherine stands her ground.\n\n\t\t\t\tCATHERINE\n\t\tYou sound like your father.\n\n\tHe gets close to her face and sneers.\n\n\t\t\t\tSTARGHER\n\t\tI am not like him.\n\n\tStargher retreats into the shadows, but Catherine persists.\n\n\t\t\t\tCATHERINE\n\t\tThen help me.  Where is Julia Hickson?\n\n\t\t\t\tSTARGHER\n\t\tWhy?\n\n\t\t\t\tCATHERINE\n\t\tMaybe, because you want to.\n\n\t\t\t\tSTARGHER\n\t\tIs that right?  You think you know me?\n\t\t\t\n\t\t\t\n\t\t\tINT. CAMPBELL CENTER - LABORATORY - DAY\n\n\tHenry sees a rapid rise in Catherine's warning meter.\n\n\t\t\t\tHENRY\n\t\tMiriam...\n\n\tINT. STARGHER'S WORLD - BATHROOM\n\n\tA wave of fear, of impending doom, overtakes Catherine.\n\n\t\t\t\tSTARGHER (O.S.)\n\t\tYou wanna know who I am?  You stupid\n\t\tbitch!\n\n\tAnd when he emerges from shadow, Stargher is STARGHER KING.\n\n\t\t\t\tSTARGHER KING\n\t\tNow shud you mouth, priddy thing, or me\n\t\tgod slice you from the kunt to the tits.\n\n\tCatherine moves to touch the sensor in her hand.  He GRABS,\n\tLIFTS and SLAMS her onto the floor, the back of her head\n\tHITTING HARD.  Her vision blurs.  Ears are ringing.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tMe god want you stay.\n\n\tStargher King straddles Catherine and pins her arms behind\n\ther back.  She's unable to touch the sensor.  With the tip of\n\tthe TOOL he traces a line from her pelvis up the center of\n\ther suit.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tMe god mek you beaudiful...\n\n\tHe shoves the tool through her neck and presses the trigger.  \n\tA COLLAR CLAMPS SHUT around Catherine's neck and...\n\n\tShe blacks out.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tA SENSOR ALARM SOUNDS on the computer.  Henry and Miriam\n\texpress shock at the sight of the monitor peaking in the red\n\tand move to the \"map\" of Catherine's mind.  As it becomes\n\t\"cool,\" Stargher's becomes \"hot.\"\n\n\t\t\t\tMIRIAM\n\t\tSon of a bitch!\n\n\tIN THE PROCEDURE ROOM, VALENTINE BARKS!  Startling everyone. \n\tThe dog GROWLS and backs away.  As if he senses something\n\thorribly wrong within his master.\n\n\tIN THE CONTROL ROOM, Novak questions the scientists.\n\n\t\t\t\tNOVAK\n\t\tWhen we got here, you just topped and\n\t\tpulled her out.\n\n\t\t\t\tMIRIAM\n\t\tThat was with Edward.  She's accustomed\n\t\tto his world.  Stargher's mind is\n\t\tunfamiliar territory.  She's \"lost.\"\n\t\t\t(looks at the third suit)\n\t\tSomeone has to go in. \n\t\tRemind her what's really happening.  And\n\t\tget her out.  Until then, she's at his\n\t\tmercy.\n\n\tMercy.  Novak's mind reels.\n\n\t\t\t\tNOVAK\n\t\tInto Stargher.  Inside...\n\n\t\t\t\tMIRIAM\n\t\tYes.\n\n\tNovak knows who that person will be.\n\n\tINT. CELL - DAY\n\n\tFueling herself with candy and juice, Julia examines the cell\n\tfor a way out, but finds tight seals everywhere.  THE SHOWER\n\tERUPTS WITH WATER!   She counts until thirty, it stops. \n\tShivering, Julia stars at the drain as the water spirals\n\tdown.\n\n\t\t\t\tJULIA\n\t\t\t(trying to remember the words)\n\t\tOur Father, who art in heaven, hallowed\n\t\tbe thy name.  Thy kingdom come, thy will\n\t\tbe done.\n\n\tON THE OTHER SIDE OF THE GLASS, we watch her through one-way\n\tglass from the video camera's point-of-view.  She looks right\n\tat \"us,\" in the mirror, saddened by the dark circles under\n\ther bloodshot eyes.\n\n\t\t\t\tJULIA (CONT'D)\n\t\t...on Earth as it is in Heaven.\n\n\tWe drift to the right and see the l.e.d. counters CLICKING\n\tAWAY.  01:44:54, 01:44:53, 01:44:52... Less than TWO HOURS to\n\tlive and she has no idea.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tIN THE PROCEDURE ROOM, Novak lies in a hastily-rigged THIRD\n\tAPPARATUS/SUSPENSION DEVICE.  Miriam connects him to the IV\n\tcylinder and tubes.\n\n\t\t\t\tMIRIAM\n\t\tI have done this, you know.  Been\n\t\tinside.\n\n\t\t\t\tNOVAK\n\t\tNo.\n\n\tMiriam nods, knowing he won't accept an opposing argument.\n\n\t\t\t\tMIRIAM\n\t\t\t(instructs him)\n\t\tDeep breaths.\n\n\tIN THE OBSERVATION ROOM, Henry adjusts monitors showing\n\tNovak's vital signs.\n\n\t\t\t\tHENRY\n\t\tPulse is rapid, pressure's a little\n\t\thigh...\n\n\tIN THE PROCEDURE ROOM, Miriam asks:\n\n\t\t\t\tMIRIAM\n\t\tNervous?\n\n\t\t\t\tNOVAK\n\t\tAbsolutely.\n\n\tShe loads a MICROCHIP SENSOR into a high-pressure injection\n\tgun and IMPLANTS it in NOVAK's HAND.  He winces from the\n\tbrief pain as she loads the chemical cartridges.\n\n\t\t\t\tMIRIAM\n\t\tI have to ask you some things... Are you\n\t\ttaking any prescription drugs?\n\n\t\t\t\tNOVAK\n\t\tPrevacid.  For my stomach.\n\n\t\t\t\tMIRIAM\n\t\tAny psychiatric medication?\n\n\t\t\t\tNOVAK\n\t\tNo.  \n\n\t\t\t\tMIRIAM\n\t\tWhat about narcotics?\n\n\t\t\t\tNOVAK\n\t\tNo.\n\n\t\t\t\tMIRIAM\n\t\tI know your partner's here, but it's\n\t\tvery important that you're honest.\n\n\t\t\t\tNOVAK\n\t\tI am.  I'm a pretty boring guy.\n\n\t\t\t\tMIRIAM\n\t\tI doubt that.\n\n\tHenry checks the \"maps,\"  Catherine's vitals and reports.\n\n\t\t\t\tHENRY\n\t\tWe should hurry.\n\n\tMiriam walks Novak through what's about to happen.\n\n\t\t\t\tMIRIAM\n\t\tThe first five minutes will be\n\t\tdisorienting.  Give yourself time.  Let\n\t\tthe drugs do the work.  If you can see,\n\t\tsmell, feel, hear, taste things - you're\n\t\ton the right track.  Once you've\n\t\tacclimated, try to get a feeling for\n\t\tCatherine.  Instinct plays a huge role\n\t\tin this.  Trust it.\n\n\tShe gives him a supportive touch on the shoulder, exits and\n\tshuts the door.  IN THE OBSERVATION ROOM, Miriam continues\n\tvia intercom.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tYou can control how you see yourself -\n\t\tclothes, shoes, that kind of thing - but\n\t\tthe rest of it is up to him.  Use only\n\t\twhat he provides.  Don't try to change\n\t\tanything.  Or introduce something of\n\t\tyour own.  It'll only upset him.\n\n\tIN THE PROCEDURE ROOM, Novak flexes his fingers and sees the\n\tlittle bump beneath his flesh.\n\n\t\t\t\tHENRY (O.S.)\n\t\tAgent Novak?  Press the sensor.\n\n\tNovak does and the red light comes on.  As Novak is LIFTED,\n\the looks at Catherine, then Stargher.  Valentine YIPS and\n\tsettles beneath Novak.  The suspension device clicks into\n\tplace and the MASK descends.\n\n\t\t\t\tMIRIAM (O.S.)\n\t\tNo matter what happens, Peter, remember\n\t\tone thing: It's not real.\n\n\tNovak's eyes fix on the clear liquid contained in the IV-like\n\tcylinder.  A liquid cloud of his blood grows within. \n\tPreparing the mixture for injection.\n\n\tThe viscosity of the fluid starts to thicken and the CAMERA\n\tMOVES INTO THE MIXTURE.  As blood and chemical swirls take\n\tshape, we MOVE FAST.  Deeper into the fluid at a molecular\n\tlevel.  We feel like we're SOARING over some kind of liquid\n\tlandscape.\n\n\tNOVAK HYPERVENTILATES.  He's having difficulty making the 98\n\ttransition.\n\n\tFlying faster, faster, faster.  Through an entire universe.\n\n\tNovak is in the procedure room.  Alone.  His face contorted\n\tas if feeling the effects of tremendous G-FORCE.\n\n\tENTRANCE THREE\n\n\tINT. STARGHER'S WORLD\n\n\tCLOUDS hover above a dark, gloomy landscape dotted with\n\thills.  THREE IDENTICAL WOMEN sit on black earth, their\n\tbodies positioned in a uniform pattern.  PULL BACK TO REVEAL\n\tNOVAK at their feet, in a kneeling fetal position, face down\n\tin the gritty soil, a piece of cloth draped over his head. \n\tWith difficulty, practically inhaling black grit, Novak\n\tbreathes deeply and rises to his knees.  His hand moves to\n\this face and he's briefly astounded by the texture of the\n\tgravel, the sharpness of it against his face.  Removing the\n\tshroud-like cloth, he looks at the soil, smells it, tastes\n\tit.\n\n\t\t\t\tMOTHER ONE (O.S.)\n\t\tHave you seen him?\n\n\tNovak finds the first of the three - VISIONS OF STARGHER'S\n\tMOTHER - addressing him.  She, like the other two, speaks in\n\ta ghostly monotone, nearly devoid of emotion.\n\n\t\t\t\tMOTHER ONE (CONT'D)\n\t\tMy boy, my little one.  His father took\n\t\thim from me.  Have you seen him?\n\n\tAs she continues, almost mantra-like, WOMAN TWO BEGINS:\n\n\t\t\t\tMOTHER TWO\n\t\t\t(similar monotone)\n\t\tMy child is an abomination.  He is\n\t\tdamned.  He has no soul.\n\n\tThe women's repetitive \"monologues\" overlap.  Aurual layers\n\tnow added by THREE.\n\n\t\t\t\tMOTHER THREE\n\t\tMe god me boy.  Me god good son.\n\n\tNovak takes a moment to absorb his surroundings.  The sights,\n\tsounds and feel of the place.  Like being within a dream.  As\n\the backs away from the odd quartet, SHIMMERING LIGHT dances\n\tacross his face.  Shading his eyes.  Novak searches for the\n\tsource.\n\n\tOpposite him, across the valley, is a SHEER ROCK WALL.  A\n\tmassive cliff face pockmarked with rough \"windows.\"  Like a\n\tstar, the LIGHT sparkles inside one of them, a fragment of\n\tMIRROR reflecting a beam away from Novak's face to a PATH\n\tcutting across the valley floor to the base of the wall.\n\n\tThe light guiding him, Novak follows the path and starts to\n\tCLIMB, finding stairs or ladders, passing deep, seemingly\n\tinfinite passages.  Like tombs, or the \"drawers\" of a\n\tmausoleum.  Deep within one of them, THE LIGHT FLICKERS. \n\tFades.  And Novak crawls into darkness.\n\n\tINT. STARGHER'S WORLD - THE DEN\n\n\tNovak emerges in a cavernous room dripping with decadence. \n\tThe place reeks of sex, pain, lust, and cruelty.  As he moves\n\tdeeper into the chamber, Novak sees YOUNG STARGHER perched\n\tatop some kind of pedestal, crouching, fingering his mirror\n\tLOCKET, bouncing sparkles of light into the dark corners of\n\tthe room\n\n\tThe FLICKERING LIGHT pinpoints a FIGURE emerging from the\n\tdarkness.  It is Catherine.  Altered to an image of\n\tStargher's victims.  Her skin, face, clothing, eyes, are just\n\tlike the Victims'.  It's a shocking, strange image, made even\n\tmore disturbing by the look of pleasure on her face.  Novak\n\tis staggered by the sight.  His vision and hearing become\n\taffected by blurred vision, sharp sounds - then focus to\n\tclarity as he reminds himself...\n\n\t\t\t\tNOVAK\n\t\tNot real...\n\n\tLike an ethereal queen of the damned, she strides toward him,\n\tnarrowing her eyes.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tCatherine.\n\n\tShe exhibits no recognition of her name.  Catherine\n\tseductively moves closer to Novak, their bodies almost\n\ttouching, her hands caressing his hair, lips, neck...\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tJesus.  Catherine.  Listen to me...\n\n\tShe presses her finger to his lips and forces him down, onto\n\tthe floor, his back to the pedestal.  Catherine straddles\n\tNovak, and when he tries to stand, she holds him down,\n\tforcing him to stay.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tLISTEN TO ME!\n\n\tShe steals a glance over his shoulder and glimpses a MALE\n\tFIGURE coming toward them, coming into the light.  Novak is\n\tutterly unaware of what's happening.  Catherine is keeping\n\thim occupied.  Waiting for the arrival of...\n\n\tSTARGHER KING\n\n\tCatherine LAUGHS.  Novak catches only a fleeting glimpse of\n\tthe monster before Stargher King GRABS him by the throat and\n\tSMASHES his head against a pedestal.\n\n\tBLACKOUT.\n\n\tINT. STARGHER'S WORLD - THE DEN\n\n\tEyelids rise and flutter.  Novak becomes conscious.  And\n\tinstantly realizes what's happened.\n\n\tHe lies on the pedestal, face up, spread-eagle, his wrists\n\tand ankles bound to the cold stone surface with leathery\n\tcords.  Standing over him, in a pool of light, is Stargher\n\tKing.  Wearing what could be seen as CEREMONIAL GARB, a\n\tsilent, solemn Stargher King prepares himself for execution\n\tof a ritual by polishing and arranging an assortment of\n\tshiny, sharp, macabre TOOLS.\n\n\tNovak shuts his eyes and silently tells himself, Not real. \n\tHe opens them, breathes deeply and focuses on Catherine.\n\n\t\t\t\tNOVAK\n\t\tYou're Catherine Young.  You majored in\n\t\tPsych at UC San Diego.  You work for\n\t\tSunerset Industries.\n\n\tStargher King's fingers pass over an array of horrific\n\tinstruments - the throat piercer/collar mechanism, a cleaver\n\tknife, a misshapen hammer, a long slender needle...\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tYour grandmother raised you after your\n\t\tparents died in a car crash...\n\n\tStargher King lifts the blade-like NEEDLE.  So far, Catherine\n\tlooks at Novak like he's speaking gibberish.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tWhen you were twenty-one, you were\n\t\tarrested for possession and got off with\n\t\tcommunity service.\n\n\tStargher King SLICES through Novak's clothes, exposing the\n\tflesh of his abdomen.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\t\t(reminding himself)\n\t\tNot real, Pete...This is not real...\n\t\t\t(urgency)\n\t\tYou had to work at a center for abused\n\t\tkids for three months.  You stayed on\n\t\ttwo years for no pay.  You give half\n\t\tyour fucking salary to the nursing home\n\t\tyour grandmother stays at...\n\n\tStargher King grabs his throat and traces the blade down the\n\tcenter of Novak's torso.  Novak struggles and pleads with\n\tCatherine.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tI know this because I work for the FBI. \n\t\tPeter Novak, remember?!?!\n\t\t\t(a desperate request)\n\t\tRemember.  You are Cath-\n\n\tStargher King cuts his flesh and INSERTS the needle into his\n\tstomach.  NOVAK SCREAMS!  This fucking hurts!\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tHelp me!!!\n\n\tStargher King wiggles the needle, pulls it out, and digs his\n\tfinger into the wound.  NOVAK CRIES IN PAIN.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\t\t(tears forming, horrified)\n\t\tFucking FEELS real!\n\n\tThe intensity of Novak's cries hit Catherine like a\n\tthunderbolt.  There's a glimmer of life, of recognition in\n\ther eyes.\n\n\t\t\t\tSTARGHER KING\n\t\t\t(finally speaking)\n\t\tMe god gut you like a dear.\n\n\tAlthough we don't see it, we HEAR something awful.  Like\n\tStargher King fishing around inside the wound.  A pale,\n\tsweating Novak tries to stay conscious.  He will not go into\n\tshock...\n\n\t\t\t\tNOVAK\n\t\tNot real.  Not real.  Not real.\n\n\tA FEMALE HAND grabs the tool from the tray.\n\n\t\t\t\tSTARGHER KING\n\t\t\t(mimicking Novak, laughing)\n\t\tNod reel, nod reel, nod reel...\n\n\tSTARGHER KING IS SLAMMED FROM BEHIND!  CATHERINE RAMS THE\n\tTHING THROUGH HIS THROAT!   As Stargher King stumbles away\n\tgagging, blood pouring form his neck, we see that she has\n\treturned to normal.  The \"bride\" persona is gone.  As\n\tStargher King emits animalistic growls, Catherine turns and\n\tsees an intact Novak standing next to her.  As if nothing had\n\thappened.\n\n\tCatherine and Novak RUN out of the den, into the tunnel from\n\twhich Novak gained access.  He stops, ready to press the\n\tsensor, when a FLICKER OF LIGHT dances across Catherine's\n\tface.\n\n\t\t\t\tCATHERINE\n\t\tWait...\n\n\t\t\t\tNOVAK\n\t\tLike hell \"wait.\"\n\n\tBut she won't listen and he's forced to play catch up as she\n\tmoves further from the den toward the cliff face.  The\n\tFLICKER OF LIGHT shines on the entrance to a specific TUNNEL.\n\n\t\t\t\tCATHERINE\n\t\tHe wants us to follow.  The little\n\t\tboy...\n\n\t\t\t\tNOVAK\n\t\tLittle boy?!  That's him!\n\n\t\t\t\tCATHERINE\n\t\tHe brought you to me, didn't he?  If you\n\t\twant Julia to live, trust me.  Trust\n\t\thim.\n\n\tINT. TUNNEL/CUBBYHOLE\n\n\tOn her hands and knees, she enters the TUNNEL, not waiting\n\tfor him to respond.  She knows what he'll do... Catherine and\n\tNovak crawl through the dark, grimy claustrophobic space,\n\tplaying with his mirror locket.\n\n\t\t\t\tCATHERINE\n\t\tCarl...\n\n\tHe so desperately wants her affection, but fear prevents him\n\tfrom reaching out to her.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tThis is Peter.\n\n\tScared, he shakes his head \"no.\"\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tDon't be scared.  You're my friend and I\n\t\twould never hurt you.\n\n\tShe extends her hand.  Oh-so-hesitantly he takes it.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWill you take us to her?  To Julia?\n\n\tShyly, hesitantly, he nods.  She smiles gratefully and\n\taffectionately touches the boy's face.  Clasping her hand,\n\tYoung Stargher leads Catherine and Novak into utter darkness.\n\n\tINT. STARGHER'S WORLD - THE IDEALIZED CELL\n\n\tMore stylized than the actual cell, it's bigger and ornately\n\tdecorated, with the atmosphere of a church.  Individual\n\tIMAGES hang like SHRINES, each showing Julia Hickson from\n\tdifferent angles.\n\n\tCentral to the room is a WINDOW INTO THE CELL ITSELF.  Where\n\twe find a beautiful, mermaid-like JULIA HICKSON floating in\n\twater.  Peaceful, joyous.\n\n\tIN THE CENTER OF THE ROOM, we find Novak and Catherine, she\n\tholding the hand of Young Stargher, he stunned at the sight\n\tof Julia.  The child looks at Catherine with beatific, sad\n\teyes, regarding her as one would a saviour.\n\n\t\t\t\tNOVAK\n\t\tWhere the hell are we?\n\n\t\t\t\tCATHERINE\n\t\tCarl, do you know?  Like on a map...\n\n\tHe shakes his head and buries his face in her shoulder.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tIt's okay, it's okay.  You helped so\n\t\tmuch already.  I'm proud of you.\n\n\tAs a frustrated Novak searches for anything identifying,\n\tCatherine comforts the boy and looks deeply into his sad,\n\thaunted eyes.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tCarl, I think I can help you.  Would you\n\t\tlike that?  Even if Peter can't find\n\t\tJulia, I want to help you.\n\n\tThe boy leans against her and she caresses his face.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tI promise.\n\n\tNovak finds himself standing in front of the idealized cell. \n\tMounted beneath the glass is a shiny, perfect metal plaque\n\treading CARVER INDUSTRIAL EQUIPMENT, with a logo.  Novak\n\trecognizes it from the hoist in Stargher's basement.\n\n\t\t\t\tNOVAK\n\t\tLet's go.\n\n\tHe pulls her to her feet.  Feeling betrayed and rejected, the\n\tchild breaks away from her.  THE ROAR OF STARGHER KING shakes\n\tthe cell.  Terrified, the boy searches for a place to hide.\n\n\t\t\t\tCATHERINE\n\t\tCARL!\n\n\tNovak feels what's coming.\n\n\t\t\t\tNOVAK\n\t\tCOME ON!\n\n\t\t\t\tCATHERINE\n\t\tI can't leave him!\n\n\tSTARGHER KING APPEARS!  His throat wounded, bloody mess, he\n\tdescends out of dark nothingness, HOWLING with rage.  He\n\treaches for Catherine, but Young Stargher runs in front of\n\ther.  \n\n\tSTARGHER KING CLAMPS HIS MASSIVE ARMS AROUND THE CHILD! \n\tLittle Carl opens his mouth in a silent scream... Catherine's\n\tarms reach out to him, but Novak clasps her hand and presses. \n\tAnd she is haunted by the sight of a frightened child in the\n\tarms of a monster...\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tHenry notices significant activity on the monitors.\n\n\t\t\t\tHENRY\n\t\tThey're back.\n\n\tEverything happens fast.  He and Miriam frantically cease the\n\tprocedure. \n\tNovak and Catherine are lowered and Novak startles them by\n\tquickly regaining consciousness.  Miriam attempts to inject\n\thim with stabilizing drugs, but he's already trying to tear\n\thimself out of the apparatus.\n\n\t\t\t\tNOVAK\n\t\tGet me out!\n\n\tMiriam MOVES into the PROCEDURE ROOM.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tGET ME OUT!\n\n\tMiriam tries to follow protocol, but Novak is moving like a\n\tfish caught in a net, ripping and tearing his way out of the\n\tapparatus and suit.  He gets to his feet, but soon falls to\n\this knees, dizzy and disoriented.\n\n\t\t\t\tMIRIAM\n\t\tDon't move!\n\n\tNovak is not listening.  Fighting off any after-effects- both\n\tphysical and mental - he moves for the door.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tAgent Novak!\n\n\tCatherine is coming back and Miriam moves to her.  Novak\n\tpauses just for a moment.\n\n\t\t\t\tNOVAK\n\t\tIs she alright?\n\n\t\t\t\tMIRIAM\n\t\tYes.  But you're going to sit down right\n\t\tnow.  I have to...\n\n\tNovak is already gone.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM\n\n\tNovak speed-dials a number on speaker-phone, hurriedly\n\tdresses, and locates a photograph of Stargher's basement. \n\tWhen he hears someone pick up the line, he barks:\n\n\t\t\t\tNOVAK\n\t\tThis is Novak, who've I got?\n\n\tA confused Ramsey enters and listens.\n\n\tINT. STARGHER HOUSE - BASEMENT\n\n\tA team of FBI AGENTS is meticulously going through every inch\n\tof Stargher's house. \n\tCrisscrossed wooden beams have been laid across the pit\n\tallowing forensics experts to search without disturbing\n\tanything.  On the other end of the direct line is COLE...\n\n\t\t\t\tCOLE\n\t\tAgent Cole.\n\n\t(INTERCUT WITH NOVAK AND RAMSEY)\n\n\t\t\t\tNOVAK\n\t\tI need you to find something in the\n\t\tbasement...\n\n\t\t\t\tCOLE\n\t\tAlready there.\n\n\t\t\t\tNOVAK\n\t\tThat hoist, with the winch...\n\n\tWE FOLLOW Cole as he moves to the machine.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tThere's some kind of plaque, a metal\n\t\tplate, with a logo.  On the base.\n\n\tCole locates it.\n\n\t\t\t\tCOLE\n\t\t\t(reading)\n\t\tCarver Industrial Equipment.\n\n\tINT. CAMPBELL CENTER - CONFERENCE ROOM\n\n\tNovak instructs him...\n\n\t\t\t\tNOVAK\n\t\tFind out the history of that machine. \n\t\tWho bought it, used it, sold it.  And\n\t\tcheck Stargher's pay stubs.  I want to\n\t\tknow every contractor he worked for. \n\t\tI'm calling you from the chopper in ten\n\t\tminutes.\n\n\tDizziness and disorientation again hit Novak.  Pale and\n\tsweating, he winces as his stomach agonizingly cramps.\n\n\t\t\t\tRAMSEY\n\t\tJesus Christ, man, you look like hell.\n\n\t\t\t\tNOVAK\n\t\tConsidering where I've been...\n\n\tFighting the pain, he gathers together MAPS, slips on his\n\tshoes and grabs gun and holster.  Ramsey is apoplectic.\n\n\t\t\t\tRAMSEY\n\t\tWhoa-whoa-whoa.  Mind telling me what\n\t\tthe fuck is happening?\n\n\t Novak points to the photo of Stargher's basement,\n\tspecifically the hoist.\n\n\t\t\t\tRAMSEY (CONT'D)\n\t\tYou're bettin' the farm on something you\n\t\tsaw after they pumped you full of god\n\t\tknows-what kind of shit?\n\n\t\t\t\tNOVAK\n\t\tI saw her.  Julia.  Alive.  I saw\n\t\teverything.\n\n\t\t\t\tRAMSEY\n\t\tYou might've seen Jimmy Hoffa dancing\n\t\twith Timothy Leary.  I don't care.\n\n\tNovak is not stopping...\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tIN THE PROCEDURE ROOM, Miriam shines the penlight into\n\tCatherine's eyes.\n\n\t\t\t\tCATHERINE\n\t\t...a pocketful of rye.\n\n\t\t\t\tMIRIAM\n\t\tFour and twenty blackbirds...\n\n\t\t\t\tCATHERINE\n\t\tBaked in a pie.\n\n\tAT THE CONSOLE, on a security monitor, Henry can see Novak\n\tand Ramsey exiting down the corridor.\n\n\t\t\t\tHENRY\n\t\tThe FBI has left the building.\n\n\tIN THE PROCEDURE ROOM, Miriam appears concerned.\n\n\t\t\t\tMIRIAM\n\t\tDamn him.\n\n\t\t\t\tCATHERINE\n\t\tWhat's wrong?\n\n\t\t\t\tMIRIAM\n\t\tAgent Novak.  I didn't get a chance to\n\t\tclear him.\n\n\tCatherine encourages her.\n\n\t\t\t\tCATHERINE\n\t\tGo.  I'm fine.  Go.\n\n\tAs Miriam hurries to catch Novak, she tells Henry.\n\n\t\t\t\tMIRIAM\n\t\tKeep an eye on her.\n\n\tHe nods, but isn't really paying attention.  Catherine turns\n\tto Stargher's motionless form, still suspended, still\n\tconnected to the machinery.\n\n\tINT. THE CELL - DAY\n\n\t\t\t\tJULIA\n\t\tDo something, Julia.\n\n\tShe looks around the room and runs her hands along the walls,\n\tthe tile, looking for a weak spot.  She focuses on the\n\tCEILING PANEL and although it's painful because of swollen\n\tfingers, removes her ENGAGEMENT RING.\n\n\tEXT. CAMPBELL CENTER\n\n\tA ready-and-waiting HELICOPTER is on the pad.  Novak races\n\tout of the Center, Ramsey right behind him, SHOUTING at each\n\tother in order to hear above the chopper noise.\n\n\t\t\t\tRAMSEY\n\t\tPete, listen to me.  What did you really\n\t\tlearn in there?  Anything new?  You\n\t\treally think Stargher gave you a save\n\t\tthe-day clue?  What if this is all some\n\t\tkind of trick your head is playing on\n\t\tyou?\n\n\tHe won't consider that.  Novak climbs into the helicopter and\n\tbuckles himself in.  He looks to Ramsey - you coming? -\n\tRamsey pats the side of the chopper and signals for the pilot\n\tto take off.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tHenry analyzes voluminous print-outs from the last procedure. \n\tAlthough his eyes are on the data, he converses with\n\tCatherine in the PROCEDURE ROOM via intercom.\n\n\t\t\t\tHENRY\n\t\t...there was a moment when we thought\n\t\twe'd lost Agent Novak as well.\n\n\tWe see chemicals flow and computer programs initiate the\n\tprocedure, but Henry is oblivious.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tHis post-procedure consciousness\n\t\trecovery was remarkably quick.  Never\n\t\tsaw that before.  Hey, remember that one\n\t\ttime...\n\n\tHe JUMPS when the door to the procedure room SEALS SHUT and\n\tmechanisms HUM.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tCatherine?\n\n\tWhen he looks through the window, Catherine is again\n\tsuspended, the procedure under way.\n\n\t\t\t\tHENRY (CONT'D)\n\t\tWhat are you doing?\n\n\tHe types in a command, but nothing happens.  He tires again.\n\tOn another keyboard, but gets no response.  When he looks at\n\tthe \"map\" screens, he sees something odd.  It's a small\n\tchange, but it makes all the difference in the world.\n\t\n\t\t\tINT. THE CELL - DAY\n\n\tLike a rock climber in a crevasse, Julia shimmies up the\n\twalls of the cell by bracing herself in a corner and using\n\ther hands and feet to push up.  The tile is slippery and each\n\tmovement precarious.\n\n\tShe uses strength and balance to reach a position just below\n\tthe Plexiglass, the fluorescent light bathing her in an eerie\n\tintense glow.  She sees a gap between the glass and the wall\n\tand uses her ENGAGEMENT RING to dig into it, SCAPE, SCRAPE,\n\tSCRAPING with the diamond.\n\n\tTHE SHOWER SPRAYS WATER!  Julia nearly loses her balance, but\n\tmanages to stay pressed into the corner.  She kicks the\n\tshower head, sending the spray as far from her as possible,\n\tand continues to dig at the caulking around the light\n\tfixture.\n\n\tIN THE OBSERVATION ROOM, we see something unexpected.  The\n\tclock reads 00:00:00.  That water isn't going to stop.\n\n\tINT. CAMPBELL CENTER - EDWARD'S ROOM\n\n\tMiriam and Ramsey return to the lab to find Henry anxiously\n\tobserving from the console.\n\n\t\t\t\tHENRY\n\t\t\t(flustered)\n\t\tShe changed the codes.\n\n\t\t\t\tMIRIAM\n\t\tWhat's wrong?\n\n\t\t\t\tHENRY\n\t\tIt would take hours to re-route the\n\t\tsystem, and even if I did, I shouldn't.\n\n\t\t\t\tRAMSEY\n\t\tWhat are you talking about?\n\n\tMiriam analyzes the situation and regretfully, angrily,\n\tworriedly realizes what's happened.\n\n\t\t\t\tMIRIAM\n\t\tShe's done it.  Stupid, stupid girl...\n\n\t\t\t\tRAMSEY\n\t\tDone what?\n\n\t\t\t\tHENRY\n\t\tInstead of going into his mind...\n\n\t\t\t\tMIRIAM\n\t\tShe's bringing Stargher into hers.\n\n\tENTRANCE FOUR\n\n\tINT. CATHERINE'S WORLD\n\n\tA bright, deliriously colorful realm visually reflective of\n\tthings we saw in Catherine's home.  Unusual trees, rock\n\tformations, totems, statues, and a brilliant POOL OF WATER.\n\n\tThe pond ripples.  Visible through the crystal-clear water is\n\tYOUNG STARGHER, rising to the surface like a drowning victim\n\tsuddenly breaking through to air.  Panicked, he scrambles to\n\tshore and pulls himself to land.  Although the place is\n\tcomforting and beautiful, he's in strange territory and it\n\tfrightens him.  Shivering, he hunches down, eyes darting this\n\tway and that.\n\n\t\t\t\tCATHERINE (O.S.)\n\t\tYou're all right, Carl.\n\n\tThe boy turns toward the voice and finds CATHERINE, her hair\n\twaving in the wind, skin glowing, eyes bright, cutting a\n\tmagnificent figure in clothes that make her a warrior\n\tgoddess. \n\tShe opens her arms and the boy runs to her, basking in the\n\tcomfort of her embrace.  He shivers and she holds him\n\ttightly.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tIt's okay, honey, you're with me now. \n\t\tYou're safe here.\n\n\tShe looks deeply into his eyes and reassuringly explains.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tI promised I would help you, and I\n\t\talways keep my promises.\n\n\t\t\t\tYOUNG STARGHER\n\t\tCan...\n\n\tCatherine is astonished and relieve to hear him speak.  A\n\tsad, trembling little voice.\n\n\t\t\t\tYOUNG STARGHER (CONT'D)\n\t\tCan I stay here?\n\n\tShe is touched that he would ask and strokes his face.\n\n\t\t\t\tCATHERINE\n\t\t\t(regretfully)\n\t\tOh...no, honey, I'm sorry.  It's doesn't\n\t\twork that way.\n\n\tThe boy breaks away from her, turning his back.  She gently\n\ttakes his hand but he yanks it free.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tBut what if I told you you could come\n\t\tvisit?\n\n\tHe slowly turns to her.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tI'll make sure it happens, Carl.  I'll\n\t\tget them to let me do it.  And maybe...\n\t\tmaybe we can...\n\n\tYoung Stargher's eyes open wide with silent terror.  Over his\n\tshoulder, she sees a SNAKE slither through the pool. \n\tCENTIPEDES CRAWL over her legs and hair.  She stands and\n\tbrushes them off.  The atmosphere grows darker and ominous.\n\n\t\t\t\tYOUNG STARGHER\n\t\tHe found me...\n\n\tCatherine bristles as STARGHER KING RISES FROM THE POOL like\n\ta human serpent.  The brilliant colors of Catherine's world\n\tfade to GRIM TONES.\n\n\t\t\t\tYOUNG STARGHER (CONT'D)\n\t\tHe always finds me.\n\n\tStargher King SCREECHES with anger and confusion.\n\n\t\t\t\tSTARGHER KING\n\t\tWhere thiisss att?!?!  Me god no like id\n\t\there...\n\n\tHe snarls when he sees Catherine.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tYou.  Priddy bish-hor-kund.  You big\n\t\ttrubble-mekker...\n\t\t\t(sneers at the boy)\n\t\tAnd you.  You cumm home now, liddle\n\t\tcogsugger worm.  Or me god haffa punish\n\t\tyou...\n\n\tYoung Stargher tightens his embrace of Catherine.  She steps\n\tback, away from the pond, hugging the boy tightly.\n\n\t\t\t\tCATHERINE\n\t\tNo.!\n\n\t\t\t\tSTARGHER KING\n\t\tNo?!??!?!?!?\n\n\tStargher King laughs.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tHoo you thing you are?? Himm Muther?\n\n\tHe comes close and reaches for the boy...\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tYou gimme liddle worm.\n\n\tFor a moment, Catherine appears frightened and intimidated. \n\tPerhaps near an emotional breakdown.  But that is not the\n\tcase.  She quietly lowers little Carl to the ground and\n\twhispers something in his ear.  As the boy nods, runs and\n\thides, a ferocity grows within her.\n\n\t\t\t\tCATHERINE\n\t\tI said no.\n\n\tLike a vengeful Valkyrie, she emits what can only be called a\n\tBATTLE CRY!  STARGHER ATTACKS!  Arms reaching for her. \n\tCatherine BLOCKS, PUNCHES, AND KICKS.  Stargher King doubles\n\tover.  Catherine grabs his ears and pulls his face into her\n\tbent KNEE, breaking his nose.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tWelcome to my world.\n\n\tAs blood flows from his nostrils, Stargher King grins...\n\n\t\t\t\tSTARGHER KING\n\t\tYou funny.  You thing you stop me god?\n\n\tHE CHARGES.  At the right moment, Catherine sidesteps and\n\tSMASHES him in the ribs as he passes.  Stargher King crumples\n\tto the ground and she KICKS an uppercut to this chin.  Rising\n\tfrom the mud and muck, Stargher King lands a POWERFUL BLOW to\n\ther head, sending her flying.  He lifts the stunned Catherine\n\twith one hand and pulls her face to his...\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tYou cum back wif me god.  You be good\n\t\tbish-hor-kund...\n\n\tCatherine looks into his soulless eyes.  Then SPITS in them\n\tand BITES his face!  She breaks free as he YOWLS with pain. \n\tHe steps toward her, but his feet don't move.  The earth\n\titself appears to wrap around them and turn hard, like\n\tconcrete.  Stargher King HOWLS with frustration.\n\n\t\t\t\tCATHERINE\n\t\tMy world...\n\n\tA SHIMMERING KNIFE seems to enrage from within her forearm,\n\tout the flesh and into her hand.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tMy rules.\n\n\tShe SLASHES across his chest, drawing blood.\n\n\t\t\t\tYOUNG STARGHER (O.S.)\n\t\tNo!\n\n\tCatherine stops.  And turns to see the distraught Young\n\tStargher.\n\n\t\t\t\tYOUNG STARGHER (CONT'D)\n\t\tDon't hurt him!\n\n\tShe spins around and sees not Stargher King, but MARTIN.\n\n\t\t\t\tYOUNG STARGHER (CONT'D)\n\t\tHe didn't mean it.  I was bad.\n\n\tDisturbed by the transformation, Catherine backs away.  Her\n\tvision blurs, the sound distorts.  And the earth cracks\n\taround Stargher King's ankles.\n\n\t\t\t\tYOUNG STARGHER (CONT'D)\n\t\tHe teached me a lesson.  I deserved it.\n\n\tFighting feelings of disorientation, she kneels before the\n\tchild and rests the knife on the ground.\n\n\t\t\t\tCATHERINE\n\t\tNo one deserves it, Carl.  No one.\n\n\tShe reaches out to him, but the child is JERKED into the air\n\tby Stargher King.  In one hand, the monster holds little\n\tCarl.  In the other - a KNIFE.  His face and chest red with\n\tcrimson, Stargher King fixes his eyes on Catherine with a\n\tpredator's stare.\n\n\t\t\t\tSTARGHER KING\n\t\tYer world.  My knife.\n\n\tStargher King raises the blade toward the boy's throat and -\n\tSNAP!  The strong arms of an adult Stargher breaks his arm at\n\tthe elbow.  Both the knife and boy are dropped to the ground\n\tas Stargher King YOWLS like a stuck pig, the good arm\n\tcradling the other.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\tMe god hurt!  Why you do that?  Why?!\n\n\t\t\t\tSTARGHER\n\t\tEnough.\n\n\tStargher King regards him with disgust.\n\n\t\t\t\tSTARGHER KING\n\t\tEnuff?!?!\n\n\tMARTIN STARGHER'S VOICE comes from the belly of the beast.\n\n\t\t\t\tSTARGHER\n\t\tI'll tell you what's enough...\n\n\tStargher and Stargher King square off.  The boy stands\n\tbetween them with the knife at his feet.\n\n\t\t\t\tCATHERINE\n\t\tCarl!\n\n\t\t\t\tSTARGHER KING\n\t\t\t(still speaking as Martin)\n\t\tShut up cunt.\n\t\t\t(to the boy)\n\t\tGive it here, worm...\n\n\tthe child picks up the blade and stands between them, looking\n\tto Catherine for guidance.\n\n\t\t\t\tSTARGHER KING (CONT'D)\n\t\t\t(as Martin)\n\t\tYou want a mommy?  Is that what you\n\t\twant?\n\n\tIn an almost dream-like motion, the child hands the blade to\n\tadult Stargher.\n\n\t\t\t\tSTARGHER\n\t\tEnough.\n\n\tAnd he DRIVES the thing into Stargher King's heart.  For a\n\tbrief moment, Martin's face is superimposed over Stargher\n\tKing's.  Stunned, he slumps and regards adult Stargher with\n\tsad, troubled eyes.\n\n\t\t\t\tMARTIN\n\t\t\t(as Stargher King)\n\t\tWhy?  What'd I do?...\n\n\tStargher TWISTS the handle of the blade and Martin/Stargher\n\tKing drops dead.   Dead.  Young Stargher smiles and hugs\n\tCatherine.\n\n\t\t\t\tYOUNG STARGHER\n\t\tTime to go 'way.\n\n\t\t\t\tCATHERINE\n\t\tCarl...?\n\n\tThe boy runs to adult Stargher who lifts the child into his\n\tarms and holds him close.\n\n\t\t\t\tYOUNG STARGHER\n\t\tBye.\n\n\tShe looks to adult Stargher and begins to understand.  He\n\tdescends into the pool, the boy resting his head on his\n\tshoulder.\n\n\t\t\t\tSTARGHER KING\n\t\tThank you, Catherine.  You did help me. \n\t\tMore than you'll ever know.\n\n\tMan and boy disappear beneath the water's surface.  Catherine\n\tstands and sees that Stargher King's body has vanished. \n\tShe walks to the shore and sees, deep underwater, Stargher\n\tand little Carl floating lifelessly like women in the cell. \n\tAnd FADE FROM VIEW.\n\n\t\t\t\tCATHERINE\n\t\tGoodbye Carl.\n\n\tShe presses the sensor in her hand.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tIN THE CONTROL ROOM, Miriam is shocked by what she sees on\n\tthe monitors and looks at Stargher.\n\n\t\t\t\tMIRIAM\n\t\tHe's in full arrest.\n\n\tCatherine quietly returns to consciousness and is\n\tautomatically lowered.  She pulls the mask from her face,\n\trises and opens the door.  Miriam races inside and\n\tdesperately attempts to revive Stargher.  But it's no use. \n\tAngry and stunned, she demands of Catherine.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tHelp me!\n\n\tBut Catherine chooses not to.  She knows Carl Stargher will\n\tnever return to the world of the living.\n\n\tINT. HELICOPTER - DAY\n\n\tThe chopper roars across the sky.  As they head northeast,\n\taway from the urban and toward the rural, Novak gazes out the\n\twindow, trying to stay focused, fighting any after-effects of\n\tthe drugs.  The pilot communicates via headset.\n\n\t\t\t\tPILOT\n\t\tAgent Novak?  Go ahead.\n\n\t\t\t\tNOVAK\n\t\tCole?\n\n\tEXT. STARGHER'S HOUSE - CONTINUOUS\n\n\tCole and a handful of other agents pour into waiting\n\tSuburbans.  (INTERCUT WITH NOVAK IN HELICOPTER).\n\n\t\t\t\tCOLE\n\t\tThe hoist was manufactured by Carver\n\t\tIndustrial Equipment in 1982.  Serial\n\t\tnumber 117-337J.  Purchased by a boat\n\t\tshop in Lake Havasu, but sold to\n\t\tLattimer's industrial Supply in 1992...\n\n\tINT. THE CELL - DAY\n\n\tThe water is near the ceiling.  Kicking her legs to keep\n\tafloat, Julia DIGS with the ring and we see she has created a\n\tgap between the light fixture housing and an unused PIPE\n\tleading to the surface.  She pushes, but can't get anything\n\tto move.  The opening will get no bigger.  Julia sucks the\n\tlast bit of oxygen and swims to the bottom of the cell. \n\tSearching for something, she finds a juice box and pulls out\n\tthe drinking straw.\n\n\tINT. CAMPBELL CENTER - LABORATORY\n\n\tShaken, but oddly transcendent, Catherine watches as\n\tStargher's body is wheeled out of the lab on a gurney.  She\n\tcomforts a whimpering Valentine and tells him...\n\n\t\t\t\tCATHERINE\n\t\tEverything's alright now, Valentine.  I\n\t\tpromise.\n\n\tINT. HELICOPTER\n\n\tNovak scans the topography of FARMS below, listening to a new\n\treport.\n\n\tINT. SUBURBAN - DAY\n\n\tCole is the passenger, on the radio to Novak, A DRIVER next\n\tto him, doing about a hundred down the Interstate, SIREN\n\tblaring.\n\n\t\t\t\tCOLE\n\t\tLattimer sold the hoist to a guy named\n\t\tBainbridge who tired to build a machine\n\t\tworks out near Delano.  Bainbridge ends\n\t\tup in bankruptcy court and the state\n\t\twinds up with the land - it's just\n\t\tsitting there.\n\n\tINTERCUT WITH NOVAK\n\n\t\t\t\tNOVAK\n\t\tDelano?\n\n\t\t\t\tCOLE\n\t\tYep.  And guess who they hired to seal\n\t\tup the place?\n\n\t\t\t\tNOVAK\n\t\tYou're kidding me.\n\n\t\t\t\tCOLE\n\t\tI never kid.  My wife hates it.  Says\n\t\tI'm too serious.\n\n\tNovak locates Delano on the map.\n\n\t\t\t\tNOVAK\n\t\tThe exact location, Cole.  Give it to\n\t\tme.\n\n\tThe pilot grins and pushes the copper to top speed.\n\n\tINT. THE CELL - DAY\n\n\tJulia is entirely underwater but alive.  She uses the straw\n\tto suck oxygen through the gap in the ceiling, but it's\n\tdifficult to tread water and her lungs are aching.\n\n\tINT. HELICOPTER\n\n\tNovak uses binoculars to scan farmland.  He searches.  And\n\tthere it is: The abandoned farmhouse!\n\n\t\t\t\tNOVAK\n\t\tTAKE IT DOWN!\n\n\tINT. THE CELL - DAY\n\n\tJulia tries to hold herself up by pressing her arms and legs\n\tagainst the walls, but as she does, the straw slips from her\n\tmouth.  She reaches for it, but only succeeds in pushing it\n\taway from her.  It heads for the drain.  And disappears.\n\n\tEXT. ABANDONED FARM HOUSE\n\n\tThe helicopter lands and Novak jumps out.  He knows this is\n\tthe place.  He runs into the barn, but there's nothing, no\n\tsign of her.  The pilot looks at him with a true sense of\n\tloss.\n\n\tINT. THE CELL - CONTINUOUS\n\n\tAs Julia desperately tires to find the straw through the tiny\n\tholes of the drain, we see for the first time an expression\n\twhich tells us she's given up.  THUMP-THUMP-THUMP.  The cell\n\tstarts to vibrate.  A repetitive noise WHUP-WHUP-WHUP - comes\n\tfrom above.  She swims to the top of the cell and POUNDS at\n\tthe ceiling.\n\n\tEXT. ABANDONED FARM HOUSE\n\n\tFighting exhaustion and the side effects of the drugs, Novak\n\tpushes on.  Think, Peter, think... His eyes find the WATER\n\tTANKS and he SHOUTS at the helicopter.\n\n\t\t\t\tNOVAK\n\t\tCut the engine!\n\n\tAs the motor dies, Novak listens and listens.  There it is. \n\tWater pipes beneath his feet.  And very faintly, a pounding. \n\tHe follows the sound, searching the earth.  It's clearer now,\n\tlouder.  Novak tosses aside rusted junk and the pilot runs to\n\tassist him.  Together, they expose the entrance to the\n\tunderground sanctuary.\n\n\tINT. THE CELL - OBSERVATION ROOM\n\n\tNovak drops to the floor below.  Instantly affected by the\n\tsimilarities and the differences to the idealized cell of\n\tStargher's mind, he feels another wave of dizziness, but\n\tpushes on.\n\n\tAnd is hit hard by the sight of DROWNED JULIA, her motionless\n\tbody floating past him.  HER EYES OPEN and bubbles drift from\n\ther nose and mouth.  Novak BANGS on the Plexiglas and calls\n\tto her.\n\n\t\t\t\tNOVAK\n\t\tJULIA!\n\n\tThe thick Plexiglass still remains, but she now can see him. \n\tNovak pulls his ID BADGE and smacks it against the glass. \n\n\t\t\t\tNOVAK (CONT'D)\n\t\tMOVE ASIDE!\n\n\tHe pulls his gun and takes aim.  Julia swims to the top of\n\tthe cell and presses herself against the ceiling.  BANG-BANG\n\tBANG-BANG-BANG-BANG.  Novak fires a circle of shots into the\n\tthick plastic.  Water slowly leaks, but the damn thing is\n\tstill solid.  He lifts the industrial VCR and RAMS it at the\n\tbullet-damaged section.  CRACK! CRASH!  WATER POURS FROM THE\n\tCELL.  Julia's body descends on the torrent of water.  Novak\n\treaches inside and pulls her to safety.  He's just about to\n\tgive her CPR when she coughs, sputters, and thirstily drinks\n\tin oxygen.  Holding her tightly, Novak sinks to the floor,\n\tthe water from the cell spilling everywhere.\n\n\tEXT. ABANDONED FARM HOUSE\n\n\tCole's Suburban leads a contingent of FBI vehicles and local\n\tpolice cars onto the property, sirens blaring.\n\n\tINT. THE CELL - DAY\n\n\tHearing the sirens, Novak relaxes.  For the first time in god\n\tknows how long, he relaxes.  And holds Julia Hickson as if\n\this life depended on it.\n\n\t\t\t\t\t\t\t\t\t\t FADE OUT.\n\n\tFADE IN:\n\n\tEXT. CATHERINE'S HOUSE - DAY\n\n\tTwo cars parked outside.  An old, quirky Volvo and a Land\n\tRover.\n\n\tINT. CATHERINE'S HOUSE - DAY\n\n\tAs a television plays THE WIZARD OF OZ, we find Catherine\n\twatching the movie from the couch, sitting up, drinking a cup\n\tof tea.  She looks rested and quite cute in gym shorts and a\n\tT-shirt, her CAT sleeping next to her.  IN THE KITCHEN,\n\tMiriam packs up her stethoscope and blood pressure monitor,\n\tmoves into the living room as Dorothy falls asleep in a field\n\tof poppies...\n\n\t\t\t\tMIRIAM\n\t\tI left the nutritional information on\n\t\tthe fridge door.  Read it.\n\n\tCatherine nods, but she's more interested in the movie. \n\tMiriam deposits prescription bottles onto a side table.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tI refilled the Zyprexa and Atavan...\n\n\t\t\t\tCATHERINE\n\t\tI don't need them anymore...\n\n\t\t\t\tMIRIAM\n\t\tI know.\n\n\tBut she leaves them just the same.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tI'll come by tomorrow after work.  With\n\t\tdinner.\n\n\t\t\t\tCATHERINE\n\t\tThanks Miriam.  Say hi to Henry and...\n\n\t\t\t\tMIRIAM\n\t\t...give a kiss to Edward.\n\n\t\t\t\tCATHERINE\n\t\t\t(overlapping)\n\t\tGive a kiss to Edward.\n\n\tThe women exchange smiles and Miriam exits.\n\n\tEXT. CATHERINE'S HOUSE\n\n\tAs Miriam walks to her Land Rover, she sees a government\n\tissue Suburban park on the street and Peter Novak exit.\n\n\t\t\t\tMIRIAM\n\t\tAgent Novak.\n\n\t\t\t\tNOVAK\n\t\tDr. Kent.\n\n\t\t\t\tMIRIAM\n\t\tYou're looking well.\n\n\t\t\t\tNOVAK\n\t\tThanks you.  Six weeks off does a body\n\t\tgood.\n\t\t\t(conspiratorially)\n\t\tI heard she got the approval to try the\n\t\treversal with Edward.\n\n\t\t\t\tMIRIAM\n\t\tThat's a secret.\n\n\t\t\t\tNOVAK\n\t\tFederal Bureau of Investigation, ma'am. \n\t\tWe know all, see all...\n\n\tNovak opens the rear compartment of the Suburban and we hear\n\tsomething moving inside.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tHow's the patient.\n\n\t\t\t\tMIRIAM\n\t\tAwaiting his arrival.\n\n\t\t\t\tNOVAK\n\t\tWhat about the cat?\n\n\t\t\t\tMIRIAM\n\t\tCompletely unaware.\n\n\tMiriam's pager BEEPS and she hurries to her car.\n\n\t\t\t\tMIRIAM (CONT'D)\n\t\tI've got to go.  Good luck.\n\n\tNovak smiles, waves goodbye, and reaches into the Suburban.\n\n\tINT. CATHERINE'S HOUSE\n\n\tAs Dorothy and her companions confront the Wizard, there's a\n\tKNOCK at the screen door and Catherine sees Novak waiting.\n\n\t\t\t\tNOVAK\n\t\tReady?\n\n\tCatherine cradles her cat.\n\n\t\t\t\tCATHERINE\n\t\tReady.\n\n\tHe opens the door and escorts a leashed VALENTINE into the\n\tliving room.  Catherine's cat squirms from her arms and hides\n\tunder the couch.\n\n\t\t\t\tNOVAK\n\t\tThat went well.\n\n\t\t\t\tCATHERINE\n\t\tGive her a minute.\n\t\t\t(smiles at the dog)\n\t\tHello, Valentine.\n\n\tNovak unleashes the albino Shepherd and he runs to Catherine,\n\tlicking her face, wagging his tail.\n\n\t\t\t\tNOVAK\n\t\tYou sure about this?\n\n\t\t\t\tCATHERINE\n\t\tAbsolutely.\n\t\t\t(calling for the cat)\n\t\tAbigail...\n\n\tValentine picks up the cat's scent and sniffs around the base\n\tof the sofa.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tI heard Julia and John got married.\n\n\t\t\t\tNOVAK\n\t\tYep.  Eloped.\n\n\t\t\t\tCATHERINE\n\t\tGood for them.\n\n\tValentine settles on the floor.  Slowly, Abigail's curiosity\n\tgets the best of her and she creeps out, sniffing the dog's\n\tnose.  Patient and sweet, Valentine lies still, allowing the\n\tcat to reach an acceptable level of comfort.\n\n\t\t\t\tNOVAK\n\t\tWell look at that.\n\n\t\t\t\tCATHERINE\n\t\tI told you.  You have to be optimistic. \n\t\tBelieve in them...\n\n\t\t\t\tNOVAK\n\t\tSo you say.\n\n\tAmazingly, Abigail brushes up against the dog and purrs.\n\n\t\t\t\tCATHERINE\n\t\tHe's mine?\n\n\t\t\t\tNOVAK\n\t\tAll yours.  My boss says it's one of the\n\t\tstrangest requests the Bureau's ever\n\t\thad.\n\n\tCatherine laughs.  She likes that.\n\n\t\t\t\tNOVAK (CONT'D)\n\t\tHe also says that until proven\n\t\tdifferently, Julia Hickson was found as\n\t\ta result of good old-fashioned detective\n\t\twork.\n\n\t\t\t\tCATHERINE\n\t\tIt doesn't matter...\n\n\t\t\t\tNOVAK\n\t\tI don't know.  I think it does.\n\t\t\t(genuine concern)\n\t\tYou know, Catherine... If you ever want\n\t\tto talk about it.  What happened to\n\t\tStargher.  That last time.\n\n\tIt's painfully clear the thought of it still troubles her.\n\n\t\t\t\tCATHERINE\n\t\tNot just yet.  Okay?\n\n\tNovak doesn't push it.  He just takes her hand and gives it a\n\tgentle squeeze.  The cat dashes into the kitchen and\n\tValentine follows.\n\n\t\t\t\tCATHERINE (CONT'D)\n\t\tThey're hungry.\n\n\t\t\t\tNOVAK\n\t\tI got it.\n\n\tHe moves into the kitchen.  In a moment of quiet\n\tintrospection, Catherine looks at the television screen, at\n\tDorothy accidentally hitting the wicked Witch with a bucket\n\tof water, causing her to melt.  And she looks away, unable to\n\twatch, disturbed by the image.  She turns to the kitchen and\n\tsees Novak feeding an appreciative dog and cat.  He rises and\n\treturns to the living room.\n\n\t\t\t\tCATHERINE\n\t\tThank you.\n\n\t\t\t\tNOVAK\n\t\tNo problem.\n\n\t\t\t\tCATHERINE\n\t\tNo.  Thank you.\n\n\tHe smiles and nods, gently resting his hand on her shoulder. \n\tCatherine shuts her eyes and leans toward him, comforted by\n\tsimple human touch...\n\n\t\t\t\t\t\t\t FADE TO BLACK.\n\n\n\n\n\n\n\nCell, The\nWriters :   Mark Protosevich\nGenres :   Horror  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:17.021537"}