{"title": "Charlie's Angels", "film_link": "/Movie Scripts/Charlie's Angels Script.html", "script_link": "/scripts/Charlie's-Angels.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Charlie's Angels Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Charlie's Angels Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.63 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Ed Solomon\" title=\"Scripts by Ed Solomon\">Ed Solomon</a><br/>  <a href=\"/writer.php?w=John August\" title=\"Scripts by John August\">John August</a><br/>  <a href=\"/writer.php?w=Zak Penn\" title=\"Scripts by Zak Penn\">Zak Penn</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/>\n<b>Script Date</b> : August 1999<br/>\n<br/>\n<a href=\"/scripts/Charlie's-Angels.html\">Read \"Charlie's Angels\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>           by\n\nEd Solomon and John August\n\n\n  current revisions by\n\n        Zak Penn\n\n\n\n\n<b>                             EARLY DRAFT\n</b>\n                             August 11, 1999\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99\n</b>\n\n<b>FADE IN:\n</b>\n\n<b>EXT. THE BIG BLUE SKY - DAY\n</b>\nA VIRGIN AIR 747 bursts through the clouds and levels off.\n\n<b>INT. VIRGIN AIR 747 - DAY\n</b>\nWe move through the FIRST CLASS CABIN. It's the regular\nmix of first class people: OLD MONEY in Gucci enjoying\nfreshly baked cookies, a MILLIONAIRE in jeans and a T-\nshirt, BUSINESS PEOPLE relaxing after a tough day, and...\n\n...a very nervous MAN.\n\nShifty-eyed. Alone in an aisle seat, the emergency row.\nWe hold on him for a moment, but not for too long. Then\nwe continue moving into --\n\n<b>THE COACH SECTION\n</b>\nStopping at the lavatory, the \"OCCUPIED\" sign switches to\n\"VACANT\" and...\n\n<b>JAMES EARL JONES\n</b>\n(or actually, a James Earl Jones type, who for ease of\ndescription, we'll simply refer to as James Earl Jones)\nsteps out of the restroom, in full African regalia:\nmulti-colored dashiki, mufti (it's a kind of hat), the\nworks. He heads up the aisle towards --\n\n<b>THE FIRST CLASS CABIN\n</b>\nWhere he is stopped by a --\n\n<b>                         FLIGHT ATTENDANT\n</b>           I'm sorry, sir. This cabin is\n           restricted to first cl...\n\nMr. Jones now removes a FIRST CLASS TICKET.\n\n<b>                         JAMES EARL JONES\n</b>           Is this what you're looking for?\n\nShe looks at it -- a little confused as to why he's just\nhanding it to her now -- but then she nods. As he passes:\n\n<b>                         FLIGHT ATTENDANT\n</b>           Oh, I'm sorry. Please. Is there\n           anything I can get you?\n\n<b>                         JAMES EARL JONES\n</b>           Scotch, blended. Straight.\n\nHe continues into the first class cabin and toward --\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              2.\n</b>\n<b>THE FIRST CLASS EMERGENCY ROOM\n</b>\nWhere he slides in past the nervous, shifty-eyed man (his\nname is PASQUAL) and sits by the window.\n\nAfter a moment, Pasqual quietly clears his throat and\nleans, slightly, towards Jones.\n\n<b>                        PASQUAL\n</b>                 (tentatively)\n          They say birds can't fly this high.\n\n<b>                        JAMES EARL JONES\n</b>          They say only angels can.\n\nNow Pasqual nods. Nervously begins to remove something\nfrom his pocket when they are interrupted by --\n\n<b>                        FLIGHT ATTENDANT\n</b>          Shall I pour your scotch?\n\n<b>                        JAMES EARL JONES\n</b>          No -- I'll take the bottle. Thank you.\n\nShe hands him the airplane-sized bottle -- he waves off\nthe glass. She shrugs, leaving...\n\nPasqual to resume what he was doing. Slowly, he removes\na roll of Certs. He looks to Jones -- \"Well? What about\nyour end of the bargain?\"\n\nFrom within his dashiki, Jones pulls out a black velvet\npouch. He hands it to Pasqual, who opens it to find\ndiamonds. A helluva lot of diamonds. Pasqual smiles.\n\nHe hands the roll of Certs to Jones. It's not breath\ncandy at all, but a tiny roll of explosives, with a tiny,\nhigh-tech triggering mechanism.\n\n<b>                        JAMES EARL JONES\n</b>          Ah, c-5. The most dangerous\n          explosive material ever invented.\n          Hard to believe that this little\n          contraption could blow up ten city\n          blocks.\n\n<b>                        PASQUAL\n</b>          Be careful with it, huh?\n\nBoth men smile.   Pasqual's very relieved that the deal is\ndone.\n\nThen suddenly, the lights blink out.\n\nPasqual looks around, nervous. But it's just the in-\nflight movie beginning. Clouds, and a woman holding a\ntorch.\n<b>                                             (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              3.\n</b>\n<b>CONTINUED:\n</b>\nColumbia Pictures presents... David Spade and Adam\nSandler in \"BOSOM BUDDIES: THE MOVIE.\"\n\nJames Earl Jones shakes his head, rolls his eyes.\n\n<b>                           JAMES EARL JONES\n</b>             Another movie from an old TV show?\n\n<b>                           PASQUAL\n</b>             Well, what're you gonna do?\n\n<b>                               JAMES EARL JONES\n</b>             Walk out.\n\n<b>                           PASQUAL\n</b>             That's very funny.\n\nBut James Earl Jones is dead serious.\n\n<b>                               JAMES EARL JONES\n</b>             No.   It isn't.\n\nJones grabs Pascal in a headlock and turns toward the\nback of the plane, shouting:\n\n<b>                            JAMES EARL JONES (CONT'D)\n</b><b>             EVERYONE!   FASTEN YOUR SEAT BELTS!\n</b>\nNow Jones does the unthinkable. Holding Pasqual tight,\nhe yanks open the emergency door release.\n\nWith a RUSH, the cabin decompresses.\n\nPanic erupts as air, paper and everything not belted in\nscreams out of the open door, including --\n\n<b>EXT. THE BIG BLUE SKY - FALLING AWAY FROM THE 747 - DAY\n</b>\n-- James Earl Jones, still holding Pasqual in a bear hug.\nThey plummet, wind violently tearing at them. Pasqual's\nfrantic SCREAMS doppler quite nicely.\n\n<b>DROPPING WITH THEM\n</b>\nThey continue to fall, gaining speed. Pasqual is\nterrified, but Jones doesn't seem worried. In fact,\ncasually, he glances at his watch, and then looks --\n\n<b>FAR BELOW THEM - ACROSS THE SKY\n</b>\nAt the tiny black speck gradually grows larger in the\ndistance...\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               4.\n</b>\n<b>CLOSER - ON THAT BLACK SPECK\n</b>\nIt's a jet helicopter. Its door opens, and now a SKYDIVER leaps\nout, helmet down, arms back, streaking across the\nsky in aerodynamic perfection, heading directly towards\n\n<b>JONES AND PASQUAL\n</b>\nwho are still plummeting toward the earth at terminal\nvelocity. Jones begins to let go of Pasqual, who SCREAMS\nand tries to clutch onto him, desperate.\n\n<b>                        JAMES EARL JONES\n</b>                 (over the rushing wind)\n<b>          PULL YOURSELF TOGETHER. WE HAVE\n</b><b>          COMPANY.\n</b><b>                        PASQUAL\n</b><b>          WHAT?\n</b>\nSuddenly -- WHOMMPPPH!! -- the skydiver spread-eagles,\nstopping the wild dive directly behind Pasqual, and\nimmediately binds his arms and straps a parachute on him.\n\nAll three are still free-falling.\n\nJames Earl Jones nods at the Skydiver who, even under the\nhelmet and goggles, is clearly a beautiful woman.\n\nMeet ALEXANDRA \"ALEX\" MUNDAY, one of Charlie's Angels.\nShe's a sultry bombshell -- a classic femme fatale --\nonly she's playing for the good guys.\n\nShe gives James Earl Jones a wink, then jerks Pasqual's\nrip cord and -- WHOOMPH. Pasqual's chute deploys. He\nflies upward, leaving --\n\nAlex and James Earl Jones, both still falling.    Below the\nocean screams up at them. Not much time left.\n\nJames Earl Jones pulls his belt -- and his mufti flies\nup. It's actually a tiny drogue chute, deploying his\nentire dashiki. His outfit hides a parachute rig.\n\nAlex pulls her own rip cord and -- WHOOMPH -- her chute\nunfurls, and now...\n\nAlex and James Earl Jones gently float towards --\n\n<b>EXT. THE BIG BLUE SEA - DAY\n</b>\nA cigarette boat floats through the choppy water, a\ngorgeous young woman expertly throttling up the growling\n<b>V-8.\n</b>\nSay hello to NATALIE THOMPSON, Charlie's second angel.\nAt a glance, she's the brainy-shy girl next door.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 5.\n</b>\n<b>CONTINUED:\n</b>\nBut put her behind the wheel of any vehicle, and she's\nunstoppable.\n\nNatalie glances ahead, maneuvering the boat perfectly under\nAlex, who drops on deck. Alex gathers her chute, then whips off\nher helmet to give her cascading mane a wild shake.\n\nHere comes James Earl Jones. Natalie guns the boat\nunderneath...a perfect catch. Alex helps him with his\ndashiki-chute, and then all three look up...\n\nHere comes Pasqual. Natalie whips the boat around,\ncatching him as he helplessly drops into the seats, still\nbound, still scared out of his wits. He gapes wild-eyed\nat the two Angels, then whirls on James Earl Jones.\n\n<b>                           PASQUAL\n</b>             You crazy bastard!\n\n<b>                           JAMES EARL JONES\n</b>             I think you mean crazy bitch.\n\nWith that, James Earl Jones reaches up and pulls his face\noff. Latex rips free, and standing there (without his\ndashiki, James Earl Jones has a great figure) is...\n\n... stunningly beautiful DYLAN SANDERS, angel number\nthree. She's the wild one.\n\nPasqual's jaw drops as Dylan shakes her hair free, then\nreaches in her mouth --\n\n<b>                           DYLAN\n</b>                    (still with James Earl Jones' voice)\n             Don't need this anymore.\n\n-- and extracts a voice-modifying chip.\n\n<b>                           DYLAN (CONT'D)\n</b>                    (now in her real voice)\n             But I sure could use this.\n\nAnd she pulls from her pocket the airplane-size bottle of\nJohnnie Walker Black. She twists it open and downs it.\n\n<b>                           DYLAN (CONT'D)\n</b>             Damn I hate to fly.\n\n<b>EXT. BEACH DOCK - DAY\n</b>\nNow, MEN IN \"FBI\" WINDBREAKERS haul Pasqual away, two of\nthem carefully handling the certs-explosive. A harmless\nfellow pushes his way past them and onto the dock.\n\nIt's JOHN BOSLEY, Charlie's lieutenant.\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 6.\n</b>\n<b>CONTINUED:\n</b>\nHe reaches the boat, which Natalie ties off while Alex\nand Dylan neatly fold their parachutes.\n\n<b>                           BOSLEY\n</b>             Well, Angels, the experimental\n             explosives are back in the hands of\n             the government, and the free world\n             can breathe just a lit-tle bit\n             easier tonight, thanks to you three.\n\nAlex, Natalie and Dylan stroll from the dock onto the sand,\neach starting to unzip/unbutton/unsnap their action gear and\nhand it to Bosley as they continue walking.\n\n<b>                           NATALIE\n</b>             And thanks to you, too, Bos.\n\n<b>                           ALEX\n</b>             We couldn't have redirected the\n             flight path without your help.\n\nBosley puffs, proud. He speaks over the ever-growing\npile of chutes, body suits, goggles, the dashiki...\n\n<b>                           BOSLEY\n</b>             Nothing a little teamwork can't do.\n             At least, that's what Charlie's\n             always telling us, right ladies?\n\n<b>                           DYLAN\n</b>             Charlie will be joining us, won't he?\n\n<b>                           BOSLEY\n</b>             He sends his regrets. But he\n             wanted you to know that dinner is\n             on him, so feel free to celebrate.\n\nBy now, the Angels have stripped off all of their\nequipment, revealing eye-popping evening gowns.\n\n<b>                           ALEX\n</b>             If it's on Charlie, we will.\n\nThe Angels share a laugh as they arrive in their sassy\nduds at a private beach club, where a WAITER greets them\nwith a tray of champagne flutes.\n\nThey each take a glass, turn to each other and raise\nthem. Another Angels Mystery... Case Closed.\n\nFREEZE FRAME.    And the TITLE SEQUENCE BEGINS...\n\n<b>                           CHARLIE (V.O.)\n</b>             Once upon a time...\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               7.\n</b>\n<b>CONTINUED:\n</b>\nTHREE FOURTH GRADE SCHOOL PHOTOS FILL THE FRAME, side by\nside by side. These are three very different girls.\n\nNATALIE, with a page-boy cut and wearing a Catholic\nschoolgirl's uniform, sports glasses and braces; a bit\nawkward and gangly, even shy.\n\nALEX, formally dressed with perfect pig-tails, is\nsophisticated and self-possessed; a class act, even at ten.\n\nDYLAN, wild blond hair and faded T-shirt, has a jaded,\nstreet-wise smirk; even at this young age, her isolation\nand disillusionment are masked by seeming confidence.\n\n<b>                           CHARLIE (CONT'D)\n</b>             ... there were three very\n             different little girls.\n\nThe triptych remains on screen.    Now it shifts into:\n\n<b>VIDEO TAPE - THE THREE GIRLS (STILL IN TRIPTYCH)\n</b>\nNow TEENAGERS, on HOME VIDEO.\n\nNATALIE, working the A-V equipment at school, hides her\nface in embarrassment, uncomfortable with the camera.\n<b>FREEZE.\n</b>\nALEX, in riding gear, accepting her steeple-chase trophy.\nShe knows where to look for the camera. FREEZE.\n\nDYLAN, smoking with her tough-girl friends in the girls'\nroom of her reform school, is caught on camera. She\nflips it off. FREEZE.\n\n<b>                           CHARLIE (CONT'D)\n</b>             Who grew up into three very\n             different women.\n\n<b>TRIPTYCH CONTINUES\n</b>\nThey're all WOMEN now, in their early twenties.\n\nNATALIE, a research fellow at MIT (and beautiful, but not\nflaunting it) demonstrates a chess-playing computer\nprogram to a room of impressed advisors.\n\nALEX, valedictorian at Oxford, passionately delivers her\naddress to a crowd of rapt students, faculty and parents.\n\nDYLAN, in leather and a helmet, steps off a Harley. She\nsees a punk with a mohawk slapping around his girlfriend.\nShe decks him, then enters the back door of a seedy punk bar.\n\n<b>                           CHARLIE (CONT'D)\n</b>             With three things in common...\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              8.\n</b>\n<b>TRIPTYCH ENDS\n</b>\nWith photographs again. The women, as they are now:\nNatalie, Alex, Dylan. All gorgeous, all self-assured.\n\n<b>                         CHARLIE (CONT'D)\n</b>           They're brilliant. They're\n           beautiful. And they work for me.\n\nNow, FIREBALL EXPLOSIONS completely fill the screen.\n\n<b>                         CHARLIE (CONT'D)\n</b>           My name is Charlie.\n\nANGEL SILHOUETTES appear, in flames.    New MUSIC kicks in.\n\n<b>                        \"CHARLIE'S ANGELS\"\n</b>\n...And a new title sequence takes over:\n\n<b>VARIOUS SHOTS:   MONTAGE (OVER MUSIC)\n</b>\nCredits continue as we watch the Angels in action (from,\npresumably, previous adventures...)\n\n-- A microscope-peering Natalie cuts a ruby, drops it in\na laser housing, shoots a red beam.\n\n--   Dylan, wielding kendo sticks, spars with two Yakzuza.\n\n-- Alex side-kicks two baddies, spins, drops a third.\nZOOM BACK: she is at the Parthenon.\n\n-- A motocross race. Natalie digs in for the finish,\nattacking the last jump with gusto.\n\n-- Dylan, in traditional Islamic robes, finds a secret\nswitch. She pushes back a bookcase to reveal secret stairs.\n\n-- At a ballroom dance competition, Alex wows the crowd\nwhile keeping her eye on a nefarious couple.\n\n-- Bosley, as \"Luka, the Bad Ass Pimp,\" bitch-slaps a\ncouple of \"ho's\" -- actually Dylan and Alex -- then winks\nat them as unsuspecting drug dealers back off, scared.\n\n--   Natalie bites into a messy hot-dog, has to just laugh.\n\n-- The three angels elbow their way through a roller-\nderby match.\n\n-- In orange prison jumpsuits, Alex and Dylan work in\nfemale chain-gang.\n\n-- Window-washer Natalie peers into a skyscraper office,\nsurreptitiously photographing the meeting inside.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              9.\n</b>\n<b>CONTINUED:\n</b>\n-- On an Italian street, the three Angels buy a paper,\ngrin at the headline, \"Mystery Women Save European\nUnion.\" As they high-five, Dylan's cone of gelato drops\nto the sidewalk. The Angels look at it, look at each\nother...and just have to laugh.\n\n<b>TITLE SEQUENCE ENDS.\n</b>\nOVER BLACK we hear a DIGITAL RING...\n\n<b>INT. TINY HOUSEBOAT BEDROOM - DAY\n</b>\nCLOSE ON Dylan as she wakes up in a tangle of ugly\nsheets, disoriented and a bit hungover. She hears the\nRINGING -- where is it coming from? Why is it drilling\ninto her head?\n\nChecking the floor, she finds her jeans. Digs in the\npocket to find her cell phone. Answering...\n\n<b>                            DYLAN\n</b>             Hi.\n                     (recognizing voice)\n             Hi.   Okay. I'll be right in.\n\nShe clicks the phone off, then starts looking around.\nWhere the fuck is she?\n\nFrom the next room, we hear a male VOICE singing \"My\nSharona.\" She checks under the sheets. Oh God. She's\nnaked. She pulls her shirt from the floor, puts it on.\nClosing her eyes, she prays...\n\n<b>                            DYLAN (CONT'D)\n</b>             Not him.   Not him, not him, not him.\n\n<b>                           THE VOICE\n</b>             'Morning starfish.\n\n<b>                            DYLAN\n</b>             Oh God no.\n\nAt the door, skinny shirtless CHAD holds a skillet of eggs.\n\n<b>                            CHAD\n</b>             Hungry?\n\n<b>EXT. CHAD'S CRAPPY BOAT - DAY\n</b>\nBlinded by the daylight, Dylan emerges from below,\nrelieved to see the boat is docked. Chad follows her\noutside, pleading...\n<b>                         CHAD\n</b>          C'mon Dylan. You + Me. It's\n          magic.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   10.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           DYLAN\n</b>             It's a mistake. A horrible,\n             horrible mistake.\n\nShe jumps onto the dock.\n\n<b>                           CHAD\n</b>             Then how come we keep getting back\n             together? It's fate.\n\nDylan just keeps walking.\n\n<b>                           CHAD\n</b>                    (yelling after)\n             Is it because I live on a boat?\n\n<b>                                                  WHIP TO:\n</b>\n<b>CLOSEUP - MAN'S FACE\n</b>\nThis is Jason Gibbons, handsome, action-movie stud.       He's\nconcentrating fiercely.\n\n<b>                           ALEX (O.S.)\n</b>             If you don't defuse this bomb,\n             Logan, L.A.'s going to be a new\n             underwater attraction.\n\nA bead of sweat drops down Jason's face.\n\n<b>                           JASON\n</b>             Get off my back, Sanchez.   I know\n             what I'm doing.\n\nREVEAL ALEX, her face right next to his.\n\n<b>                            ALEX\n</b>             Which wire?   The red one or the blue one?\n\n<b>                           JASON\n</b>             Marix has a thing for red. Red\n             cars, red boats, red-headed hookers.\n\n<b>                           ALEX\n</b>             So the red one.\n\n<b>                           JASON\n</b>             That's why I'm gonna say blue.\n\nHe makes a \"snip\" motion.     They both breathe a sigh of relief.\n\n<b>                           ALEX\n</b>             You saved the world again, Logan.\n\nShe leans forward, closer and closer, right in his face.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                      11.\n</b>\n<b>CONTINUED:\n</b>\n<b>                              JASON\n</b>             That's my job.\n\nAlex kisses him. It's a damn good kiss.          Jason's into\nit, but pulls away for a second.\n\n<b>                           JASON (CONT'D)\n</b>             I don't think Sanchez would kiss\n             me. He's a forty-year-old man.\n\nPull back to reveal...\n\nALEX and JASON are in a fully macked out Airstream,\nsitting on a bed, leaning over an open screenplay. We\ncan tell from our surroundings that Jason is a big deal\nHollywood action star, and this trailer is his home away\nfrom home.\n\nShe licks the bridge of his nose, then kisses him again.\n\n<b>                           ALEX\n</b>             Let's have it rewritten.\n\nAs she smiLes, a cell phone RINGS. Both Alex and Jason\nreach for their phones. It's hers.\n\n<b>                              ALEX (CONT'D)\n</b>             Hello?\n\n<b>EXT. JASON'S AIRSTREAM - DAY\n</b>\nJason stands in the doorway in his robe as Alex tosses\nher stuff in the back of a very excellent car.\n\n<b>                           JASON\n</b>             So when you coming back?\n\n<b>                            ALEX\n</b>             Not sure.   Whenever I can.      I'll\n             call you.\n\n<b>                           JASON\n</b>             Oh, great, that's helpful.\n                    (watching her prepare to go)\n             I don't get it, what kind of\n             executive assistant is on 24 hour call?\n\n<b>                           ALEX\n</b>             A very good one.\n\n<b>                           JASON\n</b>             You ask me, your boss is an asshole.\n                    (beat)\n             When do I get to meet this Charlie\n             guy, anyway?\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  12.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           ALEX\n</b>             Charlie's not very social.\n\n<b>                           JASON\n</b>             Yeah, well I think you should\n             quit.\n\n<b>                           ALEX\n</b>             Charlie needs me.\n\n<b>                            JASON\n</b>             I need you.\n\nAlex looks back -- that was more personally revealing\nthan she expected.\n\nA P.A. comes up next to Jason.\n\n<b>                            P.A.\n</b>             Mr. Gibbons?   We're ready for you\n             on the set.\n\nJason nods, then back to Alex.\n\n<b>                           JASON\n</b>             I gotta go save the world.\n\nAlex smiles at the irony of that.\n\n<b>                            ALEX\n</b>             My hero.\n\nShe blows him a kiss and speeds off.\n\n<b>EXT. BEACH APARTMENT WALKWAY - DAY\n</b>\nNatalie KNOCKS on the door to 113.      A beat later, the\ndoor swings open to reveal BOB.\n\nNatalie SCREAMS in astonishment.\n\n<b>                            BOB\n</b>                     (freaked)\n             What!   Natalie, what?\n\n<b>                           NATALIE\n</b>             I thought you were dead.\n\nShe pushes past him.\n\n<b>INT. BOB'S APARTMENT - DAY\n</b>\nNatalie makes a beeline for his keys on the table.\nStarts taking one key off the ring.\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                     13.\n</b>\n<b>CONTINUED:\n</b><b>                           NATALIE\n</b>             I thought the police might be here.\n             Or your neighbors. Or your parents,\n             here to identify your remains.\n\nHe has no idea what she's talking about.         She goes to\n\n<b>THE BATHROOM,\n</b>\nwhere she retrieves a toothbrush.\n\n<b>                           NATALIE (CONT'D)\n</b>             I saw your car was here, so I knew\n             you weren't carjacked and brutally\n             beaten, left to die on the highway.\n\nHer cell phone RINGS.\n\n<b>                              BOB\n</b>             I'm not...\n\nShe holds up a finger, just a sec.\n\n<b>                           NATALIE\n</b>                    (answering phone)\n             Hello. Absolutely. I'll be right in.\n\nShe hangs up.\n<b>                              BOB\n</b>             I'm not dead.\n\n<b>                           NATALIE\n</b>             But you can understand why I\n             thought so. You missed our date\n             last night. You didn't call or\n             anything. I was just sitting\n             there by myself.\n\nANGLE ON Bob.    What can he say?\n\n<b>                           NATALIE (CONT'D)\n</b>             I can tolerate a lot, but punctuality\n             and attendance, those rank very high\n             in my list of dating priorities.\n\n<b>                              BOB\n</b>             I can explain.\n\nBehind Natalie, a door opens.          A topless BLONDE looks out.\n\n<b>                              BLONDE\n</b>             Bobby?\n\n<b>                            BOB\n</b>                    (to Natalie)\n             I can explain.\n<b>                                                      (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   14.\n</b>\n<b>CONTINUED:\n</b>\nBehind the Blonde, ISAAC HAYES looks out.      He's also topless.\n\n<b>                             ISAAC HAYES\n</b>             Bobby?\n\n<b>                             BOB\n</b>             Damn.\n\nBeyond weirded out, Natalie just leaves.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. SUNSET BOULEVARD - DAY\n</b>\nPassing cars reveal the one and only CHARLES TOWNSEND\nDETECTIVE AGENCY. That's what the sign says.\n\n<b>INT. CHARLES TOWNSEND DETECTIVE AGENCY - DAY\n</b>\nIn foreground, a blender WHIRRS. Still hungover, Dylan\ncringes from the sound. Natalie pours out three fruit\nsmoothies for the angels.\n\n<b>                           NATALIE\n</b>             Just once, I want to date a normal\n             man, without a wife, or a drug\n             addiction, or bondage issues.\n\n<b>                             DYLAN\n</b>             Here here.\n\nShe and Natalie toast.       Alex is only half-in. Off their look...\n<b>                              ALEX\n</b>             What?    I've got a great relationship.\n\n<b>                           DYLAN\n</b>             Your boyfriend thinks you're a\n             secretary.\n\n<b>                           ALEX\n</b>             That way, he doesn't ask about my work.\n\nBosley walks in with a folder.       He eyes their drinks.\n\n<b>                           NATALIE\n</b>             I'm sorry, Bosley. I only made\n             enough for three.\n\n<b>                           BOSLEY\n</b>             No, that's...That's okay.\n\nIt's not okay, but that's our Bosley. He takes his seat\nbehind his desk. Now we see the biggest addition to the\noffice, the Angels Wall of Fame.\n<b>                                             (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              15.\n</b>\n<b>CONTINUED:\n</b>\nPictures of every angel, from the original cast members to some\nfictitious ones we've never seen before. The rest of the office\nis exactly as we remember it, right down to the\n\n<b>SPEAKERPHONE.\n</b><b>                           CHARLIE'S VOICE\n</b>             Good morning, Angels.\n\n<b>                           ANGELS\n</b>                    (sing-songy)\n             Good morning, Charlie.\n\nThe angels take a seat on couches and chairs.\n\n<b>                           CHARLIE'S VOICE\n</b>             I'm sorry to call you back from\n             vacation, but we've got a case\n             that just can't wait.\n\nAs he's talking, the far blinds close themselves. A white\nscreen lowers from the ceiling, ready to catch the\nprojected VIDEO:\n\nA handsome MAN IN HIS 20'S in a CNN profile. The sound is\nmuted, be we see him attending a gala; in an office surrounded\nby computers; rock climbing; smiling in a sit-down interview.\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             Meet Eric Knox.\n\n<b>                           NATALIE\n</b>             He's cute.\n\n<b>                           BOSLEY\n</b>             He is.\n\nOops, did Bosley say that out loud?\n\n<b>                           CHARLIE'S VOICE\n</b>             He's 28-years old, and in three days\n             he'll be a billionaire, when his\n             company, Knox Technologies, goes public.\n\n<b>                           DYLAN\n</b>             It's good to be him.\n\n<b>                           ALEX\n</b>             So what's the catch?\n\n<b>                           CHARLIE'S VOICE\n</b>             Last night, Knox was kidnapped\n             from his own office.\n\nON VIDEO: Surveillance camera footage of a parking\ngarage. Two MEN IN HOODS shove Knox into black car.\n<b>                                             (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               16.\n</b>\n<b>CONTINUED:\n</b><b>                           NATALIE\n</b>             Any ransom?\n\n<b>                           CHARLIE'S VOICE\n</b>             No one's heard a thing from the\n             kidnappers.\n\n<b>                           A WOMAN'S VOICE\n</b>             They don't want money. They just\n             want to sink our company.\n\nA striking WOMAN IN A SUIT stands in the doorway.\n\n<b>                           CHARLIE'S VOICE\n</b>             Angels, meet Vivian Wu, vice\n             president of finance for Knox\n             Technologies. She's hired us to\n             find Knox.\n\n<b>                           VIVIAN WU\n</b>                    (entering)\n             The initial public offering is in\n             three days. If we don't get Mr.\n             Knox back, or if word gets out\n             that he's missing, the company\n             stands to lose a billion dollars.\n\nShe seems to direct this next sentence right to Natalie.\n\n<b>                           VIVIAN WU (CONT'D)\n</b>             We need your help.\n\n<b>                           ALEX\n</b>             Charlie, where do we start?\n\n<b>                           CHARLIE'S VOICE\n</b>             Alex, I want you and Bosley to\n             stake out Roger Corwin.\n\nBosley is excited to hear his name mentioned.\n\nON VIDEO: Roger Corwin. He's an unpleasant-looking man,\nwho's even nastier when he tries to smile. We see logos\nfor his company, Red Star Systems\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             For the past year, he's been\n             trying to buy Knox's company and\n             their new browser software. Knox\n             refused to sell. His company, Red\n             Start Systems, has the most to\n             gain from Knox's disappearance.\n\n<b>                           ALEX\n</b>             Kidnap the founder and you sink\n             the company.\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   17.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           CHARLIE'S VOICE\n</b>             Exactly, Alex. Let's keep our eyes\n             on Mr. Corwin, Angels. If Knox is\n             still alive, Corwin might lead us\n             to him.\n\n<b>                            DYLAN\n</b>             We're on it.\n\n<b>                           NATALIE\n</b>             Any chance you can join us,\n             Charlie?\n\n<b>                                                  CUT TO:\n</b>\n<b>CHARLIE'S POV\n</b>\nWe see his chalky fingers grabbing into a hand hold.\nWe're halfway up the face of Yosemite's El Capitan -- the\nground is hundreds of feet below.\n\n<b>                           CHARLIE (O.S.)\n</b>             I'd love to, angels, but I've got\n             my hands full this morning.\n\nTwo beautiful and buxomly CLIMBING BUDDIES smile at him.\n\n<b>                                                  WIPE TO:\n</b>\n<b>EXT. PALM SPRINGS SPA - DAY\n</b>\nEstablishing...\n\n<b>EXT. SPA DECK / OUTSIDE WALKWAY - DAY\n</b>\nBuilt into the Palm Springs Hills, this very exclusive\nspa has a fantastic view of the desert.\n\nDressed in a crisp spa uniform, Alex has a sidebar with a\nwhite-robed Bosley. She shows him a tiny electronic\ndevice shaped like a bullet.\n\n<b>                           ALEX\n</b>             This is a transmitter. I'll be\n             able to hear everything you say.\n\n<b>                           BOSLEY\n</b>             Where do I hide it?\n                    (leaning close)\n             I'll be nude.\n\nAlex takes a plastic cup, drops the transmitter into it.\nCovers it over with ice chips from a nearby bucket.\n\nBosley nods, clever.\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  18.\n</b>\n<b>CONTINUED:\n</b><b>                           ALEX\n</b>             Try to get Corwin to talk about\n             the industry, Knox, anything.\n\n<b>                            BOSLEY\n</b>             Understood.\n\nShe points him in the direction of the men's spa.    But he's\nfrozen with excitement.\n\n<b>                           BOSLEY (CONT'D)\n</b>             I'm going undercover.\n\n<b>                            ALEX\n</b>             I know.   You'll do great.\n\n<b>INT. MEN'S STEAM ROOM - DAY\n</b>\nA burst of steam clears, revealing Bosley. He waddles forward\nin his shower clogs, which SQUISH with every step. He's wearing\ntwo towels: one around his waist, and a second around his\nchest.\n\nAs more steam dissipates, we see there    are SEVEN MEN sitting on\nthe risers. Six are gorgeous, ranging     from Calvin Klein models\nto Marlboro Men. Bosley looks around,     taking a keen interest.\nMaybe he's checking them out, maybe he    isn't. We just don't\nknow.\n\nThe seventh man is ROGER CORWIN, who we recognize from\nthe videotape. He's leaning forward, a gold chain\ndangling. It's beside him that Bosley takes a seat.\n\nHe sets the ice cup -- and the transmitter -- in a\nstrategic location.\n\nNoticing that none of the other men have towels around\ntheir bosoms, Bosley nervously undoes his, revealing skin\nthe color of cooked salmon. He fluffs up his sparse chest hair,\nthen decides to smush it back down.\n\nHe tries to make eye contact with Corwin, working way too\nhard. Annoyed, Corwin finally looks over.\n\n<b>                           BOSLEY\n</b>             Hot in here, isn't it?\n\nCorwin shakes his head, idiot.\n\n<b>                           BOSLEY (CONT'D)\n</b>             Just came here to unwind a little.\n             Business these days is go go go. My\n             company just held an initial pubic offering.\n\nYes, he said \"pubic.\" He's about to correct himself when\na very hot guy across from him moves his towel to wipe off\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                19.\n</b>\n<b>CONTINUED:\n</b>\nsome sweat. We don't see the promised land, but Bosley\ndoes. It flusters him.\n\nHe sees another guy eating ice chips. Good idea.      Bosley\ndoes the same. He eats another. And another.\n\n<b>                           BOSLEY (CONT'D)\n</b>                    (re-composed)\n             So, what business are you in?\n\nCorwin seems wary, but Bosley is clearly harmless.\n\n<b>                            CORWIN\n</b>             Computers.   Software.\n\n<b>                           BOSLEY\n</b>             Computers, hunh? What do you know\n             about this new browser from Knox\n             Technologies?\n\nCorwin bristles at the mention.\n\n<b>                           BOSLEY (CONT'D)\n</b>             Word on the street is, once they\n             raise capital, they'll rule the\n             industry.\n\n<b>                           CORWIN\n</b>             I don't see that happening.\n\n<b>                            BOSLEY\n</b>             Really?   Why not?\n\nThe door opens, a rush of steam. ADONIS HIMSELF enters.\nPicking a seat behind Bosley, he pulls off his towel as\nhe passes. We just see a bit of ass, but Bosley is face-\nto-face with the babymaker.\n\nOne ice chip is not going to do it.    He chugs the rest of\nhis cup, including\n\n<b>THE TRANSMITTER\n</b>\nwhich BLEEPS.    Corwin and others look over.    What the hell\nwas that?\n\nThe device still in his mouth, Bosley has no choice but to\nsmile and swallow. His eyes go wide as he chokes it down.\n\nCorwin gets up to leave.\n\n<b>                           BOSLEY (CONT'D)\n</b>             Nice talking with you.\n\nAnother BLEEP. He shuts his mouth tight. Smiles. Rubs\nhis chest a bit, trying to get the transmitter down.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               20.\n</b>\n<b>INT. PRIVATE MASSAGE ROOM - DAY\n</b>\nCorwin walks into a lushly-appointed private massage\nroom. A masseuse dressed in a skimpy robe, her back to\nus, oils up her hands sensuously near the window.\n\n<b>                        MASSEUSE\n</b>                 (German accent)\n          Please to take off clothes, Mr. Corvin.\n\nCorwin gets under the sheet, on his stomach. The\nmasseuse turns around, and now we see that it's Alex.\n\nAlex starts to work on his back. She is clearly an\nexpert at this. This is a legit place, but there's\nsomething undeniably sensual about the whole experience.\n\n<b>                        ALEX\n</b>          You're carrying a lot of tension\n          along ze fourth und fifth vertebrae.\n          Let me see if I can vork it out.\n\nUnder the table, we look up to see Corwin's face in the\ncradle. He's in a tortured rapture.\n\nAlex works along Corwin's back and neck.   She pulls his\narms out to the side.\n\n<b>                        ALEX (CONT'D)\n</b>          The human body is an amazing instrument.\n          Just by activating ze right energy\n          points, you can improve ze circulation,\n          alleviate pain, or...\n\nCorwin goes limp.\n\n<b>                        ALEX (CONT'D)\n</b>                 (losing the accent)\n          ... knock a man unconscious.\n\nConfident Corwin is out cold, she slides the key strap\noff his wrist.\n\n<b>INT. EXECUTIVE LOCKER ROOM - DAY\n</b>\nMaking sure she's alone, Alex uses the key to open a\nlocker. She carefully sorts through Corwin's things,\nfinding his Palm Pilot organizer. She clicks it into a\nspecial device, which BLIPS as it downloads all his\ninformation.\n\nPutting the Palm Pilot away, she shuts the locker.\n\n<b>INT. MASSAGE ROOM - DAY\n</b>\nCLOSE ON Corwin as he suddenly wakes up, disoriented.\n\n<b>                                               (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   21.\n</b>\n<b>CONTINUED:\n</b>\nJust when we think Alex's plan has failed, we TILT UP to\nsee Alex is right there. She's massaging him.\n\n<b>                           ALEX\n</b>             You must have dozed off.\n\nA beat. Yeah, he must have.     A patented ANGELS FLIP\nleads us to...\n\n<b>                                                   CUT TO:\n</b>\n<b>INT. NATALIE'S EXCELLENT CONVERTIBLE - DAY\n</b>\nThe Angels are all in the car together, cruising down\nSunset Boulevard. Dylan drives, Alex in the passenger seat,\nNatalie in the back seat with her computer on her lap.\n\n<b>                           NATALIE\n</b>             Can you not drive my car so fast,\n             Dyl? I'm trying to type.\n\n<b>                           DYLAN\n</b>                    (to Alex, under her breath)\n             I drive too fast. Look who's talking.\n\nShe pulls into an In N' Out Burger, right up to the drive thru.\n\n<b>                           DYLAN (CONT'D)\n</b>             Three double doubles, animal style.\n             Fries. Three chocolate shakes.\n\nWhile they wait for their order, Natalie punches\nsomething up on her computer.\n\n<b>                           NATALIE\n</b>             Here's Corwin's itinerary.\n\nONSCREEN -- we see a list of all Corwin's plans for the\nnext week. Two events in particular stand out:\n\n<b>     TUESDAY NIGHT -- INVESTOR RECEPTION, BILTMORE HOTEL\n</b>\n<b>     THURSDAY -- SAN DIEGO RACEWAY\n</b>\nDylan glances over the schedule.\n\n<b>                           DYLAN\n</b>             Alright, we'll hit the reception tonight.\n             I only wish we had a clue to go on.\n\nThe food comes, Dylan takes it.\n\n<b>                           NATALIE\n</b>             Hold that thought.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                    22.\n</b>\n<b>CONTINUED:\n</b>\nNatalie goes back to the computer again, slipping a CD\ninto the drive. Dylan hands out the food, spilling a lot\nof it. A big glop of chocolate shake lands on the\nkeyboard.\n\n<b>                            NATALIE (CONT'D)\n</b>             Uh, hello?   Expensive equipment.\n\n<b>                              DYLAN\n</b>             Sorry.\n\nNatalie licks the shake off her fingers, tapes away at\nthe keyboard.\n\n<b>                           NATALIE\n</b>             Check this out. New program I just\n             got from a friend in the Bureau. We\n             take that footage from the kidnapping...\n\nOn screen, the footage downloads from the CD, into the\nprogram. Natalie fast forwards through it until she\ncomes to a shot of one of the kidnappers where his mask\nis partly pulled away from his face.\n\n<b>                           NATALIE (CONT'D)\n</b>             ... isolate the part of the suspect's\n             face that's revealed, then retriangulate\n             his bone structure...\n\nThe program zooms in on the revealed part of his face,\nthen runs a series of calculations. A new drawing starts\nto appear.\n\n<b>                              NATALIE (CONT'D)\n</b>             ... and voila!     We've got a composite.\n\nNatalie's portable printer spits out a simulated\ncomposite of one skinny, bad-looking dude. Dylan grabs\nit, looks it over.\n\n<b>                          DYLAN\n</b>             Sweet. Now we've got someone to\n             look for.\n\nShe hands it to Alex to inspect.\n\n<b>                           ALEX\n</b>             Oh yeah. He'll be easy to spot\n             with that open head wound.\n\nShe turns the composite around, revealing that Dylan has\nsmudged his head with ketchup.\n\nThey all just have to laugh.\n\n<b>                                                   WIPE TO:\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  23.\n</b>\n<b>INT. BILTMORE BALLROOM - DAY\n</b>\nA sophisticated reception is in full swing, an ocean of\nsmart suits and power ties.\n\nDressed as a catering waitress, Natalie carries a tray of\nhors d'oeuvres. MOVING WITH her, we pass ROGER CORWIN, who\ntalks with another suit, and further on, a conservatively-\ndressed DYLAN who chats up a group of WALL STREET TYPES.\n\n<b>                           DYLAN\n</b>             The average investor sees technology\n             stocks as discrete entities, \"This one is\n             up 50 points, this one is down 10.\" It's\n             only through derivative analysis that one\n             sees the real power of that sector.\n\nA few nods.    She makes a good point.\n\n<b>                           BROKER GUY\n</b>             Which analysis method do you prefer?\n\nOn Dylan.    Shit.     She tries to stall...\n\n<b>                           DYLAN\n</b>             Well, there are so many options.\n             I mean, who can say what the one\n             best choice is?\n\n<b>ACROSS THE ROOM\n</b>\nStill walking, Natalie talks to no one...\n\n<b>                           NATALIE\n</b>             Keppler-Wilson.\n\n<b>BACK WITH DYLAN\n</b>\n<b>                            DYLAN\n</b>             For my money, Keppler-Wilson is a\n             strong choice.\n\nMore nods, ad-libbed agreement.        The Broker Guy is impressed.\n\nExcusing herself, Dylan turns and subtly touches her ear,\nwhere she's wearing a hidden radio.\n\n<b>                             DYLAN (CONT'D)\n</b>             Thanks.\n\n<b>AT THE BAR\n</b>\nNatalie loads champagne flutes onto her tray.\n\n<b>                             NATALIE\n</b>             Anytime.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                     24.\n</b>\n<b>CONTINUED:\n</b><b>                             MAN'S VOICE (O.S.)\n</b>             Anytime what?\n\nShe looks up to see a very cute bartender, PETE (26).\nShe didn't realize he was so close.\n\n<b>                           NATALIE\n</b>                    (covering)\n             Anytime, day or night, I am... excited\n             ... to be handing out champagne.\n\nOh God.   What did she just say?       But he smiles anyway.\n\nShe heads back out into the crowd.       You can almost see\nthe big L on her forehead.\n\n<b>BY THE FOUNTAIN\n</b>\nDylan has been watching this.        We INTERCUT between her\nand Natalie.\n\n<b>                             DYLAN\n</b>             He's cute.\n\n<b>                             NATALIE\n</b>             I'm working.\n\n<b>                           DYLAN\n</b>             Sixty-five percent of relationships\n             begin in the workplace.\n\n<b>                           NATALIE\n</b>             He's a bartender. I need dependable.\n             I need reliable. I need a Volvo man.\n\nNatalie walks past Dylan, not acknowledging her.        Dylan\nsnaps her fingers.\n\n<b>                             NATALIE\n</b>             Miss!   Miss!   I'd love some champagne.\n\nNatalie comes back, a little annoyed. Dylan takes a\nglass for herself, then foists the other glasses on\neveryone around her, whether they wanted it or not.\n\n<b>                           DYLAN (CONT'D)\n</b>                    (to Natalie)\n             Why don't you get some more?\n\nShe nudges Natalie in that direction.\n\n<b>AT THE BAR\n</b>\nWe TILT UP from a Japanese comic book to Pete.       He\nsuddenly realizes Natalie is waiting for him.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  25.\n</b>\n<b>CONTINUED:\n</b><b>                             PETE\n</b>             Sorry.\n\nHe starts filling more flutes.\n\n<b>                           NATALIE\n</b>             What are you reading?\n\nHe holds it up.\n\n<b>                           NATALIE (CONT'D)\n</b>             That's the new Michio Kazura.\n             That's not even out in America.\n\n<b>                           PETE\n</b>             You know Michio Kazura?\n\n<b>                             NATALIE\n</b>             Hello?    Warriors of the Broken Earth?   Classic.\n\n<b>                           PETE\n</b>             I know. I just moved back from\n             Tokyo. It was the biggest thing\n             since Haikiri Nomura.\n\n<b>                           NATALIE\n</b>             Tomuru nasgawa ishi Tokyo sen!\n<b>                           PETE\n</b>             Nagada quing-gong ni.     Ni zeru.\nImagine that.    Natalie takes her tray and reluctantly\nheads off.\n\n<b>ON DYLAN\n</b>\n<b>                            DYLAN\n</b>             Ask him out.   Ask him out.\n\n<b>ON NATALIE\n</b>\nShe turns and heads back.\n\n<b>                             NATALIE\n</b>             I'm Natalie.\n\n<b>                             PETE\n</b>             Pete.    Good to meet you.\n\n<b>                           NATALIE\n</b>             Listen, there's an animation festival\n             at the Egyptian this week. I was\n             wondering if you might want to...\n\n<b>                           PETE\n</b>             Tomorrow night? Eight o'clock?\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                26.\n</b>\n<b>CONTINUED:\n</b><b>                           NATALIE\n</b>             I'll meet you there.\n\n<b>ON DYLAN\n</b>\nShe smiles, hearing the deal close. Pushing through a\ncluster of investors, she bumps into a THIN MAN.\n\n<b>                            DYLAN\n</b>             Pardon me.\n\nHe doesn't respond, but something about this man raises\nher suspicions. Where has she seen him before? As he\nmoves out of earshot...\n\n<b>                            DYLAN (CONT'D)\n</b>             Natalie.   Nine o'clock. Thin man.\n\n<b>ON NATALIE\n</b>\n<b>                            NATALIE\n</b>             I'm on it.\n\nSpotting the Thin Man, she heads his way.\n\n<b>                           NATALIE\n</b>                    (offering)\n             Vegetarian spring roll?\n\nHe waves her away, no. Oops, she drops a napkin in front\nof him. She kneels down to get it.\n\nAs we move in VERY CLOSE ON her tray, we see that there's\na tiny Digital display. A metal detector is built into\nthe rim.\n\nIt BLIPS as she moves past his ankle. And again as she\nrises up past his chest. The man just keeps walking.\n\n<b>                           NATALIE (CONT'D)\n</b>                    (to earpiece)\n             Two guns. One ankle, one shoulder.\n\n<b>                            DYLAN\n</b>             You call it.\n\n<b>                           NATALIE\n</b>             You take point. I'll circle behind.\n\n<b>                            DYLAN\n</b>             Copy.\n\n<b>INT. HALLWAY - DAY\n</b>\nThe Thin Man is headed down the hall.    Looking back, we\nsee Dylan enter from the ballroom.\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 27.\n</b>\n<b>CONTINUED:\n</b><b>                           DYLAN\n</b>             Excuse me?\n\nHe doesn't turn back.\n\n<b>                           DYLAN (CONT'D)\n</b>             Excuse me, do you know which way\n             the ladies' room is?\n\nThe man takes a sudden right into a service hallway.\n\n<b>                           DYLAN (CONT'D)\n</b>             Why do they always run?\n\nShe slips off her heels to give chase.\n\n<b>INT. SERVICE HALLWAY - DAY\n</b>\nThe Thin Man comes around the corner.       We stay TIGHT on\nhim, until he suddenly stops.\n\n<b>NATALIE\n</b>\nhas come around from the other side. His bad guy instincts\ntell him these women are working together. He's boxed in.\n\nAnd then, a DING!\n\nElevator doors open beside him. He looks in to see the clue-\nless BELLBOY, who had a funky groove going on his headphones.\nIn a single motion, the Thin Man yanks the guy out into the\nhallway and takes his place. Hits the button.\n\nFrom opposite directions, Natalie and Dylan run to the\nelevator, but the doors have already shut. Checking the\npanel.\n\n<b>                           DYLAN\n</b>             He's going down.\n\nThey take the stairs.\n\n<b>INT. BASEMENT SERVICE HALLWAY - DAY\n</b>\nNatalie and Dylan emerge from the staircase to find the\nelevator empty. To the left, exit doors swing tellingly.\n\n<b>EXT. DOWNTOWN LOS ANGELES - DAY\n</b>\nNat and Dylan smash through the exit doors and out into\nthe sun-drenched streets of beautiful, downtown Los\nAngeles. Natalie immediately spots the Thin Man, booking\ndown the alley.\n\n<b>                           NATALIE\n</b>             That way.\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 28.\n</b>\n<b>CONTINUED:\n</b>\nAnd they take off after him.\n\nWhat ensues is the fastest, wildest, two chicks and one\nguy foot chase you've ever seen. Here are some highlights:\n\n-- Thin Man pulls himself, clumsily, over a chain link\nfence. Dylan and Natalie pull an old Jackie Chan trick\nand run up the side wall and hop over easily.\n\n-- Thin Man, still on foot, waits for traffic to slow,\nthen darts across the Harbor Freeway. By the time Dylan\nand Natalie get there, traffic is roaring again.\nUndeterred, they make their way through, tucking and\nrolling under the wheels of a moving semi.\n\n-- Dylan is racing down an alley, when a car comes barrelling\nat her. She leaps up onto the hood of the car as it drives\nunderneath her, a la one of those That's Incredible! stunts.\n\n-- They chase the Thin Man into an industrial laundromat.\nThe scene goes something like this:\n\n<b>INT. INDUSTRIAL LAUNDRY ROOM\n</b>\nThunderously LOUD, with industrial washers and dryers operating\nat full tilt. Natalie and Dylan are just entering when\n\n<b>THREE SHOTS\n</b>\nring out.    They dive for cover behind a massive washer\nassembly.\n\n<b>                           NATALIE\n</b>             There are times I wish we carried\n             guns.\n\n<b>                           DYLAN\n</b>             Where's the challenge in that?\n\nANGLE ON the Thin Man, planning his next move. With no\ngood shot at the angels, he aims high, both guns BLAZING.\nHe shots out the pipes over their heads, sending down a\ncascade of hot water.\n\nDylan and Natalie scramble back to avoid getting scalded.\n\nOther pipes SHATTER from the change in pressure, leading\nto an interior thunderstorm. Steam fills the room as an\ninch of water grows on the floor.\n\nNatalie and Dylan push rolling laundry carts in the Thin\nMan's direction. He shoots at them, but quickly realizes\nthey're just trying to waste his bullets.\n\nHolstering one of his guns, he dials his cell phone.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                    29.\n</b>\n<b>CONTINUED:\n</b>\nOn the far wall, Natalie switches on the overhead hooks,\nwhich circle on a wire like a ski lift. The Thin Man\nlooks up, distracted, not noticing --\n\n<b>DYLAN\n</b>\nAs she creeps up behind the cover of the rolling laundry\ncarts. She's succeeded in circling behind the Thin Man\nas he talks on the phone.\n\nShe clears her throat.      The Thin Man turns.   She kicks\nhim in the jaw.\n\nKnocked back, he drops the phone, which CRACKS and slips\nunder a washing machine.\n\nHe crab-walks back, then suddenly springs back to his feet.\nWe weren't expecting that kind of ninja move out of this guy.\n\n<b>HE TURNS TO SEE\n</b>\n<b>NATALIE\n</b>\nright behind him. With a coiled towel, she grabs his gun\narm and expertly flips him. But he reacts smoothly, rolling\nover to charge at Natalie, picking her up like a sack of\npotatoes. As he does, he grabs her right in the tit.\n\n<b>                             NATALIE\n</b>             Hey!    Hands off, assh....\n\nBefore she can finish her sentence, the Thin Man throws\nNatalie at Dylan, knocking them both down. He jumps up,\nand with a single motion grabs an overhead pipe and kicks\nanother, releasing a wall of steam -- we can't see a thing.\n\nBy the time the fog clears, the Thin Man is long gone.\n\n<b>                           NATALIE\n</b>             Okay, to summarize? Damn.\n\nLying down in the water, Dylan reaches under the washer\nto fish out the Thin Man's busted cell phone.\n\n<b>INT. TOWNSEND AGENCY BACK ROOM - DAY\n</b>\nNatalie sits at a glowing computer monitor, the Thin\nMan's cell phone connected by a data cable to the\nTownsend Agency computers. Rapidly touching the screen,\nshe calls up a list of the last thirty-five phone calls\nhe received. They're all from the same location.\n\n<b>                            BOSLEY\n</b>             Well.   That was easy.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   30.\n</b>\n<b>CONTINUED:\n</b>\n<b>                              NATALIE\n</b>             No, it wasn't.\n\nShe points to some code next to the numbers.\n\n<b>                           NATALIE (CONT'D)\n</b>             I've seen this before, he's\n             scrambling his calls through a\n             secondary location.\n\n<b>                              BOSLEY\n</b>             In English?\n\n<b>                           NATALIE\n</b>             We need to tap this phone line\n             at the source, THEN we'll know\n             where his calls were coming from.\n\n<b>                            DYLAN\n</b>                     (checking out the numbers)\n             503?   That's not local, where is it?\n\n<b>                           NATALIE\n</b>             Bos, can we check a directory?\n\n<b>                           ALEX\n</b>             Don't bother. I know where it is.\n             I used to spend every winter there.\n\nAs she says it...\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. ASPEN - NIGHT\n</b>\nThe sign says it:     Welcome to Aspen.\n\nVARIOUS ESTABLISHING SHOTS of the gorgeous mountain town,\nstill somehow quaint despite its astonishing wealth.\n\n<b>EXT. COWBOY BAR -- NIGHT\n</b>\nA rowdy establishment just outside of town.\n\n<b>INT. COWBOY BAR --     CONTINUOUS\n</b>\nThe kind of place that rich weekend skiers don't come.\nLots of over-aggressive, cowboy-biker types, drinking more\nthan they should. There are only a few women in the place,\nand they are either waitresses or biker chicks. Suddenly,\neveryone stops what they're doing and turns to the door.\n\nCHARLIE'S ANGELS have entered the room. Dressed in their\nstylish ensembles, they couldn't possibly look more out of\nplace.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 31.\n</b>\n<b>CONTINUED:\n</b><b>                            NATALIE\n</b>             Hey look!   Mechanical bull.\n\n<b>                           DYLAN\n</b>             Eyes on the prize, Nat.   We gotta\n             tap the phones.\n\n<b>                           ALEX\n</b>             That looks like our target.\n\nShe points to a door at the back of the bar that leads\ninto a glassed-in office. Two, beefy bouncer types are guarding\nthe door.\n\n<b>                           ALEX (CONT'D)\n</b>             I'm gonna need a distraction.\n\nDylan and Natalie smile at each other.\n\n<b>                           DYLAN\n</b>             I think that can be arranged.\n\nThe Three Angels split up, Bosley tagging along with Dylan.\n\n<b>DYLAN\n</b>\nsidles up to the bar. A group of three rednecks are\ndowning shots, one after another.\n\n<b>                           DYLAN (CONT'D)\n</b>             Three shots of tequila, please.\n                    (Bosley whispers in her ear)\n             And one Tom Collins.\n\nThe rednecks stare at Dylan, drooling.       Dylan turns to the first\none.\n\n<b>                           REDNECK\n</b>             Hey baby, why don't you ditch that\n             stiff and come sit on ma lap?\n\nBosley tries to make himself small.\n\n<b>                           DYLAN\n</b>             Ooh, that is an enticing offer.\n             But I got a better idea. How\n             about a shot contest? My treat?\n\nThe three rednecks hoot and holler.\n\n<b>                           DYLAN (CONT'D)\n</b>             Okay, I'll take that as a yes. Bartender?\n             Bring ten shots of tequila over to my\n             table. And keep em coming.\n\n<b>BY THE MECHANICAL BULL\n</b><b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  32.\n</b>\n<b>CONTINUED:\n</b>\nA group of wanna bes are waiting their turn at the\nmechanical bull. Natalie wanders over behind them.\n\n<b>                              NATALIE\n</b>             Mind if I try?\n\nThe crowd parts for her, and Natalie hops up on the bull.\nShe cranks it up, and lets\n\n<b>BY THE BAR --\n</b>\nDylan downs a shot, slams it on the table.      Countless\nother glasses surround her.\n\nREVEAL that two of the rednecks are down for the count, one\nfalling out of his chair, the other passed out on the table.\n\nThe third redneck is slurring badly, trying to keep up\nwith Dylan.\n<b>                         DYLAN\n</b>          Hey, I've got an idea. Now let's\n          have a chair throwing contest.\n\n<b>                              REDNECK\n</b>             Hunh?\n\n<b>                           DYLAN\n</b>             Chair throwing? Never heard of\n             it? You just pick up your chair\n             and throw it as far as you can.\n\nThe redneck nods, lifts up his chair and heaves it across\nthe bar.\n\n<b>OKAY, HERE'S AN OUTLINE OF WHAT WILL HAPPEN IN THE REST OF\n</b><b>THIS SCENE:\n</b>\nDylan and Natalie create a distraction, while Alex sneaks\ninto the back office with Bosley to get the phone number\nof the chalet.\n\n<b>EXT. HIGH MOUNTAIN ROAD - NIGHT\n</b>\nA VW van climbs the winding road.       As we get closer, we see the\nside reads, \"Chalet Grams.\"\n\nA DING-DONG DING-DING-DONG doorbell rings.\n\n<b>INT. MOUNTAIN HOUSE / GREAT ROOM - NIGHT\n</b>\nTWO THUGS with shoulder holsters look up, hearing the bell.\nOne was tending to the fire.\n\n<b>                           THUG ONE\n</b>             We expecting somebody?\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              33.\n</b>\n<b>CONTINUED:\n</b>\nThug Two shakes his head.\n\nChecking his gun, Thug One grabs for his windbreaker.\nPuts it on over.\n\n<b>EXT. FRONT PORCH - NIGHT\n</b>\nThug One opens the door to find Dylan and Natalie dressed\nin Swiss Miss outfits, complete with blonde braids.\n\n<b>                           DYLAN\n</b>             Guten Tag!\n\n<b>                           NATALIE\n</b>                    (correcting Dylan)\n             Guten Morgen!\n\n<b>                           DYLAN\n</b>                    (correcting Natalie)\n             Guten Nacht!\n\n<b>                           DYLAN AND NATALIE\n</b>                    (to each other)\n             Guten Freund!\n\nThe girls lean in and hug each other, butts sticking out.\nTo the left, Bosley starts playing oommpa OOMMPA oommpa\nOOMMPA on a wrap-around tuba. He's wearing lederhosen,\nwith a feather in his hat.\n\nNatalie begins to YODEL.\n\nDylan hands a fancy envelope to the bewildered thug. Thug\nTwo is approaching from behind, curious what the hell is\ngoing on.\n\nDylan begins to TALK-SING a song in German about a too-\ncurious goat and his worried mistress. Even with the pantomime,\nwe have no idea what's happening. It seems\nwholesome, but occasionally one of the girls touches the\nother in a weirdly coquettish, oddly sexual way.\n\nThug Two looks at the address on the envelope.\n\n<b>                           THUG TWO\n</b>                    (low)\n             They got the wrong address.\n\n<b>                           THUG ONE\n</b>             Shut up.\n\nAs the angels continue their routine, the CAMERA RISES,\nthree quick cuts to take us to...\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               34.\n</b>\n<b>EXT. THE ROOF - NIGHT\n</b>\n... where a black cat-suited Alex stands at the\nchimney... A ribbon of smoke curls from the stack.\n\nPulling the pin from a canister, she drops it down the\nchimney.\n\n<b>INT. MOUNTAIN HOUSE GREAT ROOM - NIGHT\n</b>\nA cheerful fire burns in the over-sized fireplace. The\ncanister drops into the flames from above, suddenly\nventing a HISSING cloud of halon gas. The fire dies\nimmediately, the logs covered with a violent frost.\n\n<b>INT. THE CHIMNEY - NIGHT\n</b>\nAlex doesn't even need a rope. Her feet pressed to the\nsooty walls, she expertly slides to the bottom.\n\n<b>INT. GREAT ROOM - NIGHT\n</b>\nAlex backs out of the fireplace to find a WAITING BAD GUY\nswinging\n\n<b>A FIREPLACE POKER\n</b>\nat her head. She ducks just in time.     The poker CHINGS\nagainst the stone, making a spark.\n\nRolling, jumping and diving, Alex scurries as Pokerman\nslashes and stabs. She ducks behind a chair, which\nPokerman catches with the hook, winging it across the\nroom.\n\nBacked against the wall, Alex yanks on the heavy\ncurtains, pulling them down, along with the wooden\ncurtain rod. A spin, a flourish of velvet and the\ncurtain rings drop off to leave her with a trusty\nquarterstaff.\n\nShe goes on the offensive.    Thrust, parry, spin.\n\nBut he's a worthy adversary. One good karate kick breaks\nher staff in two. She uses both pieces to club him in\nthe knees, then rolls back to the fireplace.\n\nShe grabs the remaining tool: the fireplace tongs.\nPokerman swings. Alex catches his weapon in the tong\nscissors, yanking it free with such force the point sticks\nin the wall.\n\nA quick kick knocks Pokerman to the floor, where Alex\nrolls on top of him. She catches his head in the tongs,\nsqueezing his temples. His eyes bulge.\n\n<b>                           ALEX\n</b>          Where's Knox?\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  35.\n</b>\n<b>INT. WINDOWLESS ROOM - NIGHT\n</b>\nYoung billionaire ERIC KNOX paces. He's grungy, with\ntwo days of stubble, but still a darn attractive guy.\n\nHearing a KICK at the door, he turns.\n\nA second KICK blows the door open.     It's Alex.\n\n<b>                           KNOX\n</b>          Who are you?\n\n<b>                           ALEX\n</b>          The calvary.     Giddy up.\n\n<b>EXT. FRONT PORCH - NIGHT\n</b>\nBosley is about to hyper-ventilate on the tuba, sweaty\nand a little blue.\n\nDylan and Natalie's new song has them sharing the saddle\nof an imaginary horse. When Dylan reaches back to slap\nthe \"horse,\" she hits Natalie in the rump. Both women\ntee-hee.\n\nThe thugs think it's pretty hot.\n\nDylan whispers a secret to Natalie.     Natalie WHISPERS\nback.\n\nTurning to the thugs, they each lean in to WHISPER into\na different thug's ear. As the men smile, the angels\nsuddenly BONK the two men's heads together. Both men\nfall, knocked out.\n\nStepping over the bodies, Dylan heads inside.\n\n<b>INT. MOUNTAIN HOUSE HALLWAY - NIGHT\n</b>\nLooking for the way out, Alex leads Knox to a closed\ndoor. She opens it to find...\n\n<b>INT. TV ROOM - NIGHT\n</b>\n... TWO MORE THUGS sitting in front the big-screen TV,\nwatching a college basketball game (Duke vs. Maryland,\nin case you care.) The guards look back, spotting Alex\nwith Knox.\n\nThat wouldn't be so bad, if it weren't for the\n\n<b>FIFTEEN OTHER THUGS\n</b>\nwatching the game with them.\n\nANGLE ON Alex.   It's an oh-shit moment.\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   36.\n</b>\n<b>CONTINUED:\n</b>\n<b>                             ALEX\n</b>             Sorry.    Wrong room.\n                      (to Knox)\n             Back!    Run!\n\nThe thugs are out of their seats a moment later, each of\nthem pulling out a firearm.\n\n<b>EXT. FRONT PORCH - NIGHT\n</b>\nHolding down three keys on the tuba, Bosley talks into\nthe mouthpiece. It has a secret radio.\n\n<b>                           BOSLEY\n</b>             Alex, what's your status?\n\n<b>INT. STAIRCASE - NIGHT\n</b>\nRunning, Alex pushes Knox ahead of her, checking their\nbacks. She talks into a wrist-mic.\n\n<b>                            ALEX\n</b>             Good news:   I found Knox.\n\nAnother THUG steps out in front of her.      She kicks him\ndown the steps.\n\n<b>                             ALEX (CONT'D)\n</b>             Bad news:    I found company.\n\nReaching the bottom of the steps, Knox is surprised to be\ngrabbed by Dylan.\n\n<b>                             DYLAN\n</b>             This way.\n\nAt this point, he'll do whatever they say.\n\n<b>EXT. FRONT OF MOUNTAIN HOUSE - NIGHT\n</b>\nDylan rushes Knox across the driveway to the waiting van\n-- Natalie is pulling it around. Overhead, bright\nsecurity lights switch on.\n\nBack at the front door, Alex pulls it shut. She attaches\na carabiner clip to the handle, running a thin steel cord\nfrom it around the porch column.\n\n<b>INT. FOYER - NIGHT\n</b>\nThe first of the thugs reaches the door, tries to pull it\nopen but can't. The next few guards try to help him,\nwhile the rest start smashing through the windows.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               37.\n</b>\n<b>EXT. FRONT OF MOUNTAIN HOUSE - NIGHT\n</b>\nRunning with the tuba, Bosley stops for a moment to catch\nhis breath, hands on his knees. Okay, ready to run\nagain.\n\nHe's the last to be pulled into the van.    A spray of\ngravel and they're off.\n\n<b>INT. THE VAN - NIGHT\n</b>\nEveryone is piled on top of each other. Dylan and Knox\nhave a few awkward moments as they get untangled. Bosley\nkeeps making inappropriate TUBA NOISES.\n\nAt the wheel, Natalie is fierce and focused, in total\ncontrol.\n\nLooking out the back windows, Alex sees the kidnappers\npiling into jeeps to give chase. From the side of the\nhouse, more thugs appear on motorbikes.\n\n<b>                        ALEX\n</b>          They're coming after us.\n\n<b>                        DYLAN\n</b>                 (to Knox, confident)\n          We were expecting that.\n\n<b>                        NATALIE\n</b>          Okay, new problem.\n\nEveryone's attention WHIPS FORWARD to see the headlights of\n\n<b>GIANT LOGGING TRUCK\n</b>\ncoming up the high mountain road. It straddles the\ncenter line, blocking both directions. There's no way\naround it.\n<b>                         NATALIE (CONT'D)\n</b>           Thoughts, suggestions, points to\n           consider?\n\n<b>                        BOSLEY\n</b>          I don't suppose giving up would\n          be a...\n\nNo, it wouldn't.   Then --\n\n<b>                         DYLAN\n</b>          Right!\n\n<b>                        NATALIE\n</b>          There is no right.\n\n<b>                         DYLAN\n</b>          There!\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   38.\n</b>\n<b>CONTINUED:\n</b>\nShe points to a faded \"CLOSED\" sign that hangs from a\nchain. In the darkness, who knows what it's blocking.\nBut as we hear the THUNDEROUS HORN from the oncoming\ntruck, we know there's no choice.\n\nNatalie cuts a hard right, SMASHING through the sign.\n\nThe van THUMPS AND BUMPS its way across the low grass,\nits headlights only showing ten feet ahead. At any\nmoment, the ground could stop in a cliff.\n\nLike now.\n\nThe van leaps into empty space.      Tires spin, helpless.\nThe van falls.\n\nEveryone SCREAMS.    Bosley is the loudest.\n\nAnd then, touchdown. The van hits the ground, hard but\nnot catastrophically. Natalie hits the brakes, cuts the\nwheel hard to avoid hitting\n\n<b>A CONCRETE WALL\n</b>\nin front of them.    Everyone takes a beat to acknowledge\nthey're alive.\n\n<b>                             DYLAN\n</b>             Where are we?\n\nSuddenly, a BRIGHT LIGHT goes on overhead.\n\n<b>EXT. THE MOUNTAIN - NIGHT\n</b>\nOne by one, a series of arc lights switches on, forming a\nsnake all the way to the bottom of the mountain.\n\n<b>INT. THE VAN - NIGHT\n</b>\nLooking out the back windows...\n\n<b>                           ALEX\n</b>             It's a bobsled run.\n\nThey're facing backwards.\n\nUp ahead, the kidnappers are charging down the access roads.\nThe first of two jeeps makes the jump into the bobsled chute.\n\n<b>                           NATALIE\n</b>             If it goes down the mountain,\n             that's all I need.\n\nThrowing it into reverse, Natalie peels out.\n\nThe jeeps follow.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               39.\n</b>\n<b>EXT. BOBSLED RUN - NIGHT\n</b>\nThe VW Van leads the way down the mountain, tail-first.\nAs it builds speed, it starts to climb the wall, each turn\ngetting steeper and steeper.\n\nThe two jeeps are following. Facing the right direction,\nthey have a much easier time of it.\n\n<b>INT. VAN - NIGHT\n</b>\nEverything is shaking so violently, it looks like a NASA launch.\n\n<b>                         ALEX\n</b>                  (looking out the back)\n           Hard left! HARD LEFT!\n\nNatalie makes the turn. The van rises up, nearly tilting\nover. But they make it through the turn.\n\n<b>                         KNOX\n</b>                  (to Dylan)\n           Is this part of the plan?\n\n<b>                         DYLAN\n</b>           Yes. Except for the bobsled run,\n           and the backwards part, it's\n           going exactly according to plan.\n\nA beat.   He smiles at her.   He has a nice smile.\n\n<b>EXT. BOBSLED RUN - NIGHT\n</b>\nOne of the jeeps makes a move, closing the distance to\nthe van. A RIFLEMAN leans out the passenger window,\nlining up a shot. He FIRES.\n\n<b>INT. THE VAN - NIGHT\n</b>\nThe shot blasts cleanly through the top of the windshield,\nthrough the horn of Bosley's tuba, then out the back window.   It\nmissed hitting somebody by millimeters.\n\nNatalie is still focused, making each turn as Alex calls it.\n\n<b>EXT. BOBSLED RUN - NIGHT`\n</b>\nThe front jeep gets even more aggressive, building speed.\n\nIt hits the next turn too fast, rising up too high along\nthe wall. It tips further, and further, finally rolling\nover onto its back. It SCRAPES across the concrete, a\nshower of sparks as it slows down.\n\nWith nowhere to go, the second jeep brakes hard, but can't stop.\nIt SMASHES into the first jeep, a tangle of steel.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              40.\n</b>\n<b>CONTINUED:\n</b>\nThe combined mass continues sliding down the run, like a\njagged pinball in the chute.\n\n<b>INT. THE VAN - NIGHT\n</b>\nDylan looks out through the windshield as the jeep combo recedes\nfarther and farther away.\n\n<b>                           DYLAN\n</b>             I think we're in the clear.\n\nJust then, two MOTORBIKES race up along the chute walls, passing\nthe crippled jeeps. Two more MOTORBIKES jump in from above.\n\n<b>                             DYLAN\n</b>             Or maybe not.\n\nSuddenly, Natalie GASPS, remembering something.\n\n<b>                             NATALIE\n</b>             Oh God, no.\n\n<b>                             DYLAN\n</b>             What is it?\n\n<b>WHIP CUT TO:\n</b>\n<b>EXT. EGYPTIAN THEATRE - NIGHT\n</b>\nA dejected Pete stands in front of the sign for the anime\nfestival, two tickets in hand.\n\n<b>WHIP BACK TO:\n</b>\n<b>INT. THE VAN - NIGHT\n</b>\n<b>                           NATALIE\n</b>             I have a date with Pete.   Right now.\n\n<b>                             DYLAN\n</b>             Ouch.\n\n<b>                             ALEX\n</b><b>             HARD RIGHT!\n</b>\nNatalie makes the hard right. The motorcycles are gaining on\nthem, but Natalie and Dylan have to talk through this first.\n\n<b>                           DYLAN\n</b>             Call him, he'll totally understand.\n\n<b>                           NATALIE\n</b>             \"Gee, sorry Pete. I had to rescue a\n             billionaire.\"\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  41.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           ALEX\n</b>             Hard left!\n\nShe makes the left.\n\n<b>                           NATALIE\n</b>             I'll sound like a flake.   I can't\n             stand flakes.\n\n<b>                           DYLAN\n</b>             He will so give you the second chance.\n\n<b>                           NATALIE\n</b>             You think?\n\n<b>                           DYLAN\n</b>             Hello, I saw the way he looked at you.\n\nOne motorcycle charges, coming up just feet from the\nwindshield. Natalie taps on the brakes. The freaked out\nguy can't slow down in time. He SMACKS into the windshield,\nthen goes flying.\n\n<b>                           ALEX\n</b>             We're at the bottom!\n\nIndeed, we are. The concrete walls end, leaving open ground.\nSlamming on the brakes, Natalie turns the van around.\nEveryone goes flying. Bosley is still on the phone with\nCharlie.\n\n<b>EXT. BASE OF THE MOUNTAIN - NIGHT\n</b>\nBack facing the right direction, the van charges onward.\nThe motorcycles race up to the passenger side, grabbing\nfor the door.\n\n<b>INT. THE VAN - NIGHT\n</b>\nDylan SLAMS open the door, knocking one RIDER off.\n\nThe sliding door opens, another RIDER outside trying to get\nin. Thinking fast, Knox grabs Bosley's tuba and shoves it\nat the motorcyclist, who tumbles, taking out the fourth\nrider in the process.\n\n<b>                           DYLAN\n</b>                    (genuinely impressed)\n             Well done.\n\n<b>                           KNOX\n</b>             Thanks.\n\n<b>                                                  CUT TO:\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                42.\n</b>\n<b>HELICOPTER\n</b>\nthunders over.    We are...\n\n<b>INT. THE HELICOPTER - NIGHT\n</b>\nNatalie is at the controls, Bosley beside her.      Alex leans\nforward from the second row.\n\n<b>                           BOSLEY\n</b>             I think that went very well. Charlie\n             should send me on more missions.\n\n<b>                           ALEX\n</b>             We couldn't have done it without\n             you, Bos.\n\nNatalie pats him on the arm. She and Alex exchange a quick\nglance. They have to just laugh.\n\nIn the back row, Knox is looking out over the gorgeous lights\nof Aspen.\n\n<b>                           DYLAN\n</b>             Cocktail?\n\nShe offers him an airplane-sized bottle of Johnnie Walker\nblack. He takes it and toasts. They both down their drinks\nin a single shot. A smile, and then...\n\nMUSIC rises.\n\nTHE ANGELS TRIPTYCH descends.\n\nThe act is over.    After a beat, we\n\n<b>WIPE TO REVEAL:\n</b>\n<b>EXT. CHARLES TOWNSEND DETECTIVE AGENCY - DAY\n</b>\nRe-establishing.\n\n<b>INT. CHARLES TOWNSEND DETECTIVE AGENCY - (THE NEXT) DAY\n</b>\nCharlie is on the speakerphone.      The angels are in their\nusual lounging positions.\n\n<b>                           CHARLIE'S VOICE\n</b>             Good work, Angels. Not only did you\n             save Knox, you saved his company as well.\n\n<b>                           DYLAN\n</b>             I think that earns us a vacation.\n\n<b>                           NATALIE\n</b>             Say, Fiji?\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 43.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           ALEX\n</b>                    (to Natalie)\n             Any special guy you were thinking\n             of inviting?\n\nNatalie grins a guilty smile.\n\n<b>                              CHARLIE'S VOICE\n</b>             Sorry, Angels.     Our work is only\n             half-done.\n\nKnox enters. Clean-shaven and neatly pressed, he's still a\ndarn good-looking man. Vivian Wu follows him.\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             Meet your new client, Eric Knox.\n\n<b>                           KNOX\n</b>             First off, thank you. You rescued\n             me, for which I am eternally grateful.\n\nHe's talking to all the angels, but his gaze seems to fall\nmost upon Dylan. She notices it.\n\n<b>                           KNOX (CONT'D)\n</b>             But there's still a problem. Whoever\n             kidnapped me wasn't just trying to\n             screw up our IPO. They also stole\n             the proprietary software for our new\n             web browser. I'm sure it was Roger\n             Corwin, but I need proof.\n\n<b>                           CHARLIE'S VOICE\n</b>             That's where you come in, Angels.\n\nCIRCLING AROUND, we see the video images of Corwin and the\nRed Star Systems logo on the big screen.\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             We need to break into Red Star's computer\n             systems to see if Mr. Knox's software is\n             indeed being converted for Red Star's use.\n\n<b>                           NATALIE\n</b>             Sounds like a plan.\n\n<b>                           CHARLIE'S VOICE\n</b>             Not as easy as that, Natalie. Red\n             Star's headquarters are as tightly\n             guarded as a military facility.\n             We're going to need reconnaissance\n             on their mainframe computer system,\n             and the best way to get that is\n             through Mr. Corwin himself.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 44.\n</b>\n<b>CONTINUED:\n</b>\nA video image of Corwin's Palm Pilot Schedule comes up the\nbigscreen. The shot pulls in close on \"SAN DIEGO SPEEDWAY.\"\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             We need to pin a camera on him to get\n             footage of the inside of the building.\n             Thanks to Alex's work at the health spa,\n             we know that Corwin will be at the San\n             Diego Speedway on Thursday. Get close to\n             him Angels, but don't tip your hand.\n\n<b>                           ALEX\n</b>             Consider it done.\n\n<b>                           CHARLIE'S VOICE\n</b>             Dylan, I need you to arrange for Mr.\n             Knox's security. I'd hate to have him\n             kidnapped again.\n\n<b>                           DYLAN\n</b>             Absolutely. But we'd all feel safer\n             if you could join us, Charlie.\n\n<b>                                                CUT TO:\n</b>\n<b>UNDERWATER\n</b>\nFrom Charlie's P.O.V., looking up at the sunlight.      Three\nmanta-rays swim above us.\n\nWe can hear the BUBBLES from Charlie's regulator.\n\n<b>                           CHARLIE\n</b>             I'd love to Angels. But I'm in a\n             bit over my head at the moment.\n\nA manta-ray swims past, super-close, letting us...\n\n<b>                                                WIPE TO:\n</b>\n<b>EXT. KNOX HOUSE - DUSK\n</b>\nA majestic craftsman in the hills, Frank Lloyd Wright meets\nconspicuous consumption.\n\n<b>INT. KNOX HOUSE ATTIC - DUSK\n</b>\nA flashlight beam sweeps past, revealing Dylan. With just\nher shoulders above the rafters, she's checking a dusty\ncrawl space. She finds nothing suspicious.\n\n<b>INT. KNOX'S WALK-IN CLOSET - DUSK\n</b>\nKnox stands below, Dylan's boots on his shoulders. The heels\ndig in a bit, but he's not complaining.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                45.\n</b>\n<b>CONTINUED:\n</b><b>                           DYLAN\n</b>             We're good.\n\nHe moves to help her down, but she does a reverse-pullup to\nhandle it by herself. She leads the way...\n\n<b>INT. KNOX'S BEDROOM - DUSK\n</b>\nThe room is huge. Through the floor-to-ceiling windows, we see\nthat we're up in the hills.\n\nKnox follows her as she walks.\n\n<b>                           DYLAN\n</b>             I've got surveillance on all the windows.\n             Don't answer the door, don't answer the phone.\n\nWe continue...\n\n<b>INT. KNOX LIVING ROOM - DUSK\n</b>\nJust as big, just as beautiful. Knox, or his decorator, has\ngreat taste. Everything is top quality, but unpretentious.\n\n<b>                           DYLAN\n</b>             Also, stay away from the windows.\n\n<b>                           KNOX\n</b>             They're bullet-proof.   The last\n             owner was paranoid.\n\n<b>                           DYLAN\n</b>                    (a smile)\n             Lucky for us.\n\nShe takes a marker-sized device off the table.\n\n<b>                           DYLAN (CONT'D)\n</b>             This is a panic button.\n                    (tosses it to him)\n             Press it and one of us can be here\n             in ten minutes.\n\n<b>                           KNOX\n</b>             Which one of you?\n\n<b>                           DYLAN\n</b>             Whoever's closest.\n\nShe takes her jacket off the couch, ready to go.\n\n<b>                           KNOX\n</b>             I have a better idea.\n\n<b>                           DYLAN\n</b>             What?\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 46.\n</b>\n<b>CONTINUED:\n</b>\nHe tosses her the panic button.\n\n<b>                           KNOX\n</b>             Stay for dinner.\n                    (preempting objections)\n             I'm a pretty good cook.\n\n<b>                           DYLAN\n</b>             I can't Mr. Knox. I'm sorry.     If you...\n\n<b>                           KNOX\n</b>                    (quickly)\n             I'm scared.\n\nDylan is surprised by this.\n\n<b>                           KNOX (CONT'D)\n</b>             Look, I didn't want to admit it, but I\n             am. I was kidnapped once, and it wasn't\n             fun. I know, you probably have other\n             plans, but it would be very reassuring.\n\nDylan looks him over. Normally, she'd be suspicious, but\nthe guy WAS just kidnapped, and he seems sincere.\n\n<b>                           KNOX (CONT'D)\n</b>             Come on, don't make me beg. I'm\n             embarrassed already.\n\nShe smiles.\n\n<b>                            DYLAN\n</b>             Don't be.\n\nShe throws her coat back on the sofa.\n\n<b>INT. KNOX LIVING ROOM - NIGHT\n</b>\nWe PAN OFF a half-played Scrabble game to find Dylan and\nKnox at the windows. Dylan picks up a family photo, Knox\nas a little boy with a father in a military uniform.\n\n<b>                           DYLAN\n</b>             That's you, hunh? Cute kid.    Cute\n             family.\n\n<b>                            KNOX\n</b>             Thanks.\n                    (taking the photo)\n             It's the only picture I have of me with\n             my parents. They died a week later.\n\n<b>                            DYLAN\n</b>             Oh.   Oh, I'm sorry. I had no idea...\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 47.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           KNOX\n</b>             Please, don't apologize. I was too\n             young to understand.\n                    (looking at the photo)\n             I never knew how they died. When I\n             was a kid, when I got shuffled from\n             one foster home to another, I always\n             thought they just disappeared.\n\n<b>                            DYLAN\n</b>             But...?\n\n<b>                           KNOX\n</b>             I only found out later, my father was\n             in the military. He and my mother were\n             killed while he was on assignment,\n             somewhere in Eastern Europe.\n                    (mostly to himself)\n             The files were classified, but I\n             read enough to know that he was a\n             good man. Apparently, he was\n             betrayed by one of his own team.\n\n<b>                            DYLAN\n</b>             Wow.   That's a lot for a kid to live with.\n\n<b>                           KNOX\n</b>             Yeah, but it motivated me, losing my\n             family. It still does. I don't take\n             anything for granted.\n\nDylan nods.\n\n<b>                           DYLAN\n</b>             Boy did I have you pegged wrong.\n\n<b>                           KNOX\n</b>                    (intrigued)\n             How do you mean?\n\n<b>                           DYLAN\n</b>             Well, to be honest, I thought you\n             were a rich kid who inherited\n             everything. But that's pretty typical.\n             I've got instincts for the job, but\n             when it comes to men? Well...\n\n<b>                           KNOX\n</b>             I'm glad you don't see me as just a client.\n\nHe brushes his hand against hers.     She brushes back, fingers\nagainst fingers. A long beat.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   48.\n</b>\n<b>CONTINUED:\n</b>\n<b>                            DYLAN\n</b>             Oh.   Well, you ARE, so...\n\n<b>                           KNOX\n</b>             Is there someone you need to be going\n             home to?\n\n<b>                              DYLAN\n</b>             No.\n                    (beat)\n             But I...\n\nHe kisses her. After a moment, she breaks off. It's not that\nit was a bad kiss. It was a damn good kiss. It's just...\n\n<b>                              DYLAN (CONT'D)\n</b>             I shouldn't.\n\nKnox moves towards her.\n\n<b>                              KNOX\n</b>             Shouldn't you?\n\nDylan holds him back.\n\n<b>                            DYLAN\n</b>                     (firmly)\n             No.   I shouldn't.\n\nShe stands up.\n\n<b>                           DYLAN (CONT'D)\n</b>             Thank you for dinner, Mr. Knox.    And\n             lock the door behind me.\n\nShe gets up and leaves.\n\n<b>                                                   CUT TO:\n</b>\n<b>FORMULA-ONE RACE CARS\n</b>\nROARING past on the track.       It's all thunder, smoke and\nasphalt. We are...\n\n<b>EXT. SAN DIEGO SPEEDWAY - DAY\n</b>\nWith a ROAR, another blur of racers whips past, with heat\nand noise and speed. The lead car bears the familiar\nmarkings of RED STAR INDUSTRIES. Roger Corwin is at the\nwheel, steering calmly to a comfortable lead, when he is\nsuddenly BUMPED.\n\n<b>                              CORWIN\n</b>             What the...?\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  49.\n</b>\n<b>CONTINUED:\n</b>\nANOTHER BUMP sends him screeching to the left. He almost\ncrashes, then gets back on course, just as he's passed by...\n\nA SLEEK, BLACK CAR, sponsored by the SONY CORPORATION, and\nmanned by a mysterious driver with TEXAS TORNADO inscripted on\nthe helmet. We follow the black car as it pulls into the pit.\n\n<b>EXT. FREEWAY PIT - DAY\n</b>\nThe racer pulls off her helmet as the pit crew surrounds her.\nOf course, the racer is Natalie, aka BETTY LOU HOBERT, the Texas\nTornado.\n\n<b>                           PIT BOSS\n</b>                    (yelling over the\n                     engine noise)\n<b>             NICE RACING!\n</b>                    (beat)\n<b>             CAN'T BELIEVE YOU'VE NEVER RACED\n</b><b>             THIS TRACK BEFORE!\n</b>\n<b>                           NATALIE\n</b>                    (Texas accent)\n<b>             BACK WHERE AH'M FROM, WE RACE IN SWAMPS\n</b><b>             AND BACK ROADS! THIS ALL'S A PIECE A CAKE!\n</b>\nNatalie shakes out her hair, winks at the pit boss.\n\nThe Pit Crew races in to make repairs. DYLAN, dressed in a\npit suit, kneels by Natalie's front tire. Natalie crouches\ndown next to her so they can talk.\n\n<b>                           NATALIE (CONT'D)\n</b>             I nicked him. Should give you\n             enough time to do the deed.\n\n<b>                             DYLAN\n</b>             I'm on it.\n\nDylan steals away, heading for...\n\n<b>CORWIN'S PIT CREW --\n</b>\nCorwin is seething mad as he pulls into his pit.\n\n<b>                             CORWIN\n</b><b>             LET'S GO!    WE'RE LOSING TIME HERE!\n</b>\nThe pit repairs his car as Corwin is approached by another\nracer, also wearing a Red Star racing suit. He leans into\nCorwin's car and now we see that's it's... THE THIN MAN.\n\n<b>                           THIN MAN\n</b>             You okay, Boss?\n\n<b>                                                    (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   50.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           CORWIN\n</b>             No thanks to you! You're supposed\n             to be my head of security! Who is\n             that bitch?!\n\nThe Thin Man peers over at Natalie, but she's got her\nback to him.\n\n<b>                            THIN MAN\n</b>             Don't know.   I'll keep an eye out.\n\n<b>                            CORWIN\n</b>             Yeah.   You do that.\n\nCorwin peels out onto the track again, almost crushing\nthe Thin Man in the process.\n\n<b>AS CORWIN PULLS OUT\n</b>\nDylan sneaks in. In all the cacophony, no one notices\nas she grabs CORWIN'S SUITCASE out of the back seat of\nhis regular car, a bitching Mercedes. She checks both\nways to see if she's being watched.\n\n<b>                           BOSLEY (O.S.)\n</b>             Coast is clear, Dylan.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. THE WINNER'S CIRCLE\n</b>\nWhere Alex, dressed as a trophy girl, watches the race\nthrough binoculars and keeps an eye on her pals. She\nnods to BOSLEY, who is dressed as the Flag Waver. He\nspeaks into a walkie talkie.\n\n<b>                           BOSLEY\n</b>             Let's make the switch.\n\n<b>BACK IN THE PIT --\n</b>\nDylan pulls a briefcase out of her jumpsuit, and swaps\nit with one in Corwin's car. She carefully switches all\nhis files from the old briefcase to the new one, then\ngives Alex a thumbs up.\n\n<b>MEANWHILE BACK IN THE RACE --\n</b>\nNATALIE roars back onto the track, keeping Corwin in her\nsights. Then she spots another Red Star car, coming up\nright next to her. She locks eyes with the Thin Man.\n\nThe two of them recognize each other at the exact same\ninstant.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  51.\n</b>\n<b>CONTINUED:\n</b>\nThe Thin Man, realizing he's been made, jams on the\nbrakes and skids off to the right, which leads to a ramp\nthat heads out of the stadium.\n\nNatalie, not wanting to lose him, does something crazy.\nEven though she's at the front of the pack, she brakes\nhard, swerves into a full 180 degree U-turn, and starts\nheading the WRONG WAY on the race track.\n\nStartled drivers pull off to the left and right as she\nfollows the Thin Man out of the racetrack.\n\n<b>EXT. SPEEDWAY ACCESS ROAD - DAY\n</b>\nTo a chorus of CAR HORNS, the Thin Man's blue racer weaves\nthrough the spectator traffic entering the speedway.\n\nLooking back, we see Natalie is gaining on him.\n\nFinally clear of the traffic, both cars let it rip.\n\n<b>                                                  CUT TO:\n</b>\n<b>HELICOPTER VIDEO FOOTAGE\n</b>\nLooking down on a freeway, where a ubiquitous police\npursuit is in progress.\n\n<b>                            TV ANCHOR VOICE\n</b>             If you're just joining us, we're\n             approaching hour five of a pursuit\n             that has lead us all across the\n             Southland, at speeds up to 80\n             miles an hour.\n\nA beat-up gray Chrysler leads a phalanx of police cars\ndown the empty freeway. It's oddly calm and hypnotizing.\n\n<b>                           FEMALE ANCHOR VOICE\n</b>             Chuck, time and again we hear the\n             question, \"Why don't the police just\n             ram the other car, or shoot out the\n             tires?\" The LAPD has a policy of\n             hanging back and following unless...\n\nSuddenly, the blue Formula One car comes screeching past\nthe cops and the suspect, over 200 miles per hour.\n\n<b>                              TV ANCHOR VOICE\n</b>             What was that?\n\n<b>INT. NATALIE'S RED CAR / ON THE FREEWAY - DAY\n</b>\nStill hot on the Thin Man's tail, Natalie has the engine\n<b>ROARING.\n</b><b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               52.\n</b>\n<b>CONTINUED:\n</b>\nAs she passes the police cars, we see several OFFICERS\nlook over -- what the hell?\n\nNatalie catches up to the gray Chrysler. Looks over to\nsee the WILD-EYED SUSPECT, hunched over the wheel.\n\nHe looks back at her. A beat later, she's passed him,\njust taillights on the freeway.\n\n<b>EXT. FREEWAY - DAY\n</b>\nWith the lanes cleared for the other chase, there is\nnothing preventing the Formula One cars from hitting top\nspeed -- which they do.\n\nNatalie is catching up to the Thin Man.\n\nAs they head under an overpass, we see KIDS CHEERING.\n\n<b>INT. BLUE CAR - DAY\n</b>\nThe Thin Man checks his gauges. The gas dial is perilously\nclose to empty -- these cars are meant to be refilled often.\n\nUp ahead, he sees an exit.   He starts to slow down...\n\n<b>EXT. FREEWAY - DAY\n</b>\n... but when you're going 200 miles per hour, that can\ntake a while. He misses the exit.\n\nNatalie is trying to match his speed.\n\nThe Thin Man pulls over to the side, stops fully.\nBraking as hard as she can, Natalie still passes him.\n\nThe Thin Man throws a U-turn, heading up the freeway on-ramp.\n\nNatalie follows.\n\n<b>EXT. SAN DIEGO SHIPYARD - DAY\n</b>\nWe catch glimpses behind fences and between train cars --\nthe two racers gliding slowly down the narrow roads, like\nlions pacing.\n\n<b>INT. NATALIE'S RED CAR - DAY\n</b>\nPulling off her helmet, Natalie scans right and left for\nthe blue car -- she's lost sight of him. The narrow\nwindshields of these racers doesn't make it any easier.\n\n<b>EXT. SHIPYARD - DAY\n</b>\nWe LOOK DOWN on Natalie's car as she rounds a corner,\nstill searching.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               53.\n</b>\n<b>EXT. PIER - DAY\n</b>\nNatalie spots the blue racer reaching the end of the\nlong pier. It pulls a U-turn to face her, then stops,\nengine idling. There's only way off the pier, and it's\npast Natalie.\n\nThe Thin Man REVS his engine.\n\nNatalie REVS hers.\n\nANGLE ON a white seagull, pecking at something on the\npier, halfway between the two racers. The bird looks up,\nhearing the engines.\n\nANGLE ON the Thin Man. He pulls his harness tighter.\nREVS his engine higher.\n\nANGLE ON Natalie. If it's a game of chicken he wants,\nshe'll give it to him. She REVS her engine higher still.\n\nThe noise scares the bird, who suddenly flies off. Like\na flag being dropped, that's the signal for both racers\nto peel out.\n\nA cloud of SMOKE.    Rubber on asphalt.\n\nAlready reaching a tremendous speed, the racers are on a\ncollision course. The Thin Man isn't going to turn away.\nNeither is Natalie.\n\nRacing faster, and faster still, there's only one way\nthis can turn out. But then, at the very last moment,\nthe Thin Man wusses out. He cuts the wheel right,\nmissing Natalie and careening off the edge of the pier.\n\nIn SLOW MOTION, we watch as his racer hangs in mid-air,\nwheels still spinning. Back-heavy, the tail hits the\nwater first.\n\nNatalie brakes hard, cuts the wheel to avoid going off\nthe far end of the pier. She finally stops, the rear\ntire just 1/4 inch from the edge.\n\nCRANING UP along the side of the pier, we find Natalie\nlooking into the water where the blue racer went in.\nThere's just a slick of oil and a steady stream of bubbles.\n\n<b>                                              CUT TO:\n</b>\n<b>VIDEO / CAMERA'S P.O.V.\n</b>\nWe see lots of hallways, doorways and security locks, all\nfrom the POV of a man's hip.\n\nThe footage is from the camera in the switched briefcase\nthat Corwin is now carrying with him.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               54.\n</b>\n<b>CONTINUED:\n</b>\nWe PULL BACK from the video to see we are actually\nwatching it...\n\n<b>INT. CHARLES TOWNSEND AGENCY - DAY\n</b>\n... on the big screen. The angels and Bosley watch the\nfootage, along with Knox and Vivian Wu. Vivian has\nseated herself close to Natalie. So close, in fact, that\nNatalie keeps having to shift a few inches.\n\nDylan, meanwhile, sits across the room from Knox,\ndeliberately avoiding eye contact.\n\nON THE BIG SCREEN: As the videocamera passes a room\nmarked with an intimidating warning sign...\n\n<b>                           KNOX\n</b>             There!\n\n<b>VIDEO FREEZES.\n</b>\n<b>                           KNOX (CONT'D)\n</b>             That's the room with the\n             mainframe. Everything at Red Star\n             goes through that system.\n\n<b>                           CHARLIE'S VOICE\n</b>             So if we want to find proof that\n             Red Star stole Knox's technology,\n             that's the computer to tap.\n\n<b>                           KNOX\n</b>             Exactly. But they have heavy firewalls\n             and encryption. You can't jack in from\n             outside. You'll have to physically be\n             in that room to get at the data.\n\n<b>                           ALEX\n</b>             Even if we do get inside, there won't\n             be time to search for it. There's got\n             to be a hundred terabytes of\n             information there. It could take days.\n\n<b>                           NATALIE\n</b>             So you install a transmitter.\n\nAll eyes go over to Natalie.\n\n<b>                           NATALIE (CONT'D)\n</b>             Patch in directly to the relay,\n             broadcast on a high frequency.\n             That way, you can have access to\n             the mainframe from the comfort of\n             your own home. And they have no\n             idea that you can peek inside.\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               55.\n</b>\n<b>CONTINUED:\n</b>\nKnox is impressed.    The other angels nod.   It's a good idea.\n\n<b>                           VIVIAN WU\n</b>             That's all fine in theory. But you\n             still have to get inside that room\n             to install it. What about security?\n\n<b>                           ALEX\n</b>             Red Star has a lot of Government\n             contracts, so security is tight. Key-\n             card badges throughout. Redundant\n             security at all red-line areas with\n             biometric scanners and weekly keycodes.\n             Pervasive video surveillance, lasers,\n             air-displacement sensors. Plus a hard-\n             wired fail-safe at the relay to prevent\n             exactly this kind of tapping.\n\n<b>                           VIVIAN WU\n</b>             It sounds impossible.\n\nAlex checks with her fellow angels.    They're in agreement.\n\n<b>                           DYLAN\n</b>             It sounds like fun.\n\nWith a subtle RUSH, we move into a stylized MONTAGE that\nshows How They Do It. It features WHIP PANS, FREEZE\nFRAMES and ZOOMS to show us only the highlights.\n\n<b>                           NATALIE (V.O.)\n</b>             Only the two directors can disengage the\n             fail-safe. We have to get their keys.\n\n<b>WHIP CUT TO:\n</b>\n<b>INT. NUDE NUDE NUDE GIRLS - DAY\n</b>\nANGLE ON DIRECTOR #1, 40's, part of the lunchtime crowd.\nAlex and Natalie are on the catwalk, in the middle of a\ngrinding routine. Paying for his drink, he fumbles with\nhis wallet. His waitress helps him find the right bill.\n\nAs she walks away, we see the waitress is Dylan. FREEZE FRAME.\nWe ZOOM IN on the orange key-card she's grabbed from him.\n\n<b>EXT. BACK YARD BIRTHDAY PART - DAY\n</b>\nANGLE ON Bosley, done up in full clown makeup. He tries\nto twist a balloon animal, but no luck. Finally it POPS.\nThe CHILDREN CRY.\n\nEntertaining the ADULTS, magician Alex whips open her silk\nhandkerchief to reveal that the \"item\" has disappeared.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  56.\n</b>\n<b>CONTINUED:\n</b>\nANGLE ON DIRECTOR #2, who looks very worried. Magician's\nassistant Dylan takes off her giant hat to reveal the director's\nbillfold is underneath. Getting it back, he's\nrelieved.\n\nPassing behind Dylan, Natalie takes the orange keycard\nDylan hands off. FREEZE FRAME. ZOOM IN.\n\n<b>                           ALEX (V.O.)\n</b>             Then we have to get back into Red\n             Star. Problem is, their biometric\n             sensors are too good.\n\n<b>                           DYLAN (V.O.)\n</b>             We need someone's help.\n\n<b>                                                 WHIP TO:\n</b>\n<b>EXT. STREET OFF MULHOLLAND - DAY\n</b>\nANGLE ON Roger Corwin, driving his Mercedes.     He slows,\na road crew working ahead.\n\nANGLE ON Dylan, dressed in an orange vest, manning the\nslow/stop sign. She makes Corwin stop, leans in to\napologize for the delay.\n\nBehind the Mercedes, Natalie sneaks up. She quickly\npicks the trunk lock, then quietly climbs in. She hoists\nin a large duffel bag, then shuts herself inside.\n\n<b>INT. TRUNK OF CORWIN'S MERCEDES - DAY\n</b>\nWe HEAR the car moving again.\n\nStripped down to a bra, Natalie attaches an illuminated mirror\nto the underside of the trunk lid. Starts to pull more items\nfrom her duffel bag: black shoes, a dress shirt, a tie.\n\n<b>EXT. RED STAR - DAY\n</b>\nEstablishing. We see Corwin's Mercedes pull into the\nparking garage.\n\n<b>INT. PARKING GARAGE / RED STAR - DAY\n</b>\nWalking away from the car, Corwin hits the remote.    The\nMercedes BWOOPS.\n\nA beat later, a hand comes out from under the trunk lid.\nNatalie climbs out, only she's not Natalie anymore.\n\nShe's become Corwin -- identical to the last detail.\n\nShe tucks the last of the latex mask under her collar as\nshe walks. FREEZE FRAME.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 57.\n</b>\n<b>INT. SECURITY STATION - DAY\n</b>\nCorwin puts his right hand on the sensor grid.    A laser\nscans it. Approved.\n\nThe Security Guard hits the button, releasing the gate.\nHe goes back to his magazine as Corwin passes through.\nA beat, then...\n\n<b>                       A VOICE\n</b>          Tommy? You gonna let me through\n          or what?\n\nTommy the Guard looks up, sees Corwin is still at the\ncounter.\n\n<b>                           TOMMY THE GUARD\n</b>                    (confused)\n          Oh.     Yeah, sorry Mr. Corwin.\n\nHe hits the button again, letting Corwin through. Tommy\ngoes back to his magazine, still a little perplexed.\n\n<b>INT. SECURE HALLWAY - DAY\n</b>\nThe same places we saw on the videotape. Natalie-as-\nCorwin swipes the two stolen failsafe cards in a reader,\nsending the lights from red to green. FREEZE FRAME.\n\nShe splices in a transmitter the size of a cigarette pack.\nPulls up a tiny antenna. FREEZE FRAME.\n\n<b>INT. SECURE HALLWAY - DAY\n</b>\nCorwin walks down the hall, still talking with his\ncolleague. Natalie-as-Corwin is walking right towards\nthem. She turns away as she passes. He didn't even spot\nher.\n\nShe smiles.\n\n<b>                                                 CUT TO:\n</b>\n<b>EXT. POSH BEVERLY HILLS HOTEL - DAY\n</b>\nEstablishing...\n\n<b>INT. RESTAURANT - DAY\n</b>\nAs a group, the angels move through the upscale lunch\ncrowd to find Knox and Vivian Wu at a booth.\n\nAlex opens a slim Sony laptop, sets it on the table.\n\n<b>                        ALEX\n</b>          It's done. Red Star's mainframe\n          is open for business.\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  58.\n</b>\n<b>CONTINUED:\n</b>\nAstonished, Vivian Wu hits some keys, checking that what\nthey say is true.\n\n<b>                           DYLAN\n</b>                    (to a passing waiter)\n             Champagne, please. Your best.\n\nSmiling, Knox motions for them to take a seat.\n\n<b>                           KNOX\n</b>             Now I know why I hired you.   You're\n             the best.\n\nA look between the angels.      They know it's true.\n\n<b>                           VIVIAN WU\n</b>                    (to Knox, re: laptop)\n             I'll have Systems get to work on\n             this right away.\n\nShe reaches for the laptop.      Bosley snatches it away.\n\n<b>                           BOSLEY\n</b>             Uh, actually Miss Wu, WE will get to\n             work on this right away. Any evidence\n             we find will be turned over to you AND\n             the proper authorities.\n\n<b>                           VIVIAN WU\n</b>             I don't think you understand how\n             important that data is, Mr...\n\n<b>                           BOSLEY\n</b>             Oh, indeed I do. And that's why I'll\n             take very good care of it when I find it.\n\n<b>                             VIVIAN WU\n</b>                      (reaching for the laptop)\n             But...\n\n<b>                           KNOX\n</b>             Vivian, please. Do as the man says.\n\nReluctantly, Vivian Wu pulls her hand away. Bosley tucks\nthe laptop into a steel briefcase, then stands.\n\n<b>                           DYLAN\n</b>             Where you off to, Bos?\n\n<b>                             BOSLEY\n</b>             Vacation.\n\n<b>                           NATALIE\n</b>             Uh oh, lemme guess. You're off to\n             chase bikinis at some tropical resort?\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  59.\n</b>\n<b>CONTINUED:\n</b>\n<b>                            BOSLEY\n</b>             Exactly!   Fire Island, here I come!\n\nDylan does a spit take, the other two Angels roll their eyes.\n\n<b>                            BOSLEY (CONT'D)\n</b>             Goodbye, Angels. Mr. Knox.\n                     (coldly)\n             Ms. Wu.\n\nAs Bosley exits the restaurant, Vivian Wu eyes him\ncarefully. Knox raises a glass to toast the Angels.\n\n<b>                           KNOX\n</b>             More champagne?\n\n<b>                            NATALIE\n</b>             Have to go.   Plans tonight.\n\n<b>                             ALEX\n</b>             Me too.\n\nAs they get up...\n\n<b>                           KNOX\n</b>                    (to Dylan)\n             And you?\n\nShe notices the other Angels staring at her.        She doesn't answer\nat first.\n\n<b>                             DYLAN\n</b>             Um... well...\n\nNatalie quickly picks up what's going on.        She glances at\nAlex, then clears her throat.\n\n<b>                           NATALIE\n</b>             Hey Dylan, can we talk to you\n             for a second?\n\n<b>THE LADIES ROOM\n</b>\nNatalie, Alex, and Dylan kibbitz near the sinks.\n\n<b>                           NATALIE (CONT'D)\n</b>             There's something going on between\n             you and Knox. Isn't there?\n\n<b>                           DYLAN\n</b>             So what, so I like him.   Is that\n             so wrong?\n\n<b>                           NATALIE\n</b>             Uh, yeah Dylan, it IS.    He's a client.\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                     60.\n</b>\n<b>CONTINUED:\n</b><b>                             DYLAN\n</b>             WAS a client.    We finished the job.\n\n<b>                           ALEX\n</b>             She's got a point.\n\n<b>                           NATALIE\n</b>             What? She doesn't have ANY point, Alex,\n             I can't believe you're siding with her.\n\n<b>                           ALEX\n</b>             I'm not siding with anyone, but\n             technically, he is no longer...\n\n<b>                           NATALIE\n</b>             You know Charlie would NEVER\n             approve of this.\n\n<b>                           ALEX\n</b>             Oh come on, Charlie wouldn't care. I\n             think you're just being overly cautious.\n\n<b>                            DYLAN\n</b>             Uh, guys?   GUYS!\n\nThey turn to look at her.\n\n<b>                           DYLAN (CONT'D)\n</b>             I'm a big girl. I make my own\n             decisions. I'm going out with him.\n\nShe walks out of the ladies' room.\n\n<b>                                                     CUT TO:\n</b>\n<b>INT. PARKING GARAGE / BEVERLY HILLS - DAY\n</b>\nBosley hums \"In the Navy\" to himself as he walks through\na parking garage. He's alone in the echo-y garage, and\neverything we know about movies tells us This Means Trouble.\n\nBWEEP BWEEP as his alarm shuts off. Just as he's about\nto lift the handle, he stops. Looks back over his shoulder.\n\nDid he hear something? He scans the empty garage.         No\none in sight. Must've been his imagination.\n\n<b>INT. BOSLEY'S MERCEDES - DAY\n</b>\nBosley climbs in, shutting the door behind him.        He's\nputting the keys in the ignition, when...\n\nA HAND clamps a chloroformed rag over his mouth. It's\nthe Thin Man. Bosley struggles, but in moments, he's\nunconscious.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                61.\n</b>\n<b>OUTSIDE THE CAR\n</b>\nTHE THIN MAN stuffs Bosley in the trunk, slams it shut,\nrevealing...\n\n<b>                          VIVIAN WU (O.S.)\n</b>          Sweet dreams.\n\nVivian Wu, standing beside the Thin Man. She's holding\nthe case Bosley refused to give her before.\n\n<b>                        THE THIN MAN\n</b>          So, now we have the transmitter, what\n          do we do with fat boy? Dirt nap time?\n\n<b>                        VIVIAN WU\n</b>          NO! Not until I've got the\n          information I need. We'll take\n          him to the compound, hold him there.\n                 (beat)\n          In the meantime, we've got to tie\n          up some loose ends.\n\n<b>                        THIN MAN\n</b>          Whenever you say something like\n          that, it means more work for me.\n\n<b>                        VIVIAN WU\n</b>                 (ignoring him)\n          The Angels will figure out they\n          were duped. We can't afford them\n          jeopardizing our plans.\n\n<b>                        THE THIN MAN\n</b>          Here it comes...\n\n<b>                        VIVIAN WU\n</b>                 (coldly)\n          We have to Kill Charlie's Angels.\n\nThe Thin Man sighs, whips out his cell phone.\n\n<b>                        THE THIN MAN\n</b>          Guess I'll cancel my weekend plans.\n\nAnd speaking of weekend plans...\n\n<b>                                                CUT TO:\n</b>\n<b>EXT. ITALIAN STREET - NIGHT\n</b>\nJason and Alex are walking down a beautiful, tree-lined\ncobblestone street, holding hands. The buildings and\noutdoor cafes are reminiscent of a quaint, vaguely\nEuropean town.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   62.\n</b>\n<b>CONTINUED:\n</b><b>                           JASON\n</b>             Alex, I can't tell you how happy I\n             am you came.\n\n<b>                              ALEX\n</b>             Me too.\n\n<b>                           JASON\n</b>             No, I mean, it's weird. It's\n             weirding me out how happy I am when\n             you're around. Am I sick or something?\n\n<b>                              ALEX\n</b>                       (smiling)\n             Got me.\n\n<b>                           JASON\n</b>             The only bummer is, I start to\n             jones when you're not around.\n             What the hell am I gonna do this\n             weekend, if you're not with me?\n\n<b>                           ALEX\n</b>             We'll get you some sedatives.\n             You'll be fine.\n\nHe stops, takes her in his arms. With the moonlight\nshining down, it's very romantic. They kiss. Then...\n\n<b>                            JASON\n</b>             Hey.   Wait a second.   Come with me!\n\n<b>                              ALEX\n</b>             Come with you?\n\n<b>                           JASON\n</b>             Miami, on the Sony Jet. I've got\n             two tickets to the Final Four.\n\n<b>                           ALEX\n</b>             Jason, I don't...\n\n<b>                           JASON\n</b>             Wait, before you say no, let me just\n             say something, okay? I'm sick of how\n             little we see each other. I'm sick of\n             stealing a day here, or a week there.\n\n<b>                           ALEX\n</b>             It's my job, Jason. I can't\n             explain it, but I have to be on\n             call, all the time, and...\n\n<b>                           JASON\n</b>             What if I changed all that?\n<b>                           (MORE)\n</b><b>                                                     (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  63.\n</b>\n<b>CONTINUED:\n</b><b>                           JASON (CONT'D)\n</b>             What if I told you to quit your\n             job, and come live with me. What\n             I'm saying, Alex, is that I want\n             you to...\n\nBLAM!    BLAM!   Gunshots ring out!\n\n<b>                            ALEX\n</b>             Gunfire!   Get down!\n\nAlex, in Angels mode, immediately throws him to the\nground and covers him. She feels something wet, looks\ndown to see Jason's chest, covered in blood.\n\n<b>                           ALEX (CONT'D)\n</b>             My God, you're hit. You're...\n\n<b>                           JASON\n</b>             Fine.  I'm fine.\n                    (he laughs)\n             They're squibs, it's fake.   See?\n\nHe wipes off a little, puts it on her tongue.     Finally\nconvinced, she almost lets herself laugh.\n\n<b>REVEAL\n</b>\nthat we are in a soundstage, the cobblestones street is\njust a set. The gunfire was coming from some effects\nguys, who are test firing guns for the upcoming action\nscene just outside the soundstage, visible through the\nopen loading door.\n\n<b>                           JASON (CONT'D)\n</b>             Fake guns, too. They're just\n             setting up for the next scene.\n\nHe helps her up.\n\n<b>                           ALEX\n</b>             Sorry about that, I...\n\n<b>                           JASON\n</b>                    (smiling)\n             God, I loved that. The way you\n             yelled and everything? Baby, you\n             been watching too many movies.\n                    (he kisses her on the nose)\n             Alright, I gotta go reset these.\n             DON'T GO ANYWHERE. I want to\n             finish this conversation.\n\nAs he walks out of the soundstage, Alex is left behind,\nalone. She cleans herself off, shaking her head at her\nown paranoia.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               64.\n</b>\n<b>CONTINUED:\n</b>\n<b>                            ALEX\n</b>             Nice, Alex.   Real nice.\n\n<b>THIPP!\n</b>\nA wall next to her sprays a cloud of plaster.     Alex looks\nat the hole. That's strange.\n\n<b>THIP, THIP!\n</b>\nTwo more little explosions, these barely missing her face.\n\n<b>                           ALEX (CONT'D)\n</b>             Hey, is someone firing more squibs\n             or...\n\nSuddenly, without warning, the wall is plastered with\nSILENCED GUNFIRE. It's only Alex's instincts that let\nher duck in time to avoid being turned into Swiss cheese.\n\nShe tucks and rolls behind a Styrofoam set as...\n\nTWO GUNMEN with silenced SNIPER rifles fan out on the\nfake city street.\n\n<b>ON ALEX --\n</b>\ncrouched behind a wall.\n\nShe looks both ways. If she tries to break for the open\nloading door, she'll lead the gunmen right back to Jason.\nOnly way out of here is to head for the far wall, all the\nway across the building, where there's a fire exit.\n\nTaking a deep breath, she darts across the fake street.\n\n<b>THE GUNMEN\n</b>\nfire at her, one of them pulling off his silencer and going\nto machine gun mode. The sound of the gunshots are covered\nby the sound of the effects guy, test firing guns outside.\n\n<b>ALEX --\n</b>\nSees that the sets are held up by wooden support beams.\nShe lifts her leg and delivers a solid blow, cracking the\ntwo-by-fours in half.\n\n<b>THE GUNMEN\n</b>\nmove slowly through the fake street set. Suddenly, they\nhear a creaking sound. They look up to see the whole,\nfake building set collapsing!\n\nThey dive out of the way, just in time to see Alex race\nthrough the fire doors.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                65.\n</b>\n<b>EXT. BACKLOT - NIGHT\n</b>\nAlex races out of the soundstage and jumps into her car,\nparked nearby. The Gunmen emerge from the stage and spot\nher, just as she gets the car started. She peels out as\na hail of gunfire just misses her windshield.\n\n<b>EXT. OPPOSITE SIDE OF THE SOUNDSTAGE\n</b>\nJason has just gotten his squibs refitted. He's facing\nthe opposite direction, so he doesn't see Alex's car\nwhizz away in the background.\n\n<b>INT. SOUNDSTAGE\n</b>\nJason walks into the Soundstage, followed by the effects crew.\n\n<b>                            JASON\n</b>          Alex?     ALEX?\n\nOf course, she's nowhere to be found. While he looks\naround, one of the effects guys fingers a bullet hole in\nthe set wall. He presses against it and a FLATTENED\n<b>BULLET FALLS OUT.\n</b>\nHe thinks for a moment, then shakes his head.   Couldn't be.\n\n<b>                                                CUT TO:\n</b>\n<b>INT. EGYPTIAN THEATRE - NIGHT\n</b>\nA passing FILMGOER reveals Natalie and Pete. Seated near\nthe aisle, they share a giant tub of popcorn. The movie\nhasn't started yet, but there's a slide show of various\nanime heroes and villains.\n\n<b>                        NATALIE\n</b>          Thanks for the second chance. I\n          swear, I'm really not a flake.\n\nHe shrugs it off.\n\n<b>                        PETE\n</b>          How can I deny any woman who's\n          seen all 23 \"Lords of Wind and\n          Power\"?\n\n<b>                        NATALIE\n</b>          I bet there's a dozen women here\n          who fit that description.\n\nShe's right.\n\n<b>                        PETE\n</b>          Honestly -- there's a looks\n          component as well.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   66.\n</b>\n<b>CONTINUED:\n</b><b>                             NATALIE\n</b>             Really.\n\n<b>                           PETE\n</b>             You're the most beautiful woman\n             I've ever seen this close up.\n\nHow can she not be flattered by that? She would say\nsomething back, but the moment has gotten so electrified\nthat each little glance just brings on more goofy-in-\nloveness.\n\nThe only solution is to leave...\n\n<b>                             NATALIE\n</b>             Ladies room.    I'll be back in two minutes.\n\n<b>                             PETE\n</b>             I'll be here.\n\n<b>INT. LADIES ROOM - NIGHT\n</b>\nA wee bit smitten, Natalie enters as the last WOMAN leaves.\n\nWe hear just the DRIP DRIP DRIP of a faucet and the Muzak\nversion of Power Station's \"Some Like It Hot.\"\n\n<b>NATALIE\n</b>\n<b>IN A STALL\n</b>\nNatalie shuts the door behind herself, then sets to work\nputting down a tissue-paper seat cover.\n\n<b>SWEEPING ACROSS THE FLOOR\n</b>\nWe look under stall doors to find a pair of black men's\nboots stepping down from inside. Natalie is not alone.\n\n<b>IN HER STALL\n</b>\nNatalie is about to hoist her skirt when she stops.         Her\nSpider Sense is tingling.\n\n<b>A DOOR LATCH\n</b>\nCLICKS open. We TILT UP to see a WELL-DRESSED MAN.          He's\nat least 6'3\".\n\nHe stops at Natalie's stall door, drawing his gun.      A\nbeat, then he KICKS the door open, revealing...\n\n<b>AN EMPTY STALL.\n</b>\nThe automatic toilet FLUSHES itself.      The Man takes a\nhalf-step in, confused. Suddenly --\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                67.\n</b>\n<b>CONTINUED:\n</b>\nThe door swings back, SMASHING into his right hand.     He\ndrops the gun, looking up to see\n\n<b>NATALIE,\n</b>\nWho is perched atop the stall walls.     She pushed the door\nwith her foot.\n\nGrabbing an overhead pipe, she performs an acrobatic\nswing, landing both feet on the guy's head. He falls\ninto the next row of stalls.\n\nNatalie reaches for the gun, but the Man grabs her ankles.\nHe pulls her back across the tile floor, flipping her over.\nThat just makes it easier for her to kick him where it counts.\n\nWith a scissors lock around his neck, Natalie is pulled\nup while the Man falls. She lands a knee on his windpipe.\n\n<b>                           NATALIE\n</b>             Who do you work for?\n\nHe tries to pull her off.    She leans in harder.\n\n<b>                           NATALIE (CONT'D)\n</b>             Speak now or never again.\n\n<b>                            THE MAN\n</b>                    (motioning with eyes)\n             Jacket pocket.\n\nSuspicious, she digs inside his coat to pull out a leather\nbillfold. Flips it open to reveal an I.D. that reads...\n\n<b>                           NATALIE\n</b>             National Security Agency?   You're with the NSA?\n\n<b>                           THE MAN\n</b>             I've been following you. I didn't\n             know which side you were on.\n                    (beat)\n             This is bigger than you think.\n\n<b>INT. MOVIE THEATER - NIGHT\n</b>\nThe anime classic is playing. Pete keeps looking back\ntowards the door. He's been ditched again. Just when he's\nabout to give up hope, Natalie is there.\n\n<b>                            NATALIE\n</b>             I'm so sorry, but I have to go. I\n             can't explain.\n                    (hands card)\n             This is my cell phone number. Please\n             call me tomorrow. Please. I'm sorry.\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                     68.\n</b>\n<b>CONTINUED:\n</b>\nWith that, she goes. A beat, then she comes back.\nKisses him once, hard. Then goes for real.\n\n<b>                                                     CUT TO:\n</b>\n<b>EXT. HOLLYWOOD HILLS - NIGHT\n</b>\nDylan and Knox walk hand in hand up a quaint, woodsy path\nbehind Knox's home. We can hear music drifting up from\nthe hill in front of them.\n\n<b>                           DYLAN\n</b>             Where's that music coming from?\n\n<b>                             KNOX\n</b>             You'll see.    Just a little farther.\n\nHe helps her up a steep part of the path.       As she comes\nover the crest of a hill.\n\n<b>                              DYLAN\n</b>             Oh...\n                       (taking in the view)\n             Oh wow.\n\n<b>DYLAN'S POV --\n</b>\nThe hill behind Knox's house has a magnificent view right\ninto the Hollywood Bowl. The music is the symphony\nplaying something very romantic.\n\n<b>                           DYLAN (CONT'D)\n</b>             That's amazing.\n\nThey stand there, together, just listening to the music,\nKnox watching her reaction closely.\n\n<b>                           KNOX\n</b>             Can I ask you a personal question?\n\n<b>                              DYLAN\n</b>             Maybe.\n\n<b>                           KNOX\n</b>             How much do you know about Charlie?\n\nDylan seems surprised by this question.\n\n<b>                           KNOX (CONT'D)\n</b>             I just find it strange that you\n             work for a man you've never met.\n\n<b>                           DYLAN\n</b>             Well, I don't know what he looks like,\n             but I feel like I know him. We all do.\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  69.\n</b>\n<b>CONTINUED:\n</b><b>                           KNOX\n</b>             And none of you have any clue who\n             he actually is?\n\n<b>                             DYLAN\n</b>             Nope.\n\n<b>                           KNOX\n</b>             And you're never curious to find out?\n\n<b>                           DYLAN\n</b>             Of course, but believe me, it's\n             impossible. I've tried.\n                    (beat)\n             Let's not talk about Charlie,\n             okay? Or work.\n\nShe smiles t him, motioning for them to go back up to\nKnox's house.\n\n<b>                           DYLAN (CONT'D)\n</b>             In fact, let's not talk at all.\n\n<b>                                                 WIPE TO:\n</b>\n<b>INT. KNOX'S HOUSE - NIGHT\n</b>\nDylan and Knox are asleep in his bed, when the doorbell\nCHIMES. Dylan bolts upright. She slips out of bed, peers\nout the window. Vivian Wu is waiting by the front door.\n\n<b>                           DYLAN\n</b>             Eric, it's Vivian.\n\n<b>                             KNOX\n</b>             Hmmm.    I wonder what she's here\n             for?\n\n<b>                           DYLAN\n</b>             Want me to tell her to come back, or...\n\n<b>                           KNOX\n</b>             No, no.  I'd better deal.\n                    (he kisses her)\n             You go back to bed.\n\nKnox pulls on a robe, goes downstairs.\n\n<b>STAY ON DYLAN --\n</b>\nas she pulls on her clothes, her CELL PHONE rings.     She\ngrabs it.\n\n<b>                             DYLAN\n</b>             Hello?\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 70.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           NATALIE\n</b>             Dylan, we were set up. Vivian Wu is not\n             who she says she is. She's a former\n             assassin and an all around bitch.\n\n<b>                            DYLAN\n</b>             Oh no.   OH SHIT. Natalie, she's HERE!\n\n<b>                            NATALIE\n</b>             What?!\n\n<b>                           DYLAN\n</b>             I'm at Knox's, she just showed up!\n\n<b>EXT. FREEWAY - NIGHT\n</b>\nDriving her own highly excellent car, Natalie has it floored.\n\n<b>INTERCUT\n</b>\n<b>                           NATALIE\n</b>             I'm ten minutes away. Wait until I\n             get there.\n\n<b>                           DYLAN\n</b>             I can't do that. Call Alex and meet\n             me here.\n\n<b>                            NATALIE\n</b>             Dylan...\n\nBut Dylan's already hung up.     Cursing her partner, Natalie\nraces the car even harder.\n\n<b>INT. KNOX'S LIVING ROOM - NIGHT\n</b>\nKnox is sitting at the coffee table, signing papers. Vivian,\nsitting across from him, has her cell phone open. They are\nboth surprised to see Dylan walk into the room.\n\n<b>                           VIVIAN WU\n</b>             I see you take your bodyguarding\n             services seriously. Still, I worry\n             that no one is watching the door.\n\n<b>                           DYLAN\n</b>                    (covering)\n             Oh, I'm watching it.     In fact, I just\n             called for back up.\n\nFrom her bag, Vivian pulls a silver 9MM.\n\n<b>                           VIVIAN WU\n</b>             All the same, I'm concerned about\n             Mr. Knox's safety.\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               71.\n</b>\n<b>CONTINUED:\n</b>\nAlthough Knox is clueless, it's clear the message Vivian\nis sending to Dylan. She's in control here.\n\nVivian sets the gun on the table, in easy reach.\n\n<b>                           KNOX\n</b>                    (explaining)\n             Vivian just came over to run through\n             some numbers for the IPO.\n\n<b>                           VIVIAN WU\n</b>             Please, take a seat. I'm almost\n             finished.\n\nWith a knowing glance at Dylan, she goes back to her\nphone call.\n\nNo alternative, Dylan takes a seat beside Knox.     Both face\nVivian, whose hand is very near the gun.\n\nDylan looks at Knox as he reads through his papers.    He has no\nidea there's anything wrong.\n\n<b>                           VIVIAN WU (CONT'D)\n</b>                    (on phone)\n             Really. How disappointing.\n\nVivian gestures to the abandoned Scrabble game on the table.\nWhy not play?\n\n<b>                           DYLAN\n</b>             I'm not much for games.\n\n<b>                            VIVIAN WU\n</b>             Pity.\n\nAs Knox flips pages in the report, Dylan casually begins\npushing Scrabble letters around, nothing serious. But she's\nmanaged to spell...\n\n<b>ENEMY\n</b>\nShe gets Knox's attention, looks to the word, up to Vivian.\nKnox follows her intention, but doesn't seem to believe it.\n\nWhile Vivian continues to talk on the phone, Knox sets his\nreport down. Pushes around some letters of his own. The\nwords finally come out as...\n\n<b>I   KNOW\n</b>\nCLOSE ON Dylan.      What does that mean?\n\nVivian snaps her phone shut.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 72.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           VIVIAN WU (CONT'D)\n</b>                    (to Knox)\n             Bad news: The other angels are still\n             alive. Good news: Everything else\n             proceeding apace.\n\nDylan stands up.    What the hell is going on?\n\nVivian draws the gun on her.    Knox moves over toward\nVivian's side.\n\n<b>                           KNOX\n</b>             Sorry Dylan. I knew this moment\n             would come sooner or later. I was\n             just hoping for later.\n\nA long beat, Dylan trying to wrap her head around this.\n\n<b>                           DYLAN\n</b>             All this time, we thought Red Star\n             was behind this, but it was you.\n                    (realizing)\n             You faked your kidnapping.\n\nKnox taps his nose.    She's got it.\n\n<b>                           DYLAN (CONT'D)\n</b>             Why?\n\n<b>                           KNOX\n</b>             To gain your trust. And get your\n             help.\n                    (beat)\n             I want you to know, my personal\n             attraction to you was a sincere\n             and unrelated complication.\n\n<b>                           DYLAN\n</b>             Oh, well, in that case I feel a lot\n             better about you being a lying pole\n             smoker.\n\nDylan looks like she's about to leap forward and tear Knox's\nthroat out. Vivian gestures for Dylan to keep stepping back.\n\n<b>                           DYLAN (CONT'D)\n</b>             I can't believe I trusted you.\n\n<b>                           KNOX\n</b>             Why not? You trust Charlie and you've\n             never even met him.\n\nDylan crosses the sill, out onto the balcony.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   73.\n</b>\n<b>CONTINUED:\n</b><b>                           KNOX (CONT'D)\n</b>             And believe me, there's a lot about\n             him that you don't know. Anyway,\n             I'm not going to be an idiot and\n             stand here talking when we could do\n             something useful, like KILL YOU.\n             Goodbye, Dylan, I'll miss you...\n\nHow right he is, because as soon as Vivian squeezes the\ntrigger...\n\nDylan drops to the floor, then rolls.\n\n<b>BLAM!\n</b>\nthe bullet misses Dylan and slams into the bulletproof window\ncausing a spider-web crack to spread. Dylan sees her\nopportunity and heads right for the window while Vivian\npumps off shots.\n\nAs she comes to the window, Dylan jumps up in the air and\ndoes a flying kick, hitting right at the spot where the\nbullet impacted.\n\n<b>SMASH!\n</b>\nThe bulletproof glass shatters outward, and Dylan flies out\nthe window, onto the ledge.\n\n<b>                            KNOX (CONT'D)\n</b>             Wow.\n                    (to Vivian)\n             I've never seen YOU do something\n             like that.\n\n<b>                            VIVIAN WU\n</b>             Oh, shut up.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. BALCONY - NIGHT\n</b>\nDylan looks over the edge of the balcony. The drop-off is\nincredibly steep -- the house is built on stilts -- and the\nfall looks like it would kill her. But she doesn't have\nmuch choice.\n\n<b>KNOX AND VIVIAN\n</b>\ncome running out onto the balcony, just in time to see Dylan\njump. They rush to the edge, look down into a forbidding\nthicket of trees.\n\n<b>                           VIVIAN WU\n</b>             She can't have survived.   It's too far.\n<b>                           (MORE)\n</b><b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                74.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           VIVIAN WU (CONT'D)\n</b>                    (beat)\n             Still, I should probably check...\n\nKnox shakes his head.\n\n<b>                           KNOX\n</b>             We've got more important things to do.\n\nThe two of them head back inside.    As they do...\n\nWe hold on the railing, then slowly start to drift down, to\nthe underside of the balcony. Dylan has attached her belt to\nthe bottom of the railing, and is hanging in the rafters. As\nshe pulls herself back up...\n<b>                                              WIPE TO:\n</b>\n<b>EXT. AIRPORT -- NIGHT\n</b>\nA black sedan pulls onto the tarmac. Knox and Vivian Wu emerge,\nthen hustle into a waiting private plane.\n\n<b>INT. ANGELS DETECTIVE AGENCY\n</b>\nNatalie, Dylan and Alex nurse their wounds and compare notes.\n\n<b>                           DYLAN\n</b>             I can't believe Knox tried to kill me.\n             I mean, I've been lied to, I've been\n             cheated on, but no guy has ever\n             tried to SHOOT me before.\n                    (coldly)\n             I'm gonna get him for that.\n\n<b>                           ALEX\n</b>             He played us from the very start.\n             It was all just so he could get us\n             to tap into Red Star. He couldn't\n             figure out a way to do it himself.\n\n<b>                           NATALIE\n</b>             Who knew that we are actually\n             tapping into the main servers for\n             The National Security Agency?\n\n<b>                           DYLAN\n</b>             And now, thanks to us, he's had hours\n             to download whatever top secret\n             information he wants, for God knows\n             what reason.\n\nThe angels take a beat to let their indignation grow.\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                            75.\n</b>\n<b>CONTINUED:\n</b><b>                           NATALIE\n</b>             Wait a minute. We installed the\n             transmitter, yes, but we never gave\n             him the receiver.\n\n<b>                             ALEX\n</b>             What?\n\n<b>                           NATALIE\n</b>             That laptop was the only way to access\n             the transmitter. And we gave the\n             laptop to...\n\nThey look at each other...\n\n<b>                             ANGELS\n</b>             Bosley!\n\nAnd on that note...\n\n<b>EXT. BEACHFRONT COMPOUND - FLORIDA COASTLINE - DAY\n</b>\nWe PUSH IN over the water to reveal the massive complex -- half-\nvilla, half-castle. Built into the green hills, it's\nflanked by oversized windmills.\n\n<b>EXT. STAIRCASE -       DAY\n</b>\nArmed guards, as if they were necessary, make sure no one\ngoes up or down a staircase that leans up into the tower,\nwhere their dangerous prisoner is being held.\n\n<b>INT. COMPOUND TOWER - DAY\n</b>Bosley's cell, as such, is a round room.\n\nBosley flits about in a panic. He's hardly touched the gourmet\nfood on his tray. Except for the pudding. He loves pudding.\n\n<b>JUMP CUT TO:\n</b>\nStill a-twitter, Bosley flips through the 500 channels on\nhis big-screen TV. He watches a few moments of E!\n\n<b>JUMP CUT TO:\n</b>\nAs the Thin Man takes the tray away, Bosley suddenly attacks\nhim with the silverware. With a single hand to Bosley's\nforehead, the Thin Man holds him at arm's length, harmless.\nHe takes the weapons away.\n\n<b>JUMP CUT TO:\n</b>\nBosley WHISTLES to a bright red songbird who has landed\non the windowsill. The bird WHISTLES back. Bosley thinks\nthey're having a conversation.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  76.\n</b>\n<b>CONTINUED:\n</b>\nBosley is going a little insane.\n\n<b>JUMP CUT TO:\n</b>\nIn his spacious bathroom, Bosley is sitting on the toilet,\nrocking as he makes spaceman noises.\n\nWe hear a PLOP in the water, and then a BLEEP BLEEP.\n\nCurious, he stands up and looks in the bowl.      He's surprised\nby what he sees.\n\n<b>                                                  CUT TO:\n</b>\n<b>INT. TOWNSEND AGENCY - DAY\n</b>\nAlex is on the phone, frantically dialing numbers.\n\n<b>                           ALEX\n</b>             Come on, Bosley, answer.\n                    (she hangs up, then,\n                     to the Angels)\n             I've tried all his numbers and paged\n             him five times. No answer.\n\n<b>                           NATALIE\n</b>             I don't even want to think about\n             what I'm thinking right now.\n\n<b>                           DYLAN\n</b>             Don't!  He's alive, he's gotta be.   If...\n                    (she pauses)\n             What IS that?\n\nThere's a very faint voice coming from Bosley's desk drawer.\nDylan walks around the desk, yanks it open...\n\n<b>                            BOSLEY (O.S.)\n</b>             Angels!   Angels, can you hear me!\n\nDylan grabs the radio receiver from the drawer, holds him up.\nBosley's voice gets louder.\n\n<b>                           BOSLEY (O.S.) (CONT'D)\n</b>             I don't know if you can hear me. I don't\n             know if this thing is even working.\n\nThe Angels crowd around Dylan and the receiver.     It seems\nimpossible.\n\n<b>EXT. COMPOUND TOWER - DAY\n</b>\nCLOSE ON a satellite mini-dish mounted to the roof. We CRANE\nDOWN to look in a tower window, where Bosley is hunched over\nthe TV.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                77.\n</b>\n<b>INT. COMPOUND TOWER - DAY\n</b>\nOn the top of the TV, a wire runs from the satellite feed to --\n\n<b>THE TINY RADIO\n</b>\nthat Bosley swallowed at the spa.   It's worked its way\nthrough his system.\n\n<b>                         BOSLEY\n</b>           I know you can't answer, but... I\n           really hope you can hear this.\n\n<b>EXT. RUINS OF TOWNSEND AGENCY - DAY\n</b>\nThe angels still can't believe they're hearing his voice.\n\n<b>                         DYLAN\n</b>           Can we trace him?\n\n<b>                         NATALIE\n</b>           Not off a boosted signal. We'd\n           have to be within 20 miles.\n\n<b>                         ALEX\n</b>           Come on, Bosley. Tell us where you are.\n\n<b>INT. COMPOUND TOWER - DAY\n</b>\n<b>                         BOSLEY\n</b>           I don't know where I am, really. I'm\n           in a round room. The walls are white.\n           Well. Not white-white. More of a\n           cream, or an eggshell. Vanilla. Yes,\n           I'm going to say vanilla.\n\n<b>INTERCUT\n</b>\nThis isn't helping.\n\n<b>                         BOSLEY (CONT'D)\n</b>           I can see the ocean.\n\n<b>                         ALEX\n</b>           Bingo.\n\nDylan finds a globe amid the wreckage.     Wipes off the soot.\n\n<b>                         BOSLEY\n</b>           I don't know which ocean. I was\n           blindfolded the whole time. We were\n           flying. It must've been three or\n           four hours. Maybe more.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  78.\n</b>\n<b>CONTINUED:\n</b>\nWith her fingers, Dylan figures out how far he could have\nflown. Estimates the circumference.\n\n<b>                           DYLAN\n</b>                    (frustrated)\n             He could be anywhere in North America.\n\nThe bird Bosley was whistling to lands on the TV, looks\nat the transmitter, curious. SINGS its song.\n\n<b>                           BOSLEY\n</b>             Wherever it is, they have really\n             good pudding.\n\nNatalie holds up a finger -- stop.\n\n<b>                            DYLAN\n</b>                    (incredulous)\n             What, pudding?\n\nThe bird SINGS its song again.      Natalie smiles.\n\n<b>                          NATALIE\n</b>             Hear that? That's a blue spotted\n             egret. They only live in one place.\n\n<b>                           ALEX\n</b>             Florida.\n\nThe MUSIC revs up, as we...\n<b>                                                  CUT TO:\n</b>\n<b>EXT. VILLA COURTYARD\n</b>\nA HELICOPTER touches down inside the villa gates.     Knox\nand Vivian emerge.\n\n<b>INT. COMPOUND - DAY\n</b>\nKnox and Vivian walk into a fully macked computer room,\nwhere the Thin Man is supervising a techie as he taps away\nat Bosley's laptop.\n\n<b>                           KNOX\n</b>             Well?\n\n<b>                           THIN MAN\n</b>             Our access was cut off at the source.\n\n<b>                           KNOX\n</b><b>             GODDAMNIT!\n</b>\n<b>                           THIN MAN\n</b>             But not before we retrieved the\n             information you wanted.\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  79.\n</b>\n<b>CONTINUED:\n</b>\nThe Thin Man pulls a piece of paper out of a printer,\nhands them to Knox.\n\n<b>                           THIN MAN (CONT'D)\n</b>             The National Security Agency's secret file\n             on the man known as Charles Townsend.\n\nKnox smiles.    Takes the print-out.\n\n<b>                           KNOX\n</b>             Finally.\n                    (beat)\n             How about Bosley? Did we get the\n             information we wanted?\n\n<b>                           THIN MAN\n</b>             Once we we drugged him, he sang like a bird.\n\nThe Thin Man hands Knox another print-out.\n\n<b>                           KNOX\n</b>             Hmmm. Miami Arena.    Preparations\n             have been made?\n\n<b>                             THIN MAN\n</b>             Yes.    We move out tonight.\n\n<b>                           KNOX\n</b>             Excellent.\n                    (beat)\n             Where IS Bosley?\n\n<b>                           THIN MAN\n</b>             In the tower. We were waiting till\n             you gave the word.\n\n<b>                             KNOX\n</b>             Well?    No time like the present.\n\nThe Thin Man nods.\n\n<b>INT. KNOX COMPOUND - DAY\n</b>\nThe Thin Man cocks his gun as he heads to the tower to do\naway with Bosley. Then...\n\n<b>                             HENCHMAN\n</b>             Sir?    You should take a look at this.\n\nThe Henchman leads Thin Man into...\n\n<b>SECURITY ROOM\n</b>\nA room lined with monitors that survey the courtyard. Henchman\npoints to one in the corner.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                  80.\n</b>\n<b>CONTINUED:\n</b><b>                          HENCHMAN (CONT'D)\n</b>             See here? Look at the timer on\n             the camera.\n\n<b>                           THIN MAN\n</b>             It's not moving.\n                    (beat)\n             Oh, this is the oldest one in the\n             book. Punch up camera three.\n\nAnother camera angle comes up, this also a view of the\nempty courtyard.\n\n<b>                              THIN MAN (CONT'D)\n</b>             Now pan left.\n\nThe Henchman does what he's told and, on the monitor...\n\nWE SEE DYLAN, dressed in a black cat suit, as she rewires\na security camera. She glances around, making sure no\none sees her.\n\n<b>                           THIN MAN (CONT'D)\n</b>             The old re-loop the video camera trick.\n             And look, she's not even carrying a gun.\n                    (beat)\n             What is this, amateur hour?\n\n<b>                                                  CUT TO:\n</b>\n<b>EXT. COURTYARD - DAY\n</b>\nDylan sneaks her way through the courtyard, doing an\nadmirable job of trying to stick to the walls. As she\ncomes around the corner.\n\n<b>                              THIN MAN (O.S.)\n</b>             Um, excuse me?     I think you're\n             trespassing.\n\nShe whips around to see the Thin Man, standing right\nbehind her. She instantly swings at him, he blocks it.\nShe's about to swing again when five guns get cocked\nagainst her temple. She's surrounded by guards.\n\n<b>NOW --\n</b>\nThe thin man and his boys lead Dylan into the house.\n\n<b>                           THIN MAN (CONT'D)\n</b>             No offense, but as \"storming the\n             castle\" plans go, this one sucked.\n\n<b>                          DYLAN\n</b>             Oh yeah? And I suppose you could\n             do better?\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 81.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           THIN MAN\n</b>             Yeah, I sure as hell could.\n\n<b>                           DYLAN\n</b>             Oh, right.\n\n<b>                           THIN MAN\n</b>             How about an underwater entry? Or\n             hang gliding over the main tower?\n             There's a million good ways in, if\n             you just do your homework.\n\nDylan glares at him, and as she does...\n\nWe move in CLOSE ON Dylan's funky belt buckle.       There's a\ntiny camera concealed there.\n\n<b>EXT. OUTSIDE THE COMPOUND - DAY\n</b>\nNatalie and Alex huddle around a three-inch monitor,\ngetting live video from Dylan's camera.\n\n<b>                           ALEX\n</b>             You heard the man.\n\n<b>                           NATALIE\n</b>             Nice work, Dyl.\n\nThey move into action.\n\n<b>EXT. SECOND STORY VERANDAH - DAY\n</b>\nDylan is led inside by the Thin Man.       Knox is waiting for her.\n\n<b>                           THIN MAN\n</b>             Present for you, sir.\n\n<b>                           KNOX\n</b>             Dylan, how nice. Welcome to my\n             Florida home. Not as tasteful as\n             the one in LA, but much more private.\n\nShe shrugs off the goons -- enough already.\n\n<b>                           DYLAN\n</b>             So tell me, Knox, what's the brilliant\n             plan? You gonna sell a list of our\n             foreign spies to the highest bidder?\n             Blackmail the President?\n\n<b>                           KNOX\n</b>             The first plan is too complicated,\n             and the second is virtually\n             impossible.\n<b>                           (MORE)\n</b><b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 82.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           KNOX (CONT'D)\n</b>             Besides, I already have all the\n             money I need and my motivation is\n             much simpler...\n                    (leaning in close to her)\n             ... revenge.\n\n<b>                            DYLAN\n</b>             Revenge?   Against who?\n\n<b>                           KNOX\n</b>             You know what? I'm not in a gabby mood\n             right now. I've got a score to settle.\n\nHe flips shut a suitcase filled with C-5 explosive, the\nsame stuff we saw Pascal selling in the opening scene.\n\n<b>                           DYLAN\n</b>             Seems like you're going a bit overboard.\n\n<b>                           KNOX\n</b>             No, just leaving myself plenty of\n             margin for error. Goodbye, Dylan.\n\nWith that, he walks out of the room.\n\nThe Thin Man signals to the Henchmen. Two of them force\nDylan to sit in one of the wooden deck chairs.\n\nThen, with the thick packing tape, they begin binding her\narms to the arms of the chair. As they do:\n\n<b>                           DYLAN\n</b>             I don't know why you bother.   I've\n             already won.\n\n<b>                            THIN MAN\n</b>             Is that so?\n\n<b>                           DYLAN\n</b>             Every moment I sit here is a\n             moment I'm using to figure out how\n             to take you down. In fact, this\n             statement -- this one I'm making\n             right here-- is just me stalling\n             for time while I decide which of\n             your goons I'm going to flatten\n             first.\n                    (whispering)\n             It's gonna be the guy behind me.\n\nThe Thin Man can't help but be amused. After all, there\nare six guards and one blonde -- who is now taped to a\nchair.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               83.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           THE THIN MAN\n</b>             Really?\n\n<b>                            DYLAN\n</b>             By the time your guys are firing,\n             I'll be at about 180 on my reverse\n             inverted 360, which will land me\n             on Fat Boy there, as promised.\n                     (nods to the second guard)\n             He'll take the chair seat in the\n             chin.\n                     (re: two others; very slowly)\n             Now... I'm warning both of you:\n             I'm going to get you to shoot each\n             other. I know. Cliche as that\n             sounds.\n                     (then to the last two)\n             Last, you guys -- hell, I'll make\n             something up. We'll have fun.\n\nThe Thin Man smirks oh-so-confidently.\n\n<b>                           THE THIN MAN\n</b>             And what will you do to me?\n\n<b>                            DYLAN\n</b>             You won't even be here. I mean, I\n             don't want to tell you how to do\n             your job, but you should've killed\n             me by now. Because I already know\n             that your people are onto my\n             people, which means any moment now\n             you're going to be called out to\n             go and deal --\n\nSuddenly the door flies open and --\n\n<b>                           DYLAN (CONT'D)\n</b>             Ah!   See?\n\n<b>                           HENCHMAN AT THE DOOR\n</b>             We have intruders.\n\nWith a glare to Dylan, the Thin Man follows him out.\n\n<b>INT. UNDERWATER GROTTO\n</b>\nAlex, dressed in a sexy bikini, emerges from the water\nand instantly takes out two guards.\n\n<b>EXT. SMALL GARDEN - DAY\n</b>\nNATALIE hang-glides into a courtyard, knocking out two\nhenchmen as she does. Alex catches up with her, as\nNatalie pulls out a small scanner.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               84.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           NATALIE\n</b>             Bosley's close.\n\n<b>                             ALEX\n</b>             You find him.    I'll get Dylan.\n\nNatalie heads left.     Alex goes right.\n\n<b>INT. TOWER OFFICE - DAY\n</b>\nRacing up the stairs, Natalie enters a round room with\nopen windows on all sides. A gentle breeze stirs the\ncurtains. There's an amazing 360 degree view, from hills\nto ocean.\n\nAccording to her scanner, Bosley should be here, but\nthere's no one.\n\n<b>                           NATALIE\n</b>                    (yelling)\n             BOSLEY! Bosley, can you hear me?\n\n<b>INT. BOSLEY'S ROUND ROOM      DAY\n</b>\nHearing her voice, the feral Bosley looks up.\n\n<b>                            BOSLEY\n</b>             Natalie!   Is that you?\n\n<b>INT. TOWER OFFICE - DAY\n</b>\nShe hears him. She keeps yelling -- so does he -- until\nthey both realize that his room is above hers.\n\n<b>                           NATALIE\n</b>             How do I get up to you?\n\n<b>                           BOSLEY\n</b>             There's a staircase. Look for a\n             switch.\n\nShe begins frantically checking the desk, the shelves,\neverything.\n\nHer cell phone RINGS.     She answers it.\n\n<b>                           NATALIE\n</b>             Hello?... Pete, hi! How are you?\n\n<b>INT. BILTMORE HOTEL - DAY\n</b>\nOn break, Pete is talking on a pay phone.\n\n<b>                           PETE\n</b>             I'm good. I just -- you said you\n             wanted me to call.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                85.\n</b>\n<b>INT. TOWER OFFICE - DAY\n</b>\nNatalie keeps checking the shelves, looking for a secret\nswitch.\n\n<b>                          NATALIE\n</b>           I did. I do.    I mean, thank you\n           for calling.\n\n<b>INTERCUT\n</b>\n<b>                         PETE\n</b>           I'm not an insecure person or anything,\n           and I've really enjoyed the very brief\n           time we have spent together.\n\nTwo GOONS race up the stairs into the office.   Natalie\nturns to face them.\n\n<b>                         PETE (CONT'D)\n</b>           I'm just wondering if it's\n           something I said or did that's\n           making this whole thing so weird\n           between us.\n\nThe Goons approach.\n\n<b>                         NATALIE\n</b>                  (into phone)\n           Can you hold on a sec?\n\nHitting MUTE, Natalie kicks the chair behind her and dives\nunder the desk. She comes up on the other side with a\n\n<b>SURGE SUPPRESSOR,\n</b>\nelectric cords attached. She backhands it into the\ngoons, who jerk and twitch as electricity shoots through\ntheir bodies.\n\n<b>                         NATALIE (CONT'D)\n</b>                  (un-muting)\n           One more sec.\n\nShe re-mutes.\n\nWith a roundhouse kick, she flattens one of the goons,\nWHACKS the other with the cell phone.\n\nThe first goon charges at her, but she sidesteps at the\nlast moment, leaving Goon One to hit Goon Two. Both men\ntopple through the open window, falling. Yikes.\n\n<b>                         NATALIE (CONT'D)\n</b>                  (un-muting)\n           Sorry about that.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              86.\n</b>\n<b>CONTINUED:\n</b><b>                           PETE\n</b>             Listen, is this a bad time?\n\n<b>                            NATALIE\n</b>             No.   Not at all.\n\nShe starts searching again for the switch.\n\n<b>                           PETE\n</b>             You just sound distracted.\n\n<b>                           NATALIE\n</b>             You know, work this week has been\n             really busy. It's been hard to focus.\n\nBEHIND NATALIE, Vivian Wu reaches the top of the stairs.\nShe moves stealthily. Natalie has no idea she's there.\n\n<b>                           NATALIE (CONT'D)\n</b>             See, the thing is, I'm not a full-\n             time waitress. I should have been\n             more up-front about that, it's just...\n\nAt the last moment, Natalie catches a moving reflection\nin a shiny trophy. Turns to find Vivian Wu swinging an\nantique chair at her head.\n\nShe ducks.    The chair SHATTERS the display case.\n\nScrambling to get away, Natalie drops the phone.\n\n<b>                           PETE\n</b>             Natalie, what was that?\n\n<b>                           NATALIE\n</b>                    (yelling to phone)\n             Everything's fine!\n\n<b>                           VIVIAN WU\n</b>             Hate to disagree.\n\nVivian upends the desk, nearly crushing Natalie. Vivian\njumps on top, ready to kick the shit out of our angel.\n\nAs we probably suspected, Vivian Wu is one hell of a\nmartial artist. Fortunately, so is Natalie.\n\nIn their first series of blows, Vivian seems to have the\nupper hand, but Natalie rallies hard. Vivian surprises\nher with a floor-sweeping kick, knocking her down.\n\nVivian grabs the phone off the floor.\n\n<b>                           VIVIAN WU (CONT'D)\n</b>             Is this the famous Charlie?\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                87.\n</b>\n<b>CONTINUED:\n</b>\n<b>                            PETE\n</b>                    (confused)\n             No, it's Pete.\n\nVivian looks at the phone. Who the fuck cares?      She\nthrows the phone out the open window.\n\nGetting up, Natalie stares her down, incredulity building\nto rage.\n\n<b>                            NATALIE\n</b>             You bitch!   I like that guy.\n\nMocking, Vivian wipes away a tear.\n\nNatalie lets forth a typhoon of fury, a full-out Mortal\nKombat. Vivian is thrown back against the bookcase,\nwhere she knocks over a candlestick.\n\nThat's the trigger for the bookcases to begin sinking\ninto the floor. Circling around the room, each set of\nshelves drops to a different level, forming steps that\nlead to the upstairs room.\n\nAs Natalie and Vivian continue to fight, Bosley sticks\nhis head down from above, watching the brawl. Natalie is\nkicking ass.\n\n<b>                           NATALIE (CONT'D)\n</b>                    (to Vivian)\n             Do you have any idea how difficult it\n             is to find a quality man in Los Angeles?\n\nShe slams Vivian into the wall.      Grabs her again, hands\naround her head.\n\n<b>                             VIVIAN WU\n</b>             To be honest?\n\nVivian suddenly leans forward and KISSES her, right on\nthe lips.\n\n<b>                             VIVIAN WU (CONT'D)\n</b>             I don't care.\n\nNatalie is surprised for a moment, which gives Vivian the\nchance to swing at her. She misses.\n\n<b>                           NATALIE\n</b>             I can handle villainy. I can even\n             handle super-villainy.\n                    (Vivian swings and\n                     misses again)\n             But what you did is just wrong.\n\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                              88.\n</b>\n<b>CONTINUED:\n</b>\nShe head-butts Vivian, knocking her out cold.   She throws\nthe limp body on the floor.\n\nA beat, then Natalie looks up to see Bosley.\n\n<b>                           NATALIE (CONT'D)\n</b>                    (suddenly chipper)\n             Hi, Bos!\n\nHe waves.\n\n<b>EXT. VERANDAH - DAY\n</b>\nFrom below, we hear SECURITY WHISTLES. The compound has been\nbreached. Dylan looks at the six armed guards surrounding her.\n\n<b>                           DYLAN\n</b>             Here we go.\n\nAnd now she does exactly what she told the Thin Man she'd do:\n\nShe pitches forward, ducking her head so the chair's back\ncrashes into the railing, tearing it off. She stands.\n\n<b>                           DYLAN (CONT'D)\n</b>             Okay, that part worked.\n\nThe Guards FIRE -- but Dylan has already launched herself\nfrom the railing into that backflip, which lands her on\nthe head of --\n\nFat Boy, flattening him bad, and smashing the rest of the\nchair into kindling. She grabs the wooden seat and whips\nit up, catching bullets from Guard #3 before flinging it\nlike a Frisbee at Guard #2, nailing him right on the chin.\n\nQuickly she stands again, between Guards #3 and 4.\n\n<b>                           DYLAN (CONT'D)\n</b>             Now, guys, I warned you. This is\n             where you shoot each other.\n\nThe two men scoff, disbelieving. Then Dylan does a head\nfake, both Guards panic, and fire, but Dylan drops, leaving\neach man a clear shot at the other. Both gape. Both fall.\n\nJust Guards #5 and 6 left.    Dylan's chair arms are still\ntaped to her forearms.\n\n<b>                           DYLAN (CONT'D)\n</b>             Okay, here's where we improvise.\n\nIn a whirl, she overhead-chops Guard #5. Drives her\nright arm into his shoulder while swinging her left arm\ninto the back of the Guard #6's head.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   89.\n</b>\n<b>CONTINUED:\n</b>\nA few more blows, then both men fall.\n\nNow Dylan drops into a second chair, half-exhausted,\nhalf-amused with herself. Has one brief beat to take it\nall in, then --\n\nBosley steps onto the veranda, sees Dylan sitting in the\nchair.\n\nFROM HIS POINT OF VIEW: It looks like Dylan -- whose\narms are still strapped to the arms of the first chair --\nis taped to the chair she now sits in.\n\n<b>                           BOSLEY\n</b>             Oh my God, let me help you.\n\nBosley hurries over, \"freeing her.\" Amused, Dylan lets\nhim. Natalie steps out from inside, pausing to KICK one\nguard who was starting to revive.\n\n<b>                                                   CUT TO:\n</b>\n<b>EXT. KNOX COMPOUND - DAY\n</b>\nKnox, carrying the briefcase bomb, gets into his waiting\nhelicopter, followed closely by the Thin Man.\n\n<b>                           KNOX\n</b>             Let's GO!\n\nThe helicopter quick ascends, just as...\n\n<b>                           DYLAN (O.S.)\n</b>             Damn!\n\n<b>THE THREE ANGELS\n</b>\nrun into the courtyard.\n\n<b>                           NATALIE\n</b>             Don't worry, we'll get him.\n\n<b>                           DYLAN\n</b>             You don't understand. He's got a\n             pound of C-5 in that briefcase.\n\n<b>                           ALEX\n</b>             The question is, where's he headed?\n\n<b>                           BOSLEY (O.S.)\n</b>             Miami.\n\nThe three angels turn to see Bosley, huffing and puffing\nhis way into the courtyard.\n\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 90.\n</b>\n<b>CONTINUED:\n</b><b>                           BOSLEY (CONT'D)\n</b>             The man Knox is trying to kill has two\n             general admission tickets to the Duke-\n             Maryland game at Miami Arena. He's going\n             to blow up the arena and kill his target.\n\n<b>                           DYLAN\n</b>             Not that I don't believe you, but how\n             exactly do you know all this?\n\n<b>                           BOSLEY\n</b>             Because Angels, I was the one who\n             purchased those tickets.\n\n<b>                           NATALIE\n</b>             But Bosley, you HATE sports, why\n             would you...\n                    (suddenly getting it)\n             You didn't buy them for yourself.\n\n<b>                           ALEX\n</b>             You bought them for...\n\nBosley lowers his head.    Suddenly all the angels understand.\n\n<b>                           ANGELS\n</b><b>             CHARLIE!\n</b>\nThey race out the courtyard, in hot pursuit.\n\n<b>                                                 CUT TO:\n</b>\n<b>INT. MIAMI - DAY\n</b>\nRacing across the water, we find thong-clad BEACH BABES\nmoving to a Latin beat. Art Deco buildings flank sun-kissed\nstreets. The people are sexy, the daiquiris strong, and every\nnight's a fiesta -- Welcome to MIAMI.\n\nRunning down the street, towards Miami Arena, the three\nangels pass THREE OTHER WOMEN rollerblading by: JILL\nMONROE, SABRINA DUNCAN and KELLY GARRETT.\n\nNothing is said, but a cool moment just happened.\n\n<b>                                                 CUT TO:\n</b>\n<b>INT. LONG, LONG, HALLWAY -- LATER\n</b>\nThe three Angels are running down a very long hallway.\nTheir voices are the only sound that echoes off these\nwalls, although there is a faint humming that grows louder\nas they approach two, metal fire doors.\n\n<b>                           DYLAN\n</b>             What do you think he looks like?\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                   91.\n</b>\n<b>CONTINUED:\n</b><b>                           ALEX\n</b>             Sixty, tall, well-built.\n\n<b>                           NATALIE\n</b>             I always saw him as younger.\n\n<b>                            DYLAN\n</b>             Definitely.   With black hair.\n\n<b>                           NATALIE\n</b>             No, silver hair. And tan.\n\n<b>                           ALEX\n</b>             He's not George Hamilton.\n\n<b>                           NATALIE\n</b>             He's outside a lot.\n\n<b>                           DYLAN\n</b>             We'll know him when we see him,\n             that's for sure.\n\n<b>                              ALEX\n</b>             IF we see him.\n\n<b>                           NATALIE\n</b>             How hard can it be to spot Charlie?\n\nThey slam into the doors, and we...\n<b>                                                   CUT TO:\n</b>\n<b>INT. MIAMI ARENA - NIGHT\n</b>\nWe reverse angle to reveal the inside of Miami Arena. The first\nthing that hits us is the WALL OF SOUND, the noise made\nby twenty thousand people in a basketball induced frenzy.\n\nThe next thing that hits us is the sheer magnitude of the\njob facing the Angels. Hard to spot? The crowd is one,\nenormous, teeming mass of brightly colored humanity.\n\n<b>                              DYLAN\n</b>             Aw, shit.\n\nThe game is in progress, Duke vs. North Carolina, and it's a\nbarn burner. A one point game with six minutes to go. BALL\nPLAYER pulls up and swishes a three pointer, Duke by two.\nThe crowd goes apeshit.\n\n<b>BY THE MEZZANINE\n</b>\nThe Angels huddle, yelling over the deafening noise of the\ncrowd...\n\n<b>                           DYLAN (CONT'D)\n</b>             We have to split up!\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               92.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           ALEX\n</b>             I'll take the luxury boxes.\n\n<b>                           DYLAN\n</b>             I'll take the mezzanine.\n\n<b>                           NATALIE\n</b>             I got the floor.\n\nThey split up. Dylan leads the charge down the loge section,\nblowing past the SECURITY WOMAN, who yells after her.\n\n<b>INT. ARENA FLOOR - NIGHT\n</b>\nBEHIND THE RIM, COLLEGE PLAYER #2 pulls down a brick, slams\nhome the rebound. The crowd ROARS.\n\n<b>INT. LUXURY BOXES --\n</b>\nJASON GIBBONS, famous movie star and North Carolina alumnus,\npumps his fists in the air. His luxury box is loaded with\nfellow Tar Heels and nameless studio executives. He\nrepeatedly high fives a Hollywood type in sunglasses and Armani.\n\n<b>                               JASON\n</b>             Yes, yes!\n\nWhen suddenly, the door to the luxury box is flung open.\n\n<b>                           ALEX\n</b>                    (yelling)\n             Charlie!? Charles Townsend!\n\nJason whips around and locks eyes with Alex.\n\n<b>                               JASON\n</b>             Alex?\n\n<b>                               ALEX\n</b>             Jason?\n                      (beat)\n             Shit.\n\nRealizing she has no time to explain, and that Charlie isn't\nin here, she turns and leaves.\n\n<b>                               JASON\n</b>             ALEX!    Hey...\n\nWhile everyone watches, confused, Jason pushes his way\nthrough the box and follows Alex into the hall.\n\n<b>                                               CUT TO:\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               93.\n</b>\n<b>INT. ARENA -- MEZZANINE\n</b>\nDylan races past rows of seats, pissing off plenty of fans\nin the process.\n\n<b>                        DYLAN\n</b>                 (looking everywhere)\n          Charlie! Charlie!\n\n<b>FLASHES FIRE\n</b>\nin the stands.\n\n<b>STATISTICIANS\n</b>\nscribble at their monitors. Natalie runs behind them,\nscanning the crowd. WHIP PANS, from ONE MAN to ANOTHER to\nANOTHER. Stopping on a likely candidate...\n\n<b>                              NATALIE\n</b>          Charlie?\n\n<b>                              LIKELY CANDIDATE\n</b>          Who?\n\n<b>THE SCOREBOARD CLOCK\n</b>\ncounts down.    :60.   :59.    :58.\n\n<b>INT. LUXURY BOXES - NIGHT\n</b>\nAlex bursts in.   It's a crowd of fifteen cocktail-drinking\n<b>BUSINESS MEN.\n</b>\n<b>                        ALEX\n</b>          Charles Townsend? Anybody, Charles\n          Townsend?\n\nShe ducks back into the hallway.\n\n<b>INT. HALLWAY -- CONTINUOUS\n</b>\nAlex walks out into the hallway, frustrated.     Then,\nmiraculously, she spots him...\n\n<b>KNOX.\n</b>\nHe walks out of one of the luxury boxes, holding a large,\nmetal briefcase. He heads for the elevator.\n\n<b>ALEX\n</b>\nimmediately goes to intercept him, but...\n\n<b>                              THIN MAN (O.S.)\n</b>          Don't move.\n\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 94.\n</b>\n<b>CONTINUED:\n</b>\nIt's the Thin Man, standing behind her, with a gun in\nher back.\n\n<b>                           THIN MAN (CONT'D)\n</b>             You move, you say anything, I\n             perforate you. Got it?\n\nKnox glances back at the Thin Man, nods to him.      Then he\ngets in the elevator.\n\nThe Thin Man starts edging Alex towards some emergency exit\ndoors, gun still in her back. Alex is trying to think of an\nescape, quickly. She knows that the second he gets her out\nof this public space, he's gonna shoot her. The door gets\ncloser and closer...\n\n<b>                            JASON (O.S.)\n</b>             Alex?!   Jesus, what is going on?\n\nThe Thin Man and Alex turn around to face Jason, who is\nsweaty and exasperated from chasing her.\n\n<b>                           ALEX\n</b>             Jason, hi, I...\n\nThe Thin Man digs the gun deeper into her back.\n\n<b>                           ALEX (CONT'D)\n</b>             Can I talk to you later?\n\n<b>                           JASON\n</b>             No you can talk to me NOW. I want\n             to know what the hell is going on.\n             First, you disappear with no\n             explanation, not even a goodbye.\n\n<b>                           ALEX\n</b>             I'm sorry, I...\n\n<b>                           JASON\n</b>             Now, I see you here, but you're\n             with some other guy.\n\n<b>                           THIN MAN\n</b>             Hey, movie star, do yourself a\n             favor and get lost.\n\nJason double takes.     He's not used to someone talking to\nhim like that.\n\n<b>                            JASON\n</b>             Lemme guess.   You must be Charlie?\n\n<b>                           ALEX\n</b>             Jason, please...\n<b>                                                   (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                               95.\n</b>\n<b>CONTINUED:\n</b><b>                           JASON\n</b>             No, no I'm sick of this shit. I'm\n             sick of this asshole telling you\n             what you can and can't do.\n\nAnd then, with no warning, he hauls off and punches the\nThin Man.\n\nNow, Jason's just an actor, not an ass-kicking super\ndetective, so his punch isn't all that great. In fact, it\nleaves Jason shaking his hand in pain.\n\nThe Thin Man, a trickle of blood running from his lip, smiles.\n\n<b>                           THIN MAN\n</b>             That was stupid.\n\nFirst, he pops Jason right in the jaw. Jason stumbles\nbackward, dazed. Then he reaches for his gun, in the\nprocess, loosening his grip on Alex...\n\n<b>                           ALEX\n</b>             Jason, get down!\n\nAlex spins out of the Thin Man's grasp and does a full\nroundhouse kick, knocking the gun out of the Thin Man's\nhands. The Thin Man immediately responds, throwing two\nquick punches, which Alex expertly blocks and then follows\nwith a hitch-kick to the chin.\n\nJason, dazed and confused, thinks he must be hallucinating.\n\n<b>                           JASON\n</b>             What the hell is going on?\n\nWhat's going on is a world class ass-kicking, courtesy of his\ngirlfriend. While the action star watches in amazement, Alex\nunloads an arsenal of bad ass kung fu moves that would make\nJet Li green with envy.\n\nThe Thin Man doesn't stand a chance. A flying side kick\nsends him stumbling backwards into the stairwell. We\nfollow the fight...\n\n<b>INT. STAIRWELL -- CONTINUOUS\n</b>\n... to the first landing. The Thin Man, battered and bruised,\nreaches down to his ankle holster to get his spare gun, but\nAlex is too fast for him. She stamps on his hand, then\ndrops a knee to his throat.\n\n<b>                           ALEX\n</b>             Right now, just by leaning forward, I\n             could crush your windpipe. You'd die\n             a slow and painful death. You don't\n             want that, do you?\n<b>                                                 (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                96.\n</b>\n<b>CONTINUED:\n</b>\nThe Thin Man shakes his head \"no.\"\n\n<b>                           ALEX (CONT'D)\n</b>             Where is the bomb, when's it going off?\n\nShe presses harder.\n\n<b>INT. HALLWAY\n</b>\nJason slams out into the stairwell, looking for Alex. He\nfinds her on her walkie talkie, the Thin Man handcuffed\nto the staircase.\n\n<b>                            ALEX\n</b>             Hi, Jason.   Gimme one second?\n\nJason nods, sure.\n\nWe go to another triptych, all three Angels on their cell\nphones in different parts of arena.\n\n<b>                           ALEX (CONT'D)\n</b>             Angels! Knox planted the bomb in the\n             basement, and it's timed to go off\n             when the game clock hits zero!\n\n<b>                           NATALIE (O.S.)\n</b>             Roger that, Alex, I'll stop the clock!\n\n<b>                           DYLAN (O.S.)\n</b>             I'll look for the bomb!\n\nAlex turns back to Jason. He's clearly having a difficult\ntime processing everything he's just seen.\n\n<b>                           ALEX\n</b>             I lied to you Jason.    I'm not a\n             secretary.\n\n<b>                           JASON\n</b>             Yeah, I can see that.\n\n<b>                           ALEX\n</b>                    (referring to the\n                     Thin Man)\n             And that wasn't Charlie.\n\n<b>                            JASON\n</b>             Right.\n\n<b>                           ALEX\n</b>             I'm actually here to stop a madman\n             from killing everyone in this\n             building. Would it be okay if we\n             talked later?\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 97.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           JASON\n</b>             Go save the world, honey.\n                    (beat)\n             I'll be waiting for you.\n\nAlex smiles.    Runs off.\n\n<b>INT. ARENA\n</b>\nNatalie stares up at the clock... :30.       :29.\n\nThe WHISTLE BLOWS.\n\n<b>                            REFEREE\n</b>             Time out!\n\nWhew, that was close. But it'll start up any second.       She\nhas to keep it stopped. But how? She glances to the\nsidelines and gets an idea.\n\n<b>ON THE COURT --\n</b>\nMUSIC starts from overhead, the respective teams' cheerleaders\ncoming out for one last routine.\n\nAs they kick into gear, Natalie comes out with them, dressed\nas a Duke cheerleader. She follows along with the dancers, a\nbit timid at first, then more confident as she gets into it.\n\n<b>INT. ARENA BASEMENT -- BENEATH THE COURT\n</b>\nDylan races through the basement, looking for the briefcase.\nThen she spots it, hooked into some wires that snake up\ninto ceiling above.\n\nDylan approaches it cautiously.       She slowly opens the top...\n\n<b>                           DYLAN\n</b>                    (to herself)\n             Alright, Dylan, all we have to do is\n             figure out which wire to cut.\n\n<b>REVEAL THE BOMB --\n</b>\nthere are about fifty different wires, in every color in\nthe Crayola box.\n\n<b>                            DYLAN (CONT'D)\n</b>             Oh, shit.\n\n<b>INT. COURTSIDE\n</b>\nAlex, still searching for Charlie, notices something strange.\n\n<b>                           ALEX\n</b>             You're kidding me.\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                98.\n</b>\n<b>NATALIE\n</b>\nis fully transformed on the court, from wallflower to full-\nout cheerleader. It's not that she's as good as the other\ncheerleaders. She's better.\n\n<b>ON THE COURT\n</b>\nThe SONG ends. The Cheerleaders vacate the court, but Natalie\nkeeps dancing her heart out. She has 18,000 fans watching\nher, and she's totally in the moment. But there's another\nagenda as well...\n\n<b>                        COURTSIDE RADIO ANNOUNCER\n</b>          The time out is over, but one\n          cheerleader doesn't seem to notice.\n          Officials can't start the clock again\n          while she's on the court.\n\n<b>                                                CUT TO:\n</b>\n<b>INT. MIAMI ARENA -- CONTINUOUS\n</b>\nDylan has picked two wires.\n\n<b>                        DYLAN\n</b>          Chartreuse and magenta.   This has\n          gotta be it.\n\nShe prepares to snip them with her wire cutters, when...\n\n<b>                        KNOX (O.S.)\n</b>          I wouldn't do that, if I were you.\n\nShe spins to see Knox, standing behind her.\n\n<b>                        KNOX (CONT'D)\n</b>          See, if you snip ANY of those wires,\n          the bomb WILL blow up.\n\n<b>                        DYLAN\n</b>          It's gonna blow anyway, once the\n          clock gets to zero.\n\n<b>                        KNOX\n</b>          Who told you that, my idiotic\n          henchman? Do you think I tell him\n          ANYTHING that's confidential?\n\nHe holds up a small TRIGGERING DEVICE. It's the same one\nwe saw Pascal try to sell in the opening scene.\n\n<b>                        KNOX (CONT'D)\n</b>          THIS is what triggers that bomb.     So\n          if you'll kindly step away, I'll\n          refrain from killing both of us.\n\n<b>                                                (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                             99.\n</b>\n<b>CONTINUED:\n</b>Realizing she has no choice, Dylan stands up and backs away.\n\n<b>                        KNOX (CONT'D)\n</b>          In different circumstances, Dylan, I\n          think you and I could have worked out.\n          We have a lot in common.\n\n<b>                        DYLAN\n</b>          Yeah, I fall for assholes, and you\n          ARE one.\n\nKnox laughs.\n\n<b>                        KNOX\n</b>          Good one.\n                 (beat, as he backs up)\n          Well, I must be going. If you like\n          your body parts attached to your\n          torso, I suggest you do the same.\n\nKnox turns to go, but the other Angels are blocking his way.\n\n<b>                        ALEX\n</b>          Give it up, Knox. You're surrounded.\n\n<b>                        NATALIE\n</b>          Give us the detonator.\n\n<b>                        KNOX\n</b><b>          NO!\n</b>\nStumbling backwards, Knox holds it up high.\n\n<b>                        KNOX (CONT'D)\n</b>          I'll blow this building sky high, I swear!\n\n<b>                        CHARLIE (O.S.)\n</b>          Don't do it, Eric. It's me you want,\n          not all these innocent people.\n\nEveryone turns, as one, to a figure emerging from the shadows.\n\n<b>                        KNOX\n</b>          Charlie?\n\nThat's right, it's Charlie. Finally, after all these years,\nwe get a look at him, and boy is it... disappointing.\n\nHe's not what we expected. Short, portly, dressed in a\n\"We're #1\" t-shirt; the Angels are absolutely floored by\nCharlie's appearance.\n\n<b>                        ANGELS\n</b>          Charlie?\n\nCharlie ignores their stares and addresses Knox directly.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                 100.\n</b>\n<b>CONTINUED:\n</b>\n<b>                           CHARLIE\n</b>             Your father was a double agent, Eric.\n             Yes, I revealed him, but he was killed\n             by his own people before we could\n             throw him in jail.\n                    (beat)\n             He was my friend.\n\n<b>                           KNOX\n</b>             It's still your fault, you arrogant\n             prick! You still killed my father!\n\n<b>                           CHARLIE\n</b>             Maybe. Maybe I did. But why should\n             YOU kill all these people? If you\n             hate me so much, just shoot ME.\n             Just shoot me, Eric.\n\nCharlie spreads his arms, leaving Knox a plenty wide target.\n\nIt's a horribly tense moment.       The Angels are frozen, watching\nKnox decide Charlie's fate.\n\nKnox is sweating, debating his choices. Can he really do\nthis? Charlie's not the glamorous, smug asshole he imagined.\nHe starts lowering his gun.\n\n<b>                           KNOX\n</b>             Okay.  You're right.\n                    (quickly)\n             I'll just kill you.\n\n<b>BLAM!\n</b>\nIt all happens in the blink of an eye. Knox fires, hitting\nCharlie in the chest. Natalie leaps out and tackles Knox.\nAlex dives and grabs the detonator, before it has a chance\nto go off.\n\nDylan runs to Charlie's side.\n\n<b>                            DYLAN\n</b>             Charlie, no.   NO!\n\nShe hold shim in her arms as the other Angels gather round\ntheir fallen leader. He gasps for air.\n\n<b>                           DYLAN (CONT'D)\n</b>             He's trying to say something.\n\nThen Dylan notices something weird. He's not gasping for\nair, there's something stuck in his mouth.\n\nWith a great, hacking cough, he spits it out. It's a voice\nchip, like the one Dylan used in the opening scene.\n<b>                                              (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                101.\n</b>\n<b>CONTINUED:\n</b><b>                           VOICE\n</b>             Ucch, that tasted terrible!\n\nThe voice isn't Charlie's. Dylan reaches down and rips\noff Charlie's mask, revealing...\n\n<b>                            NATALIE\n</b>             Bosley!   Are you okay?\n\n<b>                            BOSLEY\n</b>             Think so.\n\nHe pulls back the padding from the suit, revealing a small\nwound where the bullet grazed his side.\n\n<b>                           BOSLEY (CONT'D)\n</b>             Hurts, but it looks like it'll heel.\n\nDylan laughs, Alex ruffles his hair.\n\n<b>                           DYLAN\n</b>             Hey, wait a second. If Bosley's\n             here... then where's Charlie?\n\nThe Angels all look at each other.      No one knows.\n\n<b>EXT. CENTER PASSAGE - DAY\n</b>\nIn gorgeous SLOW MOTION, the three angels walk side-by-side\nwith a calm assurance, fireballs exploding behind them.\n\nThey won.\n\nAs MUSIC rises, the ANGELS TRIPTYCH descends, then peels\naway to reveal...\n\n<b>EXT. GORGEOUS BEACH - DAY\n</b>\nThe angels kick back on the white sands, tropical drinks in-\nhand. Bosley is there as well, with a grass hat and zinc\non his sniffer.\n\nCharlie is on the cellular speakerphone.\n\n<b>                           CHARLIE'S VOICE\n</b>             Great work, angels. You'll be happy\n             to know you received another\n             presidential commendation.\n\nThe Angels, and Bosley, clink glasses.\n\n<b>                           CHARLIE'S VOICE (CONT'D)\n</b>             Enjoy your vacation, angels.\n\n<b>                           THE ANGELS\n</b>             Thank you Charlie.\n<b>                                                  (CONTINUED)\n</b><b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                                102.\n</b>\n<b>CONTINUED:\n</b>\nThey toast the speakerphone.\n\n<b>                           CHARLIE'S VOICE\n</b>             Alex, Natalie -- I know you've been\n             putting in some long hours on this case,\n             so I thought you might enjoy a chance to\n             catch up with some old friends.\n\n<b>NATALIE AND ALEX TURN TO SEE\n</b>\n<b>PETER AND JASON\n</b>\nwalking across the beach towards them. Each is carrying a\ndrink of his own. They wave. Damn those men look good.\n\nAlex and Natalie share a smile.\n\n<b>                           DYLAN\n</b>             Any chance you'll be joining us,\n             Charlie?\n\n<b>                                                CUT TO:\n</b>\n<b>A SUNNY DECK\n</b>\nWe're in Charlie's point-of-view. We can see part of his\nreflection in the window -- not enough to see his face,\nbut we get some sense of the man.\n\nHe turns away, begins walking.    Steps down onto the sand.\n\n<b>                           CHARLIE\n</b>                    (to cell phone)\n             I'd love to, Angels. But I have some\n             precious treasures to watch over.\n\nWith that, he hangs up. We stay in his P.O.V., walking\nacross the beach. And it's not just any beach.\n\n<b>TO THE LEFT, WE NOTICE\n</b>\n<b>PETE AND JASON\n</b>\napproaching.    We're on the same beach.\n\nLooking right, we see the backs of the Angels and Bosley.\nThey have no idea that Charlie is walking right behind them.\n\nA beat, then Dylan looks back.\n\nShe looks directly as us -- at Charlie -- tracking as we\nmove past. Does she somehow recognize it's Charlie?\nFrom her reaction, it's not clear.\n\nA beat, then we...\n<b>\n</b><b>CHARLIE'S ANGELS - 8/18/99                            103.\n</b>\n<b>REVERSE ANGLE/NOT P.O.V.\n</b>\nDylan looks back forward again. Did she just see Charlie?\nHer smile tells us she thinks she did.\n\nShe raises a toast.\n\n<b>                           DYLAN\n</b>          To Charlie.\n\n<b>                           THE ANGELS AND BOSLEY\n</b>          To Charlie.\n\nThey knock glasses.\n\nRight at the moment we should probably fade out, Bosley\nspills his icy drink in his lap. His eyes go wide.\n\nThe Angels just have to laugh.\n\nWe FREEZE FRAME, then...\n\n<b>CUT TO BLACK.\n</b>\n<b>                               THE END\n</b><b>\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Charlie's Angels</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Ed Solomon\" title=\"Scripts by Ed Solomon\">Ed Solomon</a>  <a href=\"/writer.php?w=John August\" title=\"Scripts by John August\">John August</a>  <a href=\"/writer.php?w=Zak Penn\" title=\"Scripts by Zak Penn\">Zak Penn</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Charlie's Angels Script.html#comments\" title=\"Charlie's Angels comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:02:00.472369"}