{"title": "Cider House Rules, The", "film_link": "/Movie Scripts/Cider House Rules, The Script.html", "script_link": "/scripts/Cider-House-Rules,-The.html", "info_raw": "\n\nCider House Rules, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  John Irving\nGenres  Drama  Romance\nMovie Release Date : December 1999\n\nRead \"Cider House Rules, The\" Script\n\n\n", "script": "\n\n\n\n\n\n                                  THE CIDER HOUSE RULES\n\n\n\n                                       Written by\n\n                                       John Irving\n\n\n\n                                                         Production Draft\n\n                \n\n               FADE IN. BEGIN TITLE SEQUENCE.\n\n               EXT. ST CLOUD'S - TRAIN STATION - DAWN\n\n               An establishing shot of the rundown train station on an \n               overcast morning. There's snow on the station platform. A \n               train arrives and departs.\n\n                                     LARCH (V.O.)\n                         In other parts of the world, young \n                         men of promise leave home to make \n                         their fortunes, battle evil, or solve \n                         the problems of the world.\n\n               Behind the station, at the top of the hill, lies the St. \n               Cloud's orphanage.\n\n                                     LARCH (V.O.)\n                         I was myself such a young man, when \n                         I came to save the orphanage in St. \n                         Cloud's... many years ago.\n\n               EXT. ST. CLOUD'S - ORPHANAGE - EARLY MORNING\n\n               A man and woman (COUPLE #1) make their way toward the main \n               entrance of the large brick building.\n\n                                     LARCH (V.O.)\n                         Here in St. Cloud's, I have come to \n                         understand that promises are rarely \n                         kept, that the battle isn't so much \n                         against evil as ignorance, and that \n                         being successful can't hold a candle \n                         to being of *use*.\n\n               The couple enters the orphanage, where we hear the sound of \n               babies.\n\n                                     LARCH (V.O.)\n                         Nor have I solved the problem I came \n                         here to solve.\n\n               INT. ORPHANAGE - MORNING\n\n               Two nurses, EDNA and ANGELA, chase CHILDREN--a morning \n               routine.\n\n                                     LARCH (V.O.)\n                         Even in the most enlightened times, \n                         unwanted babies will manage to be \n                         born. That there will always be \n                         orphans is simple not a problem to \n                         be solved. Here is St. Cloud's, we \n                         don't regard the sordid facts of \n                         life as problems.\n\n               The camera goes up the stairs with some of the kids.\n\n               INT. LARCH'S OFFICE - DAY\n\n               We enter an office where DR. LARCH shows couple #1 their \n               newly adopted son, HOMER, an infant who lies smiling in Dr. \n               Larch's arms.\n\n                                     LARCH (V.O.)\n                         In truth, we've only had one real \n                         problem.\n\n               We close in on the infant until his face fills the screen.\n\n                                     LARCH (V.O.)\n                         His name was Homer Wells.\n\n               Dr. Larch hands over the infant to the adopting parents.\n\n                                     LARCH\n                         I named him after the Greek writer. \n                         You know Homer, of course?\n\n               Hesitant nods. (They don't look as if they read.)\n\n                                     LARCH\n                         I made his name \"Wells\" because I \n                         could tell he was very deep.\n\n               The parents look with pride at their adopted son.\n\n                                     LARCH (V.O.)\n                         In truth, Nurse Angela named him--\n                         her father *drilled* wells, and \n                         \"Homer\" was one of her family's \n                         umpteen cats.\n\n               INT./EXT. ORPHANAGE - DAY\n\n               At the front door, Larch and the nurses wave and call good-\n               bye to Homer, they close the door.\n\n               INT./EXT. ORPHANAGE - NIGHT\n\n               The same door swings open; it's another night. The same couple \n               is bringing Homer back. There is concern in their faces as \n               Nurse Edna lets them in.\n\n               INT. BOY'S DIVISION, DOORWAY - NIGHT\n\n               Larch is delivering his benediction to the boys.\n\n                                     LARCH\n                         \"Good night, you Princes of Maine, \n                         you Kings of New England!\"\n\n               As he turns, he is startled by Nurse Edna, waiting with couple \n               #1 and baby Homer.\n\n                                     ADOPTING MOTHER\n                         There's something wrong with him! He \n                         never makes a sound.\n\n               Larch looks quickly at Homer.\n\n                                     LARCH (V.O.)\n                         He didn't cry enough for them, if \n                         you can believe it.\n\n                                     ADOPTING FATHER\n                         Do you think we could have a look at \n                         someone a little different?\n\n               The mother hands over the baby to Larch. Baby Homer lets out \n               a happy squeal as soon as he's in Larch's arms. The parents \n               stare in disbelief.\n\n                                     LARCH (V.O.)\n                         Thus was Homer Wells returned. He \n                         was too happy a baby.\n\n               EXT. ORPHANAGE - DAY\n\n               Angela and Edna call and wave good-bye to a two-year-old \n               Homer, leaving with COUPLE #2. Larch stands on the porch and \n               watches the family head down the hill.\n\n                                     LARCH (V.O.)\n                         The second family has an unfortunate \n                         gift for getting sounds out of Homer.\n\n               INT. COUPLE #2'S HOME - DAY\n\n               Larch bursts into the home of the second couple and lifts a \n               crying and bruised Homer out of his bed. There is rage in \n               Larch's eyes as he looks at the couple.\n\n                                     LARCH (V.O.)\n                         The rumor was true. They beat him. \n                         He couldn't stop crying.\n\n               EXT. HILL, ST. CLOUD'S - DAY\n\n               Larch carries Homer up the orphanage hill.\n\n                                     LARCH (V.O.)\n                         Here is St. Cloud's, I try to \n                         consider, with each rule I make or \n                         break, that my first priority is an \n                         orphan's future.\n\n               INT. DELIVERY ROOM - DAY\n\n               The naked belly of a VERY PREGNANT WOMAN.\n\n                                     LARCH (V.O.)\n                         Easier said than done.\n\n               A tiny hand comes in with a stethoscope and puts it on the \n               big belly. Young Homer's head, with the stethoscope around \n               his neck, pops up behind the belly; he closes his eyes as he \n               concentrates on listening to the sounds of the unborn child. \n               Larch stops in the doorway, catching sight of Homer. He smiles \n               faintly.\n\n               EXT. COUPLE #3'S HOME - DAY\n\n               The door opens to a THIRD COUPLE smiling at us, welcoming \n               and embracing a sixteen-year-old Homer. Behind them waits \n               the would-be STEPSISTER--an attractive girl, a little older \n               then Homer.\n\n                                     LARCH (V.O.)\n                         I told the third family to take good \n                         care--this was a special boy.\n\n               INT. STEPSISTER'S BEDROOM - NIGHT\n\n               Homer and the stepsister are in bed together. The parents \n               burst in on them--the father chasing Homer around and around \n               the bed, the mother beating her daughter, who covers herself \n               with a pillow.\n\n                                     LARCH (V.O.)\n                         It was Homer who took too much good \n                         care of himself.\n\n               EXT. COUPLE #3'S HOME - NIGHT\n\n               From her window, the stepsister watches Homer leave the house \n               carrying his suitcase. Homer looks up at her as he walks to \n               the street.\n\n               EXT. ORPHANAGE - EARLY MORNING\n\n               It's after dawn, but still a little dark, as Homer walks to \n               the orphanage door, suitcase in hand. A HUGELY PREGNANT WOMAN \n               arrives at the same time. They stand awkwardly next to each \n               other, waiting for someone to answer the door. The woman is \n               crying. Homer reaches out and takes her hand.\n\n                                     HOMER\n                         Don't be frightened. Everyone is \n                         nice here.\n\n                                     PREGNANT WOMAN\n                         Do you live here?\n\n                                     HOMER\n                         I just belong here.\n\n               The woman sniffles; she nods vaguely. The door opens. Nurse \n               Edna lets the woman in and embraces Homer.\n\n                                     LARCH (V.O.)\n                         What could I do with him? He kept \n                         coming back!\n\n               INT. LARCH'S OFFICE - DAY\n\n               Larch instructs an older Homer from \"Gray's Anatomy.\" Homer \n               is bored and looks out the window.\n\n                                     LARCH\n                         Homer, if you're going to stay at \n                         St. Cloud's, I expect you to be of \n                         use.\n\n               INT. DELIVERY ROOM - DAY\n\n               Homer looks adoringly at Dr. Larch as Larch examines ANOTHER \n               PREGNANT WOMAN. Larch waves Homer over; he places the boy's \n               hand on the woman's abdomen, to feel the fetus kicking.\n\n                                     LARCH (V.O.)\n                         But, in failing to withhold love, \n                         had I created a true and everlasting \n                         orphan? I had been too successful \n                         with Homer Wells. I had managed to \n                         make the orphanage his *home*.\n\n               INT. OPERATING ROOM - DAY\n\n               Larch closes a door quickly behind him (so that Homer doesn't \n               see the ABORTION PATIENT in the O.R.)\n\n               INT. DELIVERY ROOM - DAY\n\n               Homer assists Larch in delivering a BABY.\n\n               EXT. INCINERATOR - DAY\n\n               Homer carries a white enamel pail to the incinerator. He \n               looks inside the pail; he stops.\n\n                                     LARCH (V.O.)\n                         God forgive me. I have *made* an \n                         orphan by loving him too much. Homer \n                         Wells will belong to St. Cloud's, \n                         forever.\n\n               Hold on Homer's disgusted expression as he stares at the \n               contents of the pail.\n\n               END TITLE SEQUENCE. FADE OUT. We hear a song playing on an \n               old phonograph.\n\n               INT. DISPENSARY - DAY\n\n               We see the song playing on the old phonograph. Dr. Larch is \n               taking ether. He holds the bottle in one hand, the cone over \n               his mouth and nose with the other.\n\n               SUPER: ST. CLOUD'S, MAINE, MARCH 1943.\n\n               When Larch dozes off, his hand loosens its grip on the cone; \n               the cone falls off his face, and he wakes up. Then he puts \n               the cone back in place, dripping more ether from the bottle \n               to the gauze covering the cone.\n\n               Pan the dispensary, which also serves as Larch's photo gallery \n               and bedroom apartment. The ether-bed is separated from the \n               room by a hospital curtain (the kind on casters). We see the \n               recording revolving, the glass-encased cabinets of medical \n               supplies, the old photographs of St. Cloud's.\n\n               Homer enters, he stands uncomfortably, watching Larch for a \n               moment. Then he turns around and walks back into the corridor.\n\n               INT. CORRIDOR - DAY\n\n               Homer calls out as though he's just coming down the corridor.\n\n                                     HOMER\n                         Dr. Larch! Dr. Larch!\n\n               INT. DISPENSARY - DAY\n\n               Larch wakes up; he shakes off the ether haze. Homer reenters.\n\n                                     HOMER\n                         We've got two new patients, one to \n                         deliver.\n\n               Dr. Larch and Homer leave together.\n\n               INT. CORRIDOR - DAY\n\n               The *two* doctors walk briskly down the hall, a couple of \n               professionals.\n\n                                     LARCH\n                         First pregnancy?\n\n                                     HOMER\n                         Yes, for both.\n\n                                     LARCH\n                              (sarcastically)\n                         I presume you'd prefer handling the \n                         delivery.\n\n                                     HOMER\n                              (tiredly; an old topic)\n                         All I said was, I don't want to \n                         perform abortions. I have no argument \n                         with *you* performing them.\n\n                                     LARCH\n                         You know *how* to help these women--\n                         how can you not feel *obligated* to \n                         help them when they can't get help \n                         anywhere else?\n\n                                     HOMER\n                         One: it's illegal. Two: I didn't ask \n                         how to do it--you just showed me.\n\n                                     LARCH\n                         What *else* could I have showed you, \n                         Homer? The only thing I can teach \n                         you is what I know! In every life, \n                         you've got to be of use.\n\n               Homer and Larch split off and disappear into two different \n               operating rooms. As he goes, Homer mumbles to himself, \"Of \n               use, of use, of use.\"\n\n               INT. OPERATING ROOM - DAY\n\n               Larch and Angela are preparing the ether for DOROTHY, a not \n               visibly pregnant woman. The sounds of labor across the hall \n               can be heard Over.\n\n                                     LARCH\n                              (holds the cone)\n                         Have you ever had ether, Dorothy?\n\n                                     DOROTHY\n                         Once, when they took out my appendix.\n\n                                     ANGELA\n                              (looks for scar)\n                         No one's touched your appendix.\n\n                                     DOROTHY\n                         Whatever it was... the ether made me \n                         sick.\n\n                                     LARCH\n                         It won't make you sick this time, \n                         Dorothy--not the way I do it, just a \n                         drop at a time.\n\n                                     DOROTHY\n                         I can't pay for this, you know--I \n                         got no money.\n\n                                     LARCH\n                         One day, Dorothy, if you have any \n                         money, a donation to the orphanage \n                         would be very much appreciated.\n\n                                     ANGELA\n                         Only if you can afford it.\n\n                                     LARCH\n                              (holds the ether bottle)\n                         Try to think of nothing, Dorothy.\n\n               Angela puts the cone over Dorothy's mouth and nose; Larch \n               drips the ether on the cone. A newborn wails in the other \n               O.R. Over.\n\n               INT. DELIVERY ROOM - DAY\n\n               Homer has delivered CARLA. A newborn baby is screaming in \n               Edna's arms. Homer is attending to Carla, who is panting.\n\n                                     HOMER\n                         That was good, Carla--that was \n                         *perfect*. Everything's fine.\n\n                                     CARLA\n                         I don't wanna see it!\n\n                                     EDNA\n                         You don't have to see it, dear. Don't \n                         worry.\n\n                                     CARLA\n                         I don't even wanna know what sex it \n                         is--don't tell me!\n\n                                     HOMER\n                         We won't tell you, Carla. You're \n                         going to be okay.\n\n                                     EDNA\n                         Your *baby's* going to be okay, too.\n\n                                     CARLA\n                         I don't wanna know!\n\n               Larch pops into the delivery room; he peers at the baby.\n\n                                     LARCH\n                         He's a big boy!\n\n                                     CARLA\n                         Let me see him, for Christ's sake--I \n                         wanna see him.\n\n               Edna shows the baby to Carla, who stares, then turns away. \n               Larch whispers to Homer.\n\n                                     LARCH\n                         Would you mind having a look at \n                         Dorothy?\n\n               INT. OPERATING ROOM - DAY\n\n               Angela sits with the still-etherized Dorothy while Larch and \n               Homer confer over a basin containing Dorothy's uterus.\n\n                                     HOMER\n                         There was no visible wound?\n\n                                     LARCH\n                         No. The fetus was dead. Her uterus \n                         was virtually *disintegrating*--my \n                         stitches pulled right through the \n                         tissue!\n\n                                     HOMER\n                              (mystified)\n                         It looks like scurvy.\n\n                                     LARCH\n                              (derisively sarcastic)\n                         Scurvy! Ah yes, the curse of the old-\n                         time sailor, suffering long periods \n                         at sea with no fresh fruits or \n                         vegetables. Homer, Dorothy isn't a \n                         *sailor*!\n\n                                     ANGELA\n                         She's a prostitute, isn't she?\n\n                                     HOMER\n                              (to Angela)\n                         Did you look in her purse?\n\n                                     LARCH\n                              (frustrated)\n                         I looked everywhere else!\n\n               Angela hands Larch a bottle of brown liquid.\n\n                                     ANGELA\n                         It's called French Lunar Solution.\n\n               Larch wrinkles his nose at the odor.\n\n                                     LARCH\n                         It's not ergot, it's not pituitary \n                         extract, it's not oil of rue...\n\n                                     ANGELA\n                         It claims to restore monthly \n                         regularity.\n\n                                     HOMER\n                         It's obviously an aborticide.\n\n                                     LARCH\n                         Obviously.\n\n               Larch wets his finger with the stuff, then touches it to his \n               tongue.\n\n                                     LARCH\n                              (spits)\n                         Christ, it's oil of tansy!\n\n                                     HOMER\n                         I don't know it.\n\n                                     LARCH\n                         If you take enough of it, your \n                         intestines lose their ability to \n                         absorb Vitamin C.\n\n                                     HOMER\n                         In other words, scurvy.\n\n                                     LARCH\n                         Good boy. Good job. And you call \n                         yourself \"not a doctor\"!\n                              (to Angela)\n                         Keep an eye on her--she's in trouble.\n\n               As Homer turns to leave, Larch stops him; he points to the \n               basin.\n\n                                     LARCH\n                         Take care of that, will you?\n\n               Homer stops, annoyed; he picks up the basin and empties the \n               contents into a white enamel pail.\n\n               INT. DINING HALL - AFTERNOON\n\n               MISS TITCOMB is teaching math to some distracted boys and \n               girls in a corner of the dining room. A blackboard on wheels \n               is a mass of numbers. Homer, passing through the dining room \n               with the white enamel pail, attracts the attention of BUSTER, \n               a sixteen-year-old who is picking over a plate of pastries \n               on a table. Buster immediately goes with Homer.\n\n                                     BUSTER\n                         I'll help you.\n\n               Homer shakes his head, keeps walking. Buster follows. Dr. \n               Larch passes close to Buster. Buster makes a face, disgusted.\n\n               EXT. INCINERATOR - AFTERNOON\n\n               Buster and Homer tramp through the snow toward the \n               incinerator. Homer still carries the pail.\n\n                                     BUSTER\n                         He *sniffs* that ether! I've seen \n                         him do it!\n\n                                     HOMER\n                         It's because he's too tired to sleep. \n                         He has to.\n\n                                     BUSTER\n                         He *smells* like he could put you to \n                         sleep!\n\n                                     HOMER\n                         He's a doctor, Buster--doctors smell \n                         like ether.\n\n                                     BUSTER\n                         *You're* a doctor, Homer--you don't \n                         smell like ether.\n\n                                     HOMER\n                         I'm *not* a doctor. I haven't been \n                         to medical school--I haven't even \n                         been to high school!\n\n                                     BUSTER\n                         But you've studied with the old man \n                         for *years*!\n\n                                     HOMER\n                         I'm *not* a doctor!\n\n                                     BUSTER\n                         I'm sorry, Homer.\n\n               Buster stands watching as Homer empties the pail into the \n               incinerator.\n\n               INT. DISPENSARY - NIGHT\n\n               With his head inclined to the giant ear of Larch's phonograph, \n               FUZZY--six, thin, and pale and looking remarkably like an \n               embryo--is listening to a recording. He can't hear what Larch \n               and Homer are saying about him as they construct a humidified \n               tent over a small hospital bed on wheels. The humidifier is \n               operated by a car battery.\n\n                                     LARCH\n                         Fuzzy is not uncommon. I tell you, \n                         there's something about the premature \n                         babies of alcoholic mothers. They \n                         seem susceptible to every damn thing \n                         that comes along.\n\n                                     HOMER\n                         I haven't read that.\n\n                                     LARCH\n                         I haven't, either. But you *will*. \n                         The morons who write the books should \n                         do a little research *here*.\n\n                                     HOMER\n                         But isn't Fuzzy just... well, \n                         underdeveloped?\n\n                                     LARCH\n                         When *doesn't* he have bronchitis? I \n                         wouldn't call his bronchial infections \n                         \"underdeveloped.\" Would you?\n\n               Larch plucks Fuzzy from in front of the phonograph and zips \n               him into the breathing tent. Fuzzy smiles. As larch leaves, \n               MARY AGNES, a pretty but tough-looking teenager, comes into \n               the dispensary.\n\n                                     HOMER\n                         What is it, Mary Agnes?\n\n               Mary Agnes smiles at Homer; then she sticks her tongue out \n               at him. Homer looks at her impassively, but as the moment \n               continues his expression suggests his annoyance. Fuzzy starts \n               to cough; he wheezes as he breathes. Homer leans down; he \n               peers at Fuzzy through a hole by the zipper of the tent.\n\n                                     MARY AGNES\n                              (garbled because of \n                              her tongue)\n                         Look!\n\n               Homer examines Mary Agnes' tongue.\n\n                                     HOMER\n                         Did you bite it?\n\n                                     MARY AGNES\n                         I don't remember.\n\n                                     HOMER\n                              (dismissively)\n                         It looks like you bit it--it'll be \n                         all right.\n\n                                     MARY AGNES\n                         Maybe I was kissing someone and he \n                         bit me.\n\n                                     HOMER\n                              (looks at her tongue \n                              again)\n                         No, you did it yourself. Maybe in \n                         your sleep.\n\n                                     MARY AGNES\n                         I must have been *dreaming* of kissing \n                         someone.\n\n               Homer is not responding to her come-on. He wheels Fuzzy into \n               the hall.\n\n                                     HOMER\n                         Story time, Fuzzy!\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               In the girls' bunk room, Nurse Edna is saying prayers. The \n               girls lie with their palms pressed together on their chests.\n\n                                     EDNA\n                         \"Oh Lord, support us all the day \n                         long...\"\n\n               EXT. ST. CLOUD'S - THE HILL - NIGHT\n\n               The building of St. Cloud's is silhouetted against the sky. \n               Carla, the woman we saw deliver the baby, is heading down \n               the hill alone, she sobs, not looking back.\n\n                                     EDNA (O.S.)\n                         \"...until the shadows lengthen and \n                         the evening comes, and the busy world \n                         is hushed, and the fever of life is \n                         over, and our work is done.\"\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               In the bunk room again, with Edna and the girls.\n\n                                     EDNA\n                         \"Then in Thy mercy grant us save \n                         lodging, and holy rest, and peace at \n                         the last.\"\n\n                                     ALL THE GIRLS\n                         Amen! Amen! Amen!\n\n               INT. BOYS' DIVISION - NIGHT\n\n               Dr. Larch is reading from Oliver Twist--the death scene of \n               Bill Sike's dog. The boys listen in horror in their beds.\n\n                                     LARCH\n                         \"A dog, which had lain concealed \n                         till now, ran backwards and forwards \n                         on the parapet with a dismal howl, \n                         and collecting himself for a spring, \n                         jumped for the dead man's shoulders.\"\n\n               Homer enters; he walks quietly to his bed in the far corner \n               of the room, where he starts to undress.\n\n                                     LARCH\n                         \"Missing his aim, he fell into a \n                         ditch, turning completely over as he \n                         went; and striking his head against \n                         a stone, dashed his brains out.\n\n               Larch turns out the lights. From the open doorway to the \n               hall, Larch delivers his nightly benediction.\n\n                                     LARCH\n                         Good night, you Princes of Maine! \n                         You Kings of New England!\n\n               Larch closes the door, leaving them in the semi-darkness. \n               One young boy runs into Homer's bed, nervously giggling.\n\n                                     FUZZY\n                              (in his breathing \n                              tent)\n                         Why does Dr. Larch *do* tht every \n                         night?\n\n                                     CURLY\n                              (about seven)\n                         Maybe to scare us...\n\n                                     COPPERFIELD\n                              (about eleven)\n                         No, you jerk.\n\n                                     STEERFORTH\n                              (about nine)\n                         Dr. Larch *loves* us!\n\n                                     FUZZY\n                         But why does he do *that*?\n\n                                     BUSTER\n                         He does it because we like it.\n\n               The boys silently agree, Homer among them.\n\n               EXT. ST. CLOUD'S - EARLY MORNING\n\n               The girls, led by Mary Agnes, round a corner of the orphanage, \n               towing a sled piled high with snowballs.\n\n                                     MARY AGNES\n                         Buster is mine. You two get \n                         Copperfield and Curly. Nobody touches \n                         Fuzzy.\n\n               They shriek as the boys suddenly surprise them. Buster throws \n               two hard snowballs that hit Mary Agnes and CLARA (eight or \n               nine) before Mary Agnes overwhelms him and repeatedly sticks \n               his head in the snow. Copperfield, terrified of Mary Agnes, \n               escapes. Curly misses, then tips over the sled of snowballs \n               as Clara and the adorable HAZEL (five or six) throw him to \n               the ground. Fuzzy drops his one snowball; he runs aimlessly \n               in circles, coughing, as Nurse Edna explodes from a door of \n               the orphanage.\n\n                                     EDNA\n                         Stop it! No fighting! *Share* the \n                         snowballs!\n\n                                     BUSTER\n                              (mouth full of snow)\n                         They're *our* snowballs! They *stole* \n                         them!\n\n                                     MARY AGNES\n                         They attacked us--just like the Japs!\n\n               Fuzzy coughs and wheezes, trying to catch his breath.\n\n                                     EDNA\n                         Listen to you, Fuzzy! You've been \n                         running. You get to the shower!\n\n               A NEW COUPLE comes up the hill. The orphans stop and stare, \n               brushing snow off themselves, struggling to make themselves \n               look presentable. Curly is desperate to look his best. Mary \n               Agnes doesn't bother to pretty herself. She whispers to Clara \n               and Hazel.\n\n                                     MARY AGNES\n                         I know the type--they'll take one of \n                         the babies.\n\n               INT. DINING HALL - MORNING\n\n               The children are eating breakfast as the would-be parents \n               walk around the tables, looking over the assembled orphans. \n               Curly works on his table manners; he forks and eats a piece \n               of pancake with elegance. Angela and Edna try to make the \n               couple slow down by the older children, but the couple stop \n               and stare at the adorable Hazel.\n\n               INT. BABY ROOM - MORNING\n\n               Larch and Homer are examining the babies. The doctors are \n               checking the babies' grips, their eyes, ears, and throats.\n\n               Angela appears in the doorway.\n\n                                     ANGELA\n                         Wilbur, the adopting couple is waiting \n                         in your office.\n\n                                     LARCH\n                              (irritated)\n                         Life is waiting.\n\n               Angela disappears. Larch looks at the next baby's record \n               (attached to the bed).\n\n                                     LARCH\n                         Where's the name sheet?\n\n                                     HOMER\n                         Nobody's named this one yet.\n\n                                     LARCH\n                         It's my turn!\n\n               Homer is tired of this game. Larch touches the child's \n               forehead with his index finger.\n\n                                     LARCH\n                         Henceforth you shall be... Little \n                         Dorrit!\n\n               The baby starts to cry.\n\n                                     HOMER\n                         He doesn't like it.\n                              (looks at the record)\n                         He's a boy, That's why.\n\n                                     LARCH\n                         Can't a boy be a Dorrit?\n\n                                     HOMER\n                         I don't think so.\n\n                                     LARCH\n                         You do it then.\n\n               Homer points his finger at the child's forehead like a gun.\n\n                                     HOMER\n                         Henceforth you shall be... Little \n                         Wilbur.\n\n                                     LARCH\n                         I'm not crazy about the \"Little...\"\n\n               Homer is writing the name.\n\n                                     HOMER\n                         Okay, he's just a Wilbur then.\n\n                                     LARCH\n                         We haven't had a Wilbur here in a \n                         year or so, have we? We used to have \n                         *dozens*!\n\n               They are interrupted by Copperfield, who comes running from \n               the corridor.\n\n                                     COPPERFIELD\n                         They picked Hazel! The idiots chose \n                         Hazel!\n\n               INT. GIRLS' DIVISION - DAY\n\n               Hazel is being fussed over by Edna. Hazel clutches a cardboard \n               suitcase and a tattered rag doll. Mary Agnes, by far the \n               oldest, sits on a bed.\n\n                                     MARY AGNES\n                         If people want to adopt one of us, \n                         they should have to take the oldest \n                         first.\n\n                                     EDNA\n                         Please, Mary Agnes! This is Hazel's \n                         special day--don't make her feel \n                         sad.\n\n                                     MARY AGNES\n                         Hazel's practically the youngest of \n                         us. She should be the *last* to leave!\n\n                                     CLARA\n                         At least Hazel can talk. Usually \n                         they take one of the stupid babies.\n\n                                     MARY AGNES\n                         They take the babies so they won't \n                         ever have to tell them that they \n                         were orphans!\n\n                                     HAZEL\n                              (begins to cry)\n                         I'm not a baby!\n\n                                     MARY AGNES\n                         If you cry, Hazel, they'll just send \n                         you back.\n\n                                     EDNA\n                         Mary Agnes, that's not true!\n\n               Hazel cries harder.\n\n                                     MARY AGNES\n                         That's what they did to me!\n\n                                     EDNA\n                         You *wanted* to come back--that's \n                         why you cried.\n                              (to Hazel)\n                         You can cry if you feel like it, \n                         Hazel. You cry as much as you want.\n\n               INT. LARCH'S OFFICE - DAY\n\n               Homer is in the corridor outside the office, overhearing \n               Larch's lecture to the couple adopting Hazel.\n\n                                     LARCH\n                         It is strictly for our orphans' sake \n                         that I destroy any record of their \n                         natural mothers. Of course they will, \n                         one day, want to know. But orphans, \n                         especially, should look forward to \n                         their *futures*. Not back to their \n                         pasts.\n\n               INT. WINDOW, CORRIDOR - DAY\n\n               Homer sees Curly standing all alone by a window in the \n               corridor; a suitcase is next to him.\n\n                                     HOMER\n                         Hi, Curly. You going somewhere?\n\n               Curly shakes his head.\n\n                                     CURLY\n                         I thought they might take me.\n\n                                     HOMER\n                         They wanted a girl.\n\n                                     CURLY\n                         Nobody ever wants me!\n\n               Homer embraces Curly and lifts him up, he grabs the suitcase \n               and continues down the corridor.\n\n                                     HOMER\n                         You're one of the best, Curly--we \n                         couldn't let just anyone take you.\n\n                                     CURLY\n                         Dr. Larch wouldn't let just anyone \n                         take *any* of us!\n\n                                     HOMER\n                         That's true.\n\n                                     CURLY\n                         Nobody's asked for me, have they?\n\n                                     HOMER\n                         Nobody special enough, Curly.\n\n                                     CURLY\n                         You mean somebody asked?\n\n                                     HOMER\n                         Only the right people can have you, \n                         Curly.\n\n               Homer disappears into the boys' bunk room carrying Curly and \n               his suitcase, leaving the corridor empty.\n\n               INT./EXT. ORPHANAGE - DAY\n\n               Faces in the windows; the orphans watch Hazel walking across \n               the snowy lawn with her new parents.\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               Edna (with the girls) gives her good-bye blessing to Hazel.\n\n                                     EDNA\n                         Let us be happy for Hazel. Hazel has \n                         found a family. Good night, Hazel.\n\n                                     THE GIRLS\n                         Good night, Hazel! Good night, Hazel! \n                         Good night, Hazel!\n\n               INT./EXT. ORPHANAGE - FRONT DOOR - DAY\n\n               The front door opens. The orphans excitedly run outside onto \n               the green lawn, into the warm weather of spring.\n\n               INT. DISPENSARY - MORNING\n\n               Angela is singing along with the song on the phonograph, a \n               more romantic song then before, which rouses Larch from his \n               ether. He is grumpy, but she sings the song in his ear and \n               won't give him back the ether cone; he rolls away from her, \n               but she tickles him and bites his ear, coaxing him into a \n               more playful mood.\n\n                                     LARCH\n                         I was dreaming about you. How \n                         beautiful you were!\n\n                                     ANGELA\n                         You weren't dreaming about me.\n\n                                     LARCH\n                         I was!\n\n               Playfully, she slips out of his embrace.\n\n                                     ANGELA\n                         Then I wasn't beautiful.\n\n                                     LARCH\n                         You were! You *are*! It was fantastic.\n\n                                     ANGELA\n                         It was just the ether, Wilbur...\n\n               INT. HOSPITAL ROOM - NIGHT\n\n               Homer wheels a tray with glasses of water between the beds. \n               A DISTRAUGHT PREGNANT WOMAN stops him by her bed.\n\n                                     HOMER\n                         Are you okay? Can I get you anything?\n\n                                     DISTRAUGHT WOMAN\n                         No one but me ever put a hand on me, \n                         to feel that baby. Don't you want to \n                         touch it or put your ear down to it?\n\n                                     HOMER\n                         Okay.\n\n               Homer touches the woman's belly.\n\n                                     DISTRAUGHT WOMAN\n                         Put your ear there. Go on.\n\n               Homer cautiously lays his ear against her belly.\n\n                                     DISTRAUGHT WOMAN\n                         You shouldn't have a baby if there's \n                         no one who wants to put his face \n                         right there!\n\n               She holds Homer's head against her belly; she presses his \n               face into her. She shuts her eyes. Homer's eyes stare widely. \n               Dr. Larch stops in the doorway; he watches with concern.\n\n                                     DISTRAUGHT WOMAN\n                         Stay right there. Right where you \n                         are. Stay right here. Right here.\n\n               EXT. ST. CLOUD'S - TRAIN STATION - DAY\n\n               Homer at the train station, staring down the empty tracks. \n               Buster is hanging around with him, kicking a rock.\n\n                                     BUSTER\n                         Do you ever think about leaving this \n                         place to go find them?\n\n               Homer makes no response. As the train approaches, Homer and \n               Buster go sit on a loading cart. They see the distraught \n               woman (no longer pregnant) from Homer's experience of a few \n               nights ago; she is leaving St. Cloud's without her baby, \n               waiting for the approaching train. Her face is a mask. The \n               DISAPPROVING STATIONMASTER gives her a hard look.\n\n                                     BUSTER\n                         I mean your parents.\n\n                                     HOMER\n                         I know who you mean. I think about \n                         leaving here, but not to find *them*.\n\n                                     BUSTER\n                         Why not?\n\n                                     HOMER\n                         Whoever they were, they didn't *do* \n                         any of the things parents are supposed \n                         to do. Dr. Larch did those things, \n                         and Nurse Edna, and Nurse Angela.\n\n                                     BUSTER\n                         Yeah. But sometimes I wish I could \n                         meet mine, anyway.\n\n                                     HOMER\n                         What for, Buster? What would you do \n                         if you met them?\n\n                                     BUSTER\n                         Uh... I'd like to show them that I \n                         can cook, a little.\n\n                                     HOMER\n                         You cook very well!\n\n                                     BUSTER\n                         And that I can drive a truck!\n\n                                     HOMER\n                              (laughing)\n                         Better than I can!\n\n                                     BUSTER\n                         Sometimes I want to meet them so I \n                         can kill them. Just sometimes.\n\n               Buster is ashamed; he knows he's said the wrong thing.\n\n                                     BUSTER\n                         Homer, you know I would never kill \n                         anyone--you know I wouldn't.\n\n                                     HOMER\n                         I know.\n\n               The slowly moving train has stopped. There are SOLDIERS \n               leaning out the windows. Buster turns to see Mary Agnes \n               walking past the train--she's doing her best to look grown-\n               up, sophisticated. One of the soldiers reaches out and gently \n               tugs on  her hair. Mary Agnes is enraged; she spits at the \n               soldier.\n\n                                     BUSTER\n                         I think Mary Agnes could kill someone.\n\n                                     HOMER\n                         I doubt it. She's just an...\n\n               Mary Agnes spits at *all* the soldiers.\n\n                                     HOMER\n                         ...emotional girl.\n\n               The soldiers roll up the windows as Mary Agnes improvises \n               some verbal abuse.\n\n                                     BUSTER\n                         What's she so emotional about?\n\n                                     HOMER\n                              (shrugs)\n                         I don't know. She got left here, \n                         like the rest of us, didn't she?\n\n               Camera closes on Homer.\n\n               INT. DINING HALL - NIGHT\n\n               The orphans are watching King Kong, the part when the giant \n               ape first captures the screaming Fay Wray. Intercut Kong \n               with the orphans' rapt faces. Homer sits near the front, \n               mesmerized by the film. Dr. Larch and Angela sit by the \n               projector; Larch is reading a letter. Fuzzy points to the \n               screen.\n\n                                     FUZZY\n                              (coughing)\n                         He thinks she's his *mother*!\n\n               King Kong is undressing Fay Wray in the cave.\n\n                                     COPPERFIELD\n                         He doesn't think she's his mother, \n                         Fuzzy.\n\n                                     FUZZY\n                         He does so! He *loves* her!\n\n                                     CARLA\n                         How could she be his *mother*?\n\n               Larch shakes the letter in front of Angela.\n\n                                     LARCH\n                              (a harsh whisper)\n                         They want to replace me! The Board \n                         of Trustees wants to *replace* me!\n\n                                     ANGELA\n                              (whispering back)\n                         They just want you to hire some new \n                         help.\n\n                                     LARCH\n                         Some new *things* would be useful. I \n                         don't need any \"new help.\"\n\n               The film breaks--to huge cries of disappointment from the \n               orphans. Fuzzy coughs and coughs while Larch fumbles with \n               the projector. Angela turns on the light while Larch squints \n               at the broken film. The orphans are chanting, \"Kong! Kong!\"\n\n                                     LARCH\n                         Homer! I need you!\n\n               Homer gets up and walks to the projector.\n\n                                     LARCH\n                         I thought you took care of this. It \n                         always breaks in the same place. \n                         It's your splice, isn't it?\n\n                                     HOMER\n                              (angry)\n                         It's *your* splice! You blame me for \n                         everything!\n\n               Larch abruptly lets go of the film.\n\n                                     LARCH\n                         Angela, we need a new movie, a new \n                         projector, a new typewriter--*that's* \n                         what they should replace around here!\n\n               Edna comes in; she speaks to Larch, then quickly leaves.\n\n                                     EDNA\n                         We have a delivery. Imminent, in my \n                         estimation...\n\n               Larch turns to Homer.\n\n                                     LARCH\n                         Homer, would you get this one?\n\n               Homer shifts his weight to the other foot; aggravated; he \n               stands there.\n\n                                     HOMER\n                         She's a patient, right? She should \n                         see a doctor.\n\n               Homer and Larch stare at each other.\n\n                                     LARCH\n                              (trying to stay calm)\n                         Homer, you are a skilled and gifted \n                         surgeon. You have near-prefect \n                         obstetrical and gynecological \n                         procedure.\n\n               Homer is also trying to avoid a fight.\n\n                                     HOMER\n                         I just mean I'd rather fix the movie. \n                         Tonight.\n\n               Larch can't hide his disappointment.\n\n                                     LARCH\n                         Sure. Okay. You splice. I'll deliver.\n\n               It is an uneasy peace.\n\n               INT. BOYS' DIVISION - NIGHT (LATER)\n\n               Homer is adjusting Fuzzy's breathing tent as the other boys \n               climb into bed.\n\n                                     FUZZY\n                         Homer... doesn't King Kong think the \n                         woman is his *mother*?\n\n                                     HOMER\n                         Uh, sure--that's what Kong thinks, \n                         all right.\n\n                                     FUZZY\n                         That's why Kong loves her!\n\n               Larch comes in and walks over to Homer and Fuzzy. Larch and \n               Homer exchange a look.\n\n                                     HOMER\n                         I thought it was my turn.\n\n                                     LARCH\n                         It is. I'll get this. You go ahead.\n\n               Homer sits down with 'David Copperfield.' There is quiet \n               anticipation while Homer readies himself to read.\n\n                                     HOMER\n                              (reading)\n                         \"Whether I shall turn out to be the \n                         hero of my own life, or whether that \n                         station will be held by anybody else, \n                         these pages must show.\"\n\n               Larch continues to adjust Fuzzy's breathing tent.\n\n                                     HOMER\n                         \"I was a posthumous child. My father's \n                         eyes had closed upon the light of \n                         this world six months, when mine \n                         opened on it.\"\n\n                                     FUZZY\n                              (whispers to Larch)\n                         His father's dead, right?\n\n                                     LARCH\n                              (whispering back)\n                         That's right, Fuzz.\n\n               Close on Fuzzy.\n\n                                     HOMER (O.S.)\n                              (continues reading)\n                         \"There is something strange to me, \n                         even now, in the reflection that he \n                         never saw me...\"\n\n               As Larch bends over Fuzzy to fix the breathing apparatus, \n               Fuzzy whispers.\n\n                                     FUZZY\n                         Is *your* father dead?\n\n                                     LARCH\n                              (nods, whispers)\n                         Cirrhosis--it's a disease of the \n                         liver.\n\n                                     FUZZY\n                         *Liver* killed him?\n\n                                     LARCH\n                         *Alcohol* killed him--he drank himself \n                         to death.\n\n                                     FUZZY\n                         But did you know him?\n\n                                     LARCH\n                         Barely. It hardly mattered that I \n                         knew him.\n\n                                     FUZZY\n                         Did you know your mother better?\n\n                                     LARCH\n                              (nods, still whispers)\n                         She's dead now, too. She was a nanny.\n\n                                     FUZZY\n                         What's a nanny do?\n\n                                     LARCH\n                         She looks after other people's \n                         children.\n\n                                     FUZZY\n                         Did you grow up around here?\n\n                                     LARCH\n                         No. She was an immigrant.\n\n                                     FUZZY\n                         What's an immigrant?\n\n                                     LARCH\n                         Someone not from Maine.\n\n               EXT. ST. CLOUD'S - NIGHT\n\n               The orphanage in moonlight. Not a sound.\n\n               EXT. ST. CLOUD'S - MORNING\n\n               The children are chasing a ball near the incinerator.\n\n               A VERY FRIGHTENED GIRL---not one of the orphans--is lying \n               next to the incinerator.\n\n               Edna kneels by the strange girl, who cringes with fear.\n\n                                     EDNA\n                         No one's going to hurt you, dear. \n                         Have you come to visit us? We have \n                         beds, you know. Have you had any \n                         breakfast? What's your name?\n\n               The girl won't speak; when Edna touches the girl's forehead, \n               she pulls back her hand in alarm.\n\n               INT. OPERATING ROOM - MORNING\n\n               Edna is holding the head of the frightened young girl. The \n               girl is feverishly hot and whimpering; she keeps looking at \n               her feet in the stirrups as if she's an animal caught in a \n               trap. Larch and Homer stand on either side of her.\n\n                                     EDNA\n                         Her temperature is a hundred and \n                         four.\n\n                                     LARCH\n                              (very gently)\n                         How old are you, dear? Thirteen?\n\n               The girl shakes her head. The pain stabs her again.\n\n                                     LARCH\n                         Twelve? Are you twelve, dear?\n                              (the girl nods)\n                         You have to tell me how long you've \n                         been pregnant.\n                              (the girl freezes)\n                         Three months?\n\n               Another stab of pain contorts the girl.\n\n                                     LARCH\n                         Are you *four* months pregnant?\n\n               The girl holds her breath while he examines her abdomen; \n               Homer very delicately examines the girl's abdomen, too.\n\n                                     HOMER\n                              (whispers to Larch)\n                         She's at least *five*.\n\n               The girl goes rigid as Larch bends into position.\n\n                                     LARCH\n                         Dear child, it won't hurt when I \n                         look. I'm just going to *look*.\n\n               Homer assists Larch with the speculum.\n\n                                     LARCH\n                         Tell me: you haven't done something \n                         to yourself, have you?\n\n                                     TWELVE-YEAR-OLD GIRL\n                         It wasn't me!\n\n                                     LARCH\n                         Did you go to someone else?\n\n                                     TWELVE-YEAR-OLD GIRL\n                         He said he was a doctor. I would \n                         never have stuck that inside me!\n\n                                     HOMER\n                         Stuck *what* inside you?\n\n               Homer holds the girl still--she is babbling on and on while \n               Larch is examining her.\n\n                                     TWELVE-YEAR-OLD GIRL\n                         It wasn't me! I would never do no \n                         such thing! I wouldn't stick that \n                         inside me! It wasn't me!\n\n               Larch, his wild eye peering into the speculum, makes an \n               audible gasp from the shock of what he sees inside the girl. \n               Larch tells Homer to have a look. Larch then whispers \n               something to Edna; she brings the ether bottle and cone \n               quickly. Larch starts putting the cone in place, over the \n               nose and mouth of the frightened girl. Homer bends to the \n               speculum.\n\n                                     LARCH\n                              (to the twelve-year-\n                              old)\n                         Listen, you've been very brave. I'm \n                         going to put you to sleep--you won't \n                         feel it anymore. You've been brave \n                         enough.\n\n               Homer stares into the speculum; he closes his eyes. The girl \n               is resisting the ether, but her eyelids flutter closed.\n\n                                     EDNA\n                         That's a heavy sedation.\n\n                                     LARCH\n                         You *bet* it's a heavy sedation! The \n                         fetus is unexpelled, her uterus is \n                         punctured, she has acute peritonitis, \n                         and there's a foreign object. I think \n                         it's a crochet hook.\n\n               Homer has pulled off his surgical mask. He leans over the \n               scrub sink, splashing cold water on his face.\n\n                                     LARCH\n                              (to Homer)\n                         If she'd come to you four months ago \n                         and asked you for a simple D and C, \n                         what would you have decided to do? \n                         *Nothing*? *This* is what doing \n                         nothing gets you, Homer. It means \n                         that someone else is going to do the \n                         job--some moron who doesn't know \n                         *how*!\n\n               Homer, furious, leaves the operating room. Edna lifts the \n               girl's eyelids for Larch so that he can see how well under \n               the ether she is.\n\n                                     LARCH\n                         I wish you'd come to *me*, dear child. \n                         You should have come to me, instead.\n\n               INT. CORRIDOR - MORNING\n\n               Homer storms down the hall, then stops, pulling off his white \n               coat. Angry, pacing, he kicks at nothing.\n\n               EXT. ST. CLOUD'S - GRAVEYARD - EARLY MORNING\n\n               Buster and Homer are digging the pit. Larch paces by the \n               coffin of the 12-year-old girl.\n\n                                     BUSTER\n                         What'd she die of?\n\n                                     LARCH\n                              (inhales deeply)\n                         She died of *secrecy*, she died of \n                         *ignorance*...\n\n               Buster nods, but he's totally bewildered.\n\n                                     LARCH\n                              (to Homer)\n                         If you expect people to be responsible \n                         for their children, you have to give \n                         them the right to decide whether or \n                         not to *have* children. Wouldn't you \n                         agree?\n\n               Buster doesn't get it. Homer has heard this too many times; \n               he rolls his eyes.\n\n                                     HOMER\n                         How about expecting people to be \n                         responsible enough to control \n                         themselves to begin with?\n\n                                     LARCH\n                         How about this child? You expect \n                         *her* to be responsible?\n\n               Homer looks away.\n\n                                     HOMER\n                         I didn't mean her. I'm talking \n                         about... adults.\n                              (annoyed)\n                         You know who I mean!\n\n               Larch studies him.\n\n               EXT./INT. ST. CLOUD'S ROAD - TRUCK CAB - DAY\n\n               Buster is driving the old pickup truck, with the shovels and \n               a wheelbarrow in the back. Larch and Homer are in the cab, \n               they are being bounced all over the cab by Buster's wild \n               driving. Larch looks at Homer; he stares at him with a curious \n               smile.\n\n                                     HOMER\n                         What?!\n\n               Larch says nothing. Homer gives him a look.\n\n                                     LARCH\n                              (smiling)\n                         It's just a marvel to me that you \n                         still have such high expectations of \n                         people.\n\n                                     HOMER\n                         I'm happy I amuse you.\n\n                                     LARCH\n                              (to Homer)\n                         Try to look at it this way. What \n                         choice does Buster have? What are \n                         his options? Nobody will ever adopt \n                         him.\n                              (Buster considers \n                              this)\n\n                                     HOMER\n                         Try to look at it *this* way. Buster \n                         and I are sitting right here beside \n                         you. We could have ended up in the \n                         incinerator!\n                              (Buster grins)\n\n                                     LARCH\n                         Happy to be alive, under any \n                         circumstances--is that your point?\n\n               Buster is distracted; he drives the truck into a ditch and \n               it bounces around, missing a tree by an inch. He is up on \n               the road again in a few seconds.\n\n                                     HOMER\n                         Happy to be alive... I guess so.\n\n               They are all distracted by a luxurious convertible that \n               overtakes them on the hill to the orphanage. The fast car is \n               driven by a handsome man in the uniform of the Army Air Corps--\n               a YOUNG OFFICER. From the passenger seat, a BEAUTIFUL YOUNG \n               WOMAN smiles at them, rendering them speechless.\n\n               EXT. ORPHANAGE DRIVEWAY - DAY\n\n               The luxurious convertible (now parked) has drawn all the \n               orphans to it. The handsome young officer (WALLY) and the \n               beautiful young woman (CANDY) stand confused by the car; \n               they are surrounded by the curious orphans, with whom they \n               are painfully self-conscious. They are overly friendly to \n               the children as they are anxious of Larch and Homer and Buster \n               (in their gravedigging attire), who are getting out of the \n               truck. Nervously, Wally gives the children chocolates.\n\n                                     CANDY\n                         So many children. Are they all \n                         orphans?\n\n                                     WALLY\n                         Well, this *is* an orphanage.\n\n               The kids climb into Wally's car.\n\n                                     CANDY\n                         Oh, they're getting into the car... \n                         watch your fingers!\n\n               Curly tugs on Candy's dress, staring up at her, his face \n               already smeared with chocolate.\n\n                                     CURLY\n                         I'm the best.\n\n                                     CANDY\n                              (sweetly)\n                         You are?\n\n                                     WALLY\n                              (good with kids)\n                         The best? Wow! The best at *what*?\n\n                                     CURLY\n                         I'm the best one.\n\n               Curly's nose is streaming snot. Candy kneels beside him and \n               holds her handkerchief to his nose.\n\n                                     CANDY\n                         Here, blow...\n\n               Curly tries to talk while she's holding his nose.\n\n                                     CURLY\n                         I really *am* the best, I just have \n                         a cold.\n\n                                     CANDY\n                         Blow! There, I bet that feels better.\n\n                                     CURLY\n                              (sniffs)\n                         Yeah.\n\n               The other orphans are dying with envy--Candy is so beautiful. \n               (Some, like Buster, are torn between Candy and the car.)\n\n                                     LARCH\n                         Curly, come here!\n\n                                     CURLY\n                              (to Larch)\n                         *Tell* them! I'm the one.\n\n               Virtually all the orphans have climbed into Wally's car.\n\n                                     HOMER\n                              (to Wally)\n                         I'm sorry. They're not used to seeing \n                         a car like this.\n\n                                     WALLY\n                         It's okay--I don't mind.\n\n               Larch, scowling, presents himself to the new couple.\n\n                                     WALLY\n                         We brought some chocolates for the \n                         kids.\n\n                                     LARCH\n                              (witheringly)\n                         Chocolates. How *thoughtful*.\n\n               Larch picks up Curly and carries him toward the boys' \n               division.\n\n                                     CURLY\n                         I'm the best! *Tell* them!\n\n                                     LARCH\n                         You're the best, Curly.\n\n               INT. LARCH'S OFFICE - DAY\n\n               Homer is seated in the desk chair. The impressive couple sit \n               in front of him.\n\n                                     HOMER\n                         So, Mrs...\n\n                                     CANDY\n                         Candy. Candy Kendall.\n\n               Wally jumps up to his feet to shake Homer's hand.\n\n                                     WALLY\n                         Wally. Wally Worthington.\n\n               Wally sits down. The three sit still for an awkward moment.\n\n                                     HOMER\n                              (to Candy)\n                         How many months are you?\n\n                                     CANDY\n                              (whispers)\n                         Two.\n\n               Homer writes on a piece of paper. Candy and Wally exchange a \n               worried look.\n\n                                     WALLY\n                         So, now, uh... you're not... I mean, \n                         do *you* do the--\n\n                                     HOMER\n                         No. Dr. Larch will be performing the \n                         procedure.\n\n                                     WALLY\n                              (relieved)\n                         Ah, well... okay. Good! I just \n                         wondered...\n\n               Edna pokes her head in the door.\n\n                                     EDNA\n                         Excuse me, Homer. Dr. Larch said \n                         this one is your turn.\n\n               Edna quickly sees that all three of them have misunderstood \n               her.\n\n                                     EDNA\n                         Oh, dear--I'm sorry. I meant the \n                         circumcision. That boy you delivered \n                         on Tuesday...\n\n                                     HOMER\n                         Sure. Fine. Have you prepped him?\n\n                                     EDNA\n                         I'll get started.\n\n               Candy and Wally can't conceal how impressed they are with \n               the young Homer.\n\n               INT. CORRIDOR - DAY\n\n               Homer walks down the corridor, dressed in his operating gown, \n               as the door to the O.R. opens and Wally stumbles out, \n               hurriedly opening a window. Wally breathes deeply to regain \n               his composure.\n\n                                     WALLY\n                         I think it was the ether--the smell \n                         got to me.\n                              (pause)\n                         God. This is all my fault.\n\n               Edna comes down the hall with a dirt-stained, crying Curly \n               who's covering one eye.\n\n                                     EDNA\n                              (over the din)\n                         Steerforth got into the pantry--he's \n                         eaten all the pie dough.\n\n                                     CURLY\n                              (sobbing)\n                         He wasn't sharing it, either.\n\n                                     EDNA\n                         He's down the hall, throwing up.\n\n               Homer nods to Edna, who is marching off with Curly. Wally \n               smiles at Homer.\n\n                                     HOMER\n                         What kind of plane are you flying?\n\n                                     WALLY\n                         A B-24 Liberator.\n\n                                     HOMER\n                         Liberator...\n\n                                     WALLY\n                         Have you enlisted?\n\n                                     HOMER\n                         They wouldn't take me. I'm Class IV--\n                         I've got a heart defect.\n\n                                     WALLY\n                         Really! Is it serious?\n\n                                     HOMER\n                         No, it's not serious. I'm just not \n                         supposed to get excited. You know--\n                         no strain, no stress. I try to keep \n                         calm all the time.\n\n               Wally hears Homer's facetiousness--how tired he is of his \n               heart condition.\n\n                                     WALLY\n                         Oh, well. I don't imagine there's \n                         any strain or stress around *here*!\n\n               Homer appreciates the joke.\n\n               The door to the operating room that Wally exited opens into \n               the corridor; Candy is being wheeled out on a gurney by Larch \n               and Angela. Wally rushes to Candy's side. Homer follows \n               slowly. Candy is groggy, coming out of the ether.\n\n                                     WALLY\n                         How is she doing?\n\n                                     LARCH\n                         Just fine.\n\n                                     CANDY\n                              (slurred speech)\n                         Boy or girl?\n\n                                     ANGELA\n                         It was nothing--it's all over.\n\n                                     WALLY\n                         It's all over, honey.\n\n               They walk Candy on her gurney. Homer looks after them.\n\n                                     CANDY\n                              (slurred speech)\n                         I would like to have a baby, one \n                         day. I really would.\n\n                                     ANGELA\n                         Why, of course--you can have as many \n                         children as you want. I'm sure you'll \n                         have very beautiful children.\n\n               Larch wheels Candy behind a curtain.\n\n                                     LARCH\n                         You'll have Princes of Maine! You'll \n                         have Kings of New England!\n\n               Larch has a different tone of voice when he speaks to Wally.\n\n                                     LARCH\n                         I suggest you find yourself some \n                         fresh air, Lieutenant.\n\n               Wally is left alone in the corridor.\n\n               INT. BOYS' DIVISION - DAY\n\n               Cranked at three-quarters, Fuzzy sits in bed, wheezing and \n               coughing. He's drawing with great intensity, using crayons \n               on a piece of paper held by a clipboard. Homer sits on the \n               end of Fuzzy's bed, cleaning up Steerforth. Homer pauses to \n               look out of the window; he sees Wally, dashing and spotless \n               in his uniform beside his flashy car. A life Homer might \n               have had crosses his face.\n\n                                     FUZZY (O.S.)\n                         Homer, when is Halloween?\n\n               Homer turns to Fuzzy, who holds up his picture--a big pumpkin \n               with a jack-o-lantern face.\n\n                                     HOMER\n                              (distracted)\n                         Uh... it's the end of October.\n\n                                     FUZZY\n                         Is that soon?\n\n               Homer looks at Fuzzy; his little body is working hard just \n               to breathe.\n\n                                     STEERFORTH\n                         That's a few months away, Fuzz.\n                              (to Homer)\n                         I still don't feel so good.\n\n                                     FUZZY\n                              (disappointed)\n                         Oh. It's the best time! How come we \n                         only get pumpkins once a year?\n\n               Fuzzy coughs and coughs.\n\n                                     HOMER\n                         Don't get too excited, Fuzzy.\n\n                                     FUZZY\n                         Why can't we have pumpkins for \n                         Christmas, too? We don't get any \n                         good presents at Christmas, anyway.\n\n               Homer looks out the window at Wally again. His decision forms.\n\n               EXT. ORPHANAGE DRIVEWAY - DAY\n\n               Homer approaches the flashy car, where Wally is still pacing.\n\n                                     HOMER\n                         Has anyone offered you anything to \n                         eat?\n\n                                     WALLY\n                         Actually, someone did. I just didn't \n                         think I could eat anything.\n\n               An awkward silence, which Homer covers by examining the car.\n\n                                     HOMER\n                              (trying to sound casual)\n                         I wonder if you might give me a ride.\n\n                                     WALLY\n                         Sure! Be glad to! Uh... a ride where?\n\n                                     HOMER\n                              (unprepared)\n                         Where are you going?\n\n                                     WALLY\n                         We're heading back to Cape Kenneth.\n\n               Homer nods, but he has no idea where Cape Kenneth is.\n\n                                     HOMER\n                         Cape Kenneth...\n\n               Wally nods.\n\n                                     HOMER\n                         That sounds fine.\n\n               INT. STAIRWAY/CORRIDOR - DAY\n\n               Homer runs up the stairs, two steps at a time; he races into \n               a corridor at full speed, exhilarated. Suddenly Dr. Larch \n               appears in front of him. Homer stops abruptly, out of breath, \n               unable to speak.\n\n               INT. LARCH'S OFFICE - DAY\n\n               As Homer stands guiltily, Larch rifles through an X-ray file, \n               holding various X rays up to the lit screen. He quickly finds \n               the one he's looking for, attaching it briefly to the screen \n               for a confirming look--a heart X ray, which Larch waves at \n               Homer as he talks.\n\n                                     LARCH\n                              (sarcastic)\n                         Doubtless you'll let me know what \n                         immensely worthwhile or at least \n                         *useful* thing it is that you find \n                         to do.\n\n                                     HOMER\n                              (restrained)\n                         I wasn't intending to leave here in \n                         order to be entirely useless--I expect \n                         I'll find some ways to be of use.\n\n                                     LARCH\n                         In other parts of the world, I suppose \n                         there are other ways.\n\n                                     HOMER\n                              (still restrained)\n                         Of course.\n\n                                     LARCH\n                              (blows up)\n                         Are you really so *stupid* that you \n                         imagine you're going to find a more \n                         gratifying life? What you're going \n                         to find is people like the poor people \n                         who get left here--only nobody takes \n                         care of them as well! And you won't \n                         be able to take care of them, either. \n                         There's no taking care of *anybody*--\n                         not out there!\n\n                                     HOMER\n                              (feeling trapped)\n                         You know I'm grateful for everything \n                         you've done for me...\n\n                                     LARCH\n                              (calmly)\n                         I don't need your gratitude.\n\n               Larch hands Homer the heart X ray.\n\n                                     HOMER\n                              (exasperated)\n                         I don't need this--I know all about \n                         my condition.\n\n                                     LARCH\n                         It's your heart--you ought to take \n                         it with you.\n\n               Camera closes on Homer with the X ray.\n\n               INT. KITCHEN - LATE AFTERNOON\n\n               Buster and Mary Agnes are serving the evening meal while \n               Larch rails at Angela and Edna, who are helping Buster and \n               Mary Agnes. The sound of children in the dining hall is \n               intermittent and chaotic.\n\n                                     EDNA\n                         Going where? Does he have a plan of \n                         some kind?\n\n                                     ANGELA\n                         Will he be back soon?\n\n                                     LARCH\n                         I don't know! He's just leaving--\n                              (to Angela)\n                         you're the one who says he needs to \n                         see the world!\n                              (to Edna)\n                         *That's* what he'll do--he'll see \n                         the world!\n\n                                     EDNA\n                              (stunned)\n                         He's leaving...\n\n                                     ANGELA\n                         He'll need clothes... some money...\n\n                                     LARCH\n                         Let him try to *make* some money! \n                         That's part of \"seeing the world,\" \n                         isn't it?\n\n                                     ANGELA\n                              (angrily)\n                         Oh, just stop it! You knew this was \n                         going to happen. He's a young man.\n\n                                     LARCH\n                              (almost breaking)\n                         He's still a boy--out in the world, \n                         he's still a boy.\n\n                                     ANGELA\n                         Just find him some clothes, Wilbur. \n                         He could use some clothes.\n\n               Camera closes on Larch, fighting tears.\n\n               INT. BOYS' DIVISION - AFTERNOON\n\n               Homer is packing his things--we see the heart X ray, and \n               some photos of Larch and Edna and Angela.\n\n               Larch approaches Homer with a small bundle of clothes.\n\n                                     LARCH\n                              (gently, almost \n                              reverently)\n                         I think these will fit you.\n\n               Homer is grateful and ashamed. Before he can speak, Edna is \n               there--a wad of bills in her hand. She tries to put the money \n               in his pocket; when he refuses it, she simply puts the money \n               in his open suitcase, stuffing the bills under his clothes.\n\n                                     EDNA\n                         You'll need some money--just a little \n                         something, until you find a job.\n\n               Larch and Edna retreat from him, humbly, as if they were his \n               servants.\n\n               EXT. DRIVEWAY - AFTERNOON\n\n               As Homer puts his stuff in the truck of Wally's car, Angela \n               can't resist touching his face. She is too upset to speak.\n\n               From a window, Larch is watching the departure. He sees Homer \n               saying goodbye to the children, embracing them.\n\n               From another window, Fuzzy just stares. (Of course he's \n               coughing.)\n\n               We see Wally carrying Candy to the car.\n\n                                     CANDY\n                              (groggy)\n                         I'm okay--I can walk.\n\n                                     WALLY\n                         I don't want you to walk--I want to \n                         carry you. Should I put the top up? \n                         It might get cold.\n\n                                     CANDY\n                         No--keep it down. I want to feel the \n                         air.\n\n               She speaks to Homer, touching his sleeve, like a sleepy \n               person, as Wally puts her gently in the backseat.\n\n                                     CANDY\n                              (still groggy)\n                         Coming with us? It's always a good \n                         idea to have a doctor along for the \n                         ride.\n\n               Homer gets in the passenger seat beside Wally, who starts \n               the car; suddenly there is Curly. Homer can't look at Curly, \n               who looks betrayed. Edna picks up Curly and carries him to \n               the passenger-side window. Curly is sobbing.\n\n                                     HOMER\n                         I have to go, Curly. I'm sorry.\n                              (to Edna)\n                         I couldn't find Buster. Will you \n                         tell him...\n\n               He can't finish what he has to say. Edna kisses him good-\n               bye.\n\n               From the window, Larch watches the car leave.\n\n               Buster, whittling a stick, isn't watching.\n\n               INT./EXT. WALLY'S CAR - ON THE ROAD - AFTERNOON\n\n               There is quiet as the journey gets underway. Wally keeps \n               glancing at Candy in the rear-view mirror; she seems distant, \n               lost in thought. Homer is taking everything in--the speed, \n               the road, the wind in his face.\n\n               INT. BOYS' DIVISION - NIGHT\n\n               Angela speaks to the boys.\n\n                                     ANGELA\n                         Let us be happy for Homer Wells...\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               In the girls' washroom, in front of the mirror by the row of \n               sinks, Mary Agnes is repeatedly slapping her face. Angela's \n               benediction to the boys plays Over this scene of violent \n               self-abuse. Except for the sound of the slaps. Mary Agnes \n               doesn't make a sound.\n\n                                     ANGELA (O.S.)\n                         Homer Wells has found a family. Good \n                         night, Homer!\n\n                                     ALL THE BOYS (O.S.)\n                         Good night, Homer!\n\n               INT. DISPENSARY - NIGHT\n\n               On his bed, Larch is taking ether. We hear the refrain from \n               the boys in the bunk room Over.\n\n                                     ALL THE BOYS (O.S.)\n                         Good night, Homer! Good night, Homer! \n                         Good night, Homer Wells!\n\n               INT. WALLY'S CAR - NIGHT\n\n               The radio is playing. Candy is lying down, her knees drawn \n               up, in the backseat; she appears to be asleep, oblivious to \n               Homer and Wally's conversation.\n\n                                     WALLY\n                         Actually, the Army has given me leave \n                         twice. First when my father died, \n                         and now I'm on leave to help my mother--\n                         I'm just trying to get her ready for \n                         the harvest. She's no farmer. Apples \n                         were my dad's business. And with the \n                         war on, she's short on pickers.\n\n               Candy's eyes are open but her voice is groggy.\n\n                                     CANDY\n                              (to Homer)\n                         Wally thinks apples are boring.\n\n                                     WALLY\n                              (to Homer)\n                         I never said they were boring.\n\n                                     CANDY\n                         You said, \"Apples aren't exactly \n                         flying.\"\n\n                                     WALLY\n                         Well, they aren't.\n\n               Homer looks back at Candy. Her eyes close.\n\n                                     HOMER\n                         I think I'd probably like the apple \n                         business.\n\n                                     WALLY\n                         You're a little overqualified, aren't \n                         you?\n\n                                     HOMER\n                         No, I'm not. I need a job.\n\n                                     WALLY\n                         The only jobs are picking jobs. \n                         Picking apples is truly boring.\n\n               Candy's eyes snap open and she sits up a little.\n\n                                     CANDY\n                         There! You said it was boring.\n\n                                     WALLY\n                         Well, *picking* them is! It's about \n                         as exciting as... walking!\n\n               Candy seems irritated with Wally. Homer tries to engage her.\n\n                                     HOMER\n                         Is your family in the apple business, \n                         too?\n\n                                     CANDY\n                         No, but I work there--I like it. My \n                         dad's a lobsterman.\n\n                                     HOMER\n                         I've never seen a lobster.\n\n                                     CANDY\n                         Really?\n\n                                     HOMER\n                         I've never seen the ocean, either.\n\n                                     WALLY\n                              (amazed)\n                         You've never seen the *ocean*?\n\n               Homer shakes his head, smiles.\n\n                                     WALLY\n                         That's not funny... that's *serious*.\n\n               EXT./INT. ROADSIDE/CAR - NIGHT\n\n               The car is parked at the side of the road. Wally is half-\n               hidden behind a tree. Candy and Homer are left alone in the \n               car; there's an awkward silence as Homer pretends not to \n               hear Wally's excessive peeing. Suddenly Candy starts to sob.\n\n                                     CANDY\n                         I couldn't have a baby with someone \n                         who's leaving me--I didn't know what \n                         else to do!\n\n               Homer is a doctor--he's used to postabortion reactions.\n\n                                     HOMER\n                         I know.\n\n                                     CANDY\n                         He's going to be dropping bombs on \n                         Mandalay! They're going to be shooting \n                         at him!\n\n                                     HOMER\n                         Where's Mandalay?\n\n                                     CANDY\n                         Burma!\n\n                                     HOMER\n                         Oh...\n\n                                     CANDY\n                         I can't have a baby alone. I don't \n                         even know if he's coming back!\n\n                                     HOMER\n                         I understand.\n\n               He doesn't, really. Wally returns. Wally leans over Candy to \n               hug her.\n\n                                     WALLY\n                         Honey, honey... of course I'll come \n                         back.\n\n               Candy pounds on his chest with her fists.\n\n                                     CANDY\n                         You don't *know*, Wally. You have no \n                         *idea*!\n\n               Wally backs away. Candy sobs uncontrollably.\n\n                                     CANDY\n                         Stay away from me!\n\n               Wally signals to Homer to get out of the car.\n\n               Later, Wally and Homer stand outside the car, overhearing \n               Candy's weeping. Homer is smoking nervously.\n\n                                     HOMER\n                              (strictly medical)\n                         This is all normal. Don't worry. The \n                         abortion procedure... it affects \n                         you. It's the ether, too. It'll take \n                         a little time.\n\n                                     WALLY\n                         I don't *have* any time. There's a \n                         *war*!\n\n                                     HOMER\n                         It's all very normal.\n\n               Wally looks at Homer, who takes a nervous drag on his \n               cigarette.\n\n                                     WALLY\n                         You ought to cut that shit out--it's \n                         terrible for you.\n\n               Homer looks at Wally; he sees the authority in his eyes. \n               Homer drops his cigarette and puts it out with his foot.\n\n               They notice that Candy has stopped crying. Wally finds Candy \n               asleep in the backseat.\n\n               EXT. WALLY'S CAR - ON THE ROAD - LATE AT NIGHT\n\n               The lone car on the road. Snatches of war news from the radio \n               are the only sound as the headlights illuminate the dark \n               highway.\n\n               EXT. COAST OF MAINE - MORNING\n\n               The car is parked, with Homer sleeping in it alone. The sounds \n               of the ocean increase as Homer opens his eyes. Homer gets \n               out of the car and walks toward the beach, enchanted. There \n               it is: his first view ever of an ocean, the horizon, the sun \n               glimmering on the water. Candy is lying on a blanket in the \n               sand. Wally is throwing rocks in the water. Homer takes it \n               all in. When Candy calls for him, Homer walks up to her.\n\n                                     CANDY\n                         I'm a little worried about the...\n                              (she gestures below \n                              her waist)\n                         ...about how much bleeding is okay.\n\n                                     HOMER\n                         It should taper off tomorrow, but it \n                         can come back again. You have cramps?\n                              (Candy nods)\n                         They'll ease up, almost entirely. As \n                         long as the bleeding isn't heavy, \n                         it's normal.\n\n                                     WALLY (O.S.)\n                         Catch!\n\n               A football comes flying through the air toward Homer; it \n               bounces off his chest. Wally laughs.\n\n                                     WALLY\n                              (meaning the football)\n                         Give it here!\n\n               Homer throws the football; it's clear he's never thrown one \n               before.\n\n                                     WALLY\n                         What was *that*?! Come over here!\n\n               Homer runs over to Wally, who proceeds to show him how to \n               pass the ball. Snatches of his instruction drift to Candy, \n               who closes her eyes. \"Put your fingers on the laces--no, it \n               rests in your palm, like this! You want the laces up--yes, \n               like that!\"\n\n               EXT. COAST OF MAINE - DAY (LATER)\n\n               Homer and Wally sit on the beach a short distance from Candy's \n               blanket. She appears to be asleep. Wally looks in her \n               direction before he speaks to Homer.\n\n                                     WALLY\n                         It's called the Burma run. It's about \n                         a seven-hour round-trip flight between \n                         India and China.\n\n               Wally draws a crude map in the sand.\n\n                                     HOMER\n                         \"Burma run\" because you fly over \n                         Burma...\n\n                                     WALLY\n                         *And* over the Himalayas. That's \n                         called flying over the hump.\n\n               On Candy's face: she's not asleep; she's listening.\n\n                                     HOMER (O.S.)\n                         At what altitude?\n\n                                     WALLY\n                         I've got thirty-five minutes to climb \n                         to fifteen thousand feet--that's the \n                         first mountain pass.\n\n               Homer looks at Wally, thoughtfully.\n\n                                     HOMER\n                         What lousy luck--I mean your orders... \n                         to draw an assignment like that!\n\n                                     WALLY\n                              (conspiratorially)\n                         Actually, I volunteered.\n\n               Homer is shocked; he looks back at Candy, lowers his voice.\n\n                                     HOMER\n                         It's the flying, right? You love to \n                         fly, don't you?\n\n               Wally nods; he also gives a look in Candy's direction before \n               he responds.\n\n                                     WALLY\n                         I love the bombing, too. But there's \n                         also the Himalayas--they have the \n                         most wicked air currents in the world. \n                         I wouldn't miss flying there for \n                         anything.\n\n               Homer's smile suggests that he's impressed, but that he \n               wouldn't have Wally's enthusiasm for the task. Wally laughs \n               and puts his hand on Homer's shoulder.\n\n                                     WALLY\n                         Uh, look... if you're serious about \n                         wanting a job, picking apples isn't \n                         that boring.\n\n                                     HOMER\n                         Oh, I would love that, Wally.\n\n               EXT. CAPE KENNETH - LOBSTER POUND - AFTERNOON\n\n               The car is parked at a lobster pound. Homer sits in the car \n               watching Wally carrying Candy's bag to the door. Candy stands \n               outside the car; she shakes Homer's hand.\n\n                                     CANDY\n                         I guess I'll see you around the \n                         orchards. Thanks for everything.\n\n                                     HOMER\n                         Sure... I'll see you around.\n\n               Candy turns and heads toward the house to catch up with Wally. \n               A lobsterman in his boat is approaching the dock. It's RAY, \n               Candy's father. Candy waves. \"Hi, Daddy!\" Homer glances at \n               Candy and Wally on the dock, kissing good-bye.\n\n                                     CANDY\n                              (whispering)\n                         I love you, Wally.\n\n                                     WALLY\n                         I love you, too. See you tomorrow.\n\n               EXT. OCEAN VIEW - WORTHINGTON HOUSE - LATE AFTERNOON\n\n               Wally drives up to the Worthington house; he gets out of the \n               car. Homer sits in the car, admiring the beautiful farmhouse.\n\n                                     WALLY\n                         Come on. You have to meet my mom.\n                              (conspiratorially)\n                         If it comes up, I've been at a \n                         wedding. That's where I met you, at \n                         the wedding.\n\n               INT. WORTHINGTON HOUSE - WALLY'S BEDROOM - LATE AFTERNOON\n\n               Homer as never seen such a room: the sports trophies, the \n               photos of athletic teams, and of Candy with Wally. Model \n               airplanes are everywhere. Mrs. Worthington's voice comes \n               from the hall.\n\n                                     OLIVE (O.S.)\n                         Wally? I expected you earlier...\n\n               She appears in the doorway of Wally's room. Mrs. Worthington \n               (OLIVE) is an elegant, fiftyish New Englander, as handsome \n               as Wally, but more reserved. She is surprised to see Homer.\n\n                                     WALLY\n                         This is Homer Wells--he's the most \n                         overqualified apple picker you'll \n                         ever meet, but he's dying to learn \n                         the apple business.\n\n               Wally is taking his uniform off as he speaks, just dropping \n               it on the floor as he quickly puts on some farm clothes.\n\n                                     OLIVE\n                         How do you do, Homer Wells...\n\n               Homer has never met anyone like her.\n\n                                     HOMER\n                         How do you do...\n\n               Mrs. Worthington starts picking up her son's uniform from \n               the floor. She is politely curious about Homer.\n\n                                     OLIVE\n                         Were you a friend of the bride or \n                         the groom?\n\n               Homer looks confused; he seems to have forgotten about the \n               alleged wedding. Wally puts his arm around Homer, urging him \n               into the hall.\n\n                                     WALLY\n                         Homer is everybody's friend, Mom... \n                         the bride's, the groom's, mine, \n                         Candy's, *everybody's*.\n\n               Homer is embarrassed, but Olive is obdurately well-mannered.\n\n                                     OLIVE\n                         Well, perhaps you'll come to dinner, \n                         Homer...\n\n               Wally calls to her as he pushes Homer down the hall.\n\n                                     WALLY\n                         Not tonight, Mom--he's got to meet \n                         *Mr. Rose*!\n\n               EXT. CIDER HOUSE - DUSK\n\n               Homer and Wally get out of the jeep at the cider house, a \n               barnlike building with adjacent sheds and, behind it, line \n               after line of trees--the apple orchards.\n\n               Homer sees an outdoor shower where THREE BLACK MEN are \n               showering. It is a wooden stall that leaves the shower's \n               occupants visible above and below their midsections. A FOURTH \n               BLACK MAN is caught naked, running behind the cider house \n               and out of sight as he wraps a towel around himself.\n\n                                     JACK\n                         You already used up the hot water!\n\n                                     MUDDY\n                         You're usin' my soap, ain't you?\n\n                                     JACK\n                         I ain't usin' no soap--it's too cold \n                         to bother with soap!\n\n                                     MUDDY\n                         There ain't never enough hot water, \n                         soap or no soap.\n\n                                     WALLY\n                         They're migrants.\n\n                                     HOMER\n                              (no clue)\n                         Migrants?\n\n                                     WALLY\n                         Yes. They pick fruit, all kinds. \n                         They travel up and down the coast \n                         with the seasons.\n                              (leaning close to \n                              Homer)\n                         The trick to Mr. Rose is, you have \n                         to let him be the boss.\n\n               Homer wonders what that means as Wally reaches for the door \n               of the cider house. Before Wally can knock, a pretty young \n               black girl, ROSE ROSE, bumps open the screen door with her \n               hip and throws a bucket of water in the grass--almost hitting \n               Homer and Wally.\n\n                                     ROSE ROSE\n                         That sink's backed up again, Wally. \n                         I thought you was gonna get me a \n                         plumber.\n\n                                     WALLY\n                         Rose, this is Homer--Homer, this is \n                         Mr. Rose's daughter, Rose.\n\n                                     HOMER\n                         Rose Rose?\n\n                                     ROSE ROSE\n                         Pretty, ain't it? You a plumber?\n\n                                     WALLY\n                         No, no--Homer is a new *picker*. \n                         He's going to stay here with you.\n\n               This gets the attention of the men on their way from the \n               showers. They walk over, towels around their waists.\n\n                                     ROSE ROSE\n                              (suspiciously)\n                         He's stayin' *here*?\n\n               The screen door swings open and shut again, startling them \n               all, as MR. ROSE comes out of the cider house.\n\n                                     MR. ROSE\n                         That daughter of mine sure is Miss \n                         Hospitality, ain't she, Wally?\n\n               Grinning, Mr. Rose shakes Wally's hand. Rose Rose goes back \n               inside the cider house as Mr. Rose shakes Homer's hand. Homer \n               introduces himself.\n\n                                     MR. ROSE\n                         You got lots of experience pickin', \n                         I suppose.\n\n                                     WALLY\n                         Homer's got no experience, Arthur, \n                         but he's smarter then I am. He's a \n                         fast learner.\n\n               Mr. Rose looks briefly at the men, who wait for his reaction.\n\n                                     MR. ROSE\n                         This is history. Ain't that what \n                         you're sayin', Wally? I guess we \n                         makin' *history*... havin' this young \n                         man stay with us!\n\n               Wally slaps Homer on the back; he goes inside the cider house \n               to help Rose Rose with the plumbing.\n\n                                     WALLY\n                              (over his shoulder)\n                         See you later.\n\n               Homer looks at Mr. Rose for instructions. Mr. Rose stares \n               back at him with his enigmatic smile.\n\n                                     HOMER\n                         So. What should I do now?\n\n                                     MR. ROSE\n                         Out back, there's a shed. It's just \n                         a mess. If that shed was better \n                         organized, I could put my truck in \n                         there.\n\n               Homer looks at Mr. Rose with an uncomprehending expression.\n\n                                     MR. ROSE\n                         If you're as smart as Wally says, \n                         you know you sometimes gotta do one \n                         job before you do another.\n\n               Homer thinks that over.\n\n               Later, Homer is cleaning out the shed.\n\n               EXT. CIDER HOUSE - EVENING\n\n               The pickers all sit down to supper around a picnic table. \n               Homer with Mr. Rose, Rose Rose, and the other black pickers. \n               Mr. Rose takes an apple from a bowl on the table. Then he \n               pulls out a knife and opens it in one fluid motion; he's so \n               fast, the knife seems to come out of nowhere. He begins to \n               peel the apple. Homer eyes Mr. Rose, but Mr. Rose's focus is \n               riveted to his apple and the long, perfect strand of peel \n               dangling from it.\n\n                                     MR. ROSE\n                         You did a good job with that shed, \n                         Homer.\n\n               Peaches breaks the awkward silence.\n\n                                     PEACHES\n                         What kind of a name is Homer?\n\n                                     HOMER\n                         It's the name of a cat. Originally. \n                         Well, not *originally*.\n\n               Homer decides to stop. Another silence.\n\n                                     MR. ROSE\n                         Now, now--we all got names, sensible \n                         or not.\n                              (to Homer)\n                         Peaches is from Georgia, where we \n                         met him pickin' peaches. He's still \n                         better with peaches than hs is with \n                         apples.\n                              (Peaches grins)\n                         Jack here is new. And this here is \n                         Hero, 'cause he was a hero of some \n                         kind or other once. Ain't that right, \n                         Hero?\n\n               There are some disrespectful suggestions from the pickers \n               concerning what his heroism might have been.\n\n                                     MR. ROSE\n                         And this here sensitive-lookin' fella \n                         is Muddy. The less said about Muddy, \n                         the better. Ain't that right, Muddy?\n\n               Muddy scowls at Homer, but he smiles at Mr. Rose.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Homer unpacks his suitcase. (His bed should be nearest Muddy's \n               and Mr. Rose's.) Jack lies on his bed, smoking. Muddy, also \n               smoking, is sitting on his bed, sharpening a knife. Hero and \n               Peaches are playing cards on one of their beds. Mr. Rose is \n               finishing shaving. Rose Rose watches Homer unpack.\n\n                                     ROSE ROSE\n                         What's that?\n\n                                     HOMER\n                         It's just my heart.\n\n                                     ROSE ROSE\n                         What you got a picture of your heart \n                         for?\n\n               He holds up the X ray, in order to show her.\n\n                                     HOMER\n                         There's a little something wrong \n                         with it. Just this part here--the \n                         right ventricle. It's slightly \n                         enlarged.\n\n                                     ROSE ROSE\n                         So what?\n\n                                     HOMER\n                         Yes, so what. It's nothing serious, \n                         really. Just a small defect.\n\n                                     MR. ROSE\n                         It's big enough to keep you out of \n                         the war, I suppose. Ain't that right?\n\n                                     HOMER\n                         Right.\n\n               Rose Rose picks up the book that Homer has put on the bed. \n               She studies the cover; it's \"Great Expectations\" by Charles \n               Dickens. She puts it down, restlessly.\n\n                                     MR. ROSE\n                         They told me I was too old to serve.\n\n                                     PEACHES\n                         They told Muddy his feet was too \n                         flat!\n\n               Everybody laughs, except Muddy.\n\n                                     MUDDY\n                              (to Peaches)\n                         And you was \"generally unfit,\" as I \n                         recall.\n\n               Finished unpacking, Homer sits on his bed; he picks up \"Great \n               Expectations\" and begins to read. Rose Rose sits down next \n               to him, watching him read. Homer notices her interest.\n\n                                     HOMER\n                         Do you like to read?\n\n                                     ROSE ROSE\n                              (embarrassed)\n                         I can't read. Nobody taught me.\n\n               Homer smiles politely and goes back to his book. Rose Rose \n               keeps looking over his shoulder at the pages.\n\n                                     ROSE ROSE\n                              (pointing to the page)\n                         What does it say there?\n\n               Homer looks around at the pickers lying in their beds, \n               smoking, listening. (Like bedtime stories at the orphanage, \n               he thinks; however, the picker's attitude is suspicious, \n               reserved.)\n\n                                     HOMER\n                              (reading)\n                         \"I looked at the stars, and considered \n                         how awful it would be for a man to \n                         turn his face to them as he froze to \n                         death, and see no help or pity in \n                         all the glittering multitude.\"\n\n               Homer looks up; there's no response.\n\n                                     HOMER\n                              (to Rose Rose)\n                         More?\n\n               Some muttering, some giggling, mostly silence. Rose Rose \n               wants more, but suddenly Jack jumps out of bed and stomps to \n               the kitchen end of the cider house, where a piece of paper \n               is tacked to the wall. Jack is talking to Homer all the way.\n\n                                     JACK\n                         Since you're the one who's smart \n                         enough to read... what's this?\n\n               Jack points at the piece of paper. Homer gets up and looks \n               at it.\n\n                                     HOMER\n                         It's a list of rules, it seems.\n\n               All the men groan--Jack swears and Peaches laughs.\n\n                                     ROSE ROSE\n                         *Whose* rules?\n\n                                     MUDDY\n                         They're for us, I suppose.\n\n                                     JACK\n                         Go on and read 'em, Homer.\n\n                                     HOMER\n                         \"One. Please don't smoke in bed.\"\n\n                                     ROSE ROSE\n                         It's too late for that one!\n\n               All the smokers laugh and cough in their beds.\n\n                                     MR. ROSE\n                              (uncharacteristically \n                              blunt)\n                         Stop it, Homer. They aren't our rules. \n                         We didn't write them. I don't see no \n                         reason to read them.\n\n                                     HOMER\n                         Okay...\n\n               Rose Rose stomps back to her bed. Her father absently snaps \n               his towel.\n\n               INT. BUNKHOUSE - NIGHT (LATER)\n\n               Everybody is asleep, except Homer. He is staring at the \n               ceiling in the quiet semi-darkness, the book lying on his \n               chest.\n\n                                     LARCH (O.S.)\n                              (distant echoing)\n                         Good night, you Princes of Maine! \n                         You Kings of New England.\n\n               INT. BOYS' DIVISION - NIGHT\n\n               Dr. Larch is standing in the doorway to the boys' room; he \n               closes the door.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Homer, on his bed, closes his eyes.\n\n               INT. DISPENSARY - NIGHT\n\n               Larch lies in bed with his eyes open. (No ether.)\n\n               EXT. CIDER HOUSE - NIGHT\n\n               The cider house and the apple orchard in the moonlight.\n\n               EXT. ORCHARDS - MORNING\n\n               Wally in his farm clothes at the wheel of the Jeep--he is \n               racing through the orchards, dodging trees, with Homer in \n               the passenger seat, hanging on for dear life.\n\n                                     WALLY\n                         Remember this! In the morning, when \n                         the tall grass is wet, you can make \n                         the Jeep slide on the grass. Can you \n                         feel it?\n\n               Homer is excited as Wally weaves among the trees--faster and \n               faster.\n\n                                     WALLY\n                         It's almost like flying.\n\n                                     HOMER\n                         What about the trees?\n\n                                     WALLY\n                         The trees are flak--antiaircraft \n                         fire from those geeks on the ground.\n\n               Wally brakes hard. The Jeep comes to a stop in the packing-\n               house area.\n\n               Candy has been waiting on the loading platform. The pickers \n               are working in the background.\n\n                                     WALLY\n                              (defensively to Candy)\n                         I was just showing Homer the \n                         orchards... kind of a geography \n                         lesson.\n\n                                     CANDY\n                              (good-naturedly)\n                         I know what you've been doing.\n\n               She pulls an apple branch, with an apple to two, out of the \n               vehicle's grille--or else the branch is wedged in the front -\n               bumper or headlight area. Candy playfully starts poking Wally \n               with the branch.\n\n                                     CANDY\n                              (to Wally)\n                         You've been giving him a *flying* \n                         lesson!\n\n                                     WALLY\n                              (teasing her)\n                         He *loved* it!\n                              (to Homer)\n                         Didn't you?\n\n                                     HOMER\n                         Yeah, it was great.\n\n               Wally gets the apple branch away from Candy. He pins her \n               arms at her sides--he hugs her, kisses her. She doesn't \n               struggle.\n\n                                     CANDY\n                              (laughing to Homer)\n                         He thinks people *like* to get whacked \n                         by branches.\n\n                                     WALLY\n                         *Homer* liked it!\n                              (to Homer)\n                         Didn't you?\n\n                                     HOMER\n                         Yeah, sure. There's no stress or \n                         strain around here...\n\n               They all laugh. Homer observes the happy couple.\n\n               EXT. ORCHARDS - DAY\n\n               Homer is walking with Wally and Candy. The orchards are \n               beautiful.\n\n               EXT. PACKING HOUSE - MORNING\n\n               Much activity: the pickers are unloading apple crates from a \n               full flatbed trailer. An angry-looking VERNON gives Homer an \n               evil glare. Homer spills some apples lifting the crate to \n               the loading platform.\n\n                                     VERNON\n                         What's wrong with you?\n\n               Mr. Rose takes Homer aside.\n\n                                     MR. ROSE\n                         That's Vernon. You best stay away \n                         from him until he gets to know you \n                         better--then you best stay away from \n                         him *more*!\n\n               Wally, in full uniform, appears from inside the packing house; \n               he calls for Homer.\n\n                                     MR. ROSE\n                         Out lieutenant's calling you, Homer. \n                         Mind your ass.\n\n               Homer smiles are runs toward Wally.\n\n               INT./EXT. PACKING HOUSE - MORNING\n\n               Homer and Wally walk through the packing house, where the \n               HEFTY, LOUD WOMEN sort through the apples rolling by on the \n               conveyor tracks. Wally snatches an apple from one of them, \n               giving it to Homer.\n\n                                     WALLY\n                              (to Homer)\n                         You getting along okay?\n\n               Before Homer can answer, the women interrupt.\n\n                                     BIG DOT\n                         Where is that Candy?\n\n                                     FLORENCE\n                         Did she leave you, Wally?\n\n                                     DEBRA\n                         Who's the boy?\n\n               Wally makes an effort to introduce Homer, but he's \n               interrupted.\n\n                                     FLORENCE\n                         Wally, you can marry Debra if Candy \n                         leaves you!\n\n                                     BIG DOT\n                         Wally's gonna marry *me* if Candy \n                         leaves him!\n\n                                     DEBRA\n                         You can marry all three of us, Wally!\n\n                                     FLORENCE\n                         We can take turns.\n\n               Wally puts his hand to his heart.\n\n                                     WALLY\n                         You girls make it hard for a guy to \n                         go off to war.\n                              (points to Homer)\n                         But I'll leave my best man here to \n                         pinch-hit for me.\n\n               As the women are left behind giggling, Wally continues talking \n               to Homer.\n\n                                     WALLY\n                         Uh... I'm shipping out sooner than I \n                         thought. I just wanted to be sure \n                         you were settled in--and happy enough, \n                         considering...\n                              (grabbing another \n                              apple from a crate)\n                         Are you bored stiff? Or can you stick \n                         it out for a bit?\n\n                                     HOMER\n                         Uh... actually, picking apples is as \n                         much excitement as I want for a while. \n                         I'm grateful for the job.\n\n                                     WALLY\n                              (his hand on Homer's \n                              shoulder)\n                         You're the one who's helping *me*, \n                         Homer. You're going to give my mom a \n                         little peace of mind while I'm gone. \n                         Candy, too.\n\n                                     HOMER\n                         Well, sure... that's good, then.\n                              (awkward pause)\n                         All I mean is, I'm lucky I met you.\n\n                                     WALLY\n                         I don't think so, Homer. *I'm* the \n                         lucky one.\n\n               Homer shakes his head. Wally stops walking; they both stop.\n\n                                     WALLY\n                              (more serious)\n                         You want to fight about it?\n\n               Homer is unfamiliar with this kind of kidding around; at \n               first he is startled, but then he laughs. Wally laughs, too. \n               They shake hands.\n\n               Mr. Rose calls out to Homer from the tractor. The pickers \n               are impatiently waiting for him on the flatbed; they're going \n               back to the orchard. Homer has to run to catch up to them. \n               He jumps on the flatbed; he sees Wally waving good-bye.\n\n               EXT. ORCHARDS - DAY\n\n               High up in a tall tree on a couple of ladders, Mr. Rose and \n               Homer are picking side by side. Mr. Rose is picking with \n               high-speed perfection, but Homer is slower and fumbling--he \n               drops an occasional apple to the ground.\n\n                                     MR. ROSE\n                         You pickin' more cider apples then \n                         anythin' else. Them drops is good \n                         only for cider. And you pickin' the \n                         stems with the apples only half the \n                         time. They good only for cider, too--\n                         if you don't pick them stems.\n                              (Homer watches him)\n                         The rule is, you wanna pick the apple \n                         *with* the stem, Homer. And see \n                         here... see that *bud* that's just \n                         above the stem? That's the bud for \n                         *next year's* apple--that's called \n                         the *spur*. You pick the spur, you \n                         pickin' two years in one--you pickin' \n                         next year's apple 'fore it have a \n                         chance to grow. You leave that on \n                         the branch, you hear?\n\n               Homer nods; he picks more carefully, with more concentration.\n\n                                     MR. ROSE\n                              (approvingly)\n                         That's better. I can tell you got \n                         yourself some education. Them's good \n                         hands you got, Homer. Them hands you \n                         got, they know what they're doin'--\n                         ain't that right?\n\n                                     HOMER\n                         I guess so...\n\n               Homer can see over the apple mart parking lot from the top \n               of the tree. He can see the driveway of the Worthington house, \n               where Candy and Olive are saying a tearful good-bye to Wally. \n               Distracted, Homer drops another couple of apples, which Mr. \n               Rose observes with a wry smile.\n\n                                     ANGELA (O.S.)\n                         Wilbur! Wilbur!\n\n               INT. LARCH'S OFFICE - DAY\n\n               Larch is doing something at his desk when Angela comes in.\n\n                                     ANGELA\n                         Wilbur, you should read this.\n\n               Larch stares at Angela, who holds a letter.\n\n                                     ANGELA\n                         It's from the Board. Another letter.\n\n               INT. LARCH'S OFFICE - NIGHT\n\n               Dr. Larch stands in front of a mechanical drawing easel. He \n               works intently with a calligraphic pen, but we don't see \n               what he's working on. Angela and Edna sit at the desk; they're \n               looking over the letter.\n\n                                     ANGELA\n                              (quoting the letter)\n                         Uh... \"merely suggesting that some \n                         new blood might benefit you all... \n                         someone with new ideas in the \n                         obstetrical and pediatric fields.\"\n                              (she looks up at Larch)\n                         I think they're just testing some \n                         ideas for our next meeting.\n\n                                     EDNA\n                         Dr. Holtz seems nice. I think he \n                         only wants to help...\n\n                                     LARCH\n                         He is a goddamn psychiatrist--of \n                         *course* he wants to \"help\"! He'd be \n                         happy if he could help *commit* me!\n\n                                     ANGELA\n                         It's that Mrs. Goodhall you have to \n                         be careful of, Wilbur.\n\n                                     LARCH\n                         One has to be more than \"careful\" of \n                         Mrs. Goodhall--she has sufficient \n                         Christian zeal to start her own \n                         country! I'd like to give her a little \n                         ether.\n\n                                     EDNA\n                         So what are you going to do?\n\n               Larch puts down the pen, comes around the easel, opens a \n               drawer in a filing cabinet, and hands Edna a folder containing \n               a few cleanly typed pages. Larch returns to the easel, to \n               his painstaking work. Edna opens the file; as she and Angela \n               read the contents, Larch recites from memory as he works.\n\n                                     LARCH\n                         \"Homer Wells, born Portland, Maine, \n                         March 2, 1915...\"\n\n                                     EDNA\n                         Homer was born *here*, in, what was \n                         it, 1922?\n\n                                     LARCH\n                         \"...graduated Bowdoin College, 1935, \n                         and Harvard School of Medicine, 1939.\"\n\n                                     ANGELA\n                         This is *your* life story, Wilbur! \n                         You just changed the dates!\n\n                                     LARCH\n                         \"An internship and two years of \n                         training at the Boston Lying-in, \n                         South End Branch. For his age, he \n                         was judged an accomplished \n                         gynecological obstetrical surgeon; \n                         he is also experienced in pediatric \n                         care...\"\n\n                                     ANGELA\n                         You *invented* him! You've completely \n                         made his up!\n\n                                     LARCH\n                         Don't you understand? The board is \n                         going to *replace* me! That's what \n                         the \"new blood\" is *for*!\n\n                                     EDNA\n                         You mean they'll replace you with \n                         someone who won't perform abortions.\n\n                                     LARCH\n                              (sarcastically)\n                         Well, we can only guess about that, \n                         Edna. They *are* against the law.\n\n                                     ANGELA\n                         These *credentials* are against the \n                         law!\n\n                                     LARCH\n                         We all know who trained Homer--his \n                         credentials are as good as mine are. \n                         Don't you be holy to me about the \n                         *law*! What has the law done for any \n                         of us here?\n\n               Edna and Angela think this over.\n\n                                     LARCH\n                              (points at file)\n                         So here is my candidate. What do you \n                         think?\n\n                                     EDNA\n                         But what about school records? Homer \n                         doesn't have any *diplomas*...\n\n               Larch turns the easel around. Attached is a parchment headed: \n               \"HARVARD MEDICAL SCHOOL\"--it's a diploma-in-progress.\n\n                                     LARCH\n                         He *will* have them, Edna.\n\n               The women are shocked, awed.\n\n                                     ANGELA\n                         Oh, Wilbur, I don't know...\n                              (sudden thought)\n                         We don't even know where he is!\n\n               EXT. CIDER HOUSE, ROOF - NIGHT\n\n                                     ROSE ROSE (O.S.)\n                         Where's that Homer?\n\n               Homer stands in front of a ladder that leans against the \n               cider house; he starts to climb up, drawn by the murmuring \n               voices, the soft laughter.\n\n                                     JACK (O.S.)\n                         Who cares?\n\n                                     MR. ROSE (O.S.)\n                         Now, now. He's a good boy.\n\n                                     JACK (O.S.)\n                         Shit. We don't know what he is.\n\n                                     MR. ROSE (O.S.)\n                         Jack, you gotta watch your language \n                         'round my daughter.\n\n               Homer arrives at the top and sees everyone sitting on a long \n               plank, a bench attached to the apex of the roof--obviously a \n               popular spot.\n\n                                     MR. ROSE\n                         Here he is.\n\n               No one moves.\n\n                                     MR. ROSE\n                         Where's your manners? Make room for \n                         Homer, so's he can enjoy the view.\n\n                                     MUDDY\n                         What view?\n\n               Peaches slides over and Homer sits down.\n\n                                     HOMER\n                         Are we supposed to be up here? The \n                         rules said...\n\n                                     MR. ROSE\n                         Homer, you the only one who's read \n                         them rules, so you the only one who \n                         feels like he's doin' somethin' wrong.\n\n               The others laugh.\n\n                                     MUDDY\n                         *What* view?\n\n                                     MR. ROSE\n                         Well, Muddy, we can look at all these \n                         angry stars Homer's been readin' to \n                         us about.\n\n               More laughter; Homer smiles, enjoying the teasing.\n\n                                     JACK\n                              (gesturing toward the \n                              Worthington farmhouse)\n                         I bet the view looks better from the \n                         Worthin'tons'.\n\n                                     MR. ROSE\n                         You think so, Jack? Well... I wouldn't \n                         want to be in that Wally's shoes \n                         tonight.\n\n                                     ROSE ROSE\n                              (playfully, teasing \n                              him)\n                         Daddy, I'd like to be in that Wally's \n                         shoes *every* night.\n\n                                     MR. ROSE\n                              (teasing her back)\n                         You lucky you in your work boots \n                         tonight, girl...\n\n                                     ROSE ROSE\n                         What's lucky about that?\n\n               Rose Rose is being physically affectionate with her father--\n               lightly punching his arm, rubbing the top of his head.\n\n                                     MR. ROSE\n                         You know where that Wally is tonight, \n                         darlin'? He's up there in them angry \n                         stars.\n                              (gesturing at the \n                              dark sky)\n                         He's flyin' all around up there... \n                         with them Japs shooting at him.\n\n               They all look up, imagining that. Homer more than the others. \n               Rose Rose, looking thoughtful, rests her head on her father's \n               shoulder. They are completely natural together.\n\n               EXT. CAPE KENNETH - APPLE MART - DAY\n\n               Homer and the pickers are loading crates of apples into a \n               shipping truck. Olive and Candy are consulting some papers \n               (the shipping tally) on a clipboard; Mr. Rose is standing \n               beside them.\n\n                                     MR. ROSE\n                         They all on board, Mrs. Worthin'ton.\n\n                                     OLIVE\n                         Thank you, Arthur.\n                              (see is looking at \n                              Homer)\n                         And how is our Homer working out?\n\n               She catches Homer's eye; he smiles, then joins them. Mr. \n               Rose puts his arm around him.\n\n                                     MR. ROSE\n                         Oh, he's a smart young man, most of \n                         the time--Wally was right about him.\n\n               Olive is looking over the rest of the picking crew.\n\n                                     OLIVE\n                         No rotten apples?\n\n                                     MR. ROSE\n                              (it's an old way of \n                              speaking that they \n                              have)\n                         No, no--not this year. Well... maybe \n                         we got *one*, but it ain't Homer.\n\n               He means Jack, who gives Olive and Candy and Mr. Rose a \n               furtive look. Olive smiles at Rose Rose, who comes up to her \n               and Candy. Olive touches Rose Rose with affection.\n\n                                     OLIVE\n                         Rose... dear girl, I'm sure I can \n                         find you some other clothes.\n                              (to Candy)\n                         You must have some things that would \n                         fit her.\n\n               Candy takes Rose Rose by the shoulders and turns her around. \n               Rose Rose is enjoying this.\n\n                                     CANDY\n                         I have a *ton* of things that would \n                         fit you.\n\n                                     MR. ROSE\n                         Now, now, Candy--this girl don't \n                         need no more clothes, not for pickin'.\n\n               He starts leading his daughter away.\n\n                                     OLIVE\n                              (charming)\n                         Arthur, there's no such thing as a \n                         young woman who's got all the clothes \n                         she needs.\n\n               Olive waves good-bye as she moves toward her car. Candy turns \n               to Homer.\n\n                                     CANDY\n                         So. Not bored yet?\n\n                                     HOMER\n                         I'm *never* bored! It's all very... \n                         different for me... here.\n\n               Homer has the hardest time looking at Candy.\n\n                                     HOMER\n                         Uh... have you been *feeling* okay?\n\n                                     CANDY\n                         When I'm not thinking about Wally. \n                         I'm not good at being alone.\n                              (realizing)\n                         Oh, goodness. You meant... yes, I'm \n                         fine. I...\n                              (struggling to change \n                              the subject)\n                         ...I don't suppose you've seen a \n                         lobster yet.\n\n               Homer shakes his head. He looks at the tractor and the empty \n               trailer. Mr. Rose and the pickers are just watching them.\n\n                                     CANDY\n                              (more seriously)\n                         You have to come to my dad's lobster \n                         pound and see one, then.\n\n                                     HOMER\n                         Okay...\n\n               Homer looks toward the pickers sitting on the flatbed when \n               he hears the tractor start. Candy follows his gaze.\n\n                                     HOMER\n                         I better go.\n\n                                     CANDY\n                         I don't think Mr. Rose would leave \n                         without you.\n\n               Mr. Rose gestures for Muddy to drive off; the tractor trailer \n               pulls away.\n\n                                     CANDY\n                              (laughing)\n                         Sorry!\n\n               Homer has to run to catch up.\n\n                                     CANDY\n                              (calling)\n                         Come next week!\n\n               He jumps on the back of the departing flatbed between Mr. \n               Rose and Rose Rose, as Candy watches him.\n\n               INT. BUNKHOUSE - DUSK\n\n               An anxious-looking WHITE PLUMBER is fixing the kitchen sink \n               while the pickers (in their towels) stand around and watch.\n\n               Homer is putting on his best shirt. Peaches admires the shirt \n               as Rose Rose cooks the night's supper on the wood stove.\n\n                                     PEACHES\n                         Whoa--look at that Homer! He's gettin' \n                         all dressed up for supper tonight!\n\n                                     ROSE ROSE\n                         He ain't gettin' dressed to have \n                         supper with *us*, Peaches!\n\n               The pickers all look at Homer, who looks guilty as he leaves.\n\n                                     MR. ROSE\n                              (to the plumber)\n                         Don't let us make you nervous or \n                         nothin'--we know you gotta job to \n                         do.\n\n                                     MUDDY\n                         Yeah, we can wait all night for the \n                         water to come back on--you just go \n                         on and take your time.\n\n               EXT. INLAND ROAD - DUSK\n\n               Homer pedals a bicycle down a dirt road.\n\n               EXT. LOBSTER POUND - DUSK\n\n               Ray holds a lobster up to the camera. We see the old-fashioned \n               wooden pens, floating dockside.\n\n                                     RAY\n                         Hungry?\n\n               Homer looks uncertain.\n\n               EXT. GANGPLANK, DOCK - DUSK\n\n               Homer and Ray and Candy go up the gangplank from the dock to \n               the lobster pound.\n\n                                     RAY\n                         They're the garbage-eaters of the \n                         ocean's floor. The seagulls clean up \n                         the shore. The lobsters clean up the \n                         bottom of the sea.\n\n                                     HOMER\n                         They eat everything?\n\n                                     RAY\n                         Everything that falls to the bottom.\n\n                                     CANDY\n                         It's time somebody ate *them*.\n\n                                     RAY\n                              (to Candy)\n                         I was lookin' for Wally's letter. I \n                         was gonna show it to Homer...\n                              (to Homer)\n                         They made him a captain already--\n                         *Captain* Worthington!\n\n                                     CANDY\n                         Daddy, it's a letter to *me*.\n\n                                     RAY\n                         He mentions Homer, too, you know.\n\n                                     CANDY\n                              (awkwardly)\n                         Wally said to say, \"Hello.\"\n\n                                     HOMER\n                              (equally awkward)\n                         Oh! That's... nice.\n\n                                     RAY\n                              (to Homer)\n                         Wally said the most spectacular hits \n                         were in the oil fields at Yenangyat.\n\n               Later, through the window of the lobster pound, we see them \n               eating lobster around a kitchen table. Laughter and some \n               unclear dialogue drift to us.\n\n               EXT./INT. CAPE KENNETH/WALLY'S CAR - NIGHT\n\n               With the bicycle stowed in the trunk, Candy is driving Homer \n               back to the cider house. They pass a drive-in movie theatre, \n               the marquee announcing \"CLOSED FOR THE SEASON.\" Homer stares \n               in awe at the giant blank screen.\n\n                                     HOMER\n                         A movie *outside*?\n\n                                     CANDY\n                         Yes. But it's closed all the time \n                         now, because of the blackout.\n\n                                     HOMER\n                         People watched the movies in their \n                         cars?\n\n                                     CANDY\n                              (smiling)\n                         When they watched at all. Do you \n                         like movies?\n\n                                     HOMER\n                         Yes! I've only seen one, though.\n\n               Candy looks at him; he isn't joking.\n\n                                     CANDY\n                         You've seen only one movie? Which \n                         one?\n\n                                     HOMER\n                         \"King Kong\". It's really good.\n\n               Candy laughs.\n\n                                     CANDY\n                         I haven't seen \"King Kong\" since I \n                         was a kid!\n\n               Homer laughs a little self-consciously; around her, he feels \n               like he's *still* a kid.\n\n               INT. DINING HALL - EARLY MORNING\n\n               At one table, the children are happily eating apples; a few \n               of the kids are stuffing apples from a big bowl into their \n               pockets. At another table, Larch, Edna, and Angela sit around \n               an open packing crate of apples. Larch takes a bite from an \n               apple and spits it out. Angela takes the apple out of his \n               hand.\n\n                                     ANGELA\n                         That's a pie apple, Wilbur. Homer \n                         said you're not supposed to eat it!\n\n               Angela hands him another apple.\n\n                                     LARCH\n                         So he's an apple expert, is he?\n\n               Angela gives him a critical look as Larch takes a bite out \n               of the new apple.\n\n                                     LARCH\n                              (sarcastically)\n                         Oh my, yes! This is a *far* superior \n                         taste--and crisp, too! You know, so \n                         many apples are disappointingly mealy. \n                         I wonder of most of the apples in my \n                         life weren't meant for pies!\n\n                                     ANGELA\n                         Wilbur, he picked them for us \n                         himself...\n\n                                     LARCH\n                              (incredulous)\n                         You don't find it depressing that \n                         Homer Wells is picking apples?\n\n               Both Edna and Angela glower at him.\n\n                                     LARCH\n                         Or that he can't be bothered to write \n                         us a proper letter? A dissertation \n                         on apples, we don't need!\n\n                                     EDNA\n                              (annoyed)\n                         He probably doesn't make much money \n                         picking apples--he must have had to \n                         pay to send them, too.\n\n                                     LARCH\n                         I wouldn't worry, Edna, that he \n                         doesn't have money. If he gets hungry, \n                         he can pick his dinner!\n\n               Larch angrily tosses the half-eaten apple into the garbage.\n\n                                     EDNA\n                         Wilbur, it's a *gift*! How can you \n                         be angry with Homer for sending us a \n                         *gift*?\n\n               Larch stares into space, depressed. Then he examines the \n               crate and finds the mailing label that says \"OCEAN VIEW \n               ORCHARDS--CAPE KENNETH, MAINE.\" He rips it off, holds it up \n               triumphantly.\n\n                                     LARCH\n                         I'll show him a *gift*! I'll give \n                         him a gift he can *use*!\n\n               Larch storms out of the room.\n\n               INT. CAPE KENNETH - MOVIE THEATRE - NIGHT\n\n               A newsreel from the war is playing on the screen--soldiers \n               marching, smiling, waving to the camera. Homer and Candy sit \n               together watching. Homer is completely fascinated; Candy \n               watches Homer as much as the news. Her expression changes \n               when the newsreel cuts to footage from an air raid.\n\n               EXT. CAPE KENNETH - MOVIE THEATRE - NIGHT\n\n               Candy and Homer walk out of the theatre, under the marquee \n               and past the poster for \"Wuthering Heights.\"\n\n                                     CANDY\n                              (disappointed)\n                         But you looked as if you liked it.\n\n                                     HOMER\n                              (smiling)\n                         I *did* like it. All I said was, \n                         \"It's not 'King Kong'.\"\n\n               Candy makes a face, but in good fun.\n\n                                     HOMER\n                         First she loved him, then she didn't, \n                         then no one else could have him...\n\n                                     CANDY\n                         She *did* love him!\n                              (teasing him)\n                         How many women have you known?\n\n               Homer is embarrassed; he ducks the question.\n\n                                     HOMER\n                         And what did she die of, exactly?\n\n                                     CANDY\n                         She was torn apart! She died of a \n                         broken heart.\n\n                                     HOMER\n                         Oh, sure!\n\n               Homer smiles and shakes his head; Candy starts to laugh.\n\n                                     HOMER\n                         What's the *medical* explanation?\n\n                                     CANDY\n                         Well, she was in a weakened \n                         condition...\n                              (laughs)\n                         I don't know! What about \"King Kong\"?! \n                         Is that medically possible?\n\n               Homer smiles; he knows she's teasing him, and he likes it.\n\n                                     HOMER\n                              (mock serious)\n                         At least King Kong knew what he \n                         *wanted*.\n\n               Candy pushes him playfully. They're both having a good time, \n               *too* good a time.\n\n               EXT. ORCHARDS - DAY\n\n               Homer is picking apples in a big tree; Rose Rose is on a \n               ladder in the tree right beside him. She's picking about \n               twice as fast as he is, and he keeps dropping his apples. In \n               another tree, Muddy is watching.\n\n                                     ROSE ROSE\n                         What is you *doin'* with that Candy, \n                         Homer?\n\n                                     MUDDY\n                              (imitating Mr. Rose)\n                         He's makin' history, I suppose.\n\n               From the surrounding trees, the other pickers laugh.\n\n                                     ROSE ROSE\n                         You ain't gettin' in no trouble, I \n                         hope.\n\n                                     HOMER\n                         No trouble.\n\n               In adjacent trees, both Peaches and Hero are picking apples; \n               they can hear Homer and Rose Rose, too. (So can Mr. Rose.)\n\n                                     PEACHES\n                         That Candy--she's the nicest girl I \n                         know!\n\n                                     MUDDY\n                         She's about the most beautiful girl \n                         I ever seen--I don't know if she's \n                         the nicest.\n\n                                     HOMER\n                         She's the nicest *and* the most \n                         beautiful girl I've ever known.\n\n               The men *oooh* and *aaah* at Homer's announcement--Mr. Rose, \n               too.\n\n                                     ROSE ROSE\n                         That sounds like you is in trouble \n                         already, Homer.\n\n                                     MR. ROSE\n                         That's right--that sounds like trouble \n                         to me.\n\n                                     HOMER\n                         I'm not in trouble.\n\n                                     ROSE ROSE\n                         Yeah, you is. I know when people is \n                         in trouble, and you is.\n\n               Camera closes on Homer's face; he keeps picking.\n\n                                     LARCH (O.S.)\n                         His name is Homer Wells...\n\n               INT. ST. CLOUD'S - DINING HALL - EVENING\n\n               Edna and Angela face the Board of Trustees around a table. \n               Larch circles the table as everyone reads the contents of a \n               folder. Larch has provided a copy for each member. The three \n               elderly gentlemen on the Board don't speak; they just nod \n               their heads to everything Dr. Holtz or Mrs. Goodhall says.\n\n                                     LARCH\n                         ...and his *pathetic* resume is the \n                         best I've seen. Though I find it \n                         hard to believe the Board would be \n                         interested in this character.\n\n                                     DR. HOLTZ\n                         But he looks like an excellent young \n                         man, a first-rate candidate!\n\n                                     LARCH\n                         He looks like a bleeding-heart \n                         missionary *moron* to me, but that's \n                         going to be the problem with any \n                         doctor interested in coming here!\n\n                                     MRS. GOODHALL\n                         Do you know him?\n\n                                     LARCH\n                         *No*! I don't want to know him! He's \n                         doing *missionary* work--in *India*! \n                         I wrote him *weeks* ago, but he's \n                         either too holy or too busy to answer. \n                         Maybe he got killed in the war!\n\n               Suddenly Steerforth bursts through the door, having been \n               pushed from behind by Mary Agnes. The two stop when they see \n               what's going on--not to mention Larch's stern expression. \n               They back out. Mary Agnes winking at Dr. Holtz before the \n               door closes. Mrs. Goodhall is ready to continue.\n\n                                     MRS. GOODHALL\n                         I fail to see how someone courageous \n                         enough to make a commitment to a \n                         foreign mission is automatically to \n                         be dismissed--that part of the world \n                         requires precisely the kind of \n                         dedication that is needed here.\n\n                                     LARCH\n                         Does it *snow* in Bombay? One winter \n                         here and we'll be shipping him south, \n                         in a *coffin*!\n\n                                     MRS. GOODHALL\n                         You can't think that a man who has \n                         *served* under such conditions as \n                         exist over there will be in the \n                         slightest daunted by a little *snow*--\n                         have you no idea how harsh and \n                         primitive and full of *disease* that \n                         part of the world is?\n\n                                     LARCH\n                         Then I suppose we can look forward \n                         to catching various diseases from \n                         him!\n\n                                     DR. HOLTZ\n                         But, Dr. Larch, he seems exceptionally \n                         qualified...\n\n                                     LARCH\n                         I'm not talking about his medical \n                         qualifications. It's the *Christian* \n                         thing that bothers me--I just don't \n                         see it being of much *use* around \n                         here.\n\n                                     MRS. GOODHALL\n                              (bitterly)\n                         I fail to see how a little \n                         Christianity could *hurt* anyone \n                         here!\n\n                                     LARCH\n                         Anyway, I was just showing you this \n                         guy as an example of what's available--\n                         I didn't think you'd be interested.\n\n                                     DR. HOLTZ\n                         We're *very* interested!\n\n                                     MRS. GOODHALL\n                         Yes, *very*!\n\n                                     DR. HOLTZ\n                         You wouldn't be opposed to meeting \n                         with him?\n\n                                     LARCH\n                         I suppose it wouldn't hurt to *meet* \n                         him. What's his name again?\n\n                                     ANGELA\n                         Dr. Homer Wells.\n\n                                     LARCH\n                              (mumbling)\n                         I just hope he won't expect us to \n                         say *Grace* all the time.\n\n               The three elderly gentlemen repeat the name.\n\n                                     MRS. GOODHALL\n                         It's a nice name, very New England.\n\n                                     DR. HOLTZ\n                         Very *Maine*, a very *local*-sounding \n                         name.\n\n                                     EDNA\n                         *Very*!\n\n               INT. DISPENSARY - NIGHT\n\n               A song plays on the old phonograph as a happy Larch and Angela \n               dance. Edna interrupts them.\n\n                                     EDNA\n                         I just wanted to ask you...\n\n                                     LARCH\n                         Edna! Come dance with me! Let's be \n                         foolish tonight.\n\n                                     EDNA\n                         Does he *know* he's supposed to be \n                         in India? Does he even *want* to \n                         come back?\n\n               This causes Larch to take the needle off the record.\n\n                                     LARCH\n                              (angrily)\n                         He's a field hand! What could possibly \n                         hold him there?\n\n               EXT. CIDER HOUSE - RAINY DAY\n\n               The rain beats down on Olive's car. Homer gets soaking wet \n               as he leans in to talk to Candy, who's behind the wheel. Mr. \n               Rose calls to Homer from the doorway of the mill room.\n\n               INT. MILL ROOM - RAINY DAY\n\n               Mr. Rose is instructing Homer as they stand bottling cider \n               in their yellow slickers and rubber boots. Rose Rose is hosing \n               down the pressboards; Muddy and Hero and Peaches are operating \n               the grinder and the press. Jack is stirring the vat. In a \n               defiant, contemptuous way, Jack keeps flicking the ash of \n               his cigarette into the vat. This make everyone uncomfortable; \n               only Mr. Rose doesn't appear to notice.\n\n                                     MR. ROSE\n                         Cider don't have no taste till later \n                         in October--it's too watery now, \n                         when we're usin' just them early \n                         Macs and them Gravensteins. You don't \n                         get no *good* cider till you're \n                         pickin' them Golden Delicious and \n                         them Winter Bananas, them Baldwins \n                         and them Russerts...\n\n                                     HOMER\n                         What about the worms? Most of these \n                         apples are the drops--off the ground, \n                         right? There have to be worms.\n\n                                     MR. ROSE\n                         Of *course* there's worms, Homer! \n                         And what is them worms, really? They \n                         just *protein*, them worms! They is \n                         *good* for you!\n\n               Everyone but Jack laughs. He takes a last drag on his \n               cigarette, then deliberately drops it into the vat.\n\n                                     MR. ROSE\n                         That just ain't right, Jack--your \n                         cigarette's gonna end up in nine or \n                         ten gallons of this batch of cider! \n                         That ain't right.\n\n                                     JACK\n                         Them people drinkin' that cider, \n                         they don't know there's a cigarette \n                         in there!\n\n                                     MR. ROSE\n                         It's not that hard to find it in \n                         there, Jack--it'll take you just a \n                         minute. You just gotta go fishin'.\n\n                                     JACK\n                         You mean *swimmin'*. I ain't goin' \n                         in that vat to fish out no cigarette!\n\n                                     MR. ROSE\n                         What business is you in, Jack? Just \n                         tell me what your business is...\n\n               Jack looks for a translation from the other men, who are \n               nervous.\n\n                                     MUDDY\n                         Just say you're in the *apple* \n                         business, man. That's the only \n                         business you wanna be in. Just say \n                         it.\n\n               Jack pulls a knife on Mr. Rose.\n\n                                     PEACHES\n                              (whispers excitedly \n                              to Jack)\n                         You don't wanna go in the knife \n                         business with Mistuh Rose--just say \n                         you're in the *apple* business, Jack!\n\n                                     JACK\n                              (to Mr. Rose)\n                         What business are *you* in?\n\n               We never see Mr. Rose's knife. We see the men circle each \n               other: Jack takes a swipe at Mr. Rose's head--then he steps \n               back, his yellow slicker slashed open. His slicker is opened \n               up, right up the middle. His shirt underneath the slicker is \n               slashed open, too--he feels his bare chest and stomach, \n               feeling for the cut. But there's no cut--Jack's not bleeding, \n               he's not even scratched. Just his clothes have been slashed.\n\n                                     MR. ROSE\n                         I'm in the *knife* business, Jack. \n                         You don't wanna go in the knife \n                         business with me.\n\n               Muddy turns Jack around and views his slashed clothes.\n\n                                     MUDDY\n                         You're lucky he didn't cut your \n                         *nipples* off, man.\n\n                                     PEACHES\n                         The good news, Jack, is you're half-\n                         undressed for *swimmin'*...\n\n                                     MUDDY\n                         Yeah, that cigarette ain't hard to \n                         find when you're properly undressed.\n\n               Jack starts to undress for the vat.\n\n               Mr. Rose ushers Homer and Rose Rose outside.\n\n               INT. BUNKHOUSE - RAINY DAY\n\n               Mr. Rose has cut his own hand in the fight. Homer's \n               professionalism if offended to watch Rose Rose's amateurish \n               efforts to stitch up her father's wound, but clearly this \n               isn't the first time she's done it.\n\n                                     HOMER\n                         Give men that. I know how to do it.\n\n                                     ROSE ROSE\n                         Oh, I suppose you is a doctor, Homer?\n\n                                     HOMER\n                         Almost.\n\n                                     MR. ROSE\n                         I don't need no \"almost\" a doctor, \n                         Homer.\n\n               Homer can't bear to watch Rose Rose at work with the needle.\n\n                                     ROSE ROSE\n                         We should drown that damn Jack in \n                         the vat!\n\n                                     MR. ROSE\n                         Now, now, darlin'... Jack just needs \n                         to know what business he's in.\n\n                                     ROSE ROSE\n                         Yeah, you really showed him, Daddy--\n                         you just about cut your own hand \n                         off, and all you cut off *him* was \n                         his clothes!\n\n                                     MR. ROSE\n                         You oughta know you don't go to jail \n                         for cuttin' a guy's *clothes*. Ain't \n                         that right, Homer?\n\n               Homer winces at the stitching.\n\n               INT. WALLY'S CAR - DRIVE-IN THEATRE - EARLY EVENING\n\n               Wally's car comes bouncing along the ditches of the closed \n               drive-in. Homer is at the wheel; Candy calls out some driving \n               instructions. The car comes to a stop next to a speakerpost. \n               Candy leans out; she grabs the speaker and hangs it on the \n               window. Homer sits back and drapes his arms out the window \n               and over the seat. He feels great.\n\n                                     CANDY\n                         You're a natural. You were born to \n                         drive a car like this.\n\n                                     HOMER\n                         You think? Maybe I was.\n                              (looks around)\n                         I love this place!\n\n               Homer looks up at the giant movie screen.\n\n                                     HOMER\n                         The screen is enormous! Imagine King \n                         Kong up *there*! Have you seen a lot \n                         of movies here?\n\n                                     CANDY\n                         Yes... and no. When you come here, \n                         you don't really care about the movie.\n\n               Homer stares at Candy in disbelief.\n\n                                     HOMER\n                         You don't care about the movie?\n\n               Candy looks at him for a moment.\n\n                                     CANDY\n                         What are you so crazy about the movies \n                         for?\n\n                                     HOMER\n                         It was my favorite night at the \n                         orphanage--movie night. We'd race \n                         into the dining hall. Of course \n                         everyone wanted to sit in front, so \n                         we'd be packed in so tight you could \n                         feel the kid next to you breathing.\n\n                                     CANDY\n                         At least you were never lonely.\n\n                                     HOMER\n                         I didn't say that. Growing up in an \n                         orphanage, you're always lonely. \n                         You're just never alone.\n\n               Candy is moved. Homer feels exposed; he tries to change the \n               mood by making light of what he's said.\n\n                                     HOMER\n                         You're not alone in the bathroom, \n                         or... or in the shower... you're \n                         never alone in wanting the last piece \n                         of meatloaaf, or even in your own \n                         bed on a cold morning.\n\n               Candy laughs.\n\n                                     CANDY\n                         You don't miss it?\n\n                                     HOMER\n                         I miss things. I miss... people.\n                              (with certainty)\n                         I miss reading to the boys.\n\n                                     CANDY\n                         But you had so much *responsibility*.\n\n                                     HOMER\n                         I never *asked* for any \n                         responsibility.\n\n                                     CANDY\n                         Just a little privacy.\n\n               Homer laughs.\n\n                                     CANDY\n                         Privacy is exactly the point of drive-\n                         in movies.\n\n                                     HOMER\n                         Did you come here with Wally--to \n                         *not* watch movies?\n\n               At the mention of Wally they both look a little self-\n               conscious.\n\n                                     CANDY\n                         Sometimes... movies mostly bore Wally.\n\n                                     HOMER\n                         Ah-ha.\n                              (points to the speaker)\n                         So what is that--a radio?\n\n                                     CANDY\n                         The *speaker*. For the movie sound.\n\n               Candy looks at Homer.\n\n                                     CANDY\n                         Scrunch down like this.\n\n               Candy scrunches down in her seat; Homer imitates her. Homer \n               is focused on the giant screen.\n\n                                     HOMER\n                         How could you not *care* about the \n                         movie?\n\n                                     CANDY\n                         You just cuddle. You come to hug... \n                         to kiss. You don't *come* here to \n                         watch the movie.\n\n                                     HOMER\n                              (teasing her)\n                         That's what *I'd* come here for. I'd \n                         watch the movie.\n\n                                     CANDY\n                         Not with the right girl you wouldn't.\n\n               Homer's expression changes from exhilarated to guilty. He \n               leans back in his seat and looks straight ahead at the screen. \n               Candy tentatively leans her head on his shoulder. Homer looks \n               afraid to breathe.\n\n               From behind, with her head on his shoulder, they look like a \n               normal couple. We track in toward the huge screen until we \n               see only the screen. There are shadows on the black screen. \n               Suddenly the movie \"King Kong\" appears.\n\n               INT. DINING HALL - NIGHT\n\n               \"King Kong\" is playing against the bare, white wall. Fuzzy \n               is very weak, but he smiles at the sight of the love-struck \n               Kong holding the screaming Fay Wray in his giant hand. Dr. \n               Larch runs the projector; he sits close beside Fuzzy. When \n               the film breaks in the predictable place, Fuzzy makes no \n               protest. Dr. Larch looks at Fuzzy, who has stopped breathing; \n               his eyes are closed.\n\n                                     LARCH\n                         Fuzzy? Fuzzy?\n\n               They are alone in the dining hall. Larch has wheeled in Fuzzy \n               for a private viewing.\n\n               EXT. ST. CLOUD'S - GRAVEYARD - MORNING\n\n               Buster helps Larch lower the small coffin into the grave. \n               The tiny gravestone says \"F.S.\"\n\n                                     BUSTER\n                         What are you going to tell the little \n                         ones?\n\n                                     LARCH\n                         I'll tell them Fuzzy was adopted.\n\n                                     BUSTER\n                         Why would the little ones believe \n                         that *anyone* would adopt him?\n\n                                     LARCH\n                         They'll believe it because they want \n                         to believe it.\n\n                                     BUSTER\n                         Shouldn't we tell Homer?\n\n                                     LARCH\n                         If Homer wanted to know what was \n                         happening here, he could pick up a \n                         telephone and call us.\n\n               INT. BOYS' DIVISION - NIGHT\n\n               The boys in their beds listen to Buster inventing Fuzzy's \n               \"family.\"\n\n                                     BUSTER\n                         It was a family with a better \n                         breathing machine then the one Dr. \n                         Larch built.\n\n               INT. ST. CLOUD'S - CORRIDOR - NIGHT\n\n               Larch leans against the wall, covering his eyes, overhearing \n               the boys.\n\n                                     BUSTER (O.S.)\n                         The family that adopted Fuzzy, they \n                         *invented* the breathing machine. \n                         It's their business... breathing \n                         machines.\n\n               Larch pauses; he waits to see if they believe this.\n\n                                     CURLY (O.S.)\n                         Lucky Fuzzy!\n\n               Larch almost breaks with a sudden sharp breath.\n\n                                     ALL THE BOYS (O.S.)\n                         Good night, Fuzzy! Good night, Fuzzy! \n                         Good night, Fuzzy Stone!\n\n               EXT. CIDER HOUSE - MORNING\n\n               As the men sit at the picnic table eating their cornbread, \n               Rose Rose pours coffee. A jeep comes down the orchard road \n               toward them. It's Olive. Mr. Rose leads the \"Good mornin', \n               Mrs. Worthin'ton!\" greeting. Olive has an armful of clothing \n               and a fairly sizable package; she brings the latter over to \n               Homer.\n\n                                     OLIVE\n                         Some mail for you, Homer.\n\n               Homer shakes the package; he puts the package beside the \n               table, unopened. Olive turns to Rose Rose.\n\n                                     OLIVE\n                         And some clothes for you, dear--\n                              (nodding to the cider \n                              house)\n                         let's go see if they fit.\n\n               Mr. Rose watches Rose Rose and Olive disappear into the cider \n               house. The other men view Homer's package with curiosity, \n               especially Peaches.\n\n                                     PEACHES\n                         Ain't you gonna see what it is, Homer?\n\n                                     MR. ROSE\n                         Mind your own business, Peaches.\n\n                                     PEACHES\n                         Sorry, Homer...\n\n               INT. BUNKHOUSE - LATE AT NIGHT\n\n               Homer lies awake in bed; everyone else is asleep. Homer pulls \n               the package out from under his bed, opening it just enough \n               to see what it is; then he shoves it back under his bed.\n\n               EXT. OCEAN/BEACH - DUSK\n\n               The beach at sunset. Candy and Homer, dressed for cooler \n               weather, are alone at the water's edge. From a paper bag, \n               Candy is scattering some small, brightly colored pieces of \n               broken glass.\n\n                                     HOMER\n                         Aren't you worried that people will \n                         cut their feet?\n\n                                     CANDY\n                         Nobody will swim here until next \n                         summer. By then, the water will have \n                         rubbed the glass smooth against the \n                         sand--there won't be any sharp edges.\n\n               She finds and old piece of glass among the stones and shells \n               at the high-tide mark.\n\n                                     CANDY\n                         See? That's last year's glass, or \n                         from some year before. I put glass \n                         here every year. The ocean makes it \n                         beautiful.\n\n               Candy holds up a piece of glass to the sun for Homer to look \n               at. The ocean is a gray-green color, the glass a paler shade \n               of green.\n\n                                     CANDY\n                         Give me your hand.\n\n               She rubs the smooth piece of glass against his hand, then \n               throws it toward the water. It falls short. Homer retrieves \n               it. Candy splashes him playfully. He chases her away from \n               the beach, into the pine trees. Homer locks his arms around \n               her, from behind. He can't let go. She lets him hold her, \n               then breaks his grip. She turns to face him. She is taller \n               then he is, older, obviously more experienced. She initiates \n               the kiss. They drop to the ground right there; they make \n               love by the roots of the tree, Candy guiding him.\n\n               EXT. WALLY'S CAR - BEACH PARKING LOT - NIGHT\n\n               They come out of the woods, walking toward the car, Candy \n               leading. We hear Candy talking just before we see her and \n               Homer.\n\n                                     CANDY\n                              (increasingly upset)\n                         *Nobody* volunteers for the Burma \n                         run--he said so himself. And nobody \n                         knows *me* better than him! So how \n                         am I supposed to feel? He's a bomber \n                         pilot and I'm just selfish, I know. \n                         Well, I'm *not* a brave little girl \n                         and I'm *not* sorry.\n\n               She sits in the passenger seat, Homer in the driver's seat.\n\n                                     CANDY\n                         I *know* this was right.\n                              (pause)\n                         I told you. I'm not good at being \n                         alone.\n                              (pause; in a whisper)\n                         I told him, too.\n\n               Homer concentrates on starting the car.\n\n                                     CANDY\n                              (repeating herself)\n                         I *know* this was right.\n\n                                     HOMER\n                         Right.\n\n               Their expressions, as the car pulls away, belie their words.\n\n               EXT. CIDER HOUSE - END OF DAY\n\n               Homer and Mr. Rose sit opposite each other at the picnic \n               table. Rose Rose stands behind her father, her hands on his \n               shoulders, watching Homer snip out Mr. Rose's stitches--very \n               quickly.\n\n                                     MR. ROSE\n                         Slow down, Homer--don't be in such a \n                         big hurry.\n\n                                     HOMER\n                         This is easy--I'm not hurrying.\n\n                                     MR. ROSE\n                         You still doin' it too fast!\n\n               Job done, Homer leaves the table and hurries to the bicycle, \n               pedaling away. Rose Rose watches Homer go, as Mr. Rose flexes \n               his healed hand.\n\n                                     ROSE ROSE\n                         He's in a big hurry, all right. I \n                         told you he's in trouble.\n\n               EXT. CAPE KENNETH - LOBSTER POUND - EVENING\n\n               Candy and Homer sit on the dock. Candy still seems to be \n               wrestling with her conscience. Homer throws snails in the \n               sea. It's cold.\n\n                                     HOMER\n                         Just tell me. Do you want me to go? \n                         Do you want me to stay?\n\n                                     CANDY\n                         It will be okay.\n\n                                     HOMER\n                         *What* will be okay?\n\n                                     CANDY\n                         We have to wait and see. I think \n                         that, for *everything* in life, you \n                         have to wait and see.\n\n               Homer throws a snail with more force.\n\n                                     HOMER\n                         I'll just move on, get another job \n                         somewhere.\n\n               Ray comes out onto the dock; he sees Homer throwing another \n               snail.\n\n                                     RAY\n                         Every time you throw a snail off the \n                         dock, you're makin' someone start \n                         his whole life over.\n\n               Candy throws a handful of snails into the water.\n\n                                     CANDY\n                         Maybe we're doing the snails a favor, \n                         Daddy.\n\n               Ray looks at the two of them; he sighs.\n\n                                     RAY\n                         It's gettin' late. I think I'll pack \n                         it in.\n\n                                     CANDY\n                         Good night, Daddy.\n\n               Ray nods good night; he leaves. Homer looks expectantly at \n               Candy.\n\n                                     CANDY\n                         We'll just have to wait and see.\n\n               INT. WORTHINGTON HOUSE, DINING ROOM - NIGHT\n\n               Olive and Homer sit at the dining-room table, the remnants \n               of an apple pie in front of them. Homer is still eating. \n               Pictures of Wally are on the wall.\n\n                                     OLIVE\n                         I used to hate it when Wally went \n                         back to college--even when it was \n                         just college! And this was when his \n                         father was still alive... I hated it \n                         even then. Naturally I hate this \n                         more.\n\n               Homer nods in sympathy. His mouth is stuffed with apple pie.\n\n                                     OLIVE\n                         What I mean is... I would like it \n                         very much if you thought you could \n                         be happy here, Homer.\n\n                                     HOMER\n                              (wiping his mouth)\n                         Mrs. Worthington, I feel I'm very \n                         lucky to be here.\n\n                                     OLIVE\n                         There's not a lot of work in the \n                         winter, and you'll have to tolerate \n                         Vernon--even Wally despises him, and \n                         Wally likes everyone.\n\n               Olive's thoughts drift; her eyes look up at a photo of Wally.\n\n                                     HOMER\n                         I think Wally will be fine, Mrs. \n                         Worthington--he seems indestructible \n                         to me.\n\n                                     OLIVE\n                              (distracted)\n                         I don't know.\n                              (intently at Homer)\n                         Just promise me one thing.\n\n               Homer is tense. Does Olive suspect about Candy?\n\n                                     HOMER\n                         Uh... sure.\n\n                                     OLIVE\n                         Just promise me that, if there's a \n                         blizzard, you'll move into Wally's \n                         room until it's over.\n\n               They both laugh, but Homer has a hard time looking her in \n               the eye.\n\n               EXT. CIDER HOUSE - DAY\n\n               The pickers are moving out; the harvest is over. Olive and \n               Homer stand near the door to the bunkhouse, talking--we can't \n               hear their conversation. Rose Rose and the other men walk \n               past them, carrying the last of their belongings to the truck. \n               Olive and Homer walk over to the truck.\n\n                                     OLIVE\n                         Good-bye. Have a safe trip home. \n                         Thank you, again, for all your hard \n                         work.\n\n                                     MR. ROSE\n                         You take care now, Mrs. Worthin'ton.\n\n               They shake hands.\n\n                                     OLIVE\n                         Good-bye, Arthur.\n                              (she hugs Rose Rose)\n                         Homer, I'll see you tomorrow?\n\n                                     HOMER\n                         Right.\n\n               Olive gets in her Jeep and waves as she drives off.\n\n               The truck is packed. Muddy tugs on a rope that secures the \n               load.\n\n                                     MUDDY\n                              (to Mr. Rose)\n                         We all set, I think.\n\n               Mr. Rose nods and gets in behind the wheel. Rose Rose and \n               Muddy get in next to him. The others are bundled up for the \n               ride in the open back of the truck.\n\n               As they're leaving, Homer waves good-bye--the pickers calling \n               out to him.\n\n                                     MR. ROSE\n                         You all take care of yourself, too, \n                         Homer!\n\n                                     PEACHES\n                         We see you next harvest.\n\n                                     MUDDY\n                         Don't freeze to death, Homer.\n\n                                     JACK\n                         Go on and freeze to death if you \n                         want to, Homer.\n\n                                     MR. ROSE\n                         Now, now, Jack--that just ain't right.\n\n                                     ROSE ROSE\n                         You just stay out of trouble, Homer!\n\n               Homer stands looking after them, after they're gone.\n\n               INT. BUNKHOUSE - LATER THAT SAME DAY\n\n               Homer is alone, rearranging his stuff--spreading out a bit, \n               making the place his own. (On the other beds, we see the \n               mattresses rolled up on the bare bedsprings.)\n\n                                     CANDY (O.S.)\n                         So, you're staying.\n\n               Homer turns; he hadn't seen Candy come in.\n\n                                     CANDY\n                         Olive told me.\n                              (awkward pause)\n                         You might have told me yourself.\n\n                                     HOMER\n                         I'm just waiting and seeing. Like \n                         you said.\n\n               She smiles. He goes to her; they embrace.\n\n               BEGINNING A MONTAGE OF THE NEXT NINE OR TEN MONTHS.\n\n               EXT. CIDER HOUSE ROOF - MORNING\n\n               Homer, drinking coffee, is writing a letter on a note pad.\n\n                                     HOMER (V.O.)\n                         Dear Dr. Larch, thank you for your \n                         doctor's bag...\n\n               EXT. RAY'S LOBSTER BOAT - DAY\n\n               Homer is learning how to \"haul\" a lobster pot with Ray and \n               Candy's guidance.\n\n                                     HOMER (V.O.)\n                         ...although it seems that I will not \n                         have the occasion to use it.\n\n               EXT. LOBSTER POUND, FLOATING PENS - EVENING\n\n               Following Ray's example, Homer is trying to \"disarm\" the \n               lobsters' big claws by blocking them shut with the little \n               wooden wedges. Roy works quickly, never getting pinched. As \n               Candy watches, Homer gets pinched.\n\n                                     HOMER (V.O.)\n                         Barring some emergency, of course. I \n                         am not a doctor. With all due respect \n                         to your profession. I am enjoying my \n                         life here.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Homer and Candy are naked. They have pulled two beds together \n               and made a double bed. He can't take his eyes off her.\n\n                                     HOMER\n                         I've looked at so many women... I \n                         mean, I've seen *everything* about \n                         them, *everything*... but I never \n                         felt a thing. I felt nothing. Now... \n                         with you... it *hurts*... to look at \n                         you.\n\n               INT. DISPENSARY - DAY\n\n               Edna and Angela and Larch are all reading Homer's letter, \n               their lips moving silently as they read the words.\n\n                                     HOMER (V.O.)\n                         I am enjoying being a lobsterman and \n                         an orchardman--in fact, I have never \n                         enjoyed myself so much.\n\n               INT. WORTHINGTON HOUSE, FIREPLACE - NIGHT\n\n               Olive and Homer and Candy are playing a board game around \n               the fireplace.\n\n                                     HOMER (V.O.)\n                         The truth is, I want to stay here. I \n                         believe I am being of *some* use.\n\n               INT. LARCH'S OFFICE - NIGHT\n\n               Edna and Angela view him anxiously from the doorway as Larch \n               furiously types and types.\n\n                                     LARCH (V.O.)\n                         My dear Homer, I thought you were \n                         over your adolescence, that period \n                         which I would define as the first \n                         time in our lives when we imagine we \n                         have something terrible to hide from \n                         those who love us.\n\n               INT. WALLY'S CAR - DAY\n\n               Candy is singing to the car radio, as animated and happy as \n               we've ever seen her. Homer, driving, can scarcely keep his \n               eyes on the road; he has to keep looking at her.\n\n                                     LARCH (V.O.)\n                         Do you think it's not obvious to us \n                         what's happened to you?\n\n               INT. BUNKHOUSE - NIGHT\n\n               With the radio playing (a popular song), Homer hops across \n               the bare floor, pulling on his boxer shorts; he opens the \n               door to Olive, who's holding out an armload of blankets to \n               him. He sheepishly thanks her. When Homer closes the door, \n               we see a hidden (and stricken) Candy, naked from their \n               interrupted lovemaking.\n\n                                     LARCH (V.O.)\n                         You're fallen in love, haven't you? \n                         By the way, whatever you're up to \n                         can't be too good for your heart. \n                         Then again, it's the sort of condition \n                         that can be made worse by worrying \n                         about it. So don't worry about it!\n\n               EXT. ORCHARDS - DAY\n\n               Vernon and Homer are working under an apple tree; they are \n               poisoning mice.\n\n                                     HOMER (V.O.)\n                         Dear Dr. Larch, what I am learning \n                         here may not be as important as what \n                         I learned from you, but everything \n                         is new to me. Yesterday I learned \n                         how to poison mice. You use poison \n                         oats and poison corn.\n\n               INT. DINING HALL - EVENING\n\n               Supper chaos--Buster and Mary Agnes are doing their best to \n               stop a food fight while Larch and Angela and Edna are \n               completely absorbed reading Homer's letter.\n\n                                     HOMER (V.O.)\n                         Field mice girdle an apple tree. \n                         Pine mice kill the roots. I *know* \n                         what you have to do--you have to \n                         play God. Well... killing mice is as \n                         close as I want to come to playing \n                         God.\n\n               INT. MOVIE THEATRE - CAPE KENNETH\n\n               Homer and Candy are watching \"Rebecca\".\n\n                                     LARCH (V.O.)\n                         Do I interfere? When absolutely \n                         helpless women tell me that they \n                         simply *can't* have an abortion, \n                         that they simply *must* go through \n                         with having another--and yet another--\n                         orphan... do I interfere? *Do* I? I \n                         do not. I do not even *recommend*. I \n                         just give them what they want: an \n                         orphan or an abortion.\n                              (close on Homer)\n                         You are my work of art, Homer. \n                         Everything else has been just a job. \n                         I don't know if you've got a work of \n                         art in you, but I know what your job \n                         is. You're a doctor!\n\n               INT. BUNKHOUSE - DAY\n\n               The radio is playing a slow, sexy dance number. The fat ladies \n               from the apple mart are dancing as they paint the interior \n               walls of the bunk house.\n\n                                     HOMER (V.O.)\n                         I am not a doctor.\n\n                                     LARCH (V.O.)\n                         You know everything I know, plus \n                         what you've taught yourself--you're \n                         a better doctor then I am and you \n                         know it!\n\n               Homer is finishing up painting the kitchen walls. When he \n               gets to the list of rules, tacked on the wall, he removes \n               the list and finishes painting under where the rules were.\n\n                                     LARCH (V.O.)\n                         They're going to replace me, Homer! \n                         The Board of Trustees is looking for \n                         my *replacement*!\n\n               Two of the ladies unroll the rolled-up mattresses on the \n               bare bedsprings, as Vernon enters with an armload of blankets \n               and pillows.\n\n                                     HOMER (V.O.)\n                         I can't replace you! I'm sorry...\n\n               Homer holds up the list of rules, rereads it briefly; he \n               walks over to an unpainted beam, a support beam, and tacks \n               the rules on this beam.\n\n               EXT. CIDER HOUSE, ROOF - MORNING\n\n               Homer reads Larch's letter, sipping coffee.\n\n                                     LARCH (V.O.)\n                         Sorry? I'm not 'sorry'! Not for \n                         anything I've done. I'm not even \n                         sorry that I love you!\n\n               INT. DISPENSARY - NIGHT\n\n               Larch sits on his ether-bed with a letter from Homer in his \n               hand. He looks completely deflated. Angela is standing in \n               the doorway.\n\n                                     LARCH\n                         I think we may have lot him to the \n                         world. He's not coming back.\n\n               END OF THE MONTAGE.\n\n               INT. BUNKHOUSE - EARLY EVENING\n\n               In the newly painted, spruced-up cider house, Homer and Candy \n               are dancing to another slow, sexy song on the radio. He is \n               untucking her blouse, feeling under her blouse--she starts \n               to unbutton his shirt. They kiss while they dance. But the \n               song changes abruptly on the radio to something fast and \n               silly.\n\n               Homer responds to the music, dancing goofily--instantly out \n               of the mood. Candy laughs, but she picks up a pillow and \n               swings it at him, hitting him. He dances away from her. She \n               throws the pillow; he ducks--the pillow lands somewhere near \n               the door. Now Homer grabs a pillow and chases her from bed \n               to bed. She shrieks--they're both laughing. They each grab a \n               pillow and stand toe to toe whacking each other, laughing \n               all the while, until he pins her arms behind her and, \n               breathing hard--and despite the stupid music that broke the \n               mood--they are passionately kissing again.\n\n               The sound of a truck is sudden and loud.\n\n               EXT. CIDER HOUSE - DAY\n\n               Mr. Rose's truck has arrived. The pickers are hopping out of \n               the truck, grabbing their gear.\n\n               INT. BUNKHOUSE - DAY\n\n               The door opens. Hero and Peaches barge in, as Homer and Candy \n               are struggling to return the pillows to the beds.\n\n                                     HERO\n                         Who's that?\n\n                                     PEACHES\n                         It's that Homer!\n\n               Muddy is right behind them. He picks up a pillow, off the \n               floor, looking for which bed it belongs on.\n\n                                     MUDDY\n                         It's that Candy, too...\n\n               Then comes Mr. Rose, slyly smiling, taking it all in--there's \n               no hiding what's going on. Homer and Candy are caught, their \n               shirts untucked and half-unbuttoned--they're still out of \n               breath. The pillows lie crazily on the beds, each one of \n               which has been stepped on.\n\n                                     MR. ROSE\n                         Don't this place look like home?\n\n                                     PEACHES\n                         It look nicer then home!\n\n                                     MR. ROSE\n                         What have you two been doin' to make \n                         it look so nice?\n\n               Rose Rose enters. She looks hardened, toughened--not happy. \n               She plops down her stuff on her bed, looking only at Candy.\n\n                                     ROSE ROSE\n                         How is that Wally doing?\n\n                                     CANDY\n                         Oh, he's fine! I just heard from \n                         him. He's bombing all these places...\n\n               Homer tries to help out.\n\n                                     HOMER\n                              (mumbling)\n                         ...bridges, oil refineries, fuel \n                         depots...\n\n               He peters out, knowing how sick of hearing this Candy is. He \n               tries to change the subject.\n\n                                     HOMER\n                         Where's Jack?\n\n               There is an uncomfortable silence.\n\n                                     MUDDY\n                         He just wasn't up for the trip.\n\n               More silence.\n\n                                     MR. ROSE\n                         That Jack just never knew what his \n                         business was.\n\n               One look at Muddy and we know something pretty bad happened \n               to Jack.\n\n               EXT. ORCHARDS - DAY\n\n               The pickers on their ladders, all picking. Homer is now a \n               good picker; he looks over at Rose Rose. She is slumped \n               against the ladder, not picking, completely ignoring an \n               argument beneath them in the aisle between the trees. (Mr. \n               Rose is checking over the apples Peaches has just picked.)\n\n                                     MR. ROSE\n                         You pickin' nothin' but cider apples, \n                         Peaches--I hope you understand that.\n\n                                     PEACHES\n                         They ain't drops--I picked 'em off \n                         the tree!\n\n                                     MR. ROSE\n                         Then you pickin' 'em too fast--they \n                         ain't no better than drops to me. \n                         See that bruise, and that one? *Half* \n                         of these is bruised! Look at this \n                         one! It ain't got no stem! You might \n                         as well *step* on 'em, too--they \n                         only good for cider.\n\n               EXT. ORCHARDS - DUSK\n\n               In the aisle between the trees, Homer and Candy are arguing \n               in one of the work vehicles.\n\n                                     CANDY\n                         Do you think I'm having a good time? \n                         Do you think I'm just *teasing* you? \n                         Do you think I *know* whether I want \n                         you or Wally?\n\n                                     HOMER\n                         So we should \"wait and see.\" For how \n                         long?\n\n                                     CANDY\n                         I grew up with Wally. I began my \n                         adult life with him.\n\n                                     HOMER\n                         Fine. That's all there is to it then.\n\n                                     CANDY\n                         No! That's not all there is to it! I \n                         love you, too--I *know* I do.\n\n                                     HOMER\n                         Okay, okay--I know you do, too.\n\n                                     CANDY\n                              (bitterly)\n                         It's a good thing I didn't have that \n                         baby, isn't it?\n\n               Her sudden hardness leaves him speechless as they go their \n               separate ways. Candy drives on.\n\n               EXT. CIDER HOUSE - SUNNY MORNING\n\n               Breakfast time at the picnic table. Rose Rose by herself, \n               away from the table. She does not look well; she suddenly \n               goes back inside the bunkhouse.\n\n                                     PEACHES\n                              (calling after her)\n                         Ain't you eatin' with us, Rose?\n                              (to the men)\n                         She used to eat with us. Now we ain't \n                         good enough for her, I guess.\n\n                                     HERO\n                         She ain't hungry, maybe.\n\n                                     MUDDY\n                         She ain't hungry every mornin' 'cause \n                         she's sick every mornin'.\n\n               Homer gets up to take his dishes inside.\n\n               INT. KITCHEN AND BUNKHOUSE - MORNING\n\n               When Homer comes in, Rose Rose is throwing up in the sink.\n\n                                     HOMER\n                         You okay, Rose?\n\n                                     ROSE ROSE\n                         I guess you must like watchin' me be \n                         sick...\n\n                                     HOMER\n                         I don't like watching anyone be sick.\n\n               Rose Rose lies down on her bed with the curtain open. There \n               is something familiar about the way Homer approaches her \n               bedside; he does so with the authority of a doctor. He sits \n               on the edge of her bed with such complete self-assurance \n               that she doesn't protest.\n\n                                     HOMER\n                         How many months are you?\n\n               She just stares. But she doesn't stop him when he touches \n               her abdomen. It's as if she knows that he knows what he's \n               doing.\n\n                                     HOMER\n                         You're not yet three months, are \n                         you?\n\n                                     ROSE ROSE\n                         Not yet. What do you know about it?\n\n                                     HOMER\n                         I know more than I want to know about \n                         it. Who's the father?\n\n                                     ROSE ROSE\n                         Don't trouble yourself about it, \n                         Homer--this ain't your business.\n\n                                     HOMER\n                         But you don't look very happy.\n\n                                     ROSE ROSE\n                         *Happy*! What are you thinkin'? How \n                         am I supposed to take care of a baby! \n                         I can't have a baby.\n\n                                     HOMER\n                         Rose, please listen. Whatever you \n                         want to do, I can help you.\n\n               She is taken back.\n\n                                     HOMER\n                         What I mean is, if you don't want \n                         to... keep the baby, I know a place \n                         where you can go.\n\n                                     ROSE ROSE\n                         You think Daddy's gonna let me go \n                         anywhere? I ain't going *nowhere*.\n\n               She rolls over on the bed, facing away from him again.\n\n                                     ROSE ROSE\n                         Why don't you just go back to your \n                         pickin', Homer? I can take care of \n                         it myself!\n\n                                     HOMER\n                         Rose, listen--don't *do* anything. \n                         You know, I mean to yourself. Please \n                         listen...\n\n                                     MR. ROSE (O.S.)\n                              (calling)\n                         Homer! Is this a workin' day or what?\n\n               EXT. LOBSTER POUND - EVENING\n\n               Homer and Candy are sitting at the dock.\n\n                                     CANDY\n                         We should take her to St. Cloud's. \n                         That much is obvious, isn't it? Let \n                         her make up her mind when she gets \n                         there...\n\n                                     HOMER\n                         I told her! She doesn't feel she can \n                         do that. Something about her father \n                         not letting her go anywhere...\n\n                                     CANDY\n                         Well, we have to help her!\n\n               Homer doesn't respond.\n\n                                     CANDY\n                         We have to do *something*. Don't we?\n                              (beat)\n                         Homer?\n\n               Homer looks out over the ocean; he remains unresponsive.\n\n               EXT. CIDER HOUSE - MIDDAY\n\n               Rose Rose is setting the picnic table for lunch when Candy \n               arrives.\n\n                                     CANDY\n                         Hi...\n\n                                     ROSE ROSE\n                         Hi...\n\n               She keeps setting the table.\n\n                                     CANDY\n                         I've got some more clothes for you--\n                         I just keep forgetting to bring them \n                         with me.\n\n                                     ROSE ROSE\n                         I don't need no more clothes, thank \n                         you.\n\n                                     CANDY\n                              (softly)\n                         Rose, I know what's going on. Homer \n                         told me. I got pregnant, too--about \n                         a year ago.\n                              (pause)\n                         I've been through this.\n\n               Rose Rose looks down.\n\n                                     ROSE ROSE\n                         You ain't been through what I been \n                         through, Candy.\n\n                                     CANDY\n                              (doesn't get it)\n                         Yes, I *have*!\n\n               Rose Rose dismissively waves her hand.\n\n                                     CANDY\n                         Who's the father, Rose?\n\n               Rose looks at Candy and shakes her head.\n\n                                     CANDY\n                         You want to have the baby?\n\n               Rose Rose shakes her head again, more emphatically.\n\n                                     CANDY\n                         I know where you can go. Homer and I \n                         can take you...\n\n                                     ROSE ROSE\n                         I can't go nowhere.\n\n                                     CANDY\n                         Why?\n\n               Rose Rose stays silent.\n\n                                     CANDY\n                         Is it the father? Does he know?\n\n               Rose Rose turns away from Candy.\n\n                                     CANDY\n                         You can trust me. Is it Jack? It's \n                         not Jack, is it? It's *Muddy*! Is it \n                         Muddy?\n\n                                     ROSE ROSE\n                              (almost wistfully)\n                         No. It ain't Muddy. Muddy's just...\n\n               Rose Rose stops; she can't even continue setting the table. \n               Her voice turns bitter, despairing.\n\n                                     ROSE ROSE\n                         It sure ain't Jack.\n\n               There, suddenly, is Mr. Rose, walking past them. He is \n               uncharacteristically tentative.\n\n                                     MR. ROSE\n                              (to his daughter)\n                         I'll be up top...\n\n               Mr. Rose leaves Candy and Rose Rose alone again. Rose Rose \n               nods almost invisibly after her father. Rose Rose looks \n               pointedly at Candy, nodding. Candy slowly gets it. Mr. Rose \n               is the father! Rose Rose lets that sink in; she keeps looking \n               at Candy with an ashamed expression.\n\n               EXT. ORCHARD - DAY\n\n               The pickers are at work, on their ladders, when Candy runs \n               down the aisle between two rows of trees. She stops at the \n               bottom of Homer's ladder, out of breath. Muddy and Peaches \n               and Hero, in the treetops, are watching and listening.\n\n                                     CANDY\n                         She won't go to St. Cloud's!\n\n                                     HOMER\n                              (shrugging)\n                         Well, we can't force her. It's her \n                         decision.\n\n                                     CANDY\n                         You don't understand! It's her \n                         father...\n\n                                     HOMER\n                         Mr. Rose *knows*?\n\n                                     CANDY\n                              (shouting)\n                         He's the *father*! He's her baby's \n                         father!\n\n               The pickers can't help but hear this, too. Candy starts to \n               leave, Homer running after her.\n\n                                     HOMER\n                         Wait... *wait*! Are you sure?\n\n                                     CANDY\n                         We've got to keep her away from that \n                         bastard!\n\n               Candy leaves. Homer starts looking for Mr. Rose.\n\n               EXT. ORCHARD, NEAR CIDER HOUSE - MOMENTS LATER\n\n               Smiling his enigmatic smile, Mr. Rose keeps slowly picking \n               while Homer stands at the foot of his ladder.\n\n                                     MR. ROSE\n                         I didn't see where you was pickin' \n                         this mornin', Homer, but you musta \n                         worked up a big appetite. You look \n                         like you're serious about gettin' to \n                         your lunch today!\n\n                                     HOMER\n                         Is it true?\n\n               Mr. Rose stops picking, his eyes darting to see who's around.\n\n                                     HOMER\n                         Are you sleeping with your own \n                         daughter?\n\n               Mr. Rose, with deliberate slowness, comes down the ladder.\n\n                                     MR. ROSE\n                              (slyly; still composed)\n                         I think you been stayin' up too late \n                         at night, Homer.\n\n                                     HOMER\n                         You're actually having sex with your \n                         own little girl? Is that possible?\n\n                                     MR. ROSE\n                         Ain't nobody havin' *sex* with my \n                         little girl, Homer--that's somethin' \n                         a father knows.\n\n                                     HOMER\n                         You're lying. How can you... with \n                         your own daughter!\n\n               Mr. Rose switches from sly to threatening in a split second.\n\n                                     MR. ROSE\n                         Homer, don't you know what business \n                         you in? You don't wanna go into no \n                         business with me, Homer--ain't that \n                         right?\n\n                                     HOMER\n                         Go on, cut my clothes. I've got other \n                         clothes.\n\n               Mr. Rose is indignant.\n\n                                     MR. ROSE\n                         You a fine one to be talkin' about \n                         lies. Shame! These people took you \n                         in. That boy Wally's at *war*!\n\n               That takes some of the steam out of Homer's superiority.\n\n                                     HOMER\n                         But she's your *daughter*...\n\n                                     MR. ROSE\n                         And I *love* her! There ain't nobody \n                         else gonna treat her as good as I \n                         do!\n                              (looks away)\n                         I wouldn't do nothin' to hurt her, \n                         Homer--you must know that.\n\n               Homer turns; he speaks over his shoulder as he walks away.\n\n                                     HOMER\n                         She's *pregnant*. Do you know *that*?\n\n               By his expression--he looks as if he's been punched--it's \n               clear that Mr. Rose didn't *know that*.\n\n               The other pickers are on their way to lunch; it's obvious \n               that Muddy, Peaches, and Hero already know that Mr. Rose is \n               sleeping with his daughter.\n\n               EXT. CIDER HOUSE - PICNIC AREA - LUNCHTIME\n\n               Rose Rose is sitting at the picnic table when the pickers \n               arrive for lunch, almost simultaneously with Homer. He looks \n               at, then looks away from, Rose Rose. Mr. Rose is the last to \n               sit down at the table as a very tense, wordless lunch begins.\n\n               EXT. ORCHARD - DAY\n\n               Homer is on a ladder picking apples. Muddy climbs a ladder \n               on the other side of the same tree.\n\n                                     MUDDY\n                         Don't mess in this, Homer, if you \n                         know what's good for you.\n\n                                     HOMER\n                         How long's this been going on, Muddy?\n\n                                     MUDDY\n                         Long enough. You ain't gonna stop \n                         it.\n\n               Muddy looks all around for Mr. Rose; then he gives Homer his \n               knife.\n\n                                     MUDDY\n                         There's my knife, Homer. It ain't \n                         gonna do *me* no good. You give that \n                         knife to Rose Rose, you hear?\n\n               Homer nods, pocketing the knife. As Muddy climbs down and \n               moves his ladder to an adjacent tree, he keeps talking to \n               Homer until he disappears in the leaves.\n\n                                     MUDDY\n                         You best just watch you ass, Homer! \n                         You don't wanna end up like Jack!\n\n               Homer thoughtfully continues his work.\n\n               INT. BUNKHOUSE - LATE AT NIGHT\n\n               Homer lies awake in his bed.\n\n               EXT. ORCHARD - LATE AFTERNOON, ANOTHER DAY\n\n               The pickers on their ladders in the trees; nobody is talking. \n               In the late sun, the leaves have a reddish, fiery glow.\n\n               EXT. ORCHARD - ANOTHER DAY\n\n               It's much colder; the pickers are on their ladders in the \n               trees again, but they're dressed for the cold. Homer is high \n               on a ladder; he turns toward the view of the Worthington \n               house when he hears a car come to a screeching halt in the \n               driveway. Homer sees Candy get out of Wally's car; she leaves \n               the door open and runs toward the house. Parked in front of \n               Wally's car is an Army Jeep, with an ENLISTED MAN leaning \n               against it. The indifferent soldier smokes a cigarette as he \n               watches Candy run.\n\n                                     CANDY\n                         No! No!\n\n               Homer descends the ladder and runs for the house, down as \n               aisle between the row of trees. The pickers watch him run.\n\n               INT. WORTHINGTON HOUSE, LIVING ROOM - DAY\n\n               Camera follows Homer into the Worthington house where, from \n               the front hall, he sees Olive and Candy (in profile) sitting \n               on the couch. We can't see who's talking, nor do we recognize \n               the voice. As Homer comes into the living room, we see MAJOR \n               WINSLOW sitting in a chair (also in profile), talking to \n               Olive and Candy.\n\n               Major Winslow is a smooth, handsome well-briefed officer in \n               the casualty branch of the Army Air Corps; he's done his \n               homework, but he's not all business. He's painfully aware of \n               the delicate nature of his report.\n\n                                     MAJOR WINSLOW\n                         When the plane was hit, the crew \n                         chief and the radioman jumped close \n                         together. The copilot jumped third. \n                         All on Captain Worthington's orders--\n                         the captain was still flying the \n                         plane. None of the men of the ground \n                         could see the sky--that's how thick \n                         the jungle was. They never saw the \n                         plane crash--they never *heard* it \n                         crash. They never saw Captain \n                         Worthington's parachute, either.\n\n                                     OLIVE\n                         Why was he missing for twenty days?\n\n                                     MAJOR WINSLOW\n                         Because the crew thought he'd gone \n                         down with the plane. They were \n                         hospitalized for almost a week in \n                         China before they were flown back to \n                         India. It wasn't until that they \n                         sorted through their gear...\n\n                                     CANDY\n                         Who cares about their *gear*?\n\n                                     MAJOR WINSLOW\n                         Three men jumped from the plane, but \n                         they had four compasses with them. \n                         One of the crew jumped with Captain \n                         Worthington's compass.\n\n                                     CANDY\n                         He was in Burma for twenty days \n                         without a compass?\n\n                                     MAJOR WINSLOW\n                         He followed the Irrawaddy River, all \n                         the way to Rangoon. Somehow he managed \n                         to avoid the Japs, but not the \n                         mosquitoes.\n\n                                     OLIVE\n                         Then it's malaria?\n\n                                     MAJOR WINSLOW\n                         It's encephalitis B. He's recovering \n                         at Mount Lavinia Hospital, Ceylon.\n                              (pause)\n                         Uh... Captain Worthington is \n                         paralyzed.\n                              (Olive gasps)\n                         Waist down. He won't walk.\n\n               Candy stands and leaves the room.\n\n                                     MAJOR WINSLOW\n                              (to Olive)\n                         I'm sorry.\n\n                                     HOMER\n                              (asks the major)\n                         There are no autonomic effects, are \n                         there?\n\n               Major Winslow has to consult his notes.\n\n                                     MAJOR WINSLOW\n                         No autonomic effects... that's \n                         correct.\n\n                                     OLIVE\n                         When will he be home, Major?\n\n                                     MAJOR WINSLOW\n                         Four weeks or so, right around \n                         Halloween.\n\n               INT./EXT. WALLY'S CAR - LOBSTER POUND - END OF DAY\n\n               Homer and Candy are sitting in the parked car in silence.\n\n                                     HOMER\n                              (finally)\n                         There are no autonomic effects, just \n                         the paralysis of the lower \n                         extremities.\n\n               Candy stares at him, uncomprehending.\n\n                                     HOMER\n                         Wally can have kids, a normal sex \n                         life...\n\n               Candy cries.\n\n               EXT. LOBSTER POUND - EVENING\n\n               Ray is throwing snails in the water. Candy sits on the end \n               of the dock, slumped on Homer's shoulder.\n\n                                     RAY\n                         How about him not needin' the friggin' \n                         compass! How about that?\n\n                                     CANDY\n                         Daddy, *please*...\n\n               Ray knows that she wants him to leave. He shuffles off the \n               dock, toward the house. He knows how they both must feel.\n\n                                     RAY\n                         Good night, kids. Don't catch cold--\n                         it's gettin' cold already.\n\n                                     CANDY\n                         Good night, Daddy.\n\n                                     HOMER\n                         Good night, Ray.\n\n               Homer tries to cuddle closer, but Candy sits up, preoccupied.\n\n                                     HOMER\n                         Just tell me. I'll do whatever you \n                         want to do.\n\n                                     CANDY\n                         Nothing.\n\n                                     HOMER\n                         Isn't that like waiting and seeing?\n\n                                     CANDY\n                         No. Nothing is nothing. I want Wally \n                         to come home. I'm afraid to see him, \n                         too.\n\n                                     HOMER\n                         I know.\n                              (he kisses her)\n                         Is *that* nothing.\n\n                                     CANDY\n                         No, don't--that's something. Nothing \n                         is nothing.\n                              (Homer's sad smile)\n                         Don't even look at me. I want...\n\n               Candy buries her face in his chest.\n\n                                     CANDY\n                         ...to do nothing.\n\n               Homer holds her, doing nothing, while she sobs. As her crying \n               subsides, Homer's thoughts are far away. With Candy slumped \n               against him, hugging him, he doesn't look at her; instead, \n               he looks out to sea and at the darkening coast, Candy's words \n               resonating. An unfamiliar expression is on his face.\n\n                                     HOMER\n                              (mumbling to himself)\n                         It's a tempting idea, I know... to \n                         do nothing.\n\n               Candy is silent. Homer feels strangely agitated; he shifts \n               his position.\n\n                                     CANDY\n                              (groans)\n                         Please don't move, don't go anywhere.\n\n                                     HOMER\n                              (overly genuine)\n                         *Go* anywhere? Of course not! That \n                         would be *doing* something, wouldn't \n                         it? We wouldn't want to *do* \n                         something. Let's just sit here all \n                         night!\n\n                                     CANDY\n                              (irritated)\n                         If you're trying to be funny, Homer...\n\n                                     HOMER\n                              (irritated, too)\n                         I'm not trying to be anything--I'm \n                         just doing nothing! If I wait and \n                         see long enough, then--with any luck--\n                         I won't *ever* have to make up my \n                         mind! Decisions can be painful, after \n                         all...\n\n               Candy is angry; she gets to her feet and stares hard at him.\n\n                                     CANDY\n                         Stop it! Just cut it out!\n\n                                     HOMER\n                              (mock surprise)\n                         You got up! You *did* something! If \n                         you keep this up, you might be in \n                         danger of making a *decision*!\n\n                                     CANDY\n                         For God's sake, Homer, Wally's been \n                         shot down!\n\n               Candy sobs. Homer puts his face in his hands for a minute. \n               He regains his composure and stands up.\n\n                                     HOMER\n                              (genuinely contrite)\n                         I know, I'm sorry.\n\n                                     CANDY\n                              (yelling and sobbing)\n                         He's *paralyzed*!\n\n                                     HOMER\n                              (deadpan; just the \n                              facts)\n                         He's *alive*. He still loves you.\n                              (pause)\n                         So do I.\n\n                                     CANDY\n                              (anguished)\n                         What do you want me to *do*?\n\n               He faces away from her.\n\n                                     HOMER\n                              (with calm resolve)\n                         Nothing. You're not the one who has \n                         to do anything.\n\n               EXT. CIDER HOUSE - NIGHT\n\n               Homer is in semidarkness as he walks toward the cider house.\n\n                                     MR. ROSE (O.S.)\n                         Where do you think you're going?\n\n                                     ROSE ROSE (O.S.)\n                         You gotta let me go, Daddy. Please...\n\n               Homer walks faster. When he gets to the cider house, he sees \n               Mr. Rose and Rose Rose arguing. Rose is sitting on the \n               bicycle, a bundle of her clothes tied up behind the seat.\n\n                                     MR. ROSE\n                         You ain't goin' nowhere in the middle \n                         of the night, girl!\n\n                                     ROSE ROSE\n                         I ain't your business no more, Daddy. \n                         Please let me go.\n\n               Rose Rose starts to pedal away, but Mr. Rose stops her. She \n               starts to struggle.\n\n                                     HOMER\n                         Hey, hey! Stop it. Maybe I can help.\n\n               They turn to see Homer.\n\n                                     MR. ROSE\n                         You just go inside, Homer. We don't \n                         need no help.\n\n                                     ROSE ROSE\n                         That's right, Homer. This ain't your \n                         business.\n\n               She tries to break free from her father and pedal away, but \n               he stops her again. They keep struggling.\n\n                                     HOMER\n                         Please listen to me! *Both* of you...\n\n                                     MR. ROSE\n                         You forget yourself, Homer. This \n                         here's my daughter! You got your own \n                         mess to deal with--ain't that right?\n\n               Homer steps between them, which makes Mr. Rose furious.\n\n                                     MR. ROSE\n                              (yelling)\n                         What business is you in, Homer?\n\n                                     HOMER\n                         Mr. Rose, I'm in the *doctor* \n                         business.\n                              (to Rose Rose)\n                         If you want, I can help you. You \n                         don't have to go anywhere.\n\n               Rose Rose and Mr. Rose stop struggling. Suddenly Homer is in \n               charge.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Muddy, Hero and Peaches smoke in their beds. Rose Rose opens \n               her curtain and peers out from her bed. She gets up and goes \n               toward the kitchen area in her nightshirt; she stops at an \n               unused bed, now covered with white rubber sheeting--Homer's \n               medical instruments are displayed and ready. Homer finished \n               scrubbing his hands in the sink. His surgical mask is loosely \n               tied around his neck.\n\n               Mr. Rose is looking at Homer's surgical instruments when \n               Rose Rose joins him.\n\n                                     MR. ROSE\n                              (to Homer)\n                         What's that? What's it called?\n\n                                     HOMER\n                         One cervical stabilizer, two sets of \n                         dilators--Douglas points. One medium-\n                         sized curette, one small; one medium \n                         speculum, one large; two vulsellum \n                         forceps.\n\n                                     MR. ROSE\n                         There ain't no *almost* about this \n                         stuff, Homer--ain't that right?\n\n               Homer ignores him; he keeps naming his equipment.\n\n                                     HOMER\n                         Merthiolate, ether, vulval pads, \n                         gauze--lots of gauze.\n\n                                     MR. ROSE\n                         When it comes to this, you is the \n                         real thing--is that what you sayin'?\n\n               Homer looks at Mr. Rose and Rose Rose.\n\n                                     HOMER\n                         No *almost* about it--I'm a doctor.\n\n               Homer turns to Peaches, Hero, and Muddy.\n\n                                     HOMER\n                         Get out of here, please.\n\n               Muddy herds Peaches and Hero out of the bunkhouse.\n\n                                     MR. ROSE\n                         I'm stayin', Homer.\n\n                                     HOMER\n                         Okay. Then you can be of use.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Mr. Rose wears a surgical mask; he is sweating, even in the \n               cold, and his eyes look stricken as he watches Homer, who is \n               performing the abortion. Mr. Rose holds the ether cone over \n               Rose Rose's face. He drips some ether from the bottle on the \n               cone.\n\n               Cut quickly for Rose Rose's etherized face... to Mr. Rose's \n               eyes above his mask... to Homer working with his eyes trained \n               on the speculum...\n\n               EXT. CIDER HOUSE - NIGHT\n\n               ...to Muddy and Peaches and Hero huddled under the overhanging \n               roof in the rain.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Mr. Rose is having a hard time breathing.\n\n                                     HOMER\n                         You better get some air.\n\n               EXT. CIDER HOUSE - NIGHT\n\n               The cider house in the rain. Mr. Rose staggers out; he stands \n               there in the rain, trying to regain his composure. He starts \n               to scream.\n\n               Another angle: huddled under the overhanging roof, Muddy and \n               Peaches and Hero are watching him.\n\n               INT. BUNKHOUSE - RAINY DAY\n\n               Rose Rose, curled in a fetal position, listens to the rain \n               on the roof. Candy sits on her bed beside her. She helps her \n               to sit up, to drink a glass of water; then Rose Rose lies \n               down again. Rose Rose's expression never changes while Candy \n               talks to her. Mr. Rose lies in his bed in the exact same \n               fetal position as his daughter; he too, is listening to Candy. \n               Homer is putting away his instruments.\n\n                                     CANDY\n                         The bleeding should taper off \n                         tomorrow, but it can come back again. \n                         The cramps will ease up, almost \n                         entirely. The bleeding is usually \n                         much lighter in two days. As long as \n                         the bleeding isn't heavy, it's normal.\n\n               Muddy enters the cider house from out of the storm. He glances \n               at Candy and Rose Rose; then at Homer. Then he speaks to Mr. \n               Rose.\n\n                                     MUDDY\n                         It's that Vernon--he keeps askin' \n                         where you and Homer and Rose Rose is \n                         at.\n\n                                     MR. ROSE\n                         Tell that Vernon to mind his own \n                         business, Muddy.\n\n                                     MUDDY\n                         I told him that you all is sick.\n\n                                     MR. ROSE\n                         Tell him what you want, Muddy--*you* \n                         is the crew boss today.\n\n               Hero and Peaches, dripping wet, come inside. Peaches is \n               standing next to the list of rules tacked to the kitchen \n               support beam.\n\n                                     PEACHES\n                         Look at that. Them same damn rules \n                         is tacked up again!\n\n               Homer has finished putting his instruments away.\n\n                                     MUDDY\n                         Why don't you put them damn rules in \n                         the wood stove, Peaches?\n\n               As the men are murmuring their approval of this idea, Rose \n               Rose interjects.\n\n                                     ROSE ROSE\n                         I want to hear what they are, first.\n\n               The men groan, but Mr. Rose won't oppose his daughter on \n               this subject--not this time. He just lies there.\n\n                                     ROSE ROSE\n                         Homer, let me hear what they are.\n\n               Homer begins to read.\n\n                                     HOMER\n                         \"One: Please don't smoke in bed.\"\n\n                                     MUDDY\n                         We heard that one already, Homer.\n\n                                     HOMER\n                         \"Two: Please don't go up to the roof \n                         to eat your lunch.\"\n\n                                     PEACHES\n                         That's the best place to eat lunch!\n\n                                     HOMER\n                         \"Three: Please--even if you are very \n                         hot--do not go up to the roof to \n                         sleep.\"\n\n                                     HERO\n                         What do they think? They must think \n                         we're crazy!\n\n                                     MUDDY\n                         They think we're dumb niggers so we \n                         need dumb rules--that's what they \n                         think.\n\n                                     HOMER\n                         This is the last one.\n\n               The men groan, in mock disappointment.\n\n                                     HOMER\n                         \"Four: There should be no going up \n                         on the roof at night.\"\n\n                                     PEACHES\n                         Why don't they just say, \"Stay off \n                         the roof!\"?\n\n                                     HERO\n                         Yeah, they don't want us up there \n                         *at all*!\n\n               Homer crumples the list and throws it into the wood stove.\n\n                                     ROSE ROSE\n                              (to Homer)\n                         That's *it*?\n\n                                     HOMER\n                         That's it.\n\n                                     ROSE ROSE\n                         It means nothin' at all! And all \n                         this time I been *wonderin'* about \n                         it!\n\n                                     PEACHES\n                         They're *outrageous*, them rules!\n\n                                     MR. ROSE\n                         Who *live* here in this cider house, \n                         Peaches? Who grind them apples, who \n                         press that cider, who clean up the \n                         mess, and who just plain *live* \n                         here... just breathin' in the vinegar?\n                              (he pauses)\n                         Somebody who *don't* live here made \n                         them rules. Them rules ain't for \n                         *us*. *We* the ones who make up them \n                         rules. We makin' our *own* rules, \n                         every day. Ain't that right, Homer?\n\n                                     HOMER\n                         Right.\n\n               Camera closes on Candy.\n\n               INT./EXT. WALLY'S CAR - DRIVE-IN THEATRE - EVENING\n\n               Homer and Candy sit and stare at the blank screen; they don't \n               look at each other. Candy grips the steering wheel of the \n               parked car.\n\n                                     CANDY\n                         Please don't make me say it again.\n\n                                     HOMER\n                         No, that's not it--I just want to be \n                         sure I understand you.\n\n               Candy slumps forward with her forehead on the steering wheel.\n\n                                     HOMER\n                         I *helped* you not to think about \n                         Wally. You were so upset--you couldn't \n                         stand worrying about him, about his \n                         being killed and not coming back--\n                         but when you were with me, you could \n                         stop worrying... well, for a while, \n                         anyway. This is how I helped you, \n                         right?\n\n                                     CANDY\n                         Please... that's enough. I *loved* \n                         you, too--you know I did.\n\n                                     HOMER\n                         \"...did.\" Well, okay.\n\n                                     CANDY\n                         Please don't...\n\n                                     HOMER\n                              (sarcastically)\n                         And now that Wally's coming back, \n                         and because he'll certainly *need* \n                         you...\n\n                                     CANDY\n                         You say that as though it's some \n                         awful thing!\n                              (angrily)\n                         I never stopped loving Wally!\n\n               Homer lets that sink in.\n\n                                     HOMER\n                              (still sarcastic)\n                         At least there's no more waiting and \n                         seeing. At least I got to see the \n                         ocean.\n\n               Candy covers her face in her hands and cries uncontrollably, \n               unstoppably. Homer's anger keeps him impervious to her tears--\n               another \"first\" for him. He turns and looks at her with an \n               almost clinical curiosity; then he goes back to staring at \n               the blank screen.\n\n               EXT. ORCHARD - IN FRONT OF THE APPLE MART - DAWN\n\n               The rain has stopped but the grass is wet, the trees \n               glistening in the dawn light as Wally's car stops and Homer \n               gets out. The car exits the frame in one direction; Homer, \n               walking, exits the frame in another.\n\n               EXT. CIDER HOUSE - DAWN\n\n               As he walks toward the cider house, Homer sees Muddy and \n               Peaches and Hero waving to him from the roof.\n\n                                     MUDDY\n                         Rose Rose has runned away!\n\n                                     PEACHES\n                         She took off in the night!\n\n                                     MUDDY\n                         She took off on the bicycle, man.\n\n               Homer starts jogging, then running toward the cider house. \n               Muddy comes down the ladder to meet him.\n\n               INT. BUNKHOUSE - EARLY MORNING\n\n               Rose Rose's bed is exposed. The curtains are flung open; her \n               bed is empty. Mr. Rose is still in his bed, in the fetal \n               position we have seen before. Mr. Rose's trancelike expression \n               doesn't change as Homer and Muddy enter.\n\n                                     MR. ROSE\n                         Ain't nobody gonna find her, Homer--\n                         she's long gone.\n                              (pause)\n                         I swear, I didn't try and stop her--\n                         I just wanna touch her hand before \n                         she go. That's all I wanna do, I \n                         swear.\n                              (pause)\n                         Where'd she get that knife, Muddy? \n                         That looked like *your* knife--what \n                         I seen of it.\n\n               Muddy is scared; he looks to Homer for advice.\n\n                                     MR. ROSE\n                         If that was your knife, Muddy, I \n                         wanna thank you for givin' it to her--\n                         no girl should be goin' *hitch-hikin'* \n                         if she don't got a good knife with \n                         her.\n\n                                     HOMER\n                              (seeing the blood)\n                         Where'd she get you?\n\n                                     MR. ROSE\n                         She just plan misunderstand me--I \n                         was tryin' to give her my knife, I \n                         was just reachin' to touch her hand. \n                         But I understand if she misunderstand \n                         me--it's all my fault, ain't that \n                         right?\n\n               Homer takes the blanket off him; Muddy gasps. Homer tries to \n               examine Mr. Rose's wound. Mr. Rose smiles at him.\n\n                                     MR. ROSE\n                         It's too late for the doctor now, \n                         Homer--ain't that right?\n\n               Homer doesn't answer; he knows Mr. Rose is a goner.\n\n                                     MR. ROSE\n                              (proudly)\n                         She's *good* with that knife! She's \n                         real fast. She's a lot better with \n                         that knife than *you* is, Muddy! And \n                         who do you suppose taught her?\n\n                                     MUDDY\n                         *You* taught her, I suppose...\n\n                                     MR. ROSE\n                         That's right! A girl's gotta know \n                         how to defend herself, don't she?\n\n               He winces in pain at Homer's examination.\n\n                                     HOMER\n                              (surprised)\n                         There's more than one laceration, \n                         more than one cut.\n\n                                     MR. ROSE\n                         That's 'cause I sticked my *own* \n                         knife in the wound--after she go, I \n                         sticked my *own* knife in there. I \n                         poked it all around, I just tryin' \n                         to find the same place she got me.\n\n               Homer finds Mr. Rose's knife. There's blood everywhere.\n\n                                     MR. ROSE\n                         You listen to me: you tell them police \n                         how this happen, you tell it *this* \n                         way, you hear? My daughter, she runned \n                         off--and I so sad about it that I \n                         stabbed myself. I so unhappy that \n                         she gone, I killed myself--that what \n                         you say, you hear? That the true \n                         story--ain't that right?\n\n               Homer and Muddy exchange a glance. Mr. Rose, with his blood-\n               soaked hand, suddenly grabs Homer by the throat.\n\n                                     MR. ROSE\n                         Let me hear you say that! I so unhappy \n                         she runned away that I killed myself--\n                         that what happen here, ain't that \n                         right?\n\n                                     HOMER\n                         Right?\n\n                                     MUDDY\n                         That what happen--you lost you only \n                         daughter so's you killed yourself! \n                         That's what we say, all right.\n\n                                     MR. ROSE\n                         That's right. I know you understand \n                         how I feel, Homer--you is breakin' \n                         them rules, too. Ain't that right?\n\n               Mr. Rose dies. Muddy turns away. Homer closes Mr. Rose's \n               eyes.\n\n               EXT. CIDER HOUSE, ROOF - MORNING\n\n               Muddy and Hero and Peaches are sitting close together on the \n               roof, like banished children. It is from their perspective \n               that we see the police car and the ambulance--two men carrying \n               the body out of the cider house, and a cop or two talking to \n               Homer and Olive, and Homer talking to them. We hear no \n               dialogue.\n\n               EXT. APPLE MART - DUSK\n\n               Homer and the men load crates of apple jelly onto a truck. \n               The mood is solemn; they work with tired focus. Candy drives \n               up. The men are evasive with her; they find a reason to work \n               across the mart. Candy walks to Homer, stands next to him. \n               They say nothing for a moment, until Candy breaks the silence.\n\n                                     CANDY\n                         Do you think she'll be all right?\n\n                                     HOMER\n                         She knows how to take care of herself.\n\n               Candy looks away; she can't think of what to say. She shoves \n               her hands into her pockets, finds a letter there, which she \n               hands to Homer.\n\n                                     CANDY\n                         This came for you a couple of days \n                         ago. Olive asked me to bring it. \n                         With everything happening, I guess \n                         she forgot.\n\n                                     HOMER\n                         Sure. Thanks.\n\n               Homer looks at the letter from St. Cloud's; he puts it \n               unopened in his pocket without a second thought. Candy can't \n               let things end there.\n\n                                     CANDY\n                         I know you don't think much of being \n                         needed, or of me for that matter...\n\n                                     HOMER\n                         I'm sorry for what I said about Wally \n                         needing you. It was... unnecessary.\n\n                                     CANDY\n                         No, I'm the one who should be sorry. \n                         You have every right to be angry.\n\n                                     HOMER\n                         No. You warned me. I didn't listen, \n                         but you warned me.\n\n               Candy looks surprised.\n\n                                     HOMER\n                         You told me you weren't any good at \n                         being alone.\n                              (pause)\n                         You told Wally, too. Right?\n\n               Candy can only stare straight ahead.\n\n                                     HOMER\n                              (relenting)\n                         He's going to be fine, Wally's going \n                         to be fine. I know he is.\n\n               A tear rolls down Candy's cheek, Homer wipes it away; then \n               he stops touching her and looks off into the quiet orchards.\n\n               INT. BUNKHOUSE - NIGHT\n\n               The pickers lie in their beds, smoking. Homer is undressing. \n               He pulls the letter out of his pocket and sits down on his \n               bed. Homer opens the letter without enthusiasm and begins to \n               read.\n\n                                     ANGELA (V.O.)\n                         Dear Homer, I am writing to tell you \n                         about Wilbur.\n\n               INT. DISPENSARY - NIGHT\n\n               Music is playing on the old phonograph as an exhausted Larch \n               gives himself ether.\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               Edna is getting the girls ready for bed. Music continues \n               Over.\n\n               INT. DISPENSARY - NIGHT\n\n               Larch has twisted himself on the narrow bed so that his face \n               is unusually close to the windowsill, and when the ether \n               cone starts to fall off his face--and his slack hand trails \n               down, off the side of the bed--the cone becomes caught against \n               the windowsill.\n\n               He tries to turn his face away from the cone, but he presses \n               his face into the sill--thus holding the ether-soaked cone \n               over his mouth and nose. His hands twitch, he's trying to \n               wake up; the hand that holds the ether bottle lets the bottle \n               fall. The bottle shatters against the sill; the ether spreads, \n               running red with blood from a cut on Dr. Larch's hand or \n               finger. Music continues Over. It's a funeral.\n\n               INT. CORRIDOR - NIGHT\n\n               Buster is bringing in the wood as the music plays Over. Buster \n               smells the spilled ether. He heads toward the dispensary, \n               sniffing. Camera follows him into the dispensary.\n\n               In the dispensary: Buster approaches Larch's ether-bed.\n\n                                     BUSTER\n                         Dr. Larch? Dr. Larch?\n\n               He drops the armload of wood and runs for help.\n\n               INT. DISPENSARY - NIGHT\n\n               Angela enters. She feels for Larch's pulse; Larch is dead. \n               Angela opens a window. She pull's Larch's body away from the \n               windowsill. Buster joins her on the bed.\n\n                                     ANGELA (V.O.)\n                         I can assure you that the overdose \n                         was entirely accidental.\n\n               INT. BUNKHOUSE - NIGHT\n\n               Homer finishes reading the letter; he puts it down, gets up, \n               and walks to a window. He stares into the night.\n\n                                     ANGELA (V.O.)\n                         Let us be happy for Dr. Larch. Dr. \n                         Larch has found a family.\n\n                                     THE BOYS (V.O.)\n                         Good night, Dr. Larch! Good night, \n                         Dr. Larch! Good night, Dr. Larch!\n\n               Homer wipes a tear off his cheek.\n\n               EXT. PICKERS' TRUCK - CIDER/PACKING HOUSE - MORNING\n\n               The truck is packed for the long trip south; it passes by \n               the packing house, which looks closed for the season. No one \n               else is about. Muddy is driving slowly, his arm out the open \n               window. In the back, huddled among their belongings, are \n               Peaches and Hero (on one side) and Homer (on the other). The \n               pickers are trying to draw Homer into their conversation, \n               while Homer is giving the apple farm a good-bye look. He has \n               made up his mind about something.\n\n                                     MUDDY\n                         You ever see a palm tree, Homer?\n\n                                     PEACHES\n                         He ain't never been outta Maine!\n\n                                     HERO\n                         Ain't you sick of pine trees, Homer?\n\n               Homer just smiles and shakes his head.\n\n               EXT. WORTHINGTON HOUSE, DRIVEWAY - MORNING\n\n               As the pickers' truck drives past, Homer is on the side of \n               the truck nearest the Worthington house and driveway; he \n               sees Olive and Candy and Ray helping Wally out of the car \n               and into a wheelchair. A NURSE stands by.\n\n               Wally is wearing what appears to be an oversized officer's \n               coat or flight jacket, his face looking small in the overlarge \n               clothes. He can't move his legs at all, and his mouth is \n               drawn into a tight-lipped smile.\n\n                                     PEACHES (O.S.)\n                         Let me tell you somethin' about \n                         Florida, Homer.\n\n                                     HERO (O.S.)\n                         The Sunshine State!\n\n                                     PEACHES (O.S.)\n                         It's so nice 'n' warm down there, \n                         you can pick them grapefruits and \n                         oranges *naked*, if you want to.\n\n               Olive is dissolved in tears. Candy is sobbing; she kisses \n               Wally, without ceasing, while he haltingly touches her face, \n               her hair.\n\n               In the truck the smile is gone from Homer's face. He shakes \n               his head.\n\n                                     HOMER\n                         Thanks, guys... I'd like to go with \n                         you. But I've got to move on.\n\n                                     MUDDY\n                         Yeah, well... you could move on with \n                         *us*, man! You could move on somewhere \n                         *warm*!\n\n                                     PEACHES\n                         Homer, stayin' in Maine ain't movin' \n                         on!\n\n               This makes all the pickers laugh, but Homer just smiles and \n               shakes his head. He watches the Worthington house disappear \n               from view.\n\n               INT. MOVING TRAIN - PASSENGER CAR - NIGHT\n\n               A CONDUCTOR, taking tickets, comes to Homer, who is better \n               dressed than we've ever seen him; he is looking at his sober \n               reflection in the black window-glass of the night train when \n               the conductor gets his attention. When the conductor moves \n               on, Homer takes Angela's letter out of his breast pocket; he \n               skips ahead to the end.\n\n                                     ANGELA (V.O.)\n                         Dr. Larch often wondered how the \n                         world was treating you.\n\n               EXT. ST. CLOUD'S - GRAVEYARD - AFTERNOON\n\n                                     ANGELA (V.O.)\n                         He talked a lot about you, hoping \n                         you would be of use, whatever you \n                         were up to.\n\n               Angela and Buster and Mary Agnes and Edna carry Larch's \n               coffin; they set it down by the raw hole. The pile of fresh \n               dirt stands out against the new snow; the hole is black \n               against the new white.\n\n                                     EDNA (O.S.)\n                         \"Oh, Lord, support us all the day \n                         long...\"\n\n               We see the wheelbarrow with the gravestone.\n\n                                     EDNA (O.S.)\n                         \"...until the shadows lengthen and \n                         the evening comes, and the busy world \n                         is hushed, and the fever of life is \n                         over, and our work is done.\"\n\n               INT. GIRLS' DIVISION - NIGHT\n\n               We see the faces of the girls praying for Larch (Mary Agnes, \n               too) as Edna finishes her favorite prayer.\n\n                                     EDNA\n                         \"Then, in Thy mercy grant us a safe \n                         lodging, and a holy rest, and peace \n                         at the last.\"\n\n               INT. MOVING TRAIN - PASSENGER CAR - NIGHT\n\n               Camera closes on Homer, sleeping to the sound of the rocking \n               train. Angela's letter lies in his lap.\n\n                                     THE GIRLS (O.S.)\n                         Amen! Amen! Amen!\n\n               EXT. ST. CLOUD'S - TRAIN STATION - EARLY MORNING\n\n               The train stops, blowing snow. Homer steps off the train \n               carrying a suitcase and Dr. Larch's bag. The disapproving \n               stationmaster is still disapproving. Music plays Over, \n               something triumphant.\n\n               EXT. ST. CLOUD'S - THE HILL - EARLY MORNING\n\n               Homer makes his way up the hill toward the orphanage. Music \n               Over.\n\n               EXT. ORPHANAGE - EARLY MORNING\n\n               Edna is breaking up fights; this time, instead of fighting \n               over snowballs, the orphans are fighting over their pumpkins. \n               Suddenly Homer tops the brow of the hill and they all see \n               him. Buster is the first to catch sight of Homer; he runs \n               toward him. Mary Agnes also sees Homer; she immediately turns \n               away and runs inside. Music FADES OUT Over.\n\n               INT. LAVATORY - EARLY MORNING\n\n               Mary Agnes crashes into the bathroom and stumbles up to the \n               mirror; she starts to fix herself up with shaking hands.\n\n               INT. ORPHANAGE, FRONT HALL - EARLY MORNING\n\n               Everyone has heard the news; they come on the run. The \n               children flock around Homer, hugging him. Homer takes Angela \n               and Edna in his arms. Mary Agnes joins the group. Homer takes \n               in how changed, how attractive she is. They smile awkwardly \n               at each other.\n\n               INT. BOYS' DIVISION - EVENING\n\n               Homer's suitcase is open on the bed; we see Homer's hands as \n               he begins to unpack. Smaller hands reach in and root through \n               the clothes.\n\n                                     CURLY (O.S.)\n                         Did you bring something for me?\n\n               Curly continues his search. Homer thinks for a second; then \n               reaches into his pocket and pulls out the piece of pale-green \n               glass.\n\n                                     HOMER\n                         You know what? I did.\n\n               Homer hands the piece of glass to Curly.\n\n                                     HOMER\n                         It's from the ocean. It's for you.\n\n               Curly is duly impressed; he walks away to examine his new \n               treasure. Homer continues unpacking. He pulls his X ray out \n               and puts it aside.\n\n                                     BUSTER\n                         What are you doing here?\n\n               Homer turns to see Buster, Mary Agnes, Angela, and Edna in \n               the doorway.\n\n                                     MARY AGNES\n                         We made up a room for you.\n\n                                     ANGELA\n                         Wouldn't you be more comfortable by \n                         yourself?\n\n               Homer smiles; he nods.\n\n               Angela and Mary Agnes start to put Homer's things back in \n               his bag. Edna picks up the X ray and looks at it with a somber \n               expression.\n\n                                     EDNA\n                         Homer, do you know what this is?\n\n                                     HOMER\n                         Sure. It's my heart.\n\n                                     ANGELA\n                              (shakes her head)\n                         Actually, it's Fuzzy's. There's \n                         nothing wrong with your heart.\n\n                                     HOMER\n                         Fuzzy's?!\n\n                                     EDNA\n                         Dr. Larch wanted to keep you out of \n                         the war, Homer--that's why he did \n                         it. That's why he told you it was \n                         yours.\n\n               Homer is stunned; he puts his hand to his heart.\n\n                                     ANGELA\n                         I think he worried about his own \n                         heart. He said it would never stand \n                         up to Homer Wells going off to war.\n\n               Homer takes that in; he nods. Mary Agnes touches him \n               sympathetically.\n\n               INT. LARCH'S OFFICE - NIGHT\n\n               Homer looks at his fake diplomas; they are now framed and \n               hanging on the office wall. Homer surveys the office, as if \n               for the first time; he sits down in the desk chair, as if \n               slowly getting used to his new position.\n\n               INT. BOYS' DIVISION - NIGHT\n\n               Homer reads to the boys from \"David Copperfield\". While his \n               voice is strong--positive, optimistic, certainly reassuring \n               to the boys--there is in the conclusion of the chapter \n               something that distracts him. He seems to hesitate; he misses \n               a line or two, and perhaps he purposely skips one or two \n               others. (Possibly Homer's eyes wander ahead, to the title of \n               the next chapter: \"I Make Another Beginning.\")\n\n                                     HOMER\n                         \"Thus I began my new life, in a new \n                         name, and with everything new about \n                         me... I felt... like one in a dream... \n                         The remembrance of that life is \n                         fraught with so much... want of \n                         hope... Whether it lasted for a year, \n                         or more, or less, I do not know. I \n                         only know that it was, and ceased to \n                         be; and... there I leave it.\"\n\n               Homer stops and looks at the boys' faces.\n\n                                     CURLY\n                         What happens next?\n\n               Homer smiles.\n\n                                     HOMER\n                         That's tomorrow, Curly. Let's mot \n                         give the story away.\n\n               Homer puts out the lights and leaves the boys in the familiar \n               semi-darkness. Seconds, later, the closed door to the hall \n               is flung open, flooding the room with light from the hall, \n               and Homer, dressed in his long white laboratory coat and \n               looking every inch the doctor, delivers his best imitation \n               of Larch's popular blessing.\n\n                                     HOMER\n                         Good night, you Princes of Maine! \n                         You Kings of New England!\n\n               On Copperfield and Steerforth and Curly as the door to the \n               hall is closed and semi-darkness prevails in the room again. \n               Copperfield, smiling, shuts his eyes. After a second, the \n               wide-eyed Steerforth shuts his eyes, too. Then Curly.\n\n               The last to close his eyes is Buster.\n\n                                                             FADE TO BLACK:\n\n                                         THE END\n\n\n\n\n\n\nCider House Rules, The\nWriters :   John Irving\nGenres :   Drama  Romance\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:31.668452"}