{"title": "Cirque du Freak: The Vampire's Assistant", "film_link": "/Movie Scripts/Cirque du Freak: The Vampire's Assistant Script.html", "script_link": "/scripts/Cirque-du-Freak-The-Vampire's-Assistant.html", "info_raw": "\n\nCirque du Freak: The Vampire's Assistant Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Brian Helgeland\nGenres  Action  Adventure  Fantasy  Thriller\nMovie Release Date : October 2009\n\nRead \"Cirque du Freak: The Vampire's Assistant\" Script\n\n\n", "script": "\n\n\n \n                               CIRQUE DU FREAK\n\n\n\n\n                                  Written by\n\n                               Brian Helgeland  \n\n\n                         \n\n                         \n\n                         FADE IN:\n          CLOSE ON a spectacular example of PEUCETIA VIRIDANS.\n          Descending through mid-air on a silken thread. Neon green\n          with black leopard spots on its legs. A Green Lynx Spider.\n          As we follow it down, the threaded opening of a GLASS JAR\n          appears from the bottom of frame.\n          Just before the spider continues inside the jar, it stops,\n          suspended. Something's not right. It waves a leg\n          tentatively through the air...\n\n                         DARREN'S VOICE\n          Come on... Just a little lower...\n          WIDEN TO REVEAL a Middle School TOILET STALL. Standing on\n          the lid of the closed toilet, holding the glass jar up over\n          his head, is DARREN SHAN.\n          Darren is 14 and a well-liked kid. Tenacious. Diligent.\n           The spider just hangs there.\n\n                         DARREN\n          Come on... I'll take good care of\n          you. All the bugs you can eat.\n\n          MIDDLE SCHOOL BOYS ROOM\n          The door bangs open and STEVE LEONARD enters. Unlike Darren,\n          Steve's not so well-liked. In fact, he can be trouble.\n          Maybe that's why they're friends.\n\n                         STEVE\n          Hey, Darren!\n          No answer. Steve walks along the stall, scoots low so he can\n          see any feet in front of the bowls.\n\n                         STEVE\n          Did you fall in? Darren!\n\n                         DARREN'S VOICE\n          Shhh...\n          Steve looks to the last stall, sees the jar being held up.\n          INTERCUT from in and outside of the stall.\n\n                         DARREN\n          You're gonna scare him away.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          2.\n\n                         STEVE\n          Man, we're getting killed out\n          there. It's three to nothing.\n          Darren is all concentration as the spider drops a little.\n\n                         DARREN\n          Your problem, Steve, not mine...\n          Steve gets a waggish idea. Stepping to the sink, pressing\n          his forefinger over the spigot, he turns the faucet.\n          WATER SHOOTS out in a stream, which Steve directs into and\n          then over the stall door. Reacting, the spider zips up its\n          thread, is lost in the darkened ceiling.\n          The stall door opens. Dripping water, Darren stares at Steve\n          who flashes a wicked grin...\n\n                         CUT TO:\n\n          EXT. SCHOOL YARD - DAY\n\n          Kids eat lunch, off in their groups. On the field: Darren\n          has a SOCCER BALL practically glued to his foot. He dribbles\n          through defenders, shoots, SCORES! Steve pumps a fist:\n\n                         STEVE\n          GOAL! Three to one!\n          The other team regroups, starts back upfield with the ball.\n          Darren steals it. A few strides and WHUMP!\n          Darren catches the goalie too far out. The ball lofts just\n          over the backpedaling goalie's head, bounces into the goal.\n\n                         STEVE\n\n                         (EXULTANT)\n          Three to two!\n          Angry at himself, the goalie KICKS the ball away. It veers\n          off toward the street. Steve takes it as a personal insult.\n\n                         STEVE\n          What does that prove? Huh?\n          The goalie blanches as Steve moves at him. Kids are nervous\n          about Steve. He likes to fight. Darren gets between them.\n\n                         DARREN\n          Go get the ball. It's 3 to 2.\n          Lunch's almost over.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          3.\n\n                         STEVE\n          That's why he kicked it. To kill\n          time. Well, I still got time to\n          kick your face.\n\n                         DARREN\n\n                         (BLOCKING HIM)\n          Forget it. The ball.\n          Steve decides, heads after it. The goalie gulps in relief.\n\n                         GOALIE\n          Thanks, Darren. He's crazy.\n          Darren watches after Steve. He does have a vicious streak.\n\n                         THE STREET\n          Steve tracks down the ball which has rolled into the street.\n          From seemingly out of nowhere...\n          A gleaming black 1966 LINCOLN Continental. Its tires sucking\n          at the asphalt as it rolls. The windows blacked out.\n          It speeds up reaching the ball. Ba-Dump! The ball BURSTS.\n\n                         STEVE\n          You idiot!\n          The car SCREECHES to a stop, idles ominously. Suddenly Steve\n          doesn't seem so tough. He looks nervously back to Darren.\n          But as a WIND picks up, the Lincoln suddenly tears off.\n          A sheet of PAPER is kicked up by one of the car tires. The\n          wind sends it sailing. It drifts down, until... Steve\n          notices, snatches it out of the air.\n          Darren steps up beside him, watches the Lincoln disappear\n          down the street. Creepy...\n\n                         STEVE\n          Look at this.\n          The paper is a FLYER. A startling, violent layout. Beneath\n          a snarling WOLF'S HEAD: CIROUE DU FREAK - Human oddities and\n          other living curiosities. Midnight. Zeiterion Theater. $20\n          - Admission is at the discretion of the proprietor.\n\n                         STEVE\n          .Human oddities and other living\n          curiosities...\n\n                         (TO DARREN)\n          Other. Does that mean not human?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          4.\n          Darren shrugs, takes the flyer.\n\n                         DARREN\n          A freak show. Ever been to one?\n\n                         STEVE\n\n                         (GRINS)\n          Just this school.\n          Darren turns the flyer over. There are tire tracks on the\n          back. They hear the sound of distant tire squeals, but the\n          Lincoln is long out of view. Just an empty street now...\n\n                         CUT TO:\n\n          A BOA OCCIDENTALIS\n          Probing the confines of its glass prison. A BOA CONSTRICTOR\n          by any other name. It's a prison within a prison because\n          we're inside...\n\n          THE SCHOOL SCIENCE LAB - DAY\n          The teacher, MR. DALTON, moves ponderously around the room.\n          His voice like a metronome.\n\n          MR. DALTON\n          As you can see reptiles and\n          amphibians are not one in the same.\n          As Mr. Dalton continues, we see various PAIRS OF STUDENTS,\n          their computer screens showing text or pictures of various\n          FROGS, ALLIGATORS and LIZARDS...\n          DARREN and STEVE sit together staring at a Komodo Dragon.\n          After Mr. Dalton passes by, Steve switches screen views.\n          He's done a WebSearch of Cirque du Freak. There are a dozen\n          or so entries. He picks one: History of the Side Show.\n          Under 1920's there's an older, much more 'Victorian' pamphlet\n          for the Cirque du Freak. A more ornate version of the same\n          Wolf Head. The same notice from the proprietor.\n          Steve spreads the flyer out to compare. They whisper:\n\n                         STEVE\n\n          1923...\n\n                         DARREN\n          Must be a different one.\n          Steve scrolls down through pictures:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          5.\n          Sword swallower and glass eater: OHIO GRAY.\n          Frog boy: AVERY CHILDS.\n          Human skeleton: J.D. COMBS. .and then...\n          Egyptian Soothsayer: LARTEN CREPSLEY. Crepsley's gaze is\n          startling. Like he can see through the screen, even from\n          1923. Steve looks like he's just seen a ghost.\n          Suddenly, he hits print. As a PRINTER against the wall\n          clicks to life, Steve looks back at Darren.\n\n                         STEVE\n          I gotta show you something...\n\n                         CUT TO:\n\n          EXT. THE SHAN HOUSE - DAY\n\n          Picture perfect: two stories, dormers, trellises. 9-year-old\n          ANNIE rides up on her bike, bookbag over her shoulder.\n          Without stopping, she hops off, dumps it on the lawn by two\n          other bikes. A few steps and she's through the door.\n\n                         CUT TO:\n\n          INT. DARREN'S ROOM - DAY\n\n          Moody for the daytime. Only the light from the half-closed\n          blinds streaking the floor where:\n          Darren and Steve are huddled over several clippings and\n          pictures that Steve has spread out. They all deal with\n          VAMPIRES in some form or another. Steve pulls another stack\n          from his backpack, spreads them out as well.\n\n                         DARREN\n          I don't get it.\n\n                         STEVE\n          Vampires. I've been studying them.\n          Vampires? Darren looks at him a beat.\n\n                         DARREN\n          Right. You're failing half your\n          classes at school, but you're\n          studying vampires.\n\n                         STEVE\n          They been around 1000's of years.\n          Two tribes. They even fight wars.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          6.\n\n                         DARREN\n          What? When?\n\n                         STEVE\n          Okay, sometimes, when humans fight?\n          They fight at the same time. And\n          no one knows it. Like at the\n          Battle of Stalingrad they fought at\n          the same time the Russians and\n          Germans were fighting.\n          Darren just looks at him, wonders if he's serious.\n\n                         STEVE\n          Some people know about it. There\n          have even been books written.\n          He pulls a frayed old yellow hardcover from his bag.\n\n                         DARREN\n          That's your proof? It smells.\n          Steve's really trying to convince him now.\n\n                         STEVE\n          It's everywhere if you look. On\n          the internet, in blogs, newspapers,\n          weird places. But you can find it.\n          The room starts to tighten a notch around them.\n\n                         STEVE\n          I chatted online with one of them.\n\n                         DARREN\n          Come on.\n\n                         STEVE\n          Serious.\n          We become aware of...\n\n          A SINISTER POV\n          Someone watching Darren and Steve through the half open\n          doorway. It moves in, starts coming up from behind.\n\n                         DARREN\n          What was his name? Mr. Dracula?\n          Mad now, Steve opens the book, flips pages, finds an old 19th\n          Century painting. He slaps down the science lab internet\n          print-out of Larten Crepsley. It's the same guy! Maybe...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          7.\n\n                         STEVE\n          Here he is in 1923. And here 1855.\n          Huh? Maybe he'll be there tonight.\n          Would that make you believe?\n          As Darren looks them over, the POV looms up behind them.\n          Suddenly Darren spins...\n          And ROARS at what's behind them: his sister Annie. She\n          SCREAMS in response. Steve jumps a mile. Darren LAUGHS.\n\n                         ANNIE\n          How'd you know?\n\n                         DARREN\n          Saw your shadow on the floor.\n          Gotta try harder, knucklehead.\n          Steve snaps his book shut, shoves it in his backpack.\n\n                         STEVE\n          I'm gonna get a soda.\n\n                         DARREN\n          Get me one, too.\n          Steve gets up, stomps out of the room.\n\n                         CUT TO:\n\n          INT. KITCHEN - SHAN HOUSE - DAY\n\n          Steve opens the refrigerator, looks to see what's in there.\n          At the same time Darren's MOTHER arrives home. Coming in\n          through the kitchen door, she sees the refrigerator door\n          open, two sneakered feet behind it.\n\n                         MOM\n          I know you want to fight global\n          warming, Darren, but that's not the\n          way to do it.\n          Steve leans back to show his face.\n\n                         STEVE\n          Sorry, Mrs. Shan.\n\n                         MOM\n          Oh hi, Steve. I thought you were,\n          Darren.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          8.\n\n                         STEVE\n          I wish I was.\n\n                         (RE: FRIDGE)\n          You guys got everything in here.\n\n                         MOM\n          Help yourself.\n          She sets her PURSE down on the counter.\n\n                         MOM\n          How's your mother?\n\n                         STEVE\n          She's okay... She's been working a\n          lot lately.\n          A little frown of concern crosses Darren's mom. Something\n          about Steve... His mom... He brings out a bottle of soda.\n\n                         MOM\n\n                         (POINTS)\n          Glasses are up there.\n\n                         STEVE\n          I know.\n          Darren's mom exits as Steve pulls down two glasses, starts to\n          pour soda. As he waits for the foam to settle, he sees...\n          The purse. Just there. A quick look around, it doesn't take\n          him long to decide. Steve steps over, opens the purse.\n          A quick rifling finds a wallet: $200 in $20's. He peels off\n          three bills, shoves them in his pocket. BLLEEEP!\n          A cell phone starts going off in the purse. Fumbling,\n          frantic, Steve stuffs the rest of the money back in the\n          wallet, the wallet back in the purse, closes the purse --\n          Darren's Mom is back in. She's hurrying to get to her\n          celiphone, so...\n\n                         MOM\n\n                         (INTO PHONE)\n          Hello?\n          .it takes her a second to realize something's up. Not\n          listening to her call, she watches Steve grab the two glasses\n          and hurry out, leaving the soda bottle on the counter and\n          guilt in the air. As she looks over at her purse...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          9.\n\n          INT. HALLWAY - SHAN HOUSE - DAY\n\n          Steve comes up off the stairs. He sets the glasses on a hall\n          table, continues into...\n\n                         DARREN'S ROOM\n          Darren's looking through Steve's vampire memorabilia. Steve\n          reaches past, starts packing it up.\n\n                         STEVE\n          I gotta go. See ya tonight.\n\n                         DARREN\n          Huh? Tonight where?\n          He zips the bag, slings it over his shoulder.\n\n                         STEVE\n          Cirque du Freak.\n\n                         DARREN\n          I got no money right now.\n\n                         STEVE\n          Don't sweat it. I got money. Meet\n          me ten to Midnight. The Zeiterion\n          Theater.\n\n                         DARREN\n          That place is supposed to be\n          haunted.\n          Steve rolls his eyes, starts out...\n\n                         DARREN\n          What am I going to tell my parents?\n\n                         STEVE\n          Tell them you're sleeping over. We\n          can meet early, walk over together.\n\n                         DARREN\n          I don't know, man...\n\n                         STEVE\n          D, it's Cirque du Freak. You wanna\n          hear about it Monday? Or see it\n          tonight?\n          Steve lets his point sink in, then goes.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          10.\n\n          INT. KITCHEN - SHAN HOUSE - NIGHT\n\n          Darren and Annie and his mom and DAD eat dinner. Annie\n          chatters away.\n\n                         ANNIE\n          And that's why we need a dog.\n          She waits for an answer. Mom and Dad exchange a look.\n\n                         DAD\n          We'll have to think about it.\n\n                         ANNIE\n          How do you guys decide who's going\n          to say no when you look at each\n          other.\n\n                         DAD\n          Whoever's eyes are the widest. And\n          I didn't say no. Yet.\n          As she tries to think through a new approach...\n\n                         DARREN\n          Mom? I'm gonna sleep over Steve's\n          tonight? Okay?\n\n                         MOM\n          (emphatic; no hesitation)\n          No.\n\n                         DARREN\n          What? Why not?\n\n                         MOM\n          Because I said so, Darren.\n\n                         DARREN\n          I'm fourteen. I shouldn't even\n          have to ask stuff like this.\n\n                         MOM\n          The answer is no. And I'm not sure\n          I want you hanging around with\n          Steve anymore.\n\n                         DARREN\n          I've known him since I was five\n          years old!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          11.\n\n                         MOM\n          People change and I don't like the\n          way Steve's changing.\n\n                         DARREN\n          But -- That's not fair!\n\n                         DAD\n          Stop arguing with her, Darren.\n          Furious at his treatment, Darren gets up, stomps out. As\n          Annie wonders if she should ask what's up...\n\n                         CUT TO:\n\n          EXT. DARREN'S ROOM - NIGHT\n\n          The moonlight glinting off Darren's spider terrarium.\n          Darren, under the covers, gets out of bed. Fully dressed.\n          Going to his door, he listens. Then he crosses to the\n          window. Pulling out the screen, he starts to climb out.\n\n                         CUT TO:\n\n          EXT. TRELLIS - SHAN HOUSE - NIGHT\n\n          Darren out his second floor bedroom window, starts to climb\n          down via the trellis. CRACK! A section of the trellis\n          BREAKS under his feet. Darren almost falls, catches hold.\n          He pulls himself over, starts down again.\n\n                         CUT TO:\n\n          EXT. UNION STREET - NIGHT\n\n          Part of a dilapidated, mostly abandoned downtown. Noirish.\n          Darren and Steve hurry around a corner.\n\n                         STEVE\n          I came here after your house.\n          There was a van there, guy selling\n          tickets.\n          (holds up tickets)\n          Rest is history.\n          They cross toward the ornate, albeit crumbling facade of the\n          ZEITERION THEATER. Deserted, except for a few CANDLES\n          burning on the sidewalk by a door. The wind moans.\n\n                         DARREN\n          You know why they closed it, right?\n          Years ago a kid fell out of the\n          balcony and died. It's haunted.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          12.\n          Steve catches himself getting spooked. He shoves Darren.\n\n                         STEVE\n          Get inside.\n\n                         CUT TO:\n\n          INT. ZEITERION LOBBY - NIGHT\n\n          Paint peeling. The walls scribbled on. Most of all - it's\n          dark. Darren and Steve head toward a glow coming from...\n\n                         A HALLWAY\n          They move toward a light at the end. Darren pauses at a\n          darkened staircase. Headed up. He points it out to Steve...\n\n                         DARREN\n          The balcony. Where he fell...\n\n                         VOICE\n          May I help you?\n          They wheel around, react to the sight behind them. MR. TALL.\n          Gaunt, but oozing an elegant toughness.\n\n                         STEVE\n          We're here to see the show.\n          He takes an ominous step forward, then holds out a hand.\n\n          MR. TALL\n          Ticket.\n          Steve hands it over. Mr. Tall pockets it, looks to Darren.\n\n          MR. TALL\n          Do you have your ticket? Darren.\n          Darren starts to hand it over, hesitates. The guy knew his\n          name. Mr. Tall reaches, takes it.\n\n          MR. TALL\n          This way. We're about to begin.\n          Mr. Tall turns on his heel and strides off. As they follow:\n\n                         DARREN\n\n                         (LOW)\n          He knew my name.\n\n                         STEVE\n          Maybe he heard me say it.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          13.\n          Mr. Tall turns a corner, only steps ahead of them. But...\n\n                         AROUND CORNER\n          When they turn it, Mr. Tall is gone. Vanished. Ahead, a\n          threadbare velvet CURTAIN. A low murmur on the other side.\n          The boys exchange a last look, then push through into...\n\n          THE ZEITERION THEATER\n          Mouldings removed, cherubs gouged from the walls of a once\n          proud theater. Rows of seats are missing as well. Those\n          that remain are filled. The crowd seems nervous, watching\n          the empty stage expectantly. Yearning for something special.\n          No sign of Mr. Tall. Darren and Steve stand at the top of\n          the aisle. The only kids here. Somewhere off stage a\n          TRUMPET sounds and with it a stage light goes out.\n          Steve nudges Darren, points out two empty seats halfway down.\n          As they move for them, a second trumpet sounds and a second\n          stage light goes out.\n          And so on. By the time Darren and Steve take their seats,\n          the theater has gone black. A final flourish from the\n          trumpets and all is silent.\n          Then, a dull green light glows across the stage. Before it\n          was empty; now there is a CAGE, set on wheels, in the center.\n          There's the scraping of chain. A low guttural sound.\n          A white spot shines down, leaves the front half of the cage\n          in light, the back half in shadow. A FIGURE moves in there..\n          The AUDIENCE lean forward, hoping to see when there's a ROAR!\n          Several people SCREAM as the figure CRASHES to the front of\n          the cage. A WOLFMAN for lack of a better term, its body\n          covered in thick, matted hair. It roars again, shakes the\n          bars. Its half-canine teeth yellow, its eyes red. A chain\n          hangs attached to an iron collar around its neck.\n          Half the audience believe it's real. The other half are\n          amazed at how real this 'performer' seems. As they buzz, Mr.\n          Tall steps out on stage. Wearing red leather gloves and hat.\n\n          MR. TALL\n          Ladies and Gentlemen. Welcome to\n          the Cirque du Freak. We are an\n          ancient circus. We have toured for\n          five hundred years...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          14.\n          Darren and Steve exchange a look at this information.\n\n          MR. TALL\n          .Bringing the remarkable and\n          grotesque to generations. Our\n          freaks are not people in masks.\n          They are not harmless misfits.\n          What you see tonight is real. Each\n          performer unique. None harmless.\n          To prove this, the Wolfman lunges, reaches a claw through the\n          bars to swipe just centimeters short of Mr. Tall who's non-\n          reaction shows he knows exactly where he's standing.\n          A ripple goes through the crowd as they become aware of\n          TRUSKA. Startlingly beautiful. Dressed for the Moulin\n          Rouge. Crossing the stage in a languid catwalk. Several MEN\n          in the audience begin to cough and shift in their seats.\n          Even the Wolfman takes notice.\n\n          MR. TALL\n          Beauty and the beast.\n          Truska approaches the cage, makes soothing motions, her upper\n          body swaying. The Wolfman lulls to a trance.\n          Two stage hands - MIDGETS apparently, hidden by blue robes,\n          step out and start to push the cage off stage.\n          Truska steps toward the audience, moving in the same\n          languorous rhythm. And then: she begins to grow a BEARD.\n          Hairs creeping from above her lip, curling from her chin.\n          Some in the audience recoil.\n          Darren and Steve trade grins. This is great. Then...\n          From either wing of the stage come twin contortionists: SIVE\n          & SERSA. They walk on their hands, their legs pulled back\n          with their ankles cinched behind there necks.\n          As Truska exits, Sive and Sersa meet in the middle. Like\n          Hindu wrestlers they take turns, climbing up and down each\n          other, look like one person with two fronts. They twist like\n          pretzels, getting huge LAUGHS when they pretend to be stuck.\n          As it goes on, RHAMUS TWOBELLIES pads out to watch. The\n          floorboards creak under his feet. He must weigh 600 pounds.\n          After a moment, he turns, walks toward the audience. The\n          light leaves the contortionists and focuses on Rhamus.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          15.\n\n                         RHAMUS\n          My name is Rhamus Twobellies. And\n          I do have two.\n          He TRIPS, stumbles toward the edge of the stage. PEOPLE in\n          the front row jump back to keep from being crushed. Rhamus\n          stops short, LAUGHS at them. He was pretending. He's\n          practically doubled-over, resting his hands on his haunches.\n          More blue-robed MIDGETS roll out a CART covered with food and\n          lots of other stuff. Rhamus grabs a GLASS BOTTLE of soda.\n          Instead of opening it, he bites off the glass top, chews it\n          and swallows. Soon he's eating food almost as fast as he can\n          grab it. Disgusting, but great fun at the same time.\n          Next, he holds up a couple of nuts and bolts. Then swallows\n          them whole. He swings his belly around. You can hear the\n          sound of metal shifting inside.\n          The crowd recoils as he starts to regurgitate, spitting out\n          BOLTS, NAILS, BOTTLE CAPS, a JACKKNIFE. They clatter on\n          stage. Finally, a METAL LINK appears between his teeth.\n          He pinches hold of it and pulls. A CHAIN starts out of his\n          mouth, up from his belly. One foot...two...six feet in all.\n          With a shrug he starts off stage, dragging it behind him.\n          Darren & Steve break into applause. So does the audience.\n          As Rhamus' chain slides out of sight, a SNAKE slides in. An\n          enormous BOA CONSTRICTOR. Impossibly huge. It slithers out\n          to the center of the stage, its tongue flicking in and out.\n          A SPOTLIGHT flicks down from above. The snake stops, raises\n          itself several feet off the ground as it looks up, seemingly\n          transfixed by the light. But in reality...\n          The end of a thick ROPE drops down. And moving (headfirst!)\n          down the rope is a BOY. Very thin, his blonde hair tinged\n          with green. This is EVRA VON. He moves smoothly, twists\n          over backwards to set his feet down on the stage.\n          Evra wears a sort of cloak which he suddenly spins out of.\n          The audience GASPS... Wearing only shorts, Evra's body\n          SPARKLES. He's covered in gold, blue and green scales!\n          He moves a vaguely webbed hand through the air, charming the\n          snake which raises itself higher still. He slowly slides\n          forward till he and the boa are nearly eye-to-eye.\n          Then Evra leans forward and KISSES the snake on the nose.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          16.\n\n                         DARREN & STEVE\n\n                         DARREN\n          He's as old as us.\n\n                         STAGE\n          Evra starts to make a HISSING sound. In response, the snake\n          begins corkscrewing around him like the stripes on a barber\n          shop pole. Finally, it slithers around his neck, pulls back\n          to look him in the eye. And then...\n          Evra bends at the knees, lays down and starts to roll. Like\n          he was wrapped in a snake carpet, he disappears stage left.\n          More applause from the audience.\n          Then the stage goes dark except for a small focused spot at\n          the center. Everyone waits, but nothing happens until...\n          Appearing literally out of nowhere - one instant there's\n          nothing under the spot and the next instant there is --\n\n          LARTEN CREPSLEY!\n          Motionless, looking past the crowd. The only difference from\n          his pictures is he's a bit older and a SCAR runs down his\n          left cheek. It stretches his mouth up on that side.\n\n                         DARREN & STEVE\n          Recognize him. Can't believe their eyes. Steve pulls the\n          print-out from his pocket, compares.\n\n                         DARREN\n          It's him...\n\n                         STAGE\n          Crepsley disappears! The crowd mumble nervously. And just\n          as suddenly he's back! On the edge of the stage, lit by the\n          footlights. This time he holds a draped BIRDCAGE.\n\n                         CREPSLEY\n          It's not true. That all tarantulas\n          are poisonous. Though some can\n          kill a man. With one bite.\n          Crepsley whisks off the covering. In the cage: a TARANTULA\n          the size of a large man's hand. So big you can make out\n          individual eyes. As deadly looking as it is beautiful.\n\n                         DARREN\n          Reacts. A spider!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          17.\n\n                         STAGE\n          Crepsley makes the introduction.\n\n                         CREPSLEY\n          Her name? Madam Octa. Pray that\n          she never learns yours.\n          Two of the blue-robed 'little people' lead a GOAT onto the\n          stage. A ripple of worry runs through the crowd. Crepsley\n          starts over. The goat BLEATS. The little people hold it.\n          Mr. Crepsley flicks open the cage door with his finger. The\n          spider sets its front legs on the bars, pulls itself through.\n          A few gasps from the audience. The goat bucks.\n          Madam Octa bares her fangs, poised to leap on her prey.\n          Several audience members CRY OUT that this should stop.\n          Crepsley looks out with mock-theatrical surprise.\n\n                         CREPSLEY\n          No...? Shall it be life?\n          Chuckling to himself, he looks to the goat tenders. They\n          release the goat which bee-lines its way off the stage.\n          Crepsley faces the audience.\n\n                         CREPSLEY\n          I wonder if you would be as shocked\n          to see the same fate for me?\n          Madam Octa moves -- climbing the outside of the cage --\n          taking a cautious step onto the hand holding the cage, then\n          starting up Crepsley's arm. He stands dead still.\n\n                         DARREN & STEVE\n          Have a million questions, but right now the performance has\n          their full edge-of-their-seat attention.\n\n                         STAGE\n          Madam Octa has nearly reached Crepsley's left shoulder.\n\n                         CREPSLEY\n          Though we have been together such a\n          long time, she is no pet. I think\n          she would quite enjoy killing me.\n          Crepsley calmly raises his free hand. It holds a shiny TIN\n          WHISTLE. Madam Octa has reaches his shoulder.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          18.\n\n                         CREPSLEY\n          For her bite there is no cure.\n          Madam Octa bares her fangs, even longer now. Her malevolence\n          about to be directed at her master.\n          Crepsley carefully puts the whistle to his mouth and starts\n          to play, as simple as it is evocative.\n          Madam Octa hesitates. Then, she moves around his throat,\n          starts to climb his face using his scar as her guide. She\n          gets to the top of his head, stands in his shock of hair.\n          She sways; she's dancing!\n          Then she leaps, lands on the end of the whistle. Crepsley\n          keeps playing as Madam Octa attaches a web, drops down about\n          18 inches off the end. She starts to swing.\n          Crepsley takes the whistle from his mouth and twirls it\n          around. Octa does a few 360s and the thread breaks. She\n          sails up high over Crepsley's head.\n          He cranes back to watch as down she comes, legs splayed. She\n          lands flat on his face. The whistle is in his hand.\n          Crepsley looks out at the audience. Looking out between her\n          hairy legs, his eyes are wide with horror.\n          Without warning, the spotlight on him goes out. As the stage\n          is plunged into darkness, we hear Crepsley SCREAM.\n          A horrible, horrible sound. The audience wait, but nothing\n          happens. Some of them rise from their seats, peer into the\n          gloom. It's too dark.\n          The sound of something being DRAGGED. Then nothing. A light\n          comes up stage left as Mr. Tall steps out.\n\n          MR. TALL\n          Thank you, ladies and gentlemen.\n          That is the end of our show.\n\n                         AUDIENCE MAN\n          But... What happened to him?!\n\n          MR. TALL\n          Don't you know? What happens to us\n          all, can happen to any of us.\n          That said, there's a crack of thunder and an explosion\n          seemingly at Mr. Tall's feet. He's nowhere to be seen.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          19.\n          The houselights come up. The stage is empty. Some in the\n          audience start to clap. Others are a bit dismayed.\n          Darren and Steve sit there as people start for the exits.\n\n                         DARREN\n          Let's get outta here.\n\n                         STEVE\n          No, you go. I'm staying.\n          Steve starts down toward the stage. Darren follows.\n\n                         DARREN\n          Wait. What're you doing?\n          Steve reaches the stage, looks around. The audience is\n          mostly exited; no one from the Cirque is in sight.\n          As Steve starts up onto the stage, Darren grabs his shoulder.\n          Steve wheels, shoves Darren who stumbles back into a seat.\n\n                         STEVE\n          This is my destiny. Don't ruin it.\n          Steve looks dangerous as he looms. Darren raises his hands\n          in surrender. Steve eases off, but he's still intense.\n\n                         STEVE\n          That car today. It was a sign.\n          Sending me here. I was told\n          there'd be a sign.\n          Too friggin' weird.\n\n                         DARREN\n          Told by who? The guy in the chat\n          room? The internet guy?\n\n                         STEVE\n          I'll tell you later. If I can.\n          Steve scrambles onto the stage and disappears into the back.\n          Darren stands, whispers into the dark.\n\n                         DARREN\n          Steve...\n          Decision time. Darren climbs up, starts after his friend.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          20.\n\n          INT. ZEITERION THEATER - BACKSTAGE - NIGHT\n\n          Darren moves back into the gloom. Deserted, the junk casts\n          sinister shadows. Then, a sound at his feet. Darren stops\n          short. Sees that he's almost walked into an open stage DOOR\n          IN THE FLOOR. The sound is someone moving below.\n\n                         DARREN\n          Steve...?\n          No answer. Darren decides, starts down steep, rickety steps.\n\n                         CUT TO:\n\n          STEVE - UNDERSTAGE STORAGE AREA\n          He moves past a dilapidated stage elevator. Stumbles. As he\n          heads further into the dark.\n\n                         DARREN\n          Coming down the creaky stairs. Spooky.\n\n                         DARREN\n          Steve...\n\n                         CUT TO:\n\n                         STEVE\n          Turning a corner, is startled by what turns out to be a\n          costume mannequin. But beyond: a LONG BOX set on two\n          sawhorses. Coffin-sized. Empty, its lid propped up by it.\n          The dust is tracked with footsteps. A mini-FRIDGE hums in a\n          corner. Steve steps over, sees an EXTENSION CORD which runs\n          up the wall, disappears into a hole punched in the ceiling.\n\n                         DARREN\n          Stops short as a LIGHT suddenly cuts through the gloom to his\n          left. Darren steps over low behind a CREDENZA. He sees...\n\n                         STEVE\n          He's opened the door to the fridge. The little bulb inside\n          pushes through the gloom, lighting the area up.\n\n                         DARREN\n          Reacts as MADAM OCTA tries to jump on his face! The bars of\n          her CAGE stop her. It rests on the credenza he crouches\n          behind. The whistle is there too. Darren looks over as...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          21.\n\n                         STEVE\n          Reaches in the fridge, takes out a glass jar that looks to be\n          filled with BLOOD. Steve raises it, swirls it around inside.\n\n                         CREPSLEY'S VOICE\n          Are you looking for me?\n          Steve whirls -- drops the bottle -- SMASH!\n          Standing behind him - dead still - CREPSLEY.\n\n                         DARREN\n          Rooted to the spot. Watching...\n\n                         STEVE & CREPSLEY\n          Crespley sniffs the air - the spilled blood to be exact.\n\n                         STEVE\n          I -- I know who you are.\n\n                         CREPSLEY\n          Tell me, boy. Who am I?\n\n                         STEVE\n          You're a vampire.\n\n                         CREPSLEY\n          Too broad a definition. Do you\n          introduce yourself as a human? Who\n          I am is Larten Crepsley.\n\n                         DARREN\n          Moving slightly to get a clearer view.\n\n                         STEVE & CREPSLEY\n          Crepsley suddenly DISAPPEARS, REAPPEARS much closer. Steve\n          jumps, twists around. Unnerved.\n\n                         CREPSLEY\n          Who sent you and what do they want?\n\n                         STEVE\n          Nothing. No one.\n          Crepsley takes a moment to decide if he believes him.\n\n                         CREPSLEY\n          Then what do you want?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          22.\n\n                         STEVE\n          I want to join you.\n\n                         CREPSLEY\n          Join me? I don't understand.\n\n                         STEVE\n          I want you to make me a vampire.\n          Not what Crepsley (or Darren) expected. Steve stands there\n          trying to look resolved. Crepsley is surprised, intrigued.\n\n                         CREPSLEY\n          Is it because you want to live\n          forever? Because we don't.\n\n                         STEVE\n          I don't care about living forever.\n          But you do seem to live a long\n          time.\n\n                         CREPSLEY\n          A long time alone. Do you want to\n          live alone?\n\n                         STEVE\n          I already do.\n\n                         CREPSLEY\n          Are you an orphan?\n\n                         STEVE\n          My father's gone; my mother doesn't\n          care about me.\n\n                         CREPSLEY\n          Nor mine. You're friendless also?\n\n                         STEVE\n          I have a friend, but he doesn't\n          understand. He's got too much to\n          know what it's like to be alone.\n          As Darren reacts to this...\n\n                         STEVE\n          When you're alone you feel weak.\n          Useless. But I know there must be\n          something strong about it, too. I\n          want to feel the power of being\n          alone. I want to be a vampire.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          23.\n\n                         CREPSLEY\n          The power of being alone will never\n          be greater than the weakness of it.\n\n                         STEVE\n          I don't care.\n          Crepsley's actually impressed, but after a moment he waves a\n          dismissive hand.\n\n                         CREPSLEY\n          It makes no matter. We do not\n          blood children. I'm sorry.\n          Steve pulls a JACKKNIFE from his pocket, flips open the 2-\n          inch blade. Crepsley laughs out loud.\n\n                         CREPSLEY\n          Do you intend to use that on me?\n          And we feel it more than see it, but Steve cuts into his own\n          palm. He holds it up, moist and red in Crepsley's face.\n\n                         STEVE\n          Do it. Make me a vampire.\n\n                         CREPSLEY\n          Do not tempt me.\n\n                         DARREN\n          Can't believe what he's watching. He sees Crepsley suddenly\n          get 'scent' of something. Something to do with Steve's\n          blood. Not quite a clear view as Crepsley grabs Steve's\n          wrist, dabs a finger into his palm and then tastes it.\n\n                         CREPSLEY\n          Crepsley shoves Steve down to the ground and immediately\n          begins spitting onto the floor. Like it was poison.\n\n                         STEVE\n          What's wrong?\n\n                         CREPSLEY\n          You have bad blood.\n\n                         STEVE\n          What do you mean?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          24.\n\n                         CREPSLEY\n          I can taste the menace in your\n          blood. You can never be a vampire.\n          You're evil.\n          Steve scrambles to his feet.\n\n                         STEVE\n          That's a lie. You take that back!\n          Crepsley draws himself full, his voice deadly.\n\n                         CREPSLEY\n          Go home.\n          Suddenly cowed, Steve just stands there blinking.\n\n                         CREPSLEY\n\n          GO!\n          Steve runs, disappears into the gloom. After a moment, we\n          can hear him scurrying up the stairs. Then he's gone.\n\n                         DARREN\n          Frozen to his spot, watches as Crepsley, seemingly ill, holds\n          his head and spits again onto the floor. Then he steps over\n          and kicks the fridge door closed.\n          And in the blink of an eye, he's gone. Disappeared.\n          Darren is alone. He starts out, then stops. Looks back.\n          That beautiful spider. And Darren takes Madam Octa's cage\n          and the whistle and makes a run for it. Just like that.\n\n                         CUT TO:\n\n          EXT. STREETS - DARREN'S NEIGHBORHOOD - NIGHT\n\n          3 AM. Dead quiet. Darren hurries home, cage in hand.\n          Looking over his shoulder. So far so good. He nearly trips\n          over an untied shoelace. He sets down the cage, to tie it.\n          Madam Octa lunges across her cage at a WORM on the sidewalk.\n\n                         DARREN\n          Oh. You want that?\n          Darren picks up the worm, lowers it between the bars. A beat\n          and then Madam Octa snatches it away from him. Dinner.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          25.\n\n                         DARREN\n          See? I'm your friend... You're so\n          beautiful I stopped thinking.\n          The wind rustles. Darren grabs the cage, continues.\n\n                         CUT TO:\n\n          EXT. THE SHAN HOUSE - NIGHT\n\n          The house dark. Holding the cage with one hand, Darren\n          starts climbing the side of the house using the other. He\n          avoids the broken section, but as he reaches the window:\n          His Dad is standing there looking out. Busted.\n\n                         DAD\n          Get inside.\n          From his angle, Darren's Dad can't see the cage in his son's\n          hand. Darren hooks it over the end piece of part of the\n          trellis and climbs in. Leaving the cage hanging behind.\n\n                         CUT TO:\n\n          INT. DARREN'S BEDROOM - NIGHT\n\n          Darren stands across from his Dad.\n\n                         DAD\n          A freak show? Are you kidding me?\n\n                         DARREN\n          It was down at the old Zeiterion\n          Theater. Look, dad, I'm sorry.\n          It's just, I couldn't resist. I --\n\n                         DAD\n          You told me the other day you were\n          broke. You were looking for a job\n          to do around the house this\n          weekend.\n\n                         DARREN\n          Yeah? So?\n\n                         DAD\n          Where'd you get money for the show?\n\n                         DARREN\n          Steve had money.\n          Darren's Dad's suspicion is confirmed.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          26.\n\n                         DAD\n          Steve... We weren't going to tell\n          you, but we think Steve stole money\n          from your Mom's purse yesterday.\n\n                         DARREN\n          He wouldn't do that.\n\n                         DAD\n          Mom's pretty sure about it.\n\n                         DARREN\n          Man, what is this? You don't want\n          me hanging around with him. Now\n          you say you think he stole money?\n          Do you know for sure?\n\n                         DAD\n          No.\n\n                         DARREN\n          Steve's had some bad times lately.\n          I'm trying to be a good friend.\n\n                         DAD\n          Being a good friend and sneaking\n          out are two different things.\n\n                         DARREN\n          I have to sneak out! You treat me\n          like a kid!\n          A moment as Darren's raised voice rings out of the room.\n\n                         DAD\n          Then act like an adult if that's\n          how you want to be treated. This\n          world is crossed by fences --\n          Darren interrupts. He's heard it a million times.\n\n                         DARKEN\n          I know, I know. And you gotta\n          decide which side you stand on.\n          And you can't sit on it either.\n          His Dad doesn't enjoy hearing his words thrown back at him.\n          He starts for the door, looks back before exiting.\n\n                         DAD\n          A freak show. What do they do, put\n          people in cages for everyone to\n          laugh at?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          27.\n          Darren feels bad, like a kid. He looks down at the floor.\n\n                         DARREN\n          It wasn't like that.\n          A beat. Darren's Dad goes, closing the door. Darren sighs.\n          He goes to the window, pulls up the cage. He scans a look\n          outside. Except for his Dad, the coast is clear.\n\n                         CUT TO:\n\n          INT. CLOSET - DARREN'S BEDROOM - NIGHT\n\n          Darren sets the cage on a shelf, shuts the door. Black.\n\n                         CUT TO:\n\n          INT. KITCHEN - SHAN HOUSE - MORNING\n\n          Darren's Mom making omelettes. Darren's DAD helping, dicing\n          up some ham. Annie sits at the table awaiting the results.\n\n                         ANNIE\n          Is he in a lot of trouble?\n\n                         DAD\n          Nothing a few years in prison won't\n          take care of.\n\n                         ANNIE\n          I don't see what the big deal is...\n\n                         DAD\n\n                         (TO MOM)\n          Did you talk to Steve's mom yet?\n\n                         MOM\n          Get this. She said she couldn't\n          comment because she didn't make it\n          home last night herself.\n\n                         ANNIE\n          Where was she?\n\n                         MOM\n          Go tell Darren it's breakfast.\n\n                         CUT TO:\n\n          MADAM OCTA - VIDEO VIEW\n          Seen through the bars of her cage. FREEZE FRAME.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          28.\n\n                         DARREN'S ROOM\n          Darren's just snapped her photo with his DIGITAL CAMERA.\n          As the door bursts open and Annie enters... Darren scrambles\n          to block the cage from view.\n\n                         DARREN\n          Annie, you gotta learn to knock.\n\n                         ANNIE\n          Mom said to come eat. What's that?\n          As Annie tries to look, Darren stays in front of her.\n\n                         DARREN\n          Out.\n          Annie sighs, heads out. Darren puts the cage in the closet.\n\n                         CUT TO:\n\n          INT. KITCHEN - SHAN HOUSE - DAY\n\n          Darren arrives, sits as everyone pretends not to notice. His\n          mom slides his omelette off the pan into his plate. Annie\n          watches everyone's every move. Darren eats a bite.\n\n                         DARREN\n          Mom, this is the best omelette I\n          ever had.\n          His Dad can't help but smile. Good move. Mom is pleased,\n          but knows she's being manipulated. As Annie stifles a laugh,\n          Darren shoots her a look.\n          A KNOCK at the kitchen door. Annie gets up, opens the door\n          to reveal: Steve. From his angle he can only sees Annie.\n\n                         STEVE\n          Hey, midget, where's the idiot?\n          Annie motions Steve in. He stops short when he see everyone\n          else. He recovers, does his best Eddie Haskell...\n\n                         STEVE\n          Hi, Mr. Shan, Mrs. Shan. It's nice\n          to see ya.\n          As Steve gets several less than welcoming looks...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          29.\n\n          INT. DARREN'S ROOM - DAY\n\n          Darren and Steve enter his bedroom.\n\n                         STEVE\n          What was that? Everyone acting\n          like they don't know me. Did I\n          walk in on something?\n          Darren closes the door. Gets to the point.\n\n                         DARREN\n          What happened last night?\n\n                         STEVE\n          Nothing. I hung out in the theater\n          for awhile, but no one was around.\n          The lie hangs in the air a moment.\n\n                         STEVE\n          Sorry about the way I acted. I'm\n          sorry I pushed you.\n\n                         DARREN\n          Don't worry. There's, you know, no\n          bad blood or anything like that.\n\n                         STEVE\n          What?\n\n                         DARREN\n          I said don't worry.\n\n                         STEVE\n          You said bad blood. I never heard\n          you say something like that before.\n\n                         DARREN\n          What are you, the word police?\n          Steve gives him a look. A weird tension in the air. Darren\n          glances at the bandage on Steve's palm, changes the topic.\n\n                         DARREN\n          Wanna see that new game I got?\n\n                         STEVE\n          Sure...\n          Darren steps over, starts his computer up. While waiting,\n          Steve sees the digital camera on the dresser, picks it up.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          30.\n\n                         STEVE\n          I gotta get one of these.\n          Steve switches it on. Something occurs to Darren too late...\n\n                         DARREN\n          Let me see that --\n          On the screen: the PHOTO OF MADAM OCTA. Steve twists around\n          to keep the camera out of Darren's reach.\n\n                         STEVE\n          It's Madam Octa.\n\n                         DARREN\n          I took it at the show.\n\n                         STEVE\n          Liar. Look at the background.\n          This got taken right on your desk.\n          Darren's caught. As they just stare at each other.\n\n                         CUT TO:\n\n                         MADAM OCTA\n          In her cage, on the desk. Darren and Steve looking her over.\n\n                         STEVE\n          How'd you do it?\n\n                         DARREN\n          They were loading a van outside.\n          I, I just took her.\n\n                         STEVE\n          Just like that...\n          (after a look)\n          You stole from a vampire you know?\n\n                         DARREN\n          Just because he had a coffin\n          doesn't mean he's really a...\n          Darren trails off. Steve realizes Darren saw the coffin.\n\n                         STEVE\n          You were there, weren't you?\n\n                         (NO ANSWER)\n          You heard what he said to me? That\n          I was evil?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          31.\n\n                         DARREN\n          I didn't believe it.\n          Steve studies Darren, hopes that's true.\n\n                         DARREN\n          I heard what you said to him, too.\n          That you wanted to be a vampire.\n          Steve doesn't want to talk about it. He looks at Madam Octa.\n\n                         STEVE\n          How do you think he made her do\n          what he wanted?\n          Darren opens his desk drawer, pulls out the flute.\n\n                         DARREN\n          I wish I knew how to play it.\n\n                         STEVE\n          I think that was just for show. I\n          think he used something else. Some\n          kind of mind control.\n\n                         DARREN\n          You mean telepathy?\n\n                         STEVE\n          I bet anyone with a brain could do\n          it. Which leaves you out.\n          Steve smiles, gives Darren a little punch in the arm. The\n          tension is loosening. They react to a KNOCK on the door.\n\n                         ANNIE'S VOICE\n          Can I come in?\n          Darren goes to the door. Opens it a few inches.\n\n                         DARREN\n          I swear to God, Annie...\n\n                         ANNIE\n          What? I knocked.\n          As they talk, Steve opens the cage door. Madam Octa sets her\n          arms on the edge, pulls herself out.\n\n                         LEAPS --\n          Lands on Steve's shoulder. Her fangs, wet with poison, glint\n          just before she sinks them into Steve's throat. She BITES!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          32.\n          Steve surges upward, his shout dying in his throat. He\n          stiffens, eyes snapped wide, and then crumples to the floor.\n          Darren and Annie react as --\n          Madam Octa scurries off, disappears behind the curtain.\n\n                         DARREN\n\n                         (TO ANNIE)\n          Don't move.\n          Annie freezes. Darren grabs a BASEBALL BAT which leans in\n          the corner. He reaches out, pokes at the curtain with it.\n          Madam Octa drops down onto the window sill -- WHAM! Wood\n          cracks as Darren brings down the bat, but Madam Octa is too\n          quick. She disappears, leaping out the open window!\n          Darren pulls it shut. He rushes back to Steve, turns him\n          over. Steve's skin is already a deathly pale.\n\n                         DARREN\n          Steve...\n          Annie reaches out, takes Steve's hand.\n\n                         ANNIE\n          Darren, he's freezing.\n\n                         DARREN\n          Get dad. Go.\n\n                         CUT TO:\n\n          INT. EMERGENCY ROOM - DAY\n\n          Hospital doors BANG OPEN as a gurney bearing Steve is rushed\n          through. Darren and his Dad follow with a DOCTOR.\n\n                         DOCTOR\n          What kind of spider was it?\n\n                         DARREN\n          I think some kind of a tarantula.\n\n                         DOCTOR\n          Where is it?\n\n                         DARREN\n          It got away.\n          Darren's Dad holds up the camera.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          33.\n\n                         DAD\n          We have a picture of it.\n          The doctor takes it as a NURSE meets the gurney.\n\n                         DOCTOR\n          Anaphylactic shock. Get Doctor\n          Lund. And we need to download a\n          photo to poison control.\n          This is as far as Darren goes. Steve is wheeled in,\n          surrounded. Syringes are drawn, handed in. All we can see\n          of Steve is one skinny arm hanging out.\n          PUSH IN ON DARREN. Sick for Steve. Scared. Unaware that\n          his world has only just started to crash down around him.\n\n                         CUT TO:\n\n          DR. LUND - HOSPITAL CORRIDOR\n          Tough, no nonsense. Marching along, carrying a print-out,\n          coming to a stop where Darren sits on a plastic chair. He\n          sticks the print-out into his face. The PHOTO of Madam Octa.\n\n          DR. LUND\n          How did you make this and why would\n          you make this?\n          Darren's Mom and Dad start over from down the corridor.\n\n          DR. LUND\n          Poison control couldn't ID it. In\n          fact, the department of Entomology\n          at Harvard couldn't find it in\n          their data base. So either it's a\n          new species or it's a fake photo.\n\n                         DAD\n          If my son said he took that photo,\n          then that's the truth.\n          Dr. Lund just stares at Darren. Then:\n\n                         WOMAN'S VOICE\n          What have you done to him?!\n          STEVE'S MOM approaches, her eyes on Darren. Disheveled,\n          cheap looking, she hasn't quite started her hangover yet.\n          She lunges past Darren's dad, grabs Darren by the shoulder.\n\n                         STEVE'S MOM\n          Did you hurt Stevie?! Did you?!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          34.\n          She shakes Darren hard. Darren's Dad gets between them. She\n          breaks down, sobbing. Darren's mom tries to soothe her as\n          she moans about what a bad mother she is.\n\n          DR. LUND\n          Your friend's going to die unless\n          we find out what's in him.\n          On Darren. He looks down to where light spills out from\n          Steve's room. His friend is going to die in there.\n\n          MATCH CUT TO:\n\n          INT. DARREN'S ROOM - NIGHT\n\n          Darren as he lays in bed, staring at the ceiling. His clock\n          switches to 2:58 AM. Deciding, Darren gets out of bed.\n\n                         CUT TO:\n\n          EXT. SHAN HOUSE - NIGHT\n\n          Dressed, Darren climbs out the window, starts down.\n\n                         CUT TO:\n\n          EXT. ZEITERION THEATER - NIGHT\n\n          Dead lonely as Darren approaches, steps up to the glass door.\n          As he leans in to look into the lobby, the door gives a\n          little. It's unlocked. Darren pushes it open with a finger.\n\n                         CUT TO:\n\n          INT. UNDERSTAGE STORAGE AREA - ZEITERION - NIGHT\n\n          Darren's by the credenza where he hid. The coffin is gone.\n\n                         DARREN\n          Hello?\n\n                         CUT TO:\n\n          INT. BACKSTAGE AREA - NIGHT\n\n          MOVE WITH DARREN who comes up from below and crosses. Stay\n          with him as he parts the curtains and comes out on the...\n\n                         ZEITERION STAGE\n          Where he stops short, sees in the center of the stage --\n          Crepsley's COFFIN. A beat and Darren steps up. He grips the\n          lid, starts sliding it back. He looks inside to see --\n\n                         \n\n                         \n\n                         \n\n                         \n\n          35.\n          Madam Octa perched on the side, staring back at him!\n          Darren stumbles back. The coffin lid SLAMS to the stage as\n          Darren loses his footing, lands on his butt. And then --\n          APPLAUSE. One pair of hands create a hollow echo.\n          Crepsley sits alone in the middle of the theater. Clapping.\n          And then he's gone! Only to reappear over Darren, offering a\n          hand up. Darren scrambles to his feet. A beat.\n\n                         CREPSLEY\n          What have you come for this time?\n          Darren pulls out a CRUCIFIX, holds it in Crepsley's face.\n          The vampire takes it, looks it over. It has no effect.\n\n                         DARREN\n          Crosses don't hurt you?\n\n                         CREPSLEY\n          Why should they?\n\n                         DARREN\n          Because... you're evil.\n\n                         CREPSLEY\n          Am I? Are vampire bats evil when\n          they drink the blood of cows?\n\n                         DARREN\n          That's different. Bats are animals.\n\n                         CREPSLEY\n          So am I. So are you. Our\n          appetites don't make us evil.\n          (as Darren ponders...)\n          Why are you here?\n\n                         DARREN\n          Your spider bit my friend Steve.\n          Crepsley shrugs, tosses Darren back his crucifix.\n\n                         DARREN\n          He's dying.\n\n                         CREPSLEY\n          Yes, well, boys who play with\n          things they do not understand can\n          hardly complain if --\n\n                         \n\n                         \n\n                         \n\n                         \n\n          36.\n\n                         DARREN\n          You have to help him!\n\n                         CREPSLEY\n          The antidote to her poison is rare.\n          Expensive. Why should someone as\n          evil as I am waste it on Steve?\n\n                         DARREN\n          I'll pay you back. If it takes 50\n          years. Whatever it costs.\n\n                         CREPSLEY\n          Money doesn't interest me.\n\n                         DARREN\n          There's something you want. That's\n          why you're here waiting for me.\n          Right?\n          Crepsley's surprised and pleased by Darren's intuitiveness.\n\n                         CREPSLEY\n          The night Steve came below to speak\n          to me, you were there. Did you\n          hear what we talked about?\n\n                         DARREN\n          He wanted to... become like you.\n\n                         CREPSLEY\n          You don't just 'become' a vampire.\n          The change is too extreme. And if\n          the shock didn't kill you, your\n          inexperience would. So you become\n          one in stages. A half-vampire at\n          first. With greater strength than\n          a human, but still able to go out\n          in sunlight. You learn from a full\n          vampire. Do you understand?\n\n                         DARREN\n          I think so...\n\n                         CREPSLEY\n          But your friend has bad blood.\n          He's no good. There's no telling\n          what he'll become as he matures.\n\n                         DARREN\n          I don't believe that someone can\n          have bad blood.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          37.\n\n                         CREPSLEY\n          And yesterday you didn't believe in\n          vampires. Regardless, I've left\n          the Cirque. Left my protection. I\n          need someone to protect me while I\n          sleep. I need an apprentice.\n\n                         DARREN\n\n                         (SUDDENLY REALIZES)\n          Me?\n          Crepsley nods.\n\n                         DARREN\n          You're crazy. There's no way.\n\n                         CREPSLEY\n          Then your friend will die.\n          The words hang in the air. Crepsley smiles.\n\n                         CREPSLEY\n          You hardly have a choice. It's\n          your destiny.\n\n                         DARREN\n          Destiny? That doesn't make sense.\n\n                         CREPSLEY\n          Try this then. You're reckless\n          enough to steal, responsible enough\n          to come back for a friend. That's\n          enough for me.\n\n                         DARREN\n          Not for me.\n\n                         CREPSLEY\n          Yes, well, destiny can't be\n          explained. It must be lived. Now,\n          you're wasting my time.\n\n                         DARREN\n          There's gotta be another way.\n\n                         CREPSLEY\n          There isn't.\n\n                         DARREN\n          Please... He's my friend.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          38.\n\n                         CREPSLEY\n          And he slips away while we argue.\n          Life or death? Yes or no?\n\n                         DARREN\n          You'd never be able to trust me.\n          If I got a chance for payback I'd\n          take it.\n\n                         CREPSLEY\n          Yes or no?\n          Thoughts rush, then stop. Darren finally just nods.\n          Crepsley raises his right hand. The nails are not especially\n          long, but they look thick and sharp.\n          Crepsley takes Darren's hand, jabs at his forefinger, draws\n          blood. He dabs off a drop, smells it, then tastes it.\n\n                         CREPSLEY\n          You have good blood.\n          Crepsley lifts his own left hand. He presses the nails of\n          his right into the fleshy tips of his left hand fingers.\n          Then he uses the left nails to mark the right fingers in the\n          same way. Blood drips down all ten fingers.\n\n                         CREPSLEY\n          Lift your hands.\n          Darren does as he's told. Crepsley digs all ten nails into\n          all ten of Darren's fingertips. Darren jerks back in pain.\n\n                         CREPSLEY\n          Get used to pain. More lies ahead.\n          He motions to his hands. Darren raises them, fingers spread.\n          Crepsley presses his fingertips to Darren's. Blood brothers.\n          As their eyes lock, Darren frowns at an alien sensation.\n\n                         CREPSLEY\n          The blood flows into your left arm\n          and out of your right. Do you feel\n          it? Getting near your heart?\n          Darren nods, shivers.\n\n                         CREPSLEY\n          Almost there.\n          A force arcs through Darren's body. He screams, falls down.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          39.\n          Crepsley turns away, starts to lick the blood from his\n          fingertips. Tries to block out Darren's soft whimpering.\n          Tries to block out any sympathy he feels.\n\n                         CREPSLEY\n          The world will start to slow down.\n          You'll become a witness of time.\n          (snaps out of it)\n          Your friend's time is running out.\n          He pulls Darren to his feet.\n\n                         CUT TO:\n\n          EXT. ZEITERION THEATER - NIGHT\n\n          They step out into the moonlight. Darren a little wobbly.\n\n                         CREPSLEY\n          Take my arm. Don't let go.\n          Darren takes hold. Crepsley starts to move. Only it seems\n          more like he's still and the ground is moving under his feet.\n          Darren looks about as the building begin to streak past, the\n          road a blurred ribbon. The night has a weird chromatic look.\n          The world moving faster, Crepsley and Darren slipping past.\n          A moment later and they're in the...\n\n          HOSPITAL PARKING LOT\n          Crepsley pulls loose Darren's hand. They're still bleeding.\n\n                         CREPSLEY\n          Lick your fingers. Vampire spit\n          will stop wounds from bleeding.\n          Darren looks at his fingers, then around the lot.\n\n                         DARREN\n          How'd we get here?\n\n                         CREPSLEY\n          It's called flitting. Which room\n          is your friend in?\n\n                         CUT TO:\n\n          INT. HOSPITAL - STEVE'S ROOM - NIGHT\n\n          Tubes run in and out of Steve. His breathing is labored.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          40.\n          Crepsley leans over him, rolls up one of Steve's eyelids.\n          Darren watches as Crespley looks into Steve's eye.\n\n                         CREPSLEY\n          We're in time. He still has a few\n          minutes left.\n          Crepsley takes a small AMBER VIAL from his pocket. He breaks\n          a wax seal then pinches out a small blackened cork.\n          He pulls the drip line out of the IV CATHETER and empties a\n          drop of the vial's dark, viscous contents inside. It swirls\n          murkily, coloring the liquid on its way into Steve's arm.\n          A beat and then Steve seems to convulse, his arms and legs\n          twitching. Is he dying?\n\n                         DARREN\n          What's happening?\n\n                         CREPSLEY\n          He was near death. The journey\n          back is not pleasant. What do you\n          know about him, this boy with bad\n          blood?\n\n                         DARREN\n          He's my friend.\n\n                         CREPSLEY\n          Hmm... Who's his father?\n\n                         DARREN\n          Never met him. I don't think Steve\n          ever did either. Why do you want\n          to know?\n          And then Steve comes around. He opens his eyes, focuses on\n          Darren for a moment. He looks puzzled.\n\n                         STEVE\n          Darren?\n          And then he drifts off, asleep. His breathing growing\n          deeper, steadier. Darren realizing he's going to be okay.\n\n                         CREPSLEY\n          Will you come with me now or do you\n          have things to set in order first?\n          That's when it really hits home. He's agreed to leave every-\n          thing and go off with a vampire. Without really thinking,\n          Darren starts backing toward the door, his eyes on Crepsley.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          41.\n\n                         CREPSLEY\n          I see...\n          Darren's almost to the door. Crepsley stays where he is.\n\n                         CREPSLEY\n          Run if you want. It won't help.\n          You're a creature of the night now,\n          Darren Shan.\n          Darren turns and bolts leaving Crepsley alone. Chuckling,\n          the vampire tucks Steve's covers up under his chin.\n\n                         CUT TO:\n\n          EXT. HOSPITAL DOORS - NIGHT\n\n          BURSTING OPEN as Darren charges out. Running for his life.\n\n                         CUT TO:\n\n          INT. DARREN'S ROOM - MORNING\n\n          Darren asleep in his bed. The door opens and his mom enters.\n\n                         MOM\n          Darren... Wake up, honey.\n          Darren wakes with a start as she gives him a little shake.\n          As he looks about, wonders what reality he's in.\n\n                         MOM\n          I just got off the phone. Great\n          news. Steve's going to be okay.\n\n                         DARREN\n          What?\n\n                         MOM\n          The hospital says it's a miracle.\n          Was it a dream? Darren looks down at his hands. On the tip\n          of each finger and two thumbs are small round WHITE SCARS.\n          Darren instinctively hugs his mom. She thinks he's\n          overjoyed, can't see his look of terror. She hugs him back.\n\n                         MOM\n          Yeah, it's great news. I know how\n          you feel.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          42.\n\n          EXT. THE SHAN HOUSE - DAY\n\n          The door opens and Darren steps out. He takes a long look up\n          and down the street. Nervous. Then he see the sun up in the\n          sky. Relaxes a little. Right... Vampires... Sun.\n          He takes a step down the stairs when... From out of the\n          bushes... SOMEONE LEAPS!\n\n                         ANNIE\n          Boo!\n          Darren nearly jumps out of his skin. Annie laughs.\n\n                         ANNIE\n          Got you! I finally got you! -\n          Darren turns on her, looks like he could kill her.\n\n                         DARREN\n          Don't ever do that again.\n          Annie's smile drops away. As Darren continues on...\n\n                         CUT TO:\n\n          INT. HALLWAY - SCHOOL - DAY\n\n          Darren walking along, feeling isolated as he moves past the\n          other students. Everything seems weird, off.\n          A couple of KIDS RUSH past him going into a classroom. Then\n          a COUPLE more coming the other way.\n\n                         KID\n          Hey, Shan, you gotta see this.\n          They duck into the classroom. Darren follows.\n\n                         SCIENCE LAB\n          TWENTY or so KIDS all pressed around the Boa Constrictor\n          tank. Steve holds court.\n\n                         STEVE\n          .Doctor said it was a miracle.\n          They say I'm unique --\n          Steve spots Darren as he steps up in the back.\n\n                         STEVE\n          Hey, Darren. I've been looking for\n          you. We got a lot to talk about.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          43.\n\n                         DARREN\n          Yeah?\n\n                         STEVE\n          But first...\n          Steve holds out a fist. A MOUSE pokes its head out through\n          an opening in the hand. Its whiskers twitch. As Darren\n          looks from the mouse to the snake...\n          Steve addresses the kids does his best 'Mr. Tall'. He tries\n          to be entertaining, but he comes off creepy.\n\n                         STEVE\n          Welcome to Cirque du Steve. What\n          happens to us all can happen to any\n          of us. If you watch, it's by your\n          own free will. Say farewell...\n\n                         HEFTS MOUSE\n          .to Crepsley the mouse.\n          Darren reacts to the name. Steve lowers his hand into the\n          terrarium. Some kids already look away, others are intent.\n\n                         DARREN\n\n                         STOP --\n          Steve hesitates. Darren pushes to the front.\n\n                         DARREN\n          It's cruel.\n\n                         STEVE\n          It's nature. Anyhow don't watch.\n\n                         (TO KIDS)\n          And don't blink; you might miss it.\n          Steve sets the mouse in the terrarium.\n          The MOUSE takes a few tentative steps. Moves toward a corner\n          away from the... SNAKE who's suddenly alert. It raises its\n          head, flicks its tongue. Coils back on itself.\n          ZAP! The snake STRIKES...\n          And Darren darts down his hand! CATCHES the snake just below\n          its head, out of mid-air, out of mid-strike. Impossible!\n          The snake twists in Darren's hand. The students are blown\n          away. Steve's eyes narrow, his wheels are turning.\n          The BELL RINGS. Moment over. Kids hurry out to class.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          44.\n          Darren scoops up the mouse, drops the snake back in. As he\n          starts out, Steve cuts him off.\n\n                         STEVE\n          What happened to the spider?\n\n                         DARREN\n          I killed it.\n          Steve hesitates, processes, looks Darren over.\n\n                         STEVE\n          I had a dream. You and Crepsley\n          were in my hospital room...\n\n                         DARREN\n          Tell me about it later.\n          Darren starts away. Steve grabs him hard, spins him around.\n\n                         STEVE\n          I'll tell you now.\n          Darren reacts instinctively, grabs Steve with his free hand\n          and SLAMS him against the wall. Steve's nearly off the\n          ground, only his left toe touching.\n\n                         DARREN\n          I said later.\n          Darren lets go, heads off. Steve watches, wonders.\n\n                         CUT TO:\n\n          EXT. STREETS - DARREN'S NEIGHBORHOOD - DAY\n\n          Darren walks home, hands in pockets. Annie comes up behind.\n\n                         ANNIE\n          Darren! Wait up!\n          He looks over his shoulder, keep going.\n\n                         ANNIE\n          Can I walk home with you?\n          He softens, slows down. After a few silent steps.\n\n                         DARREN\n          Got you something.\n          Darren pulls the MOUSE from his pocket. Annie loves it, cups\n          it in her hand.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          45.\n\n                         ANNIE\n          He's adorable.\n\n          ANNIE & DARREN - A CREATURE'S POV\n          Coming in low and fast.\n\n                         STREET\n          Annie SCREAMS as a GERMAN SHEPHERD charges, stops just short\n          of them. GROWLING like it was rabid. Like it hates Darren.\n          Darren steps between it and Annie. Darren's pupils dilate\n          oddly; he curls his lip to show his own teeth. The dog\n          starts to back off..\n\n                         ANNIE\n          Hey. That's King.\n\n                         DARREN\n          No it's not. King's my buddy.\n\n                         ANNIE\n          That's King, Darren. It is.\n          Darren realizes it is King. As Darren realizes something's\n          wrong with Darren.. Another growl. From down the street.\n          Darren looks back as a black 1966 LINCOLN prowls through the\n          intersection. The one seen at school. It slows, windows\n          blacked out. As it continues, disappears from view...\n\n                         DARREN\n          Come on.\n          As Darren hurries Annie along down the street...\n\n                         CUT TO:\n\n          INT. KITCHEN - SHAN HOUSE - NIGHT\n\n          Darren at the kitchen table doing his math homework. His Mom\n          makes dinner, chopping vegetables at the sink.\n\n                         MOM\n          How was school today?\n\n                         DARREN\n          The usual. Sometimes it was\n          boring, sometimes really boring.\n          Darren's mom laughs. Then...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          46.\n\n                         MOM\n          Ouch!\n          She drops the knife on the cutting board. A thick drop of\n          BLOOD runs down her finger.\n          Darren flinches at the sight and in that moment we PUNCH INTO\n          his eyes. The PUPILS swirl red; the IRISES flatten and\n          narrow. A dark, ravenous look.\n\n          MOM - DARREN'S POV\n          Holding up her finger. Her skin tone receding back into\n          gray, the blood pulsing with red vibrancy. Alive. A target.\n\n                         DARREN\n          Standing at the blood's seeming siren call. But as he\n          suddenly moves forward, she turns away.\n          Darren stops as she wraps her finger in a paper towel. She\n          looks back at him: misunderstands his hunger for concern.\n\n                         MOM\n          It's okay, honey. I just need a\n          band-aid.\n          Darren looks at his mom's neck. His eyes zero in on a little\n          blue VEIN PULSING away. She leaves the room to get a band-\n          aid. As Darren's horror sinks in...\n\n                         CUT TO:\n\n          INT. BATHROOM - SHAN HOUSE - NIGHT\n\n          Darren looks at his reflection in the MIRROR. Looking for\n          reassurance. He curls his lip, checks his teeth. They look\n          normal. He reaches out. Trying to reach himself.\n          His hand comes to a stop against the glass. His nails CLICK\n          hard against the surface. He scrapes the nail of his\n          forefinger along the glass. It leaves a deep scratch.\n          Darren starts to freak a little. His breath getting ragged.\n          He tries to get a hold of himself, looks back in the mirror.\n\n                         DARREN\n          You're different...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          47.\n\n          INT. ZEITERION THEATER - STAGE - NIGHT\n\n          Darren walks down an aisle, climbs up onto the empty stage.\n          Dark, but Darren moves calmly, like it was noon.\n\n                         DARREN\n          Hello? Hey!\n          Crepsley appears. Darren turns, sees him. A beat. Crepsley\n          raises his hands to the gloom around them.\n\n                         CREPSLEY\n          The darkness isn't so scary\n          anymore, is it?\n\n                         DARREN\n          I'm starting to think it's me\n          that's scary.\n          Crepsley waits to hear more.\n\n                         DARREN\n          It's only gonna get worse, isn't\n          it? There's no way back, is there?\n          No magic potion to make me human\n          again?\n          Crepsley shakes his head. Darren nods that he understands.\n\n                         DARREN\n          We made a deal. I won't run away\n          again.\n\n                         CREPSLEY\n          It's neither here nor there, but, I\n          do feel sorry for you.\n          Darren waves it off, doesn't want to hear it.\n\n                         CREPSLEY\n          Are you ready then? The night is\n          young. We can make many miles.\n\n                         DARREN\n          I can't just -- My family, I can't\n          let them think I just left them.\n          Or that something happened to me.\n          My mother would... She couldn't...\n          As Darren trails off, Crepsley really does look sympathetic.\n\n                         CREPSLEY\n          There's only one thing for it.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          48.\n\n                         DARREN\n          What?\n\n                         CREPSLEY\n          We'll have to kill you.\n\n                         CUT TO:\n\n          EXT. LIVING ROOM - SHAN HOUSE - NIGHT\n\n          Darren's parents watching CNN. Darren comes in.\n\n                         DARREN\n          I'm going to bed.\n          They say 'good night' to him. Impulsively, Darren kisses his\n          dad on the cheek, then does the same to his mom.\n\n                         DARREN\n          I love you both. I don't say it\n          that much, but I do.\n          Darren's Mom is caught off guard, but happy to hear it.\n\n                         MOM\n          We love you, too. Don't we, Tommy?\n\n                         DAD\n          Of course we do.\n          Darren looks at them a beat, then smiles, satisfied.\n\n                         DARREN\n          Good night.\n          They watch him go, then exchange looks.\n\n                         DAD\n\n                         (SHRUGS)\n          Kids. Who knows how they think?\n\n                         CUT TO:\n\n          INT. ANNIE'S ROOM - NIGHT\n\n          Annie asleep already. Darren enters, pulls his sister's\n          blanket up, tucks it under her chin. He whispers:\n\n                         DARREN\n          Goodbye, knucklehead. If I can\n          ever help you, I will.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          49.\n\n          INT. DARREN'S ROOM - NIGHT\n\n          Darren enters to find Crepsley sitting at his desk. He holds\n          a small dark bottle between his fingers (different than the\n          one he gave to Steve). As Crepsley's about to speak...\n\n                         DARREN\n          Shut up.\n          Off Crepsley's reaction...\n\n                         DARREN\n          This is my home and I'm never gonna\n          see it again, so don't rush me.\n          Crepsley makes a motion to zip his lips. All the same, he\n          stands, unscrews the bottle as Darren takes a last look\n          around. He takes a PHOTO of his family off the dresser.\n\n                         DARREN\n          Hold onto this for me, okay?\n          Crepsley takes the photo, offers Darren the bottle in return.\n          Darren sniffs, recoils at the foul smell.\n\n                         DARREN\n          You're sure it will work?\n          Crepsley opens the window.\n\n                         CREPSLEY\n          Your heart will slow down so\n          drastically they won't find a\n          pulse. With the fall from the\n          window, they'll think you're dead.\n\n                         DARREN\n          What if I break bones?\n\n                         CREPSLEY\n          Even better. They'll mend in a few\n          days. Vampires don't stay broken\n          for long and it takes a very long\n          fall to kill one.\n\n                         DARREN\n          And the funeral home? Won't they\n          embalm me or something?\n\n                         CREPSLEY\n          Don't worry. I have ways of making\n          my thoughts become the thoughts of\n          others. They'll leave you alone.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          50.\n          Crepsley gestures to the window. Knowing the plan, Darren\n          climbs out, his foot resting on the trellis. He looks to the\n          ground, back to Crepsley as an odd thought hits him.\n\n                         DARREN\n          My dad's allergic to grass. It's\n          my job to cut the lawn.\n\n                         CREPSLEY\n          You have a new job now. Drink.\n          Darren steels himself, gulps it down, hands the bottle back.\n\n                         DARREN\n          So this is destiny, huh? Tastes\n          like crap.\n          Darren body seizes up. He lets go, but Crepsley grabs him.\n\n                         CREPSLEY\n          Your breathing is slowing, your\n          heart as well. Do you feel it?\n          Darren can't answer. He blinks his eyes 'yes' instead.\n\n                         CREPSLEY\n          You may be aware of what's going on\n          around you. Remember, the grief\n          that you hear will be a release for\n          those who express it.\n          Darren's eyes drift shut. Crepsley lets him go.\n\n                         CUT TO:\n\n          EXT. SHAN HOUSE - NIGHT\n\n          Darren FALLS, crashes through the trellis and thumps into the\n          lawn. Crepsley looks down from the window, then disappears.\n          CLOSE ON Darren lying face down in the grass. CRICKETS\n          chirp. Beyond, a NEIGHBOR walks his DOG. The dog suddenly\n          turns in the direction of Darren, pulls on its leash.\n\n                         NEIGHBOR\n          No, no, come on --\n          The Neighbor stops short as he sees the body.\n\n                         NEIGHBOR\n          Hey -- Hey, kid --\n          He rolls Darren over, realizes something is very wrong.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          51.\n          We stay on Darren, the dog sniffing at him as the neighbor\n          disappears toward the front door. We hear his fist pound. A\n          moment later, Darren's father is there. He looks at Darren,\n          up to the open window, realizes he fell. An instant later,\n          he's on his knees, cradling his son.\n\n                         DAD\n          Darren? Darren!\n          A moment later his Mom...\n\n                         MOM\n          Darren! Oh my God!\n          We're still on Darren's face, his eye open a slit.\n\n                         DARREN'S POV\n          His parents hovering over him in despair. The STARS TWINKLE.\n          The neighbor leans in.\n\n                         NEIGHBOR\n          Is he dead?\n\n                         CUT TO:\n\n          INT. MORGUE - NIGHT\n\n          Darren's body on a stainless steel table. The MEDICAL\n          EXAMINER shakes his head sadly, looks to his ASSISTANT.\n\n                         MEDICAL EXAMINER\n          Cause of death is trauma from the\n          impact of the fall. Poor kid.\n\n                         ASSISTANT\n          Are we doing an autopsy?\n\n          A NEW ANGLE\n          Reveals Crepsley watching from around a darkened corner.\n\n                         CREPSLEY\n\n                         (WHISPERS)\n          Not on a child.\n          Immediately...\n\n                         MEDICAL EXAMINER\n          I'm not going to cut open a kid.\n          Not when I don't have to.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          52.\n\n          INT. FUNERAL HOME - EARLY EVENING\n\n          Darren in his coffin, wearing a suit. Aware as...\n          Friends and family passing by. The sounds of people crying.\n          TWO CUTE GIRLS from school lean in.\n\n                         GIRL ONE\n          He's still cute.\n\n                         GIRL TWO\n          I always had a crush on him.\n          The Goalie from school soccer is next. He holds a little\n          SOCCER BALL in his hand. Tucks it into the coffin.\n\n                         GOALIE\n          For the next life, Shan. Top right\n          corner every time.\n          Annie steps up, gently strokes her brother's cheek. Then\n          suddenly overwhelmed, she buries her face in their Dad's\n          chest. He leans in tenderly over his son. Choked up:\n\n                         DAD\n          I love you, Darren. You said it\n          the other night; I didn't say it\n          back.\n\n                         CUT TO:\n\n          EXT. FUNERAL HOME - NIGHT\n\n          PEOPLE leave. Visiting hours are over.\n\n                         CUT TO:\n\n          DARREN IN HIS COFFIN\n          A hand reaches down, a thumb opens his eyelid.\n\n                         DARREN'S POV\n          Of the ceiling for a moment, then a blinding light flashing\n          back and forth. Then glimpses of Steve's face!\n\n                         VISITING ROOM\n          Steve holds Darren's eye open, shines a PENLIGHT into it.\n          The pupil doesn't dilate. Footsteps approach. Steve\n          switches it off, pockets it as the FUNERAL DIRECTOR enters.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          53.\n\n                         DIRECTOR\n          I'm sorry. I know it's difficult,\n          but visiting hours are over.\n          Steve nods sadly, looks to Darren. He pats one of Darren's\n          hands which are folded across his chest.\n          In reality Steve checks Darren's fingertips. A WHITE SCAR at\n          the end of each one. Steve's crazy idea may be confirmed.\n\n                         CUT TO:\n\n          EXT. CEMETERY - DAY\n\n          Darren's coffin is lowered into the ground.\n\n                         MINISTER\n          Ashes to ashes, dust to dust, in\n          sure and certain hope of the\n          resurrection to come...\n          Darren's Dad tosses a handful of earth down onto the coffin.\n\n                         CUT TO:\n\n          DARREN INSIDE THE CLOSED COFFIN\n          The lid an inch from his face. His eyelid twitching as we\n          hear shovelfuls of dirt hit the lid. The sound growing\n          duller at each turn. Then, as Darren's eye flickers open...\n\n                         CUT TO:\n\n          EXT. CEMETERY - NIGHT\n\n          Moonless. The sound of digging continues. Only now, dirt is\n          coming out of the hole rather than going in.\n          Crepsley is digging the coffin back up. Effortlessly.\n          Finally, he spreads his feet apart, pulls open the lid.\n          Darren sputters as some of the dirt spills onto his face.\n          Crepsley reaches down, pulls him up and out of the grave.\n          Darren sits on the ground, coughing then moaning.\n\n                         CREPSLEY\n          On your feet.\n\n                         DARREN\n          My legs are asleep.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          54.\n          Crepsley pulls him up anyhow. Darren stumbles a few steps,\n          nearly falls before finding his balance.\n\n                         CREPSLEY\n          Walk it off. I'll fill this back\n          in. Go. Breathe some air.\n          Crepsley closes the coffin, begins to fill the hole as Darren\n          ambles off. Not exactly the start of his best day.\n\n          MOVE WITH DARREN\n          Passing among the graves, stretching his arms, twisting.\n          Really beat up. He looks about, the names and dates on the\n          headstones popping into focus even from far away. Night\n          vision. Suddenly he becomes aware of something:\n          Steve. On the other side of a mausoleum. Ten feet away.\n\n                         DARREN\n          What are you doing here?\n\n                         STEVE\n          (smiles; closing in)\n          Vampire hunting.\n          Steve rushes the last step, a jagged WOODEN STAKE held high\n          over his head. He knocks Darren back on the ground.\n          Pouncing on top, he brings down the stake.\n          Darren catches hold of Steve's wrist. Stops the point of the\n          stake just over his heart. Steve puts his weight into it. A\n          desperate moment of struggle, but Darren's strength is\n          resurgent. He throws Steve off.\n          Steve rolls to his feet, comes at him again. Darren catches\n          his wrist with one hand, his throat with the other. He slams\n          him up against the mausoleum, holds him there.\n\n                         DARREN\n          What do you have against vampires?\n          You wanted to become one yourself.\n\n                         STEVE\n          Yeah, I wanted to, but you did.\n          You stole my dream. You stole my\n          destiny.\n\n                         DARREN\n          Are you crazy? I did it to save\n          your life. That was the deal. Me\n          for you.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          55.\n\n                         STEVE\n\n                         (UNHINGING)\n          Liar. You told him I was evil.\n          You planned this all along. And\n          you'll pay! You'll pay --\n          Darren jams the stake under Steve's throat. That stops him\n          struggling. The points jabs him as he swallows.\n\n                         DARREN\n          I want you to leave...\n          Steve is just beginning to realize how strong Darren is now.\n\n                         DARREN\n          I want you to leave and forget you\n          ever saw me. Understand?\n          Scared, he nods. Darren shoves him away, brakes the stake in\n          two. Steve heads away, looks back over his shoulder.\n\n                         STEVE\n          I'm going to hunt you, Darren. You\n          and the other one. Crepsley. I'll\n          put a stake in you and burn you to\n          ashes. I'll make sure you never\n          come back from the grave again.\n          WHAM. Steve walks right into Crepsley. He picks Steve up by\n          the shoulders, pulls him close. With a voice like Death...\n\n                         CREPSLEY\n          If we ever meet again, I will show\n          you loneliness you cannot imagine.\n          Steve trembles in fear. Crepsley lets go. Steve takes off\n          running. Crepsley looks to Darren.\n\n                         CREPSLEY\n          Do you still question his blood?\n          Darrenthoughtful, doesn't know what to think.\n\n                         DARREN\n          Would a stake through the heart\n          kill a vampire?\n\n                         CREPSLEY\n          Yes. But so would getting hit by a\n          truck if it was going fast enough.\n          Steve finally disappears from sight. Crepsley sighs.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          56.\n\n                         CREPSLEY\n          He'll be trouble before it's over.\n\n                         DARREN\n          Before what's over?\n\n                         CREPSLEY\n          This adventure we're on. Shall we\n          start?\n          Darren hesitates, looks to the twinkling lights of his city.\n\n                         CREPSLEY\n          You'll get used to it after awhile.\n          Vampires are always saying goodbye.\n          A beat, then Darren looks back at him.\n\n                         DARREN\n          Let's go.\n\n                         CUT TO:\n\n                         THE SUN\n          As it blisters up into, then rises above the horizon.\n          Sunrise. Ominous if you're a full vampire.\n\n                         CUT TO:\n\n          EXT. RURAL OHIO MOTEL - SUNRISE\n\n          On the edge of the highway. Silhouetted against the sun.\n\n                         CUT TO:\n\n          INT. MOTEL ROOM - SUNRISE\n\n          Darren jams a rolled towel along the bottom of a closed door.\n\n                         DARREN\n          How's that? Dark enough?\n\n                         CREPLEY'S VOICE\n          (on the other side)\n          Better.\n\n                         DARREN\n          It's sunrise.\n\n                         CREPLEY'S VOICE\n          I know the time. I know more about\n          the sunrise than anyone alive.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          57.\n          Crespley sounds irritated. Darren gets mischievous.\n\n                         DARREN\n          Maybe I'll wait until noon and then\n          open every door and curtain in the\n          place.\n          A long tense silence as Darren awaits Crepsley's reply.\n\n                         MOTEL BEDROOM\n          Crepsley is a shadow among the shadows. He climbs into bed.\n\n                         CREPSLEY\n          Yes, sunlight would kill me. My\n          electrons are different than a\n          human's. But it would take several\n          hours of exposure. I'd have plenty\n          of time to kill you before I closed\n          the curtains and went back to bed.\n          Crepsley pulls the blanket up over his head.\n\n          MOTEL LIVING ROOM\n          As Darren considers this...\n\n                         CUT TO:\n\n          DOORWAY - LATER\n          Darren doing pull-ups, a hand on either side of the top jamb.\n\n                         DARREN\n\n          242... 243... 244...\n          It's almost effortless. Bored rather than tired, Darren\n          drops to his feet. (He still wears his burial suit.)\n\n                         CUT TO:\n\n          EXT. MOTEL COURTYARD - AFTERNOON\n\n          Darren watching the cars go by on the highway, spots...\n\n                         DARREN\n          Minnesota...\n          Darren jots this state down on a LIST he's keeping. About\n          twenty state license plates so far.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          58.\n\n          INT. COUCH - MOTEL ROOM - SUNSET\n\n          A TV droning. Darren asleep. Bathed in a golden glow that\n          flickers out as the sun sets. The bedroom door opens.\n          Crepsley steps over, looks down at his snoozing assistant.\n          Crepsley CLAPS his hands together, nearly against Darren's\n          ear. Crepsley smiles as Darren jolts awake.\n\n                         CUT TO:\n\n          EXT. SHOPPING MALL PARKING LOT - NIGHT\n\n          Getting late, stores closing. The parking lot nearly empty.\n          Darren and Crepsley are on a walk and talk.\n\n                         CREPSLEY\n          We can die violently. Accidentally\n          or otherwise. But we also grow\n          old. A full vampire will age one\n          year for every ten human years he's\n          alive. A half-vampire like you:\n          one for every five.\n\n                         DARREN\n          I don't understand.\n\n                         CREPSLEY\n          I was born in 1774. I became --\n          Crepsley looks back to where Darren has stopped short.\n\n                         DARREN\n\n          1774?\n\n                         CREPSLEY\n          Should we do the math or not?\n          Darren nods. Crepsley motions him to keep up.\n\n                         CREPSLEY\n          I became a vampire when I was 20\n          years old. In 1794.\n\n                         DARREN\n\n          1794?\n\n                         CREPSLEY\n          In Paris. The days of the Terror.\n          Heads in baskets. Guillotines up\n          and down all day. Really when\n          humans put their minds to it, we\n          vampires can hardly compete.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          59.\n          Darren's stare jogs him back from the good old days.\n\n                         CREPSLEY\n          Math. 1794. So I've been a\n          vampire now for 211 years. Hmm?\n          Darren nods again, still with him.\n\n                         CREPSLEY\n          I age 1 year for every 10, so, 211\n          divided by 10, I've aged about 21\n          years in that time. That 21 plus\n          my first human 20 makes me look\n          about 40.\n\n                         DARREN\n          But altogether you're 211 plus 20.\n          You're really 231 years old.\n\n                         CREPSLEY\n          Exactly. You're going to be a\n          teenager for a very long time.\n          They walk on a few steps as Darren thinks this over.\n\n                         DARREN\n          Where do you keep your car anyhow?\n\n                         CREPSLEY\n          What car?\n\n                         DARREN\n          The one you were driving around my\n          town in. The old black one.\n\n                         CREPSLEY\n          I've never owned a car, Darren. I\n          don't need one.\n\n                         DARREN\n          It was near school one day. It\n          followed me home a few days later.\n\n                         CREPSLEY\n          And you saw me behind the wheel?\n\n                         DARREN\n          I couldn't see who was driving.\n\n                         CREPSLEY\n          It wasn't me.\n          As Darren considers this, Crepsley stops suddenly.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          60.\n\n                         CREPSLEY\n          There...\n          Ahead: just more parking lot. A WOMAN exiting a BOOKSTORE.\n\n                         DARREN\n          What?\n\n                         CREPSLEY\n          Dinner.\n\n                         CUT TO:\n\n          EXT. PARKING LOT - NIGHT\n\n          The woman nears her car. A chirp as she unlocks it with her\n          remote. She opens the back door, sets the book bag on the\n          seat. Suddenly she turns, like someone called her name.\n\n                         WOMAN\n          Yes?\n          Only nobody's there. She shrugs it off, closes the back\n          door. But hesitates at the driver's side door. Then she\n          starts walking away, toward a back area of loading docks.\n\n                         CUT TO:\n\n                         DARREN & CREPSLEY\n          Watch from a dumpster by the loading dock. She walks right\n          toward them. One look at Crepsley's face and we know he must\n          be willing her over. Darren looks terrified.\n          But the air shimmers and Crepsley has disappeared.\n          The woman steps up, stops across from Darren. As she frowns,\n          tries to figure out who he is and how she got here...\n\n                         DARREN\n          Go. Run.\n          But Crepsley appears beside her. He 'breathes' into his\n          hand, 'guides' the air into her face. He catches her as she\n          passes out. Darren is horrified.\n\n                         DARREN\n          Did you kill her?\n\n                         CREPSLEY\n          I put her to sleep. She'll be like\n          this 15 minutes. When she wakes\n          up, she won't remember a thing.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          61.\n          Crepsley eases her to the ground, finds a vein on her wrist.\n\n                         DARREN\n          Will she become a vampire?\n\n                         CREPSLEY\n          No. She'd have to share y blood\n          for that to happen.\n\n                         DARREN\n          Don't take too much.\n\n                         CREPSLEY\n          A vampire who feeds often can\n          control himself. One who drinks\n          only when he must can end up\n          feeding wildly.\n          He uses one of his fingernails to open the vein.\n\n                         CREPSLEY\n          The hunger inside us must be fed to\n          be controlled. To be civilized.\n          It's what separates us from... the\n          others.\n\n                         DARREN\n          What others?\n          But as blood oozes, he takes the woman's wrist td his mouth.\n          Darren is repulsed, but can't look away. Crepsley takes a\n          few deep swallows, then holds the wrist out to Darren.\n\n                         CREPSLEY\n          Your turn.\n\n                         DARREN\n          No. I won't.\n\n                         CREPSLEY\n          Darren...\n\n                         DARREN\n          I'll never do it.\n          Crepsley runs his tongue over the cut, rubs the saliva in.\n\n                         CREPSLEY\n          You can lead a vampire to blood,\n          but you can't make him drink.\n\n                         DARREN\n          I'm only half-vampire.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          62.\n\n                         CREPSLEY\n          No matter, you need blood to live\n          now. You'll drink eventually.\n          When you're hungry enough.\n          The wrist is clean, the cut gone. A barely perceptible scar.\n\n                         DARREN\n          I'll die first.\n\n                         CREPSLEY\n\n                         (ANGER FLASHING)\n          Don't be stupid. You may abstain\n          tonight, but you must feed soon.\n          Crepsley stands to go, then stops short. Tense, he looks\n          about, more hunted animal than man. As he shrugs it off.\n\n                         DARREN\n          What is it?\n          As the woman starts to stir...\n\n                         CREPSLEY\n          Nothing. Let's go.\n\n                         DARREN\n          Something out there scares you.\n          What is it?\n\n                         CREPSLEY\n          The thought of spending another\n          minute with you.\n          Crepsley turns and walks, but Darren's right.\n\n                         CUT TO:\n\n          INT. HAMBURGER JOINT - NIGHT\n\n          The WAITRESS sets a juicy BURGER down across from Darren.\n          Crepsley sits across from him.\n\n                         CREPSLEY\n          We still need to eat food, too. I\n          just don't need it tonight.\n          Darren just sits there. Silently as tears begin to run down\n          his cheeks. Crepsley is exasperated.\n\n                         CREPSLEY\n          Now what?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          63.\n\n                         DARREN\n          The blood... I wanted it. I\n          wanted to drink it.\n\n                         CREPSLEY\n          Of course you did! You're a\n          Crepsley catches himself. He is not without some compassion.\n\n                         CREPSLEY\n          I'm sorry. It was wrong of me to\n          blood you. You're too young. But\n          it's done. Like the entire history\n          of the world up to this moment.\n          Darren quietly cries. Crepsley pulls two paper napkins from\n          the dispenser, hands them to him.\n\n                         DARREN\n          Thank you.\n          Darren turns to face the window as he wipes his eyes, nose.\n          Then he sees it: parked across and down the street...\n          A black 1966 Lincoln Continental.\n          Darren looks back at Crepsley.\n\n                         CREPSLEY\n\n                         (RE: HAMBURGER)\n          Eat. Let's not waste anymore food\n          tonight.\n\n                         DARREN\n          The car...\n          Crepsley follows the finger as Darren points.\n          DING DING! The bell over the diner door rings...\n\n          CLOSE ON DARREN\n          As he looks back over his shoulder at the door.\n\n                         DARREN'S POV\n          MR. TINY comes through the front door pimpin'. Peter Lorre\n          on steroids. Scary, done up like a Las Vegas high roller.\n\n                         TABLE\n          Darren knows trouble when he sees it. He looks back at\n          Crepsley, but the vampire is gone! Vanished.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          64.\n\n          MR. TINY\n\n                         (STEPPING UP)\n          Darren Shan, we meet at last.\n          Darren just looks up at him. The guy is practically leaking\n          nastiness no matter how avuncular he tries to be.\n\n          MR. TINY\n          You're quite a boy. Sacrificed\n          everything to save a friend.\n\n                         DARREN\n          Where'd you hear that?\n\n          MR. TINY\n          A little bat told me.\n          Mr. Tiny takes a french fry off Darren's plate, eats it.\n          Darren looks around. Where the hell did Crepsley go at a\n          time like this? Mr. Tiny knows what he's thinking.\n\n          MR. TINY\n          Oh, he's still here.\n\n                         DARREN\n          Who is?\n\n          MR. TINY\n          Crepsley. Trying to stay alive.\n          It's so quiet around them Darren can hear a clock TICKING.\n          It's a heart shaped POCKET WATCH Mr. Tiny holds on a chain.\n\n          MR. TINY\n          Would you like to see?\n\n                         DARREN\n          See what?\n          The air seems to buzz as something 'passes'.\n\n          MR. TINY\n          Why the fight of course. Boys like\n          to watch fights, don't they?\n          Mr. Tiny hefts his watch. It almost seems to melt into his\n          palm. As he pulls the winding knob out with a CLICK...\n          As Darren and Mr. Tiny blink out, disappear from the booth...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          65.\n\n          INT. HAMBURGER JOINT - NIGHT (IN THE FLITTING WORLD)\n\n          Darren and Mr. Tiny reappear in the booth, but the\n          restaurant's patrons are slowed to near motionlessness.A\n          battle royal going on. Crepsley fighting three VAMPANEZE.\n          All three are sinewy, whipcords with blotchy purple skin.\n          Crepsley stands surrounded in the middle of the restaurant.\n          Whirling, hand fighting. Blocking their thrusts and blows.\n          Darren moves to stand. Mr. Tiny pushes him back to his seat.\n          Crepsley takes one down with a violent leg whip. He drives\n          the second one back into the third knocking both back.\n          A look to Darren and then he's back on LEG WHIP who's getting\n          to his feet. Crepsley drives his flat hand forward, his\n          nails tearing into the vampaneze's throat.\n          As leg whip's hand instinctively goes to his throat to stem\n          the blood, Crepsley grabs his free hand, sends him airborne.\n\n                         CUT TO:\n\n          INT. HAMBURGER JOINT - NIGHT (REAL WORLD)\n\n          As leg whip 'unflits'. The patrons react to him soaring over\n          the counter, slamming into the wall --\n\n                         CUT TO:\n\n          INT. HAMBURGER JOINT - NIGHT (IN THE FLITTING WORLD)\n\n          The patrons near frozen again. Leg whip sliding ever so\n          slowly down the wall. Crepsley and Sinewy One & Two FIGHTING\n          at full speed.\n          Sinewy One pulls Crepsley's arm up behind his back. Crepsley\n          HOWLING as we hear the bone BREAK.\n          Mr. Tiny grabs Darren by the wrist, pulls him toward the\n          door. Behind them...\n          Crepsley drives the back of his head into Sinewy One's face\n          at the same time as Sinewy Two swings in his open palm...\n          Sinewy One releases Crepsley who disappears as Sinewy Two\n          slices open Sinewy One's throat.\n          As Mr. Tiny pulls Darren out the door...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          66.\n\n          INT. HAMBURGER JOINT - NIGHT (REAL WORLD)\n\n          Crepsley appears. Leg Whip hits the floor. Blood splashes\n          the wall as Sinewy One appears, dropping to his knees.\n          As Leg Whip stands, Crepsley charges, 'shoulders' him halfway\n          through the wall. Patrons SCREAM, react, scatter.\n          As Crepsley grabs a knife...\n\n                         CUT TO:\n\n          EXT. HAMBURGER JOINT - PARKING LOT - NIGHT (FLITTING WORLD)\n\n          Darren struggles as Mr. Tiny pulls him along. Behind,\n          through the diner windows, WE SEE Patrons frozen in flight.\n          Sinewy Two near frozen in fight with Crepsley who is in mid\n          swing with the knife in his head.\n          Mr. Tiny and Darren stop across from YOUNG MURLOUGH.\n          Humanoid in shape, monstrous in visage. Bloated, his skin\n          albino white with purplish mottling and red crisscrossing\n          veins. He must weigh 300 pounds, but NFL nose tackle style.\n\n                         MURLOUGH\n          Smell the blood. The lovely blood.\n          His eyes narrow at the sight of Crepsley, his mouth widening\n          to show two rows of sharp filthy teeth.\n          Darren needs to do something. He eyes the watch in Mr.\n          Tiny's hand. He grabs it with his free hand, thumbs back in\n          the winding knob. As Murlough disappears from view...\n          The WINDOW EXPLODES as Sinewy Two hurtles out.\n          Darren tosses the watch high in the air. Mr. Tiny releases\n          him to move to catch it.\n          Darren rushes back toward the restaurant.\n          Mr. Tiny catches his watch.\n          Crepsley meets Darren. Crepsley's broken arm hangs uselessly\n          from his side.\n          Murlough appears alongside. He grabs Crepsley by the throat,\n          lifts him off the ground.\n          Crepsley arcs the knife into Murlough's shoulder.\n          Murlough staggers, lets go.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          67.\n          Crepsley takes Darren's hand and they flit, disappearing.\n\n                         CUT TO:\n\n          EXT. STREET - NIGHT (IN THE FLITTING WORLD)\n\n          Beyond the hamburger joint. The world beginning to streak\n          past them. The asphalt begins to blur beneath their feet,\n          passing cars like they were standing still. But Crepsley\n          heaves for breath. In pain.\n          Darren looks back over his shoulder...\n\n                         DARREN'S POV\n          Murlough follows. Closing ground.\n\n                         DARREN & CREPSLEY\n\n                         DARREN\n          It's behind us!\n          Crepsley bears down, the buildings streaking by. But...\n\n                         MURLOUGH\n          Closes regardless, relentless, death in his eyes.\n\n                         CREPSLEY\n          Almost out of gas. But looking ahead. Clocks in an instant:\n          a RED LIGHT AHEAD. Cars STOPPED. A CAR FROZEN having just\n          crossed the INTERSECTION. HEADLIGHTS from a blind corner.\n          Crepsley slows. Just as Murlough's about to catch him from\n          behind... Crepsley comes out of flit mode, disappears.\n          As Murlough FADES after him.\n\n                         CUT TO:\n\n          EXT. INTERSECTION - NIGHT (REAL WORLD)\n\n          Darren and Crepsley appear on the far side of the crossing.\n          Murlough comes out of flit in the center.\n          WHAM! The headlights Crepsley saw frozen, but coming from\n          the blind corner, become a PICK-UP - broadsiding Murlough!\n          He goes up over the hood, SMASHES against the windshield.\n          As Darren and Murlough disappear again...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          68.\n          The pick-up brakes. Murlough doesn't. He tumbles off the\n          hood, sprawls hard into and skids along the street.\n          A beat and he rolls to a sitting position, looks around. No\n          Crepsley in sight. Blood runs out of one of his ears. As he\n          wipes it, smearing it across his cheek...\n\n                         PICK-UP DRIVER\n\n                         (RUSHING OVER)\n          Hey, man, are you okay?!\n          He stops short when he sees Murlough's face. Murlough\n          stands, SWATS the driver aside.\n          The Lincoln screeches to a halt alongside him. Murlough\n          climbs in. The Lincoln tearing away.\n\n                         CUT TO:\n\n          EXT. STATE HIGHWAY - DAWN\n\n          The sky getting lighter. A SIGN: Now Entering Pennsylvania.\n          The air shimmers as something flits past... WHOOOSHH!\n\n                         CUT TO:\n\n          EXT. HUNTING CABIN - WOODS - DAWN\n\n          Boarded up. Abandoned. Clutching his arm, Mr. Crepsley\n          kicks at the door, splinters it. Opens\"a gap. Darren\n          reaches through, unlocks it. As they step inside, the first\n          rays of the sun appear through the trees.\n\n                         CUT TO:\n\n          INT. ROOT CELLAR - DAWN\n\n          Crepsley climbs down a few steps, closes the door behind him.\n          Barely any light, but some.\n\n                         CREPSLEY\n          Find a blanket. A rug. Cover it.\n\n                         CUT TO:\n\n          INT. HUNTING CABIN - DAWN\n\n          Darren drags a CARPET over the root cellar door in the floor.\n\n                         ROOT CELLAR\n          It goes black except for a glint in Crepsley's eyes. He\n          sighs, settles down on the ground. Worn out.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          69.\n\n                         DARREN'S VOICE\n          Are you okay?\n\n                         CREPSLEY\n          My arm's broken. But it should be\n          fine in a day or two.\n\n          INTERCUT THE FOLLOWING:\n          Sunlight fills the kitchen. Darren sits, exhausted.\n\n                         DARREN\n          Who were they? Vampires?\n\n                         CREPSLEY\n          No. The one with the watch was Mr.\n          Tiny. Very dangerous.\n\n                         DARREN\n          How dangerous can a man named Mr.\n          Tiny be?\n\n                         CREPSLEY\n          Who said he was a man?\n\n                         DARREN\n          Then what is he?\n\n                         CREPSLEY\n          Mr. Tiny can't be explained. He\n          needs to be experienced.\n\n                         DARREN\n\n                         (FRUSTRATED)\n          And the purple guy. What was he?\n\n                         CREPSLEY\n          A vampaneze.\n\n                         DARREN\n          Yeah? Keep talking.\n\n                         CREPSLEY\n          Long ago humans were looked upon as\n          animals by some vampires. Cattle\n          to be slaughtered. Laws were\n          passed to forbid needless killing.\n          It made it easier to pass unnoticed\n          among humans if we didn't murder\n          them. Most vampires obeyed...\n\n                         DARREN\n          But some didn't?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          70.\n\n                         CREPSLEY\n          Seventy vampires broke away,\n          declared themselves a separate\n          race. The Vampaneze. Over time\n          their appearance changed, their\n          numbers grew. They believe it's\n          wrong to feed from a human without\n          killing it.\n\n                         DARREN\n          What? That's crazy.\n\n                         CREPSLEY\n          They believe those of us who feed\n          in small amounts live like leeches.\n          In shame. It led to war.\n          Crepsley touches the scar on his face, remembers.\n\n                         CREPSLEY\n          The last one nearly destroyed us\n          all. There's been a truce for many\n          years now.\n\n                         (A BEAT)\n          Will you be alright while I sleep?\n          Darren looks around at the dilapidated crap heap he's in. As\n          he tries to hold his heart together...\n\n                         DARREN\n          Oh yeah... This is so much better\n          than where I used to be...\n          Crepsley hears the strain in his voice. Knows what's best\n          for both of them..\n\n                         CREPSLEY\n          What do you think of rejoining the\n          Cirque du Freak? Until you get on\n          your vampire feet so to speak.\n\n                         DARREN\n          Half vampire.\n\n                         CREPSLEY\n          Yes, yes. Three-eighths if you\n          want. What do you think?\n          As Darren thinks...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          71.\n\n          EXT. MR. TALL'S AIRSTREAM TRAILER - NIGHT\n\n          The Cirque is camped by an ABANDONED FACTORY. Neo-Gothic in\n          scale and mood. Lit up for a performance. Mr. Tall, pulls\n          on his jacket, shouts orders.\n\n          MR. TALL\n          Show time in twenty minutes.\n          Someone tell Rhamus to get his\n          stomachs in gear!\n          He's surprised to see Crepsley and Darren walk up the road.\n          Crepsley's arm seems much better now.\n\n          MR. TALL\n          Larten'Crepsley! As I live and\n          breathe. I thought it would be\n          years before I saw you again.\n          Mr. Tall looks to Darren, throws a surprised look to\n          Crepsley. Crepsley nods. 'Yes'.\n\n          MR. TALL\n          Darren Shan. You've come a long\n          way since the last time I saw you.\n\n                         DARREN\n          I liked it better where I was.\n\n          MR. TALL\n          I'm sure.\n\n                         CREPSLEY\n          Do you still have my coffin?\n\n          MR. TALL\n          Of course. You're really back?\n\n                         (CREPSLEY NODS)\n          Perhaps you could do the show\n          tonight? A few of us are absent or\n          ill this evening.\n\n                         CREPSLEY\n          I'd be delighted.\n\n          MR. TALL\n          Mr. Shan will have to pull his\n          weight as well. I'll give him to\n          Evra. Evra! EVRA!\n\n                         (LOOKING ABOUT)\n          I hope I haven't gone from one\n          unreliable boy to two.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          72.\n          Evra arrives. The snake boy from the first Cirque show.\n\n          MR. TALL\n          Evra, my industrious wonder. Here\n          is Darren. Put him to work with\n          you. Show him the snakey ropes.\n          As the two boys consider each other...\n\n          MR. TALL\n          Off with you. Go!\n          As the boys head off, Mr. Tall looks over at Crepsley.\n\n          MR. TALL\n          You blooded a child, Larten? What\n          were you thinking?\n\n                         CREPSLEY\n          You don't approve?\n\n          MR. TALL\n          I don't matter. What will the\n          vampire generals say when they hear\n          about it?\n\n                         CREPSLEY\n          I'm no longer part of their domain.\n\n          MR. TALL\n          So you say. They may disagree.\n\n                         CUT TO:\n\n          EXT. CIRQUE CAMP - NIGHT\n\n          As Darren and Evra make their way through.\n\n                         EVRA\n          What do you do? Me? I'm a snake\n          boy. I do a whole snake thing.\n          Evra goes into a slithery snake walk for a few steps to\n          illustrate. It's strange. Funny. Evra looks back over.\n\n                         DARREN\n          Do you eat mice?\n\n                         EVRA\n          Big Macs actually.\n          They share a LAUGH. Evra 'high fives' Darren. Fast friends.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          73.\n          As they continue, Darren looks at the palm of his hand. A\n          few of Evra's SCALES have come off and are stuck there.\n\n                         DARREN\n          I caught your act in the last town.\n          Pretty cool.\n\n                         EVRA\n          Thanks. I'm not doing it tonight.\n          My snake caught a cold.\n\n                         DARREN\n          Snakes can catch cold?\n          Evra nods, then SNEEZES himself.\n\n                         EVRA\n          Still gotta work the floor though.\n          Ushers. We get the seats filled.\n          They pass PEOPLE all hurriedly crossing the camp.\n\n                         DARREN\n          Who are they all?\n\n                         EVRA\n          The backbone of Cirque du Freak.\n          They do the driving, the tent\n          pitching, the potato peeling even.\n\n                         DARREN\n          How did they end up here?\n\n                         EVRA\n          Most wandered in. If Mr. Tall\n          likes them, they stay.\n          Darren's eye is caught by the WOLFMAN. He's being pushed\n          toward the factory building by several of the blue-robed\n          LITTLE PEOPLE. The wolfman's yellow eyes are on Darren as he\n          rumbles a low, guttural growl.\n          Darren is so taken that he almost walks into...\n          Madam Truska. He stops short. In costume, beardless, even\n          more beautiful than when we first saw her. She considers\n          Darren, uses a finger to raise his chin. She shakes her\n          head, smiles. As she continues...\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          74.\n\n          INT. FACTORY SPACE - NIGHT\n\n          An odd setting, but it works well. Stripped, ragged, weird.\n          Feels like a rave. The lighting dramatic, the concrete walls\n          ominous. PATRONS take their seat around a stage. A buzz in\n          the air.\n\n                         DEBBIE & SAM\n          About the same age as Darren and Evra, they're here for the\n          show. Debbie is self-assured. Sam is sarcastic to cover his\n          insecurities. Right now it's hard to find a seat.\n          And here are Darren and Evra. Evra looking cool in his green\n          sharkskin, Darren still wearing his burial suit.\n\n                         EVRA\n          Can we help you find a seat?\n\n                         DEBBIE\n          Are there any left?\n\n                         EVRA\n          Only the best seats in the house.\n          He leads them a few steps over toward a column.\n\n                         DEBBIE\n          You guys are with the Cirque?\n          Darren nods. Sam's a little sarcastic and skeptical.\n\n                         SAM\n          Cirque is French, right? Are you\n          guys French?\n\n                         EVRA\n          Oui. Vous etes observateur. Nous\n          sommes les serpents frangais.\n          That slows Sam a beat. Evra points out a small platform\n          eight feet up the column. You have to climb a natural re-bar\n          ladder to get there. Sam looks dubious, but Debbie smiles.\n\n                         DEBBIE\n          Cool... I'm Debbie, this is Sam.\n\n                         EVRA\n          Evra Von.\n          She looks at Darren, waiting.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          75.\n\n                         DARREN\n          Oh, I'm Darren.\n\n                         DEBBIE\n          Is the show great? Say yes. We\n          had to sneak out to see it.\n\n                         DARREN\n          I snuck out to see it once, too.\n          And I'm still here.\n          An odd, almost spooky moment. Is he serious?\n\n                         SAM\n          Good one, Darren. Hey. Debbie and\n          Darren. Like Bonnie and Clyde.\n          And their friend Evra Von what?\n          That breaks the moment. Debbie starts climbing the re-bar.\n          Sam looks Darren over a beat, picks a thread off his lapel.\n\n                         SAM\n          Dude, it looks like the kind of\n          suit you'd wear to a funeral.\n\n                         DARREN\n          You have no idea...\n          Evra smiles, sticks out his tongue. Pointy, narrow, Evra\n          sends it up his own nostril. Sam tries to smile, then starts\n          up after Debbie. Freaked out. As Darren and Evra laugh...\n\n                         CUT TO:\n\n          INT. THE STAGE - NIGHT\n\n          Mr. Tall under a spotlight. Back in his red hat and gloves.\n\n          MR. TALL\n          Welcome to the Cirque du Freak. We\n          are an ancient circus. Bringing\n          the remarkable to generations...\n\n                         BACK ROW\n          Darren and Evra watch from the back, whisper to each other.\n\n                         DARREN\n          How long have you known Mr. Tall?\n\n                         EVRA\n          Five years.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          76.\n\n                         DARREN\n          How do you meet someone like him?\n\n                         EVRA\n          I was raised in a circus, but not a\n          nice one like this. The owner used\n          to beat me and keep me in a glass\n          cage. I felt like a useless freak.\n          One night I looked out of my cage\n          and saw Mr. Tall just standing\n          there. He watched me until the\n          owner came over and asked if he\n          could help him. Mr. Tall grabbed\n          him by the throat and strangled him\n          to death. Then he opened the cage\n          and said, \"Let's go, Evra.\" He\n          named me that. I added the Von.\n          I've been with him ever since.\n          Darren looks back at Mr. Tall with a new set of eyes.\n\n                         CREPSLEY'S VOICE\n          Darren...\n          Darren turns. Crepsley's back there in the shadows.\n\n                         CREPSLEY\n          How do you feel about show\n          business?\n\n                         CUT TO:\n\n          INT. THE STAGE - NIGHT\n\n          The audience reacts as Crepsley 'appears' on the empty stage.\n\n                         CREPSLEY\n          To be poisoned by a spider may be\n          my fate.\n          It's Darren's cue. Looking appropriate in his burial suit,\n          he walks out carrying Madam Octa's cage at arm's length.\n\n                         DEBBIE & SAM\n          As she realizes it's Darren. Cool.\n\n                         STAGE\n          Darren sees Debbie who gives a little wave. As he smiles...\n\n                         CREPSLEY\n          Look glum... Miserable...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          77.\n          Darren loses the grin. Crepsley opens the cage. Madam Octa\n          steps to the opening. Crespley raises the flute, plays.\n          Madam Octa walks out and up to Darren's shoulder where she\n          attaches a web thread. The audience react as she leaps to\n          Crepsley's shoulder and attaches the other end. She dances\n          across to the music, spinning a web as she goes.\n          Darren looks out, sees how much Debbie enjoys it.\n\n                         CUT TO:\n\n          EXT. THE MOON - NIGHT\n\n          Set against the black sky. Sparks rise up, their source\n          unknown. All very mysterious until... LAUGHTER. Lots of\n          it. Borderline raucous. We follow the sparks DOWN to...\n\n                         A BONFIRE\n          Blazing in the Cirque campgrounds. The freaks are eating,\n          drinking wine, relaxing after the show. Like a gypsy camp.\n          Mr. Tall sits with his long legs up on a box, really enjoying\n          watching everyone else enjoy themselves.\n          Evra munches on a sausage he grills on the end of a stick.\n          Darren is all ears and eyes. He likes these people. And\n          he's certainly never experienced anything like this.\n          Someone starts to play a guitar, someone else beats a drum.\n          Madam Truska starts to dance, the fire flickering against her\n          as are all eyes. Then she reaches out, takes Crepsley by the\n          hand. A few moments later, the two of them are engaged in a\n          mad TANGO. It takes the camp's collective breath away.\n          Even Darren can't help but enjoy it. Crepsley's arm gives\n          him a twinge or two, but only Truska notices.\n\n                         CUT TO:\n\n          EXT. AN OLD VAN - NIGHT\n\n          A mattress on the floor inside. Using tape and cardboard,\n          Darren 'blacks out' the windows. Crepsley steps over.\n\n                         DARREN\n          Almost done.\n          Crepsley looks to the sky. Still dark. The moon setting.\n\n                         CREPSLEY\n          Darren...\n          (Darren looks over)\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          78.\n\n                         CREPSLEY (CONT'D)\n          I'm not going to sleep here. We'll\n          find a nook in the factory.\n          Crepsley starts off. Darren starts to follow.\n\n                         CRESPLEY\n          Mattress.\n          Darren sighs, goes back to the van to retrieve the mattress.\n          He starts to pull it out, then stops, nearly doubled over.\n          Concerned, Crepsley steps over. Darren waves him off,\n          straightens as whatever it was passes.\n\n                         DARREN\n          I just felt sick for a second.\n\n                         CREPSLEY\n          You need blood.\n          Darren gives him a dirty look, grabs the mattress. They\n          start walking toward the factory.\n\n                         CUT TO:\n\n          EXT. FACTORY - NIGHT\n\n          The SHADOWS of a loading dock. Crepsley and Darren approach.\n\n                         DARREN\n          You think Mr. Tiny might come?\n          Crepsley shrugs, doesn't answer.\n\n                         DARREN\n          Who is he? What does he want?\n\n                         CREPSLEY\n          What we want is who we are, don't\n          you think?\n\n                         DARREN\n          Can't you give me a straight answer\n          just once?!\n\n                         CREPSLEY\n          You won't learn by me telling you.\n          You must live some things to know\n          what they are.\n          Darren sighs in deep frustration. Crepsley has a thought.\n\n                         CREPSLEY\n          Okay. Why do you like spiders?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          79.\n          Darren tires to figure what he's getting at? Implying?\n\n                         CREPSLEY\n          Did you ever think there was a\n          particular reason?\n          It seems Crepsley knows the answer even if Darren doesn't.\n\n                         DARREN\n          No. I never thought about it.\n\n                         CREPSLEY\n          That's the trouble with children.\n          They don't think about things.\n\n                         DARREN\n          I'm not a child.\n          Theystop by the shadows.\n\n                         CREPSLEY\n          Are you a man? If you're not a\n          man, you're a child.\n\n                         DARREN\n          I'm in between.\n\n                         CREPSLEY\n          In between does not exist!\n          The words echo a moment. Darren no closer to understanding.\n\n                         CREPSLEY\n          I'll sleep in here tonight. But\n          sit outside the van tomorrow and\n          make it look like I'm there. It's\n          just caution. Old habits die hard.\n\n                         VOICE\n          And old vampires?\n          Without a sound, someone has reached around the two of them\n          from behind, a RAZOR-KNIFE held to each of their throats.\n          They stand dead still. We can make out the shape of a head\n          as whoever it is leans in ever so slightly from the dark.\n\n                         CREPSLEY\n          Gavner Purl, as always I heard you\n          coming from a mile away.\n          CLICK! In his hand by his side, Mr. Crepsley holds a thin\n          SWITCHBLADE. He presses the steel back ever so slightly.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          80.\n\n                         VOICE\n          We'll call it a draw then.\n          The 'voice' pulls back his knives, steps out. It's GAVNER\n          PURL. He was once handsome, but those days are long gone.\n          His face is crossed with scars. They vary in size, thickness\n          and color. Gavner is a warrior, carries himself so.\n\n                         GAVNER PURL\n          It's been too long, Larten.\n\n                         CREPSLEY\n          Decades now.\n          They embrace. Darren's trying to catch up.\n\n                         DARREN\n          You guys are friends?\n\n                         GAVNER PURL\n          I suppose. We once shared a coffin\n          together. For six months.\n\n                         DARREN\n\n                         (SARCASTIC)\n          Like roommates? To save money?\n\n                         GAVNER PURL\n          We were being hunted.\n\n                         DARREN\n          Who was hunting you?\n\n                         CREPSLEY\n          Never mind. Darren, Gavner Purl.\n          Gavner extends his hand to shake. Darren sees'the scars on\n          Gavner Purl's fingertips. Darren raises his own hand so\n          Gavner can see his scars. Gavner looks at Crepsley.\n\n                         GAVNER PURL\n          A half-vampire?\n\n                         CREPSLEY\n          Of course. We don't make full\n          vampires of our assistants.\n          Gavner Purl looks at Crepsley, stunned.\n\n                         GAVNER PURL\n          Nor do we make assistants of\n          children.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          81.\n          GAVNER PURL (cont'd)\n\n                         (LOSING IT)\n          A child, Larten? Why?!\n\n                         CREPSLEY\n          I have my reasons.\n\n                         GAVNER PURL\n          And they are?\n\n                         CREPSLEY\n          I don't owe answers to vampires\n          anymore. I'm exiled from our kind\n\n                         GAVNER PURL\n          Self-exiled. And I at least am\n          owed an answer.\n          There's a personal history being called upon here. Crepsley\n          is well aware. Darren again is left out.\n\n                         CREPSLEY\n          All I care to say is a boy sought\n          me out, knew who I was. He asked\n          me to make him my assistant.\n          Gavner looks to Darren, suspicious.\n\n                         GAVNER PURL\n          And how did you know --\n\n                         CREPSLEY\n\n                         (INTERRUPTS)\n          It wasn't Darren. Another boy.\n          His blood was bad. I should have\n          killed him, but I didn't.\n          Darren reacts. Gavner considers it all.\n\n                         CREPSLEY\n          I met Darren shortly after. His\n          blood was good or I certainly would\n          have killed him.\n          Darren reacts again.\n\n                         GAVNER PURL\n          How could a boy find you?\n          Crepsley shrugs. Of course he had help.\n\n                         GAVNER PURL\n          Tiny?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          82.\n\n                         DARREN\n          He tried to kill us.\n\n                         CREPSLEY\n          He tried to kill me. What he\n          wanted with you wasn't determined.\n\n                         GAVNER PURL\n          Perhaps you chose the wrong boy.\n          In Mr. Tiny's eyes.\n          A moment as they consider the unspoken implications.\n\n                         DARREN\n          What are you guys talking about!?\n          No answer as Crepsley and Gavner lock each other in a look.\n\n                         CREPSLEY\n          What's important enough to track\n          down an exile? What is your news?\n\n                         GAVNER PURL\n          War.\n\n                         CREPSLEY\n          I'm not interested in your wars.\n\n                         GAVNER PURL\n          Well the other side is interested\n          or they wouldn't be trying to get\n          rid of you.\n          Crepsley gets suddenly very angry.\n\n                         CREPSLEY\n          I've had enough killing! No more!\n          You've come to the wrong place. I\n          am the wrong place...\n          Gavner raises his hands in surrender.\n\n                         GAVNER PURL\n          Even so, I'm glad you're alive.\n\n                         CREPSLEY\n\n                         (RELENTING)\n          The sun is coming. Will you stay?\n\n                         GAVNER PURL\n          I can still make miles. The war\n          won't wait. And neither will bad\n          news. I have to go.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          83.\n\n                         CREPSLEY\n          Then travel safely.\n\n                         GAVNER PURL\n          Would you mind if I walk a bit with\n          your assistant?\n\n                         CREPSLEY\n          Take him with you if you want.\n          He's of little use to me.\n\n                         CUT TO:\n\n          EXT. FIELD - NOT FAR OFF - NIGHT\n\n          Darren and Gavner Purl walk. Gavner looks him over.\n\n                         GAVNER PURL\n          You look sick. Doesn't Larten feed\n          you?\n\n                         DARREN\n          I won't drink blood if that's what\n          you mean. I promised myself.\n\n                         GAVNER PURL\n          Why?\n\n                         DARREN\n          You'll get insulted.\n          As Gavner waits for Darren to tell him...\n\n                         DARREN\n          I'm afraid if I drink blood, I'll\n          become evil.\n          Gavner LAUGHS out loud, catches himself.\n\n                         GAVNER PURL\n          The only thing drinking blood will\n          do to you is keep you alive.\n\n                         DARREN\n          That's how it would start. I would\n          swear it was just to stay alive.\n          But what'll I turn into? You're on\n          one side of the fence or the other.\n          My father used to say that and now\n          I know what he meant.\n          The 'father part' chokes Darren up a bit.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          84.\n\n                         GAVNER PURL\n          You've already turned, Darren. You\n          need to accept what you've already\n          become. There's no going back.\n          They walk in silence a moment. Then:\n\n                         DARREN\n          Why did Crepsley make himself an\n          exile anyhow?\n\n                         GAVNER PURL\n          He was tired of all the killing.\n          We were at war.\n\n                         DARREN\n          With the vampaneze?\n\n                         GAVNER PURL\n          Crepsley was once a Vampire\n          General. One of our great leaders.\n          He may seem reluctant, but I assure\n          you, no one is as skilled at\n          killing vampaneze than Crepsley is.\n          I think that's why they'd like to\n          get him out of the way. Kill him\n          off before the new war starts.\n\n                         DARREN\n          You've known him a long time?\n\n                         GAVNER PURL\n          I was his assistant. He blooded\n          me, as he blooded you.\n          There's almost something comforting in this news. Gavner\n          Purl so proud and strong looking. Darren wants to know...\n\n                         DARREN\n          Why'd he choose you?\n\n                         GAVNER PURL\n          To teach me to kill vampaneze. Up\n          until now, it's the only reason he\n          ever chooses anyone.\n\n                         DARREN\n          Is it why he chose me?\n          Gavner hesitates, not sure.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          85.\n\n                         GAVNER PURL\n          That's for Crepsley to say. Not\n          me.\n          Another brick wall, but Darren accepts it.\n\n                         GAVNER PURL\n          Do you know what the biggest danger\n          is to a vampire, Darren?\n\n                         DARREN\n          The vampaneze? Mr. Tiny?\n\n                         GAVNER PURL\n          No. It's that they live so long\n          they no longer care. Everything\n          they love is left behind until they\n          finally have nothing left to live\n          for. Except death. The fact that\n          he's taken an apprentice seems, to\n          me, a good sign. A sign that he's\n          thinking of living not dying.\n\n                         DARREN\n          Lucky for me. Glad I could help.\n          All the same Darren considers what he's heard. Gavner,\n          meanwhile, considers the open countryside ahead.\n\n                         GAVNER PURL\n          A clear run. Good.\n          Gavner gives Darren one last appraising look.\n\n                         GAVNER PURL\n          Stay by him, Darren. Stay by him.\n          Gavner takes a deep breath. The air around him shimmers, his\n          image bouncing in and out of phase like an electron heating\n          up. And then he's gone.\n\n                         DARREN\n          That part is definitely cool.\n\n                         CUT TO:\n\n          EXT. THE SUN - DAY\n\n          High in the noon sky. PAN DOWN to where Darren stands under\n          a tree by the old van. He concentrates, looks himself over.\n          Nothing. He concentrates again. He's trying to flit.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          86.\n          Very briefly -- the air shimmers around him -- then stops.\n          He looks at his arms. Little WISPS of smoke come off them.\n\n                         EVRA\n\n                         (ARRIVING)\n          What's up?\n\n                         DARREN\n          Nothing.\n\n                         EVRA\n\n                         (SNIFFS AIR)\n          It's smells like burnt hair.\n\n                         DARREN\n          Don't know. I'm congested.\n\n                         (SEES SOMETHING)\n          Hey...\n          Evra follows his gaze, turns just in time to see:\n\n                         THEIR POV\n          Debbie and Sam ducking inside the factory.\n\n                         DARREN & EVRA\n          Exchange a look. Start after them.\n\n                         CUT TO:\n\n          INT. FACTORY FLOOR - DAY\n\n          Where the show was the night before. Light streams down from\n          gaps in the decrepit roof. No sight of Debbie and Sam as\n          Darren and Evra make their way in.- They pause at a CREAKING\n          coming from somewhere overhead. As they move...\n\n                         CUT TO:\n\n          INT. UPPER FLOOR - FACTORY - DAY\n\n          Darren and Evra come off a rickety staircase, pass through a\n          half-rotted door. There are holes in the roof overhead and\n          huge gaps on the floor where the boards have fallen through.\n          They see Sam, his back to them, staring out a smashed window.\n\n                         EVRA\n          Let's scare the crap out of him...\n          They begin to creep in, flanking the unsuspecting Sam. But\n          as they get close, a SHAPE drops down behind them!\n\n                         \n\n                         \n\n                         \n\n                         \n\n          87.\n\n                         SHAPE\n\n          ARRRGGGH!\n          Darren and Evra are the ones who jump. The shape is Debbie!\n          She almost falls over laughing. So does Sam.\n\n                         DEBBIE\n          You should see the look on your\n          faces.\n          But Evra and Darren are not laughing.\n\n                         EVRA\n          What're you doing here?\n\n                         DEBBIE\n          We could ask you the same thing.\n          We come here all the time. My\n          grandfather used to work here.\n\n                         DARREN\n          Must've been a long time ago.\n\n                         DEBBIE\n          He says now it's like one of those\n          bombed out World War II cathedrals.\n          Empty of what is used to be.\n          An odd little moment till Sam breaks it.\n\n                         SAM\n          Hey, we loved the show, man. It\n          was off the hook.\n\n                         EVRA\n          (messing with him)\n          Off the hook, huh? I'll tell all\n          the freaks you said so.\n\n                         SAM\n          Are you guys on your own? Just\n          traveling. No parents or nothing?\n\n                         DARREN\n          No. No parents.\n          He says it with a little twinge that Debbie picks up on.\n\n                         SAM\n          School?\n\n                         EVRA\n          No school either.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          88.\n\n                         SAM\n          You're the luckiest guys on earth.\n          Wanna switch places?\n\n                         DARREN\n          You have to be different to be\n          here.\n\n                         DEBBIE\n          Different how?\n          Evra steps into a slash of sunlight and his skin flashes to\n          life, the green of his scales catching the rays. Debbie's\n          mouth drops. They couldn't see it in the dark last night.\n\n                         EVRA\n          Everyone has a place they belong.\n          The Cirque du Freak is ours.\n\n                         DEBBIE\n          I think your skin is beautiful.\n          That wins Evra over.\n\n                         DEBBIE\n          Can I touch it?\n          Evra holds out his arm. Debbie traces a finger across it.\n\n                         DEBBIE\n          Wow. Has it always been this way?\n\n                         DARREN\n          He's a snake-boy.\n\n                         DEBBIE\n          You shouldn't call him names\n          because he looks different.\n\n                         EVRA\n          It's okay. I am a snake boy.\n\n                         SAM\n          You could say you're\n          dermatologically challenged.\n          They all LAUGH. Debbie considers Evra a beat, then Darren.\n\n                         DEBBIE\n          What about you, Darren? How are\n          you different?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          89.\n\n                         DARREN\n          I get scared easy.\n          Darren looks up toward the rafters. From where she dropped.\n\n                         DARREN\n          How'd you get up there anyhow?\n\n                         DEBBIE\n          You mean, how did a girl get up\n          there?\n\n                         CUT TO:\n\n          EXT. FACTORY ROOF - DAY\n\n          A spot where the roofing is gone, several long RAFTERS\n          stretch out. Darren, Evra and Sam watch Debbie walk out on\n          one. Like a balance beam. The factory floor 70 feet below.\n\n                         EVRA\n          Hey, be careful.\n\n                         SAM\n          Don't worry. She's like a gymnast.\n          Debbie moves slowly at first, her arms stretched out for\n          balance. Then she does a hop, a skip. Darren and Evra gasp.\n          She gets to the other side, turns and bows.\n\n                         DARREN\n          You're crazy!\n\n                         DEBBIE\n          How about you?\n\n                         DARREN\n          I got nothing to prove.\n\n                         DEBBIE\n          But it'd be easier for you than me.\n\n                         DARREN\n          Why's that?\n\n                         DEBBIE\n          Because chickens have wings.\n          She starts chicken CLUCKING. Mad, Darren steps onto a\n          rafter, starts across. He stops in the middle, spins around.\n          Aided immeasurably by his half-vampire skills.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          90.\n          Debbie is impressed.\n\n                         ANGLE OVERHEAD\n          The vertigo angle as Debbie walks back out on her rafter.\n          Stops about 4-feet across from Darren.\n\n                         DARREN & DEBBIE\n          Darren crosses his arms across his chest. No big deal.\n\n                         DEBBIE\n          Let's play mirrors.\n\n                         DARREN\n          What's that?\n\n                         DEBBIE\n          I do something and you have to copy\n          me. Like this.\n          Debbie crosses her arms the same way Darren has. He\n          uncrosses them as he realizes.\n          Debbie reaches down, touches her toes. Darren sighs, then\n          does the same, gets a good look at the floor below.\n          Debbie takes one foot off the rafter, takes hold of the top\n          of it with one hand, raising the other arm out for balance.\n          Looks like a ballerina.\n          Evra doesn't like this daredevil stuff.\n\n                         EVRA\n          Come on, guys...\n          Darren hesitates. Not because he won't do it, but because\n          maybe for the first time in his life, he's really fascinated\n          by a girl. Debbie misreads, starts CLUCKING again.\n          Darren smiles, repeats her move effortlessly.\n          Without warning, Debbie leaps the gap, lands on the rafter\n          alongside Darren. As she struggles a bit for balance, Darren\n          reaches out and steadies her. As they come face to face.\n\n                         DEBBIE\n          There definitely something\n          different about you. I just can't\n          figure it out.\n\n                         DARREN\n          Is Sam your boyfriend?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          91.\n\n                         DEBBIE\n          He's my cousin.\n\n                         DARREN\n          Oh...\n          A funny, awkward beat out on the rafter. Finally...\n\n                         DARREN\n          We should get off this.\n          She nods, a bit smitten. Darren turns. As they start off...\n\n                         DARREN\n          Chalk it up to lack of blood, but everything starts spinning.\n\n                         DARREN'S POV\n          The area is like a big drain and he's whirling down it.\n\n                         RAFTER\n          Darren legs go out and he falls off. As Debbie screams...\n          Darren CATCHES HOLD of the rafter just as he drops past it.\n\n                         DEBBIE\n          Hold on.\n          Debbie grabs his arm. Evra starts out to help, but the\n          rafter CREAKS OMINOUSLY. He stops. Sam states the obvious.\n\n                         SAM\n          I don't think it'll hold you, dude.\n\n                         EVRA\n          Thanks for the heads up... Bro.\n\n                         DARREN\n          (shakes it off)\n          It's okay. I'm okay.\n          Darren swings up a leg, hooks it over the rafter. A beat and\n          he's back on top. Debbie relieved. Evra backs up the way he\n          came and in a few seconds they're all safely off the rafter.\n\n                         DEBBIE\n          I don't know how you hung on. I\n          couldn't have.\n\n                         DARREN\n          You wouldn't have fallen in the\n          first place... I just got dizzy.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          92.\n\n                         DEBBIE\n          Maybe you need to eat something.\n          Darren looks at her. She has no idea.\n\n                         EVRA\n          Well, the food's down on ground\n          level. Let's get out of here.\n          Sam and Debbie start off, Darren and Evra following. As Sam\n          and Debbie start down a ladder, Darren hangs back a beat.\n\n                         DARREN\n          She's kind'of cool, huh? I mean,\n          for a girl.\n\n                         EVRA\n          I like her. She asks a lot of\n          questions though.\n\n                         DARREN\n          She's just curious.\n\n                         EVRA\n          There's no such thing as 'just'\n          with a girl.\n\n                         DARREN\n          What makes you such an expert?\n\n                         EVRA\n          My snake's a girl.\n\n                         CUT TO:\n\n          EXT. FACTORY - SUNSET\n\n          The sun peeps below the horizon.\n\n                         CUT TO:\n\n          INT. FACTORY PASSAGE - NIGHT\n\n          Darren walks along, flashlight in hand. Going somewhere. He\n          suddenly stops, listens, not sure if he heard something. A\n          following FOOTSTEP?\n          MOVE WITH Darren as he continues. As he passes through a\n          doorway, he ducks around the corner. Waits a few beats.\n          Then he leaps out to see who's following. No one's there.\n          Shaking his head, he continues on.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          93.\n\n          INT. BOILER ROOM - FACTORY - NIGHT\n\n          Darren knocks on a door, waits a beat before it opens and\n          Crepsley emerges from his sleeping place.\n\n                         CREPSLEY\n          Good morning, Darren.\n\n                         DARREN\n          What's good about it?\n          Crepsley looks him over, doesn't like what he sees.\n\n                         CUT TO:\n\n          EXT. CIRQUE CAMP - NIGHT\n\n          Bustling with activity. Nearly show time. Crepsley stands\n          by an open tent flap watching Darren cross camp. Not well.\n\n                         DARREN\n          He stops as Sam and Debbie catch up with him.\n\n                         SAM DEBBIE\n          Hey, Darren. Hi...\n          Darren's happy to see them.\n\n                         DARREN\n          You guys are coming to the show\n          again tonight?\n\n                         DEBBIE\n          Of course. Evra's doing his snake\n          act tonight.\n\n                         DARREN\n          Oh, you came to see Evra.\n\n                         DEBBIE\n          And you...\n          Darren smiles shyly at that.\n\n                         SAM\n          I was hoping for Amanda Bynes.\n          Darren sees Crepsley watching him from the tent.\n\n                         DARREN\n          Hey, I'll catch up with you later.\n          I got some stuff I gotta finish up.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          94.\n          They watch as Darren heads off.\n\n                         SAM\n          He's gonna be gone in another day\n          or two. Tonight's the last show.\n\n                         DEBBIE\n          I know that. So?\n\n                         SAM\n          So stop looking at him like you\n          love him.\n\n                         DEBBIE\n          You're such an idiot, Sam.\n\n                         TENT OPENING\n          Darren joins Crepsley, a little unsteady.\n\n                         CREPSLEY\n          Look at you. You can barely stand.\n\n                         DARREN\n          I'm fine.\n\n                         CREPSLEY\n          You need to feed. You need blood..\n\n                         DARREN\n          No! I won't let you hunt some poor\n          person down for me. I --\n          Crepsley grabs hold of Darren, hauls him into...\n\n                         THE TENT\n          Dark, the inside walls richly embroidered. Medieval.\n\n                         CREPSLEY\n          No need to hunt. There's someone\n          here willing to save you.\n          From the shadows: Madam Truska. Startlingly beautiful. She\n          steps up. Eyes on Darren, she offers Crepsley her wrist.\n\n                         MADAM TRUSKA\n          By my own free will, Darren Shan.\n          As Crepsley's fingernail hovers, ready to open a vein.\n          Darren shakes his head. 'No'.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          95.\n\n                         CREPSLEY\n          Drink or you'll die.\n\n                         DARREN\n          No. I can't. I'm human.\n          Crepsley releases Truska's arm.\n\n                         CREPSLEY\n          You're not! And you'll be nothing!\n          Darren stands there as noble and sad as a boy could be.\n\n                         DARREN\n          I am human. In my heart I am.\n          A great big TEAR rolls down Truska's cheek. That's the last\n          thing Crepsley needed to see. He's defeated.\n\n                         CUT TO:\n\n          INT. FACTORY SPACE - NIGHT\n\n          People in their seats or taking them. Darren is back in his\n          role as usher. He seats two people, wipes at the sweat\n          beading on his forehead. He's getting sicker.\n          He sees Debbie. She and Sam are already seated across the\n          way. She smiles, waves. Darren forces a smile,, waves back.\n          Looking for more patrons, Darren nearly walks into... A\n          FIGURE. A hat pulled down obscures his face.\n\n                         VOICE\n          An usher in the house of usher.\n          And I can't seem to find a seat.\n          Darren frowns at the odd voice, but leads down the aisle.\n\n                         DARREN\n          This way.\n          Darren brings him down to a handful of seats. The figure\n          looks up from under the brim of his hat. It's Mr. Tiny.\n\n          MR. TINY\n          Join me.\n\n                         DARREN\n          I don't think so.\n          As Darren moves to go, Mr. Tiny clamps a hand around his\n          wrist. Like iron. He sits, pulling Darren down beside him.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          96.\n\n          MR. TINY\n          It's time we had a few moments.\n          Folks involved in epic struggles\n          should get to know each other.\n          Darren doesn't answer.\n\n          MR. TINY\n          Has Crepsley told you about me?\n          Explained me?\n\n                         DARREN\n          He said you can't be explained.\n          You need to be experienced.\n\n          MR. TINY\n          He gives me too much credit.\n\n                         DEBBIE\n          Hey, Darren.\n          Darren looks up to see Debbie and Sam. Oh no...\n\n                         DEBBIE\n          We're gonna sit on this side.\n\n                         SAM\n          Cuz we miss you so much.\n          She digs Sam with her elbow. They sit just a row in front.\n\n          MR. TINY\n\n                         (WHISPERS)\n          Choosing sides can only lead to\n          trouble. Never, ever choose sides\n          unless it's your own.\n\n                         DARREN\n          You've chosen the vampaneze.\n          Mr. Tiny laughs, slaps his knee even.\n\n          MR. TINY\n          Is that really what you think? A\n          smart boy like you?\n          And the lights drop. A trumpet blasts and all is silent.\n\n          ON THE STAGE\n          The little people wheel out a CAGE. There's a gurgled GROWL.\n          The little people retreat. Several audience members lean in,\n          then SCREAM as the wolfman CRASHES to the front of the cage.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          97.\n          A white spot shines down on Mr. Tall.\n\n          MR. TALL\n          Ladies and Gentlemen...\n\n          DARREN & MR. TINY\n\n          MR. TINY\n          .subjugators and saps...\n\n          MR. TALL\n          Welcome to the Cirque du Freak. We\n          are an ancient circus...\n          As Mr. Tall drones on...\n\n          MR. TINY\n          Oh, his speeches are impossible.\n          Mr. Tiny opens his free hand. His pocket watch melts up into\n          view from his palm. Time begins to speed up around them.\n          Mr. Tall's voice speeds to a BUZZ as he 'keystone cops' off\n          the stage and Rhamus 'keystones' on. The audience's small\n          movements become rattles and shakes.\n          Only Darren and Mr. Tiny are at normal speed.\n\n          MR. TINY\n          I'm not so complicated, Darren.\n          During war there are those who\n          profit. A war between vampires and\n          vampaneze would have terrible\n          consequences. Therefore...\n\n                         DARREN\n          Terrible profits.\n\n          MR. TINY\n          Excellent. I am a profiteer. I\n          exact fees and gains. I'm simple.\n          On stage, Madam Truska exits and Evra 'keystones' through his\n          performance with his snake.\n\n          MR. TINY\n          Did Crepsley tell you of the\n          prophesy?\n\n                         DARREN\n          What prophesy?\n\n                         \n\n                         \n\n                         \n\n                         \n\n          98.\n\n          MR. TINY\n          They say the final battle between\n          vampires and vampaneze will be\n          decided by a child. That's why the\n          vampires won't blood children. To\n          avoid the end of the world.\n          As these words are pondered by Darren...\n\n          MR. TINY\n          I think I underestimated you. I\n          think you could be wonderful.\n\n                         DARREN\n          I think you're a creep. I think\n          you suck.\n\n          MR. TINY\n          Too bad.\n          Mr. Tiny closes his hand around the watch. Time returns to\n          normal. The applause for Evra slowing down to normal speed.\n          As he walks off the stage, Debbie looks back at Darren.\n\n                         DEBBIE\n          He was great!\n          As she looks back to the stage someone sits on Darren's other\n          side. Collar pulled up, head wrapped in a scarf. Murlough!\n\n                         MURLOUGH\n          (low; re: Debbie)\n          Is it Dar-wren's girlfriend?\n\n                         DARREN\n          Forget about her --\n          Murlough takes hold of Darren's other wrist. Still low:\n\n                         MURLOUGH\n          She has plenty of lovely blood\n          inside. Inside, outside, hmmm?\n          Darren struggles. Murlough pulls him close, HISSES in his\n          ear, flashing those filthy teeth.\n\n                         MURLOUGH\n          I don't care about humans. I don't\n          care about you. But the vampire -\n          Larten Crepsley - him I care about.\n\n                         (ALMOST SHY)\n          Murlough is a vampire killer.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          99.\n          On stage: the spotlight hits Crepsley.\n\n                         DARREN\n          You guys are in trouble. There's\n          more than one vampire now. Gavner\n          Purl is here.\n          Murlough reacts to the name. Does not like it.\n\n                         MURLOUGH\n          Have you seen Purl Gavner's face?\n          Young Murlough sliced it for him.\n\n          MR. TINY\n          Darren, you're a liar. He's a\n          thousand miles gone by now. And\n          master Crepsley is right there.\n          As he points at Crepsley...\n\n                         CREPSLEY\n          Holding Madam Octa's cage. Aware something's 'in the air'.\n\n                         MURLOUGH\n          Shimmers, phases into flit mode. Disappears.\n\n                         DARREN\n          Crepsley! Look out!\n          The audience LAUGHS. Like Darren's worried about Madam Octa.\n          Debbie looks back, knows something is wrong. Sees Mr. Tiny's\n          hand around Darren's wrist.\n\n                         STAGE\n          As Murlough 'appears' alongside Crepsley.\n          Madam Octa's cage drops to the stage as Murlough knocks\n          Crepsley fifteen feet through the air. He lands flat on his\n          back. The audience CHEER! Think it's part of the show.\n          Murlough reaches into his jacket, produces a razor-sharp LONG\n          KNIFE in either hand.\n          Crepsley pops to his feet. As his own single BLADE\n          'switches' to life in his hand...\n\n          DARREN & MR. TINY\n          As Darren struggles, Mr. Tiny switches his grip to the back\n          of the boy's neck. That holds him.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          100.\n\n                         STAGE\n          CHEERS as Murlough charges forward, the long knives\n          pinwheeling in his hands. His attack is brutal and blunt.\n          Crepsley is driven back, parrying each thrust and attack as\n          it comes. Sparks fly as the blades connect.\n          From out of nowhere, Crepsley adds a BACKHAND to the mix. It\n          catches Murlough hard across the chops.\n\n                         OFF STAGE\n          Mr. Tall and Evra watch. Not knowing what to do.\n\n                         STAGE\n          Murlough swings back wildly. Crepsley catches the blade in\n          Murlough's left hand with the one in his right.\n          Crepsley catches Murlough's left wrist, the second blade\n          dangerously close to retracing the scar on Crepsley's face.\n          Crepsley throws himself back, sending Murlough head over\n          heels across the stage and SLAMMING into a concrete wall.\n\n                         DARREN\n          Concentrating. Trying to flit.\n\n                         STAGE\n          Murlough rolls to his feet, charges. It's brute force versus\n          style. But as Crepsley moves to sidestep, Murlough's not so\n          brutish after all. He matches the move --\n          Buries one of his knives into Crepsley's stomach. Crepsley\n          reacts, frozen in shock.\n\n          DARREN & MR. TINY\n          The audience around them unsure. Many shocked. It's part of\n          the show, right? Darren sees Murlough raise the other knife\n          to finish Crepsley off. Darren trembling, phasing.\n          And Mr. Tiny's holding nothing but air. Darren is gone.\n\n          DARREN (FLIT WORLD)\n          Speeding down to the stage. The dagger descends in slo-\n          motion, but it's only a centimeter or two from it's target.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          101.\n\n                         STAGE\n          Darren reappears, leaps onto Murlough's back, knocks him off\n          target. As Murlough staggers right, Crepsley staggers left.\n          Murlough regroups, charges after him. Badly hurt, stumbling,\n          Crepsley falls off the edge of the stage. Disappears.\n          ROARING, Murlough grabs Darren. They disappear as well.\n\n          MR. TINY\n          Sighs. This is not how it's supposed to go. Sam and Debbie\n          leave their seats, head for the stage.\n\n                         CUT TO:\n\n          INT. FACTORY - NIGHT (FLIT WORLD)\n\n          Murlough with Darren in tow, looking high and low for\n          Crepsley. Moving past the barely moving Mr. Tall and Evra.\n\n          CREPSLEY (FLIT WORLD)\n          His back to a wall. Trying to hold it together. Frozen\n          PATRONS facing the exit beyond. As he'loses his flit power,\n          the patrons suddenly resume real speed for the exits.\n\n                         CUT TO:\n\n          INT. BOILER ROOM - NIGHT\n\n          The old power plant. Pipes and catwalks. Murlough and\n          Darren here. A chain hangs from the ceiling. Murlough lifts\n          Darren, wraps it around his ankle. Hangs Darren upside down!\n\n                         MURLOUGH\n\n          CREPSLEY!\n\n                         CUT TO:\n\n                         CREPSLEY\n          Reacting to Murlough's voice.\n\n                         CUT TO:\n\n          BOILER ROOM - FACTORY\n          Murlough twists Darren's arm. Darren SCREAMS out in pain.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          102.\n\n                         EVRA\n          Reacting as Debbie and Sam arrive. They move toward it.\n\n                         CUT TO:\n\n                         CREPSLEY\n          Listening as the scream fades off. Clutching his stomach,\n          Crepsley moves.\n\n                         CUT TO:\n\n          BOILER ROOM - FACTORY\n          Murlough pulls Darren a little higher. They're face-to-face,\n          though Darren is upsidedown.\n\n                         MURLOUGH\n          Crepsley will come for his\n          assistant.\n\n                         DARREN\n          He doesn't care about me.\n\n                         MURLOUGH\n          Murlough has an assistant, too. A\n          smart one, smarter than you.\n          As Murlough says this, Darren looks past as stepping up,\n          grinning, is Murlough's assistant.\n\n                         DARREN\n          Steve?\n          Steve! Steve holds up his hands so Darren can see the WHITE\n          SCAR on the tip of each finger. He gets closer.\n\n                         STEVE\n          Mr. Tiny made my dream come true.\n          Only better. I'm half vampaneze\n          instead of a stupid half vampire.\n          Mr. Tiny says I have a destiny. He\n          says he's gonna make sure of it.\n\n                         DARREN\n          Is that who you talked to? Was\n          that the internet guy? Mr. Tiny?\n\n                         STEVE\n\n                         (LAUGHS)\n          Pretty funny, huh? He introduced\n          himself after you left town.\n\n                         (MORE)\n\n                         \n\n                         \n\n                         \n\n                         \n\n          103.\n\n                         STEVE (CONT'D)\n          But, I think I've known him a long\n          time in my head. In my bad, bad\n          blood.\n          Chilling. Maybe Steve is evil. He leans in even closer.\n\n                         STEVE\n          He gave me back the dream you\n          stole.\n          Murlough motions Steve quiet, slaps a hand over Darren's\n          mouth. Listens. Smiles. Whispers.\n\n                         MURLOUGH\n          Crepsley comes.\n\n                         CUT TO:\n\n          INT. APPROACH PASSAGE - FACTORY - NIGHT\n\n          Crepsley moving forward. Hurting. He slows, stops. As he\n          looks back over his shoulder. Something's behind him.\n\n          EVRA, DEBBIE & SAM\n          Freeze as Crepsley looks back in the direction from which\n          they follow. From their POV, Crepsley suddenly disappears.\n\n                         SAM\n          Where'd he go?\n          They jump as Crepsley appears right in front of them.\n\n                         CREPSLEY\n          Evra... Get them out of here.\n\n                         EVRA\n\n                         BUT --\n          Evra knows it's useless. As he nods, Crepsley turns and\n          strides back toward where he had been.\n          Sam and Debbie exchange a look. What the Hell?\n\n                         EVRA\n          You guys better go back.\n\n                         SAM\n          What are you gonna do?\n\n                         EVRA\n          Darren's my friend.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          104.\n\n                         DEBBIE\n          Ours too.\n          Sam's not so sure, but he nods in agreement.\n\n                         CUT TO:\n\n          INT. BOILER ROOM - FACTORY - NIGHT\n\n          Darren swings back and forth in long strokes like a pendulum,\n          a rag stuffed in his mouth to silence him.\n\n                         DARREN'S POV\n          Sweeping the room. Wait! It fixes on a doorway. There's\n          Crepsley. Looking about, everywhere but at Darren.\n\n                         BOILER ROOM\n          Crepsley speaks to 'the room'.\n\n                         CREPSLEY\n          I can smell it. Why does it hide?\n\n                         (STEPPING UP)\n          The vampire is here.\n          WHUMP! Murlough drops from above. Lands ten feet in front\n          of Crepsley. As they begin to arc around each other.\n\n                         MURLOUGH\n          The vampire will die.\n\n                         STEVE'S VOICE\n\n                         (FROM ABOVE)\n          Let's get readyyyyy to rumble!\n          Crepsley looks up, reacts.\n\n                         CREPSLEY\n          Even the creatures of the night\n          watch too much TV.\n          Darren swings past through the middle of it all.\n          Murlough charges.\n          Crepsley sidesteps Darren, decides to take the fight higher.\n          He leaps up, swings himself up onto one of the catwalks.\n          Murlough follows. They use the room steel as monkey bars as\n          they climb, clash. Violent, quick attacks. Crepsley gaining\n          a position, abandoning it as Murlough SLAMS in.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          105.\n\n                         DARREN\n          Has lost sight of them, he can only hear the battle now. He\n          reacts as Evra, Debbie and Sam rush out. Evra takes hold,\n          lifts, tries to lessen the load on the chain.\n\n                         EVRA\n          Sam, unhook his legs.\n          As Sam struggles, Debbie pulls the rag from Darren's mouth.\n\n                         DARREN\n          Are you guys nuts? Get outta here!\n\n                         EVRA\n          It's against our code.\n          Suddenly unhooked, Darren hits the ground. He looks up at\n          Evra who grins down at him.\n\n                         EVRA\n          Never leave a freak behind.\n\n                         CUT TO:\n\n                         CEILING SUPERSTRUCTURE\n          On the catwalks Murlough draws his knives. Crepsley jumps\n          to the space he wants to defend, draws his own. Murlough\n          counters. Two very serious predators'-at work. The animal\n          kingdom at its killing best.\n          A charge. Murlough a bull, Crepsley a matador. He redirects\n          one of Murlough's arcing arms, smashing it against a metal\n          housing. One of the vampaneze's knives clatters away.\n          It's not graphic or bloody, but several times Crepsley's\n          knife finds its way into Murlough's body. It enrages him,\n          but Crepsley continues dealing out punishment.\n          He's now like a brilliant counter-puncher, even as he\n          inadvertently backs his way into a corner.\n          But as quarters close in, Murlough's rage works to his\n          advantage. He charges into Crepsley, his lowered shoulder\n          sending Crepsley through the air and into...\n          And through a BRICK WALL. Into the thin air outside! Still\n          raging, Murlough nearly falls through himself. Instead, he\n          slips, drops about twenty feet down inside the building!\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          106.\n\n          EXT. ASPHALT - NIGHT\n\n          Crepsley falls sixty feet, lands flat on his back, as brick\n          and concrete rain on top of him...\n\n                         CUT TO:\n\n          INT. FACTORY - NIGHT\n\n          As Evra pulls Darren along. Debbie and Sam riding shotgun.\n\n                         EVRA\n          Come on!\n\n                         DARREN\n          Evra. I think I'm dying.\n          He looks horrible.\n\n                         DEBBIE\n          Let's carry him if we have to.\n          Evra and Sam support him on either side. They continue,\n          start across part of a darkened backstage area.\n          A dark rectangular shape looms ahead. We hear a GUTTURAL\n          GROWL, sees eyes glow in the gloom. They freeze.\n\n                         EVRA\n          It's okay. It's the wolfman. He's\n          in his cage.\n          They move forward again, the cage becomes visible. But\n          another SHAPE beside it. Steve. He sets his hand on the\n          cage's heavy latch. He's going to open it.\n\n                         EVRA\n          No don't!\n\n                         STEVE\n          Ooops...\n          Steve lifts the latch. Even he doesn't expect the force the\n          wolfman hits the door with. Whaanngg! It's out.\n          Evra steps bravely forward. The wolfman sends him flying.\n          Sam can't hold Darren up by himself. He doesn't even see the\n          Wolfman leap over. As Darren sinks to the floor...\n          The wolfman tears into Sam...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          107.\n\n                         DEBBIE\n          Reacts in horror.\n\n                         STEVE\n          He's more surprised than shocked. Until the wolfman looks\n          his way. Then he heads for the hills, disappears into the\n          dark. The wolfman turns back toward Debbie.\n          She backs away, takes off up a rickety stairway. The wolfman\n          HOWLS, then follows.\n          Darren's too weak to follow, near tears in frustration and\n          regret. He watches after them, then he looks over at Sam.\n          Sam who is dying. Just a few feet away. His eyes flicker to\n          Darren's. He tries to say something, but can't.\n\n                         DARREN\n          Oh Sam. Oh no...\n          Darren crawls over, takes Sam's bloody hand.\n\n                         SAM\n          Go save Debbie, Darren...\n          Sam manages the smallest smile. As his eyes drift shut...\n\n                         SAM\n          I think she loves you...\n          From above, we hear Debbie SCREAM. Darren considers Sam's\n          blood, knows what he has to do. Leave his humanity behind\n          and cross the line. He needs to drink Sam's blood.\n\n                         DARREN\n          Forgive me, Sam, but I need\n          strength. I need blood.\n          As Darren extends his nails over Sam's wrist...\n\n                         DARREN\n          We're going to save her together.\n\n                         CUT TO:\n\n          INT. UPPER FLOOR - FACTORY - NIGHT\n\n          Debbie backing into a corner. The wolfman almost on her...\n\n                         \n\n                         \n\n                         \n\n                         \n\n          108.\n          Murlough arrives! Pure animal action as he tears into\n          wolfie, sends him retreating, licking his wounds into the\n          darkness. Murlough heaves for breath, pretty beat up\n          himself. And here comes Steve. Cautiously.\n\n                         STEVE\n          Is Crepsley dead?\n\n                         MURLOUGH\n          Who knows? Young Murlough lives,\n          but he's hurt.\n\n                         STEVE\n          What can I do?\n\n                         MURLOUGH\n          What can Dar-wren's girlfriend do?\n          We need to get the blood inside\n          outside. Don't we?\n          Then we hear it: a blood-curdling scream filters up. It's:\n\n          DARREN! - BACKSTAGE AREA\n          He's drunk Sam's blood. He rises. His sickness wicking off\n          him. Strength descending. Empowered. Furious. He screams\n          again, the sound taking shape into words.\n\n                         DARREN\n\n          FORGIVE ME!!!\n\n          FACTORY STAGE SPACE\n          The audience who haven't left react as the chilling sound\n          reaches them.\n\n          BACKSTAGE AREA - FACTORY\n          Fully 1/2 vampire powered, he takes the stairs two at a time.\n\n                         UPPER FLOOR\n          Murlough, looming over Debbie, smiles as Darren arrives.\n\n                         DARREN\n          Let her go.\n\n                         STEVE\n          Stop being a big shot. This isn't\n          like stopping some fight at school.\n\n                         DARREN\n          Shut up, Steve.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          109.\n          Murlough's eyes go very, very dark. He attacks.\n          Darren tries to meet the onslaught, but he's bowled over.\n          Knocked in a heap.\n          Debbie moves to go after Murlough from behind. She's going\n          to go down fighting as well. But Steve intercepts her. He's\n          pretty powerful himself.\n          Murlough pulls Darren to his feet, stands him up. He swings\n          his fist in a vicious arc.\n          Darren just ducks it and Murlough's fist SMASHES right\n          through the wall (an inside wall) alongside Darren's head.\n          Murlough's getting tired of Darren.\n\n                         MURLOUGH\n          You need to stand still so you can\n          die.\n          But as he attempts to pull his arm back through, he can't.\n          He frowns. Then his eyes widen in pain.\n          Murlough jerks his arm back as hard as he can. The wall\n          smashes open as Murlough brings his arm back through with\n          Crepsley hanging onto the end of it.\n\n                         FACTORY SPACE\n          The audience who remain chanting: \"Refund! Refund!\" They\n          react as debris falls from above, smashes to the stage.\n\n          UPPER FLOOR - FACTORY\n          Crepsley brings up his knife.\n          Murlough catches him by the wrist with one hand.\n          With the other he grips Crepsley by the throat, SLAMS him\n          hard into an I-beam pillar. Again. Then he squeezes. We\n          can hear the cartilage crunching in Crepsley's throat.\n          But Crepsley covers his own right hand with his left. He\n          drives the knife blade INTO MURLOUGH'S HEART!\n          Murlough looks down at the handle of the knife, then back at\n          Crepsley whose throat he still holds.\n          Murlough gives him a lopsided grin and then pitches back,\n          falling through one of the holes in the floor. Taking\n          Crepsley with him.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          110.\n\n                         FACTORY SPACE\n          SCREAMS from the audience as Murlough descends. Somewhere in\n          mid-fall, Crepsley FLITS, disappears. When Murlough hits the\n          center of the stage, he hits it alone. Dead.\n          As people start for the exits, we see Mr. Tiny'is among them.\n\n                         UPPER FLOOR\n          But as Darren stands, it's not over. Steve grabs Debbie,\n          pushes her to the edge where the rafters are.\n\n                         STEVE\n          Stay back! Or I'll throw her off!\n          I mean it!\n          It sounds like he does. Darren looks intently at Debbie.\n          She looks back. Then, Darren makes CHICKEN CLUCK SOUNDS.\n          Understanding, Debbie tears herself away. To the precipice.\n          But instead of falling, she continues out on a rafter.\n          Steve slides out after her. But as he reaches for her, she\n          deftly skips across the rafters, jumps back to the floor.\n          Before Steve can follow, Darren cuts him off. Below them:\n          rows of jagged, rusty pipes. The remains of a pumping\n          station. Shredded now, broken. Waiting to impale.\n\n                         DARREN\n          It's over, Steve.\n\n                         STEVE\n          Is it?\n          Steve lunges. They come together, trading shots, stumbling\n          but still having to make the rafters. A missed footfall will\n          be their last. They separate, try to gain position.\n\n                         STEVE\n          You wanna hear something funny?\n          After your funeral, I went to see\n          your parents.\n          They continue circling.\n\n                         STEVE\n          And they were fine. They acted\n          like they barely remembered you.\n\n                         DARREN\n          Liar.\n\n                         \n\n                         \n\n                         \n\n                         \n          Darren lunges, but Steve's ready. He CUFFS Darren in the\n          head. Darren falls, ends up hanging. Steve looms, smiling.\n\n                         STEVE\n\n                         (SMILES)\n          And your sister. She was moving\n          into your room. They had a yard\n          sale. I bought some of your stuff.\n          Steve's foot on his hand. Darren about to die. Oddly:\n\n                         DARREN\n          Did you steal money from my mom's\n          purse?\n\n                         STEVE\n          What?\n\n                         DARREN\n          Did you?\n          Darren hanging there, dead grim. Steve's curious.\n\n                         STEVE\n          Why do you ask? Is knowing that\n          gonna help you rest in peace?\n\n                         DARREN\n          No. It's just practically the last\n          thing that ever happened between me\n          and my dad was I was arguing with\n          him.\n\n                         STEVE\n\n                         (FLIP)\n          Least you had a dad to argue with.\n          A fury building in Darren.\n\n                         DARREN\n          I was telling him he was wrong\n          about you. That's the last time we\n          had together. Fighting about you.\n\n                         STEVE\n          Hate to tell ya. Your dad was\n          right. How do you think we got the\n          money for the dumb tickets? I took\n          it. Just like I'm gonna take you.\n          Steve jams his foot down into Darren's face, but Darren hangs\n          on. In fact, with a superhuman surge, he hauls himself up,\n          no matter how many times Steve hits him.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          112.\n          WHAM! Darren lets Steve have it.\n\n                         DARREN\n          I miss him.\n\n          WHAM!\n\n                         DARREN\n          Do you understand?\n\n          WHAM!\n\n                         DARREN\n          I miss him so much.\n          WHAM! Steve's arm pinwheel for balance. He's going over.\n          But just as he pitches off the end rafter...\n          Darren catches him by his belt. Nearly bent backward, he\n          hangs back over the abyss. If Darren lets go, Steve will\n          fall into the spikes below.\n          Crespley steps up beside Debbie, knows what Darren should do.\n\n                         CREPSLEY\n          Kill him, Darren. Do it now so you\n          won't have to do it later.\n          Darren looks at Steve. A moment they'll remember forever.\n\n                         DARREN\n\n                         (SOFTLY; SADLY)\n          No. He used to be my friend.\n          Darren flings Steve back the other way. To safety.\n\n                         DARREN\n          Start running. Don't ever stop.\n          Steve hesitates. It wasn't supposed to be like this. Darren\n          starts off the rafter toward him. One last look of hate.\n\n                         STEVE\n          Next time...\n          And he's gone. Disappearing into the dark.\n          Darren joins Debbie. Nothing left to hide.\n\n                         DEBBIE\n          Sam?\n          Darren shakes his head. Sam didn't make it.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          113.\n          She understands. Darren looks at Crepsley. He's a mess.\n\n                         DARREN\n          Are you gonna be okay?\n\n                         CREPSLEY\n          I just need to catch my breath.\n          For a few days. Maybe a week.\n\n                         DARREN\n          You think I made a mistake, don't\n          you?\n\n                         CREPSLEY\n          No. I think that you proved\n          yourself human after all.\n          Human. As Darren absorbs this kindness, smiles.\n\n                         DARREN\n          Half human. What now?\n\n                         CREPSLEY\n          What do you mean?\n\n                         DARREN\n          There's a war on, isn't there?\n          Crepsley shrugs.\n\n                         DARREN\n          This world is crossed by fences.\n          You have to decide which side you\n          stand on.\n\n                         CREPSLEY\n          Yes, yes. Black and white fences\n          crossing very gray fields.\n\n                         DARREN\n          It's not gray. I've met the bad\n          guys. They need to be stopped.\n\n                         CREPSLEY\n          I'm not sure it's my fight.\n\n                         DARREN\n          But you said it. There's no in\n          between. And the power of being\n          alone is never going to be greater\n          than the weakness. It's our fight.\n\n                         CUT TO:\n\n                         \n\n                         \n\n                         \n\n                         \n\n          114.\n\n          EXT. FACTORY - NIGHT\n\n          As PATRONS try to get as far as they can as quick as they\n          can. We see Steve duck out, blending in.\n          Mr. Tiny's Lincoln Continental pulls up. As Steve gets in...\n\n                         CUT TO:\n\n          EXT. FIELD - NEAR THE CAMPSITE - NIGHT\n\n          Mr. Tall, Evra, Debbie, Darren and Crepsley. Crepsley sets\n          Sam's body down in the grass. It's covered with one of Madam\n          Truska's tent silks. As Crepsley's eyes meet Darren's...\n\n                         DARREN\n\n                         (A WHISPER)\n          He was a good kid. It's weird, but\n          I remember things about him even\n          though I wasn't there when they\n          happened. Even though it's\n          impossible.\n          A moment as Crepsley nods sadly at this most singular boy.\n\n                         CREPSLEY\n          His blood is in you.\n\n          MR. TALL\n          I'll deal with the police when they\n          come. What I'll say, I don't know.\n\n                         DEBBIE\n          Say what happened. Some crazy guy\n          showed up. Sam was in the wrong\n          place at the wrong time.\n          They're all quiet a moment.\n\n                         EVRA\n          He was brave.\n\n                         DEBBIE\n\n                         (SADLY)\n          For the only time in his life.\n\n                         DARREN\n          He didn't die in vain.\n          A beat.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          115.\n\n          MR. TALL\n          Time to fly or flit or whatever you\n          call it. The sun won't wait all\n          night.\n\n                         CREPSLEY\n          Actually, that's exactly what it\n          does.\n          Mr. Tall manages a smile, considers the sky a moment.\n\n          MR. TALL\n          Time will tell what this night has\n          brought us.\n\n                         CREPSLEY\n          Yes. Keep my coffin ready, would\n          you?\n\n          MR. TALL\n          Always.\n          As they exchange farewells, Debbie turns to Darren.\n\n                         DEBBIE\n          Do you think we'll meet again?\n\n                         DARREN\n          You never know.\n          As she hugs him tight, she whispers in his ear:\n\n                         DEBBIE\n          I hope so...\n\n                         DARREN\n\n                         (WHISPERS BACK)\n          Hope is a good word. I hope so,\n          too.\n          And so goodbye. Darren and Crepsley start down the road.\n\n                         DARREN\n          Where are we going?\n\n                         CREPSLEY\n          To meet the Vampire Generals. War\n          clouds are forming. A storm is\n          coming. And I have a feeling\n          you're needed much more than I am.\n\n                         \n\n                         \n\n                         \n\n                         \n\n          116.\n\n                         DARREN\n          So what are we waiting for? Let's\n          go.\n          Crepsley offers his hand.\n\n                         CREPSLEY\n          Take my arm.\n          Darren shakes his head, doesn't need it.\n          He shimmers, flits into the night.\n          Crepsley laughs to himself. As he follows...\n\n          FADE TO BLACK.\n\n\n\n\n\n\n\nCirque du Freak: The Vampire's Assistant\nWriters :   Brian Helgeland\nGenres :   Action  Adventure  Fantasy  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:22:35.328966"}